{
  "nome_completo": "Abraham Wald",
  "nome_curto": "Abraham Wald",
  "ano_nascimento": "1902",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wald/",
  "lugar_nascimento": "Kolozsvár, Hungary (now Cluj, Romania)",
  "lugar_morte": "Travancore, India",
  "biografia": "Abraham Wald\nwas born into a Jewish family in Hungary. It was a family of intellectuals but, being Jewish, they were forced to earn their living in trades well below their abilities. At this time both primary and secondary schools in Hungary required pupils to attend on Saturdays and the Wald family could not allow their son to attend school on the Jewish Sabbath. As a result Abraham did not attend either primary of secondary school and was educated at home by members of his family. This certainly did not put him at a disadvantage from an educational point of view for his family were very knowledgeable and competent teachers.\nAfter World War I much of the land that had been part of Hungary was given to neighbouring countries and at that time Cluj became part of Romania. Wald was allowed to attend the University of Cluj but it appears that this was not made easy for him because he was Jewish. However his outstanding abilities in mathematics led him to wish to continue to undertake mathematical research and in\n1927\nhe entered the University of Vienna to study with Karl\nMenger\n. He worked under\nMenger\n's supervision on geometry and was awarded his doctorate in\n1931\n.\nVienna in the\n1930\ns was no place for a young Jewish man to obtain an academic position, no matter how talented. In fact there were few academic positions open at all. The only way that Wald could support himself so as to be able to continue with his research was to take employment. This he did taking the position of mathematics tutor to Karl Schlesinger, a leading Austrian banker and economist. Between\n1931\nand\n1937\nWald published\n21\npapers on geometry which\nMenger\ndescribes in\n[\n5\n]\nas:-\n... deep, beautiful and of fundamental importance.\nHowever his work with Schlesinger did not only give him financial security and hence the opportunity to undertake research in geometry. It also gave him an interest in applying his mathematical skills to the problems in economics and econometrics which interested Schlesinger. During this period Wald published\n10\npapers on economics and econometrics, and he also published an important monograph in\n1936\non seasonal movements in time series. The main aim was to give methods to eliminate this seasonal variation. In\n[\n8\n]\nMorgenstern\nwrites that in this monograph Wald:-\n... developed techniques superior to all others.\nAn indication of the problems that Wald had in Vienna at this time because he was Jewish is indicated by the fate of\nMenger\n's seminar. Wald was a member of this seminar which included lectures by both members of the seminar and also invited guests. Speakers raised open problems, and reported on recent publications and research. Wald reported to the seminar on his work in econometrics, in particular he wrote a paper for the seminar on the existence of a solution to the competitive economic model. However, the seminar was forced to stop work in\n1936\nafter it was criticised for its Jewish contributors, one of whom of course was Wald. If life was difficult for a Jew in Vienna in\n1936\n, they would soon become much worse.\nIn\n1938\nthe Nazi forces invaded Austria. For a Jewish person like Wald conditions under the Nazis were at best extremely difficult and at worst very dangerous. The Cowles Commission invited him to the United States to do econometric research in the United States and he left Austria in the summer of\n1938\n. The move to the United States almost certainly saved his life for all but one of the nine members of his family left behind died in the gas chambers of the Nazi concentration camp at Auschwitz. By September\n1938\nWald was a Fellow of the Carnegie Corporation studying statistics at Columbia University in New York under\nHotelling\n.\nWald remained a Fellow of the Carnegie Corporation until\n1941\nbut by that time he had already begun lecturing at Columbia University which he began in academic year\n1939\n-\n40\n. He was appointed to the Faculty of Columbia University in\n1941\nand he remained on the staff there until his death. In addition to his teaching and research at Columbia, he undertook war work after the United States entered World War II, working on military projects with the Statistics Research Group at Columbia. He used his statistical expertise to develop a method to estimate aircraft vulnerability.\nAs we mentioned above, in Vienna Wald worked on pure mathematics, mostly geometry, and on econometrics. His first pure mathematical work was on metric spaces, an extension of\nSteinitz\n's work to infinite dimensional vector spaces, and some beautiful results on\ndifferential geometry\n.\nWald's most important work, however, was in statistics. In\n[\n14\n]\nWolfowitz, who was first his student, then his colleague and collaborator, described a paper Wald published in the\nAnnals of Mathematical Statistics\nin\n1939\nas:-\n... probably Wald's most important single paper.\nIn this\n1939\npaper Wald\n[\n13\n]\n:-\n... points out that the two major problems of statistical theory at that time, testing hypotheses and estimation, can both be regarded as simple special cases of a more general problem - known nowadays as a \"statistical decision problem\". ... He defines loss functions, risk functions, a priori distributions, Bayes decision rules, admissible decision rules, and minimax decision rules, and proves that a minimax decision rule has a constant risk under certain regularity conditions.\nWald also developed generalizations of the problem of gambler's ruin which play an important role in statistical sequential analysis. He invented the topic of sequential analysis in response to the demand for more efficient methods of industrial quality control during World War II. The idea here is a simple one yet Wald was the first to build it into a statistical theory. It is better to analyse data produced sequentially rather than collect all the data and then analyse it. In this approach one does not choose a fixed sample size but can end the sampling at any time if the results justify it.\nWald was the first to solve the general problem of sequential tests of statistical hypotheses. The optimum property of the sequential probability ratio test was conjectured by Wald in\n1943\nand, in a joint paper with Wolfowitz in\n1948\n, he proved this property. This and related work was very much aimed at practical applications and his theorems on the distribution of the required number of observations, and on the probabilities associated with errors, found immediate applications. His main results on sequential analysis and the theory of decision functions, another topic which was founded by him, were gathered together in his monograph\nSequential Analysis\n(1947)\n.\nOne of Wald's continuing interests from his time working with Karl Schlesinger was economics. He proved important results, perhaps the most significant being the existence of a solution to the competitive economic model which, as we noted above was written for\nMenger\n's seminar. His other work in this area related to\n[\n5\n]\n:-\n... seasonal corrections to time series, approximate formulas for economic index numbers, indifference surfaces, the existence and uniqueness of solutions of extended forms of the Walrasian system of equations of production, the\nCournot\nduopoly problem, and finally, in his much used work written with Mann\n(1943)\n, stochastic difference equations.\nWolfowitz writes in\n[\n1\n]\nthat:-\nOne of his great contributions to statistics was to bring to it mathematical precision in the formulation of problems and mathematical rigour in argument. These qualities, which were often lacking when he began his statistical career in\n1938\n, have transformed the subject - although not necessarily to the satisfaction of everyone.\nIt was not only in research that Wald had a remarkable influence on statistics, but although he only taught for about ten years, he also had a marked influence as a teacher. The same qualities of precision and rigour he showed in research were brought to his teaching but this did not mean that his lectures were complicated. On the contrary his lectures were renowned for their clarity and\n[\n13\n]\n:-\nHe was a master at deriving complicated results in amazingly simple ways.\nThe notes which his students took during his lectures in Columbia were circulated and because of their outstanding clarity they reached students studying statistics at many different universities in the United States.\nAfter Wald emigrated to the United States he met Lucille Lang and the two were married. In\n1950\nWald received an invitation from the Indian government to lecture on statistics in that country. He went to India with his wife and tragically they were both killed in a plane crash.\nFreeman, who attended Wald's lectures at Columbia, writes in\n[\n5\n]\nabout Wald's character:-\nWald was a quiet and gentle man, deeply immersed in his work. He was fairly aloof from small talk, and he had few hobbies. But he was not indifferent to recognition...",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}