{
  "nome_completo": "Avraham Naumovich Trahtman",
  "nome_curto": "Abram Naumovich Trakhtman",
  "ano_nascimento": "1944",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Trahtman/",
  "lugar_nascimento": "Kalinovo, Sverdlovsk oblast, USSR (now Russia)",
  "lugar_morte": null,
  "biografia": "Abram Naumovich Trakhtman\n(\nor Trahtman\n)\nis usually known as Avraham Trahtman. His father was Naum Trakhtman, who was born in the town of Sokiryani\n(\nor Sokyryany\n)\nin the Bukovina region of south-west of Ukraine. Naum was a watchmaker who did not finish his schooling in Romania. Naum Trakhtman's father, Idel Trahtman, was living in Sokiryani during the tragic events of World War II. After the German armies invaded this region, it was given to Romania since they were allies of Germany, then later it was retaken by the Russians. The Trahtman family were Jewish and so suffered greatly during this period. Idel was killed in the Jewish genocide that took place during this period and several of his young grandchildren died from hunger and deprivation. Naum Trakhtman served in the Red Army during World War II but in\n1950\nhe was arrested and beaten to death during interrogations. His arrest was in connection with the many clocks and watches which flooded into the Soviet Union after World War II, something which greatly angered the authorities. Avraham's mother came from the city of Gomel\n(\nnow Homel in Belarus\n)\nand she belonged to the family Vilyatsery whose traditional profession was as turners of wood and metal. The Jewish Vilyatsery family had a tradition to alternate the names Abraham and Aaron.\nAs a young boy, Avraham liked playing draughts\n(\ncheckers\n)\n. He was also good at sports and took part in sporting competitions. He attended the school N\n19\nin Gomel from\n1951\nto\n1962\n. After graduating from this school, he entered the Ural State University in Sverdlovsk\n(\nnow Ekaterinburg or Yekaterinburg\n)\nin\n1962\n. He studied mathematics at university and completed his undergraduate studies in\n1967\nand was awarded his degree. Following this, he was appointed as an assistant in the Department of Computational Mathematics in the Ural Technical University in\n1969\nand continued to teach there until\n1984\nrising to the rank of associate professor. His teaching included courses on linear algebra, applied mathematics, general algebra, statistics, and discrete mathematics. During the years\n1970\n-\n72\nhe undertook research in mathematics in Lev Shevrin's research group at the Ural State University working on semigroup theory. Lev Shevrin was Trahtman's thesis advisor and, despite some deliberate obstacles put in his way due to his being Jewish, Trahtman was awarded his Ph.D. in\n1973\n.\nIn the years before the award of his Ph.D., Trahtman published a number of papers with V A Baranskii\n(\nwritten in Russian\n)\nsuch as:\nHalf-isomorphisms of matrix bands of semigroups with cancellation law\n(1968)\n;\nLattice isomorphisms of matrix bands of nonperiodic commutative semigroups with cancellation law\n(1969)\n; and\nSubsemigroup graphs\n(1970)\n. In\n1971\nhe published the paper\nDie einstufig nichtkommutativen Halbgruppen mit Ausnahme von unendlichen Gruppen\nⓉ\n(\nSingle stage noncommutative semigroups with the exception of infinite groups\n)\nwritten jointly with\nLászló Rédei\n. This paper was not written because the two mathematicians had worked together on a problem, rather it came about as the consequence of both independently having proved the same results at about the same time and deciding that the fairest course of action was to publish a joint paper. Trahtman published\nCovering elements in the lattice of varieties of algebras\n(\nRussian\n)\nin\n1974\nwhich contained material from his Ph.D, dissertation. The paper proved a conjecture made by Evan two years earlier. He then looked at the '\nTarski\nproblem'.\nThe\nTarski\nproblem, which\nAlfred Tarski\nposed in\n1966\n, asked whether semigroups of small order had a finite base for their identities.\nAnatoly Ivanovich Malcev\nand Lev Shevrin also looked at this problem to which Trahtman made a major contribution in proving that all semigroups of order less than six have a finite base for their identities. However, publishing this result proved surprisingly difficult, not for mathematical reasons, but rather for political ones. Trahtman had been investigated by the KGB as a possible spy and this led to difficulties being made when he tried to publish his work. His strong support of the Jewish cause meant that his life as an academic was severely hampered. However, during the late\n1980\ns under Gorbachev's leadership, the policy of 'glasnost' was introduced leading to a much greater freedom of expression and open criticism of the political order became possible throughout the USSR. Trahtman was a strong advocate of democracy and became an influential figure in the Sverdlovsk political associations 'Rally-\n87\n' and 'Democratic Choice', and in the national movements 'Democratic Russia' and the SDPR.\nIn\n1991\n, Trahtman was appointed as an assistant professor in the Department of Mathematics of Sverdlovsk Pedagogical University. He also taught courses in algebra and its applications, and finite mathematics at the Sverdlovsk State Pedagogical Institute. In\n1992\nhe was able to leave the USSR and emigrate to Israel following the breakup of the former Soviet Union. However, he had no academic position in Israel and, being one of a huge wave of immigrants leaving the former Soviet Union, he struggled to find any work at all. He had various jobs in Israel including maintenance work and a stint as a security guard before being appointed as a part-time lecturer in the Pre-education Department of the Hebrew University, Jerusalem, in\n1994\n. In the following year he was appointed at Bar-Ilan University, in Ramat Gan near Tel Aviv, largely due to the efforts of Stuart Margolis, a professor at the Department of Mathematics at Bar-Ilan University. Margolis commented\n[\n6\n]\n:-\nWhen he applied for work at Bar-Ilan, a colleague of mine noticed that Avraham was in the same field as mine. I had heard of him before, as he had written very important papers. When he applied for a job in the mathematics department, he was hired to teach and do research.\nMargolis also remarked\n[\n2\n]\n:-\nThe first time I met him he was wearing a night watchman's uniform.\nAnd is quoted in\n[\n4\n]\n:-\n... here is a guy who had a good reputation for his work in the Soviet Union and couldn't get work.\nAt Bar-Ilan University, Trahtman taught courses in discrete mathematics, theory of sets, algebra, analytical geometry, mathematical logic, finite automata, formal languages, rings and modules, and differential equations. His research interests have, however, have continued to be related to the topics on which he first began working. He explains:-\nMy first publications were\n[\nin semigroup theory\n]\n, in particular, the solution of the\nTarski\nproblem ..., the properties of finite semigroup generates class of locally testable semigroups and automata. Locally testable automata with generalizations and synchronizing automata are still the main topics for me. The package TESTAS realizes some my algorithms in this area.\nHe created the computer:-\n... package TESTAS for verification of local testability and its generalizations\n(\nthreshold, right, left, bilateral, piecewise and other\n)\nfor both transition graphs of automata and transition semigroups, for checking synchronizability and finding synchronizing words, for finding transition semigroup of automaton.\nHis greatest achievement, however, has been in solving the 'Road Colouring Problem'. The problem basically concerns an undirected graph and asks if its edges can be labelled by colours so it is possible to give a list of colours so that, no matter which vertex one starts from, then following the path indicated by the colours one will always arrive at the same specified vertex. The problem was first proposed by Benjamin Weiss, Roy L Adler and L Wayne Goodwyn. A more technical description of what Trahtman achieved is given by him in the abstract for seminars he has given on the Road Colouring Problem. For example, the abstract of a seminar he gave on\n4\nNovember\n2007\nreads:-\nA synchronizing word of a deterministic automaton is a word in the alphabet of colours\n(\nconsidered as letters\n)\non its edges that maps the automaton to a single state. A colouring of edges of a directed graph is synchronizing if the colouring turns the graph into a deterministic finite automaton possessing a synchronizing word. The road colouring problem originated in\n1970\nand was stated explicitly in\n1977\nby Adler, Goodwyn and Weiss for a strongly connected directed finite graph with constant outdegree of all its vertices where the greatest common divisor of lengths of all its cycles is one. The edges of the graph are unlabelled. The road colouring problem is connected with the problem of existence of synchronizing word for deterministic complete finite automaton. The problem is important in automata theory: a synchronizing colouring makes the behaviour of an automaton resistant against input errors since, after detection of an error, a synchronizing word can reset the automaton back to its original state, as if no error had occurred. The problem appeared first in the context of symbolic dynamics. It evoked noticeable interest among the specialists in the theory of graphs, automata and symbolic dynamics and is discussed even in \"Wikipedia\", the popular Internet Encyclopedia. Together with the Cerny conjecture, the road colouring problem belongs to the most fascinating mathematical problems in the theory of finite automata. We present a solution of the road colouring problem.\nMarcus du Sautoy give this less technical version in\n[\n4\n]\n:-\nYou have a map marked with lots of cities\n(\nrepresented by dots\n)\nand a set of roads running between these cities\n(\nthe roads are then lines joining the dots\n)\n. The roads are all one-way roads so you can only go along them in one direction. Suppose you live in one of the cities on this map. I'm in another city. You want to give me instructions which will get me from my city to your city. But you don't know where I am. Is there a way to colour the roads and a set of instructions like\n(\ntake a red road followed by a blue road followed by another blue road followed by a yellow road\n)\nso that where ever I am in the map, the set of instructions will always get me to your city. Quite amazingly you can do this, though there are some technical conditions that limit the kind of network for which this works. It isn't possible on every network. These network problems are really fun to play about with. Quite often it just requires a cunning new way to think about the problem and a solution drops out. Unlike\nFermat\n's Last Theorem which required lots of technical and sophisticated mathematical techniques to crack, the maths behind Trakhtman's solution is not complicated, it just required a clever new way to look for the solution. In a way it's a bit like trying to come up with a universal set of rules that will solve a sudoku puzzle regardless of how the numbers are put into the boxes.\nStuart Margolis said\n[\n6\n]\n:-\nHe is brilliant with a high IQ. ... He is shy, reserved and very modest. He intentionally offered his paper to an Israeli journal even though any mathematics journal in the world would be overjoyed to get it. Now he's working on a real algorithm to implement his solution.",
  "math_areas": [
    "Algebra",
    "Calculus"
  ]
}