{
  "nome_completo": "Adolf Abraham Halevi Fraenkel",
  "nome_curto": "Abraham Fraenkel",
  "ano_nascimento": "1891",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fraenkel/",
  "lugar_nascimento": "Munich, Germany",
  "lugar_morte": "Jerusalem, Israel",
  "biografia": "Abraham Fraenkel\n's parents were Sigmund Aviezri Fraenkel\n(1860\n-\n1925)\nand his wife Charlotte Chaja Sara Neuburger\n(1868\n-\n1965)\n, both of whom were born in Munich, Bavaria. Sigmund, who was a wool merchant, and Charlotte were married in Munich on\n3\nNovember\n1889\n. We should note at this point that the family was Jewish and in fact Sigmund, in addition to being a merchant, was a leader of Orthodox Judaism in Bavaria and an economist working for the German government. Abraham, the subject of this biography, was known as Adolf until later in his life when he went to Palestine and from that time on called himself Abraham. However, to avoid confusion, we will refer to him as Abraham throughout this biography. He was the eldest of his parents' children having younger siblings Joel Eugen\n(\nborn\n25\nMarch\n1892)\n, Else Lea\n(\nborn\n11\nJuly\n1896)\n, and Paula Tirza\n(\nborn\n29\nMay\n1901)\n.\nFraenkel began his education at the age of five when his parents employed a private tutor for the young child. He learnt Hebrew from this private tutor and then attended an elementary school in Munich. He entered the Luitpold\nGymnasium\nwhich had been founded by Prince Luitpold of Bavaria in\n1891\n, the year in which Fraenkel was born. This Gymnasium served the eastern part of Munich and was situated in the Alexandrastrasse opposite the National Museum. Fraenkel was an outstanding pupil, receiving the grade \"very good\" in every subject he studied. He graduated from the Gymnasium in July\n1909\n. He had already written articles on the religious calendar systems:\nBestimmung des Datums des jüdischen Osterfestes für die Zeitrechnung der Mohammedaner\nⓉ\n(\nDetermining the date of the Jewish Passover during the  Moslem era\n)\n(1908)\n;\nEine Formel zur Verwandlung jüdischer Daten in mohammedanische\nⓉ\n(\nA formula for converting between Jewish and Muslim dates\n)\n(1909)\n; and\nDie Berechnung des Osterfestes\nⓉ\n(\nThe determination of Easter\n)\n(1910)\n. These articles combined his interests in religion and mathematics.\nIn common with most students in Germany in his time, Fraenkel studied for periods at different universities. He spent a semester at the Ludwig-Maximilian University of Munich, then went to the University of Marburg where he attended courses by\nKurt Hensel\n, Ernst Richard Neumann\n(1875\n-\n1955)\nand\nErnst Hellinger\n. He then went to the Friedrich-Wilhelm University of Berlin\n(\nwhich has been known as the Humboldt University of Berlin since\n1949)\nwhere he was taught by\nHermann Amandus Schwarz\n,\nGeorg Frobenius\nand\nFriedrich Schottky\n. He spent the final year of his studies at the University of Breslau before returning to the University of Marburg where, having been advised by\nKurt Hensel\n, he submitted his doctoral thesis\nÜber die Teiler der Null und die Zerlegung von Ringen\nⓉ\n(\nOn divisors of zero and the decomposition of rings.\n)\n. He was awarded his doctorate summa cum laude after his oral examination in January\n1914\nand his thesis was published in\nCrelle\n's Journal in\n1915\n. He decided that he wanted to become an academic\n[\n5\n]\n:-\n... despite the restricted possibilities for advancement open to Jews ...\nand immediately began working on his\nhabilitation\nthesis.\nOf course, graduating in\n1914\nimmediately presented problems due to the outbreak of World War I. Fraenkel served in the German army, mostly involved in the medical corps but also for a short time in the meteorological service. However, he had completed enough work on his habilitation thesis\nÜber einfache Erweiterungen zerlegbarer Ringe\nⓉ\n(\nOn simple extensions of separable rings\n)\nthat he was able to submit it to the University of Marburg in\n1915\nbut, by this time serving in the army, he was not in a position to take the examinations and deliver the inaugural lecture which were required to complete an appointment as a\nPrivatdocent\n. In January\n1916\nhe was serving with the army in Serbia when he was taken seriously ill and allowed leave in which he might recover his health. He took the opportunity to return to Marburg where he took the required examinations, gave his inaugural lecture and became a Privatdocent. However, he could not begin teaching at this time as he had to return to continue his army service. While he was serving in the army he worked on writing his first book on set theory,\nEinleitung in die Mengenlehre\nⓉ\n(\nIntroduction to set theory\n)\n.\nAfter being released from military service following the end of World War I, Fraenkel began lecturing at the University of Marburg in the winter semester of\n1918\n-\n19\n. It was around this time that he met Wilhelmina Malka A Prins who was studying German. They married on\n28\nMarch\n1919\n[\n28\n]\n:-\n[\nFraenkel\n]\nthought their partnership was ideal because apart from religion and Zionism, they had no interests in common. They complemented each other perfectly and would eventually have four children together\n[\ntwo sons Benjamin and Aviezri, two daughters Tirza and Rachel\n]\n.\nFinding a home in which to live was very difficult in post-war Germany and Fraenkel and his wife lived in a flat in\nKurt Hensel\n's Marburg home. Fraenkel had submitted his set theory book\nEinleitung in die Mengenlehre\nⓉ\n(\nIntroduction to set theory\n)\nto the publisher Teubner, but it had been rejected. However, Springer agreed to publish the work and it appeared in\n1919\n. George Adam Pfeiffer\n(1889\n-\n1943)\n, who had served in the U.S. Army as an instructor in meteorology at Princeton University during World War I, writes in a review\n[\n24\n]\n:-\nThe author proposes to give an introduction to the theory of infinite sets which can be understood by anyone who has sufficient interest and patience. No other prerequisites are set down. The author tells that he had experience in this sort of presentation during the recent war, when he lightened many wearisome hours by explaining Mengenlehre to his comrades in the field. Among the chapter headings are: the concept of set; the concepts of equivalence and infinite sets; countable sets; the continuum; the concept of cardinal number; comparability of cardinal numbers; operations on cardinal numbers; ordered sets and types of order; linear point sets; well-ordered sets, well-ordering and its significance; logical paradoxes and the concept of set. The choice of topics and the extent to which each topic is treated are well determined. Scientific honesty is not sacrificed for\n(\napparently\n)\neasy assimilation by the reader. ... The book should be very useful for upper collegiate classes in mathematics and for those interested in mathematical philosophy in a general way.  It should help to introduce to a wider circle the ideas and methods of a fundamental and interesting branch of mathematics.\nIn\n1921\nFraenkel published\nDie neueren Ideen zur Grundlageng der Analysis und Mengenlehre\nⓉ\n(\nThe newer ideas in the basics of calculus and set theory\n)\nand, in the following year,\nÜber den Begriff \"definit\" und die Unabhängigkeit des Auswahlaxioms\nⓉ\n(\nOn the notion of 'definite' and the independence of the  axiom of choice\n)\n,\nZu den Grundlagen der Cantor-Zermeloschen Mengenlehre\nⓉ\n(\nOn the foundations of  Cantor-Zermelo set theory\n)\nand\nAxiomatische Begründung der transfiniten Kardinalzahlen\nⓉ\n(\nAxiomatic justification of transfinite cardinal numbers\n)\n. The third of these was dedicated to\nKurt Hensel\nfor his sixtieth birthday. This work presented in these papers came out of Fraenkel's research on the independence of\nZermelo\n's set theory postulates. In particular he gave simpler formulations of certain axioms and added a new axiom of \"replacement\". Fraenkel was promoted to professor in Marburg in\n1922\n. In\n1928\nhe left Marburg and spent one year as a full professor at the Christian-Albrecht University of Kiel. He states clearly in\n[\n5\n]\nthat had no complains about anti-Semitism at either Marburg or Kiel but, of course, he was aware of the problem\n[\n5\n]\n:-\nAs concerns the universities, anti-Semitic tendencies were in the\n1920\ns reversed from the situation before\n1918\n- that is, in Bavaria they were much more pronounced than in the North and West of Germany. The naming, though not the preferment, of Jews to positions as full professors remained infrequent with the exception of the new city universities of Frankfurt and Hamburg.\nFraenkel was a fervent Zionist and he left Kiel to teach at the Hebrew University of Jerusalem from\n1929\n, joining the university four years after its foundation. Now one might imagine that Fraenkel, as a Zionist, would be enthusiastic about accepting an invitation from the Hebrew University of Jerusalem but this would be an over simplification. In fact he was very concerned that, since the Hebrew University was a secular institution, it might not be an appropriate place for him. He had earlier written an article where he expressed concerns:-\n... that the Hebrew University would be a forum for heretical \"scientific\" studies of the Bible and Jewish sacred texts.\nHe wrote to Rabbi Abraham Isaac Kook asking for advice on whether, because of its secular nature, he should accept an invitation to teach the Hebrew University. The Rabbi replied that he should go there and work to raise its spiritual level. Fraenkel changed his first name from Adolf to Abraham after his arrival in Palestine. At the Hebrew University, Fraenkel became dean of the faculty. He entered into a vigorous correspondence with\nAlbert Einstein\nwho was deeply interested in the Hebrew University and the possibility of becoming rector. He wrote to Fraenkel saying:-\n... there is no more objective and pure judge than you ...\nto give him accurate information.\nEinstein\nalso gave Fraenkel advice on physics appointments to the Hebrew University. At this time there were many difficulties at the Hebrew University regarding its future direction, and Fraenkel had many battles over these issues.\nHe had been given a two year leave from Kiel but had hoped to be able to remain at the Hebrew University. After two years in Jerusalem, however, the poor economic situation there meant that he requested leave and, in the summer of\n1931\n, returned to his position at Kiel. Back in Kiel, he was approached by Erhard Tornier who asked Fraenkel for a position in Kiel so that he might learn from him. Fraenkel agreed but, in\n1932\n, Tornier joined the Nazi party and, after Hitler came to power in the early part of\n1933\n, Tornier made it clear that he wanted to inherit Fraenkel's chair. On\n1\nApril\n1933\nthere was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter the university. On\n7\nApril\n1933\nthe Civil Service Law was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired but there were exemptions for those who had fought for Germany in World War I. Fraenkel qualified under this exemption clause but, on\n25\nApril, he applied for leave of absence. He received a reply from the Dean of the Faculty, Professor Wesle, who was a Nazi appointment, stating\n[\n3\n]\n:-\n... with satisfaction that during his whole service at Kiel University, he had always declared himself to be a Jew and not a German.\nHe sought to return to the Hebrew University of Jerusalem and, on\n9\nSeptember his leave was granted. In October he was given permission to change his residence. Initially his time in Jerusalem was difficult since he had problems getting his salary. Even when he did receive some of the money that he was due, it was paid into a German account which was almost impossible to access from Palestine.\nFraenkel was to spend the rest of his career at the Hebrew University, being appointed the first Dean of the Faculty of Mathematics, and serving as the rector of the university during\n1938\n-\n40\n. It was during these years that\nAbraham Robinson\n, who had emigrated from the United States to Palestine when a high school pupil in\n1933\n, was his student. These were difficult times for the Hebrew University which had severe financial difficulties. It could not afford to continue to pay Fraenkel's salary but it was saved by the American Friends of the Hebrew University in New York who stepped in to subsidise Fraenkel's chair.\nAfter the war ended, he was approached by the University of Kiel in March\n1946\nto return to the chair of mathematics there. He refused, writing to the Dean of the Philosophical Faculty of Kiel, Professor Unsöld, on\n18\nJune\n1946\n[\n3\n]\n:-\n... it would be absurd to expect me now to leave my people, my country and my University for a chair in another country. Even without, however, taking into account my personal attitude ... I think it would be even from a purely objective point of view, an impossible idea for any Jew to live again in a country whose population - to a large extent actively and for the rest almost entirely passively - has been responsible for the extermination of more than five millions of Jews, the third part of my People, under conditions of cruelty not experienced for thousands of years. It would be intolerable to live among such a nation.\nOn\n2\nFebruary\n1947\n, Fraenkel wrote to Erich Kamke\n(1890\n-\n1961)\nwho had been dismissed from his professorship in\n1937\nbecause his wife was Jewish. Fraenkel wrote\n(\nin English\n)\n[\n3\n]\n:-\nFeeling the desire of expressing my sincere wishes to the, alas, very few of my former colleagues who have not delivered themselves to Nazism, I should like to send you my kindest personal regards. I assume that Tübingen has suffered less than the big cities during the war, and I confidently hope that you are well. On a recent stay in U.S.A. during a few months, I heard of quite a number of colleagues, but I did not obtain news about you. I wonder if the Tübingen University still works, or if you have gone over to another place. You will understand that I had to decline the call to go back to Kiel. In a country being responsible for the cruel murder of five million Jews I could not breath.\nFraenkel had been a member of the\nGerman Mathematical Society\nfrom\n1914\nuntil his membership was terminated in\n1939\n. The Society was re-established by Erich Kamke in\n1948\nand he wrote to those who had been expelled inviting them to rejoin. Fraenkel refused and, later in January\n1951\n, he again wrote to Kamke acknowledging receipt of the restarted\nJahresbericht\nwith its memorial table of those mathematicians who had died since\n1933\n, saying that the memorial table and the new democratic spirit pleased him, but he still could not rejoin.\nAs we saw above, Fraenkel's first work was on\nHensel\n's\np\np\np\n-adic numbers and on the theory of rings, but he is best known for his work on set theory, publishing his first major work on the topic\nEinleitung in die Mengenlehre\nⓉ\n(\nIntroduction to set theory\n)\nin\n1919\n. He made two attempts, in\n1922\nand\n1925\n, to put set theory into an axiomatic setting that would avoid the paradoxes. He tried to improve the definitions of\nZermelo\nand, within his axiom system, he proved the independence of the\naxiom of choice\n. His system of axioms was modified by Skolem in\n1922\nand\n1928\nto give what is today known as the ZFS system. This is named after\nZermelo\n, Fraenkel and\nSkolem\n. Within this system it is harder to prove the independence of the axiom of choice and this was not achieved until the work of\nPaul Cohen\nin\n1963\n. Fraenkel wrote several important books.\nYou can see some brief extracts from reviews of these books at\nTHIS LINK\nFraenkel was also interested in the history of mathematics and wrote a number of important works on the topic. He wrote on\nCarl Friedrich Gauss\n's work in algebra in\n1920\nin\nMaterialien für eine wissenschaftliche Biographie von Gauss\nⓉ\n(\nMaterials for a scientific biography of Gauss\n)\n, then in\n1930\n, he published an important biography of\nGeorg Cantor\nin the\nJahresbericht der Deutschen Mathematiker-Vereinigung\n. Also in\n1930\nhe published\nBeliefs and Opinions in Light of the Natural Sciences\n(\nHebrew\n)\nin which he attempted to look at the progress of science in the light of his religious views. For example he writes\n(\nsee the English translation in\n[\n29\n]\n)\n:-\n... when the Torah describes the formation of the world, and more generally when it speaks about what goes on in nature, in principle, it uses the rule that \"the Torah speaks in the language of people.\" It is not only that this rule is suitable with respect to the purpose of the Torah, which is not to explain the natural sciences; rather it is essential that it be this way. Had the Torah described the precise processes of natural science, then it would not have been understood in the periods prior to the discovery of that level of science. Each generation would have had to change its stance vis-à-vis the Torah in accordance with the progress of their scientific theories.\nFraenkel also published many articles relating to Jewish mathematics and Jewish mathematicians, for example\nJewish mathematics and astronomy\n(1960)\n.\nA number of Fraenkel's students have made important contributions to mathematics including\nAbraham Robinson\nwho succeeded him when he retired from his chair at the Hebrew University in\n1957\n. Fraenkel's time at the Hebrew University had been one of many difficulties, particularly in the last ten years of his career. The War of Independence fought in\n1948\nleft Jerusalem divided between Jordan and Israel. The Hebrew University, on the top of Mount Scopus, was in a demilitarised zone and was only accessible by convoy once every two weeks. After retiring Fraenkel did not give up teaching, continuing to lecture at Bar Ilan University, near Tel Aviv.\nWe have already mentioned that Fraenkel was a fervent Zionist. As such he was involved in political activity being a member of the Vaad Leumi, the executive committee of the Palestinian Jewish National Assembly at the time of British mandate. Fraenkel was also a member of the Merkaz Ruhani religious movement within Zionism. This party promoted Jewish religious education, established religious schools and strongly promoted the authority of the chief rabbinate over all Jewish matters such as marriage and divorce.\nFinally, let us mention that Fraenkel's brother Joel Eugen married Esther and they had a son Aviezri who became a mathematician making major contributions to combinatorial game theory.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}