{
  "nome_completo": "Abraham Ezechiel Plessner",
  "nome_curto": "Abraham Plessner",
  "ano_nascimento": "1900",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plessner/",
  "lugar_nascimento": "Lódz, Russian Empire (now Poland)",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Abraham Plessner\n's father was Ezekiel Plessner, a merchant and owner of a textile factory, and his mother was Marie Niekritsch. At this time Lódz, the city of his birth, was the main centre for textile production in the Russian Empire, with many cotton mills. The city had grown rapidly with the population of\n15\n,\n000\nin around\n1850\ngrowing to a population of\n300\n,\n000\nby the time Abraham was born. Over\n30\n% of the population was, like Abraham's family, Jewish. Abraham attended secondary school in Lódz from\n1909\nto\n1918\n. The particular Oberrealschule he attended was set up to educate the children of tradesmen. Because of the political changes brought about by the military situation in World War I, he had lessons in three different languages during his years at the school. From the time he entered in\n1909\nuntil\n1916\nthe language of instruction was Russian. However a major battle was fought over Lódz at the end of\n1914\nand, by early\n1915\nthe city was in the hands of the Germans. In\n1916\nthe language of instruction at the Oberrealschule was changed to German. However, with Polish independence coming at the end of the war, the language of instruction was changed from German to Polish and, for his final year at school, Plessner was taught in Polish.\nIn\n1919\nhe entered the University of Giessen and studied under\nLudwig Schlesinger\nand\nFriedrich Engel\n.\nSchlesinger\nhad taught at the universities of Berlin, Bonn and Cluj before taking up a chair at Gissen in\n1911\n, while\nEngel\nhad moved to Giessen to take up the chair of mathematics in\n1913\n.\nSchlesinger\nquickly saw that his young student was very talented so recommended that he follow the traditional pattern for German students at this time and study at a number of different universities. The two best places for mathematics were,\nSchlesinger\nsaid, Göttingen and Berlin; someone as talented as Plessner should certainly study at the top places. After three semesters at Giessen, Plessner followed\nSchlesinger\n's advice and moved on.\nIn\n1921\nPlessner went to the University of Göttingen where, between May and August, he took courses on\nDirichlet\nseries and\nGalois theory\nby\nEdmund Landau\n; algebraic number fields by\nEmmy Noether\n; and the calculus of variations by\nRichard Courant\n. He also attended\nCourant\n's seminar and\nLandau\n's seminar. Then in the winter seminar of session\n1921\n/\n22\n, he studied in at the University of Berlin where\nRichard von Mises\nlectured on differential and integral equations and\nLudwig Bieberbach\non\ndifferential geometry\n.\nIssai Schur\nwas leading a seminar on algebra which Plessner attended. However, even though he was a young man, Plessner's health was not good. He underwent a knee operation in\n1922\nwhich saw him spend seven months in the University hospital. After this he walked with difficulty, usually using a cane as an aid to walking.\nPlessner obtained his doctorate from Giessen in\n1922\nfor a thesis on conjugate trigonometrical series entitled\nZur Theorie der konjugierten trigonometrischen Reihen\nⓉ\n(\nOn the theory of conjugate trigonometric series\n)\n. Then he worked in Marburg with\nKurt Hensel\nediting\nLeopold Kronecker\n's collected works. During his time in Marburg he published a number of important papers containing theorems and concepts that are studied today. His paper\nÜber die Konvergenz von trigonometrischen Reihen\nⓉ\n(\nOn the convergence of trigonometric series\n)\n(1926)\ncontains what today is sometimes known as the\nKolmogorov\n-Seliverstov-Plessner theorem or Plessner's theorem. Plessner's theorem states that if a trigonometric series converges everywhere in a set\nE\nof positive measure, then its conjugate series converges almost everywhere in\nE.\nThe paper\nÜber das Verhalten analytischer Funktionen am Rande ihres Definitionsbereichs\nⓉ\n(\nOn the behavior of analytic functions on the edge of their domain\n)\n(1927)\ncontains a result which is today also called Plessner's theorem, concerning the boundary behaviour of functions which are meromorphic in the unit disk. More precisely, Plessner's theorem states that any\nholomorphic\nfunction on the unit disk partitions the unit circle, modulo a null set, into two disjoint pieces such that at each point of the first piece, has a non-tangential limit, and at each point of the second piece, the cluster set of any\nStolz\nangle is the whole plane. This paper also contains a definition of what today is called a 'Plessner point'. A Plessner point for a\nmeromorphic\nfunction in the unit disc is a point of the unit circle such that in every\nStolz\nangle at the point the cluster set of the function at the point is the whole plane. In\nEine Kennzeichunung der totalstetigen Funktionen\nⓉ\n(\nAn identification of absolutely continuous functions\n)\n(1929)\n, Plessner characterised the absolutely continuous measures among the class of\nBorel\nmeasures. Also while at Marburg he published the book\nLebesguesche Integrale und Fouriersche Reihen\nⓉ\n(\nLebesgue integrals and Fourier series\n)\nwritten jointly with his former teacher at Giessen,\nLudwig Schlesinger\n. The book which appeared in\n1926\n, was reviewed by\nMarshall Stone\nin\n[\n5\n]\n.\nStone\nwrites:-\n[\nThe book\n]\nis intended to be an introductory treatment of the theory of\nLebesgue\nintegration, and is consequently more restricted and more elementary than the treatises of\nHausdorff\n,\nCarathéodory\n, and\nHahn\n. In point of difficulty, it stands between these and\nde la Vallée Poussin\n's monograph in the\nBorel\nseries. The book is divided into six chapters, whose titles are self-explanatory:\n(1)\nThe fundamental concepts of the theory of sets;\n(2)\nThe measure of sets of points;\n(3)\nFunctions of real variables;\n(4)\nThe\nLebesgue\nintegral;\n(5)\nFunctions of one and two variables; and\n(6)\nFourier\nseries. The last of these is inserted as an illustration of the importance of the\nLebesgue\ntheory in the investigation of a classic problem of analysis. The entire book is thorough, accurate, readable, and well documented.\nKurt Schröder writes in a review:-\nThe book provides, in a clear and concise manner, an overview of the theory of the\nLebesgue\nintegral and its application to the theory of\nFourier series\n, so that it can be read without difficulty by a student in their middle semesters.\nReturning to Giessen in\n1928\nas\nLudwig Schlesinger\n's assistant provided Plessner with only a very small income. On\n12\nFebruary\n1929\nPlessner's\nHabilitation\nthesis\nOber Summierbarkeit der trigonometrischen Reihen durch arithmetische Mittel\nⓉ\n(\nUpper summability of trigonometric series by arithmetic mean\n)\nwas submitted to the faculty at Giessen. The Faculty report on the Habilitationsschrift was very positive\n(\nsee\n[\n2\n]\n)\n:-\nNever have we met a student who has acquired such extensive knowledge of mathematical works within a few semesters. ... we became convinced that Plessner will become a brilliant mathematician ... Considering his\n(\nfinancially\n)\ninsecure position it is astonishing that he had the strength to make deep speculations and we expect ... that he will make further most important contributions.\nThe\n54\n-page manuscript was never published although some of the results, without proofs, are given in two further short papers by Plessner, namely\nTrigonometrische Reihen\nⓉ\n(\nTrigonometric series\n)\n(1929)\nand\nÜber konjugierte trigonometrische Reihen\nⓉ\n(\nOn conjugate trigonometric series\n)\n(1935)\n. This last mentioned paper was reviewed by\nJózef Marcinkiewicz\nwho wrote:-\nThis is an important theorem which has been attacked by mathematicians for a long time.\nOn\n27\nFebruary\n1929\n, Plessner delivered the required lecture to prove his teaching abilities. His lecture\nÜber neuere Untersuchungen zu den Grundlagen der Mathematik\nⓉ\n(\nOn more recent studies on the foundations of mathematics\n)\nwas declared \"satisfactory\", although six of the panel of fourteen professors chose to abstain in the vote. Despite the fact that his Habilitationsschrift was an outstanding piece of work and he had passed the lecturing requirement, the Senate refused to give its approval since Plessner was a Russian citizen. Now there was no rule that required lecturers to be German citizens, yet the Senate voted to only give Plessner his 'venia legendi' if he acquired German citizenship. He was told by the city officials that he was required to have\n20\nyears continuous residence in Germany to obtain citizenship. Of course, one has to wonder whether the reluctance of some professors to support a positive evaluation of his lecture and the Senate's requirement that he obtain German citizenship\n(\nwhich they almost certainly knew was nearly impossible\n)\nwas more to do with the fact that Plessner was Jewish. The Jews had been blamed for Germany's defeat in World War I and anti-Semitism in Germany had steadily increased through the\n1920\ns.\nPlessner moved to Berlin in June\n1929\nthinking that, in Berlin, he would be more able to support himself financially.\nSchlesinger\nand\nEngel\nasked the Rector of the University of Giessen to request the city officials to speed up his application for German citizenship. The Rector did make the request to the Giessen city officials but, as Plessner was no longer resident in Giessen, they declared that they would not take any action. In January\n1930\n,\nSchlesinger\nand\nEngel\nappealed to the Rector to request the Senate of the University of Giessen to confer the 'venia legendi' on Plessner without him having German citizenship. However, the Senate decided to postpone a decision indefinitely and so Plessner had no choice; he could not get a lectureship in Germany since he was a Russian citizen so he moved to Moscow.\nIn Moscow, he joined the research group of\nNikolai Nikolaevich Luzin\n. Although Moscow had provided a research environment where there was much interest in the area of mathematics that Plessner had studied for his thesis, in fact his interests at this time moved to functional analysis and particularly to spectral theory. It seems that his interest in\nfunctional analysis\narose when he read\nBanach\n's book\nThéorie des opérations linéaires\nⓉ\n(\nTheory of linear operations\n)\nof\n1932\n. He was greatly respected in Moscow: a colleague wrote\n(\nsee\n[\n2\n]\n)\n:-\nAbrahm Ezechiel Plessner knew so much that it seemed he knew everything. He understood works in any field and every young mathematician tried to tell him of his new results.\nHis students noted that his lectures were filled with comments like: this is false and this is trivial. They jokingly wrote:-\nParadise in the sense of Plessner is an abstract space in which all theorems are both false and trivial.\nHe did not find lecturing easy because of his health problems and standing at a blackboard was in itself quite a difficult task for him. However, this was not an easy time to be working in Moscow for quite different reasons. In\n1936\n,\nLuzin\nwas the victim of a violent political campaign organized by the Soviet authorities through the newspaper\nPravda\n. He was accused of anti-Soviet propaganda and sabotage by publishing all his important results abroad and only minor papers in Soviet journals. Certainly from the time Plessner arrived in Moscow, he published in Russian journals. However, for the first few years his papers, although in Russian journals, were written in German. This changed around\n1940\nand, from that time on his papers were written in Russian.\nIn\n1939\nPlessner published two papers, namely\nZur Spektraltheorie maximaler Operatoren\nⓉ\n(\nOn the spectral theory of maximum operators\n)\nand\nÜber Funktionen eines maximalen Operators\nⓉ\n(\nOn functions of a maximum operator\n)\n. These papers deal with a modified spectral theory and a restricted notion of functions for maximal\n(\nbut not necessarily self-adjoint\n)\noperators. He continued this line of research, publishing\nÜber halbunitäre Operatoren\nⓉ\n(\non semi-unitary operators\n)\nlater in the same year. Plessner was promoted to professor in\n1939\nand held posts both at Moscow University and at the Mathematical Institute of the USSR Academy of Sciences. In\n1941\nhe published the survey\nSpectral theory of linear operators I\n.\n(\nRussian\n)\n. Although this was a paper rather than a book, since it is over\n120\npages long, it might well have been a book.\nJacob David Tamarkin\nwrites:-\nThe present survey is based on a course of lectures delivered by the author in\n1938\n-\n1939\nat the Moscow University. It contains, together with an introduction and fundamental notions of the theory of\nHilbert spaces\nand linear operators in\nHilbert\nspaces, the foundations of the spectral theory of linear operators\n(\nbounded and not bounded\n)\nand of extensions of self-adjoint operators. The spectral decomposition is treated by a method analogous to the complex methods of\nPoincaré\n-\nHellinger\n, but presenting some new details. The exposition is compact and elegant. The theory of functions of operators is reserved for the second part of the survey.\nHe did start to write a book\nSpectral theory of linear operators\n(\nRussian\n)\non this topic in\n1948\nbut there were many difficulties caused by illness but also for a quite scandalous reason. Life became very hard after he was dismissed from both posts that he held in\n1949\n. Now this might be a little hard to understand but the reasons must be clear and due primarily to\nIvan Matveevich Vinogradov\n. We quote from\n[\n3\n]\n:-\nVinogradov\n's and his associates' anti-Semitism went beyond the general Soviet norms of the time. He was striving to make the Institute and the upper echelons of the Soviet mathematics completely \"Judenfrei\" and, at least within the Institute, came close to achieving this infamous objective.\nPlessner's last years were ones of financial hardship and his health, which as we explained above had never been good, became steadily worse. His role in mathematics is however a major one and he must be considered as a founder of the Moscow school of functional analysis. He left a wife, Nina Andreevna, but they had no children. We mentioned the book\nSpectral theory of linear operators\n(\nRussian\n)\nwhich he began in\n1948\n. It was still unfinished on his death but Leonid Mikhailovich Abramov and Boris Mikhailovich Makarov completed the book and it was published in\n1965\n, four years after Plessner died. An English translation was published in\n1969\n. The Russian edition was reviewed by\nLouis de Branges\nwho writes:-\nThis expository account of the theory of linear transformations in\nHilbert\nspace is concerned exclusively with normal operators. A now classical theorem states that a normal operator A admits an invariant subspace corresponding to any given closed subset D of the complex plane, such that the spectrum of the restriction of A to the subspace is contained in D. The subspace can be chosen so that its orthogonal complement is also an invariant subspace of A and so that the spectrum of the restriction of A to the orthogonal complement is contained in the closure of the complement of D. Furthermore, the spectral theorem states that the operator admits an integral representation in terms of these invariant subspaces. The author's treatment of the theorem emphasizes the technical aspects of the integration process. Thus an existence theorem for invariant subspaces does not appear in the first five hundred pages of the book. This space is devoted instead to the definition of a partially ordered linear space, the definition of a positivity-preserving operator, the concept of a\nHilbert\nspace as a special case of a\nBanach space\n, fundamental properties of partially defined operators, and the definitions of adjoint, inverse, and closure.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}