{
  "nome_completo": "Mohammad Abu'l-Wafa Al-Buzjani",
  "nome_curto": "Abu'l-Wafa",
  "ano_nascimento": "940",
  "ano_morte": "998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abul-Wafa/",
  "lugar_nascimento": "Buzjan (near Jam), Khorasan region (now in Iran)",
  "lugar_morte": "Baghdad (now in Iraq)",
  "biografia": "Abu'l-Wafa\nwas brought up during the period that a new dynasty was being established which would rule over Iran. The Buyid Islamic dynasty ruled in western Iran and Iraq from\n945\nto\n1055\nin the period between the Arab and Turkish conquests. The period began in\n945\nwhen Ahmad Buyeh occupied the 'Abbasid capital of Baghdad. The high point of the Buyid dynasty was during the reign of 'Adud ad-Dawlah from\n949\nto\n983\n. He ruled from Baghdad over all southern Iran and most of what is now Iraq. A great patron of science and the arts, 'Adud ad-Dawlah supported a number of mathematicians and Abu'l-Wafa moved to 'Adud ad-Dawlah's court in Baghdad in\n959\n. Abu'l-Wafa was not the only distinguished scientist at the Caliph's court in Baghdad, for outstanding mathematicians such as\nal-Quhi\nand\nal-Sijzi\nalso worked there.\nSharaf ad-Dawlah was 'Adud ad-Dawlah's son and he became Caliph in\n983\n. He continued to support mathematics and astronomy and Abu'l-Wafa and\nal-Quhi\nremained at the court in Baghdad working for the new Caliph. Sharaf ad-Dawlah required an observatory to be set up, and it was built in the garden of the palace in Baghdad. The observatory was officially opened in June\n988\nwith a number of famous scientists present such as\nal-Quhi\nand Abu'l-Wafa.\nThe instruments in the observatory included a quadrant over\n6\nmetres long and a stone sextant of\n18\nmetres. Abu'l-Wafa is said to have been the first to build a wall quadrant to observe the stars. However, the caliph Sharaf ad-Dawlah died in the following year and the observatory was closed.\nLike many scientist of his period, Abu'l-Wafa translated and wrote commentaries, which have since been lost, on the works of\nEuclid\n,\nDiophantus\nand\nal-Khwarizmi\n. Some time between\n961\nand\n976\nhe wrote\nKitab fi ma yahtaj ilayh al-kuttab wa'l-ummal min 'ilm al-hisab\nⓉ\n(\nBook on what is necessary from the science of arithmetic for scribes and businessmen\n)\n. In the introduction to this book Abu'l-Wafa writes that it\n(\n[\n3\n]\nor\n[\n4\n]\n)\n:-\n... comprises all that an experienced or novice, subordinate or chief in arithmetic needs to know, the art of civil servants, the employment of land taxes and all kinds of business needed in administrations, proportions, multiplication, division, measurements, land taxes, distribution, exchange and all other practices used by various categories of men for doing business and which are useful to them in their daily life.\nIt is interesting that during this period there were two types of arithmetic books written, those using Indian symbols and those of finger-reckoning type. Abu'l-Wafa's text is of this second type with no numerals; all the numbers are written in words and all calculations are performed mentally. Early historians such as\nMoritz Cantor\nbelieved that there were opposing schools of authors, one committed to Indian methods, the other to Greek methods. However, this has since been disproved\n(\nsee for example\n[\n9\n]\n)\n, and it is now believed that mathematicians wrote for two differing types of readers. Abu'l-Wafa himself was an expert in the use of Indian numerals but these\n[\n1\n]\n:-\n... did not find application in business circles and among the population of the Eastern Caliphate for a long time.\nHence he wrote his text using finger-reckoning arithmetic since this was the system used for by the business community. The work is in seven parts, each part containing seven chapters\nPart I: On ratio\n(\nfractions are represented as made from the \"capital\" fractions\n1\n2\n,\n1\n3\n,\n1\n4\n,\n.\n.\n.\n,\n1\n10\n\\large\\frac{1}{2}\\normalsize , \\large\\frac{1}{3}\\normalsize , \\large\\frac{1}{4}\\normalsize , ... ,\\large\\frac{1}{10}\\normalsize\n2\n1\n​\n,\n3\n1\n​\n,\n4\n1\n​\n,\n.\n.\n.\n,\n1\n0\n1\n​\n)\n.\nPart II: On multiplication and division\n(\narithmetical operations with integers and fractions\n)\n.\nPart III: Mensuration\n(\narea of figures, volume of solids and finding distances\n)\n.\nPart IV: On taxes\n(\ndifferent kinds of taxes and problems of tax calculations\n)\n.\nPart V: On exchange and shares\n(\ntypes of crops, and problems relating to their value and exchange\n)\n.\nPart VI: Miscellaneous topics\n(\nunits of money, payment of soldiers, the granting and withholding of permits for ships on the river, merchants on the roads\n)\n.\nPart VII: Further business topics.\nThis work is studied in detail in\n[\n12\n]\n(\nsee also\n[\n10\n]\n)\n. Of particular interest is the reference to negative numbers in Part II of Abu'l-Wafa's treatise, and this particular aspect is studied in detail in\n[\n11\n]\nand\n[\n12\n]\n(\nsee also\n[\n1\n]\n)\n. This seems to be the only place that negative numbers have been found in medieval Arabic mathematics. Abu'l-Wafa gives a general rule and gives a special case of this where subtraction of\n5\nfrom\n3\ngives a \"debt\" of\n2\n. He then multiples this by\n10\nto obtain a \"debt\" of\n20\n, which when added to\n(10\n-\n3)(10\n-\n5)\n=\n35\ngives the product of\n3\nand\n5\n, namely\n15\n.\nAnother text written by Abu'l-Wafa for practical use was\nA book on those geometric constructions which are necessary for a craftsman\n. This was written much later than his arithmetic text, certainly after\n990\n. The book is in thirteen chapters and it considered the design and testing of drafting instruments, the construction of right angles, approximate\nangle trisections\n, constructions of\nparabolas\n, regular polygons and methods of inscribing them in and circumscribing them about given circles, inscribing of various polygons in given polygons, the division of figures such as plane polygons, and the division of spherical surfaces into regular spherical polygons.\nAnother interesting aspect of this particular work of Abu'l-Wafa's is that he tries where possible to solve his problems with\nruler and compass\nconstructions. When this is not possible he uses approximate methods. However, there are a whole collection of problems which he solves using a ruler and fixed compass, that is one where the angle between the legs of the compass is fixed. It is suggested in\n[\n1\n]\nthat:-\nInterest in these constructions was probably aroused by the fact that in practice they give more exact results than can be obtained by changing the compass opening.\nAbu'l-Wafa is best known for the first use of the tan function and compiling tables of sines and tangents at\n15\n' intervals. This work was done as part of an investigation into the orbit of the Moon, written down in\nTheories of the Moon\n. He also introduced the sec and cosec and studied the interrelations between the six trigonometric lines associated with an arc.\nAbu'l-Wafa devised a new method of calculating sine tables. His trigonometric tables are accurate to\n8\ndecimal places\n(\nconverted to decimal notation\n)\nwhile\nPtolemy\n's were only accurate to\n3\nplaces.\nHis other works include\nKitab al-Kamil\nⓉ\n(\nComplete book\n)\n, a simplified version of\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. Although there seems to have been little of novel theoretical interest in this work, the observational data in it seem to have been used by many later astronomers.",
  "math_areas": [
    "Analysis"
  ]
}