{
  "nome_completo": "Adam Ries",
  "nome_curto": "Adam Ries",
  "ano_nascimento": "1492",
  "ano_morte": "1559",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ries/",
  "lugar_nascimento": "Staffelstein (near Bamberg), Upper Franconia (now Germany)",
  "lugar_morte": "Annaberg, Saxony (now Annaberg-Buchholz, Germany)",
  "biografia": "German children today know the expression\nDas macht nach Adam Riese...\n(\nthat gives according to\nAdam Ries\n)\nwhen doing arithmetic. From the list of references attached to this article, which is only a small selection of the vast amount of material concerning Ries, it will be seen that there remains a very considerable level of interest in this mathematician.\nAdam Ries's name appears with a number of different spellings, a common phenomenon with people living around this time who were certainly not consistent with their own spelling of their names. Ries himself used the forms Ries and Risz when he signed documents, but other forms of his name such as Riese\n(\nused by his father\n)\n, Ris and Ryse are also found. His mother, Eva Kittler, was the second wife of his father Contz Ries\n(\nborn\n1478\nin Staffelstein, died\n1506\nin Staffelstein\n)\nwho owned a mill in Staffelstein as well as several houses and a vineyard. Certainly Contz Ries was well-off. After the death of his first wife Anna, with whom he had several children, he married again in\n1492\n. Adam was the first child of this second marriage to Eva, having younger siblings Katarina, Margareta and Conradus. He became known as \"the greatest son of Staffelstein\".\nWe know nothing of Adam's education but, given that his family were in Staffelstein as he was growing up, it is likely that he attended school there. In\n1509\n, at the age of sixteen, he was living with his younger brother Conradus in Zwickau where Conradus was attending the Latin school. He moved to Annaberg, in the Kingdom of Saxony, in\n1515\nand we know from his own writings\n(\nsee Bruno Berlet\n[\n19\n]\n)\nthat during this stay in Annaberg he studied, and solved, some problems in algebra. Wolfgang Kaunzner, in\n[\n16\n]\n, wants:-\n... to draw attention to the fact that Adam Ries\n[\nbefore becoming a 'Rechenmeister'\n]\nbusied himself with then current mathematical problems and in doing so occupied a position equal to that of his contemporary Cossists.\nThere is documentary evidence that on\n22\nApril\n1517\nhe was back in Staffelstein, for on this day he appeared before the Council of Staffelstein trying to settle a dispute over inheritance.\nIn\n1518\nhe moved to Erfurt where he ran a school as 'Rechenmeister'\n(\nmaster of calculations\n)\nand 'Hofarithmeticus' and, although he did not attend university there, he had many contacts with academics from the university and he profited greatly from these contacts. Perhaps the most important friendship was with Georg Sturtz\n(1490\n-\n1548)\nwho was an academic at the University of Erfurt. Sturtz's home was a famous meeting place of the Humanists and Ries made many useful contacts there. In fact it was Sturtz who gave Ries a collection of manuscripts on algebra and arithmetic which had been given to him by\nJohannes Widman\n. Ries wrote his first two books while in Erfurt: these are\nRechnung auff der linihen\nⓉ\n(\nReckoning with lines\n)\n(1518)\nand\nRechnung auff der linihen und Federn\nⓉ\n(\nReckoning with lines and springs\n)\n(1522)\n. We give some details of these works below. In\n1523\nRies became 'Bergbeamter'\n(\nengineer and inspector of mines\n)\nin Annaberg, which is a centre for the silver-mining region of Saxonia, and he also taught mathematics there. He had already been working on a manuscript for an algebra book,\nCoss\n, and it was after settling in Annaberg that he completed the text. We look at details of this work below and also how it became to be published in recent times.\nAfter settling in Annaberg, he got to know Anna Leuber\n(1495\n-\n1545)\n, from Freiberg, who was the daughter of the master fitter Andreas Leuber and his wife Margaret Birner. Adam and Anna were married in\n1525\nin Saint Anne's Church, Annaberg\n(\nat this time a Catholic church, but it became a Lutheran church in\n1539)\n. In the same year of\n1525\n, Ries took the necessary oath to become a citizen of the city. He bought a house in Johannisgasse and there Adam and Anna Ries brought up their eight children, five sons and three daughters. Three of the sons, Adam, Abraham and Jacob, became mathematicians working in Annaberg, while Isaac, one of other two sons, became a 'Visierer'\n(\nweights and measures master\n)\nin Leipzig. The fifth son, Paul, moved to Wiesa, close to Annaberg, where he became a judge and was an important landowner.\nReturning to the year\n1525\n, this was when Ries became 'Rezessschreiber'\n(\nrecorder of mining production\n)\nin Annaberg, then in\n1532\n'Gegenschreiber'\n(\nbookkeeper recording of ownership of mining shares\n)\nand, from\n1533\nto\n1539\n, 'Zehnter auf dem Geyer'\n(\nfinancial administrator for mining in the district\n)\n. The year\n1539\nmarked a substantial change for Annaberg which we hinted at above when we noted that the church in which Ries married changed from Catholic to Lutheran in\n1539\n. This change resulted when the Catholic ruler of the town, Duke Georg, was replaced by his Lutheran brother Heinrich in that year. Ries's name appears in lists of Lutherans living in Annaberg made in\n1530\nso the arrival of the Reformation in Annaberg in\n1539\nmust have helped Ries's career. That this happened is clear from the fact that, in\n1539\n, Ries became court mathematician and was given the title Churfürstlich Sächsicher Hofarithmeticus. At this time he purchased the Riesenburg, a small castle, outside Annaberg almost half-way between Annaberg and Wiesa. The Riesenburg still exists today close to the Wohngebiet Adam Ries.\nRies's income came mainly from his arithmetic textbooks. The first of these was\nRechnung auff der linihen\nⓉ\n(\nReckoning with lines\n)\nwritten while he was in Erfurt and printed in that city in\n1518\nby Mathes Maler. The book was intended to teach people how to use a calculating board similar to an\nabacus\n. This type of device is described by the Money Museum:-\nFour horizontal and five vertical lines were painted or carved on the calculating boards to represent the decimal values in ascending order. The arithmetical sums were worked out with the help of coin-like counters. They were placed on the respective lines according to the values of the numbers and then, depending on the calculation, these were moved, removed or added to the lines until the final result could be read off. No numbers were printed on the counters; they amounted to as much as the line on which they were placed.\nNo copy of the first edition of this book has survived, the earliest that we have is the second of the four editions which was published in\n1525\n. Ries states clearly in this second edition that the book is intended for children and he must have written it to aid his school teaching at this time. A third edition was published in\n1527\n. The second of Ries's books written while he was in Erfurt was\nRechnung auff der linihen und Federn\nⓉ\n(\nReckoning with lines and springs\n)\n(1522)\n. This book ran to over\n100\neditions, which is a remarkable achievement. It was aimed at apprentice craftsmen, not at schoolchildren, and in addition to explaining the use of the lined calculating board, this book described calculating with Indo-Arabic numerals. A wood-cut illustrates the purpose of the book by showing two people calculating with the rival methods, one using the calculating board, the other using Indo-Arabic numerals. Clearly Ries taught both the old method of calculating, derived from the abacus, and the new method, derived from the Indians, which at that time was forbidden in most countries! The third of Ries's arithmetic books\nRechenung nach der lenge, auff den Linihen vnd Feder\nⓉ\n(\nReckoning lengths with lines and spring\n)\nis often known as the\nPractica\n; it contains the picture of Ries which is reproduced above\n(\nthe only image from a contemporary source\n)\n. The book appeared in\n1550\n, printed in Leipzig by Jakob Bärwald, and was a textbook written for everyone, not just for scientists and engineers. The book explains addition, subtraction, multiplication and, very surprisingly for that period, also division. At that time division could only be learnt at the University of Altdorf\n(\nnear Nürnberg\n)\nand even most scientists did not know how to divide; so it is astonishing that Ries explained it in a textbook designed for everyone to use. The reason for the long delay between the appearance of Ries's first two arithmetic texts and this third one was not because this third arithmetic was a much later work. Indeed most of the material had been written by Ries by\n1525\nbut the printing costs were very high and he did not have the necessary funds to pay a printer. However, eventually the Elector Maurice of Saxony agreed to advance him enough to pay the printing costs and publication could proceed.\nAmong his other books were\nEin Gerechnet Büchlein auff den Schöffel, Eimer vnd Pfundgewicht...\nⓉ\n(\nBooklet for volume of buckets and pounds of weight ...\n)\n(1533)\nwhich contained tables to allow prices of several items to be found when the price of one was known. This work, also known as the\nAnnaberger Brotordnung\nⓉ\n(\nAnnaberg loaf calculation\n)\n, showed how to calculate the weight of a loaf on the assumption that the price of grain varied and the price of a loaf remained constant. In the Preface, Ries says that he has written the book:-\n... so that the poor common man will not be cheated when buying bread.\nWe still have to say something about Ries's algebra book\nCoss\n(1525)\n. Here we are dealing with a very different type of work in terms of its importance for, unlike the arithmetic books which were printed and could therefore be produced in great numbers and widely read, the\nCoss\nremained in manuscript and was therefore hardly read by anyone.\nDirk Struik\n, reviewing\n[\n7\n]\n, explains what happened to Ries's manuscript of\nCoss\n:-\nAdam Ries has remained in German memory because of his Rechenbücher -schoolbooks on arithmetic, popular for a century and a half. It is less known that he also wrote an algebra, called the Cosz, but this work has remained in manuscript form. Three of these manuscripts were bound together in\n1664\nby the Dresden Rechenmeister Martin Kupffer. They were thought to be lost until they were found in\n1855\n, and are now kept at the Erzgebirgsmuseum Annaberg-Buchholz, Annaberg being the Saxonian mining town where Ries lived as a respected citizen and teacher for many years until his death. The impressive folio facsimile, published on the occasion of the\n500\nth\nbirthday of Ries, contains three manuscripts: Cosz I\n(\npp.\n1\n-\n325)\nwas finished in\n1524\n, Cosz II\n(\npp.\n329\n-\n499)\nwas written between\n1545\nand\n1550\n...\nRainer Gebhardt writes\n[\n5\n]\n:-\nIn addition to his famous arithmetic primers Adam Ries has also written an extensive algebra book: The Coss. The symbol for the unknown, or variable, was called coss in the middle ages. Adam Ries also called it radix, root or thing. Ries's Coss, which, contrary to contemporary custom, was not written in Latin, but in German, is a link between the medieval descriptive algebra and the analytical algebra of modern days.\nRies's fame was considerable and much has been done over the years to honour him and keep his name to the fore. A bronze statue which was erected in Annaberg in\n1893\nwas later melted down for use in armaments, but has been replaced by a stone statue. In Staffelstein, the city of his birth, a number of plaques and stone reliefs have been erected. Perhaps the most spectacular of the monuments to Ries is in Erfurt where a bronze bust, plaque and calculating table keep his memory alive. We illustrate in our pictures of Ries above a stamp which was issued in\n1959\nto commemorate the\n400\nth\nanniversary of his birth. Another stamp was issued in\n1992\nto commemorate the\n500\nth\nanniversary of his death.",
  "math_areas": [
    "Algebra"
  ]
}