{
  "nome_completo": "Adelard of Bath",
  "nome_curto": "Adelard",
  "ano_nascimento": "1075",
  "ano_morte": "1160",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adelard/",
  "lugar_nascimento": "Bath, England",
  "lugar_morte": null,
  "biografia": "Few details of\nAdelard\n's life are known with certainty. We do know that he studied in Tours in the Loire Valley in west central France and that he later taught at Laon in the Picardie region of northern France. Laon lies northwest of Reims and northeast of Paris. Adelard may have taught at the theological and exegetical school there which had been founded by Anselm of Laon in about\n1100\n.\nAfter leaving Laon, Adelard travelled for about seven years visiting first Salerno southeast of Naples. The medical school at Salerno, considered by many to be the first \"modern\" European university, was a famous institution at this time, drawing students from all over Europe. From Salerno Adelard travelled to Sicily which at that time was under Norman control but still strongly influenced by Arabic traditions. The Arabs from North Africa had conquered the island in\n965\nand remained in control for about\n100\nyears but the Normans gained the island in\n1060\n.\nAdelard next visited Cilicia, an ancient district of southern Anatolia which today is in Turkey. Cilicia was on the north east coast of the Mediterranean Sea and Adelard took the natural coastal route round the east end of the Mediterranean to Syria and then later to Palestine. We know that he returned to Bath and is mentioned in the records of that city for the year\n1130\n. There is no record of Adelard visiting Spain, but many scholars have concluded that he must have visited that country to have had access to the Spanish-Arabic texts which he translated.\nCertainly Adelard became an expert in the Arabic language which he might have learnt in Spain as did\nGherard\nof Cremona a few years later. However, there is an alternative theory that he learnt Arabic in Sicily. It is quite possible that, if this were the case, then he came in contact with Spanish-Arabic texts in Sicily for several scholars who had lived in Spain were at this time in Sicily.\nAdelard wrote a number of original works on philosophy. The first work that he is known to have written is a philosophy text written before\n1116\nand dedicated to William, Bishop of Syracuse. Since Syracuse was one of the most important cities of ancient Sicily, this work is likely to have been written around the time of Adelard's visit to that island. However, since the work is based firmly on\nPlato\n's philosophy, without any signs of Arabic influences, it may have been mostly written before Adelard's visits brought him in contact with the learning of the Arabs.\nIt is not as a philosopher that Adelard merits inclusion in this archive. Rather it is because he is\n[\n1\n]\n:-\n... one of the translators who made the first wholesale conversion of Arabo-Greek learning from Arabic into Latin.\nAdelard made Latin translations of\nEuclid\n's\nElements\nfrom Arabic sources which were for centuries the chief geometry textbooks in the West. In fact there seem to have been three separate versions of\nEuclid\n's\nElements\nwritten by Adelard. Version one is a translation of the whole fifteen books\n(\nthe\n13\noriginal books written by\nEuclid\nand the two further books written by\nHypsicles\n)\n. Adelard seems to have taken as his source one of al-Hajjaj's Arabic translations from Greek.\nThe second version of\nEuclid\n's\nElements\nby Adelard is quite different. It contains quite different wording of the statements of the propositions to that of version one, while the proofs are often only outlines or indications of how proofs might be constructed. The style of the translation tells experts that Adelard did not produce this from his own version one, but rather that he used some unknown Arabic source different from al-Hajjaj's translations.\nThere is debate as to whether the third version of\nEuclid\n's\nElements\nattributed to Adelard is indeed his work. It is a commentary on\nEuclid\n's\nElements\nrather than a translation of the original text. We know it was written before\n1200\nand became quite well known under Adelard's name.\nRoger Bacon\ngives quotes from this version in his works.\nAdelard also translated\nal-Khwarizmi\n's tables, wrote on the\nabacus\nand on the\nastrolabe\n. We should make some further comments on his translation of\nal-Khwarizmi\n's tables which became the first Latin astronomical tables of the Arabic type with their Greek influences and Indian symbols. These tables contain, at the end of chapter\n4\n, the date of\n26\nJanuary\n1126\n(\nat least that is what the Arabic date of A.H.\n520\nMuharram\n1\ncorresponds to\n)\n. It is hard to see what this date is there for unless it is the date when the chapter was completed, and so it has been taken as the approximate date for Adelard's translation. However, there is a manuscript\n(\nwritten later but a copy of Adelard's translation\n)\nwhich mentions an eclipse of the sun which took place in\n1133\n. It is possible that Adelard's translation took place after\n1133\nor, equally likely, that the scribe making the later copy added information about a recent eclipse which was not in Adelard's original text.\nAdelard also wrote arithmetic books, the earliest one of which was written before he studied Arabic arithmetic. It is based on the work of\nBoethius\n. A mathematics treatise which is strongly influenced by Arabic ideas has been attributed to Adelard although the attribution is not certain. The work consists of five books, the first three of which are on arithmetic and based on the Indian methods as presented in Arab writings. It has been conjectured that these books are based on an arithmetic book by\nal-Khwarizmi\nwhich is now lost. The remaining two books of the five which compose the treatise cover geometry, which is completely Greek in style, music, and astronomy. The astronomy, like the arithmetic, is Arabic in style.\nAdelard's\nQuaestiones naturales\nⓉ\n(\nNatural questions\n)\nconsists of\n76\nscientific discussions based on Arabic science. In this work he promoted the use of experimental data and writes that he\n[\n1\n]\n:-\n... prefers reason to authority.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}