{
  "nome_completo": "Lambert Adolphe Jacques Quetelet",
  "nome_curto": "Adolphe Quetelet",
  "ano_nascimento": "1796",
  "ano_morte": "1874",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Quetelet/",
  "lugar_nascimento": "Ghent, French Empire, (now Belgium)",
  "lugar_morte": "Brussels, Belgium",
  "biografia": "Adolphe Quetelet\n's mother was Anne-Françoise Vandervelde and his father was François-Augustin-Jacques-Henri Quetelet. Adolphe's father had been born in Ham in Picardy but lived for a time in Britain, becoming a British citizen, where he became the secretary of a Scottish nobleman. In this capacity he travelled with his employer on the Continent, particularly spending time in Italy. In\n1787\n, at age about\n31\n, he settled in Ghent and he was employed by the city. He died in\n1803\nwhen Adolphe was only seven years old so after attending the Lyceum in Ghent, he felt he had to take a job to support his family. He had shown himself to be a very talented mathematician at the Lyceum, so despite being attracted by literature, he became a mathematics teacher at a school in Audenaerde in\n1813\n. He taught there until he was appointed as an instructor in mathematics at the College of Ghent in February\n1815\n.\nGerminal Dandelin\nwas two years older than Quetelet but the two became friends while they studied at the Lyceum. Both were interested in mathematics, literature and music.\nDandelin\nhad then gone to Paris to study, had fought for Napoleon but returned to Belgium after Napoleon's defeat at Waterloo. He then renewed his friendship with Quetelet who was teaching at the College of Ghent. The two friends composed a libretto for an opera and after it was successfully performed, wrote to further dramas. Quetelet's time at the College of Ghent was not  all spent on literary pursuits, however, for he came under the influence of Garnier, the professor of astronomy and higher mathematics. It was Garnier who halted Quetelet's growing involvement in the arts, and made him become enthusiastic to undertake deeper studies in mathematics.\nWilliam I, king of The Netherlands and grand duke of Luxembourg\n(\nwhich included Belgium at that time\n)\n, founded a state university in Ghent in\n1817\n; the university opened in October of that year. Quetelet received his first doctorate in\n1819\nfrom Ghent for a dissertation on the theory of\nconic sections\n. After receiving this doctorate he was appointed to the chair of elementary mathematics at the Athenaeum in Brussels. In February\n1820\nhe was elected to the\nRoyal Belgium Academy of Science\nand greatly invigorated the Academy over the following years. In December\n1823\n, he went to Paris to study astronomy at the Observatory there. He learnt astronomy from\nArago\nand\nBouvard\nand the\ntheory of probability\nunder\nJoseph Fourier\nand\nPierre Laplace\n. He also met\nPoisson\n, von Humboldt and\nFresnel\n. Returning to Brussels, he became professor of higher mathematics at the Athenaeum. He gave his first course on probability in the academic year\n1824\n-\n25\n. He also began to give public lectures at the Museum in Brussels on topics such as geometry, probability, physics, and astronomy. He also began to give courses on the history of science. These lectures were published in\n1828\nunder the title\nInstructions populaires sur le calcul des probabilités\nⓉ\n(\nPopular Instructions on the calculation of probabilities\n)\n. We now give four quotes from these lectures:-\nThe more advanced the sciences have become, the more they have tended to enter the domain of mathematics, which is a sort of centre towards which they converge. We can judge of the perfection to which a science has come by the facility, more or less great, with which it may be approached by calculation\n.\nIt seems to me that the theory of probabilities ought to serve as the basis for the study of all the sciences, and particularly of the sciences of observation\n.\nSince absolute certainty is impossible, and we can speak only of the probability of the fulfilment of a scientific expectation, a study of this theory should be a part of very man's education\n.\nChance, that mysterious, much abused word, should be considered only a veil for our ignorance; it is a phantom which exercises the most absolute empire over the common mind, accustomed to consider events only as isolated, but which is reduced to naught before the philosopher, whose eye embraces a long series of events and whose penetration is not led astray by variations, which disappear when he gives himself sufficient perspective to seize the laws of nature\n.\nIn\n1825\nQuetelet married the daughter of the French physician M Curtet; they had one son, Ernest, and one daughter. Ernest became an accomplished astronomer, and eventually took over his father's role as Director of the Brussels Observatory. Quetelet loved music and was a reasonable musician; his wife, however, was an excellent musician. They would entertain guests at their home with music after their regular Saturday and Sunday dinner parties.\nQuetelet had been sent to Paris at the expense of the state in order that he could gain experience in practical astronomy. For a long time he had been pressing for a Belgium observatory to be set up, but the project progressed rather slowly. In\n1827\n, on the direction of the King, Quetelet was given the task of choosing instruments for the observatory. Together with\nDandelin\n, he went to London and from there visited universities, observatories and learned societies in England, Scotland, and Ireland seeking advice. Again in\n1829\n, this time accompanied by his wife, he visited astronomers in Holland and Germany, and became familiar with all German observatories. Next he visited Italy and Sicily in\n1830\nto learn more of the workings of observatories and societies. In\n1832\nhe became director of the newly opened Observatory.\nFrom this time on, Quetelet lived at the Observatory where he worked on statistical, geophysical, and meteorological data, studied meteor showers and established methods for the comparison and evaluation of the data. Between\n1825\nand\n1835\nhe wrote papers on social statistics. In\nRecherches sur le Penchant au Crime aux Différens Âges\nⓉ\n(\nResearch on the tendency to crime at different ages\n)\nwritten during this period, he wrote:-\nIt seems to me that that which relates to the human species, considered en masse, is of the order of physical facts: the greater the number of individuals, the more the influence of the individual will is effaced, being replaced by the series of general facts that depend on the general causes according to which society exists and maintains itself. These are the causes we seek to grasp, and when we do know them, we shall be able to ascertain their effects in social matters, just as we ascertain effects from causes in the physical sciences.\nHe gained world-wide fame in\n1835\nwhen he published\nSur l'homme et le developpement de ses facultés, essai d'une physique sociale\nⓉ\n(\nOn man and the development of his faculties: an attempt at social physics\n)\n. The significance of this work is discussed in\n[\n1\n]\n:-\nWith Quetelet's work of\n1835\na new era in statistics began. It presented a new technique of statistics, or, rather, the first technique at all. The material was thoughtfully elaborated, arranged according to certain pre-established principles, and made comparable. There were not very many statistical figures in the book, but each figure reported made sense. For every number, Quetelet tried to find the determining influences, its natural causes, and the perturbations caused by man. The work gave a description of the average man as both a static and dynamic phenomenon.\nInfluenced by\nLaplace\nand\nFourier\n, Quetelet was the first to use the normal curve other than as an error law. In\nSur l'homme et le developpement de ses facultés, essai d'une physique sociale\nⓉ\n(\nOn man and the development of his faculties: an attempt at social physics\n)\nhe presented his conception of the average man as the central value about which measurements of a human trait are grouped according to the normal curve. His studies of the numerical consistency of crimes stimulated wide discussion of free will versus social determinism. You can read an extract from\nSur l'homme\non the conclusions he drew from statistics gathered from the French criminal courts between\n1826\nand\n1831\n.\nMore details are given in the extract of Quetelet on crime at\nTHIS LINK\n.\nFor his government he collected and analysed statistics on crime, mortality etc. and devised improvements in census taking. His work produced great controversy among social scientists of the\n19\nth\ncentury. The following quotation from a\n1848\npublication shows that Quetelet understood quite well what he was measuring:-\nThis probability may be considered as giving, in cities, the measure of the apparent tendency to marriage of a Belgian aged\n25\nto\n30\n. I say apparent tendency intentionally, to avoid confusion with the real tendency, which may be quite different. One man may have, throughout his life, a real tendency to marry without ever marrying; another, on the contrary, carried along by fortuitous circumstances, may marry without having the least propensity to marriage. The distinction is essential.\nThe\nRoyal Belgium Academy\nwas founded in Brussels in\n1769\nas a purely literary academy but in\n1816\nit was reorganised into the Académie royale des sciences et belles-lettres under the patronage of William I of The Netherlands. Quetelet was elected to the\nBelgium Academy\nin\n1820\nand played a large role in making it an active vigorous organisation. He was director from\n1832\nto\n1833\n, then became secretary of the Academy, a role he continued to hold until his death forty years later. Not only was he interested in the scientific side of the society, but he also played a large role in the arts side. While president, he tried to introduce a new class of Beaux-Arts but failed. He eventually succeeded in\n1832\n. Hankins writes in\n[\n4\n]\n:-\nHaving failed he contented himself with assisting in the organisation of the Cercle artistique et littéraire, of which he was for some time the president. As secretary of the Academy he was always prompt and painstaking in fulfilling his duties.\nQuetelet organised the first international statistics conference in\n1853\n[\n4\n]\n:-\n... Quetelet was chosen president, and in his opening address he dwelt upon the advantages of international uniformity in plans, purposes and terminology of the official statistical publications. The Congress was a decided success and other sessions followed. The influence of the Congress on both the theory and practice of statistics was immense.\nIn the summer of\n1855\nQuetelet was struck by an illness, a stroke of moderate severity. He made a good physical recovery but mentally he was never as sharp again and his memory became poor. Although he wrote articles after this his writing was poor and had to be corrected very substantially before it was understandable.\nAs to his character, the description given in\n[\n4\n]\nrelates, of course, to the time before his illness of\n1855\n:-\nModest and generous, convinced but respectful of other' opinions, always calm and considerate, a man of broad learning and an attractive conversationalist, he won and kept friends wherever he went. A man of excellent tact, as well as tremendous enthusiasm ... A man of wide intellectual interests, and at the same time endowed with a prodigious capacity for labour ... always animated and genial, found of wit and laughter.\nTo finish this sketch of Quetelet let us quote from a speech given at his funeral:-\nAs a man of science he was admired; in political affairs he was respected; in private life he was beloved.\nAs a footnote let us mention that the internationally used measure of obesity is the\nBody Mass Index\nor\nQuetelet Index\n. This is\nQI =\n(\nweight in kilograms\n)\n/\n(\nheight in metres\n)\n2\n^{2}\n2\n.\nIf QI >\n30\nthen a person is officially obese.\nTo calculate your Quetelet index click\nTHIS LINK\n.",
  "math_areas": [
    "Statistics"
  ]
}