{
  "nome_completo": "Édouard Benjamin Baillaud",
  "nome_curto": "Édouard Benjamin Baillaud",
  "ano_nascimento": "1848",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baillaud/",
  "lugar_nascimento": "Chalon-sur-Saône, France",
  "lugar_morte": "Toulouse, France",
  "biografia": "Édouard Benjamin Baillaud\nwas born on\n14\nFebruary\n1848\nin Chalon-sur-Saône, a town in eastern France. It was in the attic of the house at\n9\nPlace de l'Obélisque above the brasserie du Tonneau d'Or that he was born. His father, Joseph Désiré Baillaud\n(1811\n-\n1889)\nhad served in the military for seven years, and had instilled the importance of education in his son. Joseph was an employee at the City Hall in Chalon. Benjamin was one of seven children, two of whom died young. His mother was Anne Antoinette Rosalie Zoé Jouvenot\n(1824\n-\n1880)\n. The family were poor and Benjamin might have had to end his education early to get a job had it not been for his elder sister Emma\n(1843\n-\n1934)\nwho worked as a substitute teacher; Benjamin was for ever grateful for the advantage this gave him.\nHe was educated very well from early on, receiving a scholarship from the municipality\n(\nrare for the time\n)\n, allowing him to study at the Chalon Middle School. His teachers suggested that he look for a position as a teacher but Baillaud had higher ambitions. He was able to get his scholarship renewed upon his graduation, leading him to the lycée in Lyon where he studied special mathematics. There he lived with his uncle Louis Baillaud who had moved to Lyon to help his nephew.\nGraduating from the lycée in Lyon, Baillaud entered the École Normale Supérieure. It was here that he spent the three years\n1866\nto\n1869\n, and it was where he met and befriended future mathematician\nJules Tannery\nand future physicist Edmond Bouty. These three would remain lifelong friends, and in some sense become each other's family: Baillaud would go on to marry, on\n31\nDecember\n1873\n, Marie Hélène Pons\n(1847\n-\n1920)\n, a sister of Bouty's wife;\nTannery\nwould go on to marry Baillaud's sister, Esther. Moreover, their children would maintain this family friendship. Baillaud graduated with a mathematics degree from the École Normale Supérieure in\n1869\nand was appointed to teach mathematics at the lycée in Montauban.\nBaillaud, as a teacher, was not called for military service in the Franco-Prussian war of\n1870\n-\n71\n. He did, however, serve in the National Guard in Montauban. In these early years he was involved in politics and made known his strong Republican views. He was one of the founders of the newspaper,\nLe Républicain de Tarn et Garonne\n. Over the following years he taught in the Lycée Saint-Quentin, the Lycée St Louis, the Lycée Louis le Grand, the Lycée Charlemagne, and the Lycée\nCondorcet\n.\nHe was appointed to roles in the Paris Observatory in the early\n1870\ns. In\n1872\n, he was made Élève Astronome\n(\nstudent astronomer\n)\nunder\nUrbain Le Verrier\n, and in\n1874\n, Aide Astronome\n(\nassistant astronomer\n)\n. At this stage he was studying for his doctorate and consulted\nCharles Delaunay\n(\nthe Director of the Paris Observatory\n)\n,\nCharles Hermite\nand\nVictor Puiseux\nabout possible topics for his research. He settled on studying perturbations of the motions of comets. Letters he wrote show his personality; for example writing to Edmond Bouty on\n22\nJune\n1872\n(\nsee\n[\n2\n]\n)\n:-\nI cannot ... conceal that I've always had at the bottom of my heart a little vanity and much ambition. ... I do not lack patience and even energy. ... I will be working ... as hard as a man can, and if I am needed, you will find me ready to put my knowledge to the service of science and my country.\nIn\n1876\nhe was awarded a doctorate in Mathematical Sciences for his thesis on perturbations of the motions of comets\nExposition de la méthode de M Gylden pour le développement des perturbations des comètes\nⓉ\n(\nExhibition of the method of M Gylden for the development of cometary disturbances\n)\n. By\n1877\n, he was lecturing on dynamical astronomy at the Sorbonne\n(\nUniversity of Paris\n)\n, substituting for\nLe Verrier\nwho was ill.\nLe Verrier\ndied in September\n1877\nand\nFélix Tisserand\n, who had been Director of the Toulouse Observatory since\n1873\n, moved to the Paris Observatory to fill the vacancy in\n1878\n. Baillaud, who had succeeded\nLe Verrier\nas Professor of Astronomy at the University of Paris, was a candidate for the vacant post in Toulouse.\nIn\n1878\n, Baillaud was selected to be the Director of the Toulouse Observatory. He served in this role until\n1907\nwhen he returned to Paris. During much of his time working in Toulouse, he also operated as the Dean of the Faculty of Science of the University of Toulouse. He had been proposed for this role by the President of the University who wrote\n(\nsee\n[\n2\n]\n)\n:-\nThis is a man of great sense and of the strongest character ... he is a very intelligent man and very hardworking, very dedicated to the University with liberal ideas, who by his character will act as a leader of the professors, by his devotion he will have the best influence on students of the School.\nIn the School of Sciences, he taught astronomy. He played a key role at the University, developing the Faculty\n[\n11\n]\n:-\nThe buildings were old and inadequate; students were few in number, and the number of professors insufficient for these few. His first step was to secure from the Ministry of Education the means to call the eminent\nÉmile Picard\nto the chair of mathematics and to build laboratories of physics and chemistry. Much needed additions were made to the scientific library. Finally, with the assistance of the city of Toulouse, additional land was acquired and buildings erected for the faculty of science which were adequate at the time.\nHe raised the number of chairs from\n9\nto\n20\n, and was responsible for the appointment of to-be-famous scientists such as\nMarie Henri Andoyer\n,\nMarcel Brillouin\n,\nEugène Cosserat\n,\nÉdouard Goursat\n,\nGabriel Koenigs\n,\nThomas Stieltjes\nand\nErnest Vessiot\nin addition to\nÉmile Picard\n. At the Observatory he aimed to expand its capabilities, attracting many collaborators and giving full support to the international\nCarte du Ciel\nⓉ\n(\nMap of the sky\n)\nproject.\nHe also managed to improve the status of astronomy by re-launching the journal\nAnnales de l'Observatoire de Toulouse\nin\n1880\n, producing an initial volume of a new series, published in Paris. The series continued through to\n1968\n. Moreover, upon his proposal, the journal\nAnnales de Faculté des Sciences de Toulouse\nwas created in\n1886\n. He also disseminated his astronomical knowledge through public lectures, offering a popular course illustrated with photographs and drawings, for which the public were invited to the Observatory.\nOne of Baillaud's most impressive contributions to astronomy came after\n1903\n, when the Toulouse Observatory took over the facility on the Pic du Midi, a mountain in the French Pyrenees. Founded by amateurs in the\n1850\ns, the mountain-top observatory had been intended to house a telescope, but the\n9400\nft/\n2865\nm height above sea level proved too big of a logistical challenge, leaving the goal unrealised. Construction of the observatory had begun in\n1878\n, but the spiralling costs had caused the work to be suspended in\n1882\n. Upon the Toulouse take-over, Baillaud organised a team of soldiers to erect a\n20\nin/\n0\n.\n5\nm reflecting telescope, and a\n10\nin/\n0\n.\n25\nm refracting telescope on the summit. The\n8\nm dome was completed in\n1908\n. It was here that, in\n1909\n, those working at the Observatory discredited the Martian canal theory, the belief during the late\n19\nth and early\n20\nth centuries that there were canals on Mars. It turned out that these 'canals' were merely optical illusions and were revealed to be so by the improved astronomical observations of the\n20\nth century. It is thanks to Baillaud that this facility was in operation.\nIn\n1902\n, he was made a Correspondent of the\nAcadémie des Sciences\n, leading to full membership in\n1908\n. This year also saw him become an associate member of the\nRoyal Astronomical Society\nand a member of the Bureau des Longitudes. He later became a corresponding member of the\nImperial Academy of Sciences of Saint Petersburg\n(1913)\nand an associate member of the\nAccademia dei Lincei\n(1918)\n.\nHe left Toulouse for Paris in\n1908\n, when he became the Director of the Paris Observatory. His appointment had come at the end of a difficult process which had many twists and turns. The Minister made the appointment after receiving advice from the\nAcademy of Sciences\nand the Council of the Paris Observatory. There were several candidates but the close call came between Baillaud and\nGuillaume Bigourdan\n. First one man and then the other appeared to be first choice. On\n17\nDecember\n1907\nsome newspapers reported, prematurely, that\nBigourdan\nhad almost certainly won but when the official announcement came on\n6\nJanuary\n1908\nit was Baillaud who was declared the new Director of the Paris Observatory.\nOn\n26\nMarch\n1908\nhis colleagues at Toulouse gathered to wish him well in his position in Paris. One of his colleagues made a farewell speech\n(\nsee\n[\n11\n]\n)\n:-\nAs administrator we have seen that you have always had in mind the general interest, and that alone. We know that by your innate sense of right you have kept yourself free from prejudice and have rendered to each one the justice due him. But it would show little knowledge of your character to see in you only the administrator and the man of science. However eminent may be your professional attainments, much more exquisite are your personal qualities, the qualities of heart which, by a happy reciprocity, you have always esteemed so highly in others. ... No words could be more eloquent than the presence of ninety persons, administrators, colleagues, students, friends, who have come spontaneously to show that it is the man rather than the official that they love.\nHe set out to re-launch the stalled\nCarte du Ciel\nⓉ\n(\nMap of the sky\n)\nproject. It had been initialised in\n1887\nby Paris Observatory director Amédée Mouchez, who realised the potential of the new dry plate photographic process to revolutionise the process of making maps of stars. A congress, held in the Paris Observatory on\n16\nApril\n1887\n, had resolved:\n(\ni\n)\nto create a chart of all stars down to the fourteenth magnitude, the plates to be in duplicate\n(\nii\n)\nto create a second series of photographs with shorter exposure, including stars to the eleventh magnitude, to be made concurrently to form a catalogue and to determine fundamental positions in the first series. It was realised, however, that the charts proved to be excessively expensive to photograph and reproduce, thus less attention was given to the project over time. Baillaud hosted a conference at the Observatory with entertainment in the form of singers from the Paris Opera, and refreshments of wine provided by the Bordeaux Observatory. Though the French government had agreed to fund the venture, it became increasingly clear that the objectives were too unrealistic. The project was never completed.\nFor two years from\n1909\n, Baillaud served as the President of the French Astronomical Society\n(\nSociété astronomique de France\n)\n.\nBaillaud held a keen interest in time standardisation, promoting Universal Time, the time standard based on the Earth's rotation. He was chosen in\n1913\nto be the director of the Bureau International de l'Heure, based at the Paris Observatory. It was the responsibility of the Bureau to combine different measurements of Universal Time. The Bureau also played an important role in the research into time keeping. Baillaud initialised the transmission of a time signal from the Eiffel Tower, and maintained the Observatory and time signal throughout the First World War, despite the fact that the German howitzer, Big Bertha, had its nominal coordinates for Paris set to the location of the Observatory.\nFollowing the armistice after World War I, scientists began to reorganise. Baillaud was one of the most involved of those responsible for the creation of the\nInternational Astronomical Union\n, combining the\nCarte du Ciel\nⓉ\n(\nMap of the sky\n)\n, the Solar Union and the Bureau International de l'Heure, and he was elected as the founding president, serving from\n1919\nto\n1922\n.\nBaillaud retired as Director of the Paris Observatory in\n1926\n, and was awarded with the title of Honorary Director.\nHe had eight children including two sets of twins: Émile\n1874\n-\n1945\n, Jules\n1876\n-\n1960\n, Madeleine\n1877\n-\n1961\n, Henri\n1877\n-\n1939\n, Marthe\n1882\n-\n1978\n, René\n1885\n-\n1977\n, Pierre\n1885\n-\n1906\n, and Hélène\n1892\n-\n1976\n. Two of his children became astronomers: Jules became an Assistant at the Paris Observatory; René became the Director of the Observatory of Besançon\n(1930\n-\n1957)\n. A letter he wrote to his wife on\n12\nOctober\n1891\nreveals much about him and his desires for his children\n(\nsee for example\n[\n2\n]\n)\n:-\nAs much as I have seemed to be occupied with the work entrusted to me, I can say openly that these concerns have been secondary for me. My real life is in you and my children, who are ours, and the first form of our immortality. I'm glad to see you happy, sweet. These children are good. They take after their mother, and no quality is more important. That's the cure for all ills, for all the difficulties of life in this world, for all temptations. Keep them this way. They will work, if only for good. They will understand, as they grow, that there are people who suffer, who lack the necessities, who have neither the well-being that allows a pleasant life, nor the joys and religious and moral consolations which are the real life, and which give true happiness. They will conclude for themselves that being privileged in the midst of so many people who suffer, they must repay, through their work and dedication to others, all that they have received from society. The education they receive, they owe to the society that has well rewarded the efforts of their father. They owe much to their mother who has devoted all of her time and all of her efforts to them, and who has herself received from society noble and elevated feelings which are the most enviable charm. They will want, when their turn comes, to be good for everyone, be able to make their work render to their less fortunate fellow citizens all they have received. I have full confidence in all of them. They will never forget these feelings which seem to their father the most urgent duty, the debt I owe to others.\nBaillaud's lifetime of work in astronomy did not go unrecognised: in\n1923\n, he won the Bruce Medal from the Astronomical Society of the Pacific; he was awarded the honorary degree of Sc.D.\n(\nDoctor of Science\n)\nby the University of Cambridge; there is a crater on the moon named after him\n(\nBaillaud, approved\n1935)\nas well as the asteroids\n11764\nBenbaillaud and\n1280\nBaillauda.\nBaillaud died on\n8\nJuly\n1934\nand has been remembered as a remarkable professor with a great amount of administrative proficiency. Four years after his death, the Alumni Association of the Middle School of Chalon-sur-Saône began work to place a bronze bust of Baillaud in the Courthouse Square. It was not actually intended for public display, but it is currently displayed in Corneilla-la-Rivière, a town in the Pyrénées-Orientales department in southern France.",
  "math_areas": []
}