{
  "nome_completo": "Adrien Quentin Buée",
  "nome_curto": "Adrien Quentin Buée",
  "ano_nascimento": "1745",
  "ano_morte": "1825",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Buee/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Adrien Quentin Buée\nwas the son of Adrien Joseph Buée\n(1708\n-\n1778)\nand Marie-Angélique Gantellet\n(\nborn\n1714)\n. He had brothers Pierre Louis Buée\n(1746\n-\n1827)\nand Auguste Buée. Let us note that there appears to be some confusion over the year of Buée's birth, with some sources giving\n1748\n, for example\n[\n4\n]\n,\n[\n5\n]\nand\n[\n6\n]\n. We have chosen to give\n1745\n, following the most recent research on Buée contained in\n[\n3\n]\n. The confusion does not end there, however, since\n[\n3\n]\nquotes a source, the\nAvant Coureur\nof\n11\nApril\n1768\n, in which Buée is described as \"aged\n19\nto\n20\n\" which fits the\n1748\ndate. May we suggest that the probably incorrect\n1748\ndate may well originate from this reference to his age in\nAvant Coureur.\nThere is no information about Buée's education. We know that he became a fine musician and a well-educated priest who had a surprisingly deep understanding of mathematics. This learning must have been gained at least in part during his education as a young man but no details have so far come to light. The first we know about Buée is that he arrived in Coutances Cathedral as master of music in February\n1766\n. The Cathédrale Notre-Dame de Coutances was constructed in the\n12\nth century in Coutances, a city in the department of Manche in Normandy, north west France. Buée's appointment was to replace the previous master of music at Coutances Cathedral, Pierre Simon Hollet de la Place, who had died on\n5\nJanuary\n1766\naged only twenty-four or twenty-five.\nThe Concert Spirituel was one of the first public concert series beginning in Paris in\n1725\nand continuing until\n1790\n. Buée's brother Pierre Louis Buée was master of music of the cathedral of Dijon and had his motet\nBenedic, anima mea\nperformed at the Concert Spirituel on\n26\nMay\n1765\n. In early April, Adrien Quentin Buée emulated his brother by having one of his motets performed at the Concert Spirituel in Paris. The\nAvant Coureur\nof\n11\nApril\n1768\nreported:-\nWe announced that the two Motets on the Pseaume Super Flumina, which won the two prizes, were from the Abbé Giroust, Music Master of the Orléans Cathedral. There was a third Motet which deserved to compete, and which was also heard at the Concert with pleasure, it is by M Buée, Master of Music of the Cathedral of Coutances, aged\n19\nto\n20\n. The Connoisseurs and the Amateurs have found that this composer possessed his art perfectly, that he knew how to design his composition with taste and that he lacked only the expression and the correct application of the music to the sense of the words, and it is the fruit of study and of reflection that he will not fail to acquire and that we can hope for his happy talents and his noble emulation.\nOn Thursday\n2\nJune\n1768\nBuée had another of his motets performed at the Concert Spirituel, namely\nNoli amulari\n. The fame he had achieved at the Concert Spirituel was a factor in Buée being recommended for the position of music master in the collegiate church of Saint-Martin in Tours in September\n1768\n. A collegiate church is manned by canons, and one of the early Abbots of Saint-Martin of Tours had been\nAlcuin of York\n. Buée was given until Christmas to arrange his departure from Coutances. He arrived in Tours to take up the position on\n3\nDecember, in plenty of time for Christmas. There was some unhappiness that Buée had left Coutances and a leading musician wrote to the canons of the cathedral of Coutances expressing regret that they had not increased his wages to try to keep such a talented young musician.\nIn August of\n1771\nBuée obtained a six week leave to go to Paris. In Paris he was able to get some of his music published, in particular, \"masses for the use of the collegiate church of Saint-Martin.\" It appears that he made the most of this time to study with leading masters and to make friends with influential musicians. He was allowed to extend his stay in Paris for a few extra days and one of the canons from Tours asked him to buy copies of certain printed masses. He continued to lead this life, going to Paris for quite long visits; for example in\n1775\nhe went from January to \"the first Sunday in Lent.\" Although there is no evidence that Buée studied mathematics during his visits to Paris, from the expertise he later showed, it seems highly likely that he did discuss mathematics, a subject which seems to have been as interesting to him as music. In the summer of\n1780\nhe went to Paris and in December of that year his Chapter supported him in his request to the Archbishop that he take holy orders.\nIn July\n1782\nhe again obtained permission to go Paris where he intended looking for a new position. In December of that year the canons of Tours record his departure with sadness, praising his high qualities, and note that he will take up the position of master of music at the parish church Saint-Paul in Paris. This does not seem to be a very prestigious position but it appears that Buée was wanting to be in Paris to be in a position to look for something more important. Indeed in April\n1786\nhe was appointed as successor to his brother as secretary and librarian of Notre-Dame cathedral chapter. It appears to be his great intellectual abilities rather than his musical skills which earn him this position but there were difficulties with the music master who was dismissed in the following year and Buée begins \"teaching music and composition to altar boys.\"\nIn\n1789\nthe storming of the Bastille saw the start of the French Revolution which brought massive changes to life in France. In February\n1790\nall religious orders were abolished, those clergy who were not dismissed became employees of the state. Buée remained as a priest in the diocese of Paris, and was an incumbent of the chapel Sainte-Anne and that of Saint-Eutrope but without income. Buée was strongly opposed to the Revolution and began publishing strongly worded anti-Revolution pamphlets. In\n1790\nhe published\nDe par la Mère Duchesne, Anathèmes très-énergiques contre les jureurs, ou, Dialogue sur le serment et la nouvelle constitution du clergé : entre M Bridoye, franc parisien, soldat patriote, M Recto, marchand de livres, ou tout simplement bouquiniste, M Tournemine, chantre de paroisse, et la mère Duchesne, négociante à Paris, autrement dit, marchande de vieux chapeaux\nⓉ\n(\nFrom Mother Duchesne, Very energetic anathemas against the jurors, or, Dialogue on the oath and the new constitution of the clergy: between M Bridoye, a French Parisian  and patriotic soldier, M Recto,  a bookseller , M Tournemine, parish cantor, and mother Duchesne,  a seller of old hats\n)\n and in\n1792\nhe published\nNouveau dictionnaire, pour servir à l'intelligence des termes mis en vogue par la Révolution, dédié aux amis de la religion, du Roi et du sens commun\nⓉ\n(\nNew dictionary, to explain terms put in vogue by the Revolution, dedicated to the friends of religion, the King and common sense\n)\n.\nIn October\n1790\npriests were not allowed to teach and in November an oath requiring loyalty from the Clergy was drafted by the Revolutionary Assembly and was enforced by the end of the year. In March\n1792\nthe Pope issued a papal bull excommunicating any priests who took the oath. Buée became a \"prêtre réfractaire\", that is a priest who had refused to take the oath imposed upon them, also called non-jurors. Being hunted down, prêtres réfractaires either went into hiding or fled the country. Buée choose to flee to England and settled in Bath.\nBath had a strong music tradition and one might have expected to find Buée's name among the Bath musicians. We have not be able to find any such, however, and all references to Buée that we have found for the time he spent in Bath refer to his work in mathematics and its applications. For example, in\n1797\nwe find several of the problems in Dr\nHutton\n's\nMathematical Repository\nbeing answered by Buée.\nIn\nThe Monthly Magazine\n7\n(1799)\nwe read on page\n319\n:-\nMr A Q Buée, a French clergyman of Bath, the intimate friend of the celebrated Mrs Hauy, is about to publish a work entitled, \"Recherches Mathematiques sur la texture intime des Corps.\"\nⓉ\n(\nMathematical Research on the Intimate Texture of Bodies.\n)\nWe are somewhat puzzled about the reference to \"the celebrated Mrs Hauy\". We do not know who this person is but suspect it is a misprint for \"the celebrated M Haüy.\" Buée was certainly a friend of René-Just Haüy\n(1743\n-\n1822)\nwho, like Buée, was a Roman Catholic priest who made important contributions to science, particularly to crystallography. We quote below comments made by Buée about \"Abbé Haüy's Theories of Crystallography.\"\nMore details of Buée's\n\"Recharches Mathematiques\n\" are given by William Nicholson who writes in\n[\n1\n]\n:-\nProposals have been circulated by Mr A Q Buée, a French clergyman at Bath, for publishing, by subscription, a work entitled 'Recherches Mathematique sur la Texture intime des corps'; or, 'Mathematical enquiries concerning the intimate texture of bodies'; of which he is the author. It will be printed on fine paper, and illustrated with five copperplates. The manuscript is in the hands of the printer, and the work will be put to press as soon as one hundred and fifty subscribers shall be obtained at half a guinea each: the price will be greater to non-subscribers.\nNicholson continues giving a review of the outline which Buée gives of his proposed work. For details see\nTHIS LINK\n.\nIn the\nPhilosophical Magazine\n9\n(1801)\nwe read on page\n55\n:-\nM Buée, an ingenious French clergymen, in a letter from Bath to the editor, dated\n8\nth instant, wherein he mentions the 'Philosophical Magazine' with deserved commendation, shows that ...\"\nIn fact Buée shows how to correct an error in\nLazare Carnot\n's\nThe Principles of the Differential and Integral Calculi\n.\nIn\n1796\nWilliam Frend published\nThe Principles of Algebra\n. In this work he opposes the use not only of imaginary numbers, but also of negative numbers. On\n21\nJune\n1801\nBuée wrote a letter to William Frend which\nDe Morgan\nreports on in\nTrigonometry and Double Algebra\n(1849)\n:-\nPerhaps\n[\nFrend's\n]\nwork suggested M Buée's memoir. I have a letter in my possession from M Buée to Mr Frend, dated June\n21\n,\n1801\n, by which it appears that the former was desired by a gentlemen in whose house he was living\n(\nas tutor, perhaps\n)\nto write a private reply to Mr Frend's objections. This letter evidently contains the germs of the views which he afterwards published. ... According to Dr\nPeacock\n, M Buée is the first formal maintainer of the geometrical significance of √-\n1\n.\nBuée's memoir, referred to by\nDe Morgan\nin this quote, was the\nMémoire sur les quantités imaginaires\nⓉ\n(\nMemoir on imaginary quantities\n)\nwas read in\n1805\nat the\nRoyal Society\nand was published in\n1806\n. Gert Schubring writes\n[\n6\n]\n:-\nBuée's paper is remarkable in its systematic evaluation of the earlier French discussion on the nature of negative and imaginary quantities. He achieves the establishment of a conceptual connection between the two basic concepts of length or absolute value and of direction which had been separated so systematically in France during the\n18\nth century. Buée's achievements are likewise important for the conceptual development of the negative numbers and for the graphical representation of the complex numbers.\nBuée writes in the paper:-\n√-\n1\nis therefore not the sign of an arithmetic operation, nor of an arithmetic-geometric operation, but of a purely geometric operation. It is a sign of perpendicularity.\nIn\n1808\nJohn Playfair\ncriticised Buée's paper in an article he wrote for the\nEdinburgh Review\n. Playfair writes:-\n... there have been more than one attempt to treat imaginary quantities as things really existing, or as certain geometrical magnitudes which it is possible to assign. The paper before us is one of these attempts; and the author, though an ingenious man, and, as we readily acknowledge, a skilful mathematician, has been betrayed into this inconsistency by a kind of metaphysical reasoning, which we confess ourselves not always able to understand.\nIn the\n1850\ns,\nHamilton\nand\nDe Morgan\ndiscussed Buée's\n1806\npaper in their correspondence; see\nTHIS LINK\n.\nIn\n1804\nBuée published\nParallel of Romé de l'Isle's and the Abbé Haüy's Theories of Crystallography\n. The work is described as follows:-\n[\nBuée's\n]\nshort study on crystallography was translated by Robert Clifford  and privately printed. The work had been published in the Philosophical Magazine\n(\nnos.\n74\n-\n75\n,\n1804)\nunder the title \"A letter from Abbé Buée to Mr ****, on Mr Romé de l'Isle and the Abbé Haüy's theories of crystallography.\" Originally written in French, Buée had authored the letter in order to contrast the differences between the crystallographic systems of Romé de l'Isle and Haüy, which at the time were both considered similar in nature. It is an important critique of Romé de l'Isle's system, which Buée characterizes as primarily descriptive, as opposed to Haüy's mathematically based system.\nIn describing Abbé Haüy's Theories of Crystallography, Buée writes:-\nI have now, sir, but one task left; to peak of the application our author has made of algebra and geometry to crystallography. Many persons complain of the difficulty necessarily resulting from it in the study of mineralogy; and dare not engage in it, uncertain whether they will find a compensation for their trouble. Our author has therefore adopted a double plan, and begins by exposing his theory by a series of reasonings and arguments which will suffice to make the reader understand it, or any discoveries made in consequence of it. He then exposes the theory in the most correct of all languages - mathematical analysis; by far the most interesting, and the only means of making discoveries oneself; and who can be callous to the pleasure of discovering an unknown truth?\nIn\n1814\nBuée left Bath and returned to France where he became an honorary canon at Notre-Dame Cathedral in Paris. He continued to publish works on science, mathematics and politics. For example he published\nRéflexions sur les deux éditions des oeuvres de Voltaire\nⓉ\n(\nReflections on the two editions of Voltaire's works\n)\n(1817)\n,\nNotice sur M Laplace\nⓉ\n(\nNote on M Laplace\n)\n(1817)\n, and\nSur la révolution française et sur le gouvernement représentatif\nⓉ\n(\nOn the French Revolution and on representative government\n)\n(1821)\n. Buée continued his interest in the foundations of mathematics and wrote to a \"mathematical gentlemen in London, who declines communicating his name to the public.\" His letter was published as \"Solution to a Problem of Col Silas Titus\" in the\nAnnals of Philosophy\nin January\n1815\n. Buée's letter begins:-\nHaving for many years considered the different algebraical methods for the solution of arithmetical problems by approximation to be deficient in their fundamental principles, I have been led to mistrust the whole science of algebra as generally taught, and am convinced that if we place implicit faith in it we shall be involved in the most revolting absurdities.\nPell\n's problem, and all those which can be resolved by approximation, are examples of this kind.\nThe death of the Abbé Adrien-Quentin Buée, honorary canon of Notre-Dame Cathedral, is mentioned in number\n46\nof\nL'Ami de la Religion et du Roi\nⓉ\n(\nThe friend of religion and the King\n)\n(1826)\nwhere the two lines of text are especially careful to distinguish him from his brother Pierre-Louis Buée. We note that the two are indeed confused in many biographies.\nFinally we note that Adrien-Quentin Buée is still remembered today by musicians who still perform his musical compositions and by mathematicians who understand that he was one of the originators of the geometrical interpretation of complex numbers.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}