{
  "nome_completo": "Adriaan Vlacq",
  "nome_curto": "Adriaan Vlacq",
  "ano_nascimento": "1600",
  "ano_morte": "1667",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vlacq/",
  "lugar_nascimento": "Gouda, Netherlands",
  "lugar_morte": "The Hague, Netherlands",
  "biografia": "Adriaan Vlacq\nwas born into a well off family. It is unclear how much mathematical training Vlacq had but he became friendly with a surveyor Ezechiel de Decker who was particularly interested in the new ideas of calculating using tables of logarithms. Vlacq worked with de Decker and translated Latin books written by\nNapier\nand\nBriggs\ninto Dutch for him. Together they decided to publish Dutch editions of these important aids to calculation. In\n1626\nHet eerste deel van de Nieuwe telkonst\nⓉ\n(\nThe first part of the new thesis\n)\nwas published under de Decker's name with acknowledgement to Vlacq for considerable help. This contained three items: a Dutch translation of\nNapier\n's\nRabdologiae\nⓉ\n(\nCollection of rods\n)\nwhich described a method of multiplication using \"numbering rods\"; a paper by de Decker written to help businessmen undertake arithmetical calculations; and\nStevin\n's\nLa Thiende\nⓉ\n(\nThe tenth\n)\nwhich gave an account of decimal fractions.\nBriggs\nhad published\nArithmetica logarithma sive logarithmorum chiliades triginta, pro numeris naturali serie crescentibus ab unitate\n20\n,\n000\net a\n90\n,\n000\nad\n100\n,\n000\n...\nⓉ\n(\nLogarithmic arithmetic, or the logarithms of  natural numbers from\n1\nto\n20\n,\n000\nand from\n90\n,\n000\nto\n100\n,\n000\n...\n)\nin\n1624\nand de Decker published a small part of this in\n1626\nunder the name\nNieuwe telkonst\n. This contained\nBriggs\n's logarithms from\n1\nto\n10\n,\n000\nbut promised to publish, with Vlacq's assistance, a further work giving the logarithms from\n1\nto\n100\n,\n000\n.\nBriggs\n's own tables were, as the above title indicates, of logarithms of\n1\nto\n20\n,\n000\nand\n90\n,\n000\nto\n100\n,\n000\nso\n70\n,\n000\nvalues needed to be calculated to complete the table. The full table of logarithms of\n1\nto\n100\n,\n000\nappeared in\n1627\nas\nHet tweede deel van de Nieuwe telkonst\nⓉ\n(\nThe second part of the new thesis\n)\nunder de Decker's name with again acknowledgement to Vlacq.\nStruik\nwrites:-\nThe 'Tweede deel' of\n1627\n, actually the first complete table of decimal logarithms, was long forgotten until a copy was rediscovered in\n1920\n.\nIn\n1628\nVlacq republished the\n10\ndecimal place logarithm tables as\nArithmetica logarithma sive logarithmorum chiliades tentum, pro numeris naturali serie crescentibus ab unitate ad\n100000\n...\nⓉ\n(\nLogarithmic arithmetic, or  natural numbers, the increase in the one for the ...\n100000\n)\n. He appears to have had a connection with the Gouda firm of Petrus Rammaseyn and it is this firm that published the work, this time under Vlacq's name. A French translation,\nArithmetique logarithmetique, ou, La construction et usage d'une table contenant les logarithms de tous les nombres depuis l'unité jusque\n100000\nⓉ\n(\nLogarithmic arithmetic  or the construction and use of a table containing the logarithms of all numbers from\n1\nto\n100000\n)\nby Vlacq was also published Petrus Rammaseyn at almost the same time. It had long been believed that the new calculation of the\n70\n,\n000\nmissing logarithms from\nBriggs\n's work were made by Vlacq so, as\nStruik\nwrites in\n[\n1\n]\n:-\nHaving paid for the publication of tables he himself had computed, Vlacq saw no objection to republishing them under his own name ... Although de Decker was not mentioned, there is no indication he later resented this. Vlacq's fame rests on these tables, which were well received and contain relatively few errors.\nIn\n[\n2\n]\n, however, Bruins concludes that Vlacq was not a mathematician, and that most of the work was done by de Decker.\nVlacq became a bookseller and publisher who, in\n1632\n, settled in London and opened a bookshop. Tension between King Charles I and the House of Commons steadily increased during\n1641\nand after his unsuccessful attempt to arrest five members of Parliament on\n4\nJanuary\n1642\nCharles left London on\n10\nJanuary and King and Parliament prepared for war. Vlacq decided that London was not a good place to sell books with the approaching unrest so he left for Paris in\n1642\n. A dedication in a book he published\n10\nyears later suggests that he sympathised with the Royalist side in the Civil War.\nIn Paris Vlacq again set up a book business. He remained there for six years before returning to The Hague where he again sold and published books.\nVlacq also constructed logarithm trigonometric tables which he published as\nTrigonometria artificialis\nⓉ\n(\nTrigonometrical logarithms\n)\nin\n1633\nduring his time in London. These were again published by Petrus Rammaseyn in Gouda and gave values for angles at\n10\nsecond increments. Since these tables were bulky, he decided to publish a smaller version. This appeared in\n1636\nas\nTabulae sinuum, tangentium et secantium et logarithmi sinuum, tangentium et numerorum ab initate ad\n10000\nⓉ\n(\nTables of sines, tangents and secants, and the logarithms of sines, tangents and integers from\n1\nto\n10000\n)\n. A French version\nTables de sinus, tangentes, secantes, et de logarithmes\nⓉ\n(\nTables de sines, the tangents, secants, and of their logarithms\n)\nwas published by Rammaseyn in the same year, as was a German version\n[\n1\n]\n:-\nThese tables, carried to seven decimal places, were a great success and were often reprinted and reedited ...\nVlacq also published many mathematical works by other authors including, perhaps surprisingly,\nBriggs\nhimself and also by\nGellibrand\n.",
  "math_areas": [
    "Number Theory"
  ]
}