{
  "nome_completo": "Agner Krarup Erlang",
  "nome_curto": "Agner Erlang",
  "ano_nascimento": "1878",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Erlang/",
  "lugar_nascimento": "Lonborg (near Tarm), Jutland, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Agner Erlang\n's mother, Magdalene Krarup, came from an ecclesiastical family but she was descended from the mathematician Thomas Fincke. Magdalene broke with the family tradition, which was that all sons became clergymen and all daughters married clergymen, when she married Hans Nielsen Erlang, a schoolmaster and parish clerk. Hans Nielsen had trained to be a schoolteacher at the college in Jelling, choosing this Danish style training in preference to the German style training offered at the college in Tonder. Agner was the second of his parents' four children, having an older brother Frederik and two younger sisters Marie and Ingeborg. Hans Nielsen was a clever, hardworking man but bringing up a family on a schoolmaster's salary was hard. However, Magdalene and Hans Nielsen made a happy if simple home for their family making sure that they had sufficient food prepared which they prepared in the most hygienic manner possible.\nAgner was a bright child, learning quickly and having an excellent memory\n(\n[\n6\n]\n,\n[\n7\n]\n)\n:-\n... he was a quiet and peaceable boy who preferred reading to playing with the other boys. In the evenings, he and his elder brother would often share the reading of a book between them, the usual procedure being that brother Frederik would read it in the approved manner, while Agner, sitting opposite to him at the table, would read the book upside-down.\nAgner was educated at his father's school when he was young, studying there with his brother and sisters. Astronomy was his favourite subject, encouraged by his maternal grandfather who also loved it, but Agner combined that interest with another passion by writing poems about astronomical objects. After his primary education, he was tutored at home by his father and another teacher from his father's school. He took his Praeliminaereksamen examination in Copenhagen at the age of fourteen and passed with special distinction after having to obtain special permission to take the examinations because he was below the minimum age. His brother, who was two years older, went with him to Copenhagen with him and took the Praeliminaereksamen at the same time.\nFrom Copenhagen, Agner returned to Lonberg and became a teacher at his father's school for two years. He continued his education during these years, however, being tutored in French and Latin. Hans Nielsen arranged with one of his wife's relatives to let Agner live in their home in Hillerod for two years while he studied at the Frederiksborg Grammar School preparing to sit the university entrance examinations. This arrangement whereby he got free board and lodgings was necessary because of the Erlang family's financial position. In\n1896\nhe passed the entrance examination, the Studentereksamen, to the University of Copenhagen with distinction and, since his parents were poor, he was given free board and lodgings in a College of the University of Copenhagen. His studies at Copenhagen were in mathematics and natural science. He attended the mathematics lectures of\nHieronymous Zeuthen\nand\nChristian Juel\nand these gave him an interest in geometrical problems which were to remain with him all his life.\nAfter graduating from Copenhagen in January\n1901\nwith mathematics as his major subject and physics, astronomy and chemistry as secondary subjects, he taught in schools for the next seven years. Among these schools we mention three in Copenhagen, the Gammelholms Latin-& Realskole, the Femmers Kvindeseminarium and the Lang & Hjorts Kursus, and we also mention the Vamdrup Realskole in South Jutland\n[\n3\n]\n:-\nEven though his natural inclination was toward scientific research, he proved to have excellent teaching qualities. He was not highly sociable, he preferred to be an observer, and had a concise style of speech. His friends nicknamed him \"The Private Person\". He used his summer holidays to travel abroad to France, Sweden, Germany and Great Britain, visiting art galleries and libraries.\nDuring this time he kept up his interest in mathematics, and he received an award in\n1904\nfor an essay on\nHuygens\n' solution of\ninfinitesimal\nproblems which he submitted to the University of Copenhagen. Also significant was his friendship with H C Nybolle, whom he met through a shared interest in the Christian Students' Association at the University of Copenhagen. A few years later Nybolle became professor of statistics at the University of Copenhagen and their friendship also became a scientific collaboration.\n(\nWe note that Erlang's elder brother later married Nybolle's sister.\n)\nErlang's interests turned towards the theory of\nprobability\nand he kept up his mathematical interests by joining the Danish Mathematical Association. At meetings of the Mathematical Association he met\nJohan Ludwig Jensen\nwho was then the chief engineer at the Copenhagen Telephone Company.\nJensen\npersuaded Erlang to apply his skills to the solution of problems which arose from a study of waiting times for telephone calls.\nIn\n1908\nErlang joined the Copenhagen Telephone Company as a scientific collaborator and the head of their newly established physico-technical laboratory, and he began applying probability to various problems arising in the context of telephone calls. He published his first paper on these problems\nThe theory of probability and telephone conversations\nin\n1909\n. In this paper he showed that if telephone calls were made at random they followed the Poisson distribution, and he gave a partial solution to the delay problem. In\n1917\nhe published\nSolution of some problems in the theory of probability of significance in automatic telephone exchanges\nin which he gave a formula for loss and waiting time which was soon used by telephone companies in many countries including the British Post Office.\nIn the twenty years that Erlang worked for the Copenhagen Telephone Company he never had to take a day off through illness. However, in January\n1929\n, at the age of\n51\nhe began suffering from abdominal pains and went into hospital for an operation. He died a few days later.\nBrockmeyer writes about Erlang's mathematical works in\n[\n4\n]\n(\nreprinted in\n[\n5\n]\n)\n:-\nThe greatest, and by far the most important, part of Erlang's production comprises his works concerning the application of the theory of probability to problems of telephone traffic. The investigation of these problems constituted an essential part of his activities throughout the\n20\nyears he spent as a scientific collaborator of the Copenhagen Telephone Company. Characteristic of Erlang's achievements within this field are his endeavours to deduce as much as possible from the single basic principle. In the case of these problems he found this basic principle in the assumption of the statistic equilibrium, a concept which was known, it is true, from other domains; it was Erlang's works, however, that disclosed the wealth of possibilities contained in this principle with regard to the theory of telephone traffic. The mathematically exact methods of solving problems of loss and waiting times, which Erlang developed by his employment of the principle of statistic equilibrium, are of fundamental importance in the theory of telephone traffic.\nIn addition to his work on probability Erlang was also interested in mathematical tables. This interest is described in\n[\n4\n]\nand\n[\n5\n]\n:-\nA subject that interested Erlang very much was the calculation and arrangement of numerical tables of mathematical functions, and he had an uncommonly thorough knowledge of the history of mathematical tables from ancient times right up to the present. Erlang set forth a new principle for the calculation of certain forms of mathematical tables, especially tables of logarithms...\nOriginally published in Danish in\n1910\n, an expanded version describing these new principles was published in English as\nHow to reduce to a minimum the mean error of tables\nwhich he contributed to the\nNapier\nTercentenary Memorial Volume published by the\nRoyal Society of Edinburgh\nin\n1915\n.\nErlang never married, perhaps because he fell in love with a young girl who eventually married one of his colleagues. He lived with his youngest sister Ingeborg for many years. Let us quote from\n[\n6\n]\n(\nor the reprint\n[\n7\n]\n)\nconcerning his personality:-\nErlang had a noteworthy and original personality. He was a sincere Christian in a sympathetic way, at the same time being full of humour and satirical wit; outwardly, his heavy red full beard and his manner of dressing lent a certain artistic touch to his characteristic appearance. Extremely modest and unobtrusive of demeanour, he preferred the peaceful atmosphere of his study to social gatherings and festivities; he never touched alcoholic liquors nor smoked tobacco. ... Erlang was a beneficent man; living frugally, he could afford to help others, which he did to an even very great extent.\nWe get further insight into his character from\n[\n3\n]\n:-\nHe collected a large library of books mainly on mathematics, astronomy and physics, but he was also interested in history, philosophy and poetry. Friends found him to be a good and generous source of information on many topics. He was known to be a charitable man, needy people often came to him at the laboratory for help, which he would usually give them in an unobtrusive way.\nAt a meeting in Montreal in October\n1946\n, Le comité consultatif international des communications téléphoniques à grande distance made the decision to name the International Unit of Telephone Traffic the \"erlang\".\nDavid Kendall\nwrites\n[\n14\n]\n:-\nTelephone traffic is now said to have an intensity of m erlangs if m calls are expected during an interval equal to the mean holding-time. The quantity thus measured is of course dimensionless, and the erlang is to be compared with the octave, the stellar magnitude and the decibel in describing the mode of calculation rather than the unit of measurement in the usual sense of physics.\nErlang has also been honoured by Ericsson Communications when it named the Erlang programming language after him. This programming language is mainly used for large industrial real-time systems. His name is also given to the statistical probability distribution that he used in his work.",
  "math_areas": [
    "Algebra",
    "Statistics"
  ]
}