{
  "nome_completo": "Agnes Mary Scott",
  "nome_curto": "Agnes Scott",
  "ano_nascimento": "1894",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scott_Agnes/",
  "lugar_nascimento": "Jersey",
  "lugar_morte": null,
  "biografia": "Agnes Scott\n's  father was William Scott and her mother was Harriet Scott. She had two older siblings Isabella H Scott and Annabell C Scott; three younger siblings Muriel E Scott, William B Scott and Agnes M Scott.\nShe entered Dunoon Grammar School in\n1900\nwhen she was six years old. After five years at the school she then attended Boroughmuir Higher Grade School, Edinburgh, for seven years. She took the Leaving Certificate examinations and passed Drawing and Science at the Lower level in April\n1912\nand, at the same sitting, English, Latin, French, and Mathematics at Higher grade. After having passed the Preliminary Examination, Scott first matriculated at Edinburgh University in October\n1912\n.\nDuring her first two sessions at university she studied Ordinary level courses, Mathematics\n(\nthe First Ordinary she took in\n1912\n-\n13\nwas taught by\nDavid Gibb\n, the Second Ordinary in\n1913\n-\n14\nby\nDavid Gibb\nand John Urquhart\n)\n, Chemistry, Natural Philosophy, and Education. She then took Honours courses in Mathematics\n(\nthe Intermediate Honours course she took in\n1914\n-\n15\nwas taught by\nLester R Ford\nand\nDavid Gibb\n)\nand Natural Philosophy and graduated in\n1917\nwith an M.A. with Third Class Honours in Mathematics and Natural Philosophy, and a B.Sc.\n(\nPure\n)\n.\nBefore graduating, Scott joined the\nEdinburgh Mathematical Society\nin January\n1917\n. She gave her address as Argyle Cottage, Liberton, the same as she had given when she matriculated at Edinburgh University, and clearly her family address. By\n1923\nshe was teaching in Singapore, giving her address as Raffles Girls' School, Bras Basah Road, Singapore. She left the Society around\n1932\n.\nShe married George Waddell on\n17\nAugust\n1929\nat the Presbyterian Church, Singapore and she arrived back in London on\n15\nJune\n1936\n.",
  "math_areas": []
}