{
  "nome_completo": "Ágoston Scholtz",
  "nome_curto": "Ágoston Scholtz",
  "ano_nascimento": "1844",
  "ano_morte": "1916",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scholtz/",
  "lugar_nascimento": "Kotterbach, Zips district, Austro-Hungary (now Rudnany, Slovakia)",
  "lugar_morte": "Veszprém, Hungary",
  "biografia": "Ágoston Scholtz\nwas born in the village of Kotterbach in the Szepes district of the Austro-Hungarian Empire. This region remained part of the Austro-Hungarian Empire throughout Scholtz's lifetime but in\n1920\n, a couple of years after his death, the Treaty of Trianon divided the Austro-Hungarian Empire and this district became part of Czechoslovakia. In\n1992\nthe district became part of Slovakia. A consequence of these changes is that the names of the towns have changed and we will give the Hungarian names, as they were when Scholtz lived there, as well as the present Slovak names. We also try to give the German names of the towns but the situation can be quite complicated. For example Kotterbach, the town where Scholtz was born, was known as Otosbanya or Kotterbach in Hungarian, Koterbach or Koterbachy in German, and today is Rudnany in Slovakia.  Kotterbach is a small village near the city of Igló, the biggest town in the district, which also has a collection of different names such as Neuendorf or Neudorf in German, Igló in Hungarian, and its present name of Spisska Nova Ves in Slovakia. The district in which these towns are situated was called the Szepes district in Hungarian, the Zips district in German, and is today the Spis district of Slovakia. Kotterbach owes its existence to the mining industry, being the place where workers in the silver, iron, mercury and copper mines lived. Given this, it will come as no surprise to learn that Scholtz' father was a supervisor of mines.\nScholtz attended grammar school in the towns of Igló, Rozsnyó\n(\nRosenau in German and today Roznava in Slovakia\n)\nand Löcse\n(\nLeutschau in German and today Levoca in Slovakia\n)\n. After completing his secondary education he studied at the universities of Vienna and Berlin, where he was awarded a degree in\n1865\n. His first employment was teaching mathematics at the grammar school of Igló, where his younger brother was studying so he his own brother's mathematics teacher.\nFrom\n1871\nhe was a teacher of mathematics and natural philosophy at the Lutheranian Grammar School of Budapest which at that time had been upgraded to become a so called 'chief grammar school', namely one which offered eight years of teaching. This was precisely the school which later was attended by several famous mathematicians such as\nJohnny von Neumann\nand\nEugene Wigner\n(\nor Jenó Pál Wigner as he was called at that time\n)\n. Scholtz became the school director of the Lutheranian Grammar School in\n1875\n. Unfortunately this excellent school was closed in\n1952\n, and most of its equipment was lost. Due to the initiative and support of its former well-known students, among others\nWigner\n, it was reopened in\n1989\nafter being closed for thirty-seven years.\nIn\n1879\nScholtz submitted his\nhabilitation\nthesis\nSome theorems on the whole form of hexagrammum mysticum\n(\nHungarian\n)\nto the Faculty of Arts of the Hungarian Royal University of Budapest\n(\nthe predecessor of the\nLoránd Eötvös\nUniversity\n)\n, where he became a\ndocent\n. In\n1878\n, his habilitation thesis was published by Atheneum Press. In\n1884\nhe was promoted to full professor of mathematics, filling the chair Otto Petzval had occupied. At that time the university had four faculties: arts, law, theology and medicine. The mathematics department was, along with geology, in the faculty of arts.\nAt the Hungarian Royal University, Ágoston Scholtz was a colleague of\nLoránd Eötvös\n. They were often on the same committee set up to examine doctoral candidates, who usually offered mathematics, physics and astronomy as the subjects to be examined. Some famous Hungarian mathematicians took their doctoral examination in front of a committee on which Scholtz was one of the examiners of their main subject and a referee for their thesis. For example, three such mathematicians were\nJózsef Kürschák\nin\n1890\n,\nFrigyes Riesz\nin\n1902\n, and\nLipót Fejér\nalso in\n1902\n.\nFejér\nalso worked as an assistant in Scholtz' department from\n1901\n. Several students who went on to become grammar school teachers wrote their doctoral theses with Ágoston Scholtz as their advisor.\nScholtz was one of the founders of the so called \"table society of mathematicians\" in\n1885\n. The older initiators of the Society were\nJeno Hunyadi\nand Kálmán Szily from the Royal Joseph Technical University and Ágoston Scholtz from the Royal Hungarian University, the middle generation was represented by\nLoránd Eötvös\nand\nGyula König\n, the younger generation by Gusztáv Rados and Manó Beke. This society had no head and no basic documents or constitution. They had meetings twice a month aimed at mathematics and physics teachers from both universities and secondary schools. After listening to mathematics and physics lectures concerning the most interesting current developments, they would sit down to dinner\n(\nsee\n[\n12\n]\n)\n.\nDenes Konig\nwrites\n(\nquoted in\n[\n4\n]\n)\n:-\nThe Society had no presidents or statutes and their meetings often looked like dinner parties but for the solemn blackboard.\nThe more formal association, the Hungarian Mathematics and Physics Association, was founded in\n1891\n. Ágoston Scholtz was a member of its main committee which consisted of twenty-four people.\nScholtz's field of research was projective geometry and theory of\ndeterminants\n. His results were recorded by\nMuir\nin his famous work\nThe history of determinants\nand some of the most significant are presented in\n[\n4\n]\n. One of his main collaborators was\nJeno Hunyadi\nwho was six years older than Scholtz and died in\n1889\n. They considered projective geometrical questions about conic sections and they transformed these questions into algebraic equations, where the determinant came into play. At that time it was usual to consider so called compound determinants where the entries of the matrix were also determinants themselves. In\nSix points lying on a conic section, and the theorem hexagrammum mysticum\n(1877)\nand\nSechs Punkte eines Kegelschnittes\n(1878)\nhe proved\nPascal\n's theorem in\nSteiner\n's generality, by reducing it to an equation involving certain determinants. An intermediate step was to consider a matrix, which was later called the\nHunyadi\n-Scholtz matrix. It is the matrix of a linear transformation induced on the vector space of homogeneous degree\n2\npolynomials by a linear substitution. In later years this was called the power transformation. In\nSix points lying on a conic section, and the theorem hexagrammum mysticum\n(1877)\nand\nSechs Punkte eines Kegelschnittes\nⓉ\n(\nSix points on a conic\n)\n(1878)\nit was proved for\nn\n=\n3\nn = 3\nn\n=\n3\nthat the determinant of this transformed matrix is\nD\nn\n+\n1\nD^{n+1}\nD\nn\n+\n1\n, where\nD\nD\nD\nis the determinant of the matrix of the linear substitution. See also\nJeno Hunyadi\n's paper\nBeitrag zur Theorie der Flächen zweiten Grades\nⓉ\n(\nContribution to the theory of second-degree surfaces\n)\n(1880)\n.\nHe gave a lecture at the\nHungarian Academy of Sciences\non\n5\nFebruary\n1877\nin which he explained these important results, see\nSix points lying on a conic section, and the theorem hexagrammum mysticum\n(1877)\n. The joint theorem of\nHunyadi\nand Scholtz, the so called\nHunyadi\n-Scholtz determinant theorem in the newer literature, was well known for several decades. Szenassy explains\n[\n4\n]\n:-\nIn spite of the ostensible complexity of generating the higher-order determinant, the\nHunyadi\n-Scholtz theorem proved most useful in a variety of fields. Several mathematicians have applied it, for instance, in research into conic sections and second order surfaces in the cases\nn\n=\n2\nn = 2\nn\n=\n2\nand\nn\n=\n3\nn = 3\nn\n=\n3\n. Many scholars can be listed\n(\ne.g.\nMertens\n,\nPasch\n, Caspary, Müller, Szabó and others\n)\nwho put it to good use in other questions of geometry. Its usefulness in technical problems is less well known: let us refer to Jeno Egervary's paper \"Application of the\nHunyadi\n-Scholtz matrices in the theory of grid structures\"\n(1954)\nin which he studies grid structures with three bars constituting a triangle or six bars constituting a tetrahedron, the structure being loaded by a system of forces in equilibrium.\nThis theorem was used and generalized by several authors; see, for example,\n[\n9\n]\n,\n[\n10\n]\n, and\n[\n11\n]\n.\nScholtz published the paper\nSechs Punkte eines Kegelschnittes\nⓉ\n(\nSix points on a conic\n)\nin the\nArchiv der Mathematik\nin\n1878\n, and around the same time several papers in Hungarian in the\nMüegyetemi Lapok\n. For example\nSix points lying on a conic section, and the theorem hexagrammum mysticum\n(1877)\n,\nOne theorem about determinants\n(1877)\n,\nSix points on a conic section and the theorem of Chasles\n(1877)\n, and\nSome determinant forms of covariant character\n(1878)\n. He also submitted solutions to problems that had been posed in this journal. Unfortunately this Hungarian language mathematics and physics journal only managed to survive for three volumes because of financial difficulties. Scholtz' later papers appeared in the\nNouvelle Annales de Mathématique\n, for example\nRésolution de l'equation du troisiéme degré\nⓉ\n(\nRésolution of the cubic equation\n)\n(1881)\n, and in the\nYearbook of the Grammar School in Igló\n, see\nA remark on light interference\n(1886)\n.\nIn\n1897\nScholtz took part in the first International Congress of Mathematicians held in Zürich, where two young Hungarian mathematicians were giving lectures\n(\nG Rados, and A Stodola\n)\n. Scholtz retired from his chair in\n1909\n. In\n1911\nLoránd Eötvös\ninvited professor\nLipót Fejér\nto become head of the department which had been led earlier by Scholtz.\nÁgoston Scholtz died on\n6\nMay\n1916\nin Veszprém. Further details of his life are given in\n[\n1\n]\n,\n[\n2\n]\n,\n[\n3\n]\n,\n[\n4\n]\n,\n[\n5\n]\n,\n[\n6\n]\n,\n[\n8\n]\n,\n[\n7\n]\n,\n[\n12\n]\n,\n[\n13\n]\n.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}