{
  "nome_completo": "Abu Mahmud Hamid ibn al-Khidr Al-Khujandi",
  "nome_curto": "al-Khujandi",
  "ano_nascimento": "940",
  "ano_morte": "1000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Khujandi/",
  "lugar_nascimento": "Khujand, Tajikistan",
  "lugar_morte": null,
  "biografia": "Few facts about\nal-Khujandi\n's life are known. What little we know comes through his writings which have survived and also some comments made by Nasir al-din\nal-Tusi\n. From\nal-Tusi\n's comments we can be fairly certain that al-Khujandi came from the city of Khujand. The city lies along both banks of the Syrdarya river, at the entrance to the fertile Fergana Valley, and it was captured by the Arabs in the\n8\nth\ncentury.\nAl-Tusi\nsays that al-Khujandi was one of the rulers of the Mongol tribe in that region so he must have come from the nobility.\nAl-Khujandi was supported in his scientific work for most of his life by members of the Buyid dynasty. The dynasty came to power in\n945\nwhen Ahmad ad-Dawlah occupied the 'Abbasid capital of Baghdad. Members of Ahmad ad-Dawlah's family became rulers in different provinces and there was never a great deal of cohesion in the Buyid empire. Al-Khujandi received patronage from Fakhr ad-Dawlah who ruled from\n976\nto\n997\n.\nIt was Fakhr ad-Dawlah who supported al-Khujandi in his major project to construct a huge mural sextant for his observatory at Rayy, which is near modern Tehran. It was believed by many Arabic scientists that the larger an instrument was, the more accurate were the results obtained. In fact al-Khujandi's mural sextant was his own invention and it did break new ground in having a scale which indicated seconds, a level of accuracy never before attempted.\nDuring the year\n994\nal-Khujandi used the very large instrument to observe a series of meridian\ntransits\nof the sun near the\nsolstices\n. He used these observations, made on\n16\nand\n17\nJune\n994\nfor the summer solstice and\n14\nand\n17\nDecember\n994\nfor the winter solstice, to calculate the\nobliquity of the ecliptic\n, and the latitude of Rayy. He described his measurements in detail in a treatise\nOn the obliquity of the ecliptic and the latitudes of the cities\n.\nFrom his observations he obtained\n23\n°\n32\n'\n19\n\" for the obliquity of the ecliptic. This value was lower than values obtained previously\n[\n1\n]\n:-\nAl-Khujandi says that the Indians found the greatest obliquity of the ecliptic,\n24\n° ;\nPtolemy\n23\n°\n51\n' ; himself\n23\n°\n32\n'\n19\n\". These divergent values cannot be due to defective instruments. Actually the obliquity of the ecliptic is not constant; it is a decreasing quantity.\nThere is, however, an error in al-Khujandi's value for the obliquity of the ecliptic; it is about two minutes too low. The error was discussed by\nal-Biruni\nin his\nTahdid\nwhere he claimed that the aperture of the sextant settled about one span in the course of al-Khujandi's observations due to the weight of the instrument.\nAl-Biruni\nis almost certainly correct in pinpointing the cause of the error. However, al-Khujandi's latitude for Rayy,\n35\n°\n34\n'\n38\n.\n45\n\", despite being calculated using his erroneous value for the obliquity of the ecliptic, is accurate to the nearest minute of arc.\nIt remains for us to discuss the claim that al-Khujandi discovered the sine theorem. The claim was made by\nal-Tusi\nwho gives al-Khujandi's proof of the result for spherical triangles in his\nShakl al-qatta\n. Although there is no reason to doubt\nal-Tusi\nthat the proof he gives does indeed come from al-Khujandi there is quite a few reason to believe that one of\nAbu'l-Wafa\nor Abu Nasr\nMansur\nwas the original discoverer.\nBoth\nAbu'l-Wafa\nand\nAbu Nasr Mansur\nclaim to have discovered the sine theorem while, as far as we are aware, al-Khujandi makes no such claim. Also al-Khujandi was more of a designer of astronomical instruments and an astronomical observer than he was theoretician. Finally, although this really proves little, the theorem appears many times in the writings of\nAbu Nasr Mansur\n: both his writings on geometry as well as those on astronomy.\nWe should make one final comment on the mathematical contributions of al-Khujandi. He stated\nFermat's Last Theorem\nin the case\nn\n=\n3\nn = 3\nn\n=\n3\nalthough, not surprisingly, his proof is wrong.\nAl-Khazin\nwrote:-\nI demonstrated earlier ... that what Abu Muhammad al-Khujandi advanced - may God have mercy on him - in his demonstration that the sum of two cubic numbers is not a cube, is defective and incorrect.\nIt is certainly interesting that al-Khujandi, despite his practical rather than theoretical achievements, should be interested in this\nnumber theory\nresult.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}