{
  "nome_completo": "Abu Bekr ibn Muhammad ibn al-Husayn Al-Karaji",
  "nome_curto": "al-Karaji",
  "ano_nascimento": "953",
  "ano_morte": "1029",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Karaji/",
  "lugar_nascimento": "Baghdad (now in Iraq)",
  "lugar_morte": null,
  "biografia": "The first comment that we must make regards al-Karaji's name. It appears both as\nal-Karaji\nand as\nal-Karkhi\nbut this is not a simple matter of two different transliterations of the same Arabic name. The significance is that Karaj is a city in Iran and if the mathematician's name is al-Karaji then certainly his family were from that city. On the other hand Karkh is one of the original suburbs of Baghdad which grew up outside the southern gate of the original city. The name al-Karkhi would indicate that the mathematician came from the suburb of Baghdad.\nHistorians seem divided as to which of these interpretations is correct. The version al-Karkhi was proposed by Woepcke\n(\nsee\n[\n7\n]\nor\n[\n8\n]\n)\nbut al-Karaji, the version which is most often used in texts today, was suggested as most likely by della Vida in\n1933\n. Rashed comments\n(\nsee\n[\n1\n]\nor\n[\n5\n]\n)\n:-\nIn the present state of our knowledge delle Vida's argument is plausible but not decisive. On the basis of the manuscripts consulted it is far from easy to decide in favour of either name.\nCertainly we know that al-Karaji lived in Baghdad for most of his life and that his chief mathematical works were written during the time when he lived in that city. His important treatise on algebra\nAl-Fakhri\nwas dedicated to the ruler of Baghdad and was written in the city. However, at some later point in his career, al-Karaji left Baghdad to live in what are described as the \"mountain countries\". He seems to have given up mathematics at this time and concentrated on engineering topics such as the drilling of wells.\nThe importance of al-Karaji in the development of mathematics is viewed rather differently by different authors. The reason for this, rather in the same spirit as the different views on\nal-Khwarizmi\n, depends on the significance one attaches to the style of his mathematics. Some consider that his work is merely reworking ideas from earlier mathematicians while others see him as the first person to completely free algebra from geometrical operations and replace them with the arithmetical type of operations which are at the core of algebra today.\nCrossley\n[\n3\n]\nsounds relatively unimpressed by al-Karaji's contributions\n(\nalthough he describes the content accurately\n)\n:-\n[\nAl-Karaji\n]\ngives rules for the arithmetic operations including\n(\nessentially\n)\nthe multiplication of polynomials. ... al-Karaji usually gives a numerical example for his rules but does not give any sort of proof beyond giving geometrical pictures. Often he explicitely says that he is giving a solution in the style of Diophantus. He does not treat equations above the second degree except for ones which can easily be reduced to at most second degree equations followed by the extraction of roots. The solutions of\nquadratics\nare based explicitly on the Euclidean theorems ...\nWoepcke in\n[\n7\n]\n(\nsee also the reprint\n[\n8\n]\n)\nwas the first historian to realise the importance of al-Karaji's work and later historians mostly agree with his interpretation. He describes it as the first appearance of a:-\n... theory of algebraic calculus ... .\nRashed\n(\nsee\n[\n5\n]\nwhich contains Rashed's article from\n[\n1\n]\nand other writings by Rashed on al-Karaji\n)\nagrees with Woepcke's interpretation and perhaps goes even further in stressing al-Karaji's importance. He writes:-\n... the more-or-less explicit aim of\n[\nal-Karaji's\n]\nexposition was to find the means of realising the autonomy and specificity of algebra, so as to be in a position to reject, in particular, the geometric representation of algebraic operations.\nTo give another quote from Rashed's description of al-Karaji's contribution:-\nAl-Karaji's work holds an especially important place in the history of mathematics. ... the discovery and reading of the arithmetical work of\nDiophantus\n, in the light of the algebraic conceptions and methods of\nal-Khwarizmi\nand other Arab algebraists, made possible a new departure in algebra by Al-Karaji ...\nSo what was this new departure in algebra? Perhaps it is best described by\nal-Samawal\n, one of al-Karaji's successors, who described it as\n[\n5\n]\n:-\n... operating on unknowns using all the arithmetical tools, in the same way as the arithmetician operates on the known.\nWhat al-Karaji achieved in\nAl-Fakhri\nwas first to define the monomials\nx\n,\nx\n2\n,\nx\n3\n,\n.\n.\n.\nx, x^{2}, x^{3}, ...\nx\n,\nx\n2\n,\nx\n3\n,\n.\n.\n.\nand\n1\nx\n,\n1\nx\n2\n,\n1\nx\n3\n,\n.\n.\n.\n\\Large \\frac 1 {x}\\normalsize, \\Large \\frac 1 {x^2}\\normalsize, \\Large \\frac 1 {x^3}\\normalsize, ...\nx\n1\n​\n,\nx\n2\n1\n​\n,\nx\n3\n1\n​\n,\n.\n.\n.\nand to give rules for products of any two of these. So what he achieved here was defining the product of these terms without any reference to geometry. In fact he almost gave the formula\nx\nn\nx\nm\n=\nx\nm\n+\nn\nx^{n}x^{m} = x^{m+n}\nx\nn\nx\nm\n=\nx\nm\n+\nn\nfor all integers\nn\nn\nn\nand\nm\nm\nm\nbut he failed to make the definition\nx\n0\n=\n1\nx^{0} = 1\nx\n0\n=\n1\nso he fell just a little short.\nHaving given rules for multiplication and division of monomials al-Karaji then looked at \"composite quantities\" or sums of monomials. For these he gave rules for addition, subtraction and multiplication but not for division in the general case, only giving rules for the division of a composite quantity by a monomial. He was able to give a rule for finding the square root of a composite quantity which is not completely general since it required the coefficients to be positive, but it is still a remarkable achievement.\nAl-Karaji also uses a form of mathematical induction in his arguments, although he certainly does not give a rigorous exposition of the principle. Basically what al-Karaji does is to demonstrate an argument for\nn\n=\n1\nn = 1\nn\n=\n1\n, then prove the case\nn\n=\n2\nn = 2\nn\n=\n2\nbased on his result for\nn\n=\n1\nn = 1\nn\n=\n1\n, then prove the case\nn\n=\n3\nn = 3\nn\n=\n3\nbased on his result for\nn\n=\n2\nn = 2\nn\n=\n2\n, and carry on to around\nn\n=\n5\nn = 5\nn\n=\n5\nbefore remarking that one can continue the process indefinitely. Although this is not induction proper, it is a major step towards understanding inductive proofs.\nOne of the results on which al-Karaji uses this form of induction comes from his work on the\nbinomial theorem\n, the\nbinomial coefficients\nand the\nPascal triangle\n. In\nAl-Fakhri\nal-Karaji computed\n(\na\n+\nb\n)\n3\n(a+b)^{3}\n(\na\n+\nb\n)\n3\nand in\nAl-Badi\nhe computed\n(\na\n−\nb\n)\n3\n(a-b)^{3}\n(\na\n−\nb\n)\n3\nand\n(\na\n+\nb\n)\n4\n(a+b)^{4}\n(\na\n+\nb\n)\n4\n. The general construction of the Pascal triangle was given by al-Karaji in work described in the later writings of\nal-Samawal\n. In the translation by Rashed and Ahmad\n(\nsee for example\n[\n5\n]\n)\nal-Samawal\nwrites:-\nLet us now recall a principle for knowing the necessary number of multiplications of these degrees by each other, for any number divided into two parts. Al-Karaji said that in order to succeed we must place 'one' on a table and 'one' below the first 'one', move the first 'one' into a second column, add the first 'one' to the 'one' below it. Thus we obtain 'two', which we put below the transferred 'one' and we place the second 'one' below the 'two'. We have therefore 'one', 'two', and 'one'.\nTo see how the second column of\n1\n,\n2\n,\n1\ncorresponds to squaring a+b\nal-Samawal\ncontinues to describe Al-Karaji's work writing:-\nThis shows that for every number composed of two numbers, if we multiple each of them by itself once - since the two extremes are 'one' and 'one' - and if we multiply each one by the other twice - since the intermediate term is 'two' - we obtain the square of this number.\nThis is a beautiful description of the binomial theorem using the Pascal triangle. The description continues up to the binomial coefficients which give\n(\na\n+\nb\n)\n5\n(a+b)^{5}\n(\na\n+\nb\n)\n5\nbut we shall only quote how al-Karaji constructs the third column from the second:-\nIf we transfer the 'one' in the second column into a third column, then add 'one' from the second column to 'two' below it, we obtain 'three' to be written under the 'one' in the third column. If we then add 'two' from the second column to ''one' below it we have 'three' which is written under the 'three', then we write 'one' under this 'three'; we thus obtain a third column whose numbers are 'one', 'three', 'three', and 'one'.\nThe table al-Karaji constructed looks like the Pascal triangle on its side.\nOther results obtained by al-Karaji include summing the first\nn\nn\nn\nnatural numbers, the squares of the first\nn\nn\nn\nnatural numbers and the cubes of these numbers. He proved that the sum of the first\nn\nn\nn\nnatural numbers was\n1\n2\nn\n(\nn\n+\n1\n)\n{1\\over2}n(n + 1)\n2\n1\n​\nn\n(\nn\n+\n1\n)\n. He also gave\n(\nin Rashed and Ahmad's translation, see for example\n[\n5\n]\n)\n:-\nThe sum of the squares of the numbers that follow one another in natural order from one is equal to the sum of these numbers and the product of each of them by its predecessor.\nIn modern notation this result is\n∑\ni\n2\n=\n∑\ni\n+\n∑\ni\n(\ni\n−\n1\n)\n\\sum  i ^{2} = \\sum  i + \\sum  i (i - 1)\n∑\ni\n2\n=\n∑\ni\n+\n∑\ni\n(\ni\n−\n1\n)\n.\nAl-Karaji also considered sums of the cubes of the first\nn\nn\nn\nnatural numbers writing\n(\nin Rashed and Ahmad's translation, see for example\n[\n5\n]\n)\n:-\nIf we want to add the cubes of the numbers that follow one another in their natural order we multiply their sum by itself.\nIn modern notation\n∑\ni\n3\n=\n(\n∑\ni\n)\n2\n\\sum  i ^{3} = (\\sum  i)^{2}\n∑\ni\n3\n=\n(\n∑\ni\n)\n2\n.\nAl-Karaji showed that\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n10\n)\n2\n(1 + 2 + 3 + ... + 10)^{2}\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n1\n0\n)\n2\nwas equal to\n1\n3\n+\n2\n3\n+\n3\n3\n+\n.\n.\n.\n+\n1\n0\n3\n1^{3} + 2^{3} + 3^{3} + ... + 10^{3}\n1\n3\n+\n2\n3\n+\n3\n3\n+\n.\n.\n.\n+\n1\n0\n3\n. He did this by first showing that\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n10\n)\n2\n=\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n9\n)\n2\n+\n1\n0\n3\n(1 + 2 + 3 + ... + 10)^{2} = (1 + 2 + 3 + ... + 9)^{2} + 10^{3}\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n1\n0\n)\n2\n=\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n9\n)\n2\n+\n1\n0\n3\n. He could now use the same rule on\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n9\n)\n2\n(1 + 2 + 3 + ... + 9)^{2}\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n9\n)\n2\n, then on\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n8\n)\n2\n(1 + 2 + 3 + ... + 8)^{2}\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n8\n)\n2\netc. to get\n(\n1\n+\n2\n+\n.\n.\n.\n+\n10\n)\n2\n( 1 + 2 + ... + 10)^{2}\n(\n1\n+\n2\n+\n.\n.\n.\n+\n1\n0\n)\n2\n=\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n8\n)\n2\n+\n9\n3\n+\n1\n0\n3\n= (1 + 2 + 3 + ... + 8)^{2} + 9^{3} + 10^{3}\n=\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n8\n)\n2\n+\n9\n3\n+\n1\n0\n3\n=\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n7\n)\n2\n+\n8\n3\n+\n9\n3\n+\n1\n0\n3\n= (1 + 2 + 3 + ... + 7)^{2} + 8^{3} + 9^{3} + 10^{3}\n=\n(\n1\n+\n2\n+\n3\n+\n.\n.\n.\n+\n7\n)\n2\n+\n8\n3\n+\n9\n3\n+\n1\n0\n3\n= . . .\n=\n1\n3\n+\n2\n3\n+\n3\n3\n+\n.\n.\n.\n+\n1\n0\n3\n.\n= 1^{3} + 2^{3} + 3^{3} + ... + 10^{3}.\n=\n1\n3\n+\n2\n3\n+\n3\n3\n+\n.\n.\n.\n+\n1\n0\n3\n.\nFinally we should mention the influence of\nDiophantus\non al-Karaji. The first five books of\nDiophantus\n's\nArithmetica\nhad been translated into Arabic by ibn Liqa around\n870\nand these were studied by al-Karaji. Woepcke in his introduction to\nAl-Fakhri\n(\n[\n7\n]\nor\n[\n8\n]\n)\nwrites that he found:-\n... more than a third of the problems of the first book of\nDiophantus\n, the problems of the second book starting with the eighth, and virtually all the problems of the third book were included by al-Karaji in his collection.\nAl-Karaji also invented many new problem of his own but even those of\nDiophantus\nwere certainly not just taken without further development. He always tried to generalise\nDiophantus\n's results and to find methods which were more generally applicable.\nIt was not only to algebra that al-Karaji contributed. The paper\n[\n9\n]\ndiscusses some of his geometrical work. This occurs in a chapter entitled\nOn measurement and balances for measuring of buildings and structures\n. al-Karaji defines points, lines, surfaces, solids and angles. He also gives rules for measuring both plane and solid figures, often using arches as examples. He also gives methods of weighing different substances.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}