{
  "nome_completo": "Abu Ja'far Muhammad ibn Musa Al-Khwarizmi",
  "nome_curto": "Al-Khwarizmi",
  "ano_nascimento": "790",
  "ano_morte": "850",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Khwarizmi/",
  "lugar_nascimento": "possibly Baghdad (now in Iraq)",
  "lugar_morte": null,
  "biografia": "We know few details of\nAbu Ja'far Muhammad ibn Musa al-Khwarizmi\n's life. One unfortunate effect of this lack of knowledge seems to be the temptation to make guesses based on very little evidence. In\n[\n1\n]\nToomer suggests that the name al-Khwarizmi may indicate that he came from Khwarizm south of the Aral Sea in central Asia. He then writes:-\nBut the historian al-Tabari gives him the additional epithet \"al-Qutrubbulli\", indicating that he came from Qutrubbull, a district between the Tigris and Euphrates not far from Baghdad, so perhaps his ancestors, rather than he himself, came from Khwarizm ... Another epithet given to him by al-Tabari, \"al-Majusi\", would seem to indicate that he was an adherent of the old Zoroastrian religion. ... the pious preface to al-Khwarizmi's \"Algebra\" shows that he was an orthodox Muslim, so Al-Tabari's epithet could mean no more than that his forebears, and perhaps he in his youth, had been Zoroastrians.\nHowever, Rashed\n[\n7\n]\n, put a rather different interpretation on the same words by Al-Tabari:-\n... Al-Tabari's words should read: \"Muhammad ibn Musa al-Khwarizmi and al-Majusi al-Qutrubbulli ...\",\n(\nand that there are two people al-Khwarizmi and al-Majusi al-Qutrubbulli\n)\n: the letter \"wa\" was omitted in the early copy. This would not be worth mentioning if a series of conclusions about al-Khwarizmi's personality, occasionally even the origins of his knowledge, had not been drawn. In his article\n(\n[\n1\n]\n)\nG J Toomer, with naive confidence, constructed an entire fantasy on the error which cannot be denied the merit of making amusing reading.\nThis is not the last disagreement that we shall meet in describing the life and work of al-Khwarizmi. However before we look at the few facts about his life that are known for certain, we should take a moment to set the scene for the cultural and scientific background in which al-Khwarizmi worked.\nHarun al-Rashid became the fifth Caliph of the Abbasid dynasty on\n14\nSeptember\n786\n, about the time that al-Khwarizmi was born. Harun ruled, from his court in the capital city of Baghdad, over the Islam empire which stretched from the Mediterranean to India. He brought culture to his court and tried to establish the intellectual disciplines which at that time were not flourishing in the Arabic world. He had two sons, the eldest was al-Amin while the younger was al-Mamun. Harun died in\n809\nand there was an armed conflict between the brothers.\nAl-Mamun won the armed struggle and al-Amin was defeated and killed in\n813\n. Following this, al-Mamun became Caliph and ruled the empire from Baghdad. He continued the patronage of learning started by his father and founded an academy called the House of Wisdom where Greek philosophical and scientific works were translated. He also built up a library of manuscripts, the first major library to be set up since that at Alexandria, collecting important works from Byzantium. In addition to the House of Wisdom, al-Mamun set up observatories in which Muslim astronomers could build on the knowledge acquired by earlier peoples.\nAl-Khwarizmi and his colleagues the\nBanu Musa\nwere scholars at the House of Wisdom in Baghdad. Their tasks there involved the translation of Greek scientific manuscripts and they also studied, and wrote on, algebra, geometry and astronomy. Certainly al-Khwarizmi worked under the patronage of Al-Mamun and he dedicated two of his texts to the Caliph. These were his treatise on algebra and his treatise on astronomy. The algebra treatise\nHisab al-jabr w'al-muqabala\nwas the most famous and important of all of al-Khwarizmi's works. It is the title of this text that gives us the word \"algebra\" and, in a sense that we shall investigate more fully below, it is the first book to be written on algebra.\nRosen's translation of al-Khwarizmi's own words describing the purpose of the book tells us that al-Khwarizmi intended to teach\n[\n11\n]\n(\nsee also\n[\n1\n]\n)\n:-\n... what is easiest and most useful in arithmetic, such as men constantly require in cases of inheritance, legacies, partition, lawsuits, and trade, and in all their dealings with one another, or where the measuring of lands, the digging of canals, geometrical computations, and other objects of various sorts and kinds are concerned.\nThis does not sound like the contents of an algebra text and indeed only the first part of the book is a discussion of what we would today recognise as algebra. However it is important to realise that the book was intended to be highly practical and that algebra was introduced to solve real life problems that were part of everyday life in the Islam empire at that time. Early in the book al-Khwarizmi describes the natural numbers in terms that are almost funny to us who are so familiar with the system, but it is important to understand the new depth of abstraction and understanding here\n[\n11\n]\n:-\nWhen I consider what people generally want in calculating, I found that it always is a number. I also observed that every number is composed of units, and that any number may be divided into units. Moreover, I found that every number which may be expressed from one to ten, surpasses the preceding by one unit: afterwards the ten is doubled or tripled just as before the units were: thus arise twenty, thirty, etc. until a hundred: then the hundred is doubled and tripled in the same manner as the units and the tens, up to a thousand; ... so forth to the utmost limit of numeration.\nHaving introduced the natural numbers, al-Khwarizmi introduces the main topic of this first section of his book, namely the solution of equations. His equations are linear or\nquadratic\nand are composed of units, roots and squares. For example, to al-Khwarizmi a unit was a number, a root was\nx\nx\nx\n, and a square was\nx\n2\nx^{2}\nx\n2\n. However, although we shall use the now familiar algebraic notation in this article to help the reader understand the notions, Al-Khwarizmi's mathematics is done entirely in words with no symbols being used.\nHe first reduces an equation\n(\nlinear or quadratic\n)\nto one of six standard forms:\n1\n. Squares equal to roots.\n2\n. Squares equal to numbers.\n3\n. Roots equal to numbers.\n4\n. Squares and roots equal to numbers; e.g.\nx\n2\n+\n10\nx\n=\n39\nx^{2} + 10 x = 39\nx\n2\n+\n1\n0\nx\n=\n3\n9\n.\n5\n. Squares and numbers equal to roots; e.g.\nx\n2\n+\n21\n=\n10\nx\nx^{2} + 21 = 10 x\nx\n2\n+\n2\n1\n=\n1\n0\nx\n.\n6\n. Roots and numbers equal to squares; e.g.\n3\nx\n+\n4\n=\nx\n2\n3 x + 4 = x^{2}\n3\nx\n+\n4\n=\nx\n2\n.\nThe reduction is carried out using the two operations of\nal-jabr\nand\nal-muqabala\n. Here \"al-jabr\" means \"completion\" and is the process of removing negative terms from an equation. For example, using one of al-Khwarizmi's own examples, \"al-jabr\" transforms\nx\n2\n=\n40\nx\n−\n4\nx\n2\nx^{2} = 40 x - 4 x^{2}\nx\n2\n=\n4\n0\nx\n−\n4\nx\n2\ninto\n5\nx\n2\n=\n40\nx\n5 x^{2} = 40 x\n5\nx\n2\n=\n4\n0\nx\n. The term \"al-muqabala\" means \"balancing\" and is the process of reducing positive terms of the same power when they occur on both sides of an equation. For example, two applications of \"al-muqabala\" reduces\n50\n+\n3\nx\n+\nx\n2\n=\n29\n+\n10\nx\n50 + 3 x + x^{2} = 29 + 10 x\n5\n0\n+\n3\nx\n+\nx\n2\n=\n2\n9\n+\n1\n0\nx\nto\n21\n+\nx\n2\n=\n7\nx\n21 + x^{2} = 7 x\n2\n1\n+\nx\n2\n=\n7\nx\n(\none application to deal with the numbers and a second to deal with the roots\n)\n.\nAl-Khwarizmi then shows how to solve the six standard types of equations. He uses both algebraic methods of solution and geometric methods. For example to solve the equation\nx\n2\n+\n10\nx\n=\n39\nx^{2} + 10 x = 39\nx\n2\n+\n1\n0\nx\n=\n3\n9\nhe writes\n[\n11\n]\n:-\n... a square and\n10\nroots are equal to\n39\nunits. The question therefore in this type of equation is about as follows: what is the square which combined with ten of its roots will give a sum total of\n39\n? The manner of solving this type of equation is to take one-half of the roots just mentioned. Now the roots in the problem before us are\n10\n. Therefore take\n5\n, which multiplied by itself gives\n25\n, an amount which you add to\n39\ngiving\n64\n. Having taken then the square root of this which is\n8\n, subtract from it half the roots,\n5\nleaving\n3\n. The number three therefore represents one root of this square, which itself, of course is\n9\n. Nine therefore gives the square.\nThe geometric proof by completing the square follows. Al-Khwarizmi starts with a square of side\nx\nx\nx\n, which therefore represents\nx\n2\nx^{2}\nx\n2\n(\nFigure\n1)\n. To the square we must add\n10\nx\n10x\n1\n0\nx\nand this is done by adding four rectangles each of breadth\n10\n/\n4\nand length\nx\nx\nx\nto the square\n(\nFigure\n2)\n. Figure\n2\nhas area\nx\n2\n+\n10\nx\nx^{2} + 10 x\nx\n2\n+\n1\n0\nx\nwhich is equal to\n39\n. We now complete the square by adding the four little squares each of area\n5\n2\n×\n5\n2\n=\n25\n4\n\\large\\frac{5}{2}\\normalsize   \\times  \\large\\frac{5}{2}\\normalsize   = \\large\\frac{25}{4}\\normalsize\n2\n5\n​\n×\n2\n5\n​\n=\n4\n2\n5\n​\n. Hence the outside square in Fig\n3\nhas area\n4\n×\n25\n4\n+\n39\n=\n25\n+\n39\n=\n64\n4 \\times  \\large\\frac{25}{4}\\normalsize  + 39 = 25 + 39 = 64\n4\n×\n4\n2\n5\n​\n+\n3\n9\n=\n2\n5\n+\n3\n9\n=\n6\n4\n. The side of the square is therefore\n8\n. But the side is of length\n5\n2\n+\nx\n+\n5\n2\n\\large\\frac{5}{2}\\normalsize  + x + \\large\\frac{5}{2}\\normalsize\n2\n5\n​\n+\nx\n+\n2\n5\n​\nso\nx\n+\n5\n=\n8\nx + 5 = 8\nx\n+\n5\n=\n8\n, giving\nx\n=\n3\nx = 3\nx\n=\n3\n.\nThese geometrical proofs are a matter of disagreement between experts. The question, which seems not to have an easy answer, is whether al-Khwarizmi was familiar with\nEuclid\n's\nElements\n. We know that he could have been, perhaps it is even fair to say \"should have been\", familiar with\nEuclid\n's work. In al-Rashid's reign, while al-Khwarizmi was still young, al-Hajjaj had translated\nEuclid\n's\nElements\ninto Arabic and al-Hajjaj was one of al-Khwarizmi's colleagues in the House of Wisdom. This would support Toomer's comments in\n[\n1\n]\n:-\n... in his introductory section al-Khwarizmi uses geometrical figures to explain equations, which surely argues for a familiarity with Book II of\nEuclid\n's \"Elements\".\nRashed\n[\n9\n]\nwrites that al-Khwarizmi's:-\n... treatment was very probably inspired by recent knowledge of the \"Elements\".\nHowever, Gandz in\n[\n6\n]\n(\nsee also\n[\n23\n]\n)\n, argues for a very different view:-\nEuclid\n's \"Elements\" in their spirit and letter are entirely unknown to\n[\nal-Khwarizmi\n]\n. Al-Khwarizmi has neither definitions, nor axioms, nor postulates, nor any demonstration of the Euclidean kind.\nI\n[\nEFR\n]\nthink that it is clear that whether or not al-Khwarizmi had studied\nEuclid\n's\nElements\n, he was influenced by other geometrical works. As Parshall writes in\n[\n35\n]\n:-\n... because his treatment of practical geometry so closely followed that of the Hebrew text, Mishnat ha Middot, which dated from around\n150\nAD, the evidence of Semitic ancestry exists.\nAl-Khwarizmi continues his study of algebra in\nHisab al-jabr w'al-muqabala\nby examining how the laws of arithmetic extend to an arithmetic for his algebraic objects. For example he shows how to multiply out expressions such as\n(\na\n+\nb\nx\n)\n(\nc\n+\nd\nx\n)\n(a + b x) (c + d x)\n(\na\n+\nb\nx\n)\n(\nc\n+\nd\nx\n)\nalthough again we should emphasise that al-Khwarizmi uses only words to describe his expressions, and no symbols are used. Rashed\n[\n9\n]\nsees a remarkable depth and novelty in these calculations by al-Khwarizmi which appear to us, when examined from a modern perspective, as relatively elementary. He writes\n[\n9\n]\n:-\nAl-Khwarizmi's concept of algebra can now be grasped with greater precision: it concerns the theory of linear and quadratic equations with a single unknown, and the elementary arithmetic of relative binomials and trinomials. ... The solution had to be general and calculable at the same time and in a mathematical fashion, that is, geometrically founded. ... The restriction of degree, as well as that of the number of unsophisticated terms, is instantly explained. From its true emergence, algebra can be seen as a theory of equations solved by means of\nradicals\n, and of algebraic calculations on related expressions...\nIf this interpretation is correct, then al-Khwarizmi was as Sarton writes:-\n... the greatest mathematician of the time, and if one takes all the circumstances into account, one of the greatest of all time....\nIn a similar vein Rashed writes\n[\n9\n]\n:-\nIt is impossible to overstress the originality of the conception and style of al-Khwarizmi's algebra...\nbut a different view is taken by Crossley who writes\n[\n4\n]\n:-\n[\nAl-Khwarizmi\n]\nmay not have been very original...\nand Toomer who writes in\n[\n1\n]\n:-\n... Al-Khwarizmi's scientific achievements were at best mediocre.\nIn\n[\n23\n]\nGandz gives this opinion of al-Khwarizmi's algebra:-\nAl-Khwarizmi's algebra is regarded as the foundation and cornerstone of the sciences. In a sense, al-Khwarizmi is more entitled to be called \"the father of algebra\" than\nDiophantus\nbecause al-Khwarizmi is the first to teach algebra in an elementary form and for its own sake,\nDiophantus\nis primarily concerned with the theory of numbers.\nThe next part of al-Khwarizmi's\nAlgebra\nconsists of applications and worked examples. He then goes on to look at rules for finding the area of figures such as the circle and also finding the volume of solids such as the sphere, cone, and pyramid. This section on mensuration certainly has more in common with Hindu and Hebrew texts than it does with any Greek work. The final part of the book deals with the complicated Islamic rules for inheritance but require little from the earlier algebra beyond solving linear equations.\nAl-Khwarizmi also wrote a treatise on Hindu-Arabic numerals. The Arabic text is lost but a Latin translation,\nAlgoritmi de numero Indorum\nin English\nAl-Khwarizmi on the Hindu Art of Reckoning\ngave rise to the word algorithm deriving from his name in the title. Unfortunately the Latin translation\n(\ntranslated into English in\n[\n19\n]\n)\nis known to be much changed from al-Khwarizmi's original text\n(\nof which even the title is unknown\n)\n. The work describes the Hindu place-value system of numerals based on\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n, and\n0\n. The first use of zero as a place holder in positional base notation was probably due to al-Khwarizmi in this work. Methods for arithmetical calculation are given, and a method to find square roots is known to have been in the Arabic original although it is missing from the Latin version. Toomer writes\n[\n1\n]\n:-\n... the decimal place-value system was a fairly recent arrival from India and ... al-Khwarizmi's work was the first to expound it systematically. Thus, although elementary, it was of seminal importance.\nSeven twelfth century Latin treatises based on this lost Arabic treatise by al-Khwarizmi on arithmetic are discussed in\n[\n17\n]\n.\nAnother important work by al-Khwarizmi was his work\nSindhind zij\non astronomy. The work, described in detail in\n[\n48\n]\n, is based in Indian astronomical works\n[\n47\n]\n:-\n... as opposed to most later Islamic astronomical handbooks, which utilised the Greek planetary models laid out in\nPtolemy\n's \"Almagest\"\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n...\nThe Indian text on which al-Khwarizmi based his treatise was one which had been given to the court in Baghdad around\n770\nas a gift from an Indian political mission. There are two versions of al-Khwarizmi's work which he wrote in Arabic but both are lost. In the tenth century al-Majriti made a critical revision of the shorter version and this was translated into Latin by\nAdelard\nof Bath. There is also a Latin version of the longer version and both these Latin works have survived. The main topics covered by al-Khwarizmi in the\nSindhind zij\nare calendars; calculating true positions of the sun, moon and planets, tables of sines and tangents; spherical astronomy; astrological tables;\nparallax\nand eclipse calculations; and visibility of the moon. A related manuscript, attributed to al-Khwarizmi, on spherical trigonometry is discussed in\n[\n39\n]\n.\nAlthough his astronomical work is based on that of the Indians, and most of the values from which he constructed his tables came from Hindu astronomers, al-Khwarizmi must have been influenced by\nPtolemy\n's work too\n[\n1\n]\n:-\nIt is certain that\nPtolemy\n's tables, in their revision by\nTheon\nof Alexandria, were already known to some Islamic astronomers; and it is highly likely that they influenced, directly or through intermediaries, the form in which Al-Khwarizmi's tables were cast.\nAl-Khwarizmi wrote a major work on geography which give latitudes and longitudes for\n2402\nlocalities as a basis for a world map. The book, which is based on\nPtolemy\n's\nGeography\n, lists with latitudes and longitudes, cities, mountains, seas, islands, geographical regions, and rivers. The manuscript does include maps which on the whole are more accurate than those of\nPtolemy\n. In particular it is clear that where more local knowledge was available to al-Khwarizmi such as the regions of Islam, Africa and the Far East then his work is considerably more accurate than that of\nPtolemy\n, but for Europe al-Khwarizmi seems to have used\nPtolemy\n's data.\nA number of minor works were written by al-Khwarizmi on topics such as the\nastrolabe\n, on which he wrote two works, on the sundial, and on the Jewish calendar. He also wrote a political history containing horoscopes of prominent persons.\nWe have already discussed the varying views of the importance of al-Khwarizmi's algebra which was his most important contribution to mathematics. Let us end this article with a quote by Mohammad Kahn, given in\n[\n3\n]\n:-\nIn the foremost rank of mathematicians of all time stands Al-Khwarizmi. He composed the oldest works on arithmetic and algebra. They were the principal source of mathematical knowledge for centuries to come in the East and the West. The work on arithmetic first introduced the Hindu numbers to Europe, as the very name algorism signifies; and the work on algebra ... gave the name to this important branch of mathematics in the European world...",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}