{
  "nome_completo": "Abu Yusuf Yaqub ibn Ishaq al-Sabbah Al-Kindi",
  "nome_curto": "Al-Kindi",
  "ano_nascimento": "805",
  "ano_morte": "873",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Kindi/",
  "lugar_nascimento": "Kufa, Iraq",
  "lugar_morte": "Baghdad, Iraq",
  "biografia": "Al-Kindi\nwas born and brought up in Kufa, which was a centre for Arab culture and learning in the\n9\nth\ncentury. This was certainly the right place for al-Kindi to get the best education possible at this time. Although quite a few details\n(\nand legends\n)\nof al-Kindi's life are given in various sources, these are not all consistent. We shall try to give below details which are fairly well substantiated.\nAccording to\n[\n3\n]\n, al-Kindi's father was the governor of Kufah, as his grandfather had been before him. Certainly all agree that al-Kindi was descended from the Royal Kindah tribe which had originated in southern Arabia. This tribe had united a number of tribes and reached a position of prominence in the\n5\nth\nand\n6\nth\ncenturies but then lost power from the middle of the\n6\nth\ncentury. However, descendants of the Royal Kindah continued to hold prominent court positions in Muslim times.\nAfter beginning his education in Kufah, al-Kindi moved to Baghdad to complete his studies and there he quickly achieved fame for his scholarship. He came to the attention of the Caliph al-Ma'mun who was at that time setting up the \"House of Wisdom\" in Baghdad. Al-Ma'mun had won an armed struggle against his brother in\n813\nand became Caliph in that year. He ruled his empire, first from Merv then, after\n818\n, he ruled from Baghdad where he had to go to put down an attempted coup.\nAl-Ma'mun was a patron of learning and founded an academy called the House of Wisdom where Greek philosophical and scientific works were translated. Al-Kindi was appointed by al-Ma'mun to the House of Wisdom together with\nal-Khwarizmi\nand the\nBanu Musa brothers\n. The main task that al-Kindi and his colleagues undertook in the House of Wisdom involved the translation of Greek scientific manuscripts. Al-Ma'mun had built up a library of manuscripts, the first major library to be set up since that at Alexandria, collecting important works from Byzantium. In addition to the House of Wisdom, al-Ma'mun set up observatories in which Muslim astronomers could build on the knowledge acquired by earlier peoples.\nIn\n833\nal-Ma'mun died and was succeeded by his brother al-Mu'tasim. Al-Kindi continued to be in favour and al-Mu'tasim employed al-Kindi to tutor his son Ahmad. Al-Mu'tasim died in\n842\nand was succeeded by al-Wathiq who, in turn, was succeeded as Caliph in\n847\nby al-Mutawakkil. Under both these Caliphs al-Kindi fared less well. It is not entirely clear whether this was because of his religious views or because of internal arguments and rivalry between the scholars in the House of Wisdom. Certainly al-Mutawakkil persecuted all non-orthodox and non-Muslim groups while he had synagogues and churches in Baghdad destroyed. However, al-Kindi's\n[\n6\n]\n:-\n... lack of interest in religious argument can be seen in the topics on which he wrote. ... he appears to coexist with the world view of orthodox Islam.\nIn fact most of al-Kindi's philosophical writings seem designed to show that he believed that the pursuit of philosophy is compatible with orthodox Islam. This would seem to indicate that it is more probably that al-Kindi became\n[\n1\n]\n:-\n... the victim of such rivals as the mathematicians\nBanu Musa\nand the astrologer Abu Ma'shar.\nIt is claimed that the\nBanu Musa brothers\ncaused al-Kindi to lose favour with al-Mutawakkil to the extent that he had him beaten and gave al-Kindi's library to the\nBanu Musa brothers\n.\nAl-Kindi was best known as a philosopher but he was also a mathematician and scientist of importance\n[\n3\n]\n:-\nTo his people he became known as ... the philosopher of the Arabs. He was the only notable philosopher of pure Arabian blood and the first one in Islam. Al-Kindi \"was the most leaned of his age, unique among his contemporaries in the knowledge of the totality of ancient scientists, embracing logic, philosophy, geometry, mathematics, music and astrology.\nPerhaps, rather surprisingly for a man of such learning whose was employed to translate Greek texts, al-Kindi does not appear to have been fluent enough in Greek to do the translation himself. Rather he polished the translations made by others and wrote commentaries on many Greek works. Clearly he was most influenced most strongly by the writings of\nAristotle\nbut the influence of\nPlato\n,\nPorphyry\nand\nProclus\ncan also be seen in al-Kindi's ideas. We should certainly not give the impression that al-Kindi merely borrowed from these earlier writer, for he built their ideas into an overall scheme which was certainly his own invention.\nAl-Kindi wrote many works on arithmetic which included manuscripts on Indian numbers, the harmony of numbers, lines and multiplication with numbers, relative quantities, measuring proportion and time, and numerical procedures and cancellation. He also wrote on space and time, both of which he believed were finite, 'proving' his assertion with a paradox of the infinite. Garro gives al-Kindi's 'proof' that the existence of an actual infinite body or magnitude leads to a contradiction in\n[\n7\n]\n. In his more recent paper\n[\n8\n]\n, Garro formulates the informal axiomatics of al-Kindi's paradox of the infinite in modern terms and discusses the paradox both from a mathematical and philosophical point of view.\nIn geometry al-Kindi wrote, among other works, on the theory of parallels. He gave a lemma investigating the possibility of exhibiting pairs of lines in the plane which are simultaneously non-parallel and non-intersecting. Also related to geometry was the two works he wrote on optics, although he followed the usual practice of the time and confused the theory of light and the theory of vision.\nPerhaps al-Kindi's own words give the best indication of what he attempted to do in all his work. In the introduction to one of his books he wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nIt is good ... that we endeavour in this book, as is our habit in all subjects, to recall that concerning which the Ancients have said everything in the past, that is the easiest and shortest to adopt for those who follow them, and to go further in those areas where they have not said everything ...\nCertainly al-Kindi tried hard to follow this path. For example in his work on optics he is critical of a Greek description by\nAnthemius\nof how a mirror was used to set a ship on fire during a battle. Al-Kindi adopts a more scientific approach\n(\nsee for example\n[\n1\n]\n)\n:-\nAnthemius should not have accepted information without proof ... He tells us how to construct a mirror from which twenty-four rays are reflected on a single point, without showing how to establish the point where the rays unite at a given distance from the middle of the mirror's surface. We, on the other hand, have described this with as much evidence as our ability permits, furnishing what was missing, for he has not mentioned a definite distance.\nMuch of al-Kindi's work remains to be studied closely or has only recently been subjected to scholarly research. For example al-Kindi's commentary on\nArchimedes\n'\nThe measurement of the circle\nhas only received careful attention as recently as the\n1993\npublication\n[\n10\n]\nby Rashed.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}