{
  "nome_completo": "Abu Abd Allah Muhammad ibn Isa Al-Mahani",
  "nome_curto": "al-Mahani",
  "ano_nascimento": "820",
  "ano_morte": "880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Mahani/",
  "lugar_nascimento": "Mahan, Kerman, Persia (now Iran)",
  "lugar_morte": "Baghdad, Iraq",
  "biografia": "There is very little information regarding\nal-Mahani\n's life. We do know a little about al-Mahani's work in astronomy from\nIbn Yunus\n's astronomical handbook\nal-Zij al-Hakimi al-kabir\n. In this work\nIbn Yunus\nquotes from writings by al-Mahani, which have since been lost, which describe observations which al-Mahani made between the years\n853\nand\n866\n. At least we have accurate dating of al-Mahani's life from this source.\nIbn Yunus\nwrites that al-Mahani observed lunar eclipses and\n[\n1\n]\n:-\n... he calculated their beginnings with an\nastrolabe\nand that the beginnings of three consecutive eclipses were about half an hour later than calculated.\nThe\nFihrist\n(\nIndex\n)\nwas a work compiled by the bookseller Ibn an-Nadim in\n988\n. It gives a full account of the Arabic literature which was available in the\n10\nth\ncentury and in particular mentions al-Mahani, not for his work in astronomy, but rather for his work in geometry and arithmetic. However the work which al-Mahani did in mathematics may well have been motivated by various problems of an astronomical nature.\nWe know that some of al-Mahani's work in algebra was motivated by trying to solve problems due to\nArchimedes\n. The problem of\nArchimedes\nwhich he attempted to solve in a novel way was that of cutting a sphere by a plane so that the two resulting segments had volumes of a given ratio. It was\nOmar Khayyam\n, giving an important historical description of algebra, who puts al-Mahani's work into context.\nOmar Khayyam\nwrites\n(\nsee for example\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nAl-Mahani was one of the modern authors who conceived the idea of solving the auxiliary theorem used by\nArchimedes\nin the fourth proposition of the second book of his treatise on the sphere and the cylinder algebraically. However, he was led to an equation involving cubes, squares and numbers which he failed to solve after giving it lengthy meditation. Therefore, this solution was declared impossible until the appearance of\nJa'far al-Khazin\nwho solved the equation with the help of\nconic sections\n.\nOmar Khayyam\nis quite correct to rate this work highly. It would be too easy to say that since al-Mahani has proposed a method of solution which he could not carry through then his work was of little value. However, this, as\nOmar Khayyam\nis well aware, is not so at all and the fact that al-Mahani conceived the idea of reducing problems such as\nduplicating the cube\nto problems in algebra was an important step forward.\nA number of works by al-Mahani have survived, in particular commentaries which he wrote on parts of\nEuclid\n's\nElements\n. In particular his work on ratio and\nirrational\nratios which are contained in commentaries he gave on Books V and X of the\nElements\nsurvive as does his attempt to clarify difficult parts of Book XIII. He also wrote a work which gives those\n26\npropositions in Book I which can be proved without using a\nreductio ad absurdum\nargument but this work has been lost. Also lost is his work attempting to improve the descriptions given by\nMenelaus\nin his\nSpherics\n.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}