{
  "nome_completo": "Abu l'Hasan Ali ibn Ahmad Al-Nasawi",
  "nome_curto": "al-Nasawi",
  "ano_nascimento": "1010",
  "ano_morte": "1075",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Nasawi/",
  "lugar_nascimento": "possibly Nasa, Khurasan,Iran",
  "lugar_morte": "possibly Baghdad, Iraq",
  "biografia": "Nothing was known about\nal-Nasawi\nin Europe until\n1863\nwhen Woepcke published information on a manuscript containing a work by al-Nasawi on elementary arithmetic. Al-Nasawi had prepared an original version of it in Persian for the library of the Iranian prince Majd al-Dawlah, of the Buyid dynasty. Before the work was completed, however, Majd al-Dawlah was deposed as ruler so, on completion of the work, al-Nasawi presented it to Sharaf al-Muluk who was the vizier of Jalal ad-Dawlah\n(\nJalal ad-Dawlah was the ruler of Baghdad from\n1025\nto\n1044)\n. Sharaf al-Muluk ordered al-Nasawi to rewrite the work in Arabic, and this he did. The Arabic version has survived and it is this which Woepcke studied in\n1863\n.\nFrom this description, and from the fact that al-Nasawi dedicated another work to a Shi'ite leader in Baghdad, we at least can deduce that al-Nasawi worked for part of his life in Baghdad. A few more details of his life have become known recently. A paragraph about al-Nasawi's life has been found in a manuscript and it tells us that he spent time in Rayy, and was visited by\nibn Sina\n. The authors of\n[\n3\n]\ngive an analysis of this mid-\n12\nth\ncentury manuscript which once contained\n80\ntracts, but of these only\n43\nsurvive. Tract\n26\nis a summary of\nEuclid\n's\nElements\nby al-Nasawi.\nThe reasons which al-Nasawi gives for writing this summary are two-fold. On the one hand he says that it will act as an introduction to the\nElements\nwhile on the other hand it will provide all the necessary background in geometry for anyone wanting to read\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. He does not meet the first of these aims very successfully for the tract is nothing more than a copy of the first six books of the\nElements\ntogether with Book XI. All al-Nasawi appears to have done is to omit some constructions and change a few of the proofs. This work is interesting historically for our understanding of the way that the\nElements\nwas transmitted in Arabic countries but has little significance for its contributions to mathematics.\nThere were three different types of arithmetic used in Arab countries around this period:\n(\ni\n)\na system derived from counting on the fingers with the numerals written entirely in words; this finger-reckoning arithmetic was the system used by the business community,\n(\nii\n)\nthe\nsexagesimal\nsystem with numerals denoted by letters of the Arabic alphabet, and\n(\niii\n)\nthe arithmetic of the Indian numerals and fractions with the decimal place-value system. The arithmetic book by al-Nasawi is of this third \"Indian numeral\" type.\nThe book is composed of four separate treatises, each dealing with a particular class of numbers. The first deals with integers, the second with proper common fractions, the third with improper fractions, and finally the fourth with sexagesimals. In each of the four cases al-Nasawi explains the four elementary arithmetical operations. He also explains doubling, halving, taking square roots, and taking cube roots. Each method for each of the four types is illustrated with worked examples and a checking procedure is explained which usually involves usually casting out nines The method al-Nasawi gives for taking cube roots is the same as the method described in the Chinese Mathematics in Nine Books, but quite how he learnt of this method is unknown.\nAl-Nasawi is critical of works on arithmetic written by earlier authors. However, looking at the texts which he criticises that we can examine because they have survived, we can see now that his criticisms are not valid. In fact, in some respects, al-Nasawi does not rate too highly as a mathematician. There seems nothing original in any of his works and, more significantly, there are several places where al-Nasawi presents pieces of mathematics which he fails to properly understand. For example he fails to understand the principle of \"borrowing\" when doing subtraction.\nTwo other works by al-Nasawi have survived. One discusses the theorem of\nMenelaus\nwhile the other is\n[\n1\n]\n:-\n... a corrected version of\nArchimedes\n' Lemmata as translated into Arabic by\nThabit ibn Qurra\n, which was last revised by\nNasir al-Din al-Tusi\n.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}