{
  "nome_completo": "Abu Sahl Waijan ibn Rustam al-Quhi",
  "nome_curto": "Al-Quhi",
  "ano_nascimento": "940",
  "ano_morte": "1000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Quhi/",
  "lugar_nascimento": "Tabaristan (now Mazanderan), Persia (now Iran)",
  "lugar_morte": null,
  "biografia": "There are two spellings of\nal-Quhi\n's name in English which seem to appear about equally often, namely al-Quhi and\nal-Kuhi.\nWe can deduce from al-Quhi's name that he came from the village of Quh in Tabaristan. He was brought up during the period that a new dynasty was being established which would rule over Iran. The Buyid Islamic dynasty ruled in western Iran and Iraq from\n945\nto\n1055\nin the period between the Arab and Turkish conquests. The period began in\n945\nwhen Ahmad Buyeh occupied the 'Abbasid capital of Baghdad. The high point of the Buyid dynasty was during the reign of 'Adud ad-Dawlah from\n949\nto\n983\n. He ruled from Baghdad over all southern Iran and most of what is now Iraq. A great patron of science and the arts, 'Adud ad-Dawlah supported a number of mathematicians at his court in Baghdad, including al-Quhi,\nAbu'l-Wafa\nand\nal-Sijzi\n.\nIn\n969\n'Adud ad-Dawlah ordered that observations be made of the winter and summer\nsolstices\nin Shiraz. These observations of the winter and summer solstices were made by al-Quhi,\nal-Sijzi\nand other scientists in Shiraz during\n969\n/\n970\n.\nSharaf ad-Dawlah was 'Adud ad-Dawlah's son and he became Caliph in\n983\n. He continued to support mathematics and astronomy so al-Quhi remained at the court in Baghdad working for the new Caliph. Sharaf ad-Dawlah required al-Quhi to make observations of the seven planets and in order to do this al-Quhi had an observatory built in the garden of the palace in Baghdad. The instruments in the observatory were built to al-Quhi's own design and installed once the building was complete. Al-Quhi was made director of the observatory and it was officially opened in June\n988\n.\nA number of scientists were present at the opening. One in particular, the famous mathematician and astronomer\nAbu'l-Wafa\n, is worthy of mention. He was also employed at the court of Sharaf ad-Dawlah. Another who was present at the opening was Abu Ishaq al-Sabi. Al-Sabi was a high ranking official in Baghdad who was interested in mathematics. We mention later in this article correspondence between al-Quhi and al-Sabi. Some accurate observations were made but the observatory ceased work in\n989\non the death of Sharaf ad-Dawlah. The Buyid dynasty was by this stage beginning to lose control of the empire. The economy was on a downward path, and rebellions in the army made the ruler's life difficult. Fine cultural activities such as an observatory took a lower priority.\nOur description of al-Quhi's life has highlighted his work in astronomy. However, it is in mathematics that he is more famous, being the leading figure in a revival and continuation of Greek higher geometry in the Islamic world. The geometric problems that al-Quhi studied usually led to\nquadratic\nor\ncubic equations\n. Nasir al-Din\nal-Tusi\ndescribed one of the problems considered by al-Quhi writing\n(\nsee for example\n[\n1\n]\n)\n:-\nTo construct a sphere segment equal in volume to a given sphere segment and equal in area to a second sphere segment - a problem similar to but more difficult than related problems solved by\nArchimedes\n- Al-Quhi constructed the two unknown lengths by intersecting an equilateral\nhyperbola\nwith a\nparabola\nand rigorously discussed the conditions under which the problem is soluble.\nAl-Quhi's solution to the problem is given in\n[\n5\n]\n. It is a classical style of solution using results from\nEuclid\n's\nElements\n,\nApollonius\n's\nConics\nand\nArchimedes\n'\nOn the sphere and cylinder\n. If a solution exists, al-Quhi showed that it will have coordinates which lie on a particular rectangular hyperbola that he has constructed. Of course, al-Quhi does not express the mathematics in these modern terms but rather in the usual classical geometry of ancient Greek mathematics. Next al-Quhi introduces the \"cone of the surface\" which, after many deductions, leads to showing that the solution has coordinates lying on a parabola. The problem is then beautifully solved as the intersection of the two curves.\nIn another treatise\nOn the construction of an equilateral pentagon in a known square\nal-Quhi solves the problem given in the title again using the intersection of two conic sections, this time two hyperbolas. Although it is impossible to inscribe a regular pentagon in a square, an equilateral pentagon can be\ninscribed\nin two ways. One, which requires the solution of a quadratic equation, had been found by\nAbu Kamil\nin the ninth century. The other, which requires the solution of a\nquartic equation\n, is the one presented by al-Quhi. Details of this treatise are given in\n[\n6\n]\n(\nsee the corrections and additions of\n[\n7\n]\n)\n, and\n[\n8\n]\n.\nAl-Quhi also described a conic compass, a compass with one leg of variable length, for drawing conic sections in the treatise\nOn the perfect compass\n[\n1\n]\n:-\n... he first described the method of constructing straight lines, circles, and conic sections with this compass, and then treated the theory. He concluded that one could now easily construct\nastrolabes\n, sundials and similar instruments.\nIndeed al-Quhi did consider the problem of constructing astrolabes in\nOn the construction of the astrolabe\n. The astrolabe was an instrument used to observe altitudes, and it provided a mechanical means to transform celestial coordinates between an equatorial system and one based on the horizon. This treatise is in two Books, the first being divided into four chapters, the second book into seven chapters.\nThere are a number of difficult mapping problems solved by al-Quhi in this work. In particular, using a method resembling descriptive geometry, he maps circles on the sphere into the equatorial plane. After manipulation, they are mapped back again onto the sphere in a remarkable piece of visualisation. Despite the appearance of the work being of practical use in constructing an astrolabe, it would appear that al-Quhi was more interested in the mathematics for its own sake than he was in giving a practical manual.\nFinally we should mention the correspondence between al-Quhi and al-Sabi which we mentioned above. It is known that there were at least six letters exchanged but only details of four survive. These are given in both Arabic and English in\n[\n3\n]\n. Topics covered are quite varied, ranging from a discussion of what \"known\" means to solutions of specific problems such as the following Suppose we are given a circle and two intersecting straight lines\nl\nl\nl\nand\nm\nm\nm\n. Suppose the\ntangent\nto the circle at a point\nT\nT\nT\nmeets\nl\nl\nl\nat\nL\nL\nL\nand\nm\nm\nm\nat\nM\nM\nM\n. How can one choose\nT\nT\nT\nso that\nT\nL\n:\nT\nM\nTL : TM\nT\nL\n:\nT\nM\nis equal to a given ratio? Perhaps the most interesting parts of the correspondence are six theorems given by al-Quhi concerning the centres of gravity of various figures. Five of the six results are correct but the sixth is false. It states that the centre of gravity of a semicircle divides the radius in the ratio\n3\n:\n7\n. From this false result al-Quhi deduces the equally false result that\nπ\n=\n28\n9\n\\pi = \\large\\frac{28}{9}\\normalsize\nπ\n=\n9\n2\n8\n​\n. Even the best mathematicians can make mistakes!",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}