{
  "nome_completo": "Richard Alan Day",
  "nome_curto": "Alan Day",
  "ano_nascimento": "1941",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Day/",
  "lugar_nascimento": "Sault Ste Marie, Ontario, Canada",
  "lugar_morte": "Thunder Bay, Ontario, Canada",
  "biografia": "Alan Day\nwas born in Sault Ste Marie, Ontario, Canada which is between Lake Superior and Lake Huron, on the border between Canada and the United States. He was brought up in North Bay, Ontario, which is about\n360\nkm east of Sault Ste Marie on Lake Nipissing\n(\nit is about\n300\nkm due north of Toronto\n)\n. It was in North Bay that Alan attended primary and then secondary school. At this stage he had no aspirations to an academic career, rather he decided that life in the Canadian Air Force would make a good career. The Air Force gave him the opportunity of studying for an undergraduate degree in mathematics which they financed on the condition that he then followed an Air Force career.\nFrom\n1959\nto\n1963\nDay studied mathematics at McMaster University in Hamilton, Ontario. His performance was not outstanding for at this stage he did not see mathematics as playing much of a role in his future. After graduating in\n1963\nhe was Lead Navigator in the\n415\n(\nM.P.\n)\nSquadron. He held the rank of Captain and spent four years in this role. However it was during these years that he found himself bored with life in the Air Force and he realised that in fact his real love was mathematics. He began to work on that topic and in\n1967\nhe resigned from the Air Force and began to study for a Master's degree at McMaster. If his application had been based solely on his undergraduate record it is unlikely that McMaster would have accepted him onto their graduate programme, but the mathematics he had done while in the Air Force was sufficient to convince them of his research potential.\nIndeed Day quickly demonstrated that he had outstanding research potential. Within nine months he had completed his Master's degree and submitted a Master's thesis\nOn modular equational classes\n. He graduated in May\n1968\nand published the results of his thesis in the paper\nA characterization of modularity for congruence lattices of algebras\npublished in the\nCanadian Mathematical Bulletin\nin\n1969\n. He continued to undertake research at McMaster for a doctorate advised by Günter Bruns. The award of the degree followed the successful defence of his thesis on\n15\nApril\n1970\n. The award of a National Research Council postdoctoral fellowship allowed him to undertake research during the following academic year at Vanderbuilt University in Nashville, Tennessee, also at the University of Waterloo in Ontario and at the Technische Hochschule in Darmstadt. Lakehead University in Thunder Bay, Ontario, offered him the position of Assistant Professor which he accepted and took up the post at the beginning of the academic year\n1971\n-\n72\n.\nSome of Day's early papers are:\nInjectives in non-distributive equational classes of lattices are trivial\n(1970)\n,\nA note on the congruence extension property\n(1971)\n,\nInjectivity in equational classes of algebras\n(1972)\n,\nSplitting algebras and a weak notion of projectivity\n(1973)\n,\nFilter monads, continuous lattices and closure systems\n(1975)\n, and\nSplitting lattices generate all lattices\n(1975)\n.\nHe spent his whole career at Lakehead University in Thunder Bay, being promoted to Associate Professor in\n1975\nand to full professor five years later. We have already noted above his research visits to Vanderbuilt University and the Technische Hochschule in Darmstadt in\n1970\n-\n71\n. He made similar research visits to these two institutions when he took study leave in\n1975\n-\n76\n. In\n1983\n-\n84\nhe again took study leave, spending part of the year in Darmstadt but on this occasion he spent the remainder of the year at the University of Hawaii. He returned to Hawaii as a Visiting Professor for the winter term of\n1987\n.\nDay made many major contributions to lattice theory. One of the first was in the paper\nA simple solution to the word problem for lattices\n(1970)\nwhere he gave a simple solution to the word problem in free lattices. This paper introduced Day famous doubling construction. Nation writes in\n[\n5\n]\n:-\nAlan once told me that he really liked elegant mathematics: simple ideas that give profound insights. Of course, everyone does, and it was for that reason that Alan was particularly proud of his doubling construction. It is a method which is simultaneously powerful and simple, with subtleties that go beyond the surface. It is a subject to which Alan kept returning to the end.\nRalph Freese, the author of\n[\n2\n]\nand\n[\n3\n]\n, writes in a review of\n[\n4\n]\nabout another of Day's major contributions:-\nThis paper surveys Alan Day's work in modular lattice theory and its importance to the subject. Day's contributions to the subject spanned a\n20\n-year period, beginning with his early joint work on four-generated modular lattices with C Herrmann and R Wille\n[\nOn modular lattices with four generators\n]\nand ending with his work with Herrmann, B Jónsson, J B Nation and D Pickering. Day wrote papers on splitting modular lattices, frames and coordinate rings, critical configurations for the Arguesian identity, modular congruence varieties, and application of modular lattices to database theory.\nBurris, in\n[\n1\n]\n, looks at computers and universal algebra:-\n... Alan Day was certainly a leader in the new wave of computer enthusiasts. Early on he worked out an arrangement with Apple computers: and he was always a strong supporter of their machines. One of his early projects was to create a large database of papers in universal algebra and lattice theory. In the mid\n1980\n's he distributed to his colleagues a program to draw lattices which had menus to check properties such as distributivity and modularity. And the last lecture I heard him give was a lovely talk on relational databases, at McMaster in the Fall of\n1989\n.\nAs to his methods of working, the authors of\n[\n3\n]\ngive the following insight:-\nHis proofs involved a subtle manipulation of terms and, when asked by a colleague about how he found one particularly hard proof, he replied \"Simple. I came to work in the morning, wrote the equations down, and tried to manipulate them. After two years of doing this every day, I found the proof.\"\nThey also indicate his character:-\nPersonally, Alan always had a great affection for Northern Ontario, good food\n(\nwhich he often cooked himself\n)\n, beer, fine wine, and good humour. He was very proud of being Canadian.\nSichler notes in\n[7]\nthat Alan:-\n... would enthusiastically talk mathematics with anyone, anywhere, at any time.\nDay was married to Lise Minville. In August\n1989\nhe underwent surgery and pancreatic cancer was diagnosed. He struggled bravely against the illness for sixteen months, continuing to undertake research in his home. He even managed to travel to Connecticut to deliver a series of lectures. After his death his colleagues organised a conference to honour his memory. Held at McMaster in August\n1992\n, expositor talks were delivered by R Freese,  J B Nation, and C Herrmann. The papers\n[\n2\n]\n,\n[\n5\n]\n, and\n[\n4\n]\nare based on these talks.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}