{
  "nome_completo": "Albert Châtelet",
  "nome_curto": "Albert Châtelet",
  "ano_nascimento": "1883",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chatelet_Albert/",
  "lugar_nascimento": "Valhuon, Pas-de-Calais, France",
  "lugar_morte": "Paris, France",
  "biografia": "Albert Châtelet\n's father was a secondary school teacher at Valhuon, a small village close to St Pol sur Ternoise about\n55\nkm north of Amiens and\n40\nkm northwest of Arras. Albert's early education was in Valhuon but then he studied at the Collège in St Pol sur Ternoise. In\n1901\nhe moved to the lycée in Douai where he took special mathematics classes. This lycée had a long history dating back to the Jesuit College of Anchin but when Châtelet studied there the lycée had been remodelled following the\n1848\nrevolution. It is worth noting that the buildings were severely damaged in the wars of the\n20\nth\ncentury but have been completely renovated and are now named 'Lycée Albert Châtelet' after their famous former pupil, the subject of this biography. After taking the entrance examinations of the École Polytechnique and the École Normale Supérieure, Châtelet entered the École Normale Supérieure in\n1905\n, considered the better of the two for mathematics at that time. He qualified as a teacher of mathematics in\n1908\nand was appointed to teach at the lycée in Tours. In the following year,\n1909\n, he married Marguerite Brey, a friend of his sister; they had nine children. He undertook research while undertaking his duties as a school teacher and, in\n1911\n, he submitted his thesis\nSur certains ensembles de tableaux et leur application à la théorie des nombres\nⓉ\n(\nOn some sets of tables and their application to number theory\n)\n. He had been advised by\nJules Tannery\n. His thesis was published as a\n97\n-page paper in the\nAnnals\nof the École Normale Supérieure in\n1911\n.\nChâtelet was in charge of a course at the Collège de France in\n1912\n. In the same year he published another major paper, the\n25\n-page\nContribution à la théorie des fractions continues arithmétiques\nⓉ\n(\nContribution to the theory of continued fractions arithmetic\n)\nin the\nBulletin\nof the\nFrench Mathematical Society\n. In\n1913\nChâtelet was appointed as a lecturer at the Faculty of Science at Toulouse. He only spent a year in this position before being appointed as a lecturer at the University of Lille but the outbreak of war prevented him taking up the lectureship. By the end of July\n1914\nFrance had began mobilizing its troops and, on\n3\nAugust, Germany declared war on France. Châtelet, called to the lectureship in Lille on\n5\nAugust, was drafted into the army medical corps. However, his mathematical skills were soon put to good use with a wartime assignment\n[\n2\n]\n:-\nOn\n12\nOctober\n1915\n, the professional ballistician General Prosper-Jules Charbonnier\n(1882\n-\n1936)\nsent a memo to his superiors calling attention to the tremendous ballistic effort that war operations now demanded. A Navy officer trained at the École Polytechnique who had served in Africa and in the Far East, Charbonnier was at the time President of the so-called 'Commission d'expériences d'artillerie navale de Gâvre', which was both a proving ground and the main military body in charge of ballistic computations for the French navy and army. ... Gâvre\n[\nwas\n]\nnear the seaport of Lorient in Brittany. ... As a result of Charbonnier's memo, a dozen mathematicians, physicists and astronomers would join the Gâvre Commission over the course of the war, including Albert Châtelet\n(1883\n-\n1960)\n,\nGeorges Valiron\n(1884\n-\n1955)\n, Joseph Kampé de Fériet\n(1893\n-\n1982)\n, and\nArnaud Denjoy\n(1884\n-\n1974)\n. The work they did at Gâvre was part of the establishment of new theoretical foundations for computing in exterior ballistics.\nThe 'Mission du Tir Aérien de Gâvre' was set up in April\n1916\n. Châtelet was one of a dozen mathematicians and physicists who worked there under military guidance. Both theoretical work involving computing trajectories and experimental work measuring the actual trajectories after firing were undertaken. Then the gathered data was used to produce tables\n[\n2\n]\n:-\nNotes written for a series of experiments undertaken in the spring of\n1916\ncan help to convey an even clearer sense of the mathematicians' activities at Gâvre. The workload was divided into field and office work. In the field\n[\ntwo officers\n]\nand a soldier operated the battery; mathematicians Jules Haag and Albert Châtelet, officers, workers, and apprentices manned three observations stations, while others tended the registering instrument. In order to communicate between observation stations, mathematicians were asked to study the Morse code.\nChâtelet undertook this work until September\n1917\n. After this he was assigned as an assistant to the naval engineer Anne, helping him prepare and execute firings, draft reports and undertake computations.\nWhile military work at Gâvre may have seemed enviable compared to the lot of soldiers on the front, it was not without danger. In a talk delivered in Lille in\n1924\n, Châtelet recalled an accident that occurred to him. In one of the firings, observers placed behind the cannon observed huge red flares and abundant black smoke coming out of the muzzle that was expelling shards of shell for about one minute. The shell had exploded in the barrel and the cannoneers had nowhere to hide: \"I can insure you, even if this is not in the written report, that observers\n[\n...\n]\nfelt that one minute can be very long.\"\nThe war ended in\n1918\nbut Châtelet was not released from military service until\n1919\n, and only then was he able to take up the position he had been appointed to in Lille five years earlier. In fact promotion at Lille came rather quickly since the chair of general mathematics was vacant because Jean Clairin\n(1876\n-\n1914)\n, the previous holder, had been killed near Cambrai in the war. Clairin, who applied group theory to the solution of differential equations, had published\nCours de mathématiques générales\nⓉ\n(\nGeneral mathematics\n)\n(1910)\n. Châtelet was appointed to fill this chair in\n1920\nbut soon another vacancy occurred when Charles Albert Petot\n(1851\n-\n1927)\n, the professor of rational mechanics, retired. Again Châtelet was chosen to fill the chair. Openings continued to come for Benoît Côme Damien\n(1848\n-\n1934)\n, the Dean of Science at Lille, vacated the position in\n1921\n. Damien, the professor of physics at Lille, had won the Kuhlmann prize for his work on optics. Châtelet was elected by his colleagues to the role in October of that year. In June\n1924\nhe was appointed rector of the University of Lille, filling the position which had been held by Georges Lyon. So, having been forced to delay the start of his career at Lille by five years because of the war, he then went from junior lecturer to rector of the university in only five years.\nLille had been occupied by the Germans between\n13\nOctober\n1914\nand\n17\nOctober\n1918\n, during which time the university suffered looting and requisitions. In\n1916\nexplosions had destroyed the university's laboratories. Georges Lyon had been rector through this period and had struggled to keep the university functioning at a minimum level through impossibly difficult times. After the war ended he began the reconstruction of educational facilities. However, when he retired in\n1924\nthere was still much to do to bring the university back to a top level institution and Châtelet launched himself into this task with great enthusiasm. During thirteen years in this role, he organised the purchase of the latest equipment, diversified teaching and encouraged top quality research throughout the university. With his encouragement and support, many new Institutes were created such as an Institute of Fluid Mechanics, an Institute of Radio Engineering, an Institute of Coal Studies, an Agricultural Institute, an Institute of Dentistry, an Institute of Forensics, and a Commercial Institute. He organised the construction of two student residences, which he named after Georges Lefèvre and George Lyon. He began the construction of a new Faculty of Law and reorganised the Medical Faculty.\nIn January\n1937\n, Châtelet left Lille when he was appointed by Jean Zay, the Minister of National Education and Fine Arts in the French government, to be Director of Secondary Education. He was only in this post for three years before World War II put an end to his tenure. In August\n1939\n, Russia and Germany had signed a secret pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged attack on Poland began on\n1\nSeptember\n1939\nand, on the following day, Britain, France and several other countries, declared war on Germany. Over the following months France was not involved in any fighting, but spent time strengthening the Maginot line, designed to protect the country from an invasion by Germany. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders. Five days later German forces crossed into France and quickly headed for the coast. German forces entered Paris on\n14\nJune and a couple of days later France requested armistice terms but fighting continued. The armistice was signed on\n22\nJune and within a couple of days all hostilities in France had ended. During his three years as Director of Secondary Education, Châtelet had been involved in producing a major package of educational reforms. However, once the Germans had set up the Vichy government in France, Châtelet and his reforms were totally out of favour and he had to leave the Department of Education. His political views had always been on the left and this made him completely unacceptable to the Vichy government. However, he was more fortunate than Jean Zay, who had appointed him as Director of Secondary Education, for Zay was assassinated in Molles, Allier, on\n20\nJune\n1944\n, probably on the orders of the Vichy government.\nChâtelet returned to university teaching, being appointed as a professor in the Faculty of Sciences in Caen in March\n1941\n. From October of that year he was in charge of teaching the course on higher arithmetic at the Sorbonne. In July\n1945\nhe was appointed to the Chair of Arithmetic and Number Theory at the Sorbonne. At the same time, he was appointed as Director of Youth Movements and Popular Education. In July\n1946\nhe chaired the Commission to reform the scientific programmes of the preparatory classes of the grandes écoles. He became Dean of the Faculty of Science in Paris in\n1949\n, taking over from Jean Cabannes\n(1885\n-\n1959)\n, a physicist who had made major contributions to optics. Châtelet displayed the same skills as an administrator in his role as Dean of the Faculty of Science as he had during his time as rector of the University of Lille. He held this post for five years until he retired from the academic world in\n1954\n. However, at this time he chose to return to the world of politics that he had been forced to leave after the French defeat in World War II.\nHis left-wing political views continued and he was elected as President of the left-wing Rationalist Union in July\n1955\n. This was a time when French politics was dominated by the Algerian problem which had begun in October\n1954\nwhen Algerian nationalists began a rebellion against French rule. Châtelet organised a number of conferences attempting to solve the Algerian problem while fighting there intensified with increasing numbers of French troops being sent to put down the rebellion. This almost caused the total collapse of the French government and Charles de Gaulle saw this as a chance to return to French politics. Châtelet strongly opposed de Gaulle's return, as did François Mitterrand and Pierre Mendes-France. In June\n1958\nde Gaulle became prime minister and drew up a new constitution giving special powers to the president. The constitution was approved in a referendum in September\n1958\nand de Gaulle put himself forward as a candidate for president in December\n1958\nelections. Politicians on the left, including François Mitterrand and Pierre Mendes-France, chose Châtelet to be the left-wing candidate to oppose de Gaulle in this election. It resulted in a victory for de Gaulle with Châtelet gaining only about\n8\n% of the vote.\nWe have not said much about Châtelet's research in number theory and in algebra. His contributions were certainly less than they might otherwise have been due to his heavy administrative duties and his political involvement. We illustrate his work by giving the titles of some of the papers he published after returning to the academic world in World War II. He published:\nArithmétique des corps abéliens du troisième degré\nⓉ\n(\nArithmetic of Abelian fields of the third degree\n)\n(1946)\n;\nLes théorèmes de Jordan-Hölder et Schreier\nⓉ\n(\nThe theorems of Jordan-Holder and Schreier\n)\n(1947)\n;\nAlgèbre des relations de congruence\nⓉ\n(\nAlgebra of congruence relations\n)\n(1947)\n;\nL'arithmétique des idéaux\nⓉ\n(\nThe arithmetic of ideals\n)\n(1950)\n;\nIdéaux principaux dans les corps circulaire\nⓉ\n(\nPrincipal ideals in cyclic fields\n)\n(1950)\n;\nUtilisation des matrices dans l'algèbre et l'arithmétique des corps de nombres algébriques\nⓉ\n(\nUse of matrices in algebra and the arithmetic of algebraic number fields\n)\n(1950)\n; and\nUne forme générale des théorèmes de Schreier et de Jordan-Hölder\nⓉ\n(\nA general form of theorems Schreier and Jordan-Holder\n)\n(1951)\n. Châtelet published the three-volume work\nArithmétique et algèbre modernes\nⓉ\n(\nArithmetic and modern algebra\n)\n(1954\n,\n1956\n,\n1966)\ncontaining over\n1000\npages in total. Volume I contains two chapters. The first chapter presents an introduction to logic, followed by sections on algebras of sets, lattices, mappings, and operations. The second chapter presents group theory, containing sections on subgroups, transformation groups, lattices of subgroups, Abelian groups, arithmetic functions on the semigroup of positive integers, and subgroups of finite groups. Chapters\n3\nto\n5\nare in Volume II. Chapter\n3\ndiscusses the theory of rings, modules, and algebras. Chapter\n4\ndiscusses polynomial rings, bilinear operations, and matrices. Chapter\n5\n, the final chapter of Volume II, discusses the structure theory of commutative rings, in particular radicals of rings, Artinian rings, Noetherean rings, prime and semi-prime ideals, and the primary decomposition of ideals. Chapter\n6\ncovers elementary ideal theory and factorization theory in integral domains. Chapter\n6\n, the final chapter, looks at finite-dimensional vector spaces over division rings with a discussion of linear transformations and matrices, total matrix algebras, modules over principal ideal domains and similarity of matrices with elements in a field.\nChâtelet was honoured with being made an Officer of the Légion d'Honneur on\n10\nFebruary\n1955\nand Commander of the Academic Palms on\n2\nJuly\n1956\n.\nFinally let us note that three of Albert and Marguerite Châtelet's children went on to hold influential positions in Lille. François Châtelet began his mathematical career as an assistant at Lille, Jean Châtelet was headmaster at a school in Arras before becoming Inspector General, while Albert Châtelet became the youngest curator of the Museum of Fine Arts in Lille. François Châtelet\n(1912\n-\n1987)\nwent on to become a professor at the University of Besançon. He has introduced a number of concepts which have been named after him, for example the\nWeil\n-Châtelet group and Châtelet surfaces. We must emphasise that these are named after François Châtelet, the son of Albert Châtelet, not after the subject of this biography.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}