{
  "nome_completo": "Albert Nijenhuis",
  "nome_curto": "Albert Nijenhuis",
  "ano_nascimento": "1926",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nijenhuis/",
  "lugar_nascimento": "Eindhoven, The Netherlands",
  "lugar_morte": "Seattle, Washington, USA",
  "biografia": "Albert Nijenhuis\n' high school studies were at the\nGymnasium\nin Arnhem where it appears he was a fairly average student. When World War II broke out in September\n1939\n, Nijenhuis was only twelve years old. For a few months life in The Netherlands went on much as normal but on\n10\nMay\n1940\nGermany invaded and the country was quickly occupied. Nijenhuis was able to continue his studies at the Gymnasium where, at the age of fourteen, he became fascinated by mathematics. In June\n1944\nAllied troops landed on the French coast and began to fight their way south and east. By the end of August, Paris was liberated and by early September Brussels was also liberated. The Allies planned a major airborne drop of troops to take bridges at Eindhoven and Arnhem. This was known as Operation Market Garden and was intended to open a route for the Allies to drive towards Berlin. Due to a number of different causes, the operation was defeated by the end of September\n1944\nafter a violent battle lasting for over a week. The Germans evacuated Arnhem, the Gymnasium there was closed down and Nijenhuis' schooling came to an end. The Nijenhuis family were forced to leave the town.\nWhen the Arnhem Gymnasium closed, Nijenhuis was seventeen years old and had only one year of schooling left. His grandparents lived in a small Dutch village and, since it was comparatively safe, he went there. He lived for a year with his grandparents and during this time he continued his studies, working on his own. He was able to take the State examinations in\n1945\nand, having obtained good passes in these, he entered the University of Amsterdam in the autumn of\n1945\n.\nL E J Brouwer\nwas a professor at Amsterdam at this time. Nijenhuis was awarded his Candidat degree, equivalent to a Bachelor's degree, in\n1947\n. He progressed rapidly, taking only half of the normal length of study to pass some of the examinations, and was awarded his Doctorandus degree, equivalent to a M.Sc. degree, in\n1950\n. Undertaking research for his Ph.D. at the Mathematisch Centrum\n(\nnow the Centrum Wiskunde & Informatica\n)\nadvised by\nJan Arnoldus Schouten\n, he was an associate there during\n1951\n-\n52\n.\nNijenhuis summarises\nSchouten\n's life in the following words\n[\n1\n]\n:-\nA descendant of a prominent family of shipbuilders,\nSchouten\ngrew up in comfortable surroundings. He became not only one of the founders of the \"\nRicci\ncalculus\" but also an efficient organiser\n(\nhe was a founder of the Mathematical Centre at Amsterdam in\n1946)\nand an astute investor. A meticulous lecturer and painfully accurate author, he instilled the same standards in his pupils.\nIn fact\nSchouten\n, almost certainly because of the pressures of World War II, had become ill in\n1943\n, and had at that time resigned his position in Delft. From\n1948\nuntil\n1953\nhe was professor of mathematics at the University of Amsterdam but he did not teach. He was director of the Mathematical Research Centre at Amsterdam for five years. While still a research student advised by\nSchouten\n, Nijenhuis published papers such as\nX\nn\n−\n1\nX_{n-1}\nX\nn\n−\n1\n​\n-forming sets of eigenvectors\n(1951)\nand\nAn application of anholonomic coordinates\n(1951)\n.\nIn\n1952\nNijenhuis was awarded a Ph.D. for his\n238\n-page thesis\nTheory of the geometric object\nwhich was published by the University of Amsterdam in that year. Václav Hlavaty\n(1894\n-\n1969)\nwrites in a review\n[\n3\n]\n:-\nThe work is divided into three chapters. The first chapter is based on two fundamental concepts: \"transformation element\" and \"allowable coordinate systems\". ... The second chapter deals mainly with the deformation theory of fields of geometric objects\n(\nwhich may even be functionals of some other geometric object\n)\nand is based on the concept of \"group-germ\". ... While the second chapter deals with components of objects, the third chapter deals with their transition induced by the transformation element which characterizes the change of coordinates. Among many topics considered by the author we mention only the formulation of criteria that an object be a differential geometric object.\nIn this work Nijenhuis solved an open question in the theory of deformations, the tool he introduced to solve it now being known as the 'Nijenhuis Tensor'. After the award of his Ph.D., Nijenhuis travelled to the United States where he spent a year at Princeton University on a Fulbright Fellowship. In August of the following year he became a  member of the Institute for Advanced Studies at Princeton. He remained there until September\n1955\n. While at Princeton he published the papers:\nOn the holonomy groups of linear connections. IA, IB. General properties of affine Marianne Nijconnections\n(1953)\n,\nA theorem on sequences of local affine collineations and isometries\n(1954)\n,\nOn the holonomy groups of linear connections. II. Properties of general linear connections\n(1954)\nand\nJacobi-type identities for bilinear differential concomitants of certain tensor fields. I, II\n(1955)\n.\nAfter three years at Princeton, Nijenhuis was appointed as an Instructor in Mathematics at the University of Chicago in\n1955\n. Also in the year\n1955\nhe married Marianne; they had four daughters Erika, Karin, Sabien and Alaine. After spending the academic year\n1955\n-\n56\nin Chicago, Nijenhuis was appointed as an assistant professor at the University of Washington and later was promoted to professor there. During his time at the University of Washington, he was an invited speaker at the International Congress of Mathematicians at the University of Edinburgh, Scotland in August\n1958\n. At the Congress he gave the lecture\nGeometric aspects of formal differential operations on tensor fields\nwhich was published in the Conference Proceedings. He became a U.S. citizen in\n1959\nthen was awarded a J S Guggenheim Fellowship in\n1961\nwhich allowed him to spend the months September\n1961\nto April\n1962\nat the Institute for Advanced Study. Ramesh Gangolli writes\n[\n2\n]\n:-\nAlbert's association with our department\n[\nat the University of Washington\n]\ngoes back to\n1956\n, when he joined the department as an Assistant Professor. This was when Carl Allendoerfer was Chair, and was pushing to build up the department's strength in differential geometry. He was a Professor when I arrived as a naive Assistant Professor here in\n1962\n. I was becoming interested in analysis on symmetric spaces at that time. When I started in this direction, I began to feel keenly that I knew very little differential geometry and algebra, both of which were essential to where I wanted to go. Albert was on a Guggenheim Fellowship then, and was spending the second year of the fellowship in Seattle. He was running a seminar on Differential Geometry that I attended and he attended a seminar on Lie algebras that I started in order to study\nHarish-Chandra\n's work, and we became friends.\nHe was a Fulbright Professor spending some time at the University of Amsterdam in\n1963\n-\n64\nbefore taking up an appointment as professor of mathematics at the University of Pennsylvania. Ramesh Gangolli writes\n[\n2\n]\n:-\n... in\n1963\n, Albert received an offer from the University of Pennsylvania which he accepted.\nRichard Kadison\nhad moved there from Chicago and was charged with refreshing the lustre of the Mathematics department's ivy. He conducted several raids\n(\nsome friends began to call him the Viking\n)\n, and we suffered by losing both Albert Nijenhuis and Michael Fell, who were recruited by him. Fortunately, although Albert accepted the Penn appointment as of Fall\n1963\n, he stayed on in Seattle, on leave from Penn, until\n1964\n, which enabled me to continue our seminar for another year.\nHe held this position the University of Pennsylvania until he retired in\n1987\nbut he spent two periods away, first as a visiting professor at the University of Geneva in\n1967\n-\n1968\n, and later at Dartmouth College in\n1977\n-\n1978\n.\nAt the University of Pennsylvania, his excellent teaching was recognised with the \"Good teaching award - Fall\n1974\n\" and the \"Good teaching award - Spring\n1975\n\". His research interest in deformations changed over the years towards combinatorics and, in\n1975\n, he published his most famous work namely the book\nCombinatorial algorithms\nwritten in collaboration with\nHerbert S Wilf\n. They wrote in the Preface:-\nIn the course of our combinatorial work over the past several years, we have been fond of going to the computer from time to time in order to see some examples of the things we were studying. We have built up a fairly extensive library of programs, and we feel that other might be interested in learning about the methods and/or use of the programs. This book is the result.\nHale Freeman Trotter, reviewing the\n1978\nsecond edition writes\n[\n9\n]\n:-\nThe form of this book is highly appropriate to its subject. Problems and their solutions are first discussed in mathematical terms, followed by formal algorithms with commentary for the solutions. ... The mathematical sections can be read by themselves with pleasure. The well-organized combination of the two, however, is what gives the book its special value. The authors have provided convincing support for their belief that studying the interplay between computer programs, algorithms, and mathematics can illuminate all three.\nFor fuller extracts from Prefaces and reviews of this classic text, see\nTHIS LINK\n.\nAlthough working at the University of Pennsylvania, Nijenhuis continued his love of Seattle and\n[\n2\n]\n:-\nAlbert and his wife Marianne visited Seattle off and on during the summer and kept in touch with friends. Although those visits suffered a lull after some time, their love for Seattle never diminished, and they promptly moved back here after Albert retired in\n1987\n. Of course, they resumed their old friendships and made new ones. Albert became an Affiliate Professor in our department and participated in several ways in its life. During these years, I became aware of the non-mathematical side of his personality. He had a breadth of education that is typical of the European system of the nineteen thirties and forties, and also had an impressive adeptness at mechanical tasks -\n(\nimpressive to me anyway, brought up as I was as a mechanical incompetent\n)\n. He was very good at woodworking and putting together all sorts of gadgets. He was a self-taught electrician, a very competent plumber, and a general Johnny-come-handy. He was greatly fond of maps, and knew a lot about them. He read widely, and retained a lot of it. He enjoyed food and wine, and above all conversation and laughter. Marianne had established a sort of tradition of hosting their many friends at an annual Rijsttafel\n[\nliterally 'rice food', an elaborate Dutch meal of Indonesian food\n]\n, and we spent many wonderful evenings at these gatherings, and of course on other occasions also.\nNijenhuis was honoured with being elected a corresponding member of the\nRoyal Netherlands Academy of Arts and Sciences\nin\n1966\nand as a Fellow of the\nAmerican Mathematical Society\nin\n2012\n.\nAround\n2013\nhis health began to deteriorate and he died following several months of failing health.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic"
  ]
}