{
  "nome_completo": "Albert Turner Bharucha-Reid",
  "nome_curto": "Albert Bharucha-Reid",
  "ano_nascimento": "1927",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bharucha-Reid/",
  "lugar_nascimento": "Hampton, Virginia, USA",
  "lugar_morte": "Atlanta, Georgia, USA",
  "biografia": "Albert Bharucha-Reid\nwas given the name Albert Turner Reid and only changed Reid to Bharucha-Reid after his marriage. We shall, however, for simplicity use the name Bharucha-Reid throughout this biography. He was the son of William Thaddeus Reid and Mae Elaine Beamon. William Reid, born on\n19\nJanuary\n1887\nin Abdingdon, Virginia, was an electrician working at the Hampton Institute who married Mae Elaine Beamon in Hampton, Virginia, on\n26\nOctober\n1921\n. Mae Beamon had been born on\n7\nAugust\n1894\nin Hampton, Virginia. They lived in Elizabeth City, Virginia. William and Mae Reid had three children: William Micajah Reid\n(\nborn\n27\nSeptember\n1924\nin Elizabeth City, Virginia\n)\n; Cora M Reid\n(\nborn about\n1925\n/\n26)\n; and Albert Turner Reid, the subject of this biography. Albert was given the name Turner because he was related to Charles Henry Turner\n(1867\n-\n1923)\n, the first African American to receive a Ph.D. in zoology from the University of Chicago, who published over\n70\npapers and made important advances in zoology, particularly in understanding insect behaviour.\nIn\n1930\n, when Albert was two years old, the family were living at Chesapeake, Elizabeth City, Virginia. They were still at the same address ten years later, and at this time Albert was in\n7\nth grade of Elementary School. Bharucha-Reid graduated from George P Phenix High School in Hampton, Virginia, a school for African Americans created by the Hampton Institute, in\n1944\nand then for a time attended Howard University in Washington D.C. followed by the Hampton Institute. In\n1945\nhe registered for military service and completed a Draft Card. At that time he was living at home in Hampton, Elizabeth City, Virginia, with his father. Aged\n18\n, he is described as a student,\n136\nlbs, light brown complexion, brown eyes, brown hair and\n5\nft\n10\nins in height.\nAfter this, he studied mathematics and biology at Iowa State University, graduating with a B.S. in\n1949\n. Up to this time he had been interested equally in mathematics and biology, probably influenced by his famous relative Charles Henry Turner, but when he continued his studies at the University of Chicago in\n1950\nhis mathematical interests were definitely moving towards statistics and probability. While undertaking research on mathematical biology, probability and statistics at Chicago, Bharucha-Reid also worked at a Research Assistant in Mathematical Biology at the University. He published papers such as\nOn the diffusion of metabolic intermediates\n(1951)\n,\nA suggested chain process for radiation damage\n(1951)\n,\nA Probability Model of Radiation Damage\n(1952)\n,\nNote on Diffusion\n,\nControlled Reactions\n(1952)\n,\nNote on the growth of bacterial populations\n(1952)\n,\nOn Stochastic Processes in Biology\n(1953)\n. In these papers, he is described as being a U. S. Public Health Service Research Fellow on the Committee on Mathematical Biology at the University of Chicago. The\n1953\npaper begins:-\nThe purposes of this article are:\n(\ni\n)\nto discuss the role of the theory of stochastic processes in the methodology of mathematical biology,\n(\nii\n)\nto present a review of some work dealing with the application of stochastic processes in biology, and\n(\niii\n)\nto encourage, perhaps, other workers to utilise the theory of stochastic processes in formulating mathematical models of various biological phenomena.\nHis paper\nAn age-dependent stochastic model of population growth\n(1953)\nhas the same affiliation as above.\nHe remained at Chicago until\n1953\nbut chose not to complete his Ph.D. and instead moved to a position as a research associate in mathematical statistics at Columbia University in\n1953\n. In December\n1953\nhe attended the\n113\nth Annual Meeting of the\nAmerican Statistical Association\nin Washington, D.C. and presented the paper\nStochastic Processes and the Study of Growth Phenomena\n. He gives the following Abstract:-\nThis paper is divided into three parts:\n(1)\nIntroduction,\n(2)\nConstruction of stochastic models, and\n(3)\nStatistical inference in stochastic models. In Part\n1\nwe discuss the deterministic and stochastic approaches to the study of growth phenomena; and give an introduction to the theory of branching stochastic processes as developed by\nBellman\nand Harris. We consider in Part\n2\nthe construction of various stochastic models for growth using the above theory. Models for birth, birth-and-death, and mutation processes are discussed. The use of these formal models in the study of epidemics and rumour spread, as well as in the study of bacterial growth, is pointed out. In Part\n3\nwe discuss problems of estimation and testing associated with stochastic growth processes. Previous work is reviewed, and some recent investigations on sequential decision problems for branching processes is discussed.\nOn\n5\nJune\n1954\nAlbert Reid married the Indian Rodabe Phiroze Bharucha\n(\nborn\n15\nJune\n1930)\nin Cook County Illinois, and, shortly after that time, changed his name from Reid to Bharucha-Reid. We note that Rodabe also changed her name to Bharucha-Reid and she was awarded a doctorate by Wayne State University in\n1972\nfor her thesis\nOrganized behavior under stress\n. Albert and Rodabe Bharucha-Reid had two children, Kurush Feroze Bharucha-Reid and Rustam William Bharucha-Reid\n(\nborn\n1967)\n. We note that Kurush Bharucha-Reid, born on\n29\nMarch\n1955\n, became an intelligence and special operations expert in the United States Army, serving with great distinction. He died on\n26\nMay\n2010\nat the age of\n55\n.\nNow let us give a comment on the name change to Bharucha-Reid. Albert Bharucha-Reid attended the Third Berkeley Symposium on Mathematical Statistics and Probability, December\n1954\nand July-August\n1955\nand presented the paper\nOn the Stochastic Theory of Epidemics\n. His name on the paper in the published\nProceedings\nis given as A T Bharucha-Reid and the affiliation Columbia University. He and his wife, and first child took a flight from New York to Bombay, India, on\n12\nJune\n1956\n, however, and gave their names as Albert Reid, Rodabe Reid and Kurush Reid. When they returned, flying from Bombay to Idlewild Airport, New York on\n7\nOctober\n1956\nthey gave their names as Albert T Bharucha-Reid and Rodabe P Bharucha-Reid.\nWhen Bharucha-Reid was undertaking the research for the paper\nOn the Stochastic Theory of Epidemics\nmentioned above, he was supported by funds provided under Contract AF\n18(600)\n-\n939\nwith the USAF School of Aviation Medicine, Randolph Field, Texas.\nYou can read the Introduction to that paper and the Abstracts of other early papers by Bharucha-Reid, at\nTHIS LINK\n.\nHis paper\nGenerating functions and the semigroup theory of branching Markov processes\n(1958)\nwritten jointly with Herman Rubin has the note:-\nWork supported by the Office of Ordnance Research, U.S. Army, under Contract No. DA-\n04\n-\n200\n-ORD-\n651\n.\nThis\n1958\npaper has the address, University of Oregon, but a note to say that his current address was Mathematical Institute, University of Wrocław, Wrocław, Poland. Bharucha-Reid had left Columbia University in\n1955\nand worked as an Assistant Research Statistician at the University of California, Berkeley for the year\n1955\n-\n1956\nbefore taking up the appointment of Instructor at the University of Oregon in\n1956\n. He was a Fellow of the\nPolish Academy of Sciences\n,\n1958\n-\n1959\n, which is the period when he was at the University of Wrocław in Poland.\nIn addition to his academic work and work for the U.S. Army, he worked on a United States Air Force project researching stochastic theory of epidemics. We note that on\n27\nAugust\n1958\nand again on\n11\nAugust\n1959\nhe flew with the Military Air Transport Service from the United States Air Force base at Burtonwood, England to Newark, New Jersey, USA.\nPromoted to Assistant Professor Mathematics at the University of Oregon, he remained there until\n1961\nwhen he was appointed as Associate Professor of Mathematics at Wayne State University. He remained at Wayne State University, Detroit, Michigan, until\n1981\nbut spent time at various other institutions. He was Professor Applied Mathematics at the Institute for Mathematics Sciences, Madras,\n(\nnow Chennai\n)\nIndia\n(1963\n-\n1964)\n, Professor of Mathematics at the Research Center, University of Wisconsin, Madison\n(1966\n-\n1967)\n, and at the Georgia Institute Technology\n(1973\n-\n1974)\n. Other roles he had during these years included being a Member of the Graduate Record Examination Board, Princeton, New Jersey\n(1978\n-\n1982)\nand on the Board of Governors of Cranbrook Institute Science, Bloomfield Hills, Michigan\n(1977\n-\n1980)\n.\nRonald Mickens gave a talk\n[\n14\n]\nin\n2013\ngiving insights into Bharucha-Reid's life and family, professional career, and research areas. His Abstract is as follows:-\nAlbert Turner Bharucha-Reid had a distinguished career in both pure and applied mathematics. His many contributions to research, student training and mentoring, and academic and professional leadership were acknowledged by various honours and awards he received throughout his life. His first book, 'Elements of the Theory of Markov Processes and Their Applications', provided one of the first concise introductions to the area of probabilistic analysis and for many years was successful as a textbook and guide for self-study. He published more than seventy papers and authored seven books on topics in the stochastic theory of epidemics,\nMarkov\nprocess, random integral and polynomial equations, and computational methods. His last book, with M Sambandham, 'Random Polynomials', was published posthumously in\n1986\n. ... Of both great interest and significance is the fact that he never received the formal doctoral degree in mathematics.\nBharucha-Reid published two different types of books. There were his monographs such as\nElements of the Theory of Markov Processes and Their Applications\n(1960)\n,\nRandom Integral Equations\n(1972)\nand\n(\nwith Masilamani Sambandham\n)\nRandom Polynomials\n(1986)\n. He begins the Preface to the first of these as follows:-\nMy purpose in this book is twofold: first, to present a nonmeasure-theoretic introduction to\nMarkov\nprocesses, and second, to give a formal treatment of mathematical models based on this theory which have been employed in various fields. Since the main emphasis is on applications, this book is intended as a text and reference in applied probability theory.\nYou can read a longer extract from the Preface and extracts from several reviews of the book at\nTHIS LINK\n.\nHe begins the Preface to\nRandom Integral Equations\nas follows:-\nAt the present time the theory of random equations is a very active area of mathematical research; and applications of the theory are of fundamental importance in the formulation and analysis of various classes of operator equations which arise in the physical, biological, social, engineering, and technological sciences. Of the several classes of random equations which have been studied, random integral equations\n(\nand random differential equations formulated as integral equations\n)\nhave been studied rather extensively. This book is intended as an introductory survey of research on random integral equations and their applications.\nYou can read a longer extract from the Preface and extracts from two reviews of the book at\nTHIS LINK\n.\nThe book with Masilamani Sambandham was published a year after Bharucha-Reid died. The Publisher's Description contains the following:-\nThe publication first offers information on the basic definitions and properties of random algebraic polynomials and random matrices. Discussions focus on\nNewton\n's formula for random algebraic polynomials, random characteristic polynomials, measurability of the zeros of a random algebraic polynomial, and random power series and random algebraic polynomials.\nYou can read the full Publisher's Description and extracts from three reviews of the book at\nTHIS LINK\n.\nThe second type of book that Bharucha-Reid published consisted of long articles written by experts in their fields. He edited two such books, the first being the three volume work\nProbabilistic Methods in Applied Mathematics\n(1968\n,\n1970\n,\n1973)\nand the second being\nProbabilistic Analysis and Related Topics\n(1978\n,\n1979\n,\n1983)\n. Bharucha-Reid explains his aims with these series in the Preface to the first of these books.  Here is an extract from this Preface:-\nWithin recent years research in stochastic processes, functional analysis, and numerical analysis has led to the development of powerful methodological tools for the applied mathematician; and there is considerable evidence that applied mathematicians are indeed using the results of research in the above fields to formulate theories and study more realistic mathematical representations of concrete natural phenomena. This present serial publication, which will be published in several volumes at irregular intervals, is devoted to the role of modern probability theory, in particular the theory of stochastic processes, in the general field of applied mathematics.\nFor a longer extract from this Preface and short extracts from reviews of both books, see\nTHIS LINK\n.\nWe gave details above of Bharucha-Reid's career up to\n1981\n. Ronald Mickens gives some information on the final years of his life in\n[\n13\n]\n:-\nHe went to the Georgia Institute of Technology in\n1982\nand to Atlanta University in\n1984\n. At the time of his death he was director of the Center for Computational Sciences at Atlanta University. ... During his last months at Atlanta University, Bharucha-Reid was very active in several aspects of the physics program. In particular, he made direct contributions to the new research thrusts in computational and plasma physics. Two of his final papers were in fact concerned with the numerical solution of a random singular integral equation appearing in crack problems and the effect of random loading on the mechanics of fatigue and crack growth in structures.\nFollowing his early death at the age of\n57\n, several tributes have been paid. For example, in\n1994\nthe\nNational Association of Mathematicians\ninaugurated the NAM Albert Turner Bharucha-Reid Lecture Series. The first lecture,\nGronwall Inequalities for Weak Solutions of Nonlinear Systems with Applications to the Navier-Stokes Equations\n, was given at Morris Brown College, Atlanta, by Tepper Gill of Howard University. Tepper Gill had been one of Bharucha-Reid's Ph.D. students.\nIn\n[\n23\n]\nJasmine Talley explains about the Albert Turner Bharucha-Reid Collection of his papers:-\nThrough his professional correspondence, we see that he advanced the research in his field of probability theory, as well as in physics. He collaborated with other mathematicians and scientists all over the world and kept close tabs on their careers. In addition, he frequently requested the writings and manuscripts from colleagues and granted requests for his own writings and publications. He served as a visiting professor and lecturer at many institutions including the University of Wisconsin and the Institute of Mathematical Sciences in Madras,\n(\nnow Chennai\n)\nIndia. Dr Bharucha-Reid also mentored at least thirteen Ph.D. students. Because of his stature in the field of mathematics, many professionals and students sought out his expertise and advice or his recommendation for professorship positions at universities around the world. He was awarded an honorary doctorate of science from Syracuse University in\n1984\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}