{
  "nome_completo": "Alcuin of York",
  "nome_curto": "Alcuin",
  "ano_nascimento": "735",
  "ano_morte": "804",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alcuin/",
  "lugar_nascimento": "York, Yorkshire, England",
  "lugar_morte": "Tours, France",
  "biografia": "Alcuin of York\nwas born into a high ranking family who lived near the East Coast of England. He was sent to York where he became a pupil at York cathedral school, Archbishop Ecgberht's School.\nAfter being a pupil at Archbishop Ecgberht's School, Alcuin remained there as a teacher, becoming headmaster of the school in\n778\n. During his time as a teacher at this school in York Alcuin built up a fine library, one of the best in Europe, and made the school one of the most important centres of learning in Europe. He wrote a long poem describing the men associated with York's history before he left for the continent.\nIn\n781\nAlcuin accepted an invitation from Charlemagne to go to Aachen to a meeting of the leading scholars of the time. Following this meeting, he was appointed head of Charlemagne's Palace School at Aachen and there he developed the Carolingian minuscule, a clear script which has become the basis of the way the letters of the present Roman alphabet are written. Before leaving Aachen, Alcuin was responsible for the most precious of Carolingian codices, now called the Golden Gospels. These were a series of illuminated masterpieces written largely in gold, often on purple coloured vellum.\nThe development of Carolingian minuscule had, although somewhat indirectly, a large impact on the history of mathematics. It was a script which was much more readable than the old unspaced capital script which was in use before this and, as a consequence, most of the mathematical works were freshly copied into this new script in the\n9\nth\ncentury. Most of the works of the ancient Greek mathematicians which have survived do so because of this copying process and it is the 'latest' version written in minuscule script which has survived.\nNot only was Alcuin headmaster of Charlemagne's Palace School at Aachen but he also was a personal friend to Charlemagne and became the teacher of his two sons. In fact Alcuin lived in Aachen for two periods, during the years\n782\nto\n790\nand then again from\n793\nto\n796\n.\nIn\n796\nAlcuin retired from Charlemagne's Palace School at Aachen and became abbot of the Abbey of St Martin at Tours, where he had his monks continue to work with the Carolingian minuscule script. While in Tours Alcuin arranged for some of his pupils to go to York to bring some of the rarer works that he had collected there back to Tours. He wrote:-\nI say this that you may agree to send some of our boys to get everything we need from there and bring the flowers of Britain back to France that as well as the walled garden in York there may be off-shoots of paradise bearing fruit in Tours.\nAlcuin wrote elementary texts on arithmetic, geometry and astronomy at a time when a renaissance in learning in Europe was just beginning, a renaissance mainly led by Alcuin himself. His lesson books were written in a question - and - answer format. However his work in this area, unlike the inspired calligraphy he developed, shows little originality.\nLate in his life Alcuin summed up his own career with a rather beautiful description:-\nIn the morning, at the height of my powers, I sowed the seed in Britain, now in the evening when my blood is growing cold I am still sowing in France, hoping both will grow, by the grace of God, giving some the honey of the holy scriptures, making others drunk on the old wine of ancient learning...\nThe influence of Alcuin on later generations can be illustrated by a poem by Siegried Sassoon at\nTHIS LINK",
  "math_areas": [
    "Geometry"
  ]
}