{
  "nome_completo": "Aleksei Vasilevich Pogorelov",
  "nome_curto": "Aleksei Vasilevich Pogorelov",
  "ano_nascimento": "1919",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pogorelov/",
  "lugar_nascimento": "Korocha, now Belgorod Oblast, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Aleksei Vasilevich Pogorelov\n's parents, Vasiliy Stepanovich Pogorelov and Ekaterina Ivanovna, were peasant farmers. They lived in a peasant house and were 'kulaks', that is relatively prosperous peasants owning their farm and several head of cattle and horses. Aleksei\n[\n1\n]\n:-\n... spent his childhood in the countryside and his first for years in the local elementary school. Hunting and fishing have been lifelong activities for him.\nIn\n1921\nthe Soviet Union introduced its 'New Economic Policy' which essentially favoured the kulaks and for several years production improved markedly. However, in\n1927\nhigh taxes were introduced for kulaks and, two years later, forced collectivisation of agriculture was introduced with the setting up of the 'kolkhoz', a cooperative agricultural enterprise operated on state-owned land by peasants from a number of households. The Pogorelovs, like most other kulaks, strongly opposed the efforts to force them to give up their small privately owned farm and join a large cooperative agricultural establishment. Vasiliy Stepanovich was forced to leave his native village in\n1931\nand went to Kharkov where at first he was involved in constructing tractors, but then became a blacksmith. The living conditions for the family were harsh and Vasiliy Stepanovich worked at night and slept in the daytime. He did this so that at night his wife, son and daughter could have a sound sleep in the cramped conditions.\nAleksei Vasilevich attended High School Number\n80\nin Kharkov. His mathematical talents became clear when he was around\n13\nyears of age for at this time was very successful in the Mathematical Olympiad competitions which had recently been started up. At this stage he was given the nickname \"Pascal\" by his classmates, a clear indication of their respect for his talents. While at the high school his teacher introduced him to\nNaum Il'ich Akhiezer\n, the head of the function theory research group at Kharkov State University.\nPogorelov entered Kharkov State University in\n1937\nto study mathematics and physics - this was largely due to the influence of\nAkhiezer\nsince Pogorelov also showed considerable artistic skills and his parents had been keen for him to develop these talents. He studied there for four years but by then it was\n1941\nand the course of World War II had taken a dramatic turn for the Soviets.\nIn September\n1939\n, Russia, allied with Germany, had invaded Poland from the east. This had little effect on the life of students in Kharkov. However, in June\n1941\nthe course of the war changed since Germany invaded their country and German troops moved east along a broad front between the Baltic to the Black Sea.\nPogorelov was conscripted into the army and, as one of the most talented students, was not sent to the front but sent to the N E Zhukovskii Military Aviation Engineering Academy in Moscow. He graduated from the Academy in\n1945\n, worked for a while for the army as a specialist on aircraft engines, then was appointed as an engineer designer to the Central Aero-hydrodynamics Institute. There he worked on the development of the first Soviet missiles, advised by Germans who had been involved in the V-\n2\nrocket programme. However, now that World War II was over, Pogorelov wanted to complete his mathematical education which had been disrupted when he had been conscripted in\n1941\n, so he registered for a part-time course leading to a Candidate's degree\n(\nequivalent to a Ph.D.\n)\nat Moscow State University.\nPogorelov's interests were in geometry and his postgraduate studies at Moscow State University were jointly supervised by\nNikolai Vladimirovich Efimov\nin Moscow and\nAleksandr Danilovic Aleksandrov\nwho was based in Leningrad. Research on \"geometry in the large\" had begun in Russia when\nStefan Cohn-Vossen\n, who had worked closely with\nHilbert\n, emigrated there to escape from the Nazis. After\nCohn-Vossen\nhad died in\n1936\n,\nA D Aleksandrov\ncontinued to make substantial progress on the problems he had studied and published the important paper\nOn one class of closed surfaces\n(1938)\n. Within a year, Pogorelov had solved the problem that\nAleksandrov\nhad proposed for him. Pogorelov's work proved definitive leading to him proving that any two isometric closed convex surfaces are congruent in\n1951\n. He announced these important results, which solve all rigidity questions for closed surfaces, in\nUnique definition of general convex surfaces\n(1951)\n. His proof appeared in a\n92\n-page booklet - Busemann writes:-\n.. the proof is long and involved, but very appealing to those who like subtle, often purely geometric arguments.\nBut we have got ahead of ourselves in describing Pogorelov's career, for after the award of his Candidate's degree by Moscow State University in\n1947\n, he was appointed to the Geometry Department of Institute of Mathematics at Kharkov State University. He was awarded his doctorate\n(\nequivalent to a D.Sc. or\nhabilitation\n)\nby Kharkov State University in\n1948\nand, two years later, he was appointed to the Chair of Geometry at Kharkov University. It was Pogorelov's choice to teach at Kharkov University for he received, but rejected, offers of positions in both Leningrad State University and Moscow State University. He was head of the Geometry Department of the Institute of Mathematics of Academy of Sciences of Ukraine in\n1959\n-\n60\nand, from\n1960\nuntil\n2000\n, he headed the Geometry Department at the B Verkin Institute for Low Temperature Physics & Engineering of the Ukrainian Academy of Sciences. In the year\n2000\nPogorelov moved to Moscow where he worked at the\nSteklov\nInstitute of Mathematics.\nHis skills, as we have seen, were not confined to geometry since he had gained considerable engineering skills during his time in Moscow. He was able to combine these and produce a wide range of important contributions. The authors of\n[\n7\n]\nwrite:-\nBrilliant mathematical gifts and exceptional engineering talents have determined the broad area of scientific interests of Pogorelov, an area encompassing both theoretical and applied directions. He has solved a number of key problems in geometry in the large, in the foundations of geometry, and in the theory of the\nMonge\n-\nAmpère\nequations, and he also has obtained remarkable results in the geometric theory of stability of thin elastic shells.\nAs well as a remarkable research record, Pogorelov has written a large number of books, both monographs on specialist research topics and textbooks designed for teaching both at universities and in secondary schools. The number makes it impossible to look at anything other than a small selection of these. First we note that his textbooks are all in the general area of geometry and run to many editions. They include:\nDifferential geometry\n(1955)\n;\nLectures on analytic geometry\n(1957)\n; and\nLectures on the foundations of geometry\n(1966)\n.\nPogorelov writes in the Preface to the first of these:-\nThe author's aim is to present a rigorous discussion ... without disturbing well-established tradition. A large amount of factual material ... has been relegated to exercises and problems.\nThe last of these three textbooks has the following chapters:\n1\n. An historical sketch of the foundations of geometry.\n2\n. The modern axiomatic construction of Euclidean geometry.\n3\n. A study of the axioms of Euclidean geometry.\n4\n. Lobachevskian geometry.\nNow consider six examples from the list of over twenty monographs he has written:\nOn Monge-Ampère equations of elliptic type\n(1960)\n. We quote from the Introduction:-\nThis book presents a systematic exposition of a number of publications of\nA D Aleksandrov\nand his students, dealing with\nMonge\n-\nAmpère\nequations of elliptic type. It contains a number of new results on the setting of boundary-value problems, and on questions of uniqueness and regularity of generalized solutions.\nStrictly convex shells in supercritical deformations. I. Spherical shells\n(1965)\n. Z Kaczkowski writes in a review:-\nIn the first chapter the approximate elastic analysis of the postbuckling behaviour of a spherical shell, where the buckled region snaps into the mirror-image of itself, is discussed. ... The investigations of the second chapter have a purely geometrical nature. They concern the problem of the isometrical transformation of a spherical shell. In the third chapter the author discusses the conditions by which the deformation of a spherical shell under an axisymmetrical load remains axisymmetrical.\nGeometric methods in the nonlinear theory of elastic shells\n(1967)\n. S Drobot writes in a review:-\nThis monograph, based on the author's previous publications, gives a method of determining elastic deformations of a large class of shells in their post-critical stages. The basis for the method consists of two variational principles.\nThe extrinsic geometry of convex surfaces\n(1969)\n. The author of\n[\n17\n]\n, Yu Aminov, explains that this monograph:-\n... summarised the results of extensive scientific investigations. Even the title of the monograph stresses that it can be regarded as a continuation and development of the results presented in the monograph by\nA D Aleksandrov\n\"Intrinsic Geometry of Convex Surfaces\" published in\n1948\n. Moreover, the same title also means that the subject covered by the Pogorelov's monograph is much larger. Parallel with the method of approximation of the surfaces by polyhedra, Pogorelov significantly develops the regular theory of surfaces in the Euclidean and Riemannian spaces.\nThe Fourth Hilbert Problem\n(1975)\n. A Urban writes in a review:-\nThe booklet contains a solution of\nHilbert\n's well-known fourth problem concerning the determination of all realizations up to isomorphism of the system of axioms of classical geometries\n(\nEuclidean and non-Euclidean\n)\nsupposing that the axioms of congruency are replaced by the axiom \"triangle inequality\".\nPogorelov's solution to\nHilbert\n's Fourth Problem, which he presented to a meeting of the Kharkov Mathematical Society held at the Kharkov University, was described by I Kra as a \"mathematical jewel\"\n[\n17\n]\n:-\nThis meeting attracted a large audience formed not only by the members of the Kharkov Mathematical Society but also by students and professors of the university. The talk, highly appreciated by the mathematicians, was followed by the long discussion.\nHowever, Pogorelov looked back at this important work later and explained that there were problems\n[\n1\n]\n:-\nIn my article published in\n1973\nI have admitted some immodesty when I entitled it as \"The Complete Solution of the Fourth Hilbert Problem\". In fact, it did not contain a complete solution of the fourth problem, because only the two-dimensional case was examined. Moreover, the article contained one incorrect statement. Probably therefore Busemann originally considered my work with some scepticism. In\n1975\nI published a monograph entitled \"The Fourth Hilbert Problem,\" in which the three dimensional case was considered. After that the opinion of Busemann changed. I knew about it when Busemann was visiting Moscow because he was awarded the Lobachevsky Prize.\n6\n.\nBendings of surfaces and stability of shells\n(1986)\n. Vadim Komkov writes in a review:-\nThis is a popular exposition of the so-called \"geometric theory\" of stability of shells, mainly of axially symmetric shells.\nPogorelov received many honours for his outstanding contributions. He was awarded the Lenin Prize\n(1962)\n, the USSR State Prize\n(1950)\n, the International\nLobachevsky\nPrize of the\nUkrainian Academy of Sciences\n(1959)\n, the Ukrainian State Prize\n(1973)\n, and the Krylov Prize of the\nUkrainian Academy of Sciences\n(1988)\n. He was decorated with two Lenin orders, the order of the Red Banner of Labour, and the Diploma of Presidium of the Supreme Soviet of Ukraine. For his secondary school geometry textbook he was given the title \"Excellent Teacher of USSR\" and received the A S Makarenko medal. However, the honours given to him did not end with his death in\n2002\n. For example\n[\n17\n]\n:-\n... in May\n2004\n, the Department of Geometry at the Institute for Low-Temperature Physics and Engineering of the\nUkrainian National Academy of Sciences\n, together with the Chair of Geometry of the Kharkov National University, organized the International Seminar \"Geometry in the Large\" dedicated to the\n85\nth\nanniversary of Academician Pogorelov.\nAgain, a year later another honour was given to Pogorelov\n[\n17\n]\n:-\nOn May\n13\n,\n2005\n, the memorial plaque of Academician A V Pogorelov was unveiled during the meeting held at the Kharkov Institute for Low-Temperature Physics and Engineering of the Ukrainian National Academy of Sciences. In their speeches, Academicians\nV A Marchenko\nand V V Eremenko, A A Borisenko\n(\nCorresponding Member of the Ukrainian National Academy of Sciences\n)\n, representatives of the other institutions and Kharkov administration, Consul of Russian Federation in Kharkov, and others described the outstanding contribution made by Academician Pogorelov to various fields of science, his life, and remarkable features of his mind and character.\nLet us end this biography with the following summary of his personality from\n[\n4\n]\n:-\nPogorelov was one of the brightest representatives of the branch of geometry created by\nA D Alexandrov\n. He was peerless in his skill in overcoming difficulties in the solution of hard mathematical problems. Together with his brilliant mathematical talent and well-founded self-respect, Aleksei Vasil'evich combined modesty, friendliness, and attentiveness to his colleagues and students.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}