{
  "nome_completo": "Aleksandr Nikolaevich Korkin",
  "nome_curto": "Aleksandr Nikolaevich Korkin",
  "ano_nascimento": "1837",
  "ano_morte": "1908",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Korkin/",
  "lugar_nascimento": "Zhidovinovo, Tot'ma, Vologda, Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Aleksandr Nikolaevich Korkin\n's father, Nikolay Ivanovich Korkin, was\n[\n2\n]\n:-\n... a prosperous peasant who also engaged in trade.\nNikolay Ivanovich, as a peasant, was part of the system of serfdom which operated in Russia at this time. He was a serf, owned by the local Vologda province, and as such he and his family had to work for Vologda. Later, in\n1861\n, the serfs were emancipated by Alexander II but, although many argued for the abolition of serfdom as Aleksandr Nikolaevich was growing up, it was at that time a problem with which his father had to cope.\nAleksandr Nikolaevich was three years old when his father moved to Shuiskoye, about six kilometres from the village in which he was the boy was born. This town, in northwest Russia, is about\n700\nkm due east of St Petersburg. When Korkin was eight years old his father sent him to he educated in the house of the grammar school teacher Aleksandr Ivanovich Ivanitski in Vologda, the provincial capital. Ivanitski was a former student of\nBunyakovsky\nand as well as being a fine mathematician was also an outstanding teacher. Ivanitski's wife was also a talented teacher and from her the young Korkin learnt to speak French and German. After two years of study with the Ivanitskis, Korkin's father wanted his son to begin his studies at the local\ngymnasium\nbut before this could happen he had to pay the Vologda province to release his son from serfdom to allow him to be educated. Korkin entered Vologda Gymnasium in\n1847\n.\nWhen Korkin was twelve years old his father lost what money he had and died shortly afterwards. Korkin continued to study at the Gymnasium showing remarkable abilities. He completed his studies in\n1853\nat the age of sixteen and was awarded the Gold Medal by the Gymnasium but, although he was now very well qualified to enter university he was too young. He went instead to the Demidov Lycée but after a very short period decided to return home to Shuiskoye and wait until he was allowed university entry. In\n1854\nhe entered the Physics and Mathematics faculty of St Petersburg University where he was taught by\nBunyakovsky\n,\nSomov\nand\nChebyshev\n. In particular he took courses on analytic geometry, higher algebra and\nnumber theory\ngiven by\nChebyshev\n.\nLife as an undergraduate was hard for Korkin. His father had died having lost his money and Korkin had to survive with hardly enough money for food. He was forced to earn extra by undertaking private tuition. He submitted an essay to the Faculty of St Petersburg in\n1856\non the set topic\nOn greatest and least quantities\nwhich investigated properties of local extrema of both explicitly and implicitly defined differentiable functions of one or severable variables. Korkin also discussed problems on the calculus of variation in his essay.\nBunyakovsky\njudged the student submissions and awarded Korkin the Gold Medal, recommending that the essay be published in\nThe Student Anthology\nwhich happened in the following year.\nKorkin graduated in\n1858\n, qualifying to teach mathematics. He had to pay further sums to Vologda province to release himself from serfdom before being allowed to begin his teaching career at the First Cadet School. He taught there until\n1861\nand during this time he took his Master's examinations at St Petersburg and undertook research under\nChebyshev\nfor his Master's thesis\n(\nequivalent in standard to a Ph.D.\n)\n. He submitted\nOn Determining Arbitrary Functions in Integrals of Linear Partial Differential Equations\nwhich he defended on\n11\nDecember\n1860\n. In\n1861\n, when a position at the university became vacant, he took part in the resulting competition and was successful. At this time he left the First Cadet School and taught trigonometry, analytic geometry and integral calculus at the University.\nAlexander II became the new tsar in\n1855\nand began to work towards abolishing serfdom, saying:-\n... it is better to abolish serfdom from above than to wait until the serfs begin to liberate themselves from below.\nSerfdom was abolished in\n1861\nbut on terms which were neither favourable to peasants nor to landowners. It was a settlement which bitterly disappointed by many peasants as well as many radical intellectuals. In\n1861\nand\n1862\nrevolutionary leaflets were distributed in St Petersburg, ranging from the demand for a constituent assembly to a passionate appeal for insurrection. There was student unrest and St Petersburg University was closed. Korkin was sent abroad to prepare for becoming a professor.\nKorkin attended lectures by\nLiouville\n,\nLamé\nand\nBertrand\nin Paris, returned briefly to Russia in May\n1863\n, then went to Germany where he attended lectures by\nKummer\n,\nWeierstrass\nand others in Berlin. On the Paris visit he was particularly interested in\nBertrand\n's lectures on partial differential equations and in Germany\nKummer\n's lectures on quadratic forms fascinated him. During this time he worked on his doctoral thesis\n(\nequivalent in standard to the German\nhabilitation\n)\nand he returned to his teaching role in St Petersburg in September\n1864\n. In addition to teaching at the University, he also began teaching calculus at the Nikolaevskaya Naval Academy. He defended his thesis\nOn systems of first order partial differential equations and some questions on mechanics\ntowards the end of\n1867\n. His examiners were\nSomov\nand\nChebyshev\n.\nIn May\n1868\nKorkin was appointed by the Council of St Petersburg University as an extraordinary professor in the Department of Mathematics. He continued to lecture at the university until the year of his death\n1908\n, and he continued to teach calculus at the Naval Academy until\n1900\n.\nAleksei Nikolaevich Krylov\nwas taught by Korkin at the Naval Academy, graduating in\n1890\n, and took over Korkin's lecturing position there in\n1900\n. At the university he was promoted to ordinary professor in\n1873\n.\nKorkin's mathematical expertise was extremely broad within both pure mathematics and mathematical physics. He had read, and with his wonderful memory could then recall, most works by\nAbel\n,\nDirichlet\n,\nEuler\n,\nFourier\n,\nGauss\n,\nJacobi\n,\nLagrange\n,\nLaplace\n,\nLegendre\n,\nMonge\n, and\nPoisson\n. One of Korkin's major contributions was to the development of partial differential equations. However, the interest he had developed in quadratic forms when attending\nKummer\n's lectures in Berlin led him to write three important papers on the topic in collaboration with\nZolotarev\n. Initially Korkin was unimpressed with\nZolotarev\n's investigation of an indeterminate equation of degree three which he presented in his Master' thesis. Korkin wrote a critical report on the thesis. However soon the two were collaborating and produced three paper in\n1872\n,\n1873\nand\n1877\n.\nHermite\n, whom Korkin greatly admired, had studied the minimum value of a quadratic form as a function of its coefficients. He had given an upper bound for the minimum of an\nn\nn\nn\n-ary form of fixed given determinant and made a conjecture for a better upper bound. Korkin and\nZolotarev\nwrite in their first joint paper:-\nThe search for the exact upper bound of the minima of positive definite quadratic forms of given\ndeterminant\nin integer-valued variables, presents great difficulties and constitutes one of the most important problems in the theory of such forms. In this note we will be concerned with quaternary forms, and as the first result of our research derive an exact upper estimate for their minima.\nTheir result showed that\nHermite\n's conjectured bound was incorrect. In their next major paper on the topic in\n1873\nthey defined extremal positive definite quadratic forms to be those minimum decreases for any perturbation of the coefficients which leaves the determinant invariant. They continue their work of finding upper bound's for positive definite quadratic forms. In their\n1876\npaper they write:-\n... we propose expounding in the present memoir certain fundamental properties of\n[\nextremal positive definite quadratic forms\n]\n, as well as exhibiting all extremal binary, ternary, quaternary, and quinary forms.\nWhen\nDelone\nbecame Korkin's student in the\n1890\ns,\nKorkin\nwas interested in cartographic projections and it was on that topic that he directed\nDelone\n's dissertation of\n1896\n.\nDelone\nwrites in\n[\n2\n]\n:-\nKorkin's lecturing style was one of supreme simplicity and clarity. He explained each and every result by means of examples, and went minutely through the steps of each argument. After each lecture he would dictate examples as homework exercises. Taking notes from his lectures was easy; however, later on in his career Korkin came to the conclusion that he should dictate his lectures, attributed to his lack of faith in his hearers' ability to write them down well enough. Those attending his lectures usually mastered the subject-matter very thoroughly, and passed the examination with flying colours.\nThrough his ability to draw on a broad knowledge of various branches of mathematics, Korkin often set very difficult problems; these he proposed to the best of his students. When he observed exceptional ability in a student, he would often take him under his wing and help him in his studies. Almost till the end of his life his home was always open on \"Korkin Saturdays\", as they came to be called, to anyone wanting advice, or to talk mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}