{
  "nome_completo": "Aleksandr Mikhailovich Lyapunov",
  "nome_curto": "Aleksandr Mikhailovich Lyapunov",
  "ano_nascimento": "1857",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lyapunov/",
  "lugar_nascimento": "Yaroslavl, Russia",
  "lugar_morte": "Odessa, Russia",
  "biografia": "Aleksandr Mikhailovich Lyapunov\n's mother was Sofia Aleksandrovna Shilipova and his father was Mikhail Vasilievich Lyapunov. Mikhail Vasilievich was an astronomer who worked at Kazan University until two years before Aleksandr Mikhailovich was born, when the family moved to Yaroslavl on his appointment as director of the Demidovski Lyceum there. Sofia Aleksandrovna and Mikhail Vasilievich had talented children for, in addition to the subject of this biography, they had two boys one of whom\n(\nSergei\n)\nbecame a composer and the other\n(\nBoris\n)\nbecame a member of the Soviet Academy of Sciences through his expertise in Slavic languages.\nAleksandr Mikhailovich began his education at home, then later one of his uncles R M Sechenov prepared him for entering the\nGymnasium\n. Lyapunov was not the only one being coached by Sechenov who was teaching his own daughter Natalia Rafailovna Sechenov at the same time. In fact Natalia and Aleksandr married many years later when he was\n29\nyears old. Some years after the death of Lyapunov's father, Sofia Aleksandrovna moved to Nizhny Novgorod\n(\nnamed Gorky from\n1932\nto\n1990)\nin\n1870\nwith her children and Lyapunov entered the\nGymnasium\nin that city. He graduated in\n1876\nand entered the Faculty of Physics and Mathematics at St Petersburg University, where he became friends with\nMarkov\n.\nAt St Petersburg University he was taught by\nChebyshev\nwho, as we shall see below, had a strong influence on him. Lyapunov graduated in\n1880\nand remained at St Petersburg to undertake research. He published two papers on hydrostatics in\n1881\n:\nOn the equilibrium of heavy bodies in heavy liquids contained in a vessel of a certain shape\n, and\nOn the potential of hydrostatic pressures\n. In the following year\nChebyshev\nposed a question to Lyapunov which would set the agenda for one of his main lines of research over many years:-\nIt is known that at a certain angular velocity ellipsoidal forms cease to be the forms of equilibrium of a rotating liquid. In this case, do they not shift into some new forms of equilibrium which differ little from ellipsoids for small increases in the angular velocity?\nAlthough Lyapunov's Master's thesis did not answer this question, the work of the thesis was motivated by it. He presented the thesis\nOn the stability of ellipsoidal forms of equilibrium of a rotating liquid\nin\n1884\nand defended it at St Petersburg University in the following year. Following this he was appointed as a\nprivatdozent\nat Kharkov University where he taught mechanics and continued research for his doctoral thesis. He presented his doctoral thesis\nThe general problem of the stability of motion\nto the University of Moscow and was awarded his doctorate after defending the thesis on\n12\nOctober\n1892\n(\naccording to the modern calendar\n)\n. The importance of this thesis is emphasised in several articles such as\n[\n8\n]\n,\n[\n12\n]\n,\n[\n16\n]\nwhich were all written to celebrate the centenary of the publication of this fundamental contribution.\nIn the following year he was appointed as a professor at Kharkov University where he remained until\n1902\n. While at Kharkov University he played a major role in the\nKharkov Mathematical Society\n, being its vice-president from\n1891\nto\n1898\nand president from\n1899\nuntil he left Kharkov in\n1902\n. He also edited the\nCommunications of the Kharkov Mathematical Society\n.\nIn\n[\n13\n]\nPavlovskaya looks at Lyapunov's work on the problem first posed by\nChebyshev\nwhich we quoted above. The problem posed by\nChebyshev\nconcerning the existence of figures of equilibrium, in addition to ellipsoidal ones, of a rotating fluid under sufficiently small variations of angular velocity of revolution was first solved by Lyapunov in a first approximation. He later dealt with the problem of stability of fluid ellipsoids basing his investigations on the\nThomson\n-\nTait\nvariational principle. He showed that a sufficient condition for stability is that the second and higher variations of the potential energy are positive. Lyapunov admitted that the imposition of certain additional constraints on the first variation reduced the generality of his method, but writes:-\nBut in this respect hardly any other method of investigation could be said to be completely satisfactory.\nLyapunov established that with variation in the angular velocity of revolution\nMaclaurin\nellipsoids pass into\nJacobi\nellipsoids. The transition point is an ellipsoid of bifurcation corresponding in this case to a\nJacobi\nellipsoid of revolution.\nIn\n1901\nLyapunov was elected to the\nRussian Academy of Sciences\nin St Petersburg and in the following year became an academician in applied mathematics of the Academy. Grigorian writes\n[\n1\n]\n:-\nIn St Petersburg, Lyapunov devoted himself completely to scientific work. He returned to the problem that\nChebyshev\nhad placed before him and, in an extensive series of papers which continued until his death, developed the theory of figures of equilibrium of rotating heavy liquids.\nIn\n1917\nLyapunov left St Petersburg to take up a post at the university in Odessa, on the Black Sea coast. He taught at the university but in the spring of\n1918\nhis wife's health began to deteriorate rapidly. Natalia Rafailovna suffered from a form of tuberculosis and Lyapunov was greatly disturbed to watch her health fail. On\n31\nOctober\n1918\nLyapunov's wife died and later that day Lyapunov shot himself. He died three days later in hospital.\nWe have described Lyapunov's main work which was on the theory of rotating liquids. There are, however, other aspects of his work we should mention. One is certainly his contributions to\nprobability\nwhich he became interested in because of courses he was teaching on that subject. In particular in two papers published in\n1900\nand\n1901\n, he proved the central limit theorem using a technique based on characteristic functions. Another contribution which we should mention is that as editor for two volumes of Euler's collected works.\nHe was honoured for his outstanding contributions by election to various academies such as the\nAccademia dei Lincei\n(1909)\nand the French\nAcademy of Sciences\n(1916)\n. He was also given honorary membership of the universities of St Petersburg, Kharkov and Kazan. Various tributes were paid to him on the centenary of his birth. For example on\n6\nJune\n1957\nSobolev\ngave the lecture\nOn the works of A M Lyapunov on potential theory\nin Moscow to a joint session of the Presidium of the Academy of Sciences, the divisions of technical and physical sciences of the Academy of Sciences, the Moscow University, the\nMoscow Mathematical Society\n, the Institute of Mechanics of the Academy of Sciences, and the Institute of Automatics and Telemechanics of the Academy of Sciences. The text of this lecture is given in\n[\n22\n]\n.\nOther papers such as\n[\n8\n]\ndescribe the way that Lyapunov's contributions to the stability of motion has influenced the development of the subject over a long period of time. Topics considered in\n[\n8\n]\ninclude: stability, particularly the stability of critical points; the construction and the application of the Lyapunov function; stability of functional-\ndifferential equations\n; the second Lyapunov method; and the method of the Lyapunov vector function in stability theory and nonlinear analysis.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Statistics"
  ]
}