{
  "nome_completo": "Aleksandr Yakovlevich Khinchin",
  "nome_curto": "Aleksandr Yakovlevich Khinchin",
  "ano_nascimento": "1894",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Khinchin/",
  "lugar_nascimento": "Kondrovo, Kaluzhskaya guberniya, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Aleksandr Yakovlevich Khinchin\n's father was an engineer. Khinchin attended the technical high school in Moscow where he became fascinated by mathematics. However mathematics was certainly not his only interest when he was at secondary school for he also had a passionate love of poetry and of the theatre. He completed his secondary education in\n1911\nand entered the Faculty of Physics and Mathematics of Moscow University in that year.\nAt university in Moscow Khinchin worked with\nLuzin\nand others. He was an outstanding student being particularly interested in the metric theory of functions and before he graduated in\n1916\nhe had already written his first paper on a generalisation of the\nDenjoy\nintegral. This first paper began a series of publications by Khinchin on properties of functions which are retained after deleting a set of density zero at a given point. He summarised his contributions to this area with the paper\nRecherches sur la structure des fonctions mesurables\nⓉ\n(\nResearch on the structure of measurable functions\n)\nin\nFundamanta mathematica\nin\n1927\n.\nAfter graduating in\n1916\n, Khinchin remained at Moscow University undertaking research for his dissertation which would allow him to become a university teacher. After a couple of years he began teaching in a number of different colleges both in Moscow and Ivanovo. The town of Ivanovo, east of Moscow, was a centre for the textile industry and it plays a surprisingly important part in the development of Russian mathematics with several of the major figures teaching in the town.\nAround\n1922\nKhinchin took up new mathematical interests when he began to study the\ntheory of numbers\nand\nprobability theory\n. In the following year he strengthened results of\nHardy\nand\nLittlewood\nwith his introduction of the iterated logarithm published in\nMathematische Zeitschrift\n. With these ideas he also strengthened the law of large numbers due to\nBorel\n.\nIn\n1927\nKhinchin was appointed as a professor at Moscow University and, in the same year, he published\nBasic laws of probability theory\n. Between\n1932\nand\n1934\nhe laid the foundations for the theory of stationary random processes culminating in a major paper in\nMathematische Annalen\nin\n1934\n. Khinchin left Moscow in\n1935\nto spend two years at Saratov University but returned to Moscow University in\n1937\nto continue his role of building the school of probability theory there in partnership with\nKolmogorov\nand others, including in particular their student\nGnedenko\n. From the\n1940\ns his work changed direction again and this time he became interested in the theory of statistical mechanics. In the last few years of his life his interests turned to developing\nShannon\n's ideas on information theory.\nWe shall look at some of Khinchin's major publications and in this way get a feel for the large number of important contributions he made in a remarkably large range of topics. Some of these publications we have already mentioned in the brief description of his career which we gave above.\nKhinchin first published the book\nContinued Fractions\nin\n1936\nwith a second edition being published in\n1949\n. The book consists of three chapters, the first two of which present the classical theory of\ncontinued fractions\n. The third chapter, the longest and most important, contains an account of Khinchin's own contributions to the topic of the metrical theory of Diophantine approximations. Another contribution by Khinchin to number theory is the short book\nThree pearls of number theory\nwhich appeared in an English translation in\n1952\n.\nThe book\nEight lectures on mathematical analysis\nby Khinchin ran to several editions. It was first published in\n1943\nand the eight lectures it contains are: Continuum; Limits; Functions; Series; Derivative; Integral; Series expansions of functions; and Differential equations. The book was designed to be used to supplement a standard course on the calculus and gives a careful treatment of some of the basic notions of mathematical analysis. Ivanov, reviewing the fourth edition, wrote:-\nThe presentation is smooth, elegant and interesting and makes very enjoyable reading ...\nKhinchin published\nMathematical Principles of Statistical Mechanics\nin\n1943\n. It showed how to make classical statistical mechanics into a mathematically rigorous subject, developing a consistent presentation of the topic. In\n1951\nhe extended the work of this\n1943\nbook when he published\nMathematical foundations of quantum statistics\n. This new publication on the topic appeared in a German translation in\n1956\nand then in an English translation in\n1960\n. The book was written in such a way as to be useful both to mathematicians who wanted to become better acquainted with some applications of analysis to physics, and also to physicists who wanted to understand more about the mathematical foundations for their subject. Topics covered included: local limit theorems for sums of identically distributed random variables; the foundations of quantum mechanics; general principles of quantum statistics; the foundations of the statistics of photons; entropy; and the second law of thermodynamics. The book has been rated as being equal in quality to\nvon Neumann\n's masterpiece\nMathematical foundations of quantum mechanics\n.\nKhinchin's book\nMathematical Foundations of Information Theory\n, translated into English from the original Russian in\n1957\n, is important. It consists of English translations of two articles:\nThe entropy concept in probability theory\nand\nOn the basic theorems of information theory\nwhich were both published earlier in Russian. The second of these articles provides a refinement of\nShannon\n's concepts of the capacity of a noisy channel and the entropy of a source. Khinchin generalised some of\nShannon\n's results in this book which was written in an elementary style yet gave a comprehensive account with full details of all the results.\nIn\n[\n6\n]\nGnedenko\n, who was a student of Khinchin, lists\n151\npublications by Khinchin on the mathematical theory of probability\n(\nthe list is given again in\n[\n4\n]\n)\n.\nAmong the many honours which Khinchin received for his work was election to the\nUSSR Academy of Sciences\nin\n1939\nand the award of a State Prize for scientific achievements in the following year.\nVere-Jones writes\n[\n9\n]\n:-\nKhinchin was a fascinating figure ..., not least because of his early enthusiasms for poetry and acting, and his links with such figures of the revolution as the poet Mayakovsky and members of the Moscow Arts Theatre.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}