{
  "nome_completo": "Aleksandr Ivanovich Nekrasov",
  "nome_curto": "Aleksandr Nekrasov",
  "ano_nascimento": "1883",
  "ano_morte": "1957",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nekrasov/",
  "lugar_nascimento": "Moscow, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Aleksandr Nekrasov\nwas educated in Moscow, attending the Fifth Moscow\nGymnasium\n. His work at the school was outstanding and he was awarded the gold medal in\n1901\n. In that year he entered the Faculty of Physics and Mathematics at Moscow University.\nHe graduated from the University of Moscow in\n1906\n, receiving a first class diploma. He was awarded a gold medal for his essay on the\nTheory of the Satellites of Jupiter\n. At this stage he decided to aim at an academic appointment so he began working for his Master's Degree. However, to finance his studies he took a post as a secondary school teacher, working in several different schools in Moscow.\nIn fact Nekrasov worked for a Master's degree in both astronomy and mechanics and he qualified for these in\n1909\nand\n1911\n. Appointed an assistant professor in the Department of Astronomy and Geodesy in\n1912\n, he became an assistant professor in the Department of Theoretical Mechanics in the following year. He taught and undertook research in Moscow for the rest of his life but he did this at a number of different institutions. In addition to Moscow University he worked at the Higher Technical School, the Central Aerohydrodynamics Institute, the Sergo Orjonikidze Aviation Institute, and the Institute of Mechanics at the\nUSSR Academy of Sciences\n.\nThe two scientists who most influenced Nekrasov most were\nZhukovsky\nand\nChaplygin\n.\nZhukovsky\nhad founded the Russian schools of hydromechanics and aeromechanics. He was known as the Father of Russian Aviation.\nChaplygin\n, a student of\nZhukovsky\n, wrote first on hydrodynamics under\nZhukovsky\n's influence, in particular he worked on the mechanics of liquids and gases studying jet stream flow in the\n1890\ns.\nZhukovsky\nand\nChaplygin\nset up the Central Aerohydrodynamic Institute in\n1918\nwhere Nekrasov worked. After\nZhukovsky\ndied in\n1921\nChaplygin\nand Nekrasov continued to build on the foundations which he had put in place. As Grigorian writes in\n[\n1\n]\n:-\nA fully worthy disciple of and successor to Zhukovsky, Nekrasov enriched Soviet science with his scientific works ...\nNekrasov published important work on the theory of waves, the theory of whirlpools, the theory of jet streams and gas dynamics. He also investigated mathematical questions which were related to these applications, in particular writing important works on non-linear\nintegral equations\n. In fact his deep understanding of mathematical analysis as developed by mathematicians such as\nGoursat\nenabled him to succeed in solving a whole range of concrete problems. Grigorian writes in\n[\n1\n]\nthat:-\nNekrasov was a brilliant representative of the trend in the development of precise mathematical methods in hydromechanics and aeromechanics...\nHe was awarded the N E\nZhukovsky\nPrize in\n1922\nfor his work\nOn smooth-form waves on the surface of a heavy liquid\n. He was the author of an excellent two volume text on vector mechanics, the first volume being published in\n1945\nwith the second in the following year. In\n1947\nhe published a monograph on aerodynamics which set out the basic theory in a systematic way. In the same year another important work on the applications of integral equations to aerodynamics was published.\nSeveral other works by Nekrasov were awarded prizes. He won the State Prize of the U.S.S.R. in\n1951\nfor mainstream work on solving problems in hydromechanics. Elected to the\nUSSR Academy of Sciences\nin\n1932\nhe was also given the title of Honoured Worker in Science and Technology in\n1947\n.",
  "math_areas": [
    "Analysis"
  ]
}