{
  "nome_completo": "Alexander Macfarlane",
  "nome_curto": "Alexander Macfarlane",
  "ano_nascimento": "1851",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macfarlane/",
  "lugar_nascimento": "Blairgowrie, Scotland",
  "lugar_morte": "Chatham, Ontario, Canada",
  "biografia": "Alexander Macfarlane\nwas the son of Daniel Macfarlane and Ann Small. Daniel Macfarlane, the fourth of his parents' six children, was born on\n29\nNovember\n1811\nat Little Dunkeld, Perthshire, Scotland, the son of Alexander Macfarlane and Jeanette Small. Daniel, who was a shoemaker in Blairgowrie, married Ann Small on\n23\nJanuary\n1841\nat Rattray, Perthshire, Scotland. Ann was the daughter of Peter Small and Barbara MacDonald. We believe that Alexander Macfarlane, the subject of this biography, was Daniel and Ann's only child.\nAlexander was educated at the James Street Free Church school at Blairgowrie where he showed such outstanding abilities that, at the age of thirteen, he was employed as a pupil-teacher. In this capacity he was still a student at the school but he also taught classes for which he was paid. This was important for there is no way that his parents would have been able to finance his university studies, but he was able to save his earnings from the school so that at the age of eighteen, in\n1869\n, he matriculated at the University of Edinburgh.\nAt the University of Edinburgh there was a standard course in Greek, Latin, Mathematics and Philosophy but, after studying this course, students going on to honours would choose the topic in which to specialise. In his first year his performance in Greek and Latin was excellent, being ranked fifth in Greek and fourth in Latin. This may not sound so remarkable but one has to realise that the classes had over\n200\nstudents most of whom had come through high schools with much higher academic standards than the Free School he attended. He now took a bold decision. To fund his studies he would either have to earn money teaching or win scholarships and prizes; he chose the latter. He competed for scholarships at the start of his second year and was awarded a Miller Scholarship which supported his studies through that year.\nA very successful year in studying Greek, Latin and Mathematics, saw Macfarlane compete in the scholarships at the beginning of his third year and was awarded the prestigious Spence Scholarship. Despite pressure from his lecturers in classics, who wanted him to specialise in this topic, he studied Senior Mathematics, Natural Philosophy\n(\nPhysics\n)\n, and Logic. At this time\nPhilip Kelland\nwas the Professor of Mathematics, having held this chair since\n1838\n, while the Professor of Natural Philosophy was\nPeter Guthrie Tait\nwho had been appointed in\n1860\nto replace James David Forbes who had moved to St Andrews University to become Principal of the University. Macfarlane took\nKelland\n's course which introduced his students to the quaternions. Macfarlane purchased\nTait\n's\nTreatise on Quaternions\nbelieving that since\nTait\nwas Professor of Natural Philosophy, the book would be addressed to physicists but found that\nTait\napproached the topic in a very mathematical way.\nJohn Stevenson\n(1695\n-\n1775)\nwas Professor of Logic and Metaphysics at Edinburgh University and he invited Macfarlane to present a paper criticising the statement of the law of the excluded middle given by\nWilliam Stanley Jevons\nin his book\nElementary Lessons on Logic\n(1870)\n. Macfarlane had been intending to take honours in logic but this experience made him realise that he needed a solid background in mathematics and science. He took further advanced classes on mathematics and physics.\nTait\nwas very impressed by his student's work in experimental physics and, in\n1874\n, Macfarlane was awarded the Neil Arnott scholarship for Experimental Physics. This scholarship was funded by a gift of £\n2000\nthat Neil Arnott\n(1788\n-\n1874)\nhad given to the University of Edinburgh to promote the study of experimental physics:-\nThe recipient must, during the ensuing Summer and Winter Sessions assist the Professor of Natural Philosophy in the Laboratory.\nWe note that Arnott made similar bequests to each of the four Scottish universities.\nIn\n1875\nMacfarlane graduated with an M.A. with First Class Honours in Mathematics and Physics. He had taken a remarkably number of different subjects in his undergraduate studies, having passes with distinction in seven subjects at ordinary degree level. He continued competing for scholarships and was awarded a Charles Maclaren scholarship, founded in\n1871\n, to allow him to continuing to study for his doctorate. His first two publications appeared in\n1875\n, published in the\nProceedings\nof the\nRoyal Society of Edinburgh\n. The first was\nOn the Application of Angström's Method to the Conductivity of Wood\n(1875)\n, a joint paper with\nCargill Knott\nwhich had the following extract:-\nThis was an account of a series of experiments made in the Natural Philosophy Laboratory of the University, to test the applicability of Angström's method of periodic variations of temperature to the determination of low conductivity. The wood was cut into discs of a standard thickness, and these were very tightly secured together, after the interposition of copper-iron thermo-electric junctions\n(\nof very fine wire\n)\n. One series of discs was cut parallel, the other perpendicular, to the fibre. The results were obtained very easily, and accorded satisfactorily with those obtained by more laborious methods.\nIt was followed in the same year by a paper, jointly authored by Macfarlane,\nKnott\nand Charles Michie Smith\n(1854\n-\n1922)\n(\nknown as Michie\n)\n, entitled\nOn the Electric Resistance of Iron at a High Temperature\n. Here is an extract from the Introduction:-\nThe following paper is a continuation of a former brief one, communicated to the Society, and printed in the Proceedings, on the change of electric resistance of iron due to change of temperature. In a note appended to Professor\nTait\n's paper on a \"First Approximation to a Thermo-electric Diagram,\" attention was drawn to the curious phenomenon observed by Gore, that at a temperature about dull red heat, iron wire undergoes sudden changes in length, and also to the further discovery by Professor Barrett, that if the wire be cooling, a sudden reglow occurs simultaneously with these changes. These phenomena seemed to be connected with other known physical changes which take place in iron at this critical temperature, such as the loss of its magnetic properties, the remarkable bend of the iron line in the thermo-electric diagram, and the interesting alteration in the rate of change of electric resistance with respect to change of temperature, observable in iron at the same dull red heat.\nMacfarlane was awarded a D.Sc. on\n23\nApril\n1878\nfor his thesis\nOn the Disruptive Discharge of Electricity\nwhich was published in the\nTransactions\nof the\nRoyal Society of Edinburgh\n. He writes:-\nThe experiments to which I shall refer were carried out in the physical laboratory of the University during the late summer session. I was ably assisted in conducting the experiments by three students of the laboratory, - Messrs H A Salvesen, G M Connor, and D E Stewart. The method which was used of measuring the difference of potential required to produce a disruptive discharge of electricity under given conditions, is that described in a paper communicated to the\nRoyal Society of Edinburgh\nin\n1876\nin the names of Mr J A Paton, M.A., and myself, and was suggested to me by Professor\nTait\nas a means of attacking the experimental problems ...\nThis was one of six papers Macfarlane published in\n1878\n, all in the\nProceedings\nor the\nTransactions\nof the\nRoyal Society of Edinburgh\n. We note that by this time Macfarlane had both an M.A. and a B.Sc. In the same year, on\n6\nMay, he was elected a fellow of the\nRoyal Society of Edinburgh\n. He was proposed by\nPeter Guthrie Tait\n,\nPhilip Kelland\n, Alexander Crum Brown and John Hutton Balfour. We note that Alexander Crum Brown was the Professor of Chemistry at Edinburgh, while John Hutton Balfour was the Professor of Botany.\nIn\n1880\nMacfarlane was appointed as temporary professor of physics at the University of St Andrews, a position he held for a year. He published\nPositive and Negative Electric Discharge between a Point and a Plate and between a Ball and a Plate\n(1880)\ndescribing experiments he had carried out while in St Andrews:-\nI have made the following observations in the Natural Philosophy classroom of the United College, St Andrews, with the view of ascertaining whether the electromotive force required to cause a spark to pass between a small globe and a plate, or between a point and a plate, differs for the two kinds of electricity. Sir\nWilliam Thomson\nsuggested that I should apply to this question the method of measuring the electromotive force required to produce sparks, which I have described in papers already contributed to the\nRoyal Society of Edinburgh\n. It is a problem to which\nFaraday\nattached great importance. He says in his 'Experimental Researches in Electricity': \"The results connected with the different conditions of positive and negative discharge will have a far greater influence on the philosophy of electrical science than we at present imagine, especially if, as I believe, they depend on the peculiarity and degree of polarised condition which the molecules of the dielectrics concerned acquire.\"\nIn\n1881\nhe was appointed as an Examiner in Mathematics at the University of Edinburgh for three years. We give examples of four papers he set for the\n1881\n-\n82\ndiet at\nTHIS LINK\n.\nWhile working as an examiners at the University of Edinburgh, he published his first book, namely\nPhysical Arithmetic\n(1885)\n. You can read an extract from the Preface at\nTHIS LINK\n.\nAt the beginning of his time as an examiner, he continued to publish papers on experimental work, for example\nThe electric discharge through colza oil\n(1881)\nand\nThe effect of moisture on the electric discharge\n(1882)\n. His interest then turned more towards mathematics and logic and his next publications included\nAn analysis of relationships\n(1881)\n,\nAlgebra of relationship\n(1882)\n,\nAnalysis of relationships of consanguinity and affinity\n(1883)\n,\nNote on plane algebra\n(1884)\n, and\nThe logical spectrum\n(1885)\n.\nIn\n1885\nMacfarlane was appointed to the chair of physics at the University of Texas in Austin, Texas, United States. This university had only opened in\n1883\nand\nGeorge Halsted\nhad been appointed to the Department of Pure and Applied Mathematics in\n1884\n. In fact Macfarlane's appointment came through his correspondence with\nHalsted\non the algebra of logic. His first year at Austin was spent in setting up the new department, but soon he was publishing again. His second book,\nElementary Mathematical Tables\n(1889)\nwas basically a sequel to his first. You can read the Preface at\nTHIS LINK\n.\nHis papers around this time include\nApplication of the method of the logical spectrum to Boole's problem\n(1890)\n,\nPrinciples of the Algebra of Physics\n(1891)\n, and\nOn exact analysis as the basis of language\n(1892)\n. The\n1891\npaper was read to the American Association for the Advancement of Science at its meeting of\n21\nAugust\n1891\n. It begins:-\nIn the preface to the new edition of the 'Treatise on Quaternions' Professor\nTait\nsays, \"It is disappointing to find how little progress has recently been made with the development of Quaternions, One cause, which has been specially active in France, is that workers at the subject have been more intent on modifying the notation, or the mode of presentation of the fundamental principles, than on extending the applications of the Calculus.\" At the end of the preface he quotes a few words from a letter which he received long ago from\nHamilton\n- \"Could anything be simpler or more satisfactory? Don't you feel, as well as think, that we are on the right track, and shall be thanked? Never mind when.\" I had the high privilege of studying under Professor\nTait\n, and know well his single-minded devotion to exact science. I have always felt that Quaternions is on the right track, and that\nHamilton\nand\nTait\ndeserve and will receive more and more as time goes on thanks of the highest order. But at the same time I am convinced that the notation can be improved; that the principles require to be corrected and extended; that there is a more complete algebra which unifies Quaternions,\nGrassmann\n's method and Determinants, and applies to physical quantities in space. The guiding idea in this paper is generalisation. What is sought for is an algebra which will apply directly to physical quantities, will include and unify the several branches of analysis, and when specialised will become ordinary algebra. That the time is opportune for a discussion of this problem is shown by recent discussion between Professors\nTait\nand\nGibbs\nin the columns of 'Nature' on the merits of Quaternions, vector Analysis, and\nGrassmann\n's method; and also by the discussion in the same journal of the meaning of algebraic symbols in applied mathematics.\nMacfarlane read the paper\nOn the definitions of the trigonometric functions\nto the International Mathematical Congress in Chicago in August\n1893\n. His paper begins:-\nIn a paper on 'The Principles of the Algebra of Physics' I introduced a trigonometric notation for the partial products of two vectors, writing AB = cos AB + Sin AB, where cos AB denotes the positive scalar product, and Sin AB the directed vector product. To denote the magnitude of the vector product I used the notation sin AB without a capital: it is not the exact equivalent of the tensor, because the magnitude may be positive or negative. With the additional device of using the Greek letters to denote axes, it is possible to dispense with the peculiar symbols introduced into analysis by\nHamilton\nand the space-analysis then assumes to a large extent the more familiar features of the ordinary analysis. The notation raises the question of the relation of space-analysis to trigonometry. If cos and sin are correct appellations of the products mentioned, are there products of two vectors which are correctly designated by tan, sec, cotan, cosec? At p.\n87\nof the Principles I give a brief answer to this question; but a complete answer called for a more thorough investigation than I had then time to make. This trigonometrical notation has been briefly discussed by Mr\nHeaviside\n(\n'The Electrician',\n9\nDecember\n1892)\n. He takes the position that vector algebra is far more simple and fundamental than trigonometry, and that it is a mistake to base vectorial notation upon that of a special application thereof of a more complicated nature. I believe that this paper will show that trigonometry is not an application of space-analysis, but an element of it; and that the ideas of this element are of the greatest importance in developing the higher elements of the analysis.\nIn\n1894\n, Macfarlane resigned his chair of physics at the University of Texas. On\n8\nApril\n1895\nhe married Helen Martha Swearingen\n(1870\n-\n1927)\nat Bexar, Texas. Helen had been born on\n18\nOctober\n1870\nin Washington County, Texas to Patrick Henry Swearingen\n(1834\n-\n1880)\n, a lawyer and soldier, and Mary Eliza Toland\n(1843\n-\n1911)\n. Helen's sister, Margaret Swearingen\n(\nborn\n1862\nand known as Maggie\n)\n, had married\nGeorge Halsted\nin\n1868\n. Alexander and Helen Macfarlane had five children: Alexander Swearingen Macfarlane\n(1896\n-\n1918)\n; Robert Harper Kirby Macfarlane\n(1901\n-\n1980)\n; Henry Swearingen Macfarlane\n(1903\n-\n1907)\n, James Donald Macfarlane\n(1906\n-\n1929)\n, and Margaretta Macfarlane\n(1909\n-\n1909)\n. Notice the sad fact the only one of the five children lived beyond the age of\n23\n; Alexander Swearingen Macfarlane was killed in action in France during World War I.\nLehigh University in Bethlehem, Pennsylvania, was founded in\n1865\n. It established in\n1883\na one-year programme of advanced study in Electrical Engineering run by Hugh Wilson Harding, previously a Professor of Physics and Mechanics. In September\n1888\n, a full\n4\n-year course was set up leading to a degree in Electrical Engineering. Macfarlane was appointed to Mathematical Physics and organised the programme from\n1895\nto\n1897\n.\nThe family moved to Chatham, Chatham-Kent Municipality, Ontario, Canada where they continued to live, although Macfarlane continued to maintain strong links with Lehigh. We have not been able to find the exact date when they moved to Canada. In the\n1901\nCanadian Census, Macfarlane gives\n1885\nas the date of his immigration to Canada, but his wife has\n1897\nas the date of her immigration. This is not clarified by the fact that in\n1900\n, when Macfarlane attended the International Congress of Mathematicians in Paris, he gave his address as Lehigh University, South-Bethlehem, Pennsylvania. At the Congress of\n1904\nhe gives Chatham as his address.\nIn Chatham, Ontario, Macfarlane devoted much time to writing and during the years\n1901\n-\n1904\ndelivered at Lehigh University lectures on twenty-five British mathematicians of the nineteenth century. For reviews and prefaces to his books including the two famous posthumous publications arising from his lectures at Lehigh University on British mathematicians of the nineteenth century, see\nTHIS LINK\n.\nMacfarlane attended the International Congress of Mathematicians in Paris in\n1900\n, in Heidelberg in\n1904\n, in Rome in\n1908\nand Cambridge, England, in\n1912\n.\nSome letters he wrote while attending the\n1912\nCongress are at\nTHIS LINK\n.\nHe lectured at three of these Congresses. In Paris in\n1900\nhe gave his address as Lehigh University in South-Bethlehem and delivered the lecture\nApplication of Space-Analysis to Curvilinear Coordinates\n. He began his lecture as follows:-\nIn several recent papers, I have investigated the vector expression for\nLamé\n's first differential parameter in the case of orthogonal systems of curvilinear coordinates, and I have shown how to deduce the expression for\nLamé\n's second differential parameter by means of direct operations of the calculus.\nThe results indicate that the method is not confined to orthogonal systems, but is applicable to what may be called conjugate systems. I shall first indicate the results for the spherical system of coordinates, then deduce the results for the complementary system of equilateral-hyperboloidal coordinates, and finally show how the results are modified for an ellipsoidal system of coordinates.\nIn\n1908\nin Rome he gave the lecture\nOn the Square of Hamilton's Delta\nand in\n1912\n, in Cambridge, England, he gave the lecture\nOn Vector Analysis as Generalised Algebra\n.\nMacfarlane received widespread recognition for his contributions. In addition to his election to the\nRoyal Society of Edinburgh\n, he was elected to the Scientific Society of Mexico in\n1893\n, to the American Institute of Electrical Engineers in\n1892\n, to the\nMathematical Circle of Palermo\nin\n1894\n, and to the Washington Academy of Science in\n1900\n. He was elected vice-president of the American Association for the Advancement of Science in\n1899\n, and secretary of the\nInternational Association for Promoting Quaternions and Allied Mathematics\nin\n1879\n. He also received an honorary doctorate from the University of Michigan in\n1887\n.\nAt the age of\n62\n, he died of valvular disease of the heart at his home at\n317\n, Victoria Avenue, Chatham, Ontario, Canada. He had been unwell for six months, his condition becoming more serious three months before his death. He was buried in Maple Leaf Cemetery in Chatham.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}