{
  "nome_completo": "Alexandre Aleksandrovich Kirillov",
  "nome_curto": "Alexander Aleksandrovich Kirillov",
  "ano_nascimento": "1936",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kirillov/",
  "lugar_nascimento": "Moscow, USSR, (now Russia)",
  "lugar_morte": null,
  "biografia": "Alexander Aleksandrovich Kirillov\nwas brought up and educated in Moscow. He excelled at mathematics while at school and he won many mathematical competitions. He entered Moscow State University where, while still an undergraduate, he published\nThe representations of the group of rotations of an\nn\nn\nn\n-dimensional Euclidean space by spherical vector fields\n(1957)\n. He was awarded a Master's degree in\n1959\n. He continued to undertake research for his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nwith\nIsrail Moiseevic Gelfand\nas his thesis advisor, publishing papers such as\nInduced representations of nilpotent Lie groups\n(1959)\n, and\nOn unitary representation of nilpotent Lie groups\n(1960)\n. In\n1961\na seminar on representation theory was set up at the university and Kirillov became a member of this seminar from its initiation. He submitted his thesis\nUnitary representations of nilpotent Lie groups\nin\n1962\nbut this was considered a work of such exceptional quality that he was awarded a doctorate\n(\nequivalent to a D.Sc. or perhaps the\nhabilitation\n)\n. J M G Fell reviewing the paper in which Kirillov published the proofs of the results from his thesis writes:-\nThese results give beautifully compact and complete answers in the nilpotent case to most of the questions usually asked about unitary representations of a given group, namely, the classification of its irreducible representations, the decomposition of a representation restricted to a subgroup or induced from a subgroup, the structure of\nKronecker\nproducts, the\nPlancherel\nformula, and the nature of the infinitesimal and distribution characters of the irreducible representations. ...\nAnother indication of the remarkable quality of the mathematics he had produced while a graduate student is that he was an invited speaker at the International Congress of Mathematicians held in Stockholm in August\n1962\n.\nKirillov continued working at Moscow State University after the award of his doctorate, being made a professor in\n1965\n. Also in\n1965\nhe became a member of the Keldysh Institute of Applied Mathematics. In\n1966\nthe International Congress of Mathematicians was held in Moscow and again Kirillov was invited to lecture - he gave the lecture\nTheory of group representations\nwhich was published in the\nProceedings\n. In\n1967\nhe became a member of the editorial board of the journal\nFunctional Analysis and Applications\n. The editor-in-chief of the journal\n(\nholding this role from the founding of the journal\n)\nwas his former thesis advisor\nIsrail Moiseevic Gelfand\n, and both Kirillov and\nGelfand\ncontinued to hold these roles on the editorial board until\n1988\nwhen Kirillov took over as editor-in-chief. Kirillov published a series of important papers in\nFunctional Analysis and Applications\n. In particular in the\n1960\ns these were:\nOn certain division algebras over the field of rational functions\n(1967)\n,\nPlancherel measure for nilpotent Lie groups\n(1967)\n,\nThe method of orbits in the theory of unitary representations of Lie groups\n(1968)\n,\nCharacters of unitary representations of Lie groups\n(1968)\n,\nThe structure of the Lie field associated with a semisimple decomposable Lie algebra\n(1969)\n, and\nCharacters of unitary representations of Lie groups: Reduction theorems\n(1969)\n.\nIn\n1972\nKirillov published his classic textbook\n(\nwritten in Russian\n)\nElements of the Theory of Representations\n. A reviewer writes:-\nThe book under review, written by a leading figure in the field, constitutes the first treatise devoted to the theory of group representations that presents not only the foundations or some special aspects of the theory but also enough material to give a fair idea of what this domain of contemporary mathematics actually is.\nThe book was translated into French, published in\n1974\n, and into English, published in\n1976\n. A second Russian edition appeared in\n1978\n. In\n1991\nTopics in representation theory\nwas published containing papers written by members of the seminar on representation theory at Moscow University. Kirillov edited the volume and wrote about the developments since his\n1961\ntextbook\n[\n1\n]\n:-\nSome\n20\nyears ago in the book \"Elements of the Theory of Representations\" I wrote that representation theory enters the fourth stage of its evolution, when the three main directions of its development will presumably be the following ones:\n- representations of algebraic groups over local fields and adele rings;\n- representations of infinite-dimensional\nLie\ngroups and\nLie algebras\n;\n- representations of\nLie\nsupergroups and\nLie\nsuperalgebras.\nThese directions, together with the application of the orbit method, formed the main topic of discussion at our seminar.\nOf course, real life corrected this prediction. Two new areas of mathematical physical physics, namely the theory of completely integrable systems and string theory, have had a great influence on mathematics in general, and on representation theory in particular. One must also mention here the growing influence of the idea of supersymmetry. Originally this idea appeared in theoretical physics as a means to \"put on an equal footing\" fermions and bosons, but later it became a general mathematical principle.\nAt the International Congress of Mathematicians held in Helsinki in August\n1978\nKirillov was an invited speaker - it was the third International Congress of Mathematicians which he had been invited to address and he gave the lecture\nInfinite-dimensional groups, their representations, orbits, invariants\n. With A D Gvishiani, he published\nTheorems and Problems of Functional Analysis\n. Russian editions appeared in\n1979\nand\n1988\n, a French edition in\n1982\n, an English edition in\n1982\n, an Italian edition in\n1983\n, and a Hungarian edition in\n1985\n.\nFrank Smithies\nbegins a review as follows:-\nThis text, based on courses and seminars at Moscow University, consists of three main parts: expository text, problems and hints for solution. The exposition is concise but very clear.\nIn\n1993\nKirillov published the text with the interesting title\nWhat is a number?\nAlexander Gutman indicates its contents:-\nThe main goal of the book is to show the meaning of the notion\n(\ns\n)\nof number in contemporary mathematics, to inform about problems arising in connection with various approaches to the notion and about methods of solving such problems. In each case, the very beginning of the corresponding theory is outlined and suitable literature is indicated for further details. Among other subjects, the basic notions of p-adic and non-standard analysis are presented, and the concepts of a\nquaternion\nand a\nCayley\nnumber are explained. The author also acquaints the reader with the notion of a\nvon Neumann\nalgebra and the idea of \"supermathematics\", the calculus of anti-commuting variables. The book is addressed to students and scientists who are interested in applications of mathematics.\nKirillov continued to hold the position of Professor of Mathematics at Moscow State University until\n1995\n. He was also a founding member of the Independent University of Moscow being Professor of the Mathematical College there from\n1991\nto\n1995\n. He was elected to the\nRussian Academy of Sciences\nin\n1990\n. In\n1995\nhe was appointed as Professor of Mathematics at the University of Pennsylvania, Philadelphia. He continues to hold this position. He was Francis J Carey Term Professor in Mathematics at the University of Pennsylvania\n1997\n-\n2002\nand Miller Professor at the University of California, Berkeley, in the spring of\n1999\n. We should also mention the conference\nOrbit method in Geometry and Physics\nheld in his honour in Marseilles, France, in December\n2000\n.\nKirillov published\nLectures on the orbit method\nin Russian in\n2001\nand in English in\n2004\n. William McGovern writes:-\nThis is the first systematic and reasonably self-contained exposition of the orbit method for representations of\nLie\ngroups to appear in print. It is written by a leading pioneer and major worker in the subject, as an outgrowth of an earlier paper and lectures on the subject, and is aimed at both experts and students. It surveys a large part of the subject, omitting many supplementary details not necessary to follow the main thread. The aim of the orbit method is to unite harmonic analysis and symplectic geometry to describe the representations of a group in geometric terms. This aim has been most successfully realized for nilpotent and solvable\nLie\ngroups; most of this book is devoted to their representation theory.\nA review in the\nEuropean Mathematical Society\nNewsletter\nstates:-\nThe book offers a nicely written, systematic and readable description of the orbit method for various classes of\nLie\ngroups. ...\n[\nIt\n]\nshould be on the shelves of mathematicians and theoretical physicists using representation theory in their work.\nHis latest book is\nA Tale of Two Fractals\n(\nRussian\n)\npublished in\n2009\n.\nIn\n2006\n, Kirillov reached\n70\nyears of age and a number of journals on whose editorial boards he had served produced volumes in his honour. We give excerpts from the editors' dedication to Kirillov in the\n2006\nvolume of the\nMoscow Mathematical Journal\n, a publication of the Independent University of Moscow distributed by the\nAmerican Mathematical Society\n[\n2\n]\n:-\nThe name of Kirillov is known to everyone who studies representation theory or uses it in one's research. He is a classical author of the subject, the creator and developer of its basic notions and methods. Kirillov's orbit method, the Kirillov-Kostant bracket, Kirillov's character formula, the\nGelfand\n-Kirillov conjecture, the\nGelfand\n-Kirillov dimension, Kirillov's model, are terms firmly established in the language of mathematics. Kirillov's orbit method is one of the most original and fruitful discoveries in representation theory in its hundred-plus year history. This method soon became widely popular and stimulated a flow of results that has not dried up to these days. Another fundamental direction was called to life by the seminal joint papers of\nGelfand\nand Kirillov on the skew fields of fractions of universal enveloping algebras. Wonderful and as always highly original results were obtained by Kirillov in the theory of infinite-dimensional\nLie\ngroups and algebras, and their representations. This work is relatively less known and should yet be carefully read and studied. Kirillov's seminar at Moscow State University gathered for\n30\nyears. It is with deep nostalgia that all its participants remember it. Kirillov has numerous students that were formed not only by the problems he put forward, but even more by his powerful personality. ... Alexander Kirillov has the gift of creating a specific atmosphere that stimulates research and has exquisite mathematical taste. All his students and friends warmly remember his out-of-the-city seminar sessions with their traditional soccer and especially volleyball, and charming charades.\nWe should mention that\nAndrei Yuryevich Okounkov\n, who was awarded a Fields medal in\n2006\n, was a student of Kirillov and was introduced to leading edge research in Kirillov's seminar in Moscow. Finally note that Kirillov's son, Alexander Kirillov Jr, is a mathematician undertaking research on the representation theory of\nLie\ngroups at the State University of New York at Stony Brook.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}