{
  "nome_completo": "Alexander Ivanovich Skopin",
  "nome_curto": "Alexander Ivanovich Skopin",
  "ano_nascimento": "1927",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Skopin/",
  "lugar_nascimento": "Leningrad, USSR (now St Petersburg, Russia)",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Alexander Ivanovich Skopin\nwas the second mathematician in his family after his father Ivan Alexandrovich. The scientific interests of Ivan Alexandrovich were in number theory. After the award of a PhD for a thesis written under\nI M Vinogradov\n's supervision, Ivan Alexandrovich actively worked on research and taught in both Leningrad University and in Leningrad Mining University. Skopin's mother was a chemist. A I Skopin was born and lived in Leningrad until World War II. In\n1942\nhe was evacuated, together with his mother and two small sisters, during the blockade of Leningrad. However his father, Ivan Alexandrovich, did not leave Leningrad and as a result died of starvation. Afterwards, the image of Ivan Alexandrovich became an example of a mathematician and professor which inspired Skopin.\nAt the end of the War Skopin had to interrupt his schooling to help his mother feed the family. After the war the family returned to Leningrad. There Skopin passed the high school examinations without attending classes and entered the Department of Mathematics and Mechanics of Leningrad University where he was an outstanding student. He chose algebra as his speciality, his supervisor being\nD K Faddeev\n. The first significant result which Skopin produced was concerned with the upper central series of groups\n[\n1\n]\n. His PhD thesis, however, was devoted to an investigation of\np\np\np\n-extensions of local fields. Skopin continued his interest in this area up to the early nineteen sixties. In particular, he found and proved independently a result that is now known as Kawada's theorem\n[\n3\n]\n,\n[\n4\n]\n. Another of Skopin's results\n[\n2\n]\nwas essentially used by I R Shafarevich in the proof of his famous theorem.\nFrom the middle of the nineteen sixties until the early seventies Skopin's scientific activity was reduced because of a heavy burden of administrative duties. For almost ten years he was the scientific secretary of the Leningrad branch of the Steklov Mathematical Institute.\nActually Alexander I Skopin was the first Leningrad algebraist to begin using computer algebra methods to solve group-theoretic problems. His second Doctoral Thesis\n(\nDSc\n)\nwas devoted to this topic. From the\n1970\n's, he became interested in problems concerning the structure of the lower central series of groups of the\nBurnside\ntype, that is groups of prime-power exponent. At that time, a positive solution of the restricted\nBurnside\nproblem was known only for a prime exponent. Thus, any information on the structure of such groups of small, fixed, prime-power but not prime, exponent was of considerable interest. Initially, Skopin made purely theoretical investigations on these topics\n(\nsee\n[\n8\n]\n,\n[\n11\n]\n,\n[\n16\n]\n)\n. Subsequently, influenced by his teacher and founder of the Leningrad- St Petersburg algebraic scientific school\nD K Faddeev\n, he turned to the implementation of his ideas and algorithms on a computer.\nIt was very natural to fix the exponent and the number of generators and to study the lower central series of a group in more detail by performing direct calculations of its factors. At first, Skopin considered the case of metabelian groups with two generators with exponents\n8\n,\n9\n, or\n27\n(\n[\n18\n]\n,\n[\n19\n]\n)\n. In this study he introduced a number of new ideas and methods. If one uses additive notation for the group operation\n(\nin the nonabelian case!\n)\nand multiplication as the notation for the commutator operation, then the main relation, the\nHall\ncollection formula, is converted into a symbolic polynomial. Therefore, one can apply methods from computer algebra.\nThe second key idea introduced by Skopin was the application of linear-algebraic methods, in particular, an analogue of Gaussian elimination, to such calculations. He also considered, and implemented on a computer, different deformations of relations. In particular, several types of permutations of variables of the corresponding symbolic polynomial are distinguished.\nThe third important idea of Skopin's is a graph theoretic method for finding the collection formula\n[\n27\n]\n. The essence of this method is in finding coefficients of basic monomials via the number of possible arrangements of a graph on a finite linearly ordered set that preserves the order of location of vertices.\nAfter completing work on metabelian groups, Skopin decided to carry out similar calculations on more extended classes of\nBurnside\ngroups, called by him in\n[\n14\n]\ntransmetabelian groups of type I and II. These satisfy the relations\n(\nG\n3\n)\n2\n=\n0\n(G^{3})^{2}= 0\n(\nG\n3\n)\n2\n=\n0\nand\n(\nG\n2\n)\n3\n=\n0\n(G^{2})^{3}= 0\n(\nG\n2\n)\n3\n=\n0\nin additive notation, respectively. The calculations were performed for exponents\n8\n,\n9\n,\n16\n,\n25\n, and\n27\n(\nsee\n[24\n,\n25\n,\n30\n,\n31])\n.\nThe last period of Skopin's scientific activity was concerned with the computer investigation of subgroup embedding properties in symmetric groups of small degrees\n(\n[\n32\n]\n,\n[\n33\n]\n,\n[\n34\n]\n)\n. Skopin worked as a researcher at the Steklov Institute for the whole of his life and, in addition, he taught algebra in the Leningrad- St Petersburg University throughout his life.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}