{
  "nome_completo": "Alexander Dinghas",
  "nome_curto": "Alexander Dinghas",
  "ano_nascimento": "1908",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dinghas/",
  "lugar_nascimento": "Smyrna (now Izmir), Turkey",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Alexander Dinghas\n's father was a primary school teacher. Alexander attended primary school in Smyrna and began his secondary schooling there. In\n1922\nhis parents moved from Smyrna to Athens and Alexander moved with the family to complete the last three years of his secondary schooling there. In\n1925\nhe entered the Athens Technical University where he studied engineering, graduating in\n1930\nwith a diploma in electrical and mechanical engineering. He married Fanny Grafiadou in\n1931\n.\nIn\n1931\nDinghas began his studies at Berlin. His original intention was to study physics and he began taking courses in both physics and mathematics, as well as some philosophy courses. The three professors of mathematics were\nSchmidt\n,\nSchur\nand\nBieberbach\n. However, many other talented mathematicians and theoretical physicists were also at Berlin and influenced Dinghas. In particular\nSchrödinger\n, von\nMises\n, von Laue,\nvon Neumann\n, Richard\nRado\n,\nBernhard Neumann\nand\nWielandt\n. It was the teaching of\nSchmidt\nin particular which convinced Dinghas that mathematics rather than physics was the subject for him to pursue.\nRight from the time he began his studies in\n1931\n, Dinghas became interested in\nNevanlinna\ntheory. He attended lectures on the topic given by\nSchmidt\nand it was these lectures which\nSchmidt\ngave \"with almost religious enthusiasm\" which turned Dinghas from an engineer/physicist into a mathematician. He studied for his doctorate under\nSchmidt\nand it was awarded in\n1936\n. Two years later he submitted his\nhabilitation\nthesis and obtained the right to lecture in a university.\nHowever, as a non-German his career during the Nazi years was extremely difficult. Despite the award of his habilitation he did not receive a permanent teaching post although he did manage to continue teaching throughout. However, after the end of World War II he became professor at the reopened Humbolt University in\n1947\n. From\n1949\nuntil his death he was a professor at the Free University of Berlin and director of the Mathematical Institute there.\nHis work is in many areas of mathematics including\ndifferential equations\n, functions of a complex variable, functions of several complex variables,\nmeasure theory\nand\ndifferential geometry\n. His most important work was in function theory, in particular\nNevanlinna\ntheory and the growth of subharmonic functions.\nDinghas produced a series of papers on\nisoperimetric\nproblems in spaces of constant curvature. His work here was much influenced by\nSchmidt\nwho also produced important results which Dinghas used in his work.\nThe article\n[\n5\n]\ncontains a bibliography of\n121\npapers by Dinghas, and in addition lists three books and five historical or general articles. Although Dinghas had a wonderful feel for mathematics, he frequently waved his hands somewhat when he gave a proof. His papers were\n[\n5\n]\n:-\n... not always easy to read and on occasion proofs were only sketched or contained serious gaps. However, the gaps have largely been filled in and the vision of the basic ideas will secure a permanent niche for their author in the theory of functions.\nHis three books are\nVorlesungen über Funktionentheorie\n(1961)\n,\nMinkowskische Summen und Integrale. Superadditive Mengenfunktionale. Isoperimetrische Ungleichungen\n(1961)\n, and\nEinführung in die Cauchy-Weierstrass'sche Funktionentheorie\n(1968)\n. The first of these is described by a reviewer:-\nThis treatise presents an amazing amount of function theory in its modest\n400\npages. The presentation is concise and clear. Also each of the nine chapters ends with a section... which presents various interesting topics, frequently in quite abbreviated form. Examples are the formula of\nPlana\n-\nAbel\n-\nCauchy\n, the theorem of\nJulia\n-Wolff-\nCaratheodory\n, and the theory of\nNevanlinna\nand of Hallstrom. Each chapter contains a useful section on the history and literature of the chapter's topics. This book will clearly prove valuable as a reference or as a text for any student who already knows a modest amount of elementary function theory.\nThe treatise is in four parts. The final part containing chapters on the maximum principle and the distribution of values, geometric function theory and conformal mapping, and\nNevanlinna\ntheory.\nHis\n1968\nbook is described as follows:-\nThis little paperback book contains in\n107\npages the core material and usual preliminaries of the standard first course in analytic functions of a complex variable. Definitions and theorems are stated precisely in modern terminology, but the underlying attitude is basically traditional and perhaps somewhat innocent\ntopologically\n. ... Some topics treated which are not always found in the older short elementary texts are the\nhomotopy\nconcept for closed curves, cluster sets of\nmeromorphic\nfunctions, removable compact sets of singularities, the monodromy theorem, and the\nMittag-Leffler\npartial fraction expansion of a meromorphic function.\nHayman\nwrites of Dinghas's personality in\n[\n5\n]\n:-\nDinghas was a complex personality and a German professor of the old school. On the one hand he expected and was awarded the respect due to his position, and his students and colleagues were somewhat in awe of him. ... However this was only one side of his nature. he was extremely hospitable and generous and had a puckish sense of humour. ... He felt profound sympathy for those less fortunate. On one occasion he saw a man in a restaurant looking rather forlorn and with a single cup of coffee. Dinghas felt the man's hunger and got the waiter to send him food and drink which Dinghas paid for. On another occasion he felt sorry for a newspaper seller and bought every one of his papers. he always supported students against the teaching staff when he felt they had a good case.\nDinghas received many honours for his work. In particular he was elected to membership of the\nHeidelberg Academy\n, the\nFinnish Academy\nand the\nNorwegian Academy\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}