{
  "nome_completo": "Alexander Doniphan Wallace",
  "nome_curto": "Alexander Doniphan Wallace",
  "ano_nascimento": "1905",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wallace_Alexander/",
  "lugar_nascimento": "Hampton, Virginia, USA",
  "lugar_morte": "New Orleans, USA",
  "biografia": "Alexander Doniphan Wallace\nwas born in Hampton, southeastern Virginia, U.S.A. Hampton, lying on Chesapeake Bay which is the largest inlet in the Atlantic Coastal Plain of the eastern United States, was a town when Wallace was born but three years later it became a city. Wallace was a student at the University of Virginia and he was awarded a B.S. in\n1935\n. He continued to take postgraduate courses at the University of Virginia and was awarded a Master's Degree in\n1936\nfollowing which he undertook research with\nGordon Whyburn\nas his thesis advisor. He submitted his doctoral dissertation\nOn the Interior and Related Transformations\nto the University of Virginia in\n1939\nand was awarded a Ph.D.\nIn fact Wallace had written six papers during his time as a research student and three of these were published in\n1939\nwith the next three appearing in\n1940\n.  The\n1939\npapers were:\n(\nwith D W Hall\n)\nSome invariants under monotone transformations; On non-boundary sets\n; and\nSome characterizations of interior transformations\n. The\n1940\npapers were:\nMonotone coverings and monotone transformations\nwhich relates monotonic transformations to monotonic coverings of the space, that is, coverings with connected sets;\nOn\n0\n-regular transformations\nwhich defines and develops some of the properties of a new transformation; and\nQuasi-monotone transformations\nin which he shows, among many other things, that the property of being a rational curve or a regular curve is invariant under quasi-monotone transformations.\nWallace spent the year\n1940\n-\n41\nas an Instructor in Mathematics and assistant to\nLefschetz\nat Princeton, then was appointed as an Assistant Professor at the University of Pennsylvania. He spent the years\n1941\n-\n47\nthere building an impressive expertise in\nalgebraic topology\n[\n2\n]\n:-\nIn\n1947\nhe gave an invited address to the\nAmerican Mathematical Society\nin which he introduced a significant modification of the\nAlexander\ncochain complex. This notion, subsequently developed by\nSpanier\nin his dissertation, is frequently referred to as\nAlexander\n-Wallace-\nSpanier\n-\nKolmogorov\ncohomology. He began to develop a set of lecture notes on algebraic topology which, although formally unpublished, represents a substantial achievement in research and scholarship. These notes, through his students, had a great influence on research in topology and its applications in topological algebra.\nWallace was invited to join the faculty at Tulane University as Professor and Head of the Department of Mathematics in\n1947\n. There he played a major role in developing a graduate programme over\n16\nyears in which his research interests moved from studying\nLeray\n's work, to locally compact connected groups, and then in\n1952\nto topological semigroups. By the time he gave an invited address to the\nAmerican Mathematical Society\non the topic in\n1953\nhe had already written six papers on the topic. For example he published a two part paper\nA note on mobs\n(1952\n,\n1953)\nwhich looks at idempotents in semigroups and subgroups of semigroups. Three further\n1953\npapers are\nCohomology, dimension and mobs, Indecomposable semigroups\n, and\nInverses in euclidean mobs\n. In the second of these he showed that an indecomposable continuum which is a semigroup with identity must be a group, while the third showed that a unit of a continuum semigroup in\nR\nn\n\\mathbb{R}^{n}\nR\nn\nalways lies on the boundary.\nHis style while at Tulane is illustrated in\n[\n1\n]\nwith the following description:-\nEach day, in the early afternoon, he swept into the department making the rounds of all his students and colleagues with his usual greeting, \"Ah, Mr Koch\"; or, \"Ah, Professor Mostert; a theorem a day brings promotion and pay!. What have you got today?\" He did not wait for people to come to see him about their results, or about their problems. He was always there looking for something new from anyone and everyone.\nIn\n1963\nWallace moved to the University of Florida at Gainesville. He spent the rest of his career there until he retired in June\n1973\n. He took up the professorship at Florida in the same year as Kermit Sigmon became a graduate student. Sigmon wrote his thesis on\nTopological Means\nwith Wallace as advisor. He expressed his thanks at the acknowledgements:-\nThe author wishes to express his gratitude to Professor A D Wallace, Chairman of his supervisory committee, for his continued interest and efforts on behalf of the author in preparing him for a career in mathematics. ...\nThis is typical of the care and effort that Wallace put into helping all the students in his department, those he supervised and those supervised by others.\nWallace married Willie-Catherine and they had a daughter Sandra. They moved to New Orleans after Wallace retired and there he wrote\n[\n1\n]\n:-\n... frequent letters-to-the-editor in the local newspapers, dealing with matters political and social.\nThe authors of\n[\n2\n]\nwrite:-\nThe personal influence which A D Wallace had on his students and colleagues alike was enormous. His style was relaxed, yet combined with great personal dignity. An expert teacher, he once enunciated the \"principle of the bite sized chunk\", his technique of communicating, both in written and in oral form. It expresses the idea of presenting small, well-chosen segments of a subject. ... For those of us who were touched by his personality, he was our hero, our leader, and friend. The bite sized chunks he dispensed were little gems, pointing in the direction of larger, nobler goals. For all of those mathematicians having in the remotest sense been connected with topological semigroups, however, Alexander Doniphan Wallace will always be remembered as the great pioneer of this line of mathematical research.",
  "math_areas": [
    "Geometry",
    "Topology"
  ]
}