{
  "nome_completo": "Alexander Johnson Merriles",
  "nome_curto": "Alexander Merriles",
  "ano_nascimento": "1880",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Merriles/",
  "lugar_nascimento": "North Berwick, Scotland",
  "lugar_morte": "Anstruther, Fife, Scotland",
  "biografia": "Alexander Merriles\n's father was  Alexander Merriles\n(\nborn in Dirleton, East Lothian about\n1844)\nwho was a master boot maker employing five men. His mother was  Alice J Merriles\n(\nborn in England about\n1844)\n. He had two younger siblings: Annie\n(\nborn about\n1883)\nand William\n(\nborn about\n1884)\n.\nAlexander Merriles attended North Berwick Public School from\n1890\nto\n1895\n, and then North Berwick High School from\n1895\nto\n1899\nwhere he was a pupil-teacher. He took the Leaving certificate examinations, passing at Higher grade in English and Mathematics in\n1896\n, and at Higher grade in French and Latin in the following year. After having passed Preliminary Examination he first matriculated at Edinburgh University in October\n1899\n. He also attended Moray House Training College, Edinburgh, between\n1899\nand\n1902\n. He was issued with the General Certificate in July\n1902\n, and it was endorsed in\n1914\n.\nAt Edinburgh University, among the courses Merriles took at Ordinary level were Latin, Education, Mathematics, Natural Philosophy, and English. He studied Intermediate Honours Mathematics in session\n1902\n-\n03\n, then Advanced Honours Mathematics from\n1903\nto\n1905\n. During the years\n1903\nto\n1905\nhe also took courses in Dynamics, Thermodynamics, Electrokinetics, Advanced Dynamics, Wave theory, and\nQuaternions\n. He graduated M.A. with First Class Honours in Mathematics and Natural Philosophy in April\n1905\n. In July of the same year he also graduated with a B.Sc.\n(\nPure\n)\n. During his period as an undergraduate at Edinburgh University, Merriles also taught arithmetic and mathematics at Moray House Practising School, both Elementary and Upper, between May\n1902\nand October\n1904\n.\nAfter graduating Merriles taught mathematics and science at the Edinburgh Provincial Training College from April\n1905\nto September\n1919\n. He took a break from his teaching during World War I when he served as an officer in the Royal Scots. He was appointed to George Watson's Ladies College, Edinburgh, on\n16\nSeptember\n1919\n. He spent the rest of his career at George Watson's Ladies College, retiring in\n1945\n. Here is an quote from\nThe George Square Chronicle\nof December\n1945\n:-\nMR MERRILES.\nA somewhat crushed felt hat appeared for a moment above a line of girls and an eager voice exclaimed: \"Here comes Sandy!\" Alas! it was a false alarm. When the owner of the felt hat was fully revealed, he turned out to be a total stranger. But we live in hopes. For a feeling almost akin to dismay passed through the school when it was announced at the end of last session that Mr Merriles had ended his long period of service - more than twenty-five years - as principal teacher of Mathematics in George Square. To the school he gave undivided allegiance. It was in one sense his only school. A spell of lecturing at Moray House, disrupted by the Great War, when he served as an officer in the Royal Scots, then more Moray House, and then George Square, sums up his teaching career. His brilliance as a mathematician was outstanding and hardly needs mentioning here, except to point out that the same keen intellect that could follow the abstrusest of mathematical speculations was always at the service of the youngest of the juniors, whose work he supervised with the greatest of care and interest.\nBut possibly the most remarkable thing about him was the catholicity of his tastes. As a young man he was a mighty golfer. He belonged to the era in which the small boy on the Scottish coastal strip was given by his mother a solid \"gutty\" ball and a cleek and sent forth to the public course to amuse himself and keep out of mischief. It was a school in which Scotland produced many champions, and Mr Merriles himself was just short of the championship class, though latterly he never handled a club; just as he - a connoisseur in tobacco - entirely gave up smoking.\nMathematics and music seem to have strong affinities, and so it was in his case. Music, and particularly orchestral music, was his delight. And here he rendered a great and possibly a unique service to the school. He was founder of the Gramophone Club, an institution which will likely be permanent and which enables a select band of kindred spirits to discover, study and exploit the musical treasures that are hidden away in a series of gramophone records. After music came art. Although not an unqualified admirer of some of the modern school, he could pass many happy hours in an art gallery, and it is characteristic that, when he was asked what he would like as a parting gift from his colleagues, he selected - a picture. Like many of the older generation of teachers, he had been compelled in his youth to study drawing, and sometimes, in a slightly sardonic mood, would remind his friends that he held the certificates requisite to qualify him to teach that subject. Throughout the whole of his career in George Square he acted as business manager of The George Square Chronicle. He summoned the meetings, drew up the agenda, kept the minutes, and, above all, looked after the accounts. So successful was he in his management that practically every year showed a credit balance and an addition to the steadily growing reserve fund.\nBut when all this is said, it is merely a record of external activities, the veneer or polish on the surface of the solid substance underneath. Here, as ever, it was the man that counted, and no one who came in contact with Mr Merriles was ever long in doubt that here was a man of sterling character, a warm and true friend, a wise counsellor, and a brilliant scholar. His memory will be long cherished in George Square by both staff and pupils; and we hope that the day is not far distant when the authentic soft felt hat with its proper owner beneath it will be seen making its way up the steps into\n5\nGeorge Square.\nMerriles joined the\nEdinburgh Mathematical Society\nin June\n1905\n, the year in which he graduated from Edinburgh University. He left the Society in\n1915\n, when he was involved in war service, and rejoined the Society in December\n1921\nwhen teaching at George Watson's Ladies College.",
  "math_areas": []
}