{
  "nome_completo": "Alexander Barrie Grieve",
  "nome_curto": "Alexander Barrie Grieve",
  "ano_nascimento": "1886",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grieve/",
  "lugar_nascimento": "Aberfeldy, Scotland",
  "lugar_morte": "Stonehouse, Lanark, Scotland",
  "biografia": "Alexander Barrie Grieve\nwas known as\nA Barrie Grieve\nor\nBarry Grieve.\nHis father, Alexander Grieve\n(\nborn in Tranent, East Lothian in\n1857\n; died in\n1933)\n, was Headmaster of Breadalbane Academy, Aberfeldy from\n1885\n. His mother was  Martha Margaret Clark\n(\nborn in Dalbeattie, Kirkcudbrightshire in\n1856\n; died in\n1932)\n. Barrie Grieve had three siblings: Janet\n(1889\n-\n1970)\n, David\n(1890\n-\n1917)\nand Ian\n(1897\n-\n1972)\n. Barrie was educated at Breadalbane Academy and passed English, Mathematics, Latin, Greek, and French at the Higher grade in the Leaving Certificate examinations. In\n1903\n, he was awarded a MacDougall Bursary of £\n25\nto attend Edinburgh University.\nGrieve first matriculated at Edinburgh University in October\n1903\n. During his first year of study he took Latin and Greek at Ordinary level, then in the following session,\n1904\n-\n05\n, he studied Mathematics, Natural Philosophy, and Chemistry at Ordinary level. He began his Honours studies in\n1905\n-\n06\nbut also took Logic at Ordinary level in that year. Over the next few years he took Honours courses in Mathematics, Dynamics, Thermodynamics, Electrostatics, Constitution of matter, Electricity, and Function Theory. He was awarded an M.A. with First Class Honours in Mathematics and Natural Philosophy from Edinburgh University in April\n1908\n.\nGrieve then undertook research in geometry. For example he wrote: A B Grieve, Some Points in the Geometry of Cubic Surfaces,\nProc. London Math. Soc\n.\n(1913)\n,\n315\n-\n339\n. He was awarded a D.Sc. for this research and joined the\nEdinburgh Mathematical Society\nin November\n1923\n. In\n1924\nhe became H.M. Inspector of Schools and lived in Orchardhead Road, Liberton, Edinburgh. In\n1925\nhe published a book of\n314\npages with title\nAnalytical Geometry of Conic Sections and Elementary Solid Figures\n. A review of the book, written shortly after its publication, states:-\nThis book claims to contain the substance of the plane and solid analytical geometry\n(\nexcept straight line and circle\n)\nrequired for Pass and Engineering students at Universities, and for the more advanced pupils of Secondary Schools. It is refreshing to find plane and solid geometry in one volume, but the plan possesses the inherent objection that not very much ground in either can be covered in one book. Furthermore, \"any portions of the subject which are difficult or of algebraic interest only\" have been avoided. The book therefore consists in the main of what may be called numerical analytical geometry of the conics and conicoids. There are also chapters on the General Conic, Poles and Polars, Confocal Conics and Conicoids, and a final chapter on Curvature; but the great method of abridged notation, which is the very essence of the subject, is only hinted at in one chapter. The book is thus very limited in its outlook, and professes to be so.\nAn elementary knowledge of Calculus is assumed; but alternative methods are given, usually in the examples at the end of a chapter. No mention is made, however, of Burnside's beautiful method for writing down secants. Perhaps the author regards this as artificial and \"difficult\". In any case it might have found a place among the examples, which on the whole are a very good collection. There is a short historical note at the beginning, and an admirable plate showing photographs of models of conicoids. The book is beautifully printed and the diagrams are clear.\nBarrie Grieve joined the navy during the First World War and fought in the Battle of Jutland. His brother Ian\n(\nwho was a GP in London and was instrumental in first diagnosing asbestosis\n)\nserved with the\n1\n/\n14\nth\nLondon Battalion\n(\nLondon Scottish\n)\nand was wounded in the eye, and discharged. His brother David was killed on\n9\nApril\n1917\nat the Battle of Vimy Ridge in France.\nBarrie Grieve married Isabella Watson\n(\nborn\n1891)\nat St George's Church, Dumfries, Scotland on\n14\nApril\n1914\n. Isabella died at\n16\nOrchardhead Road, Liberton, Edinburgh on\n1\nDecember\n1930\nand Grieve married Eliza McPherson on\n16\nJuly\n1932\nat Duke of Gordon Hotel, Kingussie, Inverness.\nAlexander Grieve, Barrie Grieve's father, retired in\n1922\nand died on\n1\nApril\n1933\n. Barrie Grieve's mother died in\n1932\n. At the time of his father's death A Barrie Grieve was living at Elmbank, Strathpeffer, Ross-shire and was working there as H.M. Inspector of Schools having only shortly moved there from Edinburgh. Barrie Grieve and his brother Ian were pall-bearers at their father's funeral on\n4\nApril\n1933\n.\nOn\n1\nJuly\n1933\nThe Scotsman\nreported that Barrie Grieve, H.M. Inspector of Schools, and former pupil of Breadalbane Academy, Aberfeldy addressed the pupils while his wife presented the prizes.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}