{
  "nome_completo": "Alexander Alekseevich Beilinson",
  "nome_curto": "Alexander Beilinson",
  "ano_nascimento": "1957",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beilinson/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": null,
  "biografia": "Alexander Beilinson\n, the son of the mathematician Alexander Alekseevich Beilinson, was born into a Jewish family in Moscow. He writes in\n[\n6\n]\n:-\nThe city was much smaller then and still retained some rural character: small wooden houses with gardens, an occasional horse-driven cart. After the joy of early childhood, going to school was a setback. After\n7\nth grade I went to mathematical school no.\n2\n. It was a true change: lectures and seminars on advanced mathematical topics taught by professors and students from the University, the shining classes on literature and on history.\nThe family had a summer house and near there was a neighbour who was a mathematician. As soon as he started reading mathematics books, Alexander started talking to him about mathematics. By\n1972\nhe was a senior at the\n2\nnd mathematical school and, in the autumn of that year, was introduced by Alesha Parshin to\nIsrael Moiseevich Gelfand\n's mathematical seminar which began at the beginning of September and was held in the large auditorium on the\n14\nth floor of Moscow University's main building. It was an evening event, with\n6\np.m. to\n7\np.m. being preseminar discussion time, then\nGelfand\narrived and the seminar went on until\n10\np.m. Beilinson described\nGelfand\n's mathematical seminar in\n[\n12\n]\n:-\nDuring the preseminar dozens of people congregated near the auditorium entrance, chatting and exchanging books and texts of all kinds. The seminar typically began with\nGelfand\ntelling some anecdotes and mathematical news, after which would come a talk by an invited speaker. Often there was not enough time to finish, and the talk continued serially, each time beginning from scratch and covering about half of the material from the week before, the speaker gradually fading away and being replaced by a student assigned by\nGelfand\nto explain what the talk was, or should have been, about. Any speaker deemed not to have understood the subject, or to have explained it badly\n(\nor if the writing was too small and the voice not clear\n)\nwas harshly reprimanded.\nBeilinson graduated from the\n2\nnd mathematical school and sat the entrance examinations for the University of Moscow. Given that he was already far ahead of others sitting the entrance examination, one might expect this to be a formality. This, however, was not the case since, as we mentioned above, he was Jewish. At this time the University of Moscow was highly anti-Semitic and made sure that almost all Jewish students failed the entrance examinations. You can read in Jay Egenhoff's article\n[\n15\n]\nhow the examiners went about failing talented Jewish students. An example is given of a Jewish student being asked \"What is the definition of a circle?\" and being failed for giving the answer \"It is the set of points in a plane, equidistant from a fixed point.\" The examiners said the correct answer was \"the set of\nall\npoints in a plane, equidistant from a fixed point.\"\nHaving failed the University of Moscow entrance examination, Beilinson went to the Pedagogical Institute which he described as a blessing. He attended classes and seminars but often missed these to take a train to the woods where he loved to walk. In\n1977\nBeilinson moved to the University of Moscow where he undertook research advised by\nYuri Ivanovich Manin\n. The first result that he obtained was published in his\n1978\npaper\nCoherent sheaves on\nP\nn\n\\mathbb{P}^{n}\nP\nn\nand problems in linear algebra\n(\nRussian\n)\n. By a coincidence\nIsrael Moiseevich Gelfand\n, working with Joseph N Bernstein and Sergei I Gelfand\n(\nI M Gelfand\n's son\n)\n, had found a similar result near the end of\n1977\n. It was published in the paper J N Berstein,\nI M Gelfand\nand S I Gelfand,\nAlgebraic vector bundles on\nP\nn\n\\mathbb{P}^{n}\nP\nn\nand problems of linear algebra\n(\nRussian\n)\n. The two papers appear consecutively in the journal\nAkademiya Nauk SSSR. Funktsional'nyi Analiz i ego Prilozheniya\n. Beilinson explained that before either work was published\n[\n12\n]\n:-\nGelfand\ngave a talk about his work, mentioning that I had obtained a similar theorem. After the talk I approached\nGelfand\n, and he at once ordered me to leave\nYuri Ivanovich Manin\n, who was my supervisor, and be his student. I refused. When I told\nManin\nabout the accolade, he said this had happened to many, e.g., to himself and to\nShafarevich\n. Thereafter I stayed in an outer orbit of\nGelfand\n's influence, and our relationship was excellent.\nThe authors of\n[\n16\n]\nwrite:-\nSasha's very first mathematical paper - a note on coherent sheaves on\nP\nn\n\\mathbb{P}^{n}\nP\nn\n, written in\n1977\n, opened a new direction in algebraic geometry. Together with the paper of Bernstein-\nGelfand\n-Gelfand on the same topic\n(\nwhich appeared simultaneously with Sasha's\n)\n, it revealed the role of the derived category of coherent sheaves as an invariant of an algebraic variety, and started the theory of exceptional collections, which now became an indispensable part of algebraic geometry, especially in connection with homological mirror symmetry. One of the significant impacts of these papers, amplified by the subsequent one of Beilinson-Bernstein-\nDeligne\non perverse sheaves, was that they brought derived categories within the field of vision of mathematicians working in many different fields, and they started to play an increasingly pivotal role in areas well beyond algebraic geometry: representation theory, non-commutative geometry, symplectic topology, mathematical physics, etc. The fact that the two approaches to coherent sheaves on\nP\nn\n\\mathbb{P}^{n}\nP\nn\n(\nby Beilinson and by Bernstein-\nGelfand\n-Gelfand\n)\nappeared at the same time was providential for the birth of the theory of\nKoszul\nduality. Even though\nKoszul\nalgebras had been known for some time, the connection of the symmetric and exterior algebras to derived categories of sheaves on\nP\nn\n\\mathbb{P}^{n}\nP\nn\nshowed that\nKoszul\nduality can be stated as an equivalence of derived categories of modules. This picture was developed in Beilinson's later works.\nBeilinson graduated from the University of Moscow in\n1980\nand was employed in the mathematical laboratory of the Moscow Cardiological Centre. The head of the laboratory was Vladimir Mikhailovich Alexeev who appears to have been happy that Beilinson spent much time working on his own mathematics. For example Beilinson published three papers in\n1980\n, two single author papers and one with S I Gelfand and\nJu I Manin\n. In\n1981\nhe published a joint paper with Joseph Bernstein. Alexeev died in December\n1980\nand his successor was not happy for Beilinson to be undertaking his own work and wanted to dismiss him.\nGelfand\nstepped in and had Beilinson transferred to the biological sector of the Moscow Cardiological Centre whose director was happy to employ Beilinson as an engineer with no responsibilities.\nBeilinson married the biologist Irene Ogievetskaya; they had two children Helen Alexander Beilinson and Vera Beilinson.\nThe Six-Day Arab-Israeli War in\n1967\nhad led to increased anti-Semitism in the Soviet Union. In\n1971\nthe ban which had been imposed on emigration of Soviet Jews was lifted and many considered emigrating to Israel while some preferred emigrating to the United States.\nDmitry Aleksandrovich Kazhdan\n, a member of Gelfand's school, emigrated to the United States in\n1975\ntaking up a position at Harvard and changing his name to\nDavid Kazhdan\n. In fact he would share the\n2020\nShaw Prize with Beilinson.\nIlya Iosifovich Piatetski-Shapiro\n, a professor at Moscow University, was dismissed from his professorship after signing a letter of support for a mathematician sent to a mental institution. After a few very difficult years he managed to emigrate to Israel in\n1976\n. Joseph Bernstein, who was working closely with Beilinson, emigrated to the United States in\n1981\nand became a professor at Harvard. Beilinson writes\n[\n12\n]\n:-\nNo one at the seminar could replace them.\nCollaboration between Beilinson and Joseph Bernstein had led to them announcing a proof of the\nKazhdan\n-\nLusztig\nconjectures and the Jantzen conjectures in\n1981\n. They published the paper\nLocalisation de g-modules\nin\nComptes Rendus des Séances de l'Académie des Sciences. Série I. Mathématique\nin\n1981\n. Floyd Williams writes in the review\n[\n26\n]\n:-\nThe authors show how to construct a localization functor for certain noncommutative rings related to a reductive\nLie\nalgebra g. This functor identifies g-modules with sheaves of modules over a ring of\n(\ntwisted\n)\ndifferential operators on a suitable flag manifold. As an application a new classification of irreducible\nHarish-Chandra\nmodules and a proof of the\nKazhdan\n-\nLusztig\nconjecture are sketched. Other proofs of the latter conjecture\n(\nin one form or another\n)\nhave been given by Brylinski and Kashiwara and by Vogan.\nIn\n1982\nBeilinson produced conjectures which quickly became known as the 'Beilinson Conjectures'. Spencer Bloch gave a talk on these conjectures at a conference on algebraic geometry, algebraic topology and differential equations held in Mexico City in December\n1984\n. A special session at the Oberwolfach Mathematical Research Institute on the Beilinson Conjectures led to the publication of the book\nBeilinson's conjectures on special values of L-functions\n(1988)\n. As of November\n2023\n, MathSciNet list over\n40\npapers with Beilinson Conjectures in the title.\nBeilinson was awarded the\nMoscow Mathematical Society\nPrize in\n1985\n. Anatole Katok explained in\n[\n19\n]\n:-\nThe\nMoscow Mathematical Society\nPrize for young mathematicians carried a considerable prestige, especially with the mathematical community at-large, as opposed to the official authorities. It was awarded by the elected Society Council which represented the cream-of-the-crop of the community in terms of research achievements and international reputation. The prize was awarded for a speciﬁc body of, work, jointly if the recognised work was joint, and was subject to the upper age restriction of thirty years for all nominees. The prize usually was given for really outstanding work which produced a strong and lasting impact and was also a good predictor of the winner's long-term success. Usually two prizes were awarded every year.\nHe received his PhD in\n1988\nfrom the\nLandau\nInstitute of Theoretical Physics and was a researcher at the\nLandau\nInstitute from\n1987\nto\n1993\n. He writes\n[\n6\n]\n:-\nAt the end of the\n80\ns \"perestroika\" brought onto Moscow streets immense crowds calling for changes. These arrived: the country was split and pillaged by the robber barons, the life losses on a par with those in the Civil War\n74\nyears earlier.\nHe split his time between the United States and Russia, being a professor of mathematics at the Massachusetts Institute of Technology from\n1988\nto\n1998\n. In\n1998\nBeilinson was appointed to the University of Chicago\n[\n21\n]\n:-\nAt\n41\n, Beilinson no longer is eligible for the\nFields\nMedal. Nevertheless, \"his mathematical achievements are on the level of those of the most renowned\nFields\nMedalists,\"\nManin\nsaid. The influence of Beilinson's work extends into representation theory, arithmetical geometry and modern mathematical physics, said\nManin\n. Beilinson holds the prestigious first David and Mary Winton Green University Professorship in Mathematics. Since\n1989\n, Beilinson largely has spent fall semesters teaching at the Massachusetts Institute of Technology as a professor of mathematics and working the rest of the year as a researcher at the\nLandau\nInstitute of Theoretical Physics in Chernogolovka, Russia.\n\"There are several people here whose research is very close to mine and who inspired it in a sense, and so I wish to work with them,\" Beilinson said. He was referring to Spencer Bloch, the Robert Maynard Hutchins Distinguished Service Professor in Mathematics, and Victor Ginzburg, Robert Kottwitz and Madhav Nori, Professors in Mathematics. \"People here would like to create something new,\" Beilinson said. \"It's very nice to come to a place that hopefully will create something wonderful when everything is moving.\" Beilinson also collaborates with\nDrinfeld\n, whom he has known for more than two decades.\nHelen Alexander Beilinson, Beilinson's daughter, grew up during the years Beilinson spent settling in the United States\n[\n18\n]\n:-\nScience comes naturally to Helen Beilinson. She was born in Moscow and grew up in academia; her father is a mathematician and her mother is a biologist. Her family left Russia when she was a young child and led a nomadic academic life until settling at the University of Chicago. Beilinson's baby-sitters were postdocs and grad students and she spent her childhood roaming her mom's biology lab.\nIn\n1999\nBeilinson shared the\nOstrowski\nPrize with Helmut Hofer of the\nCourant\nInstitute. Beilinson was awarded the prize\n[\n8\n]\n:-\n... for achievements in the areas of representation theory, arithmetic geometry, and modern mathematical physics.\nFor more details about Beilinson's work which led to the award of the\n1999\nOstrowski\nPrize, see\nTHIS LINK\n.\nIn\n2018\nBeilinson and\nVladimir Drinfeld\nwere awarded the Wolf Prize\n[\n27\n]\n:-\nAlexander Beilinson's outstanding achievements include proofs of the\nKazhdan\n-\nLusztig\nand Jantzen conjectures, which play a key role in the representation theory, the development of important conjectures\n(\n\"Beilinson's Conjectures\"\n)\nin algebraic geometry, and a significant contribution to the interface between geometry and mathematical physics. The joint work of Beilinson and\nVladimir Drinfeld\non the\nLanglands\nProgram - a woven fabric of theorems and conjectures designed to link key areas of mathematics - has led to impressive progress in implementing the program in important areas of physics, such as quantum field theory and string theory.\nFor more details about Beilinson's work which led to the award of the\n2018\nWolf Prize, see\nTHIS LINK\n.\nIn\n2020\nBeilinson and\nDavid Kazhdan\nshared the Shaw Prize\n[\n14\n]\n:-\nAlexander Beilinson and\nDavid Kazhdan\nare two mathematicians who have made profound contributions to the branch of mathematics known as representation theory, but who are also famous for the fundamental influence they have had on many other areas, such as arithmetic geometry, K-theory, conformal field theory, number theory, algebraic and complex geometry, group theory, and algebra more generally. As well as proving remarkable theorems themselves, they have created conceptual tools that have been essential to many breakthroughs of other mathematicians. Thanks to their work and its exceptionally broad reach, large areas of mathematics are significantly more advanced than they would otherwise have been.\nGroup theory is intimately related to the notion of symmetry and one can think of a representation of a group as a \"description\" of it as a group of transformations, or symmetries, of some mathematical object, usually linear transformations of a vector space. Representations of groups are important as they allow many group-theoretic problems to be reduced to problems in linear algebra, which is well understood. They are also important in physics because, for example, they describe how the symmetry group of a physical system affects the solutions of equations describing that system and the representations also make the symmetry group better understood. In loose terms, representation theory is the study of the basic symmetries of mathematics and physics. Symmetry groups are of many different kinds: finite groups,\nLie\ngroups, algebraic groups, p-adic groups, loop groups, adelic groups. This may partly explain how Beilinson and\nKazhdan\nhave been able to contribute to so many different fields.\nFor more details about Beilinson's work which led to the award of the\n2020\nShaw Prize, see\nTHIS LINK\n.\nIn\n2013\nBeilinson wrote a letter to the Editor of the\nNotices\nof the\nAmerican Mathematical Society\nsuggesting that the\nAmerican Mathematical Society\nsever all ties with the NSA\n(\nthe National Security Agency\n)\n. Here is a short extract from that letter\n[\n11\n]\n:-\n... NSA destroyed the security of the Internet and privacy of communications for the whole planet. But if any healing is possible, it would probably start with making the NSA and its ilk socially unacceptable - just as, in the days of my youth, working for the KGB was socially unacceptable for many in the Soviet Union. ... NSA needs mathematicians for its tasks, and the AMS has an interest in increasing research funding. But any relationship with an organisation whose activity is so harmful for the fabric of human society is unhealthy. For the sake of integrity, the AMS should shun all contacts with the NSA.\nHis letter started a good discussion on the topic with, as one would expect, people arguing both for and against.\nLet us end with two quotes. The first one is from\n[\n16\n]\nwhich begins as follows:-\nSasha Beilinson has been a source of light and inspiration for all of us around him - in mathematics and in life in general. As Sasha himself put it on multiple occasions describing other people, a person's ability to produce beautiful mathematics stems from this person's inner freedom. This is exactly the quality that Sasha is amply endowed with, and his unique vision and perception of mathematics is a manifestation of this freedom.\nThe paper\n[\n16\n]\n, written in\n2017\n, ends:-\nSasha continues to surprise and delight us by his amazing insight. For example, a couple of years ago he solved the long-standing problem of defining the notion of singular support for étale sheaves. In a sense, his solution is completely elementary; it uses\nRadon\ntransform as its main tool. Yet, this is something that has eluded experts for decades.\nOur final quote is from Beilinson himself\n[\n13\n]\n:-\nMathematics is simple, but to perceive this your vision must not be rigid and fixed in one direction. Also appreciation of mathematics is virtually impossible without actively doing it - like Nature, it is reality you have to be part of in order to see it. Remarkably, mathematics shares these traits with our common life. ... To me, understanding ourselves as tiny parts no more important than other living beings, of the great flow of Unknown is of key importance both for everyone's normal life and for our common survival.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Topology"
  ]
}