{
  "nome_completo": "Alexander Andreevich Samarskii",
  "nome_curto": "Alexander Andreevich Samarskii",
  "ano_nascimento": "1919",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Samarskii/",
  "lugar_nascimento": "Amvrosiivka, Donetsk, Ukraine",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Alexander Andreevich Samarskii\nwas the youngest child of Andrei Efimovich Samarskii. Sadly he never knew his mother who died when he was one year old. His older sister, Anastasia Andreevna Samarskaya, played a large role in bringing up Alexander Andreevich. Andrei Efimovich was a peasant who worked hard farming at Novo-Ivanovskoye in the Amvrosiivka region and had many other skills which he used to help provide a living for his family. However, times were difficult in Ukraine for the peasants. Beginning in\n1928\nspecial measures were introduced against peasants as the country moved to industrialisation. Taxes were increased and, by the\n1930\ns, peasants were dispossessed of all property. Farms were collectivised which led to mass resistance in the form of revolts which in turn led to even harsher conditions being imposed. The Samarskii family were forced to leave their farm and went first to Donetsk and then to Taganrog, the birthplace of the famous author Anton Chekhov. Alexander Andreevich's father lived apart from the family and Alexander Andreevich was looked after by his sister Anastasia Andreevna Samarskaya.\nAt the age of\n14\n, Samarskii entered the Anton Chekhov school in Taganrog. This was the school which Anton Chekhov had attended and it was by this time named after him. Perhaps not surprisingly, the school had a strong reputation for literature and Samarskii was attracted to this as well as to mathematics and physics. He wrote poetry and decided that he should follow a literary career and enrol in the Institute of Philosophy, Literature and History. However, his teachers of mathematics and physics made it plain to him that his talents lay in these areas and insisted that he follow a course in mathematics and physics at university. He took their advice and, after graduating from the Anton Chekhov School in\n1936\n, entered the Faculty of Physics and Mathematics at the Moscow State University.\nWhen Samarskii began his university studies he was\n17\nyears old and went to live in Moscow were he had no friends or family. He devoted all his efforts to studying but he had a problem since he did not have financial support to allow him to meet the basic needs of living, namely food and clothing. He was forced, therefore, to take a year out from his studies during which he made money from tutoring. Living as frugally as possible he was able to build up sufficient funds to be able to continue his studies after the year.\nAndrei Nikolaevich Tikhonov\nwas appointed as a professor at Moscow State University in\n1936\nfollowing his defence of his\nhabilitation\nthesis\nFunctional equations of Volterra type and their applications to mathematical physics.\nIn\n1939\n, the year World War II began, Samarskii began studying in\nTikhonov\n's seminar. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that initially the war had little effect on life in Moscow and Samarskii continued his studies there. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. As a student, Samarskii could have avoided military service but on\n6\nJuly he submitted an application to join the military feeling that the most important thing was defending his homeland. Despite having no military experience and having eyesight problems which should have prevented him taking part in active service, he was assigned to the\n8\nth\nKrasnopresnenskaya Peoples' Militia Rifle Division commanded by the Moscow Military District.\nAfter working on the construction of defensive lines, the Division became part of the\n32\nnd\nArmy and, in August, took up positions on the Rzhev-Vyazma defensive lines. After the German offensive, named Operation Typhoon, aimed at taking Moscow, began in October Samarskii was part of the Division that moved east of Yelnya to engage the German advance. Fighting on the\n4\nth\nand\n5\nth\nof October was fierce and half the men in the Division were killed. Samarskii, however, survived and went to join those defending Naro-Fominsk. This town, about\n70\nkm southwest of Moscow, fell to the Germans on\n21\nOctober. With the Rifle Division destroyed, Samarskii joined the\n108\nth\nInfantry Division.\nA second assault by the Germans on Moscow began on\n13\nNovember. The Germans advanced to within\n25\nkm of the centre of Moscow but the Russian defences held out. On\n5\nDecember the Russians began a counter-attack to the north and, on the following day towards the south. Samarskii was with those in the south and he was given the task of acting as a scout behind the German lines. On\n12\nDecember he stood on a mine which exploded and somehow his colleagues managed to carry him back behind their own lines. The Russian advance was successful and by January\n1942\nMoscow was no longer in danger. Samarskii saw none of this, however, for he was in hospital for nine months, enduring many operations which removed\n30\nbomb fragments from his body. He had been transferred round several different hospitals during this time, in Moscow, Gorky, Krasnoyarsk, and Minusinsk. Eight fragments remained which the medical people were unable to remove. He remained in hospital until September\n1942\nwhen he was discharged. He was still on crutches when he finally left the hospital in Khakassia.\nSamarskii's family had remained in Taganrog but he could not return there since it was occupied by the Germans. Although by this time Moscow was not being threatened by the Germans, the University of Moscow had been evacuated to Tashkent in Uzbekistan. He was sent to teach mathematics in a school in the Krasnoyarsk region where he had ended up after being a patient in several hospitals. He taught for over a year and during this time he corresponded with one of his friends who was studying at the Military Academy in Moscow. This friend went to the University, now back in Moscow, and arranged for Samarskii to return there to complete his studies. By December\n1943\nhe was back in Moscow working again with\nAndrei Nikolaevich Tikhonov\n. Samarskii said\n[\n5\n]\n:-\nI attended many seminars and wanted to learn much science. I was active and curious, and because of that many professors had asked me to study with them. But fortunately I chose\nTikhonov\n. He was young, adventurous and extremely talented.\nSamarskii undertook research on mathematics and theoretical physics and\nTikhonov\nsuggested that he might try to do some experimental physics. Samarskii said\n[\n6\n]\n:-\nThe teacher's word is the law! I hobbled on my crutches into the laboratory and immediately hated this field of physics. I returned to theoretical work.\nIn\n1945\n, having completed research for his candidate's degree\n(\nequivalent to a Ph.D.\n)\n, he was examined and offered the degree. However,\nTikhonov\nadvised him not to graduate since if he did so, being a foreigner, he would have been required to leave Moscow. However, if he decided not to graduate, he would be able to remain in Moscow working towards his doctorate\n(\nequivalent to a D.Sc. or habilitation in standard\n)\n. Samarskii took\nTikhonov\n's advice and during the next three years he published around\n20\npapers. He was awarded his candidate's degree in\n1948\nfor his dissertation which\n[\n2\n]\n:-\n... was small, about\n20\npages of introduction and\n20\nof content, and was about the study of the perturbation of the discrete spectrum of the\nLaplace\noperator with the change of the boundary. This problem arose in connection with some models of the atom.\nHis thesis examiner had been\nIvan Georgievich Petrovsky\n.\nOn\n10\nJuly\n1948\n, laboratory number\n8\nof the Geophysical Institute of the\nUSSR Academy of Sciences\nwas created with Tikhonov as the head and Samarskii as a leading researcher. This laboratory was involved in carrying out numerical calculations and a staff of around\n30\nyoung women were employed as computers. In addition to this position, Samarskii was employed as a lecturer in the Mathematics Department at the Moscow State University where he taught mathematical physics. Much of Samarskii's research at this time involved numerical techniques to solve problems associated with the Soviet atomic weapons programme\n[\n1\n]\n:-\nIn those years Samarskii, together with\nA N Tikhonov\n, wrote a series of papers on electrodynamics and the excitation of electromagnetic waves in waveguides. In\n1949\n, a direct numerical analysis of the nuclear explosion was performed for the first time under the supervision of\nTikhonov\nand Samarskii; later, their scientific group computed the explosion dynamics of the thermonuclear bomb. That was the time of rapid development of computers and computational mathematics. It was at this time that Samarskii began to work actively in the field of finite-difference schemes and created a scientific school in this direction. Samarskii became one of the leading world authorities in the theory of finite-difference schemes.\nIgor Tamm, Andrei Sakharov and Yakov Zeldovich were the main physicists working on the bomb and they would come to Samarskii and his fellow mathematicians and computers to seek mathematical solutions to their physical problems. One of the major advances made by Samarskii in the atomic weapons programme was to discover a method to allow parallel calculations by the\n30\ngirl computers. The problem to be solved consisted of several hundred partial differential equations. At the time this was thought to be impossible but Samarskii developed an approach based on finite difference schemes. He then divided up the problem in such a way that each of the girl computers had about\n10\nequations to solve and they had to pass their data to each other as they progressed the calculations. These were not hand calculations but rather done using adding machines and electromechanical calculators. By doing parallel calculations, the problem was solved about\n15\ntimes quicker than it would have been had this method not been used and the solution was completed in two months. Of course the research Samarskii did on the atomic bomb project was classified and he worked on this until about\n1980\n, writing around\n500\nclassified papers. However, when there were celebrations on the\n50\nth\nanniversary of the first atomic bomb test, Samarskii was not invited. In the interview\n[\n5\n]\nhe said that he was offended not to have been invited. He was sad that people seemed to have forgotten the role played by his laboratory in the project. He said:-\n... still we cannot forget the role of the people who made the first calculations of the atomic bomb.\nHe explained that, as a mathematician, the specific problems he was told to solve were less important that finding general methods of solution\n[\n5\n]\n:-\nMathematicians explore fundamental problems ... At first, it was different - we were required to answer a specific question, but because it is not possible to get anything new from specific problems, therefore I, of course, was interested in global issues. It's just fun!\nIn\n1951\nTikhonov\nand Samarskii published\nEquations of mathematical physics\n(\nRussian\n)\n. An English translation of this book appeared in\n1963\n. We note that this book went through many editions and was translated into\n13\ndifferent languages. You can read extracts from a review of both the Russian and the English editions at\nTHIS LINK\n.\nIn\n1953\nMstislav Vsevolodovich Keldysh\nwas appointed as the first director of the newly created Institute of Applied Mathematics of\nUSSR Academy of Sciences\n.\nTikhonov\nwas appointed as deputy director and Samarskii became the head of the largest department. He continued teaching at Moscow State University so at this time he had a number of different positions. He was awarded a Stalin prize in\n1954\n. In\n1957\nhe defended his doctoral thesis\n(\nequivalent to the D.Sc. or habilitation in standard\n)\nat the Institute of Applied Mathematics. The thesis was around\n800\npages long and dealt with finite-difference methods for solving nonlinear problems in mathematical physics. In the following year he became a professor. A summary of his contributions to mathematics, particularly to computational methods in applied mathematics, is given in\n[\n1\n]\n:-\nAlexander Andreevich Samarskii, an outstanding Russian mathematician, is considered a supreme authority in computational mathematics and mathematical modelling. His scientific interests included mathematical physics, numerical simulation of complex nonlinear systems and phenomena, and finite-difference methods. Samarskii was the author of the principal results in the theory of differential equations with smooth and discontinuous coefficients and the theory of nonlinear equations; he posed and studied a number of nonclassical problems in mathematical physics. The scientific activity of Aleksander Samarskii typically involved the stating of problems related to numerical experiments performed on modern computers, the development of the theory of mathematical and numerical simulation of complex physical processes, and the devising of efficient finite-difference methods.\nHe has a remarkable list of textbooks and monographs and he said in the interview\n[\n5\n]\n:-\nI'm a kind of a champion in the number of books in the field of computational mathematics.\nFor short extracts from reviews of some of these books see\nTHIS LINK\n.\nSamarskii was honoured for his contributions with the award of the Lenin Prize in\n1962\n. His outstanding contributions were recognised with his election to corresponding member of the\nUSSR Academy of Sciences\nin\n1966\nand, ten years later, to full membership. Further recognition came with the award of the title Hero of Socialist Labour in\n1979\n.\nIn\n1982\nSamarskii was appointed as head of the department of Computational Methods in the Faculty of Computational Mathematics and Cybernetics. Four years later he founded the National Institute of Mathematical Modelling as part of the\nUSSR Academy of Sciences\nand he was appointed as its first director. He held this position until\n1998\n. He undertook various editorial duties, was appointed Editor-in-Chief of the journal\nMathematical Modelling\n(\nRussian\n)\nand served on the editorial boards of the\nJournal of Computational Mathematics and Mathematical Physics\n(\nRussian\n)\n, and\nSurveys on Mathematics for Industry\n, and\nMathematical and Computer Modelling\n.\nLet us quote from\n[\n1\n]\nagain regarding his scientific contributions:-\nOf Samarskii's papers on mathematical physics and differential equations, we distinguish the brilliant work on nonclassical problems for partial differential equations and a large cycle of papers on the theory of nonlinear equations of mathematical physics that model peaking regimes. He also developed new analytical and numerical methods for studying the nonlinear stage of the processes proceeding in the peaking regime\n(\napproximate self-similar solutions, linearization of solutions and matching them with the asymptotics, and operator comparison methods\n)\n, the averaging method, and a method for the investigation of group-invariant solutions of quasi-linear parabolic and nonlinear elliptic problems. These theoretical investigations made it possible to predict new phenomena such as inertia of heat and combustion and the localization of diffusion processes. Samarskii was the first to study the diffusion chaos phenomena.\nSamarskii was married to a medical doctor from Uzbek whose father was an expert in mechanics and a member of the\nUSSR Academy of Sciences\n.\nWe have already mentioned some honours which were given to Samarskii. Let us mention a few more. He received three Orders of Lenin\n(1954\n,\n1956\nand\n1979)\n, the Order of the Patriotic War\n1\nst  degree\n(1985)\n, to honour his contributions in World War II, and Laureate of the State Prize in Science and Technology\n(1999)\n. He received an honorary doctorates from the Technical University of Chemnitz\n(\nGermany\n)\n, Tbilisi University\n(\nGeorgia\n)\n, and Taganrog University\n(\nSouth Russia\n)\n. As well as the\nUSSR Academy of Sciences\n, he was elected to the academies of Byelorussia and of Ukraine. In June\n2014\nan International Scientific Conference dedicated to his memory was held at Moscow State University.\nSamarskii died following a long and difficult illness. He was buried in Troekurov cemetery in Moscow.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}