{
  "nome_completo": "Alexander Markowich Ostrowski",
  "nome_curto": "Alexander Ostrowski",
  "ano_nascimento": "1893",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ostrowski/",
  "lugar_nascimento": "Kiev, Russian Empire (now Kyiv, Ukraine)",
  "lugar_morte": "Montagnola, Lugano, Switzerland",
  "biografia": "Alexander Ostrowski\n's father Mark Ostrowski was a merchant in Kiev. Alexander's mother was Vera Rashevskaya. He attended primary school in Kiev, then spent a year at a private school before entering the Kiev School of Commerce.\nFaddeev\nin\n[\n6\n]\n(\nsee also\n[\n7\n]\n)\nrecalled what\nB N Delone\ntold him concerning Ostrowski meeting\nD A Grave\n, then the head of the mathematics school at Kiev. In\n1908\nOstrowski, then a fifteen year old schoolboy:-\n... a pupil at the school of Commerce who had shown considerable interest in mathematics, came to\nGrave\non the recommendation of his mathematics teacher. After several talks,\nGrave\nwas convinced of his remarkable abilities and accepted him in his seminar as a full and equal participant.\nFor three years Ostrowski participated in\nGrave\n's seminar while completing his course at the School of Commerce. In\n1911\nhe was awarded the title of Candidate of Commerce and he was awarded the Gold Medal. Ostrowski had not been a mere observer in\nGrave\n's seminar during these years, however, for by the time he completed his studies at the College of Commerce he had already found original results on\nGalois\nfields and had written his first paper with\nGrave\n's assistance.\nIt would seem natural that this extraordinarily well qualified student would be more than welcome to begin his formal studies of mathematics at Kiev. Few student can begin their studies having already written a mathematical paper. Life is often not that simple, however, since there was a quota on the number of Jewish students allowed into the university and entrance was decided by a lottery rather than on merit. Ostrowski did poorly in this lottery and permission was not granted so\nGrave\nwrote to\nEdmund Landau\nand\nHensel\nin Germany asking for their help.\nBoth\nLandau\nand\nHensel\noffered to help solve Ostrowski's problem and invited him to Germany. Ostrowski accepted\nHensel\n's offer of a place at the Marburg University and in\n1912\nhe began his studies there under\nHensel\n's supervision. Although it looked as though Ostrowski's problems were over, World War I would soon put him back in difficulty again. In the autumn of\n1914\n, after the outbreak of war, Ostrowski was interned as a hostile foreigner.\nHensel\npleaded with the authorities on Ostrowski's behalf and although his movements remained severely restricted, he was allowed to use the library at Marburg University.\nOstrowski said years later that this outcome had been reasonably satisfactory for him and he did not consider the four years of the war as wasted for\n[\n9\n]\n(\nor see\n[\n5\n]\nwhich is an English translation of\n[\n9\n]\nor\n[\n4\n]\nwhich is a Russian translation of\n[\n9\n]\n)\n:-\nThe isolation enabled him to concentrate fully on his investigations. He read through mathematical journals, in his own words, from cover to cover, occupied himself with the study of foreign languages, music and valuation theory ...\nWhen the war ended in\n1918\n, Ostrowski was free to move around Germany and he went to Göttingen where\nKlein\n,\nHilbert\nand\nLandau\nwere major influences on him. He worked at Göttingen for his doctorate under\nHilbert\nand\nLandau\nand it was awarded with distinction in\n1920\n. His doctoral dissertation was published in\nMathematische Zeitschrift\nin\n1920\n, being his fifteenth publication. The results of this work allowed Ostrowski to solve\nHilbert\n's Eighteenth Problem\nFrom Göttingen Ostrowski went to Hamburg in\n1920\nto work for his\nhabilitation\nas\nHecke\n's assistant. He worked there on a problem proposed by\nHilbert\non modules over polynomial rings and he was awarded his habilitation in\n1922\n. The following year he accepted a lecturing position at Göttingen.\nAfter being awarded a Rockefeller Research Fellowship, Ostrowski spent the academic year\n1925\n-\n26\nin Britain, spending periods at each of the universities of Oxford, Cambridge and Edinburgh. He had not been back in Göttingen for long when he was offered the chair of mathematics at the University of Basel. He accepted this appointment and he remained at Basel until he retired in\n1958\n.\nIf Ostrowski had been unfortunate in being in the wrong place at the wrong time for World War I, he was much more fortunate when World War II broke out, being in the neutral country of Switzerland. It did give him some minor difficulties to solve over his German publishers but this only pushed him in the direction of the publisher Birkhäuser with its headquarters in Basel. This had the side effect of pushing Birkhäuser to the forefront as a publisher of mathematics and to this day it has retained this major mathematical publishing role.\nOstrowski married Margaret Sachs in\n1949\n. She was a psychoanalyst who had been a student of the famous Carl Gustav Jung. From this time onwards Ostrowski concentrated fully on his mathematics while his wife completely organised the rest of their lives. It was an arrangement which suited Ostrowski very well indeed.\nWhen we remarked above that Ostrowski \"remained at Basel until he retired\" this was not meant to imply that he did not travel. On the contrary he travelled widely, especially in the United States where he lectured during the\n1960\ns at the University of Wisconsin at Madison, Indiana University at Bloomington, Columbia University in Washington D.C., and Brown University in Providence.\nHis association with the United States was not restricted to the many universities he visited, for he in the\n1950\ns had a close association with the National Bureau of Standards, first at the Institute for Numerical Analysis at Los Angeles and later in Washington, and this fitted in well with his increasing interest in numerical methods. Gautschi writes in\n[\n8\n]\n:-\n... exciting problems of pressing significance began to burst forward at this time and demanded nothing less than farsighted and imaginative approaches.\nOne consequence of this association was his monograph\nSolution of equations and systems of equations\nwhich was published in\n1960\nand was the result of a series of lectures he had given at the National Bureau of Standards. By\n1973\nthe third edition of this monograph appeared, this time with a new title:\nSolution of equations in Euclidean and Banach spaces\n.\nOstrowski had an impressive publication record of around\n275\nworks. The topics which he published on are gathered together under sixteen headings in\n[\n9\n]\n. These are\ndeterminants\n, linear algebra, algebraic equations, multivariate algebra, formal algebra,\nnumber theory\n, geometry,\ntopology\n, convergence, theory of real functions,\ndifferential equations\n, differential transformations, theory of complex functions,\nconformal mappings\n, numerical analysis and miscellany. Despite the quantity of his works it is the remarkable quality which stands out\n[\n7\n]\n:-\nThe works of Ostrowski win one over by their lucidity, elegance, and wit. He himself noted that clarity must go before elegance. His \"Mathematical miscellany\" should be singled out - these are true pearls in the mathematical literature. Ostrowski's persistence manifested itself in the fact that, once he selected a topic, he investigated it exhaustively, not leaving any open questions. His ability and subtlety in the art of estimates are legendary; in this he was a consummate master!\nTo illustrate some of the areas which Ostrowski wrote on we mention his results on the theory of norms of matrices and the applications to finding inequalities, to studying methods to solve linear systems, and to the methods for both finding and approximating\neigenvalues\n. His work on algebraic equations involved a study of the\nfundamental theorem of algebra\n,\nGalois theory\n, and estimating the roots of algebraic equations.\nHe gave a definitive version of the theory of valuations in\n1934\nafter publishing initial results in\n1917\n. On number theory he studied a variety of topics including\nWaring\n's problem,\nDiophantine approximation\nand some problems in\nalgebraic number theory\n. Other work of Ostrowski was on the\nCauchy\nfunctional equation, the\nFourier\nintegral formula,\nCauchy\n-Frullani integrals, and the\nEuler-Maclaurin formula\n.\nThe article\n[\n8\n]\nis addressed to Ostrowski on his ninetieth birthday and, in addition to looking at specific examples of his work in linear algebra, it describes the characteristic features of his mathematics:-\n... you are able, on the one hand, to emphasise the abstract and axiomatic side of mathematics, as for example in your theory of general norms, or, on the other hand, to concentrate on the concrete and constructive aspects of mathematics, as in your study of numerical methods, and to do both with equal ease. You delight in finding short and succint proofs, of which you have given many examples ...\nFaddeev\nends his artice\n[\n7\n]\nwith these words:-\nAlexander Markowich deserves the kindest memories as a brilliant personality, a powerful mathematician, and a good human being.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}