{
  "nome_completo": "Alexander Oppenheim",
  "nome_curto": "Alexander Oppenheim",
  "ano_nascimento": "1903",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oppenheim/",
  "lugar_nascimento": "Salford, Lancashire, England",
  "lugar_morte": "Henley-on-Thames, England",
  "biografia": "Alexander Oppenheim\nwas born the son of Joseph and Fannie Oppenheim who were British German and Russian respectively. Alexander grew up in Manchester, only learning English as a second language after he had learnt Yiddish. As a boy he was fascinated by mathematics and studied books on the subject to increase his knowledge. Even at this stage it was number theory which appealed to him and he began solving Diophantine equations. He attended Manchester Grammar School where he proved himself to be an outstanding scholar. In\n1921\nhe sat the scholarship examinations for Balliol College, Oxford, and was awarded a Mathematical Scholarship.\nAt Oxford, Oppenheim excelled in his academic studies but also took part in other university activities. He played a lot of chess to a high standard and captained the Oxford chess team. He graduated with a First Class degree in\n1924\nfollowing which he was appointed as a tutor at Exeter College, Oxford, and undertook research advised by\nG H Hardy\n. He continued with his early interest in\nDiophantine equations\nand looked to apply methods coming from\nergodic theory\n. He continued his interest in chess, and continued to captain the university chess team. However, the award of a Commonwealth Fellowship saw him go to the United States in\n1927\nto work under\nL E Dickson\nin Chicago. In\n1929\nhe published the paper\nThe minima of indefinite quaternary quadratic forms\nin the\nProceedings\nof the\nNational Academy of Sciences\n. This paper contains what is now known as the Oppenheim Conjecture. The conjecture concerns Diophantine approximation and solutions of real quadratic forms which are not multiples of a rational form. His work on these problems formed his doctoral thesis\nMinima of Indefinite Quadratic Quaternary Forms\nwhich earned him a Ph.D. in\n1930\n.\nFollowing the award of his doctorate, Oppenheim was appointed as a lecturer at the University of Edinburgh in Scotland. He held this position during the academic year\n1930\n-\n31\nbut then accepted the position of Professor of Mathematics at Raffles College in Singapore. He had married Beatrice Templer Nesbit in\n1930\n; they had one daughter. They had met in Chicago while Oppenheim was studying there for his doctorate. Oppenheim held his position in Singapore until\n1942\nwhen the Japanese invaded the country. The British had built a major military base in Singapore, completed in\n1938\n, realising that the Japanese would seek natural resources on the Malayan peninsula. With fears of war increasing, Oppenheim joined the Singapore Reserve Army having the rank of lance-bombardier. The Japanese invasion force landed in Malaya on\n7\nDecember\n1941\nand made rapid progress in taking control of the peninsula. The allied troops fell back until they were on Singapore island. On\n8\nFebruary\n1942\nthe Japanese crossed the Johore Strait and around\n80000\nallied forces, with Oppenheim among them, were penned inside a small area around Singapore city. In what is now considered as one of the greatest military debacles in British history, the commander surrendered unconditionally on\n15\nFebruary. Oppenheim's wife and daughter had managed to escape but Oppenheim was among the allied forces who were captured by the Japanese after the surrender\n[\n2\n]\n:-\nYet even the atrocious treatment accorded to prisoners of war failed to dim his spirits. Bitterness was foreign to his nature and he often warned that it is wrong to hold the Japanese nation collectively responsible for the actions of individuals, however brutal. In later years, watching television recreations of those times, he would sometimes shake his head and mutter, \"impossible: we all had such dysentery ...\" but that was all he said. He suffered considerably in the notorious Changi Camp but amazingly he and other captive scholars managed to establish a rudimentary \"POW University\". He was elected Dean by his fellow prisoners. Although they were desperately short of paper for assignments, Oppenheim and his colleagues succeeded in persuading an untypically sensitive Japanese officer, Lieutenant Okazaki, to allow the collection of books from Raffles College as a nucleus for a library. These efforts lent purpose to many in despair, even after the venture was disrupted by transfers, including Oppenheim whose health meantime deteriorated further, to construction camps along the Siam\n(\nThailand\n)\n-Burma Railway. Thoughts of his family, he once recalled, kept him alive.\nAfter Japanese control of Singapore ended in September\n1945\n, Oppenheim was able to return to Raffles College. Singapore became a British Crown Colony in\n1946\nand in\n1948\nthe Federation of Malaya was created which eventually\n(\nin\n1957)\ngained independence. Oppenheim was Deputy Principal of Raffles College from\n1947\nuntil\n1949\n. During this time he was active in planning to create the University of Malaya in Singapore and, in\n1949\n, he became Dean of the Faculty of Arts of the University of Malaya. In\n1957\nSir Sydney Caine resigned as Vice-Chancellor of the University of Malaya to become the Director of the London School of Economics and he proposed Oppenheim as his successor. At this stage Oppenheim became Vice-Chancellor of the University of Malaya, an entirely Singapore based institution, but, two years later, he became Vice-Chancellor of the University of Malaya with one campus in Singapore and another in Kuala Lumpur. In\n1962\nthese two campuses became independent universities and Oppenheim continued as Vice-Chancellor of the Kuala Lumpur University\n[\n1\n]\n:-\nUnder his stewardship, the university in the Malaysian capital underwent healthy development, with due attention being paid to both high teaching standards as well as research. New field of study were introduced, the most notable being medicine with the establishment of a medical faculty, complete with its teaching hospital. The student population rose rapidly, increasing from\n650\nin\n1962\nto about\n2000\nin\n1965\nwhen he retired. This steep rise in enrolment was perhaps not ideal for the university but was necessary to make good the past neglect of the colonial period. Although Oppenheim held the title of Vice-Chancellor of the University of Malaya from\n1957\nto\n1965\n, when he retired, he in fact held successively three different jobs. Each of these presented peculiar problems which called for, on the part of the principal academic and administrative officer, a high order of skill and diplomacy. The problems he faced in the Singapore period\n(1957\n-\n59)\n,\n[\nresulted from the fact that\n]\nthe territory was rapidly moving towards self-government ... The years from\n1959\nto\n1962\nfound him not much more than just a figurehead, reigning over two jealously autonomous institutions, each with a principal under its own council. From\n1962\non, he resumed the normal position of a Vice-Chancellor of an institution which in many respects differed from the previous one in Singapore, particularly in the form of its governance.\nYou can read extracts from\nOppenheim's\n1961\naddress\ngiven to students graduating from the University of Malaya.\nYou can read extracts from Oppenheim's article \"\nAsia in\n1984\n\" written in\n1964\nwhile he was Vice-Chancellor of the University of Malaya.\nAfter Oppenheim retired as Vice-Chancellor of the University of Malaya in\n1965\nhe spent a number of years as a Visiting Professor of Mathematics. He was at the University of Reading in England from\n1965\nto\n1968\n, at the University of Ghana from\n1968\nto\n1973\n. He was invited to take up the position of Head of Mathematics at the new University of Benin, Nigeria, in\n1973\n[\n2\n]\n:-\nAs always, Alexander Oppenheim remained fiercely loyal to his students and younger members of the faculties, but as local confidence developed, his wise opinions, for instance not to rush too soon into the effervescent early computer market, were not always heeded - at some cost to the young university. He was much liked by Nigerians and his wide experience, impeccable manners, and cool advice were generally widely appreciated. Even so, he began to weary of certain distinctly if not uniquely Nigerian administrative practices and in\n1977\npolitely declined to renew his contract.\nAfter this spell at the University of Benin, Oppenheim retired to Henley-on-Thames in England. In the year he retired there, in\n1977\n, he divorced his first wife. He remarried in\n1982\n, at the age of\n79\n, to Margaret Ng.\nWe have commented on Oppenheim's early mathematical contributions, particularly the important Oppenheim conjecture which was highly influential. He continued to produce interesting mathematical articles on number theory all his life, even during times when he had heavy administrative duties. Examples of his papers are\nRational approximations to irrationals\n(1941)\n,\nOn the representation of real numbers by products of rational numbers\n(1953)\n,\nOn indefinite binary quadratic forms\n(1954)\n,\nOn the Diophantine equation\nx\n3\n+\ny\n3\n+\nz\n3\n=\nx\n+\ny\n+\nz\nx^{3}+ y^{3}+ z^{3}= x + y + z\nx\n3\n+\ny\n3\n+\nz\n3\n=\nx\n+\ny\n+\nz\n(1966)\n,\nThe irrationality of certain infinite products\n(1968)\n,\nRepresentations of real numbers by series of reciprocals of odd integers\n(1971)\nand\nThe prisoner's walk: an exercise in number theory\n(1984)\n.\nOppenheim received many honours for his contributions to mathematics and to higher education. He was appointed an Officer of the Order of the British Empire in\n1955\n:-\n... for contributions to mathematics, education and human rights.\nHe was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1956\n, nominated by\nEdmund Whittaker\n,\nAlex Aitken\n,\nEdward Copson\nand\nRobert Rankin\n. He was knighted in the New Year's Honours list of\n1961\n. He received honorary doctorates from the University of Hong Kong\n(1961)\n, the University of Leeds\n(1966)\nand the University of Malaya. The citation for the honorary Doctor of Science he received from the University of Hong Kong begins:-\nIt is our good fortune as a University of the British Commonwealth situated in the Far East to have a companion, if also at times a rival, institution in this region whose academic habits we can understand and largely share. In spite of the great difference in age between ourselves and the University of Malaya\n(\nthey are very young indeed\n)\nit must be acknowledged that we are extremely good friends. Partly, no doubt, this is because we have many interests, and also a few problems, in common. But it is also due in great measure to the active co-operation and goodwill of individuals, such as Dr Alexander Oppenheim, Vice-Chancellor of the University of Malaya, whom we gladly welcome into our society today.\nOther honours included: election as an Honorary Member of the University of Malaya Students' Union, the Alumni Medal from the Chicago University Alumni Association, and the distinguished Malayan title\nSeri Maharaja Mangku Negara\n.\nHis hobbies included chess\n(\nmentioned above\n)\nand other board-games, card-games, and growing roses. He was keenly interested in politics and would enjoy walking.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Number Theory"
  ]
}