{
  "nome_completo": "Alfred Bray Kempe",
  "nome_curto": "Alfred Kempe",
  "ano_nascimento": "1849",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kempe/",
  "lugar_nascimento": "Kensington, London, England",
  "lugar_morte": "London, England",
  "biografia": "Alfred Kempe\nwas the third son of John Edward Kempe who was Rector of St James's Church in Piccadilly, London. Alfred attended St Paul's School which, at this time, stood in the churchyard of St Paul's Cathedral in the City of London. It was one of the leading independent schools in England and had a high academic reputation. At school he was also able to pursue his love for music. Kempe had a very fine counter-tenor voice and as a member of St Paul's School Choral Society he sang the treble parts as a young boy, while later in his school career he sang alto.\nHe was educated at Trinity College, Cambridge, as a Camden Exhibitioner, having won this award in his final year at St Paul's School. At Cambridge he became known as a superb singer, having a piano in his rooms in College to accompany himself when he practised his singing. His two loves of mathematics and music were cleverly caught by one of his fellow students who composed the following rhyme to describe Kempe's relationship with his piano:-\nMistress of humble tones and haughty,\nKempe calls me his piano-forte;\nHe plays me when a problem fails,\nAnd rises lighter from the scales.\nKempe was taught mathematics by\nCayley\nand graduated in\n1872\nwith distinction in mathematics and in the same year he published his first mathematical paper\nA general method of solving equations of the nth degree by mechanical means\n. Despite his love of mathematics and music, Kempe chose a profession which involved neither of these, becoming a barrister. He was called to the bar on\n17\nNovember\n1873\nand later became a Bencher of the Inner Circle in\n1909\nwhen he joined the Western Circuit. Both mathematics and music became hobbies to which he devoted much time. He married Mary Bowman in\n1877\n.\nSoon Kempe became an authority on ecclesiastical law and this led to him holding many Chancellorships. A Chancellorship is a lay office of legal advisor to an Anglican diocese, and Kempe held a number of these through his career: he was legal advisor to the diocese of Newcastle, Southwell, St Albans, Peterborough, Chichester, Chelmsford and finally the most important Chancellorship of all, namely that of the diocese of London to which he was appointed in\n1912\n. His expertise on ecclesiastical law led to him serving on many committees, for example he was Secretary of the Royal Commission on Ecclesiastical Courts from\n1881\nto\n1883\n. Lewis Dibdin, a legal colleague, wrote\n(\nsee\n[\n2\n]\n)\n:-\nHe was an admirable lawyer. His logical mind, coupled with real learning and knowledge of cases, made his opinions clear and sound. It was a pleasure to be associated with him in the consideration of legal questions. While his own arguments were easy to follow, it was equally easy to make him follow those of other people. As an opponent in Court he was not less satisfactory. Always courteous and rigidly fair, he could be relied on to put a winning case convincingly. He was not made for the rough and tumble of contentious advocacy. I think his amiable and refined temperament, rather revolted from it, and he was not at his best with a bad case. Probably the clarity of his mind made it difficult for him to argue a rotten point. It would be true to say that he so conducted his own side of a case as always to win the respect of an opponent, while if one had much to do with Kempe, respect inevitably ripened into a warm regard an affection.\nMost of Kempe's early contributions to mathematics were on linkages, involving applications of geometry. There were practical advantages in finding mechanisms which would allow straight lines to be traced. One obvious application is the piston of a steam engine which is linked so that it moves in an approximate straight line. At the time that Watt used this particular linkage for his steam engine it was thought that no linkage would allow an exact straight line to be traced but this, as Peaucellier showed, is not so and such a linkage was found. Tokarenko writes in\n[\n4\n]\n:-\nDescartes curves arise as a result of the motion of points or the mechanisms that describe them. But only in\n1876\ndid Kempe prove a theorem on the possibility of reproducing any plane curve of degree\nn\nn\nn\nby means of an articulated mechanism. In\n1926\nGersgorin, basing his work on Kempe's considerations and using the complex variable method, proved a more general theorem on the possibility of constructing similar mechanisms for an arbitrary algebraic function.\nKempe's work on straight line linkages was inspired by a lecture\nOn recent discoveries in mechanical conversion of motion\ngiven by\nSylvester\nin January\n1874\nat the Royal Institution. Kempe worked on the topic and presented a series of lectures at the Royal Institution on\nHow to draw a straight line: A lecture on linkages\nin\n1877\n. The lectures appeared in\nNature\nand Macmillan published a fifty-one page book with the same title which became a classic on the topic. Kempe begins his book with the following Introduction:-\nThe great geometrician\nEuclid\n, before demonstrating to us the various propositions contained in his Elements of Geometry, requires that we should be able to effect certain processes. These Postulates, as the processes are termed, may roughly be said to demand that we should be able to describe straight lines and circles. And so great is the veneration that is paid to the master-geometrician, that there are many who would refuse the designation of \"geometrical\" to a demonstration which requires any other construction than can be effected by straight lines and circles. Hence many problems - such as, for example, the\ntrisection of an angle\n- which can readily be effected by employing other simple means, are said to have no geometrical solution, since they cannot be achieved by straight lines and circles only.\nBut how do you draw a straight line? A circle is easy. In principle the method is perfect although in practice your pencil may be blunt. Creating a straight edge is as fraught with trial and error as making an engineer's surface table. How odd that\nEuclid\ndidn't notice how different it is from a circle. Until\n1874\nno-one in England knew of a method for drawing a straight line that was, in principle, perfect. The first solution was found by a French army officer called Peaucellier and was brought to England by\nProfessor Sylvester\nin a lecture at the Royal Institution in January\n1874\n.\nKempe published a false \"proof\" of the\nfour colour theorem\nin\n1879\nwhich stood until\nHeawood\nfound an error eleven years later. In fact Kempe is probably best known today for this wrong \"proof\" yet the obituary\n[\n2\n]\ncontains no reference to it. Clearly in\n1923\nthis error by Kempe was considered an embarrassment, something which the authors pretended never existed. Yet this is a totally false assessment of Kempe's paper, as has since been shown, for Kempe's 'proof' is the basis of the computer aided proof discovered\n100\nyears later. Perhaps we should indicate a little more fully why this is so. In fact Kempe introduced two fundamental ideas in his paper which were to provide the basis of the proof by\nKenneth Appel\nand Wolfgang Haken in\n1976\n.\nThis first of these ideas is the concept of\nunavoidability\n. This states that it is impossible to construct a map without it having at least one of four specified\n(\nunavoidable\n)\nconfigurations. These configurations consist of a region with two neighbours, one with three neighbours, one with four neighbours, and one with five neighbours. The second idea is the concept of\nreducibility\n. Kempe showed if a map\nM\nM\nM\nrequires at least five colours and\nM\nM\nM\ncontains a region with four or fewer neighbours, then there must be a map\nM\n′\nM'\nM\n′\nwhich requires five colours yet\nM\n′\nM'\nM\n′\nhas fewer regions than\nM\nM\nM\n. From this Kempe was able to prove that any map could be five coloured. His error in attempting to prove that a map can always be four coloured occurred when he tried to prove his reducibility criterion for a map containing a region with five or fewer neighbours. Kempe's short list of unavoidable configurations had to be extended and the\n1976\nproof analysed\n1\n,\n936\ndistinct cases with a computer to show that each was reducible.\nKempe was proposed for election to the\nRoyal Society\nin the year he published his \"proof\" of the four colour theorem. He was proposed by\nCayley\n,\nSylvester\nand others as someone:-\n... distinguished for his knowledge of and discoveries in kinematics.\nHe was elected a fellow of the\nRoyal Society\non\n2\nJune\n1881\nand in\n1897\nhe was elected to the Council of the\nRoyal Society\n. In the following year he became Treasurer of the Society and\n[\n2\n]\n:-\n... for twenty-one years took a leading share in the management of its affairs and in the promotion of its prosperity.\nHis contribution to the Society is described in detail in\n[\n2\n]\nbut we should mention his contribution to the successful control of the National Physical Laboratory by the Royal Society and his work in transferring this control to a Government department in\n1918\n. He worked closely with many Government Departments and his remarkable contributions were recognised when he was knighted in\n1912\n. He was also a member of the Royal Institution for fifty years and served on its Board of Management five times.\nIf Kempe's work on the four colour theorem is not mentioned in his obituary\n[\n2\n]\nthen it is reasonable to ask: what was considered his most important contribution to mathematics in\n1923\n? The answer is that\nMacMahon\n, who contributes to\n[\n2\n]\nthe description of Kempe's mathematical achievements, considered his\nMemoir on the theory of mathematical form\npublished in the\nPhilosophical Transactions of The Royal Society\nin\n1886\nto be his most important work. This work on the foundations of mathematics attempts to classify the different thought processes involved in mathematics and is of relatively little interest today.\nMacMahon\nalso writes in\n[\n2\n]\n:-\n[\nKempe\n]\nwrote several other papers mostly on algebra with particular laws, which all bear the impress of his ability to get down to bed rock in any subject that was occupying his mind. His legal training led him in all cases to lucid and exact statements. His mathematical work, though not large in quantity, was first-rate in quality. What he put forward for publication was his best, and he will always be remembered as a noteworthy contributor to the philosophy of mathematics.\nIn\n1893\nKempe's wife died and he married again four years later to a Miss White, the daughter of a Judge. Although he had no children with his first wife, with his second he had two sons and one daughter. Kempe was President of the\nLondon Mathematical Society\nfrom\n1872\nto\n1874\n. His Presidential address to the Society was on\nWhat is mathematics?\nIn this address he considered the answer to this question given by\nVenn\nand quoted that by\nDe Morgan\n:-\nSpace and time are the only necessary matters of thought, and thus form the subject matter of mathematics.\nHe also quoted that by\nBenjamin Peirce\n:-\nMathematics is the science which draws necessary conclusions.\nKempe did not find any of these definitions satisfactory since, he said, they did not help to push forward the boundaries of mathematical research. He suggested that the idea he had given in his theory of forms in\n1886\n, although not entirely satisfactory, nevertheless was the best he had been able to come up with. It used graph theory to visualise mathematical questions and, at least for him, did provide a framework for discovering new mathematical knowledge.\nGeikie describes Kempe's character in\n[\n2\n]\n:-\nIt is not easy to describe the personal charm which endeared Sir Alfred Kempe to all who came to know him. His modesty, urbanity and frankness were at once apparent; at the same time his sound sense, and the touch of humour or flash of wit with which he would often enliven a formal conversation, made him singularly attractive. The lasting affection of those who were privileged to enjoy his more intimate friendship was won by a combination of genial qualities, above all by the overflowing kindliness of his nature. His humility of mind and antipathy to anything like self-advertisement read a continual lesson to the ambitious. Thoroughness in all that he undertook was one of his most characteristic virtues. Not less conspicuous was the friendly readiness with which he put his wide knowledge and experience at the service of others. As scientific circles are not free from the irritability and combativeness that affect other coteries of man, Sir Alfred was again and again appealed to as the irresistible peacemaker.\nA similar description of his character in\n[\n1\n]\nreads:-\nHe had a fund of quiet humour and often threw oil on troubled waters by quaint comments or amusing anecdotes.\nFinally let us note that Kempe had one further interest which we have not yet mentioned, namely his love of the mountains. He enjoyed climbing the mountains of Switzerland, which he visited on nearly\n50\noccasions, for many reasons. Certainly the challenge of reaching difficult summits was one reason but he also loved the views, the grandeur of the scenery, the plants, and the whole atmosphere associated with climbing.\nKempe's health began to deteriorate in around\n1912\nand he began to wind down his extraordinarily busy life. In\n1919\nhe resigned his position as Treasurer of the\nRoyal Society\non health grounds. The President, Sir J J Thomson, expressed the feelings of the whole Society:-\nIt is difficult to find words adequately to express our indebtedness to him. By his sagacity, his long experience of the affairs of the Society, and his legal knowledge, he has rendered invaluable services in our councils and in directing the policy of our Society.\nGiving up some of his many duties seemed to give Kempe a few more years when his health did not deteriorate any further but in\n1922\nhe developed pneumonia which led to his death.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}