{
  "nome_completo": "Alfréd Haar",
  "nome_curto": "Alfréd Haar",
  "ano_nascimento": "1885",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Haar/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Szeged, Hungary",
  "biografia": "Alfréd Haar\n's parents were Emma Fuchs and Ignatz Haar. He was brought up in Budapest which at this time was a flourishing city. After the unification of Buda, Obuda and Pest in\n1872\n, thirteen years before Haar's birth, the city became not only the capital of Hungary but also a major centre for industry, trade, communications, and architecture. Most importantly for the young boy, he was growing up in a city which was a centre for education, and intellectual and artistic life.\nHaar attended the\nGymnasium\nin Budapest and, as might be expected, he was an outstanding student showing great potential for science. For most of his time at the Gymnasium Haar felt that chemistry was the subject for him but he also did outstanding work in mathematics. In\n1894\nthe school teacher Dániel Arany started editing the\nKözépiskolai Matematikai Lapok\n, a mathematical problem solving journal for secondary school students. Each issue of the\nKözépiskolai Matematikai Lapok\ncontained a number of selected exercises from mathematics and shortly thereafter from physics, as well as solutions to the past months' problems and a list of those pupils who had sent in correct solutions. Haar collaborated on the journal during his final years at the Gymnasium. In\n1903\n, his final year at the high school, he won first prize in the\nEötvös\ncontest in mathematics. This was a defining moment for him for only at this stage did he decide that he would give up his intention of studying chemistry at university and that he would instead pursue a university course in mathematics.\nHaar travelled to Germany in\n1904\nto study at Göttingen and there, after his undergraduate years, he undertook research under\nHilbert\n's supervision. He obtained his doctorate in\n1909\nwith an important dissertation entitled\nZur Theorie der orthogonalen Funktionensysteme\nⓉ\n(\nOn the theory of orthogonal function systems\n)\n. The main results of his thesis appeared in a paper which he published in\nMathematische Annalen\nin the following year. Haar asked a series of fundamental questions about systems of orthonormal functions on the interval\n[0\n,\n1]\n. Haar wrote: one wants to be able to determine sufficient conditions that a series of such functions is convergent; one wants examples of relatively sensible functions which do not converge in the pointwise or uniform sense; one wants to understand how summation methods may be used to overcome the problems of divergence; and one wants to know exactly when, if the series of partial sums of an orthogonal expansion of a function converges, its limit equals the original function. He examined the standard systems of orthonormal trigonometric functions and also orthonormal systems related to\nSturm\n-\nLiouville\ndifferential equations. He constructed what is now known as Haar's orthonormal basis to answer the question of divergence of continuous functions expanded as series of orthonormal systems of functions. The paper introduced to the mathematical world what are today called Haar wavelets, an orthogonal system of discontinuous functions admitting at most three values, which Haar had first introduced in an appendix to his doctoral thesis.\nHaar was appointed as a\nprivatdozent\nat the University of Göttingen immediately after completing his doctoral thesis, and he taught there  until\n1912\nwhen he returned to Hungary. He was appointed as an extraordinary professor at the Franz Josef Royal Hungarian University in Kolozsvár\n(\nwhich is now Cluj in Romania\n)\n, then in\n1917\nhe became an ordinary professor there being appointed to one of the two chairs of mathematics in the Faculty of Mathematics and Sciences. Of course World War I had broken out two years after Haar took up his extraordinary professorship in Kolozsvár, and times were very difficult in Hungary. Austro-Hungary was aligned to the Central Powers and during the first three years of the war over one million Hungarians died\n(\nin addition to two million Austrians\n)\nwhile, for those not fighting on the front, there were food shortages and high inflation. After capitulating on\n3\nNovember\n1918\n, Hungary sought a separate peace, independence from Austria, and proclaimed the country a republic. For a short while the country was ruled by a Communist Government but Romanian troops invaded the country and the government was overthrown. In\n1921\nthe Treaty of Trianon was signed which treated Hungary very severely. Its territory was reduced to only one third of its previous size. The terms of the Treaty meant that Kolozsvár was no longer in Hungary\n(\nit became part of Romania\n)\n, so the University there had to move within Hungarian borders. At first it was sited in Budapest for a temporary period of two years before it moved to Szeged, where there had previously been no university. The Department of Mathematics, consisting of the Mathematical Seminary and the Institute of Descriptive Geometry, began operating in Szeged. The department consisted of\nRiesz\n, Haar, Rudolf Ortvay\n(\nwho held the Chair of Mathematical Physics\n)\n, and\nTibor Radó\nwho had been appointed as Haar's assistant. There were no other assistants in the department at this time but István Lipka became Haar's assistant in\n1926\n.\nHaar, together with\nRiesz\n, rapidly made a major mathematical centre from the new university. With support from the Society of Friends of the Franz Josef University, they had founded the famous journal\nActa Scientiarum Mathematicarum\nin\n1930\n. Haar and\nRiesz\nwere the editors and the reputation of the journal was quickly established with mathematicians of the quality of\nJohn von Neumann\n,\nNorbert Wiener\n,\nGeorge D Birkhoff\n,\nHenri Cartan\n,\nAntoni Zygmund\n,\nGeorge Pólya\n,\nPaul Erdős\n(\nstill a student at the time\n)\npublishing a paper in the first volume. They also established the mathematical library again in\n1930\nand this received mathematics journals from many parts of the world given in exchange for the\nActa Scientiarum Mathematicarum\n.\nMost of Haar's work was in analysis. After the work of his thesis, which we gave some details of above, he went on to study\npartial differential equations\nwith applications to elasticity theory. He also wrote on\nChebyshev\napproximations of functions, linear inequalities, analytic functions, and discrete groups. Between\n1917\nand\n1919\nhe worked on the variational calculus, proving Haar's Lemma, and applying his results to problems like\nPlateau\n's problem\n[\n1\n]\n:-\nA multitude of papers by others show the influence this lemma exerted on the whole area of variational calculus.\nHaar is best remembered, however, for his work on analysis on groups. In\n1932\nhe introduced an invariant measure on locally compact groups, now called the Haar measure, which allows an analogue of\nLebesgue\nintegrals to be defined on locally compact\ntopological groups\n. His famous paper\nDer Massbegriff in der Theorie der kontinuierlichen Gruppen\nⓉ\n(\nThe concept of measure in the theory of continuous groups\n)\nappeared in the\nAnnals of Mathematics\nin\n1933\n. The concept of Haar was used by\nvon Neumann\n, by\nPontryagin\nin\n1934\n, and\nWeil\nin\n1940\n, to set up an abstract theory of commutative harmonic analysis. At first, however,\nvon Neumann\ntried to discourage Haar in seeking such a measure since he felt certain that no such measure could exist. The following celebrates Haar's achievement:-\nSaid a mathematician named Haar,\n\"Von Neumann can't see very far.\nHe missed a great treasure -\nThey call it Haar measure -\nPoor Johnny's just not up to par.\"\nHaar died in\n1933\nat the age of\n48\nyears, having been honoured two years earlier by election to the\nHungarian Academy of Sciences\n. In\n1975\nMikolás wrote the paper\n[\n8\n]\nin which he discussed the work of\nFejér\n,\nMarcel Riesz\n, Frigyes\nRiesz\n, and Haar. He looks at the question:-\nHow did the work of a few great mathematicians contribute to the present high level of analytical investigations, to their applications, and, in general, to the intensive mathematical life of today in Hungary?\nA memorial relief portrays Haar and\nRiesz\nin the National Pantheon in Cathedral Square, Szeged. It describes them as:-\n... the world-famous founders of the Szeged mathematical school.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}