{
  "nome_completo": "Alfred Pringsheim",
  "nome_curto": "Alfred Pringsheim",
  "ano_nascimento": "1850",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pringsheim/",
  "lugar_nascimento": "Ohlau, Lower Silesia (now Oława, Poland)",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Alfred Pringsheim\n's father was Rudolf Pringsheim and his mother was Paula Deutschmann. It was a Jewish family. Rudolf was rich, having made his money in the construction industry. Alfred grew up in Breslau where he became passionate about music, art and mathematics. He became an excellent pianist and his musical tastes were much influenced by Richard Wagner who, although much older than Pringsheim, became friendly with the talented young man.\nHaving studied mathematics in Berlin in\n1868\n, Pringsheim became a follower of\nWeierstrass\n's mathematics. Following the usual practice of German students he moved between different universities and after studying in Berlin he went to Heidelberg. After completing his undergraduate studies, Pringsheim undertook research at Heidelberg with Leo Königsberger as his thesis advisor.\nKönigsberger\nhad been appointed to a chair of mathematics at Heidelberg in\n1869\nand, having studied under\nWeierstrass\nhimself, was at this stage in his career concentrating his research on the theory of elliptic functions. This was a perfect match with Pringsheim's mathematical interests, and he was awarded his doctorate in\n1872\n.\nIn\n1877\nPringsheim submitted his\nhabilitation\nthesis to the University of Munich and began teaching there as a\nprivatdozent\n. Two years later, in\n1879\n, he married Hedwig Dohm. Hedwig's father was Ernst Dohm, a well known Berlin journalist, and her mother was Hedwig Schleh. Hedwig Dohm was an actress in Berlin before her marriage. Alfred and Hedwig had four sons, Erik, Peter, Heinz, and Klaus, and a daughter Katja. Klaus and Katja were twins; Klaus became a conductor, composer, music writer, while Katja studied physics and mathematics but agreed to give up her studies after marrying the famous writer Thomas Mann on\n11\nFebruary\n1905\nin Munich. Peter became a physics professor after studying under Nernst in Berlin.\nPringsheim worked at the Ludwig-Maximilians University of Munich for his whole career. He was promoted to extraordinary professor in\n1886\n, was elected to the Bavarian Academy of Sciences in\n1898\n, and became a full professor in\n1901\n(\nthe year in which his father died at the age of\n80)\n. Pringsheim retired in\n1922\n. Freudental writes in\n[\n1\n]\nthat Alfred and Hedwig Pringsheim made their:-\n... home into a centre of Munich's social and cultural life. The novelist Thomas Mann, who was his son-in-law, wrote a novel based on the Pringsheim family. Pringsheim's refined wit was famous. His sprightly Bierrede\n[\nbeer speech\n]\nwas the acme of the yearly meeting of the\nDeutsche Mathematiker-Vereinigung\nand was mentioned by mathematicians throughout the year. His puns were famous ... Pringsheim was a brilliant lecturer and conversationalist ...\nPringsheim was extremely well off; as well as having considerable financial resources, he owned an extremely valuable collection of Italian Majolica earthenware. However, he was a patriotic German and in order to support his country during World War I, he had purchased a considerable quantity of War loans. He lost a lot of money with the War loans as he did with the hyperinflation of the first few years of the\n1920\ns. Despite this he still had a mansion in the Arcisstrasse and his Majolica collection.\nFrom\n1933\nto\n1939\nhis life was made impossible as a non-Aryan. His house was taken away and he was forced to sell it to the Nazi party. It was not because the Nazis wanted to use the grand mansion for they demolished it and built a party headquarters on the site. In\n1938\nPringsheim was forced out of the Bavarian Academy of Sciences by the president Alexander Mueller. Also in\n1938\nhe was forced to adopt \"Israel\" as a middle name. In March\n1939\nthe German Ministry of Trade authorized export of Pringsheim's Majolica collection to London for auction at Sotheby's, provided that\n80\n% of the proceeds up to\n20\n,\n000\npounds and\n70\n% of the remainder be paid to the German Gold Discount Bank in foreign currency. Pringsheim was to receive the remaining proceeds. In exchange, Pringsheim and his wife were allowed to emigrate to Switzerland. The sale took place at Sotheby's, London, on\n7\nJune\n1939\n.\nBefore he left Germany to go to Zürich, Pringsheim gave to his friend\nCarathéodory\na present of a very rare text from\nJacob Bernoulli\nto his brother\nJohann Bernoulli\ncontaining the solution to the isoperimetric problem. Alfred and Hedwig Pringsheim moved to Zürich in\n1939\n. He died there two years later, his wife dying in the following year.\nPringsheim worked on real and complex functions. His work\n[\n1\n]\n:-\n... is characterised by meticulous rigour rather than by great ideas.\nHe gave a very simple proof of\nCauchy\n's integral theorem. He also has important results on the singularities of power series with positive coefficients. In\n1893\nhe proved that a function is analytic if it is infinitely differentiable on an open interval and the radius of convergence\nr\n(\nx\n)\nr(x)\nr\n(\nx\n)\nof the\nTaylor series\ncentred at\nx\nx\nx\nis bounded away from\n0\n. There was a problem with the  proof which was discovered and repaired much later by\nR P Boas\n.\nPringsheim criticised attempts by\ndu Bois-Reymond\nto establish ideal boundaries between convergence and divergence. He also suggested that the paradoxes of the infinitary calculus arose from transferring properties of real numbers to infinite-dimensional domains where they fail, and agreed with\nCantor\nthat any use of infinitesimals in analysis would necessarily lead to inconsistencies.\nAn interesting comment concerning Pringsheim appears in\n[\n7\n]\n. In\n1761\nLambert\nmade a first step in solving the old problem of squaring the circle by proving the irrationality of π. But the authors of many monographs and textbooks claimed that there was a gap in\nLambert\n's proof concerning the convergence of the continued fraction expansion of the tangent function. Pringsheim was the first to note in\n1898\nthat\nLambert\n's proof was absolutely correct and exceptional for its time, since the expansion of the tangent function was not only written down formally, but also proved to be a convergent\ncontinued fraction\n. Pringsheim did a lot of work on continued fractions: he introduced the term 'unconditional convergence' of a continued fraction and also gave what is now known as the Pringsheim criterion which ensures the convergence of a continued fraction in\n1898\n.\nA major work by Pringsheim was\nVorlesungen über Zahlen- und Funktionenlehre\nⓉ\n(\nLectures on arithmetic and function teaching\n)\nwhich appeared in five parts. Part\n1\nwas\nReelle Zahlen und Zahlenfolgen\nⓉ\n(\nReal numbers and number sequences\n)\nand appeared in\n1916\nas did Part\n2\nUnendliche Reihen mit reellen Gliedern\nⓉ\n(\nInfinite series with real members\n)\n. Part\n3\nwas entitled\nKomplexe Zahlen, Reihen mit komplexen Gliedern. Unendliche Produkte und Kettenbrüche\nⓉ\n(\nComplex numbers, series of complex terms. Infinite products and continued fractions\n)\nand was published in\n1921\n. Part\n4\nGrundlagen der Theorie der analytischen Funktionen einer komplexen Veränderlichen\nⓉ\n(\nFundamentals of theory of analytic functions of a complex variable\n)\nappeared in\n1925\nwhile Part\n5\nEindeutige analytische Funktionen\nⓉ\n(\nUnique analytic functions\n)\nappeared in\n1932\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}