{
  "nome_completo": "Rudolf Friedrich Alfred Clebsch",
  "nome_curto": "Alfred Clebsch",
  "ano_nascimento": "1833",
  "ano_morte": "1872",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clebsch/",
  "lugar_nascimento": "Königsberg, East Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Alfred Clebsch\n's parents were Ernst Friedrich Leopold Clebsch\n(1802\n-\n1863)\nand Pauline Ramberg\n(\ndied\n1864)\n. Ernst Clebsch's father, the paternal grandfather of the subject of this biography, was Johannn Friedrich Leberecht Clebsch\n(1759\n-\n1847)\n, a surgeon in the state of Colberg where he worked at the military hospital.\nClebsch attended the Altstädtisches\nGymnasium\nin Königsberg where he became friends with his fellow pupil\nCarl Neumann\n, the son of\nFranz Neumann\nwho was at this time professor of physics at the University of Königsberg. Clebsch graduated from the Altstädtisches Gymnasium and entered the school of mathematics at the University of Königsberg in\n1850\n. In this school, founded by\nCarl Jacobi\n, he was influenced by\nJacobi\nthrough his teachers\nOtto Hesse\nand Friedrich Julius Richelot\n(1808\n-\n1875)\nwho were both students of Jacobi. In fact although he never met\nJacobi\n, who died one year after Clebsch entered the University of Königsberg,\nJacobi\nwas to influence him both through these two teachers and also directly through the fact that Clebsch was to collaborate in the production of the\nCollected Works of Jacobi\n. At Königsberg, Clebsch was taught mathematical physics by\nFranz Neumann\n, the father of his friend. He undertook research for his doctorate advised by\nFranz Neumann\nand he was awarded the degree for his thesis\nDe motu ellipsoidis in fluido incompressibili viribus quibuslibet impulsi\nⓉ\n(\nThe motion of an ellipsoid in an incompressible fluid induced by any forces\n)\nwhich he presented to the University of Königsberg in\n1854\n. In this work he studied a problem in hydrodynamics.\nAfter graduating in\n1854\nClebsch went to Berlin where he taught at various secondary schools. This was a fairly common route into the academic profession at this time and Clebsch had every intention of seeking a university post. Consequently, he continued to undertake research and published a number of articles during his four years as a secondary school teacher. Articles which he submitted to Crelle's Journal in\n1854\n-\n58\nand which were published in that journal in\n1856\n-\n59\nwere:\nÜber die Bewegung eines Ellipsoids in einer tropfbaren Flüssigkeit\nⓉ\n(\nOn the motion of an ellipsoid in a liquid forming drops\n)\n(1856)\n;\nZusatz zu dem vorhergehenden Aufsatze\nⓉ\n(\nAddendum to the previous essay\n)\n(1857)\n;\nAnwendung der elliptischen Functionen auf ein Problem der Geometrie des Raumes\nⓉ\n(\nApplication of elliptic functions to a problem of the geometry of space\n)\n(1857)\n;\nÜber eine allgemeine Transformation der hydrodynamischen Gleichungen\nⓉ\n(\nOn a general transformation of hydrodynamic equations\n)\n(1857)\n;\nÜber die Reduction der zwei Variation auf ihre einfachste Form\nⓉ\n(\nOn the reduction of the two variations to their simplest form\n)\n(1858)\n; and\nÜber diejenigen Probleme der Variationsrechnung, welche nur eine unabhängige Variable enthalten\nⓉ\n(\nOn those problems of variational calculus, which contain only one independent variable\n)\n(1858)\n. He also published\nÜber die Criterien des Maximums und des Minimums in der Variationsrechnung\nⓉ\n(\nOn the criterion for the maximum and the minimum in the calculus of variations\n)\nin the journal\nMonatsberichte der Berliner Akademie\nin\n1857\n.\nHis first academic appointment was in\n1858\nwhen he was appointed to the University of Berlin. He left after a short spell and, still in\n1858\n, he took up an appointment at the Polytechnischen Schule in Karlsruhe. However, once he knew that he was able to enter the academic profession he was able to marry. His wife was Dorothe Charlote Mathilde Heinel\n(1838\n-\n1866)\n, the daughter of the Priest Heinel in Marienburg. Alfred and Dorothe Clebsch had four sons: Ernst Friedrich Alfred Clebsch\n(1859\n-\n1945)\n; Arthur Friedrich Alfred Clebsch\n(1860\n-\n1931)\n; Eduard Friedrich Alfred Clebsch\n(1861\n-\n1895)\n, who became a medical doctor in Ems; and Alfred Friedrich Clebsch\n(1864\n-\n)\n, who became a trader in Bremen in the firm Clebsch and Schünemann, Tobacco merchants.\nNow as we mentioned above, Clebsch's doctoral dissertation at Königsberg was on hydrodynamics and most of the papers he wrote while a school teacher were on topics mainly concerned with hydrodynamics and elasticity. The Polytechnischen Schule in Karlsruhe where he taught had been founded in\n1825\nand was mainly involved in training engineers and architects. To the Polytechnischen Schule, Clebsch brought many new ideas, perhaps the most significant of which was the establishment of the mathematical colloquia. He worked in Karlsruhe from\n1858\nto\n1863\nbut before he left Karlsruhe the direction of his research had changed. Even before his appointment at Karlsruhe there had been signs of Clebsch moving towards pure mathematics with his work on the\ncalculus of variations\n. The end of his work on topics in mathematical physics is perhaps most clearly defined by the publication of\nTheorie der Elastizität fester Körper\nⓉ\n(\nTheory of elasticity of solid bodies\n)\nin\n1862\nwhich was a major work on elasticity. In it he\n[\n1\n]\n:-\n... treated and extended problems of elastic vibrations of rods and plates.\nPure mathematics became Clebsch's main research topic when he began to study the calculus of variations and\npartial differential equations\n. Clebsch moved to the University of Giessen in\n1863\nand there he collaborated with\nPaul Gordan\n. Their joint work culminated in a major work on\nabelian function\nTheorie der Abelschen Funktionen\nin\n1866\n. The Clebsch-\nGordan\ncoefficients used in spherical harmonics were introduced by them as a result of this cooperation. Clebsch proved himself an outstanding teacher and combined his teaching skills with his research skills in building a school of\nalgebraic geometry\nand\ninvariant theory\nat Giessen which included\nPaul Gordan\n,\nAlexander Brill\n,\nMax Noether\n,\nFerdinand von Lindemann\nand\nJacob Lüroth\n.\nIt was\nOtto Hesse\nwho had advised Clebsch to investigate the algebraic geometry of\nCayley\n,\nSylvester\nand\nSalmon\nand he was particularly attracted to the contributions that\nAronhold\nhad made to their theories. Clebsch went back to\nAbel\n's approach to algebraic geometry and, rather than the geometric approach of\nRiemann\n. he adopted an algebraic approach. His interpretation of the works of\nCayley\n,\nSylvester\nand\nSalmon\nin this way led Clebsch to a brilliant new interpretation of\nRiemann\n's function theory. Felix Klein writes\n[\n2\n]\n:-\nAs the first achievement of Clebsch we must set down the introduction into Germany of the work done previously by\nCayley\nand\nSylvester\nin England. But he not only transplanted to German soil their theory of invariants and the interpretation of projective geometry by means of this theory; he also brought this theory into live and fruitful correlation with the fundamental ideas of\nRiemann\n's theory of functions.\nClebsch's work on algebraic geometry\nÜber die Anwendung der Abelschen Functionen in der Geometrie\nⓉ\n(\nOn the use of Abelian functions in geometry\n)\n(1864)\nwas published in\nCrelle\n's Journal and is described by\nIgor Shafarevich\nin\n[\n5\n]\nas the:-\n... birth cry of modern algebraic geometry.\nThe authors of\n[\n3\n]\ndescribe some of the ideas in this paper:-\nClebsch proved the converse of\nAbel\n's theorem and derived many fundamental properties of algebraic curves by utilising function-theoretic methods developed by\nJacobi\nand\nRiemann\n. These techniques enabled him to rederive with relative ease a number of results that had cost geometers like\nJacob Steiner\nand\nOtto Hesse\na great deal more effort.\nAgain we quote from\nFelix Klein\n[\n2\n]\nwhere he explains how Clebsch looked at\nRiemann\n's ideas in a different way:-\nRiemann\n's celebrated memoir of\n1857\npresented the new ideas on the theory of functions in a somewhat startling novel form that prevented their immediate acceptance and recognition. He based the theory of the Abelian integrals and their inverses, the Abelian functions, on the idea of the surface now so well known by his name, and on the corresponding fundamental theorems of existence. Clebsch, by taking as his starting-point an algebraic curve defined by its equation, made the theory more accessible to the mathematicians of his time, and added a more concrete interest to it by the geometrical theorems that he deduced from the theory of Abelian functions.\nIn\n1868\nClebsch was appointed to the University of Göttingen. The authors of\n[\n3\n]\nwrite:-\nBy\n1868\n, when Clebsch accepted the chair formerly held by\nRiemann\nat Göttingen, he and his entourage of students were turning out so much new material on algebraic geometry and invariant theory that they began making plans for the inauguration of a new journal designed to give their work more visibility.\nShortly after arriving in Göttingen, together with\nCarl Neumann\n, the son of his former teacher at Königsberg, he co-founded\nMathematische Annalen\n, a mathematics journal of major importance. The first volume appeared in print in\n1869\n; the first part of this first volume contained papers by\nHeinrich Weber\n,\nJacob Lüroth\n,\nPaul Gordan\n(2\npapers\n)\n,\nKarl Geiser\n, and Ernst Christian Julius Schering.\nIn fact it was in\n1868\nthat Clebsch made the contribution that\nKlein\nconsidered the most significant\n[\n2\n]\n:-\nLet us now turn to that side of Clebsch's method which appears to me to be the most important, and which certainly must be recognised as being of great and permanent value; I mean the generalisation, obtained by Clebsch, of the whole theory of Abelian integrals to the theory of algebraic functions with several variables. By applying the methods he had developed for functions of the form\nF\n(\nx\n,\ny\n)\n=\n0\nF(x, y) = 0\nF\n(\nx\n,\ny\n)\n=\n0\n, or in homogeneous coordinates,\nf\n(\nx\n1\n,\nx\n2\n,\nx\n3\n)\n=\n0\nf (x_{1}, x_{2}, x_{3}) = 0\nf\n(\nx\n1\n​\n,\nx\n2\n​\n,\nx\n3\n​\n)\n=\n0\n, to functions with four homogeneous variables\nf\n(\nx\n1\n,\nx\n2\n,\nx\n3\n,\nx\n4\n)\n=\n0\nf (x_{1}, x_{2}, x_{3}, x_{4}) = 0\nf\n(\nx\n1\n​\n,\nx\n2\n​\n,\nx\n3\n​\n,\nx\n4\n​\n)\n=\n0\n, he found in\n1868\n, that there also exists a number p that remains invariant under all rational transformations of the surface f =\n0\n. Clebsch arrives at this result by considering double integrals belonging to the surface. It is evident that this theory could not have been found from\nRiemann\n's point of view.\nIt was just after Clebsch had produced these new ideas that\nFelix Klein\narrived in Göttingen to undertake postdoctoral work with him. The ideas being developed in Clebsh's school had a highly significant influence on\nKlein\n. Clebsch's ideas were being rapidly extended by the other talented members of his school. After spending eight months working in Göttingen,\nKlein\nspoke to Clebsch about broadening his horizons and spending a semester in Berlin. Clebsch strongly advised him not to go to Berlin and\nKlein\nrealised that there were serious tensions between the Göttingen school and the one in Berlin. However, he went against Clebsch's advice and spent a semester to Berlin.\nSadly Clebsch's brilliant career came to a sudden end in\n1872\nwhen he died of diphtheria.\nMax Noether\nand\nAlexander Brill\n, who were members of his school at Giessen, continued his work on curves. Two volumes of his lectures on geometry were published after his death in\n1876\nand\n1891\n. A second edition of part of one of these volumes, with Clebsch as joint author, was published in three parts in\n1906\n,\n1910\nand\n1932\n.\nW Burau, writing in\n[\n1\n]\n, makes the following comments about Clebsch's work:-\n... Clebsch described the plane representations of various rational surfaces, especially that of the general cubic surface. Clebsch must also be credited with the first birational invariant of an algebraic surface, the geometric genus that he introduced as the maximal number of double integrals of the first kind existing on it.\nFinally we give the assessment of Clebsch from the authors of\n[\n3\n]\n:-\nClebsch had been a model teacher, combining mathematical genius with an ability to inspire and encourage gifted students. Had he lived longer, he might easily have become the dominant figure of his generation, and the whole framework for mathematics in Germany might have evolved differently. Under his leadership, concrete plans had already been made for the creation of a German mathematical society, but after his death, this effort gradually lost momentum.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}