{
  "nome_completo": "Alfred Theodor Brauer",
  "nome_curto": "Alfred Brauer",
  "ano_nascimento": "1894",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brauer_Alfred/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Chapel Hill, North Carolina, USA",
  "biografia": "Alfred Brauer\n's father was Max Brauer who was a well-off businessman in the wholesale leather trade. Max Brauer's wife was Lilly Caroline and Alfred was the oldest of their three children. He had a younger, and more famous, brother\nRichard Brauer\n, who also has a biography in this archive. Alfred Brauer was seven years older than Richard and of an age between the two brothers was Alfred's sister Alice. The Brauers were a Jewish family and they would live through a period in German history when to be non-Aryan brought great hardships and suffering.\nWorld War I was a difficult time for Alfred Brauer and had he not had a great determination he would never have overcome the almost impossible odds against him making a career in mathematics. He was\n20\nyears of age at the outbreak of the war and he served for four years in the German army. He was seriously wounded during the war and effectively lost seven years at what is for most mathematicians the most crucial time in their development.\nBrauer was back studying at the University of Berlin after World War I. In\n1920\nhe attended\nSchur\n's seminar along with his brother\nRichard Brauer\nso by this stage Alfred, although seven years older than his brother, was at much the same stage in his education.\nSchur\nheld weekly problem hours, and in these sessions he would give the students difficult problems most of which\nFrobenius\nor\nSchur\nhimself had solved, but occasionally he gave the class an open problem which he did not know how to solve. In\n1921\nAlfred, working with his brother Richard, solved one of\nSchur\n's open problems and this would set both brothers on their way as researchers.\nIn\n1928\nBrauer's dissertation, written under\nSchur\n's guidance at the University of Berlin, was published and he began to teach at the University. From his first publication in\n1925\nonwards he produced a string of impressive works in\nnumber theory\n. He was also involved in building up the library at the mathematical institute in Berlin and in this he played a role of major importance in the development of mathematics in Berlin. However the successful start to his career, delayed as it had been by World War I, was soon to change in a very unfortunate way.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which exempted non-Aryans who had fought for Germany in World War I. Brauer certainly qualified under this clause and this allowed him to keep his lecturing post in Berlin in\n1933\n.\nBrauer had been one of the organisers of the Mathematisch-physikalische Arbeitsgemeinschaft which was an organisation for students in the University of Berlin who held views at odds with the extreme right views of many of the other students. This organisation was disbanded by the Nazis in\n1933\nand replaced by a student organisation which supported the Nazis and their policies. The exemption clause saw Brauer able to hold his lecturing post until\n1935\nbut he was dismissed in that year despite the exemption clause in the Civil Service Law which was simply disregarded after decisions at the Nuremberg party congress in the autumn of\n1935\n.\nThe situation for those of Jewish background steadily deteriorated. Jewish students lost the right to graduate from the universities in\n1937\n. In\n[\n1\n]\nBrauer describes the events following\nEdmund Landau\n's death:-\nWhen\nLandau\ndied in February\n1938\n,\nSchur\nwas supposed to give an address at his funeral. For that reason he was in need of some mathematical details from the literature. He asked me to help him in this matter. Of course I was not allowed to use the library of the mathematical institute which I had built up over many years. Finally I got an exemption for a week and I could use the library of the Prussian Staatsbibliothek for a fee. ... So I could answer at least some of\nSchur\n's questions.\nBrauer was still in Berlin hoping to be allowed to emigrate in\n1938\nbut there were problems on all sides.\nHopf\nwrote to\nRichard Brauer\n, already in the United States in\n1938\n:-\nThe US Consulate in Berlin declared that\n[\nAlfred Brauer\n]\ncould not receive the so-called 'professor visa'\n(\nwith which one can immediately enter the US\n)\nand that according to law it was only for people who were in an academic position during the last two years and that he hadn't been in such a position!!\nAlfred Brauer did succeed in obtaining permission to enter the United States and temporary employment was organised for him by the Emergency Committee in Aid of Displaced German Scholars in New York. We should note in passing that the driving force behind that committee who was responsible for saving Brauer\n(\nand many other German academics\n)\nwas the American Stephen Duggan. He committed suicide in\n1950\nwhen he was being investigated during the McCarthy period because of his many connections with foreigners through working for the Emergency Committee.\nBrauer left Germany in\n1939\n, but Brauer's sister Alice stayed behind and was murdered in a concentration camp by the Nazis. Another who had helped arrange for Brauer to go to the United States was\nWeyl\n. When Brauer reached the USA he went to the Institute for Advanced Study in Princeton as\nWeyl\n's assistant. His experience in building up the library of the mathematical institute in Berlin was put to good use in Princeton where he built up the first mathematics library at the Institute for Advanced Study.\nWeyl\nwrote to\nBernays\nin\n1940\n:-\nAlfred Brauer is my assistant, and he is proving very helpful in the building up of a new library ... in our new quarters ...\nBrauer remained at the Institute for Advanced Study until\n1942\n, but during these three years he also lectured at New York University. In\n1942\nhe moved to the University of North Carolina, Chapel Hill, and later built up the mathematics library there to a very excellent one now named the \"Alfred T Brauer Library\". The authors of\n[\n2\n]\ndescribe his years at Chapel Hill:-\nDuring the span of nearly a quarter of a century, beginning in\n1942\n, Alfred Brauer taught with a dedication that honours the teaching profession at the University of North Carolina, Chapel Hill. His extra-help sessions and incredibly long hours working with students in his office helped make him a truly beloved teacher. It almost defies the imagination that Professor Brauer found enough hours in the day to spend the time that he did with his students, spend time at home with his wife Hilde and two daughters ..., and still authored\n65\npapers ... during these years.\nBrauer made major contributions to number theory, for example on the non-existence of odd\nperfect numbers\nof certain forms, and the\nKhinchin\nconjecture which was later proved and extended by Henry B Mann. He gave bounds for the least\nquadratic residues\nmodulo a prime, and for the least\nprimitive root\nfor a prime.\nHe became interested in research in\nmatrix theory\nafter standing in for a colleague and giving his matrix theory course in\n1946\n. He studied, for example, the location of\ncharacteristic roots\nusing ovals of\nCassini\n, publishing his first results on this in\n1947\n. From the late\n1950\ns Brauer published a series of papers on nonnegative matrices, a topic studied by\nFrobenius\ntowards the end of his career. Brauer also published results on stochastic matrices and tournament matrices.\nBrauer retired at age\n70\nfrom the University of North Carolina and then taught for eight more years at Wake Forest University. One of his students at Wake Forest wrote\n[\n2\n]\n:-\nProfessor Brauer's teaching had an enormous influence on all of his students because of his personal interest in them and his great love for mathematics. Every student he taught benefited from his constant encouragement, his positive approach to learning and, especially, from his determination to challenge each of them to exceed his grasp. His lectures were stimulating and in his seminars and private sessions with individual master and doctoral students he guided them in their search for new results and shared with them the pleasure of discovery.",
  "math_areas": [
    "Number Theory"
  ]
}