{
  "nome_completo": "Alfred Hoblitzelle Clifford",
  "nome_curto": "Alfred Hoblitzelle Clifford",
  "ano_nascimento": "1908",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clifford_Alfred/",
  "lugar_nascimento": "St Louis, Missouri, USA",
  "lugar_morte": "New Orleans, Louisiana, USA",
  "biografia": "Alfred Hoblitzelle Clifford\n, known as Al Clifford to fellow mathematicians, was born in St Louis, Missouri, but was brought up in California where his family moved when he was young. He attended Yale University, graduating in\n1929\nwith a degree in mathematics but\n[\n4\n]\n:-\nAn accomplished pianist, he tried his hand at composition while at Yale ...\nClifford then went to the California Institute of Technology where he undertook research for a doctorate. His advisors were\nE T Bell\nand Morgan Ward. It was with\nBell\n's advice that he wrote his first paper\nA system arising from a weakened set of group postulates\nin\n1932\n. It was published in the\nAnnals of Mathematics\nin the following year.\nPreston\nwrites that it\n[\n6\n]\n:-\n... must have appeared at the time to its author as an incidental piece of work, discussing a possible ambiguity in the formulation of the axioms for groups. In fact it turned out to be a remarkably fruitful start for the structure theory of semigroups.\nIn\n1933\nClifford was awarded his doctorate for his dissertation entitled\nArithmetic of Ova\n. In this work he considered the arithmetic and ideal theory of abstract multiplication. He later extended the work of his thesis and published the two papers\nArithmetic and ideal theory of abstract multiplication\n(1934)\nand\nArithmetic and ideal theory of commutative semigroups\n(1938)\n. The first is essentially an abstract of his thesis while the second is an extended version containing deeper results which have arisen during the intervening years. After the award of his doctorate, Clifford became a member of the Institute for Advanced Study in Princeton. He remained there for five year and during this period, from\n1936\nto\n1938\n, he was\nWeyl\n's assistant. This was the time when\nWeyl\nwas writing\nThe classical groups\nand he wrote in the Preface:-\nIf at least the worst blunders of expression have been avoided, this relative accomplishment is to be ascribed solely to the devoted collaboration of my assistant, Dr Alfred H Clifford, and even more valuable to me than the linguistic, were his mathematical criticisms.\nWeyl\n's influence is clearly seen in Clifford's two papers in\n1937\nRepresentations induced in an invariant subgroup\n. In these he considered the representation induced on a normal subgroup by an irreducible representation of the group. In\n1938\nhe was appointed as an Instructor in Mathematics at the Massachusetts Institute of Technology, being promoted to Assistant Professor in\n1941\n. Rhodes writes\n[\n7\n]\n:-\nIt was during the writing of paper 'Semigroups admitting relative inverses' in\n1941\n, after moving to M.I.T. as an assistant professor, a paper famous in the semigroup community about union of groups semigroups, that Clifford learned about\nRees\n's Theorem determining the structure of completely\n0\n-simple semigroups, generalizing the Wedderburn theory of rings.\nRees\n's theory generalized much earlier results of Suschkiewitsch unknown to Clifford until\n1941\n. The impact was profound, first because\n[\nClifford's first paper\n]\nwas a special case\n(\nin fact of the Suschkiewitsch paper\n)\n, second, its application to paper 'Semigroups admitting relative inverses' in hand, where Clifford proved S is a union of groups if and only if S is a semilattice of completely simple semigroups\n(\nto which\nRees\nstructure theorem applies\n)\n, and finally because of its intrinsic beauty and importance.\nIn the spring of\n1942\nhe was called up for active duty to serve his country in World War II\n[\n4\n]\n:-\nIn the same year he married Alice Colt, an accomplished linguist who later served in the office of Strategic Services. Their first son, Harry, who was to die tragically in a motor car accident at the age of sixteen, was born in\n1943\n. Clifford served with distinction for four years, in the European theatre and again in Washington. Upon returning to inactive duty as a Lieutenant Commander, he took up a post as an associate professor at the Johns Hopkins University.\nAfter his period of active duty had ended, Clifford was appointed as an associate professor at Johns Hopkins University. Of course he had been unable to undertake mathematical research while on active duty and he published no papers between\n1942\nand\n1948\n. Once he had returned to an academic life at Johns Hopkins he began again to produce important papers on semigroups. However the Korean War saw Clifford return to active duty in\n1950\nand he served until\n1952\nwhen he returned to Johns Hopkins. Rhodes writes\n[\n7\n]\n:-\n... it was at this time that Clifford read\nJ A Green\n's paper on the structure of semigroups introducing the J, L, R and D relations. The influence of this paper on Clifford was immense and quite profound. In the beginning he found it difficult to comprehend, especially the D relation. Clifford's\n1953\npaper 'A class of d-simple semigroups' on d-simple semigroups was his first reaction to\nGreen\nand was really about inverse d-simple\n(\none D class, and remember\nGreen\nintroduced D\n)\nsemigroups.\nPreston\nwas just in the stage of formulating modern inverse semigroups and the idea of inverse semigroups was \"in the air\".\nIn\n1955\nClifford left Johns Hopkins and moved to New Orleans when he was appointed as Head of Mathematics at Sophie Newcomb College of Tulane University. He remained at Tulane for the rest of his career.\nPreston\nwrites\n[\n5\n]\n:-\nI spent the years\n1956\n-\n58\nin New Orleans at the invitation of Al Clifford ... Clifford and I drew up our plans and completed first drafts of several chapters of our two-volume treatise on semigroups during these two years. It proved the major mathematical task I have undertaken. The collaboration was a stimulating and happy one.\nThe first volume of Clifford and\nPreston\n,\nThe algebraic theory of semigroups\n,  was published in\n1961\n. Schwarz, in a review of the volume, writes:-\nThis is a well-arranged book furnishing a reasonably comprehensive account of a new field developed by a large number of algebraists very rapidly in the last twenty years. The book under review is the first volume; the second one will follow in the near future. After the book of\nE S Lyapin\n, 'Semigroups'\n(\nRussian\n)\n(1960)\nthis is the second book on the subject in the last eighteen months. Before, there has been no systematic treatment on semigroups at all, with the exception of the book of Suchkewitsch, 'The theory of generalized groups'\n(1937)\ncontaining naturally a very limited number of results. The book under review and that of\nLyapin\nwere written at about the same time. As to the results they overlap, of course, at many places, but in the presentation and the emphasis on problems there are frequent differences. ... This excellent and clearly written book will be very useful both for study and orientation and for reference in further work.\nVolume II of Clifford and\nPreston\n,\nThe algebraic theory of semigroups\nwas published in\n1967\n. Schwarz again wrote a review:-\nVolume II has been eagerly awaited by those who are working in semigroup theory and related subjects\n(\ne.g., automata theory\n)\n. This volume ... deals with additional branches of the theory to which there was at most passing reference in Volume I. The manuscript was finished in\n1963\n, but notes on developments up to\n1967\nare included. ... The book as a whole is an excellent achievement. It is clearly written, contains all known main results to date, and will undoubtedly remain a source book for many years for all workers in this field.\nThese two volumes have had an enormous impact on the development of semigroup theory. Miller writes in\n1974\n[\n4\n]\n:-\nClear in exposition, broad and deep in its coverage of the field, the book has had, and continues to have, a profound influence on the development of the theory of semigroups.\nRhodes describes Clifford's research following the publication of the second volume of 'Clifford and\nPreston\n' in\n[\n7\n]\n:-\nBy the very late\n60\n's Clifford became interested in\nB\nn\nB_{n}\nB\nn\n​\n, the semigroup of all binary relations on a finite set with\nn\nn\nn\nelements, and reproved the Montague-Plemmons-Schein result that any finite group G was a maximal subgroup of\nB\nn\nB_{n}\nB\nn\n​\nfor some\nn\nn\nn\n. This appeared in the first volume of Semigroup Forum, a mathematics journal which Clifford founded with Hoffman and Mostert in\n1970\n(\nit continues to be published by Springer-Verlag\n)\n. ... he also continued his attack on the structure of bisimple-inverse semigroups\n(\nwith Reilly\n)\nand bisimple orthodox semigroups as ordered pairs. In\n1974\n, at the International Congress of Mathematicians in Vancouver, Clifford spoke on orthodox semigroups which are the union of groups.\nIn the mid\n70\n's Clifford became very excited by the work of Nambooripad on the structure of regular semigroups in terms of their idempotent ordering and \"sandwich matrices\" and wrote several expository papers on Nambooripad structure theorem for regular semigroups. Clifford's final research, published in\n1979\n, was influenced by universal algebra and concerned determining the structure of the free complexity regular\n(\naka a \"union of groups\"\n)\nsemigroup on a set.\nPreston\nsums up Clifford's contribution\n[\n6\n]\n:-\nHe has produced significant results in group theory and semigroup theory. Many of his results are of fundamental importance and, especially in semigroup theory, he initiated many techniques and approaches that are peculiar to, and are now part and parcel of, the theory.\nAfter he retired, Clifford left New Orleans and returned to live in California. He enjoyed playing bridge, but also decided that he wanted to teach himself quantum mechanics. In early December\n1992\nClifford suffered a stroke. He died later that month. Tulane University had given Clifford a Doctor of Science honoris causa in\n1982\n. After his death they paid tribute to him saying that he:-\n... gave to this institution to the fullest as a scholar, as a teacher, and as a benefactor.",
  "math_areas": [
    "Algebra"
  ]
}