{
  "nome_completo": "Ali Moustafa Mosharrafa",
  "nome_curto": "Ali Moustafa Mosharrafa",
  "ano_nascimento": "1898",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mosharrafa/",
  "lugar_nascimento": "Damietta, Egypt",
  "lugar_morte": "Cairo, Egypt",
  "biografia": "Ali Moustafa Mosharrafa\nwas the son of Mustafa Attia Mosharrafa, a religious scholar who was a follower of Gamal Al-Din Al-Afghani and Mohammed Abdou. This meant that Ali Moustafa and his four younger siblings Nafisa, Mustafa, Attia and Hassan were brought up with strong religious beliefs in the Quran. This early influence continued throughout his life and he saw science as intimately related to the presence of God. Let us note that most sources give the family name as Mosharafa with a single \"r\" but he certainly published his papers under the name Mosharrafa with \"rr\" so we will use that version.\nIn later life Ali Moustafa felt that his upbringing had robbed him of his childhood. He said:-\nI was a child yet I was to be a child in the forefront, and I lost my childhood which should have been all joy. I learned at that age that playing was a waste of time - as my mother used to say - I learned reverence and silence at the age of fun and laughter, I would consider even running a departure from reverence.\nAli Moustafa was born in the Mazloum district of Damietta and the first years of his childhood were spent in Raghad and Bala. His early education was from his father, who was a wealthy landowner and a well-educated man, and then he studied at the Ahmad al-Kutbi school. His life changed dramatically in\n1907\nwhen Egypt suffered a financial crisis, particularly affecting the cotton industry. Mustafa Attia lost his fortune in the cotton crisis, he lost his land, his money and even his home.\nAli's father Mustafa Attia died on\n8\nJanuary\n1910\nwhen Ali was eleven years old and one month later he took his primary school examinations and was awarded his primary certificate being ranked first nationwide. The death of Ali's father, which in\n[\n1\n]\nis claimed to have been suicide resulting from the cotton crisis, left him responsible for his mother, sister and his three younger brothers. The family moved to Cairo where they lived with Ali's maternal grandmother in a rented apartment in the Abdeen neighbourhood. Mosharrafa spent a year studying at the Abbasiya High School in Alexandria, where he was in the free section for those unable to afford the fees. After this year he moved to the Saidieh Secondary School in Gisa, constructed in\n1908\nas part of Egypt's modernisation programme, where again he received free education.\nHe was the youngest student in his class, but the most knowledgeable and his teachers showed him great respect realising that he was an exceptionally profound thinker. He was awarded the first part of the Secondary Certificate in\n1912\nand the second part, the Baccalaureate, in\n1914\nbecoming at age\n16\nthe youngest student to be awarded such a certificate up to that time. In addition to being the youngest student to be awarded the Baccalaureate, his performance ranked him second in the whole of Egypt.\nAlthough Cairo University was founded in\n1908\n, named at that time the Egyptian University, it taught a limited number of subjects and was funded by private citizens. It was re-founded in\n1925\nas a state institution but when Mosharrafa qualified with his Baccalaureate in\n1914\nit had nothing to offer in terms of mathematics, the subject that he was keen to pursue. There was the Cairo School of Engineering and it took students who showed some mathematical abilities but its standards were low and the best students entered the School of Law. These options did not attract Mosharrafa so he enrolled in the Teachers' College where at least some mathematics was taught. He graduated in\n1917\nbut his performance in mathematics had been so outstanding that the Egyptian Ministry of Education awarded him a scholarship to go to England to study for a B.Sc.\nMosharrafa felt that he was responsible for his siblings, but his sister Nafisa no longer needed that support since she married a soldier named Mohammed Bek. Before agreeing to travel to England, Mosharrafa saw that his three younger brothers Mustafa, Attia and Hassan were all enrolled at boarding schools. It is worth noting at this point that Mustafa became a professor of English language and literature at Cairo University, Attia became the Director of the Cairo University Library, and Hassan became a Director of Traffic. Seeing that his siblings were all doing well, Mosharrafa travelled to England and matriculated at the University of Nottingham in the autumn of\n1917\n.\nWhen Mosharrafa was in the middle of his studies at Nottingham, in\n1919\n, a revolution broke out in Egypt against British colonial rule led by Saad Zaghlul as head of the Wafd Party. Mosharrafa had a friend, Mahmoud Fahmy El Nokrashy\n(1888\n-\n1948)\nwho was a leading member of the Wafd Party. Mosharrafa wrote to El Nokrashy saying he wanted to return to Egypt and give his support to the revolution. El Nokrashy wrote back telling Mosharrafa:-\nThe world needs you more than we need you. Better that you serve Egypt in the universities of England, than you serve on the streets of Egypt.\nMosharrafa completed his studies at the University of Nottingham in\n1920\nand was awarded a B.Sc.\n(\nHonours\n)\n. He was awarded a second scholarship by the Egyptian Ministry of Education to enable him to undertake research at the University of London for a Ph.D. He entered King's College London where his thesis advisor was Owen Willans Richardson\n(1879\n-\n1959)\n, the Wheatstone Professor of Physics. Mosharrafa was awarded his Ph.D. in\n1923\nfor his thesis\nThe Quantum Theory of Spectral Series\n. By this time he already had a number of papers in print.\nAlthough Mosharrafa only completed his first degree in\n1920\n, by May\n1921\nhe had written his first, ever impressive, paper. This paper\nOn the appearance of unsymmetrical components in the Stark effect\nwas published in\n1922\n. The paper has the following Introduction:-\nThe theory of spectral lines which has hitherto proved most successful in interpreting the results of experiment is based upon certain assumptions of a quantum type introduced by\nBohr\n,\nSommerfeld\n, and others. Such assumptions are only justifiable in so far as they give satisfactory interpretations of correlated phenomena. The effect of an electric field upon spectral lines emitted by substances subjected to the field was first investigated by J Stark in\n1913\n; and an approximate theory was furnished by\nK Schwarzschild\nand by\nP Epstein\nindependently in\n1916\n: the two theories are similar and give satisfactory explanations of the phenomenon as investigated by Stark. Now, according to their theory, the components into which any given spectral line is split up are symmetrically distributed about the original position of the line. In the present paper a closer approximation is worked out, and it is found that for stronger fields than those used by Stark this symmetry no longer follows from the theory: on the other hand, a pair of components which, for fields comparable with those that Stark used, appear symmetrically situated, would for stronger fields be displaced in the same direction, so that the symmetry is destroyed, We, naturally, also find that the relation between the strength of the field and the displacements of the lines is no longer represented graphically by straight lines, but by parabolic curves whose curvatures change sign with the displacements\n(\ni.e. displacements of opposite signs correspond to parabolas of opposite curvatures\n)\n. It appears to the present writer that an experimental investigation of the Stark effect for fields stronger than those that have already been employed by Stark is highly desirable as a further test of the fundamental hypotheses of the quantum theory of spectra: if such an investigation result in the verification of the predictions already referred to, then this will add to our faith in the foundations of the quantum theory of spectral lines: whereas a negative experimental result would, unless the analysis here presented be at fault, lead us to a reconsideration of our assumptions, and perhaps to certain modifications thereof.\nAt the end of the paper Mosharrafa thanks John William Nicholson\n(1881\n-\n1955)\n, writing:-\nIn conclusion, I wish to express my thanks to Prof J W Nicholson for useful suggestions.\nWe note that Nicholson had been appointed Professor of Mathematics at King's College London in\n1912\nbut left to take up a position in Oxford in\n1921\n.\nMosharrafa's next paper,\nOn the quantum theory of the simple Zeeman effect\nwas submitted for publication on\n1\nSeptember\n1922\nand published in February\n1923\n. It has an Introduction which begins as follows:-\nThe aim of this paper is to put forward a theory of the simple Zeeman effect which possesses the same general features as those of the corresponding theory in the case of the Stark effect already developed by\nEpstein\nand\nSchwarzschild\n.\nHis next paper, published in July\n2003\n, was\nOn the quantum theory of the complex Zeeman Effect\n. He writes the paper was:-\nPart of Thesis approved for the Degree of Doctor of Philosophy in the University of London.\nIt is quite remarkable that his thesis had been approved so soon. The  Egyptian Ministry of Public Education ordered him to return to Egypt and he was appointed to the Higher Teachers College. The remarkable quality of his research meant that, one year after the award of his Ph.D., Mosharrafa returned to the University of London where he was awarded the higher degree of D.Sc. Again we remark on how rapidly this research was done for on the paper\nHalf Integral Quantum Numbers in the Theory of Stark Effect and a general Hypothesis of Fractional Quantum Numbers\nsubmitted to the\nRoyal Society of London\non\n28\nFebruary\n1924\n, he writes:-\nThis paper summarises one portion of a Thesis approved for D.Sc. degree in the University of London.\nMosharrafa returned to Egypt in\n1925\nand the Egyptian University\n(\nnow Cairo University\n)\nbeing re-founded in that year, he was appointed as an associate professor of mathematics in the Faculty of Science. The University had a rule that nobody under the age of\n30\ncould be given the grade of professor but, although only\n28\n, Mosharrafa was given the title of Professor of Applied Mathematics in\n1926\ndespite the University's age rule. Donald Reid writes in\n[\n3\n]\n:-\nIn\n1921\n- the year\nEinstein\nwon the Nobel Prize - Mosharrafa was working at the edge of quantum physics, exploring mathematically the ramifications of the Zeeman and Stark effects.\n(\nZeeman had noted that a magnetic field split each of the spectral lines of light into several lines, and Stark had observed the similar effect of a strong electric field on the spectral lines emitted by radiating atoms\n)\n. J W Nicholson and Owen W Richardson of King's College helped Mosharrafa publish in 'Philosophical Magazine'\n(\none of whose editors was J J Thomson of the Cavendish Laboratory at Cambridge\n)\n, 'Nature', and the 'Proceedings' of the\nRoyal Society of London\n. Zeeman, Stark, Richardson, and Thomson were Nobel prize winners all; Mosharrafa had his eye on the prize as well. Mosharrafa published a dozen items in these journals in the next decade, but only three or four more in the eighteen years that followed. Administration and popularizing science took up much of his time, and most of what research he did he published in Egypt. The pattern was frequent among foreign-educated Egyptian scientists who did not emigrate.\nIn\n1936\nMosharrafa became Dean of the Faculty of Science at Cairo University. Rushdi Said tells of something about his policies in\n[\n4\n]\n:-\nDr Ali Mustafa Mosharrafa, the dean of the faculty of science at Cairo University, was vehemently opposed to the establishment of new universities, as he felt that Egypt did not have the qualified professors that could staff them. He also was of the opinion that any compromise with regard to the standard of the professors would lead to significant deterioration of the quality and standard of education, a situation he painstakingly tried to avoid. A personal and relevant incident worth mentioning in this regard was the refusal of Dean Mosharrafa to transfer me to a teaching position in the newly established Alexandria university in\n1944\nwhen I obtained my master's degree. As a result of the shortage in qualified personnel this degree was made sufficient for a university teaching post. When I protested to Dean Mosharrafa, he told me, \"why do you want to associate yourself with these second grade universities? We are sending you on a scholarship to the best university in the world to come back to us as a professor worth his salt; we want to keep the standard of this university as high as any university in the world.\" Dr Mosharrafa's decision delayed my seniority status, and put me in a position where several people less scholarly than I sat on committees that judged my scientific worth and determined my promotions. All these difficulties notwithstanding, I was thankful for spending all these years abroad and returning as a professor \"worth his salt,\" as Dr Mosharrafa had wished.\nWe noted above that Mosharrafa was appointed as Professor of Applied Mathematics at the University of Cairo in\n1926\n. The Professor of Pure Mathematics at this time was\nEdward Ince\nwho was also appointed in\n1926\n. These two gave Cairo University a remarkably strong reputation in mathematics at this time. In\n1931\n, however,\nInce\nresigned. The report of the Faculty of Science for the Session\n1931\n-\n32\nstates\n[\n12\n]\n:-\nThrough the resignation, during the summer vacation, of Dr\nE L Ince\n, the chair of Pure Mathematics fell vacant and has remained throughout the session. Professor Mosharrafa has been acting as head of the department of Pure Mathematics.\nThis was not a short term position for the chair of Pure Mathematics was not filled for some years. The reports of the Faculty of Science\n[\n13\n]\nand\n[\n14\n]\nstate that:-\nThe chair of Pure Mathematics has remained vacant throughout the session, and Professor Mosharrafa has been acting head of department.\nHe is still the author of the Department of Pure Mathematics report in session\n1937\n-\n38\n.\nMosharrafa married Dawlat H Zayed\n(1910\n-\n1989)\n; they had one son Mostafa Ali Mosharrafa, born in Cairo on\n22\nFebruary\n1936\nand died in July\n1992\nin Houston, Texas, USA. The article\n[\n16\n]\nconcerns Mosharrafa's grandson who \"made a generous donation to honour his grandfather\" to Brophy College where his son, Mosharrafa's great-grandson, was studying in\n2011\n.\nIn\n1936\nMosharrafa founded the Mathematical and Physical Society of Egypt, and\n[\n14\n]\nreports that he read a paper to the Society on\n30\nMarch\n1936\nwith title\nThe Equations of Maxwell and a Variable Speed of Light\n. Also in\n[\n14\n]\nwe see the following:-\nDr Mosharrafa, in collaboration with M Mokhtar, M.Sc.. lecturer in Physics, is investigating the musical scales used in Egypt at the present time. The object of the investigation is to place on record the frequency-ratios between constituent notes in the different scales and to study the theoretical basis of the system. The Royal Institute of Oriental Music is co-operating by nominating competent instrumentalists to do the work of tuning.\nTheir paper\n[\n9\n]\nModes in Modern Egyptian Music\n(1937)\nhas the following Abstract:-\nWe have been engaged on determining the  frequency ratios involved in the principal musical scales or modes in current use in Egypt today. These scales were the subject of a controversial discussion at an international congress held in Cairo in March\n1932\n.\nFor Mosharrafa's activities in\n1940\n-\n50\nwe quote from\n[\n7\n]\n:-\nIn his later years, he was occupied with the generalization of\nEinstein\n's equations, particularly with the study of the path of an electrically charged particle, a study which was published in\n1948\n. His last work which dealt with the mass defect in the nucleus, appeared in 'Nature' in October\n1949\n. Mosharrafa Pasha was a prominent University figure. His constant aim was the maintenance of a high academic standard and the establishment of rational traditions. For the achievement of this aim he was tireless in his efforts and fearless in his conduct. Not only was Mosharrafa Pasha active within the Sphere of University, but he devoted himself also to the creation of a scientific milieu in Egypt. His name stands foremost in most of the scientific societies, a number of which he helped to create. An ambition which was nearest to his heart, was the moulding of the Arabic language into a medium of expression of modern scientific thought. From the early days he advocated the encouragement of translating the classics of science into Arabic as well as that of re-editing the old Arab scientific writings, he set the example, and his name is to be found on books of both kinds. He was a firm believer in science, and an enthusiastic exponent of its role in human affairs. Aided by an outstanding ability of clear expression and a rare mastery of the Arabic language, Mosharrafa Pasha leaves behind a rich harvest of popular writings on scientific topics, a harvest which does great credit to the versatile and scholarly mind that produced it.\nFor a version of the complete\nEgyptian Academy of Sciences\nobituary\n[\n7\n]\nsee\nTHIS LINK\n.\nFor Mosharrafa's early history of the\nEgyptian Academy of Sciences\n, see\nTHIS LINK\n.\nIn\n1947\nMosharrafa was invited to Princeton in the United States. The following is from the United States Department of State\n[\n10\n]\n:-\nDr Ali Mustafa Mosharrafa Bey, Dean of the Faculty of Science, Faud' the First University, Cairo, has been invited to spend two years studying at Princeton University as the guest of Princeton and the United States government. President of the Mathematics and Physics Society of Egypt, Dr Mosharrafa is not only a leading scholar in the Near East, but also has a world reputation as a commentator on\nEinstein\n's mathematical work.\nIt was not possible for Mosharrafa to accept this invitation since the King of Egypt refused to allow him to travel to the United States.\nThe article\n[\n16\n]\ngives some indication of Mosharrafa's interests other than mathematics and physics:-\nDr Mosharrafa was not only a great scientist, he was a great writer\n(\nin both Arabic and English\n)\n, a literary genius, a poet, a songwriter, a pianist, a good tennis player, and perhaps most importantly, a devoted Muslim.\nIt is unclear whether he died on\n15\nJanuary or\n16\nJanuary\n1950\n. He received many tributes following his death. For example the\nEgyptian Academy of Sciences\nstated\n[\n7\n]\n:-\nThe members of the\nEgyptian Academy of Sciences\nmourn the loss of a brilliant colleague who devoted his life fully and truly to the cause of science.\nMosharrafa had corresponded with\nAlbert Einstein\nand, following his death,\nEinstein\nwrote:-\nI cannot believe that Mosharrafa is dead, he is alive through his researches. We are in need of his talents, it is a great loss, he was a genius. I used to follow up his researches in atomic energy, definitely he is one of the best scientists in physics.\nThere is a puzzle over the death of Mosharrafa much more significant than the difference of one day in its date. There are three theories concerning his death. The first is that he was assassinated by Mossad, the Israeli intelligence service. The second is that he was assassinated on the orders of King Farouk of Egypt. The third is that he died of a heart attack. The first possibility is the one most widely circulated following his death. It seems highly unlikely. Mossad was only formed on\n13\nDecember\n1949\n, and there seems no reason why Israel should want Mosharrafa killed. He was certainly the Egyptian most able to work on developing an atomic bomb, but he was strongly opposed to using science for military purposes. No work, however, was being undertaken on such a project so why would Israel want him killed? The fact that Mosharrafa was strongly opposed to using science for military purposes is the usual reason cited for the second possibility. Certainly King Farouk had prevented him spending two years in Princeton, but it does not seem a plausible reason for Egypt to assassinate their most famous mathematician and physicist. That Mosharrafa died from a heart attack certainly seems highly plausible and his brother was very definite that this indeed was the cause of his death. It appears unlikely that there will ever be a definite answer to the cause of his death but certainly the evidence we have seen leads us to suggest that a heart attack is indeed the most likely cause of his death.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}