{
  "nome_completo": "Alicia Boole Stott",
  "nome_curto": "Alicia Boole Stott",
  "ano_nascimento": "1860",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stott/",
  "lugar_nascimento": "Cork, Ireland",
  "lugar_morte": "Highgate Middlesex, England",
  "biografia": "Alicia Boole\nwas the third daughter of\nGeorge Boole\n, who has a biography in this archive, and\nMary Everest\n. Mary was born in Gloucester, England, the daughter of the Rev Thomas Roupell Everest\n(1801\n-\n1855)\n, Minister of Wickwar. Her uncle, George Everest\n(1790\n-\n1866)\nwas a surveyor, carrying out a major trigonometric survey of India, and in his honour the Royal Geographical Society named Mount Everest in\n1865\n. Mary spent her youth in France where she had a mathematical education and essentially spoke French as a first language. She returned to England where she studied mathematics on her own. In\n1852\nGeorge Boole\nbecame her tutor and, following the death of her father, they married in\n1855\nand went to live in Castle Road, near Cork, Ireland. George and\nMary Boole\nhad five daughters, Mary Ellen Boole\n(1856\n-\n1900)\nwho married the mathematician Charles Howard Hinton\n(1853\n-\n1907)\n, Margaret Boole\n(1858\n-\n1935)\nwho married Edward Taylor and was the mother of\nGeoffrey Ingram Taylor\n, Alicia Boole the subject of this biography known to her friends as Alice, Lucy Everest Boole\n(1862\n-\n1905)\nwho became a chemist and the first woman to be elected a fellow of the Institute of Chemistry, and Ethel Lilian Boole\n(1864\n-\n1960)\nwho became an author. Let us note the surprising fact that Charles Howard Hinton, who played a part in Alicia's mathematical education which we describe below, was convicted of bigamy after he married Maud Florence in\n1883\n.\nGeorge Boole\ndied when his daughter Alicia was only four years old and, unable to support herself without a husband, his widow\nMary\nleft Ireland with four of her five daughters to live in London. There she took a job as a librarian at Queen's College, the first women's college in England, but also used her knowledge of mathematics and teaching methods to act as an unofficial tutor to the students. However, she left Alicia in Cork to live with her maternal grandmother. Alicia she was brought up partly by her grandmother, partly by her great-uncle, but these were years when she felt repressed and unhappy. When she was eleven years old she went to London where she joined her mother and sisters. However, the family were living in difficult circumstances in a crowded house.\nCoxeter\nwrites\n[\n1\n]\n:-\n... the five girls were reunited with their mother\n(\nwhose books reveal her as one of the pioneers of modern pedagogy\n)\nin a poor, dark, dirty, and uncomfortable lodging in London.\nMary Boole\nwas forced to leave her job as a librarian and became a secretary to James Hinton\n(1822\n-\n1875)\n, a surgeon and author, and father of the mathematician Charles Howard Hinton who married Alicia's oldest sister Mary Ellen in\n1880\n. James Hinton needed help with mathematical ideas for a project he was undertaking on philosophy. When Alicia was sixteen, in\n1876\n, she returned to Cork for a short while where she worked in a children's hospital. However, after a short spell, she returned to London to live with her mother.\nAlthough Alicia had no formal education, she was taught by her mother\nMary\n. This was no ordinary education for\nMary\nhad her own ideas about teaching in general and about teaching mathematics in particular.\nCoxeter\nwrites\n[\n1\n]\n:-\nThere was no possibility of education in the ordinary sense, but Mrs\nBoole\n's friendship with James Hinton attracted to the house a continual stream of social crusaders and cranks.\nIf we are to gain some idea about the teaching that Alicia received from her mother, we must look at\nMary Boole\n's ideas about teaching. She wrote several books which were published much later but she certainly had the ideas for them when unofficially tutoring at Queen's College. Examples of these books are\n(\ni\n)\nLogic Taught By Love\n(1890)\n,\n(\nii\n)\nLectures on the Logic of Arithmetic\n(1903)\n,\n(\niii\n)\nThe preparation of the child for science\n(1904)\n, and\n(\niv\n)\nPhilosophy and the fun of algebra\n(1909)\n. Here are some quotes which are relevant to Alicia's education. the first quote is from\n(\nii\n)\nthe rest are from\n(\niii\n)\n:-\nAnything which the teacher intends to prove should never be stated; children should be led up to find it out for themselves by successive questions.\nThe geometric education may begin as soon as the child's hands can grasp objects. Let him have, among his toys, the five regular solids and a cut cone.\nAs soon as the hands can hold steadily compasses and set-square the child should be encouraged both in copying diagrams ... and in inventing others for himself. It is desirable that, before any systematic teaching of mathematics begins, the compass, set-square, and ruler marked in fractions of an inch should be as familiar implements as the fork and spoon.\nBetween the time when a child handles an actual cube, cuts sections etc., and the time when he comes, among his ordinary geometrical exercises, to problems requiring him to draw the elevation of a cube cut in some particular way, there is a period when he finds it useful, and very delightful, to go through a set of processes in imagination and to express them in his own words.\nWith no formal education she surprised everyone when, at the age of eighteen, she was introduced to a set of little wooden cubes by her brother-in-law Charles Howard Hinton. At this time Hinton was thinking about the article\nWhat is the fourth dimension?\nwhich he published in\n1880\n. Alicia Boole experimented with the cubes and soon developed an amazing feel for four dimensional geometry. She introduced the word 'polytope' to describe a four dimensional convex solid.\nCoxeter\nwrites\n[\n1\n]\n:-\n[\nJames\n]\nHinton's son Howard, brought a lot of small wooden cubes, and set the youngest three girls the task of memorising the arbitrary list of Latin words by which he named them, and piling them into shapes. To Ethel, and possibly Lucy too, this was a meaningless bore; but it inspired Alice\n(\nat the age of about eighteen\n)\nto an extraordinarily intimate grasp of four-dimensional geometry.\nDes MacHale, in\n[\n6\n]\n, writes:-\nShe found that there were exactly six regular polytopes on four dimensions and that they are bounded by\n5\n,\n16\nor\n600\ntetrahedra,\n8\ncubes,\n24\noctahedra or\n120\ndodecahedra. She then produced three-dimensional central cross-sections of all the six regular polytopes by purely Euclidean constructions and synthetic methods for the simple reason that she had never learned any analytic geometry. She made beautiful cardboard models of all these sections. ...\nLet us note at this point that Howard Hinton published the book\nA new era of thought\nin\n1888\n. Alicia Boole wrote part of the preface of this book and also wrote some of the chapters on sections of\n3\n-dimensional solids. By the time this book was published, Hinton had gone with Mary Ellen to Japan following his conviction for bigamy. Let us quote at this point a description by\nGeoffrey Taylor\nof how Alicia discovered the six regular polytopes on four dimensions\n(\nsee\n[\n9\n]\n)\n:-\nAlice's method of discovery was typically that of an amateur. She started by noticing that a corner in a regular four-dimensional figure bounded by tetrahedra, for instance, can only have either\n4\n,\n8\nor\n20\nof them meeting at a point because a section of three-dimensional space close to the corner in a symmetrical position could only be a tetrahedron, an octahedron, or an icosahedron. She then traced, using only\nEuclid\n's construction, the progress of the section as the four-dimensional figure passed through our three-dimensional space. In this way Alice, employing only\nEuclid\n's constructions, produced sections of all the six regular polytopes.\nAfter taking up secretarial work near Liverpool in\n1889\nAlicia Boole met and married the actuary Walter Stott in\n1890\n; they had two children, Mary Stott\n(1891\n-\n1982)\nand Leonard Stott\n(1892\n-\n1963)\n. However, life was hard and she \"led a life of drudgery, rearing her two children on a very small income\". Through her husband, Stott learned of\nPieter Hendrik Schoute\n's work on central sections of the regular polytopes in\n1895\nand Alicia Stott sent him photographs of her cardboard models.\nSchoute\nwas amazed to see Stott's models and immediately proposed meeting her in England. He came to England for his summer holidays over the next few years and stayed with Stott at the home of her maternal cousin in Hever.\nSchoute\nworked with Alicia Stott for almost\n20\nyears, persuading her to publish her results which she did in two papers published in Amsterdam. These are\nOn certain series of sections of the regular four-dimensional hypersolids\n(1900)\nand\nGeometrical deduction of semiregular from regular polytopes and space fillings\n(1910)\n. She also wrote three papers jointly with\nSchoute\n, namely\nOn Models of\n3\n-dimensional sections of regular hypersolids in space of\n4\ndimensions\n(1907)\n,\nOn the sections of a block of eight-cells by a space rotating about a plane\n(1908)\n, and\nOver wederkeerigheid in verband met halfregelmatige polytopen en netten\n(1910)\n. Alicia Stott made two further important discoveries relating to constructions for polyhedra related to the golden section. She did not stop working at this point for a letter she wrote to\nGeoffrey Taylor\nin\n1911\ndescribed, very modestly, her continuing work\n(\nsee\n[\n8\n]\n)\n:-\n... I have not done anything more interesting than staining very shabby floors and such like homehold things for some time; but last night I received by post a M.S. of\n70\nvery closely written pages containing an analytical counterpart of my last geometrical paper. Of course I must read it. It is the second attempt and was only written because I did not like the first but I am such a duffer at analytical work anyhow that I don't suppose I shall like this very much better.\nSchoute\ndied in April\n1913\nand at this point Stott's work on polytopes seems to stop. However, the University of Groningen honoured her by inviting her to attend the tercentenary celebrations of the university and awarding her an honorary doctorate on\n1\nJuly\n1914\n. She was proposed for the doctorate by Johan Antony Barrau\n(1873\n-\n1953)\nwho was appointed to succeed Schoute at Groningen. Having read her papers he wrote\n(\nsee\n[\n8\n]\n)\n:-\nFrom these papers, one infers a very special gift for seeing the position and forms in a space of four dimensions. Three of these papers are written jointly with late Professor Dr P H\nSchoute\nconnected during so many years to the University of Groningen; And this fruitful cooperation with the professor that she lost, is the reason for the Faculty of Mathematics and Physics to propose Mrs A Boole Stott for the doctorate honoris causa in Mathematics and Physics, to confer on the occasion of the coming festive commemoration of the\n300\nth\nbirthday of the University.\nIt was arranged for Stott to say with\nSchoute\n's widow when she came to Groningen to attend the celebrations and receive the honorary degree. However, for some reason that remains unclear, she did not travel to Groningen and the degree was awarded 'in absentia'.\nIn around\n1930\nshe was introduced to\nCoxeter\nand they worked together on various problems\n[\n2\n]\n:-\nCoxeter\n's alliance with Aunt Alice was a great source of joy. \"The strength and simplicity of her character,\" he said, \"combined with the diversity of her interests to make her an inspiring friend.\" They conducted an ongoing conversation about polytopes, by letter and with visits back and forth.\nHe even persuaded her to talk at\nHenry Baker\n's tea party\n[\n2\n]\n:-\nWhen\nCoxeter\n's turn came up for another session at\nBaker\n's tea party, he invited his \"Aunt Alice\" to deliver a joint lecture. ... When Aunt Alice made her appearance as\nCoxeter\n's guest at\nBaker\n's tea party, she brought her models and donated them to the department for permanent exhibit.\nAfter one of\nCoxeter\n's visits to Aunt Alice for \"tea and polytopes\" she gave him a present of two matching lamps with bases in the form of truncated icosahedra. When\nCoxeter\nleft England to take up a post in Toronto in\n1936\nhe received a present from Stott in the form of an antique stained-glass Archimedian solid lampshade. She wrote him a letter saying\n(\nsee\n[\n2\n]\n)\n:-\nMy dear! I don't know how to write to you - words seem so futile beside so great a separation! But indeed one can rejoice, for your sake, that it happened so ... While I have been writing my mind has gone back to the lovely world we have visited together, and which you have made so much your own. I wonder where you will get to in it! How I wish I could follow.\nWhen I\n[\nEFR\n]\nvisited\nDonald Coxeter\nin Toronto in\n1976\nhe spoke to me with great feeling about his discussions with Alice Boole Stott. He showed me models of her polytopes but I am unsure now if these were models she had made or whether they were models he had made in the same form as Stott.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}