{
  "nome_completo": "Alice Elizabeth Lee",
  "nome_curto": "Alice Lee",
  "ano_nascimento": "1858",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lee/",
  "lugar_nascimento": "Dedham, Essex, England",
  "lugar_morte": "Rustington, Sussex, England",
  "biografia": "Alice Lee\nwas the daughter of William Lee\n(1821\n-\n1887)\n, born in Sudbury, Suffolk, and Matilda Wren Baker\n(1822\n-\n1903)\n, born in London. William Lee was a master coach builder and he had married Matilda Baker on\n29\nJuly\n1846\nin St Mary the Virgin church in Dedham, Essex. At the time of the\n1861\ncensus William and Matilda Lee were living in Dedham with their first five children, George\n(\naged\n12)\n, Catherine\n(\naged\n10)\n, and Mary A\n(\naged\n9)\n, Alice E, the subject of this biography,\n(\naged\n2)\n, and Anna G\n(\naged\n9\nmonths\n)\n. Ten years later, as recorded in the\n1871\ncensus, the family were living in a home attached to William's coach building premises in Dedham High Street. Their youngest child Caroline A\n(\naged\n7\nat the time of the\n1871\ncensus\n)\nhad been born, George had left home but Catherine and Mary A were still living at home but working as governesses. Alice and her two younger sisters were studying at school in Dedham. Matilda's sister Frances was also living with them at the time of the census.\nIn\n1876\nLee became a student at Bedford College, London. This college had been founded in\n1847\nto provide higher education for women; in fact it was the first college in the UK to provide such an education for women. In\n1874\n, just before Lee began her studies there, the College moved from its first site in Bedford Square to two houses in York Place, close to Baker Street, in Marylebone. Percy John Harding taught mathematics at Bedford College, starting in\n1870\nwhen\nOlaus Henrici\nleft to replace\nThomas Hirst\nat University College. At first Harding, like all his predecessors, did not teach mathematics to degree level but in\n1879\n-\n80\nLee attended the first higher mathematics classes that Bedford College had just started up due to increased demand. In that\n[\n17\n]\n:-\n... year there were\n9\nMatriculation entrants\n[\nto the University of London\n]\nand Miss Alice Elizabeth Lee, a student of the College\n[\nBedford College\n]\n, headed the list and gained a prize of £\n5\nfor so doing.\nAt the time of the\n1881\ncensus Lee was living at\n9\nYork Place, one of the two Bedford College houses, where she was one of fifteen undergraduate girls in the house. At this stage Bedford College did not have university status but Lee sat the University of London B.Sc. examinations in\n1884\n, becoming the first Bedford student to be awarded this degree. In fact women had only been allowed to sit the University of London degree examinations since\n1877\n. Lee, however, was not only interested in science and, in\n1885\n, she sat the University of London B.A. examinations and was awarded an arts degree. Margaret Tuke was principal of Bedford College and she explained how important Lee's success was\n[\n17\n]\n:-\nTo us now these successes seem everyday and unimportant or of importance only to the individual. To believers in higher education of women in the early\n80\n's intent on showing what women could do, each success was a matter for enthusiasm. The friends of the College were duly encouraged.\nAfter graduating with her two degrees, Lee was appointed as an assistant lecturer in mathematics and physics at Bedford College. She received little in the way of wages, these being given by the professor whom she was assisting. At the time of the\n1881\ncensus she was living with her mother\n(\nher father having died four years earlier\n)\nin Lower Street, Stratford St Mary, just north of Dedham. Her sister Caroline, now a school teacher, is also living there. In addition to teaching mathematics and physics, Lee also tutored students in Greek and Latin. From\n1892\nto\n1894\nshe was also a resident helper at the College meaning that she was given free accommodation and board in exchange for unofficially helping students.\nIn\n1892\nKarl Pearson\nattacked the academic standards at Bedford College in a letter published in the\nPall Mall Gazette\n. He wrote\n[\n11\n]\n:-\nLadies' colleges ... are doing, no doubt, good work; but the work is not academic as is sufficiently indicated when we say that a teacher at one of the latter has been known to lecture on mathematics, and on physics, and on classics at or about the same time.\nAlthough he did not name Lee, she was the only person to fit\nPearson\n's description and she took it upon herself to respond writing a letter to\nPearson\ndefending the academic standards of the College.\nPearson\nwas impressed by Lee's response and encouraged her to further her studies. In particular she attended the first course of lectures on advanced statistics he gave in\n1895\n. She wrote to\nPearson\non\n26\nSeptember\n1895\nsaying that she was fascinated by what she was learning about biometry. One of the others attending these lectures was\nGeorge Udny Yule\nwho later achieved fame as a statistician. Lee continued to teach mathematics and physics at Bedford College, holding a lectureship in mathematics and physics until\n1916\n, but from\n1895\nshe began to contribute to\nPearson\n's research team. At first she carried out laborious calculating tasks that were assigned to her but\nPearson\nquickly saw the importance of her contributions and wanted to add her name to papers resulting from her work. At this stage Lee, writing to\nPearson\non\n1\nDecember\n1895\n, felt her name should not be included\n[\n9\n]\n:-\n... for I have done nothing but the arithmetic, and I suppose a machine could do most of that.\nThe first paper on which her name appears is\nMathematical Contributions to the Theory of Evolution. On Telegony in Man, &c.\nwhich was received by the\nRoyal Society\nof London on\n27\nAugust\n1896\nand read on\n26\nNovember\n1896\n. The authors are given as\nKarl Pearson\n, F.R.S., University College, with the assistance of Miss Alice Lee, Bedford College, London. Pearson writes in the paper\n[\n14\n]\n:-\nThe reduction from the family measurement-cards, the formation of the eight correlation tables, and the calculation of both variation and correlation coefficients have been undertaken by Miss Alice Lee of Bedford College, - a task requiring much labour and persistency.\nFor details about the contents of this paper and many other papers by Lee, see\nTHIS LINK\n.\nBut Lee had ideas of her own about the research she would like to undertake and\nPearson\nencouraged her to write a thesis which could be submitted to the University of London for the degree of D.Sc. He wanted, however, Lee's help with other projects that he was undertaking so Lee began a period where she basically had three jobs, a lecturer in mathematics and physics at Bedford College, an assistant to\nKarl Pearson\nat University College London, and a research student undertaking research for a D.Sc.\nThe research Lee was undertaking was an attempt to disprove the theory, held by most experts at that time, that the capacity of a person's skull was closely related to their intellectual ability, i.e. the larger the head, the cleverer the person would be. This belief, of course, led to the immediate corollary that men were more intelligent than women since, on average, men had considerably larger heads. As an example, we need only look at the\n1887\narticle\nMental differences of man and women\nby the psychologist George J Romanes\n(1848\n-\n1894)\npublished in\nPopular Science Monthly\nin which he states:-\nSeeing that the average brain-weight of women is about five ounces less than that of men, on merely anatomical grounds we should be prepared to expect a marked inferiority of intellectual power in the former. ... In actual fact we find that the inferiority displays itself most conspicuously in a comparative absence of originality, and this more especially in the higher levels of intellectual work.\nIf Lee could show that there was no correlation between size of skull and intellectual ability, she would take away one of the strongest arguments used to \"prove\" men were cleverer than women. The first problem that Lee had to face was the size of a skull. She set out a number of measures of the head, the length, breadth, circumference etc devising a scheme which gave a value for the size of the skull by combining the various measures. In fact she produced a number of formulas for combining the measures of the head which gave different measures of capacity but all gave the same relative ordering of the subjects measured.\nWhere did Lee get her data from? The Anatomical Society met in Dublin on\n10\nJune\n1898\nand\n35\nof them, all male, agreed to have their heads measured at the Anthropometric Laboratory at Trinity College, Dublin. The data was published in the\nJournal of Anatomy\nand used by Lee in the formulas she had developed. She also used data from members of the British Association,\n30\nfemale students from Bedford College, and\n25\nlecturers from University College London, including\nKarl Pearson\nhimself. Her thesis contained\n[\n4\n]\n:-\n... tables of the skull capacity of some sixty men, and also of some thirty women, whose relative intellectual ability can be more or less roughly appreciated. It would be impossible to assert any marked degree of correlation between the skull capacities of these individuals and the current appreciation of their intellectual capacities. One of the most distinguished of Continental anthropologists has less skull capacity than\n50\nper cent of the women students of Bedford College; one of our leading English anatomists less than\n25\nper cent of the same students. There will, of course, be errors in our probable determinations, but different methods of appreciation lead to sensibly like results, and although we are dealing with skull capacity, and not brain weight, there is, we hold, in our data material enough to cause those to pause who associate relative brain weight either in the individual or the sex with relative intellectual power. The correlation, if it exists, can hardly be large, and the true source of intellectual ability will, we are convinced, have to be sought elsewhere, in the complexity of the convolutions, in the variety and efficiency of the commissures, rather than in mere size or weight.\nLee submitted her thesis to the University of London for the degree of D.Sc. in March\n1899\nand examiners were appointed including the mathematician\nJoseph Larmor\n, the social scientist E B Hobson and anatomist Sir William Turner. Turner was perhaps an unfortunate choice since he had been one of the anatomists whose head had been measured and he had one of the smaller skulls. He should have been pleased with Lee's conclusion that skull size did not correlate with intellectual ability but instead he seemed annoyed.\nLarmor\nclaimed that the thesis must be mostly\nPearson\n's work and not Lee's, despite the fact that\nPearson\nstated clearly that it was not. The examiners' reports were sent to\nFrancis Galton\nfor his comments, and again this was unfortunate in that\nGalton\nfirmly believed that women's smaller skull size equated to intellectual inferiority. On\n9\nSeptember\n1899\n,\nGalton\nwrote to\nPearson\n[\n12\n]\n:-\nI have been back three weeks, and on my road northwards saw Weldon at Oxford, and heard of a hitch in the way of granting Miss Lee the doctor's degree. A few days later a batch of papers reached me from the Registrar. The Joint Report of Sir W Turner and myself had been referred to the original examiners and the whole matter on receiving their report was discussed by the Senate, who sent all the material to myself and I presume to Sir W Turner also, asking certain questions.\n(\nThey don't want to hear in reply before October.\n)\nI thereupon drafted what I had to say and, on returning to town last night\n(\non the way to Dover\n)\n, posted it to Sir W Turner.\nGalton\nagain wrote to\nPearson\n, this time on\n27\nOctober\n1899\n[\n12\n]\n:-\nSir H Roscoe told me last night that Miss Alice Lee had got her degree. The mathematicians were however troublesome.\nPearson\nclaimed that the problems with Lee's thesis were caused by the fact that she did not write very well\n[\n9\n]\n:-\nI am here as on other occasions apt to be vexed by her want of power of expression ...\nA revised version of Lee's thesis was submitted to the\nRoyal Society\non\n13\nJuly\n1900\nand read on\n15\nNovember\n1900\n. It starts with a Note by\nPearson\n:-\nThe substance of this paper was presented by Miss Lee as a thesis for the London D.Sc. in March,\n1899\n. After its presentation Miss Lee asked me to criticise and revise it with a view to publication. Illness in the spring of\n1899\nand later pressure of other work prevented my completing this revision until now. When Miss Lee started her work practically nothing had been published on the correlation of the parts of the skull; since then an interesting paper has appeared by Dr Franz Boas. To this reference is made in the footnotes at points where there is agreement or disagreement with his conclusions. The subject is of such great scientific interest, and anthropologically of such importance, that I urged Miss Lee to somewhat enlarge her original thesis by a series of additional investigations now incorporated in this paper. I have further rearranged a good deal of her material and reworded some of her conclusions, but the reduction of the material and the inferences drawn from it are substantially her work. My task has been that of an editor, who wished to mould the author's researches into a component part of a wider series dealing generally with the quantitative data for the problem of evolution in man. Such is the limit of my revision. I have passed of course nothing which did not seem to me valid, and have suggested to the author some lacunae which could be filled up by a consideration of additional data.\nFor the Introduction to the paper, see\nTHIS LINK\n.\nTo emphasise the difficulties that Lee encountered we quote from a letter\nPearson\nwrote to\nGalton\non\n26\nDecember\n1901\n[\n12\n]\n:-\nI have always felt we must go into the point more fully, since you laid stress on the view that ability was correlated with the size of the head in your criticism of Dr Lee's paper. There is still a chance that extreme genius may exhibit something abnormal in the size of head, but I think it is now pretty clear, if we are to look upon ability as normally distributed in the population, there is only a very small, practically negligible correlation between it and either the size or shape of the head. We propose next to find out whether there is a higher relationship between ability and health, strength and general physique, and then to test its relation to temper and moral characters, from the school data schedules.\nLee continued to be an author on papers with several authors such as\nOn the Correlation of the Mental and Physical Characters in Man. Part II\n(1902)\n, and\nOn Inheritance of Coat-Colour in The Greyhound\n(1904)\n. She also published single author papers such as\nDr Ludwig on Variation and Correlation in Plants\n(1902)\nand\nOn the Relation Between Rates, Expenditure on Remunerative Works, and Rate of Increase of Population in Fifty-Eight British Municipalities\n(1903)\n.\nUntil\n1907\nLee continued to work for\nKarl Pearson\nand to lecture at Bedford College. Her health, however, began worry her and in\n1907\nshe resigned her role assisting\nPearson\nat the Eugenics Laboratory although she continued to work at Bedford College.\nPearson\nwrote in a letter to\nGalton\non\n23\nNovember\n1907\n[\n12\n]\n:-\nMiss\nElderton\nhas been away with a bad cold. The radiators in the rooms have proved incapable of doing their work and we have had great difficulties. So bad indeed that Dr\nAlice Lee\nhas resigned, which will be a great loss to me, although she had recently been a little difficult to work with. I know only one person her equal in rapid and correct calculation and that is Miss\nElderton\n; we must keep the latter at the Eugenics Laboratory, if we can.\nDespite resigning, Lee continued to occasionally work at the Eugenics Laboratory and to publish joint papers such as\nOn the Correlation of Death-Rates\n(1910)\nand\nOn the distributions of the correlation coefficient in small samples. Appendix II to the papers of \"Student\" and R A Fisher\n(1917)\n. She also published several single author papers, for example\nOn the Manner in Which the Percentage of Employed Workmen in this Country is Related to the Import of Articles Wholly or Mainly Manufactured\n(1908)\n,\nTable of the Gaussian \"Tail\" Functions; When the \"Tail\" is Larger than the Body\n(1914)\n,\nTuberculosis and Segregation\n(1917)\n,\nFurther Supplementary Tables for Determining High Correlations from Tetrachoric Groupings\n(1917)\n, and\nSupplementary table for determining correlation from tetrachoric groupings\n(1927)\n.\nDuring World War I, Lee wanted to use her talents to support the war effort and worked first at the Munitions Inventions Department, where she contributed to a study on gun trajectories, and then as a computer for the Admiralty. A university career of considerable distinction did not, at this time, mean that a woman would have a comfortable retirement\n[\n15\n]\n:-\nDespite her distinctions as a scholar and long years of work, she was not entitled to a pension, having missed out on University College London's occupational scheme and earned relatively little when she was in full-time employment. Pearson and Margaret Tuke, principal of Bedford College, pleaded her case to government, which led to a civil list pension of £\n70\nper year, giving her a meagre, albeit welcome, income during old age. In retirement Lee, who never married, settled in Woodlands Avenue, Rustington, Sussex, and died at the Peter Pan nursing home, Rustington, on\n5\nOctober\n1939\n. She was buried in Littlehampton cemetery.",
  "math_areas": [
    "Calculus",
    "Statistics"
  ]
}