{
  "nome_completo": "Alison Catherine Falconer Dillon",
  "nome_curto": "Alison Falconer",
  "ano_nascimento": "1920",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Falconer_Alison/",
  "lugar_nascimento": "Newington, Edinburgh, Scotland",
  "lugar_morte": "Wembley, London, England",
  "biografia": "Before we give\nAlison Dillon\n's biography, we explain why we have included her in our archive. There are three reasons. First, Alison was an exceptionally good mathematician who chose to teach mathematics. She was an outstanding teacher and we include her as a representative of the many outstanding teachers who are so important to the development of the subject but are 'unknowns'. The second reason is personal. Much of the research for Alison's biography was done by Tony Gardiner and he was keen that people such as Alison were better known. I\n[\nEFR\n]\nknew Tony Gardiner from the time we were research students together at the University of Warwick in the\n1960\ns and was saddened to hear of his death in January\n2024\n. The third reason is that she has a local connection, having been at school in St Andrews.\nAlison Dillon\nwas given the name\nAlison Catherine Falconer\nat her birth and only became known as Alison Dillon after her marriage in\n1955\n. Her parents were Herbert Francis Falconer\n(1878\n-\n1927)\nand Laura Margaret Somerville\n(1891\n-\n1983)\n. Herbert Falconer, born on\n15\nAugust\n1878\nto the Rev William Meek Falconer and Isabella Catherine Paterson in Newington, Edinburgh, attended the Edinburgh Academy from\n1890\nto\n1896\n. He trained to become an actuary and, at the time of the\n1901\ncensus, he was living with his parents at\n21\nWest Mayfield, Edinburgh and was working as an actuary with Scottish Life. He became a Fellow of the Faculty of Actuaries and then studied at Edinburgh University. When a divinity student he sailed from Glasgow to Quebec, Canada as a missionary, arriving on\n26\nApril\n1910\n. Herbert Falconer married Laura Margaret Somerville at St Andrew's Church in Edinburgh in\n1917\n. Laura Somerville had been born in Crieff on\n24\nAugust\n1891\nto James Ewing Somerville and Margaret Stewart Sandeman. Herbert and Laura Falconer had three daughters: Jacqueline Stewart Falconer\n(1918\n-\n2010)\n, Alison Catherine Falconer\n(1920\n-\n2011)\n, the subject of this biography, and Gillian Laura Condie Falconer\n(1926\n-\n2016)\n.\nThe first two Falconer daughters were born in Newington, Edinburgh, when the family were living at\n13\nDryden Place, but by the time the third daughter Gillian was born Herbert was a minister in the United Free Church and the family were living in the Blackadder Manse, North Berwick, near Edinburgh. Before Alison had reached the age of seven, however, her father had died. He went to visit a parishioner without putting on his coat and was drenched in heavy rain. He caught a severe chill and died several days later on\n16\nJuly\n1927\nat a nursing home at\n19\nGreat King Street, Edinburgh. One of her two sons said\n[\n7\n]\n:-\nThe Manse was tied to Herbert's occupation, so the family was homeless; they had means, so Laura sought out the best Girl's School in Scotland free to ratepayers.\nThe family certainly had means, for\n[\n12\n]\nshows that Herbert Falconer's estate was valued at £\n15583\n. This is equivalent to about\n1\n.\n2\nmillion pounds at the\n2024\nvalue of the pound. Laura Falconer decided to have a house built in St Andrews so she could send her three daughters to St Leonard's School. She purchased a plot of land and had a house built, which they name Mizzentop, at\n14\nMiddleshade Road.\nAlison began her studies at St Leonard's School, St Andrews, in\n1934\n. St Leonard's School for Girls had been founded in\n1877\nand began in buildings which had been St Leonard's College, part of the University of St Andrews. While still a pupil at St Leonard's, she attended the St Andrews Colloquium in July of\n1938\n. This indicates clearly that Alison Falconer was a quite exceptional student, attending a major international mathematical conference while still at school. She graduated from St Leonard's College in\n1939\nand in the same year was admitted to the University of Cambridge.\nIn October\n1939\nAlison Falconer entered Newnham College, Cambridge, to begin her studies of the mathematical tripos. Being a student during World War II was, of course, a very different experience from normal times. Falconer described the war work that students had to undertake in\n[\n4\n]\n. We give an extract from that article at\nTHIS LINK\n.\nFrom\n1939\nto\n1942\nshe studied Parts I and II of the mathematical tripos. Her sons, who are not mathematicians, spoke a little to Tony Gardiner about what their mother told them from these years\n[\n7\n]\n:-\nShe told me one day the lecturer put a theorem on the board and let them think about it. After a while, she attracted the lecturer's attention and asked \"What should I do next?\" The lecturer was stunned. The theorem was previously unsolved.\nWhile living in St Andrews, Falconer had known\nD'Arcy Thompson\n. From Newnham College, she wrote to him concerning the biography of\nThomas Heath\n, the leading historian on ancient Greek mathematics, that he had written. She took the Part II examinations in\n1942\nand went on to study Part III. Because of the war the Part III class was very small, consisting only of five students, but they were quite a remarkable group of students. In addition to Alison Falconer, there was\nFritz Ursell\n,\nFreeman Dyson\n,\nJames Lighthill\n, and Tony Skyrme. Falconer was the oldest of the five having begun her university career in\n1939\n.\nFritz Ursell\nwas Jewish and left Germany at the end of\n1936\nto escape from the extreme difficulties Jews were experiencing. He was admitted to Cambridge in\n1940\nwas allowed to complete the\n2\n-year wartime undergraduate programme in\n1942\n. Tony Skyrme, born in Lewisham, England, studied at Eton College before winning a scholarship to take the same\n2\n-year wartime undergraduate programme as\nUrsell\n.\nLighthill\nentered in\n1941\nand took both Part II examinations and Part III examinations in\n1943\n.\nDyson\ndid the same as\nLighthill\n, also taking both Part II and Part III in\n1943\n.\nWe note that three of this remarkable collection of five students went on to become fellows of the\nRoyal Society\n. Tony Gardiner, who was a colleague of Tony Skyrme at the University of Birmingham for many years, said that Skyrme deserved to be a fellow of the\nRoyal Society\n. The particle, the skyrmion, named for Skyrme, is important in solid-state physics and was proposed by him in\n1961\n. This led to him receiving the Hughes Medal from the\nRoyal Society\nin\n1985\n. From all the available evidence, it appears that Falconer was of similar mathematical ability as the other four students. Not only were they outstanding students, but they had outstanding teachers such as\nJ E Littlewood\n,\nW V D Hodge\n,\nC V Durell\n,\nP A M Dirac\n,\nG H Hardy\n, and\nA S Besicovitch\n.\nTaking Part III did not mean that Falconer could avoid war work. One of her sons said\n[\n7\n]\n:-\nShe was not at Bletchley Park, of that I am quite sure. In the war she was collected and taken blindfolded in a car to a site, I think she called it Q, where I believe she taught the airforce three dimensional vectors. She broke a toe stumbling and it was reset wrongly as she could never divulge what she had been doing for it to happen. I do not have an accurate date ...\nBefore taking the Part III examinations, she applied for a position as an Assistant Lecturer in Mathematics at Royal Holloway College, University of London, and was accepted. In the spring of\n1943\nshe went on a holiday with her fellow student\nFreeman Dyson\n. He wrote\n[\n6\n]\n:-\nI remember Alison Falconer well from the two years\n1941\n-\n1943\nwhen we were undergraduates at Cambridge. She came from Scotland, and in the spring of\n1943\nshe and I went together for a vigorous walking tour of the Cairngorm mountains, including a\n25\n-mile transit of the Lairig Ghru pass over the Cairngorms from South to North. This was quite an adventure, since in wartime there were no tourists and no cars or buses on the roads. We were the only humans in that grand silence of the ancient highlands. We walked fast over the snow and ice to reach Aviemore before nightfall. Alison was a good companion but not an intimate friend. She shared my interests in literature and politics as well as mathematics, but we did not stay in touch after the Scottish holiday.\nIn\n1944\nFreeman Dyson\npublished the paper\nSome guesses in the theory of partitions\nin the student magazine\nEureka\n. Immediately after the paper there is a poem by Alison Falconer\n[\n5\n]\n:-\nShort vision\nBy A C Falconer\nThought is the only way which leads to life\nAll else is hollow spheres\nReflecting back\nIn heavy imitation\nAnd blurred degeneration\nA senseless image of our world of thought.\nMan\nthinks\nhe is the thought which gives him life!\nHe binds a sheaf and claims it as himself!\nHe is a ring through which pass swinging ropes\nWhich merely move a little as he slips.\nThe Ropes are Thought\nThe Space is Time\nCould he but see, then he might climb.\nIn\nFreeman Dyson\n's commentary about the partitions paper in\n[\n2\n]\n, he explains:-\nSince there was half a page left over at the end of my paper, they put a poem by my friend Alison Falconer, who was a poet as well as a mathematician. I was glad to have a bit of poetry mixed in with the mathematics. Since the magazine is hard to find nowadays I take this opportunity to rescue the poem from oblivion.\nDyson\nthen quotes the poem in the commentary in\n[\n2\n]\n, although today the poem is not hard to find since the\nEureka\nmagazine is on the web.\nLet us pause our biography of Alison Falconer at this point and say a little about her two sisters. Jacqueline Stewart Falconer, the eldest of the three sisters, studied physiology at University College, London. Awarded a B.Sc. she was appointed as a Demonstrator in Physiology in the Department of Physiology, Biochemistry and Pharmacology of King's College London in\n1941\n. In\n1944\nshe was appointed as a lecturer in the Physiology Department, Medical School, University of Newcastle. She remained in that Department for the rest of her career and died on\n27\nFebruary\n2010\nat the age of\n91\n. Alison's younger sister Gillian Laura Falconer studied history at\nSomerville\nCollege, where she became friends with Margaret Roberts, later known as Margaret Thatcher, who became Prime Minister. She returned to the family home in St Andrews and lived there with her mother\n[\n10\n]\n:-\nPassionate about art and design, she was skilled at screen printing, some of her designs taken by Liberty and the National Trust. Miss Falconer never married, after the man she described as the \"right one\" died in a motorbike accident before they could wed.\nGillian Falconer died in\n2016\nand left over\n4\nmillion pounds which she had made through stocks and shares\n[\n10\n]\n:-\nMore than £\n1\n.\n4\nm of her fortune was shared out between family and friends, with the rest divided between several causes, also including\nSomerville\nCollege in Oxford, the Scottish Wildlife Trust, the National Trust, the Carlisle Overseas Aid Trust and the John Muir Trust.\nAlison Falconer was a mathematics lecturer at Royal Holloway College from\n1943\nto\n1948\n. During\n1948\nshe was seconded as part of the Marshall Plan to tour Germany and The Netherlands as a member of a team selecting school teachers. She was well qualified for this since not only did she have the mathematical skills but she was fluent in German.\nIn\n1948\nFalconer left her position at Royal Holloway College and over the following few years taught at various different establishments. She lectured at the Regent Street Polytechnic in London from\n1948\nto\n1950\n(\nit became the University of Westminster in\n1992)\n, then from\n1950\nto\n1955\nat Westminster College of Commerce. From\n1951\nto\n1955\nshe was employed as a Lecturer: London County Council Establishment. One of her sons said\n[\n6\n]\n:-\n... she was lecturing on five sites in London. At the same time she was studying externally for a second degree in economics! The exams were set centrally and she had to explain to the Registrar the need to make alternative arrangements, because \"the mathematics exam for my economics course seems to be the one I have set myself!\"\nShe had another job which was to have a major effect on her life. She was employed by the US Air Force to teach mathematics at the Air Force Education Centre in South Ruislip. The courses she gave were part of the University of Maryland Extension Courses which many service men took advantage of. One of the people she taught was John Daniel Dillon\n(1925\n-\n1995)\n. Dillon had been born in Troy, Rensselaer, New York, USA on\n26\nNovember\n1925\nto John D Dillon Sr and Dorothy W Clark. Alison Falconer and John Dillon were married in September\n1955\n. The following newspaper report appeared in May\n1956\n[\n13\n]\n:-\nM Sgt John D Dillon, son of Mrs Dorothy C Dillon of\n501\nPinewoods Avenue, will be a member of the\n1956\ngraduating class connected with the University of Maryland's Overseas Program, which will be held\n26\nMay at the University of Heidelberg, Germany.\nSgt Dillon, who is stationed at South Ruislip Air Force Education Center, South Ruislip, England, took all his University of Maryland credits at the South Ruislip Center, having transferred no other credits from any other university.\nA native of East Hartford, Conn, Sgt Dillon is married to his former mathematics teacher at the South Ruislip Center, Miss Alison Falconer. She is still teaching her mathematics class while he is currently attending a class in military logistics.\nHis job in the Air Force is that of a disbursing supervisor at the West Drayton Air Force base, a few miles outside London. He is also currently taking graduate work at the London School of Economics.\nAlison and John Dillon had three children, Caroline Wheelock Somerville Dillon\n(1956\n-\n1980)\n, John Daniel Dillon III\n(\nborn\n1959)\nand Oliver L J Dillon\n(\nborn\n1961)\n. Caroline Dillon died of Hodgkins' lymphoma in Newcastle upon Tyne on\n9\nMarch\n1980\n. Alison looked after her children and, working from home, did some postal tuition and examining. In\n1967\n, with all of her children at school, she became a mathematics teacher at John Lyon School. Established in\n1876\nby the governors of Harrow School, this academically selective private day school is in Harrow on the Hill, Greater London. When Alison Dillon taught there from\n1967\nto\n1985\nit was a boys' school teaching pupils from\n11\nto\n18\nyears old.\nWe began this biography by saying that Alison Falconer was an exceptional mathematics teacher but we have not yet offered much justification for that statement. Let us give rectify this by quoting from one of her former A-level students at John Lyon School\n[\n6\n]\n:-\nMrs Dillon taught for the glory and joy of the subject. I think she regarded the attainment of a good A-level result as a natural by-product of good teaching, rather than the primary goal of our endeavours. Her philosophy was that worthwhile things should be done for their own sake, and not just to meet some puny little target. There were plenty of excursions beyond the syllabus. It was wonderful preparation for university.\nThe lessons were hard work and stretching; nothing sloppy was tolerated - any hint of the casual would meet with the reprimand, \"nothing is obvious until it has been proved.\" She seemed to have known personally just about every famous mathematician I had ever heard of\n(\nalive or not\n)\n. All was sharp, fresh and energetic. One of our number once enquired: \"Mrs Dillon, what is the use of the sine rule?\" The lightening response was: \"Well, I use it to design looms.\" - weaving being just one of her many hobbies. Mrs Dillon was interested in everything. My\n35\nyear career in research has been underpinned by her teaching and by her approach. My only regret is that we were too young to realise how special and very talented she really was.\nWhile Alison Dillon taught at John Lyon School, the family lived at\n22\nLindon Avenue, Wembley, London and continued to live there after she retired in\n1985\n. John Dillon died on\n25\nJanuary\n1995\n. Alison died on\n28\nJanuary\n2011\naged\n90\n. Her funeral was held at Breakspear Crematorium on Thursday\n10\nFebruary\n2011\n.\nLet us end with the following tribute by Tony Gardiner\n[\n6\n]\n:-\nLike all the best mathematics teachers, Alison's impact cannot be easily summarised in words. Unlike the best mathematicians, mathematics teachers do not have outwardly impressive careers or CVs. Alison left her mark on her students through her distinctive love of the subject, through her unique teaching style, and through the unusual breadth of her interests. In recognition of this, nearly\n40\nyears after she retired, her old school recently introduced the \"Dillon Diploma\" for students aged\n11\n-\n14\n, designed to encourage them to develop an approach to learning and to life that goes way beyond the formal curriculum.\nIt is worth quoting from\n[\n14\n]\nregarding the Dillon Diploma:-\nWhilst the\n21\nst century has brought many new opportunities to pupils in education, there are an increasing number of challenges that pupils must face when they enter the wider world beyond school.\nTo address these challenges we launched the Dillon Diploma. This diploma is designed to enhance and develop students as individuals alongside their academic studies, giving them the ability to become more resilient to a variety of different future scenarios. The diploma is named after Alison Dillon, who was appointed by then Head Boyd Campbell as John Lyon's first female teacher, serving as a Mathematics teacher between the years\n1967\nand\n1985\n. She was truly inspirational and is fondly remembered by Old Lyonians for delivering lessons that went above and beyond the core curriculum. Thus, enabling students to gain places at some of the UK's top universities as well as leading very successful careers.\nThe Dillon Diploma comprises six key modules, which each pupil will study over the first three years of their time in senior school. Each module contributes a new skill which will be developed between Year\n7\nand Year\n9\n. At the heart of the diploma are the eight school values. Pupils are encouraged to be ambitious, innovative, creative and strive for excellence in all the modules. In reading, pupils will be challenged with studying academic articles and journals thereby improving their analytical and reviewing skills. ...\n... pupils who complete the course will become more well-rounded individuals, equipped with a range of skills that will make them more resilient to challenges that they might face in the future, such as public examinations\n(\nincluding preparation for the Higher Project Qualification\n)\nand in their life beyond school. Moreover, pupils will become more independent and able to evaluate their own progress in future tasks.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}