{
  "nome_completo": "Alston Scott Householder",
  "nome_curto": "Alston Householder",
  "ano_nascimento": "1904",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Householder/",
  "lugar_nascimento": "Rockford, Illinois, USA",
  "lugar_morte": "Malibu, California, USA",
  "biografia": "Alston Householder\nspent his childhood in Alabama where his family had moved shortly after he was born. After attending school, he entered Northwestern University in Evanston, Illinois where he studied philosophy, receiving his BA in\n1925\n. He then went to Cornell University in Ithaca, New York where he continued his study of philosophy, receiving his MA in\n1927\n.\nHouseholder then taught mathematics in a number of different places and began to work for his doctorate in mathematics. He was awarded a Ph.D. by the University of Chicago in\n1937\nfor a thesis on the\ncalculus of variations\n. However his interests were moving towards applications of mathematics, particularly applications of mathematics to biology.\nFrom\n1937\nHouseholder spent eight years working on mathematical biology as a member of the Committee for Mathematical Biology at the University of Chicago. John Hearon, after retiring from the National Institutes of Health, wrote of Householder's work over this period:-\nHypothesis, conjecture and tentative theory flew in all directions and there was a period of great ferment. In the midst of this, to every area to which he addressed himself Householder brought organisation and systemisation. He was then, and for some years to come, the only one of the group formally trained as a mathematician. It showed. He brought to every problem he undertook unification, generality of method and, in the end, simplicity.\nAlthough this work on mathematical biology occupied Householder for a relatively short period of his career, he wrote\n33\npapers on the topic and a monograph\nMathematical Biophysics of the Central Nervous System\nwritten jointly with Herbert D Landahl and published in\n1944\n. The book is:-\n... an exposition and an enlargement of work which, to a great extent, was done by the authors themselves towards the establishment of a mathematical neuropsychology.\nIn\n1944\nHouseholder left the Committee for Mathematical Biology and became involved in the war effort. In\n1946\n, after the end of the war, Householder joined the Mathematics Division of Oak Ridge National Laboratory. Here he changed topic, leaving behind his research interest of mathematical biology and moving into numerical analysis which was increasing in importance due to the advances in computers. Not surprisingly there is a gap in Householder's prolific publication record while he became a leading expert in this new area. He started publishing on this new topic with\nSome numerical methods for solving systems of linear equations\nwhich appeared in\n1950\n.\nEven before this first publication in numerical analysis, Householder had been appointed Head of the Mathematics Panel of the Oak Ridge National Laboratory in\n1948\n. This role certainly did not prevent him from taking a leading role in research in numerical analysis in general and in numerical linear algebra in particular.\nWilkinson\nwrote:-\nIn the\n1950\ns our knowledge of this topic was in a rather chaotic state. A large number of algorithms had been developed but no systematic study of their inter-relationships had been undertaken. It is primarily due to the work of Householder that order has emerged from this chaos. In a remarkable series of papers he effectively classified the algorithms for solving linear equations and computing eigensystems, showing that in many cases essentially the same algorithm had been presented in a large variety of superficially quite different algorithms. The resulting classification made it possible to concentrate on the most profitable lines of research and in this way his work was directly responsible for the development of many of the most effective algorithms in use today. Of particular importance is his appreciation of the value of elementary hermitian\nmatrices\nin numerical analysis.\nThe lasting impact of Householder's work in this area is described in\n[\n1\n]\n:-\n... Householder transformations are now routinely taught in courses in linear algebra, throughout the world, as is the systematic use of norms in linear algebra, which he pioneered.\nIn\n1964\nHouseholder published one of his most important books\nThe theory of matrices in numerical analysis\n. This book was reviewed by\nRichard Varga\nwho wrote:-\nWithout question, this book represents one of the real highs in scholarly attainment in numerical analysis, and as such, it belongs on the shelves of students and researchers alike in this field. The author has succeeded in bringing all the related contributions of various authors in the field of matrix theory under a single unified point of view. The scholarly depth of this book is indicated by forty-four pages of bibliography, with approximately nine hundred titles; the bibliography alone is one-fifth of the book.\nHouseholder will certainly not only be remembered for his research contributions. Equally important as a contribution to mathematics was his organising the Gatlinburg Symposium on Numerical Linear Algebra. The idea for the first symposium was born in\n1960\nwhen Householder and several other colleagues discussed the idea at Ann Arbor. The first symposium took place in April\n1961\nand\n[\n1\n]\n:-\n... numerical analysts from around the world gathered in the beautiful atmosphere of the Smoky Mountains in Tennessee to share their latest results.\nThere followed more Gatlinburg Symposia. The second was in\n1963\n, the third in\n1964\nand the fourth in\n1969\n. Householder left Oak Ridge National Laboratory in\n1969\n, after\n25\nyears service, and became Professor of Mathematics at the University of Tennessee. The year\n1969\nwas important for Householder in other ways too, for in that year he received the Harry M Goode Memorial Award, a medal and $\n2\n,\n000\nawarded by the Computer Society:-\nFor his impact and influence on computer science in general and particularly for his contributions to the methods and techniques for obtaining numerical solutions to very large problems through the use of digital computers, and for his many publications, including books, which have provided guidance and help to workers in the field of numerical analysis, and for his contributions to professional activities and societies as committee member, paper referee, conference organiser, and society President.\nAfter five years as Professor of Mathematics at the University of Tennessee, Householder retired. The Gatlinburg Symposia continued after he left Oak Ridge but they moved to different locations in Europe and North America. The authors of\n[\n1\n]\nwrite:-\n... to honour him for his many contributions, these symposia are now called the Householder Symposia.\nAt the\n13\nth\nin the series of Householder Symposia held in Pontresina, Switzerland in\n1996\n, Friedrich L Bauer spoke on\nMemories of Alston Householder\n. He described him in the following way:-\n[\nAlston Householder\n]\nhad a full life, with many friends and people who admired him. He was an American in the best sense of the word, liberal and socially conscious. Yet he was a cosmopolitan with a thorough knowledge of foreign languages and cultures. He was a mathematician of distinction. Above all he was a friendly human being. We miss him very much.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}