{
  "nome_completo": "Victor Mayer Amédée Mannheim",
  "nome_curto": "Amédée Mannheim",
  "ano_nascimento": "1831",
  "ano_morte": "1906",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mannheim/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Amédée Mannheim\n's parents were Sigismond Mannheim and his wife Marianne Speyer. They were of Jewish descent. From an early age Amédée showed a very strong aptitude for the exact sciences. From the age of ten years, despite being the youngest in his class, he was the only one who could solve the difficult geometry problems proposed by his teacher. After completing the course of study at the Institution Martelet, at the age of sixteen he was admitted to École centrale. Now although the Institution Martelet was the standard route for pupils going on to the École centrale, nevertheless, Mannheim quickly left the École and, instead, prepared for entering the Grand Écoles at the Collège de Charlemagne. Now going to this College proved to be a very good move since at the Collège de Charlemagne he was taught mathematics by\nEugène Catalan\n. The excellent teaching, guidance and support that\nCatalan\nprovided for his young student was an important factor in his mathematical career. In fact it was during this year at the Collège de Charlemagne that he undertook research on geometry and began publishing papers based on his research.\nThe summer of\n1848\nbetween Mannheim completing his studies at the Collège de Charlemagne and entering university, was a time of revolution in Paris. This revolution materialised without any very definite cause, although food shortages from\n1846\nonwards had caused much economic trouble and discontent of which the Republicans took advantage. The trigger appears to have been the cancellation by the government of a major banquet arranged for February\n1848\nby the Republicans. There followed a brief civil war in June\n1848\nwhen students and workers built barricades and, attacked by artillery, saw around\n1500\nof them killed and around\n12000\narrested. These must have been extremely difficult time for the young Mannheim, particularly since his teacher\nCatalan\nwas involved in the revolution.\nMannheim entered the École Polytechnique in Paris in\n1848\nat the age of\n17\n, again the youngest student in the course. As we mentioned above, he was already publishing papers in the year he began his university studies, with\nThéorème sur les axes de l'ellipse et de l'hyperbole\nⓉ\n(\nTheorem on the axes of the ellipse and hyperbola\n)\nand\nSolution géométrique du problème sur l'axe radical\nⓉ\n(\nGeometric solution of the problem on the radical axis\n)\nboth appearing the\nNouvelles annales de mathématiques\nin\n1848\n. While he was at the École Polytechnique he got to know his fellow student Charles Nicolas Peaucellier\n(1832\n-\n1919)\nwho later invented mathematical instruments inspired by Mannheim. One of their teachers was\nMichel Chasles\nwhose lectures on geometry had a major influence on the young student Mannheim. The director of the École Polytechnique for the two years that Mannheim studied there was\nJean-Victor Poncelet\nwho, like\nChasles\n, was to have a major influence on Mannheim.\nPoncelet\nretired in the year that Mannheim graduated but the two collaborated some years later. After two years studying at the École Polytechnique, Mannheim went to Metz where he attended the École d'Application. Now\nPoncelet\nhad taught at Metz twenty years earlier, spending ten years as Captain of Engineers and another ten as Professor of Mechanics there.\nAlthough slide rules existed before Mannheim's time, invented by\nWilliam Oughtred\nand\nEdmund Gunter\nand others, it was Mannheim who standardised the modern version of the slide rule which was in common use until pocket calculators took over a few years ago. It was around\n1850\n, while he was a student at Metz, that the ideas for this slide rule came to Mannheim. The components are described in the\n19\nth century book by W M Cox written at a time when Mannheim's version of the slide rule was being imported from France into other countries\n[\n1\n]\n:-\nThe Slide Rule, as recently perfected by Mannheim, an officer of the Artillery at Metz, is generally made of well-seasoned box-wood, and is about\n10\ninches long,\n1\n1\n2\n1\\large\\frac{1}{2}\\normalsize\n1\n2\n1\n​\ninches broad and\n1\n4\n\\large\\frac{1}{4}\\normalsize\n4\n1\n​\nto\n3\n8\n\\large\\frac{3}{8}\\normalsize\n8\n3\n​\ninches thick. ... Along the centre of a slip of the same material slides easily from left to right and right to left, in a groove to which it is accurately fitted, its face being perfectly level with the Rule. This is the Slide. On the Rule will be seen, along its whole length, and close to the upper edge of the groove, a series of graduations, with an identically similar series along the upper edge of the Slide. These form the upper scales ... Another series of graduations will also be seen on the Rule along the lower edge of the groove, with a corresponding series on the Slide. These ... are the lower scales. ... Each instrument is provided with a brass or glass Runner, which enables coinciding points to be found on any of the scales, and also permits the extensive calculations being worked out without the necessity of \"reading off\" the intermediate results, thus securing a greater degree of accuracy in the final one. Such is the Mannheim Slide Rule. Its successful use lies largely in the ability to read the graduations rapidly and correctly.\nThe glass Runner that Cox mentions was a clever idea by Mannheim and it is more often today called a cursor or indicator. Allow me a little personal note. I\n[\nEFR\n]\npurchased a slide rule of the Mannheim type when I was at school and my parents paid\n5\npounds for it. That would be the equivalent of perhaps\n100\npounds today so the calculator has not only given us a better calculating tool but also a much cheaper one. However, I still have the slide rule and treasure it, while I have thrown out all my early calculators.\nAfter graduating from the École d'Application in Metz, Mannheim became an officer of the French artillery. He continued to undertake research in mathematics particularly on the polar reciprocal transformation. He wrote two books at this stage in his career, namely\nThéorie des polaires réciproques\nⓉ\n(\nReciprocal polar theory\n)\n(1851)\nand\nTransformation de propriétés métriques des figures à l'aide de la théorie des polaires réciproques\nⓉ\n(\nTransformation of metric properties  of figures using the reciprocal polar theory\n)\n(1857)\n. After several years in the military, Mannheim was appointed to the École Polytechnique in Paris, while continuing his army career. He also published further papers on geometry. His first appointment at the École Polytechnique was as a répétiteur in\n1859\n, then in\n1863\nhe was appointed as an examiner. In the following year Mannheim was appointed as Professor of Descriptive Geometry at the École Polytechnique. Koppelman writes in\n[\n1\n]\n:-\nHe was a dedicated and popular teacher, strongly devoted to the École Polytechnique, and was one of the founders of the Société Amicale des Anciens Elèves de l'École.\nHe continued to publish papers; see the list we have compiled of around\n240\npublications by Mannheim at\nTHIS LINK\n.\nOn\n12\nAugust\n1868\nMannheim married Eugénie Adèle Mathilde Oulif\n(1838\n-\n1906)\n.\nMichel Chasles\n, described as a friend of the groom, was one of the witnesses. Another witness was Jules Emile Oulif\n(\nborn\n1829)\n, an elder brother of the bridegroom. They had two children\n(\nand perhaps more\n)\n, namely Nelly Mannheim\n(28\nSeptember\n1869\n-\n4\nDecember\n1941)\nand Charles Amédée Mannheim\n(18\nMarch\n1872\n-\n31\nOctober\n1943)\n. Charles \"residing at\n21\nBoulevard Beausjour, Paris, France, invented new and useful Improvements in a Progressive Change-Speed Gear\".\nWe mentioned above that Charles Nicolas Peaucellier was a fellow student of Mannheim's at the École Polytechnique. Like Mannheim, he made a career in the French army. Inspired by Mannheim, in\n1864\nhe reported on his invention of a mechanism to convert rectilinear motion into circular motion. He described his invention in\n1868\nand gave a public demonstration in\n1873\n. It found rapid application in the design of steam locomotives.\nThe\nFrench Mathematical Society\nwas founded in\n1872\nand it began publishing the\nBulletin de Société Mathématique de France\nin the following year. Mannheim was involved with the Society from its foundation and published\nSur les trajectoires des points d'une droite mobile dans l'espace\nⓉ\n(\nOn the paths of points of a movable line in space\n)\n(1873)\nin the first volume of the\nBulletin.\nHe was elected as president of the Society and served in that role in\n1877\n-\n78\n.\nIn\n1880\nMannheim published the book\nCours de géométrie descriptive de l'École Polytechnique comprenant les éléments de la géométrie cinématique\nⓉ\n(\nCourse in descriptive geometry given at the Ecole Polytechnique, including the elements of the kinematic geometry.\n)\n. He begins the Preface by writing:-\nAfter fifteen years of teaching, during which I tried constantly to improve and complete my education, I decided to publish this book. It contains lessons that I delivered at the École Polytechnique in winter of\n1878\n-\n1879\n. By replicating them, virtually without modification, I hope to give them a more lively form than if I had tried to produce concise writing.\nIn the Preface he explains how he came to give a course on Kinematic Geometry:-\n[\nIn this work\n]\nthe components of the Kinematic Geometry, are didactically presented for the first time. Here is how I was led to enter this new field. In\n1867\n, the Development Council of the École Polytechnique enacted the enlightened and liberal proposal of General Favé, then commander of the school, which gave teachers the right to modify their teaching. Taking advantage of this latitude, I began from that time, to make use of several properties related to the movement of figures; I successively added others. It is properties of this kind that I have grouped together to form my course of Kinematic Geometry. In various memoirs and numerous notes, presented to the Academy of Sciences, I had prepared long ago, materials of this particular branch of geometry. Most of these works are coordinated in this work; and together they form, strictly speaking, the body of a doctrine. While Kinematics is the study of motion regardless of forces, Kinematic Geometry relates to the study of movement independently of forces and of time.\nMannheim retired from his army post in\n1890\n, having attained the rank of colonel in the engineering corps. He continued teaching at the École Polytechnique until he retired in\n1901\nat the age of\n70\n.\nHe made numerous contributions to geometry and for his outstanding contributions to the subject he was awarded the Poncelet Prize of the Académie des Sciences in\n1872\n. He published papers such as\nSur les trajectoires des points d'une droite mobile dans l'espace\nⓉ\n(\nOn the paths of points of a movable line in space\n)\n(1872)\n,\nConstruire la sphère osculatrice en un point de la courbe d'intersection de deux surfaces données\nⓉ\n(\nBuilding osculating sphere at a point on the curve of intersection of two given surfaces\n)\n(1873)\n,\nNouvelles propriétés de quelques courbes\nⓉ\n(\nNew properties of some curves\n)\n(1875)\n,\nSur les surfaces dont les rayons de courbure principaux sont fonctions l'un de l'autre\nⓉ\n(\nOn the surfaces of which the principal radii of curvature are functions of one another\n)\n(1877)\n,\nSur le paraboloide des normales d'une surface réglée\nⓉ\n(\nOn the normal paraboloid a ruled surface\n)\n(1877)\n,\nNouvelle démonstration d'un théorème relatif au déplacement infiniment petit d'un dièdre et nouvelle application de ce théorème\nⓉ\n(\nNew demonstration of a theorem on the infinitesimal displacement of a dihedral and a new application of this theorem\n)\n(1878)\n, and\nDémonstrations géométriques d'un théorème relatif aux surfaces réglées\nⓉ\n(\nGeometric demonstrations of a theorem on regular surfaces\n)\n(1878)\n. We saw above that in the early part of his career he studied the polar reciprocal transformation introduced by\nChasles\nand later he applied his results to kinetic geometry. For example he published the book\nPrincipes et développements de la géométrie cinématique; ouvrage contenant de nombreuses applications à la théorie des surfaces\nⓉ\n(\nPrinciples and developments of kinematics geometry; with many applications in the theory of surfaces\n)\nin\n1894\n. Mannheim's own definition of kinetic geometry considered it to be the study of motion of a figure without reference to any forces, time or other properties external to the figure. In the Preface to\nCours de géométrie descriptive de l'École Polytechnique comprenant les éléments de la géométrie cinématique\nⓉ\n(\nCourse in descriptive geometry given at the Ecole Polytechnique, including the elements of the kinematic geometry.\n)\nMannheim pays the following tribute to the founders of kinematics:-\nAllow me to recall the names of three famous French mathematicians I like to quote:\n(\ni\n)\nAmpère\n, who has distinguished in mechanics the particular branch he named kinematics;\n(\nii\n)\nPoncelet\n, who created masterfully the 'Enseignement de la Cinématique' at the Sorbonne in\n1838\n;\n(\niii\n)\nM Chasles\n, whose beautiful work on geometry has contributed significantly to the progress of kinematics. With these masters, this branch of the Science is now universally studied, special chairs have been founded, and many books have been published. Among them I merely point out the major 'Traité de Cinématique' by M Resal.\nMannheim's work on the exact synthesis of mechanisms is studied in\n[\n8\n]\n.\nHe also studied surfaces, in particular\nFresnel\n's wave surfaces. The paper\n[\n7\n]\nstudies this aspect of his work in detail.\nThe list of Mannheim's publications shows that in the four years before he retired he published very little\n(\nby his standard\n)\nbut after retiring he returned to his remarkable, but typical, quantity of papers right up to the time of his death.",
  "math_areas": [
    "Geometry"
  ]
}