{
  "nome_completo": "Benoit Paul Émile Clapeyron",
  "nome_curto": "Émile Clapeyron",
  "ano_nascimento": "1799",
  "ano_morte": "1864",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clapeyron/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Émile Clapeyron\nwas born on the\n7\nth day of the Revolutionary month\nPluviose\n, which corresponds to\n26\nth January. He was educated at the École Polytechnique from which he graduated in\n1818\n. He then went to the École des Mines where he trained as an engineer along with his friend Gabriel\nLamé\n.\nClapeyron and\nLamé\nwent together to Russia in\n1820\n. Alexander I of Russia had set up a team of engineers to improve the roads and bridges of Russia and he turned to France to provide the expertise in teaching and leading the newly formed teams. Clapeyron and\nLamé\nwent to St Petersburg where the École des Travaux Publics had been set up and these they taught both pure and applied mathematics. They both also engaged in leading the construction work as well as lecturing.\nBoth Clapeyron and\nLamé\nremained in Russia for\n10\nyears. During that time they published joint mathematical and engineering work in a number of journals. They left following the revolution of\n1830\nwhen their political views made them feel unwelcome. They returned to France at a time when railways were just beginning to be constructed but the early ventures had been economic failures. They had the vision to see the great future in railways and money began to go into a study of engineering problems associated with their development.\nClapeyron proposed a railway line from Paris to St Germain and sought funding for the project. However, before funding was obtained he was offered a chair at the École des Mineurs in St Étienne. In\n1835\nthe construction of the line from Paris to St Germain was authorised and Clapeyron and\nLamé\nwere put in charge of the project.\nLamé\nwas offered the chair of physics at the École Polytechnique shortly after they began their work and Clapeyron was left to head the venture.\nIn\n1836\nClapeyron, who specialised in designing steam locomotives, went to England to arrange for the building of some specialist locomotives. Clapeyron approached Stevenson, the most famous of the builders of locomotives, but Stevenson found Clapeyron's designs too difficult and declined the contract. Clapeyron then approached Sharp, Roberts, and Company, a firm which made railway locomotives in one of the earliest applications of the use of interchangeable parts. Continuing with his project on his return to France, Clapeyron extended his activities to the design of metal bridges.\nIn\n1844\nClapeyron was appointed professor at the École des Ponts et Chaussées then, in\n1848\n, he was elected to the\nParis Academy of Sciences\n. He served the Academy on many committees, in particular serving on the committee which awarded the mechanics prize. He also served on a committee investigating the construction of the Suez Canal and on a committee which considered how steam engines could be used in the navy.\nClapeyron expressed\nSadi Carnot\n's ideas on heat analytically, with the help of graphical representations, in\n1834\n.\nSadi Carnot\n's work was virtually unknown before Clapeyron's paper in which the Carnot cycle is given in mathematical formulation. This work of Clapeyron had important influences on\nThomson\nand\nClausius\nwhen its importance for the second law of thermodynamics became apparent. The Clapeyron relation, a\ndifferential equation\nwhich determines the heat of vaporisation of a liquid, is named after him.",
  "math_areas": [
    "Applied Mathematics"
  ]
}