{
  "nome_completo": "Charles Émile Picard",
  "nome_curto": "Émile Picard",
  "ano_nascimento": "1856",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Picard_Emile/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Émile Picard\n's father was the manager of a silk factory who died during the siege of Paris in\n1870\n. The siege was a consequence of the Franco-Prussian War which began on\n19\nJuly\n1870\n. It went badly for France and on\n19\nSeptember\n1870\nthe Germans began a siege of Paris. This was a desperate time for the inhabitants of the town who killed their horses, cats and dogs for food. It was during this siege that Émile's father died. Paris surrendered on\n28\nJanuary\n1871\nand The Treaty of Frankfurt, signed on\n10\nMay\n1871\n, was a humiliation for France.\nPicard's mother, the daughter of a medical doctor, was put in an extremely difficult position when her husband died. As well as Émile, she had a second young son, and in order to support them through their education she had to find employment. Only her determination to give her sons a good start, despite the tragedy, allowed Émile to receive the education which gave him the chance to achieve the highest international stading in mathematics. Picard's secondary education was at the Lycée Napoléon, later called the Lycée Henri IV. Strangely he was a brilliant pupil at almost all his subjects, particularly in translating Greek and Latin poetry, but he disliked mathematics. He himself wrote that he hated geometry but he:-\n... learned it by heart in order to avoid being punished.\nIt was only during the vacation after completing his secondary studies that Picard read an algebra book and suddenly he became fascinated in mathematics. He took the entrance examinations for École Polytechnique and École Normale Supérieure; he was placed second and first respectively in the two examinations.\nHadamard\nwrote in\n[\n8\n]\n:-\nAs any young Frenchman of our time who was gifted in science, he was obliged to choose between the École Polytechnique which, in principle, prepared one to be an engineer, and the École Normale, with its pure scientific orientation. He was ranked first and chose the latter. It is said that he made this decision after an exciting visit to Pasteur, during which the father of bacteriology spoke about pure science in such lofty terms that the young man was completely persuaded.\nPicard received his\nagrégation\nin\n1877\n, being placed first. He remained at the École Normale Supérieure for a year where he was employed as an assistant. He was appointed lecturer at the University of Paris in\n1878\nand then professor at Toulouse in\n1879\n. In\n1881\nhe returned to Paris when appointed maître de conférence in mechanics and astronomy at the École Normale.\nIn\n1881\nPicard was nominated for membership of the mathematics section of the\nAcadémie des Sciences\n. It says much of the extraordinary ability that he was showing at such a young age that he was nominated. He had already proved two important theorems which are both today known under Picard's name, yet it was still a little soon to gain admission to the prestigious academy and he would have to wait a few more years. In this year of his first nomination he married\nHermite\n's daughter. Picard and his wife had three children, a daughter and two sons, who were all killed in World War I. His grandsons were wounded and captured in World War II.\nIn\n1885\nPicard was appointed to the chair of differential calculus at the Sorbonne in Paris when the chair fell vacant on the death of Claude\nBouquet\n. However a university regulation prevented anyone below the age of thirty holding a chair. The regulations were circumvented by making Picard his own suppléant until he reached the age of thirty which was in the following year. He requested exchanging his chair for that of analysis and higher algebra in\n1897\nso that he was able to train research students.\nPicard made his most important contributions in the fields of analysis, function theory,\ndifferential equations\n, and analytic geometry. He used methods of successive approximation to show the existence of solutions of ordinary differential equations solving the\nCauchy\nproblem for these differential equations. Starting in\n1890\n, he extended properties of the\nLaplace\nequation to more general elliptic equations. Picard's solution was represented in the form of a convergent series.\nIn\n1879\nhe proved that an\nentire function\nwhich is not constant takes every value an infinite number of times, with one possible exception. Picard used the theory of\nHermite\n's modular functions in the proof of this important result.\nBuilding on work by\nAbel\nand\nRiemann\n, Picard's study of the integrals attached to algebraic surfaces and related\ntopological\nquestions developed into an important part of\nalgebraic geometry\n. On this topic he published, with Georges Simart,\nThéorie des fonctions algébriques de deux variables indépendantes\nⓉ\n(\nTheory of algebraic functions of two independent variables\n)\nwhich was a two volume work, the first volume appearing in\n1897\nand the second in\n1906\n. Picard also discovered a group, now called the Picard group, which acts as a group of transformations on a linear differential equation.\nHis three volume masterpiece\nTraité d'analyse\nⓉ\n(\nTreatise on analysis\n)\nwas published between\n1891\nand\n1896\n. The treatise\n[\n1\n]\n:-\n... immediately became a classic and was revised with each subsequent edition. The work was accessible to many students through its range of subjects, clear exposition, and lucid style. Picard examined several specific cases before discussion his general theory.\nPicard also applied analysis to the study of elasticity, heat and electricity. He studied the transmission of electrical pulses along wires finding a beautiful solution to the problem. As can be seen his contributions were both wide ranging and important.\nAmong the honours given to Picard was his election to the\nAcadémie des Sciences\nin\n1889\n, eight years after he was first unsuccessfully nominated. He later served the Academy as its permanent secretary from\n1917\nuntil his death in\n1941\n. In this role\n[\n1\n]\n:-\n... he wrote an annual notice on either a scientist or a subject of current interest. He also wrote many prefaces to mathematical books and participated in the publication of works of\nC Hermite\nand\nG H Halphen\n.\nPicard was awarded the\nPoncelet\nPrize in\n1886\nand the Grand Prix des Sciences Mathématiques in\n1888\n. In addition to honorary doctorates from five universities and honorary membership of thirty-seven learned societies he received the Grande Croix de la Légion d'Honneur in\n1932\nand the\nMittag-Leffler\nGold Medal in\n1937\n. He became a member of the Académie Française in\n1924\n. Another honour was given to him was making him President of the International Congress of Mathematicians at Strasbourg in September\n1920\n.\nHadamard\nhad this to say of Picard as a teacher when he addressed him in\n1937\n:-\nYou were able to make\n[\nmechanics\n]\nalmost interesting; I have always wondered how you went about this, because I was never able to do it when it was my turn. But you also escaped, you introduced us not only to hydrodynamics and turbulence, but to many other theories of mathematical physics and even of infinitesimal geometry; all this in lectures, the most masterly I have heard in my opinion, where there was not one word too many nor one word too little, and where the essence of the problem and the means used to overcome it appeared crystal clear, with all secondary details treated thoroughly and at the same time consigned to their right place.\nHadamard\nwrote in\n[\n8\n]\n:-\nA striking feature of Picard's scientific personality was the perfection of his teaching, one of the most marvellous, if not the most marvellous, that I have ever known.\nIt is a remarkable fact that between\n1894\nand\n1937\nhe trained over\n10000\nengineers who were studying at the École Centrale des Arts et Manufactures.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}