{
  "nome_completo": "Anania Širakuni",
  "nome_curto": "Ananias of Shirak",
  "ano_nascimento": "595",
  "ano_morte": "670",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anania/",
  "lugar_nascimento": "Anēank', Širak province, Armenia",
  "lugar_morte": "Anavank', Armenia",
  "biografia": "Ananias of Shirak\n(\nalso known as\nAnania Širakuni\nor\nAnania Širakac'i\n)\nwas a seventh century Armenian polymath, widely believed to have been born between\n595\nand\n600\nAD, in the village of Anania\n(\nAnēank`\n)\nin the canton of Širak, to the north of the river Araxes\n(\nnow Aras\n)\nand west of Mt Aragats. Some manuscripts style him as Širakuni, which suggests that he possibly belonged to the hereditary princely line of Kamsarakan or Aršurani of the Širak and Aršuarunik' provinces. His father was John of Širak, and it is reasonable to assume he was in possession of a considerable amount of personal wealth, being able to self-finance an extensive education.\nMost of what is known about the life of Ananias comes from his autobiography,\nAutobiography\n[\n4\n]\n, which primarily focuses on his education and academic career, and the academic credentials of his teacher, Tychikos. We find he was initially educated within his local provinces, but after exhausting the resources available to him, was set on seeking further education, particularly in philosophy and mathematics. His motivation appears to be initially fuelled by a divine fear inspired by Scripture to pursue wisdom and knowledge at all costs\n[\n4\n]\n:-\n... Solomon had commanded: \"Acquire wisdom and strive to oppose ignorance by calling the creator\n[\nof ignorance\n]\ndarkness\"  and \"You who have rejected knowledge, I shall also reject you\". And being frightened by these threats, I wanted to attain blessing once more and I desired to pursue philosophy. I was particularly lacking in the science of mathematics, since I reckoned that nothing could be worked out without numbers, esteeming\n[\nthis science\n]\nthe mother of all knowledge.\nConsequently, Ananias made his way to Theodosiopolis\n(\nnow Erzerum, in eastern Turkey\n)\n, and was advised by a man named Eliazar to pursue further education in the Byzantine province of Fourth Armenia under the mathematician Christosatur. Six months later he left in pursuit of a more substantial education in Constantinople after finding the understanding of Christosatur unsatisfactory. He was advised by friends instead to pursue education under the 'Master of Byzantium', Tychikos, in the town of Trezibond on the shore on the Black Sea. Tychikos was affirmed as\n[\n4\n]\n:-\na man filled with wisdom, who knows both the Armenian script and language and is celebrated among kings.\nAdditionally Philagrius, deacon of the patriarch of Constantinople, was bringing a group of select students to study under Tychikos.\nThe learned doctor readily accepted Ananias as a pupil, rejoicing in what he expressedly believed to be God's providence in bringing understanding to the Armenian people - a sentiment Ananias also readily expressed. Ananias undertook eight years of study under Tychikos, where he not only acquired a thorough knowledge of mathematics, but also other sciences\n[\n4\n]\n:-\n... I also gained some instruction in the other\n[\nsciences\n]\n. I became well-versed in many books which had not been translated into our language. For he had every book to hand, books that were available and those that were secret, profane and scientific works, historical narratives and medicinal and chronological works.\nAnanias states that he was loved as a son by Tychikos, who shared all thoughts and knowledge with him to the extent of inciting jealousy amongst those who had journeyed from the royal court to receive an education under the master. By the time he left, Ananias had a thorough grounding in the\nquadrivium\n, and decided to return to Armenia, to introduce this\n[\n4\n]\npowerful science ... desired by kings\nback to Armenia.\nAccording to Greenwood\n[\n2\n]\n, this statement likely refers to the enthusiasm of eastern Roman emperor Heraclius for a higher education. Greenwood places the start of the education of Ananias under Tychicus between\n631\nand\n638\n, and claims Tychikos was likely a pupil of Stephanos of Alexandria, who fostered the study of philosophy and the mathematical sciences and specialised in arithmetic and astronomy under the much broader syllabus of the quadrivium. Stephanos of Alexandria is believed to be associated with a resurgence of the pursuit and prominence of mathematical sciences and philosophy under the promotion and favour of Heraclius.\nUpon returning home to Armenia, Ananias became embittered with the reception of his education and teaching by his fellow country-men, who did not seem to share his value of such pursuits\n[\n4\n]\n:-\n... no one was grateful or recognised my labour, because our people does not love learning and knowledge, since they are idle and lazy.\nHe complained about fickle and dilettante pupils who abandoned study after barely grasping the mere basics of a discipline and then went on to fraudulently proclaim themselves as masters under Ananias's tutelage. He claimed they spread an incomplete or incorrect education and even defamed Ananias himself as a fraud. Despite this, Ananias continued to receive pupils\n[\n4\n]\n:-\nI did not turn anyone away who wanted to learn, and in the future I shall not turn them away. I leave this as an everlasting monument for you who shall come to this country after me, those who love learning and desire meaning and knowledge.\nWith money earned through his teaching, Ananias financed his own research. A true polymath, his work covers a variety of fields, including arithmetic, astronomy, chronology, theology, geography and cosmology. Although heralded as the father of mathematical sciences in the Armenian tradition, scholarly work on the exact corpus of his writings is still at an early stage and under dispute in some incidences. According to Pambakian\n[\n1\n]\n, at least\n29\npieces have been identified, some of whose authorship is openly disputed. Some works have attracted more scholarly attention than others, such as\nGeography\n,\nMathematical Problems\nand\nOn Weights and Measures\n. Amongst his mathematical works, Ananias produced the earliest known book of arithmetical tables using the four basic operations, with numbers reaching up to\n80\nmillion, which was the largest number available in his system.\nDuring his lifetime, Ananias's fame spread beyond Armenia. There is at least one firm incidence of patronage by the Holy See in the commissioning of a perpetual calendar of the movable and immovable feasts in the Armenian church by the Catholicos Anastas Akorec'i\n(661\n-\n667)\n. Ananias's revised calendar,\nK'nnikon\n, was completed, and lauded as \"admirable\"  or \"astonishing\"  by\n8\nth century scholar Step'anos Tarōnec'i in his\nUniversal Chronicle\n[\n5\n]\n, however the death of Anastas before the ratification of the calendar by a church council prevented the calendar from being adopted by Armenian church.\nThere is no doubt of the independence of thought of the scholar, and many of his teachings challenged the church's accepted interpretation of\ncosmography\n, coming close to the heresy of dualism- a philosophical framework which allowed a dual source of origin for creation and/or good and evil, rather than one omnipotent, omniscience, omnipresent and omnibenevolent God\n[\n3\n]\n. After his death, the revolutionary nature of his ideas caused the Armenian church to proscribe much of his work, and several of his treatises were later attributed to other authors.\nAnanias taught that the world is a sphere, directly illuminated by the Sun resulting in day on one side and night on the other. He disagreed with the notion of some philosophers that the moon is a mirror and that the markings on the moon reflect the seas of the Earth. Ananias claimed instead that the moon directly reflects the Sun, and the moon's markings are due to the unevenness of the moon's surface, with the uneven areas absorbing rather than reflecting sunlight. He taught this despite the propensity for various fathers of the Church to claim the moon was in itself a source of light, and Ananias deferred to the work of pagan scholars in disputing this claim\n[\n8\n]\n:-\nCertain ecclesiastics allege that the moon emits its own light ... but I am of the same opinion as many philosophers who claim that it receives the light of the sun.\nAnanias studied the moon extensively and correctly ascribed the waxing and waning of tides to the influence of the moon. He also held that the Sun is larger than the moon, but that it lies at a greater distance from Earth than the moon, which causes it to appear the same size, and correctly explained the causes of lunar and solar eclipses. He also held that the Milky Way is an extended mass of faint, but luminous stars\n(\nSee\n[\n6\n]\n)\n.\nAnanias disagreed with the prevalent interpretation of Genesis that God created the perfect world in six days, and thus indirectly created the\nfour elements\n: fire, air, water and earth. Instead he asserted that the uncaused cause\n(\ni.e. God\n)\ndirectly created the elements and their qualities and prescribed their natural development, however He does not interfere with their consequent evolution,\n[\n3\n]\nthe natural course of the development of things\n. He asserted the that evolution of nature and the becoming, expansion, decreasing and decaying of the natural world was caused by the union of elements. To Ananias, each of the\nfour elements\nalso had a corresponding weight and density, which he considered inseparable attributes, and qualities could be transferred or new synthesese created through the mixing of elements, such as humid air becoming dry.\n(\nSee\n[\n8\n]\n)\nHe also asserted that the four elements were imperfectly created, but subject to improvement through change. Time was not an attribute of matter, but a separate criterion directly associated with movement, and the material unity of the Universe as whole led to constant change and progress\n[\n6\n]\n:-\nThe same\n[\nchange or progress\n]\nis true in the case of blood or breathing or in the case of the origin and destruction of matter for the origin of matter is the beginning of its destruction and the destruction of matter is the beginning of its origin and the result of this harmless contradiction is the eternal universe.\nAs God did not normally interfere with the natural order of things, on the whole everything is dictated by the laws of necessity. Thus eclipses can be predicted, and the orbit of the moon can be predicted from its motion and the cyclic evolution of its face. Deviation from the laws of necessity would only occur supernaturally under divine intervention. He denounced astrologers, and dismissed the influences of stars on the affairs of mankind.\n(\nSee\n[\n9\n]\n)\nAnanias agreed with\nPtolemy\n's structure of the universe, and his cosmology divided the material heavens into a series of nested spheres. The topmost sphere contained the \"ether\"\n(\narp'i\n)\n, from which all light and heat originated. This next sphere inwards was a \"cold\" sphere, neutralising the scorching heat of the ether. The next sphere, the \"crater\"  sphere, contained the Sun, followed by the \"beautiful\"  sphere in which the moon and planets resided. Meteorological phenomena such as lighting and thunder then directly encircled the Earth. The progression of heat from the ether, mixed with coldness and humidity of other layers, and finally water on the Earth caused the regeneration of the soil and development of the Earth.\nAccording to Xrlopean\n[\n8\n]\n, before the notion of gravity, Ananias explained the movements of celestial bodies in the heavens by the influence of two opposing forces, and attributed the great weight of the Earth as a downward force on celestial bodies, counteracted by the motion of surrounding air.\nA notable feature of his work is a merging of pagan natural philosophy, Christian natural philosophy and biblical exegesis. Pambakian\n[\n1\n]\nnotes that\nCosmology\nis not a scriptural commentary, nor is it based on the accounts of Genesis, and compares the structure of Ananias's\nCosmology\nto\nAristotle\n's\nDe Mundo\n[\n1\n]\n. Alongside his description of physical accounts, explanations for these phenomena include metaphysical answers as well as those sought from Christian and Jewish tradition.\nScholars place the year of Ananias's death between\n670\nand the early\n690\ns, and tradition claims he was buried in the village of Anavank'. However, Mathews argues this tradition could have originated from the name if the village itself.\n(\nSee\n[\n7\n]\n)\nThe corpus of works currently attributed to Ananias includes\n[\n3\n]\n:\nAstronomical Works:\n1\n.    Cosmography and the Calendar\n2\n.    Cycle\n532\nand the Calendar\n(\nTiezeragrut'iwn ew Tomar\n)\n3\n.    Table of the Motions of the Moon\n(\nLusni Parberasrzannere\n)\n4\n-\n5\n.   On the Course of the Sun\n6\n.    Introduction to Astronomy\nMathematical Works:\n7\nA.  Problems and Solutions\n7\nB.  Book of Arithmetic\n(\nT'uabant'iwn\n)\n8\n.    Arithmetic\n(\nXaraxcanakank\n)\n9\n.    On Weights and Measures\n(\nGirk Vasn  Karoc'ew apuc'\n)\n10\n.  The Geography\n(\nAaxarhac'oyc'\n)\n11\n.  The Itinerary\n(\nMłonač'ap'k\n)\n12\n.  Studies on Chronology\n(\nT'omar\n)\n13\n.  Chronicle\n(\nK'nnikon\n)\nOther Works:\n14\n.    Discourse on Christmas\n15\nA.   Discourse on Easter\n(\nPan Vasn Tawni ew Ayln\n)\n15\nB.   Autobiography\n(\nVasun Gnac' Ewroc'\n)\n16\n.    Homilies on Contrition and Humility\n(\nC'ark Vasn Xonarhut'yan\n)\n17\n.    On Precious Stones",
  "math_areas": []
}