{
  "nome_completo": "José Anastácio da Cunha",
  "nome_curto": "Anastácio da Cunha",
  "ano_nascimento": "1744",
  "ano_morte": "1787",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cunha/",
  "lugar_nascimento": "Lisbon, Portugal",
  "lugar_morte": "Lisbon, Portugal",
  "biografia": "Anastácio da Cunha\n's father was Lorenzo da Cunha, who was a painter, and his mother was Jacinta Ignes. Da Cunha was educated in the town of his birth, studying at the Congregation of the Oratory in Lisbon. However, he did not learn much of mathematics and physics during his formal education and it was these topics which he studied on his own. It is certainly fair to say that in these areas he was self-educated, a fact which may have led to his later work being particularly innovative. During the period of his education Lisbon was hit by an earthquake on\n1\nNovember\n1755\nand two-thirds of the city was reduced to rubble. However rebuilding the old town soon created one of the most beautiful of European cities.\nWhen da Cunha was nineteen years old, in\n1763\n, he volunteered for military service and he became a lieutenant of artillery giving ten years' of service. He spent most of his years in the army at Valença do Minho. Subsequent events were greatly influenced by the politics of Portugal during the period. In\n1750\nJoseph I had been crowned king of Portugal. Joseph appointed Sebastiao de Carvalho marques de Pombal as a minister and soon de Pombal came to have such an influence over the running of Portuguese affairs that his powers became almost absolute. De Pombal put through a series of major reforms, and around\n1758\n-\n59\nhe moved against the Jesuits and the Society of Jesus. Da Cunha supported these religious reforms by de Pombal and also the later reforms he put in place such as the reform of university education, the beginning of commercial education, the creation of trading companies, and the reorganisation of the army. Da Cunha\n[\n1\n]\n:-\n... became known as a progressive thinker, talented poet, and author of an original memoir on ballistics.\nAs part of his university reforms de Pombal appointed da Cunha professor of geometry in\n1773\n. His period in the Faculty of Mathematics at Coimbra University was, however, short. King Joseph I died on\n24\nFebruary\n1777\nand suddenly de Pombal lost all his powers. Queen Maria I assumed the throne and she set political prisoners free. De Pombal was accused of having abused his powers, was found guilty by a judicial tribunal, and then banished from Lisbon. Da Cunha was arrested and imprisoned by the Inquisition. In October\n1778\nhe was sentenced by the General Council of the Inquisition in Lisbon to three years in prison for being a follower of Voltaire and supporting heretical views. He was freed in\n1781\nbut prison had ruined his health. Although he was appointed as Professor of Mathematics in the College of São Lucas and took up his mathematical research again, he died a few years later.\nDa Cunha wrote a\n21\npart encyclopaedia of mathematics\nPrincipios Mathemáticos\nⓉ\n(\nMathematical principles\n)\nwhich he began to publish in parts from\n1782\n(\nit was published as a complete work in\n1790)\nwhich contained a rigorous exposition of mathematics, in particular a rigorous exposition of the calculus. The book contained the elements of geometry and algebra in addition to the calculus. In all areas da Cunha paid unusual attention to methodology as well as rigour.\nStruik\n, reviewing\n[\n12\n]\nwrites:-\nHis importance for the history of mathematics is due to his \"Principios Mathemáticos\"\nⓉ\n(\nMathematical principles\n)\n, published posthumously in\n1790\nand translated into French by J M d'Abreu\n[\nRacle, Bordeaux,\n1811]\n. This book is characterised by the attempts at rigor, especially in the calculus. Da Cunha develops a criterion for the convergence of a series which he uses to define the exponential function in a rather modern way, and from these develops the binomial series. His definition of the differential of a function\ny\n=\nf\n(\nx\n)\ny = f (x)\ny\n=\nf\n(\nx\n)\nanticipates that of\nCauchy\n, and, written in our present notation, amounts to this:\nif\nD\ny\n=\nf\n(\nx\n+\nD\nx\n)\n−\nf\n(\nx\n)\nDy = f (x + Dx) - f (x)\nD\ny\n=\nf\n(\nx\n+\nD\nx\n)\n−\nf\n(\nx\n)\ncan be represented in the form\n∣\nD\ny\n∣\n=\nA\nD\nx\n+\ne\nD\nx\n| Dy | = A Dx + e Dx\n∣\nD\ny\n∣\n=\nA\nD\nx\n+\ne\nD\nx\n, where\nA\nA\nA\nis independent of\nD\nx\nDx\nD\nx\nand\ne\n→\n0\ne \\to 0\ne\n→\n0\nwhen\nD\nx\n→\n0\nDx \\to 0\nD\nx\n→\n0\n, then\nA\nD\nx\nA Dx\nA\nD\nx\nis called the differential of\ny\n=\nf\n(\nx\n)\ny = f (x)\ny\n=\nf\n(\nx\n)\n.\nIn\nPrincipios Matemáticos\nda Cunha also gave a definition of the convergence of a series which is equivalent to\nCauchy\n's convergence criterion. However, this was not realised until comparatively recently since most historians of mathematics studied the French translation of\n1811\nwhich is inaccurate at the crucial place where this definition is given.\nThere is a second publication of a mathematical work by da Cunha discussed by\nBogolyubov\nin\n[\n3\n]\nwhere he studies:-\n... the Portuguese mathematician J A da Cunha's work\n[\n\"Essay on the principles of mechanics\"\n(\nSpanish\n)\n, London,\n1807\n; Amsterdam\n1808]\n, which contains interesting approaches to the foundations of mechanics, similar in many respects to contemporary ones.\nMany historians discuss the influence of da Cunha's remarkable, yet little known, work.\nYushkevich\n, in\n[\n12\n]\n, claims that da Cunha should rank with\nBolzano\n,\nCauchy\n,\nAbel\nand others for his contributions to the principles of the calculus. In\n[\n10\n]\nYushkevich\nnotes that da Cunha was not quite as unknown as had previously been thought since an anonymous, but unfavourable, review of\nPrincipios Matemáticos\nⓉ\n(\nMathematical principles\n)\nappeared in\n1811\nin the\nGottingische gelehrte Anzeigen\nⓉ\n(\nGottingen scholarly announcements\n)\n. In the same year,\nGauss\nwrote a letter to\nBessel\nin which he commented positively on da Cunha's definitions of the exponential and logarithmic functions. Despite this da Cunha's work was not widely known and, sadly, had little influence on the development of mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}