{
  "nome_completo": "Anatolii Asirovich Goldberg",
  "nome_curto": "Anatolii Asirovich Goldberg",
  "ano_nascimento": "1930",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Goldberg/",
  "lugar_nascimento": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "lugar_morte": "Netanya, Israel",
  "biografia": "Anatolii Asirovich Goldberg\n's father, Asher Goldberg, was a medical doctor while his mother was a secondary school teacher. As the name Goldberg suggests, the family was Jewish. Anatolii Asirovich spent the first three years of his life in Kiev before the family moved to Zaporizhzhy, a city in south eastern region of Ukraine on the Dnieper River. The town had grown up in the years just before the Goldberg family moved there due to the construction of the Dnieper hydroelectric station in\n1927\n-\n32\n. Anatolii Asirovich was nine years old when World War II began but initially this did not affect the young boy.\nThe Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the war had little effect on life in Zaporizhzhy and Anatolii Asirovich was able to continue his schooling. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. The German armies advanced across Ukraine and, although Zaporizhzhy was in eastern Ukraine, the German forces were approaching the city towards the end of\n1941\n. Goldberg's mother fled with her son to the east of the Soviet Union where they remained safe for the duration of the war. When the war ended, the Goldberg family settled in Lviv. This city had been part of Poland before World War II began\n(\nknown as Lwów\n)\nbut, after being occupied by German troops during the war, was annexed by the Soviets in\n1945\n. Goldberg completed his secondary school studies in Lviv. There he showed remarkable mathematical talents, winning first place in the Mathematical Olympiad competition of\n1947\n. Aleksandr Sergeevich Kovanko\n(1893\n-\n1975)\nwas chairman of the local Olympiad committee and he encouraged Goldberg to aim for a career as a university mathematics teacher.\nThe University of Lviv reopened as a Ukrainian university in\n1945\nand several leading mathematicians were appointed there. Aleksandr Sergeevich Kovanko, who we just mentioned, had been a student of\nDimitri Fedorovich Egorov\nand had participated in\nNikolai Nikolaevich Luzin\n's famous school at the University of Moscow in the\n1920\ns. His main interests were almost periodic functions, the problem of surface area, and sequences of functions. Ivan Georgievich Sokolov\n(1903\n-\n1993)\nheld the Chair of the Theory of Functions and Probability Theory at Lviv. Several other mathematicians at the university were equally important for Goldberg's development, including\nBoris Vladimirovich Gnedenko\n,\nYaroslav Borisovich Lopatynsky\n, who held the chair of differential equations, and Lev Israelevich Volkovyskii who had been a student of\nMikhail Alekseevich Lavrent'ev\nand was working on complex analysis, particularly quasiconformal mappings and\nRiemann\nsurfaces.\nIn both\n[\n2\n]\nand\n[\n3\n]\n, Goldberg's own description of his time as a student at Lviv is recorded. We give a version below:-\nAt university, it was Professors Lev Israelevich Volkovyskii and Ivan Georgievich Sokolov who had the greatest influence on me. This applies to both their mathematical influence and their civic position. It must be said that in those years a serious price could be paid for such a bold civic stand. I was a troublesome student and I was twice expelled from the Young Communist League and from the university but later reinstated. The offences were of a political nature: \"bourgeois liberalism\", \"loss of Young Communist vigilance\", and so on. During my first and second years in the University, I took part in a seminar on the book by\nPolya\nand\nSzego\n, conducted by Lev Israelevich Volkovyskii and Ivan Georgievich Sokolov. During my second year the seminar divided. I went to Sokolov and began to interest myself in the constructive theory of functions. I greatly enjoyed this activity; at that time I P Natanson's book had come out and it was clearly and simply written. From my fellow students who went to study under Volkovyskii, I learnt that their fundamental text was\nRolf Nevanlinna\n's monograph \"Single-valued analytic functions\", of which the only copy in Lviv was Volkovyskii's. To study this book, one had to go to his apartment at prescribed times.\nNevanlinna\n's book was difficult even for senior students and even worse for second year students, who had still not studied the theory of functions of a complex variable. Hearing their complaints, I thanked my lucky stars that I had distanced myself from that accursed book. But here chance intervened. Looking through the catalogue of the Lviv Regional Library I saw a card for\nNevanlinna\n's book in the section \"Analytic geometry\". I could not put the treasure down, ordered the book on my ticket, deserted and defected to the Volkovyskii camp.\nGoldberg wrote his Master's thesis advised by Volkovyskii. In it he studied the inverse problem of the theory of the distribution of values which had been proposed by\nNevanlinna\nin the\n1920\ns. He was awarded the degree in\n1952\nfor the thesis\nOn a problem in the theory of distribution of values of\nmeromorphic\nfunctions\n. He published the results of his investigations in five papers in\n1954\n, one in Ukrainian and one in Russian with the same title as his thesis, and the other papers in Russian:\n(\nwith P P Belinskii\n)\nApplication of a theorem on conformal mappings to questions of invariance of defects of meromorphic functions\n;\nOn the influence of clustering of algebraic branch points of a Riemann surface on the order of growth of a meromorphic mapping function\n; and\nOn defects of meromorphic functions\n. We note that the results that Goldberg obtained for the inverse problem of the theory of the distribution of values which he published in\n1954\nwere not improved on during the next twenty years.\nAnti-Semitism in Ukraine at this time meant that, although Goldberg would have wished to work towards his Candidate's degree\n(\nequivalent to a Ph.D.\n)\nby studying at a university, this was almost impossible. He therefore took a position as a secondary school teacher of mathematics in the village of Zabolotsy. When Stalin died in\n1953\nGoldberg thought that the position of Jews might improve so he applied to study for his candidate's Degree at Lviv University. However, his application was rejected. There was, however, another possible, but extremely difficult, route to a Candidate's Degree left open to Goldberg. Even though he could not register as a student, nevertheless he was allowed to sit the qualifying examinations and submit a thesis. Goldberg undertook the necessary work for his Candidate's Degree while working as a school teacher, teaching for\n30\nhours a week and undertaking further administrative tasks. He submitted his thesis to Lviv University in\n1955\nand this not only led to the award of the degree but, as we shall explain, it led to Goldberg collaborating with the mathematicians at Kharkov University.\nBoris Yakovlevich Levin\nexamined Goldberg's Candidate's Thesis\nSome Problems of Distribution of Values of Meromorphic Functions\nin\n1955\nat Lviv University. This led to Goldberg collaborating with\nLevin\n's colleagues at Kharkov University, in particular with\nIossif Vladimirovich Ostrovskii\n. The collaboration between Goldberg and\nOstrovskii\nled to important results. Their first joint papers were\nSome theorems on the growth of meromorphic functions\n(\nRussian\n)\n(1961)\nand\nNew investigations on the growth and distribution of values of entire and meromorphic functions of genus zero\n(\nRussian\n)\n(1961)\n. Another joint paper\nApplication of a theorem of W Hayman to a question in the theory of expansions of probabilistic laws\n(\nRussian\n)\n(1967)\nwas followed by the classic joint monograph\nThe distribution of values of meromorphic functions\n(\nRussian\n)\n(1970)\n. Here is a short extract of a review of this book by\nWalter Hayman\n:-\nNevanlinna\ntheory has made considerable progress in the\n50\ns and\n60\ns, progress to which the authors of the present book have made distinguished contributions. Their book is detailed and authoritative, and there is little of importance in the subject of value distribution of functions meromorphic in the plane that is missing from this book and that cannot be found in the earlier books on the subject. The subject matter is illustrated at every stage by subtle and detailed examples -some of which are here published for the first time and some of which are not easily accessible elsewhere. ... All function theorists are indebted to the authors for this comprehensive and scholarly work.\nGoldberg and\nOstrovskii\nexplain their aims in writing the monograph in a Preface:-\nIn this book ... the main attention is concentrated on the problems internal to the value distribution theory, which include the following problems:\n(\ni\n)\nTo what extent the main inferences of\nNevanlinna\n's theory have final character and cannot be improved further;\n(\nii\n)\nWhat properties of\nPicard\n's exceptional values are preserved for a wider class of exceptional values considered in the value distribution theory;\n(\niii\n)\nWhich are the connections between\nNevanlinna\n's characteristics and other quantities characterizing asymptotic properties of entire and meromorphic functions;\n(\niv\n)\nStudy of asymptotic properties and value distribution of meromorphic functions belonging to some special classes which are on one hand sufficiently narrow to give new information not implied by general theorems, and on the other hand sufficiently wide for being of interest for the general theory;\n(\nv\n)\nStudy of the value distribution with respect to arguments\n(\nnot only with respect to moduli as in classical\nNevanlinna\ntheory\n)\n. We pay great attention to examples of functions with \"exotic\" properties. Without them the reader will get a restricted image of the theory under consideration. Examples of functions having unusual properties play in the theory a role as important as counterexamples do in Real Analysis.\nWe should return to\n1955\n, the year in which Goldberg was awarded his Candidate's Degree from Lviv University. Following the award of this degree, Goldberg was appointed to Uzhgorod University as a\ndocent\nwhere he worked for eight years before returning to Lviv University in\n1963\n. Two years later, in\n1965\n, he submitted his doctoral thesis\n(\nequivalent to the\nhabilitation\nor to a D.Sc.\n)\nentitled\nThe distribution of values and asymptotic properties of entire and meromorphic functions\n(\nRussian\n)\n. The authors of\n[\n2\n]\nwrite:-\nLet us give a catalogue of the investigative strands to be found in Goldberg's thesis:\n(1)\nto what extent are the fundamental conclusions of\nNevanlinna\n's theory best possible and not capable of refinement;\n(2)\nwhich properties of\nPicard\n's exceptional values are retained by defect values;\n(3)\nwhat sort of link is there between the characteristics of\nNevanlinna\n's theory and other magnitudes that describe asymptotic properties of the function;\n(4)\nwhat sort of link is there between defect values and the distribution of a-points with respect to arguments;\n(5)\nasymptotic properties and distributions of the values of various specific classes of entire and meromorphic functions.\nAfter submitting this thesis, he was promoted to full professor at Lviv and he held this position until\n1997\n. The year he was made a full professor, he\n[\n3\n]\n:-\n... began his seminar at the Mathematics Department of Lviv University, on Tuesdays for two hours. Almost all results of Lviv mathematicians related to the theory of entire and meromorphic functions were thoroughly considered and discussed at the seminar.\nGoldberg kept up a remarkable publication record with over\n150\nitems listed in\n[\n3\n]\nwith around twenty further items published after the article\n[\n3\n]\nappeared. As examples of these papers, we mention\nEstimates of conformal maps of curvilinear strips\n(2002)\n. Dov Aharonov writes in a review:-\nThe author is interested in the question of conformality of a map at a boundary point. Following previous work of himself and others, the author uses a strip-like canonical domain. ... In this paper the author does not prove conditions for the existence of the angular derivative but rather obtains rough estimates for a wider class of strips.\nGoldberg was asked to give the opening memorial plenary lecture on memorial meeting in honour of Shlomo Strelitz at the 'Conference of Differential Equations and Complex Analysis' at the University of Haifa in December\n2000\n. He gave the lecture\nOn the growth of entire solutions of algebraic differential equations\nwhich was published in\n2005\n. Also in\n2005\nhis paper\nOn a connection between the number of poles of a meromorphic function and the number of zeros of its derivatives\nwas published.\nGoldberg married twice. The authors of\n[\n3\n]\nstate:-\nIn\n1964\nGoldberg married Basya B Lekhtman. They have three sons, Alexander, Mikhael and Victor. Goldberg brings up a son, Mark, from a previous marriage.\nIn\n1997\nGoldberg retired from his professorship at Lviv and took up a position at Bar Ilan University in Israel. This university is situated in Ramat Gan, east of Tel Aviv-Yafo. He lived in Netanya on the Mediterranean coast,\n30\nkm north of Tel Aviv-Yafo.\nHe received several honours for his outstanding contributions. In\n1992\nGoldberg,\nOstrovskii\nand\nLevin\n, were joint recipients of the State Prize of Ukraine. He was also honoured by having mathematical terms named after him. However, there appears to be some confusion in the literature regarding which things named for Goldberg are actually named for Anatolii Asirovich Goldberg. The problem arises since there are a number of mathematicians named Goldberg. However, the 'Goldberg constant' is name after the subject of this biography and appears in his paper\nA certain theorem of Landau type\n(1973)\n. He was also honoured following his death with a 'Conference on complex analysis dedicated to the memory of Anatolii Asirovich Goldberg' being held in Lviv, Ukraine, from\n31\nMay to\n5\nJune\n2010\n. It was organised by the Ivan Franko National University of Lviv and the Lviv Mathematical Society.\nIn\n[\n3\n]\nthe authors describe Goldberg's love of writing:-\nWith many of his colleagues Goldberg keeps intensive correspondence. Besides mathematics, his letters contain concise reports on current economical and political developments, local news, short reminiscences, interesting historical remarks, everything flavoured with a wonderful humour. Goldberg's talent as a remarkable storyteller goes hand in hand with the literary quality of his letters.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Statistics"
  ]
}