{
  "nome_completo": "Anatoly Mykhailovych Samoilenko",
  "nome_curto": "Anatoly Mykhailovych Samoilenko",
  "ano_nascimento": "1938",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Samoilenko/",
  "lugar_nascimento": "Potiivka, Radomyshl, Zhytomyr oblast, Ukraine",
  "lugar_morte": "Kyiv, Ukraine",
  "biografia": "Anatoly Mykhailovych Samoilenko\nwas born in western Ukraine. He entered Shevchenko Kiev State University in\n1955\nintending to read for a degree in geology. However, his interests turned to mathematics and he graduated from the Department of Mechanics and Mathematics in\n1960\n. His first paper, entitled\nApplication of the averaging method to the investigation of oscillations, induced by instantaneous impulses in self-oscillating systems of the second order with a small parameter\n(\nRussian\n)\n, was published in the following year. He then studied graduate level courses at the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev where he was taught by, among others,\nNikolai Mitrofanovich Krylov\n,\nNikolai Nikolaevich Bogolyubov\nand\nYurii Alekseevich Mitropolskii\n. In\n1963\nhe defended his candidate-degree thesis\nApplication of Asymptotic Methods to the Investigation of Nonlinear\nDifferential Equation\nwith Irregular Right-Hand Side\n. He then continued to work at the Institute, supervised by\nYurii Mitropolskii\n, towards his qualification to become a university teacher. In\n1967\nhe defended his doctoral thesis\n[\nequivalent to the German\nhabilitation\n]\nSome Problems of the Theory of Periodic and Quasiperiodic Systems\nwhich was examined by\nVladimir Igorevich Arnold\nand\nDmitrii Viktorovich Anosov\n.\nSamoilenko had been appointed as a senior research fellow at the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev in\n1965\n, and he also taught at the Shevchenko Kiev State University from\n1967\n. In\n2000\n, he reminisced about his years as a young scientist at the Institute\n(\nsee\n[\n2\n]\n)\n:-\nIn Kiev, at the Institute of Mathematics, great scientists were my teachers ... In many fields of science, they were 'trendsetters' on the scale of the Soviet Union. It is very important for a young scientist to belong to a serious scientific school. Probably, only in this case he has a chance to obtain results at the world level. The atmosphere of a good scientific school itself stimulates a young scientist to carry out his research work at the cutting edge of modern science. And if he suddenly opens a new direction in science, then his name immediately gains recognition\nIn\n1974\nSamoilenko became a professor and headed the Integral and Differential Equations section within the Department of Mechanics and Mathematics at the Kiev State University. Four years later, in\n1978\n, he was elected a Corresponding Member of the\nUkrainian Academy of Sciences\n. In\n1987\nSamoilenko was appointed head of the Department of Ordinary Differential Equations at the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev. In the following year he became head of the Institute.\nSamoilenko worked on both linear and nonlinear ordinary differential equations. In the\n1960\ns he studied nonlinear ordinary differential equations with impulsive action publishing papers such as\nSystems with pulses at given times\n(1967)\n. His work on boundary-value problems led to papers\nNumerical-analytic method for the investigation of systems of ordinary differential equations\n(2\nparts both published in\n1966)\nand many other innovative works. His first major monograph was\nMethod of Accelerated Convergence in Nonlinear Mechanics\n(\nRussian\n)\n(1969)\nwhich he wrote in collaboration with his teachers\nNikolai Nikolaevich Bogolyubov\nand\nYurii Alekseevich Mitropolskii\n.\nPetryshyn\nwrites in\n[\n3\n]\n:-\nHis most original contribution was the numeric-analytic method for the study of periodic solutions of differential equations with periodic right hand side. A monograph on the method of accelerated convergence, written jointly by Samoilenko,\nN Bogolyubov\n, and\nYu Mitropolskii\nin\n1969\n, gives an exhaustive analysis of the speed of convergence, error estimates, stability, and applications.\nEugene Leimanis writes:-\nThis monograph contains an account of a basic method in nonlinear mechanics and of some important results obtained by this method. The latter is known as the method of successive changes of variables and its aim is to ensure the convergence of the iteration process in solving systems of nonlinear differential equations.\nAn English translation of this monograph was published in\n1976\n.\nWith contributions from Mikola Oleksiiovich Perestyuk, Samoilenko put the application of asymptotic methods to solve discontinuous and impulsive systems on a rigorous foundation. Their work continued over a long period and was written up in the important joint monograph\nImpulsive Differential Equations\n(\nRussian\n)\nin\n1987\n. An English translation was published in\n1995\n.\nSamoilenko was to undertake several joint projects with\nMitropolskii\nwho had become the Director of the Institute of Mathematics in Kiev where he worked. In addition to the work mentioned above they worked jointly on the theory of multifrequency oscillation, then later on a system of evolutionary equations with periodic and conditional periodic coefficients. This last work was done in collaboration with D Martyniuk and the three of them published, in\n1984\n, the monograph\nSystems of Evolution Equations with Periodic and Quasiperiodic Coefficients\n(\nRussian\n)\ngiving an excellent account of their results. In\n1987\nSamoilenko published the book\nElements of the Mathematical Theory of Multifrequency Oscillations. Invariant Tori\n(\nRussian\n)\n. This was translated into English and published in\n1991\n. The authors of\n[\n2\n]\nhighlight this\n1987\npublication:-\nThe beginning of this fruitful creative period was marked by\n[\nthis\n]\nfundamental monograph devoted to the qualitative theory of invariant manifolds of\ndynamical systems\n. This monograph served as a foundation for the construction of the general perturbation theory of invariant tori of nonlinear dynamical systems on a torus.\nFurther fundamental monographs continued to be written by Samoilenko and his collaborators. For example, with\nMitropolskii\nand V L Kulik, he wrote\nInvestigation of Dichotomy of Linear Systems of Differential Equations Using Lyapunov Functions\n(\nRussian\n)\npublished in\n1990\n.\nSamoilenko has written a series of monographs with N I Ronto. They wrote\nNumerical-analytic methods for the study of periodic solutions\n(\nRussian\n)\nin\n1976\nand followed this with a new work on similar topics entitled\nNumerical-analytic methods for investigating the solutions of boundary value problems\n(\nRussian\n)\nin\n1986\n. In\n1992\nthey published\nNumerical-analytic methods in the theory of boundary value problems for ordinary differential equations\n. The Preface begins:-\nIn this monograph we present new promising directions in the development of numerical-analytic methods for studying the solutions of nonlinear boundary value problems in the case of a general form of boundary conditions, problems with controlling parameters, and also boundary value problems for impulse systems. In the tradition of earlier papers, we study, from the same viewpoint, both periodic and non-periodic boundary value problems.\nWith\nPetryshyn\n, Samoilenko has written books such as\nMultifrequency oscillations of nonlinear systems\n(\nUkrainian\n)\n(1998)\nwhich appeared in an English translation in\n2004\n. In the same year another English book appeared, this being a joint work with A A Boichuk entitled\nGeneralized inverse operators and Fredholm boundary-value problems\n:-\nThe book is devoted to the theory of generalized inverses of operators in a Banach space and its applications to linear and weakly nonlinear boundary-value problems for various classes of functional-differential equations, including systems of ordinary differential and difference equations, systems of differential equations with delay, systems with impulse action, and integro-differential systems.\nA recent book by Samoilenko, written with Yu V Teplinskii, is\nElements of the mathematical theory of evolution equations in Banach spaces\n(\nUkranian\n)\n(2008)\n. This book is based on lecture notes of courses given by the authors to graduate and postgraduate students at the University of Kiev.\nAlthough we have taken a brief look at Samoilenko's mathematics by looking at a few of the monographs he has written, we must not give the impression that these monographs are his only publications. Nothing could be further from the truth, for MathSciNet lists over\n400\npublications by Samoilenko. Although some of his publications are single-author, nevertheless, he has nearly\n200\nco-authors.\nAs well as having a reputation as an outstanding researcher, Samoilenko is renowned as a fine teacher. The book\nDifferential equations : Examples and problems\n(\nRussian\n)\n(1984)\nwritten with S A Krivosheya and N A Perestyuk contains the following authors' summary:-\nWe give the solutions of typical problems in a course on ordinary differential equations. The text is structured so as to develop practical skills in students for solving and investigating differential equations describing evolutionary processes in different fields of natural science. Special attention is given to questions that are inadequately discussed\n(\nor entirely absent\n)\nin existing textbooks, and with which students, as experience shows, are not very familiar. The text is intended for students in mathematical physics departments of universities, technical schools and pedagogical institutes.\nAnother aspect of Samoilenko's contributions is his editorial work for many different journals. He is on the Editorial Board of:\nNonlinear Oscillations\n; the\nUkrainian Mathematical Journal\n;\nReports of the Ukrainian Academy of Sciences\n; the\nBulletin of the Ukrainian Academy of Sciences\n; the\nUkrainian Mathematical Bulletin\n;\nIn the World of Mathematics\n; the\nMemoirs on Differential Equations and Mathematical Physics\n; the\nMiskolc Mathematical Notes\n; the\nGeorgian Mathematical Journal\n; and the\nInternational Journal of Dynamical Systems and Differential Equations\n.\nSamoilenko has received widespread recognition for his outstanding achievements. The honours he has received include: the\nOstrovskii\nRepublican Prize\n(1968)\n, the Krylov Prize\n(1981)\n, the State Prize of Ukraine for science and technology\n(1985)\n, a second award of the State Prize\n(1996)\n, the\nBogolyubov\nPrize\n(1998)\n, the\nLavrent'ev\nPrize\n(2000)\n, the Ostrogradskii Silver Medal\n(2001)\n, and the\nOstrogradski\nPrize of the\nUkrainian Academy of Sciences\n(2004)\n. He was given the honorary title of \"Soros Professor\" in\n1996\nand, two years later, the title of the Honoured Worker of Science and Technology of the Ukraine. He has been elected to the European Academy of Sciences\n(2002)\nand the Shevchenko Scientific Society. In\n2006\nhe was elected a Corresponding Member of Accademia Peloritana dei Pericolanti in Messina, Sicily.\nAnatoly Mykhailovych Samoilenko was married to Lypa Hryhorivna; they had a son Anatolii who is a geneticist with a doctorate from Göttingen University. Lypa Hryhorivna is also scientist who worked for many years at the Institute of Cybernetics of the Ukrainian Academy of Sciences.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Topology"
  ]
}