{
  "nome_completo": "Anderson Gray McKendrick",
  "nome_curto": "Anderson McKendrick",
  "ano_nascimento": "1876",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McKendrick/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Speyside, Scotland",
  "biografia": "Anderson McKendrick\n's parents were Mary Souttar and John Gray McKendrick. John McKendrick was a physiologist who, at the time Anderson was born, was Professor of Physiology at Glasgow University. His most famous works are\nLife of Helmholtz\n(1899)\n, and\nText Book\n0\nf Physiology\n,\n2\nVolumes\n(1888\n,\n1889)\n. Anderson had a brother, two years his elder, who became a physician in Glasgow. Both brothers and their father were fellows of the\nRoyal Society of Edinburgh\n.\nMcKendrick trained to become a medical doctor at the University of Glasgow and graduated MB ChB in\n1900\n. He studied embryology, physiology, and anatomy in Jena. As a military man, he served in Somaliland in\n1903\n-\n04\nwhen British forces tried to put down the armed resistance against colonial forces led by Mohammed Abdullah Hassan who was fighting for a united Muslim Somalia. He worked at the Research Department of the Government of India from\n1905\nto\n1920\nand from\n1914\nto\n1920\nwas Director Pasteur Institute, Kasauli. During this period he rose to the rank of Lieutenant Colonel. Although based in India at this time, he returned to Scotland on leave for various periods and during these he studied physical chemistry in Glasgow under Soddy in\n1907\n, and mathematics in\n1913\nunder Professor MacDonald at Aberdeen.\nIn\n1920\nMcKendrick came to Edinburgh as Superintendent of the Research Laboratory of the Royal College of Physicians. In February\n1926\nhe joined the\nEdinburgh Mathematical Society\n. This might seem strange for a medical researcher but his mathematical contributions were, in fact, substantial. F C Hoppensteadt wrote\nSome influences of population biology on mathematics\nand in this work mentioned the contributions made by McKendrick:-\nA G M'Kendrick\n(1876\n-\n1943)\nrose to the rank of Lieutenant Colonel in the Indian Medical Service and then became Superintendent of the Research Laboratory of the Royal College of Physicians, Edinburgh. In this latter post, he worked closely with the chemist\nW O Kermack\nand the mathematicians\nE T Whittaker\nand\nE T Copson\n. A death notice which appeared in the Edinburgh Medical Journal gives a description of his life and work.\nHe established that interactions between various types of organisms can be modelled like transport mechanisms in physics, such as fluid flows are.\nW Feller\nwrote:-\nMuch more general and flexible models than the type introduced by Yule\n(1924)\nwere devised and applied to epidemics and population growth in an unpretentious and highly interesting paper by Lieutenant Colonel A G M'Kendrick\n[6]\n(1926)\n. It is unfortunate that this remarkable paper passed practically unnoticed. In particular, it was unknown to the present author when he introduced various stochastic models for population growth in\n1939\n.\nAnderson McKendrick was elected to the\nRoyal Society of Edinburgh\non\n18\nMarch\n1912\n, his proposers being James Oliver, Diarmid Noel Paton, Ralph Stockman,\nCargill Gilston Knott\n.\nAn obituary, written by W F Harvey, appears in the\nRoyal Society of Edinburgh\nYear Book\n1944\n, pages\n23\n-\n24\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nAfter his death the following obituary appeared in\nThe Scotsman:-\nDeath of Lieut.-Colonel A G McKendrick\nThe death occurred at Carr Moor, Carrbridge, Inverness-shire, yesterday, of Lieut.-Colonel Anderson Gray McKendrick, M.B., Ch.B., Indian Medical Service. Educated at Kelvinside Academy, Glasgow, Colonel McKendrick will be best remembered as Director of the Pasteur Institute of India\n(\nKasauli\n)\n, a post he held from\n1914\nuntil\n1920\n; as superintendent of the Research Laboratories of the Royal College of Physicians of Edinburgh from\n1920\nto\n1941\n; and for his mathematical work as medical statistician. Colonel McKendrick was a D.Sc. of Aberdeen University; an F.R.S.Ed., of which Society he was a Council member and vice-president for many years; and an F.R.C.P.Ed. by which College he was awarded the Cullen prize in\n1934\n. Colonel McKendrick was the youngest son of the late Professor John Gray McKendrick, F.R.S., LL.D., Professor of Physiology at Glasgow University. He is survived by his wife, two sons and two daughters.",
  "math_areas": []
}