{
  "nome_completo": "Anders Celsius",
  "nome_curto": "Anders Celsius",
  "ano_nascimento": "1701",
  "ano_morte": "1744",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Celsius/",
  "lugar_nascimento": "Uppsala, Sweden",
  "lugar_morte": "Uppsala, Sweden",
  "biografia": "Anders Celsius\n's grandfather was Anders Spole\n(1630\n-\n1699)\nan astronomer born in Barnarp, Sweden, who had studied in Uppsala. In his youth, Spole travelled through Europe, meeting many important astronomers, and later became Professor of Astronomy at the University of Lund. There, he constructed an observatory in his house and made frequent visits to\nTycho Brahe\nin Hven. Because of this, Spole was well informed of the scientific state of Europe. He sided with\nGiovanni Domenico Cassini\non his and\nIsaac Newton\n's argument about the shape of the Earth. Spole left Lund after the Danish invasion of southern Sweden in\n1676\n, which caused the University of Lund to dissolve. He chose to participate in the war and, possibly as a reward, in\n1679\nhe was offered the position of professor of astronomy at the University of Uppsala.\nOne of Spole's students in Uppsala was Nils Celsius\n(1658\n-\n1724)\n, the son of Magnus Celsius\n(1621\n-\n1679)\nwho was professor of mathematics at Uppsala between\n1668\nand\n1679\n. Under Spole, Nils wrote the dissertation\nDe Principiis Astronomicis Propiis\nⓉ\n(\nThe important astronomical properties\n)\n(1679)\n, in which he stated that only empirical observations, and not theological doctrine, were the pillars of astronomy. Since Uppsala was the ecclesiastical centre of Sweden and it had not yet accepted heliocentrism, this went against the consensus at the University and caused the dissertation to be banned. This refusal of the latest astronomical ideas explains, in part, the lack of proper astronomical instruments in the University of Uppsala at the beginning of the\n18\nth century. Spole tried to remedy this by building an astronomical observatory in his own house, but it burned down in a great fire in\n1702\n. Nils married one of Spole's daughters, Gunilla Maria Spole\n(1672\n-\n1756)\n. After Spole's death in\n1699\n, the university disregarded his suggestion of having Nils Celsius succeed him and, instead, they appointed Per Elvius\n(1660\n-\n1718)\n(\nwho was married to another of Spole's daughters\n)\nas professor of astronomy. Only when Elvius died in\n1718\ndid Nils Celsius become professor of astronomy. He was also the headmaster of the Trivial school of Uppsala. The Trivial schools were given that name because they taught the first three subjects, the trivium, of the liberal arts, namely grammar, rhetoric and logic.\nAnders Celsius grew up with access to a big family library, which managed to survive the fire of\n1702\n. This gave him early access to a copy of the\n1687\nedition of\nIsaac Newton\n's\nPrincipia\n. His academic teaching in mathematics and astronomy was poor in the beginning, but by the age of twelve he managed to solve all of the mathematical problems in a university textbook. He began his secondary schooling in Uppsala on\n12\nJune\n1711\n. After graduating from secondary school, Celsius studied astronomy, mathematics, and experimental physics at the University of Uppsala and gained a deep appreciation for mathematics mainly thanks to Anders Gabriel Duhre\n(\nabout\n1680\n-\n1739)\n, who visited Uppsala in\n1724\n-\n25\nand gave a lecture course. The mathematics professor at Uppsala at this time was Elof Steuch\n(1687\n-\n1772)\nwho seems to have had little mathematical ability or interest in the subject having been professor of Greek at the University of Lund before being appointed to the chair of mathematics in Uppsala. Celsius had been so unhappy with the mathematics teaching that he thought he would specialise in law but this all changed after he attended Duhre's course.\nCelsius had, from the early\n1720\ns, carried out observations for Erik Burman\n(1692\n-\n1729)\n, Nils Celsius's successor as professor of astronomy in Uppsala, and, having been taught about meteorology and experimental physics by Burman, Celsius published his first two papers in\n1724\nboth relating to barometers. On\n12\nDecember\n1727\nhe was examined on his astronomy thesis\nDisputatio astronomy ca de motu vertiginis lunae\nⓉ\n(\nAstronomical lecture on the rotational motion of the moon\n)\nby Burman. On\n21\nMay\n1728\nhe was examined on his thesis\nDissertatio gradualis de existentia mentis\nⓉ\n(\nObservations on grades of mental existence\n)\nby Johan Hermansson, the professor of law, philology and politics.\nAfter graduating, Celsius became a substitute lecturer in mathematics, while the professor, Samuel Klingenstierna\n(1698\n-\n1765)\n, was abroad. In fact Klingenstierna and Celsius had both been applicants for the vacant chair of mathematics in the University of Uppsala, but Klingenstierna had been appointed, mainly because of a very strong letter of recommendation from Christian Wolff, a pupil of\nGottfried Leibniz\n. Klingenstierna had been awarded a travel grant to visit the European centres of learning and was not able to take up the chair of mathematics at Uppsala until he returned in\n1731\n, so he had to pay Celsius out of his own pocket for taking on the duties of the chair of mathematics.\nWhen Erik Burman died in\n1729\n, Celsius took over his lectures in astronomy in addition to substituting for the professor of mathematics. This experience allowed him to be appointed Professor of Astronomy in Uppsala in\n1730\n. He had been an assistant secretary of the Royal Society of Sciences in Uppsala since\n1724\nand, following the death of Burman he took on the role of secretary. The University of Uppsala was now a very strong centre for mathematics and astronomy with Klingenstierna and Celsius both world-class scholars.\nIn\n1732\n, following in his grandfather's footsteps, Celsius decided to travel through Europe and he received permission on\n23\nMay of that year. He did not travel alone for he had as a travelling companion Jonas Meldercreutz\n(1714\n-\n1785)\n, a young mathematician who would be appointed to the chair of mathematics at Uppsala after Klingenstierna retired in\n1751\n. One of the tasks Celsius and Meldercreutz undertook was to visit learned societies and academies, aiming to set up links with the Royal Society of Sciences in Uppsala. During his trips, Celsius made several astronomical observations with a quadrant he bought in Berlin. In\n1733\n, he published\n316\nof his observations on the northern lights while in Nuremberg. In the same year, also in Nuremberg, he published an astronomical magazine with astronomer and publisher Michael Adelbulner titled\nCommercium litterarium ad astronomiae incrementum inter huius scientiae amatores communi consilio institutum\nⓉ\n(\nCommerce on the increase in astronomical literature between lovers of that scince and academic institutions\n)\n. It included information about future astronomical phenomena worthy of observation, along with news and reviews. After initial complaints that the news was too old\n(\ndue to the slow posting of the time\n)\n, Celsius started admitting observations from the readers, but the magazine stopped publication two years later after probably\n45\nissues. In late\n1733\nhe travelled to Bologna, where he assisted\nEustachio Manfredi\nwith his observations. His work was published in\nManfredi\n's book,\nLiber de gnomon meridian Bononiensi\nⓉ\n(\nBook of observations at Bologna\n)\n, in\n1736\n. After Bologna he travelled to Rome where again he made observations. Celsius loved Italy and wrote to his mother, saying that he wished he could swap Uppsala for an Italian city so that he would never have to leave.\nWhen Celsius arrived at Paris in late\n1734\n, the scientific community was in the middle of a discussion about the shape of the Earth. Unlike his grandfather, Celsius supported\nPierre de Maupertuis\n, who defended\nNewton\n's theoretical argument of an oblate Earth. The\nAcadémie des Sciences\nhad decided to send two expeditions, one to Peru near the Equator and one to the Arctic Circle, to measure the length of one degree of the meridian arc. The Academy asked Celsius to make the corresponding observations in Sweden but he had to turn down their request since he had neither the financial support nor the necessary instruments. Celsius, therefore, joined the Arctic Circle expedition, headed by\nMaupertuis\n, and it was probably on his suggestion that it was decided to go to Lapland. His grandfather had led an expedition with a similar goal in\n1694\n, but without success.\nCelsius was sent on a short trip to London to commission a zenith sector from Graham, a revered instrument maker of the time. During his visit to London, Celsius attended a meeting of the Society of Antiquaries and published in\nPhilosophical Transactions\nof the\nRoyal Society\n. The expedition departed from Dunkirk, France, in April\n1736\n. In addition to Celsius and\nMaupertuis\n, the mathematicians and astronomers\nAlexis Clairaut\n, Pierre Charles Le Monnier\n(1715\n-\n1799)\nand\nCharles-Étienne Camus\nwere among the party. They arrived at Tornea in the summer of\n1736\n. There, they measured a network of triangles along the river Torne\n(\noriented north to south\n)\n. During winter, the difference was established using the zenith sector at the northern and southern ends of the network. The expedition returned to Paris in the summer of\n1737\n.\nMaupertuis\ndescribes the contributions of Celsius in his\n1738\nreport of the findings of the expedition\nLa Figure de la Terre\nⓉ\n(\nThe shape of the Earth\n)\n[\n2\n]\n:-\nMost of these observations are due to the vigilance of M le Monnier and M Celsius, who, in a country where the Sky often refuses observations, were continuously attentive to not allow any of the possible ones to escape.\nThe results confirmed that\nNewton\nwas in the right. Celsius took part in the debate which followed, where\nJacques Cassini\nand his followers put into question the accuracy of the observations made during the expedition. Celsius defended them in\nDe Observationibus Pro Figura Tellius Determinanda in Gallia Habitis, Disquisitio\nⓉ\n(\nDisquisition on observations made in France for determining the shape of the earth\n)\n(1738)\n, rebutting all their allegations. In it, Celsius shows that, in his previous measures of the meridian in France,\nCassini\nhad committed bigger mistakes than the ones he was accusing them of having made. This was confirmed by a later measurement of the French meridian and the results of the Peru expedition confirmed the findings of the Lapland expedition.\nDue to the success of the Lapland expedition, Celsius received a pension of\n1000\nlivres per year from the French government. He also earned some international recognition, which generated an increased number of exchanges between Uppsala and the rest of Europe. When he returned to Uppsala, Celsius worked to improve the standing of astronomy in Uppsala and Sweden, which had been in decline. He bought new instruments to bring the collection up to the standards of the time\n(\nsome he ordered from Graham, in London\n)\nand built a new observatory on Svatbäck Street\n(\nthe previous one, built by Spole, had burnt down in the\n1702\nfire\n)\n. It was finished in\n1741\n. Celsius, who never married, lived in the building.\nA picture of the Uppsala Observatory is at\nTHIS LINK\n.\nThe observatory was later found to be built on unstable foundations, so a new one was built in\n1853\nfurther away from the city, where the cathedral would not block the southern sky.\nWhen building a precise thermometer, Celsius invented a new scale divided into\n100\ndegrees, with\n0\nbeing the boiling point of water and\n100\nits freezing point. He explains his choice of fixed points in his\n1742\nreport\nObservationer om twänne beständiga Grader på en Termometer\nⓉ\n(\nObservations of twenty fixed degrees on a thermometer\n)\n. To justify his choice, Celsius carried out a number of experiments: he showed the freezing point did not change when varying latitude or pressure and that the boiling point did not depend on the length of the boiling time or the origin of the water. He was aware Fahrenheit had shown that the boiling point depended on pressure, so he experimented with different conditions and concluded that \"the change of one inch in barometer reading approximately equals a change of one degree in the boiling point\", which is remarkably accurate for the time. He stated that the boiling point of water is reliable as a fixed point only with a defined barometric pressure, which he proposed to be\n25\n.\n3\ninches of mercury. The most important aspect of his scale was the identification of two easily reproducible fixed points. Celsius had studied the numerous temperature scales of the time during his travels through Europe in hopes of creating an international scale. In the above paper, he says:-\nThen one can be sure that several such thermometers placed in the same air, will always show the same degree, for instance a thermometer made in Paris, will show the same height as a thermometer made in Uppsala at the same heat.\nThe scale, which he used for the first time on\n25\nDecember\n1741\n, became widely utilised after his death, but its orientation was reversed\n(0\ndegrees Celsius is now the freezing point of water, while\n100\ndegrees is its boiling point\n)\n.\nCelsius continued his astronomical studies during his time in Uppsala, sometimes in collaboration with his contacts in Paris. He studied the timing of eclipses of the moons of Jupiter\n(\nDe Satelliti Bus Jovis\nⓉ\n(\nThe moons of Jupiter\n)\n,\n1741)\nand proposed a theory for the evolution of the stars\n(\nhe thought stars were once planets like Mars which started glowing once all water evaporated\n)\n, among other topics. Along with Olof Hiorter\n(1696\n-\n1750)\n, he was one of the first to find a correlation between compass deviations and the aurora borealis. He also tried to covert Sweden to the Gregorian calendar, though he was unsuccessful in this regard. Celsius served as secretary of the Royal Society of Sciences at Uppsala until his death and was responsible for reviving the Society when he returned to Uppsala in\n1737\nafter the Lapland expedition.\nCelsius also endeavoured to create a star catalogue and for this he wrote\nConstellatione Tauri\nⓉ\n(\nThe constellation of Taurus\n)\n,\n1743\n, and\nConstellatione Leonis\nⓉ\n(\nThe constellation of Leo\n)\n,\n1741\n, among other works. He intended to begin with the zodiac constellations since a more accurate determination of these was necessary in order to improve the solar, lunar and planetary tables. Unfortunately the Uppsala Observatory was not well suited for this task, as the stars of the zodiac never rise high above the horizon and observing on bright summer nights was troublesome. On the other hand, the view to the south was obscured by the cathedral and the hill. For a long time Celsius hesitated unsure whether to set up the classical instrument for this work at the observatory or at his home in Sävja. His death due to tuberculosis in\n1744\n, at not yet age\n43\n, did not allow him to complete this project. His health had degenerated because of his expeditions in harsh conditions and continuous observations in the cold of the night. He died at\n7\no'clock in the morning on\n25\nApril and was buried in the Old Uppsala Churchyard.\nWe quote from\n[\n11\n]\nregarding Celsius's character:-\nCelsius was a versatile man. He wrote Swedish and Latin verses. Always happy and cheerful, no matter how busy he was, he never seemed to be in a hurry.",
  "math_areas": []
}