{
  "nome_completo": "Andrew Searle Hart",
  "nome_curto": "Andrew Hart",
  "ano_nascimento": "1811",
  "ano_morte": "1890",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hart/",
  "lugar_nascimento": "Limerick, Ireland",
  "lugar_morte": "Kilderry, County Donegal, Ireland",
  "biografia": "Andrew Hart\n's parents were George Vaughan Ledwich Hart and Maria Murray Hume. The Rev George Hart\n(1754\n-\n1839)\n, from Glenalla, County Donegal, was a son of John Hart and Catharine Barnard. The Rev George Hart was a curate to the Dean of Derry and then the rector of Castlebar, County Mayo. In\n1791\nhe married Maria Hume\n(\nborn\n1771)\n, a daughter of the Very Rev John Hume, the Dean of Derry, and his wife Jane Murray. Maria inherited Glenalla, County Donegal, from her mother's relatives, the Murray family, in\n1801\n. It was at Glenalla that Andrew spent much time as a child. He was the youngest of his parent's children and outlived all his elder siblings except for one. The children were John Hart\n(\nborn\n1792\n, died as a baby\n)\n, John Hume Hart\n(1794\n-\n1821)\n, William Henry Hart\n(1796\n- lost at sea\n)\n, Jane Alicia Hart\n(1797\n-\n1808)\n, George Vaughan Hart\n(1799\n-\n1836)\n, Catharine Elizabeth Hart\n(1801\n-\n1883)\n, Thomas Barnard Hart\n(1803\n-\n1866)\n, Edward Hume Hart\n(1806\n-\n1872)\n, Jane Maria Hart\n(1809\n-\n1895)\n, and Andrew Searle Hart, the subject of this biography.\nAndrew Hart was a pupil at Foyle College in Londonderry. This school dates back to\n1617\nbut only took the name Foyle College in\n1814\nwhen it moved to a new site outside the city walls. In addition to this schooling, Andrew also had lessons from a private tutor. In November\n1828\nhe entered Trinity College Dublin. There he was in the same class as Isaac Butt who became a barrister, politician and a strong supporter of home rule. Hart and Butt became close friends although they never agreed in their political views. At Trinity College, Hart was one year ahead of\nCharles Graves\nwho entered in\n1829\n. At the time when Hart began his studies\nWilliam Rowan Hamilton\nwas Andrews' Professor of Astronomy in Trinity College Dublin while Franc Sadleir\n(1775\n-\n1851)\nwas Erasmus Smith professor of mathematics.\nJames MacCullagh\nwas appointed junior assistant to the mathematics professor in\n1832\n.\nBartholomew Lloyd\nwas Erasmus Smith professor of Natural and Experimental Philosophy when Hart entered but he became Provost of Trinity College Dublin in\n1831\nand was succeeded as professor of Natural and Experimental Philosophy by his son\nHumphrey Lloyd\n. Hart graduated with a B.A. in\n1833\nand he was awarded the Science medal for his excellent performance. He decided to take the Trinity College Fellowship examinations:-\nThe examination for fellowship was formidable, being held on twelve days preceding Trinity Sunday from nine to twelve in the forenoon and two to five in the afternoon of each day. The subjects of the examination were pure and applied mathematics, experimental physics, mental and moral philosophy, Greek language and literature, Latin language and literature, and Hebrew and cognate languages.\nHart was elected a fellow of Trinity College, on\n15\nJune\n1835\n. We note that\nJames Booth\n, who was four years older than Hart, took the fellowship examinations for the first time in the same year but failed to gain a fellowship. In the autumn of\n1835\nHart began legal training when he entered King's Inns, Dublin and in\n1836\nhe enrolled in Gray's Inn, London. On\n13\nFebruary\n1837\nhe was elected to the\nRoyal Irish Academy\n, and in the following year he was called to the Irish bar. Back at Trinity College, Dublin, he was awarded an M.A. in\n1839\n, and he received an LLB and an LLD in\n1840\n.\nOn\n6\nAugust\n1840\n, at Clontarf, Hart married Frances MacDougall, the second daughter of Henry MacDougall QC, of Dublin. The marriage was conducted by the Rev Charles Stanford. Andrew and Frances Hart had ten children: George Vaughan Hart\n(1841\n-\n1912)\n; Andrew Hart\n(1842\n-\n1869)\n; Fanny Allman Hart\n(1843\n-\n1857)\n; Mary Hart\n(1844\n-\n1858)\n; child born in\n1844\ndied as infant; Henry Chichester Hart\n(1847\n-\n1908)\n; child born in\n1848\ndied as infant; Henrietta Catherine Hart\n(1850\n-\n1881)\n; William Hume Hart\n(1852\n-\n1884)\n; and Louisa Elizabeth Hart\n(1853\n- died as an infant\n)\n. We see from this list that, of Hart's ten children, only two survived him, namely George Vaughan Hart, who was professor of Feudal and English Law at Trinity College from\n1890\nto\n1909\n, and Henry Chichester Hart, who became a botanist and explorer. Henry Chichester Hart's most important work was the book\nFlora of the County Donegal\n.\nIn the\n1840\ns Hart published two mathematics books,\nAn elementary treatise on mechanics\n(\nFirst edition\n1844\n, Second edition\n1847)\nand\nAn elementary treatise on hydrostatics and hydrodynamics\n(\nFirst edition\n1846\n, Second edition\n1850)\n. You can read Hart's Prefaces to these books at\nTHIS LINK\n.\nIn addition to his position as a fellow of Trinity College, where he was connected to the School of Engineering, Hart also served as Professor of Real and Personal Property in King's Inns, Dublin. He also played a major role on the Synod of the Church of Ireland.\nHart published a number of papers on geometry. For example\nOn the Form of Geodesic Lines through the Umbilic of an Ellipsoid\n(1849)\n,\nGeometrical demonstration of some properties of geodesic lines\n(1849)\n,\nOn geodesic lines traced on a surface of the second degree\n(1849)\n, and\nAn account of some transformations of curves\n(1853)\n. For the full references to these papers, and a list of several more of Hart's papers, see\nTHIS LINK\n.\nHis most important result was contained in his paper\nExtension of Terquem's theorem respecting the circle which bisects three sides of a triangle\n(1861)\n. This paper was written after an investigation which had been suggested by\nWilliam Rowan Hamilton\nin a letter he wrote to Hart. In addition Hart corresponded with\nGeorge Salmon\non the same topic. This paper contains the result which became known as Hart's theorem. This theorem is a generalisation of\nFeuerbach\n's Theorem. Hart's Theorem states:-\nTaking any three of the eight circles which touch three others, a circle can be described to touch these three, and to touch a fourth circle of the eight touching circles.\nSee\nthe diagram\n.\nIn his masterpiece\nPrinciples of geometry\n(1925)\n,\nHenry Baker\ndevotes a whole chapter to Hart's Theorem, namely Chapter\n2\nwhich is titled \"Hart's Theorem, for Circles in a Plane, or for Sections of a Quadric.\" Here are the opening paragraphs of this chapter\n[\n1\n]\n:-\nGiven three lines in a plane, there are four circles touching them; these circles, we know, are all touched by another circle, the nine-points circle\n(\nFeuerbach's theorem; see Vol. II\n)\n. In other words, given three lines, we can add to them a circle such that the four, these lines and the circle, are all touched by four other circles. In the present chapter we show how, given any three circles in a plane, we can add to them another circle, which we call the Hart circle, such that the four circles are all touched by four other circles\n(\nHart, 'Quart. J. of Math.', IV\n(1861)\n, p.\n260)\n. The three original circles are in fact touched by eight other circles, as we shall prove. There are fourteen ways of choosing, from these eight, four circles which touch another circle. In six of these ways, the four circles chosen have a common orthogonal circle; and the four circles consisting of the original circles, and their Hart circle, have also a common orthogonal circle. We have shown that circles in a plane may be regarded as projections of plane sections of a quadric. We prove the results enunciated as theorems for such plane sections. This appears greatly to increase the interest and clearness of the matter.\nAs a final comment on Hart's Theorem, we quote the opening sentence of Gabbatt's paper\n[\n3\n]\n:-\nIt is well known that in non-euclidean geometry a plane triangle has four circumcircles, and that each of these circles touches each of four other circles. The latter theorem, which is an extension of that of\nFeuerbach\n, is essentially due to Hart.\nReturning to look at Hart's career, he was made a Senior Fellow of Trinity College, Dublin on\n10\nJuly\n1858\nand was also the College bursar. In\n1873\nhe was appointed as registrar. To put other events of\n1873\ninto context we need to briefly explain the position of Irish universities at this time. Trinity College, Dublin, was originally restricted to members of the Anglican Church of Ireland but from\n1791\nRoman Catholics were admitted. However, fellows and professors were still required to be Anglicans. The secular Queen's University of Ireland, founded in the second half of the\n1840\ns had three colleges, Belfast, Cork and Galway. The Catholic University of Ireland had been founded in Dublin in\n1851\nbut was not recognised by the government. In\n1873\nWilliam Gladstone, British Prime Minister, introduced the Irish University Bill. This Bill proposed abolishing Queen's College, Galway, and making all the others colleges of the University of Dublin. Under the Bill, this university would be secular and its Faculty of Theology would be taken over by the Church of Ireland. The Bill was opposed by the Roman Catholic Church in Ireland and also by the faculty of Trinity College, Dublin. In February\n1873\n, three members of staff of Trinity College were sent to London to lobby MPs in an attempt to defeat the bill. Hart was one of the three and they achieved their aim since the bill was narrowly defeated by just three votes. Gladstone's failure to get his bill passed was a major factor in ending his first spell as Prime Minister.\nIn\n1876\nHart was elected as vice-provost of Trinity College. At this time the provost was\nHumphrey Lloyd\nwho was\n76\nyears old and in failing health. This meant that over the following few years Hart undertook many of the duties of the provost. We note that in the same year as he was elected as vice-provost, Hart's wife died. Hart never gave up his mathematical studies and published\nOn Nine-Point Contact of Cubic Curves\n(1875)\n,\nOn the Intersections of Plane Curves of the Third Order\n(1879)\n,\nOn Twisted Quartics\n(1884)\nand\nOn the Linear Relations between the Nine Points of Intersection of a System of Plane Cubic Curves\n(1887)\n. Here is the first part of Hart's Introduction to his paper\nOn Twisted Quartics\n:-\nA twisted algebraic curve is the complete or partial intersection of two algebraic surfaces, and its degree is defined to be the number of points in which it meets any arbitrary plane. It is easy to see that such curves of any degree higher than the second can be traced on a quadric surface, and it is also obvious that there are many such curves which do not lie on any quadric; and further, that both those which lie on quadrics, and those which are the complete intersections other surface in a number of points equal in each case to the product of the degrees of the curve and surface. It is generally assumed that this property is true of all algebraic curves, but I am not aware that it has been proved except in special cases, such as those above mentioned. The object of the present investigation is to show that the classification of twisted quartics, which is founded on this property, includes all possible twisted quartics; and thus indirectly to show that the property is true of all these curves; or, in other words, that if a twisted curve meets every plane in four points, it will meet every surface of the nth degree in\n4\nn points.\nOn\n25\nJanuary\n1886\n, Hart was knighted at Dublin Castle by Queen Victoria's representative Lord Carnarvon:-\n... in recognition of his academic rank and attainments.\nThe Headmaster of Foyle College in\n1886\nwas Maurice Hine and he wrote to Hart to congratulate him on his knighthood. Hart replied to the Headmaster of the College he had attended as a boy:-\nMany thanks for your congratulations on a honour which is liable to be misunderstood. It was intended by His Excellency as a parting compliment to Trinity College, and my claim to a share in the honour rests solely on the fact that no other living man has been so long connected with the College as I. This is a claim which I can safely undertake to maintain against all the world, which gives me an advantage over many men who have been similarly honoured.\nHart's sister, Jane Maria Hart, had married a cousin who, rather confusingly, was also named George Vaughan Hart. They lived at Kilderry House, Kilderry, County Donegal, and it was in their house that Hart suddenly died aged\n79\nyears.",
  "math_areas": [
    "Geometry",
    "Number Theory"
  ]
}