{
  "nome_completo": "Andrew Russell Forsyth",
  "nome_curto": "Andrew Forsyth",
  "ano_nascimento": "1858",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Forsyth/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "London, England",
  "biografia": "Andrew Forsyth\n's father was John Forsyth and his mother was Christina Glenn. John Forsyth was an engineer working in the Glasgow shipyards and his family came from Paisley. However John Forsyth moved to Liverpool and, taking his family with him, Andrew was soon to show his exceptional mathematical abilities at secondary school in that city.\nForsyth entered Trinity College, University of Cambridge in\n1877\nand there he studied under\nCayley\n, graduating in\n1881\n. Taking the Mathematical Tripos in that year he was First\nWrangler\n(\nmeaning that he was placed first in the ranked list of first class graduates\n)\nand he was appointed to a fellowship at Trinity College. This type of fellowship was competitive and candidates had to submit a thesis; Forsyth's thesis proved deep results on double theta functions. His remarkable talent saw him leave Cambridge in the following year when he was appointed to the chair of mathematics at the University of Liverpool at the remarkably young age of\n24\n.\nAlthough Forsyth was back in Liverpool, the city which had become his home, he did not remain there for very long, accepting a lectureship at Cambridge in\n1884\n. Two years later, at the age of\n28\n, he was elected a Fellow of the\nRoyal Society of London\n. In\n1897\nhe was awarded the Royal Medal by that Society.\nIn\n1893\nhe published\nTheory of functions of a complex variable\nwhich had such an impact at Cambridge that function theory dominated there for many years.\nWhittaker\nwrites in\n[\n6\n]\nthat this text:-\n... had a greater influence on British mathematics than any work since\nNewton\n's Principia.\nHowever the reputation of the book outside Britain was not high. In fact this is not surprising since the whole thrust of the book was to bring the great advances of Continental mathematics to Cambridge which Forsyth rightly saw as living in the past. He was well equipped to undertake this task for he travelled widely and, being a good linguist, was able to appreciate the advances made by authors writing in French and German.\nOn\nCayley\n's death Forsyth was appointed to his chair in\n1895\nbecoming the Sadleirian professor of Pure Mathematics. However his preference for technical mastery rather than rigorous analysis meant that he failed to inspire future pure mathematicians. In fact one would have to say that Forsyth was unlucky, for although he saw the importance of Continental mathematics, at the same time his greatest strengths lay in his ability to handle complex formulae. He therefore excelled at precisely the style of mathematics which he himself campaigned successfully to replace at Cambridge.\nHe had a love affair with Marion Amelia Boys, the wife of\nC V Boys\n, and the scandal of\n1910\nforced him to resign his chair at Cambridge. After marrying Marion Boys, he left the country for a while spending some time in Calcutta before he eventually found another post in England, being appointed to the chair in Imperial College London in\n1913\n. He retired from his chair in London in\n1923\nwhen reaching the age of sixty-five but continued to publish mathematical texts until he was close to eighty years of age.\nFamous texts which Forsyth published before his\n1893\nwork\nTheory of Functions of a complex variable\n, are\nA treatise on differential equations\n(1885)\n, and\nTheory of differential equations\npublished in six volumes between\n1890\nand\n1906\n. After his\n1893\ntreatise he published many other texts, the most important of which are\nLectures on the differential geometry of curves and surfaces\n(1912)\n,\nLectures introductory to the theory of functions of two complex variables\n(1914)\n,\nCalculus of variations\n(1927)\n,\nGeometry of four dimensions\nwhich was in two volumes and published in\n1930\n, and\nIntrinsic geometry of ideal space\nalso in two volumes, published in\n1935\n.\nIn\n[\n2\n]\nit is noted that:-\nAll his treatises were marked by perfect form and devastating completeness. He also had humour of a specialized kind, even to the point of joviality. As a teacher he was sympathetic and always ready with vast store of information.\nNot everyone had such a high opinion of Forsyth, however. Read  what\nRoth\nthought of him at\nTHIS LINK",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}