{
  "nome_completo": "Andrei Nikolaevich Tikhonov",
  "nome_curto": "Andrei Tikhonov",
  "ano_nascimento": "1906",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tikhonov/",
  "lugar_nascimento": "Gzhatska, Smolensk, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Like most Russian mathematicians there are different ways to transliterate\nAndrei Nikolaevich Tikhonov\n's name from the Roman alphabet. The most common way, other than Andrei Nikolaevich Tikhonov, is to write it as\nAndrey Nikolayevich Tychonoff.\nAndrei Nikolaevich Tikhonov attended secondary school as a day pupil and entered the Moscow University in\n1922\n, the year in which he completed his school education. His studied in the Mathematics Department of the Faculty of Mathematics and Physics at Moscow University and made remarkable progress, having his first paper published in\n1925\nwhile he was still in the middle of his undergraduate course.\nThis first work was related to results of\nAleksandrov\nand\nUrysohn\non conditions for a\ntopological\nspace to be metrisable. However he did not stop there and continued his investigations in topology. By\n1926\nhe had discovered the topological construction which is today named after him, the Tikhonov topology defined on the product of topological spaces.\nAleksandrov\n, recalling in\n[\n4\n]\nhow he failed to appreciate the significance of Tikhonov's ideas at the time he proposed them, remembered:-\n... very well with what mistrust he met Tikhonov's proposed definition. How was it possible that a topology introduced by means of such enormous neighbourhoods, which are only distinguished from the whole space by a finite number of the coordinates, could catch any of the essntial characteristics of a topological product?\nTikhonov certainly had given the right definition and this idea, which was counterintuitive to even as great a topologist as\nAleksandrov\n, allowed Tikhonov to go on and prove such important topological results as the product of any set of compact topological spaces is compact.\nFew mathematicians have gained a worldwide reputation before they even start their research careers but this was essentially how it was for Tikhonov. His results on the Tikhonov topology of products were achieved before he graduated in\n1927\n. With this impressive record he became a research student at Moscow University in\n1927\n. It might be thought that someone who had clearly such an intuitive grasp of topological ideas would be only too pleased to use his talents in that area. Tikhonov, however, had equal talents for other areas of mathematics. The range of his work is summarised in\n[\n3\n]\n:-\nWe owe to Tikhonov deep and fundamental results in a wide range of topics in modern mathematics. His first-class achievements in topology and\nfunctional analysis\n, in the theory of ordinary and\npartial differential equations\n, in the mathematical problems of geophysics and electrodynamics, in computational mathematics and in mathematical physics are all widely known. Tikhonov's scientific work is characterised by magnificent achievements in very abstract fields of so-called pure mathematics, combined with deep investigations into the mathematical disciplines directly connected with practical requirements.\nIn fact Tikhonov's work led from topology to functional analysis with his famous fixed point theorem for continuous maps from convex compact subsets of locally convex topological spaces in\n1935\n. These results are of importance in both topology and functional analysis and were applied by Tikhonov to solve problems in mathematical physics.\nHe defended his\nhabilitation\nthesis in\n1936\non\nFunctional equations of\nVolterra\ntype and their applications to mathematical physics\n. The thesis applied an extension of\nÉmile Picard\n's method of approximating the solution of a\ndifferential equation\nand gave applications to heat conduction, in particular cooling which obeys the law given by\nJosef Stefan\nand\nBoltzmann\n. After successfully defending his thesis, Tikhonov was appointed as a professor at Moscow University in\n1936\nand then, three years later, he was elected as a Corresponding Member of the\nUSSR Academy of Sciences\n.\nTikhonov's approach to problems in mathematical physics is described in\n[\n14\n]\n:-\nA characteristic of Tikhonov's research is to combine a concrete theme in natural science with investigations into a fundamental mathematical problem. In discussing some general problem in nature he always knows how to pick out a typical concrete physical problem and to give it a clear mathematical formulation. However, his mathematical investigations are never confined to the solution of a given concrete problem, but serve as the starting point for stating a general mathematical problem that is a broad generalisation of the first problem.\nThe extremely deep investigations of Tikhonov into a number of general problems in mathematical physics grew out of his interest in geophysics and electrodynamics. Thus, his research on the Earth's crust lead to investigations on well-posed\nCauchy\nproblems for parabolic equations and to the construction of a method for solving general functional equations of\nVolterra\ntype. ...\nTikhonov's work on mathematical physics continued throughout the\n1940\ns and he was awarded the State Prize for this work in\n1953\n. However, in\n1948\nhe began to study a new type of problem when he considered the behaviour of the solutions of systems of equations with a small parameter in the term with the highest derivative. After a series of fundamental papers introducing the topic, the work was carried on by his students.\nAnother area in which Tikhonov made fundamental contributions was that of computational mathematics\n(\n[\n11\n]\nand\n[\n12\n]\n)\n:-\nUnder his guidance many algorithms for the solution of various problems of electrodynamics, geophysics, plasma physics, gas dynamics, ... and other branches of the natural sciences were evolved and put into practice. ... One of the most outstanding achievemnets in computational mathematics is the theory of homogeneous difference schemes, which Tikhonov developed in collaboration with\nSamarskii\n....\nIn the\n1960\ns Tikhonov began to produce an important series of papers on ill-posed problems. He defined a class of regularisable ill-posed problems and introduced the concept of a regularising operator which was used in the solution of these problems. Combining his computing skills with solving problems of this type, Tikhonov gave computer implementations of algorithms to compute the operators which he used in the solution of these problems. Tikhonov was awarded the Lenin Prize for his work on ill-posed problems in\n1966\n. In the same year he was elected to full membership of the\nUSSR Academy of Sciences\n.\nTikhonov's wide interests throughout mathematics led him to hold a number of different chairs at Moscow University, in particular a chair in the Mathematical Physics Faculty and a chair of Computational Mathematics in the Engineering Mathematics Faculty. He also became dean of the Faculty of Computing and Cybernetics at Moscow University. Tikhonov was appointed as Deputy Director of the Institute of Applied Mathematics of the\nUSSR Academy of Sciences\n, a position he held for many years.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Topology"
  ]
}