{
  "nome_completo": "Andre-Louis Cholesky",
  "nome_curto": "Andre-Louis Cholesky",
  "ano_nascimento": "1875",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cholesky/",
  "lugar_nascimento": "Montguyon, Charentes Maritime, France",
  "lugar_morte": "North France",
  "biografia": "Andre-Louis Cholesky\nwas born in Montguyon in the Charentes Maritime region of France north of Bordeaux. He attended the Lycée in Bordeaux and was awarded the first part of his baccalaureat on\n14\nNovember\n1892\nand second part on\n24\nJuly\n1893\n. Cholesky entered l'École Polytechnique on\n15\nOctober\n1895\nbeing placed\n88\nth\nout of\n223\nentrant students in that year. His professors at l'École Polytechnique included\nCamille Jordan\n, and Henri Becquerel the famous physicist who discovered radioactivity. After two successful years he took his final examinations from l'École Polytechnique in\n1897\n. He had improved his position to be placed\n38\nth\nout of\n222\nstudents in these examinations. He then joined the army becoming a second lieutenant, and went to study at the school d'Application de l'Artillerie et du Génie starting in October\n1897\n.  He completed his course in\n1899\nand he maintained his steady improvement for now he was placed\n5\nth\nout of\n86\nstudents who qualified in that year.\nTunisia was at that time still officially part of the Ottoman Empire but it had been a French protectorate following the Convention of Al-Marsa which was signed in\n1883\nby Tunisia and the French government. The French stabilized the economy and established modern communications. From January to June\n1902\n, Cholesky carried out a mission in Tunisia, then he was sent on a second mission from November\n1902\nto May\n1903\n. On\n31\nDecember\n1903\nCholesky began a period of service in Algeria. That country had received much poorer treatment from France than had Tunisia. The French established domination over the country and its native inhabitants, but developed new communications, hospitals and medical services. He left Algeria on\n6\nJune\n1904\n.\nThe most significant step in Cholesky's career was whan he moved to the Geodesic Section of the Army Geographic Service in June\n1905\nwhere he was reported to have:-\n... a sharp intelligence and a great facility for mathematical work, having an inquiring spirit and original ideas.\nDelambre\nhad completed his baseline measurements in the spring of\n1798\nas part of his contribution to defining the metre. In\n1882\nFrench experts returned to\nDelambre\n's baseline but did not re-measure it, preferring to check\nDelambre\n's calculations indirectly by triangulation. In the first decade of the\n20\nth\ncentury, following the revision of the Paris Meridian, a new triangulation of France was planned to take place. The problem of adjusting the grid greatly worried officers in the Geographical Service, who were anxious to find a method which was simple, fast and precise. To solve the condition equations in the method of least squares, Cholesky invented a very ingenious computational procedure which immediately proved extremely useful:  it is now known as the\nMethod of Cholesky\nand we describe it below. On\n26\nSeptember\n1905\nhe became First Lieutenant and he married two years later on\n10\nMay\n1907\n. Cholesky and his wife had three children; a son and two daughters.\nCrete had been a part of the Ottoman Empire for\n200\nyears but as the Empire became weaker the major countries in Europe aimed to become involved in Crete's future. After a revolution in Crete against the Turks in\n1896\n, following which Greece tried to take control, the Great Powers imposed a settlement. The French took responsibility for the Sitia sector, the Italians for the Ierapetra sector, the British for the Iraklion sector, and the Russians for the Rethymnon sector, while the four jointly looked after the Chania sector. Colonel Lubanski, the commanding office of the French troops in Crete, was a former geodesist and wanted mapping work to be carried out on the island. Lieutenant Colonel Bourgeois, Head of the Geodesic Section, made a preliminary reconnaissance in March and April of\n1906\n. Cholesky was sent to Crete on\n7\nNovember\n1907\nas one of the three officers assigned to carry out the task. He measured a baseline in the Kavousi plain and used astronomical measurements to determine the precise position of the southern end of his baseline. After his fellow officers were dispatched to other duties, Cholesky carried out a triangulation as well as making a topographical survey of the French and British sectors.  He succeeded in making the triangulation under extremely difficult conditions for winter in Crete saw considerable falls of snow on the high mountains. Political events, however, prevented land surveys being carried out and Cholesky left Crete on\n25\nJune\n1908\n.\nHe was named Captain with the\n2\nnd\nregiment of Infantry on\n25\nMarch\n1909\nand from September\n1909\nto September\n1911\nhe carried out a tour of duty with his unit.  Later in\n1911\nhe returned to the Geodesic Section of the Army Geographic Service and was assigned work in Algeria and Tunisia where he had already gained experience seven years earlier. From\n27\nOctober\n1911\nto\n24\nApril\n1912\n, then again from\n23\nOctober\n1912\nto\n17\nApril\n1913\n, he undertook precision levelling work in Algeria and Tunisia. This work was intended to prepare for the building of a railway line.  The construction of a grid in Tunisia was completed during the winter of\n1913\n-\n1914\nafter which there was a period of checking and readjustment. Similar work had to be carried out in Morocco and Cholesky devised methods to allow the work to be undertaken more quickly yet still retaining the necessary accuracy. After testing his procedures they were used in Morocco beginning in July\n1912\nwith the work being completed in January\n1913\n.\nOn\n25\nMay\n1913\n, Cholesky was assigned to the Ministry of Foreign Affairs and he was named head of Topographical Service of the Regency of Tunis.  He began work there but after World War I broke out in the autumn of\n1914\nhe was transferred to other duties. In January\n1915\nbe began to organise artillery firing and in February he was sent to work with a unit in the Vosges. In September\n1916\nhe was sent on a military mission to Romania where he took on the role of director of the geographical service of the Romanian army.  He was promoted in July\n1917\nand continued to serve in Romania until February\n1918\n.\nCholesky died from wounds received on the battle field on\n31\nAugust\n1918\nat\n5\no'clock in the morning in the North of France. After his death one of his fellow officers, Commandant Benoit, published Cholesky's method of computing solutions to the normal equations for some least squares data fitting problems in\nNote sur une méthode de resolution des équations normales provenant de l'application de la méthode des moindres carrés à un système d'équations lineaires en nombre inferieure à celui des inconnues. Application de la méthode à la resolution d'un système defini d'équations lineaires\n(\nProcede du Commandant Cholesky\n)\nⓉ\n(\nNote on a method for resolution of the normal equations from the application of the method of least squares to a linear system of equations in a lower number of unknowns. Application of the method to the resolution of a defined system of linear equations\n(\nfollowing Cholesky\n)\n)\n, published in the\nBulletin géodesique\nin\n1924\n.\nThe Cholesky Factorization\n(\nor Cholesky Decomposition\n)\ntakes a symmetric positive definite matrix\nA\nA\nA\nand writes it as\nA\n=\nL\nL\n′\nA = LL'\nA\n=\nL\nL\n′\nwhere\nL\nL\nL\nis a lower triangular matrix with positive diagonal entries\n(\nsometimes called the Cholesky triangle\n)\n, and\nL\n′\nL'\nL\n′\nis the transpose of\nL\nL\nL\n. To\ns\no\nl\nv\ne\nA\nx\n=\nb\nsolve Ax = b\ns\no\nl\nv\ne\nA\nx\n=\nb\none now needs to solve\nL\nL\n′\nx\n=\nb\nLL'x = b\nL\nL\n′\nx\n=\nb\nso put\ny\n=\nL\n′\nx\ny = L'x\ny\n=\nL\n′\nx\nwhich gives\nL\ny\n=\nb\nLy = b\nL\ny\n=\nb\nwhich is solved for\ny\ny\ny\n, then\ny\n=\nL\n′\nx\ny = L'x\ny\n=\nL\n′\nx\nis solved for\nx\nx\nx\nto obtain the solution. The beauty of the method is that it is trivial to solve equations of the type\nM\nx\n=\nb\nMx = b\nM\nx\n=\nb\nwhen\nM\nM\nM\nis a triangular matrix.\nThe method received little attention after its publication in\n1924\nbut\nJack Todd\nincluded it in his analysis courses in King's College, London, during World War II. In\n1948\nthe method was analysed in a paper by\nFox\n, Huskey and\nWilkinson\nwhile in the same year\nTuring\npublished a paper on the stability of the method.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}