{
  "nome_completo": "André Bloch",
  "nome_curto": "André Bloch",
  "ano_nascimento": "1893",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bloch/",
  "lugar_nascimento": "Besançon, France",
  "lugar_morte": "Paris, France",
  "biografia": "André Bloch\n's parents were of Alsatian and Jewish origin. André's father was a watchmaker with a business in Besançon. André was the oldest of his parents' three boys, his younger brothers being Georges\n(\nborn\n13\nOctober\n1894)\nand Henry. André and Georges were less than a year apart in age and ended up in the same class at the lycée in Besançon. Professor Carrus had taught the two boys mathematics in\n1908\n-\n09\nand recognised that both had considerable mathematical talents and should enter the competition for admission to the École Polytechnique.\nGeorges Valiron\ntaught both boys the following year. He wrote\n(\nsee\n[\n1\n]\n)\n:-\nThe following year, October\n1910\n, I had both Bloch brothers in my class. André had already displayed his interest in the abstract properties to which he would later make such significant contributions. But he spoke rarely and didn't bother to prepare for the examinations. Georges was more lively and perhaps as good a mathematician as his brother. Georges was at the head of the class and clearly the best on the written examinations. André was last in my class of eleven students. André was lucky and got\nErnest Vessiot\nto give him the oral exam\n[\nfor entry into the École Polytechnique\n]\n.\nVessiot\nrecognized Andre's aptitude and gave him a\n19\nout of\n20\non the oral.\nLeaving the lycée in\n1912\n, both brothers did one year of military training before beginning their university studies. In October\n1913\n, André and his brother Georges entered the École Polytechnique; André ranked\n151\nst, Georges ranked\n229\nth\nin the list of students entering that year. When World War I  broke out in August\n1914\n, both brothers were drafted into the army. Both André and Georges were injured while serving. André served as second-lieutenant in the artillery and was attached to the headquarters of General Noël Édouard, Vicomte de Curières de Castelnau, who commanded the Second French Army at the heights of Grand Couronné near Nancy. The Germans attempted to capture Nancy but, after a week of heavy fighting, were driven back. After the French advanced to the Seille river, the front stabilised and fighting went on with no progress by either side. André Bloch was part of the French forces here for several months before, during a heavy German bombardment, he fell from the top of an observation post. His injuries were severe and he was hospitalised a number of times but never regained his health sufficiently to return to his unit.\nAndré's brother Georges was also wounded in the head in the fighting and lost the sight of one of his eyes. Like André, he was unfit to return to the fighting and, in October\n1917\n, he returned to his academic studies at the École Polytechnique. On\n17\nNovember\n1917\n, at a family meal, André murdered his brother Georges, his uncle and his aunt by stabbing them. After the murders he ran into the street shouting and was arrested without putting up any resistance. He was confined to a psychiatric hospital\n(\nSaint-Maurice Hospital also called Maison de Charenton\n)\nsituated in the Paris outskirts where he was a model patient. Henri Baruk was a psychiatrist with an international reputation working at the hospital. He described André Bloch's typical day\n[\n2\n]\n:-\nEvery day for forty years this man sat at a table in a little corridor leading to the room he occupied, never budging from his position, except to take his meals, until evening. He passed his time algebraic or mathematical signs on bits of paper, or else plunged into reading and annotating books on mathematics whose intellectual level was that of the great specialists in the field. ... At six-thirty he would close his notebooks and books, dine, then immediately return to his room, fall on his bed and sleep through until the next morning. While other patients constantly requested that they be given their freedom, he was perfectly happy to study his equations and keep his correspondence up to date.\nBloch worked on a large range of mathematical topics; for example, function theory, geometry,\nnumber theory\n, algebraic equations and kinematics. He published articles such as:\nSur les intégrales de Fresnel\nⓉ\n(\nOn Fresnel integrals\n)\n(1919)\n,\nMémoire d'analyse diophantienne linéaire\nⓉ\n(\nMemoir on linear Diophantine analysis\n)\n(1922)\n,\nLes propriétés diamétrales des coniques déduites de la définition focale\nⓉ\n(\nDiametric conical properties inferred from the focal definition\n)\n(1924)\n,\nLes théorèmes de M Valiron sur les fonctions entières et la théorie de l'uniformisation\nⓉ\n(\nValiron's theorems on entire functions and the standardization theory\n)\n(1925)\n,\nLes fonctions holomorphes et méromorphes dans le cercle-unité\nⓉ\n(\nThe holomorphic and meromorphic functions in the unit circle\n)\n(1926)\n,\nLe problème de la cubique lacunaire\nⓉ\n(\nThe problem of incomplete cubic\n)\n(1927)\n, and\nRacines multiples des systèmes de m équations à m inconnues\nⓉ\n(\nmultiple Roots of m equations with m unknown systems\n)\n(1927)\n. It is reasonable to ask how someone who was so completely isolated from the world of mathematics could have made such outstanding contributions. He seems to have learnt all the mathematics he knew from a few books which he was given in the mental hospital. He did subscribe to the\nBulletin des Sciences Mathématiques\nand corresponded with a number of mathematicians such as\nJacques Hadamard\n,\nGösta Mittag-Leffler\n,\nGeorge Pólya\nand\nHenri Cartan\n. He wrote two papers in collaboration with\nPólya\n, namely\nOn the roots of certain algebraic equations\n(1932)\n, and\nAbschätzung des Betrages einer Determinante\nⓉ\n(\nestimate the amount of a determinant\n)\n(1933)\n.\nLouis Mordell\n, in\n[\n8\n]\n, explained how\nHadamard\nand Bloch met:-\nHadamard\nsaid to me that as editor of a mathematical journal, he received rather good papers from someone unknown to him, so he invited him to dinner. His correspondent wrote that owing to circumstances beyond his control, he could not accept the invitation, but he invited\nHadamard\nto visit him.\nHadamard\ndid so and found to his great surprise that his author was confined to a criminal lunatic asylum.\nPólya\n, like\nHadamard\n, communicated with Bloch by correspondence.\nSzolem Mandelbrojt\nalso seems to have befriended Bloch and visited him in the asylum. He is thought to have been Bloch's last visitor before he died.\nSince Bloch was Jewish, he realised that he was in danger when France was occupied by Germany during World War II. He therefore published a number of articles under a pseudonym during the war years. For example his paper\nSur une généralisation du théorème du Guldin\nⓉ\n(\nOn a generalization of the theorem of Guldin\n)\n(1941)\nappeared under the pseudonym René Binaud while three other of Bloch's articles in\n1941\nand\n1942\nappeared under the pseudonym Marcel Segond.\nBloch was a model patient who refused to go out saying \"Mathematics is enough for me\". His only interest, other than mathematics, appears to have been chess. Henri Baruk, Bloch's psychiatrist\n[\n2\n]\n:-\n... found it difficult to imagine that such a charming, cultivated, polite man could have committed such an act.\nOne day Bloch's younger brother Henry, who had been living in Mexico, passed through Paris and went to the Maison de Charenton to visit his brother\n[\n2\n]\n:-\nAndré gave no sign of affection or welcome to his brother. His manner was extremely cold.\nThe next day, Bloch explained the murders to his doctor Henri Baruk, saying that there had been mental illness in his family. He saw it as his eugenic duty!\n[\n2\n]\n:-\nIt's a matter of mathematical logic. There were mentally ill people in my family, on the maternal side, to be exact. The destruction of the whole branch had to follow as a matter of course. I started my job at the time of the famous meal, but never got a chance to finish it.\nWhen Dr Baruk said that this was a horrifying way to think, Bloch replied\n[\n4\n]\n:-\nYou are using emotional language. Above all there is mathematics and its laws. You know very well that my philosophy is based on pragmatism and absolute rationality. I have applied the example and the principles of a celebrated mathematician from Alexandria,\nHypatia\n.\nThe reference to\nHypatia\nseems puzzling, but\nHenri Cartan\nand\nJacqueline Ferrand\nfound the following quote by Charles Kingsley\n(\nin a book published in\n1853\nwhich Bloch may well have read\n)\n, describing\nHypatia\n's reaction to seeing gladiators massacre prisoners\n[\n4\n]\n:-\nAnd yet Hypatia's countenance did not falter: why should it? What were their numbers beside the thousands who had perished year by year for centuries, by that and far worse details, in the amphitheaters of the empire, for that faith which she was vowed to re-establish. It was part of the great system and she must endure it. ... After all, what were the lives of those few semi-brutes, returning thus a few years earlier to the clay from which they sprang, compared with the regeneration of the world?\nDr Baruk diagnosed that Bloch was suffering from\n[\n2\n]\n:-\n... morbid rationalism.\n[\nHe committed\n]\na crime of logic, performed in the name of absolute rationalism, as dangerous as any spontaneous passion.\nIt is likely that Bloch's wartime injury had damaged his prefrontal cortex and caused his condition. Of course, an alternative explanation would be to say that his behaviour proved that indeed there was mental illness in his family.\nThe\nAcadémie des Sciences\nawarded him the Becquerel Prize just before his death. He died in Saint-Anne Hospital where he had been admitted for an operation after developing leukaemia.\nOf his mathematical results, Bloch is best known for \"Bloch's theorem\". Douglas Campbell writes\n[\n3\n]\n:-\nAn extremely pretty result in complex function theory concerns Bloch's theorem, a universal covering property for any non-constant analytic function. Although there is a simple classification of\nRiemann\nsurfaces\n(\nhyperbolic, elliptic, parabolic\n)\n, any specific\nRiemann\nsurface can be a nasty, brutish, intricate object. Bloch's theorem provides a touch of beauty, a surprising quantitative invariance to the class of normalized hyperbolic\nRiemann\nsurfaces.\nBloch's theorem, which appears in his\n1925\npaper,\nLes théorèmes de M Valiron sur les fonctions entières et la théorie de l'uniformisation\nⓉ\n(\nValiron's theorems on entire functions and the theory of standardization\n)\n, was\n(\nas the title of the paper suggests\n)\ninspired by a result by\nGeorges Valiron\n. Related to Bloch's theorem is Bloch's constant\nB\nB\nB\nand Bloch showed that\nB\n≥\n1\n72\n=\n0.013888\nB ≥ \\large\\frac{1}{72}\\normalsize  = 0.013888\nB\n≥\n7\n2\n1\n​\n=\n0\n.\n0\n1\n3\n8\n8\n8\n. In fact the remarkable property in the theorem is contained in the fact that\nB\nB\nB\nis strictly greater than\n0\n. In\n1937\nLars Ahlfors\nand\nHelmut Grunsky\nshowed that\n0.4330127\n<\nB\n<\n0.4718617\n0.4330127 < B < 0.4718617\n0\n.\n4\n3\n3\n0\n1\n2\n7\n<\nB\n<\n0\n.\n4\n7\n1\n8\n6\n1\n7\n. This has been improved to\n0.4332127\n<\nB\n<\n0.4718617\n0.4332127 < B < 0.4718617\n0\n.\n4\n3\n3\n2\n1\n2\n7\n<\nB\n<\n0\n.\n4\n7\n1\n8\n6\n1\n7\nbut the precise value of the constant is still unknown.\nHis final publications were:\n(\nwith Gustave Guillaumin\n)\nSur le volume des polyèdres non euclidiens\nⓉ\n(\nOn the volume of non-Euclidean polyhedra\n)\n(1947)\n,\nSur les fonctions bornée à zéros multiples, les fonctions à valeurs ramifiées, et les couples de fonctions soumise à certaines conditions\nⓉ\n(\nOn the functions with multiple zeros, functions with branched values, and pairs of functions couples subject to certain terms\n)\n(1948)\nand the\n141\n-page book, written with Gustave Guillaumin,\nLa Géométrie intégrale du contour gauche\nⓉ\n(\nIntegral geometry of closed contours\n)\n(1949)\n.\nÉlie Cartan\nwrote the Preface to the book:-\nThe present work is due to the collaboration of two mathematicians, André Bloch and Gustave Guillaumin. The name of André Bloch is attached to magnificent works on the theory of analytic functions of a complex variable and on many different areas of geometry, in particular geometrical inversion and non-Euclidean geometry for which he had a particular fondness. His recent loss will be sorely felt by all mathematicians. Gustave Guillaumin was a pupil of\nJoseph Boussinesq\nwho was particularly interested in his research on the theories of elasticity and the equilibrium of semi-fluids. Falling ill in\n1924\n, he stopped publishing for several years, but did not continue his work on the elasticity, the theory of fluids, the elastic pipes, etc. The integral geometry of the closed contour has already been the subject of several important pieces of research. Suffice it to say in particular work by\nGabriel Koenigs\nand his students on the determination of the volume generated by any movement of a closed contour, those of\nJacques Hadamard\non the generalization of the theorem of\nPaul Guldin\nand those of M A Buhl on the geometry and the analysis of multiple integrals. This is the first book that contains a presentation, both educational and synthetic, of these problems and all those associated with them.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}