{
  "nome_completo": "Andrei Yuryevich Okounkov",
  "nome_curto": "Andrei Yuryevich Okounkov",
  "ano_nascimento": "1969",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Okounkov/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": null,
  "biografia": "Andrei Yuryevich Okounkov\nwas educated in Moscow where he attended Moscow State University. However, his route was not quite the rapid one taken by many who go on to acquire the highest achievements\n[\n7\n]\n:-\nI didn't go through special schools and olympiads. I came via studying economics and army service. I had a family before papers. As a result, my mind is probably not as quick as it could have been with an early drilling in math. But perhaps I also had some advantages over my younger classmates. I had a broader view of the universe and a better idea about the place of mathematics in it. This helped me form my own opinion about what is important, beautiful, promising, etc.\nAfter the award of his first degree, Okounkov remained at Moscow State University undertaking research for his Candidate's degree\n(\nequivalent to a Ph.D.\n)\nsupervised by\nAlexander Aleksandrovich Kirillov\n. He explained in\n[\n7\n]\nthe importance of his teachers at this time in his mathematical development:-\nGrowing up in\nKirillov\n's seminar, I had in its participants, especially in Grisha Ol'shanskii, wonderful teachers who generously invested their time and talent into explaining mathematics and who patiently followed my first professional steps. I can't imagine becoming a mathematician without them. So it must be that in this respect my professional formation resembles everybody else's.\nOkounkov was awarded his Candidate's degree in\n1995\nfor his thesis\nAdmissible Representation of Gelfand Pairs Associated with the Infinite Symmetric Group\n. Before the award of this degree, he already had papers in print such as\nThoma's theorem and representations of an infinite bisymmetric group\n(\nRussian\n)\n(1994)\nand\nOn the representation of orbits in the form of the sum of elementary orbits\n(\nRussian\n)\n(1994)\n. He was appointed as a research fellow in the Dobrushin Mathematical Laboratory at the Institute for Problems of Information Transmission at the\nRussian Academy of Sciences\n. Moving to the United States, he spent time at the Mathematical Science Research Institute in Berkeley in the academic year\n1996\n-\n97\nfinancially supported by a grant from the National Science Foundation. While there he wrote the paper\nProof of a Conjecture of Goulden and Jackson\n. His abstract reads:-\nWe prove an integration formula involving Jack polynomials conjectured by I P Goulden and D M Jackson in connection with enumeration of maps in surfaces.\nIn\n1997\nhe was appointed an Instructor at the University of Chicago, a position he held for three years. He also spent some time at the Institute for Advanced Study at Princeton. Appointed as an Assistant Professor at the University of California at Berkeley, he held a Alfred P Sloan Research Fellowship in\n2000\nand a Fellowship from the David and Lucile Packard Foundation in\n2001\n. Packard Fellowships are awarded to researchers in mathematics, natural sciences, computer science, and engineering who are in the first three years of a faculty appointment.\nIn\n2002\nOkounkov was appointed as a Professor at Princeton University. He received a\nEuropean Mathematical Society\nPrize\n2004\n. The citation reads:-\nAndrei Okounkov ... contributed greatly to the field of asymptotic combinatorics. An extremely versatile mathematician, he found a wide array of applications of his methods. His early results include a proof of a conjecture of Ol'shanskii on the representations theory of groups with infinite-dimensional duals. Okounkov gave the first proof of the celebrated Baik-Deift-Johansson conjecture, which states that the asymptotics of random partitions distributed according to the\nPlancherel\nmeasure coincides with that of the eigenvalues of large Hermitian matrices. An important and influential result of Okounkov is a formula he found in joint work with Borodin, which expresses a general\nToeplitz\ndeterminant\nas the\nFredholm\ndeterminant of the product of two associated\nHankel\noperators. The new techniques of working with random partitions invented and successfully developed by Okounkov lead to a striking array of applications in a wide variety of fields: topology of module spaces,\nergodic theory\n, the theory of random surfaces and\nalgebraic geometry\n.\nHis greatest honour has been the award of a\nFields\nmedal at The International Congress of Mathematicians held at Madrid in August\n2006\n:-\nFor his contributions bridging probability, representation theory and algebraic geometry.\nThe press release concerning his award begins:-\nThe work of Andrei Okounkov has revealed profound new connections between different areas of mathematics and has brought new insights into problems arising in physics. Although his work is difficult to classify because it touches on such a variety of areas, two clear themes are the use of notions of randomness and of classical ideas from\nrepresentation theory\n. This combination has proven powerful in attacking problems from algebraic geometry and statistical mechanics.\nAsked about how he felt being awarded a\nFields Medal\nhe replied:-\nOut of a whole spectrum of thoughts that I had in the time since receiving the phone call from the President of the\nInternational Mathematical Union\n, two are especially recurrent. First, this is a great honour and it means a great responsibility. At times, I feel overwhelmed by both. Second, I can't wait to share this recognition with my friends and collaborators. Mathematics is both a personal and collective endeavour: while ideas are born in individual heads, the exchange of ideas is just as important for progress. I was very fortunate to work with many brilliant mathematician who also became my close personal friends. This is our joint success.\nHe explained in\n[\n7\n]\nhow he went about tackling difficult problems:-\nI personally don't know how one can understand something without both thinking about it quietly over and over and discussing it with friends. When I feel puzzled, I like long walks or bike rides. I like to be alone with my computer playing with formulas or experimenting with code. But when I finally have an idea, I can't wait to share it with others. I am so fortunate to be able to share my work and my excitement about it with many brilliant people who are at the same time wonderful friends.\nAndrew Wiles\nis quoted in\n[\n3\n]\ngiving this appreciation of his colleague Andrei Okounkov:-\nOne of his greatest strengths is his amazing versatility. He works in many different fields of mathematics and succeeds in taking results from one area and applying them in a seemingly quite different field.\nOkounkov left Princeton in\n2010\nto take up a professorship of mathematics at Columbia University in New York.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}