{
  "nome_completo": "Andrzej Mostowski",
  "nome_curto": "Andrzej Mostowski",
  "ano_nascimento": "1913",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mostowski/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Vancouver, Canada",
  "biografia": "Andrzej Mostowski\n's mother, Zofia Kramstyk, worked in a bank while his father, Stanisław Mostowski, was an assistant in the Department of Physical Chemistry of the University of Lemberg\n(\nnow Lviv, Ukraine\n)\n. Andrzej was born one year before the outbreak of World War I and his father Stanisław Mostowski joined the army in\n1914\n. Sadly, however, Stanisław died in the year after his son Andrzej was born. The family went to Zakopane, a winter-sports and health-resort centre in the Tatras Mountains, for a vacation in the winter of\n1914\n. However they were forced to remain there due to World War I and it was not until\n1920\nthat they left Zakopane and moved to Warsaw.\nMostowski entered the Stefan Batory\nGymnasium\nin Warsaw in\n1923\n. There he showed that he was an excellent pupil with particular strengths in mathematics and physics. However he developed a serious illness in\n1930\nbut was still able to complete his studies at the Gymnasium in\n1931\n. He entered Warsaw University after graduating from the Stefan Batory Gymnasium and it was at this time that he became especially interested in the foundations of mathematics, particularly mathematical logic and set theory. He was influenced by his lecturers\nKuratowski\n,\nLesniewski\n,\nMazurkiewicz\n,\nŁukasiewicz\nand\nSierpiński\nbut an even stronger influence came from\nLindenbaum\nand\nTarski\n. His Ph.D. was awarded in February\n1939\nfor his thesis\nOn the Independence of Finitenesss Definitions in a System of Logic\n, officially directed by\nKuratowski\nbut in practice directed by\nTarski\nwho was a young lecturer at that time. His research at Warsaw had been broken by studies in Vienna during the summer semester of\n1937\n(\nwhere he attended a course by\nGödel\nwhose ideas strongly influenced his research\n)\nand Zürich\n(\nwhere he attended courses by\nPolya\n,\nWeyl\nand\nBernays\n)\n. In fact he had decided to train as an actuary when in Zürich and, as a first step, he had begun to study statistics. However this subject did not please him so he attended the mathematics courses instead and undertook research on recursion theory and the axiom of choice.\nHe hoped to find a position at the University of Warsaw after the award of his doctorate but these months prior to the start of World War II were difficult and university positions were essentially unobtainable. He took a job at the National Meteorological Institute while hoping that he would soon have the chance of an academic appointment. However the deepening crisis during\n1938\nwith the German invasion of Austria in March, then of the Sudetenland in October, and next Czechoslovakia in March\n1939\n, became even more acute in May\n1939\nwhen Hitler declared himself ready to attack Poland. Mostowski's illness while at high school prevented him serving in the army and he became an accountant after the German invasion of Poland which began on\n1\nSeptember\n1939\n. As well as working as an accountant for a small firm which manufactured roofing from\n1939\nto\n1944\n, he also taught in the 'Underground Warsaw University' from\n1942\nto\n1944\n. Academics took a risk teaching at the underground university and students also took a risk attending lectures. One of the students who took the risk was Maria Matuszewska; she married Mostowski in September\n1944\n.\nSierpiński\ntaught there and he afterwards spoke of his colleagues who had lost their lives, in particular a professor who had greatly influenced Mostowski:-\nIn\n1942\nanother student of mine\nAdolf Lindenbaum\nwas murdered. He was an assistant professor at Warsaw University and a distinguished author of works on set theory.\nMostowski hoped to\nhabilitate\nat the Underground University and was close to achieving this in July\n1944\nwhen events intervened. The Soviet authorities encouraged the Polish underground in Warsaw to stage an uprising against the Germans. They attacked the Germans on\n1\nAugust and within three days had control of the city. The Germans sent in reinforcements while the Soviets not only refused assistance, but even refused permission for Allied planes to use their bases to supply the Poles with food. The Poles held out for\n63\ndays before being defeated. During this time Mostowski married Maria Matuszewska. The Germans then began deporting the what was left of the city's population. Mostowski was captured and was waiting to be sent to a concentration camp when two Polish nurses helped him to escape across the German lines to a hospital\n[\n1\n]\n:-\nMany of Mostowski's wartime results - on the hierarchy of projective sets, on arithmetically definable sets of natural numbers, and on consequences of the axiom of constructibility in descriptive set theory - were lost when his apartment was destroyed during the uprising. He had to choose whether to flee with a thick notebook containing those results or with bread. He chose bread.\nLiving in Poland in the last few months of the war was hard in the extreme. Mostowski had no job so he tried to make a little money by giving private lessons. Of course this only brings in money if there are those around with sufficient to pay for tuition and not many people in war-torn Poland were in that position. He had to sell some of his possessions to buy food. Things improved shortly after the war ended and Mostowski went to Cracow where he worked for a few months at the Silesian Polytechnic, then for a few months at the Jagellonian University. He submitted his habilitation thesis\nAxiom of choice for finite sets\nto the Jagellonian University and it was approved in\n1945\n. In the thesis he examined the independence of various forms of the axiom of choice for finite sets. By the beginning of\n1946\nhe was in Łódź where he was an acting professor from January to September. He then returned to Warsaw University where he was appointed as an acting professor. He was made an extraordinary professor in\n1947\n, then an ordinary professor in\n1951\n.\nAfter spending the academic year\n1948\n-\n49\nat the Institute for Advanced Study at Princeton, where he renewed contacts with\nKurt Gödel\n, he returned to Warsaw to positions of higher standing. He was appointed as head of the division for the foundations of mathematics at the Mathematics Institute of the\nPolish Academy of Sciences\nin\n1948\n. He was appointed dean of the Faculty of Mathematics and Physics at the university in\n1952\n, then from\n1953\nhe was head of the Department of Algebra. He spent further years abroad -\n1958\n-\n59\nat the University of California at Berkeley and\n1969\n-\n70\nat All Souls College, Oxford. In\n1968\nhe ended his position as head of the division for the foundations of mathematics at the Mathematics Institute of the\nPolish Academy of Sciences\nand took up a similar position at the university.\nThe authors of\n[\n5\n]\nset out Mostowski's main scientific achievements which are contained in around\n120\nworks:\nThe\ntheory of models\n, especially models for set theory and for arithmetic; model products and their theories; families of models as topological spaces; models with indiscernible elements and the Ehrenfeucht-Mostowski theorem.\nThe\nFraenkel\n-Mostowski permutation method and its application to proving the independence of the well-ordering principle from the linear-ordering principle in the theory of sets with atoms\n(\nurelements\n)\n.\nThe logical classification of arithmetical concepts and the\nKleene\n-Mostowski hierarchy.\nMostowski's well-known and highly regarded exposition of\nGödel\n's incompleteness result, its strengthenings and simplifications.\nMostowski's investigation into infinitistic methods in mathematics;\nw\nw\nw\n-models and\nb\nb\nb\n-models for arithmetic.\nCohen\n's forcing; topological approach to generic sets.\nOne of his first publications after the end of World War II was the paper\nOn undecidable propositions in formalized systems of mathematics\n(\nPolish\n)\n(1946)\n. Mostowski states in the paper that his aims are to give:-\n... a popular, and at the same time completely rigorous, presentation of\nGödel\n's ideas: his theory reaching the conclusion that in every formal system of mathematics, satisfying certain very general conditions, there exist statements such that neither their truth nor falsity can be established within the system.\nMostowski wrote an important Polish text\nMathematical Logic\nwhich was published in\n1948\n. It gained high praise from a reviewer:-\nThis is an exceptionally good handbook of mathematical logic. It covers a great deal of material and shows many applications of mathematical logic to mathematical problems ... The author is eager to persuade a mathematician that logic can be useful in his work.\nIn\n1952\nMostowski published a monograph\nTheory of sets\nwritten jointly with\nKuratowski\n.\nUlam\nreviewed the text and wrote:-\nThe book is extremely readable, due to a system of development of set-theory which combines the two approaches: the \"naive\" method followed by\nCantor\nhimself, and the formalistic treatment developed on the axiomatic method. The symbolism of mathematical logic is used throughout, but with moderation, and ample motivation is given in the text appealing to the intuition on the infinite sets. This intuition will continue to be necessary as no one system of axioms now known can claim to express the full intuitive freedom of construction available to \"naive\" set-theory. It is this combination of methodologies that makes the book unique as a monograph on set-theory.\nA second edition of the monograph was published in\n1966\n. In many ways this is a new work. Boris Schein  writes:-\nAlthough the main themes of the book remain the same, they are exposed in a far different manner than in the first edition. The second edition contains ten chapters\n(\ninstead of six\n)\n... The book has all the merits of the first edition: it is very readable, modern, and useful for many categories of readers; axiomatic rigor is successfully combined with intuitive freedom, and the clarity and lucidity of style make the reading of the book pleasurable.\nIn\n1953\nthe first of two volumes of a university textbook\nElements of higher algebra\nwritten by Mostowski and\nMarceli Stark\nwas published, with a second volume in the following year:-\nThe book is written clearly, with great stress on didactic principles of the presentation.\nMany of Mostowski's works are aimed at general mathematicians, not experts in his field. For example\nWiderspruchsfreiheit und Unabhängigkeit der Kontinuumhypothese\n(1964)\nis a:-\n... clearly written article is intended for the general mathematical reader. The author opines that the proofs of the consistency and the independence of the continuum hypothesis constitute the most important mathematical discovery of the last\n25\nyears. He gives reasons for his opinion, and discusses the philosophical problems\n(\nPlatonism v constructivism\n)\nof the notion of \"set\".\nPerhaps the expository paper\nThirty years of foundational studies. Lectures on the development of mathematical logic and the study of the foundations of mathematics in\n1930\n-\n1964\nwhich reports on a\n16\nlecture course given by Mostowski in the summer of\n1964\nin Vaasa, Finland, gives the best view of what he saw as the most important developments in his subject during his career.\nCurry\nwrites:-\nThe topics include completeness, incompleteness, decidability, and undecidability theorems; computability, recursive functions, hierarchies, and functionals; intuitionistic logic and its interpretations; constructive mathematics, foundations of set theory, including\nCohen\n's independence proofs; and finally model theory, ending in a special chapter on direct and reduced products. There are references to over\n240\npapers. In most cases the author discusses the principal features of these with great clarity and insight. It is a valuable survey, even for a specialist.\nWe should explain how Mostowski came to die in Vancouver, Canada. Still an extremely active researcher, he had spent the summer of\n1975\nin the United States, at Berkeley and Stanford. He left there to travel to a conference in Ontario, Canada, but stopped in Vancouver to deliver an invited lecture at Simon Fraser University. His death was sudden and unexpected.\nMostowski received many honours: a Polish state prize\n(1952)\n; corresponding member of the\nPolish Academy of Sciences\n(1956)\n; full member:\n(1963)\n; Irzykowski Foundation Prize\n(1972)\n; and member of the\nFinnish Academy of Sciences\n(1973)\n.\nMostowski undertook many editorial duties. He was the editor of the Mathematical, Astronomical and Physical series of the\nBulletin of the Polish Academy of Sciences\n, on the editorial board of several journals including\nFundamenta Mathematicae, Dissertationes Mathematicae\n, the\nJournal of Symbolic Logic\nand\nStudia Logica\n. He was one of the founders and editors of the\nAnnals of Mathematical Logic\n.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}