{
  "nome_completo": "Andreas Speiser",
  "nome_curto": "Andreas Speiser",
  "ano_nascimento": "1885",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Speiser_Andreas/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "Basel, Switzerland",
  "biografia": "Andreas Speiser\n's parents were Paul Speiser\n(1846\n-\n1935)\nand Elizabeth\n(\nLilly\n)\nSarasin\n(1861\n-\n1938)\n, the daughter of Karl Sarasin and Elizabeth Sauvain. Paul had studied law at Basel, Göttingen, Berlin and Bonn before becoming a lecturer in commercial and tax law at the University of Basel. He was also politically active and served on the National Council. Paul Speiser married Salome\n(\nSaly\n)\nSarasin\n(1853\n-\n1882)\nin\n1873\n. They had five children: Paul\n(1875\n-\n1954)\n, Esther\n(1876\n-\n1957)\n, Salome\n(1877\n-\n1956)\n, Anna Helena\n(\nborn\n1879\n, died a baby\n)\nand Felix\n(1880\n-\n1949)\n. After the death of Salome Sarasin in\n1882\n, Paul Speiser married Salome's younger sister Elizabeth\n(\nLilly\n)\nSarasin\n(1861\n-\n1938)\non\n18\nMarch\n1884\n. Their first child was Andreas\n(\nborn\n1885\n, the subject of this biography\n)\nfollowed by seven others Theophil\n(1886\n-\n1940)\n, Clara Elizabeth\n(\ndied a baby\n)\n, Ernst\n(1889\n-\n1962)\n, Marguerite\n(1891\n-\n1982)\n, Paula\n(1892\n-\n1954)\n, Ruth\n(1893\n-\n1976)\n, and Marie\n(1901\n-\n1986)\n.\nSpeiser's school education was in his home city of Basel and he graduated with his baccalaureate certificate from the\nGymnasium\nat Easter\n1904\n. He sought advice from Karl von der Mühll\n(1841\n-\n1912)\nabout the best university at which to study mathematics. Von der Mühll had been born in Basel into a long established Basel family and had studied at the University of Basel, the University of Göttingen and the University of Königsberg before being appointed to the University of Leipzig. In\n1890\nhe had returned to his home town when appointed as Professor of Mathematical Physics in Basel. Von der Mühll advised Speiser to study at the University of Göttingen and, having entered in\n1904\n, he was taught by several leading mathematicians including\nFelix Klein\n,\nDavid Hilbert\nand\nHermann Minkowski\n. While he was studying there he became friends with\nConstantin Carathéodory\nwho had been a student of\nMinkowski\n's and was a\ndocent\nat Göttingen for most of the time Speiser was studying there. Speiser undertook research on quadratic forms advised mainly by\nMinkowski\nbut also helped by\nHilbert\n. He had completed the work for his thesis\nTheorie der binären quadratischen Formen mit Koeffizienten und Unbestimmten in einem beliebigen Zahlkörper\nⓉ\n(\nTheory of binary quadratic forms with coefficients and indeterminates in any number field\n)\nwhen, in January\n1909\n,\nMinkowski\ndied suddenly from a ruptured appendix. Speiser's oral examination, which took place on\n3\nMarch\n1909\n, was conducted by\nDavid Hilbert\n.\nAfter being examined on his thesis, Speiser went to Britain where he spent time in London but also visited Edinburgh in August\n1909\n. Speiser later explained that he had a thought which led to a new direction in his studies while he was in Edinburgh:-\nWhen I walked around Edinburgh in August\n1909\n, I suddenly thought: Maybe it's really true that mathematics is the source of art.\nAfter leaving Britain, Speiser spent time in Paris before going to Strasbourg where he\nhabilitated\nin\n1911\n. He taught at Strasbourg for several years and during this time his work on the composition of quadratic forms led him to study group theory. His paper\nÜber die Komposition der binären quadratischen Formen\nⓉ\n(\nOn the composition of the binary square forms\n)\non the composition of quadratic forms was published in\n1912\n.  He published papers on group theory such as\nZur Theorie der Substitutionsgruppen\nⓉ\n(\nOn the theory of groups of substitutions\n)\n(1914)\nand\nGruppendeterminante und Körperdiskriminante\nⓉ\n(\nGroup determinants and  discriminants of fields\n)\n(1916)\n. Notice that when he submitted the second of these to\nMathematische Annalen\nin July\n1915\nhe was in Karlsruhe. In\n1917\nhe published a paper in French,\nÉquations du cinquième degré\nⓉ\n(\nEquations of the fifth degree\n)\n.\nSpeiser married Emmy La Roche\n(1891\n-\n1980)\n, the daughter of the banker and councillor Ludwig La Roche, in\n1916\n. They had four children: Marie-Thérèse\n(1917\n-\n1982)\n, Thomas\n(1919\n-\n1982)\n, Renata\n(1921\n-\n1961)\nand Andreas\n(1925\n-\n1999)\n.\nIn the summer of\n1917\nSpeiser was appointed as an extraordinary professor at the University of Zürich and, in\n1919\n, he became an ordinary professor at Zürich. In fact two chairs of mathematics at Zürich became vacant almost simultaneously. The other chair had been filled by\nRudolf Fueter\nwho was appointed after holding the chair of mathematics at the Technical University of Karlsruhe for only three years.\nFueter\ntook on the task of rebuilding the study of mathematics at the university and began the process of making it a cultural centre, even during a very difficult period of history. Speiser took over the course\nIntroduction to Analysis\nwhich was the main course taken by mathematicians and physicists. He published three papers in\n1919\n, namely:\nSur les lignes géodésiques des surfaces convexes\nⓉ\n(\nOn geodesic lines of convex surfaces\n)\n;\nDie Zerlegungsgruppe\nⓉ\n(\nThe decomposition group\n)\n; and\nZahlentheoretische Sätze aus der Gruppentheorie\nⓉ\n(\nNumber-theoretic theorems of group theory.\n)\n.\nSeveral appointments strengthened the Mathematics Department at Zürich. Martin Disteli\n(1862\n-\n1923)\nhad studied at Zürich where he was awarded his doctorate in\n1888\n. After positions in Karlsruhe, Strasbourg and Dresden, he was appointed as an Ordinary Professor of Geometry at Zürich in\n1920\n. He only held this chair for three years since he died in\n1923\n.\nEugenio Giuseppe Togliatti\nstudied at the University of Turin taught by\nCorrado Segre\nand\nGino Fano\nand was appointed to the University of Zürich in\n1924\n. He left in\n1927\nwhen he returned to Italy, taking up a position at the University of Genoa.\nPaul Finsler\nwas appointed to the University of Zürich in\n1927\nwhere he was Speiser's colleague for seventeen years.\nCertainly one of Speiser's greatest mathematical achievements was his book on group theory,\nDie Theorie der Gruppen von endlicher Ordnung, mit Anwendungen auf algebraische Zahlen und Gleichungen sowie auf die Kristallographie\nⓉ\n(\nThe theory of groups of finite order, with applications to algebraic numbers and equations, and to crystallography\n)\n, which was published in\n1923\n. The book ran to four editions, the last in\n1956\n. Reviewing the second edition published in\n1927\n,\nPhilip Hall\nwrites\n[\n20\n]\n:-\nThe author has succeeded in the astonishing feat of condensing all the principal propositions of the subject into the space of\n250\npages. The style is extremely elegant and concise, with a minimum of comment and illustration. ... Altogether the author has written a most valuable book which should stimulate interest in this fascinating theory, so rich in contacts not only with other branches of mathematics but also with the latest speculations of natural philosophy.\nPhilip Hall\nalso reviewed the third edition published in\n1937\nand wrote\n[\n21\n]\n:-\nThe present edition preserves to the full the high stylistic qualities of the earlier versions. There are many mathematical books of which one may confidently feel that every word has been weighed. But there can be few in which they have been weighed with such skill as here.\nFor extracts from reviews of all four editions, see\nTHIS LINK\n.\nIn fact Speiser's work on group theory had already led him to think more generally about symmetry and, in particular, to think about how mathematics related to many cultural activities throughout history. Donald W Crowe writes\n[\n11\n]\n:-\nHow did these two disciplines, the cultural-historical and the mathematical, happen to meet and interact in this particular specialty: the study of patterned ornament? Many of us have answered that the interaction was especially fostered by Andreas Speiser's early group theory textbook, 'Theorie der Gruppen von endlicher Ordnung'. For, in all editions beginning with the second in\n1927\n, Speiser included a large section dealing with the symmetries of ornament, in which he introduced us to the plane crystallographic groups using the notation of his colleague, Niggli. This, combined with the thesis of his student Edith Müller on symmetries of ornaments in the Alhambra, as well as Speiser's other cultural writings, persuaded many of us that designers of ornament from ancient times had at least a subconscious understanding of basic ideas of group theory. Speiser was, in the eyes of many, the first to make this connection.\nEdith Müller's thesis, mentioned in the above quote, was\nGruppentheorische und Strukturanalytische Untersuchungen der Maurischen Ornamente aus der Alhambra in Granada\nⓉ\n(\nGroup theoric and structural analysis of the Moorish decoration from the Alhambra in Granada\n)\n(1944)\n.\nSpeiser worked on several different mathematical topics. To illustrate this we give the titles of the papers he published between\n1921\nand\n1930\n:\nÜber die geodätischen Linien auf einem konvexen Körper\nⓉ\n(\nOn the geodetic lines on a convex body\n)\n(1921)\n;\nDie Zerlegung von Primzahlen in algebraischen Zahlkörpern\nⓉ\n(\nThe decomposition of primes in algebraic number fields\n)\n(1922)\n;\nSur la décomposition des nombres premiers dans les corps algébriques\nⓉ\n(\nOn the decomposition of primes in an algebraic number field\n)\n(1922)\n;\nAllgemeine Zahlentheorie\nⓉ\n(\nGeneral number theory\n)\n(1926)\n;\nNaturphilosophische Untersuchungen von Euler und Riemann\nⓉ\n(\nNatural philosophical investigations by Euler and Riemann\n)\n(1926)\n;\nSur les groupes et groupoides\nⓉ\n(\nOn groups and groupoids\n)\n(1928)\n;\nDie Eulerausgabe\nⓉ\n(\nThe works of Euler\n)\n(1929)\n;\nProbleme aus dem Gebiet der ganzen transzendenten Funktionen\nⓉ\n(\nProblems from the field of all transcendental functions\n)\n(1929)\n;\nEin Satz über topologische Bäume\nⓉ\n(\nA theorem on topological trees\n)\n(1930)\n;\nÜber Riemannsche Flächen\nⓉ\n(\nOn Riemann surfaces\n)\n(1930)\n;\nProbleme der Gruppentheorie\nⓉ\n(\nProblems in group theory\n)\n(1930)\n.\nIn addition to these papers, he published the book\nKlassische Stücke der Mathematik\nⓉ\n(\nClassical pieces of mathematics\n)\n(1925)\n, which contained translations into German of the writings of\nPlato\n,\nAristotle\n,\nEuclid\n,\nArchimedes\n,\nLeonardo da Vinci\n,\nKepler\n,\nDescartes\n,\nPascal\n,\nJohann Bernoulli\n,\nEuler\n,\nDaniel Bernoulli\n,\nSylvester\n, and\nEinstein\n. For extracts from two reviews of this book see\nTHIS LINK\n.\nFrom the above list of papers we see that he wrote about\nEuler\nand the work of the\nEuler\nCommission which had been set up to publish\nEuler\n's collected works. The first editor of the \"Collected Works of Leonhard Euler\" was\nFerdinand Rudio\nwho taught at the Eidgenössische Polytechnikum Zürich. He was forced to give up the editorship in\n1928\ndue to ill health and at that time Speiser took over the editorship. In fact\n35\nvolumes of the \"Collected Works of Leonhard Euler\" were published under Speiser's editorship. In\n1965\nhe ended this role which was taken over by Walter Habicht\n(1915\n-\n1998)\n. Habicht, who had studied for his doctorate at the Eidgenössische Polytechnikum Zürich, became a colleague of Speiser's in Basel in\n1963\n. In\n1937\nSpeiser wrote a report aimed at American mathematicians on the work of the\nEuler\nCommission\n[\n30\n]\n:-\nThe \"Collected Works of Leonhard Euler\" will embrace approximately seventy volumes. From\n1911\nto\n1937\ntwenty-six of these volumes have appeared, of which twenty volumes belong to Series I which contains the mathematical works. Series II contains the works on mechanics, technology and astronomy, while Series III is devoted to the works on physics and philosophy. In\n1911\nat the beginning of the undertaking the work could be regarded as well founded financially, thanks to the many subscribers and the large sum of money which was collected by the\nEuler\nCommission. Almost half of the subscribers were lost through the World War, furthermore the costs of printing rose to such an extent that we were compelled essentially to slow up the tempo of the edition.\nJohann Jakob Burckhardt, who was a student of Speiser's at Zürich writing the dissertation\nDie Algebren der Diedergruppen\nⓉ\n(\nThe algebra of the dihedral group\n)\n, writes\n[\n11\n]\n:-\nSpeiser was of unusual erudition; his ambition was to pursue thoughts through the course of history and demonstrate their impact.\nWe have already mentioned some of his books that have followed this path. Here are some others.\nDie mathematische Denkweise\nⓉ\n(\nMathematical thinking\n)\n(1932)\nwas reviewed by Edward Switzer Allen\n[\n3\n]\n:-\nThis book is not a treatise on how mathematicians think. It is a collection of essays on mathematical thought as it is revealed in art and music, in philosophy and astrology. It is the work of a man of broad culture - one whose contributions to group theory are well enough known, but who is also at home in yet more esthetic realms and is conversant with the history of serious human thought. ...\n[\nThe reviewer is\n]\nurging that the book itself be read. It is not a necessity for one's library; it is a delight.\nMax Dehn\n, reviewing the second edition of\n1945\n, writes\n[\n14\n]\n:-\nIn this book we have the philosophy of a mathematician. It is written with the enthusiasm of a distinguished mathematician who penetrates the arts and the world in his peculiar way. It will transmit, I imagine, this enthusiasm to every mathematician who is not only a craftsman but possessed by sacred fire as the poet and philosopher ought to be.\nThe book\nElemente der Philosophie und der Mathematik\nⓉ\n(\nElements of philosophy and mathematics\n)\n(1952)\nis dedicated to the memory of\nRudolf Fueter\n:-\n... my best friend, with whom I was able to work during\n55\nsemesters in Zürich and to whom I owe unlimited gratitude.\nIt was reviewed by\nReuben Louis Goodstein\nwho writes\n[\n18\n]\n:-\nIn the introduction Professor Speiser describes his book as finger exercises for beginners in philosophical and mathematical thought. Fundamental concepts in philosophy and mathematics are subjected to the Hegelian dialectic to bring out their inner content.\nFor a longer extract from this review and extracts from two other reviews, see\nTHIS LINK\n.\nSpeiser wrote articles on diverse topics, several of which he reprinted in the book\nDie geistige Arbeit\nⓉ\n(\nThe spiritual work\n)\n(1955)\nwhich contains lectures and essays from various topics in art, science, philosophy and theology. His lectures also covered a wide range of topics as did the doctoral dissertations of his many students at Zürich. He was always concerned that his students would be well prepared and he took every opportunity to spend time talking to them. To understand something of his attitude to teaching, see\nTHIS LINK\n.\nJohann Jakob Burckhardt writes\n[\n11\n]\n:-\nSpeiser loved life in Zürich, especially the Old Town, where he lived for a long time and through which he liked to walk, often accompanied by his students. ... A highlight of his mathematical life in Zürich was the International Congress of Mathematicians in\n1932\n; Speiser was a Vice President. He was anxious to establish personal contacts between participants. Many will remember his hospitable home at Pelican Place, as well as at its headquarters in Melide, where they found a friendly reception from the Speisers.\nAlthough Switzerland remained neutral throughout World War II, nevertheless the country was on a war footing and it was a difficult time for all. During these war years mathematics teaching at the University of Zürich was almost entirely carried out by Speiser and\nFinsler\n. Speiser regularly delivered two four-hour lectures and ran the undergraduate seminar as well as the mathematics research seminar and the mathematical-philosophical seminar. Therefore, despite his love of Zürich, it is understandable that when he was asked to return to the University of Basel in\n1944\nhe happily accepted. Back in his home town of Basel he found the tranquillity which enabled him to concentrate on the more and more stressful work associated with editing\nEuler\n's Collected Works. For example in\n1947\nhe published\nEinteilung der sämtlichen Werke Leonhard Eulers\nⓉ\n(\nClassification of all works by Leonhard Euler\n)\nwhich lists\nEuler\n's works giving their original places of publication and their location in the edition of\nEuler\n's Collected Works. In addition to editorial work on the volumes, he wrote many Introductions and Forewords to the volumes which were published over the twenty years\n1944\n-\n64\n. In\n1945\nhe was appointed permanent guest of honour by the University of Zürich. Speiser retired from his chair in Basel in\n1955\n. In\n1957\nhe was awarded an honorary doctorate by the University of Berne.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}