{
  "nome_completo": "András P Huhn",
  "nome_curto": "András Huhn",
  "ano_nascimento": "1947",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Huhn/",
  "lugar_nascimento": "Szeged, Hungary",
  "lugar_morte": "Szeged, Hungary",
  "biografia": "András Huhn\n's father was Peter Huhn who was a professor at the University of Szeged. András was brought up in Szeged where he attended school and entered the József Attila University of Szeged in\n1966\n. He introduced the notion of an\nn\nn\nn\n-distributive lattice and a weakly distributive lattice in\n1970\nhaving begun to work on these ideas in the preceding year. He published a number of papers on this topic but his most important result of his early years came in\n1975\nwhen he published\nOn G Grätzer's problem concerning automorphisms of a finitely presented lattice\nin\nAlgebra Universalis\nⓉ\n(\nUniversal algebra\n)\n. Let us say briefly what Grätzer's problem is.\nA lattice is called finitely presented if it is freely generated by a finite partial lattice. Grätzer's problem asked whether a finitely presented lattice has a finite automorphism group or not. Huhn solved the problem by showing that there exists a finitely presented modular lattice with an infinite automorphism group.\nHuhn worked at the Department of Algebra at the József Attila University of Szeged from\n1971\n, following the completion of his studies. He was awarded the degree of Candidate of Mathematical Science by the Hungarian Academy of Sciences in\n1975\nand in\n1978\nhe was promoted to associate professor at Szeged. In\n1975\nhe publiahed\nZum Wortproblem für freie Untermodulverbände\nⓉ\n(\nOn word problems for free submodules\n)\nwhich was joint work with Christian Herrmann. In this paper the authors show that all free lattices have recursively solvable word problems with respect to a number of varieties contained in the variety of all modular lattices.\nAn important development in Huhn's career was when he spent the academic year\n1978\n-\n79\non research leave at the University of Manitoba, working with George Grätzer. In\n[\n2\n]\nGrätzer writes:-\nDuring that period, we did the research for the papers\n[\nWhen is a Q-amalgamated free product of lattices always a free product\n(1980)\n, A note on finitely presented lattices\n(1980)\n, A note on finitely presented lattices\n(1981)\n, On the structure of finitely presented lattices\n(1981)\n, Amalgamated free products of lattices I : The common refinement property\n(1982)\n, Amalgamated free products of lattices II : Generating sets\n(1981)\n, and Amalgamated free products of lattices III : Free generating sets\n(1984)]\n. Of the thirty five or so mathematicians I have collaborated with, András certainly stands out as one of the most pleasant, most co-operative, and most talented. I believe that these papers made a significant contribution to the theory of finitely presented lattices and to the theory of amalgamated free products of lattices. the basic problems we have been working on have not yet been completely solved.\nTamás Schmidt writes in\n[\n3\n]\n:-\nIn the last years of his life\n[\nHuhn\n]\nstudied the characterisation problem of congruence lattices of lattices. First he found a new proof for my theorem that the ideal lattice of a distributive lattice is the congruence lattice of a lattice. for this proof he gave a very interesting representation theorem for finite distributive lattices.\nHuhn was on the editorial board of\nAlgebra Universalis\nand of\nActa Scientiarum Mathematicum Szeged\n. He also edited two proceeding of lattice theory conferences in Szeged of which he was an organiser. The first was the Colloquium Lattice theory held in Szeged from\n27\nAugust to\n30\nAugust\n1974\n. The second of the two editors of these proceedings was Tamás Schmidt.\nWhen at the height of his creative powers at the age of\n38\n, Huhn was killed in a tragic accident\n[\n2\n]\n:-\nHe is survived by his wife, Gabi, and his two children, Gábor, aged\n5\n, and Zsófia, aged\n4\n.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}