{
  "nome_completo": "André Sainte-Laguë",
  "nome_curto": "André Sainte-Laguë",
  "ano_nascimento": "1882",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sainte-Lague/",
  "lugar_nascimento": "Saint Martin de Curton, Lot-et-Garonne, Aquitaine, France",
  "lugar_morte": "Paris, France",
  "biografia": "André Sainte-Laguë\nwas born in the village of Saint Martin de Curton in southwest France, between Bordeaux and Toulouse. He was the son of Jean Abel Sainte-Laguë\n(1857\n-\n1924)\nand Claire Desgans\n(1860\n-\n)\n. Abel Sainte-Laguë, the son of a farmer, was a school teacher in Casteljaloux who married Claire Desgans, the daughter of a sailor, in Gujan-Mestras, Gironde, Aquitaine on\n11\nDecember\n1880\n. They had two sons, André Sainte-Laguë, the subject of this biography born in\n1882\nand Pierre René Sainte-Laguë, born on\n16\nNovember\n1883\nin Gujan-Mestras, Gironde, Aquitaine. Pierre René Sainte-Laguë died in Morocco in\n1914\n; we say a little more about this below.\nAndré's family moved to Haiti where he spent his early years. He was sent back to France to become a boarder at a boys' high school in Agen, Lot-et-Garonne. He was awarded his baccalaureate in\n1899\nand then spent two years from\n1900\nto\n1902\nin the special mathematics class at Lycée Montaigne in Bordeaux, Gironde, preparing to take the entry examinations for the Grandes Écoles. He took the examinations in\n1902\nand was offered a place in both the École Polytechnique and the École Normale Supérieure on Rue d'Ulm. He chose the École Normale Supérieure but did a year of military service before beginning his studies in\n1903\n. He passed the Aggregation of mathematics in\n1906\nbeing ranked sixth.\nAfter graduating from the École Normale Supérieure, Sainte-Laguë began his teaching career. He was employed first as a provisional substitute for the professor of mathematics at the high school of Évreux, the capital of the department of Eure, Normandy. He spent the year\n1906\n-\n07\nin this post, and while he was employed there he married Adélaïde Menu on\n24\nJanuary\n1907\nin Paris. Adélaïde Geneviève Georgette Menu\n(6\nFebruary\n1878\n-\n18\nMay\n1960)\nhad been born in Paris, the daughter of a military doctor. André and Adélaïde Sainte-Laguë had three children: Madeleine Christiane Sainte-Laguë\n(1910\n-\n1998)\n; Jean Bertrand Sainte-Laguë\n(1911\n-\n1993)\n; and Fernande Arlette Sainte-Laguë\n(1918\n-\n2004)\n. Madeleine was awarded a degree in engineering from the École Centrale Paris, became an aeronautical civil engineer and married the engineer Henri Eugène Adolphe Mazuel\n(1906\n-\n1950)\n; Jean Bertrand was also awarded a degree in engineering from the École Centrale Paris and became an engineer; and Fernande married the engineer Paul Jean Joseph Burty\n(1910\n-\n2002)\n.\nIn\n1908\nSainte-Laguë was appointed as professor of special mathematics at the high school of Douai, Nord. It was during his time at this school that he published the paper for which he is probably best known today, namely\nLa représentation proportionelle et la méthode des moindres carrés\nⓉ\n(\nProportional representation and the least squares method\n)\n[\n44\n]\n:-\nIn\n1882\nProfessor Victor d'Hondt, of the University of Ghent in Belgium, proposed the system of party proportionality that bears his name, which is widely used in Europe today. ... D'Hondt proposed that one should allocate the seats to the parties one at a time. At each stage, a party\nP\ni\nP_{i}\nP\ni\n​\nwith\nv\ni\nv_{i}\nv\ni\n​\nvotes and\n(\ncurrently\n)\ns\ni\ns_{i}\ns\ni\n​\nseats is assigned the quotient\nv\ni\ns\ni\n+\n1\n\\Large\\frac{v_i}{s_i+1}\ns\ni\n​\n+\n1\nv\ni\n​\n​\n, and the next seat is given to the party with the largest quotient. ... The Frenchman A Sainte-Laguë devised his arithmetic-mean system\n(\nbut in the form\n1\n,\n3\n,\n5\n,\n7\n...\n)\nin\n1910\n, in order to correct the tendency of d'Hondt's rule to favour the large parties.\nMichael Gallagher writes in\n[\n9\n]\nthat the Sainte-Laguë method:-\n... at the theoretical level is probably the soundest of all the measures.\nToday the Sainte-Laguë method is used in many countries, for example Germany, New Zealand and Sweden.\nSainte-Laguë taught at Douai until\n1912\nwhen he moved to the Lycée de Besançon in Doubs. In July\n1914\nhe was appointed to the Lycée - Cité Scolaire Pasteur in Neuilly-sur-Seine, Paris. He had only just taken up this position, however, when war broke out in Europe and on\n2\nAugust\n1914\nSainte-Laguë was called up for military service. Germany declared war on France on the following day and Sainte-Laguë began training as a sergeant. In January\n1915\nhe was sent to the front as a second lieutenant and soon was promoted to lieutenant. Twice wounded, he was able to continue fighting until\n24\nJune\n1916\nwhen he was wounded for the third time. His thigh bone was shattered by shrapnel\n[\n7\n]\n:-\n... while going to ensure the restoration of a telephone line himself, under a violent bombardment.\nHe had five operations on his wounded thigh, and was declared 'unfit for active service'. In\n1916\n, for his courageous action, he was awarded the Croix de Guerre avec Palmes, and made Chevalier de la Légion d'Honneur Militaires. His time in military hospitals was not wasted for there he had the opportunity to continue his research on graph theory that he had begun while a student at the École Normale Supérieure. When he was recovered sufficiently to leave hospital, he still had to undertake war service. Not fit for active duty, in\n1917\nhe was sent to study long range shells at the Inventions Department of the École Normale Supérieure. He had an interest in aviation since his brother Pierre Sainte-Laguë had trained at the Blériot military aviation centre in Pau and later died in an accident on\n4\nMay\n1914\nin Lalla Itto in Morocco when returning from a reconnaissance mission.\nAfter completing his war work, Sainte-Laguë was able to resume his appointment at the Lycée Pasteur which had been made just before the outbreak of war. He was given leave of absence from\n25\nApril to\n30\nSeptember\n1919\nbefore starting teaching there. He also taught at the Lycée\nCarnot\nwhich was restarting its normal school activities after part had been turned into a Franco-Belgian hospital during the war. Many teachers had lost their lives during World War I so those who had survived were in great demand. At the start of the\n1920\nschool year, Sainte-Laguë took up an appointment at the prestigious Lycée Janson de Sailly where\nÉlie Cartan\nhad been a pupil thirty years earlier. At the same time he began teaching at the connected Centrale assisting Salomon Bloch\n(1858\n-\n1926)\nwho was teaching large numbers of students preparing for the Grandes écoles entrance examination. Bloch was a highly successful teacher who published several books including the two volume work\nCours de géométrie descriptive à l'usage des candidats à l'École polytechnique, à l'École normale supérieure, aux-écoles centrale, des arts et manufactures, des ponts et chaussées et des mines de Paris et de Saint-Étienne\nⓉ\n(\nCourse in descriptive geometry for the use of candidates at the École Polytechnique, the École Normale Supérieure, the Central Schools, Arts and Manufactures, Bridges and Roads and Mines of Paris and Saint-Étienne\n)\n(1921)\n. Bloch was allowed to retire on\n1\nApril\n1922\n\"at his request and for seniority of age and services\" and Sainte-Laguë took over his teaching in addition to his own. Sainte-Laguë was also an admissions examiner for the École Supérieure d'Aéronautique from\n1922\nto\n1929\n.\nIn parallel with these teaching commitments, Sainte-Laguë was working on undertaking research for a doctoral thesis. He submitted two theses,\nLes réseaux\nⓉ\n(\nNetworks\n)\nand\nSurfaces minima\nⓉ\n(\nMinimum surfaces\n)\nto the Faculty of Science in Paris on\n6\nJune\n1924\n. His main thesis\nLes réseaux\nⓉ\n(\nNetworks\n)\nis a remarkable piece of work on what today we would call graph theory. He begins by giving the definition of a graph\n(\nwhich he calls a network\n)\nwhich would not look out of place in a\n21\nst century graph theory text\n[\n25\n]\n:-\nWe will call a network a set of points or crossroads which will consist of vertices, joined together by lines or sides which will be the paths of the network. The shape of these paths is of no interest and the only thing that matters for two given points A and B is whether or not they are joined by one or more paths. Two networks will be said to be homeomorphic if one can establish between their vertices on the one hand, as well as between their paths on the other hand, a reciprocal and unambiguous correspondence. Two homeomorphic networks will be considered identical. It follows that the shape of the diagrams, planes or curves, by which it may be convenient to represent networks, has no theoretical importance. The location of the vertices can be arbitrary as well as the shape of the paths joining two given points. Care must be taken not to confuse the graphic crossing of two paths drawn on paper with a crossroads.\nHe ends this thesis with the following conclusion:-\nThe study of networks can be pursued in many different ways and each of the definitions posed at the beginning makes it possible to initiate new research. We simply wanted to study, as best we could, two of the simplest cases one could think of. Simple as they are, they show, we believe, the complexity of the questions raised and the diversity of the methods which it is essential to employ. The subject, limited as it may seem at first glance, is in fact .. very vast and seems quite difficult. We have systematically left aside, so as not to lengthen the thesis, not only all the research that we have already started on spherical networks, but also all the practical applications of networks. Many questions of higher arithmetic, positional geometry, game theory, for example the research of Lucas, is immediately related to network theory. Other applications of more immediate use could also be considered, such as certain questions of graphic statics or especially of stereochemistry. We couldn't think of addressing them here.\nThe examining committee for the thesis consisted of\nÉmile Picard\n, as president, and\nÉmile Borel\nand\nPaul Montel\nas examiners.\nThe significance of this thesis is clearly explained in the Foreword to\n[\n10\n]\nwritten by Michel Habib. The Foreword begins:-\nThe appearance in\n1926\nof 'Les Réseaux\n(\nou Graphes\n)\n' was an important milestone in the historical development of graphs and their applications, from its first introduction by\nEuler\n(1735)\nwith his famous problem on the bridges of Königsberg, to some early applications in chemical theory with the graphs of organic molecules. Most of the research in graph theory in the beginning of the last century still came from mathematical games and puzzles, but in his introduction, Sainte-Laguë seemed to be convinced of the great potential of applications of graph theory. Sainte-Laguë's book was the first textbook devoted to the study of graphs, containing most of what was known at his time, as for example, the four colour problem. In many aspects his book is very modern, by its subject, its presentation, and with many examples. It is interesting that many important notions had already been defined: trees, centres, chains, cycles, Eulerian cycles, Hamiltonian cycles, etc., although some of the notations are not the ones we use today.\nFor more information about\nLes Réseaux\n(\nou Graphes\n)\n, see\nTHIS LINK\n.\nIn\n1927\nSainte-Laguë was appointed as a lecturer in mathematics at the National Conservatory of Arts and Crafts. The professor of mathematics was Raoul Bricard\n(1870\n-\n1943)\nwho had published on\nHilbert\n's Third Problem in\n1896\n(\nbefore\nHilbert\nincluded it in his list in\n1900)\nand had investigated flexible polyhedra. He had been awarded the\nPoncelet\nPrize in mathematics from the\nParis Academy of Sciences\nin\n1932\nfor his work in geometry. When Bricard retired in\n1938\n, Sainte-Laguë was appointed to the chair of mathematics, a position he retained until his death in\n1950\n. He was very successful as a lecturer as Jérôme Chastenet de Géry relates in\n[\n5\n]\n:-\nHis classes enjoyed considerable success, unequalled up to that time, and one of his lectures had around\n2500\nlisteners, requiring him to give it three times in the large\n900\n-seat\nPaul Painlevé\namphitheatre at the Conservatoire National des Arts et Métiers. His warm, loud voice filled the lecture theatre, and his lectures were lively, fast, and clear. When teaching mathematics to practitioners, he insisted on the necessity of theoretical, numerical, and graphical exercises, and also on the need to distinguish between rigorous reasoning and that which is not rigorous, as well as the importance of using correct language. \"We must not respond to the students' desire to know only recipes,\" he said. A forerunner in what may now be called 'new educational technologies', from\n1928\nonwards, he also used films for his geometry lessons.\nSainte-Laguë was not only an outstanding teacher, but he also played major roles in organisations. The Société des agrégés was founded in\n1914\nwith the aim of ensuring fair and demanding education for all regardless of their status in society. Sainte-Laguë was elected president serving from\n1917\nto\n1919\n. He was one of the founders of the Association Amicale des Anciens Combattants de l'enseignement supérieur et de l'enseignement secondaire publics, and is listed as one of two Vice-Presidents for\n1924\n-\n25\n. This Associations aimed to:-\n... participate in the preparation of school youth, and to study and to bring about all the reforms concerning education.\nHe was also a founding member of the Confédération des Travailleurs Intellectuels in March\n1920\nand remained a staunch supporter all his life. He was its president from\n1929\nuntil his death. In January\n1932\nthe Confederation proposed a programme with three main aims: improved wages, availability of work, and reduction in working hours. France, like so much of the world, was suffering during the Great Depression at this time and the Confederation stated\n[\n6\n]\n:-\nWe are not afraid to call the current crisis a crisis of our economic regime and consider participating in a study of ways to adapt the general economy to new conditions. We feel that the world is in the process of being renovated and that we can no longer, as immediately after the war, wait for others to think for us, intellectual workers. The new regime must be with our support, otherwise it will be against us.\nSainte-Laguë was interviewed in his role as president of the Confederation in June\n1932\n. He said\n(\nsee for example\n[\n6\n]\nor\n[\n7\n]\n)\n:-\nCapitalism, considered here simply as an economic phenomenon and a financial system, seems to have had its day. It has fulfilled its role and it has done great things just as feudalism once did, but in more recent times it has not been able to foresee anything, or to organise anything.\nThe Exposition Internationale des Arts et Techniques dans la Vie Moderne was held from\n25\nMay to\n25\nNovember\n1937\nin Paris. Le Palais de la Découverte was to have mathematics rooms and these were under the direction of\nÉmile Borel\nand\nPaul Montel\n. They asked Sainte-Laguë to organise the mathematics displays and, beginning the work in\n1933\n, he wrote the book\nAvec des Nombres et des Lignes: Récréations Mathématiques\nⓉ\n(\nWith Numbers and Lines: Mathematical Recreation\n)\n(\nsee\n[\n32\n]\n)\n. Martin Charles Golumbic writes in\n[\n10\n]\n:-\nIn the\n1937\nbrochure of the Section des Mathématiques, André Sainte-Laguë is listed as the secretary and organiser of the exhibition. The other committee members were\nÉmile Borel\n(\npresident\n)\n,\nPaul Montel\n(\nvice-president\n)\n, Raoul Bricard and\nGeorges Darmois\n. In Salle\n31\n(\nRoom\n31)\n, we have the following: \"Three albums of curves by A Sainte-Laguë, present\n50\ncurves each to the visitors: algebraic, transcendental, and various others.\"\nThe official volume on the Palais de la Découverte from the\n1937\nParis Exposition reports:\nFor those visitors who are fascinated by the research carried out by engineers, and who rave at the wonders of modern industry, the organisers presented some of the properties of the strength of materials in the simple and easily assimilated form of a film. The film, 'De la similitude des longueurs et des vitesses'\nⓉ\n(\nOn the similarity of lengths and speeds\n)\nwas written by André Sainte-Laguë.\nOn\n1\nSeptember\n1939\nGermany invaded Poland and, two days later, France declared war on Germany. On\n10\nMay\n1940\nGermany invaded Holland and two days later the Panzer Corps had crossed into France and had reached the Meuse. Sainte-Laguë immediately urged resistance against German occupation. At the general assembly of the Confédération des Travailleurs Intellectuels in the spring of\n1940\nhe supported the setting up of a Solidarity Centre for intellectual workers. He said\n[\n7\n]\n:-\nEven more in times of war than in times of peace, 'trade unionism' must be synonymous with 'solidarity'.\nHe was one of the founders of the Organisation Civile et Militaire. Jérôme Chastenet de Géry writes in\n[\n5\n]\n:-\nHe participated in the underground resistance in September\n1940\nand, known to be of a liberal mind, he was arrested by the Germans at his home in early October\n1941\nand imprisoned. But he knew how to remain discreet, and after many interrogations, the Germans, not finding evidence of his participation in clandestine activities, released him. When he resumed his class, he simply said to his pupils, \"Gentlemen, I have been able to reflect for a long time, where I was, on the properties of unicursal curves ... .\"\nIt was not until the Liberation that they learned that he had been a leader of the Organisation Civile et Militaire. He was decorated with the medal of the Resistance, and was appointed a member of the Provisional Consultative Assembly.\nAnother of his wartime activities is related by\nLaurent Schwartz\nin\n[\n40\n]\n:-\nA cousin of my mother's, Guy Iliovici, a professor of mathematics in the Lycée Saint-Louis, also remained in Paris and wore a yellow star. Because he was Jewish, he lost his job, but his colleague and close friend Sainte-Laguë gave him half of his salary. He was deported with his wife Suzanne and his daughter Janine; they never returned.\nWe have mentioned some of Sainte-Laguë's publications above but these are only a very few from the large number covering a wide range of topics. We list a few in references:\n[\n13\n]\n,\n[\n14\n]\n,\n[\n17\n]\n-\n[\n19\n]\n,\n[\n22\n]\n-\n[\n38\n]\n.\nJohn McMasters comments in\n[\n20\n]\nabout the claim that an engineer \"proved that bumblebees should not be able to fly.\" It appears that Sainte-Laguë was involved in this \"proof.\" August Magnan writes in\n[\n16\n]\n:-\nAt first prompted by what is done in aviation, I applied the laws of air resistance to insects, and I arrived with A Sainte-Laguë at this conclusion that their flight is impossible.\nThe Bumblebees Conservation Trust explains the apparent paradox as follows:-\nThis myth stems from a well-known story of some engineers who proved that bumblebees shouldn't be able to fly because their wings are too small for the size of their bodies. In reality, bumblebees fly in quite a complicated way with their four wings, they don't just flap them up and down which probably would make it impossible for them to fly. In fact, they flap their wings front to back and simultaneously rotate them, like a figure-\n8\n, to create enough lift!\nSainte-Laguë died suddenly at the age of\n67\n. He had continued his heavy teaching load up to the time before his death. He had been a member of the committee of the Société des Amis de l'Institut Métapsychique since\n1934\n, was its vice-president in\n1949\nand, just before his death, had accepted becoming president in\n1950\n. His granddaughter Dominique Sainte-Laguë\n(\nborn\n18\nAugust\n1946)\ngave many documents concerning her grandfather to the Conservatoire National des Arts et Métiers in\n2016\nwhich allowed historians to better understand Sainte-Laguë as a pioneer of new educational technologies and of graph theory\n[\n41\n]\n:-\nDominique Sainte-Laguë, granddaughter of André Sainte-Laguë\n(1882\n-\n1950)\n, professor of 'General Mathematics with a View to Applications' at the National Conservatory of Arts and Crafts from\n1938\nto\n1950\n, has just donated to the central library of the Conservatoire National des Arts et Métiers\n(\nCNAM\n)\na set documents related to her grandfather's activities. This gift, made up of printed matter, books and off-prints and manuscripts, as well as a set of photographs and glass plates that served as conference materials, provides a better understanding of the popularising and teaching activity of this pioneer of new educational technologies and graph theory.\n...\nThis fund now enriches the collections of the CNAM, which did not keep all the publications of André Sainte-Laguë, and allows us to better understand his activity as a lecturer and writer, through numerous off-prints, as well as a set of articles published in the press and the manuscripts of his works such as that of 'La Machine humaine'\nⓉ\n(\nThe Human Machine\n)\n, published by Fayard under the title 'De l'homme au robot'\nⓉ\n(\nFrom man to robot\n)\nin\n1953\n. The knowledge of the mathematician and the teacher, as well as that of his methods will no doubt benefit from the study of his manuscript notebooks.",
  "math_areas": [
    "Combinatorics",
    "Geometry"
  ]
}