{
  "nome_completo": "Andrea Tacquet",
  "nome_curto": "Andrea Tacquet",
  "ano_nascimento": "1612",
  "ano_morte": "1660",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tacquet/",
  "lugar_nascimento": "Antwerp, Dutch Republic (now Belgium)",
  "lugar_morte": "Antwerp, Dutch Republic (now Belgium)",
  "biografia": "Andrea Tacquet\n's parents were Agnes Wandelen, who came from Nuremberg, and Pierre Tacquet from Antwerp.  Pierre Tacquet was a merchant who was quite well off so, although he died when Andrea was only a child, nevertheless left sufficient money for his family to live and for Andrea to have a good start in life. Andrea Tacquet was born pretty much in the middle of the Eighty Years' War which was a war of Netherlands independence from Spain. Despite the fighting, Antwerp at this time was one of the cultural capitals of Europe. Also the Antwerp Jesuits were making valuable contributions in the area of scholarship.\nAndrea was educated at the Jesuit College in Antwerp, where he was described as a 'gifted but somewhat delicate child'. He entered the Jesuit Order in\n1629\n, spending the years\n1629\n-\n1631\nat Malines\n(\nalso known as Mechelen\n)\nwhich is on the Dijle River, a few miles north-northeast of Brussels.  He then studied mathematics, logic and physics at Louvain from\n1631\nuntil\n1635\n. During the last two of these four years he was a student of\nGregory of Saint-Vincent\n. After this Tacquet, showing his versatility, spent a while teaching Greek and poetry at Bruges.\nFrom\n1640\nTacquet studied theology at Louvain while at the same time he taught mathematics there. From\n1644\nhe taught mathematics at the college in Louvain, then at the college in Antwerp from\n1645\nuntil\n1649\n, and again at the same college from\n1655\nuntil\n1660\n. He spent the intervening years from\n1649\nto\n1655\nback at the college in Louvain. In this period, during which he taught mathematics, he was ordained in\n1646\n. Throughout his life Tacquet was totally dedicated to his church and to the Jesuit Order.\nTacquet's most important work is\nCylindricorum et Annularium\nⓉ\n(\nCylinder and rings\n)\n(1651)\n, on cylinders and rings, which followed the approach of\nValerio\nbut is largely based on the mathematics of\nArchimedes\n[\n1\n]\n:-\nIts main importance, however, lay in its concern with questions of method. Tacquet rejected all notions that solids are composed of planes, planes of lines, and so on, except as heuristic devices for finding solutions.\nIn this work the ideas that the tangent and the area under a curve were inverse to each other appeared. It arises from the way that Tacquet thought of curves generated by moving points, but not actually comprising of points. Of course this idea is a early form of what would become clear when the calculus was invented, namely that the derivative and integral were inverse to each other. This book had a considerable effect on\nPascal\nand was important in setting the scene for the invention of the calculus.\nTacquet wrote many good elementary texts designed as mathematics textbooks for Jesuit colleges. His\nElementa geometriae\nⓉ\n(\nThe Elements of geometry\n)\n(1654)\nwas his most popular teaching work. This book was essentially constructed from\nEuclid\n's\nElements\nwith material from\nArchimedes\n, but that said it was a significant piece of work because of the clarity Tacquet demonstrated in presenting the material. Many editions of\nElementa geometriae\nwere produced over the next\n100\nyears. For example\n'The elements of Euclid; with select theorems out of Archimedes by ... Andrew Tacquet. ... The whole abridged and published in English by William Whiston'\nappeared in a third edition published in London in\n1727\n. Palladino writes in\n[\n5\n]\nabout Tacquet's\nClasses of measures:-\nThe classical definitions of ratio and proportion, defined respectively by the third and the fifth definitions of Book V of\nEuclid\n's Elements, were subjected to a rigorous examination in the seventeenth century: Among the critics and revisers of those definitions\n[\nwas\n]\nAndré Tacquet\n(\nwhose definition of 'equal reasons' has inspired generations of mathematicians\n)\n. ... Tacquet devised refined procedures to figure out the 'equality of reasons' by approximation.\nWilliam Whiston\nwrites in his Memoirs that\nIn March,\n1702\n/\n3\n, I published my third book, which was Tacquet's 'Euclid, with select theorems of Archimedes, and with the addition of practical corollaries, in Latin for the Use of young Students in the University'. The second Edition was printed at Cambridge by Mr Crownfield, for Mr Thurlborn and Mr Dickenson, A.D.\n1710\n. It was also put into English at London, from the second Edition, under my own Review. The Price of my own Edition in\n8\nvo was\n4\nshillings. Now it was the accidental purchase of Tacquet's own Euclid at an Auction, that occasioned my first Application to the Mathematicks, wherein Tacquet was a very clear writer.\nTacquet also wrote the textbook\nAstronomia\n. After his death\nOpera mathematica\nⓉ\n(\nWorks on mathematics\n)\nwas published in\n1669\n. This major contribution contained works on astronomy, spherical trigonometry, practical geometry, and fortifications. Also included was the previously published\nCylindricorum et Annularium\nⓉ\n(\nCylinder and rings\n)\nand\nAstronomia\n. Henry Oldenburg, secretary to the\nRoyal Society of London\n, wrote that it was:-\n... one of the best books ever written in mathematics.\nTacquet's work was sent to\nHuygens\nand a correspondence between the two resulted. Nuchelmans writes about the topic of these discussions in\n[\n4\n]\n:-\nIn modern times the so-called consequentia mirabilis\n(\nif\n(\nif not-P, then P\n)\n, then P\n)\nwas first enthusiastically applied and commented upon by\nCardan\n(1570)\nand\nClavius\n(1574)\n. Of later passages where it occurs,\nSaccheri\n's use\n(1697)\nhas drawn a good deal of attention. It is less known that about the middle of the\n17\nth\ncentury this remarkable mode of arguing became the subject of an interesting debate, in which the Belgian mathematician Andreas Tacquet and\nChristiaan Huygens\nwere the main representatives of opposite views concerning its probative force.\nAlso preserved is correspondence between Tacquet and\nFrans van Schooten\n.\nThe importance of Tacquet's work is not so much in the actual results he proved, for he was not greatly inventive in this respect, but rather for the clarity of his writings and the fact that in many ways his approach was important in preparing the way for\nNewton\nand\nLeibniz\n's integral and differential calculus. Tacquet introduced several ways of thinking which proved important in giving a foundation for future progress, for example in noting that one could pass from a finite progression to an infinite series.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic"
  ]
}