{
  "nome_completo": "Andrew Paul Guinand",
  "nome_curto": "Andy Guinand",
  "ano_nascimento": "1912",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Guinand/",
  "lugar_nascimento": "Renmark, South Australia, Australia",
  "lugar_morte": "Peterborough, Ontario, Canada",
  "biografia": "Andrew Guinand\n, always known as Andy, went to school at St Peter's College, Adelaide from\n1924\nto\n1929\n. He then entered St Mark's College of the University of Adelaide in\n1930\nto study mathematics, graduating in\n1933\n. He was a great sportsman in his university days, described in\n[\n1\n]\nas follows:-\n... it is recorded that he was a proficient gymnast, he rowed with the Torrens Rowing Club, and he competed in bicycle races with the South Australia Amateur Cycling Association.\nIn\n1934\nGuinand won a Rhodes Scholarship to attend the University of Oxford in England. This was the typical route for the top Australian academics at that time, and Guinand studied at Oxford for his doctorate under\nTitchmarsh\n's supervision. One of the examiners for his thesis was\nHardy\nand\n[\n1\n]\n:-\nAndy in later years treasured a note from\nHardy\nasking him to postpone his oral examination because he\n(\nHardy\n)\nhad been asked to play in a cricket match for the Trinity College Servant's Team.\nIn session\n1937\n/\n38\nGuinand studied at Göttingen, then in\n1939\n/\n40\nat Princeton in the United States. In\n1940\nhe joined the Royal Canadian Air Force, returned to England and was a navigator on many missions. When he was stationed\n70\nkm from Oxford he would ride there on his bicycle to continue his mathematical research.\nAfter being an assistant at Cambridge, he became a lecturer at the Royal Military College of Science in\n1947\n. He was promoted to Associate Professor of Mathematics before returning, in\n1955\n, to a chair at the University of New England at Armidale which lies on the valley slopes of Dumaresq Creek in the New England Range in New South Wales, Australia.\nDuring his two years at Armidale he was Head of Department, then he left to take up a post in Edmonton, Canada at the University of Alberta. His next appointment was to the University of Saskatchewan in\n1960\n, then in\n1964\nhe became the first chairman of the mathematics department at Trent University in Peterborough in south-eastern Ontario, Canada. Trent University,\n115\nkm east-north-east of Toronto, had been founded in\n1963\n.\nGuinand worked on summation formulae and\nprime numbers\n, the\nRiemann\nzeta function\n, general\nFourier\ntype transformations, geometry and some papers on a variety of topics such as computing, air navigation,\ncalculus of variations\n, the\nbinomial theorem\n,\ndeterminants\nand\nspecial functions\n. In\n[\n1\n]\nW N Everitt\nwrites:-\nAs a student of\nTitchmarsh\nin Oxford in the years immediately before the second world war it was natural that Guinand's research interests should be directed into the field of\nFourier analysis\nand the\nRiemann\nzeta function. ...\n[\nIn an important paper in\n1948]\nthe main application of the general result yields a deep-seated connection between the distribution of the prime numbers and the location of the zeros of the\nRiemann\nzeta function on\n(\nor near to it if the\nRiemann hypothesis\nis false\n)\nthe critical line in the complex plane... Guinand was convinced that these results could lead to more information about the\nRiemann\nzeta function, and he was disappointed that he was not able to advance further in this area and that others did not take up the possibility themselves.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}