{
  "nome_completo": "Ángel Palacio Gros",
  "nome_curto": "Ángel Gros",
  "ano_nascimento": "1913",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Palacio_Gros/",
  "lugar_nascimento": "Zaragoza, Spain",
  "lugar_morte": "Madrid, Spain",
  "biografia": "Ángel Palacio Gros\nwas the son of Ángel Palacio and Ramona Gros Lapuente, both from Zaragoza. There were six children in the family and Ángel Palacio Gros had five siblings Carmen, Virginia, Aurora, Adela and Alfonso. Carmen became a primary school teacher, Virginia became Professor of Drawing at the Cangas de Onís Institute, and Adela became Professor of Literature at the Doña Jimena Institute in Gijón. Adela had married Lorenzo Rodríguez-Castellano in\n1945\nand her daughter describes them as follows\n[\n1\n]\n:-\n... my parents were intelligent, cultivated and serious people, and, like many other Republicans, they supported and defended the Second Republic. They also lost a Civil War that resulted in a terrible post-war period and a detestable dictatorship that they fought against and in which they fought to survive, remaining worthily faithful to their principles until their death.\nThis description certainly applies to Ángel Palacio Gros, his parents and all his siblings.\nUnfortunately we have not been able to find as much information about Ángel Palacio Gros' student years as we would have liked so this part of our biography is rather sketchy. In\n[\n12\n]\nit records that he studied Projective Geometry and Theory of Functions for four years under the direction of José Barinaga\n(\nProfessor at the University of Madrid\n)\nand Roberto Araujo\n(\nProfessor at the University of Zaragoza\n)\n. Let us say a little about these two professors.\nJosé Barinaga Mata\n(1890\n-\n1965)\nstudied mathematics at the Complutense University of Madrid obtaining a Ph.D. in\n1929\n. He was appointed Professor of Analysis at the Complutense University of Madrid in\n1931\n, being the successor to Octavio de Toledo. He became president of the Spanish Mathematical Society in\n1937\n. Accused of being \"one of the most exalted revolutionaries\", he was dismissed in\n1939\nand not reinstated until\n1946\n. Ángel Palacio Gros later dedicated one of his books to José Barinaga, writing \"To Don José Barinaga, unforgettable teacher, with devotion and affection.\"\nRoberto Araujo García was professor of Mathematical Analysis at the University of Valencia. He was dismissed and in\n1940\nhe was sentenced to six years and one day in prison for \"helping the rebellion.\" He was a Protestant and was reappointed to Zaragoza in\n1947\nwhen laws protecting Protestants were put in place.\nWe have mentioned what happened to Palacio Gros's teachers in the Spanish Civil War since this war would totally change the course of his career. In\n[\n10\n]\nunder heading 'Studies and works of scientific improvement' it informs us that Palacio Gros conducted studies on the foundations of Geometry, both Projective and Analytical, at the Istituto Matematico\nUlisse Dini\nin Florence when the Director of the Institute was\nGiovanni Sansone\n. The reference\n[\n10\n]\ngives no dates for his degrees in Madrid or of his research visit to Florence, Italy. On\n2\nMarch\n1963\n,\nGiovanni Sansone\ngave the talk\nL'Istituto matematico \"Ulisse Dini\" di Firenze\nⓉ\n(\nThe \"Ulisse Dini\" Mathematical Institute of Florence\n)\nin which he noted that Ángel Palacio Gros had \"passed through the Institute.\"\nDo we have any indication about when Palacio Gros graduated from Madrid? In\n[\n6\n]\nJuan José Martín Frechilla gives\n1930\nas the date of Palacio Gros's degree. This looks unlikely since it would mean that Palacio Gros entered Madrid University close to his\n13\nth birthday. It would make more sense if he entered Madrid University in\n1930\n. What we do know is that Palacio Gros was on the staff of the Exact Sciences section of the Faculty of Sciences of the University of Madrid when the Civil War broke out in July\n1936\n. His whole family were strong supporters of the Republicans so it was natural for him to support that cause by joining the Republican Army.\nPalacio Gros was in the\n46\nth Division, part of the\n5\nth Army Corps of the Maneuver Army in December\n1937\n. The Maneuver Army\n(\nEjército de Maniobra\n)\nwas designed to carry out the campaigns that had been planned by the Republican General Staff. It was a mobile army that was not specifically assigned to any front. It included the most loyal and experienced combat troops of the Republican Army. The\n46\nth Division was led by Major Valentin Gonzalez, known as El Campesino. On\n26\nJanuary\n1938\nPalacio Gros was \"the divisional assistant captain\" of the\n46\nth Division. A month later he is described as \"chief of staff of the\n46\nth Division.\"\nThe town of Teruel is a high-altitude town to the east of the Turia River in the mountainous Aragon region of eastern Spain. It changed hands several times during the Civil War and by the end of\n1937\nthe Republicans were in control. Palacio Gros was with the\n46\nth Division in Teruel. Franco's forces then began to attack the town. Not only did they have far greater forces than the Republicans but on the\n17\nth of February there were six hours during which Franco's forces, using German Stuka aircraft, bombed the town with\n200\nand\n500\nkilo bombs. The following account comes from\n[\n11\n]\n:-\n... the material superiority was overwhelming in favour of Franco's forces. The defenders of Teruel, then commanded by Valentin González\n(\nCampesino\n)\nwere surrounded on\n20\nFebruary. On the\n21\nst, when they had already lost the Plaza de Toros and had no ammunition other than hand bombs, El Campesino, mounted on a tank, broke through the siege and he returned at nightfall to the Division command post, located in Plaza del Torico, after having met with Juan Modesto, commander of the\n5\nth Army Corps. Two thousand men remained there, attacked by the entire Castilian Army Corps and under fire from fifty batteries. The Board of Command decided to try to leave and at ten o'clock at night the Republicans swam across the Turia, where they suffered many casualties. They made their way through with hand bombs, but more than a thousand were taken prisoner, among them Palacio Gros, chief of staff of the\n46\nth Division. A handful of men led by El Campesino were the only ones who could reach the Republican lines.\nPalacio Gros was sentenced to death and was imprisoned in the Central Prison of Burgos. The Spanish Civil War ended in April\n1939\nwith victory for Franco but this did not help those in prison for the crime of \"military rebellion.\" Death sentences continued to be carried out but in Palacio Gros's case he was not executed. Pressure for the release of such prisoners led to him being freed in\n1947\nafter over eight years in the Central Prison of Burgos. He made his way to the border with Portugal and soon met up with other refugees. Palacio Gros seems to have become the leader of the group and set about negotiating their departure to Venezuela. They contacted the diplomatic representative of the Venezuelan government in Portugal who visited them in the place where they were confined. On\n1\nJuly\n1947\nPalacio Gros wrote to the representative of the Venezuelan government thanking him for his visit and his efforts to allow them to emigrate to Venezuela. He writes\n(\nsee\n[\n6\n]\n)\n:-\nBeing a refugee is having lost, due to the brutal force of circumstances, a past. To lose a past is to die a little ... Eight years of silent and underground struggle in our homeland, eight years of living gagged, deprived of freely exposing our ideas, have created in us a habit of silence.\nArriving in Venezuela, Palacio Gros set up home in the capital Caracas. He began as a mathematics teacher and taught at two schools, the Colegio América and the Liceo Fermín Toro in Caracas. The Colegio América had been founded in\n1939\nby Spanish exiles and financed by the Caracas elite who wanted a secular school. It was an excellent school, teaching pupils at both primary and secondary level. Among its pupils we mention Julián Chela Flores\n(\nborn\n1942)\n, the son of the mathematician\nRaimundo Chela\n, who became a leading physicist. The Liceo Fermín Toro was founded in\n1936\nand was well-known for teaching left-wing views. It was forced to close for a few years in the\n1950\ns during the dictatorship of Marcos Pérez Jiménez. In addition to these teaching positions, Palacio Gros began teaching at the Faculty of Physical and Mathematical Sciences of the Central University of Venezuela in\n1948\n. This university in Caracas was founded in\n1721\nmaking it the oldest university in Venezuela and one of the oldest in the Americas. Palacio Gros taught\nEnrique Planchart\nboth at the Colegio América and at the Central University of Venezuela.\nPlanchart\nwrites in\n[16]\n:-\n... I was lucky of having from the\n3\nrd year of the Baccalaureate to the\n2\nnd year of the University, Ángel Palacio Gros as professor of geometry.\nOn\n20\nSeptember\n1948\nPalacio Gros married Josefa Menéndez Pablos\n(\nborn about\n1917)\n, known as Pepita. They had three daughters, the eldest being Pilar Eva Palacio, born in Caracas in\n1949\n. Pilar Eva became a writer, publishing works such as\nNingún rincón prohibido\nⓉ\n(\nNo forbidden corner\n)\n(2003)\n. She dedicated this to her parents\n[\n9\n]\n:-\nTo my parents Pepita and Ángel, for teaching me that life was also a true comedy.\nIn the Preface to this book she writes about her parents and her upbringing so we present an extract\n[\n9\n]\n:-\nPilar Eva Palacio writes, according to her own confession, that she fell in love with Peter Pan at an early age, which is when the children of good teachers usually learn to read and write. Her mother, Pepita Menéndez Pablos, taught her daughters, Pilar Eva is the eldest, with her great pedagogical wisdom while her father, Ángel Palacio Gros, taught Analytical Geometry and Mathematical Analysis at the Central University of Caracas: a marriage of political exiles, of the very first clandestine fighters against Francoism, who fled as a result of a downfall that involved them and who would not return to Spain until the dictator's death.\nPilar Eva Palacio grew up, then, among orchids on the part of Venezuela and helical surfaces on the part of her father. But from a very early age she fell for orchids. She did it, as is logical, to protect her imagination from the transcendental curves, homogeneous coordinates or osculating planes that the mathematician traversed, swearing, however, to publish books like him, albeit funnier.\nThat is why our author continued writing after leaving her Pan. Until now she had published individual stories, but she could not get her book published, that volume once again presided over on the cover by the last name Palacio, but preceded by her own name, Pilar Eva, and whose title does not resemble at all the 'Geometric Theory of Conic Sections' or 'Plane and Skew Curves'.\nPepita and Ángel Palacio had two younger daughters are called Rocío\n(\nborn\n1952)\nand Ángeles Almudena\n(\nborn\n1953)\n.\nIn\n1951\nPalacio Gros along with\n17\nengineering professors and\n123\nprofessors from other faculties, signed the manifesto against the revocation of the Organic Statute of National Universities. They were all dismissed. Palacio Gros taught at the Colegio América for a while then was appointed to the University of Zulia in\n1952\n. The rector of the Central University of Venezuela, Pedro González Rincones, offered a \"pardon\" to all the expelled professors and for this reason, in\n1953\n, Palacio Gros returned to the Central University of Venezuela. In the year\n1953\n, he did, however, hold chairs in both the University of Zulia, where he was Professor of Mathematical Analysis II and III, and the Central University of Venezuela, where he was Professor of Complementary Mathematics and Mathematical Analysis I.\nOn\n22\nMay\n1954\nhe applied for Venezuelan citizenship, writing the following:-\nFor half my life I have earned my living through my profession as a mathematics teacher. Wishing to obtain Venezuelan nationality, I express to you my willingness to acquire it by accompanying this application with the legal documents. I swear to comply with and respect the Constitution and Laws of the Republic.\nHe was a demanding, yet good, teacher\n[\n1\n]\n:-\nÁngel Palacio Gros as a teacher was very strict and the students were very afraid of the 'Angel of Spain'. But Palacio Gros was also a good teacher, knowledgeable about the subjects he taught. The retired professor of Electrical Engineering, Luis Loreto, was his student in the subject Mathematical Analysis II and reports that: \"Palacio Gros was an excellent speaker, a true actor. I think that even he had programmed the moment in which his cigar would go out. In one of the first classes, when he finished explaining the subject of the integral according to\nRiemann\n, he turned his back to the blackboard and spread his arms, as if to say, there it is! From the middle of the lecture theatre came the trembling voice of a student asking for an example, please. Palacio, with his proud Spanish accent, told him: 'Young man: the example is the surrender of intelligence'. I always quote this to my students.\"\nMathematical Analysis II was taught in the second year of the engineering course and there were around\n400\nstudents taking this course. The students were divided into two classes of around\n200\neach and both were taught by Palacio Gros. He taught the first class from\n7\na.m. to\n9\na.m., then the next class in the same lecture theatre from\n9\na.m. to\n11\na.m. The examination was in two parts, each worth ten points. The first part was all bookwork taken from the material given to the class and the second part was all problems. The examination had to be written with a fountain pen on lined paper using only one side of the paper. He seems to have marked with the belief that only God would score\n20\n, only Palacio Gros himself would score\n19\n, so the best a student could expect was\n18\nand very few achieved that. One who did score\n18\nout of\n20\nwas Ignacio Iribarren who went on the be awarded a D.Phil. from the University of Oxford in England. Palacio Gros always handed the examinations back to his students, starting with the lowest grades.\nOne of his students was Parma Campo who writes\n(\nsee\n[\n1\n]\n)\n:-\nI was a student of Professor Palacio Gros at the Colegio América and then one of his\n200\nstudents at the Central University in the Faculty of Engineering. His passion for mathematics did not remain in the four walls where he taught, cigar in hand. He was an extraordinary teacher, an impeccable person and a constant inspiration for me. From the year\n1967\nto today\n(2017)\n, I try to follow in his footsteps. I am a teacher and researcher of mathematical education. I am in the process of writing a book where his work will be featured. My line is the development of an innovative methodology under the name 'Teaching of Mathematics with a Humanist Approach'. I think the name honours Professor Palacios Gros, my very dear and respected mathematics teacher. ...\nPalacio Gros wrote four books, based on the lecture curses he gave at the Central University of Venezuela. These were:\nApuntes de geometría del espacio y teoría geométrica de las secciones cónicas\nⓉ\n(\nNotes on the geometry of space and the geometric theory of conic sections\n)\n(1950)\n;\nLecciones de Análisis Matemático\nⓉ\n(\nMathematical analysis lessons\n)\n(1951)\n;\nLecciones sobre curvas planas y alabeadas y teoría de superficies\nⓉ\n(\nLessons on plane and twisted curves and surface theory\n)\n(1959)\n; and\nEjercicios de Análisis Matemático\nⓉ\n(\nExercises on mathematical analysis\n)\n(1968)\n.\nIn\n1954\nPalacio Gros became a member of the Asociación Venezolana para el Avance de la Ciencia. He was involved in the mathematics content of the Association' journal, the\nActa Científica Venezolana\n. Following the death of\nEinstein\nin April\n1955\n, he was asked to contribute an article to the\nActa\n. He replied:-\nAlthough the task is far beyond my capacity, I have accepted it, since it would be intolerable to refuse to add one more voice of condolence, however modest, to the millions of voices that, over the entire surface of the Earth today lament the loss not only of the physical and mathematical genius, but also of the man who knew how to leave the laboratory for a moment in defence of human dignity. Of the man who knew how to put the immense weight of his talent and his prestige on the scales of justice.\nIn November\n1975\n, Francisco Franco who had led the Nationalist forces against the Republicans in the Civil War and had then ruled Spain for nearly forty years, died. Only then did Palacio Gros and his wife feel able to return to the country of their birth. He retired from his university positions in Caracas and went to live the last years of his life in Madrid. In Madrid he was visited from time to time by Ignacio Iribarren who, after his Oxford doctorate, began his teaching career at the Faculty of Engineering of the Central University of Venezuela in Caracas in\n1967\n. He reported that when he was in Madrid:-\nPalacio Gros continued to 'live' inside Venezuela. When we visited him in Madrid it was an event for him: he wanted to know about so-and-so, about the Faculty of the Central University, etc.\nPalacio Gros died in Madrid on\n19\nAugust\n1990\n. His wife Josefa Menéndez continued to live in Madrid and died there on\n23\nJune\n2006\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}