{
  "nome_completo": "Anna Winlock",
  "nome_curto": "Anna Winlock",
  "ano_nascimento": "1857",
  "ano_morte": "1904",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Winlock_Anna/",
  "lugar_nascimento": "Cambridge, Massachusetts, USA",
  "lugar_morte": "Boston, Massachusetts, USA",
  "biografia": "Anna Winlock\nwas the daughter of\nJoseph Winlock\n(1826\n-\n1875)\nand Mary Isabella Lane\n(1832\n-\n1912)\n.\nJoseph Winlock\nwas a mathematician and astronomer who had been appointed Superintendent of the American Nautical Almanac and had begun working at the American Nautical Almanac Office in Cambridge, Massachusetts two weeks before his marriage to Isabella Lane on\n9\nDecember\n1856\n. Isabella Lane had been born on\n6\nMay\n1832\nat Palmyra, Marion, Missouri, USA, to parents George Washington Lane Sr\n(1790\n-\n1841)\nand Frances Tolson Adams\n(1792\n-\n1844)\n. Joseph and Isabella Winlock had six children: Anna Winlock, the subject of this biography; William Crawford Winlock\n(1859\n-\n1896)\n; Louisa Winlock\n(1860\n-\n1916)\n; George Lane Winlock Sr\n(1862\n-\n1948)\n; Isabella L Winlock\n(1865\n-\n1926)\n; and Mary Peyton Winlock\n(1867\n-\n1942)\n. Let us give a few details of Anna's siblings before continuing with her biography.\nWilliam Crawford Winlock made observations of the force of gravity for the United States Coast Survey, then graduated from Harvard University in\n1880\n. He was then employed at the United States Naval Observatory in Washington. He spent the years from\n1889\nworking for the Smithsonian Institute becoming assistant secretary. Louisa Winlock worked at Harvard College Observatory for\n29\nyears from\n1886\nto\n1915\n. She assisted her sister Anna Winlock and\nMina Fleming\nwith numerical computations. Mary Peyton Winlock was educated at the School of the Museum of Fine Arts, Boston in the\n1890\ns. She became a master silversmith specialising in creating jewellery and serving pieces embellished with exquisite enamel work.\nJoseph Winlock\nserved in the role of Superintendent of the American Nautical Almanac from\n23\nNovember\n1856\nto\n10\nAugust\n1859\nand from\n18\nSeptember\n1861\nto\n1\nMay\n1866\n. In fact in\n1857\nhe had been appointed as Professor of Mathematics in the United States Navy and was an assistant at the Naval Observatory in Washington for several months. In\n1859\nhe resigned as Superintendent of the American Nautical Almanac when he became head of the Mathematics Department at the Naval Academy at Annapolis, Maryland. The Academy moved to Newport, Rhode Island when the Civil War broke out in\n1861\nand at this point\nJoseph Winlock\nresigned and returned to the American Nautical Almanac Office in Cambridge, Massachusetts where again he became Superintendent.\nAnna Winlock was three days past her fourth birthday when her father took up the role of Superintendent at the American Nautical Almanac Office in Cambridge, Massachusetts for the second time. In\n1866\n, when Anna was ten years old her father became Phillips Professor of Astronomy at Harvard College and Director of the Harvard College Observatory. The next years went well for Anna. She attended schools in Cambridge, Massachusetts where she soon showed a talent for mathematics. Her father encouraged her education, being particularly keen to teach her some of the mathematical techniques in which he was expert. There was a total eclipse of the sun on\n7\nAugust\n1869\nand\nJoseph Winlock\nled a party to Kentucky to observe the total eclipse. Anna went with the observing party which set up their equipment in Shelby College in Shelbyville, Kentucky, where\nJoseph Winlock\nhad studied and taught. While in Shelbyville, Kentucky, Anna was able to meet many of her father's cousins, sisters and aunts. This expedition was important for the excitement of seeing the eclipse while the hard work of the astronomers in observing it, gave Anna an understanding of what it meant to be an astronomer.\nThe\n1870\ncensus gives a picture of the family on\n4\nAugust of that year. They are living in a house in the grounds of the Observatory in Cambridge Ward\n5\n, Middlesex, Massachusetts.\nJoseph Winlock\n, \"astronomer,\" is the head of the family with Isabella, his wife, \"keeping house.\" Their children, Anna Winlock\n(\naged\n12)\n, William C Winlock\n(\naged\n11)\n, Louisa Winlock\n(\naged\n9)\n, and George L Winlock\n(\naged\n7)\nare all \"at school.\" Their youngest two children, Isabella L Winlock\n(\naged\n4)\nand Mary P Winlock\n(\naged\n2)\nare both \"at home.\" Also living in the house are three domestic servants, all born in Ireland, Bridget Henry, Ellen O'Brien and Ann McCormick. Joseph McCormick, Ann McCormick's sixteen year old son who is \"at school,\" is living with them. The final person listed as living in the house is Arthur Searle\n(1837\n-\n1920)\n, an astronomer born in London, England, appointed to the Harvard College Observatory by Joseph Winlock in\n1868\nand promoted to Assistant in the following year.\nAnna Winlock continued her schooling in Cambridge, Massachusetts, at the High School showing her mathematical talents and also an exceptional ability in Greek\n[\n7\n]\n:-\nIt was not a common thing in those days for young girls to study Greek and at the time of graduation she received a letter from the principal expressing in the warmest terms his appreciation of her Greek and of her character.\nAnna graduated in April\n1875\nbut tragedy struck the family two months later when her father\nJoseph Winlock\ndied. The Winlock family now had Isabella as its head with six children, the oldest being Anna aged seventeen. They were living in a house owned by the Harvard College Observatory which would clearly be required for the new director when he was appointed. Arthur Searle, who had married in\n1873\nand was no longer living with the Winlock family, was appointed as temporary director. The Observatory treated the Winlock family kindly, gave them plenty of time to find a new home and provided help for them to find the right house. Once this was achieved, the Observatory could no longer support them financially and so Anna decided to ask if the Observatory would give her a job as a computer.\nWilliam Augustus Rogers\n(1832\n-\n98)\nhad been appointed to the Observatory in\n1870\n. He had married Rebecca Jane Titsworth in\n1857\nand in\n1875\n, before Anna Winlock approached the Observatory, Rebecca Rogers had been appointed by Arthur Searle, the temporary director, as the first female computer to assist her husband. The Observatory had vast amounts of data which needed to be reduced but had little in the way of funds to employ people to do the work. Employing women at a very low wage was a way to solve this problem. Anna Winlock was known to have considerable mathematical skills and she had been helping her father and had learned from him. When Anna asked if the Observatory could employ her, she was offered work at\n25\ncents an hour. This would be roughly equivalent to $\n7\nan hour by\n2023\nvalues. She accepted and began working at the Observatory as a computer. Two computers were insufficient to handle Rogers' data and he asked the President of Harvard College, Charles W Eliot, if he could employ Rhoda G Saunders. Eliot agreed to the offer being made and on\n23\nNovember\n1875\nRogers received Saunders' reply. He wrote to Arthur Searle four days later\n[\n26\n]\n:-\nWill you have the kindness to engage Miss Saunders as a computer at the Observatory for one year at a salary of $\n600\na year.\nBy the end of\n1875\n, therefore, Anna Winlock was one of three female computers at Harvard Observatory\n[\n46\n]\n:-\nThe first women who joined the Harvard Observatory staff in\n1875\n... spent their days conducting mathematical calculations for the male astronomers who worked at the telescopes overnight. The women computers took the astronomers' observation notebooks and \"reduced\" the data recorded inside - averaging numbers, and correcting them for refraction, parallax, and error inherent in different instruments in order to record an object's absolute position in the sky.\nAnna worked in the Computing Room at the Observatory which\n[\n21\n]\n:-\n... was a specialised library, with rows of books that contained the tables and formulas\n[\nthe computers\n]\nneeded to perform their calculations.\nBy the time of the\n1880\ncensus the family are living in Langdon Street, Cambridge, Massachusetts, a road off Massachusetts Avenue. Isabella, now head of the family, is \"keeping house\" while Anna  is an \"assistant at the Observatory.\" William C has \"no occupation,\" Louisa \"lives at home\", while Isabella L and Mary P are both \"at school.\" Two of the three servants who were with the family ten years earlier, Ellen O'Brien and Ann McCormick, are both listed as \"house servant.\" Also living in the same house were Price Lane and Ralph Lane, both nephews of Anna's mother, who aged\n18\nand\n16\nrespectively; they were both \"at school.\" The boys were from the Missouri family of Francis Adams Lane and his wife Emma Horner Price. Since Anna was the only wage earner in the household, we conjecture that the brothers Price Lane and Ralph Lane had gone to Cambridge for their schooling and their parents were contributing to the finances of the household. We note that the Massachusetts census was taken in June\n1880\nbut by the time of the Missouri census in November\n1880\nboth boys were back living with their parents in St Louis, Missouri.\nAnna Winlock worked with the huge amount of data that Rogers had produced observing with a meridian circle which had been installed by her father Joseph Winlock. She\n[\n11\n]\n:-\n... was often involved in meridian circle computations, which were for many years astronomy's most reliable source of positional information about stars. Meridian circles were telescopes which were locked into a position that could scan along the meridian\n(\nthe great circle that runs through the celestial north and south poles, and the local zenith\n)\n. Rather than chasing after stars, these telescopes waited for stars to pass over them, and took down information about the timing of that procession and the angles to the observed star. Taking that information and changing it into stellar positions was an intense process that Winlock mastered and employed over the course of nearly three decades of work, while simultaneously overseeing the thirty-eight-volume 'Observatory Annals', which collected tables of variable star positions and observations within star clusters.\nRogers and Winlock presented the joint paper\nA Catalogue of\n130\nPolar Stars for the Epoch of\n1875\n.\n0\nto the\nAmerican Academy of Arts and Sciences\non\n16\nJune\n1886\n. Although it was a joint paper, Rogers put the following note at the beginning\n[\n35\n]\n:-\nNote by William A Rogers\n. - My connection with this work is limited to the methods of discussion adopted, and to an examination of the numerical results obtained. Beyond this, all the work in the preparation of this paper has been done by my assistant, Miss Winlock, and she is entitled to all the credit therefor.\nHere are some extracts from the\n63\n-page paper to give an indication of its content\n[\n35\n]\n:-\nIt is the purpose of the present paper to discuss the modern observations of such polar stars north of +\n7\nº declination as are found in the Harvard College Catalogue of\n1213\nStars. Of the\n130\nstars in this list,\n68\nare found in the Fundamental Catalogue of Dr Auwers.\nThere will be no attempt to determine the proper motions of these stars, but the places determined for the epoch\n1875\n.\n0\nwill serve a useful purpose in future discussions of this element. ... .\nAll the observations employed in this discussion will be reduced to the System of Publication XIV, of the 'Astronomische Gesellschaft', either directly through the medium of the fundamental stars common to the observed and the fundamental systems, or indirectly through the medium of the Harvard College Catalogue.\nFor many reasons, it was found advisable to construct a yearly ephemeris of each of the stars in the proposed list, extending from\n1860\nto\n1885\n. For the fundamental stars of the list, the places for\n1880\nand for subsequent years were taken directly either from the catalogues of the 'Astronomische Gesellschaft' or from the 'Berliner Jahrbuch'. For the years\n1871\nto\n1879\ninclusive, they were obtained by applying to the yearly ephemerides of the Gesellschaft the corresponding corrections by which the provisional system is reduced to the system of Publication XIV.\nFor the places of the fundamental stars between\n1860\nand\n1870\n, and for the places of all non-fundamental stars for the entire period between\n1860\nand\n1885\n, the reduction-elements given in the Harvard College Catalogue were employed.\nFor stars below\n85\n° north declination the development of\nα\n\\alpha\nα\nand\nδ\n\\delta\nδ\nin terms of the first, second, and third powers of the time will be sufficiently accurate for the limit of fifteen years. For the reduction of stars near the pole, the problem becomes more difficult. Since the method of development by differential coefficients in terms of the ascending powers of the time has necessary limitations in its application, it has been thought advisable to give an illustration of the various methods by which the coordinates for any time\nt\n0\nt_{0}\nt\n0\n​\nare reduced to those for any time\nt\n′\nt'\nt\n′\n. The star Groombridge\n1119\nis selected for this purpose. The reductions for precession and for proper motion will be considered independently.\n...\nThe second part of this paper will be comprised under the following subdivisions:-\n(\na\n)\nTreatment of the proper motion for close polar stars.\n(\nb\n)\nYearly ephemerides of all stars within\n3\n° of the pole, between the limits\n1860\nand\n1885\n.\n(\nc\n)\nTabular values of the terms\nU\nI\n,\nU\nI\nI\n,\nU\nI\nI\nI\n,\nU\nI\nV\n,\nU\nV\nU^{I}, U^{II}, U^{III}, U^{IV}, U^{V}\nU\nI\n,\nU\nI\nI\n,\nU\nI\nI\nI\n,\nU\nI\nV\n,\nU\nV\n, &c., carried as far as will be necessary to give the exact reduction for\n40\nyears.\n(\nd\n)\nTabular values of the proper motions at intervals of\n8\nyears for close polar stars, and at intervals of\n20\nyears for all other stars.\n(\ne\n)\nData for the reduction of the different catalogues employed to the system of Publication XIV.\n(\nf\n)\nTabular values of the systematic relations between the catalogue of Publication XIV and the different catalogues compared.\n(\ng\n)\nFinal catalogues of\n130\nstars resulting from this discussion.\n(\nh\n)\nComparison of the final catalogue with the various catalogues from which it has been derived.\nThe review of the paper in the Sidereal Messenger ends as follows\n[\n1\n]\n:-\nTo show how the work was done, the necessary formulae are stated in order fully, and the tables of constants given, and then a single star Groombridge\n1119\n, for epoch\n1875\n.\n0\n, is taken as an example and its reduction shown in detail. The method of the paper seems excellent and complete, and is a credit to its authors. We shall look with interest for succeeding papers, in which will appear the discussion of other kindred topics named at the close of the one before us.\nA number of observatories around the world had agreed to collaborate on producing a star catalogue, the 'Astronomische Gesellschaft Katalog', for the northern sky from the first to ninth magnitude. Harvard College Observatory was one of the observatories allocated a specific zone\n[\n10\n]\n:-\nThe results were published in phases between\n1891\n-\n1896\n, and Winlock's dedication to the project allowed Harvard to be one of the first of the collaborating observatories to publish its portion of the project.\nIt was Winlock's calculations of the orbit of a recently discovered asteroid in\n1901\nwhich brought her to wide public attention; this asteroid is now named Ocllo. Pickering reported in the\nHarvard College Observatory Circular\nin\n1901\n[\n32\n]\n:-\nFrom an examination of a plate taken on August\n14\n,\n1901\n, with the Bruce Telescope, Dr Stewart found an asteroid having the great southern declination, -\n62\n°. As no known asteroid was so far south at that time, a series of photographs was taken, from which, and from one previous photograph, the approximate positions ... have been derived.  A circular orbit was first computed by Miss Anna Winlock. This gave the surprising result that the heliocentric diurnal motion exceeded\n2200\n\", corresponding to a distance from the Sun less than that of any known asteroid. As Professor\nNewcomb\nwas spending a few days in Boston, he courteously undertook, with the assistance of Miss Winlock, to determine elliptical elements for this object. ...  From these elements it appears that the great peculiarity of this orbit is the ellipticity, which exceeds that of any known asteroid. ... At the time of discovery the asteroid was near perihelion, and therefore was moving very rapidly around the Sun, at a distance of about\n1\n.\n6\n. An approximate ephemeris for Greenwich Midnight ... shows that the asteroid is moving rapidly north, and is now within reach of the telescopes in Europe and the United States.\nA consequence of this was a number of newspaper articles which made it widely known how Winlock and other women astronomers were doing important work. For example, see\n[\n8\n]\n,\n[\n12\n]\n,\n[\n18\n]\n,\n[\n39\n]\n,\n[\n44\n]\nand\n[\n45\n]\n.\nIt is quite difficult to comprehend how Winlock managed to undertake such a vast quantity of work.\nMary Byrd\n, in her obituary of Winlock in\n[\n7\n]\n, does a good job of explaining what was involved; you can read the obituary at\nTHIS LINK\n.\nWe should note that\nMary Emma Byrd\nhad studied astronomy at Harvard College Observatory in the\n1880\ns and knew Winlock well. She was appointed Director of the Smith College Observatory and professor of astronomy in\n1887\n.\nWinlock worked at the Observatory up to\n17\nDecember\n1903\nalthough by that time she was feeling a little unwell but made light of it. Spending Christmas at home did not mean that she stopped work and she continued to make calculations and notes up to New Year\n1904\n. Her death three days later at the age of\n46\nat her home,\n59\nLangdon Street, was totally unexpected. Her death certificate gives the cause of her death as \"exophthalmic goitre,\" an autoimmune disease related to the thyroid gland. The certificate also gives \"myocarditis with marasmus.\" Myocarditis is inflammation of the heart muscle and marasmus is a form of malnutrition.\nMary Byrd\nwrites the following about Anna Winlock\n[\n7\n]\n:-\nTo friends and kindred she leaves a rich legacy simply by having lived. Her delicate sense of humour gave a very human touch to a nature too spiritual and too intellectual to be understood by all. Her gentle loving kindness veiled in part the power of her intellect. Doubtless many knew her without realising how far beyond the average were her powers of mind. She seemed not to realise it herself. For a little thing that others did she was prodigal with hearty praise while she quietly, but persistently ignored real achievements of her own.\nEdward Pickering, the Director of the Harvard College Observatory, wrote\n[\n31\n]\n:-\nMiss Winlock was the eldest daughter of Professor\nWinlock\n, the former director of the Observatory, and began her astronomical work soon after the death of her father in\n1875\n. She assisted the late Professor W A Rogers in the reduction of his meridian circle observations, including those of the zone\n49\nº\n50\n' and\n55\nº\n10\n' north declinations, and after his death she took charge of the reduction of those still remaining unpublished. In addition to this work, she undertook many other contributions of importance, some of them belonging to the department of theoretical astronomy. Her care, efficiency, and good judgement were of great value to the Observatory.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}