{
  "nome_completo": "Anna Johnson Pell Wheeler",
  "nome_curto": "Anna Johnson Wheeler",
  "ano_nascimento": "1883",
  "ano_morte": "1966",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wheeler/",
  "lugar_nascimento": "Calliope (now Hawarden), Iowa, USA",
  "lugar_morte": "Bryn Mawr, Pennsylvania, USA",
  "biografia": "Anna Johnson\nwas the daughter of Swedish immigrants Andrew Gustav Johnson and Amelia Friberg who came from Lyrestad in Skaraborglänm, Wästergotland. They arrived in the United States in\n1872\nabout\n10\nyears before Anna was born. Andrew and Amelia married in the United States and settled in Union Creek in Dakota Territory\n[\n2\n]\n:-\n... they lived in a dugout hollowed from the side of a small hill, and the father tried to eke out a living as a farmer.\nIn\n1882\nthe family moved to Calliope where Anna was born. She was the youngest of her parents' three surviving children\n(\na fourth child died in infancy\n)\n, having a sister Esther\n(4\nyears older\n)\nand a brother Elmer\n(2\nyears older\n)\n. Esther and Elmer had been born in Union Creek. Andrew gave up farming and tried his hand as a furniture dealer and then later as an undertaker. When Anna was nine years old the family moved to Akron, Iowa where Anna attended a public high school. It was Anna's mother who was determined that her daughters should have an education. Unhappy that she had not been educated, she was determined that they would not have these regrets in later life. Elmer may have lost out because of this determination to see the girls educated for he never attended college although he almost certainly had the ability to do so. Anna also gained from the efforts of her older sister Esther who recognised Anna's mathematical talents and encouraged her greatly.\nIn\n1899\nAnna Johnson entered the University of South Dakota where she showed great promise in mathematics but also studied English, Physical Culture, History, German, Latin, French, Physics and Chemistry. The professor of mathematics,\nAlexander Pell\n, recognised her talents and helped persuade Anna that she should follow a career in mathematics. Anna and her sister Esther were at university together and they boarded in the home of\nAlexander Pell\nand his wife Emma. The records show that Anna studied Algebra and Trigonometry in\n1899\n-\n1900\n, Modern Geometry, the Theory of Equations, and Solid Analytical Geometry in\n1900\n-\n1901\n, Calculus, Analytical mechanics and Plane Analytical Geometry in\n1901\n-\n02\n, and the Theory of Substitutions and Potential, Partial Differential Equations and\nFourier\nSeries, and Differential Equations in\n1902\n-\n03\n. Many of these classes were also taken by her sister Esther. Anna received an A.B. degree in\n1903\n. Already when at the University of South Dakota she had ambitions to go further in mathematics. She wrote to her sister in January\n1900\n(\nsee, for example,\n[\n9\n]\n)\n:-\nSure, I would like to go to Europe. I could easily stay in Germany to study Mathematics since I know so much German already.\nCertainly she concentrated on the academic side of university life and took relatively little part in other activities. One thing she did take on, however, was secretary and treasurer of the French Club. After winning a scholarship to study for her master's degree at the University of Iowa, she was awarded the degree for a thesis\nThe extension of Galois theory to linear differential equations\nin\n1904\n. During her year at Iowa, in addition to taking five mathematics courses and a philosophy course, she also taught a first year calculus course.\nWhile at Iowa, Anna won a scholarship to Radcliffe College. A second master's degree from Radcliffe was awarded in\n1905\nand she remained there for a further year to study under\nMaxime Bôcher\n,\nWilliam Osgood\nand Charles L Bouton\n(1869\n-\n1922)\n. Anna Johnson was awarded the Alice Freeman Palmer Fellowship from Wellesley College to study for a year abroad. She went to Göttingen University where she attended lectures by\nDavid Hilbert\n,\nFelix Klein\n,\nHermann Minkowski\n,\nGustav Herglotz\nand\nKarl Schwarzschild\n. She worked for her doctorate at Göttingen advised by\nDavid Hilbert\n. While there\nAlexander Pell\n, her former mathematics professor came to Göttingen so that they could marry. We should note that\nAlexander Pell\n's wife Emma had died in\n1904\nand he had remained in contact with Anna from the time that she had been his student.\nAlexander Pell\n's feelings for Anna are clear from a letter he wrote to her sister Esther in\n1906\n(\nsee, for example,\n[\n9\n]\n)\n:-\nI consider her something like a demi-goddess now, for whatever she wants she gets and whatever she studies she make a success of.\nAnna and Alexander planned to marry, despite the objections of her family to the marriage since Alexander was\n25\nyears older than Anna. There was another difficulty, namely that the Alice Freeman Palmer Fellowship required that the holder did not marry during the tenure of the fellowship. Anna and Alexander therefore waited until July\n1907\nwhen the fellowship ended before they married.\nAfter returning to the United States in August\n1907\n, where her husband was by now Dean of Engineering in South Dakota, she taught courses in the theory of functions and differential equations. In\n1908\nAnna Pell returned to Göttingen on her own. Alexander did not accompany her for financial reasons as he explained in a letter to Esther in April\n1908\n(\nsee, for example,\n[\n9\n]\n)\n:-\nI am awfully sorry I cannot go this summer to Germany but we must pay our debts and then we can live a little bit better, i.e., we may go to Germany next summer together.\nIn Göttingen, she completed the work for her doctorate but, after a disagreement with\nHilbert\n, she returned to Chicago in December\n1908\n, where her husband was now on the staff of the Armour Institute of Technology\n(\nnow the Illinois Institute of Technology\n)\n, without the degree being awarded. She had made preparations for her final examination as is clear from her husband's letter to Esther in November\n1908\n(\nsee, for example,\n[\n9\n]\n)\n:-\nI send you a sample of Anna's dress goods - she has to appear before the examiner in a black dress. Oh, I wish this was all over and I could have her with me again. It is now eight months since she is gone and I feel very very lonesome.\nBack in Chicago, she enrolled at the University on\n4\nJanuary\n1909\nand became a student of\nEliakim Moore\n. She received her Ph.D. in\n1910\nfor her thesis\nBiorthogonal Systems of Functions with Applications to the Theory of Integral Equations\nbeing the one written originally at Göttingen. She took various courses at Chicago: General analysis; Periodic Orbits; Theory of Numbers;\nIntegral Equations\n; Modern Analysis applied to celestial Mechanics; and Theory of Algebraic Numbers. She also worked at the Chicago Observatory in the summer of\n1909\n. After the award of her doctorate, she wrote to Mary Coes\n(1861\n-\n1913)\n, the Dean at Radcliffe College\n[\n9\n]\n:-\nSince my thesis had been written independently of\nHilbert\n, I had a right to use it at the University of Chicago. And so after a year of residence I took my degree under Professor\nE H Moore\nwith magna cum laude. I was the second woman to receive a Ph.D. in mathematics at the University of Chicago and the first woman to receive it under Professor\nMoore\n.\nAnna Pell had published two papers in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1909\n-\n10\n, namely\nOn an integral equation with an adjoined condition\nand\nExistence theorems for certain unsymmetric kernels\n. She hoped for a good university position but at this time there was a strong prejudice against employing women. She wrote:-\nI had hoped for a position in one of the good universities like Wisconsin, Illinois, etc., but there is such an objection to women that they prefer a man even if he is inferior both in training and research. It seems that professor\nMoore\nhas also given up hope for he has inquired at some of the Eastern Girls' Colleges and Bryn Mawr is apparently the only one with a vacancy in mathematics.\nIn the autumn of\n1910\n, Anna Pell taught a course at the University of Chicago then her husband\nAlexander Pell\nhad a stroke in the spring of\n1911\n. Unable to find a replacement, the Armour Institute of Technology asked Anna to substitute for her husband. She wrote:-\nMr\nPell\nwas sick and they were practically forced to take me for they could not get a man. After a couple of weeks they told Mr\nPell\nhe need not return this semester but take a good rest. I have fifteen hours of subjects in Mathematics and have shown them that a woman is capable of doing a man's work in a technical school. The mathematics men at the University of Chicago were very much pleased that at last a woman had the chance to show her ability in such a place as the Armour Institute. But I know it will take a great number of years, to break down the prejudice.\nTwo further papers by Anna Pell appeared in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1911\n. From autumn\n1911\nshe taught at Mount Holyoke College, a women's college in South Hadley, Massachusetts. She was appointed as an instructor and, in\n1914\n, she was promoted to associate professor. While at this College she published\nNon-homogeneous linear equations in infinitely many unknowns\n(1914)\nand\n(\nwith Ruth L Gordon\n)\nThe modified remainders obtained in finding the highest common factor of two polynomials\n(1916)\n. Then in\n1918\nshe was appointed as an associate professor at Bryn Mawr. Certainly one of the reasons for taking up this appointment was the fact that Bryn Mawr had a Ph.D. programme and she would be able to supervise doctoral students. Indeed, during her time at Bryn Mawr, she supervised seven doctoral students. Anna Pell's husband\nAlexander\n, who had never regained his health after his stroke in\n1911\n, died in\n1920\n. In\n1924\nAnna Pell became head of mathematics when\nCharlotte Scott\nretired, being named Alumnae Professor of Mathematics in\n1925\n.\nA second marriage to Arthur Leslie Wheeler in July\n1925\n, during which time they lived at Princeton and she taught only part-time, was short since her second husband died in\n1932\n. Arthur Wheeler\n(\nborn in Connecticut in\n1861)\nhad been a classics lecturer at Bryn Maw who was widowed in\n1915\n. He took up a position at Princeton shortly before his marriage to Anna. The couple built a summer home in the Adirondack mountains, in north-eastern New York State, which they named 'Q.E.D.' After the death of Arthur Wheeler, Anna Wheeler returned to full time work at Bryn Mawr where\nEmmy Noether\njoined her in\n1933\n. However\nEmmy Noether\ndied in\n1935\n. The period from\n1920\nuntil\n1935\ncertainly must have been one with much unhappiness for Anna Wheeler since during those years her father, mother, two husbands and close friend and colleague\nEmmy Noether\ndied. Anna Wheeler remained at Bryn Mawr until her retirement in\n1948\n[\n9\n]\n:-\nAs an administrator, Pell Wheeler worked to enhance the national reputation of the Bryn Mawr mathematics department. Despite the financial effects of the Depression on the college, she tried to create an atmosphere for students and faculty in which there was ample opportunity for professional growth and development, as well as for free interchange of ideas.\nThe direction of Anna Wheeler's research was much influenced by\nDavid Hilbert\n. Under his guidance she worked on integral equations studying infinite dimensional linear spaces. This work was done in the days when\nfunctional analysis\nwas in its infancy and much of her work has lessened in importance as it became part of the more general theory. As an example of one of the papers she wrote while on the Faculty at Bryn Mawr, we mention\nLinear Ordinary Self-Adjoint Differential Equations of the Second Order\n(1927)\n. Here is her own introduction to the paper:-\nIn\n1914\nLichtenstein\nmade connection, without the intermediary of the theory of integral equations, between the theory of linear differential systems of the second order and the theory of linear equations in infinitely many unknowns. Although there are many points of contact between the method used by\nLichtenstein\nand the one used in this paper, the methods are not identical. The method employed here can be applied with only slight modifications to other systems, for example, singular differential systems, and partial differential systems, elliptic or hyperbolic. The method can be extended to yield more general results both for the orthogonal and polar cases of ordinary differential systems.\nPerhaps the most important honour she received was becoming the first woman to give the Colloquium Lectures at the\nAmerican Mathematical Society\nmeeting in\n1927\n. Four years earlier, in\n1923\n, she had been the first woman to deliver an invited address at an\nAmerican Mathematical Society\nmeeting. She was appointed as a Trustee of the Society in\n1923\nand served on the Council during\n1924\n-\n26\n. She received an honorary doctorate from Douglass College, Rutgers University in\n1932\nand an honorary doctorate from Mount Holyoke College in\n1937\n. She served as an editor of the\nAnnals of Mathematics\nfrom\n1927\nto\n1945\n.\nIn\n[\n1\n]\nthere are several accounts of Anna Wheeler by students she taught. Here is an example by a student who studied at Bryn Mawr in the early\n1930\ns:-\n[\nMrs Wheeler\n]\nrecognised that we needed help in our emotional and philosophical growth. She encouraged us to come to tea, to just drop in. She was a good listener. I don't know how she did it, but before you knew it you had told her all sorts of things which you had never intended to tell her. ...\n[\nShe\n]\nwas the kind of person who recognised the needs of others and made herself available. She had a good cook, Mary, who made very good lemon sponge pie. When a pie that she had made for a big dinner party seemed to be a little too dark she would bake a second one and tell Mrs Wheeler that she thought the girls could eat the dark one. The next day we would get an invitation for tea and pie. Much later, Mrs Wheeler, chuckling, told me that she thought that Mary made a pie a little dark on purpose. ... It was only years later that I truly appreciated the many hours of her precious time she generously gave us. A description of Mrs Wheeler as a teacher would be incomplete without mentioning her appreciation of nature and how she shared it with us. Her love of nature opened new doors. She took us on walks in the woods and taught us to listen for the titmouse and to look for the speckled leaf of the dog-toothed violet. A new pleasure for me was to build a small fire in the woods for tea and toast.\nIn\n1960\n, an anonymous donor gave money to establish an Anna Pell Wheeler prize at Bryn Mawr. She suffered a stroke in early\n1966\nand died a few weeks later. Following her wishes, she was buried beside her first husband Alexander Pell in Lower Merion Baptist Church Cemetery in Bryn Mawr.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}