{
  "nome_completo": "Anne Philippa Cobbe",
  "nome_curto": "Anne Cobbe",
  "ano_nascimento": "1920",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cobbe/",
  "lugar_nascimento": "Colworth, Sharnbrook, Bedfordshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Anne Cobbe\n's parents were Alexander Stanhope Cobbe, V.C. and Winifred Ada Bowen\n(26\nMarch\n1886\n-\n11\nAugust\n1956)\n. Alexander Cobbe\n(5\nJune\n1870\n-\n29\nJune\n1931)\nhad a distinguished military career and, in\n1920\n, was appointed Military Secretary to the India Office. At the time Anne was born, he was a Lieutenant-General but was promoted to General in\n1926\n. Alexander married Winifred Bowen, the daughter of Sir Albert Edward Bowen and Alice Anita Crowther, on\n1\nOctober\n1910\nbut since Alexander spent much time overseas, the couple spent relatively short periods together. Winifred lived at Colworth, in her parents' manor. Anne was one of her parents' three children, the other two being Winifred Alice Cobbe\n(\nborn\n11\nJuly\n1912)\nand Alexander William Locke Cobbe\n(\nborn\n2\nApril\n1919)\n. Her brother, known as Bill, was in the Royal Air Force during World War II and was killed in the Battle of Britain on\n8\nSeptember\n1940\n. This, as we describe below, would have a major impact on her career.\nAnne was only ten years old when her father died. She attended Downe House, Newbury, and proved herself to be an extremely able pupil. Downe House School was an independent girls' school which was founded in\n1907\nin Charles Darwin's former home in Downe, Kent but had moved in\n1922\nto Cold Ash, near Newbury, Berkshire\n[\n1\n]\n:-\nShe started reading mathematics in the Sixth Form but then changed to history because she was afraid of becoming narrow-minded ...\nIn\n1938\nshe took the Oxford scholarship examinations in history intending to begin her studies at\nSomerville\nCollege, Oxford. She was told by the examiners that history was not the right subject for her to study so she waited a year and took the Oxford scholarship examinations in mathematics in\n1939\n. In these examinations she showed great talent in mathematics and was awarded an exhibition. Cobbe began her studies at Oxford in October\n1939\nbut with her brother in the Royal Air Force and the country at war this was a very stressful time for her. Like all women entering university at this time, she had not received nearly as solid a background in mathematics compared with men who were entering at the same time. However, she had exceptional talents and was able to make up for the poorer mathematics teaching at the girls' school. At the end of her first year she got the news that her brother had been reported missing, presumed dead, but the Royal Air Force were unable to confirm his fate. Cobbe spent the following two years at Oxford with the uncertainty of her brother's fate hanging over her and, at least for a while, clinging to the hope that he had been taken prisoner by the Germans. Despite this stressful situation her performance was outstanding in the final examinations she took in\n1942\n[\n1\n]\n:-\n... she wrote an outstanding set of papers including two on geometry taken as a special subject.\nIn\n1942\nWorld War II was at a very difficult stage for the Allies with German forces continuing to make advances on all fronts. Cobbe would have liked to continue her studies at Oxford and begin to undertake research for a doctorate. However, she had to make a contribution to the war effort and she was sent to the Department of Operational Research in the Admiralty where she became an experimental officer. This Department at the Admiralty had been set up in June\n1942\n, only a short time before Cobbe began working there. She joined a group of eminent civilian scientists whose job it was to advise the naval staff on various strategical and tactical problems. The work involved applying mathematics and statistics to study the strengths and weaknesses of past operations and so improve weapons, tactics and strategy to be used in future operations. Tactical operations were carried out directly against the German navy while strategic operations were directed against the sources from which the German navy was supplied and the transportation facilities that delivered those supplies to the German navy. However Cobbe's time in this Department proved difficult, particularly since by this time the faint hope that her brother might have survived had gone\n[\n1\n]\n:-\nThe strain of this war work combined with the shock of her brother's death brought on a temporary breakdown in health. On her recovery she returned to the Admiralty until the end of the war, but for some years the symptoms of her illness were liable to recur if she over-worked.\nAfter the war had ended, Cobbe's mother, Lady Winifred Cobbe, opened a market garden in Wittersham, Kent, and Anne and her sister Winifred gave some assistance. This venture later expanded to include rearing pigs. Cobbe began the research at Oxford that she would have started in\n1942\nhad it not been for the war. She was awarded an M.A. in\n1946\nand, in the following year, she was appointed as a lecturer at Lady Margaret Hall, University of Oxford. She undertook research with\nJ H C Whitehead\n.\nHenry Whitehead\nhad also left Oxford during the war and had undertaken war work at the Board of Trade, at the Admiralty, and finally at the Foreign Office. He had been appointed to the Waynflete Chair of Pure Mathematics at Oxford in\n1947\n. Cobbe was awarded a D.Phil. by the University of Oxford in\n1952\nfor her thesis\nModern Algebraic Theories\n. Before submitting her thesis, she had already published the paper\nSome algebraic properties of crossed modules\nin\n1951\nand in this paper she gave the following acknowledgement:-\nI should like to thank Professor\nWhitehead\nfor the many helpful suggestions he has made during the preparation and writing of this paper.\nShe also published\nOn the cohomology groups of a finite group\n(1955)\nin which she again thanked\nJ H C Whitehead\nwriting:-\nI should like to thank Professor\nWhitehead\nfor his help in the preparation of this paper.\nCobbe continued in her position as a lecturer at Lady Margaret Hall until\n1955\nwhen she returned to\nSomerville\nCollege where she had been a student. She was appointed as a fellow and tutor at\nSomerville\n. This position as a tutor she enjoyed more than when she had to give lectures\n[\n1\n]\n:-\nShe was always well read in mathematics and she was a most stimulating tutor. Moreover she took a genuine interest in all her pupils and would have any pupil who was in personal trouble to stay in her flat. She was generous with her time and was always ready to help either an undergraduate or a research student who was floundering because of insecure foundations in algebra.\nOn\n11\nAugust\n1956\nCobbe's mother died but Cobbe and her sister continued to run the pig farm that her mother had established. Of course, Cobbe was at Oxford during term time where she had teaching duties, but in the vacations she went to the farm where she carried out the paperwork and did the accounts. By a coincidence, her thesis advisor\nJ H C Whitehead\n's mother also owned a small farm and when she died in\n1953\n,\nWhitehead\ninherited the cattle and purchased a small farm which he ran with his wife.\nLet us return to the papers that Cobbe wrote. We mentioned her first paper\nSome algebraic properties of crossed modules\n(1951)\n. This paper is\n[\n1\n]\n:-\n... a general study of the algebraic structures arising from\n2\n-dimensional homotopy groups. These were studied in full generality and she related them to the\ncohomology theory\nof groups and to work of\nMac Lane\non extensions of groups. This paper is interesting in that it illustrates very clearly how much even the purest of algebraic cohomology theory arose directly from topological considerations.\nThis was reviewed by R L Taylor who wrote in his review:-\n... the proof of Lemma\n5\n, and hence of Theorem\n2\nA, is unconvincing.\nTaylor contacted Cobbe and together they corrected Cobbe's analysis in her first paper which contained an error. Together they produced some impressive results which they published in a joint paper\nOn Q-kernels with operators\npublished in\n1957\n. This paper led to understanding the\n[\n1\n]\n:-\n... deeper relationship between\n2\n- and\n3\n-dimensional cohomology groups and extensions of one group by another. It tackles the very difficult problem of deciding, from the action of certain automorphism groups on a cohomology group, when two cohomology classes represent isomorphic extensions.\nFrom\n1969\non her health deteriorated rapidly and, feeling that she was no longer able to carry out her tutoring duties to her own high standards, she resigned both her fellowship and her position as a tutor in April\n1971\n. However, one of the tutors at\nSomerville\nwas on leave for the first term of the academic year\n1971\n-\n72\nand Cobbe was asked if she would tutor for that term. Despite by this stage being seriously ill, she was determined not to let the College down and she returned to\nSomerville\nand tutored during the term. She died only a matter of days after teaching had ended.\nCobbe had always intended to publish her lecture notes on modules over a ring and began work on this after resigning her position in April\n1971\n. However, she had not completed writing this up at the time of her death\n[\n1\n]\n:-\nAmong Anne's papers were found parts of a projected exposition of the theory of modules over an arbitrary ring. This was intended as a set of lecture notes to be published by the Oxford Mathematical Institute. She planned this in July\n1971\nand the two chapters that she wrote are good and lively. It is a great pity that she was unable to finish this. In Oxford she was the expert on homological algebra and ring theory and she was greatly regarded by her mathematical colleagues both for her expertise and for her kind, sensible and immensely encouraging attitudes.\nFinally let us not that, in addition to her love of mathematics, the other important interests in her life were plants, gardening and music. In fact, while at\nSomerville\n, she was responsible for seeing that the College garden was in top condition. As well as doing the accounts for the farm after her mother died, she also spent time in the vacations propagating flowers and fruit.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}