{
  "nome_completo": "Anneli Cahn Lax",
  "nome_curto": "Anneli Lax",
  "ano_nascimento": "1922",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lax_Anneli/",
  "lugar_nascimento": "Katowice, Poland",
  "lugar_morte": "New York City, New York, USA",
  "biografia": "Anneli Cahn\n's educational experiences prior to college were repeatedly disrupted by her family's flight from the Nazis. Despite the seemingly interminable interruptions, Anneli had key experiences with mathematics during her high school years that influenced her long thereafter. Her interest in mathematics was awakened by Euclidean geometry, which she first studied in the lyceum in Berlin around\n1935\n. She was attracted to the constructions and logic of geometry, completing advanced problems with ease\n[\n6\n]\n:-\nI didn't have to look up anything; I didn't have to consult libraries or books. I could just sit there and figure things out.\nAs she was leaving Germany, her teacher from the Berlin lyceum recognised the teenagers talents and urged her\n[\n6\n]\n:-\nWhatever you do, whatever happens to you, make sure you go to university.\nOn her arrival in the United States, she studied geometry with a teacher she described as 'a lovely old lady, Miss Eaton' at a high school in Queens. These two significant encounters with geometry convinced her that logic was what made mathematics satisfying and pleasing. Because she could not see its underlying logical structure, the algebra class that followed on Miss Eaton's geometry class was a disappointment\n[\n6\n]\n:-\nIt looked like a lot of tricks. It was only much later that I saw that there was a foundation to the stuff... I never liked rules that didn't have a basis that I could understand.\nDespite her dissatisfaction with algebra, Anneli came out of high school 'fascinated with mathematics.' She obeyed the wise words of her dear teacher Miss Eaton and went on to obtain a bachelors degree from Adelphi University in\n1942\n. She later moved on to graduate work at New York University. It was here, while a postgraduate in her twenties, that Anneli met\nPeter Lax\n. It was what some might call a mathematical marriage! They were married in New York City in the summer of\n1948\n.\nEvents followed rapidly on their marriage: in\n1949\nPeter completed his Ph.D. and joined the faculty at New York; in\n1950\nand\n1954\nAnneli gave birth to two sons\n(\nJohn and James\n)\n; in\n1955\nshe finally received her own PhD completed under the supervision of\nRichard Courant\n. The title was\nOn Cauchy's Problem for Partial Differential Equations with Multiple Characteristics\n, and it was published in\nCommunications on Pure and Applied Mathematics\nin\n1956\n.\nBy this time, Anneli had been part of the\nCourant\n'family' at New York for some twelve years, and Peter's own distinguished career in mathematical research was well under way. While Anneli continued her affiliation with New York, her professional centre of gravity shifted from research and graduate studies to the undergraduate programme at New York's Washington Square College, where she was awarded tenure in\n1961\n. Perhaps, during her long association with various projects at the Courant Institute, Anneli never fully experienced the sense of independent achievement that boosts self-confidence and gives momentum to research. Despite her considerable early promise, Anneli gradually drifted away from research. However, it was not uncommon in mathematical marriages for the husband to have the research career while the wife did not. Over time she came to be increasingly involved in teaching, expository writing, and editing, where she made her own distinctive contribution.\nIn\n1982\na family tragedy was to strike when Anneli and\nPeter\nlost their eldest son John at the age of\n32\n. He was a respected historian at Mount Holyoke College and was killed by a car while out walking. Anneli and Peter created a memorial in the form of an annual lecture which is given by a historian of the highest distinction to commemorate the work and spirit of John Lax. These lectures aim to make the latest advances in history accessible to the public.\nFollowing the death of her eldest son, Anneli kept herself busy, working mainly as an editor and educator for the next ten years before retiring in\n1992\n. After retirement Anneli took time to appreciate nature. Although she lived and worked in the urban environment of New York City, she loved the outdoors and especially loved her place at Loon Lake in the Adirondack Mountains. There she enjoyed hiking, swimming, skiing and canoeing.\nWhen she was first diagnosed with cancer in early\n1998\n, she wrote of the 'healing powers' of Loon Lake and of her plans to spend as much time there as possible. After just over a year of battling with cancer Anneli Lax died at her home in New York City.\nWe will now look more closely at some of Lax's achievements. She must have stood out from the other students desperate for\nCourant\n's tutoring and she ended up being his only female student.\nCourant\nnoticed Lax's editorial ability at a period during the\n1950\n's when people who could carry out such 'mathematical copy-editing' were few and far-between. He recommended her for editor of the, then newly formed, New Mathematical Library\n(\nNML\n)\n. Lax's gift for language had showed early in her career, and, among other projects, she helped translate into English\nCourant\nand\nHilbert\n's\nMethods of Mathematical Physics\n. In a\n1992\ninterview in\nFocus\nmagazine Lax remarked\n[\n7\n]\n:-\nCourant\noften asked me to edit things that other people had written. In fact, he claimed that he hired me because I seemed more literate than most people. In the fifties, publishers didn't have people who could do mathematical copy editing....I ended up doing everything. I even made page dummies. That was kind of fun: it was like playing with paper dolls!\nLax's greatest contribution to mathematical literature was triggered by a very different sort of event. The launch of the Soviet satellite Sputnik in\n1957\nwas a shock to the American scientific community, a shock felt at every level. Much thought was devoted to the education of a new generation who would accelerate the pace of American scientific productivity. It was at this point that Lax realised the major contribution that could be made in mathematics education. Out of this endeavour grew the New Mathematical Library. The idea was to make accessible to interested high school students deep results in mathematics described by research mathematicians.\nThe NML was intended as a series of monographs on various mathematical topics. They were not to be textbooks, but designed as supplements for the interested high school or early college student. The monographs were written by individual mathematicians most of whom had not written for the high school level prior to their work in the series. The first monographs appeared in\n1961\nand were originally published for the School Mathematics Study Group Monograph Project, which began in\n1958\nto remedy the perceived shortage of well-written mathematical materials for young people. Initially published by Random House and the L W Singer Company in conjunction with Yale University, the\nMathematical Association of America\n(\nMAA\n)\ntook over publication in\n1975\n.\nThe NML was initially intended as a temporary project, set to come to an end after the publication of approximately thirty monographs or after commercial American publishers began to produce similar books for high school students. Instead, books are still being published in the NML series, though at a slower pace than during its height in the\n1960\ns. It currently holds thirty-nine volumes and continues to grow. Two generations of mathematicians found early sustenance in its contents, and numerous prominent members of the mathematical community found it a vehicle to pass their knowledge on to a new public.\nLax was at the centre of the\nMAA\n's publication program for thirty-three years, overseeing the NML series. She handled every aspect of the NML including acquisition, copyediting, mathematical editing, cover design and typesetting. The NML series was planned by Lax and the editorial board to\n[\n5\n]\n:-\n... make mathematics accessible to the general reader without sacrificing technical accuracy.\nLax was a skilled editor and strove to bring out the best work of the mathematicians who wrote for the series. Such a mathematician was Philip J Davis. He is currently an independent writer and lecturer in the Applied mathematics department at Brown University. We quote from email correspondence with Davis\n[\n2\n]\n:-\nIn the late fifties and early sixties, while there were a good many interesting mathematical topics that could be made accessible to bright and interested high school students, research mathematicians were reluctant to spend time putting together such material for books. There was even a thought that such activity would result in a loss of professional status. Anneli seemed determined to do something about this. Exceptions at the time were\nPoincaré\n,\nCourant\nand\nRobbins\nwho were all authors/writers of popular texts. Around\n1960\nAnneli approached me about contributing a volume for an upcoming series called The New Mathematical Library that she was editing and that was designed to overcome this reluctance to write mathematical texts for students. After much persuasion, I agreed and wrote 'The Lore of Large Numbers', Number\n6\nin the series currently still in print, but horribly out of date!\nIt became the first of a number of books Davis went on to write - despite his initial reluctance. He commented:-\nAnneli had introduced me to the fascinating world of writing and publishing, both technical and trade.\nDavis completes his picture of Lax as an editor by giving another example of their interaction\n[\n2\n]\n:-\n'The Geometry of Numbers' was derived essentially from a raw manuscript left incomplete by C D Olds\n(1912\n-\n1979)\nwho was a professor of mathematics at San Jose State University. Anneli wrote and fine-tuned the manuscript. When she became ill, her work on the manuscript ceased, and the\nMAA\nbegan a search to find someone to complete her job. In the end I'm sure Anneli would have been pleased with the final result: a fine introduction to the geometry of numbers ... this book includes problems, solutions, historical notes, and bibliographical references that go beyond undergraduate enrichment. The perception that popular or expository writing is a no-no for the research mathematician is still around... The Anneli Lax New Mathematical Library is a continuing legacy and should encourage those mathematicians to write and publish such work ...\nNext we quote from Ivan Niven, a Canadian number theorist, who was president of the\nMAA\nfrom\n1983\nto\n1994\n. Niven was approached by Lax in the early\n1970\n's to write a book for the NML. He described her enthusiasm for the project\n[\n9\n]\n:-\nProfessor Lax worked with zest and dedication to this task. The quality of her mathematical taste and sense of the NML readership is revealed in the sensational reception that NML volumes have enjoyed. The first NML, 'Numbers: Rational and Irrational', has been reprinted\n14\ntimes and has sold over\n40\n000\ncopies. There are now also more than\n35\nbooks in the NML series.\nProfessor Lax was very modest about her editorial skills, claiming that 'I have to understand every darn little step, which slows me down terribly and which is one of the reasons that I never learned very much, but it is good for checking errors and making sure that everything is okay.' If only all mathematics books were edited with that attitude!\nLax also served on several of the committees of the\nMAA\nincluding the ad hoc Committee on\nMathematical World\n(1975)\n; the New Mathematical Library Editorial Board\n(1976\n-\n1999)\n; Panel on Remediation\n(1983\n-\n1986)\n; Committee on the Award for Distinguished Service to Mathematics\n(1985\n-\n1987\n; chair in\n1987)\n. In\n1995\n, the\nMAA\nawarded Lax its highest honour: the Yueh-Gin Gung and Dr Charles Y Hu Award for Distinguished Service. Lax was involved in countless activities. Many of Lax's admirers thought the NML should be re-titled 'ANML,' Anneli's New Mathematical Library, because of her care in developing and sustaining the series. The citation for her award reads\n[\n11\n]\n:-\nNo other person in the history of the Association's book publishing effort has played a larger role in developing and nurturing a book series.\nAs well as being an editor, Lax's passion for communicating mathematics to the wider community inspired her involvement in mathematics education. Lax became involved in mathematical education while she was working on her thesis with\nCourant\n. As a Ph.D. sudent, Lax was required to teach small group tutorials. She mentioned this period of time during an interview in\n1992\n[\n6\n]\n:-\nI started teaching at New York University\n(\nNYU\n)\nin the mid-forties, before I had the degree... In all of the many years I've taught, I now, in retrospect; think that I didn't really understand teaching until the last ten years or so.\nMuch praise has been offered for Lax's unique contribution to education. One such admirer was Joanne V Creighton, president of Mount Holyoke College where Lax taught in the late\n1940\n's. Here Miss Creighton speaks at a ceremony awarding Lax an honorary degree in\n1997\n[\n1\n]\n:-\n... she led the way in changing mathematical pedagogy, in exploring the connections of mathematics to the larger curriculum, in understanding the 'interplay' between language and mathematics.\nThis 'interplay' that has been referred to became the focus of Lax's attention. Lax found that incoming groups of New York Universiy freshmen sometimes found difficulty in learning mathematics, as they claimed the 'language' used often puzzled them. Lax designed, and helped teach, a course in mathematics and writing\n(\ncalled 'Language Linked Approaches to Mathematics'\n)\nfor which students obtained double credit. This proved successful, however Lax was determined to follow this so-called 'interplay problem' to its very roots in high schools. She teamed up with John Devine, a professor of education with significant experience of working with teachers in inner-city New York schools. Together they were able to get funding from the Ford Foundation to train teachers from these schools in the methods Lax had pioneered at New York. Devine recalls\n[\n3\n]\n:-\nWe brought the maths teachers and the English teachers together for joint sessions after school. This was unheard of. They didn't know each other. Anneli ran these sessions like a professional mathematical psychoanalyst\n(\n!\n)\nUsing her remarkable flair she was able to get the English teachers to lose their fear of introducing mathematical terms, concepts and procedures into their English classes. On the maths side, she was able to inspire a confidence such that the maths teachers were less afraid of word problems.\nThis work led Lax further into the issues behind teaching and learning, and she soon found herself tutoring students in these inner-city high schools, using her experience to understand how people outside the mathematical community think about the subject. Devine recalls\n[\n3\n]\n:-\nAnneli would come into the tutoring rooms and work with the kids themselves. This was beautiful to behold-someone of such high mathematical capabilities tutoring a ninth-grade boy with poor reading and writing skills. Although she was capable in much higher realms of maths, Anneli would always begin where the student was. Her interest was in knowing the student's thought processes. She would do everything she could to try to get at the way kids were thinking. She would get them talking, and suddenly the kid would be saying, 'I went to the store this morning and helped Grandma figure out her food stamp budget.' So Anneli would become interested in the food stamp budget. She would get around to the textbook, finding relevant bits -but only after understanding the kids view.\nLax scrutinised mathematical terms that could cause confusion amongst mathematics students and thereby started mathematics teachers thinking about their approach to teaching such a 'language.'  She worked to make mathematics teachers in schools in inner-city New York aware of such confusion experienced by students and that thinking was behind the design of her 'Language Linked Approaches to Mathematics' course. This combined course of expository writing and mathematical thinking was so successful that with the Ford Foundation support, Lax expanded the curriculum into several junior and senior high schools in New York City. In response to the award, Lax wrote\n[\n11\n]\n:-\nI am overwhelmed by the unexpected honour of receiving the Award for Distinguished Service to Mathematics...I had always known that there were various ways for a woman to be of service to mathematics, many of which are not officially recognised. ... As in the case of the NML  my concern has been access to mathematics, and my efforts have been directed to making sure that our schools do not deprive students of learning how to think for themselves by developing, among other skills, one of their natural talents: looking at the world mathematically ...There have been many promising experiments of implementing this agenda: those I have been trying to promote are attention to use of language in all learning, particularly learning mathematics, and developing the art of listening\n(\nand reading\n)\nso that we can apply this art to looking at our students' emerging ideas...Let us practice what we preach , read and write carefully, avoid trendy slogans, and go beyond mathematical correctness, syntactic correctness, and political correctness in serving our discipline in our individual ways.\nThroughout this biography Lax has been seen in her many different roles: wife, mother, mathematician, editor and educator. Some of those who knew her as a mentor and friend have been interviewed\n(\neither personally or via email\n)\nto gain a fuller picture of Lax.\nElena Marchisotto, California State University, Northridge, remembers Lax as her supervisor, but more importantly as her friend and mentor. Marchisotto first met Lax while studying for her Ph.D. at New York University in the\n1980\n's. Lax agreed to be Marchisotto's thesis supervisor and Marchisotto feels she benefited greatly from Lax's interest in her work and felt encouraged by her stimulating conversation. Lax's view on mathematics deeply influenced Marchisotto's approach to the subject, particularly in the areas of analysis and geometry. She gave the following personal picture of Lax\n[\n8\n]\n:-\n.... I would like to share one experience with you that is very dear to me. I spent some time with Anneli and Peter in the Adirondacks the summer before Anneli passed - Peter calls it 'a little bit of heaven on earth.' Anneli was already stricken with cancer, but she was fitter than us all! She swam in the lake every morning\n(\ntoo cold for me!\n)\n, canoed, hiked, and baked bread\n(\nfrom scratch!\n)\n. One evening Anneli suggested we go to pick some berries. I had visions of strolling down a lane with a white basket daintily selecting delicate fruit. Anneli, however, drove us deep into the woods, walked with us down bug-infested paths to berry bushes. In order to retrieve the fruit we had to be fierce with the prickly growths. Anneli dove right in and filled her bucket to the brim! I, however, spent my time engaged in fending off the pesty bugs and avoiding the thorns. When I think of that day I carry in my heart many of the things I loved about Anneli - her quiet determination, her openness and acceptance of the weaknesses of others and her joy in simple pleasures. She is sorely missed.\nAnother one of Lax's former graduate students at the\nCourant\nInstitute in\n1986\n, was Eileen Fernandez. An interview was conducted in January\n2008\nwith Fernandez. She met Lax at a very exciting time in her life. She had just received a grant from the Ford Foundation for the project entitled 'Language Linked Approaches to Mathematics.' Lax was looking for a graduate student to work on the project and Fernandez describes herself as fortunate to have obtained such a position. She goes on to describe his first impressions of Lax\n[\n4\n]\n:-\nI remember being intrigued by this woman who had meaningfully conjoined the disciplines of mathematics and education into a respected academic career ...\nFernandez continues to describe a distinct project that Lax invited her to participate in:-\nAnneli invited me to work with her on a professional development seminar on Problems in Mathematics and Its Learning and Teaching\n(\nsponsored by both the\nCourant\nInstitute and the Faculty Resource Network of NYU.\n)\nThe seminars participants were mathematics faculty from Historically Black Colleges and Universities\n(\nHBCU's\n)\n. Anneli was quite eager to initiate conversation with the faculty of HBCU's, to exchange information and views on mathematics education, and to enhance understanding all around of the problems confronting the faculty in engaging their students in mathematics.\nFernandez continues to explain how Lax had a profound influence in shaping her career and ultimately her success today:-\nWhen I first went to the University of Chicago, Anneli wrote, on my behalf, a letter of introduction to Paul Sally who\n(\nwith Diane Hermann\n)\nruns the university's Young Scholars Program\n(\nwhich I subsequently worked in\n)\n. She encouraged me to participate in Project NExT - a program geared toward helping new professors learn about the ins and outs of teaching and research. ... she was a natural 'bridge' to such special experiences, programs and people. She enriched my life.\nPowell, a researcher in American education at New York also worked with Lax in the\n1950\n's. An account of the relationship between Powell and Lax is given based on email correspondence\n[\n12\n]\n:-\n... the Lax name, represented both by her and her husband Peter, was not unfamiliar to me and, for this reason, I felt intimidated by her invitation and overwhelmed by her gracious, warm approach ... I knew that she\n(\nLax\n)\nwas already deeply involved in exploring pedagogical connections between writing and mathematics learning, but could not help but wonder why she wanted to talk to me. I later came to understand that she was attracted to work that emphasised understanding students' thinking. She was also fascinated with the diverse approaches with which mathematics educators employed writing as a tool for students to associate meaning with symbols and as a vehicle for teachers to gain windows into how students think and solve problems.\nLax seems to have had an obvious eagerness to puzzle over new ideas and problematic issues. From this research much of Lax's persona is revealed. Powell goes on to describe Lax's character:-\n... so I began to talk judgementally about some of the approaches\n(\nto teaching\n)\nwith which I did not agree. Anneli quickly let me know that she had no use for that. She was not interested in academic slash and trash. For her, there was value in finding common ground and collaborative projects rather than to dwell on areas of disagreement-which in her opinion prevented educators from working together.\nAnneli loved to hear others' ideas, particularly when they differed from her own. She sought out opposing viewpoints both to sharpen and modify her own ideas, and to change perspective when warranted by compelling evidence ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}