{
  "nome_completo": "Annibale Giuseppe Nicolò Giordano",
  "nome_curto": "Annibale Giordano",
  "ano_nascimento": "1769",
  "ano_morte": "1835",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Giordano/",
  "lugar_nascimento": "Astalonga, San Giuseppe d'Ottajano, Kingdom of Naples (now San Giuseppe Vesuviano,  Italy)",
  "lugar_morte": "Troyes, France",
  "biografia": "Annibale Giordano\nwas the son of Michele Giordano, a doctor at the court of Ferdinando IV\n(\nthe Bourbon ruler\n)\nand doctor to Luigi de' Medici di Ottajano\n(1759\n-\n1830)\n(\nPrince of Ottajano\n)\n, and Maria Gaetana Tenore. He was baptised in the parish church of San Giuseppe in\nSan Giuseppe d'Ottajano. Annibale was the oldest of his parents' five children, having younger siblings Caterina, Michele-Girolamo, Saverio and Luigi. Before giving details of his life, we need to look briefly at events which were taking place which in the end dominated the course of Annibale's life.\nFerdinand IV had become King of Naples in\n1759\n, so that it was essentially under Austrian control. In\n1767\nthe Jesuits\n(\nthe Society of Jesus\n)\nwere suppressed in the Kingdom of Naples\n(\nand in many other countries\n)\n. The Jesuit school in Naples was closed at this time and, in\n1768\n, King Ferdinand IV founded a new Institute, the Casa del Salvatore, in the premises left vacant by the Jesuits.\nNicola Fergola\nbegan teaching philosophy at this school, which was later called the Liceo del Salvatore, in around\n1770\n.\nFergola\nalso founded his own private school in Naples in\n1771\n. This school quickly acquired a high reputation and many of the brightest boys were sent to be educated at Fergola's boarding school. The French entered Naples in\n1799\nand there followed what was essentially a civil war. After the short lived Parthenopean Republic, Ferdinand IV regained control in\n1800\n. However, the French-Austrian war, which broke out in\n1805\n, saw Naples come under French control when French troops occupied the city in\n1806\n. Napoleon Bonaparte installed his brother Joseph as King of Naples. Ferdinand IV was reinstalled as King of Naples in\n1815\nfollowing the Neapolitan War when the Austrian Empire defeated the French controlled Kingdom of Naples. This Austrian victory was resented in Italy and was one of the factors leading to the Unification of Italy. In December of\n1816\nthe Kingdom of Naples and the Kingdom of Sicily combined to form the Kingdom of the Two Sicilies. Giordano, was a strong supporter of the French and this would dominate his life. Let us return, however, to discussing his childhood.\nFrom an early age Giordano showed that he has a great inclination to study and he later related that at by the time he was ten years old he already knew sufficient history, Latin and Greek that his teachers told him that they could not teach him any more. He read the works of Voltaire and Rousseau which encouraged him to support the revolutionary cause. His father, realising that he had an extremely talented son, took him to Naples when he was fourteen years old so that he could study with\nNicola Fergola\nwho had the reputation of being the finest teacher. Giordano showed remarkable abilities in the mathematics that\nFergola\ntaught him and soon began studying on his own, reading\nPappus\n's\nMathematical Collection\n. In\n1788\nhe published the result for which he is still famed today, namely his solution to the following problem:-\nGiven a circle and\nn\nn\nn\npoints of the same plane, inscribe in this circle a polygon whose sides, eventually extended, pass, according to the order specified, through the given points.\nLet us give a few details about this problem. In Book\n7\nof\nPappus\n's\nMathematical Collection\n, this result is proved for the case\nn\n=\n3\nn = 3\nn\n=\n3\nwhere the three points are on a line. For three points in the plane of the circle but not necessarily collinear, it was posed by\nGabriel Cramer\nand solved by\nJohann Castillon\nin\n1776\n. In\n1783\nboth\nLeonard Euler\nand\nNikolai Fuss\ngave simpler constructions for the case\nn\n=\n3\nn = 3\nn\n=\n3\n. Giordano generalised it to any number of points, publishing the result in\n1788\n. In the year it was published the result was discovered independently by\nGianfrancesco Malfatti\n. Giordano's solution appeared in the paper\nConsiderazioni sintetiche sopra di un celebre problema piano e risoluzione di alquanti problem affini\nⓉ\n(\nSynthetic considerations on a famous plane problem and solution of similar problems\n)\nwhich was published in the\nMemoirs\nof the Accademia dei XL\n(\nthe\nNational Academy of Sciences of Italy\n)\n. The president of the Academy,\nAntonio Maria Lorgna\n, inserted the date on which he had received the paper,\n2\nOctober\n1787\n, noting that the author was only sixteen years old. In fact he was seventeen years old when he submitted the paper but the error on the paper only contributed to his fame. We have to note however, that some biographers have been misled by the incorrect age given on the paper and have stated, incorrectly, that Giordano was born in\n1771\n.\nLazare-Nicolas Carnot\nin\nGéométrie de position\nⓉ\n(\nGeometry of position\n)\n(1803)\nwrites:-\nOttajano, at the age of sixteen, found not only an extremely elegant synthetic solution to this problem, but he gave it all possible generality by applying it to the inscribed polygons of any number of sides.\nNow it might be puzzling that\nCarnot\nrefers to Giordano as 'Ottajano'. The reason is that Giordano's name appears on the paper as 'Annibale Giordano di Ottajano' so, in error,\nCarnot\n, and other French writers after him, believed that Giordano's name was Ottajano.\nIn\n1789\nGiordano entered a competition for the chair of mechanics at the newly established Royal Military College Nunziatella. The other strong candidate for this chair was Carlo Giovanni Lauberg who was older and more experienced, being born in\n1762\n. Giordano received a very strong recommendation by\nFergola\nwho wrote that he was \"honoured to have had this young man's friendship for the last four years.\"\nFergola\nlater wrote:-\nWhen I proposed to our Military College, Annibale Giordano, I made known to the French and Upper Italy that he was the greatest and the youngest mathematician taught among us. And by the avoidance of the contest freed this College from Carlo Giovanni Lauberg.\nWith the strong reference from\nFergola\n, Giordano was appointed to the chair of mechanics at the Military College. Lauberg, however, although a competitor for the chair, was a friend with similar political views and the two later collaborated on mathematics as well as embarking on a joint project. Both were strong supporters of the ideas of the French Revolution which began with the storming of the Bastille in July\n1789\n. These ideas began to enter Italy and were important in being influential in the eventual unification of Italy. In\n1790\n, Giordano and Lauberg founded their own school for chemistry and mathematics at No\n2\nVico Giganti, Naples. This school became not only a hotbed of scientific culture, but also a hotbed of revolutionary ideas, which already were spreading here and there throughout the Naples area\n[\n15\n]\n:-\nIn those months Giordano took part in the meetings organised at his home at the Platea della Salata by Eleonora de Fonseca Pimentel, to read the French 'Moniteur' and \"entertain himself in long conversations\" on the evolution of the Grand Nation, where \"a new society, inspired by principles of liberty, democratic equality and people's sovereignty was being restructured.\" The political and cultural influence of the Revolution of\n1789\nfilled the two mathematicians with enthusiasm, so much so that they no longer saw \"well-being outside of freedom of thought, of studies and of actions.\" Thus in a short while the school where \"the theories of the French chemist\n[\nLavoisier\n]\ntogether with Jacobin ideas were being discussed and promulgated\", transformed itself into a place of revolutionary propaganda. It was attended by Mario Pagano, Emmanuele De Deo, Francesco Lomonaco, Ettore Carafa and many others destined to become the first Neapolitan Jacobins. In May\n1792\nLuigi de Medici, ruler of the Gran Corte della Vicaria \"that is to say head of the judicial police and politics of the Kingdom of Naples\", prince of Ottajano, friend and protector of Giordano's family, became \"primo accademico protettore\".\nIn\n1792\nGiordano and Lauberg had\nPrincipj analitici delle matematiche di Annibale Giordano e Carlo Lauberg\nⓉ\n(\nAnalytical principles of the mathematics of Annibale Giordano and Carlo Lauberg\n)\npublished by Gennaro Giaccio in Naples. The work was in two volumes, the first being\nAritmetica\nand the second being\nGeometria\n. The first volume begins with a preface entitled \"To the reader\" which begins:-\nThe state of human knowledge has received proportional improvement, which has been made simpler by the deep research of man. So it is, that Philosophy being promoted happily in recent times, we have looked at those parts in which so many classes of phenomena are connected to each other by analytic order, so starting from the simplest ideas, they are finally reduced to expressions, and very general formulas. So we must consider in the rigorous and exact sciences, how many of these are primitive ideas, how many these are phenomena, or conventions, from which, for a necessary link, they can deduce all the other phenomena of the same kind, which finally lead us by degrees to the most general knowledge. Mathematics being of this kind, is not in effect, having the development of simple ideas constituting the ideas of different magnitudes we know, and of some of our primitive conventions above them. From this point of view it is also worthwhile to regard Physics, which has been known to be nothing else but the generalization of phenomena, which result from the activity of matter; and not that collection of substances, and of quality, which only served to teach us words with no ideas at all. Metaphysics, which seemed so far from this perfection, thanks to the combined efforts of great men saw the dissipation of that thick haze in which the schools had enveloped it: It can be reduced to two very extensive branches, the first of which having man as its object, includes the history of our ideas; and the second, which concerns other objects, is the series of those few corollaries, which derive from the most general physical laws, known under the name Cosmological law. Finally Morality is regarded as the analysis of the affections grown by our need and of the means to manage them; and Politics is restricted only to the problem of satisfying our public needs. Then if Physics, if Metaphysics, Morality, Politics are nothing else than the analysis of the effects of the activity of matter, of the sensibility of man, and of the direction of this sensibility in relation to the need of this latter, just as mathematics is the analysis of quantities, being this an exact science, the first should also be regarded as such and in the correct point of view.\nIn what follows we follow\n[\n15\n]\nfairly closely.\nIn December of\n1792\na French fleet led by admiral Louis de Latouche-Tréville arrived in Naples following the non-recognition by the Bourbon court by the French Republic and its ambassador. The ships, which had arrived in the Kingdom of Naples on the\n16\nth of December, at the moment of their departure to France, were forced to delay their return until the\n29\nth of January\n1793\nbecause of a large storm. This forced break transformed itself into an opportunity for contacts between the Jacobin admiral and the Neapolitan patriots. Of the many that came on board the \"Languedoc\", Latouche-Tréville's ship, were Antonio Jerocades, Giuseppe Cestari, Lauberg and Giordano, with his brother the lawyer Michele-Girolamo. Up to this time it appears that Giordano was simply looking to transform the monarchy but this meeting with the French turned his ideas into more extreme ones. Lauberg, Giordano and his brother became, from that time on, ardent Jacobins. This became evident in August\n1783\nwhen, at the so-called supper of Posillipo, on the model of the Masonic lodge, a secret patriotic society was born. This prompted Giordano to establish, on\n29\nJanuary\n1794\n, the central club of the Jacobins, which quickly split in two: the Romo\n(\nrepubblica o morte - republic or death\n)\npresided over by Andrea Vitaliano and the Lomo\n(\nlibertà o morte - liberty or death\n)\nwhich, led by Giordano together with Rocco Lentini, was proposing to achieve liberty with a reform of the monarchy into a representative body. But already on the\n21\nMarch the double agent Donato Froncillo revealed the conspiracy: in the immediate reaction by the Bourbons, sixty-five young conspirators were arrested, and among them the Giordano brothers who were imprisoned in the tower of Castello dell'Ovo. They tried to escape between the\n3\nrd and\n4\nth of September. While Michele-Girolamo succeeded in his attempt, Giordano was wounded and re-captured on that same night. Simioni writes\n(\nsee\n[\n2\n]\n)\n:-\nTaking advantage of a dark night, and broken the bars on the prison, they had climbed down by means of many sheets to the foot of the castle. Michele-Girolamo throwing himself to swim, managed to reach, it seems, a boat waiting for him offshore, and to save himself; Annibale, however, fell badly, fainted, and was found injured in the first light of dawn by the guards. He was immediately locked up safely in the castle dungeon. Later documents show us that the escape was encouraged by their father ... with the complicity perhaps of the commander of the fort, who was arrested and suspended from his position.\nThus began a process that, on\n19\nSeptember\n1794\n, sentenced Giordano to serve twenty years on the island of Pantelleria which was later changed to the Castello dell'Aquila. The sentence sent Emmanuele De Deo, Vincenzo Galiani and Vincenzo Vitalini to the gallows. Head of the courthouse was Luigi de Medici who had raised Michele-Girolamo and Annibale Giordano in his home. Because of this friendship and the Giordanos being treated more lightly than the others, Luigi de Medici\n(\ndisliked in particular by his enemy, the minister John Acton\n)\nwas suspected of collusion with the Jacobins, was himself arrested and made a prisoner in the fort of Gaeta until\n1798\n.\nFor the account of these events as related in\n[\n4\n]\nsee\nTHIS LINK\n.\nMuch has been discussed about Giordano's role in those months. Numerous sources indicate him to be one of the most active informers of the conspirators and Colletta described him as\n[\n3\n]\n:-\n... professor of mathematics, eminent for his intellect, evil by nature, used and well-received in the Medici's house.\nGiordano's role was much reconsidered by Amodeo\n(\nwho even earlier, in the essay\nCarlo Lauberg ed Annibale Giordano\nⓉ\n(\nCarlo Lauberg and Hannibal Giordano\n)\n, written with B Croce, had talked about the \"notable double betrayal of Giordano\"\n)\nand his collaborator Silvio Cola in\n[\n10\n]\n. According to these authors the only victim of Giordano's informing was the same Medici, objective of an action aiming to secure for justice \"the most cunning of the conspirators\", that did not hesitate to send some young lives to the gallows in order to save his own life. The two authors of the\nRiabilitazione\nⓉ\n(\nRehabilitation\n)\ncame to ask themselves why blame Giordano when in fact he\n[\n10\n]\n:-\n... aimed to save the life of many of his companions with similar beliefs.\nThis hypothesis is appealing, but other witnesses like Simioni, who claimed the number of those denounced by Giordano in the depositions he gave after his arrest were\n259\n, cannot be ignored. In any case Giordano spent four years in prison, until December of\n1798\nwhen the French troops led by general Philibert-Guillame Duhesme conquered L'Aquila. It was his brother, Michele-Girolamo, who had joined the French after his escape from Naples, who freed him. Then, following general Jean-Étienne Championnet, Giordano\n[\n17\n]\n:-\n... came to Naples on\n23\nJanuary\n1799\nand was seen in the Toledo district on a horse, armed and with the three-coloured feather on his hat.\nHere he actively engaged in the life of the Republic proclaimed by the Neapolitan patriots on\n21\nJanuary\n1799\n. He was in charge of the military committee, member of the Council of War and of the revolutionary committee, then head of accounting for the navy. He fought in the legion of Gabriele de Manthoné. With the approach to Naples of the Sanfedist army of Cardinal Fabrizio Ruffo di Calabria, he retreated, along with other \"patriots\", to Castelnuovo, to attempt a last desperate resistance. With their capitulation, his name was among those who were to be exiled. He embarked on one of the\n14\nPolish ships moored in the port, ready to sail to Toulon, France, but he returned, on\n3\nAugust, forced to land and was taken with a chain around his neck to the castle of Carmine. This followed the Bourbon family's failure to comply with the agreements of capitulation. It has then been written by Colletta that, having found himself in a prison cell with eighteen others\n(\namong whom were Francesco Mario Pagano, Domenico Cirillo and Giuseppe Albanese\n)\n, Giordano organised an escape plan anew which was however foiled\n[\n3\n]\n:-\n... towards the end of their work when they were already rejoicing at the hope of freedom.\nOn\n27\nJanuary\n1800\nthe state council, with the king's approval, sentenced Giordano to death. De Nicola, when reporting the news in his\nDiario\n[\n6\n]\n, presented a brief profile of Giordano:-\n... he was the first to be arrested when talks about Jacobinism began to be heard among us, and in his house they held Glub\n[\nGiordano\n]\nin the name of the Accademia di Chimica. He escaped from the castle, was then the cause of Luigi de Medici's arrest, and now pretends to be crazy in the castle.\nNevertheless, the execution of Giordano, set for\n1\nFebruary\n1800\n, did not take place and was changed to imprisonment on the island of Favignana instead, where he remained until July of\n1801\nwhen, following the Luneville treaty between Napoleon and Ferdinand IV, freedom was granted to all political prisoners.\nThose responsible for the failed attempt of a jailbreak have never been identified with certainty\n(\nPietro Calà Ulloa in the\nAnnotamenti\nⓉ\n(\nRecordings\n)\nto Colletta\n[\n1\n]\nconsidered the attempted escape to be fiction\n)\n, neither were the reasons for the failure to carry out the death sentence given to Giordano ever clarified. Again Colletta sketched a probable scenario of the events by writing that it was\n[\n3\n]\n:-\n... the two prisoners, the same Annibale Giordano, expert in betrayals, and Francesco Bassetti, general of the republic, who revealed the advanced escape plan to the head of the fort in exchange for their freedom. And in fact, seventeen men suffered the cruellest fate: the two lived an infamous life, that of Bassetti was short, while Giordano's was long but not miserable.\nAlso Francesco Lomonaco defined the two as\n[\n7\n]\n:-\n... the only cowards who indulged and discovered the hidden patriots.\nAmodeo and Cola, who did not find any appropriate documents \"to shine a light on this point\", have instead supported the \"view that is held in Giordano's native country\"\n(\nbased on N Cottet's praise of Giordano\n[\n5\n]\n)\n, that Giordano was saved by direct intervention of the queen Maria Carolina\n[\n10\n]\n:-\n... lover of Annibale's father.\nTelesio considered this hypothesis to be unreliable and thought-up by Cottet, whom he holds to\n[\n9\n]\n:-\n... have fantasized all night long, and have written in the morning with a confused mind a whole lot of rubbish.\nIn any case, Giordano's last years were never really \"miserable\". He lived \"respected and honoured\" in France, where his brother Michele Girolamo had joined him; in\n1824\nhe was naturalised and assumed the surname Jourdan. He was surveyor at the real estate registry in the Department of Aube until his death on the\n13\nMarch\n1835\n.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}