{
  "nome_completo": "Annibale Comessatti",
  "nome_curto": "Annibale Comessatti",
  "ano_nascimento": "1886",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Comessatti/",
  "lugar_nascimento": "Udine, Austrian Empire (now Italy)",
  "lugar_morte": "Padua, Italy",
  "biografia": "Annibale Comessatti\n's parents were Pietro Comessatti and Amelia de Poli. Annibale attended the classical school in Udine and graduated with his baccalaureate in\n1904\n. In the same year he entered the University of Padua where he studied pure mathematics, taught by a number of excellent teachers including\nGregorio Ricci-Curbastro\n,\nTullio Levi-Civita\n,\nGiuseppe Veronese\n, and\nFrancesco Severi\nwho was appointed to Padua in\n1905\nwhen Comessatti was in his second year of study\n[\n8\n]\n:-\nHis natural inclination for geometrical studies led him towards\nSeveri\n, whose lessons, so full of brilliant ideas, had a special charm for him, determining his scientific orientation which was to dominate the whole of his research and teaching.\nComessatti began publishing articles quite early on in his university career:\nUna dimostrazione della formula di Meissel\nⓉ\n(\nA demonstration of the formula of Meissel\n)\n(1906)\n,\nDi una generazione del complesso tetraedrale\nⓉ\n(\nOn a tetrahedral complex generation\n)\n(1907)\nand\nSulla dispersione dell' energia nel campo elettromagnetico generato dalla convenzione di una o due cariche\nⓉ\n(\nOn the dispersal of energy in the electromagnetic field generated by the group of one or two charges\n)\n(1908)\n. His research advisor was\nSeveri\nand he was awarded his laurea, with the highest level of distinction, in\n1908\nhaving submitted his thesis\nSulle curve doppie di genere qualunque e particolarmente sulle curve ellittiche doppie\n. His thesis, published in\n1909\n, was a comprehensive study on algebraic curves containing irrational involutions of the second kind and order\np\n≥\n1\np ≥ 1\np\n≥\n1\n.\nIn\n1908\n, after graduating, Comessatti was appointed as\nSeveri\n's assistant at the University of Padua. He held the position of assistant in Descriptive Geometry, Analytic Geometry and Projective Geometry for twelve years. He continued to published memoirs of fundamental importance, perhaps the most significant in these early years being\nSulle superficie razionali reali\nⓉ\n(\nOn the real rational surface\n)\n(1911)\n, in which he established a classification real rational surfaces into three families,\nFondamenti per la geometria sopra le superficie razionali dal punto di vista reale\nⓉ\n(\nBasics of the geometry of the rational surface from the real point of view\n)\n(1912)\n, and\nSulla connessione delle superficie razionali reali\nⓉ\n(\nOn the real rational surface\n)\n(1914)\n. These last two papers are the studied by Francesco Russo in\n[\n4\n]\nwhere he gives some interesting results which are all essentially present in Comessatti's papers published almost\n100\nyears earlier. Russo explains that\n[\n4\n]\n:-\n... ideas introduced by Comessatti in the fundamental papers 'Fondamenti per la geometria sopra le superficie razionali dal punto di vista reale'\nⓉ\n(\nBasics of the geometry of the rational surface from the real point of view\n)\n(1912)\n, and 'Sulla connessione delle superficie razionali reali'\nⓉ\n(\nOn the connection of the real  rational surface\n)\n(1914)\ncan be applied to get a classification of real del Pezzo surfaces in an elementary and unitary way by using projective methods and ... they furnish a description of the geometry of this class of surfaces: number of real lines, topological form of the real part, minimal models over\nR\n\\mathbb{R}\nR\n. Comessatti studied real algebraic surfaces, which are rational over\nC\n\\mathbb{C}\nC\n, by representing on the complex projective plane the conjugation naturally associated to them and by defining in this way an antirational involution of the plane. Comessatti's point of view was essentially birational ...\nIn\n1914\nComessatti was given the title of lecturer in Descriptive Geometry after writing twelve papers in the six years following the publication of his thesis. Of course, the year\n1914\nwas the one in which World War I broke out but, shortly after hostilities began on\n3\nAugust, Italy declared that it would not commit troops to the fighting. This was despite having an alliance with Germany and Austria-Hungary. Italy revoked this alliance on\n3\nMay\n1915\nand later that month declared war on Austria-Hungary. In July\n1915\nComessatti was called up for military service and spent most of the war years in the zone where fighting was most intense. He served as an artillery officer and, in May\n1916\n, he was with\nSeveri\nin the Val Lagarina area when the Austrians attacked with a well planned advance. The Italians fought with determination for several days and, although falling back, continued to put up a spirited resistance.\nSeveri\nwrites\n[\n6\n]\n:-\nWe were comrades in Vallagarina and Comessatti sought for himself the most risky places, not as a gunner, as he had begun, but as a bomber.\nComessatti was awarded two military crosses for bravery for his service during World War I. He was released from military service in January\n1919\nand was able to return to his positions at the University of Padua.\nHe entered the competition for the chair of Algebraic Analysis and Analytic Geometry at the University of Cagliari and, having been successful, was appointed in\n1920\n. He continued to enter competitions for chairs and, in\n1922\n, was declared the winner of the competition for the extraordinary chair of Projective Geometry and Descriptive Geometry at the University of Parma. He was also appointed to the chair of Analytic Geometry and Projective Geometry at the University of Modena. During the year\n1922\n-\n23\nhe was called to the extraordinary professorship in Descriptive Geometry and its Applications at the University of Padua. In the same year he was appointed to a full professorship in Descriptive Geometry and its Applications then, later in the same year, he was appointed to the Chair of Analytic and Projective Geometry. He continued to hold this chair in Padua for the rest of his life, but during the years\n1924\n-\n27\nhe taught analytic geometry, additional mathematics, and higher geometry at the University of Ferrara. He also taught geometry courses at the University of Bologna during the years\n1937\n-\n39\n. One of his best students at Padua was\nUgo Morin\nwho, after studying with Comessatti, graduated in\n1926\nand then served as Comessatti's assistant at Padua.\nIn\n1924\nhe published\nSulle varietà abeliane reali\nⓉ\n(\nOn  real Abelian  varieties\n)\nfollowed by another major paper on the topic of abelian varieties in the following year. These papers contain remarkable results. He introduced the notion of a \"\nGalois\ncurve\" in two papers with the title\nSulle curve di Galois\nⓉ\n(\nOn  Galois curves\n)\nin\n1929\n. This allowed him to establish close relations between ideas he had studied in the theory of algebraic curves and\nGalois theory\n. In these papers he gave interesting applications designed to illustrate both the general theory but also gave some particular examples. In the same year he published\nSulle riemanniane algebriche\nⓉ\n(\nOn algebraic Riemannians\n)\n,\nCurve algebriche e funzioni fuchsiane\nⓉ\n(\nAlgebraic curves and Fuchsian functions\n)\nand\nStudi sulle equazioni differenziali fuchsiane di genere zero\nⓉ\n(\nStudies on Fuchsian differential equations of genus zero\n)\n.\nAngelo Tonolo describes Comessatti's skills as a teacher in\n[\n8\n]\n:-\nAs a teacher he was authoritative and tireless; he understood the fine art of teaching and he had great teaching skills. His teaching in the first two years, which is common to all engineering students and those aspiring to scientific degrees, gave a balanced approach to meet the needs of the one or the other. He was deeply convinced, and on several occasions argued strongly, that young people must study in schools of engineering with a strong culture of mathematics, so that they are in the position of being able to explore the varied and complex problems with techniques of a rational and clear form. He took a firm stand against those currents which, unfortunately, for some time have been forced on Universities and Colleges, under the pretence that they must give up their rigorous methods and scientific approaches, to replace them by only preparing young people to practise different professions.\nIn\n1930\n, Comessatti published the first of two volumes of his textbook\nLezioni di Geometria Analitica e Proiettiva\nⓉ\n(\nLessons on analytic and projective geometry\n)\n. Virgil Snyder, in his review of the work, looks at the very Italian approach taken by Comessatti in this textbook which is essentially the lecture notes for his lectures to first and second year students\n[\n7\n]\n:-\nThe present volume, most of which had been used repeatedly by the author in mimeograph form previously, represents the work done in algebraic and projective geometry by the Italian university students during the first and second years. Probably no other country adheres so closely to the old Greek methods, nor guards so jealously the rich and varied traditions of its past. And in the present case, without forfeiting anything of this heritage, the book is decidedly down to date, not only in content, but also in method. ... The work is written in the peculiar limpid style of Comessatti, and is printed on thin opaque paper, making a convenient volume. One objection is that the exercises are printed in small type - pages of them at a time - and contain a wealth of valuable material that one cannot afford to overlook. This book would not be a suitable text for beginners in either analytic or projective geometry, according to the American methods of instruction, but is particularly valuable for reference and comparison after one has reached the maturity necessary to appreciate it. It is an eloquent commentary on the intense instruction given to the precocious Italian youth.\nThe second of the two volumes was published in\n1931\nand Comessatti later prepared a second edition which appeared in\n1941\n(\nVolume\n1)\nand\n1942\n(\nVolume\n2)\n.\nHowever, he also used the depth of his research experience to give advanced courses intended for those with a specialist interest in pure mathematics\n[\n8\n]\n:-\nIn advanced courses intended for pure mathematicians, gave the treasures of his vast erudition, changing the topic every year, or giving it a different treatment, trying to impart knowledge to his students of the many vast fields of algebraic geometry and to inspire in them the desire for more knowledge and encouraging them to undertake their own research. Taking every new attitude of scientific thought, he brought to the school the most recently contributed methods after subjecting them to a deep personal reflection. His lessons were so carefully prepared, so full of thought and so rich in content. He expounded them with a clarity of style that would have been suitable for writing up and publishing, the concepts were so clear, deductions so precise, and the level so correct.\nIn\n1938\n, on the occasion of the centennial of the first meeting of Italian scientists\n(\nwhich had been held in Pisa in\n1838)\n, the Italian Society for the Progress of Science\n(\nSocietà Italiana per il Progresso delle Scienze\n)\nreviewed a century of Italian scientific progress. Annibale Comessatti was president of the Mathematics Section. This was at a time when Italy was gripped by Fascism. The Italian Fascist movement had started around\n1921\nas a nationalist movement. Led by Benito Mussolini, the Fascists came to power in\n1923\nand adopted racial policies. Several of the mathematicians at Padua were very active opponents of Fascism, including\nUgo Morin\n, Comessatti's student and later his assistant. Comessatti, however, seems to have been seduced by Fascism for he wrote in an article for the Società Italiana per il Progresso delle Scienze reviewing a century of Italian mathematical progress:-\nThe effective force of tradition acts with historical inevitability when, just as in the case of the Italian geometric school, that tradition is grafted onto its distinguished race qualities, creating a type of thought which is the precious heritage of intellectual autarchy.\nIn\n1943\nComessatti published the survey article\nProblemi di realtà per le superficie e varietà algebriche\nⓉ\n(\nExistence problems for surface and algebraic varieties\n)\nwhich looked at properties of algebraic varieties over the real field, regarded as constructs on the similarly defined varieties over the complex field. The paper contains a summary of Comessatti's long list of results for rational surfaces.\nHe was awarded the gold medal of the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\nin\n1926\n, he was elected to the\nAccademia dei Lincei\nin\n1935\nhaving been awarded their Feltrinelli award two years earlier. He was also elected to the Accademia delle Scienze di Torino, the Accademia di Padova, the Istituto  Lombardo, the Istituto Veneto, and the Société royale des Sciences of Liège.\nComessatti was married and had one daughter. He was described as loyal and open, lively in thought, and vigorous in discussions. However, he was easy to anger, sometimes engaging in violent arguments, but was always ready of forgive and retained no trace of resentment after an argument. He enjoyed welcoming friends to his home where his wife and daughter helped to add warmth and joy to the long evenings. He would often entertain his guests by playing a Beethoven symphony on the piano. Sadly his daughter died at the age of eighteen on\n11\nSeptember\n1942\n. This tragic loss hastened a decline in Comessatti's health but he was determined to continue teaching and, after he became so ill that he could not go to the university, he still had students come to his home for lessons.\nAfter his death he is remembered with the naming a road in Udine the Via Annibale Comessatti. On\n26\nApril\n1947\na commemoration of Comessatti's life and work was held in the University of Padua. It was led by his famous pupil\nUgo Morin\nand his wife and relatives were present as well as Angelo Tonolo, representing the\nItalian Mathematical Union\n, and\nBeniamino Segre\n, representing the Rector of the University of Bologna. The affection for Comessatti was shown by the many friends, alumni and students from the University of Padua who attended. The article\n[\n8\n]\nis based on Angelo Tonolo's address on that day.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}