{
  "nome_completo": "Antoine-André-Louis Reynaud",
  "nome_curto": "Antoine-André-Louis Reynaud",
  "ano_nascimento": "1771",
  "ano_morte": "1844",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reynaud/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Antoine-André-Louis Reynaud\n's father was a lawyer in the parliament in Paris. Reynaud was attracted to literature when he was young and he wrote a number of plays.\nReynaud lived through a time of great political upheaval in France since he was\n17\nyears of age when the storming of the Bastille took place in\n1789\n. He was attracted to the principles of the Revolution and, in\n1790\n, he was made a Capitaine au Régiment d'Elèves. He wanted to make a career for himself in the military, and his joining the National Guard, a strongly republican branch of the military, in\n1792\nshows that at this stage he was on track with his aims.\nThe direction of Reynaud's career was changed, however, through pressure by his family who persuaded him to give up his military aspirations in favour of a career as an accountant. For four years, until\n1796\n, he worked as an accountant but his heart was never in the occupation and he would spend his evenings studying mathematics.\nIn\n1796\nReynaud gave up his accountant job and entered the École Polytechnique in Paris. He studied mathematics there and graduated in\n1796\nas the top student of his year. As many other mathematicians of this period he was assigned to the Corps des Ponts et Chaussés but allowed to study mathematics for a third year at the École Polytechnique.\nIn\n1800\na school was founded to prepare pupils for entry to the École Polytechnique and Reynaud began teaching mathematics at the school, although he received no salary for this post. He also taught at a Lycée and, in\n1804\n, he was appointed to a teaching post in the École Polytechnique.\nReynaud was to hold a variety of different posts. He headed the land survey of France in\n1806\n, while he was appointed admissions examiner at the École Polytechnique in\n1809\n. Between\n1808\nand\n1811\nhe assisted\nde Prony\nwith the mechanics course and, from\n1812\nto\n1814\nhe replaced\nPoinsot\non the analysis course.\nCauchy\nbegan to teach this course from\n1815\n.\nAlthough strongly republican in views in his youth, Reynaud became more liberal in his views and from\n1814\nhe supported Louis XVIII.\nReynaud published a number of extremely influential textbooks. He published a mathematics manual for surveyors as well as\nTraité d'algèbre, Trigonométrie rectiligne et sphérique, Théorèmes et problèmes de géométrie\nⓉ\n(\nTreatise on algebra, linear and spherical trigonometry, geometric theorems and problems\n)\nand\nTraité de statistique\nⓉ\n(\nTreatise on statistics\n)\n. His best known texts, however, were his editions of\nBézout\n's\nTraité d'arithmétique\nⓉ\n(\nTreatise on arithmetic\n)\nwhich appeared in at least\n26\nversions containing much original work by Reynaud.\nIt appears that Reynaud became interested in algorithms when he was working with\nde Prony\n. At this time\nde Prony\nwas very much involved in trying to get his logarithmic and trigonometric tables published and it seems to have made Reynaud think about analysing algorithms. Certainly Reynaud, although his results in this area were rather trivial, must get the credit for being one of the first people to give an explicit analysis of an algorithm, an area of mathematics which is of major importance today.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}