{
  "nome_completo": "Antoni Maria Emilian Hoborski",
  "nome_curto": "Antoni Hoborski",
  "ano_nascimento": "1879",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hoborski/",
  "lugar_nascimento": "Tarnów, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Sachsenhausen, Emsland, Germany",
  "biografia": "Antoni Hoborski\nwas the son of Antoni Hoborski\n(\ndied\n1891)\n, a Polish lieutenant colonel in the Austrian army, and Maria Mühldorf\n(\ndied\n1930)\n, who was from a German family. Let us comment at this point that, although we have listed Antoni Hoborski's place of birth as Tarnów, Poland, in fact Poland had been partitioned in\n1772\nand from that time until\n1918\n, Tarnów was in Austrian Galicia.\nHoborski studied at the\n1\nst Junior High School in Tarnów, showing extraordinary mathematical abilities, and graduated in\n1897\n. Later that year he began his studies of mathematics and physics at the Jagiellonian University in Kraków. The Jagiellonian University was beginning a period of strength in mathematical studies at that time beginning with the appointment of Kazimierz Zorawski who had been a student of\nSophus Lie\n. He had\nhabilitated\nat the Jagiellonian University in Kraków in\n1893\n, and after a short period in Berlin, he had returned to the Jagiellonian University where he was named extraordinary professor on\n1\nMay\n1895\n. He was promoted to ordinary professor of mathematics in\n1898\nand, in\n1900\n,\nStanisław Zaremba\nwas also appointed as professor at the Jagiellonian University; together Zorawski and\nZaremba\nbuilt a major school of mathematics.\nAt the Jagiellonian University, Hoborski was taught by a number of excellent academics. He was taught differential and integral calculus by Franciszek Michał Karliński\n(1830\n-\n1906)\nwho was the director of the Astronomical Observatory of the Jagiellonian University from\n1862\nto\n1902\n. Hoborski took courses on analytical geometry and on algebraic equations given by Stanisław Kepiński\n(1867\n-\n1908)\n. In\n1892\n, Kepiński had obtained his habilitation at the Jagiellonian University as an assistant professor of mathematics having submitted the dissertation \"On integrals of the solution of ordinary linear homogeneous differential equations of the second order\". Hoborski also participated in a seminar with Kazimierz Zorawski and took courses from him on the theory of transformations, on partial differential equations, on the theory of functions and on differential geometry. His studies of physics involved classes in experimental physics and a seminar conducted by August Witkowski\n(1854\n-\n1913)\n, who had studied with\nGustav Kirchhoff\nand\nLord Kelvin\n, and Władysław Natanson\n(1864\n-\n1937)\nwho was head of theoretical physics at Kraków from\n1899\nto\n1935\n.\nBecause Hoborski expected to have to become a school teacher, he also took courses on applications of psychology to pedagogy and attended a philosophical seminar with Teofil Ziemba\n(1847\n-\n1900)\n. Ziemba applied psychology to biographical studies and was an expert on the Polish poet and essayist Adam Mickiewicz. Hoborski also attended a seminar on research methodology in the history of exact sciences with the physicist, astronomer and historian of science Ludwik Antoni Birkenmajer\n(1855\n-\n1929)\n. During his first three years as an undergraduate, Hoborski considered himself to be Zorawski's student but after\nZaremba\nwas appointed in\n1900\nhe took his courses and\nZaremba\ntook over as his advisor.\nZdzisław Pogoda tells us of other activities that Hoborski took part in while he was an undergraduate\n[\n24\n]\n:-\nDuring his time as an undergraduate, Hoborski not only studied hard, he also took an active part in student life. Stanisław Gołąb tells us that it was Hoborski who significantly contributed to the reactivation of the Jagiellonian University Mathematics Society. This Society had been established in\n1893\nand its goal was for students to work through tasks together, discuss mathematics they were working on, and organise meetings at which students presented papers they had prepared. A few years after its establishment, the activity of the Society practically ceased, and in\n1900\nHoborski managed to encourage many students to become active members. At the end of November, on the\n28\nth to be precise, the general meeting was held. Hoborski was elected chairman and held this position for two terms until\n1902\n. During this time he gave many lectures. During Hoborski's leadership, the Society began to be interested in publishing textbooks. There was a problem with printing because there was a lack of funds, but lithographs could be prepared. The matter was important because there was a severe lack of materials in Polish ...\nAlthough he would have wanted to become a university lecturer, there were only very limited openings in that area so Hoborski aimed to begin his career as a High School teacher. After the award of his degree in\n1901\nhe worked for his teaching qualification while, at the same time, teaching in a school in Kraków. On\n28\nMay\n1902\nhe submitted an application to take the examinations to qualify as a teacher of mathematics and physics. The Examination Committee approved his application and set him the task of preparing two dissertations, one on mathematics and the other on physics. For both the Committee gave him the topic: for mathematics it was \"Explain the Neumann and Robin methods of integrating\nLaplace\n's equation for convex surfaces\" and for physics it was \"Explain the theory of the motion of light in absorbing media.\" He was given six months to complete the tasks but it actually took him eight months since he had been given a heavy teaching load at the school where he was employed. After his two dissertations were accepted, he then had to take written examinations which lasted eight hours and also have oral examinations in which he was questioned on eight different topics. As if that was not enough, he also had to sit examinations to prove his competence in both the Polish and the German language.\nWhile working towards his teaching qualification, Hoborski had been teaching in Kraków. Over the next few years he taught mathematics and physics in High Schools in several different towns, spending around one year in each. From Kraków he went back to his hometown of Tarnów, about\n35\nkm east of Kraków, then to Jasło, south east of Tarnów before making a move to Brzezany which was then in Galicia but is now in Ukraine. This was his only move out of the Kraków area since he next taught in Nowy Sacz south of Tarnów, then in\n1907\nhe returned to teach in Kraków at the\n5\nth Junior High School. During these years as a school teacher, Hoborski was aiming at a doctorate and he read extensively. Of course he taught during the day and so his studying mostly took place in the evenings. At this time the accommodation he lived in was poorly lit and over time his eyesight deteriorated. Determined to succeed, he persevered and made the move back to Kraków in\n1907\nso that he might be near the Jagiellonian University where he could be advised by Stanisław Zaremba.\nWe note at this point that Antoni Hoborski married Apolonia Kowalska in\n1905\n.\nHoborski wrote the doctoral dissertation\nIntégration de l'équation différentielle aux dérivées partielles:\n∂\nV\n∂\nt\n=\n∂\n2\nV\n∂\nx\n2\n+\n∂\n2\nV\n∂\ny\n2\n\\large\\frac{\\partial V}{\\partial t}\\normalsize = \\large\\frac{\\partial ^2 V}{\\partial x^2}\\normalsize +\\large\\frac{\\partial ^2 V}{\\partial y^2}\n∂\nt\n∂\nV\n​\n=\n∂\nx\n2\n∂\n2\nV\n​\n+\n∂\ny\n2\n∂\n2\nV\n​\nⓉ\n(\nIntegration of the differential equation with partial derivatives: ∂V / ∂t = ∂\n2\nV / ∂x\n2\n+ ∂\n2\nV / ∂y\n2\n)\nand after the necessary examinations in May and June of\n1908\n, he graduated on\n26\nJune\n1908\n. A doctorate was, however, only the first part of what he required to become a university teacher so he applied for funding from the Osławski foundation to allow him to make a two year trip abroad. The Osławski foundation was established by Wiktor Osławski, who was born in Galacia but spent most of his life in Paris. He left money to the Jagiellonian University of Kraków and to the University of Lviv, but also set up the Academy of Arts and Sciences to provide scholarships for graduates of both these universities. Hoborski spent one year in Paris and the following year in Göttingen, these being the two leading centres for mathematics in the world at that time. He attended lectures by the leading mathematicians of the day, including\nGaston Darboux\n,\nJacques Hadamard\n,\nÉdouard Goursat\n,\nÉmile Borel\nand\nÉmile Picard\nin Paris, and\nDavid Hilbert\n,\nFelix Klein\nand\nEdmund Landau\nin Göttingen. While in Paris, he had been awarded a bachelor's degree in mathematics from the Sorbonne in\n1909\n. From all these outstanding mathematicians, the greatest influence on Hoborski came from\nHilbert\n, particularly his course on integral equations.\nAfter these two years abroad, Hoborski was in a good position to prepare for his habilitation. Back in Kraków he resumed his teaching position at the\n5\nth Junior High School. In\n1911\nhe began giving lectures at the Jagiellonian University on descriptive geometry and number theory. He applied to be examined on\n24\nMay\n1912\nand gave his habilitation lecture\nOn a certain application of the principle of least value\non\n15\nJuly of that year. Approved by the Ministry of Education in Vienna, he began his university career as a docent at the Jagiellonian University of Kraków on\n1\nOctober\n1912\n.\nThere was a move to set up a Mining Academy in Kraków and an Organising Committee had been set up in April\n1913\nto appoint professors. In\n1914\nHoborski was appointed as Professor of Mathematics at the Mining Academy but plans to open the new Academy on\n1\nOctober\n1914\nhad to be put on hold when Austria-Hungary declared war on Serbia on\n29\nJuly\n1914\nand World War I began. During the war, Hoborski continued to teach at the Jagiellonian University and at the\n5\nth Junior High School. Two of the pupils at the High School, Stanisław Gołąb and Tadeusz Franciszek Piech\n(1901\n-\n1990)\n, both showed outstanding mathematical abilities. Hoborski quickly saw this and arranged that every Sunday they would come to his home and receive several-hour-long lessons in higher mathematics. Both would continue to be strongly supported by Hoborski through their university studies and they became professors at the Mining Academy.\nWhen World War I ended in\n1918\n, Poland regained its independence. This was very pleasing to Hoborski who, despite having a father in the Austrian army and a German mother, had always been a patriotic Pole. Moves to open the new Mining Academy restarted\n[\n39\n]\n:-\nWhen Poland regained its independence in\n1918\n, the Organising Committee of the Mining Academy in Kraków recommenced its work. On April\n8\n,\n1919\n, the Council of Ministers put forward an official motion to establish and open the Mining Academy in Kraków. On May\n1\n,\n1919\n, the first six professors of the Mining Academy were appointed. On October\n20\n,\n1919\n, Józef Piłsudski officiated at a celebratory inauguration of the Mining Academy in the main hall of the Jagiellonian University.\nThe professors met in June\n1919\nand elected Hoborski, the Professor of Mathematics, as dean of the Faculty of Mining. Stanisław Płużański was appointed as the first rector of the Academy but never took up the position and, from\n1\nJuly\n1919\n, Hoborski performed the duties of rector. Although the Mining Academy began teaching students in\n1919\n, it did not have any buildings and teaching took place in the Jagiellonian University. This, however, was a difficult time with the Polish-Soviet war taking place. Students from the Mining Academy participated in the war. Hoborski described the events\n[\n39\n]\n:-\n... our youth submitted to voluntary conscription, which I witnessed; then, on the\n19\nth day of July\n1920\n, they all went to their camps\n(\nonly six were deemed unfit for military service\n)\n.\nAnother event which followed Polish independence was the founding of the\nPolish Mathematical Society\nin\n1919\n. Hoborski was one of sixteen mathematicians who are listed as founder members of the Society.\nIn\n1922\nconstruction began on the buildings for the Mining Academy with Hoborski, still in the role of rector, chairing the Committee for the Construction of the Mining Academy Building. He continued lecturing at the Jagiellonian University and could have accepted an offer as Chairman of the Department of Mathematics, but he chose to remain faithful to the Mining Academy\n[\n31\n]\n:-\nIn\n1922\n, he received the title of professor at the Jagiellonian University, and in\n1925\nhe was offered the Chair of Mathematics at the same university. He refused to accept this offer, however, not wanting to abandon the Mining Academy. In the role of professor, he continued his teaching activities at the Jagiellonian University, lecturing on various areas of differential geometry. Professor Hoborski had innate outstanding teaching abilities. He was an excellent lecturer, he prepared his lectures very carefully, delivering them with great eloquence and enthusiasm. He loved young people and, in particular, considered it his duty to take care of outstanding students. ... He willingly participated in his students' scientific trips to mines and steelworks, although it was extremely tiring for him due to his poor eyesight. He brilliantly organised the teaching syllabus and its delivery in his department. A few days before each exercise class, he held a briefing with the instructors, during which he discussed each task intended for the exercises which were to be completed at home.\nAntoni Hoborski published several books, some of which were printed and some were handwritten. In the Prefaces to his books he described the way he believed that mathematics should be taught. Every year he taught a course on Higher Mathematics at the Mining Academy. He wrote:-\nIn addition to Higher Mathematics, the scientific programme of the Mining Academy includes algebra, trigonometry and analytical geometry as subjects of separate lectures, and many deficiencies in pre-academic preparation are eliminated during them. ... Our lecture is inductive; we give examples that are selected in such a way that they create an intuitive concept in the reader, then we formulate a precise, specific concept, and we give examples again. We provide concepts and as few \"rules\", \"formulas\" and \"patterns\" as possible - because we are of the opinion that nowhere can mechanical science prevail so easily and wreak such mental devastation as in mathematics that is not properly taught.\nFor more thoughts by Hoborski about teaching mathematics and writing mathematics textbooks, see the Prefaces of three of his books at\nTHIS LINK\n.\nIn addition to textbooks, he published\n66\nresearch papers, for example\nUne remarque sur la limite des nombres ordinaux\nⓉ\n(\nA remark on the limit of ordinal numbers\n)\n(1921)\n,\nRemarque relative aux transformations linéaires, orthognales\nⓉ\n(\nNote relating to linear, orthognal transformations\n)\n(1922)\n,\nUne remarque sur les transformations réelles et orthogonales\nⓉ\n(\nA note on real and orthogonal transformations\n)\n(1933)\n,\n(\nwith S Golab\n)\nContribution à la théorie des équations de Frenet dans l'espace riemannien à n dimensions\nⓉ\n(\nContribution to the theory of Frenet's equations in n-dimensional Riemannian space\n)\n(1934)\n,\nÜber vollständige Systeme partieller Differentialgleichungen\nⓉ\n(\nFully-Standard Partial Differential Control System\n)\n(1934)\nand\nÜber spezielle Ebenen des Raumes\nR\n4\nR_{4}\nR\n4\n​\nⓉ\n(\nOn special levels of space R\n4\n)\n(1936)\n.\nHieronim Sieński writes in\n[\n31\n]\n:-\nHe did not crave any honours, he was one of those who enjoyed his student's success more than his own. He was straightforward in his behaviour, approachable, and uncompromising in ethical matters. At the same time, he was very sensitive, both sensitive and understanding of human misfortune. Having no children of his own, he donated significant amounts of money to help orphans and poor students. He was a modest man, he did not desire honours, he valued above all the warm atmosphere of home and peace in which to work. In\n1937\n, he founded the mathematical journal \"Opuscula Mathematica\" and was its first editor. Thanks to this title, the professor is still present in the university environment, as the journal continues to be published, and since\n2000\nthere is a portrait of the founder on the cover.\nSeveral major honours were given to Hoborski for his outstanding contributions. These included the Commander's Cross of the Order of Polonia Restituta, which he received on\n27\nNovember\n1927\n, the Medal of the Tenth Anniversary of Regained Independence, and the Medal for Long Service.\nThe tragedy that occurred after the outbreak of World War II is described in\n[\n39\n]\n:-\nThe Nazi German invasion of Poland in September\n1939\nbrought the university to a halt. On\n6\nSeptember Kraków was seized by German troops. They began to loot and plunder the university property, and reorganise the Main Building of the Mining Academy to house the Regierung des Generalgouvernements\n(\nGeneral Government administration\n)\n. In\n1940\n, the statue of Saint Barbara was thrown off the top of the main building and shattered to pieces.\nOn\n6\nSeptember\n1939\n, a general assembly of Jagiellonian University professors was called to inform them about the policy of German authorities on science and education. On this day at noon, in room\n66\nof the Jagiellonian University Collegium Novum, numerous professors and lecturers gathered. The building was surrounded by the Gestapo and the meeting participants were arrested. Among the detainees were also Mining Academy professors who had attended another meeting in the boardroom of the Jagiellonian University Faculty of Philosophy.\n183\npeople were imprisoned, among them professors, associate professors, and assistants from both universities, as well as many other people outside the academic community.\nThe arrested were detained at the prison at Montelupich Street in Kraków and subsequently transferred to the barracks at Mazowiecka Street. Later, they were transported to a prison in Wrocław and finally to the concentration camp in Sachsenhausen.\nHoborski was one of the professors who were arrested and ended up in the Sachsenhausen concentration camp near Berlin. His final days are described in\n[\n31\n]\n:-\nFor the professor, who was no longer young and not in the best physical condition, staying in the terrifying camp conditions was one series of suffering. He had been wearing glasses for many years, but they did not help him much. He could see things at a short distance. This visual defect caused him to be physically clumsy, he moved slowly and very carefully, and in addition, when admitted to the camp, he was given two left shoes. He endured the very hard camp regime, but he did not lose his dignity and still had enough fortitude and strength of spirit that he was able to initiate discussions on mathematical topics. When he was informed in the camp about the death of his wife\n[\nApolonia\n]\n, who died on\n18\nDecember\n1939\n, he endured this blow bravely and said: \"It's still better than if she found out about my death, which surely awaits me here.\" Without the supervision of his younger friends, he could not cope with dressing, walking and eating. He suffered a lot of humiliation from the SS men before receiving a yellow armband with three black points, which meant he was disabled and this protected him from harassment to some extent. The breakdown came later. Fellow prisoner Professor Kazimierz Stołyhwo recalled it this way: \"He was so abused that he came to me several times, telling me that he would throw himself on the electrified barbed wire surrounding the camp.\" At the end of January\n1940\n, in cramped, dirty clogs full of nails, he seriously injured his frostbitten feet. After the forced amputation of his big toes, gangrene and high fever developed. In the first days of February\n1940\n, the professor, who could no longer move, was transferred to the camp hospital. When on\n8\nFebruary\n1940\n, during the assembly, the list of those released from the camp was announced, including Hoborski, he was no longer able to leave the district. Professor Antoni Hoborski died on\n9\nFebruary\n1940\n, the day after his colleagues left. He died a free man.\nThere have been several events organised in more recent times to honour Hoborski and keep his memory alive. On\n9\nFebruary\n1980\n, the\n40\nth anniversary of his death, a meeting was organised by the Institute of Mathematics of the AGH University of Science and Technology and the Committee on the History of Mathematics of the\nPolish Mathematical Society\n, and his colleagues and students shared their memories. In\n1984\n, volume\n935\nof the\nAGH Scientific Notebooks\nwas dedicated to his memory with\n28\narticles discussing his life and work\n(\nwe list three\n[\n9\n]\n,\n[\n21\n]\nand\n[\n19\n]\n)\n. In\n2001\nthe main building of the AGH University of Science and Technology containing the Department of Applied Mathematics was named for Antoni Hoborski. In\n2014\nthe AGH University of Science and Technology organised the first \"Hoborski Days - Exact Sciences Festival\"; it has been held in November of each year since. At the Festival, an award was made for chemistry in\n2015\n, for physics in\n2016\nand for mathematics in\n2017\n, with this rotation continuing. The winner of the award is presented with a diploma and the \"Diamond Ball\" statuette.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}