{
  "nome_completo": "Anton Davidoglu",
  "nome_curto": "Anton Davidoglu",
  "ano_nascimento": "1876",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davidoglu/",
  "lugar_nascimento": "Bârlad, Vaslui County, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Anton Davidoglu\n was the son of Cleante Davidoglu and Profira Mooc. Cleante Davidoglu was a medical doctor who served the villages around Bârlad, a town in the east of Romania not far from the border with Moldova. He had studied medicine in Paris and was awarded a doctorate in medicine in\n1868\n. He later became head of the Bârlad hospital. Anton had an older brother, named Cleante Davidoglu after his father. Cleante Davidoglu Jr.\n(1871\n-\n1947)\nhad a career in the military and became a famous Romanian major general during World War I. The paternal grandfather of the two Davidoglu boys was a seller of salep, a flour made from orchids used to make winter drinks, their great-grandfather was a professional cavalrymen in the Ottoman army, and their great-great grandfather was an infantryman in the Ottoman army.\nAnton Davidoglu had both his primary and secondary education in his hometown of Bârlad and, being an outstanding pupil, he decided to go Paris for his university education instead of continuing to study at one of the two Romanian universities. He could have studied mathematics at the University of Bucharest where at least three of the mathematics staff had doctorates from Paris, but he chose to go the Paris to be taught by world leading mathematicians. He enrolled at the École Normale Supérieure but also attended lectures at Faculty of Science of the Sorbonne where he was taught by\nJacques Hadamard\nwho had just taken up a position at the Sorbonne after leaving a chair of mathematics in Bordeaux. Davidoglu graduated with a first degree in\n1897\nhaving impressed his teacher\nHadamard\n.\nDavidoglu then continued his studies at the École Normale Supérieure, undertaking research for his doctorate. He submitted his thesis\nSur l'équation des vibrations transversales des verges élastiques\nⓉ\n(\nOn the equation of transverse vibrations of elastic rods\n)\nto the University of Paris and was examined on\n24\nNovember\n1900\nby a committee chaired by\nÉmile Picard\nand which included\nHenri Poincaré\n. The thesis begins with the following introduction:-\nThe present work contains the study of an equation of the fourth order which one meets in mathematical physics. We carried out this study using the method of successive approximations. In his classical memoirs on second order equations, M\nPicard\n, applying it to particular types of problems, obtained very important results with remarkable simplicity. This method of successive approximations occurs naturally in the question which occupies us, when we consider integrals as functions of a certain parameter.\nThe first part contains the study of the equation\n(\n1\n)\n  \nd\n4\ny\nd\nx\n4\n=\nk\nϕ\n(\nx\n)\ny\n.\n(1) \\;  \\Large\\frac{d^4 y}{dx^4}\\normalsize  = k \\phi (x)y.\n(\n1\n)\nd\nx\n4\nd\n4\ny\n​\n=\nk\nϕ\n(\nx\n)\ny\n.\nM\nPicard\n's methods apply to this equation; difficulties appear when we want to establish the existence of an infinite series of exceptional values of k. An extension of\nSturm\n's theorem for second order equations is useful for the representation of an arbitrary function by means of exceptional integrals of equation\n(1)\n.\nIn the second part we study an asymptotic expansion of the integrals of equation\n(1)\nwith respect to k. We have taken great advantage of a memoir by M Horn on second order equations, but we have not yet managed to represent the exceptional values of k asymptotically. For that, it would be necessary to solve asymptotically an equation that we form.\nSome communications of the above have been made to the\nAcademy of Sciences\n.\nThe differential equations that Davidoglu was studying in this thesis relate to the transverse vibrations of nonhomogeneous elastic bars. In\n1900\n-\n01\n, he published two papers related to work from his thesis, namely\nSur une application de la méthode des approximations successives\nⓉ\n(\nOn an application of the method of successive approximations\n)\n(1900)\n, and\nSur les intégrales périodiques des équations différentielles binomes\nⓉ\n(\nOn the periodic integrals of binomial differential equations\n)\n(1901)\n, see\n[\n4\n]\nand\n[\n5\n]\n.\nThe problem of computing the number of solutions of a system of polynomials had been studied at the end of the\n19\nth century by\nLeopold Kronecker\nand\nÉmile Picard\n. Davidoglu was advised by\nÉmile Picard\nand, as he says in the Introduction above, applied\nPicard\n's results. He gave theorems on the number of roots of multiplicity greater than\n2\n.\nThe author of\n[\n1\n]\nnotes:-\nThus, Anton Davidoglu became the sixth Romanian with a doctorate in mathematics at the Sorbonne, after\nSpiru Haret\n(1851\n-\n1912)\nin\n1878\n, David Emmanuel\n(1854\n-\n1941)\nin\n1879\n, Constantin Gogu\n(1854\n-\n1897)\nin\n1882\n, Nicolae Coculescu\n(1866\n-\n1952)\nin\n1895\nand\nGheorghe Țițeica\n(1873\n-\n1939)\nin\n1899\n.\nThe author of\n[\n1\n]\nwrites:-\nAppreciated properly by the examining committee and the specialists of the time, the doctoral thesis brought Anton Davidoglu temporary joy followed by a long-term sadness! Young and inexperienced, Anton Davidoglu did not immediately publish the remarkable results in his thesis and thus, despite the importance of his results, he will not appear among the founders of the theory of integral equations, these being considered to be only\nErik Ivar Fredholm\n(1866\n-\n1927)\nand\nVito Volterra\n(1860\n-\n1940)\nwhose fundamental independent results were published exactly as in Anton Davidoglu's thesis! Those who knew Anton Davidoglu directly claimed that this very sad scientific event marked his entire scientific career as well as his publishing activity, totalling only\n12\narticles!\nWe are somewhat puzzled by this statement since Davidoglu's thesis appears to have been published in\nAnnales scientifiques de l'École Normale Supérieure\nⓉ\n(\nScientific Annals of the École Normale Supérieure\n)\n(3)\n17\n(1900)\n,\n359\n-\n444\n, see\n[\n3\n]\n.\nDavidoglu left Paris after successfully defending his doctoral thesis, and returned to Romania. In\n1902\nhe was appointed as an associate professor in the Department of Differential and Integral Computing at the Faculty of Sciences of the University of Bucharest. In\n1903\nhe published\nQuelques démonstrations nouvelles des théoremes fondamentaux de l'analyse\nⓉ\n(\nSome new demonstrations of the fundamental theorems of analysis\n)\n, see\n[\n6\n]\n, which has the following introduction:-\nThe beginnings of Analysis offer the peculiarity of requiring a considerable effort at the beginning from those who are studying science for the first time. It is in fact known that a whole series of theorems concerning the notions of upper and lower limits is needed before tackling\nRolle\n's theorem which is the foundation of the matter. It is this last theorem that I establish, so to speak, directly in Section\n(1)\n; we will see, in fact, that very little is required to give the demonstration, which is done more analytically. The following Sections\n(2)\nand\n(3)\ncontain the direct proofs of two theorems that are usually deduced from the first. These theorems are as follows: \"Any function of a variable x whose derivative is identically zero in an interval ab is a constant in this interval\"; and \"Any function of a variable x whose derivative is constantly positive\n(\nnegative\n)\nin the interval ab increases\n(\ndecreases\n)\nin this interval\n(\nthe statement remains true if the derivative becomes zero there without however being constantly zero there\".\nIn\n1905\nhe was promoted to full professor of differential and integral calculus at the Faculty of Sciences in Bucharest where he succeeded Iacob Lahovary\n(1846\n-\n1907)\n. It is worth saying a few words about Lahovary. He had attended the School of Officers in Bucharest, they continued his education in Paris being awarded a mathematics degree from the Sorbonne in\n1870\n. He had a military career, reaching the rank of general by\n1900\n, but also in parallel had a career as a mathematician, becoming a professor at the Departments of Infinitesimal Calculus and Mechanics at the University of Bucharest. His colleagues at the University of Bucharest  included David Emmanuel,\nSpiru Haret\n, O Gogu, and Dimitrie Petrescu; Davidoglu and all his colleagues taught the exceptional student\nGheorghe Țițeica\n.\nBucharest University of Economic Studies was founded on\n6\nApril\n1913\nand called at that time the Academy of Higher-level Commercial and Industrial Studies. Davidoglu was appointed to serve as the first Rector of the new institution and became a founding member. This was a difficult time with the two Balkan Wars taking place in\n1912\nand\n1913\n. Romania took no part in the first but was involved in the second\n1913\nwar against Bulgaria. Romania was neutral for the first two years of World War I, but entered the war on the side of the Allies in August\n1916\n. This political situation certainly made the Commercial Academy's beginnings quite difficult. As well as acting as Rector, Davidoglu also served as a professor teaching financial mathematics and insurance. This means that Davidoglu is considered today as the founder of the Romanian School of Financial and Actuarial Mathematics.\nAfter Romania entered World War I, their armies made initial advances but German troops counterattacked and by November\n1916\nthe Germans were approaching Bucharest. Davidoglu fled to Petrograd\n(\nnow St Petersburg\n)\n, in Russia, where he remained for the duration of the war. While there he learnt Russian and made contacts with Russian mathematicians; he continued these contacts after the war was over and he returned to his various positions in\n1918\nat the University of Bucharest and at the Commercial Academy.\nAs a teacher, Davidoglu was highly regarded and respected by his students although he had exceptionally high standards setting examinations that were exceedingly challenging. He taught many students who went on to become leading Romanian mathematicians, including\nTheodor Angheluta\n,\nPetre Sergescu\n,\nGrigore C Moisil\n,\nTiberiu Popoviciu\nand\nCaius Iacob\nall of whom have a biography in this archive. At the University of Bucharest he regularly taught courses on ordinary differential equations and partial derivatives. He also gave special courses in mathematical analysis at the Faculty of Science, dealing with existence theorems and the calculus of variations.\nNicholas Georgescu-Roegen\n(1906\n-\n1994)\nbecame a well-known mathematician, statistician and economist. Born in Constanta in Romania, he attended the lyceum in his home town, graduating in\n1923\nand entered the University of Bucharest where he studied mathematics. He writes about the mathematics course\n(\nsee\n[\n9\n]\n)\n:-\nThe requirement for the 'licence' was four courses per year for three years. There were no graduate courses. After the licence anyone could submit a dissertation for a doctor's degree. The curriculum was specifically classical; for example, it included a full year of elliptic functions but not a single lecture on modern algebra or topology. There was little variation from year to year. An exception: while I was in my last year, Anton Davidoglu, who ordinarily taught mathematical analysis, offered at his pleasure a special seminar on the singularities of differential equations. What I learnt from his masterly exposition helped me arrive at the peculiar results of my\n1936\npaper 'The Pure Theory of Consumer's Behaviour'. Curiously, in\n1926\nI did not think that it could be of value to me.\nAlthough Davidoglu did not publish any books directly, in fact two books were published based on lecture notes taken by students at courses he gave. The course he gave on infinitesimal analysis at the Bucharest Faculty of Science was attended by his student Racliş Neculai Rodolphe\n(1896\n-\n1966)\n. Rodolphe followed his professor Davidoglu in going to Paris to study for his doctorate which was awarded by the Sorbonne in\n1930\nfor his thesis\nThe principal solution of Poincaré's finite difference equation\n. Rodolphe's notes of Davidoglu's course formed the basis of Davidoglu's book\nCurs de analiza infinitezimala\nⓉ\n(\nCourse on infinitesimal analysis\n)\npublished in\n1931\n. The second of Davidoglu's books was based on a course he gave at the Commercial Academy. In this case the notes of his course on insurance theory were taken by his student Ilie Niculescu and published as\nCurs de teoria asigurarilor\nⓉ\n(\nInsurance theory course\n)\nin\n1935\n.\nThe author of\n[\n1\n]\nwrites:-\nAlthough few in number but dense in content and full of new ideas, Anton Davidoglu's works inspired many Romanian or foreign mathematicians in their research and were cited in reference works in the field such as\nÉmile Picard\n's 'Treatise on Analysis'. Anton Davidoglu became and remained a significant landmark in the development of the Romanian higher mathematical and economic education. Founder of the Academy of Advanced Commercial and Industrial Studies in Bucharest, Anton Davidoglu laid the foundations of the mathematical education of economists.\nDavidoglu retired from his positions at the Bucharest Faculty of Science and at the Commercial Academy on\n1\nJanuary\n1941\n. In the years before his retirement, he had served as dean of the Faculty of Science. In\n1956\nHadamard\n, at this time\n90\nyears old, attended the Fourth Congress of Romanian Mathematicians held in Bucharest. He remembered his excellent Romanian student from nearly sixty years earlier, and asked:-\nHow is my eminent student Davidoglu?\nIn\n1976\nRomania issued a stamp in honour of Anton Davidoglu's\n100\nth birthday. See\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}