{
  "nome_completo": "Antonio Maria Lorgna",
  "nome_curto": "Antonio Mario Lorgna",
  "ano_nascimento": "1735",
  "ano_morte": "1796",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lorgna/",
  "lugar_nascimento": "Cerea (now Italy)",
  "lugar_morte": "Verona (now Italy)",
  "biografia": "Antonio Mario Lorgna\n's parents were Domenico Lorgna, a cavalry officer of the Venetian army, and Teodora Quarotrio. There is not a misprint in either names we have given above, although the careful reader may have noticed that we have given his middle name once as Mario and once as Maria. This was deliberate, for although he was baptised Antonio Maria Lorgna he clearly did not like 'Maria' and in all his publications he gave his name as Antonio Mario Lorgna. He was born in Cerea, a town about\n30\nkm south east of Verona and about\n30\nkm due east of Mantua. No information is known concerning his early years or his early education. The first information that has been recorded shows that in\n1757\nhe was in Dalmatia, probably having gone there with his father, participating in land reclamation projects in the valley of the river Krka, working under Alvise Contarini, the Governor General for Dalmatia and Albania. Dalmatia, the coastal region of present day Croatia, was controlled by the Venetian government at this time and Alvise Contarini had been appointed by the Venetian Grand Council to serve as Governor General during\n1757\n-\n1759\n. The river Krka has its source near the present day border of Croatia and Bosnia-Herzegonina and flows through Dalmatia into the sea through many large lakes, meandering through flooded areas and marsh lands. For Lorgna this was that a period of intense study and he benefited greatly the lessons he received from Antonio Marcovich, a native of Dalmatia and a Colonel in the Venetian army, who was an excellent amateur scholar. Lorgna learnt both practical and theoretical aspects of hydraulics and general engineering and also, at this time, he acquired an thorough knowledge of the Croatian and French languages, as well as studying classical Latin and Greek. Contarini, struck by Lorgna's quickness of mind and versatility, appointed him as his secretary and interpreter.\nIn\n1759\nContarini came to the end of his time as governor of Dalmatia, and he arranged for Lorgna to enrol in the Faculty of Arts at the University of Padua, where he attended lectures on mathematics by Giovanni Poleni. Although close to the end of his career, Poleni was one of the leading experts on hydraulics and his teaching was important in Lorgna's development as a scientist. He also attended lectures on astronomy by Giovanni Alberto Colombo who predicted a bright scientific future for him. Colombo was also interested in architecture and just before Lorgna entered the University of Padua he had been involved in a project to restore the university's bell tower. Lorgna chose not graduate and after three years he left the University and began his military career in March\n1762\n. He returned to Dalmatia as a cadet in the Croatian cavalry. He continued his training in mathematics, however, and he also began his work as a hydraulic engineer attempting to reclaim land around the river Krka near Knin. In June\n1763\nhe was called to teach mathematics in the Military College of Castelvecchio, established in\n1760\nin Verona to prepare military engineers for the Venetian Republic. The Military College was connected to the Castelvecchio, a fortress which had been built into the\n12\nth\ncentury walls of Verona in the middle of the\n14\nth\ncentury.\nLorgna worked at the Military College of Castelvecchio in Verona for the rest of his career teaching courses on trigonometry, mechanics, statics for construction, ballistics and hydraulics. His first appointment was as a \"second teacher of mathematics\" and then as an \"engineer captain.\" In\n1765\nhe was appointed professor of mathematics in the Military College. He rose to the rank of Colonel in the engineers in\n1773\nand then Commander-in-chief of the Corps of engineers. He was appointed as Governor of the Military College for Cadets in\n1784\n, a position he continued to hold until his death in\n1796\n. At the same time that he was appointed as Governor he was also promoted to the rank of Brigadier. When he was elected to the\nRoyal Society of London\nin\n1788\n, he was described as a \"mathematician, Brigadier and Governor of the military school at Verona\". Although he was a professor of mathematics, Lorgna, like many scientists at this time, had broad interests including military and civilian engineering, physics, meteorology, agriculture, economics, and chemistry.\nBefore we give an indication of Lorgna's contribution to mathematics and other sciences, we look at what many would rate as his greatest achievement, namely the founding of the Società Italiana, the Society of the XL, which has become the\nNational Academy of Sciences of Italy\n. Although Lorgna was the driving force behind founding the Society, nevertheless four other men played an important role as founder members, namely Carlo Barletti\n(1735\n-\n1800)\nthe professor of physics at Pavia University, the mathematician\nRuggero Boscovich\n, the mathematician\nGianfrancesco Malfatti\n, and Lazzaro Spallanzani\n(1729\n-\n1799)\n. Spallanzani served as professor of logic, metaphysics, and Greek, then as professor of physics at the University of Modena before gaining worldwide recognition as a physiologist while holding a chair at the University of Pavia. These four were Lorgna's friends and they discussed setting up a Society over many years. On\n28\nJune\n1766\nLorgna wrote to\nMalfatti\nsaying that it was important for Italy to have a scientific journal. Over the following ten years discussions went on and by\n1776\nLorgna and\nMalfatti\nwere discussing Lorgna's \"idea of forming an Academy for all Italian scholars\".\nMalfatti\nthought the idea \"noble and glorious\" but was worried that they would not get deep enough contributions from mathematicians and other scientists. Barletti was also worried that they might not get the highest quality research, but Lorgna, who was confident that the project would succeed, pushed their doubts aside.\nOn\n1\nMarch\n1781\n, Lorgna went ahead with his proposal sending out a circular letter to top scientists. He proposed that they formed \"a body united only by the cement of love of our country and of free natural genius.\" He emphasised that the new Society would have a journal which would publish contributions rapidly, thus avoiding the delays that Italian scientists encountered by publishing abroad. He also promised that the journal would be printed to the highest quality, and promised to provide personal funds to ensure that these aims were met. He did not explicitly state that papers would be written in Italian, but this was implicit in the circular.\nBoscovich\nand others worried that papers written in Italian would not be read by foreign scientists.\nBoscovich\nemphasised this in several letters when he wrote \"Italian is unknown to mathematicians in Paris, England and Germany\". Lorgna, however, was confident in his proposal and advised all his friends to \"stay calm\". He published the first part of the\nMemorie\n, the Society's Memoirs, in\n1782\nthe year the Society was founded in Verona. Lorgna wrote in the Preface to this first part that \"the disadvantage of Italy is that its forces are divided\" and that it was necessary \"to start combining the knowledge and work of many famous separated Italians\" in a single association that \"was not of any one State but of all of Italy\". His Società Italiana, the Society of the XL, would restrict membership to forty top Italian scientists. In addition to the forty Italian scholars, he proposed that twelve foreign scientists were elected to the Society\n(\nthis was later increased to\n25)\n. The Society, he wrote, \"belongs to the whole of Italy, not just to a single city.\" Lorgna was the first President of the Società Italiana, holding this role until his death in\n1796\n. Only after his death was the Society renamed the \"Italian Society of Sciences known as Society of the XL\". It is worth realising that this \"Italian Society\" was proposed by Lorgna about\n100\nyears before the unification of Italy that took place in\n1861\n. Originally set up in Verona, the Society relocated to Milan, then to Modena, and in\n1875\n, when Rome was declared the capital of Italy, the headquarters of the Society moved there where it remains to this day. Carlo Barletti certainly believed that Lorgna had done a great service to his country in setting up the Società Italiana, calling him:-\n... the foundation, the key-stone, the centre of the splendour of Italy.\nLorgna undertook a variety of scientific tasks after taking up his duties at Castelvecchio in Verona in areas as diverse as mathematics, physics, hydrodynamics, meteorology and chemistry. He set up a weather station in a tower of the Castelvecchio and made daily readings for a year, publishing the data that he collected in\n1764\n. He undertook research in a number of different areas of mathematics, corresponding with various mathematicians in Italy and other European countries. He was highly regarded for his mathematical skills; for example\nBoscovich\nranked Lorgna as the second best Italian mathematician of his day\n(\nhe ranked\nLagrange\nin top place\n)\n. We indicate below the titles of some of his works but let us record here that, among the pure mathematical topics he worked on, was geometry, convergence of series and algebraic equations.\nHe was much in demand for his skill in hydraulic engineering and he advised on various projects around Verona and more widely through the Venetian Republic. Flooding was a major problem in the region and he advised on such matters as well as on various reclamation projects that were being undertaken. He gained an excellent reputation for his skills in these areas and he received many requests to give advice on various projects outside the Venetian Republic, such as at Lucca or further afield at Vienna and Lisbon. However, he was employed by the Venetian Republic and they were not prepared to allow him to undertake any work outside their own area. We should emphasise that his work on the physics of fluids went well beyond the practical issues that he encountered in solving flooding and reclamation problems.\nAmong Lorgna's eighty works on mathematics, chemistry, hydraulics and topography, we mention in particular\nDella graduazione de' termometri a mercurio e della rettificazione de' barometri\nⓉ\n(\nOf the graduation of mercury thermometers and adjustment of barometers\n)\n(1765)\n,\nDe quibusdam maximis, & minimis: dissertatio statico-geometrica\nⓉ\n(\nOn maxima and minima: a static-geometric dissertation\n)\n(1766)\n,\nDissertazione sopra il quesito: essendo le pressioni dell'acqua stagnante in ragione delle altezze\nⓉ\n(\nDissertation on the question: is static water pressure due to altitude?\n)\n(1769)\n,\nOpuscula mathematica et physica\nⓉ\n(\nWorks on mathematics and physics\n)\n(1770)\n,\nDissertazione sopra il quesito rinvenire il fondamento\nⓉ\n(\nDissertation on the question revive the foundation\n)\n(1771)\n,\nSpecimen de seriebus convergentibus\nⓉ\n(\nExamples of convergent series\n)\n(1775)\n,\nDe casu irreductibili tertii gradus et seriebus infinitis\nⓉ\n(\nThe case of the third degree and irreducible infinite series\n)\n(1776)\n,\nSaggi di statica e meccanica applicate alle arti\nⓉ\n(\nStatical and mechanical tests applied to the arts\n)\n(1782)\n, and\nPrincipj di geografia astronomico-geometrica\nⓉ\n(\nPrinciples of geometric-astronomical geography\n)\n(1789)\n. One of his works was translated into English as\nDissertation on the Summation of Infinite Converging Series with Algebraic Divisor, Exhibiting a Method Not Only Entirely New, But Much More General\n(1779)\n.\nWe should also mention the important contributions that Lorgna made to chemistry. This interest came later in his life and only began around\n1778\nafter he was involved in repairing the mineral springs at Recoaro, about\n35\nkm north east of Verona. Although the task he had undertaken at Recoaro was in his speciality of hydraulic engineering, he became interested in the chemical composition of the waters. As for all his interests, Lorgna approached this topic by reading the latest works and he decided that he would enter for the Grand Prix of the\nParis Academy of Sciences\nwhich had as its topic, \"Find a cheaper and faster method of production of gunpowder\". He was aware of the competition since he had been elected as a corresponding member of the\nAcademy of Sciences\nand, in that capacity, had been asked to disseminate information about their competitions. He submitted a memoir\nRecherches sur la formation et la multiplication des nitres\nⓉ\n(\nResearch on the formation and production of nitre\n)\nas his entry for this Grand Prix. His entry was awarded second prize but there had been controversy over the award with a second jury being set up to evaluate the entries. Lorgna was involved in this controversy arguing his case with the\nAcademy\nand with Antoine-Laurent Lavoisier\n(1743\n-\n1794)\n, president of the second jury.\nTowards the end of his life Lorgna began to suffer from ill health, caused by heart problems. He treated this with the same scientific approach as he applied throughout his life. He kept daily records of his symptoms, and experimented by taking various drugs and recording their effects. He died at his home at\n39\nPorta Nuova, Verona, where he had lived a secluded life; he never married. His home, on the first floor, has today a plaque attached which reads: \"In this house on\n28\nJune\n1796\n, Antonio Maria Lorgna died. He was a mathematician, hydraulic engineer, and famous founder and first president of the Italian Society of Science, born in Cerea on the\n18\nOctober\n1735\n.\"\nLorgna had one passion in his life outside of mathematics and science, and this was art particularly paintings. He was an avid collector of the leading artists of the day including Giotto di Bondone, Andrea Mantegna, Giovani Bellini, Giorgione\n(\nGiorgio da Castelfranco\n)\n, Correggio\n(\nAntonio Allegri\n)\n, Titian\n(\nTiziano Vecellio\n)\n, Paolo Veronese, Tintoretto\n(\nJacopo Robusti\n)\n, Jacopo Bassano, and Rembrandt\n(\nRembrandt Harmenszoon van Rijn\n)\n. It is a remarkable indication of his dedication to science that he sold this wonderful collection to the Veronese Count, Giovanni Emilei, in\n1781\nin order to fund the setting up of his Academy and funding its journal the Memorie. Sadly the paintings were not kept together as a collection.\nClose to the time when Lorgna died, Napoleon Bonaparte led his French armies into the north of Italy taking control of Verona. The Governor of the Military College of Castelvecchio in Verona who was appointed to succeed Lorgna was Leonardo Salimbeni\n(1752\n-\n1823)\n, who had been Lorgna's student and later his colleague at the Military College. Salimbeni continued to act as Governor when Napoleon had the Military College moved to Modena in\n1798\n.",
  "math_areas": [
    "Analysis"
  ]
}