{
  "nome_completo": "Archibald James Macintyre",
  "nome_curto": "Archibald Macintyre",
  "ano_nascimento": "1908",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macintyre_Archibald/",
  "lugar_nascimento": "Sheffield, Yorkshire, England",
  "lugar_morte": "Ohio, USA",
  "biografia": "Archibald Macintyre\n's parents were William Ewart G Archibald Macintyre and Mary Beatrice Askew. William Macintyre, who used his middle name of Archibald, was born in\n1878\nin Long Eaton, Derbyshire, and was a schoolmaster at a public elementary school in Sheffield. Mary Askew was born in\n1877\nin Sheffield, Yorkshire and, before her marriage, she had also been a school teacher. They were married in Sheffield in June\n1905\nand their first child, Kathleen Mary Macintyre, was born the following year in Ecclesall Bierlow, in Sheffield. She was two years older than Archibald, the subject of this biography.\nArchibald Macintyre was educated at the Central Secondary School, Sheffield. The school opened on\n10\nMarch\n1880\nas the Central Higher Grade School in the centre of Sheffield, and re-located to its present site at High Storrs\n(\nand renamed High Storrs Grammar School\n)\nin\n1933\n, a few year Macintyre had completed his studies there. He graduated in\n1926\nand, in October of that year, he matriculated as a scholar at Magdalene College, Cambridge. There he took the Mathematical Tripos with great success, tutored by Arthur Stanley Ramsey, the father of\nFrank Ramsey\n. He was ranked as First Class in Part I of the Mathematical Tripos in June\n1928\nand awarded the Davidson Prize for Mathematics after taking the Mathematics Preliminary Examination in June\n1928\n. Again he was ranked First Class in these examinations and was a\nWrangler\nin Part II of the Mathematical Tripos in June\n1929\n, being awarded distinction in Schedule B. Fellow students at Cambridge included\nDonald Coxeter\n,\nHarold Davenport\n,\nRaymond Paley\n,\nS Verblunsky\nand James Cossar. Macintyre spent the academic year\n1929\n-\n30\nundertaking research at Cambridge advised by\nEdward Collingwood\n. In fact\nCollingwood\n, although seven years older than Macintyre, had a rather unusual route to teaching at Cambridge. He had been awarded a Ph.D. in\n1929\nafter a short career in the navy and only gave advanced courses, doing no undergraduate teaching.\nAfter one year of research at Cambridge, Macintyre was appointed as a temporary Assistant Lecturer attached to the Mathematics Department of Swansea University College. He taught courses in applied mathematics and theoretical physics during the academic year\n1930\n-\n31\n.\nArchibald Read Richardson\nhad been appointed as professor of mathematics at Swansea in\n1920\nand was head of department at this time. During this year he became friendly with R Wilson, and the two undertook some research projects together. Macintyre moved to Sheffield in\n1931\nwhere he was appointed as an Assistant Lecturer in the Mathematics Department. He had continued to undertake research, advised by\nCollingwood\n, and was awarded a Ph.D. in\n1933\nfor his thesis\nSome Properties of Integral and Meromorphic Functions\n. In\n1935\nhe was promoted to Lecturer in Mathematics at Sheffield but he did not hold this position for very long for, on\n1\nOctober\n1936\n, he took up the position of Lecturer in Mathematics at King's College in the University of Aberdeen in Scotland.\nMacintyre's research contributions are discussed in detail in\n[\n3\n]\nand\n[\n4\n]\n. The following overview is from\n[\n3\n]\n:-\nAs a classical analyst, Macintyre considered a diversity of problems, throughout many of which, however, runs a strong thread, viz., his keen interest in overconvergence. Amongst his\n43\npapers, often grown from seed sown in his Ph.D. thesis, one finds such topics as asymptotic paths, the flat regions of\nmeromorphic\nfunctions, interpolation problems based on the\nLaplace\ntransform and other formulae for regular functions, Tauberian theorems in connection with certain canonical products, and numerous problems, many published jointly with R Wilson, in the theory of the singularities of\nf\n(\nz\n)\n=\n∑\nc\nn\nz\nn\nf (z) = \\sum c_{n} z^{n}\nf\n(\nz\n)\n=\n∑\nc\nn\n​\nz\nn\non the circle of convergence.\nHis first papers were:\nUn théorème sur l'ultraconvergence\n(1934)\n;\n(\nwith R Wilson\n)\nOn the order of interpolated integral functions and of meromorphic functions with given poles\n(1934)\n;\nOn the asymptotic paths of integral functions of finite order\n(1934)\n;\nElementary proof of theorems of Cauchy and Mayer\n(1935)\n; and\nA theorem concerning meromorphic functions of finite order\n(1935)\n. Macintyre acknowledged the contribution from his thesis advisor in the last of the papers we have just listed:-\nThe author is considerably indebted to Dr\nE F Collingwood\nfor assistance in the preparation of the manuscript and for improvements in the argument ...\nThrough an introduction by\nEdmund Whittaker\n, Macintyre met the mathematician\nSheila Scott\n. After studying at Cambridge,\nSheila Scott\nhad taught mathematics at St Leonard's School, St Andrews, for four years, followed by short spells teaching at Allen's School for Girls in Dulwich, South London, and Stowe School in Buckingham. Macintyre and Scott were married on\n27\nDecember\n1940\nand, in the following year,\nSheila Macintyre\nwas appointed as an assistant lecturer in the same department as her husband in the University of Aberdeen. At this time World War II was taking place and several of the mathematics staff at Aberdeen had been called up for war service. She taught courses at the university filling in for the men who were fighting and also undertook research for a Ph.D. thesis. The Macintyres had two children, Alister William Macintyre\n(\nborn\n8\nFebruary\n1944)\nand Susan Elizabeth Macintyre\n(\nborn March\n1950)\n. A third child, a boy named Douglas Scott Macintyre, died from enteritis in March\n1949\nat the age of two years.\nArchibald and\nSheila Macintyre\nundertook some joint mathematical work. In volume\n23\nof the\nJournal\nof the\nLondon Mathematical Society\n(1948)\nthere are two papers by the Macintyres. The first, by\nSheila Scott Macintyre\n, is an\n8\n-page entitled\nA functional inequality\nwhile the next paper, by Archibald Macintyre, is a\n3\n-page paper entitled\nNote on the preceding paper\n. These two papers investigate a problem posed by\nE M Wright\nand give conditions on a real function\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nand its derivatives to ensure that\nf\n(\nx\n)\n≤\nsin\n⁡\nx\nf (x) ≤ \\sin x\nf\n(\nx\n)\n≤\nsin\nx\nin a certain interval.\nSheila Macintyre\nproved two new theorems attacking\nWright\n's question while Archibald Macintyre used one the lemmas in\nSheila Macintyre\n's paper to generalise a theorem proved by\nWright\nin an earlier paper. A few years later, in\n1952\n, the two Macintyres published a more conventional type of joint paper, namely the\n2\n-author work\nTheorems on the convergence and asymptotic validity of Abel's series\nwhich was published in the\nProceedings\nof the\nRoyal Society of Edinburgh\n.\nArchibald Macintyre was elected a fellow of the\nRoyal Society of Edinburgh\non\n3\nMarch\n1947\n. He had been proposed for the fellowship by\nE M Wright\n,\nIvor Etherington\n,\nEdward Copson\n,\nEdmund Whittaker\n, and James Cossar.\nAt Aberdeen, Macintyre was thesis advisor to\nJames Clunie\n. In\n1952\nClunie\nwas awarded his Ph.D. by the University of Aberdeen for his thesis\nOn Certain Topics Concerning the External Behaviour of Functions\n. In a paper\nClunie\npublished in\n1953\nhe expressed his thanks to his advisor:-\nI wish to express my gratitude to Dr A J Macintyre for suggesting the problems treated in this paper, and for his advice and criticism throughout the work.\nN A Bowen, who collaborated with Macintyre on many research articles, gives this appreciation of his colleague\n[\n3\n]\n:-\nDuring my thirteen-year association with him at King's College, Aberdeen, Scotland, I naturally came to know him well, and to admire his many fine attributes. His good nature and kindness, his subtle but delightful sense of humour, the patience with which he explained mathematical problems to those less quick than he to see the point, the facility with which he was able to imbue his students with the feeling that mathematics was a living and growing subject and not a defunct language of invariable symbols, his encyclopaedic knowledge of mathematical research papers especially in the various branches of mathematical analysis - all these were highly impressive and go some way towards explaining not only the high esteem and popularity accorded to him, by both staff and students wherever he went, but also his power of attracting research students to work under his inspiring supervision. Another aspect of his character that impinged itself early on his mathematical friends, especially on his research collaborators, was his high standard - he simply would not countenance publication unless, and until, the proposed article was of first-class quality as regards both content and exposition. However, what impressed me most of all about him as a mathematician was his humility. He told me once that he did not regard himself as an original thinker, but merely as one who could sometimes push further ahead with the ideas and methods of others. All who have worked in the field of analysis will surely agree that such an opinion of his work does him less than justice, and I have no doubt that many of us would be only too happy to produce work of his quality.\nIn\n1958\nMacintyre and his wife accepted visiting research professorships at the University of Cincinnati in the United States. They returned to Aberdeen in\n1959\nbut, on\n30\nSeptember of that year, Archibald Macintyre resigned his Senior Lectureship at Aberdeen so that he could take up a permanent post as Research Professor in Mathematics at Cincinnati.\nSheila Macintyre\nresigned her Lectureship at the same time and was also appointed as a professor in the Mathematics Department at Cincinnati where she taught until her early death from breast cancer in March\n1960\n. In\n1963\nMacintyre was named Charles Phelps Taft Professor of Mathematics at the University of Cincinnati. He held this position until his death, after a brief illness, in\n1967\nat the age of\n59\n. Although he had only worked at the University of Cincinnati for nine years\n(\nless in a permanent position\n)\n, nevertheless he advised at least twelve Ph.D. students during these years with seven graduating with their doctorates in\n1963\nor\n1964\n.\nAlthough Macintyre is best known for his work in pure mathematics, he did have interests in applied mathematics and physics. In fact some of his ideas, such as those on the design of aircraft, were unconventional\n[\n3\n]\n:-\nHe was also deeply interested in aerodynamics, fluid mechanics and related fields. He believed, for example, that aeroplanes should have their control surfaces - rudder and elevator - located at the front and not at the back. He conducted with great enthusiasm his experiments with model planes, and corresponded widely with experts on these matters, steadfastly refusing to accept their views unless soundly backed by evidence, at the same time being himself able to answer their objections to his revolutionary ideas. He was awarded a Caird Senior Scholarship in Aeronautics for\n1943\n-\n44\n, and a D.S.I.R. grant from\n1946\n-\n49\nfor special research on the Lanchester Vortex.\nFinally, let us record that Macintyre was a member of the Cambridge Philosophical Society, the\nLondon Mathematical Society\nand the\nEdinburgh Mathematical Society\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}