{
  "nome_completo": "Archie Alphonso Alexander",
  "nome_curto": "Archie Alexander",
  "ano_nascimento": "1888",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alexander_Archie/",
  "lugar_nascimento": "Ottumwa, Iowa, USA",
  "lugar_morte": "Des Moines, Iowa, USA",
  "biografia": "Archie Alexander\n's father was Price Alexander who was a janitor in Ottumwa while his mother was Mary Hamilton. Archie was born into a African-American family that lived in an area of Ottumwa which was set aside for poor people, and of course this meant that he would not be expected to have an education. It took the remarkable person that Archie was, together with strong support from his parents, to overcome these disadvantages, both from prejudice against someone of his race and against someone from a poor working class background, and go on to a life filled with achievements.\nWhen Archie was eleven years old his family moved from Ottumwa to live on a small farm on the outskirts of Des Moines. He had the advantage of being able to attend a school in Des Moines which was open to both white and black students and in\n1905\n, at the age of seventeen, he graduated from Oak Park High School in Des Moines. Alexander's parents were far too poor to be able to afford to send him to College to study further, yet Alexander was determined to continue his education. To allow him to study at Highland Park College in Des Moines, Alexander took on some poorly paid part-time jobs and his parents also helped out as much as they could. In addition he attended Cummins Art College in Des Moines before entering the University of Iowa in\n1908\nto study engineering.\nIt is important to realise what an achievement it was for Alexander to enter the College of Engineering in Iowa City which was attached to the University of Iowa. He was the only student of his race in the College and, when he achieved sporting success by becoming a member of the university football team, he was the only member of the team who was not white. We should explain that, in the title of\n[\n3\n]\n, \"Alexander the Great\" refers to Alexander's nickname as a football player. How he found time for sport in addition to his studies, while he still had to spend long hours undertaking poorly paid part-time work to support himself, says much for his determination to succeed in everything he undertook.\nOne might have expected someone from Alexander's background to have been encouraged to undertake university studies, but this had certainly not been the case. His advisor at university had bluntly told him that\n[\n2\n]\n:-\n... a Negro could not hope to succeed as an engineer...\nand after he graduated in\n1912\nand began to seek a position as an engineer he discovered that his advisor had simply been telling him the truth. Prejudice against someone of his race prevented Alexander from being appointed to any of the engineering posts to which he made application. However, one haapy event in\n1913\nwas that he married Audra A Linzy. The couple had one child who sadly died a few years later.\nAlexander was not one to give up when he encountered such difficulties. He decided that if he could not find an engineering post then he would join a firm as a labourer and work his way up. He took a manual labouring job with the Marsh Engineering Company and in two year he had shown that he could overcome the prejudice by rising through the Company until he was in charge of the Marsh Engineering Company's bridge building programme in Iowa and Minnesota.\nOne might have thought that Alexander, having achieved remarkable success for someone of his background, might have been content with his position. However, he was a man with ambitions and after two years with the Marsh Engineering Company, he left to form his own engineering company. Now, of course, he had to fight against prejudice much harder than before. Few would willingly give a major engineering contract to a firm run by an African-American if there were other firms able to do the work. As a consequence, Alexander's company ended up with the jobs for which no other firm competed.\nWhile at the Marsh Engineering Company, Alexander had become friendly with another engineer George F Higbee. Alexander took Higbee on a partner in\n1917\nand the partnership was only ended in\n1925\nwhen Higbee was tragically killed in a construction accident. For four years Alexander continued to run the company on his own, gaining a reputation as a talented construction engineer building fine bridges, viaducts and tunnels. Then in\n1929\nhe took on a new partner, Maurice A Repass, who had been a fellow student with Alexander at the Iowa College of Engineering. Their firm was now named Alexander and Repass and were so successful that they were called in the press:-\n... the nation's most successful interracial business.\nAlexander did not confine his talents to developing his engineering firm. He also took part in the political life of Iowa, serving as the assistant chairman of the Iowa Republican State Committee in\n1932\nand again in\n1940\n. His outstanding contribution to the Republican Party was rewarded in\n1954\nwhen he was appointed as governor of the Virgin Islands.\nThree of the Virgin Islands were purchased by the United States from Denmark in\n1917\nand they became an unincorporated territory of the United States. In\n1927\nthe islanders became US citizens and various acts established the government of the Islands. The Revised Organic Act of\n1954\ncreated a central government and Alexander was appointed as Governor in April of that year, see\n[\n1\n]\n. It was to turn out to be a disastrous appointment. As Wynes writes in\n[\n2\n]\n:-\nDogmatic, paternalistic, undemocratic, and with an openly stated contempt for the easygoing Virgin Islanders ...\nAlexander's period as governor lasted only sixteen months before he was forced to resign. It was a sad episode which almost certainly hastened Alexander's death and must have left him with much sadness after a life filled with so many achievements against all the odds that were stacked against him. Wynes sums up his life saying:-\nEngineer, businessman, loyal and active member of the Republican Party, civil rights and interracial leader, Alexander was, ironically, a failure only in the world of state diplomacy. The one failure is ironic in that surely he had to be a diplomat in the largely white world in which he lived and worked.\nIn\n1975\n, on the death of Alexander's wife, the University of Iowa, Tuskegee Institute in Alabama, and Howard University each received a substantial sum for engineering scholarships from a trust fund set up by Alexander in his will.",
  "math_areas": []
}