{
  "nome_completo": "Jean Robert Argand",
  "nome_curto": "Argand",
  "ano_nascimento": "1768",
  "ano_morte": "1822",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Argand/",
  "lugar_nascimento": "Geneva, Switzerland",
  "lugar_morte": "Paris, France",
  "biografia": "This biography is about\nArgand\n, the man whose name is well-known to essentially everyone who has studied mathematics through the 'Argand diagram' for complex numbers. Let us state right at the beginning of this biography that the first names \"Jean Robert\" and the dates of his birth and death as given above are unlikely to be correct. They refer to a real person, but it is unlikely that this person is the author of the 'Argand diagram'. The following information about Jean Robert Argand has, probably incorrectly, become a standard part of the biography of the man who invented the 'Argand diagram'.\nJean-Robert Argand was an accountant and bookkeeper in Paris who was only an amateur mathematician. Little is known of his background and education. We do know that his father was Jacques Argand and his mother Eves Canac. In addition to his date of birth, the date on which he was baptized is known -\n22\nJuly\n1768\n. Among the few other facts known of his life is a little information about his children. His son was born in Paris and continued to live there, while his daughter, Jeanne-Françoise-Dorothée- Marie-Elizabeth Argand, married Félix Bousquet and they lived in Stuttgart.\nIf this information is unlikely to be true, perhaps it would be useful at this point to understand where it comes from.\nJules Hoüel\npublished a four volume work entitled\nThéorie Élémentaire des Quantités Complexes\nⓉ\n(\nElementary theory of complex quantities\n)\n. Before\nHoüel\npublished Volume\n4\nin\n1874\nhe decided to try to find biographical information about Argand. He knew that Ami Argand\n(1750\n-\n1803)\n, who had invented instruments and lived in Paris for a while, had been born in Geneva. This must have made\nHoüel\nguess that the inventor of the Argand diagram might have been born in Geneva so he asked his colleagues in Geneva if they could find biographical details of Argand. The details about Jean-Robert Argand we have presented above are the result of\nHoüel\n's request although those giving the information had expressed doubts that they had found the correct Argand. Despite the doubts, this information has been taken as definite until the late\n1990\ns when Gert Schubring's research resulted in his claim that\n[\n7\n]\n:-\n... these few known data seem to be doubtful.\nSchubring's argument is based mainly on the fact that there is essentially no evidence to suggest that the standard biography of Argand might be correct. He also has a few arguments which suggest that this 'standard biography' is wrong. One is that\nLegendre\n, who appears to have met Argand, describes him as a 'young man'. If Argand was Jean Robert Argand he would be\n38\nyears old when he met\nLegendre\nand unlikely to merit this description. Another thing which suggests that Argand is not Jean Robert Argand is that Jean Robert Argand is an accountant and bookkeeper while, from his writings, Argand shows he is probably an expert technician in the clock industry.\nArgand is famed for his geometrical interpretation of the complex numbers where\ni\ni\ni\nis interpreted as a rotation through\n90\n°. The concept of the modulus of a complex number is also due to Argand but\nCauchy\n, who used the term later, is usually credited as the originator this concept. The Argand diagram is taught to most school children who are studying mathematics and Argand's name will live on in the history of mathematics through this important concept. However, the fact that his name is associated with this geometrical interpretation of complex numbers is only as a result of a rather strange sequence of events.\nThe first to publish this geometrical interpretation of complex numbers was\nCaspar Wessel\n. The idea appears in\nWessel\n's work in\n1787\nbut it was not published until\nWessel\nsubmitted a paper to a meeting of the\nRoyal Danish Academy of Sciences\non\n10\nMarch\n1797\n. The paper was published in\n1799\nbut not noticed by the mathematical community.\nWessel\n's paper was rediscovered in\n1895\nwhen\nChristian Juel\ndraw attention to it and, in the same year,\nSophus Lie\nrepublished\nWessel\n's paper.\nThis is not as surprising as it might seem at first glance since\nWessel\nwas a surveyor. However, Argand was not a professional mathematician either, so when he produced his geometrical interpretation of complex numbers in\n1806\nit was in a memoir which he may have published privately at his own expense but in fact there is no proof that it was published. All that is certain is Argand's own statement that he privately distributed a very small number of copies some time between\n1806\nand\n1813\n. Whether it was published or not does not matter for, as no evidence survives of its publication, one would have expected it to be less noticeable than\nWessel\n's work which after all was published by the\nRoyal Danish Academy\n. Perhaps even more surprisingly, Argand's name did not even appear on the memoir so it was impossible to identify the author.\nThe way that Argand's work became known is rather complicated.\nLegendre\nreceived a copy of the work,\nEssai sur une manière de représenter les quantités imaginaires dans les constructions géométriques\nⓉ\n(\nEssay on a way of representing imaginary quantities in geometric constructions\n)\nfrom Argand and he sent it to\nFrançois Français\non\n2\nNovember\n1806\nalthough neither knew the identity of the author.\nLegendre\nwrote in this letter:-\nThere are people who cultivate science with great success without being known and without looking for fame. Recently I saw a young man who asked me to read a work he had done on imaginary numbers; he did not explain his object to me very well, but he made me understand that he regarded the so-called imaginary quantities as real as the others, and represented them by lines. At first I showed the author I was very doubtful, but I promised to read his memoir. I found contrary to my expectation, quite original ideas, very well presented, supported by a rather deep knowledge of calculation, and finally that lead to very exact consequences such as most formulas of trigonometry, the theorem of Cotes, etc. Here is a sketch of this work that you may be interested in and that will allow you to judge the rest. ... I only give here a small part of his ideas, but you will make up for it, and perhaps you will find, like me, that they are original enough to deserve attention. For the rest I leave you simply as an object of curiosity and I will not defend myself.\nAfter\nFrançois Français\n's death in\n1810\nhis brother\nJacques Français\nworked on his papers and he discovered Argand's little memoir among them. In September\n1813\nJacques Français\npublished the paper\nNouveaux principes de Géométrie de position, et interprétation des symboles imaginaires\nⓉ\n(\nNew principles of position geometry, and Interpretation of imaginary symbols\n)\nin which he gave a geometric representation of complex numbers, with interesting applications, based on Argand's ideas.\nJacques Français\nmight easily have claimed these ideas for himself, but he did quite the reverse. He ended his paper by saying that the idea was based on the work of an unknown mathematician and he asked that the mathematician should make himself known so that he might receive the credit for his ideas:-\nI must ... out of justice declare that the substance of these new ideas does not belong to me. I found them in a letter from\nM Legendre\nto my late brother\nFrançois Joseph Français\n,\n1768\n-\n1810\n, in which this great mathematician shares with him\n(\nas a thing that has been communicated to him, and as an object of pure curiosity\n)\nthe substance of my\n2\nnd and\n3\nrd definitions, of my\n1\nst theorem, and the\n3\nrd corollary of my\n2\nnd theorem\n[\n...\n]\n. I hope that the publicity that I give to the results that I have reached can lead to the first author of these ideas being known, and to bring to light the work he has done himself on this subject.\nThe article by\nJacques Français\nappeared in\nGergonne\n's journal\nAnnales de mathématiques\nand Argand responded to\nJacques Français\n's request by acknowledging that he was the author and submitting a slightly modified version of his original work\nEssai sur une manière de représenter les quantités imaginaires dans les constructions géométriques\nⓉ\n(\nEssay on a way of representing imaginary quantities in geometric constructions,\n)\n,  with some new applications, to the\nAnnales de mathématiques\n. There is nothing like an argument to bring something to the attention of the world and this is exactly what happened next. A vigorous discussion between\nJacques Français\n, Argand and\nServois\ntook place in the pages of\nGergonne\n's Journal. In this correspondence\nJacques Français\nand Argand argued in favour of the validity of the geometric representation, while\nServois\nargued that complex numbers must be handled using pure algebra.\nOne might have expected that Argand would have made no other contributions to mathematics. However this is not so and, although he will always be remembered for the Argand diagram, his best work is on the fundamental theorem of algebra and for this he has received little credit. He gave a beautiful proof\n(\nwith small gaps\n)\nof the fundamental theorem of algebra in his work of\n1806\n, and again when he published his results in\nGergonne\n's Journal in\n1813\n. Certainly Argand was the first to state the theorem in the case where the coefficients were complex numbers. Petrova, in\n[\n6\n]\n, discusses the early proofs of the fundamental theorem and remarks that Argand gave an almost modern form of the proof which was forgotten after its second publication in\n1813\n.\nAfter\n1813\nArgand did achieve a higher profile in the mathematical world. He published eight further articles, all in\nGergonne\n's Journal, between\n1813\nand\n1816\n. Most of these are based on either his original memoir, or they comment on papers published by other mathematicians. His final publication was on combinations where he used the notation\n(\nm\n,\nn\n)\n(m, n)\n(\nm\n,\nn\n)\nfor the combinations of\nn\nn\nn\nobjects selected from\nm\nm\nm\nobjects.\nIn\n[\n1\n]\nJones sums up Argand's work as follows:-\nArgand was a man with an unknown background, a nonmathematical occupation, and an uncertain contact with the literature of his time who intuitively developed a critical idea for which the time was right. He exploited it himself. The quality and significance of his work were recognised by some of the geniuses of his time, but breakdowns in communication and the approximate simultaneity of similar developments by other workers force a historian to deny him full credit for the fruits of the concept on which he laboured.\nIn\n[\n7\n]\nGert Schubring attempts to give a reconstruction of Argand's attempts to interest\nLegendre\nin his geometrical interpretation:-\nIn the autumn of\n1806\n,\nLegendre\nwas approached by Argand, who tried to outline the main results in his manuscript to him in direct conversation.\nLegendre\nresponded with scepticism as to the method and its applications. Upon leaving, Argand urged\nLegendre\nto read his manuscript.\nLegendre\nhad not retained the name of this man and assumed that the manuscript would show the name of its author. When Argand had left,\nLegendre\nrealised that the paper indicated neither the address nor the name of the author. Upon reading the 'Éssai',\nLegendre\nnoticed its quality, he waited for a further visit from its author, but the author did not appear again. In order to end his own involvement with these conceptions he wrote the report to\nFrançois Français\nin the letter of\n2\nNovember\n1806\n. Since\nLegendre\nfirmly asked not to be bothered with discussions on this paper, neither the elder nor later the younger Français dared to ask him about the paper and its author. On the other hand, Argand - apparently a shy man - abstained from publishing his paper, due to\nLegendre\n's uninterested and sceptical reaction. Only the quite indirect reception of his ideas via the brothers Français induced Argand to organise a later printing where he arranged for the date of its composition to be put on the title page.\nArgand must have been in Paris in\n1806\nwhen he met\nLegendre\nand he was certainly in Paris in\n1813\nfor he gives a Paris address on his paper published in that year.\nWe must add one last note to this, necessarily rather unsatisfactory, biography of Argand. His letters and published work all appear under the name Argand with no other names. This would look to us more like a non-de-plume that the actual name of the author. Of course, if this is true, it would mean that any attempt to identify Argand in future would be made even more difficult\n(\nprobably impossible\n)\n.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}