{
  "nome_completo": "Aristaeus the Elder",
  "nome_curto": "Aristaeus",
  "ano_nascimento": "370 BC",
  "ano_morte": "300 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aristaeus/",
  "lugar_nascimento": null,
  "lugar_morte": null,
  "biografia": "Aristaeus the Elder\nwas probably older than, but still a contemporary of,\nEuclid\n. We know practically nothing of his life except that\nPappus\nrefers to him as Aristaeus the Elder which presumably means that\nPappus\nwas aware of another later mathematician also named Aristaeus. We have no record of such a person but we do point out below a possible confusion which may result from there being two mathematicians called Aristaeus.\nPappus\ngave Aristaeus great credit for a work entitled\nFive Books concerning Solid Loci\nwhich was used by\nPappus\nbut has now been lost. 'Solid loci' is the Greek name for\nconic sections\nso it is rather confusing that there is another reference by a later writer to a work by Aristaeus called\nFive Books concerning Conic Sections\n. However these two works are now thought to be the same.\nPappus\ndescribes the work as:-\n... five books of Solid Loci connected with the conics.\nand also claims\n(\nif this is not a latter addition to the text\n)\nthat\nEuclid\ncompiled elementary results on conics in his treatise\nConics\nwhile Aristaeus's results, much deeper, original and specialised, were not included by\nEuclid\nwho preferred to leave them in their original presentation due to Aristaeus.\nHeath\nmakes a guess at the possible contents of the\nSolid Loci\nand writes\n[\n3\n]\n:-\nA very large portion of the standard properties of conics admit of being stated in the form of\nlocus\ntheorems ... But it may be assumed that Aristaeus's work was not merely a collection of the ordinary propositions transformed in this way; it would deal with new locus theorems not implied in the fundamental definitions and properties of the conics, such as ... the theorems of the three- and four-line locus. But one\n(\nto us\n)\nordinary property, the\nfocus directrix\nproperty, was, as it seems to me, in all probability included.\nHeath\nrefers to theorems of the three- and four-line locus in the above quote and we should explain what these are. For the three line locus we are given a point\nP\nP\nP\nand three directed lines\na\n,\nb\na, b\na\n,\nb\n, and\nc\nc\nc\ndrawn to meet at given angles, three fixed straight lines. Then the locus of\nP\nP\nP\nsuch that\na\nc\n:\nb\n2\nac : b^{2}\na\nc\n:\nb\n2\nis a given constant is a conic. The four-line locus is similar. We are given a point\nP\nP\nP\nand four directed lines\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\n, and\nd\nd\nd\ndrawn to meet at given angles, four fixed straight lines. Then the locus of\nP\nP\nP\nsuch that\na\nc\n:\nb\nd\nac : bd\na\nc\n:\nb\nd\nis a given constant is a conic.\nThere is a reference to Aristaeus in the works of\nHypsicles\nwhere he refers to Aristaeus as the author of a book\nConcerning the Comparison of Five Regular Solids\n.\nHeath\nbelieves that, although it is not certain whether this is Aristaeus the Elder, the results described make it quite probable that it is.\nHypsicles\ntells us that, in this work, Aristaeus proved that\n[\n3\n]\n:-\n... the same circle circumscribes both the pentagon of the\ndodecahedron\nand the triangle of the\nicosahedron\ninscribed\nin the same sphere.\nHeath\n's opinion that the Aristaeus referred to by\nHypsicles\nthis is Aristaeus the Elder has been disputed by some historians, and there is a possibility that\nHypsicles\nrefers to Aristaeus the Younger thus making sense of\nPappus\n's comments which we referred to in the first paragraph.\nThe work of both Aristaeus and\nEuclid\non conics was, almost\n200\nyears later, further developed by\nApollonius\n. This work by\nApollonius\nmade the theory of conics as developed by Aristaeus and\nEuclid\nobsolete.",
  "math_areas": [
    "Statistics"
  ]
}