{
  "nome_completo": "Artemas Martin",
  "nome_curto": "Artemas Martin",
  "ano_nascimento": "1835",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Martin/",
  "lugar_nascimento": "Steuben County, New York, USA",
  "lugar_morte": "Washington, D.C., USA",
  "biografia": "Artemas Martin\n's parents were Orenda Knight and James Madison Martin; they were farmers. Artemas had very little in the way of formal education with the total being only three terms at a district school in Venango County and a few months at the Franklin Academy when he was seventeen years old. It was during these few months at the Franklin Academy that he was introduced to basic algebra, geometry and trigonometry. Mathematics became a fascination and he spent the rest of his life as an enthusiastic amateur mathematician. The authors of\n[\n1\n]\nset the scene for detailing his contributions:-\nArtemas Martin, a self-taught mathematician whose activity covered almost six decades, has been described as 'a unique example of what an inherent love of the solution of mathematical problems can do to a man even if he has not the advantages of advanced schooling'. He lived in rural Pennsylvania until he was fifty, edited columns of mathematical puzzles, worked enthusiastically and relentlessly on mathematical problems that he found interesting, corresponded with other mathematicians, and founded two journals: 'The Mathematical Visitor'\n(1878\n-\n1894)\nand 'The Mathematical Magazine'\n(1882\n-\n1884)\n. Although these publications were short-lived, they helped prepare the ground for others such as 'The American Mathematical Monthly'\n(1894)\n, the first official publication of the\nMathematical Association of America\n. Thus it is quite appropriate that one of the first articles in that periodical was a short biography of Martin\n[\n2\n]\n.\nAs the above quote states, Martin lived in rural Pennsylvania until he was fifty, mostly in Erie. There he earned his living farming, drilling oil wells and chopping wood. He did teach mathematics in local schools during four of the winters he spent there. He certainly could have had a much higher status for in\n1881\nhe was offered the position of professor of mathematics at the Normal School in Warrensburg, Missouri. He turned this down but in\n1885\n, at the age of fifty, he did accept the offer of a job as librarian with the United States Coast and geodetic Survey in Washington, D.C. In taking the position of librarian Martin was following the second passion of his life, namely that of being a book collector. He possessed by far the most extensive collection of American texts on algebra and arithmetic, so it was natural for him to publish a work called\nNotes on the history of American textbooks on arithmetic\nin\n1899\n. He wrote this work jointly with J M Greenwood. His book collection extended well beyond mathematics, however, with many texts on poetry, as well as botany and natural history. He left his collection of\n5000\nbooks to the American University and it is now housed in its Special Collection. With his library there is a number of notebooks which contain his solutions to mathematical problems and well as lists of books that he was trying to purchase.\nMartin published a very large number of problems and solutions to problems in a wide range of publications\n[\n3\n]\n:-\nIn his writings and problem-solving, Martin dealt mostly with Diophantine analysis, probability, elliptic integrals, logarithms, and properties of numbers and triangles.\nFor example, he published thirteen articles entitled\nOn Average\nin\nThe Wittenberger\n(\nA Journal Devoted to the Interests of Wittenberg College\n)\n, between the years\n1877\nand\n1879\n. To see the type of problems he was examining we quote a problem from the first of these articles:-\nRequired the average area of all right-angled triangles whose hypotenuses are a.\nHere is another example, this time from the second of the thirteen articles:-\nA point is taken at random in the surface of the circle, and a chord is drawn through it at random, and then a point is taken at random on the chord and another chord drawn to it at right angles to the first. Find the average area of the quadrilateral formed by joining the extremities of the chords.\nFinally a problem from the third\nOn averages\narticle:-\nTwo equal spheres intersect; find the average of the volume common to both.\nHe did publish one research level article, namely\nOn fifth power numbers whose sum is a fifth power\nto the International Mathematical Congress in Chicago in\n1893\n. By describing this as his only research article we do not mean to suggest that some of his problems were not very challenging. For example try solving the problems he proposed in\n1878\n:-\nFind the average distance of one corner of a rectangle from all the points on its surface.\nFind the average distance of one corner of a rectanglar solid from all the points in its interior.\nMartin was the first American subscriber to the\nEducational Times\nand the first American to contribute to its mathematical section. He was a member of many mathematical societies. He was a member of the\nNew York Mathematical Society\nand later of the\nAmerican Mathematical Society\n. He was also a member of the\nLondon Mathematical Society\n, the\nEdinburgh Mathematical Society\n, the\nFrench Mathematical Society\n, the\nGerman Mathematical Society\n, and the\nMathematical Circle of Palermo\n. He was a fellow of the American Association for the Advancement of Science. In\n1877\nhe was awarded an honorary M.A. from Yale, then an honorary Ph.D. from Rutgers in\n1882\n, and finally an LL.D. from Hillsdale College in\n1885\n.\nFinkel\n, writing in\n[\n2\n]\nnearly twenty-five years before Martin's death, says that he:-\n... has that rare and happy faculty of presenting his solutions in the simplest mathematical language, so that those who have mastered the elements of the various branches of mathematics, are able to understand his reasoning.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}