{
  "nome_completo": "Arthur Erdélyi",
  "nome_curto": "Arthur Erdélyi",
  "ano_nascimento": "1908",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Erdelyi/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Arthur Erdélyi\n's father was Ignác József Armin Diamant and his mother was Frieda Roth. One might reasonably ask why Erdélyi's father had the family name Diamant and not Erdélyi. Well Arthur Erdélyi was indeed named Arthur Diamant, but his father died when he was young and his mother remarried. Frieda's second husband adopted Arthur and at that time his name was changed to Erdélyi, the name of his adopted father.\nHe attended primary and secondary schools in Budapest from\n1914\nto\n1926\n. His interest in mathematics goes back to this period. As a Jew it was difficult for him to receive a university education in Hungary so he went to Brno, Czechoslovakia, to study electrical engineering. However after winning prizes in a mathematics competition in his first year, he was persuaded to study mathematics. He began research in mathematics and his first paper was published in\n1930\n.\nBy the end of\n1936\nErdélyi had\n18\npapers in print, another\n11\nappearing in\n1937\n. Erdélyi wrote no doctoral thesis, he merely matriculated at the University of Prague, and submitted his papers instead of a thesis. He was awarded a doctorate in\n1938\nbut because of the Nazi invasion of Czechoslovakia he was told he had to leave the country by the end of\n1938\nor be sent to a concentration camp.\nMany of Erdélyi's papers were on the\nhypergeometric function\nso it was natural for him to write to\nWhittaker\nfor help.\nWhittaker\nfound great difficulties in providing the help required: he had to obtain £\n400\nto support Erdélyi before a visa could be obtained. On\n26\nJanuary\n1939\nErdélyi wrote to\nWhittaker\n:-\nNecessity and danger compel me to trouble you once more. ... You know, perhaps, what it means today if a Jew is to be put on the German or Hungarian frontier.\nHowever within a few days of writing the letter Erdélyi was in Edinburgh. For two years he held a research grant from Edinburgh then he became a lecturer there.\nIn\n1946\nBateman\ndied and\nWhittaker\nwas asked to recommend someone who could undertake the project of publishing\nBateman\n's manuscripts.\nWhittaker\nadvised that Erdélyi was the person to undertake the project and in\n1947\nErdélyi arrived in Caltech as Visiting Professor. After returning to Edinburgh for session\n1948\n/\n49\nhe resigned in\n1949\nto take up a chair in California.\nAt Caltech Erdélyi headed a team which produced\n3\nvolumes of\nHigher Transcendental Functions\nand\n2\nvolumes of\nTables of\nIntegral Transforms\n. In\n[\n3\n]\nthese works are described as:-\n... the most widely cited mathematical works of all time and a basic reference source for generations of applied mathematicians and physicists throughout the world.\nIn\n1964\nhe returned to Edinburgh where a second chair of mathematics had been created to provide leadership since\nAitken\nwas in very poor health. He remained in Edinburgh until his death, continuing to produce a steady stream of high quality papers up to the time of his death. A list of\n178\nmathematical papers and articles is given in\n[\n3\n]\n.\nErdélyi was a leading expert on\nspecial functions\n, in particular hypergeometric functions, orthogonal polynomials and\nLamé\nfunctions. He also worked on asymptotic analysis, fractional integration and singular\npartial differential equations\n. In addition to the five volumes which arose from the\nBateman\nproject mentioned above, Erdélyi wrote two other texts of major importance\nAsymptotic expansions\n(1955)\nand\nOperational calculus and generalised functions\n(1962)\n.\nColton in\n[\n3\n]\nsums up Erdélyi's contribution saying:-\nHis reputation was based on much more than his published papers, although this alone would have sufficed to make him one of the leading analysts of his day. It was rather a combination of his mathematical scholarship, his interest and enthusiasm for mathematics, his concern for younger workers, and his willingness to devote his time in aid of the mathematical community that won Erdélyi the admiration and respect of an entire generation of mathematicians.\nErdélyi received many honours, the most prestigious being elected a Fellow of the\nRoyal Society\nin\n1975\n. He had been elected a fellow of the\nRoyal Society of Edinburgh\nin\n1945\n, receiving their Gunning Victoria Jubilee Prize in\n1977\n, and elected a member of the\nAcademy of Sciences of Turin\nin\n1953\n.\nHis contributions are summed up in\n[\n2\n]\nas follows:-\nErdélyi was a mathematician of immense talent and had a wonderful ability to range over the fields of both pure and applied mathematics. ... His books and research papers together with the achievements of his many research students are a permanent record of the outstanding contribution he made to the subject of mathematics to which devoted his life.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}