{
  "nome_completo": "Arthur Byron Coble",
  "nome_curto": "Arthur Coble",
  "ano_nascimento": "1878",
  "ano_morte": "1966",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coble/",
  "lugar_nascimento": "Williamstown, Pennsylvania, USA",
  "lugar_morte": "Harrisburg, Pennsylvania, USA",
  "biografia": "Arthur Coble\n's parents were Emma I Haegy and Ruben Coble. His mother Emma was a teacher and his father Ruben was, at the time of Arthur's birth, the manager of a store, but later he became president of a bank. Ruben and Emma Coble were Lutherans and they were part of the large Lutheran community of Pennsylvania. The Lutheran community was, however, split into many different factions and the Evangelical Lutheran Church in America, to which the Cobles belonged, had a long history of growth, mergers, and amalgamations and was going through a difficult period when Arthur was young. Although Arthur was brought up strictly as an Evangelical Lutheran, he rejected this Church when he reached adulthood.\nCoble entered the Pennsylvania College of Gettysburg, the oldest existing Lutheran college in the United States founded in\n1832\n, in\n1893\n. The College was renamed Gettysburg College in\n1921\n. Coble graduated with an A.B. in\n1897\nand, after spending a year as a public school teacher, he began his doctoral studies at Johns Hopkins University in\n1898\n. He undertook research into\nalgebraic geometry\nand was awarded his Ph.D. for his thesis\nThe Relation of the Quartic Curve to Conics\nin\n1902\n. His thesis supervisor was\nFrank Morley\n.\nCoble was appointed an instructor in mathematics at the University of Missouri in\n1902\nand then was appointed to Johns Hopkins University in\n1903\nwhere he became\nMorley\n's research assistant. He published his doctoral dissertation as\nThe quartic curve as related to conics\nin the\nTransactions of the American Mathematical Society\nin the year he took up the research assistant position in Baltimore. The Carnegie Institution of Washington had been founded in\n1902\nby Andrew Carnegie to contribute to various areas of scientific research and one of the first pieces of research the Institution supported was that of Coble and\nMorley\n. The funding was generous enough that Coble was able to use the grant to travel abroad and, as was the custom for American mathematicians at that time, he travelled to Germany where he studied at Greifswald University and Bonn University. His aim was to work with\nEduard Study\nwho was well known to the mathematicians at Johns Hopkins University since he had taught there in\n1893\n.\nStudy\nwas the professor at Greifswald but he moved in the middle of\n1904\nto Bonn. Returning to the United States for the start of the\n1904\n-\n05\nsession, Coble was appointed as an instructor in mathematics at Johns Hopkins University.\nIn\n1905\nCoble married Abby Walker Adams Whitney; they had four children. He was promoted to associate professor in\n1909\nbut he left Johns Hopkins when offered a full professorship at the University of Illinois at Urbana-Champaign in\n1918\n. Except for being a visiting professor at Chicago in\n1919\nand the year\n1927\n-\n28\nwhich he spent back at Johns Hopkins University, Coble remained at the University of Illinois for the rest of his career.\nHis interests in research relate to finite geometries and the\ngroup theory\nrelated to them, and to\nCremona\ntransformations related to the\nGalois theory\nof equations. Later in his career he studied the relations between hyperelliptic\ntheta functions\n, irrational binary invariants, the Weddle surface and the\nKummer\nsurface. His early papers, written while he was at Johns Hopkins University, include:\nOn the relation between the three-parameter groups of a cubic space curve and a quadric surface\n(1906)\n;\nAn application of the form-problems associated with certain Cremona groups to the solution of equations of higher degree\n(1908)\n;\nAn application of Moore's cross-ratio group to the solution of the sextic equation\n(1911)\n;\nAn application of finite geometry to the characteristic theory of the odd and even theta functions\n(1913)\n; and\nPoint sets and allied Cremona groups\n(1915)\n.\nIn\n1929\nCoble published the monograph\nAlgebraic geometry and theta functions\nin the\nAmerican Mathematical Society Colloquium Publications\n, being the tenth such volume. It became a classic and the\nAmerican Mathematical Society\nrepublished it in\n1961\n, then again in\n1982\n. Some of his later publications include\nConfigurations defined by theta functions\npublished in the\nDuke Mathematical Journal\nin\n1939\n. This paper reviews the invariant theory of\nCremona\ntransformations as developed by Coble in his earlier papers. A linear homogeneous transformation, with integral coefficients, is associated with a\nCremona\ntransformations and these transformations form a group which Coble studied. In particular, taking the integral coefficients modulo\nm\nm\nm\n, for some\nm\nm\nm\n, leads to a finite factor group. In\n1940\n, also in the\nDuke Mathematical Journal\n, he published\nTrilinear forms\n. In the year before he retired he published\nTernary and quaternary elimination\n(1946)\nwhich extends work by\nMacaulay\nand\nvan der Waerden\n, and also extends work done by\nMorley\nand Coble some\n20\nyears earlier.\nIn\n1934\nCoble became Head of the Department of Mathematics at the University of Illinois and continued in this role until he retired in\n1947\n. He contributed to the war effort during World War II by running a special accelerated degree programme for navy personnel. By the time he retired in\n1947\nhis health was already deteriorating due to Parkinson's disease. However he accepted a one year post at Haverford College but after teaching for one semester he found his increasing health problems too much to continue and he resigned. He was involved in a car crash in\n1956\nwhich left him unable to walk without assistance. He then moved to Lykens, Pennsylvania, where he lived out the final ten years of his life. He died in a hospital in Harrisburg, Pennsylvania.\nCoble worked hard and effectively for the\nAmerican Mathematical Society\nover many years. He was vice-president of the Society in\n1917\n, then he edited the\nTransactions of the American Mathematical Society\nfor five years from\n1920\n. He was involved with editing the\nAmerican Journal of Mathematics\nover many years between\n1918\nand\n1933\n. However his most important work for the\nAmerican Mathematical Society\nwas done over the years\n1933\n-\n34\nwhen he was president. The Society at that time was in some financial difficulties and it was to Coble's great credit that he dealt so effectively with the problem. He wrote a letter as part of the campaign to put the Society on a proper financial footing which shows his position clearly:-\nIt would hardly seem just for a university, year after year, definitely to plan on a research program without also correspondingly arranging at least to pay in part for the publication of the results of such a program. It is only through the publication of the results of research that its support can be adequately justified. The universities which are constantly encouraging a larger and larger output of research and are thereby gaining more and more prestige might well be expected to contribute.\nArchibald in\n[\n1\n]\ngives some indication of Coble's hobbies, writing that he enjoyed:-\n... golf, tennis, swimming, tramping, bridge, billiards, and light reading.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}