{
  "nome_completo": "Arthur Hirsch",
  "nome_curto": "Arthur Hirsch",
  "ano_nascimento": "1866",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hirsch_Arthur/",
  "lugar_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Arthur Hirsch\nattended both primary and secondary school in Königsberg, and completed his school education in\n1882\n. Hirsch studied mathematics, physics and philosophy in his hometown and in Berlin. Among his teachers in Königsberg were\nHilbert\nand his future colleague\nHurwitz\n, who remarked that Hirsch was 'one of his most talented students in Königsberg'\n[\n2\n]\n. In\n1892\nhe received his doctorate from the University of Königsberg for his thesis\nZur Theorie der linearen Differentialgleichungen mit rationalem Integral\nⓉ\n(\nOn the theory of linear differential equations with rational integral\n)\n.\nA year later he moved to Zürich where he\nhabilitated\nas\nPrivatdozent\nfor mathematics at the Polytechnic, upon the recommendation of\nHurwitz\n. He also became\nHurwitz\n's assistant, and took over some of his lectures when\nHurwitz\nhad to reduce his workload due to illness after\n1900\n. Hirsch became Titularprofessor in\n1897\n, and in\n1903\nhe was appointed to an ordinary professorship, succeeding\nMinkowski\nin his chair for higher mathematics\n[\n3\n]\n. He taught 'differential equations, variational calculus and hypergeometric integrals of higher order'\n[\n5\n]\n, mainly to future engineers, 'but he did not leave too many marks'\n[\n5\n]\n. Hirsch acted as co-advisor and second examiner for a number of PhD theses between\n1916\nand\n1926\n, but none of the PhD candidates became influential in mathematics. He was Deputy Head of the Department for Mathematics and Physics Teachers for more than a decade. In\n1909\nHirsch was listed as Deputy Head in the School Board minutes for the first time; he was re-elected every other year until\n1921\n. After that the minutes do not contain the list of Department Heads anymore\n[\n6\n]\n.\nPólya\n(\nwho went to Zürich in\n1914)\nrecalls that he also was 'Department Head at the ETH in the first years I was there'\n[\n4\n]\n.\nHirsch published a few papers in\nMathematische Annalen\n, primarily on differential equations and integrals. Examples of his publications are\nDie Existenzbedingungen des verallgemeinerten kinetischen Potentials\nⓉ\n(\nConditions  for the existence of the generalized kinetic potential\n)\n(1898)\nand\nÜber bilineare Relationen zwischen hypergeometrischen Integralen höherer Ordnung\nⓉ\n(\nOn bilinear relations between hypergeometric integrals of higher order\n)\n(1899)\n.\nHirsch was a member of the\nSwiss Mathematical Society\n; he also attended some of the\nGerman Mathematical Society\n's annual meetings. Unlike many of his German colleagues who stayed in Zürich for the rest of their lives, it seems that he did not acquire Swiss citizenship.\nHirsch joined the organising committee of the first International Congress of Mathematicians in December\n1896\n. At the meeting on\n21\nJanuary\n1897\nHurwitz\nand\nRudio\nsuggested that Hirsch join the reception committee\n(\nalongside\nBurkhardt\nand\nGubler\n)\n, partly in order to help deal with the congress publications. As assistant German-speaking secretary he was also involved in finalising the congress programme\n(\nwith\nGeiser\n,\nFranel\nand\nDumas\n)\n. During the congress he acted as\nRudio\n's personal secretary.   Like his colleagues\nDumas\nand\nFranel\n, Hirsch was on the organising committee for the\n1932\nICM in Zürich, but did not give a talk during the congress.\nArthur Hirsch retired in\n1936\n.",
  "math_areas": [
    "Calculus"
  ]
}