{
  "nome_completo": "Aryabhata the Elder",
  "nome_curto": "Aryabhata",
  "ano_nascimento": "476",
  "ano_morte": "550",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aryabhata_I/",
  "lugar_nascimento": "Kusumapura (now Patna), India",
  "lugar_morte": "India",
  "biografia": "Aryabhata\nis also known as\nAryabhata I\nto distinguish him from the later mathematician of the same name who lived about\n400\nyears later.\nAl-Biruni\nhas not helped in understanding Aryabhata's life, for he seemed to believe that there were two different mathematicians called Aryabhata living at the same time. He therefore created a confusion of two different Aryabhatas which was not clarified until\n1926\nwhen B Datta showed that\nal-Biruni\n's two Aryabhatas were one and the same person.\nWe know the year of Aryabhata's birth since he tells us that he was twenty-three years of age when he wrote\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nwhich he finished in\n499\n. We have given Kusumapura, thought to be close to Pataliputra\n(\nwhich was refounded as Patna in Bihar in\n1541)\n, as the place of Aryabhata's birth but this is far from certain, as is even the location of Kusumapura itself. As Parameswaran writes in\n[\n26\n]\n:-\n... no final verdict can be given regarding the locations of Asmakajanapada and Kusumapura.\nWe do know that Aryabhata wrote\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nin Kusumapura at the time when Pataliputra was the capital of the Gupta empire and a major centre of learning, but there have been numerous other places proposed by historians as his birthplace. Some conjecture that he was born in south India, perhaps Kerala, Tamil Nadu or Andhra Pradesh, while others conjecture that he was born in the north-east of India, perhaps in Bengal. In\n[\n8\n]\nit is claimed that Aryabhata was born in the Asmaka region of the Vakataka dynasty in South India although the author accepted that he lived most of his life in Kusumapura in the Gupta empire of the north. However, giving Asmaka as Aryabhata's birthplace rests on a comment made by\nNilakantha\nSomayaji in the late\n15\nth\ncentury. It is now thought by most historians that\nNilakantha\nconfused Aryabhata with\nBhaskara I\nwho was a later commentator on the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\n.\nWe should note that Kusumapura became one of the two major mathematical centres of India, the other being Ujjain. Both are in the north but Kusumapura\n(\nassuming it to be close to Pataliputra\n)\nis on the Ganges and is the more northerly. Pataliputra, being the capital of the Gupta empire at the time of Aryabhata, was the centre of a communications network which allowed learning from other parts of the world to reach it easily, and also allowed the mathematical and astronomical advances made by Aryabhata and his school to reach across India and also eventually into the Islamic world.\nAs to the texts written by Aryabhata only one has survived. However Jha claims in\n[\n21\n]\nthat:-\n... Aryabhata was an author of at least three astronomical texts and wrote some free stanzas as well.\nThe surviving text is Aryabhata's masterpiece the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nwhich is a small astronomical treatise written in\n118\nverses giving a summary of Hindu mathematics up to that time. Its mathematical section contains\n33\nverses giving\n66\nmathematical rules without proof. The\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\ncontains an introduction of\n10\nverses, followed by a section on mathematics with, as we just mentioned,\n33\nverses, then a section of\n25\nverses on the reckoning of time and planetary models, with the final section of\n50\nverses being on the sphere and eclipses.\nThere is a difficulty with this layout which is discussed in detail by\nvan der Waerden\nin\n[\n35\n]\n.\nVan der Waerden\nsuggests that in fact the\n10\nverse\nIntroduction\nwas written later than the other three sections. One reason for believing that the two parts were not intended as a whole is that the first section has a different meter to the remaining three sections. However, the problems do not stop there. We said that the first section had ten verses and indeed Aryabhata titles the section\nSet of ten giti stanzas\n. But it in fact contains eleven giti stanzas and two arya stanzas.\nVan der Waerden\nsuggests that three verses have been added and he identifies a small number of verses in the remaining sections which he argues have also been added by a member of Aryabhata's school at Kusumapura.\nThe mathematical part of the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\ncovers arithmetic, algebra, plane trigonometry and spherical trigonometry. It also contains\ncontinued fractions\n,\nquadratic equations\n, sums of power series and a table of sines. Let us examine some of these in a little more detail.\nFirst we look at the system for representing numbers which Aryabhata invented and used in the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\n. It consists of giving numerical values to the\n33\nconsonants of the Indian alphabet to represent\n1\n,\n2\n,\n3\n, ... ,\n25\n,\n30\n,\n40\n,\n50\n,\n60\n,\n70\n,\n80\n,\n90\n,\n100\n. The higher numbers are denoted by these consonants followed by a vowel to obtain\n100\n,\n10000\n, .... In fact the system allows numbers up to\n1\n0\n18\n10^{18}\n1\n0\n1\n8\nto be represented with an alphabetical notation. Ifrah in\n[\n3\n]\nargues that Aryabhata was also familiar with numeral symbols and the place-value system. He writes in\n[\n3\n]\n:-\n... it is extremely likely that Aryabhata knew the sign for zero and the numerals of the place value system. This supposition is based on the following two facts: first, the invention of his alphabetical counting system would have been impossible without zero or the place-value system; secondly, he carries out calculations on square and cubic roots which are impossible if the numbers in question are not written according to the place-value system and zero.\nNext we look briefly at some algebra contained in the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\n. This work is the first we are aware of which examines integer solutions to equations of the form\nb\ny\n=\na\nx\n+\nc\nby = ax + c\nb\ny\n=\na\nx\n+\nc\nand\nb\ny\n=\na\nx\n−\nc\nby = ax - c\nb\ny\n=\na\nx\n−\nc\n, where\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nare integers. The problem arose from studying the problem in astronomy of determining the periods of the planets. Aryabhata uses the kuttaka method to solve problems of this type. The word\nkuttaka\nmeans \"to pulverise\" and the method consisted of breaking the problem down into new problems where the coefficients became smaller and smaller with each step. The method here is essentially the use of the Euclidean algorithm to find the highest common factor of\na\na\na\nand\nb\nb\nb\nbut is also related to continued fractions.\nAryabhata gave an accurate approximation for π. He wrote in the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nthe following:-\nAdd four to one hundred, multiply by eight and then add sixty-two thousand. the result is approximately the circumference of a circle of diameter twenty thousand. By this rule the relation of the circumference to diameter is given.\nThis gives\nπ\n=\n62832\n20000\n=\n3.1416\n\\pi = \\large\\frac{62832}{20000}\\normalsize  = 3.1416\nπ\n=\n2\n0\n0\n0\n0\n6\n2\n8\n3\n2\n​\n=\n3\n.\n1\n4\n1\n6\nwhich is a surprisingly accurate value. In fact π =\n3\n.\n14159265\ncorrect to\n8\nplaces. If obtaining a value this accurate is surprising, it is perhaps even more surprising that Aryabhata does not use his accurate value for π but prefers to use √\n10\n=\n3\n.\n1622\nin practice. Aryabhata does not explain how he found this accurate value but, for example, Ahmad\n[\n5\n]\nconsiders this value as an approximation to half the perimeter of a regular polygon of\n256\nsides inscribed in the unit circle. However, in\n[\n9\n]\nBruins shows that this result cannot be obtained from the doubling of the number of sides. Another interesting paper discussing this accurate value of π by Aryabhata is\n[\n22\n]\nwhere Jha writes:-\nAryabhata I's value of π is a very close approximation to the modern value and the most accurate among those of the ancients. There are reasons to believe that Aryabhata devised a particular method for finding this value. It is shown with sufficient grounds that Aryabhata himself used it, and several later Indian mathematicians and even the Arabs adopted it. The conjecture that Aryabhata's value of π is of Greek origin is critically examined and is found to be without foundation. Aryabhata discovered this value independently and also realised that π is an\nirrational\nnumber. He had the Indian background, no doubt, but excelled all his predecessors in evaluating π. Thus the credit of discovering this exact value of π may be ascribed to the celebrated mathematician, Aryabhata I.\nWe now look at the trigonometry contained in Aryabhata's treatise. He gave a table of sines calculating the approximate values at intervals of\n90\n°\n24\n\\large\\frac{90°}{24}\\normalsize\n2\n4\n9\n0\n°\n​\n=\n3\n°\n45\n'. In order to do this he used a formula for\nsin\n⁡\n(\nn\n+\n1\n)\nx\n−\nsin\n⁡\nn\nx\n\\sin(n + 1)x - \\sin nx\nsin\n(\nn\n+\n1\n)\nx\n−\nsin\nn\nx\nin terms of\nsin\n⁡\nn\nx\n\\sin nx\nsin\nn\nx\nand\nsin\n⁡\n(\nn\n−\n1\n)\nx\n\\sin (n - 1)x\nsin\n(\nn\n−\n1\n)\nx\n. He also introduced the versine\n(\nversin =\n1\n- cosine\n)\ninto trigonometry.\nOther rules given by Aryabhata include that for summing the first\nn\nn\nn\nintegers, the squares of these integers and also their cubes. Aryabhata gives formulae for the areas of a triangle and of a circle which are correct, but the formulae for the volumes of a sphere and of a pyramid are claimed to be wrong by most historians. For example Ganitanand in\n[\n15\n]\ndescribes as \"mathematical lapses\" the fact that Aryabhata gives the incorrect formula\nV\n=\nA\nh\n/\n2\nV = Ah/2\nV\n=\nA\nh\n/\n2\nfor the volume of a pyramid with height h and triangular base of area\nA\nA\nA\n. He also appears to give an incorrect expression for the volume of a sphere. However, as is often the case, nothing is as straightforward as it appears and Elfering\n(\nsee for example\n[\n13\n]\n)\nargues that this is not an error but rather the result of an incorrect translation.\nThis relates to verses\n6\n,\n7\n, and\n10\nof the second section of the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nand in\n[\n13\n]\nElfering produces a translation which yields the correct answer for both the volume of a pyramid and for a sphere. However, in his translation Elfering translates two technical terms in a different way to the meaning which they usually have. Without some supporting evidence that these technical terms have been used with these different meanings in other places it would still appear that Aryabhata did indeed give the incorrect formulae for these volumes.\nWe have looked at the mathematics contained in the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nbut this is an astronomy text so we should say a little regarding the astronomy which it contains. Aryabhata gives a systematic treatment of the position of the planets in space. He gave the circumference of the earth as\n4\n967\nyojanas and its diameter as\n1581\n1\n24\n1 581\\large\\frac{1}{24}\\normalsize\n1\n5\n8\n1\n2\n4\n1\n​\nyojanas. Since\n1\nyojana =\n5\nmiles this gives the circumference as\n24\n835\nmiles, which is an excellent approximation to the currently accepted value of\n24\n902\nmiles. He believed that the apparent rotation of the heavens was due to the axial rotation of the Earth. This is a quite remarkable view of the nature of the\nsolar system\nwhich later commentators could not bring themselves to follow and most changed the text to save Aryabhata from what they thought were stupid errors!\nAryabhata gives the radius of the planetary orbits in terms of the radius of the Earth/Sun orbit as essentially their periods of rotation around the Sun. He believes that the Moon and planets shine by reflected sunlight, incredibly he believes that the orbits of the planets are\nellipses\n. He correctly explains the causes of eclipses of the Sun and the Moon. The Indian belief up to that time was that eclipses were caused by a demon called Rahu. His value for the length of the year at\n365\ndays\n6\nhours\n12\nminutes\n30\nseconds is an overestimate since the true value is less than\n365\ndays\n6\nhours.\nBhaskara I\nwho wrote a commentary on the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nabout\n100\nyears later wrote of Aryabhata:-\nAryabhata is the master who, after reaching the furthest shores and plumbing the inmost depths of the sea of ultimate knowledge of mathematics, kinematics and spherics, handed over the three sciences to the learned world.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Number Theory"
  ]
}