{
  "nome_completo": "Étienne E Bobillier",
  "nome_curto": "Étienne Bobillier",
  "ano_nascimento": "1798",
  "ano_morte": "1840",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bobillier/",
  "lugar_nascimento": "Lons-le-Saunier, France",
  "lugar_morte": "Châlons-sur-Marne, France",
  "biografia": "Étienne Bobillier\n's parents were Ignace Bobillier and Marie Rosalie Rollet. Ignace had been born in Lons-le-Saulnier in the early\n1760\ns, the youngest of the three children of Étienne Bobillier and Catherine Prat. He was a merchant who had a business selling wallpaper in Lons-le-Saulnier and had married Marie Rosalie from Dijon, the daughter of Jean-Baptiste Rollet and Marie Thoridenet. Ignace and Marie Rosalie Bobillier had four children, the eldest being a son Marie André\n(\nborn\n7\nDecember\n1795)\nand the next being Étienne\n(\nthe subject of this biography\n)\n. Étienne had a younger brother André Ignace\n(\nborn\n21\nAugust\n1801\nbut who probably died while a child\n)\nand a younger sister Louise Suzanne Eugénie\n(\nborn\n21\nDecember\n1802)\n. Étienne's father, Ignace, died on\n31\nJuly\n1806\nwhen his son was eight years old. Marie Rosalie, Étienne's mother, continued to run the wallpaper business after the death of her husband and was able to give her sons a good education.\nÉtienne Bobillier showed no interest in mathematics up to the age of\n16\nbut he did show considerable interest in literary studies and won several prizes for his performance at the local lycée. After his brother Marie André graduated from the lycée of Besançon and was admitted to the École Polytechnique on\n1\nNovember\n1813\n, Étienne decided that he wanted to emulate him. He found mathematics books which his brother had left behind and began to study on his own. His enthusiasm quickly grew and he was encouraged in his studies by his brother who assisted him from time to time. He completed the course in special mathematics and, in\n1817\n, put himself forward for entry into the École Polytechnique. At the age of nineteen Bobillier was examined by Charles Louis Dinet, one of the École Polytechnique's admissions examiners. It was the entrance examiners who decided which students would be admitted and, in addition to Dinet,\nLouis Poinsot\nand\nAntoine-André-Louis Reynaud\nwere also entrance examiners at this time. Perhaps it is worth noting that Dinet was known as a very tough examiner, and around ten years later he would fail\nÉvariste Galois\n. Bobillier was placed in first position among those students examiner by Dinet and, in the overall ranked list for entry in that year, he was placed fourth. By this time his brother Marie André had graduated from the École Polytechnique and, opting for a military career, was undergoing training in Metz. In fact the École Polytechnique had changed somewhat between the time that the two brothers studied there. Following the defeat of Napoleon Bonaparte, there was a debate in\n1816\nwhether the École should be closed but, mainly due to efforts by\nLaplace\n, it was decided that it should continue to operate but with a smaller intake and some changes to the syllabus, particularly dropping of the course in military arts. In his first year of study Étienne Bobillier performed very well indeed, completing the year ranked eighth out of the sixty-four students who completed the course that year. He had been taught by\nSiméon-Denis Poisson\nwho was impressed with his enthusiastic student. However, being short of money, Bobillier left the École Polytechnique in\n1818\nto became a mathematics instructor at the École des Arts et Métiers at Châlons-sur-Marne. The position was offered to a student of the École Polytechnique and Bobillier was quick to take up the offer. He immediately displayed a remarkable talent for teaching mathematics\n[\n5\n]\n:-\n... exhibiting a rapid judgment, lively mind, lucid language, and strength of character that impressed, captivated, and subdued his students.\nHe taught the full range of mathematical topics, analytic geometry, descriptive geometry, trigonometry and statics. He also taught more practical topics and other sciences such as practical mechanics, physics and chemistry. In the\nBulletin de Férussac\nin\n1825\nBobillier announced his intention to publish a three volume\nPrincipes d'algèbre\nⓉ\n(\nPrinciples of algebra\n)\n. These were published in\n1825\n-\n26\nand we quote the Preface written by Bobillier:-\nThese Principles of Algebra are specially written for my students; I hope, however, that it may be of some help to those who undertake the study of this science without the help of a teacher, and also to those more advanced, who propose to revise what they have previously learnt. It is divided into three Books. I have tried to explain everything that it is necessary to understand in order to successfully follow courses in analytic geometry and in rational mechanics which were entrusted to me, requiring, however, that I did not exceed the level taught at the École d'Arts et Métiers.\nThe first Book contains the complete theory of algebraic operations; I have attached, in the form of a supplement, an elementary proof of\nNewton\n's binomial theorem. The second and the third Books, deal with the solution of problems, and the equations which derive from them; the latter, with certain algebraic methods which enable numerical calculations to be shortened.\nI chose from proofs known to me, those which seem to me to be the clearest and the simplest. I have focused above all on giving the best order in which to present the material, and to express the results with geometric precision, totally convinced that this method is the clearest and the most likely to hasten the progress of beginners.\nThe book proved very popular with editions continuing to be published long after Bobillier's death; for example, a tenth edition of this book was published in\n1879\n. It was adopted by the Ministry of Agriculture, Commerce and Public Works for use in Écoles d'Arts et Métiers.\nBobillier corresponded with Poncelet during the years\n1828\n-\n29\nand worked on geometric problems\n[\n1\n]\n:-\nLoyal to\nGaspard Monge\n's ideas, Bobillier treated geometric problems in a way akin to both analytic geometry and projective geometry. He first set up a problem in the form of an equation in a particular case, simple enough so that the analytic geometry of his time could deal with it. Then, through a transformation by reciprocal polars, he obtained the dual. In this respect he was a disciple of\nGergonne\n.\nHe was the first to use\nz\n↦\n1\nz\nz \\mapsto  \\Large\\frac{1}{z}\\normalsize\nz\n↦\nz\n1\n​\nin the study of\nconic sections\n. He is best known for his work on polars of curves and of algebraic surfaces. In\nMemoire sur I'hyperbole équilatère\nⓉ\n(\nMemoir on the equilateral hyperbola\n)\npublished in\nGergonne\n's\nAnnales de mathématiques pures et appliquées\n(1829)\nhe proved what today is known as 'Bobillier's theorem':\nThe pedal circle of any point on a rectangular hyperbola for any triangle inscribed in the curve passes through the centre of the hyperbola.\nHe also showed that the\ntangents\ndrawn from a point to a plane curve of order\nm\nm\nm\nhave their points of contact on a curve of order\nm\n−\n1\nm - 1\nm\n−\n1\nwhich he called the polar of the point.\nBobillier did not see much prospect of a good career at the École des Arts et Métiers at Châlons-sur-Marne and indicated that he wanted a university post. In\n1829\nhe was recommended by\nPoisson\nfor the post of professor of mathematics at the Collège Royal in Amiens. However he was sent as director of studies to the École in Angers, taking up that position on\n1\nJanuary\n1830\n. On\n26\nJuly of that year Charles X published ordinances restricting press freedom and disenfranchising about three-quarters of the population. There was an immediate revolution which the royal forces failed to contain and king Charles X fled the country. The National Guard was the force which helped to overthrow Charles X during the\n1830\nrevolution. After the July revolution, however, armed groups of peasants who were opposed to Louis-Philippe, now installed as king of the French, started what was essentially a civil war in the Maine-et-Loire region. Bobillier was not a man with strong political convictions, but he was patriotic and sought to help his country so he volunteered to join the National Guard of Angers who were sent to put down the revolt. After the revolt, which was over in a month during which he had faced danger with great bravery, he returned to his duties at the École in Angers.\nThe theory of centroids by\nChasles\n(1830)\nwas used by Bobillier in his construction of centres of curvature of plane roulettes in\n1831\n. In the following year he published the book\nCours de géométrie à l'usage des élèves de l'école royale d'arts et métiers d'Angers\nⓉ\n(\nGeometry lessons for students of the Royal School of Arts and Trades at Angers\n)\n. Like his algebra text, this book ran to many editions. A second edition was published in\n1834\nand a third edition in\n1837\n. Also like his algebra text, his geometry book continued to appear in new editions long after his death\n(\nfor example; a fourteenth edition was published in\n1870)\nand his geometry book was adopted by the Ministry of Agriculture, Commerce and Public Works for use in Écoles d'Arts et Métiers. In\n1832\nhis post at the École in Angers was abolished. This was a time of great uncertainty in France and there was little stability anywhere. After returning to Châlons as director of studies he was promoted to professor of mathematics there in\n1833\n. He was a highly successful teacher and, over the following years, eight of his pupils were accepted for entry into the École Polytechnique and a number of pupils also gained admission to other prestigious institutions.\nWe could say a little about other members of Bobillier's family. His brother, Marie André, served in the artillery, fighting in campaigns in Spain in the\n1820\ns, then was sent to Africa in\n1830\nand took part in fighting round Algiers. He was made a knight of the Légion d'Honneur on\n13\nNovember\n1832\n. He died on\n28\nApril\n1838\n. Bobillier's sister, Louise Suzanne Eugénie, continued living in Lons-le-Saulnier where she married Charles Louis Antoine Gilliart, from Cambrai, on\n11\nDecember\n1833\n. Gilliart, like Bobillier's brother, was a military man who had been made a knight of the Légion d'Honneur in\n1825\n.\nThe post at Châlons was to be Bobillier's last since in\n1836\nhe became ill\n[\n5\n]\n:-\nLiving far from his family, Étienne Bobillier ignored for a long time the pleasures of domestic life. A serious illness, which he suffered in\n1836\n, made him realise his isolation. In\n1837\n, he married. The love of a young wife, the affection with which he surrounded his new family, became a source of happy feelings for him. He started a new life which, sadly, lasted too short a time.\nRefusing to take time to recuperate from the recurring illness, he continued to teach. As well as teaching the special mathematics course, which he greatly enjoyed, he also taught classes in the evenings. Two hours a day was spent correcting his pupils tests. He also continued undertaking research and continued to write textbooks. As we mentioned above, he had published a second edition of his geometry text in\n1832\nand a third edition two years later. He immediately began working on a fourth edition, and at the same time began work on writing a textbook on physics and mechanics. This hard work hastened his death at the early age of\n42\n. At the time of his death he was working on problems in kinematics, having earlier studied statics and in particular the\ncatenary\n[\n1\n]\n:-\nAt the time of his death, Bobillier was working on a dissertation concerning the geometric laws of motion that he meant to present as a report before the\nAcadémie des Sciences\n. Some of the passages in his course in geometry are probably an early outline for this. ... Bobillier's demonstration of the principle of virtual velocities consisted in substituting \"for any ordinary machine, whose character can be changed in an infinite number of ways, the winch, whose conditions of equilibrium are so well known and that, at least for the infinitely small deviation that we can estimate in its equilibrium, remains, exactly the same.\" His method is extremely clever. In kinematics there seem to be no known traces of the work Bobillier was doing toward the end of his life, although the passages in his book on geometry that treat this subject are still extant. Two theorems and one problem are particularly in evidence: All movement of a triangle on a plane can be produced by rolling a certain line over another fixed line, the triangle being invariably linked to the first line. If a triangle, abc, moves in such a fashion that the sides ab and ac constantly touch two circles, the\nenvelope\nof the third side is also a circle; and the centres of the three envelopes determine a new circle that includes all the instantaneous centres of rotation. Bobillier then went on to pose the problem of how to determine the corresponding centre of curvature in the path of the third vertex, c, when given the centres of curvature at points a and b of the paths described by vertices a and b of triangle abc. The construction he gave of this centre is known as the 'Bobillier construction'.\nHe had been made a knight of the Légion d'Honneur on\n5\nMay\n1839\n. In\n1838\nhe had been elected in a unanimous vote as vice-president of the Society of Agriculture, Commerce, Sciences and Arts of the Départment of the Marne. In the following year he was elected president of the Society, a position he held at the time of his death. After his death\nPoncelet\n, who knew him personally wrote\n[\n7\n]\n:-\nBobillier had an intelligent and singularly active mind.\nChasles\n, who did not know Bobillier personally and in fact made a serious mistake in the date of his death and Bobillier's age\n(\nwriting \"he was snatched in\n1832\nat the age of thirty-five\"\n)\n, wrote\n[\n2\n]\n:-\nWe owe remarkable researches to Bobillier, a distinguished geometer who gave hopes of great achievements for mathematical sciences.\nHis character can be easily seen from the description of his life that we have given above but we quote from those who knew him\n[\n5\n]\n:-\nIn his private life, Bobillier was good, generous and always willing to help. He would interrupt even his most important work to give advice, help, or a letter of recommendation to anyone who asked for it, and in particular to his former pupils, and these numbered in the thousands.\nBobillier was a member of a number of societies: the Société Industrielle d'Angers; the Société d'Émulation du Jura; the Société d'Émulation des Vosges; and the the Société des Sciences Physiques, Chimiques et Arts Agricoles de France.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}