{
  "nome_completo": "Atle Selberg",
  "nome_curto": "Atle Selberg",
  "ano_nascimento": "1917",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Selberg/",
  "lugar_nascimento": "Langesund, Norway",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Atle Selberg\n's parents were Ole Michael Ludvigsen Selberg\n(1877\n-\n1950)\nand Anna Kristina Brigtsdatter Skeie\n(1874\n-\n1971)\n. Ole Selberg was a school teacher of mathematics who, at age\n48\n, was awarded his doctorate from the University of Oslo for his thesis\nEin Beitrag zur Theorie der algebraisch auflösbaren Gleichungen von Primzahlgrad\nⓉ\n(\nA contribution to the theory of resolvable algebraic equations of prime degree\n)\n. At the time Atle was born his father was senior master at the Middle School in Langesund. However, shortly after Atle was born, his father moved to a school in Voss in Hordaland where he taught for three years. By\n1921\nhe was teaching at Bergen County Middle School. Atle's mother, Anna Skeie, the daughter of the teacher Brigt Arnesen Skeie\n(1846\n-\n1939)\nand Brita Hansdatter Bru\n(1842\n-\n1915)\n, was also a teacher. Ole and Anna Selberg married on\n30\nJuly\n1903\nin Halandsdal and they had nine children, five boys and four girls, Atle being the youngest of them. Three of Atle's brothers also became mathematicians. Henrik Selberg\n(1906\n-\n1993)\nwas born in Bergen. He became professor of mathematics at the University of Oslo and was interested in complex functions. The twins Sigmund Selberg\n(1910\n-\n1994)\nand Arne Selberg\n(1910\n-\n1994)\nwere born on\n11\nAugust\n1910\nin Langesund. Sigmund became a professor of mathematics at the Norwegian Institute of Technology where he was interested in prime numbers. Arne also became a professor at the Norwegian Institute of Technology. He was an applied mathematician with a particular interest in the design of suspension bridges.\nWe have noted above that Atle's father moved to take up different positions so while Atle was growing up he lived in Voss, Bergen, and then in Gjovik where his father became principal of a school in\n1932\n. Now one might expect that Atle would have learnt a lot of mathematics from his father but this does not seem to be the case. Rather it was the mathematics books that his father kept in his well-stocked library that turned Atle towards mathematics when he was a boy. At around the age of\n12\n, when the family were living in Nesttun near Bergen, Atle attended Middle School in Bergen. He said\n[\n2\n]\n:-\nFor middle school I went to Bergen by train. It was rather nice in a way, sort of a commuter train that took a little over half an hour. We did a lot of school work on the train. There were quite a few students commuting like that.\nAtle taught himself methods of solving equations by reading the books in his father's library. In a hand-written copy that his father had of\nCarl Stormer\n's lecture notes he came across the series\nπ\n4\n=\n1\n−\n1\n3\n+\n1\n5\n−\n1\n7\n+\n.\n.\n.\n\\Large\\frac{\\pi}{4}\\normalsize  = 1 - \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  - \\large\\frac{1}{7}\\normalsize  + ...\n4\nπ\n​\n=\n1\n−\n3\n1\n​\n+\n5\n1\n​\n−\n7\n1\n​\n+\n.\n.\n.\nHe remembered the occasion years later when he said it was\n(\nsee for example\n[\n18\n]\n)\n:-\n... such a very strange and beautiful relationship that I determined that I would read that book in order to find out how that formula came about.\nHowever,\nStormer\n's lecture notes began by introducing the real numbers with\nDedekind\ncuts which baffled Selberg. However, he kept reading and found these notes inspiring. At this time it was analysis that was his main interest but his brother Sigmund suggested that he read about\nChebyshev\n's work on the distribution of primes in his father's copy of one of\nJ A Serret\n's books. Selberg was attending high school in Gjovik at this time while his brother Sigmund was a student at the University of Oslo. Selberg was about\n17\nyears old when he came across\nRamanujan\n's collected works which Sigmund had taken out of the university library and brought home. He was not only greatly impressed by the mathematics he read but also he was intrigued by\nRamanujan\n's personality which he described as having \"the air of mystery\".\nStormer\nhad published an article about\nRamanujan\nin the\nNorsk Matematisk Tidsskrift\n, and Selberg had read this too. Inspired by reading about\nRamanujan\nand reading his work, Selberg turned to study number theory and began to make his own mathematical explorations. These went well and he wrote his first paper \"On some arithmetical identities\". This\n23\n-page paper, written in German, was published in\n1936\n. It is, therefore, fair to say that Selberg became a number theorist while still at high school. Mathematics wasn't the only topic that Selberg studied on his own while at high school for he also taught himself foreign languages. In fact he had started to learn English even earlier, while he was at primary school, assisted by his older sister Anna.\nIn\n1935\nSelberg graduated from the high school in Gjovik and matriculated at the University of Oslo. His brother Henrik introduced him to\nStormer\nwhose writing had already influenced him. He found\nStormer\nready to help the young undergraduate who had started to write mathematics papers. Another major influence on Selberg's mathematical development was a lecture by\nErich Hecke\nat the International Mathematical Conference in Oslo in\n1936\n. While still an undergraduate, he attended the Scandinavian Mathematical Congress in Helsinki in\n1938\nwhere he gave a\n20\n-minute talk in a session chaired by\nTorsten Carleman\n. Majoring in mathematics, he graduated from the University of Oslo with a Master's Degree in the spring of\n1939\n. In the following months he completed the first part of his compulsory military service. He had planned to go to Hamburg and discuss research with\nErich Hecke\n. He had applied for a scholarship to fund this which he received, but he changed his plans because the autumn of\n1939\nsaw the start of World War II. He would have remained in Oslo to undertake his doctoral research but the library was poor so he went to Uppsala where he attended lectures by Trygve Nagell\n(1895\n-\n1988)\nwho worked on Diophantine equations. Selberg spent most of his time in Uppsala working in the library, then returned to Oslo in December\n1939\n. However, Selberg said\n[\n7\n]\n:-\n... the war came to Norway at the beginning of April\n1940\n, and that caused an interruption of my mathematical research. I did not think about mathematics while I fought with the Norwegian forces against the German invaders in Gudbrandsdalen. We were also in the upper part of Osterdalen, and ended up near Andalsnes. I was a soldier in Major Hegstad's artillery battalion, and I held him in very high esteem. Also\n[\nI did not think about mathematics\n]\nwhile I was a prisoner of war at the prison camp at Trandum. When I finally was released, I travelled to the west coast of Norway, and later with my family to Hardanger.\nHe was appointed a research fellow in\n1942\n, the year before the award of his doctorate. His thesis, which he defended on\n22\nOctober\n1943\njust before the German invaders closed down the university at the end of November, was\nOn the zeros of Riemann's zeta-function\n. His examiners were\nHarald Bohr\nand\nThoralf Skolem\nbut because of the war\nHarald Bohr\n, who had escaped from Denmark to Sweden, could not travel to Norway.\nStormer\nwas present at the examination reading from\nHarald Bohr\n's report. Immediately after the examination, Selberg was arrested by the Germans and put in prison but was released on condition that he left Oslo and returned to Gjovik where his parents were living. He spent the rest of the war undertaking research on the Riemann hypothesis on his own in Gjovik.\nOn\n13\nAugust\n1947\nhe married the engineer Hedvig Liebermann\n(20\n.\n11\n.\n1919\n-\n6\n.\n7\n.\n1995)\nin Stockholm. Hedvig was the daughter of the furniture manufacturer Luzar Liebermann from Transylvania and Serena Sarolta Jakobovits. Atle and Hedvig Selberg had two children, Ingrid Maria Selberg\n(\nborn\n13\nMarch\n1950\nand now married to the playwright Mustapha Matura\n)\nand Lars Atle Selberg. Shortly after marrying, the Selbergs went to the United States where Atle spent the academic year\n1947\n-\n48\nat the Institute for Advanced Study in Princeton. After this year, he was offered a second year at the Institute for Advanced Study but chose to see another American University. However, to do so he had to leave the country and get a new visa. He and his wife travelled to Montreal and, with some difficulty, got new visas and returned to Princeton.\nPaul Erdős\nhad arrived at the Institute while Selberg was in Canada and they met as soon as he returned. It was at this time that Selberg and\nErdős\narrived at an elementary proof of the prime number theorem. We say more about this below.\nThe following year he spent as associate professor of mathematics at Syracuse University, returning to the Institute for Advanced Study at Princeton in\n1949\nas a permanent member. In\n1951\nSelberg was promoted to professor at Princeton. We note that Selberg's wife Hedvig was a researcher at the Institute for Advanced Study in the\n1950\ns working in von Neumann's group and later at Princeton's Plasma Physics Laboratory.\nIn\n1950\nSelberg was awarded a\nFields Medal\nat the International Congress of Mathematicians at Harvard. The Fields Medal was awarded for his work on generalisations of the sieve methods of\nViggo Brun\n, and for his major work on the zeros of the\nRiemann\nzeta function where he proved that a positive proportion of its zeros satisfy the\nRiemann\nhypothesis. The citation also mentions his elementary proof of the\nprime number theorem\n(\nwith\nP Erdős\n)\n, with a generalization to prime numbers in an arbitrary arithmetic progression. The history of the prime number theorem is very interesting. The theorem states:-\nThe number of primes ≤\nn\nn\nn\ntends to\n∞\n∞\n∞\nas\nn\nlog\n⁡\ne\nn\n\\Large\\frac{n}{\\log_e n}\nl\no\ng\ne\n​\nn\nn\n​\n.\nIt was conjectured in the\n18\nth\ncentury but despite many efforts, no proof had been found around that time.\nRiemann\ncame close to proving the result, but the theory of functions of a complex variable was not sufficiently developed to enable him to complete the proof. The necessary analytic tools were known by\n1896\nwhen\nJacques Hadamard\nand\nCharles de la Vallée Poussin\nindependently proved the theorem using complex analysis. The successful proof of this result was seen as one of the greatest achievements of\nanalytic number theory\n. In\n1949\nSelberg and\nErdős\nfound an elementary proof that makes no use of complex function theory. Subsequent events are not entirely clear but Selberg published two papers\nAn elementary proof of the prime number theorem\nand\nAn elementary proof of Dirichlet's theorem about primes in an arithmetic progression\nin volume\n50\nof the\nAnnals of Mathematics\n. The following year he published\nAn elementary proof of the prime number theorem for arithmetic progressions\n. It is not too difficult to see where the misunderstanding between Selberg and\nErdős\narose. Basically all mathematicians fit somewhere onto a \"collaboration\" line. Selberg and\nErdős\nare at the opposite extremes - most of\nErdős\n's work is published in joint papers while Selberg has hardly any joint publications. They are at opposite ends of the \"collaboration\" line!\nIn\n[\n12\n]\nEnrico Bombieri\nexplains the source of Selberg's number theory sieve and shows that the idea of Selberg's\nl\nl\nl\nmethod and of his\nl\n2\nl ^{2}\nl\n2\nsieve has its origin in his work on the analytic theory of the\nRiemann\nzeta function\n. In this work Selberg also introduced so-called mollifiers by the\nl\n2\nl ^{2}\nl\n2\nmethod. Probably Selberg's best and most important work is his trace formula for\nS\nL\n2\n(\nR\n)\nSL_{2}(\\mathbb{R})\nS\nL\n2\n​\n(\nR\n)\n, which was done several years after the work for which he was awarded the\nFields\nMedal. Selberg used his trace formula to prove that the \"Selberg zeta function\" of a\nRiemann\nsurface satisfies an analogue of the\nRiemann\nhypothesis.\nAmong the many outstanding mathematical contributions Selberg has made, there is his work on:-\n... the\nRankin\n-Selberg method, the \"mollifier\" device in the theory of\nRiemann\n's zeta function with its deep applications to zeros on or near the critical line and with Selberg's sieve as a by-product, ... Selberg's trace formula, Selberg's zeta function, ... automorphic functions,\nDirichlet\nseries.\nSelberg's collected papers were published in two volumes\n(1989\n,\n1991)\n. Matti Jutila, reviewing these, writes:-\nThe publication of the collected papers of Atle Selberg is most warmly welcomed by the mathematical community for several reasons. First of all, the author is a living classic who has profoundly influenced mathematics, especially analytic number theory in a broad sense, for about fifty years. Secondly, his papers up to\n1947\n, which appeared mostly in Norwegian series or journals of limited distribution and partly even during World War II, are now at last easily accessible. And thirdly, a lot of highly interesting mathematics comes into daylight via the two volumes of Selberg's collected papers ...\n[\nThe work puts\n]\none is in a position to appreciate as if from the inside the monumental architecture of the author's creative work.\nSelberg was one of the four editors of\nAxel Thue\n's\nSelected mathematical papers\npublished in Oslo in\n1977\n. In\n1989\nSelberg published\nReflections around the Ramanujan centenary\nwhich is the text of a talk he gave at the conclusion of the\nRamanujan\nCentenary Conference in January\n1988\nat the Tata Institute in Bombay. This tribute to\nRamanujan\n, on the\n100\nth\naniversary of his birth, shows the important influence that\nRamanujan\nhad in Selberg's mathematical development.\nRoger Heath-Brown writes about Selberg in\n[\n18\n]\nwhere he quotes from Selberg:-\nSelberg was very modest, even about his most significant achievements, as is exemplified when he said, in\n1990\n, 'I think the things I have done ... although sometimes there were technical details, and sometimes even a lot of calculation, in some of my early work ... the basic ideas were rather simple always, and could be explained in rather simple terms ... in some ways, I probably have a rather simplistic mind, so that these are the only kind of ideas I can work with. I don't think that other people have had grave difficulties in understanding my work.' Those who knew him will recognize not just the sentiment, but also his characteristic turn of phrase.\nLet us record Selberg's answer in\n[\n2\n]\nwhen he was asked about his hobbies:-\nIn my youth I was very interested in botany, and I collected a large herbarium. I don't collect plants anymore. But I'm still interested in them, and I probably know and can identify more species than most. I have collected seashells for quite a number of years.\nSelberg has received many distinctions for his work in addition to the\nFields\nMedal. He shared the\n1986\nWolf Foundation Prize in Mathematics with\nSamuel Eilenberg\n. The award was made to Selberg\n[\n4\n]\n:-\n... for his profound and original work on number theory and on discrete groups and automorphic forms. ...  In early work, Professor Atle Selberg proved that the zeros of the\nRiemann\nzeta function on the critical line have positive density. He conceived and developed the general sieve method, which has become a fundamental tool in analytic number theory. His ideas on sieves led him to his celebrated 'Selberg formula' which is the basis of his elementary proof of the prime number theorem. He discovered the trace formula, which bears his name. Out of it grew a new interaction of group representations and number theory. He initiated the study of the arithmeticity of lattices. His contributions are so deep and so many that his name is already part of the history of mathematic\nWe also note that when the\nAbel\nPrize was established in\n2002\nthey gave an honorary award to Selberg\n[\n5\n]\n:-\nIt was decided to award an honorary prize to the renowned Norwegian mathematician Atle Selberg in recognition of his status as one of the world's leading mathematicians. His contributions to mathematics are so deep and original that his name will always be an important part of the history of mathematics.\nIn addition to these awards, he has been elected to the\nNorwegian Academy of Sciences\n, the\nRoyal Danish Academy of Sciences\nand the\nAmerican Academy of Arts and Sciences\n. In\n1987\nhe was named Commander with Star of the Royal Norwegian Order of St Olav.\nWhen he reached the age of seventy, in\n1987\n, he retired from the Institute for Advanced Study at Princeton. Throughout his time at Princeton he had remained a Norwegian citizen but in the\n1990\ns he took American nationality. His wife, Hedvig, died in July\n1995\n. On\n14\nFebruary\n2003\nhe married Betty Frances\n(\n\"Mickey\"\n)\nCompton\n(1929\n-\n)\n. He died following a heart attack at his home in Princeton at the age of\n90\n. After his death many tributes were paid. Two of these are recorded in\n[\n2\n]\n(\nand in several other articles\n)\n. Peter Goddard, Director of the Institute for Advanced Study said:-\nAtle's passing marks a great loss, both to the Institute and to the larger scientific community. His far-reaching contributions have left a profound imprint on the world of mathematics, and we have lost not only a mathematical giant, but a dear friend.\nPeter Sarnak, Eugene Higgins Professor of Mathematics at Princeton University, said:-\nThe\n20\nth\ncentury was blessed with a number of very talented mathematicians, and of those, there are a few who I would say had a golden touch. In any topic about which they thought in depth, they saw further and uncovered much more - seemingly effortlessly - than the generations before them. Their work set the stage for many future developments. Atle was one such mathematician; he was a mathematician's mathematician.\nWe end with this tribute from\n[\n20\n]\n:-\nOne way of characterising Atle Selberg's mathematical genius is that he had a \"golden touch\". In those domains he thought about in depth, he saw further than generations before him, repeatedly uncovering truths lying beneath the surface. His breakthroughs on long-standing problems were based on imaginative and novel ideas which, once digested, were appreciated as simple and decisive.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}