{
  "nome_completo": "August Adler",
  "nome_curto": "August Adler",
  "ano_nascimento": "1863",
  "ano_morte": "1923",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adler/",
  "lugar_nascimento": "Opava, Austrian Silesia (now Czech Republic)",
  "lugar_morte": "Vienna, Austria",
  "biografia": "August Adler\nwas born and brought up in Opava, a city also known in German as Troppau. The city was the capital of Austrian Silesia for almost all of Adler's life, only becoming part of Czechoslovakia in\n1919\nafter the defeat of Germany and Austria-Hungary in World War I. All Adler's publications were in German but he did publish a few in Czech journals.\nIn\n1879\nAdler graduated from the secondary school in Opava\n(\nknown as Troppau at that time\n)\nand began his university studies at the University of Vienna and the University of Technology in Vienna where he was taught and greatly influenced by\nEmil Weyr\n. After taking undergraduate courses at the two universities, Adler undertook research in descriptive geometry graduating with a doctorate in\n1884\n. He began publishing during these years with papers on ruled surfaces and space curves such as:\nStriktionslinien der Regelflächen\n2\n. und\n3\n. Grades\nⓉ\n(\nStriction lines of the\n2\nnd and\n3\nrd degree ruled surfaces\n)\n(1882)\n;\nRaumkurven vierter Ordnung\n2\n. Art\nⓉ\n(\nFourth order space curves of the\n2\nnd kind\n)\n(1883)\n;\nWeitere Bemerkungen über Raumkurven vierter Ordnung\n2\n. Art\nⓉ\n(\nFurther remarks on fourth order space curves of\n2\nnd kind\n)\n(1883)\n; and\nSpezielle Raumkurven vierter Ordnung\n2\n. Art\nⓉ\n(\nSpecial fourth order space curves of the\n2\nnd kind\n)\n(1883)\n. He submitted papers to the Academy of Sciences of Vienna, now the\nAustrian Academy of Sciences\n, for example the first of these papers was reported by the Secretary of the\nAcademy\nto the meeting of the Mathematical and Natural Science Class on\n19\nJanuary\n1882\n. The\nAcademy\nreport contains the following abstract:-\nIn this paper the theory of the striction lines on a ruled surface of the second degree is studied in a purely geometrical way and the characters of the striction lines on a ruled surface of the third degree are determined. The simplest possible construction methods are sought for the striction lines on a second degree surface. In addition, there are also theorems about general rational space curves.\nWe note that a striction line is a line on a skew surface that cuts each generator in the point of the surface that is nearest to the succeeding generator.\nThe second of these papers was reported by the Secretary of the\nAcademy\nto the meeting of the Mathematical and Natural Science Class on\n2\nNovember\n1882\n. The author is described in the report as \"Mr August Adler, student at the Technische Hochschule in Vienna\", see\n[\n6\n]\n. We note that the Technische Hochschule in Vienna, founded in\n1815\n, was renamed the Vienna University of Technology in\n1975\n.\nEmil Weyr\nsent further papers by Adler to the\nAcademy\nwhile he was his student.\nAdler was appointed as an assistant in astronomy and geodesy at the Technische Hochschule in Vienna in\n1885\nholding this position for two years. He submitted further papers to meetings of the\nAcademy\nduring this time, for example\nÜber ein allgemeines Princip des graphischen Rechnens\nⓉ\n(\nOn a general principle of graphical computing\n)\nto the meeting of\n14\nJanuary\n1886\nand a second,\nZur graphischen Auswertung der Funktionen mehrerer Veränderlicher\nⓉ\n(\nOn the graphical evaluation of the functions of several variables\n)\n, to the meeting of\n8\nJuly\n1886\nwhere he is described as an Assistant at the Technische Hochschule in Vienna.\nAdler taught at Döll's Realschule in Vienna beginning in\n1888\n. Two years later, however, in\n1890\n, he is listed as a Substitute teacher at the Staats-Oberrealschule in Klagenfurt. While in Klagenfurt he published\nGraphische Auflösung der Gleichungen\nⓉ\n(\nGraphical resolution of  equations\n)\n. He then taught at the German Realschule in Pilsen from\n1891\nto\n1895\nbefore becoming a professor at the German Oberrealschule in Karolinenthal. By\n1899\nhe is listed as a Professor and an Ordinary Member of the\nAcademy of Sciences\nin Vienna at Karolinenthal, Kollargasse\n13\n. The town of Karolinenthal, also known as Karlin, was founded in\n1817\nand named after the wife of Francis I of Austria, Caroline Augusta of Bavaria. It was incorporated into Prague in\n1922\n. When Adler taught in Prague there were both German and Czech speakers and education was provided for pupils in both languages. The situation is described in\n[\n3\n]\n:-\nWhen you look at the absolute numbers, the year\n1880\n/\n81\nand the following year catches your eye, because initially the number of native Czech speakers at German secondary schools rises by more than\n200\n, but drops almost a year later to their old level back. During the increase primarily with the foundation of the German high school in Smichov and especially the German Oberrealschule in Karolinental, which\n122\nnative speakers still choose in spite of the opening of the Municipal Czech Upper Real School in Karolinental in the same year, the following decline is spread across all institutions with the German language of instruction. The division of the university at this time appears to be the obvious reason for this development, because it makes secondary schools teaching in the Czech language more attractive to the developing Czech circles of the education-oriented middle class, which has so far preferred German secondary education.\nIn\n1901\nAdler submitted his\nhabilitation\nthesis on descriptive geometry to the German Technical University in Prague and became a docent there. He continued, however, to teach at the German Oberrealschule in Karolinenthal. For example, at the meeting of the\nAcademy of Sciences of Vienna\non\n9\nJanuary\n1902\n, to which he submitted a paper, he is described as both a secondary school professor in Karolinenthal and a privatdocent at the German Technical University in Prague. Adler went to Göttingen for the summer semester of\n1902\n, applying to the University to he a guest auditor. He attended\nDavid Hilbert\n's lectures on the Foundations of Geometry and took notes which became the published version of these lectures, see\n[\n1\n]\n. These notes, written in Adler's own hand, are now in the Reading Room of the Göttingen Mathematical Institute.\nIn\n1906\nAdler left Prague and took up an appointment as a teacher at a high school in the\n6\nth district of Vienna and, in addition, he was a\nPrivatdozent\nat the Technische Hochschule there. One year later, in\n1907\n, he was appointed as Director of the Staatsrealschule in the\n7\nth district of Vienna. He retired on grounds of ill health in\n1915\n.\nLet us now look in a little more detail at Adler's mathematical contributions. In\n1797\nMascheroni\nhad shown that all plane construction problems which could be made with\nruler and compass\ncould in fact be made with compasses alone. His theoretical solution involved giving specific constructions, such as bisecting a circular arc, using only a compass.\nIn\n1906\nAdler applied the theory of inversion to solve\nMascheroni\nconstruction problems in his book\nTheorie der geometrischen Konstruktionen\nⓉ\n(\nTheory of geometric constructions\n)\npublished in Leipzig. Since he was using inversion Adler now had a symmetry between lines and circles which in some sense showed why the constructions needed only compasses. However Adler did not simplify\nMascheroni\n's proof. On the contrary, his new methods were not as elegant, either in simplicity or length, as the original proof by\nMascheroni\n. Richard Güntsche reviewed this book\n[\n5\n]\n:-\nThe book gives a coherent presentation of the methods and theories for solving geometric construction tasks, the development of which the author himself is known to have played a significant part. After a description of the construction methods found by\nPetersen\n, the\nSteiner\nand the\nMascheroni\nconstructions are explored, as well as those with the help of a parallel ruler, one or more movable right angles, a gauge or a bisector. This is followed by theoretical considerations about the classification of the geometrical construction tasks and the proof of the possibility and impossibility of solving a specific geometric task with a compass and ruler. After a section on circle division, in which seventeen different divisions are described, there follow solutions of the Delian problem, angle trisection and, in general, third and fourth degree equations by means of various construction methods, as well as historical remarks on the rectification of the circle. A final section is devoted to Lemoinian geometrography.\nThis\n1906\npublication was not the first by Adler studying this problem. He had published a paper on the theory of\nMascheroni\n's constructions in\n1890\nwhich was reviewed by\nH Schubert\n[8]\n:-\nIn the direction of the investigation initiated by\nMascheroni\n(\nPavia\n1797)\nand\nvon Steiner\n(\nBerlin\n1833)\nabout the aids or tools that are unnecessary or necessary to solve geometric construction tasks, a noteworthy work is written here, which shows that any problem that can be solved with a compass and ruler can also be solved, if further aids are not allowed other than either only the ruler\n(\ntwo parallel lines at a constant distance\n)\nor only the right angle\n(\nfor example made of wood\n)\nor only a certain acute angle\n(\nfor example made of wood\n)\n. Since we know from\nSteiner\n's work that using the ruler alone can only solve any second degree problem if a fixed circle can be used in the plane, the use of the ruler in the sense of Mr Adler is of course different understand as with\nSteiner\n, namely in such a way that it also allows a parallel to a straight line to be drawn at a fixed distance\n(\nwidth of the ruler\n)\n. Likewise, the application of the wood angle should also allow, for example, the search in a straight line for the point from which a fixed distance appears at the angle of the wood angle. So it is shown that in \"practice\" each of the four most important drawing tools\n(\ncompass, ruler, right angle, acute angle\n)\nalone is sufficient to solve all tasks of the second degree. At the end it is proven that by using several right angles, tasks of the third and fourth degree can also be solved. Such tasks were once shown by Kortum that they can only be solved with a ruler if a fixed cone can be used.\nIn fact\nHilbert\nrefers to this paper by Adler in the\n1902\ncourse which was attended and recorded by Adler. The authors of\n[\n1\n]\nwrite:-\nHilbert\n[\nrefers to Adler's\n1890\npaper\n]\n, which deals with constructions executable by a draughtsman whose only means of construction is a wooden right-angle. He shows that, assuming one has several right-angled triangles at one's disposal, one can solve in principle any cubic equation, and with perfect accuracy, assuming the means used to draw the right-angles are perfect.\nHilbert\n's remark implicitly suggests replacing the use of the draughtsman's right-angle tool with the 'movement' of an angle, that is, with a congruence assumption which allows one to construct right-angles at any point and on any line.\nAdler had published another paper on the theory of geometrical constructions in\n1895\n, and one on the theory of drawing instruments in\n1902\nin which\n[\n2\n]\n:-\n... he showed that both a ruler to be used in a certain manner with two parallel edges and a set square, the edges of which meet in the arbitrarily fixed angle, have the same level of performance as circles and straight edge.\nAs well as his interest in descriptive geometry, Adler was also interested in mathematical education, particularly in teaching mathematics in secondary schools. His publications on this topic began around\n1901\nand by the end of his career he was publishing more on mathematical education than on geometry. Most of his papers on mathematical education were directed towards teaching geometry in schools, but in\n1907\nhe wrote on modern methods in mathematical instruction in Austrian middle schools. He produced various teaching materials for teaching geometry in the sixth-form in Austrian schools such as an exercise book which he published in\n1908\n.\nDavid Eugene Smith\nwrote the\nReport of Sub-Commission A of the International Commission on the Teaching of Mathematics: Intuition and Experiment in Mathematical Teaching in the Secondary Schools\nwhich he delivered to the International Congress of Mathematicians held in Cambridge, England, on\n27\nAugust\n1912\n. In his report he refers to Adler's teaching texts when he writes about the teaching of geometry in Austria:-\nA subject like descriptive geometry, for example, can hardly be said to occupy any definite position, so rapidly changing are the views concerning its importance, its significance, and the schools in which it should be taught. Austria makes much of it in the Realschule, less of it in the Realgymnasium, and almost nothing of it in the Gymnasium....  In Austria, in the Realschulen, the subject\n[\nof geometric drawing and graphic representation\n]\nis nominally in the hands of a special teacher examined and appointed for the purpose. ... At present, in about a third of the schools, the teacher of mathematics is also the teacher of descriptive geometry in the three upper classes\n(\nV-VII\n)\n. There is a well-defined line of demarcation between stereometry and descriptive geometry as the work is carried on, although the latter is employed in representing the solids met in the former. It appears, therefore, that certain definite work in descriptive geometry is done in the upper classes of the Realschulen. In the Gymnasien descriptive geometry is not a separate object of study. In the work in stereometry, however, plans and elevations are drawn, and orthogonal projections of parallelepipeds, octahedrons, pyramids, and the like are prepared.\nOne final work by Adler should be mentioned, namely the five figure logarithm tables\nFünfstellige Logarithmen\nⓉ\n(\nFive-figure logarithms\n)\nwhich he published in\n1909\n.\nFor a list of publications by Adler which includes his school textbooks, see\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic"
  ]
}