{
  "nome_completo": "August Ferdinand Möbius",
  "nome_curto": "August Möbius",
  "ano_nascimento": "1790",
  "ano_morte": "1868",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mobius/",
  "lugar_nascimento": "Schulpforta, Saxony (now Germany)",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "August Möbius\nwas the only child of Johann Heinrich Möbius, a dancing teacher, who died when August was three years old. His mother was a descendant of Martin Luther. Möbius was educated at home until he was\n13\nyears old when, already showing an interest in mathematics, he went to the College in Schulpforta in\n1803\n.\nIn\n1809\nMöbius graduated from his College and he became a student at the University of Leipzig. His family had wanted him study law and indeed he started to study this topic. However he soon discovered that it was not a subject that gave him satisfaction and in the middle of his first year of study he decided to follow him own preferences rather than those of his family. He therefore took up the study of mathematics, astronomy and physics.\nThe teacher who influenced Möbius most during his time at Leipzig was his astronomy teacher\nKarl Mollweide\n. Although an astronomer,\nMollweide\nis well known for a number of mathematical discoveries in particular the\nMollweide\ntrigonometric relations he discovered in\n1807\n-\n09\nand the\nMollweide\nmap projection which preserves areas.\nIn\n1813\nMöbius travelled to Göttingen where he studied astronomy under\nGauss\n.\nGauss\nwas the director of the Observatory in Göttingen but of course the greatest mathematician of his day, so again Möbius studied under an astronomer whose interests were mathematical. From Göttingen Möbius went to Halle where he studied under Johann\nPfaff\n,\nGauss\n's teacher. Under Pfaff he studied mathematics rather than astronomy so by this stage Möbius was very firmly working in both fields.\nIn\n1815\nMöbius wrote his doctoral thesis on\nThe\noccultation\nof fixed stars\nand began work on his\nHabilitation\nthesis. In fact while he was writing this thesis there was an attempt to draft him into the Prussian army. Möbius wrote\nThis is the most horrible idea I have heard of, and anyone who shall venture, dare, hazard, make bold and have the audacity to propose it will not be safe from my dagger.\nHe avoided the army and completed his Habilitation thesis on\nTrigonometrical equations\n.\nMollweide\n's interest in mathematics was such that he had moved from astronomy to the chair of mathematics at Leipzig so Möbius had high hopes that he might be appointed to a professorship in astronomy at Leipzig. Indeed he was appointed to the chair of astronomy and higher mechanics at the University of Leipzig in\n1816\n. His initial appointment was as Extraordinary Professor and it was an appointment which came early in his career.\nHowever Möbius did not receive quick promotion to full professor. It would appear that he was not a particularly good lecturer and this made his life difficult since he did not attract fee paying students to his lectures. He was forced to advertise his lecture courses as being free of charge before students thought his courses worth taking.\nHe was offered a post as an astronomer in Greifswald in\n1816\nand then a post as a mathematician at Dorpat in\n1819\n. He refused both, partly through his belief in the high quality of Leipzig University, partly through his loyalty to Saxony. In\n1825\nMollweide\ndied and Möbius hoped to transfer to his chair of mathematics taking the route\nMollweide\nhad taken earlier. However it was not to be and another mathematician was preferred for the post.\nBy\n1844\nMöbius's reputation as a researcher led to an invitation from the University of Jena and at this stage the University of Leipzig gave him the Full Professorship in astronomy which he clearly deserved.\nFrom the time of his first appointment at Leipzig Möbius had also held the post of Observer at the Observatory at Leipzig. He was involved the rebuilding of the Observatory and, from\n1818\nuntil\n1821\n, he supervised the project. He visited several other observatories in Germany before making his recommendations for the new Observatory. In\n1820\nhe married and he was to have one daughter and two sons. In\n1848\nhe became director of the Observatory.\nIn\n1844\nGrassmann\nvisited Möbius. He asked Möbius to review his major work\nDie lineale Ausdehnungslehre, ein neuer Zweig der Mathematik\nⓉ\n(\nThe linear theory of extension, a new branch of mathematics\n)\n(1844)\nwhich contained many results similar to Möbius's work. However Möbius did not understand the significance of\nGrassmann\n's work and did not review it. He did however persuade\nGrassmann\nto submit work for a prize and, after\nGrassmann\nwon the prize, Möbius did write a review of his winning entry in\n1847\n.\nAlthough his most famous work is in mathematics, Möbius did publish important work on astronomy. He wrote\nDe Computandis Occultationibus Fixarum per Planetas\nⓉ\n(\nComputing the occultation of planets\n)\n(1815)\nconcerning occultations of the planets. He also wrote on the principles of astronomy,\nDie Hauptsätze der Astronomie\nⓉ\n(\nThe Laws of Astronomy\n)\n(1836)\nand on celestial mechanics\nDie Elemente der Mechanik des Himmels\nⓉ\n(\nElements of celestial mechanics\n)\n(1843)\n.\nMöbius's mathematical publications, although not always original, were effective and clear presentations. His contributions to mathematics are described by his biographer Richard Baltzer in\n[\n3\n]\nas follows:-\nThe inspirations for his research he found mostly in the rich well of his own original mind. His intuition, the problems he set himself, and the solutions that he found, all exhibit something extraordinarily ingenious, something original in an uncontrived way. He worked without hurrying, quietly on his own. His work remained almost locked away until everything had been put into its proper place. Without rushing, without pomposity and without arrogance, he waited until the fruits of his mind matured. Only after such a wait did he publish his perfected works...\nAlmost all Möbius's work was published in\nCrelle\n's Journal, the first journal devoted exclusively to publishing mathematics. Möbius's\n1827\nwork\nDer barycentrische Calcul\nⓉ\n(\nThe barycentric calculus\n)\n, on analytical geometry, became a classic and includes many of his results on projective and affine geometry. In it he introduced homogeneous coordinates and also discussed geometric transformations, in particular projective transformations. He introduced a configuration now called a Möbius net, which was to play an important role in the development of\nprojective geometry\n.\nMöbius's name is attached to many important mathematical objects such as the Möbius function which he introduced in the\n1831\npaper\nÜber eine besondere Art von Umkehrung der Reihen\nⓉ\n(\nOn a special type of reversal of the rows\n)\nand the Möbius inversion formula.\nIn\n1837\nhe published\nLehrbuch der Statik\nⓉ\n(\nTextbook of statics\n)\nwhich gives a geometric treatment of statics. It led to the study of systems of lines in space.\nBefore the question on the\nfour colouring of maps\nhad been asked by Francis Guthrie, Möbius had posed the following, rather easy, problem in\n1840\n.\nThere was once a king with five sons. In his will he stated that on his death his kingdom should be divided by his sons into five regions in such a way that each region should have a common boundary with the other four. Can the terms of the will be satisfied?\nThe answer, of course, is negative and easy to show. However it does illustrate Möbius's interest in\ntopological\nideas, an area in which he is most remembered as a pioneer. In a memoir, presented to the\nAcadémie des Sciences\nand only discovered after his death, he discussed the properties of one-sided surfaces including the Möbius strip which he had discovered in\n1858\n. See\nTHIS LINK\n. This discovery was made as Möbius worked on a question on the geometric theory of polyhedra posed by the\nAcadémie\n.\nAlthough we know this as a Möbius strip today it was not Möbius who first described this object, rather by any criterion, either publication date or date of first discovery, precedence goes to\nListing\n.\nA Möbius strip is a two-dimensional surface with only one side. It can be constructed in three dimensions as follows. Take a rectangular strip of paper and join the two ends of the strip together so that it has a\n180\ndegree twist. It is now possible to start at a point\nA\nA\nA\non the surface and trace out a path that passes through the point which is apparently on the other side of the surface from\nA\nA\nA\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}