{
  "nome_completo": "Ferdinand Augustin Hallerstein",
  "nome_curto": "Augustin Hallerstein",
  "ano_nascimento": "1703",
  "ano_morte": "1774",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hallerstein/",
  "lugar_nascimento": "Ljubljana, Carniola (now Slovenia)",
  "lugar_morte": "Beijing, China",
  "biografia": "Augustin Hallerstein\nwas the son of Janez Ferdinand Hallerstein\n(1669\n-\n1736)\n, an administrator of the Carniolan provincial government, and Marija Suzana Elizabeta Erberg\n(1681\n-\n1725)\n. It was a privileged noble family living in the family castle, Ravbar Castle\n(\nalso known as Hoffsmanburg\n)\n, in the small town of Menges near Ljubljana. Janez had inherited the castle from his father in\n1702\nand in that year married Marija Suzana Elizabeta Erberg who was the daughter of Janez Danijel Erberg\n(1647\n-\n1716)\nwho owned the manor at Dol, about\n10\nkm from Ravbar Castle. Janez Danijel Erberg was a founding member of the Akademije Operozorov, a society of Italian-educated and Italian culture-spreading intellectuals, from\n1693\n.\nMathematics, astronomy and physics were subjects studied by some of the family of Augustin's mother. For example Marija Suzana Elizabeta's brother Janez Ernest Erberg\n(1692\n-\n1717)\nwas taught by the professor of mathematics in Ljubljana, Janez Krstnik Thullner\n(1668\n-\n1747)\n, defended a thesis on optics in Ljubljana in\n1709\nand published a booklet on the telescope.\nAugustin was the oldest of his parents' fourteen children, three of whom died as infants. His primary education was partly at home in Ravbar Castle with a private tutor and partly at a school near the church in Menges where he was taught by Andrej Jelovsek, the organist at the church. Augustin then studied at a high school in Ljubljana before spending three years studying philosophy at the Jesuit Collegium of Ljubljana. In his first year of higher studies,\n1718\n-\n19\n, he should have studied mathematics with Jozef Kraus but due to Kraus's illness there were no mathematics classes offered and Hallerstein had to study it on his own. He studied logic in\n1718\n-\n19\n, physics in the following year and then metaphysics in his final year\n1720\n-\n21\n. He then went to the Jesuit College of St Anna in Vienna where he entered the Jesuit Order on\n26\nOctober\n1721\n. In Vienna, Hallerstein met Janez Krstnik Thullner who was now the professor of mathematics there. It was Thullner who taught Hallerstein mathematics and the two continued to collaborate even after Hallerstein had gone to China.\nIn\n1723\n-\n24\nHallerstein was back in Ljubljana as a novice when he met Anton Stancker who had been appointed as professor of physics. He also spent time as a novice in Vienna and in Graz. He was now interested in becoming a Jesuit missionary in China and made his first request to be allowed to go to China in July\n1723\nbut it would be many years before he was accepted. In\n1723\n-\n24\nhe taught at a Gymnasium in Leoben, then in the following year he taught at Klagenfurt before returning to the Jesuit School in Ljubljana where he was a master of rhetoric in\n1727\n-\n28\n. Hallerstein studied theology at Graz for two years\n1728\n-\n30\n, and then was appointed as head of the Jesuit College in Timisoara. He had made another request to undertake a mission to China in October\n1727\nand waited patiently in Timisoara for a positive answer. He was ordained a priest in\n1734\nand eventually received a positive answer to his request. In September\n1735\nhe travelled to Trieste in order to set out on his Chinese mission.\nHe only spent a few days in Trieste before sailing to Genoa with the Jesuit from Vienna, Gottfried-Xavier Laimbeckhoven\n(1701\n-\n1787)\nwho had studied mathematics in preparation for missionary work. Again his stay was a short one and on\n30\nOctober\n1735\nhe sailed with Laimbeckhoven and others from Genoa to Lisbon on the ship\nPenelope\n[\n5\n]\n:-\nIn Lisbon they read a letter of Ignatius Kögler signed in Beijing on\n15\nNovember\n1734\n, and shipped from Nanjing. The professor of mathematics in Lisbon told Hallerstein about the invitation of the Maharaja Jai Singh II\n(1686\n-\n1743)\nfrom Jaipur. Jai Singh was one of the sovereigns in the Indian Mogul state, and he wanted to hire a missionary versed in mathematics and astronomy. Jai Singh just finished five huge astronomical observatories in North India: in Delhi\n(1725)\n, Jaipur\n(1725)\n, Ujjain on the river Kshipra, and in Banaras\n(\ntoday Varanasi\n)\n. Although the Hindu Jai Singh collaborated with the Hindu astronomers, he regarded himself as the descendant of\nUlugh Beg\n(1393\n-\n1449)\nfrom the Muslim Arabic tradition. Jai Singh used the works of\nPtolemy\n,\nFlamsteed\n, and\nde la Hire\n. In a letter to the Jesuit General in Rome, the astronomer of the Portuguese court and rector of Colegio de Santo Antao, Giovanni Battista Carbone, S.J., Fellow of the\nRoyal Society\n(1694\n-\n1750)\n, offered to Jai Singh to employ Hallerstein, Laimbeckhoven, or both. Laimbeckhoven was at that time very interested in astronomy and natural history. The Jesuit Carbone taught Hallerstein and Laimbeckhoven the techniques of the observation of stars, and lent them mathematical books and instruments.\nHallerstein decided that this offer from India was what he wanted and, instead of going to China, he would accept Jai Singh's offer. He lived in a house in Lisbon for those preparing to journey to India but he did not go there and by April\n1736\nhe was again preparing to travel to China. On\n24\nApril\n1736\nboth Hallerstein and Laimbeckhoven boarded the\nSaint Peter of Alkantar\nwhich, on the following day, set sail for Goa. They stopped for a time at the Cape of Good Hope, then continued their journey to Mozambique which they reached on\n29\nOctober\n1736\n. On\n16\nAugust\n1737\nhe continued his journey, reaching Agada, near Goa, on\n19\nSeptember\n1737\n. It was not until\n11\nMay\n1738\nthat Hallerstein left Goa sailing on to Malacca, then continuing to Macao which was reached on\n4\nSeptember\n1738\n. Three months later he received an invitation to Beijing. He went in March\n1739\nto take up an appointment as an astronomer and mathematician to the Imperial Court in Beijing where he remained for the final\n35\nyears of his life. Mitja Saje writes\n[\n15\n]\n:-\n... after Hallerstein's arrival in Macao on\n4\nSeptember\n1938\n, the news that he was an excellent mathematician came quickly to Beijing, so the next year he was asked to come to Beijing, where the emperor Qianlong became fond of him and ordered him to become the aid of Ignatius Kögler\n(1680\n-\n1746)\n. After Kögler's death, Hallerstein was nominated as his successor as president of the Board of Mathematics\n[\nsince he had filled André Pereira's position in\n1743]\n.\nIgnatius Kögler had been born in Bavaria, went from Prague to Portugal in\n1715\n, and then arrived in China in\n1717\n. He was appointed as president of the Board of Mathematics. In a letter Hallerstein had described him as:-\n... one of the most cultivated minds that ever came into these countries.\nAndré Pereira\n(1689\n-\n1743)\nhad been born in Porto, Portugal, and had arrived in China in\n1717\n. He had been appointed vice-president of the Board of Mathematics, so second in command to Ignatius Kögler, in\n1727\n. Following Pereira's death in\n1743\n, Hallerstein had become vice-president of the Board of Mathematics and the natural successor to Kögler.\nIn order to appreciate the conditions under which Hallerstein worked in China, we need to look a little at the background of the Jesuit mission to China. The Jesuits were founded around\n1540\nand not long after that the Portuguese established a settlement at Macau on the Chinese mainland.\nMatteo Ricci\n, who became a Jesuit in\n1571\n, arrived in Macau in\n1582\n. He adopted a policy of accommodation which meant that the Christian faith was adapted to suit the customs of the people being converted to Christianity. It was a very successful policy in that it allowed those being converted to carry on their own religious rites such as veneration of their ancestors which was popular.\nMatteo Ricci\nalso argued for highly educated Jesuits to be part of the mission to China, where the intelligent Chinese could benefit from European mathematical, astronomical and other scientific knowledge. These policies worked well and in general through the\n17\nth century the Chinese were happy to learn from the Jesuits who made efforts to translate European mathematical and astronomical works into Chinese. By the\n18\nth century, however, the Chinese were seeing the missionary work as interference and so the Jesuits concentrated more on scientific work. There were tensions here too, for now many Chinese felt that their country had caught up with Europe and they looked for Chinese to head their scientific organisations rather that Jesuits.\nOn\n11\nJuly\n1742\n, Pope Benedict XIV issued a papal bull against accommodation by prohibiting certain traditional practices that the Jesuits had allowed converts to retain in China, in particular the practice of venerating their ancestors. Hallerstein wrote to his brother Janez Vajkard Hallerstein\n(1706\n-\n1780)\n, who lived in Brussels, on\n6\nOctober\n1743\n:-\nYou are asking what kind of echo was caused by Pope Benedictus XIVth's decision about Chinese rituals. I am answering that it caused what we have been expecting. We accepted it, promised, and we will keep to it. And really we do not have those troubles, because this Chinese Christianity is limited to the very poor, who hardly have enough for food and living, so how could they bring gifts to their ancestors, sacrifice or build houses for them.\nHe also described in a letter to his brother written on\n28\nNovember\n1749\nhow some were attempting to prevent missionary work:-\nAlso in Peking they undertook many things against us. The Portuguese Father Felix da Rocha and I even stood before the court of law for having provided Christians with books about our faith, breviaries, devotional pictures, rosaries and similar items. However, the Emperor took up our cause when the judge presented the matter to him. Further: so that the Peking brothers would not be able to help the brothers in the provinces and in communal affairs, they so cunningly sealed off our access to the Emperor, whom we could visit only with difficulty, if at all, meaning that everything that we were planning or attempting has fallen through. We can thus count it as a success that we have maintained this post in Peking at all.\nIn fact it was the support of the Emperor which allowed the Jesuits to operate in China. Hallerstein explains in another letter, this one written on\n1\nNovember\n1743\nto Father Joseph Ritter, saying that the future of the mission is uncertain:-\nThis uncertainty cannot be ascribed in such measure to the Emperor's disfavour towards us or to our Holy Faith. It is certain that the Emperor, although he does not favour us, also does not disfavour us. The guilt lies with the offices here and especially the office for morals, which deals with issues of faith in the country, and which is extremely disdainful towards our faith. However, the Emperor himself resisted these judges of morality when they once approached him with complaints, responding that Mohammedan and Christian faiths, prophesying and astrology were never forbidden in China. However, one cannot build anything on these uncertain rumours, nor on the friendliness and politeness of some assessors of this office. The Chinese and Tartars are cunning and crafty people, who cannot be trusted without exposing oneself to the danger of being deceived.\nNot only was there opposition to Hallerstein's religious mission but there was also opposition against Jesuits holding leading positions which the Chinese felt that they should have. He describes in detail efforts to discredit the Jesuits in a letter of\n6\nNovember\n1740\n. We only quote a small part:-\nIt is a thorn in the side of the Chinese astronomers to have to see Jesuits sitting in the mathematical tribunal, and this is known even in high positions. Now they have written a slanderous accusation against us and presented it to the Emperor that he might, if not remove us from leading roles, at least denigrate us before the people. The contents of the letter were that the Europeans were striving with all their might to eradicate and destroy the memory of Chinese astronomy, which had flourished since antiquity. To prove this, they cite that\nFerdinand Verbiest\ndared to throw into the darkest corner of the Observatory all of the old Chinese well-crafted instruments which they had used successfully for many years, and in their place had set up a new European instrument. That Father Kilian Stumpf went even further when he melted down a few pieces of the well-made Chinese instruments, poured them into another mould and publicly displayed them in the Observatory as a sign of the victory of foreign science, as a taunt to the local people. That Fathers Ignatius Kögler and André Pereira, who were responsible for mathematics, planned nothing less treacherous than zealously to do away with all remaining Chinese antiquity and, by asserting their own newly-established art, to destroy the honour and renown of the science of antiquity that had been valid for many centuries in China, if they were not stopped in time.\nLet us illustrate some of the mathematical and astronomical work carried out by Hallerstein by quoting from his letter to the\nRoyal Society\nin\n1751\n[\n4\n]\n:-\nFrom the years\n1741\nto\n1746\nwe made but few observations. My predecessor, Father Ignatius Kögler was then broken with age, and I was wholly taken up with learning the Chinese language and letters. Yet possibly even these few observations may appear some time or other, with a long series of others, which the aforesaid Father made from\n1718\nto\n1745\n, and set down in loose papers; which I have brought into order, and written into one volume, in the order of years and planets, and wish I had leisure to transcribe that volume. However, both he and I went as far as we could. For, to say it bye the bye, those bulky machines of our royal observatory here, though magnificent, and of solid brass, do not come up to the accuracy of the present time. And the astronomical apparatus in our house, that we can depend upon, almost entirely consists of a micrometer, a pendulum clock, and a two foot quadrant.\n...\nWe carefully keep the syllabus of other things, of which you desired to be informed; and shall use our endeavours to satisfy you on these heads, and any other that may give you pleasure. As to geographical maps, and plans of cities, it would be very difficult to present either to obtain or make any, but those already published in Europe, until a more favourable air from this court breaths on us. Last year I and Father Felix de Rocha travelled into North Tartary, beyond the vast wall, which separates\n(\nor at least separated\n)\nthe Chinese from the Tartars: where by the Emperor's order, we drew a chorographical map of the country, into which this our monarch makes an excursion generally every third year, in order to take the diversion of hunting, and keep his court and army in exercise; pursuant to a custom established by his grandfather, to prevent the tartars from growing enervated by idleness.\n...\nI would send you, gentlemen, a copy of this map, if we had been allowed time enough to make it more accurate. The work was indeed pleasing to the Emperor, and upon our return he gave us a most gracious reception, and asked us many questions concerning that country.\nObservations which Hallerstein made between\n1744\nand\n1747\nwere transmitted to the\nRoyal Society\nby Dr Bevis on\n5\nMarch\n1752\n:-\nI am much obliged to you, Sir, for furthering Father Augustin Hallerstein's letter to me. It informs me, that the instrument I wrote the description and use of, was arrived safe at Peking. According to that missionary's request, I have carefully looked over the observations he sent to Dr Sanchez at Paris, to be communicated to the\nRoyal Society\nthrough your hands. They are comparisons of all the planets with known fixed stars taken in the Jesuit's College at Peking, in\n1746\nand\n1747\n, with a well-adjusted pendulum clock, and a micrometer; and appear to me to have been done with judgement and accuracy; so as, in my humble opinion, to merit the\nRoyal Society\n's consideration.\nOf course, Hallerstein was working on astronomy at a time when the Church of Rome insisted on an Earth centred solar system while many were following\nCopernicus\n,\nGalileo\nand\nKepler\nin their claim that the Earth orbited the sun. Hallerstein never publicly expressed an opinion on this issue which seems to indicate that he was a believer in the heliocentric system but, for religious reasons, could not openly say so. We note that the scientific standing of the Jesuits was damaged by the controversy in the opinion of most Chinese astronomers who, by this time, were believers in the heliocentric system.\nThe position of the Jesuits within the Roman Catholic Church had been getting more difficult throughout Hallerstein's time in China. Certainly one of the reasons for this was the Jesuits use of accommodation in their missionary work. The Portuguese expelled the Jesuits in\n1759\n, France in\n1764\n, and Spain followed in\n1767\n. On\n21\nJuly\n1773\nPope Clement XIV suppressed the Jesuits from the whole Roman Catholic Church. On\n13\nNovember\n1773\nHallerstein sent a request to the Emperor asking that he be allowed to retire. The pressure on the Pope to suppress the Jesuits was certainly a factor in his decision to make this request, although news of the suppression did not reach Beijing until two weeks after his death, but he was also by this time in poor health. The Emperor, however, refused his request. On\n29\nJuly\n1774\nHallerstein suffered a stroke. He survived for a further three months before he died after suffering a second stroke. He was buried in the Portuguese cemetery in Beijing. See\nTHIS LINK\n.\nHallerstein gained fame in his own time with the letters he sent to Europe which were widely read and often published by various Academies and Societies. Throughout his time in China he maintained extensive contacts with the\nRoyal Society\nin London, the Imperial Observatory in Vienna and the\nAcademy of St Petersburg\n. In recent times he has gained more fame as historians have researched his life and work and come to understand his importance. On\n21\nJanuary\n2003\nSlovenia issued a\n107\nSlovenian tolar stamp for Hallerstein in their 'Famous people of Slovenia' series. See\nTHIS LINK\n.\nThe asteroid\n15071\nHallerstein, discovered on\n24\nJanuary\n1999\n, is named for him.\nLet us end this biography by quoting a comparison that Hallerstein makes between Europe and China in a letter written on\n24\nSeptember\n1766\n:-\nThe Chinese empire is an empire of peace and order. That is how it is, at least now, and how it has been for many years. To the same extent that the Europeans favour war, the Chinese favour peace. Is it perhaps thus because the European kingdoms were built on war, while the Chinese empire was founded on peace and grew voluntarily? Or is it this way, if we speak of the primary reasons, because the empire is subject to one, while the European ones have many lords? It is sure that in the time when the strength of the Chinese Emperor was at its lowest and many princes were waging war against each other, one of them asked the philosopher Mencius when it would be possible to establish peace again. He responded that it would be at the time they all turned towards a single person.",
  "math_areas": [
    "Logic"
  ]
}