{
  "nome_completo": "Augustus Edward Hough Love",
  "nome_curto": "Augustus Love",
  "ano_nascimento": "1863",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Love/",
  "lugar_nascimento": "Weston-super-Mare, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Augustus Love\n's mother was Emily Serle and his father was John Henry Love. John Love was a surgeon who, later in his career, took up an appointment as a police surgeon for the borough of Wolverhampton. Augustus had one older brother and two sisters.\nAugustus was educated at Wolverhampton School, which he entered in\n1874\n, but there he failed to show the brilliance which he was to show later in his life. This is not to say that he was a poor pupil, merely a mediocre one, but by his final year at school he was beginning to excel and in\n1881\nhe won a scholarship to study at St John's College Cambridge. Entering St John's College in the following year, his first difficult decision was whether to take a degree in mathematics or in classics. He decided on mathematics and steadily improved his performance until he was elected scholar of the College in\n1884\nand, in the following year, he was Second\nWrangler\n, meaning that he was ranked second among the First Class students in the Mathematical Tripos. He was elected to a fellowship at St John's College in\n1886\nand the following year won the first Smith's Prize. These years were highly productive ones during which Love produced outstanding work which led to his election to the\nRoyal Society\nin\n1894\n.\nLove was appointed to the Sedleian chair of natural philosophy at Oxford in\n1899\n. At this time he gave up his fellowship at St John's College but, in\n1927\nhe was elected an honorary fellow at his old College of St John's. In the same year of\n1927\nhe was also elected to a fellowship at Queen's College Oxford.\nHe worked on the mathematical theory of elasticity, on which he wrote the two volume work\nA Treatise on the Mathematical Theory of Elasticity\n(1892\n-\n93)\ndescribed as\n[\n3\n]\n:-\n... a monumental work of the utmost importance.\nMilne\n, writing in the\nDictionary of National Biography\n, is full of praise for this outstanding work:-\nThis is a fine, scholarly work, written with an historical sense; unhurried in style, massive in lecture, satisfying in fullness. It gives the general theory of stress and strain; of the conditions of equilibrium and stability of elastic plates, shells and solids; of torsion rods and the bending and vibration of beams; and the transmission of force. It remains a permanent monument to the academic aspect of elasticity. The treatment throughout is severely analytical, but it took form too early to incorporate the tensor calculus.\nLove also did important work on waves. His work on the structure of the Earth in\nSome Problems in Geodynamics\nwon for him the\nAdams\nPrize at Cambridge in\n1911\n. An expert on spherical harmonics, Love discovered the existence of waves of short wavelength in the Earth's crust. The ideas in this work are still much used in geophysical research and the short wavelength earthquake waves he discovered are called 'Love waves'.\nMilne\nwrites:-\nLove investigated the possibility of the propagation of a purely distortional surface wave, and found that such could exist in a heterogeneous medium. In these waves the disturbance is purely horizontal\n(\ntraverse to the direction of propagation\n)\n, and the wave velocity, unlike that of '\nRayleigh\nwaves', depends upon wavelength. 'Love waves' have proved of considerable importance in the hands of later investigators, who have been able to infer, from their application to seismograms, indications of the thickness of the upper layer of the earth's crust.\nHe received many honours, the\nRoyal Society\nawarded him its Royal Medal in\n1909\nand its\nSylvester\nMedal in\n1937\n, while the London Mathematical Society awarded him its\nDe Morgan\nMedal in\n1926\n. He also acted as secretary to the\nLondon Mathematical Society\nfor fifteen years between\n1895\nand\n1910\n, and was elected as president of the Society in\n1912\n-\n13\n.\nHe is described in\n[\n3\n]\nas follows:-\nHe was a singularly modest man with a passion for accuracy and a gift for the lucid exposition of difficult and abstruse problems. His lectures to his students at Oxford were models of clear thinking and style.\nMilne\ndescribes him as having:-\n... a certain whimsicality of manner and appearance which endeared him to his many friends.\nLove never married and, after the death of his father during the time that he held his fellowship at Cambridge, the younger of his two sisters kept house for him for the rest of his life.",
  "math_areas": []
}