{
  "nome_completo": "Avi Wigderson",
  "nome_curto": "Avi Wigderson",
  "ano_nascimento": "1956",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wigderson/",
  "lugar_nascimento": "Haifa, Israel",
  "lugar_morte": null,
  "biografia": "Avi Wigderson\nwas the son of Jewish parents who escaped to Israel from Nazi Germany while almost all members of their families died in the Holocaust. Avi's father, Pinchas Wigderson\n(1921\n-\n1988)\n, escaped to Russia after the Nazis invaded Poland in\n1939\n. He was sent to Ashgabat, Turkmenistan, and during World War II he worked in an electrical plant. He emigrated to Israel and there met and married a girl who had also escaped from the Nazis in Germany and emigrated to Israel. Avi is the oldest of his parents three sons. He has a brother, one year younger than him, who became a biologist, and a brother, about six years younger, who became an engineer. In Israel, Pinchas Wigderson became an electrical engineer working for the navy while Avi's mother was a part-time nurse. Speaking about his father in the interview\n[\n38\n]\nhe said:-\nMy father, in different conditions would have been an intellectual. He would have been maybe an academic, I don't know, it's very hard to say but he was just forced to find a job when he arrived. Then he had a family and he supported it.\nSpeaking about his early years, Wigderson said\n[\n38\n]\n:-\nWe grew up, me and my two brothers, in a tiny apartment in a block in a neighbourhood on the beach in Haifa. It is very different if I look at it now than I did as a kid. For a child it was heaven because up till the age of fifteen pretty much all I did was play around the beach and play soccer. They were the only two activities we were engaged in like most kids.\nAlthough, like the other children in the neighbourhood he loved swimming and playing soccer, he did stand out as being somewhat different since he loved reading and studying. His father loved puzzles; in fact he told his children that his job involved fixing the engines of large boats, finding out what was wrong, and that was an intellectual puzzle. He had brought Russian puzzle books with him when he came to Israel, and although Avi could no read Russian, his father would get him to solve these mathematical puzzles which Avi loved.\nThe local school that Wigderson attended was rather poor but he said they did one good thing for him which was to advise him to go to the Hebrew Reali High School for his secondary education\n[\n38\n]\n:-\nThere is a famous high school, the Reali High School, in Haifa which was a semi-private place which was a rare thing in Israel, it still is a rare thing in Israel. It was a very good high school. In it there were some excellent teachers, in particular I had a maths teacher\n[\nKaplan\n]\nwho had just come from Ukraine in my last year of high school and he was phenomenal. His teaching was rigorous but it was also inspiring - his love, his passion for mathematics. He had written textbooks in Russian which I had copies of even though I couldn't read them but they taught me something. He gave extra-curricular classes, going beyond the syllabus, so some of us took these classes learning about some college material.\nWigderson would have wanted to begin his university studies immediately after graduating from the Hebrew Reali High School, but there was compulsory military service which he had to undertake before continuing his education. He spent a year in an army flying course, training to become a pilot. He said that fortunately he failed, he did not fly well enough, otherwise he would have had to do seven years military service. He still had to spend two further years of military service doing an office job to complete the minimum requirement of three years. He then returned to Haifa where he enrolled in Technion, the Israel Institute of Technology, in\n1977\n.\nHe wanted to study mathematics but his parents advised him to study computer science since then he would learn mathematics but he would be qualified for a good job after he graduated. It worked out very well for him. The Computer Science Department at Technion had been established in\n1969\nand the first class of ten students had graduated in\n1972\n. By the time Wigderson entered in\n1977\nhe was one of a class of forty students. Quite a number of this class are now academics in different institutions around the world. They had teachers that Wigderson described as \"wonderful\" and \"inspiring\" and, not surprisingly, he particularly enjoyed the teaching of the theoreticians. Many of his lecturers had studied mathematics: they were mathematicians who saw the challenges in the new topic of computer science and enjoyed using their skills on this topic. This was in contrast to the early development of computer science in the United States, for example, where the subject developed in engineering departments. Wigderson wrote\n[\n27\n]\n:-\nWe had, in particular, a very inspiring teacher, Shimon Even, at the Technion. His courses on algorithms and complexity were extremely inspiring. When I applied to graduate school I applied for continuing to do this sort of stuff. This was how I was drawn into theoretical computer science.\nSince Shimon Even\n(1935\n-\n2004)\nhad a major influence on the direction of Wigderson's career, it is worth quoting from\n[\n39\n]\nabout his career:-\nShimon Even received a B.Sc. degree in Electrical Engineering from the Technion in\n1959\n, an M.A. in Mathematics from the University of Northern Carolina in\n1961\n, and a Ph.D. in Applied Mathematics from Harvard University in\n1963\n. He held positions at the Technion\n(1964\n-\n67\nand\n1974\n-\n2003)\n, Harvard University\n(1967\n-\n69)\n, the Weizmann Institute\n(1969\n-\n74)\n, and the Tel-Aviv Academic College\n(2003\n-\n04)\n. ...  In\n1974\nhe joined the newly formed computer science department at the Technion and shaped its academic development for several decades. ... Shimon Even was a superb teacher, and his courses deeply influenced many of the students attending them. His lectures, at numerous international workshops and schools, inspired a great number of students and researchers. His books, especially his celebrated Graph Algorithms, carried his educational message also to computer scientists who were not fortunate enough to meet him in person. As a mentor to aspiring researchers, Shimon was almost without peer, nurturing numerous junior researchers and advising many graduate students, who went on to have their own successful research careers.\nWigderson took mathematics courses and computer science courses. He met Edna Rothenstein, a mathematics student, and they married in their final year as undergraduates at Technion; they have three children, Eyal Wigderson, Einat Wigderson\n(\nborn\n9\nDecember\n1984)\nand Yuval Wigderson. In\n1980\nhe was awarded a B.Sc. 'Summa cum laude' in Computer Science from Technion. After Technion awarded an honorary degree to Wigderson in June\n2023\n, he spoke on behalf of all the recipients\n[\n47\n]\n:-\nMy connections with the Technion are deep and numerous. It's my alma mater. It inspired and prepared me for my career. I met my wife here. We even got married here. Israeli universities, and the Technion in particular, have been beacons of excellence, contributing to Israel's economy and security. The Technion is dedicated to the pursuit of knowledge and truth. Openness, inclusivity, free speech - these are the necessary foundations of this search; without them, there can be no truth and no science.\nBefore graduating, he had applied to around ten universities to undertake postgraduate studies and had been accepted by Princeton and Yale. Only these two offered him a fellowship which, of course, he required. Shimon Even told him that the two were about the same for theoretical computer science but Princeton would be the better place to live of the two options, so he accepted a place there to study for his Master's degree. Edna Wigderson signed up to study for a Master's Degree in mathematics at Rutgers University.\nIn\n1981\nWigderson was awarded the degree of Master of Science in Engineering in Computer Science from Princeton and, in the following year, an M.A. in Computer Science. There were only two theoretical computer scientists at Princeton when Wigderson began his studies there and Richard Jay Lipton became his advisor. Lipton\n(\nborn\n1946)\nhad been awarded a Ph.D. by Carnegie Mellon University in\n1973\nfor his thesis\nOn Synchronization Primitive Systems\n, then taught at Yale\n(1973\n-\n1978)\nand Berkeley\n(1978\n-\n1980)\nbefore being appointed to Princeton in\n1980\n, the year Wigderson began his studies. In the interview\n[\n38\n]\nWigderson said:-\nLipton did complexity; he became my advisor. So this attracted me more. He is a man of amazing creativity and broad interests so we kept switching research areas. I moved with him and I learned various things. He would ask me questions about many of the areas and I became interested in lots of things so now I don't think of myself as working in one area; maybe I got his bug of thinking about mathematical questions about computing and its very broad.\nThe only definite choice Wigderson made about the areas of computer science that he wanted to work in was that they had to be close to mathematics. He did not, however, have a very strong mathematical background having done an undergraduate degree in computer science so he had to learn more mathematics, something that he really loved doing. His first conference paper was presented to the annual ACM Symposium on Theory of Computing held in San Francisco\n5\n-\n7\nMay\n1982\n. The paper was\nA New Approximate Graph Coloring Algorithm\nwhich was published in the conference proceedings and in the\nJournal\nof the ACM in\n1983\n. The\n1983\nACM Symposium on Theory of Computing was held in Boston\n28\n-\n30\nApril. He presented two papers;\nSuperconcentrators, Generalizers, and Generalized Connectors with Limited Depth\nwhich had the co-authors D Dolev, C Dwork, N Pippenger and A Wigderson; and\nHow Discreet is the Discrete Log?\nwith co-authors D Long and A Wigderson. He also presented the paper\nThe Security of Multi-Party Protocols in Distributed Systems\n(\njoint with D Dolev\n)\nto the Crypto\n82\nConference held in the University of California's Santa Barbara campus\n23\n-\n25\nAugust\n1982\n.\nWigderson was awarded a Ph.D. in\n1983\nfor his thesis\nStudies in Combinatorial Complexity\n. He explained\n[\n23\n]\n:-\nI wrote papers with classmates on different subjects and my thesis was just a collection of a few papers. It was not really a cohesive topic but my advisor was happy with it, so I was happy too. In the meantime my wife and I also had our first child, which is maybe a more impressive production than a Ph.D.\nHe did postdoctoral work as a Visiting Assistant Professor in the Department of Computer Science at the University of California Berkeley, California\n(1983\n-\n84)\n, as a Visiting Scientist at IBM Research in San Jose, California\n(1984\n-\n85)\n, and as a Fellow at the Mathematical Sciences Research Institute, Berkeley, California\n(1985\n-\n86)\n. In\n1986\nhe returned to Israel when he was appointed as a Senior Lecturer in the Department of Computer Science at the Hebrew University, Jerusalem. He was given tenure and promoted to Associate Professor in\n1987\n. While continuing to hold this position, he was back in the United States\n1990\n-\n92\nas a Visiting Associate Professor in the Department of Computer Science at Princeton. While in the United States, he was promoted to Professor in the Computer Science Institute of the Hebrew University, Jerusalem. He left the United States in\n1992\nand returned to the Hebrew University where he was made Chairman of the Computer Science Institute in the following year. In August\n1995\nhe became a Visiting Professor in the Department of Computer Science, Princeton University, and a member of the School of Mathematics at the Institute for Advanced Study, Princeton.\nWhile continuing to hold his position at the Hebrew University in Jerusalem, Wigderson made two visits to the Institute for Advanced Study, Princeton over the next few years, being a member of the School of Mathematics at the Institute for Advanced Study from September to December\n1997\nand a Visitor there from November to September\n1998\n. In July\n1999\nhe joined the Faculty as a Professor at the School of Mathematics at the Institute for Advanced Study, a position he continues to hold\n(\nwritten in January\n2024)\n.\nWigderson's contributions are discussed in the paper\n[\n22\n]\n. The Introduction to the paper begins:-\nIn a career that has spanned more than\n40\nyears, Wigderson has resolved longstanding open problems, made definitions that shaped entire fields, built unexpected bridges between different areas, and introduced ideas and techniques that inspired generations of researchers. A recurring theme in Wigderson's work has been uncovering the deep connections between computer science and mathematics. His papers have both demonstrated unexpected applications of diverse mathematical areas to questions in computer science, and shown how to use theoretical computer science insights to solve problems in pure mathematics.\nThe paper discusses: Wigderson's contributions to cryptography; his contributions to the field of pseudo-randomness, an area of computer science and mathematics which shows that many deterministic processes can still behave in a \"random-like\" or pseudorandom manner; his work on proving lower bounds on the computational resources needed to achieve computational tasks; and his contributions to developing and analysing continuous optimisation algorithms for various problems in computational complexity theory, mathematics, and physics.\nMuch of Wigderson's contributions are described in his book\nMathematics and Computation: A Theory Revolutionizing Technology and Science\n(2019)\n. He writes in the Introduction\n[\n51\n]\n:-\nHere is just one tip of the iceberg we'll explore in this book: How much time does it take to find the prime factors of a\n1\n,\n000\n-digit integer? The facts are that\n(1)\nwe can't even roughly estimate the answer: it could be less than a second or more than a million years, and\n(2)\npractically all electronic commerce and Internet security systems in existence today rest on the belief that it takes more than a million years!\nDigesting even this single example begins to illuminate the conceptual revolution of computational complexity theory, to which this book is devoted. It illustrates how a pure number theoretic problem, which has been studied for millennia by mathematicians, becomes a cornerstone of a trillion-dollar industry, on which practically all people, companies, and countries crucially depend. Extracting this novel meaning and utility relies on making the above problem precise, and on transforming the informal statement of\n(2)\ninto a mathematical theorem. This in turn requires formal definitions of such concepts as algorithm, efficiency, secret, and randomness, among others, including several new notions of proof. The difficulty of resolving\n(\nthe now all-important\n)\nchallenge\n(1)\n, namely, proving the hardness of factoring or suggesting alternatives to it, is intimately related to the great conundrum of P vs. NP. And as a final twist in this plot, a fork appeared in our computational path, by which the answer to\n(1)\nmay radically depend on whether we allow classical or quantum physics to power our computers. This new possibility has propelled huge investments in academia and industry to attempt to physically realise the potential of quantum computers. It also demands revisiting and redefining the very concepts mentioned above, as well as many physical ones like entanglement and decoherence, interacting with quantum mechanics and proposing novel ways of testing its foundations.\nThe book you are reading will explore the mathematical and intellectual aspects of this goldmine. It will explain computational complexity theory, the concepts this theory created and revolutionised, and its many connections and interactions with mathematics. In its half-century of existence, computational complexity theory has developed into a rich, deep, and broad mathematical theory with remarkable achievements and formidable challenges. It has forged strong connections with most other mathematical fields and at the same time is having a major practical impact on the technological revolution affecting all aspects of our society\n(\nof which Internet security and quantum computing above are \"mere\" examples\n)\n.\nComputational complexity theory is a central subfield of the theory of computation\n(\nToC\n)\n, and is playing a pivotal role in its evolution. This theory stands with the great ones of physics, biology, maths, and economics, and is central to a new scientific revolution informed by computation. I have devoted the final chapter of this book\n(\nwhich can be read first\n)\nto a panoramic overview of ToC. That chapter describes the intellectual supernova that the theory of computing has created and continues to shape. It reveals the broad reach of ToC to all sciences, technology, and society, and discusses its methodology, challenges, and unique position in the intellectual sphere.\nThe book was reviewed by Frederic Green who writes\n[\n32\n]\n:-\nFar too many mathematical papers and texts fall short on explanations\n(\nI'm tempted to say that the non-readability property in the universe of such papers is pseudo-random, or even that too many zero-knowledge proofs make their way into the literature\n)\n. While one does see some attention paid to such issues, we are left wanting more: Why do we define things a certain way? Why is this theorem interesting? How might one come up with this proof? What is the intuition behind it? How did people come to study these concepts, where do they come from, and where are they going? This book fills in this gap for an enormous swath of ToC, largely but not exclusively as regards computational complexity, and how it interacts with mathematics. ... \"Mathematics and Computation\" is a truly outstanding book. One could hardly find a more expert and capable field guide than Avi Wigderson.\nWigderson was elected as a member of the\nAmerican Academy of Arts and Sciences\nin\n2011\nand to the\nNational Academy of Sciences\nin\n2013\n. The Association for Computing Machinery elected him a Fellow in\n2018\nfor:-\n... contributions to theoretical computer science and mathematics.\nWigderson has received many awards including: the Bergman Fellowship\n(1989)\n; the Yoram Ben-Porat Presidential Prize for Outstanding Researcher\n(1994)\n; the\nRolf Nevanlinna\nPrize\n(1994)\n; the Levi L Conant Prize\n(2008)\n; the\nGödel\nPrize\n(2009)\n; the\nDonald E Knuth\nPrize\n(2019)\n; the\nAbel\nPrize\n(2021)\n; and the\nTuring\nAward\n(2023)\n.\nWe give brief information about these prizes below, but for details of the prizes, including some Press Releases and other Announcements, see\nTHIS LINK\n.\nThe\nRolf Nevanlinna\nPrize was awarded by the\nInternational Mathematical Union\n, financed by the University of Helsinki, every four years at the International Congress of Mathematicians. It was awarded for outstanding contributions to Mathematical Aspects of Information Sciences. Like the\nFields\nMedal, the candidate had to be under forty years of age. Wigderson received the\nRolf Nevanlinna\nPrize in\n1994\nfor his work on computational complexity. We note that the last award of the\nRolf Nevanlinna\nPrize was made in\n2018\nand the award was continued as the IMU Abacus Medal. Wigderson received the\nRolf Nevanlinna\nPrize at the end of the Opening Ceremony of the International Congress of Mathematicians on\n3\nAugust\n1994\n. He was announced as the winner by\nJacques-Louis Lions\n, Chairman of the\nRolf Nevanlinna\nPrize Committee, and awarded the Prize by\nBeno Eckmann\n.\nFor extracts from\nYuri Matiyasevich\n's lecture\nOn some works of Avi Wigderson\ndelivered at the Congress, see\nTHIS LINK\n.\nThe Levi L Conant Prize was established by the\nAmerican Mathematical Society\nin\n2000\nin honour of Levi L Conant who spent most of his career as a faculty member at Worcester Polytechnic Institute. The Prize recognises the best expository paper published in either the\nNotices\nof the\nAmerican Mathematical Society\nor the\nBulletin\nof the\nAmerican Mathematical Society\nin the preceding five years. The\n2008\naward was made to Shlomo Hoory, Nathan Linial, and Avi Wigderson for their article \"Expander graphs and their applications\" published in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n2006\n.\nFor more information, including a review of the paper, and Wigderson's response to receiving the award, see\nTHIS LINK\n.\nThe\nGödel\nPrize is awarded by the Association for Computing Machinery's Special Interest Group on Algorithms and Computation Theory. The\nGödel\nPrize for outstanding papers in the area of theoretical computer science is sponsored jointly by the European Association for Theoretical Computer Science and the ACM Special Interest Group on Algorithms and Computation Theory of the Association for Computing Machinery. This award is presented annually, with the presentation taking place alternately at the European Association for Theoretical Computer Science International Colloquium on Automata, Languages, and Programming and the ACM Symposium on Theory of Computing. The\n2009\nGödel\nPrize was awarded to Avi Wigderson, Omer Reingold and Salil Vadhan for their paper\nEntropy Waves, the Zig-Zag Graph Product, and New Constant Degree Expanders\n. They received the Prize at the ACM Symposium on Theory of Computing held from\n31\nMay to\n2\nJune in Bethesda, Maryland.\nFor more information, see\nTHIS LINK\n.\nThe\nKnuth\nPrize is awarded by the Association for Computing Machinery's Special Interest Group on Algorithms and Computation Theory and by the Institute of Electrical and Electronics Engineers' Computer Society's Technical Committee on the Mathematical Foundations of Computing. The\nKnuth\nPrize is awarded in alternating years at the Association for Computing Machinery Symposium on Theory of Computing and at the Institute of Electrical and Electronics Engineers Symposium on Foundations of Computer Science. Wigderson was awarded the\n2019\nKnuth\nPrize:-\n... for fundamental and lasting contributions to the foundations of computer science in areas including randomised computation, cryptography, circuit complexity, proof complexity, parallel computation, and our understanding of fundamental graph properties.\nWigderson delivered the\nKnuth\nLecture Optimization, Complexity and Math\n(\nor, can we prove P ≠ NP using gradient descent?\n)\nat the Annual ACM Symposium on Theory of Computing.\nThe\nAbel\nPrize was established by the Norwegian Parliament, The Storting, in\n2002\n, on the occasion the\n200\n-year anniversary of the birth\nNiels Henrik Abel\n. It is awarded by The\nNorwegian Academy of Science and Letters\nand the first award was made in\n2003\nto\nJean-Pierre Serre\n. The\n2021\nAbel\nPrize was awarded jointly to\nLászló Lovász\nand Avi Wigderson:-\n... for their foundational contributions to theoretical computer science and discrete mathematics, and their leading role in shaping them into central fields of modern mathematics.\nThere is much information about the work of Wigderson which led to him being awarded the\nAbel\nPrize at\nTHIS LINK\n.\nLet us end this biography with quoting from the advertisement for a lecture Wigderson gave to the National Math Festival in May\n2019\n. It shows the type of questions that Wigderson has studied and the remarkable answers he has proved\n[\n4\n]\n:-\nCan you play poker on the telephone with people you don't trust? Amazingly, you can! ... the ideas involved, and related ones, also underlie internet security and e-commerce.\nThe general public is well aware of the essential role cryptography plays in underlying security and privacy of all digital communications. Much less known are the beautiful ideas and concepts underlying cryptography, and the amazing impact they had on many other developments in computer science.\nPerhaps even less known is how cryptography arose from mind games and toy problems\n(\nsee below\n)\nwhich predated the Internet, and whose magical solutions enabled the many applications which drove its fast development.\nCan two people who never met create a secret language, in the presence of others, which no one but them can understand? Can you convince others that you have solved a really difficult puzzle, without giving them the slightest hint of your solution? Can a group of people play a\n(\ncard-less\n)\ngame of poker on the telephone, without anyone being able to cheat? Can they collectively toss a fair coin so that no subset can bias it?\nSuch questions\n(\nand their remarkable answers\n)\nkick-started the theory of modern cryptography.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Combinatorics",
    "Logic"
  ]
}