{
  "nome_completo": "Abu Ali al-Husain ibn Abdallah ibn Sina (Avicenna)",
  "nome_curto": "Avicenna",
  "ano_nascimento": "980",
  "ano_morte": "1037",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Avicenna/",
  "lugar_nascimento": "Kharmaithen (near Bukhara), Central Asia (now Uzbekistan)",
  "lugar_morte": "Hamadan, Persia (now Iran)",
  "biografia": "Ibn Sina\nis often known by his Latin name of\nAvicenna,\nalthough most references to him today have reverted to using the correct version of ibn Sina. We know many details of his life for he wrote an autobiography which has been supplemented with material from a biography written by one of his students. The autobiography is not simply an account of his life, but rather it is written to illustrate his ideas of reaching the ultimate truth, so it must be carefully interpreted. A useful critical edition of this autobiography appears in\n[\n7\n]\nwhile a new translation appears in\n[\n9\n]\n.\nThe course of ibn Sina's life was dominated by the period of great political instability through which he lived. The Samanid dynasty, the first native dynasty to arise in Iran after the Muslim Arab conquest, controlled Transoxania and Khorasan from about\n900\n. Bukhara was their capital and it, together with Samarkand, were the cultural centres of the empire. However, from the middle of the\n10\nth\ncentury, the power of the Samanid's began to weaken. By the time ibn Sina was born, Nuh ibn Mansur was the Sultan in Bukhara but he was struggling to retain control of the empire.\nIbn Sina's father was the governor of a village in one of Nuh ibn Mansur's estates. He was educated by his father, whose home was a meeting place for men of learning in the area. Certainly ibn Sina was a remarkable child, with a memory and an ability to learn which amazed the scholars who met in his father's home. By the age of ten he had memorised the Qur'an and most of the Arabic poetry which he had read. When ibn Sina reached the age of thirteen he began to study medicine and he had mastered that subject by the age of sixteen when he began to treat patients. He also studied logic and\nmetaphysics\n, receiving instruction from some of the best teachers of his day, but in all areas he continued his studies on his own. In his autobiography\n(\nsee\n[\n7\n]\nor\n[\n9\n]\n)\nibn Sina stresses that he was more or less self-taught but that at crucial times in his life he received help.\nIt was his skill in medicine that was to prove of great value to ibn Sina for it was through his reputation in that area that the Samanid ruler Nuh ibn Mansur came to hear of him. After ibn Sina had cured the Samanid ruler of an illness, as a reward, he was allowed to use the Royal Library of the Samanids which proved important for ibn Sina's development in the whole range of scholarship.\nIf the fortunes of the Samanid rulers had taken a turn for the better, ibn Sina's life would have been very different. Nuh ibn Mansur, in an attempt to keep in power, had put Sebüktigin, a former Turkish slave, as the ruler of Ghazna and appointed his son Mahmud as governor of Khorasan. However the Turkish Qarakhanids, already in control of most of Transoxania, joined with Mahmud and moved to depose the Samanids. After gaining Khorasan they took Bukhara in\n999\n. There followed a period of five years in which the Samanids tried to regain control but their period of power was over. As recounted in\n[\n2\n]\n:-\nDestiny had plunged\n[\nibn Sina\n]\ninto one of the tumultuous periods of Iranian history, when new Turkish elements were replacing Iranian domination in Central Asia and local Iranian dynasties were trying to gain political independence from the 'Abbasid caliphate in Baghdad\n(\nin modern Iraq\n)\n.\nThe defeat of the Samanids and another traumatic event, the death of his father, changed ibn Sina's life completely. Without the support of a patron or his father, he began a life of wandering round different towns of Khorasan, acting as a physician and administrator by day while every evening he gathered students round him for philosophical and scientific discussion. He served as a jurist in Gurganj, was in Khwarazm, then was a teacher in Gurgan and next an administrator in Rayy. Perhaps most remarkable is the fact that he continued to produce top quality scholarship despite his chaotic life style. For\n[\n2\n]\n:-\n... the power of concentration and the intellectual prowess of\n[\nibn Sina\n]\nwas such that he was able to continue his intellectual work with remarkable consistency and continuity and was not at all influenced by the outward disturbances.\nAfter this period of wandering, ibn Sina went to Hamadan in west-central Iran. Here he settled for a while becoming court physician. The ruling Buyid prince, Shams ad-Dawlah, twice appointed him vizier. Politics was not easy at that time and ibn Sina was forced into hiding for a while by his political opponents and he also spent some time as a political prisoner in prison\n[\n26\n]\n... but he escaped to Isafan, disguised as a Sufi, and joined Ala al-Dwla.\nIbn Sina's two most important works are\nThe Book of Healing\nand\nThe Canon of Medicine\n. The first is a scientific encyclopaedia covering logic, natural sciences, psychology, geometry, astronomy, arithmetic and music. The second is the most famous single book in the history of medicine. These works were begun while he was in Hamadan.\nAfter being imprisoned, ibn Sina decided to leave Hamadan in\n1022\non the death of the Buyid prince whom he was serving, and he travelled to Isfahan. Here he entered the court of the local prince and spent the last years of his life in comparative peace. At Isfahan he completed his major works begun at Hamadan and also wrote many other works on philosophy, medicine and the Arabic language.\nDuring military campaigns ibn Sina was expected to accompany his patron and many of his works were composed on such campaigns. It was on one such military campaign that he took ill and, despite attempting to apply his medical skills to himself, died\n[\n1\n]\n:-\n... of a mysterious illness, apparently a colic that was badly treated; he may, however, have been poisoned by one of his servants.\nIbn Sina's wrote about\n450\nworks, of which around\n240\nhave survived. Of the surviving works,\n150\nare on philosophy while\n40\nare devoted to medicine, the two fields in which he contributed most. He also wrote on psychology, geology, mathematics, astronomy, and logic. His most important work as far as mathematics is concerned, however, is his immense encyclopaedic work, the\nKitab al-Shifa'\nⓉ\n(\nThe Book of Healing\n)\n. One of the four parts of this work is devoted to mathematics and ibn Sina includes astronomy and music as branches of mathematics within the encyclopaedia. In fact he divided mathematics into four branches, geometry, astronomy, arithmetic, and music, and he then subdivided each of these topics. Geometry he subdivided into geodesy, statics, kinematics, hydrostatics, and optics; astronomy he subdivided into astronomical and geographical tables, and the calendar; arithmetic he subdivided into algebra, and Indian addition and subtraction; music he subdivided into musical instruments.\nThe geometric section of the encyclopaedia is, not surprisingly, based on\nEuclid\n's\nElements\n. Ibn Sina gives proofs but the presentation lacks the rigour adopted by\nEuclid\n. In fact ibn Sina does not present geometry as a deductive system from axioms in this work. We should note, however, that this was the way that ibn Sina chose to present the topic in the encyclopaedia. In other writings on geometry he, like many Muslim scientists, attempted to give a proof of Euclid's fifth postulate. The topics dealt with in the geometry section of the encyclopaedia are: lines, angles, and planes; parallels; triangles; constructions with\nruler and compass\n; areas of parallelograms and triangles; geometric algebra; properties of circles; proportions without mentioning\nirrational\nnumbers; proportions relating to areas of polygons; areas of circles; regular polygons; and volumes of polyhedra and the sphere. Full details are given in\n[\n17\n]\n.\nIbn Sina made astronomical observations and we know that some were made at Isfahan and some at Hamadan. He made several correct deductions from his observations. For example he observed Venus as a spot against the surface of the Sun and correctly deduced that Venus must be closer to the Earth than the Sun. This observation, and other related work by ibn Sina, is discussed in\n[\n53\n]\n. Ibn Sina invented an instrument for observing the coordinates of a star. The instrument had two legs pivoted at one end; the lower leg rotated about a horizontal protractor, thus showing the\nazimuth\n, while the upper leg marked with a scale and having observing sights, was raised in the plane vertical to the lower leg to give the star's altitude. Another of ibn Sina's contributions to astronomy was his attempt to calculate the difference in longitude between Baghdad and Gurgan by observing a meridian\ntransit\nof the moon at Gurgan. He also correctly stated, with what justification it is hard to see, that the velocity of light is finite.\nAs ibn Sina considered music as one of the branches of mathematics it is fitting to give a brief indication of his work on this topic which was mainly on tonic intervals, rhythmic patterns, and musical instruments. Some experts claim that ibn Sina's promotion of the consonance of the major third led to the use of just intonation rather than the intonation associated with\nPythagoras\n. More information is contained in T S Vyzgo's paper \"On Ibn Sina's contribution to musicology\" in\n[\n5\n]\n.\nMechanics was a topic which ibn Sina classified under mathematics. In his work\nMi'yar al-'aqul\nibn Sina defines simple machines and combinations of them which involve rollers, levers, windlasses, pulleys, and many others. Although the material was well-known and certainly not original, nevertheless ibn Sina's classification of mechanisms, which goes beyond that of\nHeron\n, is highly original.\nSince ibn Sina's major contributions are in philosophy, we should at least mention his work in this area, although we shall certainly not devote the space to it that this work deserves. He discussed reason and reality, claiming that God is pure intellect and that knowledge consists of the mind grasping the intelligible. To grasp the intelligible both reason and logic are required. But, claims ibn Sina\n[\n26\n]\n:-\n... it is important to gain knowledge. Grasp of the intelligibles determines the fate of the rational soul in the hereafter, and therefore is crucial to human activity.\nIbn Sina gives a theory of knowledge, describing the abstraction in perceiving an object rather than the concrete form of the object itself. In metaphysics ibn Sina examined existence. He considers the scientific and mathematical theory of the world and ultimate causation by God. His aims are described in\n[\n1\n]\nas follows:-\nIbn Sina sought to integrate all aspects of science and religion in a grand metaphysical vision. With this vision he attempted to explain the formation of the universe as well as to elucidate the problems of evil, prayer, providence, prophecies, miracles, and marvels. also within its scope fall problems relating to the organisation of the state in accord with religious law and the question of the ultimate destiny of man.\nIbn Sina is known to have corresponded with\nal-Biruni\n. In\n[\n10\n]\n, eighteen letters which ibn Sina sent to\nal-Biruni\nin answer to questions that he had posed are given. These letters cover topics such as philosophy, astronomy and physics. There is other correspondence from ibn Sina which has been preserved which has been surveyed in the article\n[\n31\n]\n. The topics of these letters include arguments against theologians and those professing magical powers, and refutation of the opinions of those having a superficial interest in a branch of knowledge. Ibn Sina writes on certain topics in philosophy, and writes letters to students who must have asked him to explain difficulties they have encountered in some classic text. The authors of\n[\n31\n]\nsee ibn Sina as promoting natural science and arguing against religious men who attempt to obscure the truth.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}