{
  "nome_completo": "Axel Thue",
  "nome_curto": "Axel Thue",
  "ano_nascimento": "1863",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thue/",
  "lugar_nascimento": "Tönsberg, Norway",
  "lugar_morte": "Oslo, Norway",
  "biografia": "Axel Thue\nwas the son of Niels Thue\n(1825\n-\n1895)\n, a master mariner and later a ship owner, and Nicoline Cathinka Eger\n(1837\n-\n1866)\n. Axel was brought up in Tönsberg, a town on the Oslofjord, and attended middle school there. Initially he was attracted to physics but he became interested in mathematics through a rather strange event. He saw an advertisement for a book by Elling Holst entitled \"On pendulum's meaning of geometry\" and, quite naturally, believing it to be a physics book about the pendulum he sent off for a copy. When the book arrived he discovered that there had been a misprint in the advertisement and the title of the book was \"On Poncelet's meaning of geometry\". The book, written by the mathematician Elling Bolt Holst\n(1849\n-\n1915)\n, was published in\n1878\nand was a prize winning geometry text. When Thue discovered that it was a mathematics book rather than the physics book he had expected, nevertheless he read it. In fact, the book documents the influence on modern geometry of\nJean-Victor Poncelet\n, and Thue became fascinated by the mathematics it described. He took the middle school examinations in Tönsberg in\n1880\nand, later that year, became a pupil at the Aars and Voss's school in Oslo.\nWhen Thue became a pupil at the school in\n1880\n, Elling Holst was his mathematics teacher. Holst had studied under\nSophus Lie\nand\nFelix Klein\nbefore being appointed as a teacher at the Aars and Voss's school in Oslo in\n1876\n. The physicist Kristian Birkeland, who was also taught by Holst at Aars and Voss's school, wrote on Holst's death:-\nNo other man has ever touched me as deeply as Elling when I was young and I am thankful to have known him. He was such a special person.\nIt is clear that Holst meant the same to Thue. In\n1883\nhe prepared to take his final examinations at the\ngymnasium\n. He recorded in his diary important events that took place in the run up to these examinations\n[\n6\n]\n:-\nIt was during the examinations. I read and read to get as high a mark as possible. Just before the examination Holst showed me some problems in the Danish mathematical periodical. I was fortunate enough to solve these, and I sent the solutions in to Copenhagen. One day Holst came in and handed me a copy of the Danish mathematical periodical, where, to my pleasure I found a description of one of my solutions. Holst circulated this copy in the class when later in the day we were gathered at a school party, where I was given a gratifying testimonial. The day before I had visited Holst in Asker. I had an agreeable evening there. We had a glass of punch and talked about\nLie\n's geometry of spheres and about link systems and other pleasant things. A few days afterwards I left for Tönsberg on vacation.\nHe then enrolled in the Faculty of Mathematics and Natural Sciences of the University of Oslo graduating in\n1889\n. While he was an undergraduate he gave fifteen lectures in the mathematical seminar which had been founded by Holst. One of these lectures was attended by\nSophus Lie\nand now both Holst and\nLie\nbegan to advise the young man on applying for a travelling scholarship. Early in\n1889\n,\nSophus Lie\nwrote a letter to Holst supporting Thue\n[\n6\n]\n:-\nI have advised Axel Thue to apply for a travelling scholarship this winter. Thue has shown in a series of original investigations that he has many of the qualifications needed to become an outstanding mathematician. ... I knew of Thue's work when I left Oslo in\n1886\n. I have been pleased to see from his later work that there has been a considerable increase in his knowledge and that he has set himself higher aims. Yet I still have a definite impression that his mathematical knowledge does not do justice to his gifts and his enthusiasm. It is for that reason that I consider it to be absolutely necessary for him to go ...  I therefore beg you to do all you can to obtain a travelling scholarship for Thue immediately.\nHolst wrote a letter supporting Thue's application in February\n1889\n[\n6\n]\n:-\nAxel Thue, currently studying sciences, has been a pupil of mine in mathematics since his first year in the science line at Aars and Voss's gymnasium. ... Throughout his school career he provided increasing confirmation of the impression I had received of him as one whose mathematical gifts exceeded those of anyone I had previously encountered as a school or university teacher. I will not deny that it was both a rare pleasure and no little responsibility to have such a pupil. Of recent years his independent studies have been concerned with the theory of numbers and the calculus of variations, two of the most difficult, and\n(\nas far as Norway is concerned\n)\nleast familiar mathematical disciplines.\nAfter the award of the scholarship, Thue went to Leipzig in\n1891\nto study under\nLie\n. However,\nViggo Brun\nwrites that\n[\n1\n]\n:-\n... his works do not reveal\nLie\n's influence, probably because of Thue's inability to follow anyone else's line of thought.\nWe do have a very good indication of his time in Leipzig from a letter he wrote to Holst. This tells us that Thue was seriously ill while in Leipzig and it must have meant that he did not profit as much as he might have done. See\nTHIS LINK\n.\nHe also spent a while in Berlin where he attended lectures by Georg Hermann Hettner\n(1854\n-\n1914)\n,\nHelmholtz\n,\nFuchs\nand\nKronecker\n. Again we have a nice description of Thue's opinion of Berlin and the mathematicians who lectured there in a letter he wrote to Holst in June\n1891\n. See\nTHIS LINK\n.\nBack in Olso, Thue held a scholarship in mathematics from\n1891\nto\n1894\n. On\n6\nJuly\n1894\nhe married Lucie Collett Lund, the daughter of the actor Anders Jacob Lund\n(1824\n-\n1896)\nand Marie Collett\n(1855\n-\n1891)\n. Lucie had been born on\n4\nAugust\n1873\nand was ten years younger than Thue. Axel and Lucie Thue had seven children over the following years. After his scholarship ended,  Thue was appointed to Trondheim Technical College where he worked from\n1894\nuntil\n1903\n. Although this was an excellent college, considered the best in the country to train engineers, Thue was not happy there. He continued to write to Holst and, in a letter dated\n28\nAugust\n1902\n, he writes\n(\nsee for example\n[\n6\n]\n)\n:-\nAll the same, in this destructive isolation, where nobody has any interest in my material, I have produced more and better work than previously. Thus I have developed a theory according to which inter alia I come to the same results as\nHermite\nand\nLindemann\nconcerning e and π.\nAlso in this letter he tells Holst that he is applying for the vacant applied mathematics professorship at Oslo University. His application was successful and he was appointed as professor of applied mathematics at Oslo University in\n1903\n. He held this post until his death in\n1922\n. In the years immediately following his appointment he was busy writing mechanics lectures and had little time for research. However, the period from\n1906\nto\n1916\nwas when Thue did his best work, although it was not accomplished in easy circumstances. His health was poor and he suffered from periods of chest pains. His large family\n(\nwe mentioned above that he had seven children\n)\nwas difficult to support with a professor's salary and took on extra work teaching at the military school in Oslo in an effort to give them a better life. However, given his health problems, extra work was the last thing he should have been doing. His physical heath problems seem to have had another effect on him, namely that he developed a great fear of being alone.\nViggo Brun\nwrites\n[\n6\n]\n:-\nAt the Scandinavian Mathematical Congress in Oslo in\n1913\n, he asked me, at the end of an evening party, to accompany him to his brother's house in Oslo, where he was to spend the night, as he couldn't get home to Nordstrand so late. When we reached his brother's, there was nobody there, as his brother was visiting somebody. I sat there until\n2\na.m., as I could appreciate Thue's fear of being alone in the house.\nLet us now look at some of Thue's mathematical contributions. In\n1909\nhe produced an important paper, published in\nCrelle\n's Journal, on\nalgebraic numbers\nshowing that, for example,\ny\n3\n−\n2\nx\n2\n=\n1\ny^{3} - 2x^{2} = 1\ny\n3\n−\n2\nx\n2\n=\n1\ncannot be satisfied by infinitely many pairs of integers. His work was extended by\nCarl Ludwig Siegel\nin\n1920\nand again by\nKlaus Roth\nin\n1958\n.\nEdmund Landau\n, in\n1922\n, described Thue's work as:-\n... the most important discovery in elementary number theory that I know.\nThue's Theorem states that:-\nIf f\n(\nx, y\n)\nis a homogeneous polynomial with integer coefficients, irreducible in the rationals and of degree >\n2\nand c is a non-zero integer then f\n(\nx, y\n)\n= c has only a finite number of integer solutions.\nHis contributions to the theory of\nDiophantine equations\nare discussed in\n[\n3\n]\n. In fact Thue wrote\n35\npapers on number theory, mostly on the theory of Diophantine equations, and these are reproduced in\n[\n2\n]\n.\nAnother famous contribution made by Thue was his four papers\nÜber unendliche Zeichenreihen\nⓉ\n(\nOn infinite rows of characters\n)\n(1906)\n,\nDie Lösung eines Spezialfalles eines generellen logischen Problems\nⓉ\n(\nThe solution of a special case of a general logical problem\n)\n(1910)\n,\nÜber die gegenseitige Lage gleicher Teile gewisser Zeichenreihen\nⓉ\n(\nOn the mutual position of equal parts of certain character strings\n)\n(1912)\nand\nProbleme über Veränderungen von Zeichenreihen nach gegebenen Regeln\nⓉ\n(\nIssues concerning changes in character strings by given rules\n)\n(1914)\n. These papers on words and languages present important work on the word problem for finitely presented semigroups. These papers were not seen as important when Thue wrote them but subsequent developments have shown him to be well ahead of his time in considering difficult problems that have since attracted a great deal of interest. Many of his results were rediscovered by mathematicians who were unaware of Thue's contributions. For example, he considered the problem of finding an infinite sequence over a finite alphabet that does not contain two adjacent identical blocks. Today this property has been called 'square freeness'. These papers are discussed in detail in\n[\n4\n]\n,\n[\n9\n]\nand\n[\n10\n]\n. In\n[\n10\n]\nMagnus Steinby and Wolfgang Thomas write:-\nMany of Axel Thue's ideas have been influential in theoretical computer science. In particular, Thue systems, semi-Thue systems and his work on the combinatorics of words are well-known. ... his\n1910\npaper ... contains many notions and ideas about trees, term rewriting and word problems which are surprisingly modern and have later come to play important roles in mathematics, logic, and computer science.\nJames Power writes in\n[\n9\n]\n:-\nAxel Thue published four papers directly relating to the theory of words and languages: two on patterns in infinite strings in\n1906\nand\n1912\nand two on the more general problem of transformations in\n1910\nand\n1914\n. Both the\n1906\nand\n1912\npapers have been translated and discussed extensively by Jean Berstel\n[\n4\n]\n, and are known, among other contributions, for their presentation of the Thue-\nMorse\nsequence. Thue's\n1910\npaper deals with transformations between trees, and is thus a more direct predecessor of his\n1914\npaper. It been discussed by Steinby and Thomas\n[\n10\n]\n. Thue's\n1914\npaper ... is mainly famous for proving an early example of an undecidable problem, cited prominently by\nEmil Post\nin 'Recursive unsolvability of a problem of Thue'\n(1947)\n.\nIf this work seems a little strange for a professor of applied mathematics then some quotes from Thue will clarify where he stood on the issue of applications. He wrote in one of his articles written while professor in Olso:-\nFor the development of the logical sciences it will be important to find wide fields for the speculative treatment of difficult problems, without regard to eventual applications.\nAnother quote from Thue on applied mathematics\n(\nsee for example\n[\n1\n]\n)\nis:-\nThe further removed from usefulness or practical application, the more important.\nHe did, however, make contributions to applied mathematics. For example his paper\nThe Principle of Virtual Velocity\nis\n[\n1\n]\n:-\n... an original statement that has no parallel in the literature.\nHowever, much of his work in mechanics, based on rods which transmitted forces, remained unfinished at his death. One characteristic of Thue's work should be mentioned. He seemed little interested in other people's mathematics and his papers are remarkable for the few references that they contain. For example, his\n1906\nand\n1910\npapers mentioned above contain no references at all while the\n1912\npaper only references his own\n1906\npaper, and the\n1914\npaper only references his own\n1910\nand\n1912\npapers. This might be considered both a weakness and a strength in allowing him to produce highly original material.\nThue was honoured by being elected to the\nNorwegian Academy of Science and Letters\nin\n1894\nand to the\nRoyal Norwegian Society of Sciences\nin Trondheim\n1895\n. He served as an editor of\nActa Mathematica\nfrom\n1916\nto\n1922\n. As his health deteriorated, the university gave him leave of absence in\n1920\n. By\n1921\nhe was a patient in Ulleval hospital in Oslo although he had his own room and was still able to work at his mathematics. In fact he spent this final period of his life working on\nFermat\n's last Theorem and when he died he left\n400\npages of manuscript which he had written during his investigations. He was buried in the Nordstrand cemetery. His wife died on\n22\nApril\n1962\n, almost exactly\n40\nyears after her husband. She is buried in the same tomb in the Nordstrand cemetery.\nLet us end this biography with a quote from Carl Stürmer\n[\n14\n]\n:-\nWith the death of Professor Thue on\n7\nMarch this year, the\nAcademy of Science\nhas lost one of its most illustrious members, a mathematical genius who united the gift of extraordinary originality with a rare perspicacity and sense of logic.\nExtracts from other commemorative speeches following Thue's death are given at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}