{
  "nome_completo": "Øystein Ore",
  "nome_curto": "Øystein Ore",
  "ano_nascimento": "1899",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ore/",
  "lugar_nascimento": "Kristiania (now Oslo), Norway",
  "lugar_morte": "Oslo, Norway",
  "biografia": "Øystein Ore\n's parents were Christiane Bendikte Samuelsen and Mikal Beer Ostensen Ore who was a lecturer. Øystein was born in Kristiania, Norway. In fact the city was still named Kristiania when Ore attended the Katedralskole there. His interest in mathematics was clear at this time and he graduated from the school in\n1918\n, entering unversity to study mathematics in the same year. He graduated from the University of Kristiania in\n1922\n. The city of Kristiania was renamed Oslo in\n1925\nby which time Ore had returned there as an assistant, but before this he had studied in a number of universities while undertaking research.\nOre's research was supervised by\nThoralf Skolem\nat Kristiania but he spent time at Göttingen University where he was influenced by\nEmmy Noether\nfinding her new approach to algebra particularly exciting. He was also a fellow at the\nMittag-Leffler\nInstitute in Djursholm, Sweden, but his thesis\nZur Theorie der algebraischen Körper\nⓉ\n(\nOn the theory of algebraic fields\n)\nwas submitted in\n1924\nto the University of Kristiania. Before taking up the research assistant position at the University of Oslo in\n1925\n, which we referred to above, he made another visit to Göttingen University as a fellow of the International Education Board, and also visited the Sorbonne in Paris.\nJames Pierpont\n, from Yale University in the United States, visited Europe in\n1926\nin an attempt to recruit top research mathematicians for Yale. Ore was offered an appointment as an Assistant Professor of Mathematics at Yale and in\n1927\nhe left Olso to take up the position. In Yale he was rapidly promoted, first to Associate Professor in\n1928\n, and then to full Professor in the following year. On\n25\nAugust\n1930\nhe married Gudrun Lundevall, the daughter of Kristoffer Lundevall and Marie Elizabeth Svensson, in Larvik, Norway. They had two children, Elizebeth and Berit.\nIn\n1931\nOre was honoured by being named Sterling Professor at Yale, a position he held for\n37\nyears until he retired in\n1968\n. He undertook certain administrative tasks, for example he was chairman of the department from\n1936\nto\n1945\n. He did visit Europe frequently, however, and almost every summer he returned to Oslo. During\n1954\nhe was a Guggenheim Fellow undertaking historical studies in Italy.\nDuring World War II Ore worked for the Norwegian people by playing a major role in the organisations \"American Relief for Norway\" and \"Free Norway\". The country of his birth recognised the outstanding help which he gave them during the war, and King Haaken VII of Norway decorated him with the Knight Order of St Olaf in\n1947\n.\nOre's early work was on\nalgebraic number fields\nwhere he was interested in the problem of decomposing the ideal generated by a prime integer into prime ideals. He reported on his work on this topic to the International Congress of Mathematicians at Toronto in\n1928\n. He then worked on non-commutative ring theory and proved his celebrated embedding theorem for a non-commutative integral domain into a division ring. He examined polynomial rings over skew fields, and further attempted to extend his work on factorisation to non-commutative rings. In\n1930\nthe\nCollected Works of Richard Dedekind\nwere published in three volumes, jointly edited by Ore and\nEmmy Noether\n. He then turned his attention to lattice theory and, together with\nGarrett Birkhoff\n, led the increasing activity in lattice theory throughout the\n1930\ns.\nOre wrote about\n120\nmathematics papers and ten books\n[\n1\n]\n:-\nOre's work on lattices led him to the study of equivalence relations, closure relations and\nGalois\nconnections, and then to the study of graph theory which occupied him to the end of his life. ...\n[\nHe\n]\nhad a lively interest in the history of mathematics and in biography of mathematicians. His unusual gift in writing books of wide appeal is manifest in his fine biography of\nAbel\n, written first in Norwegian then in English, and his book \"Cardano. The Gambling Scholar\". One may add parenthetically that he was occasionally interested himself in this aspect of applied probability.\nWe note that the two biographical books referred to in the quotation are\nCardano, the Gambling Scholar\npublished by Princeton Press in\n1953\n, and\nNiels Henrik Abel, Mathematician Extraordinary\npublished by Minnesota University Press in\n1957\n. Let us look now at some of the other books which Ore published. These include\nLes Corps Algébraique et la Théorie des Ideaux\nⓉ\n(\nAlgebraic fields and the theory of ideals\n)\n(1934)\n,\nL'Algèbre Abstraite\nⓉ\n(\nAbstract algebra\n)\n(1936)\n,\nNumber Theory and its History\n(1948)\n,\nTheory of Graphs\n(1962)\n,\nGraphs and Their Uses\n(1963)\n,\nThe Four-Color Problem\n(1967)\n, and\nInvitation to Number Theory\n(1969)\n. Let us look briefly at each in turn. In\nNumber Theory and its History\nOre states that his aim is to present:-\n... the results of the theory integrated more fully in the historical and cultural framework\n[\nthan is usual\n]\n.\nSchoenfeld in a review points out certain weaknesses in the presentation of the material but states:-\nIn its own sphere, the book gives a very readable account of the history of\n(\nclassical\n)\nnumber theory with much serious mathematical thought. In this respect, it is far superior to the usual histories of mathematics.\nThe\nTheory of Graphs\nwas published by the\nAmerican Mathematical Society\n. Ore explains his thinking behind the book in the Preface:-\nThe present book has grown out of courses on graph theory given from time to time at Yale University. The present century has witnessed a steady development of graph theory which in the last ten to twenty years has blossomed out into a new period of intense activity. Clearly discernible in this process are the effects of the demands from new fields of application: game theory and programming, communications theory, electrical networks and switching circuits as well as problems from biology and psychology. As a consequence of these recent developments the subject of graphs is already so extended that it did not seem feasible to cover all its main ramifications within the framework of a single volume. In the present first volume of an intended two-volume work the emphasis has been placed upon basic concepts and the results of particular systematic interest. An effort has been made to present the subject matter in the book in as simple a form as possible. Almost all proofs have been revised; a considerable number of new results are also included. A systematic terminology is introduced which it is hoped may prove acceptable. For the benefit of the reader a considerable number of problems have been included. Many of these are quite simple; others are more in the nature of proposed research problems; these have been marked with an asterisk. The second volume will be devoted to more special topics: planar graphs, the four-color conjecture, the theory of flow, games, electrical networks, as well as applications to a number of other fields in which graph theory is a principal tool.\nThe book\nGraphs and Their Uses\nis, according to\nTutte\n:-\n... an interesting experiment - a book on graph theory for high school students. It includes introductory accounts of\nEuler\ngraphs, trees, matchings, directed graphs, planar graphs and the four-colour problem.\nThe four-color problem\nwas also reviewed by\nTutte\nwho writes:-\nIt would not be hard to present the history of graph theory as an account of the struggle to prove the four colour conjecture, or at least to find out why the problem is difficult. Such a presentation is almost unavoidable in the special case of planar graphs.\n[\nOre\n]\nhas included most of the important results connected with the four colour problem in a single text-book. The reviewer recommends this work to all mathematicians interested in the problem. It is also to be recommended as a text book on planar graphs.\nBefore we end this description of Ore's mathematics let us look briefly at a couple of papers he wrote right at the end of his life. The paper\nSystematic computations on amicable numbers\nwas written by Ore in collaboration with J Alanen and J Stemple. Their own introduction reads:-\nThe first pair of\namicable numbers\nbeyond the classical\n(220\n,\n284)\nwas obtained by\nFermat\nin\n1636\n. Since that time a considerable number of amicable pairs\n(\nM\n,\nN\n)\n,\nM\n<\nN\n(M, N), M < N\n(\nM\n,\nN\n)\n,\nM\n<\nN\n, have been discovered. The present calculations have been performed systematically, testing each number up to\nM\n<\n1\n0\n6\nM < 10^{6}\nM\n<\n1\n0\n6\n. The computations also produce the\nperfect numbers\n<\n1\n0\n6\n< 10^{6}\n<\n1\n0\n6\n. Altogether there are\n42\npairs of amicable numbers below\n1\n0\n6\n10^{6}\n1\n0\n6\n. Among these there are nine new ones, not previously listed.\nThe paper\nDiameters in Graphs\npublished by Ore in\n1968\nlooks at diameter critical graphs. The diameter of a connected graph is the maximum of the distances between pairs of vertices of the graph. A graph without loops is diameter critical if the addition of an edge always reduces the diameter. Ore determines all diameter critical graphs in the paper.\nOre was a member of the\nAmerican Mathematical Society\nfor many years, serving on the Council during\n1934\n-\n36\nand being Colloquium lecturer in\n1941\n. He was also elected to the\nAmerican Academy of Arts and Sciences\nand the Oslo Academy of Science.\nIn\n[\n2\n]\nOre's interests outside mathematics are described:-\nThroughout his life he maintained a deep and knowledgeable interest in the world of art, particularly painting and sculpture. He was an ardent collector of ancient maps, concerning which he was somewhat of an expert. Like many other cultured Scandinavians, he was fluent in several foreign languages.\nHe died unexpectedly the day before he was due to lecture at a mathematical meeting in Oslo. He had planned to return to the United States and to spend the first year of his retirement undertaking research and writing books at the Center of Advanced Study of the Wesleyan University but it was not to be.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}