{
  "nome_completo": "Béla Gyires",
  "nome_curto": "Béla Gyires",
  "ano_nascimento": "1909",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gyires/",
  "lugar_nascimento": "Zagreb, Austria-Hungarian Empire (now Croatia)",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Béla Gyires\n' father, also named Béla Gyires, worked for the Hungarian State Railways. His mother was Julianna F Kiss. Although he spent the first few years of his life in Zagreb, after World War I ended and the countries of Europe underwent major changes to their territories, Béla's family moved to Debrecen. At the time Béla was born, Zagreb was in Croatia-Slavonia, an autonomous kingdom within the Hungarian part of the Austro-Hungarian Empire. In\n1918\n, when World War I ended, Zagreb became part of the newly created Yugoslavia and this was confirmed by the Treaty of Trianon in\n1920\n. The Gyires family's move to Debrecen, therefore, meant that they were again in Hungary. In Debrecen, Béla Gyires attended the Piarist\nGymnasium\n, graduating in\n1928\n. The Debrecen Piarist Gymnasium was a famous school which had been founded in\n1721\nand celebrated its\n200\nth\nanniversary on\n2\nJune\n1921\n. In\n1926\nthe school was renamed the Holy Roman Catholic Calasanzi St Joseph Gymnasium. It was at this school that Gyires first developed a love for mathematics. This was not so much from the school mathematics syllabus but more from the problem solving competitions which were a tradition in Hungary.\nAfter graduating in\n1928\n, Gyires entered the Péter Pázmány University of Budapest where he studied for his first degree, mainly taking courses in mathematics and physics. One of his lecturers was\nLipót Fejér\nwho led the highly successful Hungarian school of analysis. Gyires was awarded his first degree in\n1933\nwhich qualified him for a career as a high school teacher. He continued to study for his doctorate but, in\n1934\nbegan a career as a school teacher. The professor in Budapest who influenced him most was Károly Jordán\n(1871\n-\n1959)\n, an expert in probability theory and the theory of finite differences. Jordán had been made a professor in the year that Gyires graduated with his first degree and he is recognised as the founder of the Hungarian School of Probability. However, Jordán had wide interests having begun his career with an interest in chemical problems before making major contributions to integral geometry. Gyires, like Jordán who influenced him so strongly, had broad interests but made his most important contributions to the theory of probability and to mathematical statistics. For details of Jordán's life and work, see the\n1975\npaper\n[\n5\n]\nby Gyires.\nIn\n1934\nthe university was reorganised as Józef Nádor University of Technology and Economics. Gyires was awarded his doctorate from that university in\n1941\nand, in that year, published the paper\nA korlátolt pontosságú szorzás hibahatárai\nⓉ\n(\nThe margin of error in limited precision multiplication\n)\nwhich was his Ph.D. thesis. We mentioned above that Gyires worked as a school teacher while undertaking research for his doctorate. From\n1934\nto\n1938\nhe taught at the trade school in Pászto in northern Hungary. He moved back to Debrecen in\n1938\nwhen he became a teacher at the Piarist Gymnasium where he had studied himself as a student. He remained there until\n1943\n, the year in which he married Magdolna Simai who was a high school teacher. They had two children, Klara Gyires\n(\nborn\n1946)\nwho became a pharmacologist and professor at Semmelweis University in Budapest, and Tibor Béla Gyires\n(\nborn\n1948)\nwho became a mathematician and computer scientist. Tibor went to the United States in\n1984\nwhere he became a professor.\nIn\n1943\nGyires moved to Kassa, a town now known as Košice in Slovakia. The town, originally Hungarian, had become part of Czechoslovakia after World War I but was ceded to Hungary in November\n1938\nby the First Vienna Award, a treaty agreed as part of Germany's attempt to assist in Hungary's territorial restoration. Gyires taught at the College of Commerce there until\n1945\n. However these were the years of World War II and, after Kassa was captured by the Soviets in January\n1945\n, Gyires returned to Debrecen. There he was employed as a junior teacher at the Science and Technology Faculty of the Kossuth Lajos University of Debrecen. He assisted\nOttó Varga\n(1909\n-\n1969)\nwho founded the Hungarian school of differential geometry. In\n1946\nGyires\nhabilitated\nin linear algebra and analysis. He published several papers in\n1949\n. In\nFunktionensysteme mit vertauschbaren Gramschen Matrizen\nⓉ\n(\nSystems of functions  with interchangeable Gram matrices\n)\nhe used matrix methods to find all real symmetric positive definite matrices which commute with a given matrix of the same type. In\nDarstellung symmetrischer regulärer Matrizen als Produkt von zueinander transponierten Matrizen\nⓉ\n(\nPreparation of symmetrical regular matrices as a product of mutually transposed matrices\n)\nhe studied the general solution of the matrix equation\nX\nX\n′\n=\nF\nXX' = F\nX\nX\n′\n=\nF\n, where\nF\nF\nF\nis a real symmetric positive definite matrix. In\nÜber die Faktorisation im Restklassenring mod m\nⓉ\n(\nOn factorisation of the residue classes of ring mod m\n)\nhe looked at the number of solutions to the congruence 'fixed element a congruent to a product of r unknown elements\n(\nmod m\n)\n'.\nIn\n[\n3\n]\nthe following summary of his career is given:-\nBéla Gyires was a key personality at the Mathematics and Information Technology Institute of the Kossuth Lajos University of Science, which was a predecessor to the University of Debrecen. For many years he was director of the institute\n(1958\n-\n1974)\n. He founded\n(1952)\n, and headed for\n30\nyears, the Department of Probability Calculation and Applied Mathematics. It was under his direction that the Computing Centre was formed in\n1967\n. He was instrumental in ensuring that subjects as important and modern as probability calculation, mathematical statistics, computer science and information technology were incorporated into the university's curriculum. In\n1972\n, it was at his instigation and under his direction that the courses in Programming Mathematics was introduced. He was the highly regarded and much loved mentor of generations of mathematics students.\nIn addition we mention that he was Dean of the Faculty of Sciences\n(1966\n-\n1969)\n.\nThe authors of\n[\n1\n]\nwrite:-\nHe was an excellent mathematician and one of the best in the applications of mathematics. He devoted his life to university teaching and research. Professor Béla Gyires was an excellent lecturer, he had always a lot of students and many of them became teachers in secondary schools, university teachers and professors. His teaching and research had an impact not only on the University of Debrecen and Hungarian mathematics, but even on international scientific life. He published more than one hundred technical papers, one book, and numerous reports.\nIn\n[\n7\n]\nthe main areas to which Gyires made major research contributions are listed these are:-\nTheory of matrices; permanent of doubly stochastic matrices.\nProbability theory\n, in particular matrix theory of extrapolation and\n(\nblock\n)\nToeplitz\nmatrices, theory of stationary matrix-valued stochastic processes. Central limit theory for\nMarkov\nchains, characterization by polynomial statistics.\nMathematical statistics; doubly ordered linear rank statistics, linear rank statistics, approximations of two sample methods, decomposability of distribution functions.\nIn\n1993\n, when he was\n84\nyears of age, Gyires published the book\nLinear approximations in convex metric spaces and the application in the mixture theory of probability theory\n. Bartel W Huff writes in a review that:-\nThis book is really about abstract approximation theory.\nGyires received many honours. He was elected a corresponding member of the\nHungarian Academy of Sciences\nin\n1987\nand a full member in\n1990\n. He was awarded an honorary doctorate by the University of Debrecen in\n1996\nand was made a freeman of the city of Debrecen in the same year. In\n1999\n, on his\n90\nth\nbirthday, he was awarded the Middle Cross Award of the Hungarian Republic having earlier, in\n1980\n, been awarded the Hungarian National Prize. He also received the Pál Bugát medal\n(1985)\n, the\nIstván Hatvani\nPrize\n(1993)\n, and the\nJohn von Neumann\nPrize\n(1999)\n. He was honorary president of the\nJános Bolyai Mathematical Society\nand a honorary member of the\nJános Neumann\nSociety of Computer Science.\nGyires officially retired in\n1979\nbut continued to teach and only in\n1994\n, when he was\n85\nyears old, was he made professor emeritus. Even after this he continued to undertake research in mathematics and his last paper,\nContribution to Van der Waerden's conjecture\nappeared in\n2001\n. He moved from Debrecen to Budapest with his wife where he spent the last years of his life near his daughter Klara who was a professor of pharmacology in that city. His wife Magdolna died in\n2000\nwhich was a severe blow to him. He outlived his wife by one year and was buried in Farkasrét cemetery in Budapest.\nHe is remembered by having a street in Debrecen named after him. Also the University of Debrecen makes the Gyires Béla Award for outstanding academic performance in the field of probability theory and applied mathematics. It is awarded every two years to a Hungarian citizen under the age of forty and was awarded for the first time in\n2004\n. The award was set up on the initiative of the\nHungarian Academy of Sciences\nand Béla Gyires' two children, Klara Gyires and Tibor Gyires, in\n2003\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Statistics"
  ]
}