{
  "nome_completo": "Baha' ad-Din al-Amili",
  "nome_curto": "Baha' al-Din al-Amili",
  "ano_nascimento": "1547",
  "ano_morte": "1621",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Amili/",
  "lugar_nascimento": "Baalbek, now in Lebanon",
  "lugar_morte": "Isfahan, Iran",
  "biografia": "Baha' al-Din al-Amili\nis also known as\nSheykh Bahaee\nor\nSheikh Bahai\n. His father, Shaykh Husayn ibn 'Abd al-Samad al-Amili, was a Shi'ite theologian who played a major role in his son's religious education. They lived in a region which had come under the rule of the Ottomans in\n1517\n. The family, however, suffered persecution from the Ottomans and, in\n1554\n, they escaped to Herat\n(\nnow in Afghanistan\n)\nwhich was part of the Safavid Empire. Stewart writes that\n[\n6\n]\n:-\n... the Shiite scholar Husayn ibn 'Abd al-Samad al-Amili wrote an eloquent letter-cum-travel account describing his experiences to his teacher Zayn al-Din al-Amili who had remained in Jabal 'Amil. ...\n[\nIt\n]\ndescribes a journey that occurred earlier that same year. Husayn's statements do not spell out the exact cause of his flight from Ottoman territory but suggest that he was wary of being denounced to the authorities and felt that his academic career was severely limited there. He evidently supported Safavid legitimacy wholeheartedly, though he harboured misgivings about the moral environment in Iran and had sharp criticisms for Persian religious officials.\nAs well as living in Herat, al-Amili also spent much time in Isfahan, now in Iran. It was in Isfahan that he completed his education having excellent teachers of mathematics and medicine. In fact al-Amili's father held the position of Shaykh al-Islam, an honourific title given to the chief judge of the Muslim court of law, at Herat having been given this role by Shah Tahmasb\n(\nfor details see\n[\n9\n]\n)\n. At this time al-Amili was in Qazvin, the Safavid capital, both studying and teaching there. In\n1575\nhis father came from Herat to the court in Qazvin to request permission for himself and his son to make a pilgrimage to Mecca. He was allowed to go but his son Baha al-Din al-Amili was not given permission so remained in Qazvin when his father left Herat later in\n1575\n. His father died in\n1576\nbut al-Amili did not replace him as Shaykh al-Islam in Herat\n(\nas some historians have claimed\n)\n. Al-Amili's younger brother Abd al-Samad took over from his father while al-Amili became Shaykh al-Islam in Isfahan where he replaced his father-in-law Shaykh Ali al-Minshar who died in\n1576\n. Stewart writes\n[\n7\n]\n:-\nBaha al-Din al-Amili was an important religious authority in the Safavid Empire and held the high position of shaykh al-islam of the Safavid capital, Isfahan.\nIn fact at this time Isfahan was not the Safavid capital but only became that at a later time. In\n1587\nShah Abbas I, at the age of fifteen, became the ruler of the Safavid Empire and brought in many reforms which strengthened the Empire's position, particularly enabling them to fight the Ottomans. The capital of the Safavid Empire had been at Qazvin but Shah Abbas I moved the capital to Isfahan in\n1597\n. Al-Amili was still Shaykh al-Islam in Isfahan which then became the capital. When al-Amili was Shaykh al-Islam in Isfahan he travelled regularly with the royal court which was based in Qazvin.\nLet us return to the period when al-Amili was in Qazvin. He had not been given permission to make the pilgrimage to Mecca with his father in\n1575\nbut was given permission to make the pilgrimage in\n1583\n. He visited Mecca in that year, and returned in the following year making visits to Cairo, Jerusalem, and Damascus on the way\n[\n10\n]\n:-\n... he traveled in disguise ... While being detained by Ottoman customs officials on the way into Ottoman territory at Amid in\n1583\n, he recorded that fate had disappointed him and separated him from his loved ones ...\nBy February\n1585\nhe had reached Tabriz and was back in Isfahan later that year. In\n1587\nhe was still in Isfahan for he completed a work on weights and measures there in that year\n[\n10\n]\n:-\nThree years later, in\n1590\n, he negotiated with Yuli Beg, the provincial governor who had rebelled against Shah Abbas and barricaded himself in the local fortress, also in Isfahan. It thus appears that he spent most of the period\n1583\n-\n90\nin Isfahan, away from court.\nIn playing such an important role in ending what was a civil war, al-Amili was in high favour with Shah Abbas. Also having proved his negotiating skills, Shah Abbas made use of him again in\n1591\nwhen he ran into difficulties in arranging a marriage between his son and the daughter of Khan Ahmad Gilani who ruled Gilan. This was, of course, a political marriage, but Khan Ahmad Gilani said he could not agree to the marriage since he had sworn an oath not to agree to any marriage for his daughter while she was a minor. Shah Abbas asked Sayyid Husayn al-Karaki and al-Amili to help him with this problem and they were able to show that Khan Ahmad Gilani's oath was not valid under Shi'ite law so the marriage could go ahead. By\n1592\n, after the death of the Sayyid Husayn al-Karaki, al-Amili became the senior expert in the fields of law and religious education, so he became the Safavid Empire's senior jurist\n[\n10\n]\n:-\nThe death of Sayyid Husayn al-Karaki was a momentous event in Baha al-Din's career, the watershed which made him, at the age of forty-five, the leading jurist of the Empire.\nWe know that al-Amili moved frequently between the major cities of the Empire, for example in late\n1594\nhe was in Qazvin, in February\n1595\nhe was in Baghdad where he visited the shrine of the Kazimayn, but by June of that year he was back in Qazvin where he attended banquets Shah Abbas put on for scholars and students of religion as part of Ramadan. Around this time the poet al-Taluwi wrote\n(\nquoted in\n[\n10\n]\n)\n:-\n[\nBaha al-Din al-Amili\n]\nis now residing in Qazvin at the court of the King of Persia, Abbas. There, his word has the force of deed for the people, and he is held in the greatest esteem and respect by the elite and commoners alike, as travelers coming from that region have averred and as numerous reports to that effect have confirmed.\nAl-Amili was an expert on a wide range of subjects such as theology, philosophy, law, and mathematics. He was famed as a poet, a grammarian and an architect. We will say a little about his contributions to this wide range of topics but we will concentrate on his contributions to mathematics and astronomy. Perhaps his most famous mathematical work was\nQuintessence of Calculation\nwhich was a treatise in ten sections, strongly influenced by\nThe Key to Arithmetic\n(1427)\nby\nJamshid al-Kashi\n.\nRofagha writes\n[\n2\n]\n:-\nThe study concludes the following: First, 'Quintessence of Calculation' was a highly influential mathematics textbook in Central Asia between the\n17\nth\ncentury and the beginning of the\n20\nth\ncentury. Its influence was partly due to the soundness of its mathematical algorithms resulting from Sheikh Bahai's mastery of mathematics, especially the one enhanced by\nal-Kashi\n, a celebrated mathematician in the\n15\nth\ncentury. The study provides evidence that Sheikh Bahai studied\nal-Kashi\n's work. By utilizing these algorithms, Sheikh Bahai made the highly practical aspects of seven centuries of Islamic-culture mathematical achievements available to the region at large. Furthermore, the study concludes that the remarkable influence of 'Quintessence of Calculation' can be attributed to the specific approaches of Sheikh Bahai's presentations of mathematical concepts and algorithms. His approaches are identified as a result of detailed analytical comparison between this book and a major book of\nal-Kashi\n. The study also provides a partial answer to the creativity of Sheikh Bahai that enabled him to author several educational books, including 'Quintessence of Calculation', which were highly influential for several centuries. Subsequently, the study identifies Sheikh Bahai's method of discovery, which was also practised by\nAvicenna\n(\nibn Sina\n)\n, a distinguished mathematician and scientist in the\n11\nth\ncentury; this method is introduced and examined through a contemporary hypothesis presented by Elahi.\nOther works on astronomy included:\nThe Flat Surface\n, a work on the astrolabe;\nA Treatise on Astronomy\n; and, his most important astronomical work\nThe Anatomy of the Heavens\n, a treatise in five sections which summarised the works of earlier authors. Among al-Amili's works on grammar we mention:\nThe Secrets of Eloquence\n;\nAll Eternal Directives respecting the Science of Arabic Grammar\n; and\nThe Elevated Words\n, also an Arabic grammar. Among his religious works are:\nThe Forty Hadith Compilation\n, an annotated compilation of forty traditions ascribed to the prophet Muhammad;\nThe Orchards of Veracity in Commentary upon the Sahifa al-sajjadiyya\n;\nOn the Science of Hadith-Tradition\n;\nTreatise on the Pilgrimage\n;\nTreatise on Fasting\n;\nTreatise on the Law of Obligatory Prayer\n; and\nTreatise on the Law of Ritual Prostration\n. Some of these works, as is evident from their titles, also consider legal aspects of religion. His other legal works include:\nThe Dawning Place of the Two Suns and the Elixir of Twofold Felicity\n;\nIssues in Jurisprudence\n;\nThe Treatise on Establishment of the Doctrines of the Shi'a, the legalistic aspects and the doctrinal fundamentals\n;\nEssence of the Foundations of Jurisprudence\n; and\nTreatise on the Determination of the Qibla\n. He was also famed as a poet writing:\nOn the Secrets of the Mightiest Name of God\n;\nBread and Halva\n, which describes the experiences of an itinerant holy man and this could well be autobiographical describing his own Mecca pilgrimage;\nBread and Cheese\n;\nMouse and Cat\n;\nMilk and Sugar\n; and\nThe Parrot\n, containing\n2500\nverses.\nAl-Amili had several students, the most famous being Molla Sadra who became the pre-eminent philosopher of Shi'ite Islam.\nAn interesting discovery was made comparatively recently in Isfahan when the house in which al-Amili lived was identified. It has been restored and a conducted tour of the house is available on the web, see\n[\n4\n]\n.",
  "math_areas": [
    "Number Theory"
  ]
}