{
  "nome_completo": "Baudhayana",
  "nome_curto": "Baudhayana",
  "ano_nascimento": "800 BC",
  "ano_morte": "740 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baudhayana/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "To write a biography of\nBaudhayana\nis essentially impossible since nothing is known of him except that he was the author of one of the earliest Sulbasutras. We do not know his dates accurately enough to even guess at a life span for him, which is why we have given the same approximate birth year as death year.\nHe was neither a mathematician in the sense that we would understand it today, nor a scribe who simply copied manuscripts like\nAhmes\n. He would certainly have been a man of very considerable learning but probably not interested in mathematics for its own sake, merely interested in using it for religious purposes. Undoubtedly he wrote the Sulbasutra to provide rules for religious rites and it would appear an almost certainty that Baudhayana himself would be a Vedic priest.\nThe mathematics given in the Sulbasutras is there to enable the accurate construction of altars needed for sacrifices. It is clear from the writing that Baudhayana, as well as being a priest, must have been a skilled craftsman. He must have been himself skilled in the practical use of the mathematics he described as a craftsman who himself constructed sacrificial altars of the highest quality.\nThe Sulbasutras are discussed in detail in the article\nIndian Sulbasutras\n. Below we give one or two details of Baudhayana's Sulbasutra, which contained three chapters, which is the oldest which we possess and, it would be fair to say, one of the two most important.\nThe Sulbasutra of Baudhayana contains geometric solutions\n(\nbut not algebraic ones\n)\nof a linear equation in a single unknown. Quadratic equations of the forms\na\nx\n2\n=\nc\nax^{2} = c\na\nx\n2\n=\nc\nand\na\nx\n2\n+\nb\nx\n=\nc\nax^{2} + bx = c\na\nx\n2\n+\nb\nx\n=\nc\nappear.\nSeveral values of π occur in Baudhayana's Sulbasutra since when giving different constructions Baudhayana uses different approximations for constructing circular shapes. Constructions are given which are equivalent to taking π equal to\n676\n225\n\\large\\frac{676}{225}\\normalsize\n2\n2\n5\n6\n7\n6\n​\n(\nwhere\n676\n225\n\\large\\frac{676}{225}\\normalsize\n2\n2\n5\n6\n7\n6\n​\n=\n3\n.\n004)\n,\n900\n289\n\\large\\frac{900}{289}\\normalsize\n2\n8\n9\n9\n0\n0\n​\n(\nwhere\n900\n289\n\\large\\frac{900}{289}\\normalsize\n2\n8\n9\n9\n0\n0\n​\n=\n3\n.\n114)\nand to\n1156\n361\n\\large\\frac{1156}{361}\\normalsize\n3\n6\n1\n1\n1\n5\n6\n​\n(\nwhere\n1156\n361\n\\large\\frac{1156}{361}\\normalsize\n3\n6\n1\n1\n1\n5\n6\n​\n=\n3\n.\n202)\n. None of these is particularly accurate but, in the context of constructing altars they would not lead to noticeable errors.\nAn interesting, and quite accurate, approximate value for √\n2\nis given in Chapter\n1\nverse\n61\nof Baudhayana's Sulbasutra. The Sanskrit text gives in words what we would write in symbols as\n√\n2\n=\n1\n+\n1\n3\n+\n1\n(\n3\n×\n4\n)\n−\n1\n(\n3\n×\n4\n×\n34\n)\n=\n577\n408\n√2 = 1 + \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{(3\\times 4)}\\normalsize  - \\large\\frac{1}{(3\\times 4\\times 34)}\\normalsize  = \\large\\frac{577}{408}\\normalsize\n√\n2\n=\n1\n+\n3\n1\n​\n+\n(\n3\n×\n4\n)\n1\n​\n−\n(\n3\n×\n4\n×\n3\n4\n)\n1\n​\n=\n4\n0\n8\n5\n7\n7\n​\nwhich is, to nine places,\n1\n.\n414215686\n. This gives √\n2\ncorrect to five decimal places. This is surprising since, as we mentioned above, great mathematical accuracy did not seem necessary for the building work described. If the approximation was given as\n√\n2\n=\n1\n+\n1\n3\n+\n1\n(\n3\n×\n4\n)\n√2 = 1 + \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{(3\\times 4)}\\normalsize\n√\n2\n=\n1\n+\n3\n1\n​\n+\n(\n3\n×\n4\n)\n1\n​\nthen the error is of the order of\n0\n.\n002\nwhich is still more accurate than any of the values of π. Why then did Baudhayana feel that he had to go for a better approximation?\nSee the article\nIndian Sulbasutras\nfor more information.",
  "math_areas": []
}