{
  "nome_completo": "Beatrice Mabel Cave-Browne-Cave",
  "nome_curto": "Beatrice Mabel Cave-Browne-Cave",
  "ano_nascimento": "1874",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cave-Browne-Cave_Beatrice/",
  "lugar_nascimento": "Streatham Common, London, England",
  "lugar_morte": "Streatham Common, London, England",
  "biografia": "Beatrice Mabel Cave-Browne-Cave\nwas the daughter of Sir Thomas Cave-Browne-Cave\n(1835\n-\n1924)\nand Blanche Matilda Mary Anne Milton\n(1851\n-\n1928)\n. Thomas Cave-Browne-Cave was a civil servant who became Deputy Accountant-General of the Army from\n1897\nto\n1900\nand a Commissioner of the Royal Hospital Chelsea from\n1899\nto\n1923\n.Â He was appointed Companion, Order of the Bath in\n1907\nand was appointed Knight in\n1911\n. He married Blanche Matilda Mary Anne Milton in Immanuel Church, Streatham Common, on\n30\nApril\n1870\n. Blanche Milton was the daughter of Sir John Milton and Blanche Matilda Elinor Feild. Thomas and Blanche Cave-Browne-Cave had six children only five of whom reached adulthood: Blanche IsabelÂ Cave-Browne-CaveÂ\n(12\nJuly\n1871\n-\n10\nAugust\n1871)\n; Jeanette GertrudeÂ Cave-Browne-CaveÂ\n(16\nSeptember\n1872\n-\n9\nMarch\n1950)\n; Beatrice MabelÂ Cave-Browne-CaveÂ\n(30\nMay\n1874\n-\n9\nJuly\n1947)\n, the subject of this biography;\nFrances EvelynÂ Cave-Browne-Cave\nÂ\n(21\nFebruary\n1876\n-\n30\nMarch\n1965)\n; Thomas ReginaldÂ Cave-Browne-Cave\n(11\nJanuary\n1885\n-\n26\nNovember\n1969)\n; and Henry MeyrickÂ Cave-Browne-Cave\n(1\nFebruary\n1887\n-\n5\nAugust\n1965)\n.\nPerhaps we should explain how the family came to have, what must appear, a slightly unusual surname. It was not unusual when upper-class families intermarried to keep the surname of both sides of the family by adopting a hyphenated name containing both family names. The name Cave dates back to William the Conqueror who, in\n1069\n, conferred on two Yorkshire brothers the Lordships of North and South Cave. King Charles I had created the baronetcy in June\n1641\nfor Thomas Cave, who had supported the King in the English Civil War, and this hereditary honour, having the holder addressed as \"Sir\", had continued to be inherited. \"Cave\" had become \"Cave-Browne\" in\n1752\nand the additional \"Cave\" had been added in\n1839\n. Beatrice Cave-Browne-Cave tended to call herself Beatrice M Cave and she appears on her publications as \"B M Cave.\" We will refer to Beatrice Mabel Cave-Browne-Cave as \"Beatrice\" and her sister\nFrances EvelynÂ Cave-Browne-Cave\nas \"Evelyn\" throughout this biography to avoid confusion.\nBeatrice was brought up in quite privileged circumstances. At the time of the\n1881\ncensus she was six years old living at Burnage, North Side, Streatham Common with her parents, her maternal grandmother, her two sisters and three servants\n(\na domestic parlour maid, a nursemaid and a cook\n)\n. The three sisters were all educated at home and by the time of the\n1891\ncensus Beatrice was living with her parents, two sisters, two brothers, and four servants\n(\ncook, nurse, parlour maid, and housemaid\n)\n. She was fortunate to grow up in a family where at least two of her siblings, her sister\nEvelyn\nand brother Thomas Reginald, shared her enthusiasm for mathematics. In\n1895\nshe sat the entrance examination for Girton College, Cambridge and was admitted. Her sister\nEvelyn\nsat the Girton College entrance examinations at the same time and was also admitted. Neither of Beatrice's brothers studied at university but both became engineers, first in the navy and then the Royal Air Force on its formation in\n1918\n. We give a few more details of their careers below.\nAt Cambridge, Beatrice was in the same year as\nG H Hardy\nand\nJames Hopwood Jeans\n. One of her lecturers was\nWilliam Young\n. In\n1898\nBeatrice sat Part I of the Mathematical Tripos examinations and was awarded Class II. In the following year she graduated after taking Part II of the Mathematical Tripos examinations. She was awarded Class III which was\n[\n8\n]\n:-\n... with hindsight, a rather modest indication of her mathematical potential.\nFollowing the award of her degree, she was appointed as Mathematics Mistress at Streatham and Clapham High School in\n1899\n. This independent girl's school had been founded in\n1887\nto provide academic, moral and religious education for girls. The Headmistress when Beatrice was appointed was Reta Oldham\n(1861\n-\n1933)\nwho had taught a wide range of subjects at the school including History, Scripture, Literature, Algebra, French, Political and Physical Geography. Beatrice taught for eleven years at this school, teaching mathematics there until\n1913\n.\nIn addition to her teaching mathematics at Streatham and Clapham High School, Beatrice worked at home doing computing work in her spare time. Her sister Evelyn was a mathematics lecturer at Girton College and, in\n1903\nboth Beatrice and\nEvelyn\n[\n1\n]\n:-\n... were among six collaborators who worked on a large scale study of child development, overseen by\nPearson\n, that analysed data collected from over\n4000\nchildren, including some of Beatrice's high school students. Their part-time work for the biometrics Lab was uncompensated until a grant established in\n1904\nby the Worshipful Company of Drapers allowed\nPearson\nto provide his assistants with small stipends.\nWe learn a little more about this study in\n[\n6\n]\n:-\nThe project collected physical measurements and character assessments from\n4000\nchildren and their parents in order to establish evidence of the inheritance of what\nPearson\ncalled \"moral qualities,\" attributes that we would now identify as aspects of intelligence or personality. Both sisters Cave-Browne-Cave were among the six collaborators who worked on the project. ...\n[\nPearson's\n]\ncollaborators gathered the data by measuring and observing the children. Beatrice Cave-Browne-Cave collected data from her high school students. Only a few assistants, including Frances and Beatrice Cave-Browne-Cave, processed the data, creating tables, and computing correlations.\nIn\n1913\nBeatrice left her teaching position at Streatham and Clapham High School and took a position working with\nKarl Pearson\nat University College London. In\n1914\nthe paper\nNumerical Illustrations of the Variate Difference Correlation Method\nwas published in\nBiometrika\nwith the joint authors Beatrice M Cave and\nKarl Pearson\n. We give a short extract from the paper to try to illustrate its contents:-\nIn\n1904\nMiss\nF E Cave\nin a memoir on the correlation of barometric heights, published in the\nRoyal Society\nProceedings ..., endeavoured to get rid of seasonal change by correlating first differences of daily readings at two stations. A similar method was used by Mr R H Hooker in a paper published some time later in the Journal of the\nRoyal Statistical Society\n[\nin\n]\n1905\n. This method was generalised by \"Student\"\n[\nWilliam Gosset\n]\nin the last number of 'Biometrika' ... This method is still further developed by Dr Anderson of Petrograd, who in a valuable memoir published in this Journal has provided the probable errors of the successive difference correlations of a system of variables ... The new method appears to be one of very great importance, and like many new methods it has been developed in a cooperative manner, which is a good reason for not entitling it by the name of any single contributor. We prefer to term it the 'Variate Difference Correlation Method'. With the exception of a few illustrations given by \"Student,\" no numerical work on the correlation of the higher differences has yet been attempted. It is clear that much numerical work will have to be undertaken before we can feel complete confidence in our knowledge of the range and of the limitations of the new method ... The object of the present paper is to illustrate the theory of the variate difference correlation method in its present stage of development on a short series of economic data, in order to test what approximation there is in such short series to stability, and further how nearly Dr Anderson's values for the successive standard deviations apply to such cases ...\nNotice that the first paper mentioned in this introduction is by Beatrice's sister\nEvelyn Cave-Browne-Cave\n.\nA second paper involving Beatrice,\nOn the Distribution of the Correlation Coefficient in Small Samples. Appendix II to the Papers of \"Student\" and R A Fisher\n, was published in\nBiometrika\nin\n1917\nwith the joint authors H E Soper,\nA W Young\n, B M Cave,\nA Lee\nand\nK Pearson\n. Let us note that these authors are: Herbert Edward Soper\n(1865\n-\n1930)\n;\nAndrew White Young\n; Beatrice Mabel Cave-Browne Cave;\nAlice Lee\n; and\nKarl Pearson\n. We give a short extract from the paper to try to illustrate its contents:-\nIn a paper of\n1908\n\"Student\"\n[\nWilliam Gosset\n]\ndealt experimentally with the distribution of the correlation coefficient of small samples, and gave empirical curves - in particular for the case of zero correlation in the sampled population -which have proved remarkably exact. The problem was next considered in\n1913\nby H E Soper who obtained the mean correlation and the standard deviation of the distribution of correlations to second approximations. ... The next step was taken by\nR A Fisher\nwho gave in\n1915\nthe actual frequency distribution of\n[\nthe correlation r in samples of n from a population by a curve\n]\n. ... Clearly in order to determine the approach to Soper's approximations, and ultimately to the normal curve as n increases we require expressions for the moment coefficients of\n[\nFisher\n's curve\n]\n, and further for practical purposes we require to table the ordinates of\n[\nFisher\n's curve\n]\nin the region for which n is too small for Soper's formulae to provide adequate approximations. These are the aims of the present paper. It is only fair to state that the arithmetic involved has been of the most strenuous kind and has needed months of hard work on the part of the computers engaged. On the other hand the algebra has often been of a most interesting and suggestive character.\nBy the time this paper had appeared in print, Beatrice had left her position working with\nKarl Pearson\nat the\nGalton\nLaboratory of University College London. The outbreak of World War I in July\n1914\nput pressure on mathematicians to contribute to the war effort and this, in part, was a reason for her leaving the\nGalton\nLaboratory. The details of how and why she left are given in\n[\n6\n]\n:-\nBy the spring of\n1916\n, the computers of the Biometrics Laboratory, including Beatrice Cave-Browne-Cave, were accepting requests for trajectory calculations directly from the Ministry of Munitions. At first, they gave low priority to the ballistics work. \"These\n[\ntrajectories\n]\nyou told me to leave till the last as you might not have them done,\" Beatrice Cave-Browne- Cave wrote to\nPearson\n, \"shall I go on to this now?\"\nPearson\napproved this request, but he was still trying to devote as much time as possible to his statistical research. He asked the computers to clean and measure a collection of skulls that spring, a task that uncovered an infestation of insects. ...\nAs spring moved to summer, the Ministry of Munitions expanded its requests for ballistics calculations from Pearson and his staff. Though the computers faced an increasingly rigid production schedule,\nPearson\nattempted to sustain the same egalitarian air that he had shown during the days of experiments at Hampden Farm. When he received a packet of printed materials from the Ministry of Munitions, he found that he, rather than his staff, was being credited with producing the calculations. \"Please do not place my initials on the charts and tables,\" he replied to the ministry. \"It would have the appearance of arrogating to myself work due to a number of people of whom I am only one.\" He had come to refer to his combined laboratories as the\nGalton\nLaboratory, and he requested, \"If a mark of this kind is needful will you please place GL upon them, which will be quite as distinctive as KP and cover the whole staff of the\nGalton\nLaboratory.\"\nThough the war demanded self-sacrifice, it also offered new opportunities to the computers and encouraged them to look beyond the walls of University College, London. In August\n1916\n, Beatrice Cave-Browne-Cave announced that she would leave the laboratory to take a better paying position with the Ministry of Munitions.\nPearson\nhad not anticipated this news and was not pleased to be losing so experienced a computer. \"I may be quite wrong,\" he wrote Cave-Browne-Cave, \"but frankly I do not consider you have 'played the game.'\" In part, he was distressed because Cave-Browne-Cave was abandoning a recently signed contract with the college, but he also felt that the computers should be motivated by something beyond money or position. \"I should never attempt to hold an assistant, who wishes to leave,\" he explained, \"because it is evidence to me that their heart is not in their work and that they have not full loyalty to the ideas of our Founder,\n[\nFrancis Galton\n]\n.\" He ended their collaboration by stating that \"under the circumstances I should prefer, as it would save friction which is not compatible with the pressure of present work, if you did not return at all to the Laboratory.\"\nBeginning in\n1916\n, Beatrice worked on mathematical problems for the Air Board of the Air Ministry. She wrote the reports 'Loads on tail planes in high speed flight' and 'Loads on wing structure in flight' which she had completed by June\n1917\nbut they could not be published at the time as they were covered by the Official Secrets Act. 'Loads on tail planes in high speed flight' was C.I.M. No.\n728\nand consisted of\n3\npages with\n2\ndiagrams. One diagram\n[\n8\n]\n:-\n... is her force diagram and\n[\nthe second\n]\ndepicts her use of an alignment nomogram, a device employed when a single type of calculation had to be done repeatedly, and invented by the French engineer\nPhilbert Maurice d'Ocagne\nin\n1884\nin response to a demand by French engineers for a method to speed up the operations of cut-and-fill necessary to expand France's railway system.\nAlso in\n1917\nBeatrice constructed correlation tables based on a series of mice breeding experiments made by Raphael Weldon, who had worked at University College. Her correlation tables included tables showing the percentages of pigmentation in mice comparing mothers and sons, grandparents and offspring, and fathers and sons. For details, see the papers relating to mice breeding experiments in\n[\n2\n]\n.\nBeatrice was elected an associate fellow of the Royal Aeronautical Society in\n1919\nfor her researches on aircraft stability and performance, and propeller efficiency, and she was awarded an MBE in\n1920\n, \"for services in connection with the War.\"\nLeonard Bairstow\n(1880\n-\n1963)\nwas an aeronautical engineer who worked for the Air Board of the Air Ministry on the design of aircraft and on aerodynamics research during World War I. He gave the seventh Wilbur Wright Memorial lecture in\n1919\non the 'Progress of aviation in the war period'. During World War I, Bairstow had been assisted by Beatrice and Eleanor D Lang in his researches.  In\n1920\nBairstow was appointed Professor of Aerodynamics at the Imperial College, London and asked Beatrice and Eleanor Lang to become his assistants at Imperial College. He specifically asked them to assist him in research on objects moving in viscous fluids. L Bairstow, B M Cave and E D Lang wrote two papers,\nThe Two-dimensional Slow Motion of Viscous Fluids\n, submitted to the\nRoyal Society\non\n30\nJune\n1921\n, and\nThe Resistance of a Cylinder Moving a Viscous Fluid\n, submitted to the\nRoyal Society\non\n2\nDecember\n1922\n. The first of these has the introduction:-\nThe present paper is a contribution to the treatment of problems which require a solution of the differential equation\nâ\n4\nÏ\n=\n0\n\\nabla^{4} \\psi = 0\nâ\n4\nÏ\n=\n0\n. Amongst such problems are to be found not only the very slow motions of a viscous fluid in two dimensions, but also the flexure of thin flat plates. The prosecution of the investigation has been made possible by the support of the Department of Scientific and Industrial Research, which has provided financial assistance to enable two of us to devote the whole of our time to the research, and our thanks are offered to the Department for its assistance. We also desire to acknowledge the facilities afforded by the Governing Body of the Imperial College of Science and Technology in placing a room at our disposal in the Department of Aeronautics.\nThe second paper, a continuation of the first, has the following introduction:-\nAn earlier Paper by the same authors dealt with one aspect of the same problem and in its conclusions indicated the possibility of the present development. In order to deal with the equations of motion for a viscous fluid in two dimensions, the approximation for slow motion due to\nStokes\nwas used, with a consequent need for the introduction of a boundary limiting the expanse of the fluid. Whilst keeping the analysis as general as possible, the example given related to a circular cylinder centrally placed in a parallel-walled channel. The extension now to be described follows generally similar lines; the form of equation has been changed from that of\nStokes\nto one proposed by\nOseen\n, the change representing a closer approach to the full equations of motion by the introduction of terms dependent on the inertia of the fluid. A consideration of the differential equations by earlier writers has indicated a close agreement between the motions near a small sphere in the two cases, but a marked difference in the more remote parts of the fluid.\nOseen\nhas shown, for the sphere, that the resistance formulae for the two cases are identical to the first order of small quantities. In the case of the two-dimensional motion of a cylinder the differences are rather more striking. In the\nStokes\n' form of approximation it is not possible to satisfy all the essential conditions when the expanse of fluid is infinite, whilst with\nOseen\n's type of equation this particular difficulty disappears. Having seen\nOseen\n's solution for the motion of a sphere in a viscous fluid,\nLamb\napplied a similar method to the circular cylinder, and an account of his analysis is given in the 'Philosophical Magazine' and his treatise on 'Hydrodynamics'; a resistance formula is deduced which is applicable at low velocities. There are two approximations in this solution, one physical and implied in the original differential equation, and the second mathematical and introduced in the solution. There is a certain degree of interrelation between the two approximations, but it has been found that the second of them may be removed. An estimate of the degree to which\nOseen\n's approximation represents the complete equation of viscous fluid motion can be obtained by comparing the results of the new calculations with those of experiment. In the result it appears that the amount still to be accounted for by the remaining inertia terms is less than that already dealt with, in the case of both the resistance of circular cylinders and the skin friction of flat plates.\nIn\n1923\nLeonard Bairstow became Zaharoff Professor of Aviation and head of the Department of Aeronautics at the Imperial College, London. Beatrice continued to work at the Department of Aeronautics until she retired in\n1937\n. After retiring, she continued to live at the family home,\n36\nNorth Side, Streatham Common, where she died in July\n1947\n. She was buried in St Peter's Churchyard, Wellesbourne, Stratford-on-Avon District, Warwickshire. Her father, four of her siblings\n(\nEvelyn and her two brothers\n)\n, and many others named Cave-Browne-Cave are buried in St Peter's Churchyard.\nWe promised further details of Beatrice's brothers. Thomas Reginald Cave-Browne-Cave attended Dulwich College and became an Engineering Officer in the Royal Navy. He transferred in\n1913\nto Naval Wing of the Royal Navy Air Service and then to the R.A.F. on its formation. He devoted himself to the design, construction and operation of aircraft. He presented a paper at the British Association meeting on airships in\n1919\n. In\n1931\nhe was appointed Professor of Engineering at Southampton University. In\n1954\nhe won the Bicentenary Competition, 'Life in the year\n2000\n', of the Royal Society of Arts, with his essay 'A scheme for roof-top roadways'. He read his winning essay to the Society on\n24\nNovember\n1954\n. Despite working on projects not dissimilar to those that Beatrice worked on, there is no evidence that they cooperated on research.\nHenry Meyrick Cave-Browne-Cave initially followed a similar career to his brother, being trained at Dulwich College, and becoming an Engineering Officer in the Royal Navy. In World War I, he served in the Royal Navy Air Service and then joined the R.A.F. on its formation as a lieutenant colonel. He became Commanding Officer of the Far East Flight but a flying accident on January\n1939\ncaused him serious injuries and ended his active career.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Number Theory",
    "Statistics"
  ]
}