{
  "nome_completo": "Benjamin Franklin Finkel",
  "nome_curto": "Benjamin Franklin Finkel",
  "ano_nascimento": "1865",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Finkel/",
  "lugar_nascimento": "Amanda, Fairfield County, Ohio, USA",
  "lugar_morte": "Springfield, Missouri, USA",
  "biografia": "Benjamin Franklin Finkel\n's parents were John Philip Finkel\n(1820\n-\n1893)\nand Louisa Frederica Stickle\n(1829\n-\n1926)\n. John Philip Finkel had been born in Frederick, Maryland, into a family that had emigrated from England around the middle of the\n18\nth\ncentury. Louisa Frederica Stickle was born in Württemberg, Germany and had married a Mr Kibler. The Kiblers, with one son, emigrated to America in\n1853\nwhere they had four more children. After her first husband died, Louisa Kibler married John Philip Finkel. Benjamin was the second of his parents' five children, having an older sister Elizabeth Ann\n(1863\n-\n1950)\nand three younger siblings; Emanuel, John P\n(\nwho both died as infants\n)\nand Theresa\n(1871\n-\n1945)\n.\nIn\n[\n3\n]\nFinkel gives an insight into his schooling:-\nMy early knowledge of mathematics was very meagre and the outlook for future mathematical development very unpromising. Until I was seventeen years of age I had never seen a geometry or an algebra. I attended the Ridge country school in Fairfield County, Ohio, until I was eighteen, giving scant attention to the acquisition of knowledge of any kind. The older boys felt it incumbent upon them to make life as varied, active and uncomfortable for the teachers as possible. Disorder reigned supreme. When I was about twelve years old, R V Allen, a young man with grit and courage, was employed to teach the school and, after he had introduced himself by taking some of the older boys, who had bullied his predecessors, by the nape of the neck and shaking them as a dog shakes a rat, the atmosphere clarified, discipline followed, and order came out of chaos. Thus it was made possible for teachers following him, who had less muscle but more ability to impart knowledge, to devote themselves to the purpose for which they were employed, namely, the dispelling of the darkness of ignorance and the creation of the light of knowledge. ...\nWhen I was fifteen years old, it was my good fortune to come under the influence of a very superior country school teacher. This was George W Bates, and to him, next to my mother, I owe more than to any person who ever influenced my life. Though small in stature and crippled in limb, he was a man of unusual courage, unswerving honesty, unfailing firmness and accurate judgment. It was due to his fine discipline and leadership that more teachers, preachers, lawyers and judges came from that school during the two years he  taught there than in all  the years since. My interest in mathematics was aroused at this time ...\nWhen I was in my eighteenth year I left the country school to attend the Ohio Normal University at Ada, Ohio, now called the Ohio Northern University, a name suggested by me. After spending a year at that school I began teaching in the country schools.\nFinkel had not given up his university studies, rather he was having to undertake work as a high school teacher to bring in enough money to allow him to continue studying. He was awarded a B.Sc. from the Ohio Normal University in\n1888\nand a Master's Degree in\n1893\n. It is worth stating at this point the two things for which Finkel is most famous. One is his\nMathematical Solution Book\n, and the other achievement, by far the most significant, is his founding of\nThe American Mathematical Monthly\n. Let us look first at his own description of how he came to publish the\nMathematical Solution Book\n[\n3\n]\n:-\nWhile teaching in a country school in Union County, Ohio, in\n1887\nI began the writing of my 'Mathematical Solution Book', designed to aid in improving the teaching of elementary mathematics in the rural schools, high schools and academies, and got it ready for publication the following year. It was in connection with this enterprise that I met my first financial reverse. The printer who had undertaken the publication of the book failed after printing eighty-eight pages and borrowing two hundred dollars from me. It was not until\n1893\nthat I was able to bring out the first edition of one thousand copies.\nThe\nMathematical Solution Book\nhas a title which takes up a large part of the page, namely\nA mathematical solution book containing systematic solutions of many of the most difficult problems. Taken from the Leading Authors on Arithmetic and Algebra, Many Problems and Solutions from Geometry, Trigonometry and Calculus, Many Problems and Solutions from the Leading Mathematical Journals of the United States, and Many Original Problems and Solutions with Notes and Explanations\nby B F Finkel.\nWe have a version of the preface that Finkel wrote in\n1888\nfor the first edition of this work and also a version of the preface to the third edition of\n1899\nwhich contains interesting comments on the teaching of mathematics in the United States around\n1900\n.\n[\nIn particular, it contains a syllabus for mathematics at Harvard in session\n1899\n-\n1900\n.\n]\nThe Preface to Finkel's Solution Book is at\nTHIS LINK\n.\nThe book ran to a Fourth Edition which was reviewed by R F Davis\n[\n2\n]\n:-\nThe care with which this little book has been written and its freedom from typographical errors have proved so acceptable to the youth of America that three editions of twelve hundred copies have now been exhausted, - and yet they want more. The author is the well-known Professor of Mathematics and Physics at Drury College, and his aim is to provide systematic solutions of difficult questions in the earlier subjects. He is very averse from \"Short Cuts\" and \"Lightning Methods\"; and insists that solutions should be written out step by step in logical order and the chain of reasoning made complete in every link. ... On the whole the book is readable and instructive. The writer has keen enthusiasm for his science, \"the practical applications of which have in all ages redounded to the highest happiness of the human race, and by its achievements has bound all the nations of the earth in one common brotherhood of man.\"\nSince Finkel gives a fascinating account of his own teaching experiences in the lecture he delivered to the\nMathematical Association of America\nmeeting at Cleveland, Ohio, on New Year's Day\n1931\n, we continue to quote from its published version\n[\n3\n]\n:-\nDuring these years from\n1884\nto\n1893\nI was teaching in the rural schools of Ohio, in the Fostoria Academy, and in the Gibson Male and Female Academy, Gibson, Tennessee. At the same time, at my leisure, I was contributing problems and solutions to\n[\nvarious journals\n]\n. In\n1890\n-\n91\nI was superintendent of schools at North Lewisburg, Ohio, and in\n1891\n-\n92\nat West Middleburg, Ohio. I became thoroughly discouraged and disheartened because of the dishonourable political methods used in securing positions in most of the city schools in Ohio, and decided to quit the public school and join my good friend, Professor G W Shaw, Principal of Kidder Institute, Kidder, Missouri. It was while Professor Shaw was principal of Fostoria Academy that he invited me to become a member of his faculty there. The remuneration at Kidder Institute was not very lucrative, the routine work of teaching quite heavy-amounting often to forty-five three-quarter-hour periods per week. The management of the school, however, was free from every form of petty politics so deadening to intellectual honesty and spiritual development. In an atmosphere of that sort one may often ascend to the mountain heights of imagination and get glimpses of things unseen rather than have one's attention focussed on the sordid things of earth. ... In June\n1895\n, through the influence of Dr Henry Hopkins, pastor of the First Congregational Church of Kansas City, Missouri, a member of the Board of Trustees of Kidder Institute and Drury College, I was elected to the professorship of mathematics and physics at Drury College, Springfield, Missouri. ...\nIn fact, in\n1895\n, Finkel was offered scholarships by both the University of Chicago and by Yale University to study for a Ph.D. He accepted the scholarship from the University of Chicago but, being offered the professorship at Drury College, Springfield, Missouri, he resigned the scholarship. However, he did study at Chicago during the summer of\n1895\n[\n3\n]\n:-\nHaving been assigned a graduate scholarship in the University of Chicago in the summer of\n1895\n, I attended the second summer session, and it was then that I became personally acquainted with\nLeonard Eugene Dickson\n.\nDickson\nhad been appointed to a University Fellowship and was doing graduate work towards the degree of Doctor of Philosophy.\nThe above quote takes the account of Finkel's career beyond\n1894\nwhen the first part of\nThe American Mathematical Monthly\nwas published so let us recount briefly the events leading up to this important event. We begin by quoting Finkel's reasons for founding the\nMonthly\n[\n3\n]\n:-\nKnowing that the status of the mathematical teaching in our high schools and academies was very deplorable and even worse in the rural schools, I had the ambition to publish a journal devoted solely to mathematics and suitable to the needs of teachers of mathematics in these schools.\nThis was in\n1893\nwhen he was living in Kidder, Missouri and so Finkel approached Edward J Chubbuck, who published the local Kidder newspaper, about printing and distributing a journal. Chubbuck agreed, so Finkel then approached John Marvin Colaw who was a high school teacher at Monterey, Virginia, asking him if he would be interested in becoming a co-editor. Colaw, who had an A.B. and an A.M. from Dickinson College, was already known to Finkel as a contributor of mathematical problems to publications aimed at high school teachers. Colaw agreed to become an editor and they then set about getting contributions and subscribers. They approached both high school teachers and professors of mathematics at universities and colleges. They received an enthusiastic response from professors at universities and colleges but a very poor response from high school teachers who did not seem to think that a publication such as Finkel was proposing was needed. The first part of the\nMonthly\nappeared in January\n1894\n. The editorial begins as follows:-\nIt has seemed to the Editors that there is not only room but a real need for a mathematical Journal of the character and scope of this 'Monthly'. At the present time there is no Mathematical Journal published in the United States sufficiently elementary to appeal to any but a very limited constituency, and that comes to its readers at regular intervals. Most of our existing Journals deal almost exclusively with subjects beyond the reach of the average student or teacher of Mathematics or at least with subjects with which they are not familiar, and little, if any space, is devoted to the solution of problems. While not neglecting the higher fields of mathematical investigation, 'The American Mathematical Monthly' will also endeavour to reach the average mathematician by devoting regular departments to the important branches of Mathematical Science. It has seemed to the Editors that there is not only room but a real need for a mathematical Journal of the character and scope of this Monthly. At the present time there is no Mathematical Journal published in the United States sufficiently elementary to appeal to any but a very limited constituency, and that comes to its readers at regular intervals. Most of our existing Journals deal almost exclusively with subjects beyond the reach of the average student or teacher of Mathematics or at least with subjects with which they are not familiar, and little, if any space, is devoted to the solution of problems. While not neglecting the higher fields of mathematical investigation, 'The American Mathematical Monthly' will also endeavour to reach the average mathematician by devoting regular departments to the important branches of Mathematical Science.\nThe full editorial from this first part is at\nTHIS LINK\nAfter Finkel took up the professorship at Drury College, Springfield, Missouri, in\n1895\nhe spoke to a local printer, S A Dixon, and Dixon took over printing the\nMonthly\nfrom Edward Chubbuck.\nL E Dickson\njoined Finkel as an editor of the\nMonthly\nin October\n1902\n,\nH E Slaught\njoined him in January\n1907\n, and\nG A Miller\nin January\n1909\n. From August\n1906\nit was published under the auspices of the University of Chicago. In January\n1916\n, the\nMonthly\nbecame the official journal of the\nMathematical Association of America\n.\nWhile retaining his position at Drury College, Finkel was appointed as Harrison Fellow in mathematics at the University of Pennsylvania in\n1905\n. He had been awarded a Master's Degree from the University of Pennsylvania in\n1904\nand went on to undertake research for a doctorate. He was awarded a Ph.D. in\n1906\nfor his thesis\nDetermination of All Groups of order\n2\nm\n2^{m}\n2\nm\nwhich contain Cyclic Self-conjugate Subgroups of order\n2\nm\n−\n4\n2^{m-4}\n2\nm\n−\n4\nand whose Generating Operations correspond to the partitions,\n(\nm\n−\n4\n,\n4\n)\n,\n(\nm\n−\n4\n,\n3\n,\n1\n)\n(m - 4, 4), (m - 4, 3, 1)\n(\nm\n−\n4\n,\n4\n)\n,\n(\nm\n−\n4\n,\n3\n,\n1\n)\n. He retired from his professorship at Drury College in\n1937\nand, three years later, began publishing a series of articles entitled\nA History of American Mathematical Journals\nin the\nNational Mathematics Magazine\n. When America entered World War II, Finkel wanted to contribute to the war effort and, during\n1944\n, taught army classes in the University of Missouri.\nFinally, let us note that Finkel was honoured by Drury College in\n1923\nwhen they awarded him an honorary degree. Finkel contributed many problem and biographies to the\nMonthly\nand it is remarkable that, in\n2013\n, the third most accessed\nMonthly\narticle in the previous three years was one by Finkel - in fact his biography of\nRené Descartes\n.",
  "math_areas": [
    "Geometry"
  ]
}