{
  "nome_completo": "Benoit Mandelbrot",
  "nome_curto": "Benoit Mandelbrot",
  "ano_nascimento": "1924",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mandelbrot/",
  "lugar_nascimento": "Warsaw, Poland",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Benoit Mandelbrot\nwas largely responsible for the present interest in fractal geometry. He showed how fractals can occur in many different places in both mathematics and elsewhere in nature.\nMandelbrot was born in Poland in\n1924\ninto a family with a very academic tradition. His father, however, made his living buying and selling clothes while his mother was a doctor. As a young boy, Mandelbrot was introduced to mathematics by his two uncles.\nMandelbrot's family emigrated to France in\n1936\nand his uncle\nSzolem Mandelbrojt\n, who was Professor of Mathematics at the Collège de France and the successor of\nHadamard\nin this post, took responsibility for his education. In fact the influence of\nSzolem Mandelbrojt\nwas both positive and negative since he was a great admirer of\nHardy\nand\nHardy\n's philosophy of mathematics. This brought a reaction from Mandelbrot against pure mathematics, although as Mandelbrot himself says, he now understands how\nHardy\n's deep felt pacifism made him fear that applied mathematics, in the wrong hands, might be used for evil in time of war.\nMandelbrot attended the Lycée Rolin in Paris up to the start of World War II, when his family moved to Tulle in central France. This was a time of extraordinary difficulty for Mandelbrot who feared for his life on many occasions. In\n[\n3\n]\nthe effect of these years on his education was emphasised:-\nThe war, the constant threat of poverty and the need to survive kept him away from school and college and despite what he recognises as \"marvellous\" secondary school teachers he was largely self taught.\nMandelbrot now attributed much of his success to this unconventional education. It allowed him to think in ways that might be hard for someone who, through a conventional education, is strongly encouraged to think in standard ways. It also allowed him to develop a highly geometrical approach to mathematics, and his remarkable geometric intuition and vision began to give him unique insights into mathematical problems.\nAfter studying at Lyon, Mandelbrot entered the École Normale in Paris. It was one of the shortest lengths of time that anyone would study there, for he left after just one day. After a very successful performance in the entrance examinations of the École Polytechnique, Mandelbrot began his studies there in\n1944\n. There he studied under the direction of\nPaul Lévy\nwho was another to strongly influence Mandelbrot.\nAfter completing his studies at the École Polytechnique, Mandelbrot went to the United States where he visited the California Institute of Technology. After a Ph.D. granted by the University of Paris, he went to the Institute for Advanced Study in Princeton where he was sponsored by\nJohn von Neumann\n.\nMandelbrot returned to France in\n1955\nand worked at the Centre National de la Recherche Scientifique. He married Aliette Kagan during this period back in France and Geneva, but he did not stay there too long before returning to the United States. Clark gave the reasons for his unhappiness with the style of mathematics in France at this time\n[\n3\n]\n:-\nStill deeply concerned with the more exotic forms of\nstatistical mechanics\nand mathematical linguistics and full of non standard creative ideas he found the huge dominance of the French foundational school of\nBourbaki\nnot to his scientific tastes and in\n1958\nhe left for the United States permanently and began his long standing and most fruitful collaboration with IBM as an IBM Fellow at their world renowned laboratories in Yorktown Heights in New York State.\nIBM presented Mandelbrot with an environment which allowed him to explore a wide variety of different ideas. He has spoken of how this freedom at IBM to choose the directions that he wanted to take in his research presented him with an opportunity which no university post could have given him. After retiring from IBM, he found similar opportunities at Yale University, where he is presently Sterling Professor of Mathematical Sciences.\nIn\n1945\nMandelbrot's uncle had introduced him to\nJulia\n's important\n1918\npaper claiming that it was a masterpiece and a potential source of interesting problems, but Mandelbrot did not like it. Indeed he reacted rather badly against suggestions posed by his uncle since he felt that his whole attitude to mathematics was so different from that of his uncle. Instead Mandelbrot chose his own very different course which, however, brought him back to\nJulia\n's paper in the\n1970\ns after a path through many different sciences which some characterise as highly individualistic or nomadic. In fact the decision by Mandelbrot to make contributions to many different branches of science was a very deliberate one taken at a young age. It is remarkable how he was able to fulfil this ambition with such remarkable success in so many areas.\nWith the aid of computer graphics, Mandelbrot who then worked at IBM's Watson Research Center, was able to show how\nJulia\n's work is a source of some of the most beautiful fractals known today. To do this he had to develop not only new mathematical ideas, but also he had to develop some of the first computer programs to print graphics.\nThe Mandelbrot set is a connected set of points in the complex plane. Pick a point\nz\n0\nz_{0}\nz\n0\n​\nin the complex plane.\nCalculate:\nz\n1\n=\nz\n0\n2\n+\nz\n0\nz_{1} = z_{0}^{2} + z_{0}\nz\n1\n​\n=\nz\n0\n2\n​\n+\nz\n0\n​\nz\n2\n=\nz\n1\n2\n+\nz\n0\nz_{2} = z_{1}^{2} + z_{0}\nz\n2\n​\n=\nz\n1\n2\n​\n+\nz\n0\n​\nz\n3\n=\nz\n2\n2\n+\nz\n0\nz_{3} = z_{2}^{2} + z_{0}\nz\n3\n​\n=\nz\n2\n2\n​\n+\nz\n0\n​\n. . .\nIf the sequence\nz\n0\n,\nz\n1\n,\nz\n2\n,\nz\n3\n,\n.\n.\n.\nz_{0} , z_{1} , z_{2} , z_{3} , ...\nz\n0\n​\n,\nz\n1\n​\n,\nz\n2\n​\n,\nz\n3\n​\n,\n.\n.\n.\nremains within a distance of\n2\nof the origin forever, then the point\nz\n0\nz_{0}\nz\n0\n​\nis said to be in the Mandelbrot set. If the sequence diverges from the origin, then the point is not in the set.\nYou can see the Mandelbrot Set at\nTHIS LINK\n.\nHis work was first put elaborated in his book\nLes objets fractals, forn, hasard et dimension\nⓉ\n(\nFractals, shape, chance and dimension\n)\n(1975)\nand more fully in\nThe fractal geometry of nature\nin\n1982\n.\nYou can see more about these books at\nTHIS LINK\n.\nOn\n23\nJune\n1999\nMandelbrot received the Honorary Degree of Doctor of Science from the University of St Andrews. At the ceremony Peter Clark gave an address\n[\n3\n]\nin which he put Mandelbrot's achievements into perspective. We quote from that address:-\n... at the close of a century where the notion of human progress intellectual, political and moral is seen perhaps to be at best ambiguous and equivocal there is one area of human activity at least where the idea of, and achievement of, real progress is unambiguous and pellucidly clear. That is mathematics. In\n1900\nin a famous address to the International Congress of mathematicians in Paris David\nHilbert\nlisted some\n25\nopen problems of outstanding significance. Many of those problems have been definitively solved, or shown to be insoluble, culminating as we all know most recently in the mid-nineties with the discovery of the proof of\nFermat's Last Theorem\n. The first of\nHilbert\n's problems concerned a thicket of issues about the nature of the continuum or the real line, a major concern of\n19\nth\nand indeed of\n20\nth\ncentury analysis. The problem was both one of geometry concerning the nature of the line thought of as built up of points and of arithmetic thought of as the theory of the real numbers. The integration of those two fields was one of the great achievements of\nRichard Dedekind\nand\nGeorg Cantor\n, the latter of whom we\n[\nSt Andrews University\n]\nwere intelligent enough to honour in\n1911\n.\nNow lurking about so to speak in the undergrowth of that achievement lay certain very extraordinary geometric objects indeed. To all at the time, they seemed strange, indeed rather pathological monsters. Odd indeed they were, there were curves - one dimensional lines in effect - which filled two dimensional spaces, there were curves which were well behaved, that is nice and continuous but which had no slope at any point\n(\nnot just some points, ANY points\n)\nand they went by strange names, the\nPeano\nSpace filling curve, the\nSierpiński\ngasket, the\nKoch\ncurve, the\nCantor\nTernary set. Despite their pathological qualities, their extraordinary complexity, especially when viewed in greater and greater detail, they were often very simple to describe in the sense that the rules which generated them were absurdly simple to state. So odd were these objects that mathematicians set about barring these monsters and they were set aside as too strange to be of interest. That is until our honorary graduand created out of them an entirely new science, the theory of fractal geometry: it was his insight and vision which saw in those objects and the many new ones he discovered, some of which now bear his name, not mathematical curiosities, but signposts to a new mathematical universe, a new geometry with as much system and generality as that of\nEuclid\nand a new physical science.\nAs well as IBM Fellow at the Watson Research Center Mandelbrot was Professor of the Practice of Mathematics at Harvard University. He also held appointments as Professor of Engineering at Yale, of Professor of Mathematics at the École Polytechnique, of Professor of Economics at Harvard, and of Professor of Physiology at the Einstein College of Medicine. Mandelbrot's excursions into so many different branches of science was, as we mention above, no accident but a very deliberate decision on his part. It was, however, the fact that fractals were so widely found which in many cases provided the route into other areas\n[\n3\n]\n:-\nI should not ... give the impression that we have here before us a mathematician alone. Let me explain why. The first of his great insights was the discovery that the extraordinarily complex almost pathological structures, which had been long ignored, exhibited certain universal characteristics requiring a new theory of dimension to treat them adequately which he had generalised from earlier work of\nHausdorff\nand\nBesicovitch\nbut the second great insight was that the fractal property so discovered, the general theory of which he had provided, was present almost universally in Nature. What he saw was that the overwhelming smoothness paradigm with which mathematical physics had attempted to describe Nature was radically flawed and incomplete. Fractals and pre-fractals once noticed were everywhere. They occur in physics in the description of the extraordinarily complex behaviour of some simple physical systems like the forced pendulum and in the hugely complex behaviour of turbulence and phase transition. They occur as the foundations of what is now known as chaotic systems. They occur in economics with the behaviour of prices and as\nPoincaré\nhad suspected but never proved in the behaviour of the Bourse or our own Stock exchange in London. They occur in physiology in the growth of mammalian cells. Believe it or not ... they occur in gardens. Note closely and you will see a difference between the flower heads of broccoli and cauliflower, a difference which can be exactly characterised in fractal theory.\nMandelbrot has received numerous honours and prizes in recognition of his remarkable achievements. For example, in\n1985\nMandelbrot was awarded the\nBarnard Medal for Meritorious Service to Science\n. The following year he received the\nFranklin Medal\n. In\n1987\nhe was honoured with the\nAlexander von Humboldt Prize\n, receiving the\nSteinmetz Medal\nin\n1988\nand many more awards including the\nLégion d'Honneur\nin\n1989\n, the\nNevada Medal\nin\n1991\n, the\nWolf prize for physics\nin\n1993\nand the\n2003\nJapan Prize for Science and Technology\n.\nA full list of his prizes and honours is available\n(\nas a download\n)\nat\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}