{
  "nome_completo": "Bent Christiansen",
  "nome_curto": "Bent Christiansen",
  "ano_nascimento": "1921",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Christiansen/",
  "lugar_nascimento": "Aalborg, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Bent Christiansen\nentered the University of Copenhagen in\n1939\n. This, of course, was a very difficult period in Europe with the outbreak of World War II in\n1939\n. Denmark declared itself to be neutral but in April\n1940\nGerman troops marched into the country. Danish institutions continued to function relatively normally, however, as a result of the cooperative attitude of the Danish authorities. Denmark remained a sovereign state until August\n1943\ndespite the presence of German troops. At this time the Government refused to carry out the Nazis persecution policies and the Germans took full control of the country. However Christiansen was able to study mathematics, astronomy, physics, and chemistry at the University despite the difficult situation. Another mathematician in this archive, namely\nAsger Aaboe\nwho was one year behind Christiansen, was studying exactly the same topics at the University of Copenhagen. Christiansen received his Candidate's degree in mathematics in\n1944\n.\nAfter the award of his degree, he was appointed as a mathematics teacher at the\nGymnasium\nat Holte, which today is a suburb on the northern outskirts of Copenhagen but in the\n1940\ns was a separate town. Although continuing to teach at this Gymnasium, he also lectured to students training to become teachers at Emdrupborg College, the Copenhagen State College of Education, from\n1949\n. In\n1957\nhe left teaching in Holte and lecturing at the Teachers Training College, to take up a professorship of mathematics at the University of Liberia in Monrovia, the capital and chief Atlantic port of Liberia. Although it had been founded as an educational establishment in\n1861\n, it only achieved university status in\n1951\n, a few years before Christiansen taught there. The appointment was arranged through UNESCO\n(\nUnited Nations Educational, Scientific and Cultural Organization\n)\n, an organisation that played an important part in Christiansen's life with its major role to support educational and science programmes. He lectured in Monrovia from\n1958\nto\n1960\n[\n3\n]\n:-\n... and experienced the challenges from other cultural contexts.\nReturning to Denmark in\n1960\nhe was appointed as a professor of mathematics and mathematics education at the Royal Danish School of Educational Studies. He rapidly became highly influential in mathematical education, writing mathematics textbooks and articles in mathematics education. His first book\nElementaer kombinatorik og sandsynlighedsregning\nⓉ\n(\nElementary combinatorics and probability\n)\n(1964)\ndeveloped the theory of combinatorics and probability and was aimed at school teachers. His most famous book is\nGoals and means in basic mathematics education\n(1967)\n. He also served on the Danish National Sub-Commission of the ICMI from\n1961\nto\n1972\n.\nIn December\n1969\nhe addressed the First International Congress on Mathematical Education in Lyon as a plenary speaker. Here is part of the introduction to his address\n[\n1\n]\n:-\nIt is my belief that the very necessary changes in the millions of class-rooms with regard to the approach to mathematical education will not take place unless we explain ourselves at many levels of language. At one level we will have to convince the students at universities and training colleges of the necessity of using new means. At other levels of communication, we will have to motivate for debate the participants in the in-service training, the students in the schools and certainly also the parents and the authorities. While the research increases with regard to mathematical teaching, thereby providing sharper and stronger answers to important educational problems, it is thus in my opinion - for implementation purposes - still necessary to discuss in a general way the philosophy of mathematical education.\nEarly on in his address he stated clearly what his views were on mathematics\n[\n1\n]\n:-\nLet me begin my address by stating a view on mathematics in the following way: The foremost goal of mathematics on scientific level is the study of structures. The most important means for the attainment of this goal is the axiomatic method. If this is accepted - and I think general acceptance is at hand among mathematicians - what are then the consequences for school teaching? My own answer is, that even if the use of the deductive method has been dominant in all teaching of mathematics up to our days, and even if deduction is an indispensable part of any axiomatic development, then the relevant preparation of the use of the axiomatic method - on any level of school teaching - consists in an application of the inductive approach to a degree that goes far beyond what is at present customary.\nWe have mentioned Christiansen's involvement with UNESCO and the ICMI above. He continued to play major roles in both organisations. In\n1969\nhe initiated the UNESCO Mathematics Project for the Arab States. He was appointed UNESCO's programme specialist in\n1972\ncontinuing with his efforts to promote mathematics teaching in the developing countries. Perhaps his most influential role internationally was as Vice-President of the ICMI, a role he was appointed to in\n1975\nand held until\n1986\n. We have seen that he was a plenary speaker at the First International Congress on Mathematical Education in\n1969\nbut later he went on to become an organiser of Third such Congress in Karlsruhe in\n1976\n, the Fourth in Berkeley in\n1980\n, and in Fifth in Adelaide in\n1984\n. He also co-chaired the international working group on Systematic Cooperation between Theory and Practice in Mathematics Education set up in\n1980\nand initiated Basic Components of Mathematics Education to improve teacher education in\n1978\n.\nGeoffrey Howson gives the following indication of Christiansen's character\n[\n2\n]\n:-\nBent Christiansen was always kindly, gracious and a most agreeable companion. Yet his great integrity led him to be intolerant of injustice, of those who were rude, self-seeking, inefficient and not disposed to think, and of those who peddled simple solutions to complex problems. He himself was driven by two great aims: to remove social injustices and to give more students competence in, and an appreciation of, mathematics through improved teaching methods.\nWe end this brief biography by giving Mogens Niss's assessment of Christiansen's contribution\n[\n2\n]\n:-\nBent was a legend in mathematics education in Denmark and the Nordic countries. His impact on the development of the teaching and learning of mathematics in primary and lower secondary education and in teacher training can hardly be overestimated.\nChristiansen retired from his professorship at the Royal Danish School of Educational Studies in\n1991\n. Niss writes\n[\n2\n]\n:-\nBent continued to maintain a vivid and concerned interest in his beloved field, far beyond the age of retirement. The last time I saw him was at a meeting at the end of March of the Danish 'Forum for the Didactics of Mathematics', of which he was, most naturally, an\n(\nthe\n)\nhonorary member. I was giving a\n(\ncritical\n)\nlecture on constructivism and Bent attended, despite the frail and evidently very unpleasant condition his long lasting kidney disease had brought him into. Not only did he want to meet and talk to old friends, he was very eager to take part in the subsequent discussion with fresh, thought-provoking and, above all, deeply concerned comments that moved all of us who were present. Bent Christiansen died on the\n3\nrd\nSeptember\n1996\n. Mathematics education, his family, friends, and colleagues have lost a great humanist.",
  "math_areas": [
    "Analysis",
    "Combinatorics",
    "Statistics"
  ]
}