{
  "nome_completo": "Bento de Jesus Caraça",
  "nome_curto": "Bento Caraça",
  "ano_nascimento": "1901",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Caraca/",
  "lugar_nascimento": "Vila Viçosa, Portugal",
  "lugar_morte": "Lisbon, Portugal",
  "biografia": "Bento Caraça\nwas the son of Joao António Caraça and Domingas da Conceiçao Espadinha who were agricultural workers. The family lived on Rua dos Fidalgos in Vila Viçosa where the Casa de Bragança housed some of its servants and it was there that Bento was born. He had three siblings, António, Francisco and Filomena. His parents feared that their child might not survive so his mother took him to the priest to be baptised before they had chosen a name for him. The priest suggested \"Bento de Jesus\", meaning \"blessing from Jesus\" and that became his name. When he was two months old, the family moved to Herdade da Casa Branca, in the village of Montoito, where his parents were employed by the owner Raul Albuquerque to oversee the estate: his father was responsible for managing the agricultural part while his mother was in charge of the domestic part. Bento spent the first five years of his life at Herdade da Casa Branca.\nJosé Percheiro was a seasonal worker who knew how to read and write. He was given seasonal work on the Casa Branca estate and Bento quickly saw that Percheiro was different from the other workers. Percheiro taught Bento to read and write and was amazed at how quickly the child, by then about five years old, learnt to read the book he carried with him. Soon Percheiro moved on to work elsewhere but he left Bento the book\nCartilha Maternal ou Arte de Leitura\nⓉ\n(\nMaternal primer or the Art of reading\n)\nby Joao de Deus. Before he left, Percheiro spoke to Bento's mother, explaining to her what a clever child she had and saying that he should attend school. Joao dos Santos Caraça, the son of Francisco Caraça and so a nephew of Bento, was told about Bento's childhood by his parents and grandparents. He explained\n[\n19\n]\n:-\nLittle Bento de Jesus Caraça spent hours clinging to the book, constantly rereading it, to the point of memorising it.\nIt would have been almost impossible for Bento's parents to send him to school but Jerónima Albuquerque, the wife of the owner of the estate, was so impressed with the child's enthusiasm for learning that she offered to fund his studies. She took him to her house in Vila Viçosa to live there while attending the local primary school. Joao dos Santos Caraça explains how lucky Bento was in being able to attend primary school\n[\n19\n]\n:-\n... my father, Francisco José Caraça, who, being three years older than his brother Bento, never attended primary school, but learned to read and write while working as a help to guard the flock of sheep, or the herd of pigs, on the so-called Casa Branca homestead.\nBento completed his primary schooling at the Vila Viçosa primary school in\n1911\nand then enrolled in the Sá da Bandeira High School, in Santarém. The cost of his studies there continued to be covered by Jerónima Albuquerque. After two years at this school, he went to Lisbon in\n1913\nto continue his studies at the Liceu Normal Pedro Nunes. This school, founded in\n1906\n, had moved into new buildings on Avenida Álvares Cabral, in front of the Jardim da Estrela, in\n1911\n, two years before Caraça began studying there. He spent five years at this school, graduating with distinction in\n1918\nand then enrolled in the Instituto Superior do Comércio\n[\n7\n]\n:-\nIn\n1919\n, Bento Caraça contracted rheumatic disease, which caused irreversible heart damage, but the illness did not affect his academic success, and the renowned mathematician Mira Fernandes, who recognised his talent, invited him to become\n2\nnd assistant. So, at eighteen, Caraça began his dazzling university career. On\n1\nNovember\n1919\n, he was appointed\n2\nnd assistant in the\n1\nst group of chairs at the Instituto Superior do Comércio\n(\nHigher Mathematics - Higher Algebra, Principles of Infinitesimal Analysis, Analytical Geometry\n)\n.\nThroughout his student years, Caraça offered private tutoring to help fund his studies. In\n1922\n, while still an undergraduate, he taught a course on Commerce and Finance at the Universidade Popular Portuguesa. This institution had been founded in January\n1919\nwith the aim of contributing to the education of the people of Portugal, especially those of working class. Caraça was a member of its Administrative Council from the time it was founded. The authors of\n[\n38\n]\nwrite:-\nThe year\n1919\neffectively marks the beginning of Bento de Jesus Caraça's brilliant teaching career, not only as a Mathematics teacher, but also as a great disseminator of scientific modernities to the working masses. This engagement in social issues is explained by his active participation in the foundation of the Universidade Popular Portuguesa, an entity linked to the communist party that played an important role in Portuguese culture in the first half of the\n20\nth century and which Bento de Jesus came to be become president from\n1928\n.\nLet us note at this point that in\n1921\nthe Portuguese Communist Party was founded. Caraça would later join this party in his fight against Fascism. Caraça graduated with distinction from the Instituto Superior do Comércio in\n1923\nwith a licentiate in Economics and Financial Sciences. He was appointed as a temporary assistant at the Instituto Superior do Comércio on\n13\nDecember\n1924\n, and taught courses on Infinitesimal Analysis, and on the Calculus of Probabilities and its Applications. In the following year he taught courses on Higher Algebra, Principles of Infinitesimal Analysis, and Analytical Geometry.\nIn December\n1926\nCaraça married Maria Octávia Sena, daughter of mathematics teacher Adolfo Bernardino de Sena Marques e Cunha\n(1872\n-\n1927)\nwho taught at the Liceu Pedro Nunes in Lisbon. They had met when Caraça was a pupil at the Liceu Pedro Nunes and was taught by Adolfo Sena. Sadly the marriage lasted only nine months since Maria Octavia died on\n18\nSeptember of the following year.\nIn December\n1927\n, Caraça was promoted to extraordinary professor of Higher Mathematics and two years later, on\n28\nDecember\n1929\n, to full professor of Higher Mathematics at the Instituto Superior do Comércio. Between these two dates he had been elected as president of the Administrative Council of the Universidade Popular Portuguesa. He continued to hold his chair at the Instituto Superior do Comércio but also taught at the Universidade Popular Portuguesa, giving the introductory mathematics course of\n53\nlectures in\n1931\n. A A da Costa write in\n[\n22\n]\n:-\nHe was my mathematics teacher. It is well known that young students in general have a horror of mathematics, just like they do today. But Professor Bento de Jesus Caraça knew how to teach students to love mathematics, to understand its importance as an instrument for a quick understanding and intervention in life's problems. He taught mathematics starting with the things most attractive to students. Things that told them something. He was a great teacher.\nHe published several books and numerous articles on mathematics, including books based on his lecture courses\nInterpolation and Numerical Integration\n(1930\n-\n32)\n,\nLessons in Algebra and Analysis\n, in\n2\nvolumes\n(1935\n-\n1940)\n, and\nVector Calculus\nin\n2\nvolumes\n(1937)\n. Of particular interest is his multi-volume\nFundamentais da Matemática\nⓉ\n(\nFundamentals of mathematics\n)\nwhich was first published in\n1941\n, then all its volumes in\n1951\nand again by Guida Lami in as part of the collection of Caraça's writings\n[\n33\n]\n. Lami writes in\n[\n34\n]\n:-\nThe 'Fundamental Concepts of Mathematics' was published in this collection, expressing Caraça's belief that mathematics can be enjoyed by all, provided it is presented in a convenient way. He always explained science in such a way as to highlight it as a great chapter in human and social life. In particular, mathematics, having its own specificity, does not lack foundations that are embedded, like all science, in real life.\nThe great difference of this book in relation to all others that have been written for mathematical dissemination is that it has as its essential idea that life is the basis for the embedding of all things, and that therefore mathematics, like all human construction, depends on the set of social conditions where it is engendered and where it develops.\nWith the aim of achieving human contact between author and reader, Caraça adopted three strategies that intersect or overlap throughout the work:\nHe writes the book in the form of a dialogue between author and reader, in which the first questions the second, as if it were a conversation;\nHe speaks of mathematical concepts contextualising them in philosophical currents and in the historical events that contributed to their definition;\nHe presents the evolution of mathematical concepts in a logical and coherent way.\nThe political events in Europe played a very significant role in Caraça's life. He had seen the Fascists rise to power in Italy in\n1925\n, the\n28\nMay\n1926\ncoup d'état in Portugal which installed a military dictatorship, and the victory of the Nazis in the elections in Germany in\n1930\n. Caraça was personally involved in reactions to the\n1926\ncoup d'état, since there were academic strikes at the Instituto Superior de Comércio and at other educational institutions. In February\n1927\nthere was a military rebellion against the Military Dictatorship which began in Porto and spread to Lisbon. Around\n150\npeople were killed during this failed rebellion. As early as\n1929\n, Caraça announced his fight against the \"capitalist system\", writing and affirming in public\n[\n57\n]\n:-\nI believe that the proletarian class is destined, in a more or less near future, to take the direction of the destinies of the world into their own hands, completely transforming the entire existing social organisation.\nAntónio de Oliveira Salazar became finance minister some time after the\n1926\ncoup d'état and in\n1932\nbecame prime minister of Portugal. He exercised vast political powers, using censorship and the secret police against any opposition, particularly socialist and communist opposition. Caraça had shown his strong reaction to political events with his close association with the Universidade Popular Portuguesa from\n1919\n. The Universidade Popular de Setúbal had been founded in Setúbal in\n1924\nas part of the same movement that opened the Universidade Popular Portuguesa in Lisbon. On\n22\nMarch\n1931\n, Caraça delivered the lecture\nThe Popular Universities and Culture\nat the Universidade Popular de Setúbal. This was the first of a series of lectures he delivered setting out his socio-political theories. On\n25\nMay\n1933\nCaraça delivered the lecture\nA Cultura Integral do Indivíduo\nⓉ\n(\nThe integral culture of the individual\n)\nat the União Cultural Mocidade Livre. This was part of the organisation set up by Francesco Lyon de Castro to support his newspaper, the\nMocidade Livre\nⓉ\n(\nFree Youth\n)\n, which aimed to provide a democratic front of young workers and students. Let us quote a little from this lecture, now considered by many to be his most important, that established the clear outlines of his thought-\nWhat is the cultured man? He is the one that:\n1\nst - is aware of his position in the cosmos and, in particular, in the society to which he belongs;\n2\nnd - is aware of his personality and the dignity that is inherent to existence as a human being;\n3\nrd - makes the improvement of his inner being the utmost concern and the ultimate aim of life.\nBeing cultured does not imply being wise; there are sages who are not learned men and learned men who are not wise; but what being cultured implies is a certain degree of knowledge, precisely that which provides a minimum basis for satisfying the three conditions set out. The acquisition of culture means a constant elevation, served by a flowering of the best in man and by an ever-increasing development of all his potential qualities, considered from the fourfold physical, intellectual, moral and artistic point of view; it means, in a word, the achievement of freedom. And to reach that high peak, accessible to every man, as a man, and not just to a class or group, there is no sacrifice that is not worth making, there is no weariness that must be avoided. The purity that you breathe at the top compensates well for the fatigue of the slope. An indispensable condition for man to be able to tread the path of culture - that he be economically independent. Consequence - the economic problem is, of all social problems, the one that has to be solved first. Everything that is undertaken without the prior, radical and serious resolution of this problem, will not pass either a naive attempt, with vague philanthropic ink, destined to lose itself in impotence, or a handful of dust, thrown in the eyes of the unwary.\nCaraça was now becoming increasingly active politically, strongly influenced by the rise of Fascism in both Italy and Germany. In August\n1934\nhe was a founder of the 'League against War and against Fascism' and elected its first leader. He was the representative of the League in the Portuguese Popular Front in December\n1935\nbut in fact he had been the main driving force behind the establishment of the Portuguese Popular Front in August\n1934\n. The Popular Front argued for bread, peace, freedom and culture. It argued for popular democracy and a cooperative economy.\nCaraça was active in the formation of political organisations but he was also keen to support his own subject of mathematics so, along with other professors from the Faculty of Sciences of Lisbon and from the Higher Technical Institute, he was a founder of 'The Centre for Mathematics, Physics and Chemistry' in\n1936\n. From the start the Centre ran into difficulties since the University of Lisbon, the Higher Technical Institute and other institutions refused to give permission for their rooms to be used. This shows how afraid institutions were of the totalitarian regime that then dominated Portugal which opposed all cultural activity they did not control. The Centre did not escape a smear campaign in which it was accused of holding subversive political meetings under cover of scientific sessions. Despite its problems, the Centre's public activities began on\n16\nNovember\n1936\nwith a course in Vector Calculus, delivered by Caraça. It was this course that Caraça published as the book we mentioned above. Members of the Centre seem to have had certain disagreements during\n1937\nand\n1939\nwhich came to a head when a second course by Caraça was announced in November\n1939\n, requested by certain members without the knowledge of others. The Centre disbanded later that month.\nIn\n1938\nCaraça was one of three founders of the 'Centre for Studies in Mathematics Applied to Economics'. He was elected as director of this Centre, a position he held until\n1946\n. He gave the lecture \"Rabindranath Tagore\" at the Universidade Popular Portuguesa on\n22\nJanuary\n1939\n. In\n[\n52\n]\n, José Paz Rodrigues discusses this lecture and the affinity that Caraça felt for the Indian poet Rabindranath Tagore who had been awarded the Nobel Prize for Literature in\n1913\n. When Caraça quotes Tagore's statement:-\n... everything that exists vibrates with life, because it came out of life ...\nand his way of teaching at the school he founded:-\n... giving our boys as wide a horizon as possible, like universal human interests. This must come spontaneously, not simply through reading books, but through relationships with the whole wide world ...\nWe see clearly how Caraça found his views very similar to those of Tagore. Tagore was not the only one of Caraça's heroes that he delivered a lecture on, others included '\nGalileo Galilei\n, the scientific and moral value of his work'\n(\nin\n1933)\n, and '\nLeonardo da Vinci\n'\n(\nin\n1943)\n.\nContinuing his support of mathematics, he was one of the founders of the journal\nGazeta de Matemática\nin January\n1940\n. It was a publication of the\nPortuguese Mathematical Society\nand, in\n1942\nhe took charge of the \"Pedagogy\" section of the\nGazeta.\nAlso in\n1940\n, Caraça created and led the Pedagogical Commission of the\nPortuguese Mathematical Society\nand he was elected president of the Society for the session\n1943\n-\n44\n.\nIn\n1941\nhe created the Cosmos Library, for publishing scientific and cultural books, which went on to publish\n114\nvolumes. It was his firm belief that knowledge should not be the privilege of a few, but had to be made widely available to everyone, that motivated this venture. The first volume was the first part of his book\nFundamentais da Matemática\nⓉ\n(\nFundamental mathematics\n)\n. He continued to direct the Cosmos Library until his death.\nOn\n25\nAugust\n1943\nCaraça married Cândida Ribeiro Gaspar who had been one of his students. Daughter of Maria Palmira Ribeiro and Manuel Gaspar, she was born on\n4\nOctober\n1917\n, in Ramalhal, close to Torres Vedras, and died on\n5\nMarch\n2003\n, aged\n85\nyears. She, like her husband, was very active in fighting for democracy. They had one son, Joao Manuel Gaspar Caraça, who was born on\n22\nAugust\n1945\n. Joao Caraça obtained a degree in electrical engineering from the Instituto Superior Técnico in Lisbon, then a Ph.D. in nuclear physics from the University of Oxford for his thesis\nElectromagnetic properties of light proton-rich nuclei\n. He has had an outstanding career.\nIn years following his creation of the Cosmos Library, Bento Caraça increased his involvement in political and mathematical organisations. He became involved in the Democratic Unity Movement which was created in October\n1945\nand around the same time gave an interview for the newspaper\nRepública\nin which he claimed, among other things, that education was in a worse state in Portugal than it had been in\n1926\n. Publication of an open letter by Caraça in the\nRepública\nled to a reply in the newspaper by Salazar. Caraça continued to challenge the government. When Portugal applied to join the United Nations, Caraça was one of the signatories on a document produced by the Democratic Unity Movement calling for Portugal to be refused entry until democracy was restored in the country. Portugal was refused entry to the UN in September\n1946\nand disciplinary proceedings were instituted against Caraça by the Minister of Education for \"serious defamation of members of the Government\". He replied to the disciplinary proceedings describing it \"as violence practiced against me, against the letter and spirit of the Constitution.\"\nOn\n10\nOctober\n1946\nhe was expelled from his chair and was prohibited from teaching, even giving private tutoring. Three days later he was arrested and held for five days. After his release he gave the lecture \"Aspects of the Portuguese Cultural Problem\" in November and was promptly arrested again. After a short time he was released but continued to argue for his beliefs. In February\n1947\nhe signed a petition demanding the closure of the Tarrafal Concentration Camp. This camp on the island of Santiago in Cape Verde had been set up in\n1936\nto hold political opponents of Salazar's authoritarian government. In October\n1947\nhe wrote a manifesto \"The position of the Democratic Unity Movement at the present political moment\". He was arrested for a third time in January\n1948\nand was put under house arrest. Despite this, he remained politically active until his death in June of that year. He was buried in the Cemitério dos Prazeres.\nCaraça received honours many years after his death. On\n1\nJune\n1979\nhe was awarded the Grand Cross of the 'Ancient, Most Noble and Enlightened Military Order of Saint James of the Sword, of the Scientific, Literary and Artistic Merit'. In\n1980\nhe was awarded the Grand Officer Order of Liberty for \"services to the cause of democracy and freedom, in the defence of the values of civilisation and human dignity.\" This order was created in\n1976\nafter the fall of the Salazar regime. Another honour was the issue of a postage stamp for Caraça by Portugal in\n2001\n. See\nTHIS LINK\n.\nWe should note that there has been much interest in Caraça and his ideas in recent years. The long list of references show this interest, but we should note that the list is far from complete and there are many other articles that we have not referenced.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}