{
  "nome_completo": "Bernard le Bovier de Fontenelle",
  "nome_curto": "Bernard de Fontenelle",
  "ano_nascimento": "1657",
  "ano_morte": "1757",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fontenelle/",
  "lugar_nascimento": "Rouen, France",
  "lugar_morte": "Paris, France",
  "biografia": "Bernard de Fontenelle\n's mother was Marthe Corneille, the sister of the poets and dramatists Pierre and Thomas Corneille. Bernard's father was François le Bovier de Fontenelle who was a lawyer working in the provincial court at Rouen. The le Bovier family were by tradition lawyers who came originally from Alençon, about\n150\nkm south-west of Rouen and about\n170\nkm west of Paris. It had been a Roman Catholic family, but they all converted to Calvinism at the time of Nicolas Le Bovier, Bernard's great-grandfather. However his son Isaë le Bovier, Bernard's grandfather, converted the family back to Roman Catholicism. Douglas McKie writes\n[\n20\n]\n:-\nBoth on his father's and his mother's side he was descended from ancient families whose members had held the highest legal offices in the province of Normandy ...\nIn line with the family tradition, Bernard's parents wished their son to train as an advocate. He was educated in the Jesuit College in Rouen, which he entered in\n1664\n, and there became friends with\nPierre Varignon\nand the\nMarquis de l'Hôpital\n. He showed great versatility but his preferences were certainly directed towards the literary side of scholarship. When he was thirteen years old he composed a Latin poem but he put aside much that he loved in the way of learning in order to follow his family's wishes and train for the law. He began to study law in\n1672\nand spent the next five years training to be an advocate. However, after completing his training in\n1677\nhe took on his first case which he lost. This marked the end of his very short career as a lawyer for he promptly gave up the profession and turned towards his literary inclinations.\nFrom\n1677\nFontenelle began to live partly in Paris and partly in Rouen, only taking up permanent residence in Paris ten years later. The year\n1677\nwas certainly not the first time he had been to Paris, having first been taken there by his uncle Thomas Corneille in the previous year. Thomas Corneille was an editor of the\nLe Mercure galant\nand Fontenelle became an occasional contributor to this journal. Before his move to Paris\nLe Mercure galant\nencouraged him to do so. The following appeared in the journal in May\n1677\n:-\nM de Fontenelle, who, at the age of twenty, possesses more knowledge than one ordinarily has at forty...  He is from Rouen; he makes his home there, and several of our finest noblemen who have seen him here admit that it is tantamount to murder to leave him in the provinces ... He values his great knowledge only insofar as he can avail himself of it as a gentleman. He has a quick, elegant, and delicate wit.\nSteven F Rendall writes\n[\n22\n]\n:-\nWhen Fontenelle arrived in Paris, he soon made contact with the groups of scientists and free thinkers who gathered around men like Henri Justel, the physician Bourdelot, the chemist Lémery, and the geometer Sauveur. He spent many hours at the home of his friends the abbé de Saint-Pierre and\nVarignon\n, also from Rouen; he may have met\nMalebranche\nthere. ... Fontenelle became a well-known figure not only in such groups, but also in the fashionable salons held by Ninon de Lenclos, Mme de la Mésangère, the duchesse Du Maine, and Mme Tencin. It has often been suggested that Fontenelle served as an intermediary between the savants and the worldly salons, and that he regarded the latter as his essential audience.\nFontenelle's early attempts to break into the literary world were not too successful. He wrote poetry which he published in\nLe Mercure galant\nin\n1677\n. He entered his poetry for prizes offered by the Académie Française in\n1676\nbut without much success, although he did obtain an\naccessit\n. He wrote the operas\nPsyché\n(1678)\nand\nBellérophon\n(1679)\nand the tragedy\nAspar\n(1680)\n. This play proved a total failure when performed in\n1680\nand Fontenelle's next attempt at a play\nLa Comète\n, which he published anonymously in January\n1681\n, fared no better. It might be reasonable to ask at this point why a somewhat unsuccessful writer of poetry, plays, and operas, deserves to be in an archive consisting of those who have made contributions to the mathematical sciences. The answer is, that at this point in his career, Fontenelle changed direction and began to write works on the history of mathematics and the philosophy of mathematics and science. He evaluated the works of others extremely well and his writings contain a wonderful source of information about the scientists of his era.\nThe first work by Fontenelle which began to create a reputation for him was\nLettres galantes\n(1683)\nbut his first real major success was\nDialogues des Morts\n(1683)\n. In this work he presented new philosophical ideas to the reader in the form of conversations, modelled on the dialogues of Lucian, between philosophers such as Socrates and Montaigne, Seneca and Scarron. At least twelve editions of this book were published before\n1715\nand soon translations into English and other languages appeared; the work became much imitated by other authors. There quickly followed other successful works by Fontenelle including a biography of his uncle Pierre Corneille who died in\n1684\n. The biography was first printed in the\nNouvelles de la republique des lettres\nin January\n1685\n. Fontenelle's most famous work, however, was\nEntretiens sur la pluralité des mondes\n(1686)\n. He explains in the Preface whom he is writing for\n(\nour translation is based on that given in\n[\n3\n]\n)\n:-\nI wished to represent philosophy in a way that was not philosophical; I have attempted to compose a book that shall neither be too abstruse for the light-hearted, nor too recreational for the learned. ... possibly in attempting to find a middle way which would accommodate philosophy to every class, I have chosen one which will not please any. It is very difficult to maintain a medium, and I think I shall never be inclined to make a second attempt of this nature. I should warn those that have some knowledge of physics, that I do not suppose this book capable of giving them any information; it will merely afford them some amusement, by presenting in a lively manner what they have already become acquainted with by dint of study. I would also inform those who are ignorant of these subjects that it has been my desire to amuse and instruct them at the same time: the former will counteract my intention if they here expect improvement, and the latter, if they only seek for entertainment.\nThe book gives a popular exposition of\nDescartes\n' physics and\nGalileo\n's view of the sun, earth and planets. Despite Fontenelle's fears that his middle road might not appeal to anyone, quite the reverse was true and the book became arguably the first classic of popular science. Steven Rendall\n[\n22\n]\ntries to work out exactly who Fontenelle had in mind when he wrote this and similar works:-\nWhen we describe Fontenelle as a \"populariser\", then, we must remember that he did not address himself to the public at large, but only to a limited elite. ...\n[\nHowever\n]\nFontenelle's public was ... from the outset far more extensive and far more diverse than that of many other writers of the late seventeenth century.\nPartly, of course, the success of the work is due to Fontenelle's use of language. John van Eerde\n[\n24\n]\nwrites that the:-\n... language is anti-pedantic and pleasurable. Although this language often borders on that of love, it never quite becomes that.\nBefore leaving\nEntretiens sur la pluralité des mondes\nlet us note that, as mentioned above, it is heavily based on\nDescartes\n' physics. However, we should not deduce from this that Fontenelle was a Cartesian at heart. In fact in\nDoutes sur le système physique des causes occasionelle\nwhich he published in\n1886\n(\nthe same year as\nEntretiens\n)\n, Fontenelle attacks Cartesian causality\n[\n19\n]\n:-\n... the work is an attack on Cartesian metaphysics as it affected science and a plea for a general law of nature that would free science from dependence upon God as explanation.\nHis two essays published in\n1687\nunder the title\nHistoire des oracles\ncaused some theological controversy. Approaching the subject in a scientific way, he suggested that oracles did not produce supernatural effects but were usually the result of priestly fraud. He did, however, go some way to avoiding a conflict with the church by suggesting that, had God allowed it, the Devil could have operated oracles supernaturally. In\n1688\nhe published\nDigression sur les anciens et les modernes\nin which he argued that moderns were superior to ancients because of the greater maturity of the human mind. This put him into direct opposition to several influential men and was probably the main reason that he was rejected four times in his attempts to join the Académie Française. His next work\nDoutes sur le système physique des causes occasionnelles\nwas an attack on the ideas of\nNicolas Malebranche\n. Despite arguing against the views of important people, Fontenelle was elected to the Académie Française in\n1691\non his fifth attempt, and became permanent secretary of the\nAcadémie des Sciences\nfrom\n1697\n. In\n[\n18\n]\nLeonard Marsak explains why Fontenelle was chosen for this position:-\nIt is no accident that Bernard de Fontenelle, a humanist and littérateur, should have been chosen as secretary of the\nAcadémie des Sciences\nat its renewal in\n1699\n, not to act as a populariser of science as many have believed, but to serve as its critic and to write its defence.\nFontenelle presented many obituary notices to the\nAcadémie\n, those of\nNewton\nand\nLeibniz\nbeing particularly notable.\nIn\n1699\nFontenelle wrote\nOf the Usefulness of Mathematical Learning\n. In it he wrote:-\nTo what purpose should People become fond of the Mathematicks and Natural Philosophy? ... People very readily call Useless what they do not understand. It is a sort of Revenge ... .\nOne would think at first that if the Mathematicks were to be confin'd to what is useful in them, they ought only to be improv'd in those things which have an immediate and sensible Affinity with Arts, and the rest ought to be neglected as a Vain Theory. But this would be a very wrong Notion. As for Instance, the Art of Navigation hath a necessary Connection with Astronomy, and Astronomy can never be too much improv'd for the Benefit of Navigation. Astronomy cannot be without Optics by reason of Perspective Glasses: and both, as all parts of the Mathematicks are grounded upon Geometry ... .\nIn his role as permanent secretary of the\nAcadémie des Sciences\n, Fontenelle wrote\nHistoire du renouvellement de l'Académie des Sciences\nwhich appeared in three volumes in\n1708\n,\n1717\nand\n1722\n. These contain Fontenelle's sharp discussions of the proceedings of the Academy as well as the sixty-nine Éloges\n(\nobituaries\n)\nof members which he wrote. Also, however, the Academy published its\nMémoires\neach year beginning in\n1699\nand, in addition to scientific papers, this also contained the obituaries written by Fontenelle. Douglas McKie writes\n[\n21\n]\n:-\n... it is for the Éloges that he is more usually remembered today. Simple, exact, unaffected, and as varied in their scientific content as the sixty-nine astronomers, chemists, physicists, anatomists and others whom they commemorated, the Éloges exemplify a new literary form, moulded and created by Fontenelle, peculiarly French and still neither easily nor very successfully imitated in other languages ...\nIt is in the Éloges that Fontenelle was able to argue his view of science as Leonard Marsak explains\n[\n18\n]\n:-\nThe real meaning of science for Fontenelle, therefore, lay not in material improvement, nor even in the scientist's growing knowledge of the process of nature, although these achievements gave added value to his activity, but in the gradual emancipation of the mind from ignorance and error that a newly formed methodology made possible. Those susceptible to the latter process, Fontenelle sensed, were creating a new way of life for themselves that was indeed revolutionary in its implications. Nowhere is the meaning of science made more clear, and its value so appreciated, as in that series of \"lives of the scientists\" that we know as the \"Éloges.\"\nNot everyone lavished on Fontenelle unqualified praise for his Éloges. Antoine-Louis Séguier, who succeed Fontenelle in the Académie Française, wrote\n(\nsee for example\n[\n17\n]\n)\n:-\nBut what eulogy should we tender to Fontenelle for those so estimable éloges in which he not only succeeded in overcoming the human prejudice against funeral orations but made an art out of praising a particular person and a new kind of talent? I seem to hear them all at this moment, all those famous dead urging me to honour their debt. Endowed with different merits and unequal reputations, almost all of them were elevated to the same degree of celebrity by the eloquence and insight of the eulogist, an orator who knew somewhat better how to praise them than to emulate or judge them.\nOf course his role with the\nAcadémie des Sciences\ndid not prevent Fontenelle continuing to produce other important works. For example in\nDe l'origine des fables\n(1724)\nhe compared Greek and American Indian myths and suggested that there was a universal human predisposition toward mythology. He saw myths as absurd, but argued that the stories had grown in earlier, more primitive human societies.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}