{
  "nome_completo": "Bernard Lamy",
  "nome_curto": "Bernard Lamy",
  "ano_nascimento": "1640",
  "ano_morte": "1715",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lamy/",
  "lugar_nascimento": "Le Mans, France",
  "lugar_morte": "Rouen, France",
  "biografia": "Bernard Lamy\n's parents were Alain Lamy and Marie Masnier. The family were quite well off being minor members of the French nobility. Bernard was baptised in Le Mans on\n29\nJune\n1640\n. His early education was at home, taught by a tutor employed by his parents. By the time he was twelve years old he was already an expert in Latin and he parents then sent him to study at the Oratorian college in his home town of Le Mans. There he was particularly influenced by the humanistic teacher Jules Mascaron, and he completed his 'Rhétorique' at the college, showing marked talents in a whole variety of different subjects. At the age of eighteen he went to Paris and entered the Maison d'Institution as a novice of the Jesuit Order on\n6\nOctober\n1658\n. The Director, Jean Bertad, led Lamy and the other novices in the reading and study of Scripture. After a year he went to the Collège Royal des Catholiques in Saumur where he studied philosophy. Among his teachers were Claude Bouillerot, Nicolas Charpy, Jean Goujon and Charles de La Fontenelle. He was admitted to the Congregation of the Oratory in\n1662\n.\nNicolas Malebranche\nwas also a member of the Congregation of the Oratory and they met in Saumur as students and remained friends for the rest of their lives.\nIn\n1661\nLamy was appointed professor of classics at the Jesuit Collège de César in Vendome. He held this post for two years before being appointed to a similar post at the Jesuit College of Juilly. While teaching literature, grammar, Latin, Greek, history and geography at Juilly, Lamy was ordained to the priesthood in\n1667\n. During his time at Juilly, Lamy read all of\nDescartes\n' major works. Then he taught at Le Mans from\n1668\nto August\n1669\n. Following this he studied theology at the École de Théologie de Notre-Dame des Ardillires at Saumur and was then named professor of philosophy at the Collège Royal des Catholiques in Saumur on\n9\nSeptember\n1671\n. He moved to a similar post at the College of Angers, part of the University of Angers, two years later. Kennedy writes\n[\n6\n]\n:-\nThe most original rhetorical treatise to appear in France in the seventeenth century was 'De l'Art de parler,' or 'On the Art of Speaking,' published anonymously by Bernard Lamy in\n1675\n. Anonymity was probably sought to protect Lamy and the religious order to which he belonged from charges of the influence of\nDescartes\n, whose religious views had come under scrutiny by the Church. In\n1676\nan English version of Lamy's book, with some departures from the French text, was published in London. The translators, who have not been identified with certainty, attributed the original to \"Messieures du Port Royal.\" Lamy was not a member of the Port Royal group, but he had benefited from some of their thinking about language and logic, and readers easily accepted the new rhetoric as the counterpart of the well-known Port-Royal Logic and grammars, thus greatly increasing its sale. The English edition was repeatedly reprinted in the eighteenth century but without inclusion of revisions that Lamy later made in the French text.\nPublishing this work anonymously did not save Lamy from trouble, however, since through his teaching at Angers he was known to be someone with a great respect for\nDescartes\n' philosophy. In Angers\n[\n4\n]\n:-\n... his teaching was attacked on the ground that it was too exclusively Cartesian, and Rebous the rector obtained in\n1675\nfrom the state authorities a decree forbidding him to continue his lectures.\nIn\n[\n1\n]\nBeaude gives further reasons for the attacks on Lamy in addition to his high regard for\nDescartes\n' views, writing that Lamy was:-\n[\na\n]\nttacked and denounced for Augustinianism, Cartesianism and antimonarchical opinions.\nFollowing the issue of the decree, Lamy was exiled by order of the King early in\n1676\nand he went to live alone in Saint-Martin de Miséré in Dauphiné. In\n1677\n, Guillaume Quesnel, who was the brother of Pasquier Quesnel, became the Superior of the Seminary at Grenoble. Pasquier Quesnel was a friend of Lamy, and it is thought that he approached his brother to try to ensure that Lamy was able to return to teaching. Certainly, Lamy's exile ended, thanks to the decision of Cardinal Le Camus, and he was able to teach again in the seminary in Grenoble.\nWe mentioned above Lamy's anonymous publication of\nDe l'Art de parler\nⓉ\n(\nOn the art of speaking\n)\nin\n1675\n. Kennedy\n[\n6\n]\ndescribes the work and also give a delightful quotation:-\nAlthough Lamy admired and quoted Cicero, Quintilian, and Augustine, his handbook is not a traditional work.\nAristotle\nis dismissed with little notice. The influence of Ramism is slight, that of Cartesian method strong, and there are many points of contact with the Port-Royal Logic. Lamy reorganised the structure of rhetoric to begin with an account of language: the organs of voice and speech; the parts of speech; the need to use words in their proper sense. But language, he recognised, is not rich enough to supply terms for all ideas; thus in the second part he proceeds to consideration of tropes and then to figures as expressive of the emotions. The third part of the work discusses sounds, pronunciation, and delivery. The fourth part examines style in a larger sense: imagination, memory, and judgment as the basis of good style; the three levels of style; the lofty, the simple, and the middle; and the differences between styles of an orator or preacher, a historian, and a poet. Only in the final section of the work does he come to any means of persuasion, the invention of proofs, dialectical topics, and the arrangement of a speech into parts. Although speech is the subject of the work, Lamy has much to say about poetry, including versification. In one passage Lamy briefly states what might be called the dogma of neoclassical aesthetics. In the English version the text reads: \"A discourse is beautiful when it is composed according to the Rules of Art; it is great when it is more than ordinary perspicuous; when there is not one equivocation; no sentence unintelligible; no expression ambiguous; when it is well-disposed, and the mind of the Reader led directly to the end of the design, without the remora or impediment of impertinent words. Such clearness like a Torch dispels all obscurity and makes every thing visible.\"\nLamy's next major publication was\nNouvelles réflexions sur l'art poétique\nⓉ\n(\nNew thoughts on the poetic art\n)\n(1678)\nfollowed by\nTraité de Mécanique, de l'équilibre des solides et des liqueurs\nⓉ\n(\nTreatise on mechanics, of the equilibrium of solids and liquids\n)\nin\n1679\nin which the parallelogram of forces law is given.\nPierre Varignon\ndiscovered the parallelogram of forces law independently, at about the same time, and he saw more consequences of it than did Lamy; see\n[\n3\n]\nfor more details. Lamy also published\nTraité de la grandeur en general, qui comprend l'arithmétique, l'algèbre, l'analyse\nⓉ\n(\nTreatise on magnitude in general, which includes arithmetic, algebra, analysis\n)\n(1680)\nand\nEntretiens sur les sciences\nⓉ\n(\nScience talks\n)\n(1783)\nin which\n[\n1\n]\n:-\n... he proposes an art of learning and teaching all the secular and religious disciplines. This book, admired by Rousseau, is simultaneously an educational treatise, a discourse on method, and a guide to reading.\nLamy then published\nLes éléments de géometrie, ou de la mesure du corps, tout ce qui comprennent qu' Euclide a enseigné\nⓉ\n(\nThe Elements of Geometry, or of the Measurement of the Body, all that Euclid taught\n)\n(1685)\n.\nIn\n1686\nLamy obtained permission to live in Paris, spending a while at the seminary of Saint Magloire, but trouble over a theological work had him sent away from Paris in\n1689\n. Around this time he published\nApparatus ad Biblia Sacra, in quo Hebraeorum de gente, Legibus\nⓉ\n(\nStructure of the Holy Bible, in which the Hebrews describe their nation, Laws\n)\n(1687)\nwhich was translated into both French and English. The English translation was published in\n1723\nas\nIntroduction to the Holy Scripture in three books\n. Next came\nDemonstration de la vérité et de la sainteté de la morale chrétienne\nⓉ\n(\nDemonstration of the truth and sanctity of Christian morality\n)\n(1688)\n, and\nHarmonia sive Concordia quatuor evangelistarum, in qua vera series actuum et sermonum Domini nostri\nⓉ\n(\nThe harmony or concord of the quartet of the evangelists, in which are the true descritions of the acts and words of our Lord\n)\n(1689)\n. In this work, a harmony of the Four Gospels, Lamy made claims which went against the beliefs of the Church. For example, he claimed that John the Baptist was put twice in prison, first by Sanhedrin in Jerusalem then later by Herod in Galilee. He claimed that Christ's crucifixion took place on the Passover, and that three Mary's, namely Mary Magdalen, Mary the sister of Lazarus, and the sinner referred to by Luke are the same person. These views landed Lamy in severe controversy with many within the Church.\nHe lived in Rouen from\n1690\n, remaining there for the rest of his life. He published many books while in Rouen, mostly religious works, including such as\nTraité historique de l'ancienne Paque des Juifs\nⓉ\n(\nHistoric treatise on the ancient Passover of the Jews\n)\n(1693)\n,\nCommentarius in concordiam evangelicam\nⓉ\n(\nCommentary on evangelical harmony\n)\n(1699)\n,\nDissertation sur Sainte Madeleine\nⓉ\n(\nDissertation on Mary Magdalen\n)\n(1699)\n, and\nDéfense de l'ancien sentiment de l 'glise latine touchant l'Office de Sainte Magdelaine\nⓉ\n(\nDefence of the old sentiment of the Latin Church concerning the Office of Mary Magdalen\n)\n(1699)\n.\nIn\n1701\nhe published\nTraité de perspective où sont contenus les fondements de la peinture\nwhich was translated into English as\nPerspective made easy or the kind of representing all manner of objects\n(1710)\n. The authors of\n[\n5\n]\nwrite:-\nIn previous publications\n[\nLamy\n]\nhad addressed the fields of rhetoric, mechanics, mathematics and geometry, and his discussion of perspective gains force and depth from his interest in the study of optics. Lamy conceives of optics as dependent on the practices alike of the scientist, the mathematician and the painter. His readiness to accord equal significance to the skills of each is one of the distinguishing features of his work. It might seem that his belief that mathematics is the 'foundation of painting' was not one to which all contemporary styles of painting could have been made to conform. Lamy's sophisticated argument, however, is that any representation will fail if its effect is not in some way equivalent to the experience of its object.\nThis intriguing description of Lamy's work prompts us to quote a little from the work\n(\nat least from the English translation of\n1710\n, which we've put into modern English\n)\n:-\nTo represent upon cloth what is not there as cavities and eminences, where all is flat; and distances when every thing is near; is a performance that merits admiration. It is an effect and, at the same time, a proof of what the eye\n(\nto speak philosophically\n)\ndoes not see ... Nothing is more difficult to be expressed than the nature of these images ...\nA picture may be considered as an open window or transparent glass, through which the eye that is supposed to be at a certain point, may see the objects represented by the picture. Now by the help of the mathematics, the passage of the rays which render the object visible may be traced in the picture or transparent glass. This passage being marked with suitable colours and, in a word, all their appearances. ... Mathematicians draw only lines, they cannot finish a picture. And on the other hand, painters cannot begin it without a regard to the rules taught by the mathematicians. Every picture is a perspective, so that what is taught in this part of the mathematics is the foundation of painting ...",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}