{
  "nome_completo": "Bertrand Arthur William Russell",
  "nome_curto": "Bertrand Russell",
  "ano_nascimento": "1872",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Russell/",
  "lugar_nascimento": "Ravenscroft, Trelleck, Monmouthshire, Wales",
  "lugar_morte": "Penrhyndeudraeth, Merioneth, Wales",
  "biografia": "Bertrand Russell\npublished a large number of books on logic, the theory of knowledge, and many other topics. He is one of the most important logicians of the\n20\nth\nCentury.\nRussell's Mathematical Contributions\nOver a long and varied career, Bertrand Russell made ground-breaking contributions to the foundations of mathematics and to the development of contemporary formal logic, as well as to analytic philosophy. His contributions relating to mathematics include his discovery of Russell's paradox, his defence of logicism\n(\nthe view that mathematics is, in some significant sense, reducible to formal logic\n)\n, his introduction of the theory of types, and his refining and popularizing of the first-order predicate calculus. Along with\nKurt Gödel,\nhe is usually credited with being one of the two most important logicians of the twentieth century.\nRussell discovered the paradox which bears his name in May\n1901\n, while working on his\nPrinciples of Mathematics\n(1903)\n. The paradox arose in connection with the set of all sets which are not members of themselves. Such a set, if it exists, will be a member of itself if and only if it is not a member of itself. The significance of the paradox follows since, in classical logic, all sentences are entailed by a contradiction. In the eyes of many mathematicians\n(\nincluding\nDavid Hilbert\nand\nLuitzen Brouwer\n)\nit therefore appeared that no proof could be trusted once it was discovered that the logic apparently underlying all of mathematics was contradictory. A large amount of work throughout the early part of this century in logic, set theory, and the philosophy and foundations of mathematics was thus prompted.\nRussell's paradox arises as a result of naive set theory's so-called unrestricted comprehension\n(\nor abstraction\n)\naxiom. Originally introduced by\nGeorg Cantor\n, the axiom states that any predicate expression,\nP\n(\nx\n)\nP(x)\nP\n(\nx\n)\n, which contains\nx\nx\nx\nas a free variable, will determine a set whose members are exactly those objects which satisfy\nP\n(\nx\n)\nP(x)\nP\n(\nx\n)\n. The axiom gives form to the intuition that any coherent condition may be used to determine a set\n(\nor class\n)\n. Most attempts at resolving Russell's paradox have therefore concentrated on various ways of restricting or abandoning this axiom.\nRussell's own response to the paradox came with the introduction of his theory of types. His basic idea was that reference to troublesome sets\n(\nsuch as the set of all sets which are not members of themselves\n)\ncould be avoided by arranging all sentences into a hierarchy\n(\nbeginning with sentences about individuals at the lowest level, sentences about sets of individuals at the next lowest level, sentences about sets of sets of individuals at the next lowest level, etc.\n)\n. Using the vicious circle principle also adopted by\nHenri Poincaré\n, together with his so-called \"no class\" theory of classes, Russell was then able to explain why the unrestricted comprehension axiom fails: propositional functions, such as the function \"\nx\nis a set\", should not be applied to themselves since self-application would involve a vicious circle. On this view, it follows that it is possible to refer to a collection of objects for which a given condition\n(\nor predicate\n)\nholds only if they are all at the same level or of the same \"type\".\nAlthough first introduced by Russell in\n1903\nin the\nPrinciples\n, his theory of types finds its mature expression in his\n1908\narticle\nMathematical Logic as Based on the Theory of Types\nand in the monumental work he co-authored with\nAlfred North Whitehead\n,\nPrincipia Mathematica\n(1910\n,\n1912\n,\n1913)\n. Thus, in its details, the theory admits of two versions, the \"simple theory\" and the \"ramified theory\". Both versions of the theory later came under attack. For some, they were too weak since they failed to resolve all of the known paradoxes. For others, they were too strong since they disallowed many mathematical definitions which, although consistent, violated the vicious circle principle. Russell's response to the second of these objections was to introduce, within the ramified theory, the axiom of reducibility. Although the axiom successfully lessened the vicious circle principle's scope of application, many claimed that it was simply too\nad hoc\nto be justified philosophically.\nOf equal significance during this same period was Russell's defence of logicism, the theory that mathematics was in some important sense reducible to logic. First defended in his\nPrinciples\n, and later in more detail in\nPrincipia Mathematica\n, Russell's logicism consisted of two main theses. The first is that all mathematical truths can be translated into logical truths or, in other words, that the vocabulary of mathematics constitutes a proper subset of that of logic. The second is that all mathematical proofs can be recast as logical proofs or, in other words, that the theorems of mathematics constitute a proper subset of those of logic.\nLike\nGottlob Frege\n, Russell's basic idea for defending logicism was that numbers may be identified with classes of classes and that number-theoretic statements may be explained in terms of quantifiers and identity. Thus the number\n1\nwould be identified with the class of all unit classes, the number\n2\nwith the class of all two-membered classes, and so on. Statements such as \"there are two books\" would be recast as \"there is a book,\nx\nx\nx\n, and there is a book,\ny\ny\ny\n, and\nx\nx\nx\nis not identical to\ny\ny\ny\n\". It followed that number-theoretic operations could be explained in terms of set-theoretic operations such as intersection, union, and the like. In\nPrincipia Mathematica\n,\nWhitehead\nand Russell were able to provide detailed derivations of many major theorems in set theory, finite and transfinite arithmetic, and elementary\nmeasure theory\n. A fourth volume on geometry was planned but never completed.\nIn much the same way that Russell wanted to use logic to clarify issues in the foundations of mathematics, he also wanted to use logic to clarify issues in philosophy. As one of the founders of \"analytic philosophy\", Russell is remembered for his work using first-order logic to show how a broad range of denoting phrases could be recast in terms of predicates and quantified variables. Thus, he is also remembered for his emphasis upon the importance of logical form for the resolution of many related philosophical problems. Here, as in mathematics, it was Russell's hope that by applying logical machinery and insights one would be able to resolve otherwise intractable difficulties.\nRussell's Life and Public Influence\nRussell was born the grandson of Lord John Russell, who had twice served as Prime Minister under Queen Victoria. Following the death of his mother\n(\nin\n1874)\nand of his father\n(\nin\n1876)\n, Russell and his brother went to live with their grandparents.\n(\nAlthough Russell's father had granted custody of Russell and his brother to two atheists, Russell's grandparents had little difficulty in getting his will overturned.\n)\nFollowing the death of his grandfather\n(\nin\n1878)\n, Russell was raised by his grandmother, Lady Russell. Educated at first privately, and later at Trinity College, Cambridge, Russell obtained first class degrees both in mathematics and in the moral sciences.\nAlthough elected to the\nRoyal Society\nin\n1908\n, Russell's career at Trinity appeared to come to an end in\n1916\nwhen he was convicted and fined for anti-war activities. He was dismissed from the College as a result of the conviction.\n(\nThe details of the dismissal are recounted in\nBertrand Russell and Trinity\n(1942)\nby\nG H Hardy\n.\n)\nTwo years later Russell was convicted a second time. This time he spent six months in prison. It was while in prison that he wrote his well-received\nIntroduction to Mathematical Philosophy\n(1919)\n. He did not return to Trinity until\n1944\n. Married four times and notorious for his many affairs, Russell also ran unsuccessfully for Parliament, in\n1907\n,\n1922\n, and\n1923\n. Together with his second wife, he opened and ran an experimental school during the late\n1920\ns and early\n1930\ns. He became the third Earl Russell upon the death of his brother in\n1931\n.\nWhile teaching in the United States in the late\n1930\ns, Russell was offered a teaching appointment at City College, New York. The appointment was revoked following a large number of public protests and a judicial decision, in\n1940\n, which stated that he was morally unfit to teach at the College. Nine years later he was awarded the Order of Merit. He received the Nobel Prize for Literature in\n1950\n.\nDuring the\n1950\ns and\n1960\ns, Russell became something of an inspiration to large numbers of idealistic youth as a result of his continued anti-war and anti-nuclear protests. Together with\nAlbert Einstein\n, he released the Russell-\nEinstein\nManifesto in\n1955\n, calling for the curtailment of nuclear weapons. In\n1957\n, he was a prime organizer of the first Pugwash Conference, which brought together scientists concerned about the proliferation of nuclear weapons. He became the founding president of the Campaign for Nuclear Disarmament in\n1958\nand was once again imprisoned, this time in connection with anti-nuclear protests, in\n1961\n. Upon appeal, his two-month prison sentence was reduced to one week in the prison hospital. He remained a prominent public figure until his death nine years later at the age of\n97\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}