{
  "nome_completo": "Beatrice Beulah Russell",
  "nome_curto": "Beulah Russell",
  "ano_nascimento": "1878",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Russell_Beulah/",
  "lugar_nascimento": "Boxville, Union County, Kentucky, USA",
  "lugar_morte": "Newport News, Virginia, USA",
  "biografia": "Beulah Russell\nwas christened\nBeatrice Beulah Russell\nand Beatrice appears on the record of her birth. All later documents give her name as Beulah Russell\n(\nor Bulah Russell\n)\nand she does not appear to have used the name Beatrice.\nBeulah Russell was the daughter of the farmers James Russell\n(1824\n-\n1895)\nand Havana Victoria Roberts\n(1842\n-\n1924)\n. James Russell was born on\n5\nMarch\n1824\nin Tennessee and he married Sarah Ann Higginson on\n16\nNovember\n1846\nin Union County, Kentucky. Sarah had been born in\n1828\nin Kentucky. They had four children: Pamela E Russell\n(\nborn\n1847)\n; Eliza E Russell\n(\nborn\n1848)\n; George W Russell\n(\nborn\n1850)\n; and Mary A Russell\n(\nborn\n1853)\n. Sarah Ann Russell died on\n6\nSeptember\n1855\n. James Russell married Havana Victoria Roberts in Hopkins, Kentucky on\n2\nApril\n1872\n. Havana, whose name sometimes appears as Havannah or Havanah, had been born on\n25\nNovember\n1842\nin Granville, North Carolina. James and Havana Russell had five children: Edgar Roberts Russell\n(1872\n-\n1949)\n; Beatrice Beulah Russell\n(1878\n-\n1940)\n, the subject of this biography; Vera Russell\n(1881\n-\n1953)\n; Dora Russell\n(\nborn\n1884)\n; and Marion Russell\n(1885\n-\n1966)\n.\nIt was in Boxville that Beulah Russell received her school education, after which she became a school teacher before beginning her College education. At the time of the\n1900\ncensus, Beulah is\n21\nyears old and is living with her two brothers and two sisters. Her mother Havana gives her occupation as 'farmer' while her two brothers, Edgar and Marion, are 'farm labourers'. Beulah is a school teacher while both her sisters are attending school. Her father had died five years earlier and, presumably her mother was continuing to run the farm with the help of her two sons.\nIn\n1900\nBeulah Russell entered Randolph-Macon Woman's College. This College, with strong Methodist connections, had been founded in Lynchburg, Virginia in\n1891\nby William Waugh Smith who was the president of the College when Russell studied there. The College, which had opened in\n1893\n, aimed to provide Virginia women with \"an education equal to that given in our best colleges for young men.\" The academic standards were high and Russell majored in mathematics and graduated in\n1903\nwith a B.A. She was then appointed as an Instructor in Mathematics at Lafayette College in Easton, Pennsylvania. This College dated back to\n1832\nwhen classes in mathematics and the classics began in a rented farmhouse on the south bank of the Lehigh River and the College buildings that Russell taught in began construction on College Hill in\n1834\n. It had grown to have over\n300\nstudents when Russell taught mathematics there from\n1903\nto\n1905\n.\nRussell left Lafayette College after two years when, in\n1905\n, she was appointed Professor of Mathematics at Grenada College. This College, founded in\n1850\nas the Yalobusha Female Institute, became the Emma Mercer Institute in\n1867\n, then the Grenada Female College in\n1875\n. Sold to the highest bidder in\n1882\nit had been purchased by the Methodist Church and was renamed Grenada College in\n1884\n. It remained a women's college and closed in\n1936\n. Russell taught mathematics there from\n1905\nto\n1909\n.\nIn\n1909\nRussell returned to Randolph-Macon Woman's College, where she had herself been a student, as an Instructor in Mathematics. The Head of Mathematics was Nathan Allen Pattillo\n(1867\n-\n1936)\nwho had been awarded a Ph.D. from Johns Hopkins University in\n1897\n, then served on the faculty of Southern University, Millsaps College, and Alabama Normal College before being appointed Professor of Mathematics at Randolph-Macon Woman's College in\n1899\n. He had been appointed Dean of the College in\n1907\n, two years before Russell's appointment. Also in the Mathematics department was Gillie Aldah Larew who had been an Instructor in Mathematics at Randolph-Macon Woman's College from\n1903\n, and was promoted to Adjunct-Professor of Mathematics in\n1909\n, the year Russell was appointed. Annie Christine Whiteside joined the Mathematics Department in\n1912\nwhen she was appointed as an Instructor in Mathematics and Psychology.\nYou can see the Syllabus for the Mathematics Courses taught by the four members of staff at Randolph-Macon Woman's College in\n1913\n-\n14\nat\nTHIS LINK\n.\nWhile Russell was on the faculty of Randolph-Macon Woman's College, she also studied for a Master's degree at the University of Chicago. She submitted the dissertation\nRelation between the definite integral and summation of series\nto the Faculty of the Graduate School of Arts and Science of the University of Chicago in August\n1919\n. The Outline of the dissertation is as follows\n[\n6\n]\n:-\n1)\nDefinite integral evaluated by process of summation\n  a\n)\nIntegrand, a rational, integral function of x.\n  b\n)\nIntegrand, a rational fraction of type\n1\nx\n−\nc\nm\n\\large\\frac{1}{x-c}\\normalsize  m\nx\n−\nc\n1\n​\nm\n2)\nCondition for existence of the definite integral of the sum of a series.\n3)\nDefinite integral as sum of a series.\n  a\n)\nSeries derived through expansion of functions by Maclaurin's formula.\n  b\n)\nSeries summed by inverse process.\n  c\n)\nSums of certain series expressed by the definite integral.\nIn\n1925\nRussell left the Randolph-Macon Woman's College and was appointed Associate Professor of Mathematics at the College of William and Mary. This College is the second-oldest institution of higher learning in the United States. Planning began in\n1618\n, decades before Harvard University, and William & Mary was officially chartered in\n1693\n. Women were admitted to the College in\n1918\nand the dissertation\n[\n7\n]\ncontains much fascinating information about the first women faculty, including Beulah Russell.\nAt the College of William and Mary, Russell taught five classes of mathematics, three freshman classes and two upper level courses. This was a normal workload for both men and women, but women tended to teach mostly in the lower level courses\n[\n2\n]\n:-\nShe taught Freshman Mathematics, General Mathematics for students in Social Sciences, Calculus, and the History of Mathematics. ... Miss Russell was noted for the amount of time she spent in giving students extra help in Mathematics. She was very conscientious and interested in the individual. Her generous nature found her giving up evenings coaching those students who were behind in their courses.\nCarolyn Lamb Sparks Whittenburg notes\n[\n7\n]\n:-\nBeulah Russell served on the Scholarships Committee\n[\nand\n]\non the Student Activities Committee. Women faculty served on committees that focused almost exclusively on students rather than policy where more men served.\nIn\n1930\nRussell attended the\nEdinburgh Mathematical Society\nColloquium held in St Andrews, Scotland, held from\n19\nto\n30\nJuly. During the period of the Colloquium, five formal courses of lectures were given, beginning on Monday,\n21\nJuly. Three lectures were given by\nH W Richmond\non\nArithmetical Properties of Curves and Surfaces\n; four by\nC G Darwin\non\nThe Wave Mechanics\n; three by\nH W Turnbull\non\nElementary Mathematics from the Higher Standpoint\n; three by\nH F Baker\non\nRational Curves and Surfaces\n; and three by\nA C Aitken\non\nRecent Developments in Symmetric Functions, Determinants, and Algebraic Equations\n. Among the other lectures and discussions,\nCharles Noble\n, professor at the University of California, Berkeley, led a discussion on\nTeaching of Mathematics at Home and Abroad\n. Russell took part in this discussion relating the experiences of teachers in the United States, America, Canada, England, Ireland, and Scotland. By taking part in this Colloquium, Russell became the first female professor to attend the St Andrews Colloquium. Russell spent another month in the UK before leaving on the Holland-American Line ship the\nStatendam\nfrom Southampton on\n30\nAugust. The\nStatendam\narrived in New York on\n6\nSeptember allowing her time to return to the College of William and Mary to begin her teaching for session\n1930\n-\n31\n.\nBeulah Russell died of a tumour on the spine on Thursday\n22\nFebruary\n1940\nat the Riverside Hospital in Newport News\n[\n2\n]\n:-\nMiss Beulah Russell, Associate Professor of Mathematics at the College of William and Mary, died in Newport News last Thursday. Many faculty members and friends were present at the funeral services which were held on Saturday at\n2\np.m. at the home of Mrs P W Hiden in Newport News.\nMiss Russell had been ill since last summer and became a patient in the Riverside Hospital in Newport News in August. Not many students have had the occasion to know Miss Russell this year, as she has been on leave of absence since September\n1939\n.\nWe note that Mrs P W Hiden, mentioned in this quote, was the widow of Philip Wallace Hiden\n(1872\n-\n1936)\n, a businessman who had served as mayor of Newport News.\nRussell was buried in McClure Cemetery, Boxville, Union County, Kentucky in a simple grave marked with a flat stone engraved\nBEULAH RUSSELL\n1878\n-\n1940\n.\nBeulah Russell Hall at the College of William and Mary has been named in her honour.",
  "math_areas": [
    "Analysis"
  ]
}