{
  "nome_completo": "Bevan Braithwaite Baker",
  "nome_curto": "Bevan Braithwaite Baker",
  "ano_nascimento": "1890",
  "ano_morte": "1963",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bevan-Baker/",
  "lugar_nascimento": "Canonbury, London, England",
  "lugar_morte": "Wednesbury, Staffordshire,England",
  "biografia": "Bevan Braithwaite Baker\n's father was George Samuel Baker\n(1860\n-\n1935)\nwho was born in Murray, Northumberland, Ontario, Canada, on\n6\nJuly\n1860\n. George was educated at the Collegiate Institute, Kingston, Ontario, Canada until\n1878\nwhen he went to London and became an apprentice in the works of Joseph Baker and Sons at\n58\nCity Road, London. He was a bread and biscuit machinery engineer and manufacturer but, after arriving in London, had also studied Geometrical Drawing and Electricity at the Finsbury Technical College. He became manager of the works at City Road in\n1885\nand a partner in the firm in the following year. Bevan's mother was Martha Braithwaite\n(1853\n-\n1932)\nwho was born in St Pancras, Middlesex, England on\n26\nMarch\n1853\n. George and Martha were married in St George, Hanover Square, Middlesex, England, on\n14\nApril\n1886\n. Bevan Baker had two older siblings: Sarah Martha Baker\n(\nborn July\n1887\n, died\n1817)\n, who became a well-known botanist and ecologist, and George Ralph Baker\n(\nborn\n9\nAugust\n1888\n, died December\n1963)\nwho went on to be awarded a B.Sc. and a B.Sc. Engineering, becoming a draughtsman.\nBevan Braithwaite Baker was always known as Bevan Baker but only after World War II did he officially change his surname by deed poll to Bevan-Baker, see his announcement of this at\nTHIS LINK\n.\nLet us note the mathematical comment, that in changing his name,\nB\n3\nB^{3}\nB\n3\nbecame\nB\n4\nB^{4}\nB\n4\n.\nBevan was born into a Quaker family with both his parents having Quaker backgrounds. At the\n1891\ncensus, the family are living in Willesden, Middlesex and have two servants, a cook and a nurse. By\n1901\nthey are living with Bevan Baker's paternal grandmother, and a three year old niece of his father. They had four servants, a governess, a cook and two housemaids. We also note that, as well as their main London home, the family had a country house at Mersea Island in Essex, south east of Colchester.\nBaker attended Sidcot School in Somerset before entering University College, London, to study physics. After graduating with a Second Class Honours degree in physics in\n1909\n, Baker went to Munich to undertake research but quickly decided that his love was mathematics rather than physics so he returned to University College, London to take an Honours Mathematics degree.\nDuring World War I, as a Quaker, he would not fight but he served with the British Red Cross Society and the Order of St John. At the end of the war he served with the Friends Ambulance Unit in Italy. He was awarded the British War Medal and the Victory Medal. After ending his war service in\n1919\nhe taught for a short time at University College, London before being appointed as a Lecturer in Mathematics at the University of Edinburgh in\n1920\n. He had married Margaret Stuart Barbour in Edinburgh on\n6\nSeptember\n1918\n; they had five children, three girls Sarah Margaret Bevan-Baker\n(1919\n-\n1999)\n, Helena Nelson Bevan-Baker\n(1925\n-\n2000)\n, Davida Martha Bevan-Baker\n(1925\n-\n2007)\nand two boys Alexander Hugh Bevan-Baker\n(1921\n-\n1937)\n, John Stuart Bevan-Baker\n(1926\n-\n1994)\n. John Stuart Bevan-Baker became an acclaimed composer and we give a short biography at the end of this article.\nLet us return to the career of Bevan Baker, the subject of this biography. Baker was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1920\n. In\n1921\nhe cooperated with E B Ross in an important paper\nOn the Vibrations of a Particle about a Position of Equilibrium\nin which they explained the long-noted phenomenon of the great difference between the orbit of Jupiter and that of Saturn. Baker served the Society as Secretary from\n1921\nuntil he left Edinburgh in\n1924\n. He contributed papers to the meetings, for example on Friday\n10\nNovember\n1922\nhe read\nThe Vibrations of a Particle about a Position of Equilibrium, Part\n3\nto a meeting of the Society.\nIn fact, while on the staff at the University of Edinburgh, he published six articles in the\nProceedings\nof the\nEdinburgh Mathematical Society\n. For information on these papers, see\nTHIS LINK\n.\nWhile on the staff of Edinburgh University, Baker submitted a\n2\n-volume thesis \"The Convergence of the Trigonometric Series of Dynamics\" for the degree of D.Sc. which he was duly awarded. This\n2\n-volume work contained complete details of work he had undertaken and published parts of in the six papers referred to above. The D.Sc. thesis was never published but a copy is available from the University of Edinburgh library.\nAlready a member of the\nLondon Mathematical Society\n, Bevan Baker joined the\nAmerican Mathematical Society\nin April\n1923\n. In\n1924\nhe left Edinburgh when he was appointed Professor of Mathematics in Royal Holloway College, University of London. Stimulated by a course of post-graduate lectures on the Partial Differential Equations of Mathematical Physics which Professor\nE T Whittaker\ngave in\n1923\nin the Mathematical Institute of Edinburgh University, Baker planned a comprehensive treatise covering the whole of this field. Unfortunately, his years as Professor of Mathematics in Royal Holloway College, University of London were ones in which ill health and pressure of other duties prevented from carrying out his intention and, in fact, prevented him from publishing any further research papers. He taught there until\n1944\nwhen, although only\n54\nyears old, he was forced to retire through ill health.\nBevan Baker was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1921\n, his proposers being Sir\nEdmund T Whittaker\n,\nCargill G Knott\n,\nEllice M Horsburgh\n, Alexander H Freeland Barbour. An obituary of Bevan-Baker, written by\nE T Copson\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1964\n, pages\n7\n-\n8\n. We give a version of this obituary at\nTHIS LINK\n.\nIn\n1939\nBevan-Baker published the book\nThe Mathematical Theory of Huygens' Principle\nin collaboration with\nE T Copson\n. This was his only mathematical publication while at Royal Holloway College and the high quality of the work shows that the world of mathematics was considerably poorer for the fact that 'ill health and pressure of other duties' prevented him completing further work. The book was reviewed by\nHarry Bateman\nwho wrote\n[\n2\n]\n:-\nHuygens\n' geometrical construction, with its restriction that only one sheet of the envelope of the spherical wavelets is to be considered, is first justified in Chapter I by\nPoisson\n's analytical solution of the equation of wave-motions. A discussion is then given of the ideas of\nFresnel\nand of the formula of\nHelmholtz\nwhich expresses these ideas in analytical form and gives the principle of\nHuygens\nfor periodic processes. The diffraction formulae of\nFresnel\nand\nStokes\nare then obtained.\nKirchhoff\n's famous formula is first derived from the formula of\nHelmholtz\nand then proved directly. The formula is interpreted physically and the question of the uniqueness of the solution discussed. It is pointed out that to extend the theorem of\nKirchhoff\nto the space outside a closed surface it is necessary to prescribe the asymptotic behaviour of the wave-functions under consideration. The peculiarities of wave-propagation in two dimensions are next indicated and\nWeber\n's analogue of\nHelmholtz\n's theorem is given. The analogue of\nKirchhoff\n's formula, due to\nVolterra\n, is derived and an interesting account is given of a method, devised by\nMarcel Riesz\nand based on the theory of fractional integration, which provides a powerful method of solving initial value problems for equations like the wave equation.\nThe rest of the book is devoted chiefly to the problem of diffraction. Part of Chapter II includes a useful discussion of an important type of definite integral which occurs in the analysis of diffraction problems. Diffraction by a black screen is discussed in some detail. In Chapter III\nHuygens\n' principle is formulated for electromagnetic waves and Tedone's proof is given for some formulae which are associated with the names of\nLarmor\nand Tedone. Chapter IV contains a good account of\nSommerfeld\n's theory of diffraction.\nA second edition of the book, which differed from the first by the addition of a new chapter on the application of the theory of integral equations to problems of diffraction theory by a plane screen, was published in\n1950\n. A third edition, with some minor improvements, was published in\n1987\nand reprinted by the\nAmerican Mathematical Society\nin\n2001\n,\n2003\n,\n2009\n,\n2014\n. For further reviews of this classic monograph, see\nTHIS LINK\n.\nFinally let us give some details of John Stuart Bevan Baker, the youngest of Bevan and Margaret Baker's children. John was born in Staines, Middlesex, on\n3\nMay\n1926\n. He had a natural talent for art, music, English and mathematics. From Preparatory school at The Downs in Colwall, England, he proceeded in\n1939\non an Art Scholarship to Blundells School in Devon. Completing his studies in\n1944\n, his pacifist disposition\n(\ncoming from his Quaker family background\n)\ntook him down Newbiggin coal mine in Northumberland as a Bevin Boy between\n1944\nand\n1946\n, thus fulfilling his war service. Then, in\n1946\n, he entered the Royal College of Music to study organ and music composition where his tutors included Ralph Vaughan Williams. In\n1949\nhe became an assistant to the organist of Westminster Abbey. He stayed in this position for two years, and then became a freelance organist playing in London. In\n1958\nhe moved to Aberdeen followed by full-time teaching posts at Robert Gordon's College in Aberdeen, at Whitehill Secondary School in Glasgow, and then at the Fortrose Academy in Fortrose on the Black Isle in the Scottish Highlands where he composed many works. Peter Maxwell Davies has described these compositions as 'beautifully crafted, transparently honest music, of great warmth and melodic fecundity.'",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}