{
  "nome_completo": "Bhaskara I",
  "nome_curto": "Bhaskara I",
  "ano_nascimento": "600",
  "ano_morte": "680",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bhaskara_I/",
  "lugar_nascimento": "(possibly) Saurastra (modern Gujarat state), India",
  "lugar_morte": "(possibly) Asmaka, India",
  "biografia": "We have very little information about\nBhaskara I\n's life except what can be deduced from his writings. Shukla deduces from the fact that Bhaskara I often refers to the\nAsmakatantra\ninstead of the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nthat he must have been working in a school of mathematicians in Asmaka which was probably in the Nizamabad District of Andhra Pradesh. If this is correct, and it does seem quite likely, then the school in Asmaka would have been a collection of scholars who were followers of\nAryabhata I\nand of course this fits in well with the fact that Bhaskara I himself was certainly a follower of\nAryabhata I\n.\nThere are other references to places in India in Bhaskara's writings. For example he mentions Valabhi\n(\ntoday Vala\n)\n, the capital of the Maitraka dynasty in the\n7\nth\ncentury, and Sivarajapura, which were both in Saurastra which today is the Gujarat state of India on the west coast of the continent. Also mentioned are Bharuch\n(\nor Broach\n)\nin southern Gujarat and Thanesar in the eastern Punjab which was ruled by Harsa for\n41\nyears from\n606\n. Harsa was the pre-eminent ruler in north India through the first half of Bhaskara I's life. A reasonable guess would be that Bhaskara was born in Saurastra and later moved to Asmaka.\nBhaskara I was an author of two treatises and commentaries to the work of\nAryabhata I\n. His works are the\nMahabhaskariya\nⓉ\n(\nThe big book of Bhaskara\n)\n, the\nLaghubhaskariya\nⓉ\n(\nThe small book of Bhaskara\n)\nand the\nAryabhatiyabhasya\nⓉ\n(\nCommentary on Aryabhata's work\n)\n. The\nMahabhaskariya\nⓉ\n(\nThe big book of Bhaskara\n)\nis an eight chapter work on Indian mathematical astronomy and includes topics which were fairly standard for such works at this time. It discusses topics such as: the longitudes of the planets; conjunctions of the planets with each other and with bright stars; eclipses of the sun and the moon; risings and settings; and the lunar crescent.\nBhaskara I included in his treatise the\nMahabhaskariya\nⓉ\n(\nThe big book of Bhaskara\n)\nthree verses which give an approximation to the trigonometric sine function by means of a\nrational\nfraction. These occur in Chapter\n7\nof the work. The formula which Bhaskara gives is amazingly accurate and use of the formula leads to a maximum error of less than one percent. The formula is\nsin\n⁡\nx\n=\n16\nx\n(\nπ\n−\nx\n)\n/\n[\n5\nπ\n2\n−\n4\nx\n(\nπ\n−\nx\n)\n]\n\\sin x = 16x (\\pi - x)/[5\\pi^{2} - 4x (\\pi - x)]\nsin\nx\n=\n1\n6\nx\n(\nπ\n−\nx\n)\n/\n[\n5\nπ\n2\n−\n4\nx\n(\nπ\n−\nx\n)\n]\nand Bhaskara attributes the work as that of\nAryabhata I\n. We have computed the values given by the formula and compared it with the correct value for\nsin\n⁡\nx\n\\sin x\nsin\nx\nfor\nx\nx\nx\nfrom\n0\nto\nπ\n/\n2\n\\pi/_{2}\nπ\n/\n2\n​\nin steps of\nπ\n/\n20\n\\pi/_{20}\nπ\n/\n2\n0\n​\n.\nx\n=\n0\nx = 0\nx\n=\n0\nformula =\n0\n.\n00000\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n00000\nerror =\n0\n.\n00000\nx\n=\nπ\n/\n20\nx = \\pi/_{20}\nx\n=\nπ\n/\n2\n0\n​\nformula =\n0\n.\n15800\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n15643\nerror =\n0\n.\n00157\nx\n=\nπ\n/\n10\nx = \\pi/_{10}\nx\n=\nπ\n/\n1\n0\n​\nformula =\n0\n.\n31034\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n30903\nerror =\n0\n.\n00131\nx\n=\n3\nπ\n/\n20\nx = 3\\pi/_{20}\nx\n=\n3\nπ\n/\n2\n0\n​\nformula =\n0\n.\n45434\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n45399\nerror =\n0\n.\n00035\nx\n=\nπ\n/\n5\nx = \\pi/_{5}\nx\n=\nπ\n/\n5\n​\nformula =\n0\n.\n58716\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n58778\nerror = -\n0\n.\n00062\nx\n=\nπ\n/\n4\nx = \\pi/_{4}\nx\n=\nπ\n/\n4\n​\nformula =\n0\n.\n70588\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n70710\nerror = -\n0\n.\n00122\nx\n=\nπ\n/\n10\nx = \\pi/_{10}\nx\n=\nπ\n/\n1\n0\n​\nformula =\n0\n.\n80769\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n80903\nerror = -\n0\n.\n00134\nx\n=\n7\nπ\n/\n20\nx = 7\\pi/_{20}\nx\n=\n7\nπ\n/\n2\n0\n​\nformula =\n0\n.\n88998\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n89103\nerror = -\n0\n.\n00105\nx\n=\n2\nπ\n/\n5\nx = 2\\pi/_{5}\nx\n=\n2\nπ\n/\n5\n​\nformula =\n0\n.\n95050\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n95105\nerror = -\n0\n.\n00055\nx\n=\n9\nπ\n/\n20\nx = 9\\pi/_{20}\nx\n=\n9\nπ\n/\n2\n0\n​\nformula =\n0\n.\n98753\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n0\n.\n98769\nerror = -\n0\n.\n00016\nx\n=\nπ\n/\n2\nx = \\pi/_{2}\nx\n=\nπ\n/\n2\n​\nformula =\n1\n.\n00000\nsin\n⁡\nx\n\\sin x\nsin\nx\n=\n1\n.\n00000\nerror =\n0\n.\n00000\nIn\n629\nBhaskara I wrote a commentary, the\nAryabhatiyabhasya\nⓉ\n(\nCommentary on Aryabhata's work\n)\n, on the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nby\nAryabhata I\n. The\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\ncontains\n33\nverses dealing with mathematics, the remainder of the work being concerned with mathematical astronomy. The commentary by Bhaskara I is only on the\n33\nverses of mathematics. He considers problems of indeterminate equations of the first degree and trigonometric formulae. In the course of discussions of the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\n, Bhaskara I expressed his idea on how one particular rectangle can be treated as a cyclic quadrilateral. He was the first to open discussion on quadrilaterals with all the four sides unequal and none of the opposite sides parallel.\nOne of the approximations used for π for many centuries was √\n10\n. Bhaskara I criticised this approximation. He regretted that an exact measure of the circumference of a circle in terms of diameter was not available and he clearly believed that π was not rational.\nIn\n[\n11\n]\n,\n[\n12\n]\n,\n[\n13\n]\nand\n[\n14\n]\nShukla discusses some features of Bhaskara's mathematics such as: numbers and symbolism, the classification of mathematics, the names and solution methods of equations of the first degree, quadratic equations, cubic equations and equations with more than one unknown, symbolic algebra, unusual and special terms in Bhaskara's work, weights and measures, the Euclidean algorithm method of solving linear indeterminate equations, examples given by Bhaskara I illustrating\nAryabhata I\n's rules, certain tables for solving an equation occurring in astronomy, and reference made by Bhaskara I to the works of earlier Indian mathematicians.",
  "math_areas": [
    "Analysis"
  ]
}