{
  "nome_completo": "William George Penney",
  "nome_curto": "Bill Penney",
  "ano_nascimento": "1909",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Penney/",
  "lugar_nascimento": "Gibraltar",
  "lugar_morte": "East Hendred (near London), England",
  "biografia": "Bill Penney\nattended school in Colchester, then spent the years\n1924\n-\n26\nat Sheerness Technical College. After leaving he took a job as a laboratory assistant before being awarded a scholarship to studied at the University of London in\n1927\n. He won the Governor's Prize for Mathematics and graduated with First Class Honours in\n1929\n.\nAfter two years at the University of Wisconsin he returned to England and obtained a doctorate from the University of Cambridge in\n1935\non the application of\nquantum mechanics\nto the physics of crystals. He was then appointed Reader in Mathematics at Imperial College London, a post he held from\n1936\nto\n1945\n.\nIn\n1944\n-\n45\nhe worked on the USA atomic bomb project at the Los Alamos Scientific Laboratory, New Mexico. In particular he worked on the use of the atomic bomb, its effects and in particular the height at which it should be detonated.\nReturning to England he worked on the British atomic bomb project, saw the project through to the test of the first bomb in\n1952\n. At this point Penney was offered a Chair at the University of Oxford. Always more inclined toward the academic life he was keen to accept this post but he was persuaded that the \"national interests\" required him to continue as director of atomic-weapons research and development at Aldermaston.\nFrom\n1954\nPenney served on the Board of the Atomic Energy Authority, becoming Chairman in\n1964\n. He retired his post of Chairman in\n1967\nand accepted an invitation to become Rector of Imperial College. He resigned this post after\n6\nyears and although he led the College successfully the reason for his early retirement may be explained by his own words about this period:-\nThese were difficult times .... The students were sometimes uncontrollable, the heads of departments were bewildered and angry, the rest of the staff, including the technicians, wanted a say in how everything was run.\nHe received many honours. In\n1946\nhe was made O.B.E., in\n1952\nK.B.E. and made Baron Penney of East Hendred in\n1967\n. He received an O.M. in\n1969\n. Other honours include being elected a Fellow of the\nRoyal Society\nin\n1946\nand in\n1966\nhe was awarded its Rumford Medal:-\n... in recognition of his distinguished and paramount personal contribution to the establishment of economic nuclear energy in Great Britain.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\nin\n1970\n. He also received honorary degrees from five universities.\nIn\n[\n2\n]\nhe is described as follows:-\nIn appearance, he was a rotund, rather owl-like figure, usually casually dressed. He was friendly and amiable, if sometimes rather withdrawn in company, often with an amused smile for he had a keen sense of humour. ... He spoke slowly ... He said little, but what he said was much to the point, and carried authority, and he had a gift for laconic comment.",
  "math_areas": []
}