{
  "nome_completo": "Boris Yakovlevich Levin",
  "nome_curto": "Boris Yakovlevich Levin",
  "ano_nascimento": "1906",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levin/",
  "lugar_nascimento": "Odessa, Russia (now Ukraine)",
  "lugar_morte": "Kharkiv, Ukraine",
  "biografia": "Boris Yakovlevich Levin\n's father, Yakov Levin, was a clerk for a Black Sea steamer company. This meant that Yakov was based for long periods in several different Black Sea ports and so, as Boris Yakovlevich was growing up, he lived in many different towns. The sea came to be an important part of the boy's life: he became a strong swimmer with a passion for the sea. Let us note at this point that although we will refer to the subject of this biography as Levin, he was known as B. Ya. to his friends and colleagues. After graduating from the high school in Yeysk, a port on the Sea of Azov, Levin was not able to continue to higher education and had to take a job. He worked at a number of different jobs, in particular as an insurance agent and distributing newspapers in Yeysk. He then moved to Tuapse, situated on the north east shore of the Black Sea, where he learnt to be a welder.\nOil was extracted from the region of the North Caucasus's in the\n19\nth\ncentury but only in the\n1920\ns were geological studies carried out in the foothills of the mountains. Drilling began in\n1924\nand pipelines had to be constructed. Levin worked as a welder on pipeline construction for a while, in particular on the pipeline to the refinery in Grozny, and this earned him the right to a university education. He entered the Department of Physics and Engineering of Rostov University in\n1928\n, in the same year as\nNikolai Vladimirovich Efimov\n. Although four years younger than Levin,\nEfimov\nhad also had a variety of short-term jobs in construction before beginning his higher education studies. Both Levin and\nEfimov\nhad the intention of taking a physics degree, but they felt that their knowledge of mathematics was insufficient to benefit from launching straight into physics courses so both decided to take mathematics courses in their first year. They were taught by Dmitry Dmitrievich Morduhai-Boltovskoi\n(1876\n-\n1952)\nwho had been awarded his doctorate from St Petersburg State University in the year Levin was born. Morduhai-Boltovskoi had established a research school in Rostov and both Levin and\nEfimov\nwere quickly drawn into high level mathematics which they found very exciting.\nLevin, despite his decision to take a degree in physics, soon realised that mathematics was the topic that was right for him. Morduhai-Boltovskoi had Levin undertaking research from his second year of study, proposing a problem to him about generalising the functional equation for the\nEuler\nG\n-function. Levin solved the problem and, a few years later, published his solution in the paper\nGeneralization of a theorem of Hölder\n(\nRussian\n)\n(1934)\n. Levin graduated in\n1932\nbut continued to undertake research at Rostov University advised by Morduhai-Boltovskoi. At this stage he was not working towards a higher degree since the academic degrees of Master of Science and Doctor of Science had been abolished in the USSR in\n1918\n. However, they were reintroduced in\n1934\nso that Levin was able, at that time, to consider his research as being towards a thesis for a higher degree. He was not a full-time research student, however, for he took a position teaching mathematics at the Technical University of Rostov.\nLevin began friendships at this time with two young mathematicians who worked at different universities, friendships which were to prove important in later life.\nNaum Il'ich Akhiezer\n, who worked at Kharkov\n(\nnow Kharkiv\n)\nUniversity, was in the same position as Levin, having been unable gain a higher degree since they were abolished. Levin's other friend,\nMark Grigorievich Krein\n, was working at Odessa University in the city where Levin had been born.\nWith the reintroduction of the higher degree in\n1934\n, Levin decided to submit his thesis for a Candidate's Degree\n(\nequivalent to a Ph.D. by today's standards\n)\n. However, before submitting to the University of Rostov, Levin moved to Odessa in\n1935\nto take up a position at the University of Marine Engineering. He was already publishing papers and, in addition to the one we mentioned above, he had published\nThe arithmetic properties of holomorphic functions\n(1933)\n, The intersection of algebraic curves\n(1934)\n,\nEntire functions of irregular growth\n(1936)\n, and T\nhe growth of the Sturm-Liouville integral equation\n(1936)\n. Although we have given these papers English titles, all were written in Russian. He submitted his thesis\n0\nn the growth of an\nentire function\nalong a ray, and the distribution of its zeros with respect to their arguments\nto the University of Rostov in\n1936\nbut, although the thesis was submitted for a Candidate's Degree, the university took the highly unusual step of awarding Levin the higher degree of Doctor of Science\n(\nequivalent to a D.Sc.\n)\n.\nMark Grigorievich Krein\nhad been appointed to the staff at Odessa University after being a research student there. He had begun to build a functional analysis research group there which was to become one of the most important centres in the world. Joining the Odessa research team, Levin\n[\n16\n]\n:-\n... spent a lot of time and effort in advising his colleagues who worked on hydrodynamical problems of ships and mechanics of construction. In his later years he would say that teaching and communicating with engineers in a serious technical university is an important experience for a mathematician.\n... as he later used to say, experienced its strengthening influence. He became interested in almost periodic functions, quasi-analytic classes and related problems of completeness and approximation, algebraic problems of the theory of entire functions, and\nSturm\n-\nLiouville\noperators. These remained the main fields of interest during his life.\nWhen World War II broke out, Levin tried to enlist in the military. However, university professors had to contribute in other ways to the war effort and he was not permitted to enlist. He went to the Institute in Samarkand, Uzbekistan. In June\n1941\nall staff had to leave Odessa when the university was evacuated to Uzbekistan as the German armies advanced. By the end of August\n1941\nGerman armies surrounded the city and the Germans controlled it until April\n1944\nwhen it was recaptured. Levin returned to Odessa when the university reopened again but at this stage the\nfunctional analysis\nschool at Odessa was closed down.\nKrein\nwas accused of favouring Jews, and it was claimed that he had too many Jewish students before the War.\nKrein\nwas put in an impossible position by the university. He had to leave and the whole of the functional analysis school at Odessa was closed down. Vladimir Petrovich Potapov, who had been one of the non-Jewish students in the functional analysis group and had become a Ph.D. student of Levin's in\n1939\n, tried hard to influence the university authorities to reverse their decisions. He wrote:-\nThe leaders of the university have to correct their mistakes and to revive immediately the famous traditions of the Odessa School of Mathematics. The Faculty of Physics and Mathematics has to become active again, as a really creative centre of scientific and mathematical thought in our city ....\nSelim Grigorievich Krein was\nMark Grigorievich Krein\n's younger brother and he studied at Kiev State University advised by\nNikolai Nikolaevich Bogolyubov\n. Selim Krein, like his older brother, worked on functional analysis and, after writing some papers with his older brother and with his advisor, he worked with Levin. They wrote several joint papers:\nOn the convergence of singular integrals\n(1948)\n,\nOn the strong representation of functions by singular integrals\n(1948)\n,\nOn certain non-linear questions of the theory of singular integrals\n(1948)\n, and\nOn a problem posed by I P Natanson\n(1948)\n. These papers were all written in Russian and the last two also had Boris Korenblum as a joint author.\nThe difficult situation in Odessa was resolved for Levin in\n1949\nwhen he received an invitation from\nNaum Il'ich Akhiezer\nto join him at Kharkov University\n[\n7\n]\n:-\nIn the Kharkov period, Levin developed the majorant theory, making it possible to explain the\nBernstein\ninequalities from a unified viewpoint, wrote his famous monograph on the distribution of roots of entire functions, created the theory of subharmonic majorants, gave nontrivial estimates for functions polyharmonic in half-spaces, and made a fundamental contribution to the theory of exponential bases.\nThe famous monograph mentioned in this quote is\nDistribution of zeros of entire functions\n(\nRussian\n)\n(1956)\nwhich was translated into English as\nDistribution of zeros of entire functions\n(1964)\n.\nR P Boas, Jr\nwrites in a review of the Russian text:-\nThis is the third book on entire functions to have appeared in the last few years; its objectives and its contents differ considerably from those of the other two\n[\nBoas\n, 'Entire functions'\n(1954)\nand\nCartwright\n, 'Integral functions'\n(1956)]\n, although a certain amount of overlap is inevitable. The first half of the book consists mainly of material that is fairly well covered, or is even covered in more detail, in other books or in journals that will be more accessible to Western readers; the second half consists mainly of material that has not previously appeared in books in any language ... A number of the author's own results, previously announced without proof or only with sketches of proofs, are proved in detail. The book will be a useful reference for much interesting material that is not easily accessible elsewhere.\nThe authors of\n[\n11\n]\nand\n[\n12\n]\nwrite:-\nThe remarkable thing about Levin's book is that he does not only treat general fundamentals of the theory of entire functions, the classical results of\nHadamard\nand\nLindelöf\n, but also sets out the most important recent research and gives an account of numerous and often unexpected results in the adjacent fields of classical and functional analysis.\nA revised English edition appeared in\n1980\n. Levin explains in this work how he has treated material that has appeared since the first edition:-\nSince the appearance of the first edition many papers have been published on the theory of functions of completely regular growth and related topics. However, we do not have the time to expound these new results, which would fill an additional volume. We have tried to make up for this shortcoming by stating new results in a number of places, without proofs, when they are connected with the topics under discussion. We have also added an appendix, 'Further development of the theory of functions of completely regular growth', in which we present a survey of recent results. In addition, we have cited papers in which this material is presented in more detail, with proofs.\nLevin taught a wide variety of courses at Kharkov University\n[\n16\n]\n:-\nIn addition to undergraduate courses of calculus, theory of functions of a complex variable and functional analysis, he taught advanced courses on entire functions, quasi-analytic classes, almost periodic functions, harmonic analysis and approximation theory, and\nBanach\nalgebras. The lectures were distinguished by their originality, depth and elegance. Levin used to include his own, yet-unpublished results as well as new original proofs of known theorems. He attracted a very wide audience of students of various levels and also research mathematicians.\nIn\n1956\n, the year he published the first edition of his famous book, Levin organised a scientific seminar which attracted many participants and trained a whole generation of first class mathematicians. The seminar focused on complex analysis and its applications but was wide ranging and included talks on a many different areas of analysis. As to his other mathematical contributions we have already given an indication above but let us now also quote from\n[\n13\n]\nand\n[\n14\n]\n:-\nFirst we must mention the theory of almost periodic functions. In the\n40\n's Levin gave an essentially new construction of Levitan's theory of almost periodic functions and together with\nM G Krein\nhe studied\nHarald Bohr\n's almost periodic functions with bounded spectrum. Of his results on the spectral theory of differential operators we shall mention only the construction, dating from the\n50\n's, of the operator \"attached to infinity\" of the transformation for the\nSchrödinger\nequation, which played an important part in the solution of the inverse problem in the theory of scattering.\nIn\n1969\n, in addition to his role at the University, Levin took on the role of Head of the Department of the Theory of Functions at the Institute for Low Temperature Physics and Engineering of the Academy of Sciences of Ukraine. However, life in Kharkov was not easy for Levin who found it increasingly hard to undertake his university duties. He was hardly admitted to the university, never put on committees formed to examine Ph.D.s, not even those on complex function theory. According to\n[\n1\n]\n:-\nHe became very angry and swore that he would never get involved with the university or any kind of activity which was affiliated with it. So, he came just for the function theory seminar, whose actual leader he was even though the official leader was\nI V Ostrovskii\n.\nThis statement is challenged by some members of the seminar, and in fact Levin continued to teach some courses at Kharkov and in later years Levin and\nOstrovskii\nran the seminar together.\nHe was nearly eighty years old before he was allowed to travel abroad so his opportunities to meet his international colleagues was severely limited. He lived, with his wife Liya, in a small ground-floor apartment which was damp and unhealthy. Nevertheless he would invite his colleagues to his home and after long enjoyable mathematical discussions they would be joined by Liya for supper\n[\n16\n]\n:-\nAfter traditional strong tea which Levin always made himself, there was the time for discussing politics and politicians, for storytelling and poetry, in which Levin was the expert and connoisseur.\nLevin's character is described in\n[\n5\n]\nand\n[\n6\n]\n:-\nLevin enjoyed a long life, full of mathematical quest and discovery. He was ever a man of the highest principles, which he defended openly, in spite of all the blows that fate dealt him. A brilliant mathematician, wonderful lecturer, a most interesting conversationalist, a witty and resourceful opponent, a great connoisseur and judge of literature, a man who would offer help at times of need, ever considerate and benevolent to those around him, Levin emitted some kind of special energy which helped to bring the best out of those in his company, and which attracted to him the most varied of people, sometimes people who had no connection at all with the exact sciences.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}