{
  "nome_completo": "Colin Brian Haselgrove",
  "nome_curto": "Brian Haselgrove",
  "ano_nascimento": "1926",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Haselgrove/",
  "lugar_nascimento": "Chingford, Essex, England",
  "lugar_morte": "Manchester, England",
  "biografia": "Brian Haselgrove\n's family lived in Chingford, Essex, but also had a large house on the east coast at Frinton, where they used to spend the summer.  This was taken over by the government at the beginning of the war in\n1939\nand the family were evacuated to Somerset, in the southwest.  Because of the move Brian went to Blundell's School, Tiverton for the last part of his schooldays.\nHe won a scholarship to King's College, Cambridge and went up in\n1944\n.  There were three Mathematics scholars at King's that year.  One other was\nJohn Leech\nand the third was Berthold Hamburger, who caught tuberculosis and died in February\n1946\n, in his fifth term.  Brian also caught tuberculosis and was away from Cambridge for two years.  He returned in\n1947\nand took Part II of the Tripos in\n1948\n.  As a research student, advised by\nAlbert Ingham\n, he won the Smith's Prize in\n1950\nand became a Fellow of King's College and a Senior Assistant in Research\n(\nequivalent to a Senior Research Fellow elsewhere!\n)\nin the Mathematical Laboratory, which later became the Computing Laboratory. His dissertation was\nSome Theorems in the Analytic Theory of Numbers\n. While at Cambridge, he published two articles in the Cambridge University Mathematics Society magazine\nEureka\n. The first was\nA Note on Fermat's Last Theorem and the Mersenne Numbers\nin the January/February issue of\n1949\nand the second was\nTelepathy Experiment\nin the October issue of\n1950\n.\nHaselgrove's first published research paper was on number theory. This was\nA connection between the zeros and the mean values of\nz\n(\ns\n)\nz(s)\nz\n(\ns\n)\n(1949)\nfollowed by\nSome theorems in the analytic theory of numbers\n(1951)\n,\nOn Ingham's Tauberian theorem for partitions\n(1952)\n, and\n(\nwith H N V Temperley\n)\nAsymptotic formulae in the theory of partitions\n(1954)\n. Among the results proved by Haselgrove in the\n1951\npaper is an extension of\nLinnik\n's method for proving the\nGoldbach\n-\nVinogradov\nthree prime theorem, namely that any sufficiently large odd integer is the sum of at most three primes.\nHowever Haselgrove was involved in much more than number theory. He was working in the Mathematical Laboratory at Cambridge on the EDSAC\n1\ncomputer. Haselgrove's wife Jenifer and his fellow mathematics student\nJohn Leech\nwere also working in the Laboratory at the time. In\n1953\nHaselgrove implemented the first computer program to carry out coset enumeration of subgroups of finite index in a finitely presented group.\nLeech\nwrites in\n1963\nthat Haselgrove's was:-\n... the first attempt to carry out coset enumeration on a digital computer. It was prompted by discussion with\nTodd\nafter experiments with enumeration of elements of groups by expressing them as words in the computer.\nAn implementation of this procedure, designed by\nTodd\nand\nCoxeter\nfor hand calculation, remains today as one of the main tools in computational group theory. The state of the art implementation of coset enumeration today is the package ACE\n(\navailable both as a stand-alone program or within all major group theory systems\n)\n. ACE includes an implementation of the HLT method of coset enumeration named after the work by Haselgrove,\nLeech\nand Trotter.\nAnother topic which Haselgrove worked on at this time was the problem of stellar evolution, collaborating with\nFred Hoyle\n. They wrote a joint paper\nA mathematical discussion of the problem of stellar evolution, with reference to the use of an automatic digital computer\n(1956)\nas a result of this joint work. W F Freiberger writes:-\nThe problem of stellar evolution is expressed, mathematically, by a set of non-linear partial differential equations describing the variation of density and temperature as a function of time and of distance from the star centre. This problem is tackled in the paper under review on the following assumptions: i\n)\nspherical symmetry of the star; ii\n)\nhydrostatic equilibrium; iii\n)\nnegligible stirring of material except where convectively unstable; there, \"well mixed\". The computer employed was one of only moderate storage and speed, viz. the Cambridge EDSAC I; thus, considerable ingenuity was required in defining subsidiary variables.\nJenifer Haselgrove relates an amusing anecdote from this collaboration:-\nThere was a rheostat up on the wall just outside the machine room door, which was used to adjust the voltage if the mains wasn't right. ... One night even the rheostat adjustment wasn't enough and\nFred Hoyle\n, with whom my husband Brian Haselgrove was working on stellar evolution, rang up the electricity board and said \"Can you hike your volts up a bit?\". I can't remember if they did!\nHaselgrove spent four months at the California Institute of Technology in Pasadena in\n1956\n-\n57\n, continuing work on computers with\nFred Hoyle\nto model stellar evolution, and returned to take up a post as a Senior Lecturer in computing in Manchester University\n[\n2\n]\n:-\nIn\n1957\n[\nMax Newman\n]\nappointed Haselgrove ... to promote research in mathematical computing in Manchester. Some of the applications of computers were immediately obvious; many well-formulated problems in science and engineering which required numerical solutions could benefit directly from faster computation. This was particularly true in astronomy, a classical area for numerical work, where the research at Jodrell Bank called for major computing support. But there was also the prospect of using automatic machines to solve analytical and logical problems in new ways, which were not simply accelerated versions of existing methods.\nIn\n1958\nHaselgrove published his most famous number theory result in\nA disproof of a conjecture of Pólya\n. The conjecture of\nPólya\nclaims that for every\nx\nx\nx\n>\n1\nthere are at least as many numbers less than or equal to\nx\nx\nx\nhaving an odd number of prime factors as there are numbers with an even number of prime factors. R S Lehman and W G Spohn had verified the conjecture for all numbers\nx\nx\nx\nup to\n800\n,\n000\nbut Haselgrove found a counterexample using methods based on those developed by\nIngham\nwith the help of computations carried out on the EDSAC\n1\ncomputer at Cambridge. He also verified the calculations using Manchester University's Mark I computer before publishing the results. In the same paper Haselgrove announced that he had also disproved a number theory conjecture of\nTurán\n. Another piece of work, undertaken at Cambridge, but published after he was working in Manchester was his\nTables of the Riemann zeta function\n, work which he undertook jointly with J C P Miller.\nDerrick Lehmer\nwrites:-\nThis is the first table of the\nRoyal Society\nto be produced automatically by electronic computers. Any other method would not have been feasible. A great many terms of the\nEuler-Maclaurin\nor\nRiemann\n-\nSiegel\nseries were used to calculate each entry. For some cases\n15\nfigure logarithms were needed as input data to obtain barely\n6\ndecimal accuracy. The large zeros of Table IV required inverse interpolation involving\n14\nth\ndifferences.\nThe tables will be very helpful in future exploration of inequalities involving certain numerical functions ...\nAlso in\n1958\nHaselgrove published\nApplications of digital computers in mathematics\nin\nThe Mathematical Gazette\n. Together with his wife, he published\nA Computer Program for Pentominoes\nin the Cambridge University Mathematics Society magazine\nEureka\nin October\n1960\n.\nHaselgrove's work in Manchester is described in\n[\n2\n]\n:-\nBrian Haselgrove's research interests ranged over many areas of mathematics both pure and applied. ... at Manchester he published papers on\nDirichlet\nfunctions and the\nRiemann\nhypothesis, ray paths in the ionosphere, numerical integration using quasi-random numbers, two-point boundary-value problems, and some geometrical puzzles. The paper on boundary-value problems illustrates an early stage of what was to become a major interest of numerical analysts at Manchester and elsewhere, the development of general algorithms. This work involves the elucidation of classes of mathematical problems which are suitable for solution by a standardised approach. The solution methods have to be studied analytically and tested on an extensive range of problems, to determine their applicability and limitations. In the early\n1960\n's the potential for general solvers was becoming apparent, but the programming languages available did not provide enough flexibility for implementation.\nAt Manchester Haselgrove continued his interest in coset enumeration, and implemented a new version of the\nTodd\n-\nCoxeter\nprocedure on the Mercury computer there in\n1960\n. He also studied numerical analysis. In\nThe solution of non-linear equations and of differential equations with two-point boundary conditions\n(1961)\nHaselgrove suggests general iterative techniques, based on an\nn\nn\nn\n-dimensional extension of the\nNewton\n-\nRaphson\nprocess. His tables of\nDirichlet\nL-functions were deposited with the\nRoyal Society\nbut not published although he did publish\n(\nwith\nD Davies\n)\nthe paper\nThe evaluation of\nDirichlet\nL-functions\n(1961)\ndescribing the methods used. In\nA method for numerical integration\n(1961)\nhe gave the following summary:-\nIn this paper we shall give an account of some methods developed for the numerical evaluation of multidimensional integrals. These methods are based on the theory of Diophantine approximation. They are suitable for some problems for which the Monte Carlo method is commonly used and, like the Monte Carlo method, are well fitted for use with an electronic digital computer.\nAlso in\n1961\n, together with his wife Jenifer and with R Jennison, he published\nRay paths from a cosmic radio source to a satellite in orbit\n. The paper begins:-\nA receiver mounted on a satellite in orbit above the maximum of the F\n2\nlayer can receive radiation of frequencies that are totally reflected by the ionosphere. Two effects of reflection in the upper part of the ionosphere are discussed in this paper; both occur particularly when the satellite enters or leaves a region in which it can receive radiation from a point source.\nHaselgrove's teaching at Manchester is described in\n[\n2\n]\n:-\nOn the teaching side, Haselgrove initiated a postgraduate Diploma in Computing in\n1959\nin collaboration with Tony Brooker and other members of the Computing group. In\n1964\nComputer Science became a separate Department, and the postgraduate course began to concentrate on the more mathematical aspects of computing, retaining some options from Computer Science. Student numbers were relatively small at first, but the course provided a source of research students in Numerical Analysis. Haselgrove also introduced an undergraduate course in numerical methods and computer programming, but it was not possible to include realistic practical work until autocodes were designed.\nHe died in Manchester in May\n1964\nfrom an infiltrating brain tumour, which had been causing him minor epileptic fits for several years. Perhaps because of his illness he did not publish much research himself in these last years but he did supervise several research students.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}