{
  "nome_completo": "Brian Hartley",
  "nome_curto": "Brian Hartley",
  "ano_nascimento": "1939",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hartley/",
  "lugar_nascimento": "Accrington, Lancashire, England",
  "lugar_morte": "Lake District, England",
  "biografia": "Brian Hartley\n's parents were Thomas Hartley\n(1907\n-\n1969)\nand his wife Annie Kay\n(1912\n-\n1987)\n. Thomas Hartley, a joiner, married Annie, a cotton mill worker, in\n1934\n. They had two children, Brian\n(\nthe subject of this biography\n)\nborn in\n1939\nand a daughter Mavis born three years later. Thomas and Annie Hartley lived with Annie's mother Amelia Kay for the first twelve year of their marriage and both continued working. This meant that Brian was mostly brought up by his maternal grandmother for the first seven years of his life.\nIn the autumn of\n1943\nBrian began his schooling at Spring Hill Infants School, Accrington. Brian didn't spend all his primary education at this school for he attended the Peel Park Infants in Accrington in\n1945\n-\n46\n. In the summer of\n1946\nthe family moved into a small terraced house in Fife Street, Accrington and shortly after, Brian attended Spring Hill County School. Spring Hill school was built in\n1899\nbut the infant school was only built in\n1932\n. Brian's performance at school was outstanding and, in\n1950\n, he won a place at Accrington Grammar School. The famous mathematician\nHarold Davenport\nhad been educated at this school thirty years before Hartley began his studies there\n[\n3\n]\n:-\nThe headmaster, Mr Bernard Johnson, described\n[\nHartley\n]\nas \"a boy of most unusual ability and power of concentration\" and said that he did not remember \"any pupil in over\n30\nyears' teaching experience who was superior to him. His results in the General Certificate were phenomenal, easily a record for the school.\" Like many boys good at mathematics, Brian also excelled at chess. Usually top of the school chess table, he became captain of the school chess team, won local championships and played for the Lancashire team. He was one of the school's most enthusiastic musicians; this early love showed itself principally in trumpet playing and jazz.\nHartley loved sports, particularly cycling and running. I\n[\nEFR\n]\nknew Brian quite well and he told me about his love for both cycling and running. There were different aspects to liking these sports for Brian. He was a natural sportsman taking delight in exercise but he also loved the outdoors and the countryside, particularly the hills. There was yet another aspect that Brian loved which was his natural competitive spirit so that when he was at school he enjoyed both the training and the competition that came from being a member of the cross-country team. He was also a member of the local Cycling Club when he was at school in Accrington. When I knew Brian after he became a lecturer he often came into the department on a Monday and told us about the long, often over\n50\nmile, cycle run he had enjoyed on Sunday.\nHis results in the General Certificate of Education mentioned in the above quote were Advanced Level in Mathematics, Physics and Chemistry all passed with distinction in\n1956\n. Ian Stewart, one of his doctoral students, described Hartley's school years\n[\n5\n]\n:-\nHoliday jobs included working in a pie factory and a cotton mill, where he had to jump into tubs of raw cotton to pack them down. At\n15\n, he became one of the youngest people to be awarded a scholarship to King's College, Cambridge. Arriving as a\n17\n-year-old he planned to study chemistry but after attending research lectures given by the mathematician\nPhilip Hall\nhe switched.\nIn fact Hartley was awarded two scholarships to attend university, a State Scholarship based on his outstanding results in the General Certificate of Education Advanced Level papers, and a Major Scholarship in Natural Sciences at King's College, Cambridge, won in examinations taken in December\n1956\n. He could have either read mathematics or natural sciences at this stage but, after being invited to King's College to discuss his options with\nAlbert Ingham\n, the Director of Studies in Mathematics at King's, he made the choice that mathematics was for him and in October\n1957\nhe matriculated at Cambridge. At this stage Hartley entered a Mathematics Faculty which was full of world-leading researchers. There was\nAbram Besicovitch\n, who retired one year after Hartley began his studies and was replaced as\nRouse Ball\nProfessor of Mathematics by\nHarold Davenport\n. There was\nPhilip Hall\nat King's College who, by that time, held the Sadleirian Chair but did not supervise undergraduates. In addition there was\nWilliam Hodge\nwho was Lowndean Professor of Astronomy and Geometry. Also lecturers in the Mathematics faculty at this time were\nFrank Adams\n,\nMichael Atiyah\n,\nJ W S\n(\nIan\n)\nCassels\n, Peter Swinnerton-Dyer,\nJohn Arthur Todd\nand\nChris Zeeman\n.\nHartley excelled in the Cambridge Mathematical tripos, taking Part I in\n1958\nand Part II in\n1960\n. He studied hard but also found time to keep up his sporting interests. He was Secretary of the Cambridge University Cycling Club, representing the Club in its annual competition with Oxford University in\n1960\n,\n1961\nand\n1962\n. In the summer of\n1960\n, after taking the Part II examinations, Hartley went cycling in Scandinavia with a group of friends, cycling to the Artic Circle and back. At a dance at Christmas\n1960\n, Hartley met Mary E Mawer. They were married in the summer of\n1962\nand, at this time, with Hartley living in Memorial Court, Clare College, Cambridge, the Master of Clare offered them the Master's Lodge for their reception. Brian and Mary had two children, Catherine Frances Hartley\n(\nborn in January\n1972)\nand Christine Elaine Hartley\n(\nborn in April\n1974)\n. Let us return to pick up the story of Hartley's Cambridge career.\nIn June\n1961\nHartley took the examinations for Part III of the Mathematical tripos. He was awarded distinction, as was his fellow student Trevor Hawkes who later became a colleague and is one of the authors of\n[\n3\n]\n. He then began research on group theory advised by\nPhilip Hall\n. In December\n1961\n, while only beginning to undertake research, Hartley was elected to a Research Fellowship at Clare College. As a fellow, he lived in Memorial Court, as we noted above. After he was married in the summer of\n1962\n, Brian and Mary moved into a house on Blinco Grove on the outskirts of the city close to Homerton College. Hartley's\n127\n-page Ph.D. thesis\nThe stability group of a series of subgroups\nwas submitted in\n1964\nbut before that, in May\n1963\n, he had submitted a paper jointly written with\nPhilip Hall\n, with the same title as his thesis to the\nLondon Mathematical Society\n. The paper was revised in August\n1965\nand published the following year.\nKarl Gruenberg\nwrote in a review of the paper:-\nThere is a wealth of interesting and illuminating detail.\nIn fact Hartley's first published paper was\nThe order-types of central series\nwhich appeared in\n1965\n.\nKurt Hirsch\nwrote in a review that:-\nAll the proofs are given by explicit constructions, some of them quite ingenious.\nHartley spent the year\n1964\n-\n65\nin Chicago which at that time was a world centre for algebra with many leading ring theorists on the staff such as\nAdrian Albert\n,\nYitz Herstein\n,\nIrving Kaplansky\n, who was the departmental chairman, and\nSaunders Mac Lane\n. Although in a different area of group theory from Hartley,\nJohn Thompson\nwas also at Chicago and had just gained world fame with his\n1963\npaper, written with\nWalter Feit\n, proving all nonabelian finite simple groups were of even order. During the year in Chicago, Hartley enjoyed the music scene, both classical and jazz, and continued his love of the outdoors learning to ski and going on camping holidays. He spent the following year at the Massachusetts Institute of Technology where he was appointed as C L E Moore Instructor.\nReturning to England, he was appointed to the University of Warwick in\n1966\n. This was a new university which took in its first undergraduates in October\n1965\n. On the staff were\nChris Zeeman\n, the head of the Department of Mathematics, David Epstein, Roger Carter,\nSandy Green\n, Luke Hodgkin, Brian Sanderson and Ralph Schwarzenberger. I\n[\nEFR\n]\nbecame a postgraduate student at Warwick in October\n1965\nstudying for an M.Sc. advised by Roger Carter.\nSandy Green\nwas given the task of recruiting algebraists onto the staff for the academic year beginning in October\n1966\nand, after taking advice from\nPhilip Hall\n, invited Stewart Stonehewer, Trevor Hawkes and Brian Hartley. All accepted and Stonehewer and Hartley took up their appointments for the academic year\n1966\n-\n67\n. With these new appointments it was an even more exciting place for an algebraist and I continued to study for a Ph.D. advised by Stewart Stonehewer. I submitted my Ph.D. thesis\nClasses of Generalised Nilpotent Groups\nin\n1968\nand Hartley was appointed as the internal examiner. I remember my Ph.D. oral when Brian said he had proved a number of the same results that I had in my thesis but, since he had never got round to publishing them, I couldn't be expected to know that. He was a wonderful examiner, looking to see how I could develop the ideas of my thesis further, being kind and positive. After the oral, Brian invited me to dinner and I spent a very enjoyable evening with him and Ian Stewart, Brian's first Ph.D. student.\nExcept for spending\n1969\n-\n70\nat the Australian National University in Canberra, Australia and\n1974\n-\n5\nin Madison, USA, at the University of Wisconsin, Hartley remained at Warwick until he was appointed to a chair in Manchester in\n1977\n. His only book\nRings, modules and linear algebra\n(\nwritten with T O Hawkes\n)\n, written in his early years at Warwick and published in\n1970\n, became a widely used undergraduate text. You can read extracts from three reviews of this book at\nTHIS LINK\n.\nAlthough Hartley was appointed to the University of Manchester in\n1977\n, he had been one of the two main organisers of the\n1977\n-\n78\nWarwick Symposium on Infinite Groups and Group Rings. He spent much time at Warwick during this year and again I\n[\nEFR\n]\nwas able enjoy his company since I took sabbatical leave in\n1977\n-\n78\nand spent most of the year at the Symposium. It wasn't until the spring of\n1978\nthat Hartley and his family moved to Didsbury, about\n5\nkm south of the University of Manchester. This was an excellent location for Hartley who cycled daily to the University from his home along fairly minor roads. His contribution to the University of Manchester was a major one. He organised a weekly algebra seminar, brought many leading algebraists to Manchester as visitors, and supervised many Ph.D. students.\nHe continued with his love of travelling and spent time at the University of Utah in\n1981\n-\n82\n, the University of Singapore in\n1985\n, and the University of Minia, Egypt, in\n1984\nand\n1985\n. In\n1989\nhe visited the Mathematical Sciences Research Institute, Berkeley, California at Easter, Padua and Moscow in the summer, and East Berlin and Barcelona in the autumn.\nHis over\n100\npublications are almost all on group theory. If group rings are considered a part of group theory, then Hartley only wrote two papers which were not on group theory, one being on Lie algebras and the other on cryptography and large primes. His main topic was locally finite groups where he used his wide knowledge of finite groups in proving properties of infinite groups which were in a sense close to finite. A locally finite group is a group in which every finite set of elements is contained in a finite subgroup. The study of locally finite groups began with\nIssai Schur\n's result that a periodic linear group is locally finite. He collaborated with many mathematicians and loved working out ideas with them on a blackboard. In fact he wrote papers with over\n50\ndifferent mathematicians.\nRoger Bryant, a colleague at Manchester, described Hartley as\n[\n5\n]\n:-\n... a straightforward personality. Talked directly with everyone. No airs and graces: taxi-driver, research student, whatever. However, he stuck to what he believed in.\nHartley's interests outside mathematics, and there were many, are described by Ian Stewart as follows\n[\n5\n]\n:-\nBrian was also a musician. As a teenager he learned the trumpet. He played in St Catherine's Military Band, Accrington, and Cambridge University first Orchestra; he once performed at a mathematics conference but as he had become a little rusty, part way into the piece he and his accompanist declared they had merely been tuning up. They started again, with greater success. Brian was an outdoor person. In his younger days he ran with Ron Hill, who later competed in several Olympic marathons. The Hartleys owned a series of tandems, but Mary\n[\nhis wife\n]\ntended to fold her arms and sing as they went up hills, leaving Brian to do all the work. They both took up cross-country skiing, ice-skating, and horse-riding. The whole family enjoyed camping. Above all, Brian and Mary delighted in hill walking, which occupied most weekends.\nThe authors of\n[\n3\n]\nwrite:-\nHis intellectual energy, enthusiasm for algebra, direct manner and dry sense of humour endeared him to the many mathematical friends he made around the world. He was devoted to mathematics and gave generously of his time and energy in support of younger colleagues.\nLet me\n[\nEFR\n]\nadd a comment of my own. Brian was a very practical person who was good with his hands. If the washing machine broke down, then he would mend it. When I expressed my surprise, Brian explained that one could do anything, \"just get a book that tells you how to do it,\" he said. This positive attitude was not only good for mending washing machines, it must have contributed to his mathematical success too. The last time I met with Brian was at the 'Infinite groups\n1994\n' conference held in Ravello, Italy,\n23\n-\n27\nMay\n1994\n. Ravello is a stunningly beautiful town on the Amalfi coast and Brian loved being there. He gave the talk\nLocally finite groups whose Sylow subgroups are Chernikov\nat the conference and his main aim in this talk was to describe results obtained by S D Bell at the University of Manchester. Brian was the chair of the session in which I delivered my paper and he discussed it with me afterwards, as always making helpful suggestions. In Ravello, Brian told me about the NATO Advanced Study Institute on Finite and Locally Finite Groups he was helping to organise in Istanbul, Turkey, which was be held in August of that year. He was excited about his trip to Istanbul, and also about the conference with around\n100\nparticipants he was expecting from many countries. It was a great shock to me to hear of Brian's death just over a month after he returned from the Istanbul conference.\nIn fact Brian died walking in the hills that he loved. There was a mountain in northern England that Brian always wanted to climb, namely Helvellyn, and he decided to try it before he got too old. He did make the top but collapsed with a heart attack on the way down.\nThe picture of Brian Hartley above was taken in August\n1993\nat the Groups Galway / St Andrews Conference, held in Galway, Ireland.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}