{
  "nome_completo": "Bronius Grigelionis",
  "nome_curto": "Bronius Grigelionis",
  "ano_nascimento": "1935",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grigelionis/",
  "lugar_nascimento": "Iciūnai, near Vaškai, Lithuania",
  "lugar_morte": "Vilnius, Lithuania",
  "biografia": "Bronius Grigelionis\nwas born in Iciūnai, a village near the town of Vaškai in northern Lithuania. His parents, Ignas Grigelionis\n(1894\n-\n1973)\nand Ona Valeikaitė\n(1905\n-\n1986)\n, were traditional farmers. When Ignas Grigelionis was young, he participated in the Lithuanian Wars of Independence as a partisan and was awarded two medals\n(\nOrder of Vytautas Didysis and Order of Independence\n)\n. In\n1930\nIgnas Grigelionis married Ona Valeikaitė from the village of Tetervinai, and they had eleven children\n(\nonly nine of them grew up to adulthood, six boys and three girls\n)\n. Bronius spent his childhood on a farm, so together with brothers and sisters they were constantly helping their parents with agricultural work. When it was time for Bronius to start school, Ignas and Ona were wealthy enough to pay for his education. So Bronius, together with his other siblings, attended Vaškai primary school. Before starting his schooling Bronius had already learnt how to read and count, so his teacher advised him to entry directly into second grade. He began his primary schooling in\n1942\n, moving on to middle school in Vaškai in\n1944\n.\nHowever, difficult historical circumstances started affecting the family's life. In\n1940\nRussia occupied Lithuania and Bolsheviks began repressions against teachers and intelligentsia\n(\neducated people\n)\n: one teacher from Bronius's school was deported to Siberia, and another was executed. People hid from the government terrors and moved from cities to villages. A year later German forces, which were no better than Russians, invaded and began controlling Lithuania. The Germans visited farms\n(\nincluding Bronius's home\n)\nand nationalized their property, such as animals or crops. After such repressions by the government, Bronius's family lost much of their income, and hence after Bronius graduated from Vaškai middle school his parents did not have the money to pay for his further education. For a year Bronius had helped his father to work on a farm, then went to live at the home of his aunt in the town of Žeimelis until he finished high school.\nWhen Bronius was asked about the moment he realized he had a talent for mathematics, he said that he felt extremely thankful for his teachers. According to Bronius, at Žeimelis High School which he entered in\n1949\n, he had a wonderful mathematics teacher Motiejus Gudynas who used to give separate tasks for students according to their abilities. He noticed that Bronius and his friend Vincentas Dienys\n(\nnow Dr. habil. in physics\n)\nwere talented students, so he encouraged them to prepare to take part in the mathematical olympiads. Together with Dienys, Bronius participated in national mathematical olympiads, in which Bronius took second place when he was in\n10\nth grade and first place in\n11\nth grade in\n1954\n[\n4\n]\n:-\nThe winner of the competition received a special prize, an impressive trip to Kiev, the city where he was destined to return later in his life.\nWhile Bronius was studying in school, all of his classmates had joined the Komsomol\n(\na political youth organization in Soviet Russia\n)\n. He was the only boy in his class who was not part of that organization, even though the government strongly encouraged everyone to join.\nIn\n1954\nBronius graduated from Žeimelis High School with a Silver Medal\n(\nthe second highest honour in the Soviet Union\n)\n. He had no doubt what he wanted to study. Without the need to take any entrance examinations he was admitted into Vilnius University's Physics-Mathematics faculty to study mathematics. Bronius's brother Stasys had given him some of his books and lecture notes from the earlier mathematics courses before he began his studies, because he had previously been a mathematics first year student himself. While studying, Bronius became a mathematics tutor for younger students who were struggling with the subject. He did this as a means of earning a living throughout his time as an undergraduate. He also sang in the University men's choir. In his second year he joined a\nprobability theory\nand\nnumber theory\nextracurricular club, organized by professor\nJonas Kubilius\n. His first task was to analyze a book on mathematical statistics and explain it to his fellow classmates. While reading the book Bronius became very curious about probabilistic number theory and later wrote his first scientific paper\nThe distribution of values of arithmetic multiplicative functions\n(\nLithuanian\n)\n(\nwhich was published in\n1960)\nfor his bachelor's thesis. During his five years of studying he passed all his examinations at the highest possible grades and in\n1959\nhe graduated from Vilnius University with honours.\nFollowing graduation, he was given a position at the Institute of Physics and Mathematics\n(\nit has since been renamed to the Institute of Mathematics and Informatics\n)\nat the Academy of Sciences. Bronius continued his education as a post-graduate student. His scientific advisor became professor\nBoris Vladimirovich Gnedenko\nfrom the University of Kiev and he went to Ukraine to write his PhD thesis. When\nGnedenko\nreturned to the Lomonosov Moscow State University in\n1960\n, Bronius had to go with him to Moscow. In Russia he met a lot of like-minded academics, who were also sceptical about Communist ideas and were not part of the political party. Bronius had a great opportunity to participate in various special mathematical courses and scientific seminars, where he gained knowledge about superharmonic functions and supermartingales. He also attended a seminar on\nMarkov\nProcesses by\nEugene Borisovich Dynkin\n, which later on became an additional topic for his research. Bronius was interested in studying the theory of probability, measure and integral theory and mathematical statistics. His second paper written in\n1962\nwas titled\nOn the asymptotic expansion of the remainder term in case of convergence to the Poisson law\n(\nRussian\n)\n. In total Bronius published five papers that year, all written in Russian, on topics such as the limit theorem and\nPoisson\nprocesses. After three years of studying at Lomonosov Moscow State University, in\n1963\nhe defended his PhD thesis\nLimit Theorems for Sums of Step Random Processes\n. At that time Bronius became extremely interested in the theory of random processes and modern probability theory, so he continued his research on these topics and in\n1966\nhe published\nOn the Stefan problem and optimal stopping rules for Markov processes\n(\nRussian\n)\n. Two following papers were also related with optimal stopping of\nMarkov\nprocesses, the second one being\nThe optimal stopping of Markov processes\n(\nRussian\n)\n, which was reviewed by John Leighton Denny:-\nThe author extends his earlier work with A N Sirjaev\n[\nTeor. Verojatnost. i Primenen.\n11\n(1966)\n,\n612\n-\n631]\non the equivalence of the generalized Stefan problem to the problem of finding optimal stopping times for homogeneous Markov processes. The above cited work contains results for\nMarkov\nprocesses with continuous paths and this paper obtains analogous results for discontinuous paths. As an application, the problem of testing a simple hypothesis against a simple alternative in a\nPoisson\nprocess is considered.\nIn\n1968\nBronius defended his thesis for the degree of doctor of physical and mathematical sciences\n(\nnow, habilitated doctor\n)\non\nStudies of random processes\n(\noptimal stopping, effective markovity criteria\n)\n[\n4\n]\n:-\nIn his doctoral thesis, he explored fundamental optimal stopping problems of\nMarkov\nprocesses. The obtained criteria of optimal stopping and markovity became classical results of sequential analysis.\nIt is worth mentioning, that Bronius was the youngest\nhabilitated\ndoctor in Lithuania at that time. In\n1970\nhe became the head of the mathematical statistics section of the Institute and after a year he wanted to become a member of the\nLithuanian Academy of Sciences\n, but since he was not in the Communist party, he was not allowed. Despite these difficulties, he was happy about his decision not to join the Communist party. When later he was asked about this topic Bronius answered\n[\n5\n]\n:-\nNo, I did not lose anything, I just won, because I saved my freedom of thought. They did not let me go to America. But they would let me go to other countries. I was sent personal invitations, also the travel expenses were paid. Without any restrictions I could participate in the mathematical symposiums, which were held in USSR. There I could meet and talk to people from abroad.\nOfficially Bronius only became a member of\nLithuanian Academy of Sciences\nin\n1987\n. In the meantime Bronius was actively involved in research, lecturing, and organising various seminars. He was also a member of the International Statistical Institute, the Bernoulli Society; later he became a member of the Lithuanian Catholic Academy of Science.\nIn the late\n1980\ns Lithuanians wanted to regain their independence and for this purpose formed the Reform Movement of Lithuania, officially known as Sąjūdis. In the book\nLietuvos istorija\n(2013)\nwritten by Alfonsas Eidintas, Alfredas Bumblauskas, Antanas Kulakauskas and Mindaugas Tamošaitis it is said that\n[\n1\n]\n:-\nThe organisation was open for every Lithuanian to join and everyone could participate in the events they organise. Every participant could feel, that he is responsible for the future of Lithuania.\nSince Grigelionis was always sceptical about communism, the idea of being independent was very appealing and he became the only academician on the council of the organisation. He was the leader of Sąjūdis group of the\nLithuanian Academy of Sciences\n, whose main goal was to reform education and academic studies.  Even though most of the members became politicians, Grigelionis remained a scientist. He travelled around the world, for example to USA, Canada, China, Japan, etc., and delivered lectures at various universities in these countries. He attended conferences in Poland, Sweden, Hungary, and France in\n1980\n, Poland, and the Federal Republic of Germany in\n1981\n, India, and France in\n1982\n, Poland, and the Federal Republic of Germany in\n1983\n, the Federal Republic of Germany, and France in\n1984\n, Italy in\n1985\n, Poland in\n1986\nand the Federal Republic of Germany in\n1987\n.\nAs a lecturer, Grigelionis was especially liked by his students. According to his former student Vilijandas Bagdonavičius\n(\nborn\n1949)\n, Grigelionis was very concise and emphasized the importance of proofs. The best students on the course wanted to be taught by the professor, however only two of them could get him as their scientific advisor. In total nineteen of Grigelionis' students defended their PhD thesis and six of them became habilitated doctors. Nowadays you can meet former Grigelionis students giving lectures at almost every international conference on random processes and probability theory.\nBronius met his future wife Ona Jurgaitytė at his sister's wedding. Later on the couple got married on\n25\nJuly\n1965\nand had two children. His wife started working as a teacher after her studies, and also took on all of the housekeeping duties in her free time, as well as raising their children, Gintautas\n(\nborn\n24\nMarch\n1967)\nand Milda\n(\nborn\n9\nMay\n1972)\n. Gintautas studied physics at Vilnius University and later at the Royal Institute of Technology in Sweden. He was awarded a doctorate in theoretical physics. Milda studied psychology at Vilnius University where she was awarded a Master's Degree.\nGrigelionis always had strong moral principles and was patriotic. Besides his scientific career, he never forgot about his native area Pasvalys and together with his colleague Antanas Apynis was keen on organizing mathematics olympiads where young mathematicians from Pasvalys would strive to win the Cup of Grigelionis. The olympiads continued to take place after his death.\nHis book\nStudent's t-distribution and related stochastic processes\nwas published in\n2013\n. It is a short work of\n99\npages and Grigelionis gives the following summary:-\nThis brief monograph contains a deep study of the infinite divisibility and self-decomposability properties of central and non-central\nStudent\n's distributions, represented as variance and mean-variance mixtures of multivariate Gaussian distributions with the reciprocal gamma mixing distribution, respectively. These results permit to define and analyse\nStudent\n-\nLévy\nprocesses as Thorin subordinated Gaussian-\nLévy\nprocesses. Analogously,\nStudent\n-\nOrnstein\n-\nUhlenbeck\n-type processes are described. A wide class of one-dimensional strictly stationary diffusions with the\nStudent\n's t-marginal distribution is defined as the unique weak solution for the stochastic differential equation. Extreme value theory for such diffusions is developed. A flexible and statistically tractable\nKolmogorov\n-\nPearson\ndiffusions are also described. Using the independently scattered random measures, generated by the bivariate centred\nStudent\n-\nLévy\nprocess, and stochastic integration theory with respect to them, it is defined as an univariate strictly stationary process with the centred Student's t marginals and the arbitrary correlation structure. As a promising direction for future work in constructing and analysing of new multivariate\nStudent\n-\nLévy\ntype processes, the notion of\nLévy\ncopulas and the related analogue of Sklar's theorem is explained.\nLet us end this biography with this tribute to Grigelionis from\n[\n4\n]\n:-\nThe entire life of Bronius Grigelionis was devoted to Lithuania and the science of mathematics. Here is a quotation from a book \"Bronius Grigelionis\" compiled by A Apynis in\n2005\non the occasion of the\n70\nth anniversary of the Academician:\nWhatever the definition of mathematics is, queen or servant of sciences, and whatever the country or the epoch is, the standard of mathematical culture marks significantly the overall standard of culture. By cherishing and fostering mathematical skill like a divine gift, we amplify the greatest treasure of the nation, its intellectual potential, which allows us to stand proudly side by side with civilized nations.\nThese words should inspire us to remember this great person, whereas young people should be encouraged to continue his work.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}