{
  "nome_completo": "R Bruce Kellogg",
  "nome_curto": "Bruce Kellogg",
  "ano_nascimento": "1930",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kellogg_Bruce/",
  "lugar_nascimento": "Chicago, Illinois, USA",
  "lugar_morte": "Landrum, South Carolina, USA",
  "biografia": "Bruce Kellogg\n's parents were Ernest Kellogg and Helen Hollowell. Ernest Kellogg\n(\nborn\n1902)\n, whose parents were Royal S Kellog and Clara Fry, was from Yonkers, New York. He was an instructor in the department of agricultural journalism and was studying for his master's degree at Wisconsin when he married Helen Hollowell on\n3\nSeptember\n1926\n. Helen, of South Bend, Indiana, had studied home economics at Wisconsin and graduated in the Class of\n1927\nhaving written a thesis entitled\nHistory of Women's Magazines in the United States\n. In\n1928\n, Ernest accepted a position as agricultural engineer with the eastern division of the National Lumber Manufacturers' association, New York. His work involved promoting better farm buildings from Maine to Alabama and as far west as Central Ohio. On\n21\nJanuary\n1929\nHelen and Ernest Kellogg's daughter Alice Elizabeth was born. By\n1930\nthe family were living in Chicago, Cook, Illinois when their son Royal Bruce Kellogg was born. He did not use the name Royal, but was always known as Bruce.\nKellogg spent part of his youth in Washington and graduated from the Western High School in\n1948\n. He was awarded a bachelor's degree from Massachusetts Institute of Technology in\n1952\n, and completed his Ph.D. at the University of Chicago in\n1958\nunder the supervision of\nMarshall Stone\nand\nLars Gårding\n. His thesis was\nHyperbolic Equations with Multiple Characteristics\nand he published a paper with the same title in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1959\n. In this paper, submitted to the editors in February\n1957\n, Kellogg writes:-\nThe results of this paper were submitted in a thesis to the University of Chicago in partial fulfilment of the requirements for the degree of Doctor of Philosophy. We wish to acknowledge our gratitude to Professor\nLars Gårding\nwho suggested this problem and whose encouragement and advice made this paper possible.\nAfter graduating, Kellogg worked for the Westinghouse Electric Corporation as a research scientist in the nuclear power industry before joining the Mathematics Department of the University of Maryland in\n1966\n. During the years he worked for Westinghouse they were the leading maker of commercial nuclear reactors, also producing reactors for U.S. Navy submarines. While working at Westinghouse's Bettis Atomic Power Laboratory, Kellogg published papers such as:\n(\nwith L C Noderer\n)\nScaled iterations and linear equations\n(1960)\n;\nAnother alternating-direction-implicit method\n(1963)\n;\nDifference equations on a mesh arising from a general triangulation\n(1964)\n;\nAn alternating direction method for operator equations\n(1964)\n; and\n(\nwith J Spanier\n)\nOn optimal alternating direction parameters for singular matrices\n(1965)\n.\nIn\n1966\nKellogg was appointed to the Institute for Fluid Dynamics and Applied Mathematics of the University of Maryland, College Park. He worked there for\n34\nyears until he retired in\n2000\n. Charles R Johnson, whose middle name was Royal, was a colleague of Bruce Kellogg at Maryland. He writes\n[\n3\n]\n:-\nPerhaps we were fated to be friends by our common initial associated with the same unused name!\nJohnson writes of Kellogg\n[\n3\n]\n:-\nR Bruce Kellogg was an excellent mathematician who worked significantly in PDE's\n(\nboth theoretical and in the modelling of real phenomena\n)\n, but, like many mathematicians, was drawn deeply into matrix analysis by his initial interest. Like other serious contributors, he did mathematics because he enjoyed being seduced by the never ending mysteries, not employment or other artificial stimuli.\nThe authors of\n[\n1\n]\nwrite about Kellogg's most significant mathematical contributions\n[\n1\n]\n:-\nDuring the\n1970\ns, he became one of the leading figures in the development of the mathematical theory for finite element methods. A major theme in Bruce's opus is the numerical solution of singular perturbation problems. His\n1978\npaper with A Tsan on difference approximations for such problems is a seminal work in the field, and he continued this research until the end of his life. Another major theme of his research was the behaviour of solutions to partial differential equations near corners and interfaces. His\n1976\nregularity result\n(\nwith John Osborn\n)\nfor the\nStokes\nequations in a convex polygon is still frequently referenced today.\nKellogg published over\n100\npapers having\n46\nco-authors and, by June\n2013\n,  they had received\n837\ncitations by\n661\nauthors. The largest number of citations is for his paper, co-authored with John E Osborn,\nA regularity result for the Stokes problem in a convex polygon\n(1976)\n. Let us look at a few of these papers which he published while at the University of Maryland. Here is his own summary to\nA nonlinear alternating direction method\n(1969)\n:-\nAn alternating direction iteration method is formulated, and convergence is proved, for the solution of certain systems of nonlinear equations. The method is applied to a heat conduction problem with a nonlinear boundary condition.\nD F Mayers writes in a review of\nOn the spectrum of an operator associated with the neutron transport equation\n(1969)\n:-\nBy formulating the iteration process in a general space, it is shown that the iteration operator is the sum of a compact operator and a contraction operator. The results also prove that the transport equation itself has a unique solution for the boundary conditions considered.\nE Kreyszig writes in a review of\nSingularities in interface problems\n(1971)\n:-\nThe author determines the behaviour of the solutions of second order elliptic differential equations in two independent variables at points where two interface curves cross, where an interface curve meets the boundary, or where an interface or boundary has a discontinuous tangent. The results are then applied to similar problems in three dimensions, and the\nLaplace\noperator is considered on polyhedral domains with polyhedral interfaces.\nKellogg's own introduction to\nHigher order singularities for interface problems. The mathematical foundations of the finite element method with applications to partial differential equations\n(1972)\nbegins:-\nWe consider interface problems for an elliptic partial differential equation in two independent variables. Such problems arise in engineering problems when, for example, one is studying the distribution of heat or electric potential in a composite medium consisting of several different materials. The mathematical problem has been studied, for smooth interfaces, by many people. We consider the problem in a polygonal domain, with polygonal interfaces. Our object is to represent the solution to the problem as the sum of a finite number of special solutions, which may be considered as known, plus a remainder term whose regularity depends on the regularity of the data of the problem.\nKellogg's own summary to\nDiscontinuous solutions of the linearized, steady state, compressible, viscous, Navier-Stokes equations\n(1988)\nis as follows:-\nThe compressible steady state viscous\nNavier\n-\nStokes\nequations in two space dimensions are considered. The equations are linearised around a given ambient flow field. It is shown that the linearised equations are not, in general, elliptic. Jump conditions across a possible curve of discontinuities of a solution of the linearised system are derived. In a particular case, a discontinuous solution of the linearised system is constructed.\nKellog retired in\n2000\nand at that time he was made Professor Emeritus of the Institute for Physical Sciences and Technology, Department of Mathematics, University of Maryland, College Park. He moved to Landrum, South Carolina, where he continued to be an active researcher taking on the role of Adjunct Professor at the University of South Carolina. He continued to publish high quality papers, both single-authored and with different co-authors. Here are a few examples of his post-retirement papers, mostly with Kellogg's own summary. He summarises\nSome simple boundary value problems with corner singularities and boundary layers\n(2006)\nas follows:-\nSome boundary value problems for a second-order elliptic partial differential equation in a polygonal domain are considered. The highest order terms in the equation are multiplied by a small parameter, leading to a singularly perturbed problem. The singular perturbation causes boundary layers and interior layers in the solution, and the corners of the polygon cause corner singularities in the solution. The paper considers pointwise bounds for derivatives of the solution that show the influence of these layers and corner singularities. Several recent results on this problem are surveyed, and some open problems are stated and discussed.\nHe co-authored several papers with Martin Stynes as, for example,\nSharpened bounds for corner singularities and boundary layers in a simple convection-diffusion problem\n(2007)\n. Here is the authors' summary:-\nA singularly perturbed convection-diffusion problem posed on the unit square is considered. Its solution may have exponential and parabolic boundary layers, and corner singularities may also be present. Sharpened pointwise bounds on the solution and its derivatives are derived. The bounds improve bounds near an outflow corner of the problem that were derived in an earlier paper of the authors. An application is made to an error analysis of a finite element method for the problem.\nAnother paper co-authored with Martin Stynes is\nLayers and corner singularities in singularly perturbed elliptic problems\n(2008)\nin which the authors summarise recent advances in the analysis of numerical methods for singularly perturbed elliptic problems. He co-authored\nAn enriched subspace finite element method for convection-diffusion problems\n(2010)\nwith Christos Xenophontos:-\nWe consider a one-dimensional convection-diffusion boundary value problem, whose solution contains a boundary layer at the outflow boundary, and construct a finite element method for its approximation.\nHis last paper, co-authored with Sebastian Franz and Martin Stynes, was\nGalerkin and streamline diffusion finite element methods on a Shishkin mesh for a convection-diffusion problem with corner singularities\n(2012)\n. Nicolae Pop writes in a review:-\nThis paper analyzes a\nGalerkin\nfinite element method and a streamline diffusion method that both use bilinear elements on a common mesh. The problem is subdivided by treating separately the diffusion and convection terms that appear in the associated bilinear form. It is shown that, measured in an e-weighted energy norm, the\nGalerkin\nfinite element solution attains the same order of accuracy as the bilinear nodal interpolant. It extends this analysis to the streamline diffusion finite element method and investigates how the presence of the corner singularities influences the choice of the stabilising parameters in this method. Finally, it describes some numerical experiments that verify the accuracy of the two finite element methods.\nKellogg had married Claire White; they had four children Louise, Gregory, David, and Renée. The marriage had ended in divorce and, in\n1990\n, he married Mary Jo Walker Wang. While he was working at the University of Maryland, Kellogg had lived at\n7504\nHancock Avenue, Takoma Park, which is a suburb of Washington D.C. The Kelloggs sold their home in Takoma Park in March\n2001\n.\nKellogg died at the Smith Phayer Hospice House of the Carolina Foothills in Landrum, South Carolina. His final illness was short after being diagnosed with a brain tumour. Let us end this biography by quoting from the authors of\n[\n1\n]\n:-\nHis vast knowledge of various areas of mathematics, and beyond mathematics, together with his selfless attitude, made him an ideal colleague, collaborator, editor, and mentor, and inspired great affection in the many people who had the pleasure of interacting with him.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}