{
  "nome_completo": "Buqing Su",
  "nome_curto": "Buqing Su",
  "ano_nascimento": "1902",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Su_Buqing/",
  "lugar_nascimento": "Pingyang County, Zhejiang Province China",
  "lugar_morte": "Shanghai, China",
  "biografia": "Buqing Su\n, also spelled\nBuchin Su\n, was a mathematician, educator, and poet. He was born in Pingyang Country, Zhejiang Province in China on\n23\nrd September\n1902\n; his parents were farmers and his ancestors had come from Quanzhou. Although the family was poor, Su's parents still managed to send him to school; it is said that they sent white rice to the school in lieu of tuition fees. In\n1911\n, Su went to the First Primary School in Pingyang County, more than\n100\nmiles away, as a transfer student. In\n1914\n, he was admitted to the Zhejiang Provincial Tenth Middle School with excellent grades. Then he went to the Zhejiang Wenzhou High School.\nIn July\n1919\n, when Su was just\n17\nyears old. Mr Hong, the principal of the middle school sponsored him to go to Japan to study. After a month learning Japanese, he took the recruitment examination of Tokyo Higher Technical College and was admitted to the Department of Electrical Engineering with excellent results in February\n1920\n. He studied there from\n1920\nto\n1924\n. Although all his study materials were destroyed in the fire that followed the Great Kanto Earthquake of\n1923\n, Su succeeded in graduating from Tokyo Higher Technical College in March\n1924\n. He was admitted as a Chinese student in the Department of Mathematics, Tohoku Imperial University, with an excellent grade that ranked first among\n90\ncandidates with full marks in two courses. Su graduated from Tohoku Imperial University in\n1927\nand received his PhD from the university in\n1931\nfor a dissertation entitled\nThe relation between affine and projective differential geometry\n. When Su was in Japan, his research was very effective, and he was praised as \"the brilliant mathematical star rising above the eastern country\" .\nWhile at Tohoku Imperial University, Su met, and married, Yonako Matsumoto, the daughter of a member of university staff. The couple subsequently had eight children, and Yonako Matsumoto was one of the first Japanese to become a Chinese citizen.\nIn Japan, Su once said to his senior Jiangong Chen\n[\n1\n]\n:-\nAfter obtaining a PhD, we will go back to serve our motherland immediately, make suggestions for the development of the Department of Mathematics of Zhejiang University, and train more talents for the country.\nOn his return to China, Su initiated the development of modern mathematics in China by working with other mathematicians such as Jiangong Chen.\nWang Yuan\n, a famous mathematician and academician of the\nChinese Academy of Sciences\n, commented\n[\n1\n]\n:-\nModern mathematics research in China really started in the\n1930\ns.\nSu created the internationally recognized Chinese school of differential geometry, making outstanding contributions in affine differential geometry, projective differential geometry, general space differential geometry and projective conjugate network theory. Through his research on general surfaces, he discovered quartic algebraic surfaces of the third order\n(\ni.e. with the property that typical straight lines intersect the surface in three points\n)\nwhich aroused great excitement in the international mathematics world; the ◊ Su-cone⁄  was named after him. In the\n1940\ns he developed the theory of K-spreads\n(\nfamilies of K-dimensional\nmanifolds\n)\nin space. When he was in his seventies, Su started a new research direction in computational geometry when he used the mathematical idea of affine invariants to solve the practical problem of\nlofting\nof ships' hulls.\nSu often said\n[\n1\n]\n:-\nPersonal fame and family are secondary. What is important is to strive to make our country's scientific research and education continue to flourish in accordance with the requirements of the development of the times.\nUnder Su's leadership, his students published more than\n100\npapers in journals of the United States, Japan, Britain, France and other countries between\n1931\nand\n1949\n. In November\n1942\n, the Cambridge academic, Joseph Needham, who was director of the Sino-British Science Co-operation Office in Chongqing\n(\nthe capital of China at the time\n)\n, visited the Department of Mathematics at Zhejiang University, which he praised\n[\n3\n]\n:-\nYou are the Eastern Cambridge\nSu was elected to the\nAcademia Sinica\nin\n1948\n, and to the\nChinese Academy of Sciences\nin\n1955\n.\nIn\n1952\n, when universities across the country were reorganized, Su and his students from the Department of Mathematics of Zhejiang University all moved to Fudan University. Su served first as the Provost and then, in\n1978\n, he became the President of Fudan University.\nIn January\n1982\n, the National Collaborative Group on Computational Geometry was established under the leadership of Professor Su, with the participation of Zhejiang University, Shandong University, University of Science and Technology of China, Institute of Mathematics,\nChinese Academy of Sciences\n, and Fudan University. Since then, academic conferences and classes on computational geometry have been held every two years, providing theories and methods for high-tech projects in computer-aided design and manufacturing in China, and training a group of talented students who combine theory and practice.\nOn\n31\nst January\n1985\n, the Propaganda Department of the Zhejiang Provincial Party Committee appointed Su as honorary President of Wenzhou University. In\n1989\n, the Shanghai Society of Industrial and Applied Mathematics was established under Su's guidance and supervision. In\n1990\n, the China Society of Industrial and Applied Mathematics\n(\nCSIAM\n)\nwas established, and he was hired as a consultant. At various times he also served as vice chairman of the Chinese Mathematical Society, member of the sixth National Committee of the Chinese People's Political Consultative\n(1983\n-\n88)\n, vice chairman of the seventh and eighth National Committee of the Chinese People's Political Consultative Conference\n(1988\n-\n98)\n, and honorary chairman of the Democratic League Central Committee\n(1997\n-\n)\n, and Conference and deputy to the National People's Congress.\nDuring his career, Su published over\n160\nmathematical papers in domestic and international journals and more than\n20\nmonographs and textbooks on topics including projective curves, projective surfaces, and affine differential geometry. Su's main papers are included in\nSelected Works of Buqing Su\n(1991)\n. His books include\nThe General Projective Theory of Curves\n(\nEnglish translation\n1958)\n,\nAffine Differential Geometry\n(\nEnglish translation\n1983)\n, and, co-authored with Dingyuan Liu,\nComputational geometry\n,\nCurve and surface modeling\n(\nChinese\n1980\n; English edition\n1989)\n. Among his work, \"Geometry of K-spread Space and General Metric Space, Projective Curve Theory\" won the second prize of the first National Natural Science Award in\n1956\n. He won the\n1978\nNational Science Conference Award for\nA Program of Hull Lofting\n. His collaborative \"A Production Process of the Hull Form by the Curved-Surface Method\" won the second prize of the first National Science and Technology Progress Award in\n1985\n.\nSu passed away in Shanghai on\n17\nth March\n2003\n, at the age of\n101\n. Tributes praised him as\n[\n3\n]\n:-\nthe brilliant mathematics star in the Eastern country\", \"the first geometrician in the East\", and \"the king of mathematics.\nIn August\n2003\n, the International Society for Industrial and Applied Mathematics\n(\nICIAM\n)\nestablished the \"ICIAM Su Buqing Award\" to reward individuals who have contributed to the application of mathematics to economic growth and human development. In\n2004\n, the Chinese Society for Industrial and Applied Mathematics\n(\nCSIAM\n)\nestablished the \"CSIAM Su Buqing Applied Mathematics Award\".\nYou can see more about this award at\nTHIS LINK\n.\nIn\n2019\nasteroid\n297161\nSubuchin was named after him\n[\n15\n]\n.\nSu wrote more than\n500\npoems during his life. His poems revolve around science, love and friendship, closely connecting personal destiny with the worries of the family and the good of the country and nation. One example, written while at a friend's party is\n[\n16\n]\n:-\nHastily cups and plates are filled with joy,\ndo not let the talk of rice and firewood bring sorrow.\nThe spring breeze has already turned the grass green in front of the door,\nand we must endure the remaining cold and look ahead.\nAnother, written when Su was\n70\ngoes\n[\n17\n]\n:-\nThirty years ago in Guizhou, I was worried because of the singularity.\nNow I am old and I am happy to see my old friends competing for the top.\nSu once said\n[\n6\n]\n:-\nIt is no exaggeration to say that half of my knowledge and achievements are given by my wife.\nSu's Japanese wife once asked Su:-\nWhy are you studying mathematics so hard? Do you really think it is a lot of fun?\nSu replied:-\nMathematics is needed for Chinese development. At first I really thought it was not as interesting as listening to songs and dancing, but when you connect mathematics with national fate, you will find how rich and attractive this field is.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}