{
  "nome_completo": "Cahit Arf",
  "nome_curto": "Cahit Arf",
  "ano_nascimento": "1910",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arf/",
  "lugar_nascimento": "Salonika, Ottoman Empire (now Thessaloniki, Greece)",
  "lugar_morte": "Istanbul, Turkey",
  "biografia": "Cahit Arf\nwas born in Thessaloniki which, in\n1910\n, was a part of the Ottoman Empire. However, the Balkan War was fought by Serbia, Bulgaria, Greece, and Montenegro against the Ottoman Empire when Arf was two years old. Montenegro declared war on Turkey on\n8\nOctober\n1912\n, and the other members of the Balkan league declared war on Turkey\n10\ndays later. The Balkan allies were soon victorious. The Bulgarians defeated the main Ottoman forces, advancing towards Istanbul\n(\nthen called Constantinople\n)\n, and the Greeks occupied Thessaloniki. With the outbreak of fighting, Arf's family escaped to Istanbul.\nArf writes in\n[\n2\n]\nthat he went to school in Istanbul at the age of four:-\nI never played with other pupils in school. I was shy. Then I continued my education in the Besiktas Sultanisi. After a fire, we left Besiktas and we began to move from one place to another. At last we rented a house in Suleymaniye. Then I transferred to Istanbul Sultanisi. The same thing continued there too. My parents did not let me go out but the school was going well.\nIn\n1919\nArf's family moved again, this time to Ankara, but they returned to Istanbul for a short period before they finally settled in Izmir. Cahit Arf's interest in mathematics was stimulated during his school years in Izmir by a teacher who encouraged him to solve problems in euclidean geometry. In\n1926\nArf's father bought French francs when the currency was devalued and it became a cheaper option for the family to send Arf to school in France. His parents\n[\n2\n]\n:-\n... sent me to France to live with my uncle's friends. I registered at the St Louis Lycée there. I did not know much French. All I knew was the French that was taught in school. ... I got the best score in the mathematics exam and that's why I finished that three year lycée in two years but then my father did not have any more francs. I came back to Turkey.\nArf won a scholarship to continued his education in Paris and he returned to France, graduating from the École Normale Supérieure after spending two years there.\nReturning to Istanbul to be a school teacher rather than to complete his doctorate, Arf taught at the Galatasaray High School during\n1932\n[\n2\n]\n:-\nI was going to take the place of a teacher from France ... and do the work that he did. My salary was\n60\nTurkish Liras but the person whom I took the place of was getting paid\n600\nTurkish Liras.... I worked as an idealist for a year. Some teachers felt sorry for me. They were saying \"poor him. ... He is working for\n60\nLiras\". Probably because of that, I lost my idealism. ... At that time reforms were being made in universities so they offered me a position as an assistant professor. I accepted it and then I thought myself that I was successful.\nArf joined the Mathematics Department of Istanbul University. However he decided to continue his study of mathematics\n[\n2\n]\n:-\nIn the Lycée, I would ask myself which\n[\ngeometric problems\n]\ncould be solved with a ruler and which ones could not. Later, I learned the\nGalois\ntheorem and then I understood. ... At that time, I was thinking about making a list of the algebraic equations or\nGalois\nalgebraic equations that could be solved. That was my problem. ...\n[\nJordan\n]\nfound all the\ngroups\nthat could be solved. He wrote a thick book about that. I tried to read that book ... I could not read books. ... Anyway, I considered this problem as a project. It was only a project. I had done nothing about it yet. While I was busy with all these ideas, time passed. ... I thought that I could not deal with this project in Istanbul so I obtained permission from the university and went to Göttingen.\nIn\n1937\nhe went to the University of Göttingen to study for his doctorate under the supervision of\nHelmut Hasse\n. He completed his doctoral studies in\n1938\nobtaining, among other results, the theorem now known as the\nHasse\n-Arf theorem. He had studied at Göttingen through the very difficult period leading up to World War II but\nHasse\nasked him to remain there for another year to continue his work and during this period Arf's work produced what are today called the Arf invariants.\nArf returned from Germany to Istanbul University where he worked until\n1962\n. He was promoted to professor in\n1943\nand to ordinarius professor in\n1955\n. During this period he spent one year as a visiting professor at the University of Maryland and was honoured by being elected a corresponding member of the Mainz Academy.\nIn\n1963\nArf taught at Robert College in Istanbul. Then, between\n1964\nand\n1966\n, Arf worked at the Institute for Advanced Study at Princeton in the United States. After remaining in the United States for a further year spent visiting the University of California at Berkeley, he returned to Turkey in\n1967\nand joined the Middle East Technical University in Ankara. Arf retired in\n1980\nand lived in Istanbul.\nArf played a prominent role in establishing TUBITAK in\n1971\n, the Scientific and Technical Research Council of Turkey. He served as its president for many years from the time that it was established. From\n1985\nuntil\n1989\nhe was the president of the\nTurkish Mathematical Society\n.\nArf received many awards and prizes for his outstanding contributions to mathematics and for his most distinguished career including the Inonu award. Among the honours he received were honorary doctorates from the Black Sea Technical University, the Middle East Technical University and Istanbul Technical University.\nArf contributed to the education of many of the present day mathematicians in Turkey, not only by his lectures but also through illuminating discussions in conferences and seminars. Those who had the opportunity to come into close contact with Arf, were deeply influenced by his sincere devotion to mathematics and to science in general. Especially keen to help young mathematicians, he gave them very sound advice and generous encouragement. Arf's approach to mathematics was described by\nM G Ikeda\n[\n1\n]\n:-\nTo every problem, he has his own idea of approach. The characteristic of his approach is thoroughness; he always seeks invariants, and prefers explicit constructions rather than combination of existing theories. Once he determines his approach, he energetically tackles the problem and never gives up until he achieves his aim. If one studies Cahit Arf's works, which are full of originality and painstaking computations, one will surely wonder where Professor Arf gets his inspirations, and how he gets insight into most complicated computations.\nMuch of Arf's most important work was in\nalgebraic number theory\nand he invented Arf invariants which have many applications in\ntopology\n. His early work was on\nquadratic forms\nin fields, particularly fields of characteristic\n2\n. His name is not only attached to Arf invariants but he is also remembered for the\nHasse\n-Arf Theorem which plays an important role in class field theory and in\nArtin\n's theory of\nL\nL\nL\n-functions. In ring theory,\nArf rings\nare named after him.\nIn addition Arf worked in applied mathematics writing several papers on elastic plane bodies bounded by free boundaries and a paper on the algebraic structure of the cluster expansion in\nstatistical mechanics\n. Arf described this digression into applied mathematics had been done for the wrong reasons\n[\n2\n]\n:-\nI looked for applause. That's why I talked with engineers and tried to understand their work. ... Mustafa Inan was given a problem while he was making his doctorate. A bridge had collapsed in Belgium. The reason was not known. ...\n[\nMustafa\n]\nbuilt a model of that bridge from some material, he put loads on it and found the spots where it began to crack. It was possible to see the places where the tensions increased on that material. ...I took that problem ... I gave the formulas that would build that kind of profiles. ... I wrote five or six essays, which completed each other, about that problem. I was applauded ... but to do things for applause is not nice.\nArf presented a paper\nOn a generalization of Green's formula and its application to the Cauchy problem for a hyperbolic equation\nto the volume\nStudies in mathematics and mechanics\npresented to\nRichard von Mises\nin\n1954\n. Arf had met\nvon Mises\nin\n1933\nin Istanbul.\nAn International Symposium on Algebra and\nNumber Theory\nwas held in Arf's honour in Silivri from\n3\nto\n7\nSeptember\n1990\n. At an earlier conference on Rings and Geometry held in Istanbul in\n1984\n, Arf had presented a paper\nThe advantage of geometric concepts in mathematics\n.\nArf died after a heart attack and was buried in Istanbul, following a ceremony at Istanbul University.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}