{
  "nome_completo": "Carlo Emilio Bonferroni",
  "nome_curto": "Carlo Bonferroni",
  "ano_nascimento": "1892",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bonferroni/",
  "lugar_nascimento": "Bergamo, Italy",
  "lugar_morte": "Florence, Italy",
  "biografia": "Carlo Bonferroni\n's first interests were in music and he studied conducting and the piano at the Music Conservatory of Turin. However, his interests turned towards mathematics, encouraged by his father as Carlo Benedetti points out\n[\n9\n]\n:-\nBonferroni ... an excellent pianist and composer, came from the conservatory of music and it was his father who made him enrol at the Mathematics Faculty in Turin.\nBonferroni entered the University of Turin where he studied for his laurea under\nGiuseppe Peano\nand\nCorrado Segre\n. While an undergraduate, he read\nÉmile Borel\n's\nEléments de la théorie des probabilités\nⓉ\n(\nElements of probability theory\n)\nand noticed an error that Borel had made in a coin tossing problem. He wrote to\nBorel\nbut never received a reply, although he noticed that\nBorel\ncorrected the error in the second edition of his book. After the award of his doctorate, Bonferroni spent a year studying abroad at the University of Vienna and at the Eidgenössische Technische Hochschule in Zürich. He served in the army during World War I, as an officer in the engineers.\nAfter the war he was appointed to the post of assistant professor at the Turin Polytechnic, where he taught analysis, geometry and mechanics. His interest in financial mathematics came through working with\nFiladelfo Insolera\nwho had been appointed Professor of Financial Mathematics at the Istituto Superiore di Scienze Economiche e Commerciali of Turin in\n1914\n. Then in\n1923\n, Bonferroni took up the chair of financial mathematics at the Financial Mathematics and Economics Institute in Bari. For seven of the ten years he spent in Bari he served as rector of the University of Bari. In the middle of his stay at Bari, he attended the International Congress of Mathematicians which was held in Bologna in\n1928\n. It was a highly appropriate conference for Bonferroni to attend since, for the first time, a section was introduced covering Statistics, Mathematical Economy,\nCalculus of Probability\n, and Actuarial Science. In\n1933\nhe left Bari and moved to Florence where he held his chair until his death. Carlo Benedetti became Bonferroni's student after World War II. He said\n[\n9\n]\n:-\nThe University\n[\nof Florence\n]\nreopened in January\n1945\nand I immediately took my first examination which was mathematics with Professor Bonferroni. I knew about Bonferroni through his 'Elements of mathematical analysis'\n(1933\n-\n34)\n. I chose to do my thesis with him because his three examinations had gone very well and I was now fascinated by the world of mathematics ... I used to talk to Bonferroni also about statistics and through his 'Elements of statistics'\n(1941)\nI realised that mathematics was of fundamental importance. Another reason\n[\nI wrote a thesis on statistics\n]\n... was that the world of mathematicians was a very closed one and therefore people like me who had not attended a mathematics faculty did not have many opportunities, even though I loved the field. Bonferroni said to me, \"Hurry and take up a career in statistics because when mathematicians become aware of the possibility which it offers them, there will not be any more opportunities for people like you\".\nMany further details and bibliography can be found in the obituary\n[\n11\n]\n, and\n[\n6\n]\nand\n[\n1\n]\n(\nall three in Italian\n)\nand a brief encyclopaedia entry\n[\n7\n]\n. Benedetti spoke about Bonferroni's mathematical style in\n[\n9\n]\n:-\nThe contributions made by Bonferroni ... are rather varied, ranging from pure mathematics to mathematical statistics and to actuarial mathematics. More than anything else, however, I was struck by his personal style and the simplifying solutions to the very complex procedures which he proposed. You only need to open his texts\n[\n'Elements of general statistics'\n(1941)\n, 'Foundations of actuarial mathematics'\n(1942)\n, 'Elements of mathematical analysis'\n(1\nst  edition\n1933\n,\n6\nth\nedition\n1957)]\nto discover this. He was also obsessed with printing mistakes and errors which are noticed only once the paper has been printed.\nBonferroni wrote two articles which cover what today are known as the 'Bonferroni inequalities', the\n1935\narticle\n[\n4\n]\nis directed to a specific application, namely life assurance, whereas the\n1936\narticle\n[\n5\n]\nis more abstract. Note that many sources cite both of these as having been published in\n1936\n, but this is an error caused, we believe, by following secondary sources rather than reading the originals. We quote the abstract of the\n1935\narticle:-\nThe author establishes above all a symbolic calculus which enables the expression in a rapid and uniform manner of the various probabilities of survival and death amongst a group of assured, expressed as a function of a particular type assumed as primary. This calculus does not require the hypothesis that the assured lives should be independent, as is usual in treatments of this problem. He establishes a noteworthy law of duality between the probability of survival and that of death, introducing as a consequence of the notation some new results.\nIn the\n1936\npaper Bonferroni sets up his inequalities. Suppose we have a set of\nm\nm\nm\nelements and each of these elements can have any number of the\nn\nn\nn\ncharacteristics\nC\n1\n,\nC\n2\n,\n.\n.\n.\n,\nC\nn\nC_{1}, C_{2}, ..., C_{n}\nC\n1\n​\n,\nC\n2\n​\n,\n.\n.\n.\n,\nC\nn\n​\n. We denote by\np\ni\np_{i}\np\ni\n​\nthe probability that an element has characteristic\ni\ni\ni\n, by\np\ni\nj\np_{ij}\np\ni\nj\n​\nthe probability that an element has both characteristic\ni\ni\ni\nand characteristic\nj\nj\nj\n,\np\ni\nj\nk\np_{ijk}\np\ni\nj\nk\n​\nthe probability that it has the three characteristics\ni\n,\nj\ni, j\ni\n,\nj\nand\nk\nk\nk\n, etc. Let\nS\n0\n=\n1\n,\nS\n1\nS_{0} = 1, S_{1}\nS\n0\n​\n=\n1\n,\nS\n1\n​\n= sum of\np\ni\n,\nS\n2\np_{i}, S_{2}\np\ni\n​\n,\nS\n2\n​\n= sum of\np\ni\nj\np_{ij}\np\ni\nj\n​\n,\nS\n3\nS_{3}\nS\n3\n​\n= sum\np\ni\nj\nk\np_{ijk}\np\ni\nj\nk\n​\n, etc. Then, writing\nP\nr\nP_{r}\nP\nr\n​\nfor the probability that an element has exactly\nr\nr\nr\ncharacteristics, Bonferroni's inequalities are\nP\n0\n≤\n1\n,\nP\n0\n≥\n1\n−\nS\n1\n,\nP\n0\n≤\n1\n−\nS\n1\n+\nS\n2\n,\nP\n0\n≥\n1\n−\nS\n1\n+\nS\n2\n−\nS\n3\n,\nP_{0} ≤ 1, P_{0} ≥ 1 - S_{1}, P_{0} ≤ 1 - S_{1} + S_{2}, P_{0} ≥ 1 - S_{1} + S_{2} - S_{3},\nP\n0\n​\n≤\n1\n,\nP\n0\n​\n≥\n1\n−\nS\n1\n​\n,\nP\n0\n​\n≤\n1\n−\nS\n1\n​\n+\nS\n2\n​\n,\nP\n0\n​\n≥\n1\n−\nS\n1\n​\n+\nS\n2\n​\n−\nS\n3\n​\n,\n...\nThe inequality\nP\n0\n≥\n1\n−\nS\n1\nP_{0} ≥ 1 - S_{1}\nP\n0\n​\n≥\n1\n−\nS\n1\n​\nhad been noted by\nGeorge Boole\n, and\nFrancesco Paolo Cantelli\nhad highlighted\nBoole\n's inequality in a talk he gave at the International Congress of Mathematicians in Bologna in September\n1928\n. As we mentioned above, Bonferroni attended this conference and his work on the 'Bonferroni inequalities' may have been prompted by hearing\nCantelli\n's lecture.\nBonferroni's articles are more of a contribution to probability theory than to simultaneous statistical inference, and the reader in search of a convenient reference for such use might prefer\n[\n10\n]\n. A contrasting view of the value of adjustment in multiple comparisons can be found in\n[\n12\n]\n. As usual in statistics the name can be considered inappropriate\n(\nan example of Stigler's law\n[\n16\n]\n)\nas the usual statistical simultaneous inference relies only on\nBoole\n's inequality\n[\n15\n]\n.\nApart from these he also had interests in the foundations of probability. Two relevant articles are an inaugural lecture in\n[\n3\n]\nand a more formal article published earlier, but written about the same time\n[\n2\n]\n. He developed a strongly frequentist view of probability denying that subjectivist views can even be the subject of mathematical probability. For example, in his inaugural lecture\n[\n3\n]\n, he said:-\nA weight is determined directly by a balance. And a probability, how is that determined? What is, so to speak, the probability balance? It is the study of frequencies which give rise to a specific probability.\nLater in the same lecture he stated that, \"subjective probability is not amenable to mathematical analysis.\" In\n[\n11\n]\nPagni gives a list of Bonferroni's publications under three main headings:\n(1)\nactuarial mathematics\n(16\narticles and\n1\nbook\n)\n;\n(2)\nprobability and statistical mathematics\n(30\narticles and\n1\nbook\n)\n; and\n(3)\nanalysis, geometry and rational mechanics\n(13\narticles\n)\n. However, his contributions seem to have received less recognition that one might have expected. Michael Dewey and Eugene Seneta address this in\n[\n8\n]\n:-\nOne reason for his current lack of recognition may be the fact that his books were never properly disseminated. Apart from 'Elementi di analisi matematica'\nⓉ\n(\nElements of mathematical analysis\n)\n, and that only in its last edition of\n1957\n, and a smaller research monograph: 'Sulla correlazione e sulla connessione'\nⓉ\n(\nOn correlation and connection\n)\n(1942)\n, they probably do not exist in typeset versions. One of the volumes, 'Elementi di Statistica Generale' was reprinted in facsimile after his death at the instigation of the Faculty of Economics of the University of Florence; bound with it is a memoir by\nBruno de Finetti\n. The reason his books were never properly typeset is that he believed that books were too expensive for students to buy, and so to keep costs down he handwrote his teaching material, and the books were printed from that version.\n(\nThis pattern is reasserting itself for the same reasons with the aid of electronic publishing.\n)\nThey run to hundreds of pages, neat and almost correction free. His articles have a clear explanatory nature. He was someone with a genuine interest in communicating his ideas to his audience.\nIt is worth noting, however, that Bonferroni's inequalities gained fame following the publication of\nMaurice Fréchet\n's\n1940\nbook\nLes probabilités associées a un système d'événements compatibles et dépendants. Première partie: d'événements en nombre fini fixe\nⓉ\n(\nAssociated probabilities of a compatible system  and dependent events. First part: A fixed finite number of events\n)\nand\nWilliam Feller\n's\nAn Introduction to Probability Theory and its Applications\n(1950)\n. More recently, much effort has been put into generalising Bonferroni's inequalities, see for example J Galambos and I Simonelli,\nBonferroni-type Inequalities with Applications\n(\nSpringer-Verlag, New York,\n1996)\nand papers continue to be published on this topic. To indicate the interest in this area we note that an generalisation of Bonferroni's inequalities by S Holm in the paper\nA simple sequentially rejective multiple test procedure\npublished in the\nScandinavian Journal of Statistics\n6\n(1979)\n,\n65\n-\n70\n, has received around\n2000\ncitations.\nBonferroni kept up his passion for music all his life and when he was younger he was an enthusiastic climber of glaciers. Benedetti said\n[\n9\n]\n:-\nIn his mathematical papers in fact you can recognise a lightness and refinement which is almost musical. He was a sensitive and kind person even if he was very strong willed. I was very fond of him, particularly for the way he was protective and affectionate towards me.\n[\nBonferroni\n]\nwas a very kind, refined person. I was moved by the fact that when he met my employer at the financial firm \"La centrale\" he had told him to treat me gently as I was a very sensitive boy. He was a tall strongly built man with light blue eyes and not very much hair. He was protective towards me in the same way a father would be. He enquired about the company I kept and the life I led in Florence.\nBonferroni was honoured by election to the Hungarian Statistical Society.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}