{
  "nome_completo": "Carl Gottfried Neumann",
  "nome_curto": "Carl Neumann",
  "ano_nascimento": "1832",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neumann_Carl/",
  "lugar_nascimento": "Königsberg, Germany (now Kaliningrad, Russia)",
  "lugar_morte": "Leipzig, Sachsen, Germany",
  "biografia": "Carl Neumann\nwas the son of\nFranz Neumann\nwho has a biography in this archive. His mother, Luise Florentine Hagen\n(\nborn\n1800)\n, was\nWilhelm Bessel\n's sister-in-law. Carl's siblings were Franz Ernst Christian Neumann\n(1834\n-\n1918)\n, Friedrich Julius Neumann\n(1835\n-\n1910)\n, and Luise Neumann\n(1837\n-\n1934)\n. Let us note at this point that Franz Ernst Christian Neumann became a pathologist and director of the Pathological Institute at Königsberg, and Friedrich Julius Neumann became an economist, holding professorships in Königsberg, Basel, Freiburg and Tübingen. Luise Neumann became a painter creating landscapes and portraits, as well as interiors of cultural and historical buildings in Königsberg. She also painted porcelain. Luise Neumann wrote a biography of her father,\nFranz Neumann: Erinnerungsblätter\nⓉ\n(\nMemories of Franz Neumann\n)\n(\nTübingen-Leipzig,\n1904)\n, which we reference below\n[\n3\n]\n.\nCarl received his school education, both primary and secondary, in the city of Königsberg where his father was the Professor of Physics at the University. His secondary education was at the Altstadt\nGymnasium\nwhich, when he began his studies, was situated in the street Danziger Keller near Königsberg Castle but, after a period in temporary accommodation, the school moved to a new building in Altstädtischer Kirchplatz in which Carl completed his schooling. His two younger brothers, Friedrich Julius Neumann and Franz Ernst Christian, also attended this school.\nNeumann entered the University of Königsberg where he became close friends with two of his teachers,\nOtto Hesse\nand Friedrich Julius Richelot\n(1808\n-\n1875)\n. Richelot had been a student of\nCarl Jacobi\nand taught at the University of Königsberg from\n1831\n, becoming a full professor in\n1844\n. He published on mathematical analysis but his real strength was as a teacher. After graduating with a qualification to teach mathematics in secondary schools, Neumann continued to study at Königsberg for his doctorate which was awarded in\n1855\nfor his thesis\nDe problemate quodam mechanico, quod ad primum integralium ultraellipticorum classem revocatur\nⓉ\n(\nOn a problem in mechanics, whose integral is called ultraelliptical\n)\n. In this work he studied applications of hyperelliptic integrals to specific problems in mechanics. He had been advised during his doctoral studies by Richelot.\nAfter receiving his doctorate, Neumann studied for his\nhabilitation\nadvised by\nEduard Heine\nwho had been appointed as an ordinary professor at Halle in\n1856\n. Neumann submitted his habilitation thesis\nExplicare tentatur, quomodo fiat, ut lucis planem polarisationis per vires electricas vel magneticas declinetur\nⓉ\n(\nAttempt to explain how it is that the polarization plane of light is altered by magnetic or electical forces\n)\nto the University of Halle in\n1858\n. In this work\n[\n18\n]\n:-\n... he treated mathematically the rotation of the plane of polarization of light by magnetism\n(\nthe\nFaraday\neffect\n)\n.\nIn that year he received the right to lecture when he became a\nPrivatdozent\nat Halle. He was promoted to extraordinary professor there in\n1863\n.\nNeumann did not remain at Halle for long after his promotion for he was offered a professorship at the University of Basel. Arriving in Basel in\n1863\nhe only spent two years at the university there before being offered a professorship at the University of Tübingen. However, during these two years in Basel he married Hermine Mathilde Elise Klose on\n7\nApril\n1864\nin St Matthew's Church in Berlin. Mathilde, who was born in\n1834\nto the registrar Heinrich Theodor Klose, died aged\n40\nin\n1875\n. They had no children. Neumann's inaugural lecture at Tübingen was\nDer gegenwdrtige Standpunct der Mathematischen Physik\nⓉ\n(\nThe current position of mathematical physics\n)\nand in this he discussed applications of\npotential theory\nto electrodynamics, optics and the theory of heat. After a slightly longer time, namely three years, spent in Tübingen, from\n1865\nto\n1868\n, Neumann was on the move again, this time to a chair at the University of Leipzig. Appointed to Leipzig in the autumn of\n1868\nhe gave his inaugural lecture\nÜber die Principien der Galilei-Newton'schen Theorie\nⓉ\n(\nOn the principles of the Galilean-Newtonian theory of mechanics\n)\nin\n1869\n. In this lecture he discussed\n[\n10\n]\n:-\n... what sort of intelligibility and comprehensibility should be demanded of physical laws, and what sort of comprehension of physical phenomena physics can really offer.\nThe German text of this lecture is given in\n[\n2\n]\n.\nAfter his appointment to Leipzig he found notes of\nJacobi\n's lectures on analytical mechanics which had been delivered in Berlin in the winter semester of\n1847\n-\n1848\n. The notes had been taken by Wilhelm Scheibner who was now Neumann's colleague in Leipzig. Neumann\n[\n18\n]\n:-\n... characterized\nJacobi\n's lectures as constituting an exceptionally penetrating critique of the foundations of mechanics. Now, like\nJacobi\n, Neumann took his goal to be to start from some unanalyzable basic assumptions or principles and to deduce general theorems from them, in this way constructing a physical theory of the field under consideration. His goal thus was to establish a physical theory by employing an axiomatic approach like that found in geometry. He stressed, however, what he considered to be a fundamental difference between mathematical axioms and physical principles: He claimed that the latter, which form the basis of a physical theory, can never be described as true or probably true; they always embody some uncertainty or arbitrariness.\nNeumann held the chair at Leipzig until he retired in\n1911\nbut sadly, as we indicated above, his wife died in\n1875\n. Ernst Richard Julius Neumann\n(1875\n-\n1955)\nwas the son of Neumann's brother, the pathologist Franz Ernst Christian Neumann. Ernst Neumann became a mathematician and studied at Königsberg, Heidelberg and then at the University of Leipzig from\n1893\nto\n1898\n. In Leipzig he was a student of his Carl Neumann, the subject of this biography. Ernst Neumann went on to become a professor at Breslau and Marburg. He continued to undertake research along the same lines as his uncle on potential theory.\nWussing writes in\n[\n1\n]\n:-\nNeumann, who led a quiet life, was a successful university teacher and a productive researcher. More than two generations of future Gymnasium teachers received their basic mathematical education from him.\nHe worked on a wide range of topics in applied mathematics such as mathematical physics, potential theory and electrodynamics. Of course he was not the only one working on theories of electrodynamics and a discussion\n(\nin some cases an argument\n)\narose about which was \"correct.\" Assumptions had to be made about various physical properties, such as how electromagnetic forces propagate, in constructing a mathematical model. Experimental verification was an important factor in coming to a decision but other factors also played a role. Neumann made assumptions some of which followed those made by\nWilhelm Weber\n. This is not surprising since Neumann's father,\nFranz Neumann\n, had adopted the same assumptions. As early as\n1847\nHermann von Helmholtz\nhad claimed that these assumptions violated the law of conservation of energy.\nHelmholtz\npublished his own theory of electrodynamics in\nÜber die Bewegungsgleichungen der Elektricität für ruhende leitende Körper\nⓉ\n(\nOn the equations of motion of electricity for a stationary conducting body\n)\n(1870)\n. This led to a debate between various scientists, in particular between\nHelmholtz\nand Neumann. Karl-Heinz Schlote writes in\n[\n18\n]\n:-\nThe\nHelmholtz\n-Neumann debate might seem somewhat surprising, since both used potential theory, and\nHelmholtz\n's approach corresponded closely to Neumann's methodological views on the structure of a physical theory. Thus,\nHelmholtz\nassumed the validity of conservation of energy and derived a general formula for the electrodynamic potential that covered \"the entire experimentally known area of electrodynamics ... with one and the same relatively simple mathematical expression.\" He noted with satisfaction that Neumann had required many hypotheses to reach a similar result. Neumann stuck to his guns, however, although he acknowledged that conservation of energy was a basic principle of physics, and he admitted that\nHelmholtz\n's theory appeared to have a simpler structure. One important reason, in general, that Neumann opposed\nHelmholtz\n's approach was that\nHelmholtz\n's states of energy and their interaction made the explanation of many electrodynamic phenomena more complicated than explanations based upon\nWeber\n's or\nMaxwell\n's theories.\nNeumann also made important pure mathematical contributions. He studied the order of connectivity of\nRiemann\nsurfaces in\nVorlesungen uber Riemann's Theorie der Abel'schen Integrale\nⓉ\n(\nLectures on Riemann's theory of abelian integrals\n)\n(1\nst edition\n1865\n, second edition\n1884)\n.\nDuring the\n1860\ns Neumann wrote papers on the\nDirichlet\nproblem and the 'logarithmic potential', a term he coined. He used the logarithmic potential to solve the\nDirichlet\nproblem in the plane in\n1861\n. This problem requires, given the values of a function on the boundary of a region in the plane, finding a function\nf\nf\nf\nwhich satisfies\nΔ\nf\n=\n0\n\\Delta f = 0\nΔ\nf\n=\n0\nin the region and takes the given values on the boundary. He solved the problem in more generality in\nZur Theorie des Logarithmischen und des Newtonschen Potentials. Erste Mittheilung\nⓉ\n(\nOn the theory of logarithmic and Newtonian potential. First communication\n)\n(1870)\nand continued to return to produce further methods and results in this area. In\n1890\nÉmile Picard\nused Neumann's results to develop his method of successive approximation which he used to give existence proofs for the solutions of\npartial differential equation\n. This is discussed in detail in\n[\n6\n]\n.\nThere are a great many mathematical terms named after 'Neumann' but it is such a common name that often it is difficult to determine which are named after Carl Gottfried Neumann. For example, MathSciNet lists\n7357\npapers with 'Neumann' in the title. Several terms are easy to establish as being named after Carl Neumann, however, such as the Neumann-\nPoincaré\nOperator, the Neumann boundary value problem, the Neumann boundary condition, the Neumann series, and the Neumann problem.\nIn addition to his research and teaching, Neumann made another important contribution to mathematics as a founder and editor of\nMathematische Annalen\n. Together with\nAlfred Clebsch\nhe founded the journal in\n1868\n. The first volume, published in\n1869\n, contains papers by leading mathematicians such as\nHeinrich Weber\n,\nJacob Lüroth\n,\nArthur Cayley\n,\nAlfred Clebsch\n,\nPaul Gordan\n,\nCamille Jordan\n,\nLeo Königsberger\n,\nAlexander von Brill\n,\nHieronymus Georg Zeuthen\n,\nTheodor Reye\n,\nHermann Hankel\n, and\nEugenio Beltrami\n. The volume, in four parts, contained five papers by Neumann, namely:\nGeometrische Untersuchung über die Bewegung eines starren Körpers\nⓉ\n(\nGeometrical examination of the motion of a rigid body\n)\n;\nZur Theorie der Functionaldeterminanten\nⓉ\n(\nOn the theory of functional determinants\n)\n;\nNotizen zu einer kürzlich erschienenen Schrift über die Principien der Elektrodynamik\nⓉ\n(\nNotes on a recently published treatise on the principles of electrodynamics\n)\n;\nÜber die Aetherbewegung in Krystallen\nⓉ\n(\nOn the aether movement in crystals\n)\n; and\nNotiz über das cykloidische Pendel\nⓉ\n(\nNote on the cyclic pendulum\n)\n. His contribution to the Annalen is given in\n[\n8\n]\n:-\nWith Carl Neumann's death, we remember, above all, that he was one of the founders of the Annalen. Among the younger generation of German mathematicians, resistance to\nCrelle\n's Journal and its sluggish management had arisen in the sixties of the last century\n[\nthe\n1860\ns\n]\n. For this reason, Neumann himself preferred publication in the form of monographs and textbooks. The idea of founding a new journal was considered, but it was Neumann who gave it life by working with the right publisher in the company Teubner, with whom he had been in business for some time, recognised the ideal editor in\nClebsch\n, a friend he studied with in his youth, and brought them together. This happened in a letter to Teubner of\n10\nJune\n1868\n, which has been printed several times, in which Neumann summarizes the duties of a good editor in three sentences of classical correctness and conciseness. How much credit he gave himself for his share in the founding of the Annalen, is seen by the heading which he gave after the death of\nClebsch\n:  \"Founded by\nRudolf Friedrich Alfred Clebsch\nin conjunction with Carl Neumann\". A later period has changed this modest formulation, by placing the two names\nClebsch\nand Neumann side by side. Neumann was probably far from the actual editorial activity. Nevertheless, after\nClebsch\n's death, for four years\n(1873\n-\n1876\n, vol.\n6\n-\n9)\n, he conducted the main editorial work, but at the same time divided the editorial duties on a broader basis by assuring the cooperation of four subsidiary editors. In this way he has given the editors of the Annalen their still existing form. Since the tenth volume, his share of the editorial work of the Annalen has declined rapidly, and his numerous publications in the Annalen gradually became more and more sparse.\nHe was honoured with membership of several academies and societies, including the\nBerlin Academy\nand the societies in Göttingen, Munich and Leipzig. These underwent various changes in name during his time as a member which we now indicate. He was elected a corresponding member of the Königlichen Societät der Wissenschaften of Göttingen in\n1864\nand, in\n1868\nbecame a foreign member of that Society. In\n1893\nthis became the Königlichen Gesellschaft der Wissenschaften of Göttingen and in\n1919\nit became the Akademie der Wissenschaften zu Göttingen. His membership continued through these changes until his death in\n1925\n. He was elected a corresponding member of the Königlich-Preussischen Akademie der Wissenschaften of Berlin in\n1893\nand continued his membership when it became the Preussischen Akademie der Wissenschaften in\n1919\n. He was elected a corresponding member of the Königlich-Bayerischen Akademie der Wissenschaften of Munich in\n1895\nand continued his membership when it became the Bayerischen Akademie der Wissenschaften in\n1919\n. He was elected a full member of the Mathematical-Physical Class of the Sächsischen Akademie der Wissenschaften of Leipzig in\n1919\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics"
  ]
}