{
  "nome_completo": "Carl Anton Bjerknes",
  "nome_curto": "Carl Bjerknes",
  "ano_nascimento": "1825",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bjerknes_Carl/",
  "lugar_nascimento": "Christiania (now Oslo), Norway",
  "lugar_morte": "Kristiania (now Oslo), Norway",
  "biografia": "Carl Bjerknes\n's father was Abraham Isaksen Bjerknes, the youngest son of a farmer from Sandsvär, and his mother was Elen Birgitte Holmen. Carl's parents both came from poor farming backgrounds but, since Carl's father was the youngest son, he had no farm to inherit so he went to Copenhagen to qualify as a veterinary surgeon. Elen Holmen, Carl's mother, came from Drammen\n(\nabout\n30\nkm from Sandsvär\n)\nwhere her father was also a farmer. In\n1825\n, when Carl was twelve years old, his father died and Carl's mother was left to bring up their three children with very little income. Given the difficult financial circumstances that Elen found herself in, it was a remarkable achievement that she was able to sent both her sons to university.\nIn\n1844\nBjerknes entered the University of Christiania\n(\nnow Oslo\n)\n, where he studied mining. He was awarded a degree in mining engineering in\n1848\nand for the next four years he worked at the Kongsberg silver mines. Silver was mined at Kongsberg, in southeastern Norway, from the early\n17\nth\ncentury until the mid-\n20\nth\ncentury. The oldest school of mines in the world, founded\n1757\n, was in the town and Bjerknes worked there from\n1848\nuntil\n1852\n.\nFor two years, from\n1852\nto\n1854\n, Bjerknes taught mathematics in a school but an award of a scholarship enabled him to study mathematics at Göttingen and Paris in\n1856\n-\n57\n. His son Vilhelm Bjerknes later wrote\n(\nthinking about both himself and his father\n)\nthat:-\n... foreign scientific travels\n[\nwere\n]\nindispensable for anyone in our restricted situation who wishes to develop into a man of science.\nDirichlet\nlectured to Carl Bjerknes in Göttingen on hydrodynamics and Bjerknes became so interested in that topic that he spent the rest of his life researching in that area. He was appointed as a Lecturer in Applied Mathematics at the University of Christiania in\n1861\n, becoming a Reader in Applied Mathematics there in\n1863\n.\nIn\n1859\n, after returning from his foreign travels, Bjerknes had married Aletta Koren whose father was a minister in the Church in West Norway. Their son\nVilhelm Bjerknes\nwas born in\n1862\nand he played an important role in his father's work both as an assistant to his father when he was young, then later writing up his father's hydrodynamical work for publication. They had two other sons, Carl who became a sailor and died in a tropical cyclone, and Ernst who became an engineer. Perhaps it is worth mentioning just how talented a family Carl and Aletta Bjerknes had. In particular one of their grandsons Jacob Bjerknes,\nVilhelm Bjerknes\n's son, also achieved great fame as a scientist.\nAfter Carl Bjerknes's death, his son\nVilhelm Bjerknes\ngave a memorial lecture in which he described the difficulties his father had to face after becoming a Reader in Applied Mathematics at the University of Christiania:-\n[\nCarl Bjerknes\n]\nsuffered for five years from writer's cramp; tried using his left hand unsuccessfully; was helped by his wife until the strain of doing this and managing a household became too great for her; engaged a secretary who wrote on strips of paper the dictated mathematics, handing each strip to him so that he could see it before proceeding to the next step.\nDespite the difficulties under which he worked, Bjerknes produced outstanding results and was promoted to Professor of Applied Mathematics at the University of Christiania in\n1866\n. In\n1869\nhe accepted the chair of Pure Mathematics at the university.\nBy the time that Vilhelm was old enough to assist his father, Bjerknes had become something of a recluse living in a world of his own, totally dominated by his hydrodynamic research. Pihl writes in\n[\n1\n]\n:-\nBjerknes had a delightful personality and was an excellent teacher who was greatly respected by his students for his personal qualities and outstanding lectures. As the years passed, however, he showed an increasing tendency to professional isolation and a fear of publishing the results of his research, which was mainly concerned with hydrodynamic problems.\nLet us examine a little this work which assumed such a dominant role in Bjerknes' life. He began his investigations from a result that\nDirichlet\nhad proved in the lectures he attended, namely that a ball can move at a constant speed without the action of external forces through a frictionless fluid. Bjerknes discovered analogies between the way bodies could move through a frictionless fluid and certain electromagnetic effects. His son described this work in the memorial lecture referred to above:-\n...\n[\nCarl Bjerknes\n]\nworked out the mathematics of pulsating spheres in a fluid, finding that they were the 'mirror image' of electric charges and magnetic poles in that 'like' spheres attracted each other and 'unlike' spheres repelled with forces varying as the inverse square of the distance between them.\nHe worked constantly towards the goal of developing a theory of hydrodynamic phenomena which included\nMaxwell\n's electrodynamic theory. His work is an important contribution but he did not achieve his goal. Pihl writes in\n[\n1\n]\n:-\nHis \"hydrodynamic picture of the world\" and his efforts to explain the electromagnetic forces through hydrodynamics are today more a fascinating analogy that a basic physical theory, yet through his research Bjerknes attained great insight into hydrodynamics phenomena and thus anticipated later developments in several fields.\nWe mentioned above that it was\nVilhelm Bjerknes\nwho wrote up his father's hydrodynamical work for publication. He did this by publishing a two volume work\n(\nthe first volume in\n1900\n, with the second in\n1902)\nconsisting of his father's lectures on the subject. The treatise was entitled\nHydrodynamic action at a distance according to C A Bjerknes's theory\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}