{
  "nome_completo": "Carlo Cercignani",
  "nome_curto": "Carlo Cercignani",
  "ano_nascimento": "1939",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cercignani/",
  "lugar_nascimento": "Teulada, Sardinia, Italy",
  "lugar_morte": "Milan, Italy",
  "biografia": "Carlo Cercignani\nwas born to Tuscan parents Luisa Notari and Ario Cercignani in Teulada, a town near the south coast of Sardinia, about\n65\nkm south west of Cagliari. Ario was working there as a provincial veterinary doctor. Carlo's brother, Fausto, who became a renowned essayist, poet and professor of German literature, was born in\n1941\nalso in Sardinia. However the family soon returned to Tuscany and Carlo spent his early years in Pisa, where he attended a Liceo classico, before moving to Milan where he undertook university studies. He studied physics and obtained his laurea in physics in\n1961\n. Continuing to study at Milan, he was awarded a laurea in mathematics in\n1963\n. However, he said\n[\n3\n]\n:-\nAlthough I certainly have met a number of professors from whom I learned a lot, it was more the way to present an argument rather than to do real research of my own. If it does not seem immodest, I can call myself self-taught. Before the age of eighteen I had learned the basics of analysis through consulting encyclopaedias and by constructing missing proofs on my own\n(\nsome quite correct, others only fanciful\n)\nin the Calculus of Variations, in Rational Mechanics, in Tensor Calculus, and I thoroughly read articles on\nEinstein\n's special and general theory of relativity. After the first year of university I studied\n(\nin the summer\n)\nPauli\n's contributions to the theory of relativity, seen by many as very difficult. I graduated first in Physics\n(\nadvised by Sergio Albertoni\n)\nand two years later in Mathematics\n(\nadvised by\nGiovanni Ricci\n)\n. In both cases I did the thesis work completely on my own, although my advisors recommended what I should read. I would say that the study of the works of great scientists have played the most important formative role in my way of doing research.\nHe began publishing papers as soon as he had completed his physics laurea. The papers\nElementary solutions of the linearized gas-dynamics Boltzmann equation and their application to the slip-flow problem\nand\nSolutions of linearized gas-dynamics Boltzmann equation and application to slip-flow problem\nappeared in print in\n1962\nwhile, in the following year, he published further papers, including two written jointly with his physics advisor Sergio Albertoni, namely\nNumerical Evaluation of the Slip Coefficient\nand\nSlip-coefficient expression is derived using an exact analytical solution of the slip flow problem\n. However, as well as mathematics and physics, he loved literature. Manozi Franco writes\n[\n7\n]\n:-\nHe was also a fan of literature: he had practised learning the Divine Comedy by heart. He loved greatly involving himself in poetry and in translation. Interrupting his work on a difficult theorem, he would suddenly begin to translate Jorge Luis Borges, William Shakespeare, Raymond Queneau, Charles Baudelaire, Stéphane Mallarmé or the Milanese dialect of \"La Ninetta del Verzee\" by Carlo Porta.\nCercignani met Silvana Galdabini, a physics student, while she was studying at Milan. They married in\n1966\nand had two daughters, Anna and Mara. Anna has a laurea in Germanic philology, while Mara studied telecommunication engineering at the Politecnico of Milan and is now professor of medical physics at the Brighton and Sussex Medical School in England. Returning to Carlo Cercignani's career, he was appointed as a teaching and research assistant at the University of Milan, but over the following few years spent time at a number of foreign institutions, in particular at the Massachusetts Institute of Technology, the University of California, Berkeley, and the Courant Institute of Mathematical Sciences in New York. In\n1968\nhe was appointed as an Associate Professor of Aerodynamics at the Politecnico of Milan. He was promoted to full Professor of Mathematical Physics in\n1975\n. He spent the rest of his career in that position, but he had to battle against severe health problems. For over\n30\nyears he struggled to maintain his active career despite suffering from multiple sclerosis. Giovanni Frosali, at the International Conference on Transport Theory in Portland in September\n2011\n, said:-\nThe scientific work of Carlo Cercignani was very fruitful. As a mathematician, Cercignani obtained important results in the theory of Partial Differential Equations, Semigroup Theory, Monte-Carlo Methods, Spectral Theory,\nRiemann\n-\nHilbert\nProblems,\nFourier\nAnalysis, and Functional Analysis. His main research interest was Kinetic Theory. Cercignani devoted a particular attention to the H-theorem, and to the problem of how macroscopic, irreversible evolution equations can follow from microscopic, reversible motion equations. In\n1972\n, he obtained an elegant generalization of the Darrozes-Guiraud formula, and proved an H-theorem for polyatomic gases.\nCercignani has been one of the most active researchers of the\nBoltzmann\nequation and related topics. The second half of the last century were very auspicious for kinetic theory and Carlo Cercignani was always among its most important contributors. In\n1975\nhe published his most famous treatise 'The Boltzmann equation and its applications',  which collects and unifies numerous results on the\nBoltzmann\nequation previously scattered in hundreds of references. During the\n1980\n's, he studied the evaporation-condensation interface between a gas and a liquid, stating an important conjecture for the long-time behaviour of the\nBoltzmann\nequation solutions.\nSince Cercignani published eight books and over\n300\nresearch articles, it is impossible here to give an adequate overview of the range of his contributions. Let us note the diverse fields to which he contributed: to the kinetic theory of rarefied gases, models of turbulence, the transport of neutrons and of semiconductors, the\nBoltzmann\nequation and its applications which have proved useful in nanotechnology. However, as Cédric Villani explains in\n[\n15\n]\n, there is a common theme running through the papers concerning very different topics:-\nAlmost all of these show Carlo's passion for the\nBoltzmann\nequation, and more generally everything related to\nBoltzmann\n. Paradoxically, this focussing comes with an incredible diversity of methods, techniques and points of view. In\n45\nyears of research, the\nBoltzmann\nequation led Carlo to work in theoretical mechanics, partial differential equations, numerical analysis, semigroup theory, spectral theory,\nRiemann\n-\nHilbert\nproblems,\nFourier analysis\n, and many other areas. A few years ago, a collaboration with Sasha Bobylev on self-similar solutions of the\nBoltzmann\nequation even led him to a new pretty formula for the inversion of the\nLaplace transform\n. In brief, Carlo is at the same time one of the most focussed and one of the most versatile scientists that I know, defying any attempt of classification.\nLet us look at some of Cercignani's books which he began to write surprisingly early in his career. An early classic was\nTheory and Application of the Boltzmann Equation\n(1975)\n. James Glimm writes:-\nThe\nBoltzmann\nequation connects the discrete motion of the individual particles in a gas with the continuous motion of the gas as a whole. It is basic to fluid mechanics and is used in a variety of applications including plasma dynamics, neutron transport, and shock waves. As with many \"basic\" equations, its Achilles' heel is its complexity. For this reason the author presents, in addition to the general theory, a variety of approximation methods including linearization, asymptotic expansions, and numerical methods. The book is well written and can be used as a text for students learning the subject as well as a reference for workers active in the field.\nHe updated this book thirteen years later, publishing it under the slightly revised title\nThe Boltzmann Equation and its Applications\n(1988)\n. The publisher\n(\nSpringer-Verlag\n)\nwrites:-\nThis book gives a complete exposition of the present status of the theory of the\nBoltzmann\nequation and its applications. The\nBoltzmann\nequation, an integro-differential equation established by\nBoltzmann\nin\n1872\nto describe the state of a dilute gas, still forms the basis for the kinetic theory of gases. It has proved fruitful not only for the study of the classical gases\nBoltzmann\nhad in mind, but also, properly generalized, for electron transport in nuclear reactors, photon transport in superfluids, and radiative transport in planetary and stellar atmospheres. The text presents a unified approach to the problems arising in these different fields, by exploiting similarities whenever they exist and underlining the differences when necessary. But the main exposition is tied to the classical equation established by\nBoltzmann\n.\nDorfman, reviewing the book, writes\n[\n5\n]\n:-\nI believe that Cercignani has done us all an enormous service by providing books with a high level of clarity such as this one, and I recommend it for anyone interested in the\nBoltzmann\nequation.\nCercignani moved to writing historical and biographical material in\nLudwig Boltzmann e la meccanica statistica\n(1997)\n. Baracca writes\n[\n2\n]\n:-\nCercignani's reconstruction of\nBoltzmann\n's scientific and personal experience is accurate, lively, and rich in anecdotes that deepen our understanding of his personality and his thought. Moreover, he discusses the physical aspects of\nBoltzmann\n's contributions in depth and provides an appraisal of their current interest.\nLudwig Boltzmann: The Man Who Trusted Atoms\n(1998)\n, his English biography of\nBoltzmann\n, is his most widely read work enjoyed by specialists and non-specialists alike. Dorfman\n[\n6\n]\nwrites:-\nCarlo Cercignani, a well-known mathematical physicist, has written an interesting and thoughtful biography of\nLudwig Boltzmann\n... This is a valuable and stimulating book that deserves to be read and discussed by people interested in the history of scientific ideas and their role in science today.\nRowlinson writes that the first chapters cover\nBoltzmann\n's biography and an introduction to the history of physics. Cercignani\n[\n12\n]\n:-\n... then reaches the real point of the book, which is\nBoltzmann\n's contribution to equilibrium and, particularly, to non-equilibrium statistical mechanics, and the problem of how the time-irreversible laws of thermodynamics can arise from the reversible laws of micro-mechanics, whether classical, as for\nBoltzmann\n, or quantum, for us. This has been the subject of the author's own research and he is well-equipped to give a detailed account of\nBoltzmann\n's pioneering contribution and to place it in the context of the state of physics at the very end of the classical era.\nA review in\nNature\nstates:-\nCercignani's beautiful book has the merit, first of all, of bringing\nBoltzmann\nfully back to life, as a scientist, a philosopher and a poet, thanks to painstaking research.\nThe\nJournal of Statistical Physics\nhas a review\n(\nin Vol\n98\n, No\n5\n/\n6\n,\n2000)\nwhich notes that the book contains:-\n... a thorough analysis of\nBoltzmann\n's scientific achievements by an expert on modern kinetic theory, who has also made an effort to read the original papers in \"dense German\" and has surveyed some of the extensive biographical material. The result is a book that can be highly recommended to all physical scientists and mathematicians, including graduate students.\nCercignani received many honours for his wide-ranging contributions to mathematics and physics. He was elected to the\nParis Academy of Sciences\non\n13\nMarch\n1995\n. The citation reads:-\nThe scientific work of Carlo Cercignani in fluid mechanics is dominated by a significant contribution to the kinetic theory of gases and the properties of the\nBoltzmann\nequation. He established important theoretical results, including properties of existence and uniqueness of solutions of initial value problems, which are the basis of recent developments in methods for numerical simulation of gas in networks. Carlo Cercignani has contributed much to the international life of the science community, especially during his terms on the Council of the European Society of Mechanics\n(\nEUROMECH\n)\nand the General Assembly of the International Union of Theoretical and Applied Mechanics\n(\nIUTAM\n)\n. Great friend of France, he greatly appreciated his visits to universities in Paris, at the École Polytechnique and the Institut des Hautes Études Scientifiques.\nAmong the other honours he received we mention that he was elected to the Istituto Lombardo and the\nAccademia dei Lincei\n. He was awarded the Gold Medal of the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\n(1982)\n, the Città di Cagliari Prize for Applied Mathematics\n(1991)\n, the Humboldt Prize\n(1994)\n, and the Gold Order of the Italian Order of Merit for Culture and Art\n(1999)\n.\nFinally, we should note that Cercignani's publication list includes many, perhaps surprising, items such as\n[\n15\n]\n:-\n... a collection of poems, a comedy, translations of Homer, and a guide for helping Italians to pronounce Japanese.\nThe poems were published as\nScherzi in versi\nⓉ\n(\nJokes in verse\n)\n(1999)\nand the novel is entitled\nLa creazione secondo Michele\nⓉ\n(\nCreating a second Michael\n)\n. Luigi Galgani\n[\n9\n]\n, ends his article with this personal note:-\nJust a few days ago, putting some order to my own bookshelves, I found a recent poem of his that somehow had escaped my attention. This poem seems now particularly interesting to me, as it gives an indication of how he lived his last days, when he was almost completely paralyzed. He actually continued to deal with people in his usual way, somehow by joking at first, then perhaps reciting from memory with his beautiful voice a poem suited to the moment, then re-entering into himself and starting thinking about something.\nThe poem I found has the title \"Beethoven in heaven\"\n[\nThis was an Italian translation by Cercignani of a poem Beethoven im Himmel of\nLudwig Boltzmann\n]\n, and is essentially a meditation on pain. Carlo describes how after death he very joyfully goes to heaven. But strangely enough, the chorus of the angels he hears is a little monotonous, and Carlo cannot refrain from telling them. From the style, he recognises it as a piece of Beethoven, but one unknown to him. The angels confirm it, saying Beethoven composed it in heaven. So he asks to meet the composer, which he is allowed to do. Requested by Beethoven to give his opinion about his music, Carlo refrains from speaking, but then, as Beethoven insists, with great humility admits he would have expected some more sublime music. And Beethoven says he completely agrees. \"Everything in heaven comes out badly to me. I'm even refraining from composing anymore. You know why? I'm lacking the creative spark, the note that most shines; this note is pain ... Only the one who cries and groans in pain will have humanity, the divine gift ... Did you ever cry together with your wife? The one who doesn't do it is unable to capture true love ... God too, when he was seen among us, was he a king, or wanted to be rich? He was a man's son, full of pain. ...\" So Carlo looks at Beethoven ... \"How strange - he thinks - is the flowing of the world. A few hours ago I was asking that death should take away the pain in my heart. Now, here, in this high and blessed world, I miss pain. Oh human heart, truly unfathomable and indeed strange.\"",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}