{
  "nome_completo": "Caspar Wessel",
  "nome_curto": "Caspar Wessel",
  "ano_nascimento": "1745",
  "ano_morte": "1818",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wessel/",
  "lugar_nascimento": "Vestby (near Dröbak), Norway",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Caspar Wessel\n's father, Jonas Wessel, and his grandfather were both ministers in the church. His mother, Helene Marie Schumacher and Jonas had a large family consisting of fourteen children; Caspar was the sixth of the fourteen. Caspar, together with his two elder brothers Johan Herman Wessel and Ole Christopher Wessel, attended Christiania Cathedral School in the city of Christiania from\n1757\nuntil\n1763\n(\nChristiania was later renamed Kristiania, then Oslo in\n1925)\n.\nCaspar could not attend university in Norway for, at that time, there were no Norwegian universities. Since Norway was united with Denmark, the natural place for Norwegians to go for a university education was Denmark, and Caspar's brothers Johan Herman and Ole Christopher were already at the University of Copenhagen, having entered in\n1761\n. Caspar spent one year, from\n1763\nto\n1764\n, studying at the University of Copenhagen but, as one might imagine, the large family was putting quite a strain on his parent's finances. As we shall see below, this led to both Caspar and his brother Ole Christopher obtaining positions as surveyors with the\nRoyal Danish Academy of Sciences\n.\nOle Christopher and Caspar were studying at the University of Copenhagen for a law degree. Ole Christopher started to work as a surveyor to help pay his way through university while Caspar was still at school. Obtaining his law degree in\n1770\n, Ole Christopher went on to reach a very elevated position in the legal profession in Norway. Johan Herman\n(\nthree years older than Caspar\n)\nbecame a poet and is the only one of the Wessel children to have their own entry in\nEncyclopaedia Britannica\n(\nalthough Caspar is mentioned in three of the mathematics articles\n)\n. Johan Herman is described as a:-\n... writer and wit, known for his epigrams and light verse and for a famous parody of neoclassical tragedy.\nThe\nRoyal Danish Academy\nbegan an ambitious project to undertake a topographical survey of Denmark and also to use triangulation to determine geographical coordinates. The project was led by Thomas Bugge, a professional surveyor, and Christen Hee, the professor of mathematics in Copenhagen. Ole Christopher was employed as a surveyor on this project from\n1762\n, and, when he needed an assistant in\n1764\n, his brother Caspar joined the project to help him. Caspar, like his brother Ole Christopher, continued to study for his law degree which he eventually achieved after fifteen years. However by that time he was so involved with surveying that he remaining in that profession the rest of his working life.\nThroughout his life Wessel suffered financial hardship. Certainly he earned to little as an assistant that he requested he might be allowed to draw maps, as well as surveying, so that his income might be sufficient to allow him to survive. This request was granted and he was given quite a lot of increased responsibility drawing maps based on the data which was being gathered from the triangulation survey. The maps he drew marked\n[\n4\n]\n:-\n... the locations of towns, churches, castles, mills, and woods, the courses of roads and streams, and the positions of coastlines and islands.\nWork which had originally been intended to provide Wessel with the financial support to complete his university course had become such a major undertaking that there was not enough time left for him to study. Fearing that he would never complete his degree with his work for the Academy running at this high level, yet knowing that he could not survive financially without this income, he requested a sabbatical year on full pay to complete his degree course. Christen Hee, the professor of mathematics, strongly supported Wessel's application writing\n(\nsee for example\n[\n4\n]\n)\n:-\nNone of the surveyors has been more useful to us than\n[\nWessel\n]\nhas, during the summers he has been surveying and in the winter time he has been working as a designator, which in the fourteen years he has stayed with the surveying has ruined his health and been an obstacle to his studies in such a way that if he once again has to interrupt his studies he is lost and will never pick them up again. Last winter when he half unwillingly, half willingly had to draw the general map of Zealand he was once more distracted in his studies, and then I promised him never again to disturb his circles.\nWessel's sabbatical was granted and he was indeed able to complete his law degree. However, after the sabbatical year he returned to his tasks of surveying and map construction. Such tasks required demanding mathematical skills and Wessel was an innovator in finding new methods and techniques. When he compiled reports on his work, Wessel appended short articles explaining the theoretical ideas behind the methods he was employing.\nIn May\n1782\nWessel was released from his work with the\nRoyal Danish Academy\nso that he could conduct a trigonometrical survey of the duchy of Oldenburg. Oldenburg had come under Danish control in\n1667\nbut in\n1773\n, not long before Wessel was asked to survey it, Oldenburg had been exchanged by Christian VII of Denmark for Holstein-Gottorp. Bugge, who headed the survey work at the\nRoyal Danish Academy\nwrote a letter recommending Wessel for the post\n(\nsee for example\n[\n4\n]\n)\n:-\nHe possesses a lot of theoretical knowledge of algebra, trigonometry and mathematical geometry, and as far as the last point is concerned, he has come up with some new and beautiful solutions to the most difficult problems in geographical surveying.\nWessel worked on the survey of Oldenburg until the summer of\n1785\nwhen he returned to his work with the\nRoyal Danish Academy\n. He had been developing more and more sophisticated mathematical methods of surveying and these he explained fully in a report he wrote in\n1787\n. This report already contains Wessel's brilliant mathematical innovation, namely the geometric interpretation of complex numbers.\nBy\n1796\nWessel had completed the triangulation of Denmark and used the data to produce the first really accurate map of the country. In the same year he wrote his one and only mathematical paper and presented it to a meeting of the\nRoyal Danish Academy\non\n10\nMarch\n1797\n. Only in the year before had the Academy relaxed its rule that all papers must be written by members of the Academy, and Wessel's paper was the first to be accepted which was not authored by a member.\nWessel's fame as a mathematician rests solely on this paper, which was published in\n1799\n, giving for the first time a geometrical interpretation of complex numbers. Today we call this geometric interpretation the\nArgand\ndiagram but Wessel's work came first. It was rediscovered by\nArgand\nin\n1806\nand again by\nGauss\nin\n1831\n.\n(\nIt is worth noting that\nGauss\nredid another part of Wessel's work, for he retriangulated Oldenburg in around\n1824\n.\n)\nOf course it is not unreasonable to call the geometrical interpretation of complex numbers the\nArgand\ndiagram since it was\nArgand\n's work which was influential. It was so named before the world of mathematics learnt of Wessel's prior publication. In fact Wessel's paper was not noticed by the mathematical community until\n1895\nwhen\nJuel\ndraw attention to it and, in the same year,\nSophus Lie\nrepublished Wessel's paper. A French translation, made by\nZeuthen\n, was published in\n1897\nand it was not available in English until even later:\n[\n7\n]\n.\nJohannes Nikolaus Tetens\nwas a professor of mathematics and philosophy at the University of Copenhagen near the end of the\n18\nth\ncentury, and it was because of his encouragement that Wessel presented his paper to the Academy. In fact Wessel, not being a member of the Academy, was not present when his paper was read. It was\nTetens\nwho presented the paper to the Academy on\n10\nMarch\n1797\n. One can only suppose that, despite\nTetens\nencouraging Wessel, he could not have realised its importance for otherwise he certainly could have translated it from Danish to German and thus ensured for Wessel the world-wide fame as a mathematician which he has not achieved until very recent times.\nWe have called Wessel's work remarkable, and indeed although the credit has gone to\nArgand\n, many historians of mathematics feel that Wessel's contribution was\n[\n1\n]\n:-\n... superior to and more modern in spirit to\nArgand\n's.\nIn the\n[\n1\n]\narticle the approaches by\nArgand\nand Wessel are compared and contrasted. Of course Wessel was a surveyor and his paper was motivated by his surveying and cartography work:-\nWessel's development proceeded rather directly from geometric problems, through geometric-intuitive reasoning, to an algebraic formula.\nArgand\nbegan with algebraic quantities and sought a geometric representation for them. ... Wessel's initial formulation was remarkably clear, direct, concise and modern. It is regrettable that it was not appreciated for nearly a century and hence did not have the influence it merited.\nHowever more is claimed for Wessel's single mathematical paper than the first geometric interpretation of complex numbers. In\n[\n3\n]\nCrowe credits Wessel with being the first person to add vectors. Again this shows the depth of Wessel's thinking but again, as the paper was unnoticed it had no influence on mathematical development despite appearing in the\nMémoires of the Royal Danish Academy\nwhich by any standard was a major source of publications.\nIn many ways Wessel was a remarkable person, and here we are not only referring to his mathematical brilliance. Despite his poverty, he refused to accept payment for maps which he had been commissioned to make. He did accept the award of a silver medal from the\nRoyal Danish Academy\nfor his work on maps but medals did not make him well off. He resigned from his work with the\nRoyal Danish Academy\nin\n1805\nwhen he was\n60\nyears old. He did not give up drawing maps, however, and he still helped the\nRoyal Danish Academy\nwhen necessary. One of the maps he drew after he retired was a map of Schleswig-Holstein which had been requested by Napoleon Bonaparte.\nIn\n1815\nWessel was made a Knight of the Order of Dannebrog:-\n... in recognition of his exceptional contribution to surveying.",
  "math_areas": []
}