{
  "nome_completo": "Chandra Mohan Rao Kintala",
  "nome_curto": "Chandra Kintala",
  "ano_nascimento": "1948",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kintala/",
  "lugar_nascimento": "Berhampur, Orissa, (now Brahmapur, Odisha) India",
  "lugar_morte": "Summit, New Jersey, USA",
  "biografia": "Chandra Kintala\n's parents were Kumaraswamy Kintali and Drowpadi. Chandra was born in Berhampur which is a town in the south east of the state of Orissa in eastern India. The town lies\n14\nkm from the Bay of Bengal on the Calcutta-Madras national highway and the South-Eastern Railway line. The authors of\n[\n6\n]\nwrite:-\nHe lost his father in his early teens, which made him face the reality of life quite early and which had a formative influence on him, both as a person and as a scientist. As a person in the sense that he always felt strong responsibility for everything he did and for the people who depended on him privately and professionally. As a scientist in the sense that, although he loved theoretical work, he never lost sight for the so-called more practical aspects and problems of computer science.\nKintala studied at the Rourkela Engineering College in Raurkela, Orissa. The College was quite a new one at the time, having been set up in\n1961\nwhen Jawaharlal Nehru, the Prime Minister of India, laid the foundation stone. Kintala was awarded a B.Tech. from the College in\n1970\n. He then studied for his Master's degree at the Indian Institute of Technology, Kanpur, India. This Institute, established in\n1959\n, was the first in India to offer courses in Computer Science. The first such courses were established in the Electrical Engineering department in\n1963\nand, in\n1971\n, it began teaching a programme of Computer Science and Engineering leading to a Master's degree, the M.Tech. Kintala studied for this degree and was awarded an M.Tech. in Electrical Engineering in\n1973\n.\n[\nWe should note that the Indian Institute of Technology, Kanpur, has three references to Kintala on its website, each giving a different year for him graduating with the M.Tech. - we believe that\n1973\nis the correct date.\n]\nIn\n1973\nhe travelled to Canada to study for a doctorate. He enrolled in the Ph.D. programme at the University of Waterloo where his thesis advisor was Patrick Carl Fischer. However, in\n1974\nFischer moved to Pennsylvania State University in the United States to take up the position of Head of Department, and Kintala decided to move with his thesis advisor and enrolled in the Ph.D. programme at Pennsylvania State. He was awarded his doctorate in\n1977\nfor his thesis\nComputations with a restricted number of nondeterministic steps\n. Kintala presented an extended abstract of his thesis results in a joint paper with his thesis advisor Patrick Fischer to the Ninth Annual ACM Symposium on Theory of Computing held at Boulder, Colorado in May\n1977\n. It was published in the conference proceedings. Following the award of his doctorate, Kintala was appointed as an Assistant Professor at the University of Southern California in\n1977\n.\nIn\n1978\nKintala published\nRefining nondeterminism in context-free languages\n. Matti Linna writes in a review:-\nThe author establishes four infinite hierarchies of families of context-free languages based on\n(\ni\n)\nfinite unions,\n(\nii\n)\nnumber of nondeterministic moves of nondeterministic pushdown automata,\n(\niii\n)\nfinite intersections, and\n(\niv\n)\nfinite concatenations, respectively. All these hierarchies lie between the families of deterministic and unambiguous context-free languages.\nHe also published a joint paper with Patrick Fischer entitled\nReal-time computations with restricted nondeterminism\nin\n1979\n.\nRonald Vernon Book\nwrites in a review:-\nThe authors investigate the nature of nondeterminism by restricting the number of nondeterministic moves in accepting computations of a multitape\nTuring\nmachine. Despite one erroneous \"theorem\", the paper presents some interesting facts which add to our understanding of automata-based complexity theory.\nAs well as being years in which he undertook deep research into the theory of computation, particularly working with his colleague Seymour Ginsburg and with\nRonald Book\nwho was working at the University of California at Santa Barbara, he also married and settled into a family life\n[\n6\n]\n:-\nHe married in\n1978\nand lived with his wife Bharati in Santa Monica, where their daughter Sreelata was born, until\n1980\n. As much as Chandra enjoyed life there, professionally and privately, he missed a close interaction with the more practical side of computer science. So when the opportunity arose to join Bell Labs in Murray Hill, he immediately saw this as a chance and moved to New Jersey in\n1980\n, where a few years later his son Kumar was born. Those years were, in his own words, among the happiest years of his life, as the research culture at Bell Labs provided exactly the close and stimulating interaction between theory and applications that he had always been looking for. And since he always liked teaching, he also taught courses at Steven's Institute of Technology in New Jersey, first as an Adjunct Professor and later as a Distinguished Industry Professor.\nThe authors of\n[\n2\n]\nwrite about his most important contributions while at the Bell labs:-\nHe spent\n23\nyears doing research and managing research in the family of Bell Labs at AT&T, Lucent and later Avaya, all in New Jersey. His last position was Vice President of Research Realization Center in Avaya Labs. Some of the noteworthy accomplishments in Bell Labs are:\n(\na\n)\na language and a software tool now called \"Backtalk\" with Dr David Belanger in\n80\ns; it is still used in AT&T for data analytics on very large databases,\n(\nb\n)\nconcepts and the components for Software-implemented Fault Tolerance and Software Rejuvenation with Dr Yennun Huang in early\n90\ns; they are now widely used in industry and academia,\n(\nc\n)\na Layer\n7\nnetwork switch based on Linux for web content distribution in his department in late\n90\ns; it led to a new business group in Lucent, and\n(\nd\n)\nan enterprise network monitoring system called Expertnet in early\n2000\ns; it is still a key component in several products and services from Avaya.\nTogether with David Belanger, Kintala was awarded a patent for \"A generator of program generators\" in\n1986\n. They describe their invention as follows:-\nOur innovative code generation technique interprets a program abstraction, derived after studying a class of programs, against an attributed tree, representing a specification of problem instance, to generate a target program for solving the problem from the specification. The code generator which has two parts is flexible in two aspects. First, a basic part allows flexibility within a domain by interpreting many abstractions of problems. A domain dependent part allows the technique to be applied to different problem domains.\nKintala's work with Yennun Huang also led to a Japanese patent for \"Device and method for updating software\" in\n1995\nand a Canadian patent for \"Progressive retry method and apparatus having reusable software modules for software failure\", also in\n1995\n. In total he was awarded five patents throughout is career.\nAlthough much of Kintala's work falls outside what we would call mathematics, there is still quite a substantial number of papers which do fall within that topic and are reviewed in Mathematical reviews. Among these are the multi-authored articles\nStrict interpretations of deterministic pushdown acceptors\n(1981)\n,\nConcurrent conciseness of degree, probabilistic, nondeterministic and deterministic finite automata\n(1986)\n,\nOn measuring nondeterminism in regular languages\n(1990)\n, and\nConcise representations of regular languages by degree and probabilistic finite automata\n(1993)\n. As to his teaching, let us note the courses he gave at Stevens Institute of Technology, Hoboken. in\n2005\n: Applied Data Structures and Algorithms; Software Systems Design - Principles and Practices; Network Systems Design - Principles and Practices; and Computational Algorithms and Data Structures.\nIn September\n2006\n, Kintala left the United States and returned to India, taking up an appointment with Motorola Inc. The Company made the following announcement on\n19\nSeptember\n[\n7\n]\n:-\nMotorola Inc on Monday announced the appointment of Chandra Kintala as Director, India Research Lab. Based in Bangalore, Mr Kintala will oversee the work of all Motorola Lab centres of excellence in India.\nSpeaking of his appointment, Kintala said\n[\n4\n]\n:-\nI am very enthusiastic and delighted to join Motorola. I am now returning to an industry applied research environment. Motorola Labs is at the forefront of applied research and leading the team in India will be a great opportunity as well as an honour.\nAfter two years, Kintala left Motorola and, remaining in Bangalore, he worked for Yahoo Labs for one year\n[\n6\n]\n:-\nThere he was responsible for research in mobile communications, system sciences and for academic relations with top technical institutes in India.\nIn August\n2009\n, having worked for three years in India, he went again to the United States to take up an academic post. He was appointed as Professor and Director of Software Engineering in its Computer Science Department of the New Jersey Institute of Technology in Newark. Sadly he only held this position for a few months before a heart attack led to his sudden death at the age of\n61\n. He is buried at Somerset Hills Memorial Park, Basking Ridge, New Jersey. His last paper was\nRejuvenation in Embedded Systems\n(2009)\npublished in the\nJournal of Automata, Languages and Combinatorics\n.\nAs to Kintala's interests other than his work\n[\n2\n]\n:-\nHe enjoyed travelling, reading, writing, and spending time with family and friends.\nKintala was honoured with the award of the Smithsonian medal, sponsored by\nComputer World\n, in\n1998\n. Let us end by quoting one of the tributes from\n[\n1\n]\n:-\nChandra Kintala was a man of learning and insight and possessed extraordinary clarity of mind. His prodigious intellect was rivalled only by his kindness and humanity. His death is a loss to the U.S. technical community and to the nation, for teachers such as Chandra are badly needed.",
  "math_areas": [
    "Combinatorics",
    "Number Theory"
  ]
}