{
  "nome_completo": "Charles Julien Brianchon",
  "nome_curto": "Charles-Julien Brianchon",
  "ano_nascimento": "1783",
  "ano_morte": "1864",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brianchon/",
  "lugar_nascimento": "Sèvres, France",
  "lugar_morte": "Versailles, France",
  "biografia": "Charles-Julien Brianchon\n's background is not known. We do not know anything of his primary or secondary education and the first definite educational record that exists is his entry into the École Polytechnique in\n1804\nat the age of eighteen.\nAt the École Polytechnique in Paris, Brianchon studied under\nMonge\n. In fact he published his first paper\nSur les surfaces courbes du second degré\nⓉ\n(\nOn curved surfaces of the second degree\n)\nin the\nJournal de l'École Polytechnique\nwhile still a student. In that paper Brianchon rediscovered\nPascal\n's Magic Hexagon. He showed that in any hexagon formed of six\ntangents\nto a\nconic\n, the three diagonals meet at a point. This result is often called Brianchon's Theorem and it is the result for which he is best known. In fact this theorem is simply the dual of\nPascal\n's theorem which was proved in\n1639\n:-\nIf all the vertices of a hexagon lie on a conic, and if the opposite sides intersect, then the points of intersection lie on a line.\nIn\n[\n1\n]\nGreitzer points out that\nPascal\nrecognised that his theorem was\nprojective\nin nature so it is surprising that it took\n167\nyears before someone realised that its dual, which is Brianchon's Theorem, would also be true.\nBrianchon graduated in\n1808\nas first in his class. One might have expected him to continue at this stage to an academic career but these were unusual times in France. Napoleon Bonaparte had declared an empire in\n1804\nwith himself as Emperor. He basically controlled continental Europe and he had only the British to fight against, but without control of the seas he could not mount an invasion. The British under Nelson won a decisive victory at Trafalgar where the Franco-Spanish fleet was destroyed. Napoleon then tried the tactic of blockading Britain and so he gave an order to stop all trade with the British Isles. However Portugal was reluctant to stop trading with Britain, both for economic and political reasons, and Napoleon decided to send his armies to Portugal to force them to comply with his orders. At around this time Brianchon graduated from the École Polytechnique and became a lieutenant in artillery in Napoleon's army.\nAlthough Spain allowed Napoleon's armies to cross their country the campaign was to turn out badly for Napoleon. The army occupied Lisbon but when Napoleon tried to install Joseph Bonaparte, king of Naples, as the Spanish king there was a revolt in Spain. Brianchon is said to have fought bravely in Napoleon's campaign in both Portugal and in Spain, but he was on the losing side for Napoleon's forces were defeated in both Spain and Portugal. Not only was Brianchon a brave soldier, but he was also said to be a very able one.\nBrianchon remained with Napoleon's troops through the next few years but, despite a fine military career, the hard army life affected his health. In\n1813\n, with all the fighting over, he applied to leave active service because of ill health and to take up a teaching position. It took him five years to find an appointment but eventually he was successful. In\n1818\nhe become a professor in the Artillery School of the Royal Guard in Vincennes.\nBetween\n1816\nand\n1818\nwhile he was seeking a teaching appointment Brianchon wrote a number of papers. In these Brianchon proved several further important results in the projective study of conics. However, Brianchon did less and less research into mathematics after his teaching appointment and he turned to other interests. One paper which he did publish after taking up the appointment at Vincennes was a joint publication with\nPoncelet\n. In this paper\nRecherches sur la détermination d'une hyperbole équilatère, au moyen de quatres conditions donnée\nⓉ\n(\nResearch on the determination of an equilateral hyperbola, through four given terms\n)\n(1820)\nthere appears a statement and proof of the nine point circle theorem. Certainly they were not the first to discover this theorem, but they were the first to give a proper proof of the theorem and also they used, for the first time, the name \"nine point circle\".\nBy\n1823\nBrianchon's interests were turning to teaching and to chemistry. He published on both these topics but after\n1825\nhe gave up publishing completely and concentrated on teaching.",
  "math_areas": [
    "Logic"
  ]
}