{
  "nome_completo": "Charles Eugène Delaunay",
  "nome_curto": "Charles Eugène Delaunay",
  "ano_nascimento": "1816",
  "ano_morte": "1872",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Delaunay/",
  "lugar_nascimento": "Lusigny-sur-Barse, France",
  "lugar_morte": "At sea (near Cherbourg, France)",
  "biografia": "Charles Eugène Delaunay\ncame from a family of modest means. His father was Jacques Hubert Delaunay, a surveyor, and his mother was Catherine Choiselat, the daughter of a farmer. Charles was very close to his mother as a young child and remained so throughout his life. In\n1818\n, when Charles was two years old, his father acquired the office of a bailiff in Ramerupt, which is about\n20\nkm north east of Troyes. When he was still young Charles was sent to Troyes to live with one of his uncles who was a manual worker. He attended secondary school in Troyes and showed great promise both at school, where he excelled in mathematics, and with his hobby of making mechanical devices. He went to Paris in\n1833\nand in the following year he entered the École Polytechnique, being ranked second from all the students entering in that year. When Delaunay graduated in\n1836\nhe was ranked first among all students across all academic disciplines.\nMme la Marquise de Laplace donated a new annual prize, the\nLaplace\nPrize, to be given to the student who was ranked top in his year at the École Polytechnique. Delaunay had graduated before the prize was instituted but Mme de Laplace requested that he become the first recipient of the prize which consisted of the complete works of\nLaplace\n. It turned out to be a decision which changed the course of Delaunay's career, for reading\nLaplace\n's great works gave him a passion for celestial mechanics and he decided that he would make a career in that subject. Mme la Marquise de Laplace was delighted with the first winner of the prize and she called him \"her eldest son\".\nArago\nsuggested to Delaunay that he come to the Paris Observatory and train to become an astronomer but\nSavary\nadvised against this course of action. Delaunay then entered the École des Mines and trained as an engineer.\nFor his doctoral dissertation Delaunay undertook research on the calculus of variations and was awarded his doctorate for his thesis\nDe la distinction des maxima et des minima dans les questions qui dépendent de la méthode des variations\nⓉ\n(\nKinds of maxima and minima in questions that depend on the method of variations\n)\nin\n1841\n. He published his first paper on astronomy submitting\nNote sur la précession des équinoxes\nⓉ\n(\nNote on the precession of the equinoxes\n)\nto the\nAcademy of Sciences\nin the same year.\nBiot\nchose him, later in\n1841\n, to substitute for him at the Sorbonne in giving the course in physical astronomy. On the one hand Delaunay gained excellent experience teaching at the Sorbonne, but he was still enrolled as a student at the École des Mines and he had to take an extra year to complete his studies there as a consequence. He completed his studies and qualified as an engineer in\n1843\n.\nDelaunay published further papers on astronomy, publishing several papers on perturbations of Uranus in\n1842\nand\n1843\nand after this his first work on the theory of tides. He was already working on his lunar theory by this time and published\nMémoire sur une Méthode nouvelle pour la détermination du mouvement de la Lune\nⓉ\n(\nMemoir on a new method for the determination of the motion of the Moon\n)\nin\n1846\n. This paper contains what today is known as 'Delaunay's method' although several of his later papers contain generalisations of the method as it first appeared here. Among his other works were\nCours élémentaire de mécanique\nⓉ\n(\nBasic course on mechanics\n)\n(1850)\nand\nTraité de mécanique rationnelle\nⓉ\n(\nTreatise on rational mechanics\n)\n(1856)\n, and\nCours élémentaire d'astronomie\nⓉ\n(\nBasic course of astronomy\n)\n(1853)\n. We should also note that when observations of the Moon's orbit showed that it was deviating from its theoretical path, Delaunay correctly suggested in\n1865\nthat this could be due to the rotational period of the earth slowing due to tidal friction. He published his theory in\nRalentissement de la rotation de la terre\nⓉ\n(\nSlowing of the rotation of the earth\n)\n(1866)\n. We mention also his report on the progress of astronomy\nRapport sur les progrès de l'astronomie\nⓉ\n(\nReport on the progress of astronomy\n)\n(1867)\n.\nFrom\n1845\nto\n1850\nhe taught courses at the École des Mines; these were descriptive geometry, stereotomy, mechanical drawing, analytical mechanics, and elementary physics. He suffered a great tragedy in\n1849\nwhen his young wife died and it was largely due to\nLiouville\n's efforts to support him at this time that he was able to continue with his academic work. He taught mechanics at the École Polytechnique from\n1850\nbeing named Professor of Mechanics there in\n1851\n. He also held a chair of mechanics at the Sorbonne from\n1850\n. In\n1855\nDelaunay was elected to the Astronomy Section of the\nAcademy of Sciences\n. He continued his association with the École des mines, being named Engineer in Chief in\n1858\n, then being raised to Engineer First Class in\n1867\n. He published, in\n1860\nand\n1867\n, two volumes on lunar theory\nLa Théorie du mouvement de la lune\nⓉ\n(\nThe theory of lunar movement\n)\nwhich contained the results of twenty years work. Of course the theory of the moon is an important case of the\nthree body problem\n. Delaunay found the longitude, latitude and\nparallax\nof the Moon as infinite series. These gave results correct to\n1\nsecond of arc but were not too practical as the series converged slowly. However this work was important in that it contained the beginnings of\nfunctional analysis\n. From\n1862\nhe was a member of the Bureau des Longitudes.\nWe should mention the rivalry between Delaunay and\nLe Verrier\n. This evolved into a full scale argument and around\n1860\nit was most certainly a very public argument. We should remark that\nLe Verrier\nwas a difficult man and fell out with many of his colleagues.\nLe Verrier\nwas the Director of the Paris Observatory and by\n1869\nhe had become very unpopular with his colleagues at the Observatory following his drive for efficiency. Attempts were being made to have him removed which were eventually successful. He was dismissed from his post as Director and in March\n1870\nDelaunay was appointed to the post to succeed his rival. However Delaunay's appointment came only weeks before France declared war on Prussia.\nThe popularity of Napoleon III, the French emperor, had declined and he decided that a war with Prussia might change his political fortunes. His advisers had told him that the French Army could defeat Prussia with ease, so the plan looked like a winner. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states so he too saw the political advantage of war. With both sides actively seeking a war, the Franco-Prussian War became inevitable. On\n14\nJuly\n1870\n, Bismarck sent a telegram aimed at infuriating the French government. He succeeded, for on the\n19\nJuly France declared war on Prussia. The German offensive met with only an ineffective French reply. In August, the German army trapped part of the French army in Metz and they surrendered on\n1\nSeptember. On\n19\nSeptember the German army began to blockade Paris which surrendered on\n28\nJanuary\n1871\n. This was a time of extreme difficulty for Delaunay who succeeded against all the odds to save the Paris Observatory. The French government was threatened by an uprising in Paris in March\n1871\n, in which radicals established their own short-lived government, the Paris Commune. The Commune was suppressed after two months of bitter fighting during which time Delaunay had an equally difficult task keeping the Observatory safe from the riots and fighting in the city. He largely succeeded but the Observatory did sustain some damage.\nIn\n1872\nDelaunay and three companions drowned in a boating accident when the boat they were in capsized following a gust of wind.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}