{
  "nome_completo": "Charles Jean Gustave Nicolas Baron de la Vallée Poussin",
  "nome_curto": "Charles de la Vallée Poussin",
  "ano_nascimento": "1866",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vallee_Poussin/",
  "lugar_nascimento": "Louvain, Belgium",
  "lugar_morte": "Louvain, Belgium",
  "biografia": "Charles de la Vallée Poussin\n's father was the professor of mineralogy and geology at the University of Louvain for around\n40\nyears. The original family name was Lavallée, a name of French origin. A great-grandfather of Vallée Poussin married into the family of Nicolas Poussin, the leading French artist of the\n17\nth\ncentury, and being an artist himself this great-grandfather added the name Poussin to his own name of La Vallée. So Vallée Poussin came from a family with both artistic and scientific interests, but it was also a family with literary interests.\nFrom his boyhood he was encouraged by the mathematician Louis-Philippe Gilbert but at first Vallée Poussin thought he would become a Jesuit priest. He entered the Jesuit College at Mons but he found the teaching there unacceptable. He was particularly disappointed in the teaching of philosophy at the College, so he turned to a different topic although he still did not have mathematics as his main interest. He studied engineering and obtained his diploma in that subject. However soon after this he became absorbed by pure mathematics. He studied at the University of Louvain where he was taught by Gilbert who proved to be an inspiring teacher. Gilbert was an excellent mathematician and the author of a fine analysis textbook. Vallée Poussin also studied at the University of Paris and at the University of Berlin.\nIn\n1891\nVallée Poussin was appointed as an assistant of Gilbert's at the University of Louvain. However the collaboration was not to last for long since Gilbert died in\n1892\n. Although only\n26\nyears old at the time Vallée Poussin was elected to Gilbert's chair.\nVallée Poussin's first mathematical research was on analysis, in particular concentrating on integrals and solutions of\ndifferential equations\n. One of his first papers in\n1892\non differential equations was awarded a prize by the\nBelgium Academy\n. His best known work, however, appeared four years later in\n1896\nwhen he proved the\nprime number theorem\n. This states that\nπ\n(\nx\n)\n\\pi(x)\nπ\n(\nx\n)\n, the number of primes ≤\nx\nx\nx\n, tends to\nx\nlog\ne\nx\n\\Large\\frac {x}{\\text{log}_e x}\nlog\ne\n​\nx\nx\n​\nas\nx\nx\nx\ntends to infinity.\nThe prime number theorem had been conjectured in the\n18\nth\ncentury, but in\n1896\ntwo mathematicians independently proved the result, namely\nHadamard\nand Vallée Poussin. The first major contribution to proving the result was made by\nChebyshev\nin\n1848\n, then the proof was outlined by\nRiemann\nin\n1851\n. The clue to two independent proofs being produced at the same time is that the necessary tools in complex analysis had not been developed until that time. In fact the solution of this major open problem was one of the major motivations for the development of complex analysis during the period from\n1851\nto\n1896\n.\nIn\n1900\n, while on holiday in Norway, Vallée Poussin met a Belgium family. He married the talented daughter of this family and it was a very happy marriage. The result was that he had a home where he and his wife were happy and contented. He lived in Louvain from the time he was first appointed there except for a few periods abroad. During the First World War he was invited to Harvard in\n1915\nand then to Paris in\n1916\n. Among a number of famous lectures he gave were those in Fribourg in\n1918\n, Rome in\n1923\nand Houston in\n1924\n.\nOther than the prime number theorem, Vallée Poussin's only contributions to prime numbers were contained in two papers on the\nRiemann\nzeta function\nwhich he published in\n1916\n. The\nRiemann hypothesis\n, perhaps the most famous of all the still open questions of mathematics, is that all the complex zeros of the zeta function lie on the line\n1\n2\n+\ni\nb\n\\large\\frac{1}{2}\\normalsize  + i b\n2\n1\n​\n+\ni\nb\n. Vallée Poussin strengthened results proved by\nHardy\nin\n1914\nwhich showed that an infinite number of the zeros were on that line. Vallée Poussin's results were of passing interest, however, for\nHardy\nand\nLittlewood\nproved still stronger results in\n1918\n.\nVallée Poussin also worked on approximation to functions by algebraic and trigonometric polynomials from\n1908\nto\n1918\n. Let us quote Vallée Poussin's own description of the problem of approximation as given in a lecture which he gave in Houston in\n1924\n:-\nThe most important of the problems which have been attacked in the study of approximation is that of the order of approximation. Let us define first what we mean by approximation. For example, let a continuous function\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nbe represented by means of a polynomial of degree\nn\nn\nn\n, and let\nP\nn\n(\nx\n)\nP_{n}(x)\nP\nn\n​\n(\nx\n)\nbe such a polynomial. The difference\nf\n−\nP\nn\nf - P_{n}\nf\n−\nP\nn\n​\nis the error of the approximation, and is a function of x; its maximum value in the interval of representation is the approximation\no\nn\no_{n}\no\nn\n​\n. This positive number approaches\n0\nas\n1\nn\n\\large\\frac{1}{n}\\normalsize\nn\n1\n​\napproaches zero, if the polynomial\nP\nn\nP_{n}\nP\nn\n​\nis well chosen. ... The problem of the order of approximation is the following: To determine the relation which exists between the order of approximation\no\nn\no_{n}\no\nn\n​\n, which\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nmay admit for a finite expression of order\nn\nn\nn\n, and the differential properties of the function.\nHe then continued to put his own contribution to this problem into context, although one must say that it is phrased in a very modest way:-\nI offered myself the beginnings of an answer to this very problem in\n1908\n, while studying the approximation given by\nEdmund Landau\n's integral. I showed also that the function |x| admits an approximation of the order of\n1\nn\n\\large\\frac{1}{n}\\normalsize\nn\n1\n​\nby a polynomial of degree\nn\nn\nn\n, and I raised the question of deciding whether or not that was the order of the best possible approximation. This definite question had much more importance for the development of the subject than the few isolated results which I had obtained, because that question caused the writing of the two most important memoirs on the subject, one by\nD Jackson\nand the other by\nSergei Bernstein\n.\nVallée Poussin's most major work was\nCours d'analyse\n.\nBurkill\nwrites in\n[\n2\n]\n:-\nIt was\n[\nJordan\n's Cours d'Analyse\n]\nwhich, as is recorded by\nHardy\nand other mathematicians of his generation, opened their eyes to what analysis really was. If\nJordan\n's is the most noble of the Cours d'Analyse and perhaps\nGoursat\n's\n(\nhelped by its translation by\nHedrick\n)\nthe most widely read, it can hardly be doubted that Vallée Poussin's is the most elegant and lucid.\nVallée Poussin's\nCours d'analyse\nⓉ\n(\nAnalysis Course\n)\nwent through several editions, each containing new material. By\n1899\n, several years before the publication of the first edition, much of the material already existed in the form of lecture notes. The first edition of Volume\n1\nappeared in\n1903\n, and the first edition of Volume\n2\nin\n1906\n. Volume I covered differentiation of functions of one or more variables, and integration of functions of a single variable. Volume\n2\ncovered multiple integrals, differential equations, and differential geometry. The treatise was written in an interesting way, combining an introductory text with an advanced work for specialists. The way this was achieved was having two different type sizes. If a reader only read the larger type then it was a complete introduction to the subject for beginners or those interested in applications to engineering. The smaller type material was aimed at the pure mathematical specialist interested in the deeper subtleties.\nThe work changed dramatically when a second edition appeared, Volume\n1\nin\n1909\nand Volume\n2\nin\n1912\n. Most of the additional material appeared in small type and covered topics such as set theory, in particular the\nSchröder\n-Bernstein theorem, the\nLebesgue\nintegral, functions of bounded variation, the\nJordan\ncurve theorem, polynomial approximation,\nParseval\n's theorem on trigonometric series, results of\nFejér\n, etc.\nThe third edition of Volume I again contained new material and was published in\n1914\n. However World War II disrupted Vallée Poussin's work. The promised German translation failed to appear and the third edition of Volume\n2\nwas burned by the German army when it overran Louvain. It would have discussed the\nLebesgue\nintegral, work which was never to be published in this form but a lot of it was incorporated into a later monograph. Unlike many similar books of its time\nCours d'analyse\nⓉ\n(\nAnalysis Course\n)\ncontains no complex function theory. The fourth edition appeared in\n1921\nand\n1922\n. It ended the larger/smaller print distinction and became a work aimed at beginners. The two volumes had reached their seventh edition by\n1938\nbut it went through much fewer changes after the fourth edition.\nAfter\n1925\nVallée Poussin turned to complex variable,\npotential theory\nand conformal representation. Further important texts published by him were his\nBorel\ntract on the\nLebesgue\nintegral\n(1916)\n, approximation theory\n(1919)\n, mechanics\n(1924)\n, and potential theory\n(1937)\n. In\n1930\nVallée Poussin was revising his\n1916\ntract\nLebesgue integrals: Set functions: Baire classes\nwhen\nLuzin\n's\nLectures on analytic sets and their applications\nwas published. The paper\n[\n5\n]\ncontains three letters written by Vallée Poussin to\nLuzin\ndated\n4\nFebruary\n1933\n,\n8\nMarch\n1933\nand\n21\nMarch\n1933\n. Vallée Poussin comments in these letters on the fact, which is of great interest to him, that\nLuzin\nused slightly different classifications of the same sets as he had studied. He gives high praise to\nLuzin\n's book.\nPublication of Vallée Poussin's work\nLe potential logarithmique\nⓉ\n(\nThe logarithmic potential\n)\nwas held up by World War II and only published in\n1949\n.\nVallée Poussin was elected to the\nBelgium Academy\nin\n1909\n. More honours were to follow including election to the Madrid Academy of Sciences, the Naples Society of Science, the\nAmerican Academy of Arts and Sciences\n, the Institute of France, the\nAccademia dei Lincei\n, the\nParis Academy of Science\n, and the\nAmerican National Academy of Sciences\n. There were celebrations in\n1928\nwhen Vallée Poussin had held the chair at the University of Louvain for\n35\nyears and again celebrations in\n1943\nwhen he had been\n50\nyears in the chair of mathematics at Louvain.\nIn\n1928\n, when he had held the chair at Louvain for\n35\nyears, the King of Belgium conferred the title Baron on Vallée Poussin at the celebrations for this event. In\n1961\nhe fractured his shoulder and since Vallée Poussin was in his mid\n90\ns it failed to heal. His death followed a few months later.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}