{
  "nome_completo": "Charles Sanders Peirce",
  "nome_curto": "Charles S Peirce",
  "ano_nascimento": "1839",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peirce_Charles/",
  "lugar_nascimento": "Cambridge, Massachusetts, USA",
  "lugar_morte": "Milford, Pennsylvania, USA",
  "biografia": "Charles S Peirce\nwas the son of\nBenjamin Peirce\nand Sarah Hunt Mills, the daughter of Senator Elijah Hunt Mills. We note that this surname is pronounced \"Purse\". Charles was the second of his parents five children. His older brother was James Mills Peirce who became a mathematician in the Mathematics Department at Harvard, and then from\n1890\nto\n1895\nserved as Dean of the Graduate School at Harvard and, after that, as Dean of the Faculty of Arts and Sciences. Charles' two younger brothers also enjoyed successful careers, Benjamin Mills Peirce as a mining engineer and Herbert Henry Davis Peirce as a diplomat.\nCharles was born into a leading American household. His father was perhaps the leading scientist in America and he invited academics, politicians, poets, scientists, and mathematicians into his home. A child prodigy, Charles thrived in the intellectual atmosphere.\nBenjamin Peirce\nfound it difficult to find students who were bright enough to benefit from his teaching, but in his own children he found the talent that seemed to be lacking elsewhere. He used his own educational ideas in teaching Charles and his other children, and in many ways this did set them up to undertake research. However, realising that the greatest thinkers enjoyed an independence of thought, he refused to discipline his children in case he destroyed this originality. In many ways this upbringing produced the genius that Charles displayed but it also  gave Charles problems of fitting in, which meant that his life was a difficult one. By the age of twelve Charles was reading standard university level texts on logic, and in the following year he began reading Immanuel Kant's\nCritique of Pure Reason\n. He remained greatly influenced by Kant throughout his life.\nOne might have expected the brilliant young man Charles to make his mark in the education system, but it was at this stage that the independence of thought which his father has so carefully cultivated worked to his disadvantage\n[\n13\n]\n:-\nIn college he showed signs of his later difficulties in getting along with people: he did not excel in classwork, preferring to read works of his own choosing.\nHe entered  Harvard College in\n1855\nand graduated four years later with an A.B., continuing to study there at graduate level for a year. By this stage his father,\nBenjamin Peirce\n, was working for the United States Coast Survey and Charles began to undertake occasional work for the Coast Survey. In particular he worked for them beginning on\n1\nJuly\n1859\n. In\n1861\nhe entered the Lawrence Scientific School at Harvard, where again his father played an important role, and here he seems to have shone much more than in his undergraduate years. He received a Master's degree from Harvard in\n1862\nand then a Sc.B. with distinction from the Lawrence Scientific School in\n1863\n. On\n16\nOctober of that year he married Harriet Melusina Fay who came from a leading Cambridge family and was an active feminist campaigner.\nPeirce now undertook a range of different scientific studies. He had studied species classification with Louis Agassiz, a Harvard zoologist. He gave the Harvard lectures on\nThe Logic of Science\nin the spring of\n1865\nand the Lowell Institute lectures on\nThe Logic of Science; or Induction and Hypothesis\nin the latter part of\n1866\n. He was elected to the\nAmerican Academy of Arts and Sciences\non\n30\nJanuary\n1867\n, then from October\n1869\nto December\n1872\nhe conducted research in astronomy as an assistant at Harvard Observatory. Throughout this time he continued research in geodesy for the U.S. Coast Survey, and he was sent to Europe by the Survey from June\n1870\nto March on the following year. He continued to progress through the ranks at the U.S. Coast Survey being put in charge of pendulum experiments in November\n1872\n, then promoted to assistant in December of that year. The main task that Peirce carried out in his geodetic work for the U.S. Coast Survey was to measure the force of gravity at various sites both in the United States and abroad. His other task was to use the data from the results of his experiments to determine the shape of the earth. As part of this work he made further trips to Europe, from April\n1875\nto August\n1876\n, and again for three months from September\n1877\n. Between these two trips he separated from his wife Melusina in October\n1876\nand this marked the beginning of a problem which would greatly affect his career.\nFor a while Peirce's career continued to move forward. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin April\n1877\nand published the results of his earlier research in astronomy in a book\nPhotometric Researches\n(1878)\n. Although his work had been wide ranging in the sciences, he had always been interested in philosophy and logic and, in\n1879\n, he was appointed as Lecturer in Logic in the Department of Mathematics at Johns Hopkins University.\nSylvester\nwas Head of Mathematics at Johns Hopkins University at this time and for a while things went well for Peirce. He became interested in the\nFour Colour Problem\n, and problems of\nknots\nand linkages studied by\nKempe\n. He then extended his father's work on associative algebras and worked on mathematical logic, topology and set theory. However by now Peirce was living with Juliette Froissy Pourtalès, a French gypsy. He was divorced from his first wife Melusina on\n24\nApril\n1883\nand married Juliette six days later. In\n1884\nSimon Newcomb\n, who had just been appointed professor of mathematics and astronomy at Johns Hopkins University, reported to the trustees of the university that Peirce had been living with a French gypsy while still married to Melusina. Not wishing to be involved in a scandal, the trustees chose not to renew Peirce's contract. Peirce would never hold another academic post.\nPeirce's only steady work was now for the Coast and Geodetic Survey. He went to Washington, D.C. to work on data on gravity measurements which had been returned from the Artic. He moved to New York City in\n1886\nand continued on his work for the Survey but he became increasingly at odds with his superiors and worked more and more in isolation. The Coast Survey also came under increasing pressure through lack of funding by the government. Peirce moved into a rented house in Milford, Pennsylvania, in April\n1887\nbut after his mother died on\n12\nOctober of that year he inherited enough to purchase land and begin building an estate he called Arisbe near Milford. He purchased further land and a farm after he received a small inheritance from a maiden aunt in\n1888\n. When he finally submitted his major report on gravity to the U.S. Coastal Survey in\n1890\nit was rejected for publication unless he made major revisions. When nothing further was received from him by the end of\n1891\nthe Survey asked for his resignation. Peirce now had no income at all.\nDuring this difficult period in his life his wife was suffering from poor health. She was diagnosed as having tuberculosis in the middle of\n1889\nand before the end of the year she travelled to Europe in an attempt to recover. Returning to the United States in the spring of\n1890\n, she still was not well and in January of\n1891\nshe underwent surgery. Despite these health problems, which coincided with Peirce's difficulties with the U.S. Coastal Survey, Juliette outlived her husband.\nT S Fiske\n, writing about the\nNew York Mathematical Society\n(\nbefore it became the\nAmerican Mathematical Society\n)\nin\n[\n29\n]\n, describes Charles Peirce in the early\n1890\ns:-\nConspicuous among those who in the early nineties attended the monthly meetings ... was the famous logician, Charles S Peirce. His dramatic manner, his reckless disregard of accuracy in what he termed 'unimportant details', his clever newspaper articles describing the meetings of our young Society interested and amused us all. ... He was always hard up, living partly on what he could borrow from friends, and partly on what he got from odd jobs such as writing book reviews ... He was equally brilliant, whether under the influence of liquor or otherwise, and his company was prized by the various organisations to which he belonged; and he was never dropped from any of them even though he was unable to pay his dues. He infuriated\nCharlotte Angas Scott\nby contributing to the New York Evening Post an unsigned obituary of\nArthur Cayley\nin which he stated upon no grounds, except that\nCayley\n's father had for a time resided in Russia, that\nCayley\nhad inherited his genius from a Russian whom his father had married in St Petersburg. Shortly afterwards Miss\nScott\ncontributed to the Bulletin a more factual, sober article upon\nCayley\n's life and work ...\nMuch of what Peirce wrote from this time onwards was either rejected for publication, or he failed to complete the project. In the first category there is\nHow to Reason\n(\nrejected by two publishers in\n1894)\n, and\nNew Elements of Mathematics\n(\nrejected in\n1895)\n. In the second category is\nSearch for a Method\n(\nannounced in\n1893\nbut not completed\n)\n,\nThe Principles of Philosophy\n(\ntwelve volumes announced in\n1894\nbut not completed\n)\n, and\nThe History of Science\n(\nannounced in\n1898\nbut not completed\n)\n.\nPeirce today is most famous as a philosopher although it is fair to say that this fame only came late. In\n1877\nand\n1878\nPeirce published six essays on\nIllustrations of the Logic of Science\nin the\nPopular Science Monthly\n. The first two of these essays were\nThe Fixation of Belief\nand\nHow to Make Our Ideas Clear\n. It was in the second of these that he set out his pragmatic philosophy for which he is best known today. He wrote:-\nConsider what effects, which might conceivably have practical bearings, we conceive the object of our conception to have. Then, our conception of these effects is the whole of our conception of the object.\nBurch writes in\n[\n19\n]\n:-\nPerhaps the single most important fact to keep in mind in understanding Peirce's philosophy is that Peirce was a practicing physical scientist all his life ... When he said that the whole meaning of a\n(\nclear\n)\nconception consists in the entire set of its practical consequences, he had in mind that a meaningful conception must have some experiential \"cash value,\" capable of being specified as some sort of collection of possible empirical observations under specifiable conditions. Peirce insisted that the entire meaning of a meaningful conception consisted in the totality of such specifications of possible observations.\nIn fact it was twenty years after he published these ideas on pragmatism that, through the work of William James, Peirce began to gain the credit for his ideas. Peirce lectured on\nPragmatism\nat Harvard in March to May of\n1903\nand published a series of essays explaining his ideas in\nThe Monist\nin\n1905\n.\nIt is impossible to do justice to the breadth of Peirce's philosophical work in this article. Let us just note some further examples. He wrote on infinite sets and infinitesimals and argued for the consistency of introducing infinitesimals into the number system. He wrote on\nprobability\narguing against De Morgan's ideas that probability is a measure of confidence and also arguing against the ideas of Bayes. Rather for Peirce probability is the limit of the ratio of observed occurrences over the possible occurrences and the number of observations tend to infinity. He also studied universal categories and for him almost everything split into three categories or triads. On the mathematical side, coming out of his work for the Coast Survey, we mention that he was interested in\nconformal map\nprojections where he invented a quincuncial map projection using\nelliptic functions\n.\nWe have already indicated that Peirce was a somewhat unusual character. Here is a report of a lecture that Peirce gave to the Harvard Philosophy Club on\n21\nMay\n1879\nextracted from a letter written by Thomas Davidson:-\nPeirce's paper was captious, bright, and poor. After it was over, I had a long talk with Professor Benjamin Peirce, who undertook to prove to me mathematically that space has four dimensions. The Peirce's are all a little crazy, I think.\nPeirce died of cancer at his home at Arisbe, Milford, Pennsylvania.",
  "math_areas": [
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}