{
  "nome_completo": "Charles Loewner",
  "nome_curto": "Charles Loewner",
  "ano_nascimento": "1893",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Loewner/",
  "lugar_nascimento": "Lany, Bohemia (now Czech Republic)",
  "lugar_morte": "Stanford, California, USA",
  "biografia": "Charles Loewner\nhas several versions of his name. As we shall explain below, he was a Czech whose education was in German. His name in Czech was Karel Löwner but he was known as Karl Löwner\n(\nusing the German version of his first name\n)\n. He adopted the English version of his name, Charles Loewner, later in life after going to the United States. We shall refer to him in this article as 'Charles' or as 'Loewner' even during the period when he certainly was not using these versions.\nCharles was born into a Jewish family who lived in the village of Lany, about\n30\nkm from Prague. His father was Sigmund Löwner, who owned a store in the village. Although Jewish, and living near Prague, Sigmund was a lover of German culture and believed strongly in education, particularly German style education. Charles was brought up in a large family, having four brothers and five sisters; only eight of the nine children survived childhood however. Although he would be educated in German, the family spoke Czech at home.\nIn keeping with his father's wish to have his children educated in the German tradition, Charles was sent to a German\nGymnasium\nin Prague where not only the tradition but also the language was German. He graduated from the school in\n1912\nand, in that year, he began his studies in the German section of the Charles University of Prague. He embarked on a university course which would lead directly to a doctorate, rather than the somewhat lower level course which would lead to a qualification as a school teacher.\nIn Prague Loewner's research supervisor was\nGeorg Pick\nwho was himself a student of\nLeo Königsberger\n. Loewner worked on geometric function theory for his doctorate and after submitting his thesis he received a Ph.D. in\n1917\n. He was then appointed as an Assistant at the German Technical University in Prague and he worked there for four and a half years, from late\n1917\nto\n1922\n. It was not a mathematically stimulating environment for Loewner who found that his colleagues were not involved in deep research.\nWhen Loewner was offered a position at the University of Berlin in\n1922\nhe took up the offer enthusiastically, even though it meant that he was still going to be an Assistant. Although it was a lowly position, Loewner now had colleagues such as\nSchmidt\n,\nSchur\n,\nAlfred Brauer\nand his brother\nRichard Brauer\n,\nHopf\n,\nvon Neumann\n, and\nSzego\n. This is a stunning array of talent which the provided the mathematically stimulating environment which Loewner had lacked at the German Technical University in Prague.\nBers\nwrites\n[\n2\n]\n:-\nLoewner often spoke of his time in Berlin, clearly a happy period of his life. After Prague, the cosmopolitan capital of the Weimar republic must have felt like another world. ... Mathematical life was at a high pitch; for the first time in his life Loewner was surrounded by his mathematical equals.\nLoewner began to move up the academic hierarchy from being an assistant to teaching as a\nPrivatdozent\nin Berlin. Then in\n1928\nhe was appointed as extraordinary professor at Cologne, a position he held for two years before returning to the Charles University of Prague in\n1939\n. His initial appointment at Prague was as an extraordinary professor but he was soon promoted to full professor.\nOn\n30\nJanuary\n1933\nHitler came to power in Germany and on\n7\nApril\n1933\nthe Civil Service Law was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Of course this did not affect Loewner in Prague, but as he watched the suffering of his Jewish colleagues in Germany he began to become increasingly uneasy. He did all he could to help the Jewish mathematicians who were dismissed from their posts in Germany.\nIf the political situation gave him cause for concern, his own life was filled with happiness at this time. He married Elisabeth Alexander in\n1934\n. She came from Breslau and was a trained singer. Loewner took piano lessons so that he could accompany his wife as she practised her singing. In\n1936\ntheir daughter Marion was born and they lived happily in Prague, seeing the reality of what was happening in Germany and fearing the inevitable outcome of events there. Preparing for the inevitable after the Germans marched into Austria, Loewner took English lessons so that he would be ready for the day he had to leave his homeland.\nAmong the students Loewner supervised in Prague was\nLipa Bers\n.\nBers\nsaid that at first he failed to understand Loewner, since he felt he took little interest in his work. However\nBers\nsoon came to understand Loewner's methods which were to give his students as much help and encouragement as he felt they required - and\nBers\nwas a talented student who needed comparatively little support.\nBefore moving on to describe the next stage of Loewner's life we should comment of the mathematics he had produced up to this time. It was mathematics of the highest quality, but Loewner had a policy which meant that he only published results he felt were significant. He only published six papers during the\n25\nyears following the time that he began his research activities. However it is not an exaggeration to describe some of these as masterpieces.\nAs we have already mentioned, Loewner's research was on geometric function theory. He wrote a series of papers on this topic, culminating in one where he proved a special case of the\nBieberbach conjecture\nin\n1923\n. The\nBieberbach\nconjecture states that if\nf\nf\nf\nis a complex function\ngiven by the series\nf\n(\nz\n)\n=\na\n0\n+\na\n1\nz\n+\na\n2\nz\n2\n+\na\n3\nz\n3\n+\n.\n.\n.\nf (z) = a_{0} + a_{1}z + a_{2}z^{2} + a_{3}z^{3} + ...\nf\n(\nz\n)\n=\na\n0\n​\n+\na\n1\n​\nz\n+\na\n2\n​\nz\n2\n+\na\n3\n​\nz\n3\n+\n.\n.\n.\nwhich maps the unit disc conformally in a one-one way then, if\n∣\nz\n∣\n<\n1\n,\n∣\na\nn\n∣\n≤\nn\n|z| < 1, |a_{n}| ≤ n\n∣\nz\n∣\n<\n1\n,\n∣\na\nn\n​\n∣\n≤\nn\nfor each\nn\nn\nn\n. It can be expressed as:\nThe\nn\nn\nn\nth coefficient of a univalent function can be no more than\nn\nn\nn\n.\nLoewner proved that for such functions\nf\nf\nf\n,\n∣\na\n3\n∣\n≤\n3\n|a_{3}| ≤ 3\n∣\na\n3\n​\n∣\n≤\n3\n. We should also note that Loewner's proof uses the Loewner differential equation which has been studied extensively since he introduced it, and was used by\nde Branges\nin his celebrated proof of the\nBieberbach\nconjecture.\nAnother important paper written by Loewner during this period is devoted to properties of\nn\nn\nn\n-monotonic functions. The notion of an\nn\nn\nn\n-monotonic function is a generalisation of the usual idea of monotonicity. A function\nf\n:\n(\na\n,\nb\n)\n→\nR\nf : (a, b) \\to \\mathbb{R}\nf\n:\n(\na\n,\nb\n)\n→\nR\nis said to be\nn\nn\nn\n-monotonic if, for all symmetric real positive\nn\n×\nn\nn \\times  n\nn\n×\nn\n-matrices\nX\n,\nY\nX, Y\nX\n,\nY\nwith spectrum in\n(\na\n,\nb\n)\n(a, b)\n(\na\n,\nb\n)\n, then\nX\n≤\nY\nX ≤ Y\nX\n≤\nY\n(\nin the sense of quadratic forms\n)\nimplies\nf\n(\nX\n)\n≤\nf\n(\nY\n)\nf (X) ≤ f (Y)\nf\n(\nX\n)\n≤\nf\n(\nY\n)\n.\nBers\nwrites:-\n... both the problem posed and the answer given are totally unexpected. The functions which Loewner called\nn\nn\nn\n-monotonic turned out to be of importance for electrical engineering and for quantum physics ...\nAlthough aware of the increasing danger that he and his family were in, Loewner was still in Prague when the Nazis occupied the city. Loewner was immediately put in jail and he spent a week there trying to leave the country. After paying the 'emigration tax' twice over he was allowed to leave the country with his family.\nBers\nbelieves that most of the credit for this escape must go to Loewner's wife who worked tirelessly to achieve it\n[\n2\n]\n:-\nThe Loewners arrived in America penniless, but managed to bring their furniture and books.\nIt was at this point that he changed his name to Charles Loewner, a definite signal that he wished his family to make a new start in a new country.\nVon Neumann\narranged a position for him at Louisville University and the committee set up in the United States to deal with refugees such as the Loewners agreed to pay his salary for the first year. It was not easy for the\n46\nyear old, highly respected mathematician, to start from the bottom again, but that is what he had to do. Times were hard for Loewner\n[\n2\n]\n:-\n... teaching many hours of elementary courses and having to grade staggering piles of homework. Some students asked him to teach an advanced course, but when he agreed to do so, without additional remuneration, he was told, first, that this would take his mind off his primary duties, and then, that there was no free classroom. Finally Loewner taught his advanced course in a local brewery before the arrival of the morning shift.\nHe worked at Brown University from\n1944\non a program related to war work. His contributions here were to work on fluid dynamics where he produced some deep results about critical subsonic flows. Other results arose from his study of how to defend against kamikaze bombers.\nIn\n1946\nhe went to Syracuse University where he remained for five years before he moved to Stanford\n[\n2\n]\n:-\nThis was the right place for him and his family. He loved the California weather and the California nature. The house in Los Altos was the first real home the Loewners had since Prague. Among the distinguished mathematicians there were his old friends\nBergman\nand\nSzego\n, and he always knew how to make new friends. He had people to make music with and people to hike with\n(\nhe said that he got his best mathematics; ideas while walking\n)\n. He was a magnificent lecturer and students flocked to his courses and to his famous problem seminar. Only the untimely death of Elisabeth Loewner in\n1956\ndarkened the California years.\nLoewner was described by\nBers\nas follows\n(\nsee\n[\n2\n]\n)\n:-\nLoewner was a man whom everybody liked, perhaps because he was a man at peace with himself. He conducted a life-long passionate love affair with mathematics, but was neither competitive, nor jealous, nor vain. His kindness and generosity in scientific matters, to students and colleagues alike, were proverbial. He seemed to be incapable of malice. His manners were mild and even diffident, but those hid a will of steel. Without being religious he strongly felt his Jewish identity. Without forgetting his native Czech he spoke pure and precise German ... Without having any illusions about Soviet Russia he was a man of the left. He was a good storyteller, with a sense of humour which was at once Jewish and humanistic. But first and foremost he was a mathematician.\nFinally we should add a few words about the direction Loewner's research took. We have already mention his brilliant concept of\nn\nn\nn\n-monotonic functions. In this context he studied order preserving mappings and\nsemigroups\nof such mappings. Later on he looked at such semigroups in more abstract settings and produced some further beautiful results characterising projective mappings and certain geometric objects.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}