{
  "nome_completo": "Charles Graves",
  "nome_curto": "Charles Graves",
  "ano_nascimento": "1812",
  "ano_morte": "1899",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Graves_Charles/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "Charles Graves\nwas the son of John Crosbie Graves\n(2\nJuly\n1776\n-\n13\nJanuary\n1835)\n, a lawyer by training who became Chief Police Magistrate for Dublin, and Helena Perceval\n(1786\n-\n1850)\n, the daughter of the Rev Charles Perceval\n(1751\n-\n1795)\nof Templehouse, County Sligo. John and Helena Graves were married in\n1806\nand they had six children:\nJohn Thomas Graves\n(1806\n-\n1870)\n, who also has a biography in this archive; Helena Clarissa Graves\n(1808\n-\n1871)\n; Robert Perceval Graves\n(1810\n-\n1893)\n; James Perceval Graves\n(1811\n-\n1852)\n; Charles Graves, the subject of this biography; and Caroline Graves\n(1819\n-\n1855)\n. We note that Robert Perceval Graves was the author of the\n3\n-volume work\nLife of Sir William Rowan Hamilton\n(\nHodges, Figgis, Dublin,\n1882\n-\n1889)\n. In\n1814\n, when Charles was two years old, the family moved into a new home, a magnificent Georgian house at\n12\nFitzwilliam Square, Dublin. A plot on Fitzwilliam Square had been leased by Viscount Fitzwilliam to the merchant Nathaniel Calwell who employed the builder and master carpenter Richard Knight to build the houses numbered\n9\nto\n12\n. The Graves family acquired number\n12\nand members of the family lived there throughout the\n19\nth\ncentury.\nCharles, like his older brother\nJohn Graves\n, was educated at a school run by the Rev Samuel Field at Westbury-on-Trym, near Bristol, Gloucestershire in England, where he was prepared for university. Returning to Ireland, he entered Trinity College Dublin in\n1829\n, at this stage aiming at a military career in the\n18\nth\nRoyal Irish Regiment of Foot commanded by his uncle, Major-General James William Graves\n(1774\n-\n1845)\n. He studied classics and mathematics winning a foundation scholarship in\n1832\n. At the time when Graves began his studies\nWilliam Rowan Hamilton\nwas Andrews' Professor of Astronomy in Trinity College Dublin while Franc Sadleir\n(1775\n-\n1851)\nwas Erasmus Smith professor of mathematics.\nJames MacCullagh\nwas appointed junior assistant to the mathematics professor in\n1832\n.\nBartholomew Lloyd\nwas Erasmus Smith professor of Natural and Experimental Philosophy when Graves entered but he became Provost of Trinity College Dublin in\n1831\nand was succeeded as professor of Natural and Experimental Philosophy by his son\nHumphrey Lloyd\n. Having the aim of a military career, Graves had become an expert swordsman, an expert horseman and an enthusiastic sportsman. When he was an undergraduate he played cricket for the university. Graves graduated in\n1835\nwith a B.A. having specialised in mathematics and mathematical physics. He was ranked as the top student and won the gold medal in mathematics and mathematical physics.\nGraves' father had died earlier in the year in which he took his final undergraduate examinations. One of his father's colleagues, Judge Day, wrote when John Graves died\n[\n7\n]\n:-\nThursday,\n15\nth\nJanuary,\n1835\n. Alas poor John Graves died last Tuesday of a five days brain fever, leaving in misery a wife, two daughters and four highly talented and accomplish'd sons. He was my oldest acquaintance living of all my friends out of my own family and my own birth parentage and pedigree. I do not know better than his.\nIn\n1836\nGraves took the fellowship examinations:-\nThe examination for fellowship was formidable, being held on twelve days preceding Trinity Sunday from nine to twelve in the forenoon and two to five in the afternoon of each day. The subjects of the examination were pure and applied mathematics, experimental physics, mental and moral philosophy, Greek language and literature, Latin language and literature, and Hebrew and cognate languages.\nIt was highly unusual for anyone to succeed in winning a fellowship at their first attempt but Graves achieved this distinction. In\n1836\nhe attended\nMacCullagh\n's lectures, keeping careful notes. In\n1847\nGraves:-\n... stated that he still retains a large part of the memoranda, in which he set down, from day to day, the substance of Professor\nMacCullagh\n's lectures, delivered in Hilary Term,\n1836\n...\nOn\n15\nSeptember\n1840\nGraves married Selina Cheyne. Selina, born on\n25\nAugust\n1817\n, was the daughter of Dr John Cheyne and Sarah Macartney. John Cheyne was a Doctor of Medicine who was Physician General to the Forces in Ireland. Charles and Selina Graves' children were: Ida Margaret Graves; Rosamund Selina Graves; Augusta Caroline Graves; John Cheyne Graves; Helena Cecilia Graves; Alfred Perceval Graves; Arnold Felix Graves; Augusta Caroline Graves; Charles Larcom Graves; Robert Wyndham Graves; and Ida Margaret Graves. We note that Graves, being a junior fellow, could not have married before\n1840\nsince it was only in that year that the insistence by the Board of Trinity College that fellows be celibate was ended.\nThe first of Graves' published works appeared in\n1841\n. This was\nOn the General Properties of Cones of the Second Degree and of Spherical Conics\nwhich was a translation of work by\nMichel Chasles\nbut included much of Graves' own work\n[\n9\n]\n:-\nIn the copious notes appended to this translation he gave a number of new theorems of much interest, which he arrived at principally by\nChasles\n's methods. The most remarkable of these was his extension of the construction of an ellipse, as traced by a pencil which strains a thread passing over two fixed points, by substituting for the points a given ellipse, with which he showed that the locus is confocal. This he deduced from the more general theorem in spherical conics that if two spherical conics have the same cyclic arcs, then any arc touching the inner curve will cut off from the outer a segment of constant area.\nBertrand\n's famous treatise on integral calculus\n(1864)\nattributed Graves's theorem to\nChasles\n, who arrived at it later by an independent investigation. In a long appendix to the volume Graves gave a method of treating curves on a sphere corresponding to the Cartesian method on the plane, arcs of great circles taking the place of right lines.\nIn the same year Graves made two contributions to the\nProceeding\ns of the\nRoyal Irish Academy\n, namely\nOn Certain General Properties of Cones of the Second Degree\nand\nOn the Application of Analysis to Spherical Geometry\n.\nFor a list of\n83\npublications by Graves see\nTHIS LINK\n.\nFor comments on Graves' four papers\nOn algebraic triplets\nsee\nTHIS LINK\n.\nThe fellowship that Graves held at Trinity College, Dublin, meant that he was given a very heavy teaching load and time for research was hard to come by. However, he had been elected to the\nRoyal Irish Academy\nin\n1837\nand, in\n1843\n, following\nJames MacCullagh\nmoving from the Chair of Mathematics to the Erasmus Smith Chair of Natural and Experimental Philosophy, Graves was appointed as professor of mathematics at Trinity. He had a long association with\nGeorge Boole\nand Graves was one who wrote a letter of support for\nBoole\nwhen he was a candidate for the professorship of mathematics at Queen's College, Cork, in\n1849\n.\nWe note that\nJames MacCullagh\nwas interested in Irish culture and in Egyptian papyri. He had corresponded with the orientalist Edward Hincks\n(1792\n-\n1866)\nand was able to get Hincks to catalogue Trinity College's collection of papyri. The catalogue was published in\n1843\n. It is likely that\nMacCullagh\n's interest in these topics was a major factor in Graves becoming interested in Irish culture and, in particular, in deciphering Ogham script. The Ogham script consists of\n20\nletters each of which are composed from four sets of strokes, each set being composed of\n1\nto\n5\nstrokes. The script, which appears on stone monuments in Ireland\n(\nand some in Wales\n)\n, is thought to date from the\n4\nth\ncentury AD. Graves gave his method of deciphering the script in\nOn a General Method of Deciphering Secret Alphabetic Writings, as Applicable to the Irish Ogham\n(1848)\nand further work on this topic appeared in\nOn the Ogham Character\n(1848)\n,\nOn the Ogham Character and Alphabet. Part II\n(1849)\n, and in many later papers some of which we list at\nTHIS LINK\n.\nLet us look at Graves' method of deciphering the Ogham script which he gives in the 'General Method of Deciphering' paper by quoting from this paper. His method uses:-\n... the construction of a table, which shows how often, on an average, each letter is followed by each of the remaining ones, in a passage of some determined length. ... with such a table at hand, it is not difficult to assign their proper powers to the secret characters or ciphers in which a document in that language is written. We have merely to tabulate the sequences of ciphers; and, by comparing their tendencies to repetition and combination with those of the known letters, we readily arrive at a knowledge of their respective powers. It is here assumed that the document to be deciphered is of reasonable length. This condition is indispensable ...\nWhile discussing his methods of deciphering the Ogham script we should quote from\nGeorge Boole\n's famous book\nThe laws of thought\n(1854)\nin which he writes:-\nEvents of a given species ... tend to occur with definite frequency, whether their true causes be known to us or unknown. Of course this tendency is, in general, only manifested when the area of observation is sufficiently large. ... In a given language, or family of languages, the same sounds, and successions of sounds, and, if it be a written language, the same characters and successions of characters recur with determinate frequency. The key to the rude Ogham inscriptions, found in various parts of Ireland, and in which no distinction of words could at first be traced, was, by a strict application of this principle, recovered. ... The discovery is due to the Rev Charles Graves, Professor of Mathematics in the University of Dublin. ... Professor Graves informs me that he has verified the principle by constructing sequence tables for all the European languages.\nGraves' interest in Irish culture led to him being appointed in\n1852\nto a Commission set up to translate, edit and publish the ancient laws of Ireland. This Commission became known as the Brehon Laws Commission and Graves made his rooms in Trinity College available to two men who worked on the project. Six volumes of\nAncient Laws of Ireland\nwere published between\n1865\nand\n1901\n.\nIn the\n1850\ns Graves leased Parknasilla, a house about\n5\nkm from the village of Sneem in County Kerry. Every summer Graves, his family and his servants, lived in Parknasilla which later became known as \"The Bishop's House\".\nIn\n1860\nGraves was appointed as Dean of the Chapel Royal. The Chapel Royal is in Dublin Castle and, in that role, Graves attended all the ceremonial occasions held in the Castle. Two years later, in\n1862\n, he resigned from his chair of mathematics at Trinity College, Dublin. In\n1864\nhe was made Dean of Clonfert and, two years later, in\n1866\n, he was appointed as Bishop of Limerick, Ardfert and Aghadoe. We note here that some of Graves papers written after he became bishop, have been listed as authored by Charles Graves and C Limerick. This is a simple error arising from the fact that, as Bishop of Limerick, Graves would sign himself Charles Limerick or C Limerick.\nWe mentioned above that Graves had been elected to the\nRoyal Irish Academy\nin\n1837\n. Now he continued to have close links with the Academy and published many works in the\nProceedings\nof the Academy. He served as its secretary in\n1856\nand was elected president in\n1861\n. He gave his inaugural address as President on\n8\nApril\n1861\n[\n6\n]\n:-\nIn entering upon the office of President of the\nRoyal Irish Academy\n, I feel that it is my first duty to return you my sincere and cordial thanks for the great honour which you have conferred upon me in calling me to this Chair. That honour, with the responsibility which accompanies it, would be a burden heavier than I have strength to bear, if I were not supported, as I trust I shall be, by the same friendly confidence which has for so long a time lightened my labours as Secretary of the Council and Secretary of the Academy. ... For nearly a quarter of a century I have been a member of this society, seldom inactive, and always deeply interested in what concerns its welfare. This acquaintance with the affairs of the Academy has been, I doubt not, my chief recommendation to you. Perhaps I was believed to possess another claim upon your favourable consideration. It was supposed that my own habits of thought rendered me capable of sympathising in the studies of members belonging to the different sections of the Academy. In this view, at least, my friends are not mistaken. Whilst I look up with respect to the attainments of brother Academicians who are my superiors in every separate department of science and literature, I have with them all a community of sentiment which enables me sometimes to cooperate, and always to sympathise; and thus I may be capable, in some degree, of representing that principle which was paramount in the minds of our founders.\nGraves continued to serve as President of the Academy until\n1866\nso he was still President when Sir\nWilliam Rowan Hamilton\ndied in September\n1865\n. On\n30\nNovember of that year he gave his Presidential Address as a tribute to\nHamilton\n. We give a version of that address at\nTHIS LINK\n.\nAlthough Graves had many duties as Bishop of Limerick, nevertheless he was able to continue his interest in both mathematics and in the Ogham inscriptions. Most of his publications were related to his interest in Ogham script for it was during his summer residence at Parknasilla that he was able to continue this interest particularly through meeting visiting historians and antiquarians. He also made many outings to archaeological sites in the vicinity.\nAfter he became Bishop of Limerick in\n1866\nhe did not publish any mathematics papers for the next twenty years. However, he clearly continued to do research in mathematics and write down his working in notebooks. In\n1888\nhe again began publishing mathematics papers, the first being\nOn the Focal Circles of Plane and Spherical Conics\n(1888)\n. Two further mathematics papers by Graves on this topic appeared, namely\nThe Focal Circles of Spherical Conics\n(1889)\nand\nOn the Plane Circular Sections of the Surfaces of the Second Order\n(1890)\n. We present the first few sentences of\nOn the Focal Circles of Plane and Spherical Conics\nand the final few paragraphs at\nTHIS LINK\n.\nIn addition to honours mentioned above, Graves was elected a fellow of the\nRoyal Society of London\nin\n1880\nand was awarded an honorary degree by Oxford University in\n1881\n. Following his death at the age of\n86\nat Portobello House, Dublin, his funeral was attended by many from his own congregations as well as many Roman Catholics. Graves was a close friend of the Catholic bishop who had encouraged his own flock to attend the funeral. Graves was buried in Limerick Cathedral. The Cathedral contains a monument to his memory.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}