{
  "nome_completo": "Charles Marc Élie Cailler",
  "nome_curto": "Charles Cailler",
  "ano_nascimento": "1865",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cailler/",
  "lugar_nascimento": "Geneva, Switzerland",
  "lugar_morte": "Geneva, Switzerland",
  "biografia": "Charles Cailler\nwas born in Geneva and his education, both school and university, was in that city. We note that the biography we give below is based largely on our translation of\n[\n1\n]\nsince we have been unable to find much additional information about Cailler.\nAs a young boy he showed a pronounced taste for languages. By the age of thirteen he had translated Caesar's\nCommentaries\nin full. While he was a pupil at the Gymnasium in Geneva, he attended the Sanskrit class of Paul Oltramare at the University of Geneva, and even began to study Arabic. One day his father asked him what differential and integral calculus is. The young schoolboy had not met such notions and could not give an answer, but he decided that he would find out by studying mathematics books and soon began to immerse himself in the study of mathematics: a simple question had led him to a subject that he loved throughout his whole life and had marked out his future.\nAfter graduating from secondary school, he entered the Faculty of Sciences of the University of Geneva where he worked under the direction of professors Charles Cellérier\n(1818\n-\n1889)\nand Gabriel Oltramare\n(1816\n-\n1906)\n. Cellérier was professor of mechanics at the University of Geneva and had written papers such as\nNote sur la détermination d'un minimum géométrique remarquable\nⓉ\n(\nNote on the determination of a remarkable geometric minimum\n)\n, and reports on various topics such as the determinations of gravity made in different countries by means of the pendulum\n(1881)\n. He was President of the Society of Physics and Natural History of Geneva for the year\n1883\n. Gabriel Oltramare had studied mathematics and natural sciences at the University of Geneva from\n1836\nto\n1839\nbefore going to Paris where he was a pupil of Cauchy. He was appointed as an ordinary professor of mathematics at the University of Geneva in\n1848\n. He wrote articles on number theory, analysis, astronomy and meteorology. Many of his papers were on a topic called the calculus of generalisation, his most famous book being\nEssai sur le Calcul de Généralisation\nⓉ\n(\nTest on the computation of generalization\n)\n(1899)\n. In fact Cailler's thesis was on this topic of calculus of generalisation.\nBy the age of twenty-two Cailler was a doctor of mathematical sciences having submitted the thesis\nRecherches sur les équations aux dérivées partielles et sur quelques points du calcul de généralisation\nⓉ\n(\nResearch on partial differential equations and on some points of the generalization calculation\n)\n. The\n98\n-page thesis is dated\n8\nNovember\n1887\n.\nAfter graduating from the University of Geneva with his doctorate, Cailler undertook postdoctoral studies at the University of Berlin where he spent two years. At this time Berlin was a remarkable place to study mathematics with mathematicians such as\nKarl Weierstrass\n,\nLeopold Kronecker\nand\nLazarus Fuchs\n, the latter having replaced\nEduard Kummer\nwho had retired a few years before Cailler arrived. While in Berlin he wrote a paper on\ncontinued fractions\n, in particular the continued fraction\n1\n+\n1\n3\n+\n1\n5\n+\n.\n.\n.\n1 + \\Large\\frac{1}{3+}\\normalsize \\Large\\frac{1}{5+}\\normalsize  ...\n1\n+\n3\n+\n1\n​\n5\n+\n1\n​\n.\n.\n.\n. In\n1889\nhe returned to Geneva and began teaching in the Faculty of Science on\n3\nOctober, the day after the death of Charles Cellérier, holder of the Chairs of Mechanics and Astronomy.\nHe was first given charge of the Rational Mechanics course, then appointed Extraordinary Professor on\n10\nJune\n1891\nand Ordinary Professor on\n23\nJuly\n1895\n. When in\n1900\nthe Chair of Higher Mathematics became vacant by the retirement of Gabriel Oltramare, Cailler was also in charge of the differential and integral calculus course, which he completed by regularly teaching on the theory of functions.\nA list of the titles of his early papers show the range of his research interests in pure mathematics, mathematical physics and astronomy. He published\nSur la transcendance du nombre e\nⓉ\n(\nOn the transcendence of the number e\n)\n(1891)\n,\nArticle sur le calcul de généralisation de M G Oltramare\nⓉ\n(\nArticle on the generalization calculation of M G Oltramare\n)\n(1891)\n,\nQuelques résultats relatifs à deux propriétés géométriques du mouvement planétaire\nⓉ\n(\nSome results relating to two geometric properties of planetary motion\n)\n(1893)\n,\nNote sur l'attraction des couches sphériques infiniment minces\nⓉ\n(\nNote on the attraction of infinitely thin spherical layers\n)\n(1894)\n,\nQuelques remarques sur le mouvement planétaire\nⓉ\n(\nSome remarks on the planetary movement\n)\n(1894)\n,\nDéveloppement en fraction continue d'une fonction analogue aux fonctions cylindriques\nⓉ\n(\nDevelopment in continuous fraction of a function analogous to cylindrical functions\n)\n(1894)\n, and\nLes principes de la mécanique de Hertz\nⓉ\n(\nThe principles of Hertz mechanics\n)\n(1895)\n. In particular we give some details of the\n1894\npaper on the attraction of infinitely thin spherical layers taken from a review:-\nIf the density of an infinitely thin spherical layer is inversely proportional to the cube of the distance from an external point A, it has, according to a theorem of Lord\nKelvin\n, also this property with respect to an inner point A', which is conjugate to A with respect to the sphere. The attraction of the layer to any inner point is the same as that of a mass in A, and its action on an external point the same as that of a mass on A'. Having once again proved this theorem, Cailler extended it to the case where the density of the layer is inversely proportional of an odd\n(\n≥\n3)\npower to the distance of A, or to a direct one.\nTo give an indication of his later work we give the titles of a few of his typical works:\nUne leçon sur la théorie élémentaire des fractions\nⓉ\n(\nA lesson on the elementary theory of fractions\n)\n(1904)\n,\nSur le changement de variable dans les dérivées d'ordre supérieur\nⓉ\n(\nOn the change of variable in the higher order derivatives\n)\n(1908)\n,\nNote sur la géométrie des feuillets\nⓉ\n(\nNote on the geometry of the sheets\n)\n(1910)\n,\nSur un cas particulier du problème de l'élimination entre plusieurs équations intégrales\nⓉ\n(\nOn a particular case of the problem of elimination between several integral equations\n)\n(1913)\n,\nLes équations du principe de relativité et la géométrie\nⓉ\n(\nThe equations of the principle of relativity and geometry\n)\n(1913)\n,\nSur les trajectoires orthogonales d'un système de cercles et sur un problème connexe de géométrie réglée\nⓉ\n(\nOn the orthogonal trajectories of a system of circles and on a related problem of regulated geometry\n)\n(1915)\n,\nSur la courbure géodésique des courbes tracées sur une sphère\nⓉ\n(\nOn the geodesic curvature of curves drawn on a sphere\n)\n(1916)\n,\nSur une nouvelle interprétation de la stéréométrie riemanienne\nⓉ\n(\nOn a new interpretation of Riemanian stereometry\n)\n(1919)\n, and\nQuelques remarques sur un théorème relatif à la série hypergéométrique et sur la série de Kummer\nⓉ\n(\nSome remarks on a theorem relating to the hypergeometric series and on the Kummer series\n)\n(1921)\n.\nHe was working on a book\nIntroduction à la Mécanique rationnelle d'après les théories modernes\nⓉ\n(\nIntroduction to Rational Mechanics from Modern Theories\n)\nat the time of his death.\nRolin Wavre\n, who succeeded Cailler to the chair of mathematics at Geneva, and\nHenri Fehr\n, who wrote the obituary\n[\n1\n]\n, took on the final stages of publication of the book which appeared as\nIntroduction géometrique à la mécanique rationelle, par Charles Cailler\nⓉ\n(\nGeometric introduction to rational mechanics, by Charles Cailler\n)\n, with\nWavre\nand\nFehr\nas joint editors, in\n1924\n.\nFor many years Cailler was a member of the Board of the Faculty of Sciences of the University of Geneva and acted as its secretary. His health did not allow him to accept the dean's demanding duties which, although it was offered to him, he had to turn down. In\n1899\nhe took part in the setting up of a faculty pension fund for the University and remained treasurer until his death.\nHenri Fehr writes in\n[\n1\n]\n:-\nAll those who have had the good fortune to follow Charles Cailler's lectures and seminars know how much he has contributed to the formation of their mathematical mind through his gift of exposition and the very personal character of his teaching. Cailler was, in the full force of the term, a master of talent and of devotion. Served by an eloquent speech and a sympathetic voice, he still captivated his pupils by the depth and clarity of his views. No one better than he knew how to highlight the essential points of each problem.\nDominating, to an increasingly rare degree nowadays, the different domains of mathematics, Cailler has published many memoirs of great interest pertaining to the most diverse branches, from Algebra, Geometry, Analysis, and Mechanics to the recent problems raised by the theory of relativity. We would like to mention in particular his fine work on the theory of solid sided bodies which forms the analytical part of the geometry of solid sided bodies developed by René de Saussure.\nAll his works are distinguished by qualities rarely found together: clarity and precision of method, elegance of form, and originality of thought. His publications were in his own eyes only humble stepping stones that he brought to the edifice of science. But he only published quality material, when the problem or the method followed seemed to have a real interest for mathematics.\nAfter he retired from his teaching at the University, Cailler had made a whole plan of work. He wanted, to the extent that his strength would allow, to continue to live for science. He planned to put the finishing touches to memoirs he had already sketched, but they still remained to be finalised. During the winter of\n1921\n-\n1922\nhe had devoted himself, above all, to the revision of a major work on rational mechanics, which was in a way the culmination of his research in this field. This is a new and quite general introduction to the modern theories of Kinematics, Statics and Dynamics. It is to be hoped that this work will not remain in manuscript and that the subscription, which will be launched in the autumn of\n1922\n, will be met with benevolent support from mathematicians and physicists.\n[\nWe note that this was published as 'Introduction géometrique à la mécanique rationelle, par Charles Cailler', with Rolin Wavre and Henri Fehr as joint editors in\n1924\n.\n]\nBut Charles Cailler was not only a mathematician of great value and a scientist knowing how to take an interest in the most diverse aspects of science. His prodigious power of assimilation went well beyond that: to arts subjects, first of all. He had mastered thoroughly the masterpieces of French literature. His facility for languages allowed him to read, opening any book, an author writing in Latin, German, English or Italian. There was no greater enjoyment for him than being alone with the great writers. It was his beautiful classical culture that gave him his way of expressing himself and the elegance of his style.\nWe know that mathematical genius has many affinities with musical feelings. This was the case for Cailler. The performance of a beautiful symphony carried him to such a point that he sometimes said that he had missed his vocation by not devoting himself to music.\nCailler also had great admiration for the fine arts. He knew the great schools of painting and could discern what makes the value of a Raphael, a\nLeonardo da Vinci\n, a Hans Friess or a Hodler. But he was particularly sensitive to the grandiose spectacles of nature and especially of the mountains. So it was a real pleasure for his friends to travel with him to the Geneva countryside or to accompany him on excursions in the Alps.\nAs early as the autumn of\n1921\nCharles Cailler had to retire for health reasons, but his death on\n30\nJanuary\n1922\n, caused a very legitimate emotion in the scientific community. With him Switzerland loses one of its most distinguished mathematicians, one of its scholars who by their teachings and their work, their moral value and their life, have given the greatest honour to their country.\nThe life of Charles Cailler presents an admirable unity: to characterize the scientist and the professor is to let one guess what the man was. Cailler was a fundamentally benevolent and kind character. His colleagues, his students and his alumni will never forget the cordiality and frankness of his welcome, the sincerity and the ardour with which he lavished advice and encouragement. All who have entered into the intimacy of his so rigorously upright soul, have found near him a strong and affectionate moral support.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}