{
  "nome_completo": "Charles Watkins Merrifield",
  "nome_curto": "Charles Merrifield",
  "ano_nascimento": "1827",
  "ano_morte": "1884",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Merrifield/",
  "lugar_nascimento": "Southwark, London, England",
  "lugar_morte": "Hove, Sussex, England",
  "biografia": "Charles Merrifield\n's mother was Mary Philadelphia Watkins who was a writer on art and literature. Like her son, she merits an entry in the\nDictionary of National Biography\n. Charles's father was John Merrifield who was originally from Tavistock, Devon, but at the time that Charles was born was practising as a barrister in London. Charles was well educated and in\n1847\nhe began working at the Department of Education. It would be appropriate at this point to explain the background to the setting up of the Department of Education by the government.\nEngland did not introduce state organisation of education as early as many countries. Education was considered an entirely private business at the start of the\n19\nth\ncentury. At that time however moves began to be made to provide a national education system and the Church of England and other churches were thought to be the most natural bodies to come together to undertake the organisation. The various churches could not agree to set up a single body, so various bodies were set up by the Church of England, the Roman Catholic Church, and others. Soon it was realised that these bodies were not up to the task, and in\n1833\nthe government helped out the various bodies giving them each a small grant. In\n1839\na committee of the Privy Council was set up to handle these state grants. The government gave a grant each year and the committee also took on the task of inspecting the schools. Now that the state was becoming more involved in school education the government set up an education department in Whitehall. It was in this department that Merrifield began working in\n1847\n, and the Department went on to become the Ministry of Education.\nHaving trained as a lawyer he entered the legal profession in January\n1851\nbut he never practised law. He became an Examiner at the Education Department and on\n12\nOctober\n1858\nhe married Elizabeth Ellen Nicholls from St Colomb in Cornwall. Sadly Elizabeth died when they had been married for ten years. On\n4\nJune\n1863\nwas elected to the\nRoyal Society\n. This was on the strength of some excellent mathematical papers on the calculation of\nelliptic functions\n, the first of which was\nThe geometry of the elliptic equation\nwhich he published in\n1858\n.\nHe was appointed secretary of the Institution of Naval Architects in\n1864\n, and continued to act in that capacity for the next eleven years. He moved to the Royal School of Naval Architecture at South Kensington in\n1867\n. At first he was vice-principal but quickly appointed principal of the School, remaining in that position until\n1873\n. His interest in naval matters was reflected in his research on sea waves which generated so much interest in Italy that he translated them into Italian himself and published them in\nRevista Marittima\n.\nAlthough none of Merrifield's papers were of major importance, nevertheless he wrote over\n100\npapers which he published in the leading journals. As an expert on tables and interpolation he served on the royal commission which was set up to evaluate\nBabbage\n's analytic engine. He was also active in promoting improvements in the teaching of geometry being a member of the Association for the Improvement of Geometrical Teaching. He was editor of a series of scientific textbooks and he contributed to the series the volume\nTechnical Arithmetic and Mensuration\n(1870)\n. He also took an active part in the\nBritish Association for the Advancement of Science\n, being president of one the sections at Brighton in\n1875\nand again in the following year at Glasgow.\nFinally we should mention that Merrifield played a major role in the\nLondon Mathematical Society\n, being vice-president during\n1876\n-\n8\nand then president during\n1878\n-\n80\n. After completing his term as president he became treasurer of the Society in November\n1880\nbut ill health forced him to resign this post. He suffered from a minor stroke in April\n1882\nand resigned as treasurer in December of that year despite making a reasonable recovery. He also resigned his position as examiner at the Department of Education, having held that post throughout his working life. A second more severe stroke in October\n1883\nled to his death.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}