{
  "nome_completo": "Jacques Charles François Sturm",
  "nome_curto": "Charles-François Sturm",
  "ano_nascimento": "1803",
  "ano_morte": "1855",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sturm/",
  "lugar_nascimento": "Geneva, Switzerland",
  "lugar_morte": "Paris, France",
  "biografia": "Charles-François Sturm\n's father was Jean-Henri Sturm whose family came from Strasbourg to settle in Geneva about\n50\nyears before Charles-François's birth. Jean-Henri Sturm was a teacher of arithmetic who had married Jeanne-Louise-Henriette Gremay. Charles-François's parents gave him a good education and at school he showed great promise, particularly in Greek and Latin poetry for which he had a remarkable talent.\nSturm came from a Protestant family and, in order to learn German, he attended the local Lutheran church where sermons were preached in that language. When Sturm was sixteen years old his father died and he changed tack in his academic studies, leaving the humanities and taking up the study of mathematics. He was taught mathematics at Geneva Academy by Simon\nLhuilier\nin\n1821\nand immediately\nLhuilier\nrecognised the mathematical genius in Sturm. However,\nLhuilier\nwas over seventy years of age and close to retiring at this time so it was his successor Jean-Jacques Schaub who inspired Sturm. Schaub did more than teach Sturm mathematics for he supported him financially at the Academy. Sturm's family had been left in considerable financial difficulties on the death of his father so the financial assistance allowed Sturm to continue with his education.\nAt the Academy Sturm's best friend was Daniel Colladon and the friendship would have a marked influence on Sturm's early research career. After leaving the Academy, Sturm was appointed as a tutor to the youngest son of Mme de Staël at the Châteaux de Coppet close to Geneva. He took up his appointment in May\n1823\nand found that it left him plenty of free time to devote to his own studies. He used his time well and began to write articles on geometry which were published in\nGergonne\n's\nAnnales de mathématiques pures et appliquées\n. Before the end of\n1823\nthe family moved from the château to spend six months in Paris and Sturm, as tutor, naturally accompanied them.\nIn Paris he was introduced into the scientific circles by the family. Sturm wrote to his friend Colladon\n(\nsee\n[\n1\n]\n)\n:-\nAs for M\nArago\n, I have two or three times been among the group of scientists he invites to his house every Thursday, and there I have seen the leading scientists,\nLaplace\n,\nPoisson\n,\nFourier\n, Gay-Lussac,\nAmpère\n, etc. ... I often attend the meetings of the Institute that take place every Monday.\nThis was clearly an extremely fortunate opportunity for Sturm. Although he returned to the château in May\n1824\nhe left after six further months to devote himself to scientific research. The\nParis Academy\nhad set a prize topic on the compressibility of water and Sturm, with his friend Colladon, decided to begin experiments on Lake Geneva with the aim of putting in an entry for the prize. The experiments were not a great success since they did not yield the expected results and Colladon received a serious injury to his hand while conducting the experiments.\nIn December\n1825\nSturm and Colladon went to Paris to take courses in mathematics and physics and also to collect further instruments to repeat their experiments. The Paris contacts that Sturm had made proved useful for he lived at\nArago\n's house for a while as tutor to his son. He was also given the use of\nAmpère\n's laboratory. The time was very fruitful for Sturm who attended lectures by\nAmpère\n, Gay-Lussac,\nCauchy\n, and\nLacroix\n.\nFourier\nsuggested projects for both Sturm and Colladon, recognising that Colladon was essentially a physicist while Sturm was a mathematician.\nDespite completing their paper for the Grand Prix of the\nAcadémie des Sciences\nthey did not win the prize; in fact none of the submissions was deemed good enough and the same topic was set again. By this time Sturm and Colladon were both working as assistants to\nFourier\n. Colladon made further experiments on Lake Geneva and after revising their joint memoir they successfully won the prize. The value of the prize was enough to allow Sturm and Colladon to continue their research in Paris. This point marked the end of their successful collaboration and the two embarked on different research projects. Sturm's theoretical work in mathematical physics involved the study of caustic curves, and poles and polars of conic sections.\nOne of Sturm's most famous papers\nMémoire sur la résolution des équations numériques\nⓉ\n(\nDissertation on solving numerical equations\n)\nwas published in\n1829\n. It considered the problem of determining the number of real roots of an equation on a given interval. The problem was a famous one with a long history having been considered by\nDescartes\n,\nRolle\n,\nLagrange\nand\nFourier\n. The first to give a complete solution was\nCauchy\nbut his method was cumbersome and impractical. Sturm achieved fame with his paper which, using ideas of\nFourier\n, gave a simple solution.\nHermite\nwrote:-\nSturm's theorem had the good fortune of immediately becoming a classic and of finding a place in teaching that it will hold forever. His demonstration, which utilises only the most elementary considerations, is a rare example of simplicity and elegance.\nStrangely although the theorem quickly became a classic it was soon relegated to history and, contrary to what\nHermite\nbelieved, vanished from textbooks. As the title indicated, two events in the history of the algebraic theorem of Sturm are examined in\n[\n5\n]\n. The author describes how\nTarski\nshowed in\n1940\nthat Sturm's method of proof could be used in mathematical logic to prove the completeness of elementary algebra and geometry. The\n1829\npaper was not the last of Sturm's work on this algebraic equations and in\n[\n12\n]\nSinaceur:-\n... seeks to determine the mutual influence between\nA-L Cauchy\n's and Ch-F Sturm's research from\n1829\nto around\n1840\non the roots of algebraic equations.\nParis was not an easy place for a foreigner and Protestant to obtain a post at this time and, despite his fame from the\n1829\npaper, he was not appointed. The revolution of July\n1830\nchanged the political climate and after this\nArago\nsucceeded in getting Sturm appointed as professor of mathematics in the Collège Rollin. He became a French citizen in\n1833\nand was elected to the\nAcadémie des Sciences\nin\n1836\n. These were the years during which he published some important results on\ndifferential equations\n.\nSturm became interested in obtaining results on specific differential equations which occurred in\nPoisson\n's theory of heat.\nLiouville\nwas also working on differential equations derived from the theory of heat. Papers of\n1836\n-\n1837\nby Sturm and\nLiouville\non differential equations involved expansions of functions in series and is today well-known as the Sturm-Liouville problem, an\neigenvalue\nproblem in second order differential equations.\nHe worked at the École Polytechnique in Paris from\n1838\nwhere he became a professor of analysis and mechanics in\n1840\n. In the same year he succeeded\nPoisson\nin the chair of mechanics in the Faculté des Sciences, Paris. For around ten years he gave excellent lectures but his wish to give his students the best possible courses meant that he gave a great deal of his time to preparing his lecture courses on differential and integral calculus and on rational mechanics. These courses became the widely used texts\nCours d'analyse de l'École Polytechnique\n2\nVol\n.\n(1857\n-\n63)\nand\nCours de mécanique de l'École Polytechnique\n2\nVol\nⓉ\n(\nMechanics courses from Ecole Polytechnique, Vol.\n2\n)\n(1861)\nboth published posthumously.\nHis time for research was now limited but he still made important contributions undertaking research on infinitesimal geometry,\nprojective geometry\nand the\ndifferential geometry\nof curves and surfaces. He also did important work on geometrical optics.\nFrom\n1851\nhis health began to fail and despite brave attempts to overcome the problem and return to teaching\n(\nwhich he managed to do for a while\n)\nhe died after a long illness.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}