{
  "nome_completo": "Charles Pisot",
  "nome_curto": "Charles Pisot",
  "ano_nascimento": "1910",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pisot/",
  "lugar_nascimento": "Obernai, Alsace-Moselle, Germany (now France)",
  "lugar_morte": "Paris, France",
  "biografia": "Charles Pisot\n's father was the college teacher and historian Othon Pisot who was born on\n14\nAugust\n1874\nat Werentzhouse and died\n4\nSeptember\n1953\nat Obernai. He became curator of the museum at Obernai. This town, where Charles was born, is\n25\nkm south west of Strasbourg and, with the rest of Alsace, had been annexed by Germany in\n1871\nfollowing the Franco-German war of\n1870\n-\n71\n. Alsace was returned to France after World War I in\n1918\nso for the first eight years of his life, Charles was living in Germany. He showed a talent for mathematics at an early age as he explained in the interview\n[\n4\n]\n:-\nI have always been attracted by mathematics. I don't have precise memories but, from what my parents told me, already at the age of two to three years I was particularly interested in numbers, and I amused myself, for example, making calendars ... I still have one that dates from before the war of\n1914\nand ran until\n1952\n. I knew by heart the correspondences between the days of the month and if it was a Monday, Sunday etc.. for two or three years, around the years\n1912\n,\n1913\n,\n1914\n, ... So I knew how to write numbers before I knew how to write letters. However my father, who was fascinated by the study of history, put me in the literary sections at school. I was not so delighted with that but I got a promise that if I passed with a top A, I would be allowed to study Elementary Mathematics.\nPisot also spoke of other interests he had as a child\n[\n4\n]\n:-\nI have always been attracted by mathematics and by physical things such as astronomy. This fascinated me and when I was a kid I devoured astronomy books more than novels. Novels interested me less than astronomy books but I was interested in physics and also biology.\nThe school that Pisot attended was in Obernai and he was fortunate that his first teacher of mathematics was an enthusiast for the subject. He explained in\n[\n4\n]\nhow he was taught the method of calculating the square root of numbers and was asked to apply this method to find the square root of\n2\n. He realised that\n5\n2\n=\n25\n5^{2} = 25\n5\n2\n=\n2\n5\nand twice\n25\nis only\n1\naway from\n49\n=\n7\n2\n49 = 7^{2}\n4\n9\n=\n7\n2\n. Hence\n7\n5\n\\large\\frac{7}{5}\\normalsize\n5\n7\n​\nis a good approximation to √\n2\n. He then saw that he could get better and better approximations from the equation\nx\n2\n−\n2\ny\n2\n=\n1\nx^{2} - 2y^{2} = 1\nx\n2\n−\n2\ny\n2\n=\n1\n. He went to the teacher and showed him what he had discovered and the teacher explained to him that he had discovered the method of continued fractions for himself. The teacher went on to explain more about\ncontinued fractions\nto Pisot who became fascinated - continued fractions would play a large role in his mathematical work from that time on.\nPisot sat the entrance examinations for the École Normale Supérieure on rue d'Ulm and entered this prestigious university in\n1929\n. He was awarded his\nagrégation\nin mathematics in\n1932\nand remained at the École Normale Supérieure undertaking research. When he explained to the director of the École Normale that he wanted to undertake research in number theory, the director told him not to be silly. The director tried to persuade Pisot to undertake research in complex variables but Pisot said he would rather become a school teacher than to be a researcher in complex variables. Of course the director was simply explaining to Pisot that number theory was not an area of interest to French mathematicians at that time\n[\n2\n]\n:-\nFrench mathematics is filled with the names of leaders in the Theory of Numbers:\nFermat\n,\nGalois\n,\nLagrange\n,\nLiouville\nand others. Few countries could equal these distinguished names. But curiously, at the time when Charles Pisot began his research career the French contributions to the Theory of Numbers were in an unfortunate eclipse.\nHowever, Pisot did work on number theory for his doctorate, but he had to find his own problems to tackle. His thesis\nLa répartition modulo un et les nombres algébriques\nⓉ\n(\nDistribution modulo one and algebraic numbers\n)\nwas examined on\n23\nMarch\n1938\n.\nÉlie Cartan\nwas head of the jury with\nPaul Montel\nand\nArnaud Denjoy\nas examiners. Pisot wrote in his thesis:-\nI would like to express my deepest thanks to\nArnaud Denjoy\nwho has continually encouraged me and helped me throughout this work. I also express sincere thanks to\nÉlie Cartan\nwho has kindly presented the principal results to the\nAcademy of Sciences\n(4\npapers,\n2\nin\n1936\nand\n2\nin\n1937)\n, and to\nPaul Montel\nwho kindly joined\nÉlie Cartan\nand\nArnaud Denjoy\nto make up the jury. In addition, I thank\nLeonida Tonelli\nwho has accepted this memoir for the Annals of the Scuola Normale Superiore of Pisa. At the same time I wish to show my gratitude to\nClaude Chevalley\nfor his help in editing which has been extremely useful to me.\nPisot had published a number of short papers before submitting his thesis:\nSur une propriété caractéristique de certains entiers algébraique\nⓉ\n(\nOn a characteristic property of some algebraic integers\n)\n(1936)\n,\nSur certaines propriétés caractéristiques des nombres algébraique\nⓉ\n(\nOn some characteristic properties of algebraic numbers\n)\n(1936)\n,\nSur la répartition modulo\n1\ndes puissances successive d'un même nombre\nⓉ\n(\nOn the distribution of successive powers modulo\n1\nof the same number\n)\n(1937)\n, and\nSur la répartition modulo\n1\nⓉ\n(\nOn the distribution modulo\n1\n)\n(1937)\n. These papers contain his famous 'Pisot numbers', sometimes called the Pisot-Vijayaraghavan numbers', but denoted by\nS\nS\nS\nby Pisot himself to honour\nRaphaël Salem\n.\nThe outbreak of World War II dramatically changed to course of Pisot's career. World War II began on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany but over the following months France was not involved in any fighting, but spent time trying to build defences to protect the country from an invasion by Germany. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders and, by June, France had surrendered and fighting had ended. After the fall of France, Pisot was offered a position in a French university but instead he chose to move to Germany. Although this may sound a little strange, one must remember that Pisot was born in Alsace at a time when it was part of Germany. There is no suggestion that he had strong political views but he seems to have preferred to join Germany at this time. Although he had been born in German Alsace, he was still a French citizen and this meant that he could not obtain a permanent university post in Germany without taking German nationality.\nPisot, now known in Germany as Karl Pisot, was given a temporary appointment at the University of Freiburg in\n1940\n. In the following year he was given a temporary position at the University of Greifswald\n[\n1\n]\n:-\nApparently there were difficulties with Alsations obtaining German citizenship, and without German citizenship Pisot could not possibly get a\n[\npermanent\n]\nuniversity job in Germany. Efforts seem to have been made on his behalf as early as\n1941\nor\n1942\n, to no avail. In April\n1943\nan official at the education ministry wrote that a rectification of Pisot's situation in Germany was called for on grounds of both justice and politics. The official died, and in October\n1944\nPisot was still not a German citizen.\nConstantin Carathéodory\nhad recommended Pisot for a permanent appointment in\n1942\nbut the citizenship issue prevented this taking place. By the summer of\n1944\nPisot was working with\nWilhelm Süss\nat his Research Institute at Freiburg. There he was undertaking military commissions as part of the German war effort. By November\n1944\nAllied troops were entering Germany and at the end of November the Allies bombed Freiburg. Pisot's family lost everything they possessed in this bombing raid. By this time\nWilhelm Süss\nwas working on establishing a National Mathematical Research Institute at Oberwolfach. In early\n1945\nSüss\nwas arguing strongly for Pisot's German citizenship to be settled so that he could be appointed to the University of Freiburg, the Research Institute at Oberwolfach, or to both. Pisot went with\nSüss\n, and other mathematicians from military establishments and colleagues from Freiburg, to Oberwolfach and lived there until the end of the war.\nAfter the war ended, Pisot returned to France and, in\n1946\n, was appointed as an assistant professor at the University of Bordeaux. One might wonder how someone from Alsace who had chosen to support Germany through the war might be accepted in France after hostilities ended\n[\n1\n]\n:-\nWhile his fellow mathematicians seem to have accepted Pisot, he apparently did suffer recriminations from other French\n(\ndescribed in a conversation with Pisot's widow\n)\n.\nIn Bordeaux he was asked to teach probability and statistics, topics he had not studied before. He learnt a lot from this experience. In\n1948\nhe was promoted to professor at Bordeaux. He attended the International Congress of Mathematicians in Amsterdam in September\n1954\nand gave the invited address\nSur un ensemble fermé d'entiers algébraique\nⓉ\n(\nOn a closed set of algebraic integers\n)\n.\nHe had one doctoral student in Bordeaux but he wanted a larger team of research students. This was a major factor in his decision to move to Paris in\n1955\nwhen he was offered a position at the Faculty of Science there. On the one hand he was happy in Bordeaux, but the realisation that he would be able to train many more number theorists in Paris was the major factor in his decision to move. He spoke of his need for students in the interview\n[\n4\n]\n:-\nWhat is the role of the teacher without students! ... and, they are what you want, when you find a pretty result you must have the audience to explain it to ... and if you do not have students, you cannot tell anyone! ... Mathematics is a passionate adventure and especially when we have students who continue to develop directions we started but we could not continue. It is these students who develop, find some things which are quite new ... I am very happy when that happens.\nIn addition to working at the Faculty of Science, Pisot also taught at the École Polytechnique. Perhaps one of the best indications of the areas that interested him most is seen from his popular\n1960\narticle\nLes Nombres entiers, leurs problèmes et leurs mystères, etc\nⓉ\n(\nWhole numbers, their problems and mysteries, etc.\n)\n. There he looks at diophantine equations, the\nGoldbach conjecture\n,\nRoth\n's theorem, transcendental numbers, the distribution of primes, and\np\np\np\n-adic analysis. In Paris, Pisot worked with his colleagues Hubert Delange and Georges Poitou organising the Delange-Pisot-Poitou seminar. This seminar had its origins in the number theory seminar set up by\nAlbert Châtelet\nin\n1947\n. In collaboration with Mark Zamansky, he published the textbook\nMathématiques générales\nⓉ\n(\nGeneral mathematics\n)\n(1958)\nwhich proved very popular with students for many years.\nIn the summer of\n1963\n, Pisot gave a series of lectures at the University of Montreal in Canada. These lectures were published as a book with the title\nQuelques aspects de la théorie des entiers algébriques\nⓉ\n(\nSome aspects of the theory of algebraic integers\n)\n.\nRaphaël Salem\n, who was a major influence on Pisot, died in the summer of\n1963\nand Pisot dedicated his book to\nSalem\n.\nD H Lehmer\nexplains in a review that Pisot's lectures:-\n... are built around his remarkable theorem to the effect that the set S of all those real algebraic integers q whose conjugates lie inside the unit circle is closed. The author considers wider classes of algebraic numbers that are likewise closed. This is done by applying p-adic analysis to the theory of rational functions and their\nTaylor\nexpansions. Many other classical and recent results are established as by-products. The ensemble is a very interesting set of theorems.\nSometimes a good conjecture is as important as a good theorem, particularly if it inspires developments as mathematicians attack it. Pisot made  the 'Pisot dth root conjecture' which led to considerable progress. This conjecture claimed that if the coefficients\nb\n(\nn\n)\nb(n)\nb\n(\nn\n)\nof the\nTaylor\nexpansion of a\nrational function\nall have perfect\nd\nd\nd\nth\nroots for\nn\n>\nN\nn > N\nn\n>\nN\n, then one can choose a\nd\nd\nd\nth\nroot\na\n(\nn\n)\na(n)\na\n(\nn\n)\nof\nb\n(\nn\n)\nb(n)\nb\n(\nn\n)\nfor each\nn\nn\nn\nsuch that\nS\na\n(\nn\n)\nx\nn\nSa(n)x^{n}\nS\na\n(\nn\n)\nx\nn\nis a rational function. Various special cases of the conjecture were proved true before Umberto Zannier gave a complete proof of the conjecture in the year\n2000\n(\nsee\n[\n7\n]\n)\n.\nOf course, French mathematics was for many years dominated by the\nBourbaki\ngroup of mathematicians and Pisot was invited to join them. However, he found that the theory of numbers did not fit into the overall scheme of mathematics as envisioned by\nBourbaki\n. He said in the interview\n[\n4\n]\n:-\nA number of mathematicians created\nBourbaki\nto try to introduce structures into mathematics and I was asked to participate. I was given the task of trying to find structures in the theory of numbers, but this does not work, there is no structure there and finally\nBourbaki\ngave up trying to do something in the theory of numbers. Now I begin to wonder why: I think that mathematics on the whole stems from two sources. The first source, which obviously everyone thinks of, is experiments, and physics and chemistry ... . These areas pose some problems that advance mathematics, but there is one source that seems equally important which is the theory of numbers. The problems posed by the integers require such work and such reflections that ultimately it is from there that almost half of mathematical theories arise.\nIn\n[\n5\n]\nPisot relates his own research experiences with the aim of being helpful to young researchers as he states in that article:-\nHaving taught for fifty years, I have seen some young, initially enthusiastic researchers become disappointed by their efforts, either because they were stumped by the difficulty of the question examined or because they realized they had re-established known results. I thought therefore that an account of my own development might perhaps keep some of them from getting discouraged.\nAs we have explained, students were always of major importance to Pisot. The article\n[\n2\n]\ngives this example of his influence through his students:-\nThe number of students of Charles Pisot, from all parts of France and also some from foreign countries, is of the order of twenty. But this underestimates the influence of Charles Pisot on the Theory of Numbers by only considering those who were directly his pupils. Patrice Philippon, who submitted his thesis in\n1984\n, was a pupil of Daniel Bertrand\n(\nsubmitted\n1977)\n, who was a pupil of Michel Waldschmidt\n(\nsubmitted\n1972)\n, who was a pupil of Jean Fresnel\n(\nsubmitted\n1967)\n, who was a pupil of Yvette Amice\n(\nsubmitted\n1965)\n, who was herself a pupil of Charles Pisot. That is one example, but there are many others ...\nIn fact the chain described in this quote continues with Marc Chardin\n(\nsubmitted\n1990)\nbeing a student of Patrice Philippon and Seyed Hamid Hassanzadeh\n(\nsubmitted\n2009)\nbeing a student of Marc Chardin.\nPisot retired from his positions in Paris in\n1979\n. He had received several honours for his outstanding contributions including the Dickson Prize from the\nAcadémie des Sciences\nin\n1947\nand the city of Paris prize, also awarded by the\nAcadémie des Sciences\n, in\n1966\n.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}