{
  "nome_completo": "Charles Tweedie",
  "nome_curto": "Charles Tweedie",
  "ano_nascimento": "1868",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tweedie/",
  "lugar_nascimento": "Swinton, Berwickshire, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Charles Tweedie\nwas born in Swinton, Berwickshire, on\n27\nJune\n1868\n. His father was George Tweedie\n(1837\n-\n1905)\nand his mother was Charlotte Lugton\n(1836\n-\n1909)\n. George and Charlotte had married at Duns\n(\nPinkie Smithy\n)\n, Berwickshire, on\n5\nMay\n1864\nand their first child to survive was Annie Jane was born in\n1866\n. It was a large family with Charles the third child having younger brothers and sisters Euphemia\n(\nborn\n1870)\n, Charlotte Elizabeth\n(\nborn\n1875)\n, William Alexander\n(\nborn\n1877)\nand Jessie Isabella\n(\nborn\n1879)\n. Charles also had an older sister Annie Jane\n(\nborn\n1866)\nand an older brother David\n(\nborn\n1865)\nwho, like Charles, also went on to become a member of the\nEdinburgh Mathematical Society\n.\nCharles was a pupil at George Watson's College, Edinburgh and while there he was awarded a Sibbald Bursary to study at the University of Edinburgh. He was taught by Chrystal and Tait and it was at this time that his mathematical abilities became clear when he went through the problems in the second volume of Chrystal's Algebra, which at that time was in the proof stage. He graduated with an M.A. in\n1890\nwith First-Class Honours in Mathematics and Natural Philosophy. He was awarded a B.Sc. by the University of Edinburgh in the same year and gained the Bruce of Grangehill Bursary awarded to the best mathematician in the final year. Tweedie decided to study mathematics abroad and went to the leading centre for mathematics in the world at that time, namely the University of Göttingen, in\n1891\n. He also studied at the University of Berlin in the following year before returning to Edinburgh where he was appointed as an Assistant at the University. He was quickly promoted to Lecturer in Pure Mathematics and in this role he supported\nChrystal\nfor many years.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\non\n6\nDecember\n1897\nhaving been proposed by\nGeorge Chrystal\n,\nPeter Guthrie Tait\n,\nCargill Gilston Knott\n,\nJohn Sturgeon Mackay\n. He was also a strong supporter of the\nEdinburgh Mathematical Society\nserving the Society as Treasurer from\n1895\nto\n1898\nand President in\n1903\n-\n04\n. He was made an Honorary member of the Society in\n1915\n.\nMore information about Tweedie is given in an obituary in the\nProceedings\nof the\nEdinburgh Mathematical Society\nat\nTHIS LINK\n.\nAn obituary of Tweedie, written by\nE M Horsburgh\n, appeared in the\nMathematical Gazette\n. See\nTHIS LINK\n.",
  "math_areas": [
    "Logic"
  ]
}