{
  "nome_completo": "D'Amondans Charles de Tinseau",
  "nome_curto": "Charles Tinseau",
  "ano_nascimento": "1748",
  "ano_morte": "1822",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tinseau/",
  "lugar_nascimento": "Besançon, France",
  "lugar_morte": "Montpellier, France",
  "biografia": "Charles Tinseau\nwas born into a noble French family in the Franche-Comté region which is in the east of France dominated by the Jura mountains. This region had at one time been ruled by Spain but was finally conquered for France in\n1674\n. However, there was still much pro-Spanish feeling in the region when Charles was growing up there. His parents were Marie-Nicolas de Tinseau and Jeanne Petramand of Velay and Charles was one of their seven children, in fact the youngest but one.\nHe entered the École Royale du Génie at Mézières in\n1769\nand graduated as a military engineer in\n1771\n. At Mézières he was a student of\nMonge\nwho encouraged him to undertake mathematical research. It seems highly unlikely that Tinseau would have become a mathematician but for the inspiring teaching and encouragement of\nMonge\n. For twenty years, from\n1771\nto\n1791\n, Tinseau was an officer in the engineering corps. It was during this period that he was active as a mathematician and we shall examine his contributions below. First, however, let us continue to look at his life through the extremely difficult times of the French Revolution and the Napoleonic era.\nCertainly given his noble birth, one would expect Tinseau to be a supporter of the French monarchy and this was indeed the case; he was a passionate supporter of the Bourbons despite the problems that they were encountering. In\n1788\nthe monarchy was in serious difficulties and there was a breakdown in law and order with officials unable to collect taxes. Tinseau joined in the efforts to support the doomed Bourbon monarchy but by this time the situation was out of control. On the fall of the Bastille in\n1789\n, Louis-Joseph, Duc de Bourbon and Prince of Condé was one of the first princes to emigrate and he established himself at Worms in\n1791\n. There he led a collection of émigrés including Tinseau. They raised the émigré \"army of Condé\" with the aim of opposing the Revolution by military means.  Their campaigns of\n1792\n-\n96\nproved ineffective.\nCharles-Philippe, Comte D'artois\n(\nlater Charles X\n)\nwas the fifth son of the dauphin Louis and Maria Josepha of Saxony. Ordered by his brother Louis XVI to leave France soon after the fall of the Bastille, he went first to the Austrian Netherlands and then to Turin in Piedmont. He was joined by his brother the Comte de Provence\n(\nlater Louis XVIII\n)\nin\n1791\n. Charles-Philippe travelled to Austria, Prussia, Russia, and England. Tinseau also lived in exile and conducted a vigorous campaign in support of the Bourbons and against the Revolution. He published a series of anti-Revolution writings from\n1792\nonwards and tried to organise uprisings in France, as did Charles-Philippe who made an unsuccessful attempt to land in the Vendée to lead a royalist rising there. Both men had a military career and Tinseau, with the rank of brigadier general, acted as aide de camp to Charles-Philippe. In fact Tinseau supported the Allied powers against France and used his military knowledge to pass on information of strategic importance to the Allies.\nNapoleon became First Consul in\n1799\nand then emperor of the French in\n1804\n. Tinseau was as opposed to Napoleon and all he stood for as he had been to the earlier years of the Revolution. He continued to publish anti-Napoleonic writings but Napoleon tried to offer him an amnesty. This was vigorously rejected by Tinseau who continued to be a devoted supporter of the Bourbons. Tinseau, like Charles-Philippe, lived in exile in England and was offered British nationality by the government. This too was far from what he wanted, striving desperately to be a Frenchman in a France under a restored Bourbon monarchy. After military defeat, Napoleon resigned in March\n1814\nand the Bourbons were restored to the French throne. Charles-Philippe returned to France after the fall of Napoleon but Tinseau did not return until\n1816\n. By this time he was\n68\nyears old and immediately retired.\nTinseau wrote on the theory of surfaces, working out the equation of a\ntangent\nplane at a point on a surface, and he generalised\nPythagoras\n's theorem proving that the square of a plane area is equal to the sum of the squares of the projections of the area onto mutually perpendicular planes. He continued\nMonge\n's study of curves of double curvature and ruled surfaces, being in a sense\nMonge\n's first follower. Taton writes in\n[\n1\n]\nthat Tinseau's works:-\n... deal with topics in the theory of surfaces and curves of double curvature: planes tangent to a surface, contact curves of circumscribed cones or cylinders, various surfaces attached to a space curve, the determination of the osculatory plane at a point of a space curve, problems of quadrature and cubature involving ruler surfaces, the study of properties of certain special ruled surfaces\n(\nparticularly conoids\n)\n, and various results in the analytic geometry of space.\nTwo papers were published in\n1772\non\ninfinitesimal\ngeometry\nSolution de quelques problèmes relatifs à la théorie des surfaces courbes et des lignes à double courbure\nⓉ\n(\nSolution of some problems relating to the theory of curved surfaces and double curved lines\n)\nand\nSur quelques proptiétés des solides renfermés par des surfaces composées des lignes droites\nⓉ\n(\nOn some properties of solids enclosed by straight lines\n)\n. He also wrote\nSolution de quelques questions d'astronomie\nⓉ\n(\nThe solution of some astronomical queations\n)\non astronomy but it was never published. He did publish further political writings, as we mentioned above, but other than continuing to correspond with\nMonge\non mathematical topics, he took no further part in mathematics.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}