{
  "nome_completo": "Cheng Dawei",
  "nome_curto": "Cheng Dawei",
  "ano_nascimento": "1533",
  "ano_morte": "1606",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cheng_Dawei/",
  "lugar_nascimento": null,
  "lugar_morte": "China",
  "biografia": "Cheng Dawei\nis also known as\nDa Wei Cheng\nor\nCh'eng Ta-wei.\nHe published the\nSuanfa tong zong\n(\nGeneral source of computational methods\n)\nin\n1592\nand almost all that is known about his life is contained in a passage written in the Preface of the book by one of his descendents when the book was being reprinted. We reproduce it here\n(\nsee\n[\n7\n]\nand also\n[\n1\n]\nand\n[\n2\n]\n)\n:-\nIn his youth my ancestor Cheng Da Wei was academically gifted, but although he was well versed in scholarly matters, he continued to carry out his profession as a sincere Local Agent, without becoming a scholar. He never lagged behind either on the classics or on ancient writings with old style characters, but was particularly gifted in arithmetic. In the prime of his life he visited the fairs of Wu and Chu. When he came across books that talked about \"square fields\" or \"grain with the husk removed\" ... he never looked at the price before purchasing them. He questioned respectable old men who were experienced in the practice of arithmetic and gradually and indefatigably formed his own collection of difficult problems.\nWhat can we deduce from this description? Firstly we know Cheng Da Wei lived in the latter half of the Ming dynasty which was a period of prosperity with increasing trade and commerce. It was also a period of relatively good stable government. A complex system of land tax led to a farmer's tax bill involving complicated reckoning of many different tax items. This resulted in both a need for mathematical skills by many people, and also led to efforts by local officials to simplify land-tax. Cheng Da Wei was probably directly involved in such efforts but, if not, he was certainly indirectly involved. The need for arithmetical skills led to the invention of the abacus and Cheng Da Wei's book\nGeneral source of computational methods\nwas an arithmetic book for the abacus. It is not an academic work on mathematics, rather it is a practical book aimed at assisting those who need to calculate.\nThat Cheng Da Wei was not a professional mathematician is typical of what one would expect from this period in China. His occupation in local government is also typical of the type of profession which contained highly skilled mathematicians. Although mathematics did not rate highly as an academic discipline, as we indicated above it was essential for many people to posses arithmetical skills. From the fairs which it is recorded that he attended, which were far apart in the Jiansu province and the Hubei province, all we can deduce is that he travelled widely. Also we can deduce that he was well off since he purchased books without asking the price and certainly these were not cheap items. Again we see that he was an avid collector of books on mathematics and this is borne out by the\nGeneral source of computational methods\nwhich is not particularly original, but is important for the compilation of problems from earlier works which it contains.\nCheng Da Wei wrote the\nGeneral source of computational methods\nin\n1592\n. By this time he was quite old and making use of the large collection of works which he had collected throughout his younger days. It is written in the style of the\nNine Chapters on the Mathematical Art\nand contains\n595\nproblems in\n12\nchapters. Martzloff writes:-\n... unlike the authors of the venerable classic, Cheng Dawei was not afraid of superfluity or verbosity. His book is an encyclopaedic hotch-potch of ideas which contains everything from A to Z relating to the Chinese mystique of numbers\n(\nmagic squares, ... generation of the eight trigrams, musical tubes\n)\n, how computation should be taught and studied, the meaning of technical arithmetical terms, computation on the abacus with its tables which must be learnt by heart, the history of Chinese mathematics, mathematical recreations and mathematical curiosities of all types.\nLet us give examples of the problems. First one which appears in Chapter\n10\n.\nBoy shepherd B with his one sheep behind him asked shepherd A \"Are there\n100\nsheep in your flock?\". Shepherd A replies \"Yet add the same flock, the same flock again, half, one quarter flock and your sheep. There are then\n100\nsheep altogether.\"\nWe have to find how many sheep is in shepherd A's flock.\nHere is a modern solution. Let\nx\nx\nx\nbe the number of sheep in shepherd A's flock. Then\nx\n+\nx\n+\n1\n2\nx\n+\n1\n4\nx\n+\n1\n=\n100\nx + x + \\large\\frac{1}{2}\\normalsize x + \\large\\frac{1}{4}\\normalsize x + 1 = 100\nx\n+\nx\n+\n2\n1\n​\nx\n+\n4\n1\n​\nx\n+\n1\n=\n1\n0\n0\nso\n11\n4\nx\n=\n99\n\\large\\frac{11}{4}\\normalsize x = 99\n4\n1\n1\n​\nx\n=\n9\n9\ngiving\nx\n=\n36\nx = 36\nx\n=\n3\n6\n.\nHow does Cheng Da Wei solve the problem? Basically he uses proportion supposing that the solution to the problem is that A has\n10\nsheep. Then the total number obtained from \"add the same flock, the same flock again, half, one quarter flock\" is\n10\n+\n10\n+\n5\n+\n5\n2\n=\n55\n2\n10 + 10 + 5 + \\large\\frac{5}{2}\\normalsize  = \\large\\frac{55}{2}\\normalsize\n1\n0\n+\n1\n0\n+\n5\n+\n2\n5\n​\n=\n2\n5\n5\n​\nsheep. This should have given the answer\n99\n, not\n55\n2\n\\large\\frac{55}{2}\\normalsize\n2\n5\n5\n​\n, so the correct number is not\n10\nbut\n(\n10\n÷\n55\n2\n)\n×\n99\n=\n36.\n(10 \\div  \\large\\frac{55}{2}\\normalsize ) \\times  99 = 36.\n(\n1\n0\n÷\n2\n5\n5\n​\n)\n×\n9\n9\n=\n3\n6\n.\nIn Chapter\n2\nof Cheng Da Wei's text there is the following problem.\nNow a pile of rice is against the wall with a base circumference\n60\nchi and an altitude of\n12\nchi. What is the volume? Another pile is at an inner corner, with a base circumference of\n30\nchi and an altitude of\n12\nchi. What is the volume? Another pile is at an outer corner, with base circumference of\n90\nchi and an altitude of\n12\nchi. What is the volume?\nCheng Da Wei goes on to explain what one expects the altitude of grain for a given base circumference to be. Of course in practice it will depend on how coarse the grain is, but Cheng Da Wei's values are quite close to what experimental evidence suggests. He writes:-\nIn problems of piles on the ground, against a wall, at an inner corner or an outer corner, the ancients always measured their altitude and then calculated. Instead of measuring the altitude we now take\n1\n10\n\\large\\frac{1}{10}\\normalsize\n1\n0\n1\n​\nthe base circumference as the altitude for a pile on the ground; take\n1\n5\n\\large\\frac{1}{5}\\normalsize\n5\n1\n​\nbase circumference as the altitude for a pile against a wall, for it is half a cone; take\n10\n25\n\\large\\frac{10}{25}\\normalsize\n2\n5\n1\n0\n​\nbase circumference as the altitude for a pile at an inner corner, for it is quarter of a cone; take\n10\n75\n\\large\\frac{10}{75}\\normalsize\n7\n5\n1\n0\n​\nbase circumference as the altitude for a pile at an outer corner, for it is three quarters of a cone.\nAs we see by looking at the problem, these are precisely the values that Cheng Da Wei uses in it. Here is another two of the problems of\nGeneral source of computational methods:-\nA small river cuts right across a circular field whose area is unknown. Given the diameter of the field and the breadth of the river find the area of the non-flooded part of the field.\nIn the right-angled triangle with sides of length a, b and c with a > b > c, we know that a + b =\n81\nken and a + c =\n72\nken. Find a, b, and c.\n[\nAnswer: a =\n45\nken, b =\n36\nken, c =\n27\nken\n]\nA descendant of Cheng Da Wei wrote in\n1716\nabout the reputation of\nGeneral source of computational methods:-\nA century and several decades have passed since the first edition of \"Suanfa tong zong\" during which period this work has remained in vogue. Practically all those involved in mathematics have a copy and consider it a classic ...\nEven in\n1964\ntwo authors of a book on the history of Chinese mathematics wrote:-\nNowadays, various editions of the \"Suanfa tong zong\" can still be found throughout China and some old people still recite the versified formulas and talk to each other about its difficult problems.",
  "math_areas": [
    "Number Theory"
  ]
}