{
  "nome_completo": "Chike Edozien Umezei Obi",
  "nome_curto": "Chike Obi",
  "ano_nascimento": "1921",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Obi/",
  "lugar_nascimento": "Zaria, Nigeria",
  "lugar_morte": "Onitsha, Anambra state, Nigeria",
  "biografia": "Genealogy sites contain somewhat confusing details of\nChike Obi\n's parents. Some give no names for his parents\n(\nfor example\n[\n8\n]\n)\nwhile on a couple he is described as the son of Nathaniel Okafor Edozien, an official in the Nigerian Coal Corporation, and Nwakuso Odogwu, the daughter of an Asaba chief\n(\nsee for example\n[\n6\n]\n)\n. Joseph Chike Edozien Obi, born on\n28\nJuly\n1925\nin Asaba, is recorded as having the same parents. Joseph Obi studied medicine and became a university professor. This information should not be inconsistent for Chike and Joseph should then be brothers. Looking at their biographies, however, makes it appear unlikely that they were brothers and the position is made more complicated by reports that when Chike died, several press reports mistakenly printed Joseph's picture instead of Chike's. We would hope that someone will inform us of what is correct.\nThere is one further discrepancy in the biographical information, namely his date of birth. Some biographies give\n17\nApril\n1921\nas his date of birth, but copies of his travel documents all give\n7\nApril\n1921\nas do several biographies. It appears certain that\n7\nApril is correct. We note that Chike Obi was brought up a Roman Catholic, remaining of that faith throughout his life, but he showed his open mindedness by naming one of his sons Mustafa, a Muslim name.\nChike attended St Patrick's Primary School, Zaria, and obtained his Standard Six Certificate in\n1933\nbefore moving to Christ the King College, Onitsha in\n1935\n. This school, founded in\n1933\n, was a boys school which educated pupils in the Roman Catholic tradition. The principal of the school was Rev Fr Leo Brolly. Obi attended this school until\n1939\nwhen he was awarded a West African School Certificate. In\n1940\nhe began his studies at Yaba Higher College, Lagos. This college, opened in January\n1934\nin Yaba, a town which has now become a suburb of Lagos, was a men's college which was affiliated with the University of London, England. The college trained science teachers and offered diplomas but students wanting higher education had to study correspondence courses and obtain degrees from the University of London. Obi took the college courses in\n1940\n-\n42\nbut in\n1941\nhe also began taking the correspondence courses as a University of London external student. He spent until\n1946\ntaking these correspondence courses, and in\n1946\n, after sitting the examinations as an external student, was awarded a B.Sc. in Mathematics with Special Honours from the University of London.\nObi began studying as a University of London external student for an M.Sc. and he won a scholarship to fund attending the University of Cambridge to undertake research for a doctorate. He was awarded an M.Sc. by University College London in\n1947\nand began research at Pembroke College, University of Cambridge in that year. We note that he sailed from Lagos to Southampton, England, on the ship\nAlmanzora\narriving in Southampton on\n21\nSeptember\n1947\n. He gave his address in England as University College London.\nAt Cambridge, his Ph.D. advisors were\nMary Lucy Cartwright\nand\nJohn Edensor Littlewood\nwho were working closely together on problems relating to differential equations. In July\n1948\nCartwright\nwas elected Mistress of Girton and she spent part of the year\n1948\n-\n49\nat American universities, including Princeton and Stanford, before taking up office. Obi submitted his first paper\nSubharmonic solutions of non-linear differential equations of the second order\nto the\nJournal\nof the\nLondon Mathematical Society\nin\n1949\nand it was published in\n1950\n. At the end he writes:-\nIn conclusion I should like to express my profound indebtedness to Prof\nLittlewood\nfor much help in the preparation of this paper.\nHe was awarded his doctorate in\n1950\nfor his thesis\nPeriodic Solutions of Non-linear Differential Equations of Second Order\n. The main results of his thesis were published in\nPeriodic Solutions of Non-linear Differential Equations of Second Order\nparts IV and V appearing as two consecutive papers in Volume\n47\nof the\nProceedings of the Cambridge Philosophical Society\nin\n1951\n.\nBefore returning to Nigeria, Obi spent time at the Massachusetts Institute of Technology in the United States, under the Foreign Students Summer Project. He sailed from Southampton to New York on the ship\nWashington\n, leaving Southampton on\n10\nJune\n1950\n. After the Summer Project, he returned to Nigeria where he was appointed as a lecturer in the Department of Mathematics of University College, Ibadan. The University of Ibadan was established in\n1948\nas a College of the University of London, England; it is the first university to be established in Nigeria. It became an independent university in\n1962\ntwo years after the country gained its independence from Britain. At Ibadan, Obi pursued two careers, one as a mathematician and the other a political activist arguing for Nigerian independence.\nOn\n7\nApril\n1951\nhe founded the Dynamic Party. In his book\nOur struggle: A political analysis of the problems of peoples struggling for true freedom\n(1953)\nhe states that:-\n... the only sane ideology for Negro nationalists in general and Nigerian nationalists in particular is the ideology of Kemalism, i.e. total conscription ... or totalitarian mobilization of all the nation's cultural, spiritual, economic and political resources in order to ensure the military security and rapid progress of newly liberated African states.\nThe policy of Kemalism which Obi followed is the policy implemented by Mustafa Kemal Ataturk to move Turkey to a modern Westernised society. Obi served as the first secretary-general of the Dynamic Party. He writes in\nOur Struggle\n:-\nNo one can afford to change one's ideology easily or often. Great care must therefore be taken in working out one's ideology. The present writer has put in much thought into this matter. He is a colonial nationalist and has as much stake in his native-land Nigeria as anybody else. He and his comrades of the political party\n(\nthe Dynamic Party\n)\nto which they belong have accepted the ideology of Dynamic Collectivism or Kemalism, and in this analysis in which only the pre-tactical problems of a colonial nationalist are considered, he will show that the only ideology for a colonial nationalist, especially if he is Nigerian, is the ideology of Kemalism.\nFor more information on Chike Obi and the Dynamic Party, see\nTHIS LINK\n.\nObi married the nurse Belinda Nwanyife\n(1933\n-\n2010)\nin\n1953\n. Their two eldest sons are Balogun Chike-Obi, who studied physics who became a professor of the University of Ilorin, and Mustafa Chike-Obi who obtained a degree in mathematics, then had a career in finance. Balogun Chike-Obi has published books such as\nCollisionless Magnetic Reconnection\n(1982)\n. Chike and Belinda Obi had one further son and a daughter.\nIn\n1953\n, in addition to the book\nOur Struggle\n, Obi published two mathematical papers, both in Volume\n28\nof the\nJournal\nof the\nLondon Mathematical Society\n, namely\nPeriodic solutions of non-linear differential equations of order\n2\nn\nand\nA non-linear differential equation of the second order with periodic solutions whose associated limit cycles are algebraic curves\n. In the summer of\n1952\n,\n1953\nand\n1954\nhe spent time at Pembroke College Cambridge. He sailed from Lagos to Liverpool, England, on\n4\nAugust\n1952\non the ship the\nAccra\n. In the following year, he sailed from Lagos to Liverpool on\n31\nAugust\n1953\non the\nAureol\n. In\n1954\nhe sailed from Lagos to Liverpool on\n23\nSeptember\n1954\n, again on the\nAureol\n.\nThe National Council of Nigeria and Cameroon was founded in\n1944\nwith the aim to achieve for Nigeria:-\n... political freedom, economic security, social equality and religious toleration.\nObi's Dynamic Party merged with the National Council of Nigeria and Cameroon in\n1956\nwhen an attempt was made to ban political parties in Nigeria. In July\n1947\na Pan-Nigerian delegation arrived in London, supported by Obi, with three demands, the third being:-\nTo demand that immediate steps towards self-government for Nigeria and the British Cameroons be taken now.\nObi was in England in the summer of\n1947\nand returned from Liverpool to Lagos on the Apapa, leaving on\n11\nJuly. He was in England again in\n1958\narriving in Liverpool on\n22\nSeptember on the\nAureol\n. He was part of the Nigerian East Region Delegation and he was living with the East Nigeria Commissioner in London. On\n27\nOctober\n1958\nBritain set the date of\n1\nOctober\n1960\nfor Nigerian independence. In\nFederal Elections\n1959\n: Manifesto\nof\n1959\nObi argued for the formation of the Economic Community of West African States stating that:-\n... the best strategy for any country for reducing the number of her enemies, actual and potential, to a minimum is for her to organise as many countries around her as possible into a closely knit political union of which she must be a member. ... Nigeria's foreign policy should aim at the ultimate creation\n(\nthe earlier the better\n)\nof a political Union of West African Republics.\nIn\n1959\nObi was promoted to Senior Lecturer in Mathematics at the University of Ibadan. In March\n1960\nhe was elected to the Federal Parliament of Nigeria as a member for Onitsha Urban. Biya Afonja writes\n[\n1\n]\n:-\nWhile at Ibadan, the renowned mathematician, Chike\nObi, was a lecturer that one cannot easily forget. On many occasions, he would come straight from Lagos where he was a parliamentarian to give us lectures in Real Analysis and Differential Equations.\nObi was elected as member for Onitsha Urban East to the Eastern House Assembly in November\n1961\nbut refused to give up his seat in the Federal Parliament. The Speaker of the Parliament ordered that Obi be physically removed by security guards, which is exactly what happened. Obi then decided that he would devote himself to regional rather than national affairs.\nIn\n1961\nhe published the political pamphlet\nThe People: Facts You Should Know\n. He stated:-\nDown with the enemies of the people, the exploiters of the weak and oppressors of the poor. The days of those who have enriched themselves at the expense of the poor are numbered. The common man in Nigeria can today no longer be fooled by sweet talk at election time, only to be exploited and treated as dirt after the booty of office has been shared among the politicians.\nIn\n1962\nObi was arrested and, as Edwin Madunagu relates in\n[\n7\n]\n:-\nMost of the time Chike Obi was either with the police, or in prison, or in court. The offence was either sedition, incitement or defamation. But one particular arrest that has not been mentioned - to the best of my knowledge - took place in\n1962\n. Chike Obi was one of the people arrested and detained with Chief Obafemi Awolowo on the charge of treasonable felony. He was later released for \"want of evidence\". I regret that I could not ask Chike Obi whether, indeed, an attempt was made to overthrow the Federal Government of Nigeria in\n1962\nand if he was, despite his release, part of the plot.\nAlso in\n1962\nObi published\nOur Struggle Part II\n. He continued as a member for Onitsha Urban East to the Eastern House Assembly until June\n1966\n. The country had seen increasing unrest since independence which was intensified by elections in\n1964\nwith widespread reports of electoral fraud. A military coup in\n1966\nwas put down but resulted in the army taking over. Regional governments were abolished which was why Obi ceased to be a member of the Eastern House Assembly. The Biafran War broke out in July\n1967\n, the coup being a significant factor in the outbreak of war which was fought between government forces and the state of Biafra which was seeking independence motivated by ethnic and religious differences. Onitsha was in Biafra and with Obi a Christian, the Biafran side was the obvious one for him to support. During the war years he worked for Odemegwu Ojukwu, the Biafran leader. The war ended in January\n1970\nwith defeat for the Biafrans.\nWith the end of the Biafran war, Obi returned to mathematics. He was appointed as an Associate Professor of Mathematics at the University of Lagos. Obi's two eldest sons had been educated during the years that Obi was first a lecturer in Ibadan, then a politician in Onitsha, and finally a professor in Lagos. Mustafa Chike-Obi said in the interview\n[\n10\n]\n:-\nMy father was a lecturer at the University of Ibadan, which you may consider lower middle-class. Let me tell you about my educational upbringing. First, I went to a school in Ibadan. It was a public school and my brother, Balogun and I used to walk two miles to the school. Then, we went to Mayflower School, Ikenne-remo, Ogun State. It was a very tough school and very underprivileged. After that, because he had become a politician, we moved to Onitsha and I went to St Joseph's Primary School, Onitsha. Again, not a school for the privileged. We didn't own a house and we were living in a rented house in Onitsha. Thereafter, I went to Christ the King College in Onitsha. Then, the war started and because of the war, we didn't go to school for three years. In\n1970\n, when I came back from the war, I went to King's College, Lagos. You may consider King's College a privileged school, but that's the only privileged school I attended. From there, I went to University of Lagos. So, it was at best, a middle-class background.\nBack into mathematics at the University of Lagos, Obi began mathematical research again having not published a paper since\n1955\n. He picked up his research very much where he had left off and the first paper published after a gap of nearly twenty years was\nAnalytical theory of non-linear oscillations. I. An existence theorem for periodic oscillations of equations of the second order\nwhich appeared in the\nProceedings of the Cambridge Philosophical Society\nin\n1974\n. This was, in fact, the first of a series of ten papers he published on\nAnalytical theory of non-linear oscillations.\nHe was promoted to Professor of Mathematics at the University of Lagos in\n1971\nand in the same year became Chairman of the Mathematics Department and Dean of the School of Mathematical and Physical Sciences.\nWe get some idea of the life he was leading at this time from Edwin Madunagu who was studying for an M.Sc. with Obi at the University of Lagos in the early\n1970\ns\n[\n10\n]\n:-\nI carefully studied Chike Obi's movement outside his home. He usually arrived at the office early in the morning. Between that time and when other offices opened, he solved his Differential Equations. I also established that whenever he returned to the office in the evening he usually moved from there to town to \"wind down\". And I knew his usual joints. So, whenever I was going out in the evening, I had to go to the department and check if his K\n70\nVolkswagen car was parked at the usual place. If it was there, I would either cancel the outing or move farther afield. But Chike Obi was not mean; in fact, he was the opposite. He was intellectually hard and disciplined. But no other teacher of mine was as tolerant of me as Chike Obi. For I was not a particularly \"obedient\" student.\nMadunagu is also quoted in\n[\n3\n]\n:-\nMany of us\n(\nhis students, including the leader of the Deeper Life Bible Church, William Kumuyi\n)\nremember what joy and pain it was to be in his class. He was a disciplinarian. As a scientist, he believed in rigour. There were no assumptions. Everything must be explicitly stated.\nAlthough Obi returned to full time mathematics in\n1970\n, he did not give up his attempts to improve the lot of Nigerians. For example, in the\n1980\ns he wrote a newspaper column entitled \"I Speak For the People\". In fact this title was also the title of the maiden speech he made to the House of Representatives in\n1960\n. In\n1985\nhe retired from his chair at the University of Lagos and returned to Onitsha where he set up the Nanna Institute for Scientific Studies.\nIn\n1985\nObi was awarded the Sigvard Eklund Prize. The announcement states:-\nThe International Centre for Theoretical Physics Prize in honour of Sigvard Eklund\n(\nSweden\n)\n, Director General Emeritus of the IAEA\n(\nInternational Atomic Energy Agency, Vienna, Austria\n)\n, in the field of Mathematics, was awarded to Chike Obi, University of Lagos, Nigeria, for significant contributions in the study of nonlinear ordinary differential equations with several parameters for which he established numerous results on the existence, number some analytic expressions of harmonic, subharmonic or uniformly almost periodic solutions.\nObi travelled to the International Centre for Theoretical Physics in Trieste in November\n1986\nto receive the prize. He was awarded the prize on\n12\nNovember\n1986\nand he addressed delegates in the Main Lecture Theatre of the Centre.\nEarlier Obi had been honoured with election to the Nigerian Academy of Science in\n1977\n, being one of those elected at the establishment of the Academy on\n18\nJanuary\n1977\n.\nMost biographies of Obi relate how he solved\nFermat\n's Last Theorem in\n1997\nproviding an elementary proof. He published his \"proof\" in\n1998\nin a ten page paper which, sadly, contains an error. Obi is one of several leading mathematicians who, when fairly old, have believed, incorrectly, that they have solved a major mathematical problem.\nAfter his death he was\n[\n11\n]\n:-\n... laid to rest in his Obiezoba family home of Ogboli Olosi Quarters in Onitsha amidst eulogies from prominent Nigerians.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}