{
  "nome_completo": "Christopher Clavius",
  "nome_curto": "Christopher Clavius",
  "ano_nascimento": "1538",
  "ano_morte": "1612",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clavius/",
  "lugar_nascimento": "Bamberg (now in Germany)",
  "lugar_morte": "Rome (now in Italy)",
  "biografia": "Christopher Clavius\nwas born in a German region and must have had a German name before adopting the Latin 'Clavius'. Several guesses such as 'Clau' or 'Klau', or even 'Schlüssel' which means 'key' so might have led to him taking the Latin 'Clavius' which also means 'key', have been made but none have ever been substantiated with any evidence. Despite being born at a time when the Protestant revolution was spreading in Germany, the region of Franconia where he was born was virtually unaffected and remained solidly Roman Catholic. He entered the Jesuit Order\n(\nthe Society of Jesus\n)\nin\n1555\n, being admitted in Rome, and received his education within the Order. He was sent to the University of Coimbra in Portugal in\n1556\nto study at the Jesuit College that had been founded there.\nMathematics had always been a topic which interested Clavius, and he excelled in the mathematical courses which he took as part of a general degree. An event which had a large influence on him was an eclipse of the sun which occurred on\n21\nAugust\n1560\n. Here is his own description of it taken from his work\nIn sphaeram Ioannis de Sacro Bosco Commentarius\nⓉ\n(\nCommentary on 'The sphere' by Sacrobosco\n)\npublished in\n1593\n:-\nI shall cite two remarkable eclipses of the Sun, which happened in my own time and thus not long ago. One of these I observed about midday at Coimbra in Lusitania\n[\nPortugal\n]\nin the year\n1559\n[\nsic\n]\n, in which the Moon was placed between my sight and the Sun with the result that it covered the whole Sun for a considerable length of time. There was darkness in some manner greater than night; neither could one see where one stepped. Stars appeared in the sky and\n(\nmarvellous to behold\n)\nthe birds fell down from the sky to the ground in terror of such horrid darkness.\nLet us note that although Clavius gives the year as\n1559\n, he has made an error since we know that the only possible eclipse that fits his description occurred on\n21\nAugust\n1560\n. This event was important for Clavius since it convinced him to devote his life to mathematical and astronomical study. Following this eclipse observation, he went to Italy later in\n1560\nand studied theology at the Jesuit Collegio Romano in Rome. He was ordained in\n1564\nbut remained at the Collegio Romano were he began teaching mathematics in the year of his ordination. In fact, except for a period in Naples around\n1596\nand a visit to Spain in\n1597\n, Clavius was to remain Professor of Mathematics at the Collegio Romano for the rest of his life. Of course, the study of theology was a lengthy process at this time and, despite becoming a teacher in\n1564\n, he continued with his studies and did not become a full member of the Jesuit Order until\n1575\n.\nThe quotation from\nIn sphaeram Ioannis de Sacro Bosco Commentarius\nⓉ\n(\nCommentary on 'The sphere' by Sacrobosco\n)\nwhich we gave above begins by referring to\n'two remarkable eclipses of the Sun'\n. The second one, which he observed while at the Collegio Romano occurred on\n9\nApril\n1567\n. Here is Clavius's description of that event:-\nThe other I saw at Rome in the year\n1567\nalso about midday in which although the Moon was placed between my sight and the Sun it did not obscure the whole Sun as previously but\n(\na thing which perhaps never before occurred at any other time\n)\na certain narrow circle was left on the Sun, surrounding the whole of the Moon on all sides.\nHe is quite accurate with his reported time of 'about midday' since the maximum occurred at\n10\nminutes after midday. The report suggests an annular eclipse with the moon subtending a slightly smaller angle than the sun. However the authors of\n[\n18\n]\nwrite:-\nTaking Clavius's account of the eclipse of\n1567\nat face value, it might perhaps seem that he witnessed the ring phase of an annular eclipse. However, computation shows that the eclipse was not annular. As seen from Rome, the topocentric lunar semi-diameter\n(955\n\".\n92)\nwas slightly greater than the solar semi- diameter\n(953\n\".\n56)\nby a factor of\n1\n.\n0025\n.... Hence if the lunar limb was assumed to be accurately circular, the eclipse of\n1567\nwould be only marginally total, the Moon covering the Sun completely for just\n14\nsec near the central line. However, when the true profile of the lunar limb is taken into account, several beads of photospheric light would be visible even where the eclipse was central. In consequence, the eclipse was neither fully total nor annular.\nAnother suggestion is that the 'certain narrow circle' seen by Clavius might be the inner corona.\nIt is perhaps for his work on the reform of the calendar that Clavius is most widely known. The Julian leap-year rule, introduced by Julius Caesar in\n46\nBC, created\n3\nleap years too many in every period of\n385\nyears. As a result, the actual occurrence of the\nequinoxes\nand\nsolstices\nslowly moved away from their calendar dates. The date of the spring equinox determines the date of Easter so the church began to press for reform. The Council of\n1511\n, then again the Trent Council of\n1563\n, urged the Pope to act. Pope Gregory XIII consulted his mathematical experts, of whom Clavius was the most senior. Clavius proposed that Wednesday,\n4\nOctober\n1582\n(\nJulian\n)\nshould be followed by Thursday,\n15\nOctober,\n1582\n(\nGregorian\n)\n. He proposed that leap years occur in years exactly divisible by four, except that years ending in\n00\nmust be divisible by\n400\nto be leap years. This rule is still used today and is so accurate that no further reform of the calendar will be necessary for many centuries. In fact it requires\n3500\nyears before an error of one day is reached.\nViète\ndid not like Clavius's calendar and the people of Frankfurt rioted against the Pope and mathematicians who, they believed, had conspired together to rob them of\n11\ndays. Clavius wrote\nNovi calendarii romani apologia\nⓉ\n(\nAn defence of the new Roman calendar\n)\n(1595)\nwhich justified the new calendar reforms defending them against these attacks.\nAlthough Clavius produced little original mathematics of his own, he did more than any other German scholar of the\n16\nth\nCentury to promote a knowledge of mathematics. He was the first, however, to use the decimal point. He was a gifted teacher and writer of textbooks, producing a version of\nEuclid\n's\nElements\nin\n1574\nwhich contains ideas of his own. Another well written book was\nAlgebra\n(1608)\n. His arithmetic books were used by many mathematicians including\nLeibniz\nand\nDescartes\n. Clavius also produced a number of instruments, perhaps the most interesting being an instrument to measure fractions of angles. It is worth mentioning that he gave an excellent account of dividing a measuring scale into subdivisions which is by far the most sophisticated to be produced until the work of\nVernier\n. He also designed sundials and developed a quadrant for use in surveying.\nPerhaps the best summary of his work would be to look briefly at the five volumes\nChristophori Clavii e Scoietate Jesu opera mathematica, quinque tomis distributa\nⓉ\n(\nFive volumes of the mathematical works of Christopher Clavius of the Society of Jesus\n)\nwhich was produced near the end of his life and contains his collected works. The first volume contains his\nEuclid\nreferred to above and the \"Spheric\" of\nTheodosius\n(\nSphaericorum Libri III\n)\n. The second volume contains his works on geometry and algebra, while the third volume contains his commentary on the \"Sphaera\" of\nJohannes de Sacrobosco\n(\nalso known as John of Holywood\n)\nfrom which we have quoted regarding the two solar eclipses, and his treatise on the astrolabe. The fourth volume contains a fascinating account of the construction of sundials, while the final volume contains his written works on calendar reform.\nFinally let us look at Clavius's reaction to the astronomical discoveries made by\nGalileo\n. The two scientists met when\nGalileo\nvisited Rome in\n1587\nand from that time on they corresponded occasionally concerning mathematical questions. When Clavius published a book he would always send a copy to his friend\nGalileo\n. When\nGalileo\npublished\nSidereus Nuncius\nin\n1610\n, Clavius was an old man and it must have been extremely difficult to grasp these new discoveries both from a scientific and religious point of view. As the senior scientist in the Collegio Romano he was required to pass judgement on\nGalileo\n's work yet for some time he did not have a telescope of sufficient quality to make his own observations. However in the final edition of\nIn sphaeram Ioannis de Sacro Bosco Commentarius\nⓉ\n(\nCommentary on 'The sphere' by Sacrobosco\n)\nhe addressed the issues:-\nI do not want to hide from the reader that not long ago a certain instrument was brought from Belgium. It has the form of a long tube in the bases of which are set two glasses, or rather lenses, by which objects far away from us appear very much closer ... than the things themselves are. This instrument shows many more stars in the firmament than can be seen in any way without it, especially in the Pleiades, around the nebulas of Cancer and Orion, in the Milky Way, and other places ... and when the Moon is a crescent or half full, it appears so remarkably fractured and rough that I cannot marvel enough that there is such unevenness in the lunar body. Consult the reliable little book by\nGalileo Galilei\n, printed at Venice in\n1610\nand called Sidereus Nuncius, which describes various observations of the stars first made by him.\nFar from the least important of the things seen with this instrument is that Venus receives its light from the Sun as does the Moon, so that sometimes it appears to be more like a crescent, sometimes less, according to its distance from the Sun. At Rome I have observed this, in the presence of others, more than once. Saturn has joined to it two smaller stars, one on the east, the other on the west. Finally Jupiter has four roving stars, which vary their places in a remarkable way both among themselves and with respect to Jupiter - as\nGalileo Galilei\ncarefully and accurately describes.\nSince things are thus, astronomers ought to consider how the celestial orbs may be arranged in order to save these phenomena.\nIf the reader is puzzled about the description of Saturn with two smaller stars to the east and west, then we should note that it was only in\n1656\nthat telescopes improved sufficiently for\nHuygens\nto discover the true shape of the rings of Saturn. Of course the observations of Venus were the most disturbing since\nPtolemy\n's version of the sun and planets would not account for the observed phases. Hence Clavius's plea to astronomers to come up with a theory to\n'save these phenomena'\n.\nThe picture above is from a engraving made from a portrait from life.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}