{
  "nome_completo": "Christiaan Huygens",
  "nome_curto": "Christiaan Huygens",
  "ano_nascimento": "1629",
  "ano_morte": "1695",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Huygens/",
  "lugar_nascimento": "The Hague, Netherlands",
  "lugar_morte": "The Hague, Netherlands",
  "biografia": "Christiaan Huygens\ncame from an important Dutch family. His father Constantin Huygens had studied natural philosophy and was a diplomat. It was through him that Christiaan was to gain access to the top scientific circles of the times. In particular Constantin had many contacts in England and corresponded regularly with\nMersenne\nand was a friend of\nDescartes\n.\nTutored at home by private teachers until he was\n16\nyears old, Christiaan learned geometry, how to make mechanical models and social skills such as playing the lute. His mathematical education was clearly influenced by\nDescartes\nwho was an occasional visitor at the Huygens' home and took a great interest in the mathematical progress of the young Christiaan.\nChristiaan Huygens studied law and mathematics at the University of Leiden from\n1645\nuntil\n1647\n.\nVan Schooten\ntutored him in mathematics while he was in Leiden. From\n1647\nuntil\n1649\nhe continued to study law and mathematics but now at the College of Orange at Breda. Although\nJohn Pell\nwas a teacher at Breda about this time, he seems to have had little contact with Huygens. Through his father's contact with\nMersenne\n, a correspondence between Huygens and\nMersenne\nbegan around this time.\nMersenne\nchallenged Huygens to solve a number of problems including the shape of the rope supported from its ends. Although he failed at this problem he did solve the related problem of how to hang weights on the rope so that it hung in a parabolic shape.\nIn\n1649\nHuygens went to Denmark as part of a diplomatic team and hoped to continue to Stockholm to visit\nDescartes\nbut the weather did not allow him to make this journey. He followed the visit to Denmark with others around Europe including Rome.\nHuygens's first publications in\n1651\nand\n1654\nconsidered mathematical problems. The\n1651\npublication\nCyclometriae\nⓉ\n(\nMeasuring the circle\n)\nshowed the fallacy in methods proposed by\nGregory of Saint-Vincent\n, who had claimed to have\nsquared the circle\n. Huygens'\n1654\nwork\nDe Circuli Magnitudine Inventa\nⓉ\n(\nFinding the magnitude of the circle\n)\nwas a more major work on similar topics.\nHuygens soon turned his attention to lens grinding and telescope construction. Around\n1654\nhe devised a new and better way of grinding and polishing lenses. Using one of his own lenses, Huygens detected, in\n1655\n, the first moon of Saturn. In this same year he made his first visit to Paris. He informed the mathematicians in Paris including\nBoulliau\nof his discovery and in turn Huygens learnt of the work on\nprobability\ncarried out in a correspondence between\nPascal\nand\nFermat\n. On his return to Holland Huygens wrote a small work\nDe Ratiociniis in Ludo Aleae\non the calculus of probabilities, the first printed work on the subject.\nThe following year he discovered the true shape of the rings of Saturn. However others had different theories including\nRoberval\nand\nBoulliau\n.\nBoulliau\nhad failed to detect Saturn's moon Titan so Huygens realised that he was using an inferior telescope. By\n1656\nHuygens was able to confirm his ring theory to\nBoulliau\nand the results were reported to the Paris group. In\nSystema Saturnium\n(1659)\n, Huygens explained the phases and changes in the shape of the ring. Some, including the Jesuit\nFabri\n, attacked not only Huygens theories but also his observations. However by\n1665\neven\nFabri\nwas persuaded to accept Huygens' ring theory as improving telescopes confirmed his observations.\nWork in astronomy required accurate timekeeping and this prompted Huygens to tackle this problem. In\n1656\nhe patented the first pendulum clock, which greatly increased the accuracy of time measurement. His work on the pendulum was related to other mathematical work which he had been doing on the cycloid as a result of the challenge by\nPascal\n. Huygens believed that a pendulum swinging in a large are would be more useful at sea and he invented the cycloidal pendulum with this in mind. He built several pendulum clocks to determine longitude at sea and they underwent sea trials in\n1662\nand again in\n1686\n. In the\nHorologium Oscillatorium sive de motu pendulorum\n(1673)\nhe described the theory of pendulum motion. He also derived the law of centrifugal force for uniform circular motion. As a result of this Huygens,\nHooke\n,\nHalley\nand\nWren\nformulated the inverse-square law of gravitational attraction.\nHuygens returned to Paris in\n1660\nand went to meetings of various scientific societies there. He wrote, in a letter to his brother:-\n... there is a meeting every Tuesday\n[\nat Montmor's house\n]\nwhere twenty or thirty illustrious men are found together. I never fail to go ... I have also been occasionally to the house of M Rohault, who expounds the philosophy of M\nDescartes\nand does very fine experiments with good reasoning on them.\nAt these societies he met many mathematicians including\nRoberval\n,\nCarcavi\n,\nPascal\n,\nPierre Petit\n,\nDesargues\nand Sorbière. After\nPascal\nvisited him in December\n1660\nHuygens wrote\n... we talked of the force of water rarefied in cannons and of flying, I showed him my telescopes...\nIn\n1661\nHuygens visited London, particularly to find out more about the newly forming\nRoyal Society\nmeeting at that time in Gresham College. He was greatly impressed with\nWallis\nand the other English scientists whom he met and, from this time on, he was to continue his contacts with this group. He showed his telescopes to the English scientists and they proved superior to those in use in England. The Duke and Duchess of York came to observe the Moon and Saturn through Huygens' telescope. While in London Huygens saw\nBoyle\n's vacuum pump and he was impressed. After his return to the Hague he carried out a number of\nBoyle\n's experiments for himself. Huygens was elected to the\nRoyal Society of London\nin\n1663\n.\nAt this time Huygens patented his design of pendulum clock with the solution of the longitude problem in mind. In\n1665\nhe learnt that the\nRoyal Society\nwas investigating other forms of clock, in particular\nHooke\nwas experimenting with a spring regulated clock. Huygens wrote to\nHooke\ndoubting this approach which he felt would be unduly affected by temperature changes. Despite this Huygens did begin to experiment with clocks regulated by springs, but their accuracy was poorer than his pendulum clocks.\nHuygens accepted an invitation from Colbert in\n1666\nto become part of the\nAcadémie Royale des Sciences\n. He arrived in Paris that year to discover that the\nSociety\nwas not yet organised. After meetings were held with\nRoberval\n,\nCarcavi\n, Auzout,\nFrenicle de Bessy\n, Auzout and Buot in Colbert's library the\nSociety\nmoved to the Bibliothèque du Roi where Huygens took up residence. He assumed leadership of the group basing much on his knowledge of the way the\nRoyal Society\noperated in England.\nHuygens' work on the collision of elastic bodies showed the error\nDescartes\n' laws of impact and his memoir on the topic was sent to the\nRoyal Society\nin\n1668\n. The\nRoyal Society\nhad posed a question on impact and Huygens proved by experiment that the momentum in a fixed direction before the collision of two bodies is equal to the momentum in that direction after the collision.\nWallis\nand\nWren\nalso answered this question.\nCircular motion was a topic which Huygens took up at this time but he also continued to think about\nDescartes\n' theory of gravity based on vortices. He seems to have shown signs of being unhappy with\nDescartes\n' theory around this time but he still addressed the\nAcadémie\non this topic in\n1669\nalthough after his address\nRoberval\nand Mariotte argued strongly, and correctly, against Descartes' theory and this may have influenced Huygens.\nFrom his youth Huygens' health had never been robust and in\n1670\nhe had a serious illness which resulted in him leaving Paris for Holland. Before he left Paris, believing himself to be close to death he asked that his unpublished papers on mechanics be sent to the\nRoyal Society\n. The secretary to the English ambassador was called and described Huygens' reasons:-\n... he fell into a discourse concerning the\nRoyal Society\nin England which he said was an assembly of the choicest wits in Christendom ... he said he chose to deposit those little labours ... in their hands sooner than any else. ... he said he did foresee the dissolution of this Academy because it was mixed with tinctures of envy because it was supported upon suppositions of profit because it wholly depended upon the humour of a prince and the favour of a minister...\nBy\n1671\nHuygens returned to Paris. However in\n1672\nLouis XIV invaded the Low Countries and Huygens found himself in the extremely difficult position of being in an important position in Paris at a time France was at war with his own country. Scientists of this era felt themselves above political wars and Huygens was able, with much support from his friends, to continue his work.\nIn\n1672\nHuygens and\nLeibniz\nmet in Paris and thereafter\nLeibniz\nwas a frequent visitor to the\nAcadémie\n. In fact\nLeibniz\nowes much to Huygens from whom he learnt much of his mathematics. In this same year Huygens learnt of\nNewton\n's work on the telescope and on light. He, quite wrongly, criticised\nNewton\n's theory of light, in particular his theory of colour. His own work,\nHorologium Oscillatorium sive de motu pendulorum\nⓉ\n(\nThe pendulum clock and the motion of the pendulum\n)\nappeared in\n1673\nand showed that Huygens had moved far from\nDescartes\n' influence.\nHorologium Oscillatorium\nⓉ\n(\nThe pendulum clock and the motion of the pendulum\n)\ncontains work on the pendulum. In it Huygens proves that the cycloid is tautochronous, an important theoretical result but one which had little practical application to the pendulum. He also solves the problem of the compound pendulum. However there is much more than work on pendulums. Huygens describes the descent of bodies in a vacuum, either vertically or along curves. He defines\nevolutes\nand\ninvolutes\nof curves and, after giving some elementary properties, finds the evolutes of the cycloid and of the\nparabola\n. Huygens attempts for the first time in this work to study the dynamics of bodies rather than particles.\nPapin\nworked as an assistant to Huygens around this time and after he left to work with\nBoyle\n, Huygens was joined by\nTschirnhaus\n. Another bout of illness in\n1676\nsaw Huygens return to the Hague again. He spent two years there, in particular studying the double\nrefraction\nBartholin\nhad discovered in Iceland spar crystal. He also worked on the velocity of light which he believed was finite and was pleased to hear of Rømer's experiments which gave an approximate velocity for light determined by observing Jupiter's moons.\nBy\n1678\nHuygens had returned to Paris. In that year his\nTraité de la lumiere\nⓉ\n(\nTreatise on light\n)\nappeared, in it Huygens argued in favour of a wave theory of light. Huygens stated that an expanding sphere of light behaves as if each point on the wave front were a new source of radiation of the same frequency and phase. However his health became even more unreliable and he became ill in\n1679\nand then again in\n1681\nwhen he returned to the Hague for the last time.\nLa Hire\n, who had always argued against foreigners in the\nAcadémie\n, sent his best wishes to Huygens but he clearly hoped that he would not return so that he might himself might acquire his position.\nThe longitude problem had remained a constant cause for Huygens to continue work on clocks all his life. Again after his health returned he worked on a new marine clock during\n1682\nand, with the Dutch East India Company showing interest, he worked hard on the clocks. Colbert died in\n1683\nand a return to Paris without the support of his patron seemed impossible. His father died in\n1687\n, having reached\n91\nyears of age, and the following year his brother left for England. Huygens missed having people around him with whom he could discuss scientific topics. In\n1689\nhe came to England.\nIn England Huygens met\nNewton\n,\nBoyle\nand others in the\nRoyal Society\n. It is not known what discussions went on between Huygens and\nNewton\nbut we do know that Huygens had a great admiration for\nNewton\nbut at the same time did not believe the theory of universal gravitation which he said\nappears to me absurd.\nIn some sense of course Huygens was right, how can one believe that two distant masses attract one another when there is nothing between them, nothing in\nNewton\n's theory explains how one mass can possible even know the other mass is there. Writing about\nNewton\nand the\nPrincipia\nsome time later Huygens wrote:-\nI esteem his understanding and subtlety highly, but I consider that they have been put to ill use in the greater part of this work, where the author studies things of little use or when he builds on the improbable principle of attraction.\nHe departed with much sadness at the thoughts of his scientific isolation in Holland.\nIn the final years of his life Huygens composed one of the earliest discussions of extraterrestrial life, published after his death as the\nCosmotheoros\nⓉ\n(\nTheory of the cosmos\n)\n(1698)\n. He continued to work on improving lenses and on a spring regulated clock and on new pendulum clocks.\nHuygens described the\n31\n-tone equal temperament in\nLettre touchant le cycle harmonique\nⓉ\n(\nLetter about the harmonic cycle\n)\n. This has led indirectly to a tradition of\n31\n-tone music in the Netherlands in this century.\nIn a letter to\nTschirnhaus\nwritten in\n1687\n, Huygens explained his own approach:-\n.. great difficulties are felt at first and these cannot be overcome except by starting from experiments ... and then be conceiving certain hypotheses ... But even so, very much hard work remains to be done and one needs not only great perspicacity but often a degree of good fortune.\nHuygens scientific achievements are summed up in\n[\n4\n]\nas follows:-\n... Huygens was the greatest mechanist of the seventeenth century. He combined\nGalileo\n's mathematical treatment of phenomena with\nDescartes\n' vision of the ultimate design of nature. Beginning as an ardent Cartesian who sought to correct the more glaring errors of the system, he ended up as one of its sharpest critics. ... the ideas of mass, weight, momentum, force, and work were finally clarified in Huygens' treatment of the phenomena of impact, centripetal force and the first\ndynamical system\never studied - the compound pendulum.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Statistics"
  ]
}