{
  "nome_completo": "Christoph Scheiner",
  "nome_curto": "Christoph Scheiner",
  "ano_nascimento": "1573",
  "ano_morte": "1650",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scheiner/",
  "lugar_nascimento": "Markt Wald, near Mindelheim in Swabia (now in Germany)",
  "lugar_morte": "Neisse, Silesia",
  "biografia": "Christoph Scheiner\n's day of birth is certain,\n25\nJuly, but historians have argued whether he was born in\n1573\nor\n1575\n. Both years of birth are given in an almost equal number of obituaries. However, recent discoveries make the date of\n1573\nthe most likely for this is the date recorded in a recently discovered obituary written in\n1650\n, the year of his death. Nothing is known of Scheiner's early life before he entered the Jesuit Latin School of St Salvator in Augsburg in May\n1591\n. He spent over four years studying at this school before graduating in October\n1595\n. Two days after graduating, he entered the Jesuit seminary at Landsberg as a novice in the Society of Jesus\n(\nthe Jesuit Order\n)\n. He spent two years studying as a novice in Landsberg, taught by Rupert Reindl. He then went to Augsburg where he spent\n1597\n-\n98\nstudying rhetoric. It was in Augsburg that he took his first vows and received minor orders from the Bishop of Augsburg, Sebastian Breuning.\nIn\n1598\nScheiner went to the Jesuit University in Ingolstadt where he continued his long Jesuit education. His main studies were in philosophy, in particular metaphysics and mathematics. His mathematics teacher during these three years was Johann Lantz\n(1564\n-\n1638)\nwho later published the important arithmetic text\nInstitutiones arithmeticae\nⓉ\n(\nOn arithmetic\n)\n(1616)\n. Matthäus Rader\n(1561\n-\n1634)\n, a prominent philologist and historian, worked at the Jesuit\ngymnasium\nin Ingolstadt and was a particular support to the young Jesuits who were taking an interest in science, particularly in astronomy. Scheiner had already become interested in constructing mathematical and astronomical instruments and he promised to construct a quadrant for Rader. However, he felt that the instrument he had made was not too good. He wrote to Rader in September\n1603\n(\nquoted in\n[\n7\n]\n)\n:-\n... this consoles me: the most noble of painters, Apelles, displayed his errors\n(\nif any such existed\n)\nin a painting so that they might be corrected by the people. So that he might emerge in this way always more perfect, he would never go out without displaying his works. My works, in fact, would not please me if ever I saw that they were displeasing to others. Let this reason suffice for my willingness to expose my errors time and again to the scrutiny of others, though there is another motive as well: I have known from the outset the kindness and modesty of Your Reverence.\nIn\n1603\nhe was sent to teach humanities at the Jesuit grammar school in Dillingen. Bishop Otto had founded a seminary in Dillingen which had become a Jesuit University in\n1564\nand he had built a college there for training priests. While in Dillingen Scheiner talked to a painter who used a mechanism to draw outlines on paper before he began to paint. The painter kept the mechanism a secret by Scheiner was intrigued and worked out how to construct a pantograph, that is an instrument which allows the copying of a diagram in an enlarged or reduced form. After two years teaching at Dillingen, Scheiner returned to the Jesuit University in Ingolstadt. He had received an M.A. but the training for the Jesuit Order was long and he still had many years of study ahead of him. His teacher Johann Lantz saw much promise in the young man and wrote in the summer of\n1605\n(\nquoted in\n[\n7\n]\n)\n:-\nMaster Scheiner, when in Dillingen, wrote Father Ferdinand Crendel explaining that he had discovered some new and easy method of describing sundials. He does not write what it is, but I hope that it is something excellent, especially since he says that he worked for several years inventing it and excels in inventing new things. Without doubt with this method of his he was far surpass the trifles I have accomplished.\nAlthough he studied theology at Ingolstadt over the following few years, he had achieved quite a name for himself with his inventions. In fact his fame had become so great that the Duke of Bavaria, who was interested in painting, ordered him to come to Munich in\n1606\nto demonstrate his pantograph. Scheiner's studies of theology lasted from\n1605\nto\n1609\n: he was ordained a deacon by bishop Marcus Lyresius on\n14\nMarch\n1609\n, and was awarded a doctorate in theology on\n30\nJune\n1609\nfor his\nTheses Theologicae\nwhich he had defended in a disputation in the usual manner. He was sent to Ebersberg to serve for a year before returning to Ingolstadt where he was appointed as Johann Lantz's successor. Lantz had moved to Munich and Scheiner succeeded him in Ingolstadt as Professor of Mathematics and Hebrew, teaching geometry, astronomy and, in addition, his specialist subjects of sundials and telescopes. Being fascinated by mathematical and astronomical instruments, Scheiner had quickly acquired a good quality telescope and we know that by the spring of\n1611\nhe and his assistant Baptist Cysat were observing the moons of Jupiter. Lantz wrote to\nPaul Guldin\non\n14\nMay\n1611\n(\nquoted in\n[\n7\n]\n)\n:-\nFather Scheiner and Master Baptist Cysat continue steadily to observe the motion of those four planets of Jupiter, having recently sent me some of their observations.\nIn fact it was in March\n1611\nthat Scheiner began to make the observations for which he is most famed, namely his observations of sunspots. He is not famed for making the first known observations of sunspots, this honour goes to\nThomas Harriot\nwho observed sunspots at\n10\na.m. local time on\n18\nDecember\n1610\nwhen the sun was\n7\n°  or\n8\n°  above the horizon. Harriot recorded:-\nIt being a frost and a mist ... I saw it twice or thrice, once with the right eye and other time with the left. In the space of a minute time, after the sun was to clear.\nHe drew a diagram clearly showing three large sunspots. However, these observations by Harriot were not published and only many years later was his priority established.\nGalileo\nmade many observations of sunspots and published\nIstoria e dimostrazioni intorno alle macchie solari e loro accidenti\nⓉ\n(\nHistory and Demonstrations about Solar Spots and their Properties\n)\nin the spring of\n1613\n. He had been able to make his observations using\nBenedetto Castelli\n's idea of using a telescope to project the sun's image onto a sheet of paper. The fact that Scheiner has become important in the story of the discovery of sunspots is because of three letters he wrote to Marc Welser\n(1558\n-\n1614)\nin Augsburg in the autumn of\n1611\n, describing his own observations of sunspots. Welser was a scholar of Greek and Latin with a passion for history and philology who corresponded with many Jesuit scholars, including\nChristopher Clavius\n. He published Scheiner's letters under the title\nTres epistolae de Maculis Solaribus scriptae ad Marcum Velserium\nⓉ\n(\nThree letters by Christoph Scheiner written to Marc Welser\n)\non\n5\nJanuary\n1612\nalthough, since Scheiner wished to remain anonymous, he had signed the letters as 'Apelles latenspost tabulam'\n(\nApelles hiding behind the painting\n)\n. He gave his reasons in\nRosa Ursina\nⓉ\n(\nSunspots\n)\n(1630)\n(\nsee\n[\n7\n]\n)\n:-\nBut since this matter, not only new but also difficult, was perceived to be in many ways contrary to the opinion of the philosophers, lest something would be hastily and rashly published by someone in that university whose retraction would then be difficult and unseemly, my superiors ordered me to proceed cautiously and slowly, until the phenomenon itself had been corroborated by the experience of others, and not to stray casually from the trodden path of the philosophers without evidence to the contrary, and not to publish my observations in the letters to Welser under my name. For in this way they would leave anyone with greater freedom to judge, and no envy would be created. Because of these precautions, it came about that many fewer letters were published under the pseudonym of Apelles than I had in fact written to Welser.\nWelser sent copies of\nTres epistolae\nto many scientists, including\nGalileo\n, in January and February\n1612\n. Let us look briefly at what this publication contained.\nScheiner had drawn a series of diagrams showing sunspots on various days, made by putting dark coloured glass in front of his telescope. However, he deliberately did not try to record the size and shape of the spots accurately, writing\n[\n20\n]\n:-\nAbout the observations shown, I have the following admonitions. ... They are not terribly exact, but rather are hand-drawn on paper as they appeared to the eye without certain and precise measurement, which could not be done sometimes due to the inclement and inconstant weather, sometimes due to the lack of time, and at other times due to other impediments. ... But this should be noted as well: the proportion of the spots to the sun should not be taken from the drawing, for I made them larger than they ought to be so that they would be more conspicuous, especially in the case of some very small ones which otherwise could scarcely be a subject of our vision.\nAlso Scheiner's theory of what the spots were was quite incorrect. He wrote\n[\n18\n]\n:-\nI have always considered it inconvenient to place spots, darker than any ever seen on the moon\n(\nwith the exception of one small spot\n)\n, on the bright body of the sun. It is not plausible to do so, for if they were on the sun, their motion would imply that the sun rotates, and we should see the spots return in the same order and in the same position they had among themselves and with respect to the sun. So far, they have failed to reappear, although other spots have followed the first ones across the solar disk. This is a clear argument that they are not on the sun. I do not think, therefore, that they are real spots, but rather bodies partly eclipsing the sun, namely stars located either between the sun and ourselves or revolving around the sun.\nCertainly one can forgive Scheiner for not recognising the same spots after the sun had rotated for they change markedly. However, since the spots change markedly while travelling across the visible face of the sun, he might well have worked out what was happening. In\n1613\na dispute broke out between\nGalileo\nand Christoph Scheiner over sunspots.\nGalileo\nunfairly accused Scheiner of plagiarism but, although Scheiner's discovery of sunspots was certainly independent of any work by\nGalileo\n, his explanation was quite wrong.\nGiuseppe Biancani\n, however, defended his fellow Jesuit Scheiner and a considerable controversy ensued.\nGalileo\ncorrectly claimed that the spots were on the surface of the sun and were carried round by the sun's rotation. Throughout\n1612\nGalileo\ncorresponded about sunspots with Welser and Scheiner continued making regular observations. In September\n1612\nWelser published a second tract by Scheiner under the pseudonym Apelles entitled\nDe maculis solaribus et stellis circa Jovem errantibus accuratior disquisitio\nⓉ\n(\nOn Solar Spots and the Stars Wandering around Jupiter. A More Accurate Inquiry\n)\n. Respect for Welser prevented\nGalileo\nattacking Apelles with the devastating turn of phrase of which he was very capable. He wrote to Cesi in November\n1612\n(\nsee\n[\n18\n]\n)\n:-\nI intend to show in what a silly way the matter has been dealt with by the Jesuit, and to reprimand him as he deserves. But to do this without offending the Signor Welser is a major difficulty, and is holding up my work.\nGalileo\npublished the letters he had written to Welser under the title\nIstoria e dimostrazioni intorno alle macchie solari e loro accidenti\nⓉ\n(\nHistory and Demonstrations about Solar Spots and their Properties\n)\nin early\n1613\n. This publication was by the\nAccademia dei Lincei\n, and around the same time Welser was elected to that Academy.\nThe controversy did not seem to cause problems for Scheiner who began publishing major works:\n(\nwith Johann Georg Locher\n)\nDisquisitiones mathematicae\nⓉ\n(\nOn  mathematical investigations\n)\n(1614)\n;\nSol ellipticus\nⓉ\n(\nThe elliptical Sun\n)\n(1615)\n;\n(\nwith Georg Schönberger\n)\nExegeses fundamentorum gnomonicorum\nⓉ\n(\nExegeses foundations gnomonicorum\n)\n(1615)\n; and\nRefractiones coelestes\nⓉ\n(\nRefraction in the sky\n)\n(1617)\n. In the two single authored works he noted that the sun appeared to be elliptical when close to the horizon and he explained this by refraction. On\n31\nJuly\n1617\nhe took his final vows before the pope and made a request that he be allowed to go to China as a missionary. His request was refused and he was told that he must remain in Europe and continue to undertake mathematical research. He had received several requests from Archduke Maximilian III to go to Innsbruck to advise on mathematical and astronomical matters, particularly on astronomical instruments, from\n1614\nonwards. In\n1617\nthe Archduke requested Scheiner's permanent presence in Innsbruck as his advisor. Following the death of Maximilian III in\n1618\n, his successor Archduke Leopold V continued to employ Scheiner as his advisor. He published\nOculus hoc est: Fundamentum opticum\nⓉ\n(\nThis is the eye: Fundamentals of optics\n)\n(1619)\non the nature of the eye\n[\n16\n]\n:-\nScheiner was put in charge of building a new Jesuit church in Innsbruck. He also sought out religious relics on behalf of his patrons, and many ... letters recount his successes and difficulties in these quests. ... Scheiner's whereabouts in this seven-year period, ... included an extended stay at Freiburg im Breisgau and a visit to Neisse where he founded a new Jesuit school.\nIn\n1624\nScheiner was called to Rome by the pope. It is unclear exactly why the pope made this summons, but some historians suggest that it was in some way related to the argument between the Church and\nGalileo\n. It was in\n1623\nthat\nGalileo\nhad published\nIl saggiatore\nⓉ\n(\nThe Assayer\n)\nwhich contained a vigorous attack on those\nGalileo\naccused of stealing his ideas. Although\nGalileo\nalmost certainly did not have Scheiner in mind, Scheiner did not see it that way.\nGalileo\nbelieved, correctly, that Scheiner's interpretation of sunspots was wrong and, by this time, Scheiner accepted\nGalileo\n's argument that they were on the surface of the sun. However, Scheiner had every right to be upset over priority issues which he discussed in his most important work,\nRosa Ursina sive Sol\nⓉ\n(\nSpots on the sun\n)\n, published in\n1630\n. In it he acknowledges that\nGalileo\nis correct in claiming that sunspots are on the surface of the sun.  Grant McColley writes in\n[\n14\n]\n:-\nAmong the books which the early seventeenth century devoted to phenomena disclosed by the telescope, few are today more respected than the 'Rosa Ursina' of Christopher Scheiner. There is in fact no work of the period which compares with it in the number and accuracy of the solar observations which it describes. The 'Rosa Ursina' has, however, a second claim for respect, particularly among historians of science, for it presents what is apparently our most complete and exhaustive of seventeenth-century attacks upon the so-called Aristotelian doctrines of solid orbs and the incorruptibility of heavenly bodies. To his attack upon these conceptions Scheiner devoted fourteen chapters of\n150\nfolio pages.\nRosa Ursina\nⓉ\n(\nSpots on the sun\n)\ncontains four books. The first book gives an account of the priority dispute with\nGalileo\nand contains a vigorous attack on him. Scheiner claimed, correctly, that he was the first to make continuous observations of sunspots of scientific value. The second book describes methods of observing the sun, the third book gives a large amount of sunspot data, and the fourth book discussed the rotation period of the sun, the axis of rotation, solar flares and other issues such as the granulation of the photosphere. It also contains Scheiner's argument in favour of a geocentric universe, which he supported with quotations from the scriptures. His observations had shown, however, that Mercury and Venus revolve round the sun. While in Rome, Scheiner also published\nPantographice seu ars delineandi\nⓉ\n(\nOn the art of drawing with a Pantograph\n)\n(1631)\ndescribing the pantograph he had invented more than\n25\nyears earlier. He wrote\nProdromus pro Sole Mobili et Terra Stabili contra Galilaeum a Galileis\nⓉ\n(\nIntroductory Treatise in Favour of a Moving Sun and a Stable Earth against Galileo Galilei\n)\n, whose contents are well described by the title, while in Rome but this was not published until\n1651\n, a year after his death. Also while he was in Rome, he observed in\n1629\na halo at an angle of\n28\n°  from the sun. This halo, now known as Scheiner's halo, is thought to be caused by refraction of sunlight by certain ice crystals in the earth's atmosphere, see\n[\n21\n]\n.\nIn\n1633\nScheiner left Rome and went to Vienna. Europe was, at this time, in the midst of the Thirty Years War which erupted in different locations with armies, mainly of mercenary soldiers, fighting for Roman Catholic rulers, Lutheran rulers or Calvinist rulers. Although Scheiner probably intended to go to Neisse, in fact the war prevented him from doing so for around four years. Only in\n1637\ndid he return to the Jesuit school in Neisse where he worked until his death in\n1650\n.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}