{
  "nome_completo": "Claire Voisin",
  "nome_curto": "Claire Voisin",
  "ano_nascimento": "1962",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Voisin/",
  "lugar_nascimento": "Saint-Leu-la-Forêt, Île-de-France, France",
  "lugar_morte": null,
  "biografia": "Claire Voisin\nwas the daughter of Michel Voisin\n(1917\n-\n2011)\nand Nicole Bregeault\n(1922\n-\n2020)\n. Michel Voisin was born\n31\nMarch\n1917\nat Fontainebleau, Île-de-France, France, and studied at the École polytechnique. He became an engineer and married Nicole Bregeault on\n26\nOctober\n1945\n. She was born on\n18\nFebruary\n1922\nin Paris and had stopped her education during World War II. Michel and Nicole Voisin had twelve children with seven girls and two boys older than Claire; Anne-Marie Voisin\n(1946\n-\n2020)\n, Béatrice Voisin\n(1947\n-\n1996)\n, Dominique Voisin\n(1948\n-\n)\n, Marie-Laure Voisin\n(1949\n-\n2000)\n, Bénédicte Voisin\n(1951\n-\n2021)\n, Paul Voisin, Nicolette Voisin, Marion Voisin and Jean-Baptiste Voisin. Claire has two younger siblings, Françoise Voisin and Martin Voisin. Claire Voisin wrote about her parents in the autobiography\n[\n2\n]\n:-\nMy father was an engineer who liked science and taught me a lot of classical geometry\n(\ncircle and triangle\n)\nand my mother, who had stopped studying during the Second World War, was very fond of art. She was extremely enthusiastic about Impressionist painting and the subsequent development of Modern Art. She began studying history of art at École du Louvres when she was in her\n50\n's.\nAlthough Claire Voisin enjoyed mathematics when she was a child, there was an aspect of it that she disliked. She did not like games and being asked to find a proof of a result that the teacher knew how to solve simply looked like a game. Her father played a particularly important role when she was about ten years old\n[\n4\n]\n:-\nWhen I was a child, around the age of ten, my father, who was already quite old, lost his job due to the economic crisis of the\n1970\ns. At that time, he dedicated more time taking care of us, his children, and especially me, because I was good at math, unlike my brother who was just a year older than me and not interested in math. Ultimately, I benefited indirectly from his more marked presence in our life. ... He taught me traditional geometry, ellipse equations, and other math concepts. I learned a lot from him, even if it wasn't necessarily up to date.\nPerhaps her first move towards seeing more depth in mathematics came when she was about twelve years old. Marcel Condamine and Paul Vissio had published three volumes of mathematics aimed at the final year of study for the baccalaureate C. Claire's eldest brother Paul Voisin had studied these books and by\n1974\nhe had left home, but the algebra volume was still in the house. Claire studied this book which let her see abstract mathematics and substantial mathematical proofs which she found much more satisfying than the mathematics she was being taught at high school, the Lycée de Taverny. She particularly like learning about congruences and found the concept of an ideal in a ring fascinating. This, however, was not enough to make her think that mathematics might become her profession. At this stage she thought philosophy was the subject for her and other things she loved were painting and poetry. Mathematics was not far away in the things she painted, for her paintings were usually figurative based on a geometrical pattern.\nIn\n1979\nVoisin graduated from the Lycée de Taverny with a baccalaureate and left home to spend two years taking preparatory classes for university at the Lycée Louis-le-Grand. She lived in the Latin Quarter of Paris while attending the Lycée. This area is where the Sorbonne is situated and it is student oriented with cafés and bookshops; Voisin loved the Latin Quarter. At this point she was awarded a scholarship and became financially independent. She said\n[\n37\n]\n:-\nI think it was precisely\n[\nin the preparatory classes\n]\nthat I saw that mathematics could be deep. For example, I loved general topology - that you can define a function to be continuous simply set-theoretically, because it preserves a certain kind of subset that you defined before - found it wonderful ...\nAfter two years at the at the Lycée Louis-le-Grand, Voisin entered the École Normale Supérieure de Sèvres. We need a word of explanation why she did not study at the École Normale Supérieure de d'Ulm. The École Normale Supérieure de d'Ulm was established in\n1794\nas an institution to train school teachers, but in\n1936\nit began to provide university level education. It was a male only institution and the École Normale Supérieure de Sèvres was funded in\n1881\nto train women school teachers but, in\n1936\nunder the name École Normale Supérieure de jeunes filles, it provided university level education. The École Normale Supérieure de Sèvres and the École Normale Supérieure de d'Ulm merged in\n1985\n. Although Voisin stood out from the other students, she still was not entirely satisfied with studying mathematics. She still had the idea that she might move to philosophy\n[\n4\n]\n:-\nFor two or three more years, I wondered about the possibility of doing philosophy, because I was looking for something beyond mathematical ideas, perhaps even what generated these ideas.\nHer interest in philosophy and mathematics continued and in fact she published the interesting book\nFaire des mathématiques\nⓉ\n(\nDoing Mathematics\n)\nin\n2019\nwhich asks questions such as \"What is mathematical knowledge?\" \"What is a mathematical theory for?\" and even more fundamental, \"What is mathematics?\". For more information about this book, see\nTHIS LINK\n.\nVoisin graduated from the École Normale Supérieure in\n1983\nand began to undertake graduate studies at the Université Paris VI - Jussieu, returning to live in the Latin Quarter that she loved, before embarking on her doctorate at the Université Paris-Sud XI - Orsay. During her studies, in\n1984\n, she married Jean-Michel Coron\n(\nborn\n8\nAugust\n1956\nin Paris\n)\n. Jean-Michel had been a student at the École Polytechnique\n(1975\n-\n78)\n, studied engineering at the Corps des Mines\n(1978\n-\n81)\nand was awarded a doctorate in mathematics from the Université Paris VI in\n1982\nfor his thesis\nSolutions périodiques non triviales d'une équation des ondes\nⓉ\n(\nNon-trivial periodic solutions of a wave equation\n)\n. His thesis advisor had been the functional analyst Haïm Brezis\n(\nborn\n1\nJune\n1944)\n. Coron was an assistant lecturer at the École Polytechnique\n(1983\n-\n1987)\nand then a professor at the Université Paris-Sud XI. Claire Voisin and Jean-Michel Coron had five children: Camille Coron\n(\nborn\n10\nJuly\n1987)\n; Clotilde Coron\n(\nborn\n29\nMay\n1990)\n; Jennifer Coron\n(\nborn\n21\nMay\n1992)\n; Aliénor Coron\n(\nborn\n15\nApril\n1996)\n; and Basile Coron\n(\nborn\n28\nMarch\n1997)\n. She was soon involved in deeper mathematics which was more pleasing to her\n[\n4\n]\n:-\nI explored more specialised areas, such as algebraic topology during my Master's degree. Later, in graduate school, I was introduced to magnificent theories, such as Riemannian geometry, the theory of geodesics, curvature, and the calculus of variations, notably thanks to Marcel Berger's course. These theories were characterised by very relevant and extremely well developed definitions, which made them captivating.\nOther than Marcel Berger, she learnt more from books than from courses. She read many commutative algebra books, then Robin Hartshorne's\nAlgebraic Geometry\n,\nDavid Mumford\n's\nAlgebraic Geometry\nand William Fulton's\nAlgebraic Curves: An Introduction to Algebraic Geometry\n. She attended a course by Arnaud Beauville on algebraic geometry but that time she knew all the material in his course. Olivier Debarre describes Voisin when she was undertaking research for her doctorate\n[\n3\n]\n:-\nAlthough she has considerably mellowed over the years, she was very intense and demanding in her initial engagements in the world of mathematics. While preparing her PhD thesis, she was appointed teaching assistant for a course taught by Luc Illusie. The story goes that she quickly decided that the material given in class was not sufficiently challenging and she turned her exercise sessions into a parallel, much faster course, to the dismay of most of the students.\nHer thesis advisor was Arnaud Beauville and Voisin wrote the thesis\nLe théorème de Torelli pour les cubiques de\nP\n5\nP^{5}\nP\n5\nⓉ\n(\nTorelli's theorem for the cubics of P\n5\n)\n. In the thesis she writes:-\nI would like to thank Arnaud Beauville, who proposed the theme of this work to me, and whose judicious advice helped me to bring it to fruition.\nVoisin was awarded her doctorate in\n1986\nand in that year was appointed to the research position 'chargée de recherche' at the Centre national de la recherche scientifique. She published a paper containing material from her thesis, with the same title as the thesis, in\n1986\n. Olivier Debarre writes about this first paper in\n[\n3\n]\n:-\nClaire has always been a very quick thinker, and when it came to mathematics she had little patience with details and people whose thinking was slower than hers. Her first article, published in 'Inventiones' in\n1986\nand extracted from her PhD thesis, where she proved the Torelli theorem for cubic hypersurfaces of dimension\n4\n, contains the following warning: \"The symbol\n□\n\\Box\n□\nmeans: the proof is obvious or uninteresting\"\n(\nand these boxes are liberally used in that article\n)\n. This capacity to think more quickly than others impressed all those around her.\nHerbert Clemens Jr\n(\nborn\n15\nJune\n1939)\nspecialised in complex algebraic geometry and was a professor at the University of Utah at Salt Lake City. Voisin was appointed as a postdoctoral student to work with Clemens at the University of Utah and, immediately after the birth of her first child Camille Coron, born\n10\nJuly\n1987\n, she set off for Utah leaving Camille in Paris. This, however, did not work out for her\n[\n2\n]\n:-\nIn\n1987\n, I met Kollár who at that time was Professor at the University of Utah in Salt Lake City where I was supposed to stay as a postdoc with Herb Clemens but having left my baby in Paris, I found the separation too hard and after one month finally decided to return. Starting from that period, for many years I spent most of my time at home, except of course for attending seminars, and found it very convenient doing research there.\nWe note at this point that János Kollár and Claire Voisin were joint winners of the Shaw Prize in\n2017\n.\nWe mentioned above Voisin's first paper published in\n1986\n. Her next four papers were all published in\n1988\n:\nUne précision concernant le théorème de Noether\nⓉ\n(\nA clarification concerning Noether's theorem\n)\n;\nCourbes tétragonales et cohomologie de Koszul\nⓉ\n(\nTetragonal curves and Koszul cohomology\n)\n;\nUne remarque sur l'invariant infinitésimal des fonctions normales\nⓉ\n(\nA remark on the infinitesimal invariant of normal functions\n)\n; and\nSur la jacobienne intermédiaire du double solide d'indice deux\nⓉ\n(\nOn the intermediate Jacobian of the double solid of index two\n)\n. The quality of her work was quickly recognised and she was awarded the CNRS Bronze Medal in\n1988\n. This medal is awarded to encourage young mathematicians to continue to build on their early excellent work.\nThis was the first of fourteen awards made to Voisin\n(\nup to March\n2024)\n; we give more information about each of these at\nTHIS LINK\n.\nIn\n1989\nVoisin was awarded her\nhabilitation\n, a qualification which allowed her to direct research. From\n1989\nuntil\n2012\n, Voisin and her large family lived at Bourg-la-Reine on the southern outskirts of Paris. We have to mention at this point that there was a time when another famous mathematician lived in Bourg-la-Reine, namely\nÉvariste Galois\n. She continued to receive awards for her outstanding work, with the\nEuropean Mathematical Society\nPrize in\n1992\nand delivering the Cours Peccot at Collège de France in the same year. In\n1994\nthe International Congress of Mathematicians was held in Zurich and Voisin was invited to deliver a lecture in Section\n6\n: Algebraic Geometry. Her lecture was\nVariations of Hodge structure and algebraic cycles\n.\nAlthough Voisin spent much time at home when her children were young, finding it a good place to undertake research, she did often attend seminars. In\n[\n3\n]\nDaniel Huybrechts explains that this sometimes presented the speaker with problems since she was so sharp and knowledgeable:-\nWhenever invited to speak at a conference with Claire Voisin in the audience, I am particularly nervous, and I like to think that I am not the only one. It is likely that at the end of a talk, especially on one of her numerous favourite topics, she understands the matter better than anyone else in the room, speaker included. She is likely to point out a crucial subtlety you have totally missed or may come up with a cleverer argument or a stronger result. At least, that is what happened to me. In any case, her questions are always dead-on target and likely to keep you thinking for some time. It seems almost impossible to discover a geometric construction involving\nHodge\ntheory that she has not thought of before or will not be able to enhance right away. Her technical prowess and her geometric intuition are mind-blowing and often, I find, a little intimidating.\nLet us give further details of Voisin's career. In\n1995\nshe was appointed Research Director at the Institut de Mathématiques de Jussieu-Paris Rive Gauche. This Institute is affiliated to the CNRS, the Sorbonne University and the University of Paris. She spent\n1996\nas a Visiting Professor at the Sapienza University of Rome and delivered the lectures\nVariations of Hodge structure of Calabi-Yau threefolds\nfor the \"\nLagrange\nChair\" at the University 'La Sapienza' during the autumn of\n1996\n. From\n2012\nto\n2014\nshe was a Professor at the École Polytechnique at Palaiseau, then Professor at the Collège de France from\n2015\nto\n2020\nholding the Chair of Algebraic Geometry. The conference 'Algebraic Geometry' was held\n16\n-\n20\nMay\n2022\nat the\nHenri Poincaré\nInstitute in Paris to celebrate Voisin's\n60\nth birthday.\nWe mentioned above some prizes Voisin has been awarded up to\n1992\n. She continued to receive major awards for her outstanding work. She received the Servant Prize from the\nAcademy of Sciences\nin\n1996\n:-\n... for her work in algebraic geometry, in particular on Torelli's theorem, on the\nGriffiths\n-Harris conjectures, on the\nNoether\n-\nLefschetz\nlocus and on algebraic cycles.\nThe\nAcademy of Sciences\nalso awarded her their\nSophie Germain\nPrize in\n2003\nand the CNRS awarded her their Silver Medal in\n2006\n. The\nAmerican Mathematical Society\nawarded her the Ruth Lyttle Satter Prize in Mathematics in\n2007\n[\n1\n]\n:-\n... for her deep contributions to algebraic geometry, and in particular for her recent solutions to two long-standing open problems: the\nKodaira\nproblem and Green's Conjecture.\nVoisin had constructed a counterexample to the\nKodaira\nConjecture in her paper\nOn the homotopy types of compact Kähler and complex projective manifolds\n(2004)\nand, in addition to the Satter Prize, she was awarded the Clay Research Award in\n2008\n[\n47\n]\n:-\n... for her disproof of the\nKodaira\nconjecture.\nThese and other achievements led to further prizes such as the\nHeinz Hopf\nPrize from ETH Zurich in\n2015\nand the CNRS Gold medal in\n2016\n.\nJános Kollár and Claire Voisin were jointly awarded the Shaw Prize in\n2017\n[\n49\n]\n:-\n... for their remarkable results in many central areas of algebraic geometry, which have transformed the field and led to the solution of long-standing problems that had appeared out of reach.\nIn\n2019\nshe received the L'Oréal-UNESCO International Award For Women in Science\n[\n32\n]\n:-\n... for her outstanding work in algebraic geometry. Her pioneering discoveries have allowed to resolve fundamental questions on the topology and\nHodge\nstructures of complex algebraic varieties.\nShe received the BBVA Foundation Frontiers of Knowledge Award in Basic Sciences in\n2023\n[\n11\n]\n:-\n... for work that has driven forward mathematical thought by breaking down barriers and bridging the space between two key areas of geometry.\nIn\n2024\nshe received the Crafoord Prize in Mathematics\n[\n51\n]\n:-\n... for outstanding contributions to complex and algebraic geometry, including\nHodge\ntheory, algebraic cycles, and hyperkähler geometry.\nWe note that she is the first woman to receive the Crafoord Prize in Mathematics.\nIn addition to these prizes and awards, Voisin has been honoured with being elected to various academies. In\n2009\nshe became a member of the\nGerman Academy of Sciences Leopoldina\n. She was elected an Honorary Member of the\nLondon Mathematical Society\nin\n2012\n. In\n2014\nshe was elected as an Ordinary Member of the Academia Europaea. In May\n2016\nshe was elected as an International Member of the\nNational Academy of Sciences\n. She was elected a Foreign Member of the\nRoyal Society\nin\n2021\nand elected as an International Honorary Member of the\nAmerican Academy of Arts and Sciences\nin\n2022\n.\nThere is another important service that Voisin gives to mathematics, namely as an editor of journals. The list is quite amazing:\nDuke Mathematical Journal\n(1996\n-\n2009)\n;\nMathematische Zeitschrift\n(1997\n-\n2004)\n;\nCompositio mathematica\n(1998\n-\n)\n;\nJournal of the European Mathematical Society\n(1998\n-\n2014)\n;\nAnnales Scientifiques de l'École Normale Supérieure\n(1999\n-\n2004)\n;\nJournal of Algebraic Geometry\n(2004\n-\n2007)\n;\nJournal of Differential Geometry\n(2004\n-\n2007)\n;\nPublications des Laboratoires. École Normale Supérieure. Série Mathematiques\n(2007\n-\n2011)\n;\nCommunications in Contemporary Mathematics\n(2007\n-\n)\n;\nJournal de Mathématiques Pures et Appliquées\n(2009\n-\n)\n; Editor-in-Chief,\nPublications des Laboratoires. École Normale Supérieure. Série Mathematiques\n(2011\n-\n)\n;\nCommunications in Analysis and Geometry\n(2012\n-\n)\n;\nForum of Mathematics Sigma\n(2013\n-\n2014)\n;\nJournal de l'Ecole polytechnique Mathématiques\n(2014\n-\n)\n.\nShe has been an invited speaker at many conferences and invited to give important lecture series. For example, in addition to those mentioned above: plenary speaker at the\n4\nth European congress of Mathematics in Stockholm, July\n2004\ngiving the lecture\nRecent progresses in Kähler and complex algebraic geometry\n. She delivered the\nTakagi\nlectures\nSome aspects of the Hodge conjecture\nin Kyoto in November\n2006\n; the\nAdrian Albert\nlectures on\nHodge structures in Kähler and/or algebraic geometry\nat the University of Chicago in April\n2007\n; the\nAlfred Brauer\nlectures on\nCurves and their Jacobians; from canonical syzygies to Hodge theory and algebraic cycles of Jacobians\nat the University of North Carolina at Chapel Hill in February\n2009\n. She was a plenary speaker at the International congress of Mathematicians in Hyderabad in August\n2010\ngiving the lecture\nOn the cohomology of algebraic varieties\n. She gave the\nRademacher\nlectures at the University of Pennsylvania in October\n2011\n; the\nHermann Weyl\nlectures at the Institute for Advanced Study, Princeton in November\n2011\n; the\nAbel\nlecture\nMixed Hodge structures and the topology of algebraic varieties\nin Oslo in May\n2013\n; the\nCoxeter\nlectures on\nChow rings of Calabi-Yau manifolds\nat the\nFields\nInstitute in November\n2013\n. She was a plenary speaker at the British Mathematical Colloquium held at Queen Mary University of London in April\n2014\ndelivering the lecture\nPoints, zero cycles, and rationality questions\n; she gave the Distinguished lectures at the University of Haifa in April\n2016\n, the three lectures being\nHodge structures and coniveau\n,\nAlgebraic cycles and Hodge theory\n, and\nDecompositions of the diagonal\n; the Distinguished lectures at the University of California Los Angeles in May\n2017\non\nHyper-Kähler\n(\nor quaternionic\n)\nmanifolds\n; five\nRamanujan\nlectures on\nComplex Algebraic Geometry\nat the Tata Institute of Fundamental Research in Bangalore in October\n2018\n; the\nEuler\nlecture on\nSome Aspects of Algebraic Geometry\nin Sansouci, Postdam in May\n2019\n; the\nTerry Wall\nlecture\nQuadratic extensions: Algebra and Geometry\nat the University of Liverpool in May\n2020\n. She was a plenary speaker at the British Mathematical Colloquium held at Kings College, London in June\n2022\ndelivering the lecture\nOn the complex cobordism classes of hyper-Kähler manifolds\n; a plenary speaker at the joint AMS-EMS-SMF meeting in Grenoble in July\n2022\n. She gave the Elisha Netanyahu Memorial Lecture at the Technion Institute, Haifa in April\n2023\n; and the Michael Erceg Public Lecture in Auckland in April\n2023\n.\nIn many of the interviews Voisin has given, she has been asked how she managed to balance her work and her family life.\n[\nAs a little aside: why aren't male mathematicians asked such a question in an interview?\n]\nHere is one of Voisin's replies\n[\n13\n]\n:-\nI had five children, I was very passionate about educating them, about spending time with them and I think that family life helped me a lot. This job can be hard psychologically, with a lot of uncertainties related to research, the work sometimes goes very slowly. For me having to spend a lot of time with my children, having family duties, made me better balanced and that was in some sense very helpful. You know, it's hard to convince yourself that you are doing something very useful, if you do pure mathematics. I don't ask myself a lot of these questions anymore but sometimes it is not clear if you are doing something very important. With a family, you don't have to ask yourself this question. I think I would have had much more psychological difficulty in my research if I had not had my family.\nMost of Voisin's mathematics is pure mathematics but she did do some work on mirror symmetry which was motivated by quantum field theory. Her results in this area were published in her book\nSymétrie miroir\nⓉ\n(\nMirror symmetry\n)\n(1996)\nwhich was translated into English and published as\nMirror Symmetry\n(1999)\n. She did not, however, find working on theoretical physics ideas very satisfactory\n[\n6\n]\n:-\nI worked on mirror symmetry maybe for three or four years. Then I left, because I didn't feel I was doing my best. I was trying to understand what these people had in mind, but I gave up quickly. The problem is, physicists have extraordinary ideas - sort of like magic. But they don't work at the same scale of time as us. We mathematicians need a lot of time to produce the right definitions and to prove theorems. And we are not happy if the statements are not proved rigorously. When you start doing that, and you come back three years later, and tell the physicists, \"now I have proved your formula rigorously\", they already went in another direction. Some mathematicians have stayed in contact with physics and have done extraordinary things. But for me it was not good, because I like to work alone and to ask my own questions.\nFor more information about the book\nMirror Symmetry\n, see\nTHIS LINK\n.\nLet us end by giving a number of quotes by mathematicians who have worked with her. Olivier Debarre writes\n[\n3\n]\n:-\nOver the years, as she has gone from success to success, she has become a little less driven and more helpful when addressing others. She is now an excellent speaker. Her courses, although still relatively fast-paced, are very successful with students, and she has written a very popular reference book on\nHodge\ntheory based on these courses. She is very generous with her time\n(\nwith students as well as with colleagues\n)\n, and I believe that her students are no longer terrified of meeting with her. But her enthusiasm for mathematics is intact, and she is still remarkably intense.\nPhillip Griffiths writes\n[\n3\n]\n:-\nOver the past quarter century, Claire Voisin has been the leader in the field of complex algebraic geometry. In her work she has both solved many deep, long-standing geometric problems and established a number of results that delineate the field. Of particular personal interest is the extraordinary depth and ingenuity of her use of\nHodge\ntheory blended with the panoply of modern algebro-geometric methods. Although Claire has complete mastery of\nHodge\ntheory and of the more formal algebraic and homological techniques in algebraic geometry, rather than add to these theories for their own sake her work enriches them by their use in solving difficult questions; she is a problem solver in the best sense of the word rather than a theory builder.\nDaniel Huybrechts writes\n[\n3\n]\n:-\nDespite being somewhat awe-inspiring, Voisin has become extremely popular among young algebraic geometers. She has supervised a number of excellent PhD theses and is known for her generosity towards her students and to young mathematicians in general. Her advanced courses on complex geometry and\nHodge\ntheory were crucial in the formation of a new generation of French complex geometers, and the English two-volume edition of her book on the subject has become the ultimate source for everyone wishing to learn about the modern theory of complex manifolds. Among my students, it has become an unspoken requirement and a good tradition to work through her book methodically. Voisin's deep love for algebraic geometry and her dedication to advance mathematics in general will continue to be an inspiration. The challenge is to keep up with her.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}