{
  "nome_completo": "Clara Latimer Bacon",
  "nome_curto": "Clara Bacon",
  "ano_nascimento": "1866",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bacon_Clara/",
  "lugar_nascimento": "Hills Grove,  (now Tennessee Township) Illinois, USA",
  "lugar_morte": "Baltimore, USA",
  "biografia": "Clara Bacon\nwas the daughter of Larkin Crouch Bacon\n(1818\n-\n1877)\nand Louisa Latimer\n(1831\n-\n1914)\n. Larkin Bacon had been born\n2\nMarch\n1818\nin Jonesborough, Tennessee. He became a farmer and married Honor Durbin\n(1825\n-\n1864)\non\n26\nDecember\n1941\nin Handcock, Illinois. They had four children: Mary Ann Bacon\n(1843\n-\n1936)\n, George W Bacon\n(1848\n-\n1867)\n, Joseph Barnes Bacon\n(1854\n-\n1936)\nand Fannie Bacon\n(1864\n-\n1864)\n. Honor died as a result of childbirth, the child Fannie dying two days after her mother. Larkin Bacon married his second wife Louisa Latimer on\n20\nOctober\n1864\nin McDonough, Illinois. For Louisa it was also her second marriage. She had married Joseph Meek on\n13\nNovember\n1849\nin Knox, Illinois and they had several children before Joseph died on\n23\nOctober\n1863\n. Larkin and Louisa Bacon had four children, Clara Latimer Bacon\n(1866\n-\n1948)\n, the subject of this biography, Nancy Bacon\n(1867\n-\n1880)\n, Willie Larkin Bacon\n(1871\n-\n1880)\nand Agnes Latimer Bacon\n(1874\n-\n1930)\n. Although Clara was the oldest of her parents four children, she had quite a number of half-siblings. For example, at the\n1870\nUS census, Clara is three years old and five older half-siblings are living at the same home, namely Eugene, Joseph B, James H, Harvey M and Louie.\nThe Bacon family lived in Hills Grove, a small town where early settlers lived. It was near the Hancock County border in Tennessee Township, but the town eventually vanished. At the time Clara was growing up it had a primary school, which she attended. On\n24\nOctober\n1877\nLarkin Bacon died in Hills Grove and soon after that Clara's mother Louisa moved to Abingdon, Knox County, Illinois. Certainly by the time of the\n1880\nUS census, Louisa and the four children from her marriage with Larkin, were living in Abingdon. This town, like Hills Grove, was a town set up by early settlers but unlike Hills Grove, Abingdon has survived. Clara began her secondary education at North Abingdon High School. This school was a brick building which had been built in\n1868\n. After graduating from this school, she studied at Hedding College in Abingdon. This college had begun life as Hedding Collegiate Seminary, founded in\n1855\nand named after the Methodist Bishop, Elizah Hedding. In\n1857\nit had became known as the Hedding Seminary and Central Illinois Female College, then changed its nameÂ to Hedding College in\n1875\n. Clara was awarded the degree of PhB\n(\nBachelor of Philosophy\n)\n, an undergraduate bachelor's degree.\nAfter the award of her PhB degree, Bacon taught for the school year\n1886\n-\n87\nat a private school in Dover, Kansas. In the autumn of\n1887\nshe entered Wellesley College, a private women's college in Wellesley, Massachusetts, and studied for a second bachelor's degree and she was awarded a B.A. in\n1890\n. One of her mathematics lecturers at Wellesley College was\nEllen Hayes\nwho had been appointed in\n1879\n, only four years after the College opened. It was remarkable for a women's college in the United States since it was the first to have scientific laboratories. Bacon was particularly influenced by\nEllen Hayes\nwho became a professor and Head of the Mathematics Department in\n1888\nwhile Bacon was studying there. Later in her Ph.D. thesis, Bacon gave special thanks to\nEllen Hayes\nfor her help while she was at Wellesley College.\nAfter graduating from Wellesley College, Bacon was appointed as a teacher in a private school in Litchfield, Kentucky. This was the first of four different schools she taught in over the next seven years. After one year,\n1890\n-\n91\n, at the school in Litchfield, she was appointed to teach at Hedding College in Abingdon, where she herself had studied. For the two years\n1891\n-\n93\nshe taught mathematics and German at the College and, in addition, served as librarian. Remaining in Abingdon, she spent the next two years,\n1893\n-\n95\n, as the principal of North Abingdon High School, again being at a school where she had been a pupil. Her final school for this seven year period was at the Grand Prairie Seminary, a secondary school in Onarga, Illinois. Onarga was a small town which, like Hills Grove and Abingdon, had been settled in the first half of the\n19\nth century. Although a small town there were two schools, a public school and the private co-educational Grand Prairie Seminary which was a boarding school that had been established in\n1864\n. The pupils had to have well off parents to be able to afford the fees but the education it offered was outstanding.\nIn\n1897\nBacon was appointed as an instructor at the Woman's College of Baltimore which was renamed Goucher College in\n1910\n. Up to this time she had never spent more than two years in one job, but things now changed and she spent the rest of her career at this College, working there until she retired in\n1934\n. When she was appointed, there was only one other mathematician at the College, her head of department William Henry Maltbie. He had been born in Toledo, Ohio in\n1867\n, served as Professor of Mathematics at Hedding College in\n1890\n-\n91\n, then studied for his Ph.D. at Johns Hopkins, being awarded the degree in\n1895\n. He had been appointed as an instructor at the Woman's College of Baltimore in\n1895\n, being promoted to associate professor later in the same year. Agnes Latimer Bacon, Clara's sister, had studied for an A.B. in physics at Wellesley College, and she moved to Baltimore City where Clara, her mother and her sister Agnes set up home together. At the time of the\n1900\nUS census, the three of them are living at\n2316\nCalvert Street in Baltimore City with both Clara and Agnes giving their occupation as \"teacher'. They also have a coloured servant, Ida Lindsay, who was working as their cook.\nClara Bacon now began to study for more advanced degrees and, while continuing to work full time at the Woman's College, she studied each summer from\n1901\nto\n1904\nat the University of Chicago for a Master's Degree. She took the following courses: Solid Analytics and Determinants\n(\ntaught by James Harrington Boyd\n)\n; Differential Equations\n(\ntaught by\nHerbert Ellsworth Slaught\n)\n; Definite Integrals\n(\ntaught by Arthur Constant Lunn\n)\n; Analytic Mechanics\n(\ntaught by Arthur Constant Lunn\n)\n; Pure Projective Geometry\n(\ntaught by\nLeonard Eugene Dickson\n)\n; Modern Analytic Geometry\n(\ntaught by\nLeonard Eugene Dickson\n)\n; Higher Plane Curves\n(\ntaught by\nHeinrich Maschke\n)\n; Theory of Functions of a Complex Variable\n(\ntaught by\nLeonard Eugene Dickson\n)\n; and Theory of Invariants\n(\ntaught by\nOskar Bolza\n)\n. Her dissertation, which she submitted in in\n1903\n, was\nThe determination and investigation of the real chords of two conics which intersect fewer than four real points\nand she was awarded an A.M. in September\n1904\n.\nAfter she retired, Bacon wrote to\nOskar Bolza\non\n23\nApril\n1936\n. John W Boyer writes\n[\n3\n]\n:-\nThe quality of teaching on the graduate and undergraduate levels seems to have been generally high, and many former students looked back on their association with senior faculty with pleasure and nostalgia. Writing to\nOskar Bolza\n, one of the founders of the Department of Mathematics, a former MA student, Clara Latimer Bacon, recalled, \"Your zest for the subject and your careful preparation for each class and the clearness and elegance of your lectures as well as your personal interest in your students have been an inspiration to me as a teacher ever since. Among the pleasantest memories of my life at the University of Chicago are the Sunday evenings in your home where you and Mrs Bolza made your students so welcome.\"\nThe award of her Master's Degree did not stop Bacon's summer visits to the Mathematics Department in Chicago, for she was there in\n1907\nand\n1908\n. In fact she had applied to Johns Hopkins in September\n1907\nfor graduate studies there. This was prompted by the decision by the trustees of Johns Hopkins who had decided to allow women to be admitted to graduate study. In fact\nChristine Ladd-Franklin\nhad been admitted in\n1878\nas a \"special student,\" on the condition that her name would not appear in the catalogue and her case would not set any precedents. Margaret Rossiter writes\n[\n12\n]\n:-\nIt was not until\n1907\n, thirty-one years after the university had opened, that ... Johns Hopkins President ... Ira Remsen could finally admit the women officially. Remsen defended the new policy ... as \"a simple act of justice\" that merely recognised what was fast becoming standard university practice. He also softened the blow for coeducation's diehard opponents by reserving the right to refuse women students if they wished. Women were admitted to all classes provided there was \"no objection on the part of the instructor concerned.\"\nOne of the courses Bacon took in\n1908\n-\n09\nwas on symbolic logic, taught by\nChristine Ladd-Franklin\n. Bacon was a Johns Hopkins' fellow in\n1909\n-\n11\n, and in\n1910\n-\n11\nshe held a fellowship from the Baltimore Association for the Promotion of the University Education of Women. This Association had been founded in\n1897\n, partly through the efforts of\nLadd-Franklin\n, and had worked to persuade Johns Hopkins to open its graduate school to women. The authors of\n[\n8\n]\nnote:-\nDuring this period Bacon's sister Agnes was a physics student at Johns Hopkins, and in\n1914\nshe was a mathematics student at the University of Chicago. Agnes Bacon worked at the Johns Hopkins School of Hygiene and Public Health and published several articles in the field of biometrics during the early\n1920\ns.\nBacon was awarded a Ph.D. in\n1911\nfor her thesis\nThe Cartesian oval and the elliptic functions â and Ï\n. The main results appeared in a paper with the same title in the\nAmerican Journal of Mathematics\n. It has the following Introduction\n(\nwe have removed the page numbers in the given references\n)\n:-\nThe object of this paper is to show that the leading properties of the Cartesian oval, as developed in such texts at Williamson's \"Differential Calculus,\"\nSalmon\n's \"Higher Plane Curves\" or\nLoria\n's \"Spezielle Algebraische und Transcendente Ebene Kurven\nâ\n(\nSpecial Algebraic and Transcendental Plane Curves\n)\n,\" may be readily deduced from the\nWeierstrass\nelliptic functions â and Ï, and that they give a geometric interpretation to the standard formulae of these functions.\nGreenhill\nhas used these functions in connection with the Cartesian oval\n(\nProc. London Math. Soc.,\n1886\n, and also his treatise on \"Elliptic Functions,\"\n)\nand has deduced the relations between the focal radii, though we have give a more symmetric form to these relations by the introduction of the triple focus.\nProfessor\nFrank Morley\npublished a note on the subject some years ago in the Haverford Studies.\n(\nSee also Harkness and\nMorley\n, \"Treatise on the Theory of Functions.\"\n)\nWhen theÂ u-plane is mapped to theÂ x-plane by means of the equation\nÂ Â Â Â Â Â Â Â Â Â\nd\nu\n=\nd\nx\nâ\nQ\ndu = \\large\\frac{dx}{âQ}\\normalsize\nd\nu\n=\nâ\nQ\nd\nx\nâ\n,\nwhereÂ QÂ is a quartic inÂ x, to lines in theÂ u-plane parallel to the real or imaginary axis, correspond in theÂ x-plane bicircular quartics whose real foci are the zeros ofÂ Q, provided these zeros are concylic or anticyclic.\n(\nGreenhill\n, Camb. Phil. Proc.;\nFabian Franklin\n, American Journal of Mathematics, Vol XI and Vol XII.\n)\nThe problem of reducing this form to the\nWeierstrass\nform which we use, where one focus is at infinity, is analogous to the reduction of the bicircular quartic to the Cartesian.\n(\nSalmon\n, \"Higher Plane Curves.\"\n)\nOn being awarded her Ph.D. in\n1911\n, Clara Bacon became the first woman to be awarded a doctorate in mathematics from Johns Hopkins University.\nChristine Ladd-Franklin\nhad completed her doctoral thesis at Johns Hopkins and published it in\n1883\nbut although she had published several papers in the\nAmerican Journal of Mathematics\nwhile she undertook research, she was not awarded a Ph.D. because she was a woman, and only in\n1926\ndid Johns Hopkins award her the degree.\nBacon was promoted to professor at Goucher College in\n1914\nand continued to teach there until she retired in\n1934\n. She was very highly regarded as a teacher and for her concern for her students, whether they were highly talented or were less able. For example, a student wrote\n[\n10\n]\n:-\nMiss Clara Bacon was one of the best teachers I ever had in the clearness with which she presented mathematics, her understanding of the student's point of view, and her patience. I do not know adequate superlative adjectives to express the wonderful spirit she embodied.\nAnother student wrote\n[\n10\n]\n:-\nShe believed in us so simply and so deeply that we could not disappoint her. When she felt that circumstances prevented us from doing all she hoped, she tried to change the circumstances. It was her support that made graduate study possible for me. Her patience and understanding as a teacher opened up the beauty of mathematics. For many years her faith in all of us made life seem so good.\nYou can read more about how she was appreciated by students and colleagues in the  extracts from\n[\n9\n]\n, written by\nMarguerite Lehr\nfollowing Bacon's retirement, and from the obituary\n[\n10\n]\nwritten by Florence P Lewis, at\nTHIS LINK\n.\nOne of Bacon's favourite ways to relax was to travel with her sister Agnes with whom she lived until Agnes's death in\n1929\n. For example in the summer of\n1926\nthey were in Bermuda, returning from Hamilton, Bermuda to New York on the\nSS Fort St George\nin September of that year. After Clara retired in\n1934\nshe set out on a fifteen month trip in June\n1934\n, travelling first to England then going to Scotland, Italy, Egypt, and Palestine before returning to Baltimore in October\n1935\nsailing from Hamburg, Germany, to Baltimore on the\nSS City of Norfolk\n. You can read her own description of the first six months of her travels at\nTHIS LINK\n.\nThis was not her last travelling abroad, for in the summer of\n1936\nshe was in Mexico, returning in July from Vera Cruz to New York on the\nSS Yucatan\n.\nBacon continued to live at\n2316\nCalvert Street with her servant Ida Lindsay, who was far more than a servant, being also a companion and friend. She continued to live there after she become ill in\n1947\n, and died in her home in April\n1948\n. Her funeral service was held in the First Methodist Church, which was near her house on Calvert Street, and she was buried in Cherry Grove Cemetery near Abingdon, Illinois. In\n1958\nGoucher College renamed North House, \"Bacon House\" in her honour. There is also a Clara and Agnes Bacon endowed scholarship at Goucher.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}