{
  "nome_completo": "Colin Maclaurin",
  "nome_curto": "Colin Maclaurin",
  "ano_nascimento": "1698",
  "ano_morte": "1746",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maclaurin/",
  "lugar_nascimento": "Kilmodan (12 km N of Tighnabruaich), Cowal, Argyllshire, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Colin Maclaurin\nwas born in Kilmodan where his father, John Maclaurin, was the minister of the parish. The village\n(\npopulation\n387\nin\n1904)\nis on the river Ruel and the church is at Glendaruel.\nYou can see more about Kilmodan Church at\nTHIS LINK\n.\nJohn Maclaurin was more of a scholar than one would expect of a parish minister, for he had translated the Psalms into Gaelic. He had three sons. John, the eldest, following in his father's steps, became a minister; he was a public spirited man of profound learning, and corresponded with Jonathan Edwards, the American metaphysician. The second son, Daniel, died young after having given signs of extraordinary genius. Colin was the youngest. His father died when Colin was six weeks old. Colin Maclaurin's mother inherited a small estate in Argyllshire and it was on the estate that Colin spent the early years of his life. His mother wanted a good education for Colin and his brother John, so the family moved to Dumbarton where the boys attended school.\nIn\n1707\n, when Colin was nine years old, his mother died so the task of bringing up Colin and his brother John fell to their uncle Daniel Maclaurin who was the minister at Kilfinan on Loch Fyne.\nYou can see more about Kilfinan Church at\nTHIS LINK\n.\nColin became a student at the University of Glasgow in\n1709\nat the age of eleven years. He was one of around\n400\nstudents. This may seem an unbelievable age for someone to begin their university education, but it was not so amazing at this time as it would be today. Basically Scottish schools and universities competed for the best pupils at that time, rather than a university education being seen as following a school education as is the norm today.\nCertainly Maclaurin's abilities soon began to show at Glasgow University. His first encounter with advanced mathematics came one year after he entered university, when he found a copy of\nEuclid\n's\nElements\nin one of his friend's rooms. This was the standard text for mathematical study at this time, but Maclaurin studied it on his own, quickly mastering the first six of the thirteen books of the\nElements\n. At Glasgow Maclaurin came into contact with\nRobert Simson\nwho was the Professor of Mathematics there. Simson was particularly interested in the geometry of ancient Greece and his enthusiasm for the topic was to influence the young student Maclaurin. Tweddle in\n[\n23\n]\nlooks at the correspondence between\nSimson\nand Maclaurin on\nconic sections\n25\nyears after Maclaurin's student days at Glasgow.\nAt the age of\n14\nMaclaurin was awarded the degree of M.A. after studying Latin, Greek, Logic, Moral Philosophy, Natural Philosophy and Mathematics. Although a master's degree in name, this was a first degree equivalent to a B.A. but the ancient Scottish universities\n(\nincluding St Andrews, my\n[\nEFR\n]\nown university\n)\nstill retain the degree of M.A. as the first degree in Arts. However, Maclaurin had to defend a thesis in a public examination for the award of this degree\n(\nwhich is not the case today\n)\n, and he chose\nOn the power of gravity\nas his topic. The thesis, which developed\nNewton\n's theories, was written by a\n14\nyear old boy at a time when such advanced ideas would only be familiar to a small number of the leading mathematicians.\nAfter graduating with the degree of M.A., Maclaurin remained at the University of Glasgow for a further year to study divinity. It had been his intention to enter the Presbyterian Church but\n[\n7\n]\n:-\n... becoming disgusted at the dissensions that had at that time crept into the church ...\nhe decided against that career.\nAfter leaving Glasgow in\n1714\n, Maclaurin returned to live with his uncle in the manse at Kilfinan. These were happy years for Maclaurin who studied hard and walked in the nearby hills and mountains for recreation. Unfinished scraps in his notebooks reveal the sensitivity of his nature as he would sometimes break out into poetic rhapsody on the beauties of the scene and the perfections of its Author. He clearly attained a very high standard in mathematics for, in August\n1717\n, he was appointed professor of mathematics at Marischal College in the University of Aberdeen at the age of only\n19\n. The appointment followed ten days of examinations to find the best candidate and it is clear that, despite there being another outstanding candidate, Maclaurin had the most knowledge of advanced topics.\nYou can see a report of the examinations at\nTHIS LINK\nand you can see a picture of Marischal College at\nTHIS LINK\n.\nMaclaurin was to make two journeys to London, and the first of these he made in\n1719\n. Maclaurin had already shown himself a very strong advocate of the mathematical and physical ideas of\nNewton\n, so it was natural that they should meet during Maclaurin's visit to London. It is surprising that some of\nNewton\n's biographers, for example A Rupert Hall in his\n1992\nbiography, should declare that Maclaurin and\nNewton\nnever met. Maclaurin writing of this visit to London in one of his letters\n(\nsee for example letter\n117\nin\n[\n3\n]\n)\nstates:-\nI received the greatest civility from\n[\nmembers of the\nRoyal Society\n]\nand particularly from the great\nSir Isaac Newton\nwith whom I was very often.\nMaclaurin received more than civility from the\nRoyal Society\n, for he was elected a Fellow of the\nRoyal Society\nduring this visit to London.\nA rather strange event in Maclaurin's career took place during the time he held the chair of mathematics at Aberdeen. Lord Polwarth was a diplomatic agent of King George II. At this time it was customary for the sons of the top people to make a grand tour of Europe as part of finishing their education. Polwarth invited Maclaurin to accompany his son George Hume\n(\nor Home\n)\n(1704\n-\n1724)\non such a grand tour and, it is not too surprising that Maclaurin accepted this chance to travel and meet with French mathematicians. What is surprising is that he does not appear to have sought the necessary permission of the university authorities in Aberdeen, although he does appear to have found someone to do his teaching.\nTurnbull\nwrites however in\n[\n5\n]\n:-\n... one wonders what was happening to his unshepherded classes in Marischal College. Had he forgotten all about them; did he turn a deaf ear to all calls to return; was there something in him, akin to the impenetrable aloofness of\nNewton\n, which shut him off from his fellows and his duties at times of mental creativity.\nIt was not a short tour, for Maclaurin spent two years travelling with Polwarth's son . It was an episode which was to end tragically, for while they were visiting Montpellier, Polwarth's son became ill and died. Maclaurin returned to Aberdeen to discover that the University was most certainly highly displeased that he had not been undertaking his duties for two years. It was certainly not the case that Maclaurin had been idle during his time away, for, while in France, he had been awarded a Grand Prize by the\nAcadémie des Sciences\nfor his work on the impact of bodies.\nDespite being reinstated to his chair by the University of Aberdeen, Maclaurin sought a position in the University of Edinburgh. James Gregory, not the famous mathematician of that name but rather the lesser known James Gregory\n(1666\n-\n1742)\nwho was a brother of\nDavid Gregory\n, held the chair of mathematics at Edinburgh but had become too ill to carry out the work. The University of Edinburgh sought to appoint someone to a joint professorship with James Gregory and, on\n21\nAugust\n1725\n,\nNewton\nwrote to Maclaurin offering his support in recommending him for appointment to the post\n(\nsee\n[\n1\n]\n, or\n[\n7\n]\nor letter\n122\nof\n[\n3\n]\n)\n:-\nI am very glad to hear that you have the prospect of being joined with Mr James Gregory in the Professorship of Mathematics at Edinburgh, not only because you are my friend, but principally because of your abilities, you being acquainted as well with the improvements of Mathematics as with the former state of those sciences. I heartily wish you good success, and shall be very glad to hear of your being elected.\nIn November\n1725\nNewton\nwrote to John Campbell, the lord provost of Edinburgh, supporting Maclaurin's appointment\n(\nsee\n[\n1\n]\n, or\n[\n7\n]\n)\n:-\nI am glad to understand that Mr Maclaurin is in good repute amongst you, for I think he deserves it very well: And to satisfy you that I do not flatter him, and also to encourage him to accept the place of assisting Mr Gregory, in order to succeed him, I am ready\n(\nif you will please give me leave\n)\nto contribute twenty pounds per annum towards a provision for him till Mr Gregory's place becomes void, if I live so long.\nThere is no evidence to suggest that Edinburgh took\nNewton\nup on his offer to contribute to Maclaurin's salary. Maclaurin began his appointment to the University of Edinburgh on\n3\nNovember\n1725\n. He  became a popular teacher with a class  of over\n100\nstudents, though he did not receive a full salary until\n1742\n, four years before his death. The Church of Scotland leader Alexander Carlyle\n(1722\n-\n1805)\nwrote in his autobiography:-\nMaclaurin was at this time a favourite professor, and no wonder, as he was the clearest and most agreeable lecturer on that abstract science that ever I heard. He made mathematics a fashionable study ...\nMaclaurin was to spend the rest of his career in Edinburgh. On\n8\nth July\n1733\nhe married Anne Stewart, who was the daughter of the Solicitor General for Scotland. They were to have seven children but, as was common at that time, not all reached adulthood. Of the seven children, two boys and three girls survived him. Not long after his marriage, Maclaurin worked to expand the Medical Society of Edinburgh into a wider society to include other branches of learning. Maclaurin himself acted as one of the two secretaries of this expanded Society and at the monthly meetings he often read a paper of his own or a letter from a foreign scientist on the latest developments in some topic of current interest. This Society would, after Maclaurin's death, become the\nRoyal Society of Edinburgh\n.\nMaclaurin did notable work in geometry, particularly studying higher plane curves. In fact his first important work was\nGeometria Organica; Sive Descriptio Linearum Curvarum Universalis\nⓉ\n(\nOrganic Geometry, with the Description of the Universal Linear Curves\n)\npublished in\n1720\nwhile he was at the University of Aberdeen. In\n1740\nhe was awarded a second prize from the\nAcadémie des Sciences\nin Paris, this time for a study of the tides\nDe Causa Physica Fluxus et Reflexus Maris\nⓉ\n(\nThe physics of the ebb and flow of the sea\n)\n. He used\nNewton\n's theory of gravity to show that a smooth sphere covered by a sufficiently deep ocean under the tidal force of a single deforming body is a prolate spheroid with major axis directed toward the deforming body. This prize was jointly awarded to Maclaurin,\nEuler\nand\nDaniel Bernoulli\n, bracketing Maclaurin with the top two mathematicians of his day.\nIn\n1742\nMaclaurin published his\n2\nvolume\nTreatise of fluxions\n, the first systematic exposition of\nNewton\n's methods written as a reply to\nBerkeley\n's attack on the calculus for its lack of rigorous foundations. Maclaurin wrote in the introduction\n(\nsee for example\n[\n1\n]\n)\n:-\n[\nBerkeley\n]\nrepresented the method of fluxions as founded on false reasoning, and full of mysteries. His objections seemed to have been occasioned by the concise manner in which the elements of this method have been usually described, and their having been so much misunderstood by a person of his abilities appeared to me to be sufficient proof that a fuller account of the grounds of this was required.\nYou can see the Preface to\nTreatise of fluxions\nat\nTHIS LINK\n.\nThe\nTreatise of fluxions\nis a major work of\n763\npages, much praised by those who read it but usually described as having little influence. The article\n[\n10\n]\n, however, argues convincingly that Maclaurin's influence on the Continentals has been underrated. Grabiner gives five areas of influence of Maclaurin's treatise: his treatment of the fundamental theorem of the calculus; his work on maxima and minima; the attraction of ellipsoids;\nelliptic integrals\n; and the\nEuler\n-Maclaurin summation formula.\nMaclaurin appealed to the geometrical methods of the ancient Greeks and to\nArchimedes\n'\nmethod of exhaustion\nin attempting to put\nNewton\n's calculus on a rigorous footing. It is in the\nTreatise of fluxions\nthat Maclaurin uses the special case of\nTaylor series\nnow named after him and for which he is undoubtedly best remembered today. The Maclaurin series was not an idea discovered independently of the more general result of\nTaylor\nfor Maclaurin acknowledges\nTaylor\n's contribution. Another important result given by Maclaurin, which has not been named after him or any other mathematician, is the important integral test for the convergence of an infinite series. The\nTreatise of fluxions\nis not simply a work designed to put the calculus on a rigorous basis, for Maclaurin gave many applications of calculus in the work. For example he investigates the mutual attraction of two ellipsoids of revolution as an application of the methods he gives.\nOther topics which Maclaurin wrote on were the\nannular eclipse\nof the sun in\n1737\nand the structure of bees' honeycombs. He also contributed to actuarial studies as one of the founders of the topic and\n[\n5\n]\n:-\nHe laid sound actuarial foundations for the insurance society that has ever since helped the widows and children of Scottish ministers and professors.\nMaclaurin wrote to the Reverend Robert Wallace, Moderator of the General Assembly of the Church of Scotland on May\n23\n,\n1743\n:-\nAs you was pleased to mention my opinion concerning the scheme for providing an annuity to ministers widows and a stock for their children, in the committee of the general Assembly, I therefore thought it my duty to go over those computations again with care and lay the result fully before you to prevent mistakes of any kind.\nMaclaurin did become involved in controversy with other mathematicians over a number of results. Two are well documented, one being with\nWilliam Braikenridge\n(\nsee our biography of\nBraikenridge\nin this archive, and also\n[\n16\n]\n)\non the argument over the result:-\n... if the sides of a polygon pass through fixed points and all but one of the vertices lie on fixed lines, then the remaining vertices describe a conic section or a straight line.\nIn\n[\n17\n]\nthe controversy between Maclaurin and George Campbell over complex roots is described. Again the argument, which Maclaurin calls \"a disagreeable dispute\", was about priority. See also\n[\n27\n]\n.\nWe should not only comment on Maclaurin's mathematical research, however, but also on his qualities as a teacher. His teaching at the University of Edinburgh came in for considerable praise\n[\n7\n]\n:-\n... such was his anxiety for the improvement of his scholars that if at any time they seemed not fully to comprehend his meaning, or if, upon examining them, he found they could not readily demonstrate the propositions from which he had provided, he was apt rather to suspect his own explanation to have been obscure, than their want of genius or attention, and therefore would resume the demonstration in some other method, to try if, by exposing it in a different light, he would give then a better view of it.\nMaclaurin played an active role in the defence of Edinburgh during the Jacobite rebellion of\n1745\n. As the Jacobite army marched towards Edinburgh in September\n1745\n, Maclaurin worked endlessly in attempting to prepare the defences of the city. He described the events\n(\nsee for example letter\n100\nof\n[\n3\n]\n)\n:-\nThe care of the walls was recommended to me, in which I laboured night and day under infinite discouragements from superior powers. When I was promised hundreds of workers I could hardly get dozens. This was daily complained of, redress was promised but till the last two days no redress was made, and then it was too late.\nThe Jacobite army reached Edinburgh on\n15\nSeptember\n1745\nand, after negotiations had failed, the gates of the city were opened. The castle held out. Maclaurin fled to England and while in Newcastle he received an invitation from the Archbishop of York to be his guest in York. There he:-\n... lived for some time as happy as was possible for a man who had left his country in such a situation and his family in it behind him.\nWhen the Jacobite army marched south from Edinburgh, Maclaurin returned to the city in November\n1745\n. However, he was weakened by his exertions in preparing the defences of Edinburgh, by the difficult journeys to and from York, by the cold winter weather, and by a fall from his horse. On\n26\nDecember\n1745\nhe wrote:-\nI have not been\n[\nout\n]\nsince December\n3\n. My illness seemed dangerous, the physicians call it an obstruction in the reins\n[\nkidneys\n]\nfrom the severe cold in travelling November\n14\n,\n15\nand\n16\n. I had a swelling about my stomach.\nHe died the following year in Edinburgh and was buried in Greyfriars Church where his grave can still be seen at the south-west corner.\nMany wrote of Maclaurin's outstanding kindness. He was described as\n[\n7\n]\n:-\n... kindly and approachable ...\nand it was said that the help he gave to his students:-\n... was never wanting; nor was admittance refused to any except in his teaching hours.\nHis friendship was exceedingly highly valued:-\nHis acquaintance and friendship were ... centred by the ingenious of all ranks; who by their fondness for his company, took up a great deal of his time, and left him not master of it, even in his country retreat.\nMaclaurin's\nTreatise on algebra\nwas published in\n1748\n, two years after his death. Another work\nAccount of Sir Isaac Newton's discoveries\nwas left incomplete on his death but was published in\n1750\n.\nAs mentioned above, Maclaurin is best known for the Maclaurin Series, which is a special case of the\nTaylor\nseries. He is also remembered for the\nEuler-Maclaurin Summation Formula\nand for the Maclaurin-\nCauchy\nIntegral Test for Convergence which Maclaurin discovered\n50\nyears before\nCauchy\nwas born. Maclaurin was the first to discover\nCramer\n's Paradox on the intersection of curves.\nOne of his papers remained unpublished until\n1996\nwhen Grabiner published\n[\n11\n]\n. In this work Maclaurin considers the geometric problem of finding the difference between the volume of the frustum of a solid of revolution which is generated by a conic section and the volume of the cylinder of the same height as the frustum having diameter equal to that of the frustum at the midpoint of its height.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}