{
  "nome_completo": "Conon of Samos",
  "nome_curto": "Conon",
  "ano_nascimento": "280 BC",
  "ano_morte": "220 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Conon/",
  "lugar_nascimento": "Samos, Greece",
  "lugar_morte": "(possibly) Alexandria, Egypt",
  "biografia": "Conon of Samos\nis said to have served as court astronomer to Ptolemy III\n(\nalso known as Ptolemy Euergetes\n)\nin Alexandria, see for example\n[\n1\n]\nand\n[\n2\n]\n. However,\nNeugebauer\n[\n5\n]\nclaims that:-\nIt is only a modern invention to make Conon a 'court astronomer'; no such rank existed in Ptolemaic Egypt...\nConon is remembered particularly for Callimachus's poem\nBerenice's Lock\nabout the constellation Coma Berenices. It may be as a result of this poem that Conon is well known to\nVirgil\nand\nPropertius\n.\nThe story of the constellation Coma Berenices is that Queen Berenice II, the wife of Ptolemy Euergetes, swore a vow that she would dedicate a lock of her hair to the temple if her husband returned victorious from the Third Syrian War. The war was fought by Ptolemy Euergetes to avenge the murder of his sister in Syria. When he returned victorious in\n245\nBC, Berenice cut off the lock of her hair and placed it in the temple. The following day the lock of hair had vanished and Conon declared that he could see it in the stars between Virgo, Leo and Bootes. From that time on the constellation has been known as Coma Berenices.\nConon was a lifelong friend of\nArchimedes\nand the two exchanged mathematical ideas.\nHeath\nwrites\n[\n4\n]\n:-\nIt was probably at Alexandria that\n[\nArchimedes\n]\nmade the acquaintance of Conon of Samos\n(\nfor whom he had the highest regard both as a mathematician and a friend\n)\n.\nPappus\nstates that the curve now known as the spiral of\nArchimedes\nwas discovered by Conon although it was much used by\nArchimedes\n.\nHeath\nwrites in\n[\n4\n]\nthat Conon was :-\n... cited as the propounder of a theorem about the spiral in a plane which\nArchimedes\nproved: this would, however, seem to be a mistake, as\nArchimedes\nsays at the beginning of his treatise that he sent certain theorems, without proofs, to Conon, who would certainly have proved them had he lived.\nConon's work on\nconic sections\nbecame a basis for the fourth book of\nConics\nof\nApollonius\nof Perga despite the fact that\nApollonius\nmakes less than admiring remarks about Conon in the preface.\nApollonius\nsays that Conon sent a piece of work to Thrasydaeus which discussed the points of intersection of conics\n(\nincluding circles\n)\nbut that Conon's results were incorrect and were seen to be so by Nicoteles of Cyrene. The work to which\nApollonius\nrefers is Conon's\nPros Thrasydaion\nwhich is now lost so we cannot judge the accuracy of the comments.\nAlso lost is Conon's major work on astronomy, the seven books of\nDe astrologia\n, which included solar eclipse observations.\nPtolemy\nattributes seventeen \"signs of the seasons\" to Conon which he may have given in this work. As to Conon's skills as an observer, Seneca, writing in the first century AD, says\n[\n5\n]\n:-\n... that Conon was a careful observer and that he \"recorded solar eclipses observed by the Egyptians\".\nBut\nNeugebauer\n[\n5\n]\nadds that this is:-\n... a story difficult to take seriously in view of what we know of Egyptian astronomy.\nFor discussion on Conon's work with Babylonian observations, see the article\n[\n3\n]\n.\nAnother assessment of Conon came in poetic fashion from\nCatullus\n, the Roman poet\n(84\nBC -\n54\nBC\n)\n, who wrote that Conon\n(\nsee for example\n[\n1\n]\n)\n:-\n... discerned all the lights of the vast universe, and disclosed the risings and settings of the stars, how the fiery brightness of the sun is darkened, and how the stars retreat at fixed times.",
  "math_areas": []
}