{
  "nome_completo": "Constantin Marie Michel Hubert Jérôme Le Paige",
  "nome_curto": "Constantin Le Paige",
  "ano_nascimento": "1852",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Paige/",
  "lugar_nascimento": "Liège, Belgium",
  "lugar_morte": "Liège, Belgium",
  "biografia": "Constantin Le Paige\n's parents were Constantin Marie Le Paige and Jeanne Jacques. His education was first at Spa, about\n25\nkm south east of Liège, where he attended the François de Sclessin Foundation run by the Jesuits and the continued his education at the Middle School in Spa. His school education was completed at Liège where he attended the Athénée Royal de Liège, graduating on\n11\nSeptember\n1869\n. The professor of Higher Mathematics at the Athénée Royal de Liège was V Falisse and his mathematics course had a large impact on Le Paige. He entered the University of Liège to study mathematics in\n1869\nwhere he attended lectures by Falisse, who taught at the university as well as the Athénée Royal, and by\nEugène-Charles Catalan\n. Le Paige undertook research for his doctorate in mathematics advised by\nFrançois Folie\n, whose interests were mainly in descriptive geometry but also in astronomy, and he was also influenced by\nCatalan\n.\nFolie\nwas Inspector-Director of the University of Liège from\n1872\nto\n1884\nand it was during his time in this administrative role that many of the Science and Medical buildings of the University of Liège were erected. During the years he studied at the university Le Paige won several prizes for his work. In particular he was awarded the special prize for mathematics, awarded to students who, after completing their humanities, follow science courses. In the academic year\n1873\n-\n74\nhe took part in a number of academic competitions, and was given an honourable mention for the memoir he submitted on the gyroscope. The winning memoir was submitted by Junius Massau.\nAfter submitting his doctoral thesis\nQuelques applications de la théorie des formes algébriques à la géométrie\nⓉ\n(\nSome applications of the theory of algebraic geometry shapes\n)\n, Le Paige was given an oral examination and graduated on\n28\nJuly\n1875\n. After graduation, he was appointed as a lecturer at the University of Liège on\n10\nOctober\n1876\n. It is a clear indication of his remarkable productivity that nine of his papers were published in\n1876\nand ten were published in the following year. Some of these papers were on topics he had worked on before he settled on geometry as his main interest, for example there are papers on continued fractions, differential equations, the difference calculus, and\nBernoulli numbers\n. Beginning in the year he was appointed to the University, he taught courses on 'Elements of the theory of\ndeterminants\n', which is not surprising since this was\nCatalan\n's speciality, and he also taught a 'Higher analysis' course. He taught the course on the theory of determinants throughout his\n46\n-year career. He began teaching geometry courses in\n1879\n, taking over courses that had previously been taught by his research advisor\nFrançois Folie\n. He was appointed as an extraordinary professor at the University of Liège in\n1882\n, promoted to full professor three years later, and remained there for the whole of his career, retiring in\n1922\n. He was Rector of the University from\n1895\nto\n1898\n, and administrateur-inspecteur from\n1905\nto\n1922\n. He was Director of the Institute Astrophysique de Cointe-Sclession, annexed to the University of Liège, from\n1897\nto\n1922\n. After\nCatalan\nretired in\n1884\n, Le Paige took over teaching his probability theory course. Around the same time\nFrançois Folie\nleft Liège to become the director of the Royal Observatory, Uccle, Brussels, leading to a considerable increase in Le Paige's teaching and administrative duties. During the\n1890\ns he began teaching courses on 'Celestial mechanics and analytical mechanics', the 'Elements of astronomy and geodesy', the 'History of mathematical and physical science', and 'Physical astronomy'. He continuing to teach all these courses until he retired. Another of his colleagues at the University of Liège was\nJoseph Neuberg\nwho, although about twelve years older than Le Paige, had been appointed as a professor at Liège within a couple of years of Le Paige.\nNeuberg\nretired in\n1910\nand again Le Paige took over certain additional responsibilities.\nLe Paige married Marie Joséphine Ernst. They had a son Ubric Le Paige who married Teresa De Walque. Ubric and Teresa had eleven sons, including Father Gustave Le Paige De Walque\n(1903\n-\n1980)\nwho was Director of the Museo Arqueológico de la Universidad del Norte in San Pedro de Atacama. We mentioned above that Le Paige was administrateur-inspecteur of the University of Liège from\n1905\nto\n1922\n. This period, of course, contained the extremely difficult years of World War I when, between\n1914\nand\n1918\n, much of Belgium was occupied by German troops. Although Belgium declared itself neutral in\n1914\n, after it refused passage to German troops to cross its lands to attack France, the country was invaded in August\n1914\n. The Germans took control of Liège and made demands of the University that Le Paige was largely able to resist. After the end of the war his dedication to duty helped the university to return quickly to its former activities.\nThere was a tradition of geometry at the University of Liège which created the background to Le Paige's early research.\nGerminal Dandelin\nwas professor of mining engineering at Liège from\n1825\nto\n1830\nand during that time he taught analytic geometry. It was\nJean-Baptiste Brasseur\nwho learnt geometry from\nDandelin\nat this time and he, in turn, taught course on Higher Geometry in which he outlined the theory of algebraic curves and surfaces. François Folie was\nBrasseur\n's student and he took over teaching the Higher Geometry course in\n1876\n. Of course, as we have indicated above, Le Paige was Folie's student and he took over teaching the course when Folie left Liège. Folie's approach to geometry was a purely geometrical one, but Le Paige approached the topic in a much more algebraic way, following the fashion that was beginning to take over the subject. He worked on the theory of algebraic forms, a topic whose study was initiated by\nGeorge Boole\nin\n1841\nand then developed by\nArthur Cayley\n,\nJames Joseph Sylvester\n,\nCharles Hermite\n,\nAlfred Clebsch\nand\nSiegfried Aronhold\n. In particular Le Paige studied the geometry of algebraic curves and surfaces, building on this earlier work. H L L Busard writes\n[\n1\n]\n:-\nLe Paige's investigations touched mainly upon the geometry of algebraic curves and surfaces, and the theory of invariants and involutions. He coordinated and generalized the extensions which at that time had been tried. His best-known achievement was the construction of a cubic surface given by nineteen points. Starting from the construction of a cubic surface given by a straight line, three groups of three points on a line, and six other points, Le Paige comes to the construction of a cubic surface given by three lines and seven points. From this he proceeds to the construction of a cubic surface given by a line, three points on a line, and twelve other points, and by means of the construction of a cubic surface given by three points on a line and sixteen other points, he arrives at a surface given by nineteen points.\nLe Paige studied the generation of plane cubic and quartic curves, developing further\nChasles\n's work on plane algebraic curves and\nSteiner\n's results on the intersection of two projective pencils. The history of mathematics was another topic which interested Le Paige. His most significant work in this area was his publication of\nde Sluze\n's correspondence with\nPascal\n,\nHuygens\n, Oldenburg and\nWallis\n. Other topics in this area which interested him were the history of mathematical notation, and the history of astronomy, particularly Belgium astronomy. Here is a list of the main historical papers he wrote:\nCorrespondance de René-François de Sluse, publiée pour la première fois et précédée d'une introduction\nⓉ\n(\nCorrespondence of R-F de Sluse, published for the first time and with an introduction\n)\n(1884)\n;\nUn géomètre belge du XVIIe siècle: René-François de Sluse\nⓉ\n(\nA Belgian mathematician of the seventeenth century: R-F de Sluse\n)\n(1887)\n;\nLettre de M le Paige à M G Longchamps\n(\nrelative au géomètre montois J-F Lepoivre\n)\nⓉ\n(\nLetter from  Paige to G Longchamps\n(\non the surveyor J-FLepoivre of Mons\n)\n)\n(1887)\n;\nUn astronome belge du XVIIe siècle: Godefroid Wendelin\nⓉ\n(\nA Belgian astronomer of the seventeenth century: Godefroid Wendelin\n)\n(1891)\n;\nNotes pour servir à l'Histoire des Mathématiques dans l'ancien Pays de Liège\nⓉ\n(\nNotes for use in the history of mathematics in the region of Liege\n)\n(1890)\n;\nSur l'origine de certains signes d'opération\nⓉ\n(\nOn the origin of some operation signs\n)\n(1891\n-\n1892)\n;\nSur les notations algébriques avant Descartes\nⓉ\n(\nOn algebraic notation before Descartes\n)\n(1895\n-\n1896)\n;\nDiscours sur l'astronomie des Grecs\nⓉ\n(\nLecture on the astronomy of the Greeks\n)\n(1895)\n; and\nDiscours sur l'astronomie au temps de Kepler\nⓉ\n(\nLecture on astronomy in the time of Kepler\n)\n(1896)\n.\nAfter Le Paige was appointed director of the Astrophysical Institute, he wrote a number of astronomical texts. For example, in the year of his appointment,\n1897\n, he published:\nDe l'action du Soleil sur les plaques photographiques\nⓉ\n(\nOn the effect of the sun on photographic plates\n)\n;\nSur la photographie de l'atmosphère\n(\nsuite à une note de M De Heen\n)\nⓉ\n(\nIn the photograph of the atmosphere\n(\nfollowing a note from De Heen\n)\n)\n;\nSur la photographie du Soleil\nⓉ\n(\nOn photography of the Sun\n)\n; and\nDiscours sur l'astronomie moderne\nⓉ\n(\nLecture on modern astronomy\n)\n. Let us note some of his students who went on to outstanding academic careers: Jacques Deruyts, François Deruyts, Marcel Dehalu, and Henry Janne.\nLe Paige received many honours. He was elected a corresponding member of the\nRoyal Belgium Academy of Sciences\non\n15\nDecember\n1885\n, becoming a full member on to the\n15\nDecember\n1890\n. In\n1907\nhe became Director of the Sciences Class of the Academy. He was elected to the Royal Society of Sciences of Liège in\n1878\n, becoming its Secretary General in\n1886\n. He was elected to the Royal Society of Bohemia in\n1881\n, and in the same year became a foreign corresponding member of the\nAccademia Pontificia dei Nuovi Lincei\nin Rome. He was elected to the Royal Academy of Sciences of Lisbon in\n1883\nand, in the same year, to the\nLeopoldino-Carolina Naturae Curiosorum Academia\nin Halle. He became an honorary member of the Mathematical Society of Amsterdam in\n1886\n.\nFinally, we note Le Paige's love of collecting old books. In\n[\n2\n]\nthe sale of Le Paige's collection by Joseph Baer and Co. of Frankfurt-am-Main on\n26\nMay\n1933\n, four years after his death, was announced. The firm:-\n... will sell the collection of the well-known bibliophile, le Chevalier Constantin Le Paige, of Liège, consisting of incunabula, antique manuscripts, valuable illustrated books, French literature, as, for example, first editions of Balzac, Bossuet, Corneille,\nPascal\n, Rousseau, Voltaire; also mathematical and astronomical rarities, the commentary of Albertus de Brudzewo of\n1494\n, printed in Milan, of which only two examples are known, the \"Opus calculationum\" of Suiseth\n(\nPadua of about\n1477)\nand the first edition of\nBoethius\n\"Arithmetica.\" The chief attraction is Dante's manuscript of\n1493\n, which resembles the books written in Naples for King Matthias Corvinus. A great rarity is the French translation of the \"Hortus sanitatis,\" which appeared in Paris in\n1500\n. The \"Divisie Chronijk\" of\n1517\nis celebrated for its wood-cuts by Lucas van Leyden, and a \"Livre d'Heures\" of\n1513\nis printed on parchment and illustrated with coloured wood engravings. The sale contains also rare books on art and science, music books, geographical works, etc.",
  "math_areas": [
    "Geometry",
    "Statistics"
  ]
}