{
  "nome_completo": "Cuthbert Tunstall",
  "nome_curto": "Cuthbert Tunstall",
  "ano_nascimento": "1474",
  "ano_morte": "1559",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tunstall/",
  "lugar_nascimento": "Hackforth, Yorkshire, England",
  "lugar_morte": "Lambeth, London, England",
  "biografia": "Cuthbert Tunstall\n's father was Thomas Tunstal whose first wife was Alice Neville, but she was not Cuthbert's mother. His mother was a daughter of Sir John Conyers of Hornby Castle which is in Hackforth, Yorkshire. At the time of Cuthbert's birth his parents were not married and it appears that, when he was young, he was sent to work as a kitchen boy in the household of Sir Thomas Holland. After working in that role for two years, by which time his parents had married, Cuthbert returned to live with his father who had provided a good education for his son.\nCuthbert was educated at Balliol College, Oxford, which he entered in\n1491\n, but it is recorded that left because of the plague. If this is correct then he must have left in\n1493\nsince certainly the plague struck Oxford in that year. We also know that he entered King's Hall, Cambridge in\n1496\n. The fact that there are three missing years here must leave some doubt about the veracity of the story that he left Oxford at the time of plague. Some\n50\nyears later King's Hall became part of Trinity College when it was founded by Henry VIII. Although the length of Cuthbert's time in Oxford is in some doubt, there is no doubt in the fact that he left both Oxford and Cambridge without taking a degree.\nBetween\n1499\nand\n1505\nTunstall studied Canon and Roman law at Padua. Certainly here he gained two degrees and achieved an outstanding reputation as a scholar of great proficiency in Greek, Latin, and mathematics. Near the end of his time in Italy, in\n1505\n, Tunstall visited Rome. On his return to England he entered the Church, obtaining the parish of Barmston in Yorkshire although at this stage he had not been ordained. He was then rector of a number of different parishes such as Stanhope, Durham in\n1508\n, Aldridge, Staffordshire in\n1509\n, before being ordained subdeacon on\n25\nMarch\n1509\nand deacon on\n7\nApril\n1509\n. He was the rector of Sutton Veny, Wiltshire, followed by Steeple Langford, Wiltshire and then East Peckham, Kent. During his time East Peckham he was ordained a priest in April\n1511\n. Archbishop William Warham had recognised his talents in\n1509\nand arranged a number of positions for Tunstall which brought him to the attention of the court of Henry VIII. He became canon of Lincoln in\n1514\n, archdeacon of Chester in\n1515\n.\nTunstall's association with the court of Henry VIII led to his acting in diplomatic roles and he was part of a delegation negotiating trade treaties with the duke of Burgundy in\n1515\n. He established a reputation as a shrewd and skilful negotiator. Also during his time abroad he struck up a friendship with Erasmus who wrote of him:-\n... besides a knowledge of Latin and Greek second to none among his countrymen, he has also a seasoned judgment and exquisite taste and, more than that, unheard-of modesty and, last but not least, a lively manner which is amusing with no loss of serious worth.\nContinuing his diplomatic role Tunstall was ambassador to the court of Charles V and went with him to Aachen in October\n1520\nwhere he was crowned king of Germany in Aachen, assuming at the same time the title of Roman emperor-elect. In the spring of\n1521\nthe imperial Diet assembled at Worms and Tunstall was again present along with Charles. After returning to England, Tunstall became Bishop of London in\n1522\n. He wrote the first printed work published in England devoted exclusively to mathematics. It was an arithmetic book\nDe arte supputandi libri quattuor\nⓉ\n(\nOn the art of arithmetic, book four\n)\n(1522)\nbased on\nPacioli\n's\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\n. It makes no claim to originality.\nIn\n1525\nhe again acted as an ambassador to Charles V and travelled to Toledo in Spain. He fell ill with dysentery and returned to England in January\n1526\n. In the following year he was sent on a diplomatic mission to France. He was appointed Bishop of Durham in\n1530\n. Easton writes in\n[\n1\n]\n:-\nAlthough of strong religious convictions, he was humane and moderate, and was respected even by his opponents in matters of religion. While remaining faithful to the Roman Catholic dogma, he was aware that reform was needed. He would protest decisions of Henry VIII\n(\nwho often kept him away from London when unpopular decisions were to be made\n)\n, but once they had been made he would submit.\nTunstall also has the distinction of having the Grynaeus's edition of\n1533\n, being the first printed edition, of\nEuclid\n's\nElements\nin Greek dedicated to him:-\n... since he had explained the calculating of numbers in such an excellent manner.\nIn\n1537\n-\n38\nhe served as president of the Council of the North. He officiated at the coronation of Edward VI in February\n1547\n, but his relations with the government became increasingly difficult. A conservative during the Reformation he was imprisoned in\n1550\non a charge of treason. At first imprisonment consisted of house arrest, but later he was put in the Tower of London. He was convicted of felony and deprived of his bishopric in\n1552\n. Reinstated the following year by Mary Tudor, Tunstall was deprived again in\n1559\nafter refusing to swear the oath of supremacy under Elizabeth.\nIn\n[\n3\n]\nNewcombe sums up as follows:-\nA gentle man given to collecting coins and gardening, he was probably the most widely respected bishop and scholar in sixteenth-century England.",
  "math_areas": []
}