{
  "nome_completo": "Albert Cyril Offord",
  "nome_curto": "Cyril Offord",
  "ano_nascimento": "1906",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Offord/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Cyril Offord\n's parents were Hester Louise and Albert Edwin Offord. Albert was a master printer with the publishing firm Eyre and Spottiswoode. Hester trained as an opera singer but after marrying Albert she gave up her plans to become a professional singer. Cyril was the eldest of his parents' three children, having two younger brothers Horace and Frank who both made careers in medicine. The family were Plymouth Brethrens, members of a Christian church with no distinction between clergy and laity. The family took part in the regular Sunday morning meetings and, later in life, Cyril recalled his unhappy memories of these meetings\n[\n1\n]\n(\nor\n[\n2\n]\n)\n:-\n... he was so bitter about his narrow Plymouth Brethren upbringing that he did not like to talk about his early years.\nWhen he became older he renounced all religion, a position he held for most of his life, but we will mention his religious conversion towards the end of this biography. Offord was brought up in London where he attended Hackney Downs Grammar School.\nAfter graduating from the Grammar School, Offord entered University College, London, where he studied mathematics. After the award of his first degree, he went to St John's College, Cambridge to undertake research. At Cambridge he came under the influence of\nJ E Littlewood\n, who had been appointed as\nRouse Ball\nProfessor at Cambridge in\n1928\n, and\nG H Hardy\nwho had held the Sadleirian chair at Cambridge from\n1931\n. He began publishing papers in\n1932\nwith\nOn the summability of power series\nand\nOn the summability of trigonometric series\nappearing in that year and the paper\nFourier and Hankel transforms\nin the following year. During his early years at Cambridge he collaborated with several mathematicians:\nStephen Bosanquet\n,\nEinar Hille\nand\nJacob David Tamarkin\n. In July\n1936\nhe attended the International Congress of Mathematicians in Oslo and gave the lecture The uniqueness of the representation of a function by a trigonometric integral which was published in the\nProceeding\nof the conference in the following year.\nOfford had strong left-wing views and he had\n[\n3\n]\n:-\n... a strong sense of social justice. In the\n1930\ns, he belonged to Science For Peace and was in at the early stages of the Academic Assistance Council, now the Council for the Aid of Refugee Academics ...\nHe was elected a fellow of St John's College, Cambridge in\n1937\nand remained in Cambridge for three further years, leaving in\n1940\nto take up a temporary assistant lectureship at University College, Bangor. It was during these last three years at Cambridge that he worked with\nJ E Littlewood\non the topic for which he is best known today, and they published a series of important joint papers beginning with\nOn the number of real roots of a random algebraic equation\nin\n1938\n. In the following year they published a second paper with this title and in it they give estimates of the expected number of real roots for an equation of degree\nn\nn\nn\nwhen the coefficients are identically distributed random variables.\nAfter spending two years in Bangor, Offord was appointed as a lecturer at King's College, Newcastle upon Tyne, in\n1942\n. The University of Newcastle had been founded in\n1937\nas King's College, created from two Colleges of the University of Durham, namely Armstrong College and the College of Medicine, which were in Newcastle. Only in\n1963\ndid King's College become the University of Newcastle with a charter making it independent of the University of Durham\n[\n1\n]\n:-\nIn Newcastle, Cyril met Margaret Yvonne Pickard, known as Rita, and they were married in\n1945\n. Rita had been in the English Department at Newcastle, teaching and doing research on Early English texts. She gave up teaching upon marriage but continued with research, publishing two texts in the Early English Text Society. Their daughter, Margaret, was born in\n1949\nand has had a career in publishing, distance learning and educational technology.\nIn\n1945\n, the year he was married, Offord was appointed as Professor of Pure Mathematics at Newcastle. On\n4\nMarch\n1946\nhe was elected a fellow of the\nRoyal Society of Edinburgh\n. He was proposed by\nSir Edmund T Whittaker\n, John W Heslop Harrison,\nAlexander C Aitken\n, and Alfred D Hobson.\nWerner Rogosinski\nwas appointed as a lecturer in Newcastle in\n1945\nand promoted to reader in\n1947\n. In January of the same year Offord appointed\nWalter Hayman\nwho describes in\n[\n1\n]\n(\nor\n[\n2\n]\n)\nhow he was treated with great kindness by Offord:-\nTo me Cyril and Rita could not have been kinder. They took me to live with them in their house in Whitley Bay until they had helped me to find suitable lodgings. Cyril gave me a very light teaching load, which left me plenty of time for research. On one day in the week I had just one lecture and asked Cyril whether it was really worth travelling down from the coast for that. He might reasonably have bitten my head off, but just replied that it was necessary. Offord told me about his collaboration with\nLittlewood\n. At that stage they were just writing their big paper\n(\n'On the distribution of zeros and a-values of a random integral function'\n)\n.\nLittlewood\nmade him change the draft several times, until finally it came back nearly to what it had been in the first instance. He advised me to do my research with a pencil having a rubber at the end, and I have stuck to this method of working ever since.\nWe should say a little more about the 'big paper' referred to by\nHayman\nin this quotation. In it Offord and\nLittlewood\nconsidered the family of\nentire functions\nof finite order obtained by introducing independent plus or minus signs, each with probability\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n, in the\nTaylor\nseries of a given function.\nR P Boas\nwrites:-\nThey showed, roughly speaking, that the general behaviour of these entire functions, and in particular the distribution of their values, is almost always the same, being in fact determined by the modulus of the maximum term.\nOfford produced a remarkable generalisation of the results of this paper in\nThe distribution of the values of an entire function whose coefficients are independent random variables\n(1965)\n.\nReturning to our account of Offord's career, he left Newcastle in\n1948\nwhen appointed to a chair at Birkbeck College, London. He was elected a fellow of the\nRoyal Society of London\nin\n1952\n. In different circumstances, he may have remained at Birkbeck College for the rest of his career, but he had a disagreement with the university authorities over the mathematics degree and left Birkbeck in\n1966\nto take up a newly created mathematics chair at the London School of Economics. This had been established in response to the increasing demand for more sophisticated mathematics in the Social Sciences where expertise in statistics and computing were becoming necessary. In\n1973\nhe retired from the London School of Economics but remained in London as a senior research fellow at Imperial College. The London School of Economics paid this tribute to him in\n[\n4\n]\n:-\nWithin the School he is perhaps better known for his kindness, his humanity and the care and effort that he has put into establishing Mathematics as a subject of serious study at the London School of Economics. ... The School has been fortunate in attracting such a humane and gifted man as its first Professor of Mathematics.\nHowever, he did not remain in London, but returned to Oxford to spend the rest of his retirement\n[\n1\n]\n(\nor\n[\n2\n]\n)\n:-\nIn\n1980\nthe Offords moved to Oxford, where Rita had done her degree in English literature at Lady Margaret Hall. Cyril attended meetings and continued publishing until the\n1990\ns. Although Cyril was in frail health and poor sight owing to the loss of an eye because of a tumour in the\n1970\ns, he and Rita greatly enjoyed their retirement, receiving guests in their small north Oxford house, while Cyril indulged in his passions for early music\n(\nof which there are many concerts in Oxford\n)\n, gardening and French literature, benefiting from the proximity of the Maison Française. He created a beautiful walled garden, making a particular feature of the high walls with climbing plants such as clematis and roses. In summer the area was a feast of crimson and purple. Although musical, Cyril had never learned to play an instrument. He took up the lute in his retirement, receiving lessons from Diana Poulton\n.\nThe somewhat doleful strains of the lute seemed to fit in with the world-weariness that beset him in his later years.\nIn September\n1994\nhe wrote to one of his former Ph.D. students who had just retired:-\n... the first few years of retirement can be very pleasant and I hope your wife and yourself enjoy them fully. I have now reached\n88\nand things are not so pleasant when you get to that age. However, I have managed to re-write some of the work I did with\nLittlewood\n. It is now a bit more concise and I think easier to read.\nNear the beginning of this biography we mentioned that for most of his life Offord had rejected religion but had a conversion late in life. The conversion was, in fact, very late in his life, occurring shortly before his death when confirmed into the Church of England by the Bishop of Oxford. However, Offord's wife had been a member of the Church of England and for many years they had attended services together.",
  "math_areas": [
    "Analysis",
    "Statistics"
  ]
}