{
  "nome_completo": "D'Arcy Wentworth Thompson",
  "nome_curto": "D'Arcy Thompson",
  "ano_nascimento": "1860",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thompson_DArcy/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "St Andrews, Fife, Scotland",
  "biografia": "D'Arcy Thompson\n's father, also called D'Arcy Wentworth Thompson, was a classics master at the Edinburgh Academy when his son was born. D'Arcy's mother was Fanny Gamgee, the daughter of a veterinary surgeon, and sadly she died following his birth. Fanny Gamgee's brother\n(\nD'Arcy's uncle\n)\n, Arthur Gamgee, was a remarkable scientist and has been called \"the first biochemist\". D'Arcy's grandfather, Joseph Gamgee, played an important role in D'Arcy's upbringing, giving his grandson a love of science while D'Arcy's father gave him a love of the classics.\nD'Arcy Thompson senior was appointed Professor of Greek at Queen's College, Galway\n(\nnow the University of Galway\n)\nwhen D'Arcy was\n3\nyears old. D'Arcy lived part of the time with his grandfather Joseph Gamgee and from the age of ten he attended Edinburgh Academy. There he won the prize for Classics, Greek Testament, Mathematics and Modern Languages in his final year at school. He recalled in a letter to the Times that\n[\n3\n]\n:-\n... in his class at Edinburgh Academy was one boy who won the Victoria Cross, one with a seat in the Cabinet, one Royal Academician, and four Fellows of the\nRoyal Society\n.\nAfter starting a medicine course at Edinburgh University in\n1877\nhe studied this for three years before he changed to study zoology at Trinity College, Cambridge.\nIn\n1880\nThompson was a\nsizar\n, meaning that he obtained financial support by acting as a servant to the older boys, then in\n1881\nhe was awarded a scholarship. There was a group of young Cambridge men who were lying the foundations of the science of biology at this time and Thompson quickly became part of the group. He took the Natural Sciences Tripos and graduated with a B.A. in Zoology in\n1883\n. After graduating he spent one further year at Cambridge acting as a demonstrator on physiology.\nIn\n1884\nD'Arcy Thompson was appointed Professor of Biology in Dundee\n(\nincorporated as part of the University of St Andrews in\n1897)\nand later the title of his chair was changed to natural history. He set to work building up a zoology museum in Dundee to be used both for teaching and research. He collected a wide range of specimens from the Arctic waters making voyages himself as a commissioner for a joint British-American inquiry into fishing for seal fur in the Bering Sea. In his role as commissioner he visited the Pribylov Islands in the Bering Sea in\n1896\nand\n1897\n, being honoured with being made Commander of the Bath in the following year for the services he had given. Also in\n1898\nhe was appointed to the Fishery Board for Scotland. He was a British representative on the International Council for the Exploration of the Sea from the time it was set up in\n1902\n. While he was professor in Dundee, Thompson married Ada Maureen Drury in\n1901\n. They had three daughters.\nWhile at Dundee he showed another side to his character when he became a founder member of the Dundee Social Union. He pressed for it to buy four slum properties in the town which they renovated so that the poorest families of Dundee could live there.\nIn\n1917\nD'Arcy Thompson was appointed to the Chair of Natural History in St Andrews. He was to hold a chair for\n64\nyears, a record which will not now be broken.\nD'Arcy combined skills in a way that made him unique. He was a Greek scholar, a naturalist and a mathematician. He was the first biomathematician although he followed in the tradition of another great natural historian with mathematical skills, namely\nBuffon\n. His understanding of mathematics was of the modern subject but based on the firm foundations of an understanding of Greek mathematics. The breadth of his learning is emphasised in\n[\n1\n]\n:-\nThompson did not fit into any particular category: he was equally a scholar, scientist, naturalist, classicist, mathematician, and philosopher. Inheriting a love of the classics from his father and brought up by his scientific grandfather, he straddled two worlds and dominated both.\nAlthough he was to write around\n300\nscientific articles and books all D'Arcy's various skills came together in his most famous book\nOn Growth and Form\n(1917)\n. This book assumes that all science and learning are one, and attempts to reduce biological phenomena to mathematics. He claimed that all animals and plants could only be understood in terms of pure mathematics.\nOn Growth and Form:-\n... departed from contemporary zoology, which was occupied with orthodox questions of comparative anatomy and evolution, and treated morphological problems by mathematics. the theme was original, unorthodox, and revolutionary.\nLet us quote D'Arcy Thompson's own view from the introductory chapter of his masterpiece:-\nIt behoves us always to remember that in physics it has taken great men to discover simple things. They are very great names indeed which we couple with the explanation of the path of a stone, the droop of a chain, the tints of a bubble, the shadows in a cup. It is but the slightest adumbration of a dynamical morphology that we can hope to have until the physicist and the mathematician shall have made these problems of ours their own.\nThe shell of Nautilus\n(\nshown in the picture above\n)\nand the hexagonal cells of the bee's honeycomb related to logarithmic spirals and minimal areas. D'Arcy related such things to the Greek work on approximating π, √\n2\nand\nEuclid\n's\nElements\n. He was critical of other zoologists for not taking a mathematical approach:-\nEven now the zoologist has scarce begun to dream of defining in mathematical language even the simplest organic forms. When he meets with a simple geometrical construction, for instance in the honeycomb, he would fain refer it to psychical instinct, or to skill and ingenuity, rather than to the operation of physical forces or mathematical laws; when he sees in snail, or nautilus, or tiny foraminiferal or radiolarian shell a close approach to sphere or spiral, he is prone of old habit to believe that after all it is something more than a spiral or a sphere, and that in this 'something more' there lies what neither mathematics nor physics can explain.\nSee\nTHIS LINK\nfor a much fuller quote from the introduction to D'Arcy Thompson's\nOn Growth and Form\n(1917)\nwhich explains his views on mathematics and biology.\nD'Arcy Thompson was also a very fine writer and he said:-\nThe little gift I have for writing English which I possess, and try and cultivate and use, is, speaking honestly and seriously, the one thing I am a bit proud and vain of - the one and only thing.\nAt the end of\nOn Growth and Form\nhe wrote:-\n... something of the use and beauty of mathematics I think I am able to understand. I know that in the study of material things number, order, and position are the threefold clue to exact knowledge: and that these three, in the mathematician's hands, furnish the first outlines for a sketch of the Universe.\nHis deep knowledge of the classics was not just a hobby, for he published many papers on the topic. His most important publications in this area were\nA glossary of Greek birds\n(1895)\n, a translation of\nAristotle\n's\nHistoria Animalium\n(1910)\n, and\nA glossary of Greek fishes\n(1945)\n. In fact fishes were of great interest to Thompson who was highly involved with the international organisation and regulation of fisheries as we mentioned above.\nAnother of his interests was in the history of St Andrews, and he was a founder member of the St Andrews Preservation Trust. He would say:-\nThe stones cry out to us as we pass and tell us the story of our land.\nHis book\nScience and the classics\ndiscusses \"improvements\" to the town which he considered destroyed its beauty.\nD'Arcy Thompson was elected a Fellow of the\nRoyal Society of London\nin\n1916\nand was vice-president of the Society in\n1931\n-\n33\n. He was awarded the Darwin Medal of the Society in\n1946\n:-\n... in recognition of his outstanding contributions to the development of biology.\nHe also received recognition for his mathematics, being made an honorary member of the\nEdinburgh Mathematical Society\nin\n1933\n. He was President of the Classical Association in\n1929\nand President of the\nRoyal Society of Edinburgh\nin\n1934\n-\n39\n. He received the Linnean Gold Medal from the Linnean Society in\n1938\n. He was knighted in\n1937\n.\nW T Calman, writing in the Dictionary of National Biography, says that D'Arcy Thompson:-\n... was a man of very distinguished presence, a ready and polished speaker, whose lectures and addresses displayed a range of interests and of knowledge that would have been remarkable at any time but seemed doubly so in our age of specialists. He loved teaching and taught to the very last, for even in his final illness he gathered his honours students in his sick room for talks that none of them will forget.\nIt is also noted in\n[\n3\n]\nthat he was:-\n... an ardent correspondent both to individuals and newspapers and many penetrating and sensible letters of his appeared in the Times. With all his intellectual distinction he will be remembered by his friends, old and young, as an outstanding figure and a charming character.\nAn index to additional material on D'Arcy Thompson is at\nTHIS LINK\n.",
  "math_areas": []
}