{
  "nome_completo": "George Daniel Mostow",
  "nome_curto": "Dan Mostow",
  "ano_nascimento": "1923",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mostow/",
  "lugar_nascimento": "Boston, Massachusetts, U.S.A.",
  "lugar_morte": "Hamden, New Haven, Connecticut, USA",
  "biografia": "Dan Mostow\nwas the son of Isaac Mostow and Ida Rotman. Sidnie Feit writes\n[\n2\n]\n:-\nDan's father, Isaac, was born in Ukraine in\n1888\n. Dan's grandfather Joseph emigrated to the U.S. in\n1896\n, and brought the rest of the family over four years later.\nThere is, however, some confusion over different names and inconsistent dates which we should mention. The\n1910\nUS Census\n[\n13\n]\ngives Dan's father as Isador Mostow, the son of Joseph and Bessie Mostow. The dates of immigration are given as\n1900\nfor Joseph and\n1902\nfor Bessie, Isador, and Isador's sister Sadie. Joseph's occupation is given as \"peddler\", and Isador's as working in a jewellery shop. On his World War I Draft Registration Card\n[\n8\n]\n, Dan's father is named Isaac Mostow, born\n20\nNovember\n1888\nin Kiev, living at\n45\nLeverett Street, Boston, and gives his occupation as lawyer. He is exempted from the draft because of poor eyesight. He married Ida Rotman in\n1920\nand by the time of the\n1930\nUS Census\n[\n14\n]\nthey had two sons, Jack Mostow, aged\n8\n, and Daniel Mostow, the subject of this biography, aged\n7\n. This\n1930\nCensus names Dan's father as Isidor Mostow\n(\nnot Isador or Isaac\n)\n, gives his immigration year as\n1896\nand his occupation as lawyer. The\n1940\nUS Census\n[\n15\n]\ngives Dan's father as Isaac Mostow, occupation recorder, and by now there are three children whose names appear as Jechil\n(\npreviously Jack\n)\n, George D\n(\npreviously Daniel\n)\nand Morton S who is\n9\nyears old. Jack's occupation is \"news worker\", seeking work, while Dan has no occupation and is a student. Let us record here that Jechil\n(\nor Jack or Jechiel\n)\nhad been born on\n27\nApril\n1922\nand, after\n4\nyears of high school, enlisted in US Army Air Corps on\n12\nDecember\n1940\n. He served in World War II as a pilot but was shot down over the Mediterranean Sea and died\n31\nDecember\n1942\n.\nIn fact in\n1936\nDan had entered the Boston Public Latin School at the same time as\nDaniel Gorenstein\n; the two became lifelong friends. It was while he was at this school that he realised that he wanted to become a mathematician. He explained\n[\n6\n]\n:-\nIn high school, mathematics was my favourite subject. I especially enjoyed challenging problems. But I did not know that mathematics was a profession. I am indebted to my high school English teacher who, in my senior year, called me up to his desk to ask about my career plans, and told me that his brother was a mathematician. I decided then and there that mathematics was for me.\nDan earned money by working as a newsboy and, in addition, as a general helper in a catering hall. For more background about Dan Mostow during these years see the very full biography written by Sidnie Feit at\nTHIS LINK\n.\nSince Sidnie Feit has provided a very full biography, we will give a shorter biography here.\nMostow was awarded the 'Latin School Class of\n1898\n', the prize given to the top pupil. This prize included a one year scholarship and he also won two further minor scholarships. He began his studies at Harvard University in April\n1940\n, living at home to save money. Soon after starting his studies he was offered free tuition, room, and board by Harvard but decided to continue living at home, partly because he could not eat the Harvard college food because it was not Kosher. He was then given a full tuition scholarship to cover his complete course at Harvard. Majoring in mathematics, he graduated in June\n1943\nand continued his studies in the Harvard Graduate School.\nOf course, America was now involved in World War II, and many of the mathematics faculty at Harvard were undertaking war work. As a consequence, Mostow began teaching courses which were part of the training for officers, namely a spherical trigonometry course and a plane trigonometry course. In\n1946\nhe was awarded a Master's Degree from Harvard University. He began research on Lie algebras advised by\nGarrett Birkhoff\nand, with the money he was earning from teaching, he was able to rent an attic apartment in Cambridge.\nWhile a graduate student, Mostow met Evelyn Beatrice Davidoff\n(1924\n-\n2005)\n, born in Boston on\n26\nMay\n1924\n, the daughter of Sydney Davidoff and Ruth Feinstein. Evelyn, known as \"Haavie\" was a brilliant musician coming from a family of musicians. Before Mostow had submitted his doctoral thesis, in June\n1947\n, he was offered a\n2\n-year stay at the Institute for Advanced Study in Princeton and, to run in parallel, a one year position as Instructor in Mathematics at Princeton University. There was a problem, however, for\n[\n2\n]\n:-\n... he did not know whether he would have enough income to pay the high Princeton rents. After a consultation, the Institute offered him free rent. He immediately proposed marriage to Evelyn, and after a honeymoon in Nantucket, they moved to the Institute.\nLet us record that Dan and Evelyn Mostow were married on\n1\nSeptember\n1947\n. They had four children: Mark Alan Mostow; David Jechiel Mostow\n(\nknown as Jack\n)\n; Carol Held Mostow; and Jonathan Carl Mostow. Mark trained as a mathematician, and later became a computer scientist. Jack was the leader of Carnegie Mellon's \"RoboTutor\" project to enable children in developing countries to read and perform arithmetic. He was awarded a $\n1\nmillion prize. Carol became an Assistant Professor of Family Medicine and facilitator for the Schwartz Center for Compassionate Healthcare. Jonathan became a Movie Director, screenwriter, and producer.\nMostow's thesis was\nThe Extensibility of Local Lie Groups of Transformations and Groups on Surfaces\nand he was awarded a Ph.D. for this in\n1948\n. He published the main results of his thesis in a paper with the same title in the\nAnnals of Mathematics\nwhich was published in\n1950\n. He writes:-\nThe results in this paper were obtained by the author in his doctoral dissertation. The author wishes to acknowledge his debt to Prof\nGarrett Birkhoff\nfor his very valuable advice and encouragement.\nThe Introduction to the paper begins:-\nOne of the problems early in the history of continuous groups was the determination of all the continuous groups of transformations in the line, plane, and n-space.\nSophus Lie\nderived all the then-called \"groups\" of transformations in the line and plane. An inspection of his methods reveals that what he obtained was all the local\nLie\ngroups of transformations defined in a neighborhood of Euclidean space. It is natural to wonder whether a local group of transformations defined on a neighborhood of the line, plane, or more generally a region of n-space can be extended to a global group of transformations on a manifold of which the given region is a subset.  ... In this paper it is proved that a local\nLie\ntransitive group of transformations defined in a neighborhood of Euclidean space of dimension less than five can be extended to a global\nLie\ntransitive group of transformations on some manifold; if the dimension of the neighborhood is five or greater, the extensibility is not always possible.\nThis was not Mostow's first publication since his paper\nA new proof of E Cartan's theorem on the topology of semi-simple groups\nwas published in\n1949\n. This paper begins as follows:-\nE Cartan\nhas proved that a connected semi-simple\nLie\ngroup is topologically the direct product of a compact subgroup and a Euclidean space.\nCartan\nfirst proved this theorem in\n1927\nby a reduction to special cases, and not until\n1929\ndid he free his proof from the consideration of special cases. As a result\nCartan\n's proof is diffused among several journals. Moreover,\nCartan\nemploys in an essential way the theory of symmetric Riemannian spaces and makes use of a result whose proof seems to be lacking. ...\nIn this paper there will be given a more direct proof which eliminates the use of symmetric Riemannian spaces. The author wishes to acknowledge his debt to Professor\nC Chevalley\nwho suggested in an oral communication Lemma\n1\n.\n4\nbelow and to whom a proof of Theorem\n1\n, essentially the same as the one given here, was known.\nLet us give here a summary of Mostow's career. He was appointed as an Assistant Professor of Mathematics at Syracuse University in New York State in\n1949\n. He had been encouraged to accept this position by\nAtle Selberg\nwho was on the faculty there, but\nSelberg\nhad left Syracuse by the time Mostow took up his post in\n1950\n. At Syracuse, Mostow became a colleague of\nLipman Bers\nand the two became lifelong friends. There were tensions at Syracuse, however, between researchers and teaching-only members of the Department so when Mostow was offered an Assistant Professorship at Johns Hopkins University in\n1952\nhe was pleased to accept. At Johns Hopkins he was promoted to Associate Professor in\n1954\n, then to full professor three years later. He accepted the position of Professor of Mathematics at Yale Univesity in\n1960\n, taking up the post in\n1961\n. He served as Chairman of the Mathematics Department at Yale University in\n1971\n-\n73\n, then in\n1981\nhe was named Henry Ford II Professor\nof mathematics at Yale. He remained at Yale for the remainder of his career.\nMuch more information about Mostow's career is available from Sidnie Feit's biography\n[\n2\n]\nwhich has the following sections: Dan and the Institute for Advanced Study\n(\nIAS\n)\n; Conference in Mendoza, and\nGrothendieck\n; Gerhard Hochschild; Utrecht University; Paris and Travel; Early Years at Yale;\n60\nth Birthday Conference; The\nInternational Mathematical Union\n(\nIMU\n)\n;\n1972\nICM Panel and\nGregory Margulis\n; The\n1974\nICM in Vancouver; The\n1978\nICM in Helsinki;\n1982\nand\n1983\nICM in Warsaw; The Miraculous Polish Pope;\nLudwig Faddeev\n, the\n1986\nGeneral Assembly, and A Resolution; A Russian Revolution - and a Redemption; Human Rights;\nIlya Piatetski-Shapiro\n; Ilya and the Brailovsky Seminar;\n1999\n, A Shared Retirement; Defending Mathematical Research in the U.S.;\nAmerican Mathematical Society\n(\nAMS\n)\n; National Academy Activities; Reviewer, Adviser, Organizer; Editor; Rigidity and the Steele Prize; The Wolf Prize; and Mostowfest. This biography is available in full at\nTHIS LINK\n.\nSidnie Feit has also written an article\nDan Mostow and the ICM,\n1972\n-\n1990\nwhich is available at\nTHIS LINK\n.\nMostow retired from his Chair at Yale in\n1998\nand, in the following year, was made Professor Emeritus. He continued as an active member of the Yale community, retaining his office and attending seminars.\nEvelyn Mostow died on\n16\nSeptember\n2005\n. On\n21\nJune\n2007\nMostow married Sidnie Feit. She was an intermittent mathematician, and later, a data communications lecturer, consultant, and author. She had been married to\nWalter Feit\nand had two children with him, a son Paul, who became a professor of mathematics, and a daughter Alexandra who became an artist.\nWalter Feit\nhad died in July\n2004\n. After Dan and Sidnie married, they had two honeymoons. The first was in Niagara on the Lake, in Canada, and the second in Alaska, in Glacier Bay, and then in Haines, where Sidnie's daughter Alexandra was living at that time.\nIn the interview\n[\n6\n]\ngiven in\n2013\n, Mostow explained what his interests were outside mathematics:-\nReading history, especially the history of religion. Trying to understand what is the good life and living a good life. It helps to have a loving wife, four children, and their spouses, as well as\n10\ngrandchildren and\n14\ngreat-grandchildren, all fascinating. I enjoy singing in a chorus, and attending the high-definition Metropolitan opera performances at Yale. The University's Koerner Center for Emeritus Faculty - which has a rich program of lectures, films, and parties - keeps me in contact with colleagues from other departments.\nMostow received many honours for his outstanding contributions. He served as president of the\nAmerican Mathematical Society\nin\n1987\n-\n88\n. He was a member of the\nNational Academy of Sciences\n, elected in\n1974\n, was awarded the\nAmerican Mathematical Society\n's Leroy Steele Prize in\n1993\nand the Wolf Prize in Mathematics in\n2013\n. The citation for the Wolf Prize gives an excellent summary of Mostow's remarkable mathematical achievements\n[\n4\n]\n:-\nGeorge D Mostow made a fundamental and pioneering contribution to geometry and\nLie\ngroup theory. His most celebrated accomplishment in this fields is the discovery of the completely new rigidity phenomenon in geometry, the Strong Rigidity Theorems. These theorems are some of the greatest achievements in mathematics in the second half of the\n20\nth century. This established a deep connection between continuous and discrete groups, or equivalently, a remarkable connection between topology and geometry. Mostow's rigidity methods and techniques opened a floodgate of investigations and results in many related areas of mathematics. Mostow's emphasis on the \"action at infinity\" has been developed by many mathematicians in a variety of directions. It had a huge impact in geometric group theory, in the study of Kleinian groups and of low dimensional topology, in work connecting ergodic theory and\nLie\ngroups. Mostow's contribution to mathematics is not limited to strong rigidity theorems. His work on\nLie\ngroups and their discrete subgroups which was done during\n1948\n-\n1965\nwas very influential. Mostow's work on examples of nonarithmetic lattices in two and three dimensional complex hyperbolic spaces\n(\npartially in collaboration with\nP Deligne\n)\nis brilliant and lead to many important developments in mathematics. In Mostow's work one finds a stunning display of a variety of mathematical disciplines. Few mathematicians can compete with the breadth, depth, and originality of his works.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Topology"
  ]
}