{
  "nome_completo": "Daniel Gray Quillen",
  "nome_curto": "Daniel Quillen",
  "ano_nascimento": "1940",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Quillen/",
  "lugar_nascimento": "Orange, New Jersey, USA",
  "lugar_morte": "Gainsville, Florida, USA",
  "biografia": "Daniel Quillen\n's father, Charles Sylvester Quillen\n(1909\n-\n1989)\n, trained as a chemical engineer but made his career as a high school physics teacher. His mother, Emma Lewis Gray\n(1910\n-\n1999)\n, was a secretary. Dan, as he was widely known, was the eldest of his parents' two sons. Jean Quillen writes in\n[\n7\n]\n:-\nFrom an early age his intellectual abilities and particular approach to the world were apparent. His mother used to enjoy telling how Dan didn't talk as a baby until he surprised everyone by being able to speak full sentences. ... His mother was a driving force in his young life, pushing others to recognize his abilities.\nIt was after his father gave him a calculus book when he was twelve years old, that he developed a passion for mathematics. For a while he was also passionate about chess but his interest in that diminished when he felt that playing competitively was too intense. He won a scholarship which enabled him to attend Newark Academy, a highly rated private secondary school, and, a year before he should have completed his schooling at Newark Academy, he won a scholarship to study mathematics at Harvard University. Dan's mother had discovered that Harvard had a special programme for talented students to begin their studies a year earlier than normal so, having won the scholarship, he was able to miss out the last year of secondary school and enter Harvard in September\n1957\n. Although he hadn't completed the work for his diploma at Newark Academy, nevertheless, because he performance was so outstanding, he was awarded his diploma. As a Harvard University student, Quillen took part in the\n20\nth\nIndividual and Team Putnam Competition in\n1959\nand was named as a Putnam Fellow. His girlfriend Jean\n(\nwhom he later married\n)\nwrote\n[\n7\n]\n:-\n... he seemed to absorb his undergraduate mathematics courses like a sponge. He learned and understood all of every course he took. In fact I noticed that he could reproduce by memory nearly every theorem and proof. He also had the talent of being able to identify what was important in a subject. Once when I got behind in a course, he managed to teach me all the important points in only three days. Not only did I get an A on the exam, but I also noticed a misprint in the examination paper!\nHe received his B.A.\n(\nmagna cum laude\n)\nin\n1961\nand received his Master's degree in the following year. He then began research at Harvard under\nRaoul Bott\n's supervision. Quillen felt that\nBott\nhad played a huge part in his development as a mathematician. Graeme Segal writes\n(\nsee\n[\n7\n]\nor\n[\n14\n]\n)\n:-\nHe said that\nBott\n- a large, outgoing man universally beloved for his warmth and personal magnetism, outwardly quite the opposite of his shy and reticent student - was a crucial model for him, showing him that one did not have to be quick to be an outstanding mathematician. Unlike\nBott\n, who made a performance of having everything explained to him many times over, Quillen did not seem at all slow to others, yet he saw himself as someone who had to think things out very slowly and carefully from first principles and had to work hard for every scrap of progress he made. He was truly modest about his abilities - very charmingly so - though at the same time ambitious and driven.\nMichael Atiyah\nfirst met Quillen when he was working for his Ph.D. at Harvard. He writes\n[\n7\n]\n:-\nI remember an excitable young man bubbling with ideas and enthusiasm which Raoul was happy to encourage.\nWhile just beginning to study for his Master's Degree at Harvard for his Ph.D., on\n3\nJune\n1961\n, Quillen married Jean Plesset. They first saw each other when Quillen took a first year chemistry class in his second year of undergraduate study, but it was their common love of music that brought them together for they met regularly through the Harvard orchestra. Jean played the viola and Quillen always claimed that he played the triangle. Jean, however, always claimed that Quillen was the orchestra's librarian and occasional trumpeter. Segal writes\n(\nsee\n[\n7\n]\nor\n[\n14\n]\n)\n:-\nHe delighted in \"figuring out\" things about how music worked and in devising tiny compositions of twenty or thirty bars, but he was far too driven mathematically to let himself spend much time on music. He and Jean had two children before he completed his Ph.D. and went on to have six altogether.\nIn fact Jean typed her husband's Ph.D. thesis. She wrote\n[\n7\n]\n:-\nI remember typing his Ph.D. thesis: Dan in one room producing pages, me in the next room with a hired electric typewriter. What we did with the two babies I cannot imagine! Naturally the thesis was produced about three minutes after it was due.\nIn\n1964\n, Quillen was awarded his Ph.D. for his thesis on partial differential equations entitled\nFormal Properties of Over-Determined Systems of Linear Partial Differential Equations\n. After receiving his doctorate, Quillen was appointed to the faculty of Massachusetts Institute of Technology. He spent a number of years undertaking research at other universities which were to prove important in setting the direction of his research. He was a Sloan Fellow at the Institut des Hautes Études Scientifiques in Paris during academic year\n1968\n-\n69\nwhen he was greatly influenced by\nAlexander Grothendieck\n.\nHyman Bass\nwrites\n[\n7\n]\n:-\nDuring the year in Paris, Quillen presented his typical personal characteristics: a gentle good nature, modesty, a casual and boyish appearance unaltered by his prematurely graying hair, and his already ample family life. In that brilliant, and often flamboyant, mathematical milieu, Quillen seemed to listen more than he spoke, and he spoke only when he had something substantial to say. His later work showed him to be a deep listener.\nQuillen was a visiting member of the Institute for Advanced Study at Princeton during\n1969\n-\n70\nwhen he was strongly influenced by\nMichael Atiyah\n, and a Guggenheim Fellow, again at the Institut des Hautes Études Scientifiques in Paris, during\n1973\n-\n74\n. Andrew Ranicki also spent the same year at the Institut des Hautes Études Scientifiques and writes\n[\n7\n]\n:-\nBoth Dan and his wife, Jean, were kind to me, and I was a frequent visitor at Pavillon\n8\nof the Residence de l'Ormaille. Although I did not talk to Dan all that much about mathematics, there were plenty of other topics, and I was always impressed by his seriousness of purpose and independence of mind, allied with a winning personal modesty.\nDennis Sullivan\nalso spent the year\n1973\n-\n74\nat the Institut des Hautes Études Scientifiques in Paris. He writes\n[\n7\n]\n:-\nOne memory that seems to fit with everything was of a large smooth wooden table situated without chairs in the middle of the main room of Pavillon\n8\nin the Residence d'Ormaille. On the table hundreds of little shapes were deployed into a dozen or so neat little battalions surrounding a coherent structure emerging in the middle. Dan and a couple of kids and anyone else who might be around were hovering around the table, peering intently at these patterns, muttering softly and hoping to experience the exquisite pleasure of fitting in new parts to the emerging structure. It was serious business with good karma.\nIn the\n1960\ns, Quillen described how to define the homology of simplical objects over many different categories, including sets, algebras over a ring, and unstable algebras over the Steenrod algebra.\nFrank Adams\nhad formulated a conjecture in homotopy theory which Quillen worked on. Quillen approached the\nAdams\nconjecture with two quite distinct approaches, namely using techniques from\nalgebraic geometry\nand also using techniques from the modular representation theory of groups. Both approaches proved successful, the proof in the first approach being completed by one of Quillen's students, the second approach leading to a proof by Quillen himself. The techniques using modular\nrepresentation theory\nof groups were used by Quillen to great effect in later work on\ncohomology\nof groups and algebraic K-theory. The work on cohomology led to Quillen giving a structure theorem for mod p cohomology rings of finite groups, this structure theorem solving a number of open questions in the area.\nQuillen received a\nFields\nMedal at the International Congress of Mathematicians held in Helsinki in\n1978\n. He received the award as the principal architect of the higher algebraic\nK\nK\nK\n-theory in\n1972\n, a new tool that successfully used geometric and topological methods and ideas to formulate and solve major problems in algebra, particularly ring theory and module theory. Algebraic K-theory is an extension of ideas of\nGrothendieck\nto commutative rings.\nGrothendieck\n's ideas were used by\nAtiyah\nand\nHirzebruch\nwhen they created topological\nK\nK\nK\n-theory. Clearly Quillen's year spent in Paris under\nGrothendieck\n's influence and at Princeton working with\nAtiyah\nwere important factors in Quillen's development of algebraic K-theory.\nBass\ndescribes in\n[\n2\n]\nhow Quillen resolved the problem that the higher algebraic\nK\nK\nK\n-groups,\nK\nn\nK_{n}\nK\nn\n​\nfor\nn\n≥\n3\nn ≥ 3\nn\n≥\n3\n, being constructed in an essentially different way from the\nGrothendieck\nconstruction presented great difficulties:-\n... he borrowed techniques from homotopy theory, and in a completely novel way. The paper in which this so-called Q-construction occurs is essentially without mathematical precursors. Reading it for the first time is like landing on a new and friendly mathematical planet. One meets there not only new theorems and new methods, but new mathematical creatures and a complete paradigm of gestures for dealing with them. Higher algebraic K-theory is effectively built there from first principles and, in\n63\npages, reaches a state of maturity that one normally expects from the efforts of several mathematicians over several years.\nJeanne Duflot was undertaking research for her Ph.D. with Quillen as her advisor when he learnt that he would receive the\nFields medal\n. She writes\n[\n7\n]\n:-\nHe was a teetotaler, and he won the\nFields\nMedal while I was his student; I was awestruck and could barely speak to him at our first meeting after I found out about this and was floored when he offered me a bottle of champagne that had been given to him by a congratulatory colleague, explaining that he did not drink alcoholic beverages. I gratefully accepted it and drank it with some fellow students. I think it was quite good champagne, but I was not an expert.\nAs to his character, this is shown in\n[\n2\n]\n:-\nWhen Quillen received his Ph.D. at the age of\n24\n, he and his wife Jean, a violinist, were already caring for two of their five children\n[\nthey now have six\n]\n. His precocity as a mathematician and as a father perhaps influenced the early greying of his hair, but it has not altered his boyish look or his easy and modest manner. He has a somewhat retiring life-style, appearing rarely in public, and then almost invariably with some extraordinary new theorem or idea in hand.\nIn\n[\n2\n]\nHyman Bass\nsums up Quillen's contribution leading up to the award of the\nFields\nMedal in\n1978\nas follows:-\nMathematical talent tends to express itself either in problem solving or in theory building. It is with rare cases like Quillen that one has the satisfaction of seeing hard, concrete problems solved with general ideas of great force and scope and by the unification of methods from diverse fields of mathematics. Quillen has had a deep impact on the perceptions and the very thinking habits of a whole generation of young algebraists and topologists. One studies his work not only to be informed, but to be edified.\nFrom\n1984\nto\n2006\nQuillen was the Waynflete Professor of Pure Mathematics at Magdalen College, Oxford. Jean Quillen explained how his idea to go to Oxford began when he was spending a year study leave at the\nMax Planck\nInstitute in Bonn\n[\n7\n]\n:-\nIt was Dan's relationship with\nAtiyah\nthat first brought us to Oxford. During the year in Bonn, Dan said to me, \"I'm in the wrong country.\" I said, \"What country should you be in?\" He said he wanted to be in Oxford, partly because he was interested in something that\nMichael Atiyah\nwas working on. After a year in Oxford we returned to Boston. About six months later Dan was in Oxford giving a talk when\nAtiyah\nmentioned that the Waynflete Chair at Magdalen College was opening up and asked if he would consider moving to Oxford permanently. He phoned me. I said, \"Yes, please,\" and that's how we came to Oxford to stay.\nIn\n2000\nthe journal\nK-Theory\nissued a special part dedicated to Quillen on the occasion of his sixtieth birthday. In the same year he gave the\nErdős\nColloquium at the University of Florida on\nModule theory for nonunital rings\n. On\n22\nMay\n2006\nthe '\n39\nth\nK-theory Day' at Oxford was set up to celebrate Quillen's\n65\nth\nbirthday. Jacek Brodzki lectured on\nAnalysis and geometry on discrete groups\n, Mathai Varghese lectured on\nT-duality and non-commutative geometry\n, Joachim Cuntz lectured on\nK-theory for locally convex algebras\n, and Eric Friedlander closed the proceedings with the lecture\nDan and me: looking back at some of Dan's remarkable mathematics\n. Having reached the age of\n65\n, Quillen retired in\n2006\n.\nQuillen's death came after an extremely sad number of years during which Alzheimer's disease took an increasing toll on him. Jean Quillen writes\n[\n12\n]\n:-\nAlzheimer's is truly a terrible disease.  It was very hard to watch what it did to Dan over the past\n5\n+ years.  It stole the things he loved and took him from me too early.  It first took his ability to do mathematics, then ability to play music, read, rational thinking and finally recognition of those he loved\n(\nexcept me, thank goodness\n)\n.\nWhat a sad end for a truly great mathematician. An illustration of the difficulties is seen in a report in\nThe Gainsville Sun\nof\n21\nJune,\n2010\nstating that Quillen was missing\n[\n5\n]\n:-\nGainesville police were searching Monday evening for a missing man who is an Alzheimer's patient. Daniel Gray Quillen,\n69\n, may have been heading toward Westside Park ... officers were in the area looking for Quillen, who is described as\n5\n-foot-\n6\n,\n160\npounds with thinning gray hair. He wears glasses. Police provided a clothing description that said Quillen should be wearing a green plaid shirt, khaki shorts and sandals.\nHe was cared for at the Haven Hospice during the last week of his life, where he died from the complications associated with the final stages of Alzheimer's.\nAmong the many honours given to Quillen, in addition to the\nFields\nMedal, we mention that he was a plenary speaker at the International Congress of Mathematicians at Vancouver in August\n1974\nwhen he gave the lecture 'Higher Algebraic\nK\nK\nK\n-Theory'. He was awarded the\nCole\nPrize in Algebra by the\nAmerican Mathematical Society\nin\n1975\nfor:-\n... for his paper \"Higher algebraic K-theories\".\nHe was an invited plenary speaker at the British Mathematical Colloquium in Aberdeen in\n1983\nwhen he gave the lecture\nInfinite determinants over algebraic curves arising from problems in geometry, differential equations and number theory\n.\nLet us end this biography by quoting the tribute to Quillen from the editors of the\nJournal of K-Theory\n[\n4\n]\n:-\nMore than anyone else, he was responsible for creating the subject of algebraic K-theory as it is pursued today, and for demonstrating its power and elegance. He also made fundamental contributions to many other aspects of mathematics: rational homotopy, model categories, formal groups, and cyclic homology, to mention a few. All of the ideas he has developed will survive him and give him the stature of a great mathematician of the\n20\nth\ncentury. Many mathematicians including all of the members of our Board were greatly inspired and influenced by his vision, his teaching and his writing. As editors devoted to the subject that Quillen largely created, we are highly appreciative of his crucial support for the journal \"K-Theory\" and its successor the \"Journal of K-Theory\", and of all that he has done for our area of mathematics. He will be greatly missed and fondly remembered.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}