{
  "nome_completo": "Daniel Edwin Rutherford",
  "nome_curto": "Daniel Rutherford",
  "ano_nascimento": "1906",
  "ano_morte": "1966",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rutherford/",
  "lugar_nascimento": "Stirling, Scotland",
  "lugar_morte": "St Andrews, Fife, Scotland",
  "biografia": "Daniel Rutherford\nwas known to his friends and colleagues as Dan. He attended Perth Academy, completing his studies there in\n1924\n. He was then an undergraduate at St Andrews University receiving his B.Sc. in\n1927\n, his M.A. in\n1928\n, and being awarded First Class Honours in mathematics in\n1929\n.\nTurnbull\nadvised him to undertake research in Amsterdam under Roland Weitzenböck's supervision, and he obtained a doctorate from there with a thesis on modular invariants. It was an outstanding piece of work done under difficult circumstances since Rutherford knew no Dutch when he arrived in Amsterdam. His thesis appears as the Cambridge Tract\nModular Invariants\n(1932)\nand was reprinted in New York in\n1964\n.\nThe Preface to this book begins\nIn the winter of\n1929\nProfessor Weitzenböck pointed out to me that there was no complete account of the theory of modular invariants embodying the work of Dickson, Glenn and Hazlett. ... The substance of Part II is largely taken from a course of lectures entitled \"Algebraische theorie der lichamen \" which Professor Weitzenböck delivered in Amsterdam University during the session\n1929\n-\n30\n.\nRutherford returned to Scotland in\n1932\nafter completing his doctoral studies and was appointed to the University of Edinburgh as an Assistant Lecturer in Mathematics. After one year in Edinburgh he joined the staff in St Andrews, again as an Assistant Lecturer in Mathematics, but in\n1934\nhe was promoted to Lecturer in Mathematics and Applied Mathematics and given the task of building Applied Mathematics at St Andrews. He had one assistant to help him develop applied mathematics but he was also helped by\nTurnbull\nwho held the Regius Chair of Mathematics. When\nLedermann\nwas appointed to St Andrews as an assistant in\n1938\none of his main tasks was to help Rutherford build applied mathematics. The letter from\nTurnbull\noffering\nLedermann\nthe post explained:-\nI have looked out for one who is competent to teach particularly in Analysis and Applied Mathematics. Your special knowledge of the applications of mathematics to problems involving matrices and statistics is an advantage; but you will realise, Walter, in view of the needs of this Department, that proficiency in teaching Applied Mathematics and the functions connected therewith will be important.\nAfter World War II broke out Rutherford had a commission in the R.A.F. and taught cadets of the Initial Training Wing in St Andrews. However, despite teaching cadets, and being involved with developing applied mathematics, Rutherford continued to undertake research in algebra. He was awarded a D.Sc. in\n1949\n.\nRutherford was promoted to Reader in\n1952\nand then he was appointed to the\nGregory\nChair of Applied Mathematics in\n1964\n. This was not the first chair that he had been offered, however, for earlier he had been offered chairs in England and also overseas. These he had turned down since he was determined to remain in Scotland. Looking at the journals in which he published, it is immediately clear how Scottish they are; the\nEdinburgh Mathematical Society\n, the Glasgow Mathematical Society, and the\nRoyal Society of Edinburgh\n. That he would wish to work in Scotland is not surprising.\nDespite his mathematical interests, since\nCopson\nheld the Regius Chair of Mathematics, Rutherford was appointed to a new chair of applied mathematics. It was a rather peculiar situation since Rutherford was far more of a pure mathematician than was\nCopson\n, but with only one professor in each department and with Rutherford's task from\n1934\nonwards being to expand the teaching of applied mathematics, giving him an applied mathematics chair was inevitable. His teaching was not exclusively applied mathematics, however, for he taught a lattice theory course on several occasions. In fact these courses formed the basis of his book\nIntroduction to lattice theory\npublished in\n1965\n. Nor was his research exclusively in algebra, for as we mention below, he published some interesting applied mathematics papers too.\nRutherford's papers in the\n1940\ns included\nOn the relations between the numbers of standard tableaux, On the matrix representation of complex symbols, On substitutional equations, Some continuant determinants arising in physics and chemistry, On commuting matrices and commutative algebras\n; these being published either by the\nEdinburgh Mathematical Society\nor by the\nRoyal Society of Edinburgh\n. His most important work was\nSubstitutional Analysis\n(1948)\nin which explicit\nrepresentations\nof the\nsymmetric group\nare given. He states his aims in the text:-\n... the purpose of this book is to give an account of the methods employed by\nAlfred Young\nin his reduction of the symmetric group and to describe the more important results achieved by him.\nThrall, reviewing the book, writes:-\nAlthough the theory itself possessed much natural elegance many of Young's original proofs were quite intricate. By rearranging the order of presentation, by use of some results of\nvon Neumann\nand some results of the reviewer, and by introduction of a considerable number of his own new proofs the author has arrived at a treatment which is thoroughly elegant in method and theory.\nRutherford wrote several other texts in the Oliver and Boyd series which he set up with\nAitken\n. For example\nVector methods\n(1939)\n, and\nFluid dynamics\n(1959)\nwere popular texts with undergraduates for many years.\nOutstanding research contributions led to Rutherford being elected a fellow of the\nRoyal Society of Edinburgh\nin\n1934\nand he received the Keith Prize from the Society for an outstanding series of papers he published in\n1951\n-\n53\n. During these years he published\nCompound matrices, Application of relaxation methods to compressible flow past a double wedge\n(\nwritten jointly with A R Mitchell\n)\n,\nOn the theory of relaxation\n(\nwritten jointly with A R Mitchell\n)\n, and\nSome continuant determinants arising in physics and chemistry II\n. While mentioning the Royal Society of Edinburgh we should note that he served on the Council from\n1954\nto\n1957\n. In fact he received a posthumous prize from the Council of the\nRoyal Society of Edinburgh\n, for they awarded him their Makdougall-Brisbane Prize for the papers he published over the period\n1964\n-\n65\n. These papers were\nThe Cayley-Hamilton theorem for semi-rings\n,\nThe\neigenvalue\nproblem for Boolean matrices\n,\nOrthogonal Boolean matrices\nand\nOn certain numerical coefficients associated with partitions\n.\nIn\n[\n3\n]\nCopson\nwrites about some of Rutherford's interests:-\nAs a young man, he was a keen player of rugby and hockey, and, inspired by\nTurnbull\n, a good mountaineer. Latterly he turned to tennis, badminton, painting, fishing and gardening as relaxations. Some of his pictures were exhibited in Edinburgh and Dundee. He was an expert grower of alpines, rhododendrons and azaleas, and spent his last afternoon working in his garden. He was also a good musician, and kept up his interest in the Classics. He was a man of boundless energy, and did so much in a comparatively short life. But above all these things, he will be remembered for the kindly help he gave so freely to his students and colleagues.\nLedermann\n, who worked with Rutherford for many years, wrote in\n[\n2\n]\n:-\nIn his contact with people he was sincere and forthright, and always generous and ready to help in a practical way. Refugees from Nazi oppression who found their way to St Andrews\n(\nas did the present writer\n)\nwill remember with gratitude what Dan Rutherford did for them and for others who became victims of persecutions elsewhere.\nRutherford was a talented amateur artist. You can see a picture he drew of the Church of the Holy Rude in Stirling at\nTHIS LINK",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Number Theory",
    "Statistics"
  ]
}