{
  "nome_completo": "David Herbert Fowler",
  "nome_curto": "David Fowler",
  "ano_nascimento": "1937",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fowler_David/",
  "lugar_nascimento": "Blackburn, Lancashire, England",
  "lugar_morte": "Warwick, Warwickshire, England",
  "biografia": "David Fowler\nwas educated at Rossall School near Fleetwood, Lancashire, and it was in this school that he became fascinated by mathematics, partly though the excellent teaching of R K Melluish. After completing his schooling, he entered Gonville and Caius College, Cambridge, in\n1955\nto study mathematics.\nChris Zeeman\nwrites\n[\n3\n]\n:-\nI first met him\n[\nat Cambridge\n]\nas his tutor. We remained close friends for nearly half a century. He used to come for tutorials with fellow student\nJohn Conway\n, which guaranteed the wit flying around, and I remember them as the most exciting tutorials I have ever been party to. David was generous and thoughtful, enthusiastic and sensitive to the feelings of others, and seldom angry. He was always interested in what you had to say to him, and his replies were always stimulating and often very amusing. He graduated with a first, and then stayed on to do research in analysis for two years ...\nIn\n1961\nFowler was appointed as a lecturer in Mathematics at Manchester University, a post he held until\n1967\n. He then took up a position in the new Warwick University. The University had opened in\n1965\nand the Mathematics Department, thanks to outstanding leadership from\nChris Zeeman\n, enjoyed a remarkable level of research activity from the start. A large number of postgraduate students, and a year long topology year which brought many leading mathematicians to spend time there, meant that the department had an outstanding research atmosphere.\nZeeman\npersuaded the Nuffield Foundation to fund the Mathematics Research Centre at Warwick University in\n1967\nand he offered Fowler the role of manager of the Centre.\nZeeman\nwrites\n[\n3\n]\n:-\nI realised it needed a person of very special qualities to manage it, and I knew that David was that person. He chose Elaine Shiels\n(\nnow Coelho\n)\nto be the Centre secretary and, during the next\n20\nyears they welcomed more than\n1\n,\n000\nlong-term senior visitors to the annual year-long research symposia held at Warwick. They found housing for all the visitors, solved all their problems, talked maths with them and made them happy.\nIt was at this time that I\n[\nEFR\n]\nfirst met David Fowler for I was a Ph.D. student at Warwick at the time. My first impressions of David were to realise what thoughtful, kind person he was, and then quickly to appreciate his outstanding abilities as a lecturer. His success as a manager of the Mathematics Research Centre revolved around his understanding of needs of the visitors, and his attention to detail coupled with the energy he put into caring for them. Steve Russ, Eleanor Robson and Rona Epstein write\n[\n2\n]\n:-\nFowler brought many special and unusual abilities to the task. His great interest in people, and in mathematics, and his mastery of many practical issues in the maintenance of good living conditions, enabled him to provide, with colleagues, conditions under which distinguished visitors created much new mathematics and proved many new theorems. As a result, there were, in almost every year during Fowler's first\n25\nyears at Warwick, more mathematicians visiting the university's Mathematics Department than there were mathematical visitors to all other English universities combined - a remarkable record for a new university.\nHis exceptional qualities as a lecturer, which were immediately evident as I mentioned above, were partly due to his unusual approach in explaining to students why he was giving particular definitions and approaches. This style extended to writing textbooks such as\nIntroducing Real Analysis\nwhich he published in\n1973\n. Steve Abbott writes\n(\nin a review of another analysis book\n)\n:-\nIn\n1977\n, when I began my first analysis course, it consisted essentially of a monologue by the lecturer, most of which was simultaneously written on the blackboard for us to copy down. ... I learned it reasonably well, but what has stayed with me after\n20\nyears is much closer to what I met in a book I bought\n(\nfor\n55\np, second-hand\n)\nbefore I arrived at university. In that book, David Fowler anticipated many of my difficulties. For a start, he told me what a lemma was! When he defined continuity, he first discussed some unsatisfactory, but more intuitive definitions. On the subject of differentiability he started with chords tending to tangents and the wrote \"For what perverse reasons then, shall I shortly be giving a completely different, non-intuitive, non-geometrical definition? This, I know requires some explanation.\" I still have the book, its spine broken and with most of the pages loose, because it helped me understand analysis.\nFowler married Denise Stroh; they had two children Stephan and Magali. Denise was French and David and Denise Fowler had worked together on a translation from French to English of\nRené Thom\n's famous book\nStructural Stability and Morphogenesis\n. With this translation, they allowed this important text on catastrophe theory to become available in English. Indeed it was the first English text on the topic to be published.\nBut Fowler's worldwide reputation is as an historian who came up with mould breaking ideas. I corresponded with him, particularly regarding the history of ancient Greek mathematics, and in one letter he explained to me how he first became interested in history. He had been sent the book\nThe Evolution of the Euclidean Elements\nby\nWilbur Knorr\nto review in\n1975\n. He told me of his:-\n... difficulty in reading it, a combination of its length, its meticulousness, its minutely referenced notes, and the novelty, boldness, and revisionism of\nKnorr\n's point of view, as long-held and cherished opinions were subject to new investigation ...\nquickly fascinated Fowler. He began to put forward his own ideas about Greek mathematics publishing papers such as\nRatio in early Greek mathematics\n(1979)\n,\nBook II of\nEuclid\n's Elements and a pre-Eudoxan theory of ratio\n(1980)\n,\nAnthyphairetic ratio and Eudoxan proportion\n(1981)\n, and\nA generalization of the golden section\n(1982)\n. His masterpiece, however, was the book\nThe mathematics of\nPlato\n's Academy: A new reconstruction\nwhich was first published in\n1987\n. Fowler gives his aim as follows:-\nIt is often asserted that the discovery of the phenomenon of incommensurability led to a situation in which the early Greek mathematicians were unable to set the theory of ratio or proportion on firm foundations, within the means at their disposal, until the development by\nEudoxus\n, in the middle of the fourth century B.C., of the proportion theory of Book V. I wish ... to query everything in this sentence except that which relates to the identification, dating, and attribution of Eudoxan proportion theory.\nC M Taisbak, in a review, writes:-\nThe author endeavours to fulfil this programme of his in his important book on the mathematics in\nPlato\n's Academy. The book comprises three parts: Interpretations\n(\nof the received Greek mathematics\n)\n, Evidence\n(\nfrom the manuscripts through which it was transmitted\n)\n, and Later Developments\n(\nof, among other items,\ncontinued fractions\n)\n.\nA second revised edition was published in\n1999\n. Fowler did not change his views because many had criticised his views, rather he met his critics head on:-\nWhile the main contents of the first edition of this book may be highly controversial, in general they avoided polemic as much as possible. In parts of the new appendix, I go more on the offensive, and point out in more detail why I dissent from other more traditional views, and why I think that they may indeed sometimes be more speculative than my own.\nF Q Gouvea explains\n[\n1\n]\n:-\nFowler's case against the usual story is complex. It involves a mathematical reconstruction, an assessment of the available evidence, a careful examination of papyrological evidence for everyday arithmetic in ancient Greece, and lots more. His book is an education in and of itself, leading us through various approaches to studying the history of ancient mathematics, and arguing forcefully for his version of that history.\nAt Warwick, Fowler was a Lecturer in Mathematics from\n1967\nto\n1980\nwhen he was promoted to Senior Lecturer. In\n1990\nhe was promoted again, this time to reader. By the time Fowler was working on the second edition of his book, he knew that he was seriously ill. He went to consult doctors in January\n1994\n, seeking help with strange sensations he was experiencing. Eventually a brain tumour was diagnosed\n[\n2\n]\n:-\nThose around him were always struck by the grace and good-humour with which he bore his illness. It was typical of the man that he wrote a letter to all his colleagues, telling them of his illness and reassuring them that he understood their sympathy and that there is \"no need to attempt to say anything if you would prefer not to do so\".\nAfter being diagnosed with a brain tumour, Fowler continued to teach at Warwick and continued with his historical research. He retired in\n2000\n.\nChris Zeeman\ntells us a little more about Fowler's interests outside mathematics\n[\n3\n]\n:-\nDavid Fowler was a cultured man with wide interests. He made himself a clavichord, which he played softly, and he contributed a chapter to Music And Mathematics\n(2003)\n. He was also a quiet but unwavering supporter of human rights, environmental and educational organisations and campaigns.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Topology"
  ]
}