{
  "nome_completo": "David Cariolaro",
  "nome_curto": "David Cariolaro",
  "ano_nascimento": "1969",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cariolaro/",
  "lugar_nascimento": "Padua, Italy",
  "lugar_morte": "Padua, Italy",
  "biografia": "David Cariolaro\nwas the son of Gianfranco Luigi Cariolaro\n(\nborn\n1936)\n, who was a professor, and his wife Tina De Venuto. Gianfranco and Tina had two sons, David and his brother Dimitri Cariolaro. Gianfranco Cariolaro trained as an electrical engineer and, in the year before his son David was born, gained the right to teach at the University of Padua. In\n1975\nhe became a full professor at Padua. He has many research interests listed as:-\n... signal theory, theory of random processes, coding theory, numerical transmission, optical communications, mobile communications, deep space communications, digital television, multicarrier modulation systems and the digital cinema.\nDavid Cariolaro entered the Liceo Scientifico \"\nEnrico Fermi\n\" in Padua in\n1983\n, graduating from the high school in\n1988\n. In the following year he began his studies at the Università degli Studi di Pavia. He was an Erasmus Student in\n1991\n-\n92\nwhen he went to the University of Kent in Canterbury, England. There he studied for a University Diploma advised by Christopher F Woodcock whose interests were commutative algebra, algebraic geometry and algebraic number theory. He received the Diploma with Merit for his dissertation on\nAlgebraic Curves\n. He returned to Italy and continued to work towards his Laurea in Mathematics. His advisor was Carlo Bertoluzza of the Dipartimento di Informatica e Sistemistica, and Cariolaro expressed his thanks to him in\n[\n1\n]\n:-\nI must also thank Carlo Bertoluzza, my Tesi di Laurea supervisor, for having acted many times and in different occasions in my support, and for having equipped me with the foundations of the Theory of Uncertainty, which has been most helpful to me ever since I learned it.\nCariolaro spent four months in\n1993\n-\n94\nas an Exchange Student at Konstanz University in Germany. He then undertook military service in\n1994\n-\n95\nworking as an auxiliary firefighter at the Padua Fire Station. He writes in\n[\n1\n]\n:-\nI would like to thank Fire Chief Fabio Dattilo, Fire Chief Robert Triozzi, Fire Officer Vincenzo Valeri and all the Fire-Fighters of Padova Fire Station, who gave me an everlasting lesson during\n365\nunforgettable days of military service.\nHe was awarded his laurea in mathematics in\n1995\nafter writing his laurea thesis which was entitled\nUn'estensione del concetto di integrale sfumato rispetto a misure compositive\nⓉ\n(\nAn extension of the concept of fuzzy integral with respect to information decomposable measures\n)\n. While studying for his Laurea, he had been taught by Giorgio Balconi of the Dipartimento di Matematica \"F Casorati\". He wrote in\n[\n1\n]\n:-\nI first wish to express my gratitude to Giorgio Balconi, who introduced me to the beauty and elegance of graph theory, and who made me decide that I wanted to be a graph theorist.\nCarlo Bertoluzza and Cariolaro published the joint paper\nOn the measure of a fuzzy set based on continuous t-co-norms\nin\n1997\n. This paper was submitted for publication in October\n1995\nwhile Cariolaro was still in Pavia. See\nTHIS LINK\nfor details of this and other papers by Cariolaro.\nCariolaro was a Visiting Research Student at the Department of Mathematical Sciences, Aalborg University in Denmark, in\n1998\n-\n1999\n. There he worked on Ramsey Theory and Domination, a graph theory topic, with Lars Dovling Andersen and Preben Dahl Vestergaard. He writes in\n[\n1\n]\n:-\nI am most grateful to Lars Dovling Andersen for providing me, in\n1998\n-\n99\n, with the nicest graph-theoretic environment of all my life at Aalborg University, Denmark, where I arrived after a very difficult time of my life, and for his personal care and support.\nThe \"very difficult time of my life\" must relate to the thanks he expressed to Dr Fernando Della Pietra, a psychiatrist from the Department of Mental Health of the Hospital of Padua:-\n... for having given back to me a sense of safety that I had lost, acting, very professionally, as the best consultant I ever met.\nLars Dovling Andersen\n(\nborn\n1950)\nhad been Head of Department of Mathematical Sciences at Aalborg University in\n1996\n-\n1998\nbut by the time Cariolaro arrived there he was Vice Dean of the Faculty of Engineering and Science. Andersen had been a Ph.D. student at the University of Reading, England, where his thesis advisor had been Anthony J W Hilton\n(\nborn\n4\nApril\n1941)\n. Andersen's doctoral thesis of\n1979\nwas\nLatin squares and their generalizations\n. After the year in Aalborg, in\n2000\nCariolaro also went to the University of Reading, England, where his thesis advisor was also Anthony J W Hilton. Hilton, an expert in combinatorics and graph theory, writes:-\nMathematically speaking I am the son of David Daykin, the grandson of\nRichard Rado\nand the great-grandson of both\nIssai Schur\nand\nG H Hardy\n.\nCariolaro writes\n[\n1\n]\n:-\nI am indebted for life to my supervisor, A J W Hilton, for having granted me the privilege of being one of his students at the University of Reading. Among the innumerable things that I learnt from Professor Hilton during these four years, one of the most valuable is, I believe, not to refrain from undertaking the study of a difficult mathematical problem, and to maintain the same enthusiasm and perseverance even when the signs of any progress are not immediately visible.\nCariolaro also thanks David Daykin\n[\n1\n]\n:-\nI must greatly thank David Daykin, my academic grandfather, for having provided me with the strongest moral support since my arrival in Reading, and for having constantly been in touch with me.\nDuring his first two years at Reading, Cariolaro was a Teaching Assistant in the Department of Mathematics. He submitted his thesis\nThe\n1\n-Factorization Problem and some related Conjectures\nfor the degree of Doctor of Philosophy to the University of Reading in March\n2004\n. You can read the Preface to Cariolaro's thesis at\nTHIS LINK\n.\nA nice description of his time in Reading is given in\n[\n2\n]\n:-\nHis studies\n[\nat the University of Reading\n]\nwere funded at different times by his adoring brother Dimitri, and by his father Professor Gianfranco Cariolaro. His supervisor, Professor Anthony Hilton, reports that David was a diligent, hard-working student, who found it quite difficult to get to grips with his research topic, but eventually showed considerable insight and imagination. Together with Matthew Johnson, he organised a conference in Reading for graduate students studying Combinatorics. On occasions he would entertain others by performances on the clarinet. After obtaining a Ph.D.. but before leaving Reading, he married his wife, Shu Ning.\nIn fact Cariolaro married Shu-Ning Chen on\n7\nMay\n2004\n; they had two children, Elena and Gabriele Marco. After leaving Reading, Cariolaro served as a postdoctoral fellow at several different institutions. He was at LaBRI\n(\nUniversity of Bordeaux I\n)\nin June and July\n2004\nundertaking research in Matching Theory. He was at EPFL\n(\nSwiss Federal Polytechnic at Lausanne\n)\n, Switzerland from November\n2004\nto March\n2005\nundertaking research in Scheduling. He was at Department of Mathematics, Tamkang University in Taiwan, from August\n2005\nto July\n2006\nundertaking research in Graph factorization. He was at the Institute of Mathematics,\nAcademia Sinica\n, Taipei, Taiwan from August\n2006\nto June\n2009\nundertaking research in Graph colouring. During these years he published a number of papers; see\nTHIS LINK\n.\nIn September\n2009\n, Cariolaro was appointed as a Lecturer in the Department of Mathematical Sciences at Xi'an Jiaotong-Liverpool University in Suzhou, China. Later he was promoted to Associate Professor. The courses he taught at this University were: Calculus\n1\n, Calculus\n2\n, Linear Algebra, Mathematical Reasoning, Logic and Problem Solving. He continued to publish interesting papers on graph theory. A list of these papers, including abstracts of many of them, are given at\nTHIS LINK\n.\nCariolaro ran a web site which provided a discussion forum for those interested in graph theory. He explained his own interest in graph theory when encouraging those interested to join the discussion group:-\nIf one looks at the most common mathematical structures, e.g. groups, rings, fields, vector spaces,\nHilbert Spaces\n, etc. it is difficult to escape the impression that they are all objects of a very specialized kind. Sometimes five, ten or even fifteen axioms are needed to define these objects. Of course one may easily feel that the choice of these axioms is somehow arbitrary. Therefore it seems that pursuing the study of these structures would result in putting a strong bias to one's mathematical activity in the long term. I was attracted by graphs because they express a concept that may be described by a single axiom: friendship. We are either friends or not, there is no alternative, no third excluded. This is in some sense what the structure of a graph conveys: when you see two points connected by a line that is the geometrical expression of this relation, whereby the two points can be considered \"friends\", or as we say: \"neighbours\". Of course what one immediately learns is that, if A is a friend of B and B is a friend of C, that does not mean that A should be a friend of C: that is, the relation of friendship is not transitive\n(\nas we know very well\n)\n. Now the word friendship may be changed, if you wish, with any symmetric relation that you like, or even asymmetric, provided we are ready to switch to the world of digraphs, or directed graphs. The relation may not be limited to two people only, it may involve any number of people, provided we pass from the world of graphs to the world of hypergraphs.\nTragedy struck on\n20\nSeptember\n2013\nwhen Cariolaro was seriously injured in an accidental fall. He was rushed to hospital in Sozhou, near Shanghai, where he was in a coma. His father, Gianfranco, rushed to the hospital in Sozhou to assist his son in whatever way he could. However, the medical costs were extremely high, around\n1500\neuros a day, so Gianfranco set up a website to try to get some financial support. He wrote:-\nProfessor Cariolaro needs our HELP\nDavid Cariolaro is an Associate Professor in the Department of Mathematical Sciences at Xi'an Jiaotong-Liverpool University, China. On\n20\nSeptember David had a serious accident and is currently struggling for his life in the hospital in Sozhu, assisted by his wife and father, Prof Gianfranco Cariolaro of the University of Padua.\nDavid's condition is very critical and requires complex medical care whose cost, unfortunately not covered by any insurance, is so high that it has consumed our life savings in a few weeks. Unfortunately his condition does not allow transfer to an Italian hospital.\nThe Italian Consulate in Shanghai is taking an interest in the problem and is trying to make the Italian community in China aware of the situation but at the moment Gianfranco is not receiving any concrete financial support.\nThe purpose of this site is to present this dramatic story to as many people as possible, friends and acquaintances of David and Gianfranco, and to facilitate individual contributions giving everyone the possibility offering help and support.\nThe struggle to get David Cariolaro back to Italy was reported on regularly in the newspaper\nPadova Oggi\n. The paper reported on\n5\nNovember:-\nDavid's condition is not sufficiently stable to enable a transfer to an Italian hospital where he could receive the delicate lifesaving neurological surgery that China cannot provide. Family members seeking funds to bring him back to Italy with the only possible alternative for now being a private medically equipped flight but that would cost around\n150\nthousand euro. Complicating Cariolaro's case is the fact that the Veneto Region has no legal requirement for pay for the flight. The problem of transport is that no airline accepts such seriously ill people unless accompanied by a medical team and supported by suitable equipment.\nThe President of the Veneto Region, Luca Zaia, wrote a letter to the Italian Prime Minister's Secretary urging intervention on humanitarian grounds to repatriate Cariolaro. This was quickly answered with an offer by the Government to send a Falcon with a fully equipped medical team to bring Cariolaro back to Italy. By\n7\nNovember the flight was ready to leave but Cariolaro's condition worsened and it was decided to wait until he showed sufficient improvement. By\n19\nNovember his condition had improved and the flight departed for China. By\n30\nNovember\nPadova Oggi\nreported:-\nDavid Cariolaro's return to Italy occurred late on Friday with a flight from Shanghai made available by the government. During the trip, the professor from Padua was accompanied by a team consisting of neurosurgeons, anesthetists and resuscitation experts from the Hospital of Padua authorized by the Venetian governor Luca Zaia. On Saturday morning the hospital in Padua issued a first medical report, in which it noted that the condition of the professor, who was admitted around midnight, \"was substantially stable despite the challenging transportation, but his condition was serious.\"\nAlthough he regained consciousness after being treated in Padua, Cariolaro's condition worsened in early January\n2014\nas the result of an infection. He died with his family at his bedside.\nFinally let us note Cariolaro's hobbies were music, chess, tennis, javelin throwing and cycling.",
  "math_areas": [
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}