{
  "nome_completo": "David Vernon Widder",
  "nome_curto": "David Widder",
  "ano_nascimento": "1898",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Widder/",
  "lugar_nascimento": "Harrisburg, Pennsylvania, USA",
  "lugar_morte": "Arlington, Massachusetts, USA",
  "biografia": "David Widder\nwas the son of David Henry Widder\n(1864\n-\n1917)\nand Edith Drabenstadt\n(1863\n-\n1945)\n. David Henry Widder, born in Montsera, Pennsylvania, was a railway mail clerk who died of myocarditis in Harrisburg. Edith Drabenstadt was born in Maytown, Pennsylvania. David Henry Widder and Edith Drabenstadt were married in\n1893\n. In the\n1910\ncensus the family are living in their own home at\n1516\nDerry Street, Harrisburg, Dauphin, Pennsylvania. David Widder, the subject of this biography, had a sister Freda Bernice Widder\n(1894\n-\n1959)\nwho was four years older than him. We note at this point that Freda B Widder graduated from the Central High School, Harrisburg, and the Pennsylvania Academy of Fine Arts. She became an artist working for J Horace McFarland Company and married Harris A Ledford in Chicago.\nThere is, however, a rather strange claim which we do not understand. The above information about Widder's family comes various census returns and the details about his parents is confirmed on Widder's 'Certificate of Intention of Marriage'. But he writes in\n[\n12\n]\n:-\nMy father was a minister and former high school principal, and I think he would have liked to have me attend a religious college.\nDavid Widder, the subject of this biography, like his sister Freda attended Central High School, Harrisburg. In this school he sat beside a student called Rusty who said that Harvard was the best university so Widder applied to Harvard, took the entrance examination, and was accepted to begin his studies in September\n1916\n.\nSince David Widder wrote the interesting article\nSome Mathematical Reminiscences\n[\n12\n]\nwhich gives a detailed description of his education and early career we quote freely from that article:-\nI arrived at the South Station, Boston, in late September,\n1916\n, asked where Harvard was, took the subway to the last stop and found myself at Harvard Square. Disillusionment! College buildings were separated by two busy highways with stores and business buildings mixed in. True, some of the buildings and a campus, which I learned later to call \"The Yard,\" were enclosed inside walls. But this did not fit my preconceived notions.\nBy mail I had been assigned living quarters in Standish Hall, a Freshman dormitory, now part of Winthrop House. I found my room on the top floor, where I had three room mates, each with a separate bedroom. The dining room was on the first floor. I do not remember the charge for board and room, but I think tuition was $\n200\n. The food was sumptuous, elegantly served by waiters. These new dormitories on the Charles River were a project of President A L Lowell, who felt that students should be taught a proper life style. In any case I gained weight and almost lost my seat on a Standish crew, until I began reducing!\nThe two courses that I remember most clearly that year were Analytic Geometry under\nBôcher\nand Inorganic Chemistry under E P Kohler. It was a novel experience and somewhat exciting to be using a text that the professor had written:\nBôcher\n's Analytic Geometry. Perhaps I did not appreciate at the time that a world famous mathematician had condescended to take a Freshman class. But I came to admire him and to become enamoured with the subject. Professor Kohler was also a master expositor who could make his subject live.\nIn my Sophomore year I was lucky again. I had Modern Geometry under\nBôcher\n. In the first weeks he had us discovering properties of the ellipse from familiar ones for the circle by use of affine transformations. This was just a foretaste of the marvels to come. I think it was the influence of this course by this instructor that determined for me the choice of a career. In any case I determined to take any course\nBôcher\noffered in later years. The same year I studied Calculus under another famous mathematician, teaching from his own text. Professor\nW F Osgood\nhad a less inspiring style. I recall that he gave us good advice, ignored by most, on how to prepare a paper. You were to fold it down the middle, put a first draft on the right, corrections on the left. He used rubber finger caps to hold chalk. On the whole I would describe him as somewhat imperious.\nWorld War I broke out in\n1914\nbut the United States only entered the war in April\n1917\n. Six months after they entered the war, the United States set up the Aberdeen Proving Ground in Aberdeen, Maryland.\nOswald Veblen\ntook up the command of the office of experimental ballistics there in January\n1918\n. Widder became a member of\nVeblen\n's team\n[\n12\n]\n:-\nI became a civilian computer in the range firing section at Aberdeen Proving Grounds. ... I was bunked in barracks with\nNorbert Wiener\nand\nPhilip Franklin\n. I learned a lot from these enthusiasts, but at times they inhibited sleep when they talked mathematics far into the night. On one occasion I hid the light bulb, hoping to induce earlier quiet. One of our jobs was to convert French range tables to American units, using hand operated calculators, which we called \"crashers.\" Armistice enabled me to return to Harvard in the middle of a term. I recall that\nWiener\nwas distressed that he could not leave immediately. He was in uniform and subject to army regulations.\nBack at Harvard, Widder took courses on complex variable from William Caspar Graustein\n(1888\n-\n1941)\nwho, like Widder, had been at the Aberdeen Proving Ground. Graustein had returned to Harvard in\n1919\nto help the Mathematics Division which had lost three members.\nEdward B Van Vleck\nfrom the University of Wisconsin was visiting Harvard for a term and also taught Widder who graduated in\n1920\n. He was awarded a Sheldon Traveling Fellowship to continue his studies in France.\nOn\n16\nSeptember\n1920\nhe was issued a passport to allow him to study in France but when in Paris on\n19\nJanuary\n1921\nhe applied for an Amendment to his passport to allow him to visit Italy, Switzerland, Belgium and Holland for \"travel and study.\" He writes\n[\n12\n]\n:-\nWhile in France I did not learn much mathematics. But I did at least come in contact, however remote, with some famous personages. I heard a lecture by Mme Curie and another by\nÉmile Borel\n. I attended, irregularly,\nGoursat\n's 'Cours d'Analyse'. If\nOsgood\nwas imperious,\nGoursat\nwas regal. An usher opened the door for his entrance and escorted him out at the close. He lectured in a vast amphitheatre, nearly filled\n(\nsome said partly by street people who came in for warmth\n)\n, and had absolutely no contact with his audience. Although I had taken many French courses in college I still had trouble following the lectures. It was only near the end of the year that I became at all at ease with the language.\nAfter his year abroad, Widder returned to Harvard for the beginning of the\n1921\n-\n22\nacademic year. He was appointed as a half-time teaching fellow while he worked for his Master's degree which he was awarded in\n1923\n. He then became a full-time research student working on his Ph.D. thesis advised by\nG D Birkhoff\n. In\n1924\nhe published the paper\nA general mean-value theorem\nwhich begins:-\nIn a paper published in\n1906\n[\nGeneral mean-value and remainder theorems\n]\n, Professor\nG D Birkhoff\ntreated the mean-value and remainder theorems belonging to polynomial interpolation, in which the linear differential operator\nu\n(\nn\n)\nu^{(n)}\nu\n(\nn\n)\nplayed a particular role. It is natural to expect that a generalization of many of the ideas of that paper may apply to the general linear differential operator of order\nn\nn\nn\n, and the author is attempting such a program. This generalization throws fundamentally new light on the theory of trigonometric interpolation.\nWidder was awarded his Ph.D. in\n1924\nfor his thesis\nTheorems of mean value and trigonometric interpolation\n.\nAfter the award of his Ph.D., Widder was appointed to Bryn Mawr College where the head of mathematics was\nAnna Pell\n.\nAnna Pell\nhad been a professor at Bryn Mawr since\n1918\nbut had only become head of mathematics in\n1924\nwhen\nCharlotte Angas Scott\nretired.\nAnna Pell\nmarried Arthur Leslie Wheeler in July\n1925\nand she retired from Bryn Mawr. At this time Widder was appointed so succeed her as head of mathematics. He writes\n[\n12\n]\n:-\nDuring my stay at Bryn Mawr I was granted one year's leave of absence, assisted financially by a National Research Fellowship. The first part of the year was spent at the University of Chicago, where I had contact with\nG A Bliss\nand\nL E Dickson\n. The latter loved to play bridge at the Faculty Club after lunch, and I often joined the game. Next I went to the Rice Institute to study with\nS Mandelbrojt\n, a visiting lecturer. I found him very stimulating, full of ideas. Under his guidance I published two notes, one with J J Gergen, in 'Comptes Rendus'.\nIn\n1879\nRadcliffe College was set up in Cambridge, Massachusetts, to provide university level education for women who were not admitted to Harvard University. Ada Louise Comstock became the third President of Radcliffe in\n1923\n. In\n1930\nWidder moved to Cambridge, Massachusetts, when he was given a joint appointment to Radcliffe College and Harvard University. Ada Comstock negotiated a new relationship between Radcliffe College and Harvard University in the\n1940\ns and eventually Widder became a full professor at Harvard. The full merger of Radcliffe College into Harvard University, however, did not happen until\n1977\n.\nWidder, in collaboration with\nArthur Coble\nand Joseph Miller Thomas, became a founding managing editor of the\nDuke Mathematical Journal\nin\n1935\n.\nRoland Richardson\n, the Secretary of the\nAmerican Mathematical Society\n, wrote in a letter of\n13\nJanuary\n1936\n:-\nIn my dozen years as Secretary of the\nAmerican Mathematical Society\nno project has interested me more than the founding of this new mathematical journal. ... It was not thought by anybody that a new journal could start off at such a high level in quality and quantity.\nIn\n1935\n-\n36\nWidder had his first sabbatical leave and, funded by a Guggenheim Fellowship, he spent the year in Cambridge, England, working with\nG H Hardy\n[\n12\n]\n:-\nThat year I wrote the final chapters of my book, 'The Laplace Transform'. At times\nHardy\nwould invite me to dine with him at high table in Trinity College, where I met\nA S Besicovitch\n, among other notables. I attended his course on Almost Periodic Functions. He was less inspiring than\nHardy\n.\nHardy\nliked bridge, and he often came to my digs for several rubbers with other visiting students.\nWidder's book\nThe Laplace Transform\nwas published in\n1941\n. Francis Joseph Murray writes in the review\n[\n10\n]\n:-\nThe book is certainly enjoyable and interesting. The style is clear, there are few typographical errors and the subject matter is increasingly impressive as one reads on. The applications are particularly striking. In some cases, it is not clear why so many proofs of the same theorem are given and a guide to a reader who might be interested in any one of the many specific results would be valuable. However, it would be quite easy to use various topics treated in the book in a course, whose main interest is not integral operators. One might mention, the\nRiemann\n-\nStieltjes\nintegral, functions of bounded variation, methods of summation of series, positive definite series, the moment problems,\nBernstein\n's theorem, the Tauberian theorems, the prime number theorem, the Laguerre polynomials, the notion of a positive definite kernel of an integral equation, and the specific integral equations mentioned. Thus the author has presented us with a treatise on a branch of analysis of great importance and whose applications are of wide interest. The book is extremely satisfactory, when concerned with either its principal topics or the other related developments and one is confident that it will have a most valuable effect both on research and graduate study.\nThis book became a classic and there was a Dover unabridged republication of the\n1941\nedition in\n2010\n. For extracts from other reviews, see\nTHIS LINK\n.\nBy the time the book was published, Widder had married. On\n12\nJune\n1939\nhe married Vera Adela Ames\n(1909\n-\n2004)\n, a teacher born in Milestone, Saskatchewan, Canada. They had met at\nAnna Pell Wheeler\n's summer cottage in the Adirondacks and were married in Marlboro, New Hampshire. Vera was the daughter of Charles Edgar Ames, a farmer, and Margaret Ophelia Mooney. At the time of the marriage she was Canadian but became a naturalised American in July\n1948\n. She was born on a farm and\n[\n13\n]\n:-\n... attended Milestone School, accumulating\n20\n,\n000\nmiles by horse to obtain her early education. She went on to receive a B.A. and M.A. in Mathematics from University of Saskatchewan and a Ph.D. in Mathematics awarded in\n1938\nfrom Bryn Mawr College.\nDavid and Vera Widder had two children, David Charles Widder\n(5\nAugust\n1940\n-\n28\nDecember\n2010)\nand Edith Anne Widder\n(\nborn\n11\nJune\n1951)\n. Let us note at this point that David C Widder studied Mechanical Engineering at Northeastern University and Edith Widder studied biology at Tufts University. She became a senior scientist and director of the Bioluminescence Department at the Harbor Branch Oceanographic Institution working there from\n1989\nto\n2005\n. She then co-founded the Ocean Research & Conservation Association, an organisation whose aim is to protect aquatic ecosystems. She married David Smith, a computer scientist.\nWidder attended many conferences, helped to organise some and made research visits. For example he served on the Organising Committee for the International Congress of Mathematicians was held in Cambridge, Massachusetts, from\n30\nAugust to\n6\nSeptember\n1950\n. This Committee was chaired by\nGarrett Birkhoff\n. On\n2\nAugust\n1954\nWidder, his wife and children went to France for six weeks. They sailed from Atlantic Seaports, Quebec, Nova Scotia, Canada, on the 'Empress of Australia', arriving in Liverpool, England, before continuing to France. They arrived back in Quebec on\n17\nSeptember. In March\n1955\nhe attended the 'Conference on Differential Equations' held at the University of Maryland to honour to\nAlexander Weinstein\n's\n60\nth birthday on\n21\nJanuary\n1957\n. He published\nThe heat equation and the Weierstrass transform\nin the Conference\nProceedings\n.\nIn\n1966\nthe International Congress of Mathematicians was held in Moscow from\n16\nAugust to\n26\nAugust. Widder attended this Congress and his wife Vera accompanied him. He wrote\n[\n13\n]\n:-\nI was told that I I Hirschman and I were due royalties on our book, 'The Convolution Transform', which had been translated into Russian\n(\nwithout our permission\n)\n. We were each given $\n400\nbut were not allowed to take it out of Russia. Our train left next day, but we gave a dinner at our hotel for the E R Loves, from Australia, and\nLennart Carleson\n's family, from Uppsala, Sweden. Also Vera bought a silver fox stole and a few nicknacks. It was fun to be forced to spend!\nIn\n1967\nhe attended the conference 'Orthogonal Expansions and their Continuous Analogues' in Edwardsville, Illinois and published the paper\nExpansions in terms of the homogeneous solutions of the heat equation\nin the Conference\nProceedings\n.\nHis wife Vera Widder continued to teach mathematics. She\n[\n13\n]\n:-\n...  taught mathematics at Tufts University and University of Massachusetts and did volunteer tutoring as part of the Boston school integration program and in Concord prison.\nIn addition to\nThe Laplace transform\n(1941)\nwhich we mentioned above, Widder wrote several other important books. Thee are:\nAdvanced Calculus\n(1947)\n;\n(\nwith Isidore I Hirschman\n)\nThe Convolution Transform\n(1955)\n;\nAn Introduction to Transform Theory\n(1971)\n; and\nThe Heat Equation\n(1975)\n. For extracts from reviews and Prefaces for these books, see\nTHIS LINK\n.\nDavid Widder died in Arlington, Massachusetts and was buried in Maytown Union Cemetery in Maytown, Pennsylvania, his mother's home town.\nLet us give some details of Widder's wife, following his death\n[\n13\n]\n:-\nAfter her husband's death in\n1990\nVera remained in Boston until\n1998\nwhen she moved to Sarasota, Florida. ... She was an extraordinary woman, a loving and thoughtful mother, a patient and kind teacher, a good citizen and human rights activist and above all, a person of exceptional courage.\nAfter Vera died in\n2004\n, she was buried with her husband in Maytown Union Cemetery.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}