{
  "nome_completo": "David Gibb",
  "nome_curto": "David Gibb",
  "ano_nascimento": "1883",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gibb/",
  "lugar_nascimento": "Methil, Fife, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "David Gibb\n's father was  Robert Gibb\n(\nborn Scoonie, Fife about\n1857)\nwho was a salt manufacturer. His mother was  Joanna Gibb\n(\nborn Largo, Fife about\n1855)\n. David Gibb had younger siblings: Edith\n(\nborn about\n1881)\n, William\n(\nborn about\n1886)\nand Annabella\n(\nborn about\n1890)\n.\nDavid Gibb's home was Bellavue, Innerleven, Methil, Fife. He attended Leven Public School from\n1886\nto\n1896\n, then George Watson's College from\n1896\nto\n1899\n. He sat the Leaving Certificate Examination, obtaining passes at Higher Grade in Mathematics, German, and English in June\n1900\n. He also sat the University Preliminary Examination, passing Higher Latin in October\n1900\n. He first matriculated at Edinburgh University in October\n1900\ngiving his Edinburgh address as c/o H Flockhart,\n3\nWest Preston Street.\nIn his first year of study at university, Gibb took courses in Mathematics and Natural Philosophy at the Ordinary level passing Mathematics with the excellent mark of\n89\n% but finding Natural Philosophy somewhat harder with a pass at\n57\n%. In his second year he studied Latin which he failed in April\n1902\n, failed again in October\n1904\n, but finally passed in October\n1905\n. In\n1902\n-\n03\nhe passed Chemistry and Education, then Logic and Metaphysics, and Rhetoric and English Literature in the following year. From October\n1904\nhe studied Honour courses in Dynamics, Thermodynamics, Advanced Dynamics, Electrostatics, and Mathematics. He received an M.A. with First Class Honours in Mathematics and Natural Philosophy from the University of Edinburgh in July\n1906\n, followed by a B.Sc.\n(\nPure\n)\nfrom the same university in the following year.\nFollowing his graduation, Gibb was a mathematics teacher in a school until\nChrystal\nappointed him a Lecturer in Mathematics at the University of Edinburgh in\n1909\n. During World War I he served on the Ballistic Department Ordnance Committee, Royal Arsenal, Woolwich, from\n1914\nto\n1918\n. He was promoted to Reader in Mathematics at Edinburgh in\n1934\nand held this post until his death.\nWhittaker\nwrites\n[\n2\n]\n:-\nOn the staff he had as colleagues a succession of brilliant men who, while they did much for the reputation of the Edinburgh Mathematical Department, and now occupy chairs in other universities, were in many cases not well acquainted with Scottish educational matters: and the duty of acting as director of studies and generally as liaison officer between the University and the Scottish schools fell chiefly on Mr Gibb, who discharged it admirably.\nGibb was elected a Fellow of the\nRoyal Society of Edinburgh\non\n24\nJanuary\n1910\nhaving been proposed by\nGeorge Chrystal\n, Sir Frank Watson Dyson,\nCargill Gilston Knott\n, and\nEllice M Horsburgh\n.\nGibb joined the\nEdinburgh Mathematical Society\nin December\n1910\n. He served on the Library Committee in\n1910\n-\n15\nand again\n1917\n-\n19\n, vice-President\n1919\n-\n1920\n, the President in session\n1920\n-\n21\n. From\n1921\nhe served on the Committee to\n1923\nwhen he was made honorary librarian. He continued to undertake these duties until after\n1932\n. He submitted papers to the Society such as\nOn Integral Relations connected with the Confluent Hypergeometric Function\nwhich he read to the meeting on Friday\n11\nFebruary\n1916\n.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n.\nHis obituary in\nThe Scotsman\nis at\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}