{
  "nome_completo": "David Enskog",
  "nome_curto": "David Enskog",
  "ano_nascimento": "1884",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Enskog/",
  "lugar_nascimento": "Västra Ämtervik, Värmland, Sweden",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "David Enskog\n's father was Nils Olsson Enskog who was preacher in the Swedish Missionary Society, a religious society that had broken away from the Lutheran Church of Sweden. This evangelical Society had joined the Swedish Mission Covenant in\n1878\n. Nils Olsson had joined this revivalist movement before the Covenant was formed and he had travelled through the country preaching. He had met and married Karolina Jonasdotter, a farmer's daughter, and they had acquired a small farm at Västra Ämtervik, a small village in the Sunne Municipality, Värmland County, in a rural part of west Sweden. Nils and Karolina had twelve children, but their income was insufficient to support the family who were brought up in difficult circumstances. David, the fifth of the twelve children, was subject to the family's strict religious code as he grew up. He attended elementary school for six years and then spent two further years at a school run by a clergyman. He left this school in\n1899\n, at the age of fifteen, not having had a secondary education, and began working in a chemist's shop in the neighbouring small town of Sunne, the seat of Sunne Municipality.\nThe owner of the shop quickly realised that his new assistant was a bright young boy and he asked him why he was not studying at secondary school. Enskog was by this time around six years older than those entering secondary school so he thought that he had missed his chance. The chemist who owned the shop then made strenuous attempts to make it possible for Enskog to continue his education. The family did not have the necessary financial means to send their son to a secondary school but Nils Olsson took out a loan to give his son the opportunity. The chemist also helped provide Enskog with books for his studies and through\n1900\nEnskog worked on his own to bring himself up to the level of the fifth year of secondary school. He did this while working in the chemist's shop, turning to his books whenever there was a quiet spell in the shop. He sat the fifth year examinations for the secondary school in Karlstad and passed these in the autumn of\n1900\n. Karlstad, the nearest big town to Västra Ämtervik, was the largest city in Värmland. It was about\n45\nkm south of his home village so there was no possibility that Enskog could live at home. His father, however, had contacts within his church which meant that he was able to arrange accommodation for his son in the boarding school of Johan Jönsson.\nAt the secondary school in Karlstad, despite entering into the sixth year, Enskog was still older than others in his class. The secondary school ran a nine year programme so Enskog still had four years of schooling to complete. He began specialising in classics, but after one term he changed to concentrate on the more scientifically based modern syllabus. Remarkably, he was able cram four years of schooling into two years by spending his summers with a demanding schedule of academic studies. He took the final examinations in\n1903\nand obtained the top marks in mathematics and physics. He was now ready to enter Uppsala University but his strict upbringing did not allow him to fit easily into student life. For years he had spent large amounts of his time on study and, what little free time he had, he had spent in religious meetings and as a member of a society promoting abstention from alcohol. The social side of university life presented him with something quite outside his experience but, nevertheless, he took a full part in it. Most precious of all for Enskog was the fact that he was now free from the severe restraints imposed by his upbringing and he could make his own decisions.\nHow did the freedom affect Enskog? In fact he went through a number of different phases while attempting to find himself. As far as his academic studies were concerned he realised that he now did not need to concentrate on examinations as he had done while catching up on his secondary education. This did not mean that he eased up, but simply that he was now able to read round topics and study other things which interested him. In particular, while continuing to concentrate his studies round science and mathematics, he also developed an interest in philosophy. He came to question the strictness of his religious upbringing and began drinking alcohol. Soon he came to question the Christian faith itself, and renounced it. For a while he was attracted to the life-style put forward by the Norwegian playwright Henrik Ibsen in\nBrand\n(1866)\n. This is summarised by Halvdan Koht who writes:-\n'Brand' made the individual into the pivot round which everything in the world must revolve - imprinting personal demands in the soul with a force which had never before been done, making individual conscience into the battleground where all problems would be settled.\nAfter trying to live his life in this way, Enskog came to realise that it made neither him nor anyone round him any happier. Having rejected first Christianity and then this individualism, he turned to the one thing with which he felt secure, namely science. He graduated from Uppsala University with a first degree in\n1907\n, having taken courses in mathematics, mechanics, natural philosophy, astronomy and chemistry. He continued to study there for his licentiate in physics after taking his first degree. His advisor was Gustaf Granqvist\n(1866\n-\n1922)\n, an experimental physicist specialising in the physics of the electric arc, and Enskog chose the experimental study of gas diffusion as the topic for his research. In\n[\n10\n]\nit is suggested that Enskog approached the topic much more theoretically than his advisor would have liked, but he was awarded his licentiate in\n1911\nfor his dissertation\nStudies on the diffusion of water vapour at different pressures\n. Experimental physics was not his greatest strength, he realised, and now he made a decision to continue his research in theoretical physics. Two of his papers\nÜber eine Verallgemeinerung der zweiten Maxwellschen Theorie der Gase\nⓉ\n(\nOn a generalization of the  Maxwell's second theory of gases\n)\nand\nBemerkungen zu einer Fundamentalgleichung in der kinetischen Gastheorie\nⓉ\n(\nComments on a fundamental equation in the kinetic theory of gases\n)\nwere published in\nPhysikalische Zeitschrift\nin\n1911\n. He would have liked to continue in the academic world undertaking research in this area and made strenuous attempts to obtain funding for foreign travel. Largely he was unsuccessful and realised that he would have to find a job to provide a living wage. He decided to become a schoolteacher but he was able to undertake a probationary year in Stockholm as well as fitting in a visit to Göttingen in Germany where he attended lectures by\nDavid Hilbert\nin the academic year\n1912\n-\n13\n. Jagdish Mehra writes\n[\n4\n]\n:-\nEnskog did not mention in his thesis that he had benefited from\nHilbert\n's lectures, although the latter served as a point of departure for his work on the theory of non-uniform gases.\nHaving completed his training as a schoolteacher, Enskog obtained an appointment as a temporary teacher of mathematics and physics at the\ngymnasium\nin the small town of Skövde. He was now in a position to marry Anna Aurora Jönsson, one of the daughters in the household he had lodged in while studying at the secondary school in Karlstad. They married in\n1913\ndespite opposition from Anna's parents; they had two daughters, Birgit and Ulla, and a son Björn. Over the next years Enskog combined working as a teacher while spending all his spare time undertaking research for his doctorate. His advisor was Carl Wilhelm Oseen\n(1879\n-\n1944)\n, the professor of mathematical physics at Uppsala, who was an expert on the elasticity theory of liquid crystals and had made major contributions to the theory of viscous fluids. By\n1915\nEnskog had largely completed the work for his thesis and sent his results to Oseen for comments. However, Oseen thought that Enskog's mathematical proofs lacked rigour. He wrote in reply\n(\nsee for example\n[\n9\n]\n)\n:-\nAs far as the matters of physics are concerned, all the results obtained appear to me interesting ... Is it now certain that all the terms that appear in your calculations have a real significance? Is it in other words certain that the function which is sought can be developed in a series of the type assumed? But however fundamentally important I may consider this question, and however much I may advise that everything be done to demonstrate the correctness of the assumptions made, I would nevertheless conclude by saying that I do not regard it as impossible to defend the study in question, even if the difficulty cannot be overcome.\nEnskog submitted his thesis\nKinetische Theorie der Vorgänge in mässig verdünnten Gasen\nⓉ\n(\nKinetic theory of processes in moderately dilute gases\n)\nto Uppsala University which was examined on\n14\nApril\n1917\n. There was still a problem in that Enskog had failed to prove that his series converged. He had excused this by writing:-\nThe physicist does not attach excessive importance to this point.\nHe was awarded his doctorate but not at a high enough grade to merit a university position. At first he thought he would not be able to graduate since he could not afford the required academic dress, but his father-in-law sent him the necessary money and he was able to travel to Uppsala and graduate in May\n1917\n. Although the degree was not good enough to see him obtain a university position, at least it did allow him to obtain a permanent teaching position in a school and he was appointed to the grammar school in Gävle, a city in Norrland. Perhaps the best move he made to obtain recognition for his work was to send a copy of his thesis to\nSydney Chapman\nin England, who was working on similar problems.\nEnskog's thesis studied the\nMaxwell\n-\nBoltzmann\nequations. These had first been formulated by\nMaxwell\nin\n1867\nto describe the flow of molecules, momentum and energy of a gas. This was reformulated by\nBoltzmann\nin\n1872\nin terms of a velocity distribution function. Enskog began to work on this equation for his master's degree at Uppsala and made a remarkable prediction. If a mixture of two gases is subjected to a temperature difference, the gas with the larger molecules concentrates at the lower temperature. A simple theory does not predict this behaviour. However Enskog predicted it in a paper written in\n1911\n. In\n1917\nChapman\nindependently predicted it, but their theory was questioned until\nChapman\npersuaded a chemist Frederick William Dootson\n(1863\n-\n1929)\nfrom the Chemical Laboratory at Cambridge, England, to conduct experiments; the theory was verified.\nHilbert\npublished a new approach to the\nMaxwell\n-\nBoltzmann\nequations in\n1912\n. Enskog used\nHilbert\n's methods to work out a series expansion of the velocity distribution function f and wrote this up for his doctoral dissertation at Uppsala in\n1917\n. How to extend the\nMaxwell\n-\nBoltzmann\nequation to include collisions of more than two bodies was not clear. However Enskog made an important advance in\n1921\n, although it described the rather artificial situation treating molecules as hard spheres.\nChapman\n, who was still working on the\nMaxwell\n-\nBoltzmann\nequations, immediately saw the importance of Enskog's methods and developed them further. The book S\nChapman\nand T G Cowling,\nThe Mathematical Theory of Non-uniform Gases\n(1939)\n(\nwhich the authors dedicated to David Enskog\n)\nis the classic text on the modern kinetic theory of gases based on the approach by Enskog and\nChapman\n. In it the authors write\n[\n3\n]\n:-\nIn\n1917\nEnskog published his Uppsala Dissertation, in which he perfected the determination of f from\nBoltzmann\n's equation. His method was a modification of that of\nHilbert\n. He derived general formulas for the viscosity, conduction, and diffusion in simple and mixed gases, and also determined the pressure-tensor to a third approximation. The method and the details of the calculations were different from those in\nChapman\n's paper, but the two methods give precisely the same results. Enskog was unaware of\nChapman\n's paper of\n1916\nwhen his Dissertation was published. In\n1921\n, when he gave an account of the integrations and numerical work involved in his Dissertation, he took the opportunity to compare his results with those of\nChapman\n's papers. This revealed a few algebraic and arithmetical errors which affected some of\nChapman\n's formulas for the coefficients for a mixture.\nAlthough the advent of\nquantum theory\nwas to lessen the impact of this\nChapman\n-Enskog theory, it was later seen to be still important in the new context.\nThe research that Enskog conducted in the\n1920\ns was done while he worked as a senior master at the grammar school. He had been awarded a scholarship for\n1922\n-\n23\nwhich had funded a trip to Göttingen and Munich in Germany where he attended lectures by\nNiels Bohr\n,\nDavid Hilbert\n,\nArnold Sommerfeld\n,\nRichard Courant\nand\nMax Born\n. In\n1928\nhe was awarded a prize by the\nRoyal Swedish Academy of Sciences\n:-\n... for contributions to the kinetic theory of fluids and gases.\nIn the following year he applied to be transferred to a secondary school in Stockholm. He also applied for a professorship in mechanics and mathematical physics at Stockholm University College, and also for a professorship in mathematics and mechanics at the Royal Institute of Technology. He failed to obtain the professorship at Stockholm University College, the chair going to\nOskar Klein\n. Reports on the candidates for the professorship at the Royal Institute of Technology were published making it appear unlikely that Enskog would be appointed as he was criticised for not having any university teaching experience.\nChapman\n, however, attended a conference in Stockholm in August\n1930\nand met Enskog for the first time, although they had corresponded since\n1917\n. Realising that Enskog was close to being passed over for the professorship,\nChapman\nwrote a recommendation letter\n(\nsee\n[\n9\n]\n)\n:-\nI admire his work the more from my knowledge that most of it was produced not as the outcome of the leisure which is afforded by a university position or a research studentship, but in the midst of arduous teaching duties in school, with comparatively little leisure, and, to a great extent, without the intellectual stimulus given by contact with other men of science. For some years I have cherished the hope that his proved capacity for original research of a high order might be recognised in Sweden by his appointment to some university chair in which his abilities might be more fruitfully employed. ... I sincerely hope that he may be successful in his present candidature.\nThe letter changed the outcome and later in\n1930\nEnskog was appointed professor of mathematics and mechanics at the Royal Institute of Technology in Stockholm. However\nChapman\nwrote later:-\nHis transfer to a university chair seemed rather to bring him new duties than increased leisure, and this, with renewed ill-health, reduced his productivity in later years.\nIndeed his appointment, far from giving him more time for research, actually involved him in a much more demanding teaching and administrative situation. He now was able to make the trips abroad he had so longed for earlier in career, but they were fact-finding visits for teaching and did not allow him research opportunities. However, he was honoured by the\nRoyal Swedish Academy of Sciences\nin April\n1946\nwhen he was awarded their Svante Arrenius Gold Medal. In\n1947\nhe was elected to the\nRoyal Swedish Academy of Sciences\n[\n9\n]\n:-\nAt a gathering of the academy on\n28\nMay\n1947\n, Enskog took his seat and was welcomed by the other members. This was Enskog's first and last meeting as a member of this august body. Three days later, riding on a tram to a lecture at the Royal Institute of Technology, Enskog felt unwell. He left the tram and went to his doctor, who sent him to the hospital. He died early the next morning ...",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}