{
  "nome_completo": "David Gilbarg",
  "nome_curto": "David Gilbarg",
  "ano_nascimento": "1918",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gilbarg/",
  "lugar_nascimento": "Boston, Massachussets, USA",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Although\nDavid Gilbarg\nwas born in Boston, he was brought up in Brooklyn, New York. He was an undergraduate at the City College in New York, graduating in\n1937\n. He then went to Indiana University, Bloomington, where he studied graduate courses in\n1937\n-\n38\n.\nEmil Artin\nhad been forced to leave Germany in\n1937\nbecause of Hitler's anti-Semitic legislation and, after teaching at Notre Dame for the academic year\n1937\n-\n38\n, he arrived in Bloomington in\n1938\n.\nArtin\nbecame Gilbarg's thesis advisor and, after undertaking research in algebra, Gilbarg was awarded his doctorate in\n1941\nfor his thesis on\nalgebraic number theory\nOn the structure of the group of p-adic\n1\n-units\n. He was appointed to the faculty at Indiana University, but soon political events would create a major change in his career.\nHad it not been for World War II, Gilbarg would almost certainly be known today as an algebraist. The United States, however, following the Japanese attack on the American fleet at Pearl Harbour in December\n1941\n, entered  World War II and in\n1942\nGilbarg began undertaking war work with the Bureau of Standards and then at the Naval Ordnance Laboratory. At the Naval Ordnance Laboratory he became head of the fluid dynamics and theoretical mechanics section. His was work there took him into new areas of mathematics and involved fluid dynamics and nonlinear partial differential equations. Except for a paper relating to his thesis which was published in the\nDuke Mathematical Journal\nin\n1942\n, all his remaining mathematical publications were in the areas of fluid dynamics and nonlinear partial differential equations.\nAfter World War II ended, Gilbarg returned to his position as an assistant professor at Indiana University. His first paper on fluid dynamics was published in\n1947\n, entitled\nOn the flow patterns common to certain classes of plane fluid motions\n. A J McConnell writes in a review:-\nIt is proved that\n(\ni\n)\nthe stream functions of any two steady plane liquid flows that possess the same streamlines must be connected by a linear relation, except for the special case of those flows having constant velocity along the streamlines;\n(\nii\n)\nthe only flow patterns common to the potential flows of gases and liquids are those corresponding to circular vortex and radial flows.\nIn\n1949\nGilbarg published\nA generalization of the Schwarz-Christoffel transformation\n, and\nA characterization of non-isentropic irrotational flows\n.\nClifford Truesdell\nbegins a review of the second of these papers by noting:-\nThis paper is unusual in that it attacks a problem of gas dynamics in the large.\nAlthough continuing to hold his position on the faculty at Indiana University, Gilbarg became more and more involved with working with mathematicians at Stanford University\n[\n4\n]\n:-\nAfter several summer visits to Stanford, and one full-year visit in the\n1954\n-\n55\nAcademic Year, there was a firmly established mutual regard between Gilbarg and the Stanford Mathematics faculty - at that time including such outstanding figures as\nGeorge Pólya\n,\nGabor Szegő\n,\nCharles Loewner\n,\nStefan Bergman\nand\nMax Schiffer\n- and in\n1957\nhe accepted an invitation to take up an appointment as Professor of Mathematics, a position which he held until becoming Professor Emeritus of Mathematics in\n1989\n.\nFor many mathematicians, Gilbarg is best known for his remarkable book\nElliptic Partial Differential Equations of Second Order\nwritten in collaboration with\nNeil Trudinger\nand published in\n1977\n.\nTrudinger\nhad written his Ph.D. thesis at Stanford University advised by Gilbarg. He was awarded his doctorate in\n1966\nand, after working at a number of different institutions, returned to Stanford where he taught between\n1971\nand\n1973\n. Trudinger received the\nAmerican Mathematical Society\n's Steele Prize for Mathematical Exposition in\n2008\nfor their jointly authored book. Sadly Gilbarg could not share this award as he died seven years earlier. In\n[\n1\n]\nTrudinger\nexplained how the book came to be written:-\nI could never have imagined forty years ago when my book with David Gilbarg on elliptic partial differential equations was first published that it would get such recognition. The book was originally conceived by us after I had prepared lecture notes for the spring quarter of the graduate PDE course at Stanford in\n1971\n. My topics were\nSobolev\nspaces and their application to linear elliptic PDE, and we decided to start by blending these with earlier notes of Dave Gilbarg on the\nSchauder\ntheory. Six years later and after a lot of hard work, including long and painful negotiations over language, the first edition appeared.\nIn this first edition the authors explained that their aim was to present:-\n... the systematic development of the general theory of second order quasilinear elliptic equations and of the linear theory required in the process.\nIn\n1983\na second, revised edition, was published containing additional material. A reviewer writes of this second edition:-\nPrimarily addressed to graduate students this elegant book is accessible and useful to a broad spectrum of applied mathematicians.\nThe authors of\n[\n4\n]\nwrite:-\nAside from his fluid dynamics work, undoubtedly\n[\nGilbarg's\n]\nbest-known contribution to the mathematical literature is the monograph \"Elliptic Partial Differential Equations of Second Order,\" co-authored with his former Stanford PhD student\nNeil S Trudinger\n. Since\n1977\nwhen it first appeared, this book has seen several reprintings, and is one of the most frequently cited graduate-level texts ever published in the mathematical literature. At the recent commemorative conference in the Stanford Mathematics Department,\nJames Serrin\ndescribed the Gilbarg-\nTrudinger\ntext as being \"on the bookshelf of everyone working in partial differential equations, a monumental work which is one of the great lasting achievements of analysis.\"\nIn\n[\n2\n]\nthere is a quotation from Leon Simon, who was then chairman of the Stanford Department of Mathematics, concerning the influence that Gilbarg had on bringing outstanding mathematicians to Stanford:-\nHe brought to Stanford some of the biggest names in the country, even internationally. It was an important period that helped make Stanford one of the leading mathematics departments in the nation.\nDuring an eleven year period when Gilbarg was Chairman of the Stanford Department of Mathematics, namely\n1959\n-\n1970\n, appointments were made to the Department including\nPaul Cohen\n,\nLars Hörmander\n,\nKunichiro Kodaira\n, Donald Ornstein, Ralph Phillips,\nHans Samelson\n, and\nDonald Spencer\n.\nHans Samelson\nsaid\n[\n2\n]\n:-\nHe was a very good chairman, well organized, with good judgment, always looking out for the members of the department, with high standards for research and teaching. When I came here, he was very helpful and made me feel at home right away. He had a wonderful memory for what had happened at department\n[\nor other\n]\nmeetings, how and when and by whom decisions were made.\nGilbarg was married to Shirley; they had one son Daniel who is a professor of sociology.\nThe authors of\n[\n4\n]\nend their Memorial Resolution as follows:-\nApart from his central role in the development and support of the Mathematics Department at Stanford, David Gilbarg was much admired by friends and colleagues for his personal qualities, including his selfless dedication to the well-being of the department, his love of mathematics generally and his warm support of the work of his colleagues. These qualities were a recurring theme in the many tributes from family, friends and colleagues who attended a recent commemorative event hosted by the Mathematics Department. Particularly warm tributes were paid by former PhD students, citing Gilbarg's ability to convey a love of mathematics, his unstinting support, his encouragement in development of not only their general mathematical skills but also the ability to recognize and use the important key ideas within a field, and his insistence on exactness and clarity in their writing.",
  "math_areas": [
    "Number Theory"
  ]
}