{
  "nome_completo": "David George Crighton",
  "nome_curto": "David Crighton",
  "ano_nascimento": "1942",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Crighton/",
  "lugar_nascimento": "Llandudno, Wales",
  "lugar_morte": "Cambridge, England",
  "biografia": "David Crighton\nwas the son of George Wolfe Johnson Crighton and Violet Grace Garrison. He was born in Llandudno, Wales because, due to the bombing of London during World War II, his mother had been sent there so that her child might be born in safety. His secondary education was at Watford Grammar School, but there his first interests were not in mathematics but in classics. Only in his final two years at secondary school did he became interested in mathematics and this was brought about by one of the masters at Watford Grammar School who said:-\n... whatever else, he will never be any good at mathematics.\nCrighton related later in his life that it was this challenge which made him change from his intended career in classics, and switch to mathematics and physics for his main school subjects over his final two years at secondary school.\nAfter completing his studies at Watford Grammar School, Crighton entered St John's College, Cambridge, in\n1961\n. However he only completed the first two parts of the Mathematical Tripos for, despite obtaining a First in both parts, he preferred to end his education in\n1964\nwith a BA and to take a lecturing position at Woolwich Polytechnic. We should note that Woolwich Polytechnic has since then became the University of Greenwich, but at the time Crighton joined it, it did not have university status.\nPedley\nwrites in\n[\n2\n]\n:-\nThere he taught a broad spectrum of mathematics for up to\n23\nhours a week, and learned the techniques of crowd control - the evening class on subsidiary mathematics for engineering included several leather-clad \"mature students\" bearing knives.\nA chance meeting with John Ffowcs Williams, who was an expert in aeroacoustics on the mathematics staff at Imperial College, London, changed Crighton's career. He left Woolwich Polytechnic to become Williams' research assistant at Imperial College, taking a huge cut in salary in the process, and he also studied for his doctorate while at Imperial College. He was awarded his doctorate in\n1969\nand remained at Imperial until he was appointed as a Research Fellow in the Department of Engineering at the University of Cambridge five years later.\nCrighton's first publication was in\n1970\nwhen\nRadiation from turbulence near a composite flexible boundary\nappeared in the\nProceedings of the Royal Society of London\n. This paper Crighton studied the sound wave associated with a turbulent fluid flow over a discontinuous surface formed by two semi-infinite flexible planes. He gave a mathematical model in which the problem reduce to solving two singular\nintegral equations\nwith\nCauchy\n-type kernels, and with variable coefficients. Solving the equations he showed that he boundary converts the energy stored in the turbulent boundary layer into the sound waves which generate noise.\nDespite being appointed to the Department of Engineering at Cambridge in\n1974\nhe never took up the post for, at the instigation of Sir James\nLighthill\n, he was appointed to the chair of Applied Mathematics at the University of Leeds. Under Crighton's leadership the Department at Leeds was\n[\n1\n]\n:-\n... was transformed over the next\n12\nyears into one of the top departments of its kind in the country. Crighton's successive spells as head of department, chairman of school, and chairman of the science board\n(\neffectively Dean\n)\n, left in every case indelible marks of his imagination and effectiveness, tough decisions being invariably coupled with a genuine concern for the individuals affected.\nThere is a nice story told by\nPedley\nin\n[\n2\n]\nabout one of Crighton's fifteen research students at Leeds:-\nWhen he had been there only about a year, a new research student asked if they could fix a time for a regular weekly meeting. David looked at his diary and said: \"How about Mondays at\n7\no'clock?\" \"Am or pm,\" the student inquired - to which the reply was: \"Whichever you prefer\".\nIn\n1986\nBatchelor\nretired as professor of applied mathematics at Cambridge and Crighton was appointed to succeed him. At this time he was elected as a Fellow of St John's College. Crighton became Head of the Department of Applied Mathematics and Theoretical Physics at Cambridge in\n1991\n. He made new appointments to the areas of nonlinear dynamics and to solid mechanics. The department achieved great things under his leadership for he had a\n[\n2\n]\n:-\n... fierce determination that the department should not only remain by far the strongest mathematical sciences department in Britain and Europe, but that it should rank at least equal with the much more generously funded departments in America.\nIn\n1993\nCrighton was elected to a Fellowship of the\nRoyal Society\n. However, he was not the only member of his department to achieve this honour and it is certainly a great tribute to his leadership that, remarkably, fifteen members of his department had been so honoured by\n1999\n.\nWe have described above the contents of Crighton's first research paper. We gave some details of this work for it is typical of the applications of mathematics in which he worked throughout his life. He was particularly concerned in applying his ideas to noise control in aircraft design. His work on the air flow over the wings and fuselage of an aircraft was again done with the aim of achieving a reduction in the noise produced particularly in takeoff and landing.\nI\n[\nEFR\n]\nlast heard Crighton speak on\n27\nNovember\n1998\nat a meeting in University College London to remember the life and work of Sir\nJames Lighthill\n. At that meeting Crighton talked on\nLighthill and acoustics\n. It was a superb lecture, given by a mathematician at the height of his powers, describing the work of another remarkable mathematician. In fact Crighton's mathematical work was very much in the same area as that of\nLighthill\nand he shared with\nLighthill\nanother passion, namely music and opera.\nOther than his passion for research, achieving the highest world ranking for his department, and his family, Crighton loved music\n[\n1\n]\n:-\nThe operas of Wagner were a particular enthusiasm. He never missed an opportunity to attend the Bayreuth Festival, and would always seek to incorporate at least one opera in each of his many lecturing engagements around the world. A final achievement, that gave him great personal satisfaction and came just a few weeks before his death, was to conduct the college orchestra in a moving performance of the Overture to Tannhäuser.\nThe piano was another love. While at Leeds he became a great admirer of the formidable Russian pianist Tatiana Nikolayeva, who had been on the jury of the city's International Piano Competition in\n1984\n. When they met in the breakfast queue at a Leningrad hotel they struck up a friendship that lasted until her death in\n1993\n. More recently he had championed the Slovenian pianist Dobravka Tomsic.\nIn\n2002\nthe\nDavid Crighton Medal\nwas established by the Councils of the\nLondon Mathematical Society\nand the\nInstitute of Mathematics and its Applications\nin  memory of David George Crighton.\nSee\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}