{
  "nome_completo": "David Rittenhouse",
  "nome_curto": "David Rittenhouse",
  "ano_nascimento": "1732",
  "ano_morte": "1796",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rittenhouse/",
  "lugar_nascimento": "Paper Mill Run, near Germantown, Pennsylvania, USA",
  "lugar_morte": "Philadelphia, Pennsylvania, USA",
  "biografia": "David Rittenhouse\n's parents, Elizabeth Williams and Matthias Rittenhouse, were farmers near Germantown, at that time a separate town close to Philadelphia. William Rittenhouse built the first paper mill in the British colonies in Germantown in\n1690\n. David showed great promise as a child, particularly displaying a talent for constructing mechanical models and showing considerable mathematical skills. When he was eight years old it is recorded that he built a model of a water mill. Bedini writes in\n[\n2\n]\n:-\nHe was fascinated with mathematics from his early years but, with little opportunity for schooling, was largely self-taught from books on elementary arithmetic and geometry and a box of tools inherited from an uncle, David Williams.\nHe also read more advanced works, in particular an English translation of\nNewton\n's\nPrincipia\n. Rufus, in\n[\n4\n]\n, sees Rittenhouse as a mathematical disciple of\nNewton\n. Rittenhouse began to construct clocks, making a wooden one when he was seventeen, then a brass one a little later. By\n1751\nhe had opened a shop on a road that ran through his father's farm where he sold clocks, mathematical instruments and mechanical models of the solar system. Of course Rittenhouse lived through a difficult period with much of the fighting during the French and Indian War from\n1754\nto\n1763\ntaking place in Pennsylvania. Despite this he began to construct astronomical instruments in\n1756\n. He married Eleanor Coulston in\n1766\n; they had two children.\nRittenhouse was elected to the American Philosophical Society in\n1768\nand, based on calculations which he made, the Society made plans to observe the transit of Venus which was calculated to take place in\n1769\n. The plans consisted of setting up observatories on three sites from which observations would be made. Rittenhouse built one of these observatories at his home as well as constructing most of the astronomical instruments to be used in it. It is believed that he made the first telescope in the United States as one of these instruments\n[\n1\n]\n:-\nDuring this transit\n[\nRittenhouse\n]\nobserved that Venus has an atmosphere. His findings were similar to those of the Russian scientist Mikhail Vasilyevich Lomonosov, who had identified Venus's atmosphere during a transit in\n1761\n. Though both had written about their observations, neither report was published or publicised for more than a century.\nRittenhouse continued to do excellent business from his shop where he made steady sales of surveying instruments. However his wife tragically died in childbirth in\n1770\nand in that year he moved permanently to Philadelphia. In fact two years later he remarried, this time to Hannah Jacobs. There was one child from this second marriage which died while an infant.\nNot only did Rittenhouse have an outstanding reputation as the maker of surveying instruments, but also his expertise as a surveyor was very evident and he was in great demand in a land where borders were being defined and boundaries being surveyed. Rittenhouse served as City Surveyor of Philadelphia in\n1774\n. However as the American Revolution approached, Pennsylvania became a centre of military, economic, and political activity, and Rittenhouse began to play an important role. A Continental Congress was formed which met in Philadelphia in September\n1774\nwith a Second Continental Congress met, also in Philadelphia, in May\n1775\n. With outstanding expertise in mechanical inventions, Rittenhouse was soon involved in organising the manufacture of armaments such as cannon and ammunition, chains to fortify the harbour, as well as gunpowder. The American Revolution began in Pennsylvania, where a strong radical party seized power. The Congress recommended that colonies form their own governments and assigned a committee to draft a declaration of independence. Rittenhouse was, during this period, a member of the Pennsylvania General Assembly. He also served on the Board of War and was state treasurer from\n1779\nto\n1787\n. However he was also involved in academic affairs, being appointed to the Board of Trustees of the University of Pennsylvania in\n1779\n. He was professor of astronomy at the University during\n1780\n-\n81\n.\nThe fighting of the Revolution was over by\n1782\nand the Treaty of Paris of\n1783\nprovided a formal peace treaty. Following this, Rittenhouse again became involved in surveying the boundaries of Pennsylvania. He had published works on astronomy throughout his life but only in the second half of the\n1780\ns did he turn his attention to scientific topics such as magnetism, publishing\nAn account of some experiments in magnetism\nin\n1786\n. Although he had been interested in mathematics from a young age, Rittenhouse only began to publish mathematical works in the\n1790\ns. He published\nA method of finding the sum of several powers of the sines\nin\n1793\nand in a paper of\n12\nAugust\n1795\nhe gave an expansion of\nlog\n⁡\n10\nn\n\\log_{10} n\nlo\ng\n1\n0\n​\nn\n, where\nn\nn\nn\na positive number, as a simple c\nontinued fraction\nand then computed\nlog\n⁡\n10\n99\n\\log_{10} 99\nlo\ng\n1\n0\n​\n9\n9\nto nine decimal places. This work was not new in the sense that had he known of\nTaylor series\npublished in\n1717\nhe could have deduced his results easily. However the papers are important in that he and\nFranklin\nwere the only two mathematicians of any significance in the United States in the\n18\nth\ncentury.\nRittenhouse was long associated with the American Philosophical Society and we noted above that he was elected to this Society in\n1768\n. In fact the Society came into existence in\n1743\nfollowing\nBenjamin Franklin\n's\nProposal for Promoting Useful Knowledge Among the British Plantations in America\n.\nFranklin\nalso founded the American Society and the two Societies combined in\n1769\nfollowing which\nFranklin\nwas elected president. He continued to hold this position until his death in\n1790\n. During these years Rittenhouse played a leading role in the Society, as librarian, as secretary, and as vice-president. He also served on many of the committees set up by the Society. After\nFranklin\n's death Rittenhouse was elected the second president and served in this capacity until his own death.\nHe received many honours in the last years of his life. George Washington made him the first director of the U.S. Mint in\n1792\n. In\n1795\nhe was elected a fellow of the\nRoyal Society of London\n. Bedini writes\n[\n2\n]\n:-\nNext to\nFranklin\n, Rittenhouse was the leading figure in eighteenth-century American science. His achievements reflect an unusual combination of theory and practice; while his major contributions were primarily observational and experimental, his name has become synonymous with precision instruments.\nRittenhouse had suffered poor health during most of his life and he died at home.",
  "math_areas": [
    "Geometry"
  ]
}