{
  "nome_completo": "Demetrios G Magiros",
  "nome_curto": "Demetrios Magiros",
  "ano_nascimento": "1912",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Magiros/",
  "lugar_nascimento": "Euboia Island, Greece",
  "lugar_morte": "Philadelphia, Pennsylvania, USA",
  "biografia": "Demetrios Magiros\nwas a student at the University of Athens where he studied pure mathematics. He was awarded a doctorate in\n1940\nand was appointed to the National Technical University of Athens. His first appointment was as a lecturer in mechanics and geodesy but later he was promoted to professor of mathematics. During this period he published three papers on the catenary, all in\n1946\n. These were:\nOn the locus of the vertex of a variable catenary; The study of the tension of a variable catenary\n; and\nDiagrams of the tension of the cross-section in the suspension of hanging wires\n.\nIn\n1949\nMagiros went to the United States where he studied applied mathematics at Brown University, then the Courant Institute of Mathematical Sciences in New York, and finally at the Massachusetts Institute of Technology. He was then appointed as a research scientist at the IBM Watson Laboratory of Columbia University. His next position was with the Republic Aviation Corporation and at the Courant Institute. Magiros was then appointed as professor of mathematics and mechanics at Hofstra University in Hempstead, New York\n(\nfounded in\n1935\non land donated by businessman William S Hofstra\n)\n. At the same time he acted as a consultant for the Space and Missile Center of the General Electric Company in Philadelphia. In\n1960\nMagiros left his position at Hofstra University to take up full time research activities at the Space and Missile Center of the General Electric Company. He continued to work for the General Electric Company for the rest of his career.\nThe book\n[\n1\n]\ncontains\n43\nof Magiros'\n54\npapers. they are divided into three parts:\nApplied mathematics and modelling. This part includes papers on nonlinear differential equations, mathematical modelling of physical phenomena and linearization of nonlinear models.\nNonlinear mechanics. This part includes papers on subharmonic oscillations and principal modes, and celestial mechanics and orbital mechanics.\nDynamical systems\nanalysis. This part includes papers on stability analysis, precessional phenomena and separatrices of dynamical systems.\nOne of Magiros' main interests was on the stability of dynamical systems. In the paper\nOn stability definitions of dynamical systems\nwhich he published in the\nProceedings of the National Academy of Science U.S.A\nin\n1965\nhe gives the following introduction:-\nThe dominant subject in the analysis of dynamical systems is the stability of the ensuing motion. Many fields of interest under current research involve dynamical systems. These range from fields such as astrodynamics, meteorology, and control systems to biology, chemistry, medicine, and economics. In each of these fields dynamical systems can be formulated, and their stability can be examined as special cases of stability problems in dynamics. During recent years the stability concepts of dynamical systems have been advanced, either by modifying old ideas or by creating new stability concepts. These advances permit a deeper penetration into the more profound stability problems.\nIn this note, stability concepts of physically realistic dynamical systems, which are mathematically consistent, are discussed. Based on appropriate interpretation of the effects of perturbations, acting on the system either momentarily or permanently, a unified promulgation of the three basic stability concepts in the sense of\nLyapunov\n,\nPoincaré\n, and\nLagrange\nis given. Specialised stability concepts, introduced within the basic concepts, are indicated by appropriate remarks, and some relationships between the stability concepts are emphasised, and the stability concepts are clarified by geometrical interpretations.\nMagiros wrote other papers on stability such as\nThe stability in the sense of Lyapunov, Poincaré and Lagrange of some precessional phenomena\n(1970)\nand\nRemarks on stability concepts of solutions of dynamical systems\n(1974)\n. Other papers which Magiros wrote include these all published in\n1976\n:\nOn the linearization of nonlinear models of the phenomena. I. Linearization by exact methods\nwhich presents various \"exact\" methods of linearizing problems in differential equations;\nOn the linearization of nonlinear models of phenomena. II. Linearization by approximate methods\nin which he points out that \"approximate\" linearizations may lose the whole qualitative behaviour of the original nonlinear equation; and\nCharacteristic properties of linear and nonlinear systems\nin which he gives many examples, recalls the importance of identifying characteristic properties of solutions, such as the superposition property for linear systems, and the possibility of limit cycles and self-excited oscillations in nonlinear systems. Two papers which Magiros published in\n1977\nare:\nNonlinear differential equations with several general solutions\nin which he gives specific devices for finding solutions of some nonlinear ordinary differential equations; and\nThe general solutions of nonlinear differential equations as functions of their arbitrary constants\npresenting some nonlinear differential equations for which, surprisingly, some superposition does occur, that is, there are families of solutions depending linearly on arbitrary constants.\nTzafestas, in\n[\n3\n]\n, talks about Magiros as a teacher:-\nMagiros was an enthusiastic teacher with the talent to transmit both the depth and breadth of his knowledge. I personally remember his excellent lectures at N R C \"Demokritos\" in Athens\n(1973)\non mathematical modelling and stability of dynamical systems. his impressive set of lecture notes ... covers a variety of topics from special functions and transforms to numerical methods for the solution of nonlinear differential equations and optimal control problems.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}