{
  "nome_completo": "Derrick Norman Lehmer",
  "nome_curto": "Derrick Norman Lehmer",
  "ano_nascimento": "1867",
  "ano_morte": "1938",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lehmer_Derrick_N/",
  "lugar_nascimento": "Somerset, Indiana, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Derrick Norman Lehmer\n's parents were Derrick Fernstück Lehmer and Isabel Smith Perry. He was\n[\n1\n]\n:-\n... the son and grandson of Pennsylvania pioneers and the great grandson of a Hessian trooper who later joined the Continental Army and settled in Pennsylvania. His mother was Isabel Smith Perry, born in\n1823\nin Covington, Kentucky.\nHis primary education was in several schools in Nebraska. Details of his high school education are sparse and it is not known whether a picture taken in\n1885\nshowing him in military uniform means that he served in the military or whether it was a uniform for the high school he attended. He was educated at the University of Nebraska, obtaining his A.B. in\n1893\nand then worked for the railroads as a surveyor before returning to the University of Nebraska to study for his Master's degree which was awarded in\n1896\n. Before undertaking research he was headmaster of the Worthington Military Academy in\n1896\n-\n97\n. He then went to the University of Chicago where he undertook research under the supervision of\nEliakim Moore\n. Lehmer was awarded his Ph.D. in\n1900\nfrom the University of Chicago for his thesis\nAsymptotic Evaluation of Certain Totient-Sums\n.\nAfter the award of his doctorate Lehmer was appointed in\n1900\nas an instructor in mathematics at the University of California at Berkeley. Lehmer married Clara Eunice Mitchell on\n12\nJuly\n1900\nat Decatur, Illinois, and after they had travelled to Berkeley, Lehmer wrote to his sister-in-law Daisy Lehmer on\n2\nSeptember:-\nI have had two weeks work teaching and find it very charming and interesting work. I would rather teach than do anything else on earth and the more I teach the better I like it. We went to a big reception Friday evening and met a great many of the great men of the University. Mrs Hearst was there - a quiet, dignified woman ... the first millionairess I ever shook hands with. President Wheeler is a handsome man with fine presence and a great knack for remembering faces and names ...\nDerrick and Clara had two sons and three daughters Eunice\n(\nb.\n1903)\n, Helen\n(\nb.\n1904)\n, Derrick Henry\n(\nb.\n1905)\n, Stephen\n(\nb.\n1907)\n, and Alice\n(\nb.\n1911)\n.\nDerrick Henry Lehmer\nbecame a famous mathematician and also has a biography in this archive. Lehmer was promoted to professor at Berkeley in\n1918\nand continued to teach there until he retired on\n27\nJuly\n1937\n.\nLehmer published\nFactors\nin\n1909\n, and\nList of prime numbers from\n1\nto\n10006721\nin\n1914\n. The\n1909\npublication, whose full title is\nFactor Tables for the first ten millions containing the smallest factor of every number not divisible by\n2\n,\n3\n,\n5\n, or\n7\nbetween the limits\n0\nand\n10017000\n, was published by the Carnegie Institute of Washington. In it Lehmer gives a little of the history of tables of primes:-\nFrom the days of\nEratosthenes\n, the inventor of factor tables, to the present time the interest in the problem has never flagged. ... The history of factor tables really begins in the seventeenth century, starting perhaps with a table by\nCataldi\n(\nBologna,\n1603)\n, which gave all of the factors of all the numbers up to\n750\n...\nHe goes on to say that\nSchooten\npublished a list of primes to\n10\n,\n000\n(1657)\n, Chernac published the first table to\n1\n,\n020\n,\n000\n(1811)\n,\nBurckhardt\npublished a table for the second million\n(1814)\n, and\nCrelle\ncompleted the third, fourth, and fifth millions but the tables were discovered to be too inaccurate to publish.\nIn\n1917\nLehmer published\nAn Elementary Course in Synthetic Projective Geometry\n. He writes in the Preface:-\nThe following course is intended to give, in as simple a way as possible, the essentials of synthetic projective geometry. While, in the main, the theory is developed along the well-beaten track laid out by the great masters of the subject, it is believed that there has been a slight smoothing of the road in some places. Especially this will be observed in the chapter on Involution. The author has never felt satisfied with the usual treatment of that subject by means of circles and anharmonic ratios. A purely projective notion ought not to be based on metrical foundations. ...\nOne of the real gems in the book is the final chapter on the history of the subject. Lehmer writes about his attitude towards the history in the Preface:-\nThe writer has not followed the usual practice of inserting historical notes at the foot of the page, and has tried instead, in the last chapter, to give a consecutive account of the history of pure geometry, or, at least, of as much of it as the student will be able to appreciate who has mastered the course as given in the preceding chapters. One is not apt to get a very wide view of the history of a subject by reading a hundred biographical footnotes, arranged in no sort of sequence. The writer, moreover, feels that the proper time to learn the history of a subject is after the student has some general ideas of the subject itself.\nDuring the\n1920\ns Lehmer worked on factor stencils which gave a method of factorising a number using cards with holes punched in them. The method was described by his son as follows:-\nSince every quadratic residue\nR\nR\nR\nof a number\nN\nN\nN\nis also a quadratic residue of every possible factor of\nN\nN\nN\n, it follows that the problem of factoring a number\nN\nN\nN\nis hereby reduced to the discovery of an adequate number of quadratic residues\nR\nR\nR\nof\nN\nN\nN\nand the superposition of the corresponding stencils to reveal those few primes having these residues\nR\nR\nR\n.\nLehmer published\nFactor Stencils\nin\n1929\n. He had worked with his son in producing the stencils. They worked with residues\nR\n<\n240\nR < 240\nR\n<\n2\n4\n0\nand covered\n5000\nprimes which includes all primes up to\n48611\n. This enabled integers up to\n4861\n1\n2\n=\n2363029321\n48611^{2} = 2363029321\n4\n8\n6\n1\n1\n2\n=\n2\n3\n6\n3\n0\n2\n9\n3\n2\n1\nto be factored.\nFollowing on from the idea of factor stencils, Lehmer came up with another mechanical device to factor numbers. The reference\n[\n2\n]\ngives details of this device:-\n\"Even a worm will turn,\" and now electricity and light, which have in the past gone to mathematics for solutions of their intricate problem, turn about and solve problems in mathematics which would require scores of years to complete.\nConstruction of a machine which will perform these tedious tasks is insured by the grant of $\n1\n,\n000\nto Dr Derrick N Lehmer of the Mathematics Department of the University of California by the Carnegie Institution of Washington D. C. The immediate purpose of the machine is to determine the factors of large numbers which are greater than two millions. ...\nThe new machine, which will be constructed under Professor Lehmer's direction by his son\nDerrick H Lehmer\n, national research fellow, consists of a shaft on which thirty gears of\n100\nteeth each are set. Meshing with these gears are thirty other gears with a varying number of teeth, depending on the prime numbers from\n1\nto\n127\n.\nUnder each tooth in this second series of gears is a small hole. When the machine is set up and ready for use, some of these holes are plugged and others are open. A beam of light is cast on the side of the machine and then it is set in motion by means of an electric motor.\nThe main shaft gears all revolve at the same speed, but the gears meshing with them revolve at different speeds because of the varying number of teeth. When in the course of perhaps hundreds of thousands of revolutions one hole in each wheel reaches the same point at the same time, when thirty holes are lined up, in other words, the beam of light goes straight through the machine, strikes a sensitive photo-electric plate and stops the machine instantly.\nA little counter which records the number of revolutions made by the main shaft, gives a number from which the factors of the large number under analysis can readily be obtained.\nOutside mathematics Lehmer had several interests which are described in the obituary produced by Berkeley:-\nHis scholarly interest was mainly in the field of mathematics, avocational pursuits carrying him into the domain of music and poetry. His friends thus recognized two strains in his nature. The Derrick strain, if one may so indicate his descent from Hessian stock, accounts for his being a professor of mathematics and at one time Research Assistant of the Carnegie Institution of Washington, where among other things he made \"Factor Tables for the First Ten Millions.\" The Norman strain in him accounts for his love of belles lettres, his creative work in the fields of music and poetry, the songs and operas he composed and the poems he wrote.\nLet us give a few more details of Lehmer's literary and musical achievements which are referred to in the above quote. He wrote a play\nThe Crystal Gazers\nin\n1936\nwhich was never published. This play concerns spirit conjuring and alchemy, and recounts the story of how Edward Kelly convinced the mathematician\nJohn Dee\nthat he could contact the spirit world. Lehmer wrote two operas:\nThe Necklace of the Sun : A Mayan Drama\nhad its premiere at the Scottish Rite Auditorium, Oakland, on\n28\nFebruary\n1935\n. It was also performed in San Francisco. A second opera\nThe Harvest\n, which had a Red Indian theme, had been performed at the Little Theatre, Palace of the Legion of Honor in San Francisco on\n14\nand\n17\nOctober\n1933\n. He also published many collections of songs which he composed including\nSeven Indian Songs from the Yosemite Valley\n(1924)\n,\nDown the stream and other Indian songs\n(1927)\n,\nIndian camp-fire songs\n(1930)\n,\nIndian songs from the Northland\n(1931)\n,\nFingers of the sun and other Indian songs from the Sierra slopes\n(1931)\n,\nSongs from the Mesas\n(1932)\n,\nSongs from the Tundras\n(1932)\n,\nThe Ballad of San Francisco Bay\n(1937)\n, and\nFive Little songs\n(1937)\n. He also wrote\nFightery Dick\nand other poems.\nLehmer received many honours for his mathematical work in number theory. He was awarded an honorary D.Sc. from the University of Nebraska in\n1932\n. He was a member of many learned societies, including the\nAmerican Mathematical Society\n; the\nMathematical Association of America\n;\nCircolo Matematico di Palermo\n; the American Anthropological Association; the Poetry Society of America; the Poetry Society of London; the California Writers' Club; the Bookfellows; the Nebraska Writers Guild; the League of Western Writers; and the American Society for Comparative Musicology. He was a fellow of the American Association for the Advancement of Science and he served as vice-president and trustee of the\nMathematical Association of America\n.\nLehmer died at his home,\n2736\nRegent Street, Berkeley, after an extended illness.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}