{
  "nome_completo": "Diederik Johannes Korteweg",
  "nome_curto": "Diederik Korteweg",
  "ano_nascimento": "1848",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Korteweg/",
  "lugar_nascimento": "'sHertogenbosch, Netherlands",
  "lugar_morte": "Amsterdam, Netherlands",
  "biografia": "Diederik Korteweg\n's father was a judge in 'sHertogenbosch in the south of The Netherlands. It was in that town that Diederik attended schools, studying at a special academy which prepared students for a military career. However, he decided against a military career and, making the first of his changes of direction, he began his studies at the Polytechnical School at Delft. This School was founded as the Royal Academy in\n1842\nand, after being known as the Polytechnical School of Delft, it later became the Technical University of Delft. Korteweg originally intended to become an engineer but, although he maintained an interest in mechanics and other applications of mathematics throughout his life, his love of mathematics made him change direction for the second time when he was not enjoying the technical courses at Delft. He decided to terminate his course and pull out of his studies so that he could concentrate on mathematics. He then enrolled in mathematics and mechanics courses qualifying him to become a high school teacher.\nHe did indeed become a secondary school teacher, teaching in schools at Tilberg and Breda before continuing his university studies. One might reasonably ask why Korteweg did not immediately begin university studies after terminating his studies at Delft. The reason is simple, he did not have the necessary qualifications to enter a university even though he had already begun to publish papers while he worked as a school teacher. He worked for the necessary diploma while doing a full time teaching job receiving the qualification in\n1876\n. He then entered the University of Utrecht where he spent a year studying mathematics before moving to the University of Amsterdam to work for his doctorate.\nThe University of Amsterdam was an ancient educational establishment founded as in\n1632\n. However the university had only just been granted the right to award doctorates before Korteweg entered in\n1877\n. He was taught by Johannes Diederik van der Waals, whom he first got to know during his time as a school teacher. Van der Waals had been appointed professor of physics at the University of Amsterdam in\n1877\nand he acted as Korteweg's supervisor. He received his doctorate on\n12\nJuly\n1878\nfor his dissertation\nOn the propagation of waves in elastic tubes\n. It was achieved in a remarkably short period, of the order of six months, and as a consequence his was the first Ph.D. awarded by the University of Amsterdam. He remained at Amsterdam becoming the professor of mathematics, mechanics and astronomy there in September\n1881\n. His inaugural address was\nMathematics as an Auxiliary Discipline\nand it was very interesting in giving many insights into how he saw the role of mathematics in applications to science and statistics. He held this post until he retired in\n1918\n.\nKorteweg's main work was in applied mathematics. As we mentioned above, his doctoral dissertation was on the velocity of wave propagation in elastic tubes. In fact this problem came from a medical question, being motivated by physiological experiments on the way that blood behaves in arteries as a result of waves created by the beating heart. His subsequent work included studies of electricity,\nstatistical mechanics\n, thermodynamics and further contributions to wave propagation. He also collaborated with van der Waals, publishing joint papers with him on topics in electricity, statistical mechanics, and thermodynamics. Van der Waals was working on the phase separation of binary mixtures, and Korteweg supplied the necessary mathematical input with his work on folds on surfaces in a series of papers between\n1891\nand\n1903\n, such as\nOver plooipunten en bijbehorende plooien in de nabijheid der randlijnen van het E'-vlak van Van der Waals\nⓉ\n(\nPlait points and corresponding plaits in the neighbourhood of the sides of the E'-surface of Van der Waals\n)\n(1902)\n.\nHe established a criterion for the stability of orbits of particles moving under a central force. In the theory of stress Korteweg's name is attached to the 'Korteweg stress'. On this topic he published\nSur la forme que prennent les équations du mouvement des fluids si l'on tient compte des forces capillaires causés par les variations de densité\nⓉ\n(\nOn the form the equations of motions of fluids assume if account is taken of the capillary forces caused by density variations\n)\nin\n1901\n. He also studied a stationary wave in a rectangular canal. He is remembered in particular for the Korteweg -\nde Vries\nequation on solitary waves, a courageous topic to attack since many mathematicians, including\nStokes\n, were convinced such waves could not exist. In\n1894\nGustav de Vries\nwrote a dissertation\nBijdrage tot de kennis der lange golven\nⓉ\n(\nContribution to the knowledge of long waves\n)\nsupervised by Korteweg. The results of this thesis were written up for publication in a joint paper\nOn the Change of Form of Long Waves advancing in a Rectangular Canal and on a New Type of Long Stationary Waves\npublished in the\nPhilosophical Magazine\nin\n1895\n. They found explicit, closed-form, travelling-wave solutions to the Korteweg -\nde Vries\nequation that decay rapidly. In fact this work is extremely important, but sadly this was not recognised at the time and it was over\n70\nyears before this fundamental research led to the rapidly expanding research topic of 'solitons'.\nKorteweg's books studying\nHuygens\ncontributed greatly to the history of mathematics. He was also the editor of\nHuygens\ncomplete works, a project he worked on from\n1911\nto\n1927\n. It is a remarkable contribution to scholarship for he showed clearly that through his monumental efforts he had come to understand the way in which\nHuygens\nthought about mathematics. Coming out of this work is Korteweg's paper\nHuygens' sympathetic clocks and related phenomena\npublished in the\nProceedings of the Royal Academy of Amsterdam\nin\n1905\n.\nGustav de Vries\nwas certainly not the only one of Korteweg's doctoral students, nor is he the best known. That must surely be\nLuitzen Brouwer\nwho graduated with his doctorate in\n1907\n. It is worth realising the breadth of Korteweg as a mathematician when one understands that most of his work is on applied mathematical topics, yet he supervised\nBrouwer\n's thesis on the foundations of mathematics. We can mention, again showing Korteweg's versatility, his pure mathematics work on algebraic equations in papers such as\nSur un théorème remarquable, qui se rapporte à la théorie des équations algébriques à paramètres réels, dont toutes les racines restent constamment réelles\nⓉ\n(\nOn a remarkable theorem, which relates to the theory of algebraic equations with real parametersfor which all the roots are real constants\n)\n(1900)\n. He also studied properties of surfaces in the neighbourhood of singular points.\nKorteweg showed a similar versatility in his teaching, with his usual courses being analytic and projective geometry, mechanics, astronomy and\nprobability theory\n. He put a very large effort into his lectures and expected his students to do likewise.\nLet us try to remove any possible confusion by explaining that\nGustav de Vries\nwas not  the only 'de Vries' that Korteweg supervised, for his later student Hendrick de Vries was awarded his doctorate in\n1901\n. Another student to single out from a list of around\n20\nstudents, is H J Beth who graduated with his doctorate in\n1910\n. Beth is the father of the logician Evert W Beth\n(1908\n-\n64)\n.\nKorteweg was a member of the Koninklijke Nederlandse Akademie van Wetenschappen\n(\nRoyal Netherlands Academy of Sciences\n)\nfor sixty years, being elected in\n1881\n, and of the Wiskundig Genootschap\n(\nthe\nDutch Mathematical Society\n)\nfor\n75\nyears, being on the organising committee for\n58\nyears. He served as an editor of the\nNieuw Archief voor Wiskunde\nfrom\n1897\nto\n1941\n.",
  "math_areas": [
    "Statistics"
  ]
}