{
  "nome_completo": "Dimitrie D Stancu",
  "nome_curto": "Dimitrei D Stancu",
  "ano_nascimento": "1927",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stancu/",
  "lugar_nascimento": "Calacea, Timis county, Romania",
  "lugar_morte": "Cluj, Romania",
  "biografia": "Dimitrei D Stancu\nwas born at the village of Calacea, Timis county in February\n1927\n. Calacea is around\n25\nkm north of Timișoara, the capital of Timis county. It became part of Romania following World War I so was Romanian at the time that Dimitrie\n(\nknown as Didi to his friends and colleagues\n)\nwas born there. His family were farmers but his early years were ones of great difficulty. His father died when he was a baby and his mother had to earn a living so she worked as a shepherd. The family were unable to care for Dimitrie, so his oldest brother, who worked as a painter in the city of Arad, took him to the Regina Maria orphanage in Arad where he was brought up. The first two years of his primary school studies,\n1937\n-\n39\n, were in the Regina Maria orphanage and his next two years were spent at the Sânnicolaul Mic. After completing his primary education, in\n1941\nhe went to the\nGymnasium\nin \"New Arad\" where he spent two years before completing his schooling at the Moise Nicoara in the years\n1943\n-\n47\n. This school was founded in\n1873\nwhen Arad was part of Austria-Hungary and only received the name \"Moise Nicoara\" in\n1919\nwhen Transylvania became part of Romania. His time at school was, however, difficult as the authors of\n[\n3\n]\npoint out:-\nIn his schooling he had many difficulties being an orphan and very poor, but with the help of his mathematics teachers he succeeded in making progress in his studies at the prestigious Lyceum \"Moise Nicoara\" from the large city of Arad.\nStancu entered the Faculty of Mathematics of the Babeș University of Cluj in\n1947\n. At the time Stancu began his university studies, there were two universities in Cluj. The Romanian University of Cluj which had been the King Ferdinand I University, had been renamed Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\nwhile the Hungarian University of Cluj was named the\nBolyai\nUniversity\n(\nafter the mathematician\nJános Bolyai\n)\n. The two universities combined to become the Babeș-\nBolyai\nUniversity in\n1959\n. Stancu had a very successful undergraduate career in Cluj, where he was taught by\nTiberiu Popoviciu\n. Because of Stancu's obvious abilities,\nTiberiu Popoviciu\nencouraged him to undertake research in mathematics. He graduated with his first degree in\n1951\n. Because of his remarkable achievements during his undergraduate studies, in\n1951\nStancu was appointed as assistant to the Chair of Mathematical Analysis, held at that time by the academician\nTiberiu Popoviciu\n. At the same time, Stancu began undertaking research for his Ph.D. thesis advised by\nTiberiu Popoviciu\n. He was awarded his doctorate in Mathematics in\n1956\nwith a thesis entitled\nA study of the polynomial interpolation of functions of several variables, with application to the numerical differentiation and integration; methods for evaluating the remainders\n(\nRomanian\n)\n.\nStancu published a series of papers related to the work of his doctoral thesis in\n1956\n-\n57\n. The first of these was\nContribution to the partial numerical differentiation of functions of two and several variables\n(\nRomanian\n)\n(1956)\n. Emil Grosswald writes in a review:-\nWhile there is a large literature on the numerical differentiation of functions of a single variable, the corresponding problem for several variables has received less attention. The author establishes such formulae, giving approximate values of the partial derivatives, by linear combinations of values of the function and its successive, lower order, partial derivatives at a finite set of points. ... The author gives the degrees of exactness for his formulae of numerical partial differentiation.\nNewton\n's, alternatively also\nLagrange\n's, interpolation polynomials are taken as starting points in the proofs. These are elementary in character, but rather complicated. In some of them, only the cases of\n2\nor\n3\nvariables are worked out, in order to keep notations reasonably simple. In the case of lattice points with unequal distances, use is made of divided differences. Somewhat simpler results are found in the case of equidistant lattice points ...\nSome other papers in this series were\nOn polynomial interpolation formulas for functions of several variables\n(\nRomanian\n)\n(1957)\n,\nGeneralisation of some interpolation formulas for functions of several variables and certain thoughts on the numerical integration formula of Gauss\n(\nRomanian\n)\n(1957)\n,\nA generalisation of the Gauss-Christoffel quadrature formula\n(\nRomanian\n)\n(1957)\n,\nGeneralisation of certain interpolation formulas for functions of several variables\n(\nRomanian\n)\n(1957)\n,\nSur une classe de polinômes orthogonaux et sur des formules générales de quadrature à nombre minimum de termes\nⓉ\n(\nOn an orthogonal class of polynomials and of the general formulas of quadrature to a minimum number of terms\n)\n(1957)\n,\nContributions to the numerical integration of functions of several variables\n(\nRomanian\n)\n(1957)\n, and\nOn the Hermite interpolation formula and on some of its applications\n(\nRomanian\n)\n(1957)\n.\nDuring the academic year\n1961\n-\n1962\nStancu was awarded a fellowship from the Romanian Ministry of Education to undertake research in the Department of Numerical Analysis of the University of Wisconsin at Madison in the United States. This department was led by Preston C Hammer\n(1913\n-\n1986)\nand the year he spent there proved important for the future development of Stancu's career. After his return to Romania, he was named as a full professor in\n1968\nin the Numerical and Statistical Calculus Chair from the Faculty of Mathematics at the Babeș-Bolyai University of Cluj.\nDimitrie D Stancu taught high level courses on Mathematical Analysis, Numerical Analysis, Approximation Theory, Probability Theory, etc. He was Vice-Dean of the Faculty of Mathematics and, for many years, Head of the Numerical and Statistical Calculus Chair.\nDimitrie D Stancu's research activity was decisively influenced by his scientific cooperation with academician\nTiberiu Popoviciu\n. Stancu's main research topics were: interpolation theory, derivative and numerical integration, orthogonal polynomials, spline functions, approximation of the functions by linear and positive operators, probabilistic and combinatorial methods in approximation theory. Stancu devoted part of his research work to Numerical Analysis in connection with the new subject of Computer Science. Stancu was the thesis advisor of\n41\nPh.D. students in the field of Numerical Analysis and Approximation Theory. He published more than\n120\nresearch papers which have had a strong international impact.\nMore than\n200\npapers have the name of Dimitrie D Stancu in their title and the concept of a Stancu operator is nowadays a very well-known notion in the mathematics literature. What are today called the '\nBernstein\n-Stancu operators' were introduced by Stancu in\n1968\nin his paper\nApproximation of functions by a new class of linear polynomial operators\nand also studied in his paper\nApproximation of functions by means of a new generalized Bernstein operator\n(1983)\n. What are today called 'Stancu beta operators' were introduced by Stancu in his paper\nOn the Beta approximation operators of second kind\n(1995)\n. Along with co-authors Petru Blaga and Gheorghe Coman, Stancu wrote the two-volume\n850\n-page treatise\nNumerical analysis and approximation theory\n(\nRomanian\n)\n(2001\n,\n2002)\n.\nStancu was an invited lecturer at the 'SIAM Symposium on Approximation' at Gatlinburg, Tennessee in October\n1963\nand at meetings of the American Mathematical Society in Milwaukee, Chicago and New York. In\n2000\nStancu presented an invited paper to the conference 'Trends in Approximation Theory' in Nashville, Tennessee. While in the United States he was invited to lecture at several American Universities: Ohio State University at Columbus, Ohio, the University of South Carolina at Columbia, South Carolina, Vanderbilt University at Nashville, Tennessee, and PACE University at Pleasantville, New York. He attended a large number of conferences, giving lectures at many of them. These include meetings in Germany at Stuttgart, Hannover, Hamburg, Göttingen, Dortmund, Münster, Siegen, Würzburg, Berlin and Oberwolfach, in Italy at Rome, Naples, Potenza and L'Aquila, in England at Lancaster\n(\nwhere he gave the lecture 'Probabilistic methods in the theory of approximation of functions of several variables by linear positive operators'\n)\nand Durham\n(\nwhere he gave the lecture 'Approximation of bivariate functions by means of some Bernstein-type operators'\n)\n, in Hungary at Budapest, in France at Paris, in Bulgaria at Sofia and Varna, in Poland at Warsaw and in the Czech Republic at Brno.\nIn\n1995\nthe \"Lucian Blaga\" University of Sibiu awarded Stancu an honorary doctorate. He was also awarded an honorary doctorate by the \"North University\" of Baia Mare. He was elected an honorary member of the\nRomanian Academy of Sciences\nin\n1999\n. He also was an active collaborator of the\nTiberiu Popoviciu\nInstitute on Computing of the\nRomanian Academy of Sciences\n. He was an editor of\nStudia. Universitatis Babeș-Bolyai Mathematica\n, the Italian journal\nCalcolo. A Quarterly on Numerical Analysis and Theory of Computation\n, and editor-in-chief of the Romanian journal\nRevue d'Analyse Numérique et de Théorie de l'Approximation\n. In May\n2002\nthe 'International Symposium on Numerical Analysis and Approximation Theory' was organised at the Babeș-Bolyai University of Cluj to honour Stancu's\n75\nth\nbirthday. The 'International Seminar on Approximation Theory and its Applications' was held at the Lucian Blaga University of Sibiu,\n29\nMay-\n1\nJune\n2014\n\"in honour of the memory of Academician Professor Dimitrie D Stancu and his lifetime contributions to the Approximation Theory\". At this meeting, lectures included: Heiner Gonska, 'Academician Prof. Dr. D. D. Stancu\n(1927\n-\n2014)\n: his influence on my mathematical work'; Voichita Adriana Radu, 'Academician Professor D. D. Stancu : a life time dedicated to the numerical analysis and theory of approximation'; and Andrei Vernescu, 'Acad. Prof. D. D. Stancu, a respectful remember and a deep homage'.\nDimitrie D Stancu was married to Felicia, who was also a mathematician teaching at the Babeș-Bolyai University of Cluj. They had two daughters, Angela Stancu\n(\nborn\n1957)\nand Mirela\n(\nborn\n1958)\n, who both became secondary school teachers of mathematics. The authors of\n[\n2\n]\nwrite\n(\nwe have changed their words to the past tense\n)\n:-\nHe had the extraordinary ability to touch deeply the lives of all whom he associated, whatever their background and experience. He had a warm and sensitive personality. One of the really remarkable things about Dimitrie D Stancu\n'\ns commitment to mathematics was that he knew how to hand it on others. In this way he inspired many students and colleagues to do some of their best work. His door was always open to them. Professor D D Stancu was an important - a very influential - mathematician. He was a mathematician whose work possessed power, grace and beauty. He was a wonderful human being and a brilliant and profound mathematician.\nStancu died at Cluj-Napoca in April\n2014\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Statistics"
  ]
}