{
  "nome_completo": "Dinostratus",
  "nome_curto": "Dinostratus",
  "ano_nascimento": "390 BC",
  "ano_morte": "320 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dinostratus/",
  "lugar_nascimento": null,
  "lugar_morte": null,
  "biografia": "Dinostratus\nis mentioned by\nProclus\nwho says\n(\nsee for example\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nAmyclas of Heraclea, one of the associates of\nPlato\n, and\nMenaechmus\n, a pupil of\nEudoxus\nwho had studied with\nPlato\n, and his brother Dinostratus made the whole of geometry still more perfect.\nIt is usually claimed that Dinostratus used the quadratrix, discovered by\nHippias\n, to solve the problem of\nsquaring the circle\n.\nPappus\ntells us\n(\nsee for example\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nFor the squaring of the circle there was used by Dinostratus,\nNicomedes\nand certain other later persons a certain curve which took its name from this property, for it is called by them square-forming\n[\nin other words the quadratrix\n]\n.\nIt appears from this quote that\nHippias\ndiscovered the curve but that it was Dinostratus who was the first to use it to find a square equal in area to a given circle.\nProclus\n, who claims to be quoting from\nEudemus\n, writes\n(\nsee\n[\n1\n]\n)\n:-\nNicomedes\ntrisected\nany rectilinear angle by means of the conchoidal curves, of which he had handed down the origin, order, and properties, being himself the discoverer of their special characteristic. Others have done the same thing by means of the quadratrices of\nHippias\nand\nNicomedes\n.\nThis makes somewhat less convincing the claim that Dinostratus used the quadratrix, discovered by\nHippias\n, to square the circle since\nEudemus\ndoes not even mention Dinostratus. There is also a suggestion that\nHippias\nwrote a treatise on the quadratrix and if this is the case it seems hard to believe that he did not show how it could be used to square the circle.\nWhether Dinostratus was indeed the first to square the circle using the quadratrix seems almost irrelevant for, as Bulmer-Thomas writes in\n[\n1\n]\n:-\n... posterity has firmly associated the name of Dinostratus with the\nquadrature\nof the circle by means of the quadratrix.\nPappus\nrelates how the quadratrix was used to square the circle. The construction of the curve is described in the article on\nHippias\n. The quadratrix meets the line\nA\nD\nAD\nA\nD\nin the point\nG\nG\nG\nand\narcÂ\nB\nE\nD\nA\nB\n=\nA\nB\nA\nG\n\\Large\\frac{\\text{arc } BED}{AB}\\normalsize = \\Large\\frac{AB}{AG}\nA\nB\narcÂ\nB\nE\nD\nâ\n=\nA\nG\nA\nB\nâ\nso the length of the circumference of the circle is expressed in terms of the lengths of straight lines. This leads to the construction of a square equal to the circle.\nPappus\nreports that\nSporus\nwas critical of this construction. He had two objections, the first of which relates to the construction of the quadratrix itself\n(\nsee the article on\nHippias\n)\n. The second objection relates to Dinostratus's use of the quadratrix to square the circle.\nSporus\nclaims that the moving line\nB\nâ²\nC\nâ²\nB'C'\nB\nâ²\nC\nâ²\nnever cuts the line\nA\nD\nAD\nA\nD\nand so the point\nG\nG\nG\nis not determined. The point\nG\nG\nG\ncan only be found as a limit. There is no doubt that\nSporus\nis quite correct with his objection.\nDinostratus probably did much more work on geometry but nothing is known of it.",
  "math_areas": [
    "Geometry"
  ]
}