{
  "nome_completo": "Dionysodorus",
  "nome_curto": "Dionysodorus",
  "ano_nascimento": "250 BC",
  "ano_morte": "190 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dionysodorus/",
  "lugar_nascimento": "Caunus, Caria, Asia Minor (now in Turkey)",
  "lugar_morte": null,
  "biografia": "There is certainly more than one mathematician called\nDionysodorus\nand this does make it a little difficult in deciding exactly what was studied by each.\nStrabo\n, the Greek geographer and historian\n(\nabout\n64\nBC - about\n24\nAD\n)\n, describes a mathematician named Dionysodorus who was born in Amisene, Pontus in northeastern Anatolia on the Black Sea.\nThe Dionysodorus we are interested in here is the mathematician Dionysodorus whom\nEutocius\nstates solved the problem of the\ncubic equation\nusing the intersection of a\nparabola\nand a\nhyperbola\n. This was related to a problem of\nArchimedes\ngiven in\nOn the Sphere and Cylinder\n. It was thought until early this century that the Dionysodorus to whom\nEutocius\nrefers, was Dionysodorus of Amisene described by Strabo.\nThere is a second Dionysodorus who appears in the writings of\nPliny\n. In\nNatural history\nPliny mentions a certain Dionysodorus who measured the earth's radius and gave the value\n42000\nstades. Strabo distinguishes this Dionysodorus from Dionysodorus of Amisene and it is now thought that the Dionysodorus referred to by Pliny is not the mathematician who solved the problem of the cubic equation. Interestingly Pliny died as a result of the eruption of Vesuvius in\n79\nAD and it is as a consequence of this eruption that new information regarding a mathematician Dionysodorus was published in\n1900\n.\nThis new information was found by W Cronert in a papyrus found at Herculaneum. When Vesuvius erupted in\n79\nAD, Herculaneum together with Pompeii and Stabiae, was destroyed. Herculaneum was buried by a compact mass of material about\n16\nmetres deep which preserved the city until excavations began in the\n18\nth\ncentury. Special conditions of humidity of the ground conserved wood, cloth, food, and in particular papyri which give us important information. One papyrus states\n[\n3\n]\n:-\nPhilonides was a pupil, first of Eudemus, and afterwards of Dionysodorus, the son of Dionysodorus the Caunian.\nEudemus is Eudemus of Pergamum whom\nApollonius\ndedicated two books of his\nConics\nand, in the introduction to Book II, asks Eudemus to show the book to Philonides. We can date Dionysodorus from this information as just a little younger than\nApollonius\n. There is another interesting comment in the papyrus which states that Philonides published some of the lectures by his teacher Dionysodorus.\nShortly after Cronert published details of the fragments of papyri relating to Dionysodorus which had been found at Herculaneum, Schmidt published a commentary on the material in which he argued convincingly that the Dionysodorus who solved the cubic equation using the intersection of a parabola and a hyperbola was the Dionysodorus of Caunus referred to in the Herculaneum papyrus. Caunus is in Caria and is now in Turkey. It is close to Perga in Pamphylia where\nApollonius\nwas born.\nThe method which\nEutocius\ndescribes to cut a sphere in a given ratio, crediting it to Dionysodorus, uses a parabola and a rectangular hyperbola. It is a beautiful construction and in the description that follows we essentially follow the method described by\nEutocius\n(\nsee also\n[\n1\n]\nand\n[\n3\n]\n)\n.\nLet\nA\nA\n′\nAA'\nA\nA\n′\nbe the diameter of the sphere centre\nO\nO\nO\n. We wish to find a plane which divides the sphere in the ratio\nm\n:\nn\nm : n\nm\n:\nn\n. Take\nF\nF\nF\non\nA\n′\nA\nA'A\nA\n′\nA\nproduced so that\nF\nA\n=\nA\nO\nFA = AO\nF\nA\n=\nA\nO\n. Let\nA\nG\nAG\nA\nG\nbe perpendicular to\nA\nA\n′\nAA'\nA\nA\n′\nwhere\nG\nG\nG\nis the point with\nF\nA\n:\nA\nG\n=\n(\nm\n+\nn\n)\n:\nn\nFA : AG = (m+n) : n\nF\nA\n:\nA\nG\n=\n(\nm\n+\nn\n)\n:\nn\n. Let H be the point on\nA\nG\nAG\nA\nG\nwith\nA\nH\n2\n=\nF\nA\n.\nA\nG\nAH^{2}= FA.AG\nA\nH\n2\n=\nF\nA\n.\nA\nG\nand draw the parabola with vertex at\nF\nF\nF\nthrough\nH\nH\nH\n. Draw the rectangular hyperbola through\nG\nG\nG\nwith the\nx\nx\nx\nand\ny\ny\ny\naxes as its\nasymptotes\n. Let the hyperbola cut the parabola at\nP\nP\nP\nand draw\nP\nM\nPM\nP\nM\nperpendicular to\nA\nA\n′\nAA'\nA\nA\n′\n. Then Dionysodorus proved that the plane through\nM\nM\nM\nwith\nA\nA\n′\nAA'\nA\nA\n′\nas its\nnormal\nwill cut the sphere in the given ratio\nm\n:\nn\nm : n\nm\n:\nn\n.\nHeron\nalso mentions Dionysodorus as the author of a work\nOn the Tore\nwhich, because of the subject matter, must almost certainly be written by the Dionysodorus we are describing here. In this work Dionysodorus calculates the volume of a torus and shows that it is equal to the product of the area of the generating circle with the length of the circle traced by its centre rotating about the axis of revolution. It is clear that Dionysodorus used the methods of\nArchimedes\nin proving his result.\nDionysodorus is believed to have invented a conical sundial. The report fails to make it clear which Dionysodorus this is, but the fact that the Dionysodorus described here worked on conic sections makes it likely that he is also the person to have studied a conical sundial. In\n[\n2\n]\nthe likely form that Dionysodorus's sundial would take is discussed. A conjectured reconstruction is given in\n[\n1\n]\n.",
  "math_areas": []
}