{
  "nome_completo": "Dmitrii Viktorovich Anosov",
  "nome_curto": "Dmitrii Viktorovich Anosov",
  "ano_nascimento": "1936",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anosov/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Dmitrii Viktorovich Anosov\n's parents were Viktor Yakovlevich Anosov and Nina\nKonstantinovna Voskresenskaya. Both worked at the Institute of General and Inorganic Chemistry in Moscow. Dmitrii Viktorovich showed his abilities while at high school, entering the Physics Moscow Olympiad and the Mathematics Moscow Olympiad on several occasions. He achieved outstanding results, his highest ranking being second in each of the competitions. He entered the Faculty of Mechanics and Mathematics at Moscow State University in\n1953\nand there he was taught by outstanding teachers including\nLev Semenovich Pontryagin\n, E F Mishchenko and\nM M Postnikov\n. He graduated in\n1958\nand then undertook research for three years at the Mathematical Institute of the\nUSSR Academy of Sciences\n. His work was supervised by\nPontryagin\nand during this period Anosov published a number of papers including:\nOn stability of equilibrium states of relay systems\n(\nRussian\n)\n(1959)\n;\nAveraging in systems of ordinary differential equations with rapidly oscillating solutions\n(\nRussian\n)\n(1960)\n; and\nLimit cycles of systems of differential equations with small parameters in the highest derivatives\n(\nRussian\n)\n(1960)\n. Anosov defended his thesis on averaging in systems of ordinary differential equations at Moscow University in\n1961\n.\nAn event happened in\n1961\nwhich changed the direction of Anosov's research. He was influenced by\nStephen Smale\nwho was an invited speaker at the\nSymposium on non-linear oscillations\nat Kiev in\n1961\n. In\n[\n1\n]\nAnosov speaks of a moment when:-\n... the world turned upside down for me, and a new life began\n[\nhaving read\nSmale\n's announcement of\n]\na structurally stable homeomorphism with an infinite number of periodic points,\nwhile he was standing in a queue to register for the Kiev conference. The authors of\n[\n7\n]\nalso explain the background to this event:-\nBack in\n1961\nthere was an unexpected breakthrough in the theory of\ndynamical systems\n, when\nStephen Smale\nconstructed a structurally stable dynamical system given by a diffeomorphism of the two-dimensional sphere and possessing an infinite set of periodic points. This discovery\n(\nthe so-called '\nSmale\nhorseshoe'\n)\nopened completely new aspects in the problem of describing the structurally stable systems that appeared in the classical work of A A Andronov and\nL S Pontryagin\n(1937)\n. At the same time,\nSmale\nmet with a group of young Soviet mathematicians, among them Dmitrii Anosov, a student of\nPontryagin\n, and mentioned some difficult unsolved problems, in particular, the problem of structural stability of hyperbolic automorphisms of a torus and geodesic flows on closed manifolds of negative curvature. It should be noted that Anosov was already the author of several papers, of which one, on averaging in multi-frequency systems, is still highly regarded today. Nevertheless, he easily switched his interests to\nSmale\n's problems, and in a year he had solved them as particular cases in his investigation of the U-systems he introduced, now called Anosov systems.\nSmale\n's discovery and its development by Anosov marked the beginning of the 'hyperbolic revolution' in mathematics.\nAnosov discovered a fundamental fact concerning the\nergodic theory\nof smooth dynamical systems, namely the absolute continuity of transversal foliations. His results on hyperbolic flows formed the content of his doctoral thesis\n(\nequivalent to the German\nhabilitation\n)\nwhich he defended in the Mathematical Institute of the\nUSSR Academy of Sciences\nin\n1965\n. The brilliance of his contributions led to him being awarded a 'Young Mathematician' prize by the\nMoscow Mathematical Society\nin\n1965\n. He published a\n200\npage monograph\nGeodesic flows on closed Riemannian manifolds of negative curvature\n(\nRussian\n)\nin\n1967\ncontaining a detailed exposition and complete proofs of his results concerning U-systems that he had announced earlier. The\nAmerican Mathematical Society\npublished an English translation of this book in\n1969\n.\nIn\n1968\nAnosov became a professor in the Department of Mechanics and Mathematics at Moscow State University where he taught for the rest of his career. He also worked at the\nSteklov\nMathematical Institute of the\nRussian Academy of Sciences\nin Moscow. In the\n1970\ns Anosov published papers such as\nExistence of smooth ergodic flows on smooth manifolds\n(\nRussian\n)\n(1974)\nand was an invited speaker at the International Congress of Mathematicians at Vancouver in\n1974\nwhen he gave the lecture\nGeodesics and Finsler geometry\n. His new approach to the problem of the existence of closed geodesies in Riemannian geometry led to him establishing important results in\nSome homotopies in a space of closed curves\n(\nRussian\n)\n(1980)\n. In\n1994\nhe published the monograph\nThe\nRiemann\n-\nHilbert\nproblem\nwritten jointly with\nAndrei Andreevich Bolibrukh\n. V V Chueshev writes:-\nHilbert\n's\n21\nst\nproblem\n(\nthe\nRiemann\n-\nHilbert\nproblem\n)\nbelongs to the theory of linear systems of ordinary differential equations in the complex domain: does there exist a Fuchsian system having these singularities and monodromy?\nHilbert\nwas convinced that such a system always exists. But in\n1989\nBolibrukh\ndiscovered a counterexample. The contemporary version of\nHilbert\n's\n21\nst\nproblem is to find conditions implying a positive or negative solution to the\nRiemann\n-\nHilbert\nproblem. The authors consider only the classical\nHilbert\n's\n21\nst\nproblem, but mention various modifications, generalizations and related problems, as well as all known results on the classical problem, both positive and negative, and prove some of the most important cases. The problem under consideration is of global character, but to study it one needs local theory, which goes back to\nFuchs\nand\nPoincaré\n, and a new local theory due to Levelt.\nIn\n2005\n, in collaboration with E V Zhuzhoma, Anosov published the monograph\nNonlocal asymptotic behavior of curves and leaves of laminations on universal coverings\nwhich develops:-\n...a method for constructing effective topological invariants of dynamical systems and foliations on two-manifolds that have nontrivial invariant sets or nontrivial invariant stable and unstable manifolds of points.\nLet us note that, in addition to his work on the analysis of manifolds, Anosov has written many historical and biographical articles. A look at his list of publications shows around\n25\nsuch articles. The authors of\n[\n7\n]\nalso mention Anosov's work with young mathematicians:-\nAnosov published a series of deep yet readable books\n(\nlike detective novels\n)\nfor high-school and college students. He finds time to work with people taking their 'first steps' in science. He not only gives talks at scientific conferences for young people, but also heads regional councils\n(\nfor example, the Small Academy in Obninsk\n)\n.\nHe continues to work\n(2009)\nat the Department of Differential Equations in the\nSteklov\nMathematical Institute and at present he is Head of Department and serves on the Academic Council of the Institute. He is also Chairman of the Dissertation Council covering the areas of Differential equations, Mathematical physics, and Theoretical physics.\nAnosov has received many honours for his achievements. For example he was awarded the State Prize in\n1976\nand was elected to the\nUSSR Academy of Sciences\nin\n1990\n. He was an invited lecturer at the International Congress of Mathematicians in Moscow in\n1966\n, and again\n(\nas we mentioned above\n)\nat the Congress in Vancouver in\n1974\n. He also has been involved with the International Congresses of Mathematicians in other capacities, being a member of the panel to decide the scientific programme in the section \"Dynamical systems and differential equations\" for three of the Congresses, and on two of these occasions he chaired the panel.\nLet us end with the modest comment made by Anosov in\n[\n1\n]\n. He notes that his papers have not received a large number of citations and asks:-\nWell then, am I famous in the mathematical world or not?\nHe then gives his own answer:-\n... it became my best achievement in mathematics that I explained to\nSmale\nwhat his achievement amounted to.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}