{
  "nome_completo": "Dmitry Aleksandrovich Grave",
  "nome_curto": "Dmitry Aleksandrovich Grave",
  "ano_nascimento": "1863",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grave/",
  "lugar_nascimento": "Kirillov, Novgorod gubernia, Russia",
  "lugar_morte": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "biografia": "Dmitry Aleksandrovich Grave\n's parents were Barbara Leonidivna and Aleksandr Ivanovich Grave who was a member of the local gentry. The family, consisting of Dmitry Aleksandrovich, his parents and two sisters, lived in the town of Kirillov, about\n500\nkm east of St Petersburg. Their home was a one-story wooden house on the shore of Lake Siverskoye and it was in this house that Dmitry Aleksandrovich had been born. The town was dominated by the Kirillo-Belozersky monastery and Dmitry Aleksandrovich's childhood memories were of this monastery, the historic town and its people. He attended primary school in Kirillov where he was taught by Vitaly A Vasiliev who was an excellent teacher, gave the young boy much encouragement, and awakened in him a passion for mathematics.\nWhen he was seven years old, in\n1871\n, tragedy struck the family when his father died in a duel. After this sad event, which also left the family in some financial difficulty, his mother left Kirillov, taking the young boy and his sisters to live in St Petersburg. There, beginning in\n1873\n, he attended a private school run by the teacher F F Bychkova. His performance at the school was remarkable and he completed his studies in\n1881\n, three years early, winning the gold medal. In the same year, he began his studies in the Faculty of Physics and Mathematics at the University of St Petersburg. Grave was very talented as a musician and he would have liked to have studied music at the conservatory in parallel with his mathematical studies at the university. However, this would have required a level of financial support that his family were unable to give so he had to give up the idea of formally studying music.\nAt university, he studied under\nPafnuty Lvovich Chebyshev\nand his pupils\nAleksandr Nikolaevich Korkin\n,\nEgor Ivanovich Zolotarev\nand\nAndrei Andreyevich Markov\n. Grave spoke highly of\nChebyshev\n's teaching\n[\n3\n]\n:-\nChebyshev\nwas a wonderful lecturer. His courses were very short. As soon as the bell sounded, he immediately dropped the chalk, and, limping, left the auditorium. On the other hand he was always punctual and not late for classes. Particularly interesting were his digressions when he told us about what he had spoken outside the country or about the response of Hermite or others. Then the whole auditorium strained not to miss a word.\nHe was much influenced by\nChebyshev\n's advice that:-\n... we should not be engaged in what is interesting and curious, but rather what is important and necessary.\nGrave graduated with his first degree in\n1885\n, having written a dissertation\nOn minimal surfaces\n, which was published in the\nNotes of the Physics and Mathematics Association of St Petersburg University Students\n. He had already begun research while an undergraduate and wanted to remain at the university to train to become a professor. However, the family was poor and, in order to support his mother and sister, he had to earn money by giving private lessons and even doing odd jobs. He obtained his masters degree in\n1889\n(\nequivalent to a Ph.D.\n)\nfor his thesis\nOn the Integration of Partial Differential Equations of the First Order\n(\nRussian\n)\nand, in the autumn of that year, began teaching at the University of St Petersburg. For his Master's Degree, Grave had undertaken work on\nJacobi\n's methods for the\nthree body problem\n, a topic which had been suggested by\nKorkin\n. The methods he used in this work were based on those of\nJacobi\nand\nKorkin\n. At St Petersburg he taught analytic geometry, algebra, calculus I and a special course on the theory of surfaces. While undertaking research at the University, in\n1890\nhe began teaching higher mathematics at the Institute of Railway Engineers and in\n1892\nat the Women's University in St Petersburg where he taught until\n1896\n. He also began publishing books based on his lecture courses, for example:\nCourse of analytical geometry\n(1893)\n; and\nA course in differential calculus\n(1895)\n.\nHis doctorate\n(\nessentially equivalent to the\nhabilitation\n)\ninvolved a study of map projections, again a topic proposed by\nKorkin\n, the degree being awarded in\n1896\nfor the thesis\nOn the Main Problems of the Mathematical Theory of Construction of Geographical Maps\n(\nRussian\n)\n. The work, on equal area plane projections of the sphere, built on ideas of\nEuler\n,\nLagrange\nand\nChebyshev\n[\n1\n]\n:-\nIn it Grave presented a comprehensive study of equal-area plane projections of a sphere, with meridians and parallels being represented on the plane by straight lines and circumferences respectively.\nHowever, his health was poor at this time and he was advised by his doctors to move to a place with a milder climate than St Petersburg, preferably in the south. Grave took their advice and became professor at Kharkov in\n1897\nand, from\n1899\n, he was appointed professor at the Saint Vladimir University of Kiev, where he remained for the rest of his life. We note that this university was founded in\n1834\nand renamed the Taras Shevchenko University of Kiev in\n1939\n. He moved with his family\n(\nhis mother accompanied him\n)\nto Kiev in\n1901\nand he was appointed as a full professor at Kiev in\n1902\n.\nGrave is considered as the founder of the Kiev school of algebra which was to become the centre for algebra in the USSR. At Kiev Grave studied algebra and\nnumber theory\n. In particular he worked on\nGalois theory\n, ideals and equations of the fifth degree. He was a outstanding speaker, and a highly gifted teacher. He could explain deep mathematical ideas in a remarkably clear and simple way, and this talent led to a large number of students attending his lectures. He was able to give his students a passion for the mathematical sciences both from the clarity of his presentations and from his own obvious love for the subject. Grave made a major contribution to the development and improvement of teaching mathematical sciences in the University of Kiev. One of the innovations that he introduced was a compulsory number theory course, and he introduced a new style for seminars designed to train students. Among the courses he taught at Kiev we mention: \"Group theory\"; \"Elementary course in the theory of numbers\"; \"Elements of the theory of elliptic functions\"; \"Fundamentals of analytical geometry\"; \"Mathematics of insurance \"; and \"The elements of algebra\".\nNow we mentioned that, when he had been in St Petersburg, Grave had been advised to move south for health reasons. In fact the move to Kiev did not solve his health problems and, particularly during hard winters, he suffered serious illnesses. For instance in the winter of\n1904\nhe had a very bad cold which turned into an acute form of pulmonary tuberculosis. He was treated at different hospitals abroad, spending time on the shores of the Mediterranean Sea, spending some time on the French Riviera. During the time he spent on the French Riviera, he visited the local casino and became interested in probability while watching people playing roulette. This led Grave to think about applications of mathematics to insurance, and various actuarial problems. Back in Kiev he taught courses on these topics at the Commercial Institute and later wrote textbooks based on these courses.\nThe Revolution of\n1917\nhad some major effects on the development of mathematics in Russia and Ukraine. One effect was that mathematics in Ukraine was required to be more practical and algebra did not fit into this applied mathematics and technology dominated scene. Grave had to discontinue his famous Kiev algebra seminar in the\n1920\ns, give up teaching and research in algebra, and move to applied mathematics topics. It would not be before the\n1950\ns, well after Grave's death, that Kiev would again play a major role in algebra research. The five years\n1915\n-\n1920\nwere exceptionally difficult for Grave because, in addition to the political turmoil which tore the country apart, these were years of personal tragedy with the deaths of his children.\nGrave chaired the Applied Mathematics Commission of the\nAcademy of Sciences of Ukraine\nin the\n1920\ns. After Grave stopped work on algebra, he began to study mechanics and applied mathematics, but he never completely gave up algebra. From\n1924\nto\n1932\n, he headed the Department of Mechanics at the University of Kiev. During the\n1930\ns there were further changes to the Soviet educational system, and there was a fair amount of reorganisation. The Institute of Mathematics of the\nAcademy of Sciences\nwas founded in Kiev in\n1934\nand Grave served as the first director of the Institute from its foundation until his death in\n1939\n. His work at Institute of Mathematics was in addition to his chair at Kiev University which he continued to hold.\nAmong the many books that Grave wrote were\nTheory of Finite Groups\n(\nRussian\n)\n(1908)\n,\nA Primer in Number Theory\n(\nRussian\n)\n(1909\n-\n10)\n,\nArithmetical Theory of Algebraic Quantities\n(\nRussian\n)\n(1909\n-\n10)\n,\nElements of the theory of elliptic functions\n(\nRussian\n)\n(1910)\n,\nEncyclopaedia of Mathematics. An Essay on Its Current State\n(\nRussian\n)\n(1912)\n,\nElements of Higher Algebra\n(\nRussian\n)\n(1914)\n,\nTheory of pension funds\n(\nRussian\n)\n(1917)\n, and\nA Course in Algebraic Analysis\n(\nRussian\n)\n(1932)\n. He also studied the history of algebraic analysis and published two volumes of his\nTreatise on Algebraic Calculus\n(\nRussian\n)\nin\n1938\nand\n1939\n. His ambitious intention was to write a\n17\n-volume work on algebraic analysis but his death in\n1939\nmeant that only two volumes were published. As an example of the style of his books we record that a reviewer of\nElements of Higher Algebra\nwrites:-\nThis book made a good impression on me, combining the clarity seen in French textbooks with the rigour seen in German textbooks.\nAs well as this large number of good quality books, Grave published\n180\nscientific papers on a wide variety of pure and applied mathematical topics during his career. He also trained many mathematicians who went on to have leading roles in Soviet mathematics. For example, among his students we should mention:\nNaum Il'ich Akhiezer\n,\nNikolai Nikolaevich Bogolyubov\n,\nNikolai Grigorievich Chebotaryov\n,\nBoris Nikolaevich Delone\n,\nAlexander Markowich Ostrowski\n,\nOtto Yulyevich Schmidt\n, and\nYurii Dmitrievich Sokolov\n.\nAmong the honours that were given to him was election to the\nAcademy of Sciences of Ukraine\nin\n1919\n, election to the Shevchenko Scientific Society in\n1923\nand election to the\nAcademy of Sciences of the USSR\nin\n1929\n. In addition, he was awarded the Order of the Red Banner by the Soviet Government in\n1935\n. He is remembered in his home town of Kirillov where he has been honoured by having a street named after him. He died in Kiev and was buried in the Lukyanivske cemetery.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}