{
  "nome_completo": "Donald Harry Sadler",
  "nome_curto": "Donald Sadler",
  "ano_nascimento": "1908",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sadler/",
  "lugar_nascimento": "Dewsbury, Yorkshire, England",
  "lugar_morte": "Bexhill, Sussex, England",
  "biografia": "Donald Sadler\nwas the son of James Wright Sadler\n(1878\n-\n1948)\nand Gertrude Jane Needham\n(1881\n-\n1942)\n. James Sadler had been born and brought up in  Dudley, Worcestershire, the son of the commercial traveller Joseph W Sadler and his wife Harriet B Wright. James became a tailor and at the time of the\n1901\nEngland Census he was living in Nottingham with his uncle Thomas Sadler who was in woollen trade. James married the schoolteacher Gertrude in\n1904\n; she was the daughter of the woollen stocking maker Thomas Needham and his wife Jane. James and Gertrude' first son, Cyril Arthur Needham Sadler, was born in Lincoln on\n1\nDecember\n1904\nand baptised in Loughborough on\n21\nMay\n1905\n. Their second son Donald, the subject of this biography, was born and brought up in Dewsbury, Yorkshire.\nAfter attending primary school in Dewsbury, Donald entered the Wheelwright Grammar School in Dewsbury which had been founded and endowed in\n1724\nin the will of John Wheelwright. When Sadler began his studies at the school in\n1919\nthe headmaster was Leslie Sadler.\n(\nDespite being a 'Sadler' they were not related\n)\n. Leslie Sadler was a fine teacher and an excellent mathematician who had gained a double first class degree in mathematics and physics at Oxford University. He had a strong influence on Donald, encouraging him in his study of mathematics. This inspiring teaching helped Donald to win an Open Scholarship to Trinity College Cambridge in\n1926\n. Donald writes\n[\n15\n]\n:-\nAt Trinity my supervisor was\nJ E Littlewood\n, perhaps the greatest pure mathematician of the time; but his supervision of undergraduates was rather superficial and I essentially chose the actual courses for myself.\nAmong Sadler's fellow students, there were a number of outstanding mathematicians including\nDonald Coxeter\n,\nPatrick Du Val\nand\nHarold Davenport\n. Sadler was first class in Part\n1\nof the Mathematical Tripos since his performance in the second year examinations was outstanding, he was awarded a Senior Scholarship. He submitted the essay\nMoving Axes and Differential Geometry of Space-curves and Surfaces\nfor the Yeats and\nRouse-Ball\nEssay Prize. It was highly commended but did not win the prize; the winner was\nHarold Davenport\n. Sadler avoided physics courses since he had not studied any advanced physics at the Wheelwright Grammar School but did take astronomy courses such as Frederick Stratton's spherical astronomy. Stratton\n(1881\n-\n1960)\nwas the newly appointed Professor of Astrophysics at Cambridge. Sadler also took courses on orbit calculation and celestial mechanics given by William Smart, a lecturer in mathematics and the\nJohn Couch Adams\nAstronomer. Sadler writes\n[\n15\n]\n:-\n... I was not impressed by the latter - possibly because there were too few students ... I also thought that the treatment was too theoretical; I suspect that Smart had never himself computed an orbit from three observations. I also attended Smart's course on practical astronomy at the Observatory, and duly determined its position with a sextant, an artificial horizon and\n7\n-figure logarithms.\nSadler was First Class in Part\n2\nof the Mathematical Tripos in\n1929\nand, since his scholarship was for four years, decided to remain for another year. He attended\nEddington\n's lectures on relativity and began research on the periodicities of sunspots advised by\nUdny Yule\n. He also attended a course by\nHenry Baker\non dynamical problems in astronomy.\nDuring this fourth year at Cambridge, Sadler began to look for a job. Offered a post as a mathematical statistician by the chocolate manufacturer Rowntrees of York, he turned it down. The Nautical Almanac Office was at that time based in the Royal Naval College at Greenwich. The Superintendent was Leslie John Comrie who had been promoted to that position in\n1930\n. Comrie was an expert on numerical analysis and had developed punched card computing equipment to construct interpolating tables. William Smart, one of Sadler's lecturers at Cambridge, suggested to Comrie that Sadler would be a good person to appoint to the Nautical Almanac Office. Sadler received an invitation to attend for interview for a post and was offered a position as Temporary Assistant to Comrie which he accepted, beginning work on\n13\nOctober\n1930\n. Sadler learnt much from Comrie and was appointed Deputy Superintendent in\n1933\n. The London Gazette\n[\n10\n]\nreported:-\nJune\n26\n,\n1933\n. After Open Competition. Admiralty: Senior Assistant in the Nautical Almanac Office, Donald Harry Sadler.\nThere were, however, tensions between Comrie and his superiors regarding his use of machines for calculation and taking on outside work, and he was suspended at short notice on\n19\nAugust\n1936\n; Sadler became Acting Superintendent. Late in\n1936\nDoreen Barrett\n(\nnée Ifield\n)\nwent for an interview for a position at the Nautical Almanac Office. She wrote\n[\n15\n]\n:-\nI went for interview with D H Sadler very nervous as I couldn't find anyone even in my large department who knew anything about the Nautical Almanac Office. ... On arrival I realised that the Acting Superintendent was just as nervous as I was.\n(\nI found out subsequently he had just been appointed to that post himself.\n)\nThe Offices were in the Royal Naval College, Greenwich. A magnificent building in which to work. We were allocated a few rooms in the College, D H Sadler in a room overlooking the river and the majority of staff in one large room ...\nSadler began publishing soon after taking up his position at the Nautical Almanac Office in\n1930\nand took over several projects which Comrie had been working on. He co-authored\nThe British Association for the Advancement of Science Mathematical Tables Volume II - Emden Functions, Being Solutions of Emden's Equation Together with Certain Associated Functions\nwith Jeffrey Charles Percy Miller\n(1906\n-\n1981)\nwhich first appeared in\n1932\n. Norman Anning writes\n[\n2\n]\n:-\nThis volume, prepared under the joint sponsorship of the\nBritish Association\nand the International Astronomical Union, contains tables of Emden functions for\nn\n=\n1\n,\n1.5\n,\n2\n,\n.\n.\n.\n5\nn = 1, 1.5, 2, ... 5\nn\n=\n1\n,\n1\n.\n5\n,\n2\n,\n.\n.\n.\n5\n. These functions are solutions of a differential equation\nD\n2\ny\n+\n2\nx\nD\ny\n+\ny\nn\n=\n0\nD^2 y + \\Large\\frac 2 x\\normalsize D y + y^ n  = 0\nD\n2\ny\n+\nx\n2\n​\nD\ny\n+\ny\nn\n=\n0\nwhich is essential in the theoretical exploration of the internal constitution of the stars.\nSadler wrote an obituary\n[\n8\n]\nof his co-author Miller in which he noted that Miller was a fellow student at Trinity College when he had studied there, being one year ahead of him. Miller was a\nWrangler\nin the Mathematical Tripos of\n1928\nand awarded the Tyson Medal\n(1928)\n, the Sheepshanks Exhibition\n(1929)\n, and\nIsaac Newton\nStudentship\n(1930)\n, a\nRouse Ball\nStudentship\n(1930)\nand the\nRayleigh\nPrize\n(1931)\n. Sadler writes\n[\n8\n]\n:-\nIn the early\n1930\ns posts for mathematical astronomers were few. Miller was clearly the best qualified and most suitable person to fill the vacancy of Assistant\n(\nlater to be Deputy Superintendent\n)\nin H M Nautical Almanac Office. His illness, and its after effects, did not allow him to satisfy the Civil Service medical requirements either then or in\n1934\n. This led to his leaving astronomy, and to my own appointment.\nThe Board of the Admiralty decided that the Nautical Almanac Office should become part of the Royal Observatory at Greenwich. Harold Spencer Jones\n(1890\n-\n1960)\nwas the Astronomer Royal of England at this time and Sadler became his assistant. On\n27\nJuly\n1937\nSadler was appointed Superintendent of the Nautical Almanac Office.\nIn\n1938\nSadler published the paper\nNew Geometry for Germany\nin which he discussed Germany's intention to make geometry decimal with\n100\ndegrees to a right angle. For more information about this paper and several other papers by Sadler, see\nTHIS LINK\n.\nThe outbreak of World War II in\n1939\nhad a major effect on the Nautical Almanac Office, and on Sadler's role. The Office moved to Devonport House for the three months, July-September, before being evacuated to Bath. First let us give Doreen Barrett's account\n[\n15\n]\n:-\nIn September\n1939\nthe Nautical Almanac Office was evacuated to Bath and the whole staff relationships changed. D H Sadler was suddenly responsible for all his very young and junior staff. He was instantly anxious and caring about us all and made certain that we were in suitable billets. I believe, despite the important work that the Nautical Almanac Office was called upon to do\n(\nD H Sadler seemed to put in endless hours\n)\n, he was always concerned for his staff which increased enormously during this time. It can't have been easy for some one, who at that time appeared to live mainly for his work, to have in his charge girls whose fiancés and husbands were away fighting and who went through anxious times. He was most understanding and supportive. The day Bath was blitzed we all managed to get to the Office despite lack of transport except one, and I realised then just how much everyone was concerned for our missing member. D H Sadler turned up at last, very white and shaken, having dug himself and his elderly landlady out of the rubble - his concern was were we all there!\nNow let us give Mary Croarken's account of the Nautical Almanac Office's work during the war years\n[\n3\n]\n:-\nUnlike the other service ministries, the Admiralty already had a well equipped and knowledgeably staffed computing centre in the form of the Nautical Almanac Office. While before the war the Admiralty had sacked Comrie for taking on outside work, when war broke out the Admiralty recognised that it had an extremely valuable resource which it came under pressure to open up. Donald Sadler, Comrie's successor as Superintendent, began to take on outside work in autumn\n1939\n. In the first two years of the war HM Nautical Almanac Office took on ballistics table work for the Ordnance Board, the Air Ministry and the Ministry of Aircraft Production as well as more specialist one off pieces of research work for various Admiralty research establishments; one example was a calculation involved in mine design. To add to the pressure on HM Nautical Almanac Office its own work had increased. Before the war the computation of star positions had been jointly shared between several countries. The war had terminated those agreements and HM Nautical Almanac Office had now to calculate all its own astronomical data for the annually published Nautical Almanac - now an even more critical publication for navigational purposes. However, it was not until July\n1941\nthat Sadler received an extra member of staff to help cope with the ever increasing work load. Because of Sadler's unique position in running a major computing facility to which many service ministries were applying for help, he could see a need for a large, central computing facility to which all of the armed forces and the scientific civil service could have access. In\n1941\nhe wrote a formal proposal for the creation of just such a facility but the suggestion came to nothing as the ever increasing crisis of computing resource had not yet been recognised by those in power. A suggestion from another quarter to centralise computing within the Admiralty did, however, bear fruit.\nOne of the organisations which worked with the Nautical Almanac Office during the war was the Admiralty Computing Service which was being organised by\nJack Todd\n. Sadler and\nJack Todd\nwrote two joint papers about the Admiralty Computing Service during World War II, namely\nMathematics in Government Service and Industry: Some Deductions from the War-Time Experience of the Admiralty Computing Service\n(1946)\n, and\nAdmiralty Computing Service\n(1947)\n. For more information about these papers, see\nTHIS LINK\n.\nFor his contribution to the war effort, Sadler was awarded an OBE in\n1948\nand, in the same year, the US Institute of Navigation gave him their Thurlow Award. Two years later, in\n1950\n, the French Bureau des Longitudes made him a corresponding member.\nWe should at this point mention the excellent service that Sadler gave to the\nRoyal Astronomical Society\n. He was elected a Fellow of the Society in\n1931\nand served on its Council in\n1937\n. From\n1939\nto\n1947\nhe was one of the secretaries of the\nRoyal Astronomical Society\nand played an important role in seeing that the Society ran smoothly during the extremely challenging years of the war. He contributed the chapter\n1940\n-\n1950\nto Volume\n2\nof\nHistory of the Royal Astronomical Society\n. He went on to become President of the Society in\n1967\n-\n69\n.\nG A Wilkins describes many contributions by Sadler in\n[\n16\n]\n. Here is his description of Sadler's contribution to international almanacs:-\nThe Nautical Almanac Office moved from Bath to Herstmonceux Castle in\n1949\nto join other departments of the Royal Greenwich Observatory. Donald Sadler, the Superintendent, then carried through the unification of the almanacs of the UK and the USA. He and Gerald Clemence\n(\nDirector of the Nautical Almanac Office in the US Naval Observatory\n)\nhad to persuade the navies and the air forces to change their practices in order to arrive at a common content and format, and this was not easy. There was already a lot in common between the astronomical almanacs, but there had to be some give and take to get the final agreement on content and on the sharing of the work of computation and printing. Unfortunately, he could not persuade the Americans to change their title from 'American Ephemeris' to 'Astronomical Ephemeris\n(\nAE\n)\n'. The preparation of the 'Explanatory Supplement' was also shared, although it was only published in the UK. Sadler had been aiming even higher - for an 'International Astronomical Ephemeris', but he did not achieve this, although Germany gave up its 'Astronomisches Jahrbuch' and took over from us the work of publishing 'Apparent Places of Fundamental Stars'. The unification of the 'Nautical' and 'Air Almanacs' was accompanied by a unification of the auxiliary navigation tables and Sadler played a major role in this. He also designed the 'Star Almanac for Land Surveyors', which is still in use in its original form nearly\n50\nyears later!\nOn\n22\nDecember\n1954\nSadler married Flora Munro McBain\n(1912\n-\n2000)\n. Flora was the eldest of three children born to John McBain, a dairyman's carter, and his wife Isabella Webster, a domestic servant, who had been married in Aberdeen in\n1909\n. Born in Aberdeen, Scotland, on\n4\nJune\n1912\n, Flora had been awarded an Honours Degree in mathematics and physics from the University of Aberdeen in\n1934\n, became a lecturer in applied mathematics and, in\n1937\n, joined the Nautical Almanac Office soon after Sadler had become Superintendent. She had worked closely with Sadler, not only at the Nautical Almanac Office, where she was promoted to Principal Scientific Officer, but also at the\nRoyal Astronomical Society\nwhere she was the first editor of the\nMonthly Notices\nin\n1948\n[\n14\n]\n:-\nThere was no prior announcement and the marriage came as a complete surprise to the current members of the staff. Flora continued to work, but after a short while she reduced her hours of attendance - probably so that she could devote more time to the preparations for the entertainment of guests at their frequent dinner parties. After a few years they moved from Flora's apartment to a new home in Cooden Beach. Many astronomers from overseas who visited the Royal Greenwich Observatory were entertained to dinner by them and they were also generous in extending their invitations to members of the staff and to some vacation students.\nAnother major contribution by Sadler was to the Royal Institute of Navigation\n[\n12\n]\n:-\nThe Royal Institute of Navigation also owes much to Sadler's participation in its affairs; he was a member of the Steering Committee, the Preliminary Council and the first Council, which was elected in\n1947\nwith\n(\nat Sadler's suggestion\n)\nthe Astronomer Royal, Sir Harold Spencer Jones, as its President. He himself was President of the Institute from\n1953\nto\n1955\n, and he was chairman of the Membership and Fellowship Committee for many years. He was awarded the Gold Medal of the Institute in\n1957\nand Honorary Membership in\n1973\n. His presidential addresses to the Royal Institute of Navigation, and later the\nRoyal Astronomical Society\n, covered the relationships between astronomy and navigation and the astronomical measurement of time. He continued to contribute to the 'Journal of Navigation' to the end of his life; his main interest was in astronavigation, but he also participated in the discussions on the rules for the avoidance of collision at sea and other aspects of navigation.\nIn\n1968\nhe published\nMan is Not Lost: A Record of Two Hundred Years of Astronomical Navigation with The Nautical Almanac\n1767\n-\n1967\n. Early in\n1970\n, Sadler was released from his duties as Superintendent at the Nautical Almanac Office so that he could plan the International Astronomical Union General Assembly that was to be held at the University of Sussex in August of that year. He returned to the Nautical Almanac Office in\n1971\nbut not in the role of Superintendent, then retired in\n1972\n.\nWe learn something of Sadler's character from Doreen Barrett\n[\n15\n]\n:-\nDuring the\n11\nyears that I worked for him, mainly as his secretary, I never knew him to offer an angry word - just the odd grumble for a couple of months when he was told to stop smoking, but that soon passed and he soon reverted to his kindly self. He was always anxious to have Office outings and arranged for us to have several parties during our time in Bath. The bond that D H Sadler created between himself and his staff remained until his death, as was very obvious when old staff returned from near and far.  I knew him as a kindly, courteous and modest man. Until I read his obituaries I hadn't realised just how much he had contributed to the world of astronomy and mathematics.\nG A Wilkins writes\n[\n12\n]\n:-\nSadler was a great competitor, and he took part in a variety of both outdoor and indoor sports and games. He was particularly keen on hockey and tennis, and he was also a useful cricketer and a member of the 'Royal Greenwich Observatory Stars' table-tennis team in the early years at Herstmonceux. He also enjoyed billiards, snooker and darts, and he won the Spencer Jones Indoor Sports Trophy in the Royal Greenwich Observatory Club in\n1954\n; he used to organize a billiards match between the UK and the USA at International Astronomical Union General Assemblies. He was a good chess player, winning tournaments in town clubs as well as in the RGO, and he enjoyed bridge and any other game or puzzle that required skill or intellectual effort.\nAlthough he made no major scientific discovery, Sadler contributed a great deal to astronomy and navigation, and it is probable that other fields of science have benefited from his diverse activities, particularly in the publication of mathematical tables. It must also be recognised that many young people gained valuable training and experience while working in the Nautical Almanac Office under his general supervision and that they have subsequently gone into other jobs in many different fields. Many other people have benefited from working with him in societies and international organisations, and those who came to know him as a friend will remember him with pleasure.\nSadler suffered from angina, and he died at his home,\n8\nCollington Rise, Bexhill, Sussex. He was cremated at Eastbourne crematorium on\n2\nNovember\n1987\n. He was survived by his wife Flora who\n[\n12\n]\n:-\n... remained at Cooden Beach for a few more years, but then returned to Aberdeen where she would be closer to her family. Her nieces have recorded how Flora had always been generous to her younger sister and to them and other members of the family. She had a bad fall in\n1998\nand had to move from her bungalow into a nursing home where she died on Christmas Day,\n25\nDecember\n2000\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}