{
  "nome_completo": "Donald Gordon Higman",
  "nome_curto": "Donald Higman",
  "ano_nascimento": "1928",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Higman_Donald/",
  "lugar_nascimento": "Vancouver, British Columbia, Canada",
  "lugar_morte": "Ann Arbor, Michigan, USA",
  "biografia": "Donald Higman\n's parents were Leslie Higman and Hazel Delia Barrett. Leslie Higman was born in St Columb, Cornwall, England on\n24\nDecember\n1899\n. At the time of the\n1901\ncensus he was living in Newquay, Cornwall, England, but in\n1906\nthe family emigrated to Canada. In\n1921\nhe was living in Vancouver South, British Columbia, Canada and on\n23\nJanuary\n1926\nhe married Hazel Delia Barrett in East Vancouver, British Columbia. Hazel Barrett was born in Seattle, Washington, USA, in March\n1905\n. The family were still living in Seattle when her sister Evelyn Thelma Barrett was born in\n1906\nand when her brother Andrew John Barrett was born in\n1911\nbut by the time her sister Elizabeth L Barrett was born in\n1914\nthe family had moved to Canada and were living in British Columbia. Donald had one younger sister, Leslie Joan Higman, born in\n1929\n.\nHigman was educated in Vancouver where, after graduating from High School, he entered the University of British Columbia. On\n14\nAugust\n1948\nhe married Kathleen Elizabeth Scott\n(1926\n-\n2012)\n, always known as Betty, in Vancouver. She had been born on\n23\nAugust\n1926\nin Caren, Saskatoon, Saskatchewan. The Higmans had five children.\nCecilia Krieger\nhad been on the faculty at the University of Toronto since\n1928\nand by\n1942\nshe was an assistant professor there. She spent\n1948\nas a visiting lecturer at the University of British Columbia and during that year she lectured to Higman. Realising that he had great potential as a mathematician, she urged him to apply to the University of Illinois at Urbana-Champaign so that he might continue studying mathematics at the graduate school. She almost certainly made this suggestion knowing that Higman was enthusiastic about algebra and that\nReinhold Baer\nheld a chair there. Higman received his B.A. degree in\n1949\nfrom the University of British Columbia and, having been accepted for the University of Illinois graduate school, began his studies there advised by\nBaer\n. He received his M.A. in\n1951\nand in the following year his Ph.D. for his thesis\nFocal Series in Finite Groups.\nWhile at the University of Illinois Higman made a number of important contacts, the two most important being\nMichio Suzuki\nand\nHans Zassenhaus\n. Suzuki had started research in the University of Tokyo's graduate school in April\n1948\nbut in January\n1952\nhe arrived at the University of Illinois having been awarded a graduate fellowship.\nSuzuki\nwrote in one of his articles\n(\nsee\n[\n1\n]\n)\n:-\nWhen I\n[\nSuzuki\n]\nwent to Illinois in\n1952\n, Donald Higman was there and had just completed his Ph.D. thesis on focal subgroups. Partly because I knew the name of Higman already, by his paper on homomorphism correspondence of subgroup lattices, soon we became very good friends.\nHans Zassenhaus\nhad accepted a chair at McGill University, Montreal, in\n1949\nand Higman met him at a Canadian summer mathematics program in either\n1951\nor\n1952\n. After Higman graduated with his Ph.D., he was able to spend the two years\n1952\n-\n54\nat McGill University funded by a National Research Council Fellowship. His first publication\nLattice homomorphisms induced by group homomorphisms\nappeared in\n1951\nwhile he was still a research student and four further publications appeared during the two years at McGill University, namely:\nFocal series in finite groups\n(1953)\n;\nRemarks on splitting extensions\n(1954)\n;\nModules with a group of operators\n(1954)\n; and\nIndecomposable representations at characteristic p\n(1954)\n. The first of these four papers is, of course, a paper containing the main results of his thesis about the focal subgroup theorem\n[\n1\n]\n:-\nDon Higman's focal subgroup theorem is an insightful result about intersections of normal subgroups of a finite group with a\nSylow\np-subgroup. ... Higman's theory of the focal subgroup of a\nSylow\nsubgroup was a basic tool in local analysis in finite group theory. It could be viewed as a contribution along the lines of\nBurnside\n,\nFrobenius\n, Grün, et al. to the determination of quotients that are p-groups\n(\np is a prime number\n)\n. It turns out that the focal subgroup theory is logically at the centre of p-local group theory. ... In the focal subgroup paper, there is a final remark about a communication with\nBrauer\nwho reports overlaps with results from his paper on the characterization of characters\n[\nA characterization of the characters of groups of finite order\n(1953)]\n. Higman states that those results follow from the focal subgroup theory. ...\nRichard Brauer\nessentially agreed with Don's assertions. ...\nBrauer\nwas impressed with Higman, and this may have influenced Don's success in getting a job at the University of Michigan\n(\nfor\nBrauer\nhad been a member of the University of Michigan faculty during\n1948\n-\n1951\nbefore moving to Harvard\n)\n.\nThe second of the above mentioned four papers,\nModules with a group of operators\n(1954)\n, contains the important definition of a relatively projective\n(\nor injective\n)\nmodule for the group algebra of a finite group and proves the famous criterion for relative projectivity that is today named for him, being known as 'Higman's criterion'.\nThe references\n[\n1\n]\n,\n[\n3\n]\n,\n[\n4\n]\nand\n[\n5\n]\nall state that Higman spent the two years\n1954\n-\n56\non the faculty of Montana State University. This university is situated in Bozeman, Montana, yet in\n1955\nHigman and his wife were living in Missoula, Montana, which is the city where the University of Montana is based. In\n1956\nhe was appointed as a visiting assistant professor of mathematics at the University of Michigan where he spent the rest of his career. He was appointed assistant professor of mathematics in\n1957\n, promoted to associate professor in\n1960\nand to professor of mathematics in the College of Literature, Science, and the Arts in\n1963\n. At the University of Michigan he became a colleague of Jack E McLaughlin and the two worked closely together writing three joint papers\nFiniteness of class numbers of representations of algebras over function fields\n(1959)\n,\nGeometric ABA-groups\n(1961)\n, and\nRank\n3\nsubgroups of finite symplectic and unitary groups\n(1965)\n. For many years the two discussed a wide range of different aspects of mathematics and each gained much from these discussions. Their common interests included general algebra, group theory, representation theory, and cohomology.\nHigman played a large role in creating an extremely friendly atmosphere in the Mathematics department at Michigan, where there were many parties and constant forms of hospitality. The Higman family, Donald, Betty and their children, hosted many parties in their home\n[\n1\n]\n:-\nBetty worked at the Library for the Blind and Physically Handicapped. Don was an active member of the Flounders and the Ann Arbor Track Club, and he frequently rode his bicycle. Don played water polo well into his later years. Bob Griess remembers many times being at home, noticing Don jogging past as he expelled his breath in loud bursts.\nIn\n1967\nHigman made a major breakthrough when, working with\nCharles Sims\n, he discovered the previously unknown sporadic simple group now known as the Higman-\nSims\ngroup. Let us note here that\nCharles Sims\nhad been an undergraduate at the University of Michigan and had been taught algebra by Higman. Both Higman and\nSims\nwere at the conference 'Computational Problems in Abstract Algebra' held in Oxford in that year. At the conference\nMarshall Hall\nlectured on the construction of the Hall-Janko sporadic simple group as a rank-\n3\npermutation group on\n100\npoints and this prompted a discussion. Before, during and after the conference dinner held on Saturday,\n2\nSeptember\n1967\n, the two mathematicians developed their ideas. Using Higman's theory of rank-\n3\ngroups, they constructed the Higman-\nSims\ngroup as a primitive permutation group of degree\n100\n, with order\n44\n,\n352\n,\n000\nand rank\n3\n. This group is a rank\n3\nextension of the\nMathieu\ngroup\nM\n22\nM_{22}\nM\n2\n2\n​\n. Higman and\nSims\ndescribed the group in the paper\nA simple group of order\n44\n,\n352\n,\n000\nwhich appeared in\nMathematische Zeitschrift\nin\n1968\n.\nPeter Cameron writes\n[\n2\n]\n:-\n... the Higman-\nSims\ngroup, was found without any recourse to computation at all. It is a subgroup of index\n2\nin the automorphism group of a graph on\n100\nvertices, constructed from the\n22\n-point\nWitt\ndesign. The graph had been constructed earlier by Dale Mesner ... Indeed, from my point of view, Higman and\nSims\nwere the two people who introduced graph theory into the study of permutation groups. I was lucky enough to be in on the ground floor, beginning my doctoral studies in\n1968\n(\nthe year after the Higman-\nSims\ngroup was found, though I wasn't yet in Oxford on that memorable occasion\n)\n.\nPeter Cameron writes in\n[\n1\n]\n:-\nIt was very important to me that Don Higman spent part of the year\n1970\n/\n71\nin Oxford, for several reasons. First, he gave a course of lectures. I was one of two students\n(\nthe other was Susannah Howard\n)\nresponsible for producing printed notes after each week's lectures and then compiling them into a volume of lecture notes published by the Mathematical Institute, Oxford, under the title 'Combinatorial Considerations about Permutation Groups'. These notes contained a number of ideas that appeared only later in conventional publications; I was in the very fortunate position of having a preview of the development of the theory of coherent configurations. ... Fourth, and most important for me, Don arranged for me to spend a semester at the University of Michigan as a visiting assistant professor. This was a very productive time for me. I was allowed an hour a week in which I could lecture on anything I liked, to anyone who wanted to come along. I did a vast amount of mathematics there, and made many good friends.\nMichael Aschbacher writes\n[\n1\n]\n:-\nI probably first met Donald Higman at a meeting in Gainesville, Florida, in\n1972\n, organized by Ernie Shult. However, my strongest early memories of Higman are from a two-week meeting in Japan in\n1974\norganized by\nMichio Suzuki\n. This was only my second trip abroad, and one of my favourites. A number of wives also took part, including my wife Pam. Both Donald and\nGraham Higman\nattended the meeting, and I recall Pam referring to them as \"the Higmen\". As I recall the two were connected in our minds, not just because of their names, but because both had extremely luxuriant eyebrows. ...\nAt the University of Michigan, Higman served on many departmental committees including the executive committee, the doctoral committee, and the master's committee. He also served on the University's grievance committee. He supervised fifteen doctoral theses and several of his academic children went on the gain academic posts resulting in around\n25\nacademic grandchildren, a number which, of course, will continue to increase.\nOver the years Higman made many visits abroad to conferences and other events. For example he spent sabbatical and academic leaves in Eindhoven and Giessen, was a visiting professor at Frankfurt, a visiting senior scientist at Birmingham and Oxford, and a visiting fellow at the Institute for Advanced Study in Canberra, Australia. He organised meetings in Oberwolfach, Germany, the first being \"Die Geometrie der Gruppen und die Gruppen der Geometrie under besondere Berücksichtigung endliche Strukturen\"\nⓉ\n(\nThe geometry of the groups and the groups of geometry under special consideration of finite structures\n)\nheld\n18\n-\n23\nMay\n1964\n. In June\n1966\nhe was in Japan and, in that month, gave the lecture 'Remarks on Finite Permutation Groups' at the University of Tokyo in which he described the discovery of Janko's simple group and discussed Donald Livingstone's construction of it. He attended the summer Institute of Mathematics at Patna University, India, in\n1966\nand a conference in Patna, Bihar, India in September of that year. He visited Oxford for a few months in\n1971\nand gave a course of lectures entitled 'Combinatorial Considerations about Permutation Groups'. In\n1974\nhe attended the two-week Sapporo Conference in Japan organised by\nMichio Suzuki\n. He enjoyed a sailing holiday in Friesland, The Netherlands, in June\n1978\nand attended the\nAmerican Mathematical Society\nSummer Research Institute on Finite Group Theory at the University of California, Santa Cruz,\n25\nJune -\n20\nJuly\n1979\n. He attended the Research Institute for Mathematical Sciences at Kyoto University, Japan,\n21\n-\n24\nNovember\n1994\n.\nAmong the many honours given to Higman, we note especially his invitation to lecture at the International Congress of Mathematicians in Nice in\n1970\nwhen he lectured on his theory of rank-\n3\ngroups. In\n1975\nhe was awarded the Alexander von Humboldt Stiftung Prize.\nHe retired from active duty on the faculty of the University of Michigan on\n31\nMay\n1998\n. The Memoir\n[\n5\n]\nwas produced when he was made professor emeritus. It states, \"The Regents now salute this faculty member by naming Donald G Higman professor emeritus of mathematics.\"\nRobert Griess writes\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\nAfter retiring, the Higmans designed and built a home on the shore of Grand Traverse Bay in the northwest corner of Michigan's Lower Peninsula, where they enjoyed spending summers. Professor Higman had cancer and volunteered to be part of an experimental research study at the University of Michigan Comprehensive Cancer Center, contributing in whatever way he could to find a cure for the disease. It was important to him to be a contributing member to society even as he went through his own personal struggle with the disease.\nIn February\n2009\nthe\nMichigan Mathematics Journal\nproduced a special memorial issue for Donald Higman.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}