{
  "nome_completo": "Donald Ervin Knuth",
  "nome_curto": "Donald Knuth",
  "ano_nascimento": "1938",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Knuth/",
  "lugar_nascimento": "Milwaukee, Wisconsin, USA",
  "lugar_morte": null,
  "biografia": "Donald Knuth\n's parents were Ervin Henry Knuth and Louise Marie Bohning. Donald's father Ervin was a school teacher who taught in a Lutheran school. He played a very important role in determining Donald's interests, and it was through his father that Donald gained his love for education, music, and mathematics. Ervin played the church organ at the Sunday church services and Donald soon became a passionate lover of the organ.\nDonald attended Lutheran schools and from the special emphasis that was placed on English grammar in these schools came Knuth's love of investigating sentence structure. His fascination with this in his first couple of years of secondary school would lead naturally towards writing computer code when he eventually encountered computers, but this did not happen until after his school education was complete. During these first years at secondary school there were other signs of where Knuth's interests would eventually lead. One episode, repeated in most biographies of Knuth but still worth repeating in this one, concerns \"Ziegler's Giant Bar.\"\nHe entered a competition set up by the confectionary manufacturer Ziegler. The aim was to see how many words could be made with the letters of \"Ziegler's Giant Bar\" and for the schoolboy Knuth this was exactly the sort of challenge that he loved. He spent two weeks during which he pretended to be ill and, using a dictionary, he came up with\n4500\nwords. The judges for the competition had only found\n2500\nand Knuth was an easy winner. He commented afterwards that had he thought to use the apostrophe he could have found many more! His school benefited by receiving a television set as a prize.\nAt high school Knuth's interests were more directed towards music than they were to mathematics. His musical interests involved both playing and composing music and he decided at that stage that he would study music after graduating from high school. Knuth played the saxophone, and later the tuba, in his school band. Although he spent much time with his musical interests, Knuth most certainly did not neglect his other school subjects. He graduated from High School in\n1956\nwith the highest grade point average that anyone had ever achieved at his school.\nAt school he had begun to show an interest in mathematics and he amused himself by trying to visualise surfaces in several dimensions by plotting the graphs obtained by keeping all but one of the variables fixed. This is an excellent way to understand mathematical functions and today with the aid of computers this, and more sophisticated techniques, can quickly give students a deep understanding. However Knuth had to plot his graphs by doing hand calculations for every value which he plotted, showing the same sort of dedication to putting hours of work into problems that he had shown with the \"Ziegler's Giant Bar\" competition. One might have thought that his teachers would have believed that he could succeed at college in almost any subject he chose given his outstanding school performance, but this was not really so. The problem was that Knuth did not believe in himself at this stage in his life and so his teachers doubted whether he had the personality, in particular the confidence, to succeed.\nIt shows how undecided Knuth was about the direction his studies might take that when offered a scholarship to Case Institute of Technology in Cleveland, Ohio, to study physics he accepted despite his previous intentions to study music. He entered the physics course at the Case Institute in September\n1956\n. There were really two reasons why, from his second year on, Knuth started to move towards mathematics and away from physics. One day when Knuth was meant to be performing with the College band he missed the bus taking the band to the performance so, finding himself with free time, he tried to solve a challenge problem that one of his mathematics professors had set. Solving it earned Knuth an automatic \"A\" in that class and also the right sort of boost he needed to think that perhaps mathematics rather than physics was for him. Secondly he found that physics practicals did not suit him, so in the end the move towards mathematics became a natural one to make.\nIn fact Knuth already had his first encounter with computers in his first year at Case before he made the move towards mathematics. He had to use the IBM\n650\nand consulted the manual to find out how to write programs\n[\n1\n]\n:-\n... the manual we got from IBM would show examples of programs and I knew I could do ... better than that. So I thought I might have some talent.\nKnuth used his growing expertise at writing computer programs to produce one in\n1958\nto analyse the performance of the College basketball team. It led to some publicity and IBM used a photograph of Knuth in their advertising. One might have expected that events would begin to help him overcome his inferiority complex but he still felt that he was not up to standard. This had the effect of making him put in large amounts of extra work at his academic studies. The result was that when he graduated with his B.S. in June\n1960\nhe was awarded a distinction and, in a quite unique move, the College awarded him a Master's Degree at the same time, such was the brilliance of his performance. Knuth was awarded two Fellowships, a Woodrow Wilson Fellowship and a National Foundation Fellowship in the year of his graduation.\nIt is a real achievement to publish a mathematics paper while still a doctoral student, but Knuth managed to publish two papers in the year he completed his undergraduate degree. These were\nAn imaginary number system\nand\nOn methods of constructing sets of mutually orthogonal Latin squares using a computer I\nthe latter paper being written jointly with\nR C Bose\nand I M Chakravarti. In the first Knuth describes an imaginary number system using the imaginary number\n2\ni\ni\ni\nas its base, giving methods for the addition, subtraction and multiplication of the numbers. In the second paper Knuth and his co-authors give two sets of five mutually orthogonal Latin squares of order\n12\n.\nIn the autumn of\n1960\nKnuth entered the California Institute of Technology and, in June\n1963\n, he was awarded a Ph.D. in mathematics for his thesis\nFinite semifields and projective planes\n. In fact in addition to the work for his doctorate in mathematics, Knuth had from\n1960\nbegun to put his very considerable computing expertise to uses other than writing papers becoming a software development consultant to the Burroughs Corporation in Pasadena, California. Knowledge of his computing expertise was so well established by\n1962\nthat, although he was still a doctoral student at the time, Addison-Wesley approached him and asked him to write a text on compilers. He began that project in the summer of\n1962\n.\nHis publications from this time show that he was applying computing to combinatorial mathematical problems which were not connected to the work he was undertaking for his thesis. For example he computed\nEuler\n's constant to\n1271\ndecimal places and published the result in\n1962\n. In the same year he published work on the evaluation of polynomials by computer. Despite Knuth's remarkable mathematical productivity he did find time for other things. During his years as a graduate student Knuth married Nancy Jill Carter on\n24\nJune\n1961\n. Their two children John Martin Knuth and Jennifer Sierra Knuth were born in\n1965\nand\n1966\nrespectively.\nWe noted above that the title of Knuth's Ph.D. thesis was\nFinite semifields and projective planes\n. A semifield is an algebraic structure satisfying all the usual axioms for a division ring except associativity of multiplication. The thesis contains a wealth of information on finite semifields and their connections to certain types of projective planes. After completion of his doctorate in\n1963\nKnuth became an Assistant Professor of Mathematics at the California Institute of Technology, being promoted to Associate Professor in\n1966\n. From\n1964\nto\n1967\nhe worked as an Editor of Programming Languages for the Association for Computing Machinery. He continued to apply computing to algebraic and combinatorial mathematics problems. For example in\n1964\nhe published tables of data for finite fields which enabled rapid computer calculations to be carried out. His great love of music, which he had almost devoted his life to, continued and in\n1965\nhe joined the American Guild of Organists. He would continue to play music, compose music and has even designed of his own pipe organ.\nBy\n1966\nhis book on compilers had grown to\n3000\nhandwritten pages and Addison-Wesley realised that here was a much more major work than they had originally envisaged. Discussions led to a decision that Knuth should produce a seven volume work covering much more than compilers. The work became\nThe Art of Computer Programming\nand publication began in\n1968\nwhen Volume\n1\n:\nFundamental Algorithms\nappeared. Volume\n2\n:\nSeminumerical algorithms\ncame out in the following year, and Volume\n3\n:\nSorting and searching\nin\n1973\n. In the Preface Knuth writes that these are:-\n... books that have been designed to train the reader in the various skills which go into a programmer's craft...\n[\nThey are\n]\nnot meant to serve as an introduction to computer programming; the reader is supposed to have some previous experience.\n[\nI aim to provide\n]\n(\na\n)\nreference books which summarize the knowledge which has been acquired in several important fields, and\n(\nb\n)\ntextbooks for self-study or for college courses in the computer and information sciences.\nKnuth's aim was to:-\n... organize and summarize what is known about the fast subject of computer methods and to give it firm mathematical and historical foundations.\n... show that the connection between computers and mathematics is far deeper and more intimate than these traditional relationships would imply\n.\nM Muller, reviewing these wonderful books, writes that:-\nKnuth has already made a timely and great contribution. He has managed to provide organization of ideas where little existed before; he has provided many ideas which in essence are new and helpful in obtaining a basis of abstraction, integration, or unification of efforts of earlier workers in the various fields covered.\nIn\n1968\nKnuth was appointed as Professor of Computer Science at Stanford University. At the same time as he left the California Institute of Technology he also resigned his consultancy position with the Burroughs Corporation. Knuth remained at Stanford University for the remainder of his career. He was appointed Fletcher Jones Professor of Computer Science in\n1977\nand in\n1990\nhe was named Professor of The Art of Computer Programming. In\n1993\nhe became Professor Emeritus at Stanford University and continued to live on the University Campus.\nKnuth has made many contributions to mathematics and computing. One particular contribution we should mention is the Knuth-Bendix algorithm, one of the fundamental algorithms for computing with algebraic structures, particularly with groups and semigroups. This important contribution, published jointly with his student Peter B Bendix in\n1970\n, attempts to solve solve the word problem in algebraic systems by deriving consequences of given relations to give, in some sense, a complete set. Another contribution, which has totally changed the whole way that mathematics is printed and communicated is Knuth's invention of TeX, a language for typesetting mathematical and scientific articles. Starting in\n1976\nKnuth took ten years off his other projects to work on the development of TeX and METAFONT, a computer software system for alphabet design.\nTeX has changed the technology of mathematics and science publishing since it enables mathematicians and scientists to produce the highest quality of printing of mathematical articles yet this can be achieved simply using a home computer. However, it has not only changed the way that mathematical and scientific articles are published but also in the way that they are communicated. In the\n17\nth\ncentury a mathematician would have written a letter to another mathematician and they would discuss their everyday lives in English, French or German, say, but whenever they came to explain a piece of mathematics they would use Latin. Nowadays mathematicians communicate by e-mail and whenever they want to explain a piece of mathematics they require mathematical symbols which almost always they communicate using TeX. Nobody, to our knowledge, has tried to measure the impact of TeX on the level of mathematical production, and indeed this would be a very difficult thing to measure, but nevertheless I\n[\nEFR\n]\nam certain that the added ease of production and communication of mathematics using TeX has had a major impact on the subject over the last ten years, say.\nWe should mention a few of the many further contributions by Knuth: semantics of programming languages; attribution grammar; the development of\nL\nR\n(\nk\n)\nLR(k)\nL\nR\n(\nk\n)\nparsing; the Knuth-Morris-Pratt algorithm which searches for a string of characters; and structured documentation and literate programming. The work on\nL\nR\n(\nk\n)\nLR(k)\nL\nR\n(\nk\n)\nparsing appeared in a\n1965\npaper\nOn the translation of languages from left to right\n. In this paper Knuth writes:-\nThere has been much recent interest in languages whose grammar is sufficiently simple that an efficient left-to-right parsing algorithm can be mechanically produced from the grammar. In this paper, we define LR\n(\nk\n)\ngrammars, which are perhaps the most general ones of this type, and they provide the basis for understanding all of the special tricks which have been used in the construction of parsing algorithms for languages with simple structure, e.g., algebraic languages.\nThe Knuth-Morris-Pratt pattern matching algorithm was published in the\n1977\npaper\nFast pattern matching in strings\n. Knuth continues to publish important contributions to computer science, combinatorics and algebra, the topic of his doctoral thesis. For example in the latter area he published\nEfficient representation of perm groups\nin\n1991\n. He writes in the introduction:-\nThis note presents an elementary version of C C Sims's algorithm for computing strong generators of a given perm group, together with a proof of correctness and some notes about appropriate low-level data structures.\nFor his quite remarkable contributions Knuth has received many honours - far too many to be mentioned in an article of this length. Let us just list a small selection. He was the first recipient of the\nGrace Murray Hopper\nAward from the Association for Computing Machinery in\n1971\n; he was elected a Fellow of the\nAmerican Academy of Arts and Science\nin\n1973\n; in\n1974\nhe won the\nAlan M Turing\nAward from the Association for Computing Machinery; he was elected to the\nNational Academy of Sciences\nin\n1975\n; in the same year he won the Lester R Ford Award from the\nMathematical Association of America\n; he was awarded the National Science Medal in\n1979\n(\npresented to him by President Carter\n)\n; he was elected to the National Academy of Engineering in\n1981\n; he was elected an honorary member of the IEEE in\n1982\nand awarded their Computer Pioneer Award in the same year; he was awarded the Steele Prize for Expository Writing from the\nAmerican Mathematical Society\nin\n1986\n; he was awarded the Franklin Medal in\n1988\n; he was elected to the\nAcadémie des Sciences\nin\n1992\n; he was awarded the Adelskold Medal from the\nSwedish Academy of Sciences\nin\n1994\n; he was awarded the\nJohn von Neumann\nMedal from the IEEE in\n1995\n; and the Kyoto Prize from the Inamori Foundation in\n1996\n.\nLet us mention a few of the honours that Knuth has received since\n2000\n. He has received honorary degrees from a large number of universities world-wide: Waterloo University, Canada\n(2000)\n, Tübingen University\n(2001)\n, the University of Oslo\n(2002)\n, Antwerp University\n(2003)\n, Harvard University\n(2003)\n, the University of Macedonia\n(2003)\n, Montreal University\n(2004)\n, ETH Zürich\n(2005)\n, Concordia University\n(2006)\n, Wisconsin University\n(2006)\n, the University of Bordeau\n(2007)\n. In\n2003\nhe was elected to the\nRoyal Society\nof London, and in\n2008\nto the\nRussian Academy of Sciences\n. He was awarded the Gold Medal from the State Engineering University of Armenia in\n2006\n, and in the same year the gold medal from Yerevan State University. In\n2001\nthe minor planet \"\n(21656)\nKnuth\" was named after him.\nIn\n2015\nKnuth was elected to Honorary Membership of the\nLondon Mathematical Society\nin its\n150\nth\nAnniversary year. The short citation reads:-\nProfessor Knuth is one of the world's greatest computer scientists, whose works have had a profound influence on the subject over the past half-century. His research covers diverse areas of mathematics and computer science, including structure in random graphs, word problems in universal algebras, pattern matching in strings, prefix codes and binary search trees.\nFinally let us quote from the\nStanford Magazine\nabout Knuth's daily life following retirement:-\nIn retirement, he still writes several programs a week. He no longer advises students, but he hosts free public Computer Musings talks several times a year, drops in on graduate-level courses occasionally, and bikes to campus most days of the week to use the libraries or swim at the aquatic centre.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Logic"
  ]
}