{
  "nome_completo": "Harold Scott MacDonald Coxeter",
  "nome_curto": "Donald Coxeter",
  "ano_nascimento": "1907",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coxeter/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Toronto, Canada",
  "biografia": "Donald Coxeter\nwas always known as Donald which came from his third name MacDonald. This needs a little explanation. He was first given the name MacDonald Scott Coxeter, but a godparent suggested that his father's name should be added, so Harold was added at the front. Another relative noted that H M S Coxeter made him sound like a ship. A permutation of the names resulted in Harold Scott MacDonald Coxeter. He was not always consistent in giving his name on official documents, however, see below.\nDonald Coxeter's father was Harold Samuel Coxeter\n(1878\n-\n1936)\nwho was a manufacturer of surgical instruments. He had wanted to be a doctor but family pressure saw him join Coxeter & Son, a company founded by his grandfather. An intelligent man with a broad general knowledge, he sculpted and sang as a hobby. Donald's mother was Lucy Gee, the daughter of the accountant William Gee and Charlotte Scott, who was born in Boston, Lincoln, about\n1872\n. She was a painter of distinction with the portrait of Albert Gunther painted in\n1900\nbeing in the National Portrait Gallery.\nThe\n1901\nCensus has Harold Samuel Coxeter living with his parents Samuel and Ada Coxeter in Highgate, Hornsey, London. Two of Harold's sisters, Constance and Ethel are in the house, both being artists, and Lucy Gee, also described as an artist, is a visitor in the house. Donald and Lucy married in\n1903\nand lived at\n34\nHolland Park Road in Kensington and Chelsea. Donald, their only child, was born on\n9\nFebruary\n1907\nand was baptised at St Barnabas Church in Kensington on\n7\nApril\n1907\n. Lucy painted Donald playing the piano when he was about\n2\nor\n3\nyears old and the painting is now in Trinity College, Cambridge.\nYou can see the painting at\nTHIS LINK\nSadly, Donald was not brought up in a happy home since his parents experienced a difficult marriage. Lucy wanted a career as an artist but Harold wanted further children. Strained relations led Harold to seek help with the marital difficulties at meetings of the Royal Psychological Society where he met Rosalie Gabler.\n(\nNote that this is the correct spelling of Gabler but the spelling is incorrect in several other sources, for example in\n[\n1\n]\nand\n[\n11\n]\n.\n)\nRosalie was a German divorcée who, along with her daughter Katharina\n(\nborn around\n1901)\nknown as Katie, became friends of the Coxeters. Donald's parents began to talk about a divorce which the young boy found almost unbearable.\nSoon after the start of World War I in\n1914\nDonald went with his nanny May Henderson to live in the Coxeter's second home near the Kent-Surrey border while his parents remained in London. This was for his safety since London began to be hit by Zeppelin bombing raids in January\n1915\n. This was a happier time for Donald who was tutored by May. When his nanny May left the Coxeters' employment to get married in\n1919\n, his parents decided to send him to boarding school to reduce the trauma he was suffering with his parents arranging their divorce. He was sent to St George's School, Harpenden, north of London, but he was very unhappy there. His mother and father would visit him at the school but never together. When Harold told Donald that after he was divorced he would marry Katie Gabler, the young boy was even more unhappy. He was becoming an accomplished pianist, however, and showing an amazing imagination inventing an imaginary world called Amellaibian with its own language, number system, weights and measures. Donald was also becoming fascinated by geometry. He read the Charles Howard Hinton's book\nThe fourth dimension\n(1904)\nand other such works, and wrote a school essay\nDimensional Analogy\n. In it he writes\n[\n1\n]\n:-\nIn space as we know it only three lines can be imagined perpendicular to each other. A fourth line, perpendicular to all the other three would be quite invisible and unimaginable to us. We ourselves, and all the material things around us probably possesses a fourth dimension, of which we are quite unaware. ... But this thickness in the fourth dimension must be exceedingly minute, if it exists at all. ... we can find out something about the conditions of the fourth and higher dimensions if they exist, without being certain they exist, by a process which I have termed Dimensional Analogy.\nDimensional Analogy\nwon a school essay prize for Donald and he filled five notebooks with further ideas, diagrams and calculations.\nHarold Coxeter married Katie, Katharina T K Gabler, in\n1922\n. He was\n43\nyears old and she was\n21\n; they had three children\n(\nDonald's half-sisters\n)\nJoan Melody Coxeter\n(\nborn\n1923)\n, Nesta Pamela Coxeter\n(\nborn\n1927)\nand Eve C Coxeter\n(\nborn\n1928)\n. Harold had met\nBertrand Russell\nat several conscientious objector meetings in London and he asked\nRussell\nfor advice about his son Donald who was showing remarkable mathematical talent. Russell suggested that Donald write to\nEric Harold Neville\nwhich he did on\n11\nSeptember\n1923\n. A reply from\nNeville\nled to a meeting being set up at St George's School, Harpenden. When\nNeville\nasked Donald what mathematics he was being taught at school he saw that the mathematics teaching he was receiving was very poor. He advised that Donald leave school and receive private tutoring in mathematics before beginning studies at Cambridge.\nA suitable tutor was found in Alan Robson, head of mathematics at Marlborough College, so Coxeter left St George's School, Harpenden, rented a room in Marlborough and cycled to the College for tutoring. Because of the poor teaching he had experienced, he was ranked bottom of all Robson's pupils when he arrived but two years later in\n1925\nhe was ranked top. He sat the Cambridge University entrance examinations in\n1925\nand was offered a place in King's College. Robson advised him to wait another year and try again in the hope that he would be offered Trinity College. This he did and matriculated at Trinity College, Cambridge in\n1926\n.\nCoxeter was assigned\nJ E Littlewood\nas his director of studies at Trinity College who advised him to take pure mathematics courses on analytic geometry, projective geometry, differential geometry, topology,\ngroup theory\n, and number theory. He also took some mathematical physics courses such as electricity, celestial mechanics, and relativity. He received his B.A. in\n1928\nas Senior\nWrangler\n. During his time at Cambridge he had stomach problems and became a vegetarian; he remained a vegetarian for the rest of his life.\nAt this stage Coxeter was shy having little social interaction. He had not had a girlfriend and his father began to worry that his divorce and marriage to a girl not much older than his son had had psychological consequences. Now we noted above that Harold Coxeter had met Rosalie Gabler at meetings of the Royal Psychological Society. Now at these meetings was Wilhelm Stekel, an Austrian  psychologist some of whose books had been translated into English by Rosalie Gabler, for example\nConditions of nervous anxiety and their treatment\n(1923)\n. Coxeter spent the three summer months of\n1928\nin Vienna where he was questioned by Stekel and asked to keep a diary of his dreams. It is doubtful if the psychoanalysis did Coxeter any good\n(\nor harm\n)\nbut while in Vienna he spent time in the reading room of the University of Vienna's mathematics library and there discovered the works of\nLudwig Schläfli\n. These made a big impression on Coxeter who carried some of\nSchläfli\n's ideas into the research he was about to undertake.\nAwarded a research scholarship, he continued to study for a doctorate at Cambridge under\nH F Baker\n, and this was awarded in\n1931\nfor his thesis\nSome contributions to the theory of regular polytopes\n. He wrote in the Introduction:-\nAlthough it is unnecessary, from a practical point of view, to consider regular skew polygons of more than five dimensions, the human weakness of a mathematician compels him to examine the general case, although the trigonometry involved is extraordinarily complicated. ... The only excuse for this part of the work must be its intrinsic beauty.\nWhile studying for his Ph.D. he was, of course, extremely influenced by\nHenry Baker\nwho founded the Saturday afternoon seminar or 'tea party' which became the focus of activity in geometry. Two others were also particularly influential in his development as a mathematician,\nAlicia Boole Stott\nand\nG H Hardy\n.\nCoxeter then became a Fellow continuing his researches at Cambridge. During this period he spent two years as a research visitor at Princeton University working under\nOswald Veblen\n. This came about because\nSolomon Lefschetz\nvisited Cambridge in\n1931\nand encouraged Coxeter to apply for a Rockefeller research fellowship. He applied, was accepted, but then worried he would lose a year of the Cambridge fellowship. His request to the council of Trinity College to have the fellowship extended by a year to compensate for a year in Princeton was accepted. Rather than going to Vienna for a family holiday in August\n1932\n, he sailed to New York to spend time there before going on to Princeton. He sailed on the Cunard ship\nAquitania\n, leaving Southampton on\n20\nAugust, arriving\n26\nAugust. Interestingly, he gave his name as Macdonald Coxeter but most often he gave Harold Coxeter.\nHe enjoyed sightseeing in New York but the main event was a total eclipse of the sun which he watched from New Hampshire. Once in Princeton he lived in Graduate College and attended lectures by\nVeblen\n,\nvon Neumann\n,\nWigner\nand\nPólya\namong others. While at Princeton he received an invitation from\nG de B Robinson\nto give a lecture at Toronto. He gave a couple of lectures on his favourite topic of polytopes. His father Harold sailed to New York on the ship\nAmerican Banker\nin June\n1933\nto spend time with his son before he returned to England.\nReturning to Cambridge, Coxeter realised that despite the opportunities that Cambridge offered, he had just spent the best year of his life at Princeton. Encouraged to apply for a Procter Fellowship to fund the year\n1934\n-\n35\nat Princeton he was soon back in the United States. He sailed from Cherbourg, France, to New York on the\nMajestic\n, arriving on\n4\nSeptember\n1934\n. At Princeton he attended the course \"The structure and representation of continuous groups\" given by\nHermann Weyl\n. They quickly realised that there were surprising connections between Coxeter's finite groups and\nWeyl\n's infinite groups.\nWeyl\nhad Coxeter take notes of the seminars as well as delivering five on his own work as part of the series. Coxeter was delighted to have his work appear as an Appendix to\nWeyl\n's published notes.\nThis was not an easy time to be looking for a permanent post, so when he was offered a teaching post in a boarding school in Vermont, Coxeter was very tempted to accept. While at Princeton\nG H Hardy\nhad recommended him to edit a new edition of\nRouse Ball\n's\nMathematical Recreations\nwhich he thought set him up well for school teaching. Various people, particularly\nVeblen\n, strongly advised him not leave research for teaching. The Trinity College council refused his request to extend his fellowship for another year so he, very reluctantly, refused the offer of the school position. After he returned to Trinity College he was appointed as a lecturer there, but soon after that he received an offer of an assistant lectureship at the University of Toronto.\nSince he thought a job in Britain was preferable to one in Canada, he refused Toronto and applied for the Lowndean Chair of Astronomy and Geometry which became vacant on\nHenry Baker\n's retiral. The decision went in favour of\nWilliam Hodge\nand Coxeter began to worry about his future. After discussions with his father, with\nBaker\n, with\nHardy\nand with\nLittlewood\n, he decided to contact Toronto and ask if he could reverse his recent refusal, and accept their offer. Toronto were pleased to have him accept.\nIn March\n1936\nhe met Hendrina Johanna Brouwer\n(1910\n-\n1999)\n, the daughter of the office clerk Leonards Gerrit Brouwer\n(1873\n-\n1923)\nand Barbara 't Hoen\n(1876\n-\n1934)\n, who had just arrived England to work as an au pair. Hendrina, known as Rien, was born in Vlaardingen, Holland, on\n18\nSeptember\n1910\n. Coxeter asked her to marry him in May and they set their wedding date for\n1\nSeptember, only two days before they would sail to Canada. On\n15\nAugust he received the terrible news that his father had died while on holiday. Feeling they could not have a happy wedding with the many invited guests, they married in private before the intended date on\n20\nAugust at the Holy Sepulchre Church, Cambridge, known as the Round Church. On\n3\nSeptember the newly married couple set sail from Southampton on the Canadian Pacific ship the\nDuchess of Richmond\n, bound for Montreal, Canada. Donald and Rien Coxeter had two children: Edgar H Coxeter\n(\nborn about\n1939)\nand Susan J Coxeter\n(\nborn about\n1941)\n.\nCoxeter took up an appointment at the University of Toronto where he remained on the faculty until his death. He was an Assistant Professor of Mathematics\n1936\n-\n43\n, Associate Professor\n1943\n-\n48\n, and Professor\n1948\n-\n80\n. A celebration was held in the department in\n1996\nto celebrate his\n60\nyears at the University of Toronto.\nCoxeter's work was mainly in geometry. In particular he made contributions of major importance in the theory of polytopes,\nnon-euclidean\ngeometry, group theory and combinatorics. Coxeter polytopes are the fundamental domains of discrete reflection groups, now called Coxeter groups, and they give rise to tesselations. In\n1934\nCoxeter classified all spherical and euclidean Coxeter groups. His work was motivated by the beauty of mathematics. Robert Moody, proposing Coxeter for an honorary degree from York University in Toronto, said:-\nModern science is often driven by fads and fashions, and mathematics is no exception. Coxeter's style, I would say, is singularly unfashionable. He is guided, I think, almost completely by a profound sense of what is beautiful.\nYork was not the only university to honour Coxeter. He received nine honorary doctorates and was elected a Fellow of the\nRoyal Society of London\n(1950)\n, awarded its\nSylvester\nMedal in\n1997\n, and elected a Fellow of the\nRoyal Society of Canada\n(1948)\n.\nAn interesting example of his interests is given in his reply in the\n1980\ninterview\n[\n9\n]\nto the question about the most significant unsolved problems of geometry:-\nThere is the tiling problem: What are the possible ways in which you can take a convex polygon and repeat it so as to get congruent replicas of it which when fitted together fill and cover the plane? Even tiling with pentagons, which was supposed to be solved, still isn't. Nobody knows quite what are all the possible shapes of pentagon that can be repeated by congruent transformations to cover the plane. People seem to keep on thinking of new ones. Mrs\nDoris Schattschneider\nhas just written a very nice essay in praise of amateurs who have contributed to this problem.\nAnd then you can have the same thing in space: Think of a convex polyhedron; can you repeat it to fill and cover the whole three-dimensional space? Of course, there are little things of which one has to be careful. You insist in the planar case that where two tiles meet they have either a vertex or a complete edge of both as their only place of meeting, rather than being staggered, like bricks on a wall. I think the interesting cases are where an edge is just the edge between two points, and it's an edge of both the tiles.\nAmong his most famous geometry books are\nThe real projective plane\n(1955)\n,\nIntroduction to geometry\n(1961)\n,\nRegular polytopes\n(1963)\n,\nNon-euclidean geometry\n(1965)\nand, written jointly with S L Greitzer,\nGeometry revisited\n(1967)\n. He also published a famous work on\ngroup presentations\n, which was written jointly with his first doctoral student\nW O J Moser\n,\nGenerators and relations for discrete groups\n.\nFor more information about Coxeter's books with extracts from Prefaces, see\nTHIS LINK\n.\nFor more information about Coxeter's books with extracts from Reviews, see\nTHIS LINK\n.\nHis\n12\nbooks and\n167\npublished articles cover more than mathematical research. Coxeter met\nEscher\nin\n1954\nand the two became lifelong friends. Another friend,\nR Buckminister Fuller\n, used Coxeter's ideas in his architecture. In\n1938\nCoxeter revised and updated\nRouse Ball\n's\nMathematical recreations and essays\n, a book which\nRouse Ball\nfirst published in\n1892\n.\nCoxeter had many artistic gifts, particularly in music. In fact before he became a mathematician he wanted to become a composer. However his interest in symmetry took him towards mathematics and into a career which he loved throughout has life. Coxeter wrote:-\nI am extremely fortunate for being paid for what I would have done anyway.\nHe attributed his long life to vegetarianism, a regular regime of exercise that saw him do\n50\npush-ups a day at the age of\n89\n, and, perhaps most importantly, as he related himself:-\nI am never bored.\nAllow me\n[\nEFR\n]\na personal note:-\nA colleague and I visited Donald in Toronto in\n1976\nand I will always remember his office full of mathematical models. I remember the extreme kindness and wonderful hospitality of Donald and his Dutch wife Rien. When I said I had never had pumpkin pie before, Donald vanished into the kitchen and staggered back with a huge pumpkin which his frail figure hardly looked able to carry.\nHe taught me how to write a mathematics paper. He was a craftsman at constructing a paper, counting the symbols to make sure that formulas did not break across a line.\nWhen Donald visited me and a colleague in St Andrews we took him a walk down the pier at the harbour. He insisted, much to our trepidation, on climbing an insecure rusty ladder at the end of the pier. He was certainly not as frail as he looked!\nIn\n1997\nCoxeter was made a Companion of the Order of Canada. This is the highest of the three levels of honours that Canada makes. The citation states:-\nThrough his research, he has made a monumental contribution to the study of geometry by furthering its applications in mathematics, science, art, music, architecture, and crystallography. ...\n[\nHe\n]\nhas influenced generations of teachers and students for more than half a century.\nRien developed Alzheimer's but Coxeter nursed his wife through the increasingly difficult time. Only after she fell and broke her hip did she move into a care home for her final months. She died in\n1999\nand with the help and companionship of his daughter Susan, Coxeter renewed his trips to conferences. After years of excellent health, eventually his health began to fail. He struggled to keep attending conferences and writing papers. He was angry to have declining health when he had spent his life doing all the \"right things\" for his health.\nLet us end by quoting Erich Ellers' reminiscences from\n[\n5\n]\n:-\nDonald was the most ardent, the most important, and the most revered member of the Geometry Seminar at the University of Toronto. It used to meet every Tuesday. Donald never missed a seminar and never missed an opportunity to deliver a talk on his ongoing research. He had a wealth of knowledge and liked to bring up tantalizing geometrical questions that seemed new to most people but to which he usually knew the answers.\nCoxeter was a vegetarian, he was active in saving the environment, and he promoted peace. His wife, Rien, died three years ago. Since then his daughter, Susan Thomas, has looked after him. He also has a son, Edgar, and several grandchildren and great-grandchildren.\nThe popularity of a person can perhaps be gauged by the number of anecdotes about him. The press is full of anecdotes on Donald. Here is a typical and very charming one: When his graduate student Asia Ivic Weiss, who is now teaching at York University, told him that she would not be able to come to their regular weekly meetings because she was about to give birth, he gave her a\n50\n-page preprint of a paper. \"He said that it was something for me to look through if I had nothing else to do in the labour room.\"",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry"
  ]
}