{
  "nome_completo": "Donald Greenspan",
  "nome_curto": "Donald Greenspan",
  "ano_nascimento": "1928",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Greenspan_Donald/",
  "lugar_nascimento": "Brooklyn, New York, USA",
  "lugar_morte": "Arlington, Texas, USA",
  "biografia": "Donald Greenspan\n's parents were Louis Greenspan and Jessie Scholnick. Louis Greenspan was born in New York City, New York, on\n21\nJanuary\n1906\n, the son of parents who were both born in Russia. The family were Jewish with Yiddish as their first language. In both the\n1930\nand\n1940\nCensus, Louis gave his occupation as a cutter-furrier in the fur manufacturing industry. Jessie Scholnick was born in Leeds, England, the daughter of Harris Scholnick\n(1877\n-\n1960)\nand Fannie Bluestein\n(1888\n-\n1926)\n, both of whom were Yiddish speaking and born in Russia. The Scholnick family left England and settled in New York, USA in\n1914\n. Louis and Jessie Greenspan were married in Brooklyn, New York City, New York, on\n9\nMarch\n1927\n. They had two sons and one daughter: Donald Greenspan, born on\n24\nJanuary\n1928\n, the subject of this biography;\nHarvey Philip Greenspan\n, born\n22\nFebruary\n1933\n, who became a mathematician and has a biography in this archive; and Rosalie Greenspan.\nGreenspan was educated in Brooklyn where after his primary education, his secondary education was at the Thomas Jefferson High School, Brooklyn, New York. He graduated from the High School in\n1945\nand, in the same year, began his university studies at New York University. While a student, he completed a World War II Draft Card on\n24\nApril\n1946\n. This gives his complexion as \"ruddy\", his eye colour as \"brown\", his hair colour as \"brown\" and his height as\n5\nft\n8\nin.\nHe graduated from New York University with a B.S. June\n1948\nand moved to the University of Wisconsin for his Master's Degree, studying Geometry as his Major subject, and, for his two Minor subjects Algebra and Analysis. He graduated with an M.S. in June\n1949\nand moved to the University of Maryland to undertake research for his Ph.D.\nLet us note here the positions that Greenspan held during his studies, as given in his Ph.D. thesis of\n1956\n: Stock Assistant, Toy Department, Macy's Department Store, New York City, New York; Research Assistant, Mathematics Department, University of Wisconsin, Madison, Wisconsin; Mathematical Analyst, Computation Laboratory, Wright Air development Center, Wright Patterson Air Force Base, Ohio; and Instructor, University of Maryland, College Park, Maryland. He also gives his Permanent Address at this time as\n40\nHope Drive, Plainview, Long Island, New York.\nReturning to discuss Greenspan's research at the University of Maryland, we note that his thesis advisor was Stanley B Jackson. Jackson was born in Lewiston, Maine, and attended Bates College before studying at Harvard University for a master's degree and a doctorate in mathematics. He taught at the University of Maryland from\n1941\n, being chairman of the Mathematics Department from\n1954\nto\n1958\n. In\n1955\nGreenspan and Jackson published the joint paper\nHyperbolic analytic geometry\n. We give their Introduction below:-\nThe individual who encounters hyperbolic geometry for the first time in such a book as the one by Wolfe\n[\n'Introduction to Non-euclidean Geometry'\n(1945)]\nhas the stimulating experience of developing the analogue of a substantial part of Euclidean geometry using the same essential spirit and methods as those of\nEuclid\n. This is followed by a development of hyperbolic trigonometry which provides the reader with all the rudimentary data for solving triangle problems in the hyperbolic plane. However, only a few texts, like the one of\nSommerville\n[\n'Elements of non-euclidean geometry'\n(1919)]\n, make an attempt to develop a hyperbolic analytic geometry in a way which parallels the usual freshman course in analytics, and the student has only to attempt as simple a problem as the determination of the equation of the altitude of an arbitrary triangle to realize the inadequacy of his equipment. Other texts, such as that by\nCoxeter\n[\n'Non-euclidean geometry'\n(1942)]\napproach hyperbolic geometry from the viewpoint of projective geometry. To a student familiar with projective geometry it is then a relatively simple matter to think of the hyperbolic plane as embedded in the projective plane and develop its analytic geometry in the usual projective coordinates. From the beginner's point of view it seems an unnatural way of getting analytic results for the hyperbolic plane.\nThe aim of this paper is to present a brief development of hyperbolic analytic geometry following the usual procedures of analytics quite familiar to students. Only a single use is made of calculus, and this could probably have been avoided. From the discussion follows naturally the idea of introducing a different coordinate system which amounts in fact to embedding in the projective plane. Thus the procedure of establishing hyperbolic geometry as a subgeometry of projective geometry is obtained naturally from within in an elementary way, With the exception of the last section, which utilises a little projective geometry and the already noted single use of calculus, nothing is assumed beyond analytic geometry and an introduction to hyperbolic geometry.\nGreenspan published another article in\n1955\n, namely\nMethods of matrix inversion\nin the\nAmerican Mathematical Monthly\n. This paper shows clearly the direction that his interests were moving, namely towards applications of computing to applied mathematics. It begins:-\nThe physical scientist has long been plagued with large linear systems of equations, hopeless differential equations or systems of such equations, or simply enigmatic integral equations. Each of these problems in turn often lends itself to matrix analysis and the approach usually involves matrix inversion. However, it is only with the advent of high speed computation that the approach has entered the realm of practicality.\nIn\n1956\nhe was awarded a Ph.D. from the University of Maryland for his thesis\nOn Vertices of Space Curves with Respect to Families of Surfaces\n. The\n65\n-page thesis contains the following acknowledgement:-\nThe writer wishes to express his deep, sincere appreciation to his parents, to Ray Carpenter, and to his teacher, advisor, and friend, Stanley B Jackson.\nAfter graduating, Greenspan was employed at the Mathematics Research Center, U.S. Army, University of Wisconsin, Madison and also in the Department of Computer Science at the University of Wisconsin, Madison. He quickly built up a reputation as a top quality researcher in numerical analysis with publications such as\nOn the numerical evaluation of the Stokes' stream function\n(1957)\n,\nOn a \"best'' five-point difference analogue of Laplace's equation\n(1958)\n,\nOn the numerical solution of Dirichlet problems\n(1959)\n, and\nOn the approximate solution of a class of strongly elliptic linear differential equations\n(1961)\n.\nHe also began publishing books which took a rather distinct approach. His first book was\nTheory and solution of ordinary differential equations\n(1960)\n. Reviewers were enthusiastic, for example Arthur Danese writes\n[\n7\n]\n:-\nIf you have grown weary teaching the traditional \"cook-book\" course in differential equations, this is the book to consider.\nMario González writes in\nMathematical Reviews\n:-\nThis book offers a fresh approach to the traditional first course on ordinary differential equations.\nFor more information about this book, with extracts from six reviews, see\nTHIS LINK\n.\nGreenspan's second book\nIntroduction to partial differential equations\n(1961)\nreceived mixed reviews. Bernard Fleishman is very positive\n[\n11\n]\n:-\nIn writing this book, the author seems to have had in mind two primary purposes: first of all, to base application and technique on rigorously developed theory; secondly, within the realm of technique, to give numerical methods the careful attention which is due them. He has succeeded very well in achieving these aims, and in the process has written a sophisticated, up-to-date text for a first course in partial differential equations.\nEdward Copson\n, however, is very negative\n[\n6\n]\n:-\nThis book is one of McGraw-Hill's International Series in Pure and Applied Mathematics, a series which includes books of distinction, such as\nAhlfors\n's 'Complex Analysis'. I cannot understand how Dr Greenspan's book got into such exalted company: it has nothing whatever to commend it. The plain fact is that the author does not know for whom he is writing.\nFor more information on this book, one of\n18\nbooks by Greenspan about which we give information, see\nTHIS LINK\n.\nIn\n1978\nGreenspan moved to the University of Texas at Arlington. The following tribute is paid in\n[\n24\n]\n:-\nDonald Greenspan was already over\n20\nyears into a successful and distinguished career when he applied for a faculty position in the Department of Mathematics at the University of Texas Arlington in\n1978\n. He was already a noted expert in the fields of numerical analysis and computational modelling, and members of the University of Texas Arlington mathematics hiring committee could hardly believe it when they saw his resume.\n\"We were very surprised, but delighted that he wanted to come here,\" said Danny Dyer, professor of mathematics and a member of that hiring committee in\n1978\n. \"Here was this world-famous superstar in his field that was interested in joining our faculty. Because of his stature, he gave us instant credibility. It was like when a fisherman throws out his line and catches the big one.\"\n\"Dr Greenspan was an internationally recognized scholar in mathematical modelling and simulations,\" Department of Mathematics chair Jianping Zhu said. \"His presence in the Department of Mathematics at University of Texas Arlington significantly boosted the standing of our department in the mathematics community and enhanced our department and University of Texas Arlington's visibility in the country and the world. He was also an excellent teacher. His efforts in our classrooms produced a lasting impact on hundreds of students.\"\nGreenspan's classes were always popular, particularly with engineering students, Dyer said. Invariably, the number of students wanting to take his classes would exceed the number of chairs in the classroom, but Greenspan would attempt to accommodate the extra students by bringing in armchairs and placing them in the aisles. The fire marshal had to be called in more than once, Dyer recalled. \"He was an outstanding teacher and very well-liked by his students,\" Dyer said. \"He was very warm, very energetic, a real live wire with a terrific sense of humour.\"\nTo understand the approach that Greenspan developed in his research, his teaching and his books, we quote from the Preface of\nArithmetic applied mathematics\n(1980)\n:-\n... we will develop a computer, rather than a continuum, approach to the deterministic theories of particle mechanics. Thus, we will formulate and study new models of classical physical phenomena from both Newtonian and special relativistic mechanics by use only of arithmetic. At those points where\nNewton\n,\nLeibniz\n, and\nEinstein\nfound it necessary to apply the analytical power of the calculus, we shall, instead, apply the computational power of modern digital computers.\nGreenspan had shown in\n1973\n(\nsee\n[\n15\n]\n)\nthat the formula\nE\n=\nm\nc\n2\nE = mc^{2}\nE\n=\nm\nc\n2\ncould be established without using the concept of a derivative. He explained his thinking in\n[\n14\n]\n:-\nWith regard to the arithmetic approach to Newtonian and special relativistic mechanics, I would like to make three comments. First, such an approach allows the use of new types of models, called discrete models. These are formulated in the spirit of classical molecular mechanics and conserve exactly the same fundamental invariants as do continuous models, but they are governed by arithmetical dynamical equations. Such new models are now available for studying fluid flow, elasticity, heat transfer, gravitation and wave generation. ...\nNext, it should be noted that the arithmetic approach has also been applied in nondeterministic physics. For example, the study of the dynamical interaction of three particles in quantum dynamics has proved to be formidable, and primarily because the number of dimensions involved is computationally restrictive. Thus, within the last several years, there have emerged quasi-quantum mechanical methods in which potentials are calculated from\nSchrödinger\n's equation while the particle trajectories are calculated from deterministic equations.\nFinally, it should be noted that the arithmetic approach could be important at all educational levels, not just that of the high school. For example, the miasma of the \"new math\" could be replaced by conventional arithmetic with additional study of high-speed arithmetic. In this fashion, since digital computers are now becoming more economical to obtain and maintain, mathematics which is understandable, applicable, and exciting could be made available to all.\nDonald Greenspan married Bonita Faye Bowman in Tarrant, Texas, on\n23\nJanuary\n1984\n. Both had been previously married. Bonita, known as Bonnie, was\n23\nyears younger than Greenspan.\nFinally, we quote from the obituary\n[\n21\n]\n:-\nDon started every day by reading the New York Times and working the crossword puzzle. He relaxed by listening to opera, visiting art museums\n(\nespecially the Kimbell\n)\n, painting, watching movies and reading. He loved traveling with his wife, Bonnie. He was preceded in death by his parents, Louis and Jessie Greenspan. Survivors: His wife, Bonnie Bowman; brother,\nHarvey Greenspan\nand wife, Mimi; sister, Rosalie Greenspan; sons, Jamie Greenspan and partner, Traci Hertzler, and Marc Greenspan; daughter, Rona Greenspan; and grandson, Clinton Greenspan.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}