{
  "nome_completo": "Donald Macmillan",
  "nome_curto": "Donald Macmillan",
  "ano_nascimento": "1856",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macmillan/",
  "lugar_nascimento": "Kintail, Scotland",
  "lugar_morte": "Dunoon, Scotland",
  "biografia": "Donald Macmillan\n(\nor\nMcMillan\nor\nM'Millan\n)\nwas born the Schoolhouse in Kintail. This is a beautiful area of the Scottish Highlands, north of Fort William on the road to the Isle of Skye. It is fairly near to the west coast of the Scottish mainland. His father was John McMillan, the Parish schoolmaster and also the local registrar, and his mother was Eliza McDougall. Donald became a student at Aberdeen University, graduating with an M.A. in\n1876\n.\nMacmillan became Principal of Clifton Bank School, St Andrews. We should give a few details about this school. The main school in St Andrews was\n(\nand still is\n)\nMadras College, founded by Dr Andrew Bell in\n1832\n. The school had many boarders and there were houses around the town for them run by masters at the school. John Paterson came to Madras College as an assistant master in\n1851\nand ran one of these boarding houses with the assistance of a Mr Pennycook whom he employed as a tutor. In\n1856\nPaterson resigned his position as a Madras master \"because of the extent to which his boarding establishment has increased\". He then ran his boarding house as the independent Clifton Bank School. In\n1881\nPaterson became Provost of St Andrews but continued in his role as Headmaster of the School. Certainly the school was highly successful and it was advertised in\n1884\nas:-\nFor the Board and Education of Gentlemen's Sons.\nMacmillan was working at Clifton Bank School by\n1887\nfor in that year he joined the\nEdinburgh Mathematical Society\ngiving the School as his address. We assume that at this stage he was an assistant to Paterson. In\n1892\nMacmillan took over as Headmaster of the School and he employed Robert Lawson as his assistant. A typical advertisement for the School dating from that period is from August\n1894\n:\nCLIFTON BANK SCHOOL.\nST ANDREWS\nBoarding School for Boys\nD. M'Millan, M.A., Headmaster\nPupils are prepared for the Universities and similar Examinations.\nSCHOOL REOPENS ON TUESDAY,\n2\nnd\nOCTOBER\nMacmillan encouraged \"recreative diversion on a most liberal scale,\" using extensive playing fields besides the Links for the purposes of rugby, cricket and hockey. Boys at Clifton Bank were sent to the golf course three times a week, and sea-bathing was compulsory during the summer months. Clearly the boys became excellent sportsmen as can be seen from many newspaper reports where Clifton Bank has triumphed at rugby or cricket over schools from Fife, Perth, Dundee, and Edinburgh. In\n1904\nWalter G Mair took over as headmaster of Clifton Bank and his name appears in place of those of Macmillan in advertisements from that time on.\nAs we noted above, Macmillan joined the\nEdinburgh Mathematical Society\nin March\n1887\nwhen the Society was in its sixth session, four years after it was founded. He remained a member of the Society until\n1906\n.\nAfter he retired as Principal of Clifton Bank School, St Andrews, Macmillan went to live in the village of Newton of Falkland in Fife.",
  "math_areas": [
    "Algebra"
  ]
}