{
  "nome_completo": "Louise Doris Adams",
  "nome_curto": "Doris Adams",
  "ano_nascimento": "1889",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adams_Louise/",
  "lugar_nascimento": "Tuffley, Gloucester, England",
  "lugar_morte": "Worthing, Sussex, England",
  "biografia": "Louise Doris Adams\nwas the daughter of William Adams\n(1850\n-\n1934)\nand Caroline Evans\n(1862\n-\n1924)\n. We note right at the beginning of this biography that she sometimes used the name\nLouise Adams\n, sometimes\nDoris Adams\nand sometimes\nL D Adams\n. William Adams was born in Birmingham, Warwickshire, and married Sarah Louisa Cotterell\n(1848\n-\n1874)\non\n4\nDecember\n1873\nin Gloucester, Gloucestershire. William and Sarah had a son Harold Cotterell Adams\n(1874\n-\n1964)\nborn on\n18\nOctober\n1874\nbut sadly Sarah Adams died on\n9\nNovember\n1874\nso it must have been due to complications following child birth. William Adams married Caroline Evans\n(1862\n-\n1924)\non\n10\nFebruary\n1885\nat Wycliffe Church, Leicester, Leicestershire. William and Caroline Adams had two children, Arthur B Adams, born\n1887\n, and Louise Doris Adams, the subject of this biography. At the time of the\n1891\nUK Census, the family are living at Tuffley, Gloucestershire, close to the city of Gloucester. William Adams gives his occupation as Foreign Timber Merchant and the family have three servants, a cook, a housemaid and a nurse.\nLouise Doris Adams was educated first at Miss Reynolds school in Weymouth, Dorset. Phillis Reynolds ran a private school in Connaught Road, Weymouth, assisted by her sister Jane Reynolds. At the\n1901\nUK Census there were five other teachers living at the school, all women, and the school had nine pupils, all girls, boarding at the school. Doris Adams, aged\n11\nat the time, was the second youngest pupil, the ages of the pupils ranging from\n9\nto\n18\n. The non-academic school staff consisted of a cook, a matron, a parlourmaid and a housemaid. Adams moved to the famous girls boarding school, Roedean School, near Brighton, on the south coast of England due south of London. This school was founded in\n1885\nwith the aim of educating girls for the recently opened women's university colleges. She entered Bedford College for Women, University of London, in\n1906\n. Her Entrance Form gives interesting details about the examinations she took while at Roedean School, and other fascinating details.\nOn the Bedford College Entrance Form Adams' address is Woodside, Loughton, Essex. She had taken the following examinations while at Roedean School:\nDecember\n1901\n, Cambridge Preliminary Examination, III Honours.\nDecember\n1903\n, Cambridge Junior Examination, III Honours.\nJuly\n1905\n, July\n1906\n, Higher Certificate Oxford and Cambridge Schools Examination, Distinction in English.\nJune\n1906\n, London Matriculation Certificate, II.\nOne of the most interesting items on Adams' Entrance Form is the names of her two referees. The first is Charles Pendlebury, M.A. F.R.S.A., Head Mathematical Master at St Paul's School, London and Honorary Secretary of the Mathematical Association. Pendlebury was the author of many mathematics texts such as\nLenses and systems of lenses\n(1884)\n,\nElementary Trigonometry\n(1895)\n,\nA Shilling arithmetic\n(1902)\n, etc. Her second referee is \"The Hon Mrs Bertrand Russell.\" This must be Alys Pearsall Smith, the first wife of\nBertrand Russell\n.\nAdams' record shows that she was in the Faculty of Science and, in her first year at Bedford,\n1906\n-\n07\n, she attended\n400\nhours of lectures. Emily May Williams, Principal of Whitelands College, Putney, writes\n[\n5\n]\n:-\nDuring her years at Bedford College where she took her degree Miss Adams was esteemed for her mathematical ability as well as her strength of character. Her reputation was handed down to my generation and I heard of it with awe, regarding her as one of the great ones of the recent past.\nThe\n1911\nUK Census shows Doris Adams\n(\nthis is the name on the form\n)\nat the home of Arthur H D Acland in Dunkery House, Golf Road, Felixstowe. She must be there visiting her friend Mabel Alice Acland, the daughter of Sir Arthur Herbert Dyke Acland and Alice Sophia Cunningham. Adams graduated with a Second Class Honours Degree in Mathematics from the University of London in\n1911\n. She had a long career as a school teacher and, beginning in\n1925\n, as a school inspector. She writes\n[\n1\n]\n:-\nMy own experience of education divides itself neatly into two halves. In the first half as pupil and as teacher in various schools and colleges I experienced almost every form\n(\nother than technical\n)\nof selective education. During the second half by my own choice I have been immersed in popular education carrying this interest on through contacts with training colleges during ten years of retirement. For much of this later half of my life I functioned as jack-of-all-subjects and I have even tried to conceal the fact that I viewed education with the eyes of a teacher trained as a mathematical specialist.\nIn\n1939\nshe was\n50\nyears old and living at\n10\nThe Avenue, Bristol, giving her occupation as H M Inspector. She had a housekeeper, Evelyn C Squibbs, living with her.\nShe played a large role in the\nMathematical Association\nwhich she joined in\n1914\nand served on two of its committees\n[\n5\n]\n:-\nShe had an unbroken record of fifty-one years of membership and during that period had served on the Teaching Committee for some twenty years, exerting a strong formative influence which helped the Committee to broaden its enquiries until it can now claim to have produced reports on the whole range of school mathematics.\nOne of her main achievements on these committees was to move their focus from what should be taught to children, which had been the main topic of discussion, to getting the committees to think about how children should be taught mathematics. She very much believed that teachers should be leading children to discover for themselves properties of numbers and of space.\nIn\n1948\nAdams was the director of an in-service course for teachers which explored the applications of mathematics to a variety of topics such as astronomy, biology, geography and social sciences. Kate Sowden, Whitelands College of Education, writes in\n[\n5\n]\nthat Adams:-\n... opened many new doors for those attending and they returned to their schools with sufficient ideas to last them for many years. Afterwards Miss Adams visited these teachers and her experienced appraisal of conditions and results helped to raise the status of mathematics in the schools and ensured a larger share of the annual budget for a subject until then largely regarded as non-practical. Miss Adams never came empty-handed and always left behind, in exchange, one might say, for the children's work she took away, a suggestion or a question, thrown out casually, but later found to be full of meaning and a source of fruitful investigation. She talked to the class and her questions went straight to the essential mathematics of the situation, provoking thought as well as demanding replies.\nIn\n1951\nthe\nMathematical Association\nheld their annual meeting during\n28\n-\n31\nMarch in Bristol\n[\n4\n]\n:-\nOn\n30\nMarch the first item was a symposium on Modern School work, organised by Miss L D Adams\n(\nH.M. Inspector of Schools\n)\n. Aspects of Modern School teaching were explained by three teachers from Bristol schools, and a large and varied display of work done by children in Modern Schools was exhibited. Much of this work came from Bristol schools; but items from all parts of Great Britain had been obtained and were on show. An inspection of this work gave the impression that the very considerable difficulties which confront the teacher of mathematics in the Modern School are partially diminished by the comparative freedom under which the work is done.\nWriting about the exhibition, Kate Sowden writes\n[\n5\n]\n:-\nThe work ranged from a drawing by a five-year-old of a large cow and a small calf, each with\n6\nor\n7\nlegs and labelled by Miss Adams, \"Size before Number!\", to photographs and maps resulting from a surveying exercise and some individual assignments completed by the top class of a local boy's school. This exhibition showed work quite advanced for its time and many of the ideas found there are still being put forward as \"new.\" Miss Adams led a team of three speakers in a symposium on this exhibition. For two of these this was the first time of speaking in public, and they greatly appreciated the help she gave on that occasion and the tactful way in which it was tendered.\nAdams wrote the book\nA Background of Primary School Mathematics\nwhich was published by Oxford University Press in\n1953\n. H M Cook reviewed the book for the\nMathematical Gazette\n, the journal of the\nMathematical Association\n[\n2\n]\n:-\nThis is a book based on observation of children and their learning of mathematics. Its main contention is that such learning can only take place against the background of the child's whole experience, and that this is necessarily a different background for each child. In the early stages, the experience is all important, and no re-iteration of words or symbols can take its place: in fact, according to the writer, if such words and symbols are introduced too early, and not adequately related to experience, they hinder, and my even prevent, mathematical development. An able child learns more quickly from his experience, and each bit of it therefore recedes more quickly into the background of his thinking, than is the ease with a slow child; but a rich experience is necessary for all. Miss Adams tells stories of some eighty individual children, of all ages from two to twelve, observed in their homes, in school, or in chance meeting in train or bus; she describes work seen in progress in about fifteen classes and she suggests other ways in which primary school mathematics may be linked with the children's experience. The teachers and children referred to are incognito, and her pictures are composite ones, but she has combined them to make a readable account from which teachers will learn much. For the book is addressed to teachers, and intending teachers, and, though some will find in it implied criticism of methods they have practised, all will appreciate the sympathetic insight into situations as they confront the learner. Some parents, and, perhaps, some teachers, will be surprised to discover how much more there is in learning mathematics than the rote mastery of tables, and the careful carrying out of \"rules\" shown by the teacher. Perhaps some reader will feel constrained to examine anew the background of his own mathematical thinking, and cultivate afresh his mathematical imagination, as a prelude to cultivating more effectively the mathematical imagination of his pupils\n(\nsee page\n170)\n. It is acknowledged that when observing children it is easier to describe the very slow learner on the one hand, and, on the other, the initiative and powers of expression of the markedly able, than it is to give any picture of the children between: on the whole, too, more opportunities have occurred for recording the individual experiences of the under-sixes. The chapter\n(\nVIII\n)\non 'Written Reckoning' has but few references to actual incidents, but will repay careful reading and provoke thought: it contains an analysis of necessary mental preparation for reckoning.\nIn\n1959\nshe was elected President of the\nMathematical Association\n, serving\n1959\n-\n60\n, only the second woman to be elected to this role, the first being\nMary Cartwright\n. She delivered the Retiring Presidential Address\nFull Cycle\nto the annual meeting of the\nMathematical Association\non\n7\nJanuary\n1960\nin King's College, London\n(\nsee\n[\n1\n]\n)\n. A version of her address is given at\nTHIS LINK\n.\nAs old age approached, Adams continued to actively and enthusiastically support the West Country group of the Association as well as travelling with some of the members to London to chair meetings of\nMathematical Association\ncommittees. She would take the\n7\n:\n45\ntrain from Bristol to London, returning on the\n17\n:\n00\ntrain from Paddington\n[\n5\n]\n:-\nDuring the long day as Chairman she remained bright and cheerful, feeding the hungry with chocolate and resolving impasses with her mature judgement and wisdom. On the way home when younger members were flagging she enlivened the journey with tales from her early days in the inspectorate when a woman inspector was a novelty and expected by headteachers to be interested in girls' subjects only. Miss Adams drove her committee hard, particularly those within telephoning distance, who might be roused at an early hour to hear of a new idea. But she did the lion's share of the writing herself.\nIn\n1960\n, when she delivered her retiring address as President of the\nMathematical Association\n, her address was The Small House, Oxford Street, Eddington, Berkshire. Near the end of her life, however, she was living at\n2\nBradley House, Heene Road, Worthing, Sussex. She died on Christmas eve of\n1965\n. Emily May Williams writes\n[\n5\n]\n:-\nMiss L D Adams had a personality of such warmth and generosity that her loss will be deeply felt by very many people associated with education. Some will have known her personally through her visits to schools as H.M.I., or her lively contributions at conferences and refresher courses. We in this Association mourn her as one of our most distinguished members.",
  "math_areas": [
    "Analysis"
  ]
}