{
  "nome_completo": "Dorothy Lewis Bernstein",
  "nome_curto": "Dorothy Bernstein",
  "ano_nascimento": "1914",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernstein_Dorothy/",
  "lugar_nascimento": "Chicago, Illinois, USA",
  "lugar_morte": "Providence, Rhode Island, USA",
  "biografia": "Dorothy Bernstein\nwas the daughter of Jacob Louis Bernstein\n(1880\n-\n1956)\nand Tillie Lewis\n(1887\n-\n1969)\n. Jacob Bernstein was Jewish and had been born on\n2\nJanuary\n1880\nin Lisovich, Russia, the son of Nuchem Bernstein and Dobche Karsunsky. His family emigrated to the United States in\n1886\n. Tillie Lewis was born on\n18\nJune\n1887\nin Shubovka, Ukraine into a Jewish family with parents Shloime and Sureh Loyev. After she emigrated with her family to Milwaukee in\n1905\n, they all adopted the name of Lewis. Jacob and Tillie were married in Milwaukee on\n19\nDecember\n1912\n. Let us note at this point that census forms do give some different versions of names and also some inconsistencies over dates. For example in the\n1920\nUS census, Tillie's name is given as Matilda. On the\n1930\ncensus form Jacob Bernstein gives\n1886\nfor his year of immigration to the United States, while\n[\n12\n]\ngives\n1902\n. Jacob and Tillie Bernstein were both naturalised in\n1914\n.\nDorothy Bernstein, the eldest of her parents children, was born in Chicago in\n1914\n. Her father had been in the dairy business there since\n1911\n. Two sisters for Dorothy were born in Chicago before the\n1920\ncensus, Naomi Ruth Bernstein\n(1915\n-\n1996)\nborn\n22\nNovember\n1915\n, and Myrtle Bernstein\n(1917\n-\n1992)\nborn\n30\nNovember\n1917\n. In\n1918\nthe family moved to Jackson, Wisconsin where they were living at the time of the\n1920\ncensus in which Dorothy's father is recorded with the occupation \"farmer\". Two further children were born in Jackson, Elinor Bernstein who was born in the summer of\n1919\nbut died of gastroenteritis on\n8\nFebruary\n1920\n, and Clarice Bernstein\n(1922\n-\n2010)\nborn\n19\nMay\n1922\n. The family moved again in\n1924\n, this time to Milwaukee where Jacob founded the Sunshine Dairy. Sheldon Bernstein\n(1927\n-\n2014)\n, Dorothy's youngest sibling, was born in Milwaukee on\n23\nMarch\n1927\n. The\n1930\ncensus records the family living in rented accommodation on Thirty Eight Street.\nBefore we continue with Dorothy Bernstein's biography, let us give a brief description of the lives of her four surviving siblings. Naomi Bernstein attended Washington High School in Milwaukee, married Eziel Golan on\n10\nSeptember\n1939\nin New York, and was awarded a Ph.D. in Social Work from The University of Chicago in\n1969\n. She died in Jerusalem, Israel in February\n1996\n. Myrtle Bernstein attended Washington High School in Milwaukee, married Edwin LeBow on\n29\nDecember\n1951\nin Milwaukee, was awarded an MD degree and died in Jerusalem, Israel in January\n1992\n. Clarice Bernstein was known as Yaffa and is the author of\n[\n12\n]\n. She attended Washington High School in Milwaukee, married the author Julius Nathan Draznin and was awarded a Ph.D. in History from the University of Southern California. She died in Chicago on\n23\nJune\n2010\n. Sheldon Bernstein attended Washington High School in Milwaukee, married Estelle Lou Katz on\n27\nJune\n1948\nin Milwaukee. He was awarded a Ph.D. in Biochemistry from the University of Wisconsin in\n1952\n.\nSince Dorothy's four siblings all attended Washington High School in Milwaukee, we might expect her to have also been a pupil there but that is not the case. After attending a public primary school in Milwaukee, Dorothy Bernstein entered the Roosevelt Junior High School in Milwaukee in\n1926\n, the year the school opened. It was the first junior high school to be built in Milwaukee situated on Lapham Park. After one year at this school, she entered the North Division High School. This was one of the largest schools in Milwaukee and had opened in\n1906\n. She graduated from the North Division High School in\n1930\n, at age sixteen, as valedictorian. She gave the Valedictory Address\nThe New Frontier\nat 'The Commencement' held on Thursday evening,\n19\nJune\n1930\n. In\n[\n24\n]\nsome of Bernstein's achievements and activities over her three years at the school are listed:-\nMathematics Course. Entered as Sophomore from Roosevelt Junior High School. A. A.,\n1927\n-\n30\n; Cadet,\n1927\n-\n30\n; Forensics,\n1929\n; Girls' Club,\n1927\n-\n30\n, Treasurer\n1930\n; Elected to National Honor Society,\n1930\n; Leaders,\n1930\n; Local Honour Club,\n1928\n,\n1929\n; Writers' Club,\n1928\n-\n30\n; Library Monitor,\n1928\n-\n29\n; Valedictorian,\n93\n.\n71\n%.\nThe leader of our class\nIs this brilliant, genial lass.\nDorothy Bernstein. \"Hail to thee, blithe spirit!\" Mortal, thou never wert, that thou canst raise such high marks without seeming to work. And among Dorothy's many virtues is the happy faculty of making firm friends.\nShe entered the Honor Role for April\n1930\nhaving achieved\n90\n% or above in all subjects and won a scholarship of two hundred and fifty dollars, given annually by the American Association of University Women. This was obtained in a competitive examination.\nAfter graduating from the North Division High School, she entered the University of Wisconsin at Madison where she majored in mathematics. Let us quote from Dorothy Bernstein's own description\n[\n1\n]\n:-\n... it was an exciting time to be a student, since Alexander Meiklejohn's experimental college was just finishing its short but brilliant career at the university, and one of its legacies was the system of advanced independent study, in which I spent my junior and senior years. For two full years, including summers, a student was allowed to study his major subject on his own, attending such lectures as he desired and talking with any member of the department he wished, but with no exams or grades. He was expected to write a thesis during his second year and take a comprehensive examination at the end of the period. On the basis of these two things\n(\nthe thesis and the single examination\n)\n, he was awarded either a B.A. degree or B.A. and M.A. degrees, together with the appropriate number of credits and a single grade that was determined by the department. Most students, of course, were unwilling to take the gamble, but the few of us who did thoroughly enjoyed it. In my case, I would study some subjects like advanced calculus or introductory abstract algebra for a month at a time, by myself, meeting weekly with my advisor, Mark Ingraham. For other things, such as complex variables or\nGalois\ntheory, I attended the regular graduate course lectures. My thesis was on finding complex roots of polynomials by an extension of\nNewton\n's method. I received my B.A. and M.A. degrees at the end of four years and then returned to Wisconsin for an additional year of graduate work as a teaching fellow. Besides Professor Ingraham, I especially remember among my teachers Rudolf Langer and\nC C MacDuffee\n. All three encouraged me to continue graduate study in mathematics, but at another university.\nIn\n1934\nBernstein was awarded B.A. and M.A. degrees, and spent\n1934\n-\n35\ndoing teaching and research at the University of Wisconsin before moving to Brown University to continue studying for her Ph.D. with a two-year scholarship. It was at Brown that she first encountered what she considered stupid discrimination because she was a woman. Bernstein and a colleague Hugh Hamilton were asked to teach a remedial course, Bernstein at Pembroke College, the associated women's college, and Hamilton at Brown. She had three women students and he had forty-five male students. Much more sensible, she said, to divide the class into two groups of twenty-four. The head of the department, however, would not hear of it, saying that the boys would object to having a woman teacher, so for the whole semester she taught three students at Pembroke College. After one year Bernstein took the examinations to qualify for the Ph.D. course. The oral examination by the full Brown Mathematics Department consisted of two afternoons of four hours each. Her fellow students had examinations lasting between two and three hours so she asked why her examination had lasted so long. She was told it was partly because she was a woman and partly because she had taken most of her courses at a Midwestern university. She said\n[\n1\n]\n:-\nI am not sure which of the two was more prejudicial.\nShe undertook research at Brown advised by J D Tamarkin and at the same time worked as an Instructor in Mathematics at Mount Holyoke College from\n1937\nto\n1940\n. We should quote from\n[\n1\n]\nhow she managed to get this appointment:-\n...\nR G D Richardson\n, ... was Dean of the Brown Graduate School and also Secretary of the\nAmerican Mathematical Society\nfor many years. In his latter capacity, he was consulted by many people about hiring personnel - I have heard stories, perhaps exaggerated, that he was a one-man employment bureau for mathematicians throughout the country. I do know, however, that when I came to see him, as we all did, about a college teaching job, he took out a map of the United States, covered the region west of the Mississippi and said: \"You can't get a job there, because you are a woman.\" Then he covered the part south of the Ohio River and said: \"And you can't get a job there, because you are Jewish.\" So that left the Northeast quadrant. Well, it happened that I heard of a job at Mount Holyoke and after a visit to South Hadley, I got the position. When I told the Dean, he expostulated \"But I had that job all reserved for Hamilton!\"\nBernstein was awarded a Ph.D. by Brown University in\n1939\nfor her thesis\nThe double Laplace integral\n. She published a paper containing the main results of her thesis, and with the same title, in the\nDuke Mathematical Journal\nin\n1941\n. It was reviewed by\nRalph Boas\nwho writes:-\nThe author studies functions of the form\n[\nof the double\nLaplace\nintegral\n]\n. ... Some properties are analogues of known properties of single\nLaplace\nintegrals; others are rather different. Much of the theory of double\nDirichlet\nseries generalises to\n[\nthe double\nLaplace\nintegral\n]\n. Some of the author's results have been previously stated by other writers in more or less complete, and occasionally incorrect, form\n(\nthe author gives an extensive bibliography\n)\n. This paper, however, seems to be the first systematic exposition of any substantial part of the subject. As in the theory of double\nDirichlet\nseries, the useful kind of convergence for\n[\nthe double\nLaplace\nintegral\n]\nis bounded convergence. The existence of associated abscissas of bounded convergence is established, and several formulas for them are obtained. Absolute convergence and uniform bounded convergence are also discussed.\nThe position as instructor at Mount Holyoke College ended in\n1940\nand she returned to Milwaukee for a while before returning to the University of Wisconsin in\n1941\nas an instructor. She began to broaden her mathematical interests to look more generally at integration theory and its associated measure theory and worked with\nStan Ulam\nwho had been appointed to Wisconsin in\n1940\n. She presented a joint paper with\nUlam\n, namely\nOn the problem of completely additive measure in classes of sets with a general equivalence relation,\nto the\nAmerican Mathematical Society\nmeeting in Chicago on\n17\nApril\n1942\n.\nAfter the Japanese attack on Pearl Harbor in December\n1941\n, the United States entered World War II and before the end of the month were at war with Japan, Germany and Italy. Many mathematicians became involved in the war effort and, in June\n1942\n, Bernstein was appointed as research associate to\nJerzy Neyman\nat the Statistical Laboratory of the University of California at Berkeley where much secret work was being undertaken on behalf of the US Army. She worked on various probability problems which\nNeyman\ngave her and also taught a graduate course on probability theory for the Department of Mathematics. She explained in\n[\n1\n]\nwhy she left after eight months:-\nNeyman\nand I did not see eye-to-eye on what was the mathematical justification of a statistical procedure. Of course, since then I have learned that this is not unusual - mathematicians and statisticians do have fundamentally different points of view, even though they may use the same techniques.\nNeyman\nexplained her leaving in the following way\n(\nsee\n[\n16\n]\n)\n:-\nDorothy Bernstein ... has just come to me and said she doesn't like the kind of stuff that we do because it's not really nice mathematics. She wants to leave.\nShe had left without having any other employment so for several months she sought a position. In the autumn of\n1943\nshe was employed by the University of Rochester, a private university in New York. At this time the university had the River Campus for male students and the Prince Street Campus for female students. At first she taught at the Prince Street Campus but after a while all science was taught at the River Campus, women having to take science courses there, and from that time on Bernstein taught at the River Campus. Appointed as an Instructor, she was promoted to Assistant Professor in\n1946\n, to Associate Professor in\n1951\nand to full Professor in\n1957\n.\nCharles Brown Tompkins\n(1912\n-\n1971)\nhad held a visiting lectureship at the University of Wisconsin and got to know Bernstein when they both worked there. Tompkins did war work involving high speed computing and, in\n1949\n, he organised, on behalf of the Office of Naval Research, the Logistic Research Project at George Washington University. He asked Bernstein to make a study of existence theorems in partial differential equations, believing these would play a significant role in solving non-linear problems on computers. Her study became the book\nExistence Theorems in Partial Differential Equations\n(1950)\n. In reviewing this book, D H Parsons writes\n[\n23\n]\n:-\nProfessor Bernstein has compiled a comprehensive, and most interesting, collection of existence theorems, which will be a welcome addition to the libraries of those who are interested in the theory of partial differential equations. All conditions of continuity, differentiability, etc., which are assumed in each theorem are meticulously stated; and the proofs, which are mostly given in outline only, are nevertheless thorough and rigorous. Ample references are provided throughout the text to literature dealing in detail with each problem, and the book thus fulfils a valuable function in helping the reader to find both statements and proofs of the less well-known theorems. Unfortunately the very abridged and rather artificial notations employed, though providing excellent economy of words in the careful statements of conditions, prevent the work from being really pleasant or easy reading.\nBernstein was a member of the Institute for Advanced Study in\n1950\n-\n51\nand spent her sabbatical year\n1957\n-\n58\nas a visiting professor at the University of California's Institute for Numerical Analysis in Los Angeles. While at the University of Rochester Bernstein supervised the Ph.D. studies of Geraldine \"Jerry\" Alma Coon\n(1913\n-\n2008)\n[\n14\n]\n:-\nCoon was born in\n1913\n, in North Stonington, Connecticut. She received a bachelor's degree from the Connecticut College for Women in\n1935\nand a master's degree in mathematics from Brown University in\n1937\n. She worked as an instructor in shop mechanics for high school graduates at the Scovill Manufacturing Company in Waterbury, Connecticut, from\n1939\nto\n1944\n. She then moved to Taylor Instrument Companies in Rochester, New York, where she was a research mathematician from\n1944\nto\n1958\n. While working at Taylor Instrument, Coon received a Ph.D. in mathematics from the University of Rochester in\n1950\n. Her dissertation, entitled \"The Double Laplace Transform and Its Application to Partial Differential Equations,\" was overseen by Dorothy L Bernstein.\nBernstein and Coon published the joint paper\nSome properties of the double Laplace transformation\nin the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1953\n. They went on the publish two further joint papers,\nSome general formulas for double Laplace transformations\n(1963)\nand\nOn the zeros of a class of exponential polynomials\n(1965)\n. T E Hall, reviewing the\n1963\npaper, writes:-\nSeveral theorems are presented about the convergence of the\nLaplace\ntransforms of certain functions, and their derivatives. The latter are required to satisfy certain continuity requirements, and also some restrictions on their growth with increasing size of variable, or variables.\nIn\n1959\nshe left the University of Rochester and moved to Goucher College, a private liberal arts college in Towson, Maryland. During the twenty-one years that Bernstein worked there,\n1959\nto\n1979\n, Goucher College was a women's college, only becoming co-educational in\n1986\n. She served as chair of the Mathematics Department from\n1960\nto\n1970\nand director of the Computer Center from\n1962\nto\n1967\n[\n16\n]\n:-\nWhile at Goucher, Bernstein became very active in the uses of the computer in education and in the spring of\n1971\nwas part of a group that founded the Maryland Association for the Educational Uses of Computers. She was instrumental in obtaining funds for computers at Goucher and helped run an National Science Foundation summer institute in computer-based mathematics for high school teachers.\nAfter retiring in\n1979\n, Bernstein was made professor emeritus. She was awarded an honorary degree from Towson State University in\n1981\nand in\n1985\nshe was awarded a Certificate for Meritorious Service from the Maryland-District of Columbia-Virginia Section of the\nMathematical Association of America\n. In fact she served the\nMathematical Association of America\nin many different roles, the most prestigious being vice president\n1972\n-\n73\nand president\n1978\n-\n80\n; she was the first woman to be elected president. She presented talks, by invitation, to the\nAssociation\n, for example\nHow to make and break codes - cryptanalysis and mathematics\n(5\nMay\n1973)\n,\nA differential equation of literary criticism\n(27\nApril\n1979)\n,\nMathematical modeling and existence theorem\ns\n(26\nOctober\n1979)\n,\nWho is the MAA?\n(15\nFebruary\n1980)\n,\nPreparation for careers in applied mathematics\n(11\nApril\n1980)\n,\nA small college's experience with applications in the mathematics curriculum\n(18\nApril\n1980)\n,\nThe biography of a theorem\n(20\nApril\n1981)\n,\nMathematical expectation\n(17\nJanuary\n1982)\n.\nJerry Coon, Bernstein's former research student, became a colleague of Bernstein's at Goucher College from\n1964\nuntil\n1979\nwhen they both retired. Coon and Bernstein then shared a home on the Pawcatuck River in Connecticut. Writing about Bernstein in\n1979\n, Coon wrote a clear description of Bernstein's mathematical activities and work at Goucher in\n[\n6\n]\n. She then writes:-\n... whenever possible,\n[\nDorothy Bernstein\n]\nindulges in her favourite hobbies of gardening, canning, and freezing. She intends to maintain the famous Bernstein Box at the Preakness, where annually the laws of probability and statistics fall into complete disarray.\nBernstein was treated for her final illness in Rhode Island Hospital, Providence, where she died at the age of seventy-three. She was buried in Anshai Lebowitz Cemetery, Milwaukee where her father and mother had been buried.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}