{
  "nome_completo": "Douglas Rayner Hartree",
  "nome_curto": "Douglas Hartree",
  "ano_nascimento": "1897",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hartree/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Douglas Hartree\n's parents were Eva Rayner, who played a major role in public life being president of the National Council of Women and mayor of Cambridge, and William Hartree who taught in the engineering laboratory a the University of Cambridge. Eva and William had three sons; Douglas was the oldest and both of his two younger brothers died before reaching adulthood.\nDouglas's school education was in Cambridge and Petersfield. It was at Bedales school that he first became interested in mathematics and this was due to the excellent teaching of the subject at that school. He entered St John's College Cambridge in\n1915\nbut World War I interrupted his studies and he joined a team studying anti-aircraft gunnery.\nHe returned to Cambridge after the war and graduated in\n1921\nbut, perhaps because of his interrupted studies, he only obtained a Second Class degree in Natural Sciences. However he went on to obtain a doctorate in\n1926\nand, after being a Fellow of St John's College\n(1924\n-\n27)\nand Christ's College\n(1928\n-\n29)\n, he was appointed professor of applied mathematics at the University of Manchester. During his studies at Cambridge he married Elaine Charlton of Keswick in\n1923\n. They had one daughter and two sons.\nHartree held the chair at Manchester from\n1929\nto\n1937\nwhen he moved to the chair of theoretical physics. After undertaking work with the Ministry of Supply during World War II, he was appointed Plummer Professor of Mathematical Physics at Cambridge in\n1946\n. He held this post until his death.\nHartree was basically a theoretical physicist, and he developed powerful methods in numerical analysis. His initial interest in numerical methods arose from his work on anti-aircraft gunnery in\n1916\n-\n18\n. However\nNiels Bohr\ngave a lecture course in Cambridge in\n1921\nand Hartree was much influenced, working on applications of numerical methods for integrating\ndifferential equations\nto calculate atomic wave functions.\nHartree learnt of a differential analyzer being developed by Vannevar Bush in the USA. This machine, first proposed by Lord Kelvin\n(\nWilliam Thomson\n)\n, performs integration with a wheel rolling on a rotating disk. Hartree visited Boston to learn about the workings of the differential analyzer, then returned to Manchester and built his own.\nThe differential analyzer was soon to be replaced by electronic computers and when\nJohn Eckert\nset up ENIAC, Hartree was asked to go to the USA to advise on its use. He showed how to use ENIAC to calculate trajectories of projectiles. In his inaugural address on his appointment to the chair in Cambridge in\n1946\nhe said:-\nIt may well be that the high-speed digital computer will have as great an influence on civilization as the advent of nuclear power.\nIn addition to applying numerical methods to ballistics, Hartree applied them to the physics of the atmosphere and to hydrodynamics. He wrote a number of important books including\nNumerical analysis\nin\n1952\nwhich became a classic of the subject. In this book he writes:-\nAnyone intending to undertake a serious piece of calculation should realise that adequate checking against mistakes is an essential part of any satisfactory numerical process. No one, and no machine, is infallible, and it may fairly be said that the ideal to aim at is not to avoid mistakes entirely, but to find all mistakes that are made, and so free the work from any unidentified mistakes.\nOne of Hartree's strengths was in the breadth of his research knowledge. He was also an outstanding lecturer, able to sum up the level of his audience with his intuition, and brilliantly pitch his explanations for maximum effect. He had many interests outside mathematics, especially music with both his piano playing and conducting an amateur orchestra. Another interest, which he had from boyhood, was railways, particularly in the problems of signalling. He put his mathematical skills to good use in this hobby later in his life when he advised railway companies on their traffic problems.\nHe is described in\n[\n2\n]\nas follows:-\nThe kindest of men, he set up or recognised no barriers between himself and others; differences in age, in particular, meant nothing to him and men a fraction of his age felt at ease in his presence.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}