{
  "nome_completo": "Duncan Farquharson Gregory",
  "nome_curto": "Duncan Gregory",
  "ano_nascimento": "1813",
  "ano_morte": "1844",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gregory_Duncan/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Duncan Gregory\n's great great grandfather was\nJames Gregory\nand he was the youngest son of another James Gregory\n(1753\n-\n1821)\nwho was professor of medicine at Edinburgh University. His mother was Isabella McLeod and she was left to bring up the family after Duncan's father died when he was seven years old.\nDuncan was educated by his mother until he was ten years old then, after this, by a private tutor. His liking for constructing mechanical devices was noticed at this early age. In October\n1824\nhe entered Edinburgh Academy\n(\nwhere\nMaxwell\nand\nD'Arcy Thompson\nwere to be educated\n)\n. He showed great promise at school and, during the winter of\n1827\n, Gregory was sent to an academy in Geneva where his mathematical talents were obvious to the teachers. On his return from Geneva, Gregory became an undergraduate at Edinburgh University where he began to study advanced mathematical topics and he also conducted experiments with polarised light. He was most influenced by\nWilliam Wallace\nwho held the chair of mathematics at Edinburgh University.\nIn October\n1833\n, at the age of\n20\n, Gregory entered Trinity College, Cambridge, receiving his B.A. in\n1837\n, being ranked fifth\nwrangler\n, and his M.A. in\n1841\n. However his interests were not only in mathematics for at Cambridge he continued to pursue his interest in chemistry which he had shown while an undergraduate at Edinburgh University. He was one of the founder members of the Cambridge Chemical Society but had broader interests than even mathematics and chemistry for he also studied physics, astronomy and botany. In October\n1840\nhe became a Fellow of Trinity and also an assistant tutor at the College, devoting himself entirely to mathematics from this time on. At this time the\nCambridge Mathematical Journal\nwas beginning publication and Gregory became its first editor. Many of the papers in the early parts of the Journal are written by Gregory himself. Gregory declined a chair in Toronto in\n1841\ndue to ill health. He returned to Edinburgh, where he was an unsuccessful applicant for a chair, but he died there shortly afterwards in his father's house, Canaan Lodge, at the age of\n30\n.\nHis main contribution was his theory of algebra which he defined as the study of the combinations defined by the laws of operation to which they were subject. This is one of the first definitions of modern algebra. His work in this area is described in the paper\nOn the real nature of symbolic algebra\nwhich Gregory published in the\nTransactions of the Royal Society of Edinburgh\n. In this work Gregory built on the foundations of\nPeacock\nbut went far further towards modern algebra. Gregory, in his turn, had a major influence on\nBoole\nand it was through his influence that\nBoole\nset out on his innovative research.\nTwo other important works by Duncan Gregory are\nExamples of the Processes of the Differential and Integral Calculus\nand\nA Treatise on the Application of Analysis to Solid Geometry\n. The first became an important text at Cambridge which, by this time, had accepted\nPeacock\n,\nHerschel\nand\nBabbage\n's Analytical Society reforms, and continental methods of calculus were being taught in Cambridge. The second work was unfinished at his death but completed and published the following year.\nHe is described in\n[\n2\n]\nas follows:-\nOn the whole, his work reveals a vast acquaintance with continental mathematics, and is often enlivened with historical remarks. The quality of his mathematical advances was indeed unusual for one who never held a senior position in the university. Of an amiable disposition and an active disinterested kindness, he unfailingly shared with others the extent and variety of his information, and his experience as an editor.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry"
  ]
}