{
  "nome_completo": "Duncan MacLaren Young Sommerville",
  "nome_curto": "Duncan Sommerville",
  "ano_nascimento": "1879",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sommerville/",
  "lugar_nascimento": "Beawar, Rajasthan, India",
  "lugar_morte": "Wellington, New Zealand",
  "biografia": "Duncan Sommerville\nwas the son of the Rev Dr James Sommerville. He was educated at Perth Academy\n(\nless than\n50\nkm from St Andrews\n)\nthen at the University of St Andrews in Scotland. He was awarded a scholarship in\n1899\nto allow him to continue his studies at St Andrews. He taught there from\n1902\nto\n1914\nbeing appointed Lecturer in Mathematics in\n1905\n.\nTurnbull\n, writing in\n[\n3\n]\n, describes Sommerville in these terms:-\nHis scholarly and unobtrusive demeanour as a young lecturer won the admiration of his colleagues and pupils in St Andrews where his teaching left a permanent mark. While he was essentially a geometer he had considerable interests in other sciences, and it is noteworthy that the classes which he chose to attend in his fourth year of study had been Anatomy and Chemistry. Crystallography in particular appealed to him, and doubtless these possible outlets influenced his geometrical concepts and led Sommerville to ponder over space filling figures, and gave an early impetus to thoughts in a field he made particularly his own. He had an original mind, and beneath his outward shyness considerable talents lay concealed: his intellectual grasp of geometry was balanced by a deftness in making models, and on the aesthetic side by an undoubted talent with the brush.\nIn\n1915\nSommerville left Scotland for New Zealand to take up a new appointment as Professor of Pure and Applied Mathematics at Victoria College Wellington.\nIn\n1919\n, when the professor of mathematics at Otago University suffered a nervous breakdown, a young student there\nA C Aitken\nwas left without support and Sommerville began to tutor\nAitken\nwith a weekly correspondence.\nOutside mathematics one of Sommerville's interests was astronomy and he was a founder of the New Zealand Astronomical Society as well as being its first secretary.\nSommerville worked on\nnon-euclidean geometry\nand the history of mathematics. He proved in\n1905\nthat there are eleven Archimedian tilings. His research was described by G Timmus as:-\n... the classification of all types on non-euclidean geometry\n(\nincluding those usually excluded as bizarre\n)\n, the extension, involving the measurement of generalised angles in higher space, of\nEuler\n's Theorem on polyhedra, space filling figures, the classification of polytopes\n(\ni.e. the generalisation, in higher space, of polyhedra\n)\n, it is typical that this includes polytopes in non-euclidean space ...\nIn a review of\n[\n2\n]\nDaniel Coray states:-\nBy removing a finiteness condition which is habitually made on the angles formed by the various elements of a pencil\n(\nof lines, planes, etc.\n)\n, Sommerville obtained more general geometries than the usual ones\n(\nEuclid\n,\nLobachevsky\n,\nRiemann\n)\n. He classified them into\n9\ntypes of plane geometries,\n27\nin dimension\n3\n, and more generally\n3\nn\n3^{n}\n3\nn\nin dimension n. A number of these geometries have found applications, for instance in physics.\nIn\n1911\nhe published\nBibliography of non-Euclidean Geometry, including the Theory of Parallels, the Foundations of Geometry and Space of n Dimensions\n. There are\n1832\nreferences to\nn\nn\nn\n-dimensional geometry.\nBooks which Sommerville published were\nElements of Non-Euclidean Geometry\n(1914)\n,\nAnalytic\nConics\n(1924)\n,\nIntroduction to Geometry of n dimensions\n(1929)\nand\nThree Dimensional Geometry\n(1934)\n. He also wrote\n30\npapers on combinatorial geometry.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry"
  ]
}