{
  "nome_completo": "Dunham Jackson",
  "nome_curto": "Dunham Jackson",
  "ano_nascimento": "1888",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jackson_Dunham/",
  "lugar_nascimento": "Bridgewater, Massachusetts, USA",
  "lugar_morte": "Minnesota, USA",
  "biografia": "Dunham Jackson\nwas the son of William Dunham Jackson and Mary Vose. William Jackson was a teacher of science and mathematics at the Normal School in Bridgewater, the school that both he and Mary Vose had attended. Dunham was an exceptional child, learning a broad range of subjects from his father\n[\n5\n]\n:-\nAs soon as Jackson was of walking age, he became his father's companion on long hikes and his father's interest in science made these excursions essentially field trips for the study of botany, zoology, and geology. Thus, very early, Jackson acquired from his father a vast store of miscellaneous information and habits of observation that he never outgrew. At an early stage, he started reading the science textbooks in his father's library.\nDunham attended both elementary school and high school in Bridgewater. He excelled in high school, not only in science subjects but also in English literature, Latin, Greek and German. He loved poetry and learnt a wide range of English poetry by heart and, perhaps even more remarkably, also poetry in Latin and German. He delighted in teaching this poetry to his younger sister while they did household chores together. In addition to these academic interests, he loved many sports, enjoying baseball, tennis, skating, cycling, swimming, sailing, and hiking. In\n1904\n, when only sixteen years old, Jackson began his studies at Harvard University.\nAlthough mathematics was the main subject that Jackson studied at Harvard, he also took courses in astronomy, chemistry, physics, classical languages and modern languages. His work was outstanding and in recognition of his achievements he was awarded a Wendell Scholarship, and later a Palfrey Exhibition and the Richard Augustine Gambrill Scholarship. During these undergraduate years the lecturer who influenced him most was\nMaxime Bôcher\n; it was advice from\nBôcher\nthat led to Jackson's first paper\nResolution into Involutory Substitutions of the Transformations of a Nonsingular Bilinear Form into Itself\n(1909)\nwhich he wrote while still an undergraduate. Jackson graduated from Harvard with an A.B\n(\nwith distinction in mathematics\n)\nin\n1908\nand an A.M. in\n1909\n. During\n1908\n-\n09\nwhile he was studying for his Master's degree he held a George C Shattuck Fellowship and was appointed as an assistant in astronomy. Harvard awarded him the Rogers Fellowship for his studies at Göttingen for\n1909\n-\n10\nand the Edward William Hopper Fellowship for the following year.\nAt Göttingen, Jackson learnt much from\nDavid Hilbert\n,\nFelix Klein\nand\nErnst Zermelo\n, but the strongest influence on him was\nEdmund Landau\nwho was his advisor. During these two years abroad he also visited Bonn, where he spent two months attending lectures by\nFelix Hausdorff\nand\nEduard Study\n, and Paris where he spent a few weeks attending lectures by\nÉmile Picard\n,\nÉdouard Goursat\nand\nJacques Hadamard\n. Jackson was awarded his doctorate by Göttingen in\n1911\nfor his dissertation\nÜber die Genauigkeit der Annäherung stetiger Funktionen durch ganze rationale Funktionen gegebenen Grades und trigonometrische Summen gegebener Ordnung\nⓉ\n(\nOn the accuracy of the approximation of continuous functions by rational integral functions and trigonometric sums of a given degree and order\n)\n. Jackson wrote in the Preface to\nThe theory of approximation\n(1930)\n:-\nGuided partly by natural inclinations, perhaps, and partly by recollection of a course on methods of approximation which I had taken with Professor Bôcher a few years earlier, I committed myself to one of the topics which\nEdmund Landau\nhad proposed for a thesis, an investigation of the degree of approximation with which a given continuous function can be represented by a polynomial of given degree. When I reported my choice he said meditatively \"... Das ist ein schönes Thema, ich beneide Sie um das Thema ... Nein, ich beneide Sie nicht, aber es ist ein wunderschönes Thema.\"\nⓉ\n(\n... This is a beautiful theme, I envy you the theme ... No, I do not envy you, but it is a wonderful theme.\n)\nWe should note that in fact Jackson extended the topic from that proposed by\nEdmund Landau\nto include approximation by trigonometric sums in addition to approximation by polynomials. William Hart writes\n[\n5\n]\n:-\nJackson's thesis answered a prize question which had been proposed earlier by the Göttingen faculty: \"Would it be possible to improve on results\n(\non approximation by polynomials\n)\npreviously obtained by\nde la Vallee-Poussin\nand\nLebesgue\n?\" In a complimentary statement awarding Jackson the prize, we find the remark: \"The author ... has enriched the science with valuable results, all in competition with mathematicians of the first rank.\"\nIt is no reflection on Jackson's later achievements to remark that his thesis was one of his most important pieces of mathematical research. The fact that his results improved on those of very famous mathematicians gives sufficient assurance of the quality of his thesis, and Landau was amply justified when he labelled its topic \"ein wunderschönes Thema.\" Jackson thus had the rare good fortune to produce, in his first major effort, results which were fundamental for the development of a major field.\nWe should note that Jackson produced this remarkable thesis despite having health problems. In the spring of\n1910\nhe contracted polio but somehow managed to continue his research throughout the illness which left him with a permanent limp. He kept news of the illness from his family and they only discovered what he had gone through after he returned to his home town after defending his thesis on\n12\nJuly\n1911\n. Given the outstanding achievements in the thesis it will come as no surprise to learn that he received the degree with distinction.\nBack in the United States, Jackson was appointed as an Instructor in Mathematics at Harvard in\n1911\nand, five years later, was promoted to Assistant Professor. In\n1917\nhe met Harriet Spratt Hulley who at that time was undertaking graduate studies in English at Radcliffe College. They were married on\n20\nJune\n1918\n; Dunham and Harriet Jackson had two daughters, Anne Hulley Jackson and Mary Eloise Jackson\n[\n4\n]\n:-\nAs an outstanding characteristic, he enjoyed his associations with people. In particular, his congenial wife and family were a continuing source of pleasure and inspiration to him.\nBy the time he was married, Jackson was involved in war work becoming commissioned as an officer in the Ordnance Department. He was sent to work at the Ballistic Unit of the Ordnance Department in Washington, D. C., undertaking the calculation of range tables for artillery. While working there he prepared a\n43\n-page instruction booklet\nThe Method of Numerical Integration in Exterior Ballistics\n. He resigned his commission in the spring of\n1919\nwhen offered a Professorship in Mathematics at the University of Minnesota. In fact the offer from Minnesota was a difficult one for Jackson for, on the one hand, it was a major promotion but, on the other hand, he was moving from Harvard with its big graduate school in mathematics to a place with no graduate school in the subject. However, he was attracted by the opportunity that Minnesota would give him to develop a graduate school and he took up the chair in September\n1919\n. He continued to hold this chair until his death some\n27\nyears later preferring to remain at Minnesota despite receiving a number of attractive offers of chairs in other universities.\nJackson published many important papers and rapidly gained an outstanding reputation as an excellent speaker. It was natural, therefore that the\nAmerican Mathematical Society\nwould invite him to be the principal speaker at its\n1921\nSymposium: he took as his title\nThe General Theory of Approximation by Polynomials and Trigonometric Sums\n. Four years later the Society honoured him with an invitation to be their Colloquium Lecturer.\nEdward Copson\nwrites:-\nIn\n1925\n, Professor Jackson lectured at the\nAmerican Mathematical Society\n's Colloquium on certain aspects of the theory of approximation, i.e. on the theory of approximating to a function of a real variable by means of a finite sum of functions of given form. This theory covers a vast field, and, in his lectures, Professor Jackson chose certain topics in a few corners of this field in which he is personally interested and where he has made valuable contributions.\nThe lectures were published as\nThe Theory of Approximation\n(1930)\nand, in the Preface, Jackson explains the selection of topics:-\nThe title of this volume is an abbreviation for the more properly descriptive one: 'Topics in the Theory of Approximation'. It is an account of certain aspects and ramifications of a problem to which I was introduced at an early stage, and which has given direction to my reading and study ever since.\nJ Shohat reviews the text giving it high praise\n[\n9\n]\n:-\nThe reader will enjoy it as interesting, stimulating, extremely well written, and beautifully printed. Many a worker will be inspired by the pages devoted to\nFourier\nand\nLegendre\nseries and to\nChebyshev\n-\nHermite\npolynomials to try his hand in obtaining similar results for other classes of orthogonal functions, and in particular, for other classes of orthogonal\nChebyshev\npolynomials.\nPerhaps the lasting importance of this book is best illustrated by noting that the\nAmerican Mathematical Society\nreprinted the\n1930\noriginal in\n1994\n. As well as this monograph, Jackson published a student text\nFourier Series and Orthogonal Polynomials\nin\n1941\nin the Carus Mathematical Monographs of the\nMathematical Association of America\n. He explains his position on mathematical rigour in the Preface:-\nUnder the circumstances, 'rigour' in the sense of literal completeness of statement has been out of the question. It is hoped, however, that the reader who is familiar with the methods of rigorous analysis will be able without any difficulty to read between the lines the requisite supplementary specifications, and will find that what has actually been said is entirely accurate in the light of such interpretation.\nCopson\nwrites\n[\n2\n]\n:-\nThe task which the author has set himself is no easy one, but he has succeeded in producing a sound and very readable book well suited to the purpose he had in view.\nShohat\n[\n10\n]\nbegins his review by explaining that the book:-\n... measures up fully to the expectation of the reader who is acquainted\n(\nand who is not?\n)\nwith the lucid and elegant presentation - oral and written - of Dunham Jackson.\nCurtiss writes\n[\n3\n]\n:-\nThe exposition is well organized; much of the formal work is beautifully handled; the proofs are extremely clear. It will not be surprising if this turns out to be one of the most popular of the Carus Monographs. The Association is indeed fortunate to be able to add to the Carus series an exposition by one of the world's foremost authorities on orthogonal polynomials.\nCharles Moore write in his review\n[\n6\n]\n:-\nA proper balance between formal applications and rigorous analysis has been maintained, and the approach in general has the clarity and elegance that one has come to expect from this particular author.\nIn\n1940\nJackson suffered a major heart attack. After recovering he had two years during which he was able to live a reasonably normal life although he had to take things easily. Then he began to suffer a series of minor heart attacks which prevented him from carrying out his teaching duties. By\n1943\nhis life consisted either of lying in a hospital bed or in a bed in his own home. Despite these severe health problems he continued to supervise doctoral students and to write research papers.\nLet us end this biography by looking briefly at his character and his views on certain matters. As to his character, Hart writes\n[\n4\n]\n:-\nJackson was a man of high ideals, extremely unselfish, and very conscious of his responsibilities, not only in strictly personal affairs but also with respect to his profession as an educator and his duties as a citizen. He was intensely devoted to the field of mathematics, had thought deeply of its place in advancing human welfare, and was fluent in expressing his convictions on such matters.\nThe article\n[\n5\n]\ncontains some fascinating extracts from a diary that Jackson wrote while undertaking research in Germany. We give, as an example, just one of these extracts where Jackson is musing about teaching mathematics at an advanced level:-\nWhat is the purpose of a higher course in mathematics? To teach facts or methods? Should a course be simply a succession of theorems with proofs? Or, is it undesirable to try to prove everything? Does a mathematician read and make absolutely clear to himself all the work on which his own original work is based, so that he can assert, of his own knowledge, that the preceding work is true? Or, does he leave something to the accuracy of his predecessor? This is a point on which information ought to be gained by inquiry. Is the purpose of proofs in a higher course to teach methods which will be useful to the pupil or to assure him that every point is based on a rigorous foundation? If the answer to these questions is different for different courses or for different parts of a course, I think it would be well for the teacher to have in mind just what point of view he is adopting at each stage.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}