{
  "nome_completo": "Edmond Nicolas Laguerre",
  "nome_curto": "Edmond Laguerre",
  "ano_nascimento": "1834",
  "ano_morte": "1886",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Laguerre/",
  "lugar_nascimento": "Bar-le-Duc, France",
  "lugar_morte": "Bar-le-Duc, France",
  "biografia": "Edmond Laguerre\nhad poor health as a boy and this impeded his studies. His parents were forced to move him from one public school to another because of these health problems. However he was able to enter the École Polytechnique in Paris in\n1852\nbut he suffered from tiredness every day. Despite showing a talent for modern languages and mathematics he was only ranked\n46\nth\nin his class. This in no way reflected his ability, rather it showed that he was badly affected by health problems. An indication that he was already a talented mathematician is given by the fact that he published his first work during this time.\nOn the theory of foci\nappeared in\n1853\nand it is one of his most important papers, investigating the angle between lines in the complex projective plane. Laguerre graduated from the École Polytechnique in\n1854\nand decided on a military career.\nHe was commissioned as an artillery officer working on the manufacture of armaments at Mutzig, near Strasbourg, from\n1854\nto\n1864\n. However during this period he continued with his mathematical studies and in\n1864\nhe resigned his commission and returned to the École Polytechnique as a tutor. He remained there for the rest of his life but, after\n1874\n, he was an examiner at the École.\nBertrand\n, who was a great admirer of his work, supported him for election to the\nAcademy of Sciences\n, and also supported his appointment to an additional post, namely that of professor of mathematical physics at the Collège de France. He was appointed to this chair in\n1883\nbut his health, which had always been poor, broke down completely in February\n1886\n. He returned to Bar-le-Duc where he died six months later.\nLaguerre studied approximation methods and is best remembered for the\nspecial functions\nthe Laguerre polynomials which are solutions of the Laguerre\ndifferential equations\n. This work came out of his paper published in\n1879\nwhich examined\n∫\n0\n∞\ne\nx\np\n(\n−\nx\n)\nx\nd\nx\n\\int _{0}^{∞}\\large\\frac{exp(-x)}{x}\\normalsize  dx\n∫\n0\n∞\n​\nx\ne\nx\np\n(\n−\nx\n)\n​\nd\nx\nHe found a divergent series, the first few terms of which gave a good approximation to the integral. He also found a continued fraction expansion for the integral, the convergents of which involved the Laguerre polynomials. He went on to investigate properties of the polynomials, proving orthogonality relations and also showing that an arbitrary function could be expanded in a '\nFourier\ntype' series in Laguerre polynomials. Bernkopf writes in\n[\n1\n]\n:-\nThis memoir of Laguerre is significant not only because of the discovery of the Laguerre equations and polynomials and their properties, but also because it contains one of the earliest infinite\ncontinued fractions\nwhich was known to be convergent. That it was developed from a divergent series is especially remarkable.\nOther than mathematics, it was only his family which played a large role in Laguerre's life. He was married with two daughters and he devoted much time and energy to the education of the two girls. Bernkopf writes in\n[\n1\n]\n:-\nLaguerre was pictured by his contemporaries as a quiet, gentle man who was passionately devoted to his research, his teaching, and the education of his two daughters.\nHis most important work was in the areas of analysis and geometry. His work in geometry was important at the time but has been overtaken by\nLie group theory\n,\nCayley\n's work and\nKlein\n's work. Laguerre wrote\n140\nmemoirs which he published in the leading journals of his time so it is reasonable to ask why he is only known for the results mentioned specifically above. Bernkopf examines this question in\n[\n1\n]\n:-\nWhat, then, can be said to evaluate Laguerre's work? That he was brilliant and innovative is beyond question. In his short working life, actually less than twenty-two years, he produced a quantity of first-class papers. Why, then, is his name so little known and his work so seldom cited? Because as brilliant as Laguerre was, he worked only on details - significant details, yet nevertheless details. Not once did he step back to draw together various pieces and put them into a single theory. The result is that his work has mostly come down as various interesting special cases of more general theories discovered by others.\nDespite this assessment\n(\nwhich must be considered as rather harsh\n)\n, there is still interest in Laguerre's work as is seen for example in\n[\n7\n]\nwhere the following is discussed:-\nDeep relations between\nelliptic functions\nand Cartesian ovals were also established in\n1867\n, with the geometrical proofs of the addition theorem of elliptic functions given by\nDarboux\nand Laguerre. When\nDarboux\nproved the orthogonality of systems of homofocal ovals, he also showed that ovals provide a geometrical interpretation of the addition theorem and that they constitute the algebraic form of the integral solution. Laguerre, on the other hand, proved the addition theorem with the help of anallagmatic curves using\nPoncelet\n's theorem on inscribed and circumscribed polygons to two conics.\nThe complete works of Laguerre were published in two volumes; Volume\n1\nin\n1898\nand Volume\n2\nin\n1905\n.\nHermite\n,\nPoincaré\nand\nRouché\nedited both volumes. These were considered interesting enough nearly\n100\nyears later to be reprinted in\n1972\n. In\n1986\na reprint of\nRecherches sur la géométrie de direction\nⓉ\n(\nResearch on the geometry of direction\n)\nappeared which Laguerre had first published in\n1885\n. Again, producing a reprint shows that there is still considerable interest in his results. The work contains six of Laguerre's papers originally published in the\nNouvelles Annales de Mathématiques\n:\nSur le règle des signes en géométrie\nⓉ\n(\nOn the rule of signs in geometry\n)\n(1870)\n;\nTransformations par sémi-droites réciproques\nⓉ\n(\nTransformations by semi-straight reciprocals\n)\n(1882)\n;\nSur les anticaustiques par réflexion de la parabole, les rayons incidents étant parallèles\nⓉ\n(\nOn anticaustics of reflection of the parabola, the incident rays being parallel\n)\n(1883)\n;\nSur quelques propriétés des cycles\nⓉ\n(\nOn some properties of cycles\n)\n(1883)\n;\nSur les courbures de direction de la troisième classe\nⓉ\n(\nOn the direction curves of the third class\n)\n(1883)\n; and\nSur les anticaustiques par réfraction de la parabole, les rayons incidents étant perpendiculaires à l'axe\nⓉ\n(\nOn anticaustics of refraction of the parabola, the incident rays being perpendicular to the axis\n)\n(1885)\n.\nLet us end our biography by quoting\nBonnet\n's assessment of Laguerre:-\nHe was one of the most penetrating geometers of our age: his discoveries in geometry place him in the first rank among the successors of\nChasles\nand\nPoncelet\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}