{
  "nome_completo": "Edmund Gunter",
  "nome_curto": "Edmund Gunter",
  "ano_nascimento": "1581",
  "ano_morte": "1626",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gunter/",
  "lugar_nascimento": null,
  "lugar_morte": "London, England",
  "biografia": "Edmund Gunter\n's father was Welsh, coming from Gunterstown, Brecknockshire, South Wales. Edmund attended Westminster School as a Queen's Scholar, then entered Christ Church, Oxford on\n25\nJanuary\n1600\n. He graduated with a B.A. on\n12\nDecember\n1603\n. Already as an undergraduate, Gunter had developed a strong interest in mathematics and in mathematical instruments. He wrote a manuscript\nNew Projection of the Sphere\nin his final year as an undergraduate and this manuscript was circulated around various mathematical acquaintances. This brought him to the attention of a number of leading mathematicians of the time including\nHenry Briggs\n.\nContinuing his studies at Oxford, Gunter was awarded an M.A. in\n1606\nbut he remained at Oxford until\n1615\nwhen he received the divinity degree of B.D. on\n23\nNovember. Gunter was ordained and in\n1615\nbecame Rector of St George's Church in Southwark and of St Mary Magdalen, Oxford. He held these positions in the Church until his death.\nGunter became a friend of\nBriggs\n, and would spend much time with him at Gresham College discussing mathematical topics.\nBriggs\nwas the first Professor of Mathematics at Gresham College holding the position from the founding of the College. Gresham College had been established in\n1597\nand there was also a Professor of Astronomy from the founding of the College. The first Professor of Astronomy was Edward Brerewood\n(\nabout\n1565\n-\n1613)\n, educated at Brasenose College, Oxford, who had a broad range of expertise from mathematics, to antiquities, to logic and to languages. He died on\n4\nNovember\n1613\nand\nBriggs\nsupported Gunter to be appointed as the second Professor of Astronomy at Gresham College. However, Gunter failed to gain the appointment which went to Thomas Williams. He had been educated at Christ Church, Oxford, and was appointed as Professor of Astronomy on\n11\nNovember, just a week after Brerewood died. Thomas Williams had entered Christ Church in\n1599\n, only one year before Gunter, so could not have had much greater experience. However, by\n1618\nGunter must have spent so much time at Gresham College that\nWilliam Oughtred\nbelieved that he was already a professor there.\nOughtred\nwrote:-\nIn the Spring\n1618\nI being at London went to see my honoured friend Master\nHenry Briggs\nat Gresham College: who then brought me acquainted with Master Gunter lately chosen Astronomical lecturer there, and was at that time in Doctor Brooks his chamber. With whom falling into speech about his quadrant, I showed him my Horizontal Instrument. He viewed it very heedfully: and questioned about the projecture and use thereof, often saying these words, it is a very good one. And not long after he delivered to Master\nBriggs\nto be sent to me mine own Instrument printed off from one cut in brass: which afterwards I understood he presented to the right Honourable the Earl of Bridgewater, and in his book of the sector printed six years after, among other projections he setteth down this.\nThe second Gresham College professor of astronomy Thomas Williams resigned in a letter of\n4\nMarch\n1619\n. It reads:-\nI Thomas Williams of the University of Oxford, Master of Arts, Reader of the astronomy lecture at Gresham house London, do fully and absolutely resign all the right and interest which I have to the place and office of astronomy lecturer in the same house ...\nWe do not know why he resigned, but it may have been so that he could marry. Nothing further seems to be known about Williams. Gunter was appointed to fill the vacancy on\n6\nMarch\n1619\n, two days after Williams resigned, largely on the recommendation of\nBriggs\n. Certainly Gresham College made remarkably rapid appointments.\nAn episode concerning the appointment of the first professor of geometry at Oxford occurred in\n1619\nwhich is reported by John Aubrey. This chair of geometry at Oxford was founded by Sir\nHenry Savile\nwho was keen to improve the state of mathematical studies in England which, at that time, were considered extremely poor.\nSavile\nrequired the professor to be \"of good character\", at least\n26\nyears old and from a Christian country, preferably England. The professor had to be thoroughly acquainted with\nAristotle\nand\nPlato\nbut also have studied the latest developments in science. The first person\nSavile\ninterviewed for the professorship was Gunter. Aubrey writes that\nSeth Ward\ntold him that Gunter came to the interview:-\n... and brought with him his sector and quadrant, and fell to resolving triangles and doing a great many fine things. Said the grave knight\n[\nSavile\n]\n, \"Do you call this reading of geometry? This is showing of tricks, man!\", and so dismissed him with scorn, and sent for\nHenry Briggs\n.\nWe must point out that if this is true, then certainly\nSeth Ward\nlearnt this story from others since he was only two years old when\nSavile\ninterviewed Gunter.\nJon V Pepper writes in\n[\n1\n]\n:-\nGunter's works, written in English, reflected the practical nature of his teaching and linked the more scholarly work of his time with everyday needs; the tools he provided were of immense value long afterward.\nGunter published seven figure tables of logarithms of sines and tangents in\n1620\nin\nCanon Triangulorum sive Tabulae Sinuum et Tangentium Artificialum\nⓉ\n(\nCanon of Triangles: or Tables of Artificial Sines and Tangents\n)\n(\nsee\n[\n13\n]\nfor details\n)\n. This was a Latin text but an English translation with title\nCanon of Triangles: or Tables of Artificial Sines and Tangents\nwas published in the same year. Although the words sine and tangent were already in use, Gunter invented the words cosine and cotangent. This was the first ever publication of logarithms of trigonometric functions and Gunter deserves much credit for this innovation.\nHe made a mechanical device, Gunter's rule, to multiply numbers based on the logs using a single scale and a pair of dividers. It was called the 'gunter' by seamen and was an important step in the development of the slide rule. Gunter published his description in\n1623\nin\nDescription and Use of the Sector, the Crosse-staffe and other Instruments\n. It is worth noting that in this work Gunter uses the contractions sin for sine and tan for tangent in his drawing of his scale although not in the text of the book. Charles Cotter writes in\n[\n11\n]\n:-\nThis book must be reckoned, by every standard, to be the most important work on the science of navigation to be published in the seventeenth century. It opened the whole subject of mathematical application to navigation and nautical astronomy to every mariner who was sufficiently interested in devoting time to the perfecting of his art.\nA second edition of this book was published in\n1636\nand purchased by\nIsaac Newton\nfor\n5\nshillings in\n1667\n.\nNewton\n's copy of this second edition is in the library of Trinity College, Cambridge.\nC J Sangwin writes\n[\n17\n]\n:-\nA sector is a mathematical instrument which consists of two hinged rulers on which there are engraved scales. The scales allow various questions in trigonometry to be resolved by using the property that two similar\n(\nequiangular\n)\ntriangles have sides in a constant ratio. The issue of who first invented by the sector is not without controversy. ... What singles out Gunter's sector is that it is the first mathematical instrument to be inscribed with a logarithmic scale to facilitate the resolution of numerical problems. This is not a slide rule in any sense of the term; the single logarithmic scale is used in conjunction with a pair of compasses. Such a rule is frequently referred to as a Gunter line. A two foot long boxwood ruler inscribed with a variety of scales was a standard navigator's tool up until the end of the nineteenth century.\nGunter was the inventor of instruments but he needed an instrument maker to produce them. Elias Allen\n(1592\n-\n1653)\nwho had his workshop beside St Clement Danes Church, the Strand, London, was the instrument maker whom Gunter used. Hester Higton writes\n[\n14\n]\n:-\nAllen appears to have had a close working relationship with Gunter. He was the most highly regarded instrument maker of his day. Having been an apprentice of the famous maker Charles Whitwell, he set himself up in business shortly before Whitwell's death in\n1611\n, first\n[\nnear\n]\nFleetbridge, then beside St Clement Danes church in the Strand, probably in his former master's workshop.\nGunter gained from having Allen make his instruments and the illustration of the sector in\nDescription and Use of the Sector, the Crosse-staffe and other Instruments\nis from plates engraved by Allen. But the relationship between the two worked the other way round too, for Allen made use of this engraving of Gunter's sector to advertise his own business.\nGunter also invented 'Gunter's chain' which was\n22\nyards long with\n100\nlinks. It was used for surveying and the unit of area called an acre is ten square chains. Gunter also studied\nmagnetic declination\nand was the first to observe the secular variation. Higton writes in\n[\n2\n]\n:-\nIn\n1622\nGunter's investigations at Limehouse, Deptford, of the magnetic variation of the compass needle produced results differing from William Borough's, obtained more than forty years earlier. He assumed an error in Borough's measurements, but this was in fact the first observation of temporal change in magnetic variation, a contribution acknowledged by his successor,\nHenry Gellibrand\n, who discovered the phenomenon.\nHis fascination with mathematical instruments went right back to his days at school and his main mathematical contributions are rightly seen to be in this area. In fact he made a new sundial with many plates containing a considerable amount of astronomical data and erected it in the gardens of Whitehall, a royal residence, in\n1622\n. Prince Charles, who became King Charles I in\n1625\n, persuaded Gunter to write and publish a description of the sundial which he did as\nThe Description and Use of his Majesties Dials in Whitehall Garden\n(1624)\n.\nHis contributions are summed up in\n[\n2\n]\nas follows:-\nGunter was a firm advocate of the use of instruments in mathematics for easing the work of various mathematical practitioners, notably surveyors and navigators. His instruments were designed with these aims in mind. In particular his work on logarithms, their applications to trigonometry, and their inclusion on instruments greatly simplified the processes of mathematical calculation. His books were popular for many years after his death: an edition of all his works was produced by Samuel Foster in\n1636\nand this had three more editions, the last in\n1680\n...\nGunter died at Gresham College and was buried one day later in the churchyard of St Peter-le-Poer, Old Broad Street. St Peter-le-Poer was rebuilt on the site of its churchyard in\n1788\nand the church no longer exists having been demolished in\n1896\n.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}