{
  "nome_completo": "Edmund Hlawka",
  "nome_curto": "Edmund Hlawka",
  "ano_nascimento": "1916",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hlawka/",
  "lugar_nascimento": "Bruck an der Mur, Styria, Austria",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Let us note at the beginning of this article that\nEdmund Hlawka\n's name appears in this form on all documents we have seen except one, where his name is given as\nEdmund Rudolf Hlawka\n. This is an official document which we believe to be correct but as he appears never to have used his middle name, or even its initial, we have simply listed him as Edmund Hlawka.\nEdmund Hlawka was born in Bruck an der Mur but his parents moved to Vienna when he was a young child so it was in that city that he was brought up and educated. He attended both primary and secondary school in Vienna and while he was still at school he began to read quite advanced mathematics textbooks\n[\n3\n]\n:-\nIn a short account of his youth he writes about a large table in the living room of his parents where he often worked at that time, and remarks that later on, after his apartment had been bombed during the war, he for a while had to work at kitchen tables. Although a very good student of mathematics at the Realgymnasium\n(\na type of school between the more technically oriented Realschule and the humanistic\nGymnasium\n)\n, where he sometimes prepared the homework for all the other students, he first did not plan to study mathematics. He was more interested in chemistry. But formulas involving derivatives in chemistry books intrigued him so much that he turned to mathematics after all.\nHlawka graduated from the Gymnasium in\n1934\nand later that same year he entered the University of Vienna where he studied mathematics, physics and astronomy. He attended mathematics courses by, among others,\nWilhelm Wirtinger\n,\nPhilipp Furtwängler\n,\nKarl Menger\nand Nikolaus Hofreiter\n(1904\n-\n1990)\n. He took a course on mathematical logic given by\nKurt Gödel\nand was taught theoretical physics by Hans Thirring\n(1888\n-\n1976)\n. It was the number theory that he was taught by Nikolaus Hofreiter that interested Hlawka most and he undertook research for his doctorate advised by Hofreiter.\nHofreiter was a young mathematician who had undertaken research in Vienna advised by\nPhilipp Furtwängler\n, obtaining his doctorate in\n1927\nfor his thesis\nEine neue Reduktionstheorie für definite quadratische Formen\nⓉ\n(\nA new theory of reduction for definite quadratic forms\n)\n. After qualifying as a Gymnasium teacher and teaching in Vienna for his probationary year, Hofreiter had become\nFurtwängler\n's assistant in\n1929\n. He\nhabilitated\nin\n1933\n, the year before Hlawka began his studies at the University of Vienna. In\n1938\nHlawka was awarded his doctorate for his thesis\nÜber die Approximationen von zwei komplexen inhomogenen Linearformen.\nⓉ\n(\nOn the approximations of two complex inhomogeneous linear forms.\n)\nBefore the award of his doctorate, Hlawka began publishing papers. His first was\nEine asymptotische Formel der Laguerreschen Polynome\nⓉ\n(\nAn asymptotic formula for Laguerre's polynomials\n)\n, a paper on\nLaguerre\npolynomials, which was published in\n1935\n, only a year after he began his university studies. His next publication was\nÜber asymptotische Entwicklungen von Lösungen linearer Differentialgleichungen\n2\n. Ordnung\nⓉ\n(\nOn asymptotic developments of solutions of linear differential equations of\n2\nnd order\n)\n(1937)\nwas on linear differential equations of the second order. His next two papers were on number theory,\nÜber die Approximation von zwei komplexen inhomogenen Linearformen\nⓉ\n(\nOn the approximation of two complex inhomogeneous linear forms\n)\n(1938)\nand\nÜber die Approximation von inhomogenen Linearformen\nⓉ\n(\nOn the approximation of inhomogeneous linear forms\n)\n(1938)\n. These study approximation properties of two inhomogeneous linear forms in two variables and generalise results obtained by\nHermann Minkowski\n.\nAfter the award of his doctorate, Hlawka remained at the Mathematical Institute of the University of Vienna where he was employed as a research assistant. In\n1941\nhe was promoted to assistant and then in\n1944\nhe habilitated with his thesis\nZur Geometrie der Zahlen\nⓉ\n(\nOn the geometry of numbers\n)\nin which he proved a long-standing conjecture of\nHermann Minkowski\nwhich today is known as the\nMinkowski\n-Hlawka Theorem. The successful habilitation put him on a firm financial position and allowed him to marry Rosa Reiter, a fellow student of mathematics who became a secondary school teacher of mathematics.\nAt this stage in his career, World War II was still taking place but after it ended in\n1945\n, Hlawka gained international acclaim for his work on the geometry of numbers and he received many invitations to lecture abroad. Hlawka, however, did not like travelling and so he turned down most of the invitations and continued to work at the University of Vienna. He was promoted to full professor in\n1948\n, a position he held until he left the University of Vienna in\n1981\n.\nNow there was one invitation for an extended research visit that Hlawka did not want to turn down, namely an invitation to the Institute for Advanced Study at Princeton in the United States. He spent the fall semester of\n1959\nthere, arriving at the Institute in September\n1959\nand remaining there until the end of December. He twice served as Dean at the University of Vienna, first as Dean of the Philosophy Faculty in\n1955\n-\n56\n, three years before his visit to the Institute for Advanced Study, and then as first Dean of the newly formed faculty of Natural Sciences in\n1976\n-\n77\n.\nBy\n1981\nhe had taught for more than\n40\nyears at the University of Vienna but at this stage he decided to accept an offer from the Technical University of Vienna for a professorship at their Institute for Analysis, Technical Mathematics and Actuarial Science. He said that his main reason for accepting this offer was that his apartment in Vienna was much closer to the Institute of the Technical University than it was to the Institute for the University of Vienna. He worked at the Technical University of Vienna for six years before retiring in\n1987\n. Peter Schmitt writes\n[\n4\n]\n:-\nLong after his retirement in\n1987\n, Hlawka remained a scholar, writing numerous works, often related to his old love of theoretical physics, and went to his office almost daily. This connection to his place of work, which he had to give up for health reasons only during the last four years of his life, also helped him cope with the death of his wife Rosa in\n1991\n, a student colleague he had married in\n1944\nand whom had taken on many of the practical burdens of life.\nWolfgang Schmidt relates some personal memories of Hlawka in\n[\n3\n]\n:-\nAs a first year student in\n1951\n/\n52\nI was deeply impressed by Hlawka's Vorlesung\n(\nlecture course\n)\non differential and integral calculus. With him, the epsilon and delta arguments were enjoyable to learn. He always lectured without notes. Except that sometimes he wrote specific numbers for examples on the back side of streetcar tickets. He once told us with a grin that he could not proceed because the conductor had punched a hole in his ticket just where he had written such a number. He had a great sense of humour, especially a Viennese type of humour. Using a commonly known phrase, when he made a mistake at the blackboard he once said he was a \"Kipfel\"\n(\nthe Austrian version of croissant\n)\n. He clearly enjoyed teaching and had the habit to continue lecturing after he had left the room. He was admired by all the students. He was rather thin, looked frail, and we worried about his health. But he fooled us all: He outlived most of his more robust colleagues. At first I had intended to study mathematical physics. So when Hlawka gave a course on the 'Geometry of Numbers' I enrolled in a physics course. But on the side I studied notes of Hlawka's lectures, taken by my fellow student Hans Hejtmanek. I liked these lectures on the 'Geometry of Numbers' so much that I decided to get my degree in mathematics, and eventually I got my Ph.D. under the direction of Hlawka. While I was still a student, he and his wife accepted me in their very informal mathematical circle, which involved numerous seminars and Nachsitzungen\n(\nafter-sessions\n)\nin coffee houses. Always a very colloquial Viennese language was spoken. I felt very honoured to be allowed to address him by his first name Edmund, and by \"du\" instead of the more formal \"Sie\". There is much that I owe to Hlawka. He introduced me to the Geometry of Numbers and to Uniform Distribution, areas which have been important in my own work.\nPeter Schmitt also writes about Hlawka as a teacher\n[\n4\n]\n:-\nEdmund Hlawka was not only an outstanding scientist of international standing, but also - as more than\n800\nteacher's examinations prove - a successful and popular teacher, who was able to engender enthusiasm among his students for the discipline, which for many was nevertheless tricky.\nAs well as supervising over\n800\nstudents for their teacher's certificate, he successfully advised over\n130\nstudents for their doctorate.\nHlawka received many honours for his outstanding contributions. He was elected to the\nGerman Academy of Scientists Leopoldina\nin\n1956\n, became a Full Member of the\nAustrian Academy of Science\nin\n1959\n, received the Dannie Heinemann Award from the\nGöttingen Academy\nin\n1963\n, received the Austrian Award for Art and Science in\n1966\nand the Award of the City of Vienna in\n1969\n. He was awarded honorary doctorates from the University of Vienna, the University of Salzburg, the University of Graz, Erlangen University and the Technical University of Vienna. He was an honorary member of both the\nAustrian Mathematical Society\nand the\nSchrödinger\nSociety.\nIn addition to around\n150\nresearch papers, Hlawka wrote six books, some with co-authors. We list here the six books together with two English translations from the German:\nTheorie der Gleichverteilung\nⓉ\n(\nTheory of uniformity\n)\n(1979)\n;\n(\nwith Ch Binder and P Schmitt\n)\nGrundbegriffe der Mathematik\nⓉ\n(\nBasic concepts of mathematics\n)\n(1979)\n;\n(\nwith J Schoissengeier\n)\nZahlentheorie\nⓉ\n(\nNumber theory\n)\n(1979)\n;\n(\nwith F Firneis and P Zinterhof\n)\nZahlentheoretische Methoden in der numerischen Mathematik\nⓉ\n(\nNumber theoretical methods in numerical mathematics\n)\n(1981)\n;\nThe Theory of Uniform Distribution\n(1984)\n;\n(\nwith J Schoissengeier and R Taschner\n)\nGeometrische und analytische Zahlentheorie\nⓉ\n(\nGeometric and analytic number theory\n)\n(1986)\n; Selecta\n(1990)\n;\n(\nwith J Schoissengeier and R Taschner\n)\nGeometric and Analytic Number Theory\n(1991)\n; and\nStatistik und Gleichverteilung\nⓉ\n(\nStatistics and equal distribution\n)\n(1998)\n.\nThe\nSelecta\n(1990)\n, published shortly after he retired, has the following description\n[\n1\n]\n:-\nEdmund Hlawka is a leading number theorist whose work has had a lasting influence on modern number theory and other branches of mathematics. He has contributed to Diophantine approximation, the geometry of numbers, uniform distributions, analytic number theory, discrete geometry, convexity, numerical integration, inequalities, differential equations and gas dynamics. Of particular importance are his results in the geometry of numbers\n(\nespecially the\nMinkowski\n-Hlawka theorem\n)\nand uniform distribution. This 'Selecta' volume contains his most important articles, many of which had not been easily accessible. It will provide a useful tool for researchers and graduate students working in the areas covered. Edmund Hlawka has contributed a general introduction.\nOur final quote is from the Foreword of\n[\n2\n]\n:-\nEdmund Hlawka is the most famous living Austrian mathematician and a prominent university teacher in Vienna. He contributed important theorems to the geometry of numbers, to the theory of uniform distribution, and to numerical integration. In this book, the editor attempts to summarize Hlawka's results from\n1935\nto his\n85\nth birthday in\n2001\n. The book can also be considered as an introduction to a comprehensive review which still seems to be missing, on the history of Austrian mathematics in the\n20\nth century.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}