{
  "nome_completo": "Edna Ernestine Kramer Lassar",
  "nome_curto": "Edna Kramer",
  "ano_nascimento": "1902",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kramer/",
  "lugar_nascimento": "Manhattan, New York, USA",
  "lugar_morte": "Manhattan, New York, USA",
  "biografia": "Edna Ernestine Kramer Lassar\nwas born on\n11\nMay\n1902\n, in New York City in the borough of Manhattan. Named after her uncle, Edward Elowitch who had died shortly before her birth and who had shown a gift for mathematics, Kramer's childhood ambition was to do well in his honour.\nShe was the eldest child of Joseph and Sabine Kramer who were both Jewish immigrants from Europe. They had come to Manhattan as children, having to go out to work at an early age but nevertheless attending Night School to obtain their high school education. Both grew up to become intellectual, ambitious adults; a trait they passed to their children. They were both excellent linguists and while speaking and writing English well they also retained their native German.\nKramer's parents believed strongly in the importance of education and her father was proud to serve on the New York City Board of Education, despite having no academic affiliation. Kramer and her two siblings, Martha, who was two years younger and Herbert, born in\n1911\nwere held to high standards by their parents with the result that they were all prize-winning students, who were all elected to the Phi Beta Kappa and became teachers.\nKramer was a precocious child who intrigued her relatives. Their interest in her was to have a huge effect. She was especially influenced by her young Aunt Therese Elowitch, who lived nearby and was a lawyer by profession and by a cousin, Josephine Schwartz, who lived with the Kramers as a child. They challenged Kramer to card games, such as Hearts and feats of memory, including reciting poetry. By the time Kramer entered first grade, in May\n1908\n, she had already studied many of her cousin's higher-level elementary school assignments. Kramer was also impressed by the involvement of her mother and aunt with the Suffragette movement.\nKramer's initial career plans; to become a German teacher were dampened by the First World War and consequently she had to review her future. However she did not have to look far for inspiration. As a new student at Wadleigh High School, Manhattan she had a teacher whom led her to see her future differently. John A. Swenson was the chairman of the mathematics department and he inspired Kramer with a love of mathematics that was to last throughout her life. Her friendship with Swenson remained constant as he guided and inspired her to a career as a mathematician.\nKramer majored in mathematics at Hunter College, receiving her B.A degree summa cum laude in\n1922\n. There she was elected to Pi Mu Epsilon Honorary Mathematics Society and Phi Beta Kappa.\nWith help from Svenson, who arranged her program to fit her university classes she continued her studies while teaching high school mathematics\n(\nDeWitt Clinton High School, Bronx, New York,\n1922\n-\n23\nand Wadleigh High School\n1923\n-\n29)\n. She obtained an M.A in mathematics from Columbia University in\n1925\nand her PhD in mathematics\n(\nwith a minor in physics\n)\nin\n1930\n.\nHer PhD dissertation discussed the geometric properties of polygenic functions, extending the work of\nEdward Kasner\n, her thesis supervisor, George Scheffers and Edmond Laguerre.\nKasner\nhad published a number of articles on polygenic functions\n(\nhis coinage\n)\nof the ordinary complex variable Kramer used the first part of her thesis to develop an analogous theory of polygenic functions of the dual variable Although similarities between the two theories were found no general principle of transference from one theory to the other appeared to exist. Other antecedents of Kramer's work were in the papers of Scheffers on monogenic functions of the dual variable In the second part of her thesis Kramer studied the Laguerre group, a set of linear fractional polygenic transformations of the dual variable and gave a more analytic treatment than had previously been done.\nWhile\nKasner\ninfluenced her dissertation, Kramer's earliest pedagogical publication reflects the influence of her mentor, John A. Swenson and her job. In this publication she showed how prospective teachers could learn both content and method simultaneously, to the enrichment of both. She recommended bringing appropriate college-level mathematics to the high school level, emphasising concepts over mechanics to avoid the common occurrence of\n[6]\n:-\n... not being able to see the basic ideas through the haze of technique with which they are surrounded.\nThe developments of Kramer's ideas, which form the basis of future books, are apparent in this article.\nYears later she returned to formal studies as a post-graduate student at the Courant Institute of New York University\n(1939\n-\n1940\n,\n1965\n-\n1969)\nand the University of Chicago in\n1941\n.\nIn\n1929\nshe rejected an offer for a position in the Education Department of Hunter College because she preferred to teach mathematics and she was still hoping to do some mathematical research. However that same year, strongly endorsed by Swenson, Kramer became the first female instructor of mathematics at the New Jersey State Teachers College in Montclair, where she was promoted to assistant professor in\n1932\n.\nIt was there that she was invited to become a co-author of high school texts, however she declined the offer because of loyalty to Swenson's new teaching and curricular proposals: integration of mathematical topics and incorporation of advanced concepts, and her compunction against writing books that might compete with his. She did however help the other authors, John Stone and Virgil Mallory with ideas, corrections, exercises and applications and gave them credit for influencing her to write a statistics textbook in\n1935\n. Her only text,\nA First Course in Educational Statistics\ncontained an exposition of modern mathematical statistics that to the credit of the author's writing was also accessible to non mathematicians. Illustrative tables and exercises used actual data from journals of special interest to teachers.\nThe Depression of the\n1930\ns saw a scarcity of college positions, low wages and there was much anti-Semitism and discrimination against women, particularly married ones. Planning to marry and fearing the hostility of the new chairman at Montclair College, Kramer decided to return to the New York City School system and she obtained a teaching position at Thomas Jefferson High school in Brooklyn, where her salary doubled. Before long she was acting chairman of the department and as soon as appointments were made she was promoted to chairman.\nOn\n2\nJuly\n1935\n, Kramer married Benedict Taxier Lassar, a French teacher and guidance counsellor, who later became a clinical psychologist. Kramer continued with her school teaching after marriage, while also writing, consulting and teaching college courses, including teaching methods courses in the graduate division of Brooklyn College between\n1935\nand\n1938\n. From\n1943\n-\n45\nwhile Kramer was still teaching at Jefferson High School she worked at Columbia University as a statistical consultant to the university's Division of War Research, under the Office of Scientific Research and Development in Washington D.C. Her work was concerned with probabilistic strategic tactics of the war in Japan, and with anti-aircraft fire control.\nIn\n1948\nKramer began work at the New York Polytechnic Institute as an adjunct instructor and rose to an adjunct professor in\n1953\n. She retired from school teaching in\n1956\nand from the New York Polytechnic Institute in\n1965\n.\nAs well as her published article on strategies in mathematics teaching she wrote other pedagogical publications concerned with the applications of mathematics.\nMathematics Takes Wings\n(1942)\nrelated aeronautics to many different topics in the high school mathematics curriculum.\nThe Integration of Trigonometry with Physical Science\n(1948)\nshowed how trigonometry could be taught with applications to electricity, sound and light. As co-author of\nExperiences in Mathematical Discovery\n(1966)\n, she developed special materials for the student of general mathematics.\nKramer was not only interested in the applications of mathematics; she was also keen to collect all sorts of historical, cultural and recreational materials to accompany each mathematical concept. She helped\nEdward Kasner\nto prepare\nMathematics and the Imagination\nand she served as an advisor to Richard Courant in the writing of\nWhat is Mathematics?\nBy\n1951\nher extensive collection of applications and other material had grown into a book,\nThe Main Stream of Mathematics\n. A combination of mathematical concepts and history up to the early part of the\n20\nth\ncentury, together with applications to the fields of science, art and music it has received many favourable reviews and has been translated into many languages\n[7]\n:-\nThe book develops the theme that mathematics and mathematicians can be interesting.\nKramer's style of writing makes it an enjoyable read for both mathematician and layman alike. Her examination of\nOmar Khayyam\nand algebra,\nNewton\nand calculus,\nFermat\nand probability,\nLewis Carroll\nand logic and\nEinstein\nand relativity provides an intriguing book for non-mathematicians and a valuable reference source for teachers and students.\nIn\n1970\nKramer published the voluminous expansion and sequel,\nThe Nature and Growth of Modern Mathematics\n. It covers in a popular, but unusually comprehensive fashion\n20\nth\ncentury mathematics and the people responsible for creating it. Carl Boyer who reviewed the book praised the historical allusions and thorough mathematical content\n[8]\n:-\nOne cannot easily think of a topic within layman's comprehension which is not presented in considerable detail, including analysis, algebra, logic and foundations.\nBoth books use a spiral approach and emphasise concepts over chronology. Kramer achieved her purpose in giving the reader access to an understanding of the importance of mathematics and its relationship to other areas of scientific thought. She managed to give an all-round picture with balance among computational, historical, recreational and cultural points of view and to\n[9]\n:-\n... promote interest and diminish awe\nwhile also providing much valuable background for the specialist as well.\nAs a scientist with a keen interest in history, Kramer books also included details about the lives of the mathematicians whose ideas and accomplishments she discussed. Women mathematicians, past and present became a special interest and she wrote biographies of these women and their achievements for the journal\nScripta Mathematica\nand the\nDictionary of Scientific Biography\n. She also travelled to Europe to interview eminent female mathematicians of the twentieth century, including Hanna Neumann.\nDuring the course of her career Kramer was a member of the\nAmerican Mathematical Society\n, the\nMathematical Association of America\n, the\nSociété Mathématique de France\n, the Association Of Women in Mathematics, the American Association for the Advancement of Science, the History of Science Society and the\nNew York Academy of Sciences\n.\nAlthough retired she remained active for many years, continuing studying, publishing and travelling. She attended classes at the Courant Institute from\n1965\nto\n1969\n, and in\n1973\nshe travelled to Singapore where she gave an invited lecture entitled:\nThe Contributions of Women Past and Present to the Development of Mathematics\n, at Nanyang University.\nFor the last ten years of her life Kramer suffered from Parkinson's disease and she died of pneumonia at her home in Manhattan on\n9\nJuly\n1984\n.\nEdna Ernestine Kramer Lassar was a mathematician gifted with respect to both mathematics and language. On completion of her PhD the Depression began and hence she was unable to find a job conductive to the mathematical research she expected to do. However she utilised her other talents, for writing and for clear explanation of very complicated ideas. She explored mathematics to a great breadth and depth, writing about its most significant and profound aspects from a variety of perspectives. She was well received by one of the biggest audiences a mathematical writer can hope to reach.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}