{
  "nome_completo": "Eduard Jan Dijksterhuis",
  "nome_curto": "Eduard Jan Dijksterhuis",
  "ano_nascimento": "1892",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dijksterhuis/",
  "lugar_nascimento": "Tilburg, Netherlands",
  "lugar_morte": "De Bilt, Netherlands",
  "biografia": "Eduard Jan Dijksterhuis\nwas the son of Berend Dijksterhuis\n(1861\n-\n1921)\n, a school teacher and later headmaster of the Rijks Hogere Burgerschool Koning Willem II in Tilburg. Born in Groningen, Berend was in Maastricht before he settled in Tilburg in\n1890\nwhen he was appointed as a teacher at the Rijks Hogere Burgerschool Koning Willem II. He taught history and geography at this school before becoming headmaster in\n1899\n. In the same year he became headmaster he was awarded a doctorate from the University of Leiden for his thesis\nContribution to the history of glorious Tilburg and Goirle\n. Berend had married Gezina Eerkes\n(1865\n-\n1936)\non\n15\nAugust\n1888\nat Wildervank, Veendam, Groningen, Netherlands. Berend and Gezina Dijksterhuis had three children, a daughter Sieska Ida Dijksterhuis\n(1889\n-\n1945)\n, and two sons Popko Berend Dijksterhuis\n(1891\n-\n1959)\nand Eduard Jan Dijksterhuis, the subject of this biography.\nDijksterhuis attended the Rijks Hogere Burgerschool Koning Willem II, where his father was the headmaster, graduating in\n1909\n. He took the state gymnasium-B additional examination in\n1910\nand, in the following year, he entered the University of Groningen. During his school years he had been unsure whether he wanted to specialise in mathematics or whether he wanted to undertake further studies in classical literature. Clearly influenced towards being a historian like his father, but loving mathematics, he finally decided that it was mathematics he wanted to study at university.\nAfter the award of his first degree, Dijksterhuis continued to study at the University of Groningen for his doctorate advised by John Antony Barrau\n(1873\n-\n1953)\n. Barrau had been advised by\nKorteweg\nfor his doctorate and had taught at the University of Delft before being appointed professor of synthetic, analytical and descriptive differential geometry at Groningen in\n1913\n. Klaas van Berkel describes Dijksterhuis's student days in\n[34]\n:-\nHis most important teacher was the astronomer J C Kapteyn, who not only taught Dijksterhuis the love for the history of science, but also inspired him as a teacher through his perfectly clear lectures. In addition to his studies, Dijksterhuis was also active in student life. As treasurer or secretary, he was the driving force in the literary society 'Dicendo discimus' and the music association 'Bragi', both sub-associations of the student body 'Vindicat atque Polit'.\nWhile undertaking research, Dijksterhuis was appointed as a part-time mathematics teachers at the girls' Hogere Burgerschool in Groningen in\n1916\n. He taught there for two years until\n1918\n. On\n1\nJune of that year he was awarded his doctorate by the University of Groningen for his thesis\nA contribution to the knowledge of the flat helicoid\n. His first papers were  published in\n1919\n, namely\nOver de regelvlakken van den vierden graad\nⓉ\n(\nOn the control planes of the fourth degree\n)\nand\nOver het gebruik van een\nV\n2\n4\nV_{2}^{4}\nV\n2\n4\n​\nvan\nR\n5\nR_{5}\nR\n5\n​\nin de metrische lijnenmeetkunde\nⓉ\n(\nOn the use of a  V\n2\n4\nof R\n5\nin metric line geometry\n)\n. Although Dijksterhuis began teaching for financial reasons, he did not intend to remain a school teacher but wanted an academic career in universities. The poor health of his father and the dire shortage of teachers, however, led him to stay in Tilburg and become a teacher at the Rijks Hogere Burgerschool Koning Willem II in\n1919\n. He taught mathematics, mechanics, cosmology and physics at this school until\n1953\n.\nDijksterhuis had made the decision to study mathematics rather than classical literature but this did not mean that he wanted to give up his love of literature. He began, therefore, to study the history of mathematics where he was able to satisfy both of his two loves. His first papers on the history of mathematics was\nin fact a series of three papers\nOver de ontwikkeling der valwetten\nⓉ\n(\nOn the development of the laws of falling\n)\npublished in\n1920\n-\n21\n. In these papers Dijksterhuis discussed the laws of falling bodies, looking at\nAristotle\nand the centuries of beliefs that fall time was inversely proportional to the weight of the body and directly proportional to the density of the medium. He also discusses the evidence of the impossibility of a vacuum. Dijksterhuis discusses the opposition to these ideas, particularly by\nGiovanni Battista Benedetti\n, and emphasizes the difficulties\nGalileo\nstill had to deal with Aristotelian influences.\nOn\n27\nDecember\n1920\n, Dijksterhuis married Johanna Cathinka Elisabeth Niemeijer at Haren, Netherlands. Johanna, born in Groningen on\n2\nDecember\n1895\n, was the daughter of the manufacturer Willem Niemeijer and Johanna Cathinka Elisabeth Meijer. Eduard and Johanna Dijksterhuis had two sons and one daughter.\nKlaas van Berkel describes Dijksterhuis's teaching at the Hogere Burgerschool in Tilburg in\n[34]\n:-\nThe initial period was not too pleasant, because he was constantly in trouble with the other mathematics teacher at the school\n[\nKerremans\n]\n. But after that Dijksterhuis became a central figure in his school that remained small and well-organized for a long time. In his teaching he made no attempt to become popular. His teaching method was strict, mathematical and abstract, which appealed to some students, but for the most part deprived students of their taste for mathematics. However, Dijksterhuis regularly let his students share in his other interests, such as the music of Bach and Bruckner and the history of mathematics and the natural sciences.\nTo gain insight into Dijksterhuis's ideas about teaching mathematics and his efforts to reform education in the Netherlands to his way of thinking, we follow Klaas van Berkel\n[34]\n:-\nAlthough Dijksterhuis came into his own most in the higher classes, he had very pertinent opinions about initial education in mathematics. Because abstraction is the essence of mathematics, he wanted to initiate the students in the sphere of abstract reasoning from the outset. He thought it was wrong for students to gradually get used to mathematical forms through realistic exercises\n(\n'cutting and pasting'\n)\n. This conviction led him to a fierce controversy with one of the most prominent educational reformers in the years between the World Wars,\nTatyana Ehrenfest-Afanassjewa\n[\nthe wife of\nPaul Ehrenfest\n]\n. This controversy led in\n1924\nto the creation of a separate didactic supplement to the 'Nieuw Tijdschrift voor Wiskunde' - an addition that appeared separately a few years later and was renamed 'Euclides'. Dijksterhuis became a permanent employee of the new journal, which in the first years was the mouthpiece of those who advocated a rigorous approach to mathematics, in the spirit of the Greek philosopher\nEuclid\n.\nHis active involvement in the reform of mathematics education led, in\n1925\n, to Dijksterhuis becoming the secretary of a commission set up by the College of Inspectors of Secondary Education to prepare a new mathematics education programme at Hogere Burgerschools, called the Beth Commission after the chairman. The new programme, prepared by Dijksterhuis, was entirely in the spirit of the rigorous direction. The starting point was the educational value of mathematics. Mathematics, according to the committee, is not only a domain of our knowledge, but also, and above all, a style of thinking that through its purity and honesty also benefits the thinking ability of students who no longer make direct use of mathematical knowledge in their later professional practice. Practical skill\n(\ndoing sums\n)\nis less important than understanding the principles of mathematics; students must always be able to justify why they performed a certain calculation in this way and not otherwise. Later Dijksterhuis would call his ideal education, aimed at insight and not at skill, 'epistemic' - a term derived from his most important source of inspiration, the Greek philosopher\nPlato\n. Tirelessly, Dijksterhuis has advocated the importance of this epistemic mathematics education, not only in 'Euclides', but also in the 'Weekblad voor Middelbaar en Gymnasiaal Onderwijs'. But the Beth Commission programme was never fully implemented and after the war, when he was still crossing swords with mathematics teacher\nHans Freudenthal\n, he had to acknowledge that the realistic approach in mathematics education had still to prevail.\nIn December\n1922\nDijksterhuis sent an article to\nDe Gids\nⓉ\n(\nThe Guide\n)\nin which he advocated classical education for mathematicians and physicists. In doing so, he argued against the Limburg Act which had come into force in\n1917\n. This Act, which had come into force partly through the efforts of Dijksterhuis's father, Berend Dijksterhuis, allowed pupils from a Hogere Burgerschool to enter a university. In so doing it equated a Hogere Burgerschool with a gymnasium and meant that Greek and Latin where no longer required as an entry requirement for university studies of mathematics. That Dijksterhuis would oppose the Limburg Act is no surprise given what we have quoted above regarding his views on mathematics education. He said:-\nAnyone who ever got to know the classical world under inspiring guidance has acquired a treasure for life, at which outsiders can scoff, but which they cannot take away from that person.\nDijksterhuis's first major book was\nVal en Worp. Een Bijdrage tot de Geschiedenis der Mechanica van Aristoteles tot Newton\nⓉ\n(\nFree Fall and Projectile Motion. A contribution to the history of mechanics from Aristotle to Newton\n)\npublished in\n1925\n. In the Preface he acknowledges that he was mainly inspired by the work of the French physicist and science historian\nPierre Duhem\n. In dealing with quotations,\nDuhem\ngives a French translation more focused on the beauty of his language than on being a literal translation. Dijksterhuis does take a different approach, however, in that he gives the quote in the original Greek or Latin as well as a translation into Dutch more focused on accuracy than beauty.\nHeinrich Wieleitner writes in the review of\nVal en Worp\nⓉ\n(\nFree Fall and Projectile Motion\n)\n[39]\n:-\nThere are significant and \"significant\" historians. ... The important historians without quote marks may have written a lot\n(\nsuch as\nPaul Tannery\n)\n; but everything they wrote was well thought out, even if it was hypothetical, everything factually well founded, the sources as fully, carefully, and critically as possible read. It is a pleasure to study such a historian for decades to come. The present work on the development of the laws of falling objects immediately places the author in the class of important historians without quote marks. Employed in the small town of Tilburg, he had to get every book from abroad. What he has nevertheless contributed to the most remote literature, borders on the incredible.\nFor a longer extract from this review, and extracts from over\n30\nreviews of other works by Dijksterhuis, see\nTHIS LINK\n.\nDijksterhuis published impressive works on\nEuclid\n,\nArchimedes\n, and\nSimon Stevin\n. He also published\nDe Mechanisering van het Wereldbeeld\nⓉ\n(\nThe Mechanization of the world view\n)\nin\n1950\n. It was, however, the English and German translations of his books which brought his work to a much wider audience. Reijer Hooykaas writes\n[17]\n:-\nIt took a long, long time for Dijksterhuis to receive the recognition to which he was entitled by virtue of his contributions. The work of the resident of a small country is easily overlooked; American and French bibliographical works of\n1952\nand\n1954\ndo not or hardly mention the work of Dijksterhuis. In the Netherlands, the sharp separation between humanities and mathematics and physics left the few who stood in between in uninhabited country. Dijksterhuis did try to arouse interest in the history of science twice through a private teaching post, but those who are familiar with the academic world will understand that these attempts had little effect. The Literature Department of the\nRoyal Netherlands Academy of Arts and Sciences\nshould be praised since it broke through the traditional divorce in\n1950\nand incorporated this mathematician into its ranks.\nIn\n1953\nDijksterhuis gained the university position he had always wished for. In that year he was appointed extraordinary professor in the history of mathematics and the natural sciences at Utrecht University. He delivered the inaugural address\nDoel en methode van de geschiedenis der exacte wetenschappen\nⓉ\n(\nPurpose and method of the history of the exact sciences\n)\n. For an English version of this address, see\nTHIS LINK\n.\nIn\n1955\nhe also accepted an extraordinary professorship in the history of mathematics and the exact natural sciences at Leiden University. In each case he was made a member of both the Faculty of Arts and Philosophy and of the Faculty of Mathematics and Physics. In\n1960\nhe became a full professor at Utrecht University and, at that time, he resigned his position in Leiden. Sadly, by the time he became a full professor, his health was deteriorating and he was finding it very hard to carry out his duties. Hooykaas writes\n[17]\n:-\nIt is difficult to gauge how badly he took this. A fortunate circumstance was that his wife, who has always been a great support to him in his personal life as well as in his scientific work, knew his thinking and working methods sufficiently to be able to serve as his interpreter. His contact with colleagues was kept until the last; for example, the\nStevin\ncommittee continued meeting at his house. On\n18\nMay\n1965\n, he was released from suffering.\nDijksterhuis did not receive as many honours as we feel he deserved but his remarkable contributions were recognised during his lifetime. In\n1962\nhe was awarded the George Sarton medal from the American History of Science Society. It is awarded for a \"a lifetime of scholarly achievement\" in the history of science and is named for George Sarton, the founder of the journal\nIsis\n. We note that ten of the reviews of his work listed below were published in\nIsis\n. Dijksterhuis also received the Karl Sudhoff Commemorative Medal from the German Society for the History of Medicine and Natural Science, recognizing that he was among the greatest in the field of history of science. He delivered the Sudhoff Commemorative lecture, an integral part of this award. His merits were also recognized by his appointment as a Knight of the Order van de Nederlandse Leeuw.\nLet us end with a quote from a lecture Dijksterhuis delivered at Utrecht University in\n1952\n. Addressing arts students, he said:-\nThe river that separates you from the exact sciences is much too deep. Going upstream, however, you will find a ferry, which can bring you to the other side. This ferry is called 'history of science,' and I will be happy to be the ferryman.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}