{
  "nome_completo": "Ernst Eduard Kummer",
  "nome_curto": "Eduard Kummer",
  "ano_nascimento": "1810",
  "ano_morte": "1893",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kummer/",
  "lugar_nascimento": "Sorau, Brandenburg, Prussia (now Żary, Poland)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Eduard Kummer\n's father, Carl Gotthelf Kummer was a physician. However he died when Eduard was only three years old and Eduard and his elder brother were brought up by their mother. Eduard received private coaching before entering the\nGymnasium\nin Sorau when he was nine years old. In\n1828\nKummer entered the University of Halle with the intention of studying Protestant theology. Fortunately for the good of mathematics, Kummer received mathematics teaching as part of his degree, designed to provide a proper foundation to the study of philosophy. Kummer's mathematics lecturer H F Scherk inspired his interest in mathematics and Kummer soon was studying mathematics as his main subject, although at this stage he still saw it as leading to a later study of philosophy.\nIn\n1831\nKummer was awarded a prize for a mathematical essay he wrote on a topic set by Scherk. In the same year he was awarded his certificate to enable him to teach in schools and, on the strength of his prize winning essay, he was awarded a doctorate. During session\n1831\n-\n32\nKummer taught a probationary year at the Gymnasium in Sorau where he had been educated. Then he was appointed to a teaching post at the Gymnasium in Liegnitz, now Legnica in Poland.\nKummer held this teaching post in Liegnitz for\n10\nyears. There he taught mathematics and physics and sometimes other topics. Some of his pupils had great ability, and conversely they were extremely fortunate to find a school teacher of Kummer's quality and ability to inspire. His two most famous pupils were\nKronecker\nand\nJoachimsthal\nand, under Kummer's guidance, they were undertaking mathematical research while at school.\nKummer himself was undertaking mathematics research while teaching at Liegnitz. He published a paper on\nhypergeometric series\nin\nCrelle's Journal\nin\n1836\nand he sent a copy of the paper to\nJacobi\n. This led to\nJacobi\n, and later\nDirichlet\n, corresponding with Kummer on mathematical topics and they soon realised the great potential for the highest level of mathematics that Kummer possessed. In\n1839\n, although still a school teacher, Kummer was elected to the\nBerlin Academy\non\nDirichlet\n's recommendation.\nJacobi\nnow realised that he had to find Kummer a university professorship.\nIn\n1840\nKummer married a cousin of\nDirichlet\n's wife. This marriage would only last eight years as his wife sadly died in\n1848\n. However these where years of great achievement for Kummer. In\n1842\n, with strong support from\nJacobi\nand\nDirichlet\n, he was appointed a full professor at the University of Breslau, now Wrocław in Poland. There he quickly established himself as an outstanding university teacher of mathematics and, starting with his move to Breslau, he began to undertake research in\nnumber theory\n. After the death of his wife in\n1848\n, Kummer remarried fairly soon.\nDuring the\n22\nto\n24\nFebruary\n1848\ninsurrection in Paris, king Louis-Philippe was overthrown. This resulted in a series of sympathetic revolutions against the governments of the German Confederation. Most of them were tame affairs but in the case of the fighting in Berlin it was bitter and bloody. Nobody could fail to have strong political views at this time and indeed Kummer had strong right wing political views. He supported the constitutional monarchy in the\n1848\nrevolution and was against a republic. When on\n13\nMarch\n1848\nMetternich, a symbol of the establishment, was forced to resign his position in the Austrian Cabinet, the princes quickly made peace with the opposition to prevent republican and socialist experiments like those in France.\nIn\n1855\nDirichlet\nleft Berlin to succeed\nGauss\nat Göttingen. He recommended to Berlin that they offer the vacant chair to Kummer, which indeed they did. Then Kummer played a clever political trick. He wanted\nWeierstrass\nas a colleague at Berlin, yet he realised that\nWeierstrass\nwas a strong candidate for the chair he was leaving vacant in Breslau. Hence he recommended to Breslau that they appoint his former student\nJoachimsthal\n. All went according to plan for Kummer and, in\n1856\n,\nWeierstrass\nwas appointed to Berlin.\nKronecker\nhad also been appointed to Berlin in\n1855\nso Berlin became one of the leading mathematical centres in the world.\nIn\n1861\nKummer and\nWeierstrass\nestablished Germany's first pure mathematics seminar in Berlin. K-R Biermann writes of Kummer's teaching in Berlin in\n[\n1\n]\n:-\nKummer's Berlin lectures, always carefully prepared, covered analytic geometry, mechanics, the theory of surfaces, and number theory. The clarity and vividness of his presentations brought him great numbers of students - as many as\n250\nwere counted at his lectures. While\nWeierstrass\nand\nKronecker\noffered the most recent results of their research in their lectures, Kummer in his restricted himself, after instituting the seminar, to laying firm foundations. In the seminar, on the other hand, he discussed his own research in order to encourage the participants to undertake independent investigations.\nExplaining Kummer's popularity Biermann writes:-\nKummer's popularity as a professor was based mot only on the clarity of his lectures but on his charm and sense of humour as well. Moreover, he was concerned for the well-being of his students and willingly aided them when material difficulties arose...\nSurprisingly, given Kummer's outstanding qualities as a teacher of mathematics, he never wrote any textbooks. He did publish mathematical lectures and, of course, many extremely influential mathematical papers.\nHaving first been elected to the\nBerlin Academy\nwhile still a school teacher, Kummer ended up with high office in the Academy. He was secretary of the Mathematics/ Physics Section of the Academy from\n1863\nto\n1878\n. He also held high office in the University of Berlin, being Dean in\n1857\n-\n58\nand again in\n1865\n-\n66\n. He was rector of the university in\n1868\n-\n69\n.\nWhile at Berlin, Kummer supervised a large number of doctoral students including many who went on to hold mathematics chairs at universities, including\nBachmann\n,\nCantor\n,\ndu Bois-Reymond\n,\nGordan\n,\nSchönflies\nand\nSchwarz\n. In fact\nSchwarz\nbecame related to Kummer when he married one of his daughters. Kummer also appointed many talented young lecturers including\nClebsch\n,\nChristoffel\nand\nFuchs\n. It was\nFuchs\nwho succeeded Kummer when he decided to retire in\n1883\non the grounds that his memory was failing, although nobody other than Kummer himself ever detected this.\nDuring Kummer's first period of mathematics he worked on function theory. He extended\nGauss\n's work on hypergeometric series, giving developments that are useful in the theory of\ndifferential equations\n. He was the first to compute the monodromy groups of these series.\nIn\n1843\nKummer, realising that attempts to prove\nFermat's Last Theorem\nbroke down because the unique factorisation of integers did not extend to other rings of complex numbers, attempted to restore the uniqueness of factorisation by introducing 'ideal' numbers. Not only has his work been most fundamental in work relating to Fermat's Last Theorem, since all later work was based on it for many years, but the concept of an ideal allowed ring theory, and much of abstract algebra, to develop.\nThe\nParis Academy of Sciences\nawarded Kummer the Grand Prize in\n1857\nfor this work. In fact the prize of\n3000\nfrancs was offered for a solution to Fermat's Last Theorem but when no solution was forthcoming, even after extending the date, the Prize was given to Kummer even though he had not submitted an entry for the Prize.\nSoon after Kummer was awarded the Grand Prix he was elected to membership of the\nParis Academy of Sciences\nand then, in\n1863\n, he was elected a Fellow of the\nRoyal Society of London\n. He received numerous other honours in his long career.\nKummer's geometric period was one when he devoted himself to the study of the ray systems that\nHamilton\nhad examined, but Kummer treated these problems algebraically. He also discovered the fourth order surface, now named after him, based on the singular surface of the quadratic line complex. The Kummer surface has\n16\nisolated conical double points and\n16\nsingular\ntangent\nplanes and was published in\n1864\n.\nThe three great mathematicians of Berlin, Kummer,\nWeierstrass\nand\nKronecker\nwere close friends for twenty years as they worked closely and effectively together, However, around\n1875\nWeierstrass\nand\nKronecker\nfell out. Kummer continued his friendship with\nKronecker\nbut this put a strain on his relation with\nWeierstrass\n. Perhaps it is not too surprising that this should happen to these three great mathematical talents, particularly given that\nKronecker\nvigorously attacked personally anyone with whom he had a mathematical difference.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Number Theory"
  ]
}