{
  "nome_completo": "Eduard L Stiefel",
  "nome_curto": "Eduard Stiefel",
  "ano_nascimento": "1909",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stiefel/",
  "lugar_nascimento": "Zürich, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Eduard Stiefel\n's father was a painter. He entered the Eidgenössische Technische Hochschule Zürich\n(\nSwiss Federal Institute of Technology\n)\nin\n1928\nand was awarded his diploma in mathematics in\n1931\n. After spending time in Hamburg and Göttingen during\n1932\n, he returned to ETH Zürich where he was appointed as an assistant to Walter Saxer who worked in geometry. Later he was appointed assistant to\nMichel Plancherel\n, but he worked on his doctoral thesis with\nHeinz Hopf\nas his advisor. He was awarded his doctorate for his thesis\nRichtungsfelder und Fernparallelismus in n-dimensionalen Mannigfaltigkeiten\nⓉ\n(\nDirection fields and teleparallelism in n-dimensional manifolds\n)\nfrom ETH Zürich in\n1935\n. He published the results of this thesis in a paper in\n1936\n. This work\n[\n5\n]\n:-\n... perhaps Stiefel's most famous contribution to pure mathematics, was dedicated to a fundamental study of the theory of vector fields on manifolds. Generalising the classical notion of the Eulerian characteristic of a manifold, he introduced the idea of the characteristic classes. Stimulated by lectures of\nI Schur\nat ETH in\n1936\n, Stiefel started to work on continuous groups. Following earlier work of\nH Cartan\nand\nH Weyl\n, he introduced the so-called Stiefel Diagram for continuous groups, relating closed semi-simple groups and discontinuous reflection groups.\nStiefel was employed at ETH Zürich following the award of his doctorate.  However he also undertook military service with the Swiss army and\nOlga Taussky-Todd\n, who had been advised by\nHeinz Hopf\nto discuss her work with Stiefel, called in to ETH Zürich on a number of occasions between\n1932\nand\n1937\n, always finding that Stiefel was on military service. He continued to serve in the Swiss army during World War II rising to the rank of colonel. However, he also worked on his\nhabilitation\nwhich he submitted to ETH Zürich in\n1942\nbecoming a\nprivatdozent\n. In the following year he became an extraordinary professor. Other papers he published during this period include:\nZum Satz von Pohlke\nⓉ\n(\nOn a theorem of Pohlke\n)\n(1937)\n;\nÜber Richtungsfelder in den projektiven Räumen und einen Satz aus der reellen Algebra\nⓉ\n(\nOn direction fields in projective spaces and a theorem in real algebra\n)\n(1941)\n; and\nÜber eine Beziehung zwischen geschlossenen Lie'schen Gruppen und diskontinuierlichen Bewegungsgruppen euklidischer Räume und ihre Anwendung auf die Aufzählung der einfachen Lie'schen Gruppen\nⓉ\n(\nOn a relationship between closed Lie groups and discontinuous groups of motions of Euclidean spaces and their application to the list of simple Lie groups\n)\n(1942)\n.\nAt ETH Zürich, Stiefel taught a course on descriptive geometry and geometrical mappings for ten years starting in about\n1936\n. He published his lecture notes as\nLehrbuch der darstellenden Geometrie\nⓉ\n(\nA textbook of descriptive geometry\n)\nin\n1947\n.\nEugene Lukacs\ndescribes the contents:-\nThe first chapter discusses orthographic projection and its use in solving graphically problems of solid geometry. In the second chapter pictorial representation of spatial objects is accomplished by means of orthogonal axonometric projection. The third chapter deals with various curves and surfaces in space which occur frequently in technical applications. A few pages on map projection conclude part I. The second half of the book, organized into parts II, III and IV, introduces the reader to the idea of geometrical mappings. The elementary projective theory of conics and, to some extent, of surfaces of second order is discussed in part II. In part III the author investigates the theory of correspondences which map straight lines on straight lines. A unified treatment is offered for central projection, general\n(\noblique\n)\naxonometry and perspective.\nLukacs\nadds that:-\nA feature of the book is its presentation of perspective ... The book is well written. The author is successful in offering a concise and lucid presentation of the subject.\nHowever, Stiefel's career changed course completely in\n1948\n. After being head of mathematics and physics during\n1946\n-\n48\n, he founded  the Institute for Applied Mathematics in ETH in\n1948\n. His aim was to build an institute where the mathematical implications of computers could be studied. Horst Zuse writes\n[\n3\n]\n:-\nStiefel's declared goal was to advance numerical analysis. Accordingly he was looking for a way to gain access to computing power beyond the level that could be performed by simple desktop calculators. Stiefel quickly realized that commercial punched card machines were not suited for mathematical work, and that the electronic computer projects under way, mainly in the US, but also in Britain, would not fill the gap for several years to come. He thus decided that ETH should build its own electronic computer. For this purpose, he delegated two of his assistants,\nHeinz Rutishauser\nand\nAmbros Speiser\n, to visit the US. Their assignment was to study the state-of-the-art in US computing and then to start a suitable project at the ETH.\nRutishauser\nand\nSpeiser\nspent most of\n1949\nat Harvard with\nHoward Aiken\nand at Princeton with\nJohn von Neumann\n, but they also visited a number of other computer installations, including the ENIAC at Aberdeen, Maryland and the MARK II at Dahlgren.\nHowever, in\n1949\n, Stiefel heard that\nKonrad Zuse\nhad built a computer in Germany. David Lide writes\n[\n1\n]\n:-\nStiefel was a visionary who realised the enormous significance of the new computing technology and the impact it would have on mathematics and science. When he discovered in\n1949\nthat a major computing engine, the Z\n4\nof the German designer\nKonrad Zuse\n, was sitting in the small Alpine village of Neukitchen, Germany, he travelled there and arranged for the machine to be rented and moved to ETH. Zuse, isolated by wartime secrecy, had independently developed computing technology that in many ways was superior to that available in the US at the time.\nAmbros Speiser\nexplains\n[\n4\n]\n:-\nAll these specifications of the Z\n4\n, as seen in\n1949\n, were very convincing for Stiefel,\nRutishauser\nand\nSpeiser\n. It must be borne in mind that at this time there were hardly a dozen program-controlled computers in operation, all of them in US. Less than a handful were in use for research in numerical mathematics, the others performed routine calculations. There were no doubts that Z\n4\ncould be used for serious mathematical research. ... When the Z\n4\nmachine was installed, significant work started almost immediately. Within a few years Zürich rose to be one of the foremost centres in numerical analysis. ... The creative spirit that was ever-present, the continuous expression and evaluation of new ideas, the thoroughly based academic knowledge and the sound scientific judgment were daily realities, I am almost tempted to say: This was the air that we were breathing. I can hardly believe, that Stiefel, when he decided to acquire the Z\n4\n, would have dared to hope for success of this degree! The Z\n4\nwas also extensively used in education. As early in\n1951\n, we offered to students a course in computer programming with practical exercises on the machine. We believe we were the first on the European continent to do so. This should be taken in consideration by those who often criticize that Swiss Universities were late in recognizing the importance of informatics.\nThe contract to rent the Z\n4\nwas signed by ETH by July\n1949\nand the computer was operational in Zürich by August\n1950\n. David Lide explains what some of the contributions of Stiefel's team were\n[\n1\n]\n:-\nStiefel's initiative made ETH the first European university with an electronic computer, putting it in the forefront of numerical computation and computer science. This led to several breakthrough developments by him and his colleagues, including the qd algorithm, the programming language ALGOL, and the conjugate gradient algorithm. His own interests evolved towards numerical algorithms, and he made substantial contributions to computational linear algebra, quadrature, and approximation theory ...\nOne of his first publications in this new area was\nNatürliche Eigenwertprobleme. I\nⓉ\n(\nNatural eigenvalue problems. I\n)\n(1950)\nwhich he wrote jointly with Hans Ziegler.\nE H Rothe\ndescribes the aims of their research programme:-\nThe authors set themselves the task of developing a general treatment of eigenvalue problems including those in which the eigenvalues appear explicitly in the boundary conditions. They feel that from the point of view of the applications to stability and vibrational questions in mechanics the variational approach is the most suitable one\n(\nas compared with the approach by differential or integral equations\n)\n.\nThere followed a series of four papers by Stiefel and his two assistants\nHeinz Rutishauser\nand\nAmbros Speiser\n,\nProgrammgesteuerte digitale Rechengeräte\n(\nelektronische Rechenmaschinen\n)\nⓉ\n(\nProgram-controlled digital computing devices\n(\nelectronic calculators\n)\n)\nappearing in\n1950\nand\n1951\n.\nHerman Goldstine\nwrites:-\nIn this series of papers the authors discuss in very considerable detail a number of the important mathematical questions that naturally arise in the design of a digital computer. These topics include possible number systems, the questions of \"fixed\" vs \"floating\" point and complementation, the arithmetic processes, the grouping of numbers to achieve higher than normal precisions, conversion between number systems, the structure of finite approximation methods, error analysis, programming and coding as well as the physical organs of a machine. In many of these considerations the authors have compared the various points of view expressed by others in the field to give a comprehensive picture of the situation as understood at the present time.\nStiefel's team had visited the United States from January\n1949\nas noted above. They met with the New York Works Administration Group and with the Director of the National Bureau of Standards in Washington. Stiefel spent the year\n1951\n-\n52\nin the United States attending the Jubilee Symposium of the National Bureau of Standards in August\n1951\n. In\n1955\nthe National Bureau of Standards  published four lectures by Stiefel under the title\nKernel polynomials in linear algebra and their numerical applications\n. In these lectures he unifies a number of known iterative methods for solving linear problems with a matrix which has only real eigenvalues. The theory of orthogonal polynomials over an arbitrary mass distribution on a real interval provides the basis for the unification.\nIn\n1961\nStiefel published his most famous work on numerical mathematics entitled\nEinführung in die numerische Mathematik\nⓉ\n(\nIntroduction to numerical mathematics\n)\n. A second German edition appeared two years later and, in the same year, an English translation of this second German edition:\nAn introduction to numerical mathematics\n. Further German editions and a French edition were published over the next few years. W Prager writes in a review of the first German edition:-\nIn manual computation the choice of a method that is particularly well adapted to the problem on hand may save a great amount of time. In automatic computation, however, this potential saving may be greatly reduced or altogether eliminated by the time needed for programming a special method. Unlike the majority of introductory texts on numerical analysis, the present one reflects this interest in a small number of algorithms of broad applicability.\nIn\n1959\nNumerische Mathematik\nwas founded, the Founding Editors being\nA S Householder\n,\nJohn Todd\n, E L Stiefel and A Walther. In a tribute to Stiefel the editors of\nNumerische Mathematik\nwrite of the\n[\n2\n]\n:-\n... high respect which he enjoyed among his colleagues, thanks to his technical achievements and also to his human qualities.\nThey also explain how his interests changed in the later part of his career:-\nWith the beginning of the space age the centre of his attention shifted to the classical but newly meaningful area of celestial mechanics. Using techniques of modern algebra, he achieved a breakthrough in the calculation of Keplerian orbits, which brought him worldwide attention.\nHe organised a number of very important conferences in Celestial mechanics at the Oberwolfach Research Centre in the Black Forest in Germany. The first of the series was in\n1964\nfollowed by meetings in\n1967\n,\n1969\n,\n1972\n,\n1975\nand\n1978\n[\n5\n]\n:-\nStiefel's intentions with respect to these meetings were twofold. First of all. he wanted to encourage European mathematicians to work in the exciting field of space research. Second, as he never really accepted the division between pure and applied mathematics, he tried to bring mathematicians from both sides together. Clearly Celestial Mechanics, with its wide range from very practical questions to very theoretical problems, is excellently suited for this purpose.\nTogether with G Scheifele, Stiefel published\nLinear and regular celestial mechanics. Perturbed two-body motion, numerical methods, canonical theory\nin\n1971\n. V Szebehely writes:-\nThis book is one of the highlights of modern celestial mechanics literature. ... The book is masterfully written, with clarity, conciseness and requiring very little or no background in celestial mechanics. It is recommended as a reference book and a text book.\nAnother important book on Celestial Mechanics was\nMethoden der analytischen Störungsrechnung und ihre Anwendungen\nⓉ\n(\nMethods of analytic perturbation theory and its applications\n)\nwritten with Urs Kirchgraber and published in\n1978\n. The authors explain their aim in the Foreword:-\nWe develop the averaging method, based consistently on Lie series, and we deal in detail with the implications of this basic concept.\nWe attempt to use examples suitable for application, and we especially include higher-dimensional problems. Whenever possible, we derive the basic differential equations or at least we interpret them.\nAlthough this book is addressed to application-oriented mathematicians, engineers and natural scientists, we deemed it appropriate, in the theoretical part of the book, to derive some fundamental results also. However, we tried to use simple and transparent proofs, presented in detail. In the theoretical parts, we always kept in mind the bridge to possible applications\n.\nIn the following year, this time with Albert Fässler, he published\nGruppentheoretische Methoden und ihre Anwendung : Eine Einführung mit typischen Beispielen aus Natur- und Ingenieurwissenschaften\nⓉ\n(\nGroup-theoretic methods and their application: An introduction with typical examples from natural and engineering sciences\n)\n. The book shows how a mathematician like Stiefel with a deep knowledge of pure mathematics and of the applications of mathematics can bring these together to the benefit of both areas. This book is not a research monograph but rather, knowing that few mathematicians have expert knowledge of the applications of group representations to problems of physics, chemistry and engineering, the authors wrote an introductory text which is a delight to read. An indication of the lasting importance of this text is the fact that an English translation, with extra material, was published under the title\nGroup theoretical methods and their applications\nIn\n1992\n.\nAs a teacher, Stiefel was highly respected\n[\n5\n]\n:-\n... he was also a brilliant teacher. And, indeed, he taught with the whole strength of his extraordinary personality.\nStiefel received may awards and honours for his wide ranging contributions. He received honorary degrees from the University of Louvian, the University of Würzburg, and the University of Braunschweig. He was elected to the\nNorwegian Academy of Science\nand the Academia Leopoldina in Louvain, and he was also elected to the presidency of the\nSwiss Mathematical Society\nin\n1956\n. He was also honoured by election as chairman of the Society of Applied Mathematics and Mechanics in\n1970\n. But it was not only mathematics which benefited from his expertise, for he was also elected to serve as a Zürich city councillor from\n1958\nto\n1966\n.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry"
  ]
}