{
  "nome_completo": "Lars Edvard Phragmén",
  "nome_curto": "Edvard Phragmén",
  "ano_nascimento": "1863",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Phragmen/",
  "lugar_nascimento": "Örebro, Sweden",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "Edvard Phragmén\n's parents were Lars Jakob Phragmén, a mathematics teacher at the local\nGymnasium\nin Örebro and author of mathematics books, and Hedvig Amalia Fernander. Lars Jakob Phragmén had been born on\n11\nJanuary\n1832\nand had studied at the University of Uppsala before becoming a teacher at a school in Stockholm. He became a mathematics teacher at the Gymnasium in Örebro in\n1859\nand, in\n1875\n, he also took on the role of rector. He retired in\n1902\n. Edvard grew up in Örebro, a town about\n200\nkm west of Stockholm. Following in his father's footsteps, he entered the University of Uppsala in\n1882\nbut, after a year, he began studying at Stockholm where\nMittag-Leffler\nimmediately recruited him to work for his journal\nActa Mathematica\n. Phragmén was asked by\nMittag-Leffler\nto study a letter from\nÉdouard Goursat\nand then discuss\nGeorg Cantor\n's definition of the continuum with\nMittag-Leffler\n. Phragmén gave a new proof of the\nCantor\n-\nBendixson\ntheorem in\nBeweis eines Satzes aus der Mannigfaltigkeitslehre\nⓉ\n(\nProof of a theorem from the theory of manifolds\n)\n(1884)\nand then published significant results on elliptic functions in\nSur un théorème concernant les fonctions elliptiques\nⓉ\n(\nOn a theorem on elliptic functions\n)\n(1885)\n. Also in\n1885\nhe published\nÜber die Begrenzungen von Continua\nⓉ\n(\nOn the limitations of continua\n)\n. These three papers were all published in\nActa Mathematica\n, the high quality journal which was edited by\nMittag-Leffler\n. Phragmén became an editor of\nActa Mathematica\nin\n1888\n. He graduated from the University of Uppsala in\n1889\n.\nIt was proof-reading papers for\nActa Mathematica\nthat first brought Phragmén to international recognition. This followed the competition for the Royal Prize, financed by King Oscar II of Sweden, which was announced in\nActa Mathematica\nin\n1885\n. The deadline for submissions was\n1\nJune\n1888\nand there were four questions, the first of which involved the stability of the solar system and asked for series which describe the motion of bodies in a generalised\n3\n-body problem.\nHenri Poincaré\nsubmitted an entry which the judges,\nHermite\n,\nWeierstrass\nand\nMittag-Leffler\n, deemed the best and worthy of the prize. The prize was to be presented by the King in January\n1889\nand\nPoincaré\n's prize-winning contribution began to be set up for printing in\nActa Mathematica\nwith Phragmén as proof-reader\n[\n1\n]\n:-\n... Phragmén found one dubious point after another. In December of\n1888\nhe writes: \"If the author were not what he is, I would not for a moment hesitate to say that he has made a great mistake here.\"\nPhragmén corresponded with\nPoincaré\nwho tried to correct the errors. However Phragmén found more problems with the paper and eventually, after the paper had been printed, it had to be withdrawn and completely rewritten by\nPoincaré\n. The new version was nearly\n100\npages longer than the original. In the revised introduction,\nPoincaré\nthanked Phragmen, writing:-\nIt is he, who in calling my attention to a delicate point, made it possible for me to discover and correct an important error.\nIn fact one of the points which Phragmén questioned prompted\nPoincaré\nto take the first steps in chaos theory.\nGårding\nwrites\n[\n1\n]\n:-\nHis remarkable proofreading feats gave Phragmén a great reputation. It may be overstated, but his penetrating critical ability became clear to everyone.\nYngve Domar writes\n[\n6\n]\n:-\nOf the greatest value for the editorial work of 'Acta Mathematica' was Phragmén's uncommon ability to analyze and critically examine, and his astuteness in this respect was also evidenced e.g. in the group of works he published in\n1890\n-\n92\nwhich treat a variety of subjects, often starting with an analysis of older theories. He speaks as critic in such lines as the following which introduce a work in which an argument of\nSchwarz\nis revised and corrected: \"Most mathematicians would probably not have any objection to this proof. However, there is one point which I find dissatisfying, ...\"\nSofia Kovalevskaya\ndied in February\n1891\nand her chair at Stockholm had to be filled.\nMittag-Leffler\nhad two excellent candidates to fill the chair, Phragmén and\nIvar Bendixson\n[\n1\n]\n:-\nAfter careful deliberation Mittag-Leffler found that Phragmén was the best candidate. Nobody at Stockholm University could contradict him.\nIn\n1892\nPhragmén obtained a permanent position at Stockholm when he was appointed to succeed S\nofia Kovalevskaya\n. He married Gyda Josephine Mathilde Sohlberg in\n1896\n. She was born in Christiania in\n1864\n, the daughter of Johan Vilhelm Sohlberg\n(\nborn\n1831)\nand his wife Johanne\n(\nborn\n1837)\n. In\n1904\nPhragmén resigned his chair at the university and, from that time, he worked for the state run Royal Inspection of Insurance Companies becoming director and head of the department of insurance in the following year. However, he continued in his role as an editor of\nActa Mathematica\n, in fact he continued as an editor until his death in\n1937\n. In\n1908\nhe became director of the private insurance company Allmänna Lifförsakringsbolaget.\nThe mathematical result for which Phragmén is best remembered today is the Phragmén-\nLindelöf\nprinciple. Phragmén's first progress towards this was his paper\nSur une extension d'un théorème classique de la théorie des fonctions\n(1904)\nin which he extended\nLiouville\n's result that every entire bounded function must be constant to show that the same result could be obtained for\nentire functions\nwith controlled growth in a given sector that were bounded outside the sector. Although this paper was an important contribution, the major advance came in a joint paper\nSur une extension d'un principe classique de l'analyse et sur quelques propriétés des fonctions monogènes dans le voisinage d'un point singulier\nⓉ\n(\nOn an extension of a classical principle of the analysis and on some properties of monogenic functions in the neighborhood of a singular point\n)\nof\n1908\nby Phragmén and the Finnish mathematician\nErnst Lindelöf\n. The breakthrough in this paper came about because in it they generalise Phragmén's earlier result by formulating it as an extension of the maximum principle for the absolute values of analytic functions.\nDomar comments in\n[\n6\n]\nabout a later work by Phragmén:-\nAnother pioneering work of Phragmén was presented at the Scandinavian Congress of\n1913\n. Here the problem is more special, lying within the theory of uniform convergence of trigonometric series. But Phragmén was far ahead of his time, as has been certified by the expert\nAntoni Zygmund\n, who rediscovered parts of the theory\n26\nyears later, unaware of Phragmén's paper.\nPhragmén had also made an important contribution to voting systems with the publication of two papers\nProportional elections\n(\nSwedish\n)\n(1895)\nand\nOn the question of a proportional election method\n(\nSwedish\n)\n(1899)\n. Phragmén's variant on the single transferable vote, proposed in his\n1895\npaper, was introduced in the Swedish Elections Act as a method of allocating seats within a party. Phragmén was a member of the committee during\n1903\n-\n03\nwhich prepared the legislation which became law in the Swedish Elections Act. His interest in voting systems in elections had come from a somewhat disastrous episode in attempting to elect a rector of the Mathematics College in December\n1894\n. There was a dispute over which mathematics lecturers were eligible to vote, some feeling that only the professors should vote. All were invited to vote in the December election but, because of the dispute,\nMittag-Leffler\n,\nBendixson\nand Phragmén abstained. Pettersson was elected but declined to accept the post. A second election was held at which only professors voted\n(\nafter a lengthy argument with the\ndocent\nwho eventually left the meeting with Pettersson\n)\nand Phragmén was elected rector. However, this vote was later declared invalid and yet another vote was held at which Pettersson was elected rector.\nHarald Cramér\ncomments in\n[\n5\n]\nabout Phragmén's character. Phragmén was:-\n... clear, logically objective, factual, perhaps somewhat cool, and occasionally sarcastic in his opinions.\nFor many years he was President of the Swedish Society of Actuaries taking up that role in\n1909\n. He was a member of a large number of Swedish and foreign academies and scientific societies. From\n1927\nuntil his death he was president of the council of the\nMittag-Leffler\nInstitute.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}