{
  "nome_completo": "Edward Burr Van Vleck",
  "nome_curto": "Edward Van Vleck",
  "ano_nascimento": "1863",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Van_Vleck/",
  "lugar_nascimento": "Middletown, Connecticut, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Edward Van Vleck\n's mother was Ellen Maria Burr and his father was John Monroe Van Vleck. John Van Vleck was a teacher of mathematics and astronomy at the Wesleyan University from\n1853\nuntil his death in\n1912\n. There he taught\nH S White\nand F S Woods and was well known nationally, in particular he was one of the two vice-presidents of the\nAmerican Mathematical Society\nin\n1904\n, the other being\nBolza\n. Edward was known as Ned by his father and friends.\nEdward Van Vleck attended Middletown High School, then Wilbraham Academy before entering the Wesleyan University in\n1880\n. Here he was taught mathematics by his father and lived at his parents' home during his years of study at the university. At this stage his interests were in mathematics, physics and astronomy and after graduating with an A.B. in\n1884\nhe spent a year as an assistant in the physics laboratory at the Wesleyan University.\nIn\n1885\nVan Vleck became a graduate student at Johns Hopkins University where his interests still ranged through mathematics, physics and astronomy. He studied mathematics there under\nCraig\n,\nNewcomb\nand\nStory\n, and physics under Henry Rowland. After two years he became convinced that mathematics was the topic for him. He was then advised by his father that he should travel to Göttingen in Germany to continue his studies.\nAt the University of Göttingen, Van Vleck attended lectures by\nKlein\n,\nBurkhardt\n,\nFricke\n,\nSchur\n,\nSchwarz\n, Woldemar, Voigt,\nWeber\nand others. His doctorate was awarded by Göttingen in\n1893\nfor the thesis entitled\nZur Kettenbruchentwicklung Laméscher und ähnlicher Integrale\nwritten under\nKlein\n's supervision. The thesis studied hyperelliptic and related integrals in\ncontinued fractions\n. After returning to the United States in\n1893\nVan Vleck was appointed as an instructor at the University of Wisconsin. In the same year he married Hester Laurence Raymond; they had one son, John Hasbrouck Van Vleck, who was born on\n13\nMarch\n1899\n.\nWe should record here that John Hasbrouck Van Vleck was educated at the University of Wisconsin, Madison, and then at Harvard University where he received his doctorate in\n1922\n. He worked at the University of Minnesota, the University of Wisconsin, then Harvard University where he was Hollis professor of mathematics and natural philosophy from\n1951\nto\n1969\n. He produced the first quantum mechanical theory of magnetism. He was awarded the Nobel Prize for physics in\n1977\nfor his work on the behaviour of electrons in magnetic, noncrystalline solid materials.\nReturning to describe the career of Edward Burr Van Vleck, after being an instructor in mathematics at the University of Wisconsin from\n1893\nto\n1895\n, he returned to the Wesleyan University as an associate professor. In\n1898\nhe was promoted to professor, again moving to the University of Wisconsin in\n1906\nwhere he remained as a professor until he retired in\n1929\n.\nAlmost all Van Vleck's research papers were in the fields of function theory and\ndifferential equations\n. For example he published\nOn the determination of a series of Sturm's functions by the calculation of a single determinant\n(1899)\n,\nOn linear criteria for the determination of the radius of convergence of a power series\n(1900)\n,\nOn the convergence of continued fractions with complex elements\n(1901)\n,\nA determination of the number of real and imaginary roots of the hypergeometric series\n(1902)\n,\nOn an extension of the\n1894\nmemoir of Stieltjes\n(1903)\n, and\nOn the extension of a theorem of Poincaré for difference-equations\n(1912)\n. In\n[\n6\n]\nthe authors discuss one of Van Vleck's papers. They write:-\nA discussion is given of a\n1908\npaper by the American E Van Vleck. It is argued that Van Vleck proved the first zero-one law, anticipating the zero-one law of\nBorel\nand, more strikingly, that of\nKolmogorov\n. A brief description of the evolution of the link between\nmeasure theory\nand\nprobability theory\nis given. By following Van Vleck's own steps in deriving consequences of his zero-one law, a result\n(\n\"the extended Van Vleck theorem\"\n)\nis given which is directly comparable to\nBorel\n's law of normal numbers. Finally, it is shown that the Van Vleck zero-one law, which in generality falls between that of\nBorel\nand that of\nKolmogorov\n, is further distinguished in that it provides the key step in establishing what may be the earliest example in\nergodic theory\nof a metrically transitive transformation.\nPerhaps surprisingly, for a man of his talents, his output of just over thirty mathematical articles might seem rather modest. This is explained by\nBirkhoff\nin\n[\n2\n]\nwhere he writes:-\n... as the years went on, the self-imposed demand for elegance and simplicity exercised a inhibitive influence upon Van Vleck's production.\nLanger and Ingraham in\n[\n4\n]\nexpress similar sentiments. Van Vleck considered a:-\n... mathematical result was not something to be transmitted haphazardly to the public. It should be part of a cultural structure and, as such, it should be expressed with precision and elegance.\nVan Vleck was\nAmerican Mathematical Society\nColloquium lecturer in\n1903\ngiving six lectures on divergent series and continued fractions. He published these lectures in the first volume of the series\nAmerican Mathematical Society Colloquium Publications\n. The\nAmerican Mathematical Society\nwas fortunate to have Van Vleck's support as well as that of his father. Van Vleck was an editor of the\nTransactions of the American Mathematical Society\nfrom\n1905\nto\n1910\n, vice-president in\n1909\n, and president from\n1913\nto\n1914\n. He gave his retiring presidential address on\nThe role of the point-set theory in geometry and dynamics\n. Perhaps his greatest contribution to the Society came in\n1911\nwhen his actions were to see the Society remain as a single national Society instead of breaking into smaller local societies. The crisis arose over where\nBôcher\nwould give his presidential address. John Hasbrouck Van Vleck, writing in\n[\n7\n]\n, recalled the events:-\nAt that time there was bitter feeling, especially by the Chicago group, that no national, rather than sectional, meetings were held west of the Alleghenies. ... The Harvard group was particularly adamant:\nOsgood\n, I remember father said, claimed he suffered from insomnia if he left Cambridge. ... Cole, the Secretary of the Society, was apparently willing to settle for a plan to more or less Balkanise it, whereas my father believed that the organisation should be national in scope.\nOn\n27\nFebruary\n1911\nBôcher\nwrote to Van Vleck\n(\nsee\n[\n7\n]\n)\n:-\nI wrote this morning to\nCole\n... saying I would give my presidential address in Chicago. In doing this I yield my own judgment, which tells me that no useful purpose will be accomplished, to yours. You are on the ground and ought to know.\nVan Vleck believed that his actions had\n[\n7\n]\n:-\n... averted an open break in the American Mathematical Society.\nIn\n1916\nthe University of Chicago celebrated its first\n25\nyears and as part of the Quarter-Centennial Celebration they awarded Van Vleck an honorary doctorate on\n6\nJune\n1916\n. The citation reads:-\nOf the American Mathematical Society sometime president, and editor of the Transactions; always wise counsellor and leader; creative mathematician and successful investigator in the theory of functions, and in the theories of differential and difference equations and of functional equations; for these eminent services in mathematics, and especially for your important researches concerning functional equations and analytic continued fractions.\nOn this occasion Van Vleck delivered an address on\nCurrent tendencies of mathematical research\n.\nHis interests are described in\n[\n1\n]\nas:-\nTravelling and collecting Japanese art... His collection of these prints, numbering thousands of items, is very remarkable, and one of the major private collections.\nHis contributions are summed up in\n[\n3\n]\nas follows:-\nVan Vleck was remembered by his peers as a cultured and distinguished scholar who did much to enrich the lives and careers of those who knew him.\nWe should note that the University of Wisconsin named a Hall for him on\n13\nMay\n1963\n, twenty years after his death.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}