{
  "nome_completo": "Edward Vermilye Huntington",
  "nome_curto": "Edward Huntington",
  "ano_nascimento": "1874",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Huntington/",
  "lugar_nascimento": "Clinton, New York, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Edward Huntington\n's father was Chester Huntington while his mother was Katherine Hazard Smith. Huntington attended Harvard College, and he was awarded his A.B. in\n1895\n, followed by his A.M. two years later. He had already been appointed as an instructor at Harvard after completing his first degree and he held this post while studying for his Master's degree. After being awarded the Master's degree, Huntington was appointed to Williams College.\nFor two years Huntington worked as a mathematics instructor at Williams College at Williamstown, Massachusetts. The College was a long established one, founded in\n1793\n. In\n1899\nHuntington left the United States to study for his doctorate in Europe. This was awarded by the University of Strasbourg in\n1901\n. Most American mathematicians of this period who went to Europe to complete their studies chose Germany and, indeed, the city of Strasbourg was German at this time\n(\nand in fact called Strassburg\n)\n. It had been annexed by Germany during the Franco-Prussian War of\n1870\n-\n71\nand would not became French again until after World War I. Huntington's doctorate was awarded for a thesis on algebra.\nReturning to the United States, Huntington again was appointed as an instructor in Harvard in\n1901\n. He was promoted to an assistant professor in\n1905\n, then in\n1909\nhe married Suzie Edwards Van Volkenburgh - they had no children. Huntington was promoted to associate professor in\n1915\nand to professor of mechanics at Harvard in\n1919\n. He retired from this chair, and his other duties, in\n1941\n.\nHuntington was interested in the foundations of mathematics. He devised sets of axioms for many mathematical systems, in particular showing that the sets of axioms were independent by giving examples which satisfied all but one of the axioms. He gave axioms for a\ngroup\n, an\nabelian group\n, a\nboolean algebra\n, geometry, the real number field, and the complex numbers. In\n1904\nhe gave axioms for a boolean algebra then later, in\n1933\n, he showed that a boolean algebra could be defined in terms of a single binary and a single unary operation. This is now known as Huntington's theorem.\nAlthough we have referred above to axioms and axiom systems, we have only done so since this is the modern usage. Huntington himself called these postulates, rather than axioms, and was careful to distinguish between 'postulate' and his own use of the term 'axiom'. For Huntington axiom:-\n... should only be applied to statements of fact\n[\nincluding\n]\nobviously true statements about certain definite operations on angles or distances.\nFor Huntington postulates were:-\n... conditions which a given system may or may not happen to satisfy.\nHuntington's book\nThe Continuum and other types of serial order\n(1917)\nwas a standard work on set theory for many years. A second edition of this little book consisting of\n82\npages was published\n(\nalso in\n1917)\nand reprinted as a Dover Publication in\n1955\n. Scanlan writes\n[\n3\n]\nthat the book was:-\n... a widely read introduction to Cantorian set theory and, although now outdated in method, is still a masterful presentation of the mathematical facts.\nOne might wonder why, given these interests, Huntington was appointed as Professor of Mechanics in\n1919\n. In fact this was more as a result of his deep interest in methods of teaching mathematics to engineering students than to a research record in the topic. He was, however, interested in several different aspects of applied mathematics. In\n1907\nhe developed log tables which were especially easy for students to use. He was an advocate of the use of calculating machines and he had a mechanical calculator on his desk in his Harvard office. He was also interested in statistics, which was unusual at this time, and he put his knowledge in this area into use during World War I when he worked on statistical problems for the military.\nHuntington proposed a method of appointing representatives to the US Congress. This was published as \"Edward V Huntington, Methods of Apportionment in Congress. A survey of methods of apportionment in Congress. Senate document no.\n304\n,\n76\nth\nCongress, Third session. United States Government Printing Office, Washington,\n1940\n\". The method was adopted in\n1941\nand is still used.\nIn\n1919\nHuntington was president of the\nMathematical Association of America\n, an organisation he helped to found, and his presidential address considered mathematical problems related to statistics. He was also vice-president of the\nAmerican Mathematical Society\nin\n1924\nand vice-president of the American Association for the Advancement of Science in\n1941\n.\nAmong the honours he received was election to the\nAmerican Academy of Arts and Sciences\nin\n1913\n. He was also elected to the American Philosophical Society in\n1933\n.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}