{
  "nome_completo": "Edward Blades",
  "nome_curto": "Edward Blades",
  "ano_nascimento": "1875",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Blades/",
  "lugar_nascimento": "Armadale, West Lothian, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Edward Blades\n's father was Daniel Blades\n(\nborn Cumbernauld, Dumbartonshire about\n1832)\nwho was a blacksmith. His mother was  Janet Blades\n(\nborn in Cumbernauld, Dumbartonshire about\n1832)\n. Edward Blades had four older siblings: Daniel\n(\nborn about\n1864)\n, Annie\n(\nborn about\n1866)\n, James\n(\nborn about\n1868)\nand Alexander\n(\nborn about\n1870)\n.\nEdward Blades was brought up in Armadale, West Lothian, where he lived in Academy Street. He attended Armadale Public School and also taught at the school as a pupil teacher. He then matriculated at the University of Edinburgh in\n1894\nwhere he studies a variety of topics. In session\n1895\n-\n1896\nhe took courses in Latin, Natural Philosophy, and Education; in session\n1896\n-\n1897\nhe took courses in English, and Mathematics; in session\n1897\n-\n1898\nhe took courses in Natural Philosophy\n(\nIntermediate\n)\n, and Mathematics\n(\nIntermediate\n)\n; and in session\n1899\n-\n1900\nhe took courses in Natural Philosophy\n(\nAdvanced\n)\n, and Mathematics\n(\nAdvanced\n)\n. He graduated M.A. in\n1900\nwith Honours in Mathematics and Natural Philosophy. He was awarded a B.Sc.\n(\nPure\n)\nin\n1902\nafter a very full course of study, especially in mathematics, astronomy, and geology. His teachers at the University of Edinburgh were, amongst others,\nChrystal\n,\nTait\nand Crum-Brown:-\nAs a student his capacity for careful and detailed investigation was recognised, and the late Sir John Murray, then busy with his Barymetric Survey of the Lakes of Scotland, entrusted him with a large part of the calculations involved in that survey.\nAfter leaving university, Blades attended the Training College, where he was awarded the first prize in the final year. He was awarded the Diploma of Education at the Higher Grade. His achievements had been outstanding and, through his education, he had been awarded the Kelland memorial prize, the Ramsay memorial prize, and six medals.\nAfter the requisite period of teaching in an elementary school, for several years Blades was junior lecturer in mathematics and assistant in science and geography in Moray House Training College, Edinburgh. He was also, for some time, lecturer in honours geology in Heriot-Watt College, Edinburgh. Later he was head of the mathematics department in George Watson's Ladies' College, Edinburgh. In\n1919\n, he was appointed Executive Officer to West Lothian Education Authority. From\n1930\nhe has held the post of Director of Education under the reconstituted West Lothian Education Committee. He retired in\n1939\n.\nWorld War II broke out towards the end of\n1939\n. He was awarded the honorary degree of LL.D. in\n1946\nby the University of Edinburgh for his work during the war. The citation explained his wartime contributions:-\nIn January\n1940\nMr Blades became honorary secretary to the University Extra-Mural Committee for civilian adult education. At that time the education scheme for His Majesty's Forces was about to take shape. Mr Blades had now retired and was looking forward to the enjoyment of well-earned leisure: yet without hesitation he answered the call which came to him. The work for the Forces proved a formidable task, but with his indomitable spirit would not recognise difficulty. At a time when every educational institution was short of staff, he had to find lecturers on many varied topics, as well as teachers academic and prevocational subjects. But he never failed to answer the demands made on him. The number of lectures given singly or in courses during the past six years reached a total of over\n14\n000\n, quite apart from the large number of classes that have been held.\nTo understand a little more of Blades' contributions during the war we quote an extract from a report of a conference which appeared in\nThe Scotsman\non Monday\n16\nJune\n1941\n:-\nAt the afternoon session, under the chairmanship of Mr A D Wilkie, Carnegie Trust, the question of \"Adult Education in Wartime\" was discussed, the chief speaker being Mr Edward Blades, B.Sc., former Director of Education for Midlothian and hon. secretary of Edinburgh University Extra-Mural Committee. Mr Blades first dealt with adult education among the civilian population. He said that, after a period of uncertainty at the outbreak of war, it was ultimately decided to offer classes in spite of the many difficulties obtaining, a decision which had been fully justified by the response. The number of classes and the attendance, while not up to the pre-war standards, showed a surprising steadiness when regard was had to the call-up of potential students to the Services, the requirements of civil defence, and the needs of the war industries. The topics chosen at first reflected war conditions, but in the second war session there had been a return to the more cultural subjects. The war had brought different sections of the community into closer contact than ever before and advantage had been taken of this to foster adult education among such groups. Social intercourse, not individualism, was needed for a fuller and more interesting life for the citizen. \"The war has taught us the need for service and activity of mind,\" he continued, \"and the danger of passive acceptance of what others think and say. Accordingly the success of an adult class depends not so much on what the student gets out of it but on what he puts into it. Adult education has in wartime performed a civic service in making a contribution to the maintenance of judgment and a sense of proportion in an unprecedented situation.\"\nCLASSES FOR SERVICE MEN AND WOMEN\nOne of the biggest experiments that had been made in the field of adult education was the war-time scheme for education in H.M. Forces. The object was to assist men and women who wished to make or maintain contact with such facilities as would normally have been available for them in civilian life. Attendance was therefore voluntary, with choice of subject and reasonable freedom of discussion in the hands of the unit. Continuity in the lectures and talks was aimed at to secure the cultural discipline of regulated study, but training and operational duties made this difficult. While Regional Committees provided civilian lecturers and teachers, units were also developing their own resources from a service which represented a cross-section of the community. The subjects requested were in the main on current affairs, but those offering a liberal education were also well represented. The pace, at first slow, was now considerably accelerated, and men and women were voluntarily attending lectures and classes who had no contact with adult education in civil life. Their interests had been aroused and\n(\nheir capacities tested as never before. Such a scheme should not be allowed to disappear when demobilisation began, and all interested in education must be ready to continue a movement which had brought a richer content to the lives of Servicemen and women.\nIn\n1948\nEdward Blades was awarded an O.B.E.\n(\nCivil Division\n)\n:-\nFor services to Army education in Scotland.\nOn Saturday\n4\nJune\n1949\nEdinburgh University Extra-Mural Committee held a one-day school in the Junior Secondary School, Currie. Blades, who at that time was retiring from the honorary secretaryship of the committee, gave an address \"Reflections on Adult Education\".\nEdward Blades joined the\nEdinburgh Mathematical Society\nin March\n1905\nwhen he was teaching at George Watson's Ladies' College, Edinburgh. Blades attended meetings of the Society and sometimes communicated papers written by others to the Society. For example, he communicated\nOn Spheroidal Harmonics and Allied Functions\n, by Mr G B Jeffery to the meeting on Friday\n11\nJune\n1915\nand\nTransformations of Axes for Whittaker's Solution of Laplace's Equation\n, by Dr G B Jeffery to the meeting on Friday\n9\nMarch\n1917\n. He remained a member of the Society throughout the different changes to his career.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}