{
  "nome_completo": "Edward Lindsay Ince",
  "nome_curto": "Edward Ince",
  "ano_nascimento": "1891",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ince/",
  "lugar_nascimento": "Amblecote, Stourbridge, Staffordshire, England",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Edward Ince\n's mother was Caroline Clara Cutler  while his father, also named Edward Ince, was an Inland Revenue officer. Edward, his parents' only son, was born in Amblecote which is west of Birmingham. He was brought up in Wales, attending school first in the west coastal Welsh town of Criccieth, then the county school at Portmadoc, a few miles along the coast. Before his secondary education was complete, his family moved to Perth in Scotland where he completed his schooling at Perth Academy.\nIn\n1909\nInce matriculated at Edinburgh University where he read mathematics. Cohn writes in\n[\n1\n]\n:-\nHe played a prominent part in the communal life of the university as senior president of the students' representative council and convener of the international academic committee.\nInce graduated in\n1913\nwith First Class Honours in mathematics and was awarded a scholarship to remain at Edinburgh University to undertake research. World War I broke out in\n1914\nand Ince was called up but failed the medical, so was rejected for military service. In\n1915\nhe went to Cambridge to continue research. He was a Smith's prizeman in\n1917\nbut left to undertake war service. When the war ended in\n1918\nInce was released from the war work he was undertaking and was appointed as a lecturer in mathematics at the University of Leeds. In\n1920\nhe moved to Liverpool where again he held a lectureship in mathematics. While holding this appointment he married Phyllis Fry in\n1924\n; they had two daughters.\nIn\n1926\nInce left Liverpool to take up the chair of pure mathematics at the Egyptian University in Cairo. There he built up a strong department but in\n1931\nhe decided to return to Britain. There were two main reasons why he chose to return, first that he felt that he wanted his daughters educated in Britain, and second that he found the climate was having an adverse effect on his health. After teaching at Edinburgh University during the academic year\n1931\n-\n32\n, he then was appointed to Imperial College, London, where he taught until\n1935\nwhen he was appointed as head of the department of Technical Mathematics at Edinburgh.\nInce's research was mainly on differential equations.\nÉmile Mathieu\ndiscovered the Mathieu functions, which are special cases of hypergeometric functions, in\n1868\nwhile solving the wave equation for an elliptical membrane moving through a fluid. Ince was the first to prove the proving the uniqueness of the Mathieu functions as periodic solutions. His work led him to discover techniques for the numerical study of these functions\n[\n1\n]\n:-\nBy the use of convergent infinite\ndeterminants\nand continued fractions, with asymptotic formulae for large values, he succeeded in making computations practicable and after eight years' devotion to this task he published in\n1932\ntables of eigenvalues for Mathieu's equation, and zeros of Mathieu functions. These tables were useful not only in the problems originally envisaged but also in more recent investigations such as quantum-mechanical problems leading to Mathieu's equation.\nInce published a major text\nOrdinary Differential Equations\n(\nLongmans, Green and Co., London,\n1926)\n. This\n[\n1\n]\n:-\n... gave a modern presentation of the theory, using methods from algebra as well as analysis. ... it immediately became a classic and remained in print for many years.\nThe importance of the work can be realised from the fact that Dover Publications, New York republished it in\n1944\n.\nOn behalf of the\nBritish Association\nCommittee for the Calculation of Mathematical Tables, Ince prepared\nMathematical Tables, Volume IV: Cycles of reduced ideals in quadratic fields\nwhich was published in\n1934\n. Again this work was reprinted, this time for the\nRoyal Society\nby Cambridge University Press in\n1966\n. After Ince returned to the chair in Edinburgh he became involved with the short student texts which were being published by Oliver and Boyd, Edinburgh. He contributed Integration of\nOrdinary Differential Equations\nand set out his aims in the Preface dated May\n1939\n:-\nThe object of this book is to provide in a compact form an account of the methods of integrating explicitly the commoner types of ordinary differential equation, and in particular those equations that arise from problems in geometry and applied mathematics. It takes the existence of solutions for granted ... With this qualification, it will be found to contain all the material needed by students in our Universities who do not specialize in differential equations, as well as by students of mathematical physics and technology.\nA C Aitken\nand\nD E Rutherford\nwrote the Preface to the second edition of\nIntegration of Ordinary Differential Equations\nof April\n1943\n:-\nThe Second Edition, through the untimely death of the author in March\n1941\n, has not had the advantage of being revised by him.\nArthur Erdélyi\nhad made some revisions to the text for this second edition. In\n1965\na German translation of the second English edition was published as\nDie Integration gewöhnlicher Differentialgleichungen\nby the Bibliographisches Institut, Mannheim.\nThe two papers\nThe periodic Lamé functions\nand\nFurther investigations into the periodic Lamé functions\nboth appeared in the\nProceedings of the Royal Society of Edinburgh\nin\n1940\n.\nBateman\nreviewing these papers writes that the approach:-\n... is similar to that previously used by\n[\nInce\n]\nto prove the corresponding theorem for\nMathieu\nfunctions. The nucleus of an integral equation for one of the periodic\nLamé\nfunctions is expanded in series of products of the characteristic functions .... Functions with periods exceeding\n2\nπ are finally considered, particularly those of period\n4\n. Such functions can exist for all values of\nn\nn\nn\nand are expressible in a finite form when\n2\nn\n2n\n2\nn\nis an odd integer. These finite forms have been considered by\nHalphen\nand others, but the results given here are simpler and more significant than those hitherto discovered.\nOne further paper,\nSimultaneous linear partial differential equations of the second order\n, was edited by\nErdélyi\nafter Ince's death and published in the\nProceedings of the Royal Society of Edinburgh\nin\n1942\n.\nInce was honoured with election to the\nRoyal Society of Edinburgh\non\n5\nMarch\n1923\n. The Society awarded him their Makdougall Brisbane prize, but sadly he died before he was able to receive the award.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}