{
  "nome_completo": "Edward Griffith Begle",
  "nome_curto": "Edward Begle",
  "ano_nascimento": "1914",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Begle/",
  "lugar_nascimento": "Saginaw, Michigan, USA",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Edward Begle\nwas known to his friends and colleagues as Ed. His parents were Ned G Begle and Cornelia Campbell. He entered the University of Michigan where he studied mathematics. His favourite mathematical topic was topology, taught by\nRaymond Wilder\n, and after the award of an A.B. in mathematics in\n1935\nhe remained at the University of Michigan to study for his master's degree which he received in the following year. Then he was accepted by Princeton to study for a doctorate under the famous topologist\nSolomon Lefschetz\n. He married Elise Alkin Pierce on\n14\nAugust\n1937\n; they had seven children. He was awarded a Ph.D. in\n1940\nfor his thesis\nLocally Connected Spaces and Generalized Manifolds\n. In his thesis Begle started with the concepts of a realization and a partial realization of a finite complex on a space which had been defined by\nLefschetz\nin a\n1936\npaper. Begle gave new definitions of these concepts which allowed him to use other techniques and simplify the study of generalized manifolds. He used\nVietoris\ncycles throughout the thesis.\nFollowing the award of his doctorate, Begle taught for the year\n1940\n-\n41\nat Princeton. He was then awarded a National Research Council Fellowship to spend the year\n1941\n-\n42\nback at the University of Michigan. In\n1942\nhe was appointed as an Instructor at Yale University where he spent the next nineteen years. He was promoted to Assistant Professor in\n1944\n, then to Associate Professor in\n1949\n. His early publications were in topology:\nHomology local connectedness\n(1941)\n;\nLocally connected spaces and generalized manifolds\n(1942)\n;\nIntersections of contractible polyhedra\n(1943)\n;\nRegular convergence\n(1944)\n; and\nDuality theorems for generalized manifolds\n(1945)\n. He continued to produce papers of significance such as\nA note on local connectivity\n(1948)\n,\nTopological groups and generalized manifold\n(1948)\n,\nA note on S-spaces\n(1949)\n,\nA fixed point theorem\n(1950)\n, and\nThe Vietoris mapping theorem for bicompact spaces\n(1950)\n. In the last mentioned paper, Begle generalised the\nVietoris\nhomology theory of compact metric spaces to the bicompact\nHausdorff\nspaces by considering their finite open coverings instead of the metric.\nHowever, his interests steadily turned away from research and towards teaching. Charles E Rickart writes\n[\n6\n]\n:-\nEd and I first taught Algebra to Army ASTP students, and the Calculus to Yale freshmen, spending hours discussing the problems of that teaching. Out of this grew Begle's elementary calculus text, which was unique at the time in that it contained serious mathematics written not for colleagues but for the students themselves ...\nThis textbook was\nIntroductory Calculus, with Analytic Geometry\nwhich Begle published in\n1954\n. He writes in the Preface:-\nThis text differs from most others in this field in that it treats calculus as a branch of mathematics rather than as a mere adjunct of the physical and engineering sciences. ... We start with a list of axioms and show how the theorems of the calculus are derived from these axioms. ... Our aim in presenting calculus in this fashion is to give the student more of an understanding of the basic concepts of the subject than is usually done in an introductory course. ... The mathematical techniques employed\n[\nin science and engineering\n]\nhave become so numerous and varied that no student can be expected to master more than a few of them without a framework of theory around which they can be organized.\nD T Finkbeiner begins a review of the textbook as follows:-\nWith new calculus books appearing each year, it is the rare instructor who has the time, the inclination, or the opportunity to examine all of them. Equally rare is the book which makes a real contribution to understanding of calculus at the first year level. In the reviewer's opinion Begle's book does make such a contribution and should be examined carefully by all instructors of beginning calculus.\nBegle also played major roles in what one might refer to as the 'administration of mathematics.' In\n1951\nhe was elected secretary of the\nAmerican Mathematical Society\nand undertook the duties associated with this important position with great diligence for the next six years. In\n1958\ntwo conferences were held under the sponsorship of the National Science Foundation both with the aim of making recommendations on how the school mathematics curriculum might be improved. The outcome of these conferences was the setting up of the School Mathematics Study Group\n(\nSMSG\n)\nto undertake a study of curriculum development. Begle was offered the position of director of the SMSG which he accepted with enthusiasm. The project was based at Yale, where Begle was based, and he was able to quickly bring together many of differing opinions all of which he channelled in a positive way with his skilful chairmanship. Donald E Richmond writes\n[\n6\n]\n:-\nEd guided without dominating. His exceptional integrity ensured that SMSG was administered with scrupulous honesty. ... Throughout, Ed dictated no solutions but strove to harmonise the opinions of all. ... no curriculum was to be imposed on any school system.\nIn\n1961\nBegle left Yale to become both a professor in the Department of Mathematics and a professor in the School of Education at Stanford University. However, he became more and more involved in mathematical education, particularly with his work as director of the School Mathematics Study Group.\nBrian Thwaites was involved in school mathematics curriculum development in England. He wrote\n[\n6\n]\n:-\nNot being a pure mathematician, I had not heard of Professor Begle in his younger days as a creative researcher in his own subject. But as soon as I and a few others in England began to gather together in the late\n1950\ns to talk about the deteriorating situation of mathematics and especially about the need to reform the content of school mathematics, the name of Begle sprang out of nowhere, so to speak, apparently heading every list and every communication which came to us from other countries. ... So by\n1961\nhe and his work with the SMSG were already well known to us. ... And that was the year of his visit to this country as a participant of - and\n(\nlittle did he suspect\n)\na guide of incalculable value to - the Southampton Mathematical Conference\n1961\n. ... how, you may ask, have we in the UK viewed Professor Begle's achievements as head of that\n(\nto us\n)\nvast organisation of the School Mathematics Study Group? First he led the way to team authorship, a startling innovation for conservative Europeans, but one which we adopted with fervour and moulded to our own fashion. ... Second, the sheer drive and administrative skill with which he prosecuted the SMSG's activities were abundant causes for astonishment and admiration on this side of the Atlantic. ... Third, ... groups all over the world would constantly be referring back, or across, to what was going on in Stanford. Whether or not there was invariable agreement is beside the point: what mattered was the sense that something very definite was happening under Ed's leadership. Fourth, ... one felt that there was no sense of competition in him; rather that he was carrying out some preordained strategy whose merits would ultimately be tested by the experience of millions of children and their teachers.\nAmong the many notes Begle wrote on mathematical education, let us mention:\nThe School Mathematics Study Group\n(1958)\n,\nComments on a note on \"variable\"\n(1961)\n,\nRemarks on the Memorandum 'On the Mathematics Curriculum of the High School'\n(1962)\n,\nA Study of Mathematical Abilities\n(1962)\n,\nThe Role of Axiomatics and Problem Solving in Mathematics\n(1967)\n, and\nSMSG: The first decade\n(1968)\n. In\n[\n3\n]\nthis picture of Begle is painted:-\nHe was often seen pacing the University corridors with dark eyes shrouded in thought, a tall man with a full white beard who liked to walk alone. Edward Begle was an independent man. His voice will be missed in the School of Education where a well-reasoned paradigm might resolve a tangled faculty discussion. It was the mathematician in him that made him impatient with untidy thought.\nThe authors of\n[\n3\n]\nalso paint this picture of Begle's home life:-\nIn their home, Edward Begle and his wife, Elsie, were generous hosts. The big, handsome house on Bryant Street in Palo Alto always offered a warm reception, reflecting the kind of family life the Begles had. The dark, oak-paneled study where Edward Begle did most of his writing was lined with pictures of the seven children: Cornelia, Sarah, James, Emily, Elsie, Edward, Douglas.\nBegle received many awards for his contributions to mathematical education including election as a fellow of the American Association for the Advancement of Science\n(1960)\nand the Award for Distinguished Service to Mathematics made by the\nMathematical Association of America\n(1969)\n. Part of the citation for this award reads\n[\n5\n]\n:-\nWith the assistance of many individuals and components of the mathematical community ... he has conducted a national experiment, unprecedented ... in its combination of depth, scope and size. He has done so with character and courage, with good judgment and balance, with understanding and endurance, and in a continual searching for the first rate. He is a mixture of Welshman, New Englander, American, mathematician, teacher, and sachem, and we are all in his debt. The mathematical and scientific part of American life in the middle third of this century may well be judged to have been outstanding; if the history of it is ever properly written, E G Begle's role therein will clearly have an exceptional place.\nHe served on the Board of Directors, the Finance Committee, and the Research Advisory Committee of the National Council of Teachers of Mathematics. In addition he served on the Committee on the Undergraduate Program of the\nMathematical Association of America\n, was chairman of the Conference Board of the Mathematical Sciences, and was a trustee of the\nAmerican Mathematical Society\n. He served on the United States Commission on Mathematical Instruction, from\n1962\nto\n1966\nand again for a second term from\n1970\nto\n1975\n. He was Chairman of the Commission from\n1963\nto\n1966\n. He served on the Executive Committee of the International Commission on Mathematical Instruction from\n1975\nto\n1978\n. He also received the Rosenberger Medal from the University of Chicago\n(1971)\n.\nBegle died of emphysema at the age of\n63\nwhile working on a review of research in mathematics education.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}