{
  "nome_completo": "Edward Maitland Wright",
  "nome_curto": "Edward Maitland Wright",
  "ano_nascimento": "1906",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wright/",
  "lugar_nascimento": "Farnley, near Leeds, England",
  "lugar_morte": "Reading, England",
  "biografia": "Edward Maitland Wright\n's mother was Kate Owen and his father was Maitland Turner Wright. Maitland Wright owned a soap making factory in Farnley, a small village near Leeds. 'Wright's Washall Soap' was produced in the factory and when Edward was born the family were very well off with a seemingly prosperous business. However, the fortunes of the soap factory changed and when Edward was three years old the business collapsed. The resulting financial disaster caused Kate and Maitland to separate and Kate Wright, being an excellent musician and trained music teacher, took up a series of positions at boarding schools in the south of England. She only accepted a position if the boarding school was prepared to give her accommodation and let her young son live at the school with her, which she was able to negotiate by taking a slightly smaller salary.\nOf course, living in boarding schools meant that Edward could attend lessons and he got a pretty good education in modern languages and classical studies. When Edward reached fourteen years of age he had still not been taught any mathematics, other than basic arithmetic, but then he was taught some basic algebra which fascinated him. At this stage his formal education really came to an end for he became a teacher himself. At a small preparatory school near Woking he was able to both act as a teacher, so earning his keep, and at the same time continue his own education. As well as teaching French, he had playing football as one of his responsibilities. He moved to London when he was sixteen years old and there he was employed as a French teacher. However he was determined to continue with his education, by now being particularly interested in learning more about physics and mathematics, and he took evening classes in physics at Woolwich. Mathematics, however, was a subject he worked at on his own. The arrangement suited Wright well but teachers are supposed to be older than sixteen and when the school was given an inspection\n[\n4\n]\n:-\nThe inspector reported that Edward Wright was far too young for the post he was occupying. He was immediately sacked. He then got a teaching job at Chard Grammar School in Somerset.\nIn one sense this proved fortuitous as far as mathematics was concerned for Wright could no longer work on physics since he now had no access to a laboratory, so he put all his effort into teaching himself mathematics. He was appointed a master at Chard Grammar School in\n1923\nand during three years teaching at the school he studied mathematics up to degree standard\n[\n2\n]\n:-\n... studying old exam papers, then buying the relevant text books from the secondhand department at Foyle's.\nHe took the London University BA examinations in mathematics as an external candidate and obtained first class honours. If this seemed like a great achievement for the young man with no formal training in mathematics, he was made to think otherwise by one of his fellow teachers at Chard School who suggested that reaching the standard of the London BA was about equivalent to the entrance standard for Oxford or Cambridge. This spurred Wright on to investigate the possibility of obtaining a scholarship.\nBy this time Wright was twenty years old and scholarships for Oxford and Cambridge were almost all restricted to people younger. He found that there was just one which had no age restriction and so he entered the competition and won. He became a student at Jesus College, Oxford in\n1926\n[\n2\n]\n:-\nHis time at Oxford was happy. He rowed for the college, learned to fly with the university air squadron\n(\nthough he never learned to drive\n)\nand met his future wife, Phyllis Harris, an English student at St Hilda's and cox of the Oxford women's eight.\nHe became a research student of\nHardy\nand was awarded the first Junior Research Fellowship at Christ Church, Oxford, which he held from\n1930\nto\n1933\n. During this time he spent a year at Göttingen at\nHardy\n's suggestion, and was appointed a lecturer at King's College London for the year\n1932\n-\n33\n. The year in Göttingen was an enjoyable one mathematically, but he came back convinced that a war with Germany was inevitable. Having gained an MA and a DPhil from Oxford University, he was appointed a lecturer at Christ Church Oxford in\n1933\n; he taught there until\n1935\n. He was able to share his views that the British policy of appeasing Hitler was doomed to failure with R V Jones and Frederick A Lindemann\n(\nwho was at the time professor of physics at Oxford, later becoming Lord Cherwell\n)\n, who had similar opinions. Wright married Phyllis Harris, the daughter of Harry Percy Harris from Bryn Mally Hall, North Wales on\n15\nAugust\n1934\n; they had one son John Wright who became Professor of Mathematics at the University of Reading. Wright left Oxford in the following year when, at the age of\n29\n, he was appointed as Professor of Mathematics at Aberdeen.\nOne of Wright's first papers, published in\n1930\n, was on Bernstein polynomials. Also among his early work was a series of three papers titled\nAsymptotic partition formulae\n. The third in the series\nAsymptotic partition formulae, III. Partitions into kth powers\nwas published by\nActa Mathematica\nin\n1934\n. Recently George Andrews wrote of this paper:-\nThe point I wish to make is that Wright's third paper on partitions into powers is unique in the history of the subject. Its starting point and fundamental philosophy are different from anything that has come before or since.\nWright's best known mathematical contribution was his joint authorship of\nAn introduction to the theory of numbers\nwritten with\nHardy\n. This was first published in\n1938\nand the authors write in the Introduction:-\nWe have often allowed our personal interests to decide our programme, and have selected subjects less because of their importance\n(\nthough most of them are important enough\n)\nthan because we found them congenial and because other writers have left us something to say. Our first aim has been to write an interesting book, and one unlike other books. We may have succeeded at the price of too much eccentricity, or we may have failed; but we can hardly have failed completely, the subject-matter being so attractive that only extravagant incompetence could make it dull.\nIt is a beautiful book, truly enjoyable to read. If there is one eccentricity worth mentioning it is that the authors chose not to include an index. The topics in the book were, to a large extent, determined by various lecture courses on number theory that\nHardy\nand Wright had given. These topics are: prime numbers; congruences and the quadratic reciprocity law; continued fractions; irrational, algebraic and transcendental numbers; quadratic fields; arithmetical functions, their order of magnitude and the\nDirichlet\nor power series which generate them; partitions and representations of numbers as sums of squares, cubes and higher powers; Diophantine approximation; and the geometry of numbers.\nMordell\nwrites in\n[\n1\n]\n:-\nIt contains a wealth of interesting and often unexpected material which has not yet found its way into other so easily accessible books. The authors have spread their nets far and wide in gathering interesting material and their haul is a very nice one indeed. It is really surprising what an immense storehouse they have filled. There is sufficient variety in it to satisfy the most catholic taste and to cater for the reader in all his moods. He may go through the book from cover to cover, or study a chapter here and there, or dip in now and then for a pleasant morsel. In lighter moments he may turn to the theory of the game of Nim, while on more austere occasions he may study the question of Euclidean algorithms in algebraic fields, or the\nRogers\n-\nRamanujan\nidentities in the theory of partitions.\nWorld War II interrupted Wright's work at Aberdeen. As we mentioned above, he had learnt to fly while a student at Oxford, so it was natural he became a Flight Lieutenant in the Royal Air Force Volunteer Reserve from\n1941\nto\n1943\n. He spoke of his war experiences in an interview recorded on\n2\nMay\n1986\n:-\nI was very interested in student concerns. During the war I was one of the Senatus members on the Union Committee. We had the Air Squadron at Marischal. We had nothing that you could call a mess but we did use the Kirkgate Bar, and we used the Union to eat quite often. I knew the Union Provisor then very well. I actually fire-watched and he said, \"Come and do it in the Union. I can give you a bed with sheets and a hot meal.\" So he could! You got Form\n6\nallowance. Everybody got this. Everywhere else you were paid at the end of your shift. At the Union you were paid at the beginning. You then went down with the students to the Kirkgate Bar, which was included in the Union. It would have been terribly difficult to get on to their roof, but still it was included. They paid partly for the night watchman and this sort of thing. You sat there, drinking gently; the students all had money to stand their round because usually they were very keen on standing their round, but you didn't like them doing it. Then at\n9\n.\n30\npm when the pub shut you went back and had supper, and went to bed. Fortunately we were never turned out. Of course, the Union roofs were not inviting.\nThrough his friendship with Lord Cherwell he was seconded from his chair in Aberdeen to work as a Principal Scientific Officer with Air Ministry Intelligence at MI\n6\nheadquarters in London from\n1943\nto\n1945\n[\n2\n]\n:-\nOne of his first tasks was to tour the stations of Bomber Command to lecture air crew on the German night defences and on plans to disrupt them using metal foil strips.\nAfter the war ended Wright returned to his duties as professor of mathematics at Aberdeen. He became increasingly involved in university administration and served on various committees such as the Scottish Universities Entrance Board from\n1948\nto\n1962\n, being chairman from\n1955\nto\n1962\n, and the Anderson Committee on Grants to Students\n(1958\n-\n60)\n. In\n1961\nhe was appointed as Vice-Principal of the University and in the same year he was appointed to the Hale Committee on University Teaching Methods. In the following year he became Principal and Vice-Chancellor of Aberdeen University succeeding Sir Thomas Taylor. He led the University through a period of rapid expansion until he retired in\n1976\n. At this point he became a Research Fellow at the University of Aberdeen and held this post until\n1983\nwhen he retired at the age of\n77\n.\nMost would have given up mathematical research during\n14\nyears as Principal and Vice-Chancellor of a University but not Wright who continued to produce a stream of high quality papers until\n1981\n. In all he published around\n140\nmathematical papers\n[\n4\n]\n:-\nHe worked initially in\nanalytic number theory\n, in particular, generalisations of\nWaring\n's Problem. He\n[\nwas\n]\ninterested in many different strands of analysis, being one of the first to work on difference-differential equations. His work on the\nLambert\nW function\n(\nwhich had also intrigued\nEuler\n)\nseems of current interest. He later applied analytic methods to graph theory, obtaining some powerful asymptotic results.\nAccording to Edward Patterson\n[\n3\n]\n, as often as not at the closing of meetings of the professors of the University which were chaired by the Principal, Wright would beckon Patterson to come and speak with him. Consequently, Patterson had to face a lot of ribbing by his fellow professors about the \"scheming mathematicians\" who were secretly running the institution, since they refused to believe that all Wright wanted Patterson for was to check the mathematics on which Wright had been working in the course of the meeting. Patterson ascribed Wright's productivity to his having made excellent use of University meetings.\nWright received many honours for his outstanding contributions. He received honorary degrees from St Andrews\n(1963)\n, Stathclyde\n(1974)\n, Pennsylvania\n(1975)\n, and Aberdeen\n(1978)\n. In\n1963\nhe was made an Honorary Fellow of Jesus College, Oxford. He was knighted in\n1977\n. He was made an honorary editor of\nZentralblatt für Mathematik\nin\n1950\nand of the\nJournal of Graph Theory\nin\n1983\n; he continued in these roles until his death. He was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1937\nand was awarded their Makdougall-Brisbane Prize in\n1952\n:-\n... for particular distinction in the promotion of scientific research.\nHe served on the Council of the\nRoyal Society of Edinburgh\nfrom\n1948\nto\n1949\nand again from\n1953\nto\n1956\n. He was elected to the\nLondon Mathematical Society\non\n12\nDecember\n1929\nand was awarded their Senior Berwick Prize in\n1978\n; at the time of his death he had been a member for\n75\nyears. Also in\n1978\nhe was awarded the Gold Medal of the Order of Polonia Resituta of the Polish People's Republic.\nWright continued to live in Aberdeen after the death of his wife Phyllis in\n1987\n. However he eventually moved down to Reading where his son was Professor of Mathematics and lived at\n9\nSutherland Avenue, Reading.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}