{
  "nome_completo": "Edwin James George Pitman",
  "nome_curto": "Edwin Pitman",
  "ano_nascimento": "1897",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pitman/",
  "lugar_nascimento": "Melbourne, Victoria, Australia",
  "lugar_morte": "Kingston, Tasmania, Australia",
  "biografia": "Edwin Pitman\n's parents were Ann Ungley Hooks and Edwin Edward Pitman. Both his parents were English and they met when they were on board a ship bound for Australia. The parents were emigrating to Australia and, after they reached Australia, they settled in Melbourne, married and had eight children, six girls and two boys. Edwin Edward worked for a firm making machinery. Edwin, the subject of this biography, was the fourth of his parents' children having three older sisters. Edwin's mother quickly realised that her son had a remarkable ability to retain information - she called him \"that piece of blotting paper\" - and although the family did not possess many books, Edwin loved to read books that he borrowed from his Sunday School teacher.\nPitman's early education was at Kensington State School, and from there he progressed to South Melbourne College. The College was rather remarkable, as\nEvan Williams\nrelates in\n[\n6\n]\n(\nor\n[\n7\n]\n)\n:-\nOn Saturday morning the boys would work through examination papers in Arithmetic and Algebra, including in the later years Cambridge Tripos papers; in the afternoons they would study Shakespeare. Even so, Edwin was dissatisfied with the course, believing that, although it was advanced it was not rigorous enough.\nIn his final year at South Melbourne College, the head of the College encouraged him to apply for residential scholarships for the University of Melbourne. He did so with great success, being awarded the Wyselaskie and the Dixson mathematics scholarships and well as an Ormond College Scholarship. He entered Ormond College, University of Melbourne, in\n1916\nand was taught by two outstanding lecturers. One was the New Zealander D K Pieken, who taught Pitman a rigorous understanding of the number systems. The other was\nCharles Weatherburn\nand we quote Pitman's own description of the way that he was taught by\nWeatherburn\n[\n4\n]\n:-\nThere were very few honours students, and I was the only Ormond student doing honours mathematics in my year. I went to his room once a week, and sat near his desk while he talked and wrote notes for me. Always he wrote on the back of foolscap paper, the front of which was filled with an early draft of a section of one of his books. He took me through the topics in his two books on vector analysis, and perhaps also some\ndifferential geometry\n... He was neat and clear and interesting, and for me it was a very easy and efficient way of mastering vector analysis.\nOf course, when Pitman began his university studies, World War I was already in progress. In fact it was near the end of the war before he had to put his studies on hold when, in\n1918\n, he began war service with the\n14\nth\nBattalion of the Australian Imperial Force. He was demobbed in\n1919\nbut spent the year\n1919\n-\n20\nin London studying at the London School of Economics and also studying French and German at Berlitz College. He returned to Ormond College, Melbourne, in\n1920\nto continue his interrupted undergraduate studies. Again he was taught by\nWeatherburn\nbut he also met statistics for the first time\n[\n1\n]\n:-\nIn a course called Advanced Logic at the University of Melbourne, Professor W R Boyce-Gibson, a very able philosopher and an excellent lecturer, devoted two or three lectures to\n[\nstatistics\n]\n. I decided then and there that statistics was the sort of thing that I was not interested in, and would never have to bother about.\nPitman graduated with a B.A. with First Class Honours in Mathematics in\n1921\nand a B.Sc., mainly involving physics, in\n1922\n. In that year he was appointed Acting Professor of Mathematics at Canterbury College, University of New Zealand. After spending\n1922\n-\n23\nin that role, he returned to Melbourne where he was awarded an M.A. in\n1923\n. During session\n1924\n-\n25\nhe was a tutor in mathematics and physics at Trinity College and Ormond College, and also a part-time lecturer in physics at the University of Melbourne. In\n1925\nhe applied for the position of Professor of Mathematics at the University of Tasmania. This was one of the turning points in his career for, as he explained\n[\n1\n]\n, at this point he became involved with statistics:-\nApplicants were asked to state whether they had any knowledge of statistics, and if they would be prepared to teach a course in the subject. I wanted the appointment, so in my application I wrote, \"I cannot claim to have any special knowledge of the Theory of Statistics; but, if appointed, I would be prepared to lecture on this subject in\n1927\n.\"\nIndeed, his application was successful and he took up the position of Professor of Mathematics at the University of Tasmania in\n1926\n. It was a small university and, when he took up the post, the Department of Mathematics only had one part-time lecturer in addition to himself. This meant he had a very heavy teaching load giving courses in pure mathematics, applied mathematics and, after he had learnt enough statistics by reading books, he taught statistics courses. His study of statistics went further in\n1928\nwhen one of his part-time students, who also worked in the State Department of Agriculture, brought him some data on field trials of potatoes which he had analysed. The student, R A Scott, asked him to check that his analysis was correct before it sent it to\nJohn Wishart\nin Cambridge, which Pitman did. Not only did this mark the start of Pitman's collaboration with Scott and the State Department of Agriculture, but Scott also showed him a copy of\nR A Fisher\n's\nStatistical Methods for Research Workers\n.\nIn Tasmania he met Elinor Hurst, who graduated in Arts from the University of Tasmania. They married on\n7\nJanuary\n1932\nand set up home in a large sandstone house on the edge of Hobart. They had four children: Jane, Mary, Edwin Arthur\n(\nTed\n)\n, and James\n(\nJim\n)\n. Three became academics, one of these a mathematician, one a statistician and the other an environmental scientist.\nPitman had no thoughts of publishing research articles at this stage in his career. In the first place he had not received any training in research and, in the second place, he was too busy with teaching and administration to add another string to his bow. However, in\n1936\nhe was chairman of the Professorial Board and the university had received a grant from the government to promote scientific research. He wanted to be able to write a good end of year-one report and knew that only published articles would impress. He decided he better try to publish something and, as a first attempt, wrote a paper on hydrodynamics. However, he did not feel that it was good enough to even try to publish, so he made a second attempt with a statistics paper\nSufficient statistics and intrinsic accuracy\n. The paper\n[\n6\n]\n:-\n... defines the class of probability distributions that admits a complete sufficient statistic and also gives a critical account of the related concepts of information and intrinsic accuracy.\nHe sent the paper to\nJohn Wishart\nwhom he thought might remember his name through the State Department of Agriculture field trials.\nWishart\naccepted the paper for publication in the Proceedings of the Cambridge Philosophical Society and it was published in\n1936\n. This was the first of a series of eight papers which he wrote during the next two years which included:\nSignificance tests which may be applied to samples from any populations\n(1937)\n,\nSignificance test which may be applied to samples from any populations. II. The correlation coefficient test\n(1937)\n, and\nSignificance tests which may be applied to samples from any populations. III. The analysis of variance test\n(1938)\n. Another example is the paper\nA note on normal correlation\n(1939)\nwhich C C Craig describes as follows:-\nUsing the familiar fact that two simple linear combinations of two normally correlated variates are independently and normally distributed, an exact test is derived for the significance of the ratio of sample variances in samples from a normal bivariate population. The test contains only quantities calculable from the sample and can be put in the form of a\nFisher\n's \"t.\"\nThis sudden rush of published papers came to an end in\n1939\nwhen, with the start of World War II, Pitman lost a member of his department who was seconded for war work and he himself became an honorary Education Officer, No.\n6\nRecruiting Centre RAAF and later Wing Training Officer No.\n6\nWing Air Training Corps. This involved him in travelling from Hobart to Evandale several times a week, a distance of about\n170\nkm. He only returned to publishing after the war ended.\nIn\n1947\nhe received an invitation to give lecture courses at two universities in the United States, Columbia University and the University of North Carolina. The family sailed to the United States in January\n1948\nwhere Pitman, for the first time, gave and attended research seminars. It is remarkable to think that by this time he had been a university lecturer for\n26\nyears but had never given a seminar since he had never before had the opportunity to work with other statistics researchers. The family landed in San Francisco and, after travelling across that United States, Pitman taught for a semester at Columbia University in New York\n[\n1\n]\n:-\nAbraham Wald\nwas head of the statistics department. I had studied many of his papers, and learnt much from them. When I gave a seminar, he showed his mathematical power in the discussion afterwards. I realised that he had completely grasped what I had done. I admired him greatly, not only for his mathematical talent, but also for his great humility and kindness.\nHe next went to the University of North Carolina at Chapel Hill where again he gave a course. He met\nHerbert Robbins\nat Chapel Hill and they wrote a joint paper\nApplication of the method of mixtures to quadratic forms in normal variates\n(1949)\n. After this he spent a few weeks at Princeton before returning to Australia. This was only the first of several visits Pitman made to the United States. He spent research visits at Stanford in\n1957\n, Johns Hopkins in\n1963\n, and Chicago in session\n1968\n-\n69\n. He also visited the University of Dundee in Scotland, where he was a visiting senior research fellow, in\n1973\n. In fact most of these visits were made after Pitman retired, which was in\n1962\nwhen he reached the age of sixty-five. Retirement, however, did not mean that he stopped undertaking research, rather it gave him more opportunities to travel and work on statistical problems. Some of his most significant work, which he did over several years, was on the\nCramér\n-\nRao\ninequality. In particular he was interested in the regularity conditions under which it holds and its use in comparing statistics as estimates of parameters. He published an important paper on the topic in\n1978\n, namely\nThe Cramér-Rao inequality\n. He was over eighty years of age at this time and he writes in\n[\n1\n]\nthat his work here:-\n... would seem to be the last word on this famous inequality.\nIn\n1979\n, Pitman published a book entitled\nSome basic theory for statistical inference\n.\nC R Rao\nwrites in a review:-\nThis book is based on lectures delivered by the author at various places on selected and somewhat unrelated topics in statistical inference. The emphasis is on rigour and elegance of proofs. ... the author's efforts in presenting the mathematical results with some elegance and precision are highly commendable. The book should be read by all those who teach statistical inference.\nPitman received many honours for his contributions to mathematics and statistics. He was elected president of the\nAustralian Mathematical Society\nin\n1958\n-\n59\nand was made an honorary life member in\n1968\n. Two years earlier he had been made an honorary life member of the\nStatistical Society of Australia\nand the Society now awards the Pitman Gold Medal as its highest honour. The first such presentation of the Pitman Gold Medal was made to Pitman himself in\n1978\n. He was elected a fellow of the\nAustralian Academy of Sciences\nin\n1954\nand, two years later, he was elected to the International Statistical Institute. He was elected a fellow of the\nRoyal Statistical Society\nin\n1965\n. The University of Tasmania, which he had served so well, awarded him an honorary doctorate in\n1977\n.\nAs to Pitman's character, let us quote from Peter Sprent who was a student of Pitman's in the\n1940\ns, going on himself to become a professor of statistics:-\nOn first acquaintance, I summed up Edwin Pitman as somewhat cool and aloof, perhaps a little indifferent to those around him. I was misled because Edwin was so highly organized and self-disciplined that he conducted himself - in public at any rate - with almost military precision. He would have achieved less both as an academic and as an administrator had he not led such a disciplined life. In his own University he was remembered as a key figure in a small group who steered an under-staffed, poorly financed and sometimes badly administered University through turbulent seas to calmer waters. ... Edwin's most endearing characteristic was modesty about his achievements. He gave a course on inference, culminating in a treatment of asymptotic relative efficiency, not even telling us it was his concept.\nSpent also writes in\n[\n5\n]\n:-\nEdwin had a flair for coining descriptive, often amusing, words or phrases to epitomize widely used or novel concepts, e.g. 'squariance' for 'the sum of squares of deviations from the mean' and 'loglihood' for 'the logarithm of the likelihood'. His eccentric limit theorem proved that the limiting distribution of the harmonic mean of independent variates having certain properties is the Cauchy distribution.\nFinally, we note that in addition to mathematics and statistics, Pitman was very fond of gardening, music and drama.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}