{
  "nome_completo": "Egon Sharpe Pearson",
  "nome_curto": "Egon Pearson",
  "ano_nascimento": "1895",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pearson_Egon/",
  "lugar_nascimento": "Hampstead (near London), England",
  "lugar_morte": "Midhurst, Sussex, England",
  "biografia": "Egon Pearson\n's father was\nKarl Pearson\n, whose biography is given in this archive, and his mother was Maria Sharpe. Egon was the middle child of three in the family; Sigrid Loetitia was three years older and Helga Sharpe three years younger than Egon. Even as a child at the age of five he was aware of his father's work and his efforts to bring the journal\nBiometrika\ninto existence. Later in life Egon recalled creating his own journal as a five years old:-\n... which was all scrawls with chalk.\nHe attended school, first at Dragon School Oxford from\n1907\nto\n1909\n, then going to Winchester College from which he graduated in\n1914\n. He had been accepted to study at Trinity College Cambridge in June of that year.\nWorld War I began in\n1914\nbefore he was due to matriculate at Cambridge, and had Pearson's health been good he would have found himself in military service. However, his health had never been good as a child and he had a heart murmur which now prevented him from enlisting. He therefore went to Trinity College, Cambridge, to begin his university studies. These studies were interrupted by influenza which hit him hard and he was unable to study from August\n1914\nuntil the end of that year. At the end of one year of study, Pearson left Cambridge in\n1915\ndetermined to make a contribution to the war effort, and he worked for the Admiralty and the Ministry of Shipping.\nPearson never took up his undergraduate studies at Cambridge again after the war but was awarded his B.A. in\n1920\nafter taking the Military Special Examination in\n1919\nwhich had been set up to cope with those who had their studies disrupted by the war. He then began research at Cambridge, but not on statistics as one might have expected, rather on solar physics. However, even the astronomy lectures he attended, which were given by\nEddington\n, involved him in statistics since\nEddington\nwas lecturing on the theory of errors. Pearson also attended astronomy lectures by F J M Stratton and undertook work with F L Engledow and\nG U Yule\n.\nIn\n1921\nPearson joined his father's Department of Applied Statistics at University College London as a lecturer. However, despite being a lecturer, his father seems to have kept him away from lecturing. Instead Pearson attended all of his father's lectures and began to produce a stream of high quality research publications on statistics. In\n1924\nPearson became an assistant editor of\nBiometrika\nbut perhaps one of the most important events for his future research happened in the following year.\nNeyman\nhad a two year Rockefeller Research Fellowship for the years\n1925\n-\n27\n. He spent the first of these two years in University College, London, and the second of them in Paris. When\nNeyman\nmet Pearson in his father's Department in\n1925\nhe did not realise that he was going through a sort of crisis.\nKarl Pearson\n's work had been under attack from\nR A Fisher\nfor a number of years and Egon later explained\n(\nsee for example\n[\n3\n]\n)\n:-\n... I had to go through the painful stage of realising that K.P.\n[\nhis father\n]\ncould be wrong ... and I was torn between conflicting emotions:\nfinding it difficult to understand R.A.F.\n[\nFisher\n]\n,\nhating him for his attacks on my paternal 'god',\nrealising that in some things at least he was right.\nIn\n[\n3\n]\nthe friendship that developed between\nNeyman\nand Pearson during\n1926\nis described. It paints a picture of Pearson, and his difficulties, at this time:-\nPearson was an introverted young man who felt inferior for a number of reasons. He had grown up in the great shadow of K.P.\n[\nKarl Pearson\n]\n, \"lovingly protected\" in his childhood and kept out of the war in his youth. At Cambridge he had felt cut off from classmates of his own generation, all veterans of the conflict. He suspected that K.P. was disappointed in him, for he had not gone on to his second mathematics tripos but had taken his degree on the basis of work he had done during the war. After joining the staff of K.P.'s laboratory, he had continued to live at home and to have almost all his social contacts with relatives.\nIt is perhaps worth noting that\n1926\nwas the year when\nKarl Pearson\nallowed his son to begin lecturing at University College. Even then it took place simply because\nKarl Pearson\n's health prevented him teaching, rather than for positive reasons.\nPearson and\nNeyman\nagreed to undertake a joint research project in June\n1926\n, just before\nNeyman\nleft for Paris. Their joint research was carried on by letters, but there were meetings such as in the spring of\n1927\nwhen Pearson visited\nNeyman\nin Paris. During the visit they mapped out their first joint paper and planned their future research.\nNeyman\ndescribes their collaboration in\n[\n9\n]\n:-\nThe initiative for cooperative studies was Egon's. Also, at least during the early stages, he was the leader. Our cooperative work was conducted through voluminous correspondence and at sporadic get-togethers, some in England, others in France and some others in Poland. This cooperation continued over the decade\n1928\n-\n38\n.\nNeyman\nalso describes in\n[\n9\n]\nthe aims of their work:-\nMy joint work with Egon was concerned with problems of testing hypotheses. One aspect of this work was philosophical ... The decade-long joint work of Egon and myself was aimed at building a mathematical theory of tests the use of which could minimise the frequency of erroneous conclusions regarding the hypotheses considered ...\nAs H A David writes in\n[\n6\n]\n:-\nThe\nNeyman\n-Pearson theory of testing statistical hypotheses has become an integral part of every statistician's education and vocabulary.\nThere was a second major correspondence which Pearson carried out over much the same period as the\nNeyman\n-Pearson collaboration. This was one which Pearson carried out with\nGosset\n, and\nGosset\n's ideas played a big role in the discussions between Pearson and\nNeyman\n.\nPearson visited the United States in\n1931\nand, in addition to lecturing in Iowa, he held discussions with\nShewhart\nin the Bell Telephone Laboratories in New York. The following year\nShewhart\nvisited Pearson in London and their discussions on quality control in industry led to the creation of the Industrial and Agricultural Research Section of the\nRoyal Statistical Society\n.\nIn\n1933\nKarl Pearson\nretired from the\nGalton\nChair of Statistics which he had held in University College London. Against his wishes the University authorities decided to split the Department into two separate departments; the\nGalton\nChair and Head of the Department of Eugenics went to\nFisher\n, while Egon Pearson was appointed Reader and became Head of the Department of Applied Statistics. If\nKarl Pearson\ndid not like that arrangement, then certainly neither did\nFisher\n.\nNeyman\ncame to work in Pearson's Department in\n1934\nand in that same year Pearson married Eileen Jolly, the daughter of a solicitor. Egon and Eileen Pearson had two daughters. Family commitments, further administrative duties and assuming the role of Managing Editor of\nBiometrika\non his father's death in\n1936\nall reduced the time that Pearson could devote to research. He had been awarded the\nWeldon\nprize and medal in\n1935\n, mainly for his work with\nNeyman\n, but despite having\nNeyman\nas a colleague, Pearson's efforts began to be directed towards revising his father's two volume work\nTables for Statisticians and Biometricians\n. He worked on this project with H O Hartley, but it was some considerable time before the revision was completed; volume\n1\nappeared in\n1954\nand volume\n2\nin\n1972\n. H A David\n[\n6\n]\nwrites:-\nWith their attractive layout, easy means for interpolation, and extensive, helpful introductory material, these tables have been widely recognised as models of their kind.\nThe advent of World War II in\n1939\nled to a shift in Pearson's work.\nNeyman\nhad already left London in\n1938\nfor a post in Berkeley and with the outbreak of war Pearson began to undertake war work for the Ordinance Board undertaking statistical analysis of the fragmentation of shells hitting aircraft and similar work. In fact, Pearson enjoyed this period:-\n... despite bombings, V\n1\nflying bombs, and V\n2\nrockets.\nIn\n1946\nhe was awarded a C.B.E. for his war service.\nPearson had found the years working in the same institution as\nFisher\nvery difficult.\nKarl Pearson\nhad attacked\nFisher\naggressively and had, in return, been attacked aggressively by\nFisher\n. Egon Pearson had a very different personality from his father and held\nFisher\n's work in high regard. However, even after\nKarl Pearson\ndied,\nFisher\nkept up his attack on him in print and Egon Pearson must have found it difficult to share a building with\nFisher\n. After\nFisher\nmoved away from London in\n1939\n, especially after he began to work at Cambridge from\n1943\n, Pearson must have found the atmosphere in London a much happier one.\nHe did suffer a great tragedy in\n1949\nhowever when his wife Eileen died of pneumonia. He continued to contribute greatly to statistics, however, retiring from University College in\n1961\n, and retiring as Managing Editor of\nBiometrika\nin\n1966\n. It was in this year that he was elected a Fellow of the\nRoyal Society\n, rather belatedly as some of his biographers have noted. In\n1967\nhe married Margaret Theodosia and moved to Cambridge until the death of his second wife in\n1975\nwhen he moved to West Lavington near Midhurst in Sussex.\nIn addition to the honours which we have mentioned above, Pearson was awarded the Gold Medal of the\nRoyal Statistical Society\nin\n1955\n. He was elected president of the Society in\n1955\n-\n56\n.\nA former student, then colleague, wrote in\n[\n1\n]\n:-\n... he was always an august, respected and indeed Edwardian, figure. It was only after many years as a junior colleague that one came to a fuller appreciation of his personal qualities. These were consonant with those so much in evidence in his published work: namely; clarity, combined with a studied simplicity, considered judgement and restraint, never pursuing conclusions further than the evidence warranted.\nHe is described in the\nDictionary of National Biography\nin the following terms:-\nPearson had a quiet disposition, but his shy and rather diffident manner hid an independent and pertinacious spirit which had enabled him to surmount both the controversies surrounding his father Karl and contemporaries like\nFisher\nand\nNeyman\n, and some health problems, such as his delicate health when an undergraduate, a heart condition of long standing, and occasional back trouble due to his considerable height.",
  "math_areas": [
    "Analysis",
    "Statistics"
  ]
}