{
  "nome_completo": "Eléna Wexler-Kreindler",
  "nome_curto": "Eléna Kreindler",
  "ano_nascimento": "1931",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wexler-Kreindler/",
  "lugar_nascimento": "Brăila, Romania",
  "lugar_morte": "Paris, France",
  "biografia": "Eléna Kreindler\n(\nperhaps better known by the name she adopted after her marriage\nEléna Wexler-Kreindler\n)\nwas the daughter of Oscar Kreindler, a professor of mathematics at the Polytechnic in Brăila. The family was Jewish. Eléna studied at the high school in Bucharest, graduating in\n1951\n. The quality of her work was outstanding and it led to her being awarded a fellowship to finace her university studies at the University of Sverdlovsk\n(\nnow Ekaterinburg or Yekaterinburg in Russia\n)\n. There she studied with P G Kantorovich and under his supervision she wrote an M.Sc. thesis\nMultiplicative lattices with additive basis\n.\nReturning from Ekaterinburg to Bucharest, Kreindler was appointed as an instructor at the Polytechnic Institute. Her first publication was\nOn principal ideals of lattices\n(1960)\n. Here is her own description of the contents of this paper:-\nWe propose to study the lattice L ideals of an algebraic system S, which satisfies the finite chain condition, in particular of an arbitrary lattice. It is known that the principal ideals of a lattice S form a sublattice L' of the lattice L of all its ideals. In the case of a lattice S of finite length L and L' coincide. Using the additive basis method, we characterize the class of the lattices S for which L and L' coincide. In particular we obtain for rings a result similar to that known in the theory of groups.\nKreindler's career developed and she was promoted to assistant professor at the Polytechnic Institute. Despite a heavy teaching load, she vigorously pursued her research. Further papers included\nSur un opérateur de dérivation dans les modules unitaires et dans les espaces vectoriels\nⓉ\n(\nOn a derivation operator in  unitary modules and vector spaces\n)\n(1965)\n,\nOpérateurs additifs dans les modules unitaires à base dénombrable\nⓉ\n(\nAdditive operators in unitary modules with a countable base\n)\n(1965)\n, and\nLe module des combinaisons différentielles linéaires à coefficients variables\nⓉ\n(\nThe module of linear differential combinations with variable coefficients\n)\n(1966)\n. For her work on functional analysis, carried out with\nG C Moisil\nas her supervisor, she was awarded a doctorate having submitted her thesis\nTheory of Pseudolinear operators\n. In\n1969\nshe was promoted to associate professor.\nKreindler marred Dinu Wexler who was a fellow mathematician and at this time she changed her name to Eléna Wexler-Kreindler. The two mathematicians left Bucharest in\n1972\nand Eléna had to begin her career again. She continued to publish with\nCatégories abéliennes avec objets principaux\nⓉ\n(\nAbelian categories with principal objects\n)\nappearing in\n1973\n. This paper, written now under the name Wexler-Kreindler, is described by her as follows:-\nThe object of this note is to include in the language of the theory of abelian categories some results known in the theory of modules over principal rings, in particular the theorem concerning the submodules of free modules over principal rings, as well as the theorem on the invariants factors of a submodule of finite type of a free module over a principal ring\n(\nnon-commutative\n)\n.\nThe overview of her research in France is given in\n[\n1\n]\n:-\nHer own research interests in Paris focused on some difficult problems in modern algebra, such as\nOre\n's extensions, the theory of filtered rings, or algebraic microlocalisation. She participated actively in both Mrs M-P Malliavin's regular algebra seminar and in the Lesieur-Renault seminar on noncommutative algebra. Most of these results were also presented in international workshops and conferences, and published in various scientific journals.\nTo give a single example let us mention her paper\nAnneaux filtrés complets et suites spectrales associées\nⓉ\n(\nComplete filtered rings and associated spectral sequences\n)\n(1982)\nwhich Wexler-Kreindler summarises as follows:-\nWe study certain homological properties of complete filtered rings by means that are closely related to their structure. This allows us to extend some of J E Björk's results\n[\nin Rings of differential operators\n(1979)]\nto other, non-Noetherian filtered rings as well as to filtered modules that are not of finite type.\nOn settling in Paris she worked first as an untenured assistant professor but eventually was appointed to a tenured position at the Pierre & Marie Curie University Paris VI. She was promoted to associate professor in\n1989\n, the year in which her husband Dinu Wexler died. In the following year she was granted the right to supervise graduate students but sadly she died in\n1992\nat the age of\n60\n.\nHer qualities as a teacher are emphasised in\n[\n1\n]\n:-\n... Eléna Wexler-Kreindler was an outstanding lecturer and had a great passion for teaching both graduate and undergraduate mathematics. She was always generous towards students with her time and devoted herself to making even the harshest matter accessible to the audience. Her lecture notes and collections of solved problems will remain a model of clarity and self-consistency.\nSince this quote emphasises her \"collections of solved problems\" we should mention that she published in collaboration with Marie José Bertin,\nAlgèbre commutative: exercices. Applications en géométrie et théorie des nombres\nⓉ\n(\nCommutative algebra: exercises. Applications in geometry and number theory\n)\nwhich is a companion volume to the text\nAlgèbre commutative\nⓉ\n(\nCommutative algebra\n)\nby M-P Malliavin.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory"
  ]
}