{
  "nome_completo": "Elias Menachem Stein",
  "nome_curto": "Elias Stein",
  "ano_nascimento": "1931",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stein/",
  "lugar_nascimento": "Antwerp, Belgium",
  "lugar_morte": "Somerville, New Jersey, USA",
  "biografia": "Elias Stein\n's parents, Elkan Stein and Chana Goldman, were Jewish which meant that the family were in severe difficulties as the Nazi influence spread across Europe. Elias was nine years old when the German armies invaded Belgium in May\n1940\n. In the following year the Stein family escaped from the Nazi controlled country and sailed to the United States. There they settled in New York and Elias attended Stuyvesant High School. This school, named after Peter Stuyvesant who was the\n17\nth\ncentury Dutch colonial governor of New York, had an excellent reputation. He graduated from the High School in\n1949\nand in the same year entered the University of Chicago to study mathematics. After the award of his bachelor's degree in\n1951\n, Stein remained at Chicago studying for his Master's degree. He was awarded an M.A. by Chicago in\n1953\nand undertook research for his doctorate with\nAntoni Zygmund\nas his thesis advisor. Stein was awarded a Ph.D. in\n1955\nfor his thesis\nLinear Operators on\nL\np\nL^{p}\nL\np\nSpaces\n.\nStein held an NSF Postdoctoral Fellowship during\n1955\n-\n56\nand was appointed as an Instructor in Mathematics at the Massachusetts Institute of Technology in\n1956\n. He held this position for two years during which time a whole series of his papers appeared in print:\nInterpolation of linear operators\n(1956)\n,\nFunctions of exponential type\n(1957)\n,\nInterpolation in polynomial classes and Markoff's inequality\n(1957)\n,\nNote on singular integrals\n(1957)\n,\n(\nwith G Weiss\n)\nOn the interpolation of analytic families of operators action on\nH\np\nH^{p}\nH\np\nspaces\n(1957)\n,\n(\nwith E H Ostrow\n)\nA generalization of lemmas of Marcinkiewicz and Fine with applications to singular integrals\n(1957)\n,\nA maximal function with applications to Fourier series\n(1958)\n,\n(\nwith G Weiss\n)\nFractional integrals on n-dimensional Euclidean space\n(1958)\n,\n(\nwith G Weiss\n)\nInterpolation of operators with change of measures\n(1958)\n,\nLocalization and summability of multiple Fourier series\n(1958)\n, and\nOn the functions of Littlewood-Paley, Luzin, Marcinkiewicz\n(1958)\n.\nIn\n1958\nStein returned to the University of Chicago where he was appointed as an Assistant Professor. In the following year, on\n21\nMarch\n1959\n, he married Elly Intrator; they had a son Jeremy\n(\nwho is now a professor of financial economics\n)\nand a daughter Karen. In\n1961\nStein was promoted to Associate Professor at Chicago. Awarded an NSF Senior Postdoctoral Fellowship for\n1962\n-\n63\nand an Alfred P Sloan Foundation Fellowship for\n1961\n-\n63\n, he spent\n1962\n-\n63\nat the Institute for Advanced Study at Princeton. He left his position in Chicago in\n1963\nwhen he was appointed as Professor of Mathematics at Princeton University. He has spent the rest of his career at Princeton where he was chairman of the Mathematics Department from\n1968\nto\n1971\nand again from\n1985\nto\n1987\n, having spent\n1984\n-\n85\nat the Institute for Advanced Study supported by a Guggenheim Fellowship. He is now the Albert Baldwin Dodd Professor of Mathematics at Princeton.\nLet us now give some indication of the remarkable contributions that Stein has made to harmonic analysis\n[\n4\n]\n:-\nElias Stein has shaped the field of mathematical analysis and has changed the way mathematicians approach problems in nearly every subarea of the field. He was among the first to appreciate the interplay among partial differential equations, classical\nFourier\nanalysis, several complex variables and\nrepresentation theory\n. He was the first to perceive the fundamental insights in each field arising from that interplay. Stein is the world's leading authority in harmonic analysis. Stein and colleagues introduced a generalization of analytic functions in higher dimensions known as\nH\np\nH^{p}\nH\np\n-spaces. This theory led to important connections between harmonic analysis and\nprobability theory\n, and facilitated the solution of numerous problems. In his studies, he also showed the power of using square functions to control error terms, a technique that he invented and that is now fundamental in harmonic analysis.\nTo gain some understanding of his work we look at some of the books he has written and the citations from some of the many awards he has been given for his leading contributions. He published two books in\n1970\n, one being\nTopics in harmonic analysis related to the Littlewood-Paley theory\n. Here are extracts from a review by R E Edwards:-\nConsiderable portions of the theory of\nFourier series\nand integrals are known to extend to various categories of topological groups. This book is concerned with one of the more elaborate and delicate extensions of this sort. In this case the starting point is aptly described as\nLittlewood\n-\nPaley\ntheory, and the extension goes even beyond the group case. ... The author is to be congratulated on presenting in moderate space and detail an illuminating and stimulating picture of a complex topic, the more so since it is garnished with comments on open problems and some quite explicit suggestions for further research.\nAlso in\n1970\nStein published\nSingular integrals and differentiability properties of functions\n. This book was based on a course\nIntégrales singulières et fonctions différentiables de plusieurs variables\nⓉ\n(\nSingular integrals and differentiable functions of several variables\n)\nwhich he had given at Orsay, Paris, in\n1966\n-\n67\n. The book was published by\nPrinceton University Press\nwho, over\n35\nyears later, described the work as follows:-\nSingular integrals are among the most interesting and important objects of study in analysis, one of the three main branches of mathematics. They deal with real and complex numbers and their functions. In this book, Princeton professor Elias Stein, a leading mathematical innovator as well as a gifted expositor, produced what has been called the most influential mathematics text in the last thirty-five years. One reason for its success as a text is its almost legendary presentation: Stein takes arcane material, previously understood only by specialists, and makes it accessible even to beginning graduate students. Readers have reflected that when you read this book, not only do you see that the greats of the past have done exciting work, but you also feel inspired that you can master the subject and contribute to it yourself. Singular integrals were known to only a few specialists when Stein's book was first published. Over time, however, the book has inspired a whole generation of researchers to apply its methods to a broad range of problems in many disciplines, including engineering, biology, and finance.\nIn\n1984\nStein was awarded the\nAmerican Mathematical Society\n's Leroy P Steele Prize for this book. This, however, was not the only Leroy P Steele Prize won by Stein for in\n2002\nhe received the Leroy P Steele Prize for Lifetime Achievement. The citation reads\n[\n1\n]\n:-\nDuring a scientific career that spans nearly half a century, Eli Stein has made fundamental contributions to different branches of analysis. In harmonic analysis, his Interpolation Theorem is a ubiquitous tool. His result about the relation between the\nFourier\ntransform and curvature revealed a deep and unsuspected property and has far reaching consequences. His work on Hardy spaces has transformed the subject. He has made important contributions to the representation theory of\nLie\ngroups as well. His work on several complex variables is equally striking. His explicit approximate solutions for the ∂-problems made it possible to prove sharp regularity results for solutions in strongly pseudoconvex domains. In this connection he also obtained subelliptic estimates which sharpened and quantified\nHörmander\n's hypoellipticity theorem for second order operators. Besides his contributions through his own research and excellent monographs, Stein has worked with and influenced many students, who have gone on to make profound contributions of their own.\nIn reply Stein said\n[\n1\n]\n:-\nFor more than a century there has been a significant and fruitful interaction between\nFourier\nanalysis, complex function theory, partial differential equations, real analysis, as well as ideas from other disciplines such as geometry and\nanalytic number theory\n, etc. That this is the case has become increasingly clear, and the efforts and developments involved have, if anything, accelerated in the last twenty or thirty years. Having reached this stage, we can be confident that we are far from the end of this enterprise and that many exciting and wonderful theorems still await our discovery.\nMany other major prizes have been awarded to Stein. He received the von Humboldt Award\n(1989\n-\n90)\n, the Schock Prize from the\nSwedish Academy of Sciences\nin\n1993\n, the Wolf Prize in\n1999\n, the United States National Medal of Science which was presented to him by President George Bush at a White House ceremony on\n13\nJune\n2002\n, and the\nStefan Bergman\nPrize in\n2005\n. We give a short quote from the citation for the last mentioned award\n[\n3\n]\n:-\nThe\nBergman\nprize is awarded to Elias M Stein in recognition of his work in real, complex, and harmonic analysis. Stein has made decisive contributions through his research, his expository efforts, and his training of graduate students. ... Stein's fusion of complex analysis, partial differential equations, analysis on nilpotent\nLie\ngroups, and Euclidean harmonic analysis has deeply influenced countless mathematicians. His ideas and techniques will continue to impact mathematics for years to come.\nIn\n2001\n, Princeton University awarded Stein its President's Award for Distinguished Teaching.\nLet us return to looking at the outstanding books Stein has published. In\n1971\nAnalytic continuation of group representations\nappeared based on a series of James Whittemore lectures that Stein had given at Yale University in November\n1967\n. Also in\n1971\n, in collaboration with Guido Weiss, Stein published\nIntroduction to Fourier analysis on Euclidean spaces\n.\nEdwin Hewitt\ndescribes the book as \"soundly conceived and brilliantly executed\", ending his review with the words:-\nThis is a splendid book, destined, one hopes, to further the study of concrete analysis and to inspire further advances.\nOther books by Stein include:\nBoundary behavior of holomorphic functions of several complex variables\n(1992)\n;\n(\nwith P C Greiner\n)\nEstimates for the ∂-Neumann problem\n(1977)\n;\n(\nwith Alexander Nagel\n)\nLectures on pseudodifferential operators: regularity theorems and applications to nonelliptic problems\n(1979)\n;\n(\nwith G B Folland\n)\nHardy spaces on homogeneous groups\n(1982)\n;\nHarmonic analysis: real-variable methods, orthogonality, and oscillatory integrals\n(1993)\nbased on the three Milliman Lectures he gave in\n1991\n-\n92\n; and\n(\nwith Rami Shakarchi\n)\nFourier analysis: An introduction\n(2003)\n. Reviewing this last mention text, Steven George Krantz writes:-\nE M Stein is certainly one of the great avatars and developers of\nFourier\nanalysis in modern times. R Shakarchi is a recent student of\nCharles Fefferman\n, so obviously is very well trained in the discipline. We are fortunate indeed that two such prominent exponents of one of the central parts of analysis have taken the time to write an instructional book of this kind. For this is not an entree to singular integrals, nor to pseudodifferential operators or paradifferential operators or wave front sets. It is instead a basic introduction to very classical topics of\nFourier\nanalysis. ... I look forward to reading and reviewing the next three books in this series\n(\nby the same authors\n)\n. One of the exciting features of this collection is that it establishes many non-obvious connections among different parts of analysis\n(\nreal analysis, complex analysis,\nFourier\nanalysis, and probability\n)\n. It will be instructive for student and mentor alike. This first volume is a terrific beginning, and promises to stand as a classic for many years to come.\nThe second in this three volume series\nComplex analysis\nwas published in\n2003\nand the third volume\nReal analysis: Measure theory, integration, and Hilbert spaces\nin\n2005\n. These texts also received rave reviews indicating they are all outstanding works written with remarkable clarity and care.\nIn addition to the prizes and awards we have mentioned above, Stein has been honoured with election to membership of the\nNational Academy of Sciences\n(1974)\nand the\nAmerican Academy of Arts and Sciences\n(1982)\n. He has received honorary degrees from Peking University\n(1988)\nand the University of Chicago\n(1992)\n.\nTwo of Stein's doctoral students,\nCharles Fefferman\nand\nTerence Tao\n, have won\nFields medals\n.\nFefferman\nsaid this of his thesis advisor\n[\n2\n]\n:-\nStein's work often combines two remarkable qualities: an understanding of several branches of math, each of which normally is known only by specialists, and an astonishing ability to find connections between them. Before Stein tells you his solution, the problems involved look utterly hopeless. It looks as if there is no connection. Then, with exactly the right point of view and exactly the right few words, one sees incredible insights that link everything together and make obvious things that would have appeared to be totally impossible. He has done things like this over and over again.\nStein's Princeton colleague Joseph Kohn said\n[\n2\n]\n:-\nStein is one of the foremost experts in harmonic analysis in the world, and he has made stellar contributions to this field as well as related fields such as the theory of several complex variables and partial differential equations. He has had many students and collaborators; he has had a profound influence on a generation of mathematicians.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}