{
  "nome_completo": "Eliakim Hastings Moore",
  "nome_curto": "Eliakim Moore",
  "ano_nascimento": "1862",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moore_Eliakim/",
  "lugar_nascimento": "Marietta, Ohio, USA",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Eliakim Moore\n's father was David Hastings Moore while his mother was Julia Sophia Carpenter. David Moore was a Methodist minister and he and his wife gave their son Eliakim an excellent education. As a child Eliakim played with Martha Morris Young and they would later marry. He attended Woodward High School from\n1876\nto\n1879\nand there he prepared for his studies at Yale University. It was at this time that he became interested in mathematics and this happened through a summer job which he took. One summer he worked as an assistant to Ormond Stone, who was the director of the Cincinnati Observatory, and from this time on Eliakim knew that he wanted to study mathematics and astronomy at university.\nIn\n1879\nMoore entered Yale University and took, as he had planned, courses in mathematics and astronomy. His interests became more clearly in the area of mathematics and he received his B.A. in\n1883\n. He remained at Yale to study for his Ph.D. under the supervision of Hubert Anson Newton. Moore's doctoral dissertation was entitled\nExtensions of Certain Theorems of Clifford and Cayley in the Geometry of n Dimensions\nand this led to the award of his doctorate in\n1885\n. Newton encouraged Moore to go to Europe for a year and helped to finance the trip. Moore spent the year in Germany, going first to Göttingen where he spent the summer of\n1885\nstudying the German language, but spending most of the academic year\n1885\n-\n86\nattending lectures by\nKronecker\nand\nWeierstrass\nat the University of Berlin. Parshall writes in\n[\n13\n]\n:-\nWhile direct influences of this German study tour on Moore's subsequent mathematical career are difficult to isolate, it is undeniable that Moore returned to the United States with a sense of the importance and desirability of the active and sustained pursuit of original research.\nIt is worth adding that American academics were really forced to train in Europe in Moore's day but when six years later he set up his research school in Chicago it provided for the first time the opportunity for American mathematicians to train in a research-intensive environment in the United States.\nOn his return to the United States, Moore was appointed as an instructor at Northwestern University for the year\n1886\n-\n87\n, then he spent two years as a mathematics tutor at Yale before spending the years\n1889\nto\n1892\nback at Northwestern University. During this second spell at Northwestern Moore was approached by William Rainey Harper and offered a post at Chautauqua in New York. Moore refused, knowing that this would mean taking up a post which involved a lot of low level teaching, while he wanted to concentrate on a research. Perhaps it was a fortunate episode since, a year later in\n1891\n, Harper was President-designate of the University of Chicago and wanted to staff the mathematics department with research active staff. Now he could offer Moore the post he wanted to satisfy his research ambitions and Moore quickly accepted.\nMoore was appointed professor and acting head of the mathematics department at Chicago when the university first opened in\n1892\n. Prior to this he had married Martha Morris Young on\n21\nJune\n1893\nin Columbus, Ohio; they had been friends from their childhood days. The Moores had two sons, only one of whom reached adulthood. In\n1896\nMoore became head of the mathematics department at Chicago, a post he retained until\n1931\n.\nWhen he was appointed at Chicago, Moore persuaded the university authorities to appoint two young German mathematicians\nBolza\nand\nMaschke\nto his department. Archibald, in\n[\n3\n]\n, describes this Chicago mathematics team:-\nThese three men supplemented one another remarkably. Moore was a fiery enthusiast, brilliant, and keenly interested in the popular mathematical research movements of the day;\nBolza\n, a product of the meticulous German school of analysis led by\nWeierstrass\n, was an able, and widely read research scholar;\nMaschke\nwas more deliberate than the other two, sagacious, brilliant in research, and a most delightful lecturer in geometry. During the period\n1892\n-\n1908\nthe University of Chicago was unsurpassed in America as an institution for the study of higher mathematics.\nAmong Moore's Ph.D. students at Chicago were\nDickson\n,\nVeblen\n,\nAnna Pell Wheeler\nand\nG D Birkhoff\n. Although\nRobert Moore\nhad\nVeblen\nas his supervisor in Chicago he worked with, and was strongly influenced by, Eliakim Moore.\nMoore's first main areas of research, which he studied from about\n1892\nto\n1900\n, were algebra and\ngroups\nwhere he proved in\n1893\nthat every finite field is a\nGalois\nfield. He also studied infinite series of finite\nsimple groups\n.\nIn his work on the foundations of geometry begun around\n1900\nMoore examined the independence of\nHilbert\n's axioms. He reformulated these in terms of points as the only undefined quantities, rather than points, lines and planes as\nHilbert\nhad done. His\n1902\npaper\nOn the projective axioms of geometry\nshowed that\nHilbert\n's axiom system contained redundant axioms.\nIn\n[\n1\n]\nMoore is described as follows:-\nAlthough a gentle man, he sometimes displayed impatience as he strove for excellence in his classes.\nParshall in\n[\n13\n]\nwrites in a similar vein:-\nMoore's style of teaching - characterised by a quick-paced presentation of new research ideas and what could be stinging impatience with those who failed to follow - certainly proved effective, at least for the most talented. Moore was a man of high intellectual and academic standards; he expected much from himself, his students, and his colleagues.\nThe third interest that Moore took up after\n1906\nwas on the foundations of analysis\n[\n1\n]\n:-\nHe brought to culmination the study of improper integrals before the appearance of the more effective integration theories of\nBorel\nand\nLebesgue\n. He diligently advanced general analysis, which for him meant the development of a theory of classes of functions on a general range. ... Throughout his work in general analysis, Moore stressed fundamentals, as he sought to strengthen the foundations of mathematics.\nMoore brought precision and rigour to all the fields he studied. Other topics he worked on include\nalgebraic geometry\n,\nnumber theory\nand\nintegral equations\n.\nIn\n1893\nMoore was one of the main organisers of the first international mathematical congress to be held in the United States. He then approached the\nNew York Mathematical Society\nwith a view to publishing the Proceedings of the congress. In the process he persuaded this society to take a more national role and to change their name to the\nAmerican Mathematical Society\n. Setting up a Chicago branch of the Society, which he led, Moore helped in the having the Society reach across the United States. He became a strong supporter of the\nAmerican Mathematical Society\nbeing Vice-President from\n1898\nto\n1900\n, President from\n1901\nto\n1902\nand Colloquium Lecturer in\n1906\n. He acted as an editor of the\nTransactions of the American Mathematical Society\nfrom\n1899\nto\n1907\n.\nIn\n[\n3\n]\nhis contribution is summed up as follows:-\nMoore was an extraordinary genius, vivid, imaginative, sympathetic, foremost leader in freeing American mathematicians from dependence on foreign universities, and in building up a vigorous American School, drawing unto itself workers from all parts of the world.\nMoore received many honours from around the world for his contributions. He was elected to the\nNational Academy of Sciences\n, the\nAmerican Academy of Arts and Sciences\n, and the American Philosophical Society. He received honorary degrees from Göttingen, Yale, Clark, Toronto, Kansas, and Northwestern.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}