{
  "nome_completo": "Elizaveta Fedorovna Litvinova",
  "nome_curto": "Elizaveta Litvinova",
  "ano_nascimento": "1845",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Litvinova/",
  "lugar_nascimento": "Tula, Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Elizaveta Litvinova\nwas born on\n21\nSeptember\n1845\n, the date of the Julian calendar which operated in Russia at that time, but the date is\n3\nOctober\n1845\nif we convert it to the Gregorian calendar which was operating in most of Europe at this time.\nAlthough she seems always to be known as Elizaveta Fedorovna Litvinova, this was her married name. She was given the name Elizaveta Fedorovna Ivashkina when she was born into an affluent landowning family in Tula, Russia, a city about\n200\nkm due south of Moscow. We know little about her family and early life, but we do know that her father was Fedor Alekseevich Ivashkin and Elizaveta had at least one sister. She was fortunate to be educated in the Mariinskaya Women's Gymnasium in St Petersburg starting her studies there at the age of thirteen. We must not give a false impression here by suggesting that the Mariinskaya Women's Gymnasium gave Elizaveta a good education. It was just that the education was better than most women's schools, where girls were only taught to sew and to dress well, and at the Mariinskaya she was taught by some competent teachers, although at a much lower level than boys would be taught in Russia at this time.\nIn St Petersburg at this time there were many taking up the new nihilist views. These early nihilists did not hold the extreme views of later nihilists who basically became terrorists advocating destruction. Rather they only rejected authority, particularly of the church and state. They believed in individual freedom, education\n(\nparticularly a science education\n)\nas a way to progress, and equality for all, including women. They believed that women had the right, even the duty, to achieve an education and a career. Elizaveta was attracted to these beliefs, which were even held by a few of the teachers at the Mariinskaya Women's Gymnasium.\nThese early nihilists formed discussion groups which Elizaveta joined. They believed that their radical views were the only way to improve society, and soon Elizaveta was writing radical poetry. She certainly wanted to continue her education but this was not an easy thing to do. Her parents strongly opposed her wishes for further education, Russian universities did not admit women, and anyway her education at the Mariinskaya Women's Gymnasium, although better that that given to most Russian women, was nevertheless at far too low a standard to begin university studies. There was a strong belief among the women, however, that universities would soon allow women to enter so they tried to gain sufficient knowledge so they would be properly prepared. There were sympathetic professors who were prepared to provide classes for women, usually held in the homes of well-off supporters. Elizaveta attended these classes but realised how poorly prepared the students were. She wrote\n(\nsee for example\n[\n4\n]\n)\n:-\nQuick success in our studies gave us joy. But solving a problem that would have been easy for a pupil of the fifth class of a boy's Gymnasium made us realise how far we still were from the study of real science.\nIn\n1866\nElizaveta was taking private lessons in St Petersburg with Aleksandr Nikolayevich Strannoliubskii\n(1839\n-\n1903)\n, who had taught\nSofia Kovalevskaya\n. Strannoliubskii was a good mathematician, an excellent tutor, and a supporter of higher education for women. In the same year she married Dr Viktor Litvinov who was happy for his wife to continue her studies with Strannoliubskii. In\n1867\nshe was one of four hundred signatures to a petition to Tsar Alexander II requesting permission to open the first higher education courses for women at St Petersburg State University. It was not favourably received.\nIn\n1869\nSofia Kovalevskaya\ntravelled to Heidelberg with her husband and began attending classes in mathematics at the University. Strannoliubskii was proud of his former pupil and was keen to tell his current students about her success. He advised Litvinova to continue her studies abroad and she was keen to do so. To obtain a passport to travel, however, she had to have the permission of her husband and he refused to give his permission telling her in no uncertain terms that she could continue to study in St Petersburg but on no account would she be allowed to travel abroad. Litvinova continued to study with Strannoliubskii and by\n1870\nacquired a certificate of competency which allowed her to study at university. It was worthless, however, since women could not attend Russian universities and her husband did not allow her to travel abroad.\nLitvinova's marriage seems hard to understand.\nSofia Kovalevskaya\nmarried solely to be able to travel abroad and, at this stage, treated her husband as a \"brother\". Litvinova certainly did not marry to be allowed to travel abroad, but it is unclear why she married since she seems to have had no affection for her husband, only seeing him as an obstacle to her further education. In\n1872\n\"fate itself\", to quote her words, came to her rescue for in that year Dr Viktor Litvinov died and she was free to travel. Many of the Russian women she had known had travelled to Zurich for higher education and been successful there so Litvinova decided to take that option.\nMost of the Russian women studying in Zurich were attending courses at the University but Litvinova chose to study at the Eidgenössische Technische Hochschule. Ann Hibner Koblitz writes in\n[\n6\n]\nabout the experiences of the Russian women in Zurich:-\nLife in Zurich was wonderfully exciting and intellectually stimulating for Litvinova and the other Russian women, but there were many problems. As always, financial difficulties loomed in the students' minds. They tried to minimise these by banding into lodging, eating, and studying cooperatives. Some of the poorer ones are even reputed to have shared winter coats and shoes; they arranged their class schedules so that only one of them had to be outside at any time!\nAnother problem was the attitude of the Swiss citizens toward the Russian women. The Swiss could not understand the eager desire of the Russians for education, especially for education in such \"unfeminine\" fields as the natural sciences and medicine. Moreover, the Swiss disliked the politics of the majority of the Russian students. The fact that most of them seemed to spend any time they had left over from their studies discussing the form of the revolution to come could not win favour with the bulk of the Swiss burghers. In addition, the comradely, casual relations of the Russian women with their student countrymen scandalised the Swiss. For them, the Russians' tendency to talk in each others' lodgings late into the night, go about in mixed sex groups, and treat each other with informality meant that the Russian women were little better than prostitutes. The women consequently found it difficult to obtain rooms, and they were discriminated against in the shops and markets as well.\nLitvinova's lot was even harder than most. She chose to pursue her studies at the Polytechnic Institute rather than the university, where there were far more women students. In many of her lectures she was the one woman in a class of\n150\n, and she was afraid to raise her eyes or look in anyone's direction too long for fear they would get the wrong impression of her.\n(\nSince the Swiss had such prejudices against the Russian women, it was fatally easy to give them \"the wrong impression.\"\n)\nLitvinova's lecturers, Édouard Armand Méquet\n(1821\n-\n1897)\nand\nHermann Schwarz\n, were, however, very sympathetic and helpful to her.\nHermann Schwarz\n, in particular, went out of his way by giving Litvinova private lessons in his home and one summer he repeated a course of lectures, which he had delivered to a class before she arrived, for her alone. He made every effort, inviting her for tea and also to spend evenings with his family. While Litvinova was in Zurich,\nSofia Kovalevskaya\n, who was undertaking research in Berlin at this time, visited Zurich. Litvinova writes that at this time\nKovalevskaya\nwas worried that the news that\nKarl Weierstrass\nwould become rector of Berlin was making her think he might not have time to supervise her studies and she thought she might have to switch to\nHermann Schwarz\n.\nRussia was, at this time, ruled by the tsar Alexander II. He feared that students studying in foreign lands might be plotting a revolution, and in June\n1873\nhe produced a decree requiring all Russian students to return to Russia. They were given until the end of\n1873\nby which time they were required to be back in Russia. The decree did hold out the prospect that higher education would soon be opened to women in Russia and threatened to bar those who did not return from future careers as civil servants. Most of the students obeyed the decree and returned but Litvinova, encouraged to stay by\nHermann Schwarz\n, was one of only a handful who disobeyed and she continued with her studies. She was awarded a baccalaureate by Zurich in\n1876\nand decided to continue studying for a doctorate in Bern.\nHermann Schwarz\nhad left Zurich in\n1875\nwhen he was appointed to the chair of mathematics at Göttingen University. Litvinova went to Bern where her research advisor was\nLudwig Schläfli\n. She was awarded a doctorate \"summa cum laude\" by Bern in\n1878\nfor her thesis\nLösung einer abbildungsaufgabe\nⓉ\n(\nSolution of a mapping problem\n)\n.\nThe published version of the thesis, written in German and dated\n1879\n, states:-\nInaugural Dissertation for obtaining the Doctorate of Philosophy submitted to the Higher Philosophy Faculty of the University of Bern by Elisabetha von Litwinowa-Iwaschkina from Tula in Russia.\nIt has the following dedication:-\nDedicated in gratitude to my esteemed teachers Professor Dr\nSchläfli\nin Bern, and Professor Dr\nH A Schwarz\nin Göttingen.\nThe thesis begins:-\nIn this thesis I try to give the solution to a mapping problem. This was given to me by Dr\nH A Schwarz\n, professor in Göttingen, and it is expressed as follows:\nA curve is given of such a nature that the product of the distances between its points and two fixed points, the so-called foci, should be constant. It is required to map the two pieces of the surface bounded by this curve conformally, i.e. similar in their smallest parts, onto a simple circular surface.\nLitvinova returned to St Petersburg in\n1878\nwith a baccalaureate, a doctorate and a certificate qualifying her to teach in boys' gymnasia. The authorities, however, were not going to relent on the threats made in the decree she disobeyed. She was not allowed to sit the Russian examinations to qualify her to teach higher grades in schools or teach in universities. Any state institution was forbidden from hiring her.\nIn fact the Russian authorities kept their word about allowing higher education for women and the Women's Higher Education Institution\n(\nBestuzhev Courses\n)\nopened in St Petersburg on\n20\nSeptember\n1878\n. This private school was only given approval reluctantly by the government. Several women who had been awarded a baccalaureate from Zurich became teachers at the Institution but despite Litvinova wishing to teach there and being best qualified, she was not appointed. She was not going to be forgiven for failing to obey the decree to return to Russia from Zurich\n[\n5\n]\n:-\nLitvinova was forced to accept a post as a teacher in the lower classes of a women's academy. She was paid by the hour and did not have the rights to pension and vacations of a licensed teacher. Nine years later, after repeated pleas by her and her superiors, she became\n[\nin\n1887]\nthe first woman in Russia permitted by the Ministry of Education to teach mathematics in the upper division of the gymnasium\n(\nalthough she was still not granted the rights and privileges of male teachers of her rank\n)\n.\nShe was, however, an outstanding teacher and Lenin's wife, who was one of her pupils at the Princess A A Obolenskaya Gymnasium, wrote:-\nLitvinova not only taught her students the usual mathematical rules and theorems. She also used mathematics to teach her pupils how to think logically, how to make generalisations, how to extract principles and laws from a series of individual cases.\nThe Princess A A Obolenskaya Gymnasium had opened in November\n1870\nand Aleksandr Nikolayevich Strannoliubskii, who had taught Litvinova before she left for Zurich, had been a mathematics teacher there in the\n1870\ns and developed the curriculum.\nSince she was hardly paid enough to live on, Litvinova was forced to find other ways to earn some extra money. She did this by writing biographies of mathematicians and philosophers; for example, of\nAristotle\n,\nJean Antoine de Condorcet\n,\nJean d'Alembert\n,\nLeonhard Euler\n,\nSofia Kovalevskaya\n,\nPierre-Simon Laplace\nand\nNikolai Ivanovich Lobachevsky\n. Litvinova's biography of\nSofia Kovalevskaya\nis particularly interesting in that it gives us some information about how Litvinova felt regarding her own situation. She wrote of\nKovalevskaya\n's attitude to setting herself unattainable goals:-\nSuch an attitude toward herself explains a great deal about her career. ... Like all the prejudices we must struggle against, the prejudice against the ability of women to do intellectual work exists not only in those around us, but also in ourselves. ... It would never occur to the most mediocre man that he was not sufficiently prepared to carry out the duties of a lecturer.\nWriting about\nKovalevskaya\n's decision to to have a 'fictitious' marriage, Litvinova states:-\nYou don't have to be a genius to understand that, but you do have to be a Russian.\nShe wrote articles contrasting \"rulers\" and \"thinkers\" and around\n70\narticles on teaching mathematics which advocated a modern approach.\nShe also wrote articles for the\nBulletin de l'Union universelle des Femmes\nwhich encouraged women's organisations to unify to create national federations. She was one of four Russian delegates at the International Women's Congress in Brussels in\n1897\n:-\nThe international group focused on five major themes: women's civic rights; the nature of patriarchy; women's economic rights; the status of the feminist movement; and women and public charity.\nLitvinova became a member of the\nSt Petersburg Mathematical Society\nin\n1897\n, and in\n1901\nshe became a member of the St Petersburg Philosophical Society. In\n1911\nshe was sent to France and Germany to learn about their methods of teaching geometry in secondary schools.\nAfter Litvinova retired in\n1917\n, she went to live with her sister in the countryside outside St Petersburg. In\n1919\nthere was a major famine in Russia which, over the following three years, saw the deaths of up to\n5\nmillion people. It is believed that Litvinova must have died in the famine for certainly there is no trace of her after this. No accurate date for her death is ever likely to be found.\nJ Harvey and M Ogilvie write in\n[\n9\n]\n:-\nIn a sense, Litvinova's career as an original mathematician was nipped in the bud by the penalties that arose from defying the Tsar's decree. However, even under difficult circumstances, her influence made itself felt. Litvinova's contribution to mathematics was twofold: as a proponent of advanced pedagogical methods and an inspiration to her students, some of whom went on to become scientists, and as a disseminator of information about cultural, social, and other issues, which, in an era of heavy censorship, she introduced into her biographical works.",
  "math_areas": [
    "Geometry"
  ]
}