{
  "nome_completo": "Elizabeth Leonard Scott",
  "nome_curto": "Elizabeth Scott",
  "ano_nascimento": "1917",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scott_Elizabeth/",
  "lugar_nascimento": "Fort Sill, Oklahoma, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Elizabeth Scott\nwas born in Fort Sill, Oklahoma where, her father was stationed during World War I. When she was four years old Scott's father retired and the family moved to Berkeley, California, where she lived for the rest of her life. In Berkeley the family were close to the university where her father enrolled on a Law degree, and Scott's life quickly became centred round the University. When she was old enough, Scott entered the university high school located in Oakland only four miles south of Berkeley. The school operated an automatic admissions policy to all children living in the immediate local area, the result of which was a school with a racially and academically balanced population. The well-funded school placed much emphasis on the training of student teachers and preparing its students for entry into college. As the only girl enrolled in the advanced mathematics courses, Scott quickly stood out as exceptional among the student body and, even at such a young age, was already considering a career in astronomy. However she soon discovered\n[\n1\n]\n:-\nIt was a profession not quite ready to welcome women.\nIn\n1935\nthe Great Depression was still rife in America. In California, Scott's family, like most others, struggled financially at a time when she was completing high school and preparing to enter university. The University of Berkeley was the logical choice for Scott as the tuition fees were low and she could save the family money by living at home. She enrolled in Berkeley's astronomy programme and soon work became her top priority. Extra-curricular and social activities were pushed aside as she concentrated on her academic studies.\nDuring her time as an undergraduate Scott had no female professors except in physical education. There were times, however, when women would substitute for absent permanent staff and it was on one of these occasions that Elizabeth met one of only two women in the mathematics department,\nPauline Sperry\n. Later when she was a graduate student at Berkeley, Scott, with a few other female graduate students, was invited by\nSperry\nto attend lunch at the Women's Faculty Club. Scott later became a life long active member of the Club after joining the faculty at Berkeley and developing an interest in women's issues that would encompass much of her later work.\nIn\n1939\nScott had her first paper published at the age of only\n22\n. This paper, along with twelve subsequent ones published between\n1930\nand\n1946\n, was concerned with studying comets. The papers mostly consisted of lists of elements and tables giving the future positions of a comet during the course of a year. Scott continued to write about a range of topics in astronomy throughout the rest of her lifetime. She received her Ph.D. in\n1949\nwith a dissertation in two parts written under the supervision of Donald Trumpler. Part I was on\nContribution to the problem of Selective Identifiability of spectroscopic Binaries\nand Part II was on\nNote on Consistent Estimates of the Linear Structural Relation Between Two Variables\n.\nEven during World War II there were very few female graduate students in the United States and still fewer female mathematicians. There was a noticeably greater number of women in astronomy but even there they faced harsh discrimination. Explicitly forbidden to use the telescopes at Mount Wilson, where all of the large instruments in the state were housed, the only role a woman could have realistically hoped to achieve was that of assistant to one of the male staff members. Despite having a supportive Head of Department who arranged summer assistantships for her at the Lick Observatory where she was allowed to use the telescopes, Scott became increasingly convinced that those who had urged her not to pursue a Ph.D. were right. They had argued that it would make her wildly overqualified for any position she could expect to attain in astronomy. As a result she decided to concentrate on mathematical studies and she was appointed as assistant professor in the department of mathematics at Berkeley  in\n1951\n. She worked at Berkeley for the rest of her career, serving as Chair of the Statistics Department from\n1968\nto\n1973\n.\nDuring her graduate career she had decided to give up the astronomy assistantship in order to work on a war related project with the then head of statistics\nJerzy Neyman\n. The move led to her developing a fascination with statistics which greatly altered the course of Scott's career.\nScott decided to combine her two interests and use statistical tools in order to answer questions in astronomy. The first paper she wrote using that strategy, published in\n1949\n, was\nDistribution of the longitude of periastron of spectroscopic binaries\n. It examined the distribution of\n78\neclipsing and\n341\nnon-eclipsing binary star systems according to the eccentricity e of the orbit and the longitude of periastron\n[\nthe periastron of a binary star system is the point in its orbital motion when the two stars are closest together\n]\n. The resulting analysis showed that for most categories of binaries the distribution is not uniform. One particularly interesting result showed, with a probability of error less than\n0\n.\n02\n, that when e is greater than\n0\n.\n12\n, the distribution of values of the periastron among eclipsing star systems is different from that among the non-eclipsing systems. The paper pointed out that:-\nIt seems inconceivable that the distribution of the true longitude of periastron could depend on whether or not the sun happens to lie in the plane of the orbit.\nSubsequently Scott became involved in a long-range study being carried out by the famous astronomer and director of the Lick Observatory Charles D Shane who wanted to know if there existed any statistical laws that could explain the apparent phenomena of what he termed the 'lumpy' nature of the distribution of galaxies. Scott went on to publish over ten articles on this subject up to\n1960\n, some in collaboration with Jerzy Neyman and with Charles Shane. Later papers extended the investigations to more than two regions in space. In\n1958\n, in collaboration with\nJerzy Neyman\n, Scott presented a major paper\nStatistical approach to the problems of cosmology\nto the\nRoyal Statistical Society\nin London highlighting a succession of studies which attempted to build a stochastic theory of the distribution of galaxies in space. The authors write:-\nThe purpose of the present paper is to suggest that a considerable advance in cosmological studies may be expected if the deterministic approach is abandoned and replaced by a statistical indeterministic approach.\nUp to this time, the mathematical models on which theories were based had not explicitly included any chance mechanism. Scott and\nNeyman\n's main thesis on the logical place of statistical assumptions in cosmology was widely welcomed within the mathematical community as\n(\nin W H McCrea words\n)\n:-\n... having a very healthy and stimulating effect on the study of cosmology.\nDuring the\n1960\n's and\n70\n's the core focus of Elizabeth Scott's research turned to weather modification, mainly investigating experiments on rain stimulation by cloud seeding. Scott's first contact with this topic had been as early as\n1951\nand her involvement ran concurrently with her studies in astronomy through the\n1950\n's and early\n60\n's. The majority of Scott's work was in statistical analysis of the data from well-known studies in meteorology such as the Santa Barbara experiment from\n1957\nto\n1959\n, the\n1957\n-\n1963\nGrossversuch III experiment, and the\n1960\n-\n1964\nWhitetop experiment. By\n1960\nboth Scott and\nNeyman\nhad become disillusioned with the idea of weather modification but then they became acquainted with the Swiss hail suppression experiment Grossversuch III carried out between\n1957\nand\n1963\n. They wrote in\nStatistical aspects of rain stimulation: Problems and prospects\n(1970)\n:-\nThis excellent experiment indicated to us that, after all, there is something reasonable in the prospect of being able to stimulate rain by cloud seeding.\nHowever, scientists in general were sceptical about weather modification and in\n1965\na special session of the Berkeley Symposium was dedicated to the assembly and evaluation of factual material relating to weather modification from a number of different countries. By\n1970\n, based on evidence from Grossversuch III and the Whitetop experiment, it seemed possible that seeding could modify weather. Scott produced over twenty papers on cloud seeding, nearly all with Jerzy\nNeyman\nand the rest of the Berkeley group. From these statistical studies of rain stimulation, both reached the conclusion that\n(\nexpressed in the\n1970\npaper above\n)\n:-\n... cloud seeding can cause both large increases and disastrous decreases in precipitation\n(\nWhitetop\n)\n, both over unexpectedly large areas.\nScott continued her research into the applications of weather modification\n(\nand various other sciences\n)\nfor the rest of her life. However, from the mid\n1970\n's onwards, a great deal of the work she was involved with concerned problem solving.\nOne of Elizabeth Scott's greatest contributions came from her service as a charter member of the committee on National Statistics of the National Research Council,\nNational Academy of Sciences\n. M L Straf writes that in the view of her colleagues\n(\nsee\n[\n1\n]\n)\n:-\nBetty's broad interests and experience in applications of statistics were a great asset to the committee in its early days, as the committee sought to develop a program of studies and establish itself as a resource to the federal statistical system and other government agencies. The committee needed members like Betty, with her broad knowledge, indefatigable energy, and, most of all, perseverance.\nIt was at the request of a separate academy committee, which had become concerned with the environmental effects of supersonic planes, that Scott became involved in reconciling the conflicting and fragmentary evidence relating to the possible increase in skin cancer. She volunteered to chair a panel which included an atmospheric physicist, a photo biologist, a dermatologist, an epidemiologist and another statistician to investigate the issue. M L Straf writes\n(\nsee\n[\n1\n]\n)\n:-\nIt was one of Betty's strengths that she could bring together so many different types of scientists, understand their language and points of view.\nThrowing herself into the problem, Scott hunted down all kinds of ambiguous, incomplete data. To the surprise of those around her it fell into place, and Elizabeth was now faced with the seemingly insurmountable task of predicting by how much skin cancer would increase by taking into account the myriad of intervening factors\n[\n1\n]\n:-\nThe question became not whether, but rather to what extent.\nIn\n1970\nElizabeth co-chaired a subcommittee of the Berkeley Senate which published a\n78\n-page comprehensive study of the status of women in academia. It examined not only salary and benefits but also hiring, promotion and tenure, research opportunities and committee appointments. The report also provided information on issues of concern to students including admissions, financial support and graduation rates. Considerable disparities in treatment were documented and Scott promptly turned her attention to finding remedies. What Scott was doing here was unique. While most faculty women spent their time simply turning out evidence that they were paid less than their male counterparts, Scott was collaborating in studies, employing multiple regressions, that soon were used by universities in making salary adjustments and came to be widely accepted as evidence in lawsuits. Her work on this topic earned Scott a reputation as a pioneer in applying statistical methods to research on the status of academic women\n[\n1\n]\n:-\nHelping women to obtain equal access and equal rewards remained one of her goals not only as a researcher but also as a mentor and colleague.\nPublished in\n1981\n, Scott's paper\n(\nwritten with N C Ahern\n)\nCareer outcomes in a matched sample of men and women Ph.D.'s : An analytical report\nanalysed career outcomes based on a sample survey of about\n50\n,\n000\nPh.D.'s\n(\nnot just mathematicians but also scientists, engineers and humanists\n)\nconducted in\n1979\nby the National Research Council. They examined\n5164\ngroups each consisting of one woman and two men who were matched as nearly as possible according to selected background characteristics which included age, years of prior experience at award of doctorate, support during graduate studies, marital status, employment status, promotions, salary, and academic rank and tenure. Designed to determine whether there was a trend in the discrepancy between the career patterns during the previous decade, the study provided data on sex-related barriers in each major field to the advancement of women for subgroups of the triads who obtained doctorates in each of the following periods\n1940\n-\n1959\n,\n1960\n-\n1974\nand\n1975\n-\n1978\n.\nThe following facts emerged from the survey:\n(1)\neven for most recent Ph.D.'s, involuntary unemployment is two-and-a-half times higher for women than for men;\n(2)\nsex differentials are large and pervasive in faculty status, tenure status, faculty appointments, and promotions; and\n(3)\nsignificant sex-related salary differentials still exist at all levels and types of institutions.\nDespite the recognition she received for her successful studies, Scott's fight for equality in the academic world was not completely limited to her research, indeed\n[\n1\n]\n:-\nScott was never reluctant to give of her time and energy, or to get involved in a controversial cause.\nScott's last professional presentation was the keynote address at a workshop for young women researchers in August\n1988\n, just four months before her death. Nancy Flournoy was at that workshop\n[\n3\n]\n:-\nMy recent interaction with Betty was tremendously profound. It moved me and all the others in her presence. It was the night before the IMS meeting last summer\n[1988]\nin Fort Collins, Colorado. Lynne Billard had organized a workshop for young women in academic statistics which I helped to fund during my tenure at the National Science Foundation. Mary Ellen Bock, Lynne Billard, Yash Mittal and I had intensely debated the value of such a workshop. There was a concern that it would generate a negative reaction among the men in the community. But the beneficial aspects won and the conference came to be. It was a most moving experience for me, and a great deal of credit for its tremendous success is directly due to Betty. There are currently\n15\nwomen statisticians at the outset of their careers who have been deeply influenced by her and by this conference\nScott received many honours throughout her career. We mention some of the positions she has held: Vice President, American Association for the Advancement of Science, and Chair of the Section on Statistics,\n1970\n-\n1971\n; Member of Committee on National Statistics,\nNational Academy of Sciences\n,\n1971\n-\n1977\n; Member of Executive Committee, Caucus for Women in Statistics,\n1972\n-\n1973\nand\n1979\n-\n1980\n; Member of the board of Scientific Counsellors, National Institute of Environmental Health Sciences,\n1973\n-\n1976\n; President, Institute of Mathematical Statistics,\n1977\n-\n1978\n; Member of committee on Education and Employment of women in Science and Engineering,\nNational Academy of Sciences\n,\n1977\n-\n1983\n; Member, Science Indicators Review Task Force, National Science Foundation,\n1977\n-\n1982\n;  Outstanding Statistician of the Year Award,\nAmerican Statistical Association\n, Chicago Chapter,\n1980\n; Honorary Fellow of the\nRoyal Statistical Society\n,\n1981\n; Vice President, International Statistical Institute,\n1981\n-\n1983\n; President, Bernoulli Society for Mathematical Statistics and Probability, International Statistical Institute,\n1983\n-\n1984\n.\nIn\n1992\nthe Committee of Presidents of Statistical Societies established The Elizabeth Scott Award, to be presented every two years at the Joint Statistical Meetings. The description of the award reads:-\nIn recognition of Elizabeth L Scott's lifelong efforts in the furtherance of the careers of women, this award is granted to an individual who has helped foster opportunities in statistics for women by developing programs to encourage women to seek careers in statistics; by consistently and successfully mentoring women students or new researchers; by working to identify gender-based inequities in employment; or by serving in a variety of capacities as a role model. This award, first awarded in\n1992\n, is given every other year in even years, and consists of a plaque and a cash award.\nThe first recipient was\nFlorence Nightingale David\n, the author of\n[\n2\n]\n. Nancy Flournoy, the author of\n[\n3\n]\n, was the winner of the Elizabeth Scott award in\n2000\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Statistics"
  ]
}