{
  "nome_completo": "Elon Lages Lima",
  "nome_curto": "Elon Lima",
  "ano_nascimento": "1929",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lima/",
  "lugar_nascimento": "Maceió, Alagoas, Brazil",
  "lugar_morte": "Rio de Janeiro, Brazil",
  "biografia": "Elon Lima\nwas the son of Manoel de Albuquerque Lima\n(1883\n-\n1970)\nand Adelaide Lages\n(1889\n-\n1960)\n. We note that Manoel, Elon's father, is sometimes known as Manuel. He\n[\n24\n]\n:-\n... was a merchant; he had a grocery store that sold everything: from bread to shaving equipment, from wine to bananas.\nElon's mother, Adelaide, was a housewife. Elon was brought up in Maceió, a coastal city and capital of the State of Alagoas. He had a sister who was two years older than him and who played an important part in his development. He attended the Colégio Batista Alagoano which had been founded in\n1922\nand approved by the Baptist Church. At this time he was a friend of Manfredo Perdigão do Carmo\n(1928\n-\n2018)\nwho would later become his colleague at the Institute of Pure and Applied Mathematics in Rio de Janeiro. Elon said that Manfredo, who attended a Marist brothers school in Maceió, was the intellectual of their group of friends. Elon played ball, swam, and played button football while Manfredo drew. At the Colégio Batista Alagoano, Elon was taught mathematics by Benedito de Morais who, according to Elon, was never a great mathematician but was an exceptional teacher.\nLima spent two years at the Colégio Estadual in Maceió, where he took the scientific course together with his friend Manfredo do Carmo. Since there was no higher education, other than a Law school with did not interest him, in Maceió he decided to join the Army and, when seventeen, entered the Escola de Cadetes in Fortaleza. His time at this school, however, did not go well. The physics teacher kept making mistakes and Lima always corrected him. The physics teacher was not pleased at being corrected by a pupil and told Lima to leave the Escola de Cadetes as soon as possible. He left after a year but did receive a reservist certificate. Ari de Sá Cavalcante, who taught Lima at the Escola de Cadetes, had taken over the management of Ginásio Farias Brito, in Fortaleza, in\n1941\n, where he was also a teacher. He was delighted to have Lima teach at the Ginásio Farias Brito and within two months of leaving the Escola de Cadetes, he was teaching Mathematics, Science, Geography, Portuguese and other subjects there. At this time he thought that he wanted a literary career as a writer, poet, or journalist. Soon after he arrived at the Ginásio Farias Brito, however, the mathematics teacher left and Ari de Sá Cavalcante invited Lima to become the mathematics teacher. He now became a mathematics teacher despite never having completed his high school studies.\nIt had been the influence of Lima's sister that helped him do particularly well in mathematics. He said in the interview\n[\n16\n]\n:-\nI have a sister, two years older than me, who was an excellent student, in everything she did she was better, although she was incredibly modest and in particular she was an excellent student of mathematics and was a student of the same teacher as me. And she inspired me because she taught her classmates at home and I attended those classes. So when it was my turn to study those things at school, I had already learned them at home.\nLima realised that if he was to be a mathematics teacher he should learn more about the topic. After he had taught for a year, Ari de Sá Cavalcante told him there was a contest for a teacher at the Colégio Estadual in Ceará. Lima thought that the fact that he had not finished high school would prevent him from entering the competition but it did not. He was one of ten candidates who entered the competition and came out top. Now aged nineteen, he took up the job in Ceará and, in addition, enrolled to study mathematics at the Catholic Faculty of Philosophy of Ceará, a night school run by Marist brothers. This, Lima said, was very poor but every vacation he returned to his home town of Maceió and there became part of a little group. His friend Manfredo do Carmo was at this time studying engineering in Recife, but he returned to Maceió every vacation. In Maceió, Lima met Newton Braga, a physicist who was studying at the Centro Brasileiro de Pesquisas Físicas\n(\nCBPF\n)\nin Rio de Janeiro but also returned to Maceió at the vacations. The three managed to get a room at the Colégio Estadual de Alagoa where they could study mathematics during the vacations.\nNewton Braga encouraged Lima to apply for a scholarship from CNPq which was successful. Having been accepted to study mathematics at the National Faculty of Philosophy, Sciences and Letters at the University of Brazil, in March\n1952\nhe went to Rio de Janeiro. There he came into contact with\nMaurício Peixoto\nand\nLeopoldo Nachbin\nwho both worked at the CBPF and at the University of Brazil. In October of\n1952\n, the IMPA, the Institute of Pure and Applied Mathematics, was created, situated at this time in the CBPF. Lima was awarded a Bachelor's Degree in Mathematics from the University of Brazil in December\n1953\n. Both\nPeixoto\nand\nNachbin\nhad studied for their doctorate at the University of Chicago and they suggested that Lima should study there for his doctorate. They wrote to\nIrving Kaplansky\nwho quickly agreed to accept Lima. Harry Miller Jr, the director of the Rockefeller Foundation, was at the CBPF and\nNachbin\nrecommended Lima for a scholarship. After an interview, he was awarded the scholarship and was set to begin his studies at Chicago in September\n1954\n. Before going, he spent the first half of\n1954\nteaching the course 'Topologia dos Espaços Metricos' at the Faculty of Philosophy, Sciences and Letters which he wrote up as a mimeographed booklet and was published in\nNachbin\n's \"Notes of Mathematics\" series. Jacques Riguet writes\n[\n27\n]\n:-\nThis is the first part of the general topology course given by the author as part of his teaching of higher geometry during the year\n1954\nfor\n2\nnd and\n3\nrd year mathematics students at the Faculty of Philosophy of Rio de Janeiro. This presentation, clear and precise, interspersed with examples and exercises, follows\nNicolas Bourbaki\nfairly closely and can constitute an excellent introduction to the latter's treatise on general topology.\nOn\n14\nJuly\n1954\n, Lima married Valdece, a daughter of Antonio Gonçalves de Magalhães and Maria de Lourdes Pessoa e Sá. Elon and Valdece Lima had five children, all girls. In August\n1954\nLima and his wife sailed from Santos, Brazil on the SS\nArgentina\n, departing on\n9\nAugust, arriving in New York on\n23\nAugust. The record of the voyage shows that Valdece was four years younger than her husband. The day after they arrived they read in a newspaper that the Brazilian president, Getúlio Vargas, had committed suicide.\nLima arrived in Chicago thinking he would undertake research for his doctorate in Functional Analysis,\nNachbin\n's speciality.\nNachbin\nsuggested that one of\nPaul Halmos\n,\nIrving Kaplansky\nor\nIrving Segal\nwould supervise him but when he arrived he discovered that all three had lost interest in that subject. He had expected to begin work on his Ph.D. immediately, but Chicago insisted that he study first for a Master's Degree.\nKaplansky\nwas his advisor for this degree.\nIn\n1955\n, Lima received the Edna M Allen Award from Chicago and he explained in\n[\n24\n]\nhow that happened:-\nThere were in Chicago the Senior Maths Club and the Junior Maths Club, one for teachers and one for students, and each organised a series of lectures on Wednesdays. One week the lecture was given by a researcher, the following week by a student; at the Junior Maths Club, the student who gave the best lecture of the year won this prize. When I arrived, I was asked if I wanted to give a talk; I did and won the prize. Then I was elected president of the Junior Maths Club.\nIn May\n1955\nLima took both a written and an oral examination in five subjects for his Master's Degree and was then able to continue to study for his Ph.D. The Rockefeller Foundation grant only funded him for two years, then he was able to obtain a CNPq grant for the rest of his studies at Chicago. Finances were very tight, with his first daughter born in\n1955\n. After realising that functional analysis was not a good topic for his Ph.D. in Chicago, Lima began studying algebraic topology. While studying for his Master's Degree, he read the mimeographed notes taken by students who had attended a course given by\nEdwin Spanier\nand then Lima undertook research advised by\nSpanier\n. He sat the oral examination for his doctoral thesis\nDuality and Postnikov Invariants\nin December\n1958\n; he had submitted the thesis on\n17\nOctober\n1958\n.\nThe thesis contains the following Acknowledgement:-\nI would like to express my gratitude to Professor\nE H Spanier\nfor his generous help and encouragement during the preparation of this thesis.\nIn his thesis Lima introduced the notion of the spectrum of topological space which generalises cohomology theory. This idea has led to many advances by numerous mathematicians. The examiners praised the high quality of Lima's thesis at his oral but a strange problem between\nSaunders Mac Lane\nand Lima almost stopped him graduating with his doctorate; for Lima's account, see\nTHIS LINK\n.\nBack at the IMPA in Rio de Janeiro, Lima was an assistant researcher paid through a scholarship. By now he had two daughters and the scholarship did not cover the rent of his apartment so it was impossible to continue but to allow him to continue to work there he was promoted to a senior researcher so getting a larger scholarship. We mentioned above Lima's original intention to have a literary career. He explained how this led to him writing mathematics books\n[\n16\n]\n:-\n... my intention since I was a boy was to be a writer. I wrote a lot of nonsense, like poetry and short stories. I had a huge notebook with the rubbish I wrote. When I finished my PhD, I reread everything, saw that it was second-rate stuff, and then I tore it up and threw it away. So I decided to write about mathematics, because I was always concerned with helping to create a group of people in Brazil who were very competent in mathematics. And so I started writing books because I thought and still think that books are the best way for you to develop and disseminate knowledge.\nThe third Brazilian Mathematics Colloquium was held at University of Ceará in July\n1961\n. Lima was the organiser of the Colloquium and delivered the course\nTopologia Diferencial\nⓉ\n(\nDifferential topology\n)\n. He contributed several other courses to the Brazilian Mathematics Colloquium over the following years, in\n1969\n,\n1973\n,\n1975\n,\n1977\nand\n1987\n.\nIn the\n1960\ns, Lima spent time at different institutions in the United States. He made a short visit to the University of California, Berkeley in\n1960\n. A Guggenheim Fellowship allowed him to spend from August\n1962\nto September\n1963\nat the Institute for Advanced Study at Princeton\n[\n24\n]\n:-\n... there are no classes there, only\n6\nseminars - and a fabulous working environment, with a huge library. There are a hundred houses for visiting members, where I lived that year, attending seminars and doing research; twice a month I went to New York to talk to\nSteve Smale\n, who worked at Columbia University. When the year ended, the Guggenheim Foundation renewed my scholarship for another\n12\nmonths, which is unusual. So I went to Columbia University and lived in New York; when my period was about to end, I received an invitation to stay at the University. I also had offers from the University of Massachusetts and later from the University of Maryland. I turned them all down and went back to Brazil, but not to IMPA, because I decided to accept an invitation from the University of Brasília.\nLima's American colleagues could not understand why he decided to return to Brazil when he had offers of positions in the United States. There had been a military coup in Brazil in April\n1964\nand it was unclear whether universities would be able to continue to operate. Lima's invitation had come from Zeferino Vaz, the rector of the University of Brasília, who said Lima had been recommended to him by\nNachbin\nand several others. Lima was honoured to have received the invitation and, rather reluctantly because of uncertainty over the military coup, accepted the offer leaving the United States in August\n1964\nto take up his new position. The director of the Institute of Mathematics at the University of Brasília was\nNachbin\n, but since he did not come to the Institute, Lima was effectively the director. He spent a year there undertaking research and delivering courses but by the middle of\n1965\nthe position had deteriorated. The military regime began to decide on whether they approved appointments of professors. There was a mass resignation of staff from the university.\nAfter leaving the University of Brasília, Lima went with his family to Ceará where he lived for a while without a job. Then he received an invitation to spend six months at the University of Rochester which he gladly accepted. He left his family in Ceará and went to Rochester, New York, where he lived with Moisés Nussenzweig, a Brazilian professor of physics who had left the CBPF in Rio de Janeiro because of persecution by the military dictatorship. After the six months at Rochester Lima was invited, with his family, to spend a year at the University of California, at Berkeley which he did, returning to the IMPA in Brazil early in\n1968\n.\nNachbin\nwas recognised as the outstanding mathematician at the IMPA but Lima and others were not happy with the direction he was taking it. In an attempt to improve the tense situation, Lima accepted an invitation from the Pontifical Catholic University of Rio de Janeiro spending the first half of\n1969\nthere. Lima was then invited back to the IMPA as director and he accepted. This was the first of three spells he spent as director,\n1969\n-\n71\n,\n1979\n-\n80\n, and\n1989\n-\n93\n. When asked in the\n2001\ninterview\n[\n4\n]\nabout the status of the IMPA, Lima replied:-\nI think that the IMPA is unique at a world level, not in the sense of being exceptional. It is unique because it is a first world institute in a third world country. It is an institution that, for various reasons, has managed to maintain itself and reach an excellent level, despite never having had an exceptional position or any privilege within the scheme of scientific policy in Brazil. For some time the IMPA was more famous, more respected, outside than inside Brazil. Today this is no longer true. However, its scientific prestige is not reflected, for example, in the prestige of professors who have very low salaries, even in comparison with the salaries of Brazilian federal universities. IMPA salaries are lower and some privileges that teachers have, we don't have. We are not considered teachers. Although it is an institution accredited by the Ministry of Education to offer Master's and Doctoral degrees, the members are not professors, they are researchers.\nAlthough Lima made some deep and important research contributions, his greatest achievement was as an author of textbooks. He wrote books at secondary school level, at undergraduate level and at postgraduate level. Let us quote from Paulo Araújo\n[\n1\n]\n:-\nElon Lages Lima is the author of the best mathematics textbooks that, over the last forty years, have been written in Portuguese. His books in the Projecto Euclides and Matemática Universitaria collections, successively republished by IMPA\n(\nNational Institute of Pure and Applied Mathematics, Rio de Janeiro, Brazil\n)\n, not only contributed to the learning of generations of students, but also conveyed to them a taste for elegant exposition, lucid and orderly maths topics. It is worth naming some of these books: in the Projecto Euclides collection, the two-volume Analysis Course\n(\nthe first one already has eleven editions\n)\nand the text on Metric Spaces; and, in the Matemática Universitaria collection, the Linear Algebra manual, where, through its exquisite exposition and original perspective, Elon manages to breathe new life into a subject that the profusion of textbooks has trivialised to the point of irrelevance. Both Metric Spaces and Linear Algebra won the Jabuti Prize awarded by the Brazilian Book Chamber for the best science book published in that country in the respective year\n(1978\nand\n1996)\n.\nTo fulfil his vocation as a writer, Elon has written assiduously, always about mathematics. After the university manuals, in recent years he dedicated his attention to secondary education\n(\nequivalent to our secondary education\n)\n, directing an improvement course for teachers that has been running at IMPA since\n1990\nand launching, as support for the course, a collection of books, Meu Professor de Matemática, which now has\n19\ntitles,\n12\nof which he authored\n(\nalone or in partnership\n)\n. They are elementary books, which clarify and deepen the curricular themes of mathematics of this teaching level; their value and usefulness, however, far transcend the immediate purpose for which they were written: any professor or student of mathematics, in any country or educational level, could read them with pleasure and profit\n(\nif the language were not an obstacle\n)\n.\nMore information about\n28\nof Lima's books, see\nTHIS LINK\n.\nThe above quote details the two Jabuti Prizes that Lima was awarded. He received several other honours: an honorary degree from the Federal University of Ceará in\n1989\nand full membership of\nThe World Academy of Sciences\nin the same year; the Anísio Teixeira Award from the Ministry of Education in\n1991\n; the National Order of Scientific Merit in the Class of the Grand Cross from the President of the Republic in\n2000\n; an honorary degree from the Pontifical Catholic University of Peru in\n2001\n; and honorary degrees from the Federal University of Campinas and the Federal University of Bahia, both in\n2003\n.\nAfter Lima's first marriage ended, he married Carolina Celano in the\n1990\ns. She was the head librarian at the IMPA. Lima died of pneumonia and at his funeral a mass was celebrated by Paul Schweitzer, a mathematician who received his doctorate from Princeton in\n1962\nand eight years later became a priest. Schweitzer was a friend who taught at the Pontifical Catholic University in Rio de Janeiro. Lima was buried at the Cemitério da Penitência, in Caju, Rio de Janeiro.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}