{
  "nome_completo": "Emanuel Lasker",
  "nome_curto": "Emanuel Lasker",
  "ano_nascimento": "1868",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lasker/",
  "lugar_nascimento": "Berlinchen, Prussia (now Barlinek, Poland)",
  "lugar_morte": "New York, USA",
  "biografia": "Emanuel Lasker\nwas born in the Prussian province of Brandenburg into a Jewish family. His mother was Rosalie Israelssohn while his father was Adolf Lasker, a cantor in the synagogue whose role there was to lead the liturgical prayers and chanting. Emanuel had an older brother Berthold and, when sent to attend school in Berlin when he was eleven years old, Emanuel was taught to play chess by Berthold who was a student in the medical faculty there. He made some money playing chess in the local cafés, but he did not become a serious chess player until about the age of fifteen.\nIn fact Emanuel's parents were so worried that he was devoting too much time to chess and not enough to his school work that they told Berthold to find another school for Emanuel. However, the head of this new school was president of the local chess club and the mathematics master was the local chess champion, so in his new secondary school Emanuel continued to show remarkable talents at both mathematics and at chess. In\n1888\nhe obtained his abitur in Landsberg an der Warthe, now a Polish town named Gorzow Wielkopolski.\nLasker studied mathematics and philosophy at the universities in Berlin, Göttingen and Heidelberg but he combined his studies with playing chess. In\n1889\nhe won his first chess tournament in Berlin and, a month later, he won the Hauptturnier in Breslau which earned him the German title of Master of Chess. One of the judges at this event, Leopold Hoffer, commented:-\nThe young master will be a formidable opponent in future contests.\nAlthough he failed to win the tournament at Amsterdam shortly afterwards, Hoffer reinforced his opinion:-\nYoung Lasker only confirmed the opinion we expressed about him when we watched him in Breslau. He is only\n21\nyears of age, but possesses already the qualities of a first-class master - erudition, judgement of position, quickness of conception, imagination, great enthusiasm for the game, and above all, he is a man of culture and more than average intelligence.\nLasker had an extended stay in England in\n1891\n-\n92\n, playing many fine chess games and beating the best players in that country. In\n1893\nhe went to the United States and continued to win all the matches that he played. He won the New York International tournament, winning every game despite some top players competing, and he defeated the American chess champion. He did not neglect his mathematics however, and in\n1893\nhe lectured on differential equations at Tulane University in New Orleans. His remarkable wins in the United States put Lasker in a position to challenge Wilhelm Steinitz, who was\n58\nyears old at this time, for the title of World Champion. A match was arranged which would take place in three venues, New York, Philadelphia and Montreal, with victory going to the first player to record ten victories.\nThe match began in New York on\n15\nMarch\n1894\nand was fairly even with two victories to each player in the first six games. However, Lasker then won five consecutive games winning impressive victories in Philadelphia, and, despite Steinitz recovering after this, Lasker won in Montreal. He gained his tenth win there on\n26\nMay\n1894\n, having by this time played four draws and having five losses. However despite now being World Champion, many doubted that he deserved the honour. Tarrasch said:-\nIn my opinion the match with Steinitz does not have the great importance that they themselves attribute to it. For Steinitz has grown old, and the old Steinitz is no longer the Steinitz of old.\nLasker had returned to Germany by the end of\n1894\nbut he contracted typhoid fever and became seriously ill. His brother Berthold nursed him back to health but it was a slow process and he was still recovering in\n1895\nwhen he took third place in famous Hastings Tournament in England described as:-\n... the most important tournament of the\n19\nth\ncentury, which assembled the entire cream of world chess.\nWhile in England he gave a series of lectures on chess which he wrote up for publication as\nCommon Sense in Chess\n. The book was published in German in\n1896\nwith the English translation appearing in the following year.\nOver the next few years Lasker played in relatively few chess tournaments. He had a famous win in St Petersburg in\n1895\n-\n96\nand in a tournament in Nuremberg in the summer of\n1896\n. In\n1896\n-\n97\nhe played Steinitz again in a world championship match and was again victorious. This time he reached ten victories having lost only twice and drawn five times. In London in\n1899\nLasker had one of his most impressive tournament victories, winning\n20\nof the\n28\ngames he played, losing only one game. In the following year in Paris he was equally impressive winning\n14\nof his\n18\ngames, again with only one loss.\nChess was certainly not the only interest for Lasker over these years. In fact he was concentrating more on mathematics than chess which explains why he played in so few tournaments. Advised by\nMax Noether\n, Lasker presented his doctoral thesis\nÜber Reihen auf der Convergenzgrenze\nⓉ\n(\nOn rows to the limit of convergence\n)\nto Erlangen in\n1900\nand it was published in the\nPhilosophical Transactions\n.\nLasker moved to the United States in\n1902\nand lived there until\n1907\nbut only played in one chess tournament during these years, namely at Cambridge Springs in\n1904\n. Lasker was second equal in this tournament, the winner Frank Marshall went on to challenge Lasker for the world championship. However, Lasker set high financial stakes for such a match and Marshall, young and comparatively unknown before the Cambridge Springs tournament, had little chance of finding backers to put up Lasker's asking price. Marshall had to take on other opponents which, indeed, he did.\nAlthough Lasker played little chess over this period, he did some remarkable mathematics. In\n1905\nhe introduced the notion of a primary ideal, which corresponds to an irreducible variety and plays a role similar to\nprime\npowers in the prime decomposition of an integer. He proved the primary decomposition theorem for an ideal of a polynomial ring in terms of primary ideals in a paper\nZur Theorie der Moduln und Ideale\nⓉ\n(\nOn the theory of modules and ideals\n)\npublished in volume\n60\nof\nMathematische Annalen\nin\n1905\n. A commutative ring\nR\nR\nR\nis now called a 'Lasker ring' if every ideal of\nR\nR\nR\ncan be represented as an intersection of a finite number of primary ideals.\nIn\n1907\nLasker returned to Germany and, challenged again by Marshall, he now dropped the price to a figure that Marshall could find backers to put up - the World Champion was back to playing chess in a big way. During the years\n1907\nto\n1910\n, he defended his World Champion's title in six matches, one against Marshall in\n1907\nin which Lasker never lost any of the\n15\ngames played\n(8\nwins and\n7\ndraws\n)\n, one match against Tarrasch in\n1908\n, three matches against David Janowski in\n1909\n(\ntwo matches\n)\nand\n1910\n, and one against Carl Schlechter in\n1910\n. He only played in one tournament during these years, coming first equal with Akiba Rubinstein in St Petersburg in\n1909\n. He also played exhibition matches, which could be lucrative, and in the same year he played two such matches against Janowski.\nLasker married Martha Cohn, the daughter of Emil Cohn, in\n1911\nand they lived in Berlin. Arrangements were put in place for Lasker to defend his title again. The plan was that he play Rubinstein for the World Championship, then that the winner would play José Raúl Capablanca. However, due to World War I, the matches could not be played. After World War I ended, arrangements were again worked out, with a world championship match between Lasker and Capablanca being set up. However, Lasker wrote to Capablanca resigning his World Champion title before the match was to be played. However, he was persuaded to play and the match took place in Havana, Cuba, in the following year. After fourteen games Lasker retired because of ill health and his reign of\n27\nyears as World Chess Champion was over.\nDespite losing the title, Lasker still won the New York International Tournament in\n1924\nwith Capablanca coming second with Alexander Alehkine in third place. Lasker now took up Bridge and Go, going on to represent Germany at Bridge.\nIn\n1933\n, being Jewish, Lasker was forced to emigrate and went to England where he lived until\n1935\n. Gareth Williams, writing in\nChess Monthly\n, describes Lasker's last few years:-\n... the Laskers were forced out of their comfortable retirement. The regime confiscated the Laskers' Berlin appartment, their farm at Thyrow and their lifetime savings. Emanuel and Martha Lasker, in their old age, suddenly found themselves destitute, without money home or homeland.\nHe was forced to come out of retirement and to play chess again to make enough money to live:-\nIn order to survive Lasker had once again to build a career in chess. The first tournament he was invited to after nine years retirement was Zürich. ..... Lasker was invited to Moscow in\n1936\nto participate in another great international tournament. ... The Laskers were encouraged to stay on in Moscow after the tournament and Dr Emanuel Lasker, mathematician, was invited to become a member of the\nMoscow Academy of Science\n. The offer was accepted and the Laskers took up permanent residence in Moscow. Emanuel became absorbed with his mathematical studies at the\nMoscow Academy\n.\nHe played in the Nottingham International Chess Tournament from\n10\nth\nto\n28\nAugust\n1936\n. W H Watts, writing an Introduction to the book of the tournament, wrote:-\nLasker, throughout the tournament gave me the unmistakable impression that he was not extending himself. There may be a very good reason for this. He made his name a generation ago and although winning a high place would be a very fine performance, the strain of a long tournament with fifteen long arduous games would be unwise for a man of nearly seventy years.\nAt the garden party in the middle of the tournament:-\nLasker's never failing fund of humour was much in evidence and he evidently excels at clock golf.\nIndeed although he did not win the chess tournament, he did win the putting competition! It was reported that he played for the ending, in other words he made sure his second putt was as short as possible.\nIn\n1937\nthe Laskers moved yet again, after their patron Krylenko had been disgraced, this time taking up residence in New York in the United States. There Martha Lasker took ill and they were advised not to travel; she died later that year. Lasker gave lectures and demonstrations over the next couple of years but, in\n1939\n, during a lecture, he became dizzy. This was the start of an illness which slowly worsened until his death.\nNathan Divinsky, himself an exceptional mathematician and like Lasker most famous for his results in ring theory, writes:-\nIn that great roll-call of tournaments, St Petersburg\n1896\n, St Petersburg\n1914\nand New York\n1924\n, Emanuel Lasker always won. In\n1896\nit was by a two-point margin over his leading contemporaries,\n18\nyears later again by a two-point gap in the final and ten years further on\n(\nthree years after he conceded the title to Capablanca\n)\n1\n1\n2\n1\\large\\frac{1}{2}\\normalsize\n1\n2\n1\n​\npoints ahead of a mighty field. Such results surely indicate something truly remarkable about Emanuel Lasker.\nLasker, in addition to his algebraic results and his chess genius, also introduced a number of interesting mathematical games. For example he devised laska, and produced an interesting modification to the rules of nim. As well as writing on chess, where we could mention\nLasker's manual of chess\nin addition to the classic\nCommon sense in chess\nmentioned above, Lasker wrote on philosophy. On that topic he published\nKampf\nⓉ\n(\nStruggle\n)\n(1907)\n,\nDas Begreifen der Welt\nⓉ\n(\nAn understanding of the world\n)\n(1913)\n,\nDie Philosophie des Unvollendbar\n(1919)\n,\nDas verständige Kartenspiel\nⓉ\n(\nThe intelligent card game\n)\n(1929\n, English translation in the same year\n)\n,\nBrettspiele der Völker\nⓉ\n(\nBoard games of the peoples\n)\n(1931)\n, and\nThe Community of the Future\n(1940)\n.\nMikhail Botvinnik, who became World Chess Champion in\n1948\n, wrote:-\nThe first time I saw Lasker, he was an elderly man. His appearance was not impressive. His movements were very slow. ... He was a very wise man - he was the first one who studied all the practical sides of a chess game: how to prepare for a tournament, when to play in it, how to rest, eat, etc. He perfectly understood all these practical aspects.\nA quotation from Lasker shows how he approached games. He was once asked after giving a lecture why he almost always chose variations in openings which his opponent had declared unsatisfactory. Lasker replied:-\nI did not study anything but the variations in question consisted of developing moves which were so sound and reasonable that they could not be so bad as my opponent thought. I was therefore convinced that he had misjudged these variations, and his understanding of them was faulty. I wanted to take advantage of this state of affairs.\nIn\n[\n2\n]\nhis philosophy of life and of chess are compared:-\nLasker's conception of life, as expounded in his writings, was that of a fight or struggle and as a chess player he was probably the greatest fighter that the game has seen. Supremely wary and tenacious, he would deliberately involve himself in difficulties to complicate the struggle and give himself chances of outplaying his opponent; and once he had the advantage, he would push it home with relentless vigour and decision.\nFinally let us comment that Lasker's results on the decomposition of ideals into primary ideals was the foundation on which\nEmmy Noether\nbuilt an abstract theory which developed ring theory into a major mathematical topic and provided the foundations of modern\nalgebraic geometry\n.\nEmmy Noether\n's\nIdealtheorie in Ringbereichen\nⓉ\n(\nIdeal theory in division rings\n)\n(1921)\nwas of fundamental importance in the development of modern algebra, generalising Lasker's results by giving the decomposition of ideals into intersections of primary ideals in any commutative ring with ascending chain condition.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}