{
  "nome_completo": "Emanuels Grinbergs",
  "nome_curto": "Emanuels Grinbergs",
  "ano_nascimento": "1911",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grinbergs/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Riga, Latvia",
  "biografia": "Emanuels Grinbergs\nwas born in St Petersburg into a family which included artists and diplomats. Although born in Russia, his father was a Latvian who was a bishop in Russian Lutheran Church. This was at a time when Latvia was dominated by Russia, as it was from the end of the\n18\nth\ncentury until World War I. During\n1917\nthis domination ended and, after a brief period of German invasion, the country became independent in a proclamation made on\n18\nNovember\n1918\n. It was, therefore, to an independent Latvia that Grinbergs' family returned in\n1923\non the death of his father. On their return, they lived in Riga where Grinbergs attended high school. He won a prize which enabled him to travel to Lille in France in\n1927\nto complete his secondary education at the Lycée there.\nReturning to Latvia, Grinbergs studied mathematics at the University of Latvia between\n1930\nand\n1934\n. He graduated with distinction in\n1934\nand won the K Morbergs Stipend which gave him financial support to study abroad. During\n1935\nand\n1936\nhe studied at the École Normale Supérieure in Paris. It was during his time in Paris that his first publication appeared; it was a work on geometry\nÜber die Bestimmung von zwei speziellen Klassen von Eilinien\nⓉ\n(\nOn the definition of two specific classes of ovals\n)\n. Returning to Riga, Grinbergs became a\nPrivatdozent\nat the University of Latvia in\n1937\nand began his lecturing career in January\n1938\nteaching courses on geometry.\nPolitical moves which would have a major impact on Grinbergs' career were soon happening; in particular the German-Soviet Nonaggression Pact was signed in August\n1939\nand Latvia's fate was out of its own hands. On\n17\nJune\n1940\nthe Red Army invaded Latvia and only three days later a new government of Soviet supporters was announced. They voted on\n21\nJuly for Latvia to become a part of the USSR and on\n5\nAugust this became official. The Soviet occupation saw around\n35\n,\n000\nLatvians deported to Russia within a year. During this extremely difficult period Grinbergs undertook research towards his thesis.\nThe German army invaded the USSR in July\n1941\n. For a period Latvia was a province of a larger Ostland\n(\nincluding Estonia, Lithuania, and Byelorussia\n)\nand during this period, in\n1943\n, Grinbergs defended his thesis\nOn oscillations, superoscillations and characteristic points\n. Immediately following this Grinbergs was drafted into the German army. In\n1944\nthe Soviet army again marched into Latvia and a renewed period of Soviet domination began. The fact that Grinbergs had served in the German army\n(\nhe was forced to do so and he certainly did not wish to serve any army\n)\ndid not find favour with the new Soviet rulers of Latvia and he was sent to a camp in Kutaisi, Georgia, in the Caucasus. The Soviets used his mathematical skills, for while he was there he solved computational problems concerning buildings.\nIn\n1947\nGrinbergs was allowed to return to Latvia, but he had to work in a factory involved in the manufacture of radios. He was not allowed to take up his post at the University of Latvia and his doctorate was declared void since it had been obtained during the period of German control of Latvia. Grinbergs soon began to apply his great mathematical skills to problems concerning radios. In particular he developed a theory for analysis and synthesis of linear electrical circuits, using the theory of approximation of functions to make electrical circuits easy to describe mathematically. By\n1954\nhe was allowed to lecture at the University of Latvia and in\n1956\nhe defended a second thesis\n(\nto replace the one declared void by the authorities\n)\nProblems of analysis and synthesis of simple linear circuits\n. In\n1960\nhe was appointed as Head of a section in the Computer Centre at the University of Latvia. This Centre had been established in\n1959\nunder the leadership of\nEizens Arins\nand\nArins\n, Grinbergs and Janis Daube were the main research leaders.\nGrinbergs now led a group which undertook research into a number of different topics using computers. In particular\n[\n5\n]\n:-\n[\na\n]\nsignificant achievement of Grinbergs' group was the development of analytic methods for calculation of planar contours of\n3\n-dimensional components of the hulls of ocean going ships. These methods were highly acclaimed throughout the Soviet Union and were used by many shipbuilding companies.\nHowever he worked on a large number of topics, although he published relatively little. He developed a theory of splines, became interested in Markov processes, but also worked on graph theory which he loved more than any of the other topics. On his death in\n1982\nhe left\n20\n,\n000\npages of mathematical manuscript pages which he had never submitted for publication.\nDambitis gives this tribute to Grinbergs in\n[\n2\n]\n:-\nEmanuels Grinbergs ... was one of the greatest all-around mathematicians of the Baltics. Due to the isolation imposed by the former Soviet Union, most of his remarkable results and achievements are unknown in the Western world. It is therefore fitting that the first international graph theory conference in the Baltics should review the life and achievements of this remarkable scientist whose only fault was that he did things at the wrong time and was in the wrong place with respect to two of the most brutal totalitarian regimes that overran his country in\n1940\n(\nStalin\n)\n,\n1941\n(\nHitler\n)\nand\n1945\n(\nStalin again\n)\n. Among his unpublished major achievements are a number of remarkable results in graph theory. He independently discovered spline theory to provide a method to form the hulls of ocean-going ships by cutting flat plates into shapes that after three-dimensional forming fitted together precisely enough for welding without further machining.",
  "math_areas": [
    "Analysis",
    "Combinatorics",
    "Geometry"
  ]
}