{
  "nome_completo": "Emil Weyr",
  "nome_curto": "Emil Weyr",
  "ano_nascimento": "1848",
  "ano_morte": "1894",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weyr/",
  "lugar_nascimento": "Prague, Bohemia (now Czech Republic)",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Emil Weyr\n's father, František Weyr\n(1820\n-\n1889)\n, was born in Náchod to Jan Weyr\n(1791\n-\n1842)\nand Terezie Wanátková. František was a professor of mathematics at a realschule\n(\nsecondary school\n)\nin Prague from\n1855\n. He had married Marie Rumplová\n(1825\n-\n1889)\nin St Stephen's Church in the New Town of Prague on\n10\nJune\n1850\nand they had ten children. Two of the children were born before their marriage. Before examining Emil's life in detail, let us briefly comment on all ten children. These were Karel Weyr\n(1844\n-\n1915)\n, Emil Weyr, the subject of this biography, Marie\n(1850\n-\n1923)\n,\nEduard Weyr\n, who has a biography in this archive, Bedrich Weyr\n(1853\n-\n1908)\n, Anna\n(1854\n-\n1884)\n, Antonie\n(1856\n-\n1919)\n, Emilie\n(1858\n-\n1934)\n, Berta\n(1860\n-\n1927)\n, and Helen\n(1867\n-\n1955)\n. Karel, the eldest of the children, was rather different from his brothers and did not influence them greatly as they grew up. He became a financial controller and financial inspector. Bedrich, the one brother younger than the two mathematicians Emil and Eduard, studied chemistry at the Czech College of Technology\n(1871\n-\n1874)\nand at the University of Prague\n(1875\n-\n1878)\n. He became an expert in sugar refining becoming director of sugar refineries. Of the girls, Marie married Albin Sieber, the director of a sugar refinery in Zdice. Anna married August Johann Friedrich Seydler\n(1849\n-\n1891)\n, a distinguished theoretical physicist and astronomer who was a professor at the Charles University of Prague. Antonie married Rudolf Schuh\n(1848\n-\n1897)\n. Emilie married the architect and builder Josef Roesel\n(1855\n-\n1922)\n. Berta married the very wealthy wholesaler of sugar Leopold Brumlik\n(1849\n-\n1900)\n. The youngest daughter, Helen, lived with her brother Emil in Vienna for many years. Eventually she married Colonel Ernst Grünfeld\n(1860\n-\n1938)\n, the brother of the well-known pianist and composer Alfred Grünfeld\n(1852\n-\n1924)\n. We note that the family were German speaking and only spoke Czech as a second language.\nAccording to the parish records, Emil was born on\n1\nSeptember\n1848\nand he was baptised in St Stephen's Church in the Upper New Town of Prague on\n3\nSeptember. However, the Weyr family believed that Emil was born on\n31\nAugust and always celebrated his birthday on that day. He was four years older than his brother\nEduard Weyr\nwho also became a famous mathematician. He was brought up in a home where his father behaved like a philosopher. František displayed humour, perhaps somewhat tinged with melancholy, and looked at the deeper aspects of life rather than the day to day trivialities. He loved animals, especially dogs and birds, something which he passed on to his son Emil. The family dog, named Snapsl, was an important member of the large family. František's philosophical outlook on life meant that he tried not to show any emotions to his children. Emil entered the elementary school of Our Lady of the Snows in\n1854\nwhere he was taught by František Petter. From\n1859\n, Emil attended the realschule in Mikulandska street in Prague where his father taught, but already at this time he was engaged in studying advanced mathematics guided by his father. Then he studied at the Prague Polytechnic from\n1865\nto\n1868\nwhere he was taught geometry by\nOtto Wilhelm Fiedler\n(1832\n-\n1911)\n.\nFiedler\n, who had obtained his doctorate from the University of Leipzig in\n1858\nadvised by\nAugust Ferdinand Möbius\n, became professor of descriptive geometry at the Technical University of Prague in\n1864\nbut left three years later to become a professor in Zürich.\nWeyr was an excellent student and began publishing papers during his undergraduate studies. At the Technical University he studied engineering sciences but was less interested in the practical aspects of the courses. In September\n1868\n, he became an assistant of Heinrich Durége\n(1821\n-\n1893)\n. Durége had been born in Danzig and was professor at Zürich before being appointed as a professor at the University of Prague. He had published the books\nTheorie der Funktionen elliptischen\nⓉ\n(\nTheory of elliptical functions\n)\n(1861)\n,\nElemente der Theorie der Functionen einer complexen veränderlichen Grösse\nⓉ\n(\nElements of the theory of functions of a complex variable size\n)\n(1864)\n, and\nDie Ordnung Ebenen Curven dritter\nⓉ\n(\nThe order of third level curves\n)\n(1871)\n. He also wrote an important biography of\nFriedrich Wilhelm Bessel\n, namely\nBessel's Leben und Werken\nⓉ\n(\nBessel's life and works\n)\n(1861)\n. Weyr volunteered to do one year's military service, from March\n1869\nto January\n1870\n. During this time he received his doctorate from the University of Leipzig on\n5\nMay\n1869\n. The physicist and philosopher Ernst Mach\n(1838\n-\n1916)\n, had been appointed as professor of Experimental Physics at the Charles-Ferdinand University in Prague in\n1867\nand he encouraged Weyr to\nhabilitate\nat the Charles University. He became a Privatdozent at the Charles-Ferdinand University in Prague on\n3\nMay\n1870\n. He had an excellent publication record having published\n31\nitems including the two books published in\n1869\nand\n1870\n,\nTheorie der mehrdeutigen geometrischen Elementargebilde und der algebraischen Curven und Flächen als deren Erzeugnisse\nⓉ\n(\nTheory of ambiguous geometric elementary forms and of algebraic curves and surfaces as products\n)\nand\nGeometrie der räumlichen Erzeugnisse ein-zwei-deutiger Gebilde, insbesondere der Regelflächen dritter Ordnung\nⓉ\n(\nGeometry of ambiguous spatial products, in particular the control surfaces of the third order\n)\n.\nIn the summer of\n1870\n, Weyr began preparing to go to Paris having been awarded a state scholarship to fund his visit. In Paris he planned to attend lectures by\nCharles Hermite\n,\nJoseph Alfred Serret\n,\nMichel Chasles\n, and other leading mathematicians. However, on\n19\nAugust France declared war on Prussia and the Franco-German war of\n1870\n-\n71\nbegan. Weyr quickly changed his plans and decided instead to visit Italy. On\n7\nNovember\n1870\nhe set off on his travels to Milan. He travelled by train to Trieste, then he continued his journey to Venice where he spent several enjoyable days sightseeing. He arrived in Milan on\n17\nNovember but from the end of November until the middle of January he was back home in Bohemia. By early February he was again in Milan, and now he began to attend courses given by\nLuigi Cremona\nand\nFelice Casorati\nat the Polytechnic. He treated\nCremona\nas his advisor at first but a friendship developed and the two exchanged letters as friends over the following twenty years. In February\n1871\nhis brother\nEduard Weyr\nvisited him in Milan. The two brothers collaborated on the first volume of their three volume book on projective geometry entitled\nFoundations of higher geometry\n(\nCzech\n)\n. The first two volumes had Emil as the main author while\nEduard\nwas the main contributor to the third volume. In April\n1871\nEmil Weyr set off on a sightseeing tour of Italy, visiting Padua, Bologna, Pisa, Florence, Rome, and Naples. While visiting Naples he climbed Mount Vesuvius. He took the opportunity to meet many Italian mathematicians on this trip and he continued to correspond with many of them after he returned from his Italian visit. The authors of\n[\n2\n]\nwrite about the importance of this visit for Weyr's mathematical development:-\nWeyr's stay in Italy was immensely important and inspirational for his further scientific work. He acquainted himself with the latest achievements in projective and synthetic geometry and wrote several treatises that helped him to gain the attention of European geometers. In a reaction to his stay in Italy, Emil Weyr wrote\n22\nworks in\n1871\n(13\nGerman,\n8\nItalian,\n1\nCzech\n)\n,\n11\nworks in\n1872\n(6\nGerman,\n3\nCzech,\n2\nItalian\n)\nand\n11\nworks in\n1873\n(5\nGerman,\n4\nCzech,\n2\nItalian\n)\n. Italian papers were published in journals 'Rendiconti di Real Istituto Lombardo' and 'Analli di matematica pura ed applicata'\n(\nthanks to the cooperation of\nL Cremona\n)\nand in 'Giornali di Matematiche'\n(\nthanks to the cooperation of\nG Battaglini\n)\n.\nHe returned to Prague in late May\n1871\nwhere he continued to teach. He deputised for an extraordinary professor at Prague Polytechnic on\n15\nOctober\n1871\nand in December of that year his appointment as extraordinary professor was confirmed. He also taught at the University of Prague as a\nprivatdocent\n. In\n1872\nhe was elected to be Head of the\nUnion of Czech Mathematicians and Physicists\n, an organisation of which he had been a co-founder two years earlier. Weyr returned to Italy for another visit in April\n1873\n. His main task on this trip was to have further discussions with\nLuigi Cremona\nsince Weyr was translating\nCremona\n's books. He made up for having had to cancel an earlier trip to Paris when he went there for a holiday in\n1874\n. On this occasion he took the opportunity to have discussions with\nChasles\nand, before leaving France, he went to Bordeaux to talk with\nJules Hoüel\n. He was appointed permanent secretary of the\nUnion of Czech Mathematicians and Physicists\nin\n1874\nand, in July of that year, he was appointed as editor of the new Journal\nArchive of mathematics and physics\nthat the Union had just founded. On\n23\nSeptember\n1875\nhe was appointed as professor of mathematics at the University of Vienna. He, together with his brother\nEduard Weyr\n, were the main members of the Austrian geometric school. They were interested in descriptive geometry, then in projective geometry and their interests turned towards algebraic and synthetic methods in geometry. Among many works Emil Weyr published were\nDie Elemente der projectivischen Geometrie\nⓉ\n(\nElements of projective geometry\n)\nand\nÜber die Geometrie der alten Aegypter\nⓉ\n(\nOn the geometry of the ancient Egyptians\n)\n.\nIn\n1877\nEmil Weyr married Marie Waniek von Domyslowa\n(1860\n-\n1934)\nin Vienna. Emil and Marie Weyr had three children: František\n(1879\n-\n1951)\nbecame a lawyer and was professor at Masaryk University in Brno; Jindrich\n(1880\n-\n1957)\n; and Marie\n(1883\n- ?\n)\n. The\n1\nst  Congress of Czech Physicians and Naturalists was held in Prague in the spring of\n1880\n. Both Emil Weyr and his brother\nEduard Weyr\nwere invited to lecture at the Congress. The\n2\nnd\nCongress was held two years later and again both brothers were invited to lecture. In August\n1889\n, both Weyr's parents died, his father suffering a stroke thirteen days after the death of his mother; they were buried in the Olsanské Cemetery in Prague\nEmil Weyr led the geometry school in Vienna throughout the\n1880\n's up until his death. His approach to synthetic geometry was in the style of\nChasles\nand\nCremona\nwhile the other geometric approach at the time, namely that of\nKarl von Staudt\nand\nTheodor Reye\n, had little influence on him. He introduced a method to derive from some well-known property of a geometric structure, a new property through an algebraic correspondence. Weyr, with great skill and ingenuity, became a great master of this method and produced many results using his approach. He also made an important contribution to the theory of involutions, studying first the cubic before moving on to mapping of rational curves on each other. In his own time, Emil Weyr was considered to have made more significant contributions than his younger brother\nEduard Weyr\nbut, now that we can see how the contributions of the two brothers influenced later research, it is possible to suggest that\nEduard Weyr\nmade some of the the more lasting contributions.\nTogether with the Austrian mathematician Gustav Ritter von Escherich\n(1849\n-\n1935)\n, Emil Weyr founded the important mathematical journal\nMonatshefte für Mathematik und Physik\nin\n1890\n. The first volumes of the journal contain papers written by his brother\nEduard Weyr\n. In\n1891\nEmil Weyr became one of the first\n19\nfounder members of the\nRoyal Czech Academy of Sciences\n. He was also a full member of the\nAustrian Academy of Sciences\nin Vienna and shortly before his death he received an appointment as Councillor. He died after a long illness in the prime of his life. Gustav Kohn\n[\n6\n]\nremarks that he was an exceptionally hard worker, producing over\n150\npublications in his short life, and he worked tirelessly almost as if he knew his lifespan was to be short. We end this biography with the following tribute by Gustav Kohn\n[\n6\n]\n:-\nHis lectures at the University of Vienna were plain and unadorned but still of exemplary clarity, so that even the less gifted could follow them easily. If among Austrian middle school teachers geometric knowledge and understanding of the methods of geometry are widely used, that is mostly due to Weyr. He is in many cases also to be thanked for the fact that, during his time in Vienna, Austria has experienced a very significant increase in effective scientific mathematical production, which can be clearly seen in the respective volumes of the proceedings of the Vienna Academy of Sciences, where mathematical work occupies a large part and constitutes mainly geometric investigations on the subject. The greater part of these studies is due to him and his students, among whom the only one preceding him in death, Adolf Ameseder\n(1858\n-\n1891)\n, may be mentioned here by name.",
  "math_areas": [
    "Geometry",
    "Number Theory"
  ]
}