{
  "nome_completo": "Emilio Baiada",
  "nome_curto": "Emilio Baiada",
  "ano_nascimento": "1914",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baiada/",
  "lugar_nascimento": "Tunis, Tunisia",
  "lugar_morte": "Modena, Italy",
  "biografia": "Emilio Baiada\nattended the Scuola Normale Superiore di Pisa where he studied for his laurea with\nLeonida Tonelli\nas his thesis advisor. The laurea was the highest degree in Italy at the time - it required the candidate to submit a dissertation and was essentially a doctorate. Not only did Baiada receive the laurea but he was awarded the Michel Prize for best dissertation. After receiving the degree in June\n1937\n, he worked as\nTonelli\n's assistant at the Scuola Normale Superiore di Pisa from\n1938\nto\n1941\n, publishing papers such as\nOsservazioni sulla misurabilità secondo Carathéodory\nⓉ\n(\nComments on measurability according Carathéodory\n)\n(1939)\nand\nSopra un problema di Mayer\nⓉ\n(\nOn a problem of Mayer\n)\n(1940)\n. In\n1940\nhe received the Merlani Award for \"contributions relating to the calculus of variations\". At this point, Italy having entered World War II, he was called up for military service.\nNormally military service lasted two years but, with World War II in progress, it was often the case that people remained in military service until the war ended and, in Baiada's case, this is what happened. However, he was still able to submit some work for publication during the war years: for example\nUn problema non regolare del calcolo delle variazioni\nⓉ\n(\nA non-regular problem in the calculus of variations\n)\n(1942)\n,\nSul teorema d'esistenza per le equazioni alle derivate parziali del primo ordine\nⓉ\n(\nOn the existence theorem for partial differential equations of the first order\n)\n(1943)\n,\nSur problema di Cauchy per le equazioni alle derivate parziali\nⓉ\n(\nOn the Cauchy problem for partial differential equations\n)\n(1943)\nand\nSopra un problema non regolare e un problema isoperimetrico del calcolo delle variazioni\nⓉ\n(\nOn a non-regular problem and an isoperimetric problem in the calculus of variations\n)\n(1944)\n. We note that, because of disruption caused by the war, the papers given as\n1943\ndid not actually appear in print until\n1946\nand the\n1944\npaper only appeared in\n1947\n.\nAfter the war ended, Baiada returned to his position at the Scuola Normale Superiore in Pisa. Although not formally qualified as a lecturer at this stage, nevertheless he taught the analysis courses, namely the theory of functions, calculus, and rational mechanics. In\n1948\nhe qualified as a lecturer in analysis and, at the end of\n1949\nhe obtained leave of absence from the Scuola Normale Superiore and was appointed to a visiting professorship at the University of Cincinnati in the United States. In Cincinnati he worked closely with the analysts\nOtto Szász\nand Charles Napoleon Moore\n(1882\n-\n1967)\n, who was a native of Cincinnati and had been a student of\nMaxime Bôcher\n. Baiada attended the four hundred sixty-fifth meeting of the\nAmerican Mathematical Society\nwhich was held at the University of Cincinnati on Friday and Saturday\n23\n-\n24\nFebruary\n1951\n. Following this he was a member of the Institute for Advanced Study at Princeton where he worked with\nMarston Morse\n. They collaborated on a joint paper\nHomotopy and Homology Related to the Schoenflies Problem\nwhich was published in the\nAnnals of Mathematics\nin\n1953\n.\nIn\n1952\n, after taking part in a competition for the Chair of Analysis at the University of Palermo, Baiada took up the position. He had already worked with\nCalogero Vinti\nso, when he was appointed to Palermo, the two mathematicians began a close collaboration. They jointly published the\n45\n-page paper\nUn teorema d'esistenza della soluzione per un'equazione alle derivate parziali del\n1\n° ordine\nⓉ\n(\nA theorem of existence of the solution for a partial differential equation of\n1\nst order\n)\nin\n1955\nand also\nUn'applicazione della definizione di integrale per stabilire un passaggio al limite sotto il segno\nⓉ\n(\nAn application of the definition of the intergal to determine a passage to the limit under the integral sign\n)\nin the same year. The first of these papers gives an existence theorem for the equation\nz\nx\n=\nf\n(\nx\n,\ny\n,\nz\n,\nz\ny\n)\nz_{x} = f (x, y, z, z_{y})\nz\nx\n​\n=\nf\n(\nx\n,\ny\n,\nz\n,\nz\ny\n​\n)\nusing methods which had been developed by Baiada a couple of years earlier in solving a simpler equation. This was a very active period for Baiada who, also in\n1955\n, published the single-authored paper\nLa limitatezza, gli zeri di una funzione e i coefficienti di Eulero-Fourier\nⓉ\n(\nLimits, the zeroes of a function and the Euler-Fourier coefficients\n)\n.\nAlberto Calderón\nreviewed this paper, writing:-\nThe author uses the results of\nToeplitz\nand\nCarathéodory\nconcerning the coefficients of the\nFourier\n-\nStieltjes\nseries of a non-decreasing function and some theorems of\nGhizzetti\nconcerning the coefficients of a function between given bounds in order to characterize functions which are i\n)\nnon-negative, ii\n)\nwith values between\n0\nand\n1\n, iii\n)\npositive and bounded away from zero. Further the author gives necessary and sufficient conditions\n(\nalso in terms of the\nFourier\ncoefficients\n)\nin order that, given a function of bounded variation, it be possible to decompose\n(0\n,\n2)\ninto m intervals over each of which the function is non-negative or non-positive. It is shown that a theorem of\nHurwitz\nconcerning the number of zeros of a continuous function of bounded variation whose first\n2\nk+\n1\nFourier\ncoefficients vanish is a consequence of these results.\nBaiada also did important work with\nVinti\non perimeters of sets. They presented some of their results on this topic in the paper\nGeneralizzazione non markoviana della definizione di perimetro\nⓉ\n(\nNon-Markov generalization of the definition of perimeter\n)\ngiven at the Celebrazioni Archimedee del Sec. XX in Syracuse  in\n1961\n. It is worth noting that this was just one of three jointly authored papers that Baiada published in the Proceedings of this Syracuse conference. Baiada left Palermo in\n1961\nand moved to Modena in when he was appointed Professor of Mathematical Analysis at the University of Modena. At Modena he worked hard to bring the Institute of Mathematics up to an international centre of excellence. He also built up the library of the Institute and raised the standard of the Mathematical Seminar there.\nWe have mentioned some of Baiada's publications above but we note that his output totals\n60\nscientific publications on a wide range of different fields in analysis: ordinary and partial differential equations,\nFourier series\nand the series expansion of orthonormal functions, topology, real analysis, functional analysis, calculus of variations, measure and integration, optimisation, and the theory of functions.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}