{
  "nome_completo": "Enrico Bombieri",
  "nome_curto": "Enrico Bombieri",
  "ano_nascimento": "1940",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bombieri/",
  "lugar_nascimento": "Milan, Italy",
  "lugar_morte": null,
  "biografia": "Enrico Bombieri\nbecame interested in mathematics when he was young. In\n[\n2\n]\nthe authors write:-\nLike a number of other mathematicians, Bombieri became interested in mathematics at a fairly early age. At\n13\n, for example, he was studying a textbook in\nnumber theory\n.\nBombieri studied with\nG Ricci\nin Milan and then went to Trinity College, Cambridge where he studied with\nH Davenport\n.\nBombieri was awarded a\nFields Medal\nfor his outstanding work at the International Congress of Mathematicians held in Vancouver in\n1974\n. The award was made for his major contributions to the study of the\nprime numbers\n, to the study of univalent functions and the local\nBieberbach\nconjecture, to the theory of functions of several complex variables, and to the theory of\npartial differential equations\nand minimal surfaces. In particular for his work on\nSergei Bernstein\n's problem in higher dimensions.\nChandrasekharan in\n[\n3\n]\ndescribes Bombieri's contributions to the distribution of primes, to univalent functions and the local\nBieberbach\nconjecture and to functions of several complex variables. He writes:-\nFirst among Bombieri's achievements is his remarkable theorem on the distribution of primes in\narithmetical progressions\n, which is obtained by an application of the methods of the large sieve.\nThe large sieve method was introduced by\nLinnik\nin\n1941\nin his attempts to solve problems posed by\nVinogradov\n. Given an arithmetic progression, the large sieve gives information about the distribution of an arbitrary finite set of integers.\nRényi\ndeveloped\nLinnik\n's large sieve methods further in\n1950\n. Then, in\n1965\n,\nKlaus Roth\nand Bombieri independently sharpened\nRényi\n's results. Bombieri applied his improved large sieve method to prove what is now called \"Bombieri's mean value theorem\", which concerns the distribution of primes in arithmetic progressions.\nIn\n1966\nBombieri was appointed to a chair of mathematics at the University of Pisa. He began to become interested in problems that De Giorgi and his school of geometric\nmeasure theory\nwere working on at the Scuola Normale Superiore in Pisa. They were interested in\nPlateau type problems\nfor spaces of more than three dimensions. Let us indicate the type of problems they were studying.\nFor high-dimensional Euclidean space they were investigating the minimal varieties of the family of submanifolds. These minimal varieties generalise the minimal surfaces in the Plateau problem. The meaning of minimal for a\nk\nk\nk\n-dimensional submanifold\nM\nM\nM\nof an\nn\nn\nn\n-dimensional space is that a sufficiently small piece of\nM\nM\nM\nhas the least volume compared with other\nk\nk\nk\n-dimensional submanifolds\nM\n′\nM'\nM\n′\nwhere\nM\nM\nM\nand\nM\n′\nM'\nM\n′\nhave the same\n(\nk\n−\n1\n)\n(k - 1)\n(\nk\n−\n1\n)\n-dimensional boundary. A minimal hypersurface, that is a submanifold with\nk\n=\nn\n−\n1\nk = n - 1\nk\n=\nn\n−\n1\n, with a given boundary had been shown not to contain singular points for\nn\n≤\n7\nn ≤ 7\nn\n≤\n7\n. Bombieri, working with de Giorgi and Giusti, proved in\n1969\nthat for\nn\n≥\n8\nn ≥ 8\nn\n≥\n8\nthere is a minimal hypersurface with an essential singularity.\nIn contrast to the Plateau problem is the uniqueness problem and the remarkable work described above had implications for this too. In\n1914\nSergei Bernstein\nhad proved that a minimal surface in\n3\n-dimensional Euclidean space of the form\nf\n:\nR\n2\n→\nR\nf: \\mathbb{R}^{2} \\to \\mathbb{R}\nf\n:\nR\n2\n→\nR\n, is a plane. In\n1965\nthis result had been extended by de Giorgi and others to\nn\nn\nn\n-dimensional Euclidean spaces with\nn\n≤\n8\nn ≤ 8\nn\n≤\n8\n. They proved that, for\nn\n≤\n8\nn ≤ 8\nn\n≤\n8\n, a minimal hypersurface of the form\nf\n:\nR\nn\n−\n1\n→\nR\nf: \\mathbb{R}^{n-1} \\to \\mathbb{R}\nf\n:\nR\nn\n−\n1\n→\nR\nis a hyperplane. Bombieri constructed examples to show that in\nR\n9\n\\mathbb{R}^{9}\nR\n9\nthere is a function\nf\n:\nR\n8\n→\nR\nf: \\mathbb{R}^{8} \\to \\mathbb{R}\nf\n:\nR\n8\n→\nR\nwhich is a minimal surface in\nR\n9\n\\mathbb{R}^{9}\nR\n9\nwhich is not a hyperplane.\nThe authors of\n[\n2\n]\ndescribe Bombieri abilities as follows:-\nHe has repeatedly demonstrated an ability to quickly master essentials of a complicated new field, to select important problems which are accessible, and to apply intense energy and insight to their solution, making liberal use of deep results of other mathematicians in widely differing areas. The breadth of his mathematical knowledge is clearly visible to those who know him and his work. He is also a fine writer of mathematics, and his lectures ... are recognised for clarity which increases with the subtlety of the mathematical idea being explained.\nChandrasekharan, in\n[\n3\n]\n, writes:-\n... Bombieri's versatility and strength have combined to create many original patterns of ideas which are both rich and inspiring.\nBombieri was awarded the Balzan International Prize in\n1980\n. Bombieri was elected a foreign member of the French\nAcademy of Sciences\nin\n1984\n. The article\n[\n4\n]\ndescribes Bombieri's work which led to his election.\nBombieri now works in the United States. In\n1996\nBombieri was elected to membership of the\nNational Academy of Sciences\n. The citation for him read:-\nBombieri is one of the world's most versatile and distinguished mathematicians. He has significantly influenced number theory,\nalgebraic geometry\n, partial differential equations, several complex variables, and the theory of finite\ngroups\n. His remarkable technical strength is complemented by an unerring instinct for the crucial problems in key areas of mathematics.\nIn addition to the awards mentioned above, Bombieri received the Feltrinelli Prize in\n1976\n, the Cavaliere di Gran Croce al Merito della Repubblica, Italy in\n2002\n, and the Premio Internazionale Pitagora from the City of Crotone in Italy in\n2006\n. Jointly with Walter Gubler, Bombieri was awarded the\n2008\nDoob Prize at the\n114\nth\nAnnual Meeting of the\nAmerican Mathematical Society\nin San Diego in January\n2008\n. The award was made for the book\nHeights in Diophantine Geometry\njointly authored by Bombieri and Gubler. The citation for the prize reads:-\nThe book is a research monograph on all aspects of Diophantine geometry, both from the perspective of arithmetic geometry and of transcendental number theory. ... One gets the sense that every lemma, every theorem, every remark has been carefully considered, and every proof has been thought through in every detail. There are well-chosen illuminating examples throughout every chapter. The book is a masterpiece in terms of its original approach, its unrivalled comprehensiveness, and the sheer elegance of the exposition. There can be no doubt that this book will become the basis for the future development of this central subject of modern mathematics.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}