{
  "nome_completo": "Enzo Martinelli",
  "nome_curto": "Enzo Martinelli",
  "ano_nascimento": "1911",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Martinelli/",
  "lugar_nascimento": "Pescia, Pistoia, Tuscany, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Enzo Martinelli\n's father was the director of the Scuola Agraria, in Pescia. In July\n1907\nthe Parliament of the Kingdom of Italy had approved the opening of various schools of agriculture and the Scuola Agraria in Pescia opened in\n1908\n. Enzo's father left Pescia and moved to Rome when he was appointed Director General of the Ministry of Public Instruction. It was in Rome that Enzo was educated, attending the Torquato Tasso classical secondary school there. This school, one of the oldest high schools in Rome, was established in\n1887\nand named after the\n16\nth century Italian poet. When Enzo attended the school it was situated in the Via Sicilia. He graduated from the high school in\n1929\nand entered the La Sapienza University of Rome.\nHe studied at La Sapienza where he was taught by many leading scientists, for example\nFrancesco Severi\n,\nGuido Castelnuovo\n,\nFederigo Enriques\n,\nEnrico Bompiani\n,\nTullio Levi-Civita\n,\nMauro Picone\nand the mathematical physicist Antonio Signorini\n(1888\n-\n1963)\n. He was advised by\nFrancesco Severi\nand published his first mathematics paper in\n1931\n, namely\nSulle aree delimitate da linee cicloidali\nⓉ\n(\nOn areas delimited by cycloidal lines.\n)\n. In this paper he studied a plane, closed, convex curve which rolls without sliding on a fixed curve in the same plane. While an undergraduate, he received the Cotronei Award for the best scholar of his year. In\n1933\nMartinelli was awarded his laurea for his thesis\nSulle funzioni poligene di una e di due variabili complesse\nⓉ\n(\nOn the polygenic functions of one and two complex variables\n)\n. He was awarded several prizes following the award of his laurea, namely the\nBeltrami\nFoundation Award, and the prestigious\nFubini\nand Torelli Prizes which he shared with Pietro Buzano\n(1911\n-\n1993)\n. Buzano had been awarded his laurea from the University of Turin in\n1931\n.\nFollowing the award of his laurea, Martinelli was appointed as an assistant to the chair of Mathematical Analysis, held by\nFrancesco Severi\n. He moved next to be an assistant to the chair of Geometry, held by\nEnrico Bompiani\n. Between\n1936\nand\n1938\nhe published five papers, namely\nSugli insiemi bidimensionali di punti dello spazio fra loro omografici\nⓉ\n(\nOn two-dimensional sets of points and the homogeneous space between them\n)\n(1936)\n,\nSui coni proiettanti da un punto di una superficie di Jordan i rimanenti punti\nⓉ\n(\nOn the cones projecting from one point on a Jordan surface and the remaining points\n)\n(1936)\n,\nLa formula di Cauchy per le funzioni analitiche di due variabili complesse\nⓉ\n(\nCauchy's formula for the analytical functions of two complex variables\n)\n(1937)\n,\nSulle funzioni poligene di due variabili complesse\nⓉ\n(\nOn the polygenic functions of two complex variables\n)\n(1937)\nand\nAlcuni teoremi integrali per le funzioni analitiche di più variabili complesse\nⓉ\n(\nSome integral theorems for the analytic functions of several complex variables\n)\n(1938)\n.\nIn\n1939\nhe was promoted lecturer when he became a \"libera docenza\" in Mathematical Analysis. We have translated \"libera docenza\" as lecturer but it was similar to the German \"\ndocent\n\" allowing the person to teach without being supervised by a professor. At this time Martinelli delivered courses on Analytical Geometry, Algebraic Geometry and Topology. Also in\n1939\nhe joined the National Institute of Higher Mathematics, which had been founded by\nSeveri\n, and he undertook research at the Institute from\n1939\nto\n1946\n. He attended the Second Congress of the Italian Mathematical Union in Bologna from\n4\nto\n6\nApril\n1940\nwhere he delivered the lecture\nIntorno alla teoria delle funzioni biarmoniche e delle funzioni analitiche di due variabili complesse\nⓉ\n(\nOn the theory of biharmonic functions and analytic functions of two complex variables.\n)\n. In\n1943\nRudolf Fueter\ninvited Martinelli to Zürich to give lectures on his recent research. This had been a difficult time for Italy with a Fascist government led by Mussolini which enacted racial laws between\n1938\nand\n1943\n. These were aimed at discriminating against Italian Jews and Martinelli reported that\nFrancesco Severi\npersonally intervened to deny his Jewish colleagues access to the University of Rome's mathematics library after the racial laws went into effect.\nIn\n1946\nMartinelli entered the competition for the chair of Geometria analitica con elementi di Geometria Proiettiva e Geometria Descrittiva con Disegno at the University of Genoa. Giovanni Dantoni\n(1910\n-\n2005)\nand Guido Zappa\n(1915\n-\n2015)\nalso competed for this chair and were placed second and third respectively. Dantoni did not have long to wait for a chair since he was appointed to the chair of geometry at Pisa in\n1947\nand then in\n1954\nbecame a professor at the University of Catania. Zappa was also appointed to a chair in\n1947\n, the chair of analytical geometry at the University of Naples. He later moved to the chair of algebra at Florence. The year\n1946\nwas important for Martinelli in another way for, in that year, he married Luigia Panella in Rome. She was also a mathematician and later became an associate professor in the Faculty of Engineering at La Sapienza University of Rome. They had two children, a son Roberto Martinelli and a daughter Maria Renata Martinelli born in Genoa in\n1949\n. Maria Renata Martinelli became a mathematician, studying at La Sapienza University of Rome receiving her laurea with the thesis\nInterpolazione e approssimazione mediante spline functions\nⓉ\n(\nInterpolation and approximation by spline functions\n)\n.\nHaving been ranked first in the competition for the chair at Genoa, Martinelli took up the appointment in\n1947\n. He remained at Genoa until\n1954\nand during these years he taught courses on Mathematical Analysis, Function Theory and Differential Geometry. In\n1954\nhe returned to Rome when he was appointed to the chair of Geometry in the\nG Castelnuovo\nMathematical Institute, being director of this Institute in\n1968\n-\n69\n. He continued to hold this chair until he retired in\n1984\nbut he continued to serve for another two years until he formally retired and was made professor emeritus in\n1986\n. Giuseppe Tomassini\n(\nborn in Rome in\n1938)\nwas one of Martinelli's students at La Sapienza in Rome graduating with his laurea in\n1962\nand becoming a professor at Pisa, Ferrara and Florence. He recalls his teacher in\n[\n6\n]\nwhere he also describes his major research contributions:-\nThose were the years when disciplines such as Algebra and Topology were virtually absent from university courses. Martinelli was one of the first to evoke the need for a profound renewal of teaching methods and research tools. This naturally led to the problems of his main field of interest, the Theory of holomorphic functions of several complex variables, which a few years earlier, due to the excellent efforts of the French school, had had a rapid development, thanks to the systematic use of the proper methods for such disciplines. Of his organizational activity at that time, there were the seminars held in Rome on the theory of complex spaces, the CIME courses he directed on \"Complex Varieties\" in Varenna in\n1956\n, and particularly important for the geometers of my generation, that on the theme \"Functions and complex varieties\" held since\n1963\nalways in Varenna. During the years\nSeveri\nprovided significant contributions to the theory of holomorphic functions of several variables, Martinelli was fascinated, attracted by both analytical and topological-differential aspects. His works devoted to the analytic theory later complemented those relating to more properly geometric aspects with contributions to\nKähler\nvarieties and the quaternion structure. If we limit ourselves to his most relevant scientific results, the name of Martinelli is linked to the integral representation formulas for holomorphic functions of several variables and their application to residual theory and to the characterization of the trace of a holomorphic function. The representation formulas, extending\nCauchy\n's classical style, were proved by Martinelli in a series of works ranging from\n1937\nto\n1955\n. They express the value of a holomorphic function in an open A of the complex\nn\nn\nn\n-dimensional space by an integral on a suitable\n(\nn\n+\nk\n)\n(n + k)\n(\nn\n+\nk\n)\n-dimensional cycle. They involve nuclei that, unlike the case of a single variable, are not holomorphic. The\n(\n2\nn\n−\n1\n)\n(2n-1)\n(\n2\nn\n−\n1\n)\n-dimensional formula, proved in\n1938\n, was later found in\n1941\nby a pupil of\nBochner\nduring the Ph.D. thesis, and used by\nBochner\nhimself in a work on the extension of holomorphic and meromorphic functions, which appeared in\n1943\n. The affair did not pose any priority issues. Almost certainly, given the times, the two proofs were found independently and the formula is now universally accredited in mathematical literature as\nBochner\n-Martinelli's formula.\nWe can appreciate Martinelli's approach towards teaching by looking at the Preface to his\n1968\ntextbook\nIntroduzione alla teoria dell'omologia e della coomologia. Vol. I\nⓉ\n(\nIntroduction to the theory of homology and cohomology. Vol. I.\n)\n. He writes:-\nI disagree with today's prevailing style, so I have tried to highlight the intuitive ideas that are the basis of abstract developments, and to illustrate the subsequent evolution of these .... For example, in order to be able to provide simple and interesting examples, I soon adopted cellular cross-links, while postponing the justification of their use until later.\nHere is a list of the contents of the book:\nChapter\n1\n: Simplicial and polyhedral complexes.\n(1)\nCells, spheres, simplexes.\n(2)\nOrientations and oriented regions.\n(3)\nFinite simplicial and polyhedral complexes, abstract and in Euclidean space.\n(4)\nSimplicial maps and the simplicial approximation theorem.\nChapter\n2\n: Abstract and infinite complexes.\nChapter\n3\n: Homology of a complex.\n(1)\nDefinition of homology groups.\n(2)\nA digression on Abelian groups.\n(3)\nStructure of the homology groups of a finite complex.\n(4)\nExamples.\n(5)\nSome homological properties of simplicial complexes.\n(6)\nPseudo-manifolds.\n(7)\nNormal bases for the chains of an abstract complex of finite type.\nChapter\n4\n: Chain maps and invariance theorems.\n(1)\nMaps and homotopies of chain complexes.\n(2)\nInvariance of the homology groups under barycentric subdivision.\nChapter\n5\n: Cohomology groups of a complex.\n(1)\nCohomology groups.\n(2)\nCohomology of an abstract complex with coefficients the integers, or a field.\n(3)\nHomology and cohomology of a chain complex.\nJames Milgram writes in a review of this book:-\n... the book is a reasonably well organized introduction to homology theory. In fact, the writing seems very clear. There are many well thought out examples and all in all, this seems a very good book for a quarter or semester level course in algebraic topology. Of special value here is the author's careful exposition in Chapter\n3\n, Section\n2\n, of the main relevant results on abelian groups.\nThe article\n[\n3\n]\nwas written by Martinelli's doctoral student Giovanni Battista Rizza at the time when Martinelli retired. Rizza\n(\nborn in Piazza Armerina in Sicily in\n1924)\nstudied for a doctorate at Genoa advised by Martinelli. Rizza spent almost all his career at the University of Parma where he held the chair of Higher Geometry from\n1979\n. In the article\n[\n3\n]\nhe explains how helpful Martinelli was in giving up his time to help and give advice whenever it was sought. He recalls that, being unable to meet during the week, they had a weekly meeting at Martinelli's home every Sunday afternoon. On one occasion, explains Rizza, Martinelli spent two hours teaching him\nCartan\n's theory of exterior forms.\nMartinelli received many honours for his outstanding contributions. One of the honours he received early in his career was the Prize for Mathematical Sciences from the Italian National Ministry of Education in\n1943\n. This award was given after the possible candidates had been considered by the committee consisting of\nFrancesco Severi\n(\npresident\n)\n,\nUgo Amaldi\nand Antonio Signorini\n(1888\n-\n1963)\n. Signorini was a mathematical physicist, best known for his work on elasticity, who had taught Martinelli when he was an undergraduate. In\n1948\n, while in Genoa, Martinelli was elected to the Accademia Ligure di Scienze e Lettere, an Academy founded in\n1798\nand based in Genoa. He was elected to the\nAccademia dei Lincei\nin\n1961\nand to the\nAccademia delle Scienze di Torino\nin\n1980\n.\nIn addition to his roles in universities, Martinelli had an important role in the national Italian mathematics scene, for example he played an important role in the\nItalian Mathematical Union\nserving for several years on its Scientific Commission. He also served on the Board of Directors of the journal\nAnnali di Matematica\n.\nGiuseppe Tomassini writes\n[\n6\n]\n:-\nDuring his life, his qualities as a gentleman and his gentleness were never diminished, and these characterised him in the years when I had him as a professor.\nAs a final tribute to Martinelli we end with the final sentence from Giovanni Battista Rizza\n[\n5\n]\n:-\nA man of rare intellectual honesty, a generous teacher who was always available, leaves in his numerous students, direct and indirect, and more generally in all those who have known him, a memory destined to last in time.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}