{
  "nome_completo": "Erhard Schmidt",
  "nome_curto": "Erhard Schmidt",
  "ano_nascimento": "1876",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schmidt/",
  "lugar_nascimento": "Dorpat, Russian Empire (now Tartu, Estonia)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Erhard Schmidt\n's father was a medical biologist called Alexander Schmidt. Erhard's university career followed a pattern which was common in Germany at this time, namely that students studied at several different universities as their course progressed. He attended his local university in Dorpat before going to Berlin where he studied with\nSchwarz\n.\nHis doctorate was obtained from the University of Göttingen in\n1905\nunder\nHilbert\n's supervision. His doctoral dissertation was entitled\nEntwicklung willkürlicher Funktionen nach Systemen vorgeschriebener\nⓉ\n(\nDevelopment of arbitrary functions by prescribed schemes\n)\nand was a work on\nintegral equations\n. The main ideas of this thesis appeared in Schmidt's\n1907\npaper which we describe below. After obtaining his doctorate he went to Bonn where he was awarded his\nhabilitation\nin\n1906\n. After leaving Bonn, Schmidt held positions in Zürich, Erlangen and Breslau before he was appointed to a professorship at the University of Berlin in\n1917\n. The appointment was to fill the chair left vacant by\nSchwarz\n's retirement.\nSchmidt arrived at the University of Berlin shortly after the death of\nFrobenius\n, who had jointly led the department with\nSchwarz\n. The other full professor was\nSchottky\n.\nCarathéodory\nwas appointed in\n1918\nto fill\nFrobenius\n's chair and to jointly head mathematics in Berlin with Schmidt. However\nCarathéodory\nwas to spend only one year in Berlin before leaving. Schmidt now had the main responsibility for filling the vacant chair. This proved a difficult task. Schmidt drew up an impressive list of candidates:\nBrouwer\n,\nWeyl\n, and Herglotz in that order. The professorship was offered to each of these in turn, with each turning it down. The next person to be offered the chair was\nHecke\nwho also turned it down. The position was not filled until\n1921\nwhen\nBieberbach\nwas offered the post and accepted it. In this same year\nSchottky\nretired and\nSchur\n, who was already an extraordinary professor in Berlin, was promoted to full professor.\nThe appointments we have discussed were on the pure mathematics side. When Schmidt arrived in Berlin there was no applied mathematics there, the subject being considered more suitable for technical colleges. However Schmidt was the main person who pushed for the founding of an Institute of Applied Mathematics in Berlin. After the Institute was set up Schmidt had to fill the new chair of applied mathematics and the post of Director of the Institute of Applied Mathematics. He was able to engineer a superb appointment in\n1920\nwhen von\nMises\naccepted the two positions.\nOstrowski\nwrote in\n1965\n:-\nOnly with the appointment of\nRichard von Mises\nto the University of Berlin did the first mathematically serious German school of applied mathematics with a broad sphere of influence come into existence.\nCredit for bringing Berlin to this leading role in applied mathematics must chiefly go to Schmidt. Clearly his abilities were recognised outside mathematics for he was appointed Dean for the academic year\n1921\n-\n22\nand the vice-chancellor of the University of Berlin during the years\n1929\n-\n30\n. Despite the university wide nature of this post his wish to continue to promote mathematics is seen from the inaugural address he gave when taking up the post of vice-chancellor: it was entitled\nOn certainty in mathematics\n.\nThe\n1930\ns were difficult years for Schmidt. With the Nazi rise to power in\n1933\nlife became increasingly difficult for Schmidt's Jewish colleagues and\nSchur\n,\nvon Mises\nand several others were forced out of their posts. In\n1951\na meeting was held in Berlin to celebrate Schmidt's\n75\nth\nbirthday.\nHans Freudenthal\n, himself a Jew who had survived the Nazi years, spoke of Schmidt's difficulties through the\n1930\ns\n(\nsee for example\n[\n2\n]\n)\n:-\nIt is so easy to practise the honesty that mathematics demands in mathematics itself. If you don't, you will be punished quickly and bitterly. It is so much more difficult to stick to this virtue, proven with numbers and figures, against humans and friends. That we outside, excluded for years from a hostile Germany, know this, and never doubted on you, this is evident from the large number of contributions from abroad that have reached the editors of the Festschrift.\nIn his reply to\nFreudenthal\n's address Schmidt spoke of his love of the University of Berlin\n(\nsee for example\n[\n2\n]\n)\n:-\nI simply loved my students. And exactly the same is true of the university as a whole. I love the University of Berlin, whether it happens to be in happy conditions or not - this does not change anything. I have loved it from the time I have been in Berlin and I will remain faithful to it.\nIn\n1936\n, when the problems were very difficult, Schmidt was made head of the German delegation to the International Congress of Mathematicians at Oslo. Schmidt held positions of authority at the University of Berlin through these difficult years of Nazi rule. He had to carry through the resolutions against Jews but one of\nBieberbach\n's assistants reported in\n1938\n:-\nI think that Schmidt does not at all understand the Jewish question.\nAfter the end of World War II Schmidt was appointed as Director of the Mathematics Research Institute of the German Academy of Science. He remained in that role until\n1958\n. By that time he had retired from his chair, which he did in\n1950\n, and he has ceased as joint head of the mathematics department, which happened in\n1952\n. Another role which he took on after the end of the war was as the first editor of\nMathematische Nachrichten\n. He had co-founded the journal in\n1948\n.\nSchmidt's main interest was in integral equations and\nHilbert space\n. He took various ideas of\nHilbert\non integral equations and combined these into the concept of a Hilbert space around\n1905\n.\nHilbert\nhad studied integral equations with symmetric kernel in\n1904\n. He showed that in this case the integral equation had real eigenvalues,\nHilbert\n's word, and the solutions corresponding to these eigenvalues he called eigenfunctions. He also expanded functions related to the integral of the kernel function as an infinite series in a set of orthonormal eigenfunctions.\nSchmidt published a two part paper on integral equations in\n1907\nin which he reproved\nHilbert\n's results in a simpler fashion, and also with less restrictions. In this paper he gave what is now called the\nGram\n-Schmidt orthonormalisation process for constructing an orthonormal set of functions from a linearly independent set. He then went on to consider the case where the kernel is not symmetric and showed that in that case the eigenfunctions associated with a given eigenvalue occurred in adjoint pairs.\nWe should note, however, that\nLaplace\npresented the\nGram\n-Schmidt process before either\nGram\nor Schmidt.\nIn\n1908\nSchmidt published an important paper on infinitely many equations in infinitely many unknowns, introducing various geometric notations and terms which are still in use for describing spaces of functions and also in inner product spaces. Schmidt's ideas were to lead to the geometry of Hilbert spaces and he must certainly be considered as a founder of modern abstract\nfunctional analysis\n.\nSchmidt defined a space\nH\nH\nH\nwhose elements are square summable sequences of complex numbers. If\nw\n=\n{\nw\nn\n}\nw = \\{w_{n}\\}\nw\n=\n{\nw\nn\n​\n}\nand\nz\n=\n{\nz\nn\n}\nz = \\{z_{n}\\}\nz\n=\n{\nz\nn\n​\n}\nare two elements of\nH\nH\nH\n, Schmidt defined an inner product by\n(\nw\n,\nz\n)\n=\n∑\nw\nn\nz\nn\n(w,z) = \\sum  w_{n}z_{n}\n(\nw\n,\nz\n)\n=\n∑\nw\nn\n​\nz\nn\n​\n.\nHe defined the norm ||\nz\nz\nz\n|| of the element\nz\nz\nz\nto be the square root of the inner product of\nz\nz\nz\nwith its complex conjugate. He defined orthogonal elements showing that a set consisting of pair-wise orthogonal elements was linearly independent. Again he gave the\nGram\n-Schmidt orthonormalisation process in this setting. He also studied projections and spectral resolutions. What are today called\nHilbert\n-Schmidt operators also appear in this\n1908\npaper. Bernkopf writes in\n[\n1\n]\n:-\nSchmidt's work on Hilbert spaces represents a long step toward modern mathematics. He was one of the earliest mathematicians to demonstrate that the ordinary experience of Euclidean concepts can be extended meaningfully beyond geometry into the idealised constructions of more complex abstract mathematics.\nAfter Schmidt moved to Berlin his interests turned towards topology. He found a new proof of the\nJordan\ncurve theorem which quickly became a classic. Schmidt's interest in topology influenced\nHopf\nand, in\n1929\n, he was an examiner of\nHopf\n's doctoral thesis. Later still Schmidt became interested in isoperimetric inequalities, publishing an important paper on this topic in\n1949\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}