{
  "nome_completo": "Eric Temple Bell",
  "nome_curto": "Eric Temple Bell",
  "ano_nascimento": "1883",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bell/",
  "lugar_nascimento": "Peterhead,  Aberdeenshire, Scotland",
  "lugar_morte": "Watsonville, California, USA",
  "biografia": "Eric Temple Bell\n's parents were Helen Jane Lindsay Lyall and James Bell. James was a fish-curer and fruit grower, a fact which E T Bell did not mention in his autobiographical writings. For some reason he chose to hide the first part of his life, even from his own son and his wife. Eric was the younger of his parents' two sons, the elder being James Redward Bell. He also had a sister Enid Lyall Bell. In\n1884\nthe family left Scotland for the United States where they lived in San José in California. After the death of Bell's father on\n4\nJanuary\n1896\n, Eric returned to Britain with his mother, sister and older brother. From\n1898\nBell attended Bedford Modern School where excellent mathematics teaching gave him his life-long interest in the subject. In particular, his interest in number theory came from this time. He wrote\n[\n21\n]\n:-\nMy interest in mathematics began with two school prizes, one in Greek, the other for physical laboratory, both richly bound in full calf. The Greek prize was\nClerk Maxwell\n's classic on electricity and magnetism, the other, Homer's Odyssey. My cousin got the prize for Greek, I got the other. He read mine, I tried, and failed, to read his. The integral signs were particularly baffling to one who had not gone beyond the binomial theorem for a positive integral exponent. The calculus was not a school subject at the time, so my mother paid for private lessons from a man - the late Edward Mann Langley - who was the best teacher I ever had. From him I learned what\nd\ny\nd\nx\n\\Large\\frac{dy}{dx}\\normalsize\nd\nx\nd\ny\n​\nand\n∫\ny\nd\nx\n\\int  y dx\n∫\ny\nd\nx\nmean. The rest was comparatively easy, and I found myself in possession of a key that unlocks a hundred doors.\nEdward Mann Langley\n(1851\n-\n1933)\ntaught at Bedford Modern School from\n1878\nto\n1918\n. He wrote many mathematics textbooks during these years and founded the\nMathematical Gazette\nin\n1894\n. In\n1902\nBell, but not the rest of his family, returned to the United States. He says in his autobiographical writing that he left England:-\n... to escape being shoved into Woolwich or the India Civil Service.\nHe entered Stanford University in\n1902\n, being awarded an A.B. with honours in mathematics two years later. For the next three years he supported himself in San Francisco teaching at a private preparatory school. On\n18\nApril\n1906\nSan Francisco was hit by a major earthquake. Following the earthquake much of central San Francisco was destroyed by a fire. Bell realised that the boarding house he was living in was about to be destroyed by fire and, to save his precious books, he buried them in the garden. In particular he buried his most treasured number theory book,\nÉdouard Lucas\n's\nThéorie des Nombres\n(1891)\n. His efforts were only partially successful since he did not bury the books deep enough to avoid the extreme heat of the fire. For the rest of his life he kept these treasured books, still readable but badly scorched by the fire. He then studied for his Master's Degree at the University of Washington in Seattle which he entered in\n1907\nhaving been awarded a Denny Fellowship. In the spring of\n1908\nhe was awarded an M.A. and then moved to San José where, in an attempt to make some money, he wrote his first science fiction novel. From\n1909\nto\n1911\nhe taught at Yreka High School in Yreka, Siskayou County in northern California. This school, which had been established in\n1893\n, was destroyed by fire in\n1916\n, five years after Bell left. He received his doctorate from Columbia University in\n1912\n, after one year of study, for the dissertation\nThe Cyclotomic Quinary Quintic\n. In this work Bell further developed\nEisenstein\n's extension of\nGauss\n's determination of the regular polygons constructible with straight edge and compasses only. At Columbia his doctoral work was supervised by Cassius Jackson Keyser\n(1862\n-\n1947)\n. Two years before he received his doctorate, at the end of\n1910\n, Bell married Jessie Lillian Smith Brown who was a widow he had met at Yreka High School where she taught art and commercial subjects. They had one son whom they named Taine Temple Bell, born on\n27\nSeptember\n1917\n. Constance Reid writes in\n[\n62\n]\nthat Bell's wife:-\n... was described as \"putting starch\" into him. To friends they seemed almost like one person. It is thus especially strange that he never told her the details of his family background or his early life.\nTheir son Taine\n[\n62\n]\n:-\n... enjoyed a certain notoriety as a child after he observed a cross on a church steeple and asked what they'd put the plus-sign up there for.\nTaine did not follow his father into mathematics but became a medical doctor. His father was very unhappy and considered his son a failure for not obtaining a Ph.D.\nBell taught mathematics at the University of Washington from\n1912\nbeing appointed first as an Instructor but rose to the rank of Professor over the fourteen years he taught at the university. It was at the University of Washington that Bell gained a reputation as one of the leading mathematicians in the United States. Most of his research was into the theory of numbers, the area of mathematics that he loved most dearly. The\nAmerican Mathematical Society\nawarded him their\nBôcher\nMemorial Prize in\n1924\nfor his memoir,\nArithmetical paraphrases\nwhich had appeared in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1921\n. In\n1922\none of Bell's students began to show remarkable abilities, this student being\nHoward Percy Robertson\n. Having he graduated with his bachelor's degree in\n1922\n,\nRobertson\nbegan studying for his master's degree and took Bell's course on mechanics. Bell wrote to his former student\nHarold Hotelling\n, who had graduated from the University of Washington in\n1919\n, on\n3\nApril\n1922\n(\nsee\n[\n42\n]\n)\n:-\n[\nRobertson\n]\nwas just\n19\nlast month, and he goes through the most difficult problems and theory like a shot. Even complicated set-ups in problems by\nLagrange\n's equations don't bother him in the least ...\nRobertson\nis a prize.\nBell had found the theory of relativity particularly stimulating and gave a course that was taken by\nRobertson\n. Bell confided in\nHotelling\nthat if he had not sunk fifteen years of his life into number theory, he would have loved to undertake research into relativity theory. He did persuade\nRobertson\nthat this was a fascinating topic and, with Bell's encouragement, he went on to make a name for himself in this and related areas.\nIn\n1924\nBell was appointed to the Council of the\nAmerican Mathematical Society\n. He became vice-president of the Society in\n1926\n. The award of the\nBôcher\nPrize, and his growing reputation, saw Bell receive offers of professorships from several universities including the University of Michigan, Bryn Mawr University, and Columbia University. Bell neither accepted nor rejected these offers but tried to keep them open. In the summer\n1925\nhe lectured at the University of Chicago on his research while in the autumn he lectured at Harvard. Chicago tried to entice him to accept a professorship there but in early\n1926\nthe experimental physicist Robert A Millikan from the California Institute of Technology got permission from the University Council to do everything possible to attract Bell to Caltech. Millikan had sought advice on Bell from\nL E Dickson\n,\nG D Birkhoff\nand\nOswald Veblen\nbeginning late in\n1924\n, in particular asking if he was\nNational Academy of Sciences\nstandard.\nDickson\nhad praised him highly, suggesting that Bell would be elected to the\nNational Academy of Sciences\nbefore his colleague\nHarry Bateman\n, while\nG D Birkhoff\nhad been less enthusiastic writing:-\n... outside his specialty, his work is not always of high order.\nAfter an initial approach from Millikan, Bell played off a good offer from Columbia University to get an improved offer from Caltech. After a month negotiating, he accepted an offer from Caltech which was less than that offered by Columbia but he preferred to accept\n[\n42\n]\n:-\n... Millikan's invitation to come to Caltech because the Institute had already acquired a certain cachet in scientific circles and, perhaps just as important, because it was situated on the West Coast.\nHe was appointed professor of mathematics at the California Institute of Technology in\n1926\n, holding that post until illness forced him to retire a year before his death. Dickson's prediction that Bell would soon be elected to the\nNational Academy of Sciences\nproved correct: he was elected in\n1927\n, three years before\nBateman\n. Also in\n1927\nBell was invited to give the\nAmerican Mathematical Society\nColloquium Lecture. He delivered the lecture on 'Algebraic arithmetic'.\nThe Depression made life hard at Caltech as it did everywhere. Bell wrote to\nVeblen\nin\n1931\nexplaining he had no funds to invite him to visit\n(\nsee for example\n[\n42\n]\n)\n:-\nI fear it is out of the question. The financial stringency has hit us hard. The mathematicians never did have any funds available to pay outside lecturers. The one time when we did pay a lecturer, namely\nHarald Bohr\n, was provided for by a crumb dropped from the physicists' banquet. ... I was to have got a new man this year, but the money wasn't forthcoming. In the past they have usually paid railway fare to essential meetings; this year that also is cut out, so I shall have to pay my way to New Orleans. However, this depression can't last forever.\nBell had the honour of being elected President of the\nMathematical Association of America\nand he held the position during the years\n1931\n-\n33\n. As President, he published problems and reviews in the\nAmerican Mathematical Monthly\n.\nBell wrote several popular books on the history of mathematics. He also made contributions to\nanalytic number theory\n, Diophantine analysis and numerical functions. Two concepts which bear his name are the 'Bell numbers' and the 'Bell polynomials'. These were introduced in his papers\nExponential Numbers\nand\nExponential Polynomials\n, both published in\n1934\n. Although he wrote\n250\nresearch papers, including the one which received the\nBôcher\nMemorial Prize, Bell is best remembered for his popular books, and therefore as an historian of mathematics.\nHis book\nAlgebraic Arithmetic\n(1927)\nwas not one of these popular works but an important research monograph.\nL E Dickson\n, reviewing the book writes\n[\n37\n]\n:-\nA central feature is the new presentation of the author's principle of arithmetical paraphrases, which won him the Bôcher prize in\n1924\n, jointly with Professor\nLefschetz\n. ... This original and scholarly book is an honour to American mathematics.\nThe Development of Mathematics\n(1940)\nwas also written at a higher level than his popular works. Bell explained that he had chosen his material for this book:-\n... after consultation with numerous professionals who knew from hard personal experience what mathematical invention means. On their advice, only main trends of the past thousand years are considered, and these are presented only through typical major episodes in each.\nD J Struik\n, reviewing\nThe Development of Mathematics\nwrites:-\nThe experience of the author as a creative mathematician, a teacher and interested colleague has made it possible to place lively comments, pithy summaries and challenging outlooks between an otherwise factual survey of achievements. These surveys have unequal merits, excelling in arithmetic and algebra and in related fields, and losing their completeness somewhat in regions less professionally familiar to the author.\nSee\nTHIS LINK\nfor extracts of reviews of these two books.\nMany of his popular works became classics. At this level Bell wrote books which included\nMen of Mathematics\n(1937)\nand\nMathematics, Queen and Servant of Science\n(1951)\n.\nFor extracts to reviews of these and other popular books by Bell, the reader should consult\nTHIS LINK\n.\nA Broadbent\n, see\n[\n24\n]\n, described Bell and his writing in the following way:-\nHis style is clear and exuberant, his opinions, whether we agree with them or not, are expressed forcefully, often with humour and a little gentle malice. He was no uncritical hero-worshipper being as quick to mark the opportunity lost as the ground gained, so that from his books we get a vision of mathematics as a high activity of the questing human mind, often fallible, but always pressing on the never-ending search for mathematical truth.\nKenneth O May has written:-\n[\nBell's\n]\ninsights and provocative style continue to influence and intrigue professional mathematicians - in spite of their historical inaccuracies and sometimes fanciful interpretations.\nAnother historian of mathematics, Ann Hibner Koblitz, is much less kind in her remarks:-\n[\nBell\n]\nmight well become known to future generations of mathematicians and historians as the legend maker of the history of mathematics. It is to him that mathematicians are largely indebted for distorted impressions of their predecessors.\nRoger L Cooke has written that Bell's description of\nSofia Kovalevskaya\nis an:-\n... infuriatingly patronising, innuendo-laden mistreatment.\nIn addition to popular and high-level books, Bell also wrote many papers in which he gave his strong, often provocative, views on many subjects.\nWe give extracts from eight of Bell's papers at\nTHIS LINK\n.\nBell did not confine his writing to mathematics and he also published sixteen science fiction novels under the name John Taine\n[\n3\n]\n:-\n... the excuse, Bell himself once wrote, being that if these popular novels made money, some publishers might be interested in more serious books.\nGiven the remarkable mathematical output of Bell, it is amazing that he was able to write two or three science fiction books each year. He did this in the Christmas and summer vacations, usually taking only three or four weeks to write each book. He was helped by his wife who typed and edited the books from Bell's manuscripts. Most of his science fiction books were written between\n1920\nand\n1940\n[\n71\n]\n:-\nBell's science fiction is distinguished by its violence. It abounds in overwhelming catastrophes of nature, prehistoric reptilian monsters, men turned into brute beasts and men turned into masses of fungoid growth. All these juicy horrors are described in such hair-raising detail and with such devilish pleasure that Bell's books almost all land in the can't-put-it-down class - even for some of Bell's squeamish academic colleagues who never meant to take them up at all.\nAmong his first works to prove great successes were\nThe Purple Sapphire\n(1924)\n,\nGreen Fire\n(1928)\n,\nThe Greatest Adventure\n(1930)\n, and\nBefore the Dawn\n(1934)\n. Although Bell\n(\nas John Taine\n)\nwas known as one of the leading science fiction writers of his day, these books have not become classics and are today little read.\nMost people knew that Bell and Taine were the same man but the editor of the\nPasadena Star-News\ndecided to make a joke of it by asking John Taine to review E T Bell's\n1934\nbook\nThe Magic of Numbers\n. Taine said in his review that he agreed with the description on the cover of the book that:-\n... with matchless wit and insight, Eric Temple Bell has made 'The Magic of Numbers'  ... a human history ... a living biography of the men who played and play so great a part in one scientific and philosophical development.\nOne reader of the\nPasadena Star-News\nwas not in on the joke and she complained to the editor of the paper saying it was an insult to Dr Bell to have his book reviewed by a science fiction writer!\nFinally we should mention Bell's other interests. He wrote several volumes of poetry, and perhaps this was his greatest love, but he never received any real recognition for it. He tried repeatedly to get them published with little success. Two volumes of poetry,\nRecreations\nand\nThe Singer\nhe published at his own expense. He also loved painting, gardening and raising cats\n[\n71\n]\n:-\nHis paintings, with those of his late wife, cover the walls of his home in Pasadena. The Bell garden, in its heyday, was ablaze with flowers even at that time of year when the neighbors were trying to force up a couple of crocuses. And even the Bell cats seemed somehow bigger and more prolific than most cats.\nBell spent the last year of his life in Watsonville hospital. He had a room there in which he had his books, reprints, novels and his popular mathematics books. However, he spent most of the days reading poetry. Often he would have a kitten on his bed. At first he smoked cigars but after he set the bed on fire he was told that he could only smoke if someone else was in the room. He died in the hospital fifteen days after signing the contract to have\nThe Last Problem\npublished by Simon and Schuster.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}