{
  "nome_completo": "Erich Bessel-Hagen",
  "nome_curto": "Erich Bessel-Hagen",
  "ano_nascimento": "1898",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bessel-Hagen/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Bonn, Germany",
  "biografia": "Erich Bessel-Hagen\n's father was a surgeon. There are a number of incorrect explanations of Bessel-Hagen's name in the literature, so we should explain where the slightly strange name originated. Erich Bessel-Hagen's grandfather had the name of Hagen, but being the son-in-law of\nWilhelm Bessel\n, he decided after\nBessel\n's death to change his name from Hagen to Bessel-Hagen to preserve the name of 'Bessel.' Had he not done so, the family name of Bessel would have died out with\nWilhelm Bessel\n. Although we have given Berlin as Erich Bessel-Hagen's birthplace, this is not quite accurate since he was actually born outside but close to that city.\nBessel-Hagen attended the University of Berlin where he obtained a doctorate working under\nConstantin Carathéodory\n, with some help from\nErhard Schmidt\n. He submitted his thesis on the calculus of variations\nÜber eine Art singulärer Punkte der einfachen Variationsproblerme in der Ebene\nⓉ\n(\nOn a kind of singular points of simple variational problem in the plane\n)\nand was awarded the degree in\n1920\n. Segal writes\n[\n2\n]\n:-\nCarathéodory\nthought Bessel-Hagen's disertation the first important advance in the theory of discontinuous solutions for problems in the calculus of variations since his own work in\n1905\n. While at Berlin, however, Bessel-Hagen had also heard lectures from the famous classicist, Ulrich von Wilamowitz-Möllendorf, and was inspired by him to a life-long devotion to classical antiquity as well. He not only had a wide-ranging knowledge of various areas of mathematics, but also was well versed in classical Greek, Greek philosophy, and the history of Greek mathematics\n.\nAt Berlin, Bessel-Hagen met his fellow student\nCarl Siegel\nand the two became life-long friends. We shall say more of this friendship below. After graduating with his doctorate, Bessel-Hagen was appointed to Göttingen University. Dauben and Scriba write\n[\n1\n]\n:-\nBessel-Hagen spent seven years in Göttingen where he met, among others,\nOtto Neugebauer\n....\nFelix Klein\nhad an exceptionally strong influence on him, for not only did Bessel-Hagen live in\nKlein\n's house, but he was\nKlein\n's private assistant from\n1921\nto\n1923\n.\nDuring this period he published\nÜber die Erhaltungssätze der Elektrodynamik\nⓉ\n(\nOn the conservation laws of electrodynamics\n)\n(1921)\n. Also, in collaboration with\nNeugebauer\nand\nCourant\n, he helped prepare\nKlein\n's lectures on the development of mathematics in the\n19\nth\ncentury for publication. These appeared in\n1926\n, a year after\nKlein\n's death, under the title\nVolesungen über fie Entwicklung der Mathematik im\n19\n. Jahrhundert\nⓉ\n(\nLectures on the development of mathematics in the\n19\nth century\n)\n. Bessel-Hagen was one of a small number who had attended these lectures delivered in\nKlein\n's home.\nThe authors of\n[\n3\n]\ntell of the friendship between\nCarl Siegel\nand Bessel-Hagen during these seven years at Göttingen while Bessel-Hagen was working on his\nhabilitation\n:-\nCarl Siegel\nwas joined in Göttingen by Schaffeld, Erich Bessel-Hagen and Maria\n(\nSiegel's girlfriend from Berlin\n)\n. Braun says that\nSiegel\nand Bessel-Hagen first met as students in Berlin. Bessel-Hagen revered\nSiegel\nfor his mathematical ability, and\nSiegel\nin turn was gratified to be admired by someone he could accept. They were friends all their lives, until Bessel-Hagen's early death in\n1946\n. Bessel-Hagen walked with a slight limp - Braun thought because of polio. Schaffeld,\nSiegel\n, and Bessel-Hagen were united in their attitude towards marriage. Braun writes, \"I do not know which of the three was more decided against ever marrying, but all three remained bachelors, expressing their views on marriage with varying degrees of theatricality.\" Schaffeld and Bessel-Hagen filled very different roles for\nSiegel\n. In later years\nSiegel\nwould drop everything if Schaffeld appeared to go for a walk or go out to a restaurant. ... In contrast,\nSiegel\ncouldn't resist baiting or playing sometimes cruel and humiliating practical jokes on Bessel-Hagen. He would then repent and do something to make it up to him. ...\nSiegel\nhad to review Bessel-Hagen's thesis for habilitation - perhaps as a friend, perhaps in some official capacity. However, it came to him at a time when he was deeply involved in his own research, and Bessel-Hagen's thesis was in a different area.\nSiegel\nfelt burdened, and the longer he neglected the task the more burdened he felt. During this time he was required to travel somewhere by ship. At some point on the voyage\nSiegel\n's feelings overwhelmed him. Though he knew he was in possession of the only copy of the thesis,\nSiegel\nthrew it overboard ... making due note of the coordinates. When he came home ... he told Bessel-Hagen he had done him a favour. It required months of work to reproduce the thesis, and eventually\nSiegel\nstarted feeling bad about what he had done. To make up, he invited Bessel-Hagen on a long vacation to Greece. Braun writes, \"This journey made both of them very happy.\"\nIn\n1927\nBessel-Hagen was appointed to a position at the University of Halle where he assisted\nHelmut Hasse\n. He then moved to the University of Bonn\n[\n1\n]\n:-\nAt\nToeplitz\n's instigation, a salaried Lehrauftrag for \"Mathematics with special consideration of its history and pedagogy\" was established in Bonn and given to Erich Bessel-Hagen for the winter term\n1928\n-\n29\n. ... Bessel-Hagen also played a major role in establishing the historical division, including an important library, as part of the mathematical seminar in Bonn. ... Bessel-Hagen was also involved in editing the works of\nGauss\n. He had particularly close contacts with\nOtto Neugebauer\n, founder in\n1931\nof the Zentralblatt für Mathematik ... Bessel-Hagen wrote more than\n200\nreviews for\nNeugebauer\n's Zentralblatt.\nBéla Kerékjártó\nvisited the University of Göttingen in\n1922\nand attended lectres by Bessel-Hagen. In the following year\nKerékjártó\npublished\nVorlesungen über Topologie\nthe index of which contains a reference to Bessel-Hagen. Turning to the indicated page, there is no mention of Bessel-Hagen. However, there is a diagram of a torus with large handles attached on the sides looking a bit like a face with oversized ears. In fact Bessel-Hagen was renowned for having large ears that stuck out of his head. At first this appears to be a rather cruel joke, but in fact\nKerékjártó\nwas merely following the teaching staff at Göttingen who all made jokes at Bessel-Hagen's expense. His friend\nCarl Siegel\ncertainly played 'cruel and humiliating practical jokes' on him as we indicated above. Segal writes\n[\n2\n]\n:-\nBessel-Hagen seems to have been a somewhat retiring personality who suffered from a severe constitutional illness; photographs show a face accentuated by large glasses. Certainly he was the butt of jokes among his colleagues; ... this author can recall, as a graduate student in the\n1960\ns, hearing his name used as the object of mathematical jokes\n[20\nyears after his death!\n]\n.\nThis behaviour on the part of Bessel-Hagen's colleagues seems all the more cruel given Bessel-Hagen's nature\n[\n2\n]\n:-\nBessel-Hagen, who was a devout Roman Catholic, in fact seems to have been one of the most honourable and honest of men. He seems to have represented the best sort of \"inner emigration\" during the Nazi period. After the great German and Jewish\n(\nbut unreligious\n)\nmathematician\nFelix Hausdorff\nwas retired ... in\n1935\n, Bessel-Hagen seems to have been the only one of his former colleagues to visit him. In the Bonn catalogue of professors issued in\n1968\n,\n[\nBessel-Hagen\n]\nis described with unusual feeling as having been a \"model of the noblest humanity. Unselfish goodness and purity of desire paired in him with an incorruptible love of truth and faithful friendship.\nIn fact Bessel-Hagen was an excellent mathematician who, because of his shyness, did not publish much. This meant that his career was not nearly as successful as it might have been.\nWorld War II was a difficult time for Bessel-Hagen. Although his illness meant that he was excused active service, nevertheless he had been forced to be an air-raid warden. Most of the other mathematicians at Bonn were conscripted so only Bessel-Hagen and Hans Beck remained to teach. This said, of course, most students were also conscripted so they did not have large numbers to teach. After Beck died in\n1942\n, Bessel-Hagen essentially became a one-man department. Teaching materials were hard to come by, for example Bessel-Hagen even had to write to the Rektor of the university requesting writing paper in July\n1941\n. He was asked to send copies of his work to soldiers on the front, but declined saying that he had not written anything that soldiers would find interesting. However, he did contribute to a little book about the University of Bonn which was specifically written to send to soldiers on the front.",
  "math_areas": [
    "Calculus"
  ]
}