{
  "nome_completo": "Erland Samuel Bring",
  "nome_curto": "Erland Bring",
  "ano_nascimento": "1736",
  "ano_morte": "1798",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bring/",
  "lugar_nascimento": "Ausås, Ängelholm, Sweden",
  "lugar_morte": "Lund, Sweden",
  "biografia": "Erland Bring\n's parents were Jöns Bring\n(15\nNovember\n1705\n-\n1762)\nand Kristina Elisabet Lagerlöf. Jöns Bring, the son of Ebbe Bring and Abela Klinthea, was the vicar of Ausås and Strövelstorp. He married Kristina Elisabet Lagerlöf\n(\nborn\n28\nDecember\n1703)\non\n19\nSeptember\n1735\nin Matteröd, Skane County, Sweden. Their first child was Erland Samuel Bring, the subject of this biography. A daughter Anna Christina Bring was born in Ausås on\n5\nJune\n1747\n. Anna Christina married Petrus Joseph Münck, bishop of Lund, and had two children, Elisabeth Sophia Münck and Zacharias Justus Münck. She died in\n1767\n. We note that Jöns Bring was one of six siblings, one of whom was Sven LagerBring\n(1707\n-\n1787)\n. Sven LagerBring\n(\nor Sven Bring or Sven Lager Bring\n)\nwas an historian and for many years professor of history at the University of Lund. He was a major influence on his nephew Erland Bring, the subject of this biography.\nErland Bring studied law at Lund from\n18\nApril\n1750\nand he took the state examination in law in\n1757\n. Following this he served as a lawyer and was a student teacher in the Göta Court of Appeal from\n4\nNovember\n1757\nand at the Svea Court of Appeal from\n20\nDecember\n1760\n. He was then appointed as a notary to Lund University on\n5\nJuly\n1762\n. In this position he did much administrative work for which his legal training stood him in good stead. This brief summary of Bring's career for the first thirty years of his life is somewhat misleading, for it was a career he followed to give himself financial security rather than one in which he was deeply interested. The topics that Bring loved most from an early age were mathematics and history. In addition to these, he was also interested in philosophy. We can see from the details given above that, although he began a career as a practicing lawyer, he moved as soon as he could into an administrative position at Lund University to be in the academic environment that he loved. Although he had not taken courses or written a dissertation in the Faculty of Arts, nevertheless he was awarded a Master of Arts degree from the University of Lund on\n23\nJune\n1766\n.\nThe award of the Master's Degree marks the start of Bring's move to a career teaching philosophy and history. He was appointed as a philosophy lecturer on\n31\nOctober\n1767\nand promoted to senior lecturer on\n13\nOctober\n1770\n. On\n2\nMay\n1778\nhe became a lecturer in history and a professor of history on\n1\nSeptember\n1779\n. The reader may wonder why Bring's biography is being set out in a History of Mathematics Archive. In fact, despite the fact that Bring held positions in law, in philosophy and in history, it is for his contributions to mathematics that he is mostly remembered today. Preserved in the library at Lund there are eight volumes of his hand written mathematical work on\n[\n1\n]\n:-\n... various questions in algebra, geometry, analysis and astronomy, and commentaries on the work of\nDe L'Hopital\n, Christian von Wolf,\nLeonhard Euler\n, and other scholars.\nHe wrote about the geometric construction of airships, a topic of current interest given the public demonstration of a balloon flight by the Montgolfier brothers on\n5\nJune\n1783\n. His most famous work, however, is\nMeletemata quaedam mathematematica circa transformationem aequationum algebraicarum\nⓉ\n(\nOn the mathematics  of  the transformation of certain algebraic equations\n)\n(1786)\nwhich was published at Lund. This work describes Bring's contribution to the algebraic solution of equations. However, all is not as straightforward as it appears as\nJames Joseph Sylvester\nwrites in\n[\n6\n]\n:-\nIn the year\n1786\nErland Samuel Bring, Professor at the University of Lund in Sweden, showed how by an extension of the method of\nTschirnhausen\nit was possible to deprive the general algebraical equation of the\n5\nth\ndegree of three of its terms without solving an equation higher than the\n3\nrd\ndegree. By a well-understood, however singular, academical fiction, this discovery was ascribed by him to one of his own pupils, a certain Sven Gustaf Sommelius, and embodied in a thesis humbly submitted to himself for approval by that pupil as a preliminary to his obtaining his degree of Doctor of Philosophy in the University.\n[\nBring's \"Reduction of the Quintic Equation\" was republished by the Rev. Robert Harley, F.R.S., in the 'Quarterly Journal of Pure and Applied Mathematics,' vol.\n6\n,\n1864\n, p.\n45\n. The full title of the Lund Thesis, as given by Mr Harley\n(\nsee 'Quart. Journ. Math.,' pp.\n44\n,\n45)\nis as follows: \"B. cum D. Meletemata quaedam mathematica circa transformationem aequationum algebraicarum, quae consent. Ampliss. Facult. Philos. in Regia Academia Carolina Praeside D. Erland Sam. Bring, Hist. Profess. Reg. & Ord. publico Eruditoram Examini modeste subjicit Sven Gustaf Sommelius, Stipendiarius Regius & Palmerentzianus Lundensis. Die XIV Decemb., MDCCLXXXVI, L.H.Q.S. -Lundae, typis Berlingianis.\"\n]\nThe process for effecting this reduction seems to have been overlooked or forgotten, and was subsequently re-discovered many years later by Mr\nJerrard\n.\nBring discovered an important transformation to simplify a quintic equation. It enabled the general quintic equation to be reduced to one of the form\nx\n5\n+\np\nx\n+\nq\n=\n0.\nx^{5} + px + q = 0.\nx\n5\n+\np\nx\n+\nq\n=\n0\n.\nThe way he achieved this is as follows. He begins with the quadratic equation\nx\n2\n+\nm\nx\n+\nn\n=\n0\nx^{2} + mx + n = 0\nx\n2\n+\nm\nx\n+\nn\n=\n0\nand makes the substitution\nx\n+\na\n+\ny\n=\n0\nx + a + y = 0\nx\n+\na\n+\ny\n=\n0\nwhere\na\n=\n1\n2\nm\na = \\large\\frac{1}{2}\\normalsize m\na\n=\n2\n1\n​\nm\nand\ny\n2\n=\n1\n4\nm\n2\n−\nn\ny^{2} = \\large\\frac{1 }{4}\\normalsize  m^{2}- n\ny\n2\n=\n4\n1\n​\nm\n2\n−\nn\n. This substitution allows the second highest term in the original equation to be eliminated. In fact, this substitution will eliminate the second highest term for any equation. Bring then considers the general cubic equation\nx\n3\n+\nm\nx\n2\n+\nn\nx\n+\np\n=\n0\nx^{3} + mx^{2} + nx + p = 0\nx\n3\n+\nm\nx\n2\n+\nn\nx\n+\np\n=\n0\n. Using the substitution\nx\n2\n+\nb\nx\n+\na\n+\ny\n=\n0\nx^{2} + bx + a + y = 0\nx\n2\n+\nb\nx\n+\na\n+\ny\n=\n0\nhe\n[\n2\n]\n:-\n... writes down without a proof an explicit equation for y. The coefficient of\ny\n2\ny^{2}\ny\n2\nis rather simple,\nm\n2\n−\nm\nb\n−\n2\nn\n+\n3\na\nm^{2} - mb - 2n + 3a\nm\n2\n−\nm\nb\n−\n2\nn\n+\n3\na\n, but the next coefficient has degree three and nine terms. Bring finds that a linear equation between a and b and a quadratic equation for b gives an equation\ny\n3\n=\nc\no\nn\ns\nt\n.\ny^{3} = const.\ny\n3\n=\nc\no\nn\ns\nt\n.\nHe then goes on to apply the same techniques to quartic equations before moving on to the quintic. Here he is able to apply the same ideas but this time he cannot eliminate all the lower order terms but the best he can do is to reduce the equation to one of the form\nx\n5\n+\np\nx\n+\nq\n=\n0\nx^{5} + px + q = 0\nx\n5\n+\np\nx\n+\nq\n=\n0\n. Now, of course, he has presented a method to solve algebraic equations up to degree\n4\nand he ends his paper by asking the reader to compare his method for the cubic and the quartic with that given by\nCardan\nand decide for himself which is the most interesting.\nThe transformation used by Bring was later discovered independently and generalised by\nGeorge Birch Jerrard\nin\n1832\n-\n35\n. By the time\nJerrard\ndiscovered the transformation,\nRuffini\n's work and\nAbel\n's work on the impossibility of solving the quintic and higher order equations had been published. However, at the time of Bring's discovery, there was no hint that the quintic could not be solved by radicals and, although Bring does not claim that he discovered his transformation in an attempt to solve the quintic, it is likely that this is in fact why he was examining quintic equations.\nIn\n[\n6\n]\nSylvester\nwrites a little on the later developments of these ideas and it seems appropriate to give these below:-\nIn a report contained in the 'Proceedings of the\nBritish Association\n' for\n1836\n, Sir\nWilliam Hamilton\nshowed that Mr\nJerrard\nwas mistaken in supposing that the method was adequate to taking away more than three terms of the equation of the\n5\nth\ndegree, but supplemented this somewhat unnecessary refutation of a result, known 'à priori' to be impossible, by an extremely valuable discussion of a question raised by Mr\nJerrard\nas to the number of variables required in order that any system of equations of given degrees in those variables shall admit of being satisfied without solving any equation of a degree higher than the highest of the given degrees. In the year\n1886\nthe senior author of this memoir\n[\nSylvester\n]\nshowed in a paper in\nKronecker\n's\n(\nbetter known as\nCrelle\n's\n)\n'Journal' that the trinomial equation of the\n5\nth\ndegree, upon which by Bring's method the general equation of that degree can be made to depend, has necessarily imaginary coefficients except in the case where four of the roots of the original equation are imaginary, and also pointed out a method of obtaining the absolute minimum degree M of an equation from which any given number of specified terms can be taken away subject to the condition of not having to solve any equation of a degree higher than M. The numbers furnished by\nHamilton\n's method, it is to be observed, are not minima unless a more stringent condition than this is substituted, viz., that the system of equations which have to be resolved in order to take away the proposed terms shall be the simplest possible, i.e., of the lowest possible weight and not merely of the lowest order; in the memoir in '\nCrelle\n,' above referred to, he has explained in what sense the words weight and order are here employed. He has given the name of\nHamilton\n's Numbers to these relative minima\n(\nminima, i.e., in regard to weight\n)\nfor the case where the terms to be taken away from the equation occupy consecutive places in it, beginning with the second.\nOn\n27\nApril\n1791\nBring married Ingrid Katarina Ringberg\n(28\nNovember\n1749\n-\n7\nJune\n1830)\n, the daughter of Nils Ringberg, who was the vicar of Vasby, and Anna Lovisa Steutner von Sternfeldt.\nFinally, let us say a little about Bring's contributions as an historian. The first thing to note is that he had access to the library of history books and manuscripts owned by his uncle Sven LagerBring. We note that Sven published the major three volume work\nHistory of Sweden\n(1769\n-\n1776)\n. It is also worth noting that Sven LagerBring undertook a great deal of research but it is considered defective both in style and method. We relate this to explain that his influence on Bring was not the most positive and, perhaps as a consequence, Bring's work on history is not considered to be important. Bring's research contributions to history were mainly a continuation of his teaching and these were at a rather elementary level.\nHe contributed to\nDissertatio gradualis de Territorio Bara\nⓉ\n(\nDissertation on the territories of Bara\n)\n(\nBara Härad\n)\n(1796)\n. Perhaps his most important historical work is\nCommentarii de vita academica, quam Londini Gothorum degit Samuel Pufendorf\nⓉ\n(\nCommentaries on the academic life: when Samual Pufendorf lived in London\n)\n(1781)\nwhich is useful because of the extensive knowledge that Bring had of the archives of the university through his time at a notary. His biography of Andreas Rydelius was completed in\n1782\nbut only published in\n1806\nafter Bring's death. We note that Andreas Rydelius\n(1671\n-\n1738)\nwas a philosopher and the bishop of Lund from\n1734\nuntil his death.\nIn\n1790\nBring was rector of the university. As his health deteriorated with increasing chest problems, he made strenuous efforts to keep up all his duties including his teaching and his research. We end this biography by quoting from\n[\n1\n]\n:-\nThe deep significance of the Bring-\nJerrard\ntransformation was ascertained only after\nCharles Hermite\n(1858)\nused the above-mentioned trinomial form for the solution of fifth-degree equations with the aid of elliptic modular functions, thereby laying the foundations for new methods of studying and solving equations of higher degrees with the aid of transcendental functions.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}