{
  "nome_completo": "Ernest Benjamin Esclangon",
  "nome_curto": "Ernest Esclangon",
  "ano_nascimento": "1876",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Esclangon/",
  "lugar_nascimento": "Misson (N of Sisteron), Alpes-de-Haute-Provence, France",
  "lugar_morte": "Eyrenville, France",
  "biografia": "Ernest Esclangon\n's father was François Honoré Esclangon, born on\n27\nSeptember\n1837\nin Sisteron, Alpes-de-Haute-Provence, to parents François Bruno Esclangon\n(1803\n-\n1876)\nand Anne Virginie Richaud\n(1810\n-\n1856)\n. François Honoré was a farmer who later became a landowner. He married Anais Désirée Felix\n(1840\n-\n1865)\non\n24\nApril\n1863\n. François Honoré and Anais Désirée Esclangon had a son Joachim Étienne Esclangon\n(1863\n-\n1945)\nwho married Joséphine Arnoux\n(1867\n-\n1961)\non\n29\nApril\n1886\n; we mention him again below. Anais Désirée died in\n1865\nand, on\n11\nOctober\n1865\n, François Honoré Esclangon married the seamstress Marie Caroline Maigre\n(1845\n-\n1915)\n. François and Marie Esclangon had two sons and two daughters; Honoré Esclangon\n(\nborn\n1871)\n, Ernest Esclangon\n(\nthe subject of this biography, born\n1876)\n, Mazélie Esclangon\n(\nborn\n1876)\nand Louise Esclangon\n(\nborn\n1878)\n. Ernest was born in Misson which consisted of scattered hamlets and buildings in addition to three main villages.\nNow Joachim Étienne Esclangon, Ernest's half-brother, became a schoolmaster at the College in Manosque, the largest town in Alpes-de-Haute-Provence about\n50\nkm south of Sisteron. This school is now known as the Lycée Félix Esclangon, named after Jules Félix Esclangon who was the son of Joachim Étienne Esclangon and born in\n1905\n. Ernest was educated at this school in Manosque before going to the Lycée in Nice to prepare for entry into the Grand Écoles of Paris. It was during his time at the Lycée in Nice that his teachers realised that they had a pupil with outstanding abilities, particularly in mathematics.\nHe studied mathematics in Paris at the École Normale Supérieure, entering the École in\n1895\n, and was awarded his licence in mathematical science and in physical science in\n1897\n. In the following year he graduated with an agregé in mathematical science. He became an assistant astronomer in\n1899\nwhen, looking for a way to fund his doctoral studies in mathematics, he accepted a position offered to him at Bordeaux as assistant to Georges Antoine Pons Rayet\n(1839\n-\n1906)\n. Rayet, the founder of the Bordeaux Observatory, was a leading expert in spectroscopy. It had been only three years earlier, in\n1896\n, that Bordeaux was reconstituted as a university and given autonomy and state financing. Although Esclangon accepted a post at the university observatory, he continued to work on mathematical topics for his doctorate and also taught mathematics at the Faculty of Sciences at Bordeaux University. In\n1902\n-\n03\nhe was in charge of the course on rational mechanics at the Faculty of Sciences. In\n1904\nhe was appointed as Professor at the Colonial Institute of Bordeaux, a position he held for ten years. His doctoral thesis,\nLes fonctions quasi-périodiques\nⓉ\n(\nQuasi-periodic functions\n)\n, published in the\nAnnales de l'Observatoire de Bordeaux\nin\n1904\nwas on quasi-periodic functions. As was standard procedure at the time, candidates for a doctorate had to submit a second thesis and Esclangon's second thesis was\nThéorie des tourbillons\nⓉ\n(\nTheory of vortices\n)\n; it was not published. Lévy writes in\n[\n1\n]\n:-\nQuasi-periodic functions, newly introduced, constitute a remarkable class among the almost periodic functions. Esclangon elaborated a theory for these functions, studied their differentiation and integration, and examined the differential equations which allow them as coefficients. His doctoral thesis established a basis for their employment at a time when their role in mathematical physics was only beginning to be developed.\nIn\n[\n10\n]\nGaiduk shows how Esclangon anticipated many of\nHarald Bohr\n's results on almost periodic functions.\nInese Bula describes in\n[\n4\n]\nhow\nPiers Bohl\nhad contacted Esclangon while he was still working on his doctorate:-\nSeveral years before the translation of his work into French,\nPiers Bohl\nmade the acquaintance of the astronomer E Esclangon from Bordeaux. This happened in the following manner. In\n1902\nthere appeared in Volume\n135\nof Comptes rendus of the\nParis Academy of Sciences\na note written by Esclangon\n(\ncommunicated by\nPaul Painlevé\n)\nentitled 'Sur une extension de la notion de périodicité'\n(\nOn a generalization of the concept of periodicity\n)\n.\nBohl\nread this note and concluded that Esclangon's concept of \"quasi-periodic function\" agreed with the \"periodic function in generalized sense\" that he had defined in his master's dissertation. He shared this with\nPaul Painlevé\nand probably sent him a copy of his dissertation. In\n1903\nBohl found a second note by Esclangon in the \"Comptes rendus\", in which he acknowledged\nBohl\n's priority in the discovery of the new functional class. In the same note Esclangon announced that he had reached independently of\nBohl\nmany results, discussed the differences between the two works, and presented several new results.\nBohl\nwas very pleased with this response; in the subsequent correspondence between him and Esclangon he shared his ideas on various new research results and commented very favourably on Esclangon's scientific projects.\nIn\n1905\nEsclangon was promoted to Deputy Astronomer at the Bordeaux Observatory. He was also appointed as Maître de conférences\n(\nassistant lecturer\n)\nin analysis and mechanics and adjoint professor in the Faculty of Sciences of Bordeaux. Among the papers he published over the following years are\nÉtude sur l'orientation de la queue de la comète de Halley: sa rencontre avec la Terre en ma\n1910\nⓉ\n(\nStudy on the direction of the tail of Halley's comet: its encounter with the Earth in\n1910\n)\n(1911)\n,\nÉtude sur la réfraction astronomique: réfractions différentielles, déformations absolues et relatives, déformations photographiques\nⓉ\n(\nStudy on the astronomical refraction: differential refractions, absolute and relative deformations, photographic distortions\n)\n(1913)\n,\nSur un régulateur de température\nⓉ\n(\nOn a temperature controller\n)\n(1913)\n,\nSur l'entraînement du support dans les observations du pendule\nⓉ\n(\nOn the construction of the support in observations of a pendulum\n)\n(1913)\n, and\nL'Energie rayonnante et les bases physiques de l'Héliothérapie\nⓉ\n(\nRadiant energy and the physical basis of heliotherapy\n)\n(1914)\n.\nHe continued to hold the posts mentioned above until World War I broke out in July\n1914\n. France began mobilising its troops by the beginning of August. It was in September that Esclangon presented his ideas to the Service Géographique de l'Armée on pinpointing the position of an enemy gun from the sound of it firing. The Service Géographique had, at this time, withdrawn to Bordeaux. Esclangon was conscripted into the\n55\nth Infantry Regiment and was assigned to the commission for naval artillery, part of the ballistics and sound ranging service. Early in\n1915\nhe was sent to Gâvres, Ille-et-Vilaine, where the naval artillery was stationed. His important mathematics paper,\nSur les intégrales bornées d'une équation différentielle linéaire\nⓉ\n(\nOn the integrals bounded by a linear differential equation\n)\n, was published in\nComptes rendus\nin\n1915\n.\nThere were many problems which had to be solved before Esclangon's idea of using triangulation to pinpoint gun positions could work in practice. To solve these he undertook experiments and constructed equipment. When a missile is fired there are two shock waves emitted, one being a spherical wave at the instant of firing which was centred at the position of the gun, while the other was a conical shock wave from the projectile. By\n1916\nhe had devised a method to calculate the position from which the projectile was fired very accurately allowing enemy gun locations to be targeted. Esclangon's ideas are described in\n[\n17\n]\n:-\nThe principle of the sound-ranging which was developed by Esclangon, and employed against hostile guns in the late War, will be familiar to most. The arrival of the sound was recorded at a number of stations\n(\nat least three\n)\nbehind the front. The registration was made electrically on a common strip, so that the differences of the instants of arrival at the stations were known. From these times the position of the gun was located as the intersection of two lines on a map. The method, so simple in principle, was not made a practical success without several years of experimenting. The main obstacle to its perfection was that the sound actually made by the firing - the 'onde de bouche' - is an almost inaudible pulse consisting of a large movement of the air of small duration and low frequency, whereas the sound propagated from the projectile itself in its flight, which precedes the arrival of the 'onde de bouche' at a station in the line of fire, is of high frequency and easily picked up by a microphone. In order to make the recording apparatus ignore this high-frequency 'onde de choc', and make a large response to the sound propagated from the gun itself, it was necessary to use as recorder a vessel of large capacity and inertia, the air in which was set in motion by the wave of slow-period, but not by the rapid oscillations due to the 'onde de choc'. Since the method depends on an accurate knowledge of the velocity of sound in air under the conditions prevailing, it is open to error, the principal source of error being that the velocity increases with the amplitude of the disturbance, so that in the immediate neighbourhood of a gun of large calibre the sound is travelling faster than normal, until the amplitude of the wave is reduced by spreading-out and the normal velocity is reached.\nIt is worth noting that General Erich Ludendorff, German Quartermaster General from\n1916\nto\n1918\n, states in his memoirs\nLudendorff's Own Story\n(1920)\nthat Esclangon's device was one of the main reasons that the Allies defeated the Germans. The Paris Academy of Sciences awarded Esclangon their Baron de Joest prize in\n1917\n:-\n... for his researches on the sound phenomena produced by cannon and projectiles.\nHe became professor of astronomy at the Faculty of Sciences at Strasbourg in\n1919\n, having been appointed director of the Observatory there in the previous year. In\n[\n11\n]\nHélène Gispert and Juliette Leloup quote from a notice that Esclangon wrote in\n1929\nabout his move to Strasbourg:-\nAfter the armistice, I was sent to Strasbourg as director of the Observatory and professor of astronomy. The reorganization of the observatory equipment was difficult at this time, firstly, because of industrial and economic disruption, and, secondly, because of very great staff recruitment difficulties .... At present this reorganization is completed.\nAlthough Esclangon had staff recruitment difficulties, he did have the help of André Danjon\n(1890\n-\n1967)\nin his reorganisation of the Strasbourg Observatory. Danjon had, like Esclangon, served in the military during World War I and was appointed as an astronomer at the Strasbourg Observatory in\n1919\n. He would be appointed as its director after Esclangon left Strasbourg in\n1929\n.\nOf course, one of the major topics arousing attention in astronomy during his years in Strasbourg was attempts to verify\nEinstein\n's general theory of relativity by making observations of the deviation of light passing close to the sun.\nEddington\nhad made observations during an eclipse in\n1919\nand\nFreundlich\nwas also much involved in arguments about whether\nNewton\n's theory had to be abandoned in favour of general relativity. In\n1924\nEsclangon published\nSur la déviation einsteinienne des rayons lumineux par le soleil\nⓉ\n(\nOn Einsteinian deflection of light by the sun\n)\nin which he stated his thoughts on the experimental evidence:-\nThe true conclusion to draw is that these observations are still powerless to elucidate the question. They neither confirm nor disprove\nEinstein\n's deflection law. They suggest only, if you can really rule out any hypothesis of systematic errors, the existence of deviations near the Sun without being able to fix the law, nor the exact size at the edge of the sun.\nHowever, despite being a leading astronomer, he did not give up his work on quasi-periodic functions and published a major work\nNouvelles Recherches sur les Fonctions quasi-périodiques\nⓉ\n(\nNew research on quasi-periodic functions\n)\nin\n1921\n. Ideas in this paper are discussed by\nEdmund Landau\nin\n[\n13\n]\n.\nThen, from\n1929\nto\n1946\nhe was director of the Observatory at Paris, again holding the position of professor of astronomy from\n1930\nto\n1946\n.\nThe range of topics on which Esclangon worked during his career is quite remarkable. These include\n[\n1\n]\n:-\n... pure mathematics, applied celestial mechanics, relativity, observational astronomy, instrumental astronomy, astronomical chronometry, aerodynamics, interior and exterior ballistics, and aerial and underwater acoustic detection.\nIn astronomy he worked on making observations more precise by improving astronomical instruments. He is particularly famous in this area for his brilliant ideas on improving the design of a transit instrument. One of the first projects he worked on after moving to Paris was the new idea that the solar system was moving through space\n[\n22\n]\n:-\nEsclangon found peculiarities in the location of stars that can be explained by a motion of the solar system. The French astronomer also found evidence for the motion in observations of stars passing behind the moon, earth tides and ocean tides. By studying the reflection of light from a mirror, Esclangon found strong evidence for an \"optical dissymmetry of space\" which can be explained by an ether drift.\nIn\n1933\n, using an astronomical calculation of time, he started the 'talking clock' telephone service in Paris. This work was carried out in his role as Director of the Bureau International de l'Heure which he held from\n1929\nto\n1944\n[\n14\n]\n:-\nAt the Paris Observatory, Esclangon responded creatively to an increasing demand from citizens to obtain the proper time by telephone. He created the first \"talking\"\n(\ni.e., automatic self-announcing\n)\nclock. Esclangon broadcasts the time through a series of photoelectric cells, which activated 'pistes sonores' located on a rotating cylinder. The corresponding \"blips\" were issued from a synchronous clock, driven in turn by a fundamental clock at the observatory. The time service was inaugurated on\n14\nFebruary\n1933\n, and immediately the number of calls jumped to more than several thousand per day. The accuracy of the time provided on the telephone was better than\n0\n.\n1\ns.\nHe published the paper\nL'horloge parlante de l'Observatoire de Paris\nⓉ\n(\nThe speaking clock of the Paris Observatory\n)\nin\n1946\n.\nThe years of World War II were extremely difficult and he continued to hold his positions in Paris through the time of the German occupation. On\n5\nJune\n1940\nGermany invaded France with Panzer divisions moving rapidly south and west bypassing the Maginot line. On that day Esclangon considered operating the speaking clock from Bordeaux to continue to give an accurate time to the radio if Paris fell to the advancing Germans. However, after further consideration, on\n23\nJune the Observatory stated that:-\n... the effort is on the maintenance and continuity of the time service .... The speaking clock of the Paris Observatory will be restarted and everyone can use the phone as before.\nThis statement was made one day after France surrendered to Germany. We note that the Paris Observatory speaking clock continued to operate until\n1966\n. Esclangon retired as Director of the Paris Observatory and as Professor of Astronomy at the Sorbonne in\n1946\n. At this time, he was made Honorary Director of the Paris Observatory and Honorary Professor of Astronomy at the Sorbonne. He continued to write papers and his book\nHistoire de l'astronomie\nⓉ\n(\nHistory of astronomy\n)\nwas published the year after he retired.\nHis last paper,\nLa Vie serait-elle possible à bord de satellites artificiels de la terre ou de projectiles astronautiques?\nⓉ\n(\nWould life be practicable on artificial Earth satellites or astronautical projectiles?\n)\n(1950)\n, looked at the mechanics of the orbit of an artificial satellite of the earth. This was not his first paper on this topic having published works such as\nSur la transformation en satellites permanents de la terre de projectiles auto-propulsés\nⓉ\n(\nOn the transformation into permanent earth satellites of self-propelled projectiles\n)\n(1947)\nand\nÉtude sur les satellites artificiels et éventuels de la Terre\nⓉ\n(\nStudy of artificial satellites and the gravitation of the earth\n)\n(1949)\na few years earlier.\nEsclangon was honoured with election to the\nAcadémie des Sciences\nin\n1929\nand the Bureau des Longitudes in\n1932\n. He was elected president of the International Astronomical Union in\n1935\nand held this position until\n1938\n.\nLévy writes in\n[\n1\n]\n:-\nHe assumed his official functions with simplicity and amiability; he was affable and loved to joke, and did not deny himself leisure time. It would almost seem that he accomplished his body of important work without effort.\nThis is even more remarkable when one realises that during his career he wrote\n247\nscientific papers.\nLévy ends his biography\n[\n14\n]\nas follows:-\nEsclangon lived in the village Eyrenville, where he owned a house in which he installed a water mill to provide electricity. He rode an old bicycle, which made such a noise that the citizens were preinformed of his arrival. They much appreciated Esclangon's kindness, simplicity, and the accuracy of his weather forecasts.\nThe binary asteroid\n1509\nEsclangona is named after him as is the lunar crater Esclangon. On\n22\nJune\n1965\nthe Paris street previously named Ornano, was named for Esclangon.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}