{
  "nome_completo": "Ernst Julius Amberg",
  "nome_curto": "Ernst Julius Amberg",
  "ano_nascimento": "1871",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Amberg/",
  "lugar_nascimento": "Zürich, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Ernst Julius Amberg\n's parents both descended from old farming families, but moved to Zürich after their wedding. In one funeral speech\n[\n5\n]\na brother, Heinrich, is mentioned, but we do not know of any other siblings. Amberg attended the\nGymnasium\n, being top of the class in his Matura examinations. He studied mathematics at the Polytechnic and obtained a diploma as a mathematics teacher in\n1894\n. Three years later, in\n1897\n, he received his doctorate from the University of Zürich for his thesis\nÜber einen Körper, dessen Zahlen sich rational aus zwei Quadratwurzeln zusammensetzen\nⓉ\n(\nOn numbers rationally composed over a field containing two square roots\n)\n. His supervisors were the astronomer Alfred Wolfer\n(1854\n-\n1931)\nand\nAdolf Hurwitz\n. In\n1947\n, his doctorate was renewed to celebrate its\n50\nth\nanniversary  as is possible in certain German, Swiss and Austrian universities so as to honour the recipient's work since completing their PhD.\nAt the time of the ICM Amberg was an assistant at the Polytechnic, before becoming a teacher at the Kantonsschule in Frauenfeld\n(\ncanton Thurgau\n)\n. In\n1903\nhe became\nGröbli\n's successor at the Gymnasium in Zürich, teaching mathematics. He held this post until\n1938\n; he also served as the school's director from\n1916\n-\n1938\n. During the Second World War, so a few years after his retirement, he worked as a substitute teacher in various Gymnasiums.   Amberg, the 'small, stocky mathematics teacher with firm footsteps'\n[\n3\n]\nseems to have loved teaching, and wanted to make mathematics accessible to weaker pupils, too. While his classes are praised, 'the pupils, on their part, probably were a bit frightened of the strictness of their rector'\n[\n3\n]\n. Among his pupils was\nAlbert Einstein\n's second son Eduard. In a letter to his father from September\n1921\n, concerning their holiday, Eduard comments that 'the rector\n[\nAmberg\n]\nis not amused about this kind of skiving'\n[\n4\n]\n. In a letter to his wife from May\n1901\n,\nAlbert Einstein\nhimself comments that Amberg recommended him as a teacher to Jakob Rebstein, who seems to have asked\nEinstein\nto come to teach at the Polytechnic\n[\n2\n]\n.\nBefore starting his teaching post in Zürich, Amberg also took on a job as an actuary at a life insurance company. He worked for insurance and reinsurance companies alongside his school duties throughout most of his life, and continued to write expert opinions even after his retirement.\nIn\n1912\nhe also became assistant professor for mathematics and analytic geometry at the ETH, and was promoted to Titularprofessor in\n1918\n. Furthermore, he also lectured on teaching skills for mathematics both at the ETH and at the University of Zürich. Amberg lectured at the ETH until his retirement in\n1938\n.   It seems that he did not publish much apart from his thesis. The ETH-Library holds an expertise that he wrote in\n1906\n:\nFinanzielle Tragweite einer Alters- und Invaliden-Versorgung der Beamten und Angestellten der Stadt Zürich\nⓉ\n(\nFinancial implications of retirement and disability-benefits of civil servants and employees of the City of Zurich\n)\n. He seems to have been a member of a committee investigating general education\n(\nthe committee's report was published in the\nSchweizerische Bauzeitung\nin\n1951)\n. In\n1933\nhe published an article on how future mathematics teachers were educated at the Polytechnic and the University of Zürich.\nAmberg was a keen mountaineer and a member of the Swiss Alpine Club\n(\nSAC\n)\nfor\n61\nyears. For six years he served as president of the Uto section, i.e. the Zürich section of the SAC. Together with Anton Züblin he was the first to climb Piz Gannaretsch\n(3040\nm\n)\nand Piz Vatgira\n(2983\nm\n)\n, both in canton Grisons. Furthermore, he also served as an officer in the Swiss army.\nAmberg joined the organising committee of the First International Congress of Mathematicians in November\n1896\n: Rebstein, the German-speaking secretary, could not attend the meeting on\n12\nNovember and Amberg covered for him. He joined the committee then. In May\n1897\nhe joined the sub-committee that chose the plenary speakers and ensured a fair distribution of languages. This sub-committee already consisted of\nGeiser\n,\nHurwitz\nand\nMinkowski\n, and\nFranel\njoined together with Amberg. At the meeting on\n27\nJuly\n1897\nAmberg was elected secretary, thus replacing Rebstein who had to step down from his post due to military service. Amberg's deputy was Hirsch. Furthermore, Amberg was in charge of setting the fees. He did not give a talk at the congress, but was elected secretary of section I: Arithmetic and Algebra.\nAs headmaster of the Gymnasium Zürich Amberg was an official Swiss delegate at the\n1932\nICM in Zürich. Furthermore, he was one of the Swiss delegates at the ICMI meeting in the same year.\nAmberg was married, but did not have any children.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}