{
  "nome_completo": "Friedrich Wilhelm Karl Ernst Schröder",
  "nome_curto": "Ernst Schröder",
  "ano_nascimento": "1841",
  "ano_morte": "1902",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schroder/",
  "lugar_nascimento": "Mannheim, Baden (now Germany)",
  "lugar_morte": "Karlsruhe, Germany",
  "biografia": "Ernst Schröder\n's parents were Heinrich Georg Friedrich Schröder and Karoline Walther. They were married on\n9\nSeptember\n1840\nin Haunsheim, a district of Dillingen in Bavaria. Heinrich Schröder was born in Munich on\n28\nSeptember\n1810\n, studied at the University of Munich and became a professor of physics in high schools. He worked first at the Polytechnic School in Munich, then the Lyceum in Solothurn and, at the time Ernst was born, he was professor of physics and chemistry at the Higher Bürgerschule in Mannheim. He was very influential in encouraging the teaching of science in the\ngymnasiums\nand colleges in the district. His wife Karoline was the daughter of a pastor from Haunsheim and her father, Johann Gottfried Walther\n(1785\n-\n1852)\n, tutored Ernst for two years when he was young. In fact Ernst lived with his grandfather during these two years. The Rev Walther gave his grandson an exceptionally good basic education with particular emphasis on the study of Latin. Of course Ernst's father was also a big influence on his son and, given what we have said about the work Heinrich Schröder did in fostering science education, it will come as no surprise to learn that he was a major influence on his son taking up a career in science. Ernst was the eldest of his parents four children: Clara was born in\n1842\n; Heinrich was born in\n1845\nand became the director of a bank; and Walter was born in\n1850\nand became a businessman. After tutoring by his grandfather, Ernst studied at several different schools in Mannheim where he showed exceptional abilities in languages, chemistry, and mathematics. In\n1856\n, when he was fifteen years old, he entered the Lyceum in Mannheim and he studied there for four years, graduating in\n1860\n.\nAfter graduating from the Mannheim Lyceum, Schröder entered the University of Heidelberg. He studied mathematics under\nOtto Hesse\n, physics under\nGustav Kirchhoff\nand chemistry under Robert Bunsen. Heidelberg was an exciting place at this time with\nKirchhoff\nand Bunsen making fundamental advances analysing the spectrum of elements. Both\nKirchhoff\nand Bunsen had been students of\nHesse\n. While Schröder was undertaking research with\nHesse\nas his advisor, several other students, who would soon become famous, were also undertaking doctoral studies with\nHesse\nat Heidelberg. For example,\nAdolph Mayer\n(\ndoctorate in\n1861)\nand\nHeinrich Weber\n(\ndoctorate in\n1863)\nwere students of\nHesse\nat the same time as Schröder, while\nOlaus Henrici\narrived in Heidelberg to begin his studies in\n1862\n. The Ruprecht-Karls-Universität Heidelberg awarded Schröder a doctorate in\n1862\nfor his thesis\nÜber die Vielecke von gebrochener Seitenzahl oder die Bedeutung der Stern-Polygone in der Geometrie\n.\nⓉ\n(\nOn the p/q-sided polygons or the meaning of the star-polygons in geometry\n)\nIn his thesis he writes:-\nThe extension of the power concept, originally only associated with integers, to rational fractions has been very fruitful in algebra; this suggests that we should try to do the same thing in geometry whenever the opportunity presents itself.\nAmong examples of fractional powers, he goes on to define\np\nq\n\\Large\\frac{p}{q}\\normalsize\nq\np\n​\n-sided polygons.\nHesse\nhad been a professor at Königsberg before being appointed to Heidelberg and\nKirchhoff\nand Bunsen had both been his students at Königsberg.\nFranz Neumann\nhad been the professor of physics at Königsberg at that time and had also taught\nKirchhoff\nand Bunsen.\nHesse\nhad taught\nCarl Neumann\n,\nFranz Neumann\n's son, so with these strong links between\nFranz Neumann\nand the staff at Heidelberg, it is little surprise that after the award of his doctorate Schröder went to Königsberg to spend two years studying mathematical physics with\nFranz Neumann\nand mathematical analysis with F J Richelot.\nIn\n1864\n, after his two years in Königsberg, Schröder took the examinations to qualify him to teach mathematics and natural sciences in gymnasiums. He took these state examinations in Baden-Baden, but then went to Zürich where he submitted his\nhabilitation\nthesis to the Eidgenössische Technische Hochschule in\n1865\n. Dipert\n[\n12\n]\nspeculates that his reasons for going to Zürich may not have been entirely academic ones since he was a very enthusiastic mountain climber and made a number of difficult ascents without a guide during his time in Switzerland. Having qualified as a lecturer, he taught for a while as a\nPrivatdozent\nat the Eidgenössische Technische Hochschule. Returning to Germany, he took further state teaching examinations in Baden-Baden in October\n1869\nand was teaching there when the Franco-Prussian War broke out in\n1870\n. Schröder volunteered for the army and, despite his poor eyesight, he was accepted. His period of active service was, however, quite short, for towards the end of\n1870\nthe Ministry of Education in Baden requested he return to take up an appointment as professor of mathematics and the natural sciences at the Realgymnasium in Baden-Baden. The Black Forest was rather different from the Swiss Alps, but Schröder took full advantage of the area making many long hikes during his years in Baden-Baden. In\n1874\nhe was named a full professor at the Technische Hochschule in Darmstadt. He remained there for two years, moving to the Technische Hochschule in Karlsruhe in\n1876\n. It is almost certain that this move came about because of\nJacob Lüroth\n. Like Schröder,\nLüroth\ngrew up in Mannheim and the two became friends while at school there.\nLüroth\nhad been appointed professor of mathematics at the Technische Hochschule in Karlsruhe in\n1869\nand his signature is on Schröder's letter of appointment. Schröder remained at Karlsruhe for the rest of his career, being made Director of the Technische Hochschule for the year\n1890\n-\n91\n.\nErnst Schröder's important work is in the area of algebra, set theory and logic. His work on ordered sets and ordinal numbers is fundamental to the subject. However, he never considered himself to be a logician, as Peckhaus points out\n[\n22\n]\n:-\nHis very own object of research was absolute algebra in respect to its basic problems and fundamental assumptions. What was the connection between logic and algebra in Schröder's research? ... one could assume that these fields belong to two separate fields of research, but this is not the case. They were intertwined in the framework of his heuristic idea of a general science.\nIn fact Schröder started out being interested in mathematical physics, and his move towards logic was simply an attempt to deepen its foundations. Early in his career he wrote an important article\nÜber iterirte Functionen\nⓉ\n(\nOn iterative functions\n)\n(1871)\noften cited as a basis of modern\ndynamical systems\ntheory. Now one sees Schröder moving towards logic with\nLehrbuch der Arithmetik und Algebra für Lehrer und Studierende\nⓉ\n(\nA textbook of arithmetic and algebra for teachers and students\n)\npublished by Teubner in\n1873\n. Ivor Grattan-Guinness\n[\n5\n]\nwrites:-\nIn the subtitle he mentioned 'the seven algebraic operations': addition and subtraction at the 'first level', multiplication and division at the second, and exponentiation, roots and logarithms at the third. ... he put forward mathematics as 'the doctrine of numbers', rather than of magnitudes; and he stressed the algebraic bent by seeking 'absolute algebra' of which common algebra was an example.\nIn\n1874\nhe published\nNormale Elemente der absoluten Algebra\nⓉ\n(\nMain elements of absolute Algebra\n)\nwhich was written for use in the school in Baden-Baden\n(\nalthough it is difficult to believe that he had students capable of appreciating the ideas in this small book\n)\nand in it he continued to develop the ideas from the previous publication. He wrote his first work on mathematical logic\nDer Operationskreis des Logikkalkuls\nⓉ\n(\nThe operation of the Logical calculus\n)\n, influenced by\nGeorge Boole\nand\nHermann Grassmann\n, in\n1877\n. It contained, for the first time, the formulation of the duality principle, and emphasised the duality of conjunction\n(\nintersection\n)\nand disjunction\n(\nunion\n)\nshowing how dual theorems could be found. He was the first to use the term 'propositional calculus' and seems to be the first to use the term 'mathematical logic'. In fact he compares algebra and\nBoole\n's logic saying:-\nThere is certainly a contrast of the objects of the two operations. They are totally different. In arithmetic, letters are numbers, but here, they are arbitrary concepts.\nIn\nVorlesungen über die Algebra der Logik\nⓉ\n(\nLectures on the algebra of logic\n)\n, a large work published between\n1890\nand\n1905\n(\nit was edited and completed by Eugen Müller after his death\n)\n, Schröder gave a detailed account of algebraic logic, provided a source for\nAlfred Tarski\nto develop the modern algebraic theory and gave an extensive bibliography of the history of logic. Lattice theory also grew out of this work. Brady writes\n[\n3\n]\n:-\nIt offers the first exposition of abstract lattice theory, the first exposition of\nDedekind\n's theory of chains after\nDedekind\n, the most comprehensive development of the cakculau of relations, and a treatment of the foundations of mathematics in relation calculus that\nLöwenheim\nin\n1940\nstill thought was as reasonable as set theory. Schröder's concept of solving a relational equation was a precursor of\nSkolem\nfunctions, and he inspired\nLöwenheim\n's formulation and proof of the famous theorem that every sentence with an infinite model has a countable model, the first real theorem of modern logic.\nSchröder said his aim was\n(\nsee for example\n[\n22\n]\n)\n:-\n... to design logic as a calculating discipline, especially to give access to the exact handling of relative concepts, and, from then on, by emancipation from the routine claims of natural language, to withdraw any fertile soil from \"cliché\" in the field of philosophy as well. This should prepare the ground for a scientific universal language that, widely differing from linguistic efforts like Volapük\n[\na universal language like Esperanto, very popular in Germany at the time\n]\n, looks more like a sign language than like a sound language.\nSchröder had a very high opinion of\nCharles Sanders Peirce\n. The two corresponded but\nPeirce\nshowed a more mixed attitude towards Schröder, sometimes praising him while on other occasions he was highly critical. Brady writes\n[\n3\n]\n:-\nSchröder developed\nPeirce\n's relative calculus much further and much more systematically than did\nPeirce\n. Schröder considered quantifiers\n(\nor, at least, sums and products equivalent to quantifiers for a fixed domain\n)\nin first- and higher-order logic. He understood that there are notions such as countability that are beyond relative calculus\n(\nand also beyond first-order predicate logic\n)\n.\nDipert\n[\n12\n]\ngives an interesting account of Schröder's character which he compares with that of Peirce:-\nAs concerns Schröder's personality, Schröder was apparently an extremely even-tempered and gentle man. All his biographers attest to this fact, and these qualities are shown conspicuously in his correspondence with\nPeirce\n, and his generosity toward\nChristine Ladd-Franklin\nand her young daughter, Margaret. The Vorlesungen is, rather unusual for the times, careful to note the work of others and never takes vague credit for what was in fact others' work. While Peirce overall praised Schröder, he nevertheless sometimes ferociously attacked him, in print and in private correspondence. Schröder venerated Peirce, however, and had in abundance what\nPeirce\nacknowledged he lacked: self-control.\nPutman shows the respect which Schröder was held in a hundred years after he completed the work\n[\n25\n]\n:-\nWhen I started to trace the later development of logic, the first thing I did was to look at Schröder's 'Vorlesungen über die Algebra der Logik', ...\n[\nwhose\n]\nthird volume is on the logic of relations\n(\nAlgebra und Logik der Relative,\n1895)\n. The three volumes immediately became the best-known advanced logic text, and embody what any mathematician interested in the study of logic should have known, or at least have been acquainted with, in the\n1890\ns.\nHowever, as\nWussing\nwrites in\n[\n1\n]\n, this respect for Schröder was not nearly so evident in his own day:-\nSchröder participated in the development of mathematical logic as an independent discipline in the second half of the nineteenth century. This is his real achievement, although his contribution was not recognised until the beginning of the twentieth century. Three factors account for the delay: the imature state of the field during his lifetime; a certain prolixity in his style; and, above all, the isolation imposed by his teaching in technical colleges. As a result he was an outsider, at a disadvantage in chosing terminology, in outlining his argumentation, and in judging what mathematical logic could accomplish.\nSchröder had many sporting hobbies: cycling, hiking, swimming, ice-skating, horseback riding, and gardening. Because he was always seen riding his bicycle around Karlsruhe he was known locally as the 'Bicycle-professor'. He even took up skiing when he was sixty years old. He never married but seemed to find that his duties in the Technische Hochschule Karlsruhe extremely demanding, perhaps because he undertook them very conscientiously. Certainly he found it very difficult to find the necessary time to complete his major three volume work\nVorlesungen über die Algebra der Logik\nⓉ\n(\nLectures on the algebra of logic\n)\n. Schröder's father Heinrich retired in\n1873\nand, a year after his wife Karoline died in\n1875\n, he moved to Karlsruhe to be close to his sons Ernst and Heinrich; Heinrich Schröder died in\n1885\n. Given what a fit man Ernst Schröder was, it is surprising that he died at the age of\n60\n. He was skiing and cycling days before his death, but caught a cold. This seemed to worsen over the course of a few days and he died of \"brain fever\" according to the death certificate. Many of his friends felt that his strenuous sporting life at the age of sixty had led to his premature death. He was buried in the main cemetery of Karlsruhe quite close to the apartment in which he had lived. Having no close relatives to continue tending his grave, following the usual custom it was reused after a period of\n30\nyears so today there is no record remaining in the cemetery.\nIt is interesting to note that in June\n1913\nNorbert Wiener\npresented his doctoral thesis to Harvard University;\nWiener\nwas then\n18\nyears old. The thesis was devoted to a comparison of the logical systems of Ernst Schröder and\nBertrand Russell\n, with special attention to their different treatments of relations. There is an interesting discussion of this and subsequent developments in\n[\n15\n]\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}