{
  "nome_completo": "Ernst Paul Specker",
  "nome_curto": "Ernst Specker",
  "ano_nascimento": "1920",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Specker/",
  "lugar_nascimento": "Zürich, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Ernst Specker\n's parents were Margreth Branger and Karl Specker. Ernst was the middle child of his parents' three sons. The family background is described in\n[\n2\n]\n:-\nHis great-grandfathers were citizens of four different Swiss cantons. The ancestor from Thurgovia was a carpenter, the ancestor from Zürich a schoolteacher, the ancestor from the canton of Grisons was a farmer and the ancestor from the canton of Appenzell drove pack-horses over mountain passes, importing wine from Italy. his grandfathers followed their fathers in becoming a carpenter and a farmer. Ernst's father studied law and worked in the civil service.\nErnst attended kindergarten in Zürich. He then studied at an elementary school for four years before falling out with one of his teachers. He persuaded his parents that he had been badly treated and they arranged for him to be sent to a different elementary school, still in Zürich, this one attached to the Zürich Teacher College for Women. Ernst was happy at this school but his health broke down when he contracted tuberculosis after beginning secondary school. In\n1934\nhe was sent to a sanatorium in Davos, then after he was released from the sanatorium he lived with his maternal grandmother who lived in Davos. By\n1935\nhe was back at his secondary school but had been left rather crippled by the illness. He did begin to develop an interest in mathematics at this time but later said that\n[\n2\n]\n:-\n... getting into mathematics is much more difficult than getting into poetry. For instance, when I first learned about the formula for the number of diagonals in a polygon, I was quie excited about it and wanted to find a formula of my own. But as you can guess, nothing came out of it.\nIndeed he did love literature, poetry in particular. It is easy to see how he could read poems and then write his own poetry, but trying to produce his own mathematics was of a different order of difficulty.\nAfter the summer of\n1936\nhis illness returned with increased vigour and he had to return to Davos where he lived with his grandmother again this time spending over three years confined to bed. He was given lessons by teachers from a local private school, studying mathematics, physics, chemistry, and foreign languages. He seems to have seen little of his parents\n(\nor any other family members except his grandmother\n)\nduring these years. In the spring of\n1940\nhe returned to Zürich although he was now badly crippled and needed crutches to get about. He studied at Professor Tschulok's private school so that he would be prepared to take the university entrance examinations. Of course in\n1940\nmost of Europe was at war, but Switzerland remained neutral and there were many outstanding teachers at the school who were in Switzerland for political reasons. Specker passed his university entrance examinations in the autumn of\n1940\n. His father pressed him to study law at university but Specker wanted to study mathematics at the Eidgenössische Technische Hochschule\n(\nETH\n)\nin Zürich. Specker's parents were rather unhappy about this but in the end they consented.\nIn his first term at ETH he attended linear algebra lectures by\nMichel Plancherel\nand calculus lectures by W Saxer. He also attended a colloquium given by\nBeno Eckmann\n. During the Easter vacation Specker returned to his grandmother at Davos and read the\nGrundzüge der Theoretischen Logik\nⓉ\n(\nGeneral theoretical logic\n)\nby\nHilbert\nand\nAckermann\n. Back at ETH after the vacation ended, he attended a projective geometry course given by Kollros and also attended lectures by\nPaul Finsler\nat the University of Zürich. His main teachers for the rest of his undergraduate studies were Gonseth,\nHopf\nand\nBernays\n. It was\nHopf\nwho supervised the dissertation for his diploma on\nFundamental groups and second homotopy groups of closed three-dimensional manifolds\n.\nFrom\n1945\nto\n1948\nSpecker was employed as an assistant at ETH, working first for Saxer, then for\nHopf\nand\nPlancherel\n. He attended\nBernays\n' seminar on\nAxiomatics and Logistics\nand one of the topics studied led to Specker's paper\nNicht konstruktiv beweisbare Sätze der Analysis\nⓉ\n(\nNon-constructively-provable theorems of analysis\n)\n(1949)\n.\nRoman Sikorski\nalso attended the seminar and interaction with him led to Specker's paper\nSur un problème de Sikorski\nⓉ\n(\nOn a problem of Sikorski\n)\n(1949)\n. He submitted his doctoral thesis\nDie erste Cohomologiegruppe von überlagerungen und Homotopieeigenschaften dreidimensionaler Mannigfaltigkeiten\nⓉ\n(\nThe first cohomology of superimpositions and homotopy properties of three-dimensional manifolds\n)\nin\n1948\nand was awarded a two year postdoctoral fellowship. We noted above that Specker was crippled by the illness he had suffered. However in\n1948\n-\n49\nhe underwent surgery and his health improved dramatically. He was then able to travel to the United States to spend the academic year\n1949\n-\n50\nat the Institute for Advanced Study at Princeton. There he attended lectures by\nChurch\n,\nSiegel\nand\nSteenrod\n. He also attended\nDeane Montgomery\n's seminar and discussed problems on recursive analysis with\nGödel\n.\nSpecker returned to ETH for session\n1950\n-\n51\nwhen he substituted for\nHopf\nin teaching a course on linear algebra. In\n1951\nhe submitted his\nhabilitation\nthesis to ETH and became a\nprivatdozent\n. As well as teaching at ETH he also lectures at Geneva and at Neuchätel over the following years. In\n1953\nhe published\nThe axiom of choice in Quine's New Foundations for Mathematical Logic\n.  I Novak Gál writes in a review:-\nSpecker here proves the following important results which were long a subject for conjecture:\nthe axiom of infinity is provable in\nQuine\n's \"New Foundations\";\nthe axiom of choice is disprovable in \"New Foundations\";\nthe generalized\ncontinuum hypothesis\nis also disprovable in \"New Foundations\".\nSpecker was promoted to professor at ETH in\n1955\nand the following year he married Suzanne; they had three children, Dorothea born in\n1957\n, Adrian born in\n1959\nand Margaret born in\n1962\n.\nSpecker's contributions to mathematics are reviwed in\n[\n5\n]\nwhere his\n32\npublications up to\n1979\nare divided into\n10\ncategories: topology, recursive analysis, combinatorial set theory, type theory, axiomatic set theory,\nRamsey\n's theorem, arithmetic, logic of quantum mechanics, algorithms, and miscellaneous. Examples of his later papers are\nThe fundamental theorem of algebra in recursive analysis\n(1969)\n,\nDie Entwicklung der axiomatischen Mengenlehre\nⓉ\n(\nThe development of axiomatic set theory\n)\n(1978)\n,\n(\nwith H Kull\n)\nDirect construction of mutually orthogonal Latin squares\n(1987)\n,\nApplication of logic and combinatorics to enumeration problems\n(1988)\n.\nIn\n1987\nSpecker gave his farewell lecture at the ETH Zürich\nPostmoderne Mathematik: Abschied vom Paradies?\n. This is published as\n[\n3\n]\nand presents problems of infinity in the form of a fairy tale. The volume\n[\n1\n]\nlist\n42\npublications by Specker. We end this biography by quoting from the Preface:-\nErnst Specker has made decisive contributions towards shaping directions in topology, algebra, mathematical logic, combinatorics and algorithms over the last\n40\nyears. We have derived great pleasure from marking his seventieth birthday by editing the majority of his scientific publications, and thus making his work available in a unified form to the mathematical community. In order to convey an idea of the richness of his personality, we have also included one of his sermons.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic"
  ]
}