{
  "nome_completo": "Ernst Peschl",
  "nome_curto": "Ernst Peschl",
  "ano_nascimento": "1906",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peschl/",
  "lugar_nascimento": "Passau, Germany",
  "lugar_morte": "Bonn, Germany",
  "biografia": "Ernst Peschl\nwas brought up as a Roman Catholic. He also learnt to speak fluent French, which would be significant to him later in life. He studied at Munich University and the Technical University of Munich, beginning his studies in\n1925\nand taking the Munich state examinations in\n1929\n. He continued to study for his doctorate at Munich under the supervision of\nCarathéodory\n. He obtained his doctorate in\n1931\nfor the thesis\nÜber die Krümmung von Niveaukurven bei der konformen Abbildung einfachzusammenhängender Gebiete auf das Innere eines Kreises; eine Verallgemeinerung eines Satzes von E Study\nⓉ\n(\nOn the curvature of curves on the plane in the case of a conformal mapping of simply connected domains onto the interior of a circle. A generalization of a theorem by  E Study\n)\n. He published his thesis in\nMathematische Annalen\nin\n1932\n.\nAfter the award of his doctorate, Peschl was appointed to Jena where he spent two years, from\n1931\nto\n1933\n, working with Robert König. He then went to Münster where he worked for eighteen months with\nBehnke\nbefore returning to Jena to continue to work as Robert König's assistant. Peschl and\nBehnke\npublished an article in the\nMathematische Annalen\nin\n1935\nwhich introduced the notion of Planarkonvexitat, now called weak lineal convexity. They showed that, for domains with smooth boundary, it implies that a differential inequality is satisfied at every boundary point.\nPeschl was a leader of a Roman Catholic youth organisation in Jena but the work of such organisations was soon threatened by the Nazis after they came to power in\n1933\n. After the Gestapo closed down the Roman Catholic youth organisation in Jena, Peschl realised that he would have to go along with certain political actions if a career was to be possible. He was intending to submit his\nhabilitation\nthesis to Jena, so he was on track to obtain the qualification to lecture there, when the Gestapo acted. He made what he judged to be a necessary move, and joined the Sturmabteilung\n(\nStormtroopers\n)\n. He only remained in the service of the Stormtroopers until June\n1934\n, which was less than a year.\nIn\n1935\nPeschl submitted his habilitation thesis and in\n1936\nwas appointed as a lecturer in Jena. This position saw him as automatically become a member of the Union of National Socialist Teachers, but he insisted that he was only a corporate member rather than an individual member. It was clear that he was going along with the National Socialists only as far as he judged was necessary to allow him to have a career as a university lecturer, but at every stage he did the minimal amount to keep in favour. In fact by\n1938\nhe was thrown out of the Union of National Socialist Teachers since he had not paid his membership fees, but this was a pleasing outcome to Peschl.\nBy the time that Peschl was thrown out of the Union of National Socialist Teachers he was no longer in Jena for, in\n1937\n, he had accepted an appointment as a professor at the Rheinische Friedrich-Wilhelms University in Bonn. He was promoted in the following year but in\n1941\nhe was drafted into military service. This saw him using his skills as a fluent speaker of French to act as an army interpreter. However, he continued to supervise his first doctoral student Claus Müller at Bonn; Müller was awarded his doctorate in\n1944\n. In March\n1943\nPeschl went to the Research Institute for Aeronautics Braunschweig-Völkenrode which exempted him from further military service. The Head of the Institute was\nDoetsch\nand Peschl\n[\n1\n]\n:-\n... offered passive resistance to\nDoetsch\n's rigid militaristic conceptions\n(\nrecall that\nDoetsch\nwas a major as well as a professor\n)\n. Consequently ...\nDoetsch\nhad him fired\n(\non March\n29\n,\n1945)\nbecause his \"attitude towards work did not correspond to the necessities of the war at the moment\".\nOnce he was fired from the Institute Peschl should have been drafted, and\nDoetsch\npressed for this course of action. However Peschl began working at the Technical University of Braunschweig and avoided being drafted for a few weeks which was all that was necessary since the Allies occupied Braunschweig on\n11\nApril. From\n1948\nPeschl was an ordinary professor at the Rheinische Friedrich-Wilhelms University in Bonn. He held this post until he retired in\n1974\n. However he also held other positions in Bonn, namely as Head of the Rheinisch-Westfälische Institute for Mathematical Instruments from\n1955\nto\n1968\nand from\n1968\nhe was Head of the Institute of Mathematics as well as Head of the Society for Mathematics and Data processing\n(\nGesellschaft für Mathematik und Datenverarbeitung\n)\n. In\n1969\nhe spent time at the University of Toulouse.\nIn\n1973\nPeschl lectured at the C Carathéodory International Symposium in Athens. His lecture surveyed:-\n... the various directions that his thesis-work has taken in investigations by the\n[\nhimself\n]\n, his colleagues and disciples in the intervening\n40\nplus years. ... this work lies on the common boundary between\ndifferential geometry\n, function theory\n(\nof one and several variables\n)\nand partial differential equations. The first such relationship lies ... in the\nSchwarz\nlemma; the essence is the relation between the standard hyperbolic metric in the unit disc and the\nBeltrami\nequation, to which particular differential invariants are associated. This situation has been generalized to different types of metrics, to equations of higher order and to more than one variable.\nPeschl wrote a number of important books such as\nAnalytische Geometrie\nⓉ\n(\nAnalytical geometry\n)\n(1961)\n,\nFunktionentheorie\nⓉ\n(\nComplex analysis\n)\n(1967\n, second edition\n1983)\nand\nPartielle Differentialgleichungen erster Ordnung\nⓉ\n(\nPartial differential equations of the first order\n)\n(1973)\n. Struik, reviewing\nAnalytische Geometrie\nⓉ\n(\nAnalytical geometry\n)\n, writes:-\nThe fundamental concept on which the text of this neat little book is based is that of the\nn\nn\nn\n-dimensional vector space\nV\nn\nV_{n}\nV\nn\n​\n, abstractly defined. ... The book, the result of lectures given at the University of Bonn, is a valuable contribution to that approach to analytic geometry in which is stressed, at the example of\nSchreier\nand\nSperner\n, the necessity of basing the traditional material on the strict concepts of modern algebra.\nFunktionentheorie\nⓉ\n(\nComplex analysis\n)\ncontains the basic facts about analytic functions of a complex variable. The titles of the chapters are: Algebra and geometry of complex numbers; Fundamental topological concepts, sets, sequences of complex numbers and infinite series; Functions, real and complex differentiability and holomorphy; Integral theorems and their consequences; Winding number and curves homologous to zero;\nTaylor\ndevelopment of\nholomorphic\nfunctions; Elementary transcendental functions;\nLaurent\nseries, isolated singularities and residue calculus; Holomorphic and\nmeromorphic functions\nobtained by limiting processes; Analytic continuation; and Conformal mappings.\nPartielle Differentialgleichungen erster Ordnung\nⓉ\n(\nPartial differential equations of the first order\n)\n(1973)\nprovides an elementary introduction to first order partial differential equations while\nDifferential-geometrie\n(1973)\nprovides a clear, elementary and concisely presented introduction to local differential geometry in Euclidean and Riemannian spaces.\nPeschl received many honours, for instance the French government appointed him \"Officer of the Palmes Académiques\" in\n1975\n:-\n... in appreciation of services to his field of activity, to mathematics, in particular however because of his fruitful co-operation with his French professional colleagues.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}