{
  "nome_completo": "Ernst David Hellinger",
  "nome_curto": "Ernst Hellinger",
  "ano_nascimento": "1883",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hellinger/",
  "lugar_nascimento": "Striegau, German Empire (now Strzegom, Poland)",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Ernst Hellinger\n's parents were Emil and Julie Hellinger and the fact that the family was Jewish meant that he would have major problems after the Nazis came to power. Hanna, a sister of Ernst, later became Hanna Meissner and wrote the article\n[\n3\n]\nabout her brother. Ernst grew up in Breslau where he attended school, graduating from the\nGymnasium\nthere in\n1902\n. It was at the Breslau Gymnasium that Hellinger first became fascinated in mathematics, and this was the result of an excellent mathematics teacher at the school.\nHellinger entered the University of Heidelberg but, following the tradition in Germany at that time, he did not complete his studies at a single university but moved to several different universities during the course of his studies. His second university was Breslau, so he returned to the town where he was brought up, and then in\n1904\nhe followed his friend Max\nBorn\nto Göttingen. Hellinger would keep in touch with\nBorn\nand developments in\nquantum mechanics\nfor much of his life. In Göttingen Hellinger was a student of\nHilbert\nand, not long after he began his studies there, he was joined by\nCourant\nand\nToeplitz\nwho had been his fellow students at Breslau.\nHellinger was awarded his doctorate by the University of Göttingen in\n1907\nfor a thesis entitled\nDie Orthogonalinvarianten quadratischer Formen von unendlich vielen Variablen\nⓉ\n(\nThe Orthogonallly invariant quadratic forms in an infinite number of variables\n)\n. He introduced a new type of integral, the\nHellinger integral\nin his doctoral thesis and, jointly with\nHilbert\n, he produced the important\nHilbert\n-Hellinger theory of forms. Then from\n1907\nto\n1909\nhe was an assistant at Göttingen and, during this time, he\n[\n1\n]\n:-\n... edited\nHilbert\n's lecture notes and Felix\nKlein\n's influential Elementarmathematik vom höheren Standpunkte aus\nⓉ\n(\nElementary mathematics from an advanced standpoint\n)\n(\nBerlin,\n1925)\nwhich was translated into English\n(\nNew York,\n1932)\n.\nFrom Göttingen Hellinger went to Marburg where he was a\nPrivatdozent\nfrom\n1909\nto\n1914\n. He was then appointed to a chair at the new university of Frankfurt am Main. He was not the only appointment to Frankfurt in\n1914\nfor\nSzász\nwas appointed a Privatdozent in that year, later to be promoted to professor.\nBieberbach\nwas also at Frankfurt in this early period, although he left after World War I to take up a chair at Berlin. Of course\n1914\nmarked the start of World War I and Hellinger was involved in war service. However, after the end of the war, there were a number of further important appointments to Frankfurt which built up an impressive mathematics department there.\nEpstein\nwas appointed in\n1919\n,\nDehn\nin\n1921\nand\nSiegel\nin\n1922\n. Others such as\nToeplitz\nwere frequent visitors to the Frankfurt Mathematics Seminar. This Seminar is described in\n[\n2\n]\nand\n[\n6\n]\nwhich both concentrate on the period from\n1922\nto the difficult years of the\n1930\ns.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which exempted non-Aryans who had fought for Germany in World War I. Hellinger certainly qualified under this clause and this allowed him to keep his lecturing post in Frankfurt in\n1933\n.\nHellinger, however, was forced to retire in\n1936\nbecause by this stage the rules that non-Aryans who served in World War I were allowed to keep their posts was being ignored after decisions at the Nuremberg party congress in the autumn of\n1935\n. Hellinger continued to live in Frankfurt. On the Kristallnacht\n(\nso called because of the broken glass in the streets on the following morning\n)\n, the\n9\n-\n10\nNovember\n1938\n,\n91\nJews were murdered, hundreds were seriously injured, and thousands were subjected to horrifying experiences. Thousands of Jewish businesses were burnt down together with over\n150\nsynagogues. The Gestapo arrested\n30\n,\n000\nwell-off Jews and a condition of their release was that they emigrate. The Gestapo did not arrest Hellinger that night because there was nowhere else to put prisoners but\n[\n6\n]\n:-\nhe refused to flee ... because he wanted to stay and see just how far beyond the traditional standards of justice and ethics the authorities would go in his case.\nOn\n13\nNovember\n1938\nhe found out how far the authorities would go. He was arrested, first taken to the Festhalle and then put into Dachau concentration camp. By this time his sister, Hanna Meissner, was in the United States and she describes in\n[\n3\n]\nhow\nSiegel\nwrote to her to say that Hellinger had been sent to the concentration camp. Fortunately friends were able to arrange a temporary job for Hellinger at Northwestern University at Evanston in the United States. He was released from the Dachau camp after six weeks on condition that he emigrate immediately.\nSiegel\nwrites\n[\n6\n]\n:-\nI saw Hellinger in Frankfurt a few days after his release. He looked emaciated from the utterly insufficient diet at the camp, but maintained a strong will to live as a result of his impending emigration. He refused to discuss his horrifying experiences and was never able to forget the humiliation that was done him.\nHe emigrated to the United States in late February\n1939\n.\nHellinger's position at Evanston throughout the war was precarious with a series of one-year appointments but he acquired American citizenship in\n1944\nand worked at Evanston until\n1949\nwhen he retired. Of course after just a few years work he would not have received a pension to enable him to live and he had constant financial worries.After retirement he accepted a post at Illinois Institute of Technology but he fell ill with cancer in November\n1949\nand died a few months later.\nAt Frankfurt, Hellinger had continued his mathematical work on the\nspectral theory\nof\nJacobi\nforms and\ncontinued fractions\n. He did important work on\nStieltjes\n's moment problem. With\nToeplitz\nhe wrote a monumental survey of the literature on\nintegral equations\nup to\n1923\nfor\nKlein\n's\nEnzyklopädie der Mathematischen Wissenschaften\n. This article,\nIntegralgleichungen und Gleichungen mit unendlich vielen Unbekannten\nⓉ\n(\nIntegral equations and equations with infinitely many unknowns\n)\n, was published in the Encyclopedia in\n1927\nand then as a separate article the following year. It is now considered one of the great classics and has been reprinted several times. Hellinger also worked on the history of mathematics and, while at Frankfurt, he wrote an important paper on\nJames Gregory\n.\nHellinger was a gifted teacher who concerned himself deeply with the students whom he taught\n[\n6\n]\n:-\nHe always took the welfare of the students to heart even outside his lectures and study groups.\nThe letter\n[\n7\n]\nis written by two of Hellinger's students and praises highly his teaching prowess:-\nAt Northwestern he was one of the most liked professors in the Mathematics Department and was recognised by all for the excellence, skill, and understandability of his lectures and especially his proofs.\nHe had an odd sense of humour but a strong sense of loyalty and some equally strong dislikes. He had a gift for making friends. In\n[\n7\n]\na story shows his sense of humour:-\nShortly after his arrival at Northwestern, one of the professors in describing Northwest's mathematics program to him remarked that in the honours course\nFelix Klein\n's 'Elementary mathematics from an advanced standpoint' was used as a text and \"perhaps Hellinger was familiar with it\". At this Hellinger ... replied \"familiar with it, I wrote it!\".",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}