{
  "nome_completo": "Eudemus of Rhodes",
  "nome_curto": "Eudemus",
  "ano_nascimento": "350 BC",
  "ano_morte": "290 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eudemus/",
  "lugar_nascimento": "Rhodes, Greece",
  "lugar_morte": null,
  "biografia": "We should certainly credit\nEudemus of Rhodes\nfor his achievements in this archive since Eudemus seems to have been the first major historian of mathematics.\nSimplicius\ninforms us that a biography of Eudemus was written by Damas, who is unknown but for this reference, but sadly no trace of this biography has been found. As exciting aspect of the history of mathematics is that the discovery of this text\n(\nand other lost texts\n)\nin the future, although highly unlikely, always remains a possibility.\nEudemus was born on Rhodes and we know that he had a brother called Boethus. Of his parents and early life we know nothing, but we do know that he studied with\nAristotle\n.\nAristotle\nspent time in Athens, Assos and other places and it would certainly be good to understand when Eudemus studied with him. Unfortunately there is no record either of time or of place which would let us answer these questions with any degree of certainty. W Jaeger, however, in his discussion of\nAristotle\n[\n4\n]\n(\nsee also\n[\n5\n]\n)\nhas argued strongly that Eudemus studied with\nAristotle\nduring his period in Assos.\nAristotle\nhad two followers, Eudemus and\nTheophrastus of Lesbos\n, who were known as his \"companions\". We should make it clear, however, that there was another philosopher called Eudemus associated with\nAristotle\n, namely Eudemus of Cyprus and it was this other Eudemus after whom\nAristotle\nnamed his famous text\nEudemus\n. When\nAristotle\nrealised that he had only a short time left to live he chose his successor between his two companions, Eudemus and Theophrastus. He chose Theophrastus and it appears that Eudemus, although not unhappy with the decision, left Athens and set up his own school, probably back on his native Rhodes.\nTo say that Eudemus was not an original mathematician may be fair but just a little harsh, for we do know through\nProclus\nthat he wrote an original mathematical work called\nOn the Angle\n. This work is lost so we are unable to judge its importance but it does seem likely to have been considerably less important than his works on the history of mathematics.\nWe know of three works on the history of mathematics by Eudemus, namely\nHistory of Arithmetic\n(\ntwo or more books\n)\n,\nHistory of Geometry\n(\ntwo or more books\n)\n, and\nHistory of Astronomy\n(\ntwo or more books\n)\n.\nThe\nHistory of Arithmetic\nis known to us from only one reference to it in the writing of\nPorphyry\n. This reference tell us that the first book dealt with the Pythagorean idea of number and its interrelations with music.\nThe\nHistory of Geometry\nis the most important of the three mathematical histories of Eudemus. Although the work has not survived, it was available to many later writers who made heavy use of it. We are fortunate therefore that much of the knowledge that Eudemus had of the history of Greek mathematics before\nEuclid\n(\nit had to be before\nEuclid\ngiven the dates when Eudemus was writing\n)\nhas reached us despite the fact that he book has not. In many of the articles in this archive we have quoted from accounts based on Eudemus. To illustrate with one example, the work of\nHippocrates\non the\nquadrature\nof\nlunes\nis only known to us through Eudemus's\nHistory of Geometry\n.\nIt is unclear exactly when the\nHistory of Geometry\nwas lost.\nPaul Tannery\n(\nsee for example\n[\n7\n]\n)\nbelieved that it was lost before the time of\nPappus\nwhile others such as J L Heiberg have argued that\nPappus\nand\nEutocius\nboth wrote with an open copy of Eudemus's\nHistory of Geometry\nin front of them.\nThe\nHistory of Astronomy\nagain was heavily used by later writers and in exactly the same way as his geometry text, much information has survived in the works of others despite the loss of the original text. In particular\nThales\n' eclipse prediction was described in Eudemus's work and we believe that\nEudoxus\n's system of\nconcentric spheres\nwas first described there and later transmitted to us through the writing of\nSimplicius\nin the second century AD. Other topics in this book included\n[\n1\n]\n:-\n... the cycle of the great year after which all the heavenly bodies are found in the same relative positions; the realisation by\nAnaximander\nthat the earth is a heavenly body moving about the middle of the universe; the discovery by Anaximenes that the moon reflects the light of the sun and the explanation of lunar eclipses; and the inequality of the times between the\nsolstices\nand the\nequinoxes\n.\nWe have described above the important contributions of Eudemus to mathematics. However he is even better known for his contribution to saving the work of\nAristotle\nfor posterity. But for Eudemus we might not have had access to the works of\nAristotle\nfor he used his own lecture notes,\nAristotle\n's lecture notes and recollections from memory to produce volumes of\nAristotle\n's work fit for publication.\nOne further work is definitely due to Eudemus, namely a work on\nPhysics\nwhich was a treatise in four books following the work by\nAristotle\nof the same title fairly closely.\nSimplicius\nhad a copy of this work which he found very helpful in understanding\nAristotle\n's\nPhysics\nand perhaps this was precisely the role the Eudemus intended for the work. Another work by Eudemus was on logic, in fact he may well have written two logic books and he also wrote\nOn Discourse\n.\nSome works by Eudemus are harder to identify with Eudemus of Rhodes and may have been written by others with the same name. Certainly there are many references to a work on animals written by a certain Eudemus and one of the references certainly does refer to Eudemus of Rhodes. Since the work seems to have been a collection of fables about animals the subject matter seems too far removed from the serious, scientific and scholarly works which he certainly wrote. Perhaps more likely is a work on the poet Lindos. Since Lindos had connections with Rhodes the link makes this a more likely possibility.\nAgain there is a reference which seems to imply that Eudemus wrote a history of theology and again this seems highly probable. Many authors refer to Eudemus as the 'pious Eudemus' due to his belief in the 'contemplation of God'. This however may be due to editing by a later Christian who would have seen that clearly Eudemus meant 'contemplation of God' rather than what is much more likely what he wrote 'contemplation of Mind' and \"corrected\" the text accordingly!",
  "math_areas": [
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}