{
  "nome_completo": "Eugène Maurice Pierre Cosserat",
  "nome_curto": "Eugène Cosserat",
  "ano_nascimento": "1866",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cosserat/",
  "lugar_nascimento": "Amiens, France",
  "lugar_morte": "Toulouse, France",
  "biografia": "Eugène Cosserat\n's father was François-Constant Cosserat who was a well-off middle-class entrepreneur who was based in Amiens. François-Constant had three sons,\nFrançois-Nicolas\n(\nwho also has a biography in this archive\n)\n, Lucien-Constant, and Eugène Cosserat\n(\nthe subject of this biography\n)\n.\nFrançois-Nicolas\n, born in\n1852\n, was the eldest of the sons, Lucien-Constant, born in\n1856\n, was the middle son, while Eugène, born in\n1866\n, was the youngest and twelve years younger than his eldest brother\nFrançois\n. Eugène was only four years old when\nFrançois Cosserat\nentered the École Polytechnique in\n1870\n, and nine years old when Lucien-Constant Cosserat entered the same institution in\n1875\n.\nEugène\nwas educated first in a primary school in Amiens, moving to the Lycée in Amiens for his secondary education which he entered in the autumn of\n1877\n. At first he was only an average pupil, but once he began to study the sciences he showed considerable aptitude. When he was fourteen years old, in\n1880\n, he was showing exceptional promise and was awarded a prize offered by the Industrial Society of Amiens and also a prize presented by the former pupils of the Lycée. In the following year,\n1880\n-\n81\n, he began to study Elementary Mathematics and his love for the sciences became very clear. He received a bursary for his study of Advanced Mathematics which he attended over the following two years. For his outstanding successes in the first of these years he was awarded the Municipal Prize, awarded to the best student in the sciences, and for his achievements in the second of the two years he was awarded the\nDelambre\nPrize, given to the best student in the mathematics and physics courses. At the age of\n17\nhe took the competitive entrance examinations for the two major Paris Institutions, the École Polytechnique and the École Normale Supérieure, and was offered a place at both. Unlike his two brothers who both studied at the École Polytechnique, he chose to study at the École Normale Supérieure which he entered in\n1883\n. In fact this decision was, in many ways, the natural one since when his brothers entered the École Polytechnique it had been the leading institution to train scientists but in the intervening years it had concentrated more on training administrators and the École Normale had become the leading institution for science.\nDuring three years of study at the École Normale, Cosserat attended lectures by leading mathematicians including\nPaul Appell\n,\nGaston Darboux\n,\nGabriel Koenigs\nand\nÉmile Picard\n. Among his fellow students were several who would make major contributions to mathematics, including\nJacques Hadamard\nand\nPaul Painlevé\n. Cosserat graduated in\n1886\nand spent a short time teaching at the Lycée in Rennes before he was appointed as an assistant astronomer at the Observatory in Toulouse towards the end of\n1886\n. There he assisted the director,\nÉdouard Benjamin Baillaud\n, and he was given the taskof making a systematic study of\n3112\nbinary stars in Wilhelm Struve's catalogue\nStellarum Duplicium Mensurae Micrometricae\nⓉ\n(\nMicrometric measuring of double stars\n)\n(1837)\n. At the same time, he worked for his doctorate in mathematics. He submitted his thesis\nSur le cercle considéré comme élément générateur de l'espace\nⓉ\n(\nOn the circle considered as a generating element of space\n)\nto the Faculty of Science in Paris and, on\n14\nMarch\n1889\n, he was examined by a jury consisting of\nPaul Appell\n,\nGaston Darboux\n, and\nGabriel Koenigs\n. The report written by\nDarboux\nstated:-\nThe subject chosen by M Cosserat is extremely broad and barely explored, the young assistant lecturer barely began the study, but his work is interesting enough and contains enough new results to allow me to conclude the approval of the Faculty.\nIn his doctoral dissertation, Cosserat extended\nPlücker\n's concept of generation by means of straight lines by considering\ninfinitesimal\nproperties of spaces generated by circles. The authors of\n[\n3\n]\nexplain that Cosserat's:-\n... doctor's degree, in the spirit of\nGaston Darboux\n, deals with an extension of\nPlücker\n's concepts that is used in order to study the infinitesimal properties of spaces created by circles.\nEven before the award of his doctorate in\n1889\n, Cosserat had begun teaching mathematics courses at the Faculty of Science at Toulouse. In\n1896\nhe became professor of differential and integral calculus there, replacing\nThomas Stieltjes\nwho had died on\n31\nDecember\n1894\n, and, from that time on, he divided his work between the Faculty of Science and the Observatory. In\n1908\nCosserat was appointed to the chair of astronomy at Toulouse, becoming director of the Observatory there for the rest of his life. In this latter role he replaced\nÉdouard Benjamin Baillaud\nwho had left Toulouse to become director of the Paris Observatory. The role of director of the Observatory was a demanding one, and Cosserat became almost totally occupied with administrative tasks from the time of his appointment and so was forced to essentially give up mathematical research from this time on.\nAlthough he was not living in Paris, Cosserat was elected to the\nAcadémie des Sciences\nas a corresponding member on\n19\nJune\n1911\nand a full member on\n31\nMarch\n1919\n. Four years later, he was elected to the Bureau de Longitude. Because he was in Toulouse rather than Paris, he was made a non-resident member of both these organisations. In\n1889\nhe was awarded the\nPoncelet\nPrize by the\nAcadémie des Sciences\n. He had married Berthe Jèze; they had two sons. The eldest, Louis Cosserat, became a medical doctor but their younger son died before reaching adulthood.\nIn\n[\n1\n]\nCosserat is described as follows:-\nA reserved, kindly man and a diligent worker, Cosserat was one of the moving forces in the University of Toulouse for thirty five years.\nIn the first part of his career in astronomy, we have already noted that he made observations of double stars. In addition he observed minor planets and comets, publishing his findings in papers in\nComptes rendus\nof the Académie des Sciences, the\nBulletin astronomique\nand the\nAstronomische Nachrichten\n. He then carried out a series of observations on the satellites of Jupiter and those of Saturn. After his appointment as director of the Toulouse Observatory in\n1908\n, he studied the proper motions of stars publishing works such as\nSur quelques étoiles dont le mouvement propre annuel dépasse\n0\n.\n5\n''\nⓉ\n(\nOn some stars whose annual own movement exceeds\n0\n.\n5\n''\n)\n(1919)\nand the\n300\n-page posthumous publication\nDéterminations photographiques de positions d'etoiles\nⓉ\n(\nPhotographic determinations of star positions\n)\n(1933)\n. His work on the proper motion of stars made an important contribution to discussions on the structure of space. All these various contributions showed great skill and resulted in highly accurate data but much of Cosserat's work on astronomy was carried out at a time when he was also devoting much of his time to the study of mathematics.\nIn mathematics, we have already noted his early work on geometry. In his later work, Cosserat studied the deformation of surfaces which led him to a theory of elasticity. This work was carried out in collaboration with his brother,\nFrançois Cosserat\n, who was an engineer. He began his collaboration with his brother in\n1896\nwith the publication\nThéorie de l'élasticité\nⓉ\n(\nElasticity theory\n)\n. This first work studied broad questions relating to the foundations of mechanics but later their work turned towards the physical theory. By the early\n1900\ns, Cosserat had stopped working on the type of geometrical problems that had interested him at the start of his career and all his research efforts were directed towards working on mechanics with his brother. Their most important joint publications are:\nNote sur la cinématique d'un milieu continu\nⓉ\n(\nNote on the kinematics of a continuous medium\n)\n(1897)\n;\nNote sur la dynamique du point et du corps invariable\nⓉ\n(\nNote on the dynamics of development and the invariable body\n)\n(1906)\n;\nNote sur la théorie de l'action euclidienne\nⓉ\n(\nNote on the theory of Euclidean action\n)\n(1909)\n; and the book\nThéorie des corps déformables\nⓉ\n(\nTheory of deformable bodies\n)\n(1909)\n. The first of these was published as an addition to\nGabriel Koenigs\nLeçons de Cinématique professées à la Sorbonne: cinématique théorique\nⓉ\n(\nDynamics lessons given at the Sorbonne: Theoretical dynamics\n)\n. A review of this work by E O Lovett in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1900\nsingles out the Cosserats' contribution:-\nThe introduction of this note is peculiarly fortunate for it is high time that kinematics should comprehend the study of deformation and of deformable spaces. The authors have included in their extract certain generalities on curvilinear coordinates, the deformation of a continuous medium in general, infinitely small deformation, use of the mobile trieder, and the case where the non-deformed medium is referred to any curvilinear coordinates.\nThis innovative work on mechanics\n(21\njoint publications on this topic are listed in\n[\n2\n]\n)\nended with the François Cosserat's death in\n1914\n, after which time his brother Eugène Cosserat published nothing further on the topic. Jacques Levy describes the two Cosserats' contributions to this area\n[\n1\n]\n:-\nThe most practical results concerning elasticity were the introduction of the systematic use of the movable trihedral and the proposal and resolution, before\nFredholm\n's studies, of the functional equations of the sphere and ellipsoid. Cosserat's theoretical research, designed to include everything in theoretical physics that is directly subject to the laws of mechanics, was founded on the notion of Euclidean action\n[\nleast action\n]\ncombined with\nLagrange\n's ideas on the principle of extremality and\nLie\n's ideas on invariance in regard to displacement groups. The bearing of this original and coherent conception was diminished in importance because at the time it was proposed, fundamental ideas were already being called into question by both the theory of relativity and progress in physical theory.\nThe authors of\n[\n5\n]\nwrite:-\nThe Cosserat brothers, following a suggestion by\nDuhem\n(1893)\n, developed a theory for continuous oriented bodies that consist not just of particles\n(\nor material points\n)\n, but also of directions associated with each particle. Thus, in addition to the field of position vectors of a continuum in a given configuration, one also admits vector fields ... which may be chosen so as to represent pertinent features of materials. ... The Cosserats themselves recognised the value of oriented two-dimensional continua\n(\ni.e., curves and surfaces endowed with additional structure in the form of directors\n)\nfor representing the deformations of rods and shells respectively. ...\n[\nHowever their\n]\nideas on the subject\n[\nwere\n]\nignored for half a century.\nPommaret, in\n[\n2\n]\n, looks at the reception of the Cosserats' contributions:-\n... among their contemporaries, only\nHenri Poincaré\n(\nelectron theory\n)\n,\nÉmile Picard\n(\nsurprisingly\n)\nand\nÉlie Cartan\nappreciated the work done by the brothers. Exceptions are also colleagues of Eugène Cosserat in Toulouse, like L Ray and A Buhl.\n(\nIndeed the work of Buhl is a patching of mathematical analogies, far from physics.\n)\nIt is only in Germany that the brothers got disciples like Karl Heun who quoted them with emphasis in the German edition of the 'Encyclopédie des Sciences Mathématique' and studied their work in a seminar at Karlsruhe in\n1909\n. Then ... Relativity Theory and Quantum Physics overtook this period in science and the work of E and F Cosserat was almost rediscovered after\n1950\nbecause of the use of liquid crystals.\nAnother aspect of Eugène Cosserat's work which we should mention is his contributions to the\nAnnales de la faculté des sciences de Toulouse\n. This journal began publication in\n1887\nand, two years later, Cosserat joined the editorial board. The two other mathematicians who served on this board at this time were\nHenri Andoyer\nand\nThomas Jan Stieltjes\n. In\n1896\nCosserat became secretary to the editorial board of the\nAnnals\nand he continued to hold this role until\n1930\n. In fact, he continued to undertake editorial work up to the time of his death, sending\nHenri Poincaré\na letter on an editorial matter just a few days before his death.\nIn addition to his administrative work for the\nAnnals\n, Cosserat also translated articles from Russian and published French versions in the\nAnnals\n. In particular in\n1905\nhe published works by\nKarl Mikhailovich Peterson\non curves, surfaces and their deformations, and work on\ndifferential geometry\nrelated to questions from the theory of elasticity. Cosserat also collaborated with his brother in making French translations of other works. For example they translated a work by John Perry which approached mechanics in a highly experimental way. The Cosserat brothers, despite having written highly technical theoretical works on mechanics, approved of Perry's approach. They wrote at the beginning of the book:-\nAn space difficult to cross, which calls for continued efforts, separates abstract mechanics from its applications; this was already pointed out by\nPoncelet\nin his \"Introduction to industrial mechanics\", and the difficulty has not diminished since his time. ... It is therefore justified, at least in technical education, to lead the way in experimental considerations on rational deductions. ... This method, which is somewhat heretical in our country, was developed with great skill by John Perry, in the remarkable book that we present to French readers.\nThe Cosserat brothers François and Eugène also collaborated in translating the article on 'mechanics' from the German\nEncyklopädie der mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of mathematical sciences\n)\nfor a French version of this monumental classic work. However, they did not just make a translation, they added a very large amount of new material of their own showing their great appreciation of the history and philosophy of the subject.\nEugène Cosserat died in his home at the Observatory in Toulouse\n[\n4\n]\n:-\nThe funeral took place on\n2\nJune, on a morning with gentle sun; a long procession descended from the Observatory along the slopes which, although close to the city, still retained some greenery. It seemed that Nature had staged a scene both bright and calm ... calm as he was in his way.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}