{
  "nome_completo": "Eugene Lukacs",
  "nome_curto": "Eugene Lukacs",
  "ano_nascimento": "1906",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lukacs/",
  "lugar_nascimento": "Szombathely, Hungary",
  "lugar_morte": "Washington D.C., USA",
  "biografia": "Eugene Lukacs\nwas born into a Jewish family. The family lived in Vienna where Eugene's father worked in a bank. However Eugene was born in his grandmother's house in Szombathely, then moved to Vienna a few weeks later and he was educated in that city. After primary and the\nRealgymnasium\nsecondary school, Lukacs entered the Technical University in Vienna in\n1925\nwhere he studied mechanical engineering. However, he soon transferred to the University of Vienna to study mathematics. Among his teachers at the University of Vienna were\nH Hahn\n,\nE Helly\n, W Mayer,\nL Vietoris\nand\nW Wirtinger\n.\nAfter taking his first degree, Lukacs continued to study at Vienna for his doctorate. His doctoral dissertation on a geometry topic was supervised by W Mayer and, in\n1930\n, he was awarded his doctorate. He continued to study, taking an actuarial degree in\n1931\n.\nBy May\n1931\nAustria was close to financial and economic disaster. This was no time to get an academic position in a university, so Lukacs took a post as a secondary school teacher in Vienna. However, the poor economic state and the rise of the National Socialists in Germany, resulted in considerable support being given to the Nazis in Austria. By spring\n1933\nAdolf Hitler was in power in Germany, and Nazi propaganda for the incorporation of Austria was greatly increased. Austria turned to Italy for help. All this was bad news for Lukacs, particularly since he was Jewish.\nLukacs left school teaching in\n1933\nand took up a position as an actuary at an insurance company, having\nE Helly\n, another of Jewish origin, amongst his colleagues in the insurance company. The political situation in Austria continued to deteriorate. A civil war followed with four days of fighting. All political parties were abolished except the Fatherland Front but, in July\n1934\n, a group of Nazis attempted to seize power but they were compelled to surrender, and their leaders were executed. Hitler and Mussolini allied themselves in\n1936\nand Austria became totally isolated. During this time Lukacs had married Elizabeth Weisz. They had met at the University of Vienna in\n1927\nwhile they were both studying mathematics and physics.\nIn\n1937\nLukacs left the insurance company. He also taught mathematics at the Volkshochschule Wien Volksheim but his position was becoming increasingly difficult. In March\n1938\n, German troops, accompanied by Hitler himself, entered Austria. Austria was absorbed into Germany and the Nazis arrested the leaders of the Austrian political parties. Many Austrians, especially those of Jewish origin, went into exile and Lukacs and his wife decided that they had to take this route. Elizabeth Lukacs left for the United States late in\n1938\nwhile Eugene left some time later, reaching the United States in February\n1939\n.\nWhile at the University of Vienna, Lukacs had met\nWald\nwho was also a Hungarian Jew. Wald had reached the United States in\n1938\nand now the two made contact.\nWald\nwas working on statistics and\nprobability\nand he persuaded Lukacs to take an interest in this topic too. The job position in the United States was extremely bad, since this was the time following the great depression. However Elizabeth Lukacs found a post teaching at Garrison High School in Baltimore and she encouraged Eugene to apply for a position at Friends High School in Baltimore. He was appointed to teach Latin and advanced mathematics but, after a short time he moved to another college. He taught physics and mathematics at several colleges before being appointed to Our Lady of Cincinnati College in\n1945\n.\nIn\n1942\nLukacs had made an important contribution to mathematical statistics by introducing, for the first time, the method of\ndifferential equations\nin characteristic function theory. He used this method to solve problems of characterisation of distributions. The method allowed him to invesitgate the independence of the sample mean and sample variance in certain cases.\nAfter moving to Cincinnati, Lukacs worked with\nSzász\nwho had held a post there from\n1936\n. The two worked on probability and wrote a number of joint papers. He continued at Our Lady of Cincinnati College until\n1953\n, although he spent some leave working as a mathematical statistician at the National Bureau of Standards in Washington, D.C. In\n1953\nLukacs Eugene joined the Office of Naval Research and he later became the Head of its Statistics.\nLukacs moved again, this time in\n1955\nto the Catholic University of America where, in\n1959\n, he set up the Statistical Laboratory becoming its director. It became an important research establishment, visited by many mathematicians including Harald Cramer,\nJerzy Neyman\n,\nAlfred Renyi\n,\nPaul Lévy\n,\nR A Fisher\n,\nMark Kac\n,\nYu Linnik\n,\nPaul Erdős\n,\nJacob Wolfowitz\n,\nWilliam Cochran\nand\nWilliam Feller\n.\nLukacs retired in\n1972\n, and went first to Bowling Green where he remained for four years. After holding visiting posts back in Europe, in particular his home university of Vienna and at Erlangen, he returned to his home in Washington D.C. in\n1978\n. One of his most important books\nDevelopments in Characteristic Function Theory\nwas published in\n1983\n, eleven years after he retired.\nPerhaps his most famous work was\nCharacteristic Functions\n(1960)\nwhich studied the properties of characteristic functions and their applications. Other topics to which Lukacs made major contributions include characterisations of distributions, stability of characterisation results and functional equations.\nIn\n[\n3\n]\nLukacs's many visiting appointments are listed:-\nEugene liked to travel. This led him to spend time teaching or lecturing as visiting professor at the Sorbonne\n(1961\n-\n62\n,\n1965\n-\n66)\n, the Swiss Federal Institute, Zürich\n(1961\n-\n62)\n, the Institute of Technology, Vienna\n(1965\n-\n66\n,\n1970\n,\n1975\n-\n77)\n, the University of Hull\n(1971)\n, the University of Sheffield\n(1974\n-\n75)\n, the University of Erlangen\n(1977\n-\n78)\n, the University of Brussels\n(1961\n-\n62)\nand the University of Athens\n(1961\n-\n62)\n.\nLukacs's hobbies and interests included stamp and coin collecting, hiking, bird watching, photography and, as stated above, travelling. One of his favourite places was the Mathematics Research Institute at Oberwolfach in southern Germany. He spent part of his holiday at his cottage in the Viennese Woods almost every summer.\nIn\n[\n3\n]\nhis attitude is described:-\nEugene was a constant source of encouragement to his colleagues and students. He showed a great deal of interest in their work and was always available for consultation. He promptly responded to countless queries that he received from all over the world, mostly on questions concerning characteristic functions.\nWe shall miss Eugene greatly, not only for his contributions to probability and statistics but also as a colleague, a friend and as a human being of integrity.\nLukacs undertook many editorial duties. He was an associate editor of the\nJournal of the American Statistical Association\n(1951\n-\n55\n,\n1961\n-\n63)\n, the\nAnnals of Mathematical Statistics\n(1958\n-\n64\n,\n1968\n-\n70)\n, and the\nJournal of Multivariate Analysis\n(1970\n-\n83)\n. Jointly with\nZ W Birnbaum\n, he was the founding editor of the\nAcademic Press Series in Probability and Mathematical Statistics\n(1962\n-\n85)\n.\nHe received many honors such as being elected a fellow of the Institute of Mathematical Statistics in\n1957\n, a fellow of the\nAmerican Statistical Association\nin\n1969\n, and a fellow of the American Association for Advancement of Science in\n1958\n. He was elected to the\nAustrian Academy of Sciences\nin\n1973\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}