{
  "nome_completo": "Eugenio Giuseppe Togliatti",
  "nome_curto": "Eugenio Togliatti",
  "ano_nascimento": "1890",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Togliatti/",
  "lugar_nascimento": "Orbassano, Turin, Piedmont, Italy",
  "lugar_morte": "Genoa, Liguria, Italy",
  "biografia": "Eugenio Togliatti\nwas the son of Antonio Togliatti and Teresa Viale. Antonio was a school teacher and also an accountant for the Administration of National Boarding Schools, while Teresa was also a teacher. Antonio had been born in\n1852\nin Coassolo, a municipality in the Lanzo Valley in the Metropolitan City of Turin. His family wanted him to become a priest in the Roman Catholic Church but Antonio, after studying in the seminary in Giaveno, decided against becoming a priest and studied in Turin to become a teacher. After graduating with a teaching qualification, he taught for a while before becoming an accountant. He married the elementary school teacher from Turin, Teresa Viale. She had to give up her teaching career to care for her children and became the central figure of the family. Antonio's work led to the family moving frequently between different cities.\nAntonio and Teresa had four children: Eugenio Giuseppe Togliatti, the subject of this biography, born in Orbassano, Metropolitan City of Turin, Piedmont, on\n3\nNovember\n1890\n; Maria Cristina Togliatti, born in Genoa, Liguria on\n3\nMay\n1892\n; Palmiro Michele Nicola Togliatti, born in Genoa, Liguria on\n26\nMarch\n1893\n; and Enrico Togliatti, born in Turin in\n1900\n. We will give a little more information about Eugenio's siblings below.\nAlthough Antonio Togliatti had decided not to become a priest, he remained a staunch Roman Catholic and the whole family attended mass every Sunday.\nEugenio Togliatti attended a number of different schools, for example in Genoa, Novara and Sondrio, but completed his secondary education at the Technical Institute in Sondrio in the alpine region of north Italy. He graduated with a physical-mathematical diploma from the Sondrio Technical Institute in\n1908\n, the year when the other members of his family moved to Sassari. His brother Palmiro and his sister Maria Cristina both began to study at the high school Domenico Alberto Azuni in Sassari in\n1908\n. Eugenio, however, began to study for his degree in mathematics at the University of Turin in that year. His studies were supported by a scholarship he was awarded from the Royal College Carlo Alberto, Moncalieri, Turin. He was fortunate in his mathematical studies to be taught by several outstanding mathematicians, in particular\nCorrado Segre\n,\nGuido Fubini\n,\nGino Fano\n,\nGiuseppe Peano\nand\nEnrico D'Ovidio\n. He also became friends with some fellow students who were outstanding mathematicians such as\nAlessandro Terracini\n. These two, who shared research interests in differential projective geometry, became friends beginning in the summer of\n1912\n.\nThe fortunes of the Togliatti family changed dramatically on\n21\nJanuary\n1911\nwhen Antonio Togliatti died of cancer. Soon after the death of her husband, Teresa moved to Turin with her three younger children. Eugenio, who was already in Turin, being the oldest of the children, needed to help support his younger siblings. Although he was still an undergraduate, he was appointed as an extraordinary assistant of Analytic and Projective Geometry at the Polytechnic of Turin. In\n1911\nhis brother Palmiro Togliatti began his university studies, enrolling in the Faculty of Law at the University of Turin. An exceptional student, he won scholarships and prizes to help fund his studies. Also in\n1911\nMaria Cristina Togliatti enrolled to study Modern Philology in the Faculty of Letters and Philosophy of the University of Turin. Eugenio did a remarkable job supporting his younger siblings. Palmiro graduated in November\n1915\nand began a career which led him to become the Secretariat of the Italian Communist Party. Maria Cristina graduated in December\n1915\nwith a degree in literature and became a teacher in secondary schools. Enrico, who was ten year younger than Eugenio, obtained a degree in engineering, which led to him later working at the Southern Electricity Company in Naples.\nLet us see how Eugenio Togliatti managed to support his siblings. He completed his studies at the University of Turin, graduating on\n3\nJuly\n1912\n, while working as an assistant at the polytechnic during his final year of undergraduate studies. For his final examinations, advised by\nCorrado Segre\n, he wrote the thesis\nContributo alla determinazione delle superficie algebriche del\n5\n° ordine con una o più serie infinite di coniche\nⓉ\n(\nContribution to the determination of\n5\nth order algebraic surfaces with one or more infinite series of conics.\n)\n. After graduating, he was appointed as an assistant, at both the University of Turin and at the Polytechnic of Turin, to the chairs of\nGino Fano\n,\nEnrico D'Ovidio\nand\nGuido Fubini\n.\nHis friend\nAlessandro Terracini\nwrote in an autobiography\n(\nsee\n[\n10\n]\n)\n:-\nDuring his service as assistant, my friend E G Togliatti managed to accomplish a feat that has always seemed wonderful to me. With his dual post as assistant at the University and at the Polytechnic, he managed to scrape together two meagre salaries\n(\nit should be noted that at the time each assistant post usually brought in a salary of little more than a hundred lire per month\n)\n, with which - added to a pension from his widowed mother - he performed the miracle of supporting his three siblings in their studies.\nTerracini\nalso writes that, in addition to supporting his siblings studies, Eugenio was able to offer his brothers a holiday in the Alpine village of Mompellato.\nOne might imagine that Eugenio, having two assistant positions, would not have much time for research. He realised, however, that if he was to become a full professor he had to have a strong publication record and indeed he was able to do this. For example, he published:\nSul comportamento d'un sistema\n∞\n1\n∞^{1}\n∞\n1\ndi linee d'una superficie rispetto ad alcune operazioni eseguite su di esso\nⓉ\n(\nOn the behavior of a system ∞\n1\nof lines of a surface with respect to some operations performed on it\n)\n(1912)\n;\nSulle superficie algebriche, del\n5\n° ordine, irriducibili, con un fascio ellittico di coniche\nⓉ\n(\nOn algebraic surfaces, of the\n5\nth order, irreducible, with an elliptic bundle of conics\n)\n(1912)\n;\nLe superficie di sesto ordine con infinite coniche\nⓉ\n(\nSurfaces of the\n6\nth order with infinitely many conics\n)\n(1914\n-\n1917)\n;\nSulle superficie algebriche contenenti infinite coniche\nⓉ\n(\nOn algebraic surfaces containing infinitely many conics\n)\n(1915)\n; and\nSulle superficie di\n6\n° ordine contenenti infinite coniche\nⓉ\n(\nOn surfaces of the\n6\nth order containing infinitely many conics\n)\n(1915)\n.\nAt the public\nLeibniz\nsession of the\nRoyal Berlin Academy of Sciences\nheld in Berlin on\n30\nJune\n1910\nthe academy proposed the following problem for the solution of which the\nSteiner\nprize of\n7000\nmarks was to be awarded in\n1914\n[\n12\n]\n:-\nTo determine all those non-degenerate surfaces of order five on which one or more series of conies lie, and to investigate their properties. It is required to confirm the correctness and completeness of the solution by furnishing an analytic commentary on the results of the geometric investigation.\n... competing memoirs should be written in German, French, Latin, English, or Italian, and be submitted to the secretary of the academy under the usual conditions on or before\n31\nDecember\n1913\n.\nTogliatti submitted his entry\nThe determination of all non-degenerate surfaces of the fifth order on which lie one or more series of conics\nwhich was one of seven entries for the\nSteiner\nPrize to be awarded in\n1914\n. The outbreak of World War I in July\n1914\nled to Germany entering the war on\n1\nAugust\n1914\nand the award of the\nSteiner\nPrize had to be delayed. In fact it was not until\n1922\nthat Togliatti was declared the winner of the\nSteiner\nPrize and it was\n1923\nbefore the award could be made\n[\n13\n]\n:-\nThe\nBerlin Academy of Sciences\nhas awarded its\nSteiner\nprize for a memoir on 'The determination of all non-degenerate surfaces of the fifth order on which lie one or more series of conics' to Dr E G Togliatti, of the University of Turin. This subject was announced in\n1910\n, but the award was delayed by war conditions.\nNow\n7000\nmarks in\n1914\nwas worth roughly the buying power of $\n55\n,\n000\ntoday and would have been life changing to the young Togliatti in supporting his family. Sadly German hyperinflation in the\n1920\ns meant that by the time Togliatti received the award it was practically worthless.\nDuring World War I, Togliatti had been called up for military service but this only happened in July\n1918\nnear the end of the war. He was, at that time, an assistant to\nGino Fano\nwho was very keen that he should be excused military service.\nFano\napproached the Ministry of War and made a case for Togliatti to be discharged or at least be given extraordinary leave. These requests were ignored and Togliatti was enlisted in Ivrea, a town about\n50\nkm north of Turin, and served as a private in the\n54\nth infantry regiment.\nBack in Turin for the start of the\n1919\n-\n20\nsession, he began teaching the course in projective and descriptive geometry. He taught this course until\n1924\nand, in addition, he taught the course in complementary mathematics in the academic year\n1923\n-\n24\n. Let us explain that complementary mathematics is an Italian academic discipline involving the history of mathematics, foundations of mathematics, and mathematical didactics.\nIn\n1924\nTogliatti left Turin and went to Switzerland when he was appointed as associate professor of Applied Mathematics at the Eidgenössische Technische Hochschule in Zürich. He remained in Zurich until\n1926\nwhen, having won the competition for the Genoa chair, he returned to Italy to take up the appointment of the chair of Analytical and Projective Geometry at the University of Genoa.\nTogliatti's brother Palmiro had become highly involved in politics. Eugenio Togliatti said that during World War I, Palmiro was\n[\n2\n]\n:-\n... hypercritical of the government's neutralist attitude and harshly anti-Giolitti\n(\nGiovanni Giolitti was the Italian Prime Minister\n)\n.\nPalmiro Togliatti had become a founding member of the Communist Party of Italy in\n1921\n. Benito Mussolini's government made the Communist Party illegal in\n1926\nand many party members were arrested. Palmiro was in Russia at the time and avoided arrest but he was elected General-Secretary of the Communist Party of Italy in\n1927\nand had to remain in exile for many years. Although Eugenio Togliatti was strongly opposed to Mussolini's Fascist regime, he tried to keep out of politics and concentrate on his mathematical career. This must have been quite difficult given his brother's high profile.\nIn Genoa, Togliatti met Giulietta Nacamuli. She had been born in Cairo, the daughter of the engineer Ruggero Nacamuli\n(\nborn in Padua in\n1876)\nand his wife Aurelia Camerino\n(\nborn in Venice in\n1875)\n. She graduated with a mathematics degree from Genoa in\n1925\nand, following her graduation, was appointed as an assistant to Francesco Porro\n(1861\n-\n1937)\n, professor of astronomy at the University of Genoa. After two years as an assistant at the Genoa Observatory, in\n1927\nshe was appointed as assistant to Mario Bedarida\n(1890\n-\n1957)\n, the professor of algebraic analysis at Genoa. Eugenio Togliatti married Giulietta Nacamuli and they had two children, Vittorio Togliatti and Giovanna Togliatti\n(1932\n-\n1990)\n. Vittorio became a high school teacher but also worked for the Italian Communist Party. In August\n1972\n, he was charged with stealing explosives and weapons, and plotting subversion with a group of wealthy professional people. He was released after a week and all charges were dropped. Giovanna graduated in mathematics, became a member of the Istituto di Topografia, Fotogrammerria e Geofisica, Politecnico di Milano and died on\n13\nNovember\n1990\n.\nFor Togliatti's mathematical contribution during his career at Genoa, let us quote from\n[\n8\n]\n:-\nIn the field of projective-differential geometry, his research on three-dimensional varieties of five-dimensional space whose principal tangents present coincidences is noteworthy. He also studied hyperspatial surfaces that represent Laplace equations in the case in which such surfaces are algebraic or rational. In the field of algebraic geometry he constructed a fifth-degree surface with\n31\nnodes, known as the Togliatti surface, obtaining a significant partial result within the problem of determining the maximum number of nodes that an algebraic surface of order n of the ordinary projective space can possess. He was also interested in the teaching of mathematics in secondary schools, dedicating numerous popular articles to improving the scientific culture of teachers.\nA picture of this surface is at\nTHIS LINK\n.\nWe note that the fifth-degree surface with\n31\nnodes which Togliatti constructed in\n1940\nin his paper\nUna notevole superficie di\n5\n° ordine con soli punti doppi isolati\nⓉ\n(\nA remarkable surface of the\n5\nth order with only isolated double points\n)\nwas the first example of such a surface. For\n40\nyears it was an open problem to determine whether\n31\nwas the maximum number of nodes possible for a fifth-degree surface. In\n1980\nArnaud Beauville proved that no fifth-degree surface can have more that\n31\nnodes, so Togliatti example is optimal.\nTogliatti attended the International Congress of Mathematicians held in Bologna in September\n1928\n. His work was mentioned by two speakers at the conference,\nAlfred Rosenblatt\nand Charles H Sisam. At this Congress, delegates were welcomed by the Podestà of Bologna, Hon L Arpinati, who said:-\nFascist Bologna is proud to welcome you and to be able to show you what it has become under the vivifying impulse of Fascism.\nWe have to feel sorry for Togliatti when he heard these words, for he hated Fascism but refused to have any involvement in politics. Togliatti also attended the International Congress of Mathematicians held in Zurich in September\n1932\n.\nFrancesco Severi\n, the President of the Italian delegation, gave a speech at this Congress in which he said:-\nI must also remember with particular satisfaction that one of ours, Professor Eugenio Togliatti, taught here in fraternal intimacy with his Swiss colleagues ...\nTogliatti also attended the International Congress of Mathematicians held in Amsterdam in September\n1954\n.\nAt the University of Genoa, Togliatti was Dean of the Faculty of Science from\n1931\nto\n1963\n. He also served as Vice-President of the Opera Universitaria, which aimed to support students during their university career. From\n1933\nhe was the director of the Mathematical Institute, continuing to hold this position until\n1966\n. He also took a role in supporting mathematics on an Italian scale being a member of the\nItalian Mathematical Union\nfrom its foundation in\n1922\n, and serving on its organising committee on several occasions. He served as national president of the \"Mathesis\" Society and also served on the Italian Commission for the Teaching of Mathematics.\nAs Fascist Italy moved towards World War II the Togliatti family had two major problems. Togliatti had a brother who was the leader of the Italian Communists and his wife was a Jew. The Racial Laws of November\n1938\nexcluded Jews from public office and higher education, in addition to imposing many other restrictions. After Italy agreed an armistice with the Allies in September\n1943\n, German troops took control of much of north Italy and Jews in that area were in danger of being put into concentration camps. On\n16\nDecember\n1943\n, Giulietta's father Ruggero, her mother Aurelia, her sister Iside\n(\nborn in Cairo in\n1904)\nand her aunts Benvenuta and Eugenia Camerino\n(\nboth born in Venice, in\n1869\nand\n1872\nrespectively\n)\nwere arrested by the Germans in Chiavari, about\n40\nkm south of Genoa. On\n6\nFebruary\n1944\nthey all arrived in the Auschwitz concentration camp, and with the possible exception of Iside, were killed on the day they arrived. Iside probably died later some time later in Auschwitz. Giulietta had managed to avoid arrest by moving around Italy with her husband and two children. Later in\n1944\nTogliatti also became in danger\n(\nsee\n[\n1\n]\n)\n:-\nFar from active politics, the fact of being Palmiro Togliatti's brother caused Eugenio Togliatti some serious problems in September\n1944\n, during the period of the Italian Social Republic. In fact, an arrest warrant was issued by the Genoa police headquarters; the intention seemed to be to use him as a hostage in a prisoner exchange with the partisans. But a partisan courier made sure that the professor, who was living in Frabosa Soprana in the province of Cuneo at that time, was informed in time so that he could save himself together with his family.\nIn April\n1945\nwith the Allies in control of almost all of Italy, the Togliatti family returned to Genoa. He continued to hold his position in the University of Genoa until he retired in\n1967\nand was made professor emeritus.\nTogliatti received several honours: he was elected a corresponding member of the\nAccademia dei Lincei\nin\n1957\nand a full member in\n1968\n; he was elected a corresponding member of the Academy of Sciences of Turin; he also a member of the Ligurian Academy of Sciences and Letters, and served a term as president of its class of physical, mathematical and natural sciences.\nAlthough Togliatti had spent his life avoiding politics, he decided in\n1960\nthat he could not continue to keep his views to himself. The neo-Fascist Italian Social Movement proposed holding their Congress in Genoa on\n3\nJuly\n1960\n. Togliatti said:-\nI have never been involved in politics but I feel that in these moments one cannot stay outside.\nAlthough shy and very reserved, Togliatti made his political statement by leading a procession of anti-fascist students and teachers.\nHe died in Genoa at the age of\n87\n. A report of his death reads\n(\nsee\n[\n1\n]\n)\n:-\nEugenio Togliatti, the elder brother of comrade Palmiro Togliatti and a distinguished mathematician, died yesterday morning in Genoa at the age of\n87\n. Eugenio Togliatti was struck down by an attack of bronchopneumonia after his body had been weakened in recent months by an operation for a cerebral haemorrhage, the same illness that caused Palmiro's death. If one element of his biography should be highlighted, it is his intellectual rigour. A rigour directed mainly towards the deepening of a scientific activity that made Eugenio Togliatti one of the most notable personalities in the mathematical field.\nThe head of the Communist Party of Italy sent a telegram to Togliatti's wife and children following his death\n[\n1\n]\n:-\nThe most sincere and profound condolences of the party leadership and my personal ones for the painful passing of Professor Eugenio Togliatti. The communists and the men of culture and the Italian school will always remember him as a clear figure of a democrat and as an anti-fascist and above all as an exemplary teacher in whose humane and rigorous classes generations of scholars were educated and formed.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}