{
  "nome_completo": "Eugenio Elia Levi",
  "nome_curto": "Eugenio Levi",
  "ano_nascimento": "1883",
  "ano_morte": "1917",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levi_Eugenio/",
  "lugar_nascimento": "Turin, Italy",
  "lugar_morte": "Cormons, Italy",
  "biografia": "Eugenio Levi\n's parents were Giulio Giacomo Levi and Diamantina Pugliese. The family was Jewish and Eugenio was the ninth of his parents' ten children. The fourth of these ten children was\nBeppo Levi\n(\nborn\n1875)\nwho also became a mathematician and has a biography in this archive. The youngest member of the family was Decio Levi\n(1885\n-\n1917)\n, who became an engineer. Their father\n[\n2\n]\n:-\nGiulio Giacomo Levi\n(1834\n-\n1898)\npractised as a lawyer, but was also the author of several books on political and social issues, such as 'Labour and freedom' and 'The failure of socialism', which reveal his preoccupation with solving social problems, without abandoning the liberal ideas challenged by nascent socialism.\nEugenio attended the Azeglio High School in Turin where he showed that he was an extremely gifted pupil. He graduated in\n1900\n, and entered the Scuola Normale Superiore of Pisa. There he was taught by\nLuigi Bianchi\nwho had been promoted to professor of analytic geometry at the Scuola Normale Superiore in\n1890\n. Two aspects of\nBianchi\n's work would be particularly significant in his influences on Levi. He had published two important works before Levi began to study with him, namely\nLectures on differential geometry\n(1894)\nand\nLectures on the theory of groups of substitutions\n(1900)\n. The other mathematician in Pisa who had a major influence on Levi's research was\nUlisse Dini\nwho held two chairs at the University of Pisa, the chair of analysis and higher geometry, and the chair of infinitesimal analysis.\nIn\n1904\nLevi graduated from the Scuola Normale Superiore of Pisa with the award of his laurea. He remained at Pisa where he became an assistant to\nUlisse Dini\n. Levi published\nSulla struttura dei gruppi finiti e continui\nⓉ\n(\nOn the structure of finite and continuous groups\n)\nin\n1905\n, the paper having been presented to Academy of Science of Turin on\n2\nApril of that year by\nBianchi\n. In\n1906\nLevi submitted his\nhabilitation\nthesis\nSulle equazioni lineari totalmente ellittiche alle derivate parziali\nto the Scuola Normale Superiore. This important work studied partial differential equations of order\n2\nn\n2n\n2\nn\n, linear in two variables fully elliptic in a certain region of the plane. He published a short note in the journal of the\nReale Accademia dei Lincei\nin\n1907\nannouncing the results which were fully presented in a paper in the journal of the\nCircolo Matematico di Palermo\nin the same year. In this work he looked at existence and uniqueness theorems using techniques similar to those introduced by\nDavid Hilbert\na couple of years later.\nLevi became interested in the\nCauchy\nproblem. Since the problem could not be solved in general, he examined special cases starting with linear equations in two variables and then extending the ideas to the non-linear case. He published his work in this area in the paper\nSul problema di Cauchy per le equazioni lineari in due variabili a caratteristiche reali\nⓉ\n(\nOn the Cauchy problem for linear equations in two variables with real characteristics\n)\n(1908)\n. Also in\n1908\nhe entered the competition for the chair of infinitesimal analysis at the University of Messina. Although he was not successful, he came second in the ranked list of candidates showing that he would soon gain a chair. Indeed he did just that one year later when he was successful in the competition for the chair of infinitesimal analysis in the Faculty of Science of the University of Genoa. He published important papers on the theory of functions of several complex variables:\nStudii sui punti singolari essenziali delle funzioni analitiche di due o più variabili complesse\nⓉ\n(\nConsideration of the essential singular points of analytic functions of two or more complex variables\n)\n(1910)\nand\nSulle ipersuperficie dello spazio a\n4\ndimensioni che possono essere frontiera del campo di esistenza di una funzione analitica di due variabili complesse\nⓉ\n(\nOn the hypersurface of space in\n4\ndimensions that can be the border of the field of existence of an analytic function of two complex variables\n)\n(1911)\n. Also in\n1911\nhe published\nSopra un teorema di esistenza per le equazioni alle derivate parziali del secondo ordine\nⓉ\n(\nOn an existence theorem for partial differential equations of second order\n)\nwhich made similar contributions to the\nGoursat\nproblem that he had made earlier to the\nCauchy\nproblem. In\n1912\nhe was promoted to full professor. In\n1912\nEnrico D'Ovidio\n,\nLuigi Bianchi\nand\nVito Volterra\nformed a committee for awarding the Gold Medal of the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\n. The medal was awarded to Levi, and the article\n[\n5\n]\ndetails the reasons of the committee.\nThe authors of\n[\n1\n]\ngive the following summary of Levi's mathematical achievements:-\nIn complex analysis, Eugenio Elia's research focused on the singular point sets of a\nholomorphic\nfunction of several variables. However, he also wrote on issues relating to:\ndifferential geometry\n,\nLie\ngroups, partial differential equations and the minimum principle. E E Levi would also demonstrate the falsity of\nWeierstrass\n's conjecture according to which given an open A of\nC\n2\n\\mathbb{C}^{2}\nC\n2\n, a\nmeromorphic\nfunction will always exist in A which has essential singularities in each point of the boundary of A, providing further evidence in favour of the differentiation between the theory of the single complex variable and the theory of more than one complex variable.\nLevi's remarkable mathematical career came to an end with the outbreak of World War I.  Italy did not enter the war when it broke out in\n1914\nalthough at this stage most people in the country would have supported Germany, but had a long-standing rivalry with Austria-Hungary. Only in April\n1915\ndid Italy enter the war, persuaded to come in on the side of the Allies, Russia, France and Britain. It was over one year later, in October\n1916\n, that Levi entered military service in, as a lieutenant in the\n1\nst\nRegiment of Engineers stationed at their headquarters in Pavia. In December\n1916\nhe returned to teaching. In fact he taught a fundamental discipline that would have given him the right, if he wished, to be exempted from military service. Levi, however, was highly patriotic wished to return to military service. He was an exceptionally good organiser and a very hard worker so he was rapidly promoted to captain. He also showed exceptional bravery for which he was awarded a decorative bronze medal.\nIn August\n1917\nhe was transferred to the region of Gorizia. A few weeks later, news reached him that his brother Decio had been killed in action on Monte Santo. In May\n1917\n,\nThe Times\nnewspaper had reported, \"Fighting is raging furiously for Monte Santo. The Austrian batteries sighted the Italians advancing along the river road and began belching forth shrapnel. ... fighting reached the heights of heroism and tenacity.\" On\n24\nAugust\n1917\nthe Italians captured Monte Santo but the Austrians continued to put up fierce resistance. Decio Levi, who was a major in the Italian army, was killed on\n15\nSeptember as fighting continued in the Monte Santo area. Eugenio Levi was a captain in charge of a company of engineers in the same general area. Although these victories by the Italians against Austrian troops in northern Italy were not decisive, nevertheless, the Germans sent reinforcements to strengthen the Austrian army. The German troops decided that the weakest point in the Italian lines was at Caporetto and, on\n24\nOctober they attacked. After six hours of continuous pounding, the Italian lines were broken near Gabria and San Daniele del Carso. The retreat of the Italians from Caporetto began - it was the most disastrous defeat in the history of the Italian army. During the retreat, Eugenio Levi was hit in the forehead by a stray bullet. He died immediately.\nLet us end this biography by quoting\nGuido Fubini\n's appreciation of the depth of Levi's contributions\n[\n4\n]\n:-\nThe work of E E Levi almost always deal with issues of fundamental importance: he was not discouraged by the difficulties, even major ones, encountered by other mathematicians, and with a more profound analysis, often very simple and ingenious, was able to clarify and overcome them. He did not approach these problems from only one angle, but did so from every direction.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}