{
  "nome_completo": "Evan James Williams",
  "nome_curto": "Evan James Williams",
  "ano_nascimento": "1903",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Williams_Evan/",
  "lugar_nascimento": "Cwmsychbant, Ceredigion, Wales",
  "lugar_morte": "Brynawel, Cwmsychbant, Carmarthenshire, Wales",
  "biografia": "Evan James Williams\n, known as 'Desin', was the son of the stonemason James Williams\n(1868\n-\n1950)\nand Elizabeth Lloyd\n(1870\n-\n1948)\n. Elizabeth, known as 'Bes', came from a family who lived in Llanfihangel-ar-arth, Llandysul but when her father died shortly before she was born, the family moved to Cwmsychbant to live with her maternal grandparents. James Williams lived in Cwmsychbant and got to know Elizabeth at school. They married in\n1893\nand had three children: Dafydd Williams\n(4\nAugust\n1894\n-\n9\nAugust\n1970)\n, John Williams\n(24\nMarch\n1896\n-\n15\nMarch\n1983)\n, and Evan James Williams, the subject of this biography.\nGoronwy Evans describes James Williams as\n[\n8\n]\n:-\n... a man of stature in the community, a strong character not shy of expressing his opinion.\nEvans describes Elizabeth Williams as\n[\n8\n]\n:-\n... a kindly woman full of energy and animation, the focal point of the home, around whom there was always much humour and laughter.\nJames Williams was a staunch member of the Congregational Chapel, attending services every Sunday in Brynteg, two miles from his home. He composed poems and was a regular competitor at the local eisteddfodau, where he frequently won a prize. With the help of Elizabeth's brother, he built the house named Brynawel in Cwmsychbant where Evan and his brothers were brought up. Let us note that at the time of the\n1911\ncensus, James and Elizabeth Williams, together with their three sons, were living at Brynawel. James is listed as speaking both English and Welsh as does the eldest son Dafydd\n(\nlisted as David\n)\n, who is as assistant teacher. The other two sons, John and Evan James, are both are listed as speaking only Welsh; they are both at school. It was a religious family, with daily Bible readings, and both James and Elizabeth were passionate about education and made sacrifices to give their sons the best possible.\nBefore continuing with the biography of Evan James, let us give some details about his two elder brothers. Dafydd taught mathematics at the school in Llanwenog where he had been a pupil, then joined the Civil Service but, not liking the work in the Customs and Excise Office, he joined the army. After World War I he studied engineering and spent the rest of his career at the Royal Aircraft Establishment in Farnborough. John's school education suffered because he had poor health but he attended night school and qualified as an optician. He had a business in Maesteg where he also carried out repairs to jewellery and watches.\nEvan James attended Llanwenog National School, the same primary school in Llanwenog that both his brothers had attended. At this school he was sometimes taught by his oldest brother Dafydd\n[\n8\n]\n:-\nEveryone knew him as Desin, because he was renowned for his ability to do mental arithmetic very quickly.\nHe showed himself to be exceptionally talented and, when twelve years old in\n1915\n, he sat the county examinations and gained the highest marks which gave him a free place at Llandysul County School. The school had an outstanding headmaster William Lewis who was the first headmaster appointed when the school was founded in\n1895\n. He had been a fifth Wrangler in the Mathematical Tripos at Cambridge, and it was through him that Williams became attracted to mathematics and physics. Learning\n[\n18\n]\n:-\n... became an undiluted pleasure under Lewis's influence and inspiration, ensuring that Evan James's interest in physics and mathematics would flourish.\nLewis was not the only outstanding teacher at the school, for he was taught science by John Jones who had been a primary school teacher before moving to Llandysul County School to fill a vacancy caused by World War I\n[\n18\n]\n:-\nDespite his modest qualifications, Jones was an excellent teacher and his lessons used 'life and colour' to animate his subject. For Evan James, this was a sheer joy. Through his teaching, Jones gave Evan James the thrill of interpreting and understanding experimental results, a practice that remained close to his heart throughout his academic career.\nWilliams was not the only outstanding mathematician at the school for\nEvan Tom Davies\nwas also a pupil and was one year younger that Williams. The two boys became firm friends and in fact shared lodgings at\n6\nMarble Terrace in Llandysul. Williams would return home each weekend\n[\n8\n]\n:-\nAs a boy, a contemporary describes him as nearly as broad as he was tall, with a broad grin, a passion for cricket and a propensity for practical jokes and escapades.\nWynne writes\n[\n18\n]\n:-\nAccording to\nEvan Davies\n, Evan James was forever at the centre of some rumpus or other, his laughter louder than everyone else's and the possibility of playing practical jokes never far from his mind. On one occasion,\nEvan Davies\nwas rebuked by the science teacher because his homework notes on practical work included meaningless diagrams. This was as great a surprise to\nEvan Davies\nas it was to his teacher, but it soon became clear that Evan James had managed to get hold of his homework book after\nEvan Davies\nhad finished the exercises, and had changed the diagrams. This instinct for leg-pulling stayed with\nEvan Davies\nfor the rest of his life.\nIn\n1918\nWilliams sat the Central Welsh Board School Certificate Examinations. He received distinctions in arithmetic, geometry, physics and mechanics. He only achieved a bare pass in Latin, however, and\nEvan Davies\nclaimed this was quite deliberate since Williams believed that only swots got high Latin marks. He then competed for an open scholarship to Swansea Technical College and, after winning one of the four scholarships, entered the College in\n1919\n. The College was due to become part of the University of Wales so Williams knew that he would be able to register as a University of College student and he did so in October\n1920\n.\nAt first, probably influenced by his brother Dafydd, he began studying engineering but after only one term he changed to a pure science degree taking courses in physics, chemistry and mathematics. At the end of his first year at the College he sat the University of London external examinations in these three subjects. Williams, in his second year and now a student of the University College Swansea, had Evan Jenkin Evans\n(1882\n-\n1944)\nas his physics professor\n[\n16\n]\n:-\nIn\n1920\n[\nE J Evans\n]\nwas appointed to the Chair of Physics in the new University College of Swansea. Temporary accommodation was found for the department in the Technical College, while the new laboratories were being built. Evans gave much time to the design and equipping of the laboratories which were opened in\n1922\n. ... He was a gifted and conscientious teacher.\nE J Evans quickly saw that he had an exceptionally talented student in Williams, and encouraged him to specialise in theoretical physics and theoretical chemistry. In\n1921\n, a Physical and Mathematical Society was founded for staff and students at the University College Swansea. On\n27\nMay twenty people attended its first meeting which was held in Dumbarton House, Bryn-y-Mor Road, Uplands. E J Evans was elected the first president while Williams was elected the first secretary. Meticulous minutes were kept by secretary Williams, who delivered a lecture after Christmas on the atomic nature of electricity.\nWilliams graduated in\n1923\nwith First Class Honours in Physics. The external examiner was Charles Barkla\n(1877\n-\n1944)\nwho was the professor of Natural Philosophy at the University of Edinburgh. An outstanding scientist, Barkla had been awarded the Nobel Prize in Physics in\n1917\nfor his work in X-ray spectroscopy. Barkla examined Williams and wrote:-\n... his papers submitted in the Honours Degree Examination were some of the most remarkable I have ever had the privilege of reading.\nWilliams remained at University College Swansea where he studied for his M.Sc. advised by E J Evans. He was awarded the degree in\n1924\nhaving undertaken research on two projects:\n(\ni\n)\nthe temperature variation of the conductivity of mercury and some of its dilute amalgams and\n(\nii\n)\na theoretical investigation of the effect of a magnetic field on the resistance of liquid metals. This outstanding work was published in two papers\nThe electrical conductivity of some dilute liquid amalgams\n(1925)\nand\nThe effect of a magnetic field on the electrical resistance of liquid metals and alloys\n(1925)\n. Both were communicated by E J Evans and were published in\nThe London, Edinburgh, and Dublin Philosophical Magazine and Journal of Science\n.\nIn\n1925\nhe won a University of Wales Fellowship and went to Manchester to undertake research for a Ph.D. advised by William Lawrence Bragg\n(1890\n-\n1971)\n. W L Bragg was a leading physicist who, jointly with his father William Henry Bragg, had won the Nobel Prize in Physics in\n1915\n:-\nFor their services in the analysis of crystal structure by means of X-rays.\nWilliams wrote a two-part Ph.D. thesis, the first part\nOn the Scattering of X-rays and the Quantum Theory\nand the second part\nThe ranges of\nβ\n\\beta\nβ\n-rays\n. He writes:-\nThe work done by the writer described in this thesis was carried out under the supervision of Professor W L Bragg, F.R.S., and the writer wishes to express his deep gratitude to Professor Bragg for his kind advice and many helpful suggestions during the course of this work.\nHe submitted his thesis to the University of Manchester on\n11\nNovember\n1926\nand was awarded his Ph.D. Even before submitting the thesis, Williams had three papers published in\n1926\n, two of which were joint papers written with John Mitchell Nuttall\n(1890\n-\n1958)\n. Nuttall was a Senior Lecturer in Physics at the University of Manchester and assistant director of the Physics Department. The two Williams-Nuttall papers essentially formed two chapters in William's Ph.D. thesis.\nIn\n1927\nhe published\nThe Passage of\nα\n\\alpha\nα\n-Rays and\nβ\n\\beta\nβ\n-Rays through Matter\nwhich has the following abstract\n[\n17\n]\n:-\nThe loss of energy suffered by a fast-moving electrified particle passing through matter, and the ionisation produced by the moving particle, are phenomena which have, so far, not received accurate quantitative explanation. There are two main theories of the stopping-power due respectively to\nBohr\nand Henderson. The theory of the primary ionisation due to a fast-moving particle is as it was left by Thomson in\n1912\n. In all these theories, classical mechanics is used to calculate the possible energy transfers during encounters between the moving particle and the atomic electrons, and\nFowler\nhas suggested that the discrepancy which exists between theory and experiment may be due to the inaccuracy of classical mechanics in this field. Whether this is so or not, it may be of interest that a fair proportion of the discrepancy between classical calculations and experimental results disappears when the motion of the atomic electrons is allowed for. The effect of this motion may be considerable, though the velocity of the electron be small compared with that of the moving electrified particle.\nWilliams then was awarded an\n1851\nExhibition Scholarship and went to Gonville and Caius College, Cambridge, as a Senior Research Student working at the Cavendish Laboratories. In his\n1929\npaper\nThe Straggling of\nβ\n\\beta\nβ\n-Particles\nhe writes:-\nI wish to express my thanks to Sir Ernest Rutherford, Dr C D Ellis and Mr\nR H Fowler\nfor the interest they have taken in this work.\nHaving achieved a second Ph.D., this time from the University of Cambridge in\n1929\n, and a D.Sc. from the University of Wales in\n1930\n, Williams was appointed as an Assistant Lecturer at the University of Manchester. In\n1930\nWilliams became engaged to a Welsh girl and they intended to marry later that year. The girl, however, broke off the engagement some months before the wedding, probably because Williams concentrated on his research so much that he had little time to devote to their relationship. He spent\n1933\n-\n34\nworking with\nNiels Bohr\nin Copenhagen supported by a Rockefeller Scholarship. Blackett writes:-\n... it was then that his brilliant talent as a theoretical physicist came to full fruition.\nBohr\nwas very impressed by Williams and, following Williams' death, wrote\n(\nsee\n[\n1\n]\n)\n:-\nYou are quite right that from his long stay in this Institute, where he performed most admirable work, I had a deep appreciation of his remarkable ability and clearness of mind. Of course he had shown great gifts already in his earlier investigations, but it is true that we came into very close contact by common interest in the simple elucidation of fundamental problems and paradoxes of complementarity. In fact, Williams and I had planned together to write a treatise on collision phenomena on such lines but, due to the isolation brought about by the war, this plan never materialised.\nIn Copenhagen, Williams became friendly with Eli Winther. She was probably one of the two sisters lodging in the same house as him\n[\n18\n]\n:-\nThe correspondence from her suggests that Winther had fallen head over heels in love with Williams, and they remained in regular contact after Williams returned to Manchester in November\n1934\n. But it became gradually obvious that Williams saw the relationship differently to Winther. Perhaps the depth of her feeling was not clear to him.\nWilliams never married, but he was soon engaged for a second time\n[\n18\n]\n:-\nMeanwhile, a Welsh girl named Mair Williams had become part of Williams's life. She lived in north Wales, and it appears that their courtship began while Williams was at Manchester. In her letters to Williams, she frequently described how she enjoyed their meetings and reading his letters, and often asked him to visit her despite concern for his safety while driving\n(\na well-founded concern in light of comments by others about his behaviour behind the steering wheel\n)\n. They became engaged in\n1935\n, and it is very possible that they would have married. Sadly, Mair fell ill and, without adequate medical attention at the time, she consequently had to face a series of difficult operations. According to his brother, Williams was very concerned about her condition, and lost weight through worry. He shared his concern with others in the laboratory, and in a letter Chadwick expressed his own concerns over Mair's wellbeing. Sadly any wedding plans were abandoned.\nIn\n1938\nWilliams was appointed to the Chair of Physics at the University College Aberystwyth, part of the University of Wales. In addition, his outstanding academic achievements led to his election as a fellow of the\nRoyal Society\nin March\n1939\n. At the height of his powers, he had written\n34\npapers by this time, he was expected to make many more stunning contributions to theoretical physics. Blackett writes\n[\n2\n]\n:-\nWilliams was distinguished both as an experimental and theoretical physicist. His experimental work was mainly concerned with studies of electronic and atomic collision processes, using the cloud chamber of C T R Wilson. The most striking of his experimental achievements was the direct demonstration in\n1940\nby the cloud chamber method of the decay of a cosmic ray meson into an electron. Skilful though he was as an experimenter, Williams' distinction lay perhaps even more in his rare gift of analysing in detail the mechanisms of complicated physical processes, using a minimum of mathematical analysis and a maximum of physical understanding. In this quality of mind he had something in common with\nNiels Bohr\n...\nThings, however, changed dramatically with the outbreak of World War II in\n1939\n. Patrick Maynard Stuart Blackett\n(1897\n-\n1974)\nhad been appointed as a scientific officer at the Royal Aircraft Establishment in Farnborough at the start of the war and he requested Williams to join him at the end of\n1939\n. Williams now worked on the threat posed by German submarines. Near the beginning of\n1941\n, the Admiralty set to a new department of Operational Research at Coastal Command's headquarters in Northwood, Middlesex. Blackett was appointed head of Operational Research and Williams joined him there. He began applying the mathematical methods of Operations Research to the problems of German submarines. Blackett writes\n[\n2\n]\n:-\nWilliams turned his powerful analytic mind to many of the most important problems of the U-boat war, and made contributions of decisive importance to the winning of the campaign. His first work in this field, made during the summer of\n1941\n, lay in the analysis of the process of attack on U-boats by aircraft. Simple but penetrating arguments, based on the actual observed facts of such attacks and on theoretical reasoning about these facts, showed that certain changes in the depth-setting and spacing of the depth charges should lead to a striking improvement in the number of U-boats sunk. The changes were made and the predicted results were attained, thus revolutionising the attacking power of Coastal Command aircraft.\nBy\n1942\n, Williams was head of the Operational Research Section of Coastal Command. His work as scientific adviser to the Navy on methods of combating submarines, Blackett claims, led to the defeat of the German U-boat campaign by the summer of\n1943\nand made the planning for the allied invasion of Europe possible. He was appointed assistant director of research in the Navy in\n1944\n, but in February of that year he was diagnosed with bowel cancer. He underwent two operations but sadly they were not successful and he died at his parents' home Brynawel in Cwmsychbant in September\n1945\n.\nFor details of Williams' character and, in particular, his battle against cancer, see\nTHIS LINK\n.\nIn\n2017\nRowland Wynne published the book\nEvan James Williams: Ffisegydd yr Atom\nwritten in Welsh\n(\nsee\n[\n19\n]\n)\n. An English translation\nEvan James Williams: Atomic Physicist\nwas published in\n2020\n. For more information about this excellent book, see\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}