{
  "nome_completo": "Evan Tom Davies",
  "nome_curto": "Evan (Ianto) Davies",
  "ano_nascimento": "1904",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davies/",
  "lugar_nascimento": "Pencader, Carmarthenshire, Wales",
  "lugar_morte": "Waterloo, Ontario, Canada",
  "biografia": "Evan\n(\nIanto\n)\nDavies\n's parents were Thomas and Elizabeth Davies. The family were Welsh-speaking farmers and Ianto\n(\nas he was known to his friends and colleagues throughout his life\n)\nwas the younger of his parents' two sons. The village of Pencader in which he was born is about\n28\nkm east of Cardigan and about\n15\nkm north of the county town of Carmarthen. Davies attended primary school in Pencader but for his secondary education he attended Llandysul County School, an excellent high school in the nearby market town of Llandysul. This secondary school, at which Davies won a free place, had an outstanding headmaster William Lewis. Lewis had been a fifth\nWrangler\nin the Mathematical Tripos at Cambridge, and it was through him that Davies became attracted to mathematics and physics. Remarkably Davies was not the only pupil at the school who was outstanding in mathematics for, one year older than Davies, was\nEvan James Williams\n; the two boys became close friends.\nE J Williams\nwent on to become Professor of Physics at the University College of Wales, Aberystwyth, and a fellow of the Royal Society. After taking his Higher School Certificate at Llandysul County School, Davies entered the University College of Wales at Aberystwyth in\n1921\n. He graduated with the degree of B.Sc. with honours in applied mathematics in\n1924\nand then went to University College, Swansea, where he studied pure mathematics. He graduated with honours in pure mathematics\n(\nbecoming the first student to graduate with this degree from Swansea\n)\n, then continued to study at Swansea. He was awarded an M.Sc. for a thesis on\nn\nn\nn\n-dimensional geometry in\n1926\n.\nThe person who influenced Davies most during these years was\nPaul Dienes\n, a Hungarian who had worked under\nÉmile Borel\nand\nJacques Hadamard\nin Paris.\nDienes\nwas appointed to University College, Aberystwyth, in October\n1921\n, joining\nWilliam Henry Young\n. Davies was taught by both\nDienes\nand\nYoung\nduring his undergraduate years in Aberystwyth. In\n1923\nYoung\nleft Aberystwyth and, as a consequence,\nDienes\ntook up a lectureship at University College, Swansea, in that year. At Swansea, Davies had worked under\nDienes\nwho advised him to work on the absolute differential calculus.\nDienes\nhad become interested in this topic after leaving Paris because of its applications to relativity theory. The leading expert on the absolute differential calculus was\nTullio Levi-Civita\nwho lectured in Rome, so in August\n1926\n, following\nDienes\n' advice, Davies travelled to Rome.\nThis was the first visit of many that Davies made to Rome where, as intended, he studied under\nLevi-Civita\n. He was awarded a doctorate for his thesis which he defended in an oral examination conducted by eleven professors. He had many adventures in Rome which he enjoyed recalling. For example, on one occasion\n[\n4\n]\n:-\n... a party of students were making merry in the Colosseum and since many nationalities were represented among them, they decided that each should sing a song of his native land. As Wales begins with a W, Ianto had the honour of singing last. The strains of \"Land of my Fathers\" were ringing strongly through the Colosseum when the police arrived.\nRome was an enjoyable but stressful experience and Davies' health broke down through overwork. He returned to Wales to recover, which took the best part of a year, before moving to his next European capital Paris in\n1928\n. In Paris he spent time at the Sorbonne and at the Collège de France where he was greatly influenced by\nÉlie Cartan\n.\nIn\n1930\nDavies returned from the Continent to take up a post as assistant lecturer at King's College, part of the University of London. He was promoted to Lecturer in\n1935\nand, in\n1946\n, he was promoted to Reader\n[\n1\n]\n:-\nHis steady stream of publications is testimonial to his authority in the fields of Riemannian geometry and the\ncalculus of variations\n. His Celtic fluency and enthusiasm, together with his fertility of ideas, surrounded him with research students, in whom he took a keen and friendly interest.\nDavies loved spending time on the Continent, both for holidays and for discussing research at various universities. Being an excellent linguist aided his enjoyment of the countries he visited. One of his great joys was sport\n[\n4\n]\n:-\nEvery Christmas he would join a party of friends for winter sports and he soon acquired some ability as a skier. In those pre-war days in Switzerland the atmosphere in the evening was elegant and relaxed. Ianto was an excellent raconteur and these were the hours in which he shone most brilliantly. He also became a keen Wimbledon tennis fan and for many years he would take an early place in the queue for the Centre Court on the First Thursday and the Second Wednesday of the tournament.\nIn\n1939\nwith the outbreak of World War II, the government passed the University and Colleges\n(\nEmergency Provisions\n)\nBill. Under the terms of this bill students from King's College London, were evacuated to the University of Bristol where it was 'business as usual'. Davies moved to Bristol to carry on with his university duties. However, in November\n1940\n, Bristol was bombed and the building housing the library of King's College, which had been removed to Bristol for safety, was hit destroying thousands of books. In Bristol he met Margaret Helen Picton; they were married in\n1941\n. Sadly Margaret died in\n1944\nin London.\nThe University College, Southampton, offered Davies the chair of mathematics in\n1946\n, a few months after his promotion to a Readership at King's College. He accepted and, rather remarkably, this gave him the distinction of becoming the only professor of mathematics in Britain who had not studied at either Oxford or Cambridge. He met Hilda Gladys Boyens in Southampton; they married in\n1955\nand had one son, Geraint. Davies spent the rest of his career at Southampton until his retirement in\n1969\nat the age of\n65\n[\n1\n]\n:-\nResearch flourished under his guidance and the department's growth from a staff of six to a multi-professorial one of more than sixty was accomplished with typical zeal.\nRetirement did not mean an end to mathematical research for Davies for, after he retired, he went to Canada to spend two years as Professor of Mathematics at the University of Calgary. In\n1971\nDavies, remaining in Canada, took up an appointment as Professor of Mathematics at the University of Waterloo. He was on the University of Waterloo campus when he was suddenly taken ill and died within a few hours.\nDavies was an editor of\nAequationes Mathematicae\nand, on his death, his fellow editors, writing in\n[\n6\n]\n, described him as:-\n... a mathematician of great breadth. His steady stream of publications in\ndifferential geometry\nand the calculus of variations attests to his authority in this field.\nIn his first few papers, Davies used the\nLie\nderivative to examine the action of an infinitesimal transformation on a submanifold of a Riemannian manifold. These papers included:\nOn the infinitesimal deformations of a space\n(1933)\n,\nOn the deformation of a subspace\n(1936)\n,\n(\nwith\nP Dienes\n)\n,\nOn the infinitesimal deformations of tensor submanifolds\n(1937)\n,\nOn the second and third fundamental forms of a subspace\n(1937)\n, and\nAnalogues of the Frenet formulae determined by deformation operators\n(1938)\n. He extended the ideas in these papers to generalisations of Riemannian manifolds such as\nFinsler\nmanifolds and\nCartan\nmanifolds in later papers, for example:\nLie derivation in generalized metric spaces\n(1939)\n,\nSubspaces of a Finsler space\n(1945)\n,\nMotions in a metric space based on the notion of area\n(1945)\n, and\nThe theory of surfaces in a geometry based on the notion of area\n(1947)\n. In papers such as\nOn the invariant theory of contact transformations\n(1953)\nDavies studies\ninvariant theory\nof contact transformations by using tensor calculus. Later, in\nParallel distributions and contact transformations\n(1966)\nhe re-examines the invariant theory of contact transformations from the point of view of parallel distributions.\nDavies had many interests outside mathematics. He was a linguist who, again quoting\n[\n6\n]\n:-\n... was fluent in five languages and delighted in the friendship of people from all walks of life in countries throughout the world. He had a passionate regard for the Welsh culture and his Celtic enthusiasm and fine spirit endeared him to us all.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}