{
  "nome_completo": "Evelyn Boyd Granville",
  "nome_curto": "Evelyn Boyd Granville",
  "ano_nascimento": "1924",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Granville/",
  "lugar_nascimento": "Washington D.C., USA",
  "lugar_morte": "Silver Spring, Maryland, USA",
  "biografia": "Evelyn Boyd Granville\n's family name was Boyd, so she grew up as Evelyn Boyd. The name Granville, by which she is now known, is the name she took after her second marriage but, for the sake of simplicity, we shall refer to her during this article as Granville even from her childhood days.\nEvelyn Boyd Granville's father was William Boyd who had various jobs including that of a janitor, chauffeur, and a messenger. Evelyn's mother was Julia Boyd; she had been a secretary before her marriage but gave up work to bring up her family. The Great Depression began in\n1929\nwhen Granville was five years old, and by\n1932\none quarter of the workers in the United States were unemployed. Granville's father worked selling vegetables from a lorry during the Great Depression and, although the family were poor, they always had food and a home.\nWilliam and Julia Boyd separated while Granville was still young and, together with her elder sister who was about eighteen months older, she was brought up in the African American community in Washington, D.C by her mother. Julia Boyd's sister also played a big part in Granville's upbringing and, being more academically inclined that Granville's mother, she strongly influenced and encouraged Granville in that direction. After separating from William Boyd, Julia returned to work to support her family earning a living as a maid. Eventually she worked for the Bureau of Engraving and Printing in Washington as a currency and stamp examiner. Julia's sister, having failed to get a teaching post, also got a job with the same organisation.\nGranville wrote\n[\n3\n]\n:-\nAs a child growing up in the thirties in Washington, D.C., I was aware that segregation placed many limitations on Negroes, ... However, daily one came in contact with Negroes who had made a place for themselves in society; we heard about and read about individuals whose achievements were contributing to the good of all people. These individuals, men and women, served as our role models; we looked up to them and we set out goals to be like them. We accepted education as the means to rise above the limitations that a prejudiced society endeavoured to place upon us.\nGranville attended elementary school, junior high school, and high school in Washington D.C. She was happy at school and was an outstanding pupil. From this time on she aspired to a career as a teacher\n[\n1\n]\n:-\nI saw black women - attractive, well dressed women - teaching school, and I wanted to be a teacher because that's all I saw. I was not aware of any other profession.\nThe high school which she attended was Dunbar High School. It was an academically oriented school for black students which aimed to send their pupils to the top universities and there Granville was strongly encouraged by two of her mathematics teachers Ulysses Basset and Mary Cromwell. While at Dunbar High School she decided that she wanted to continue her studies at Smith College after graduating but she fully realised that her mother was not in a position to support her financially through College\n[\n1\n]\n:-\nI did not receive a scholarship the first year at\n[\nSmith College\n]\n, and I was told later that they didn't see how in the world a poor child as I could afford to go there. ... the first year, my aunt helped my mother. Of course after the first year I got scholarships. I lived in a co-op house, worked during the summers, and I was able to\n[\npay\n]\n. It was not a financial burden after the first year.\nIn fact both Granville's mother and aunt gave her $\n500\nto finance her studies for a year before she won the scholarships which helped fund the remainder of her time at Smith College. The summer work which she refers to in the above quote was at the at National Bureau of Standards.\nOn entering Smith College in\n1941\nGranville studied French as well as mathematics but, although she enjoyed the language, did not find French literature to her liking and soon concentrated on mathematics, theoretical physics and astronomy\n[\n3\n]\n:-\nI was fascinated by the study of astronomy and at one point I toyed with the idea of switching my major to this subject. If I had known then that in the not too distant future the United States would launch its space program, and astronomers would be in great demand in the planning of space missions, I might have become an astronomer instead of a mathematician.\nAmong her teachers at Smith College was Neal McCoy who was particularly supportive of women mathematicians, perhaps in part because his own sister was a mathematician.\nGranville graduated with distinction in\n1945\nand was awarded a scholarship from the Smith Student Aid Society of Smith College to undertake studies for her doctorate. Both the University of Michigan and Yale University offered her a place but only Yale was able to provide the additional financial support she required. Entering Yale in the autumn of\n1945\n, she began research in functional analysis under\nHille\n's supervision. She wrote a doctoral thesis\nOn Laguerre Series in the Complex Domain\nand in\n1949\n, together with\nMarjorie Lee Browne\nwho graduated from the University of Michigan in the same year, she became the one of the first black American women to be awarded a Ph.D. in mathematics. After completing her Ph.D. from Yale, Granville spent a postdoctoral year at the New York University Institute of Mathematics working on differential equations with Fritz\nJohn\n. Rather sadly, neither\nHille\nnor\nJohn\nencouraged her to submit her research for publication. During this year she also taught as a part-time instructor in the mathematics department of New York University. After applying unsuccessfully for a teaching post at the Polytechnic Institute of Brooklyn, she accepted an offer of an associate professorship at Fisk University in Nashville, taking up the post in\n1950\n.\nMurray writes\n[\n1\n]\n:-\nIn the final analysis, however, Granville - who wanted to become a teacher since she was a little girl - was unable to accept the highly restrictive terms under which black women could hold academic posts in the early\n1950\ns. As she considered her options, it was natural for her to think about the possibility of government employment. ... In the spring of\n1952\n, Granville decided to seek a government job and return to Washington, D.C.\nThe job she was offered at the National Bureau of Standards gave her twice her previous academic salary so Granville\n[\n3\n]\n:-\nThe work entailed consulting with ordinance engineers and scientists on the mathematical analysis of problems related to the development of missile fuses. ... I met several mathematicians who were employed ... as computer programmers. At that time the development of electronic computers was in its infancy. The application of computers to scientific studies interested me very much, which led to my giving serious consideration to an offer of employment from International Business Machines Corporation.\nIn December\n1955\nGranville left the National Bureau of Standards and she began work for IBM in January of the following year. At first she worked in Washington writing programs for the IBM\n650\ncomputer, then in\n1957\nshe moved to New York City to take up a post as a consultant on numerical analysis at the New York City Data Processing Center of the Service Bureau Corporation, which was part of IBM. When the United States space programme began to move rapidly forward, NASA contracted IBM to write software for them. Granville was happy to return to Washington D.C. as one of a team of IBM mathematicians\n[\n3\n]\n:-\nI can say without a doubt that this was the most interesting job of my lifetime - to be a member of a group responsible for writing computer programs to track the paths of vehicles in space.\nIn November\n1960\nGranville married\n(\nbut still did not take the name of Granville which was her second husband's name\n)\nand moved to Los Angeles where she continued her work on orbit calculations for the space programme at the Space Technology Laboratories.\nIn the\n1967\nGranville's marriage broke up and she returned to the academic world, accepting a teaching post at California State University in Los Angeles. Her job involved undergraduate teaching and she taught both numerical analysis and computer programming. Another role was in mathematical education and she was involved in the mathematical education of those training to be elementary school teachers. This interest in mathematical education led to her involvement with the Miller Mathematics Improvement Program and as part of this program she taught mathematics for two hours each day at an elementary school in Los Angeles during session\n1968\n-\n69\n. Out of this experience came her joint publication with Jason Frand\nTheory and Applications of Mathematics for Teachers\n(1975)\n. The book was well received and adopted in many schools. Three years later a second edition was published but fashions change in teaching mathematics and soon after this the book ceased to be relevant to current courses.\nGranville had married Edward V Granville in\n1970\n, and of course only at that time did she take the name \"Granville\" which we have used throughout this article. She retired from California State University in\n1984\n[\n3\n]\n:-\nMy husband was born and raised in East Texas and planned to return to the area when he retired from his business. I often accompanied him on visits to Texas and , after making several trips, I was convinced that a move to a rural setting in East Texas would be a welcome change from the Los Angeles metropolis. We found an ideal setting in a\n16\n-acre parcel with a house and a four-acre lake near Tyler, Texas.\nShe taught at Texas College from\n1985\nto\n1988\n, teaching on a newly instigated computer science course. Still Granville did not want to leave the academic world and she taught at the University of Texas at Tyler, where she held the Sam A Lindsey Chair, and retired in\n1997\n.\nGranville gave her views on the current problems of teaching mathematics in American schools in a lecture at Yale University. We give some quotes from that talk:-\nI believe that math is in grave danger of joining Latin and Greek on the heap of subjects which were once deemed essential but are now, at least in America, regarded as relics of an obsolete, intellectual tradition ...\n... math must not be taught as a series of disconnected, meaningless technical procedures from dull and empty textbooks.\nWe teach that there is only one way to solve a problem, but we should let children explore various techniques. ... But we're not training teachers to provide this new approach.\n... children end up crippled in mathematics at an early age. Then, when they get to the college level, they are unable to handle college classes. It's tragic because almost every academic area requires some exposure to mathematics.\nMake children learn how to add, subtract, multiply, and divide, and they won't need calculators. How do you teach the beauty of mathematics, how do teach them to ... solve problems, to acquaint them with various strategies of problem solving so they can take these skills into any level of mathematics? That's the dilemma we face.",
  "math_areas": [
    "Analysis"
  ]
}