{
  "nome_completo": "Evelyn Merle Roden Nelson",
  "nome_curto": "Evelyn Nelson",
  "ano_nascimento": "1943",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nelson/",
  "lugar_nascimento": "Hamilton, Ontario, Canada",
  "lugar_morte": "Hamilton, Ontario, Canada",
  "biografia": "Evelyn Nelson\n's name before she married was Evelyn Merle Roden. Her parents were Russian immigrants who came to Canada in the\n1920\ns and they were to have a strong influence in encouraging their daughter in her educational pursuits. Although her parents had struggled when they first arrived in Canada, by the time Evelyn was born they were comfortably off running a clothing business. Evelyn attended Westdale High School in Hamilton, Canada, and soon showed that she had quite outstanding gifts but it is very much to her parents credit that they encouraged her talents in science and mathematics although they themselves had little experience of these topics. Bernhard Banaschewski writes\n[\n3\n]\n:-\nOne of the most positive influences on her life ... was the unwavering reassurance she received from her parents. It was, indeed, not the easiest in those days for a girl to become passionately interested in mathematics and natural science, with many attitudes pervading the schools, and society at large, that were acting as powerful influences against such a choice. Thus it is very much to her parents' credit that they did everything possible to encourage her to follow her natural inclinations and innate talents, no matter how unfamiliar this might have appeared. They took the greatest pride in her scholastic successes ...\nAfter graduating from Westdale High School in Hamilton, Evelyn entered the University of Toronto. She had not yet made the decision to concentrate on mathematics and she entered a course of study of mathematics, physics and chemistry. She remained on this course for two years and then made the decision to move back to her home town of Hamilton and to complete her studies at McMaster University. Soon after her return to Hamilton she married Mort Nelson, who was an undergraduate at McMaster and, of course, he was the reason for her move from Toronto.\nAt McMaster, Nelson decided to concentrate on mathematics and she registered for the Honours Mathematics course there and performed so well that she even took a graduate course for credit as part of her undergraduate degree. She was awarded her B.Sc. from McMaster in\n1965\nas the best student in her year and continued to study there for her Master's degree which was awarded in\n1967\n[\n3\n]\n:-\nShe drove right into the experience of pursuing one's own mathematical discoveries rather than learning about those of others, and she became addicted to the exhilaration that accompanies the process.\nThe dissertation which she wrote for the award of the M.Sc. led to her first publication in the\nCanadian Journal of Mathematics\n. This was a very fine achievement for there are few graduate students studying for a Master's degree who have a publication in a prestigious journal in the year they receive the degree.\nHer\n1967\npaper was entitled\nFiniteness of semigroups of operators in universal algebra\nand in it she studied operators on classes of algebraic universal algebras. Defining a class of universal algebras to be algebraic if it is closed under isomorphisms, she then went on to define the seven operators which given an algebraic universal algebra\nK\nK\nK\nyield the smallest algebraic class containing all homomorphic images, subalgebras, direct products, subdirect products, reduced products, ultraproducts, and covers of algebras in\nK\nK\nK\n. She then looked at several subsets of these operators and proves that the semigroup which each set generates is finite.\nAfter completing her M.Sc. Nelson continued to study at McMaster for her Ph.D. under the supervision of Günther Bruns. Then she worked at a slower pace, devoting more time to her family. The first of her two children, both daughters, was born shortly before she competed the work for her doctoral thesis\nThe lattice of equational classes of commutative semigroups\n. She was awarded a Ph.D. in\n1970\nfor this work which, like her Master's thesis, led to a publication in the\nCanadian Journal of Mathematics\n.\nNelson spent her whole career at McMaster. She was appointed as a postdoctoral fellow in\n1970\non a three year fellowship, then after its completing she was appointed as a research associate in\n1973\n. During the three years of her postdoctoral fellowship she published many excellent papers. In addition to\nThe lattice of equational classes of commutative semigroups\nreferred to above, she published in\n1971\nthe papers\nEmbedding the dual of\nπ\nm\n\\pi_{m}\nπ\nm\n​\nin the lattice of equational classes of commutative semigroups\nin the\nProceedings of the American Mathematical Society\nand\nEmbedding the dual of\nπ\n∞\n\\pi_{∞}\nπ\n∞\n​\nin the lattice of equational classes of semigroups\nin\nAlgebra Universalis\n, both written jointly with Stanley Burris. In the same year she published\nThe lattice of equational classes of semigroups with zero\nin the\nCanadian Mathematical Bulletin\n.\nIn\n1972\nfurther papers appeared. Two which Nelson wrote jointly with Bernhard Banaschewski were\nOn residual finiteness and finite embeddability\nand\nEquational compactness in equational classes of algebras\nboth of which were published in\nAlgebra Universalis\n. In the following year she published\nEquational compactness in infinitary algebras\nagain jointly with Bernhard Banaschewski. Although the terms are technical and not likely to be understood by many readers of this archive, we quote from the introduction to the paper. It does at least give a flavour of the work:-\nW Taylor recently proved, among other results, that an equational class of finitary algebras contains enough equationally compact algebras if and only if the subdirectly irreducible algebras in the class constitute, up to isomorphism, a set. This note provides a negative answer to the natural question whether the same equivalence holds for equational classes of infinitary algebras by exhibiting examples in which there are, up to isomorphism, only one subdirectly irreducible algebra in the class and no non-trivial equationally compact algebras at all.\nBanaschewski explained what collaborating with Nelson was like\n[\n3\n]\n:-\n... working with her was always a very great pleasure. She always brought something special and substantial to her joint papers ...\nWe have listed here only a few of the many papers which Nelson wrote in the years following her doctorate, yet it took eight years before she was appointed to a tenured post at McMaster:-\n... the disappointment involved for her was sometimes a considerable burden.\nIt was only in\n1978\nwhen she was appointed associate professor that she was finally given a position in the Department. It was around this time that she began to apply her skills in algebra to problems in theoretical computer science and in\n1982\nshe was made Head of Computer Science at McMaster. In\n1983\nshe was finally promoted to a full professorship but already her health was deteriorating. When Computer Science split from the Mathematics Department to become a Department in its own right in\n1984\nNelson's health was too poor to allow her to continue as head.\nIn\n1985\nNelson was invited to address the\nFundamentals of Computation Theory Conference\nin Cottbus. She gave a talk\nRecent results on continuous ordered algebras\nin which, among other things, she described all free continuous algebras, as well as free continuous semilattices, and gave the Birkhoff theorem for these algebras. Free continuous semilattices are important in theoretical computational science since they provide semantic models for nondeterministic computations.\nDespite deteriorating health, Nelson continued to produce outstanding mathematical papers. She has\n48\npublications listed under her name which is a remarkable record for someone who died\n17\nyears after the award of her doctorate and many of these being marred by illness. In\n[\n4\n]\nshe is described as follows:-\nShe was a passionate academic of the highest standards and both a deeply devoted teacher and a profoundly committed research mathematician. ... she was an exemplary mother to her two daughters, a loyal friend to all who were close to her, and a warmly congenial hostess to her visitors ...\nFinally let us say a little about Nelson's teaching. This was outstanding, yet it was teaching that was used to discriminate against her for all the years she spent as a research associate. Her teaching first year calculus was highly successful\n[\n3\n]\n:-\n... the first year students loved her vitality and dynamic presence, and she instantly became one of the most successful teachers of that group. ... she had a clear vision of the importance of the first year calculus course and a serious concern for the right way of teaching it, which necessarily made her a demanding instructor. In particular, she abhorred the approaches that somehow, as she used to say, trivialise the subject and give the students the illusion of understanding without any real depth of knowledge.\nGiven this superb attitude and success at teaching first year calculus it is ironical that colleagues on the faculty at McMaster argued against giving her a position in the Department because they believed that she could not handle large first year classes. As Banaschewski himself writes, it was a clear a clear case of prejudice against women.\nIn\n1995\nthe\nCanadian Mathematical Society\nhonoured her by settting up the\nKrieger\n-Nelson Prize Lectureship for Distinguished Research by Women in Mathematics.",
  "math_areas": [
    "Algebra",
    "Calculus"
  ]
}