{
  "nome_completo": "Evgeny Evgenievich Slutsky",
  "nome_curto": "Evgeny Evgenievich Slutsky",
  "ano_nascimento": "1880",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Slutsky/",
  "lugar_nascimento": "Novoe, Yaroslavl guberniya, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Evgeny Evgenievich Slutsky\n(\nwhich is sometimes transliterated as Evgenii Evgen'evich Slutskii\n)\nwas the son of Evgenii Slutskii who was a schoolteacher. The family moved from Yaroslavl province, in western Russia, to Ukraine and there Slutsky entered a classical\ngymnasium\nwhere the main emphasis was on the study of mathematics and the physical sciences. He was awarded the gold medal by the gymnasium in\n1899\n.\nAfter leaving school Slutsky entered the University of Kiev in\n1899\nto study mathematics. He was soon involved in student politics and he participated in student unrest at the university. Two students had been expelled from the University for their political views and Slutsky participated in illegal meetings of the student body which gave its support to the two expelled students and demanded their reinstatement. Student trouble makers were dealt with by giving them a spell in the army. That is precisely what happened to Slutsky in January\n1901\n, but he was not given a particularly long spell and he was soon back at Kiev University. The following year he was in trouble again, and this time he was expelled and forbidden to study at any Russian institution of higher education, so there was no chance to complete his studies at Kiev\n(\nor anywhere else in Russia\n)\n.\nSlutsky had little choice if he wanted an education so he went abroad and entered Munich Polytechnikum entering in\n1902\n. He wrote in his autobiography\n[\n5\n]\n:-\nIn Munich I seriously studied Ricardo, Marx, Lenin ... I already had outlined a plan of work for the application of mathematics to economics..\nHe was able to complete a degree in engineering in Munich and he returned to Kiev in\n1905\n. The political situation in Kiev was by then rather different, for the Russian Revolution had begun early in that year with major demonstrations, strikes, armed revolts, and mutinies in the military. The ban on Slutsky attending Russian higher education institutions was meaningless in the new political situation so he could study again at the University of Kiev. This time he went for a course more in keeping with his political interests, taking a degree in political economics in the Faculty of Law. He graduated with the Gold Medal in\n1911\nfor his paper\nThe theory of marginal utility\n.\nHis interest in statistics was greatly enhanced when he met A V Leontovich in\n1912\n. Leontovich was a physiologist who had been studying the statistical ideas of\nGauss\nand\nPearson\nand he gave Slutsky material on statistical techniques. Slutsky was quickly involved with this work, and still in\n1912\nhe published a text in Kiev entitled\nThe theory of correlation\n. From January\n1913\nuntil\n1926\nhe taught at the Kiev Institute of Commerce where he was promoted to professor in\n1920\n. Then in\n1926\nhe moved to the government statistics offices in Moscow and began working there in January of that year.\nThe government statistics offices were part of the Conjuncture Institute run by N D Kondratiev who was a leading economist and advisor to the Soviet leadership on agricultural policies. Slutsky had been a supporter of the revolution when a student but now he became much more careful in making his views known. He wrote in his autobiography\n[\n5\n]\n:-\n... when capitalism collapsed in Russia and I came to describe the contours of a planned socialist economic order, the basis for this from the economic-mathematical point of view disappeared. studying the economic process under socialism and the transitional epoch demanded a different type of knowledge, methodology, and skills than that which I had armed myself.\nStalin's policies became much more extreme after\n1929\n. Slutsky may well have foreseen this and decided to keep out of advising on economic policy decisions. Certainly he worked and published on the foundations of probability theory which was a safe political topic. Indeed those who had been giving economic advice to the government, such as Kondratiev, found themselves in an extremely difficult position. The Conjuncture Institute was closed in\n1930\nand Kondratiev was arrested and eventually executed. Other high ranking members of the Institute suffered banishment but Slutsky alone was able to continue his career without problems. Undoubtedly this shows his skill in avoiding becoming involved in controversial areas.\nAfter the Conjuncture Institute was closed in\n1930\nSlutsky began to apply his statistical skills to meteorology, taking up a position in the Central Institute of Meteorology in\n1931\n. He worked there until\n1934\nafter which he joined the Institute of Mathematics and Mechanics of the University of Moscow and he began teaching at the University. From\n1938\nonwards he worked at the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\n.\nAs a statistician, Slutsky was influenced by\nPearson\n's work, as we mentioned above, and he was interested in both the mathematical background of the statistical methods he studied as well as their application to economics and, later in his career, to natural sciences. While at the Kiev Institute of Commerce, Slutsky gave the fundamental equation of value theory to economics. This appeared in the paper\nSulla teoria del bilancio del consumatore\nⓉ\n(\nOn the theory of the consumer's budget\n)\nwhich studied consumer behaviour and, as one can see from the title, was translated into Italian for publication in\nGiornale degli Economisti\n.\nSlutsky introduced stochastic concepts of limits, derivatives and integrals between\n1925\nto\n1928\nwhile he worked at the Conjuncture Institute. In\n1927\nhe showed that subjecting a sequence of independent random variables to a sequence of moving averages generated an almost periodic sequence. This work stimulated the creation of stationary stochastic processes. He also studied correlations of related series for a limited number of trials. He obtained conditions for measurability of random functions in\n1937\n.\nSlutsky applied his theories widely, in addition to economics mentioned above he also studied solar activity using data from\n500\nBC onwards. Other applications were to diverse topics such as the pricing of grain and the study of chromosomes.\nBarnett, in\n[\n3\n]\n, describes Slutsky as a \"fascinating and complex character\". He also writes:-\nPolitically he was not a member of any particular party and his character was reserved and secretive.",
  "math_areas": [
    "Statistics"
  ]
}