{
  "nome_completo": "Félix Savart",
  "nome_curto": "Félix Savart",
  "ano_nascimento": "1791",
  "ano_morte": "1841",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Savart/",
  "lugar_nascimento": "Mézières, France",
  "lugar_morte": "Paris, France",
  "biografia": "Félix Savart\n's father was Gérard Savart who was an engineer. The family had a long association with Mézières, Gérard's father\n(\nFélix's paternal grandfather\n)\n, also a native of that city, had been involved with the founding of the engineering school there in\n1748\n. Gérard Savart moved to Metz where he was in charge of draftsmen at the engineering school. Félix and his older brother Nicolas\n(\nborn\n1790)\nhad their early schooling in Metz. With a strong family tradition of involvement with military engineering schools, one might have expected Félix Savart to also go down that path. In fact his early training did take him in that direction but in\n1808\n, at the age of seventeen, he decided to train for a career in medicine.\nSavart spent around two years from\n1808\nto\n1810\nstudying at a hospital in Metz. Of course he had grown up in a period when France was enjoying military victories under Napoleon who had led French armies to victories over the armies of Austria, Prussia, Great Britain, Spain and the Netherlands between\n1792\nand\n1797\n. Victories over three further coalitions set up to try to curb French power saw Napoleon at the height of his power in\n1810\n. It was at this time, after training in the Metz hospital, that Savart became a regimental surgeon in Napoleon's army. He did follow certain family traditions by serving in the first battalion of engineers. However, during the years in which he served from\n1810\nto\n1814\n, Napoleon suffered defeats in the Spanish and Russian campaigns. In\n1814\nSavart was discharged from the army and resumed his medical training.\nIt was to Strasbourg that Savart went in\n1814\nand, two years later, he graduated from the university with a medical degree. The topic for his thesis was varicose veins. During his medical studies Savart became interested in Aulus Cornelius Celsus\n(\nfirst century AD\n)\n, one of the greatest Roman medical writers, author of\nDe medicina\nⓉ\n(\nOn medicine\n)\n. After completing his degree Savart remained in Strasbourg where he both gained further medical experience and also worked on a translation of Celsus's\nDe medicina\nⓉ\n(\nOn medicine\n)\n. After returning to Metz in\n1817\nwhere he set up a medical practice, Savart spent more time studying physics than treating patients. He set up an excellent physics laboratory to carry out experiments and became fascinated with a study of sound, in particular the acoustics of musical instruments such as the violin. He began to build violins trying to base the form of the instrument on mathematical principles.\nWith Savart showing little interest in his medical practice, and patients showing little interest in joining, he decided to go to Paris in\n1819\nand seek a publisher for his translation of  Celsus's\nDe medicina\nⓉ\n(\nOn medicine\n)\n. He had another reason to go to Paris, and that was to see\nBiot\nso that he could discuss with him the acoustics of musical instruments that was by now fascinating Savart. As it happened, at the time that Savart reached Paris\nBiot\nwas lecturing on acoustics at the Faculty of Science. He found Savart's work on the acoustics of bowed string instruments very interesting and he presented a memoir that Savart had written\nMémoire des instruments à chordes et à archet\nⓉ\n(\nMemoir on stringed instuments with a  bow\n)\nto the Academy of Sciences; it was published in\n1819\n. This memoir contained a design of a trapezoid violin which Savart claimed to have superior acoustic performance to the traditional violin. He used experimental results achieved using techniques similar to those of Chladni. It is reasonable to ask how successful he was with his trapezoid violin. Dostrovsky writes\n[\n1\n]\n:-\nWhen the instrument was played before a committee that included\nBiot\n, the composer Cherubini, and other members of the Academy of Sciences and the Académie des Beaux-Arts, its tone was judged as extremely clear and even, but somewhat subdued.\nWhen Savart arrived in Paris,\nBiot\nwas undertaking research on electricity in addition to lecturing on acoustics. The two began a collaboration and when, early in\n1820\n, Hans Christian Oersted reported that a compass needle placed near a wire carrying current pointed at right angles to the wire, they began to research more deeply into the field produced by the wire. Using the oscillation of a magnetic dipole to determine the strength of the field close to a wire carrying current, they discovered what today is called the\nBiot\n-Savart law. Magnetic fields produced by electric currents can be calculated using the\nBiot\n-Savart law which they presented to the Academy of Sciences on\n30\nOctober\n1820\n. They took magnetism as the fundamental property rather than using the approach due to\nAmpère\nwhich treated it as derived from electric circuits. A joint\nBiot\n-Savart paper\nNote sur le magnétisme de la pile de Volta\nⓉ\n(\nNote on the magnetism of the Voltaic pile\n)\nwas published in the\nAnnales de chemie et de physique\nin\n1820\n.\nBiot\nhelped Savart find a teaching position in Paris and from\n1820\nhe taught science in a private school there. On\n5\nNovember\n1827\n, Savart was elected to the physics section of the Academy of Sciences to replace\nFresnel\nwho had died in July of that year. He taught at the Collège de France from\n1828\n, becoming a professor of experimental physics there to succeed\nAmpère\n. He continued to hold this position until his death in\n1841\n, a few months short of his fiftieth birthday.\nIn addition to the\n1819\npaper we mentioned above, Savart also carried out experiments on sound which became important for later students of acoustics. Among other papers he published on this topic we mention\nMémoire sur la communication des mouvements vibratoires entre les corps solides\nⓉ\n(\nMemoir on the communication of vibratory movements between the solid bodies\n)\n(1820)\n,\nRecherches sur les vibrations de l'air\nⓉ\n(\nResearch on  vibrations of air\n)\n(1823)\n, and\nMémoire sur les vibrations des corps solides, considérées en général\nⓉ\n(\nMemoir on the solid body vibrations,  considered generally\n)\n(1824)\n. His contributions to music are summed up in Grove's\nDictionary of Music and Musicians\n[\n2\n]\n:-\nIn general he threw light on the nature of the complicated relation between a vibrating body which is the source of sound and other bodies brought into connection with it, by virtue of which the original sound is magnified in intensity and modified in quality, well-known examples of such an arrangement being furnished by the sounding board of the violin tribe and the pianoforte.\nHe also developed the Savart disk, a device which produced a sound wave of known frequency, using a rotating cog wheel as a measuring device. McKusick and Wiskind write\n[\n5\n]\n:-\nAbout\n1830\nSavart invented a toothed wheel for determining the number of vibrations in a given musical tone. He attached tongues of pasteboard to a hoop of the wheel and arranged for these to strike a projecting object as the wheel was turned. Alternately, he had cogs of a wheel strike a tongue of pasteboard. Presumably he employed this instrument to determine the vibrations per second of the tones he elicited from his experimental models. he would speed up the rotation of the wheel until a tone which matched the experimental one was produced. Since the frequency of the tone produced by the wheel could be easily determined, the frequency of the unknown tone produced by the model was ascertained. by an extension of this method, Savart compounded musical notes. For example, he would use, in combination, wheels with numbers of teeth which bore a simple relationship to each other. he used this method to explore the physical basis of harmonious and discordant sounds.\nThere were other topics that interested Savart and on which he undertook research. For example he studied turbulence and the medical implications of his research is studied in detail in\n[\n5\n]\n. The authors write in summary:-\nIn the latter half of the nineteenth century, in medical and physiological writings on the genesis of heart murmurs, Savart's \"fluid veins\" were repeatedly referred to. When it was realised that, in the case of partial obstruction to the flow of blood, the murmur is produced not at, or proximal to, the site of obstruction but in the fluid beyond, it was presumed that a mechanism like that revealed by Savart was involved.\nThe paper\n[\n4\n]\ndiscusses a detailed experimental study of the existence of water bells when a cylindrical jet impacts with the velocity normal to a circular disc, which was first studied by Savart in\n1833\n.\nLet us end this biography with giving two postscripts. First let us note that although one of Savart's main aims in going to Paris was to publish his translation of Celsus's\nDe medicina\nthe work never appeared. It seems that Savart became diverted into more interesting directions. As a second postscript we note some facts about Savart's older brother Nicolas Savart. Unlike Félix, Nicolas studied at the École Polytechnique and then followed the family tradition of becoming an officer in the engineering corps. The reason for mentioning him in this postscript is that Nicolas, like his brother, also published papers on acoustics. For example he published\nQuelques faits résultant de la réflexion des ondes sonores\nⓉ\n(\nSome facts resulting from the reflection of sound waves\n)\n(1839)\n, and at least three further papers after the death of Félix.\nFélix Savart was honoured by having a street in Mézières named after him.",
  "math_areas": [
    "Algebra"
  ]
}