{
  "nome_completo": "Leo Félix Pollaczek",
  "nome_curto": "Félix Pollaczek",
  "ano_nascimento": "1892",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pollaczek/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Boulogne-Billancourt, near Paris, France",
  "biografia": "Félix Pollaczek\n's parents were Alfred Pollaczek\n(1862\n-\n1923)\nand Marie Gomperz\n(1867\n-\n1923)\n. It was a well-respected Jewish family with Alfred being a local councillor and an inspector on the Austrian railways. In fact the Pollaczek family had a tradition of working for the Austrian railways with Alfred's father, Samuel Pollaczek, being General Inspector on the Austrian railways. Alfred and Marie were married in\n1891\nand Félix was the eldest of their two children; he had a younger brother Gustav Pollaczek\n(1895\n-\n1966)\n. We shall say a little more about Gustav later in this biography but let us record at this point that his first occupation was in the family tradition of the Austrian railways.\nFélix attended the Akademie\nGymnasium\n, the Latin High School, in Vienna. This school, the oldest and most famous in Vienna, was founded in\n1553\nand had been situated in the Beethovenplatz since\n1866\n.\nErwin Schrödinger\ngraduated from the school four years before Pollaczek  who graduated at the age of seventeen in\n1910\n. In that year he entered the Technical University of Vienna, enrolling as a student of electrical engineering. The political situation in\n1914\nrapidly deteriorated and by August of that year Austria-Hungary was allied with Germany and at war with Russia, France and Great Britain. Pollaczek served in the Austrian army during World War I. By the end of the war he had reached the rank of lieutenant. However, he had time to think deeply about mathematics and he wrote his first paper in\n1916\nwhile serving in the army. This paper on\nFermat\n's Last Theorem,\nÜber den grossen Fermatschen Satz\nⓉ\n(\nOn the great Fermat's theorem\n)\n, was his first contribution to number theory and was published in\n1917\n.\nAfter World War I ended in\n1918\n, Pollaczek went to Brno, Czechoslovakia, where he studied for a Master's Degree in electrical engineering. He was awarded the degree in\n1920\nand, following this, he went to Berlin where he undertook research for his doctorate in mathematics. In\n1921\nhe married\nHilda Geiringer\nwho, like Pollaczek, was born in Vienna. She had obtained her doctorate in mathematics in that city working under\nWilhelm Wirtinger\nand had moved to Berlin in\n1921\nto become\nRichard Von Mises\n' assistant in the Institute of Applied Mathematics. Pollaczek's thesis advisor was\nIssai Schur\nand he undertook research on number theory, working in an area close to the work he had undertaken on\nFermat\n's Last Theorem during the war. He submitted his thesis\nÜber die Kreiskörper der l-ten und\nl\n2\nl^{2}\nl\n2\n-ten Einheitswurzeln\nⓉ\n(\nOn the cyclotomic field of i-th and i\n2\nth roots of unity\n)\nin\n1922\nand was awarded his doctorate. In this thesis he studied fields generated by the\np\np\np\nth and\np\n2\np^{2}\np\n2\nth roots of one, where\np\np\np\nis an irregular prime number. He published a paper based on the work of his thesis in\n1924\n. The year\n1922\nwhen he was awarded his doctorate was also the year that Félix and Hilda's daughter Magda was born. However, the marriage was not successful and they soon separated, and eventually they were divorced. Before his thesis was submitted, Pollaczek had taken a job in\n1921\nas an engineer with A.E.G.\n[\nAllgemeine Elektricitäts Gesellschaft\n]\nin Berlin. He only worked for this major German electrical company, which was responsible for installing Germany's first electrical power system, for two years before being appointed as a scientific adviser to the German Postal, Telephone and Telegraph Services at Reichspost-Zentralamt Berlin-Tempelhof.\nPollaczek began publishing papers on mathematical physics, particularly on electrical engineering, the first two being\nDas Einschaltproblem für das homogene Kabel bei beliebiger Einschaltung\nⓉ\n(\nThe potential problem for homogeneous cable at any power\n)\n(1924)\nand\nTheorie der Einschaltvorgänge des vielgliedrigen künstlichen Kabels\nⓉ\n(\nTheory of potential of well-balanced artificial cable\n)\n(1925)\n. He published three further papers in this area in\n1926\n, and continued publishing on this topic over the following years. However, his interests were broad and in\n1929\nhe published\nÜber die Fortpflanzung mechanischer Vorgänge in einen linearen Gitter\nⓉ\n(\nOn the propogation of mechanical operations in a linear grid\n)\non rational mechanics, and\nÜber die Einheiten relativ-abelscher Zahlkörper\nⓉ\n(\nOn the units in relative-abelian number fields\n)\non number theory. In the following year he published two papers on probability theory. It is one of these papers\nÜber eine Aufgabe der Wahrscheinlichkeitstheorie\nⓉ\n(\nOn a problem in probability theory\n)\npublished in\nMathematische Zeitschrift\nwhich contains the result for which he is best known today, the Pollaczek-\nKhinchin\nformula. This formula for the mean waiting time of a queueing model with an arbitrary service time distribution was also derived by the Russian mathematician\nAleksandr Yakovlevich Khinchin\nin\n1932\n.\nIf political events in Germany had turned out differently, it seems likely that Pollaczek would have continued to work for the German Postal, Telephone and Telegraph Services, and publish research articles on a wide range of mathematical topics. However, when Hitler became Chancellor of Germany in\n1933\n, he immediately announced legal actions against Germany's Jews. On\n7\nth\nApril\n1933\n, Hitler introduced a law for the \"Restoration of the civil service\". This meant that all non-Aryans and Jewish civil servants were dismissed from their positions with the exception of those who either had fought in the Great War or had been in office since August\n1914\n. Pollaczek was dismissed from his position in the German Postal, Telephone and Telegraph Services as a consequence of these laws. He realised that he would have to get out of Germany if he was to survive so he went to Paris. Pollaczek's last paper written in German appeared in\n1934\n. He wrote all his subsequent papers and books in French\n(\nexcept for two papers written very late in his life which he wrote in English\n)\n.\nÉmile Vaulot, chief engineer at the  Poste, Téléphone et Télécommunications\n(\nthe French Post Office\n)\nand a lecturer at the École Polytechnique, was an expert on telephone engineering who had also worked on queueing models with an arbitrary service time distribution. He was able to obtain a position for Pollaczek as a consultant for the Société d'Études pour Liasons Téléphoniques et Télégraphiques. Pollaczek married Vera Jacobowitz in\n1934\n; unlike his first marriage, this marriage was very successful and Vera proved a great support to her husband through the following difficult years. As tensions rose between the countries of Europe, Pollaczek's position in France became more difficult and by\n1936\nhe could not get his visa renewed to continue to work there. Accompanied by his wife, he went to Brno, Czechoslovakia, where members of his mother's family were living.\nAleksandr Yakovlevich Khinchin\n, who was working on the theory of stationary random processes, had interests similar to those of Pollaczek and had found the same Pollaczek-\nKhinchin\nformula a couple of years after Pollaczek.\nKhinchin\ninvited Pollaczek to the Soviet Union. After working in Moscow,\nKhinchin\nspent the two years\n1935\n-\n37\nat Saratov University before returning to Moscow. Pollaczek spent three months in the Soviet Union in\n1937\n, visiting\nKhinchin\nand making trips to a number of universities. He made a very favourable impression and was offered a professorship at the University of Tiflis in Georgia. This was a tempting offer as Tiflis was a major cultural and educational centre. In addition to the university there were several other higher education institutions, and many research establishments. However, working there presented visa difficulties similar to those he had experienced in France and, in addition, the Soviet political system did not appeal to him. He therefore returned to Brno.\nThe situation in Europe deteriorated further during\n1938\n. In March of that year German troops marched into Austria which was declared part of Germany. Even more worrying for Pollaczek was Hitler's announcement in May that he would destroy Czechoslovakia. Attempts to appease Hitler over the following months led to the Sudetenland becoming part of Germany and German troops entered areas close to Brno in October. Pollaczek was one of\n12\n,\n000\nJews in Brno who heard of the increasing anti-Semitic acts throughout Germany with Jewish businesses smashed in November. On\n15\nMarch\n1939\nGerman tanks entered Brno and two days later Hitler visited Brno to emphasise his conquest. Pollaczek had seen what was coming and he had escaped with his wife just before the German troops arrived. They made their way to Paris and at first it seemed that he had made a good move for he was appointed Maître de Recherches at the Centre National de la Recherche Scientifique. Let us note here that the Pollaczeks did well in leaving Brno for less that\n1\n,\n000\nof the\n12\n,\n000\nJews there survived the war.\nWorld War II began on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany but over the following months France was not involved in any fighting, but spent time trying to build defences to protect the country from an invasion by Germany. During this time Pollaczek continued to work in Paris. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders and, by June, France had surrendered and fighting had ended. Pollaczek and his wife, as Jews, were again in great danger and there was no way he could continue working for the Centre National de la Recherche Scientifique. The Pollaczeks spent the war years avoiding persecution by the Nazis. They succeeded in surviving the war but suffered years of hardship. In August\n1944\nParis was liberated and Pollaczek was able to begin working again for the Centre National de la Recherche Scientifique. He had lost nearly twelve of what should have been the most productive years of his life. However, he launched himself back into research and in\n1946\npublished the number theory paper\nRelations entre les dérivées logarithmiques de Kummer et les logarithmes π-adiques\nⓉ\n(\nRelations between the logarithmic derivatives of Kummer and π-adic logarithms\n)\nas well as three papers on\nprobability\nSur I'application de la théorie de fonctions au calcul de certaines probabilités continues utilisées dans la theorie des réseaux téléphoniques\nⓉ\n(\nOn the purposes of the theory of functions to calculate some continuous probability theory used in telephone networks\n)\n,\nLa loi d'attente des appels téléphoniques\nⓉ\n(\nThe pending legislation on telephone calls\n)\n, and\nSur un problème du calcul des probabilités qui se rapporte a la téléphonie\nⓉ\n(\nOn a problem of probability that relates to telephony\n)\n. An application for French citizenship from Pollaczek and his wife was granted in\n1947\n. He did not have a good income over the following ten years but, after that, he received a pension from the German Postal, Telephone and Telegraph Services which made him financially more comfortable.\nWe promised at the start of this article to give some further details of Félix Pollaczek's brother Gustav. Gustav published works such as\nGrundzüge des französischen Eisenbahn-Frachtrechts\nⓉ\n(\nPrinciples of the French railway freight law\n)\n(1935)\n,\nInternational Legislation in the Field of Transportation\n(1944)\n,\nRebuilding the European transportation system\n(1945)\n, and\nGerman Transportation and Communication Systems\n(1946)\n. He had moved to the United States and was involved in the American labour conference on international affairs which considered postwar reconstruction. He was described in a\n1946\npublication as follows: Doctor of laws, University of Vienna; former official, Austrian state railways; formerly consultant, Foreign Economic Administration; now in Office of Economic Security Policy, Department of State.\nDuring the ten years from\n1945\non, Félix Pollaczek worked on yet another mathematical topic, this time mathematical analysis. In this area his main interests were in orthogonal polynomials and as well as working on\nLegendre\npolynomials,\nHermite\npolynomials and\nLaguerre\npolynomials, he introduced polynomials named by\nArthur Erdélyi\nas the 'Pollaczek polynomials'. He lectured during these years at the Institut de Statistique at the Faculty of Science in Paris. For example a course he gave in the Institute in\n1956\nwas published as\nApplication de la théorie des probabilités à des problèmes posés par l'encombrement des réseaux téléphoniques\nⓉ\n(\nApplication of probability theory to the problems of congestion telephone networks\n)\n(1959)\n. The published material contains a:-\n... treatment in telephony of the simplest many-server system - the \"fully accessible\" case in which any idle server may attend any service demand. Both loss\n(\nbusy signal\n)\nand delay systems are examined.\nIn\n1957\nPollaczek published the monograph\nProblèmes stochastiques posés par le phénomène de formation d'une queue d'attente à un guichet et par des phénomènes apparentés\nⓉ\n(\nStochastic Problems in the phenomenon of the formation of a waiting queue at a counter and related phenomena\n)\n. John Riordan writes in a review:-\nThis is a thorough study of problems associated with a single server stochastic system. These problems are mainly those of delay when a waiting line is permitted, service being in order of arrival without defections from the waiting line. The case, arising in air traffic, where a delayed arrival in joining service suffers an additional\n(\nrandom\n)\ndelay due to this very fact, as well as the usual case where joining service is instantaneous, is considered and is modified later to permit only quantized delays, integral multiples of some appropriate time unit. But also the problem of the distribution of the \"busy period\", and the problem of loss when arrivals finding the server busy are dismissed\n(\nwithout effect on future arrivals\n)\n, appear in their proper places. ... The treatment throughout employs complex variable theory and to an expert like the author may be regarded, as he says, as a set of exercises in the elementary part of that theory,\n(\nwhich should test the skill of most novices\n)\n. This of course conditions the generality of the various distribution functions in question but, as the author says, in a way not serious for any of the known applications.\nPollaczek also published the book\nThéorie analytique des problèmes stochastiques relatifs à un groupe de lignes téléphoniques avec dispositif d'attente\nⓉ\n(\nAnalytic theory of stochastic problems with a group of telephone lines waiting for device\n)\n(1961)\n. He described his methods in queueing theory in a letter to Ryszard Syski which is reproduced in\n[\n7\n]\n:-\nSome of the guiding ideas of the theory outlined in my paper may be approximately stated as follows. Under the rule of strict order servicing of an s server system with given initial conditions, all quantities we are interested in, like waiting times, busy periods, etc., are definite functions of a great number of stochastic variables of given distributions, and of some parameters signifying given initial values. Therefore all unknown expressions for probabilities and distribution functions are in fact\nLebesgue\n-\nStieltjes\nintegrals, the integrands of which are formed by means of the aforesaid definite functions. In my theory the task of carrying out these integrations is reduced to the problem of resolving one or several systems of s linear non-homogeneous integro-functional equations of a new kind. The circumstances that this theory employs uniquely analytic methods and dispenses with all resources of classical Probability Calculus probably accounts for the fact that hitherto my methods have been employed by nobody save myself.\nPollaczek received a major award in\n1977\nfrom the Operations Research Society of America and The Institute of Management Sciences. This is described by the probabilist Jacob Willem Cohen\n(1923\n-\n2000)\nin\n[\n1\n]\n:-\nIn\n1977\nPollaczek was awarded the\nJohn von Neumann\nTheory Prize by the ORSA-TIMS prize committee. Although he had always enjoyed good health, his age then prevented him from travelling to the United States to receive this prize in person. At the country house of the hospitable Le Gall family in Bous-le-Roi, France, the prize was presented to him during a short ceremony in the presence of Pierre Le Gall, Ryszard Syski and myself. Pollaczek felt very honoured by this award from the American Operations Research community.\nLet us end by quoting again from\n[\n1\n]\n:-\nPollaczek made basic contributions in pointing to the direction in which the analytic approach must develop. In him queueing theory had a fine and sharp scientist. His modest and kind personality will be missed by his friends.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}