{
  "nome_completo": "Fabian Franklin",
  "nome_curto": "Fabian Franklin",
  "ano_nascimento": "1853",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Franklin_Fabian/",
  "lugar_nascimento": "Eger, Heves County, Hungary",
  "lugar_morte": "New York, New York, USA",
  "biografia": "Fabian Franklin\nwas the son of Morris Joshua Franklin and Sarah Heilprin. Morris Franklin\n(\nborn\n1821)\nand his wife Sarah\n(\nborn\n1821)\nwere both born in Poland. They had eight children: Helen Franklin born\n1841\nin Poland; Emily Franklin born\n1843\nin Hungary; Etel Franklin born\n1845\nin Hungary; Rose Franklin born\n1847\nin Hungary; Julia Franklin born\n1848\nin Hungary; Fabian Franklin, the subject of this biography, born\n1853\nin Hungary; Diana Franklin born\n1858\nin Philadelphia, USA; and Flora Franklin born\n1860\nin Philadelphia, USA. The family had emigrated from Hungary to Philadelphia in the United States in\n1857\n. After four years in Philadelphia, the family moved to Washington, D.C. in\n1861\n.\nFranklin was educated in Washington, D.C. He won a scholarship to Columbian College in\n1864\nwhen he was eleven years old and the then new elective system allowed him to graduate in\n1869\nwith the degree of Ph.B. This college had been set up in\n1821\nafter the U.S. Congress had granted it a charter to be a \"non-denominational College in the District of Columbia\". When Franklin studied there the College was just restarting after the Civil war when it had been used as a hospital and military barracks. The College only attained university status in\n1873\n, four years after he graduated. In\n1904\nit changed its name to the George Washington University and it operates under this name today. After graduating from Columbian College, Franklin worked as an engineer and a surveyor for the Pittsburgh and Connellsville Railroad. He then continued with the same type of work at the City Surveyor's Office in Baltimore. This was the first of Franklin's three different careers.\nDespite working as a surveyor for seven years, Franklin always wanted to study mathematics at university since mathematics was the subject for which he had a great passion. When Johns Hopkins University opened in Baltimore, Maryland, in\n1876\nit was the first American university modelled on the research model of the German universities of the time. In\n1876\nJames Joseph Sylvester\naccepted the chair of mathematics at the University and fitted well into the idea behind the new university to merge research and teaching. The fact that Franklin was working in the City Surveyor's Office in Baltimore when Johns Hopkins University opened was a very fortunate coincidence. This led to the second of Franklin's three careers. Franklin was appointed as a Fellow at Johns Hopkins and joined the university in the autumn of\n1877\n, one year after the university opened. Franklin attended courses at the university and also participated in the Mathematical Seminar run by\nSylvester\n. It was an exciting time when\nSylvester\n, full of mathematical ideas and fully participating in the research and teaching environment created at Johns Hopkins, was filling his lectures with ideas that students like Franklin were able to benefit from\n[\n1\n]\n:-\n... in\n1878\n, when\nSylvester\nwas hard at work on his main contribution to the inaugural volume of the 'American Journal of Mathematics', he undoubtedly exposed Franklin and his other listeners to his evolving ideas on the interrelations between invariant theory in algebra and the atomic theory in chemistry by punctuating his lectures, as usual, with open questions and unverified conjectures.\nSylvester\nappointed some members of staff such as\nWilliam Story\nwho had studied for his doctorate in Berlin and Leipzig. He also appointed\nCharles Sanders Peirce\nin\n1879\n. One of\nSylvester\n's first achievements after his own appointment was the founding of the\nAmerican Journal of Mathematics\n. The first volume appeared in\n1878\nand the quote above refers to the paper\nSylvester\npublished in the first part of the first volume. Franklin's first paper, published in the second part of this first volume of the\nAmerican Journal of Mathematics\nin\n1878\nwas the\n25\n-page paper\nBipunctual Coordinates\n. Franklin begins his introduction by writing:-\nThe expressions for the bilinear coordinates of a point in terms of its trilinear coordinates contain a common denominator which is a linear function of the latter. Whenever, therefore, the trilinear coordinates of a point are such as to make this function equal to zero, its bilinear coordinates are infinite; nor are they infinite under any other supposition: and hence the equation formed by putting this common denominator equal to zero is called the equation of the infinitely distant straight line.  When we examine the corresponding expressions for the bilinear coordinates of a line, we do not arrive at any corresponding geometrical idea. These expressions, too, have a common denominator of the first degree; but the equation obtained by putting this denominator equal to zero represents simply the origin of coordinates, a point of no geometrical importance.  I propose to construct a system of coordinates. in which the infinitely distant point shall hold a position similar to that held by the infinitely distant straight line in the bilinear system.\nThis paper formed Franklin's Ph.D. thesis and he was awarded his doctorate in\n1880\n. However, let us go back to\n1878\nwhen Franklin was really undertaking two roles at Johns Hopkins. He was attending lectures and working on the ideas that\nSylvester\nwas suggesting as problems in these lectures. His second role was acting as\nSylvester\n's assistant and he undertook to do a considerable amount of tedious calculations directly at\nSylvester\n's request. Franklin's second paper, published in the fourth part of the first volume of the\nAmerican Journal of Mathematics\nin\n1878\n, was\nOn a Problem of Isomerism\n. This paper arose from\nSylvester\n's lectures when he had spoken about the interrelation between algebra and the atomic theory of chemistry. In the paper Franklin describes the problem he was attacking as follows:-\n... find the number of different compounds that can be formed by\nn\nm\nn m\nn\nm\n-valent atoms and\n(\nm\n−\n2\n)\n(\nn\n+\n2\n)\n(m - 2)(n + 2)\n(\nm\n−\n2\n)\n(\nn\n+\n2\n)\nunivalent atoms; the word 'compound' being understood to mean any arrangement, whether continuous or not, in which every atom appears with exactly the number of bonds to which its valence entitles it; it being understood, moreover, that no two univalent atoms are connected with each other.\nFranklin takes this problem about atoms and translates it into the following problem about partitions of integers:-\n... in how many ways can\nn\n−\n1\nn - 1\nn\n−\n1\nbonds be distributed among\nn\nn\nn\natoms, no atom having more than\nm\nm\nm\nbonds attached to it?\nThe paper solves the problem in the special case of\nm\n=\n2\nm = 2\nm\n=\n2\n. It is an important paper for here we see Franklin beginning his research into partitions of integers, the topic for which he is most often remembered today. His next paper, published in\n1879\nalso in the\nAmerican Journal of Mathematics\n, was also on partitions and had the title\nNote on Partitions\n. In this paper Franklin gave a different, and simpler, proof of a result on partitions that\nSylvester\nhad just published. In fact Franklin would publish a number of papers giving clever proofs of existing theorems over the following years. Another thing to note about the\nNote on Partitions\nis Franklin's use of generating functions, another topic he returned to several papers.\nThe next papers that Franklin published came from the work he did acting as\nSylvester\n's assistant. These were\nTables of the Generating Functions and Groundforms for the Binary Quantics of the First Ten Orders\n(1879)\nand\nTables of the Generating Functions and Groundforms for Simultaneous Binary Quantics of the First Four Orders, Taken Two and Two Together\n(1879)\n, both joint papers by Franklin and Sylvester. The next paper, although single authored by Franklin, still looked at this topic. It was\nOn the Calculation of the Generating Functions and Tables of Groundforms for Binary Quantics\n(1880)\nand Franklin gives the following abstract:-\nThe object of this paper is to give an account of the methods, due to Professors\nCayley\nand\nSylvester\n, of calculating the generating functions pertaining to binary quantics and thence determining the number of fundamental invariants and covariants of any order and degree. As it will not very greatly increase the length of the paper, I shall endeavour, besides giving the processes of calculation, to present a connected view, though not a complete discussion, of the subject.\nIn\n1879\nFranklin had been given an assistantship at Johns Hopkins and the assistantship was renewed for the academic year\n1880\n-\n81\n. In this academic year he was asked by\nSylvester\nto teach the course\n'Determinants\nand Modern Algebra'\n[\n1\n]\n:-\nAlthough he now served officially as his teacher's colleague, Franklin continued to participate in\nSylvester\n's courses. In particular, he sat in on the number theory course which\nSylvester\nhad begun teaching in the fall of\n1879\nto a class including Arthur Hathaway,\nChristine Ladd\n, and Oscar Mitchell.\nChristine Ladd\nhad been admitted to Johns Hopkins in\n1878\non the condition that she only attend lectures given by\nSylvester\nwho had made a special plea that she be allowed to study\n(\nin general Johns Hopkins did not admit women at this time\n)\n.\nSylvester\nalso persuaded the University to award her a $\n500\na year fellowship for the three years\n1879\n-\n82\n(\nalthough she was not allowed to describe herself as a fellow\n)\nand she was allowed to attend lectures by all the lecturers. We saw from the quote above that both Franklin and\nLadd\nattended\nSylvester\n's\nnumber theory\ncourse. Franklin was about five years younger than\nLadd\nbut the two soon became close friends. They married on\n24\nAugust\n1882\nand Franklin's wife took the name\nChristine Ladd-Franklin\n. Within two years two children were born, although one died while an infant the other, Margaret Ladd Franklin\n(1884\n-\n1960)\n, survived.\nLet us return to\nSylvester\n's number theory course which both Franklin and\nLadd\nattended. As he had done earlier, Franklin came up with a brilliant new idea about\nSylvester\n's lectures. Using the deep understanding he had acquired about partitions, he came up with a clever graphical proof of\nEuler\n's pentagonal number theorem which equates infinite products and infinite sums. Franklin wrote up his proof in French as\nSur le Développement du Produit infini\n(\n1\n−\nx\n)\n(\n1\n−\nx\n2\n)\n(\n1\n−\nx\n3\n)\n(\n1\n−\nx\n4\n)\n(1 - x)(1 - x^{2})(1 - x^{3})(1 - x^{4})\n(\n1\n−\nx\n)\n(\n1\n−\nx\n2\n)\n(\n1\n−\nx\n3\n)\n(\n1\n−\nx\n4\n)\n... and\nCharles Hermite\npresented the paper to the\nAcadémie des Sciences\nin Paris. It was published in\nComptes rendus\nin\n1881\n. This paper brought Franklin international acclaim.\nHermite\nwrote to\nSylvester\non\n29\nApril\n1881\n:-\nIt will certainly not be unpleasant for you to hear that I was not the only person to be very interested in Mr Franklin's very original and ingenious proof. ... Mr\nHalphen\n, one of our most eminent young mathematicians, who has just won the Academy's Grand Prix in mathematics, found Franklin's method so remarkable that he lectured on it in one of the most recent sessions of the Philomathic Society. Please tell Mr Franklin that his talent is appreciated, as it deserves to be, by the mathematicians of the old world.\nThis was praise indeed from a world leading mathematician like\nHermite\n. Franklin went on to publish many other papers, such as\n(\nwith\nJ J Sylvester\n)\nA Constructive Theory of Partitions, Arranged in Three Acts, an Interact and an Exodion\n(1882)\n,\n(\nwith\nP A MacMahon\n)\nNote on the Development of an Algebraic Fraction\n(1983\n/\n84)\n,\nProof of a Theorem of Tchebycheff's on Definite Integrals\n91885)\n,\nTwo Proofs of Cauchy's Theorem\n(1887)\n,\nSome Theorems Concerning the Centre of Gravity\n(1888)\n,\nNote on the Double Periodicity of the Elliptic Functions\n(1889)\n,\nNote on Induced Linear Substitutions\n(1894)\n, and\nNote on Linear Differential Equations with Constant Coefficients\n(1897)\n.\nFrancis Dominic Murnaghan\n, the author of\n[\n5\n]\n, was never taught by Franklin but he was on the staff at Johns Hopkins and came in contact with many who had been taught by Franklin. He writes:-\nProfessor Franklin was a very unusual and inspiring teacher. After a lapse of almost half a century former students still remember how clear and satisfying his lectures were. He was never content to expound a theory as it was developed by its author, and his hearers had the distinct impression that the matter being presented had been thoroughly digested by the lecturer and carried the stamp of his individuality and artistic nature. He was most conscientious and painstaking with his students, frequently going to great pains to answer a question whose import the student barely realised. His simple demeanour and dignity of person commanded the instant respect of his students, a respect which was never lost.\nHowever,\nMurnaghan\nbelieves that Franklin did not achieve the depth of research results that his talents would have merited\n[\n5\n]\n:-\nIn his mathematics itself were reflected the wide interests of his inquiring mind. This was a definite fault of his genius. To leave a mark in mathematics requires an 'esprit de suite' which doggedly pursues to the bitter end some path into the unknown. The professional mathematician, on noting a characteristic flash of genius or originality in one of Franklin's short papers, may well wish that he had not been so versatile nor so interested in politics or world affairs; but such wishes are idle. In the short period of some fifteen years before he definitely abandoned mathematics for journalism, he published some thirty papers, most of which appeared in the 'American Journal of Mathematics' or the Johns Hopkins University circulars.\nHaving been promoted to associate in\n1882\n, associate professor in\n1887\nand professor in\n1892\n, Franklin gave up his professorship in\n1895\nto begin the third of his three careers, namely as a journalist and author. Before he left Johns Hopkins he was asked to deliver the Commencement of the Johns Hopkins University on\n13\nJune\n1895\n. He chose the title 'Newspapers and Exact Thinking' and began his address as follows:-\nWhen President Gilman did me the honour to ask me to address you on this occasion, I felt some reluctance in undertaking the role of a Johns Hopkins Commencement orator. But upon considering that this is not only the first, but in all probability the last occasion on which I am to appear before the students and friends of Johns Hopkins University, I felt that I could not let it go by. As most of you probably know, I am about to make a change in my occupation - in one aspect perhaps the most extreme change that it is possible for a man to make in his mental atmosphere. Mathematics is the domain of the most exact and rigorous thinking of which the human mind is capable; I fear you will agree only too readily with me in pronouncing journalism to be the field in which loose and inexact thinking is most at home. This is in a great measure unavoidable from the nature of the case; and yet the contrast I have just mentioned seems to give appropriateness to the subject to which I shall venture to ask your attention for a few minutes - the need of exact thinking in the discussions of actual life.\nFirst he became editor of the 'Baltimore News' in\n1895\nand continued in this position until\n1908\n. In the following year he was appointed associate editor of the 'New York Evening Post' and then, in\n1919\n, he collaborated with Harold de Wolf Fuller as editor of the 'Weekly Review; devoted to the consideration of politics, of social and economic tendencies, of history, literature, and the arts'. It merged with 'The Independent' in\n1922\n. He was also the author of several books:\nPeople and problems; a collection of addresses and editorials\n(1908)\n,\nThe life of Daniel Coit Gilman\n(1910)\n,\nCost of living\n(1915)\n,\nWhat prohibition has done to America\n(1922)\n, and\nPlain Talks On Economics leading principles and their application to issues of today\n(1924)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}