{
  "nome_completo": "Farkas Wolfgang Bolyai",
  "nome_curto": "Farkas Bolyai",
  "ano_nascimento": "1775",
  "ano_morte": "1856",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bolyai_Farkas/",
  "lugar_nascimento": "Bolya (near Nagyszeben), Transylvania, Hungary (now Sibiu, Romania)",
  "lugar_morte": "Marosvásárhely, Transylvania, Hungary (now Târgu-Mureș, Romania)",
  "biografia": "Farkas Bolyai\n's mother was Krisztina Pávai Vajna and she inherited a small farm at Domáld which was near Marosvásárhely in Transylvania. Today Marosvásárhely is called Târgu-Mureș  and is the capital of Mureș judet\n(\ncounty\n)\nsituated in north-central Romania. Farkas Bolyai's father Gáspár Bolyai was\n43\nyears old when Farkas was born. He came from a family with a long history of fighting against the Turkish invaders and his ancestors had been wealthy, but although Gáspár still owned a small estate at Bolya near Nagyszeben, the family were by this time no longer wealthy. Today Nagyszeben is called Sibiu and is the capital of Sibiu judet\n(\ncounty\n)\nsituated in central Romania. When Farkas was born Nagyszeben was the military centre of Transylvania and the capital of the region.\nFarkas was taught at home by his father until he reached the age of six years when he was sent to the Calvinist school in Nagyszeben. His teachers immediately recognised his talents both in arithmetical calculation and in learning languages. When he was twelve years old he left school and was appointed as a tutor to the eight year old Simon Kemény who was the son of Baron Kemény. This meant that Bolyai was now treated as a member of one of the leading families in the country, and he became not only a tutor to Simon but a close friend. In\n1790\nBolyai and his pupil both entered the Calvinist College in Kolozsvár where they spent five years.\nThe time spent in Kolozsvár was important for Bolyai's development. The Enlightenment had spread across Europe and by this time was influencing Transylvania. This meant that Bolyai was presented with its fundamental idea that reason was the route to understanding the universe and to improving the position of man. Knowledge, freedom, and happiness should be the aims of a rational human being. On the other hand nationalist feeling were on the increase in Hungary. The country had been freed from Ottoman rule in\n1699\nand after an attempt at gaining independence, Hungary had been controlled by the Habsburgs. There was an increasing resentment against the Habsburgs, particularly from the workers, and Bolyai too felt support for Hungarian culture, language, and nationality. There were also conflicting religious pressures as branches of the Christian Church argued against each other and against the ideas of the Enlightenment.\nThe professor of philosophy at the College in Kolozsvár was an impressive person, and he tried to turn Bolyai against mathematics and towards religious philosophy. Bolyai on the other hand had wide ranging interests, science, mathematics, and literature all interested him and in\n1795\nafter leaving the College he spent a few weeks considering a career as an actor. However, he decided to go abroad with Simon Kemény on an educational trip funded by Baron Kemény and, after a delay caused by an unexpected illness, they set off in the spring of\n1796\n.\nFirst they reached Jena where Bolyai for the first time began to study mathematics systematically. He would go for long walks on his own and think about mathematics as he walked. After six months in Jena Bolyai and Kemény went to Göttingen. There he was taught by\nKästner\nand became a life long friend of\nGauss\n, a fellow student at Göttingen. This was the time when one could say that Bolyai really became a mathematician. He began to think about\nEuclid\n's geometrical axioms and in particular the independence of the Fifth Postulate. He discussed these issues with\nGauss\nand his later writing show how important he considered their friendship to be for his mathematical development.\nBy the autumn of\n1798\nBolyai and Kemény had completed their studies but back in Hungary Baron Kemény had hit hard times financially and although he supplied enough money for his son to return, Bolyai was left penniless in Göttingen. He spent a year there relying on charity and borrowed money for food to survive. It was a year of great hardship, yet one where he continued to develop mathematically surrounded by other talented mathematicians. After a year a friend sent him enough money from Hungary to pay the debts he had incurred and he set off on foot to return in July\n1799\n.\nBack on the family estate at Bolya he undertook research in mathematics. He went to Kolozsvár where he became a tutor. There he met Zsuzsanna Benkö and they married in\n1801\n. In Zsuzsanna's parents home on\n15\nDecember\n1802\ntheir son\nJános Bolyai\nwas born. When Farkas Bolyai was offered a job at the Calvinist College in Marosvásárhely he was rather reluctant to accept but his father, wanting his son to have a secure job, pressed him to accept. Bolyai taught mathematics, physics and chemistry at Marosvásárhely for the rest of his life.\nLife was not easy for Bolyai in Marosvásárhely. He was paid very little for his teaching at the College and had to take on extra work to bring in extra money. He wrote and published dramas, he ran the College pub, and he designed tiles and cast iron stoves which were produced commercially. Life was not easy at home too, for Bolyai's wife was a difficult person to live with and became increasingly difficult over the years as her health steadily deteriorated. Bolyai taught his son\nJános\nmathematics, for this was the subject which he hoped that he would follow. Up until János was nine years old students from the College taught János other subjects, and only at this age did he attend school. Mathematics, the subject which Farkas Bolyai loved, was relegated to something to do for relaxation. Certainly he gained little satisfaction from his mathematics teaching at the College for the level of his students was low.\nJános\nleft home in August\n1818\nto study at the Academy of Engineering at Vienna. Three years later, on\n18\nSeptember\n1821\nBolyai's wife died. He remarried in\n1824\nto Teréz Nagy. Through all these difficult years Bolyai was working on his mathematical masterpiece published in\n1832\n:\nTentamen juventutem studiosam in elementa matheseos purae, elementaris ac sublimioris, methodo intuitiva, evidentiaque huic propria, introducendi\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\n. The only mathematical pleasures in his difficult life were the letters he exchanged with\nGauss\nand, in later years, the mathematical achievements of his son.\nAll his life Bolyai was interested in the foundations of geometry and the\nparallel axiom\n. His main work, the\nTentamen\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\n, was an attempt at a rigorous and systematic foundation of geometry, arithmetic, algebra and analysis. The introduction shows clearly his rational approach to the world which he compares to a clock or a perfectly constructed church with the scientists aim:-\n... to understand the mechanism of the clock, to become familiar with the plan, the columns, the building blocks, and cement of the church and, by deciphering the last character, by finding the key to the code, reading the whole book of nature. To this physics aspires, a branch of science which uses mathematics. We raise Jacob's ladder to reach the skies with the help of mathematics ...\nThe\nTentamen\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\nis built on Bolyai's belief that mathematics consists of arithmetic and geometry with arithmetic as the mathematics of time and geometry as the mathematics of space. He tries to set both disciplines on an axiomatic basis and one his strong beliefs is that the axioms should be independent:-\n... no thing should be included among the axioms which follows from the others.\nAlso the axioms should, argues Bolyai, be obviously true:-\nAn axiom is a judgement that common sense accepts without further arguments, as a matter of course ...\nThe problem which had perplexed Bolyai most in his study of mathematics had been the independence of\nEuclid\n's Fifth postulate. In\n1804\nhe believed that he had a proof that it could be deduced from the other axims, but he sent his proof to\nGauss\nwho discovered the error. Eventually he gave up his attempts to prove its independence and tried instead to find an equivalent version which was more easily accepted by common sense. The\nTentamen\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\ncontains eight axioms equivalent to\nEuclid\n's Fifth Postulate such as:-\nNo sphere may differ from any other sphere in any property except its size and location.\nThree points which do not lie on the same straight line must lie on a circle\nThere are other ideas in the\nTentamen\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\nwhich show the quality of Bolyai as a mathematician. For example he gave iterative procedures to solve equations which he then proved convergent by showing them to be monotonically increasing and bounded above. His study of the convergence of series includes a test equivalent to Raabe's test which he discovered independently and at about the same time as Raabe. Other important ideas in the work include a general definition of a function and a definition of an equality between two plane figures if they can both be divided into a finite equal number of pairwise congruent pieces.\nHis attempts to stop his son studying the parallel axiom fortunately failed! Farkas Bolyai wrote to his son:-\nDetest it as lewd intercourse, it can deprive you of all your leisure, your health, your rest, and the whole happiness of your life.\nIn a letter written on\n4\nApril\n1820\nwritten to\nJános\nin Vienna, Bolyai wrote:-\nDo not try the parallels in that way: I know that way all along. I have measured that bottomless night, and all the light and all the joy of my life went out there.\nHowever, in\n1825\nBolyai's son\nJános\nshowed him his discovery of\nnon-euclidean geometry\n. At first Farkas Bolyai was not enthusiastic but certainly by\n1830\nhe had become enthusiastic for at this stage he persuaded\nJános\nto write up his discoveries.\nBolyai retired from his teaching in\n1851\nand after a number of strokes, died five years later. In his will he gave this rather poetic summary of his life:-\nUntil I returned from Germany it had been morning with the prospect of beautiful days which, after some days laden with fire and ice, turned into raining from the permanently overcast sky until this recent snowfall.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}