{
  "nome_completo": "Fatma Moalla",
  "nome_curto": "Fatma Moalla",
  "ano_nascimento": "1939",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moalla/",
  "lugar_nascimento": "Tunis, Tunisia",
  "lugar_morte": null,
  "biografia": "Fatma Moalla\n's father was Mohamed Moalla who was from Sfax, a city in Tunisia\n270\nkm southwest of Tunis. Fatma's eldest sister was born in Sfax before Mohamed Moalla moved with his family to Tunis where he continued to work as a bookseller. Mohamed Moalla's family consisted of six girls, all but the eldest being born in Tunis after they moved there. Fatma wrote\n[\n1\n]\n:-\nI had a happy childhood and a thriving adolescence. My five sisters and I lived in Tunis. We were born in Tunis as well, except for my older sister who was born in Sfax. And my father was the first Sfaxian to emigrate to Tunis, with my maternal uncle and Mr Taïeb Miladi. At that time there was also internal emigration. My father continued to do in Tunis the same job he did in Sfax, namely bookseller. He settled in Rue Sidi Ben Arous and has known generations of Zitounians and Sadikians who frequented his bookstore. He was a known figure of the souks of the Medina, a scholar and an enlightened man who loved books and reading and who transmitted to us this love intact.\nLet us clarify some things in this quote. 'Zitounians' are students of the University of Ez-Zitouna in Tunis. 'Sadikians' are students of Sadiki College in Tunis. A 'souk' is a bazaar and 'Medina' is the Medina Quarter of Tunis, an ancient part of the city. The 'Rue Sidi Ben Arous' is one of the principal streets of the Medina Quarter of Tunis.\nLet us give a little background about Tunisia. It was controlled by France beginning in\n1883\nexcept for a period during World War II when the Axis powers took control. Even before World War II, in\n1934\n, Habib Bourguiba\n(1903\n-\n2000)\nhad founded a separatist movement which, after Tunisia was returned to French control after the World War II continued the struggle for independence. After a very difficult period the country gained independence in\n1956\n. Bourguiba became the first President of the Republic of Tunisia.\nMoalla spoke of her childhood in\n[\n1\n]\n:-\nAs for us\n[\nchildren\n]\n, at that time, we went out very little and we used to stay home. But I will always keep a wonderful memory of my childhood in the Bardo family house, often in the garden, with my mother, so gentle, so enlightened, so open, so good, and with my sisters and young nephew. From my childhood, I will also remember that our greatest joy, my sisters and myself, was to go into my father's back bookstore to practise our favourite sport: reading! How many books have been devoured!!\nMoalla attended the Lycée de la Rue du Pacha, a secondary school on the Rue du Pacha in Medina of Tunis, the Medina Quarter of Tunis, the old part of the city. This school is one of the leading schools for girls in Tunisia. She explained that this school\n[\n1\n]\n:-\n... provided Sadikian instruction, that is to say that at the end of the first part of the Baccalaureate\n(\nthe Baccalaureate was at this time divided into two parts and was obtained at the end of two years\n)\n, we sat the \"Sadiki College Graduation Diploma\" examination, which gives an excellent training that is quite bilingual. By the way, during my time at high school, I loved practically all the subjects, whether they were taught in Arabic, or in French, or even in English.\nAfter the award of the first part of her Baccalaureate in\n1956\n, later that year she moved from the Lycée de la Rue du Pacha to the Lycée Carnot of Tunis. The Lycée Carnot was originally called the Lycée Sadiki but changed its name to avoid confusion with the Sadiki College of Tunis. It is in the Medina Quarter of Tunis. At this stage she had to make a decision as to the subject in which to specialise and, making a choice between mathematics, experimental sciences, or philosophy, she chose her favourite subject, namely mathematics. When asked why she chose mathematics, she replied\n[\n1\n]\n:-\nWith hindsight, I believe that the reason is that mathematics corresponded more to my character: I adore rigour, precision and honesty. I hate cheating. And this is mathematics! It is an exact and hard science, where one must be precise. Thus, each word has its importance in a mathematical definition: one has no right to remove, add or change a single word. Mathematics requires clarity, and even limpidity. The famous words of Boileau\n[\nNicolas Boileau-Despréaux\n(1636\n-\n1711)\nwas a French poet\n]\nare always remembered in mathematics: \"What is well conceived is clearly stated, and the words to say it flow with ease.\" In mathematics, one learns to become fair by treating all cases equally, and one learns to become humble and to move away from human vanity by measuring one's own limits in front of the difficulty of the problems to be solved. In mathematics, we want to exclaim: Glory to honesty, glory to clarity, glory to the neat treatment of problems! Down with confusion, down with obscurantism, down with deceit! And that's why I chose mathematics. However, although mathematics helps to make a person a good person, it sometimes fails to do so\n(\notherwise all world mathematicians would be good persons\n)\n. I immersed myself, without regret, in the universe of mathematics at the Lycée Carnot ...\nAfter one year studying mathematics at the Lycée Carnot she was awarded the second part of the Baccalaureate in\n1957\n. She then began her university studies.\nDuring the next three years, from\n1957\nto\n1960\n, Moalla studied at the Institut des Hautes Études de Tunis which is situated at\n8\nRue de Rome. This Algerian university was modelled on the French system since Algeria had been administered by the French up to\n1956\n. She graduated with her mathematics degree in June\n1960\nbut, wanting to continue her studies, she prepared to take the French Licence examination by correspondence with Paris. This was a necessary way for her to get further qualifications while still living in Tunisia since the degree she had obtained from the Institut des Hautes Études de Tunis was the highest degree offered in Tunisia. Her studies of higher geometry earned her the French diploma in October\n1960\n.\nMoalla was not satisfied with stopping her studies at this level and she was very keen to obtain a doctorate in mathematics. This was quite impossible if she remained in Tunisia but she was able to obtain permission from her father and was awarded a scholarship by the Tunisian government which allowed her to travel to Paris to continue her studies there. She explained\n[\n1\n]\n:-\nAt this point, to continue, it was necessary for me to leave Tunis. And there, I had to have the consent of my father, and I had to have a scholarship. Fortunately, President Bourguiba and Minister Mahmoud Messaâdi were enlightened and encouraged the education of both boys and girls. That's why I got a scholarship. As for my father, who was very conservative, he agreed to send his daughter abroad so she could finish her studies. It should be noted that there were, at that time, many \"supposedly\" modern parents who prevented their daughters from going abroad to study.\nAs we noted above, Habib Bourguiba\n(1903\n-\n2000)\nhad led the separatist movement in Tunisia which achieved independence in\n1956\n, following which he became the first President of the Republic of Tunisia. Mahmoud Messaâdi\n(1911\n-\n2004)\nwas a renowned Tunisian author who became a cabinet member after independence.\nMoalla spent one year in which she prepared for CAPES, the Certificate for teaching in secondary education, and the Agrégation. Moalla sat the oral examination in July\n1961\nat a most difficult time since she was a Tunisian in France and the two countries were fighting each other. This happened because after Tunisian independence in\n1956\n, France continued to control the Tunisian town of Bizerte which they wanted as a military base. Tunisia tried to arrange for the French to leave but when they refused to do so, on\n17\nJuly\n1961\nthe Tunisians shot at French helicopters. France took action with a bombing campaign which killed at least\n700\nTunisians\n(\nsome accounts give a much higher figure\n)\n. Moalla said\n[\n1\n]\n:-\nAnd I was deeply afflicted, shocked by this war. Being someone extremely pacifist, I will never be able to understand wars. And I was horrified, saddened by the terrible number of deaths in this war. It was so sad! I was deeply distressed because of my dead compatriots, they should never have been sent to their death ...\nDespite the difficulties, Moalla was awarded the Agrégation in\n1961\nand returned to Tunisia\n[\n1\n]\n:-\nWhen I returned to Tunisia everyone was glad, especially in my family, both maternal and paternal. There, I realized how much the Tunisian people liked studying, as this glorification of studying was unanimous ... But I was also received in great pomp by the officials: by President Habib Bourguiba, by Minister Mahmoud Messaâdi, by national organizations. Why? It so happens that in the female and male population of Tunisia, the very first person who earned her Agrégation in mathematics was a girl, before the boys. So I was the first but it takes a first to everything! So, in addition, the \"National Union of Tunisian Women\", which was very important, exploited this with a lot of fuss. And I hope that one day one will stop making such a fuss, largely for a simple chronological chance ... And immediately, I was appointed by Messaâdi, who had proposed me a half-service at the Secondary and a half-service at the University in order to have a varied educational experience, according to him. ... In short, it was the good old days when one did not wait for years to be appointed to the public service, and where the candidates willingly accepted what was proposed to them: I fulfilled this task as best as I could.\nMoalla was appointed as a mathematics teacher in the Lycée de la Rue du Pacha, the school which she had herself attended, teaching there for the year\n1961\n-\n62\n. She was also appointed as an assistant at the Faculté des Sciences Mathématique, Physiques et Naturelles which had been founded in\n1960\n. She wanted, however, to continue to undertake research in mathematics\n[\n1\n]\n:-\nThis wasn't the final stage of my professional career - I missed something: I wanted to continue my studies to the end. In other words, get my doctoral thesis and continue to do mathematics. Effectively, I defended my \"doctorat d'état\" thesis in\n1965\n, in Paris. This doctorate was the first earned by a Tunisia woman, and perhaps by a Tunisian man. I was, after that, directly appointed to the Faculty of Sciences of Tunis, where I taught until retirement, without ever leaving, without ever holding concurrently another job ... I have trained generations of mathematicians, and some have taken over.\nIn\n1964\nMoalla published\nEspaces de Finsler complets\nⓉ\n(\nComplete Finsler Spaces\n)\nin\nComptes rendus des séances de l'Académie des sciences de Paris\nⓉ\n(\nRecords of the sessions of the Paris Academy of Sciences\n)\n.  Thomas James Willmore\n(1919\n-\n2005)\nwrites in a review\n[\n2\n]\n:-\nThe theorem of\nHopf\n-Rinow, generalised by\nde Rham\n, states that for a complete Riemannian manifold the following properties are equivalent:\n(\na\n)\neither every geodesic can be continued indefinitely in either direction or else it is closed;\n(\nb\n)\nevery\nCauchy\nsequence is convergent;\n(\nc\n)\nevery bounded subset is relatively compact. In this paper it is shown that the\nHopf\n-Rinow theorem applies to\nCartan\n-\nFinsler\nspaces for which the geodesics coincide with the extremals of the length integral.\nHer next paper, in the same journal, was\nEspaces de Finsler complets à courbure de Ricci positive\nⓉ\n(\nFull Finsler spaces with positive Ricci curvature\n)\n. It was again reviewed by T J Willmore who writes\n[\n3\n]\n:-\nFollowing the theory of\nFinsler\nspaces as developed by\nÉ Cartan\n[\nLes espaces métriques fondés sur la notion d'aire\n(1934)]\n, the author generalises to these spaces theorems previously obtained by Myers for Riemannian manifolds.\nMoalla continued to publish in\nComptes rendus\nand her third paper was\nEspaces de Finsler sans points conjugués\nⓉ\n(\nFinsler spaces without conjugate points\n)\n(1965)\n. T J Willmore writes\n[\n4\n]\n:-\nUsing the Riemannian case as a guide, the author generalises the idea of total scalar curvature to a compact manifold which admits a\nFinsler\nstructure. She proves that if the\nFinsler\nstructure contains no conjugate points, then the total scalar curvature is non-positive.\nHer fourth paper is a very major work of\n47\npages and is closely based on her thesis. It is titled\nSur quelques théorèmes globaux en géométrie finslérienne\nⓉ\n(\nOn some global theorems in Finsler geometry\n)\nand was published in the\nAnnales de Mathématiques Pures et Appliquées\nin\n1966\n. It was reviewed by Eugene M Zaustinsky who begins with the review\n[\n5\n]\n:-\nThis paper extends some of the most interesting and important results of global Riemannian geometry to differentiable\nFinsler\nspaces. The point of view of the author is essentially that of\nÉ Cartan\n; that is, a\nFinsler\nspace is defined as a structure on the bundle of all non-zero tangent vectors to a differentiable manifold by means of a fundamental function satisfying the usual hypotheses. The methods of investigation are those of the theory of connections in fibre bundles.\nIn\n[\n1\n]\nMoalla is asked by Haithem Haouel if she is a genius. Here is her reply:-\nIf I were, I would have had the\nFields\nMedal or at least a medal ... ten times less important. No, I have only been serious. I have always been serious in everything I have undertaken. I also enjoyed my work and, after all, it is a pleasure to do the work that you love. I have great memories of brilliant students or simply hardworking or good ones, and an excellent memory of colleagues I have worked with often, moreover, as a member of remarkable women's teams... And I hope I have been a good teacher. As for \"my reputation\", it is due in large part to a mere coincidence in time and chronology of events ... The second remark concerns the first question you asked me where you were talking about Ms Mongia Mabrouk and Ms Zoubeïda Amira.\n[\nMongia Mabrouk was first doctor of Arabic literature and Zoubeïda Amira was first Tunisian director to hold the reins of a high school in Tunisia just after independence.\n]\nI salute your love for your foremothers, and I hope that one day too my grandchildren like you will remember me with love ... Indeed, I knew well Ms Zoubeïda Amira, she was the Director of my high school in the Rue du Pacha. What a good Director! And what a good teacher! Since she also taught in parallel Arabic history. I loved her course ... To my former principal and professor, to my father, to my mother, to my elder sister, to the deceased of my paternal family and my maternal family, to Bourguiba, Messaâdi, Sghaïer Ouled Ahmed ... I would say to you all: I have not forgotten you. You made me what I am today. I feel so much gratitude for you. Peace to your souls!\n(\nSome may wonder: what is the poet Sghaïer Ouled Ahmed doing in this list of deceased? Well, it is that I address to his memory all my thanks for expressing, so simply, in a verse of his poetry, what I have always felt: the love of country, its verse of poetry helped me to overcome the setbacks of recent times ...\n)\n. As for me, still alive to day, I say to myself: \"Hamdoullah\" and I will proclaim until the last minute: Down with terrorism, down with obscurantism, down with confusion, down with deceit! Long live Work, long live Clarity, long live Mathematics and, most important of all: Long live Tunisia!\nIn\n2017\nthe Tunisian Women Mathematicians' Association created the 'International Fatma Moalla Award for the Popularisation of Mathematics' to reward outstanding contributions in the presentation of mathematical research made understandable for a general audience. The prize was awarded for the first time in\n2018\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}