{
  "nome_completo": "Fearon Fallows",
  "nome_curto": "Fearon Fallows",
  "ano_nascimento": "1788",
  "ano_morte": "1831",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fallows/",
  "lugar_nascimento": "Cockermouth, Cumbria, England",
  "lugar_morte": "Simon's Town, South Africa",
  "biografia": "Fearon Fallows\nwas the son of John Fallows\n(1759\n-\n1826)\nand Rebecca Fearon\n(1759\n-\n1828)\n. John Fallows, born\n14\nMay\n1759\nin Cockermouth, was a hand-loom weaver. He married Rebecca Fearon on\n2\nMay\n1787\nin Cockermouth. They had five children: Fearon Fallows\n(\nborn\n1788)\n, the subject of this biography, John Fallows\n(\nborn\n1791)\n, Mary Fallows\n(\nborn\n1793)\n, Margaret Fallows\n(\nborn\n1799)\n, and Rebecca Fallows\n(\nborn\n1802)\n. Let us note at this point that many of the biographies of Fearon Fallows give his date of birth as\n4\nJuly\n1789\n. Some of these even remark that the plaque on the wall of the cottage where he was born give the incorrect date of\n1788\n. In fact the article\n[\n21\n]\n, however, shows that\n1788\nis definitely the correct year since his baptismal records show that he was baptised on\n23\nJuly\n1788\n\"aged three weeks.\"\nFearon was born in a little cottage in Low Sand Lane Cockermouth, close to the house where the poet William Wordsworth lived. By the time the child had reached the age of five he was amazing his father with his ability to calculate. As soon as he was old enough, he began to help his father at his weaving but his father, although poor and working at a manual trade, was a highly intelligent man who realised that his talented son should have the opportunity of an education. Although a manual worker, John Fallows had a level of education which later allowed him to act as parish clerk at the church in neighbouring Bridekirk. A particularly impressive event has been recorded when Fearon was six years old\n[\n17\n]\n:-\nThe most current and best-authenticated story of Fearon Fallows' early genius would imply that, at the age of six years, he mentally computed the number of farthings in a guinea. This arithmetical effort astonished his father, as well it might; and as Fearon continued to manifest his precocity in similar methods of calculation, the parent's instincts were directed to the channels most available to the promotion of his son's education.\nJohn Fallows was able to teach his young son the basics of arithmetic and geometry.\nThere was a Free Grammar School in Cockermouth which had been founded in\n1676\nbeside All Saints Church. This school claims Fearon Fallows as one of its famous pupils but his father chose to engage private tutors to teach his son more mathematics, although he could hardly afford to do so, rather than have his son be left with what the Free Grammar School could offer. Certainly he employed Mr Cooper, who lived in Brigham about\n4\nkm from Cockermouth. Very soon, however, Cooper told Fallows' father that the boy knew more mathematics than he did, so his father should not waste his money employing him\n[\n14\n]\n:-\nWhen a mere boy, a mathematical book was his constant companion at the loom; and this taste was encouraged by the kindness of many persons in the vicinity, who supplied him with books, and such assistance in his studies as they were competent to give.\nJohn Fallows became parish clerk at the church of St Bridget's in Bridekirk,\n3\nkm north of  Cockermouth, where the vicar was Rev Humphrey Archer Hervey\n(1768\n-\n1843)\n. John Fallows was proud of the mathematical skills that Fearon was demonstrating and told the Rev Hervey. In turn the Rev Hervey spoke to Mr Temple, headmaster of Plumbland Church of England School in Plumbland near Parsonby about\n6\nkm north of Bridekirk. This school:-\n... was opened on Sunday, January\n12\nth,\n1800\nas Plumbland Free Grammar School. The original building contained two spacious classrooms and a clock tower. It was built in the Georgian style of architecture with low windows giving rooms that were light, cheerful and warm.\nMr Temple employed Fallows as an assistant but, in\n1808\n, Temple died. The Rev Hervey, still eager to do the best he could for Fallows, approached the vicar of Plumbland who was responsible for the running of the school\n[\n17\n]\n:-\n... on the death of Mr Temple, the Rev Edward Stanley, rector of Plumbland, offered the situation to Fearon, who accepted it. This was a fortunate introduction for Fallows, as the Rev Mr Stanley, a man of superior character and discernment, soon ascertained the young schoolmaster's worth and high abilities, and laudably exerted himself to promote his advancement. The clergy, gentry, and others in the neighbourhood, on hearing of Fearon's great promise, willingly co-operated with the Rev Messrs Hervey and Stanley in getting up a subscription to enable him to go to Cambridge, and in the year\n1809\nhe commenced residence as a student of St John's College, Cambridge.\nFallows was admitted to St John's College, Cambridge on\n22\nJune\n1809\nas a\nsizar\n[\n16\n]\n:-\n... enabled by the patronage of some gentlemen of fortune.\nBeing a sizar meant that he received financial help from the College for which he was required to undertake certain menial duties. He matriculated at the beginning of the Michaelmas term\n1809\n(\naround\n1\nOctober\n)\nand began his studies of the Mathematical Tripos. Two others who matriculated at Cambridge at the same time were\nJohn Herschel\n(\nat St John's College\n)\n, and\nGeorge Peacock\n(\nat Trinity College\n)\n. Another outstanding mathematician, who matriculated at Trinity College, Cambridge, in\n1810\nwas\nCharles Babbage\n.\nCambridge was a wonderful place for Fallows who was very happy in the academic atmosphere and, after years of basically being self-taught, was delighted to be able to learn from leading mathematicians such as\nRobert Woodhouse\n. Access to books was now a simple matter and he had friends with whom he could discuss mathematics. He soon found, however, that the support he had received from \"some gentlemen of fortune\" was not sufficient to see him complete his degree and he contemplated having to give up. At this point, however, he had a piece of good fortune in that he received an anonymous gift of £\n100\n. His progress was outstanding and he was also a scholar in\n1812\n. In\n1813\nhe was sat the tripos examinations, was awarded an M.A. and was ranked Third Wrangler. The first Wrangler was\nJohn Herschel\nand the Second Wrangler was\nGeorge Peacock\n. It had been a very close contest between Fallows and\nPeacock\n.\nHerschel\nwas elected a fellow of St John's College,\nPeacock\nwas elected a fellow of Trinity College but there was no fellowship for Fallows; he was very unlucky to have been in competition with\nHerschel\nwho produced one of the most brilliant mathematical tripos performances of all time.\nLet us note another point here.\nBabbage\n, himself a brilliant mathematician, was so in awe of\nHerschel\n's abilities that he refused to compete with him. Fallows, on the other hand, was happy to compete and, rather than go in a different direction academically from\nHerschel\n, he was happy to go towards\nHerschel\n's specialist interest of astronomy. Fallows spent two years as a lecturer in mathematics at Corpus Christi College before returning to St John's College in\n1815\nwhere he was elected to a fellowship. He was ordained a deacon at Ely on\n24\nAugust\n1815\n. In\n1816\nhe was appointed as an examiner for the mathematical tripos of\n1817\n. He then came under pressure from\nHerschel\nand\nPeacock\nto begin a transition from\nNewton\n's notation for the calculus to that of\nLeibniz\n[\n2\n]\n:-\nIn December of\n1816\n,\nPeacock\ngarnered support for the action he proposed in setting the Tripos. He wrote to\nHerschel\nthat he would use the 'd's' on the printed problem papers, 'putting the questions with the old notation at the bottom of the page'. ... To gain more support,\nPeacock\nasked\nHerschel\nto intervene with one of the examiners for the forthcoming Tripos, Fearon Fallows, the son of a weaver and third wrangler behind\nHerschel\nand\nPeacock\nin\n1813\n.\nHerschel\n, in a letter to Fallows, after intoning that 'a sudden and violent change in this\n[\nthe Tripos\n]\nis impracticable and perhaps would not be desirable', wrote: '\nPeacock\nis ardent in the cause; White, I have heard falls in with many of his views ... and I have great hopes ... that you will at least not oppose any of the steps they may agree upon between them for the purpose.' Then\nHerschel\ndescribed the evils of cramming and complained that the necessity for speed in writing answers did not allow genius to shine. A few days later,\nHerschel\nwrote to Whittaker that he had encouraged Fallows to examine 'according to the principles of the true faith and on principles of moderate reform\n(\nbeing urged to do so by the violent motive resulting from the will of another\n)\n'. ... Despite these efforts,\nPeacock\ncame to believe that he achieved nothing in the Tripos of\n1817\n. ... He had expected opposition to this remodelling from\nBland\n, one of the examiners, but he was overcome when ambushed by both White and Fallows who deserted him under pressure from 'older members' of the University.\nIn\n1818\nFallows became the moderator\n(\nchief examiner\n)\nof the mathematical tripos. He also continued his clerical career and, on\n14\nMarch\n1819\n, he was ordained a priest.\nThe Astronomical Society\n(\nit only became the \"\nRoyal Astronomical Society\n\" somewhat later\n)\nwas founded on\n12\nJanuary\n1820\nwhen fourteen founder members, including\nBabbage\nand\nHerschel\n, met.\nHerschel\nwrote to both Fallows and\nPeacock\non\n26\nJanuary concerning the setting up of the Astronomical Society. A second meeting was arranged for\n29\nFebruary when\n28\nattended; Fallows was elected a fellow of the\nRoyal Astronomical Society\nat this\n29\nFebruary meeting. By this time the Astronomical Society had\n83\nmembers,\nWilliam Herschel\nwas voted a Vice-President,\nBabbage\nan English Secretary, and\nJohn Herschel\nthe Foreign Secretary. On\n8\nJune\n1820\nFallows was elected a fellow of the\nRoyal Society of London\n. One of his proposers was\nJohn Herschel\n.\nOn Thursday\n3\nFebruary\n1820\nthe Commissioners \"appointed by Act of Parliament for more effectually discovering the Longitude at Sea\" met at the Admiralty. It was proposed that an Observatory at the Cape of Good Hope be established  which would be \"highly conducive to the improvement of astronomy.\" At a later meeting on\n17\nFebruary they recommended the appointment of an Astronomer of the Cape \"as soon as a proper person can be found.\" The Cape of Good Hope Royal Observatory was established by an Order in Council of\n20\nOctober\n1820\nand, on\n26\nOctober\n1820\n, Fearon Fallows was appointed to the office of Astronomer at the Cape of Good Hope.\nIt may well have been through the influence of\nHerschel\nthat Fallows had become interested in astronomy. Although his main interest was in mathematics, while he was a mathematics lecturer\n[\n7\n]\n:-\n...  at Corpus Christi,\n[\nhe\n]\ngrinded his own speculum metal mirror and built his own reflecting telescope, observed the solar eclipse of\n18\nNovember\n1816\n,\n[\nand\n]\nhoped to set himself up with a small observatory.\nNevertheless, he must have been surprised to receive a letter offering him the post of Astronomer at the Cape of Good Hope\n[\n15\n]\n:-\nThe few months which intervened between the time of his appointment and his removal to the Cape, were spent by Mr Fallows in the public and private observatories of this country, in the workshops of our most celebrated artists, in the calculation of special tables, and in devising the best and simplest means of making, registering, and reducing, astronomical observations.\nFallows was now in a position to marry; he could not while holding the fellowship since fellows were not allowed to marry until a change of rules in\n1860\n. On\n1\nJanuary\n1821\nhe married Mary Ann Hervey\n(1796\n-\n1838)\n, the daughter of Rev Humphrey Archer Hervey\n(1768\n-\n1843)\nwho had done so much to help Fallows' career, and his wife Sarah Mawson\n(\nborn\n1777)\n. Mary Ann Hervey had been born on\n14\nMarch\n1796\nin Bridekirk, Cumberland, the eldest of her parents' eight children. Fearon and Mary Fallows sailed for South Africa on the ship the Sappho on\n4\nMay\n1821\nwith their maid Sarah Bootle. It was a difficult journey, especially for Mary who was pregnant. Also with them was Fallows' assistant James Fayrer\n(\nborn\n1798)\n, the son of a London instrument maker for whom he had worked. The Fayrers were distant relations of the famous instrument maker Edward Troughton and James had with him a good quality telescope made by Troughton. Betsy Fayer, James' sister, was accompanying him. Also on the Sappho was Andrew Smith\n(1797\n-\n1872)\nwho had studied medicine at the University of Edinburgh, joined the army as a surgeon, and had been posted to Cape Colony to care for the British troops there. The ship arrived in Simon's Bay on\n12\nAugust\n1821\nbut rather than travel overland to the Cape which they feared would damage their delicate instruments, the whole party were transported to Table Bay by ship.\nBefore leaving England, Fallows had been given precise instructions and he now carried them out. He rented a house at\n14\nKloof-street and set up a temporary wooden observatory in the garden. He observed with the help of his assistant Fayrer and a second assistant, the Reverend Patrick Scully. Sadly, Fayrer was seen to be lazy, insolent, and prone to drinking. In May\n1822\nFallows moved to a house near Concordia Gardens bringing with him the wooden observatory. From this temporary site he began cataloguing stars. Fayrer married Sarah Bootle on\n13\nMay\n1822\nin the English Church, Cape Town\n(\nwhich later became St George's Cathedral\n)\n. Sarah, like her new husband, seems to have been too fond of the drink, and Fayrer was officially demoted to labourer while Scully became Fallow's only assistant.\nRev Patrick H Scully, a Roman Catholic priest, had arrived at the Cape on\n1\nDecember\n1819\n, so founding the Catholic Church in South Africa. He received a salary of £\n100\nper annum and built a chapel. He was a talented and highly respected man but, when Lord Charles Somerset returned to the post of Governor of the Cape, he cancelled Scully's salary saying that he had always done his utmost to oppose the Catholic religion. That is when Scully took the post as second assistant to Fallows at the salary of £\n50\nper annum. Reports of the time\n(\nsee\n[\n3\n]\n)\ntell us that Fallows and Scully \"entertain the greatest friendship.\" After Fayrer was dismissed, Scully took over as first assistant on\n22\nMay\n1822\nbut left his post in May\n1824\nin somewhat mysterious circumstances\n[\n3\n]\n:-\nSeveral domestic troubles are chronicled in veiled and cryptic language, and then, \"Finally, on\n17\nth July,\n1824\n, he\n(\nMr Fallows\n)\nfound it absolutely necessary to dismiss Mr Scully, and was thus left alone.\" The real cause for his dismissal was not therein stated by the Rev Mr Fallows, but we learn it from a later source, a resume of the history of the Catholic Mission at the Cape sent to Dr Morris at Port Louis, Mauritius, in\n1833\n, in connection with disputes then raging. From this paper we learn that sometime in\n1823\n, that would be after receiving intimation of the Admiralty's sanction of his appointment, Father Scully told his churchwardens of the post that had been offered to him, with residence in the household of the Rev Mr Fallows. The situation thus created was certainly a strange one: a Catholic priest residing in the house of a clergyman of the Established Church, and doing his clerical duties therefrom. The churchwardens not unnaturally stated their objections, saying such a course was unsuitable: but he nevertheless accepted it despite their protest. After about a twelvemonth, \"Mr Scully became entirely estranged from his flock and was publicly, although not in any Court of jurisprudence, impeached with a crime of which we certainly, from the knowledge of his deportment, do honourably acquit him, and ascribe the charge to a matter of mere malversation emanating from Mr Fallows' own family, who evinced a most delusive demeanour towards Mr Scully, during his sojourn with them. However unfortunately it must appear to our fellow Catholics, their clergyman became the victim of slander, and on the\n11\nth July,\n1824\n, when the circumstance was made known to him that he had been, according to report, discovered in a criminal conversation with a female in the service of Mr Fallows, Mr Scully engaged a passage for Europe and sailed so suddenly,\" that the congregation, not knowing of it, assembled for Mass as usual on the following Sunday.\nDespite Scully's support from the Catholic Church, we cannot believe that Fallows would cause Scully to leave by slandering him. In the first place this would be totally out of character for Fallows, and secondly he was in great difficulty carrying out his duties without an assistant.\nFallows' main first task had been to find a suitable site for the Cape of Good Hope Royal Observatory. This was never expected to be easy but proved to be a longer and more difficult task than anyone could have imagined. In fact it would be four years before construction of the new Observatory began\n[\n7\n]\n:-\nOn explaining that he wanted to establish the Observatory on a hill, the Colonial Government, \"considering that the proximity to stars was sine qua non\", offered him a site on Table Mountain so he could be closer to the stars.\n(\nTable Mountain is for a great part of the year either covered by cloud or plagued by strong winds.\n)\nAfter extensively scouting around quite afar in all directions Fallows settled on a hill known as Tygerberg, only to change his mind again. The terrain that he chose was a rocky hill named Slangkop\n(\nSnake Hill\n)\nat the confluence between the Black and Liesbeek rivers.\nHe changed his mind about the Tygerberg site when the Government surveyor explained to him in March\n1822\nthat climatic problems at that site meant it was frequently cloud covered. He quickly chose the Snake Hill site but there was then a long delay by the English authorities. It took until April\n1824\nbefore the Secretary of State for the Colonial Department approved starting construction but, in October of that year, he was told to stop since the land he had chosen was claimed to belong to a Mr C Mostert and not the Government.\nFor more details of all these difficulties, including letters to and from Fallows, see\nTHIS LINK\n.\nEven when all these difficulties were overcome, construction of the observatory presented its own problems\n[\n7\n]\n:-\nAs to the construction there were problems. The plans were drawn up, and then redrawn. Construction was contracted out to local builders who proved to be \"unsatisfactory\" as well as thieves. Finding suitable building material was a constant problem and hampered by the Burmese Wars, as Burmese Teak was used in the construction.\nFallows and his family had other difficulties, for the rented house they were living in was in poor condition; at one point the roof fell in and the family were lucky to avoid injury. His wife had suffered several miscarriages and two children who were born during their time at the Cape died within a month. He was also trying to deliver observations back to England as was required of him but the instruments he had were of very inferior quality. After Scully left he had no assistants. His request that the Admiralty send him another one was made in May\n1824\nbut the new assistant, Captain William Ronald, did not arrive at the Cape until December\n1826\n.\nThe building of the observatory was complete by the spring of\n1827\nbut supports for the instruments took longer and observing from the new observatory could not begin until\n1829\n. By this time both Ronald and Fallows were in poor health. On\n17\nOctober\n1830\n, because of his illness, Ronald left South Africa and returned to England. He hoped to be able to return to the Cape but he eventually resigned on\n29\nMarch\n1831\n. Fallows, ill and without an assistant, was helped by his wife who had been undertaking observing duties before Ronald left. Mary Fallows was very capable and had learned quickly; in March\n1830\nshe discovered a new comet. Despite becoming seriously ill, Fallows refused to give up work and was carried each day in a blanket to the observatory. By the end of March\n1831\nhe gave up work and went to Simon's Town to seek medical help but it was too late and four months later he died. He was buried in front of the observatory, his grave being marked with a black Robben-island stone.\nWe give three additional biographies of Fallows. One which was published in the\nMemoirs of the Royal Astronomical Society\n(1833)\nis at\nTHIS LINK\n.\nA version of the\n1867\nbiography\n[\n17\n]\nby Henry Lonsdale is at\nTHIS LINK\n.\nA version of a modern biography by Stuart Atkinson is available at\nTHIS LINK\n.",
  "math_areas": [
    "Calculus"
  ]
}