{
  "nome_completo": "Felix Christian Klein",
  "nome_curto": "Felix Klein",
  "ano_nascimento": "1849",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Klein/",
  "lugar_nascimento": "Düsseldorf, Prussia (now Germany)",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Felix Klein\nis best known for his work in\nnon-euclidean geometry\n, for his work on the connections between geometry and\ngroup theory\n, and for results in function theory. He was born on\n25\n/\n4\n/\n1849\nand delighted in pointing out that each of the day\n(\n5\n2\n5^{2}\n5\n2\n)\n, month\n(\n2\n2\n2^{2}\n2\n2\n)\n, and year\n(\n4\n3\n2\n43^{2}\n4\n3\n2\n)\nwas the square of a prime.\nKlein's father was secretary to the head of the government. There is a colourful description of Felix's birth in his obituary in the\nProceedings of the Royal Society:-\nWithout, the cannon thundered on the barricades raised by the insurgent Rhinelanders against their hated Prussian rulers. Within, although all had been prepared for flight, there was no thought of departure; on that night was born a son to the stern Prussian secretary. That son was Felix Klein.\nThe revolution against the Prussians, which resulted in such a dramatic birth for Felix Klein, was completely crushed by the summer of\n1849\n.\nKlein attended the\nGymnasium\nin Düsseldorf. After graduating, he entered the University of Bonn and studied mathematics and physics there during\n1865\n-\n1866\n. He started out on his career with the intention of becoming a physicist. While still studying at the University of Bonn, he was appointed to the post of laboratory assistant to\nPlücker\nin\n1866\n.\nPlücker\nheld a chair of mathematics and experimental physics at Bonn but, by the time Klein became his assistant,\nPlücker\n's interests had become very firmly rooted in geometry. Klein received his doctorate, which was supervised by\nPlücker\n, from the University of Bonn in\n1868\n, with a dissertation\nÜber die Transformation der allgemeinen Gleichung des zweiten Grades zwischen Linien-Koordinaten auf eine kanonische Form\nⓉ\n(\nOn the transformation of the general equation of the second degree between line-coordinates in a canonical form\n)\non line geometry and its applications to mechanics. In his dissertation Klein classified second degree line complexes using\nWeierstrass\n's theory of elementary divisors.\nHowever in the year Klein received his doctorate\nPlücker\ndied leaving his major work on the foundations of line geometry incomplete. Klein was the obvious person to complete the second part of\nPlücker\n's\nNeue Géometrie des Raumes\nⓉ\n(\nNew space geometry\n)\nand this work led him to become acquainted with\nClebsch\n.\nClebsch\nhad moved to Göttingen in\n1868\nand, during\n1869\n, Klein made visits to Berlin and Paris and Göttingen. In July\n1870\nKlein was in Paris when Bismarck, the Prussian chancellor, published a provocative message aimed at infuriating the French government. France declared war on Prussia on the\n19\nth\nof July and Klein felt he could no longer remain in Paris and returned. Then, for a short period, he did military service as a medical orderly before being appointed as a lecturer at Göttingen in early\n1871\n.\nKlein was appointed professor at Erlangen, in Bavaria in southern Germany, in\n1872\n. He was strongly supported by\nClebsch\n, who regarded him as likely to become the leading mathematician of his day, and so Klein held a chair from the remarkably early age of\n23\n. However Klein did not build a school at Erlangen where there were only a few students, so he was pleased to be offered a chair at the Technische Hochschule at Munich in\n1875\n. There he, and his colleague\nBrill\n, taught advanced courses to large numbers of excellent students and Klein's great talent at teaching was fully expressed. Among the students that Klein taught while at Munich were\nHurwitz\n,\nvon Dyck\n,\nRohn\n,\nRunge\n,\nPlanck\n,\nBianchi\nand\nRicci-Curbastro\n. Also in\n1875\nKlein married Anne Hegel, the granddaughter of the philosopher Georg Wilhelm Friedrich Hegel. Grace\nChisholm Young\nrecalls in\n[\n3\n]\n:-\n... the sunny days when the tall handsome young professor wooed and won the lovely granddaughter of the philosopher Hegel.\nAfter five years at the Technische Hochschule at Munich, Klein was appointed to a chair of geometry at Leipzig. There he had as colleagues a number of talented young lecturers, including\nvon Dyck\n,\nRohn\n,\nStudy\nand\nEngel\n. The years\n1880\nto\n1886\nthat Klein spent at Leipzig were in many ways to fundamentally change his life. As D E Rowe writes in\n[\n13\n]\n:-\nLeipzig seemed to be a superb outpost for building the kind of school he now had in mind: one that would draw heavily on the abundant riches offered by\nRiemann\n's geometric approach to function theory. But unforeseen events and his always delicate health conspired against this plan. ..\n[\nIn him were\n]\ntwo souls ... one longing for the tranquil scholar's life, the other for the active life of an editor, teacher, and scientific organiser. ... It was during the autumn of\n1882\nthat the first of these two worlds came crashing down upon him ... his health collapsed completely, and throughout the years\n1883\n-\n1884\nhe was plagued by depression.\nHis career as a research mathematician essentially over, Klein accepted a chair at the University of Göttingen in\n1886\n. He taught at Göttingen until he retired in\n1913\nbut he now sought to re-establish Göttingen as the foremost mathematics research centre in the world. His own role as the leader of a geometrical school at Leipzig was never transferred to Göttingen. At Göttingen he taught a wide variety of courses, mainly on the interface between mathematics and physics, such as mechanics and\npotential theory\n.\nKlein established a research centre at Göttingen which was to serve as a model for the best mathematical research centres throughout the world. He introduced weekly discussion meetings, a mathematical reading room with a mathematical library. Klein brought\nHilbert\nfrom Königsberg to join his research team at Göttingen in\n1895\n.\nThe fame of the journal\nMathematische Annalen\nis based on Klein's mathematical and management abilities. The journal was originally founded by\nClebsch\nbut only under Klein's management did it first rival, and then surpass in importance,\nCrelle\n's journal. In a sense these journals represented the rival teams of the Berlin school of mathematics who ran\nCrelle\n's journal and the followers of\nClebsch\nwho supported the\nMathematische Annalen\n. Klein set up a small team of editors who met regularly and made democratic decisions. The journal specialised in complex analysis,\nalgebraic geometry\nand\ninvariant theory\n. It also provided an important outlet for real analysis and the new area of group theory.\nKlein retired due to ill health in\n1913\n. However he continued to teach mathematics at his home during the years of World War I.\nIt is a little hard to understand the significance of Klein's contributions to geometry. This is not because it is strange to us today, quite the reverse, it has become so much a part of our present mathematical thinking that it is hard for us to realise the novelty of his results and also the fact that they were not universally accepted by all his contemporaries.\nKlein's first important mathematical discoveries were made in\n1870\nin collaboration with\nLie\n. They discovered the fundamental properties of the asymptotic lines on the\nKummer\nsurface. Further collaboration with\nLie\nfollowed and they worked on an investigation of\nW\n-curves, curves invariant under a group of projective transformations. In fact\nLie\nplayed an important role in Klein's development, introducing him to the group concept which played a major role in his later work. It is fair to add that\nCamille Jordan\nalso played a part in teaching Klein about groups.\nDuring his time at Göttingen in\n1871\nKlein made major discoveries regarding geometry. He published two papers\nOn the So-called Non-Euclidean Geometry\nin which he showed that it was possible to consider euclidean geometry and non-euclidean geometry as special cases a projective surface with a specific\nconic section\nadjoined. This had the remarkable corollary that non-euclidean geometry was consistent if and only if euclidean geometry was consistent. The fact that non-euclidean geometry was at the time still a controversial topic now vanished. Its status was put on an identical footing to euclidean geometry.\nCayley\nnever accepted Klein's ideas believing his arguments to be circular.\nKlein's synthesis of geometry as the study of the properties of a space that are invariant under a given group of transformations, known as the\nErlanger Programm\n(1872)\n, profoundly influenced mathematical development. This was written for the occasion of Klein's inaugural address when he was appointed professor at Erlangen in\n1872\nalthough it was not actually the speech he gave on that occasion. The Erlanger Programm gave a unified approach to geometry which is now the standard accepted view.\nTransformations play a major role in modern mathematics and Klein showed how the essential properties of a given geometry could be represented by the group of transformations that preserve those properties. In this way the Erlanger Programm defined geometry so that it included both Euclidean geometry and non-Euclidean geometry.\nHowever Klein himself saw his work on function theory as his major contribution to mathematics. As W Burau and B Schoenberg write in\n[\n1\n]\n:-\nKlein considered his work in function theory to be the summit of his work in mathematics. He owed some of his greatest successes to his development of\nRiemann\n's ideas and to the intimate alliance he forged between the later and the conception of invariant theory, of\nnumber theory\nand algebra, of group theory, and of multidimensional geometry and the theory of\ndifferential equations\n, especially in his own fields, elliptic modular functions and automorphic functions.\nBy considering the action of the modular group on the complex plane, Klein showed that the fundamental region is moved around to tessellate the plane. In\n1879\nhe looked at the action of\nP\nS\nL\n(\n2\n,\n7\n)\nPSL(2,7)\nP\nS\nL\n(\n2\n,\n7\n)\n, thought of as an image of the modular group, and obtained an explicit representation of a Riemann surface. He showed it had equation\nx\n3\ny\n+\ny\n3\nz\n+\nz\n3\nx\n=\n0\nx^{3}y + y^{3}z + z^{3}x = 0\nx\n3\ny\n+\ny\n3\nz\n+\nz\n3\nx\n=\n0\nas a curve in projective space and its group of symmetries was\nP\nS\nL\n(\n2\n,\n7\n)\nPSL(2,7)\nP\nS\nL\n(\n2\n,\n7\n)\nof order\n168\n. He wrote\nRiemanns Theorie der algebraischen Funktionen und ihre Integrals\nⓉ\n(\nRiemann's theory of algebraic functions and their integrals\n)\nin\n1882\nwhich treats function theory in a geometric way connecting potential theory and\nconformal mappings\n. He also used physical ideas in this work, especially those of fluid dynamics.\nKlein considered equations of degree greater than\n4\nand was particularly interested in using transcendental methods to solve the general equation of the fifth degree. After building on methods due to\nHermite\nand\nKronecker\n, producing similar results to\nBrioschi\n, he went on to completely solve the problem using the group of the\nicosahedron\n. This work led him to consider elliptic modular functions which he studied in a series of papers.\nHe developed a theory of automorphic functions, connecting algebraic and geometric results in his important\n1884\nbook on the icosahedron. However\nPoincaré\nbegan publishing an outline of his theory of automorphic functions in\n1881\nand, as explained in\n[\n13\n]\n, this led to a competition between the two:-\nKlein initiated a correspondence with\nPoincaré\n, and soon a friendly rivalry ensued as both sought to formulate and prove a grand uniformization theorem that would serve as a capstone to this theory. Working under great stress, Klein succeeded in formulating such a theorem and in sketching a strategy for proving it.\nHowever it was during this work that Klein's health collapsed as mentioned above. With\nRobert Fricke\nwho came to Leipzig in\n1884\n, Klein wrote a major four volume classic on automorphic and elliptic modular functions produced over the following\n20\nyears.\nWe should also mention the Klein bottle, a one-sided closed surface named after Klein. A Klein bottle cannot be constructed in Euclidean space. It is best pictured as a cylinder looped back through itself to join with its other end. However this is not a continuous surface in\n3\n-space as the surface cannot go through itself without a discontinuity. It is possible to construct a Klein bottle in non-Euclidean space.\nIn the\n1890\ns Klein became interested in mathematical physics, although throughout his career he showed he was never far from this area in attitude. Following from this interest, he wrote an important work on the gyroscope with\nA Sommerfeld\n.\nLater in his career Klein became interested in teaching at school level. W Burau and B Schoenberg write in\n[\n1\n]\n:-\nStarting in\n1900\nhe began to take a lively interest in mathematical instruction below university level while continuing to pursue his academic functions. An advocate of modernizing mathematics instruction in Germany, in\n1905\nhe played a decisive role in formulating the \"Meraner Lehrplanestwürfe\"\nⓉ\n(\nMerana teaching plan\n)\n. The essential change recommended was the introduction in secondary schools of the rudiments of differential and integral calculus and the function concept.\nKlein was elected chairman of the International Commission on Mathematical Instruction at the Rome International Mathematical Congress of\n1908\n. Under his guidance the German branch of the Commission published many volumes on the teaching of mathematics at all levels in Germany.\nAnother project he worked on around the turn of the century was the\nEncyklopädie der Mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of Mathematical Sciences\n)\n. He took an active part in this project, editing with K Müller the four volume section on mechanics.\nGrace Chisholm Young\nwrites in\n[\n3\n]\nof Klein's efforts on behalf of women in mathematics:-\nWhen in\n[1893]\nhe and others succeeded in opening the doors of the University of Göttingen to women, it was, I think, a real pleasure to him that the first woman to take the degree of D.Phil. should do so under his auspices, and should be a Girton girl who had sat at the feet of his revered friend\nCayley\n.\nKlein was elected a member of the\nRoyal Society\nin\n1885\nand received the Copley medal of the Society in\n1912\n. The\nLondon Mathematical Society\nawarded him their\nDe Morgan\nMedal in\n1893\n.\nChisholm Young\nwrites in\n[\n3\n]\n:-\n[\nHis mind\n]\nteemed with ideas and brilliant reflections, but it is true that his work lacks the stern aspects required by mathematical exactitude. It was in personal contact that this was corrected, at least in so far as his students were concerned. His favourite maxim was, \"Never be dull\".",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}