{
  "nome_completo": "Felix Bernstein",
  "nome_curto": "Felix Bernstein",
  "ano_nascimento": "1878",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernstein_Felix/",
  "lugar_nascimento": "Halle, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Felix Bernstein\ncame from a Jewish family of academics who strongly influenced the direction which his interests took. His father was Julius Bernstein\n(1839\n-\n1917)\nwho was a leading physiologist. Julius's father, Felix's grandfather, was Aron Bernstein\n(1812\n-\n1884)\n, a political writer, scientist, journalist, and publisher who, as a founder of the Berlin Congregation of Reform Judaism in\n1845\n, played a major role in synagogue reform in Germany\n[\n2\n]\n:-\nWhen\nAlbert Einstein\nwas a young man he was given one of Aron Bernstein's science books and became so fascinated that he gave up the idea of becoming a violinist in favour of science.\nAron supported Julius's interest in natural science, in particular physiology. Julius studied under Emil du Bois-Reymond\n(\nbrother of\nPaul du Bois-Reymond\n)\nand under\nHelmholtz\n. When Felix was born in\n1878\n, his father, Julius, held the Chair of Physiology at the Martin-Luther-Universität in Halle. He was also the Director of the Physiological Institute at the University of Halle. Felix's mother was a talented musician who played the piano and composed music. In fact Felix was named after the composer Felix Mendelssohn, as his mother hoped that her son would grow up to be a famous musician. Although Felix was extremely artistic, he did not inherit his mother's love of music.\nFelix Bernstein was brought up in Halle, attending the\ngymnasium\nthere. Julius, his father, was a friend of\nGeorg Cantor\nand while still a student at the gymnasium Felix attended\nCantor\n's seminar at the University of Halle. In\n1896\nCantor\ntook a holiday and Felix Bernstein offered to correct the proofs of\nCantor\n's famous work\nBeiträge zur Begründung der transfiniten Mengenlehre\nⓉ\n(\nContributions to the creation of transfinite set theory\n)\n. It was at this time that he came up with the\nSchröder\n-Bernstein Theorem which we discuss below. Bernstein had, as that stage, no intention of becoming a mathematician and he went to Pisa where he studied philosophy, archaeology and art history. Two mathematicians who had heard\nCantor\nheap praise on Bernstein for the\nSchröder\n-Bernstein Theorem, persuaded the student of fine arts at Pisa to become a mathematician. After his studies at Pisa, he then undertook research under\nHilbert\nand\nKlein\nat Göttingen where he wrote the dissertation\nUntersuchungen aus der Mengenlehre\nⓉ\n(\nStudies in set theory\n)\non set theory. For this dissertation he was awarded a doctorate by the Georg-August-Universität Göttingen in\n1901\n[\n2\n]\n:-\nHe retained his interest in art, though, spent many hours in museums and galleries, and entertained his family and friends by constructing statues of modelling clay.\nHe returned to Halle in\n1901\nwhere he taught mathematics. However he now broadened his interests by studying physiology under his father at the Physiological Institute until his father retired in\n1911\n. Felix submitted his\nhabilitation\nto the University of Göttingen and he was appointed extraordinary professor there in\n1911\n. Some time after this he became a friend of\nEinstein\n.\nWorld War I began in\n1914\nbut Bernstein received medical exemption from military service. However he still had to contribute to the war effort and he was made head of the statistical branch of the Office of Rationing in Berlin. The war ended in\n1918\nbut Bernstein continued to hold government roles becoming Commissioner of Finance in\n1921\n. Also in\n1921\nhe was elected ordinary professor\n(\nfull professor\n)\nat Göttingen and he founded the Institute of Mathematical Statistics there. In\n1928\nBernstein spent time at Harvard in the United States as a visiting professor. There he worked on epidemiology, returning to the United States over the next few years to take up other visiting professorships.\nOn\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany. Hitler, as Chancellor of Germany, immediately announced legal action against Germany's Jews. On\n7\nApril\n1933\nthe Nazis introduced a law for the \"Restoration of the civil service\". This meant that all non-Aryans and Jewish civil servants were dismissed from their positions with the exception of those who either had fought in the Great War or had been in office since August\n1914\n. The exemptions should have meant that Bernstein was unaffected but, like almost all Jewish academics, he was deprived of his chair in\n1934\n. Bernstein then managed to emigrate with his family to the United States, since the anthropologist Franz Boas had obtained funds to support him for a year at Columbia University and had the agreement of the university that they would offer him a permanent position at the end of the year. The university reneged on the agreement to offer him a permanent post, however, which led later to a comment from\nR A Fisher\n:-\nBut Bernstein, why did you not come to England. In England, a handshake from a gentlemen is as good as a signed contract.\nHe taught for the rest of his career at a number of universities in the United States, including Columbia, New York, Syracuse and the Triple Cities College, now part of SUNY-Binghamton. He also spent the year\n1945\n-\n46\nunable to gain employment. In\n[\n4\n]\nJames R F Kent describes Bernstein's last two years in the United States at Triple Cities College:-\n[\nBernstein\n]\nwas a pretty old fellow, nice old guy but he was sick and he wasn't able to stay more than a couple of years. When I came he was already in the hospital and so we had to have a substitute take his courses over. ... We had a lot of very nice talks and I was really quite honoured to be the head of his department, and he seemed to appreciate my cooperation with his troubles and the fact that he had to teach only undergraduate low level mathematics courses. There was no graduate program in those days at all and poor old Felix Bernstein had to teach college algebra; the highest course he taught I guess was first and second year calculus, nothing further.\nSince he moved around between universities, Bernstein's scientific output was, as one might expect, greatly reduced after\n1934\n. He did spend a large amount of his time on social causes when in the United States and on these issues he collaborated with his long time friend\nEinstein\n. He also put a huge effort into trying to find positions for other European scientists who had been forced to flee from Europe to the United States due to Nazi policies. He was aware, however, that his efforts might have consequences that he strongly wished to avoid so he asked that his name should not publicised as he feared his relations who were still in Germany might suffer. By\n1948\nBernstein was\n70\nyears old and he retired from teaching in the United States returning to Göttingen where he was appointed professor emeritus. He also spent time in Rome and Freiburg during these year in retirement. Nathan writes in\n[\n1\n]\n:-\nHis interests in the sciences and arts, especially sculpture and architecture, were intense and wide. His health never seems to have been robust.\nToday Bernstein is best remembered by mathematicians for the\nSchröder\n-Bernstein Theorem. This theorem states:-\nIf each of two sets A and B are equivalent to a subset of the other, then A is equivalent to B.\nThis is a vital result in the study of cardinal numbers, indeed a vital result in the development of set theory. When\nCantor\nsaw Bernstein's proof he was so impressed that he communicated it to\nÉmile Borel\nand it was published in\nBorel\n's\nLecons sur la théorie des fonctions\nin\n1898\n. We mentioned above that the result is known as the\nSchröder\n-Bernstein Theorem.\nErnst Schröder\nindependently published a proof in\n1898\nbut\nSchröder\n's proof was later shown to contain an error although the basic idea can be corrected to give a proof. In fact the theorem was stated by\nCantor\nin\nBeiträge zur Begründung der transfiniten Mengenlehre\nⓉ\n(\nContributions to the creation of transfinite set theory\n)\nbut his justification of the result there is not a rigorous proof\n(\nas he himself was aware\n)\nand, as we explained above, it was while correcting the proofs of this work that Bernstein, still a high school student, constructed a correct proof. In\n1905\nBernstein published another important article on transfinite ordinal numbers\nÜber die Reihe der Transfiniten Ordnungszahlen\nⓉ\n(\nOn the series of transfinite ordinal numbers\n)\nwhich appeared in\nMathematische Annalen\n.\nDespite this highly significant result in the foundations of pure mathematics, most of Bernstein's activity was in applied mathematics, particularly in statistics, actuarial mathematics and mathematical biology. His range of interests were remarkable and he worked on convex functions, isoperimetric problems, the\nLaplace\ntransform, number theory\n(\nincluding\nFermat\n's Last Theorem\n)\n, differential equations and the mathematical theory of genetics. In\n[\n2\n]\na listing of Bernstein's publications covers four pages and contains one hundred and twenty-eight items including papers on\n[\n2\n]\n:-\n... economics, anthropology, tuberculosis therapy, human life span, assessing aging from eye lens refraction, polio, age and cancer, and, of course, genetics.\nIt would certainly be fair to say that, outside the world of mathematics, Bernstein is best known for his work on human blood groups and inheritance so we should end this biography by looking briefly at these important contributions.\nKarl Landsteiner, an Austrian scientist, described three human blood groups A, B, and O in\n1900\n. Two years later the AB group was discovered by Decastrello and Sturli. In\n1910\nLudwik Hirszfeld and E von Dungern were the first to argue that blood groups were inherited\n[\n2\n]\n:-\nStudying\n72\nfamilies with\n102\nchildren, they hypothesized that the A and B antigens were produced by two independent dominant alleles.\nHowever, it was not until Berstein's two papers\nErgebnisse einer biostatistischen zusammenfassenden Betrachtung über die erblichen Blutstructuren des Menschen\nⓉ\n(\nResults of a biostatistical summary consideration of human hereditary blood structures\n)\n(1924)\nand\nZusammenfassende Betrachtungen über die erblichen Blutstructuren des Menschen\nⓉ\n(\nSummary of observations on human hereditary blood structures\n)\n(1925)\nthat the correct hereditary mechanism was proposed\n[\n2\n]\n:-\nThe correct hypothesis of multiple alleles at one locus was not demonstrated until Bernstein did so in\n1924\nand\n1925\n.\nCrow asks:-\nWhy was the earlier incorrect hypothesis so widely accepted from\n1910\nto\n1924\n?\nThe reason seems to relate to errors in the data being used, partly due to misprints in the published data, but also, perhaps not surprisingly, due to the fact that a child's biological father may not be the husband of the child's mother\n(\noften unknown to the husband\n)\n.",
  "math_areas": [
    "Applied Mathematics",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}