{
  "nome_completo": "Filadelfo Insolera",
  "nome_curto": "Filadelfo Insolera",
  "ano_nascimento": "1880",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Insolera/",
  "lugar_nascimento": "Lentini, near Syracuse, Sicily",
  "lugar_morte": "Milan, Italy",
  "biografia": "Filadelfo Insolera\n's parents were Rosario\nInsolera, a well-known tailor in Lentini, and Carmela Greco; Filadelfo was the eldest of his parents five boys. The name Filadelfo is, in fact, quite typical of the region where he was born. He attended elementary school in Lentini and showed such promise, particularly in mathematics, that his parents moved to Catania, Sicily, so that Filadelfo could spend time attending a school specialising in science and technology. His work was excellent and he graduated with outstanding results. He then went to the University of Rome where he studied for a degree in mathematics.\nInsolera was awarded his first degree by the University of Rome in\n1902\n. Following this, he won a scholarship to enable him to continue undertaking research at the University of Rome, where he was supervised by\nGuido Castelnuovo\n, who held the Chair of Analytic and Projective Geometry, and\nVito Volterra\nwho held the Chair of Mathematical Physics. Throughout his life, Insolera was full of admiration for his two teachers. The first appointment of his scientific career was at the University of Rome as an assistant to Tullio Bagni, an expert in actuarial science, and through him Insolera became interested in the subject which from that time on became the main focus of his academic interests. Bagni\n(19\nJanuary\n1869\n-\n8\nAugust\n1932)\nwas for fifteen years professor of actuarial mathematics and mathematics of finance at R. Istituto Superiore di Studi Commerciale, Coloniale ed Attuariali, in Rome. Insolera, guided by Bagni, quickly distinguished himself in actuarial science and he was appointed Head of the Actuarial Department in the National Institute of Social Security. In\n1914\nhe entered a competition for the chair of financial mathematics which had just been established at the Higher Institute for Economic and Commercial Science in Turin. He was appointed to the chair which he continued to hold for the rest of his career. He served as director of the Institute from\n1927\nto\n1929\n.\nOne of the students that Insolera taught at the Institute in Turin was Maria Luisa Mazzetta. They fell in love and were married in\n1920\n. Filadelfo and Maria had three children: Delfino who graduated in engineering and philosophy; Melina who after graduating in humanities taught in high schools; and Italo who became an architect and urban planner being appointed to chairs at the Universities of Venice and Geneva. A year before he married, in\n1919\n, Insolera collaborated with his colleague Salvatore Ortu-Carboni in setting up the\nGiornale di Matematica Finanziaria\n[\n7\n]\n:-\nThe editors plan that the periodical shall contain not only purely scientific studies with special reference to mathematics of finance\n(\ncredit, insurance, statistics, etc.\n)\n, but also reviews pf books and periodicals, as well as of laws, decrees and regulations.\nInsolera published most of his work in the\nGiornale di Matematica Finanziaria\nfrom that time onwards. In fact volume\n14\n, published in\n1932\n, contains his obituary of Tullio Bagni, who had such a significant influence on the direction of his career. It was in\n1932\nthat Insolera moved to Rome with his family, spending two years working at the Ministry there. He returned to his chair in Turin and continued to hold that position until he retired in\n1950\n.\nInsolera published an impressive\n105\nworks, nearly all in the\nGiornale di Matematica Finanziaria\n. We name a few to gave a flavour of the topics he worked on:\nLezioni di Statistica Metodologica\nⓉ\n(\nLessons of methodological statistics\n)\n;\nSulle curve di frequenza\nⓉ\n(\nOn frequency curves\n)\n;\nSulla perequazione mediante curve unimodali semplici\nⓉ\n(\nOn equalization by simple unimodal curves\n)\n;\nMetodi di studio per una riforma delle pensioni civili e militari\nⓉ\n(\nMethods of study for a reform of the civil and military pensions\n)\n;\nSulla geometria delle operazioni di borsa\nⓉ\n(\nOn the geometry of stock market transactions\n)\n;\nComplementi di matematica generale\nⓉ\n(\nGeneral mathematical supplements\n)\n;\nI nuovi fondamenti scientifici delle tavole di mortalità e prime applicazioni biometriche e attuariali\nⓉ\n(\nA new scientific basis for mortality tables and the first biometric and actuarial applications\n)\n;\nSulle assicurazioni sociali\nⓉ\n(\nOn social security\n)\n;\nLa perequazione col metodo dei momenti\nⓉ\n(\nEqualization by the method of moments\n)\n; and\nSull'età estrema\nⓉ\n(\nOn extreme age\n)\n.\nHowever his books require a special mention:\nLezioni di Statistica Metodologica\nⓉ\n(\nLessons of methodological statistics\n)\n(1921)\n;\nCorso di Matematica Finanziaria\nⓉ\n(\nFinancial mathematics course\n)\n(1923)\n;\nComplementi di Matematiche Generali\nⓉ\n(\nGeneral mathematical supplements\n)\n(1924)\n; and\nTrattato di Scienza Attuariale\nⓉ\n(\nTreatise on actuarial science\n)\nconsisting of three volumes\nTeorica della Sopravvivenza\nⓉ\n(\nTheory of survival\n)\n(1947)\n,\nTeorica della Capitalizzazione\nⓉ\n(\nTheoretical capitalization\n)\n(1949)\nand\nTeorica dell'Ammortamento\nⓉ\n(\nTheoretical amortization\n)\n(1950)\n. Reviewing the first of these, Rietz writes\n[\n5\n]\n:-\nThis small volume deals with a large variety of topics, including approximate computation, averages, measures of dispersion, permutations, combinations,\nprobability\n, binomial distribution of frequency, interpolation by the formulas of\nNewton\nand\nLagrange\n, graduation of data, least squares, moments, correlation and contingency. The book gives brief elementary expositions of these topics, and will probably serve well its purpose as a means of preparation for certain examinations.\nThe review\n[\n6\n]\nof\nComplementi di Matematiche Generali\nⓉ\n(\nGeneral mathematical supplements\n)\nexplains that the material started life as a lecture course given by Insolera at the Higher Institute for Economic and Commercial Science in Turin, complementing a course on the mathematics of finance. Feeling that other students who study applications of mathematics may, like his students, not have a secure mathematical background, Insolera revised his lecture notes and produced the book\n[\n6\n]\n:-\nWith this practical aim in view, the field covered is wide, and so the treatment necessarily somewhat superficial. ... the choice\n[\nof material\n]\nseems a good one. The treatment is clear and accurate, but in such rapid progress from one subject to another, most students would need more exercises to get a firm hold of the processes covered.\nThe first of the three volumes of\nTrattato di Scienza Attuariale\nⓉ\n(\nTreatise on actuarial science\n)\n, namely\nTeorica della Sopravvivenza\nⓉ\n(\nTheory of survival\n)\nis in fact an extended version of his earlier work\nCorso di Matematica Finanziaria\nⓉ\n(\nFinancial mathematics course\n)\n. Although this was published in\n1947\n, Insolera completed the work several years earlier while suffering extraordinary difficulties due to World War II.\nEugene Lukacs\nreviewing\nTeorica dell'Ammortamento\nⓉ\n(\nTheoretical amortization\n)\n(1950)\n, which is the final volume of the\nCorso\n, writes:-\nThe book as a whole reflects strongly the author's personal preferences and interests. Superficially this is already shown by the fact that\n83\nreferences are given to the author's own work, while very few other authors are mentioned more than\n6\ntimes. This is not intended to be a criticism but should help to explain why so much emphasis is placed on certain topics while others are treated very briefly. The book is pervaded by the spirit of presenting everything in the greatest possible generality. Thus great emphasis is placed on the general theory of capitalization; instead of a fixed rate of interest a function of capitalization is introduced at an early stage and a rather general mathematics of finance is constructed. While this general theory is presented in great detail some important parts of actuarial mathematics are treated very briefly.\nIt is interesting to compare the rather different reception that Insolera's work received in different countries. Perhaps it received its greatest praise in France as the following review of\nTeorica della Capitalizzazione\n, the second volume of the\nCorso\n, testifies\n[\n8\n]\n:-\nActuarial studies seem to receive very little attention from French economists - with rare exceptions. They are, on the contrary, in full development in the Nordic and Italian universities. The book by Filadelfo Insolera is an integral part of his Treatise on actuarial science, excellently written and very useful for financial experts, demographers and academics. He has created a real general theory of capitalization: concepts, accounting, techniques and operations of capitalization, and financial techniques, in the first part. The second part, which is aimed specifically at practitioners of actuarial science, develops a theory of demographic-financial capitalization. On a high mathematical level - which is the evident sign of all actuarial analysis - Insolera's theory takes us away from some dry constructions; it is enriched and embellished with a permanent sociological contribution.\nInsolera died while making a visit to Milan where he was presiding over a committee for the qualifying examination of the Technical Institute S. Carlo.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}