{
  "nome_completo": "Filippo Brunelleschi",
  "nome_curto": "Filippo Brunelleschi",
  "ano_nascimento": "1377",
  "ano_morte": "1446",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brunelleschi/",
  "lugar_nascimento": "Florence (now Italy)",
  "lugar_morte": "Florence (now Italy)",
  "biografia": "Filippo Brunelleschi\n's father was Brunellesco Di Lippo who was a notary, that is a public official, in Florence while Filippo's mother was Giuliana Spini who was related to both the Spini and Aldobrandini families. Brunellesco and Giuliana had three sons, Filippo having one older and one younger brother. Certainly Brunellesco would have liked Filippo to have studied law with the aim of becoming a notary like himself but he was attracted to an artistic career and determined to follow that route.\nBrunelleschi trained as a goldsmith and sculptor in a workshop in Florence, beginning his apprenticeship in\n1392\n. An important influence on him at this time was Paolo dal Pozzo Toscanelli who was a merchant and medical doctor. Toscanelli's interest in science and mathematics was particularly significant for he taught his young pupil the principles of geometry. He also brought out Brunelleschi's interest in technology which he would put to good use later in his career.\nWhile teaching at the Arte della Seta in\n1401\nBrunelleschi entered a competition proposed by the Lord of Florence to design the bronze doors of the Florence Baptistery. His panel:-\n... of Abraham sacrificing Isaac showed a servant who, as he waits for Abraham and while the ass is grazing, is drawing a thorn from his foot.\nBrunelleschi was one of seven artists who entered the competition but despite the high quality of his work he did not win. His panel was rated equal to that of Lorenzo Ghiberti, but Ghiberti was given charge of the commission with Brunelleschi proposed as his assistant. This however did not suit Brunelleschi and he withdrew\n(\naccording to Vasari\n[\n13\n]\n)\n:-\n... desiring to be the first in some other art, than merely an equal, and perhaps secondary in that undertaking.\nThe magnificent panels produced by both Ghiberti and Brunelleschi can still be seen in the Bargello Museum housed in the Palazzo del Bargello in Florence.\nA picture of Brunelleschi's panel\nis at\nTHIS LINK\nThis was a turning point for Brunelleschi who, after this setback, turned towards architecture. An important influence on him at this time was his friend Donatello\n(1386\n-\n1466)\nwho was a superb artist. An interesting episode is recounted by Vasari\n[\n13\n]\n:-\nDonatello made a wooden crucifix which was placed in Santa Croce\n[\nand\n]\nhe was anxious to hear Filippo's opinion of it; but Filippo told him that he had shown a peasant hanging on the cross. This provoked Donatello to retort: \"Get some wood and do it yourself\"... Filippo kept quiet for a few months while he worked on a wooden crucifix of the same size ...\nA picture of Brunelleschi's crucifix\nis at\nTHIS LINK\n.\nTogether they spent several years in Rome, Brunelleschi\n[\n16\n]\n:-\n... immersing himself in a study of antiquity, and paying special attention to the triumphs of Roman engineering. He made drawings of a great many ancient buildings, including baths, basilicas, amphitheatres, and temples, particularly studying the construction of architectural elements, such as vaults and cupolas. The object of his architectural researches, however, was not to learn to reproduce Roman architecture, but to enrich the architecture of his own time and to perfect his engineering skills.\nBrunelleschi's most important achievement in mathematics came around\n1415\nwhen he rediscovered the principles of linear perspective using mirrors. He understood that there should be a single vanishing point to which all parallel lines in a plane, other than the plane of the canvas, converge. Also important was his understanding of scale, and he correctly computed the relation between the actual length of an object and its length in the picture depending on its distance behind the plane of the canvas. Using these mathematical principles, he drew various scenes of Florence with correct perspective. These perspective drawings by Brunelleschi have since been lost but a \"Trinity\" fresco by Masaccio still exists which uses Brunelleschi's mathematical principles.\nA picture of Masaccio's Holy Trinity\nis at\nTHIS LINK\n.\nThe authors of\n[\n17\n]\nmade measurements of the fresco, painted by Masaccio in\n1425\n, which hangs in Santa Maria Novella, Florence. They discovered its underlying principles:-\nMeasurements were made directly from the fresco, using scaffolding. We found the centric point of the perspective scheme, and ... calculated the ideal viewing distance of the picture to be about the width of the aisle of the church. ... The nature of the mathematical techniques that we found to have been employed tends to confirm the conventional view that Brunelleschi made some contribution to the picture, and, further, leads us to suggest that Brunelleschi's discovery in regard to perspective may have been the existence and properties of the centric point.\nFrom about\n1409\nonwards Brunelleschi became interested in the partially completed Duomo Santa Maria del Fiore, the Cathedral in Florence. Work on the cathedral had begun under Arnolfio di Cambio in\n1296\nand proceeded very slowly. One of the architects to work on the Cathedral was the famous painter Giotto, who worked on the campanile from\n1334\nuntil his death in\n1337\n. The vault of the naves was completed in\n1378\nand that over the aisles two years later. When Brunelleschi became interested in the project the main problem facing the architects was the construction of the dome. Huge engineering problems faced the placing of a dome on the octagonal Baptistry, and much argument had taken place on how to solve this and Brunelleschi set to work on finding an innovative solution.\nFrom his youth Brunelleschi had been interested in mechanical devices, in particular clocks, wheels, gears and weights. He now combined his artistic skills, his mathematical skills, and his understanding of mechanical devices when he made a proposal to the wardens of works of the cathedral when they set up a competition in\n1418\nto find the best solution to the problem of designing and constructing the dome. Brunelleschi proposed a double self-supporting shell and a rib structure to support the enormous weight. He proposed brick as a building material, laid in rotating herringbone patterns. His method of construction included ways of lifting construction materials into position, avoided the use of scaffolding but included the use of machines which he had designed specially for the purpose.\nA sketch of the construction platform\nis at\nTHIS LINK\n.\nThe competition to be awarded the commission was tough and Brunelleschi again had to compete against Ghiberti. In\n1420\nBrunelleschi was awarded the commission and construction began. Using techniques reminiscent of\nArchimedes\n(\naccording to Vasari\n[\n13\n]\n)\n:-\n... by using counterweights and wheels for lifting he made it possible for a single ox to raise a load so heavy that previously it would hardly have been possible for six pairs of oxen to move it.\nBrunelleschi's sketches of his machines\nare at\nTHIS LINK\n.\nIt was still a lengthy construction process, but by the time Brunelleschi died in\n1446\nthe dome was almost completely finished. The only missing part was the huge lantern that he had designed to hang from the centre of the dome. The lantern was not only for decorative purposes but was also part of the way that the structure supported itself. It was built following Brunelleschi's specifications after his death.\nPictures of the cathedral are at\nTHIS LINK\n, pictures of the cupola are at\nTHIS LINK\nand a  picture of the inside the cathedral dome is at\nTHIS LINK\n.\nAlthough the Duomo Santa Maria del Fiore was the most famous of Brunelleschi's architectural achievements, there are many other examples of his stunning architecture in Florence. One of the first of these was the Church of San Lorenzo.\nPictures of San Lorenzo\nare at\nTHIS LINK\n.\nPlans for the church already existed in\n1419\nwhen Brunelleschi was employed by Cosimo de' Medici to build the sacristy but within a year Brunelleschi was given the commission to redesign and build the whole Church. This he began and by\n1428\n, when construction was halted, the sacristy and choir chapel were completed. The style was mathematical in its use of columns in straight lines, and flat planes. The proportions were worked out in great detail and he used his new understanding of perspective particularly in proportioning of the interior. The church was completed after Brunelleschi's death, one of his pupils taking over the work on the nave and dome.\nAnother famous work by Brunelleschi was the Pazzi Chapel. He was commissioned to undertake this work by Andrea de' Pazzi around\n1428\nwho wanted him to design a building to act both as a chapter house to the monastic Church of Santa Croce and also as a monument to the Pazzi. Construction only began two years before Brunelleschi's death, but his design is again remarkable\n[\n1\n]\n:-\nBrunelleschi used mathematical modules and geometric formulas for the plan and elevation of the Pazzi Chapel, as he had in San Lorenzo, but he arranged the space in a more complex and sophisticated manner in the later building. A hemispherical dome covers a central square, which is extended on either side so that the square forms the centre of a rectangle. The minor spatial compartment, opening off a third side of the main square, is a corresponding square apse covered by a dome and containing the altar. The creamy wall surface of the Pazzi Chapel is marked off in geometric patterns by dark grey stone.\nPictures of the Pazzi chapel\nare at\nTHIS LINK\n.\nOther buildings, or parts of buildings, in Florence were designed by Brunelleschi, for example the loggia of the Ospedale degli Innocenti, the central-plan church of Santa Maria degli Angeli, which was never completed, and the Church of Santo Spirito which was completed after his death.\nA picture of\nOspedale degli Innocenti\nis at\nTHIS LINK\n, a picture of\nSanta Maria degli Angeli\nis at\nTHIS LINK\nand pictures of\nSanto Spirito\nare at\nTHIS LINK\n.\nBrunelleschi has yet more claims to fame. In\n1421\nhe became the first person to acquire an industrial patent. It gave him a three-year monopoly on the manufacture of a barge with hoisting gear which was used to carry marble from the Carrara quarries to the gates of Florence, sailing upstream on the Arno. Finally we should mention the fact, in the tradition of ancient Greek architects, that he made stage sets for shows and festivals.\nHe was buried in the Cathedral of Santa Maria del Fiore but it was only in\n1972\nthat his tomb was discovered having been lost for hundreds of years.",
  "math_areas": []
}