{
  "nome_completo": "Erwin Finlay Freundlich",
  "nome_curto": "Finlay Freundlich",
  "ano_nascimento": "1885",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Freundlich/",
  "lugar_nascimento": "Biebrich, Germany",
  "lugar_morte": "Wiesbaden, Germany",
  "biografia": "Finlay Freundlich\n's father was E Philip Freundlich and his mother was Ellen Elizabeth Finlayson. Philip Freundlich was a German businessman but his wife Ellen was British. Perhaps it is worth explaining that Finlay Freundlich only called himself \"Finlay\" after he came to live in Scotland\n(\nthis being a Scottish name\n)\n; he was known as Erwin Freundlich for the first fifty years of his life.\nFinlay Freundlich was one of a family of seven children, five boys and two girls. He attended primary school in his home town of Biebrich, as did his brothers, and then he went to secondary school in the nearby large town of Wiesbaden where he attended Dilthey school. At eighteen years of age, in\n1903\n, Freundlich completed his school education and went to work in the dockyards in Stettin. His aim at this stage was not related to mathematics or astronomy for he aimed to make a career in naval studies. He entered the Technische Hochschule of Charlottenburg and began a course of study in naval architecture but he had a health problem which forced him to take a break in his studies. The health problem was a heart condition and, when he had recovered, Freundlich decided not to continue his course on naval architecture but rather to enter the University of Göttingen to study mathematics, physics and astronomy.\nAt Göttingen, Freundlich was a student of\nKlein\n. He spent the winter semester of\n1905\n-\n06\nat the Leipzig University but spent the rest of his university studies at Göttingen. This meant that he moved rather less around different universities than was the custom in Germany at this time, but the fact that he had changed course from naval architecture to mathematics, physics and astronomy almost certainly was a factor in this. Freundlich was awarded a doctorate by the University of Göttingen for a thesis on analytic function theory in\n1910\n.\nKlein\nsuggested to Freundlich that he might wish to apply for a post as an assistant at the Royal Observatory in Berlin and his appointment was confirmed on\n1\nJuly\n1910\n. At this time\nEinstein\nwas working on the general theory of relativity and, although he did not have the details of the theory worked out, he was beginning to understand some of its consequences. Already there was evidence that the orbit of Mercury did not fit that predicted by\nNewton\n's theory of gravitation and in\n1911\nEinstein\nasked Freundlich to make accurate observations of Mercury's orbit. Freundlich worked with\nEinstein\nin\n1911\nattempting to make the measurements of Mercury's orbit required to confirm the general theory of relativity. He confirmed it in a paper of\n1913\nbut Freundlich had to go against the wishes of the Director of the Berlin Observatory who strongly advised him against publishing such a revolutionary idea. It is important to realise how daring this publication by Freundlich was, for it claimed that\nNewton\n's theory of gravitation, so long held as one of the greatest achievements of the human mind, was wrong.\nEinstein\nsaid\n(\nsee for example\n[\n2\n]\n)\nthat Freundlich was:-\n... the first among fellow-scientists who has taken pains to put the theory to the test.\nFreundlich married Käte Hirschberg in\n1913\n. She was Jewish while Freundlich was not a practising Jew\n(\nthough he had a Jewish grandmother\n)\n, so the wedding was a civil one taking place in Herder House in Weimar. The observatory in Berlin moved to a new site at Neubabelsberg and a house was built for Freundlich and his wife close to the new observatory.\nFreundlich was interested in measuring the deflection in a light ray passing close to the sun since again\nEinstein\n's incomplete theory of relativity suggested that this test could be used to check the validity of the theory and show that\nNewton\n's theory was incorrect. The only way to make such measurements at this time was during an eclipse and Freundlich wanted to journey to somewhere within the path of totality of the eclipse which would happen in\n1914\n. Such expeditions cost considerable amounts of money but Freundlich had the good fortune of being introduced to Gustav Krupp von Bohlen und Halbach by a friend. Gustav von Bohlen und Halbach was a German diplomat who had married the heiress Bertha Krupp of the Krupp family of industrialists and had taken over the family firm. He was impressed by Freundlich and, having considerable funds at his disposal, offered to finance an expedition to Feodosiya in the Crimea. Freundlich's good fortune came to an end, however, for World War I broke out before the time for the eclipse and the expedition was abandoned. Freundlich was interned for a while before being able to return to Berlin.\nHe made other tests of general relativity based on gravitational redshift but these were inconclusive. He wrote his first book in\n1916\nfollowing\nEinstein\n's publication of the general theory of relativity. Freundlich's book\nGrundlagen der Einsteinschen Gravitationstheorie\nⓉ\n(\nFundamentals of Einstein's theory of gravitation\n)\ndiscussed the ways that the general theory of relativity could be tested by astronomical observations. In\n1918\nFreundlich resigned his post in Berlin to work full time with\nEinstein\n. Forbes writes in\n[\n1\n]\n:-\nHe always modestly regarded himself as less of a collaborator with\nEinstein\nthan as a butt for the latter's highly original ideas. His occasional inability to comprehend these ideas had the salutary effect of making\nEinstein\nseek to simplify their mathematical formulation, for if one of\nFelix Klein\n's pupils could not make sense of his equations who could? Through his intimate contact with\nEinstein\n, Freundlich was the first to become thoroughly acquainted with the fundamental principles of the new gravitational theory and, as\nEinstein\nhimself remarks in the foreword of Freundlich's book, he was particularly well qualified as its exponent because he had been the first to attempt to put it to the test.\nIn\n1920\nthe\nEinstein\nInstitute was created as the Astrophysical Observatory in Potsdam and Freundlich was appointed as observer there in\n1921\n. He was later promoted to chief observer and professor of astrophysics. During this period Freundlich planned three further expeditions to observe an eclipse and measure the deflection of light passing close to the sun. Those of\n1922\nand\n1923\nfailed because the weather did not permit observations to be made. However, one to Sumatra in\n1929\nwas completely successful but the value which Freundlich found for the deflection of light was more than that predicted by\nEinstein\n's theory.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent were to be retired. Having one grandparent of the Jewish religion made someone non-Aryan, so this affected Freundlich. He resigned from his position in Potsdam and emigrated to Turkey. It would have been impossible for him to continue in Germany since his wife was Jewish and in addition his wife's sister had died early in\n1933\nand Freundlich and his wife had become the guardians of his sister-in-law's two young children Hans and Renate\n(\nwho of course were also Jewish\n)\n.\nIn Istanbul Freundlich helped create a modern observatory. He returned to Europe in\n1937\nwhen he was appointed professor of astronomy at the Charles University of Prague. However, he was forced out again by Hitler's policies in\n1939\nand escaped to Holland. While there he received an offer from the University of St Andrews to set up a department of astronomy at the university.\nEddington\nhad advised the Principal of the University of St Andrews that Freundlich was an outstanding person to both create the department of astronomy and to organise the construction of an observatory.\nIn St Andrews Freundlich fitted in easily. An outstanding scientist, he commanded great respect for both his abilities and also for his exceptional personal qualities. His wife, however, found fitting in to the Scottish way of life somewhat harder than her husband.\nWalter Ledermann\n, who was a young lecturer in mathematics at St Andrews when Freundlich arrived, writes\n[\n5\n]\n:-\n... Freundlich was very close to me. He was a fatherly friend of whom I have many fond memories ... During the war Freundlich and I taught navigation at the Initial Training Wing of the RAF which was stationed in St Andrews. We also published a joint paper in the Monthly Notices of the\nRoyal Astronomical Society\nin\n1944\n... . We had other interests in common apart from mathematics: Freundlich was a keen cellist, and we frequently played chamber music where I played the violin or viola. Once we went on holiday together to the West coast of Scotland, when Mrs Freundlich was unable to come. ... he was a tall impressive man, and when we walked side by side through the streets of St Andrews people would say: \"Here come the Sun and Moon\".\nFreundlich became the\nNapier\nProfessor of Astronomy in St Andrews on\n1\nJanuary\n1951\n, a post he held until\n1955\nwhen the university regulations forced him to retire. However, he was kept on as Director of the Observatory and as a temporary assistant lecturer at his professorial salary for a further two years. He delivered his inaugural lecture in\n1952\nand the text of that lecture is given in\n[\n3\n]\n. In\n1953\nhe suffered a heart attack but made a good recovery. During his years in St Andrews, as well as supervising the work of constructing a thirty-seven-inch Schmidt-Cassegrain telescope, he wrote another important text\nCelestial mechanics\n(1958)\n[\n2\n]\n:-\nIn St Andrews, especially, Freundlich brought together an active and varied group of research workers. He was very much \"Herr Professor\" with a deep awareness of the significance of the tremendous scientific developments in which he had taken some share over his long life. St Andrews took pride in ranking him among its characters - and St Andrews has exacting standards.\nIn\n1957\nFreundlich left for Wiesbaden where he was appointed honorary professor at the University of Mainz. He returned to St Andrews frequently to supervise work on the telescope. However, on the appointment of his successor in\n1959\nhe had a rather unhappy time. Forbes writes\n[\n1\n]\n:-\nThe closing years of Freundlich's life were marred by incidents arising out of the reluctance of his successor, D W N Stibbs, to grant him open access to the St Andrews observatory in order to witness the final stages of the work on the thirty-seven-inch Schmidt-Cassegrain telescope. The tensions that thus arose occasioned, inter alia, the resignation of his highly skilled technician Robert L Waland, before the optical components were satisfactorily completed and adjusted, and partly explain why that instrument has never yielded the results of which it might otherwise have been capable.\nIn fact improvements to the telescope were made by van Breda and others after Freundlich left St Andrews.  By\n1971\nthe telescope was capable of producing much improved results and it is still being used today.",
  "math_areas": [
    "Analysis"
  ]
}