{
  "nome_completo": "Florence Nightingale",
  "nome_curto": "Florence Nightingale",
  "ano_nascimento": "1820",
  "ano_morte": "1910",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nightingale/",
  "lugar_nascimento": "Florence (now Italy)",
  "lugar_morte": "East Wellow, England",
  "biografia": "Florence Nightingale\nis best remembered for her work as a nurse during the Crimean War and her contribution towards the reform of the sanitary conditions in military field hospitals. However, what is less well known about this amazing woman is her love of mathematics, especially statistics, and how this love played an important part in her life's work.\nNamed after the city of her birth, Nightingale was born at the Villa Colombia in Florence, Italy, on\n12\nMay\n1820\n. Her parents, William Edward Nightingale and his wife Frances Smith, were touring Europe for the first two years of their marriage. Nightingale's elder sister had been born in Naples the year before. The Nightingales gave their first born the Greek name for the city, which was Parthenope.\nWilliam Nightingale had been born with the surname Shore but he had changed it to Nightingale after inheriting from a rich relative, Peter Nightingale of Lea, near Matlock, Derbyshire. The girls grew up in the country spending much of their time at Lea Hurst in Derbyshire. When Nightingale was about five years old her father bought a house called Embley near Romsey in Hampshire. This now meant that the family spent the summer months in Derbyshire, while the rest of the year was spent at Embley. Between these moves there were trips to London, the Isle of Wight, and to relatives.\nThe early education of Parthenope and Florence was placed in the hands of governesses, later their Cambridge educated father took over the responsibility himself. Nightingale loved her lessons and had a natural ability for studying. Under her father's influence Nightingale became acquainted with the classics,\nEuclid\n,\nAristotle\n, the Bible, and political matters.\nIn\n1840\n, Nightingale begged her parents to let her study mathematics instead of:-\n... worsted work and practising quadrilles,\nbut her mother did not approve of this idea. Although William Nightingale loved mathematics and had bequeathed this love to his daughter, he urged her to study subjects more appropriate for a woman. After many long emotional battles, Nightingale's parents finally gave their permission and allowed her to be tutored in mathematics. Her tutors included\nSylvester\n, who developed the theory of invariants with\nCayley\n. Nightingale was said to be\nSylvester\n's most distinguished pupil. Lessons included learning arithmetic, geometry and algebra and prior to Nightingale entered nursing, she spent time tutoring children in these subjects.\nNightingale's interest in mathematics extended beyond the subject matter. One of the people who also influenced Nightingale was the Belgian scientist\nQuetelet\n. He had applied statistical methods to data from several fields, including moral statistics or social sciences.\nReligion played an important part in Nightingale's life. Her unbiased view on religion, unusual at the time, was owed to the liberal outlook Nightingale found in her home. Although her parents were from a Unitarian background, Frances Nightingale found a more conventional denomination preferable and the girls were brought up as members of the Church of England. On\n7\nFebruary\n1837\nNightingale believed she heard her calling from God, whilst walking in the garden at Embley, although at this time though she did not know what this calling was.\nNightingale developed an interest in the social issues of the time, but in\n1845\nher family was firmly against the suggestion of Nightingale gaining any hospital experience. Until then the only nursing that she had done was looking after sick friends and relatives. During the mid-nineteenth century nursing was not considered a suitable profession for a well-educated woman. Nurses of the time were lacking in training and they also had the reputation of being coarse, ignorant women, given to promiscuity and drunkenness.\nWhile Nightingale was on a tour of Europe and Egypt starting in\n1849\n, with family friends Charles and Selina Bracebridge, she had the chance to study the different hospital systems. In early\n1850\nNightingale began her training as a nurse at the Institute of St Vincent de Paul in Alexandria, Egypt, which was a hospital run by the Roman Catholic Church. Nightingale visited Pastor Theodor Fliedner's hospital at Kaiserswerth, near Düsseldorf, in July\n1850\n. Nightingale returned to Kaiserswerth, in\n1851\n, to undertake\n3\nmonths of nursing training at the Institute for Protestant Deaconesses and from Germany she moved to a hospital in St Germain, near Paris, run by the Sisters of Mercy. On returning to London in\n1853\nNightingale took up the unpaid position as the Superintendent at the\nEstablishment for Gentlewomen during Illness\nat No\n1\nHarley Street.\nMarch of\n1854\nbrought the start of the Crimean War, with Britain, France and Turkey declaring war on Russia. Although the Russians were defeated at the battle of the Alma River, on\n20\nSeptember\n1854\n,\nThe Times\nnewspaper criticised the British medical facilities. In response to this Nightingale was asked in a letter from her friend Sidney Herbert, the British Secretary for War, to become a nursing administrator to oversee the introduction of nurses to military hospitals. Her official title was\nSuperintendent of the Female Nursing Establishment of the English General Hospitals in Turkey\n. Nightingale arrived in Scutari, an Asian suburb of Constantinople,\n(\nnow Istanbul\n)\n, with\n38\nnurses on\n4\nNovember\n1854\n[\n2\n]\n:-\n... her zeal, her devotion, and her perseverance would yield to no rebuff and to no difficulty. She went steadily and unwearyingly about her work with a judgement, a self-sacrifice, a courage, a tender sympathy, and withal a quiet and unostentatious demeanour that won the hearts of all who were not prevented by official prejudices from appreciating the nobility of her work and character.\nAlthough being female meant Nightingale had to fight against the military authorities at every step, she went about reforming the hospital system. With conditions which resulted in soldiers lying on bare floors surrounded by vermin and unhygienic operations taking place it is not surprising that, when Nightingale first arrived in Scutari, diseases such as cholera and typhus were rife in the hospitals. This meant that injured soldiers were\n7\ntimes more likely to die from disease in hospital, than on the battlefield. Whilst in Turkey, Nightingale collected data and organised a record keeping system, this information was then used as a tool to improve city and military hospitals. Nightingale's knowledge of mathematics became evident when she used her collected data to calculate the mortality rate in the hospital. These calculations showed that an improvement of the sanitary methods employed would result in a decrease in the number of deaths. By February\n1855\nthe mortality rate had dropped from\n60\n% to\n42\n.\n7\n%. Through the establishment of a fresh water supply as well as using her own funds to buy fruit, vegetables and standard hospital equipment, the mortality rate in the spring had dropped further to\n2\n.\n2\n%.\nNightingale used this statistical data to create her Polar Area Diagram, or \"coxcombs\" as she called them. These were used to give a graphical representation of the mortality figures during the Crimean War\n(1854\n-\n56)\n.\nThe area of each coloured wedge, measured from the centre as a common point, is in proportion to the statistic it represents. The blue outer wedges represent the deaths from:-\n... preventable or mitigable zymotic diseases\nor in other words contagious diseases such as cholera and typhus. The central red wedges show the deaths from wounds. The black wedges in between represent deaths from all other causes. Deaths in the British field hospitals reached a peak during January\n1855\n, when\n2\n,\n761\nsoldiers died of contagious diseases,\n83\nfrom wounds and\n324\nfrom other causes making a total of\n3\n,\n168\n. The army's average manpower for that month was\n32\n,\n393\n. Using this information, Nightingale computed a mortality rate of\n1\n,\n174\nper\n10\n,\n000\nwith\n1\n,\n023\nper\n10\n,\n000\nbeing from zymotic diseases. If this rate had continued, and troops had not been replaced frequently, then disease alone would have killed the entire British army in the Crimea.\nThese unsanitary conditions, however, were not only limited to military hospitals in the field. On her return to London in August\n1856\n, four months after the signing of the peace treaty, Nightingale discovered that soldiers during peacetime, aged between\n20\nand\n35\nhad twice the mortality rate of civilians. Using her statistics, she illustrated the need for sanitary reform in all military hospitals. While pressing her case, Nightingale gained the attention of Queen Victoria and Prince Albert as well as that of the Prime Minister, Lord Palmerston. Her wishes for a formal investigation were granted in May\n1857\nand led to the establishment of the Royal Commission on the Health of the Army. Nightingale hid herself from public attention, and became concerned for the army stationed in India. In\n1858\n, for her contributions to army and hospital statistics Nightingale became the first woman to be elected to be a Fellow of the\nRoyal Statistical Society\n.\nIn\n1860\n, the Nightingale Training School and Home for Nurses based at St Thomas's Hospital in London, opened with\n10\nstudents. It was financed by the Nightingale Fund, a fund of public contributions set up during Nightingale's time in the Crimea and had raised a total of £\n50\n,\n000\n. It was based around two principles. Firstly that the nurses should have practical training in hospitals specially organised for that purpose. The other was that the nurses should live in a home fit to form a moral life and discipline. Due to the foundation of this school Nightingale had achieved the transformation of nursing from its disreputable past into a responsible and respectable career for women. Nightingale responded to the British war office's request for advice on army medical care in Canada and was also a consultant to the United States government on army health during the American Civil War.\nFor most of the remainder of her life Nightingale was bedridden due to an illness contracted in the Crimea, which prevented her from continuing her own work as a nurse. This illness did not stop her, however, campaigning to improve health standards; she published\n200\nbooks, reports and pamphlets. One of these publications was a book entitled\nNotes on Nursing\n(1860)\n. This was the first textbook specifically for use in the teaching of nurses and was translated into many languages. Nightingale's other published works included\nNotes on Hospitals\n(1859)\nand\nNotes on Nursing for the Labouring Classes\n(1861)\n. Florence Nightingale deeply believed that her work had been her calling from God. In\n1874\nshe became an honorary member of the\nAmerican Statistical Association\nand in\n1883\nQueen Victoria awarded Nightingale the Royal Red Cross for her work. She also became the first woman to receive the Order of Merit from Edward VII in\n1907\n.\nNightingale died on\n13\nAugust\n1910\naged\n90\n. She is buried at St Margaret's Church, East Wellow, near Embley Park. Nightingale never married, although this was not from lack of opportunity. She believed, however, that God had decided she was one whom he:-\n... had clearly marked out ... to be a single woman.\nThe Crimean Monument, erected in\n1915\nin Waterloo Place, London, was done so in honour of the contribution Florence Nightingale had made to this war and the health of the army.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Statistics"
  ]
}