{
  "nome_completo": "Florence Eliza Allen",
  "nome_curto": "Florence Allen",
  "ano_nascimento": "1876",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Allen_Florence/",
  "lugar_nascimento": "Horicon, Wisconsin, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Florence Allen\nwas the daughter of Charles Allen\n(1836\n-\n1890)\nand Eliza North\n(1848\n-\n1913)\n. Charles Allen was born on\n28\nJune\n1836\n, in Morrisville, Madison, New York, USA, the son of Juna Allen and Lucy Chapin. He moved to Wisconsin when a young man and, after becoming a school teacher, he became Superintendent of Schools in Dodge County. He married Eliza North on\n8\nOctober\n1866\n, in Dodge, Wisconsin, USA. Eliza North was born on\n3\nAugust\n1848\n, in Dodge, Wisconsin, the daughter of Joseph Shepard North and Sarepta Ryder. While serving as Superintendent of Schools, Charles Allen trained to become a lawyer and from\n1870\nhe practiced law in Horicon, Wisconsin. Charles and Eliza Allen had two children, Charles Elmer Allen, born\n4\nOctober\n1872\n, and Florence Eliza Allen, born\n4\nOctober\n1876\n, the subject of this biography.\nAlthough Horicon was a small town with only a few hundred inhabitants, it had both a high school and a grammar school. Both Allen children received their secondary education in these schools and in\n1889\nCharles Elmer Allen began his studies at the University of Wisconsin in Madison. He had only been studying for a few months when his father died and he left university to provide family finance. He trained as an assistant court reporter, and did this work for six years to support his mother and sister Florence. When her father died, Florence was in the middle of her secondary schooling in Horicon. After graduating from High School, she taught in a country school before beginning her university education.\nIn\n1896\nFlorence Allen entered the University of Wisconsin to study mathematics. In the same year her brother Charles Allen returned to the University of Wisconsin to study botany. He did not completely give up his work as an assistant court reporter but continued this on a part-time basis in order to support both himself and his sister.\nWhen Allen entered the University of Wisconsin, Charles Ambrose Van Velzer\n(1851\n-\n1945)\nwas Professor of Mathematics, Charles Sumner Slichter\n(1864\n-\n1946)\nwas Professor of Applied Mathematics, Ernest Brown Skinner\n(1863\n-\n1935)\nwas Assistant Professor of Mathematics, John M Howie\n(\nborn\n1871)\nwas an Assistant in Mathematics, and\nLinnaeus Wayland Dowling\n(1867\n-\n1928)\nwas an Instructor in Mathematics.\nDowling\nhas a biography in this archive; we give some details of the others.\nCharles Ambrose Van Velzer was born in Baldwinsville, New York, on\n2\nSeptember\n1851\n. He attended Cornell University from\n1872\nto\n1876\nwhen he graduated with a Bachelor of Science. He received first prize in mathematics at the intercollegiate contest in December of that year while he was an instructor at Cornell\n1876\n-\n1877\n. He was a graduate fellow at Johns Hopkins University\n1878\n-\n1881\nand became Instructor in Mathematics at the University of Wisconsin in\n1881\n. He was promoted to Assistant Professor in\n1883\nand to Professor in\n1885\n. That was the same year, Hillsdale College conferred on him an honorary doctorate. Van Velzer served as Chair of the Department of Mathematics at the University of Wisconsin\n1884\n-\n1894\nand continued as a Professor at the University of Wisconsin until\n1906\n. Charles Sumner Slichter was born in Saint Paul, Minnesota, on\n16\nApril\n1864\n. He attended Cornell University graduating with a Bachelor of Science in\n1885\n. He then studied at Northwestern University, being awarded a Master's Degree in\n1887\n. In\n1886\nhe came to the University of Wisconsin as an instructor in mathematics, became an assistant professor in\n1889\n, and in\n1892\nwas made Professor of Applied Mathematics. He was appointed dean of the University of Wisconsin graduate school in\n1920\nand continued to hold that position until he retired in\n1934\n. Ernest Brown Skinner\n(1863\n-\n1935)\nwas born in Redfield, Ohio, on\n12\nDecember\n1863\n. He graduated from Ohio University in\n1888\n, taught at Amity College in Iowa\n(1888\n-\n1891)\n, then undertook research at Clark University advised by\nWilliam Story\n. In\n1892\n, before completing work for a Ph.D., he came to the University of Wisconsin as an instructor and was promoted to assistant professor in\n1895\n. He took leave for a year to undertake research for a Ph.D. at the University of Chicago which he was awarded in\n1900\n. He was promoted to associate professor in\n1910\n, and to a full professor in\n1920\n. He continued as a Professor at the University of Wisconsin until his death in\n1935\n. John M Howie\n(\nborn\n1871)\nwas an Assistant in Mathematics at the University of Nebraska\n1894\n-\n95\n, before being appointed as an Assistant in Mathematics at the University of Wisconsin\n1895\n-\n97\n.\nAllen majored in mathematics but took part in many other student activities during her undergraduate years. For example, we see from\n[\n3\n]\nthat in\n1898\n-\n99\nshe was in the Junior Class of the College of Letters and Science. She is listed as a Junior in Delta Delta Delta, Sorores in Universitate, the social sorority. She was also in the Castalia Junior Class, a literary society for women which promoted interest in the fine arts, and a member of the\n1900\nBadger Literary Committee, which organised the production of the\n1900\nyearbook. She was Chairman of the\n1900\nBadger Photo Committee. In\n1900\nFlorence Allen was awarded a bachelor's degree. Her brother Charles Allen had been awarded his bachelor's degree in\n1899\nand was studying at the University of Wisconsin for his Ph.D. Both Florence and Charles Allen were living with their mother at\n222\nCharter Street, Madison.\nAfter the award of her bachelor's degree, Florence Allen remained at the University of Wisconsin studying for a Master's Degree. There were a number of students studying for their Ph.D. while employed as an assistant in mathematics and this must have encouraged Allen. For example Theodore Rudolph Running was being advised by Charles Van Velzer and\nWayland Dowling\n. He was employed as an assistant from\n1897\nand awarded his Ph.D. in\n1899\n. William Duane Tallman had been awarded a B.S. in mathematics and physics and was appointed as an assistant in\n1897\n.\nCharlotte Elvira Pengra\nhad been awarded her bachelor's degree in\n1897\nand was employed as an assistant from\n1899\nwhile she undertook research for a Ph.D. advised by\nWayland Dowling\n. She was awarded the degree in\n1891\n. Florence Allen was awarded a Master's Degree in\n1901\nhaving submitted the\n60\n-page thesis\nThe Abelian Integrals of the First Kind Upon the Riemann's Surface\ns\n=\n(\nz\nâ\na\n)\n5\n/\n6\n(\nz\nâ\nb\n)\n5\n/\n6\n(\nz\nâ\nc\n)\n2\n/\n6\ns = (z-a)^{5/6} (z-b)^{5/6} (z-c)^{2/6}\ns\n=\n(\nz\nâ\na\n)\n5\n/\n6\n(\nz\nâ\nb\n)\n5\n/\n6\n(\nz\nâ\nc\n)\n2\n/\n6\n. Her thesis advisor was\nWayland Dowling\n.\nLet us quote at this stage an extract from the obituary of\nLinnaeus Wayland Dowling\nwritten by Allen following his death in\n1928\n[\n1\n]\n:-\nProfessor\nDowling\n's instruction was characterised by an exceptional clarity of exposition which, with his magnetism, geniality of manner, and interest in his students, made him a universally popular and beloved teacher. He was a man of unusual breadth of interests: a talented musician, an eager and well-informed botanist, and a student of the humanities. His knowledge of the language and literature of Italy, where he studied under the geometer\nSegre\n, was exceptional; and he was an ardent reader and lover of poetry. These talents explain, in part, the bonds of sympathy that united him with so many colleagues and students. But above all his attraction was due to his personal qualities, his cheerful disposition and his kindly character. His influence in these private associations was no less great than in his admirable public service as a teacher, and he will long be remembered and missed by his friends.\nAllen was appointed as an assistant in mathematics in\n1901\nand in the following year was promoted to instructor in mathematics. She undertook research for her doctorate advised by\nWayland Dowling\n. In June\n1905\nshe travelled to Europe with her mother in a party led by\nWayland Dowling\n[\n16\n]\n:-\nA party of tourists left Madison in June\n1905\nfor a summer's trip in Europe, under the guidance of Professor\nL W Dowling\n, assistant professor of mathematics. The other members of the party are Mrs Dowling, Mrs Eliza Allen and daughter Miss Florence E Allen,\n(1900)\n, instructor in mathematics; Miss Merle S Pickford\n(1902)\n, instructor in history in the Eau Claire High School; and Miss Jennie Sherrill\n(1902)\n, of Belvidere, Ill., instructor in history in Belvidere high school. The party travels together through England, Holland and Germany to Switzerland, where Mrs Allen and daughter will return to Bonn, Germany, to meet Mr C E Allen,\n(1899)\n, Mrs Allen's son, who, with his wife, has been in thatÂ city attending the University for the past year, engaged in the study of botany, of which he is instructor at the University. The other members of the party will proceed to Italy, where Dr and Mrs\nDowling\nexpect to remain until\n1\nJune\n1906\n. Dr\nDowling\nwill spend a year in study at Turin, Italy. Miss Pickford and Miss Sherrill will sail for home by way of Naples and the Mediterranean route,\n26\nAugust, on the steamship Canopic, White Star Line, landing at Boston. Mrs Allen and daughter and Mr Allen and wife will sail from Hamburg\n1\nSeptember reaching here before the opening of the University next fall.\nMerle Pickford informed the\nWisconsin State Journal from Madison\nwhen they arrived in England\n[\n15\n]\n:-\nPosts have been received from Miss Merle Pickford who with Dr and Mrs\nDowling\n, Mrs Eliza Allen and daughter, Miss Florence Allen arrived safely at Liverpool after a pleasant voyage, and who presumably are now in London.\nIn fact the Allens return journey was on the ship\nPretoria\nfrom Cuxhaven, Germany, on\n2\nSeptember\n1905\n, arriving in New York on\n16\nSeptember.\nIn\n1907\nAllen was awarded her Ph.D. for her thesis\nThe cyclic involutions of third order determined by nets of curves of deficiency\n0\n,\n1\nand\n2\n. Although completed in\n1907\n, Allen's thesis was not published until\n1914\n. The thesis begins\n[\n4\n]\n:-\nIn an article entitled \"Razionalita della Involuzioni Piane,\"\nCastelnuovo\nproved the rationality of all involutions in the plane. In his notation, a plane involution is defined by four equations between\n(\nÎ±\n,\nÎ²\n,\nÎ³\n)\n(\\alpha, \\beta, \\gamma)\n(\nÎ±\n,\nÎ²\n,\nÎ³\n)\n, the points of a plane, and\n(\nx\n1\n,\nx\n2\n,\nx\n3\n,\nx\n4\n)\n(x_{1}, x_{2}, x_{3}, x_{4})\n(\nx\n1\nâ\n,\nx\n2\nâ\n,\nx\n3\nâ\n,\nx\n4\nâ\n)\n, the points on a surface in space of three dimensions:\nÏ\nx\nn\n=\nf\nn\n(\nÎ±\n,\nÎ²\n,\nÎ³\n)\n(\nn\n=\n1\n,\n2\n,\n3\n,\n4\n)\n\\rho x_n = f_n(\\alpha, \\beta, \\gamma)      (n = 1, 2, 3, 4)\nÏ\nx\nn\nâ\n=\nf\nn\nâ\n(\nÎ±\n,\nÎ²\n,\nÎ³\n)\n(\nn\n=\n1\n,\n2\n,\n3\n,\n4\n)\n,\nthe functions\nf\nn\nf_{n}\nf\nn\nâ\nbeing rational forms of the same degree. To a given point in the plane corresponds uniquely a point of the surface; but to a given point on the surface correspond, in general, not one point, but several points, in the plane. When to a point on the surface corresponds a group of two or more points in the plane, these groups are said to constitute an involution in the plane. From the point of view of the plane itself, an involution means the establishment of an\nâ\n2\nâ^{2}\nâ\n2\nseries of point groups, each point of the plane belonging to one and only one group, and each point determining the remainder of the points associated with it to form a group. The important theorem that all such involutions are rational signifies that a one-on-one correspondence may be established between their groups and the points of a plane. Hence, if the points in the above equations range over a surface I, each point of I giving rise to a group of\nn\nn\nn\npoints in the plane\nÏ\n\\pi\nÏ\n, it is always possible to establish a mutually unique correspondence between the points of I and the points of a plane\nÏ\nâ²\n\\pi'\nÏ\nâ²\n. Thus every involution may originate in a plane Ï' so that to each point of\nÏ\nâ²\n\\pi'\nÏ\nâ²\ncorresponds exactly one group of the involution in Ï. The problem may then be transferred from the study of surfaces to the study of systems of curves in the plane, as follows.\nOn account of the rationality of the surface, the above equations may be replaced by relations connecting the points\n(\nÎ¾\n,\nÎ·\n,\nÎ¶\n)\n(\\xi, \\eta, \\zeta)\n(\nÎ¾\n,\nÎ·\n,\nÎ¶\n)\nof\nÏ\nâ²\n\\pi'\nÏ\nâ²\nwith the points\n(\nx\n,\ny\n,\nz\n)\n(x,y,z)\n(\nx\n,\ny\n,\nz\n)\nof\nÏ\n\\pi\nÏ\n:\nÏ Î¾ = U\n(\nx,y,z\n)\n,\nÏ Î· = V\n(\nx,y,z\n)\n,\nÏ Î¶ = W\n(\nx,y,z\n)\n,\nfor  Î¾:Î·:Î¶ = U:V:W.\nTo a point\n(\nÎ¾\n1\n,\nÎ·\n1\n,\nÎ¶\n1\n)\n(\\xi_{1}, \\eta_{1}, \\zeta_{1})\n(\nÎ¾\n1\nâ\n,\nÎ·\n1\nâ\n,\nÎ¶\n1\nâ\n)\ncorresponds in\nÏ\n\\pi\nÏ\na group of points determined as the variable intersections of\nU\n/\nÎ¾\n1\n=\nV\n/\nÎ·\n1\n=\nW\n/\nÎ¶\n1\nU/ \\xi_{1} = V/ \\eta_{1} = W/ \\zeta_{1}\nU\n/\nÎ¾\n1\nâ\n=\nV\n/\nÎ·\n1\nâ\n=\nW\n/\nÎ¶\n1\nâ\n, i.e., the intersections outside of the fundamental points common to\nU\n,\nV\nU, V\nU\n,\nV\n, and\nW\nW\nW\n.\nThus every involution may be generated by a linear net of curves\nÎ»\nU\n+\nÎ¼\nV\n+\nÎ½\nW\n=\n0\n\\lambda U + \\mu V + \\nu W = 0\nÎ»\nU\n+\nÎ¼\nV\n+\nÎ½\nW\n=\n0\n.\nThe involution will be characterised as an\nI\nn\nI_n\nI\nn\nâ\n,\nn\nn\nn\nbeing the number of points in a group, or the number of intersections of two curves of the net outside of the base points;\nn\nn\nn\nwill be call the \"order\" of the involution.\nThere is thus established a general theory of involutions of any order and any kind. In this theory, as formulated by\nCastelnuovo\n, reference is made to the so-called \"cyclic\" involutions, i.e., those in which the transformation is effected by a periodic birational transformation, either a collineation or a periodic\nCremona\ntransformation. The theory of the cyclic periodic transformations of any order has been developed by Kantor and\nWiman\n. The involutions of order\n2\nwere first classified by\nBertini\n, these, as is known, being entirely cyclic. There has apparently as yet been no attempt to distinguish between the geometric construction of the cyclic and the non-cyclic types, a distinction which would rise for the first time in the case of the\nI\n3\nI_3\nI\n3\nâ\n. It is the purpose of this paper to discuss the construction of an\nI\n3\nI_3\nI\n3\nâ\nfrom the point of view of nets of curves, and to differentiate, in the case of nets of deficiency\n0\n,\n1\n, and\n2\n, between those which lead to cyclic and to non-cyclic involutions. for the systems of curves of the above deficiencies the cyclic cases will be found, and in each case the analytic expression of the periodic transformation set up.\nIn the\n1910\ncensus, Allen is recorded as living with her mother in\n219\nLathop Street, Madison. She continued to live in Lathop Street, Madison for the rest of her life. Her mother Eliza died in Madison in\n1913\nand was buried in Horicon; after this Allen lived alone for some years. In\n1914\nAllen made a summer visit to Europe with her brother Charles E Allen, his wife Genevieve and their three children Edith, Harold and Charles. They returned to the United States sailing from Liverpool, England, on the ship the\nZeeland\n, reaching New York on\n22\nSeptember\n1914\n.\nAfter publishing her thesis in\n1914\n, Allen published the paper\nA certain class of transcendental curves\nin\n1915\n.\nHans Rademacher\nreviewed this paper and writes\n[\n12\n]\n:-\nG N Bauer and N L Slobin have investigated curves of the type\n(1)\nÎ¦\n(\nx\n,\ny\n)\nâ\ne\nÎ¨\n(\nx\n,\ny\n)\n+\nX\n(\nx\n,\ny\n)\n=\n0\n\\Phi (x, y) Â· e^{\\Psi(x,y)} + X(x, y) = 0\nÎ¦\n(\nx\n,\ny\n)\nâ\ne\nÎ¨\n(\nx\n,\ny\n)\n+\nX\n(\nx\n,\ny\n)\n=\n0\nwhere\nÎ¦\n,\nÎ¨\n\\Phi, \\Psi\nÎ¦\n,\nÎ¨\nand\nX\nX\nX\nare entire rational functions with algebraic coefficients. They have found that at least one coordinate of every point of this curve is transcendental, except for certain trivial points that are obtained by setting\nÎ¦\n\\Phi\nÎ¦\nand\nX\nX\nX\nor\nÎ¨\n\\Psi\nÎ¨\nto zero. The author now discusses this curve in more detail and finds, for example, the theorem that the curve has no transcendental multiple point. They also investigate the case where\nÎ¦\n,\nÎ¨\n\\Phi, \\Psi\nÎ¦\n,\nÎ¨\nand\nX\nX\nX\nare functions of the same function\nÎ¸\n(\nx\n,\ny\n)\n\\theta(x, y)\nÎ¸\n(\nx\n,\ny\n)\n, where\n(1)\ndegenerates into a family of curves\nÎ¸\n(\nx\n,\ny\n)\n=\nc\n\\theta(x, y) = c\nÎ¸\n(\nx\n,\ny\n)\n=\nc\n,\nwhere\nc\nc\nc\ncan only take on values ââof a special nature.\nAt the time of the\n1920\ncensus, Allen is still living alone at her home on Lathop Street, Madison. On the\n8\nMay\n1924\nshe applied for a passport so that she could make a European tour over the summer. She was to leave on\n28\nJune\n1924\non the ship the\nMajestic\nand visit France, Italy, Switzerland and England. On the application, Allen gives the following personal details: Age\n47\nyears; Height\n5\nft\n5\nins; Forehead High; Eyes Brown; Nose Straight; Mouth Normal; Chin Rounded; Hair Grey; Complexion Medium; Face Oval. She travelled with Lillian Beecroft. Lillian Jane Beecroft\n(1863\n-\n1947)\nwas the first daughter and second child of William G Beecroft and Mary B Boufller's; they had five children. Lillian had been born in Madison on\n13\nDecember\n1863\nand she worked as a librarian at the University of Wisconsin. Allen and Beecroft returned to the United States by sailing on the\nCarmania\nfrom Liverpool, England to Quebec, Canada, arriving on\n10\nSeptember\n1924\n, then crossing into the United States. At the time of the\n1930\ncensus, Lillian Beecroft is recorded as a boarder in Allen's home on Lathop Street, Madison.\nIn\n1927\nAllen published the paper\nClosure of the tangential process on the rational plane cubic\n. The paper begins\n[\n6\n]\n:-\nIn a series of recent papers,\n[\nUniversity of Washington professor\n]\nR M Winger\n(1918\n,\n1919\nand\n1920)\nhas developed various features of the satellite theory of the plane cubic by use of the parameter form of representation and involutions on rational curves. Classic theorems and extensions of satellite properties are proved with great ease and beauty.\nA prominent feature of these papers is the discussion of systems of contact curves. Of special interest is Winger's conic\nN\nN\nN\n, the envelope of lines joining pairs of contact of tangents from points of the rational cubic, and tangent to the cubic at the sextactic points. This conic is one of a pencil of conics which touch the nodal tangents where they meet the line of inflexions. Since both the cubic and each conic of this pencil are invariant under a dihedral\nG\n6\nG_{6}\nG\n6\nâ\n, the pencil and the conic\nN\nN\nN\nplay an important part in the construction of special and general sets of the group.\nThe problem of closure of the tangential process on an elliptic cubic or higher curve has been extensively discussed from the number-theory standpoint,\n(\nfor example by\nSylvester\n,\nStory\n, Picquet, and Porter\n)\nleading to the determination of sets of real, rational points on a curve. With this has been developed the configurations of polygons, both inscribed and circumscribed to a curve of third order or higher.\nThe present paper takes up the problem of determining those points on a rational cubic which coincide with their nth tangentials from the more general projective standpoint. It is found that the pencil of conics above described is of fundamental importance.\nGerhard Karl Theodor Haenzel reviewed this paper, writing\n[\n8\n]\n:-\nOn the rational plane curve of third order, those points are successively sought that coincide with its first, second, third, ... tangent points. The geometric significance of such point groups for the curve is then discussed.\nAt the time of the\n1940\ncensus, Allen is living alone in her home on Lathop Street, Madison but by the time of the\n1950\ncensus she has Vermillion Thiesson as a \"roomer\". Vermillion Thiesson\n(1886\n-\n1968)\n, who worked at the State Laboratory of Hygiene in Madison, was the widow of Frank Thiesson who had worked at the University of Wisconsin but died in\n1942\n.\nWe mentioned above that Florence Allen had been appointed as an assistant in mathematics at the University of Wisconsin in\n1901\nand, one year later, had been promoted to Instructor in Mathematics. In fact she remained as an Instructor in Mathematics for\n43\nyears and only in\n1945\n, at the age of\n68\n, was she promoted to Assistant Professor of Mathematics. She retired in\n1947\nand continued to live in Madison.\nLet us note that Florence Allen was a member of the\nAmerican Mathematical Society\n. She attended meetings of the Society in Chicago\n(\nDecember\n1916\n, March\n1919\n, December\n1924\n, April\n1925)\n, in Kansas City\n(\nDecember\n1925)\n, and in Madison\n(\nSeptember\n1927\n, September\n1939\n, September\n1948)\n. She presented the paper\nOn a class of sectrix curves\nby title to the March\n1919\nChicago meeting.\nIn\n1920\nAllen reviewed\nCommercial Algebra\n, by Wentworth, Smith and Schlaugh. We learn something about her views from her comment\n[\n7\n]\n:-\nThe publication of such texts as this may be taken as a hopeful sign - not that the curriculum is becoming over commercialised, but that the commercial world is finding it increasingly necessary that its people shall be trained in logical mathematical thought.\nWe also learn about her views on women doctorates in mathematics from her response to an inquiry by Helen Owens. Allen replied on\n8\nJune\n1940\n(\nsee\n[\n8\n]\n)\n:-\nOf course there will always be some women who should go in for a Ph.D. - some because it will be an actual necessity to qualify them for one of the occasional - very occasional - openings in college and university positions, some because of the leisure they may have to follow a congenial pursuit. But on the whole I see no great encouragement to be had from past experiences and observation. I do not believe that there is or will be a great future for any but a few in this field. At present, it seems to me, as I look about this campus, that in all strictly academic fields\n(\nnot those special to women\n)\nthat there is a decided drop in the number of women engaged. That may be peculiar to this economic phase, but I look for it to continue for some time to come.\nAllen continued to live in her home in Lathop Street, Madison until Thursday\n29\nDecember\n1960\nwhen she was admitted to a Madison hospital. She died two days later and her funeral was held at the Fitch Lawrence funeral home in Madison on Monday\n2\nJanuary\n1961\n. She was buried in Oak Hill cemetery, Horicon.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}