{
  "nome_completo": "Bernard Frénicle de Bessy",
  "nome_curto": "Frénicle de Bessy",
  "ano_nascimento": "1604",
  "ano_morte": "1674",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frenicle_de_Bessy/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Frénicle de Bessy\nwas an excellent amateur mathematician whose father and brother both held  official positions as counsellors at the Court of Monnais in Paris. Very little is known about his life\n(\neven his year of birth is a guess\n)\nand, given that he was one of the founder members of the\nParis Academy of Sciences\nand has an Éloge written by the\nMarquis de Condorcet\n, this must give us one obvious fact about Frénicle de Bessy, namely that he was a very private man. Even\nPierre de Fermat\n, with whom Frénicle de Bessy corresponded, commented in August\n1638\nthat he knew nothing of the man. Historians have come up with some guesses about Frénicle de Bessy, but little in the way of hard facts about him have emerged other than his letters and writings about mathematics. Let us quote from David Sturdy\n[\n4\n]\n:-\nBorn and raised in Paris, Frénicle de Bessy must have graduated in law before proceeding to hold the office of 'conseiller à la cour des monnaies'. This tribunal had been a sovereign court since\n1552\n, which is to say that its writ ran throughout the kingdom, and in certain areas of competence it ranked as a final court of appeal. As its title indicates, it paid particular attention to subjects pertaining to coinage and finance. It exercised important advisory and administrative functions, helping the government periodically to fix the value in livres, sous and deniers of the many types of coinage in France, and being responsible for drafting royal edicts on financial affairs. ... It oversaw the management and output of the thirty mints which operated in the kingdom, to which end it despatched its 'conseillers' on special missions. ... It tried both civil and criminal cases concerning forgery, counterfeit, or any dispute over the coinage of the realm. ... This was the environment in which Frénicle de Bessy spent much of his time. ... He may have been a 'conseiller' by the late\n1630\ns when he was attending meetings of\nMersenne\n's group. He subsequently joined the Montmor and Thévenot 'academies', assisting from time to time in astronomical observations conducted by members of the latter group. ... when names were being canvassed for the\nAcadémie des Sciences\n, that of Frénicle de Bessy was among those regarded as most likely to be included. Not least among his advantages was his cooperative, genial personality. ... If anyone could help the new institution to work harmoniously it was Frénicle de Bessy.\nSome of the information in Sturdy's book is taken from\nCondorcet\n's Éloge which recent studies\n[\n9\n]\nhave found to be unreliable.\nHe corresponded with\nRené Descartes\n,\nPierre de Fermat\n,\nChristiaan Huygens\nand\nMarin Mersenne\n. Most of the correspondence between these men and Frénicle de Bessy was on\nnumber theory\nbut not exclusively so. He does comment on applied mathematical problems such as the trajectory of a body which falls from a starting position with an initial horizontal component. In a letter which he wrote at Dover in England to\nMersenne\non\n7\nJune\n1634\n, Frénicle describes an experiment to study the trajectory of a body released from the top of the mast of a moving ship. The data which he presents in the letter is quite accurate. Again on a more applied mathematical topic, Frénicle wrote an article which makes comments on\nGalileo\n's\nDialogue\n. However, the famous mathematical historian\nMoritz Cantor\nfelt that since Frénicle was so highly regarded by other mathematicians of his day that he must have produced further research which was known to his colleagues at the time but it was never published and no record of it has come down to us.\nIt is interesting to look at a comment about Frénicle in a letter of one of his correspondents. Sir Kenelm Digby\n(1603\n-\n1665)\nwas an English courtier but, as a Roman Catholic, spent many years in voluntary exile in Paris during a time of religious difficulties in England. Between\n1635\nand\n1660\nhe was mostly in Paris where he met both\nMarin Mersenne\nand\nThomas Hobbes\n. Digby clearly knew Frénicle well and several letters from Frénicle to Digby around\n1658\nare extant. Here is a comment about Frénicle made by Digby:-\nI told M Frénicle that, for someone with so much passion and spirit that he has and with such wonderful genius for the science of numbers, the fire would be brighter if he would excite it or increase it by study, by reading the writings of past scholars and by conversations.\nAgain Digby feared in\n1657\nthat Frénicle was becoming infatuated with theology and wrote that Frénicle:-\n... could have been ranked as one of the greatest mathematicians of the century.\nAll of this suggests that Frénicle did not have as good a mathematical background as he might have had, so his talent must have been in possessing amazing computational skills. Jason Earls writes\n[\n3\n]\n:-\nFrénicle de Bessy was such a computational juggernaut that whenever anyone would send him a numerical challenge, he would return awe-inspiring solutions in record time.\nIt was this remarkable computational ability that means that today Frénicle de Bessy is best known for his contributions to number theory. In fact,\nFermat\n, in a letter to\nGilles Personne de Roberval\n, writes\n(\nsee, for example\n[\n8\n]\n)\n:-\nFor some time M Frénicle has given me the desire to discover the mysteries of numbers, an area in which he his highly versed.\nHe had a remarkable ability to spot number patterns. For example, he noted that\n7\nis difference between a square and twice a square in several different ways:\n7\n=\n2.\n2\n2\n−\n1\n2\n,\n7\n=\n3\n2\n−\n2.\n1\n1\n,\n7\n=\n5\n2\n−\n2.\n3\n2\n,\n7\n=\n2.\n4\n2\n−\n5\n2\n7 = 2.2^{2} - 1^{2}, 7 = 3^{2} - 2.1^{1}, 7 = 5^{2} - 2.3^{2}, 7 = 2.4^{2} - 5^{2}\n7\n=\n2\n.\n2\n2\n−\n1\n2\n,\n7\n=\n3\n2\n−\n2\n.\n1\n1\n,\n7\n=\n5\n2\n−\n2\n.\n3\n2\n,\n7\n=\n2\n.\n4\n2\n−\n5\n2\n.\nHe solved many of the problems posed by\nFermat\nbut he did more than find numerical solutions for he also put forwards new ideas and posed further questions. However, the initial letters between the two men show that at first Frénicle thought that\nFermat\nwas teasing him\n[\n3\n]\n:-\nWhen\nPierre de Fermat\nfirst began writing to de Bessy, he would challenge him with difficult number theory problems while giving no hint of their possible solution, which Frénicle found extremely frustrating, since he suspected that\nFermat\nwas teasing him. Later their missives became more casual and\nFermat\nactually revealed things to de Bessy concerning his mathematical methods that he refused to divulge to his other correspondents.\nWe shall look at some of the problems which were typical of those Frénicle worked on.\nOn\n3\nJanuary\n1657\nFermat\nmade a challenge to the mathematicians of Europe and England. He posed two problems\n(\nin words rather than using notation as we shall do\n)\ninvolving\nS\n(\nn\n)\nS(n)\nS\n(\nn\n)\n, the sum of the proper divisors of\nn\nn\nn\n:\nFind a cube\nn\nn\nn\nsuch that\nn\n+\nS\n(\nn\n)\nn + S(n)\nn\n+\nS\n(\nn\n)\nis a square.\nFind a square\nn\nn\nn\nsuch that\nn\n+\nS\n(\nn\n)\nn + S(n)\nn\n+\nS\n(\nn\n)\nis a cube.\nWe know that Frénicle found four solutions to the first of these problems on the day that he was given the problem, one of which is\n7\n3\n+\n(\n1\n+\n7\n+\n7\n2\n)\n=\n400\n=\n2\n0\n2\n.\n7^{3} + (1 + 7 + 7^{2}) = 400 = 20^{2}.\n7\n3\n+\n(\n1\n+\n7\n+\n7\n2\n)\n=\n4\n0\n0\n=\n2\n0\n2\n.\nHe found another six solutions the next day. He gave solutions to both problems in\nSolutio duorm problematum circa numeros cubos et quadratos, quae tanquam insolubilia universis Europae mathematicis a clarissimo viro D Fermat sunt proposita\nⓉ\n(\nOn the solution of the two problems on cubes and squares, posed by most distinguished Fermat to the mathematicians of Europe\n)\n(1657)\n. In this work, dedicated to Sir Kenelm Digby, he posed some problems of his own, including the following:\nFind an integer\nn\nn\nn\nsuch that\nS\n(\nn\n)\n=\n5\nn\nS(n) = 5n\nS\n(\nn\n)\n=\n5\nn\n, and\nS\n(\n5\nn\n)\n=\n25\nn\nS(5n) = 25n\nS\n(\n5\nn\n)\n=\n2\n5\nn\n.\nFind an integer\nn\nn\nn\nsuch that\nS\n(\nn\n)\n=\n7\nn\nS(n) = 7n\nS\n(\nn\n)\n=\n7\nn\n, and\nS\n(\n7\nn\n)\n=\n49\nn\nS(7n) = 49n\nS\n(\n7\nn\n)\n=\n4\n9\nn\n.\nFind\nn\nn\nn\nsuch that\nn\n3\n−\n(\nn\n−\n1\n)\n3\nn^{3} - (n - 1)^{3}\nn\n3\n−\n(\nn\n−\n1\n)\n3\nis a cube.\nFrénicle solved other problems posed by\nFermat\n. For example he showed that if a right angled triangle has sides of integer lengths\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nthen its area\n1\n2\nb\nc\n{1\\over2}bc\n2\n1\n​\nb\nc\ncan never be a square. He also showed that the area of a right angled triangle is never twice a square. He also looked at another problem posed by\nFermat\n, namely to find\nn\nn\nn\nsuch that\n(\nm\n.\nn\n2\n+\n1\n)\n(m.n^{2} + 1)\n(\nm\n.\nn\n2\n+\n1\n)\nis a square for non-square\nm\nm\nm\n. In the\nSolutio\nhe gave a table of solutions for all values of\nm\nm\nm\nup to\n150\n. He also explained the way that he had discovered these solutions. We note that the\nSolutio\nis the only publication of Frénicle in his lifetime although other memoirs by him were published after his death. We now look at these posthumous publications.\nUsing his great skill in combinatorial mathematics and in computation, Frénicle de Bessy worked on\nmagic squares\n. His two memoirs\nDes quarrez magiques\nⓉ\n(\nMagic squares\n)\nand\nTable générale des quarrez magiques de quatre de côté\nⓉ\n(\nGeneral table of\n4\nx\n4\nmagic squares\n)\nwere published in\n1693\n, nearly\n20\nyears after his death. In this work he listed\n880\nmagic squares of order\n4\n. In fact, this is the complete list of magic squares of order\n4\nbut Frénicle's papers do not prove this. It appears that a proof that there were exactly\n880\nmagic squares of order\n4\ndid not appear until\n1931\nwhen Friedrich Fitting\n(1862\n-\n1945)\npublished the paper\nRein mathematische Behandlung des Problems der magischen Quadrate von\n16\nund von\n64\nFeldern\nⓉ\n(\nPure mathematical treatment of the problem of magic squares of\n16\nand\n64\nsquares\n)\n. Frénicle also gave methods to find magic squares of any even order. These memoirs by Frénicle were two of four published in\nDivers ouvrages de mathématique et de physique\nⓉ\n(\nVarious mathematical and physical works\n)\n(1693)\n. The Preface to this book explains how Frénicle's manuscripts came to be published:-\nAfter the death of M Frénicle and M\nde Roberval\n, their working manuscripts were sent into the hands of M\nJean Picard\n, who kept them in his apartment at the Observatory with a corrected fair copy of all the observations of\nTycho Brahe\n; but at the end of the year\n1682\n, about seven years after the death of M\nde Roberval\n, M\nJean Picard\ndied, and the care of all the papers was given to M\nde la Hire\n, who, some time afterwards, joined to them the working manuscripts of\nM Jean Picard\nwhich had been rejected. ... M\nde la Hire\nexamined all the manuscripts that he had chosen ...\nThe other two manuscripts by Frénicle that were published in this volume were\nMethode pour trouver la solution des problèmes par les exclusions\nⓉ\n(\nMethod for the solution of problems by elimination\n)\nand\nAbregé des combinaisons\nⓉ\n(\nAbstract combinations\n)\n. These were chosen by\nde la Hire\nto be the first two in the published collection. The Preface explains why Frénicle's papers were put first:-\nM\nde la Hire\nchose to put first the treatise by M Frénicle on 'Exclusions' because it gave a particular method which is used for the solution of problems, by means of which he easily resolved very difficult issues in number theory and algebra over which often there was little control, which led to it being admired by scholars with whom he had dealings, as can be seen in several places in their works. He joined a treatise on 'Combinations', and then he decided that it was necessary to leave for another time several other works by M Frénicle, which all together would have made a very large volume, such as papers on prime numbers, another on polygonal numbers, one of tables of magic squares, and others: but to make it a more perfect volume, he added papers on magic squares; and he believed that the public would be glad to see that what had been published up to then by the ablest algebraists, was far removed from what M Frénicle had discovered on this matter.\nWe note that Frénicle's\nMethode pour trouver la solution des problèmes par les exclusions\nⓉ\n(\nMethod for the solution of problems by elimination\n)\npresents ten rules which he suggests are useful in solving mathematical problems. Rules are given to simplify problems and rules are given to make sure solutions are looked for in a systematic way so that nothing is missed. He then gives examples of how he has used these rules to solve certain specific problems. In particular he looks at finding right angled triangles when the difference or the sum of two of the sides are given. In many ways these rules emphasise the point that we made earlier about Frénicle being primarily a remarkable calculator, for these rules give essentially an experimental approach to finding integer solutions to specific number theory problems.\nAs we mentioned at the beginning of this article, Frénicle was elected as a founder member of the\nAcadémie Royale des Sciences\nin\n1666\n. He was extremely highly regarded by\nFermat\nwho wrote in\n1643\n:-\nThere is certainly nothing more difficult than this in the whole of mathematics and, except for M Frénicle and perhaps for\nM Descartes\n, I doubt if anyone understands the secret.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}