{
  "nome_completo": "Francesco Gerbaldi",
  "nome_curto": "Francesco Gerbaldi",
  "ano_nascimento": "1858",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gerbaldi/",
  "lugar_nascimento": "La Spezia (now Italy)",
  "lugar_morte": "Pavia, Italy",
  "biografia": "Francesco Gerbaldi\nattended the University of Turin, graduating in\n1879\n. After the award of his degree, he became an assistant to\nEnrico D'Ovidio\nwho occupied the Chair of Algebra and Analytic Geometry at the University of Turin. In\n1881\nGerbaldi published\nLa superficie di Steiner studiata sulla sua rappresentazione analitica mediante le forme ternarie quadratiche\nⓉ\n(\nThe surface of Steiner studied by its analytical representation by ternary quadratic forms\n)\nwhich contained his work on conic sections, projective geometry and projective planes. In\n1882\nhe published\nSui gruppi di sei coniche in involuzione\nin which he explains his construction of the so-called six mutually apolar conics. The paper contains the famous 'Theorem of Gerbaldi':\nThere exists a set of six mutually apolar linearly independent nondegenerate ternary quadratic forms.\nGerbaldi left Turin to spend time at the University of Pavia, and he also went to Germany to learn about the latest mathematical advances. He was appointed as an assistant at the University of Rome and, while he was there, he entered a competition for the Chair of Analytic and Projective Geometry at the University of Palermo. Filling chairs by competition was the standard method in Italy at this time. He was appointed to Palermo in\n1890\n.\nIn\n1884\n,\nGiovanni Guccia\nhad founded the\nCircolo Matematico di Palermo\n.\nGuccia\nprovided:-\n... the meeting place\n[\nfor the Society\n]\n, a library and all necessary funds. His generous offer was favourably received, and on\n2\nMarch\n1884\nthe society's provisional statutes were signed by twenty-seven members. The goal was to stimulate the study of higher mathematics by means of original communications presented by the members of the society on the different branches of analysis and geometry, as well as on rational mechanics, mathematical physics, geodesy, and astronomy.\nThe publication for the new society was the\nRendiconti del Circolo Matematico di Palermo\n. The Society soon lifted the status of mathematics at Palermo to a higher level and it was at this moment that Gerbaldi took up his chair. He did much to continue building the mathematics department at Palermo to greater heights. He led seminars and presented his students with the latest mathematical developments. Laura Martini writes\n[\n6\n]\n:-\nFrancesco Gerbaldi in Palermo presented for almost two decades beginning in the\n1890\ns, the most recent progress in mathematics in his courses and seminars. In particular, he introduced two talented students to the study of group theory;\nGiuseppe Bagnera\nand\nMichele Cipolla\nbecame two of the most remarkable Italian algebraists of their time.\nAmong his publications while at Palermo we mention a four part paper\nSul gruppo semplice di\n360\ncollineazione piane\nⓉ\n(\nOn the simple group of\n360\nflat collineations\n)\nwhich continued his investigations of the six mutually apolar conics had he constructed in\n1882\n. The first part appeared in\n1898\n, the second in\n1899\n, the third in\n1900\nand the fourth in\n1902\n. Marat Gizatullin writes\n[\n5\n]\n:-\nThe conics were used for a description of Valentiner's subgroup\nG\n360\nG_{360}\nG\n3\n6\n0\n​\nof\nA\nu\nt\n(\nP\n2\n)\nAut(P_{2})\nA\nu\nt\n(\nP\n2\n​\n)\n. As an abstract group,\nG\n360\nG_{360}\nG\n3\n6\n0\n​\nis isomorphic to the alternating group\nA\n6\nA_{6}\nA\n6\n​\nof even permutations of six symbols. Gerbaldi demonstrated that one can take the conics as the symbols, that is Valentiner's group interchanges the conics .... Moreover, the conics were used for a construction of a point-line configuration studied by Gerbaldi. The set of intersection points of distinct Gerbaldi's conics consists of\n60\npoints. From pure geometric consideration, without use of Gerbaldi's conics, the configuration was constructed by\nW Burnside\n, whose attention was concentrated on\n45\npoints of the dual plane. We will call it as the Gerbaldi-\nBurnside\nconfiguration.\nGerbaldi attended the first International Congresses of Mathematicians held in Zürich in\n1897\n. He lectured on\nSul gruppo semplice di\n360\ncollineazione piane\nⓉ\n(\nOn the simple group of\n360\nflat collineations\n)\nbeing one of only two participants to lecture in Italian: the other was\nGiuseppe Peano\n.\nVito Volterra\nchaired the session at which Gerbaldi spoke.\nRenato Calapso, the son of Gerbaldi's assistant Pasquale Calapso, describes Gerbaldi's personality in vivid terms in\n[\n2\n]\n:-\nShort and bitter, like February, dark face, closed and sullen, always unhappy, Gerbaldi appeared to me \"like a dark night.\" Lonely, childless and without a family, he seemed barren of feeling and not to suffer. Then I realized that this was not so. My father, who was his assistant for eight long years, was terrified of him, because, in truth, he was a kind of torturer. As a boy, when I saw him from afar, I changed direction. Yet the mathematics that he knew and which he tirelessly taught at Palermo, with zeal and with passion, was broad and bright as the sky. He brought to Sicily four disciples, almost the same age, who achieved great fame:\nGiuseppe Bagnera\n, Pasquale Calapso,\nMichele de Franchis\nand Michele Cipolla. Gerbaldi finally departed from Palermo for Pavia in the autumn of\n1908\n. I with my father, only the two of us, accompanied him to the steamer. We proceeded quietly and silently in the starry night until we reached the slight lapping of waves and the acrid smell of algae. The seething dark sea with the coast in the distance twinkled with the lights the city. Gerbaldi embraced my father for the last time, and murmured, \"My life is over.\" He cried. Then I took his hand and I kissed him, repeatedly bathing his tears. He said, \"My life is over.\" He left. We slowly returned home, almost staggering, dumb and silent, behind the shadows of the night. Our friend still lived a quarter of a century, but did nothing: his fate was to be a great teacher, but only in the land of Sicily.\nGerbaldi's departure from Palermo for Pavia in\n1908\nis vividly described in the above quote. He remained as professor at Pavia until he retired due to ill health in\n1931\n. While in Pavia, he collaborated with\nGino Loria\nto edit a volume of papers to honour Enrico D'Ovidio on his retirement. The Preface to the volume\nScritti Matematici Offerti Ad Enrico D'Ovidio In Occasione Del Suo LXXV Genetliaco,\n11\nAgosto\n1918\nwas written by the editors and says as much about the feelings of the authors as it does about\nD'Ovidio\n:-\nOn the approach of the day on which an inflexible law would retire Senator\nEnrico D'Ovidio\nfrom the university chair, there arose in the minds of many students whom he has had in his long and glorious career as a teacher, the pleasant idea of choosing this occasion - which coincides with his\n75\nth\nbirthday - to manifest to him their sentiments of unalterable affection and, at the same time, to present to him their sincere good wishes ad multos annos. ... And we are certain that to the loved teacher our publication will be doubly gratifying in as much as it serves also to show how Italy, in the tragic hours in which we live - not less than in the more grave and decisive periods of her earlier struggles for redemption - has not ceased to feed the sacred flame of science.\nThe longest paper in the volume is by Gerbaldi himself. This is the paper\nLe frazione continue di Halphen\nand it was one of a series of three papers which Gerbaldi wrote on the continued fractions of\nGeorge-Henri Halphen\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}