{
  "nome_completo": "Franciszek Hugon Szafraniec",
  "nome_curto": "Franciszek Szafraniec",
  "ano_nascimento": "1940",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szafraniec/",
  "lugar_nascimento": "Świętochłowice, Upper Silesia, Poland",
  "lugar_morte": null,
  "biografia": "Franciszek Szafraniec\nwas born in Silesia only a few months after Poland had been invaded by Germany at the start of World War II. Silesia had a population that was divided between German speaking people\n(\nmostly in the towns\n)\nand Polish speaking people\n(\nmainly in the country\n)\nand whether it should be part of Germany or part of Poland had been disputed following World War I. Eventually it had been divided with the part in which Szafraniec was born becoming a part of Poland. This part of Silesia had most of Silesia's coal and steel production. The authors of\n[\n1\n]\nwrite:-\n[\nSzafraniec's\n]\nhome town Świętochłowice, mostly inhabited by coal miners as well as steel and zinc workers, has impacted his attitude for the rest of his life. Those common people are valued for their reliability, sincerity and a clear sense of humour. Though the environment he grew up in might seemingly be in contrast to his liberal arts profile education all this together blended in creating a mighty personality of the man we know now.\nAfter graduating from secondary school, it was still unclear which topic Szafraniec would study at university. Moreover, it was unclear which university he would study at. Szafraniec's father wanted his son to study in Kraków while his mother would have preferred her son to go to the more local Wrocław University. After some deliberations, a decision was made at the last minute that Szafraniec would apply to study mathematics at the Jagiellonian University in Kraków. He was offered a place and began his undergraduate studies there. He attended lectures by\nTadeusz Ważewski\nwho had taught at the Jagiellonian University before World War II and had then returned there after it was liberated in\n1945\nputting great efforts into restoring the educational system which had been destroyed during the German occupation.\nWażewski\nhad built an important seminar at the Jagiellonian University which was mainly devoted to the study of differential equations. He was famed for his topological approach to the study of differential equations, and had obtained remarkable results applying\nBorsuk\n's theory of retracts. Szafraniec became a member of\nWażewski\n's school and, after his undergraduate studies, undertook research advised by\nWażewski\n. He was awarded a Master's degree\n(\nequivalent to a Ph.D.\n)\nin\n1968\nfor a thesis on the theory of differential equations. The papers he wrote while he was undertaking research included:\nOn a certain sequence of ordinary differential equations\n(1963)\n;\n(\nwith Andrzej Lasota\n)\nSur les solutions périodiques d'une équation différentielle ordinaire d'ordre n\nⓉ\n(\nOn periodic solutions of ordinary differential equation of order n\n)\n(1966)\nand\n(\nwith Andrzej Lasota\n)\nApplication of the differential equations with distributional coefficients to the optimal control theory\n(1968)\n.\nIn fact this paper on control theory marked a change in topic for Szafraniec and the authors of\n[\n1\n]\nexplain how this came about:-\nThis happened to Szafraniec on a sunny June day in\n1968\nwhen he met Wlodzimierz Mlak\n(1931\n-\n1994)\n, also a member of the Ważewski seminar, on the Main Market Square in Kraków. After a long coffee session in a nearby café he got converted to the theory of operators. This way operators entered his mathematical life and, in other words, a seed of operator theory was sowed on the Kraków soil. The passion which both of them had for this branch of mathematics was shared by their students and passed on to subsequent generations of mathematicians. This way Kraków became a vital world centre of modern operator theory. The co-workers and former students of Professor Szafraniec may be found in all major Kraków universities.\nLet us note that Wlodzimierz Mlak had been a student at the Jagiellonian University with\nCzeslaw Olech\n, Zdzisław Opial\n(1930\n-\n1974)\nand Jan Bochenek\n(1927\n-\n2009)\n, all of whom were appointed as assistants and went on to become professors of mathematics. Szafraniec worked at the Jagiellonian University in Kraków for his whole career. He was awarded his doctorate\n(\nequivalent to the\nhabilitation\n)\nin\n1971\nand he became a professor in\n1980\n. The authors of\n[\n1\n]\nsummarise his mathematical contributions:-\nOut of his many noticeable results, we mention a few: simplified forms\n(\nincluding the diagonal one\n)\nof the boundedness condition in the famous Szokefalvi-Nagy general dilation theory together with related integral representations of exponentially bounded operator-valued functions on abelian *-semigroups\n(\nunfortunately often attributed exclusively to a paper by Berg and Maserick, which appeared later\n)\n, foundations of the theory of unbounded subnormal operators\n(\ntogether with Jan Stochel\n)\n, new solutions to multidimensional real and complex moment problems\n(\ntogether with Jan Stochel\n)\n, fresh look on interpolation theory, three term recurrence relations for orthogonal polynomials of several variables\n(\ntogether with Dariusz Cichon and Jan Stochel\n)\n, and advances in the theory of quantum harmonic oscillators and canonical commutation relations. Professor Szafraniec's interests and activities in the mathematical world, together with his capability of co-operating, bears fruit in many publications which encompasses numerous joint papers with dozens of mathematicians.\nIn fact MathSciNet lists\n123\nitems by Szafraniec\n(\nin July\n2013)\n,\n36\nof which are papers presented at conferences. In fact he has attended a vast number of conferences, from China to Mexico and from Chile to South Africa, all of which enriched his main research interest in\nHilbert\nspace methods. To illustrate the conferences at which he has spoken and the invited talks he has given at these conferences we give a few examples. At the\n1997\nworkshop 'Special functions and differential equations' held at Madras\n(\nnow Chennai\n)\nin India, he gave the talk\nThe quantum harmonic oscillator in\nL\n2\n(\nR\n)\nL^{2}(\\mathbb{R})\nL\n2\n(\nR\n)\nin which he introduced the\nHilbert\n-space model of the quantum harmonic oscillator couple of the creation and annihilation operators, he obtained some new interrelations between these operators. At the conference 'Topological algebras, their applications, and related topics' held in Bedlewo, Poland in\n2005\nhe gave the lecture\nSubnormality and cyclicity\n. In the same year at the University of Vaasa in Finland he gave the lecture\nA matrix algorithm towards subnormality of unbounded operators\nat the 'Algorithmic Information Theory Conference'. In\n2006\nhe attended two conferences, 'Operator theory and indefinite inner product spaces' at the Vienna University of Technology, Vienna, Austria and 'Operator theory in Krein spaces and nonlinear eigenvalue problems' at the Technical University of Berlin, Germany. At the first he gave the lecture\nOn normal extensions of unbounded operators. IV. A matrix construction\nwhile at the second he gave the lecture\nBounded normal operators in Pontryagin spaces\n. The first of these when written up for the proceedings became the fourth in a series of papers\nOn normal extensions of unbounded operators\nsome of which were written with Jan Stochel, one of his colleagues at the Jagiellonian University. In fact Szafraniec has written\n24\njoint papers with Jan Stochel\n(\nas of July\n2013)\n. Szafraniec has been as editor for the Proceedings of the semester long workshop\nLinear operators\nheld in Warsaw in the Spring of\n1994\n. He has also been an editor of the\n2012\nmonograph\nOperator methods for boundary valve problems\nto which he contributed the chapter\nNaimark dilations and Naimark extensions in favour of moment problems\n.\nSzafraniec retired from his professorship at the Jagiellonian University in\n2010\nwhen he reached the age of seventy. A conference 'Functions and Operators' was held in Kraków in\n2010\nto celebrate his\n70\nth\nbirthday.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Topology"
  ]
}