{
  "nome_completo": "François Nicolas Cosserat",
  "nome_curto": "François Cosserat",
  "ano_nascimento": "1852",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cosserat_Francois/",
  "lugar_nascimento": "Douai, France",
  "lugar_morte": "France",
  "biografia": "François Cosserat\n's father was François-Constant Cosserat who was a well-off entrepreneur who was based in Amiens. François-Constant had three sons, François-Nicolas\n(\nthe subject of this biography\n)\n, Lucien-Constant, and\nEugène Cosserat\n(\nwho also has a biography in this archive\n)\n. François-Nicolas, born in\n1852\n, was the eldest of the sons, Lucien-Constant, born in\n1856\n, was the middle son, while Eugène, born in\n1866\n, was the youngest and twelve years younger than his eldest brother François. Lucien-Constant succeeded in the competition for admission to the École Polytechnique in\n1875\n, but died relatively young in\n1897\n, while working for the Railway Company of the West.\nFrançois Cosserat entered the École Polytechnique in\n1870\nwhen his youngest brother Eugène, with whom he would later collaborate, was only four years old. The examination for entry to the École Polytechnique was highly competitive and François was ranked twenty-sixth among the successful candidates in that year. He graduated in\n1872\n, ranked twentieth in the list of\n141\nstudents who graduated in that year. Along with seventeen other graduates from the École Polytechnique, Cosserat opted to continue his training at the École Nationale des Ponts et Chaussées. There he trained in engineering, specialising in civil engineering. After three years of study, he graduated in\n1875\nas a Civil Engineer Third Class. He was ranked ninth among those who graduated in that year and began working in the public sector involved in construction work.\nIn\n1878\n, Cosserat married; the only child of the marriage was a daughter Amélie Adèle who married the marine engineer Édouard-Victor Davaux\n(1876\n-\n1950)\n. Cosserat became a Railway Engineer Second Class\n(\nNorthern Zone\n)\nin\n1879\n. His work comprised building railway tracks, tunnels and bridges. In\n1883\nhe was promoted to Civil Engineer First Class and, on\n1\nFebruary of the following year, he moved to work for the Railway Company of the East, for whom he continued to work for the remainder of his career. In\n1895\nhe was promoted to Chief Engineer Second Class.\nThe details we have given show that Cosserat had a highly successful career as a civil engineer. However, what is remarkable is that he was able to undertake top quality mathematical research while having a career which meant that he was totally isolated from other mathematicians and scientists. Of course, his brother\nEugène Cosserat\nwas an academic in Toulouse and François Cosserat published many outstanding joint works with his brother. It is tempting to believe, therefore, that\nEugène Cosserat\nwould be the major player in their joint research but this would be far from the truth. In fact during the period of their close collaboration,\nEugène Cosserat\nwas burdened by heavy administrative tasks and was only a very minor contributor. Pommaret writes in\n[\n2\n]\nthat:-\n... the main creative mechanical ideas\n(\nthe most striking behind the computations\n)\nhave been furnished by François, while Eugène, overburdened by management tasks at the Observatory of Toulouse, was just rectifying the computations. Indeed when one gets the basic definitions and provides the variational methods, the main problem is to give them a physical meaning. Also, Eugène was still in a good position for publishing the results announced in\n[\nearlier joint publications\n]\nafter the death of his brother. However, nothing on mechanics was published after\n1914\n! Meanwhile, it is painful to know that, when François asked for a position in mechanics at the École Polytechnique, in competition with\nHadamard\n(\nsupported by\nPainlevé\n)\nand Jouguet, somebody pointed out doubts on his participation in this work in collaboration, and finally ... Jouguet was elected!\nFrançois Cosserat's contributions as a mathematician were noted, however, in the annual reports on his work as a civil engineer. For example, the report written on\n27\nJune\n1898\nstates, \"M François Cosserat is a distinguished engineer who has high practical experience. In addition to his normal position, he devotes himself to theoretical studies and he recently presented to the\nAcadémie des Sciences\nremarkable works on mechanics.\" The report of\n11\nOctober\n1910\nstates, \"M François Cosserat is a valued collaborator, highly efficient, especially in public works. He is known among the scientific community as the author of remarkable studies on questions of mathematics and mechanics.\" The report of\n20\nOctober\n1913\nstates, \"M François Cosserat has high competence for building tunnels, bridges, ... and he is also a distinguished mathematician, President of the\nFrench Mathematical Society\n. He contributed this very year to the quick completion of many military works.\"\nFrom this last quote we see that François Cosserat was President of the\nSociété Mathématique de France\n. In fact he was elected Vice-President of the Society in\n1912\nand then became President in the following year. These, however, were not the only honours bestowed on him. He was made a Knight of the Légion d'Honneur in\n1893\n, and was elected to the\nAcadémie des Sciences\nin\n1896\n. It is now time to consider his mathematical contributions.\nCosserat began his mathematical studies considering a theory of elasticity but went on to consider broad questions concerning mechanics particularly relating to gravitational, electrical and thermal phenomena. This work was carried out in collaboration with his brother,\nEugène Cosserat\n, who was, at the time the collaboration began, professor of differential and integral calculus at the University of Toulouse. This collaboration between the two Cosserat brothers began in\n1896\nwith the publication\nThéorie de l'élasticité\nⓉ\n(\nElasticity Theory\n)\n. This first work studied broad questions relating to the foundations of mechanics but later their work turned towards the physical theory. By the early\n1900\ns both Cosserat brothers were devoting all their research efforts towards working on mechanics. Their most important joint publications are:\nNote sur la cinématique d'un milieu continu\nⓉ\n(\nNote on the kinematics of a continuous medium\n)\n(1897)\n;\nNote sur la dynamique du point et du corps invariable\nⓉ\n(\nNote on the dynamics of development and the invariable body\n)\n(1906)\n;\nNote sur la théorie de l'action euclidienne\nⓉ\n(\nNote on the theory of Euclidean action\n)\n(1909)\n; and the book\nThéorie des corps déformables\nⓉ\n(\nTheory of deformable bodies\n)\n(1909)\n. The first of these was published as an addition to\nGabriel Koenigs\n'\nLeçons de Cinématique professées à la Sorbonne : cinématique théorique\nⓉ\n(\nKinematics lessons taught at the Sorbonne: Theoretical Kinematics\n)\n. A review of this work by E O Lovett in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1900\nsingles out the Cosserats' contribution:-\nThe introduction of this note is peculiarly fortunate for it is high time that kinematics should comprehend the study of deformation and of deformable spaces. The authors have included in their extract certain generalities on curvilinear coordinates, the deformation of a continuous medium in general, infinitely small deformation, use of the mobile trieder, and the case where the non-deformed medium is referred to any curvilinear coordinates.\nThis innovative work on mechanics\n(21\njoint publications on this topic are listed in\n[\n3\n]\n)\nended with the François Cosserat's death in\n1914\n, after which time his brother\nEugène Cosserat\npublished nothing further on the topic. Jacques Levy describes the two Cosserats' contributions to this area\n[\n1\n]\n:-\nThe most practical results concerning elasticity were the introduction of the systematic use of the movable trihedral and the proposal and resolution, before\nFredholm\n's studies, of the functional equations of the sphere and ellipsoid. The Cosserats theoretical research, designed to include everything in theoretical physics that is directly subject to the laws of mechanics, was founded on the notion of Euclidean action\n[\nleast action\n]\ncombined with\nLagrange\n's ideas on the principle of extremality and\nLie\n's ideas on invariance in regard to displacement groups. The bearing of this original and coherent conception was diminished in importance because at the time it was proposed, fundamental ideas were already being called into question by both the theory of relativity and progress in physical theory.\nThe authors of\n[\n4\n]\nwrite:-\nThe Cosserat brothers, following a suggestion by\nDuhem\n(1893)\n, developed a theory for continuous oriented bodies that consist not just of particles\n(\nor material points\n)\n, but also of directions associated with each particle. Thus, in addition to the field of position vectors of a continuum in a given configuration, one also admits vector fields ... which may be chosen so as to represent pertinent features of materials. ... The Cosserats themselves recognised the value of oriented two-dimensional continua\n(\ni.e., curves and surfaces endowed with additional structure in the form of directors\n)\nfor representing the deformations of rods and shells respectively. ...\n[\nHowever their\n]\nideas on the subject\n[\nwere\n]\nignored for half a century.\nPommaret, in\n[\n2\n]\n, looks at the reception of the Cosserats' contributions:-\n... among their contemporaries, only\nHenri Poincaré\n(\nelectron theory\n)\n,\nÉmile Picard\n(\nsurprisingly\n)\nand\nÉlie Cartan\nappreciated the work done by the brothers. Exceptions are also colleagues of\nEugène Cosserat\nin Toulouse, like L Ray and A Buhl.\n(\nIndeed the work of Buhl is a patching of mathematical analogies, far from physics.\n)\nIt is only in Germany that the brothers got disciples like Karl Heun who quoted them with emphasis in the German edition of the 'Encyclopédie des Sciences Mathématique' and studied their work in a seminar at Karlsruhe in\n1909\n. Then ... Relativity Theory and Quantum Physics overtook this period in science and the work of E and F Cosserat was almost rediscovered after\n1950\nbecause of the use of liquid crystals.\nIn addition to his mathematical research, François Cosserat made other contributions to mathematics through his expertise in languages. He spoke Russian, as did his son-in-law Édouard-Victor Davaux, and both contributed translations of Russian mathematical works into French. François Cosserat also began translating\nElementary Principles in Statistical Mechanics\n(1902)\nby\nJ Willard Gibbs\nfrom English to French but died before completing the task. The translation was completed after his death but the French version of this classic did not appear until\n1932\n. The Cosserat brothers François and Eugène also collaborated in translating the article on mechanics from the German\nEncyklopädie der mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of Mathematical Sciences\n)\nfor a French version of this monumental classic work. However, they did not just make a translation, they added a very large amount of new material of their own showing their great appreciation of the history and philosophy of the subject.\nAfter François Cosserat died,\nErnest Vessiot\nsucceeded him as President of the\nSociété Mathématique de France\n.\nVessiot\nspoke about the collaboration between the two Cosserat brothers\n(\nsee\n[\n3\n]\n)\n:-\nIt would be indiscreet and foolhardy to identify in this collaboration, whose mystery is touching, what is due to one or the other of the two brothers; to find which particular one or other gives the qualities which distinguish these works: the geometric ingenuity and elegance, the analytical ability, the depth of the guiding ideas, and their power of adaptation to mechanical and physical applications. Let us just see how fruitful it was, and to greet respectfully at a time when death brought it to an end, before it had borne all the fruits that could be expected.\nIt is now clear that the qualities that\nVessiot\nsaw so clearly in their joint work were almost all due to François Cosserat.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}