{
  "nome_completo": "Francis Ysidro Edgeworth",
  "nome_curto": "Francis Edgeworth",
  "ano_nascimento": "1845",
  "ano_morte": "1926",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Edgeworth/",
  "lugar_nascimento": "Edgeworthstown, County Longford, Ireland",
  "lugar_morte": "Oxford, England",
  "biografia": "Francis Edgeworth\n's parents were Rosa Florentina Eroles, who was Spanish, and Francis Beaufort Edgeworth, who came from an Irish family with strong literary connections. His grandfather was Richard Lovell Edgeworth, an author, inventor and educationalist who was married four times and had\n22\nchildren. Among these\n22\nchildren were Edgeworth's father and also Maria Edgeworth who was well known as a writer of children's stories and also for novels about life in Ireland. Richard Lovell Edgeworth had an estate at Edgeworthstown, northwest of Dublin, and it was on this estate that Edgeworth was born.\nFrancis Ysidro Edgeworth was originally named Ysidro Francis Edgeworth but transposed his forenames. He was the youngest of his parents five sons and when he was only two years old his father died. Two years later Maria, who also lived on the estate, also died. He did not attend school, but was educated by private tutors in his own home until he reached the age to enter university.\nAt this stage in his life Edgeworth had no particular interest in mathematics. He came to study statistics after only after his university education had finished; his interests at university were in ancient and modern languages. He entered Trinity College, Dublin at the age of\n17\nand studied French, German, Spanish and Italian. After graduating, he was awarded a scholarship to study at Oxford and he entered Exeter College in January\n1867\n. At Oxford he spent some time at Magdalen and at Balliol, graduating in\n1869\n.\nExactly what Edgeworth did in the years after leaving Oxford is unclear but certainly he lived in London with little financial support. One important influence from this period was\nJevons\nwho was a friend and near-neighbour of Edgeworth. He must have studied law at some time since he was called to the Bar in\n1877\n. Three years later, however, he was lecturing on logic at King's College, London. In\n1888\nhe was appointed Professor of Political Economics at King's College, London and, two years later, he was appointed to the Tooke chair of Economic Science.\nThe surprising part is that somewhere in this varied career Edgeworth studied mathematics. We have to assume that he was self-taught in mathematics and this might explain why he seemed to believe that advanced mathematics was understood by all. For example his first serious publication\nNew and old methods of\nethics\n(1877)\nis described by\nKendall\nin\n[\n7\n]\nas follows:-\nNone of his writings, at any time in his life, consisted of the kind of prose, or orderly presentation of ideas, which give pleasure for their own sake, and in this particular work he actually writes down variational integrals, which must have put it beyond the understanding of most of those who were interested in ethical problems at that time.\nIn\n1881\nhe published\nMathematical Psychics: An Essay on the Application of Mathematics to the Moral Sciences\n. This work, really on economics, looks at the Economical Calculus and the Utilitarian Calculus. In fact most of his work could be said to be applications of mathematical psychics which Edgeworth saw as analogous to mathematical physics. They were applied to the measure of utility, the measure of ethical value, the measure of evidence, the measure of probability, the measure of economic value, and the determination of economic equilibria. He formulated mathematically a capacity for happiness and a capacity for work. His conclusions that women have less capacity for pleasure and for work than do men would not be popular today.\nEdgeworth published\nMethods of Statistics\nin\n1885\nwhich presented an exposition of the application and interpretation of significance tests for the comparison of means.\nIn\n1891\nEdgeworth left London to take up the Drummond Chair of Political Economy at Oxford. He obtained a fellowship at All Souls College and he held both the chair and the fellowship until he retired in\n1922\n. Another event of significance in\n1891\nwas that the\nEconomic Journal\nbegan publication with Edgeworth as its first editor. This journal was the publication of the Royal Economic Society which had been set up in\n1890\nwith Edgeworth appointed as secretary to the Society. However\n[\n2\n]\n:-\n... his extensive knowledge of economics and economists in all countries, and his great industry and keen interest, were coupled with a complete innocence of business and administrative affairs.\nHe continued to be editor until\n1926\nwhen\nKeynes\ntook over the editorship.\nIn\n1892\nEdgeworth examined correlation and methods of estimating correlation coefficients in a series of papers. The first of these papers was\nCorrelated Averages\n.\nEdgeworth's work was to influence\nPearson\nalthough bad feeling developed between the two and later\nPearson\nwas to deny Edgeworth's influence. At the\nGalton\ndinner in February\n1926\nPearson\nspoke of Edgeworth's death a few days earlier:-\n... him we can almost call a biometrician for he contributed to Biometrika ... Only last December he came and spoke as he had always spoken ... and his criticism failed as it had always failed, because he spoke not the language of the people. ... I should like to reckon him among the biometricians if he ploughed always right across the line of our furrows. Besides we owe him something, like a good German he knew that the Greek k is not a modern c, and, if any of you at any time wonder where the k in Biometrika comes from, I will frankly confess that I stole it from Edgeworth. Whenever you see that k call to mind dear old Edgeworth.\nIn\n[\n2\n]\nthere is an excellent description of his character and interests:-\nEdgeworth was unmarried. He was an insatiable reader, but his love of walking, mountaineering, golf, and boating, with his strict and regular habits, maintained to the last his wonderful vitality. Every summer, even at the age of\n80\n, he used to bathe at Parson's Pleasure before breakfast, and he would often be seen riding his bicycle in the country round Oxford or playing on the course at Cowley. But as a walker he was perhaps most indefatigable; and he was the life and soul of those Sunday tramps which have for years been a custom of his College. To a courtly grace, derived perhaps from his Spanish mother, he added the Irish characteristics of humour, imagination and generosity. A lifelong friend has never known him to be out of temper or speak ill words of others. In his sweetness and light were well combined. He was the merriest of men, and seemed to possess the secret of perpetual youth, both of mind and of body.",
  "math_areas": [
    "Calculus",
    "Logic",
    "Statistics"
  ]
}