{
  "nome_completo": "Frank Nelson Cole",
  "nome_curto": "Frank Cole",
  "ano_nascimento": "1861",
  "ano_morte": "1926",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cole/",
  "lugar_nascimento": "Ashland, Massachusetts, USA",
  "lugar_morte": "New York, USA",
  "biografia": "Frank Cole\n's parents were Frances Maria Pond and Otis Cole who came from a family which had been living in Rehoboth, Massachusetts, since the\n17\nth\ncentury. Otis Cole was a farmer, a dealer in lumber having an involvement in manufacturing, who also had an interest in mathematics. After Frank graduated from High School in Marlboro, Massachusetts, he was privately tutored before he entered Harvard University in\n1878\n. There his ability was recognised at once and he was awarded scholarships which not only helped him while studying for his A.B., awarded in\n1882\n, but also a Parker Travelling Fellowship which paid for him to visit Leipzig during\n1883\n-\n85\nwhen he studied under\nKlein\n. The period spent with\nKlein\nwas very profitable despite\nKlein\n's health being poor during this time when he suffered badly from depression. Cole also spent some time at Göttingen during these years spent in Germany and met there his future wife.\nCole returned to Harvard and wrote a thesis\nA Contribution to the Theory of the General Equation of the Sixth Degree\nwhich, as the title indicates, studied equations of degree\n6\n. The topic had been suggested to him by\nKlein\nwho was effectively his thesis supervisor. Cole presented this thesis to Harvard University, not to Göttingen University, for his Ph.D. which was awarded in\n1886\n. While he completed writing his doctoral thesis, Cole had already begun to lecture at Harvard and he continued to lecture there until\n1887\n. During the year\n1887\n-\n88\nCole was a tutor at Harvard, then in the summer at the end of that academic year he married Martha Marie Streiff of Göttingen on\n26\nJuly; they had one daughter and three sons. In October\n1888\nhe was appointed instructor at the University of Michigan, being promoted to assistant professor in the following year.\nIn\n1895\nCole was appointed professor at Columbia University, a post which he held until his death. Soon after he arrived at Columbia University he was appointed as Secretary of the\nAmerican Mathematical Society\nand he held this post from\n1896\nuntil\n1920\n. This was not his only work for the\nAmerican Mathematical Society\nfor in\n1897\nhe was appointed as Editor-in Chief of the\nBulletin of the American Mathematical Society\n,  holding this position until just before his death. He was vice president of the Society in\n1921\nbut although he was offered the honour of being president of the\nAmerican Mathematical Society\n, he turned it down.\nHis main research contributions are to\nnumber theory\n, in particular to\nprime numbers\n, and to\ngroup theory\n. In number theory he achieved the distinction of being the first to factor\n2\n67\n−\n1\n2^{67} - 1\n2\n6\n7\n−\n1\nand he did this using quadratic remainders. In fact\n2\n67\n−\n1\n=\n147573952589676412927\n=\n761838257287\n×\n193707721\n2^{67} - 1 = 147573952589676412927 = 761838257287 \\times  193707721\n2\n6\n7\n−\n1\n=\n1\n4\n7\n5\n7\n3\n9\n5\n2\n5\n8\n9\n6\n7\n6\n4\n1\n2\n9\n2\n7\n=\n7\n6\n1\n8\n3\n8\n2\n5\n7\n2\n8\n7\n×\n1\n9\n3\n7\n0\n7\n7\n2\n1\nwhich a computer will compute in a few seconds today. His contributions to factoring large numbers was published in\n1903\n. His output of research papers was, however, fairly modest and he published only around\n25\npapers during his career. These publications include his doctoral dissertation in\n1886\nand a discussion of the icosahedron in\n1887\n. He published\nThe linear functions of a complex variable\nin the\nAnnals of Mathematics\nin\n1890\nthen, between the years\n1891\nto\n1893\n, he found the complete list of simple groups with orders between\n200\nand\n600\n. Another publication worth mentioning is\nThe triad systems of thirteen letters\nwhich he published in the\nTransactions of the American Mathematical Society\nin\n1913\n.\nAnother important contribution to the theory of groups made by Cole was his work in publishing his English translation of\nNetto\n's book on group theory. This appeared as\nThe theory of substitutions and its applications to algebra\n(\nA A Register Publishing Company,\n1892)\nand was undertaken with\nNetto\n's agreement. In fact\nNetto\nrevised the German text of his book so that the English translation by Cole could incorporate some improvements. It was the first book on group theory in English and was important in stimulating interest in group theory in the English speaking world. It was reprinted in\n1964\n.\nAs a lecturer Cole was described as \"truly inspiring\" by\nOsgood\n, who was not in general one to give praise easily. He brought the latest mathematical research topics to his lectures and was a major factor in improving mathematical education at Harvard.\nOsgood\nand\nM Bôcher\nwere among his students.\nHe established the Frank Nelson Cole Prizes in algebra and number theory and today these are highly prestigious awards. The way this came about was that when Cole ended his spell of twenty-five years of secretarial and editorial duties for the\nAmerican Mathematical Society\nhis fellow members of the Society were so appreciative of his contributions that they collected money to give him to show their recognition. It was this money that he chose not to accept, but to return it to the Society to set up the prize.\nCole is described by\nDavid Smith\nin\n[\n5\n]\nas follows:-\nAs a man Cole was admired by all who penetrated a certain reserve that was natural to him, as an executive he was faithful to every duty, as a teacher he was lavish of the time that he would give to those who proved their worth, and as a friend he was loyal to the last. He loved to take long walks in the country studying trees and wild flowers.\nIn fact Cole took his love of trees and wild flowers from his father, and in fact, as we mentioned near the beginning of this article, inherited his love of mathematics from the same source.\nThe biographical details we have given suggest that Cole's life was a rather straightforward one of devotion to mathematics and his family. However after he died a strange story came to light which has never been fully explained. Zund relates details in\n[\n6\n]\n:-\nIn\n1926\nCole announced his intention to retire from Columbia in September of that year. However in late May, following surgery for an infected tooth, he died of heart failure at his home in New York City. Subsequently, it became known that he had been estranged from his family since\n1908\n, and for the last two years he had lived in the Bronx under the assumed name of Edward Mitchell and pretended to be an \"ordinary bookkeeper\". The reason's for Cole's unusual behaviour, which generated much comment and speculation, were only partially explained after his death.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}