{
  "nome_completo": "Francesco Siacci",
  "nome_curto": "Francesco Siacci",
  "ano_nascimento": "1839",
  "ano_morte": "1907",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Siacci/",
  "lugar_nascimento": "Rome (now Italy)",
  "lugar_morte": "Naples, Italy",
  "biografia": "Francesco Siacci\ngraduated from the University of Rome in\n1860\nhaving already shown himself to have remarkable mathematical abilities. However this was a period of instability in Italian affairs and Siacci was deeply involved with the political events of the time.\nThe year\n1860\nwas the year of Italian unification. Rome and its surroundings were to remain under the control of the Pope while the rest of the Italian peninsula was to become one kingdom with a moderate constitution. Victor Emmanuel II was declared \"king of Italy\" on\n26\nOctober\n1860\n. The parliament in Turin declared that the Kingdom of Italy had come into being on\n17\nMarch\n1861\n. The position of Rome presented problems and, for Siacci based in Rome, this was not the place to be. He moved to Turin in\n1861\nand enlisted in the army when he arrived there.\nSince Siacci was already an excellent mathematician it was felt that he could make the best contribution to the army at the Military Academy in Turin. He was made an officer in the army and remained at the Academy until the outbreak of trouble in\n1866\n.\nIn June\n1866\na war broke out between Austria and Prussia and the Italian government saw it as a good opportunity to attack the Austrians in Venetia. Siacci took part in this campaign against the Austrians but was quickly sent back to teach ballistics at the Military Academy in Turin before the campaign ended. It was not a successful military campaign for the Italians and it was perhaps fortunate for Siacci that he returned to an academic post.\nSiacci taught mechanics at the University of Turin from\n1871\n. In\n1872\nSiacci was promoted to Professor of Ballistics at the Military Academy and he continued to hold this post until his army career ended in\n1892\nby which time he had reached the rank of major general. From\n1875\nhe held a Professorship at the University of Turin in Higher Mechanics.\nIn\n1893\nSiacci was rewarded for his support for Italy by being appointed to the office of Senator in Rome. Turin was too long a journey from Rome to make it possible for Siacci to act as a Senator and hold his professorship in Turin. He therefore requested a transfer to the University of Naples. This was agreed: Siacci was made an Honorary Professor at Turin where\nVolterra\nwas invited to fill his position, and Siacci taught at Naples for the rest of his life.\nIn\n[\n1\n]\nhis mathematical contributions are given:-\nSiacci is said to have been an excellent teacher, both at the university and at the Military Academy. He left some hundred publications, the most important being those concerned with analytic mechanics. In the application of mechanics to artillery - ballistics - he was a master. His treatise on this subject, especially the second edition of\n1888\n, which had a French translation in\n1891\n, was considered masterly. He received many honours during his lifetime, including election to most of the important scientific academies of Italy.",
  "math_areas": []
}