{
  "nome_completo": "Frank Elmore Ross",
  "nome_curto": "Frank Ross",
  "ano_nascimento": "1874",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ross_Frank/",
  "lugar_nascimento": "San Francisco, California, USA",
  "lugar_morte": "Altadena, Los Angeles County, California, USA",
  "biografia": "Frank Elmore Ross\nwas the son of Daniel Walter Ross and Catherine Harris\n(\nknown as Cassie\n)\n. Daniel Ross was born in Scotland in\n1833\nand emigrated to the United States. He married Cassie Harris on\n7\nSeptember\n1871\n, in Delaware, Iowa and by\n1873\nthey were living on Broadway in San Francisco, California. Daniel Ross was a carpenter who, according to\n[\n8\n]\n, \"lost a fortune during the gold mine boom.\" Daniel and Cassie Ross had two children: Frank Elmore Ross\n(\nborn\n2\nApril\n1874)\n, the subject of this biography; and Walter Newton Ross\n(\nborn on\n1\nDecember\n1875)\n. Walter Ross married Emma R St Clair on\n2\nAugust\n1905\n. He worked for the US Government as a computer and later as a draftsman. He died on\n27\nMarch\n1957\n, in San Diego. We shall say a little more about Walter Ross in what follows.\nAccording to\n[\n8\n]\n, Frank Ross's:-\n... family moved to San Rafael around\n1882\n, where he went to grammar school and worked part time in a printer's shop.\nSeth Nicholson, however, states\n[\n9\n]\n:-\nFrank Ross was born in San Francisco on April\n2\n,\n1874\n, and received his early education in the schools of that city.\nWe have not been able to confirm which of these is correct. If he did attend school in San Rafael, which we think is most likely, then he would have been a pupil at the grammar school on Fourth and Shaver Streets and then at San Rafael High School which is the oldest High School in Marin County. It was founded in\n1888\nand shared space with the grammar school. Certainly his favourite subject at school was mathematics and he decided to continue studying that subject at the University of California Berkeley.\nThe University of California Berkeley had been founded in\n1868\nand named after the mathematician and philosopher\nGeorge Berkeley\n. The first chair of the Department of Mathematics was William Thomas Welcker, a West Point graduate and Confederate veteran, but, after a quarrel with the Regents, the chair was declared vacant in May\n1881\n. In May\n1882\nIrving Stringham\nbecame the chair and he was the only professor in the Department when Ross was an undergraduate. Ross graduated with a B.S. from Berkeley in\n1896\nand was appointed as a teacher at the Mount Tamalpais Military Academy in San Rafael. This Academy had been founded in\n1890\nby a Presbyterian minister who hoped to develop it into a College. This idea was quickly abandoned and it educated boys for entry to university giving them military skills. Graduates were admitted to Berkeley without examination. Ross taught mathematics and physics at the Mount Tamalpais Military Academy in\n1896\n-\n97\nthen accepted a fellowship offered by the Lick Observatory.\nThe Lick Observatory, on the summit of Mount Hamilton in the Diablo Range of mountains in California, was constructed between\n1876\nand\n1887\nusing a bequest from James Lick. It had been taken over by the Regents of the University of California in\n1888\n. James E Keeler had been one of the original astronomical staff and, after seven years at the Allegheny Observatory, returned to Lick becoming its director in\n1898\n. He introduced the graduate fellowship scheme and three graduates, one of whom was Ross, were awarded a fellowship beginning in\n1898\n. The idea was that the fellowship holders would spend part of their time with classes at Berkeley and part on experimental work at the Observatory. Ross, however, resigned after working for a few months, stating that he had problems with his eyes. In fact he admitted to a friend years later that the \"eye problem\" was an excuse. Rather he was extremely bored carrying out the routine reductions involved in observational work; he wanted something more challenging.\nIn\n1899\nhe registered to study for a PhD in mathematics at Berkeley. He was assigned\nIrving Stringham\nas his official advisor but in fact he was more attracted to the research that\nErnest Wilczynski\nwas publishing.\nWilczynski\nhad been appointed as an instructor in mathematics at Berkeley in\n1898\nand he discussed with Ross his papers\nOn Linearoid Differential Equations\n(1899)\nand\nOn Continuous Binary Linearoid Groups and the Corresponding Differential Equations and\nFunctions\n(1900)\n. While undertaking research for his PhD, Ross spent the year\n1900\n-\n01\nas an Assistant Professor of Mathematics at the University of Nevada. In\n1901\nhe submitted his thesis\nOn Differential Equations Belonging to a Ternary Linearoid Group\nto the University of California and he was awarded a PhD in mathematics. The thesis begins:-\nIt is the object of the present paper to investigate systems of differential equations which belong to a ternary linearoid group. The investigation is confined to those cases which are essentially distinct. The last paragraph is devoted to algebraic theorems on characteristic equations. Particular cases of these theorems were first noticed in attempting to treat two-parameter groups in their unreduced form. The results thus obtained have been generalised. Differential equations belonging to linearoid groups have been studied by\nE J Wilczynski\n. He has proved the existence theorem and obtained the differential equations belonging to a binary group.\nHe submitted a paper, which was essentially his thesis, to the\nAmerican Journal of Mathematics\non\n23\nApril\n1901\nand it was published in\n1903\n(\nsee\n[\n12\n]\n)\n. We note that both of the papers by\nWilczynski\nwhich Ross's thesis builds on were also published in the\nAmerican Journal of Mathematics.\nIn the year\n1901\n-\n01\nRoss was employed by the Watson Fund to compute the orbits of asteroids. James C Watson\n(1838\n-\n1880)\nwas Professor of Astronomy and Director of the Observatory at the University of Michigan. He discovered twenty-two asteroids during his career and he bequeathed a fund for the purpose of computing the orbits of these asteroids. This is a highly non-trivial mathematical task since they are all significantly perturbed by Jupiter. The work was carried out under the auspices of the\nNational Academy of Sciences\nand, at the time Ross graduated with his PhD, the chairman of the Watson trustees was\nSimon Newcomb\n. In the twenty years following Watson's death little progress had been made but, working under Armin Otto Leuschner\n(1868\n-\n1953)\n, Ross together with R T Crawford, did outstanding work and turned the data over to Leuschner for publication. We note that Russell Tracy Crawford was awarded a PhD in astronomy from Berkeley in\n1901\n, the same year as Ross was awarded his PhD in mathematics.\nIn\n1902\nRoss was appointed as an Assistant in the Nautical Almanac Office in Washington D C. After a year, he became\nSimon Newcomb\n's assistant at the Carnegie Institution of Washington. He analysed planetary orbital data with\nNewcomb\nand, at\nNewcomb\n's suggestion, computed an orbit of Phoebe, the ninth satellite of Saturn. He published\nInvestigations on the orbit of Phoebe\nin the\nAnnals of Harvard College Observatory\nin\n1905\n. It was his first paper on astronomy and has the following Introduction:-\nA ninth satellite of the planet Saturn was discovered in March\n1899\n, by Professor W H Pickering, of Harvard College Observatory. The large number of observations of this object which have been secured up to the present time, extending over a period of more than six years, and which are now available, make it possible to derive the elements of its orbit with considerable certainty. On account of its extreme faintness, and accurate ephemeris is necessary in order to permit its being observed and followed by the great refractors of the world.\nOn\n4\nMay\n1904\n, Ross married Julia Margaret Benton\n(1878\n-\n1941)\nin St Stephens Church, Sewickley, Allegheny, Pennsylvania. It was announced in the Pittsburgh Post\n[\n15\n]\n:-\nAn interesting wedding of today will be that of Miss J Margaret Benton, daughter of the Rev and Mrs Robert A Benton, of Sewickley, and Dr Frank Elmore Ross, of Washington, D. C. The ceremony will be performed in St Stephen's Protestant Episcopal Church, of Sewickley, of which the bride's father is rector. The maid of honour will be Miss Jane Glenn, Wooster, and the bridesmaids will be Miss Mary Craig Chaplin and Miss Eleanor Adams Gormley, of Sewickley. The ushers will be Dr John R Benton of Washington, D. C., Stewart Campbell Spencer and John Anson Emery.\nFrank and Margaret Ross had a son Robert Donald Ross who was born in Sewickley, Pennsylvania on\n28\nNovember\n1905\n. As an electrical aeronautical engineer, he worked for the Westinghouse Electric Company, the U.S. Navy Department, and retired from NASA after\n25\nyears of service, having worked with the Apollo space programme. He died on\n19\nJanuary\n1996\n.\nFor more information about Robert Donald Ross and other members of the Ross family, see\nTHIS LINK\n.\nRoss's brother, Walter Ross, also worked at the Carnegie Institution of Washington. He married Emma F St Clair on\n2\nAugust\n1905\n, with Frank Ross as his best man. The\nWashington Evening star\nreports\n[\n14\n]\n:-\nYesterday morning at the residence of Mrs W F Hardy,\n1118\n10\nth street northwest, her daughter, Miss Emma Frances St Clair, was married to Mr Walter Ross of the Carnegie Institute. The bride was becomingly attired in a travelling costume, and was attended by Miss Tessie Ostrander, while the groom's brother, Mr Frank Ross. also of the Carnegie Institute, acted as best man.\nIn\n1905\nRoss was appointed as director of the International Latitude Observatory in Gaithersburg, Maryland. This was only about\n20\nmiles from Washington and, in partnership with his brother Walter, they bought and ran a cigar store in Washington. In Gaithersburg, Ross completed the computations of the sixth and seventh satellites of Jupiter which he had been working on at the Carnegie Institute and published these in the papers\nElements and ephemeris of Jupiter's sixth satellite\nin\nAstronomische Nachrichten\n(1905)\n,\nElements and ephemeris of Jupiter's seventh satellite\nin\nAstronomische Nachrichten\n(1906)\n, New elements of Jupiter's seventh satellite in\nAstronomische Nachrichten\n(1907)\n, and\nSemi-definitive elements of Jupiter's sixth satellite\nin the\nLick Observatory Bulletin\n(1907)\n. He also published\nAn Application of Stirling's Interpolation Formula\nin the\nAmerican Mathematical Monthly\nin\n1905\n. He did, however, want to work in an observatory rather than computing with other people's data, and he was very keen to return to California so, in\n1912\n, he wrote to William Wallace Campbell\n(1862\n-\n1938)\n, the director of the Lick Observatory from\n1901\nto\n1930\n, asking if any positions were available - none were.\nHe continued to publish papers, for example on the orbit of Mars and the Moon's mean longitude. In\n1915\nhe published the\n127\n-page report\nGeodesy: Latitude Observations with Photographic Zenith Tube at Gaithersburg, Md\n. Donald Osterbrock writes\n[\n11\n]\n:-\n... at the observatory in Gaithersburg, Ross developed, almost completely on his own, a photographic method of making the necessary measurements which was at least twice as accurate as the previously used visual method. However, the funds for the project ran out and he lost his job in\n1915\n. The Naval Observatory took over the \"photographic zenith tube\" Ross had invented and demonstrated, but turned it over to its own astronomers to use.\nRoss's marriage to Margaret Benton had not been successful and they had divorced. While still at Gaithersburg, Ross married his second wife Elizabeth Matilda Bischof, the daughter of German parents, in Williams Bay, Wisconsin, on\n10\nJune\n1913\n. They had a son Alan Kenneth Ross born in Omaha, Nebraska on\n2\nOctober\n1915\n. All this meant that Ross had problems when he lost his job at Gaithersburg for, although he continued to earn some money calculating planetary ephemerides for the Nautical Almanac Office, it was not enough to support him, his wife and their son.\nPerley Gilman Nutting\n(1873\n-\n1949)\nwas awarded a BA by Stanford University in\n1897\n, then studied for a Master's Degree in physics at Berkeley where he got to know Ross. After being awarded a PhD by Cornell University in\n1903\nNutting went to Washington where he worked at George Washington University and then at the National Bureau of Standards. He had kept in touch with Ross even after leaving Washington in\n1912\nwhen he joined the Eastman Kodak Company in Rochester, New York. Nutting arranged for Ross to be appointed as a computer at Kodak by the end of\n1916\nand, although at first he lived alone in Rochester, his wife and son joined them there in January\n1917\n. Nutting founded the Optical Society of America in\n1916\nand was its President in\n1916\n-\n17\n. Ross gave a summary of the work he was undertaking for Kodak on accurate astronomical positional measurements on photographic plates at the first meeting of the Optical Society in New York City on\n28\nDecember\n1916\n.\nThe United States declared war on Germany on\n6\nApril\n1917\n, nearly three years after the conflict began. Ross completed a World War I Draft giving: Physical Build Slender; Height Short; Hair Colour Black; and Eye Colour Brown. Soon after the United States entered the war, Kodak began the task of rapidly developing a camera for aerial photography. Ross had to stop the research he was carrying out on photographic plates and join the effort on the camera. By the time the war ended in November\n1918\nKodak had produced a camera but had not yet begun production. It did, however, greatly influence Ross's career since he realised that further development of this camera could lead to excellent cameras for astronomical use. He returned to his work on photographic plates but, in parallel, began working on improving lens designs for cameras. Again he wrote to Campbell in October\n1918\nabout a possible position at Lick, but received a negative response. Ross, keen to gain a position in an observatory, particularly one in California, saw his work on lenses and cameras as a way to gain such a position.\nOn\n21\nDecember\n1920\nFrank and Elizabeth Ross's second child, Barbara Helen Ross, was born in Berkley, California. You can read more about her at\nTHIS LINK\n.\nBy\n1920\nFrank Schlesinger\n(1871\n-\n1943)\n, the director of Yale Observatory, had learnt of Ross's designs and ordered a camera to be made for Yale. Ross published his designs in the paper\nA Wide-Angle Astronomical Doublet\npublished in the\nJournal of the Optical Society of America\nin\n1921\n. Ross wrote to Campbell at Lick just as his paper was appearing suggesting that his lenses would be ideal for observing the\n1923\nsolar eclipse. Indeed Campbell ordered lenses for two Ross cameras. He wrote to Ross in\n1921\nto say how impressed he was with his work and how he would want him at Lick, but unfortunately funds were still not available. Soon, however, Ross was offered a position at Lick but there were difficulties over his salary and the starting date. Offers were made and rejected until eventually Campbell heard a rumour the Ross's marriage was in difficulties and, not wanting a couple with marriage problems in the isolated mountain top location, all offers were withdrawn.\nIn\n1924\nRoss accepted a position at Yerkes Observatory located in Williams Bay, Wisconsin and operated by the University of Chicago's Department of Astronomy and Astrophysics\n[\n9\n]\n:-\nAt the Yerkes Observatory, Dr Ross re-photographed stellar fields that had been photographed earlier by Professor Barnard, and, in comparing the new plates with the older ones, found many variable stars and stars with large proper motions. These discoveries were reported regularly in the Astronomical Journal, and by\n1931\nhis lists contained\n379\nnew variable stars and\n869\nproper-motion stars. He also took many excellent photographs of the large nebulous regions of the sky and published, with Miss Mary Calvert, a photographic atlas of the Milky Way.\nAt its opposition in\n1926\n, Dr Ross photographed Mars in different colours with the Mount Wilson\n60\n-inch reflector and with the Lick\n36\n-inch refractor. In\n1927\nhe again visited the Mount Wilson Observatory and made a photographic study of Venus. His photographs of Venus in ultraviolet light called attention to the vague temporary markings, or shadings, in that planet's atmosphere.\nIn\n1928\nthe Caltech founder George Ellery Hale persuaded the Rockefeller Foundation trustees to commit a large sum to building a\n200\n-inch reflecting telescope at the Palomar Observatory. John August Anderson\n(1876\n-\n1959)\nwas to be in charge of the work and, after discussions with Hale, they contacted Ross asking him to spend some months working with them. He agreed and made various visits to Mount Wilson. When back at Yerkes, he spent half his time observing and half computing optical designs for instruments for Palomar.\nRoss continued to design bigger and better cameras that were purchased by many of the leading observatories. W W Morgan writes\n[\n8\n]\n:-\nA series of photographs\n(\npublished\n1927\n-\n1931)\nwith a new lens of his own design revealed new features associated with some of the best-known nebulosities of the northern sky. This work culminated in\n1934\nwith the publication of the magnificent Atlas of the Milky Way with Mary R Calvert. This atlas, which consists of original photographic prints, revealed for the first time some of the large-scale characteristics of the northern Milky Way. The photographs were obtained with a five-inch lens designed by Ross.\nThe most important work of Ross's life was the introduction of correcting lens systems for use with large reflecting telescopes. His correcting lenses for the Mt Palomar\n200\n-inch reflector increased the size of the usable field greatly, and made possible much of the remarkable work of the late Walter Baade. The importance of the Ross correcting lenses in twentieth-century astronomy is so great that, had he done no other work, he would still have occupied a high place.\nIn\n1935\nhe published the paper\nLens Systems for Correcting Coma of Mirrors\nin the\nAstrophysical Journal\n. The Abstract reads as follows:-\nThe only serious optical defect that is outstanding in the usual reflecting telescope system is coma. The various modifications which have been proposed, and in some cases introduced, to correct coma are described and their limitations are pointed out. On the initiative of Dr G E Hale, the writer has investigated the optics of a simple lens system placed near the focus of a parabolic mirror, which will correct the outstanding coma and at the same time will not introduce other aberrations of a serious amount. Employing the third-order equations of general optical theory, a solution has been obtained for a two-piece lens system which eliminates coma and astigmatism but leaves outstanding spherical aberration and distortion. These, however, are not serious in the problems of photometry and astrometry requiring the use of a lens of this type. The third-order solution is found not to be unique, two parameters being undetermined. The double family of lenses is shown in Figure\n2\n. It is not a simple matter to choose the one lens in this double family which will function best under any given set of conditions of focal length and aperture ratio. The difficulty is due to corrective terms introduced by the fifth- and higher-order aberrations. These can only be obtained by the ray-tracing methods customary in the computation of complicated lens systems. Corrective lenses have been computed by the writer for a number of telescopes, notably the Mount Wilson\n100\n-inch and\n60\n-inch, and have proved useful in problems of photometry and astrometry.\nThe lenses described by Ross in this paper are now called the 'Ross corrector'.\nRoss retired in\n1939\nand in that year married his third wife Anna Olivia Lee on\n21\nAugust\n1939\nin Dubuque, Iowa. The couple moved to Pasadena, Los Angeles, California where they lived at\n1665\nMountain Street. They then made their home in Altadena, Los Angeles, California living at\n1100\nMt Lowe Drive. He died at this home at the age of\n86\nin\n1960\n. Donald Osterbrock writes\n[\n11\n]\n:-\nHe is remembered for the Ross lens, Ross photometer, Ross high proper-motion stars, and Ross photographic correctors for large reflecting telescopes, and he played an important role in the design of the Palomar Hale\n200\n-inch reflector.\nLet us end by noting an inconsistency in census forms regarding Frank and Walter Ross's mother, Cassie Ross. On the\n1880\nCensus form, completed when Frank and Walter were\n5\nand\n6\nyears old, Carrie Ross is recorded as born in Massachusetts with her mother and father also born in Massachusetts. When Frank Ross completes Census forms between\n1910\nand\n1950\n, he gives his mother as born in Canada\n(\nsometimes more specifically in Nova Scotia\n)\n. When Walter Ross completes Census forms he records his mother as born in Ireland.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}