{
  "nome_completo": "Francisco José Duarte",
  "nome_curto": "Francisco José Duarte",
  "ano_nascimento": "1883",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Duarte/",
  "lugar_nascimento": "Maracaibo, Venezuela",
  "lugar_morte": "Caracas, Venezuela",
  "biografia": "Francisco José Mariano Duarte\nwas born in Maracaibo, where his father, Francisco Antonio Duarte Sánchez, was a general; his mother was Delfina Matilde del Carmen Isava Gonzalez de Duarte. He was the sixth of his parents ten children. He finished secondary school in Puerto Cabello and received his certificate-examination and the title of surveyor in February\n1900\n. On\n25\nMarch\n1908\nhe finished his studies at the University Central of Venezuela\n(\nUCV\n)\n, qualifying as an engineer. He was professor of geometry, algebra, analysis and mechanics at UCV\n(1909\n-\n1911\nand\n1936\n-\n1939)\n. Between\n1920\n-\n1921\nhe undertook postgraduate studies at the Sorbonne in Paris.\nFor several years Duarte split his professional work between scientific investigations, teaching at universities, and occupying posts such as Consul of Venezuela in Geneva\n(7\nJanuary\n1924\n-\n1929)\nand Director of the Astronomical and Meteorological Observatory\nJuan Manuel Cajigal\n. He also worked for many years as Director of Borders of the Ministry of Foreign Affairs\n(7\nJune\n1941\n-\n1968)\n, an occupation which saw him participate in delimitation of the Venezuelan borders with neighbouring countries, particularly with Brazil.\nHe was president of the School of Engineers\n(22\nApril\n1937\n-\n1939)\nand the Academy of Physical, Mathematical and Natural Sciences\n(1941\n-\n1945\nand\n1954\n-\n1957)\nof which he was a member from\n1933\n. In the period\n1954\n-\n1956\nhe was Professor of Algebra in the private University of Santa Maria in Caracas.\nJosé Nucete Sardi described Duarte in the following way\n(\nsee\n[\n6\n]\n, p.\n9)\n:-\nHe was a man who wanted to pass unnoticed, silent, who talked only to say just the right words to illuminate the concepts. He doesn't like publicity and used to avoid it and this all his friends knew ... . Really, he was a quiet person who didn't saying superfluous things.\nDuarte judged that:-\nVenezuela does not cultivate mathematics properly as a pure science.\nOn\n27\nMay\n1965\nhe became doctor honoris causa of University Central of Venezuela and on\n12\nFebruary\n1969\nhe received a similar honorary degree from the University of Oriente in Cuman'á. In\n1967\nhe became a pensioner and was awarded the Order of Liberator Gran Cordon.\nHe participated in International Congresses of Mathematicians in Bologna\n(1928)\n, Zürich\n(1932)\n, and Boston\n(1950)\n; Congresses of the Geodesic Union and International Geophysics in Madrid\n(1924)\n, Prague\n(1928)\n, Lisbon\n(1932)\n, and Brussels\n(1951)\n; International Congresses for the peaceful use of the atomic energy in Geneva\n(1955\n,\n1958)\n; and in the Assembly on the World Map in London\n(1928)\n.\nHe was a Foreign Member of the Academies of Venezuela, Madrid, Colombia and Peru; the Mathematical Societies of the United States, Berlin, Palermo, Switzerland, Brussels, Spain; and also the Astronomical Societies of France, Germany, Mexico.\nHe died on\n1\nOctober,\n1972\n, in Caracas. We use here Michalup's quotation\n(\n[\n4\n]\nor\n[\n10\n]\n, p.\n34\nand\n[\n10\n]\n, p.\n51)\n:-\nThe death of Dr Duarte means a great loss for the intellectual circles of the country. Personally, and as a scientific colleague of the Venezuelan Academy, I lost a sincere friend, who always was available when I needed him. I now regret deeply his absence in the sessions of the Academy.\nDuarte's most important work in mathematics was done in algebra, number theory and mathematical analysis. His first work in mathematics was about which he presented to the Paris\nAcademy of Sciences\nin\n1907\n. He published papers on the general solution of a diophantine equation of the third degree\nx\n3\n+\ny\n3\n+\nz\n3\n−\n3\nx\ny\nz\n=\nv\n3\nx^{3} + y^{3} + z^{3} - 3xyz = v^{3}\nx\n3\n+\ny\n3\n+\nz\n3\n−\n3\nx\ny\nz\n=\nv\n3\n, simplified\nKummer\n's criterion and gave a simple proof of the impossibility of solving the\nFermat\nequation\nx\n3\n+\ny\n3\n+\nz\n3\n=\n0\nx^{3} + y^{3} + z^{3} = 0\nx\n3\n+\ny\n3\n+\nz\n3\n=\n0\nin nonzero integers. He also observed that the interpolation formula of Everett is a consequence of the interpolation formula of\nGauss\n. In\n1908\nhe published an article where he calculated π to\n200\ndecimal places.\nHis main three books are:\nMonograph on the numbers π and e. Historical and bibliographical notes\n(\nSpanish\n)\n(\nBol. Acad. Cien. Fis. Mat. Nat\n.\n11\n(1948))\n, with\n27\nchapters on\n250\npages, which contains more information on π and\ne\ne\ne\nthan has ever before been collected in one place;\nLessons on Infinitesimal Analysis\n(\nCaracas\n1943\n,\n606\npp.\n)\n(\nSpanish\n)\ncontaining material from courses in analysis at UCV during his first three or four years there; and\nBibliography of\nEuclid\n,\nArchimedes\n,\nNewton\n(\nAcad. Cien. Fis. Mat. Nat.\n, Caracas\n1963\n,\n163\npp.\n)\n(\nSpanish\n)\nwhich was also done in the\n19\nth\ncentury.\nMany mathematicians are interested in recreational mathematics. Duarte also contributed to that part of mathematics and proposed problems and solutions to the\nAmerican Mathematical Monthly\nfor several years, and also to the journal\nCiencia y Ingenieria\n(\nScience and Engineering\n)\npublished in Mérida.\nDuring all his life he maintained a permanent correspondence with scientists all over the world on inherent problems of his speciality and he has been considered one of the outstanding mathematicians of his epoch.\nDuarte published seven books, over forty papers in mathematical journals, over twenty problems in the\nAmerican Mathematical Monthly\n, several articles in the press and reports including biographies of famous mathematicians.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}