{
  "nome_completo": "Francis Bashforth",
  "nome_curto": "Francis Bashforth",
  "ano_nascimento": "1819",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bashforth/",
  "lugar_nascimento": "Thurnscoe, near Doncaster, Yorkshire, England",
  "lugar_morte": "Brunnen, Woodhall Spa, Lincolnshire, England",
  "biografia": "Francis Bashforth\nwas the son of John Bashforth\n(1792\n-\n1862)\nand Ann Haigh\n(1795\n-\n1868)\n. John Bashforth, born on\n24\nMay\n1792\nin Bolton Upon Dearne, Yorkshire, was a farmer who farmed land owned by the church in Thurnscoe. He married Ann Haigh, also from Bolton Upon Dearne, on\n9\nApril\n1818\nwith witnesses Jane Caroline Bashforth, William Bashforth, Sarah Haigh and Francis Haigh. Francis, the subject of this biography, was John and Ann Bashforth's eldest child, having younger siblings Elizabeth Bashforth\n(\nborn about\n1822)\n, Charles Bashforth\n(\nborn about\n1825)\n, John Bashforth\n(\nborn about\n1826)\n, Thomas Bashforth\n(\nborn about\n1827)\n, Timothy Bashforth\n(\nborn about\n1829)\n, William Bashforth\n(\nborn about\n1831)\n, Henry Bashforth\n(\nborn about\n1833)\n, Ann Bashforth\n(\nborn about\n1836)\n, and Catharine Bashforth\n(\nborn about\n1839)\n.\nLet us point our here that the obituary for Bashforth that appeared in\nThe Times\n[\n6\n]\ngave incorrect information about Bashforth's parents and his early life. This was carried forward to other obituaries such as\n[\n7\n]\n. Bashforth's son, Charles Piggott Bashforth, pointed out these errors and gave a correct version in a letter sent to\nThe Times\nwhich was published as\n[\n3\n]\n. There are still minor inconsistencies, however, in some of the available information about Bashforth's family which may be due to incorrect transcription from census forms or errors in filling in these forms.\nFrancis attended school in Brampton Bierlow, about\n7\nkm south west of Thurnscoe, before entering Doncaster Grammar School. He was admitted as a\nsizar\nto St John's College, University of Cambridge on\n3\nJuly\n1839\n. Being a sizar meant that he was given financial assistance but had to earn this by acting as a servant to other students. Bashforth matriculated and began his studies of the mathematical tripos at the start of the Michaelmas term in October\n1839\n.\nJohn Couch Adams\nwas a fellow student, also at St John's College, and with similar mathematical interests. The two competed during their undergraduate years but later became firm friends; forty years after graduating they collaborated in the publication of a book. Bashforth's excellent undergraduate performance led to him becoming a scholar and he was Second Wrangler in the tripos examinations of\n1843\nwhen he was awarded a B.A. The Senior Wrangler that year was\nJohn Couch Adams\nwhose performance was said to have been one of the best ever. Not surprisingly\nAdams\nwas the\n1\nst Smith's Prizeman but both Bashforth and\nAdams\nwere elected fellows of St John's College, Bashforth being elected on\n26\nMarch\n1844\n.\nAfter graduating, Bashforth followed two distinct paths. He was a Tutorial Fellow at St John's College working towards being ordained, a necessary career path for fellows until the mid\n19\nth century, and he also worked as a civil engineer. New railway companies were springing up at this time and he worked for them surveying potential routes for new lines. This work meant that he developed his practical skills which later he would combine with his theoretical mathematical skills to make major advances in ballistics.  Let us give some examples of his work as a civil engineer. In\n[\n13\n]\nBashforth has two articles:\nRemarks on the mathematical principles of Mr Dredge's patent suspension bridge\n, and\nOn the proper depths below water mark of cills used for drainage\n. He is also involved in discussions in articles\n(\nin fact his name appears\n26\ntimes in this volume\n)\n. In\n[\n14\n]\nBashforth has the article:\nOn atmospheric traction\n, and he is involved in discussions in articles such as\nOn atmospheric railways\n,\nOn change of motion\n, and\nOn the Aust passage bridge\n. A short piece by Francis Giles in this volume, illustrates the work on which Bashforth was involved:-\nThe proposition to build a bridge across the old passage of the Bristol Channel, at Chepstow, has arisen from the intended improved connection of South Wales with England by means of railways, and whatever may be the objects of the crossing of the Bristol Channel elsewhere, the old passage is unquestionably the point where the nearest junction of South Wales with Bristol, the West of England, and London, can be effected.\nIn the session of\n1845\nI recommended, in my evidence upon the South Wales Railway, that this bridge should be constructed with a span of\n1\n,\n000\nfeet from pier to pier, and height of\n120\nfeet above high water mark of spring tides. Since then, I have had a correct plan and sections made of the Channel, from which I find it practicable to place the piers on rock foundations, accessible at low water, but at distances of\n1\n,\n100\nfeet apart. The bridge will therefore require four spans of this length, and one at each end of nearly\n550\nfeet. In addition to which, another bridge should be built across the Wye, with one span of about\n500\nfeet in length, and one at each end of about\n250\nfeet each. I expressed my opinion in the session of\n1845\n, that the suspension principle adopted at Menai Bridge and elsewhere, would not be sufficiently steady for the Aust Bridge without material improvements in it. I have accordingly, in conjunction with Mr Francis Bashforth, Fellow of St John's, Cambridge, designed a bridge for the Aust Passage, which the accompanying engraving represents; the calculations for which are subjoined, for the scrutiny of scientific men, and I have great pleasure in associating my name with Mr Bashforth's in this work.\nIn\n[\n15\n]\nBashforth has two articles:\nDescription of a universal time table\n, and\nGeneral table for facilitating the calculation of earthworks\n. The first of these begins as follows:-\nThe calculation of Railway Time Tables is attended with considerable difficulty and liability to error, owing to the various velocities of different classes of trains and the variation of gradients and stations stopped at. The importance of the correctness of these tables, coupled with the difficulty of obtaining that result, have led me to contrive a little instrument which, when the stoppages and the time of starling and arrival are determined, will give the times of arrival at each station exactly as they appear in the bill, regard being had to varying gradients, and consequently varying velocities. There could be no doubt of the perfect success of a mere geometrical contrivance, but to remove any doubt that might he felt, and to explain my notions to my friends, I have constructed a universal time table for the main line of the Manchester and Leeds Railway, which is about\n61\nmiles long, and has\n21\nstations.\nThe second of the\n1847\narticles led to his\n32\n-page booklet\n[\n2\n]\npublished in\n1855\n,\nGeneral Table for facilitating the Calculation of Earthworks, for Railways, Canals, etc with a Table of Proportionate Parts\n. The Preface to this highly mathematical work begins as follows:-\nIt appeared to the Author that a Table for facilitating the calculation of Earthwork might be so formed as to unite the great requirements of accuracy, generality, and facility of use. The accompanying Table is applicable to all combinations of \"slopes\" and widths of \"formation level,\"\n(\neven when the slopes on the two sides are different,\n)\nand requires the extraction of only one number for each prismoid. It can be used with expedition for parliamentary estimates and rough comparisons, and is also capable of showing the contents of prismoids with great accuracy, by the simple addition of a few numbers when the heights are given to the\n1\n10\n\\large\\frac{1}{10}\\normalsize\n1\n0\n1\n​\nth or\n1\n100\n\\large\\frac{1}{100}\\normalsize\n1\n0\n0\n1\n​\nth of a foot. This is effected by a method of proportional parts similar to that employed in Tables of Logarithms.\nAs a Tutorial Fellow at St John's College, Bashforth was concerned about the welfare of the undergraduates he was teaching and, in\n1849\n-\n50\n, he led a call by twenty-two of the teaching staff of the College for an increase in the number of staff involved in teaching. He took orders in the church, being ordained Deacon in\n1850\nand Priest in the following year by the Bishop of Ely, Dr Thomas Turton. Turton was, like Bashforth, a mathematician who had various clerical appointments. He had studied mathematics at Cambridge, had been Senior Wrangler in the mathematical tripos of\n1805\n, and equal\n1\nst Smith's Prizeman. He was Lucasian Professor of Mathematics at Cambridge from\n1822\nto\n1826\n, Regius Professor of Divinity\n1827\n-\n1842\nand the Bishop of Ely from\n1845\n. The College had various livings, consisting of land, property and churches, from which they had an income and fellows, after being ordained, were provided with a career path enabling them to marry by accepting a living. Bashforth accepted the living of Minting, near Horncastle, Lincolnshire in\n1857\n[\n12\n]\n:-\nMinting was originally a Vicarage, but Dr John Newcome, Master of the College, acquired the Rectorial property and the Advowson of the Vicarage. He attached the impropriate Rectory to the Vicarage and bequeathed the Advowson to the College. When Mr Bashforth arrived at Minting he found the Church in a dilapidated condition. It was rebuilt at a cost of £\n816\n, some of which was raised locally, and help also came from College friends.\nIn the\n1861\nCensus, Bashforth is recorded as rector and vicar of Minting, living in the parsonage there. He is unmarried and has three servants, a house keeper, a house maid, and a groom and gardener. He was looking to further his career in mathematics, however, and the chance came in\n1864\n[\n9\n]\n:-\nBashforth was anxious to obtain a post as professor of mathematics in the provinces, but such appointments were rare in those days. In\n1864\n, however, he was appointed professor of applied mathematics to the advanced class of artillery officers at Woolwich, which afterwards developed into the Artillery College.\nOf course, he could not both carry out his duties as vicar in Minting and as professor of applied mathematics in Woolwich\n[\n8\n]\n:-\nBut when the Government decided to create the Advanced Class of Artillery Officers, no candidate could be found more suitable than Bashforth; and so pressure was brought to bear on the Archbishop for leave to appoint a locum tenens of the living, while Bashforth was engaged on his official work at Woolwich, on which he entered in February,\n1864\n.\nOn taking up this new position, he decided that he would undertake research, conducting experiments to determine air resistance. A knowledge of air resistance was, of course, vital information for the science of ballistics having major military applications. Moreover, it had become apparent in the Crimean War\n(1853\n-\n1856)\nthat the British suffered from having obsolete equipment. He wrote:-\nFeeling that the satisfactory solution of any question in gunnery depends upon the construction of a trustworthy chronograph, it therefore became my duty to recommend that a proper instrument should be procured, and that a systematic course of experiments should be undertaken to determine, in the first instance, the resistance of the air to the motion of projectiles.\nHe invented the Bashforth Chronograph, beginning experiments with it in April\n1864\n. He reported on these experiments in a series of works:\nDescription of a Chronograph adapted for measuring the varying velocity of a body in motion through the air and for other purposes\n(1866)\n,\nA mathematical treatise on the motion of Projectiles founded chiefly on the results of experiments made with the author's chronograph\n(1873)\n, and\nRevised account of the experiments made with the Bashforth Chronograph, to find the resistance of the air to the motion of projectiles, with the application of the results to the calculation of trajectories according to J Bernoulli's method\n(1890)\n.\nFor Bashforth's Prefaces to some of these works, in which he gives fascinating information about his approach and difficulties he encountered, see\nTHIS LINK\n.\nOn\n14\nSeptember\n1869\nBashforth married Elizabeth Jane Piggott\n(1841\n-\n1916)\n, daughter of the Revd Samuel Rotton Piggott, vicar of Bredgar, Kent, and his wife Catherine Elizabeth Debaufer. They had one son, Charles Piggott Bashforth, born at Minting on\n14\nJuly\n1872\n, who like his father became a priest in the Church of England.\nIn the\n1871\nCensus, Bashforth is recorded as vicar of Minting, Lincolnshire, but he is living at\n15\nCampbell Terrace, Plumstead, Kent. The only other person living with him is his wife Elizabeth Bashforth. He had in fact planned to return to the parsonage in Minting in the spring of\n1868\n. He had written in a letter\n[\n12\n]\n:-\nSometime ago I intimated to the Council of Military Education that I should feel it to be my duty to avail myself of the first convenient opportunity to make a definite choice between my Living and Professorship; for my Living being distant, I am seldom able to visit it, and I have a decided objection to become the permanent non-resident incumbent of a Living. In many respects I regret that circumstances compel me to give up Woolwich, and I suggest that the spring of\n1868\n(\nwhen the members of the Advanced Class disperse\n)\nwill be a convenient time for my retirement. By that time I hope that the experiments at present authorised will have been completed.\nIn fact he did not return to his role as vicar until\n1872\n. Although after that he did no more experimenting, he did mathematical calculation on results of experiments which were sent to him and he wrote a number of books. One of these books was co-authored with\nJohn Couch Adams\n, namely\nAn attempt to test the theories of capillary action by comparing the theoretical and measured forms of drops of fluid, with an explanation of the method of integration employed in constructing the tables which give the theoretical forms of such drops\n(1883)\n.\nIn\n1904\nhe was elected an Honorary Fellow of St John's College and received the following notification\n[\n12\n]\n:-\nAt last I am able to congratulate the College on your election, by the unanimous vote of the Council, to an honorary fellowship. Again and again, for many years past, I have tried to bring this about, but for want of professional backing up, I could not carry my point. Now\nGreenhill\nhas borne testimony and all were heartily glad to do you justice. Thus\nAdams\n, Gifford and you, three B.A.'s of\n1843\n, have received the highest honour which the College can confer. I hope you enjoy and may long enjoy good health. I am sure Mrs Adams will rejoice when she hears the news, ever yours John E B Mayor.\nAs to Bashforth's interests outside applied mathematics, his family and his duties as vicar of Minting, we note\n[\n12\n]\n:-\nIn his younger days he spent his vacations in walking tours, visiting Germany, Switzerland, the Tyrol, and other places. In\n1866\nhe visited Scotland with the late Professor\nJ C Adams\n.\nBashforth died in Woodhall Spa, aged\n93\n, after three weeks' illness.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics"
  ]
}