{
  "nome_completo": "Frank Levin",
  "nome_curto": "Frank Levin",
  "ano_nascimento": "1927",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levin_Frank/",
  "lugar_nascimento": "Dayton, Ohio, USA",
  "lugar_morte": "Swansea, Wales",
  "biografia": "Frank Levin\nwas born\n19\nJune\n1927\nin Dayton, Ohio, the eldest of two children. When the younger child, Julie, was born, their father deserted the family, leaving their mother the difficult task of bringing up two children, in some considerable poverty. This was in fact the time of the great depression in America. Because Julie lacked a father, Frank was forced to be the father substitute, which he did well, so that his sister was always grateful to him. Those difficult years obviously remained with him all his life, and he was always extremely careful in spending.\nEarly on he showed signs of academic brilliance and at Primary School did four years in one. His undergraduate degree from Wright State in Dayton, Ohio, was interrupted in his final year at the age of\n18\n, when he was called up for military service.\nTo look at, he was an unlikely candidate for a soldier, being slight of build, and entirely non-aggressive, but a soldier is what he became. He was not involved in fighting but in the occupation of Japan after the Second World War. It is difficult to imagine a milder man, but he was nevertheless promoted, a consequence of his noticing a memo, and he realised it meant he could be promoted if he applied, and so of course he did.\nHe returned to the United States on a navy boat, which gave him a feel for travel. And travel he later on would. Having served in the U.S. army, he was entitled to a University education. He had to repeat his interrupted year at Wright State.\nHe took his Ph.D. in\n1955\nunder the supervision of Arno Jäger with his thesis titled\nOn the Algebraic Theory of Linear Multidifferential Polynomials\n.\nHis first job was at the Ford factory, where he was given the project of calculating the characteristics of the suspension of a car, a lengthy and laborious piece of calculation. When he had completed his results, his chief looked at them and said they were completely wrong. It turned out the chief had given Frank the wrong data to begin with. \"Oh well,\" the boss said, \"Here is the right data. Just do the calculation again.\"\nFrank liked best of all to work with other mathematicians. In total there were thirteen co-authors, as we see from his list of publications. See\nTHIS LINK\n.\nThe cooperation with me\n[\nBenjamin Baumslag\n]\nwas unwittingly facilitated by Frank's first wife and her dog. The wife, a Yugoslavian, called Ossia, found living in their flat in Bochum difficult, because her dog hated the flat. So she returned to Belgrade. On his frequent trips to Belgrade, Frank took the opportunity of stopping in London, where he worked with me.\nInitially he taught at the University of Kentucky. His next appointment was at Rutgers University, but for much of his tenure he was elsewhere, in Europe, and finally the faculty insisted he make up his mind to return permanently. He then got a job in Germany in Ruhr-Universität Bochum with the aid of his former supervisor Arno Jäger. In Bochum he took the advanced qualification of\ndocent\n, and became a professor.\nHe was a well respected mathematician, and wrote\n50\noriginal research papers, mainly in infinite group theory. He was always friendly and helpful. In Bochum students were particularly pleased with him, since he generously gave them much help.\nIn Bochum he married Elke, after divorcing his first wife, Ossia.\n(\nNot surprisingly, the long intervals when he and Ossia were separated were not good for the marriage.\n)\nFrank had no children with Ossia, but did have a son Marc with Elke.\nOn retiring, Frank moved with his wife to Swansea in Wales, where Elke's children lived. Frank was one of those few mathematicians who never gave up working on mathematics when he retired, and indeed, he was still working on a paper with Narain Gupta on the fateful day when he had a stroke. His last completed project was a book on popular mathematics with me. See\nTHIS LINK\n.\nAfter his stroke he spent five and a half years in a nursing home in Swansea, but he did not regain his speech, nor control of his limbs. Nevertheless, he never gave up, and watched TV, read the newspaper and Newsweek, played bingo, and tried to use the computer. He could drive an electric wheel chair, which gave him a degree of mobility.\nHe died on\n2\nOctober,\n2011\n, aged\n84\n. He is survived by his wife Elke, his son Marc, his sister Julie, and his granddaughter Nia. It was a blessing that before his death, Frank saw his granddaughter, now aged\n6\nmonths.\nFrank was a very quiet, modest man. He sported a neat trim beard, and spectacles. He looked very much like what he was, a professor of mathematics. He had difficulty in making up his mind in ordinary life, but not when it came to mathematics. Here he felt certain, and would present his arguments with firmness.\nHis main interest was in mathematics, but he was also interested in current affairs, politics and science.\nAmong close friends his conversation became amusing and interesting: he became a quiet raconteur, as he spoke of friends and experiences, full of incidents and details. If you asked him to do something, he always tried to help, often at considerable inconvenience to himself. I remember a typewriter he bought for a friend, which he had to cart all the way from Canada to Germany. He was very kind and helpful to me, for instance coming to Spain when my wife had had a heart operation, to give moral and practical support.\nFrank did not swear, mainly because he had no violence in his make-up. He did not even curse when he told me about a friend who had used Frank to guarantee a loan, and then decamped leaving the debt to Frank.\nI mourn the passing of a very good friend.",
  "math_areas": []
}