{
  "nome_completo": "Francesco Brioschi",
  "nome_curto": "Francesco Brioschi",
  "ano_nascimento": "1824",
  "ano_morte": "1897",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brioschi/",
  "lugar_nascimento": "Milan, Lombardo-Veneto (now Italy)",
  "lugar_morte": "Milan, Italy",
  "biografia": "Francesco Brioschi\n's mother was Camilla Seblis and his father was Paola Brioschi. Francesco studied at the University of Pavia, which is\n32\nkm south of his home town of Milan, and an ancient institution in the mid\n19\nth\ncentury being founded in\n1361\n. Brioschi graduated from the University of Pavia in\n1845\nwhen he received a doctorate after submitting a thesis which had been directed by\nAntonio Bordoni\n. From\n1852\nto\n1861\nBrioschi was professor of applied mathematics at the University of Pavia. There he taught mechanics, architecture and astronomy.\nIn\n1858\n, together with\nBetti\nfrom Pisa and his own student\nCasorati\n, Brioschi visited Göttingen, Berlin and Paris. In Göttingen they met with\nRiemann\nand quickly realised the significance of the contributions he was making. This visit is often taken as the point where Italian mathematics joined the mainstream of European mathematics. When they returned to Italy they began to publish Italian translations of\nRiemann\n's works and Brioschi began to lecture on these ideas.\nCasorati\nwas not the only student that Brioschi had in Pavia, for he also advised the doctoral students\nCremona\n(\ndoctorate in\n1853)\nand\nBeltrami\n(\ndoctorate in\n1856)\n.\nBrioschi was living through a very dramatic period in Italian politics as the country moved towards unification. Camillo Benso, conte di Cavour, was one of the main leaders in this bid for unification. In\n1859\nhe appointed Brioschi to a committee which had as its remit the reform of secondary schools. It is worth noting that Giuseppe Verdi, the leading Italian composer of operas, was also a member of the same committee. The Kingdom of Italy came into existence in\n1860\nand was officially proclaimed on\n17\nMarch\n1861\n, by a parliament assembled in Turin. The reforms put forward by the committee, which were to a certain extent modelled on German reforms, were implemented after the Kingdom of Italy was created.\nFrom\n1861\nto\n1862\nBrioschi was secretary of the Italian Ministry of Education. In\n1863\nhe founded the Politecnico, the Technical University of Milan, serving as its director and professor of mathematics and hydraulics for the rest of his life. The Politecnico made a highly significant contribution to Italian life as it led the way in the development of electricity. Northern Italy had a large potential for generating electricity by hydroelectric power and, thanks to research and development done in the Politecnico, in\n1883\nItaly became the first European nation with an hydroelectric power station. Brioschi also continued to work more generally for improving Italian education and, from\n1870\nto\n1882\n, he was on the Executive Council of the Ministry of Education.\nL Pepe, in a review of\n[\n3\n]\nwrites:-\nFrancesco Brioschi was an important mathematician in the European context owing to his contributions to the theory of algebraic equations and to the applications of mathematics to hydraulics. He also devoted himself to providing Italy with a scientific culture which was comparable with the new role of Italy as an emerging European nation.\nBrioschi studied the theory and application of\ndeterminants\nand published a major work\nTeoria dei determinanti\nⓉ\n(\nTheory of determinants\n)\nin\n1854\n. His four part work\nLa teorie dei covarianti e degli invarianti delle forme binarie, e le sue principali applicazioni\nⓉ\n(\nThe theory of covariates and invariants of binary forms, and its main applications\n)\nwas published in\n1858\n,\n1859\n,\n1860\nand\n1861\n.\nHermite\nsaid that this work was:-\n... one of the major mathematical achievements of our time.\nBrioschi also obtained new results in the theory of transformation of\nelliptic\nand\nabelian functions\n. One of his most important results was his application of elliptical modular functions to the solution of equations of the fifth degree in\n1858\n. His method uses ideas due to\nHermite\nand\nBetti\nwho had both worked on the problem. This problem was also solved by\nKronecker\nat almost exactly the same time. Brioschi however later went on to solve sixth degree equations using similar techniques. In\n1888\n,\nMaschke\nproved that a particular sixth-degree equation could be solved by using hyperelliptic functions and Brioschi then showed that any sixth-degree algebraic equation could be reduced to\nMaschke\n's equation and therefore solved using hyperelliptic functions.\nWe mentioned above that he was professor of hydraulics yet we have not yet looked at the applied mathematical aspect of his research\n[\n1\n]\n:-\nIn mechanics Brioschi dealt with problems of statics, proving\nMöbius\n's results by analytic means; with the integration of equations in dynamics, according to\nJacobi\n's method; with hydrostatics; and with hydrodynamics. His work as a hydraulic engineer was significant, although it is reflected comparatively little in his publications. Brioschi used the findings of a series of major projects or participated in the projects' development - for example, in the regulation of the Po and Tiber ...\nBrioschi highly valued the significance of pure mathematics in applications and greatly influenced the direction of mathematics in Italy. He made fundamental contributions in\n1857\nto changing the\nAnnali di Scienze Matematiche e Fisiche\ninto a journal of international standing, in\n1886\nto the new series of the journal\nPolitecnico\n, to an Italian edition of\nEuclid\n's\nElements\nfor secondary education, and he edited\nLeonardo da Vinci\n's\nCodice Atlantico\nⓉ\n(\nThe Atlantic codex\n)\nwhich was a major contribution to the understanding of the history of science and technology.\nBrioschi, however, was not one to lay the foundations of new areas of mathematics but rather one who grasped the power of new ideas he met rapidly and saw much further than others how these ideas could be used to make major advances. He said modestly of himself:-\nI am only a calculator.\nThis is, of course, a vast understatement but it does show that he understood where his strengths lay.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Number Theory"
  ]
}