{
  "nome_completo": "John Frank Adams",
  "nome_curto": "Frank Adams",
  "ano_nascimento": "1930",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adams_Frank/",
  "lugar_nascimento": "Woolwich, London, England",
  "lugar_morte": "Near Brampton, Huntingdonshire, England",
  "biografia": "Frank Adams\n's mother was Jean Mary Baines, a biologist, and his father was William Frank Adams, a civil engineer. He was the eldest of his parents two children, having one younger brother. The family was evacuated from London during World War II which somewhat disrupted his early education. As a consequence he attended school in a number of places but his education was mainly at Bedford School. By the time his schooling was completed World War II had ended but Britain still had national service and all young men were required to serve for two years. Adams served in the Royal Engineers during\n1948\nand\n1949\nbefore beginning his university education.\nAdams entered Trinity College, Cambridge, in\n1949\nto study mathematics. He took Part II of the Mathematical Tripos in\n1951\n, and Part III in the following year. After taking his first degree he started graduate work at Cambridge with\nBesicovitch\non geometric\nmeasure theory\n. He married Grace Rhoda Carty in\n1953\n.\nJames\nwrites in\n[\n1\n]\n:-\nSoon after their marriage she became a minister in the Congregational church. They had a son and three daughters\n(\none adopted\n)\n. Family life was extremely important to Adams, though he preferred to keep it separate from his professional life. The family used to do many things together, especially fell-walking in the Lake District.\nHe changed supervisors and began working on\nalgebraic topology\nwith\nShaun Wylie\n. However, he was most strongly influenced by\nHenry Whitehead\n, who led the foremost British school of algebraic topology. This happened during the year\n1954\nwhich Adams spent as a junior lecturer at the University of Oxford. He won a Fellowship at Trinity College, Cambridge, with his doctoral thesis on spectral sequences\nOn Special Sequences of Self-Obstruction Invariants\nwhich he submitted in\n1955\n. He returned to Cambridge in\n1956\nto take up the Fellowship and during this period he developed the spectral sequence which today is called the \"Adams' spectral sequence\".\nAdams won a Commonwealth Scholarship which enabled him to visit Chicago as a research associate in\n1957\n-\n58\n. While in the United States he also visited Princeton. Adams said:-\n... I regard the progress of my researches in America as most successful. ... By good luck, moreover, my new methods were sufficiently powerful to answer one of the classical problems of my subject, that proposed by\nH Hopf\nin\n1935\n.\nThe conjecture that Adams solved was the famous conjecture about the existence of\nH\nH\nH\n-structures on spheres.\nOn his return from the United States he became a College Lecturer at Trinity Hall Cambridge. His work turned towards\nK\nK\nK\n-theory, the generalised\ncohomology theory\non vector bundles. Using this theory he solved another important conjecture, this one being about vector fields on spheres.\nAfter spending further time in Princeton, Adams took up a post at Manchester as a Reader in\n1962\n, being appointed to\nNewman\n's chair when he retired in\n1964\n. At this time he became Fielden professor. He continued to produce work of outstanding depth and originality, and during his first few years at Manchester he wrote a series of papers\nOn the groups J\n(\nX\n)\nwhich were highly influential in\nhomotopy theory\n.\nIn\n1964\nAdams was elected a Fellow of the\nRoyal Society\n. In\n[\n3\n]\nJames\nsays:-\nIt was in\n1965\n, however, that he suffered the first attack of a psychiatric illness, as a result of which he was on sick leave for some months. It was apparently brought on by the worry caused by his responsibilities as head of department ...\nIn\n1970\nAdams succeeded\nHodge\nas Lowndean Professor of Astronomy and Geometry at Cambridge, and at this time he returned to Trinity College. His research continued to be of fundamental importance in the homotopy theory of classifying spaces of\ntopological groups\n, finite\nH\nH\nH\n-spaces and equivariant homotopy theory. Around this time in addition to his research papers, he began to publish expository work, some resulting from lecture courses. These books are of major importance, and include\nStable homotopy theory\n(1964)\n,\nLectures on\nLie groups\n(1969)\n,\nAlgebraic topology: a student's guide\n(1972)\n,\nStable homotopy theory and generalized homology\n(1974)\n,\nLocalisation and completion\n(1975)\n, and\nInfinite loop spaces\n(1978)\n. Let us say a little about these works.\nStable homotopy theory\n(1964)\nis a short\n74\npage book which is based on six lectures Adams gave at the University of California at Berkeley in\n1961\n.\nLectures on Lie groups\n(1969)\nis described by N R Wallach as follows:-\nThis book covers in a concise manner the fine structure and\nrepresentation theory\nof compact Lie groups, with emphasis on the classical groups. The exposition of the book is aimed at the reader who has some understanding of algebraic topology and would like to understand the aspects of the theory of compact Lie groups that are relevant to algebraic topology. The book fulfils its aims admirably and should be a useful reference for any mathematician who would like to learn the basic results on compact Lie groups.\nAlgebraic topology: a student's guide\n(1972)\nis rather unusual. It is in two parts, the first contains a description of the topics that Adams thought essential for any young mathematician interested in algebraic topology. It links to a wide variety of textbooks with Adams indicating the one which treats the topic in the way he considers best. The second part contains excerpts from some famous papers on algebraic topology together with surveys of generalized cohomology theories and complex cobordism written by Adams.\nStable homotopy theory and generalized homology\n(1974)\ncomprises of three lecture courses, one on the algebra of stable operations in complex cobordism delivered in\n1967\n, the second on complex cobordism theory delivered in\n1970\n, and the third on stable homotopy and generalized homology theories delivered in\n1971\n.\nStewart B Priddy, reviewing\nInfinite loop spaces\n(1978)\n, writes:-\nOver the past few years, various topologists have been heard to complain about the lengthy and technical nature of infinite loop space theory. Even if one suspected that some of these detractors had not come to grips with the problems involved, there was still an undeniable need for a compact and moderately elementary introduction to the subject and to the current literature. Adams' book fills this need nicely and it can be recommended to anyone seeking a substantial overview of the main topics.\nAs is evident from the lecture courses which Adams published, his lectures were well prepared but usually hard. He once received a letter from a second year undergraduate class saying:-\nThe class wishes to inform Professor Adams that it has been left behind.\nHe replied:-\nAt any rate I have done exterior algebra, even if the second year haven't.\nIn\n[\n1\n]\nJames describes his attitude to research students and to research:-\nAdams was an awe-inspiring teacher who expected a great deal of his research students and whose criticism of work which did not impress him could be withering. For those who were stimulated rather than intimidated by this treatment, he was generous with his help. The competitive instinct in Adams was highly developed, for example in his attitude to research. Priority of discovery mattered a great deal to him and he was known to argue such questions not just as to the day but as to the time of day. In a subject where 'show and tell' is customary he was extraordinarily secretive about research in progress.\nAdams received many awards for his work. Among these was the\nSylvester\nMedal of the\nRoyal Society of London\nwhich was awarded to him in\n1982\n:-\n... in recognition of his solution of several outstanding problems of algebraic topology and of the methods he invented for this purpose which have proved of prime importance in the theory of that subject.\nThe London Mathematical Society awarded him their junior Berwick Prize in\n1963\n, and their Senior\nWhitehead\nPrize in\n1974\n. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1985\nand the\nRoyal Danish Academy\nof Sciences in\n1988\n.\nHis health continued to cause him problems with another psychiatric illness in\n1986\n. Perhaps his health contributed to his death since he decided to go to London, despite feeling unwell, to a celebration for the retirement of a friend. He was killed in a car crash only a few miles from his home on the return journey. He had apparently always had a reputation as a car driver. According to\n[\n3\n]\n:-\nHe drove cars with remarkable skill but in a style that left a lasting impression on his passengers.\nFinally we note that seven years after Adams died another book was published based on his lecture courses. This is\nLectures on exceptional Lie groups\npublished in\n1996\n. The book is based on lectures which Adams gave at Cambridge which he considered to be sequel to his book\nLectures on Lie groups\n(1969)\n.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}