{
  "nome_completo": "Frank Hilton Jackson",
  "nome_curto": "Frank Jackson",
  "ano_nascimento": "1870",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jackson_Frank/",
  "lugar_nascimento": "Hull, England",
  "lugar_morte": "Cookridge, Leeds, England",
  "biografia": "Frank Jackson\nwas the son of William and Alice Jackson. He came from a large family, having ten brothers and sisters. He attended Hull Grammar School where his favourite subject was Classics. He was an outstanding pupil and, since his parents were not in a good position financially to support their son, he was encouraged to try for the award that Peterhouse, University of Cambridge, was offering to allow early entry of talented young students. Jackson received the award and entered Peterhouse in\n1886\nwhen only just sixteen years old. It was perhaps unfortunate that he entered so young. As Theodore William Chaundy\n(1889\n-\n1966)\nwrites in\n[\n2\n]\n:-\nJackson was one of the first victims of this idea.\nWe have noted above that Jackson wanted to read classics at Cambridge, but his father thought that mathematics would lead to his son gaining better paid employment so Jackson began to study the Mathematical tripos. Considerably younger than his fellow students, Jackson did well to graduate as a\nWrangler\nwhen he was awarded an A.B. in\n1889\n. Being a Wrangler meant that his performance had been first class but Jackson was ranked lowest in the list of Wranglers and so had no real opportunity to continue his study of mathematics at Cambridge.\nJackson now decided that he would enter the Church and he was ordained, becoming a Curate of Bemerton, Salisbury in\n1896\n. He had, however, already published his first mathematical paper with\nTheorems in the products of related quantities\nappearing in the\nProceedings\nof the Edinburgh Mathematical Society in\n1895\n. Over the following couple of years he published two further papers in the same\nProceedings\n, namely\nA certain linear differential equation\n(1896)\nand\nCertain expansions of x\nn\nin hypergeometric series\n(1897)\n.\nOn\n28\nFebruary\n1898\nit was announced\n(\nsee\n[\n4\n]\n)\n:-\nThe Reverend Frank Hilton Jackson, M.A., has been appointed a Chaplain in Her Majesty's Fleet.\nHMS Dido was an Eclipse class Cruiser that was built at London and Glasgow, laid down on the\n30\nAugust\n1894\n, launched on\n20\nMarch\n1896\n, and brought into service on\n10\nMay\n1898\n. Jackson, who was a Naval Instructor as well as a Chaplain\n,\nserved on HMS Dido from\n1898\n. On\n20\nJune\n1900\n, when the vessel was in Castellammare di Stabia, in the Bay of Naples, Italy, telegraphic orders were received ordering the vessel to sail for Chinese waters. The reason for this was the Boxer Rebellion in China. The Boxer movement was a Chinese nationalist militia who were opposed to foreign rule and opposed to Christian missionaries in China. Three weeks before HMS Dido left Italy, troops from eight countries had already begun to deploy to confront the Boxers who were attacking Christian churches, Chinese Christians and Chinese officials. The Boxer Rebellion was put down by\n1901\nand Jackson received the China Medal\n(1900)\nfor his part, as did many other members of the crew of HMS Dido.\nJackson served on HMS Dido until\n1902\nwhen he transferred to HMS Irresistible. He served on HMS Irresistible until\n1904\n, then HMS Illustrious in\n1904\nand\n1905\n, followed by HMS Albion in\n1905\nand\n1906\n. He left the navy in\n1907\nand, in the following year, was appointed as a Curate at Christ Church, Isle of Dogs. He served as Curate at Featherstone in Yorkshire from\n1910\nto\n1912\nwhen he was appointed Vicar of Thornton-le-Street and North Otterington, Yorkshire. He held this position until\n1918\nwhen he returned to the services as Instructor Commander Royal Navy attached to RAF, Calshot. His appointment as Vicar in\n1912\nallowed him to marry Elizabeth Lucy Bernarda Mulhern, the daughter of Edward Bernard Mulhern of Tunbridge Wells. They had no children.\nThere is a six-year gap in Jackson's publication record from\n1897\nto\n1903\n, but with his move from HMS Dido to HMS Irresistible in\n1902\nhe seems to have resumed his research career, sending three papers to journals with HMS Irresistible as his address. Chaundy writes in\n[\n2\n]\nthat after his early papers:-\n... his whole mathematical output was devoted to basic analogues or q-analogues\n(\nas they are obscurely called\n)\n. He wrote much on basic\nhypergeometric functions\n, including the basic functions of\nLegendre\nand\nBessel\n. He discussed their relevance to partition theory and to the elliptic q-functions.\nIn fact Jackson published\n17\npapers in the three years\n1903\n,\n1904\nand\n1905\n. Bruce Berndt writes\n[\n1\n]\n:-\nTwo English mathematicians, Frank H Jackson and\nL James Rogers\n, at the end of the\n19\nth\nand beginning of the\n20\nth\ncenturies devoted most of their mathematical careers to further developing the theory of q-series, but their efforts were not appreciated by their contemporary researchers. ... Jackson was contemporaneous with\nJames Rogers\nand even less appreciated for his work. The Bible in the theory of basic hypergeometric series is the text 'Basic Hypergeometric Series' by G Gasper and M Rahman. Readers of this book will find many results due to Jackson and rightly conclude that he, indeed, is one of the founders of the subject.\nJackson's most important papers on\nq\nq\nq\n-series are\nOn q-definite integrals\n(1910)\n,\nOn basic double hypergeometric functions\n(1942)\nand\nBasic double hypergeometric functions\n(1944)\n. In the first of these three papers what is now called the 'Jackson integral' appears. It is the operation in the theory of special functions that expresses the inverse to q-differentiation. The first appearance of this integral was in Jackson's earlier paper\nA generalization of the functions\nG\n(\nn\n)\nG(n)\nG\n(\nn\n)\nand\nx\nn\nx_{n}\nx\nn\n​\n(1904)\n. See also Jackson's papers\nOn q-functions and a certain difference operator\n(1908)\n, and\nq-Integration\n(1927)\n.\nOn\n21\nMay\n1919\n, Jackson was inducted as rector of Chester-le-Street, St Mary Parish. In\n1929\nhe published the book\nThe Collegiate Church of the Blessed Virgin Mary & S. Cuthbert, Chester-le-Street\n, in the series\nFamous churches and abbeys\n. He continued as rector of Chester-le-Street until\n1935\nbut, from\n1925\n, he was also Rural Dean.\nHe only published a couple of mathematics papers between\n1917\nand\n1941\nalthough, as we have just seen, he wrote a book during this time. However, although over the age of seventy, he published four papers in\n1941\n-\n42\nall in the\nOxford Quarterly Journal of Mathematics\n. Several of Jackson's early papers were published by the\nLondon Mathematical Society\nbut after\n1905\nhe never published a paper with that Society. Chaundy explains why this is so\n[\n2\n]\n:-\nOnce\n(\nwith a whimsical smile, one imagines\n)\nhe recounted the occasion of his quarrel with our Society\n[\nthe\nLondon Mathematical Society\n]\n: he had read a paper, when someone remarked: \"Surely, Mr President, we have heard all this before.\" He strode from the room and never darkened our pages again.\nThis little story tells us much about Jackson's character. Chaundy tells us more about this\n[\n2\n]\n:-\nHe had a ceaseless and vivid imagination which\n(\nto this writer\n)\nseemed often to tax his powers of exposition. We enjoyed a long and wide-ranging correspondence from the days when he first began to write for the 'Quarterly Journal of Mathematics', in which he showed himself a very human and humorous personality. ... Stern in principle, when instructed\n(\nas a naval chaplain by Admiral \"Jackie\" Fisher\n)\nto preach in Valetta Cathedral, he refused on the ground that it was beyond his official duties and reckoned that this later lost him a chair at Greenwich. When one of his parishioners protested, \"But surely, rector, there can be two opinions on this matter\", he was met with the retort, \"Not in this parish\". Yet to those who met him he was, despite his extreme deafness, a charming companion, versatile in conversation out of his rich store of experience. In later life his interests included pottery and Greek coins, of which he was both knowledgeable and appreciative: his interest in classical remains was stimulated while he held the living of Chester-le-Street. To the end he continued to meditate on mathematics: in some of his last letters he proposed to explore infinity through a use of basic numbers, but he left some of his readers doubting whether this could be mathematics or mythology.\nLet us finish with a little personal note. On our bookshelves we have a first edition of\nCharles Babbage\n's\n1864\nbook\nPassages from the life of a philosopher\n. The book has had a number of owners, but one of them was \"F H Jackson\" so we add to this biography a photo of his signature on this book .",
  "math_areas": []
}