{
  "nome_completo": "Francis Sowerby Macaulay",
  "nome_curto": "Francis Macaulay",
  "ano_nascimento": "1862",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macaulay/",
  "lugar_nascimento": "Witney, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Francis Macaulay\n's father, the Rev Samuel Macaulay, was a Minister in the Methodist Church. He sent his son Francis to a school for the sons of Methodist Ministers in Bath, namely Kingswood School. Graduating from Kingswood School in\n1879\n, Macaulay entered St John's College, Cambridge, from which he graduated with distinction, being eighth\nWrangler\n(\nranked eighth in the list of First Class students\n)\nin the Mathematical Tripos of June\n1882\n. In January of the following year he was placed seventh in the advanced papers of the Tripos.\nFrancis Macaulay was not the only member of his family who excelled at mathematics.\nH F Baker\nwrites\n[\n4\n]\n:-\nA brother, familiarly known to his contemporaries at Cambridge in\n1886\nas \"Macaulay of Caius\", was remarkable for his devotion to the theory of\nquaternions\n, and had a successful career as Professor of Mathematics in the antipodes.\nAfter graduating from Cambridge, Macaulay returned to Kingswood School in Bath in\n1883\n, where he himself had studied, and taught mathematics there for two years. He then went to London in\n1885\n, becoming a teacher at St Paul's School. In this school he taught the top mathematical class, which often contained outstanding pupils, and he encouraged them into a research career in mathematics, particularly at Cambridge. Two such students were\nWatson\nand\nLittlewood\nand we know of the teaching methods employed by Macaulay through the writing of\nLittlewood\n[\n1\n]\n:-\n...\n[\nT\n]\nhere was little formal instruction; students were directed to read widely but thoroughly, encouraged to be self-reliant, and inspired to look forward to pursuing research in mathematics.\nLittlewood\nconsulted the examinations record and wrote in\n[\n4\n]\n:-\nIn the\n25\nyears from\n[\nMacaulay's\n]\nappointment to St Paul's in\n1885\nto his resignation in\n1911\nthere were\n41\nscholarships\n(34\nat Cambridge\n)\nand\n11\nexhibitions; and in the\n20\nyears available there were\n4\nsenior wranglers, one second, and one fourth among his former pupils.\nMacaulay married in\n1923\n[\n2\n]\n:-\nNorah, widow of Mr G A Matthew, of Cambridge.\nHe wrote\n14\npapers on\nalgebraic geometry\nand polynomial ideals. The papers look at algebraic curves, the\nRiemann\n-Roch theorem and algebraic polynomials. It is important pioneering work in the development of algebraic geometry. In\n1915\nMacaulay discovered the primary decomposition of an ideal in a polynomial ring, which is the analogue of the decomposition of a number into a product of\nprime\npowers. This work was independent of that done by\nLasker\nin\n1905\n.\nThe passage of time since Macaulay published\nThe algebraic theory of modular systems\nin\n1916\nhas shown us what a remarkable work this is in the development of modern mathematics. The book has recently been reissued, eighty years after it was first published, not merely as an historical document but also because Macaulay's ideas are still highly relevant to present day research.\nWhat ideas were there then in this work? The main theme underlying the book is the problem of solving equations of systems of polynomials in several variables. Such problems have no complete solution, but Macaulay looks for structural properties of the set of solutions. In other words, in today's terminology, he is examining ideals in polynomial rings. This leads Macaulay to study\nLasker\n's decomposition of ideals into primary ideals\n(\nthe analogue of the decomposition of an integer into prime powers\n)\nand he also looks at properties which today surround the theory of Gröbner bases.\nLittlewood\nwrites in\n[\n4\n]\n:-\nNo one in England knew about his subject, and I believe he was very little in touch with workers abroad: he never spoke of his work, did not expect recognition in his life-time, and even when he was put up for the Fellowship of the\nRoyal Society\ndid not expect to be elected. In this, of course, he exaggerated, and his election gave him profound pleasure.\nWhere have Macaulay's ideas led in today's mathematics? Well the ideas in this book have led to ideal theory studied by\nKrull\n(\nsee\nW Krull\n,\nIdealtheorie\n, Berlin,\n1935)\n, to Cohen-Macaulay rings, so named by\nZariski\nand Samuel\n(\nsee\nO Zariski\nand P Samuel,\nCommutative Algebra\n, Princeton, NJ,\n1958)\n, the notion of perfectness\n(\nstudied in W Gröbner,\nModerne algebraische Geometrie\n, Vienna,\n1949)\n, and to the notion of\nGorenstein\nrings.\nWe should also note that Macaulay was an associate editor of the\nMathematical Gazette\nfor many years. He also contributed a number of articles:\nBolyai's science of absolute space\n(1900)\n,\nOn continued fractions\n(1900)\n,\nProjective geometry\n(1906)\n,\nOn the axioms and postulates employed in the elementary plane constructions\n(1906)\n,\nOn a problem in mechanics and the number of its solutions\n(1906)\n, and\nSome inequalities connected with a method of representing positive integers\n(1930)\n.\nMacaulay retired from St Paul's School in\n1911\nand after World War I he moved from London to live in Cambridge.\nBaker\nwrites\n[\n4\n]\n:-\n... one remembers with admiration the bravery with which, in his last years, he sought to continue his normal activities - as, for instance, by travelling out to the golf links to play a strictly limited number of holes before lunch.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory"
  ]
}