{
  "nome_completo": "François-Jacques-Philippe Folie",
  "nome_curto": "François Folie",
  "ano_nascimento": "1833",
  "ano_morte": "1905",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Folie/",
  "lugar_nascimento": "Venlo, Belgium (now Netherlands)",
  "lugar_morte": "Liège, Belgium",
  "biografia": "François Folie\n's parents were Anselme-François-Joseph Folie\n(1790\n-\n1855)\n, a captain in the artillery, and Julie Rennotte\n(1810\n-\n1870)\n. Anselme and Julie Folie married in\n1832\nand lived in Venlo for the first few years of their son François's life. He was the eldest of his parents' seven children. However, these were times of great political change in Belgium and the Netherlands. Belgium had declared itself independent of the Netherlands in\n1830\n, before François was born, but after a military conflict in\n1831\nthere was a long period during which the status of Belgium was decided by the international community. Only in\n1839\nwas its independence and neutrality recognised but the agreed borders put Venlo in the Netherlands. Anselme Folie moved to Liège, in Belgium, where he was appointed commander of the School of Pyrotechnics. This school, established by Royal Decree of\n24\nJanuary\n1841\n, had the task of training members of the artillery and undertaking research into improvements in ammunition and firearms. It was in Liège that François Folie was educated and, indeed, he spent most of his life in this city.\nAt the College in Liège, Folie made an important friendship which lasted for over\n50\nyears. This was with Joseph Delboeuf who went on to have an academic career similar to that of Folie. After leaving the College, Folie studied at the University of Liège and was awarded a doctorate in mathematics and physics, with distinction, on\n13\nAugust\n1855\n. However, the death of his father left him in a difficult position, having to provide financial support for his mother and six brothers and sisters. In\n1857\nhe was appointed to teach courses in Algebra, Calculus and Analytic Geometry at the University of Liège. While undertaking teaching these mathematics courses he was able to make short visits to the University of Bonn where he was introduced to practical astronomy by Friedrich Wilhelm August Argelander and his assistants Schönfeld and Krueger. Argelander\n(1799\n-\n1875)\nhad been a student of\nWilhelm Bessel\nat the University of Königsberg and had been appointed as director of the Observatory in Bonn in\n1837\n. Seven years later, he began an investigation of variable stars and, at around the time that Folie began to study with him, he was beginning to publish the\nBonner Durchmusterung\nⓉ\n(\nObservations from Bonn\n)\n, a major star catalogue of over\n300\n,\n000\nnorthern hemisphere stars which he had spent twenty-five years compiling. Folie made longer visits to Bonn in\n1859\nand\n1862\nand during these visits he got to know\nRudolf Clausius\nand, as a consequence, became very familiar with the mechanical theory of heat. Folie requested that he be allowed to deliver a free course at the University of Liège on the mechanical theory of heat and he was given permission to begin teaching such a course in\n1867\n. It was a course he continued to give for a number of years but, in\n1868\n, he gave up teaching the courses in Algebra, Calculus and Analytic Geometry.\nIt was after making these visits to Bonn that Folie began publishing papers. His early work consisted of:\nThéorie nouvelle du mouvement d'un corps solide\nⓉ\n(\nNew theory of the motion of a solid body\n)\n(1865)\n;\nSur la manière de résoudre les problèmes de mécanique dans lesquels on tient compte du frottement\nⓉ\n(\nHow to solve the mechanical problems taking friction into account\n)\n(1867)\n;\nSur la théorie de la roue Poncelet\nⓉ\n(\nOn the theory of Poncelet's wheel\n)\n(1868)\n; and\nNouvelles tables usuelles de logarithmes, précédées d'un précis de trigonométrie pure\nⓉ\n(\nNew general logarithmic tables, preceded by a summary of pure trigonometry\n)\n(1868)\n.\nJean-Baptiste Brasseur\nhad been a senior member of the faculty at Liège during the years that Folie had been a student there, and later the two had become colleagues.\nBrasseur\ndied in\n1868\nand, later that year, Folie published lecture notes of his teacher, to which he had added notes,\nExposition nouvelle des principes du calcul différentiel et du calcul intégral de J-B Brasseur, publiée et augmentée de notes et d'un avant-propos par F Folie\nⓉ\n(\nNew exposition of principles of calculus and calculus of J-B Brewer, published and augmented with notes and a foreword by F Folie\n)\n(1868)\n. In the same year Folie published the first of two volumes of\nThéorie mécanique de la chaleur, de R Clausius\nwhich he had translated from the German into French. The second volume, also translated by Folie, appeared in\n1869\n.\nNow Folie was looking for a position which would give him financial security so that he could make a family life. He taught at the École industrielle in Liège for several years but, in\n1872\n, returned to the University of Liège as Administrateur-Inspecteur. He held this post until\n1884\nand it was during his time in this leading administrative role that many of the science and medical buildings of the University of Liège were erected. On\n5\nMay\n1873\n, Folie married Adelina Quinet\n(1849\n-?\n)\n. Adelina, whose father was Dieudonné Joseph Quinet\n(1795\n-\n1878)\n, was related to Folie through her mother Caroline Folie\n(1805\n-\n1878)\n. François and Adelina Folie had eleven children, the eldest being the author Franz Folie\n(1874\n-\n1937)\nwho wrote under the pseudonym Franz Ansel.\nAlthough he continued to be interested in applied mathematical topics, Folie had learnt about the latest developments in geometry from\nJean-Baptiste Brasseur\nand soon he began to publish in this area. In\n1868\n, following\nBrasseur\n's death, he took over teaching the course on Higher Geometry. His first research publication in geometry was the paper\nSur quelques théorèmes généraux de géométrie supérieure\nⓉ\n(\nOn some general theorems of advanced geometry\n)\n(1869)\nbut, more significantly, his first major publication in the\nMemoirs\nof the\nRoyal Belgium Academy of Science\nwas on geometry:\nFondements d'une géométrie supérieure cartésienne\nⓉ\n(\nFoundations of higher Cartesian geometry\n)\n(1872)\n. In this work he extended results of\nPascal\nusing methods due to\nGergonne\n. Two years later he published three papers on geometry:\nExtension des théorèmes analogues à celui de Pascal à des courbes tracées sur une surface quelconque\nⓉ\n(\nExtension of theorems analagous to those of Pascal about the curves drawn on any surface\n)\n;\nQuelques nouveaux théorèmes sur les cubiques gauches\nⓉ\n(\nSome new theorems on the left cubic\n)\n; and\nQuelques nouveaux théorèmes sur les courbes gauches du\n4\ne ordre\nⓉ\n(\nSome new theorems on space curves of the fourth order\n)\n. During these years when his research interests were firmly in the area of geometry he was thesis advisor to\nConstantin Le Paige\nwho was awarded his doctorate on\n28\nJuly\n1875\n.\nLe Paige\ntook over teaching the Geometry Course that Folie had been giving in\n1879\n. Folie and\nLe Paige\ncollaborated on a number of important works, particularly\nSur les courbes du troisième ordre\nⓉ\n(\nOn the curves of the third order\n)\n(1882\n,\n1884)\n.\nIn\n1883\nJ C Houzeau retired as director of the Observatory in Brussels. However, conditions for observations at this observatory were rapidly deteriorating as the city of Brussels quickly expanded, so it was clear that the next director would have a major task in constructing a new Belgium observatory. Folie was appointed director in\n1885\nand, during the next years, he supervised the construction of a new national Observatory at Uccle. As one would expect, he began to publish papers on astronomy, for example\nDouze tables pour le calcul des réductions stellaires\nⓉ\n(\nTwelve tables for the calculation of stellar reductions\n)\n(1883)\nand\nTraité des réductions stellaires\nⓉ\n(\nTreatise of stellar reductions\n)\n(1888)\n. In fact, once he was appointed to the position of director of the Observatory he did not publish any further papers on geometry. He retired in\n1897\nand at this time he returned to Liège where he spent his last years. He continued to publish works on astronomy up to the time of his death which followed a short illness.\nAlthough we have considered only scientific contributions by Folie above, he did in fact make other contributions. Perhaps the most significant was, with his school friend Joseph Delboeuf as well as Guinotte, Hanssens and Houtain, he founded\nLa Belgique contemporaine\n, a review of literature and sociology. In fact he founded this review journal when he was a young man but throughout his life he continued to show great concern for social issues, particularly looking to support the working man.\nFolie was honoured for his contributions by being elected a corresponding member of the\nRoyal Belgium Academy of Science\n(\nAcadémie Royale des Sciences, des Lettres et des Beaux Arts\n)\non\n15\nDecember\n1869\n. He became a full member of the Academy on the\n15\nDecember\n1874\nand Director of the Science Class of the Academy in\n1892\n.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}