{
  "nome_completo": "Charles Frederick Mosteller",
  "nome_curto": "Frederick Mosteller",
  "ano_nascimento": "1916",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mosteller/",
  "lugar_nascimento": "Clarksburg, West Virginia, USA",
  "lugar_morte": "Falls Church, Virginia, USA",
  "biografia": "Frederick Mosteller\nwas known to his friends and colleagues as Fred. His parents were William Roy Mosteller and Helen Kelley. William, from Williamsport, Pennsylvania, started working as a glass blower but gave this up during World War I and became a road builder. He was an intelligent man, but had only a couple of years of high school education. Helen, from Ladoga, Indiana, was keen on education and, after the family moved to the Pittsburgh area when Fred was a baby, she worked as a clerk. Later she became a fulltime housewife caring for the family but still did bookkeeping for the family company.\nWhen Fred was six years old he began attending McNair Elementary School. He was left-handed but his teacher persisted in forcing him to write with his right hand. Beginning school was the first time he had mixed with other children and, probably as a consequence, he went down with all the childhood illnesses one after the other. He missed so much through illness that he began the first grade for a second time. He did not enjoy his first few years at school, performing poorly, but he loved reading and went with his mother to the local library to choose books. His mother tried hard to teach him so that he would perform better at school but it had little effect. He had poor eyesight but hid the fact and it was only discovered when he was ten years old. Changing schools his academic performance slowly improved but he went though a difficult time when his parents divorced following which he continued to live with his mother. After a while they moved to Williamsport to live with Hiram Dangle, Fred's uncle.\nAnother move, this time to Delaware, saw Fred attend high school there for a year. He became keen on debating but a move to Pittsburg saw him enter Schenley High School where he was taught by a number of outstanding teachers. At this time he became an enthusiast for chess and was a founder member of the Schenley High School chess club which was very successful in competitions. The move to Pittsburg saw him back in contact with his father and he worked during the summers for his father's road construction firm. He won a scholarship to the Carnegie Institute of Technology\n(\nnow Carnegie Mellon University\n)\nand took a broad selection of courses. In his first year he studied engineering drawing, descriptive geometry, English and practical courses which included masonry, carpentry, sheet metal working and welding. In his second year he took courses on calculus, mechanics, French, quantitative analysis, and physical measurements. It was in this last mentioned course that he encountered statistics for the first time. The area of mathematics which he found most interesting was combinatorics, and because of this he approached\nEdwin Olds\n, a statistician at the Carnegie Institute.\nOlds\ndirected Mosteller's interests towards statistics. At this stage he was living with his mother in Williamsport and travelling to the Institute. On these journeys he met Virginia Gilroy, a fellow traveller, and they became good friends. Mosteller graduated from the Carnegie Institute with a B.S. in\n1938\nand remained there for the academic year\n1938\n-\n39\nundertaking graduate studies. He began working on a Master's thesis on rank correlation coefficients advised by\nOlds\n.\nAround Christmas\n1938\nMosteller was advised to attend a meeting of the Institute of Mathematical Statistics in Detroit. There he attended a talk by\nWilliam Cochran\nand met other statisticians such as\nSamuel Wilks\nand\nHarold Hotelling\n. He discussed with\nWilks\nthe possibility of working for his doctorate at Princeton and, after the award of his M.S. in\n1939\n, he went to Princeton having been awarded funds to cover his expenses in return for assisting\nWilks\nedit the\nAnnals of Mathematical Statistics\n. At Princeton he studied first for a Master's Degree and, in the summer of\n1941\nbefore the award of the degree, he married Virginia Gilroy; they had two children, William born in\n1947\nand Gale born in\n1953\n. Mosteller was awarded an A.M. from Princeton in\n1942\nand continued to undertake research for a Ph.D. advised by\nSamuel Wilks\n. He had already written his first paper\n[\n3\n]\n:-\nWilks\n's idea was that his students should produce a research paper early on to get them into the swing of such things and also to put\nWilks\nhimself in the position of being able to prove to the mathematics faculty, when the question of advancing to the doctoral dissertation came up, that the student could do publishable research. He proposed that I examine the distribution of runs above and below the mean.\nThe paper\nNote on an application of runs to quality control charts\nwas published in the\nAnnals of Mathematical Statistics\nin\n1941\n. In\n[\n6\n]\nMosteller contrasts the style of\nWilks\n's supervision compared with that of\nOlds\n:-\n[\nSamuel Wilks\n]\nwas a very different man from\nEdwin Olds\n. When\nEdwin Olds\nwanted you to do something you didn't have any misunderstanding about that job. He just told you. When\nWilks\nwanted you to do something, it was hard to catch it. You had to be alert for it. He would hint around, \"It would be nice if somebody did something of a certain kind.\" You had to grasp that he meant you. Coming from\nOlds\nit was a little hard for me to make it out sometimes.\nAfter his first paper was published, Mosteller thought that he could work on the problem of up and down runs for his doctoral thesis but, after producing quite an extensive collection of results, he saw that similar results which in fact went further than his had just been published in a paper by\nJacob Wolfowitz\n. He began to work on a new thesis topic but, partly because he was now doing work for the War Department in New York as his contribution to the United States war effort after the country had entered World War II, things only progressed slowly. In New York he also worked for the Office of Public Opinion research\n[\n3\n]\n:-\nShortly after World War II concluded in August\n1945\n, Virginia and I returned to Princeton. Except for some special mop-up work I did for\nMina Rees\nto help in closing out the work of the Applied Mathematics Panel, I worked on my thesis and on other research papers that had emerged during our stay in New York.\nAlthough\nWilks\nwas Mosteller's official thesis advisor, he was greatly assisted by\nTukey\n[\n6\n]\n:-\nJohn\n[\nTukey\n]\nbecame essentially the advisor on the thesis. I went around to John from time to time and asked him for some suggestions. He always did two things: Took a pass at the problem I asked him about and then he'd always suggest something else, something entirely different to work on. And I gradually got an important idea out of that experience which was that it's important to get out of ruts and into some new activity that may turn out to be more beneficial than the ruts you are already in and can't handle. So I owe John a great deal for that.\nJohn Tukey\nand\nSamuel Wilks\nwere running a very active statistics seminar at Princeton and Mosteller presented work to this seminar which led to useful discussions. He presented his doctoral thesis\nOn some useful \"inefficient\" statistics\nto Princeton and was awarded a Ph.D. in\n1946\n, publishing the results of his thesis in a paper in the\nAnnals of Mathematical Statistics\n. At this time he began joint work with\nJohn Tukey\nand others which led to a number of papers written with various coauthors:\nUnbiased estimates for certain binomial sampling problems with applications\n(1946)\n;\nLow moments for small samples: A comparative study of order statistics\n(1947)\nand\nThe uses and usefulness of binomial probability paper\n(1949)\n. After completing work for his thesis at Princeton, Mosteller was appointed as a lecturer in the Social Relations Department at Harvard University. He was promoted to professor in\n1951\nand, two years later, became acting head of the Department of Social Relations. In\n1957\nthe Statistics Department was set up at Harvard and Mosteller, who had been a leading figure in its creation, became its first chairman.\nIt was at Harvard that Mosteller became interested in applying statistical techniques to assist in healthcare. Caroline Richmond writes\n[\n33\n]\n:-\nMosteller did much to assess the effectiveness of treatments and contributed greatly to substantive understandings of what works to improve health. He was a pioneer in meta-analysis and systematic reviewing techniques. In a classic study he compared the results of cumulative meta-analyses of randomised clinical trials of treatment for myocardial infarction with the advice being offered in medical textbooks. The results were sobering.\nHis career at Harvard reflected this interest in healthcare. He served as Chairman of the Department of Biostatistics from\n1977\nto\n1981\nand during these years\n(\nactually in\n1978)\nhe was named Roger I Lee Professor. He then served as Chairman of the Department of Health Policy and Management from\n1981\nto\n1987\n. This last position was near the end of his career, for he retired and was made Professor Emeritus in\n1988\n. However, this did not in any way mark an end to his research activities for he continued to keep daily office hours in the Department of Statistics until\n2003\nwhen he moved to Virginia to be near his children.\nIn many ways Mosteller's contributions are too broad to give anything other than the briefest of overviews in this biography. His bibliography contains\n65\nbooks, around\n350\npapers in journals and conference proceedings,\n41\nother publications and\n26\nreviews, so we can look only at a few highlights. One of the highly significant publications by Mosteller\n(\nwith co-author David L Wallace\n)\nwas the book\nInference and Disputed Authorship: The Federalist\n(1964)\n.\nWilliam Kruskal\nwrites\n[\n26\n]\n:-\nThe book might well be regarded by historians as an application of statistics to settling longstanding disputes about authorship of the Federalist papers, but for Mosteller, Wallace, and most of the book's statistical readers, the Federalist focus of the book provided a specific, fascinating historical context in which to compare Baysian and frequentist modes of statistical analysis.\nGeorge Tiao writes\n[\n37\n]\n:-\n... this work represents a significant contribution to statistics. In particular, it shows how a real classification problem can be analyzed and what are the difficulties involved. After reading the book, one cannot help to have the feeling that it is this type of study which makes statistics a fascinating subject in its own right.\nIn\n1955\n, in collaboration with Robert Bush, Mosteller published\nStochastic Models for Learning\n.\nVajda\nwrites\n[\n38\n]\n:-\nIt is natural that psychologists should try to find out how we learn, or that teachers should want to know how our learning could be improved. The authors of this book wish to contribute to just one aspect of this wide field. It is their view that learning is probabilistic, in that events change the probability of responses. One gathers that not all professional psychologists agree, but to a mathematical statistician the concept is of intriguing interest.\nWe should mention another related area in which Mosteller did not apply statistics but rather he sought to raise the profile of statistics, namely in high school teaching. His efforts to see school children get some experience with ideas from probability and statistics saw him write teaching manuals and textbooks. For example, in collaboration with R E K Rourke and G B Thomas, he published\nProbability: A First Course\nin\n1961\n. Freda Conway writes\n[\n15\n]\n:-\nUsing only high school algebra and no calculus, they develop the subject from probability, permutations and combinations, through set theory to frequency distributions and statistical inference. Such a treatment necessarily limits the type of statistical problem which can be discussed: frequency distributions are limited to discrete variables and estimation problems only involve proportions. On the other hand probability is well worth studying for its own sake and this approach to statistics is both logical and mathematically satisfying.\nThis text formed the basis for a televised course that he gave in the same year making him well-known to school pupils across the United States. Also in\n1961\nthe same authors published an extended version of this book under the title\nProbability with Statistical Applications\n.\nMosteller had many collaborators but the person with whom he published most often was\nJohn Tukey\n. One of their joint works was the book\nData Analysis and Regression. A Second Course in Statistics\n(1977)\n. Edward Haertel writes\n[\n23\n]\n:-\nMosteller and\nTukey\nsystematically develop a range of techniques for exploring real data, mostly by hand. In the course of presenting these techniques, they offer new perspectives on the formulation of statistical and data analytical problems, the nature of uncertainty and the need for cross-validation, the need for multiple analyses of the same data, ways in which the data can guide the analysis, the importance of robust and resistant measures, and similar practical and philosophical problems. The stated purpose of the book is to teach attitudes and approaches, and to provide tools for their implementation.\nHowever, reviewing the same book, R L Holder is critical\n[\n24\n]\n:-\nI welcome the attempt that the authors have made to encourage common sense and thought in data analysis and regression but regret that they chose to mix a highly individual view of statistics with an objective that their book should be read by all. It has produced a text which is generally unrepresentative and confusing for students yet too verbose and loosely argued for a more advanced readership.\nMosteller received a long list of honours of which we can only mention a selection. He was awarded honorary degrees from the University of Chicago\n(1973)\n, Carnegie-Mellon University\n(1974)\n, Yale University\n(1981)\n, Wesleyan University\n(1983)\nand Harvard University\n(1991)\n. He was elected to the\nNational Academy of Sciences\n, the American Philosophical Society, the\nAmerican Academy of Arts and Sciences\n, and the\nRoyal Statistical Society\n. He won several prizes including the Myrdal Science Award\n(1973)\n, the Paul Lazarsfeld Prize for Applied Social Research\n(1979)\n; the\nSamuel S Wilks\nAward from the\nAmerican Statistical Association\n(1986)\n; the\nR A Fisher\nAward\n(1987)\n; the Surgeon General's Medallion\n(1988)\n; and the Rossi Award\n(2005)\n. He was president of the Psychometric Society\n(1957\n-\n1958)\n, the\nAmerican Statistical Association\n(1967)\n, the Institute of Mathematical Statistics\n(1974\n-\n1975)\n, and the American Association for the Advancement of Science\n(1980)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Combinatorics",
    "Logic",
    "Statistics"
  ]
}