{
  "nome_completo": "Fred Hoyle",
  "nome_curto": "Fred Hoyle",
  "ano_nascimento": "1915",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hoyle/",
  "lugar_nascimento": "Bingley, Yorkshire, England",
  "lugar_morte": "Bournemouth, England",
  "biografia": "Fred Hoyle\n's parents were Ben Hoyle and Mabel Pickard. Mabel's father had died when she was a small child. As a young girl she had worked in a mill in Bingley and had saved up enough money to study music at the Royal Academy of Music in London. After training there she decided not to perform but she taught music in schools before marrying Ben. Like Mabel, Ben had worked in a mill. He had been forced to leave school at the age of eleven since his family were too poor to support his education any longer.\nFred's parents bought\n4\nMilnerfield Villas on the outskirts of the village of Gilstead in West Yorkshire in\n1910\nand they were living there when World War I broke out in\n1914\n. Their first child was Fred who was born at\n4\nMilnerfield Villas just before his father was conscripted into the British army, choosing to join the Machine Gun Corps. Quite why he chose this is unclear for the chances of survival were extremely slim and one might have thought that, with a wife and young child, he would have tried to maximise his chances. Obviously he did not think in this way, and against all the odds he survived the war. It was an extremely difficult time for Fred's mother who had to bring up her young child in difficult circumstances, living in continual fear that she would receive a letter telling her that her husband had been killed. Mabel earned a little money by playing the piano for the silent films in Bingley cinema. She also provided Fred with his early education, in particular teaching him numbers.\nAfter World War I ended Ben returned to civilian life and he set up a cloth business\n(\nparticularly dealing in wool\n)\nin Bradford, the nearest large town. At first the business did well and in\n1920\nit was decided to send Fred to a small private school. However there was a sharp downturn in business in general in\n1921\nand by the time that Fred started school his father's cloth business was suffering badly. The start of Fred's school education marked the beginning of a difficult time\n[\n2\n]\n:-\nBetween the ages of five and nine, I was perpetually at war with the educational system. My father always deferred to my mother's judgement in the several crises of my early educational career, because she had been a schoolteacher herself ... events would suggest that my mother was unreasonably tolerant of my obduracy. But, precisely because she had been a teacher herself, my mother could see that I made the best steps when I was left alone.\nFred only attended the private school for a few weeks in July\n1921\nbefore his father decided to temporarily give up his failing cloth business and move to Rayleigh in Essex. There Fred entered a school near Thundersley and immediately made friends with a classmate. The pair worked out a way to play truant but before they had much chance to try their scheme out Fred's family returned to Gilstead in November\n1921\non hearing that there were problems with the people to whom they had let their house. Back home, Fred was returned to his first school in January\n1922\n:-\nI returned to the same private school as before, but I returned no longer an innocent child prepared to have irrelevant knowledge poured into my head by the old beldame who ran the place.\nIn March Fred put his truancy scheme into practice and while his parents believed he was at school, the school believed that he was ill at home. After a couple of months his parents found out what was going on, but he was allowed to choose a new school instead of returning. He decided to attend Morning Road School in Bingley but there he performed rather poorly in tests that were carried out. This was hardly surprising since he had avoided school most of the time up till then, and soon he was avoiding school again partly through genuine illness and partly through pretending to be ill during the winter of\n1923\n-\n24\n.\nDespite his attempts to avoid formal education Hoyle did show interest in educating himself. He read a chemistry book which belonged to his father and found an interest in the subject which would last a lifetime. However problems at Morning Road School prompted another move and he began to attend Eldwick school from September\n1924\n. After Hoyle narrowly missed out on a scholarship for grammar school, an appeal was entered and he scraped through beginning his studies at Bingley Grammar School in September\n1926\n. His war with the education system had ended, and although there were still many educational problems ahead, he now approached education with a much more positive attitude.\nIn\n1927\nBingley town library acquired a copy of\nEddington\n's\nStars and Atoms\nand Hoyle read it avidly. By the end of his first year at the Grammar School, he had progressed from his entry position of\n16\nth\nin the class to top the class. His interest in chemistry continued and as he neared the end of his school career he decided to go to Leeds University to study chemistry there. Taking the scholarship examinations in September\n1932\nhe narrowly missed out. Unable to study at university without a scholarship, he returned to Bingley Grammar School but instead of working steadily through the year with the aim of gaining a scholarship to Leeds at the second attempt, Hoyle decided to aim at a Cambridge University Scholarship. It was an ambitious scheme but one which he felt would at least give him practice at taking such examinations.\nBingley Grammar School did not really have the teaching resources to bring Hoyle rapidly up to Cambridge Scholarship standard, but the mathematics teacher did his very best and gave him lessons in his own home. Hoyle sat the scholarship examinations in Emmanuel College Cambridge in December\n1932\n:-\nIf a miracle happened and I won something in Cambridge, well and good. I would be glad to accept it, but my real aim ... was to prove to myself that the efforts of the past three months had really improved my standards.\nHoyle's performance was good in physics and chemistry but, as he expected, his preparation for mathematics had been weak and the mathematics paper dragged him down. He missed the scholarship standard but decided to take the scholarship examinations at Pembroke College, Cambridge in March\n1933\n. This time his performance was better and he did make the scholarship standard, but the College did not have scholarships for everyone who made the standard, and again Hoyle missed out. However, he could now get into Cambridge by winning a scholarship in the Yorkshire scholarship competition and he was successful in this in the summer of\n1933\n, with now mathematics as his best subject.\nIn the autumn of\n1933\nHoyle entered Emmanuel College, Cambridge, intending to read for a degree in science. His tutor was a mathematician, P W Wood, who told him at their first meeting that his mathematics was not good enough to read for a degree in science so he advised that Hoyle take Part I of the Mathematical Tripos which would put him in a good position to study science after that with a better grounding in mathematics. So Hoyle embarked on the one year mathematics course, entering at the bottom level of the slow stream. His aim was to get himself into the middle of the slow stream by the time he took Part I of the Mathematical Tripos and indeed he achieved better than this for he was in the top quarter of this slow stream by the end of year one.\nHaving achieved his aim in mathematics, it would have been natural for Hoyle to move into the science course as he had intended. However, he was always one to rise to a challenge and having progressed so well it was natural for him to wonder how much higher he could climb in mathematics. There was another argument which told him to carry on with mathematics which was that the great Cambridge scientists like\nNewton\n,\nMaxwell\n,\nKelvin\n,\nEddington\nand\nDirac\nhad all been mathematicians. He decided to carry on and entered his second year of study of mathematics at the bottom of the fast stream. Again he progressed well and ended the year well into the top half of the class.\nHoyle was taught by some outstanding people while he was an undergraduate at Cambridge. For example\nBorn\ntaught him quantum mechanics,\nEddington\ntaught him general relativity, and he was also taught by\nDirac\n. He was placed in the top ten when he took the Mathematical Tripos in\n1936\nand was awarded the Mayhew Prize as the best student in applied mathematics. Continuing to study at Cambridge, his research was supervised by Rudolf Peierls and his career went from strength to strength with the award of the top Smith's Prize in\n1938\nand then, with Peierls and R H\nFowler\nas referees, he was awarded a prestigious Goldsmith's Exhibition. By this time he was being supervised by Maurice Pryce who took over when Peierls went to the chair of Applied Mathematics at Birmingham. In\n1939\nHoyle published a major paper on\nQuantum electrodynamics\nin the\nProceedings of the Cambridge Philosophical Society\n. Although Hoyle had completed the work for a Ph.D. by then he was persuaded by Pryce not to submit\n(\nthe Ph.D. was new to Cambridge and Pryce did not approve of it\n)\n.\nAlthough his research was in applied mathematics, it was through the problem of accretion of gas by a large gravitating body which Ray Lyttleton discussed with him that Hoyle's interests turned towards mathematical problems in astronomy. With everything going his way, with election to a Fellowship at St John's in May\n1939\nfor work on beta decay and receiving a highly prestigious award from the Commission for the Exhibition of\n1851\n, his career was suddenly put on hold with the outbreak of World War II\n[\n2\n]\n:-\nWar would change everything. It would destroy my comparative affluence, it would swallow my best creative period, just as I was finding my feet in research.\nShortly after the outbreak of war Hoyle married Barbara Clark on\n28\nDecember\n1939\n. They had one son Geoffrey\n(\nwith whom Hoyle would have several joint publications\n)\nand one daughter Elizabeth. During the war Hoyle worked for the Admiralty on radar, doing most of this work in Nutbourne. He had little time for research in astronomy but continued collaboration with Lyttleton when it proved possible\n(\none occasion being when he had leave in\n1942\nfor the birth of his first child Geoffrey\n)\n. During his time with the Admiralty Hoyle worked with Hermann Bondi and Thomas Gold and he discussed astronomy with them in spare moments. These three would later propose \"steady-state cosmology\" for which Hoyle is probably best known.\nIn\n1944\nhe visited the USA because of his work on radar and while there he worked out what was going on with the atomic bomb project. This led him to think of nuclear reactions, and out of this came one of his most important ideas about how the elements were created. He returned to Cambridge at the end of the war as a Junior Lecturer in Mathematics. His teaching duties were to give a geometry course and a statistical mechanics course in\n1945\n-\n46\n. In\n1945\nhe published\nOn the integration of the equations determining the structure of a star\nwhich discussed the most advantageous way of integrating the equations of stellar equilibrium. In the spring of\n1946\nhe wrote his important paper which developed from the ideas he had about the creation of the elements\nThe Synthesis of the Elements from Hydrogen\nwhich appeared in the\nMonthly Notices of the Royal Astronomical Society\n.\nAfter three years as a Junior Lecturer in Mathematics, Hoyle was promoted to Lecturer in Mathematics at Cambridge and given tenure. He stopped teaching geometry, teaching instead courses on Electricity and Magnetism, and on Thermodynamics. His range of publications broadened with works on many different topics and at many different levels. In\n1948\nhe published two papers on steady-state cosmology. His first move into explaining science to a general audience came in\n1950\n. He broadcast five astronomy lectures on the Third Programme\n(\nnow called Radio\n3)\n. These were extremely popular and were often repeated, with versions being broadcast in the United States and a book\nNature of the Universe\nbeing published based on the lectures. It was in the last of these five lectures that Hoyle coined the phrase \"Big Bang\" for the creation of the universe. Although now accepted by most scientists, the term was actually meant to be a scornful description of the creation theory which Hoyle did not accept.\nIn\n1957\nHoyle published his first science fiction novel\nThe Black Cloud\nwhich achieved much praise and has since become a classic\n(\nabout a dozen of his\n40\nbooks have been on science fiction\n)\n[\n1\n]\n:-\n... he wrote\n[\nscience fiction\n]\nsuccessfully for more than three decades, winning a devoted following. His most famous novel was 'October The First Is Too Late', in which Britain and Hawaii remain in\n1966\n, the Americas are switched back to the\n15\nth\ncentury and the Soviet Union exists in a future time when the surface of the Earth is a plate of glass.\nHoyle also wrote the television serial 'A for Andromeda' and the children's play' Rockets in Ursa Major'. When this was performed in\n1962\nat the Mermaid Theatre, one critic wrote: \"Seldom can scientific mumbo-jumbo have sounded so convincing.\" This writing, Hoyle believed, complemented his serious work, in the middle of which he would stop to indulge in what he called \"whimsical fantasies.\" He was convinced that really important discoveries were most likely to come from an exercise of creative imagination.\nHe became Plumian Professor of Astrophysics and Natural Philosophy on\n1\nOctober\n1958\nafter\nHarold Jeffreys\nretired, a position which he held until he resigned in\n1972\n. During his tenure of the chair continued to publish many important works such as his collaborative work with William Fowler,\nNuclear cosmochronology\npublished in\n1960\nin the\nAnnals of Physics\nwhich described how the observed ratios of the abundance of different isotopes of uranium and thorium can be used to determine a cosmical time-scale. In\n1966\nHoyle founded the renowned Institute of Theoretical Astronomy at Cambridge and was its Director until\n1972\n.\nThe events leading up to Hoyle's resignation from Cambridge in\n1972\nare recounted in\n[\n2\n]\n. He explained his reasons in a letter to Lovell\n(\nsee\n[\n5\n]\n)\n:-\nI do not see any sense in continuing to skirmish on a battlefield where I can never hope to win. The Cambridge system is effectively designed to prevent one ever establishing a directed policy - key decisions can be upset by ill-informed and politically motivated committees. To be effective in this system one must for ever be watching one's colleagues, almost like a Robespierre spy system. If one does so, then of course little time is left for any real science.\nFollowing this he made his home in the Lake District but he continued to come up with interesting, and often unconventional, theories such as those concerning Stonehenge, panspermia\n(\nthat the origin of life on Earth must have involved cells which arrived from space\n)\n, Darwinism, palaeontology, and viruses from space. I\n[\nEFR\n]\nwas lucky enough to hear Hoyle speak about his theory that Stonehenge was built as an eclipse predictor. It was an inspiring talk which, like so much of Hoyle's work, really made one think about things in a new light. Hoyle continued to publish up to the end of his life with\nMathematics of evolution\nappearing in\n1999\nand\nA Different Approach to Cosmology: From a Static Universe through the Big Bang towards Reality\n(\nwritten jointly with G Burbidge and Narlikar\n)\nbeing published in\n2000\n.\nHoyle received many honours. He was knighted in\n1972\n. He was elected to many academies and learned societies including the\nRoyal Society of London\n(1957)\n, the\nNational Academy of Sciences\nof the United States\n(1969)\n, the American Philosophical Society\n(1980)\n, the\nAmerican Academy of Arts and Science\n(1964)\n, and the\nRoyal Irish Academy\n(1977)\n. He received many honours including: the United Nations Kalinga Prize in\n1968\n, the Gold Medal of the\nRoyal Astronomical Society\nin\n1968\n, the Bruce Medal from the Astronomical Society of the Pacific in\n1970\n, the Royal Medal of the\nRoyal Society\nin\n1974\n, the Dag Hammarskjöld Gold Medal, the Karl Schwartzchild Medal, the Balzan Prize in\n1994\n, and the Crafoord Prize awarded by the\nRoyal Swedish Academy of Sciences\nin\n1997\n. Typical of the citations he received for such awards was that of the Royal Medal which states that his:-\n... enormous output of ideas are immediately recognised as challenging to astronomers generally... his popularisation of astronomical science can be warmly commended for the descriptive style used and the feeling of enthusiasm about his subject which they succeed in conveying.\nWickramasinghe writes in\n[\n7\n]\n:-\n... Hoyle sought to answer some of the biggest questions in science: How did the Universe originate? How did life begin? What are the eventual fates of planets, stars and galaxies? More often than not he discovered answers to such questions in the most unsuspected places. For instance he discovered that the secret of how stars evolve lay in a certain property of the carbon nucleus, a property\n(\na resonance\n)\nthat was not discovered until Fred himself had pointed to its absolute necessity.\nFred believed that, as a general rule, solutions to major unsolved problems had to be sought by exploring radical hypotheses, whilst at the same time not deviating from well-attested scientific tools and methods.\n...\nFred Hoyle had no respect for the boundaries between scientific disciplines which were artificial social constructs that often stood in the way of a proper comprehension of the cosmos. The Universe does not respect the differences between physics, chemistry and biology, he would say, and his career in astronomy progressively embraced all these disciplines.\nMartin Rees has written this tribute:-\nHoyle's enduring insights into stars, nucleosynthesis, and the large-scale universe rank among the greatest achievements of\n20\nth\n-century astrophysics. Moreover, his theories were unfailingly stimulating, even when they proved transient. He will be remembered with fond gratitude not only by colleagues and students, but by a much wider community who knew him through his talks and writings.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}