{
  "nome_completo": "Frederick Justin Almgren",
  "nome_curto": "Frederick Justin Almgren",
  "ano_nascimento": "1933",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Almgren/",
  "lugar_nascimento": "Birmingham, Alabama, USA",
  "lugar_morte": "Princeton, USA",
  "biografia": "Frederick Justin Almgren\nis really Frederick Justin Almgren Junior since his father was also named Frederick Justin Almgren. Frederick Almgren Senior worked for the Securities and Exchange Commission during World War II, then following that he set up a number of businesses. Frederick Almgren Junior's mother was Sarah Cone Wright who worked as a real estate agent. Frederick had a younger brother David, and a younger sister Linda. He attended elementary school in Chevy Chase, Maryland, then continued his schooling at Swarthmore, Pennsylvania, before completing his high school studies at Princeton, New Jersey.\nAlmgren was an undergraduate at Princeton University but he did not major in mathematics, rather his main topic was engineering and it was in that subject that he graduated in\n1955\n. While he was an undergraduate he\n[\n7\n]\n:-\n... won three varsity track letters as a pole vaulter, sang in the Glee Club and directed its close harmony group, played in the marching band, and served in the Naval R.O.T.C.\nAfter graduating from Princeton, Almgren became an Officer in the United States Navy and spent three years on active service flying jet fighter planes with Attack Squadron\n66\n. Jean Taylor writes in\n[\n2\n]\n:-\nHe delighted to tell his graduate students stories about his flying days, including how he once flew his plane through the top of a tree and had a piece of wood in a wing when he landed.\nAnother story from his flying days is told by Mackenzie in\n[\n4\n]\n. Almgren flew into a thunderstorm:-\nWhen he looked at his instruments, they showed he was flying upside down, but he was sure he was not. Nevertheless, he 'went by the book'. He rolled the airplane until the instruments said he was right side up\n(\nalthough he said he could then feel himself hanging by the straps that pilots belt themselves in with\n)\nand turned around to fly back out the direction he'd been coming in .... After a while he emerged from the storm - and there were the lights of Galveston below him. So, yes, the instruments had been correct. But it took him a while to reorient his sense of up and down and accept that he wasn't hanging by his straps.\nIn\n1958\nAlmgren entered Brown University to begin research in mathematics. However, he did not give up his attachment with the Navy for he joined the Navy Research Reserve at this time and served in that capacity for a further\n17\nyears. At Brown University an exciting phase had just started with Wendell Fleming collaborating with\nHerbert Federer\nin geometric measure theory.\nFederer\nsupervised Almgren doctoral studies and Almgren wrote a thesis\nThe Homotopy Groups of the Integral Cycle Groups\nwhich earned him a Ph.D. in\n1962\n. He published a paper of over\n40\npages based on the work of his thesis in\nTopology\nin the year he received his doctorate. His time at Brown University had not been entirely devoted to mathematics, however, for he built a sailing boat which he then sailed.\nAfter completing his studies at Brown University, Almgren was appointed as an Instructor in Mathematics at Princeton University. He held this for the year\n1962\n-\n63\nbut then resigned the position so that he could become a Visiting Member of the Institute for Advanced Study at Princeton. After two years he returned to Princeton University where he was appointed an assistant professor in\n1965\n. Already he had published three further papers:\nAn isoperimetric inequality\n(1964)\n;\nThree theorems on manifolds with bounded mean curvature\n(1965)\n; and\nMass continuous cochains are differential forms\n(1965)\n. In addition he had written the short book\nPlateau's problem: An invitation to varifold geometry\nwhich was published in\n1966\n.\nLaurence Young\nwrites:-\nPlateau's problem\nis understood, in this little book, in a somewhat different sense from that of a generation ago. The reasons for this are partly indicated, for readers with only an advanced calculus background, in terms of examples, illustrated by a series of rather beautiful diagrams in colour. The concepts to which one is led are those first introduced in the theory of generalized surfaces. The book limits itself to the special cases most directly relevant to the formulation of\nPlateau\n's problem by Reifenberg,\nFederer\nand Fleming.\nIn\n1968\nAlmgren was promoted to associate professor and then full professor in\n1972\n. Following this he spent several periods at the Institute for Advanced Study, namely\n1974\n-\n75\n,\n1981\n-\n82\n,\n1985\n,\n1989\nand\n1992\n. Almgren was married twice. With his first wife Beverly Stewart he had two children; Robert who went on to become a professor of mathematics, and Ann who also became a mathematician working on computational fluid dynamics. Almgren's second wife was his first Ph.D. student, Jean Ellen Taylor; they married on\n6\nOctober\n1973\n(\nthe year Jean was awarded her doctorate\n)\nand had one daughter Karen.\nIn\n[\n2\n]\nJean Taylor writes about Almgren:-\nFred found joy in everything. He used every possible excuse for celebrations: birthdays of course, but also especially fast times in jogging, good grades of his children, a paper of his or mine accepted for publication, or even a paper just finished. ... The drawer by the side of his bed is that of a six-year-old kid, not a\n63\n-year-old man. Among its contents are a gyroscope, two magnets, four coloured balls from Cheerios boxes, two magnifying glasses, a fishing lure, a Star Trek communicator button, and five pretty rocks.\nAlmgren was diagnosed with bone marrow cancer in August\n1996\nand underwent a bone marrow transplant\n(\ndonated by his sister\n)\nin Boston in September. After about a month in hospital he was released and appeared to be making an excellent recovery. However, in January\n1997\nhe developed pneumonia and was readmitted to hospital. He died of complications which followed the pneumonia. White writes in\n[\n9\n]\nand\n[\n10\n]\n:-\nFrederick Justin Almgren, Jr, one of the world's leading geometric analysts and a pioneer in the geometric calculus of variations, died on February\n5\n,\n1997\nat the age of\n63\nas a result of myelodysplasia. Throughout his career, Almgren brought great geometric insight, technical power, and relentless determination to bear on a series of the most important and difficult problems in his field. He solved many of them and, in the process, discovered ideas which turned out to be useful for many other problems.\nAlmost certainly Almgren's most impressive and important result was only published in\n2000\n, three years after his death. Why was this? The paper was just too long to be accepted by any journal. Brian Cabell White explains the background in a review of the book published in\n2000\ncontaining the result:-\nBy the early\n1970\ns, geometric analysts had made spectacular discoveries about the regularity of mass-minimizing hypersurfaces.\n(\nMass is area counting multiplicity, so that if k sheets of a surface overlap, the overlap region is counted k times.\n)\nIn particular, the singular set of an m-dimensional mass-minimizing hypersurface was known to have dimension at most m -\n7\n. By contrast, for an m-dimensional mass-minimizing surface of codimension greater than one, the singular set was not even known to have m-measure\n0\n. Around\n1974\n, Almgren started on what would become his most massive project, culminating ten years later in a three-volume,\n1700\n-page preprint containing a proof that the singular set not only has m-dimensional measure\n0\n, but in fact has dimension at most\n(\nm -\n2)\n. This dimension is optimal, since by an earlier result of\nH Federer\nthere are examples for which the dimension of the singular set is exactly\n(\nm -\n2)\n. ... Now, thanks to the efforts of editors Jean Taylor and Vladimir Scheffer, Almgren's three-volume,\n1700\n-page typed preprint has been published as a single, attractively typeset volume of less than\n1000\npages.\nLet us record three comments by former Ph.D. students of Almgren. The first is by Frank Morgan\n(\nPh.D. in\n1977)\n[\n2\n]\n:-\nSome great mathematicians seem to work by incomprehensible brilliant leaps and insights, but in Almgren I found a comprehensible definition of intelligence: facing a question head on and faithfully persisting in overcoming every obstacle.\nJohn Sullivan\n(\nPh.D. in\n1990)\nwrites\n[\n2\n]\n:-\nFred's lectures and classes were always full of wonderful geometric insights and pictures. But his writing was often in the drier style that he must have learnt from\nFederer\n. ... Fred's advice on coauthorship was that it is always better to err on the side of generosity: this does nobody harm, and leads to rewarding and productive collaborations.\nOur third quote is from Jean Taylor\n(\nsee\n[\n4\n]\n)\n:-\nWhen I'd come in feeling I was making zero progress, I always came out feeling much better, because lo and behold, the thing I was stuck on and the progress I was making on it were something worth doing.\nFred Almgren received many honours for his outstanding contributions. He was an Alfred P Sloan Fellow in\n1968\n-\n70\n, an Exchange Visitor at the\nSteklov\nMathematical Institute in Leningrad in\n1970\n, a John Simon Guggenheim Memorial Fellow in\n1974\n-\n75\n, and\nEarle Raymond Hedrick\nLecturer for the\nMathematical Association of America\nin\n1975\n. He was elected a fellow of the American Association for the Advancement of Science in\n1982\n, was awarded a medallion by Brown University in\n1988\n:-\n... in recognition of distinguished contributions to society through scholarship and professional activity ...\nand he received the Class of\n55\nPublic Service Award from Princeton University in\n1988\n:-\n... for contributions to society beyond the bounds of occupation.\nAmong his service we should mention he was an editor of three journals: the\nJournal of Experimental Mathematics\n, the\nJournal of Geometric Algebra\n, and\nDifferential Geometry and its Applications\n. He administered the Geometry Supercomputer Project for the Geometry Computing Group and served on the\nAmerican Mathematical Society\nCommittee on Applications of Mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}