{
  "nome_completo": "Freeman John Dyson",
  "nome_curto": "Freeman Dyson",
  "ano_nascimento": "1923",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dyson/",
  "lugar_nascimento": "Crowthorne, Berkshire, England",
  "lugar_morte": "Princeton, New Jersey. USA",
  "biografia": "Freeman Dyson\n's parents were Mildred Lucy Atkey and George Dyson. George was very talented, both as a teacher of music and as a writer on music. At the time of Freeman's birth George was teaching music at Wellington College in Berkshire. He had earlier taught at Marlborough College where he was a colleague and close friend of Mildred's brother Freeman Atkey. After the death of Freeman Atkey, who was killed in action during World War I, both George and Mildred were shattered. It brought them close together and they married in\n1916\n. Their first child Alice was born in\n1919\n, then their second child was Freeman who was named after Freeman Atkey.\nShortly after Freeman was born, his father accepted the post of Master of Music at Winchester College, and so Freeman spent his early years in Winchester. He was closer to his mother than to his father, for she was the more serious of the two being extremely talented and well read. The family were well off and employed a cook, gardener, housemaid and nursemaid. Freeman attended a day school run by Miss Scott from the time he was five years old. Already he was showing exceptional talents for reading, writing and calculating. From the age of nine he was a boarder at Twyford College which was only three miles from his home. Despite the fact that the school was so close to his home, Freeman only went home in the school holidays and his parents never visited him in the school.\nIn\n1936\nDyson won first place in a scholarship examination to Winchester College; he was twelve. That first place indicated significant promise and for the first time in his life he began to realise how talented he was. He was an outstanding student across the curriculum, but proved to be brilliant at mathematics. Up until that time he had appeared as a very unusual pupil, very different from his fellow pupils. However he now gained respect from his fellow pupils and his parents were quite bowled over by their son's success. Winchester College was important for freeman for it gave him an outstanding mathematical education. Not only did he have one of the finest mathematics teachers in the country, namely\nC V Durell\n, but he was in the same class as\nJames Lighthill\nand the two studied advanced mathematics together such as\nJordan\n's\nCours d'Analyse\n. Foreign languages came easily to Dyson and when he became interested in number theory in\n1938\nhe decided to read\nAn introduction to the theory of numbers\nby\nVinogradov\n. The fact that the book was only available in Russian at that time was apparently no problem and he taught himself the language and translated the book into English. In the following year he read\nEddington\n's\nThe mathematical theory of relativity\n.\nDyson gained a scholarship to Trinity College, Cambridge in\n1941\n. In his first year he studied physics under\nDirac\nand pure mathematics under\nHardy\nand\nBesicovitch\n. During his time there he wrote several papers that were not published until\n1944\n. The first, written in\n1941\n(\npublished in\n1944)\nis\nA proof that every equation has a root\n. Dyson writes:-\n... there are so many proofs of the theorem that every equation has a root that it seems almost criminal to produce another. I can however say two things in my defence; first, the proof I shall give is probably not a new one; second, if my proof is new it has a certain advantage over other proofs in using only the most elementary arguments.\nDyson had three papers published in\n1943\n,\nThree identities in combinatory analysis\nand\nOn the order of magnitude of the partial quotients of a continued fraction\nare consecutive papers in the\nJournal of the London Mathematical Society\nwhile\nA note on kurtosis\nappeared in the\nJournal of the Royal Statistical Society\n. Of course these years that Dyson spent at Cambridge were in the middle of World War II and as a result many of the academics had left to undertake war work. Although not a particularly happy time for Dyson he did have a couple of good friends. As a diversion from his work, he and his friends would occupy evenings \"night climbing\" various architectural features of Cambridge.\nIn\n1943\nDyson, despite earlier pacifist beliefs, started work as a scientist with Bomber Command where he worked on increasing mission efficiency. He worked long hours at this work but also managed to continue with his mathematics research and to read some physics texts. At the end of the war, Dyson took a job as a demonstrator at Imperial College. During this time he wrote an influential paper\nOn simultaneous Diophantine approximations\non\ncontinued fractions\n. He returned to Trinity College in\n1946\nas a fellow having written a dissertation from which he published three papers;\nA theorem on the densities of sets of integers\n(1945)\n,\nA theorem in algebraic topology\n(1948)\n, and\nOn the product of four non-homogeneous linear forms\n(1948)\n. Back at Cambridge, however, he began working on theoretical physics which was to become his main topic of research although, as we note below, he continued to publish papers on pure mathematics. During this time he was advised to consider moving to the USA. On advice from Peierls\n(\nBirmingham\n)\nand others, he decided to apply to work with Bethe in Cornell.\nGeoffrey Taylor\nwrote a letter of reference to Bethe\n(\nsee for example\n[\n4\n]\n)\n:-\nYou'll have received an application from Mr Freeman Dyson to come to work with you as a graduate student. I hope that you will accept him. Although he is only\n23\nhe is in my view the best mathematician in England.\nDyson worked closely with Bethe and became deeply impressed by him\n(\nas all Bethe's students were.\n)\nIn\n1948\nDyson published a paper on Lamb shift in\nPhysical Review\ncalled\nThe Electromagnetic Shift of Energy Levels\n. This was the first paper he had published on physics, and it showed his remarkable ability at calculation as well as a deep physical understanding. It is clear that at this time Dyson was considered to be an extraordinarily gifted and able student. Bethe persuaded Oppenheimer to take Dyson on at the Institute for Advanced Study at Princeton. He wrote in his letter of recommendation:-\nMr Dyson is absolutely unusual in his ability and accomplishments. I can say without reservation that he is the best I have ever had or observed.\nIt was from this time that Dyson's work focused on quantum electrodynamics. Something happened at this time that greatly pleased Dyson; Tomanaga in Japan had developed significant work in relativistic quantum field theory. It was not just that the work was so significant, it was that it came from an unexpected source and indicated that the USA was not the only place producing significant research in this field. Tomonaga's work differed from\nSchwinger\n's by virtue of its clarity and simplicity. Around spring in\n1948\n, Dyson and\nFeynman\nbecame friends and Dyson became familiar with\nFeynman\n's methods. What characterised the two was their prodigious ability at calculation. After a long bus ride to Princeton Dyson famously figured out a very significant problem that had bothered him during the year. He now saw how to demonstrate the equivalence of\nSchwinger\n's and\nFeynman\n's theories. These ideas eventually formed the basis for his impressive work\nThe radiation theories of Tomonaga, Schwinger, and Feynman\nwhich was published in the\nPhysical Review\nin\n1949\n. Corben wrote in a review:-\nThe Tomonaga-Schwinger quantum electrodynamics is discussed with due emphasis on the physical ideas involved and the equivalence with a mainly unpublished theory by\nFeynman\nis established.\nDyson arrived at Princeton in the Autumn of\n1948\n. He was never quite at ease with Oppenheimer. He felt that Oppenheimer was superficial - and compared with Bethe was poor at giving guidance and support to his students. Bethe continued to be a real support to Dyson and at an influential seminar helped Dyson persuade the audience\n(\nwhich including Oppenheimer\n)\nthat\nFeynman\n's methods were the most promising way to proceed. Dyson's famous paper on renormalisation of the\nS\nS\nS\n-matrix\nThe S matrix in quantum electrodynamics\nin\n1949\nbecame a very highly regarded and influential work in quantum electrodynamics. The contents and methods of this important paper are summarised by W H Furry:-\nThe application of quantum electrodynamics to scattering problems is discussed in terms of the calculation of the S matrix, an operator which converts the ingoing waves of the initial state into the outgoing waves of the final state. ... The calculation of the S matrix is represented by a set of graphs, in which directed lines represent electrons and undirected dotted lines represent photons or interactions with a given electromagnetic field. Internal lines of a graph represent virtual states of particles, either serving to provide interactions between observed particles or else representing fluctuations of the fields, giving rise to effects such as self-energy; lines extending to the edge of a graph represent observed particles or interactions with the given field. There are, of course, many graphs for any given process, and corresponding to each of these there is a contribution to the S matrix, which can be written down from inspection of the graph, according to rules devised by\nFeynman\nand presented in\n[\nDyson's\n]\nprevious paper.\nDyson started to become a celebrity in scientific circles. He was aware of the risks of such fame and tellingly said:-\nI believe I am wise enough to enjoy this sort of success without having been taken in by it; if I were not, I have the example of\nFeynman\nto instruct me.\nIn early\n1949\nhe planned to return to Britain and asked Oppenheimer's advice on which institution to join. Oppenheimer said:-\nWell, Birmingham has much the best theoretical physicist to work with, Peierls; Bristol has much the best experimental physicist, Powell; Cambridge has some excellent architecture ...\nIn Bethe's reference for Dyson's application to join Peierls, he described Dyson as the:-\n... best English theorist since\nDirac\n.\nIn the summer of\n1949\nDyson met Verena Esther Haefeli-Huber at the Institute for Advanced Study. She was a Swiss mathematician who had published her doctoral thesis\nEin Dualismus als Klassifikationsprinzip in der abstrakten Gruppentheorie\nin the previous year. It generalised two papers by\nP Hall\n. Dyson became engaged to Verena in the summer of\n1950\nand they were married later that year on\n11\nAugust. They had two children: Esther Dyson was born on\n14\nJuly\n1951\nin Zürich, Switzerland, and George Dyson born in Ithaca, New York in\n1953\n. Esther went to Harvard at the age\n16\n, where she majored in economics. An author and journalist, she is a major figure in the world of computing. George Dyson left home at age\n16\n, moved to British Columbia where he built canoes, explored the Northwest Coast, and made his home in a tree-house. Dyson and his wife were divorced in\n1958\nand in the same year, on\n21\nNovember, he married Imme Jung; they had four daughters, Dorothy, Emily, Mia and Rebecca.\nAfter finishing the\nS\nS\nS\n-matrix paper, Dyson turned to meson theory where he devised a method of separating the calculation of high and low frequency interactions. After further important publications and contributions to international conferences, in May\n1950\nDyson took over\nFeynman\n's professorship at Cornell. Bethe's admiration for Dyson had by now become great. Bethe stated that Dyson was \"the only man in the world \" who could replace\nFeynman\nat Cornell.\nIt is amusing to note that at no point during Dyson's impressive career did he appear to obtain a Ph.D. It just did not figure in the scheme of things. Less amusing perhaps is that he may well qualify for the \"best physicist never to receive a Nobel Prize\" award. This never seemed to trouble him, but many people believe he should have received one along with\nFeynman\n,\nSchwinger\nand Tomonaga.\nIn\n1953\nDyson accepted a post as professor of physics at Institute for Advanced Study, Princeton. We remarked above that Dyson continued to publish research papers on pure mathematics despite now being a physicist. For example he published the ingenious paper\nContinuous functions defined on spheres\nin the\nAnnals of Mathematics\nin\n1951\n,\nA new symmetry of partitions\nin\n1961\n,\nMappings and symmetries of partitions\nin\n1989\n,\nMean square value of exponential sums related to representation of integers as sum of two squares\n(\njointly with Pavel Bleher\n)\nin\n1994\n, and\nThe sixth Fermat number and palindromic continued fractions\nin\n2001\n.\nWe should give special mention to the paper\nA walk through Ramanujan's garden\nwhich Dyson published in\n1988\n. Christian Radoux writes in a review:-\nThis paper is the text of a lecture given by the author. It tells a long and beautiful story: for\n48\nyears, the author has studied\nRamanujan\n's work, first through the book of\nHardy\nand\nWright\n, next in the \"Collected papers\", in the \"Lost notebook\" and in the work of several other mathematicians. It gives us the opportunity to follow his own research about congruence properties of partitions, special series and infinite products, generating functions, and modular functions, ...\nDyson has also published several books on science/philosophy, including\nDisturbing the Universe\n(1979)\n,\nWeapons and Hope\n(1984)\n,\nOrigins of Life\n(1986)\n,\nInfinite in all Directions\n(1988)\n,\nFrom Erod to Gaia\n(1992)\n,\nImagined Worlds\n(1997)\nand\nThe Sun, the Genome and the Internet\n(1999)\n. He has written a number of expository articles such as\nMathematics in the physical sciences\n(1964)\nin\nScientific American\n, on the role of mathematics, in particular group theory, in the physical sciences.\nMissed opportunities\n(1972)\nin the\nAmerican Mathematical Monthly\nis the text of:-\n... the\nJosiah Willard Gibbs\nlecture given by\n[\nDyson\n]\nin January of\n1972\n. The lecture was brilliant, bold and controversial. It generated much discussion and some criticism, but it did stimulate the audience .... The historical account of the breakdown in communications between mathematicians and physicists and of the lack of interest in\nMaxwell\n's equations constitutes an indictment of the mathematical community.\nIn\nUnfashionable pursuits\n(1983)\nDyson:-\n... puts in a strong plea to the committees of \"mandarins\" granting funds for research from institutions, such as the Institute for Advanced Study and the Humboldt Foundation, that they pay more attention to scientists wanting to work in \"unfashionable\" areas. He stresses the fact that ideas which were \"unfashionable\" when first put forward turned out to be very important many years later, and gives as examples the work of\nGrassmann\nand\nLie\n...\nDyson has received many honours for his outstanding contributions including election to a fellowship of the\nRoyal Society of London\nin\n1952\n. He has also been elected to the\nNational Academy of Sciences\n(\nUnited States\n)\n(1964)\nand the\nParis Academy of Sciences\n(1989)\n. He has been awarded the Lorentz Medal by the\nRoyal Netherlands Academy of Sciences\n(1966)\n, the Hughes Medal by the\nRoyal Society\n(1968)\n, the\nMax Planck\nMedal by the German Physical Society\n(1969)\n, the\nEnrico Fermi\nAward by the U.S. Department of Energy\n(1995)\n, and the Templeton Prize for Progress in Religion\n(2000)\n.\nIn\n1994\nDyson retired from his professorship at the Institute for Advanced Study at Princeton and was appointed professor emeritus. In\n1996\nSelected papers of Freeman Dyson with commentary\nwas published by the\nAmerican Mathematical Society\n. The review of this book by Aernout C D van Enter provides a good summary of Dyson's contributions:-\nTo express an opinion about this book almost feels like a presumption. It is wide in subject matter, contains many deep, often classic, results, and is written in an impeccable style. For all readers there are things close to their interests, as well as things beyond their grasp in this book. It has a wealth of topics and of seminal contributions: the famous QED\n[\nquantum electrodynamics\n]\npapers, the stability of matter, the invention of the hierarchical Ising models, the disordered linear chain, random matrices, spin wave theory, etc.; Dyson has made his mark in all these varied subjects. This still leaves out the topics in pure mathematics, which I feel even less qualified to judge. Dyson's versatility, mathematical strength and depth are well known and his comments and sometimes provocative opinions are thought-inspiring and a pleasure to read. I cannot do better than recommending this volume by repeating the old saying: study the masters!",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}