{
  "nome_completo": "Friedrich Engel",
  "nome_curto": "Friedrich Engel",
  "ano_nascimento": "1861",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Engel/",
  "lugar_nascimento": "Lugau (near Chemnitz), Germany",
  "lugar_morte": "Giessen, Germany",
  "biografia": "Friedrich Engel\nwas the son of the Lutheran pastor Moritz Robert Engel\n(1826\n-\n1903)\nand his wife Marie Meissner. Moritz Engel, as well as being a Lutheran pastor was the author of many religious books and a\ngymnasium\nteacher. In fact in\n1864\n, when Friedrich was four years old, the family moved to Greiz, one of the chief towns of Reuss Oberland, where his father had taken a position as a teacher of religious studies at the local high school. Friedrich began his schooling in Greiz in\n1868\nand, four years later, he entered the Gymnasium at Greiz where he studied from\n1872\nto\n1879\n. His university studies of mathematics began at Easter\n1879\nwhen he entered the University of Leipzig but he also spent a while in\nKarl Weierstrass\n's school at the University of Berlin. He passed the state examination, qualifying him as a secondary school teacher of mathematics, in Leipzig at the beginning of\n1883\nand received his doctorate from Leipzig in the summer of that year for his thesis\nZur Theorie der Berührungstransformationen\nⓉ\n(\nOn the theory of contact transformations\n)\n, having studied under\nAdolph Mayer\n. He published a\n44\n-page paper, with the same title as his thesis, in\nMathematische Annalen\nin\n1884\n.\nOn\n1\nApril\n1883\nEngel began a year of military service which he undertook in Dresden. He was released from military service on\n1\nApril\n1884\nand he returned to the University of Leipzig. He took part in the Mathematical Seminar at Leipzig during the summer of\n1884\nand during this period he received a letter from\nSophus Lie\n.\nFelix Klein\nand\nAdolph Mayer\nhad realised that\nLie\nneeded assistance and that Engel was the right person to give it. They had discussed the matter with both Engel and\nLie\n, and Engel had already written to\nLie\nas\nLie\n's letter makes clear\n(\nsee for example\n[\n10\n]\n)\n:-\nAt the end of\n1883\n, when\nKlein\nfirst told me about the plan for you to come to Christiania, the idea seemed so fantastic that I didn't even respond to it. As he has brought it up again in the meantime, I've jumped on the idea. If this plan can be realised, it will be a great gain for myself and for my investigations. I am well aware of your competence, not only from\nMayer\nand\nKlein\n's glowing reports, but also from your own interesting, independent work\n(\nfor which I hereby thank you most sincerely\n)\nas well as from your valuable comments on my latest notes, which I'll again be sending to you soon in Leipzig. Whether you will be reasonably satisfied here is questionable. I can only promise to do my utmost. I particularly want to place a lot of time at your disposal so long as I maintain my normal capacity for work which is not particularly great. The general ideas you touch upon in your letter are actually very good. With my investigations of differential equations which permit a finite continuous\ngroup\n, I've always had a vague idea of the analogy between substitution theory and transformation theory. I've always operated with such concepts as subgroups, invariant subgroups, commutative transformations, transitivity, transitivity in the infinitesimal, primitivity, etc., etc. When I refer to my method of discovery as synthetic, I mean to say that, on the one hand, I operate with the concept of manifold and, on the other hand, that I operate as a whole with concepts. One can prove that certain problems in integration can be reduced to certain ancillary equations of particular order and with particular characteristics, while further reduction is impossible in general. How far the analogy with the algebraic equations can be carried through, I can't say for the good reason that I have almost no knowledge of equation theory. In this area I will be expecting to gain a lot from you. As to the analogies with modern function theory, I have really no idea. ... If you actually come to Christiania, you will be most welcome.\nHaving received a scholarship from the University of Leipzig and the Royal Saxon Society of the Sciences in Leipzig to support his trip abroad, Engel went to work with\nLie\nin Christiania\n(\nnow Oslo\n)\narriving in September\n1884\n. Engel explained in\n[\n9\n]\nhow his collaboration with\nLie\nworked during his time there:-\nLie\nhad, for some time, thought of writing a larger work on transformation groups, but, without the impetus from the outside which he now was getting, it would have quite surely gone the way of the work on first-order\npartial differential equations\nwhich he had made plans to do in the eighteen-seventies. But, now,\nLie\ndecided to tackle a major piece on transformation groups, which was certainly intended to be much more than a simple introduction to the elements of the theory. It was not to be a popular book, if one may use this expression about a mathematical work. Quite the contrary, we should, as\nLie\nput it, begin \"with a full orchestra\": it should be a systematic and strict-as-possible account that would retain its worth for a long time. We met two times a day - in the mornings in my apartment and in the afternoons at\nLie\n's. We immediately got down to preliminary editorial work of a series of chapters which, according to\nLie\n's plan, would be included in the work. Orally,\nLie\ndeveloped the content of each chapter and gave me a short sketch as a basis for the compilation, a kind of skeleton to which I would supply the flesh and blood. In this way, I also received the best introduction to his group theory which, when arriving in Christiania, I had only scant knowledge of. Every day, I was newly astonished by the magnificence of the structure which\nLie\nhad built entirely on his own, and about which his publications, up to then, gave only a vague idea. The preliminary editorial work was completed by Christmas\n1884\n, after which\nLie\ndevoted some weeks to working through all of the material in order to lay down the final draft. Starting at the end of January\n1885\n, the editorial work began anew; the finished chapters were reworked and new ones were added. When I left Christiania in June of\n1885\n, there was a pile of manuscripts which\nLie\nfigured would eventually fill approximately thirty printer's sheets. That it would be eight years before the work was completed and that the thirty sheets would become one hundred and twenty-five was something neither of us could have imagined at that time.\nLeaving Christiania in June\n1885\n, Engel returned to Leipzig where he defended his\nHabilitation\nthesis\nÜber die Definitionsgleichungen der continuirlichen Transformationsgruppen\nⓉ\n(\nOn the defining equations of continuous transformation groups\n)\non\n15\nJuly. On\n14\nOctober he gave his inaugural lecture entitled\nAnwendungen der Gruppentheorie auf Differentialgleichungen\nⓉ\n(\nApplications of group theory to differential equations\n)\nand became a lecturer there. His first course of lectures was 'Theory of first-order partial differential equations' which he gave in the winter semester of\n1885\n-\n86\n. The year after Engel returned to Leipzig from Christiania,\nKlein\naccepted a professorship at the University of Göttingen and\nLie\nwas appointed to succeed him in Leipzig becoming professor of geometry there in February\n1886\n. This allowed the collaboration between\nLie\nand Engel to continue and we give further details below.\nIn\n1889\nEngel was promoted to assistant professor to fill the position which became vacant when Friedrich Schur moved to Dorpat. At this time he had to take over teaching\nLie\n's courses for a year since\nLie\n's health had deteriorated. In\n1899\nhe was promoted to associate professor and in that year he married Caroline Ibbeken\n(\nborn\n9\nAugust\n1864)\n, the daughter of the pastor Heinrich Ibbeken\n(1868\n-\n1878)\nin Schwey, Oldenburg. They had become engaged to be married in September\n1898\nand a letter still exists that Engel wrote to his friend\nPaul Stäckel\ntelling him of their engagement. Friedrich and Caroline Engel had a daughter Minna who died very young in November\n1922\n. In\n1904\nhe accepted the chair of mathematics at Greifswald when his friend\nEduard Study\nresigned the chair. Engel's final post was the chair of mathematics at Giessen which he accepted in\n1913\nand he remained there for the rest of his life. In\n1931\nhe retired from the university but continued to work in Giessen.\nThe collaboration between Engel and\nLie\nled to\nTheorie der Transformationsgruppen\nⓉ\n(\nTheory of transformation groups\n)\na work of three volumes published between\n1888\nand\n1893\n. This work was:-\n... prepared by\nS Lie\nwith the cooperation of F Engel ...\nIn many ways it was Engel who put\nLie\n's ideas into a coherent form and made them widely accessible.\nLie\nacknowledged Engel's contribution in a Foreword to the Third Volume:-\nFor me, Professor Engel occupies a special position. On the initiative of\nF Klein\nand\nA Mayer\n, he travelled to Christiania in\n1884\nto assist me in the preparation of a coherent description of my theories. He tackled this assignment, the size of which was not known at that time, with the perseverance and skill which typifies a man of his calibre. He has also, during this time, developed a series of important ideas of his own, but has in a most unselfish manner declined to describe them here in any great detail or continuity, satisfying himself with submitting short pieces to 'Mathematische Annalen' and, particularly, 'Leipziger Berichte'. He has, instead, unceasingly dedicated his talent and free time which his teaching allowed him to spend, to work on the presentation of my theories as fully, as completely and systematically, and, above all, as precisely as is in any manner possible. For this selfless work which has stretched over a period of nine years, I, and, in my opinion, the entire scientific world, owe him the highest gratitude.\nLie\nhad died in\n1899\nand, from\n1922\nto\n1937\n, Engel published\nLie\n's collected works in six volumes and prepared a seventh\n(\nwhich in fact was not published until\n1960)\n. In\n[\n1\n]\nEngel's efforts in producing\nLie\n's collected works are described as:-\n... an exceptional service to mathematics in particular, and scholarship in general.\nLie\n's peculiar nature made it necessary for his works to be elucidated by one who knew them intimately and thus Engel's 'Annotations' competed in scope with the text itself.\nThe third volume was the first to appear in print and, in the review\n[\n6\n]\n,\nRobert D Carmichael\nexplains how Engel eventually managed to get the work published:-\nTwenty-three years after the death of\nSophus Lie\nappears the first volume to be printed of his collected memoirs. It is not that nothing has been done in the meantime towards making his work more readily available. A consideration of the matter was taken up soon after his death but dropped owing to the difficulties in the way of printing so large a collection as his memoirs will make. ... Engel, who was pressing the undertaking, resorted to an unusual means. He asked the help of the daily press of Norway. On\n9\nMarch\n1913\n, the newspaper 'Tidens Tegn' of Christiania carried a short article by Engel with the title 'Sophus Lies samlede Afhandlinger' in which was emphasized the failure of\nLie\n's homeland to respond with assistance in the work of printing his collected memoirs. This attracted the attention of the editor and he took up the campaign: two important results came from this, namely, a list of subscriptions from Norway to support the undertaking and an appropriation by the Storthing to assist in the work. By June the amount of support received and promised was sufficient to cause Teubner to announce that the work could be undertaken; and in November the memoirs for the first volume were sent to the printer, the notes and supplementary matter to be supplied later. The Great War so interfered with the undertaking that it could not be continued, and by the close of the war circumstances were so altered that the work could not proceed on the basis of the original subscriptions and understandings and new means for continuing the work had to be sought. Up to this time the work had been under the charge of Engel as editor. But it now became apparent that the publication of the memoirs would have to become a Norwegian undertaking. Accordingly,\nPoul Heegaard\nbecame associated with Engel as an editor. The printing of the work became an enterprise not of the publishers but of the societies which support them in this undertaking. Under such circumstances the third volume of the series, but the first one to be printed, has now been put into our hands. \"The printing of further volumes will be carried through gradually as the necessary means are procured; more I cannot say about it,\" says Engel, \"because the cost of printing continues to mount incessantly.\"\nEngel also edited\nHermann Grassmann\n's complete works and really only after this was published did\nGrassmann\nget the fame which his work deserved. The work also contains a biography of\nGrassmann\nwritten by Engel.\nEdwin Bidwell Wilson\nwrites in\n[\n21\n]\n:-\nFor composing the life of\nGrassmann\n, Engel had at his disposal a number of documents written by\nGrassmann\nhimself or by members of his family. It was therefore possible to begin the sketch away back in\n1634\n(\n!\n)\nand to offer a detailed treatment of the early years of this very busy genius. ... Engel's life of\nGrassmann\nis written in a sound critical spirit, there is neither laudation nor condemnation of its subject, merely a connected and sympathetic history of him, from which the reader may get instruction and interest and inspiration. Few biographers in science have had a harder task, for few scientists have had a wider range of activity than\nGrassmann\n. We should all admit our deep obligations to Engel as editor and biographer.\nEngel collaborated with\nPaul Stäckel\nin studying the history of\nnon-euclidean geometry\n. He also wrote on continuous groups and partial differential equations, translated works of\nLobachevsky\nfrom Russian to German, wrote on discrete groups, Pfaffian equations and other topics. For example, his book\nDie Liesche Theorie der Partiellen Differentialgleichungen Erster Ordnung\nⓉ\n(\nThe Lie theory of partial differential equations first order\n)\n(1932)\n(\ncoauthored with Karl Faber\n)\nwas reviewed by Aurel Winter\n[\n23\n]\n:-\nThe book comprises lectures which Engel frequently gave at the University of Giessen. His co-author K Faber attended these lectures and revised them for presentation in book form. Whether he has succeeded in all details throughout the entire book is a matter for question. ... it is clear that Engel intended to publish a book not in the spirit of Weierstrass but in the spirit of\nLie\n. If\nLie\nhad lived for a longer time and had summarised his ideas on partial differential equations of the first order in the form of a textbook, the book would be about the same as these lectures of his collaborator. Thus Engel has certainly been guided also by historical points of view. ... Yet only one who knows the manner of writing in the difficult original papers of\nLie\ncan appreciate how much has been done in these lectures by the uniformisation and simplification of the proofs. The book also contains some interesting, hitherto unpublished, investigations of Engel.\nEngel received many honours for his work including the\nLobachevsky\nGold Medal and the Norwegian Order of St Olaf. He was elected to the Saxon Academy of Sciences, the\nRussian Academy of Sciences\n, the\nNorwegian Academy of Science and Letters\n, and the\nBerlin Academy of Sciences\n. In addition he was awarded an honorary doctorate from the University of Oslo.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}