{
  "nome_completo": "Fritz Alfred Joachim Grunewald",
  "nome_curto": "Fritz Grunewald",
  "ano_nascimento": "1949",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grunewald/",
  "lugar_nascimento": "Bad Kreuznach, Germany",
  "lugar_morte": "Düsseldorf, Germany",
  "biografia": "Fritz Grunewald\n's parents were Helene Weisbrod and Friedrich Grunewald. Friedrich, a dentist and excellent sportsman, married Helene, who was brought up on a farm in Lambsheim, and the couple settled in Bad Kreuznach. Helene and Friedrich Grunewald only had one child, Fritz\n(\nthe subject of this biography\n)\n, and they separated when he was only two years old. Helene and Fritz then went to live on the family farm at Lambsheim where the boy was brought up. It was not an easy childhood, however, and the strains in the family are indicated in\n[\n2\n]\n:-\nHelene remarried quite soon, remaining on the farm; Fritz's stepfather Kurt Kinkel was\n[\nlike Helene and her mother\n]\na rather dominating personality, and relations between him and the young Fritz were difficult. Kinkel disapproved of Grunewald senior, while Fritz naturally wanted to maintain contact with his father. He felt the resulting tension throughout his childhood; by the time he was sixteen the tension proved excessive and Fritz and his father broke off all contact. By this time Grunewald senior had remarried; his daughter Ulrike has fond memories of her older half-brother, and recalls the pain of losing touch with him when she was only seven. It took twenty years for Fritz to re-establish contact with his father and with Ulrike; the long-separated siblings became close friends.\nFritz attended the Albert-Einstein-\nGymnasium\nin Frankenthal, about\n8\nkm east of Lambsheim, and graduated in\n1968\n. An outstanding pupil, Fritz obtained the best marks in his Abitur of any of his classmates. He had been particularly fond of mathematics throughout his years at the Gymnasium so he matriculated at Göttingen University in\n1969\nto begin his university study of mathematics and physics. One of his lecturers was the group theorist Jens Mennicke who soon gave Grunewald a love of group theory; it became a topic on which he would undertake research throughout his life. Mennicke left Göttingen when he was appointed to a chair at Bielefeld University in\n1971\nand Grunewald followed him there to complete his undergraduate studies. At Bielefeld he studied for his Diploma supervised by Andreas Dress and, in\n1972\n, was awarded a Diploma having written a dissertation on Hecke rings of finite groups. He continued to study for his doctorate at Bielefeld, advised by Jens Mennicke, and he was awarded the degree in\n1974\nfor his thesis\nÜber eine Gruppe vom Exponenten acht\nⓉ\n(\nOn a group of eight exponents\n)\n.\nIn his doctoral thesis Grunewald studied the\nBurnside\ngroup with two generators and exponent\n8\n. It was an open question whether this group, denoted by\nB\n(\n2\n,\n8\n)\nB(2,8)\nB\n(\n2\n,\n8\n)\n, was finite or infinite. Although Grunewald failed to answer this question, he did show that a group of exponent\n8\nthat is generated by elements\nx\n,\ny\nx, y\nx\n,\ny\nsuch that\nx\n2\n=\ny\n4\n=\n(\nx\ny\nx\ny\n2\n)\n4\n=\n1\nx^{2} = y^{4} = (xyxy^{2})^{4} = 1\nx\n2\n=\ny\n4\n=\n(\nx\ny\nx\ny\n2\n)\n4\n=\n1\nis finite. When he submitted this result in a paper coauthored with Jens Mennicke, for publication in a journal, the referee commented that:-\n... this belongs in the Guinness book of records, not a mathematical journal!\nThe question concerning the finiteness of\nB\n(\n2\n,\n8\n)\nB(2,8)\nB\n(\n2\n,\n8\n)\nhas proved exceedingly hard and remains open today. In fact, perhaps hoping for even further progress, it was some years before Grunewald published papers based on the results he had obtained in his doctoral thesis. After his doctoral studies, Grunewald spent the year at\n1973\n-\n74\nat Queen Mary College, London. There he began a collaboration with Dan Segal\n(\nthe author of\n[\n2\n]\n,\n[\n3\n]\nand\n[\n4\n]\n)\nand this led to Grunewald's first publication, namely the paper\nResidual nilpotence in polycyclic groups\n(1975)\nwritten jointly with Segal. In this paper they showed that a polycyclic group with the property that each of its\n2\n-generator subgroups is residually nilpotent, need not necessarily be itself residually nilpotent.\nGrunewald had met Barbara Gernhuber\n(\nborn\n1951\nin Bonn\n)\nwhen she was studying law in Bielefeld. Barbara had graduated from the Uhland-Gymnasium in Tübingen in\n1970\nand, after studying at Bielefeld University joined Grunewald during his year in London. Barbara and Fritz married in\n1974\nand continued their studies at Bielefeld. where Grunewald was appointed as an assistant. Their first two children, Natalie\n(\nborn\n1976)\nand Joachim\n(\nborn\n1978)\n, were born in Bielefeld. Grunewald\nhabilitated\nat Bielefeld in\n1979\nand his wife Barbara was awarded her doctorate by Bielefeld in the following year for her thesis\nGrenzziehung zwischen der Rechts- und der Sachmängelhaftung beim Kauf\nⓉ\n(\nThe boundary between the right and the liability for defects when purchasing\n)\n.\nThe award of a prestigious Heisenberg scholarship allowed Grunewald to move with his family to the University of Bonn. In\n1981\nhe was appointed as an assistant professor at Bonn. Segal writes\n[\n2\n]\n:-\nFritz and Barbara had a third child, Andreas, in\n1986\n. Barbara's distinguished career as a law professor ran alongside his own, and Fritz always took his share of domestic and parental responsibilities, arranging his work around the imperatives of childcare, shopping and cooking. In those days this was unusual among\n(\nmale\n)\nGerman professors, and occasionally led to raised eyebrows among some colleagues in the department; but his priorities were clear.\nIn fact, after the birth of their third child, Barbara habilitated at the University of Bonn in\n1987\nwith her thesis\nAusschluss aus Gesellschaft und Verein\nⓉ\n(\nExclusion from society and club\n)\n. In\n1992\nGrunewald made his final career move when he was appointed to the chair of mathematics at the Heinrich-Heine University of Düsseldorf.\nDan Segal writes\n[\n4\n]\n:-\n[\nGrunewald's\n]\nnumerous important contributions range ... over infinite group theory, finite group theory, Diophantine decision problems, arithmetic groups, automorphic forms and algebraic geometry. A widely influential figure, he was particularly inspiring as a collaborator.\nGrunewald wrote the important book\nGroups Acting on Hyperbolic Space\n(1998)\nin collaboration with Jürgen Elstrodt and Jens Mennicke. Stefan Kühnlein begins a review by writing that the book:-\n... is a very welcome contribution to harmonic analysis of hyperbolic three-manifolds and the related number theory. It is the first time that most of the relevant results in this area have been brought together in such a coherent way. The book is written very carefully, with much expertise, and the authors have taken every effort to provide as clear an exposition as possible. All chapters, and many sections, begin with a description of the purpose they serve. Chapters are concluded with helpful remarks on omissions and history. Remarks of this kind are also to be found throughout the text. The authors treat the case of dimension three only, and there truly is enough to say about this. The mathematical language is a classical one, and\nrepresentation theory\nis not used. In this respect, the book is a complement to much of the recent literature on automorphic forms.\nKühnlein ends his review with high praise:-\n... the book under review is a brilliant introduction for non-experts to its subject. For the expert it will be a major source of inspiration and indispensable for reference. It should be part of every mathematical library, though the reviewer strongly recommends not leaving it there.\nGrunewald died from a sudden heart attack one week before his\n61\nst\nbirthday. His\n60\nth\nbirthday had been celebrated a year earlier with a well-attended conference 'Group theory, number theory and geometry' held at the University of Oxford. A special issue of the journal\nGroups, Geometry, and Dynamics\n, to mark his\n60\nth\nbirthday was edited by Martin Bridson and Dan Segal with the cooperation of Alex Lubotzky and Peter Sarnak. Sadly Grunewald died before the special issue appeared as Volume\n5\n, Part\n2\n, in\n2011\n.\nTwo honours which Grunewald received should be mentioned. These are the Reinhard and Emm Heynen Prize from the University of Düsseldorf in\n2001\n, and the invitation to lecture at the International Congress of Mathematicians held in Madrid in\n2006\n.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}