{
  "nome_completo": "Gilbert de Beauregard Robinson",
  "nome_curto": "G de B Robinson",
  "ano_nascimento": "1906",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robinson_G_de_B/",
  "lugar_nascimento": "Toronto, Ontario, Canada",
  "lugar_morte": "Toronto, Ontario, Canada",
  "biografia": "G de B Robinson\n's parents were Percy James Robinson\n(1873\n-\n1953)\nand Esther Toutant Beauregard\n(1870\n-?\n)\n. Percy Robinson was born in Whitby, Ontario and studied at the University of Toronto, graduating in\n1896\n. Esther Beauregard was a French girl who also studied at the University of Toronto, graduating in\n1894\n. She was one of the first women to graduate from the University and was a grandnephew of the Confederate general Pierre Gustave Toutant Beauregard\n(1818\n-\n1893)\n. Percy and Esther married on\n3\nJuly\n1905\nin York, Ontario.\nSt Andrew's College was founded in Toronto in\n1899\n. It was a boys independent school and Percy Robinson was appointed as the first classics master at the school from its foundation. But Percy Robinson was, as his son and the subject of this biography explains in\n[\n3\n]\n, much more than a classics teacher. He was also an artist who painted in oil, in his own words:-\n... experimenting within the range of certain methods which seem specially adapted to interpret the most typical Canadian scenery to Canadians in an original and forceful manner.\nPercy Robinson is best known today as a historian, writing the classic book\nToronto during the French Regime,\n1615\n-\n1793\n(1933)\n.\nG de B Robinson was brought up in Toronto and attended St Andrew's College where his father was the classics teacher. The school was modelled on the typical British independent school and, during the years that Robinson studied there, the headmaster was Dr D Bruce Macdonald. St Andrew's College had moved to Rosedale in\n1905\nand it was at that site when Robinson was a pupil. At the age of ten, he entered the school in\n1916\nbut, while he was a pupil there, Canada was involved in World War I and between\n1918\nand\n1920\nthe school building was used as a military hospital. During these years pupils attended classes in the buildings of Knox College. Robinson, who had the nickname \"Cicero\" at school, fully participated in school life\n[\n4\n]\n:-\n\"Cicero\" Robinson - The fun maker of the form. He may frequently be found playing catch in the classroom with some of his cricket enthusiasts. He is also a tennis player ... \"Cicero\" is quite a sprinter, and was one of our three representatives on Sports Day. Robinson expects to study mathematics and physics at Toronto with a view to a professorship, and we have no doubt we will find him some day at the head of his department.\nExcellent teaching by Mr Fleming at St Andrew's College must be one of the reasons for Robinson developing a passion for mathematics. He wrote a delightful article\nNewton vs. Einstein\nfor the midsummer\n1923\nSt Andrew's College Review\n(\nsee\n[\n13\n]\n)\n. He graduated from St Andrew's College in\n1923\nhaving been awarded top prizes for both sport and academic achievement. At the Prize Giving on\n30\nNovember\n1923\n, Robinson was ranked\n1\nst  in the Upper VI, won the Governor General's Medal, the Headmaster's Medal, the Wyld Prize in Latin, and the Christie Cup for proficiency in shooting. The Editorial in the Christmas\n1923\nSt Andrew's College Review\nbegins\n[\n7\n]\n:-\nThe first thing which calls for editorial notice is the excellent record made by Gilbert Robinson in the senior matriculation examinations last June. Robinson obtained first class honours in seven papers and second class in three. He did not apply for a scholarship but has received the Headmaster's medal which is given only in exceptional circumstances. We congratulate him heartily.\nHe began his university studies of mathematics and physics at the University of Toronto in\n1923\nand was ranked first in each of his years at University College. Robinson graduated from the University of Toronto in\n1927\nand undertook research at Cambridge University in England. He had been awarded one of the two scholarships granted to Toronto University for proficiency in Mathematics, under the John H Moss foundation. He reported to the St Andrew's College what life was like for him during his first year at Cambridge\n[\n12\n]\n:-\nGilbert Robinson, who, as we announced in the Mid-Summer number, was awarded one of the coveted Moss Scholarships for proficiency in Mathematics, is now studying for his Ph.D. at St John's College. Since he headed his class each year, he was accorded the unusual honour of being allowed to forego the usual Tripos examination at Cambridge. He writes that between rowing in one of the eights, lectures and study, his time is fully occupied.\nHe explained in\n[\n14\n]\nabout his studies in Cambridge\n(\nwe have made minor additions to the quote below\n)\n:-\nOn my arrival at St John's College in September\n1927\n, I was assigned to\nM H A Newman\nas supervisor, with F Puryer White as my tutor. White was a geometer and\nNewman\na topologist and I attended lectures by both of them as well as\nHenry Baker\n's Tea Party and a course on the theory of functions by\nJ E Littlewood\n. Much as I enjoyed working in topology it was the group theory which was involved that fascinated me. No lectures on Algebra were given in Toronto or Cambridge in those days so I had to read it up for myself. I still have the copies of\nFelix Klein\n's 'Icosahedron' and\nWilliam Burnside\n's 'Theory of Groups' which I bought in\n1928\n. I must have told Jacques Chapelon\n(1884\n-\n1973)\nof my interests and of the\nRiemann\nsurfaces that I had encountered, for he tells me in a letter written May\n9\n,\n1928\nthat he had been lecturing on the same subject in his graduate course in Toronto. He goes on: \"I think that you are in the right path in trying to improve your general knowledge of mathematics before entering research work. Do not hasten to begin this work and avoid working in a well known domain: there is little to discover in such domains. You must know of course the general theory of algebraic functions and\nRiemann\nsurfaces, but I wonder if it would be wise to try to find something new in these well explored fields. Do not forget to study the theory of groups, one of the most fundamental fields of Modern Mathematics.\"\nNewman\nhad reached the same conclusion and had been in touch with\nAlfred Young\nwho agreed to take me on. I well remember the appointment to meet him at the Blue Boar Hotel where he and his wife used to stay when he came to Cambridge. It was just before my return to Toronto for the summer. He gave me a copy of 'On Quantitative Substitutional Analysis III' which had just come out and told me to read\nMiller\n, Blichfeldt and\nDixon\n. In that first year I had gotten to know all the geometers at\nHenry Baker\n's weekly Tea Party -\nSemple\n,\nEdge\n,\nDuval\n,\nTodd\nand\nCoxeter\n.\nDirac\nsat at the head of the graduate students table in Hall at St John's.\nAfter two years at Cambridge, he returned to Toronto where he taught for an academic year before returning to Cambridge to complete his research. He was awarded a Ph.D. in\n1931\nfor his thesis\nOn Certain Finite Linear Groups and their Configurations of Associated Points\n. In September\n1931\nhe submitted his paper\nOn the Geometry of the Linear Representations of the Symmetric Group\nto the\nProceedings\nof the\nLondon Mathematical Society\n. It was published in\n1931\nand contains the acknowledgement:-\nMy best thanks are due to Dr\nAlfred Young\nfor his continued interest and advice during the course of this work.\nRobinson was appointed as a lecturer at the University of Toronto and, two years later he was promoted to Assistant Professor in Mathematics. On\n1\nSeptember\n1936\n, Robinson was married to Joan Turner Howard of Toronto; they had two children, a son John and a daughter Nancy. We note that, like his father, John Robinson attended St Andrew's College, Toronto, graduating in\n1964\n.\nRobinson spent the whole of his career on the Faculty of the University of Toronto until he retired in\n1971\n. However, from\n1941\nto\n1945\nhe undertook war work in Ottawa with the National Research Council of Canada. The work he undertook on codes and cyphers is described in\n[\n1\n]\n. He was appointed director of the 'Signals Intelligence Examination Unit' which was Canada's first civilian unit that worked solely on the encryption and decryption of communication signals. It was an important part of Canada's contribution during World War II. He was one of the founders of the decoding section which gave Canada some influence in this area after the war ended. For his war work, Robinson was made a Member of the British Empire\n(\nM.B.E.\n)\nin\n1946\n.\nMost of Robinson's research papers investigate representations of the symmetric group. His early papers include:\nNote on an equation of quantitative substitutional analysis\n(1935)\nand\nOn the fundamental region of an orthogonal representation of a finite group\n(1937)\n. He wrote three papers entitled\nOn the Representations of the Symmetric Group\nwhich were published in the\nAmerican Journal of Mathematics\nin\n1938\n,\n1947\n, and\n1948\n. The Introduction to the first of these begins:-\nIn the study of the irreducible representations of the symmetric group two methods are available. The first is an application of the\nFrobenius\n-\nSchur\ntheory of the characters which is valid for any group, the second is the 'substitutional analysis' of\nAlfred Young\n. Neither of these methods tells the whole story, and they should be used in conjunction.\nRobinson wrote six papers entitled\nOn the modular representations of the symmetric group\nwhich appeared in\n1951\n,\n1952\n,\n1952\n,\n1954\n,\n1955\n, and\n1955\n. The first three and the sixth were published in the\nProceedings\nof the\nNational Academy of Sciences of the U.S.A\n. The other two were published in the\nCanadian Journal of Mathematics\n.\nWe must mention at this point some important books authored by Robinson:\nThe Foundations of Geometry\n(1940)\n;\nRepresentation theory of the symmetric group\n(1961)\n; and\nVector Geometry\n(1962)\n.\nJohn Todd\n, reviewing\nThe Foundations of Geometry\n, writes\n[\n16\n]\n:-\nThis little book is an account of the axiomatic foundations of projective and Euclidean geometry, written in a most attractive manner; it should appeal to those who are disposed to consider this subject difficult or obscure. ... the author succeeds in combining rigour of treatment with simplicity and elegance in exposition. ... This work deserves to be widely read; it should dispel some at least of the mysticism which still seems to be associated with the subject by some mathematicians.\nHarry Levy, reviewing the same book, writes\n[\n11\n]\n:-\n... this is a most excellent book, and it will inspire many students of mathematics.\nHenry George Forder\n, reviewing the second edition, writes\n[\n8\n]\n:-\nThe first edition of this book was reviewed in the 'Gazette', and the appearance of the second edition, so soon after, is a testimony to the author's skill and one of the few signs of a return to civilisation.\nDudley Ernest Littlewood\nbegins a review of\nRepresentation theory of the symmetric group\nas follows:-\nThis book gives an account of the ordinary matrix representations, and of the modular matrix representations of the symmetric groups. There are other books on ordinary representations, though the author has a distinctive approach based largely on the work and methods of\nAlfred Young\n. The greater part of the book, however, and by far the more significant, is the account of the modular representations of the symmetric groups. Much work has been done on this in recent years, the author being a significant contributor. This book, which describes clearly the main features of this development, is very welcome.\nCertainly Howard Levi of Hunter College does not find Robinson's\nVector Geometry\nparticularly impressive\n[\n10\n]\n:-\nThe geometric objects discussed in this book are, for the most part, the lines, planes, conics, and\nquadric\nsurfaces of Euclidean two and three space. Some of the treatment is in terms of vectors; most is not. Projective, affine, elliptic and hyperbolic geometries are mentioned briefly - so briefly, in some instances, as to render the text almost meaningless to a reader who does not already know the subject. The topics from Euclidean geometry receive a more detailed exposition, but the result is not very different from chapters on analytic geometry in dozens of American calculus textbooks which make a nod in the direction of vectors. The book also contains a chapter on groups and linear transformations, which does not seem to tie in with the rest of the book.\nMay I\n[\nEFR\n]\nadd a personal note. In the autumn of\n1976\nI spent a month at the University of Toronto as the invitation of\nDonald Coxeter\n. Robinson, who was retired but came into the Department most days, was extremely kind to me during this visit and went out of his way to help make my visit a good one. He had spent the earlier part of the year in Europe, taking part in a workshop in Strasbourg on the symmetric group, then going to Aachen to work with Gordon James and Adalbert Kerber on new edition of his book\nRepresentation theory of the symmetric group\n. Before returning to Canada he had visited his daughter Nancy Hill who was, at this time, living in London, England.\nRobinson, together with\nDonald Coxeter\n, founded the\nCanadian Journal of Mathematics\nwhich began publishing in\n1949\n. He was managing editor of the\nJournal\nfor thirty years. After his death:-\n... the G de B Robinson Award was inaugurated to recognize the publication of excellent papers in the 'Canadian Journal of Mathematics' and the 'Canadian Mathematical Bulletin' and to encourage the submission of the highest quality papers to these journals.\nHe was honoured by being elected a fellow of the\nRoyal Society of Canada\nin\n1944\n. He was a founding member of the Canadian Mathematical Congress in\n1945\n, giving an address to the Congress on the Foundations of Geometry. He gave many years of service to the\nCanadian Mathematical Society\nand served as the third president of the Society\n(1953\n-\n1957)\n[\n6\n]\n:-\nHe undertook many professional and administrative responsibilities at various times, including the presidencies of Section III of the\nRoyal Society of Canada\n, of the University of Toronto Settlement and the Faculty Club, of the Society for History and Philosophy of Mathematics, as Chairman of the NRC Associate Committee on Mathematics, and as Vice President\n(\nResearch\n)\nof the University in\n1965\n-\n71\n. He received several medals and other awards from the federal and provincial governments for these and similar community services.\nGeorge Francis Denton Duff\n(1926\n-\n2001)\n, a colleague of Robinson's at the University of Toronto from\n1952\n, writes in\n[\n6\n]\nof Robinson's\n... personal qualities of clear insight, quiet resolution, perseverance and industry, self-discipline, and commitment, broadened by a charitable understanding of his profession and community.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}