{
  "nome_completo": "Gabriel Xavier Paul Koenigs",
  "nome_curto": "Gabriel Koenigs",
  "ano_nascimento": "1858",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Koenigs/",
  "lugar_nascimento": "Toulouse, France",
  "lugar_morte": "Paris, France",
  "biografia": "Gabriel Koenigs\nwas brought up in Toulouse where he attended school, achieving brilliant results. He then went to Paris where he attended the Lycée S Louis, again showing his outstanding abilities, before entering the École Normale Supérieure in\n1879\nwhere he was taught by\nDarboux\n. In\n1882\nhe took the examinations for the\nagrégation\nwhich, of course, he passed and in the same year he defended his doctoral thesis\nLes propriétés infinitésimales de l'espace régé\nⓉ\n(\nThe infinitesimal properties of the space set\n)\n. He remained for the year\n1882\n-\n83\nat the École Normale Supérieure where he was an agrégé répétiteur. In\n1883\nhe was appointed as a lecturer in mechanics at the Faculty of Sciences at Bresançon then, two years later, as a lecturer in mathematical analysis at Toulouse. He returned to the École Normale Supérieure in Paris in\n1886\nwhere he was appointed as a mathematics lecturer, but he also held an appointment at the Collège de France where he taught analytical mechanics. He became an assistant professor of physical and experimental mechanics at the Sorbonne in\n1895\n, being promoted to full professor there two years later. His appointment at the Collège de France ended in\n1895\nwhen he took up the position at the Sorbonne. Taton writes\n[\n1\n]\n:-\nKoenigs henceforth devoted himself to the elaboration of a method of teaching mechanics based on integrating theoretical studies and experimental research with industrial applications. He created a laboratory of theoretical and experimental mechanics designed especially for the study of various types of heat engines and for perfecting different testing procedures. This laboratory, which began operating in new quarters in\n1914\n, played a very important role in World War I.\nKoenigs was greatly influenced by\nDarboux\nand his first work was on geometry following work of\nPlücker\nand\nKlein\n. He looked at iteration theory in analysis and, following\nDarboux\n's plea for a more rigorous approach to analysis, he published papers in\n1884\nand\n1885\non iteration of complex functions using rigorous arguments based on uniform convergence. He showed how to produce eigenfunctions through a process of iteration. He took\nErnst Schröder\n's work on\nNewton\n's method, carried out by\nSchröder\nin\n1870\n-\n71\n, making this theory into a rigorous body of work and in so doing strongly influenced its subsequent development. Koenigs contributions to complex analysis are described in\n[\n2\n]\nand these are summarised by Hinkkanen as follows:-\nSchröder\nsolved the problem of conjugating an analytic function to a linear map in a neighborhood of an attracting\n(\nbut not superattracting\n)\nfixed point. ...\nSchröder\nalso discovered an infinite family of generalizations of\nNewton\n's method.\nSchröder\n's arguments concerning conjugation were not rigorous by modern standards. The work of G Koenigs in\n1883\n-\n1884\nwas rigorous and contained, in particular, the results of\nSchröder\n. ... Koenigs noted that it would be desirable to determine the partitioning of the plane into domains in which the iterates of a function tend to attracting cycles, but observed that this would be very difficult and perhaps impossible for a general rational function.\n[\nHe\n]\nlacked the concepts of set theory\n(\nCantor\nsets, fractals, etc.\n)\nto be able to study the general situation.\nKoenigs studied analytic mechanics where he applied\nPoincaré\n's theory of integral invariants. In\n[\n8\n]\nhis work on roulettes is discussed and put into context relating it to the work of several other mathematicians:-\nThe construction of centres of curvature of plane roulettes by\nBobillier\n(1831)\n, Gilbert\n(1858)\nand Koenigs\n(1897)\nwas based on the theory of centroids by\nM Chasles\n(1830)\n. This problem has kinematical origins\n(\na roulette is the plane curve described by points of a plane figure moving in its plane\n)\nbut each plane curve may be considered as a roulette.\nFrom\n1910\nhe worked in his laboratory, concentrating on research in applied thermodynamics. After World War I, Koenigs became involved in the international efforts to oversee cooperation within the scientific community. The International Research Council was set up for this purpose and, during the Constitutive Assembly meeting of the Council in Brussels in\n1919\n, preparations were made to set up the\nInternational Mathematical Union\n. It was decided that an International Congress of Mathematicians should take place in September\n1920\nand Koenigs, as the French delegate, invited the Congress to Strasbourg. This was accepted unanimously despite the previous decision to hold the next Congress in Stockholm following the\n1912\nCongress\n[\n3\n]\n:-\nThe duly accredited delegates of the\n(\nAllied\n)\nnations were to meet in Strasbourg at the time of the Congress to confirm the statutes and to create the\nInternational Mathematical Union\n. ...\nMittag-Leffler\nnever recognised the Strasbourg Congress as an international event.\nKoenigs was elected as Secretary General of the Executive Committee of the\nInternational Mathematical Union\nat the Strasbourg Congress\n[\n3\n]\n:-\nSecretary General Koenigs, Professor at the University of Paris\n(\nSorbonne\n)\nand Member of the French\nAcademy of Sciences\n, had not attended any of the pre-war International Congresses. He was elected Secretary General until\n1928\n, but he kept this position for\n3\nmore years until his death in\n1931\n. In light of later events, it is apparent that Koenigs inflicted damage upon the cause of the Union by persisting in maintaining an anti-German policy although times had changed and the passions aroused by the war had largely cooled down. It is curious that Koenigs' archives in the Academy do not contain a single paper associated with the IMU. Nor are the activities of Koenigs in the Union mentioned in the memorial address of the French Academy, in his obituary, or in his biography.\nIn the years after World War I feelings ran high and Germany, Austria-Hungary, Bulgaria, and Turkey were excluded from the Union. This was unfortunate but it was understandable that feelings ran high on the issue at this time. Many, however, felt that mathematics should not be subjected to political pressures but should welcome equally mathematicians of all nations. Leading advocates of that view were\nHardy\nand\nMittag-Leffler\n. Others held equally sincere views that the Union's exclusion rules were right, in particular Koenigs strongly believed in the exclusions. In fact the exclusions were supposed to go further, for only members of the International Research Council were allowed to send delegates to an International Congress of Mathematicians but, although the exclusions of Germany, Austria-Hungary, Bulgaria, and Turkey were adhered to in Toronto, participants from countries which were not members of the International Research Council was allowed. In Koenigs' official report on the Toronto Congress in\n1924\nhe listed the fourteen countries present omitting those that were not members of the International Research Council, then added:-\nAlso present were several scholars from the following countries that have not yet adhered to the Union: Spain, Georgia, Russia, India.\nAgain Koenigs was elected as Secretary General of the Executive Committee of the\nInternational Mathematical Union\nbut began to use his position for his own political ends.\nPincherle\nwrote to International Research Council's Vice-President\nVito Volterra\na year after Toronto. He said he was amazed to learn that the International Research Council had not been informed about his election as President of the\nInternational Mathematical Union\n. He explained that the reason was that Koenigs:-\n... frequently and willingly leaves letters unanswered and takes his functions with much calm.\nThe problem concerning who could attend International Congresses became worse for the\n1928\nCongress when the question concerned the attendance by delegates from Germany. Despite a general softening of views, Koenigs strongly opposed attendance by Germans but first the Executive Committee had to select a location for the\n1928\nCongress. Bologna and Stockholm emerged as the only competitors.\nPincherle\n, as President of the International Mathematical Union, felt he could not press for Bologna but Koenigs went as far as to say that if Stockholm were chosen the unfavourable exchange rate would stop France and many other countries attending.\nBieberbach\nasked all Germans to boycott Bologna but\nHilbert\nargued that they should attend. However Koenigs, as the\nInternational Mathematical Union\n's General Secretary, argued that Germany should not attend since although they were eligible to join the International Research Council since\n1926\nthey had not done so. He accordingly wrote to all Union members advising them not to take part in the Bologna Congress. Despite his attempts to arrange a boycott there was a large attendance, even from the French. Koenigs himself, however, did not attend.\nIn January\n1929\nWilliam Henry Young\nwas elected President of the\nInternational Mathematical Union\n. Koenigs was still General Secretary but was experiencing health problems and was not responding to any letter sent to him. Henry Lyons, Secretary General of the International Research Council, wrote to\nWilliam Henry Young\nsaying that:-\n... as Koenigs has never replied to any of my previous letters, he is not likely to do so to this.\nYoung\nwas advised by\nde la Vallée Poussin\nto replace Koenigs, with Fehr being suggested as his replacement as General Secretary.\nYoung\ndid nothing, however, so in early\n1931\nde la Vallée Poussin\ninformed everyone in the Bureau about his proposal to replace Koenigs. The matter was still unresolved when Koenigs died in October\n1931\n.\nLehto\nwrites\n[\n3\n]\n:-\nThe presence of Koenigs in the Bureau not only meant that secretarial work was blocked, but as a symbol of the discrimination policy now condemned, it cast a shadow over the Union. Despite\nYoung\n's attempts to save the IMU, it was suspended in\n1932\n.\nLet us mention some of Koenigs most important works:\nMémoire sur les lignes géodésiques\nⓉ\n(\nMemoir on geodesic lines\n)\n(1892)\n,\nLa géométrie réglée et ses applications\nⓉ\n(\nThe ruled geometry and its applications\n)\n(1895)\n,\nLeçons de Cinematique: Professees a la Sorbonne\nⓉ\n(\nCinematic lessons: taught at the Sorbonne\n)\n(1895\n-\n97)\n; and\nMémoires sur les courbes conjuguées dans le mouvement relatif le plus général de deux corps solides\nⓉ\n(\nMemoirs of conjugate curves in the relative motion of two solid bodies\n)\n(1910)\n. Perhaps\nLeçons de Cinematique\nⓉ\n(\nCinematic lessons\n)\nis the most famous of all. Lovett\n[\n7\n]\n, reviewing the book, writes:-\nKoenigs' treatise promises to be a classic. In facing the formidable array of researches and methods of\nPoinsot\n,\nChasles\n,\nBonnet\n, Ribaucour,\nDarboux\n, and a host of others the author must have experienced no little difficulty in choosing a method of exposition of the subject matter. A treatise that is to be both scientific and didactic must consider the demands both of the student and of the scientist. Knowledge is of most use when accompanied by a kit of tools, and the instructor's art is a double one - he must not only present the facts of a subject with reasons for faith in them, but also employ those methods which promise results at the hands of the independent investigator. Further, the method should have the necessary breadth and unity, and be possessed of the clearness and directness of geometry and the power and generality of analysis. This multiplicity of demands Professor Koenigs has met admirably by basing his exposition on the geometry of the straight line and employing the mobile trieder of reference; the latter in the hands of Ribaucour and\nDarboux\nhas proved itself to be the most certain and powerful implement yet used in infinitesimal geometry and it naturally lends itself with equal facility and elegance to the geometry of displacement.\nIn addition to these books, Koenigs published around sixty papers.\nHe was honoured for his achievements in a number of ways. The Bordin Prize of\n1890\nwas to be awarded for work on\ndifferential geometry\n; Koenigs won for his essay on geodesics. He also received the\nPoncelet\nPrize in\n1913\nfor his contributions to geometry and mechanics. He was elected president of the\nFrench Mathematical Society\nin\n1897\nand of the French Society for Aviation Navigation in\n1914\n. He was elected to Mechanics section of the\nAcademy of Sciences\non\n18\nMarch\n1918\n, having failed to be elected in\n1892\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic"
  ]
}