{
  "nome_completo": "Gaetano Fichera",
  "nome_curto": "Gaetano Fichera",
  "ano_nascimento": "1922",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fichera/",
  "lugar_nascimento": "Acireale, Catania, Sicily, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Gaetano Fichera\n's parents were Giuseppe Fichera and Marianna Abate. Giuseppe and Marianna had four children, all sons, and Gaetano was the eldest. Giuseppe Fichera had graduated with his laurea in mathematics from the University of Catania in\n1921\n. He had been a student of\nBernardino Gaetano Scorza\n, who taught at Catania from\n1916\nto\n1920\n, and Giuseppe had become an expert on the theory of group representations. After\nScorza\nmoved to Naples, Giuseppe Fichera became an assistant to\nMauro Picone\nwho was appointed Head of Mathematics at Catania in\n1921\n. However, after Giuseppe Fichera's second son was born, he left university teaching to become a secondary school teacher of mathematics. This was forced on him since it was better paid than a university assistant and, with a young family to support, he had to bring in a higher income. However, Giuseppe Fichera remained a close friend of\nPicone\nall his life and this was to have a considerable beneficial effect on the young Gaetano.\nHaving an excellent mathematician for a father, it is not surprising that the young Gaetano quickly developed a deep love for the subject. His secondary education at the local liceo classico only lasted two years and, in\n1937\nhe entered the University of Catania to study mathematics. There he studied under\nPia Nalli\nwho had been appointed to the chair of algebraic analysis in\n1927\n. She had made substantial contributions to analysis, particularly with her survey article\nEsposizione e confronto critico delle diverse definizioni proposte per l'integrale definito di una funzione limitata o no\nⓉ\n(\nExhibition and critical comparison of the different definitions proposed for the definite integral of a bounded function or not\n)\n(1914)\n. However, by the time Fichera was studying with her,\nNalli\nhad become interested in tensorial calculus. After two years at the University of Catania, Fichera went to Rome in\n1939\nto study with\nMauro Picone\n. He was awarded his laurea, with distinction, in\n1941\nand remained in Rome as an assistant to\nPicone\n. He was also a researcher at\nPicone\n's Istituto Nazionale per le Applicazioni del Calcolo which had a very significant effect on his future mathematical studies\n[\n11\n]\n:-\nThis situation exerted a considerable influence on the scientific training of Gaetano Fichera. In fact, he was in an institute where problems of pure mathematics were studied together with others posed by industry, engineering and applied sciences. Therefore, the output of Gaetano Fichera belongs in part to pure mathematics, in part to its applications to physical mathematics. In both these fields he obtained important results that made him famous throughout the mathematical world.\nAfter Italy entered World War II in June\n1940\n, the Institute worked on military applications as part of the war effort. However, the war was to have a far greater impact on the young Fichera for, in February\n1943\nwhen he reached the age of\n21\n, he was called up to fight. Fichera refused to join the Italian army because it collaborated with Nazi Germany.\nAfter being called up into the army on\n1\nFebruary\n1943\n, Fichera deserted but he was captured in September\n1943\nby Nazi troops and imprisoned in Teramo. By this time Italy had surrendered to the allies and declared war on Germany. After a while Fichera was sent, still as a prisoner of the Germans but by now condemned to death, to Verona but he managed to escape from there on his third attempt and headed for Emilia-Romagna where he came across a group of partisans. The partisans questioned Fichera who told them that he was a mathematician. This immediately made them suspicious but one of the group, Giorgio Pescarini, was a mathematics teacher and he questioned Fichera to test whether he really was a mathematician. Of course, his answers quickly convinced Pescarini, and therefore the whole group of partisans, that Fichera was genuine. Fichera later jokingly remarked that this event effectively proved that mathematics could be useful in everyday life. Fichera lived with the partisans in Alfonsine near Ravenna, fighting against the Germans, as the end of the war approached. He became a close friend of sister Giocondiana who was a nurse at a hospital. German forces in Italy surrendered in April\n1945\nand a ceasefire was declared. One of the group of partisans which included Fichera described the last hours of the war:-\nWe had just gone to bed when we heard the roar of a plane and immediately heard the explosion of a bomb. It had not fallen very far from us, but luckily there were no victims nor was any damage done. An anti-aircraft battery, about fifty yards from where we were, opened fire then stopped. It was the last flicker of war that we had to endure. The next night someone knocked on our door: it was three Englishmen who were part of that battery with two German prisoners. When they asked if there was someone who spoke English, Gaetano came forward and spoke to the three British soldiers in a very nonchalant manner. Then he turned to the two Germans, spoke to them in their own language, translating what they said for the British. Finished questioning the British thanked Gaetano and all of us, saluted us, and left taking the prisoners with them. For us it was a pleasant surprise to discover that Gaetano, although so young, as well as being a graduate in mathematics, could speak two foreign languages with ease, something very rare in those days.\nAfter the German surrender, Fichera remained in Alfonsine with the partisans for several months. He left together with sister Giocondiana and the two went to Rome. However, their relationship did not last. Back in Rome, Fichera resumed working for\nPicone\nwhere he became 'Libero Docente' in mathematical analysis in\n1948\n; this is similar to the\nhabilitation\nand gives the right to lecture in universities. In the same year he published\nTeoremi di completezza sulla frontiera di un dominio per taluni sistemi di funzioni\nⓉ\n(\nCompleteness theorems on the boundary of a domain for certain systems of functions\n)\n. He writes in the introduction:-\nThe first part will extend some theorems on the potential theory of surfaces. Then we establish uniqueness theorems for the boundary value problems for harmonic functions considered in a certain class. Finally, from these are deduced completeness theorems concerning\nHilbert\nfunction spaces for certain systems of functions.\nThe methods Fichera used were based on those which had been developed by his teacher\nPicone\n. In\n1949\nhe published the important paper\nAnalisi esistenziale per le soluzioni dei problemi al contorno misti, relativi all'equazione e ai sistemi di equazioni del secondo ordine di tipo ellittico, autoaggiunti\nⓉ\n(\nExistence of solutions of mixed boundary problems, related to an equation and to systems of elliptic, self-adjoint second-order equations\n)\non uniqueness and existence of solutions of certain mixed boundary value problems. In the same year he entered the competition for a chair of mathematics at the University of Trieste.\nRenato Caccioppoli\n, who was at the University of Naples, was one of the referees who recommended Fichera for this chair. In fact he had also been a referee one year earlier when Fichera received his 'Libero Docente'. After this Fichera and\nCaccioppoli\nremained close friends until\nCaccioppoli\n's death in\n1959\n. While in Trieste, he met Matelda Colautti; they married in\n1952\n(\nshe is the author of the book\n[\n2\n]\nabout Fichera's life\n)\n. In\n1956\nFichera moved to Rome when appointed to the chair of mathematical analysis at La Sapienza, the University of Rome. Three years later he moved to the chair of higher analysis, still at La Sapienza.\nM Zerner, reviewing\n[\n3\n]\n, writes:-\nGaetano Fichera was at the heart of the important developments connecting physics\n(\nmostly elasticity\n)\n, functional analysis and the theory of partial differential equations and inequalities which took place after WWII, many of them in Italy where the mathematical study of the mechanics of continuous media was a well-established tradition. ... Fichera had by no means a narrow view of his subject and was led to contribute to other parts of mathematics, one being the theory of functions of several complex variables ...\n[\nThe Cialdea and Lanzara article contains\n]\nan impressive list of Fichera's works:\n256\narticles published between\n1941\nand\n1999\nand\n18\nbooks. A remarkable feature is that the rhythm of publication was already the same before the \"publish or perish\" era.\nMore details of his research is given by Giuseppe Grioli in\n[\n11\n]\n:-\nIn pure mathematics Gaetano Fichera achieved considerable results in the following fields: mixed boundary value problems of elliptic equations; generalized potential of a simple layer; second order elliptic-parabolic equations; well posed problems; weak solutions; semicontinuity of quasi-regular integrals of the calculus of variations; two-sided approximation of the eigenvalues of a certain type of positive operators and computation of their multiplicity; uniform approximation of a complex function f\n(\nz\n)\n; extension and generalization of the theory for potentials of simple and double layer; specification of the necessary and sufficient conditions for the passage to the limit under integral sign for an arbitrary set; analytic functions of several complex variables; solution of the\nDirichlet\nproblem for a holomorphic function in a bounded domain with a connected boundary, without the strong conditions assumed by\nFrancesco Severi\nin a former study; construction of a general abstract axiomatic theory of differential forms; convergence proof of an approximating method in numerical analysis and explicit bounds for the error.\nHis works in applied mathematics and mathematical physics:-\n... concern the existence, uniqueness and regularity of solutions. Such studies regard above all the mathematical theory of linear elastostatics, in particular the mixed boundary problem and Signorini's problem, that is the problem of the equilibrium of an elastic body with a unilateral support constraint on a part of its boundary. The situation requires boundary conditions expressed by inequalities. Other studies regard the energy approach to the\nSaint-Venant\n's problem. Many papers concerning the theory of materials with memory contain interesting observations on the concept of 'fading memory'. The results of Gaetano Fichera in this field give useful information on the analytical structure of the 'memory kernel'. Some mathematical research concerned electrology and biology.\nIn addition to this work in pure mathematics and mathematical physics, Fichera also made some important contributions to the history of mathematics. He wrote on the life and work of a number of mathematicians:\nSolomon Grigoryevich Mikhlin\n,\nFrancesco Severi\n,\nGuido Fubini\n,\nLuigi Fantappiè\n,\nPia Nalli\n,\nMauro Picone\n,\nFrancesco Giacomo Tricomi\n,\nAlexander Weinstein\n,\nVito Volterra\n,\nRenato Caccioppoli\n,\nBruno de Finetti\n, and Maria Adelaide Sneider. He also wrote a valuable study on\nArchimedes\n.\nFichera was an outstanding lecturer, giving fascinating valuable lectures. He was an incredibly hard worker, and this was reflected in his lectures which he revised every year. He always said that any teacher who gives the same lectures two years running is lazy. Wolfgang Wendland, who was a student of Fichera, writes in\n[\n25\n]\n:-\nHe was an extraordinary, real gentleman, very handsome and impressive, being polite and kind to us youngsters; caring even for my work and giving advice in the discussions. His lectures were tastefully prepared and delivered in elegance with brilliant clarity.\nHe published several textbooks based on lecture courses he had delivered and also monographs on the work being undertaken by his research tem in Rome. He published\nLezioni sulle trasformazioni lineari. Introduzione all'analisi lineare\nⓉ\n(\nLectures on linear transformations. Introduction to linear analysis\n)\n, the first volume of an intended three volume work, in\n1954\n:-\nThroughout the book the author gives special attention to methods and results having applications in the theory of partial differential equations.\nAlso in\n1954\n, Fichera published the two volume treatise\nTrattato di analisi matematica\nⓉ\n(\nTreatise on mathematical analysis\n)\n. In\n1965\nhe published\nLinear elliptic differential systems and eigenvalue problems\n. H F Weinberger begins a review as follows:-\nThese lecture notes are devoted to two closely related topics: the theory of elliptic boundary value problems, and the approximation of eigenvalues of elliptic operators. The author's most remarkable achievement is the presentation, in a lucid style accessible to any graduate student with some familiarity with\nfunctional analysis\n, of the\nL\n2\nL_{2}\nL\n2\n​\nregularity theory of elliptic systems on bounded domains.\nIn\n1967\n, in collaboration with Luciano de Vito, he published\nFunzioni analitiche di una variabile complessa\nⓉ\n(\nAnalytical functions of a complex variable\n)\n. In the following year he published another set of lecture notes\nLezioni sulla teoria spettrale degli operatori\nⓉ\n(\nLectures on the spectral theory of operators\n)\n:-\nIn this detailed set of lectures the author starts with the definition of a\nHilbert space\n. He develops the elementary geometrical properties and culminates with proofs of the spectral theorems for Hermitian and unitary operators.\nHe published an English translation of his\n1974\nItalian text as\nNumerical and quantitative analysis\nin\n1978\n. However, the English edition contains extra chapters bringing the book up-to-date. Alan Andrew writes in a review:-\nThis book succeeds in its main purpose which is to give a systematic summary of the research of the author and his students since the\n1950\n's. In order to put their results in perspective, relevant results of others are discussed where appropriate. The emphasis is on obtaining rigorous bounds for desired quantities. This contrasts with much current work on differential equations where \"error bounds\" commonly involve unspecified constants. Most of the author's work has been formulated in a rather abstract setting but practical aspects are emphasized here. ... The book contains important results previously widely scattered in the literature.\n[\nIt\n]\nprovides a compact and convenient reference which will be useful to research workers in areas related to those covered here. It should be in all university libraries.\nIn\n1985\nFichera published another book based on his lectures on mathematical physics, namely\nProblemi analitici nuovi nella fisica matematica classica\nⓉ\n(\nNew analytical problems in classical mathematical physics\n)\n. It treats several different topics in linear elasticity.\nFichera was a member of the\nAccademia Nazionale dei Lincei\nand received their prestigious Antonio Feltrinelli Prize in\n1976\n. He was elected to the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\n, the Academy of Sciences of Turin, the Academy of Palermo, the Academy of Bologna, the Lombardo Institute, the Peloritana Academy, the Zelantea Academy, the Academy of Modena, the Gioenia Academy, the\nGerman Academy of Sciences Leopoldina\n, the\nRoyal Society of Edinburgh\n, the Academia Europaea, the\nRussian Academy of Sciences\n, and the\nGeorgian Academy of Sciences\n. In fact he was elected to an honorary fellowship of the\nRoyal Society of Edinburgh\nin\n1976\n. He was awarded the Ivane Javakhishvili Medal by Tbilisi State University in\n1982\nand the Medal of the Università per Stranieri di Perugia  in\n1993\n. He received the Italian Minister of Education Prize in\n1961\n, and the Gold Medal Benemeriti della Scuola, della Cultura, dell'Arte from the President of the Italian Republic in\n1979\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}