{
  "nome_completo": "Bernardino Gaetano Scorza",
  "nome_curto": "Gaetano Scorza",
  "ano_nascimento": "1876",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scorza/",
  "lugar_nascimento": "Morano Calabro, Cosenza, Calabria, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Gaetano Scorza\n's father was a landowner who wanted Gaetano to study law and to get a job living close to the family home. This presented Gaetano with great difficulties as he was growing up, and must be at least a contributory factor in the depression he suffered from as a young man. He was educated partly at the Collegio Nazareno in Rome and partly at the Collegio di San Giovannino dei Padri Scolopi di Firenze, the school of the Piarist Fathers in Florence. His record at these schools was excellent. While he was studying at the Scolopi school in Florence, he was taught by the priest, philologist, linguist and expert on papyri, Ermenegildo Pistelli\n(1862\n-\n1927)\nand they became friends until Pistelli's death. Scorza would turn to Pistelli when he was finding life unbearable. His first publication, which appear in print when he was only eighteen years old, gave the solution to two mathematical problems posed in the journal for secondary mathematics teaching. Scorza then entered the University of Pisa where he studied mathematics, taught by a collection of famous mathematicians including\nEugenio Bertini\n,\nUlisse Dini\nand\nLuigi Bianchi\n. These were not easy years for the young man who wrote to Pistelli saying how depressed he was, particularly after periods of intense work, and he felt he did not fit in this high powered environment. Pistelli replied with words of comfort, telling the young man he has an excellent brain. Scorza was awarded his laurea in\n1898\nand he submitted for publication two papers from it,\nSopra le figure polari delle curve piane del\n3\n° ordine\nⓉ\n(\nOn the polar figures of plane curves of the\n3\nrd order\n)\nand\nSopra la teoria delle figure polari delle curve piane del\n4\n° ordine\nⓉ\n(\nOn the theory of the polar figures of plane curves of the\n4\nth order\n)\n. Both appeared in\n1899\n, the first in\nAnnali di Matematica\nand the second, the main part of his thesis, in\nMathematische Annalen\n.\nAfter obtaining his laurea, Scorza was appointed as an assistant to\nEugenio Bertini\n, who held the chair of analytical and projective geometry at the University of Pisa. He worked at Pisa for the year\n1898\n-\n99\nbut he then spent the year\n1899\n-\n1900\nas an assistant to\nCorrado Segre\nat the University of Turin. This was as the result of a somewhat unusual arrangement between\nBertini\nat Pisa and\nCorrado Segre\nat Turin who made an agreement to exchange assistants for one year. Scorza spent the year in Turin assisting\nCorrado Segre\n, who held the chair of projective and descriptive geometry. While at Turin, he helped in advising\nFrancesco Severi\nwho was undertaking research for his thesis supervised by\nCorrado Segre\n.\nSeveri\nwrites about his friendship with Scorza during that year\n[\n12\n]\n:-\nI remember the long walks together in Valentino park or on the small, shady, quiet roads in the Turin hills. Solitary walks on cold winter days or intoxicated by the bright and harmonious awakening in spring when nature was bursting into life: spring in the world around and in our lives. He was reserved, a bit timid, a naive dreamer, as is sometimes the southern temperament.\nScorza produced some elegant papers while in Turin and broadened the areas of his research. However, the doubts that had plagued him earlier continued to trouble him. He told\nSeveri\nthat he feared that he was losing his abilities and inventiveness. At the end of the year, the assistants returned to their original positions, so in\n1900\nScorza went back to Pisa as\nBertini\n's assistant. He earned the right to lecture in universities and taught courses at the Scuola Normale Superiore in Pisa. However, from\n1902\nto\n1912\nhe taught in technical institutes in Terni, Bari and Palermo. During these years, he did little research on the geometrical topics that he had worked on earlier and he stopped discussing research with\nSeveri\nand others\n[\n12\n]\n:-\nBut his vast knowledge, and his open and penetrating mind, would not let him be completely idle. He devoted himself to the study of mathematical economics.\nIt was the economist Maffeo Pantaleoni\n(1857\n-\n1924)\nwho encouraged Scorza to take an interest in mathematical economics. Scorza wrote four articles on this topic which were published in the\nGiornale degli Economisti\nbetween April\n1902\nand February\n1903\n. All except the first of these papers form part of an argument which developed between Scorza and the economist, political scientist and philosopher Vilfredo Pareto\n(1848\n-\n1923)\n. Scorza angered Pareto when he claimed his results were false\n(\nsee\n[\n10\n]\n)\n:-\n... given a certain system of prices every individual participating in the exchange tries to regulate their demand and their supply in a way that ophelimity is maximised from this exchange, and that many authors from Walras to Pareto have deduced the conclusion that every participant in the market will achieve the maximum of ophelimity under a regime of free competition. Now, Cassel profoundly observes that there is nothing in that event that is essentially characteristic of free competition, and therefore the reasoning by which this conclusion is drawn from the presence of the equations of maximum satisfaction in the system that determine the equilibrium, is nothing other than gross sophistry.\nMost historians suggest that Pareto failed to understand fully the points that Scorza was making but eventually sided with him. However, the paper\n[\n10\n]\ninterprets the argument rather differently. Certainly Scorza's interest in economics was short-lived and he then gave up all scientific research for three years\n[\n12\n]\n:-\nThere followed three years of total inactivity in science which would be inexplicable in a young man so well equipped if one were to ignore the crisis that tore at his soul.\nBy the end of\n1906\n, Scorza had begun to have contacts again with\nBertini\n,\nSeveri\nand other researchers in geometry and, given his outstanding early contributions, they were all keen to persuade him to return to his study of\nalgebraic geometry\n. Certainly both\nBertini\nand\nSeveri\nmade suggestions of specific questions that would interest Scorza. The depression which had gripped Scorza frequently over the years began to ease around this time. When he had been a student at Pisa he had met Angiola Dragoni, who was studying mathematics there, and they became close friends. She was awarded her laurea in\n1902\nfor her thesis\nSulla varietà cubica di\nS\n4\nS^{4}\nS\n4\ndotata di dieci punti doppi\nⓉ\n(\nOn the cubic variety of S\n4\nwith ten double points\n)\nbut, due to Scorza's doubts and hesitation, he had not been able to propose marriage. However, with the lifting of his depression at the end of\n1906\n, Scorza proposed marriage and the couple were married in\n1907\n. In the following year, on\n2\nJuly, their son Giuseppe Scorza-Dragoni was born in Palermo where Scorza was teaching at the technical institute. Giuseppe Scorza-Dragoni\n(1908\n-\n1996)\nwent on to write a laurea advised by\nSeveri\n(\nat his father's request\n)\nand was professor of mathematical analysis at Padua from\n1936\nto\n1962\n, and at Rome from\n1962\nto\n1966\n. After eight years as professor of algebra at Bologna from\n1966\n, he returned to Padua where he worked until he retired.\nScorza's health improved markedly from\n1906\nand he was able to resume his research in algebraic geometry with a renewed vigour. He published several papers in\n1907\nincluding the important\nIntorno alle corrispondenze\n(\np, p\n)\nsulle curve di genere p e ad alcune loro applicazioni\nⓉ\n(\nOn the correspondence\n(\np, p\n)\non curves of genus p and some of their applications\n)\nand five papers in each of the years of\n1908\nand\n1909\n. He was awarded his libera docenza in\n1907\nand began applying for professorships at universities. He was successful in the competition for the chair of projective and descriptive geometry at the University of Cagliari and took up his appointment in\n1912\n. However, he only spent a very short time at Cagliari.\nMario Pieri\n, who had moved to the University of Parma in\n1908\nso that he might return to his native Tuscany, died on\n1\nMarch\n1913\nand for the remainder of that academic year his teaching was covered by Attilio Vergerio\n(1877\n-\n1937)\n. Vergerio had been\nPieri\n's assistant since\n1908\nand had delivered\nPieri\n's lectures during his final illness. However, Scorza was appointed to fill\nPieri\n's chair and, from the start of the academic year\n1913\n-\n14\n, he taught the courses that\nPieri\nhad given.\nOne of the main ideas for which Scorza is known is that of\nRiemann\nmatrices. This work is discussed by Guido Zappa in\n[\n13\n]\n. Zappa writes:-\n... the scientific activity of Gaetano Scorza after the year\n1915\nis studied. In the year\n1916\nScorza published a valuable paper in which the concept of\nRiemann\nmatrix was introduced. In this way a unitary treatment of various geometric theories\n(\nabelian integrals, abelian functions, etc.\n)\nwas given. In the year\n1921\nScorza published a new important paper where some problems posed in the previous paper were solved by the theory of algebras.\nZappa also looks at this work by Scorza in\n[\n14\n]\n. He writes:-\n... contributions of Italian geometers\n(\nduring the period\n(1910\n-\n1915)\nto abelian varieties of higher dimension are illustrated. Particularly, the papers of Gaetano Scorza on singular varieties and on reducible abelian integrals are considered. Scorza was able to achieve a unitary theory, illustrated in a fundamental essay\n(1916)\n.\nIn\n1916\nScorza transferred to the University of Catania, then in\n1921\nhe moved to Naples. In was in that year, while still in Catania, that he published\nCorpi numerici ed Algebre\nⓉ\n(\nNumber fields and algebras\n)\n. The authors of\n[\n1\n]\ngive the following indication of its content and importance:-\nThe text is immediately acknowledged for its importance, with awards and influential and encouraging quotations even beyond national boundaries. Scorza exposes a general field theory - for which he uses the term 'corpi numerici' - and an associative algebra theory, pointing also to their applications within the geometrical field. The step towards a wholly abstract presentation of algebra structure is done, at this point.\nLet us quote from the book Scorza's own justification of his abstract approach:-\nSomeone who has learnt that different concrete theories, dealing with different entities 'toto coelo', schematically give rise to the same abstract theory, could do this only because, moving out of each of them, they have managed to gain a superior point of view from which to look at them simultaneously. ... The mathematician, who does not possess the general theory of what is called 'corpi numerici' knows, through algebra, the theory of equations; through number theory, the theory of congruencies with respect to a prime modulus; through the treatises on algebraic numbers, the theory of congruencies with respect to a prime ideal; three theories of which, even if he has spotted some analogy, he does not see the innermost bounds.\nAfter fourteen years at the University of Naples, in\n1935\nhe moved to Rome, where he remained for the rest of his career.\nSeveri\nwrites about his appointment to the University of Rome\n[\n12\n]\n:-\nHis ascension to the university Chair was greeted with applause by all the Italian mathematicians. The Evaluation Commission\n(\nof which I was the rapporteur\n)\nfrom the beginning of their deliberations unanimously recognised that he belonged, without question, in the first place.\nDespite the years of difficulty when he was a young man, Scorza published more than\n160\nworks over his career, most importantly in algebraic geometry and related algebraic fields, but also very many general works and textbooks. We mentioned his main contributions above but we should also note that he wrote eight articles on\ngroup theory\n.\nJean Dieudonné\nwrites:-\nTwo of his eight papers on group theory are concerned with group algebras, and are slightly different presentations of the well-known papers of\nFrobenius\nand\nI Schur\n. Among the other papers, three develop an idea of\nM Cipolla\non nonabelian groups G, which is to study a partition of the complement of the center, two elements being in the same set if they have the same centralizer; he relates the number of sets of that partition contained in a subgroup H to the number of centralizers containing H. The most original paper is the one in which Scorza apparently was the first to investigate which groups can be the union of a finite number of their proper subgroups. In it, he shows that the number of proper subgroups cannot be two and characterized the groups for which that number is three\n(\nthe\nKlein\n4\n-group is the simplest example\n)\n.\nHe wrote a book on group theory,\nGruppi Astratti\nⓉ\n(\nAbstract Groups\n)\n, published posthumously in\n1942\n. H A Thurston writes in a review:-\nThis book is concerned with abstract groups, finite or infinite; some results are stated for denumerable groups with the remark that the proof holds in general if the selection axiom is used. ... The book is very clearly written\n(\nwhich makes for easy reading\n)\n...\nIn fact, in addition to his research contributions, he made a major commitment to mathematical education. In\n1909\n, following the death of Giovanni Vailati, Scorza joined\nGuido Castelnuovo\nand\nFederico Enriques\nas the Italian delegates on the International Commission on Mathematical Instruction. He was the author of two major reports for the Commission, namely\nL'insegnamento della matematica nelle Scuole e negli Istituti tecnici\nⓉ\n(\nThe teaching of mathematics in schools and technical colleges\n)\n(1911)\nwhich examines mathematics teaching in technical schools and institutes, and\nSui libri di testo di geometria per le scuole secondarie superiori\n(1912)\nwhich looked at geometry textbooks written at upper secondary school level. To give some idea of his ideas on teaching we give a quote from\nLa matematica come arte\nⓉ\n(\nMathematics as art\n)\nwhich he published in\n1930\n:-\nA mathematics lesson can be a work of art and not a tired repetition of postulates, theorems and corollaries strung one after another with a lifeless mechanical delivery like the disconnected words of a child's nursery rhyme; but provided that the person who gives the lesson appears to the student ... to be a very secure master of what he has to say ... so that he presents each argument to the students as if it sprang ... bright, spontaneous and new, from the living flow of the discussion.\nFinally, let point out how much Scorza admired\nFelix Klein\nand, in particular,\nKlein\n's book\nElementarmathematik vom höheren Standpunkte aus\nⓉ\n(\nElementary mathematics from an advanced standpoint\n)\n(1910)\n, which he reviewed in glowing terms\n[\n8\n]\n:-\nScorza admired\nKlein\nfor his research method, his mastery of the most disparate branches of mathematics, his capacity for grasping the even most hidden relationships between them, and for having outlined vast programs of work.\nHe was elected to the\nReale Accademia dei Lincei\nin\n1926\n, and he was a member of the Consiglio Superiore della Pubblica Istruzione from\n1923\nto\n1932\n. He was editor-in-chief of the Rendiconti del seminario matematico della Università di Roma, served as president of the mathematics committee of the Italian National Research Council from\n1928\nto\n1931\n, and he was vice-president of the International Commission on Mathematical Instruction from\n1932\nuntil his death in\n1939\n. Shortly before his death he was appointed a senator of the Kingdom of Italy.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}