{
  "nome_completo": "Galileo Galilei",
  "nome_curto": "Galileo Galilei",
  "ano_nascimento": "1564",
  "ano_morte": "1642",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Galileo/",
  "lugar_nascimento": "Pisa (now  Italy)",
  "lugar_morte": "Arcetri near Florence (now  Italy)",
  "biografia": "Galileo Galilei\n's parents were Vincenzo Galilei and Guilia Ammannati. Vincenzo, who was born in Florence in\n1520\n, was a teacher of music and a fine lute player. After studying music in Venice he carried out experiments on strings to support his musical theories. Guilia, who was born in Pescia, married Vincenzo in\n1563\nand they made their home in the countryside near Pisa. Galileo was their first child and spent his early years with his family in Pisa.\nIn\n1572\n, when Galileo was eight years old, his family returned to Florence, his father's home town. However, Galileo remained in Pisa and lived for two years with Muzio Tedaldi who was related to Galileo's mother by marriage. When he reached the age of ten, Galileo left Pisa to join his family in Florence and there he was tutored by Jacopo Borghini. Once he was old enough to be educated in a monastery, his parents sent him to the Camaldolese Monastery at Vallombrosa which is situated on a magnificent forested hillside\n33\nkm southeast of Florence. The Camaldolese Order was independent of the Benedictine Order, splitting from it in about\n1012\n. The Order combined the solitary life of the hermit with the strict life of the monk and soon the young Galileo found this life an attractive one. He became a novice, intending to join the Order, but this did not please his father who had already decided that his eldest son should become a medical doctor.\nVincenzo had Galileo return from Vallombrosa to Florence and give up the idea of joining the Camaldolese order. He did continue his schooling in Florence, however, in a school run by the Camaldolese monks. In\n1581\nVincenzo sent Galileo back to Pisa to live again with Muzio Tedaldi and now to enrol for a medical degree at the University of Pisa. Although the idea of a medical career never seems to have appealed to Galileo, his father's wish was a fairly natural one since there had been a distinguished physician in his family in the previous century. Galileo never seems to have taken medical studies seriously, attending courses on his real interests which were in mathematics and natural philosophy. His mathematics teacher at Pisa was Filippo Fantoni, who held the chair of mathematics. Galileo returned to Florence for the summer vacations and there continued to study mathematics.\nIn the year\n1582\n-\n83\nOstilio Ricci, who was the mathematician of the Tuscan Court and a former pupil of\nTartaglia\n, taught a course on\nEuclid\n's\nElements\nat the University of Pisa which Galileo attended. During the summer of\n1583\nGalileo was back in Florence with his family and Vincenzo encouraged him to read Galen to further his medical studies. However Galileo, still reluctant to study medicine, invited Ricci\n(\nalso in Florence where the Tuscan court spent the summer and autumn\n)\nto his home to meet his father. Ricci tried to persuade Vincenzo to allow his son to study mathematics since this was where his interests lay. Certainly Vincenzo did not like the idea and resisted strongly but eventually he gave way a little and Galileo was able to study the works of\nEuclid\nand\nArchimedes\nfrom the Italian translations which\nTartaglia\nhad made. Of course he was still officially enrolled as a medical student at Pisa but eventually, by\n1585\n, he gave up this course and left without completing his degree.\nGalileo began teaching mathematics, first privately in Florence and then during\n1585\n-\n86\nat Siena where he held a public appointment. During the summer of\n1586\nhe taught at Vallombrosa, and in this year he wrote his first scientific book\nThe little balance\n[\nLa Balancitta\n]\nwhich described\nArchimedes\n' method of finding the specific gravities\n(\nthat is the relative densities\n)\nof substances using a balance. In the following year he travelled to Rome to visit\nClavius\nwho was professor of mathematics at the Jesuit Collegio Romano there. A topic which was very popular with the Jesuit mathematicians at this time was centres of gravity and Galileo brought with him some results which he had discovered on this topic. Despite making a very favourable impression on\nClavius\n, Galileo failed to gain an appointment to teach mathematics at the University of Bologna.\nAfter leaving Rome Galileo remained in contact with\nClavius\nby correspondence and\nGuidobaldo del Monte\nwas also a regular correspondent. Certainly the theorems which Galileo had proved on the centres of gravity of solids, and left in Rome, were discussed in this correspondence. It is also likely that Galileo received lecture notes from courses which had been given at the Collegio Romano, for he made copies of such material which still survive today. The correspondence began around\n1588\nand continued for many years. Also in\n1588\nGalileo received a prestigious invitation to lecture on the dimensions and location of hell in Dante's\nInferno\nat the Academy in Florence.\nFantoni left the chair of mathematics at the University of Pisa in\n1589\nand Galileo was appointed to fill the post\n(\nalthough this was only a nominal position to provide financial support for Galileo\n)\n. Not only did he receive strong recommendations from\nClavius\n, but he also had acquired an excellent reputation through his lectures at the Florence Academy in the previous year. The young mathematician had rapidly acquired the reputation that was necessary to gain such a position, but there were still higher positions at which he might aim. Galileo spent three years holding this post at the university of Pisa and during this time he wrote\nDe Motu\na series of essays on the theory of motion which he never published. It is likely that he never published this material because he was less than satisfied with it, and this is fair for despite containing some important steps forward, it also contained some incorrect ideas. Perhaps the most important new ideas which\nDe Motu\ncontains is that one can test theories by conducting experiments. In particular the work contains his important idea that one could test theories about falling bodies using an inclined plane to slow down the rate of descent.\nIn\n1591\nVincenzo Galilei, Galileo's father, died and since Galileo was the eldest son he had to provide financial support for the rest of the family and in particular have the necessary financial means to provide dowries for his two younger sisters. Being professor of mathematics at Pisa was not well paid, so Galileo looked for a more lucrative post. With strong recommendations from\nGuidobaldo del Monte\n, Galileo was appointed professor of mathematics at the University of Padua\n(\nthe university of the Republic of Venice\n)\nin\n1592\nat a salary of three times what he had received at Pisa. On\n7\nDecember\n1592\nhe gave his inaugural lecture and began a period of eighteen years at the university, years which he later described as the happiest of his life. At Padua his duties were mainly to teach\nEuclid\n's geometry and standard\n(\ngeocentric\n)\nastronomy to medical students, who would need to know some astronomy in order to make use of astrology in their medical practice. However, Galileo argued against\nAristotle\n's view of astronomy and natural philosophy in three public lectures he gave in connection with the appearance of a New Star\n(\nnow known as '\nKepler\n's supernova'\n)\nin\n1604\n. The belief at this time was that of\nAristotle\n, namely that all changes in the heavens had to occur in the lunar region close to the Earth, the realm of the fixed stars being permanent. Galileo used parallax arguments to prove that the New Star could not be close to the Earth. In a personal letter written to\nKepler\nin\n1598\n, Galileo had stated that he was a Copernican\n(\nbeliever in the theories of\nCopernicus\n)\n. However, no public sign of this belief was to appear until many years later.\nAt Padua, Galileo began a long term relationship with Maria Gamba, who was from Venice, but they did not marry perhaps because Galileo felt his financial situation was not good enough. In\n1600\ntheir first child Virginia was born, followed by a second daughter Livia in the following year. In\n1606\ntheir son Vincenzo was born.\nWe mentioned above an error in Galileo's theory of motion as he set it out in\nDe Motu\naround\n1590\n. He was quite mistaken in his belief that the force acting on a body was the relative difference between its specific gravity and that of the substance through which it moved. Galileo wrote to his friend Paolo Sarpi, a fine mathematician who was consultor to the Venetian government, in\n1604\nand it is clear from his letter that by this time he had realised his mistake. In fact he had returned to work on the theory of motion in\n1602\nand over the following two years, through his study of inclined planes and the pendulum, he had formulated the correct law of falling bodies and had worked out that a projectile follows a parabolic path. However, these famous results would not be published for another\n35\nyears.\nIn May\n1609\n, Galileo received a letter from Paolo Sarpi telling him about a spyglass that a Dutchman had shown in Venice. Galileo wrote in the\nStarry Messenger\n(\nSidereus Nuncius\n)\nin April\n1610\n:-\nAbout ten months ago a report reached my ears that a certain Fleming had constructed a spyglass by means of which visible objects, though very distant from the eye of the observer, were distinctly seen as if nearby. Of this truly remarkable effect several experiences were related, to which some persons believed while other denied them. A few days later the report was confirmed by a letter I received from a Frenchman in Paris, Jacques Badovere, which caused me to apply myself wholeheartedly to investigate means by which I might arrive at the invention of a similar instrument. This I did soon afterwards, my basis being the doctrine of refraction.\nFrom these reports, and using his own technical skills as a mathematician and as a craftsman, Galileo began to make a series of telescopes whose optical performance was much better than that of the Dutch instrument. His first telescope was made from available lenses and gave a magnification of about four times. To improve on this Galileo learned how to grind and polish his own lenses and by August\n1609\nhe had an instrument with a magnification of around eight or nine. Galileo immediately saw the commercial and military applications of his telescope\n(\nwhich he called a\nperspicillum\n)\nfor ships at sea. He kept Sarpi informed of his progress and Sarpi arranged a demonstration for the Venetian Senate. They were very impressed and, in return for a large increase in his salary, Galileo gave the sole rights for the manufacture of telescopes to the Venetian Senate. It seems a particularly good move on his part since he must have known that such rights were meaningless, particularly since he always acknowledged that the telescope was not his invention!\nBy the end of\n1609\nGalileo had turned his telescope on the night sky and began to make remarkable discoveries. Swerdlow writes\n(\nsee\n[\n16\n]\n)\n:-\nIn about two months, December and January, he made more discoveries that changed the world than anyone has ever made before or since.\nThe astronomical discoveries he made with his telescopes were described in a short book called the\nStarry Messenger\npublished in Venice in May\n1610\n. This work caused a sensation. Galileo claimed to have seen mountains on the Moon, to have proved the\nMilky Way\nwas made up of tiny stars, and to have seen four small bodies orbiting Jupiter. These last, with an eye to getting a position in Florence, he quickly named 'the Medicean stars'. He had also sent Cosimo de Medici, the Grand Duke of Tuscany, an excellent telescope for himself.\nThe Venetian Senate, perhaps realising that the rights to manufacture telescopes that Galileo had given them were worthless, froze his salary. However he had succeeded in impressing Cosimo and, in June\n1610\n, only a month after his famous little book was published, Galileo resigned his post at Padua and became Chief Mathematician at the University of Pisa\n(\nwithout any teaching duties\n)\nand 'Mathematician and Philosopher' to the Grand Duke of Tuscany. In\n1611\nhe visited Rome where he was treated as a leading celebrity; the Collegio Romano put on a grand dinner with speeches to honour Galileo's remarkable discoveries. He was also made a member of the\nAccademia dei Lincei\n(\nin fact the sixth member\n)\nand this was an honour which was especially important to Galileo who signed himself 'Galileo Galilei Linceo' from this time on.\nWhile in Rome, and after his return to Florence, Galileo continued to make observations with his telescope. Already in the\nStarry Messenger\nhe had given rough periods of the four moons of Jupiter, but more precise calculations were certainly not easy since it was difficult to identify from an observation which moon was I, which was II, which III, and which IV. He made a long series of observations and was able to give accurate periods by\n1612\n. At one stage in the calculations he became very puzzled since the data he had recorded seemed inconsistent, but he had forgotten to take into account the motion of the Earth round the sun.\nGalileo first turned his telescope on Saturn on\n25\nJuly\n1610\nand it appeared as three bodies\n(\nhis telescope was not good enough to show the rings but made them appear as lobes on either side of the planet\n)\n. Continued observations were puzzling indeed to Galileo as the bodies on either side of Saturn vanished when the ring system was edge on. Also in\n1610\nhe discovered that, when seen in the telescope, the planet Venus showed phases like those of the Moon, and therefore must orbit the Sun not the Earth. This did not enable one to decide between the Copernican system, in which everything goes round the Sun, and that proposed by\nTycho Brahe\nin which everything but the Earth\n(\nand Moon\n)\ngoes round the Sun which in turn goes round the Earth. Most astronomers of the time in fact favoured\nBrahe\n's system and indeed distinguishing between the two by experiment was beyond the instruments of the day. However, Galileo knew that all his discoveries were evidence for Copernicanism, although not a proof. In fact it was his theory of falling bodies which was the most significant in this respect, for opponents of a moving Earth argued that if the Earth rotated and a body was dropped from a tower it should fall behind the tower as the Earth rotated while it fell. Since this was not observed in practice this was taken as strong evidence that the Earth was stationary. However Galileo already knew that a body would fall in the observed manner on a rotating Earth.\nOther observations made by Galileo included the observation of sunspots. He reported these in\nDiscourse on floating bodies\nwhich he published in\n1612\nand more fully in\nLetters on the sunspots\nwhich appeared in\n1613\n. In the following year his two daughters entered the Franciscan Convent of St Matthew outside Florence, Virginia taking the name Sister Maria Celeste and Livia the name Sister Arcangela. Since they had been born outside of marriage, Galileo believed that they themselves should never marry. Although Galileo put forward many revolutionary correct theories, he was not correct in all cases. In particular when three comets appeared in\n1618\nhe became involved in a controversy regarding the nature of comets. He argued that they were close to the Earth and caused by optical refraction. A serious consequence of this unfortunate argument was that the Jesuits began to see Galileo as a dangerous opponent.\nDespite his private support for Copernicanism, Galileo tried to avoid controversy by not making public statements on the issue. However he was drawn into the controversy through\nCastelli\nwho had been appointed to the chair of mathematics in Pisa in\n1613\n.\nCastelli\nhad been a student of Galileo's and he was also a supporter of\nCopernicus\n. At a meeting in the Medici palace in Florence in December\n1613\nwith the Grand Duke Cosimo II and his mother the Grand Duchess Christina of Lorraine,\nCastelli\nwas asked to explain the apparent contradictions between the Copernican theory and Holy Scripture.\nCastelli\ndefended the Copernican position vigorously and wrote to Galileo afterwards telling him how successful he had been in putting the arguments. Galileo, less convinced that\nCastelli\nhad won the argument, wrote\nLetter to Castelli\nto him arguing that the Bible had to be interpreted in the light of what science had shown to be true. Galileo had several opponents in Florence and they made sure that a copy of the\nLetter to Castelli\nwas sent to the Inquisition in Rome. However, after examining its contents they found little to which they could object.\nThe Catholic Church's most important figure at this time in dealing with interpretations of the Holy Scripture was Cardinal Robert Bellarmine. He seems at this time to have seen little reason for the Church to be concerned regarding the Copernican theory. The point at issue was whether\nCopernicus\nhad simply put forward a mathematical theory which enabled the calculation of the positions of the heavenly bodies to be made more simply or whether he was proposing a physical reality. At this time Bellarmine viewed the theory as an elegant mathematical one which did not threaten the established Christian belief regarding the structure of the universe.\nIn\n1616\nGalileo wrote the\nLetter to the Grand Duchess\nwhich vigorously attacked the followers of\nAristotle\n. In this work, which he addressed to the Grand Duchess Christina of Lorraine, he argued strongly for a non-literal interpretation of Holy Scripture when the literal interpretation would contradict facts about the physical world proved by mathematical science. In this Galileo stated quite clearly that for him the Copernican theory is not just a mathematical calculating tool, but is a physical reality:-\nI hold that the Sun is located at the centre of the revolutions of the heavenly orbs and does not change place, and that the Earth rotates on itself and moves around it. Moreover ... I confirm this view not only by refuting\nPtolemy\n's and\nAristotle\n's arguments, but also by producing many for the other side, especially some pertaining to physical effects whose causes perhaps cannot be determined in any other way, and other astronomical discoveries; these discoveries clearly confute the Ptolemaic system, and they agree admirably with this other position and confirm it.\nPope Paul V ordered Bellarmine to have the Sacred Congregation of the Index decide on the Copernican theory. The cardinals of the Inquisition met on\n24\nFebruary\n1616\nand took evidence from theological experts. They condemned the teachings of\nCopernicus\n, and Bellarmine conveyed their decision to Galileo who had not been personally involved in the trial. Galileo was forbidden to hold Copernican views but later events made him less concerned about this decision of the Inquisition. Most importantly Maffeo Barberini, who was an admirer of Galileo, was elected as Pope Urban VIII. This happened just as Galileo's book\nIl saggiatore\n(\nThe Assayer\n)\nwas about to be published by the\nAccademia dei Lincei\nin\n1623\nand Galileo was quick to dedicate this work to the new Pope. The work described Galileo's new scientific method and contains a famous quote regarding mathematics:-\nPhilosophy is written in this grand book, the universe, which stands continually open to our gaze. But the book cannot be understood unless one first learns to comprehend the language and read the characters in which it is written. It is written in the language of mathematics, and its characters are triangles, circles, and other geometric figures without which it is humanly impossible to understand a single word of it; without these one is wandering in a dark labyrinth.\nPope Urban VIII invited Galileo to papal audiences on six occasions and led Galileo to believe that the Catholic Church would not make an issue of the Copernican theory. Galileo, therefore, decided to publish his views believing that he could do so without serious consequences from the Church. However by this stage in his life Galileo's health was poor with frequent bouts of severe illness and so even though he began to write his famous\nDialogue\nin\n1624\nit took him six years to complete the work.\nGalileo attempted to obtain permission from Rome to publish the\nDialogue\nin\n1630\nbut this did not prove easy. Eventually he received permission from Florence, and not Rome. In February\n1632\nGalileo published\nDialogue Concerning the Two Chief Systems of the World - Ptolemaic and Copernican\n. It takes the form of a dialogue between Salviati, who argues for the Copernican system, and Simplicio who is an Aristotelian philosopher. The climax of the book is an argument by Salviati that the Earth moves which was based on Galileo's theory of the tides. Galileo's theory of the tides was entirely false despite being postulated after\nKepler\nhad already put forward the correct explanation. It was unfortunate, given the remarkable truths the\nDialogue\nsupported, that the argument which Galileo thought to give the strongest proof of\nCopernicus\n's theory should be incorrect.\nShortly after publication of\nDialogue Concerning the Two Chief Systems of the World - Ptolemaic and Copernican\nthe Inquisition banned its sale and ordered Galileo to appear in Rome before them. Illness prevented him from travelling to Rome until\n1633\n. Galileo's accusation at the trial which followed was that he had breached the conditions laid down by the Inquisition in\n1616\n. However a different version of this decision was produced at the trial rather than the one Galileo had been given at the time. The truth of the Copernican theory was not an issue therefore; it was taken as a fact at the trial that this theory was false. This was logical, of course, since the judgement of\n1616\nhad declared it totally false.\nFound guilty, Galileo was condemned to lifelong imprisonment, but the sentence was carried out somewhat sympathetically and it amounted to house arrest rather than a prison sentence. He was able to live first with the Archbishop of Siena, then later to return to his home in Arcetri, near Florence, but had to spend the rest of his life watched over by officers from the Inquisition. In\n1634\nhe suffered a severe blow when his daughter Virginia, Sister Maria Celeste, died. She had been a great support to her father through his illnesses and Galileo was shattered and could not work for many months. When he did manage to restart work, he began to write\nDiscourses and mathematical demonstrations concerning the two new sciences\n.\nAfter Galileo had completed work on the\nDiscourses\nit was smuggled out of Italy, and taken to Leyden in Holland where it was published. It was his most rigorous mathematical work which treated problems on impetus, moments, and centres of gravity. Much of this work went back to the unpublished ideas in\nDe Motu\nfrom around\n1590\nand the improvements which he had worked out during\n1602\n-\n1604\n. In the\nDiscourses\nhe developed his ideas of the inclined plane writing:-\nI assume that the speed acquired by the same movable object over different inclinations of the plane are equal whenever the heights of those planes are equal.\nHe then described an experiment using a pendulum to verify his property of inclined planes and used these ideas to give a theorem on acceleration of bodies in free fall:-\nThe time in which a certain distance is traversed by an object moving under uniform acceleration from rest is equal to the time in which the same distance would be traversed by the same movable object moving at a uniform speed of one half the maximum and final speed of the previous uniformly accelerated motion.\nAfter giving further results of this type he gives his famous result that the distance that a body moves from rest under uniform acceleration is proportional to the square of the time taken.\nOne would expect that Galileo's understanding of the pendulum, which he had since he was a young man, would have led him to design a pendulum clock. In fact he only seems to have thought of this possibility near the end of his life and around\n1640\nhe did design the first pendulum clock. Galileo died in early\n1642\nbut the significance of his clock design was certainly realised by his son Vincenzo who tried to make a clock to Galileo's plan, but failed.\nIt was a sad end for so great a man to die condemned of heresy. His will indicated that he wished to be buried beside his father in the family tomb in the Basilica of Santa Croce but his relatives feared, quite rightly, that this would provoke opposition from the Church. His body was concealed and only placed in a fine tomb in the church in\n1737\nby the civil authorities against the wishes of many in the Church. On\n31\nOctober\n1992\n,\n350\nyears after Galileo's death, Pope John Paul II gave an address on behalf of the Catholic Church in which he admitted that errors had been made by the theological advisors in the case of Galileo. He declared the Galileo case closed, but he did not admit that the Church was wrong to convict Galileo on a charge of heresy because of his belief that the Earth rotates round the sun.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}