{
  "nome_completo": "Magnus Gösta Mittag-Leffler",
  "nome_curto": "Gösta Mittag-Leffler",
  "ano_nascimento": "1846",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mittag-Leffler/",
  "lugar_nascimento": "Stockholm, Sweden",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "Gösta Mittag-Leffler\n's father was Johan Olof Leffler while his mother was Gustava Wilhelmina Mittag. The reader will have noticed that Gösta Mittag-Leffler had a surname which combined both his mother's name Mittag and his father's name Leffler so might suppose that when his parents married they combined their names; however this was not so. Gösta's mother took the name Gustava Wilhelmina Leffler on her marriage and when their first child Gösta was born, he took the name Gösta Leffler. It was not until Gösta Leffler was a twenty year old student that he decided to add \"Mittag\" to his name. This was a clear indication of his feelings for his mother and for his grandparents on his mother's side.\nGösta's father was a school teacher who became a headmaster of a high school in Stockholm. He also served a spell as a member of parliament. As we mentioned, Gösta was the eldest of the family and he was born in the schoolhouse at the school where his father taught. After a while his parents bought a house of their own and in this new home Gösta's sister and two brothers were born; none of them would follow Gösta in adding Mittag to their names. Both sides of the family were of German origin but had lived for several generations in Sweden. Gösta's grandfather on his father's side was a sail maker who, like his son would do, served for a time as a member of parliament. Gösta's grandfather on his mother's side was a dean in the church, living in a country area of Sweden. As a young boy Gösta spent each summer holiday with his mother's parents and he had a great affection for his mother's family.\nIt was clear from his later life that Mittag-Leffler had many talents in addition to his mathematics and it was his upbringing that did much to foster these talents. His parents house was frequently filled with their friends and it provided an environment in which Gösta, together with his brothers and sister, learnt much in addition to their schooling. Gösta also showed his many talents as he progressed through school, and his teachers in elementary school and later those at the\nGymnasium\nin Stockholm realised that he had an outstanding ability for mathematics\nGårding\nwrites\n[\n7\n]\n:-\nFrom an early age Gösta Leffler kept an irregular diary. His early entries show an interest in literature and later, when he was around twenty, the diary gives the picture of a well-behaved and well-educated young man with general interests.\nMittag-Leffler trained as an actuary but later took up mathematics. He studied at Uppsala, entering in\n1865\n. During his studies he supported himself by taking private pupils. He submitted and:-\n... defended a less than remarkable thesis in\n1872\non applications of the argument principle.\nAs a result Mittag-Leffler was appointed as a\nDocent\nat the University of Uppsala in\n1872\n. Perhaps the event which would have the greatest lasting effect on his life was being awarded a salary which came through an endowment with a condition attached which said that the holder had to spend three years abroad. In October\n1873\nMittag-Leffler set off for Paris.\nAlthough Mittag-Leffler met many mathematicians in Paris, such as\nBouquet\n,\nBriot\n,\nChasles\n,\nDarboux\n, and\nLiouville\n, the main aim of the visit was to learn from\nHermite\n. Mittag-Leffler attended\nHermite\n's lectures on\nelliptic functions\nbut found them hard going. His stay in Paris is described in detail in a diary he kept. His time consisted of:-\n... a visit to the theatre\n(\nSarah Bernhardt\n)\n, discussions on political and religious matters, lessons in French and English, a visit to the workers' quarter, reflections on people met and so on. Sometimes there is a sigh over\nHermite\n's lectures, so difficult to understand.\nCertainly\nHermite\nspoke in glowing terms about\nWeierstrass\nand the contributions he and other German mathematicians were making, so Mittag-Leffler made a decision to go to Berlin in the spring of\n1875\n. There he attended\nWeierstrass\n's lectures which proved to be extremely influential in setting the direction of Mittag-Leffler's subsequent mathematical work. Much later in life he described his three years abroad:-\nI got a vivid impression of the sharp tension between academic circles in Paris and Berlin during my visits to the two capitals. I was therefore struck by my experience that\nHermite\nand\nWeierstrass\nwere absolutely free of nationalistic feelings or leanings. Both were born Catholics and\nHermite\n, as\nCauchy\nbefore him, was a warm believer.\nWeierstrass\nwas interested in, or rather amused by, talking to learned prelates about the finest points of the church dogmas.\nWhile Mittag-Leffler was in Berlin he learnt that the professor of mathematics at Helsingfors\n(\ntoday called Helsinki\n)\n, Lorenz Lindelöf, the father of Ernst\nLindelöf\n, was leaving the chair to take up an administrative post. Mittag-Leffler wrote about these events:-\nIn\n1875\nduring my stay in Berlin, I was informed in a roundabout way through Uppsala that the professorship in mathematics in Helsingfors was open. It was L Lindelöf, an important mathematician and rector of the university, who was going to the National School Board... and I decided to apply for his post. When I payed a visit to my teacher, the famous mathematician\nWeierstrass\n, and told him about my plans, he exclaimed: No, please, do not do that! I have written to the minister of culture and asked him to institute an extraordinary professorship for you here in Berlin and I just got the message that my application has been granted!\nI was not blind to the great advantages, mathematically speaking, of such a position compared to the one in Helsingfors. Hardly ever was there such a brilliant collection of distinguished mathematicians:\nWeierstrass\n,\nKummer\n,\nKronecker\n,\nHelmholtz\n,\nKirchhoff\n,\nBorchardt\netc. But the conditions were not endurable for a foreigner. It was not so long after Germany's victorious war against France, and German arrogance was at a high point. Foreigners were treated with haughty condescension; der grosse Kaiser, Bismarck, Moltke etc. were words heard everywhere. It was taken as a matter of course that Holland, Sweden etc. would be members of a German Bund. For those who were not born Germans, it was impossible to live under such conditions. At least this is what I thought. Now things are different, the brilliant victory has not born the fruits that the Germans imagined and they have taken a more realistic view. However, my application to Helsingfors was not sent immediately ...\nWe have quoted extensively from Mittag-Leffler's writing about this overseas trip and his reaction to national rivalries. We have done so because it is important in determining the international role which Mittag-Leffler went on to play, for his passion for international cooperation in mathematics was a direct consequence of what he saw on his three year trip abroad.\nMittag-Leffler was appointed to a chair at the University of Helsinki in\n1876\nand, five years later, he returned to his home town of Stockholm to take up a chair at the University. He was the first holder of the mathematics chair in the new university of Stockholm\n(\ncalled Stockholms Högskola at this time\n)\n. Soon after taking up the appointment, he began to organise the setting up of the new international journal\nActa Mathematica\n. We will discuss this important aspect of his contribution below. In\n1882\nhe married Signe af Lindfors who came from a wealthy family. They had met while Mittag-Leffler was living in Helsinki and, although Signe was from a Swedish family, they too were living in Finland.\nMittag-Leffler made numerous contributions to mathematical analysis particularly in areas concerned with limits and including calculus, analytic geometry and\nprobability theory\n. He worked on the general theory of functions, studying relationships between independent and dependent variables.\nHis best known work concerned the analytic representation of a one-valued function, this work culminated in the Mittag-Leffler theorem. This study began as an attempt to generalise results in\nWeierstrass\n's lectures where he had described his theorem on the existence of an\nentire function\nwith prescribed zeros each with a specified multiplicity. Mittag-Leffler tried to generalise this result to\nmeromorphic function\nwhile he was studying in Berlin.\nHe eventually assembled his findings on generalising\nWeierstrass\n's theorem to meromorphic functions into a paper which he published\n(\nin French\n)\nin\n1884\nin\nActa Mathematica\n. In this paper Mittag-Leffler proposed a series of general topological notions on infinite point sets based on\nCantor\n's new set theory\n[\n8\n]\n:-\nWith this paper ... Mittag-Leffler became the sole proprietor of a theorem that later became widely known and with this he took his place in the circle of internationally known mathematicians.\nMittag-Leffler was one of the first mathematicians to support\nCantor\n's theory of sets but, one has to remark, a consequence of this was that\nKronecker\nrefused to publish in\nActa Mathematica\n.\nBetween\n1900\nand\n1905\nMittag-Leffler published a series of five papers which he called \"Notes\" on the summation of divergent series. The aim of these notes was to construct the analytical continuation of a power series outside its circle of convergence. The region in which he was able to do this is now called Mittag-Leffler's star.\nIn\n1882\nMittag-Leffler founded\nActa Mathematica\nand served as chief editor of the journal for\n45\nyears. The original idea for such a journal came from Sophus\nLie\nin\n1881\n, but it was Mittag-Leffler's understanding of the European mathematical scene, together with his political skills, which ensured its success. His wife Signe was, as we have mentioned, extremely wealthy and her money helped support the setting up of the Journal but most of the money needed came from an appeal and from subscriptions. However, periodicals like\nActa Mathematica\ndo not succeed just because of money. It required an international base and certainly Mittag-Leffler fully understood this. He needed leading mathematicians to send papers to\nActa Mathematica\nand\nCantor\nand\nPoincaré\ncontributed many papers to the first few volumes. But there was another important factor in its success as\nHardy\npoints our\n[\n9\n]\n:-\n.. Mittag-Leffler was always a good judge of the quality of the work submitted to him for publication. Even in his later years, when most of the editorial work was delegated to others, he retained that curious sense which enables the great editor to feel the value of the work at which he has hardly glanced...\nIn\n1884\n, the year Mittag-Leffler published his masterpiece,\nKovalevskaya\narrived in Stockholm at his invitation. On her death in\n1891\nMittag-Leffler wrote:-\nShe came to us from the centre of modern science full of faith and enthusiasm for the ideas of her great master in Berlin, the venerable old man who has outlived his favourite pupil. Her works, all of which belong to the same order of ideas, have shown by new discoveries the power of\nWeierstrass\n's system.\nBy the early\n1890\ns Mittag-Leffler had built for his family a wonderful new home in Djursholm in the suburbs of Stockholm. He then divided his life between time spent at his home in Djursholm and at his country home at Tallberg, around\n300\nkm north of Stockholm. In his home in the garden suburbs of Stockholm he had the finest mathematical library in the world.\nHardy\nspent time with Mittag-Leffler in his library and describes it in\n[\n9\n]\n:-\nAll books and periodical were there, ... and if one got tired one could read the correspondence of all the mathematicians in the world, or enjoy the view of Stockholm from the roof.\nOf Mittag-Leffler's country home\nHardy\nwrites:-\n... there Mittag-Leffler appeared at his best, a most entertaining mixture of the great international mathematician and the rather naive country squire. He was a strong nationalist, in spite of his internationalism, as anyone who lived in so beautiful a country might be; and he loved his house and his garden and his position as the landowner of the countryside.\nMittag-Leffler and his wife bequeathed their library and estate at Djursholm in Sweden to the\nSwedish Academy of Sciences\nin\n1916\n. World War I caused a loss in the value of money left by the Mittag-Lefflers to fund the mathematical foundation which they proposed. However, eventually the Mittag-Leffler Institute was set up based on the house and today is a major mathematical research centre.\nHardy\n, writing in\n[\n9\n]\n, describes the regard that Mittag-Leffler was held in, particularly in his own country:-\nI can remember well the occasion when he lectured for the last time to a Scandinavian Congress, at Copenhagen in\n1925\n, and the whole audience rose and stood as he entered the room. It was a reception rather astonishing at first to a visitor from a less ceremonious country; but it was an entirely spontaneous expression of the universal feeling that to him, more than to any other single man, the great advance in the status of Scandinavian mathematics during the last fifty years was due.\nMittag-Leffler received many honours. He was an honorary member of almost every mathematical society in the world including the Cambridge Philosophical Society, the\nLondon Mathematical Society\n, the Royal Institution, the\nRoyal Irish Academy\n, and the Institute of France. He was elected a Fellow of the\nRoyal Society of London\nin\n1896\n. He was awarded honorary degrees from the universities of Oxford, Cambridge, Aberdeen, St Andrews, Bologna and Christiania\n(\nnow Oslo\n)\n.\nHis contribution is nicely summed up by\nHardy\n[\n9\n]\n:-\nMittag-Leffler was a remarkable man in many ways. He was a mathematician of the front rank, whose contributions to analysis had become classical, and had played a great part in the inspiration of later research; he was a man of strong personality, fired by an intense devotion to his chosen study; and he had the persistence, the position, and the means to make his enthusiasm count.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}