{
  "nome_completo": "Gavin Brown",
  "nome_curto": "Gavin Brown",
  "ano_nascimento": "1942",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brown_Gavin/",
  "lugar_nascimento": "Lundin Links, Fife, Scotland",
  "lugar_morte": "Adelaide, Australia",
  "biografia": "Gavin Brown\n's parents were Alexandria D Duncanson and Frank B D Brown. He was born in Lundin Links, a small town on the south coast of Fife in Scotland. He attended Madras College in St Andrews where he was taught mathematics by John Macdonald. I\n[\nEFR\n]\nattended Madras College at the same time as Gavin, being a couple of years behind him, and was also taught by John Macdonald, or \"Dr Jock\" as he was affectionately known by the pupils. Gavin was Dux of Madras College in\n1959\n, his final year at the school and, after sitting the Bursary Examination of the University of St Andrews, was awarded a Harkness Scholarship\n(\nthe most prestigious of the University of St Andrews entrance scholarships\n)\n. He entered straight into the second year mathematics class and graduated in\n1963\nwith First Class Honours in Mathematics and Applied Mathematics. He was awarded the Duncan Medal, again the more prestigious award to a graduating student.\nBrown then undertook postgraduate work at the University of Newcastle-upon-Tyne in the north of England supported financially by a Carnegie Scholarship. His thesis advisor was\nFrank Bonsall\n. He was awarded his Ph.D. in\n1966\nfor his thesis\nNorm and stability properties of semi-algebras\nand in the same year he worked as a Junior Research Fellow at the University of Edinburgh. He accepted an appointment at the University of Liverpool starting at the beginning of academic year\n1966\n-\n67\nand remained at Liverpool until\n1975\n, being promoted first to Lecturer and then to Senior Lecturer. During this period he spent the academic year\n1967\n-\n68\nas a Visiting Associate Professor at the University of Illinois, in the United States, and the academic year\n1974\n-\n75\nas a Visiting Lecturer at the University of Washington. Brown's first paper\nRelatively type\n0\nsemi-algebras\n, based on the work of his doctoral thesis, was published in\n1967\n. Further papers, all arising from his doctoral studies, followed in quick succession:\nStability of wedges and semi-algebras\n(1968)\n;\nType\n0\nsemi-algebras in Banach algebras\n(1968)\n;\nContinuous functions of bounded n th variation\n(1969)\n; and\nNorm properties of a class of semi-algebras\n(1969)\n. These papers developed ideas of\nFrank Bonsall\nand, since they involve the notion of a semi-algebra, perhaps we should give a formal definition:\nA semi-algebra in a Banach algebra\nB\nB\nB\nis a subset\nA\nA\nA\nof\nB\nB\nB\nsuch that\nx\n+\ny\n,\nα\nx\nx + y, \\alpha x\nx\n+\ny\n,\nα\nx\nand\nx\n.\ny\nx.y\nx\n.\ny\nbelong to\nA\nA\nA\nwhenever\nx\nx\nx\nand\ny\ny\ny\nare in\nA\nA\nA\n, and\nα\n≥\n0\n\\alpha ≥ 0\nα\n≥\n0\nis real number.\nIn\n1975\nBrown and his family emigrated to Australia when he accepted the Chair of Pure Mathematics at the University of New South Wales. He was honoured by the\nEdinburgh Mathematical Society\nfor his outstanding mathematical work in\n1977\nwhen they awarded him their\nSir Edmund Whittaker\nMemorial Prize. Further honours followed such as election as a fellow of the\nAustralian Academy of Science\nin\n1981\n. In the following year he became the second recipient of the\nAustralian Mathematical Society\nMedal:-\n... awarded to a member of the Society under the age of\n40\nyears for distinguished research in the mathematical sciences. A significant portion of the research work should have been carried out in Australia.\nAfter being Head of the Department of Pure Mathematics and then Head of the School of Mathematics, Brown became Dean of the Faculty of Science of the University of New South Wales in\n1989\n. He spent two years in England during his time on the staff at New South Wales, namely\n1979\nwhen he was Visiting Professor at the University of York and\n1986\nwhen he was Visiting Professor at the University of Cambridge.\nIn\n1992\nBrown moved to the University of Adelaide as Deputy Vice-Chancellor\n(\nResearch\n)\nand then in January\n1994\nhe became Vice-Chancellor of the University of Adelaide. Also in\n1992\nhe became a member of the Council of the\nAustralian Academy of Science\n, and was Vice-President of the Academy during\n1993\n-\n1994\n. His biographical note\n[\n1\n]\nstates:-\nFeatures of Professor Brown's period as Vice-Chancellor included a major restructuring of University management, a strong focus on links with industry and a programmed return of the University's budget to surplus. Professor Brown was also very active in national and regional committees during his time at the University. The most notable of these was his service as Chair of the National Advisory Group on Science and Technology Awareness and Promotion.\nOn\n1\nJuly\n1996\nBrown became Vice-Chancellor and Principal of the University of Sydney, a post he held until retirement in\n2008\n. Given the tasks involved with his positions at the University of Adelaide and the University of Sydney it is remarkable that he has been able to continue his mathematical research and research collaborations at a very high level. For example during his ten-year period in Sydney, from\n1996\nto\n2005\n, Brown published around\n30\npapers. To give an idea of the topics he now works on we give the titles of the four papers he published in\n2004\n:\nThe maximal Riesz, Fejér, and Cesàro operators on real Hardy spaces; Lebesgue measure of sum sets - the basic result for coin-tossing; The maximal Fejér operator on real Hardy spaces\n; and\nApproximation on two-point homogeneous spaces\n.\nIn addition to the honours we have mentioned above, Brown has received honorary degrees from the University of St Andrews\n(1997)\nand the University of Dundee\n(2004)\n. In January\n2006\nBrown was appointed an Officer of the Order of Australia.\nGavin Brown married Diane Ranck in\n2004\n, his first wife Barbara Routh having died in\n2001\n. He has one son and one daughter by his first marriage.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}