{
  "nome_completo": "Geminus",
  "nome_curto": "Geminus",
  "ano_nascimento": "10 BC",
  "ano_morte": "60",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Geminus/",
  "lugar_nascimento": "(possibly) Rhodes, Greece",
  "lugar_morte": null,
  "biografia": "It may be surprising that\nGeminus\n's name seems to be Latin rather than Greek but as\nHeath\nwrites\n[\n3\n]\n:-\nThe occurrence of a Latin name in a centre of Greek culture need not surprise us, since Romans settled in such centres in large numbers during the last century BC. Geminus, however, in spite of his name, was thoroughly Greek.\nGeminus is believed by many historians to have worked in Rhodes. Certainly his astronomy text uses mountains on Rhodes to make specific points but, as Dicks points out in\n[\n1\n]\n, this is not proof that he worked there. For example, Geminus refers to Mt Atabyrius\n(\ntoday called Mt Attaviros\n)\nwithout giving any indication of where it is but when he refers to Mt Cyllene he is careful to indicate that it is the Peloponnesus. However, since Rhodes was at this time the centre for astronomical research, and was taken as the reference point for latitude in astronomical observations, it is quite possible that Geminus would assume his reader were familiar with the reference points of Rhodes such as Mt Atabyrius without further comment.\nGeminus was a\nStoic\nphilosopher and either a pupil, or perhaps a later follower, of\nPosidonius\n. He wrote to defend the Stoic view of the universe, and in particular to defend mathematics from attacks which had been made on it by\nSceptic\nphilosophers and by\nEpicurean\nphilosophers.\nSimplicius\ntalks of a work by Geminus in which he merely reproduces the views of\nPosidonius\nbut this is unfair on Geminus who, although holding similar views, shows his own independent point of view in many respects.\nNot all historians of science agree on the dates of Geminus that we have given. Some favour dates of\n130\nBC -\n60\nBC which are based largely on a calendar which appears in his\nIntroduction to Astronomy\ncalled the\nIsagoge\nⓉ\n(\nIntroduction\n)\nand seems to suggest a date of around\n70\nBC for the date when the text was written. Dicks in\n[\n1\n]\nseems convinced by this argument which becomes certain only if the date of the Egyptian Isis festival is known with certainty. Several Isis festivals took place in Egypt and to date Geminus correctly by this argument the proper festival must be selected.\nNeugebauer\nin\n[\n4\n]\nbelieves that the selection which give the date of\n70\nBC is incorrect and he favours a date for the Isis festival which leads to a date of\n50\nAD for Geminus's text:-\n... it is clear that Geminus had in mind the Isis festivals which were celebrated in the Egyptian month Khoiak. This places him in the first century AD. The duration of the festival and the possible insecurity of the date of the Winter\nSolstice\nprevent us from establishing a more accurate date, but ... the first half of the century\n[\nis\n]\nmore likely that the latter part. ... we thus consider a date around\n50\nAD as fairly secure for the Isagoge\nⓉ\n(\nIntroduction\n)\n...\nOf course a date of\n50\nAD for the\nIsagoge\nⓉ\n(\nIntroduction\n)\nmeans that Geminus could not have been a pupil of\nPosidonius\nwho died in\n50\nBC as their lives would not have overlapped.\nNeugebauer\ncomments in\n[\n4\n]\n:-\nA much discussed question is the dependence of Geminus on the famous stoic philosopher\nPosidonius\nof Rhodes\n(\nwho died around\n50\nBC\n)\n. The assumption of such a dependence mainly rests on close parallels between passages in the Isagoge and the writings of\nCleomedes\nwho repeatedly refers to\nPosidonius\nas his source. In contrast the Isagoge itself contains not a single reference to this philosopher nor does the frequent mention of Rhodes\n(\nor its latitude\n)\nimply that Geminus was a pupil of\nPosidonius\n.\nGeminus wrote a number of astronomy texts, including the elementary text\nIsagoge\nor\nIntroduction to Astronomy\nbased on the work of\nHipparchus\nwhich we referred to above. Geminus gave an historical account of earlier astronomical theories including those of\nCallippus\nand the Chaldeans. He made a significant comment on the stars, stating that:-\n... we must not suppose that all the stars lie on one surface, but rather that some of them are higher and some are lower.\nThe main part of the work contains little mathematical astronomy. It describes the main constellations, the variation of the length of night and day at different latitudes, the rising of the signs of the\nzodiac\n, and the length of the lunar month. The phases of the moon are explained and solar and lunar eclipses are also explained. The motion of the planets is discussed and certain geographical features are discussed as well as implications for the weather.\nThe last chapter of\nIntroduction to Astronomy\n(\nChapter\n18)\nseems rather different from the rest of the text being of a much more advanced nature. Dicks writes in\n[\n1\n]\nthat this chapter:-\n.... far more technical than the others and out of keeping with the rest of the book, may well be an unrelated fragment.\nThe recent article\n[\n5\n]\ndiscusses Chapter\n18\nin detail. The authors claim this to be an important contribution to Greek astronomy introducing the use of mean motion. Geminus represents observational data for the motion of the moon in longitude by means of an arithmetical function.\nGeminus's mathematics text\nTheory of Mathematics\nis now lost but information about it is available from a number of sources.\nProclus\nquotes extensively from it and\nEutocius\nand\nHeron\nalso give some information. In fact\nProclus\nrelies very heavily on the work of Geminus when he writes his own history of mathematics and it is fair to say that Geminus's books are the most valuable sources available to him.\nThe Theory of Mathematics\ndeals with the logical subdivisions of mathematics. Geminus considers the concepts of 'hypothesis', 'theorem', 'postulate', 'axiom', 'line', 'surface', 'figure', 'angle' etc. Not only did he examine the principles behind these ideas in depth but he also gave historical accounts of the development of the ideas.\nThe work contains an explanation of where the name 'mathematics' came from. Geminus tells us that\nPythagoras\napplied it to\n[\n3\n]\n:-\n... geometry and arithmetic, sciences which deal with pure, the eternal and the unchangeable, but was extended by later writers to cover what we call 'mixed' or applied mathematics, which, though theoretical, has to do with sensible objects e.g. astronomy and optics.\nWe should note that 'sensible' here has its older meaning of 'relating to the senses' rather than the modern meaning which is the opposite of 'stupid'.\nIn fact the work does seem to have been a comprehensive work covering the whole of mathematics, perhaps even a mathematical encyclopaedia. Geminus is critical of\nEuclid\n's axioms in this work and he offers a 'proof' of the fifth postulate.\nProclus\nquotes from Geminus\n(\nsee for example\n[\n3\n]\n)\n, saying that in the case of the\nparallel postulate\n:-\n... when the right angles are lessened,\n[\nthat\n]\nthe straight lines converge is true and necessary; but the statement that, since they converge more and more as they are produced, they will sometime meet is plausible but not necessary...\nGeminus tried the following approach giving a definition of parallel lines:-\nParallel straight lines are straight lines situated in the same plane and such that the distance between them, if they are produced without limit in both directions at the same time is everywhere the same.\nThe 'proof' which Geminus then gave of the parallel postulate is ingenious but it is false. He made an error right at the start of his argument for he assumed that the\nlocus\nof points at a fixed distance from a straight line is itself a straight line and this cannot be proved without a further postulate. It is interesting, however, that Geminus attempts to prove the parallel postulate and, although it is unlikely to be the first such attempt, at least it is the earliest one for which details have survived.\nThe helix, namely the curve cutting the generators of a right circular cylinder at a constant angle, appears in this work by Geminus.\nProclus\nsuggests, however, that the curve goes back to\nApollonius\n150\nyears before Geminus. But Geminus proves an interesting classification theorem, namely that the helix, the circle and the straight line are the only curves with the property that any part of the curve will coincide with any other part of the same length.",
  "math_areas": [
    "Calculus",
    "Logic"
  ]
}