{
  "nome_completo": "Geoffrey Ingram Taylor",
  "nome_curto": "Geoffrey Taylor",
  "ano_nascimento": "1886",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taylor_Geoffrey/",
  "lugar_nascimento": "St John's Wood, London, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Geoffrey Taylor\n's father was Edward Ingram Taylor\n(\nborn Paddington, London,\n1855)\nwho was an artist who designed and decorated the public rooms in ocean liners. He was also a painter of landscapes and did exceptional drawings of flowers. His mother, Margaret Boole\n(\nborn in Ireland about\n1859)\n, was the second daughter of\nGeorge Boole\nand\nMary Boole\n, so Geoffrey was a grandson of\nGeorge Boole\nand\nAlicia Stott\nwas his aunt. He had a younger brother Julius who was born about\n1889\n.\nGeoffrey Taylor attended school in Hampstead, and there he began to find his love of science. At the age of\n11\nhe attended a series of children's Christmas lectures on\nThe principles of the electric telegraph\nand these made a strong impression on him. He was introduced to\nWilliam Thomson\nat one of these lectures and\nLord Kelvin\ntold him he had been friendly with Geoffrey Taylor's grandfather\nGeorge Boole\n.\nIn\n1899\nTaylor went to University College School and in\n1905\nhe won a scholarship to study at Trinity College, Cambridge. There he read mathematics, attending lectures by\nA N Whitehead\n,\nWhittaker\nand\nG H Hardy\n. After taking Part I of the Mathematical Tripos he moved towards physics taking Part II of the Natural Sciences Tripos. He then won a scholarship to undertake research at Trinity College.\nOne of his first pieces of research was a theoretical study of shock waves where he extended work by\nThomson\n. This contribution won him a Smith's Prize. He also undertook experimental work, following a suggestion by J J Thomson, to test quantum theory. In\n1910\nhe was elected to a Fellowship at Trinity College. The following year he was appointed to a meteorology post, becoming Reader in Dynamical Meteorology, and his work on turbulence in the atmosphere led to his publication\nTurbulent motion in fluids\nwhich won the\nAdams\nPrize at Cambridge in\n1915\n.\nThe British luxury passenger liner the Titanic sank on\n15\nApril\n1912\non its maiden voyage from Southampton, England, to New York, in the United States. A little before midnight on\n14\nApril the Titanic, which was considered unsinkable, collided with an iceberg about\n650\nkm south of Newfoundland. The ship could float with four of its sixteen watertight compartments flooded but at least five were holed by the iceberg. As a result of the disaster, the first International Convention for Safety of Life at Sea was held in London in\n1913\n. One of its proposals was to establish an International Ice Patrol to warn ships of icebergs in the North Atlantic shipping lanes. The ship the Scotia was the first vessel sent on such a patrol in\n1913\n, and Taylor served as meteorologist on the ship. He took the opportunity to take a whole range of measurements of pressure, humidity and temperature on which he was later to base his theoretical model of turbulent mixing of the air.\nThe outbreak of World War I saw Taylor offer his services and he was sent to the Royal Aircraft Factory at Farnborough to use his scientific skills in the design and operation of aeroplanes. Here he worked on the stress on propeller shafts. This led him to think about the limiting strengths of materials and this influenced some of his later projects. Taylor did not treat this as an office job for a researcher, however, for he took a very active part learning to fly aeroplanes and make parachute jumps.\nAfter World War I Taylor returned to a lectureship at Trinity College, Cambridge. One of the topics he worked on at this stage was an application of turbulent flow to oceanography. He also worked on the problem of bodies passing through a rotating fluid. In\n1923\nTaylor was appointed to a\nRoyal Society\nresearch professorship as a Yarrow Research Professor. This enabled him to stop teaching which he had been doing for the previous four years. As\nBatchelor\nwrites in\n[\n3\n]\n:-\nHe was not a natural lecturer and not much interested in teaching...\nAt this stage Taylor made a great many fundamental steps in the study of fluids. This period is described in\n[\n3\n]\n:-\nHis investigations in the mechanics of fluids and solids covered an extraordinary wide range, and most of them exhibited the originality and insight for which he was now becoming famous.\nHe undertook research on the deformation of crystalline materials, work which led on from his World War I work at Farnborough. Among the many topics he studied was another major contribution to turbulent flow, where he introduced a new approach through a statistical study of velocity fluctuations.\nIn\n1925\nTaylor married Stephanie Ravenhill; they had no children. It was a marriage which lasted for\n42\nyears until Stephanie's death in\n1967\n.\nDuring World War II Taylor again worked on applications of his expertise to military problems such as the propagation of blast waves, studying both waves in the air and underwater explosions.\nTaylor continued his research after the end of the War, taking the opportunity to complete some more thorough investigations into problems where previously the pressure of finding solutions had prevented him from taking his study further. He retired in\n1952\nbut, still supported by the\nRoyal Society\n, he continued his work at Cambridge with little evidence that his status had in any way changed until\n1972\n. In that year he suffered a stroke from which he only partially recovered. During his last three years he suffered the frustrations of wanting to get back to scientific work although his physical condition would not allow it.\nTaylor received many honours during his life. He was elected a Fellow of the\nRoyal Society\nin\n1919\n, winning its Royal Medal in\n1933\nand its Copley Medal in\n1944\n:-\n... for his many contributions to aerodynamics, hydrodynamics, and the structure of metals, which have had a profound influence on the advance of physical science and its applications.\nAlso in\n1944\nhe was knighted and appointed to the Order of Merit in\n1969\n. He was elected to membership of academic societies in many countries including the United States, France, Italy, Sweden, The Netherlands, India, Poland, and the USSR. He received honorary degrees from more than a dozen universities throughout the world and over twenty Medals for his outstanding contributions to applied mathematics. He published over\n250\npapers in his long career on applied mathematics, mathematical physics and engineering. His contribution is summed up in\n[\n3\n]\nas follows:-\nTaylor's work is of the greatest importance to the mechanics of fluids and solids and to their application in meteorology, oceanography, aeronautics, metal physics, mechanical engineering and chemical engineering. The nature of his thinking was like that of\nStokes\n,\nKelvin\nand\nRayleigh\n, although he got more from experiments than any one of these three. He had the rare honour of seeing his scientific papers, some previously unpublished, gathered together and published in four thick volumes during his lifetime.\nNo biography of Geoffrey Taylor would be complete without describing some of his interests outside mathematics. We have already mentioned his voyage on the Scotia when he was a young man, but his love of boats went back earlier than this; it went back to his boyhood. He loved messing about in small boats as a boy and his passion continued in later life when he owned a\n19\nton cutter in which he sailed with his wife to the Shetlands, to Norway, and to the Lofoten Islands\n[\n1\n]\n:-\nTravel always appealed to him, especially if it took him to strange places unknown to tourists and \"unspoiled\" by material development. With his wife he explored Borneo in\n1929\nafter attending a Pacific Science Congress. He was a keen and perceptive botanist, and took a great pleasure in the familiar plants of his well-stocked garden in Cambridge and in what he saw elsewhere and abroad.",
  "math_areas": [
    "Applied Mathematics"
  ]
}