{
  "nome_completo": "Geoffrey Thomas Kneebone",
  "nome_curto": "Geoffrey Kneebone",
  "ano_nascimento": "1918",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kneebone/",
  "lugar_nascimento": "Brentford, Middlesex, England",
  "lugar_morte": "London, England",
  "biografia": "Geoffrey Kneebone\nstudied at the University of London where he was awarded a B.Sc. in\n1939\n. He continued to study for his Master's Degree which he was awarded in\n1941\n. He undertook research advised by\nJohn Greenlees Semple\n(\nknown to all as Jack\n)\n, the chair of Pure Mathematics at King's College, London. Although Kneebone was studying at the University of London, after the outbreak of World War II in\n1939\n, the university temporarily moved. In the early days of the War, London came under heavy bombing raids and a decision was taken to move London University Colleges to safer environments. The Mathematics Department of King's College was moved to Bristol, where Kneebone worked. These were difficult years and it was\nSemple\n's leadership that kept the department functioning and making sure it well placed to reopen in London in\n1943\n. In fact\n1943\nwas the year Kneebone was awarded his Ph.D. for his thesis\nThe foundations of mathematics: A critical examination of the foundations of the mathematical theory of probability and statistics\n. Wilfred Hodges explains that the thesis\n[\n7\n]\n:-\n... was a mathematical study, but a remark in the Preface expressed a holistic view that stayed with Kneebone through his later work on the foundations of mathematics: 'mathematics itself cannot be regarded as something self-contained, but must be treated as an integral part of the whole body of possible knowledge'. The thesis also addressed the question of how an abstract formalism can usefully be applied to the real world. Much of his later work was a meditation on this question.\nAfter the award of his thesis, in\n1943\nKneebone was appointed as an assistant lecturer at Westfield College, part of the University of London. In\n1946\n, remaining in the University of London, he moved from Westfield College to Bedford College where he became a lecturer in\n1947\n. When Kneebone joined the College, it was a women's college and had been since its founding in\n1849\n. However, in the mid\n1960\ns the College became fully coeducational. Kneebone remained at Bedford College for the rest of his career, where he was promoted to Reader in the Foundations of Mathematics in\n1964\nand Reader in Mathematics from\n1976\nuntil he retired in\n1983\n. Two years after he retired, Bedford College merged with Royal Holloway College and they became Royal Holloway and Bedford New College, a name which is still the official name today. Dorothy Foster was a student at Bedford College during the early\n1950\ns, graduating with a B.Sc. in Mathematics in\n1956\n. She described the Mathematics department at Bedford College as being:-\n... quite small in the\n1950\ns and staff-student relations were informal and friendly. All our lecturers had a heavy teaching load, not uncommon at that time, so there was no provision for weekly tutorials. Nevertheless, Dr Kneebone, as well as giving excellent lectures, always managed to discuss out weekly written work with us individually. In our first year both he and Mrs Kneebone invited us to their home. On revisiting him on the occasion of the sesquicentenary celebrations of Bedford College in\n1999\nhe was as friendly and welcoming as ever.\nKneebone's main research interests were in the philosophy of mathematics and he wrote papers such as\nPhilosophy and Mathematics\n(1947)\n,\nInduction and Probability\n(1949)\n,\nAbstract Logic and Concrete Thought\n(1955)\n, and\nThe Philosophical Basis of Mathematical Rigour\n(1957)\n. References to all of these papers are given below. Let us give a flavour of Kneebone's thoughts by quoting from the first of these papers. In\nPhilosophy and Mathematics\n(1947)\n, Kneebone writes:-\nThe different schools\n[\nof mathematical philosophy\n]\nare most easily distinguished by their answers to the question \"What is mathematical knowledge, and how is it obtained?\" and this may be regarded as the fundamental question of mathematical philosophy. But as soon as we have formulated it explicitly we see that it does not lie within the province of mathematics at all; it is a philosophical question, and is logically prior to mathematics. To answer it properly we should have to consider first the wider question \"What is knowledge?\" and then we could base our answer to the narrower question upon the answer already given to this. The inability of mathematics to determine its own nature should not be looked upon as a defect, for it is common to all isolated branches of knowledge. Philosophy is a unity, and no part of it can be fully understood except in relation to the whole. The mathematician is fairly safe in ignoring philosophy as long as he is content merely to develop the formal consequences of definite assumptions, whether these are drawn from experience or arbitrarily postulated, but as soon as he becomes interested in wider problems it is necessary for him to change his point of view and to become a philosopher in the more restricted sense.\nHe states that, in his opinion:-\n... the nature of mathematics - and one which we think many contemporary mathematicians would accept - is that mathematics is concerned with structure and each mathematical theory is a formal scheme which displays a particular kind of structure. Any particular kind of structure is best investigated by means of an axiomatic model, but in choosing our axioms we are always guided by a more intuitive knowledge of the kinds of structure that are interesting, significant, and of widespread occurrence.\nPerhaps Kneebone is best known today as the author of several highly successful textbooks. These are:\n(\nwith\nJohn Greenlees Semple\n)\nAlgebraic Projective Geometry\n(1952)\n;\n(\nwith\nJohn Greenlees Semple\n)\nAlgebraic Curves\n(1959)\n;\nMathematical Logic and the Foundations of Mathematics\n(1963)\n; and\n(\nwith Brian Rotman\n)\nThe Theory of Sets and Transfinite Numbers\n(1966)\n.\nWe have given extracts of some reviews of these books at\nTHIS LINK\n.\nYou can also read an extract from the Preface to\nAlgebraic Projective Geometry\n(1952)\nat\nTHIS LINK\n.\nAnther book to which Kneebone contributed is\nExploring University Mathematics\n. This book is based on lectures given at Bedford College in\n1965\nand has as its first chapter\nSets and functions\nby Kneebone. Peter Cameron writes:-\nIn\n1974\n, I was appointed to my first permanent teaching job, a lectureship at Bedford College. Jessie Hardiman and Geoffrey Kneebone were among my colleagues there, and the department still put on lectures for school pupils and teachers; I spoke at one of these occasions, on\nRamsey\ntheory. There are several references in the book to the importance of rigorous reasoning. Kneebone describes the problems that arose from thinking of a function as something with a smooth curve satisfying the Intermediate Value Theorem, and gives two definitions of the natural numbers, from\nPeano\n's axioms and in terms of set theory.\nWilfred Hodges writes in\n[\n7\n]\n:-\nKneebone's greatest gifts were as a teacher and an expositor. ... He gave encouragement and support to the work of other researchers on topics related to the history of foundations. These included the studies of Walter van Stigt on\nL E J Brouwer\nand of Steve Russ on\nBernard Bolzano\n, as well as the theses of Albert Leisenring and Tim Flannagan on the\nHilbert\nepsilon operator\n(\nthe last two as Ph.D. students of Kneebone\n)\n.\nFollowing Kneebone's death in\n2003\n, an obituary appeared in Alumni News\n(\nNo\n22\n, Winter\n2003)\n. Seeing this obituary, his former student\nDorothy Foster\nwrote to Royal Holloway:-\n... some of my fellow Bedford students have been discussing the possibility of setting up a memorial fund in Dr Kneebone's name to fund a Mathematics prize of some sort at Royal Holloway.\nIn\n2009\n, the Geoffrey Kneebone Scholarship was set up to be awarded to a postgraduate student at Bedford College. The Scholarship was initiated by two of Kneebone's former students,\nDorothy Foster\nand Glenys Ingram.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}