{
  "nome_completo": "Arthur Geoffrey Walker",
  "nome_curto": "Geoffrey Walker",
  "ano_nascimento": "1909",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Walker_Arthur/",
  "lugar_nascimento": "Watford, Hertfordshire, England",
  "lugar_morte": "Chichester, Sussex,England",
  "biografia": "Geoffrey Walker\n's father was Arthur John Walker\n(\nborn in Watford, Hertfordshire in\n1879)\nwho was a coach builder. His mother was Eleanor Joanna Gosling\n(\nborn in Watford, Hertfordshire in\n1879\n; died\n1946)\n. Geoffrey Walker had an older brother Henry Brian Walker who was born about\n1907\nand died in Hendon, Middlesex in\n1968\n.\nGeoffrey Walker attended Watford Grammar School and from there, having won a mathematics scholarship in his final year, he entered Balliol College, Oxford. He received a First Class degree from Oxford in\n1931\n, having specialised in\ndifferential geometry\nfor which he won a special distinction. He remained at Merton College, supported by a Harmsworth scholarship during\n1932\n-\n34\nand he also held an Oxford University senior mathematics scholarship in\n1933\n. In his final years at Oxford he was greatly influenced by\nMilne\n. Leaving Oxford, he then moved to Edinburgh to undertake research.\nAfter submitting his Ph.D. thesis to Edinburgh, Walker was examined by\nEddington\n. After the award of his doctorate he was appointed as a lecturer in mathematics at Imperial College in London. This was a post for the academic year\n1935\n-\n36\nand after completing this temporary appointment he received his first permanent post as a lecturer in mathematics at Liverpool University. He was appointed in\n1936\nand was to remain in Liverpool until\n1947\nwhen he was offered the chair of mathematics at the University of Sheffield.\nIn\n1952\n, after five years in Sheffield, Walker was to return to Liverpool University, this time as Professor of Pure Mathematics. He held this post until he retired in\n1974\n. However, the pressures of administration in this post restricted his time for research:-\nHe was a very able administrator and had the happy gift of \"reading down the diagonal\", as he termed it. This meant that when presented with a massive document he could extract the essential features in a very short time. His colleagues had great respect for his integrity, and as a result he found himself on numerous committees which diminished his time and energy for research.\nWalker worked on geometry, in particular differential geometry, relativity, and\ncosmology\n. His papers include ones on relativistic mechanics, completely symmetric spaces, completely harmonic spaces and Riemannian\nmanifolds\n. He wrote an article\nNote on locally symmetric vector fields in a Riemannian space\n, published in\n1976\n, in memory of\nEvan Tom Davies\n. This is concerned with the restrictions imposed on a Riemannian\nn\nn\nn\n-space by the existence of a locally symmetric vector field and it continues work begun by Walker in a paper on possible orientation of galaxies published early in his career in\n1940\n.\nIn\n1962\nWalker published\nHarmonic Spaces\n, a joint work with H S Ruse and T J Willmore. In\n1975\nhe published\nIntroduction to geometrical cosmology\na survey which arose out of a course that Walker gave at the University of Arizona. The lectures consider the red-shift, the number of galaxies, and the distance between galaxies. Walker writes in the introduction:-\nThis is an account of a course of\n12\nlectures given at the University of Arizona on the geometry of cosmology. It is entirely concerned with what might be called the classical theory, leading up to and discussing the standard model with the Robertson-Walker metric; it contains no new results though some of the methods may not have appeared in print.\nThe Robertson-Walker metric which Walker mentions in this quotation arose from joint work which he did with his colleague H P Robertson in the late\n1930\ns. Their work put\nFriedmann\n's theories of an expanding universe on a sound mathematical foundation and still forms the basis for models of the universe in modern cosmology.\nWalker was elected both a fellow of the\nRoyal Society of Edinburgh\nand a fellow of the\nRoyal Society of London\n. The\nRoyal Society of Edinburgh\nhonoured Walker by awarding him their Keith Medal in\n1950\n. The election to the\nRoyal Society of London\ntook place in\n1955\nand he served on the Council of the Society in\n1962\n-\n63\n. He was also a strong supporter of the\nLondon Mathematical Society\nand was awarded the Junior Berwick Prize of that Society in\n1947\n. He served the Society by being the\n50\nth\nPresident in\n1963\n-\n65\n.\nIn\n[\n1\n]\nsome of Walker's interests outside mathematics are recorded:-\nA popular head of department, he will be remembered as one of the most powerful of British differential geometers, but he was also outstanding as a table-tennis player, and some proficiency at the game was sometimes said to be a necessary qualification for employment as a lecturer in Liverpool.\nUnknown to most of his colleagues, he and his wife Phyllis were accomplished ballroom dancers, and he once surprised a friend by saying that he had won more prizes for dancing than he had for mathematics.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}