{
  "nome_completo": "Geoffrey Thomas Bennett",
  "nome_curto": "Geoffrey Bennett",
  "ano_nascimento": "1868",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bennett/",
  "lugar_nascimento": "Clerkenwell, Middlesex, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Geoffrey Bennett\n's father was Thomas Bennett\n(\nborn about\n1840)\n. He was a goldbeater, described in\n1881\nas a Gold Leaf Manufacturer Employing\n10\nMen,\n7\nBoys, and\n22\nWomen. His mother was Selina Bennett born about\n1837\n. Geoffrey had a brother Norman J Bennett born in Clerkenwell, Middlesex about\n1871\nand a sister Sylvia Selina Bennett born in Highgate, Middlesex in about\n1874\n.\nBennett  entered University College School, which had been founded in Gower Street in\n1830\nas part of University College, London, in\n1883\n. This was an outstanding school which by the time Bennett studied there was within University College itself. He was particularly fortunate to have an outstanding mathematics teacher, namely\nRobert Tucker\n. Even at this stage in his education the 'finish of the style' of everything he wrote was noted. After three years at University College School, he then spent the year\n1886\n-\n87\nattending classes at University College. By December\n1886\nhe had been awarded a scholarship to study mathematics at St John's College, Cambridge. He matriculated at the College in October\n1887\nand studied the mathematical tripos.\nBennett had the distinction of being Senior\nWrangler\nin Mathematical Tripos of\n1890\nbut he did not come top in the examinations;\nPhilippa Fawcett\nwas the best student. At this time only the men were ranked in the Tripos Examination but women who took the examination were made aware of their place. Bennett was the first Senior Wrangler to have a woman placed above him. Bennett was awarded a First Class in the examination of\n1891\nand became the first Smith's Prizeman in the following year. Elected a fellow of St John's College in\n1892\n, he was appointed as a mathematical lecturer at Emmanuel College in\n1893\nand was then elected a Junior Fellow of that College. Bennett's first paper, entitled\nOn the Residues of Powers of Numbers for any Composite Modulus, Real or Complex\n, was published in\n1892\nin the Philosophical Transactions of the Royal Society. In the first part of this\n150\npage paper he examines, in modern terminology, the group of units of the ring of integers modulo\nm\nm\nm\n. Here is part of Bennett's abstract:-\nIn the simple cases, when the modulus is a real number which is an odd prime, a power of an odd prime, or double the power of an odd prime, we know that there exist primitive roots of the modulus: that is, that there are numbers whose successive powers have for their rests the complete set of numbers less than, and prime to, the modulus. A primitive root may be said to generate by its successive powers the complete set of rests. It is also known that in general, when the modulus is any composite number, though primitive roots do not exist, there may be laid down a set of numbers, which will here be called generators, the products of powers of which give the complete set of rests prime to the modulus.\nThe principal object of Part I is to investigate the relations which must subsist among any such set of generators; to determine the most general form that they can take; to show how to form any such set of generators, and, conversely, to furnish tests for the efficiency, as generators, of any given set of numbers. Other results which are obtained as instrumental in effecting these objects, such as the determination of the number of numbers that belong to any exponent, may also possess independent interest.\nThe object of Part II is to make, for complex numbers, an investigation which shall be as nearly as possible parallel to that of Part I for real numbers. ...\nPerhaps his most famous paper, however, is the two page paper\nA new four-piece skew mechanism\nwhich he published in the journal\nEngineering\nin\n1903\n. In it Bennett considers a skew hinged four-bar mechanism in three dimensional space. The angle between the hinges in a bar is called the twist. This mechanism is movable only if the opposite sides are equal. Then it follows as a consequence that the sines of the twists are proportional to the lengths of the bars. This remarkable mechanism Bennett called a skew isogram. It uses the fewest rods possible to build a useful mechanism.  In a subsequent\n22\npage paper\nThe skew isogram mechanism\nwhich he published in\n1914\n, Bennett presented many interesting properties of the skew isogram, some without proofs. These proofs were not written down until Bernard Groeneveld's thesis\nGeometrical considerations on space kinematics in connection with Bennett's mechanism\npresented to the Technische Hogeschool te Delft in\n1954\n. In\n1922\nBennett published\nThe three-bar sextic curve\n. In this paper he obtained the characteristics of the curve\n(\nnow called the couple curve\n)\nas the locus of the\nLaguerre\nimages of the conjugate points on the Hessian of an elliptic cubic. He therefore treated a curve defined in the area of kinematics by the methods of algebraic geometry.\nBennett was elected a Senior Fellow of Emmanuel College in\n1899\n. He served the College as Steward, and was therefore responsible for catering, from\n1898\nto\n1905\n. He served on the Council of the\nLondon Mathematical Society\nfrom\n1908\nto\n1911\n, and then served as Secretary of the Society during\n1915\n-\n16\n. In the\n1911\ncensus, Bennett was unmarried. He was described as a lecturer in mathematics living at\n156\nKing Henry's Road, Hampstead. His parents Thomas\n(\naged\n71)\nand Selina\n(\naged\n74)\nwere still living with him.\nHe was elected a fellow of the\nRoyal Society of London\nin\n1914\n. Of course this was the year when World War I broke out and Bennett undertook war work, first with Horace Darwin on anti-aircraft work, and from\n1916\nin the anti-aircraft section of the Ministry of Munitions where he undertook research into ballistics at the Royal Naval Gunnery School on Whale Island, Portsmouth, with\nRalph Fowler\n,\nHerbert Richmond\n, and others. His significant contributions included the invention of an altitude finger for anti-aircraft guns. From\n1917\nhe worked on spinning shells at the Gyro-compass Department of the Admiralty, and later in\n1921\npublished\nThe rotation of the non-spinning gyrostat\nwhich was related to this part of his war work. On\n22\nJune\n1918\n, along with George R C Campbell, he applied for a patent for a \"mariners' compass\":-\nThe needle system of liquid compasses is considerably damped, so as virtually to be aperiodic, by the attachment thereto of radial filaments formed of glass or wire. These filaments are either straight or curved, and provided with vanes or with other filaments. A system for an aircraft compass comprises a skeleton hemispherical dome constructed of ribs carrying the pivot at the summit and connected by a ring with carriers each holding three magnets. Eight damping-filaments are attached to the dome ...\nAfter the war ended in\n1918\n, he returned to Emmanuel College where he resumed his duties.\nAnother aspect of Bennett's mathematical work was as an historian.\nHenry Baker\nwrites\n[\n2\n]\n:-\nHe was a close friend of James Bennet Peace, at that time teaching in the Engineering Laboratory of the university\n(\nafterwards Secretary to the Syndics of the University Press\n)\n; it is natural to suppose that their association fostered Bennett's instinct for the geometry of mechanism; his historical paper on Sarrut's mechanism gives interesting glimpses of his search in the records of the Engineering School.\nOf course his interest here was closely related to his own work on mechanisms. He published his historical findings in The parallel motion of Sarrut and some allied mechanisms in\n1905\n.\nOutside mathematics Bennett had many interests.\nHenry Baker\ndescribes these in\n[\n2\n]\n:-\nThere is record too of his great interest in the musical and the athletic activities of the undergraduates; he was frequently found as onlooker at sports and matches, and his interest extended to boxing. Personally he was a keen bicyclist, until he began to suffer from rheumatism, keeping two bicycles, one for the summer and one for the winter, and instructing the agent-maker in a rule for the gearing. The university bicycle club had an annual road race of fifty miles, in which Bennett rode on three occasions, being successively third, second and first. He also won a medal for riding\n100\nmiles in one day. At that time he was the fastest thing on the road; and it is recorded that on the days the great races were run at Newcastle, his return, with news of the winners, was eagerly awaited by watchers on the road. Sir G S W Epps, formerly a pupil of Bennett's, while gratefully recording his indebtedness to Bennett's teaching, tells of a machine devised by Bennett in which he lay flat along the frame\n(\nwith a pad for his chest\n)\n, using a mirror to see ahead. Also he was a good pianist, fond of improvising, and expressed much admiration for Dr E W Naylor, the organist of the college. He was President of the College Musical Society for five years\n(1904\n-\n1909)\n; at one time he gave lectures on music for the University Musical Society; he was frequently to be seen at the university concerts.\nA few more details help to complete a picture of Bennett. He owned several boomerangs with which he carried out experiments, liked giving parties for children, was interested in spiders\n(\nparticularly their webs\n)\n, enjoyed draughts and chess, even writing a paper on the eight-queens problem in\n1910\n. Note also an article entitled\nWari\nby Bennett in Robert Sutherland Rattray's book\nReligion & Art in Ashanti\npublished in\n1927\nin which he gives the rules and some strategies of the African game of owari. It is, writes Bennett,:-\n... played by natives of the Gold Coast ... a game for two players using as apparatus\n48\npebbles and a board hollowed out into two parallel rows of six cups.\nHenry Baker\nperhaps expresses some criticism that all these interests of Bennett may have stopped him writing more mathematical papers\n[\n2\n]\n:-\nIt is impossible not to feel ... admiration for a life evidently so full of interests; it involved a wide circle of friends, who respected him for his kindly open nature, his precision and thoroughness in what he undertook, and his obvious capacity and power. His mathematical colleagues may wish that his remarkable gifts had found greater expression in published papers ...\nPerhaps it is worth noting, as a partial defence of Bennett, that a Google Book Search for \"G T Bennett\" \"Emmanuel College\" yields around\n200\nhits. Many of these are authors giving their thanks to Bennett with words such as: \"\nG T Bennett, of Emmanuel College, Cambridge, sent the author the following simple construction in August,\n1902\n...\", \"\nI desire to acknowledge the assistance I have received from Mr G T Bennett, MA, of Emmanuel College, Cambridge, with whom I have discussed\n...\", \"\n... is described in the following diagram given to me by Mr G T Bennett of Emmanuel College\n...\", \"\nWhen later I came to determine the vibration-frequencies of the tones of the variable fork, Mr G T Bennett, of Emmanuel College, Cambridge, kindly gave me\n...\", and the comment by\nD'Arcy Thompson\nin\nOn Growth and Form\n\"\nLet me add another to these kindly names, that of Dr G T Bennett, of Emmanuel College, Cambridge; he has never wearied of collaboration with me\n...\".\nFinally let us note that when Robert Macmillan went to Emmanuel College in\n1941\n, he came to know Bennett for a short while\n(\nBennett died while Macmillan was studying at the College\n)\n. Bennett was popularly known then as \"Beaver\" Bennett, because he had a formidable white beard in his old age.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory"
  ]
}