{
  "nome_completo": "George James Lidstone",
  "nome_curto": "George Lidstone",
  "ano_nascimento": "1870",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lidstone/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "George Lidstone\n's father was William Thompson Lidstone\n(\nborn at West Avington, Devon about\n1830)\nwho was a bookkeeper. His mother was Eliza Munnings\n(\nborn about\n1832\nin Hertford, Hertfordshire\n)\n. He had four elder siblings: Alfred\n(\nborn about\n1856)\n, Julia\n(\nborn about\n1858)\n, Clara\n(\nborn about\n1861)\nand Frank\n(\nborn about\n1863)\n.\nGeorge Lidstone attended Birkbeck School, Clapton. He then trained to be an actuary and, in\n1891\n, he became a Fellow of the Institute of Actuaries. He was appointed as Assistant Actuary at the Alliance Assurance Company in\n1893\n. He was promoted regularly in the Company becoming Joint Actuary in\n1902\n, then later Actuary before being appointed Actuary and Secretary of the Equitable Life Assurance Society in\n1905\n.\nIn\n1913\nLidstone was appointed as Manager and Actuary of the Scottish Widows' Fund in Edinburgh. In\n1925\nhe was awarded an honorary LL.D. by the University of Edinburgh and the university detailed the contribution which had led them to award Lidstone the degree:-\n23\nJuly\n1925\nGeorge James Lidstone, F.I.A.\nMr Lidstone has keen invited here today as a leading representative of the great insurance corporations which have their home in Edinburgh, and the official head of the profession under whose skilful guidance this vast business is conducted. He is well known throughout the whole insurance world as a prime authority upon all questions of actuarial theory and practice. Thanks mainly to his educational zeal and the goodwill of the Faculty over which he presides, the training of young actuaries in the fundamentals of their science, which was formerly carried on entirely outside the University, has now been brought inside the pale, and lectureships have been established in the subject held by practising actuaries. The Senatus desires to mark its appreciation of this friendly spirit of co-operation In- including Mr Lidstone's name in the roll of honorary graduates.\nHis health caused some concern and in\n1929\n, on the advice of his doctors, he resigned as Manager and, soon after, was made a Director. Lidstone's sight had deteriorated over a number of years and it caused him to give up his Directorships of the Scottish Widows' Fund and of the Royal Bank of Scotland.\nLidstone had married Florence Mary Gay and she died in\n1942\n. The notice of her death appeared in the newspapers:-\nLidstone. At Hermiston House, Midlothian on\n16\nDecember\n1942\n, Florence Mary Lidstone\n(\nformerly Gay\n)\n, the beloved and devoted wife of George James Lidstone.\nBy now Lidstone was totally blind but he struggled on bravely facing the difficulties alone. He celebrated his\n80\nth\nbirthday on\n11\nDecember\n1950\n:-\nGEORGE JAMES LIDSTONE LL.D., F.I.A., F.F.A., F.S.A., F.R.S.E.\nOn Monday,\n11\nDecember\n1950\n, George James Lidstone celebrated his\n80\nth birthday. All who have had the privilege of visiting Mr Lidstone bear witness to the courage with which he has borne his affliction. In spite of the overwhelming handicap to one with his exceptionally active mind, he continues to take the closest interest in all the activities of the Institute and of the profession, and to apply himself to problems of today. His interest in even the most recent extensions of our professional activities is a continued source of encouragement to younger generations of actuaries. To be privileged to meet him is not only a personal pleasure but a stimulating experience\n.\nIn view of his outstanding services to actuarial science, the Institute decided to mark the occasion of his\n80\nth\nbirthday by presenting to him an Illuminated Address, a reproduction of which faces this page. Mr William Penman, a Past-President of the Institute, presented the Address in person to Mr Lidstone at his home in Edinburgh\n.\nMr Lidstone has since written the letter reprinted below\n.\nF.A.A.M.\nMY DEAR PRESIDENT\n,\nOn the\n11\nth of this month, which was my\n80\nth birthday, our good friend, Penman, very kindly called on me and delivered personally your letter of the\n9\nth December and the very beautifully engrossed Address to myself, bearing the seal of the Institute and the signatures of yourself as President and Usherwood as Honorary Secretary\n.\nI find it quite impossible to express at all adequately my thanks and gratitude for the very exceptional honour paid to me. The Address and your letter have given me the greatest pleasure, and they will be amongst the most treasured possessions of myself for the rest of my life and my family after me. When I attempt to recall such work as I have been able to do for the profession during my long connection with the Institute, I cannot feel that I really deserve all the many kind and flattering words of the Address and your letter, but for this very reason they are all the more gratifying, since I know that they spring in complete sincerity from the kindness and goodwill of the many good friends that I have been privileged to make. To all of them I send my warmest greetings and my most heartfelt thanks. Their kindness has deeply moved me, and I shall ever be more grateful than I can express\n.\nYours always sincerely\n,\nG J LIDSTONE\n23\nWester Coates Avenue\nEdinburgh\n28\nDecember\n1950\nLidstone was elected a fellow of the Faculty of Actuaries on arriving in Edinburgh and he served on its council and as its president from\n1924\nto\n1926\n. He was a member of the\nEdinburgh Mathematical Society\n, joining in January\n1918\n. He read the paper\nNote on the Summation of a Trigonometrical Series\nto the Society at its meeting on Friday\n10\nMarch\n1922\n.\nHe was elected to the\nRoyal Society of Edinburgh\non\n4\nMarch\n1918\n, his proposers being\nSir Edmund T Whittaker\n, George Macritchie Low, John Horne,\nCargill Gilston Knott\n.\nAn obituary, written by\nR Ll Gwilt\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1953\n, pages\n28\n-\n30\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nLet us give a couple of examples of papers Lidstone wrote. In\n1938\nhe published\nNotes on interpolation Part\n1\nthen published\nNotes on interpolation Part\n2\nin\n1941\n. W E Milne, reviewing the second of these, writes:-\nThis paper is composed of a series of commentaries, illustrated frequently with numerical examples, on the subject of interpolation. In particular the author considers the so-called \"throw-back device,\" namely the adjustment of lower order differences\n(\nas, for example, in the tables published by the\nBritish Association for the Advancement of Science\n)\nso as to compensate in part for the omission of higher order differences. He further considers at some length Aitken's method of inverse interpolation by quadratic crossmeans.\nIn\n1942\nLidstone published\nNotes on the Poisson frequency distribution\n.\nFeller\nwrites:-\nThe author considers the Poisson distribution ... as an approximation to the binomial. As he points out, it is known ... that the corresponding Charlier type B series ... will give still better approximations. The author shows by numerical examples that in many cases this series gives a better fit than Pearson's type III curves.",
  "math_areas": [
    "Number Theory"
  ]
}