{
  "nome_completo": "Georg Joachim von Lauchen Rheticus",
  "nome_curto": "Georg Joachim Rheticus",
  "ano_nascimento": "1514",
  "ano_morte": "1574",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rheticus/",
  "lugar_nascimento": "Feldkirch, Austria",
  "lugar_morte": "Kassa, Hungary (now Kosice)",
  "biografia": "Georg Joachim von Lauchen Rheticus\n's father, Georg Iserin, was the town doctor in Feldkirch and also a government official. Rheticus was, therefore, born Georg Joachim Iserin. His mother, Thomasina de Porris, was Italian. He was taught by his father for the first\n14\nyears of his life but, in\n1528\n, his father was tried on a charge of sorcery, convicted and beheaded. One of the legal requirements of such an execution was that his name could no longer be used, so Rheticus's mother reverted to her maiden name and Rheticus's became Georg Joachim de Porris. 'De porris' means 'of the leeks' in Italian and, since Rheticus did not consider himself Italian he translated it into German 'von Lauchen' and called himself Georg Joachim von Lauchen. He later took the additional name of Rheticus after the Roman province of Rhaetia in which he had been born.\nAchilles Gasser took over the medical practice in Feldkirch after Rheticus's father was executed. He helped Rheticus continue his studies and was a strong support to him. After his father's execution, Rheticus studied at the Latin school in Feldkirch, then went to Zürich where he studied at the Frauenmuensterschule from\n1528\nto\n1531\n. In\n1533\nhe entered the University of Wittenberg receiving his M.A. from that university three years later on\n27\nApril\n1536\n.\nPhilipp Melanchthon, Martin Luther's \"right hand man\", was a theologian, and educator who reorganised the whole educational system of Germany, founding and reforming several of its universities. Melanchthon played a major role in getting Rheticus an appointment to teach mathematics and astronomy at the University of Wittenberg in\n1536\n. This appointment, which involved teaching arithmetic and geometry, gave Rheticus a salary of\n100\ngulden.\nTwo years later Melanchthon again used his influence to arrange leave for Rheticus to study with some of the leading astronomers of the day, but his main reason was to visit\nCopernicus\n. Leaving Wittenberg in October\n1538\nhe travelled to Nuremberg and there visited Johann Schöner who was publishing books, including those that\nRegiomontanus\nhad intended to publish\n60\nyears earlier. In Nuremberg Rheticus also visited the printer Petreius. He then visited\nPeter Apianus\nin Ingolstadt, next Joachim Camerarius in Tübingen and then he fitted in a visit to his home town of Feldkirch to visit Achilles Gasser whom he presented with a copy of\nSacrobosco\n.\nIn May\n1539\nRheticus arrived at Frauenburg in Ermland where he spent about two years with\nCopernicus\n. Rheticus wrote\n(\n[\n8\n]\n,\n[\n14\n]\n)\n:-\nI heard of the fame of Master\nNicolaus Copernicus\nin the northern lands, and although the University of Wittenberg had made me a Public Professor in those arts, nonetheless, I did not think that I should be content until I had learned something more through the instruction of that man. And I also say that I regret neither the financial expenses nor the long journey nor the remaining hardships. Yet, it seems to me that there came a great reward for these troubles, namely. that I, a rather daring young man compelled this venerable man to share his ideas sooner in this discipline with the whole world.\nIn September\n1539\nRheticus went to Danzig, visiting the mayor of Danzig, who gave Rheticus some financial assistance to help publish the\nNarratio Prima\nor, to give it its full title\nFirst report to Johann Schöner on the Books of the Revolutions of the learned gentleman and distinguished mathematician, the Reverend Doctor Nicolaus Copernicus of Toruń, Canon of Warmia, by a certain youth devoted to mathematics\n. Swerdlow writes in\n[\n13\n]\n:-\nCopernicus could not have asked for a more erudite, elegant, and enthusiastic introduction of his new astronomy to the world of good letters; indeed to this day the Narratio Prima remains the best introduction to\nCopernicus\n's work. Of course Rheticus sent a copy to Schöner and also to Petreius, who found it splendid.\nIn August\n1541\nRheticus presented a copy of his work on a map of Prussia to Duke Albert of Prussia and the following day he sent him an instrument he had made to determine the length of the day. Rheticus knew that Duke Albert had tried unsuccessfully to find out how to compute the time of sunrise. Having put himself in good favour with the Duke he asked for the favour he wanted: would the Duke permit the publication of\nCopernicus\n's\nDe Revolutionibus\n. Duke Albert replied quickly giving permission for the publication and, at the same time requesting that Rheticus retain his chair. In October\n1541\nRheticus returned to the University of Wittenberg and there he was elected dean of the Faculty of Arts.\nIn early\n1541\nRheticus published the trigonometrical sections of\nCopernicus\n's\nDe Revolutionibus\nadding tables of his own giving tables of sines and cosines\n(\nalthough he did not call them by these names\n)\n. This was the first published table of cosines and, see\n[\n1\n]\n, Rheticus's:-\n... place in the history of mathematics is due precisely to his computation of innovative and monumental trigonometrical tables.\nJoachim Camerarius, who was head of the University of Tübingen, working with Melanchthon, arranged for Rheticus to be offered a post at the University of Leipzig. In\n1542\nRheticus was appointed professor of higher mathematics at Leipzig. Initially he was offered the same salary as he had received from the University of Wittenberg but he soon negotiated a\n40\n% rise. He left Wittenberg in May\n1542\n, travelling to Nuremberg where he supervised the printing of\nDe Revolutionibus\nbut before the work was finished he had to go to Leipzig to begin teaching in October\n1542\n.\nRheticus remained at Leipzig until\n1545\nwhen he again arranged leave to allow him to study abroad. After initially returning to his home town of Feldkirch he spent some time in Italy, where he visited\nCardan\nin Milan. Rheticus continued on his travels until, at Lindau, a city in Bavaria on an island in Lake Constance his health broke down and he had severe mental problems during the first half of\n1547\n. His health recovered sufficiently to allow him to teach mathematics at Constance for three months in late\n1547\nthen he studied medicine in Zürich before he returned to Leipzig in February\n1548\n. With Melanchthon's influence Rheticus was made a member of the theological faculty at Leipzig.\nA man of many talents, Rheticus published a calendar and ephemeris of\n1550\nand also an ephemeris and calendar of\n1551\n. However a scandal forced him to leave Leipzig in April\n1551\n; he was accused of having a homosexual affair with one of his students. He had to flee and this he did rapidly, spending some time at Chemnitz and a further period in Prague. He was tried in his absence and his friends, such as Melanchthon, stopped supporting him: they probably had little option if they were to retain their own positions. Although he was not present to defend himself, Rheticus was sentenced to\n101\nyears in exile.\nIn\n1551\n-\n52\nhe studied medicine at the University of Prague but his interest in medicine only ever seemed to be used to treat patients and never to undertake scholarly research so he never seems to have produced innovations in medicine in the way he did in mathematics. In\n1553\nhe was offered an appointment as professor of mathematics at Vienna. He went to Vienna but never took up the appointment. He moved to Kraków in\n1554\nwhere he remained for\n20\nyears as a practising doctor.\nHe certainly did not give up his mathematical interest while in Kraków, for he worked on his famous trigonometric tables as well as making instruments, carrying out astronomical observations and alchemy experiments. In fact he did rather well for himself at this stage employing six research assistants and he was funded by Emperor Maximilian II for his work on trigonometric tables which went a long way to providing rather good salaries for his assistants. Rheticus's important work on trigonometry\nOpus Palatinum de triangulis\nuses all six trigonometric functions. He gave tables of all these six functions in this major work which was completed and published in\n1596\nby Valentine Otho many years after Rheticus's death.\nOtho had studied at Wittenberg and then set out to visit Rheticus in a similar way to that in which Rheticus himself had visited\nCopernicus\n. Otho writes\n(\nsee\n[\n14\n]\n:-\nWe had hardly exchanged a few words on this and that when, on learning the cause of my visit, he burst forth with these words: \"You come to see me at the same age as I was myself when I visited Copernicus. If I had not visited him, none of his works would have seen the light.\"\nOther works by Rheticus include ones on map making\n(\nhe published a map of Prussia\n)\n, and works on navigational instruments,\nChorographia tewsch\n. He designed many instruments such as sea compasses and the instrument to show the length of the day throughout the year which he gave to Duke Albert as we mentioned above.\nGiven the dramatic and eventful life that Rheticus led it is interesting to think about his personality. Westman writes in\n[\n14\n]\n:-\nIf ... one were to point to the single most prominent trait in Rheticus's personality, based upon the tone of his writings, the testimonies of his contemporaries, and his own life activities, one would have to seize upon his great energy and intensity - whether in the vitality of his work, in his widespread travels, or in his evident pursuit to lay to rest something inside himself.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}