{
  "nome_completo": "George G Lorentz",
  "nome_curto": "George G Lorentz",
  "ano_nascimento": "1910",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lorentz_George/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Chico, California, USA",
  "biografia": "George G Lorentz\n's father, Rudolf Fedorovich Lorentz, was a railway engineer involved in both building and administration. His mother, Milena Nikolaevna Chegodaev, came from the large Chegodaev family of princes and George claimed he was a descendant of Genghis Khan through Princess Chegodaev. Rudolf Fedorovich was ethnically German while Milena Nikolaevna was ethnically Russian. The family spoke Russian at home so Russian was George's first language. We should say a few words about Lorentz's name. Following the Russian tradition his name was originally Georg Rudolfovich Lorentz. We shall explain later why he became known as George G Lorentz. He wrote in his autobiography of his childhood\n[\n6\n]\n:-\nMy father was very successful in his profession. However, in\n1906\n, he refused to participate in the suppression of a strike on his railway near St Petersburg. Since then, he was not permitted to work on railways owned by the state. This forced him to move to the Caucasus, where most railways belonged to private companies. In\n1913\n-\n1918\nwe lived in Armavir\n[\nnear the Black Sea\n]\nin North Caucasus. This middle-sized town changed hands\n(\nfrom White to Red and back\n)\nthree times during the civil war that followed the revolution. Later, in\n1919\n-\n1922\n, we lived on a farm near Sochi, until the times became more stable. Next we moved to Tbilissi, the capital of Georgia.\nIt was in Tbilissi that Lorentz attended secondary school. He entered a Russian school in\n1923\n, moving to a German one a year later. In\n1926\n, at the age of sixteen, Lorentz entered the Tbilissi Institute of Technology where he studied mathematics. His work was of such a high standard that his teachers advised him to transfer to Leningrad State University. St Petersburg, the city of his birth, had been renamed Petrograd in\n1914\nbut had been renamed Leningrad four years before Lorentz entered the university there in\n1928\n. At this time Leningrad was an excellent mathematical centre and Lorentz thrived there. However, the political situation began to impact the academic one. Independent thinkers were being persecuted and the President of the\nLeningrad Mathematical Society\n, a man with a reputation for courage and independent thought, was in such danger that the\nLeningrad Mathematical Society\nwas disbanded in\n1930\nin a successful attempt to save the life of the President and the lives of other mathematicians. Lorentz was awarded his diploma in\n1931\nbut, with the government insisting that research be applied in nature, he could not register to study for a candidate's degree\n(\nequivalent to a Ph.D.\n)\n. He was employed as a teaching assistant at the University and, after a while, he also lectured at the Herzen Pedagogical Institute.\nWhile carrying out a heavy teaching load, he also undertook research without the help of a thesis advisor. He published the results of his research during these years in several papers:\nÜber lineare Summierungsverfahren\n(1932)\n,\nFunktionale und Operationen in den Räumen der Zahlenfolgen\n(1935)\n,\nSur la convergence forte des polynômes de Stieltjes-Landau\n(1936)\nand\nZur Theorie der Polynome von S Bernstein\n(1937)\n. These last two mentioned papers formed the main part of his thesis and, in\n1936\n, he was appointed as a\ndocent\nat the university. He began writing a book on functional analysis which was never completed\n[\n5\n]\n:-\nIn\n1937\n, my father was arrested in Tbilissi and sentenced to eight years based on an obviously false accusation. He died in a concentration camp the next year. This had a profound influence on me. Although I had prepared some\n50\n% of my projected textbook, and although Fichtenholz had arranged for me a tuition-free year at the University, I could not complete it, and until\n1942\nworked on mathematics only moderately.\nIn September\n1939\n, Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad. However, in June\n1941\nthe course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow. As the German armies rapidly advanced towards Leningrad, many people were evacuated from the city. By this time Lorentz was married to Tanny Belikov and they became trapped in Leningrad\n[\n6\n]\n:-\nSoon there remained only a narrow corridor connecting Leningrad to Lake Ladoga, the eastern shore of the lake remaining in Soviet hands. The war was to bring the population of Leningrad horrible sufferings. During the severe winter of\n1941\n-\n42\n, there was artillery fire into the city, but no air raids. For private use, there was no electric power, no water\n(\nthe water piping was frozen\n)\n, no public transportation. By some reports, one million people died of starvation. Since November, I belonged to the paramilitary group for the air defence of Leningrad. Almost all my friends were either evacuated to the East or drafted into the army. After several attempts to be evacuated with my wife Tanny, some of them illegal, we succeeded in joining a group of faculty and students of the Herzen Pedagogical Institute. At the beginning of April\n1942\nwe crossed the still frozen Lake Ladoga in trucks and joined a train. After a month's journey we arrived at the Kislovodsk spa in the Northern Caucasus.\nWhile in Kislovodsk he found\nAntoni Zygmund\n's\nTrigonometrical series\nin the library of a small nearby college - the book proved significant in his mathematical development. However, in August\n1942\nKislovodsk was taken by the Germans and the library burned down so he could not return\nZygmund\n's book. Lorentz and his wife were registered as ethnic Germans and sent to refugee camps in Poland, first in Kalush and then in Toruń. In\n1943\nhe sent two papers with his latest results to\nKonrad Knopp\n, who held the chair of mathematics at Tübingen University, hoping that they might be published in\nMathematische Zeitschrift\n.\nKnopp\narranged for the Lorentz family\n(\nby this time they had a newborn son, Rudolph\n)\nto come to Tübingen and there he became an assistant to E Kamke, who had been dismissed from his teaching position at the University of Tübingen, but was allowed to write books. Kamke was writing a book on differential equations. Lorentz submitted his thesis\nEine Fragen der Limitierungs theorie\nto Tübingen and was awarded a doctorate. By this time World War II had ended with the defeat of Germany and the French controlled Tübingen. Lorentz submitted an\nhabilitation\nthesis to Tübingen and was about to collaborate with\nKnopp\non questions of summability when\n[\n5\n]\n:-\n... the French authorities classified me as an undesirable foreigner, ... and the university was not allowed to offer me a fellowship. In Spring,\n1946\n, leaving my family in Tübingen, I went to the American zone of occupation. In Heidelberg, an American officer supervising the refugees gave me an identification document stating that I was stateless. I lived with this document until my USA naturalisation\n13\nyears later. Because of the habilitation at Tübingen, I could teach as a\ndocent\n, for three semesters at the University of Frankfurt. I often travelled to Tübingen, and in\n1948\nwas appointed an 'Honorarprofessor'\n[\nDocent with a permanent salary\n]\nthere.\nWe mentioned at the beginning of this biography that Lorentz's name was originally Georg Rudolfovich Lorentz. In\n1946\nhe began to use the name Georg Gunter Lorentz in an attempt to hide his Russian origins. 'Gunter' was made up and he only used it for a short while, afterwards using the name Georg G Lorentz. Although mathematically his time in Germany was very fruitful, nevertheless the family planned to emigrate which they did in\n1949\n. Writing of this period in Germany, he explains\n[\n6\n]\n:-\n.. we lived uncomfortably and in poor conditions, with food scarcity. But mathematically it was a happy time for me. In Tübingen, during the war, I repeated my lectures on Banach space theory for the faculty\n(\nProfessors\nKnopp\n,\nHellmuth Kneser\n, Kamke, Müller\n)\nand some students with great success. I wrote some\n20\npapers: joint papers with Kamke and\nKnopp\n, papers related to differential equations, papers on summability, on\nFourier series\n, and papers where rearrangements play a role.\nOffered a Lady Davis Foundation fellowship at the University of Toronto, Canada, he began work there as an Instructor in Mathematics in July\n1949\n. Despite giving Lorentz low academic status, having already successfully supervised the doctorates of two students at Tübingen, he was immediately asked to supervise four doctoral students in Toronto - two of these being G M Petersen and\nP L Butzer\n. While in Toronto he published his first book,\nBernstein polynomials\n.\nRogosinski\nwrites in\n[\n13\n]\n:-\nThe author ... is a well-known expert in this field, and his careful up-to-date and easily readable account of problems and progress, the first in book form, should be welcome to a large class of advanced students of mathematical analysis.\nG M Petersen wrote in\n[\n12\n]\nabout Lorentz's lecturing in Toronto:-\nThose of us who were at the University of Toronto in\n1949\nremember the perfection of his lectures, both graduate and undergraduate. They were delivered with a command of English which made it difficult to believe he had not had much previous experience lecturing in this language. The organization of the material was very good and the content presented a titillating mixture of well-known theorems and personal research. Sometimes the material would be so new that it could not be found elsewhere.\nLorentz was Petersen's doctoral thesis advisor\n[\n12\n]\n:-\nAs a supervisor of graduate work he displayed an unending zeal and interest in his students' work. At one time, I remember, there were five of us coming to him separately each week for an hour. We were always greeted with a smile and treated to an intelligent and pertinent discussion of our work. When we bogged down, he took a hand himself; when we succeeded, he praised us. He has always given of his knowledge freely and been very stimulating to students, even those in lines different from his own.\nBy\n1953\nLorentz, already an assistant professor at Toronto, was offered an associate professorship but chose not to accept that, rather preferring to accept a full professorship in the United States, at Wayne State University in Detroit. In\n1958\nToronto tried to attract him back with the offer of a full professorship, but Syracuse University, New York, made him a similar offer at the same time and he chose to remain in the United States. He spent ten years, from\n1958\nto\n1968\n, at Syracuse University but then he made his final move to the University of Texas. He retired in\n1980\nbut continued as an active researcher for another fifteen years.\nThe books\n[\n1\n]\nand\n[\n2\n]\ncontain a selection of Lorentz's papers and we will get a fair overview of his contributions by looking at the areas they cover. The papers are divided into four parts:\n1\n. Summability and number theory\n(21\narticles on summability,\n3\non number theory\n)\n;\n2\n. Interpolation\n(16\narticles on Birkhoff interpolation in one variable,\n6\non Birkhoff interpolation in several variables\n)\n;\n3\n. Real and\nfunctional analysis\n(18\narticles on rearrangement of functions and Lorentz spaces\n)\n; and\n4\n. Approximation theory\n(38\narticles on Bernstein polynomials, Korovkin theory, Bernstein and\nMarkov\ninequalities,\nKolmogorov\n's notion of entropy, width and the superposition of functions, best monotone approximation and incomplete polynomials\n)\n.\nWe looked briefly above at Lorentz's first book, namely\nBernstein polynomials\n(1953)\n. His next book,\nApproximation of functions\n, was published in\n1966\n. Albert Wilansky writes\n[\n15\n]\n:-\nThis book is strongly recommended for every college library because of the first eight chapters. Here the author goes out of his way to keep the discussion elementary\n(\nnot easy!\n)\n. Chapters nine, ten, and eleven concern entropy and\nKolmogorov\n's solution of\nHilbert\n's thirteenth problem. Fascinating, but highly special, and not self-contained for non-specialists ... The book abounds with amusing and interesting insights. There are problems and notes which extend the results in the text and give their history. A special feature is the coverage of the Russian literature of this field.\nTwenty years later, a second edition was published with only minor changes from the first edition\n[\n14\n]\n:-\nThe author's stated aim in writing this book was to provide an accessible but reasonably complete treatment of several topics in Approximation Theory. The book is aimed at the graduate or advanced undergraduate level, and includes a considerable number of problems\n(\nsome of which are rather more challenging than others\n)\n. As everyone familiar with the book knows, the author has been very successful at meeting his goals, and the book is indeed a very readable introduction to the subject and makes an excellent textbook.\nThis second edition was hardly altered since Lorentz was working on a\n15\n-year writing project with the idea of presenting a unified treatment of some of the many developments that have occurred in the subject since his\n1966\ntextbook. In\n1993\n, in collaboration with Ronald DeVore, he published\nConstructive approximation\n. V Totik writes:-\nThis is a first-rate and very up-to-date monograph on approximation theory. The authors are top researchers in the field who had good taste and judgement in collecting the most important results of the constructive aspects of the theory. ... This monograph may well be the best book available on the subject, so it can be recommended to graduate students, mathematicians, physicists and engineers who have an interest in constructive approximation. The authors not only collect the most important results on the subject, but in many instances they also provide new proofs as well. The organization and presentation are extremely clear, and the book is suitable for graduate and even higher level undergraduate courses.\nThree years later, Lorentz published a companion volume to this text, in collaboration with Manfred von Golitschek and Yuly Makovoz, concentrating mainly on univariate approximation of real functions. While working on this volume he spent much time with Golitschek at the University of Würzburg.\nIn\n1986\n, not only did a second edition of\nApproximation of functions\nappear, but a second edition of Bernstein polynomials was also published. Lorentz writes in the Preface:-\nAfter the trigonometric integrals, Bernstein polynomials are the most important and interesting concrete operators on a space of continuous functions. Since the appearance of the first edition of this book, the interest in this subject has continued.\nLorentz received many honours for his outstanding mathematical contributions. He was awarded honorary doctorates from the University of Tübingen\n(1977)\nand the University of Würzburg\n(1996)\n.\nFinally let us record his interests outside mathematics\n[\n12\n]\n:-\nSo many outside interests attract him personally that we can only indicate them - travel, mountains, fine books, photography, languages and not least of all, chess. I suspect that conversation could be, too, one of his main interests.\nHe played chess competitively but also loved to watch live chess matches. He was in Reykjavik, Iceland, in\n1972\nto watch Bobby Fisher beat Boris Spassky. Lorentz's hobby which we have not yet mentioned was stamp collecting. In\n1996\nhe moved from Texas to California\n[\n3\n]\n:-\nGeorge's last years were spent in Chico, California, where his wife Tanny died at the age of\n91\n. At the time of his death, George was survived by all of his children\n[\nRudolph, Mary, Irene, Olga, and Katherine\n]\n, eight grandchildren, and two great-grandchildren.\nLet us end with this tribute from\n[\n8\n]\n:-\nHe served for many years on the Editorial Board of\n[\nthe Journal of Approximation Theory\n]\nand served the wider mathematical community through his rich and deep contributions to approximation theory. He was one of the founders of the contemporary theory of approximation. His books have been profoundly influential ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Number Theory"
  ]
}