{
  "nome_completo": "Georgios Ioannou Remoundos",
  "nome_curto": "Georgios Remoundos",
  "ano_nascimento": "1878",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Remoundos/",
  "lugar_nascimento": "Athens, Greece",
  "lugar_morte": "the Steamboat Frindon, Mediterranean Sea",
  "biografia": "Georgios Remoundos\nwas born into a poor family, His father, originally from Andros but working in Athens at the time that his son was born, made ever effort to see that Georgios received a high quality education. Let us note at this point that this biography is based closely on\n[\n2\n]\n, Melissa Iacovidou's translation of various Greek documents relating to Georgios Remoundos.\nGeorgios attended the elementary school Plaka in Athens from\n1884\nto\n1888\n. He then entered secondary school, the Varvakio Lyceum, the only school in Greece which specialised in teaching sciences at this time. His favourite subject at school was mathematics and he decided that he wanted to study that subject at university. In September\n1895\nhe enrolled in the Mathematical Department of the School of Philosophy of the University of Athens. The professor of mathematics at the University of Athens at this time was Kyparissos Stefanos\n(1857\n-\n1917)\n, who had studied for his Ph.D. at the University of Paris. As well as serving as professor of mathematics, Stefanos was rector of the university\n1894\n-\n1895\n. He taught three students who became leading mathematicians. One was Remoundos, the subject of this biography, and the other two were\nPanagiotis Zervos\nand\nNicholas I Hatzidakis\n. After an outstanding university career, on the\n10\nJune\n1900\nRemoundos passed the degree examination with the highest grade. In September\n1900\nhe was appointed as a teacher at the Varvakio Lyceum.\nIn January\n1901\nhe took part in the state competition for a scholarship for further studies. He succeeded in this competition and was sent to France as a government scholar to study for a doctorate at the Sorbonne. Arriving in Paris, Remoundos was also allowed to attend courses at the École Normale Supérieure. He attended lectures at the Faculty of Sciences as well as at the Sorbonne and the École. He was also fortunate to have been able to attend lectures from some of the leading mathematicians, among them\nHenri Poincaré\n,\nÉmile Picard\n,\nPaul Painlevé\nand\nPaul Appell\n.\nThe originality and depth of the research carried out by Remoundos made an excellent impression on his professors. They were so impressed that they allowed him to submit his doctoral thesis directly without undergoing the Licence examinations. He once told his family the following story about the finals examinations he sat at the École Normale Supérieure. \"The examination committee,\" he said, \"gave us four difficult problems to solve. While it was enough to solve only one of them, however all my fellow students, of various nationalities but I was the only Greek, were unable to find any solutions. But I gave, in just a short time, correct answers to all the problems, and I gave two different solutions for one of them.\" The examination committee were very impressed by Remoundos's solutions and asked him to develop his solutions further, because one of his two different solutions was unknown to the committee members. It turned out to be the discovery of a new method of solution which was much better than the existing one. They then asked him to apply for an appointment as a professor in their faculty and to apply for French nationality. But he rejected their suggestions giving the following reply: \"My poor and small, but glorious, country has given me the funds to study abroad so that I might give my knowledge to the Greek youth. I will not be disloyal towards my country, and I will return to it.\"\nIn June\n1904\nhe returned to Greece and in September of that year he was re-appointed as a teacher at Varvakio Lyceum, where he had taught for a year before moving to France for higher education. At the end of\n1904\nhe became a lecturer at the University of Athens. His inaugural lecture was entitled \"Sur quelques points de la théorie des nombres\" published in Athens on\n16\nJanuary\n1905\n. In January\n1906\n, he was invited to France to defend his doctoral dissertation at the University of Paris. His doctoral dissertation, entitled \"Sur les zéros d'une classe de fonctions transcendantes,\" was examined by a committee composed of three leading mathematicians of the day, namely\nÉmile Picard\n,\nHenri Poincaré\nand\nPaul Painlevé\n.\nHowever, because he was in financial difficulty and could not afford the expense of going to Paris, his invitation had been accompanied by the necessary amount of money to cover his expenses. It had been donated by the professors of the University of Paris, a sign of the great appreciation and love towards the young Greek mathematician Georgios Remoundos. Thus, on\n20\nJanuary\n1906\n, he was proclaimed Docteur des sciences mathématiques de l'Université de Paris. A few days later, on\n6\nFebruary,\nPaul Appell\n, the Dean of Science, wrote an enthusiastic letter to the Prime Minister of Greece, Georgios Theotokis, giving high praise for Remoundos's work.\nOn\n25\nJune\n1906\nRemoundos married Antigoni Karabetsos; they had four children, John, Dionysios, Athanasios and Maria. His career progressed and he was promoted to Professor of Mathematics at the Varvakio Lykeion on\n15\nDecember\n1907\n.\nIn\n1908\nhe was elected by the School of Physical and Mathematical Sciences of the University of Athens and was appointed by the Ministry of Religious Affairs and National Education as a member of the Committee of Judges of Physical and Mathematical Books for Secondary Education. Subsequently, Remoundos was also appointed by the Ministry of Education as a member of the committee of the revision of secondary education text books. Following instructions from the Ministry of Education, he represented the University of Athens and the Greek nation at three meetings of the International Congress of Mathematicians. The first of these, in April\n1908\n, was the International Congress of Mathematicians held in Rome where he delivered the paper\nSur les zèros des intégrales d'une classe d'équations différentielles\nⓉ\n(\nOn the zeros of the integrals of a class of differential equations\n)\nin the Analysis Section. The second was in August\n1912\nwhen the International Congress of Mathematicians was held in Cambridge, England. He also lectured at this meeting, presenting\nSur les singularités des équations différentielles\nⓉ\n(\nOn the singularities of differential equations\n)\n. Because of World War I the Congress did not meet in\n1916\nso the third Congress he attended was in\n1920\nin Strasbourg when the meeting was held in September. At this meeting he gave the lecture\nSur le module et les zéros des fonctions analytiques\nⓉ\n(\nOn the module and the zeros of the analytic functions\n)\n.\nOn\n24\nJanuary\n1912\nhe was appointed as an ordinary professor of Advanced Mathematical Analysis at the University of Athens, where he taught until his death. In addition, he was also appointed ordinary professor of Advanced Mathematical Analysis at the National Technical University of Athens on\n21\nOctober\n1916\n. He continued to hold this professorship and teach at the National Technical University of Athens until his death. He was also one of the first ordinary professors at the Higher School of Economics and Commercial Sciences. During the academic years\n1916\n-\n1917\nand\n1922\n-\n1923\nhe served as Dean of the School of Physics and Mathematics at the University of Athens.\nLet us look briefly at the mathematical areas on which Remoundos worked which largely focused on Mathematical Analysis and especially on its two fundamental branches, namely: Theory of Functions and Theory of Differential Equations. He explains in\nSur les zéros d'une classe de fonctions transcendantes\nⓉ\n(\nOn the zeros of a class of transcendent yunctions\n)\n(1904)\nhow he began his research contributions:-\nPaul Painlevé\n, in his Course at the École Normale Supérieure on Abelian Functions, reported as likely a proposition, which is an extension to the non-uniform functions of the famous theorem of M\nÉmile Picard\n, on the values of a uniform function in the neighbourhood of an isolated essential singular point. I have confirmed, in certain interesting cases, the idea of the eminent geometer by a note presented to the\nAcademy of Sciences\non\n20\nApril\n1903\n. I hope that soon I will establish this extension in the most general case, by means of abelian integrals and following a course analogous to that which allowed M\nPicard\nto establish his theorem. I propose to develop here the quoted Note by indicating at the same time how these considerations are related to a more general theorem, concerning the zeros of a very extended class of functions having an infinity of branches.\nThe paper submitted on\n20\nApril\n1903\nwas\nUne nouvelle généralisation du théorème de M Picard sur les fonctions entières\nⓉ\n(\nA new generalization of Picard's theorem on entire functions\n)\n. For a list of publications by Remoundos written in French, see\nTHIS LINK\n.\nAfter Remoundos was awarded his doctorate by the University of Paris in\n1906\n,\nÉmile Borel\nasked him to write a book entitled:\nSur les fonctions algébroïdes\nⓉ\n(\nOn algebraic functions\n)\n, which would be part of the famous\nCollection de monographies sur la théorie des fonctions sous la direction de M Émile Borel\nⓉ\n(\nCollection of monographs on the theory of functions under the direction of Émile Borel\n)\n. Additionally, Henri Villat, who was then the editor-in-chief of\nMémorial des sciences mathématiques\n, assigned to Remoundos the writing of three parts of that collection. The first of these books was published shortly before the death of the author, and is entitled:\nExtension aux fonctions algébroïdes multiformes du théorème de M Picard et de ses généralizations\nⓉ\n(\nExtension to the multifarious algebraic functions of  Picard's theorem and its generalizations\n)\nand mainly includes summaries of the work of the author, which refers to algebraic functions and related issues. The second part was in print when the author died and was titled:\nSur les fonctions et les séries de fonctions algébroïdes\nⓉ\n(\nOn functions and series of functions algebroids,\n)\n, and the third one which had been given the title\nSéries de fonctions et de familles normales\nⓉ\n(\nSeries of normal functions and families\n)\nwas never written due to the premature death of Remoundos.\nWe should not give the impression that all of Remoundos's work was on analysis for he also published original and deep papers on Theoretical Engineering, Algebra and Number Theory.\nInternational recognition came swiftly. For example\nOtto Blumenthal\n, mentioned Remoundos's work, and emphasised its importance, during a lecture to the\nGerman Mathematical Society\nin\n1907\n. His lecture reported on the most important and fundamental discoveries up to\n1907\non the theory of integrals of transcendental functions. The book\nPrincipes de la théorie des fonctions entières d'ordre infini\nⓉ\n(\nPrinciples of the theory of integer functions of infinite order\n)\n(1910)\n, published in the collection of monographs under direction of\nÉmile Borel\n, mentions two of Remoundos's papers, describing one as a work of genius.\nRemoundos played an important role in the\nGreek Mathematical Society\nand in the\nAcademy of Athens\n. He was one of a group of about five men who conceived the idea of establishing of the\nGreek Mathematical Society\nin\n1918\n. During the first years of the establishment of the Society, he was deputy chairman of the Board of Directors. From\n1926\nto\n1928\nhe was chairman of the Board of Directors. He was one of the first appointed full members of the\nAcademy of Athens\n, which was founded in\n1926\n, by Minister of Education Dimitrios Aiginitis. During the academic year\n1927\n-\n1928\nhe served as Secretary of the Committee of the\nAcademy of Athens\n.\nRemoundos quickly gained a reputation as an excellent teacher. Before teaching anything to his students, he worked it out methodically and tried to find the most appropriate way of explaining it. Not only before beginning his lecture did he deal with the best way to better explain the material, but also during the lesson itself he made a considerable effort for its successful delivery and that is why many times he came out of the classroom sweating profusely. He considered his teaching work, according to his own words, \"as a sacred duty of utmost importance.\" Cyparissos Stephanos, who taught Remoundos said that, \"Remoundos is so clear and simple in his teaching, and so effective that one can say that he opens the head of the student, puts the mathematics in, then locks the head and takes the key, and leaves reassured!\"\nRemoundos was not in favour of teaching highly theoretical material, but preferred giving a concise presentation of the material and having the student understand it through applying it in exercises. He followed this principle both in his various courses and in the writing of his notes for his students. Thus, through his writing, or his lectures and, above all, by his use of examples, he taught his students not only mathematics but also the way to teach it.\nHowever, as the main purpose of the University is to cultivate science and to develop a research spirit among the students, Remoundos and his colleague\nNicholas I Hatzidakis\n(1872\n-\n1942)\nwere pioneers in creating special tutorials in the University, in which they taught - for the few students wishing to become research mathematicians - special branches of mathematics and the latest achievements of that science. Thus, the material and the spirit of presentation of the leading universities were brought to Greece as well. This activity resulted in the presentation of original works by Greek researchers who also received doctorates from the University of Athens. The initiative taken at this time was continued by the subsequent professors of the Mathematics Department.\nRemoundos not only made major contributions to mathematics but he also had another important national role. In\n1923\na National Committee for Intellectual Cooperation with the League of Nations was established in Greece, with Remoundos as its president. The first conference of representatives of the National Committees of Intellectual Cooperation with the League of Nations took place in Paris in December\n1923\n, in which Remoundos took part as a representative of the Greek National Commission. Greece was among the first countries to establish these Committees with this International Commission only set up by the League of Nations Council in September\n1922\n.\nThe first conference of these National Commissions, held in Paris, set up the structure for their operation. Remoundos submitted a lengthy memo to the conference which assisted the International Commission to define its objectives. He worked with great zeal in this field mainly for reasons of national prestige and his positive contribution was recognised by the League of Nations. The second conference of these Commissions took place in Warsaw in\n1926\n, in which Remoundos, as the representative of Greece, again played a leading role. In July\n1927\n, in recognition of the services he had offered to this International Commission, he was appointed by the Chair and authorised by the Annual General Meeting, as the correspondent in Greece. This was a great honour both for him and for Greece, evident from the fact that only the representatives of four other countries had such appointments; these were: Austria, Czechoslovakia, Romania, and China. With this appointment, Remoundos was entitled to attend all Annual General Meetings of the Commission, which took place in Geneva. However, his sudden death prevented him from attending even one meeting.\nRemoundos suffered poor health caused, in particular, by diabetes mellitus and hypertension. When returning from the National Commissions conference in Warsaw in\n1926\nhe travelled by train and a small grain of coal dust entered one of his eyes. Because of his other health problems, this caused him to lose the sight of that eye. Returning from a meeting which took place in Paris, he died on the steamboat 'Frindon' on the\n27\nApril\n1928\n. His death was reported by the Rector of the University of Athens with the following telegram: \"On the ship 'Frindon', Georgios Remoundos, professor of the University, died suddenly. His family has been notified.\" When the 'Frindon' reached Greece, his body was received in Piraeus by a delegation from the University and by his family. His body was taken in procession to in the Grand Hall of the National and Kapodistrian University, where the funeral took place.\nFinally let us look at Remoundos's interests other than those mentioned above, and say few word about his character. He was a member of the Board of Directors of the Hellenic Association of League of Nations, and one of the most active ones. He also contributed greatly to the union of the Greek-Serbian Association. He loved nature, so he founded, along with his other friends who were nature lovers, the Nature Loving Society \"Sun - Air - Water\". He was very fond of bathing in the sea and was regular visitor to the \"Baths of Men\" in Tzitzifies, a beautiful suburb of Athens with many country villas, where his country house was located.\nHe was a tireless hiker, walking long distances without a trace of fatigue. In his naturalistic excursions he took with him his sons John, Dionysios and Athanasios. His daughter Maria was born later. He regularly hiked from Athens to Elefsina, from Paleo Faliro to Koropi, and from Kifissia to Dhekelia. With the members of \"Sun - Air - Water\", he made many trips to Parnitha, Penteli, and Hymettos. He loved nature and the countryside during all weather conditions; in the cold, in the sunshine, and during storms. He found the northern wind charming and the sea fascinating. He often worked by himself at the seaside or worked on his scientific work outside, in the cold.\nRemoundos was a good and kind man. His colleagues told of his immense kindness, which made him very likeable to the people with whom he socialised. In his meetings he was very polite and careful in his words, so as not to offend his interlocutor. If he disagreed with the opinion of his interlocutor, he would not answer, but listen to him silently, not immediately showing his objection, but he always did the right and fair thing, without creating arguments.\nOnce at a school excursion he was asked by a student if he ever got angry, and he replied in his characteristically wise way: \"but do I have any time left, my child, to be angry?\" He had the simplicity of a wise men and was totally unpretentious. Though he knew the heights of his mathematical genius, he did not show signs of pride or selfishness because of it, because he possessed the invaluable gift of simplicity and childhood purity. Remoundos was summarised by those who knew him as a brilliant scientist, an excellent teacher, an outstanding family man, and a man of unlimited kindness. Throughout his life, they said, he was a model of man to be imitated.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Number Theory"
  ]
}