{
  "nome_completo": "Georges de Rham",
  "nome_curto": "Georges de Rham",
  "ano_nascimento": "1903",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Rham/",
  "lugar_nascimento": "Roche, Canton Vaud, Switzerland",
  "lugar_morte": "Lausanne, Switzerland",
  "biografia": "Georges de Rham\n's parents were Léon de Rham\n(1863\n-\n1945)\nand Marie Louise Du Pasquier\n(1870\n-\n1958)\n. Léon de Rham was born at Orges, Vaud, Switzerland on\n26\nJuly\n1863\ninto a family originally from Giez, a small town at the foot of the Jura in the canton of Vaud. He married Marie on\n18\nApril\n1893\nat Neuchâtel, Switzerland. Marie had been born on\n23\nApril\n1870\nat Neuchâtel. The family moved to Roche in\n1896\nwhere Léon de Rham was an engineer in a large cement factory. Léon and Marie de Rham had six children, all born at Roche: Jacqueline de Rham\n(\nborn\n1896)\n, Marcel de Rham\n(\nborn\n1897)\n, Gilbert de Rham\n(\nborn\n1899)\n, Etienne de Rham\n(\nborn\n1901)\n, Georges de Rham\n(\nthe subject of this biography, born\n1903)\nand Maurice de Rham\n(\nborn\n1906)\n. This large family lived in a beautiful house in a rural setting. Georges said\n(\nsee\n[\n1\n]\n,\n[\n7\n]\nor\n[\n8\n]\n)\n:-\nI was lucky to be born in the country and there spend my first sixteen years.\nGeorges attended primary school in Roche but attended the secondary school Collège d'Aigle from\n1914\nto\n1919\n. Aigle being about\n7\nkm from his home, he had to travel there every day by train. Now the years that he attended this school are almost exactly the years of World War I and, because of the war, there was a much reduced train service. To get to school there was only one option, namely the train that left at\n6\na.m. Georges said\n(\nsee\n[\n1\n]\n,\n[\n7\n]\nor\n[\n8\n]\n)\n:-\nI did not like school very much and was not a brilliant student. My passion was drawing and painting, watercolours, my dream was to become a painter. Yet I remember one of the many mathematics teachers who made me understand the concept of algebra, which consists of calculating with an unknown x, and the large resulting simplification for solving arithmetic problems. But this teacher did not stay long. Another came, who no doubt loved mathematics, but apparently he liked even more the \"Aigle \" - the Aigle wine has indeed a good reputation.\nThere was a flu epidemic in\n1918\nand de Rham thought that he was fortunate to catch flu\n[\n1\n]\n:-\nDuring my last year at college, I was a victim of the\n1918\nflu, and the doctors ordered that, for my recovery, I had to miss school for several months. I think it was lucky, not only because I could indulge my passion for watercolour, but mostly because then I had to work alone, to catch up on what was done during my absence at school, and then I discovered that working only with the help of a book and sometimes the notes of a friend, you learn a lot better and in a much more profitable way than going to school.\nOn\n8\nSeptember\n1918\n, de Rham, together with his father and his brothers, ascended the Diablerets massif on a trip from Aigle through the Pillon pass to Anzeinde. His love of the mountains lasted throughout his life. See\nTHIS LINK\n.\nIn\n1919\nthe de Rham family moved to Lausanne and Georges had to study at a new school. He attended the Gymnase classique in Lausanne from\n1919\nuntil\n1921\n[\n11\n]\n:-\nIt is interesting to observe that the family eventually moved into a set of apartments of the well-known Château de Beaulieu, in central Lausanne, which remained Georges de Rham's permanent address until the end of his life; thus '\n7\n, avenue des Bergières, Lausanne' became a familiar address to all his many mathematical friends all over the world, many of whom stayed at this address when they came to Lausanne\n(\nas evidenced by several letters\n)\n.\nThe Gymnase classique in Lausanne specialised in Greek and Latin and taught little in the way of mathematics. What basic mathematics was studied at the school did not fill him with any enthusiasm and de Rham's interests turned more towards philosophy and literature. He spoke about his time at the Gymnase classique when he was awarded the Prix de la Ville from Lausanne in May\n1979\n(\nsee\n[\n7\n]\n)\n:-\nAt the\nGymnasium\n, Maurice Millioud proposed that I make a comparative study between the 'Traité des passions de Descartes' and the 'Psychologie des sentiments de Ribot'. Benjamin Valloton asked me to give a talk on 'La Légende des siècles'\nⓉ\n(\nThe Legend of centuries\n)\nby Victor Hugo. This work captivated me. And the lessons on Greek by Jean Franel were exciting.\nIn August\n1920\n, in the summer break between his two years at the Gymnase classique in Lausanne, de Rham ascended the Grand Combin, one of the highest peaks in the Alps, on a trip from Valsorey to Panossière.\nHaving graduated from the Gymnasium, despite his newly discovered interest in philosophy and literature, de Rham entered the University of Lausanne in\n1921\nwith the intention of studying chemistry, physics and biology. At this stage he didn't consider studying mathematics, mainly because the way the subject had been taught led him to believe that there was nothing new to be discovered. He began to study mathematics in an attempt to understand questions that arose in the physics he was studying. After five semesters he gave up biology and, in the spring of\n1924\n, turned to mathematics. He said\n[\n7\n]\n:-\nI launched myself with passion and I've never regretted it.\nWhile at university, he continued his mountaineering in the summer vacations making ascents of the greatest difficulty. In the autumn of\n1925\nhe obtained his Licence ès Sciences. The two mathematicians who had influenced him most profoundly were Gustave Dumas\n(1872\n-\n1955)\n, the professor of differential and integral calculus and higher analysis, and Dimitri Mirimanoff\n(1861\n-\n1945)\n. Dumas encouraged de Rham to read the works of\nHenri Poincaré\nwhile Mirimanoff advised him to read books by\nÉmile Borel\n,\nRené Baire\n,\nHenri Lebesgue\nand\nJoseph Serret\n's\nCours d'algèbre supérieure\nⓉ\n(\nCourse of higher algebra\n)\n[\n16\n]\n:-\n... de Rham considered moral straightness, altruism and respect as the very reasons of Dumas' success in teaching.\nIn\n1925\nde Rham was appointed as an assistant to Gustave Dumas. He also taught at the local\nCollège classique\nin the summer of\n1926\n. Encouraged by Dumas to undertake research in topology, he spent two periods, each of\n7\nmonths, in Paris between\n1926\nand\n1928\n. The first of these visits was in November\n1926\n. He did this without any financial support, relying only on his savings and living as cheaply as possible. He attended courses at the Sorbonne, enjoying those by\nÉlie Cartan\n,\nErnest Vessiot\n,\nGaston Julia\n,\nArnaud Denjoy\n,\nÉmile Picard\nand others. He also attended courses at the Collège de France, being particularly impressed by those of\nJacques Hadamard\nand\nHenri Lebesgue\n. It was\nLebesgue\nwho provided encouragement, advice and unfailing support throughout de Rham's work towards his doctorate. While in Paris, de Rham read all the topology books he could find and, importantly for the work he went on to do, he read\nJames Alexander\n's paper\nNote on two three dimensional manifolds with the same group\n. After his second visit to Paris, he returned to Lausanne in the autumn of\n1928\nand again taught at the\nCollège\nand the\nGymnase\n. His first paper,\nSur la dualité en Analysis situs\nⓉ\n(\nOn duality in 'Analysis situs'\n)\n, appeared in\n1928\nin the\nComptes Rendus\n. Another important step in the progress of his research was during this period when he read\nÉlie Cartan\n's paper\nSur les nombres de Betti des espaces de groupes clos.\nOn reading the paper he became very excited realising how he could solve many of the problems he was considering. He continued to correspond with\nLebesgue\nand published further notes in\nComptes Rendus\n. In April\n1930\nhis thesis was complete and he sent a copy of it to\nLebesgue\nwho helped him to publish it in\nLiouville\n's journal, the\nJournal de mathématiques pures et appliquées\n. He spent the winter term of\n1930\n-\n31\nat the University of Göttingen where he met, among others,\nPavel Aleksandrov\n,\nRichard Courant\n,\nCharles Ehresmann\n,\nGustav Herglotz\n,\nAndrey Kolmogorov\n,\nEdmund Landau\n,\nEmmy Noether\nand\nHermann Weyl\n. He was awarded his doctorate in mathematical sciences from the Faculty of Science, University of Paris, in\n1931\nafter defending his\n87\n-page thesis\nSur \"l'Analysis situs\"\ndes variétés\nà \"n\" dimensions\nⓉ\n(\nOn the 'Analysis situs' of varieties in n dimensions\n)\non\n20\nJune before a committee consisting of\nÉlie Cartan\n(\nwho was the president\n)\n,\nPaul Montel\nand\nGaston Julia\n. His thesis\n[\n11\n]\n:-\n... is divided into four chapters; the first gives a good summary with improvements of the theory of finite complexes and their homology; the second chapter discusses intersection theory of chains in a complex; the third chapter introduces the use of multiple integrals over chains in an\nn\nn\nn\n-dimensional variety using as integrands differential forms, and the fourth chapter gives several examples of complexes which have the same\nBetti\nnumbers and the same torsion, but are not equivalent.\nThe International Congress of Mathematicians was held in Zürich in September\n1932\nand de Rham attended giving a talk based on material from his thesis. He realised that his work was achieving international recognition when it was mentioned by\nÉlie Cartan\nin his plenary address to the Congress on\nLes espaces riemanniens symétriques\nⓉ\n(\nSymmetric Riemannian spaces\n)\n. He was appointed as a lecturer at the University of Lausanne in\n1932\n. In\n1935\nhe attended the First International Congress of Topology in Moscow organized by\nPavel Aleksandrov\n. Many of the leading topologists attended, including\nHeinz Hopf\n,\nWitold Hurewicz\n,\nJacob Nielsen\n,\nAndré Weil\nand\nHassler Whitney\n. De Rham spoke on\nReidemeister\ntorsion and lens spaces. At Lausanne he was promoted to extraordinary professor in April\n1936\nand to full professor in\n1943\n. He continued to work at Lausanne until he retired and was given an honorary appointment by Lausanne in\n1971\n. However de Rham also held a position at the University of Geneva although he always lived in Lausanne. He was appointed to Geneva as an extraordinary professor in\n1936\n, being promoted to full professor in\n1953\n. He retired from Geneva and was given an honorary position there in\n1973\n.\nIn addition to these permanent appointments de Rham held a number of visiting professorships. He visited Harvard in\n1949\n-\n50\nand the Institute for Advanced Study at Princeton in\n1950\n.\nRaoul Bott\nwas at Princeton at this time and he describes de Rham's visit in\n[\n6\n]\n:-\nDe Rham had a subtle charm which drew younger people to him immediately. In those early days at Princeton he would easily mingle with the boisterous postdocs, his exquisite manners contrasting amusingly with our rude ways.\nDe Rham visited the Institute for Advanced Study again in\n1957\n-\n58\n. He also visited the Tata Institute in Bombay in\n1966\n.\nIn\n[\n6\n]\nRaoul Bott\ndescribes the context of de Rham's famous theorem:-\nIn some sense the famous theorem that bears his name dominated his mathematical life, as indeed it dominates so much of the mathematical life of this whole century. When I met de Rham in\n1949\nat the Institute in Princeton he was lecturing on the\nHodge\ntheory in the context of his 'currents'. These are the natural extensions to manifolds of the distributions which had been introduced a few years earlier by\nLaurent Schwartz\nand of course it is only in this extended setting that both the de Rham theorem and the\nHodge\ntheory become especially complete. The original theorem of de Rham was most probably believed to be true by\nPoincaré\nand was certainly conjectured\n(\nand even used!\n)\nin\n1928\nby\nÉlie Cartan\n. But in\n1931\nde Rham set out to give a rigorous proof. The technical problems were considerable at the time, as both the general theory of manifolds and the 'singular theory' were in their early formative stages.\nThe details of the de Rham theorem are given in\n[\n6\n]\nbut as far as this article is concerned it is sufficient to give the 'feel' for the type of theorem as nicely described there:-\nThe theorem is then a sort of topological form of the particle-wave equivalence of quantum mechanics, and the quest for 'truly' understanding these and analogous dualities has been one of the great motivating forces in the mathematics of the last fifty years.\nOf course de Rham produced much in the way of important mathematics in addition to the 'de Rham theorem'. He gave a reducibility theorem for\nRiemann\nspaces which is fundamental in the development of Riemannian geometry. He also worked on\nReidemeister\ntorsion and his work on this topic was the beginning of rapid developments. He wrote a number of very important books:\n(\nwith\nKunihiko Kodaira\n)\nHarmonic Integrals\n(1950)\n;\nVariétés différentiables. Formes, courants, formes harmoniques\nⓉ\n(\nDifferentiable varieties. Forms, currents, harmonic forms\n)\n(1955)\n;\n(\nwith S Maumary and M A Kervaire\n)\nTorsion et type simple d'homotopie\nⓉ\n(\nTorsion and simple homotopy types\n)\n(1967)\n; and\nLectures on introduction to algebraic topology\n(1969)\n.\nFor brief extracts from reviews of these books see\nTHIS LINK\n.\nAs a teacher, de Rham had a superb reputation:-\nEssentiality, linearity of thought and calmness made up the elegance of his lectures and seminars, where, according to\nHenri Cartan\n, he was able to \"suggest a lot of things in few words.\" His approach to the audience was always full of benevolence and care. ... \"Never forget that you must love your pupils\", was his favourite advice to his assistants.\nWe now give two descriptions of de Rham's character, the first by\nBott\nand the second by Chandrasekhar:-\n... de Rham had a subtle charm which drew younger people to him immediately. In those early days at Princeton he would easily mingle with the boisterous postdocs, his exquisite manners contrasting amusingly with our rude ways. He was always lean and one could feel the steel in his sinews, but he never boasted of his mountaineering exploits and it was only at second hand that the daredevil in him became apparent...\nThe second description:-\nTough as steel in his adherence to principle, resilient, placable, self-less and generous beyond the dictates of fashion, steadfast in friendship, but not at the price of reason, de Rham strides the world of mathematics a happy warrior.\nDe Rham received many honours. He was secretary/treasurer of the\nSwiss Mathematical Society\nin\n1940\n-\n42\n, vice-president in\n1942\n-\n44\n, and president in\n1944\n-\n45\n. He was President of the\nInternational Mathematical Union\nfrom\n1963\nto\n1966\nand, in this capacity, was president of the International Congress of Mathematicians held in Moscow in August\n1966\n. He was elected a member of the\nAccademia dei Lincei\n(1962)\n, the\nGöttingen Academy of Sciences\n(1974)\n, and the\nAcadémie des Sciences\nof the Institute of France. He received honorary degrees from the universities of Strasbourg, Genoble, Lyon, and l'École Polytechnique Fédérale Zürich. He received the Prize of the Marcel Benoist Foundation\n(1965)\nand of the City of Lausanne\n(1979)\n. An international colloquium was held in Geneva in March\n1969\nto honour de Rham. An address on this occasion stated:-\n... he did as much as any one man could do to bring mathematicians together, young and old, classical and modern, from the East and West. He found a special joy in the spectacle of younger colleagues adding to the old heritage, and did as much as he could to encourage them.\nThere are many different aspects of de Rham's career, combining his passion for mathematics and for mountaineering. We give some details of de Rham as a mountaineer at\nTHIS LINK\n.\nLet us quote from\n[\n16\n]\nwhere these different aspects of de Rham are beautifully illustrated and brought together:-\nAccording to the testimonies of those who have known Georges de Rham, it seems hard to separate, in his personality and his public engagement, the loyal colleague from the generous friend, the passionate researcher from the fatherly teacher, the brilliant scientist from the brave alpinist. He regarded proving a theorem, delivering a lecture or reaching the top of a mountain as a personal endeavour, requiring a full involvement of the deepest and most precious faculties of the individual, in the name of some kind of transcendental beauty. On the occasion of the centenary of de Rham's birth, his former doctoral student Oscar Burlet remembers that he once explained to him: \"For alpinism is not only a physical exercise, but it also a task for the mind, and it allows one to create a marvellous harmony between nature, soul and body.\" Climbing higher to attain a larger view could be considered as a metaphor for de Rham's constant attempt to advance in abstraction, to gain generality by looking at single problems and objects from above. The development set off by his first proof of the theorem bearing his name moved exactly in the direction of embracing specific questions in a more and more general framework. His scientific approach is based on the comparison of structures, which, unlike in the so-called 'abstract nonsense', should not be treated as empty buildings, but employed as containers that enable us to grasp different particular cases at the same time.\nLet us end this biography by quoting de Rham's advice to his students\n(\nsee\n[\n16\n]\n)\n:-\nThe courses, the books should only be suggestions and inspirations to work: a mathematician must judge on his own account, he must be critical and must not admit anything which he has not clearly recognized himself as well-founded.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}