{
  "nome_completo": "George Edward Pelham Box",
  "nome_curto": "George Box",
  "ano_nascimento": "1919",
  "ano_morte": "2013",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Box/",
  "lugar_nascimento": "Gravesend, England",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "George Box\nwas the son of Harry Box and Helen Martin. He entered the University of London with the intention of taking a degree in chemistry. However, while he was in the middle of his course, World War II began and he was called to undertake war service. As an expert in chemistry he was assigned to the British Army Engineers and given the task of determining the effects of poison gas which might be used as a chemical weapon. He carried out experiments on small animals but the results of the tests varied considerably and Box knew that it was not chemistry which would allow him to make recommendations based on his experimental data but rather a knowledge of statistics. He requested that a statistician be assigned to assist him interpret the data he had obtained but none was available. Box realised that he would have to learn sufficient statistics to carry out the task himself.\nThe year\n1942\nwas probably not the easiest one in which to find a suitable correspondence course in statistics and indeed, despite his efforts, Box failed to find such a course. The next best thing, he decided, was to buy some statistics books and teach himself enough to analyse his data. He did just that and probably went far beyond what was needed in the case he was dealing with, but certainly he was able to give a learned and useful report on his experiments. Often such initiatives will go unnoticed, but this was not so in the case of Box for the quality of his work was recognised and, after the war ended, he was awarded the British Empire Medal for his contributions. It had another effect too, for it led Box to realise that he was more interested in statistics than he was in chemistry. Therefore when he went back to complete his education after the war ended, it was mathematical statistics that he studied rather than chemistry. He obtained a B.Sc. in mathematical statistics from University College London in\n1947\nand began to undertake research there towards a Master's Degree.\nIn the middle of his Master's studies he accepted a summer placement with Imperial Chemical Industries\n(\nICI\n)\n. Box was given the task of proof-reading a book which ICI was producing on carrying out experiments and his improvements were so numerous and of such high quality that in the end he was added as a co-author of the book. He continued to work for ICI while at the same time working towards his doctorate at University College, supervised by\nEgon Pearson\n. Box began to publish papers such as\nA general distribution theory for a class of likelihood criteria\n(1949)\nand\nOn the experimental attainment of optimum conditions\n(1951)\n. This last paper, written jointly with K B Wilson, proved particularly significant since it brought Box to the attention of Frank Grubbs in the United States who arranged for an invitation to be sent to Box inviting him to be a visiting research professor at the Institute of Statistics at the University of North Carolina.\nIn\n1953\nBox submitted his thesis\nDepartures from Independence and Homoscedastisity in the Analysis of Variance and Related Statistical Analysis\nto the University of London and was awarded a Ph.D. He then arranged leave of absence from ICI so that he could accept the visiting professorship and spend the academic year\n1953\n-\n54\nat the University of North Carolina. He left ICI in\n1957\nto take up the position of Director of the Statistical Techniques Research Group at Princeton University. He moved to the University of Wisconsin, Madison, in\n1960\nwhere he was appointed professor and chairman of the new Statistics Department which he was invited to set up. He continued on the faculty at the University of Wisconsin, spending the academic year\n1965\n-\n66\nas a visiting professor at the Harvard Business School and he was visiting professor at the University of Essex in England during\n1970\n-\n71\n. Box was appointed to the\nRonald Aylmer Fisher\nchair of statistics at the University of Wisconsin in\n1971\nand, in\n1980\n, he was named Vilas Research Professor of Statistics at the University of Wisconsin, this being the highest honour that Wisconsin could bestow to a member of their faculty. He retired in\n1992\nand was given the title of Professor Emeritus by the University of Wisconsin.\nThe main areas to which Box has contributed are: statistical inference, robustness, and modelling strategy; experimental design and response surface methodology; time series analysis and forecasting; distribution theory, transformation of variables, and nonlinear estimation; and applications of statistics. His name is associated with many ideas in statistics such as the Box-Jenkins approach, Box-Jenkins models and Box-Behnken designs. He also introduced the important idea of \"robustness\" into statistics in\n1953\nand gave a more precise definition in a paper published in\n1955\n. He wrote:-\nStatistical criteria should\n(1)\nbe sensitive to change in the specific factors tested,\n(2)\nbe insensitive to changes, of a magnitude likely to occur in practice, in extraneous factors.\nIt is the second of these two requirements which made a criterion robust.\nHis early papers included\nNon-normality and tests on variances\n(1953)\n,\nA note on regions for tests of kurtosis\n(1953)\n,\nSome theorems on quadratic forms applied in the study of analysis of variance problems. I. Effect of inequality of variance in the one-way classification\n(1954)\n,\nSome theorems on quadratic forms applied in the study of analysis of variance problems. II. Effects of inequality of variance and of correlation between errors in the two-way classification\n(1954)\n,\n(\nwith G A Coutie\n)\nApplication of digital computers in the exploration of functional relationships\n(1957)\n,\nUse of statistical methods in the elucidation of basic mechanisms\n(1958)\n, and\nFitting empirical data\n(1960)\n. Concerning this last paper,\nL J Savage\nwrites:-\nA mature exposition of an important branch of statistics, to which the author has made great contributions. One feature of particular interest is practical discussion of genuinely nonlinear fitting problems and their solution with the help of tact and a special, publicly available, IBM-\n704\nprogram. Another is insightful comments on the role of prior distributions in statistics.\nLet us look briefly at some of the many books which Box has authored, usually in collaboration with other statisticians.\nTimes series analysis. Forecasting and control\n(1970)\n, written in collaboration with Gwilym Jenkins, is described in a review by E J Hannan as follows:-\nThe intention of the book seems primarily to be to instruct a reader, having a minimum of technical expertise, in a range of methods which the authors, being men of considerable experience, deem to be the best currently available for the treatment of an important range of practical situations. To achieve this end the book has been written with great care. The details of the calculations are meticulously presented and the ideas are introduced through examples, with many carefully prepared diagrams and with numerical data which is fully given and treated. As a consequence, theory is introduced only insofar as it is needed to understand what is being done, and more difficult theory\n(\nfor example, connected with the distribution of estimates\n)\nis not given. ... The authors, with devotion, have produced a book which seems sure to be influential on statistical practice.\nBayesian inference in statistical analysis\n(1973)\n, written by Box in collaboration with George Tiao, is described in a review by Anthony O'Hagan as:-\nThis is the best book I have read on Bayesian statistics. It is basically a series of thirteen papers published by the authors and their co-authors, between\n1962\nand\n1968\n, cobbled together with a minimum of re-writing.\nBox, in collaboration with William Hunter\n(\na former research student of Box who was awarded his Ph.D. in\n1963)\nand Stuart Hunter, published\nStatistics for experimenters\nin\n1978\n. H L Harter writes:-\nThe authors - all statistical practitioners themselves - take a fresh approach to statistics oriented toward the solution of problems in the physical, engineering, biological and social sciences. The emphasis is on design of experiments, data analysis, and model building. The authors typically start with the statement of a problem faced by an experimenter, and then present one or more possible solutions, stating clearly the assumptions required for the validity of each.\nThe authors published a second edition in\n2005\nand explained that their aims were:-\n... to make available to experimenters scientific and statistical tools that can greatly catalyse innovation, problem solving, and discovery\n[\nand\n]\nto illustrate how these tools may be used by and with subject matter specialists as their investigations proceed.\nIn\n1987\nBox published\nEmpirical model-building and response surfaces\njointly with Norman Draper.\nBox's collected works\n[\n1\n]\nwere published in\n1985\nbut he continued to produce outstanding work and in\n2000\nthe volume\n[\n2\n]\nappeared. The editors write in the Foreword:-\nAlmost fifteen years have passed since the publication of The collected works of George E P Box under the editorship of George Tiao. These have been active years in the life of the gentleman for whom these early volumes were produced. His continuing originality, and verve, provide us today with a cornucopia of new writings. On\n18\nOctober\n1999\nGeorge Box was\n80\nyears old. It seems only fitting to acknowledge this special occasion with a new celebration of his published works.\nBox married Jessie Ward in\n1945\n. He married his second wife Joan G Fisher, second of\nRonald Fisher\n's five daughters, in\n1959\n; they had one son and one daughter. Joan Fisher Box has produced a superb biography of her father entitled\nR A Fisher: The Life of a Scientist\n.\nSee The Preface to\nR A Fisher: The Life of a Scientist\nat\nTHIS LINK\n.\nIn\n1985\nBox married for the third time, his wife being Claire Louise Quist.\nBox has received many honours for his outstanding contributions to statistics. Among these are the Guy Medal of the\nRoyal Statistical Society\n, the Wilks Memorial Medal from the\nAmerican Statistical Association\n, and the Shewhart Medal from the American Society for Quality Control. He has been elected a fellow of the Institute of Mathematical Statistics, the\nAmerican Academy of Arts and Sciences\n, the\nAmerican Statistical Association\nand the\nRoyal Statistical Society\n. He has received honorary degrees from Rochester, New York\n1985\n, Carnegie Mellon\n1989\n, Don Carlos III, Madrid\n1995\n, and Waterloo, Canada\n1999\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}