{
  "nome_completo": "George Abram Miller",
  "nome_curto": "George Miller",
  "ano_nascimento": "1863",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Miller/",
  "lugar_nascimento": "Lynnville, Pennsylvania, USA",
  "lugar_morte": "Urbana, Illinois, USA",
  "biografia": "George Miller\n's parents were Mary Sittler and Nathan Miller who was descended from Christian Miller who emigrated to the United States from Switzerland around\n1720\n. George was born on a farm into a poor family. Since his parents did not have the financial means to support him through his studies, George began teaching at the age of seventeen to support himself through College.\nDuring\n1882\n-\n83\nMiller attended Franklin Academy which was a part of the College of Lancaster. From there he went to Allentown, Pennsylvania, where he studied at Muhlenberg College for his baccalaureate which he received in\n1887\n. Continuing his studies he was awarded a degree of Master of Arts by Muhlenberg College in\n1890\n. By now Miller was\n27\nyears of age, much older than one might expect, but this was just a consequence of having to support himself financially through his education. In fact he had been the principal of schools in Greeley, Kansas, in\n1887\n-\n88\nand professor of mathematics at Eureka College in Illinois from\n1888\nwhile he worked for his Master's Degree. When teaching was finished at Eureka College, Miller went to Johns Hopkins University and the University of Michigan to spend the summers of\n1889\nand\n1890\n.\nCumberland University in Lebanon, Tennessee, offered a doctorate as a correspondence course. This did not require an original thesis, in fact it was not examined by thesis at all but was awarded on the basis of examinations taken on advanced courses. These courses could be studied as correspondence courses and this is exactly what Miller did. What is perhaps more surprising, he offered himself the same courses for a doctorate to students at Eureka College where he was professor of mathematics. He graduated with a doctorate from Cumberland University in\n1892\nand in the following year he left Eureka College to take up the position of instructor at the University of Michigan.\nWhen he arrived at the University of Michigan, Miller was offered accommodation in\nCole\n's home. He lived there for two years and this was perhaps the most significant event for his mathematical development for\nCole\nwas interested in the\ntheory of groups\nand he soon had Miller totally fascinated by this topic. Miller spent the years from\n1895\nto\n1897\nin Europe attending lectures on group theory by\nLie\nin Leipzig and\nJordan\nin Paris. On his return to the United States Miller was appointed assistant professor at Cornell University. He held this position from\n1897\nuntil\n1901\nwhen he was appointed to Stanford University. In\n1906\nhe moved from Stanford to the University of Illinois at Urbana-Champaign where he remained for the rest of his career. In\n1909\nhe married Casandra Boggs from Urbana-Champaign but they had no children.\nMiller worked mostly on group theory but he was also interested in the history of mathematics. Although interesting because it was done at an early stage, his work fails to show much depth. He wrote more than\n800\narticles over a period of\n40\nyears about half at research level, the others aimed at school teachers. His collected works appear in five volumes: the first contains\n62\npapers which Miller published before\n1900\n; the second contains\n107\nof the\n147\npapers he published during the years from\n1900\nto\n1907\n; the third includes\n89\nof the\n180\npapers he published during the years\n1908\nto\n1915\n; the fourth contains\n98\nof the\n232\npapers he published during the period\n1916\nto\n1929\n.\nMany of Miller's group theory papers enumerate the possible finite groups which satisfy given conditions such as: the prime factors which divide the order, the orders of two generating permutations and their product; the types of subgroups; or the degree of a representation as a permutation group. Several papers investigate groups generated by two elements satisfying given conditions. For example he considered groups generated by two elements of order three whose product is of order four or three or six. He also considered permutation groups of small degree, groups having a small number of conjugacy classes, multiply transitive groups, and characteristic subgroups of finite groups. He found the list of all possible groups of order\n1909\nto\n1919\ninclusive. Miller did not introduce new techniques to attack these group theory questions and one is tempted to say that he should have applied his undoubted skills to produce fewer yet more significant results.\nHis best historical papers are those which look at the history of group theory. He also wrote papers such as\nThe founder of group theory, Primary facts in the history of mathematics\n, and\nSome thoughts on modern mathematical research\n. In addition Miller wrote a number of books:\nDeterminants\n(1892)\n;\nHistorical introduction to mathematical literature\n(1916)\nand he co-authored\nTheory and application of finite groups\n(1916)\nwith\nBlichfeldt\nand\nDickson\n.\nMiller became a member of the\nNew York Mathematical Society\nin\n1891\n, three years after it was founded. In\n1894\nthe Society became the\nAmerican Mathematical Society\nand Miller helped to organise the San Francisco West Coast section which was set up in May\n1902\n. He was a member of the\nLondon Mathematical Society\n, the\nGerman Mathematical Society\n, and an honorary member of the\nIndian Mathematical Society\n.\nHe was elected to the\nAmerican Academy of Arts and Sciences\nin\n1919\nand to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1921\n. He was honoured with the award of a prize by the Cracow Academy of Sciences. He was an editor of the\nAmerican Mathematical Monthly\nfrom\n1909\nto\n1915\nbefore it became associated with the\nMathematical Association of America\n. He was the sixth President of the\nMathematical Association of America\nfrom\n1921\n-\n22\nand gave his presidential address in\n1922\ncalling attention to contradictions and inaccuracies in the mathematical literature. This was characteristic of him in his historical writings. In\n[\n1\n]\nthis is presented in a positive light:-\nHe became a severe critic of historical methodology in mathematics and was zealous in rooting out error in conjecture or assumed fact. His letters in the\nDavid Eugene Smith\ncollection at Columbia University offer ample evidence of the missionary zeal.\nIn\n[\n9\n]\nthe author criticises this aspect of Miller's work:-\nHis historical writings outside the theory of groups often depended on secondary sources and reflected an attitude overly concerned with pointing out error in published accounts.\nA bequest of one million dollars made to the University of Illinois\n(\nwhere he had taught for\n25\nyears\n)\non his death showed the skill he had in making financial investments. His wife had died in\n1949\nand he had no close relatives. He explained his motives\n(\nsee\n[\n9\n]\n:-\nEverything I have I received from the university, and I want to repay my obligation.\nIt is difficult to assess Miller's contributions to mathematics. Although these contributions do not seem today to have been particularly important, his contemporaries rated him highly as is evident from the fact that he was ranked tenth in a list of top American mathematicians for J M Cattell's\nAmerican Men of Science\n.",
  "math_areas": [
    "Algebra",
    "Combinatorics"
  ]
}