{
  "nome_completo": "George Eugene Uhlenbeck",
  "nome_curto": "George Uhlenbeck",
  "ano_nascimento": "1900",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Uhlenbeck/",
  "lugar_nascimento": "Batavia, Java (now Jakarta, Indonesia)",
  "lugar_morte": "Boulder, Colorado, USA",
  "biografia": "George Uhlenbeck\n's ancestors had come first from Germany but then later generations were Dutch and served in the Dutch colonies. His father, Eugenius Marius Uhlenbeck was born in Java in what was then called the Dutch East Indies but is now Indonesia. In\n1893\nEugenius Uhlenbeck, who served in the Dutch East Indian Army, married Anne Marie Beeger who was the daughter of a Dutch major general. Two of their children died of malaria at a very young age but four survived. Of the surviving children George was the second child, with an older sister Annie and two younger brothers Willem Jan and Eugenius Marius.\nWhen George was six years old the family moved permanently to Holland, setting up home in The Hague. There George attended elementary school followed by high school, or the higher burger school as it was then called. Uhlenbeck said\n[\n3\n]\n:-\nI was a very dutiful student, very dutiful. I always worked very regularly and I was always very good in class. I was certainly not clear until the last years in high school what I was going to do.\nHowever, as with so many people, he was influenced by an excellent school teacher. In his last couple of years at school his physics teacher strongly encouraged him, gave him texts on the differential and integral calculus and suggested that he read undergraduate texts on mathematics and physics. One of the books which made him enthusiastic about physics was\nLorentz\n's\nLectures on Physics\nwhich he read in the Royal Library in The Hague.\nAlthough Uhlenbeck performed extremely well in his final school examinations in July\n1918\n, he was not allowed to enter a university since his studies had not included Greek and Latin. This was not his fault, simply that the school he attended did not offer these topics. He had no choice but to enter the Institute of Technology in Delft. He chose to study chemical engineering there but shortly after, when the rules were changed by the Dutch government so that Greek and Latin were no longer required for university entrance, he left the Institute of Technology. Having spent just one semester studying chemical engineering he began his university study at the University of Leiden.\nUhlenbeck was doubly glad to be able to make the move, firstly because he had always wanted to study physics and mathematics at university, but also because he felt he did not have the dexterity to undertake a practical subject. At Leiden physics was taught by\nEhrenfest\n, H K Onnes and J P Kuenen while\nLorentz\n, by that time retired from his chair, came in to lecture once a week. Uhlenbeck bought a copy of\nBoltzmann\n's\nLectures on gas dynamics\nand he studied this in his own time, continuing the way of learning which he had adopted at school. At first he found it almost impossible to understand but after reading an encyclopaedia article by\nEhrenfest\nit began to make sense. Of the lectures he attended those on the foundations of analysis he found greatly to his liking, finding that the rigour of analysis was particularly pleasing to him. Later in his career\nEhrenfest\nwould encourage him to present his mathematics with less rigour.\nUhlenbeck's parents did not find it easy to provide the necessary financial support for him at university. To keep down the expense, he travelled every day from The Hague to Leiden, a long and tiring journey. In his second year as an undergraduate Uhlenbeck studied\nMaxwell\n's theory which he wrote out in great detail. This impressive piece of work led to him being awarded a scholarship for his third year of study which took the financial burden away from his parents. As he had done at school, Uhlenbeck worked exceptionally hard and performed well in his final examinations in December\n1920\n.\nAfter graduating, he began postgraduate studies at Leiden under the supervision of\nEhrenfest\n. In order to support himself financially, however, he had to work. He took a part-time job as a teacher in a girls school in Leiden which gave him sufficient money to allow him to rent a room. At last the daily travelling was over. He settled down to the work for his Master's degree which involved attending lecture courses. Pais writes\n[\n5\n]\n:-\nEhrenfest\n's graduate lectures consisted of a two-year course:\nMaxwell\ntheory, ending with the theory of electrons and some relativity, one year; and statistical mechanics, ending with atomic structure and\nquantum theory\nthe other. Uhlenbeck attended these lectures and took additional instruction in mathematics.\nIn September\n1922\n, before obtaining his Master's degree, Uhlenbeck took the opportunity to spend time working in Italy when he accepted an appointment as a private tutor to the son of the Dutch ambassador in Rome. He held this job until June\n1925\n, but he returned to Holland each summer. He completed the work for his Master's degree after one more year and then he was examined and received the degree in September\n1923\n. Shortly after the award of the degree Uhlenbeck returned to Italy and, on\nEhrenfest\n's advice, made contact with\nEnrico Fermi\n. This proved to be an important friendship for both men.\nHowever despite this contact with scientists, Uhlenbeck's academic interests turned towards history. When his appointment in Italy ended and he had returned to Holland he was close to making a decision to become an historian.\nEhrenfest\n, keen to keep him a scientist, suggested that he work for him for a while and gave Uhlenbeck a two year appointment as his assistant. He succeed\nStruik\nwho had been awarded a Rockefeller Fellowship. Very soon after taking up the appointment, working with a graduate student Samuel Goudsmit, Uhlenbeck made his most important scientific discovery when he discovered electron spin.\nIn January\n1925\nPauli\nhad proposed that the electron should be given an additional fourth quantum number which was a half integer. This was one of the clues which led Uhlenbeck to arrive at the idea of electron spin. He wrote\n(\nsee for example\n[\n2\n]\n)\n:-\n... it occurred to me that , since\n(\nI had learned\n)\neach quantum number corresponds to a degree of freedom of the electron,\nPauli\n's fourth quantum number must mean that the electron had an additional degree of freedom -- in other words the electron must be rotating.\nThe concept immediately excited\nNiels Bohr\n,\nPauli\n,\nEinstein\n,\nHeisenberg\nand others interested in quantum theory. Uhlenbeck's work progressed well and particularly important was\nOskar Klein\n's appointment to Leiden. The two quickly became friends and exchanged ideas, particularly on\nKlein\n's ideas about five dimensional relativity.\nUhlenbeck's doctoral work was written in Copenhagen where he spent two months devoted to intensive writing of his dissertation. It was of fundamental importance in quantum mechanics, systematising statistical notions and expanding on the electron spin ideas which had announced two years earlier. Immediately after being examined on his thesis, Uhlenbeck was appointed to Michigan. He married Else Ophorst in August\n1927\nthen, in the following month, he arrived in Ann Arbor to take up the appointment.\nHe returned to the Netherlands to take up a chair in Utrecht in\n1935\n. The chair had become vacant due to the holder, Kramers, moving to Leiden to take up the chair left vacant there after\nEhrenfest\ncommitted suicide. He took leave from Utrecht in\n1938\nto spend a year as visiting professor at Columbia University in New York but after a short time back in Holland he left again for the United States in August\n1939\nshortly before the outbreak of World War II.\nFrom\n1943\nuntil\n1945\nUhlenbeck worked at MIT as a member of the team working on the development of radar. Then, after the war ended, he returned to Ann Arbor where, after spending\n1948\n-\n49\nat Princeton, he was named Henry Cahart professor at Michigan in\n1954\n. Four years later, in\n1960\n, he moved to the Rockefeller Institute in New York where he remained on the staff until he retired in\n1971\n.\nAs well as fundamental work on quantum mechanics, Uhlenbeck worked on atomic structure and the kinetic theory of matter. He extended\nBoltzmann\n's equation to dense gasses and wrote two important papers on\nBrownian motion\n. The main topic on which he worked throughout his career was statistical physics. The aim of this topic was to understand the relationship between physics at atomic level and that at macroscopic level. In\n1955\nhe explained the attraction of the area to him:-\nTo me the great charms of statistical physics lies in its connection with parts of mathematics with which otherwise one rarely comes in contact.\nUhlenbeck had a very significant influence on statistical mechanics and brought an area which was very varied and disjointed into some sort of structured whole. He was always very keen on clarity and a logical approach to all the problems he studied. Cohen, a student of Uhlenbeck's, tells us much about Uhlenbeck's character in\n[\n2\n]\n.\n...\n[\nUhlenbeck\n]\noften admonished me that rather than trying to be original, it was much more important to be clear and correct and to summarise critically the present status of a field in the\nEhrenfest\ntradition. He wisely observed that what is often of lasting value is not the first original contribution to a problem, but rather the final clearly and critically written survey. That is certainly what he did in this Brownian motion paper!\nAs to the style of Uhlenbeck's papers, Cohen writes:-\nUhlenbeck's papers are all relatively short and stand out by their conciseness, precision, and clarity, finely honed to a deeper understanding of a basic problem in statistical physics. They do not contain long formal derivations and are almost all geared to concrete problems. ... they were of a classic nobility, mathematical purity and clarity ... He felt that something really original one did only once - like the electron-spin--the rest of one's time one spent on clarifying the basics.\nCohen also comments on the high quality of Uhlenbeck's teaching in\n[\n2\n]\n:-\nHe was an inspiring teacher. With superbly organised and extremely clear lectures, he laid bare for everyone to see the beautiful structure of statistical mechanics, based on the principles of the founding fathers,\nMaxwell\n,\nBoltzmann\n, and\nGibbs\n. Thus he transmitted to a younger generation what he conceived to be the essence of the past and the way to the future. In doing so, he educated several generations of physicists in statistical mechanics in a style rare in this century.\nUhlenbeck received many honours for his work. These include his appointment at\nLorentz\nprofessor in\n1955\n, and serving as President of the American Physical Society in\n1959\n. He was awarded the\nPlanck\nMedal in\n1965\n, the\nLorentz\nMedal of the Royal Dutch Academy of Sciences in\n1970\n, the National Medal of Science from the United States in\n1977\n, and the Woolf Prize for Physics in\n1979\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}