{
  "nome_completo": "Georg Peurbach",
  "nome_curto": "Georg Peurbach",
  "ano_nascimento": "1423",
  "ano_morte": "1461",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peurbach/",
  "lugar_nascimento": "Peuerbach, Austria",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Georg Peurbach\n's father was Ulrich Aunpekh; the name Peurbach is just the town in which they lived, about\n40\nkm west of Linz, and he should really be known as Georg of Peurbach. Nothing is known of his early life, the first record being his matriculation at the University of Vienna in\n1446\n. It is worth recording that he matriculated under the name Georgius Aunpekh de Pewrbach. Georg studied at Vienna, graduating with a bachelor's degree on\n2\nJanuary\n1446\n. At university he studied the standard arts course consisting mainly of the humanities. It is likely that he would have studied some mathematics but the expertise which he gained in astronomy must have been self taught. The last astronomer to teach at the University of Vienna was John of Gmunden who died four years before Peurbach matriculated there, but the university still held his library and instruments to which Peurbach probably was given access.\nHe travelled through Europe between\n1448\nand\n1453\nalthough no record remains of the precise dates. He had already acquired an international reputation as an astronomer despite having no publications at that time. He lectured in Germany, France and Italy on astronomy and after giving lectures in Bologna and Padua he was offered appointments in these universities but turned them down. He met the leading Italian astronomer of the day, Giovanni Bianchini, in Ferrara and he also tried to persuade Peurbach to accept a post in an Italian university. By\n1453\nPeurbach was back in Vienna and there he was awarded a Master's Degree on\n28\nFebruary.\nBefore continuing it is worth spending a moment reviewing the connection between astronomy and astrology in Peurbach's time. There was a widely held belief that the heavenly bodies influenced the lives and events of those on earth. The astrologer wanted to know the precise position of the sun, moon and planets at the time of a person's birth to draw up a chart which was believed foretold a person's future. Eclipses were of great significance and the appearance of a comet was treated as a major portent. Astronomy and astrology are separate to our minds today but were intimately connected in the\n15\nth\ncentury. The desire for predictions based on astrological considerations did, however, drive the science of astronomy to make more accurate tables. Much scientific work was funded for the wrong reasons, but some might say this still happens today.\nHe was appointed court astrologer by King Ladislas V of Hungary and of Bohemia in\n1454\n. Ladislas was only\n14\nyears of age when he appointed Peurbach but he had been King since he was a few months old under the guardianship of his cousin, who was later to become Holy Roman emperor Frederick III. Ladislas spent most of his time in Prague and Vienna and Peurbach was able to also teach at the University of Vienna. His teaching seems to be mostly in the humanities, however, and not in astronomy. Political intrigues, leading to assassinations of two leading figures, caused Ladislas to flee to Prague in\n1457\nand he died there later that year\n(\nactually of leukaemia\n)\n. Peurbach did not become court astrologer to George of Podebrady of Bohemia or Matthias I Corvinus of Hungary, Ladislas's successors, but rather was appointed as court astrologer to the  Holy Roman emperor Frederick III. Frederick was interested in astrology, magic, and alchemy so Peurbach had a patron who would treat him well.\nRegiomontanus\nwas a student at the University of Vienna where he was taught by Peurbach. He graduated at the age of fifteen and in the following year of\n1453\nhe began collaborating with Peurbach. For eight years, until Peurbach's death, the two astronomers did excellent work together. In\nTheoricae Novae Planetarum\nⓉ\n(\nNew theories of the planets\n)\n, which he completed by\n30\nAugust\n1454\n, Peurbach presented\nPtolemy\n's\nepicycle\ntheory of the planets in an elementary but thorough way. Peurbach believed that the planets were in solid crystalline spheres although he believed that their motions were controlled by the Sun. The book was based on lecture notes of a course given by Peurbach at the University of Vienna earlier in\n1454\n. J V Field  writes:-\nThe astronomy Peurbach teaches is that of planetary spheres, the motion of each planet being shown by circles\n(\nstanding for spheres\n)\nrolling one inside the other. The theory is derived from\nPtolemy\nbut also from Islamic astronomers. The work consequently tends to look \"medieval\", a characteristic that may perhaps partly account for its long neglect by translators.\nIn fact the interesting paper\n[\n4\n]\nputs forward a strong case that Peurbach used techniques developed by the Islamic astronomers to modify\nPtolemy\n's model. The book:-\n... went into at least fifty-six printed editions between\n1472\nand\n1653\n(\ncounting translations and commentaries as well as editions of the original Latin text\n)\n. It seems to have been the most widely used astronomical textbook of the sixteenth century.\nPeurbach observed a lunar eclipse on\n3\nSeptember\n1457\nfrom a site near Vienna. He measured the duration of the eclipse and then found the time of the midpoint. It was eight minutes earlier than the time predicted by the Alphonsine Tables. These tables, prepared in Toledo, Spain, for King Alfonso X, were completed in\n1252\n. Based on\nPtolemy\n's theory, they represented the best data available in Peurbach's time. Peurbach produced a new collection of tables of eclipse calculations in\nTabulae Ecclipsium\nwhich he completed around\n1459\n. When he observed eclipses on\n3\nJuly and\n27\n-\n28\nDecember\n1460\nhe was able to compare the times with the predictions contained in his own tables.\nHe observed\nHalley\n's comet in June\n1456\nand wrote a report on his observations. He made further observations of comets and, published further tables, checked by his own eclipse observations, and devised astronomical instruments. As an example of an instrument he devised we note that Peurbach discovered the deviation of the compass. He then devised the earliest tablet dial with a compass and with indicated deviation in around\n1451\n:-\nA tablet dial consists of two small sundials\n(\nhorizontal and a vertical direct-south dial\n)\nhinged together with a common gnomon; the instrument can be folded at the hinge and then fits in the pocket.\nHe also constructed celestial spheres, large globes which depicted the stars. He wrote on the computation of sines and chords in\nTractatus super propositiones Ptolemaei de sinubus et chordis\nusing and explanation based on that of Islamic astronomers as well as one based on\nPtolemy\n. His book\nAlgorismus\n, an elementary textbook on practical calculations with integers and fractions, was popular and reprinted several times.\nJohannes Bessarion was made archbishop of Nicaea  in\n1437\nand was made a cardinal by Pope Eugenius IV two years later. He was one of the most learned scholars of his time, and spread knowledge of Greek language and learning with a personal library that included a large collection of Greek manuscripts. On\n5\nMay\n1460\nhe arrived in Vienna to mediate in a dispute between Frederick III and his brother. He had another purpose for his visit for Constantinople had fallen to the Turks in\n1453\nand Bessarion was seeking support for a crusade to recapture the city. Bessarion met both Peurbach and\nRegiomontanus\nand he told them that, in addition to his political objectives, he also had scientific objectives. The idea which he wanted to sell to Peurbach was to produce a better translation of the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nfrom the Greek. Bessarion suggested that a shortened version would make a suitable teaching text and Peurbach agreed to work on the project. Peurbach had completed six books at the time of his death but\nRegiomontanus\nhad agreed to complete the work. In finished form there were thirteen books, the remaining ones having been written by\nRegiomontanus\n. It was published as\nEpitome in Ptolemaei Almagestum\nin\n1462\nand dedicated to Bessarion\n(\nwho may have contributed parts of the introduction\n)\n. The work marks:-\n... a shift from reverence for\nPtolemy\nand antiquity to respect coupled with confident innovation.\nThe authors of\n[\n1\n]\nwrite:-\nPeurbach's early death was a serious loss to the progress of astronomy, if for no other reason than that the collaboration with his even more capable and industrious pupil\nRegiomontanus\npromised a greater quantity of valuable work than either could accomplish separately. Of their contemporaries, only Bianchini, who was considerably their senior, possessed a comparable proficiency and originality.",
  "math_areas": [
    "Algebra"
  ]
}