{
  "nome_completo": "George Whitelaw Mackey",
  "nome_curto": "George Mackey",
  "ano_nascimento": "1916",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mackey/",
  "lugar_nascimento": "St Louis, Missouri, USA",
  "lugar_morte": "Belmont, Massachusetts, USA",
  "biografia": "George Mackey\n's father was William Sturges Mackey and his mother was Dorothy Frances Allison. The family moved from St Louis to Florida then settled in Houston in\n1926\n. Many mathematicians know that mathematics is the subject for them at a young age but Mackey struggled to find the right topic for him. On the one hand there was pressure from his father to become a businessman. However when he was studying at high school he was inspired by a chemistry book which he was studying and so, as a compromise between different topics that interested him, he entered the Rice Institute in Houston to study for a degree in chemical engineering.\nChanges of direction did not come easily to Mackey who described them as a \"soul struggle\", but he decided to move from the chemical engineering course to study physics. However, he still had not found exactly what he was looking far. As he wrote many years later\n(\nsee for example\n[\n1\n]\nand\n[\n2\n]\n)\n:-\nI was disturbed by the way that mathematics was handled in my physics courses and spent a great deal of time trying to redo things in a more precisely defined and rigorously argued manner. ... I wanted somehow to combine the logical precision of mathematics with the\n(\napparently\n)\nricher content of physics.\nAfter the award of a bachelor's degree from the Rice Institute in\n1938\n(\nRice Institute was founded in\n1891\nand only became Rice University in\n1960)\n, Mackey went to Harvard to undertake postgraduate work. He was one of the first to be awarded a William Lowell Putnam fellowships to undertake research at Harvard. He was awarded a Master's Degree in mathematics from Harvard in\n1939\n, then continued undertaking research there for his doctorate under\nMarshall Stone\n's supervision. Although he majored in physics for his bachelor's degree, he moved towards mathematics at Harvard. He later wrote\n(\nsee for example\n[\n1\n]\nor\n[\n2\n]\n)\n:-\nIn graduate school, I became seduced by the beauties of pure mathematics and put my plans for reforming physics aside.\nHe was awarded his doctorate in\n1942\nafter submitting his thesis\nThe Subspaces of the Conjugate of an Abstract Linear Space\n.\nAfter the award of his Ph.D. from Harvard, Mackey spent a year teaching at the Illinois Institute of Technology in Chicago. In\n1943\nhe was appointed as an instructor in mathematics at Harvard University and he was to remain on the faculty there for the rest of his career. He served as a civilian in the Operations Research Section of the\n8\nth\nAir Force in\n1944\nas his contribution to the war effort. He was promoted to assistant professor at Harvard in\n1946\n, to associate professor in\n1948\n, and to full professor in\n1956\n. Then, in\n1969\n, he was honoured by being named Landon T Clay Professor of Mathematics at Harvard. He retired in\n1985\n, being named Landon T Clay Professor of Mathematics Emeritus at that time.\nEarly in his career Mackey worked on the duality theory of locally convex spaces publishing papers which include\nOn infinite dimensional linear spaces\n(1943)\n,\nOn convex topological linear spaces\n(1943)\n,\nEquivalence of a problem in measure theory to a problem in the theory of vector lattices\n(1944)\n,\n(\nwith Shizuo Kakutani\n)\nRing and lattice characterization of complex Hilbert space\n(1946)\n,\nOn convex topological linear spaces\n(1946)\n. His interest in physics continued, however, and he published\nA theorem of Stone and von Neumann\n(1949)\nin which he generalised a theorem about quantum mechanics proved by\nStone\nand\nvon Neumann\nin\n1930\n. This work was related to\nImprimitivity for representations of locally compact groups\nwhich Mackey published in the same year. He then produced a series of important papers on group representations including\nOn induced representations of groups\n(1951)\n,\nInduced representations of locally compact groups\n(1952)\n, and\nSymmetric and anti symmetric Kronecker squares and intertwining numbers of induced representations of finite groups\n(1953)\n.\nIn\n1955\nMackey gave a course of lectures on the theory of group representations at the University of Chicago in the summer of\n1955\n. A set of mimeographed notes was produced at the time and these later were incorporated as the first half of his book\nThe theory of unitary group representations\npublished in\n1976\n. In the spring of\n1960\nhe gave a lecture course at Harvard University on the mathematical foundations of quantum mechanics. An edited version of these lectures became his famous classic text\nThe mathematical foundations of quantum mechanics\npublished in\n1963\n:-\n... the aim of the book is to explain, or at least to illuminate, the essential aspects of classical and quantum mechanics from a point of view more congenial to pure mathematicians than that encountered in physics texts. In a rather unusual way, all physical concepts used are defined in terms of pure mathematics rather than physical connections except, of course, basic notions concerning space and time.\nIn\n1967\nMackey published Lectures on the theory of functions of a complex variable  which was based on an undergraduate course he gave at Harvard during the academic year\n1959\n-\n60\n. He writes in the Introduction:-\nFor better or worse I chose to de-emphasize the intuitive geometric aspects of the subject and to present it as a deductive system starting with axioms for the real and complex numbers. While I assumed a fair amount of 'mathematical maturity' on the part of the students I made a point of assuming no previous formal knowledge of mathematics. I defined all terms - even those of calculus and elementary algebra - and proved all theorems except those which I decided to leave to the students as exercises. In principle\n(\nbut not in practice of course\n)\nthe notes can be read with understanding by someone with no previous knowledge of mathematics. Of course, in order to avoid excessive pedantry I left many simple arguments to the imagination of the student - especially after the first few chapters.\nDuring the academic year\n1966\n-\n67\n, Mackey delivered a series of lectures on group representations and their applications at Oxford University in England where he was George Eastman visiting professor. As for some of his earlier courses, mimeographed notes circulated from that time on but eventually became part of a properly published textbook. This happened when\nUnitary group representations in physics, probability, and number theory\nwas published in\n1978\n. Mackey has written many beautiful survey articles and in\n1992\nthe\nAmerican Mathematical Society\nand the\nLondon Mathematical Society\nin their wonderful series 'History of Mathematics' published\nThe scope and history of commutative and noncommutative harmonic analysis\nby Mackey. This consisted mostly of survey articles written by Mackey as expanded versions of lectures given at conferences between\n1977\nand\n1988\n. Jorgensen writes in a review:-\nIt is well known that the author's approach to representation theory has proved very successful in finding the unitary representations, and their decompositions, for the groups which come up frequently both in\n(\npure\n)\nmathematics and in physics, as well as in mathematical physics. But the author's theory is surprisingly versatile, with applications in number theory, harmonic analysis, ergodic theory, quantum mechanics, and statistical mechanics, and these applications are worked out in detail.... The reviewer notes that there are also interesting applications to operator algebras. ... The new material in the present book is concentrated in the last\n50\npages and it centres around lattice models in statistical mechanics, PDEs in hydrodynamics,\nKac\n-Moody\nLie algebras\n, and the\nKorteweg\n-\nde Vries\nequation.\nClifford Taubes\n, chairman of Harvard University's mathematics department gave this appreciation of Mackey:-\nHe was a gentle man, but he was the most intellectually honest person I've ever known. He was a realist. He believed that people shouldn't delude themselves. He wouldn't let people get away with cosy preconceptions. Here, I'm not just talking about mathematics, but aspects of life, your beliefs. You'd get into these conversations about politics and things in everyday life and he'd say, 'Well, why do you believe that?' You really had to back up what you were saying.\nMany doctoral students at Harvard having Mackey as a thesis advisor went on to have academic careers. Let us mention a few:\nAndrew Gleason\n(\nPh.D.\n1950)\n, Richard Palais\n(\nPh.D.\n1956)\n, Calvin Moore\n(\nPh.D.\n1960)\n, Edward Effros\n(\nPh.D.\n1962)\n, Lawrence Brown\n(\nPh.D.\n1968)\n, and Caroline Series\n(\nPh.D.\n1976)\n.\nMackey married Alice Willard on\n9\nDecember\n1960\n; they had a daughter Ann Sturges Mackey born in\n1963\n. Comments by Alice and Ann in\n[\n1\n]\nsay much about George Mackey. When Ann was born, Alice persuaded Mackey to give up driving because:-\n... he had a tendency to go left when right was right.\nEach morning and evening he set aside time to read and play games with his daughter and would not allow work to intrude. Ann said:-\nHe was a great believer in quality time and he really embraced it. When he was with me, he was really, truly with me.\nAfter his daughter went to bed, he would read aloud to his wife while she did needlepoint - biographies, non-fiction, and the classics of English literature. Alice said:-\nWhen he was not working, he was totally attentive to the person he was with. People would say, \"He really listened to me.\"\nAmong the honours Mackey received for his outstanding contributions to mathematics was election to\nAmerican Academy of Arts and Sciences\n(1953)\n, the\nNational Academy of Science\n(1962)\n, and the American Philosophical Society\n(1971)\n. A long time member of the\nAmerican Mathematical Society\n, he was vice president in\n1964\n-\n65\nand received the Society's Steele Prize in\n1975\n. Rice University gave him a distinguished alumnus award in\n1982\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Number Theory"
  ]
}