{
  "nome_completo": "Georgii Dmitrievic Suvorov",
  "nome_curto": "Georgii Dmitrievich Suvorov",
  "ano_nascimento": "1919",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Suvorov/",
  "lugar_nascimento": "Saratov, Russia",
  "lugar_morte": "Donetske, Ukraine",
  "biografia": "Georgii Dmitrievich Suvorov\nwas born in Saratov, in western Russia on the Volga River. He studied at Tomsk University, the first Siberian university which had been founded in\n1888\n, graduating in\n1941\n. Of course, by this time World War II was deeply affecting Russia since German troops had invaded the Soviet Union on\n22\nJune\n1941\nas part of Operation Barbarossa. After graduating, Suvorov served in the army and remained in active service until the end of the war in\n1945\n. He was awarded several medals for bravery during his years of service. After being demobilized, Suvorov tried to continue his career along the lines that he had been intending before the war interrupted his studies. He returned to Tomsk University where he undertook research with Pavel Parfen'evich Kufarev as his advisor. In fact Kufarev, Head of the Departments of Analysis and Theory of Functions and an expert on the theory of functions of a complex variable and its applications, was the only possible research supervisor at Tomsk University being the only professor of mathematics in Siberia at the time. Suvorov completed work on his Master's Thesis\n(\nequivalent to a Ph.D.\n)\nin\n1951\nand, at that time was appointed as an assistant at Tomsk University.\nAt Tomsk, Suvorov was soon promoted from assistant to lecturer. His outstanding contributions then led to him being made professor and Head of the Department of Theory of Functions at the University of Tomsk. In\n1961\nhe was awarded his doctorate\n(\nequivalent to a D.Sc.\n)\nfor his thesis\nMain properties of certain classes of topological mappings of plane domains with variable boundaries\n. He continued to teach at Tomsk University until\n1965\nwhen he was elected to Ukrainian Academy of Sciences and, in the following year, took up his appointment as Head of the Department of the Theory of Functions at the Donetsk Computing Centre. He continued in this role after it became the Institute of Applied Mathematics and Mechanics of the Ukrainian Academy of Sciences.\nSuvorov made major contributions to the theory of functions. He worked, in particular, on the theory of topological and metric mappings on\n2\n-dimensional space. Another area on which Suvorov worked was the theory of\nconformal mappings\nand quasi-formal mappings. His results in this area, mostly from the late\n1960\ns when he was at Donetsk, are of particular significance. He extended\nLavrent'ev\n's results in this area, in particular\nLavrent'ev\n's stability and differentiability theorems, to more general classes of transformations. One of the many innovations in Suvorov's work was new methods which he introduced to help in the understanding of metric properties of mappings with bounded\nDirichlet\nintegral. In\n[\n6\n]\nhis main contributions are described as follows:-\nG D Suvorov's researches during the last decade are interesting and significant; they open new paths in the theory of functions and raise new problems. The lucidity and accuracy are characteristic of him, the geometrical aspect distinctly predominates. In particular, he has proved a deep and interesting theorem that gives sufficient conditions for the coincidence of limit sets for space mappings of a very general class under very general conditions. This important result served as a source for the investigations of principally new character: The above-mentioned theorem cannot be explained even in the case of conformal mappings in the framework of the usual theory of boundary correspondence by prime ends since the limit sets with respect to two sequences of points that converge to the same prime end may be different. In connection with this, G D Suvorov posed the problem whether there exist conformal invariant compactifications of a simply connected plane domain\n(\nin the first instance, metrizable\n)\ndifferent from the\nCarathéodory\n(\nand from the \"trivial\" one from the point of view of the known theory of the one-point and the\nStone\n-\nČech\ncompactifications\n)\n, and about the description of all such compactifications. As it turns out, infinitely many such conformal-invariant compactifications, metrizable as well as nonmetrizable, exist. Thus the new formulation of the problem is interesting and useful; each new conformal-invariant compactification furnishes new boundary properties of conformal mappings. G D Suvorov and his students have constructed and studied two entirely new complete lattices of conformal-invariant compactifications. He also succeeded in obtaining a description of all conformal-invariant compactifications of a simply connected plane domain; moreover, it turns out that the family of all such compactifications constitutes a complete lattice.\nLet us end this biography by looking briefly at some of the monographs that Suvorov wrote. In\n1965\nhe published\nFamilies of plane topological mappings\n(\nRussian\n)\n. Petru Caraman begins a review with these words:-\nThis monograph contains the results of about twenty of the author's preceding works and is directed to specialists in the theory of functions of one complex variable, and particularly to those who deal with quasiconformal mappings. The book is divided into two parts. In the second part, which is completely original, the author studies the boundary correspondence by a sequence of homeomorphisms of two sequences of domains converging to their kernels\nIn\n1981\nSuvorov published\nThe metric theory of prime ends and boundary properties of plane mappings with bounded Dirichlet integrals\n(\nRussian\n)\n. A E Eremenko writes:-\nThe book contains a new construction of the theory of prime ends of simply connected plane domains based on the notion of completion of a metric space. Some applications of this theory to the study of mappings with bounded\nDirichlet\nintegral are also described. The author attempts to separate precisely the metric aspect of the theory from the topological.\nA collaboration between Suvorov and Oleg V Ivanov led to a number of joint papers which formed the basis for their joint monograph\nComplete lattices of conformally invariant compactifications of a domain\n(\nRussian\n)\n. A review, again by Petru Caraman, begins:-\nCaratheodory\n(1913)\nintroduced for the first time a compactification of a simply connected domain by means of boundary elements, which he called \"prime ends\", and proved that they are conformal invariants. The authors obtain a whole set of conformally invariant compactifications\n(\nmetrizable and nonmetrizable\n)\n, which is proved to form a complete lattice. They also consider the sublattice of stable conformally invariant compactifications, which is also complete. Finally, they give some applications in potential theory\n(\nDirichlet\nproblem\n)\n.\nSuvorov's final two monographs were published in\n1985\nand\n1986\nafter his death in\n1984\n. The first was\nThe generalized \"length and area principle\" in mapping theory\n(\nRussian\n)\nand the second\nPrime ends and sequences of plane mappings\n(\nRussian\n)\n. This final monograph continues to develop the topics considered in his two earlier monographs\nFamilies of plane topological mappings\n(1965)\nand\nThe metric theory of prime ends and boundary properties of plane mappings with bounded Dirichlet integrals\n(1981)\n.\nIn addition to his academic work, Suvorov also made important contributions to\n[\n6\n]\n:-\n... the general problems of national education and musical training.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Number Theory"
  ]
}