{
  "nome_completo": "George Gabriel Stokes",
  "nome_curto": "George Stokes",
  "ano_nascimento": "1819",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stokes/",
  "lugar_nascimento": "Skreen, County Sligo, Ireland",
  "lugar_morte": "Cambridge, England",
  "biografia": "George Stokes\n' father, Gabriel Stokes, was the Protestant minister of the parish of Skreen in County Sligo. His mother, Elizabeth Haughton, was the daughter of a minister of the church, so George Stokes' upbringing was a very religious one. He was the youngest of six children and every one of his three older brothers went on to become a priest. As the priest of the church in Cambridge which Stokes later attended wrote\n(\nsee\n[\n18\n]\n)\n:-\nThough he was never narrow in his faith and religious sympathies, he always held fast by the simple evangelical truths he learnt from his father...\nIn\n[\n4\n]\nthe atmosphere in which George grew up is described in words which are more colourful than those which might be used today:-\nThe home-life in the Rectory at Skreen was very happy, and the children grew up in the fresh sea-air with well-knit frames and active minds. Great economy was required to meet the educational needs of the large family...\nIt was not only religious teaching, but a wider introduction to education, which Gabriel Stokes was able to give his children. In particular, having studied at Trinity College Dublin, he was able to teach George Latin grammar. Before going to school George was also taught by the clerk in his father's parish in Skreen. Leaving Skreen in\n1832\n, George attended school in Dublin. He spent three years at the Rev R H Wall's school in Hume Street, Dublin, but he was not a boarder at the school, living for these three years with his uncle John Stokes. In fact the family finances would not have allowed him a more expensive education, but at this school\n[\n4\n]\n:-\nHe pursued the usual school studies, and attracted the attention of the mathematical master by his solution of geometrical problems.\nIt was during George's three years in Dublin that his father died and this event had, as one would expect, a major effect on the young man.\nIn\n1835\n, at the age of\n16\n, George Stokes moved to England and entered Bristol College in Bristol. The two years which Stokes spent in Bristol at this College were important ones in preparing him for his studies at Cambridge. The Principal of the College, Dr Jerrard, was an Irishman who had attended Cambridge University with William Stokes, one of George's elder brothers. Dr Jerrard was himself a mathematician but Stokes was taught mathematics at Bristol College by Francis Newman\n(\nwho was the brother of John Henry Newman, later Cardinal Newman, who became the leader of the Oxford Movement in the Church of England which was founded in\n1833)\n. Clearly Stokes talent for mathematics was shown during his studies at Bristol College, for he won mathematics prizes and Dr Jerrard wrote to him\n(\nsee\n[\n4\n]\n)\n:-\nI have strongly advised your brother to enter you at Trinity, as I feel convinced that you will in all human probability succeed in obtaining a Fellowship at that College.\nIt was not Trinity, rather Pembroke College, Cambridge, which Stokes entered in\n1837\n. There are slight inconsistencies in what his mathematical background was on entering Cambridge. In the course at Bristol College\n(\naccording to the College literature\n)\n(\nsee\n[\n5\n]\n)\n:-\n... a student was to become acquainted with the differential and integral calculus and to go on to statics, dynamics,\nconic sections\nand the first three sections of\nNewton\n's \"Principia\"...\nHowever, Stokes himself wrote in\n1901\n(\nsee for example\n[\n4\n]\n)\n:-\nI entered Pembroke College, Cambridge in\n1837\n. In those days boys coming to the University had not in general read so far in mathematics as is the custom at present; and I had not begun the differential calculus when I entered the College, and had only recently read analytical sections.\nIn Stokes' second year at Cambridge he began to be coached by\nWilliam Hopkins\n, a famous Cambridge coach who played a more important role than the lecturers. Stokes wrote\n[\n4\n]\n:-\nIn my second year I began to read with a private tutor, Mr\nHopkins\n, who was celebrated for the very large number of his pupils gaining high places in the University examinations for mathematical honours...\nHopkins\nwas to exert a strong influence on the direction of Stokes' mathematical interests.\nHopkins\n[\n5\n]\n:-\n... praised the study of physical astronomy and physical optics, for example, because they revealed mathematics to be 'the only instrument of investigation by which man could possibly have attained to a knowledge of so much of what is perfect and beautiful in the structure of the material universe, and the laws that govern it'.\nIn\n1841\nStokes graduated as Senior\nWrangler\n(\nthe top First Class degree\n)\nin the Mathematical Tripos and he was the first Smith's prizeman. Pembroke College immediately gave him a Fellowship. He wrote\n[\n4\n]\n:-\nAfter taking my degree I continued to reside in College and took private pupils. I thought I would try my hand at original research....\nIt was\nWilliam Hopkins\nwho advised Stokes to undertake research into hydrodynamics and indeed this was the area in which Stokes began to work. In addition to\nHopkins\n's advice, Stokes was also inspired to enter this field by the recent work of\nGeorge Green\n. Stokes published papers on the motion of incompressible fluids in\n1842\nand\n1843\n, in particular\nOn the steady motion of incompressible fluids\nin\n1842\n. After completing this research Stokes discovered that\nDuhamel\nhad already obtained similar results but, since\nDuhamel\nhad been working on the distribution of heat in solids, Stokes decided that his results were obtained in a sufficiently different situation to justify him publishing.\nStokes then continued his investigations, looking at the situation where he took into account internal friction in fluids in motion. After he had deduced the correct equations of motion Stokes discovered that again he was not the first to obtain the equations since\nNavier\n,\nPoisson\nand\nSaint-Venant\nhad already considered the problem. In fact this duplication of results was not entirely an accident, but was rather brought about by the lack of knowledge of the work of continental mathematicians at Cambridge at that time. Again Stokes decided that his results were obtained with sufficiently different assumptions to justify publication and he published\nOn the theories of the internal friction of fluids in motion\nin\n1845\n. The work also discussed the equilibrium and motion of elastic solids and Stokes used a continuity argument to justify the same equation of motion for elastic solids as for viscous fluids.\nPerhaps the most important event in the recognition of Stokes as a leading mathematician was his\nReport on recent researches in hydrodynamics\npresented to the\nBritish Association for the Advancement of Science\nin\n1846\n. But a study of fluids was certainly not the only area in which he was making major contributions at this time. In\n1845\nStokes had published an important work on the aberration of light, the first of a number of important works on this topic. He also used his work on the motion of pendulums in fluids to consider the variation of gravity at different points on the earth, publishing a work on geodesy of major importance\nOn the variation of gravity at the surface of the earth\nin\n1849\n.\nIn\n1849\nStokes was appointed Lucasian Professor of Mathematics at Cambridge. In\n1851\nhe was elected to the\nRoyal Society\n, awarded the Rumford medal of that Society in\n1852\n, and he was appointed secretary of the Society in\n1854\n. The Lucasian chair paid very poorly so Stokes needed to earn additional money and he did this by accepting an additional position to the Lucasian chair, namely that of Professor of Physics at the Government School of Mines in London.\nStokes' work on the motion of pendulums in fluids led to a fundamental paper on hydrodynamics in\n1851\nwhen he published his law of viscosity, describing the velocity of a small sphere through a viscous fluid. He published several important investigations concerning the wave theory of light, such as a paper on diffraction in\n1849\n. This paper is discussed in detail in\n[\n14\n]\nin which the authors write:-\n...the results of Stokes are related to the elastic theory of light, and supplement and expand a number of questions, previously studied for the most part in the works of\nA Cauchy\n. Stokes's methods for solving diffraction problems, differing considerably from the methods employed by\nCauchy\n, form the basis of the further studies of the mathematical theory of the phenomenon of diffraction.\nStokes named and explained the phenomenon of fluorescence in\n1852\n. His interpretation of this phenomenon, which results from absorption of ultraviolet light and emission of blue light, is based on an elastic aether which vibrates as a consequence of the illuminated molecules. The paper\n[\n12\n]\ndiscusses this in detail and is particularly interesting since the author makes full use of Stokes' unpublished notebooks.\nIn\n1854\nStokes theorised an explanation of the Fraunhofer lines in the solar spectrum. He suggested these were caused by atoms in the outer layers of the Sun absorbing certain wavelengths. However when\nKirchhoff\nlater published this explanation, Stokes disclaimed any prior discovery.\nStokes' career certainly took a rather different tack in\n1857\nwhen he moved from his highly active theoretical research period into one where he became more involved with administration and experimental work. Certainly his marriage in\n1857\nwas not unconnected with the change in tack and, particularly since it gives us an insight into Stokes' personality, we shall look at the events. Stokes became engaged to marry Mary Susanna Robinson, the daughter of the astronomer at Armagh Observatory in Ireland. In\n[\n4\n]\na number of letters from Stokes to Mary Susanna Robinson are given. On\n21\nJanuary\n1857\nhe wrote of his feelings for her:-\nI was capable of being moved, mathematically, as it were, by the belief that a particular course was right; and I do believe that God put these views in my mind, working by means of that which was in me to supply that which was wanting.\nThree days later he wrote that she had stopped him becoming an old bachelor:-\nI feel that perhaps my marriage with you would be even the turning-point of my salvation.\nA further three days later he wrote:-\nYou are quite right in saying that it is well not to go brooding over one's own thoughts and feelings, and in a family that is easy, but you don't know what it is to live utterly alone.\nOn the\n31\nMarch\n1857\nhe wrote again expressing his feelings in rather mathematical terms:-\nI too feel that I have been thinking too much of late, but in a different way, my head running on divergent series, the discontinuity of arbitrary constants, ... I often thought that you would do me good by keeping me from being too engrossed by those things.\nThese letters clearly did not express the love that Mary hoped to find in them and when Stokes wrote her a\n55\npage letter\n(\nwhich was possibly deliberately destroyed\n)\nabout the duty he felt towards her, she came close to calling off the wedding at the last moment. On receiving her letter showing that she was unhappy to go ahead with the marriage Stokes replied:-\nThen it is right that you should even now draw back, nor heed though I should go to the grave a thinking machine unenlivened and uncheered and unwarmed by the happiness of domestic affection.\nThe marriage did go ahead and Stokes certainly turned away from his life of intense mathematical research. It may appear from the above quotations that in fact Stokes was really looking for this change in his life and perhaps he sought marriage partly so that this change in his life-style could come about.\nAt that time Fellows at Cambridge had to be unmarried, and so on his marriage in\n1857\nStokes had to give up his fellowship at Pembroke College. However, a change in the rules in\n1862\nallowed married men to hold fellowships and he was able to take up the fellowship at Pembroke again. Stokes continued as secretary of the\nRoyal Society\nfrom his appointment in\n1854\nuntil\n1885\nwhen he was elected President of the Society. He held the position of President until\n1890\n. He was also president of the Victoria Institute from\n1886\nuntil his death in\n1903\n. There were other administrative tasks which he undertook. In\n1859\nhe had written to\nThomson\nsaying:-\nI have another iron in the fire now: I have just been appointed an additional secretary of the Cambridge University Commission.\nP G Tait\nmentioned this in his criticism of the way that science was organised in Britain\n[\n19\n]\n:-\nWhat a comment on things as they are is furnished by the spectacle of genius like that of Stokes' wasted on the drudgery of Secretary to the Commissioners for the University of Cambridge; or of a Lecturer in the School of Mines; or the exhausting labour and totally inadequate remuneration of a Secretary to the\nRoyal Society\n.\nStokes received the Copley medal from the\nRoyal Society\nin\n1893\nand he was given the highest possible honour by his College when he served as Master of Pembroke College in\n1902\n-\n3\n.\nStokes' influence is summed up well by Parkinson in\n[\n1\n]\n:-\n... Stokes was a very important formative influence on subsequent generations of Cambridge men, including\nMaxwell\n. With\nGreen\n, who in turn had influenced him, Stokes followed the work of the French, especially\nLagrange\n,\nLaplace\n,\nFourier\n,\nPoisson\n, and\nCauchy\n. This is seen most clearly in his theoretical studies in optics and hydrodynamics; but it should also be noted that Stokes, even as an undergraduate, experimented incessantly. Yet his interests and investigations extended beyond physics, for his knowledge of chemistry and botany was extensive, and often his work in optics drew him into those fields.\nOne notable omission from his publication list was a treatise on light. This omission was in part due to the change in his research output after\n1857\nbut it was also partly due to not wishing to report upon speculative ideas in a field which was in a rapid state of progress. Stokes' failure to publish a treatise on optics is discussed in detail in\n[\n8\n]\n. However, he did lecture on optics in his Burnett lectures at the University of Aberdeen in\n1891\n-\n93\nand these lectures were published.\nStokes' mathematical and physical papers were published in five volumes, the first three of which Stokes edited himself in\n1880\n,\n1883\nand\n1891\n. The last two were edited by\nSir Joseph Larmor\nwith the work being completed in\n1905\n.\nThese comments about Stokes' character in\n[\n3\n]\nare interesting:-\nFrom\n1887\nto\n1892\nhe was one of the members of Parliament for Cambridge University. In spite, or perhaps because of, his great and profound knowledge and remarkable ability, he rarely spoke in the House of Commons, but was always listened to with attention. In private life his simplicity and modesty were as conspicuous as his great attainments.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Statistics",
    "Topology"
  ]
}