{
  "nome_completo": "Georg Ferdinand Ludwig Philipp Cantor",
  "nome_curto": "Georg Cantor",
  "ano_nascimento": "1845",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cantor/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Halle, Germany",
  "biografia": "Georg Cantor\n's father, Georg Waldemar Cantor, was a successful merchant, working as a wholesaling agent in St Petersburg, then later as a broker in the St Petersburg Stock Exchange. Georg Waldemar Cantor was born in Denmark and he was a man with a deep love of culture and the arts. Georg's mother, Maria Anna Böhm, was Russian and very musical. Certainly Georg inherited considerable musical and artistic talents from his parents being an outstanding violinist. Georg was brought up a Protestant, this being the religion of his father, while Georg's mother was a Roman Catholic.\nAfter early education at home from a private tutor, Cantor attended primary school in St Petersburg, then in\n1856\nwhen he was eleven years old the family moved to Germany. However, Cantor\n[\n21\n]\n:-\n... remembered his early years in Russia with great nostalgia and never felt at ease in Germany, although he lived there for the rest of his life and seemingly never wrote in the Russian language, which he must have known.\nCantor's father had poor health and the move to Germany was to find a warmer climate than the harsh winters of St Petersburg. At first they lived in Wiesbaden, where Cantor attended the\nGymnasium\n, then they moved to Frankfurt. Cantor studied at the Realschule in Darmstadt where he lived as a boarder. He graduated in\n1860\nwith an outstanding report, which mentioned in particular his exceptional skills in mathematics, in particular trigonometry. After attending the Höhere Gewerbeschule in Darmstadt from\n1860\nhe entered the Polytechnic of Zürich in\n1862\n. The reason Cantor's father chose to send him to the Höheren Gewerbeschule was that he wanted Cantor to become:-\n... a shining star in the engineering firmament.\nHowever, in\n1862\nCantor had sought his father's permission to study mathematics at university and he was overjoyed when eventually his father consented. His studies at Zürich, however, were cut short by the death of his father in June\n1863\n. Cantor moved to the University of Berlin where he became friends with\nHermann Schwarz\nwho was a fellow student. Cantor attended lectures by\nWeierstrass\n,\nKummer\nand\nKronecker\n. He spent the summer term of\n1866\nat the University of Göttingen, returning to Berlin to complete his dissertation on\nnumber theory\nDe aequationibus secundi gradus indeterminatis\nⓉ\n(\nIndeterminate equations of the second degree\n)\nin\n1867\n.\nWhile at Berlin Cantor became much involved with a student Mathematical Society, being president of the Society during\n1864\n-\n65\n. He was also part of a small group of young mathematicians who met weekly in a wine house. After receiving his doctorate in\n1867\n, Cantor taught at a girl's school in Berlin. Then, in\n1868\n, he joined the Schellbach Seminar for mathematics teachers. During this time he worked on his\nhabilitation\nand, immediately after being appointed to Halle in\n1869\n, he presented his thesis, again on number theory, and received his habilitation.\nAt Halle the direction of Cantor's research turned away from number theory and towards analysis. This was due to\nHeine\n, one of his senior colleagues at Halle, who challenged Cantor to prove the open problem on the uniqueness of representation of a function as a trigonometric series. This was a difficult problem which had been unsuccessfully attacked by many mathematicians, including\nHeine\nhimself as well as\nDirichlet\n,\nLipschitz\nand\nRiemann\n. Cantor solved the problem proving uniqueness of the representation by April\n1870\n. He published further papers between\n1870\nand\n1872\ndealing with trigonometric series and these all show the influence of\nWeierstrass\n's teaching.\nCantor was promoted to Extraordinary Professor at Halle in\n1872\nand in that year he began a friendship with\nDedekind\nwhom he had met while on holiday in Switzerland. Cantor published a paper on trigonometric series in\n1872\nin which he defined\nirrational\nnumbers in terms of convergent sequences of\nrational\nnumbers.\nDedekind\npublished his definition of the real numbers by \"Dedekind cuts\" also in\n1872\nand in this paper\nDedekind\nrefers to Cantor's\n1872\npaper which Cantor had sent him.\nIn\n1873\nCantor proved the rational numbers countable, i.e. they may be placed in one-one correspondence with the natural numbers. He also showed that the\nalgebraic numbers\n, i.e. the numbers which are roots of polynomial equations with integer coefficients, were countable. However his attempts to decide whether the real numbers were countable proved harder. He had proved that the real numbers were not countable by December\n1873\nand published this in a paper in\n1874\n. It is in this paper that the idea of a one-one correspondence appears for the first time, but it is only implicit in this work.\nA\ntranscendental\nnumber is an irrational number that is not a root of any polynomial equation with integer coefficients.\nLiouville\nestablished in\n1851\nthat transcendental numbers exist. Twenty years later, in this\n1874\nwork, Cantor showed that in a certain sense 'almost all' numbers are transcendental by proving that the real numbers were not countable while he had proved that the algebraic numbers were countable.\nCantor pressed forward, exchanging letters throughout with\nDedekind\n. The next question he asked himself, in January\n1874\n, was whether the unit square could be mapped into a line of unit length with a\n1\n-\n1\ncorrespondence of points on each. In a letter to\nDedekind\ndated\n5\nJanuary\n1874\nhe wrote\n[\n1\n]\n:-\nCan a surface\n(\nsay a square that includes the boundary\n)\nbe uniquely referred to a line\n(\nsay a straight line segment that includes the end points\n)\nso that for every point on the surface there is a corresponding point of the line and, conversely, for every point of the line there is a corresponding point of the surface? I think that answering this question would be no easy job, despite the fact that the answer seems so clearly to be \"no\" that proof appears almost unnecessary.\nThe year\n1874\nwas an important one in Cantor's personal life. He became engaged to Vally Guttmann, a friend of his sister, in the spring of that year. They married on\n9\nAugust\n1874\nand spent their honeymoon in Interlaken in Switzerland where Cantor spent much time in mathematical discussions with\nDedekind\n.\nCantor continued to correspond with\nDedekind\n, sharing his ideas and seeking\nDedekind\n's opinions, and he wrote to\nDedekind\nin\n1877\nproving that there was a\n1\n-\n1\ncorrespondence of points on the interval\n[\n0\n,\n1]\nand points in\np\np\np\n-dimensional space. Cantor was surprised at his own discovery and wrote:-\nI see it, but I don't believe it!\nOf course this had implications for geometry and the notion of dimension of a space. A major paper on dimension which Cantor submitted to\nCrelle\n's\nJournal\nin\n1877\nwas treated with suspicion by\nKronecker\n, and only published after\nDedekind\nintervened on Cantor's behalf. Cantor greatly resented\nKronecker\n's opposition to his work and never submitted any further papers to\nCrelle\n's\nJournal\n.\nThe paper on dimension which appeared in\nCrelle\n's\nJournal\nin\n1878\nmakes the concepts of\n1\n-\n1\ncorrespondence precise. The paper discusses denumerable sets, i.e. those which are in\n1\n-\n1\ncorrespondence with the natural numbers. It studies sets of equal power, i.e. those sets which are in\n1\n-\n1\ncorrespondence with each other. Cantor also discussed the concept of dimension and stressed the fact that his correspondence between the interval\n[\n0\n,\n1]\nand the unit square was not a continuous map.\nBetween\n1879\nand\n1884\nCantor published a series of six papers in\nMathematische Annalen\ndesigned to provide a basic introduction to set theory.\nKlein\nmay have had a major influence in having\nMathematische Annalen\npublished them. However there were a number of problems which occurred during these years which proved difficult for Cantor. Although he had been promoted to a full professor in\n1879\non\nHeine\n's recommendation, Cantor had been hoping for a chair at a more prestigious university. His long standing correspondence with\nSchwarz\nended in\n1880\nas opposition to Cantor's ideas continued to grow and\nSchwarz\nno longer supported the direction that Cantor's work was going. Then in October\n1881\nHeine\ndied and a replacement was needed to fill the chair at Halle.\nCantor drew up a list of three mathematicians to fill\nHeine\n's chair and the list was approved. It placed\nDedekind\nin first place, followed by\nHeinrich Weber\nand finally\nMertens\n. It was certainly a severe blow to Cantor when\nDedekind\ndeclined the offer in the early\n1882\n, and the blow was only made worse by\nHeinrich Weber\nand then\nMertens\ndeclining too. After a new list had been drawn up,\nWangerin\nwas appointed but he never formed a close relationship with Cantor. The rich mathematical correspondence between Cantor and\nDedekind\nended later in\n1882\n.\nAlmost the same time as the Cantor-\nDedekind\ncorrespondence ended, Cantor began another important correspondence with\nMittag-Leffler\n. Soon Cantor was publishing in\nMittag-Leffler\n's journal\nActa Mathematica\nbut his important series of six papers in\nMathematische Annalen\nalso continued to appear. The fifth paper in this series\nGrundlagen einer allgemeinen Mannigfaltigkeitslehre\nⓉ\n(\nFoundations of a general theory of manifolds\n)\nwas also published as a separate monograph and was especially important for a number of reasons. Firstly Cantor realised that his theory of sets was not finding the acceptance that he had hoped and the\nGrundlagen\nwas designed to reply to the criticisms. Secondly\n[\n3\n]\n:-\nThe major achievement of the Grundlagen was its presentation of the transfinite numbers as an autonomous and systematic extension of the natural numbers.\nCantor himself states quite clearly in the paper that he realises the strength of the opposition to his ideas:-\n... I realise that in this undertaking I place myself in a certain opposition to views widely held concerning the mathematical infinite and to opinions frequently defended on the nature of numbers.\nAt the end of May\n1884\nCantor had the first recorded attack of depression. He recovered after a few weeks but now seemed less confident. He wrote to\nMittag-Leffler\nat the end of June\n[\n3\n]\n:-\n... I don't know when I shall return to the continuation of my scientific work. At the moment I can do absolutely nothing with it, and limit myself to the most necessary duty of my lectures; how much happier I would be to be scientifically active, if only I had the necessary mental freshness.\nAt one time it was thought that his depression was caused by mathematical worries and as a result of difficulties of his relationship with\nKronecker\nin particular. Recently, however, a better understanding of mental illness has meant that we can now be certain that Cantor's mathematical worries and his difficult relationships were greatly magnified by his depression but were not its cause\n(\nsee for example\n[\n3\n]\nand\n[\n21\n]\n)\n. After this mental illness of\n1884\n[\n3\n]\n:-\n... he took a holiday in his favourite Harz mountains and for some reason decided to try to reconcile himself with\nKronecker\n.\nKronecker\naccepted the gesture, but it must have been difficult for both of them to forget their enmities and the philosophical disagreements between them remained unaffected.\nMathematical worries began to trouble Cantor at this time, in particular he began to worry that he could not prove the\ncontinuum hypothesis\n, namely that the order of infinity of the real numbers was the next after that of the natural numbers. In fact he thought he had proved it false, then the next day found his mistake. Again he thought he had proved it true only again to quickly find his error.\nAll was not going well in other ways too, for in\n1885\nMittag-Leffler\npersuaded Cantor to withdraw one of his papers from\nActa Mathematica\nwhen it had reached the proof stage because he thought it \"\n... about one hundred years too soon\n\". Cantor joked about it but was clearly hurt:-\nHad\nMittag-Leffler\nhad his way, I should have to wait until the year\n1984\n, which to me seemed too great a demand! ... But of course I never want to know anything again about Acta Mathematica.\nMittag-Leffler\nmeant this as a kindness but it does show a lack of appreciation of the importance of Cantor's work. The correspondence between\nMittag-Leffler\nand Cantor all but stopped shortly after this event and the flood of new ideas which had led to Cantor's rapid development of set theory over about\n12\nyears seems to have almost stopped.\nIn\n1886\nCantor bought a fine new house on Händelstrasse, a street named after the German composer Handel. Before the end of the year a son was born, completing his family of six children. He turned from the mathematical development of set theory towards two new directions, firstly discussing the philosophical aspects of his theory with many philosophers\n(\nhe published these letters in\n1888)\nand secondly taking over after\nClebsch\n's death his idea of founding the\nDeutsche Mathematiker-Vereinigung\nwhich he achieved in\n1890\n. Cantor chaired the first meeting of the Association in Halle in September\n1891\n, and despite the bitter antagonism between himself and\nKronecker\n, Cantor invited\nKronecker\nto address the first meeting.\nKronecker\nnever addressed the meeting, however, since his wife was seriously injured in a climbing accident in the late summer and died shortly afterwards. Cantor was elected president of the\nDeutsche Mathematiker-Vereinigung\nat the first meeting and held this post until\n1893\n. He helped to organise the meeting of the Association held in Munich in September\n1893\n, but he took ill again before the meeting and could not attend.\nCantor published a rather strange paper in\n1894\nwhich listed the way that all even numbers up to\n1000\ncould be written as the sum of two\nprimes\n. Since a verification of\nGoldbach's conjecture\nup to\n10000\nhad been done\n40\nyears before, it is likely that this strange paper says more about Cantor's state of mind than it does about Goldbach's conjecture.\nHis last major papers on set theory appeared in\n1895\nand\n1897\n, again in\nMathematische Annalen\nunder\nKlein\n's editorship, and are fine surveys of transfinite arithmetic. The rather long gap between the two papers is due to the fact that although Cantor finished writing the second part six months after the first part was published, he hoped to include a proof of the continuum hypothesis in the second part. However, it was not to be, but the second paper describes his theory of well-ordered sets and ordinal numbers.\nIn\n1897\nCantor attended the first International Congress of Mathematicians in Zürich. In their lectures at the Congress\n[\n4\n]\n:-\n...\nHurwitz\nopenly expressed his great admiration of Cantor and proclaimed him as one by whom the theory of functions has been enriched.\nJacques Hadamard\nexpressed his opinion that the notions of the theory of sets were known and indispensable instruments.\nAt the Congress Cantor met\nDedekind\nand they renewed their friendship. By the time of the Congress, however, Cantor had discovered the first of the paradoxes in the theory of sets. He discovered the paradoxes while working on his survey papers of\n1895\nand\n1897\nand he wrote to\nHilbert\nin\n1896\nexplaining the paradox to him.\nBurali-Forti\ndiscovered the paradox independently and published it in\n1897\n. Cantor began a correspondence with\nDedekind\nto try to understand how to solve the problems but recurring bouts of his mental illness forced him to stop writing to\nDedekind\nin\n1899\n.\nWhenever Cantor suffered from periods of depression he tended to turn away from mathematics and turn towards philosophy and his big literary interest which was a belief that Francis Bacon wrote Shakespeare's plays. For example in his illness of\n1884\nhe had requested that he be allowed to lecture on philosophy instead of mathematics and he had begun his intense study of Elizabethan literature in attempting to prove his Bacon-Shakespeare theory. He began to publish pamphlets on the literary question in\n1896\nand\n1897\n. Extra stress was put on Cantor with the death of his mother in October\n1896\nand the death of his younger brother in January\n1899\n.\nIn October\n1899\nCantor applied for, and was granted, leave from teaching for the winter semester of\n1899\n-\n1900\n. Then on\n16\nDecember\n1899\nCantor's youngest son died. From this time on until the end of his life he fought against the mental illness of depression. He did continue to teach but also had to take leave from his teaching for a number of winter semesters, those of\n1902\n-\n03\n,\n1904\n-\n05\nand\n1907\n-\n08\n. Cantor also spent some time in sanatoria, at the times of the worst attacks of his mental illness, from\n1899\nonwards. He did continue to work and publish on his Bacon-Shakespeare theory and certainly did not give up mathematics completely. He lectured on the paradoxes of set theory to a meeting of the\nDeutsche Mathematiker-Vereinigung\nin September\n1903\nand he attended the International Congress of Mathematicians at Heidelberg in August\n1904\n.\nIn\n1905\nCantor wrote a religious work after returning home from a spell in hospital. He also corresponded with\nJourdain\non the history of set theory and his religious tract. After taking leave for much of\n1909\non the grounds of his ill health he carried out his university duties for\n1910\nand\n1911\n. It was in that year that he was delighted to receive an invitation from the University of St Andrews in Scotland to attend the\n500\nth\nanniversary of the founding of the University as a distinguished foreign scholar. The celebrations were\n12\n-\n15\nSeptember\n1911\nbut\n[\n21\n]\n:-\nDuring the visit he apparently began to behave eccentrically, talking at great length on the Bacon-Shakespeare question; then he travelled down to London for a few days.\nCantor had hoped to meet with\nRussell\nwho had just published the\nPrincipia Mathematica\n. However ill health and the news that his son had taken ill made Cantor return to Germany without seeing\nRussell\n. The following year Cantor was awarded the honorary degree of Doctor of Laws by the University of St Andrews but he was too ill to receive the degree in person.\nCantor retired in\n1913\nand spent his final years ill with little food because of the war conditions in Germany. A major event planned in Halle to mark Cantor's\n70\nth\nbirthday in\n1915\nhad to be cancelled because of the war, but a smaller event was held in his home. In June\n1917\nhe entered a sanatorium for the last time and continually wrote to his wife asking to be allowed to go home. He died of a heart attack.\nHilbert\ndescribed Cantor's work as:-\n...the finest product of mathematical genius and one of the supreme achievements of purely intellectual human activity.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}