{
  "nome_completo": "Georg Freiherr von Vega",
  "nome_curto": "Georg Vega",
  "ano_nascimento": "1754",
  "ano_morte": "1802",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vega/",
  "lugar_nascimento": "Zagorica, Ljubljana, Austrian Empire (now Slovenia)",
  "lugar_morte": "Vienna, Austria",
  "biografia": "There are different versions of\nGeorg Vega\n's name so we begin by explaining these. He was given the name Jurij Bartolomej Veha but later in life, when he was in his\n20\ns, he began using the German version of his name Georg Freiherr von Vega. The Latin version of his name is Georgius Bartholomaei Vecha and he was baptised with this Latin version of his name on\n24\nMarch\n1754\nin Moravce. His father, Jernej Veha\n(1702\n-\n1760)\n, was a poor farmer, and died when his son was six years old. Jernej Veha had married Agata Orehek in\n1737\nand they had two children, Anton\n(\nborn\n1740)\nand Helena\n(\nborn\n1743)\n. Following Agata's death in November\n1749\n, Jernej married Helena Maselj in Moravce on\n30\nApril\n1752\n. They had four children, Jera\n(\nborn\n1753)\n, Jurij\n(\nthe subject of this biography, born\n1754)\n, Marija\n(\nborn\n1756)\nand Polona\n(\nborn\n1758)\n. During this biography we will use the name Vega which, when he was about\n25\nyears old, he chose rather than the original Veha which means 'unreliable person'.\nJurij spent the years of his childhood in Zagorica where he attended primary school. Already at this young age, he showed a great love of books and a desire to study. His teachers saw that their pupil was very intelligent, but his family did not want him to continue with his education so Jurij decided that he would have to leave home and get an education without any help from his family. Consequently he entered the Jesuit secondary school in Ljubljana in\n1767\n, studying there until\n1773\nwhen he was nineteen years old. In addition to mathematics, he also studied Latin, Greek, religion, German, history, geography and science as this school. However, on\n21\nJuly\n1773\n, pope Clement XIV issued the 'Dominus ac Redemptor' disbanding the Jesuit Order. Jurij had to continue his education at the State grammar school in Ljubljana. His mathematics teacher at this school was Josef Maffei who quickly realised that the Vega had a remarkable talent for calculating. Vega showed his appreciation of Maffei's teaching when, later in life, he dedicated a book to him. He wrote:-\nI always think of the first lectures the you gave me at the grammar school at Laibach and I happily remember this time when you brought me from outside of mathematics to the inside and I gratefully dedicate this book to you.\nIn case the reference to Laibach might cause confusion, we note that this is the German name for Ljubljana. Other important teachers at this school were Gregor Schoettl, who taught Vega physics, and Gabrijel Gruber who taught him mechanics and hydraulics. After graduating from the grammar school as the best pupil in his class in\n1775\n, he became a navigational engineer, \"k.k. Navigations-Ingenieur\" in Inner Austria. It is likely that Gabrijel Gruber influenced Vega to take up this profession. While carrying out this job, he worked on the Ljubljanica, the Mura, the Drava and the Sava rivers, undertaking some projects designed by Gruber. These rivers are the main ones of Slovenia, all of which eventually flow into the Danube. The Ljubljanica is the river which flows through the city of Ljubljana.\nThe Sava flows close to Ljubljana, then through Zagreb, reaching the Danube at Belgrade, while the Drava crosses eastern Slovenia and joins the Mura before reaching the Danube. The five years Vega spent as a navigational engineer were years during which he continued to increase his knowledge of mathematics and physics by studying on his own.\nVega saw little opportunity to progress in his profession as a navigational engineer so he volunteered for military service, moving to Vienna and joining the artillery on\n7\nApril\n1780\n. He was appointed to a lectureship in mathematics at the Artillery School in Vienna on\n18\nNovember of that year. In the following year he was promoted to sub-lieutenant in the \"Garnisons-Artillerie-Distrikt\" in Vienna. He was a talented teacher and writer, with a great skill as a calculator, and it was his obvious abilities that had been the reason for his rapid promotion. He quickly realised that teaching mathematics was made much more difficult due to a lack of good textbooks. The way to rectify this, of course, was to write his own textbook and this is what Vega began working on soon after his appointment as a lecturer. He published the four-volume\nVorlesungen über die Mathematik\nbased on the lectures he gave at the Artillery School, the first volume appearing in\n1782\n.\nBefore the second volume of the textbook appeared, Vega had published the first of his famous books of tables, namely\nLogarithmische, trigonometrische, und andere zum Gebrauche der Mathematik eingerichtete Tafeln und Formeln\n(1783)\n. His name appears on the title page as \"Georg Vega, Sub-lieutenant and Lecturer in Mathematics at the k.k. Second Field Artillery Regiment\" Note that k.k. stands for 'kaiserlich/königlich' or 'kaiserlich österreichisch/königlich  böhmisch', namely 'Imperial Austrian/Royal Bohemian'. In the Preface to the work Vega explained that his aim was to produce tables which were of outstanding accuracy but available at a low price. The calculations were done with the help of the soldiers whom Vega taught, and he was so confident of their accuracy that he promised a gold ducat for every mistake found. Let us look briefly at the contents of the book. The main aim of the book was to give the common logarithms of the natural numbers from\n1\nto\n100\n,\n000\nto seven decimal places. The second table gives factors of all natural numbers from\n1\nto\n10\n,\n500\nwhich are coprime to\n2\n,\n3\nand\n5\n. The third table gives the natural logarithms of the natural numbers from\n1\nto\n1000\nto eight decimal places, and of the prime numbers from\n1000\nto\n10\n,\n000\n. The fourth table gives the integral powers of e. These tables, however, are followed by\n20\nfurther tables.\nOn\n1\nApril\n1784\n, Vega was promoted to lieutenant and, in the same year, the second volume of his textbook appeared. We should note that Vega's love of tables extended to his textbook, for this second volume contains trigonometric tables. The year\n1787\nwas particularly eventful for Vega. He was appointed as professor of mathematics in the \"Bombardierkorps\" on\n1\nMarch and in this year he published\nPraktische Anweisung zum Bombenwerfen\n. This was also the year in which the\n33\n-year old Vega married the\n16\n-year old Josefa Swoboda. She was the daughter of a Czech nobleman from Ceské Budejovice. The year\n1787\nwas also significant in the history of the region for the wars in which Vega would participate over the following years began in that year. The background to these wars goes back to\n1781\nwhen Joseph II of Austria negotiate a pact with Catherine the Great of Russia. Joseph's aim had been to gain military support in case of a conflict with Prussia but, after Russia provoked the Ottoman Empire, they declared war on Russia in\n1787\n. Austria was unwillingly dragged into the conflict through the\n1781\npact and when the Turks attacked Austria in\n1788\n, Vega made it clear that he wanted to participate actively in the fighting. Certainly someone in his position would have been expected to remain in Vienna, but Vega was keen to apply his theoretical expertise in military applications of mathematics to practical situations. He was assigned to serve under Field-Marshal Ernst Gideon von Laudon\n(1717\n-\n1790)\nin an effort to push the Turks back. Von Laudon had long been retired but was recalled to lead an attack on Belgrade which was held by the Turks. The Austrian forces laid siege to Belgrade on\n15\nSeptember\n1789\nand Vega commanded mortar batteries, a task that he was specially well equipped to do since one of the topics of his mathematical research had been the study of heavy mortars. The fighting over the following three weeks was fierce but his fellow soldiers marvelled that Vega would sit calculating logarithms while cannonballs flew over his head. The effective use of the heavy mortars, whose angle of elevation had been corrected by Vega, was a major factor in the Austrians taking Belgrade on\n8\nOctober\n1789\n.\nVega's calculating abilities, often carried on during military campaigns, is clear in his remarkable achievement of calculating π to\n140\nplaces, a record which stood for over\n50\nyears. This appears in a paper which he published in\n1789\n, the year he was involved in fighting the Turks. Tomaz Pisanski discusses methods for calculating decimal digits of π in\n[\n1\n]\n. He writes about Vega's achievement:-\nWe mention the contribution of the Slovenian mathematician Jurij Vega ... not because he worked harder than his contemporaries, but because he had a better algorithm.\nWhat was this better algorithm? He used two formulas, basically using one as a check against the other, namely\nπ\n4\n=\n5\narctan\n⁡\n(\n1\n7\n)\n+\n2\narctan\n⁡\n(\n3\n79\n)\n\\Large\\frac{\\pi}{4}\\normalsize  = 5 \\arctan(\\large\\frac{1}{7}\\normalsize ) + 2 \\arctan(\\large\\frac{3}{79}\\normalsize )\n4\nπ\n​\n=\n5\narctan\n(\n7\n1\n​\n)\n+\n2\narctan\n(\n7\n9\n3\n​\n)\nand\nπ\n4\n=\n2\narctan\n⁡\n(\n1\n3\n)\n+\narctan\n⁡\n(\n1\n7\n)\n\\Large\\frac{\\pi}{4}\\normalsize  = 2 \\arctan(\\large\\frac{1}{3}\\normalsize ) + \\arctan(\\large\\frac{1}{7}\\normalsize )\n4\nπ\n​\n=\n2\narctan\n(\n3\n1\n​\n)\n+\narctan\n(\n7\n1\n​\n)\n.\nThe fighting between Austria and the Turks ended when a truce was signed on\n27\nJuly\n1790\n, but it was over a year later that a treaty was signed, namely the Treaty of Sistova on\n4\nAugust\n1791\n. After this treaty had been signed, Vega returned to his teaching position in Vienna. Vega's son Henrik was born in\n1791\nand, on\n20\nApril\n1792\n, the War of the First Coalition began in which Austria was now fighting the French. Vega was involved in many battles over the following years but also had periods when he was able to concentrate on his mathematics. The year\n1753\n, in which Austria, Prussia, Spain, the United Provinces, and Great Britain allied against France, was a particularly eventful one for Vega. In April\n1793\nhe was promoted to major and in September of that year his daughter Maria Tereza was born. He had been attached to the Imperial Army of the Rhine under the command Dagobert Sigismund, Count Wurmser and he was part of that army which, after around four weeks of fighting, broke through the Lines of Wissembourg on\n13\nOctober\n1793\n. These French defensive lines consisted of a series of fortifications built much earlier to protect Alsace from an attack from the east. Vega was also part of the Austrian force that captured Fort Louis from the French on\n10\nNovember. Despite these victories, the French also won victories recovering their losses. Vega returned to Vienna at various stages during the fighting, where he was able to continue to work on his mathematics which he continued to publish.\nLogarithmisch trigonometrisches Handbuch\nⓉ\n(\nHandbook of trigonometric logarithmics\n)\nwas published in\n1793\nin both German and Latin. This book of\n7\n-figure logarithm tables contained tables of the logarithms of the natural numbers from\n1\nto\n100\n,\n000\nand the logarithms of the trigonometric functions. This remarkable work, which went through over\n100\neditions, contained more than just tables, for in it Vega explained the theory of logarithms in the Preface, and then went on to give useful examples of how the tables could be used. In\n1794\nhe went to Stuttgart where he spent two months and, in the same year, he was elected to the Royal Society of Sciences and Humanities in Göttingen. The\n10\n-figure tables\nThesaurus logarithmorum completus\nⓉ\n(\nA complete thesaurus of logarithms\n)\n, based on\nAdriaan Vlacq\n's tables, appeared in\n1794\nand again this was a remarkable work with the\n90\nth\nedition appearing in\n1924\n.\nVega continued to participate in the fighting which was part of the French Revolutionary Wars. He fought in the Battle of Mannheim in\n1795\nand was responsible for the introduction of a new design of heavy mortar with a greatly increased range. He also fought in the Battle of Mainz on\n29\nOctober\n1795\n, a battle between French and Austrian troops which resulted in an Austrian victory. His third child, Franc, was born in February\n1796\nand, on\n11\nMay, he was awarded the Ritterkreuz des Maria Theresien Ordens, the Knight's Cross of the Order of Maria Theresa. Vega was again present when the Austrian forces besieged the fort at Kehl later that year in October. The Siege of Kehl lasted until January\n1797\nwhen the French defenders capitulated and withdrew. While still on active duty, he wrote the Preface for a second edition of\nLogarithmische, trigonometrische, und andere zum Gebrauche der Mathematik eingerichtete Tafeln und Formeln\nⓉ\n(\nlogarithmic, trigonometric, and other established for the use of mathematics tables and formulas\n)\nin February\n1797\n. In this Preface he explained that, although the first edition had been published in Vienna, it was impossible to get the second edition published there so he was forced to find a publisher abroad. This second edition was published in Leipzig. Also in this Preface he said that he planned to publish another three books of mathematical tables. The first would be aimed at beginners, the second at established mathematicians, and the third at astronomers, navigators and all others who were involved in difficult computations. Vega was able to spend more time on his mathematics after the treaty of Campo Formido of\n18\nOctober\n1797\nended hostilities, with the Austrians accepting defeat by the French under Napoleon Bonaparte. Over the next years he wrote a number of research papers as well as continuing to work on new editions of his tables. For example, he published the paper\nMathematische Betrachtungen über eine sich um eine unbewegliche Achse gleichförmig drehende feste Kugel\nⓉ\n(\nMathematical reflections on a solid ball rotating around a fixed axis\n)\nin\n1798\n. The third volume of his textbook\nVorlesungen über die Mathematik\nⓉ\n(\nLectures on mathematics\n)\n, which he had completed before he joined the military campaigns, had been published in\n1788\nbut now he was able to work on a fourth volume which was published in\n1800\n. In the same year he published\nVersuch über die Enthüllung eines Geheimnisses in der bekannten Lehre der allgemeinen Gravitation\nⓉ\n(\nEssay on the revelation of a secret in the famous doctrine of universal gravitation\n)\n. However, July\n1800\nwas a tragic month for Vega for his wife Josefa died on the\n7\nth\nand then, less than two weeks later, his daughter Maria Tereza died.\nOn\n22\nAugust\n1800\nVega was given the hereditary title of baron, including the right to his own coat of arms. Perhaps at this point we should note other honours which had been given to Vega. He was elected to the Academy of Applied Sciences in Erfurt, the Royal Bohemian Society of Learning in Prague, and the\nBerlin Academy of Sciences\n. In early\n1802\nVega was promoted to lieutenant colonel. On\n11\nSeptember\n1802\nhe sent his last work to a publisher in Vienna and, a few days later on\n17\nSeptember, he was reported missing. A search was unsuccessful until his body was found in the Danube at Nussdorf near Vienna on\n26\nSeptember. The official cause of death was an accident but some suspect he committed suicide while others suspect that he was murdered. A common theory that he was murdered by a miller after attempting to buy his horse appears to have no factual foundation.\nThe picture displayed is from a Slovenian\n50\nTolar bank note issued in his honour. Three commemorative coins were issued by Slovenia to honour the\n250\nth\nanniversary of his birth in\n2004\n. A Slovenian stamp has also been issued to honour him. The asteroid\n14966\nJurijvega, discovered on\n30\nJuly\n1997\n, has been named for him as has a street in Vienna.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}