{
  "nome_completo": "George Lawson",
  "nome_curto": "George Lawson",
  "ano_nascimento": "1870",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lawson/",
  "lugar_nascimento": "Culross, Fife, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "George Lawson\n's mother was Janet Spittal and his father was George Lawson, a baker from Culross. Lawson first matriculated at the University of St Andrews in\n1887\n. In session\n1887\n-\n88\nhe took the classes Greek\n2\n, Latin\n2\n, and Mathematics\n1\n; in\n1888\n-\n89\nhe took Logic, English Literature, and Mathematics\n2\n; in session\n1889\n-\n90\nhe took Natural Philosophy, Moral Philosophy and Political Economy, English Literature, Advanced Metaphysics, and Mathematics\n3\n; in session\n1890\n-\n91\nhe took Natural Philosophy, Chemistry, Natural History, and Physiology.\nAt university Lawson showed great talent and was awarded the Carstairs Prize\n(\nawarded to the best mathematics student in each of the three years\n)\nin both\n1889\nand\n1890\n, the Millar Prize\n(\nawarded to the best student in each year\n)\nin\n1890\n, the Gray Prize\n(\nawarded for an essay on a prescribed subject\n)\nin both\n1891\nand\n1892\n, and the Arnott Prize\n(\nawarded on examination in Natural Philosophy at the end of the session\n)\nin\n1891\n. He graduated with an M.A. with First Class Honours in Mathematics on\n30\nApril\n1894\n. In fact Lawson was employed by the University of St Andrews as an Assistant to the Professor of Mathematics before the award of his degree. He was appointed to the post in\n1892\nand continued to fill that role until\n1900\n.\nIn\n1900\nLawson went to Edinburgh to take up the post of Mathematics Master at George Watson's College. He then became Rector of Selkirk High School before, in\n1904\n, becoming Rector of Waid Academy in Anstruther, Fife. He held this post until he retired in\n1931\n. After retiring he moved to Edinburgh, living at\n49\nMerchiston Crescent. From\n1923\nonwards he was a member of the Court of the University of St Andrews.\nLawson was an active member of the\nEdinburgh Mathematical Society\njoining the Society in February\n1897\nwhile he was Assistant to the Professor of Mathematics at the University of St Andrews. He was honoured by the Society when elected President for session\n1937\n-\n38\n. He actively participated in the Society over a long period and we give examples to illustrate this. In a meeting held on Friday\n9\nMarch\n1923\na discussion on the teaching of elementary geometry was opened by Mr A J Tressland, M.A., F.R.S.E., of the Edinburgh Academy, who advocated the adoption of the sequence in geometrical teaching contained in the schedule recently issued by a special committee of the Assistant-Masters' Association. In the subsequent discussion Lawson took an active part. At the\nEdinburgh Mathematical Society\n's\n1938\nSt Andrews Colloquium, held during Lawson's presidency of the Society, he submitted for debate a paper on \"Neglect of Form and Law in School Algebra\" on the Saturday night. The following is a report of his paper as it appears in\nThe Scotsman\non Monday\n11\nJuly\n1938\n:-\n[\nLawson\n]\nsaid that by the\nBritish Association\npapers last year, it was indicated that algebra had, during the last\n30\nyears, developed on the lines of Sir Percy Nunn's classical exposition. That same development was indicated also in\n1935\nby the\nMathematical Association\n's special pamphlet on the teaching of algebra in schools. In criticising that development, Mr Lawson referred to another development which seemed possible\n30\nyears ago, and said it was based largely on a book quoted by Sir Percy Nunn himself - namely, that of Barnard and Child. Mr Lawson took up the position that algebra at that time took the wrong road, and he advocated a modification of the Barnard and Child position.\nOn Friday\n4\nNovember\n1938\nLawson gave his presidential address to the\nEdinburgh Mathematical Society\n. This address was\n(\nand still is\n)\ngiven at the first meeting of the new session when the retiring President hands over to the new President. Lawson again chose the teaching of algebra as his theme:-\nThe Scotsman - Saturday,\n5\nth\nNovember\n1938\nTHE TEACHING OF ALGEBRA\nMr G Lawson, the retiring president, delivered an address on \"Robots in First Year Algebra.\" The\nMathematical Association\n's report on School Algebra, published in\n1933\n, and the\nBritish Association\npapers on School Algebra\n(1937)\nwere taken as showing the present position with regard to the teaching of elementary algebra. In this field, the lecturer said that there were three unsatisfactory features of the present system, the neglect of form, which he regarded as the fundamental thing in algebra; defects in the treatment of the laws of formal algebra; and the difficulties experienced in applying the now commonly accepted treatment of negative numbers. Mr Lawson gave an account of his method of introducing the idea of negative numbers to his pupils, and criticised some of the methods used in the text-books. His own method, which he published ten years ago, was really an application of the modern theory of number pairs. In the subsequent discussion, in which a number of members of the teaching profession took part, most attention was directed to the question of negative numbers, and the lecturer's views met with some criticism, to which he replied.\nAn obituary, written by\nPeter Comrie\n, was published in the\nProceedings of the Edinburgh Mathematical Society\nand is at\nTHIS LINK\n.\nOn Monday\n1\nAugust\n1938\na letter by George Lawson, written during his time as President of the\nEdinburgh Mathematical Society\n, concerning Merchiston Castle was published in\nThe Scotsman\n. The text of this\n(\nbeautifully written\n)\nletter is at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}