{
  "nome_completo": "George Green",
  "nome_curto": "George Green",
  "ano_nascimento": "1793",
  "ano_morte": "1841",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Green/",
  "lugar_nascimento": "Sneinton, Nottingham, England",
  "lugar_morte": "Sneinton, Nottingham, England",
  "biografia": "George Green\n's father, also called George Green, was a baker in Nottingham. After serving his apprenticeship to a baker in Nottingham George Green Senior had married Sarah Butler\n(\nthe mathematician's mother\n)\nin\n1791\nand Sarah's father had helped George Green Senior to buy his own bakery in Wheatsheaf Yard in Nottingham. George and Sarah had one son and one daughter. The son was George Green, the mathematician and, although the date of his birth is unknown, he was baptised on\n14\nJuly\n1793\n. His sister Ann was born two years later and the family were reasonably prosperous with the bakery business being successful.\nIn September\n1800\nthere were riots in England when food prices were high and people did not have enough to eat. The corn dealers and bakers were blamed for keeping back food until the prices rose even higher and crowds of people broke into bakers and tried to steal food. George Green's bakery was attacked and the he wrote a letter to the mayor asking for protection\n(\nthe spelling and capital letters follow Green's letter\n)\n:-\nSept\n1\nth\n1800\nTo the Right Worshipfull the Mayor and his Bretheren haveing all my Windows Broke Last night and being much thretend tonight with more mischief being done to me such as entering my House therefore Gentlemen I most Humbly crave your protection such as the Berer of this can explain to you from your Humble servant George Green.\nYoung George Green went to Robert Goodacre's school in\n1801\n, the year after the riots. He was only eight years old when he began his schooling and only nine when he left the school in midsummer\n1802\n. His only schooling, therefore, consisted of four terms but, despite the short time he spent there, since Robert Goodacre's was the best and most expensive school in Nottingham, George was taught much in the four terms. George's sister Ann went on to marry William Tomlin and he was to write on George Green's life after George died. Of his time at Robert Goodacre's school, Tomlin writes:-\n... he pursued with undeviating constancy the same as in his mature years an intense application to mathematics. ... his profound knowledge in mathematics soon exceeded that of Robert Goodacre.\nIt is hard to see quite why Green became interested in mathematics at this age or, for that matter, whether he had access to mathematical works of any type. However, in\n1802\n, Green left school as a nine year old boy to work in his father's bakery business. He probably learnt a little of Latin, Greek and French at school but it is hard to see how even a bright eight year old boy in a good school could learn more than the briefest of introductions to these subjects.\nGeorge Green Senior ran a successful bakery business and he was able to buy several houses in Nottingham. In\n1807\nhe bought a plot of land at Sneinton, just outside Nottingham. The sale was made by auction at\n26\nFebruary\n1807\nand in the advertisement for the sale the plot is described as:-\nA freehold estate, tythe-free, and the Land Tax redeemed, situate at Snenton, near Nottingham; consisting of excellent pasture land, and affording for Building upon one of the first Situations in the Kingdom, commanding most extensive Views of the River Trent, Trent Vale, Clifton Woods, Colwick, Belvoir Castle, and a rich and highly cultivated Country, diversified by numberless other picturesque objects...\nHaving bought the land, he built on it a brick wind corn-mill, clearly a useful thing for a baker to own. The mill stood\n16\nmetres high and was one of the first two brick mills in the county of Nottinghamshire. Green's father employed a manager to run the mill, and Green himself worked there. In\n1817\nGreen Senior built a family house beside the mill and Green together with his mother and father went to live there.\n[\nThe mill has been restored and we strongly recommend anyone who is visiting Nottingam to pay a visit.\n]\nGreen's sister Ann did not move to Sneinton as she had married William Tomlin in\n1816\nand they were living in a fashionable part of Nottingham.\nGreen must have continued working on mathematics through the years that he worked at his father's mill. However, we have no knowledge whatsoever of how he could have become acquainted with the most advanced mathematics of his day, which indeed is what happened. In\n[\n3\n]\nCannell\ndiscusses whether there were any mathematicians living in Nottingham who could have given Green access to advanced French mathematical ideas. She comes up with only one possible candidate, John Toplis who was a mathematics graduate of Queens' College Cambridge.\nToplis had become unhappy with the mathematics being taught at Cambridge and had tried to influence others to learn more of the mathematics being developed in France. He translated the first volume of\nLaplace\n's\nMécanique céleste\ninto English and he published this in Nottingham in\n1814\n. At this time he was the headmaster of the Free Grammar School in Nottingham, and he remained there until\n1819\nwhen he returned to Cambridge as Dean of Queens' College. Certainly Green could have known Toplis since, before he moved to the new family home at the mill in\n1817\n, Green was living in Goosegate in Nottingham just one street away from the Free Grammar School where Toplis lived at that time. As\nCannell\nwrites\n[\n3\n]\n:-\nThere is no proof that John Toplis was George Green's mentor but circumstantial evidence suggests strongly that he was guiding him in the new mathematics and helping him with the French he undoubtedly acquired in order to read the works of other French mathematicians, such as\nLacroix\n,\nPoisson\nand\nBiot\n.\nThe manager of Green's mill was William Smith and he had a daughter Jane Smith. George Green never married Jane Smith but together they had seven children. His relationship with her must have started in\n1823\nor earlier as their first child was born in\n1824\n. Certainly in\n1823\nGreen joined the Nottingham Subscription Library which was situated in Bromley House. This was an important event in Green's scientific development as it gave him access to a few scientific works, but perhaps most importantly of all, it gave him access to the\nTransactions of the Royal Society of London\n. In this publication Green could read some of the latest mathematical work and it also reported on works published in other countries.\nGreen studied mathematics on the top floor of the mill, entirely on his own. The years between\n1823\nand\n1828\nwere not easy for Green, and certainly not the most conducive to study. As well as having a full time job in the mill, two daughters were born, the one in\n1824\nmentioned above, and a second in\n1827\n. Between these two events his mother had died in\n1825\nand his father was to die in\n1829\n. Yet despite the difficult circumstances and despite his flimsy mathematical background, Green published one of the most important mathematical works of all time in\n1828\n.\nOn\n14\nDecember\n1827\nhe published an advertisement in the Nottingham review:-\nIn the Press, and shortly will be published, by subscription, An Essay on the Application of Mathematical Analysis to the Theories of Electricity and Magnetism. By George Green. Dedicated\n(\nby permission\n)\n, to his Grace the Duke of Newcastle, K.G. Price to Subscribers,\n7\ns.\n6\nd. The Names of Subscribers will be received at the Booksellers, and at the Library, Bromley House.\nThe\nEssay\nwas published in March\n1828\nand there were\n51\nsubscribers, most of whom were members of the Nottingham Subscription Library and paid\n7\ns.\n6\nd. for a work of which they could hardly have understood a word. In\n[\n1\n]\ndetails are given of Green's preface:-\nIn the preface Green indicated that his \"limited sources of information\" prevented his giving a proper historical sketch of the mathematical theory of electricity, and indeed, he cites few sources. Among them are Cavendish's single-fluid theoretical study of electricity of\n1771\n, two memoirs by\nPoisson\nof\n1812\non surface electricity and three on magnetism\n(1821\n-\n1823)\n, and contributions by\nArago\n,\nLaplace\n,\nFourier\n,\nCauchy\n, and T Young. The preface concludes with a request that the work be read with indulgence, in view of the limitations of the author's education.\nAlso in\n[\n1\n]\nsome details are given of the contents this important publication:-\nThe Essay begins with introductory observations emphasising the central role of the\npotential function\n. Green coined the term 'potential' to denote the results obtained by adding the masses of all the particles of a system, each divided by its distance from a given point. The general properties of the potential function are subsequently developed and applied to electricity and magnetism. The formula connecting surface and volume integrals, now known as Green's theorem, was introduced in the work, as was \"Green's function\" the concept now extensively used in the solution of\npartial differential equations\n.\nThe Essay may have been of great importance but this was not realised by anyone at the time of its publication. Nobody with sufficient mathematical skills to appreciate its importance had seen the work. Green carried on working his mill and, in\n1829\non the death of his father, he became solely responsible for the family business. His third child, and first son, was born in\n1829\n. Things changed however, when he made contact with Sir Edward Bromhead.\nSir Edward Bromhead was one of the subscribers to the\nEssay\nand he had written immediately to Green offering to send any further papers to the\nRoyal Society of London\n, the\nRoyal Society of Edinburgh\nor the Cambridge Philosophical Society. Bromhead had studied mathematics at Cambridge and had been a member of the Analytic Society. In fact what may have been the last meeting of that Society had been held at Thurlby Hall on\n20\nDecember\n1817\nwith Bromhead in the chair. Although Bromhead was not able to appreciate the high importance of Green's essay, he did realise that Green was a very good mathematician. Green took Bromhead's offer as mere politeness and did not respond until January\n1830\nwhen a friend persuaded him to follow up Bromhead's letter.\nFor three years Green and Bromhead met at Thurlby Hall and during this time Green wrote three further papers. Two on electricity were sent by Bromhead to the Cambridge Philosophical Society where they were published, one in\n1833\nand the other in\n1834\n. The third was on hydrodynamics and this work was published by the\nRoyal Society of Edinburgh\n(\nof which Bromhead was a Fellow\n)\nin\n1836\n. Bromhead was a good person for Green to become friendly with since he had good contacts with mathematicians at Cambridge. Bromhead's close friends there included\nCharles Babbage\n,\nJohn Herschel\nand\nGeorge Peacock\nand he suggested to Green in April\n1833\nthat he should consider studying mathematics at Cambridge. In June\n1833\nBromhead went to Cambridge for a reunion and asked Green to go with him. However Green certainly did not realise the importance of his work. He wrote to Bromhead:-\nYou were kind enough to mention a journey to Cambridge on June\n24\nth\nto see your friends\nHerschel\n,\nBabbage\nand others who constitute the Chivalry of British Science. Being as yet only a beginner I think I have no right to go there and must defer the pleasure until I shall have become tolerably respectable as a man of science should that day ever arrive.\nHowever Green took Bromhead's advice, left his mill and became an undergraduate at Cambridge in October\n1833\nat the age of\n40\n. He was admitted to Caius College where Bromhead had studied. He wrote to Bromhead in May\n1834\n:-\nI am very happy here and am I fear too much pleased with Cambridge. This takes me in some measure from those pursuits which ought to be my proper business, but I hope on my return to lay aside my freshnesses and become a regular Second Year Man.\nThe mathematics examinations did not prove hard for Green, but the other topics such as Latin and Greek proved much harder for someone with only four terms of school education. He graduated as fourth\nWrangler\nin\n1837\n, the second Wrangler that year being\nSylvester\n. The following quote appears in\n[\n16\n]\n:-\nGreen and\nSylvester\nwere the first men of the year, but Green's want of familiarity with ordinary boy's mathematics prevented him from coming to the top in a time race.\nAfter graduating he remained at Cambridge and worked on his own mathematics. In\n1838\nand\n1839\nhe had two papers on hydrodynamics\n(\nin particular wave motion in canals\n)\n, two papers on reflection and\nrefraction\nof light and two papers on reflection and refraction of sound published by Cambridge Philosophical Society.\nBishop Harvey Goodwin was an undergraduate at Cambridge during these years following Green's graduation. He wrote of Green\n[\n3\n]\n:-\nHe stood head and shoulders above all his contemporaries inside and outside the University.\nGoodwin is also quoted in\n[\n16\n]\n:-\nI was twice examined by Green. He set the problem paper in two out of the three of my college examinations... He never assisted as far as I know in lectures. This might be owing to his habits of life. His manner in the examination room was gentle and pleasant.\nGreen was elected to a Perse fellowship on\n31\nOctober\n1839\n. This of course was possible since he did satisfy the condition of not being married, and having six children, which he had at this time, was not relevant. His time at Cambridge after being elected to the fellowship was very short indeed. By May\n1840\nhe had returned to Nottingham suffering from ill health. A few weeks later his seventh child was born. Green clearly felt that his illness was very serious and in July\n1840\nhe wrote a will in which he states that his health was poor but no details of the illness are given. However it would appear that he still hoped to return to Cambridge since he describes himself as:-\n... late of Sneinton in the County of Nottingham and now of Caius College Cambridge, Fellow of such College.\nHis will left all his property in Nottingham to Jane while the property at Sneinton was left to his seven children.\nWe do know that Green died in the house where Jane Smith and his seven children lived. Jane reported his death and was with Green when he died. Rather remarkably, this is the only record of Green living in the same house as Jane Smith and his children.\nThe Nottingham Review published a short obituary on\n11\nJune which showed they knew little of his life and less of the importance of his work:-\n... we believe he was the son of a miller, residing near Nottingham, but having a taste for study, he applied his gifted mind to the science of mathematics, in which he made a rapid progress. In Sir Edward Ffrench Bromhead, Bart., he found a warm friend, and to his influence he owed much, while studying at Cambridge. Had his life been prolonged, he might have stood eminently high as a mathematician.\nOf course, Green never knew the importance of his mathematics. That was only realised after his death\n[\n1\n]\n:-\nOnly a few weeks before Green's death,\nWilliam Thomson\nhad been admitted to St Peter's College, Cambridge. In a paper by\nRobert Murphy\npublished in the Transactions of the Cambridge Philosophical Society, Thomson noticed a reference to Green's Essay, although\nMurphy\ndid not mention any of his other works published in that journal.\nThomson\nwas unable to find a copy of the Essay until, just after receiving his degree in January\n1845\n, his coach,\nWilliam Hopkins\n, gave him three copies. Sixty years later\nThomson\nrecalled his excitement and that of\nLiouville\nand\nSturm\n, to whom he showed the work in Paris in the summer of\n1845\n. After returning to Cambridge,\nThomson\nwas responsible for republishing the work, with an introduction\n(1850\n-\n54)\n. Through\nThomson\n,\nMaxwell\n, and others, the general mathematical theory of potential developed by an obscure, self-taught miller's son would lead to the mathematical theories of electricity underlying twentieth-century industry.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}