{
  "nome_completo": "George Cunliffe McVittie",
  "nome_curto": "George McVittie",
  "ano_nascimento": "1904",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McVittie/",
  "lugar_nascimento": "Smyrna (now Izmir), Turkey",
  "lugar_morte": "Canterbury, Kent, England",
  "biografia": "George McVittie\nwas the son of Francis Skinnner McVittie\n(\nborn Blackpool, Lancashire, England,\n1872\n, died Purley, Surrey, England,\n1950)\nand Emily Caroline Weber\n(\nborn Smyrna, Turkey,\n1877\n, died West Buckland, Devon, England,\n1942)\n. Francis McVittie went to Turkey in\n1890\nas a secretary of the firm McAndrews & Forbes which distributed liquorice and chocolate. The firm exported liquorice from Smyrna in Turkey where Francis McVittie worked. He married Emily Weber in the village of Boudjah near Smyrna in\n1903\n. Emily had a German father who taught at a girls' school in Smyrna, and a Scottish mother. Francis and Emily McVittie had three children, George Cunliffe McVittie\n(1904\n-\n1988)\n, the subject of this biography, Wilfred Wolters McVittie\n(1906\n-\n1980)\n, and Dora Elsie McVittie\n(1908\n-\n1999)\n, who married John C Crowley. Dora Crowley is the author of\n[\n2\n]\n.\nIn\n1905\nMcAndrews & Forbes was taken over by an American firm and Francis McVittie lost his job. The family remained in Smyrna but over the following couple of years they were poor. In\n1907\n, however, he was employed as an agent for an American firm to import desks and he began to sell goods from his own shop. By\n1914\nthis was almost a department store selling a wide variety of goods. The family did not live in Smyrna itself, but in the nearby village of Boudjah. George's sister Dora describes it in\n[\n2\n]\n:-\nWe had a lovely garden in an olive grove of very old trees. My mother was a very keen gardener. In the corner of our garden was the Police Station.\nNone of the three McVittie children had any formal schooling. Up to\n1914\n, significant because of the outbreak of World War I, George was educated by a number of governesses based on the French model of education. In fact he could be considered as both a native English speaker and a native French speaker as he was equally fluent in both languages.\nThings changed in\n1914\nwith the outbreak of World War I. The McVittie family had both British and German connections, for example the brother of George's mother, Theodore Weber, acted as German Consul in Smyrna, causing difficulties for the British members of the family. George's sister Dora writes in\n[\n2\n]\n:-\n... during the war the police often used to beat Greeks who had tried to avoid military service. These poor men used to howl loudly and our mother used to send us out of hearing to the other end of the garden. On one occasion a prisoner dug through the wall of the Police Station and escaped into our garden at night and my father, hearing the noise of this man being chased, went into the garden holding an oil lamp and was surrounded by soldiers pointing guns at him. However he managed to explain and they allowed him to go back, very frightened, into the house. Periodically the police used to catch the British at the railway station as they were enemy aliens and imprison them. My father used to talk himself out of it by saying that he was chief of the fire brigade in Smyrna\n(\nwhich was true\n)\nand that if they put him in prison the town would certainly burn down one day. So they would let him go but he was afraid of being caught on the return journey so he would go and hide on the roof of the Spartali's magnificent house on the quay. The Spartalis were an elderly rich Armenian couple. They had a house in Smyrna and one in Boudjah with a huge garden full of greenhouses, ponds, statues, and of course, vineyards.\nDuring the war George's education continued with private tutors, but now they were English men whom George's father was helping out financially. After the war, however, he was taught by an excellent tutor Lucius George Pownall Fry\n(1881\n-\n1935)\n. Fry had been born on\n15\nMay\n1881\nin Upper Edmonton, Middlesex, England and studied the mathematical tripos at the University of Cambridge. He was ordained a priest in\n1909\n. He was Assistant Chaplain of St Mark's, Alexandria,\n1908\n-\n19\n, then Chaplain of St John's, Smyrna,\n1919\n-\n21\nand of St Mary Magdalene, Bournabat,\n1919\n-\n22\n. He taught McVittie, who went by train from Boudjah to Smyrna for the lessons, from January\n1920\nto March\n1922\n. Fry arranged for McVittie to take the University of Cambridge Senior Local Examination in Smyrna in December\n1921\n. He passed English, English history, Greek, French, Mathematics and Advanced Mathematics, and obtained a distinction in French and Mathematics.\nWe should note that during his time in Smyrna, McVittie had interests in mathematics and astronomy that went beyond the schooling he was receiving. He read\nRobert Ball\n's\nThe Story of the Heavens\n, and, realising that one required a good knowledge of mathematics to understand astronomy, had his father import books for him on analytical geometry and conic sections. His father also bought him a\n3\n-inch telescope from the British Navy stores in the Aegean Islands which he set up in his bedroom window.\nIn the spring of\n1922\n, McVittie began working as a secretary for the British Chamber of Commerce in Smyrna. He learnt useful skills like typing and shorthand but also continued to study mathematics on his own and tried to read a popular book about Einstein's theory of relativity, but found it incomprehensible. McVittie wanted to study mathematics at university but his father insisted that he must take a \"practical subject\". They agreed to compromise on McVittie applying to the University of Edinburgh to study Civil Engineering. He was accepted and the whole family set off in the summer of\n1922\nto have a holiday in Britain. They intended to leave McVittie in Edinburgh then after their holiday, to return to Smyrna.\nAll went well at first and lodgings for McVittie were found in Edinburgh after which the rest of the family went to Birkenhead near Liverpool to stay for a while with a friend before returning to Smyrna. The Greco-Turkish War had followed World War I and, in\n1921\nGreek troops began taking control of parts of Anatolia. Turkish troops advanced on Smyrna taking control in September\n1922\n. On\n13\nSeptember fires were started in Smyrna and much of the city was destroyed. The fires were started by arsonists but whether they were Greek or Turkish is still quite hotly disputed. The store that Francis McVittie owned in Smyrna was burnt to the ground. The McVittie house in the village of Boudjah was not destroyed, but its contents were all stolen. The family were still in Birkenhead when\n(\nDora writes\n)\n[\n2\n]\n:-\n... we were horrified to see posters everywhere \"Smyrna Burning\". Gradually the news came through that my father's store had burnt and that he was jobless and ruined.\nThe family were left with hardly any possessions and never returned to Smyrna. Francis McVittie was no longer able to give his son the financial support he needed for his university studies so George McVittie, who had not yet started his Civil Engineering course in Edinburgh, moved to Birkenhead to join his father. Soon Francis McVittie was appointed as secretary to the Relief Committee run by the Imperial War Relief Fund which was set up to help British refugees from Smyrna. The family left Birkenhead and moved to the south of England. George worked as his father's assistant in London, travelling between London and Caterham where his family had by early\n1923\nset up home. The work undertaken by George and his father, led them to meet Sir John Cowan\n(1844\n-\n1929)\n, chairman of Redpath Brown & Co. Ltd. of Edinburgh. Cowan was keen that George should return to his university studies and he and some of his friends put together a fund to support him. George wanted to take the M.A. degree with honours in mathematics and natural philosophy\n(\nphysics\n)\nbut the fund would hardly cover four years. He studied hard in the evenings and on the train journeys to his work in London, and then sat the Edinburgh University Entrance Bursary competition. He won a\n3\n-year Bruce of Grangehill Bursary and began his studies in Edinburgh in October\n1923\n. After the first year examinations be was awarded an additional bursary, a Spence Bursary, so his university finances were secured.\nAt Edinburgh, McVittie was strongly influenced by his lecturers\nE T Whittaker\n,\nC G Darwin\nand Norman Kemp Smith\n(1872\n-\n1958)\n, the Professor of Logic and Metaphysics at the University of Edinburgh. McVittie wrote\n[\n20\n]\n:-\nWhittaker\nhad a highly polished lecturing style and persuaded his audience that every topic was easily comprehensible. A subsequent reading of one's notes showed that this was not so, at least, not until much further work was done.\nDarwin\n's lecturing style was untidy but his asides on the nature of applied mathematics - and of applied mathematicians - and his obvious enthusiasm for the subject intrigued me. I often came away from one of his lectures having understood very little but determined to find out what my chaotic notes meant and what it was that aroused such interest in this man.\nHe also became friendly with\nE T Copson\n, who was a young lecturer but only three years older than McVittie.\nCopson\nand McVittie took part in the students' social activities such as the Debates Union and the Physical Society.\nIn his fourth year, McVittie took a course on relativity given by\nWhittaker\n. This was a topic in which he would later become a world-leading expert. He graduated in\n1927\nwith an M.A., and was awarded the Charles Maclaren Mathematics Scholarship for three years and the Nicol Foundation for one year. This latter award required him to do some teaching in the Edinburgh physics department so he spent the first year of his postgraduate studies in Edinburgh with\nWhittaker\nas his advisor. He continuing his doctoral studies at Christ's College Cambridge with\nArthur Eddington\nas his advisor. He matriculated at Cambridge in\n1928\nand began research. He did not find his time in Cambridge as pleasant as he had his time in Edinburgh\n[\n20\n]\n:-\nI cannot claim to have fitted well into Cambridge life after the free and easy existence as a Scottish student in Edinburgh. It was also a strange experience to work under\nEddington\n. In Edinburgh I had enjoyed\nWhittaker\n's urbane geniality and\nDarwin\n's bluff and hearty manner; neither had prepared me for\nEddington\n's remoteness and unapproachability.\nMcVittie studied unified field theory and published two papers\nOn Einstein's unified field theory\n(1929)\n, and\nOn Levi-Civita's modification of Einstein's Unified Field Theory\n(1929)\n. The Abstract of the first of these begins:-\nIn a recent paper Prof\nA Einstein\nhas proposed equations determining a field containing both gravitational and electromagnetic phenomena, the underlying geometry being of a type which admits the possibility of giving any arbitrary vector in the field a displacement which conserves parallelism at a distance. The purpose of the present paper is to try and obtain light on the new theory by applying it to a special case in which an exact solution of the usual gravitational and electromagnetic equations of the relatively theory is known.\nThe second paper begins as follows:-\nProf\nLevi-Civita\nhas modified Prof\nEinstein\n's Unified Field Theory of gravitation and electromagnetism by discarding the concept of \"parallelism at a distance with respect to\n4\northogonal vectors of reference,\" which is the basis of the latter's theory, and obtaining a complete description of gravitational and electromagnetic phenomena by means of the\nRicci\nCoefficients of Rotation of\n4\northogonal congruences of lines which, at each point, define\n4\northogonal vectors of reference in Riemann space. In the present paper we apply Prof\nLevi-Civita\n's theory to a particular case, i.e., one in which an exact solution of the usual gravitational and electromagnetic equations of the relativity theory is known, and we compare the results so obtained with those arrived at in a previous paper by the use of Prof\nEinstein\n's theory.\nThis work formed part of McVittie's Ph.D. thesis on unified field theory for which he was awarded the degree in\n1930\n. These theories by\nEinstein\nand\nLevi-Civita\ndid not stand up well with experimental evidence and have been discarded.\nAfter graduating with his Ph.D., McVittie was appointed as an Assistant Lecturer in Mathematics at Leeds University, a position he held\n1930\n-\n33\n. These were difficult years living through the Great Depression but he had met Mildred Bond Strong\n(1906\n-\n1985)\nin Leeds and they planned to marry. Mildred, born at Montrose, Scotland on\n17\nJuly\n1906\n, was a daughter of John Strong and Ethel May Dobson. At the time of her birth, her father John Strong had been Rector of Montrose Academy. He was then Rector of Royal High School, Edinburgh before being appointed as Professor of Education in the University of Leeds in\n1919\n. On\n3\nSeptember\n1934\nMcVittie married Mildred Strong at Adel Church in Leeds. That McVittie married a Scot is interesting. Although George's father was born and lived in England, as did George's paternal grandparents, nevertheless he considered himself a Scot. In fact, when his father Francis McVittie went to the United States in\n1907\n, he gave his nationality as \"Scotch\".\nAfter the year\n1933\n-\n34\nas a temporary lecturer at the University of Edinburgh, during which he was a secretary of the\n1933\nSt Andrews Colloquium and published the paper\nRemarks on the geodesics of expanding space-time\n, he was employed as a Lecturer in Applied Mathematics at the University of Liverpool\n1934\n-\n36\n. His research up to this time had been highly involved with examining how\nEdwin Hubble\n's\n15\nMarch\n1929\nannouncement that the farthest galaxies are moving away faster than the closest ones fitted with general relativity. For example, he published\nThe Problem of n Bodies and the Expansion of the Universe\n(1931)\n,\nThe mass-particle in an expanding universe\n(1933)\n, T\nhe spiral nebulae and the expansion of the universe\n(1934)\n, and\nAbsolute parallelism and metric in the expanding universe theory\n(1936)\n. He was trying to find mathematical models of the universe that agreed with the observational data. He tried to work out what would happen to a static stable universe when matter condensed out locally. Would this cause the universe to expand or contract? He produced an overview of the state of cosmological theory and his views on that theory in his first book\nCosmological Theory\n(1937)\n. For information about this book, see\nTHIS LINK\n.\nIn\n1936\nMcVittie left Liverpool when he was appointed as a Reader at King's College, University of London. This move had attractions for McVittie since he was able to regularly attend meetings of the\nRoyal Astronomical Society\nat Burlington House in London. Continuing his study of the assumptions made by\nHubble\nconcerning observational data about galaxies, McVittie became unconvinced. On\n27\nJanuary\n1939\nhe addressed a joint meeting of the\nRoyal Astronomical Society\nand the Physical Society of London, presenting the paper\nObservation and theory in cosmology\n. We give an indication of the content by extracting a few sentences:-\nThe attempts hitherto made to solve the problem of the size and structure of the universe on the basis of general relativity have involved three stages. There is firstly the purely observational work. ... The second step consists in summarising the observations into so-called empirical equations. ... The third and last step consists in comparing some or all of the equations with the corresponding predicted equations of general relativity. Hitherto controversy has raged over this step, for it emerges that a further observational datum is needed before this union of empirical and theoretical equations will give the details of the structure of the universe.\nHubble\nfinds the additional datum in the effective temperature of the nebular radiation, and arrives at an extremely small universe of finite size. The present author's arbitrary datum is the average mass of a nebula, with which he arrives at a hyperbolic universe of infinite extent.\nAfter three years at King's College, in September\n1939\nWorld War II broke out and McVittie began to undertake war work. From September to November\n1939\nhe remained in London studying gas dynamics, then went to work at Bletchley Park. He wrote\n[\n20\n]\n:-\nDuring the years September\n1939\nto September\n1945\nI was seconded from King's College, London, to the Scientific Civil Service and worked at Government Communications Headquarters\n(\nGCHQ\n)\nlocated at Bletchley Park\n(\nBP\n)\n, Bletchley, Bucks. There I soon headed a unit that I shall refer to as the \"BP Met. group\" of which I was initially the only member. The work on which the group was engaged was the provision of observational weather data from areas controlled by the Germans and their Allies, though we also took part in similar work in the Japanese theatre of war. The weather data were needed by our own forecasting services in preparing weather forecasts for the R.A.F. and later the U.S. Air Force in operations over German-held territory.\nYou can read McVittie's own description of the work he undertook at Bletchley Park at\nTHIS LINK\n.\nAfter the end of World War II, McVittie returned to King's College, University of London where he spent three years before being appointed as Professor of Mathematics and Head of Department at Queen Mary's College, University of London in\n1948\n.\nThe International Congress of Mathematicians was to be held in Cambridge, Massachusetts, USA in September\n1950\n. McVittie wanted to attend but currency restrictions meant that each adult was restricted to a yearly allowance of £\n100\nfor travel abroad. To enable McVittie and his wife to fund the trip, he sought funding from the United States for lecture engagements. He was awarded funds to attend the Michigan Summer School for astronomers and Harvard's astronomy department gave him a visiting position for the autumn semester.\nMcVittie made a very positive impression with his lectures on relativity at Harvard.\nHarlow Shapley\n, the director of the Harvard College Observatory, had been asked to advise the University of Illinois on reviving its astronomy department. He replied on\n27\nOctober\n1950\n[\n19\n]\n:-\n... that he had just learned that McVittie, \"a man of considerable ability and accomplishments, one of the best remaining in England, which is going into an astronomical slump,\" wanted to stay in America.\nShapley\nadded that Mrs McVittie was a very attractive personality, had appreciable social interests, as did her husband, and both would be bright additions to the social life of any university.\nLeo Goldberg\n(1913\n-\n1987)\n, department chairman and observatory director at the University of Michigan, had been very impressed by McVittie when he visited the summer school and would have liked to be able to offer him a position but was unable to secure funding. He also advised the University of Illinois to offer McVittie a position. He wrote in May\n1951\n[\n19\n]\n.\nAs I understand it, you have no very extensive observational facilities at Illinois, and a theorist like McVittie would be ideally suited to your situation. ... One reason for Dr McVittie's success as a lecturer is his great personal charm and warm personality. ... If you get McVittie, you will be adding a really distinguished man to your faculty.\nOffered the position of Professor at Illinois University Observatory, McVittie accepted taking up the position in September\n1952\n. When appointed, he was the only full-time member of the Department with one part-time helper. After a year the part-time assistant was replaced by Stanley P Wyatt Jr. in a full-time role. Together, McVittie and Wyatt set up undergraduate courses, then Master of Science courses and, after about five years, a Ph.D. programme in astronomy. McVittie spent twenty years at Illinois where he slowly built up a strong astronomy department. One of his major achievements was for the University Observatory to set up a\n40\n-inch optical telescope. He writes\n[\n20\n]\n:-\nStarting in\n1965\n, land was purchased by the University in the relatively dark-sky region about\n35\nmiles south-east of Urbana, the National Science Foundation provided funds and the instrument and the building to house it were finally completed in\n1972\n.\nIn the summer of\n1970\nMcVittie resigned as Head of Department but continued in his role as professor. He spent a sabbatical year\n1970\n-\n71\nat the University of Kent in Canterbury, England where he purchased a house. He returned to Urbana for the first half of\n1972\n, then in June\n1972\nretired from the University of Illinois and left the United States to spend his retirement in Canterbury, England. He was made an Honorary Professor of Theoretical Astronomy at the University of Kent where he taught and advised Ph.D. students. During these years in Canterbury he took an interest in archaeology and became a member of the Canterbury Archaeology Trust, working on their excavation of a Roman theatre and temple precinct in the Canterbury city centre.\nIn addition to his book\nCosmological Theory\n(1937)\n, which we mentioned above, McVittie wrote the books\nGeneral relativity and cosmology\n(\nFirst edition\n1956\n, Second edition\n1965)\n, and\nFact and Theory in Cosmology\n(1962)\n. For information about these books, see\nTHIS LINK\n.\nMcVittie was elected to the\nRoyal Society of Edinburgh\non\n1\nMarch\n1943\n, having been proposed by\nDavid Gibb\n,\nIvor M H Etherington\n,\nRobert Schlapp\n, and\nAlexander C Aitken\n. He was a member of the\nEdinburgh Mathematical Society\n, being elected in December\n1927\n. He was also a fellow of the\nRoyal Astronomical Society\n, being elected in\n1933\n.\nAn obituary, written by M A H MacCallum for the\nQuarterly Journal\nof the Royal Astronomical Society can be read at\nTHIS LINK\n.\nAnother obituary of McVittie, this time written by\nWilliam McCrea\n, appeared in\nThe Independent\non Friday\n11\nMarch\n1988\n. A version can be read at\nTHIS LINK\n.\nDetails of some aspects of McVittie's life extracted from his own autobiographical writings can be read at\nTHIS LINK\n.\nNotes on some of McVittie's papers are given at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}