{
  "nome_completo": "Georges Jean Marie Valiron",
  "nome_curto": "Georges Valiron",
  "ano_nascimento": "1884",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Valiron/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "Paris, France",
  "biografia": "Georges Valiron\nattended the lycée in Lyon. After graduating from the lycée he studied at the École Normale Supérieure in Paris, being the top student when he was awarded his degree in mathematical science in\n1908\n. He then became a secondary school teacher of mathematics, spending four years teaching at Besançon. It was during these years that he taught\nAndré Bloch\nand his younger brother Georges. Valiron was awarded a bursary to enable him to study for his doctorate at the Faculty of Science in Paris and he spent the years\n1912\n-\n14\nundertaking research advised by\nÉmile Borel\n. In fact he had begun undertaking research while still a teacher at Besançon and he had published\nSur les fonctions entières d'ordre nul\nⓉ\n(\nOn entire functions of zero order\n)\nin\n1911\n. Further publications appeared:\nSur les fonctions entières d'ordre nul et d'ordre fini et en particulier les fonctions à correspondance régulière\nⓉ\n(\nOn entire functions of zero order and of finite order and especially regular correspondence to functions\n)\n(1913)\n;\nSur quelques théorèmes de M Borel\nⓉ\n(\nOn some theorems of Borel\n)\n(1914)\nand\nSur le calcul approché de certaines fonctions entières\nⓉ\n(\nOn the approximate calculation of certain entire functions\n)\n(1914)\n. He defended his thesis\nSur les fonctions entières d'ordre nul et d'ordre fini et en particulier les fonctions à correspondance régulière\nⓉ\n(\nOn entire functions of zero order and of finite order and especially regular correspondence to functions\n)\nbefore a panel at the Faculty of Science in Paris on\n20\nJune\n1914\nand was awarded his doctorate. Let us note that although his thesis was not examined until June\n1914\n, the\n1913\npublication with the same title is, in fact, his thesis and the\n1914\npapers were continuations of the research he presented in the thesis. This marks the start of his research career in which he made substantial progress in the study of the theory of\nentire functions\n,\nholomorphic\nfunctions, meromorphic functions and Tauberian theorems.\nBy the end of July\n1914\nFrance was mobilizing its troops and, on\n3\nAugust, Germany declared war on France. Valiron was mobilized and served in the artillery during the war. By the end of the war in\n1918\nhe had risen to the rank of second lieutenant. He continued to serve in the military until he was demobbed in\n1919\n. At that point he was appointed as a professor of mathematics at Valence, capital of the Drône department in southeast France,\n100\nkm south of Lyon. He was sent to the University of Strasbourg to teach mathematics, presenting a course on 'Dirichlet series and factorial series' in March and April\n1921\n. He taught for over ten years in Strasbourg and, at this point, we should explain the political significance of this move.\nThe Franco-Prussian War of\n1870\n-\n71\nhad been a humiliation for the French. Germany had captured Strasbourg after a\n50\n-day siege during the\n1870\n-\n71\nwar and annexed the city. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strasbourg in\n1872\n. Two mathematics chairs were founded at this time, the first was filled by\nElwin Christoffel\nand the second was filled by\nTheodor Reye\n. Both\nChristoffel\nand\nReye\nconsidered it their patriotic duty to assist in making the University of Strasbourg a German university. After the German defeat in World War I, Strasbourg reverted to French control in\n1919\nand the French re-established the University of Strasbourg, reorganising it as the autonomous French university Université Louis Pasteur-Strasbourg. Valiron was one of a number of eminent Frenchmen sent to Strasbourg to achieve this aim. He taught there until\n1931\n, being promoted to professor in\n1922\n.\nMaurice Fréchet\nwas his colleague in Strasbourg from\n1921\nto\n1927\n.\nIn February and March\n1922\nValiron delivered a series of lectures to honours students at the University College of Wales at Aberystwyth. He had been invited to Aberystwyth by\nW H Young\nas part of a move to raise the status of Pure Mathematics in the University of Wales. The lectures were published in the following year as the book\nLectures on the general theory of integral functions\n. Valiron delivered the lectures in French and they were translated into English by\nEdward Collingwood\nwho, after undergraduate studies at Cambridge, had gone to Aberystwyth at the invitation of\nW H Young\n. In a Preface to the book,\nW H Young\nwrites:-\nThe lectures give us, in the form of a number of elegant and illuminating theorems, the latest word of mathematical science on the subject of 'Integral Functions'. And they do more. They descend to details, they take us into the workshop of the working mathematician, they explain to us the nature of his tools, and show us the way to use them; while, at the same time, by absence of any attempt to conceal the imperfections of the edifice so far constructed, they indicate to us the work still waiting to be done, they inspire us with desire and furnish us with the means of completing it ourselves.\nValiron writes in a separate Preface\n(\nwhich we have translated into English, but which appears in the book in French\n)\n:-\nThis book reproduces the lectures which I had the honour to give to the students of\nW H Young\nat the University College of Wales at Aberystwyth in February and March\n1922\n. May I be permitted to repeat here an expression of my gratitude to Professor Young who invited me to give these lectures, who has given me the means to publish them and who has kindly presented them to the public. If this book renders some service to students, their gratitude should go first to Professor Young who was the promoter.\nThe importance of this book is seen from the fact that it was reprinted in\n1949\nand continues to be in print with the latest edition appearing in\n2007\n. Following the publication of this classic text, Valiron published a number of small books containing between\n50\nand\n60\npages. The first of these was\nFonctions Entières et Fonctions Méromorphes d'une Variable\nⓉ\n(\nWhole functions and meromorphic functions of a variable\n)\n(1925)\n. K P Williams writes in a review\n[\n9\n]\n:-\nSo brief a time has elapsed since the appearance of Valiron's former work, 'Lectures on the General Theory of Integral Functions', that one naturally expects the present small volume to follow essentially the development given in the former book. The condensation of material in order to confine the subject to fifty pages is most noticeable. On this account the beginner in this field will probably prefer the older book, where the pace is more leisurely and the exposition more detailed.\nIn the following year he published\nThéorie Générale des Séries de Dirichlet\nⓉ\n(\nGeneral Theory of Dirichlet series\n)\n(1926)\n. L L Smail writes in a review\n[\n7\n]\n:-\nThe aim of the series to which this work belongs is to present in brief and compact form the most important results and outlines of methods in various mathematical subjects of current interest. This particular number on Dirichlet series gives an excellent survey of this interesting field which is now growing so rapidly. ... To those already interested in the subject and to those who wish know something of the results and methods without devoting too much time to it, this compact summary should prove very valuable.\nAmong the papers that Valiron published in the years following World War I, we mention:\nLes théorèmes généraux de M Borel dans la théorie des fonctions entières\nⓉ\n(\nGeneral theorems of Borel in the theory of entire functions\n)\n(1920)\n;\nRecherches sur le théorème de M Picard\nⓉ\n(\nResearch on Picard's theorem\n)\n(1921)\n;\nRecherches sur le théorème de M Picard dans la théorie des fonctions entières\nⓉ\n(\nResearch on M Picard theorem in the theory of entire functions\n)\n(1922)\n;\nSur les fonctions entières vérifiant une classe d'équations différentielles\nⓉ\n(\nOn entire functions satisfying a class of differential equations\n)\n(1923)\n;\nSur l'abscisse de convergence des séries de Dirichlet\nⓉ\n(\nOn the abscissa of convergence of the Dirichlet series\n)\n(1924)\n;\nSur les surfaces qui admettent un plan tangent en chaque point\nⓉ\n(\nOn the surfaces which admit a tangent plane at each point\n)\n(1926)\n; and\nSur la distribution des valeurs des fonctions méromorphes\nⓉ\n(\nOn the distribution of values of meromorphic functions\n)\n(1926)\n. In\n1931\nhe left Strasbourg when called to the Faculty of Science in Paris. In the following year he was a plenary speaker at the International Congress of Mathematicians held in Zürich from\n5\nSeptember to\n12\nSeptember\n1932\n. At the Congress, he gave the lecture\nLe théorème de Borel-Julia dans la théorie des fonctions méromorphes\nⓉ\n(\nThe Julia-Borel theorem in the theory of meromorphic functions\n)\n. In\n1937\nhe published another small work, namely the\n55\n-page tract\nSur les valeurs exceptionnelles des fonctions méromorphes et de leurs derivees\nⓉ\n(\nOn the exceptional values  of meromorphic functions and their derivatives\n)\n.\nMary Cartwright\nreviews this book in\n[\n2\n]\n:-\nThis tract is concerned with\n[\na\n]\ntheorem, which is due to\nMiranda\n, and with other similar results of a more complicated nature covering\nmeromorphic\nas well as regular functions. The proofs are naturally very much condensed, and a good deal is assumed; but the references should be sufficient for anyone with a little knowledge of the general theory of integral functions. ... The later results in the tract are obtained by the author's direct method for proving\nPicard\n's theorem.\nJoseph Walsh\n, reviewing the same tract, writes:-\nThe treatment is clear, pleasing, suggestive - an admirable exposition of a field of current interest and importance. May there soon be made in this country systematic provision for the encouragement of the writing of similar essays and for their publication!\nDuring World War II Valiron continued to teach in Paris. In October\n1940\nhe took over the course\nApplication de l'analyse à la géométrie\nⓉ\n(\nApplication of analysis to geometry\n)\nwhich had been given by René Garnier. He was named professor of general mathematics in\n1941\nthen, later in the same year, named professor of differential and integral calculus at the Faculty of Science. As well as teaching at the Faculty of Science, he taught at the École Polytechnique.\nValiron published his\nCours d'Analyse mathématique\nⓉ\n(\nCourse of mathematical analysis\n)\nin two volumes. The first, entitled\nTheorie des fonctions\nⓉ\n(\nTheory of functions\n)\n, was published in\n1942\n. The contents are indicated by the titles of the chapters: I. Numbers, sets, limits; II. Infinite series and products; III. Generalities on continuous functions. Functions of a single variable; IV. The\nRiemann\nintegral. Applications and extensions; V. The\nLebesgue\nintegral; VI. Functions of a single complex variable defined or represented by series or integrals; VII. Trigonometric series and generalizations; VIII. Reduction and mechanical computation of integrals; IX. Functions of several variables; X. Double integrals; XI. Triple and multiple integrals; XII. Elementary functions of a complex variable; XIII. The\nCauchy\ntheory. Fundamental theorems and the calculus of residues; XIV. The\nWeierstrass\ntheory. Analytic continuation; XV. Conformal mapping; XVI. Elliptic functions; XVII. Analytic functions defined by integrals. Applications. Maurice Heins writes in a review:-\nNoteworthy features of the book are:\n(1)\na careful detailed account of multiple integral theory under the usual classical assumptions;\n(2)\na brief treatment of continued fractions, a topic not customarily treated in such texts;\n(3)\na proof of the\nHadamard\ntheorem concerning the asymptotic behaviour of π\n(\nx\n)\n, the number of primes not exceeding x;\n(4)\ncontact with modern research in analysis by frequent reference to recent monographs dealing with special topics.\nThe second volume, published in\n1945\n, was entitled\nÉquations Fonctionnelles; Applications\nⓉ\n(\nFunctional equations; Applications\n)\n. It covers ordinary differential equations, partial differential equations, and algebraic equations of two variables. The author of\n[\n1\n]\ntries to put Valiron's treatise into the context of other classic texts on analysis:-\nA new 'Cours d'Analyse' inevitably challenges comparison with the classic treatises familiar to every self-respecting student of mathematical analysis. The reviewer has always felt that of the four best-known classics,\nGoursat\nand\nde la Vallée Poussin\nexhibit a perfection of completeness and finish, while\nJordan\nand\nPicard\ndisplay the beauty and stimulus of a living and active organism. Such a contrast, if accurate, does not disparage either side ; and if we say that Valiron's book has more of the air of\nGoursat\nand\nde la Vallée Poussin\n, the implied mild regret is surely more than outweighed by the magnitude of the compliment. If, at times, the brilliant and lucid exposition of these authors leaves us feeling that nothing remains to be done, the brilliancy and lucidity still stand as well worth emulation.\nThese two volumes were published as a single volume treatise in\n1966\n, with another edition appearing in\n1989\n.\nMost biographies of Valiron state that his most famous doctoral student was\nLaurent Schwartz\nwho was awarded his doctorate by the University of Strasbourg in\n1943\n. This is slightly puzzling since Valiron spent the war years in Paris and had not taught at Strasbourg in the preceding ten years. Another point which requires clarification is the comment by one biographer that Valiron was not\nLaurent Schwartz\n's doctoral advisor, but rather an examiner of his thesis. He quotes\nLaurent Schwartz\n's autobiography as justification for this claim.\nLaurent Schwartz\nstudied in Paris at the École Normale Supérieure in the\n1930\ns and at this time took a course by Valiron on\nFunctions of a complex variable\n.\nSchwartz\nthen spent\n1937\n-\n39\nin military service which was extended for a year because of World War II. He was demobbed in August\n1940\nand went to live with his parents in Toulouse. He happened to meet\nHenri Cartan\nwhen he visited Toulouse to conduct an oral on behalf of the École Normale Supérieure and\nHenri Cartan\nadvised him to study for a doctorate at Clermont-Ferrand which is where the University of Strasbourg moved when the German armies invaded France at the start of World War II.\nLaurent Schwartz\n's thesis contains the following acknowledgement as to the help that Valiron had given him:-\nI want to especially thank Georges Valiron who not only gave me much advice, but also, through the correspondence he kindly entered into with me, helped me to overcome many difficulties.\nIt is certainly true that Valiron was an examiner of the thesis, as\nLaurent Schwartz\nstates in his autobiography. However, at another point in the autobiography,\nSchwartz\nwrites that a Vietnamese student:-\n... had\n(\nlike me\n)\nValiron as his thesis advisor.\nThere is, therefore, no doubt that\nLaurent Schwartz\nconsidered Valiron to have been his thesis advisor although he almost certainly did not have this as a formal role. We note also that Valiron examined the doctoral thesis of\nLaurent Schwartz\n's wife, Marie-Hélène, the daughter of\nPaul Lévy\n.\nValiron received many honours. He was invited to lecture, or give plenary addresses at conferences, in many countries: England, Belgium, Switzerland, the United States, South America, and Egypt. He was elected president of the\nFrench Mathematical Society\nin\n1938\n. He received five awards from the\nAcademy of Sciences\n, including the Grand Prix of the Mathematical Sciences in\n1931\n. He was awarded the Prix\nPoncelet\nin\n1948\n. He was made Commander of the Légion d'Honneur in\n1954\n. In the same year he published\nFonctions analytiques\nⓉ\n(\nAnalytical functions\n)\n. H L Royden writes\n[\n6\n]\n:-\nThis book is intended for the student who has had an introductory course in functions of a complex variable. ... Altogether this is a very useful little book which has collected together a number of diverse topics in function theory in a form which is easy to read and quite suitable for the student who wishes to familiarize himself with some of the classical tools available in function theory.\nMaurice Heins, reviewing the same book, writes:-\nThe monograph under review is concerned with selected topics in the theory of analytic functions. ... autonomy of exposition is sought as well as the avoidance of duplication with other well-known monographs on the theory of functions. Emphasis is placed on expounding the more elementary parts of the theories studied. An abundance of references points the way to further detailed study of the topics treated. The geometric approach is stressed.  ...\n[\nA\n]\nwealth of material\n[\nis\n]\nconsidered. The exposition is lucid. This book should be of considerable value for continuing courses in the theory of analytic functions.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}