{
  "nome_completo": "Georgia McClure Benkart",
  "nome_curto": "Georgia Benkart",
  "ano_nascimento": "1947",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Benkart/",
  "lugar_nascimento": "Youngstown, Ohio, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Georgia Benkart\nwas the daughter of George McClure Benkart II\n(1906\n-\n1968)\nand Florence Kayser\n(1906\n-\n1990)\n. George Benkart was a heating and air conditioning contractor who was born on\n16\nJuly\n1906\nin Sewickley, Pennsylvania. He was the grandson of George M McClure, an early Mahoning County surveyor and scientist. Florence Kayser was born on\n15\nJuly\n1906\nin Mahoning County, Ohio and was a teacher at Liberty Junior High School. George and Florence Benkart, who were only one day different in age, were married on\n27\nDecember\n1945\nin Youngstown. George had just completed his World War II service in the Army Corps of Engineers. They had two children, Paula Kaye Benkart\n(\nborn\n6\nFebruary\n1947)\nand Georgia McClure Benkart\n(\nborn\n30\nDecember\n1947)\n, the subject of this biography. Let us note at this point that Paula Benkart, like her younger sister, had an academic career and was awarded a Ph.D. from Johns Hopkins University in\n1975\nfor her thesis\nReligion, Family, and Continuity among Hungarians Migrating to American Cities\n. Speaking about her parents, Georgia said\n[\n21\n]\n:-\nMy father was an engineer and was good in mathematics. My mother was a successful teacher at all levels from kindergarten through to college. She majored in English, biology, and education.\nThe\n1950\ncensus records the family living in Youngstown, and George Benkart's occupation is given as \"selling furnaces for a furnace installation company.\"\nGeorgia was educated in Liberty Schools in Youngstown, and was the valedictorian of her class at Liberty High School, in Liberty Township just north of Youngstown. Speaking of herself and her sister, she said\n[\n21\n]\n:-\nMy parents encouraged our educational activities but didn't try to influence the subjects we studied. I started out wanting to become a chemist but soon found I was allergic to most things in the lab including the work.\nOf her time at the High School, she said\n[\n21\n]\n:-\nI always have loved science and mathematics and remember joining the science club as soon as I could.\nThe author of\n[\n10\n]\nwrites:-\nParticipating in a summer program for high school students at Hiram College awakened Georgia's self-confidence in her intellectual abilities.\nAfter graduating from Liberty High School, Benkart began her university studies at Ohio State University in Columbus, Ohio. In the interview\n[\n21\n]\nshe said:-\nThe honours mathematics program at Ohio State University was the determining factor in my becoming a mathematics major. We were treated to small classes and excellent teachers who encouraged us to take graduate courses when they thought we could do well in them. Professors Joan and Jim Leitzel and Joe Ferrar stimulated my interest in abstract algebra with challenging courses, and I remember quite fondly a graduate p-adic analysis course I took when I was a junior from the famous number theorist\nKurt Mahler\n.\nWhile still an undergraduate, she wrote her first mathematics paper with fellow student Douglas W Townsend,\nA generalization of subnet with some resulting improvements in Moore-Smith convergence theory\n. The Introduction begins:-\nThis paper is intended to improve the theory of Moore-Smith Convergence by generalising the definition of subnet.\nWe note that Benkart's name appears on the paper as George Benkart, an unfortunate misprint which may be due to an editor who did not expect a woman undergraduate to be writing a mathematics paper.\nBenkart graduated in\n1970\nwith a B.S. summa cum laude and with distinction in mathematics. She then went to Yale University for postgraduate studies where she was supported by the National Science Foundation and was awarded a Woodrow Wilson Fellowship. She was awarded an M.Phil. in\n1973\n[\n21\n]\n:-\nAs a graduate student, I took a course in\nLie\nalgebras from the group theorist\nWalter Feit\n. Even though there were experts in\nLie\ntheory on the faculty at Yale, he was teaching the course that term because he wanted to study the subject. So we all struggled to learn the topic together, and that is how I became interested in\nLie\nalgebras.\nFor her doctorate she was advised by\nNathan Jacobson\nand was awarded a Ph.D. in\n1974\nfor her thesis\nInner Ideals and the Structure of Lie Algebras\n. The Summary begins:-\nThis dissertation presents a systematic investigation of the role of inner ideals in the study of\nLie\nalgebras. The elementary properties of inner ideals obtained give a classification of minimal inner ideals. As a result of this classification a\nLie\nalgebra which has minimal inner ideals is shown to have ad-nilpotent elements unless every minimal inner ideal is a simple ideal which has no proper inner ideals. On the other hand the existence of ad-nilpotent elements implies the existence of non-trivial inner ideals. We investigate\nLie\nalgebras which satisfy the minimum condition on inner ideals and contain non-zero ad-nilpotent elements. Such a\nLie\nalgebra decomposes into the direct sum of copies of a\nJordan\nalgebra, copies of a\nJordan\nbimodule, and a\nLie\nsubalgebra of derivations of the\nJordan\nalgebra and bimodule. The main feature of this decomposition is the correspondence between the\nLie\nand the\nJordan\nstructures. As a consequence of the\nJordan\nstructure theory necessary and sufficient conditions can be given for the\nLie\nalgebra to be the direct sum of a finite number of simple\nLie\nalgebras which satisfy the minimum condition on inner ideals.\nIn the Acknowledgements she writes:-\nMany people have contributed to my mathematical education. I owe them all my sincerest thanks. I would like to express my special appreciation to my advisor, Professor\nNathan Jacobson\n, and to Professor George Seligman who first suggested inner ideals as a possible avenue of research.\nAfter the award of her Ph.D. she was appointed to the Mathematics Department at the University of Wisconsin Madison as a MacDuffee Instructor. She was the second woman to join the Department, the first being\nMary Ellen Rudin\nin\n1959\n. A steady stream of excellent papers quickly gave her a world class reputation. The first of these are:\nThe Lie inner ideal structure of associative rings\n(1976)\n;\n(\nwith I M Isaacs\n)\nOn the existence of ad-nilpotent elements\n(1977)\n;\nOn inner ideals and ad-nilpotent elements of Lie algebras\n(1977)\n;\n(\nwith I M Isaacs and J M Osborn\n)\nLie algebras with self-centralizing ad-nilpotent elements\n(1979)\n;\n(\nwith I M Isaacs and J M Osborn\n)\nAlbert-Zassenhaus Lie algebras and isomorphisms\n(1979)\n; and\n(\nwith I M Isaacs\n)\nLie algebras with nilpotent centralizers\n(1979)\n.\nIn\n[\n5\n]\nMarty Isaacs writes about his collaborations with Benkart on the papers we have mentioned above:-\nShortly after Georgia Benkart arrived at the University of Wisconsin Madison, she gave a graduate course in\nLie\nalgebras. I attended Georgia's lectures in this course, and I was doubly impressed. First, although I had seen\nLie\nalgebras previously, I not realised how beautiful that subject could be until Georgia made it come alive in her course. In fact, I was nearly seduced by Georgia's lectures into abandoning my first mathematical love - group theory - and I began thinking about problems in\nLie\nalgebras. Indeed, I wrote and published two papers\n(\njointly with Georgia and our colleague, J Marshall Osborn\n)\non simple\nLie\nalgebras in prime characteristic, and a further paper jointly with Georgia. Another impressive aspect of Georgia's course was her beautiful lectures. These were carefully prepared and extremely well presented, and even her blackboard use was exceptionally fine, with beautiful handwriting and excellent organisation. I also got to know Georgia very well in a non-mathematical context. She lived for a while in an apartment building adjacent to where I lived, and since I had a very convenient campus parking space, we agreed that she would come to the mathematics department each morning in my car. Because of this daily contact, our friendship developed nicely. I enjoyed those commutes with Georgia, and I was sad when she moved out of my neighbourhood, and thus ended our morning co-commutes.\nBenkart's first Ph.D. student was Suren L Fernando who wrote\n[\n5\n]\n:-\nIn the fall of '\n79\n, I was a timid graduate student, and had been late getting started on a thesis. Either the day she was awarded tenure or the day after, with considerable apprehension, I approached her office, just a couple of doors down from my own, to ask her whether I could work with her. She immediately put me at ease and took me on as a student. I was extremely fortunate she did so because she was all you could expect of an advisor, and many times more. I am indebted to her for being such a wonderful mentor, and also for introducing me to a beautiful subject and its many connections with other parts of mathematics and physics.\nFernando was awarded his Ph.D. in\n1983\nfor his thesis\nSimple weight modules of complex reductive Lie algebras\n. He was the first of\n22\nPh.D. students that Benkart advised at the University of Wisconsin Madison who are listed at\n[\n11\n]\n.\nThe University of Wisconsin awarded her a H I Romnes Faculty Fellowship in\n1985\n. This award is given to outstanding staff who are beyond the Research Committee's initial research support but have not yet reached the stage of being eligible for the Mid-Career Award for Faculty Research. Two years later, in\n1987\n, she received the University of Wisconsin's highest award for teaching, the Distinguished Teaching Award. Then in\n1996\nshe was awarded the Mid-Career Award for Faculty Research.\nThe Joint\nAmerican Mathematical Society\nand the\nMathematical Association of America\nmeeting in\n1994\ntook place in Cincinnati, Ohio, on\n12\n-\n15\nJanuary. Benkart gave the AMS-MAA Invited Address\nA tale of two groups\n. In this lecture she\n[\n7\n]\n:-\n... told in Dickensian fashion the story begun\n80\nyears ago by\nIssai Schur\ntying the knot between the symmetric groups and the general linear groups of invertible matrices. It's a old story but nevertheless a very timely one with many new developments and applications to the theory of symmetric functions, representation theory, knot theory, invariant theory, combinatorics, and particle physics. An expanded version of this talk was the basis of her\n10\nlectures at Holiday Symposium at New Mexico State University in December\n1992\n.\nFrom\n2000\nto\n2002\nshe was the\nMathematical Association of America\n's\nGeorge Pólya\nLecturer\n[\n8\n]\n:-\nEach year the Board of Governors of the\nMathematical Association of America\nselects a\nPólya\nLecturer, to serve for two academic years. Georgia Benkart has been selected to serve in\n2000\n-\n01\nand\n2001\n-\n02\n. On a rotating basis, the various MAA sections around the country can invite a current\nPólya\nLecturer\n(\nthere are two at any given time\n)\nto speak at a regional meeting. ... She is regarded as an inspiring and dedicated teacher, in the best traditions of\nGeorge Pólya\n... Giving lectures around the country won't be anything new for Georgia. In the year\n2000\nshe gave\n9\ninvited lectures, including lectures at MSRI\n(\nBerkeley\n)\n, Seoul National University\n(\nKorea\n)\n, Canada\n(\nToronto and Alberta\n)\n, and Oberwolfach\n(\nGermany\n)\n. In\n1999\namong her\n11\ninvited lectures were the Taft Lectures at the University of Cincinnati. Professor Benkart currently serves on the editorial boards of the 'Journal of Algebra' and the 'Korean Mathematical Colloquium'.\nThe Joint\nAmerican Mathematical Society\nand the\nMathematical Association of America\nmeeting in January\n2005\ntook place in Atlanta, Georgia and Benkart was an MAA invited speaker giving the talk\nSquare ice is very nice, but can you put a match to it?\nThe Abstract reads:-\nThere is a simple matching between n × n patches of square ice with certain boundary conditions and n × n alternating sign matrices, which in turn have many beautiful connections with a host of other topics - domino tilings, tableaux, determinants, symmetric functions and group characters. This talk will journey through many of these topics.\nBenkart retired from teaching in\n2006\nand devoted herself to serving the mathematical community. She was an enthusiastic member of the\nAssociation for Women in Mathematics\nand from\n2008\nto\n2013\nshe served on many committees. She served on the Executive Committee first as President-elect\n(2008\n-\n2009)\n, then as President\n(2009\n-\n2010)\n, and finally as Past President\n(2011\n-\n2012)\n. Other committees she served on included the Awards Committee, the Fundraising Committee, the Nominating Committee, and the Research Symposium.\nIn\n2014\nBenkart delivered AWM-AMS Noether Lectures\nWalking on Graphs the Representation Theory Way.\nThe Abstract begins\n[\n4\n]\n:-\nHow many walks of n steps are there from point A to point B on a graph? Often finding the answer involves clever combinatorics or tedious treading. But if the graph is the representation graph of a group, representation theory can facilitate the counting and provide much insight.\nAlso in\n2014\nBenkart was invited to deliver the\nEmmy Noether\nlecture at the International Congress of Mathematicians held in Seoul from\n13\nAugust to\n21\nAugust\n[\n8\n]\n:-\nThe ICM\nEmmy Noether\nlecture honours women who have made fundamental and sustained contributions to the mathematical sciences.\nShe gave the lecture\nConnecting the McKay correspondence and Schur-Weyl duality\nwhich has the following Abstract:-\nThe McKay correspondence and\nSchur\n-\nWeyl\nduality have inspired a vast amount of research in mathematics and physics. The McKay correspondence establishes a bijection between the finite subgroups of the special unitary\n2\n-by-\n2\nmatrices and the simply laced affine\nDynkin\ndiagrams from\nLie\ntheory. It has led to the discovery of many other remarkable A-D-E phenomena.\nSchur\n-\nWeyl\nduality reveals hidden connections between the representation theories of two algebras that centralise one another in their actions on the same space. We merge these two notions and explain how this gives new insights and results. Our approach uses the combinatorics of walks on graphs, the Jones basic construction, and partition algebras.\nOther honours given to Benkart include her becoming an inaugural fellow of the\nAmerican Mathematical Society\nin\n2012\n, and an inaugural fellow of the\nAssociation for Women in Mathematics\nin\n2017\n. This honour was given to those who had:-\n... demonstrated a sustained commitment to the support and advancement of women in the mathematical sciences, consistent with the AWM mission: \"to encourage women and girls to study and to have active careers in the mathematical sciences, and to promote equal opportunity and the equal treatment of women and girls in the mathematical sciences.\"\nThe citation for Benkart given in\n2014\nwhen she was announced as ICM\nEmmy Noether\nlecturer gives a good summary of her outstanding research achievements\n[\n22\n]\n:-\nGeorgia Benkart is a leader in the representation theory of\nLie\nalgebras and\nKac\n-Moody algebras with fundamental contributions to several branches of\nLie\nTheory. In a series of joint papers with Osborn, she classified simple modular\nLie\nalgebras of toral rank one which proved to be a crucial building block for the classification of simple modular\nLie\nalgebras. Together with Britten and Lemire, she made important contributions to stability questions in combinatorial representation theory, a topic getting lots of attention recently. In a joint paper with\nE Zelmanov\n, she found a highly nontrivial description of all root graded\nLie\nalgebras, which provided the key idea for really getting control of root graded\nLie\nalgebras. More recently, Benkart, Kang and Kashiwara constructed nice crystal bases for general linear\nLie\nsuperalgberas, a highly nontrivial piece of work. Besides her deep contributions in mathematics, she has been a very successful mentor with more than twenty Ph.D. students. She has contributed profusely to mathematics through her services as office bearer at the AMS as well as AWM.\nThose interested in looking at Benkart's research contributions in more detail should consult the excellent paper\n[\n12\n]\n. After a detailed description of her research, the authors of this paper write:-\n... we feel that Georgia's contribution to our discipline goes well beyond this astonishing catalogue of research papers, monographs, lectures, and service roles. She has left an indelible mark on a generation of mathematicians through supportive collaborations with more than\n90\nco-authors, many of whom are\n(\nor, more accurately, were\n)\nearly-career researchers. And there are even more mathematicians who were not her co-authors but for whom Georgia's mentoring, advice, and support made it possible for them to achieve much more than they ever expected of themselves. Georgia, always humbly and perfectly, serves as a role model and mentor to all.\nBenkart died suddenly at the age of\n74\n. The author of the obituary\n[\n10\n]\nwrites:-\nGeorgia Benkart was stunned to learn on Wednesday, April\n27\n, that the pain and fatigue she had been fighting through to fulfil her professional commitments came from an illness that was about to take her life. It did so two days later.\nLet us end this biography with two remembrances. First we quote from Paul Terwilliger who was Benkart's colleague in the Mathematics Department at the University of Wisconsin-Madison\n[\n5\n]\n:-\nI have known Georgia Benkart ever since I came to the department in\n1985\n. Over the years, I saw Georgia deal with problems large and small. And somehow, once Georgia got involved, the problem was solved in less time than expected. To be sure, Georgia was profoundly competent and well organized. But that description alone does not do her justice. For Georgia, a project was not just about getting it right; it was also about making it beautiful. I have read many of Georgia's mathematical papers. Each paper was a polished gem, that would make any lawyer or poet proud. I attended many of Georgia's lectures at conferences and seminars. Each lecture was a work of art, that engaged the audience from beginning to end. I attended many a faculty meeting during which Georgia got up to speak. Invariably, what she said was so well polished and delivered, that it reminded me of Lincoln's Gettysburg address.\nFinally, we quote from Matthew Ondrus who was advised by Benkart for his Ph.D. writing the thesis\nWhittaker Modules, Central Characters, and Tensor Products for Quantum Enveloping Algebras\n(2004)\n[\n5\n]\n:-\nI am incredibly lucky to have known Georgia as my teacher, advisor, collaborator, and friend. It is nearly impossible to describe how important she has been to me or to imagine how differently things may have turned out for me had I not known her. Georgia was kind, brilliant, patient, generous, and extremely funny, and I wish I could still remember all of the many times she exhibited those traits. She was also remarkably thorough. I was lucky enough to have collaborated with Georgia several times, and I can vividly recall the first time I wrote a paper with her. At a certain point, we had proved some nice theorems and had written rigorous proofs of those theorems. I thought we were close to being able to submit our paper. I could not have been more wrong. We subsequently engaged in a process of proofreading that was unlike anything I had ever done, and after many many many more drafts, we had a paper of which I am still proud. I like to imagine that if Georgia were to read this remembrance, she would suggest a few small wording changes that would greatly improve it. I miss her very much.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Topology"
  ]
}