{
  "nome_completo": "Gerardus Mercator",
  "nome_curto": "Gerard Mercator",
  "ano_nascimento": "1512",
  "ano_morte": "1594",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mercator_Gerardus/",
  "lugar_nascimento": "Rupelmonde, Burgundian Netherlands (now Belgium)",
  "lugar_morte": "Duisburg, Duchy of Cleves (now Germany)",
  "biografia": "Gerard Mercator\n's parents were Hubert and Emerentia Kremer. Hubert Kremer worked the land and also was a cobbler, that is a shoemaker. Hubert and Emerentia were people of lowly status but Hubert had an brother Gisbert who had been educated at Louvain University and was a priest in Rupelmonde. It was in the hospice of St Johann in Rupelmonde, where Gisbert was a priest, that Gerard was born. He was the seventh child of Hubert and Emerentia who, a few weeks after the birth, returned to their home town of Gangelt.\nFor the first five years of his life Gerard and his parents lived in difficult conditions in Gangelt. The family income was insufficient to provide for more than the basic needs of life and most of their diet consisted of bread for they could afford little else. Hubert had leased a house in Rupelmonde in\n1511\n, shortly before Gerard's birth, and in\n1518\nthey journeyed from Gangelt to Rupelmonde to begin a new life. Gerard began attending school in Rupelmonde shortly after the family came to live there. At school he studied Latin, religion and arithmetic. By the time he was seven years old he was able to speak and to read Latin fluently.\nGisbert's influence meant that it was natural for Gerard and his brothers to aim at a career in the Church and indeed that was the route that his two eldest brothers took. Conditions in Rupelmonde began to deteriorate in the early\n1520\ns, however, with huge increases in taxes to fund the war between the Habsburgs and France. The reformation, begun by Luther, escalated into revolution in\n1525\n. The harsh times and the hard work that he put in to try to support his family took their toll on Hubert who died in\n1526\nor\n1527\n. His brother Gisbert became Gerard's guardian.\nGisbert wanted the very best education possible for Gerard so in about\n1527\nhe sent him to be educated with the Brethren of the Common Life in 'sHertogenbosch in the Netherlands. While Gerard was there his mother died and he chose a new name for himself. His name 'Kremer' means 'merchant' in German and he was sometimes known as 'Cremer' which is the Dutch equivalent. As a new name he chose Mercator, the Latin for 'merchant' and gave himself the full name of Gerardus Mercator de Rupelmonde.\nOn\n29\nAugust\n1530\nMercator matriculated at the University of Louvain, taking the course in the humanities and philosophy. He studied at the Castle, one of four teaching houses of the university which offered two year Arts degrees based almost entirely on the teachings of\nAristotle\n. He graduated from Louvain with a Master's Degree in\n1532\nand chose not to proceed to a higher degree. Already he felt that he wanted to challenge the views of\nAristotle\n, yet this was as heretical at Louvain at that time as challenging the views of the Catholic Church.\nAfter graduating, Mercator began to have serious worries on how to reconcile the account of the origin of the universe given in the Bible with that given by\nAristotle\n. He wrote later\n(\nsee for example\n[\n12\n]\n)\n:-\nBut when I saw that Moses' version of the Genesis of the world did not fit sufficiently in many ways with\nAristotle\nand the rest of philosophers, I began to have doubts about the truth of all philosophers.\nThis almost certainly explains why he chose to leave the university rather than study for a higher degree, since he had already decided that he did not want to become a philosopher. He travelled to a number of places while going through this personal crisis including Antwerp and Mechelen. His travels did little for his religious worries but gave him a deep interest in geography which he saw at the subject which could best explain the structure of the world which God created.\nMercator returned to Louvain in\n1534\nwhere he now studied mathematics under\nGemma Frisius\n. However, not having any background in the subject, Mercator soon found that the mathematics courses beyond him. Realising that Mercator wanted to learn mathematics to apply it to cosmography,\nGemma Frisius\ngave him advice on the best route into learning the mathematics he needed to know, giving him books to study at home. Once put on the right path by\nGemma Frisius\n, Mercator quickly progressed in understanding and enjoyment of mathematics. He also learnt about applications of mathematics to geography and astronomy which he found \"extremely agreeable\". He later wrote\n(\nsee for example J Babicz in\n[\n10\n]\n)\n:-\nSince my youth geography has been for me the primary object of study. When I was engaged in it, having applied the considerations of the natural and geometric sciences, I liked, little by little, not only the description of the earth, but also the structure of the whole machinery of the world, whose numerous elements are not known by anyone to date.\nMercator learnt to be an engraver and instrument maker at this time from Gaspard Van der Heyden\n(\nalso known as Gaspar à Myrica\n)\n. However at this time Mercator was not only was learning, he was also teaching. He earned a steady income giving mathematics tuition to the students at Louvain, obtaining permission from the university to do this. He also earned extra money by making mathematical instruments of exceptional quality which he sold.\nIn\n1535\n-\n1536\nMercator, working in Louvain with Van der Heyden and with\nGemma Frisius\n, constructed a terrestrial globe. The globe had been commissioned by the Emperor Charles V to\n(\nsee for example\n[\n11\n]\n)\n:-\n... make mathematics more illustrious ... keep alive the memory of old kingdoms and events and ... make known to coming generations our time and our realm in which ... very many islands and areas unknown in earlier centuries have been discovered ...\nThe paper strips which were printed for the globe were printed using copper rather than wood blocks, the first to be printed using that substance. The geographical work was mainly due to\nGemma Frisius\nwhile Mercator's role was that of an engraver. With copper rather than wood on which to engrave place names, names of regions and geographical descriptions, the printed globe contained vastly more information than any that had previously been constructed.\nIn September\n1536\nMercator married Barbara Schellekens and their first child, a son Arnold, was born on\n31\nAugust\n1537\n. They had six children, thee daughters and three sons. In\n1537\nMercator, working with Van der Heyden and with\nGemma Frisius\n, constructed a globe of the stars. This time Mercator and Van der Heyden appeared as more equal collaborators with\nGemma Frisius\nwith the globe claiming that is was made by\n(\nsee for example\n[\n11\n]\n)\n:-\nGemma Frisius\n, doctor and mathematician, Gaspard Van der Heyden and Gerard Mercator of Rupelmonde.\nMercator produced his first map, which was one of Palestine, in\n1537\n[\n6\n]\n:-\nMercator knew Palestine better than any place outside the Low Countries. He had grown up with its miracles and revelations. He knew its history. Palestine had been the subject of the first map that most of his generation had ever seen. And like the Bible maps of his boyhood, his would show the route described in the Fourth book of Moses.\nThe first map of the world to be produced by Mercator used a projection due to\nOronce Fine\nand appeared in\n1538\n. This map is notable for being the first to represent America as stretching from the northern regions to the southern regions and for giving North America that name.\nThe map of Flanders which Mercator produced in\n1540\nwas commissioned for political purposes. It must be realised that maps can send important signals about the regions which they cover, and the existing map of the region emphasised Ghent at the expense of Antwerp and other towns. It suggested an independent Flanders and Mercator's map was commissioned to correct this impression. In fact Mercator produced a map of high accuracy using data from a survey of Flanders carried out using the method of triangulation described by\nGemma Frisius\n.\nMercator had a long term plan of producing a world map by producing individual maps of the different regions. As part of this project he set to work on the map of Europe in the summer of\n1540\n. There were many problems with a world map, however, for the rapid increase in information coming from exploration of the Earth meant that maps rapidly became outdated. Also contradictory information was often given from inaccurate surveys leaving the mapmaker with the almost impossible task of deciding which data was correct. Mercator realised the reason for some of the incorrect data; sailors assumed that following a particular compass course would have them travel in a straight line whereas this was untrue. He realised that a ship sailing towards the same point of the compass would follow a curve called a loxodrome\n(\nalso called a rhumb line or spherical helix\n)\n, a curve recently studied by\nPedro Nunes\nwho was a mathematician greatly admired by Mercator. A new globe which he produced in\n1541\nwas the first to have rhumb lines shown on it.\nMercator was arrested in February\n1544\nand charged with heresy. This was partly due to his Protestant beliefs, partly due to the fact that he travelled so widely to acquire data for his maps that suspicions were aroused. He spent seven months in prison in Rupelmonde castle. Others that were arrested at the same time admitted that they did not believe that the body of Christ was physically present in the communion host and they did not believe in purgatory. They were burned at the stake or buried alive. Nothing was found to connect Mercator with the others 'heretics' even after they had been tortured. Mercator's house was searched and his belongings confiscated but nothing incriminating was found to show that he was anything other than a good Roman Catholic.\nHe was released from prison in September\n1544\n, mainly due to strong support from the University of Louvain. After his release he returned to his family in Louvain but their financial position was by now dire. It is likely that he was forced to pay for the cost of his own imprisonment as many were at this time. He worked hard on constructing mathematical instruments that he has promised to construct before his arrest.\nJohn Dee\narrived in Louvain in\n1548\nand quickly became friends with Mercator.\nDee\n, who spent three years working with Mercator, later wrote:-\nIt was the custom of our mutual friendship and intimacy that, during three whole years, neither of us lacked the other's presence for as much as three whole days.\nDuring this time Mercator worked on a celestial globe of the same size as his terrestrial globe of\n1541\nwhich he completed in\n1551\n. The positions of the stars were corrected to their positions in\n1550\nusing\nCopernicus\n's model of the universe. In\n1552\nMercator moved to Duisburg where he opened a cartographic workshop. The fact that a new university was planned for the town meant that he anticipated a ready demand for maps, books, globes and mathematical instruments.\nIn Duisburg Mercator completed his project to produce a new map of Europe by October\n1554\n. It was a large map,\n1\n.\n6\nmetres by\n1\n.\n3\nmetres, drawn using a new projection devised by Johannes Stabius. This re-established Mercator as the leading European map maker and, as well as praise for its scholarly value, the map had considerable commercial value. His income secure, Mercator and his family moved into a large house in the wealthiest district of Duisburg. He was described by a friend at this time\n(\nsee\n[\n9\n]\n)\n:-\nAlthough he ate and drank very little, he kept an excellent table, well furnished with the necessities of civilised living... He always did his best to help those who were poor and less fortunate than he and ... he cultivated and cherished hospitality. Whenever he was invited by the magistrates to a banquet or by friends to a dinner, or he himself invited friends, he was invariable cheerful and witty ...\nHe taught mathematics in Duisburg from\n1559\nto\n1562\nin a new school designed to prepare students for entry into the proposed new university. When plans for the university were scrapped in\n1562\n, Mercator ended his teaching duties at the school handing them over to his second son. Further maps followed; one of Lorraine in\n1564\nand one of the British Isles in\n1564\n. Like some previous commissions, these maps were required for political ends, the latter map being sought as a Catholic map to be used against the Protestant Queen Elizabeth.\nMercator was appointed Court Cosmographer to Duke Wilhelm of Cleve, also in\n1564\n. During this period he began to perfect a new map projection for which he is best remembered. The 'Mercator projection' that bears his name was first used by him in\n1569\nfor a wall map of the world on\n18\nseparate sheets entitled:-\nNew and more complete representation of the terrestrial globe properly adapted for its use in navigation.\nThe 'Mercator projection' had the property that lines of longitude, latitude and rhomb lines all appeared as straight lines on the map. He had, he wrote on the map:-\n... spread on a plane the surface of a sphere in such a way that the positions of all places shall correspond on all sides with each other both in so far as true direction and distance are concerned and as concerns true longitudes and latitudes.\nHe was also the first to use the term 'atlas' for a collection of maps. He used the word atlas:-\n... to honour the Titan, Atlas, King of Mauritania, a learned philosopher, mathematician, and astronomer.\nMercator published corrected and updated versions of\nPtolemy\n's maps in\n1578\nas the first part of his 'atlas'. His 'atlas' continued with a further series of maps of France, Germany and the Netherlands in\n1585\n. Although the project was never completed Mercator did publish a further series in\n1589\nincluding maps to the Balkans\n(\nthen called Sclavonia\n)\nand Greece.\nOn\n5\nMay\n1590\nMercator had a stroke which left his left side paralysed. Frustrated that he could no longer work, he slowly recovered but suffered great frustration at his inability to continue his map making projects. By\n1592\nhe was able to do a small amount of work again but his eyes were by now almost blind. He had a second stroke towards the end of\n1593\nwhich took away his power of speech and although he fought bravely, recovering some power of speech, a third stroke was too much for the old man. Some maps which were incomplete at his death were completed and published by his son in\n1595\n.\nMercator's break from the methods of\nPtolemy\nwas as important for geography as was\nCopernicus\nfor astronomy.",
  "math_areas": []
}