{
  "nome_completo": "Gerd Faltings",
  "nome_curto": "Gerd Faltings",
  "ano_nascimento": "1954",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faltings/",
  "lugar_nascimento": "Gelsenkirchen-Buer, Germany",
  "lugar_morte": null,
  "biografia": "Gerd Faltings\nstudied for his doctorate at the University of Münster, being awarded his Ph.D. in\n1978\n. Following the award of his doctorate, Faltings went to the United States where he spent a year doing postdoctoral work as a research fellow at Harvard University in\n1978\n-\n79\n.\nIn\n1979\nFaltings returned to Germany, taking up an appointment as professor of mathematics at the University of Wuppertal. In\n1985\nFaltings was appointed to the faculty at Princeton.\nFaltings proved conjectures by\nMordell\n,\nShafarevich\nand\nTate\nduring\n1983\n. In the same year he received the Danny Heinemen Prize from the Akademie der Wissenschaften, Göttingen.\nIn\n1986\nFaltings received the highest honour that a young mathematician can receive when he was awarded a\nFields Medal\nat the International Congress of Mathematicians at Berkeley. At the Congress\nB Mazur\ngave an address describing the work by Faltings which had led to the award. He received the medal primarily for his proof of the\nMordell\nConjecture which he achieved using methods of arithmetic\nalgebraic geometry\n.\nFaltings has been closely linked with the work leading to the final proof of\nFermat's Last Theorem\nby\nAndrew Wiles\n. In\n1983\nFaltings proved that for every\nn\n>\n2\nn > 2\nn\n>\n2\nthere are at most a finite number of\ncoprime\nintegers\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nwith\nx\nn\n+\ny\nn\n=\nz\nn\nx^{n} + y^{n} = z^{n}\nx\nn\n+\ny\nn\n=\nz\nn\n. This was a major step but a proof that the finite number was\n0\nin all cases did not seem likely to follow by extending Falting's arguments. However, Faltings was the natural person that\nWiles\nturned to when he wanted an opinion on the correctness of his repair of his proof of Fermat's Last Theorem in\n1994\n.\nIn\n1994\nFaltings left Princeton when appointed a Scientific Member of the Max Planck Institute for Mathematics in Bonn, Germany. In the following year he became the Director of the Institute, a position he continues to hold. In\n1996\nhe was awarded the Gottfried Wilhelm Leibniz Prize of the Deutsche Forschungsgemeinschaft. This is the largest German research prize and it consists of a research grant of\n2\n.\n5\nmillion euro, to be used within seven years. Let us quote Faltings' own description of his research interests:-\nMy main interests are arithmetic geometry\n(\ndiophantine equations\n,\nShimura\n-varieties\n)\n, p-adic cohomology\n(\nrelation crystalline to étale, p-adic Hodge theory\n)\n, and vector bundles on curves\n(\nVerlinde-formula, loop-groups, theta-divisors\n)\n.\nContribution to research area \"Moduli spaces\":-\nI constructed arithmetic toroidal compactifications of the moduli space of abelian varieties. I showed that the moduli space of bundles on curves can be projectively embedded by explicit theta-functions. I proved the Verlinde formula for the dimension of the space of such functions. I constructed moduli spaces for bundles on nodal curves, and I found resolutions of their singularities. I hope to construct semistable models for\nShimura\nvarieties in the case of tame bad reduction. Furthermore I search for an explicit description of theta-divisors on moduli spaces of G-bundles, especially for exceptional groups G, especially for type\nE\n8\nE_{8}\nE\n8\n​\n. I have shown that for this group there exists a unique canonical theta-divisor. Also for spin groups of dimension divisible by four there should exist explicit theta-divisors associated to the two spin representations. I am looking for geometric descriptions of these divisors.\nContribution to research area \"Automorphic forms: Global analysis and arithmetic\":-\nI have constructed an explicit isomorphism between infinite coverings of two p-adic moduli spaces\n(\nstudied by\nDrinfeld\n)\n, using p-adic\nHodge\ntheory. This gives an explicit realisation of the Jacquet-\nLanglands\ncorrespondence, as was conjectured by Carayol. I try to extend this to other cases, by employing my expertise in p-adic cohomologies which I developed in the last fifteen years.\nContribution to research area \"Groups of automorphisms\":-\nI have studied algebraic loop groups, and proved the normality of\nBruhat\ncells even in positive characteristics. As the corresponding affine Grassmannians uniformize moduli spaces of bundles this has applications to such spaces. I constructed on them a line bundle of central charge one, which was an open problem even in positive characteristics. I hope to construct explicit sections of these bundles.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic"
  ]
}