{
  "nome_completo": "Gianfranco Luigi Giuseppe Cimmino",
  "nome_curto": "Gianfranco Cimmino",
  "ano_nascimento": "1908",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cimmino/",
  "lugar_nascimento": "Naples, Italy",
  "lugar_morte": "Bologna, Italy",
  "biografia": "Gianfranco Cimmino\n's father was Francesco Cimmino\n(1864\n-\n1939)\n, a historian and poet from Naples who taught history at the Liceo Genovesi and taught Sanskrit at the University of Naples. He translated Indian poems and dramas, published his own poems, and wrote the music for two libretti. Benedetto Croce\n(1866\n-\n1952)\n, the famous historian, humanist and philosopher, described Francesco Cimmino as:-\n... an expert connoisseur of oriental literature and a skilful author of verses for music ...\nGianfranco's mother Olimpia was from an aristocratic family, the Gibellini Tornielli Boniperti, from Novara in the Piedmont region of northwestern Italy. Olimpia and Francesco married in\n1903\nand their first two children were Maria Luisa and Eugenia. Maria Luisa died on\n2\nJanuary\n1907\nwhen she was still a baby. Gianfranco, born on Thursday\n12\nMarch\n1908\n, was baptized with the name of Gianfranco Luigi Giuseppe but only used the given name Gianfranco.\nIn\n1923\n, when Cimmino was fifteen years old, he graduated from high school with the classical certificate. He studied mathematics at the University of Naples and graduated with his laurea in\n1927\n. His thesis advisor had been\nMauro Picone\nwho had moved to the University of Naples in\n1925\n. Cimmino was only nineteen years old when he graduated with his thesis on approximate methods of solution for the heat equation in\n2\n-dimensions, but he was appointed as an assistant to\nPicone\nwho held the chair of analytical geometry at the University of Naples. He held this position during the academic year\n1927\n-\n28\n. He published material from his thesis in his first paper\nNuovo metodo d'approssimazione per la soluzione dei problemi di valori al contorno relativi all'equazione del calore\nⓉ\n(\nNew approximation method for solving boundary value problems related to the equation of heat\n)\n(1928)\n. In\n1929\nhe published two papers:\nEstensione della identità di Picone alla più generale equazione differenziale lineare ordinaria autoaggiunta\nⓉ\n(\nExtension of the Picone identity to more general ordinary self-adjoint linear differential equations\n)\nand\nSu una questione di minimo\nⓉ\n(\nOn a queation of minimising\n)\n. He was awarded a scholarship to study abroad and spent the academic year\n1930\n-\n31\nat the University of Monaco and the University of Göttingen.\nIn Naples, Cimmino was a member of an impressive team led by\nPicone\n. He was one of four assistants, the other three being\nRenato Caccioppoli\n,\nCarlo Miranda\nand Giuseppe Scorza Dragoni.\nCaccioppoli\nhad graduated from Naples in\n1925\nwhere he had been a student of\nErnesto Pascal\n, before becoming\nPicone\n's assistant.\nCarlo Miranda\nentered the University of Naples in\n1927\nand studied with\nPicone\n, graduating in\n1931\n, and then becoming an assistant. These four assistants are referred to as \"\nMauro Picone\n's four musketeers\" by Scorza Dragoni in his obituary of\nMiranda\n[\n4\n]\n:-\nAll four members of this remarkable group were bound by a strong sense of camaraderie and friendship.\nThey worked in the \"Istituto per le Applicazioni del Calcolo\", attached to the chair of Mathematical Analysis, which had been founded by\nPicone\nin Naples in\n1927\nwith financial assistance from the Banco di Napoli. This Institute was perhaps the earliest Institute for numerical analysis in the world.\nPicone\nleft Naples in\n1932\n, together with\nMiranda\n, but Cimmino remained there until\n1938\n. After\nPicone\nleft, Cimmino became a lecturer in charge of the courses of Higher Analysis between\n1932\nand\n1935\n. Then he was in charge of the courses of Analytic Geometry from\n1935\nto\n1938\n[\n3\n]\n:-\nSome of Cimmino's most remarkable papers date to the period\n1937\n-\n38\nand concern the theory of partial differential equations of elliptic type. In particular, Cimmino was the first mathematician to study the\nDirichlet\nproblem with generalized boundary conditions.\nHis two most important papers on this topic were\nNuovo tipo di condizioni al contorno e nuovo metodo di trattazione per il problema generalizzato\nⓉ\n(\nA new type of boundary condition and new method of treatment  for the generalized problem\n)\n(1937\n-\n38)\nand\nSul problema generalizzato di Dirichlet per l'equazione di Poisson\nⓉ\n(\nOn the generalized Dirichlet problem for Poisson's equation\n)\n(1940)\n. Between these papers, however, he published the paper\nCalcolo approssimato per le soluzioni dei sistemi lineari\nⓉ\n(\nApproximate calculation for the solutions of linear systems\n)\n(1938)\nwhich actually gave details of work on numerical analysis that he had done a few years earlier. The paper contains the following introductory note by\nPicone\n:-\nProfessor Gianfranco Cimmino can be considered, among other things, as one of the founders of the Istituto per le Applicazioni del Calcolo, to which he lent his continuing and productive assistance during the embryonic stages of the Institute itself, in Naples, in the laboratory annexed to that university's Calculus chair, from July\n1928\nto October\n1932\n. Towards the end of that period, Professor Cimmino devised a numerical method for the approximate solution of systems of linear equations that he reminded me of in these days, following the recent publication by Dr\nCesari\n..., which provides a systematic treatment of the above mentioned computing methods but which, however, does not consider the one by Cimmino, a method which, in my opinion, is most worthy of consideration in the applications because of its generality, its efficiency and, finally, because of its guaranteed convergence which can make the method practicable in many cases. Therefore, I consider it useful to publish in this journal Professor Cimmino's note on the above mentioned method, a note that he has agreed to write on my insistent invitation.\nWhile in Naples, Cimmino entered the competition for the chair of Mathematical Analysis at the University of Cagliari, in Sardinia. He was ranked first by the panel and took up the position in\n1938\n. However, he did not remain long at Cagliari for, in November\n1939\n, he moved to Bologna when appointed to the chair of Mathematical Analysis at the University. He held this chair for the rest of his career. From\n1965\nto\n1972\nhe was Dean of the Faculty of Mathematical, Physical and Natural Sciences of the University of Bologna. He was a special commissioner to the National Institute of Advanced Mathematics from\n1973\nto\n1977\nand he was director of the Institute from\n1978\nto\n1982\n.\nIn\n1940\nhe married Maria Rosaria Martinez\n(1914\n-\n1998)\n; they had seven children born between\n1941\nand\n1952\n, namely Francesco, Olimpia, Giovanni, Ortensia, Giuseppe, Maria Beatrice and Pietro. Now, also in\n1940\n, various members of the family adopted the name Cimmino Gibellini Tornielli Boniperti, combining his father's surname with his mother's family name.\nWe have seen that Cimmino made contributions to partial differential equations of elliptic type and to computing approximate solutions to systems of linear equations. However, he also made important contributions to many other areas of mathematics, for example the calculus of variations; differential geometry; conformal and quasi-conformal mappings; topological vector spaces; and the theory of distributions. However, as Michele Benzi points out in\n[\n3\n]\n(\nand\n[\n4\n]\n)\n, it was his work on numerical analysis, particularly the\n1938\npaper we mentioned above, that:-\n...  has had a remarkable, if belated, impact and has proven to be of lasting importance for many areas of applied scientific computing.\nStrangely, this important\n1938\npaper has been omitted from Cimmino's collected works\n[\n2\n]\n. Benzi discusses Cimmino's contributions to numerical analysis in the interesting paper\n[\n3\n]\nand gives the following summary of the impact of his mathematics:-\nWhile Cimmino did not live to see how extensive the influence of his numerical work would be, he did know that algorithms based on his\n1938\npaper were being developed and applied in the medical field. Indeed, one of his last reviews for the 'Zentralblatt', appeared in\n1988\n, concerned a paper on the use of Cimmino's method in radiation therapy planning. He must have been pleased to learn that his elegant, youthful intuition had been found to be useful in the medical field. The story of Cimmino's method is interesting for several reasons. It shows that good mathematical ideas may take many years to become fully appreciated and to be brought to fruition. Major technological changes may completely transform the perception of an algorithm, from useless curiosity to brilliant invention. If an idea is indeed good, it is almost certain that it will eventually come to the forefront\n(\nperhaps through re-discovery\n)\n, no matter how obscure the original publication or how long the period of oblivion. ... It is also interesting to observe that Cimmino's impact on his main research area, the theory of partial differential equations, while non-negligible, has not been as great and as lasting as his work in numerical mathematics. The reasons for this are complex, but may be due at least in part to the state of relative isolation in which Cimmino\n(\nas well as other members of the Neapolitan mathematical school\n)\nconducted his research, publishing his most important papers in Italian and in journals of rather limited circulation. Moreover the techniques\n(\nand even the notation\n)\nhe used were somewhat different from those adopted by many of the leading mathematicians of the time.\nCimmino published seven books, most of which were based on notes from his lecture courses. He also wrote some popular articles, including\nDante and Mathematics\n. He received many honours for his contributions. He was awarded the Gualtiero Sacchetti prize from the city of Bologna in\n1964\n-\n65\n[\nGualtiero Sacchetti\n(1836\n-\n1917)\nwas an engineer and Senator of the Kingdom of Italy\n]\n. In\n1965\nhe received the Gold Medal for Merit from the School of Culture and Arts. He was elected a member of the Academy of Sciences of the Institute of Bologna, of the\nNational Academy of Lincei\n(\nin\n1969)\n, of the National Academy of Sciences, Arts and Literature of Modena, and of the National Society of Sciences, Arts and Literature of Naples.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}