{
  "nome_completo": "Gilbert Ames Bliss",
  "nome_curto": "Gilbert Bliss",
  "ano_nascimento": "1876",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bliss/",
  "lugar_nascimento": "Chicago, Illinois, USA",
  "lugar_morte": "Harvey, Illinois, USA",
  "biografia": "Gilbert Bliss\n's parents were George Harrison Bliss and Mary Maria Gilbert. George Bliss was the president of the Chicago Edison Company which, by\n1907\n, supplied all of Chicago's electricity. Bliss was born in the suburbs of Chicago into a wealthy family. However when he was seventeen years old and about to attend College, the United States, which had been in economic depression for six years, plunged into crisis. The level of the gold reserve in the federal Treasury was believed vital to assure redemption of government obligations. On\n21\nApril\n1893\nthe reserve fell below what was generally believed to be the necessary level and the result was panic as investors tried to change their assets into gold. Many businesses and financial institutions failed as prices dropped, and the Chicago Edison Company hit hard times. A period of severe economic depression followed that continued for over three years. Bliss's family were no longer able to support him through College so he had to find a way to support himself. He did so in two ways, first by winning a scholarship and second by making money by being a member of a professional mandolin group.\nBliss was one of the first American mathematicians to complete his studies in the United States before travelling to Europe. He entered the University of Chicago in\n1893\nand received his B.S. is\n1897\n. He then began his graduate studies at Chicago in mathematical astronomy and his first publication was in that field. However mathematics was his real love and, in\n1898\n, he began his doctoral studies working on the\ncalculus of variations\n. His interest in the calculus of variations came through two sources, firstly from lecture notes of\nWeierstrass\n's\n1879\ncourse, of which he had a copy, and secondly from the inspiring lectures by\nBolza\nwhich Bliss attended. Bliss received his doctorate in\n1900\nfor a dissertation\nThe Geodesic Lines on the Anchor Ring\nwhich was supervised by\nBolza\n. Then he was appointed as an instructor at the University of Minnesota in\n1900\n. He left Minnesota in\n1902\nto spend a year in Göttingen where he interacted with\nKlein\n,\nHilbert\n,\nMinkowski\n,\nZermelo\n,\nSchmidt\n,\nMax Abraham\nand\nCarathéodory\n. His fellow American\nMax Mason\nwas a doctoral student at Göttingen during the year Bliss spent there. Bliss published two papers in\n1902\n: one in the\nAnnals of Mathematics\nwas based on his doctoral dissertation and had the same title\nThe geodesic lines on the anchor ring\nwhile the second in the\nTransactions of the American Mathematical Society\nwas titled\nThe second variation of a definite integral when one end-point is variable\n.\nReturning to the United States, Bliss was appointed to the University of Chicago in\n1903\n, then in\n1904\nhe was appointed as an assistant professor at the University of Missouri. Two further papers by him on the calculus of variations appeared in\n1904\n, both in the\nTransactions of the American Mathematical Society\n. They were\nAn existence theorem for a differential equation of the second order, with an application to the calculus of variations\nand\nSufficient condition for a minimum with respect to one-sided variations\n. At Missouri his Head of Department was\nHedrick\nbut after a year he was offered a post at Princeton which he accepted, remaining there until\n1908\n. At Princeton Bliss joined a strong group of young mathematicians including\nEisenhart\n,\nVeblen\n, and\nRobert Moore\n. While at Princeton he was also an associate editor of the\nAnnals of Mathematics\n. Bliss was appointed as an associate professor at the University of Chicago on the death of\nMaschke\nand he remained at Chicago until he retired. At this time he became an editor of the\nTransactions of the American Mathematical Society\nand continued in this rol until\n1916\n. He was chairman of the Mathematics Department at Chicago from\n1927\nuntil he retired in\n1941\n. We should remark however, that Duren in\n[\n5\n]\nwas a graduate student in Chicago in the late\n1920\ns and describes this period as the:-\n... down cycle for mathematics at Chicago.\nBliss married Helen Hurd in\n1912\nand they had two children before Helen tragically died in the influenza epidemic of\n1918\n. This epidemic, often called the Spanish Influenza Epidemic, was the most severe outbreak of influenza during the\n20\nth\ncentury. It seems to have originated in Funston, Kansas, in early March\n1918\nand led to about\n550\n,\n000\npeople dying in the United States while world wide around\n30\nmillion died. Bliss and his two children survived.\nHe worked on ballistics during World War I and designed new firing tables for artillery, publishing his work in two papers in the\nJournal of U.S. Artillery\nin\n1919\n. His book\nMathematics for Exterior Ballistics\n(1944)\nwas based on this work and published to make the methods he devised during World War I available during World War II. W E Milne writes in a review:-\nThis book treats exterior ballistics strictly as a problem in particle dynamics, that is, rotational effects are ignored and resistance is assumed to act along the tangent to the trajectory. The field of ballistics, thus restricted, is presented with exceptional clearness and thoroughness and a surprising amount of information is packed into a little book of only\n128\npages.\nHe lectured on navigation to about\n100\nstudents at the University of Chicago as part of the World War I effort. Also in\n1918\nhe joined\nVeblen\nin the Range Firing Section at the Aberdeen Proving Ground, a military weapons testing site established in\n1917\nin Harford county northeastern Maryland. There he very effectively applied methods from the calculus of variations to solve problems relating to correcting missile trajectories for the effects of wind, changes in air density, rotation of the Earth and other perturbations. Bliss married again in\n1920\n, his second wife being Olive Hunter; there were no children from this marriage.\nBliss's main work was on the calculus of variations and he produced a major book,\nLectures on the Calculus of Variations\n, on the topic in\n1946\n. As a consequence of Bliss's results a substantial simplification of the transformation theories of\nClebsch\nand\nWeierstrass\nwas achieved.  O Frink  writes in a review:-\nThis is a sound, thorough and up-to-date text on the single integral problems of the calculus of variations, based on courses given by the author at the University of Chicago. ... The book starts with a typical simple problem, the non-parametric problem in\n3\n-space with fixed end-points. Chapter I takes up necessary conditions, chapter II sufficient conditions for this case. Tables show various ways the necessary conditions of\nEuler\n,\nWeierstrass\n,\nLegendre\nand\nJacobi\nmay be strengthened to give sufficient conditions. ... Part II presents the first comprehensive treatment of the problem of\nBolza\n, a very general type of problem with side conditions and variable end-points. The form in which the results are presented here is that preferred by Bliss himself. The problem has now reached a state of completeness and simplicity which allows it to be presented in a manner like that used for the older problems of part I. ... The theory here presented marks the culmination of the modern phase of development of the calculus of variations, begun by\nWeierstrass\nand continued by\nHilbert\n,\nBolza\nand Bliss. In this treatment the subject is studied rigorously, with no emphasis on the formal manipulation of symbols. On the other hand the subject is taken as an end in itself, and not as a mere adjunct of mechanics.\nBliss also studied singularities of real transformations in the plane. During the last\n50\nyears of his life Bliss played a major role in mathematics in the United States and he was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1916\n. He was deeply involved in the\nAmerican Mathematical Society\nbeing the Colloquium Lecturer in\n1909\n, the Vice President in\n1911\n, and its President from\n1921\nto\n1922\n. He received many awards for his work including the first\nChauvenet\nPrize in\n1925\nfrom the\nMathematical Association of America\nfor his article on\nAlgebraic functions and their divisors\n. On this topic he published the book\nAlgebraic functions\nin\n1933\nwhich was reprinted by\nDover Publications\nin\n1963\n.\nBliss's interests outside mathematics are described in\n[\n3\n]\n:-\nIn order to earn money necessary for his college expenses he became a member of a student professional mandolin quartet. He has always been interested in sport and beginning with bicycle racing in student days he has successively taken up tennis, racquets, and golf.\nAlso outside mathematics was his work heading\n[\n6\n]\n:-\n... a government commission to construct precise rules for assigning to states seats in the U.S. House of Representatives, under the vague constitutional provisions for proportional representation.",
  "math_areas": [
    "Algebra",
    "Calculus"
  ]
}