{
  "nome_completo": "Gilles Personne de Roberval",
  "nome_curto": "Gilles Roberval",
  "ano_nascimento": "1602",
  "ano_morte": "1675",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Roberval/",
  "lugar_nascimento": "Noël-Saint-Martin, Villeneuve-sur-Verberie, Oise, France",
  "lugar_morte": "Paris, France",
  "biografia": "Gilles Roberval\n's parents were Pierre Personne and Jeanne Le Dru. The obvious question one might ask at this point is why Gilles Roberval's father was not named Roberval. The reason is that Gilles Roberval was named Gilles Personne and this was the name under which he was known for at least the first twenty-five years of his life, only adding the \"de Roberval\" after\n1628\n. Pierre and Jeanne Personne were of humble origins, living in the village of Roberval, about\n50\nkm north\n(\nand a bit east\n)\nof Paris. They worked on the land but probably were well enough off to lead a comfortable life. Recent research\n(\nin\n2003)\nhas shown that Gilles was born in a field at Noël-Saint-Martin, Villeneuve-sur-Verberie, close to Roberval, where his mother was bringing in the harvest. He was baptised the next day and the record of this has been found in the archives of the Oise region. We know that Gilles had a large extended family, had brothers and sisters but only one sister, Marie, outlived him.\nGilles began to study mathematics at the age of\n14\nyears when the parish priest of Rhuis, a village just\n2\nkm to the north of Roberval, realised that young Gilles was highly intelligent and began to give him lessons. The parish priest was actually the chaplain to the queen, Marie de Médici, and he not only instructed Gilles Personne in mathematics but also in Latin and probably Greek. At some stage\n(\nno record exists to indicate exactly when\n)\nhe left his home district and travelled widely visiting many places in France. At this time he earned his living teaching mathematics while he discussed advanced topics with university teachers in the towns he visited. Auger writes\n[\n2\n]\nthat he rode from town to town with an ink bottle strapped to the saddle of his horse. On his travels he went to Bordeaux where he met\nPierre de Fermat\n. In September\n1627\nhe was at La Rochelle when King Louis XIII of France, who had declared war on the Huguenots, besieged the town which was the most important of the Huguenot cities of France, and the centre of Huguenot resistance. Gilles Personne, as he was still known at the time, studied both practical and theoretical aspects of the problems of fortifications and ballistics which resulted from this siege.\nHe arrived in Paris in\n1628\nand made contact with\nMarin Mersenne\n's circle, particularly with\nClaude Hardy\n,\nClaude Mydorge\n,\nÉtienne Pascal\nand\nBlaise Pascal\n. He became a member of the circle; in fact he later become the only professional mathematician in the group. At around this time, having received permission from the head of the village of Roberval, he added \"de Roberval\" to his name becoming Gilles Personne de Roberval. We will refer to him as Roberval from this point on. He spent the years from\n1628\nto\n1632\nbuilding up his knowledge and skills in mathematics with the aim of getting a position as a professional mathematician. He achieved this in\n1632\nwhen he was appointed professor of philosophy in the Collège Gervais in Paris. This was a small institution attached to the university of Paris. It had been founded in the\n14\nth\ncentury for students from Bayeux but by the time Roberval was appointed it no longer had that restriction. After he was appointed to the Collège Gervais, Roberval rented accommodation next to the College\n[\n5\n]\n:-\nRoberval moved into rooms there where he resided until the end of his life; he never became a property owner in Paris. He had second floor accommodation comprising simply two rooms which looked into the college courtyard in one direction and the rue Boutebrie in the other. While teaching at the college he prepared himself as a candidate for one of the most prestigious mathematical positions in Paris: the Ramus Chair at the College Royal which fell vacant in\n1634\nand was to be filled through public competition.\nBefore we consider briefly what Roberval's life in these rooms was like, we need to understand a little of his character. Sturdy writes that\n[\n5\n]\n:-\n... he was of notoriously difficult and irascible temper.\nMore relevant to his life style was his reputation for being mean\n[\n5\n]\n:-\nHis apparent reluctance to spend money earned him a reputation as an inveterate miser whose avarice was a by-word among his associates and colleagues. This is not entirely fair, for he was ready to contribute generously to the dowries of his niece and great-niece. On the other hand the items devoted to personal convenience and comfort ...\n[\nwere\n]\nfew in number and do convey the impression of somebody whose lifestyle was exceedingly austere.\nSo how did he furnish his two rooms? They had only beds, tables and chairs, and these items were of poor quality. No pictures hung on the walls, and there were no ornaments. However, he did have some books in his rooms by authors such as\nEuclid\n,\nArchimedes\n,\nViète\n,\nTorricelli\n,\nGassendi\n,\nDescartes\n,\nMersenne\n,\nKepler\n,\nVitruvius\n, Herodotus, Cicero and Quintillian. He had several dictionaries, books on grammar, and\n(\ndespite not being a religious man\n)\na Latin Bible. When he died not even a bottle of wine was found in his rooms but a large amount of cash was found, something of the order of eight times his annual salary.\nOn\n24\nJune\n1634\nhe was declared the winner of the competition for the Ramus Chair, and was appointed to that chair of mathematics in the Collège Royale. This was a competitive appointment and Roberval had to compete for reappointment every three years. In\n1655\nhe was appointed to\nGassendi\n's chair of mathematics at the Collège Royale, in addition to the Ramus chair, and he held both chairs for the rest of his life. The years between\n1648\nand\n1653\nwere difficult ones for anyone living in Paris with civil wars known as the Frondes. In August\n1648\nthere was insurrection in Paris and the people barricaded the streets. After a siege by the army, the rebellion faded away by the spring of\n1649\nbut civil war erupted again with a battle being fought around Paris in the summer of\n1652\n. By\n1653\nthe civil war ended although a continuing war with the Spanish was still going on. By\n1655\nRoberval felt that France had achieved peace between its own people and felt confident enough to make a major purchase of land\n[\n5\n]\n:-\nIn\n1655\n, when the Frondes had died down, he bought from Pierre de Brûlart, sieur de Coullet, a farm situated at Menerval.\nSturdy carries out a calculation in\n[\n5\n]\nwhich suggests that Roberval paid a higher price for the farm than one would expect. Perhaps this particular property meant a lot to him and certainly by the end of his life many members of his extended family were living in the area. The farm was mixed, set up for grain production, and had a dairy herd of cattle as well as a beef herd. Roberval brought in extra income by leasing out small plots on his farm to individuals. He employed two managers to run the farm together with a number of labourers. His nephew Antoine Personne lived on the farm and managed it for a number of years. Menerval is, like Roberval's birthplace, north of Paris, but it is further to the west about\n80\nkm from Paris. It was well situated for its produce to be sold in Paris, and also near enough for Roberval to be able to make trips to the farm.\nLet us now look at Roberval's contributions to mathematics. It is rather difficult to assess his importance and influence for, although he made outstanding contributions of fundamental importance, he only published two works during his lifetime. These were\nTraité de mécanique des poids soutenus par des puissances sur des plans inclinés à l'horizontale\nⓉ\n(\nTreatise on the mechanics of weights supported by powers on inclined planes\n)\n(1636)\nand\nLe système du monde d'après Aristarque de Samos\nⓉ\n(\nThe system of the world according to Aristarchus of Samos\n)\n(1644)\n. One might reasonably ask why, given that he produced such a large quantity of innovative mathematics, he published so little. We do not know the answer to this question for certain, but one likely theory is that he wanted to keep his discoveries out of the public domain so that he could use the material in the three-yearly competitions for the Ramus Chair\n[\n3\n]\n:-\nCandidates were required not only to lecture, but also to demonstrate theorems and solve problems put to them by all comers; as result, the practice grew up of the incumbent trying to ensure his re-appointment by proposing problems which only he could solve.\nWhatever the reason for the lack of publications during his lifetime, quite a lot of his work was published in\nDivers ouvrages de mathématique et de la physique par messieurs de l'Académie Royale des Sciences\nⓉ\n(\nVarious mathematical and physical  works by gentlemen of the Royal Academy of Sciences\n)\nin\n1693\n. Most of Roberval's material in this\n1693\npublication was at least fifty years old, so it did not have the impact that it would have done had it been published shortly after being written. Other texts have been published much later, for example\nEléments de géométrie\nⓉ\n(\ngeometry elements\n)\nin\n1996\n, and other material has not yet been published\n(\nand perhaps never will be published\n)\nsuch as his courses on astronomy, surveying, architecture and physical geography.\nRoberval developed powerful methods in an early study of integration, writing\nTraité des indivisibles\nⓉ\n(\nTreatise on indivisables\n)\nwhich he claimed was based on\nArchimedes\nand not\nCavalieri\n. It was published as part of\nDivers ouvrages de mathématique et de la physique par messieurs de l'Académie Royale des Sciences\nⓉ\n(\nVarious mathematical structures and physical by members of the Royal Academy of Sciences\n)\n(1693)\n. In it he computed the definite integral of a\nrational\npower of\nx\nx\nx\nand of\nsin\n⁡\nx\n\\sin x\nsin\nx\n. Computing the integral of\nsin\n⁡\nx\n\\sin x\nsin\nx\nallowed him to solve the problem:-\nTrace on a right cylinder, with a single motion of the compass, a surface equal to that of a given square.\nHe was\n(\nrightly\n)\nvery proud of having solved this problem and, using similar techniques, he was the first to square the surface of the oblique cone in\n1644\n. He worked on the cycloid computing its quadrature before\n1636\nand he also computed the cubature of the solid it generates by rotating it about its base. He compared the lengths of curves, a topic not considered since the times of the ancient Greeks, equating the spiral and parabola in their ordinary forms. Before August\n1648\nhe had discovered the equality of the length of the generalised cycloid and the ellipse. This means that he solved the problem before\nBlaise Pascal\n, who receives the credit for achieving this first in\n1659\n. He computed the arc of the cycloid before\n1640\nby reducing the problem to the integration of the sine. He therefore solved this problem before\nTorricelli\nwho found a solution after\n1644\n. He also computed the arc length of a spiral.\nIn addition to his discoveries on plane curves, Roberval is important for his method of drawing the\ntangent\nto a curve, already suggested by\nTorricelli\n. This method of drawing tangents makes Roberval the founder of kinematic geometry. He writes:-\nBy means of the specific properties of the curved line, examine the various movements made by the point which describes it at the location where you wish to draw the tangent: from all these movements compose a single one; draw the line of direction of the composed movement, and you will have the tangent of the curved line.\nHe developed this method of computing tangents while working on the cycloid some time before\n1636\n. At first he kept this discovery a secret, but he taught the method between\n1639\nand\n1644\n. Roberval wrote a treatise on algebra and one of analytic geometry which appeared in his posthumous\n1693\npublication. He certainly introduced algebraic methods into solving geometric problems before\nRené Descartes\ndid, but although he deserves credit for this nevertheless he did not produce Cartesian geometry.\nHowever, some of his most important contributions were in the area of mechanics. Here is most impressive work was the discovery of the law of composition of forces in\n1636\n. He discovered this general principle while studying a body suspended by two strings. In\n1647\nhe wrote to\nTorricelli\nabout his discoveries in mechanics\n(\nsee for example\n[\n1\n]\n)\n:-\nWe have constructed mechanics which is new from its foundation to its roof, having rejected, save for a small number, the ancient stones with which it had been built.\nHe then went on to give\nTorricelli\nan overview of an intended new eight-volume work on mechanics. The content was planned as follows: Book I, On the centre of action of forces in general; Book II, On the balance, Book III, On the centre of action of particular forces; Book IV, On the chord; Book V, On instruments and machines; Book VI, On the forces which act within certain media; Book VII, On compound movements; Book VIII, On the centre of percussion of moving forces. The treatise has never been found and probably was never written, but parts of each of the eight books exists in Roberval's manuscripts.\nWe mentioned above that\nLe système du monde d'après Aristarque de Samos\nⓉ\n(\nThe system of the world according to Aristarchus of Samos\n)\n(1644)\nwas one of only two publications by Roberval in his lifetime. In this work he praises\nAristarchus\n's heliocentric system but he did not totally reject\nPtolemy\n's earth centered system with the sun and planets circling the earth, or\nTycho Brahe\n's system which has the earth at the centre, but has the planets circling a sun which circles the earth. Roberval writes in the Preface:-\nPerhaps all three of these systems are false and the true one unknown. Still, that of\nAristarchus\nseemed to me to be the simplest and the best adapted to the laws of nature.\nIt is interesting to see that Roberval believes in universal attraction well before it was proposed by\nIsaac Newton\n:-\nIn all this worldly matter, and in each of its parts, resides a certain property by the force of which this matter contracts into a single continuous body.\nIn\n1666\nRoberval was one of a group of scientists making astronomical observations from Jean-Baptiste Colbert's Paris residence. In addition to Roberval the others involved were\nChristiaan Huygens\n,\nPierre de Carcavi\n,\nAdrien Auzout\n,\nBernard Frénicle de Bessy\nand Jacques Buot. In many ways this can be seen as a meeting of the\nAcadémie Royale des Sciences\nbefore its official foundation. Colbert, who was the French Minister of Finance, chose the small group who met in the King's Library on\n22\nDecember\n1666\n, which was the founding meeting of the\nAcadémie Royale des Sciences\n. Roberval was one of these founding members and went on to play an important role as an enthusiastic and energetic member of the Academy in is early years\n[\n5\n]\n:-\nHe read papers on various subjects four times in\n1667\n, nineteen times in\n1668\nand twice in\n1669\n; nine other contributions are recorder during these years. Again, when a German inventor approached Colbert in\n1668\nwith the offer of a secret machine which would solve the problem of calculating the longitude, Roberval was one of a small committee appointed by Colbert to examine the claim\n(\nthe others were\nAuzout\n,\nCarcavi\n,\nHuygens\n,\nPicard\nand a senior naval officer\n)\n. As a senior member of the\nAcadémie des Sciences\nhe made an outstanding contribution to its early activities, bringing to its deliberations an enthusiasm and forcefulness ...\nIn\n1669\nhe invented the 'Roberval balance' which is now almost universally used for weighing scales of the balance type. He presented details to the Academy on\n21\nAugust of that year. He also worked with\nJean Picard\nin cartography and wrote on mapping France. He worked on one of the big questions of the day, whether a vacuum could exist, and designed apparatus which was used by\nBlaise Pascal\nin his experiments. In a report written on\n20\nSeptember\n1647\nhe confirmed\nPascal\n's experiments on the vacuum above an inverted column of mercury in a tube. He explained the suspension of mercury in the tube by the pressure of air on the exterior mercury.\nJacqueline Pascal, the sister of\nBlaise Pascal\n, wrote a letter on\n25\nSeptember\n1647\nin which she describes a meeting between Roberval and\nDescartes\n. The latter did not believe in the existence of a vacuum\n[\n4\n]\n:-\n... they began to discuss the problem of the vacuum. Monsieur\nDescartes\nbecame particularly serious on the subject. The others explained a recent experiment to him and asked him what he thought entered into the space of the emptied tube. He said that it was his \"subtle matter\". My brother\n[\nBlaise Pascal\n]\nresponded to this theory as best he could. Believing that my brother was having some difficulty expressing himself, Monsieur de Roberval took on Monsieur\nDescartes\nwith not a little passion - although he remained civil. Monsieur\nDescartes\nresponded rather bitterly that he could speak to my brother as long as he desired because my brother spoke reasonably but that he wouldn't continue to talk with Monsieur de Roberval, because the latter spoke out of too many prejudices.  With that, he glanced at his watch and saw that it was noon. He stood up, because he had a dinner date in the Faubourg Saint-Germain. Monsieur de Roberval also had a date in the same neighbourhood. So Monsieur\nDescartes\nled him over to a carriage where the two of them were alone. They appeared to be joking with each other, but there was a bit of an edge to their humour, as Monsieur de Roberval confirmed after he returned from dinner ...\nWe see from this letter the friction between Roberval and\nDescartes\n. Not only did they argue over scientific issues, but they also showed a strong mutual dislike of each other. As well as meeting with other scientists in Paris, Roberval also corresponded regularly with\nPierre de Fermat\nand with\nEvangelista Torricelli\nuntil his death in\n1647\n. He had some close friends such as Abbé Gallois who was the editor of\nLe Journal des Sçavans\nfrom\n1665\nto\n1674\n, secretary of the\nAcademy\nin\n1668\nand\n1669\nand later professor of Mathematics and Greek at the Collège de France. Other close friends included\nPierre de Carcavi\nand Desnoyers, the Queen Mother's Secretary.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}