{
  "nome_completo": "Jean Georges Gilles Pisier",
  "nome_curto": "Gilles Pisier",
  "ano_nascimento": "1950",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pisier/",
  "lugar_nascimento": "Nouméa, New Caledonia",
  "lugar_morte": null,
  "biografia": "Gilles Pisier\nwas born in Nouméa, the capital of the French overseas country of New Caledonia in the southwest Pacific Ocean, situated about\n1500\nkm east of Australia. His father, who was colonial governor of New Caledonia, had previously served as colonial governor of Vietnam. Gilles has an older sister, Marie-France, born in\n1944\nwhile their father was serving in Dalat, Vietnam; she is now a well-known French actress. In\n1956\n, while Gilles was approaching his sixth birthday, the family returned to Paris when Gilles was educated. He attended the Lycée Buffon in Paris from\n1966\nto\n1967\n, being awarded his Baccalauréat in\n1967\n. He then entered the Lycée Louis-le-Grand in Paris where he prepared for university entrance. After spending the years\n1967\n-\n69\nat the Lycée Louis-le-Grand, Pisier entered l'École Polytechnique in Paris.\nPisier spent the years\n1969\n-\n72\nat l'École Polytechnique. He was awarded his Master's Degree in Mathematics from the Université Denis Diderot, Paris VII, in\n1971\nand a D.E.A. in Pure Mathematics\n(\nwith distinction\n)\nfrom the Université Pierre et Marie Curie, Paris VI, in\n1972\n. The D.E.A.\n(\ndiplôme d'études approfondies\n)\nwas a postgraduate degree which has now been replaced by the M.A.S.\n(\nMaster of Advanced Studies\n)\n. Then in October\n1972\n, as a Stagiaire de Recherche\n(\ntrainee researcher\n)\nat the Centre national de la recherche scientifique\n(\nC.N.R.S.\n)\n(\nNational Centre of Scientific Research\n)\n, he began research for his doctorate with\nLaurent Schwartz\nas his thesis advisor\n[\n2\n]\n:-\nI started being advised by\nLaurent Schwartz\n, and I really profited from the extraordinarily challenging atmosphere of his laboratory at the  École Polytechnique. Very early on I worked with Bernard Maurey who was my elder by three years and greatly influenced me. I really owe him a lot.\nIn October\n1974\nPisier became an Attaché de Recherche having already published a whole range of papers including:\nBases suites lacunaires dans les espaces L\np\nd'après Kadec et Pelczynski\nⓉ\n(\nBases of incomplete sequences  in the  L\np\nspaces of Kadec and Pelczynski\n)\n(1973)\n;\n(\nwith Bernard Maurey\n)\nUn théorème d'extrapolation et ses conséquences\nⓉ\n(\nAn extrapolation theorem and its consequences\n)\n(1973)\n;\n\"Type\" des espaces normés\nⓉ\n(\n'Type' of normed spaces\n)\n(1973)\n;\nSur les espaces de Banach qui ne contiennent pas uniformément de\nl\nn\n1\nl^{1}_{n}\nl\nn\n1\n​\nⓉ\n(\nOn Banach spaces which do not contain uniformly l\n1\nn\n)\n(1973)\nand\n(\nwith Bernard Maurey\n)\nCharactérisation d'une classe d'espaces de Banach par des propriétés de séries aléatoires vectorielles\nⓉ\n(\nCharacterization of a class of Banach spaces by properties of  random vector series\n)\n(1973)\n.\nOn\n10\nNovember\n1977\nPiser was awarded his doctorate from the Université Denis Diderot, Paris VII. He had already published\n16\npapers between\n1973\nand\n1976\n, a remarkable achievement. He was appointed as a Chargé de recherche\n(\nResearch associate\n)\nat the C.N.R.S. in October\n1979\nand, in October\n1981\n, he was appointed Professor of Mathematics at the Université Pierre et Marie Curie, Paris VI. While continuing to hold this position, he was also appointed as a Distinguished Professor at the Texas A&M University in the United States from\n1985\n, being appointed to the A G and M E Owen Chair of mathematics. At Paris VI he became Professeur, classe exceptionnelle\n(\nDistinguished Professor\n)\nin February\n1991\n.\nIn\n[\n2\n]\nhe gives the following overview of his work:-\nMy main research field is functional analysis, taken in a broad sense, ranging from the geometry of\nBanach spaces\nto the theory of star algebras or von Neumann algebras, through single operator theory on a\nHilbert space\n. But, in fact, a hallmark of my work is allowing me to make significant breakthroughs in fields previously thought distinct, in probability and harmonic analysis. ... Perhaps the common thread that reappears every time is the interaction of random phenomena in algebraic structures\n(\nsets of random vectors, random matrices and random operators, etc. ...\n)\n.\nLet us give a few more quotes from\n[\n2\n]\nin which Pisier gives a fascinating account of his contributions up to\n2001\n. He explains that the main inspiration for his work on harmonic analysis was the book:-\n... by\nJ P Kahane\n(\n\"Random series of functions\",\n1968)\nbased on the remarkable work of\nPaley\n,\nSalem\nand\nZygmund\nand the work of his student P Billiard on random\nFourier series\n. My American colleague Michael Marcus and me have been, from the beginning, substantially influenced by this book. We were really keen to solve the problems posed in this book, and it is with immense joy and pride that we have seen \"return\" in the second edition\n(1985)\ncontaining several of our results!\nPisier's main contributions to random\nFourier\nseries are contained in two works, both with Michael Marcus. First there is the book\nRandom\nFourier\nseries with applications to harmonic analysis\n(1981)\n. Jack Cuzick begins a review as follows:-\nThe authors generalize to the framework of locally compact abelian groups some results which were first established for\nRademacher\nseries and later for more general random\nFourier\nseries and for Gaussian processes. Most of the results are also obtained for compact nonabelian groups. While the results are stated in this general setting, the intuition developed in the concrete case of random\nFourier\nseries on a finite interval of the line pervades the presentation. The fundamental property in question is the a.s. uniform convergence of a random\nFourier\nseries and most other results are dependent on the existence\n(\nor not\n)\nof this property.\nThe second of his major works with Michael Marcus on random\nFourier\nseries is the paper\nCharacterization of almost surely continuous p-stable random\nFourier\nseries and strongly stationary processes\n(1984)\n.\nOther major achievements by Pisier include solving a problem posed by\nWalter Rudin\nin\n1960\non Sidon sets and doing fundamental work on probability in\nBanach\nspaces\n[\n2\n]\n:-\nIn this direction, my results are on the classical limit theorems: the law of large numbers, the central limit theorem, the law of iterated logarithm.\nOther areas of Pisier's research appear in the books\nFactorization of linear operators and geometry of\nBanach\nspaces\n(1986)\nand\nThe volume of convex bodies and\nBanach\nspace geometry\n(1989)\n. The first of these came about because of his fascination with\nGrothendieck\n's famous article\nResumé de la théorie métriques des produits tensoriels topologiques\nⓉ\n(\nSummary of the metric theory of topological tensor products\n)\n(1956)\n. Pisier writes\n[\n2\n]\n:-\nThe article ends with a list of six open problems which are a real research agenda for the next generation.\nIn fact the\n1986\nbook:-\n... describes the development centred around the six problems formulated and discussed at the end of the Résumé, and presents various results which led to their solutions.\nThe\n1989\nbook mentioned above was reviewed by Mikhail Ostrovskii who explains that it:-\n... gives an almost self-contained presentation of a number of recent results which relate the volume of convex bodies symmetric with respect to\n0\nin\nn\nn\nn\n-dimensional Euclidean space ... and the geometry of the corresponding finite-dimensional normed spaces. ... This book makes more accessible many important recent results from the theory of convex sets and the local theory of\nBanach\nspaces.\nPisier has received many awards for his outstanding contributions. These include the\nSalem\nPrize\n(1979)\n, the Cours Peccot at the Collège de France\n(1981)\n, the Prix Carrière from the\nAcadémie des Sciences\nin Paris\n(1982)\n, the Grand Prix from the\nAcadémie des Sciences\nin Paris: Prix Fondé par l'Etat\n(1992)\n, the Faculty Distinguished Achievement Award in Research from Texas A&M University\n(1993)\nand the\n1997\nOstrowski\nPrize. The\nOstrowski\nPrize, presented by the\nOstrowski\nFoundation created by\nAlexander Markowich Ostrowski\nand funded by his entire estate, was presented to Pisier on\n25\nApril\n1998\nat the University of Leiden. The citation reads\n[\n1\n]\n:-\nPisier has obtained many fundamental results in various parts of analysis. In recent years he concentrated his efforts on the area of operator spaces. He transformed this area into a deep research area. In the framework of his research on this area Pisier solved in the last three years two extremely long-standing open problems. In C* theory he solved, jointly with Junge, the problem of uniqueness of C* norms on the tensor product of two copies of B\n(\nH\n)\n, the algebra of all bounded operators on\nHilbert\nspace. Pisier and Junge were able to produce two such tensor norms that are nonequivalent. In operator theory Pisier solved\n(\nagain negatively\n)\nthe problem of whether an operator which satisfies the\nvon Neumann\ninequality\n(\nwith a constant\n)\nis similar to a contraction. Both results are based on elegant constructions, and the verifications of the examples are ingenious. Both of these results had a considerable impact and have already led to important further research.\nIn June\n2001\nPisier was awarded the\nStefan Banach\nMedal by the\nPolish Academy of Sciences\n. He was invited to address the International Congress of Mathematicians in Warsaw in\n1983\nwhen he gave the lecture\nFinite rank projections on Banach spaces and a conjecture of Grothendieck\n, and to give the plenary address\nOperator spaces and similarity problems\nat the International Congress of Mathematicians in Berlin in\n1998\n. Twice Pisier has been invited to give plenary addresses to the British Mathematical Colloquium. The first was at the meeting at Heriot-Watt University, Edinburgh, Scotland, in\n1995\n, when he gave the lecture\nOperator spaces and group representations,\nand the second was in\n2004\nat Belfast University when he spoke on\nFactorization of completely bounded maps on \"exact\" C*-algebras and operator spaces\n. He has also been elected to many academies including the Institute of Mathematical Statistics\n(1989)\n, the\nAcadémie des Sciences\n(\ncorresponding member in\n1984\n, full member\n2002)\n, the Real Academia de Zaragoza\n(2002)\nand the\nPolish Academy of Sciences\n(2005)\n.\nFinally let us mention two more recent books by Pisier. First these is the important\nSimilarity problems and completely bounded maps\n(1996)\n. Christian Le Merdy begins his detailed review as follows:-\nThis book is devoted to three similarity problems, which we explain below, concerning unitary group representations, contractions on\nHilbert\nspace, and *-representations on C*-algebras. For each of them, the solutions that were known\n(\nat the time of the writing of the book\n)\nare given with complete proofs and the necessary background. Furthermore, many important related questions are discussed throughout the book. As the title suggests, the author emphasizes the link between these problems and the theory of completely bounded maps on operator algebras\n(\nor operator spaces\n)\n. The book is truly remarkable for at least three reasons. First, it gathers in one volume almost all the important results on similarity problems and is therefore a valuable tool for anybody working on similarity problems. Second, the book contains several new or simplified proofs which shed some new light on several aspects of the problems. Third, the reader can find here several new results and complements not available elsewhere. It will undoubtedly become a reference book on the subject.\nNext we mention\nIntroduction to operator space theory\n(2003)\n. Marius Junge writes:-\nThe recent theory of operator spaces combines operator algebra theory and the theory of\nBanach\nspaces. Pisier's introduction to the subject starts with the basic concepts in this theory and eventually leads the reader to top-notch results. ... Pisier's unique and clear way of presenting the material might even surprise researchers in the field: complicated results look very natural and simple in Pisier's presentation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}