{
  "nome_completo": "Gino Fano",
  "nome_curto": "Gino Fano",
  "ano_nascimento": "1871",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fano/",
  "lugar_nascimento": "Mantua, Italy",
  "lugar_morte": "Verona, Italy",
  "biografia": "Gino Fano\n's father was Ugo Fano and his mother was Angelica Fano. Ugo Fano came from a wealthy family and he had no need for employment. A citizen of Mantua before Italian unification, he was a follower of Giuseppe Garibaldi and strongly in favour of Italian unification. He fought as a volunteer in the Third Italian War of Independence against the Austrians in\n1866\n. The family owned the grand 'Villa Fano' in Colognola with its nearly\n100\nrooms, a huge frescoed ballroom, stables and orchards. Every Sunday morning the family distributed food and money to the needy of the parish. Angelica Fano was, like her husband, a strong supporter of Italian culture and she became an active member of the Dante Alighieri Society which was set up in\n1889\n. Gino was the eldest of his parents five children, having four younger sisters. In fact on\n17\nMarch\n1861\n, ten years before Gino's birth, the Kingdom of Italy had formally created but it was only just before Gino was born that Italian troops captured Rome. Gino grew up in the newly created country which suffered many problems but also had a new confidence in education.\nIn\n1880\nGino Fano entered the Liceo Ginnasio Virgilio in Mantua. The beginnings of this school date back to a Jesuit College founded in\n1584\n, but it was established as the Liceo Ginnasio Virgilio by a decree of King Vittorio Emanuele of\n21\nJune\n1867\n. It gave a rigorously classical education. Now Gino's father, with his patriotic views and military experience, wanted his son to have a military career so, in\n1883\n, at the age of twelve, Gino was sent to study at the military college in Milan. Gino's son Robert, who gave the tribute\n[\n7\n]\n, said:-\nI heard also that\n[\nGino's father\n]\nwas concerned about what effect growing up at home with four younger sisters might have on his son's character!\nGino, however, began to wish that he could study mathematics and physics at university rather than have a military career. His father was not easily persuaded but, with support from his mother, after four years at the military college in Milan, he was allowed to return to Mantua and spend the year\n1887\n-\n88\npreparing for university studies in the Physics and Mathematics Section of the Reale Istituto Alberto Pitentino. This school had been founded as the Istituto Industriale e Professionale in\n1868\nbut, with a Royal Decree of\n16\nAugust\n1879\n, it was transformed into a Government Institute from\n1\nNovember\n1879\n. It was named after the hydraulic engineer Alberto Pitentino. It offered four year courses but Fano was able to go straight into the final year. He brilliantly obtained his diploma and a special prize as an excellent student.\nFano studied at the University of Turin which he entered in\n1888\n. To please his father, he enrolled first in engineering but quickly transferred to mathematics. His studies there were directed by\nCorrado Segre\nand he was also influenced by\nGuido Castelnuovo\n. In fact\nCastelnuovo\nhad been appointed as\nEnrico D'Ovidio\n's assistant in Turin the year before Fano began his studies and\nCorrado Segre\nhad been appointed to the chair of higher geometry in Turin the year that Fano entered the University of Turin. This was an exciting place for research in geometry and it is not surprising that Fano was led to specialise in this area.\nOn\n22\nJune\n1892\nFano graduated with a doctorate from Turin having submitted the thesis, a large part of which was published as the paper\nSopra le curve di dato ordine e dei massimi generi in uno spazio qualunque\nⓉ\n(\nOn curves of given order and of the greatest genera in any space\n)\nin\n1893\n. He was examined by a committee consisting of\nGiuseppe Basso\n,\nEnrico d'Ovidio\n, Nicodemo Jadanza,\nGiuseppe Peano\n,\nMario Pieri\nand\nCorrado Segre\n. The committee awarded Fano the highest possible grade:\n90\n/\n90\ncum laude.\nAlso in\n1893\nhis paper\nStudio di alcuni sistemi di rette considerati come superficie dello spazio a cinque dimensioni\nⓉ\n(\nStudy of some systems of lines considered as surfaces of five-dimensional space\n)\nwas published. In this paper he gives the following acknowledgement to his advisor\nSegre\n:-\nI must also express my heartfelt thanks to the eminent Professor\nC Segre\n, who, having already dealt with this topic for years, kindly wanted to provide me with some of his notes on the subject; notes which were often an excellent guide for me in my research.\nWe have produced a list of Gino Fano's publications with, for many, some information on their contents. In particular there are details of the two paper we have just mentioned which you can read at\nTHIS LINK\n.\nAfter graduating with his doctorate, Fano then spent the year\n1892\n-\n93\nas\nD'Ovidio\n's assistant. He joined a long line of famous mathematicians who had begun their careers as\nD'Ovidio\n's assistant:\nFrancesco Gerbaldi\n(1879\n-\n80)\n,\nGiuseppe Peano\n(1880\n-\n83)\n,\nCorrado Segre\n(1883\n-\n84)\n,\nGino Loria\n(1884\n-\n86)\n,\nGuido Castelnuovo\n(1887\n-\n91)\n, Gino Fano\n(1892\n-\n93)\n. In\n1893\n, he went to Göttingen to undertake research and of course to study under\nFelix Klein\n. Twenty years earlier, in\n1872\n,\nKlein\nhad produced his synthesis of geometry as the study of the properties of a space that are invariant under a given group of transformations, known as the Erlanger Programm\n(1872)\n. The Erlanger Programm gave the unified approach to geometry that is now the standard accepted view.\nCorrado Segre\nhad corresponded regularly with\nKlein\nand in this way Fano had been brought to\nKlein\n's attention. In fact this had led to Fano translating the\nErlanger Programm\ninto Italian while he was an undergraduate at Turin and it had been published in the\nAnnali di matematica\nin\n1890\n. Of course Fano did indeed study with\nKlein\nin Göttingen where he attended his lectures on hypergeometric function, on second-order linear differential equations, and on elementary geometry.\nAlessandro Terracini\nwrites in\n[\n22\n]\n:-\nKlein\n's personality certainly had a notable influence on Fano, who arrived in Göttingen with a profound geometrical education drawn from the school of\nCorrado Segre\nand\nGuido Castelnuovo\n: not only for the specific fields of research that\nKlein\npointed out to him ... but above all for the acquisition and strengthening of certain ideas, such as the importance of group conceptions, and also the importance of intuition in the progress of mathematics and especially geometry.\nWhile in Göttingen, Fano was particularly impressed with the Mathematics Library. He wrote\n[\n18\n]\n:-\nThose who are enrolled in the Seminar can also make use, if they wish, of the reading room\n(\nMathematisches Lesezimmer\n)\nand its library. The aim of this institution is to make available to students above all those books and journals that it is most frequently necessary to consult; and precisely in order to not betray this purpose and to constantly place everything at the disposal of all, it is strictly forbidden to issue books and journals on loan. Those who wish to take some volume home can contact the General Library\n(\nUniversitätsbibliothek\n)\n... Among the new collections, a major role is played by the journals, especially German and French\n(\nof Italian periodicals, unfortunately, not a single one\n)\n, for a total value of\n300\nmarks a year.\nFano became\nCastelnuovo\n's assistant in Rome in\n1894\n, a position he held for four years. During these years he made important contacts with various mathematicians in Rome and especially with\nLuigi Cremona\n. Although\nCremona\nhad been appointed to the chair of higher mathematics at the University of Rome in\n1877\n, he soon took up a political career becoming a senator of the Kingdom of Italy in\n1879\n. Both\nCremona\nand Fano were highly patriotic so the contacts were special for Fano. The first International Congress of Mathematicians was held in Zurich in August\n1897\n. Fano attended this congress and delivered the lecture\nÜber Gruppen, inbesondere kontinuierliche Gruppen von Cremona-Transformationen, der Ebene und des Raumes\nⓉ\n(\nOn groups, in particular continuous groups of Cremona transformations, of the sphere and of space\n)\nto the Geometry Section. He gave the lecture in German and it was published in the\nProceedings\nof the Congress. In Rome Fano's research career continued to flourish and he made contributions to continuous groups and their invariant projective varieties, to geometric properties of linear differential equations, and to line geometry. He had\n33\npublications between\n1895\nand\n1899\n.\nYou can see all their titles and further information about some of them at\nTHIS LINK\n.\nFollowing this assistantship, Fano went to Messina in the extreme north east of Sicily where he worked from\n1899\nto\n1901\n. The appointment came about because Fano had applied for the vacant full professorship of algebra and analytical geometry at the University of Pavia. In the competition for that chair he had been ranked second to\nLuigi Berzolari\nwho accepted the chair so Fano was offered the post of associate professor in algebra and analytical geometry at the University of Messina which he accepted on\n1\nDecember\n1898\n. In\n1900\nhe attended the second International Congress of Mathematicians in Paris but did not give a lecture. He had left Messina well before an earthquake struck the city on\n28\nDecember\n1908\n, almost totally destroying it and killing\n78000\n. By this time Fano was far away in Turin where he had been appointed as professor of projective and descriptive geometry at the University in\n1901\n.\nThe move to Turin happened because when\nLuigi Berzolari\nmoved to the chair at the University of Pavia, he left his position of associate professor in algebra and analytical geometry at the University of Turin. When the competition for the vacant position in Turin was announced, Fano entered that and was ranked first. Now it says much about Fano's character that he chose to turn down an offer of a post at Göttingen made to him in\n1899\nby\nFelix Klein\n.\nArthur Schönflies\nleft Göttingen in\n1899\nto take up a chair at the University of Königsberg and\nKlein\nwanted Fano to fill the vacant professorship.\nKlein\nwrote to Fano on\n5\nFebruary\n1899\n:-\nI see the professorship essentially as a geometric professorship, i.e. I hope that the new appointee will emphasise the geometric view and enliven geometric studies in all directions. But you know about the decline of geometry in the younger German generation. So I thought that you might be just the right man for us!... Please let me know immediately whether you think it would be possible for you to come here ...\nKnowing the world leading position of mathematics in Göttingen at this time and the high regard that Fano had for\nKlein\nas a mathematician, it might come as a surprise that Fano would turn down this offer. The answer, however, is that he certainly did not decline it for mathematical reasons. Rather he declined it because he was a highly patriotic Italian who wanted to live in Italy and wanted to work for strengthening Italian mathematics. In\n1904\nFano was invited as a special guest to the\n11\nth Summer Meeting of\nAmerican Mathematical Society\nto be held in St Louis on Friday and Saturday,\n16\n-\n17\nSeptember\n1904\n. The Society had made two special invitations, one to Fano and the other to\nHenri Poincaré\n. Fano sailed from Genoa on the German steamship\nPrinzess Irene\n, arriving in New York on\n24\nAugust\n1904\n.\nOn\n4\nOctober\n1911\nFano married Rosetta Cassin\n(\nknown as Rosa\n)\n. Born in Turin\n[\n2\n]\n:-\nRosa, was an accomplished artist, landscape painter and musician with exquisite social manners. .. she came from a family of engineers and technocrats ...\nFrom their marriage until they left Italy in\n1939\nthey lived in one of the apartments in the building at Corso Vittorio Emanuele II,\n105\nat the corner of Corso Vinzaglio. Gina and Rosa Fano had two children: Ugo Fano\n(28\nJuly\n1912\n-\n13\nFebruary\n2001)\nbecame a theoretical physicist studying under\nEnrico Fermi\nand\nWerner Heisenberg\n, and then professor at the University of Chicago; and Roberto Mario Fano\n(11\nNovember\n1917\n-\n13\nJuly\n2016)\n, known as Robert, became a computer scientist studying under\nClaude Shannon\n, and then professor of electrical engineering and computer science at the Massachusetts Institute of Technology.\nWorld War I broke out in\n1914\n. Fano immediately volunteered for military service and became a lieutenant. His greatest contribution to Italy's war effort, however, was the four years, from September\n1915\nto March\n1919\n, during which time he directed the\nRegional Committee for Industrial Mobilisation for Piedmont\n. He showed himself to be an expert in the recent and contemporary political history, and he gave various propaganda speeches, including a lecture he delivered at the Turin Cultural Society on\n11\nJune\n1915\nentitled\nIl confine del Trentino e le trattative dello scorso aprile con la monarchia Austro-Ungarica\nⓉ\n(\nThe border of Trentino and the negotiations of last April with the Austro-Hungarian monarchy\n)\n.\nYou can read the beginning of Fano's lecture at\nTHIS LINK\n.\nThe years of World War I,\n1914\n-\n18\n, saw Fano's time devoted to supporting his country and he had no time for mathematical research. He resumed his research in\n1919\nand published six papers in\n1920\n. In\n1922\nMussolini became prime minister of Italy after the fascist coup. Ugo Fano, Gino Fano's son, wrote in\n[\n11\n]\n:-\nMy grandfather\n[\nUgo Fano, Gino's father\n]\nwas distraught - I do not know whether he saw further than we did, whether his sense of fair play and devotion to the rule of law made it impossible for him to accept the sudden departure from constitutional practice, or whether he was mainly shocked by the bad manners and gross behaviour of the fascists. Anyway, until he died, he was vociferously opposed though too old to do anything about it. I think my father\n[\nGino Fano\n]\nwas also displeased but much calmer. He was involved in his scientific work, which the fascists did not disturb. He was certainly strongly nationalistic, Italy was \"my country right or wrong\", and my impression is that he considered Mussolini and his cohorts like a childhood disease of a very young nation, a terrible nuisance but a stage that would pass.\nWe have not mentioned up to this point the fact that the Fano family were Jewish. It has not been relevant to Fano's career up to this point but sadly, moving into the\n1930\ns, the fascists would totally disrupt the careers of Fano and both his sons. However, as his son Ugo Fano says in the above quote, in the years after the fascists came to power they did not do anything to restrict Fano's work.\nIn\n1923\nFano was invited to the University College of Wales, in Aberystwyth, where he gave a series of lectures on \"Italian geometry\". He also gave two lectures aimed at a wider audience, namely 'All Geometry is theory of Relativity', and 'Intuition in Mathematics'.\nYou can see some details of the contents of these two lectures at\nTHIS LINK\n.\nA meeting of the\nUSSR Academy of Sciences\nwas held in Moscow on\n13\nSeptember\n1925\nto celebrate the\n200\nth anniversary of the\nRussian Academy of Sciences\n. Gino Fano and\nGuido Fubini\nrepresented the University of Torino. In the following year, Fano was back in the USSR when he attended a conference,\n12\n-\n24\nFebruary\n1926\n,  organised by Kazan University to celebrate the centennial of\nLobachevsky\n's non-Euclidean geometry. All speakers placed emphasis on\nLobachevsky\n's influence on modern scientific thought. Fano gave the lecture\nLes cycles de la géométrie non euclidienne au point de vue projectif\nⓉ\n(\nThe cycles of non-Euclidian geometry from the projective point of view\n)\nwhich was published in\n1927\nin the\nProceedings\n. In September\n1928\nthe International Congress of Mathematicians was held in Bologna. At this Congress, delegates were welcomed by the Podestà of Bologna, Hon L Arpinati, who said:-\nFascist Bologna is proud to welcome you and to be able to show you what it has become under the vivifying impulse of Fascism.\nFano was certainly no lover of Fascism but he tried to keep out of politics completely. At the Congress he gave two lectures\nSulle varietà algebriche a tre dimensioni aventi tutti i generi nulli\nⓉ\n(\nOn three-dimensional algebraic varieties with all genera zero\n)\nand\nTransformazioni di contatto birazionali del piano\nⓉ\n(\nBirational contact transformations of the plane\n)\n. Keeping out of politics became harder, however, for in August\n1931\nthe oath of loyalty to fascism was imposed on Italian University professors. It includes the words:-\n... I swear to respect the National Fascist Party's Statute and the other laws of the State, and to fulfil my teacher's and all academics' duties with the aim of preparing industrious and righteous citizens, patriotic and devoted to the Fascist regime.\nIn\n1933\nthe rector of the University of Turin put pressure on all academic staff to join the Fascist Party. In his attempt to keep out of politics, Fano joined the Fascist Party.\nIn\n1938\nItaly carried out a racial census. Fano completed the census giving the following information\n[\n16\n]\n:-\nFollowing a kindly request, I only agreed for some years to pay an annual fee to the Turin Jewish community, purely as a contribution to the local charitable works. ... The Fano family has not converted to Christianity\n(\nexcept for one sister, Catholic since\n1921)\n. However, we have gradually abandoned the Israelite religion, over the course of\n2\n-\n3\ngenerations. Personally, already in the\n1911\ncensus I declared that I did not belong to any religion and I have always confirmed it, even when I agreed to the payment mentioned above.\nOn\n16\nOctober\n1938\nhe was expelled from his chair by the Fascist Regime. He was also expelled from all Italian scientific institutions and academies, the Reale Accademia delle Scienze di Torino, the\nReale Accademia dei Lincei\n, the Reale Istituto Lombardo di Scienze e Lettere, the Reale Accademia Peloritana di Messina, the\nCircolo Matematico di Palermo\n, the\nUnione Matematica Italiana\n, the Società Italiana per il Progresso delle Scienze, and the Reale Accademia Virgiliana di Mantova.\nLet us at this point give a little information about Fano's time as director of the Special Mathematics Library in Turin from\n1924\nuntil\n1938\n. Erika Luciano writes\n[\n18\n]\n:-\nWith Fano, a new period in the history of the Special Mathematics Library began. First of all, while the international drive of the library dated back to the years of its creation, the true strengthening of its cultural cosmopolitanism occurred in this time, and mirrored the new director's personality. ... Fano had travelled across Europe and beyond, entering into contact with scientific centres worldwide, and intensifying the exchanges with the so-called 'peripheries'. The most evident sign of the internationalist impact of Fano on the Special Mathematics Library is the activation of dozens of new subscriptions to foreign journals, including the Russian 'Recueil mathématique de la Société Mathématique de Moscou', the Swedish 'Archiv for Mathematik', 'Astronomi och Fysik', the Polish 'Fundamenta Mathematicae' and the Romanian 'Mathematica Cluj'. Fano was personally in contact with the editors or the authors of the majority of these journals. A single example will suffice: the Special Mathematics Library received the 'Revista' published by the faculty of sciences of the Universidad Mayor of San Marcos in Lima, thanks to Fano's relationships with\nAlfred Rosenblatt\n, who had spent years studying in Italy at the school of algebraic geometry, before being invited as visiting professor in Peru.\nAfter Fano was expelled from his professorship, he had to make a decision about his future. His sons, Ugo aged\n26\nand Roberto aged\n21\n, were both setting out on academic careers but were now unable to do so in Italy. Both sons favoured emigrating to the United States but Gino Fano, who had visited the United States several times, felt that there was too much anti-Semitism there and, perhaps even more significantly, he anticipated the war and the United States being an enemy of Italy. Even after being expelled from his chair, he was still a strongly patriotic Italian who felt he could not live in a country at war with Italy. He decided to move to Switzerland which he did in\n1939\n. His son Roberto wrote\n[\n7\n]\n:-\nThose events also caused the only serious disagreement between my parents: my mother wanted to follow her children to the United States, while my father, as he told me before my departure, would never go to a country likely to be at war with Italy. They adapted their lives to the realities of the times, and lived for seven years in a room of modest size in a small hotel in Lausanne, with father resuming his work routine at a small desk in that room.\nIt is reasonable to wonder at this stage how the Fano family financed the travels and living in a hotel in Switzerland for seven years since Jews were not allowed to transfer money from Italy. We are unsure exactly how this was possible but certainly it was Roberto Fano who managed to transfer large amounts of the Fano family money to Switzerland with some clever scheme to evade the fascist laws.\nIn Switzerland Gino Fano taught Italian students at an international camp near Lausanne. After the end of World War II, Fano travelled from Switzerland to Le Havre, France, from where, with his wife, he sailed on the ship\nWashington\nto the United States to visit his sons. Returning to Italy, he was reinstated to his chair in Turin but, now\n75\nyears old, he retired and was made professor emeritus. For the final six years of his life he spend winters in the United States and all summers except\n1950\nin Italy, at the family villa near Verona.\nAs we have seen, Fano's work was mainly on projective and algebraic geometry. Fano was a pioneer in finite geometry and one of the first people to try to set geometry on an abstract footing. Before\nHilbert\nwas to make such abstract statements, Fano wrote in his\n1892\npaper\nSui postulati fondamentali della geometria in uno spazio lineare ad un numero qualunque di dimensioni\nⓉ\n(\nOn the fundamental postulates of geometry in a linear space with any number of dimensions\n)\n:-\nAs a basis for our study we assume an arbitrary collection of entities of an arbitrary nature, entities which, for brevity, we shall call points, but this is quite independent of their nature.\nStruik\n, in\n[\n20\n]\n, summarises Fano's contribution:-\nEarly studies deal with line geometry and linear differential equations with algebraic coefficients ... . Later work is on algebraic and especially cubic surfaces, as well as on manifolds with a continuous group of\nCremona\ntransformations. He showed the existence of irrational involutions in three-space\nS\n3\nS_{3}\nS\n3\n​\n, i.e., of \"unirational\" manifolds not birationally representable on\nS\n3\nS_{3}\nS\n3\n​\n. He also studied birational contact transformations and non-euclidean and non-archimedean geometries.\nIn addition to his papers, Fano wrote a number of popular textbooks. In particular we should mention\nLezioni di geometria analitica e proiettiva\nⓉ\n(\nLessons in analytic and projective geometry\n)\nwhich he co-authored with\nAlessandro Terracini\n. First published in\n1929\n, the third edition of this book was published in\n1958\n.\nYou can see more details of Fano's contributions from our list of his publications, many of which have comments about their contents: see\nTHIS LINK\n.\nLet us end with quoting from\n[\n4\n]\n:-\n... it is perhaps the right moment for mentioning the deep and positive influence of Fano, as a person and as a teacher, on so many persons and brilliant students, as well as mentioning the sign he left during the long years spent as a professor. In the year\n1950\na group of persons, made up of former students and friends, organised in Turin a series of lectures by him as a homecoming celebration in his honour. Reading the list of these persons, in the volume of this event, is impressive, and instructive of the above mentioned influence of Fano. In the list, together with other famous mathematicians, one can see the name of\nBeniamino Segre\n. His words can serve as an epilogue for a long, great life in geometry. Perhaps they can serve for an entire geometric age, in the years of transition from older to newer algebraic geometry: \"with gratitude and admiration to Professor Gino Fano, whose brilliant lectures on projective geometry - way back in\n1919\n-\n20\n- had a decisive effect on me, irresistibly attracting me towards geometric studies.\"\nGuido Castelnuovo\ndied on\n27\nApril\n1952\nand Fano was asked to write a commemoration for his friend and present it at a meeting of the\nAccademia dei Lincei\nin December\n1952\n. Although Fano completed writing the paper, he was not able to deliver it since he was taken to hospital in Verona where he died on\n8\nNovember\n1952\n. He was buried in his family tomb in Mantua.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory"
  ]
}