{
  "nome_completo": "Giovanni Giorgio Bidone",
  "nome_curto": "Giorgio Bidone",
  "ano_nascimento": "1781",
  "ano_morte": "1839",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bidone/",
  "lugar_nascimento": "Rosano, Casalnoceto, Tortona, Piedmont, now Italy",
  "lugar_morte": "Turin, Kingdom of Sardinia, now Italy",
  "biografia": "Giorgio Bidone\n's parents were Alessandro Antonio Bidone and Margherita Malaspina, the daughter of the Marchese Mercurio Malaspina\n(\ndied\n1776)\nand Maddalena Poggi\n(\ndied\n1805)\n. Alessandro and Margherita were married in Godiasco on\n17\nSeptember\n1774\n. In\n1782\n, when Giorgio was one year old, the family moved to Voghera where Giogio was brought up and where he was educated. The town of Voghera is on the Staffora River, southwest of the city of Pavia.\nWe have direct accounts of Giorgio Bidone's life, from his former students, who were to become famous figures:\nLuigi Federico Menabrea\n(1809\n-\n1896)\n, at the time he wrote his account\n(1841)\na young engineering officer and later on general, scientist\n(\na hydraulic scientist too\n)\nand politician, and Massimo D'Azeglio\n(1798\n-\n1866)\n, painter, novelist and politician, who speaks at length of him in his brilliant autobiography published posthumously\n(1867)\n.\nAfter his studies in Voghera, Bidone entered the Filipino College in Turin, where, because he was seen to have a serious and meditative personality, the religious fathers of the college directed him towards an Ecclesiastical life. However, led by Napoleon Bonaparte, the French army invaded north Italy in March\n1796\nand the Peace of Paris on\n15\nMay\n1796\n, saw Piedmont annexed by France. The new laws imposed in the state of Savoy forced Bidone to abandon his religious studies and, as a consequence, he dedicated himself to studying mathematics and science.\nBecause of the abilities he had demonstrated, in\n1799\nBidone was accepted into the Collegio delle Province. This College had been established in Turin to educate the best students from the Savoy provinces and had been preserved by the French Administration when they took over. While studying at this College, Bidone also studied at the University of Turin. Before graduating in\n1803\n, he was appointed as a private teacher at the same College. Another student at the College was Amedeo Avogadro\n(1776\n-\n1856)\n, later known for Avogadro's law on the temperature and pressure of gases, and the two began a lasting friendship.\nIn\n1803\nBidone graduated in mathematics and hydraulic engineering at the University of Turin, and in\n1805\nhe was awarded a degree in civil architecture. In the same year the Academy of the Sciences of Turin accepted two of his works on mathematics and he was elected resident member. In\n1811\nhe was a member of the Turin Agricultural Society. In the initial years after his degree he dedicated himself intensively to mathematics. He published\nRecherches sur la nature de la trascendante\n∫\nd\nx\n/\nlog\n⁡\nz\n\\int  dx/\\log z\n∫\nd\nx\n/\nlo\ng\nz\nⓉ\n(\nResearch on the nature of the transcendent ∫ dx / log z\n)\n(1809)\nand\nMéthode pour reconnaître le nombre de solutions qu'admet une équation trascendante à une seule inconnue\nⓉ\n(\nMethod for recognizing the number of solutions admitted by a transcendent equation in one variable\n)\n(1809)\nin the Memoirs of the Academy of the Sciences of Turin. His research at this time was on the solution of transcendental equations and also on definite integrals with papers such as\nSur diverses integrals définies\nⓉ\n(\nOn various definite integrals\n)\n(1813)\n, in which he used the method of\nMascheroni\nseries to reduce various integrals to known cases, and\nSur les transcendantes elliptiques\nⓉ\n(\nOn  elliptic transcendants\n)\n(1818)\nin which he extended the work of\nLegendre\non the numerical values of elliptic functions of the first and second kind. His work on elliptic functions was, however, soon overtaken by that of\nAbel\nand\nJacobi\nwho introduced a new setting which meant that Bidone's paper was soon forgotten except by\nGiovanni Plana\nwho published two further papers based on this paper by Bidone.\nBidone also carried out an argument with French mathematicians in the\nAnnales de mathématiques Gergonne\nin\n1810\n-\n1811\nabout the solution of the problem of constructing, in a given triangle, three circles each of which is tangent to the other two and the two sides of the triangle.\nIn\n1811\nBidone was nominated acting professor and in\n1815\nhe was appointed to the chair of hydraulics at the University of Turin. At the same time, from\n1811\n, he was an assistant and later head of the\nStabilimento delle experienze idrauliche\nⓉ\n(\nThe establishment for hydraulics experiments\n)\nat Parella, the first permanent European hydraulics laboratory established in\n1763\nby Francesco Domenico Michelotti\n(1710\n-\n1777)\nand used by the university for hydraulics experiments. It had a tower seven metres high that allowed observations and measurements of phenomena related to the control of irrigation. At the start of his university career, Bidone found support from the Count Prospero Balbo\n(1762\n-\n1837)\n, the interior minister and rector of the university. In the Turin university environment, he continued his friendship with the chemist Amedeo Avogadro and with his colleague and compatriot\nGiovanni Plana\n, who initially also dedicated himself to research in hydraulics and mathematics and later solely to astronomy having been appointed to the chair of astronomy at the University of Turin in\n1811\n.\nWe should note that, following the defeat of Napoleon, the Congress of Vienna\n(1814\n-\n15)\nestablished political order in Italy and King Victor Emmanuel I of Savoy recovered the territories of Nice, Savoy and Piedmont as well as the coastal area around Genoa. As a university professor, Bidone was an advisor to the Government of this region. In\n1817\n, together with Ignazio Michelotti\n(1764\n-\n1846)\n, son of Francesco Domenico, supervisor of rivers and chief inspector of canals, he drafted the new\nRegolamento per le strade, ponti ed acque\nⓉ\n(\nRegulation for roads, bridges and waterways\n)\n, as required by Victor Emmanuel I. The fame he acquired as a hydraulics scientist would determine the role he played as an advisor. For his part concerning the waterways in the new\nCodice civile\nⓉ\n(\nCivil Code\n)\n, promulgated by Carlo Alberto in\n1837\n, this collaboration earned him the\nOrdine al merito civile di Savoia\nⓉ\n(\nOrder of Civil Merit of Savoy\n)\nin\n1839\n.\nIt is worth noting that the hydraulic legislation in Piedmont, compiled with Bidone's technical contribution, was not just at the forefront in Italy; the new Law that Carlo Alberto implemented clearly in twelve articles, numbered from\n622\nto\n633\n, involving the introduction of maintenance of aqueducts, first introduced in practice by the Duke of Milan, spread to other parts of Europe.  Benjamin Nadault de Buffon\n(1804\n-\n1880)\n, after visiting northern Italy, claimed that the Piedmont legislation was the most modern and he proposed it as a model for France\n(\nsee\nDes Canaux d'arrosage de l'Italie septentrionale dans leur rapports avec ceux du Midi de la France\nⓉ\n(\nIrrigation canals of northern Italy in their relations with those of the South of France\n)\n(\nCarilian-Goeury and V Dalmnt, Paris,\n1843\n-\n1844))\n.\nAs an hydraulics expert, Bidone was also called on to conduct advisory work in practical questions connected to the region, questions that in time were called\naffari d'acque\nⓉ\n(\nWater affairs\n)\n. For example, in\n1817\nhe was called on, together with Ignazio Michelotti and Vincezo Brunacci\n(1768\n-\n1818)\n, a professor at Pavia, to a report on the Naviglio Sforzesco, a canal at Vigevano. According to\nMenabrea\n[\n6\n]\n, Bidone was reluctant to get involved in these undertakings, although lucrative, which took time away from his studies:-\nSimple and modest in his desires, he loved science for its own sake, and he never used it to pursue dreams of ambition and wealth.\nAfter his initial mathematical period, Bidone's prevailing interests focused on experimental hydraulics, in which he achieved great scientific success, starting from the publication of work\nExperiences sur le remou et sur la propagation des ondes\nⓉ\n(\nExperiments on eddies and on the propagation of waves\n)\n(1820)\n, which made him known on a European level. In the two-year period\n1822\n-\n1823\n, he participated in an international campaign of geodetic and astronomical work, conducted with his friend\nGiovanni Plana\n, for linking across the Alps, the triangulations of Western Europe with that of Eastern Europe. According to\nMenabrea\n, this is only an example of professor Bidone's altruism, always ready to help his colleagues in undertakings of public interest, from which he did not derive any celebrity:-\n... there is another work, as valuable though less striking, which shows him, no longer the man who aspires to be a celebrity, but the modest scholar whose only goal is to be useful to his fellow citizens.\nBidone also played an important role in teaching mathematics at the University of Turin and, in\n1842\n, he was appointed to a new professorship in descriptive geometry.\nOver the years his reputation, and the recognition he received with academic awards, grew. In\n1826\nhe was elected to the Academy of Modena, and in\n1828\nto the Academy of Palermo. He was a member of the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\n.\nAs a researcher, Bidone adopted an interesting method for his scientific discipline, reflected in the published memoirs of the Academy of Sciences of Turin. These were written predominantly in French, which was rather natural when he began publishing since at this time Turin was part of France, but he continued to use French as his language of choice after the Congress of Vienna restored the Kingdom. We saw above that his first papers were on pure mathematical topics and this stood him in good stead with his hydraulic research. However, with his hydraulic research he combined experimentation with theoretical work based on mathematical models. For example, in his study of overflow, after verifying by experimental means that the upstream propagation of an obstacle is accompanied by an increase in the water level, he established the shape of the liquid surface, and derived, by using pure mathematics, the equations for describing the expanse and height of the overflow. Another example of his use of interplay with theory and experiment is in his memoir\nSur cause des ricochets que font les pierres et les boulets de canon, Lances obliquement sur la surface de l'eau\nⓉ\n(\nCause of the ricochets that the stones and the cannon-balls make landing obliquely on the surface of the water\n)\n(1813)\n, where, through a long series of experiments conducted and interpreted with ingenuity, skill and acumen, he displayed an \"analytical theory\" of the phenomenon which at that time intrigued both physicists and mathematicians. In other work he studied the motion of water in canals which were being constructed in Piedmont at this time both for irrigation and for industrial use.\nMany consider the memoir\nExpériences sur le Remou et sur la propagation des ondes\nⓉ\n(\nExperiments on eddies and on the propagation of waves\n)\n(1820)\nto be Bidone's masterpiece. It contains an experimental demonstration of the wave theory expounded by\nPoisson\nto the Institut de France in\n1816\n, and of Eytelwein's formula\n(\nnamed after Johann Albert Eytelwein\n(1764\n-\n1848))\nfor river discharges which he had presented to the\nBerlin Academy of Sciences\nin\n1815\n. This\n1820\npaper also contains an investigation of what has been called the\nSalto di Bidone\nⓉ\n(\nBidone's jump\n)\nthat occurs when a fast flowing current reaches the conditions of a slow current, dissipating part of its kinetic energy in a vortex.\nWe mentioned above the hydraulics laboratory at Parella, to the west of Turin, where Bidone conducted his experiments.\nJean Nicolas Pierre Hachette\nwas so impressed with these facilities that he described it with excitement, and proposed it as a model for a similar establishment to be constructed near to Paris, fed by the Ourc canal.\nWe are fortunate to have accounts of Bidone's character from those who knew him well. Bidone led a solitary life, as a single man who made few friendships, fully dedicated to teaching, study and scientific research and apparently hardly interested in historical events, that during his life unsettled Europe.  However, it would be wrong to think of him as having a dull personality.\nMenabrea\nremembers his teacher as a man of serious deportment, who inspired respect, but full of kindness and goodness, that above all manifested itself in educational visits to Parella, designed to reinforce with experimental hydraulics the theory learnt in the classroom, in an engaging environment\n[\n6\n]\n:-\nBut the seriousness of the Professor vanished in the most intimate relationships, and his goodness showed itself especially when each year he returned, with his pupils, to the establishment of Parella. There, away from the hubbub of the town, under these bushy trees, in the middle of charming nature, fusing memories of the past with the present, he explained the principles of natural philosophy.\nMassimo d'Azeglio provides a very lively portrait of Bidone as an intelligent and sensitive educator. In\n1813\nthe marquise's father turned to him to straighten out his wayward son Massimo: a role that was usually carried out by clergymen. Bidone began to teach him mathematics, but he understood immediately that there was no use in forcibly instructing; he therefore adopted a crafty Socratic method to gradually convince him, with tact and without preaching, to engage with method and to persevere in the things that he believed in, which was primarily painting, and in the end he succeeded with his educational task. The student, converted with patience and love from his teacher, writes\n[\n1\n]\n:-\nFrom his conversations, more so than from his scientific teachings, I extracted the greatest profits; what my poor priest could not teach me ... I learnt side by side, to think, to reflect, to reject false ideas, and to make of them some exactness. ... I should kiss the ground where this man places his feet. After my mother and father, there is no person in the world, to whom I have as many obligations as to him.\nMassimo d'Azeglio also speaks of the house where Bidone lived\n[\n1\n]\n:-\nI entered into this clean apartment which was so simple and austere; exact and precisely ordered like a page of calculations. I have never seen a house of a more faithful appearance than the one in which he lived.\nAfter a long and painful illness, endured with resignation, Giorgio Bidone died in Turin aged\n58\n.",
  "math_areas": []
}