{
  "nome_completo": "Giovanni Enrico Eugenio Vacca",
  "nome_curto": "Giovanni Vacca",
  "ano_nascimento": "1872",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vacca/",
  "lugar_nascimento": "Genoa, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Giovanni Vacca\nwent to school in Genoa and at this time he was politically very active. In\n1892\nhe helped Filippo Turati, a young lawyer from Milan, to found the Italian Workers' Party\n(\nPartito dei Lavoratori Italiani\n)\n. The following year the party was renamed the Italian Socialist Party\n(\nPartito Socialista Italiano\n)\n. The party was mainly social democratic. It believed in the class struggle and aimed to win seats in parliament. The party had Marxist views but it expected to slowly influence people towards its views.\nVacca entered the University of Genoa to study mathematics. However in\n1894\nCrispi dissolved the Party and the leaders of the Party, including Vacca were banished from Genoa. The banishment was in\n1897\nand, fortunately, this allowed Vacca to graduate that year before moving away from Genoa. He moved to Turin where he became\nPeano\n's assistant in November\n1897\n.\nIn\n1899\nVacca went to Hannover to study the unpublished manuscripts of\nLeibniz\n. The following year Vacca attended the First International Congress of Philosophy which was held in Paris in\n1900\n. At the Congress Vacca met\nCouturat\nand, the following year,\nCouturat\nwrote in the preface of\nLa Logique de Leibniz\nⓉ\n(\nThe logic of Leibniz\n)\n:-\nOur work on the logic of\nLeibniz\nwas almost completed\n(\nat least we thought so\n)\nwhen we had the pleasure, at the International Congress of Philosophy\n(\nAugust,\n1900)\n, of making the acquaintance of Mr Giovanni Vacca, at that time mathematical assistant at the University of Turin, who had examined, the year before, the manuscripts of\nLeibniz\npreserved in Hannover, and had extracted from them several formulae of logic inserted in the \"Formulaire de Mathématiques\" of Mr\nPeano\n. It was he who revealed to us the importance of the unpublished works of\nLeibniz\n, and inspired us with the desire to consult them in turn.\nIn\n1903\nVacca published a collection of short works by\nLeibniz\nand some of his papers which had not been previously published. However before this, in\n1902\n, Vacca's position as\nPeano\n's assistant came to an end and he had returned to Genoa.\nDespite the dissolution of the Italian Socialist Party in\n1894\n, it had been revived in the late\n1890\ns and won\n32\nparliamentary seats in\n1900\n. Vacca, on his return to Genoa in\n1902\n, worked for the Party again becoming a member of the Socialist Council and also a member of the national party administration. However Vacca continued his mathematical work and gave a course at the University of Genoa on mathematical logic.\nIn\n1904\nVacca returned to Turin and was assistant to\nPeano\nfor one further year. However Vacca had by this time yet a third interest in addition to mathematics and politics. He had become interested in Chinese as early as\n1898\nwhen there had been a Chinese exhibition in Turin and he had some lessons in Chinese from two missionaries who had returned from China. In\n1905\n, this interest in Chinese became the road that Vacca decided to follow.\nHe went to Florence to study the Chinese language at the university.\nVailati\nwas teaching in Florence at this time and the two already knew each other from their time in Turin. They shared mathematical interests and certainly Vacca continued his mathematical research and interest in the history of mathematics. In fact Vacca would be one of the editors of\nVailati\n's collected works, published in\n1911\n, two years after\nVailati\n's death.\nVacca spent\n1907\n-\n08\nin western China, spending a year in the city of Cheng-tu. After his return to Florence he was awarded his doctorate for Chinese studies in\n1910\nand, the following year, he was appointed to a post teaching Chinese literature at the University of Rome. In\n1922\nVacca succeeded his old professor of History and Geography of East Asia to the chair at Florence. Vacca taught Chinese language and literature there until he retired in\n1947\n.\nDespite his change of topic in mid career, Vacca continued his Chinese and mathematical studies in parallel. For example in\n1928\nPeano\npresented a paper by Vacca on\nFermat\n's method of descent to the\nAcademy of Sciences of Turin\n. Throughout his career he published around\n130\npapers,\n47\nrelating to his Chinese interests,\n38\non mathematical research and\n45\non the history of mathematics.",
  "math_areas": [
    "Logic"
  ]
}