{
  "nome_completo": "Giovanni Prodi",
  "nome_curto": "Giovanni Prodi",
  "ano_nascimento": "1925",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Prodi/",
  "lugar_nascimento": "Scandiano, Emilia-Romagna, Italy",
  "lugar_morte": "Pisa, Italy",
  "biografia": "Giovanni Prodi\n's parents were Mario Prodi, an engineer whose family background was from peasants, and Enrica who was a primary school teacher. It was a large family with Giovanni being the eldest of his parents' nine children, having two sisters and six brothers. To give an impression of this remarkable family, we record that Romano Prodi became an economist and politician, Vittorio Prodi became a physicist and politician, Giorgio Prodi became a physician and writer, Paolo Prodi became a historian, and Franco Prodi became a physicist with particular interest in the atmosphere. Outside the world of mathematics, Romano Prodi is the best known member of the family, having been Prime Minister of Italy\n(17\nMay\n1996\n-\n21\nOctober\n1998\n, and\n17\nMay\n2006\n-\n8\nMay\n2008)\n, and President of the European Commission\n(1999\n-\n2004)\n.\nGiovanni studied at the Liceo Ariosto in Reggio nell'Emilia, the main city of the region which lies about\n12\nkm north of Scandiano. The school, named after the poet Ludovico Ariosto who was born in that city in\n1474\n, later combined with another school and today is the Liceo Classico e Scientifico Ariosto-Spallanzani. He was only fourteen years old when Italy joined the hostilities of World War II, declaring war on Britain and France on\n10\nJune\n1940\n, only days before France surrendered to the Germans. Prodi's school education continued, being relatively unaffected by the war. However, by the time he took his final school examinations in\n1943\n, the war was not going so well for Italy and the examinations had to be held in emergency wartime conditions. Prodi continued his education, entering the University of Parma to study mathematics. However, in July\n1943\nAllied troops landed in Sicily and by September the Allied troops began fighting their way north through Italy. There was much confusion in Italy when, in October\n1943\n, Italy declared war on Germany. At this stage Italy was essentially involved in a civil war since Hitler installed Benito Mussolini as the head of Repubblica Sociale Italiana, a puppet regime based around the town of Salò on Lake Garda, and, with German assistance, Mussolini raised his own armies to fight alongside Germany. Prodi was called up into the Repubblica Sociale Italiana army, an order he complied with through fear that his family would suffer retaliation if he refused, and he was sent to Germany to be trained in a camp with other Italian soldiers. Then, trained as a telephonist, he was send back to face the advancing Allied armies. The German forces, supported by the Repubblica Sociale Italiana forces, continued to oppose the Allied armies in Italy which, of course, also now also contained Italian troops. Prodi, however, was part of the German force.\nIn the spring of\n1944\n, along with many of his comrades, Prodi deserted from the Repubblica Sociale Italiana army and fled back to Parma. He was taken prisoner there by the advancing Allies and taken to the prisoner of war camp at Coltano, near Pisa. This camp was opened in the spring of\n1945\nby the Allies to hold Italian prisoners of war who were part of the fascist Repubblica Sociale Italiana as well as German prisoners of war and other collaborators. Prodi was held in PWE\n337\nalong with some famous Italian generals and others of high status. There has been some controversy over the conditions at Coltano, but recent research indicates that the Allied authorities actually took a very benevolent attitude towards their prisoners.\nProdi spent five months in the camp at Coltano before being released. The new Italian Republic had to find a way to deal with Italians who had fought with the Germans and those who had served in the army for less than eighteen months were forced back into the Italian army for a further period of service. This included Prodi who spent a few months at Casale Monferrato where he was appointed as a corporal and given the task of instructing recruits. After his military service ended, Prodi returned to the University of Parma to take up again his university studies that had been forcibly interrupted by the war. He was able to attend courses at the University of Milan given by\nGiovanni Ricci\non higher analysis and on the theory of functions. Also he was able to attend a meeting at which\nRenato Caccioppoli\nlectured on functional analysis and Prodi found this very exciting. He graduated from the University of Parma on\n24\nNovember\n1948\nhaving submitted his thesis on problems of stability in the theory of differential equations.\nAfter graduating from the University of Parma, Prodi was appointed as an assistant professor at the University of Milan where he worked with\nGiovanni Ricci\n. He published papers on differential equations during this period which were directly related to his thesis:\nUn'osservazione sugl'integrali dell'equazione\ny\n′\n′\n+\nA\n(\nx\n)\ny\n=\n0\ny'' + A(x)y = 0\ny\n′\n′\n+\nA\n(\nx\n)\ny\n=\n0\nnel caso\nA\n(\nx\n)\n→\n+\n∞\nA(x) \\to +\\infty\nA\n(\nx\n)\n→\n+\n∞\nper\nx\n→\n∞\nx \\to \\infty\nx\n→\n∞\nⓉ\n(\nAn observation an integral equation y'' + A\n(\nx\n)\ny =\n0\nin the case A\n(\nx\n)\ngoes to infinity as  x goes to infinity\n)\n(1950)\n;\nNuovi criteri di stabilità per l'equazione\ny\n′\n′\n+\nA\n(\nx\n)\ny\n=\n0\ny'' + A(x)y = 0\ny\n′\n′\n+\nA\n(\nx\n)\ny\n=\n0\n. I\nⓉ\n(\nNew stability criteria for an equation y'' + A\n(\nx\n)\ny =\n0\n. I\n)\n(1951)\n;\nQuestioni di stabilità per equazioni non lineari alle derivate parziali di tipo parabolico\nⓉ\n(\nStability Issues for nonlinear partial differential equations of parabolic type\n)\n(1951)\n;\nNuovi criteri di stabilità per l'equazione\ny\n′\n′\n+\nA\n(\nx\n)\ny\n=\n0\ny'' + A(x)y = 0\ny\n′\n′\n+\nA\n(\nx\n)\ny\n=\n0\n. II\nⓉ\n(\nNew stability criteria for an equation y'' + A\n(\nx\n)\ny =\n0\n. II\n)\n(1951)\n; and\nSoluzioni periodiche di equazioni alle derivate parziali di tipo parabolico e non lineari\nⓉ\n(\nPeriodic solutions of partial differential equations of parabolic type and non-linear\n)\n(1952)\n. In\n1956\nProdi was called to the University of Trieste where he was appointed to the chair of mathematical analysis. At the time of his appointment, this was the only pure mathematics chair in the university. It was while he was in Trieste that Prodi produced the most famous of his research results when he proved important uniqueness theorems for two-dimensional\nNavier\n-\nStokes\nequations. These results were proved independently, at almost the same time, by\nJacques-Louis Lions\n. The importance of Prodi's contributions is highlighted in\n[\n6\n]\n:-\nOver the years\n1950\n-\n1960\nmathematical research in Italy underwent a major development through the remarkable contribution of a group of distinguished scholars. Among them a prominent place belongs to Giovanni Prodi, who can be considered one of the leaders in nonlinear analysis.\nIn October\n1963\n, Prodi moved to the chair of analysis at the University of Pisa. He was a member of the\nItalian Mathematical Union\nfrom\n1950\nbut, from\n1961\nhe served on its Scientific Committee which was involved in the organisation of mathematical research. Already while he was in Trieste, Prodi became heavily involved in mathematical education. For example, in April\n1961\nhe gave a refresher course for mathematics teachers in technical schools entitled\nBoolean Algebra and electronic calculators\n. However, once in Pisa he became more heavily involved in mathematical education to which he made very major contributions over the following years. For example, from\n1967\nto\n1996\nhe served on the Commissione Italiana per l'Insegnamento della Matematica\n(\nItalian Commission for the Teaching of Mathematics\n)\n. We say more about his contributions to mathematics teaching in schools below.\nIn\n1973\n, in collaboration with Antonio Ambrosetti, Prodi published the book\nAnalisi non lineare\nwhich:-\n... has played an important role in the development of nonlinear analysis. This book was in the line of the work of\nRenato Caccioppoli\nand like the pioneering monograph 'Problemi di esistenza in analisi funzionale'\nⓉ\n(\nThe existence of problems in functional analysis\n)\nof\nCarlo Miranda\n[1949]\n, it put the emphasis upon the application of global implicit function theorems to the existence and multiplicity of solutions of nonlinear elliptic partial differential equations.\nIn\n1993\nthe authors published a revised English version of the book under the title\nA primer of nonlinear analysis\n. The book was reviewed by Jean Mawhin who wrote:-\n[\nThe book\n]\nis a revised English version of 'Analisi non lineare'\nⓉ\n(\nNonlinear Analysis\n)\n. It follows essentially the same scheme\n(\ndifferential calculus in\nBanach spaces\n, local inversion theorems, global inversion theorems, semilinear\nDirichlet\nproblems, bifurcation and applications\n)\n. The proofs have of course been reworked in several places and the presentation incorporates some new results obtained after\n1973\n. ... One of the merits of the book is to present some non-elementary questions of nonlinear analysis using rather elementary techniques\n(\nwhich sometimes could still be simplified\n)\n, and to indicate how more general results can be obtained using more sophisticated tools. This publication in English, and in a revised version, of a small monograph written by recognized pioneers and experts in the field will doubtless be a much-valued contribution to the vast literature on nonlinear analysis.\nLet us look at some comments made by those who were taught by Prodi after he had moved to Trieste. Antonio Marino writes\n[\n8\n]\n:-\nWhen I look back on my personal experience with Giovanni Prodi, whom I had the good fortune to have as a teacher at the University of Trieste in the early\n60\ns, I have to say that the part of his character that most impressed me from our very first meetings was his acute intelligence which he applied with extreme intellectual rigour to the most diverse scientific interests and to people. As he was always very willing to talk with students about academic subjects, as well as many other topics, conversation with him proved to be demanding during a meeting during which he brought out, with simplicity and sincerity, his encouragement to deepen studies, to have independent thoughts, and not to hide behind easy formulas.\nGiulio Cesare Barozzi, who was both his student and later his colleague on the Italian Commission for the Teaching of Mathematics, writes in\n[\n4\n]\n:-\nI do not remember exactly the first time I met him, but I think this happened after my graduation in\n1960\n. I clearly remember the simplicity and the kindness with which he became interested in my studies and the research that I had timidly begun to do. The ten years that separated us, and the fact that he was already a professor and I was an inexperienced new graduate, were not in any way any obstacle, except for me it was rather difficult to know how to address him. Later on our meetings were more frequent, after I had finished my military service in August\n1962\n. These meetings were of two types: either they were \"mathematical\" meetings, that is, at conferences, etc., or were family meetings, which at that time consisted of the events surrounding his younger brothers. I calculated that I had participated\n(\nalways in the role of amateur organist\n)\nin five Prodi marriages: that of Paolo to that of Franco.\nProdi's wife, Silvia Dentella, was a teacher of mathematics who helped him in his educational reforms. Let us say a little more about these reforms. He initiated the \"Prodi Project\" which went hand in hand with the formation of a group of teachers called the Gruppo di Formazione Matematica of Tuscany. Prodi was the coordinator and inspiration for this group of teachers which held a conference each year, usually in Viareggio. He said\n[\n6\n]\n:-\nTeachers gladly listen to the lectures, argue among themselves, willingly collaborating in study groups. The regional dimension is the most suitable for this purpose\n(\nand perhaps it is the perfect size\n)\nbecause on the one hand it is large enough to accommodate various experiences and attitudes, while on the other hand it is small enough to establish lasting links of friendship and cooperation.\nThe \"Prodi Project\" proposed radical new ideas on mathematics teaching in schools which involved more emphasis on\nprobability theory\n, an emphasis on constructive mathematics, and introducing pupils to algorithmic thinking and computing. Prodi noted that mathematics books which have stood the test of time have been largely books of problems, yet the bulk of mathematics teaching involves showing theory to students. Prodi argued strongly for more emphasis on problem solving and called for more thought to be given in producing relevant problems of the correct level of difficulty. Finally we note the importance that he put on the training of mathematics teachers since reform of teaching methods is only possible with enthusiastic teachers who love mathematics and want to discuss their subject. He called for mathematicians who are dedicated teaching to undertake research into the psychology of cognitive processes. Books he published on teaching and school level mathematics include:\n(\nwith\nEnrico Magenes\n)\nElementi di analisi matematica. Guida dell'Unione matematica al progetto Prodi\nⓉ\n(\nElements of mathematical analysis. Union Guide to Prodi\\'s math project\n)\n(1985)\n;\nMetodi matematici e statistici\nⓉ\n(\nMathematical and statistical methods\n)\n(1992)\n; and\n(\nwith Loris Mannucci\n)\nScoprire la matematica\nⓉ\n(\nDiscovering Mathematics\n)\n(2003)\n. These books were not, however, very successful in that they sold relatively few copies. Giulio Barozzi recalls that\n[\n4\n]\n:-\nProdi spoke with irony and detachment of the limited success of his textbooks. I remember once told me, \"These are the books that will be used to write more books ...\".\nFinally we point out that Prodi was an enthusiastic Christian and a founder of the group \"Science and Faith\" in\n1977\n. Mathematicians, physicists, biologists, philosophers and theologians participated in the group's yearly meetings. He explained the relationship he saw between science and faith\n[\n8\n]\n:-\nI do not think that science creates any obstacle to faith, nor that science can be used to promote the faith. My point of view is different: we assume that there is already the faith, or at least that the search for faith is perhaps more widespread than it seems. Then, if it is true, as the Psalm\n19\nsays that 'the heavens declare the glory of God and the firmament shows his handywork', it is also true that today's science opens up other realms for our meditation. There may come a time when belief can be found in the wise meditations on science as a way to praise God and to increase our desire to understand it.\nPerhaps the greatest recognition of Prodi's contributions has been the creation of the Giovanni Prodi Chair in Nonlinear Analysis at the University of Würzburg in Germany in\n2006\n. For many years Prodi suffered from steadily declining health due to Parkinson's disease. His death was as a result of cardiac arrest caused by Parkinson's disease.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}