{
  "nome_completo": "Giovanni Sansone",
  "nome_curto": "Giovanni Sansone",
  "ano_nascimento": "1888",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sansone/",
  "lugar_nascimento": "Porto Empedocle, Italy",
  "lugar_morte": "Florence, Italy",
  "biografia": "Giovanni Sansone\nwas born in Porto Empedocle, a town on the Strait of Sicily, the coast facing Africa. It was named for the Greek philosopher Empedocles in\n1863\n. Sansone's early education was in Sicily, where he studied at the Filippo Parlatore Technical Institute in Palermo. This Institute, founded in\n1862\n, was named for the botanist Filippo Parlatore in\n1882\n. After attending the Parlatore Technical Institute, he entered the Scuola Normale Superiore in Pisa in\n1906\n. He studied mathematics there, taught by\nLuigi Bianchi\nand\nUlisse Dini\n. Advised by\nLuigi Bianchi\n, he was awarded his laurea in\n1910\nfor his thesis\nSulle divisioni regolari dello spazio iperbolico in poliedri regolari e in tetraedri\nⓉ\n(\nOn regular divisions of hyperbolic space into regular polyhedra and tetrahedrons\n)\n. This\n76\n-page work was published in\n1911\n.\nAfter the award of his laurea, Sansone looked for a teaching position and, in\n1913\n, he entered a competition for a lectureship at the\nGalileo Galilei\nTechnical Institute in Florence. This technical institute had been founded in\n1853\nto give young people a serious scientific and cultural education. Sansone was ranked first in the competition and appointed to the Technical Institute. In\n1916\nhe was awarded a \"Diploma di Perfezionamento\" by the Scuola Normale Superiore in Pisa. This research doctorate was first awarded by this Scuola in Pisa and, although the degree is now generally known as the Dottorato di ricerca in Italy, the Scuola in Pisa still uses this historic title today. For this degree he had submitted the\n135\n-page work\nLe divisioni regolario dello spazio iperbolico in piramidi e doppie piramidi\nⓉ\n(\nThe regular divisions of hyperbolic space in pyramids and double pyramids\n)\n.\nAlthough Italy had a treaty with Germany and Austro-Hungary, they did not enter the war when it broke out in August\n1914\n. The Allies tried to persuade Italy to join them and, due to the long rivalry between Italy and Austro-Hungary, Italy declared war on Austro-Hungary on\n23\nMay\n1915\n. Sansone was involved in the fighting between the Italian and Austrian forces during the war. He wrote\n(\nsee\n[\n1\n]\n)\n:-\nDuring the First World War, I had the good fortune of being personally introduced to\nVolterra\nin April\n1918\nat Pero di Piave, where as a reserve officer I directed a \"Cotton-Weiss phonotelemetric section,\" in charge of locating Austrian batteries positioned on the other side of the Piave along an eight-kilometre front. He served as Reserve Major in the Corps of Engineers; he had obtained instruments like mine from France and came to check whether the results obtained by my section were comparable to French ones, and indeed they were.\nSansone's research turned towards group theory and he published works such as\nI sottogruppe del gruppo di Picard e due teoremi sui gruppi finiti analoghi al teorema del Dyck\nⓉ\n(\nPicard's subgroups and two theorems on finite groups analogous to Dyck's theorem\n)\n(1923)\n. He applied for various chairs of mathematics in the\n1920\ns but his area of research seemed to be held against him. For example he competed for the chair of \"Analisi algebrica e infinintesimale\" at the University of Florence in\n1924\n. A Commission consisting of\nGuido Fubini\n,\nSalvatore Pincherle\nand\nFrancesco Severi\nwas set up to rank the competitors for the chair and their report on Sansone's research output reads:-\nIt is deep, it contains noteworthy results obtained through overcoming not a few difficulties, as it touches mainly arithmetic subjects, while the requirement is to cover a chair of algebraic and infinitesimal analysis where concepts of infinitesimal calculus must prevail: one cannot therefore rely on the fact that through his works Sansone has broadened his knowledge of the important fields of science to which the vacant chair refers.\nSansone was, however appointed as a lecturer in algebraic and infinitesimal analysis at the University of Florence in\n1924\n. Perhaps we should give the Italian name for his position which was \"libera docenza\", which we have translated as lecturer but it was similar to the German \"docent\" allowing the person to teach without being supervised by a professor. He did not change his research area at this time, publishing papers such as\nLe relazioni fondamentali fra le operazioni generatrici del gruppo modulare finito con coefficienti interi del campo di Gauss\nⓉ\n(\nThe fundamental relationships between the generating operations of the finite modular group with coefficients of the Gauss field\n)\n(1925)\n,\nSulle equazioni indeterminate delle unità di norma negativa nei corpi quadratici reali\nⓉ\n(\nOn indeterminate equations of units normally negative in real quadratic bodies\n)\n(1925)\n,\nAncora sulle equazioni indeterminate delle unità di norma negativa nei corpi quadratici reali. Il caso D =\n2\np con p primo\nⓉ\n(\nMore on the undetermined equations of normally negative units in real quadratic bodies. Case D =\n2\np with p a prime\n)\n(1925)\n, and\nI sottogruppi del gruppo modulare con coefficienti del corpo di Jacobi-Eisenstein e un teorema sui gruppi finiti\nⓉ\n(\nSubgroups of the modular group with Jacobi-Eisenstein body coefficients and a finite group theorem\n)\n(1926)\n.\nFor a list of over\n180\nof Sansone's publications, see\nTHIS LINK\n.\nIn\n1927\nhe was appointed to the chair of Algebraic and Infinitesimal Analysis at the University of Florence, a chair he continued to hold for the rest of his life. The material that he was teaching became the basis of his two-volume textbook\nLezioni di analisi matematica: redatte per uso degli studenti\nⓉ\n(\nLessons on mathematical analysis: written for student use\n)\n(1929)\n. Although we have not found reviews of this first edition, the fourth edition of volume\n1\nwas reviewed by Harald Geppert, the editor of the\nJahrbuch\n. He writes:-\nThe first volume of the lectures of the author deals with the fundamentals of analysis, algebra and the differential calculus in one variable. He distinguishes his work from other textbooks by an unusual abundance and penetration of the treated material.\nFor more of Geppert's review, including the titles of the chapters, see\nTHIS LINK\n.\nSansone continued to undertake research in algebra and number theory, where he studied solutions of cubic equations over finite fields, but it was not a popular area of research in Italy at this time so eventually he moved towards undertaking research in analysis. An important contribution came with his work on an unpublished manuscript of\nGiuseppe Vitali\nwho died in\n1932\n.\nVitali\nhad, like Sansone, been educated at the Scuola Normale Superiore in Pisa and had been an assistant to\nUlisse Dini\nduring\n1899\n-\n1901\n. By the time Sansone had begun his studies at the Scuola Normale Superiore,\nVitali\nwas becoming involved in politics as a Socialist councillor but after the Fascists came to power in\n1922\n, he returned to mathematics. During the last four years of his life he struggled with health problems but continued to produce outstanding mathematics. On his death he left an incomplete treatise entitled\nModerna Teoria delle Funzioni di Variabile Reale\nⓉ\n(\nModern theory of functions of a real variable\n)\n. Sansone took on the work of editing this book which was published in\n1935\nas the first volume of a\n2\n-volume work by\nVitali\nand Sansone, the second volume of which was entirely due to Sansone.\nEnea Bortolotti writes in a review:-\nThe first volume of this work is due to the deceased\nG Vitali\n; it contains a self-contained and unified description, largely new, both in terms of form and content, of the principles of the modern theory of set theory, and the modern theory of the functions of a real variable. ... On the death of the author\n(1932)\n, the volume was almost completed; G Sansone, with sincere accuracy and conscientious fidelity to the train of thought and the form of representation chosen by the author, has completed the work and arranged its publication. The improvements and additions of Sansone are very pleasing to the harmonious structure of the author; they contribute to making the work a reliable and easy guide for one who wants to know the most beautiful and the highest theories of the modern analysis of the real variable, as well as giving a suitable introduction to the subject matter of which Sansone gives a concise and clear representation in the second volume ...\nFor details of the second volume and extracts from\nRalph Philip Boas Jr\n's reviews of the second edition of both volumes, see\nTHIS LINK\n.\nAlthough Sansone continued to hold the chair at the University of Florence, he taught for the years\n1947\n-\n49\nat the Scuola Normale Superiore in Pisa. In\n1950\n, at the University of Florence, he founded the Istituto di Matematica \"\nU Dini\n\". From\n1957\nto\n1963\nhe was President of the Faculty of Science at the University of Florence. He retired in\n1963\nwhen he was made professor emeritus.\nWe have seen how Sansone's research began with number theory and algebra, and moved to group theory. Later he worked on differential geometry followed by work on series of orthogonal functions, and then moved to linear and nonlinear differential equations. Perhaps most surprising of all was the work he did with Nicolai Minorsky and Roberto Conti investigating nonlinear control systems. They produced eight reports between\n1962\nand\n1967\nfor the Office of Naval Research. These were:\nAdaptive control systems; Discontinuous control systems; Special problems of control theory; Method of harmonic linearization; Piece-wise linear methods and absolute stability; Extremal systems and introduction of statistical data; Statistical trends in control theory; and Oscillations in control theory.\nFor a list of Sansone's publications, see\nTHIS LINK\n.\nOne of Sansone's great achievements at the University of Florence was building up the library there. He did this with meticulous care and it has shaped the historical part of the collection that exists today. Starting with the purchase of\nDini\n's books, he pursued a clever policy of purchases and exchanges, and then enriched the library with donations.\nSansone's contributions are impressive for the range of topics he studied, the enormous output in books and papers he achieved throughout his life, for the depth of his work, for his editorial duties and also for the time he spent sitting on various national committees. He worked tirelessly for the journal\nAnnali di Matematica Pura e Applicata\nfor over\n40\nyears from\n1938\nuntil his death. He was a co-director of this journal from\n1938\nto\n1962\nwhen he became the sole director. Through his efforts he made the journal one of the leading Italian mathematical journals. We mentioned his work on national committees and perhaps the most important of this was the two terms he spent as Chairman of the National Mathematics Committee of the National Council for Research. These terms were from\n1960\nto\n1968\nduring which time he initiated scholarship schemes as well as a programme of visiting professorships to bring leading mathematicians to lecture in Italy. He also served the\nItalian Mathematical Union\nbeing on its Scientific Committee from\n1949\nto\n1970\n, and chairing the committee from\n1952\nto\n1958\n. During his time as Chairman, he played a major role in founding the Centro Internazionale Matematico Estivo in\n1954\n.\nMany honours have been given to Sansone for his outstanding contributions. He was elected to the\nAccademia dei Lincei\n, awarded an honorary degree by the University of Florence and, in\n1978\n, he was made an honorary citizen of Florence. The Applied Mathematics Institute of the University of Florence has been named for him. In\n2010\nPorto Empedocle named a piazza after Sansone.\nWhen Sansone died he left a last will and testament expressing a wish to set up a foundation to provide fellowships for young mathematicians. The Emma and Giovanni Sansone Foundation was set up in\n1983\nwhich each year offers fellowships awarded through a public competition based on the candidates' work and an interview or examination.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}