{
  "nome_completo": "Giovanni Battista Riccioli",
  "nome_curto": "Giovanni Battista Riccioli",
  "ano_nascimento": "1598",
  "ano_morte": "1671",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Riccioli/",
  "lugar_nascimento": "Ferrara (now Italy)",
  "lugar_morte": "Bologna (now Italy)",
  "biografia": "Giovanni Battista Riccioli\n's father was Giambattista Riccioli. Giambattista is merely another version of Giovanni Battista so Giovanni, the subject of this biography, was given the same name as his father. Riccioli entered the Jesuit Order on\n6\nOctober\n1614\n, when he was\n16\nyears of age. He spent the first two years training as a novice before beginning his academic studies in\n1616\nwhen he began to study the humanities at Ferrara. He continued to study the humanities at Piacenza before he began to study philosophy and theology at Parma in\n1620\n. The Jesuits ran three educational establishments in Parma, the university, a college for educating the sons of the nobility, and a Jesuit College, established around\n1600\n, which Riccioli attended. In addition to advanced courses in philosophy and theology, the College provided lower level courses in grammar and rhetoric.\nRiccioli spent eight years at the Jesuit College at Parma. Here he was taught by\nGiuseppe Biancani\n(1565\n-\n1624)\nand Riccioli later offered his thanks to\nBiancani\nwho had a strong influence on him.\nBiancani\nwas interested in astronomy and made observations of the sun and moon with a telescope. He had collaborated with another Jesuit scientist,\nChristoph Scheiner\n(1573\n-\n1650)\n, in making observations of sunspots. Riccioli became fascinated with astronomy and devoted his research activities to this topic although he also engaged in work on related topics. This was more due to his superiors for, after he completed his studies and was ordained in the winter of\n1627\n-\n28\n, he requested that he be allowed to go the China as a Jesuit missionary. However, his request was denied and he spent the rest of his career teaching at Jesuit colleges. He taught logic, physics, and metaphysics at the Jesuit College in Parma from\n1629\nto\n1632\n. After spending the academic year\n1633\n-\n1634\nat the Jesuit College in Mantua, he returned to Parma in\n1635\n. He only spent one more year in Parma before being sent to Bologna in\n1636\nwhere he taught for the rest of his career.\nAlfredo Dinis sums up Riccioli's contribution in\n[\n14\n]\nwhere he writes:-\nRiccioli enjoyed great prestige and great opposition, both in Italy and abroad, not only as a man of encyclopaedic knowledge but also as someone who could understand and discuss all the relevant issues of the day in cosmology, observational astronomy, and geography.\nLet us now look at his scientific contributions so that we can understand why he gained this reputation. He began conducting experiments soon after he was ordained and began teaching at Parma. During the period from\n1629\nto\n1631\nhe conducted a series of experiments with falling bodies finding that the distance of fall per second increased according to the sequence\n1\n,\n3\n,\n9\n,\n27\n. His Jesuit colleague, Niccolo Cabeo\n(1586\n-\n1650)\nwho was interested in philosophy, physics and mathematics, asked him to conduct experiments on the isochronism of the pendulum and, assisted by Daniello Bartoli\n(1608\n-\n1685)\n, he conducted experiments with various lengths of pendulum. Riccioli moved to Mantua for the year\n1633\n-\n34\n, but he was able to work with Cabeo at Ferrara on further studies with the pendulum and falling bodies in\n1634\n.\nThere has been much discussion between historians as to exactly what Riccioli believed, in particular whether he believed in the theories propounded by\nGalileo\ndespite his writings in which he opposed them. It seems likely that one reason for the lack of clarity is that Riccioli's views became more strongly opposed to those of\nGalileo\nas the years went by. If we look at the work on falling bodies which he undertook in\n1634\n, then we only have Riccioli's writing about this in\n1651\nby which time his views may have to some extent changed. Cabeo's interpretation of his experiments on falling bodies is described by Riccioli in\n1651\nas follows\n(\nsee\n[\n2\n]\n)\n:-\n[\nCabeo\n]\naffirms most emphatically from his own often repeated experiments, that if two balls are dropped at the same time from the same height, one of one ounce and the other of ten pounds or whatever greater weight, either both being of lead, or one lead and the other stone or wood; providing that the air is still, and that the lighter one is not of so small a weight that it is not forceful enough to overcome the resistance of the air ... it will happen that both reach the ground at the same moment ...\nHowever, Riccioli's interpretation of the same\n1634\nexperiments is rather different\n[\n2\n]\n:-\n... besides wooden balls, we released stones of diverse weights from the tower of our chapel of the Society of Jesus, with once a bronze basin, at another time a wooden board having he put by me under the drop, so that from the different sounds I would distinguish better which one reached the ground faster. ... I noticed that the heavier one reached the ground a little more quickly.\nHis interest in astronomical observations had been prompted by\nBiancani\nduring his student years in Parma and, after he returned to Parma in\n1635\n, he made observations of the moon. He wrote\n[\n14\n]\n:-\nI could never extinguish the enthusiasm for astronomy once it arose in me.\nDuring this year in Parma, Riccioli taught\nFrancesco Maria Grimaldi\nand after the two moved to Bologna in\n1636\nthey did much work together.\nGrimaldi\nwas\n20\nyears younger than Riccioli and, throughout their work together, publications appeared under Riccioli's name but he gave full credit to\nGrimaldi\nwho, as the younger man, took on the hardest parts of the experimental work. He decided that in order to carry out accurate experiments he needed to have an accurate way of measuring time and his way of doing this was with a pendulum. First,\nGrimaldi\nand Riccioli calibrated a pendulum by getting it to swing for\n24\nhours\n(\nmeasured by the star Arcturus crossing the meridian line\n)\n. They used this\n3\nfoot pendulum to calibrate a shorter pendulum to use in timing. Then they dropped balls of wood and of lead from various heights from the Asinelli tower. A nice addition to the accuracy was obtained by getting a group of musical monks to chant in time with the swinging pendulum to aid with the timing. The experiment did not confirm\nGalileo\n's result for, as one might expect, the lead balls reached the ground before the wooden ones in all the experiments using different heights on the tower. He claimed that the reason the experiments had come up with different results was that\nGalileo\n, and others making the same claims, had only dropped weights from\n50\nor\n100\nfeet while his experiments had used the\n312\nfoot high Asinelli tower.\nIn order to make accurate astronomical observations Riccioli, with\nGrimaldi\n's assistance, set up an observatory at the College of Santa Lucia in Bologna which\n[\n14\n]\n:-\n... housed many instruments for astronomical observations - including telescopes, quadrants, sextants, and other related instruments - and was occasionally visited by foreign researchers.\nRiccioli's philosophy was to trust the evidence of the senses\n[\n14\n]\n:-\nBy themselves, the senses, if correctly applied, almost always represent the object as it is in reality.\nThis belief, of course, was just what he needed to argue in favour of a stationary earth - it does not appear to be moving. However, he still conducted experiments in an attempt to see if he could detect any evidence for motion. In\nAlmagestum novum\n(1651)\nhe presented\n126\narguments,\n49\nin favour of the earth moving round the sun, and\n77\nin favour of a stationary earth. For some he quoted his own experiments, and for some he quoted experiments of others. For example, here are\n5\nof the\n77\narguments\n[\n21\n]\n:-\nIf Earth rotates, the impact of a cannon ball will be less if launched towards the West than towards the East. But this is contrary to our experiments.\nA parallax in Sirius should be detectable between the equinoxes.\nIf Earth had a diurnal rotation, heavy bodies falling near the equator would have a fundamentally different motion than identical bodies falling near the poles under identical conditions.\nHeavy bodies naturally fall to Earth along a line that is straight and perpendicular to ground. If launched perpendicularly upwards, they fall back upon the location from which they were launched. If the Earth had diurnal and annual motions, these bodies would follow curved trajectories.\nIf Earth moves, then the clouds and the birds in the air would be seen to fly West, as they were left behind by the Earth.\nRiccioli was very impressed by\nKepler\n's realisation that the planets moved in elliptical orbits round the sun. However, since this was at odds with his own stationary earth system, he adopted a rather neat way of explaining\nKepler\n's results. God, he claimed, had made the planets move in a regular way to accommodate human understanding. He had therefore made them appear to have elliptical orbits round the sun, to make calculating their positions a nice task for humans, while physically they moved in a complicated way round a stationary earth.\nWe have quoted from\nAlmagestum novum\n(1651)\nbut we have not explained the nature of this large work by Riccioli. The treatise is really an encyclopaedia of astronomy containing nearly\n1500\npages in two volumes. The work is divided into ten books:\n  I Spherical Astronomy;\n  II Terrestrial Elements;\n  III The Sun;\n  IV The Moon;\n  V Eclipses;\n  VI Fixed Stars;\n  VII Planets;\n  VIII Comets and New Stars;\n  IX Systems of the World;\n  X General Problems.\nIn addition there is Front Matter which contains a chronology of astronomers followed by short biographies with a description of their main contributions. Book IV, on the moon, contains much material which comes from observations carried out by\nGrimaldi\nworking under instruction from Riccioli. Maps of the moon's surface are given containing names for the major features on the surface, named after famous scientists\n(\nparticularly astronomers\n)\n. Riccioli's naming scheme has been adopted today and Janet Vertesi\n[\n32\n]\ntries to understand why his naming scheme was adopted:-\nRiccioli's plate presents a highly stylised image, bare and cartoon-like. He charts resemblances between objects, forming a standardised visual language to represent similar phenomena: craters of different sizes are represented exactly the same way, as though printed from the same cut block, indicating to the viewer that they are 'the same type of thing'. ...\n[\nIt\n]\nis a compiled picture, the result of several successive viewings by different individuals, masked and subsumed into one plate presented without a visible history. ... Riccioli cannot only depict perceived relationships between lunar features, but can also tell us 'what the moon is' by means of 'what it is not': it is lunar, not earthly.\nThe longest of the books is 'Systems of the World' containing around\n350\npages. It is in this book that the\n126\narguments for and against the Copernican system, mentioned above, are given. These are scientific arguments, but Riccioli also adds Scriptural arguments. In perhaps one of the most telling passages he writes\n(\nsee\n[\n4\n]\n)\n:-\nIf the liberty taken by the Copernicans to interpret scriptural texts and to elude ecclesiastic decrees is tolerated, then one would have to fear that it would not be limited to astronomy and natural philosophy, and that it could extend to the most holy dogmas; thus it is important to maintain the rule of interpreting all sacred texts in their literal sense.\nThe work also includes an argument by Riccioli supporting the decision of the Inquisition against\nGalileo\n. It is a useful section for it contains original documents relating to\nGalileo\n's trial which might not otherwise be available.\nAnother project on which Riccioli was assisted by\nGrimaldi\nwas a survey, using triangulation, undertaken to determine a meridian line for Bologna. In addition to\nGrimaldi\n, he was also assisted by Ovidio Montalbini\n(1601\n-\n1672)\n, a professor at Bologna University and the custodian of its science museum, and\nGiovanni Domenico Cassini\n, who had been appointed as professor of mathematics at the University of Bologna in\n1650\nfollowing the death of\nBonaventura Cavalieri\n. The project was completed by\n1655\nand the results published by Riccioli in\nGeographiae Hydrographiae Reformatae\n(1661)\n. Although a theologian, Riccioli had always felt that his main work and publications should be on astronomy. When he was young he had argued that there were many Jesuits publishing on theology but very few on astronomy so he should concentrate on astronomy publications. However, by\n1662\nhe had completed a work on theology, namely on the immaculate conception of the Virgin Mary. He considered this his most important work but the Inquisition refused to allow the work to be published. This made Riccioli very angry and one might suppose that this would have made him think again about his wholehearted support for the position the Inquisition took over\nGalileo\n. In fact it was quite the reverse and, after this, Riccioli went even further in condemning\nGalileo\nthan the Inquisition had done - his views seem to become more and more hardened against\nGalileo\n. One possible reason for this may not have been for scientific reasons, but rather an attempt to get on the right side of the Inquisition so that they might agree to the publication of his work on the Virgin Mary.\nRiccioli's book defended the doctrine of the Immaculate Conception of Mary against a Dominican who had rejected it. He wrote another theological book defending the infallibility of popes in supporting the doctrine\n[\n25\n]\n:-\nOpinions in the Congregation of the Index\n[\nInquisition\n]\nwere divided, some arguing that the second book should not be printed because it defended papal infallibility with dubious arguments, and that there was no point to attacking the Dominicans. However, Riccioli went ahead and published the papal infallibility book with an altered permission to print, thus angering the Dominican inquisitor at Bologna. Then the Congregation of the Holy Office ordered the book placed on the Index of Prohibited Books and confiscated most of the copies.\nRiccioli published another astronomy book,\nAstronomia reformata\n(1665)\ndedicated to Ferdinand, Duke of Bavaria. This work had considerable overlap with\nAlmagestum novum\nbut also contained much new information, particularly on the changing appearance of the planets Saturn and Jupiter. He gives details of observations of the changing appearance of the bands of Jupiter made by\nGrimaldi\nand himself, as well as reporting on observations of the bands by others. Although he did not realise that Saturn had a ring system, he did publish in\nAstronomia reformata\nmany drawings of the appearance of Saturn, some of which depict the planet inside a ring.\nAmong the many discoveries made by Riccioli which we have not yet mentioned, is his first recorded observation a double star, namely the star Mizar in Ursa Major. Although he is the first to record observing a double star, it is believed that\nCastelli\nhad discovered this double in\n1617\n. We also did not mention Riccioli's early publication\nPrododia Bononiensis\n. This two-volume treatise\n(\nVolume\n1\n,\n1639\n; Volume\n2\n,\n1640)\nshowed the range of Riccioli's expertise for this book was on metrics and Latin prose style.\nThroughout his life, Riccioli corresponded with many leading scientists, for example:\nJohannes Hevelius\n, the Polish astronomer living in Danzig, now Gdańsk;\nChristiaan Huygens\n;\nGiovanni Domenico Cassini\n, who had learnt much from Riccioli while in Bologna; and Athanasius Kircher, the German Jesuit priest and scholar who lived in Rome from\n1634\nonwards and acted in a similar way to\nMersenne\nin corresponding with a wide range of scholars. Riccioli became quite emotional when his ideas were challenged, for example he became very upset when\nStephano degli Angeli\nchallenged his \"proof\" that the earth was stationary. It was not only his science that\ndegli Angeli\nattacked, however, also attacking his status as a scientist and philosopher. Riccioli's character was described by his contemporaries as sanguine, fiery, choleric, melancholic and phlegmatic. His health was not good and we have already indicated how he was glad to have\nGrimaldi\ndo the more demanding physical work. Even in\n1639\nhis health was described as weak and, ten years later, he was said to be frail. In fact by\n1651\n, when\nAlmagestum novum\nwas published, he was described as crippled.\nFinally, let us record that Louis XIV awarded him a prize in recognition of the totality of his activities and their relevance to the culture of the day.",
  "math_areas": [
    "Algebra"
  ]
}