{
  "nome_completo": "Giovanni Poleni",
  "nome_curto": "Giovanni Poleni",
  "ano_nascimento": "1683",
  "ano_morte": "1761",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Poleni/",
  "lugar_nascimento": "Venice, Venetian States (now Italy)",
  "lugar_morte": "Padua, Venetian States (now Italy)",
  "biografia": "Giovanni Poleni\n's father was Jacopo Poleni who was given the title of marquis of the Holy Roman Empire by Emperor Leopold I. Giovanni inherited his father's title. As a young man Poleni showed brilliance in a wide variety of different subjects and it was clear that he was extraordinarily talented. He first studied philosophy and then theology in Venice. His parents encouraged him to begin a judicial career but, after being introduced to mathematics and science by his father, it was clear that he had now found the subjects which gave him most satisfaction\nIn\n1708\nhe married Orsola Roberti who was from the high ranking Bassano del Grappa family. He accepted the chair of Astronomy and Meteorology at the University of Padua in\n1709\n. For over\n40\nyears he kept outstandingly accurate meteorological records which have proved invaluable to later scientists. He published\nMiscellanea: de barometris et thermometris; de machina quadam arithmetica; de sectionibus conicis in horologiis solaribus describendis\nⓉ\n(\nMiscellanea: barometers and thermometers; a kind of arithmetic machine;  describing  conic sections in sun-dials\n)\n, a collection of dissertations on physics, in\n1709\n. As well as studying the barometer and thermometer, this work includes Poleni's description of a calculating machine\n[\n1\n]\n:-\n... based on reports that Poleni had received of those of\nPascal\nand\nLeibniz\n. Poleni actually built this machine which was reportedly very simple and easy to operate; but when he heard of another machine presented to the Emperor by the Viennese mechanician Brauer, he destroyed his own and never rebuilt it.\nHe next published\nDe vorticibus coelestibus dialogus: qui accedit quadratura circuli Archimedis\nin\n1712\n.\nIn\n1715\nhe became professor of physics, in addition holding the chair of Astronomy and Meteorology. Poleni was invited by the Venetian Senate to investigate the problem of hydraulics relating to the irrigation of Lower Lombardy. The river Adda leaves Lake Como at Lecco and crosses the Lombardy Plain where skilled engineering can use it to create excellent irrigation. But Poleni had also to worry about the river flooding, so his irrigation schemes had to have constructions to control floods. He was appointed to the chair of mathematics at Padua in\n1719\nwhich had been vacated by\nNicolaus\n(\nII\n)\nBernoulli\n. His inaugural lecture was\nDe physices in rebus mathematicis utilitate: praelectio\nⓉ\n(\nExamples of the use of mathematics in physics\n)\nwhich was particularly significant and, although published first in\n1716\n, it was reprinted in\n1720\nafter his inaugural lecture. A major treatise on hydraulics and hydrodynamics\nDe motu aquae mixto libri duo\nⓉ\n(\nTwo books on the motion of water\n)\n(1717)\ndescribes estuaries, ports, and rivers. A year later, in\n1718\n, he reported on his experiments with water in\nDe castellis per quae derivantur aquae fluviorum habentibus latera convergentia liber\nⓉ\n(\nThe flow the waters of rivers having  free banks\n)\n.\nIn fact Padua had been fortunate to have had\nJakob Hermann\nteaching there from\n1707\nto\n1713\nand he had introduced the methods of\nLeibniz\n's differential and integral calculus to the university. Poleni was familiar with the new differential and integral calculus and with the natural philosophy of\nNewton\n. A fascinating glimpse of the topics which interested Poleni are seen from his correspondence with\nJacopo Riccati\nwho was also based in the Venetian region. This correspondence is reproduced in\n[\n4\n]\n. The two mathematicians discussed: the application of calculus to some controversial issues in dynamics; hydraulics; and administrative matters related to the regulation of waters in the Venetian region. The topics which Poleni taught at the University of Padua reflect his interests and the different chairs to which he was appointed. He taught physics when he was first appointed but taught mathematics after his appointment to the chair of mathematics in\n1719\n. He observed a solar eclipse in\n1724\nand wrote a treatise on the topic which was published in the following year. From\n1739\nhe taught experimental physics, since by this time he had available a physics laboratory. We shall look at this innovation in a little more detail.\nIn\n1738\nPoleni acquired a laboratory to conduct physics experiments: his Teatro di Filosofia Sperimentale. It was the first physics laboratory to be established in an Italian university. From the time he acquired the laboratory he sought to stock it with instruments. He collected about\n400\nmathematical, drawing and meteorological instruments over the following twenty years. Some were purchased but most were made in Venice or Padua to Poleni's own specifications. Around\n100\nof Poleni's instruments still survive and can be seen in a Museum at Padua. This laboratory gained Poleni international fame. He was elected to the\nAcadémie des Sciences\nin Paris in\n1739\n. The Academy recognised that he had:-\n... placed the School of Natural Philosophy in Padua on the same level as the most famous of its kind.\nJérôme\nLalande\ndescribed the laboratory, writing:-\nI have never seen a more beautiful Physics Laboratory.\nIn\n1741\nPoleni published\nInstitutionum philosophiae mechanicae specimen\n.\nPope Benedict XIV summoned Poleni to Rome in\n1743\nto see if he could solve the problem of the cupola of St Peter's which seemed to be near to collapsing. Together with the architect Luigi Vanvitelli he proposed fitting large iron rings to strengthen the dome. In fact the task was carried out with the aid of an instrument from Poleni's laboratory, a\nmacchina divulsoria\ndesigned to determine the tensile strength of materials. The rings were fitted by\n1748\n. As a consequence of this task, he published\nMemorie istoriche della gran cupola del Tempio Vaticano\nⓉ\n(\nThe history of the great dome of the Vatican church\n)\nin\n1748\n.\n(\nIn fact the pope also accepted advice from\nBoscovich\nwho made the same suggestion.\n)\nPoleni was appointed to the chair of Nautical Studies and Naval Construction at Padua in\n1756\n. From this time he taught nautical sciences and shipbuilding.\nHe was honoured by being proposed by\nLeibniz\nfor election to the\nBerlin Academy of Science\nin\n1715\n. His work was honoured by the award of a number of prizes: for calculating the distance travelled by a ship by the\nAcademy of Sciences\nin\n1733\n; for a study of ship's anchors also by the\nAcademy of Sciences\nthis time in\n1736\n; and for a study of cranes and windlasses in\n1741\n.\nIn addition to the many different interests we have indicated above\n[12]\n:-\nPoleni's scientific activities were paralleled by classical researched, which were described in treatises on the temple of Ephesus, on ancient theatres and amphitheatres, on French archaeological findings, on an Augustan obelisk, and on several architectural topics.\nWe mention in particular\nUtriusque thesauri antiquitatum romanarum graecarumque nova supplementa\nⓉ\n(\nnew supplies of both the treasures of the ancient times of the Roman graecarumque\n)\n(1737)\n, and\nExercitationes Vitruvianae primae, hoc est Ioannis Poleni Commentarius criticus de M Vitruvii Pollionis Architecti X\nⓉ\n(\nVitruvius's first examples: Poleni's critical commentary of Vitruvius's Architecture  X\n)\n(1739)\n.\nAnother interest which gave him great pleasure was music.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Number Theory"
  ]
}