{
  "nome_completo": "Giuseppe Peano",
  "nome_curto": "Giuseppe Peano",
  "ano_nascimento": "1858",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peano/",
  "lugar_nascimento": "Cuneo, Piemonte, Kingdom of Sardinia (now Italy)",
  "lugar_morte": "Turin, Italy",
  "biografia": "Giuseppe Peano\n's parents worked on a farm and Giuseppe was born in the farmhouse 'Tetto Galant' about\n5\nkm from Cuneo. He attended the village school in Spinetta then he moved up to the school in Cuneo, making the\n5\nkm journey there and back on foot every day. His parents bought a house in Cuneo but his father continued to work the fields at Tetto Galant with the help of a brother and sister of Giuseppe, while his mother stayed in Cuneo with Giuseppe and his older brother.\nGiuseppe's mother had a brother who was a priest and lawyer in Turin and, when he realised that Giuseppe was a very talented child, he took him to Turin in\n1870\nfor his secondary schooling and to prepare him for university studies. Giuseppe took exams at Ginnasio Cavour in\n1873\nand then was a pupil at Liceo Cavour from where he graduated in\n1876\nand, in that year, he entered the University of Turin.\nAmong Peano's teachers in his first year at the University of Turin was\nD'Ovidio\nwho taught him analytic geometry and algebra. In his second year he was taught calculus by\nAngelo Genocchi\nand descriptive geometry by\nGiuseppe Bruno\n. Peano continued to study pure mathematics in his third year and found that he was the only student to do so. The others had continued their studies at the Engineering School which Peano himself had originally intended to do. In his third year\nFrancesco Faà di Bruno\ntaught him analysis and\nD'Ovidio\ntaught geometry. Among his teachers in his final year were again\nD'Ovidio\nwith a further geometry course and\nFrancesco Siacci\nwith a mechanics course. On\n29\nSeptember\n1880\nPeano graduated as doctor of mathematics.\nPeano joined the staff at the University of Turin in\n1880\n, being appointed as assistant to\nD'Ovidio\n. He published his first mathematical paper in\n1880\nand a further three papers the following year. Peano was appointed assistant to\nGenocchi\nfor\n1881\n-\n82\nand it was in\n1882\nthat Peano made a discovery that would be typical of his style for many years, he discovered an error in a standard definition.\nGenocchi\nwas by this time quite old and in relatively poor health and Peano took over some of his teaching. Peano was about to teach the students about the area of a curved surface when he realised that the definition in\nSerret\n's book, which was the standard text for the course, was incorrect. Peano immediately told\nGenocchi\nof his discovery to be told that\nGenocchi\nalready knew.\nGenocchi\nhad been informed the previous year by\nSchwarz\nwho seems to have been the first to find\nSerret\n's error.\nIn\n1884\nthere was published a text based on\nGenocchi\n's lectures at Turin. This book\nCourse in Infinitesimal Calculus\nalthough based on\nGenocchi\n's lectures was edited by Peano and indeed it has much in it written by Peano himself. The book itself states on the title page that it is:-\n... published with additions by Dr Giuseppe Peano.\nGenocchi\nseemed somewhat unhappy that the work came out under his name for he wrote:-\n... the volume contains important additions, some modifications, and various annotations, which are placed first. So that nothing will be attributed to me which is not mine, I must declare that I have had no part in the compilation of the aforementioned book and that everything is due to that outstanding young man Dr Giuseppe Peano ...\nPeano received his qualification to be a university professor in December\n1884\nand he continued to teach further courses, some for\nGenocchi\nwhose health had not recovered sufficiently to allow him to return to the University.\nIn\n1886\nPeano proved that if\nf\n(\nx\n,\ny\n)\nf (x, y)\nf\n(\nx\n,\ny\n)\nis continuous then the first order\ndifferential equation\nd\ny\nd\nx\n=\nf\n(\nx\n,\ny\n)\n\\Large\\frac{dy}{dx}\\normalsize  = f (x, y)\nd\nx\nd\ny\n​\n=\nf\n(\nx\n,\ny\n)\nhas a solution. The existence of solutions with stronger hypothesis on\nf\nf\nf\nhad been given earlier by\nCauchy\nand then\nLipschitz\n. Four years later Peano showed that the solutions were not unique, giving as an example the differential equation\nd\ny\nd\nx\n=\n3\ny\n2\n/\n3\n\\Large\\frac{dy}{dx}\\normalsize  = 3y^{2/3}\nd\nx\nd\ny\n​\n=\n3\ny\n2\n/\n3\n, with\ny\n(\n0\n)\n=\n0\ny(0) = 0\ny\n(\n0\n)\n=\n0\n.\nIn addition to his teaching at the University of Turin, Peano began lecturing at the Military Academy in Turin in\n1886\n. The following year he discovered, and published, a method for solving systems of linear differential equations using successive approximations. However\nÉmile Picard\nhad independently discovered this method and had credited\nSchwarz\nwith discovering the method first. In\n1888\nPeano published the book\nGeometrical Calculus\nwhich begins with a chapter on mathematical logic. This was his first work on the topic that would play a major role in his research over the next few years and it was based on the work of\nSchröder\n,\nBoole\nand\nCharles Peirce\n. A more significant feature of the book is that in it Peano sets out with great clarity the ideas of\nGrassmann\nwhich certainly were set out in a rather obscure way by\nGrassmann\nhimself. This book contains the first definition of a vector space given with a remarkably modern notation and style and, although it was not appreciated by many at the time, this is surely a quite remarkable achievement by Peano.\nIn\n1889\nPeano published his famous axioms, called Peano axioms, which defined the natural numbers in terms of sets. These were published in a pamphlet\nArithmetices principia, nova methodo exposita\nⓉ\n(\nPrinciples of arithmetic and the new method explained,\n)\nwhich, according to\n[\n5\n]\nwere:-\n... at once a landmark in the history of mathematical logic and of the foundations of mathematics.\nThe pamphlet was written in Latin and nobody has been able to give a good reason for this, other than\n[\n5\n]\n:-\n... it appears to be an act of sheer romanticism, perhaps the unique romantic act in his scientific career.\nThe Peano axioms are listed at\nTHIS LINK\n.\nGenocchi\ndied in\n1889\nand Peano expected to be appointed to fill his chair. He wrote to\nCasorati\n, whom he believed to be part of the appointing committee, for information only to discover that there was a delay due to the difficulty of finding enough members to act on the committee.\nCasorati\nhad been approached but his health was not up to the task. Before the appointment could be made Peano published another stunning result.\nHe invented 'space-filling' curves in\n1890\n, these are continuous surjective mappings from\n[\n0\n,\n1]\nonto the unit square.\nHilbert\n, in\n1891\n, described similar space-filling curves. It had been thought that such curves could not exist.\nCantor\nhad shown that there is a bijection between the interval\n[\n0\n,\n1]\nand the unit square but, shortly after,\nNetto\nhad proved that such a bijection cannot be continuous.\nYou can see some stages in the construction of this curve at\nTHIS LINK\n.\nPeano's continuous space-filling curves cannot be\n1\n-\n1\nof course, otherwise\nNetto\n's theorem would be contradicted.\nHausdorff\nwrote of Peano's result in\nGrundzüge der Mengenlehre\nⓉ\n(\nGeneral set theory\n)\nin\n1914\n:-\nThis is one of the most remarkable facts of set theory.\nIn December\n1890\nPeano's wait to be appointed to\nGenocchi\n's chair was over when, after the usual competition, Peano was offered the post. In\n1891\nPeano founded\nRivista di matematica\n, a journal devoted mainly to logic and the foundations of mathematics. The first paper in the first part is a ten page article by Peano summarising his work on mathematical logic up to that time.\nPeano had a great skill in seeing that theorems were incorrect by spotting exceptions. Others were not so happy to have these errors pointed out and one such was his colleague\nCorrado Segre\n. When\nCorrado Segre\nsubmitted an article to\nRivista di matematica\nPeano pointed out that some of the theorems in the article had exceptions.\nSegre\nwas not prepared to just correct the theorems by adding conditions that ruled out the exceptions but defended his work saying that the moment of discovery was more important than a rigorous formulation. Of course this was so against Peano's rigorous approach to mathematics that he argued strongly:-\nI believe it new in the history of mathematics that authors knowingly use in their research propositions for which exceptions are known, or for which they have no proof...\nIt was not only\nCorrado Segre\nwho suffered from Peano's outstanding ability to spot lack of rigour. Of course it was the precision of his thinking, using the exactness of his mathematical logic, that gave Peano this clarity of thought. Peano pointed out an error in a proof by\nHermann Laurent\nin\n1892\nand, in the same year, reviewed a book by\nVeronese\nending the review with the comment:-\nWe could continue at length enumerating the absurdities that the author has piled up. But these errors, the lack of precision and rigour throughout the book take all value away from it.\nFrom around\n1892\n, Peano embarked on a new and extremely ambitious project, namely the\nFormulario Mathematico\n. He explained in the March\n1892\npart of\nRivista di matematica\nhis thinking:-\nOf the greatest usefulness would be the publication of collections of all the theorems now known that refer to given branches of the mathematical sciences ... Such a collection, which would be long and difficult in ordinary language, is made noticeably easier by using the notation of mathematical logic ...\nIn many ways this grand idea marks the end of Peano's extraordinary creative work. It was a project that was greeted with enthusiasm by a few and with little interest by most. Peano began trying to convert all those around him to believe in the importance of this project and this had the effect of annoying them. However Peano and his close associates, including his assistants,\nVailati\n,\nBurali-Forti\n,\nPieri\nand\nFano\nsoon became deeply involved with the work.\nWhen describing a new edition of the\nFormulario Mathematico\nin\n1896\nPeano writes:-\nEach professor will be able to adopt this Formulario as a textbook, for it ought to contain all theorems and all methods. His teaching will be reduced to showing how to read the formulas, and to indicating to the students the theorems that he wishes to explain in his course.\nWhen the calculus volume of the\nFormulario\nwas published Peano, as he had indicated, began to use it for his teaching. This was the disaster that one would expect. Peano, who was a good teacher when he began his lecturing career, became unacceptable to both his students and his colleagues by the style of his teaching. One of his students, who was actually a great admirer of Peano, wrote:-\nBut we students knew that this instruction was above our heads. We understood that such a subtle analysis of concepts, such a minute criticism of the definitions used by other authors, was not adapted for beginners, and especially was not useful for engineering students. We disliked having to give time and effort to the \"symbols\" that in later years we might never use.\nThe Military Academy ended his contract to teach there in\n1901\nand although many of his colleagues at the university would have also liked to stop his teaching there, nothing was possible under the way that the university was set up. The professor was a law unto himself in his own subject and Peano was not prepared to listen to his colleagues when they tried to encourage him to return to his old style of teaching. The\nFormulario Mathematico\nproject was completed in\n1908\nand one has to admire what Peano achieved but although the work contained a mine of information it was little used.\nHowever, perhaps Peano's greatest triumph came in\n1900\n. In that year there were two congresses held in Paris. The first was the International Congress of Philosophy which opened in Paris on\n1\nAugust. It was a triumph for Peano and\nRussell\n, who attended the Congress, wrote in his autobiography:-\nThe Congress was the turning point of my intellectual life, because there I met Peano. I already knew him by name and had seen some of his work, but had not taken the trouble to master his notation. In discussions at the Congress I observed that he was always more precise than anyone else, and that he invariably got the better of any argument on which he embarked. As the days went by, I decided that this must be owing to his mathematical logic. ... It became clear to me that his notation afforded an instrument of logical analysis such as I had been seeking for years ...\nThe day after the Philosophy Congress ended the Second International Congress of Mathematicians began. Peano remained in Paris for this Congress and listened to\nHilbert\n's talk setting out ten of the\n23\nproblems which appeared in his paper aimed at giving the agenda for the next century. Peano was particularly interested in the second problem which asked if the axioms of arithmetic could be proved consistent.\nEven before the\nFormulario Mathematico\nproject was completed Peano was putting in place the next major project of his life. In\n1903\nPeano expressed interest in finding a universal, or international, language and proposed an artificial language \"Latino sine flexione\" based on Latin but stripped of all grammar. He compiled the vocabulary by taking words from English, French, German and Latin. In fact the final edition of the\nFormulario Mathematico\nwas written in Latino sine flexione which is another reason the work was so little used.\nPeano's career was therefore rather strangely divided into two periods. The period up to\n1900\nis one where he showed great originality and a remarkable feel for topics which would be important in the development of mathematics. His achievements were outstanding and he had a modern style quite out of place in his own time. However this feel for what was important seemed to leave him and after\n1900\nhe worked with great enthusiasm on two projects of great difficulty which were enormous undertakings but proved quite unimportant in the development of mathematics.\nOf his personality Kennedy writes in\n[\n5\n]\n:-\n... I am fascinated by his gentle personality, his ability to attract lifelong disciples, his tolerance of human weakness, his perennial optimism. ... Peano may not only be classified as a\n19\nth\ncentury mathematician and logician, but because of his originality and influence, must be judged one of the great scientists of that century.\nAlthough Peano is a founder of mathematical logic, the German mathematical philosopher\nGottlob Frege\nis today considered the father of mathematical logic.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}