{
  "nome_completo": "Giuseppe Battaglini",
  "nome_curto": "Giuseppe Battaglini",
  "ano_nascimento": "1826",
  "ano_morte": "1894",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Battaglini/",
  "lugar_nascimento": "Naples, Kingdom of the Two Sicilies (now Italy)",
  "lugar_morte": "Naples, Italy",
  "biografia": "Giuseppe Battaglini\n's parents were Francesco Battaglini and Luisa Tofano. He was brought up in Martina Franca, a town in the province of Lecce, and he was essentially self-taught at school level. If the University of Naples had been a quality institution at this time, Battaglini would have studied there but it was a place with low standards, sadly neglected by the government. The Scuola di Ponti e Strade\n(\nSchool of Bridges and Roads\n)\nwas the only other public institution close by in which young people were able to study descriptive geometry, rational mechanics and then applied mathematics. In state secondary schools at this time, only elementary mathematics and other disciplines were taught. So, in\n1844\n, Battaglini entered the Scuola di Ponti e Strade from which he graduated in\n1848\n. His strong political views, however, meant that he had in front of him a future full of difficulties.\nFerdinand II, King of the Two Sicilies, ruled Naples. For some time he had been under pressure to grant a constitution to his people. Riots by those wanting a constitution had broken out in\n1837\nbut had been put down by the military. Further riots in\n1847\n, and again early\n1848\n, forced Ferdinand to offer a constitution on\n29\nJanuary\n1848\n. It based on the French model. However, disputes arose as to the nature of the oath that was required, and as uncertainty remained so riots continued. Battaglini became a student at the Astronomical Observatory of Capodimonte, on the hill of Naples, in\n1850\nbut he resigned in order not to sign a petition to King Ferdinand II demanding that the King abolish the Constitution of\n1848\n. He was prevented from obtaining a university post for political reasons until the unification of Italy and the end of the Kingdom of the Two Sicilies in\n1860\n.\nPolitics was not the only obstacle to Battaglini. A school of classical geometry had been set up in Naples by\nFergola\nand his pupil\nFlauti\nand it was so influential that it was able to prevent modern young geometers from obtaining posts. Battaglini, however, began to publish papers such as:\nSugli assi principali\nⓉ\n(\nOn the main axes\n)\n(1850)\n;\nInscrivere in una superficie di\n2\no grado un poligono in modo che i lati passino per punti dati\nⓉ\n(\nInscribe a polygon in a surface of degree\n2\nso that the sides pass through given points\n)\n(1851)\n;\nSoluzione di un problema di geometria a tre coordinate. Descrivere una sfera in modo che intersechi quattro sfere ad angoli dati\nⓉ\n(\nSolution of a problem of three-coordinate geometry. Describe a sphere so that it intersects four spheres at given angles\n)\n(1851)\n;\nSul problema di inscrivere in una curva di secondo grado un poligono in modo che i lati passino per punti dati\nⓉ\n(\nOn the problem of inscribing in a curve of second degree a polygon so that the sides pass through given points\n)\n(1851)\n;\nDi alcune proprietà delle superficie di secondo grado che passano per una stessa curva o sono inviluppate da una stessa superficie sviluppabile\nⓉ\n(\nOf some properties of the surface of the second degree which pass through the same curve or are enveloped by the same developable surface\n)\n(1853)\n; and\nSulla conica di minima area circoscritta ad un quadrangolo\nⓉ\n(\nOn the cone of minimum  area circumscribed to a quadrangle\n)\n(1854)\n.\nBattaglini was named professor of higher geometry at the University of Naples in\n1860\n. In fact this followed the beginning of a renewal of the university, which as we explained above had been in a poor state, following the return from exile of Francesco De Sanctis who was appointed as director general for education in\n1860\n. In\n1863\n, Battaglini was one of the three founders of the\nGiornale di matematiche\n, the others being Nicola Trudi\n(1811\n-\n1894)\nand Vincenzo Janni\n(1819\n-\n1891)\n. Battaglini edited the journal, aimed at university students, which became the main outlet for papers in non-Euclidean geometry in Italy. Many articles by Battaglini appear in the journal from\n1863\nonwards, but his first memoir on\nnon-Euclidean geometry\nSulla geometria immaginaria di Lobachevsky\nⓉ\n(\nOn the imaginary geometry of Lobachevsky\n)\nwas published in\n1867\n. This was written to establish directly the principle which forms the foundation of the general theory of parallels and the trigonometry of\nLobachevsky\n. He also translated\nLobachevsky\n's\nPangeometry\nⓉ\n(\nPan geometry\n)\nand published it in the\nGiornale di matematiche\nin\n1867\nand\nBolyai\n's\nAppendix\nwhich he published in the\nGiornale di matematiche\nin\n1868\n. In\n[\n8\n]\nSalvatore Cicenia analyses:-\n... the part G Battaglini, often mentioned only for the foundation of his 'Giornale di Matematiche', has had in the elaboration and in the divulgation of non-Euclidean geometry. By means of the study of his articles on hyperbolic geometry and of his unpublished specific correspondence with\nA Genocchi\n, we conclude by saying that the Neapolitan mathematician was interested not only in the technical development of non-Euclidean geometry but even in its foundational aspects and its philosophical implications. The Neapolitan Hegelism, which by its emphasis on the notion of 'a priori' was inevitably opposite to the anti-metaphysical foundation of\nLobachevsky\n's geometry, was a resistance to the affirmation of the new geometry in the academic Parthenopean culture. On the contrary, the positivistic theory of knowledge was a theoretical reference nearer the principles of Lobachevskian geometry.\nAlthough Rome was a natural capital for the Kingdom of Italy, it remained under the control of the Pope after Italian unification in\n1860\n. Only in\n1870\n, after France stopped its support for the Papal States when the Franco-Prussian War began, did Italy capture Rome and it became the Italian capital in\n1871\n. Immediately efforts were made to make the new capital a scientific centre of excellence and the top Italian mathematicians were offered positions there. Battaglini was one of these and, appointed by Giuseppe Garibaldi, he took up his chair in Rome in\n1872\n. He remained in Rome until he retired in\n1885\n, serving as Dean of the Faculty of Physical and Mathematical Sciences, and Rector in\n1873\n-\n1874\n. During these years, he also taught at the Technical Institute in the city. In\n[\n12\n]\nLaura Martini explains how Battaglini indirectly contributed to the development of group theory while in Rome:-\nAt the University of Rome in the mid-\n1870\ns, Battaglini had two students who, during their careers, made important original contributions to group theory:\nAlfredo Capelli\n(1855\n-\n1910)\nand\nGiovanni Frattini\n(1852\n-\n1925)\n. Battaglini, whose research focused mainly on geometric topics was, nevertheless, deeply interested in new developments in other mathematical disciplines, particularly algebra. Immediately after the publication of\nCamille Jordan\n's 'Traité des substitutions et des équations algébriques', Battaglini realized the importance of such a ground-breaking treatise. This appreciation is reflected in the Giornale di matematiche .... There Battaglini published a work on the theory of substitutions and\nGalois theory\nwritten by the young Vincenzo Janni\n(1871\n,\n1872\n,\n1873)\n. This series of articles consists of a summary, with additions, of some of the chapters in\nJordan\n's treatise as well as of parts drawn from\nJoseph Serret\n's 'Cours d'algèbre supérieure' and\nPeter Lejeune Dirichlet\n's 'Vorlesungen über Zahlentheorie'. Battaglini's interest in group theory also manifested itself in the course he gave on the theory of groups of substitutions at the University of Rome during the academic year\n1875\n-\n1876\n. The audience included\nAlfredo Capelli\n. In fact, at the end of the introduction of his\n1878\nmemoir \"Sopra l'isomorfismo dei gruppi di sostituzioni\"\nⓉ\n(\nOn the isomorphism of groups of substitutions\n)\n, the paper he extracted from his\n1877\nthesis written under Battaglini's supervision,\nCapelli\ncredited his supervisor's lectures for his introduction to the subject.\nAs well as\nCapelli\nand\nFrattini\n, the two students of Battaglini mentioned in this quote, we should also mention his students\nEnrico D'Ovidio\n, Riccardo De Paolis\n(1854\n-\n1892)\n, Ettore Caporali\n(1855\n-\n1886)\n, and Domenico Montesano\n(1863\n-\n1930)\nall of whom became well-known algebraic geometers. They all were appointed to chairs at leading Italian universities.\nBattaglini retired for health reasons in\n1885\nand returned to Naples where he remained until his death. Retirement, however, did not mean that he stopped work and he continued to publish papers such as\nIntorno ad un'applicazione della teoria delle forme binarie quadratiche alla integrazione dell'equazione differenziale ellittica\nⓉ\n(\nOn an application of the theory of binary quadratic forms to the integration of elliptic differential equation\n)\n(1888)\n,\nSulle forme bilineari\nⓉ\n(\nOn  bilinear forms\n)\n(1888)\n,\nSui punti sestatici di una curva qualunque\nⓉ\n(\nOn the inflection points of  any curve\n)\n(1888)\n,\nGeometria analitica cartesiana\nⓉ\n(\nCartesian analytic geometry\n)\n(1891)\n, and\nIntorno ad una serie di linee di secondo grado\nⓉ\n(\nOn a series of second-degree lines\n)\n(1892)\n. He also published the textbook\nElementi di calcolo infinitesimal\nⓉ\n(\nInfinitesimal computational elements\n)\nin\n1889\n.\nSome of Battaglini's results have proved significant. For example, in his doctoral dissertation of\n1868\n,\nKlein\nintroduced a classification scheme for second-degree line complexes based on Battaglini's earlier work. However, his main importance is his modern approach to mathematics which played a major role in invigorating the Italian university system, particularly in his efforts to bring the non-Euclidean geometry of\nLobachevsky\nand\nBolyai\nto the Italian speaking world.\nJules Hoüel\nplayed a similar role for non-Euclidean geometry in the French speaking world and the correspondence between the two\n(\nsee\n[\n6\n]\n)\nprovides a vivid picture of the reactions of both the French and the Italian mathematical communities against the non-Euclidean geometries. Battaglini and\nHoüel\nalso exchanged ideas relating to mathematical education in various European countries. In particular they debated the use of\nEuclid\n's\nElements\nas a textbook for teaching elementary geometry in schools.\nIn\n[\n12\n]\nLaura Martini describes Battaglini as a:-\n... brilliant teacher and prolific scholar, with interests in basically all new branches of mathematics ...",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}