{
  "nome_completo": "Glenny Smeal",
  "nome_curto": "Glenny Smeal",
  "ano_nascimento": "1890",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smeal/",
  "lugar_nascimento": "Ararat, Victoria, Australia",
  "lugar_morte": "Wandsworth, London, England",
  "biografia": "Glenny Smeal\nwas an Australian who was educated at the University of Melbourne. He was awarded a B.Sc. by Melbourne in\n1911\n, then travelled to England to study at Imperial College, London. Smeal's studies at Imperial College were financed by a\n1851\nExhibition Scholarship from\n1912\nto\n1914\n.\nIn\n1914\nSmeal was appointed as Assistant Lecturer in Mathematics at the University of Edinburgh, Scotland. After a break for war service between\n1916\nand\n1918\n, he returned to his Assistant Lecturer position. In December\n1919\nhe was promoted to Lecturer in Mathematics at Edinburgh\n(\nat the same time as\nRaymond W Brink\n)\n. Smeal's letter of resignation was put to the Court of Edinburgh University on\n25\nApril\n1921\n. He explained the reason for his resignation; he had been appointed as a Lecturer on Graphics and Computation in the Mathematics Department at Leeds. Edinburgh University appointed George Robinson as Smeal's successor at Edinburgh. From\n1925\nto\n1946\nSmeal was a Lecturer in Statistical Method and Computation at the University of Leeds.\nSmeal joined the\nEdinburgh Mathematical Society\nin December\n1914\nsoon after his appointment as an Assistant at Edinburgh. He remained a member of the Society throughout his career in Leeds.\nWe note that Smeal corresponded with\nR A Fisher\nafter moving to Leeds.\nFisher\n's papers contain\n24\nletters and notes, with tables and copies of printed examination papers in statistics, sent by Smeal to\nFisher\nbetween December\n1925\nand March\n1928\n.\nAmong Smeals' publications are\n(\nwith Ernest Frederick John Love\n)\nThe psychrometric formula\n(1911)\n,\n(\nwith\nS Brodetsky\n)\nOn Graeffe's method for complex roots of algebraic equations\n(1924)\nand\nThe equations of the gravitational field in orthogonal coordinates\n(1926)\n.",
  "math_areas": [
    "Algebra",
    "Statistics"
  ]
}