{
  "nome_completo": "William Gordon Welchman",
  "nome_curto": "Gordon Welchman",
  "ano_nascimento": "1906",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Welchman/",
  "lugar_nascimento": "Fishponds, near Bristol, England",
  "lugar_morte": "Newburyport, Massachusetts, USA",
  "biografia": "Gordon Welchman\n's parents were William Welchman\n(1866\n-\n1954)\nand Elizabeth Marshall Griffith. William was a priest who, after undertaking missionary work abroad, returned to England and became a country vicar. He eventually became archdeacon of Bristol. His wife Elizabeth was the daughter of a priest, the Revd Edward Moule Griffith. Gordon was the youngest of his parents three children. In\n1920\nhe won a scholarship to Marlborough College, an independent boys' school founded in\n1843\nin Marlborough, Wiltshire, He entered Marlborough College in\n1920\nwhere his teachers soon recognised his outstanding talent for mathematics. In\n1925\nhe won a scholarship to Trinity College, Cambridge, to read mathematics.\nWelchman matriculated at Cambridge in\n1925\nwhere he studied the mathematical tripos. He was ranked first class in part one of the tripos in\n1926\nand again first class in part two in\n1928\n. He left Cambridge for a year spending\n1928\n-\n29\nas a mathematics teacher in Cheltenham. He then returned to Cambridge in\n1929\nwhen offered a fellowship by Sidney Sussex College. He published\nFoci of Systems of Spaces\nin the\nJournal\nof the London Mathematical Society in\n1932\nand, two years later, in September\n1934\n, submitted a\n45\n-page paper\nSpecial Scrolls and Involutions on Canonical Curves\nto the\nProceedings\nof the\nLondon Mathematical Society\n. This major paper was published in\n1936\n. Welchman begins the Introduction as follows:-\nThere is at present no satisfactory general theory of special ruled surfaces, or scrolls, and the main object of this paper is to develop the theory of certain fundamental scrolls from which all special scrolls may be obtained by projection.\nIn\n1937\nWelchman married Katharine Hodgson, the daughter of Francis Faith Hodgson who was a captain in the Indian army. Katharine was a professional musician and Gordon and Katharine Welchman had a son and two daughters. Welchman's career was progressing well. He was dean of Sidney Sussex College and he was writing a book entitled\nIntroduction to Algebraic Geometry\n. However, his career took a very different path due to the countries of Europe moving towards war.\nAdolf Hitler had become Chancellor of Germany in\n1933\nand quickly begun to build up the German armed forces. In March\n1938\nGerman troops had marched into Austria and later that year Germany was given the Sudetenland in the Munich Agreement. Although some, like Neville Chamberlain the British Prime Minister, were still trying to avoid a war, others believed that war was inevitable. One who was convinced that war was imminent was Alastair Denniston who was the head of the British Government Code and Cypher School. Denniston had been involved with codebreaking during World War I but he realised that times had changed and different skills would be needed of his codebreakers. In World War I codebreakers were recruited from expert linguists but now he believed that mathematicians were needed\n[\n5\n]\n:-\nHe visited Oxford and Cambridge searching for willing and bright recruits. This was a fairly challenging task since, as Denniston noted, \"it was naturally at that time impossible to give details of the work\" that these recruits would be required to carry out. One recipient of the letters sent out to lecturers at these two universities was Gordon Welchman.\nAs one of the first to be recruited to Bletchley Park where the codebreaking operations were being conducted, Welchman played important roles in recruiting fellow mathematicians and in making significant breakthroughs in the coding operations within the first few months of the war\n[\n4\n]\n:-\nWelchman, assigned by Dillwyn Knox on arrival at Bletchley Park to comparatively low-level research on call signs, quickly realized that he and his few colleagues were dealing with an entire communication system that would serve the needs of the German ground and air forces. It was the development of traffic analysis which was his greatest contribution, but in these early months he made two startling breakthroughs in enabling Enigma-coded signals to be read.\nAt Bletchley Park there were various Huts which worked on different aspects of decoding. This way of organising operations was made in a proposal by Welchman. He was made responsible for setting up and organising Hut\n6\nwhich had the task of breaking the German Army and Air Force codes\n[\n5\n]\n:-\nHe made lists of anything he believed to be of interest and gradually worked his way through the masses of messages that he had been sent. He was also presented with a very small collection of decoded Enigma messages\n(\nno more than three days worth\n)\n. These he found particularly helpful, as they gave an illustration of the types of messages that the Germans were likely to transmit, the polite manner in which they addressed each other, and the style of their signature at the conclusion of the message, which would always include their full title and name. Furthermore, Welchman realised that a particular design flaw of the Enigma machine meant that a letter could never be encrypted as itself. He further realised that if A was encrypted as B for example, then B would be encrypted as A. This was massively important as it reduced the number of combinations of encryptions significantly.\nAlan Turing\nworked in Hut\n8\nwhich dealt with breaking the German Navy codes. He designed the Bombe, an early form of computer, to look at all possible settings of the Enigma machine sending the message. Welchman made a very significant contribution to reducing the number of possibilities that had to be considered by the Bombe and greatly enhanced its usefulness. In October\n1941\nhe was one of four who wrote to the British Prime Minister, Winston Churchill, requesting more resources for the codebreaking work at Bletchley Park. The other three who signed the letter were\nAlan Turing\n,\nHugh Alexander\nand Stuart Milner-Barry. Churchill's response to the letter was the now famous comment \"Action this Day\".\nAfter the war ended Welchman did not return to academic life but instead was appointed as director of research for the John Lewis Partnership. In\n1946\nhe was honoured for his contributions during the war when he was given an OBE\n(\nOrder of the British Empire\n)\n. However, he decided to move to the United States where he felt he could use the computing skills that he had developed during his time at Bletchley Park. He moved to the United States in\n1948\nand he taught the first computing course at the Massachusetts Institute of Technology. He then took jobs at Remington Rand and Ferranti.\nWe noted above that Welchman had been writing the book\nIntroduction to Algebraic Geometry\nwhen he was recruited to the codebreaking operations at Bletchley Park. Welchman aimed to write a book which would:-\n... help some students to appreciate the volumes on 'Principles of Geometry' by Professor\nH F Baker\n.\nThe book was eventually published in\n1950\n, probably more than ten years later than it would have appeared had World War II not interrupted his career. Temple Rice Hollcroft\n(1889\n-\n1967)\n, professor at Wells College, writes in a review:-\nThis is a treatise on algebraic projective geometry of the plane with extensions to higher dimensions. Designed as an introduction to more advanced work, the author applies \"to the more elementary problems the types of reasoning that are used in advanced work.\" ... The book is well written, the expositions clear and ample. The printing is excellent and the formulas well displayed. The methods are almost entirely algebraic except for a few synthetic proofs ...\nWelchman divorced Katharine and married the artist Fannie Hillsmith in\n1959\n. Fannie was the daughter of Clarence Hillsmith, a consulting engineer from New Hampshire. In\n1962\nhe became an American citizen and, shortly after, took a job with the so-called MITRE Corporation. This:-\n... provides services in systems analysis, systems engineering and technical direction for U.S. Government Agencies and other public-interest organisations.\nSome of the work he undertook for MITRE is described in\n[\n5\n]\n:-\nAmongst other things, Welchman was involved in investigating the optimum design of battle field communication systems and found that many parallels could be drawn with his work at Bletchley Park, despite how great the advancements in technology had been in the years in between.\nHis second marriage, like his first, ended in divorce. This was in\n1971\n, the year that he retired but he remained as a consultant for MITRE. A year later, in\n1972\n, he married Elisabeth Huber, the daughter of Anton Wilhelm Huberand Myrtle Octavia Hussey, who owned a sawmill and carpentry business in Bavaria.  Myrtle Hussey was Welchman's second cousin. In\n1974\nhe began writing about his work at Bletchley Park. The book he was writing was entitled\nThe Hut Six Story\n. It was not published until\n1982\n. Joel Greenberg, the author of Welchman's biography\n[\n2\n]\n, describes Welchman's book:-\nThat was the first book which actually explained how they did it. All the other books told the story about Bletchley Park, the fact that messages were decrypted on an industrial scale and all this intelligence was produced, there was lots of information about how it affected the outcome of World War Two, but nobody was allowed to or dared describe the process of how they actually did it. Welchman's book was the first and interestingly enough it probably remains the only serious book in print to describe technically how the Bombe worked and how Enigma messages were decrypted on an industrial scale. There were references to it in other books but not in the detail that Welchman went into.\nThe publication of the book led to the Cabinet secretary, Sir Robert Armstrong, writing to the British Prime Minister, Margaret Thatcher:-\nA book entitled \"The Hut Six Story\", by Gordon Welchman, has been published in the United States and is due for publication in this country in June. Welchman was in charge of Hut\n6\nat Bletchley Park during the first part of the War. Hut\n6\nwas responsible for the cryptanalysis of German Enigma traffic. The book goes into very considerable technical detail about the method developed for this work. Much of the information in the book is still classified in both the United Kingdom and the United States. Little World War II cryptanalysis information is directly relevant to present day exploitation. None of the revelations are directly damaging to UKUSA Sigint. There must however be some indirect damage, in the sense that so long as Signet and cryptanalysis are kept in the public eye by books of this sort, foreign COMSEC organisations will receive more funds and will be stimulated to greater efforts.\nThe book was not banned but Welchman lost his US security clearance and was forbidden to discuss his book or his wartime work with the media. Three years after publication of the book, GCHQ Director Sir Peter Marychurch sent Welchman a letter in which he accused him of damaging security. His last years were difficult ones - he had FBI agents parked outside his house and believed his phone was tapped.\nAbout Welchman's motivation to write the book, Greenberg writes:-\nHe became an American citizen in the early\n1960\ns so he thought he was immune from prosecution. He knew that GCHQ weren't keen and that if he asked GCHQ they would say no. But he had other reasons for wanting to do it. It wasn't an ego trip and it wasn't about making a lot of money. ... He was\n33\nat the beginning of the war and, by Bletchley Park standards, that was middle aged. They were all so young. He'd recruited a lot of former students and he found some of his colleagues, had almost been disowned by their families. He just felt their story should be told and even if he didn't name or quote them, people would be more aware of the amazing things these people did. Welchman encountered suspicion himself, from his wife's family, who were senior military figures. They saw him out of uniform, at the age of\n33\n, and Welchman was not able to tell them what contribution he was making to the war effort.\nFinally, let us quote Leonie Field's summary of Welchman's Prologue from\nThe Hut Six Story\n[\n5\n]\n:-\nIn his prologue to The Hut Six Story Welchman says that the lessons that should be taken from his story are firstly that protection against theft, enemy infiltration, sabotage and so on are just as important as protection against the enemy breaking your own codes. Secondly, he makes the point that studying the flaws in the use of the Enigma machine that he himself exploited highlights the importance of adequate training and monitoring of all those who work within the system of battle field communications. He emphasises the lesson that can be learned of the importance of close cooperation between military sectors. Lastly, and most importantly, he stresses that those in charge of current day security systems must remain mindful of future technological advancements in the present day. He believed that there was an important warning in the fact that the Germans believed the Enigma code to be entirely unbreakable and therefore put far too much faith in its insusceptibility to enemy cryptanalysis. They had not planned for the invention of the bombe, a brand new electromechanical device.\nWelchman's character and interests are described by Robin Denniston in\n[\n4\n]\n:-\nWelchman had an acute analytical mind, boundless drive and enthusiasm, but rather limited imagination. At a crucial moment in the Second World War he brought together discrete ideas and divergent pieces of evidence to produce a total policy framework. As a man, though not always easy for his colleagues to communicate with, he was admired, trusted, and liked, for his great charm as well as intelligence and kindness. ... He  loved mountains, for climbing and skiing. He was an avid gardener and a keen amateur musician.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}