{
  "nome_completo": "Andrew Gordon Speedie Pask",
  "nome_curto": "Gordon Pask",
  "ano_nascimento": "1928",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pask/",
  "lugar_nascimento": "Derby, England",
  "lugar_morte": "London, England",
  "biografia": "Gordon Pask\n's parents were Mary and Percy Pask. Percy was a partner in the firm of Pask, Cornish and Smart, a wholesale fruit business in Covent Garden, London. Gordon had two older brothers, Alfred Pask who became a Methodist minister and Edgar Pask who became a Professor of Anaesthetics. There was a\n20\nyear age difference between Gordon and his elder brothers. Although born in Derby, the family moved to the Isle of Man when Gordon was a baby and he spent his early years there. As a child his health was very poor and doctors gave him little chance of reaching adulthood but, despite spending long periods confined to his bed, he survived.\nHe was educated at Rydal School in North Wales. He then studied geology at Bangor Technical College, and Mining Engineering at Liverpool Polytechnic, before entering Downing College, Cambridge, to study medicine. In fact he graduated with a degree in natural science rather than medicine in\n1952\n. In the following year he founded System Research Ltd with Robin McKinnon-Wood\n(1931\n-\n1995)\n[\n5\n]\n:-\nFor thirty years, he was the company's director of research. Gordon was successful in attracting funding from a wide range of agencies\n(\nincluding the United States Air Force, Ministry of Defence, Department of Employment, and the Social Science Research Council\n)\n. His research teams carried out research on skill acquisition, styles and strategies of learning, learning in groups, knowledge and task analysis, processes of design, decision-making, problem-solving and learning to learn.\nIn\n1956\nPask married Elizabeth Poole; they had two daughters, Amanda\n(\nborn\n1961)\nand Hermione\n(\nborn\n1967)\n.\nPask produced a variety of computers, not the conventional type of computer that will come to mind, but rather electro-mechanical, chemical and biological computers. Fascinated by the theatre, he painted and designed stage sets. In\n1953\nhe produced a computer to control a collection of lights which would adapt the scene to the performance of a musician on the stage. Three years later he developed another computer, this time a teaching system for playing a keyboard which was adaptive. In these, and other, inventions he was attempting to reproduce intelligent behaviour and the key to this he believed was interaction. Among his work from this period is\nSelf-organizing systems\n(1960)\nand, jointly with Heinz von Foerster,\nA predictive model for self organizing systems\n:-\n... a two-part methodological article which sets forth the game-theoretic framework associated with a program of experimental work on constrained competitive and cooperative activity.\nIn\n1961\nhe published his first major book\nAn Approach to Cybernetics\n, still an excellent introduction to the topic although written almost half a century ago. He was awarded a PhD in psychology from University College, University of London, in\n1964\n. He was appointed as Professor of Cybernetics at Brunel University in\n1969\n, a post he held until his death. He also had numerous appointments as Visiting Professor, more notably at the Institute of Educational Technology of the Open University from\n1974\nto\n1979\nand the Centre for Innovation and Co-operative Technology of the University of Amsterdam, but also at the University of Illinois, the University of Mexico, the Georgia Institute of Technology, Old Dominion University in Norfolk, Virginia and Concordia University in Montreal.\nLet us give just a few example from the large number of papers and books which Pask wrote. Two of his books were published in\n1975\n. We mention first\nThe cybernetics of human learning and performance\n:-\nThe author wrote this book in the belief that an intelligent layman is frequently just as able to grasp the ideas he presents as someone well versed in mathematics. He offers all these readers either a guidebook to cybernetics and general system theory, or as a cybernetic/system-theoretic, global approach to experimental psychology, depending on the readers' preferences. The coverage is vast and ranges in depth from very superficial to highly innovative. There is much to stimulate a creative mathematician who can discover the hidden gems in this book to generate new mathematics ...\nProbably the most famous concept he introduced was 'Conversation Theory' which was the topic of the other book which he published in\n1975\nConversation, cognition and learning\nand also of one he published in the following year\nConversation Theory: Applications in Education and Epistemology\n. The initial ideas for Conversation Theory came from a slightly unlikely source, namely work that System Research undertook to assist baggage handling at London's Heathrow airport. He:-\n.... conceived human-machine interaction as a form of conversation, a dynamical process, in which the participants learn about each other.\nOther books include\nCalculator Saturnalia, or, Travels with a Calculator\n(1981)\n,\nMicroman Living and growing with computers\n(1982)\n, and\nInteractions of Actors\n(1993)\n. He also wrote a collection of short stories\nAdventures with Professor Flaxman-Low\n(1993)\n.\nPask received many honours for his remarkable contributions to education and to cybernetics. For example he was awarded a DSc from the Open University for his contribution to Educational Technology in\n1974\n, and a ScD by Downing College, Cambridge in\n1995\n. He received the first award of the \"Ehrenmitgleid\" from the Austrian Society for Cybernetic Studies, and the\nNorbert Wiener\nGold Medal from the American Society for Cybernetics. He was elected to the Austrian Society for Cybernetic Studies, the American Society for Cybernetics, the Society for Instructional Technology, the Society of Applied Psychology, the International Association of Cybernetics, the British Computer Society, and elected a fellow of the UK Cybernetics Society\n(\nhe was chairman from\n1976\nto\n1979)\n, the British Psychological Society, the\nRoyal Statistical Society\n, and the\nNew York Academy of Sciences\n.\nHe died at the comparatively young age of\n67\n, but his death was not unexpected since he had been battling against a serious illness for several years. However he faced the illness with great bravery and remained cheerful through difficult circumstances.\nAlthough we have indicated some of his brilliant contributions, we have not yet attempted to look at the personality of this eccentric genius. Ted Nelson writes\n[\n2\n]\n:-\nGordon Pask is one of the maddest mad scientists I have ever met. He is also one of the nicest. An eloquent English leprechaun who dresses the Edwardian dandy, Pask sows awe wherever he goes. ... Pask is one of the great international fast-talkers, conference-hopping round the globe from Utah to Washington to his project at the Brooklyn Children's Museum. ... In a field full of brilliant eccentrics Pask has no difficulty standing out.\nAnother view of Pask appears in\n[\n5\n]\n:-\nGordon Pask was a rare man. He was an original; an eccentric in the best sense; gifted as a scientist, artist, lyricist. His peers in academic life have regularly acknowledged his genius. He had an exceptionally productive career\n(\nseveral books, over two hundred published papers\n)\n. His many contributions are still being assimilated in psychology, educational technology, cybernetics and systems science.\nA similar picture is painted in\n[\n3\n]\n:-\nFrom the intensity with which he lived, perhaps his own body suffered the most. Waking him for his evening dinner guests, after his long nights of work and short days of sleep, entailed a delicate balance of firmness and compassion. While waiting I could review the fruits of his night's work - perhaps a new song lyric or research paper. Before the jacket and bow-tie and cape could go on, here was this mad and brilliant creature, all sinew, rising to dazzle and demand of us, and of himself, once more.",
  "math_areas": [
    "Algebra",
    "Statistics"
  ]
}