{
  "nome_completo": "Gottfried Maria Hugo Köthe",
  "nome_curto": "Gottfried Köthe",
  "ano_nascimento": "1905",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kothe/",
  "lugar_nascimento": "Graz, Austria",
  "lugar_morte": "Frankfurt, Germany",
  "biografia": "Gottfried Köthe\n's father was Hugo Köthe, a businessman and engineer, while his mother was Josefa Jungl. Gottfried attended the Volksschule in Graz before moving to the\nRealgymnasium\nwhere his favourite subjects were philosophy and chemistry. He graduated in the summer of\n1923\nwith his\nAbitur\nand in the autumn of that year he entered the University of Graz. Since Köthe became an outstanding mathematician one would assume that he studied mathematics at university but this was certainly not the subject he intended to study. He entered university with the intention of studying the subject he had enjoyed most at high school, namely chemistry. After two terms of this course he went on holiday to the Wörthersee, an alpine lake in the south of Austria. There he met, quite by chance, Alfred Kastil, who was Professor of Philosophy at Innsbruck University. Let us quote Köthe's own words about how he became a mathematician\n[\n6\n]\n:-\nI became a mathematician almost by chance. At school I had two interests which I pursued rather intensively, one was chemistry, the other philosophy. At university I began with the study of chemistry. A meeting with Innsbruck philosopher Alfred Kastil, of the school of Franz Brentano, brought philosophy again into the foreground Since I was fascinated by epistemology and logic, in particular the paradoxes of set theory, it seemed best to give up chemistry and to study mathematics together with philosophy instead. It turned out then that mathematics attracted me more strongly than philosophy; in mathematical reasoning I found the precision and certainty which I had sought in philosophy, but in the end failed to find there. Nevertheless I have always retained an interest for the questions which lie at the borderline between mathematics and philosophy.\nHe studied the foundations of mathematics for his doctorate, advised by Tonio Rella and Robert Daublewsky von Sterneck. He submitted his thesis\nBeiträge zu Finslers Grundlegung der Mengenlehre\nⓉ\n(\nContributions to Finsler's foundation of set theory\n)\nin\n1927\nand was awarded his doctorate in October of that year. However, his thesis was never published since, as\nEmmy Noether\nlater wrote in reference for Köthe, there were\n[\n6\n]\n:-\n... certain difficulties which arose, having to do with the uncertainties in\nFinsler\n's axiomatic system.\nAfter the award of his doctorate, Köthe went to Zürich where he spent the winter term of\n1927\n-\n28\nworking with\nPaul Finsler\n, who had just been appointed to the university, as well as with\nRudolf Fueter\nand Andreas Speiser. He also attended a course on\nQuantum Mechanics and Group Theory\ngiven by\nHermann Weyl\nwho held the chair of mathematics at the Zürich Technische Hochschule. After spending the year in Zürich, Köthe was awarded a fellowship by the German Research Foundation which funded a visit to the University of Göttingen. This visit proved a major influence on Köthe since, after attending courses by\nEmmy Noether\non\nNon-Commutative Algebra\nand by\nBartel van der Waerden\non\nAlgebraic Numbers\n, his interests turned to algebra. However, he clearly felt unsure of having a future in the academic world since he also attended a number of courses on financial mathematics and insurance to set himself up for a possible career. While on this visit to Göttingen, Köthe attended the International Congress of Mathematicians held in Bologna in September\n1928\nas did\nEmmy Noether\n. Köthe gave a lecture at the Congress describing the results he had obtained in the structure theory of rings.\nEmmy Noether\nwrote a letter of recommendation for Köthe to\nOtto Toeplitz\nwho appointed him as his assistant at Bonn for the year\n1929\n-\n30\n.\nKöthe had now turned to research in ring theory and, in\n1930\n, published papers such as:\nÜber maximale nilpotente Unterringe und Nilringe\nⓉ\n(\nAbout maximum nilpotent subrings and nil rings\n)\n;\nAbstrakte Theorie nichtkommutativer Ringe mit einer Anwendung auf die Darstellungstheorie kontinuierlicher Gruppen\nⓉ\n(\nAbstract theory of noncommutative rings with an application to the representation theory of continuous groups\n)\n; and\nDie Struktur der Ringe, deren Restklassenring nach dem Radikal vollständig reduzibel ist\nⓉ\n(\nThe structure of  rings whose residue class ring is completely reducible to the radical\n)\n. In the last mentioned of these three papers Köthe made his famous conjecture:\nIn every ring the sum of two left nil ideals is a nil ideal.\nAlthough many special cases of this conjecture have been proved, as far as we are aware the conjecture is still open. The year that Köthe spent as\nToeplitz\n's assistant proved important since it produced another change in the direction of Köthe's research and led him to the area for which he is best known today, namely topological vector spaces. Although Köthe only spent a year in Bonn with\nToeplitz\n, they continued joint work. They published a work on semifinite matrices in\n1931\nand, in\n1934\n, a joint paper in which they introduced, in the context of linear sequence spaces, some important new concepts and theorems which anticipated the later theories of dual pairs and locally convex spaces developed by\nvon Neumann\n,\nDieudonné\n,\nGrothendieck\n, and\nSchwartz\n.\nAfter spending the year in Bonn, Köthe went to Münster in\n1930\nas an assistant to\nHeinrich Behnke\nand Lugwig Neder at the Westfälische Wilhelms University of Münster. Both\nBehnke\nand Neder had been appointed as professors at Münster in\n1927\n,\nBehnke\ncoming from Hamburg and Neder from Tübingen. Before Köthe went to Münster,\nEmmy Noether\nhad written to\nBehnke\n[\n6\n]\n:-\nI would be very happy if Köthe could do his\nhabilitation\nwith you. I regard him as\nvery\ngifted, and he works\nintensively\n, for all his apparent laziness. Personally, this hasn't bothered or disappointed me a bit, but\nCourant\njust couldn't get over his \"Austrian slovenliness\". Thus he's probably not high on the list of those whom\nCourant\n, who is after all always asked, recommends for university positions.\nAlthough Köthe was moving more towards research in functional analysis, he still produced an habilitation thesis which was purely algebraic entitled\nSchiefkörper unendlichen Ranges über dem Zentrum\nⓉ\n(\nSkew fields of infinite rank over the centre\n)\nand published in\nMathematische Annalen\n. The thesis was accepted on\n31\nJanuary\n1931\nand he became a Lecturer in Geometry in\n1935\n. On\n20\nApril\n1937\nhe was promoted to extraordinary professor at Münster. On\n1\nOctober\n1940\nhe took up a new appointment as extraordinary professor at the University of Giessen where he became a full professor on\n1\nJuly\n1943\n. Of course we are now giving details of Köthe's university positions during World War II, but he also did war work during these years beginning in\n1940\n. He was drafted into the Foreign Office where, as a scientific advisor, he undertook decoding work. It was at this time that he met his future wife who was trained as a classical philologist and also drafted into decoding work.\nAfter the end of World War II, the University of Mainz reopened as the Johannes Gutenberg University of Mainz and Köthe was appointed as a professor. From\n15\nOctober\n1946\nhe became Director of the Mathematics Institute at Mainz and in the following years he did an excellent job in expanding the Institute. He also served as Dean of Science from\n1948\nto\n1950\nand Rector of the University from\n1954\nto\n1956\n.\nLaurent Schwartz\nwrites in\n[\n1\n]\nabout meeting Köthe during his time at Mainz:-\nDuring a brief trip to Germany in\n1950\n, I was struck by the misery which still reigned there. Many houses had been destroyed, families lived in basements where air entered only through a vent. Small children begged at train stations. It was impossible to feel any real consciousness of what had happened during the war ... At the University, I exchanged views with some colleagues, in particular the mathematician Gottfried Köthe, a specialist in topological vector spaces defined from sequences of numbers. He surely did nothing wrong during the war. He was a nice agreeable man; we kept in touch. But like the majority of his countrymen, he didn't seem to attach any importance to Germany's past. I owe him some good theorems on distributions.\nKöthe's research now had become almost exclusively in\nfunctional analysis\n. For example, in\n1960\nwhen he was elected to the\nHeidelberg Academy of Sciences\n, he spoke of his collaboration with\nOtto Toeplitz\n[\n6\n]\n:-\nTogether we developed the theory of perfect spaces, a counterpart to the theory of\nBanach spaces\n. After the Second World War both theories were incorporated into the theory of linear topological spaces, which attained definitive form in the hands of French mathematicians of the\nBourbaki\nschool, after the apparatus of general topology had been sufficiently developed. Since these first papers with\nToeplitz\n, I have remained more or less faithful to this area of mathematics, also known as functional analysis, which may be characterised as the penetration and further development of classical analysis with the help of topological-algebraical concepts.\nHowever, he retained the interests which had brought him into mathematics in the first place, namely set theory and the foundations of mathematics. For example he delivered the lecture\nSobre a nao contradiçao da matemática\nⓉ\n(\nOn the 'not' contradiction of mathematics\n)\nat the University of Lisbon, Portugal, on\n27\nApril\n1954\nwhich was later published. Newton Carneiro Affonso da Costa writes\n[\n2\n]\n:-\n[\nKöthe\n]\ndiscusses the consistency of mathematics in general and of arithmetic and analysis in particular. The works of\nRussell\n,\nBrouwer\n, and\nHilbert\non the foundations of mathematics are referred to, as well as some of the most important results of\nGödel\n,\nGentzen\n, and Lorenzen connected with the consistency of arithmetic, analysis, and set theory.\nOn\n1\nOctober\n1957\nKöthe left Mainz to take up the Chair of Applied Mathematics at the University of Heidelberg and, at the same time, he became Director of the newly established Institute for Applied Mathematics. In\n1960\nhe published the first volume of his treatise\nTopologische lineare Räume\nⓉ\n(\nTopological linear spaces\n)\nwhich we look at in more detail below. Also in\n1960\nhe became rector of the University of Heidelberg and held this position for one year. Joachim Weidmann writes\n[\n6\n]\n:-\nIt was about that time\n[1960\n-\n61]\n, during my fifth or sixth term, when I met Köthe first. In the following years I had the pleasure to attend his inspiring lectures on \"Hilbert Space Theory\", \"Partial Differential Equations\", \"Game Theory\" and especially about the field of his main interest \"Topological Vector Spaces\". The speech as a rector at the occasion of the installation ceremony and the\n574\nth\nanniversary of the Ruprecht-Karl-Universität in\n1960\nhad the title \"Game Theory, a New Branch of Applied Mathematics\". He succeeded in producing a remarkably wide public response to a mathematical subject. Looking through his papers after his death, I found out that actually the range of topics of his lectures during\n40\nyears of teaching covered almost all fields of mathematics.\nOn\n1\nMay\n1965\nKöthe left Heidelberg to fill the Chair of Applied Mathematics at the Johann Wolfgang Goethe-Universität at Frankfurt. There he became a colleague of\nReinhold Baer\n,\nRuth Moufang\n, Wolfgang Franz and Walter Benz. In\n1966\nhe published the second edition of the first volume of\nTopologische lineare Räume\nⓉ\n(\nTopological linear spaces\n)\nand three years later this volume appeared translated into English as\nTopological vector spaces\n. The second volume of the treatise still had not appeared and Köthe was keen to find the time to produce it so he decided to retire on\n31\nMarch\n1971\nalthough he could have remained in post. It was to take Köthe another eight years before the second volume was published: written in English it was entitled\nTopological vector spaces\nII\n(1979)\n. Let us now look at some reviewers' comments on this classic text. Reviewing the\n1960\nfirst German edition, S Kaplan writes:-\nThis is the first half of a projected treatise. It covers, with some exceptions, only general linear topological spaces and locally convex ones, important specific types of spaces, such as the spaces of distributions, being left to the second volume. Moreover, it takes up only the \"statics\" of the subject, the study of linear transformations\n(\nagain with some exceptions\n)\nalso being left to the second volume. The exceptions to the above statements are those necessary for the development of this first volume. Linear functionals are of course studied intensively here; while the standard simple\nBanach\nspaces ... and spaces of holomorphic functions are introduced and used to illustrate the general theory, and a rather complete development is given of the author's own theory of sequence spaces. These last, especially, supply him with a rich source of counter-examples for some of the deep questions of the general theory. The order of the book follows a remorseless logic. ... it is encyclopedic in character and the proofs are very elegant; consequently, it will probably be a \"must\" in the private library of every practitioner of the subject. Finally, the book has performed a useful function in presenting some developments which may not be widely known and which almost certainly have contributions to make to the progress of the subject.\nReviewing the same work,\nLeopoldo Nachbin\nwrites\n[\n3\n]\n:-\nThe book under review, written by a leading figure in the field of functional analysis, is a most valuable contribution to the literature on topological vector spaces. ... The present book was written, it appears, with the two-fold purpose of being a textbook which can be read by graduate students\n(\nwho will even find in it an opening chapter on point set topology\n)\nas well as a reference work for research mathematicians\n(\nwho will find in it a wealth of information\n)\n. In the latter direction, it constitutes the first treatise devoted to the various aspects of topological vector spaces. ... For a number of years, it has been known that the author was writing this text. Let us hope that Professor Köthe will find some spare time from his duties as the Rector of the University of Heidelberg in order to finish in a reasonably finite length of time the treatise on topological vector spaces, which he has so successfully begun.\nG J H Garling, reviewing the second volume, writes:-\nThis is the second volume of a treatise, the first volume of which appeared some twenty years ago. It contains two further chapters, on linear mappings and duality, and on spaces of linear and bilinear mappings. ... this is an extremely welcome book: the elegance and the economy of style noted by the reviewer of the first volume are still manifest.\nKöthe continued his mathematical activities up to the time of his death\n[\n6\n]\n:-\nGottfried Köthe died, completely unexpected at that time, on April\n30\n,\n1989\n, scientifically active up to his last days: He was still acting as one of the editors of the 'Mathematische Leitfäden', he still had an extensive correspondence with a large number of mathematicians all over the world, and he was still publishing scientific papers.\nIn addition to the honours mentioned above, Köthe became Commandeur dans l'Ordre des Palmes Académiques in\n1961\n, was awarded the\nGauss\nMedal by the Brunswick Academy of Sciences in\n1963\n, and was elected to the\nGerman Academy of Scientists Leopoldina\nat Halle in\n1968\n. He was awarded honorary degrees by the universities of Montpellier\n(1965)\n, Münster\n(1980)\n, Mainz\n(1981)\nand Saarbrücken\n(1981)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}