{
  "nome_completo": "Grace Awani Alele-Williams",
  "nome_curto": "Grace Alele-Williams",
  "ano_nascimento": "1932",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alele-Williams/",
  "lugar_nascimento": "Warri, Nigeria",
  "lugar_morte": "Lagos, Nigeria",
  "biografia": "Grace Alele-Williams\nwas given the name Grace Awani Alele; she adopted the Alele-Williams name by which she is now known after her marriage to Babatunde A Williams. Grace attended Government School, Warri, and Queen's College, Lagos, graduating in\n1949\n. In that year she entered University College Ibadan, now the University of Ibadan, and graduated with an Honours Degree in Mathematics in\n1954\n. At this time University College Ibadan, was not awarding its own degrees and so the Honours Degree that she received was an external University of London degree. Every summer during her undergraduate studies, Alele returned to her home town of Warri and, starting in\n1950\n, she taught mathematics during the summer vacation at Hussey College, Warri.\nAfter the award of her honours degree in\n1954\n, Alele was appointed as a mathematics teacher at Queen's School, Ede, Osun State, where she taught from\n1954\nto\n1957\n[\n12\n]\n:-\nDissatisfied with her situation at Queen's School, Alele managed to obtain financial assistance from the Nigerian Head of Service to attend the University of Vermont as a graduate assistant with the goal of becoming a secondary school teacher. She found the weather in Vermont to be cold and also experienced forms of segregation in the rural setting. Soon, however, Sputnik shifted America's attention to the importance of mathematics and education, and Alele had the opportunity to go to the University of Chicago, Columbia, or Harvard. She chose the University of Chicago, and in\n1963\nobtained her Ph.D. in mathematics education with a dissertation on \"Dynamics of Education in the Birth of a New Nation: Case Study Of Nigeria.\"\nShe had been awarded a Master's Degree in Education in\n1959\nhaving taught mathematics as a Graduate Assistant in the Mathematics Department while studying Mathematical Education. A Graduate Fellowship Award allowed her to go to the University of Chicago Illinois later in\n1959\nto study for a Ph.D. If this sounds like a relatively standard route to a Ph.D., we have to make it clear that this was a remarkable achievement, for when she was awarded her doctorate in March\n1963\nshe became the first Nigerian woman ever to be awarded a doctorate. After the award of the degree, she returned to Nigeria and spent two years at the University of Ibadan undertaking postdoctoral work as a post-doctoral research fellow in the department and Institute of Education. During this time she became involved in the African Mathematics Programme which came out of a six week meeting at Dedham, Massachusetts, in the summer of\n1961\nwhich set up the African Education Program. The chair of the Steering Committee was William Ted Martin\n(1911\n-\n2004)\n, who was the head of mathematics at the Massachusetts Institute of Technology from\n1947\nto\n1968\n, and made regular visits to Africa between\n1961\nand\n1975\nto assist with the African Education Program. Alele-Williams writes\n[\n2\n]\n:-\n... the African Mathematics Programme brought together Africans, Americans, and British educators in English-speaking African countries to consider changes in mathematics education in Africa. ... The African Mathematics Programme organized writing workshops in Africa that produced the Entebbe Modern Mathematics Series. Between\n1962\nand\n1969\n, the African Mathematics Programme conducted annual eight-week writing workshops in Entebbe and Mombassa, and produced over\n80\nvolumes of textual materials covering primary school, teacher training, secondary, and sixth-form mathematics.\nAlele-Williams participated in these workshops from\n1963\nto\n1975\n.\nIn December\n1963\n, not long after returning to Nigeria from the United States, she married Babatunde Abraham Williams\n(\nborn\n1932)\n, a political scientist who, at the time of their marriage, was a Senior Lecturer at the University of Ife Osun. After two years postdoctoral work at the University of Ibadan, Alele-Williams was appointed as Lecturer I in the Teaching of Mathematics in the Faculty of Education at the University of Lagos. She moved to Lagos to take up the appointment in\n1965\n, her husband taking up an appointment at the University of Lagos at the same time.\nIn\n1968\nAlele-Williams was promoted to Senior Lecturer at the University of Lagos and, in\n1974\n, Associate Professor of Mathematics. She published the paper\n[\n4\n]\n,\nThe Entebbe Mathematics Project\n, in\n1971\n. Her paper gives the following conclusion about the\nEntebbe Mathematics Series\ncomprising\n67\nvolumes of texts which cover the entire primary, training, secondary and sixth form levels:-\nThe Entebbe Mathematics Series have sometimes been dubbed American but this is to ignore the valuable contribution of the African participants, who feel keenly the African origin of the series. Moreover the whole exercise has provided an international forum for teaching and learning, unprecedented in the annals of education. Africans, working with Europeans and Americans, have produced mathematics texts good enough for use anywhere in the world. Mutual benefits have been derived by all concerned and the project has clearly contributed to international understanding.\nShe published the book\nModern Mathematics Handbook for Teachers\nin\n1974\n.\nIn\n1975\nshe was appointed as Director of the Institute of Education of the University of Lagos, a position she held until\n1985\n. In this role she introduced certificate courses which were particularly important in training older women to become primary school teachers. She also had important positions outside the university being chairman of Bendel State Curriculum Review Committee from\n1973\nto\n1979\n. She served as chairman of the Lagos State Curriculum Review Committee and Lagos State Examinations Boards from\n1979\nto\n1985\n. She had already identified what was needed in her report of\n1976\n[\n2\n]\n:-\nThe experiments in the schools led many parents to think more about what their children learned at school and it is not too great a claim to say that the annual and end-of-term inservice courses for teachers led ministries of education to rethink their mathematics programme. In the case of Lagos State, the favourable demonstration effect of the Entebbe Mathematics program coinciding with the states' readiness to introduce a new syllabus led to the total acceptance of the project. In Lagos State, we believe we still have considerable work to do with the teachers. Teaching the teachers mathematics is a relatively simple task but changing their attitude and practice is harder. Several years of hard work are still necessary before we can truly claim that modern mathematics has come to stay.\nAlele-Williams was appointed as Vice-Chancellor of the University of Benin in\n1985\n. This was a remarkable achievement in that she became the first woman to become Vice-Chancellor of an African University. She remained in this position until\n1991\n. In a\n2004\ninterview, quoted in\n[\n16\n]\nand\n[\n17\n]\n, she said:-\nThe excitement I felt on receiving the news from Professor Jubril Aminu\n[\nthe Nigerian Minister of Education\n]\nhad more to do with seeing it in terms of opening up the field for women than anything else. I saw it as an opportunity to show that women too could rise up to the occasion. Also, I knew what the weight of the expectations of the women was. They were eager to see how things would go and I was not going to let them down. Mind you, those who appointed me felt I was qualified for it; so it was not just a case of wanting to satisfy the yearnings of the womenfolk. It wasn't that simplistic.\nThe task was a daunting one for anyone to take on at this time as explained in\n[\n16\n]\n:-\nAccomplished as she was, it was during a dark period for Nigeria's higher education that Professor Grace Awani Alele-Williams was to come into national reckoning. The scourge of secret cults, confraternities and societies had spread within Nigerian universities. Universities in the South were particularly affected and the University of Benin one of the worst hit. It was to this scenario that Professor Grace was appointed as vice chancellor in\n1985\n. But being appointed the first female vice chancellor of a Nigerian or an African university was barely the issue for Alele-Williams. A task had been set before her at which many other men had failed, and it was on this that she was focused. It was with a combination of courage, ingenuity and strategy that the growing tide of cultism was eventually stemmed in the university, sending ripples of change across institutions of higher learning all over the country.\nOne of her students, writing a piece in celebration of Alele-Williams's\n80\nth birthday on\n16\nDecember\n2012\n, wrote of her appreciation\n[\n14\n]\n:-\nToday, friends and family are converging in Lagos to celebrate the\n80\nth Birthday of a great African, a quality Nigerian, a super patriot, an indomitable champion of women's causes, a great educator and educationist, the inimitable Mother of Nigerian academia and an exemplary Amazon, Professor Grace Awani Alele-Williams. I am here celebrating this special woman, not only because she was the Vice-Chancellor at the University of Benin who signed my Degree Certificate\n(\nBA History,\n1985\n, as the best graduating student in my class\n)\n, but also because she was 'primus inter pares' amongst those who put the \"Great\" in Great UNIBEN! Of course, it wasn't easy to have to step into the shoes of another great Nigerian, Professor Adamu Baikie who held the position of the Vice-Chancellor of the University of Benin before her, but Professor Alele-Williams did it with grace, guts and grit. As the first woman to be appointed the Vice-Chancellor of a Nigerian university, the cynicism before her takeover in Benin was ear-splitting! From calmly and firmly defusing sponsored \"alutas', rumour-mongering, scary shadow-boxing, sabotage and all, her time at the University of Benin from\n1985\nto\n1991\nqualifies as a Golden Age. Mama Grace Alele-Williams opened her doors to everyone, treated students with respect, listened to what they had to say, encouraged academic freedom, victimized no one on account of holding contrary views and made the University of Benin a true place of learning. And she did all this at the height of military rule.\nAfter her time as Vice-Chancellor, she served on the board of directors of Chevron-Texaco Nigeria. She also served on the board of HIP, an Asset Management Company in Lagos, Nigeria. On\n11\nNovember\n1994\nshe gave the Distinguished Annual Lecture at the National Institute for Policy and Strategic Studies, Kuru\n[\n14\n]\n:-\nIn what was considered a veritable 'tour de force', Professor Alele-Williams spoke passionately about the role of the Nigerian University system as an instrument for cohesion, change and development in our nation. Today, as we lament the falling standard in education and the negative ethnicization and contraction of real quality educational opportunities, we might do well to go dust up that lecture from this great Nigerian to follow up on some of her proposals. I say this, because what she spoke about almost two decades ago is still germane to our situation today. She is not only a great administrator, manager of men and resources and a goal-getter, she is a great visionary.\nGiven her remarkable achievements, Alele-Williams received many awards and honours. She received the Order of the Niger in\n1987\n, was elected a Fellow of the Mathematical Association of Nigeria and a Fellow of the Nigerian Academy of Education. She won a Merit Award of Bendel State in Nigeria, served as Regional Vice President for Africa of the Third World Organization for Women in Science and was chair of the African Mathematical Union Commission for Women in Mathematics. Let us note that Alele-Williams's birth place was Warri which was in Bendel State, but it is now Delta State.\nOn\n28\nFebruary\n2014\nshe received the Centenary Award. The Nigerian paper\nEncomium\nreported the event as follows\n[\n15\n]\n:-\nProfessor Grace Alele-Williams, first female professor of Mathematics and first female Vice Chancellor in Nigeria, received deafening applause as she walked with the aid of crutches to the podium to receive her Centenary Award this evening\n(\nFriday,\n28\nFebruary\n2014)\nin Abuja. Guests were excited as her name rang in the auditorium - and she was all smiles as she shook hands with President Goodluck Jonathan.\nOn Saturday,\n25\nNovember\n2017\n, Alele-Williams was awarded an honorary doctorate by the University of Benin. The University of Ibadan celebrated Founder's Day on Saturday\n17\nNovember\n2018\n, when the university was\n70\nyears old. On that day six eminent Nigerians were awarded honorary degrees, one of the six being Alele-Williams.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}