{
  "nome_completo": "Gregori Aleksandrovic Margulis",
  "nome_curto": "Gregori Margulis",
  "ano_nascimento": "1946",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Margulis/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": null,
  "biografia": "Gregori Margulis\nwas educated at Moscow High School, graduating in\n1962\n. In that year he began his undergraduate studies at Moscow University and he was awarded his first degree in\n1967\n. Margulis remained at Moscow University for his postgraduate studies.\nHe showed great potential as a mathematician and the first important award which he won was during his time as a postgraduate student when he received the young mathematicians prize from the\nMoscow Mathematical Society\nin\n1968\n. Margulis completed his graduate studies in\n1970\nand he was awarded the degree of Candidate of Science for a thesis\nOn some problems in the theory of U-systems\n.\nAfter being awarded the Candidate of Science degree\n(\nthe equivalent of a British or American Ph.D.\n)\n, Margulis began to work in the Institute for Problems in Information Transmission. He was a Junior scientific worker there from\n1970\nto\n1974\nwhen he was promoted to Senior scientific worker. He held this post until\n1986\nwhen he was promoted again, this time to Leading scientific worker.\nInternational honour was given to Margulis in\n1978\nwhen he was awarded a\nFields Medal\nat the International Congress at Helsinki. However it was not a happy occasion for Margulis who was not permitted by the Soviet authorities to travel to Helsinki to receive the Medal.\nTits\n, delivering the address\n[\n7\n]\nspoke of his sadness that Margulis could not be present:-\n... I cannot but express my deep disappointment - no doubt shared by many people here - in the absence of Margulis from this ceremony. In view of the symbolic meaning of this city of Helsinki, I had indeed grounds to hope that I would have a chance at last to meet a mathematician whom I know only through his work and for whom I have the greatest respect and admiration.\nPerhaps\nTits\n's comment about 'symbolic meaning' should be explained. He delivered the address in the Finlandia Hall in Helsinki where Margulis should have received the Medal and where the Helsinki Accords had been signed on\n1\nAugust\n1975\n. This major agreement was signed at the end of the first Conference on Security and Cooperation in Europe. The Helsinki Accords, signed by all the countries of Europe\n(\nexcluding Albania\n)\nand by the United States and Canada, were designed to reduce the cold war tension by accepting the European boundaries as they then were.\nTits\ntalks in\n[\n7\n]\nabout the range of Margulis's work in combinatorics,\ndifferential geometry\n,\nergodic theory\n,\ndynamical systems\nand discrete\nsubgroups\nof\nLie groups\n. The award of the Fields Medal was mainly for his work on this latter topic:-\nAlready\nPoincaré\nwondered about the possibility of describing all discrete subgroups of finite covolume in a Lie group G. The profusion of such subgroups in\nG\n=\nP\nS\nL\n2\n(\nR\n)\nG = PSL_{2}(\\mathbb{R})\nG\n=\nP\nS\nL\n2\n​\n(\nR\n)\nmakes one at first doubt of any such possibility. However,\nP\nS\nL\n2\n(\nR\n)\nPSL_{2}(\\mathbb{R})\nP\nS\nL\n2\n​\n(\nR\n)\nwas for a long time the only simple Lie group which was known to contain non-arithmetic discrete subgroups of finite covolume, and further examples discovered in\n1965\nby Makarov and Vinberg involved only few other Lie groups, thus adding credit to conjectures of\nSelberg\nand Pyatetski-Shapiro to the effect that \"for most semisimple Lie groups\" discrete subgroups of finite covolume are necessarily arithmetic. Margulis's most spectacular achievement has been the complete solution of that problem and, in particular, the proof of the conjecture in question.\nMargulis was soon able to leave the Soviet bloc and, in\n1979\n, he was able to spend three months at the University of Bonn. Between\n1988\nand\n1991\nMargulis made a number of visits to the\nMax Planck\nInstitute in Bonn, to the Institut des Hautes Études and to the Collège de France, to Harvard and to the Institute for Advanced study in Princeton. From\n1991\nhe has held a chair at Yale University.\nThe\nOppenheim\nconjecture was made in\n1929\nand concerns values of indefinite irrational\nquadratic forms\nat integer points. Early work was based on results of\nJarnik\nand\nWalfisz\n. In the\n1940\ns\nDavenport\nand\nHeilbronn\ncontributed by proving special cases and in\n1946\nWatson\nextended their results showing the conjecture to be true for further special cases. Margulis proved the full conjecture in\n1986\nand gives a beautiful survey of the work leading to this solution in\n[\n3\n]\n. There Margulis explains that:-\nThe different approaches to this and related conjectures\n(\nand theorems\n)\ninvolve\nanalytic number theory\n, the theory of Lie groups and algebraic groups, ergodic theory,\nrepresentation theory\n, reduction theory, geometry of numbers and some other topics.\nMargulis has received many honours for his work. In addition to the Fields Medal he has been awarded the Medal of the Collège de France\n(1991)\nand in the same year he was elected an honorary member of the\nAmerican Academy of Arts and Science\n. In\n1995\nhe received the Humboldt Prize and in\n1996\nhe was honoured by election as a member of the Tata Institute of fundamental research.\nMargulis has also been awarded the\nLobachevsky\nInternational Prize of the\nRussian Academy of Sciences\nand has been elected to the United States\nNational Academy of Sciences\n. In\n2005\nhe was awarded the Wolf Prize for Mathematics:-\n... for his  monumental contributions to algebra, in particular to the theory of lattices in semi-simple Lie groups, and striking applications of this to ergodic theory, representation theory, number theory, combinatorics and\nmeasure theory\n.\nAn article in the May\n2005\npart of the\nNotices\nof the\nAmerican Mathematical Society\nexplains the work which led to the award:-\nAt the centre of the work of Gregory Margulis lies his proof of the Selberg-Piatetskii-Shapiro Conjecture, affirming that lattices in higher rank Lie groups are arithmetic, a question whose origins date back to Poincaré. This was achieved by a remarkable tour de force, in which probabilistic ideas revolving around a noncommutative version of the ergodic theorem were combined with p-adic analysis and with algebraic geometric ideas showing that \"rigidity\" phenomena, earlier established by Margulis and others, could be formulated in such a way\n(\n\"super-rigidity\"\n)\nas to imply arithmeticity. This work displays stunning technical virtuosity and originality, with both algebraic and analytic methods. The work has subsequently reshaped the ergodic theory of general group actions on manifolds.\nIn a second tour de force, Margulis solved the\n1929\nOppenheim\nConjecture, stating that the set of values at integer points of an indefinite irrational nondegenerate quadratic form in more than three variables is dense in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n. This had been reduced\n(\nby Rhagunathan\n)\nto a conjecture about unipotent flows on homogeneous spaces, proved by Margulis. This method transformed to this ergodic setting a family of questions till then investigated only in analytic number theory.\nA third dramatic breakthrough came when Margulis showed that Kazhdan's \"Property T\"\n(\nknown to hold for rigid lattices\n)\ncould be used in a single arithmetic lattice construction to solve two apparently unrelated problems. One was the solution to a problem posed by Rusiewicz, about finitely additive measures on spheres and Euclidean spaces. The other was the first explicit construction of infinite families of expander graphs of bounded degree, a problem of practical application in the design of efficient communication networks. Margulis's work is characterized by extraordinary depth, technical power, creative synthesis of ideas and methods from different areas of mathematics, and a grand architectural unity of its final form. Though his work addresses deep unsolved problems, his solutions are housed in new conceptual and methodological frameworks of broad and enduring application. He is one of the mathematical giants of the last half century.\nIn\n2008\nthe\nPure and Applied Mathematics Quarterly\nproduced a Special Issue in honour of Margulis. The Introduction states:-\nGregory Margulis is a mathematician of great depth and originality. Besides his celebrated results on super-rigidity and arithmeticity of irreducible lattices of higher rank semisimple Lie groups, and the solution of the\nOppenheim\nconjecture on values of irrational indefinite quadratic forms at integral points, he has also initiated many other directions of research and solved a variety of famous open problems.\nFinally we end this biography by quoting from\nTits\n[\n7\n]\n:-\nMargulis has completely or almost completely solved a number of important problems in the theory of discrete subgroups of Lie groups, problems whose roots lie deep in the past and whose relevance goes far beyond that theory itself. It is not exaggerated to say that, on several occasions, he has bewildered the experts by solving questions which appeared to be completely out of reach at the time. He managed that through his mastery of a great variety of techniques used with extraordinary resources of skill and ingenuity. The new and most powerful methods he has invented have already had other important applications besides those for which they were created and, considering their generality, I have no doubt that they will have many more in the future.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}