{
  "nome_completo": "Griffith Davies",
  "nome_curto": "Griffith Davies",
  "ano_nascimento": "1788",
  "ano_morte": "1855",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davies_Griffith/",
  "lugar_nascimento": "Llandwrog, Caernarvonshire (now Gwynedd), Wales",
  "lugar_morte": "Islington, London, England",
  "biografia": "Griffith Davies\nwas the son of Owen Dafydd\n(1761\n-\n1854)\nand Mary Williams\n(1762\n-\n1837)\n. We note that Griffith Davies is the English form of his name but he was known by the Welsh form\nGruffyd Dafydd\nfor the first part of his life in Wales. Only when he reached London at the age of twenty did he become known as Griffith Davies\n.\nOwen Dafydd was a farmer who also worked at a slate quarry and he married Mary Williams on\n9\nJune\n1786\nat Llandwrog, Caernarvonshire. Owen and Mary Davies had seven children, four sons and three daughters. Their first child William Owen was born at Llandwrog in\n1787\n. Their second child was on the way when Owen Dafydd's brother Gryffydd Dafydd died and, out of respect for his memory, they called their second child Gryffydd Dafydd; he is the subject of this biography. The other five children were John Davies, Ann Davies, David Owen, Margaret Davies and Catherine Davies. Note that the mix of Owen and Davies as surnames is due to the Welsh patronymic naming system still being sometimes used at this time. Griffith was a frail child who had been baptised on the day he was born for fear he might not live.\nThe family spoke Welsh; Owen Dafydd, however, had never learnt to read but his wife Mary could read Welsh. There were no schools in the parish of Llandwrog, nor in the adjacent parishes, but some education was provided by the church with Sunday schools. Learning to read was considered by some to not be proper on a Sunday so William Evans, a slate quarry worker and husband of Mary's sister, who taught at the Sunday school of Brynrodyn Chapel, Llandwrog, was highly criticised. Griffith, however, was always grateful to William Evans for teaching him to read Welsh and also to write a little Welsh. This Griffith only achieved with difficulty since he was a delicate child with very poor health.\nWhen he was seven years old, Griffith began to learn English. This came about through a piece of good fortune. Griffith had an aunt who was in service at a house where the school master boarded. He ran a newly opened English school in an adjacent parish and one day he asked Griffith to run an errand for him. Rewarding Griffith with a penny, he told him to buy a book and attend his school. This delighted Griffith who was happy to walk two miles to the school each day over rugged ground. He attended this school for around eighteen months, learning to read a little English in this time. With all his friends and relations only being Welsh speakers, he had little chance to progress further with English. When he was about nine year old, his parents thought he was able to help with farming so he stopped attending school and worked for his father.\nWhen Griffith was twelve he began attending an English school which had opened in Llandwrog. This only lasted for six months for poor harvests in\n1800\nand\n1801\nled to much poverty and his parents needed their son to bring in an income to support himself. He worked for a relative on a neighbouring farm tending horses, ploughing fields and working with manure. When he was fourteen, he got a job at the slate quarries. He was now paid a man's wage and could support himself and also have enough to be able to save a little. By the time he was seventeen, he had saved enough to be able to fund himself attending an English day-school in Carnarvon run by Evan Richardson and there he learnt arithmetic for the first time. His saving only allowed him to spend three months at the school before he had to return to work at the quarry but in this three months he had gained expertise in arithmetic and made progress in spelling, reading and writing although he had still never studied even the basic principles of grammar.\nBack at work in the quarry, he spent all his free time doing arithmetical calculations scratching the numbers onto the slates. He quickly became skilled and he was employed doing wages calculations. Chambers writes\n[\n3\n]\n:-\nIt is worth noting that, on one occasion, he slipped in the quarry and only just regained his footing. This and an attack of typhus made him extremely religious, and conscious of the after-life.\nSeeing that those who had learnt English where able to gain better jobs than manual labour, decided that he should plan to go to England and look for work. His idea at this stage was to improve his English skills in England, then return to Wales. He worked hard at the quarry and saved all he could. In September\n1809\n, at the age of twenty, he sailed from Carnarvon to London, arriving on\n15\nSeptember. He had with him letters of introduction but he lost them overboard during a rough voyage. He was unprepared for the difficulties of living in London, where Press Gangs were employed to force men into the army or navy\n[\n3\n]\n:-\nTwice he avoided the Press Gang. On the first occasion, the captain of the ship which brought him hid him, and on the second, the proprietor of a tavern warned him.\nHaving no place to stay in London, the captain of the ship he had sailed on allowed him to stay on the ship for a few days while he looked for a job. A neighbour from Wales had asked him to deliver a little money to his nephew at a school at Cambridge Heath, Hackney Road which he did. There he was advised to seek employment as an usher at a school so that he might improve his spoken and written English. He got cheap lodgings and began to visit schools asking if they required an usher. Despite help from schools where he asked for a job, he was unable to find employment and he did not find his attempts to learn grammar a pleasant experience. He decided that manual labour was all he could get and began to look for such work thinking he would soon return to Wales. He was fortunate, however, to receive a letter from a schoolmaster, a Mr Rainalls, asking him to come and see him at his school in Sadlers' Wells. This he did and was offered a job as an arithmetic tutor in January\n1810\n. During the summer vacation, he returned to Wales and did a short spell of military service.\nDavies worked at Rainalls' Academy until the summer of\n1811\n, spending all his free time learning English grammar and mathematics\n[\n2\n]\n:-\nIn his spare time he started calculating the times of the eclipses and exhibiting their mode of occurrence by diagrams.\nHe had performed his duties well, but after working there for eighteen months, his services were no longer required. It was suggested to him by Mr Birt, another schoolmaster, that might open his own school in a property that was available at a low rent. Mr Birt showed his faith in Davies as a teacher by having his own two sons attend the school Davies opened in James Street. In addition to running his own school, he was also employed by Mr Rainalls to give private lessons at the Sadlers' Wells school. Davies wanted to improve his knowledge of mathematics so he joined the\nSpitalfields Mathematical Society\nwhich was, at this time, situated in Crispin Street. It was an exciting time for the Society which was expanding and offering public lectures. Davies made extensive use of the Society's library and found many members keen to help him increase his mathematical expertise. At the\nSpitalfields Mathematical Society\nhe met\nBenjamin Gompertz\nwho proved a useful friend to him.\nIn the summer of\n1812\n, with his own school flourishing, he decided to move to larger premises in Lizard Street, Bartholomew Square in the parish of St Luke. He now felt financially secure so felt that he could now marry and, later in\n1812\n, he married Mary Holbut, the sister of a former pupil he had taught at Rainalls' Academy, Jonas Holbut\n[\n1\n]\n:-\n... soon after that important step, most of the younger members of his school left him on account of the streets, which were new and unpaved, becoming almost impassable, and during the greater part of that winter his prospects were materially clouded. He did his utmost to maintain himself and wife by correcting the press of a Welsh magazine then published; and about this time he also commenced writing his 'Key to Bonnycastle's Trigonometry'.\nGeorge Clement Boase, a bibliographer and antiquary, comments about Davies' wife in\n[\n2\n]\n:-\n... she never murmured at his poverty or want of success; but, on the contrary, devised every possible means to keep up his spirits under their pressure.\nTheir first daughter Sarah was born in October\n1813\nbut she died as a child. Two further daughters died and only the fourth, also called Sarah, born in\n1820\n, survived to adulthood; she married Samuel Drew, a solicitor from Llangefni, in\n1840\n.\nIn\n1814\nDavies published his\nKey\nwhich had the full title\nA Key to Bonnycastle's Trigonometry, plane and spherical, containing Solutions to al the Problems, with references, as they stand in the second Edition of the work; the whole rendered as plain as the subject would admit.\nThe author is given as \"Griffith Davies, Member of the Mathematical Society, London; and Master of the Mathematical Academy, Lizard Street, Bartholomew Square.\" The review\n[\n13\n]\nof the\nKey\nstates:-\nThe importance of the science of Trigonometry renders every attempt to elucidate it, and to facilitate the progress of mathematical students, and object of public utility. Mr\nBonnycastle\n's excellent Treatise on this subject is well-known to Mathematicians; and the usefulness of this Key to it, therefore, will be acknowledged. We lament, however, the omission of the Logarithms in some of the examples, which, though they must necessarily have enlarged the work, would, assuredly, have extended its advantages. The accuracy and industry which Mr Davies has here manifested entitle him to a very considerable share of praise.\nAlthough this book did little to improve Davies' financial position, it did bring his name to the fore as a good mathematician and this led to several private pupils coming to get lessons from him. In fact he had advertised himself on the last page of the book:-\nG Davies embraces the present opportunity to inform his friends and the public, that he continues to instruct youth at his Academy,\n8\nLizard Street, in the different branches of commercial and mathematical education. Grown persons desirous of private tuition in Geometry, Algebra, Trigonometry, Conic Sections, Mechanics, Fluxions, Mensuration, Navigation, of the rudiments of Astronomy and Natural Philosophy, are taught at different hours in separate apartments.\nJohn Crossley\n(1762\n-\n1817)\nwas an assistant to\nNevil Maskelyne\n, the Astronomer Royal at Greenwich, and became President of the\nSpitalfields Mathematical Society\nin\n1800\n. He was still President in\n1814\nwhen he was approached by James John Davies seeking lessons on life assurance. Crossley advised him to ask Griffith Davies for help and, although he knew nothing about life assurance at this time, Davies took him on and began teaching him algebra. While James John Davies was learning to solve equations, Griffith Davies sought out books to learn for himself about life assurance and by the time his pupil had sufficient background in pure mathematics, Davies was ready to teach him about life assurance. He clearly did well, since James John Davies later became an actuary to the Economic Life Office.\nBy\n1816\nDavies had moved to a school in Cannon Street. He was now also teaching some pupils from Merchant Taylors School and a few undergraduates at the University of Cambridge. He advertised himself with the plate on the door of the school which read:-\nGriffith Davies, Teacher of Mathematics, Life Assurance, etc., Reversions Valued.\nHe was now teaching several pupils who wanted to train as actuaries and, in\n1819\n, he thought perhaps he would be better employed as an actuary himself. He sought advice from\nWilliam Morgan\n, the actuary with the Equitable Life Assurance Society, on obtaining a certificate of competence.\nWilliam Morgan\nintroduced him to a number of contacts, including Miss Lousada who composed mathematical problems for the Ladies Diary. Davies applied for a number of positions as an actuary, but was unsuccessful. In\n1821\nhe applied for a post of Consulting Actuary with a new company, the Guardian Assurance Company in Lombard Street. He had already drawn up tables for the Guardian and his wife had pressed him to apply for the post of Consulting Actuary.\nBenjamin Gompertz\n, who was a fellow of the\nRoyal Society\n, also applied for the position but it went to Davies, possibly because of discrimination against\nGompertz\nwho was a Jew. Davies again competed against\nGompertz\nwhen they both applied for the position of actuary with the Reversionary Interest Society and again Davis was appointed.\nDavies was now firmly into actuarial work and, in\n1822\n, he gave up his school. In the following year he was appointed as an actuary with the Guardian Assurance Company. He held this position for over thirty years until his death.\nCharles Babbage\nwas about to publish a book entitled\nA Comparative View of the Various Institutions for the Assurance of Lives\nand, in early\n1825\n, Davies learnt about this. He already had produced various tables which were not published since he was working on producing a more major work. He decided, however, to publish quickly what he had to get in print before\nBabbage\n. In fact\nBabbage\n's book was not published until\n1826\nwhile, in\n1825\n, Davies published\nTables of Life Continencies\n. The full title is\nTables of Life Continencies, containing the Rate of Mortality among the Members of the Equitable Society, and the Values of Life Annuities, Reversions, etc computed therefrom: together with aa more extensive scale of Premiums for Life Assurances, deduced from the Northampton Rate of Mortality\n. The book consists of\n26\nworked examples and\n22\ntables. For more information, see\nTHIS LINK\n.\nDavies was now acknowledged to be a leading actuary and was asked to report on many funds. For example he was paid £\n3000\nfor reporting on the Bombay Military Fund in\n1829\n. After this he was often asked to report on other Indian funds and he took on over twenty of these requests over his career. The Bank of England also sought reports from him on various matters.\nIn\n1831\nDavies was elected a fellow of the\nRoyal Society\nhaving been proposed by, among others,\nWilliam Morgan\nand\nBenjamin Gompertz\nwith the following citation:-\nGriffith Davies, Esq of Palmer Terrace Islington a Gentleman well versed in the Mathematical Sciences and author of esteemed works on mathematical investigations and also well acquainted with various subjects of natural knowledge being desirous of the honour of being admitted a Fellow of the\nRoyal Society\nwe of our personal knowledge do recommend him as worthy of being elected a fellow thereof.\nIn\n1833\nhe was elected as an honorary member of the\nSociété Française de Statistique Universelle\n. This Society had been founded in Paris in\n1829\nand existed until\n1860\nwhen it became part of the\nSociété de Statistique de Paris\n.\nDavies' wife Mary died in\n1836\nwhen their daughter Sarah was sixteen years old. Sarah wrote\n(\nsee for example\n[\n3\n]\n)\n:-\nHe was accustomed to go for walks with his daughter, studying the Life of the late Thomas Charles of Bala which he assisted her to translate verbally from Welsh to English. This they found a pleasant occupation in their retired rural walks. It may be mentioned that he himself had taught her to read Welsh when she was about\n14\nyears of age.\nDavies' mother died in\n1837\nand, although he had always intended to return to work in Wales, he now decided that he would continue to work in England for the rest of his career. In February\n1841\nhe married Mary Glynne, a widow with three sons, one of whom was Evan Owen Glynne\n(\nborn\n1824)\nof the Legal and General Life Office. Griffith and Mary had one son, also named Griffith Davies\n(1841\n-\n1927)\n, who went on to work for the Alliance Office. By this time Davies was very well off which was fortunate since as well as his new wife he was supporting her sons, his father and his first mother-in-law.\nIn July\n1848\nthe Institute of Actuaries was founded\n[\n3\n]\n:-\nIt was thought that\n[\nDavies\n]\nshould be the first president and whilst he was away in Wales the formal proposal was made, which he accepted. However he learnt that there had been some unpleasantness in the preliminary meetings held in his absence. Further, his health was not good and so he withdrew his acceptance. It is probable that, because of this unpleasantness, he chose not to become a member of the Actuaries Club on its foundation. However, when the Institute had come into being, he was presented on\n29\nJanuary\n1849\nwith a testimonial describing him as 'the father of the present race of actuaries'. He was, in fact, the first member to be enrolled and pay his contribution, and in the early days of the Certificates of Competency served on the Committee which drew up a syllabus and acted as examiner.\nWe see from this quote that Davies' health was poor in\n1848\n. In fact his poor health began in the winter of\n1847\n-\n48\n[\n1\n]\n:-\nIn the winter of\n1847\nMr Davies was afflicted with a severe influenza, which fixed on his lungs a chronic bronchitis, from which he suffered during the remainder of his days. In February,\n1853\n, he had another severe attack of bronchitis, which confined him to his room for several weeks together, but which he gradually recovered from for a time.\nIn\n1854\nDavies' father Owen died, aged\n93\n, and later that year, on\n5\nDecember, Davies had a stroke. He survived for a further three months, suffering greatly, and died on\n21\nMarch\n1855\n[\n1\n]\n:-\nThus ended a career which will be ever memorable as connected with the mathematics of life assurance, and which affords another remarkable instance of the successful pursuit of knowledge under difficulties and disadvantages of no ordinary description.\nHe was buried in Abney Park cemetery in Stoke Newington, London. We should explain why his burial was in Abney Park. The cemetery had been created in\n1832\n, one of seven cemeteries created because the inner London cemeteries could no longer cope with the increasing population. It was in the grounds of Abney House, which had been the home of renowned non-conformist and hymn writer Isaac Watts. It became the cemetery for Dissenters, Protestant Christians who were not members of the Church of England. Davies was deeply religious and for many years had attended a chapel in Jewin Street for Welsh Calvinistic Methodists, a body of Dissenters, where the services were conducted in Welsh. In the last few years of his life Davies had only left his house to either attend Jewin Chapel or his office. It was natural, therefore, that he be buried in a cemetery for Dissenters.\nLet us end this biography by quoting Davies' observations on the importance of Societies charging the correct amount for their assurance premiums\n(\nquoted in\n[\n11\n]\n)\n:-\nThe evil of charging excessive premiums cannot, however, long remain in a country where capital is allowed to flow freely from one channel to another, as the natural effects of competition must necessarily reduce the profits on Life Assurance to the level of that derived from other species of investments; on the contrary, the peculiar nature of the subject renders it extremely dangerous lest the rates for Life Assurance should be so far reduced as to diminish the security of those who may select this mode of accumulating their savings for the benefit of their families; for if the premiums charged by societies established for these purposes should, by excessive competition, be rendered inadequate to the payments of the claims which, sooner or later, must come upon them, whatever honour, wealth, or probity, the present managers of them may possess - whatever capitals they may boast of - or however prosperous they may appear to go on, even for a considerable time, the result must ultimately terminate in litigation, disappointment and ruin, and instead of a national benefit, Life Assurance in such a case would inevitably become a national calamity.",
  "math_areas": []
}