{
  "nome_completo": "Guido Ascoli",
  "nome_curto": "Guido Ascoli",
  "ano_nascimento": "1887",
  "ano_morte": "1957",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ascoli/",
  "lugar_nascimento": "Livorno, Italy",
  "lugar_morte": "Turin, Italy",
  "biografia": "Guido Ascoli\nwas born in Livorno into a Jewish family. His father was Giulio Ascoli and his mother was Rosa Costa. He attended school in Livorno, his secondary education being first at the technical school from where he went on to study mathematics and physics at the Technical Institute. He then studied at the University of Pisa, beginning his studies at the age of fifteen in\n1903\n. At first he took civil engineering courses, intending to read for a degree in this subject but after three years of study he concentrated solely on pure mathematics courses. These courses were taught by a number of outstanding mathematicians including\nEugenio Bertini\nand\nLuigi Bianchi\n. He was most influenced by\nBianchi\nand wrote the thesis for his laurea under\nBianchi\n's supervision. Ascoli's thesis,\nSulla moltiplicazione delle singolarità delle funzioni analitiche\nⓉ\n(\nOn the propagation of singularities of analytic functions\n)\n, studied singularities of analytic functions and he was awarded his laurea on\n5\nJuly\n1907\n. After graduating, he remained at Pisa for a short while having won a postgraduate scholarship for the year\n1907\n-\n08\n. However, because of family problems, he returned to Livorno and was not able to continue with his intended academic career in universities. Because it was necessary for him to earn money to support his family he began working in industry, working on electrical conductors, but his health was poor, so Ascoli was forced to give this up and to consider a career as a secondary school teacher.\nIn November\n1909\nAscoli was appointed as a temporary mathematics teacher at the Technical Institute in Spoleto. He remained there for two years and during this time he won three competitions, one for a position in Spoleto and the others for teaching in state schools and technical institutes, and one for teaching in nautical institutes. After a very brief spell at Genoa, he moved to the Technical Institute in Cagliari where he taught for the two years\n1911\n-\n1913\n. He was totally committed to secondary school education at this stage in his career and he wrote a school book\nComplementi di Geometria per gli Istituti Tecnici\nⓉ\n(\nSupplements on geometry for Technical Institutes\n)\nwhich was published in\n1913\n. His next appointment was at the Technical Institute in Caserta where he again spent two years\n(1913\n-\n15)\nbefore moving to Florence where he taught at the Technical Institute during the academic year\n1915\n-\n16\n.\nOf course in\n1914\n, when Ascoli was teaching in Caserta, World War I broke out but, shortly after hostilities began on\n3\nAugust, Italy declared that it would not commit troops to the fighting. This was despite having an alliance with Germany and Austria-Hungary. Italy revoked this alliance on\n3\nMay\n1915\nand later that month declared war on Austria-Hungary. Ascoli had not had to undergo military service after completing his degree since his health was not good enough. However, now that Italy was at war the rules were different and, in May\n1916\n, he was mobilised and underwent training. He was sent to the front as a soldier in March\n1917\nas an officer in the\n44\nth\nField Artillery Regiment. On\n7\nMay\n1918\nhe was hit by the fragment of an exploding shell and wounded. For his bravery during the war he was awarded the Military Cross. After demobilization, Ascoli returned to teaching in\n1919\n. His first position was at the Technical Institute of Parma where he remained until\n1920\n. In that year he moved to Turin, taking up a teaching appointment there at the Technical Institute.\nThe Fascist movement started in Italy around\n1921\nas a nationalist movement following on from the Italian irredentism movement. Led by Benito Mussolini, the Fascists came to power in\n1923\nbut at this stage they did not adopt racial policies. One of the first acts of the Fascist government was a reform of Italian education by Giovanni Gentile, Mussolini's Minister of Education. One of the consequences of the Gentile reform was the setting up of the Liceo Scientifico, a secondary school intended to give students the necessary skills to go on to a university education. Ascoli was appointed to the Liceo Scientifico in Turin after it was set up in March\n1924\nby joining the Liceo Moderno with the mathematics and physics sections of the Technical Institute in which he was working. He published another school book in\n1924\n, namely\nLezioni elementari di analisi matematica ad uso dei licei scientifici\nⓉ\n(\nElementary calculus lessons for use by high school science\n)\n. In this textbook\n[\n4\n]\n:-\n... Ascoli does not limit himself to dryly following the guidelines for university courses, but attempts to \"discern in the admirable edifice of concepts and results that small bit that is essential in the very first study from what would otherwise be destined to remain a lifeless and inexpressive knowledge; to present to young people a simple and harmonic organism of fundamental ideas that contribute effectively towards their intellectual formation\"\n(\nPreface\n)\n. This is the reason why he introduces the concept of the integral before that of the derivative, because it is simpler and more intuitive when the point of departure is the calculation of areas.\nHowever, his life was about to change as\nFrancesco Tricomi\npoints out in\n[\n10\n]\n:-\nComing to Turin - where, in\n1925\n, he also married - was undoubtedly a decisive event in the life and career of Ascoli. Indeed, at that time his activity was not - as can be seen in the dozen works published up to that time - significantly different from what one would expect of good teacher, of an excellent middle school teacher. However, in\n1926\n, on the threshold of becoming forty years old, there was an abrupt change that seems to justify the title of a famous book: \"Life begins at forty\".\nAscoli married Mauriziana Sossi on\n12\nSeptember\n1925\n; they had two children. Renato Ascoli was born in Turin on\n6\nJune\n1927\nand went on to be a physicist working at the University of Pisa. He died on\n31\nJuly\n2007\n. Their daughter, Gigliola Ascoli born on\n15\nApril\n1932\nin Turin, went on to study literature and was awarded a laurea in that subject. The lively mathematical environment in Turin provided a powerful incentive to Ascoli to resume research in analysis and also, around\n1925\n, his health markedly improved. Between\n1926\nand\n1930\nhe published twelve important works on partial differential equations: these include\nSul problema di Dirichlet nei campi sferici e ipersferici\nⓉ\n(\nOn the Dirichlet problem in  ball  and hyperball fields\n)\n(1927)\n;\nSulle singolarità isolate delle funzioni armoniche\nⓉ\n(\nOn isolated singularities of harmonic functions\n)\n(1928)\n;\nSull'unicità della soluzione nel problema di Dirichlet\nⓉ\n(\nOn the uniqueness of the solution of the Dirichlet problem\n)\n(1928)\n; and\nSull'equazione di Laplace dello spazio iperbolico\nⓉ\n(\nThe Laplace equation of hyperbolic space\n)\n(1929)\n. The quality of his work was extremely high and when he entered a competition for the chair of algebraic analysis at the University of Cagliari in\n1930\n, although he failed to gain the appointment, he was encouraged by being ranked third. He was appointed to the chair of analysis at the University of Pisa in\n1932\n. Two years later, in\n1934\n, he left Pisa and moved to Milan when he was appointed to a chair there. However, his university career, begun so late in life, was interrupted in July\n1938\nby the Manifesto della razza\n(\nManifesto of Race\n)\npassed by the Fascist Italian Government against those of Jewish background. This stripped Jews of Italian citizenship and banned them from positions in banking, government, and education. Article\n4\nof the Royal Decree Law of\n5\nSeptember\n1938\nwas titled 'Measures for the defence of race in fascist schools' and, after Ascoli had been identified as Jewish by the University of Milan, he was expelled from the University. After leaving the University, Ascoli retired with his family to live first in Turin and, after\n8\nSeptember\n1943\nwhen the Italian armistice with the Allies was made public, in the commune of Dusino San Michele in the Province of Asti in Piedmont. There he scraped a living by giving private lessons and undertaking work from the Jewish community in Milan. He wrote to\nMauro Picone\non\n23\nDecember\n1941\nexplaining his predicament\n[\n2\n]\n:-\nAs for me, in October I was upset by being given a lot of work that I had never expected, to which was added in November, private tutoring of superior character that was offered to me by the Jewish Community in Milan and for which I went there three times a week, with much loss of time; my occupation for the rest of the time is not unpleasant and so I gave my consent to it from September. On the other hand there are times when each of my skills is put to good use.\nPicone\ntried to help Ascoli, encouraging him not to give up research.\nPicone\nwas the director of the Institute for the Applications of Computation in Rome and he was able to arrange to give Ascoli some paid work. This, however, was not an  easy thing to do since it had to be done in such a way that the Fascist police did not learn what was happening.  After the war ended, Ascoli returned to Milan and wrote to\nPicone\non\n18\nOctober\n1945\nexpressing his gratitude for the support he had received during the years when he had been dismissed by the Fascist laws:-\nIn those times, when so many relationships were inevitably lost or destroyed, your constant remembrance and your faithful friendship, which remained faithful even in the worst of times - and I want to proclaim this at every opportunity, to honour your courage and your right-mindedness - were a great comfort to me. Many times in recent years, putting pressure on my natural optimism, there has been created in me a great contempt for men, and especially those of high standing and ingenuity who should also be an example of honesty and character. The participation in the purge of the University of Milan, put me in contact with so many small and large acts of cowardice - it was the final blow for me. To be able to find among the ex-fascist university a good person, who after the end of fascism, has only served to put in place a good and beautiful idea that has done and is doing great honour to Italy, outside and above that of sectarianism, is a real consolation.\nBack at the University of Milan in\n1945\n, Ascoli remained there until\n1948\n. During this period, he published papers such as:\nSopra un'equazione funzionale\nⓉ\n(\nOn the functional equation\n)\n(1945)\n;\nNuclei isotropi e loro autofunzioni\nⓉ\n(\nIsotropic nuclei and their eigenfunctions\n)\n(1946)\n;\nSopra un'estensione dell'equazione di Whittaker per le funzioni di Mathieu\nⓉ\n(\nOn Whittaker equation extensions for Mathieu functions\n)\n(1946)\n; and\nSopra una valutazione asintotica che si presenta nella teoria probabilistica dei contatori di corpuscoli\nⓉ\n(\nOn an asymptotic evaluation that is presented in the probabilistic theory of counting corpuscles\n)\n(1947)\n. In the autumn of\n1948\n, he returned to Turin where he had been inspired to undertake research, this time to a chair at the University of Turin. He held this chair, where his work mainly involved training secondary school teachers, for the remainder of his career. He created a post-graduate\n[\n4\n]\n:-\n... professional development course aimed at new graduates who had to participate in the competitions for teaching positions in secondary schools. The course lasted three hours a week and comprised lessons in mathematics aimed at completing or refreshing the basic preparation and to accustoming future teachers to look at elementary mathematics from an advanced standpoint, as well as to take into consideration the history of mathematics; these lessons were flanked by exercises and discussion on the topics that would be addressed in the competitions. These activities of Ascoli came together in the book 'Lezioni di Matematiche complementari'\nⓉ\n(\nLessons on compementary mathematics\n)\n(1952\n, second edition\n1954)\nand in the volumes on the topics assigned in the course on mathematical culture for new graduates, 'Svolgimento dei temi assegnati nel corso di cultura matematica dell'Università di Torino'\nⓉ\n(\nProceedings of the themes assigned in the course of mathematical culture of the University of Turin\n)\n(1953\n,\n1955\n,\n1957)\n.\nHe also taught courses on Higher Analysis in academic years\n1948\n-\n49\nto\n1950\n-\n51\nand then courses on the Theory of Functions from\n1951\n-\n52\nto\n1954\n-\n55\n. His student Giovanni Zin wrote of him\n[\n13\n]\n:-\nOn the one hand he was always attentive to the latest developments in analysis while, on the other hand, he had his roots in the classic treatment of the great masters, and found nourishment in the history of mathematics, in logic, and in methodology. He considered the great problems of science, that is, what is the place and the value of mathematics in general, and of analysis in particular.\nAscoli received many honours for his contributions. In\n1935\nhe received an award from the Scuola Normale of Pisa for his monograph\nEquazioni a derivate parziali dei tipi ellittico e parabolico\nⓉ\n(\nPartial differential equations of elliptic and parabolic types\n)\n. He was elected a corresponding member of the\nAccademia dei Lincei\nin\n1947\n, in\n1950\nhe became president of the Turin Section of Mathesis, he was elected a member of the\nAccademia delle Scienze di Torino\nin\n1952\nand a member of the Istituto Lombardo di Scienze e Lettere di Milano in\n1953\n. Also in\n1953\nhe became a member of the International Commission on Mathematical Instruction and in\n1955\nhe was president of the Italian Commission for Mathematics Teaching. This Commission began to function on\n17\nApril\n1955\nwhen the first official meeting was held in Bologna with Ascoli as president and he continued to serve as president until the meeting in Turin on\n24\nApril\n1957\n. He died a couple of weeks after this meeting.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}