{
  "nome_completo": "Camille Guillaume Bigourdan",
  "nome_curto": "Guillaume Bigourdan",
  "ano_nascimento": "1851",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bigourdan/",
  "lugar_nascimento": "Sistels, Tarn-et-Garonne, France",
  "lugar_morte": "Paris, France",
  "biografia": "The French astronomer and mathematician\nGuillaume Bigourdan\n, nicknamed the \"Benedictine of Astronomy\", was born in Sistels, France, on\n6\nApril\n1851\nto peasant parents Pierre Bigourdan and Jeanne Carrère. The family name 'Bigourdan' shows that the family were originally from Bigorre. Guillaume's younger sister Marguerite was born in\n1853\nand his brother Sylvestre in\n1857\n. He began his education at the village school when seven years old but at the same time he worked in the fields. Both his teachers and the local curate noticed that the young boy was highly intelligent so it was arranged that he would attend a boarding school which was a few kilometres from his home.\nHe began attending the private boarding school in Valence d'Agen, but he was very aware that his parents were making considerable sacrifices both in terms of paying for his education and also for not having his assistance in the fields. He began learning Latin and his performance in all his subjects was excellent.\nGraduating from the school in Valence d'Agen he began his studies at the  University of Toulouse obtaining his Bachelor of Science degree from that university in\n1870\n. He received two further degrees: in physics in\n1874\n, and in mathematics in\n1876\n. During this time, he taught at a boarding school to finance his studies.\nHe caught the attention of one of his teachers,\nFélix Tisserand\n, and was appointed by him in\n1877\nto the post of assistant astronomer at the Toulouse Observatory, after he had graduated from the École d'Astronomie in Paris. Here he was put in charge of the meridian instrument.\nTisserand\nwas made Director of the Paris Observatory, bringing Bigourdan to Paris with him in\n1879\n. In Paris, Bigourdan had the opportunity to take charge of the great equatorial telescope. In addition to other work that he was undertaking, he worked on his doctoral thesis which he submitted in\n1886\n. He was awarded the degree for his thesis\nSur l\"équation personnelle dans les mesures d\"étoiles doubles\nⓉ\n(\nOn the personal equation in double star measurements\n)\nin which he studied measurements of\n2800\ndouble stars. It was at the Paris Observatory that he spent many years verifying the positions of\n6380\nnebulae. It was his aim to determine by visual observations the accurate positions of all the known nebulae of the northern hemisphere. He wanted to set a basis for future studies of the 'proper motion' of nebulae. This turned out to be in vain since distant nebulae will not show any proper motion.\nPercy MacMahon\n, in his Gold Medal address\n[\n11\n]\n, explains that Bigourdan:-\n... had before him in\n1884\na mass of catalogues and separate memoirs concerning nebulae. Many of the observations that had been recorded had no pretensions to precision in measurement. Some that were precise according to views held in regard to precision at the time they were made could not be regarded as such at the present day. He gives a list of observations which may be regarded as being more or less precise. ... The list contains about\n150\nnames. He also found that as the observations had been made by telescopes involving a wide range of optical power, it was difficult to compare the objects observed or even broadly to classify them. Further, many of the nebulae had not been re-observed for a great many years, and then only with instruments of small power. He therefore resolved in\n1884\nto observe the whole of the nebulae visible in the latitude of Paris with the equatorial of\n0\n.\n31\nm. aperture installed in the Paris Observatory. ... The Medallist's labours of observation terminated after twenty-five years in\n1909\n, when\n6380\nnebulae had been duly recorded.\nDespite the impossible aim of detecting proper motion, his list of achievements while in Paris is not short. He discovered his only asteroid,\n390\nAlma in\n1894\n; he identified around\n500\nnew objects; his observations were published in\n5\nvolumes of the\nAnnales\nof the Paris Observatory occupying no fewer than\n3000\npages. He also included a history of the discoveries and previous observations of the nebulae he worked on.\nBigourdan was also a participant in expeditions. In June\n1882\n, he took part in the observations of the transit of Venus on the island of Martinique. While away, his brother died of typhoid fever. In the same year, he built a four-roomed house in Tujague. In\n1883\n, he left for St Petersburg, stopping in Kraków in Poland, visited Berlin and Vienna.  He also went to Joal, Senegal in\n1892\nto observe the total eclipse of the Sun which took place on\n16\nApril\n1893\n. A report of the expedition records\n[\n4\n]\n:-\nAside from photographs of the corona with several short cameras, which were successful, the observations were wholly spectroscopic. The spectrum of the corona was photographed as far up in the ultra-violet as the ordinary solar spectrum extends, and at least fifteen new coronal and chromospheric bright lines were detected. The light of the corona consisted of a strong continuous spectrum and bright lines. None of the ordinary solar dark lines were observed.\nOn this same expedition, he made a determination of the value of gravity at Joal. He did this again in\n1896\n, but atop Mont Blanc. Moreover, he travelled to Hellín, Spain in\n1900\nand Tunis, Tunisia in\n1905\nalso to view solar eclipses.\nIn\n1902\n, working with his colleague Henri Renan from the Paris Observatory, and Frank W Dyson\n(1868\n-\n1939)\n, Henry Park Hollis\n(1858\n-\n1939)\nand others from the Greenwich Observatory, he participated in an attempt to re-determine with a greater precision the longitudinal difference between London and Paris. Bigourdan made the first of two series of observations between\n18\nApril\n1902\nand\n29\nJune\n1902\n. Both Greenwich and Paris Observatories used meridian instruments built by the English instrument makers Troughton & Simms. The first task carried out by Bigourdan was to examine the operation of the instruments. He wrote to\nHenri Poincaré\nabout his\n[\n9\n]\n:-\n... study of the influence of the inclination of the axis of rotation of the telescope. This inclination is determined using the level and by observation of the reflected image on a mercury bath\n(\ndetermination of the collimation by reversals on a test pattern, on the mercury bath and on circumpolar stars\n)\n. Bigourdan noticed imperfections in his measuring device. Above all, the level which serves to determine the inclination showed, in the size of its parts, a direct variability with the temperature. Bigourdan therefore studied the behaviour of the level in order to be able to correct the readings made in the longitude operations. He found that the metal mount on the level vial, \"still used quite often, especially abroad,\" was responsible for the dilation.\nFélix Tisserand\n, the Director of the Paris Observatory, died in\n1896\nand Maurice Loewy\n(1833\n-\n1907)\n, was appointed to succeed him as Director. Loewy, born in Vienna, had been an assistant at the Vienna Observatory but, being a Jew, could not advance to a senior position. He had moved to France, working at the Paris Observatory from\n1860\n. When he died on\n15\nOctober\n1907\nthe Observatory began the process of appointing a new Director. The appointment was made by the Minister after receiving advice from the Academy of Sciences and the Council of the Observatory. There were several candidates but the close call came between Bigourdan and\nBenjamin Baillaud\n. Both were members of the\nAcademy of Sciences\nbut Bigourdan was a full member while\nBaillaud\nwas only a corresponding member. Bigourdan had worked at the Paris Observatory for\n28\nyears and regularly attended meetings of the\nAcademy of Sciences\n.\nHenri Poincaré\nconsidered Bigourdan a collaborator and even informed\nBaillaud\nthat he intended to vote for Bigourdan. There was no doubt that Bigourdan had produced the greater amount of research but\nBaillaud\nhad the most experience as an administrator and had achieved great things in this capacity. First one man and then the other appeared to be first choice. Both wrote to the Minister defending themselves from criticism they were receiving. Bigourdan wrote on\n23\nDecember\n1907\nsaying, \"some accuse me of being capable of acts of intolerance\", and defended himself from that accusation. On\n17\nDecember\n1907\nsome newspapers had reported, prematurely, that Bigourdan had almost certainly won but when the official announcement came on\n6\nJanuary\n1908\nit was\nBaillaud\nwho was declared the new Director of the Paris Observatory.\nBigourdan also held a keen interest in the transmission of time signals by wireless. In\n1911\n, France switched from a time zone centred at Paris to one centred at Greenwich, London and Bigourdan helped establish the new time zone. After conferences in Paris in\n1912\nand\n1913\n, the International Time Service was founded, with a bureau in Paris of which Bigourdan was given the directorship. After the First World War, Bigourdan remained director keeping in close touch with\nBenjamin Baillaud\nand General Ferrié, other figureheads in the time-keeping spheres of interest.\nBigourdan was recognised for his work and achievements in the form of titles and awards. He was awarded his first\nLalande\nPrize from the\nAcademy of Sciences\nin\n1883\nfor the work he had done in Martinique, as one of a group of nine, each winning\n540\nfrancs. His second\nLalande\nPrize was awarded solely to him, and was given in\n1891\n. The year\n1895\nsaw him make Knight of the Legion of Honour, becoming an Officer in\n1919\n. He won the Valz Prize, awarded by the French Academy of Sciences, in\n1886\n. The\nRoyal Astronomical Society\ngranted him their Gold Medal in\n1919\n. This year also saw him receive the Prix Jules-Janssen, the highest award of the French Astronomical Society.\nHe was also a member of multiple scientific societies, and held many important roles: he became a member of the Bureau des Longitudes in\n1903\nand worked to enrich their\nAnnuaire\nwith notices of interesting researches in current astronomy, such as determinations of parallax and classification of stellar spectra; also in\n1903\n, he was elected an Associate of the\nRoyal Astronomical Society\n;\n1904\nsaw him become a member of the French\nAcademy of Sciences\n, becoming vice-president in\n1923\n. From its commencement in\n1919\n, Bigourdan served as director of the Bureau International de l'Heure. In\n1924\n, he was made President of the\nAcademy of Sciences\nand the Institute of France.\nBigourdan was responsible for ensuring that various works were published, for example, that of A G Pingré's\nAnnales célestes du dix-septiéme siècle\nⓉ\n(\nCelestial records of the\n17\nth century\n)\n. The manuscript had been completed in\n1791\n, and a start had been made on its publication, continuing slowly until Pingré's death, whereupon it stopped. The manuscript was lost, before being found by Bigourdan at the Paris Observatory under an incorrect title. Under the auspices of the French\nAcademy of Sciences\n, these\nAnnales\nwere printed in\n1901\n. After he retired in\n1928\nfrom the Bureau de l'Heure, he gave, in the\nAnnuaire\n, a history of the Bureau de Longitudes, the fourth part of which was published in\n1932\n, only a short while before his death. This was certainly not his first historical work for he had published\nThe first learned societies of Paris in the seventeenth century: and the origins of the Academy of Science\n(1918)\nand\nHistory of observational astronomy and observatories in France\n(3\nvolumes\n)\n(1918)\n. In fact his publication record is remarkable for, over\n45\nyears, he wrote\n540\narticles which is an average of an article per month.\nBigourdan has been credited with a method for adjusting equatorial mount telescopes. Bigourdan's Method allows the setting up of a telescope mount when one cannot locate the celestial pole and does not know the latitude of the place. Precision is high, but it takes a lot of adjustment time.\nIn February\n1885\n, he married Marie Mélanie Sophie Mouchez, the eldest daughter of Admiral Amédée Mouchez, then the director of the Paris Observatory. Together, they had\n9\nchildren. Up until\n1913\n, the whole Bigourdan family came to Sistels on vacation, even including Mouchez cousins. After this, the outbreak of war and the Parisian environment made his wife and children no longer go to Tujague. They got bored on this old farm, in the countryside; Guillaume Bigourdan, however, came alone every summer to spend a few weeks. During his stays, he worked on cultivating his land, went to see his former classmates and spoke with them only in Occitan\n(\na Romance language spoken in southern France\n)\n, even when he gave lessons in astronomy.\nHe died in Paris in\n1932\nin his apartment at\n6\nrue Cassini, near the Observatory. His funeral was held in the presence of many scientists, but without any government representative; he was buried in the Montparnasse cemetery.",
  "math_areas": []
}