{
  "nome_completo": "Gustav Roch",
  "nome_curto": "Gustav Roch",
  "ano_nascimento": "1839",
  "ano_morte": "1866",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Roch/",
  "lugar_nascimento": "Dresden, Germany",
  "lugar_morte": "Venice, Italy",
  "biografia": "Gustav Roch\n's parents were Gustav Adolf Roch, a kitchen assistant, and Auguste Caroline Büttner. Gustav attended school in Dresden before moving to a school in Neustadt. At this stage mathematics was not his main interest and his father encouraged him to seek a career in chemistry. With this aim in mind he entered the Polytechnic Institute\n(\nTechnische Bildungsanstalt\n)\nin Dresden taking courses to qualify him in chemistry.\nA very important influence on Roch was Oscar\nSchlömilch\nwho taught at the Polytechnic Institute.\nSchlömilch\nreceived his university education at Berlin under\nDirichlet\nand\nSteiner\n. He was a fine mathematician who wrote an excellent analysis textbook which helped the development of rigorous analysis in Germany. He quickly saw that Roch's talents lay in mathematics and its applications to physics, rather than in chemistry, and he soon persuaded Roch to seriously consider changing the main topic that he was studying. This was not a simple matter, for Roch did not have a particularly strong background in either mathematics or physics, so in order to prepare himself for advanced study he took courses at a private institute as well as at the Polytechnic Institute. In fact he was soon producing high quality research and, while still at the Polytechnic Institute, he wrote a paper\nÜber eine Umgestaltung der Ampere'schen Formeln\nⓉ\n(\nOn a transformation of Ampere's formulas\n)\non the mathematical theory of the electricity and magnetism. This paper was published in\n1859\nin\nSchlömilch\n's journal\nSchlömilch's Zeitschrift für Mathematik und Physik\n. This was a fairly new journal which\nSchlömilch\nhad founded three years earlier.\nIn the spring of\n1859\n, the same year as his first paper was published, Roch entered the University of Leipzig. He studied a wide range of courses there but the most important of his teachers in mathematics were\nA F Möbius\n, M W Drobisch and W Scheibner, while he was taught physics by Wilhelm Hankel. However he also took courses on philosophy, botany, philology and history. Roch continued his research on the mathematical theory of electricity and magnetism, publishing four further articles\nÜber magnetische Momente\nⓉ\n(\nOn magnetic moments\n)\n(1859)\n,\nÜber Magnetismus\nⓉ\n(\nOn magnetism\n)\n(1859)\n,\nBemerkung zur Theorie der electrischen Ströme\nⓉ\n(\nRemarks to the theory of the electrical currents\n)\n(1860)\n, and\nÜber Magnetismus\nⓉ\n(\nOn magnetism\n)\n(1861)\n, all of which appeared in\nSchlömilch's Zeitschrift\n. His outstanding progress as a student at Leipzig led to him being awarded the Kregel-Sternbach scholarship to continue his studies at Göttingen and Berlin.\nOn\n13\nApril\n1861\nRoch entered the University of Göttingen. He spent three terms there studying under Wilhelm\nWeber\n, but also attending lectures by a number of top mathematicians the most important being\nRiemann\n. Following his time in Göttingen, Roch went to Berlin where he made contact with\nL Kronecker\n,\nE E Kummer\n,\nK  Weierstrass\nand\nK W  Borchardt\n. Roch was awarded a Master's Degree by the University of Leipzig in\n1862\nand later that year, on\n28\nMay, he was awarded his doctorate for his thesis\nÜber die Darstellung von Functionen dreier Variablen durch Potentialausdrücke\n...\nⓉ\n(\nOn the representation of functions of three variables by potential expressions ...\n)\nHis thesis advisors had been Moritz Drobisch and Wilhelm Hankel. After the award of his doctorate, he continued to work at Leipzig during\n1863\n.\nRoch submitted his\nhabilitation\nthesis\nDe theoremate quodam circa functiones Abelianas\nⓉ\n(\nThe theory of Abelian functions\n)\nto the University of Halle on\n13\nOctober\n1863\n. His habilitation thesis advisor was Eduard\nHeine\n. He became a\nprivatdozent\nat Halle and, in the following year, he submitted his most famous paper\nÜber die Anzahl der willkürlichen Constanten in algebraischen Functionen\nⓉ\n(\nOn the number of arbitrary constants in algebraic functions\n)\nto\nCrelle's Journal\n. It appear in print in the following year and contains the theorem now known as the\nRiemann\n-Roch theorem. It was not the first of Roch's papers to appear in\nCrelle's Journal\nfor he had published\nÜber eine Transformation des Potentials\nⓉ\n(\nOn a transformation of  potentials\n)\nin it in\n1864\n. Several other papers by Roch such as\nÜber Functionen complexer Grössen\nⓉ\n(\nOn the size of complex functions\n)\n(1863)\n,\nFunctionen complexer Grössen\nⓉ\n(\nThe size of complex functions\n)\n(1865)\n, and\nÜber die Ausdrücke elliptischer Integrale zweiter und dritter Gattung durch Theta-Functionen\nⓉ\n(\nOn the terms of elliptic integrals, second and third class by theta functions\n)\n(1865)\nhad appeared in\nSchlömilch's Zeitschrift für Mathematik und Physik\n.\nAs presented by Roch, the\nRiemann\n-Roch theorem related the topological genus of a\nRiemann\nsurface to purely algebraic properties of the surface. The\nRiemann\n-Roch theorem was so named by\nMax Noether\nand\nAlexander von Brill\nin a paper they jointly wrote\n1874\nwhen they refined the information obtained from the theorem. It was extended to algebraic curves in\n1929\nand then in the\n1950\ns an\nn\nn\nn\n-dimensional version, the\nHirzebruch\n-\nRiemann\n-Roch theorem, was proved by\nHirzebruch\nand a version for a morphism between two varieties, the\nGrothendieck\n-\nRiemann\n-Roch theorem, was proved by\nGrothendieck\n.\nOver the three academic years\n1863\n-\n64\n,\n1864\n-\n65\nand\n1865\n-\n66\nRoch gave a number of courses at Halle. These included: Differential and Integral Calculus; Analytic Geometry; and Elliptic and Abelian Functions. Up to this time Roch was still a privatdozent at Halle but in the spring of\n1866\nthe University began to take up referees' reports with a view to appointing him as an extraordinary professor.\nHeine\nwrote a strong letter of support and Roch was appointed extraordinary professor at the University of Halle-Wittenberg on\n21\nAugust.\nHowever Roch's health was failing and on\n13\nOctober he was granted leave for the winter semester of\n1866\n-\n67\nto allow him to regain his health. Roch went to Venice where he hoped the warmer weather would aid his recovery. Sadly, however, it was not to be and he died of consumption in Venice in November at the age of\n26\nyears. Roch's name will live on through the fundamental\nRiemann\n-Roch theorem, but it is a tragedy that the young man with so much mathematical promise died when he had only just commenced his career.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}