{
  "nome_completo": "Gustav de Vries",
  "nome_curto": "Gustav de Vries",
  "ano_nascimento": "1866",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Vries/",
  "lugar_nascimento": "Amsterdam, The Netherlands",
  "lugar_morte": "Haarlem, The Netherlands",
  "biografia": "Gustav de Vries\n's name is well known to mathematicians because of the work of his doctoral dissertation which contained the\nKorteweg\n-de Vries equation. However, few know anything else about de Vries. We begin by giving some details about his family.\nGustav was the son of Rubertus Jan de Vries\n(1821\n-\n1909)\n, an Amsterdam bookseller, and Henriette Auguste Frantzen\n(1826\n-\n1886)\n. Rubertus and Henriette de Vries were married in\n1857\n. They had seven children. Jan de Vries\n(1858\n-\n1928)\n, the eldest child, studied mathematics and was awarded his doctorate in\n1881\nby the University of Amsterdam for his thesis Bolsystemen. He was a classical geometer who, after teaching at secondary school level in Kampen and Haarlem, taught at a technical college in Delft. He was professor of geometry at the University of Utrecht from\n1897\nto\n1928\n. The other children of Rubertus and Henriette de Vries were: Auguste Pauline de Vries\n(1859\n-\n1863)\n; Atje Trijntje Petronella Johanna de Vries\n(1861\n-\n1919)\n; Johann Peter August de Vries\n(1863\n-?\n)\n, who became Secretary-General in the Department of Finance and Privy Councillor Extraordinary; Henriette Cornella Pauline de Vries\n(1864\n-?\n)\n; Gustav de Vries\n(\nthe subject of this biography\n)\n; and Emma de Vries\n(1868\n-\n1923)\n.\nAfter high school studies in Amsterdam, Gustav de Vries entered the University of Amsterdam where he was taught by the professor of physics Johannes Diederik van der Waals and the professor of mathematics\nDiederik Johannes Korteweg\n. He was also taught by Willem Henri Julius\n(1860\n-\n1925)\n, a physicist who was one of the first to undertake research on the sun, and Adrianus Jacobus van Pesch\n(1837\n-\n1916)\n, an applied mathematician who had been the thesis advisor of Gustav's brother Jan de Vries. After completing his undergraduate studies, Gustav de Vries worked for a doctorate under\nKorteweg\n's supervision. He earned sufficient money to make this possible by teaching at the Koninklijke Militaire Academie\n(\nRoyal Military Academy, Netherlands\n)\nduring\n1892\n-\n1893\n. The Academy, located in the castle of Breda, trained officers of the Dutch Air Force and the Dutch Army and had not been operating for long when de Vries began to teach there. In the following academic year,\n1893\n-\n1894\n, de Vries again taught at a military school, this time at the Cadet School at Alkmaar.\nNot everything went smoothly for de Vries, however, as can be seen from a letter that his thesis advisor\nKorteweg\nsent him in October\n1893\n(\nsee\n[\n1\n]\n)\n:-\nTo my regret I am unable to accept your dissertation in its present form. It contains too much translated material, where you follow\nRayleigh\nand\nMcCowan\nto the letter. The remarks and clarifications that you introduce now and then, do not compensate for this shortcoming. The study of the literature concerning your subject-matter must serve solely as a means for arriving at a more independent treatment, expressed in your own words and in accordance with your own line of reasoning, prompted, possibly, by the literature, which should not be followed so literally. When you have mastered your subject-matter to the extent that you can do this, then naturally you will also be confronted with the questions raised by\nRayleigh\nand\nMcCowan\n, which will provide you with the opportunity to display your strength. In order to facilitate your progress, I send you the outline of a treatment of a single wave according to a slightly modified method due to\nRayleigh\n. I will see whether I can find a guiding principle to offer you for further elaboration. ... Naturally, I cannot know whether I can succeed in this. ... For an historical overview of the theory of waves, you should consult much more literature than you have done thus far, and this task will be difficult to carry out in Alkmaar. Your introduction contains too exclusively issues that one can equally well find in handbooks\n[\nLamb\nand\nBasset\n]\n. It is obviously a disappointment for you who must have deemed to have already almost completed your task, to discover that you have apparently only completed the preparatory work. In the meantime do not be down-hearted. With pleasure I will do my best to help you mount the horse ...\nNow both Korteweg and de Vries were under considerable pressure at this time. Korteweg, in addition to his normal teaching duties, was head of the university during\n1883\n-\n84\nand working on a major address he had to give in January\n1894\n. Around the time that Korteweg was looking at the draft of de Vries's thesis, Jan de Vries, the elder brother of Gustav, had left his position as a high school teacher of mathematics at the HBS/Handelsschool, the trade school in Haarlem, to take up an appointment at the technical college in Delft. The position at the HSB was filled by Gustav de Vries who found the position very time consuming. He had to take on this onerous teaching task and, at the same time, try to make the major improvements to his thesis that\nKorteweg\nwas seeking. De Vries had studied work on the theory of waves by\nJohn Scott Russell\n,\nGeorge Biddell Airy\n,\nJohn William Strutt\n(\nLord Rayleigh\n)\n,\nJohn McCowan\n,\nAlfred George Greenhill\n, and\nJoseph Valentin Boussinesq\n. But, as we note below, both\nKorteweg\nand de Vries failed to pay enough attention to the work of\nBoussinesq\n.\nOn\n1\nDecember\n1894\nde Vries had an oral examination on his thesis\nBijdrage tot de kennis der lange golven\nⓉ\n(\nContribution to the knowledge of long waves\n)\nwhich contained the famous\nKorteweg\n-de Vries equation. The results of this thesis were written up for publication in a paper authored jointly by\nKorteweg\nand de Vries\nOn the Change of Form of Long Waves advancing in a Rectangular Canal and on a New Type of Long Stationary Waves\npublished in the\nPhilosophical Magazine\nin\n1895\n. They found explicit, closed-form, travelling-wave solutions to the\nKorteweg\n- de Vries equation that decay rapidly. These waves take the form of one or several waves propagating with a velocity which is proportional to their amplitude. The larger waves, therefore, will overtake the smaller waves and when the collision occurs the larger wave moves through the smaller to become the leading wave, yet neither of the waves changes form during the interaction. In fact the naturalist\nJohn Scott Russell\nhad claimed to have observed solitary waves in\n1844\n, yet several prominent mathematicians, including\nGeorge Gabriel Stokes\n, were convinced they could not exist.\nKorteweg\nand de Vries proved\nJohn Scott Russell\nwas right and produced the necessary mathematical justification. We now know that this work by\nKorteweg\nand de Vries is extremely important, but sadly this was not recognised at the time and it was over seventy years before this fundamental research led to the rapidly expanding research topic of 'solitons'. However, both\nKorteweg\nand de Vries seem to have completely missed the fact that the equation, now called the\nKorteweg\n-de Vries equation, had already appeared in the work of\nJoseph Valentin Boussinesq. In fact the equation appears as a footnote in\nBoussinesq's\n680\n-page treatise\nEssai sur la théorie des eaux courantes\nⓉ\n(\nEssay on the theory of flowing water\n)\n(1885)\n, but this should not in any way diminish the importance of de Vries's contribution.\nOn\n9\nApril\n1896\nde Vries was married in Haarlem to Johanna Henrietta Jacoba Boelen\n(1867\n-\n1937)\n, a school teacher who taught French language and literature. Johanna had been born in Monnickendam. They had three sons and two daughters, the first child, however, dying as an infant. Although he found it difficult to work in his home at Ripperdapark\n45\n, de Vries published two further papers in\n1900\n. These concern cyclones and were published in the\nProceedings\nof the\nRoyal Netherlands Academy\n. However, despite many attempts, he failed to get a better position for himself. Although at first his teaching at the five-year HBS had gone well, things began to go much less well and de Vries felt that he was not getting the support that he deserved from his principal. The stress caused but his lack of success led to him spending five weeks in\n1902\nin a sanatorium for patients suffering from a nervous breakdown. This was not an isolated event for the HSB annual reports of\n1902\n,\n1903\nand\n1904\nall note that de Vries had been \"absent for a considerable period because of illness\". In\n1907\nhe published a\nConcise textbook on arithmetic and algebra\n. In early\n1908\nde Vries submitted a manuscript to Nieuw Archief voor Wiskunde and, in April of that year, the editor of the journal, Jan Cornelis Kluyver\n(1860\n-\n1932)\n, who was the professor at the University of Leiden working on analysis, differential geometry and number theory, replied to\nKorteweg\n(\nsee\n[\n6\n]\n)\n:-\nI have perused the strange piece by Mister De Vries. It gives me the impression that the author has accidentally noticed a quite natural and unexceptional phenomenon, of whose true nature he makes no correct representation, and now more or less raises the status of what actually amounts to a commonplace thing to a miracle. ...\nKorteweg\nshowed this letter of rejection to de Vries and this was yet another blow to add to his unhappiness. A few months later, in August\n1908\n, de Vries wrote an open letter to Thiel, the Alderman of Education in Haarlem\n[\n6\n]\n:-\nIn this letter he writes about his frustrations and lack of support from his superior, and interestingly states: \"\n[\nthis\n]\nadded to the grief, caused by the sudden death of a child\". The disappointments came in the first place, which says something about the immensity of his frustration. From the documents it appears that De Vries perhaps made too high demands on his pupils in the higher classes, but that he did distinctively well in the lower ones. This signifies that he as yet did not expect much from the younger students, but that he perhaps looked for spiritual affinity with the older ones. At the time when he was required by his director to teach below his level of qualification, he applied to all kinds of positions, but did not even get nominated. All exceedingly frustrating. Also, from the long, even printed, open letter to the Alderman it appears that there were many colleagues who found him socially incompetent in dealing with punishing pupils, but also in regard to teaching itself. The picture is that of a man with considerable communication problems.\nThe suggestion that he was much more successful with the lower classes than with the higher ones is born out by the fact that in\n1909\nhe was transferred from the five-year HBS in Haarlem to the three-year HSB in the same city. This lower level school made much less demands on de Vries and his situation seems to have improved. In each of the three years he taught for seven hours a week using his own textbook which he had published in\n1907\nand also\nLeerboek der vlakke meetkunde\nⓉ\n(\nTextbook of plane geometry\n)\nwritten jointly by his brother Jan de Vries and Willem Henrik Leonard Janssen van Raaij\n(1862\n-\n1937)\n. In addition to teaching mathematics, he also taught accounting. That his life was now more stable is shown by the fact that, in\n1912\n, de Vries published two further papers on his 'calculus rationis' in the\nProceedings\nof the\nRoyal Netherlands Academy of Sciences\n. De Vries taught at the three-year HBS in Haarlem until he retired in\n1931\n, when he reached the age of\n65\n. However, he developed new interests in freemasonry and spiritualism. He joined the Freemason Lodge 'Vicit vim virtus' in\n1913\n, becoming its Master in\n1916\n. Later that year he transferred to the new Lodge 'Kennemerland'. He took a very active part in this Lodge, holding high-powered discussions on philosophy. He also entered a long and deep discussion concerning Goethe's\nFaust\n.\nIn December\n1934\nhe attended a séance in Haarlem-Noord. Leaving the séance to return to his accommodation he was knocked down by a car. He was taken to hospital where he died three days later. His wife Johanna, who like her husband had long suffered from poor health, survived her husband by three years. Bastiaan Willink, who is related both to\nKorteweg\nand to de Vries, gives the following assessment of de Vries's contributions\n[\n6\n]\n:-\nHe was a decently good researcher, who however with his doctoral dissertation straightaway produced his most significant achievement. Either directly or indirectly, this must have been owing to the pressure put on him by\nKorteweg\nand to his experiencing his teaching obligations as onerous.\nIn April\n1995\nan International Symposium was held in Amsterdam:-\n... to commemorate the centennial of the equation by and named after\nKorteweg\nand de Vries.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}