{
  "nome_completo": "Hanna Neumann",
  "nome_curto": "Hanna Neumann",
  "ano_nascimento": "1914",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neumann_Hanna/",
  "lugar_nascimento": "Lankwitz, Berlin, Germany",
  "lugar_morte": "Ottawa, Canada",
  "biografia": "Hanna Neumann\nwas given the name Johanna von Caemmerer but was always known as Hanna. Her father, Hermann Konrad von Caemmerer, would have been a Prussian officer had he followed the family tradition but, instead, became a historian. He was awarded a doctorate and, in\n1901\n, received his\nvenia legendi\n(\nright to lecture\n)\n. He married Katharina Elisabeth Jordan and they had three children; Hanna was the youngest of the children having an older brother Ernst\n(\nborn\n1908)\nand a sister Dora\n(\nborn\n1910)\n. Hermann von Caemmerer made an excellent beginning to his academic career but, tragically, was killed in\n1914\nin the first days of World War I. In addition to the sadness of never knowing her father, Hanna was brought up in difficult circumstances since the family had to survive on a war pension. All the children had to help out by making extra money by working at various times.\nAt the age of six Hanna entered a private school and, two years later in\n1922\n, she began her studies at the Augusta-Victoria-Schule which was a\nRealgymnasium\nfor girls. The subject that most interested her during her first few years at the school was botany, but after the age of fourteen she became fascinated by mathematics. She spent ten years at this school, graduating in\n1932\n, but in addition to her studies she helped out the family's finances by coaching the younger children. During her final few years at the school she would spend up to fifteen periods coaching each week. Despite this extra burden, her grades were excellent and she took examinations in fifteen subjects for her final examinations. One teacher at the school was a major influence on her, namely\n[\n7\n]\n:-\n... Fraulein Otto, her form mistress and French teacher for the final two years. This woman, who was to become a trusted friend in the turbulent Nazi years ahead, by the example of her fortitude, sense of humour, tolerance and wisdom, strongly influenced Hanna's view of people and events; her lack of hatred and bitterness, more than anything else, convinced Hanna that they have no place, ever, in human relations.\nAt Easter\n1932\n, Hanna entered the University of Berlin. Her introduction to higher mathematics was a course given by\nGeorg Feigl\nand, in addition, she was taught analytic and\nprojective geometry\nby\nLudwig Bieberbach\n, differential and integral calculus by\nErhard Schmidt\n, and\nnumber theory\nby\nIssai Schur\n.\nBieberbach\nwas an inspiring, if unorganised, lecturer and Hanna almost became a geometer. However, although mathematics was her main subject, she continued to have a wide range of interests taking courses on physics, psychology, one on the Italian poet Dante, and one on Common Law. She also became part of a group of mathematics students, almost all several years her senior, which included Werner Fenchel,\nKurt Hirsch\n, Rudolf Kochendörffer,\nRichard Rado\n,\nHelmut Wielandt\n, and\nBernhard Neumann\n. However, after the Nazis came to power in\n1933\nHanna became unhappy. She had started a special friendship with\nBernhard Neumann\nin January\n1933\n, but in April, after Hitler came to power, he realised that since he was Jewish he had to leave the country which he did in August\n1933\n. At Easter\n1934\nHanna visited\nBernhard\nin Cambridge, England, and they were secretly engaged. Hanna was strongly opposed to the Nazis and was a member of a group of students who tried to protect their Jewish lecturers. She had been given a job as a part-time assistant in the library of the Mathematical Institute due to her excellent results in the first year of her studies, but because of her anti-Nazi actions, she was told that she could no longer have her job in the Mathematical Institute.\nA highly successful undergraduate career meant that Hanna wanted to continue to study for a doctorate. However, she was told that if she did so she would be examined by an examiner who would question her on her political views, requiring her support of the Nazi cause. To avoid this she took the\nStaatsexamen\n, more intended for those intending to become Gymnasium teachers, in\n1936\n. She was then accepted as a research student at Göttingen where\nHelmut Hasse\nwas assigned to be her thesis advisor. Between taking the Staatsexamen in\n1936\nand the summer of\n1937\nwhen she moved to Göttingen, Hanna took a job as a statistician at an institute of military economics. Her research at Göttingen went well, she enjoyed the social life particularly playing chess, but she became increasingly worried by the political situation. She was very disturbed when Hitler declared Austria a part of Germany in the Anschluss of March\n1938\n. When Hitler declared his decision to destroy Czechoslovakia at the end of May, Hanna realised that if she remained in Germany to complete her doctorate it could be many years before she would be able to marry\nBernhard\n. She decided to give up her studies at Göttingen and, in July\n1938\n, she travelled to England to meet up with\nBernhard\n[\n7\n]\n:-\nHanna never harboured any bitterness or resentment against Germany and was later to enjoy a number of visits there. The first years in Britain were far from easy, yet they saw the beginning of her family, and the beginning of productive research. Hanna and\nBernhard\nfelt they could not openly marry until his parents were safe from possible reprisals.\nHanna and\nBernhard\nwere secretly married on\n22\nDecember\n1938\nat the local register office in Cardiff where\nBernhard\nwas working as a lecturer. In early\n1939\nthey set up home in Cardiff once\nBernhard\n's parents had managed to leave Germany and join them. Hanna wrote her first paper\nOn the elimination rule\nwhich was published in the\nJournal\nof the\nLondon Mathematical Society\nin\n1940\n.\nDerrick Henry Lehmer\nwrites in a review:-\nThe word elimination, used in the title, refers to chess matches rather than to the familiar algebraic process. A rule often used to determine the winner of two chess teams is as follows: Each game won or drawn by a member of a team counts\n1\npoint, each game lost counts\n0\n, towards the total score of the team. The team with the higher score wins the match, but if both teams have the same score, that team which lost at the last game not drawn wins the match. The problem considered here is that of pre-assigning positive weights to each game so that the total scores, thus modified, will select the winning team according to the above rule.\nAfter World War II began, Hanna and\nBernhard\nwere classified as 'least restricted' aliens which allowed them to continue their life without problems. However, after the British army was evacuated from Dunkirk at the beginning of June\n1940\n, all aliens were barred from the south of Britain and this meant that they were not allowed to continue living in Cardiff. They chose to move to Oxford so that they could maintain contact with university life.\nBernhard\nwas interned for a few months, following which he was drafted into the army, and Hanna enrolled at Oxford to study for a doctorate supervised by\nOlgar Taussky-Todd\n. Her first child, Irene, had been born in Cardiff and their second child,\nPeter\n, was born in Oxford. Accommodation in Oxford proved a major difficulty, partly because she now had two young children, but also because she had to compete with many people who moved to Oxford to escape the bombing of London. After a number of short-term stays in rooms, she decided to live in a caravan\n[\n7\n]\n:-\nShe rented a caravan and got permission from a market gardener to park it on his farm. She also, as was necessary had it declared 'approved rooms' by the Oxford Delegacy of Lodgings. It was then that the thesis was largely written; in a caravan by candlelight. The typing was done on a card-table by a haystack when the weather permitted.\nHanna's thesis was on the subgroups of free products of\ngroups\nwith amalgamated subgroup, generalising the\nKurosh\nsubgroup theorem\n(\nproved in the\n1930\ns\n)\nwhich describes subgroups of a free product of groups. Hanna Neumann completed work on her thesis by the summer of\n1943\nand awarded her doctorate after the thesis was examined by\nPhilip Hall\nand\nHenry Whitehead\nin April\n1944\n. By this time Hanna had been able to return to Cardiff. She published the results of her thesis in two publications\nGeneralized free products with amalgamated subgroups\n(1948\n,\n1949)\npublished in the\nAmerican Journal of Mathematics\n. These were major articles of\n35\nand\n49\npages respectively.\nAfter\nBernhard\nwas demobbed from the army at the beginning of\n1946\n, he was appointed to a lectureship in Hull. Their third child, Barbara, had been born in Cardiff and their fourth child, Walter, was born shortly after they arrived in Hull. Hanna was appointed as a Temporary Assistant Lecturer at Hull and she taught there for twelve years reaching the position of Senior Lecturer.\nBernhard\n, however, had been appointed as a lecturer at Manchester in October\n1946\nso for many years they only saw each other at weekends. In\n1951\ntheir fifth child, Daniel, was born. Let us mention at this point a highly significant paper which she wrote in collaboration with her husband and\nGraham Higman\nentitled\nEmbedding theorems for groups\npublished in the\nJournal\nof the\nLondon Mathematical Society\nin\n1949\n. It is in this paper that the now well-known construction named an HNN-extension was introduced.\nIn\n1958\nHanna was able to join\nBernhard\nin Manchester when she was appointed as a lecturer at Manchester College of Science and Technology\n(\nUMIST\n)\n. She was soon promoted to senior lecturer. The year\n1961\n-\n62\nshe spent with\nBernhard\nat the\nCourant\nInstitute in New York where she was a Visiting Research Scientist. Their three sons accompanied them and\nPeter Neumann\n, by then an undergraduate at Oxford, joined in with his parents' research efforts. The result was the important paper\nWreath products and varieties of groups\njointly authored by\nBernhard\n, Hanna and\nPeter Neumann\n. While they were in New York the invitation arrived for both of them to set up mathematics at the Australian National University. In August\n1963\nHanna and\nBernhard\nwent to Australia where she was to spend the rest of her career. She was appointed first to a readership and then to the chair of pure mathematics in the university's School of General Studies on\n1\nApril\n1964\n. In\n1971\nshe undertook a lecture tour of Canada. After lecturing in a number of universities Hanna reached Carleton University, Ottawa. There she became ill, admitted herself to hospital and quickly went into a coma. She died of a cerebral aneurysm two days later without regaining consciousness.\nHanna Neumann is best known for her work on varieties of groups and she presented a paper entitled\nVarieties of Groups\nto the International Conference on the Theory of Groups held in Canberra in\n1965\n(\nshe was one of the main organisers of the conference\n)\n. She writes in the introduction to that paper:-\nVarieties may be considered as special categories, with algebras of a certain type as objects and operation-preserving mapping as morphisms. The role of varieties in universal algebra or category theory is not our concern here; we are interested in varieties of groups only, for the information on groups that their study affords. What follows is a survey of problems and results leading up to current investigations as they are known to the author.\nHer book\nVarieties of Groups\n(1967)\nrapidly became a classic. Ian D Macdonald writes in a review:-\nVarieties of groups have attracted considerable attention in recent years, both as tools for application to group theory and as category-like objects of interest in their own right, though few of the existing text-books devote space to them. In this monograph the reader will find a coherent account of the subject, consolidating a substantial body of results from research papers and incorporating many new or at least unpublished theorems\n(\nand proofs\n)\nto which the author has had access. ... the author has written a first-rate book. The presentation is lucid and meticulous without being pedantic, and this, combined with judicious selection, marshalling and assimilation of the facts, makes it a joy to read.\nKenneth Fowler, in\n[\n4\n]\n, describes Hanna's interest in teaching:-\nHanna was a born teacher. She made abstract ideas accessible through concrete examples and showed that mathematics could be applied to many human endeavours. Within months of becoming a professor, she gave a series of courses to secondary schoolteachers and participated in discussions on new syllabuses for senior students. In\n1966\nshe was elected a foundation vice-president of the Australian Association of Mathematics Teachers. Convinced that mathematical education in Australia was 'lagging behind the rest of the world to a frightening extent', she worked hard to rectify the problem and was made a fellow\n(1970)\nof the Australian College of Education. She served as dean of students at the A.N.U. in\n1968\n-\n69\n.\nA letter from two of her students, published after her death, shows her character\n(\nquoted in\n[\n7\n]\n)\n:-\nWe will remember her not only as a mathematician, she was a friend who always had a sympathetic ear for any student, and was never too busy. We will always miss her tremendous dedication and sincerity, and the friendliness of her presence.\nFowler describes both her character and hobbies\n[\n4\n]\n:-\nA humble woman, peace-loving, warm, enthusiastic, inspiring and energetic, she had a flair for languages. Her hobbies were cycling, botany and photography.\nIn fact she combined two of her interests by taking photographs of flowers and trees, taken with a camera she purchased from the royalties earned from\nVarieties of Groups\n.\nAmong the many honours she received for her contributions we mention in particular her election to a Fellowship of the\nAustralian Academy of Science\nin March\n1969\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}