{
  "nome_completo": "Hans Wussing",
  "nome_curto": "Hans Wussing",
  "ano_nascimento": "1927",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wussing/",
  "lugar_nascimento": "Waldheim, Germany",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "Hans Wussing\n's father was a business employee. After studying at primary school for three years, Hans began his secondary school education where he soon developed a great interest in chemistry, physics and mathematics. However, even before he was twelve years old, war had broken out. He continued his secondary education until January\n1943\nwhen Germany began the Luftwaffenhelfer programme. This drafted all boys born in\n1926\nor\n1927\n, which included Wussing, into the military where they were supervised by the Hitler youth who began a programme of ideological indoctrination. Members of the Luftwaffe also trained the boys in military duties. In\n1944\n, when he reached the age of\n17\n, Wussing was drafted into the German army and sent to Belgium. There he was captured by the advancing British forces. Reinhard Siegmund-Schultze writes in\n[\n14\n]\n:-\nAfter being prisoner of war under the British in Belgium and under mournful circumstances, half frozen and half starved to death, Wussing reached his birthplace Waldheim in East German Saxony in\n1946\nand continued his school education.\nIn fact it was March\n1946\nwhen he arrived back in Waldheim and he returned to school, completing his secondary education in\n1947\n. We should note that, as a consequence of his experiences during the war, Wussing had a deep hatred for war and Fascism for the rest of his life.\nPerhaps one of the most surprising facts about Wussing is that he became a mathematician by mistake rather than by design. He applied to the Leipzig University to train as a secondary school teacher. His application requested that he take chemistry as his major subject with physics and mathematics as minor subjects. However, the university made an administrative error when dealing with his application and he was offered a place to study mathematics as his major subject. He felt so lucky to be offered a place at Leipzig University that he did not complain about the error and, on\n17\nOctober\n1947\n, he began studying mathematics as his main topic with physics as his minor subject. However, he had  broad interests and, while at university he continued his interests in historical, philosophical, cultural and social issues\n[\n4\n]\n:-\nPolitically, he was committed to building a better, more socially just and peaceful society.\nWhile he was studying at Leipzig University, Wussing met his fellow student Gerlinde Walter. She, like Wussing, had completed her secondary education in\n1947\nand, again like him, was studying a course at Leipzig University to qualify as a secondary school mathematics teacher. Both of Gerlinde's parents were school teachers. In\n1951\nHans and Gerlinde took the state examination and they qualified as high school teachers of mathematics and physics. During the time they had been studying at university the process of creating two Germanys had been going on. In East Germany the Socialist Unity Party swept to power. Both Hans and Gerlinde had joined this Party in June\n1947\n, a year after its formation in April\n1946\n. Hans and Gerlinde married in\n1952\n. By this time Wussing was undertaking research towards his doctorate in group theory advised by Walter Schnee while his wife was teaching in the Workers and Peasants Faculty of the University which had been set up to assist children from disadvantaged backgrounds gain access to studying academic subjects. Hans and Gerlinde Wussing's daughter Petra was born in\n1953\n. When Petra, who became a biochemist, was a child she\n[\n14\n]\n:-\n... took a considerable part of the couple's energy. Hans helped in looking after their only child. The bulk of housework, however, he left in traditional manner to his wife.\nWussing completed his doctoral studies and was awarded a doctorate for his thesis\nÜber Einbettungen endlicher Gruppen\nⓉ\n(\nOn embedding finite groups\n)\nin\n1957\n. During the previous two years,\n1955\n-\n57\n, he had been teaching at Leipzig University and the delay in obtaining his doctorate is explained in\n[\n14\n]\n:-\nHe could not defend his dissertation until\n1957\nbecause he had to read it regularly to his advisor, the almost blind Walter Schnee\n(1885\n-\n1958)\n.\nThe direction that Wussing's career would take after\n1957\nwas less than clear. He considered becoming an industrial mathematician in the aeronautic industry but, despite the attractions, particularly in terms of salary, of such a position he decided against following that route. By a fortunate turn of events another possibility opened up. The head of the Workers and Peasants Faculty where Wussing's wife was teaching, and in which Wussing himself had taught for two years, was Annemarie Harig, the sister of Gerhard Harig\n(1902\n-\n1966)\n. Through her Wussing learnt that Gerhard Harig was about to take over as head of the Karl Sudhoff Institute at Leipzig University and that he aimed to make it an Institute, which had previously only covered the history of medicine, into the Karl Sudhoff Institute for the History of Medicine and Science. Harig was looking to appoint staff in the area of the history of mathematics and science to the Institute and although Wussing was not qualified as a historian of science, nevertheless he was a member of the Socialist Unity Party which was highly influential at the university. Both Harig and Wussing shared beliefs in a Marxist philosophy which strongly influenced their writing.\nWussing was appointed as an assistant at the Karl Sudhoff Institute in\n1957\nand began working on his\nhabilitation\nthesis on the history of mathematics. His habilitation thesis\nDie Genesis des abstrakten Gruppenbegriffes\nⓉ\n(\nThe genesis of the abstract  group concept\n)\nwas completed in\n1966\n. It was published in\n1969\nas a German book and was translated into English and published under the title\nThe genesis of the abstract group concept. A contribution to the history of the origin of abstract group theory\nin\n1984\n. Wussing explains in the Introduction his aims:-\nThe existence of two additional roots of abstract group theory has been obscured mainly by the fact that the group-theoretic modes of thought in number theory and geometry remained implicit until the end of the middle third of the nineteenth century; they made no use of the term 'group' and, in the beginning, had virtually no link to the contemporary development of the theory of permutation groups.\n[\nI seek\n]\nthose paths of development of implicit group theory that have made a causal contribution to the rise of explicit group theory.\nBernhard Neumann\nwrites in a review of the\n1969\nGerman edition:-\nThis is not, of course, a history of the development of group theory, though much of this development, approximately to the end of the\n19\nth\ncentury, can be found in the book. The author has set out to trace the process of abstraction that led finally to the axiomatic formulation of the abstract notion of group. His main thesis, ably defended and well documented, is that the roots of the abstract notion of group do not lie, as frequently assumed, only in the theory of algebraic equations, but that they are also to be found in the geometry and the theory of numbers of the end of the\n18\nth\nand the first half of the\n19\nth\ncenturies.\nFollowing Harig's death in\n1966\n, Wussing became acting director of the Karl Sudhoff Institute in\n1967\n. In the following year he was appointed as an extraordinary professor of the history of mathematics and natural sciences at the University of Leipzig and in\n1970\nhe became an ordinary professor. In\n1977\nhe became director of the Karl Sudhoff Institute\n[\n16\n]\n:-\nHans Wussing became the teacher and advisor of most historians of mathematics who ever were working in this field from the late\n1950\ns until the end of the German Democratic Republic. Following in the tradition of Gerhard Harig, Hans Wussing was one of the most important persons in the field history of mathematics and history of science in the German Democratic Republic and one of their representative in the international scientific community. From\n1967\nto\n1987\nhe served as President of the National Committee on History of Science of the German Democratic Republic. From\n1967\nto\n1998\nhe was editor-in-chief of the well known journal NTM. In\n1984\nhe became a Member of the Academy of Science of Saxonia, Leipzig.\nWe have already noted Wussing's Marxist beliefs. It is unclear whether this explains the fact that up to the end of the German Democratic Republic in\n1990\n, Wussing never published in any Western journal although he was an editor of\nHistoria Mathematica\nfrom\n1974\nto\n1990\n. Reinhard Siegmund-Schultze writes\n[\n14\n]\n:-\nPersonally I regret that Wussing, who belonged to the editorial board of 'Historia Mathematica' from the beginning, without publishing a single paper in that journal, apparently never encouraged others to publish there either.\nWussing was, as mention in the quote above, an editor of\nNTM - Schriftenreihe für Geschichte der Naturwissenschaften, Technik und Medizin\n(\nThe Journal for the history of science, technology, and medicine\n)\nfrom\n1967\nand strongly supported this journal by publishing in it and encouraging his students to publish in this journal published in Leipzig.\nLet us now look briefly at some of the books that Wussing has published. These include:\n(\ni\n)\nNicolaus Copernicus\n(1973)\n;\n(\nii\n)\nCarl Friedrich Gauss\n(1974)\n;\n(\niii\n)\nIsaac Newton\n(1977)\n;\n(\niv\n)\nCourse on the history of mathematics\n(1979)\n;\n(\nv\n)\nAdam Ries\n(1989)\n;\n(\nvi\n)\nFrom counting pebbles to the compute\nr\n(1997)\n;\n(\nvii\n)\nFrom Gauss to Poincaré\n(2009)\n;\n(\nviii\n)\nFrom Leonardo da Vinci to Galileo Galilei\n(2010)\n; and\n(\nix\n)\n(\nwith Menso Folkerts\n)\nFrom Pythagoras to Ptolemy\n(2012)\n. As an illustration of Wussing's approach to the history of mathematics, we quote from a review of\nNicolaus Copernicus\n(1973)\n:-\nOne of the most useful features of this book is the author's\n(\nhandsomely illustrated\n)\ndescription of the social, political, economic and scientific context in which the life and work of\nCopernicus\nmust be set. Another is his description of the influence of\nCopernicus\nand of the work that has been done over the centuries in elucidating and assessing that influence. Thus, he has given a truly historical account, without, however, losing sight of the mathematical and astronomical details.\nAs an illustration of Wussing's own description of his aims in treating the history of mathematics, we quote from the Preface to 'Hans Wussing et al,\nVom Zahlstein zum Computer: Mathematik in der Geschichte\n. Volume\n1\n:\nUberblick und Biographien\n'\nⓉ\n(\nHans Wussing et al, From Number stone to Computer: Mathematics in history. Volume\n1\n: overview and biographies\n)\n(1997)\n:-\nWhy study the history of mathematics when mathematics is such a dreaded subject for many students and most people only shudder when recalling classes and tests in mathematics? The mathematical historian Wussing gives a detailed answer to this question in the first chapter of this introduction: The occupation with the history of mathematics is an intellectual adventure, in which one can experience the suspense of how mathematics has evolved, how much hardship and error it took people from the first beginnings in the dim and distant past to erect - over the millennia - the magnificent mental structure whose contents and methods have become the foundation and indispensable apparatus for the development of all technology, the sciences, medicine, business and industry, and which, in the form of the computer, have practically embraced every aspect of modern life.\nCatherine Goldstein writes in a review of this book:-\nThis textbook is the first volume of a projected series intended as a basic introduction to the history of mathematics and designed for independent study, in particular for students and high school teachers. ... The authors' goal is to present mathematics as a human adventure, tied to many aspects of cultural and social life. ... it is extremely rare to find a textbook that sheds light on the work of the historian, behind the narrative presentation of the mathematics. This emphasis, which is everywhere visible here, seems very useful, and I would recommend that it be adopted in other texts to help foster a more complete understanding of the history of science. ... the lively, clear, and simple style nicely conveys its main message: that mathematics is a human pursuit whose aims and motivations can be understood by everyone.\nSome more extracts from reviews of Wussing's books are at\nTHIS LINK\n.\nWussing received many honours for his outstanding contributions to the history of mathematics. The most prestigious of these was the Kenneth O May Prize given for outstanding contributions to the history of mathematics. The first award of this prize was to\nDirk Struik\nand\nAdolph Pavlovich Yushkevich\nat the\n18\nth\nInternational Congress of History of Science in Hamburg and Munich in\n1989\n. The second award was to Christoph Scriba and Hans Wussing at the\n19\nth\nInternational Congress of History of Science in Zaragoza, Spain in\n1993\n. However,\n[\n14\n]\n:-\nOf all the honours he was most excited about the volume 'Amphora', a book with contributions by\n36\nprominent historians of mathematics from\n10\ncountries, which was dedicated to his\n65\nth\nbirthday in\n1992\n.\nAmong the other honours he received, we mention that he was elected a corresponding member of the International Academy of the History of Science in\n1971\n, becoming a full member\n10\nyears later. In\n1984\nhe was elected a full member of the Saxon Academy of Sciences in Leipzig where he chaired the Commission for the History of Science.\nLet us quote from\n[\n16\n]\na description of Wussing's character written by one of his students:-\nHans Wussing was warm and sympathetic, always generous in his appreciation of others' achievements and unfailingly helpful to their aspirations. Those who knew him will sorely miss him, will never forget his support and his advice, the stories he told about the history of science and the history of mathematics past and present, and above all his energetic encouragement of research and collaboration. Those who had the good fortune to meet Hans Wussing, not only at scientific congresses and conferences, but also in small discussion groups and those, moreover, who had the good fortune to meet and talk to him privately, will never forget his great knowledge and intelligence, his sense of humor and his kindness.\nWussing retired in\n1992\nbut continued to work on the history of science, in particular publishing works aimed at presenting the history of mathematics to non-experts. The Karl Sudhoff Institute, in which the history of mathematics had flourished under Wussing's leadership, changed after his retirement. It contained one professor, two\ndocent\n, eight assistants and several doctoral students involved in the history of mathematics in\n1989\nbut this area has now completely vanished from the Institute which today is only involved in the history of medicine. The change in emphasis at the Institute was a cause for sadness for Wussing over the final years of his life although he was encouraged by the successes of his students. He died following several years of battling against cancer. During these years when he steadily became less mobile he was able to continue his studies because of the support of his wife Gerlinde.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}