{
  "nome_completo": "Hans-Joachim Bremermann",
  "nome_curto": "Hans-Joachim Bremermann",
  "ano_nascimento": "1926",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bremermann/",
  "lugar_nascimento": "Bremen, Germany",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Hans-Joachim Bremermann\n's father was Bernard Bremermann and his mother was Berta Wicke. His education was not an easy one since World War II began when he was thirteen years old and did not finish until he was nineteen. It was only when life began to return to some sort of normality after the war that Hans-Joachim was able to show his real abilities.\nBremermann's doctoral studies were undertaken at the University of Münster. In\n[\n2\n]\nRange puts the research environment that Bremermann entered into context:-\nThis was an extraordinary period for the famous Münster school in complex analysis, centred round\nHeinrich Behnke\nsince the\n1920\ns.\nHenri Cartan\nvisited Münster in\n1949\nfor the first time after the war, sharing a wealth of ideas from the French school. F Hirzebruch studied there before moving to Zürich in\n1949\nto work with\nH Hopf\n. In\n1951\nKarl Stein created what became known as Stein manifolds, and together with\nBehnke\nhe introduced the first \"complex spaces\". H Grauert and R Remmert began their studies in Münster during this time, laying the foundations for their pioneering work. Naturally Bremermann too learned complex analysis and went on to make significant contributions to the field ...\nIn\n1951\nBremermann completed his\nStaatsexamen\nin mathematics and physics. In the same year his doctoral dissertation\nDie Charakterisierung von Regularitätsgebieten durch pseudokonvexe Funktionen\nⓉ\n(\nCharacterization of regular areas by pseudoconvex functions\n)\nwas published by the University of Münster in\n1951\n. We shall discuss the results of this work below, but at this stage we note that it solved a special case of the Levi problem. In the year following the award of his doctorate Bremermann remained at Münster and taught there as an assistant. He travelled to the United States in\n1952\nwhere he held a research associate position at Stanford University and then, in\n1953\n, he was appointed a research fellow at Harvard University. During this time he continued to produce high quality results in complex analysis continuing to push the results of his doctoral dissertation towards a general solution to the Levi problem.\nOn\n16\nMay\n1954\nBremermann married a Spanish lady Maria Isabel Lopez Perez-Ojeda who was a scholar of romance language and literature. He returned to Germany for the academic year\n1954\n-\n55\nwhich he spent back in Münster, then returning to the United States he spent the years\n1955\n-\n57\nat Princeton having been invited to undertake research at the Institute for Advanced Study. He was then appointed as assistant professor at the University of Washington, Seattle for\n1957\n-\n58\n. The year\n1957\nsaw Bremermann move into a new area of research when he collaborated with the physicists R Oehme and J G Taylor applying his expertise in complex analysis to work on quantum field theory. For the year\n1958\n-\n59\nhe was back at Princeton to spend another year undertaking research at the Institute for Advanced Study, but this time it was as a physicist rather than as a mathematician.\nIn\n1959\nBremermann accepted an appointment as associate professor of mathematics at the University of California, Berkeley. He was to remain at Berkeley for the rest of his career during which he applied his mathematical skills to physics, distribution theory, theory of computation, artificial intelligence and, mathematical biology. He held chairs at Berkeley in both mathematics and biophysics being promoted to full professor in\n1966\n.\nLet us now look briefly at Bremermann's research. In\n1910\n, E E Levi had proved that every domain of holomorphy\n(\ncalled a regularity region in the older terminology\n)\nwith a sufficiently smooth boundary is a pseudoconvex domain. He asked whether the converse was true, namely whether every pseudoconvex domain a domain of holomorphy. Levi's question was answered in\n1942\nby Kiyoshi\nOka\nfor complex functions of two variables, proving that the question had an affirmative answer, but the case of more complex variables remained open. Bremermann's thesis proved a special case of this result and subsequently he proved that the result is true in a further special case. In\n1954\nin\nÜber die Aquivalenz der pseudokonvexen Gebiete und der Holomorphiegebiete im Raum von n komplexen Veränderlichen\nⓉ\n(\nOn the equivalence of pseudoconvex regions and domains of holomorphy in the space of n complex variables\n)\nBremermann proved the general theorem obtaining\nOka\n's result for\nn\nn\nn\ncomplex variables where\nn\n≥\n2\nn ≥ 2\nn\n≥\n2\n. In\n1959\nhe used ideas on his earlier work to give a generalisation of the\nDirichlet\nproblem.\nIn\n1961\n, in collaboration with L Durand, Bremermann produced a concrete approach to the representation of distributions by boundary values of analytic functions. This was an approach much more suited to the need of physical applications than the abstract approach of others. In\n1965\nBremermann published a book\nDistributions, complex variables, and\nFourier\ntransforms\nwhich gave an introduction to the theory of Schwartz distributions using the approach he had developed in his earlier work. J Korevaar, reviewing the book, wrote:-\nThe author has succeeded in writing a book understandable to readers with very little knowledge of functional analysis and topological vector spaces. For this reason, the book will appeal not only to students of mathematics, but also to students of the physical and applied sciences. ... Almost everywhere, the exposition is clear and rigorous.\nAlthough he lived in the United States from\n1952\n, it was not until\n1965\nthat Bremermann became a naturalised American citizen.\nBy the\n1960\ns Bremermann's interests had turned towards the theory of computation and evolutionary biology. In fact his interest in the theory of computation went back to his days as a graduate student in Münster when he attended a series of lectures on\nTuring\nmachines. His interest resurfaced when he tried to write programs for the MANIAC computer, which had been developed by\nvon Neumann\n, and found the experience very frustrating. He began to contribute to complexity theory, and to develop genetic search algorithms. He studied pattern recognitions as part of the rapidly developing area of artificial intelligence, introducing fuzzy logic methods to try to obtain more powerful methods than could be achieved by a rule based approach.\nHe then attempted to fuse together computer science and evolution, introducing new ideas of how mating could generate new gene combinations. As R W Anderson writes in\n[\n2\n]\n:-\n[\nBremermann\n]\ncontinued to develop mathematical modelling as a tool to understanding complex\n(\nespecially biological\n)\nsystems for the rest of his life. His intellectual journey was marked by brilliant insight and foresight.\nIn\n1978\nhe gave the \"What Physicists Do\" series of lectures at The Sonoma State University. In this series he discussed the physical limitations to mathematical understanding of physical and biological systems.\nHe continued to produce pioneering work in mathematical biology through the\n1980\ns as he applied mathematics to models of parasites and disease. For example he analysed pathogenic strategies, cancers, and crop disease. He continued to undertake cutting edge research after he retired from the University of California in\n1991\n. He was particularly interested in applying his expertise to study AIDS and produced a number of ground breaking papers despite the deterioration in his own health due to cancer.\nR W Anderson gives this fitting tribute in\n[\n2\n]\n:-\nHans Bremermann is not only remembered for his genius but also for his warmth, generosity, courage, integrity, humility, and love.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Logic",
    "Topology"
  ]
}