{
  "nome_completo": "Hans Rademacher",
  "nome_curto": "Hans Rademacher",
  "ano_nascimento": "1892",
  "ano_morte": "1969",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rademacher/",
  "lugar_nascimento": "Wandsbeck (part of Hamburg), Schleswig-Holstein, Germany",
  "lugar_morte": "Haverford, Pennsylvania, USA",
  "biografia": "Hans Rademacher\n's father was A Henry Rademacher, a local store owner, and his mother was Emma Weinhöver. In addition to Hans, his Lutheran parents had two other children, Martin and Erna. Hans grew up with broad interests; he both enjoyed and had a talent for modern languages, was interested in both natural and mathematical sciences, but by the time he was eighteen his main interest was in philosophy. In fact it was philosophy that he intended to take as his main university subject when he entered the university of Göttingen in\n1911\n, but he was persuaded to study mathematics by\nCourant\nafter having enjoyed the excellent mathematics teaching of\nHecke\nand\nWeyl\n. His initial mathematical interests were in the theory of real functions which he was taught by\nCarathéodory\nwho also taught him the\ncalculus of variations\n. At Göttingen he also studied\nnumber theory\nwith\nLandau\nbut the outbreak of World War I in\n1914\nmeant that Rademacher had to undertake research while serving in the German army, which he did from\n1914\nto\n1916\n. Continuing his interest in the theory of real functions he completed his doctorate in\n1916\n, written under\nCarathéodory\n's supervision, and submitted a dissertation on single-valued mappings and mensurability. It examined some delicate problems in the theory of differentiation and integration of real-valued functions of real variables and it was in the same spirit as work being carried out by\nDenjoy\nand\nWilliam Young\n. Rademacher was awarded his doctorate in\n1917\n.\nHe taught at a private secondary school in Wickersdorf for a short while, then at a similar school in Bischofstein, before being appointed to the University of Berlin as a\nPrivatdozent\nin\n1919\n. While he taught at these schools he was working on his\nhabilitation\nthesis, still being advised by\nCarathéodory\n, and he submitted this work on partial and total differentiability of functions of several variables and about the transformation of double integrals to Berlin in\n1919\n. At Berlin he became a colleague of\nSchmidt\nand\nSchur\nand both certainly had a strong influence on him. During his three years in Berlin, he married Suzanne Gaspary; they had one daughter Karin born in\n1925\nbut the marriage ended in divorce in\n1929\n.\nOf the mathematical research undertaken by Rademacher during this period, he is remembered most for the system of orthogonal functions\n(\nnow known as Rademacher functions\n)\nwhich he introduced in a paper which was published in\n1922\n. By the time the paper appeared he had already written a second paper on the completion of the system of Rademacher functions but he was advised not to publish it. Rademacher's unpublished manuscript is discussed in\n[\n8\n]\n. Berndt writes\n[\n7\n]\n:-\nSince its discovery, Rademacher's orthonormal system has been utilised in many instances in several areas of analysis.\nRademacher changed his area of mathematical interest from the theory of real functions to number theory in\n1922\nwhen he accepted the position of extraordinary professor at the University of Hamburg. He was led towards number theory by\nHecke\nwho had been appointed to Hamburg three years before Rademacher. In April\n1925\nRademacher left Hamburg to become an ordinary professor at Breslau. It was a difficult decision for Rademacher, particularly since\nHecke\nwas so keen for him to stay in Hamburg. Had\nHecke\nsucceeded in his attempt to get Hamburg to offer Rademacher an ordinary professorship then he would almost certainly have remained there, but the university would not make the offer that\nHecke\nrequested and, after much thought, Rademacher went to Breslau. When the chair at Kiel fell vacant in\n1928\nCarathéodory\nwas asked to give his advice regarding replacements and wrote:-\nNaturally, someone like Rademacher would also be appropriate if you think that there is a prospect that he would exchange Breslau for Kiel.\nIn different political circumstances one would have expected Rademacher to remain at Breslau for the rest of his career. However he was passionate in his concern for human rights and while in Breslau he joined the International League for Human Rights. He was also chairman of the local German Peace Society, the Deutsche Friedensgesellschaft, which had been founded in\n1891\nby Alfred Hermann Fried and Tobias Asser. Being chairman of the local branch of a pacifist movement meant that he was in a dangerous position after Hitler came to power in\n1933\n. Normal expectations were completely overturned for most people and in particular for Rademacher the expectation that he would remain in Breslau vanished. He was certainly racially acceptable to the Nazi regime, but his views were most definitely not acceptable to the Nazis and he was forced out of his professorship in\n1934\n. Of course given his pacifist views he had no wish to remain in Nazi Germany and he left Germany in\n1934\nto take up a Visiting Rockefeller Fellowship at the University of Pennsylvania in the United States. However for a short time between being dismissed from his professorship and leaving for the United States, Rademacher moved with his daughter Karin to a small Baltic town where he met and married Olga Prey. Olga remained in Germany, where their son Peter was born in\n1935\n, while Rademacher held the Visiting Fellowship in the United States.\nHe spent the rest of his life in the United States, at first living at Swarthmore, working at the University of Pennsylvania where he was offered an assistant professorship in\n1935\n. Berndt writes\n[\n5\n]\n:-\nAlthough Rademacher had held a full professorship in Germany for ten years before immigrating to the United States, he was offered only an assistant professorship at Pennsylvania in\n1935\n. Despite this, Rademacher was ever after to remain loyal to the University of Pennsylvania for providing him refuge from the horror that had engulfed his native land.\nHe had briefly returned to Germany after completing his Rockefeller Fellowship and, although he now returned to the United States with his wife, his daughter Karin remained in Germany until\n1947\nwhen he succeeded in helping her come to the United States. In fact\n1947\nwas also the year in which Rademacher's second marriage also ended in divorce.\nRademacher's early arithmetical work dealt with applications of Brun's sieve method and with the\nGoldbach\nproblem in\nalgebraic number fields\n. About\n1928\nhe began research on the topics for which he is best known among mathematicians today, namely his work in connection with questions concerning modular forms and\nanalytic number theory\n. Perhaps his most famous result, obtained in\n1936\nwhen he was in the United States, is his proof of the asymptotic formula for the growth of the partition function\n(\nthe number of representations of a number as a sum of natural numbers\n)\n. This answered questions of\nLeibniz\nand\nEuler\nand followed results obtained by\nHardy\nand\nRamanujan\n. Rademacher also wrote important papers on\nDedekind\nsums and investigated many problems relating to algebraic number fields.\nIn December\n1938\nRademacher was invited to lecture to the\nAmerican Mathematical Society\nand he lectured on\nFourier expansions of modular forms and problems of partition\nwhich surveyed work on modular forms of positive dimension and the resulting formulas for partition functions. Zuckerman writes in a review:-\nA large part of the recent developments were initiated by the author's solution of the problem of unrestricted partitions and many of the results are due either to him or to his direct inspiration.\nThree years later Rademacher was again invited to address the\nAmerican Mathematical Society\nand this time he chose the topic\nTrends in research: the analytic number theory\n. Zuckerman again describes the lecture, explaining how Rademacher discussed:-\n... methods and results in analytic number theory after the work of\nLandau\n,\nHardy\nand\nLittlewood\n. The discussion is arranged in such a way that it brings out two points that are frequently overlooked. The first is that analytic number theory is not restricted to asymptotic formulas and estimates but that it has another side which is concerned with the derivation of identities, the use of group theoretical arguments, etc. The second point is that analytic number theory is not merely a device for proving number theoretical results with the aid of analysis, but that it is really a thorough fusion of analysis and arithmetic in which the main interest is often as much on the analytical part as on the arithmetical part.\nIn addition to the significant contributions to real analysis and\nmeasure theory\nwhich we have briefly mentioned above, he contributed to complex analysis, geometry, and numerical analysis. P T Bateman, reviewing Rademacher's collected works, wrote that they:-\n... serve not only as a fitting memorial to a great mathematician and human being, but also provide excellent examples of how mathematics should be presented, and serve as leisurely but authentic introductions to some fascinating parts of analysis and number theory.\nRademacher was invited to deliver an address to the International Congress of Mathematicians in Cambridge, Massachusetts, in\n1950\n. He lectured on\nAdditive algebraic number theory\n. He also wrote a number of textbooks such as\nLectures on analytic number theory\n(1955)\n,\nLectures on elementary number theory\n(1964)\n,\nDedekind sums\n(1972)\n,\nTopics in analytic number theory\n(1973)\n, and\nHigher mathematics from an elementary point of view\nwhich was only published in\n1983\nbut was based on a series of lectures he delivered at Stanford University in\n1947\n. Apostol, reviewing the book, writes that it:-\n... is a tribute to the author's reputation as a superb expositor and teacher. ... In this remarkable series of lectures the author has taken a number of interesting mathematical threads and woven them into a colorful tapestry.\nWe mentioned above that Rademacher's second marriage ended in divorce in\n1947\nand he moved from Swarthmore to Philadelphia. Two years later he married Irma Wolpe, the sister of his colleague and close friend\nIso Schoenberg\n. Irma was a concert pianist and the Rademacher's home was soon filled with musicians, mathematicians, and other friends. Although he remained at the University of Pennsylvania for the rest of his career, Rademacher did spend time in other places, such as a semester at the Institute for Advanced Study at Princeton in\n1953\n, the Tata Institute of Fundamental Research in Bombay in\n1954\n-\n55\nand also at the University of Göttingen during the same academic year. He spent session\n1960\n-\n61\nagain at the Institute for Advanced Study at Princeton and also spent time at the university of Oregon and at the University of California, spending time both in Berkeley and Los Angeles.\nHe retired from the University of Pennsylvania in\n1962\n, spent the following two years lecturing at New York University, then lecturing at the Rockefeller University until his death. Rademacher  was invited to be Hedrick Lecturer for the summer meeting of the\nMathematical Association of America\nin Boulder, Colorado, in\n1963\n. He prepared a set of notes on\nDedekind\nsums but because of illness was unable to deliver the lectures which were given by Emil Grosswald. Rademacher did not edit his notes for publication before his death but had asked Grosswald to edit them for publication. They appeared as\nDedekind sums\nin the Carus Mathematical Monographs series in\n1972\n. The book\nTopics in analytic number theory\nwas also published after Rademacher's death. He had almost completed the manuscript of the book at the time of his death and Grosswald, Lehner and Newman ensured that the beautiful book would be published.\nBerndt sums up Rademacher's contributions to mathematics\n[\n7\n]\n:-\nRademacher was one of the most influential number theorists of the twentieth century. he influenced the course of mathematics not only through his original research but through his teaching, doctoral students, and books. ... Rademacher's books have continued to be widely read by students and researchers and are models of clarity.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}