{
  "nome_completo": "Hans Arnold Heilbronn",
  "nome_curto": "Hans Heilbronn",
  "ano_nascimento": "1908",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heilbronn/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Toronto, Canada",
  "biografia": "Hans Heilbronn\n's parents were cousins, Gertrud Heilbronn and Alfred Heilbronn. Hans was born into a middle class Jewish-German family. When he was six years old he entered the\nRealgymnasium\nBerlin-Schmargenhof. This school, which he attended for twelve years from\n1914\nto\n1926\n, provided him with a good background in science and modern languages. During his school years he was attracted towards science and mathematics but when he began his university studies in\n1926\nhe still had not made any definite decision to specialise in mathematics. He entered the University of Berlin taking courses from physics, chemistry and mathematics but soon he was specialising more and more in mathematics.\nAs was the custom of German students at this time, Heilbronn moved from one university to another as he progressed through his studies. From Berlin he moved to Freiburg, then he arrived at Göttingen which was the leading mathematics research centre in the world at that time. There Heilbronn began to undertake research in number theory, his studies being directed by\nEdmund Landau\n. By all accounts Heilbronn seems to have participated in the typical student life of that time. In\n[\n3\n]\nit is noted that:-\nIt was only rebels who abhorred duelling - Heilbronn carried a duelling scar from his Göttingen days throughout his life.\nIn\n1930\nHeilbronn was appointed as\nLandau\n's assistant and he continued to work for his doctorate.\nThe problem which Heilbronn worked on for his doctorate was related to a conjecture made by\nBertrand\nin\n1845\n.\nBertrand\nconjectured that there was always at least one prime between\nx\nx\nx\nand\n2\nx\n2x\n2\nx\nfor\nx\n>\n1\nx > 1\nx\n>\n1\n.\nChebyshev\nproved\nBertrand\n's conjecture in\n1850\nand then in\n1930\nHoheisel proved that there exists a\nt\n<\n1\nt < 1\nt\n<\n1\nsuch that for all large\nx\nx\nx\n, there is a prime\np\np\np\nbetween\nx\nx\nx\nand\nx\n+\nx\nt\nx + x^{t}\nx\n+\nx\nt\n. Heilbronn found a simpler proof to that given by Hoheisel and he also proved a stronger result by giving a smaller value of\nt\nt\nt\n. In his thesis Heilbronn also applied his result to primes in an arithmetic progression and to estimates of the sum of the\nMöbius\nfunction.\nThis thesis earned Heilbronn his doctorate in\n1933\nand by the end of that year he had six publications, some of them joint publications with\nLandau\n. These joint publications looked at the Taüberian theorems, giving simpler proofs and also giving applications of the theorems. The authors of\n[\n3\n]\ndescribe Heilbronn's relations with\nLandau\n:-\nBy all accounts\nLandau\nwas a rather formidable man and a demanding task master. Heilbronn seems, however, to have managed very well.\nLandau\ncame to have a very high opinion of him and, judging by letters he wrote on his behalf in\n1933\n, considered him his star pupil. On the other hand, those years with\nLandau\nwere formative ones for Heilbronn. Throughout his life his principal research interest remained with number theory, largely analytic. In the shorter term,\nLandau\nalso clearly exerted an influence on Heilbronn's mathematical style ...\nIt was not only\nLandau\nwho formed a high opinion of Heilbronn.\nDavenport\nvisited Göttingen for the summer months of\n1933\nand was very impressed by him. This was a piece of luck for Heilbronn who realised that he was in an increasingly difficult position in Germany. On\n30\nJanuary\n1933\nHitler had come to power and on\n7\nApril\n1933\nthe Civil Service Law had been passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Heilbronn was dismissed from his position as an Assistant at Göttingen and fled to England, arriving in Cambridge with enough money to support him for around six months.\nOf course Heilbronn was not the only German scientist in this position and an Academic Assistance Council had been set up in Britain to deal with such cases. However, it did not have the necessary funds to help support the academics who were arriving in Britain but nevertheless Heilbronn wrote to them for help explaining:-\nThere is no possibility for me to continue scientific work in Germany.\nThe Academic Assistance Council had already been informed about Heilbronn before he fled from Germany since\nDavenport\nhad written to them in August\n1933\n, after returning from Göttingen, and\nHardy\nhad also written in October of that year.\nMordell\narranged accommodation for Heilbronn in Manchester and asked the Academic Assistance Council if they could provide a small salary. However, the Academic Assistance Council had no funds. Even when Hassé, the Head of Department in Bristol, wrote saying that he had partial support offered by the Jewish community around Bristol to support Heilbronn, the Academic Assistance Council could not make up the difference needed. Members of the Mathematics department in Bristol then agreed to help out and an invitation went to Heilbronn in the middle of December offering him a temporary post at Bristol.\nHeilbronn gladly accepted the offer from the University of Bristol and he spent about eighteen months there. This was a very productive time for Heilbronn who published what turned out to be his most famous result during this time. While at Göttingen, Heilbronn had begun a collaboration with\nE H Linfoot\nand two papers which Heilbronn wrote soon after arriving in Bristol came out of this collaboration. One paper appears under Heilbronn's name alone, the other under the joint authorship of Heilbronn and\nLinfoot\n.\nThe first of the two papers proved a conjecture of\nGauss\non imaginary\nquadratic number fields\nusing ideas of\nHecke\n, Deuring and\nMordell\n. Heilbronn proved the conjecture which asserts that the class number of the\nquadratic number field\nQ\n(\n√\n−\nd\n\\mathbb{Q}(√-d\nQ\n(\n√\n−\nd\n)\ntends to infinity as\nd\nd\nd\ntends to infinity. This was generalised by\nSiegel\nand\nBrauer\n. In the joint paper with\nLinfoot\n, Heilbronn proved that there are at most ten quadratic number fields\nQ\n(\n√\n−\nd\n\\mathbb{Q}(√-d\nQ\n(\n√\n−\nd\n)\nof class number one. Nine such fields, namely those with\nd\nd\nd\n=\n3\n,\n4\n,\n7\n,\n8\n,\n11\n,\n19\n,\n43\n,\n67\n, and\n163\n, had essentially been known since\nEuler\n's time. Heilbronn and\nLinfoot\nshowed that for the tenth\nd\nd\nd\nwould have to be bigger than\n1\n0\n9\n10^{9}\n1\n0\n9\n. In fact Heegner proved in\n1952\nthat this last possible example does not exist. It is worth noting that Heilbronn and\nLinfoot\nremained friends throughout their lives but their interests diverged with\nLinfoot\n's interests turning from number theory to research in optics and astronomy.\nOf course these important results helped Heilbronn obtain further temporary posts in Britain. He moved from Bristol to Manchester when\nMordell\noffered him a two year scholarship near the end of\n1934\n. His stay in Manchester was short, however, since he was offered the Bevan Fellowship in Trinity College, Cambridge, in May\n1935\n. He accepted this offer, mainly made through\nHardy\n's efforts, with pleasure and moved to Cambridge. There he bought a house and his parents and sister came over from Germany to live with him.\nPatrick du Val\ngives a good description of Heilbronn at this time:-\nI met him when he first came to Cambridge ... He was I think rather shy, and not easy to get to know quickly. My mother lived in Cambridge then, and he went to tea with her once while I was abroad ...; she wrote to me quoting Dr Johnson, \"His intellect is as exalted as his stature; I am half afraid of him, yet he is no less amiable than formidable\". This seems to me to give a very good impression of him in those days. After he got his parents and sister out of Germany, and settled them in a house in Chesterton Road, we became very friendly; I was often at their house, and they used to come to ours. His mother was very musical, collected a circle of refugee musicians, and used often to give musical parties; she herself was an excellent pianist. I was at many of these parties; they rather bored Hans, who had no interest in music, but he was present at many of them, as a very correct and attentive host.\nAfter Heilbronn moved to Cambridge he began a collaboration with\nDavenport\nwhich started in\n1936\nand lasted until\nDavenport\n's death in\n1969\n, with Heilbronn publishing further joint papers with\nDavenport\nup to\n1971\n. While at Cambridge he published four papers with\nDavenport\n, and one paper on his own, on\nWaring\n's problem. These deal with writing integers as sums of fourth powers, on sums of two cubes and a square, and on the sum of a prime and a\nk\nk\nk\n-th power. Heilbronn also published results on the\nEpstein\nzeta-function\nshowing that the\nRiemann Hypothesis\nfails for this zeta function.\nIn April\n1939\nHeilbronn applied for British citizenship but he was a few days too late to enable the papers to be processed before the start of World War II. As a contribution to the war effort Heilbronn organised the Trinity College A.R.P. Fire Service. However, he was interned on the Isle of Man in\n1940\nas an enemy alien, something which he greatly resented since nobody could have been more opposed to the Nazis than he was. The Academic Assistance Council,\nHardy\nand others made strong representations on his behalf and he was released after many months of detention. He then served with the British forces with the Signals Corps and Military Intelligence until autumn of\n1945\n.\nThe Bevan Fellowship at Trinity would have ended in\n1940\nand Trinity had already made arrangements to continue to pay his salary. However his internment and subsequent military service put an end to this plan. He returned to Bristol in\n1946\nwhen offered a Readership there. In\n1949\nhe was promoted to Professor and he became Head of the Department of Mathematics. While at Bristol he worked on the\nEuclidean algorithm\n(\nnorm function\n)\nin a general setting having already proved while at Cambridge that there are only finitely many real quadratic fields with a Euclidean algorithm. He examined the existence of a norm function for a broad class of cyclic fields. With\nDavenport\nhe showed that any real indefinite diagonal quadratic form, in\n5\nor more variables, takes arbitrarily small values for nonzero integral arguments. For his outstanding contribution to mathematics, he was elected a Fellow of the\nRoyal Society\nin\n1951\n.\nDuring this period as Head of Department at Bristol Heilbronn was still, according to\ndu Val\n:-\n... rather stiff and formal in external manner ... I have a feeling he wanted to be popular, but found it uphill work.\nHeilbronn was very interested in sport, especially rowing and tennis, and while at Bristol he coached the University Boat Club.\nIn many ways Heilbronn was very successful at Bristol, building up a strong department. The authors of\n[\n3\n]\nwrite:-\n... many other members of the department, notably the number theoreticians, were stimulated by Heilbronn and helped by his active interest in their research. He was always accessible. His manner was most direct and his intellectual honesty did not allow him to pass over in politeness whatever he felt was below standard. But although some may have found him a bit frightening at first acquaintance, he was a kind and modest man, who entirely lacked pomposity or aggressiveness.\nThe situation in British universities began to worry Heilbronn. The Robbins Report proposed opening up university education to a large proportion of young people. The required rapid expansion greatly worried Heilbronn who felt that it was inevitable that such a rapid expansion would bring staff into universities who were below standard. He argued strongly against the proposals both at national level and within his own university. Realising that it was a battle he could never win, he resigned in\n1964\nand moved to North America without having a job. Not long before resigning, Heilbronn married Dorothy Greaves who was a widow whom he had known through a shared interest in bridge since his days in Cambridge.\nAfter a short stay at the California Institute of Technology at Pasadena as guests of\nOlga Taussky-Todd\n, Heilbronn and his wife moved to Toronto where he was appointed to a chair of mathematics at Toronto University. Heilbronn became a Canadian citizen in\n1970\nand spent the rest of his life in Canada, taking an active part national role in mathematics there. He attended the International Congress of Mathematicians in Nice in\n1970\nas a Canadian delegate and presented the official invitation to the delegates to attend the\n1974\nCongress in Vancouver. However, Heilbronn was not able to put as much effort into organising the\n1974\nCongress as he would have liked since he suffered a heart attack in November\n1973\n. He made a good recovery but had to lead a quieter life. His died while undergoing an operation to fit a pacemaker to his heart.\nFinally we should mention that Heilbronn was president of the\nLondon Mathematical Society\nfrom\n1959\nto\n1961\n, and a member of the council of the\nRoyal Society of Canada\nfrom\n1971\nto\n1973\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}