{
  "nome_completo": "Hans Meinhardt",
  "nome_curto": "Hans Meinhardt",
  "ano_nascimento": "1938",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meinhardt/",
  "lugar_nascimento": "Mühlhausen, Thuringia, Germany",
  "lugar_morte": "Tübingen, Germany",
  "biografia": "Hans Meinhardt\nwas only eight months old when World War II broke out. In February\n1946\nthe Yalta Conference met to discuss the dividing up of Germany after the war ended. Already at this time the Soviet Army was in control of Mühlhausen, the city in which Hans was living, and it became part of the German Democratic Republic in\n1949\n. Hans began his school education in Mühlhausen. The country, however, suffered with having to pay reparations to the USSR and there was a steady stream of people emigrating to the West. This led to the erecting of the Berlin Wall in August\n1961\nbut by this time the Meinhardt family had become one that had \"deserted the Republic\", to use a GDR term. The rest of Hans Meinhardt's education was in West Germany.\nMeinhardt attended the University of Heidelberg and the University of Cologne where he studied mathematics and physics. The Institute of Genetics, the first institute at a German university that was exclusively dedicated to research in molecular biology, was opened in\n1962\nand at the opening ceremony\nNiels Bohr\ngave the lecture \"Light and life revisited.\" Meinhardt, a student at Cologne at this time, attended this lecture. He studied β-decay, working at the cyclotron of the\nMax Planck\nInstitute for Nuclear Physics in Heidelberg. He was awarded a Ph.D. by the University of Cologne in\n1966\nfor his thesis on the so-called weak interaction, a force that is involved in β-decay.\nAfter completing his doctorate, Meinhardt was appointed to a\n3\n-year postdoctoral position at the European High Energy Laboratory\n(\nCERN\n)\nin Geneva. He worked on computer based modelling which proved important for his future career, but he felt that overall something was missing from his studies at CERN. He could not investigate the theoretical background or design his own experiments. In the interview\n[\n2\n]\nhe said:-\nAlthough this was an exiting time for me, it was not satisfactory. The experiments were so work-intensive that no time remained to go deeply into the underlying theories. Without a full understanding of the theory, however, the insights I could gain from our experimental results were limited. This lead to my decision to change my field of research. To find a new one, I visited many labs where former colleagues were working. I expected more enthusiasm than I could build up for high-energy physics. To my surprise I found a lot of frustration, even by those who went into biology ...\nHis move into what became his life's work happened in many ways as a piece of good fortune. He explained in\n[\n7\n]\n:-\nIt was more by chance circumstance that I came to Tübingen. There I found a bunch of people who were very enthusiastic about their work. Up to that time, I never heard about hydra or chromatin. I felt these people were bright and enjoyed what they were doing; so it seemed to me a good place to go. In a way, the decision was an irrational one, but one I have not regretted.\nSo after completing his three years as a postdoctoral worker at CERN, in\n1969\nMeinhardt joined the group headed by Alfred Gierer at the\nMax Planck\nInstitute for Virus Research in Tübingen, Germany. This Institute has now changed its name and is today known as the\nMax Planck\nInstitute for Developmental Biology. Meinhardt's first task at this Institute was an experimental one but again Meinhardt found experimental work not to his liking and looked for a theoretical project. After attending a seminar, Meinhardt thought he could make use of his skills in computer modelling to simulate the experimental ideas presented in the seminar. Approaching Gierer with his ideas, he received a very positive response but Gierer came up with another idea, namely using computer modelling to develop a theory explaining the regenerative capabilities of Hydra which were little understood. The approach that Meinhardt adopted is explained by him in\n[\n5\n]\n:-\nIn many branches of sciences, a precise mathematical description is a key to obtain a consistent understanding of the underlying principles. The complexity of the development of a higher organism seems to preclude such an approach in this discipline. However, recently it was shown that basic types of the molecular interaction allowing pattern formation can be described by sets of coupled partial differential equations. They allow computer simulations that mimic the observation rather precisely. Meanwhile these theories found direct support by observation on the molecular-genetic level.\nIt is important at this stage to stress that around\n1970\ncomputer modelling was a major challenge since computers were in a very primitive form\n(\nby today's standards\n)\nand only available at certain institutions. No biological institute would have had a computer and certainly there was none in the Tübingen Institute. The University of Tübingen, however, had a computer centre with a\nHollerith\nmachine operated by punch cards, and Meinhardt was able to make use of this machine. The result of this work was presented in the fundamental paper\nA theory of biological pattern formation\nwritten by Gierer and Meinhardt and published in\n1972\n. The authors write in the Abstract:-\nCalculations by computer are presented to exemplify the main features of the theory proposed. The theory is applied to quantitative data on hydra - a suitable one-dimensional model for pattern formation - and is shown to account for activation and inhibition of secondary head formation.\nMeinhardt continued to develop these models and in\n1982\npublished the book\nModels of Biological Pattern Formation\n. He writes in the Preface:-\nThe question of how development is controlled is one of the challenging problems of biology today. Many fine experiments have provided inroads into this question. However, with all this effort, the underlying mechanisms remain obscure. Many different interactions between molecules, between cells and between tissues are surely involved in the process of development. Our intuition as to how such multicomponent systems behave can be very misleading. The understanding of other complex systems, ranging from problems in economics to engineering, has been greatly advanced by the use of precise mathematical models. The properties of these models are studied by analytical considerations as well as by computer simulations and are then refined by comparison with the properties of the real system. In this book, general classes of molecular interactions that lead to biological pattern are presented along with detailed modelling of particular developmental systems. It will be shown that a relatively simple set of interactions can explain seemingly complex experimental observations in a quantitative manner. It is hoped that these theories will provide a framework for further experimental investigations and allow insights facilitating future biochemical studies.\nThe review\n[\n3\n]\ngives additional useful information:-\nKinetic theory has dealt mainly with the interplay of an autocatalytic and slowly diffusing activator with a rapidly diffusing inhibitor, which was hypothesised over\n30\nyears ago by\nTuring\nto be \"the chemical basis of morphogenesis.\" More recent elaborations, retaining this concept, have replaced\nTuring\n's linear equations with more complex nonlinear ones. These are more realistic, especially in that they allow patterns of chemical substances to settle into steady states rather than growing forever in exponential fashion. Among these models, that of Gierer and Meinhardt, first published about a decade ago, has accounted with notable success for Hydra regeneration and response to grafting and for effects of damage in early insect embryogenesis. Meinhardt's book is principally a detailed account of the correlation of this model with a wide variety of experimental phenomena. His continual stress on putting theory and experiment together is especially welcome in a field in which the theoreticians seem often to communicate only with each other and in which the theories are unproved.\nMeinhardt's second book was\nThe Algorithmic Beauty of Sea Shells: The Virtual Laboratory\n(1995)\n. He explains in the Preface how he became interested in shell patterns:-\nMy interest in these patterns began at a dinner in an Italian restaurant. During the meal I found a shell with a pattern consisting of red lines arranged like nested W's. Since I had been working on the problem of biological pattern formation for a long time. this pattern caught my interest, more out of curiosity. To my surprise it seemed that the mathematical models we had developed to describe elementary steps in the development of higher organisms were also able to account for the red lines on my shell. Thus, the shell patterning appeared to be yet another realisation of a general pattern-forming principle.\nThe whole problem was, however, a much more complex one than it had first appeared. He describes how the patterns form in the Preface:-\nThe pigment patterns on tropical shells are of great beauty and diversity. Their mixture of regularity and irregularity is fascinating. A particular pattern seems to follow particular rules but these rules allow variations. No two shells are identical. The motionless patterns appear to be static, and, indeed, they consist of calcified material. However, as will be shown in this book, the underlying mechanism that generates this beauty is eminently dynamic. It has much in common with other dynamic systems that generate patterns, such as a wind-sand system that forms large dunes, or rain and erosion that form complex ramified river systems. On other shells the underlying mechanism has much in common with waves such as those commonly observed in the spread of an epidemic. A mollusk can only enlarge its shell at the shell margin. In most cases, only at this margin are new elements of the pigmentation pattern added. Therefore, the shell pattern preserves the record of a process that took place over time in a narrow zone at the growing edge. A certain point on the shell represents a certain moment in its history. Like a time machine one can go into the past or the future just by turning the shell back and forth. Having this complete historical record opens the possibility of decoding the generic principles behind this beauty.\nThe mathematical approach adopted by Meinhardt was remarkably powerful and led to many fascinating discoveries but it was not without its difficulties as he explained in\n[\n2\n]\n:-\nWhy do models have only a limited reputation? My own experience is that experimentalists are not very enthusiastic if it turns out that a process was correctly predicted. They worked hard to find the basic principles by themselves. Frequently the prediction is then handled more as a speculation, if not completely ignored. This is very different to the habit in physics where an experimental observation would be in no way diminished if it is preceded by a theoretical prediction, on the contrary.\nThe reception of some of my models had a strange history. First they were regarded as unrealistic or misleading: \"cannot be\". More or less abruptly this changed later into: \"that is trivial, how else should it be?\". This switch had different time constants in different communities. Both attitudes provide the freedom to ignore the theoretical work. Many biologists are presumably afraid of any mathematics and stop reading a paper after the first equation is encountered. Thus, equations are better put 'in quarantine', into an appendix or into supplementary material if the paper should appear in an experimentally oriented journal. This is a pity since an equation unambiguously shows within a few lines what the hypothesis really is. Moreover, they allow a verification of whether a proposed mechanism is free of internal contradictions and whether it has the postulated dynamic properties. Thus, educating students so that they can later approach and appreciate an equation without fear would be most helpful.\nTheorists too have contributed to scepticism against theories. Frequently, new models list only what can be accounted for, but ignore phenomena which are difficult to integrate. The preconditions required for a model to work at all are frequently not discussed. Opaque mathematical treatments of particular aspects sometimes hide more than they elucidate. Often, new theories draw little attention to what preceding theories have achieved and where the differences are. This has had the consequence that the experimentally working community does not listen to the theorists, since they do not listen to each other. A major problem in this respect is that modellers usually came from other fields such as mathematics or physics\n(\nas I do\n)\n. Due to the explosion of experimental facts, it is now increasingly difficult for them to obtain a profound overview of the experimental results. Usually experimentalists are very happy to find an error in the assumptions to have a good excuse to ignore the theory.\nMeinhardt retired in\n2003\nbut, like so many research scientists, he continued to work on a variety of projects. In fact he published more than\n20\npapers after his retirement, and was in the middle of a project when he died at the age of\n77\n. He was married to the psychotherapist Edeltraud Putz who, after her marriage was known as Edeltraud Putz-Meinhardt.\nLet us end this biography by quoting from\n[\n6\n]\nregarding his interests and character:-\nMeinhardt was known for riding his bicycle up the large hill to the\nMax Planck\nInstitute every day, even after he retired. He was an ardent traveler and loved the desert, but was similarly fascinated by the local nature around him, discovering new facets in the old and gaining inspiration for his scientific questions. Much of his work was based on intuition that he then tested with computer simulations. His goal was to find organising principles, to understand the logic of patterning systems despite apparent complexity, and to develop minimal models with predictive power. Hans Meinhardt was a happy and dedicated scientist. He spoke softly, and his steel-blue eyes were always full of contagious enthusiasm for his work. Once convinced of a certain strategy, he was stubborn and insisted on his theories, but he could also adjust his models based on new experimental findings. His contributions inspired new generations of biologists to find beauty in algorithms and apply them to the study of life. As Hans was fond of saying: \"So wird's gemacht\" - that's how it's done.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Logic"
  ]
}