{
  "nome_completo": "Hans Julius Zassenhaus",
  "nome_curto": "Hans Zassenhaus",
  "ano_nascimento": "1912",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zassenhaus/",
  "lugar_nascimento": "Koblenz-Moselweiss, Germany",
  "lugar_morte": "Columbus, Ohio, USA",
  "biografia": "Hans Zassenhaus\n's parents were Julius Zassenhaus and Margarete E F Ziegler. Julius Zassenhaus was a historian who was the principal of a girls'\ngymnasium\n. He wrote an anthology on the history of Christianity and also had taught and written about Albert Schweitzer's \"reverence for life\". He wrote the\n3\n-part work,\nEvangelisches Religionsbuch für höhere Schulen\nⓉ\n(\nEvangelical Christian book for secondary schools\n)\npublished in\n1929\n-\n30\n. Julius and Margarete had four children, sons Hans, Guenther and Willfried, and the youngest member of the family was a daughter Hiltgunt born in\n1916\n. Hiltgunt wrote of her mother\n[\n3\n]\n:-\nMy mother was a very special person, I don't think anyone who knew her will ever forget her. You may think this is the blind adoration of a daughter, but it is not. She helped to shape the lives of many people by her example and her kindness.\nHans spent the first four years of his life in Koblenz-Moselweiss before the family moved to Hamburg in\n1916\n. His secondary education was at two schools in Hamburg, graduating from the Lichtwarkschule in\n1930\n. The Lichtwarkschule\n(\nfounded in\n1914\nand named after Alfred Lichtwark\n)\nwas a reformist educational school in the Hamburg-Winterhude district. The headmaster was Heinrich Landahl from\n1926\n. After graduating from this school, Hans entered the University of Hamburg in the autumn of\n1930\n. At first he studied mathematics and physics with the intention of specialising in atomic physics. However he had fine mathematics teachers in\nEmil Artin\nand\nErich Hecke\nand, particularly\nArtin\n, inspired him to undertake research in mathematics. Zassenhaus studied for his doctorate under\nArtin\n's supervision. During this time he proved the Zassenhaus\n(\nbutterfly\n)\nlemma, a beautiful result on\nsubgroups\nwhich can be used to give a simple, and very beautiful, proof of the\nJordan\n-\nHölder\ntheorem. He published this in the\n3\n-page paper\nZum Satz von Jordan-Hölder-Schreier\nⓉ\n(\nThe theorem of Jordan-Holder-Schreier\n)\n(1934)\n. However, these years were extremely difficult ones for the Zassenhaus family for two reasons.\nThe first problem was that Adolf Hitler came to power in\n1933\n. Hiltgunt described the Zassenhaus family's first encounter with the Nazis\n[\n3\n]\n:-\nOne morning in winter I awoke, and I could see no sky through my window. The room had a dim, yellowish, almost sulfur-like light. The window glass was covered with thick, yellow paper, printed over and over with swastikas. Overnight our house had been dimmed by unknown Nazi hands. This was in Hamburg, Germany,\n30\nJanuary\n1933\n. Adolf Hitler had come to power. Two SS men came the same day and asked for my father. As he was sick at that time, they let him stay ... That day he said, \"From now on our house will be a fortress, where we will live and think as we did before.\" My mother added, \"It will last only a few months.\" It lasted twelve years.\nThe second problem for the Zassenhaus family was the deterioration in Julius Zassenhaus's health. Julius had contracted influenza in the epidemic of\n1918\nand, although he had recovered, this had undermined his health. As the above quote indicates, he was sick in January\n1933\nand his doctor, Dr Stromberger, diagnosed the slowly worsening illness to be Parkinson's Disease. Soon, he had to resign his position as school principal. By\n1933\nall four Zassenhaus children were at Hamburg University, Hans was working on his doctoral dissertation, Guenther and Willfried were studying medicine and Hiltgunt began studying Scandinavian languages. Hiltgunt wrote\n[\n3\n]\n:-\nIn Germany a new law had been passed: only students who participated in Nazi activities would get scholarships. That left us out. We began to wonder how we would manage to pay our tuition. Together we made an all-out effort. Expenses were cut to a minimum. There was meat only once a week, and when my mother had divided it into six equal portions, the plate seemed rather empty, but less expensive food would do. We moved into a much smaller house\n[\nin the Lyserstrasse\n]\n. Fortunately, it still had a room for each of us, even if there was a space for only a bed and a chair and a table.\nThe Nazis burned books in bonfires throughout the city, books such as those Julius Zassenhaus had written\n[\n3\n]\n:-\n... containing the very ideas and thoughts which had governed our lives until then. More than the flames I remembered the fanatic stare in the eyes of the men who had burned them.\nDespite all the turmoil in his life, Hans Zassenhaus completed his doctoral dissertation\nKennzeichnung endlicher linearer Gruppen als Permutationsgruppen\nⓉ\n(\nIdentification of finite linear groups of permutations\n)\non\n28\nJuly\n1934\n. In it he considered\npermutation groups\nwhose elements are determined by the images of three points. These groups are called Zassenhaus groups today. In his dissertation Zassenhaus classified all\n3\n-fold transitive Zassenhaus groups. These groups play an important role in the classification of finite\nsimple groups\ncoordinated by\nDaniel Gorenstein\n.\nFrom\n1934\nto\n1936\nZassenhaus worked at the University of Rostock and wrote his famous group theory text\nLehrbuch der Gruppentheorie\nⓉ\n(\nTextbook on group theory\n)\n(1937)\nbased on\nArtin\n's lectures at Hamburg.\nPhilip Hall\nreviewed the book\n[\n7\n]\n:-\nAnyone opening this slender book expecting merely to find an account of the more elementary and standard parts of the subject will be speedily disillusioned. Although the volume before us is only the first part of an extended treatise, it already takes the reader from the foundations right through to some of the most important advances of the last few years, results which now find their place in a textbook for the first time. To have compressed so much material, both new and old, into so small a space is indeed a remarkable feat. And it may be that the economy of the style will make some parts of the book not altogether easy reading. But probably the main credit for this high \" specific content \" is due to the systematic grouping of the exposition around the central notion of a homomorphic correspondence. This is an arrangement which not only lends the book a close-knit logical structure: it also serves to correct the impression which group theory sometimes gives of being a sequence of beautiful theorems having little to do with one another. Such an impression could scarcely survive a reading of this volume. Both as regards originality of treatment and thorough modernity of outlook, this promises to be when complete a contribution of first-rate importance to the literature of the subject, and one which all serious students of groups will wish to possess. ... Herr Zassenhaus has rendered a most valuable service to all who are interested in this subject, and we shall await the publication of the later volumes with impatience.\nZassenhaus became\nArtin\n's assistant at Hamburg in\n1936\n. His\nhabilitation\nthesis of\n1938\nstudied\nLie rings\nof prime characteristic. It was published as\nÜber Liesche Ringe mit Primzahlcharakteristik\nⓉ\n(\nOn Lie rings of prime characteristic\n)\n(1939)\n. Zassenhaus found that a normal academic career was made impossible for him because of his intense dislike of the Nazi party. We give an example of how he behaved during the war.\nHorst Tietz\nwas expelled from Hamburg University by the Nazis. He asked\nErich Hecke\nwhat he should do\n[\n1\n]\n:-\nHecke\nsaid that naturally\nTietz\nshould come secretly to his mathematical lectures, also those of Hans Zassenhaus ...\nTietz\nwas somewhat afraid of Zassenhaus, who always wore the insignia of a Nazi organisation, but Hecke calmed him by saying that Zassenhaus was their trusted agent who behaved in a politically correct manner so as to protect them. This in fact happened in\n1942\n, when somehow\nTietz\n's presence as a secret student at the university became known and a denunciation was threatened: Zassenhaus warned\nTietz\n, and\nHecke\nimmediately cancelled the class, giving back the student fees. In fact,\nTietz\nonly discovered much later that Zassenhaus was connected with a resistance effort that helped hide endangered people.\nHiltgunt wrote about these years\n[\n3\n]\n:-\nWe had learned to fear the ringing of the doorbell after dark. Friends had disappeared, picked up in their homes by the Gestapo in the middle of the night. They had not returned, but we had seen the letters from the Gestapo - form letters, informing the families that death had ensued due to a \"sudden illness.\" We knew better and - though later it would be denied - many knew. There was a concentration camp on the outskirts of Hamburg. High walls topped with barbed wire surrounded it, but the screams could still be heard. ... One day, quite by accident, I learned that my mother was helping Jewish friends. I'd noticed that at times she went away for days, and that she sometimes looked very pale and exceedingly tired. My father had told us that we must help mother as much as we could, but I did not understand why.\nThe teaching Zassenhaus did at Hamburg University after\n1940\nwas unofficial, he had to join the Nazi party if he was to keep his position and Zassenhaus was not prepared to do this. He resigned and joined the navy, working on weather forecasting during the remainder of World War II. He married to Lieselotte Lohmann\n(28\nMay\n1914\n-\n20\nMarch\n2006)\nin\n1942\n; they had three children, Michael, Angela and Peter. When he was offered the chair of mathematics at Bonn in\n1943\nhe requested that he be allowed to postpone a decision until the end of the war. After the war he did not accept the Bonn post, preferring that it went to someone who had lost their chair under the Nazis. After the war, he became chairman of the department at Hamburg, spending session\n1948\n-\n49\nat Glasgow in Scotland. Then, in\n1949\n, he accepted a chair of mathematics in Montreal, Canada. Although he visited many other universities during the next\n10\nyears, he remained in the post at Montreal until he moved to the University of Notre Dame in\n1959\nwhere he was appointed Peter Redpath Professor. He also served as director of the university Computing Center. He was Mershon Visiting Professor at The Ohio State University during the academic year\n1963\n-\n64\n, then, at the end of his visit, he accepted the post of research professor at Ohio State University and held this position until he retired. During these years he held a number of visiting positions:\nGauss\nProfessor at Göttingen University, visiting professor at Heidelberg University, visiting professor at the University of California at Los Angeles, and visiting professor at Warwick University\n(\nwhere I\n[\nEFR\n]\nwas fortunate enough to meet him for the first time\n)\n.\nWe have mentioned his work in group theory and\nLie\nrings above. The work on\nLie\nrings extended to\nLie algebras\nand he developed computational methods for studying them. In a long series of papers he applied\nLie\nalgebras to problems of theoretical physics. He wrote up his lectures on\nLie\ntheory as\nLie groups, Lie algebras and representation theory\n(1981)\n. Here are the chapter headings:\n1\n. Survey of the classical theory of\nLie groups\nand Lie algebras of finite dimension over the real number field.\n2\n. Continuous groups.\n3\n. General\nrepresentation theory\n.\n4\n. Representation theory of Lie algebras of zero characteristic.\n5\n. Reflection groups and the classification of semisimple Lie algebras of zero characteristic.\nHis work on computational\nalgebraic number theory\nseems to have started when he visited Caltec in\n1959\nand collaborated with\nOlga Taussky-Todd\n. They published joint papers such as\nOn the semigroup of ideal classes in an order of an algebraic number field\n(1961)\n,\nOn the theory of orders, in particular on the semigroup of ideal classes and genera of an order in an algebraic number field\n(1962)\nand\nOn the\n1\n-cohomology of the general and special linear groups\n(1970)\n. He put forward a programme to develop methods for computational number theory which, given an\nalgebraic number field\n, involved calculating its\nGalois group\n, an integral basis, the unit group and the class group. He contributed himself in a major way to all four of these tasks. In collaboration with Michael Pohst, he published a number of papers on computational\nnumber theory\nand also the book\nAlgorithmic algebraic number theory\n(1989)\n. The authors write in the Preface:-\nThis book is a step in a new direction: to modify existing theory from a constructive point of view and to stimulate readers to make their own computational experiments. We are thoroughly convinced that their observations will help to build a new basis from which to venture into new theory on algebraic numbers. History shows that in the long run, number theory always followed a cyclic movement from theory to construction to experiment to conjecture to theory. Consequently, this book is addressed to all lovers of number theory. On the one hand, it gives a comprehensive introduction to\n(\nconstructive\n)\nalgebraic number theory and is therefore especially suited as a textbook for a course on that subject. On the other hand, many parts go beyond an introduction and make the user familiar with recent research in the field.\nCharles Parry writes in a review:-\nFew, including experts in the subject, will find this book light reading. However, with increasing emphasis on computational aspects of number theory, it fills a void in the literature.\nZassenhaus worked on a broad range of topics and, in addition to those mentioned above, he worked on nearfields, the theory of orders, representation theory, the geometry of numbers and the history of mathematics. He loved teaching and wrote several articles on the topic such as\nThe concept of depth in teacher training\n(1963)\nand\nOn the teaching of algebra at the pre-college level\n(1975)\n. The authors of\n[\n12\n]\nwrite:-\nUnder his leadership, 'The Journal of Number Theory' was established at Ohio State in\n1969\n. Professor Zassenhaus took a profound interest in teaching of mathematics at all levels. He directed a large number of Ph.D. dissertations, twenty at Ohio State. He was very kind to his students and was most generous in sharing his time and creative ideas. Each summer, for several years, he taught a selected group of gifted high school students.\nIn\n1982\n, Zassenhaus retired but continued to be associated with Ohio State University. He continued to direct the thesis studies of students and remained an active researcher, publishing around\n40\npublications in his retirement. The last time I\n[\nEFR\n]\nmet Zassenhaus was at the 'Computational group theory' Special Section of the\nAmerican Mathematical Society\nMeeting held in Phoenix, United States, in January\n1989\n. This was also the last time I heard him lecture.\nHe received many honours for his outstanding contributions. He received the Lester Ford Prize from the\nMathematical Association of America\nand was elected a fellow of the\nRoyal Society of Canada\n. He was a Distinguished Fairchild Scholar at the California Institute of Technology\n(1974\n-\n75)\n, received the Distinguished American Scientist Award from the Alexander von Humboldt Foundation, was named Sesquicentennial University Professor at Montreal University and received the Distinguished Research Award from The Ohio State University. He was awarded honorary degrees by Ottawa University, McGill University, University of Saarbrucken and Rostock University.\nZassenhaus, who was a member of the First English Lutheran Church in Columbus, died in the Hospice of Columbus. His funeral service was held in the Rutherford-Corbin Chapel in Worthington.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}