{
  "nome_completo": "Hans Rohrbach",
  "nome_curto": "Hans Rohrbach",
  "ano_nascimento": "1903",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rohrbach/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Bischofsheim an der Rhon, Germany",
  "biografia": "We should first comment about\nHans Rohrbach\n's name. He himself always used the name Hans Rohrbach but one source gives his full name as Hans Joachim Albert Rohrbach while\nBernhard Neumann\nsaid that he believed his full name was Hans Wolfgang Rohrbach and he was certain his middle initial was W. Amid this confusion we have decided to simply give his name as Hans Rohrbach. His parents, Paul Rohrbach and his wife Clara Müller, were married in Berlin in\n1897\n. Paul Rohrbach, whose full name was Karl Albert Paul Rohrbach, was born on\n29\nJune\n1869\n. He studied history, geography and theology at Dorpat, Berlin and Strasbourg. He became a Protestant theologian, political publicist, administrator and travel writer. From\n1903\nto\n1906\nhe served in the colonial service in German South West Africa working as a Commissioner. He returned to Berlin in\n1906\nand became a lecturer in colonial economy at the School of Economics.\nHans entered the\nGymnasium\nof Berlin-Friedenau in the autumn of\n1909\nand continued his education there until the autumn of\n1917\n. Germany was involved in World War I from\n1914\nto\n1918\nand during this time his father worked in the Foreign Office where he distinguished himself as a spokesman of an anti-Russian policy. He gained more influence for his policies in\n1917\nwhen the Russian Revolution broke out. After leaving the Gymnasium of Berlin-Friedenau in the autumn of\n1917\n, Hans entered the Fichte Gymnasium in Berlin-Wilmersdorf. He took the school leaving examination in the autumn of\n1921\nand, in that year, entered the Friedrich-Wilhelm University of Berlin. There he studied mathematics, physics and philosophy for two years. The first course he took was\nGeorg Feigl\n's lecture course 'Introduction to Higher Mathematics'. Thirty years later, Rohrbach edited the publication of\nFeigl\n's lecture course and wrote an introduction that you can read at\nTHIS LINK\n.\nLater, Rohrbach was taught by some outstanding mathematicians including\nErhard Schmidt\n,\nIssai Schur\n, and\nLudwig Bieberbach\n.\nIn the winter of\n1923\nRohrbach went with his father on a visit to the United States. Rohrbach was, at this time, head of the Berlin student organisation Mathematisch-Physikalische Arbeitsgemeinscaft. Germany was suffering the most horrific economic problems with hyperinflation making daily living extremely difficult. Rohrbach called his visit a \"propaganda trip\" and he travelled round American Universities trying to collect money for Berlin students. At this time \"working students\" who financed their studies by taking on paid work in parallel to their studies were becoming increasingly common. In the autumn of\n1924\n, Rohrbach took up his studies again at the University of Berlin and was enrolled there until\n1929\n. From autumn\n1927\nto March\n1929\nhe was an Under-Assistant at the Mathematical Seminar, and from April\n1929\nhe worked there as an Assistant.\nDuring his studies at Berlin, Rohrbach attended lectures, exercise classes and seminars by many leading mathematicians whom he names in his doctoral thesis as:\nLudwig Bieberbach\n, Eugen Blasius, Max Dessoir,\nGeorg Feigl\n,\nHeinz Hopf\n, Wolfgang Köhler, Max von Laue,\nKarl Löwner\n,\nRichard von Mises\n,\nMax Planck\n,\nHans Rademacher\n, Heinrich Rubens, Wilhelm Schlenk,\nErhard Schmidt\n,\nIssai Schur\n,\nGabor Szegő\n, Arthur Wehnelt, and Wilhelm Westphal. He writes:-\nAll my revered teachers, especially Professors\nLudwig Bieberbach\n,\nRichard von Mises\n,\nErhard Schmidt\n, and\nIssai Schur\n, I would like to thank at this point.\nRohrbach undertook research for his thesis advised by\nIssai Schur\nand, after submitting his thesis\nDie Charaktere der binären Kongruenz-Gruppen Mod\np\n2\np^{2}\np\n2\nⓉ\n(\nThe characters of the binary congruence groups mod p\n2\n)\n, he was awarded his doctorate on\n25\nJuly\n1932\n. Before submitting his thesis, he published the paper\nBemerkungen zu einem Determinantensatz von Minkowski\nⓉ\n(\nRemarks on a set of determinants due to Minkowski\n)\nin\n1931\n. He also published a number of solutions to problems: his solution to Problem\n66\nfrom the\nJahresbericht\nⓉ\n(\nAnnual Report\n)\nof the\nGerman Mathematical Society\nappeared in\n1930\n, his solution to Problem\n84\nin\n1932\n, his solution to Problem\n89\nin\n1932\nand, shortly after, he published a remark on this Problem\n89\n. The oral examination for his thesis, conducted by\nErhard Schmidt\nand\nIssai Schur\n, was held on\n12\nMay\n1932\n.\nWhile studying at the University of Berlin, Rohrbach had met a student Rose Gadebusch\n(\nborn\n1905)\nwho began her studies of mathematics in\n1925\n. Like Rohrbach, Rose Gadebusch took a major role in the Mathematisch-Physikalische Arbeitsgemeinscaft while she was a student. After graduating, Rose became a mathematics teacher at a Women's Gymnasium. Hans Rohrbach married Rose Gadebusch\n(\nwe have not been able to determine the exact date of their marriage but indirect evidence suggests that it was in\n1932)\n.\nIn\n1936\nRohrbach was appointed as a senior assistant at the University of Göttingen. He\nhabilitated\nat Göttingen in\n1937\nand he published a number of papers on number theory including a major\n30\n-page paper in\n1936\nand three further papers in\n1937\n. You can see a list of these and all other mathematical publications by Rohrbach at\nTHIS LINK\n.\nLet us now describe a puzzle that Rohrbach introduced in\n1937\nthat has been the source of much interest and research ever since. The puzzle is a variant on\nJames Joseph Sylvester\n's stamp puzzle:-\nI have a large number of stamps to the value of\n5\nd and\n17\nd only. What is the largest denomination which I cannot make up with a combination of these two different values.\nRohrbach asked a related problem in his paper\nEin Beitrag zur additiven Zahlentheorie\nⓉ\n(\nA Contribution to the additive number theory\n)\n(1937)\nbut one which is much more difficult to answer\n[\n3\n]\n:-\nAn envelope may carry no more than\nh\nh\nh\nstamps, and one has available\nk\nk\nk\ninteger-valued stamp denominations. Given\nh\nh\nh\nand\nk\nk\nk\n, find the maximal integer\nn\n=\nn\n(\nh\n,\nk\n)\nn = n(h, k)\nn\n=\nn\n(\nh\n,\nk\n)\nsuch that all integer postage values from\n1\nto\nn\nn\nn\ncan be made up. In addition, find all sets of\nk\nk\nk\nstamp denominations satisfying this condition. The problem statement is usually modified by augmenting the solution sets with a stamp of value zero, and requiring that a letter carry exactly\nh\nh\nh\nstamps.\nHere are some examples.\nn\n(\n2\n,\n3\n)\n=\n8\nn(2, 3) = 8\nn\n(\n2\n,\n3\n)\n=\n8\nwith the unique solution set {\n0\n,\n1\n,\n3\n,\n4\n}.\nn\n(\n2\n,\n6\n)\n=\n20\nn(2, 6) = 20\nn\n(\n2\n,\n6\n)\n=\n2\n0\nwith five solution sets {\n0\n,\n1\n,\n2\n,\n5\n,\n8\n,\n9\n,\n10\n}, {\n0\n,\n1\n,\n3\n,\n4\n,\n8\n,\n9\n,\n11\n}, {\n0\n,\n1\n,\n3\n,\n4\n,\n9\n,\n11\n,\n16\n}, {\n0\n,\n1\n,\n3\n,\n5\n,\n6\n,\n13\n,\n14\n}, and {\n0\n,\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n10\n}.\nn\n(\n3\n,\n4\n)\n=\n24\nn(3, 4) = 24\nn\n(\n3\n,\n4\n)\n=\n2\n4\nwith one solution set being {\n0\n,\n1\n,\n4\n,\n7\n,\n8\n}.\nIn the\n1937\npaper just quoted, Rohrbach finds asymptotic bounds for\nn\nn\nn\nwith\nh\nh\nh\nfixed and\nk\nk\nk\nlarge. Many mathematicians have looked at this problem, Rohrbach's bounds have been improved but, in general, the problem is far from being solved.\nOn\n1\nApril\n1938\nhe was appointed as a senior assistant at the Mathematical Institute of the German University of Prague. In\n1941\nhe was promoted to extraordinary professor and in\n1942\nhe became an ordinary professor at the German University of Prague. He also served as Director of the Mathematical Institute of the German University of Prague. In that capacity, in October\n1944\nhe wrote a report on the Development of the Mathematical Institute. He wrote:-\nI am taking the move of the Mathematical Institute into the recently completed new rooms as an opportunity to give a short report on the development of the Institute in the last year. Up to the end of\n1943\nno research work was carried out in the Institute. The two established professors had been assigned to war work but, in addition, continued to carry out their teaching duties. The assistant had been drafted into the army, and no additional mathematicians were available. However, since I arrived here, I have made efforts to have the Institute itself to be involved in war related research. To achieve this I required more space and more collaborators. Once my requests to enlarge the Institute were granted in a satisfactory way by the curator, the work of setting up began a year ago.\nYou can read Rohrbach's full report at\nTHIS LINK\n.\nThe war work that Rohrbach undertook in the Mathematical Institute was related to computational problems associated with the manufacture of V-weapons at Peenemünde. Peenemünde was a village in north east Germany, at the north west end of Usedom Island where the Peene River flows into the Baltic Sea. It was where Germany undertook research and testing for missiles, called V-weapons, which eventually were fired at England. Rohrbach set up a work group of young girls who were in their final years at a Gymnasium and trained them to carry out mathematical and statistical computations. The girls certainly preferred this type of war work to the hard physical work in a munitions factory. He also managed to have several mathematicians join his group in Prague. Friedrich Bauer writes\n(\nsee\n[\n2\n]\n)\n:-\nI do not know what Rohrbach's group in Prague calculated. ... In my estimation of Rohrbach's character, the activity of the computing group could have been a\n[\nfacade\n]\nfor the rescue of human lives. ... I have treasured Rohrbach's human traits greatly, even if his missionary concerns got on my nerves.\nWe will discuss Rohrbach's \"missionary concerns\" towards the end of this article. One of the men that Rohrbach \"rescued\" with his computing group was\nErnst Mohr\n, and later it was Rohrbach's skilful diplomacy that saved\nMohr\nafter he had been sentenced to death by the Peoples' Court on\n24\nOctober\n1944\n. Rohrbach's assistants Franz Krammer and Paul Armsen were also \"rescued\" by Rohrbach. Krammer had been rescued in May\n1944\nin, he wrote, \"for me a wonderful action\n[\nby Rohrbach\n]\n\", from the disintegrating eastern front. Armsen was appointed by Rohrbach first as his assistant, later as a special lecturer.\nRohrbach, however, had another role in Germany's war effort, namely working at a cryptologist for the Foreign Office in Berlin. In the October\n1944\nreport from which we quoted above, Rohrbach explains that he cannot give his full attention to the Mathematical Institute of the German University of Prague because of his commitments in Berlin. Here is his own description of how he split his time between these two tasks in the months that followed the report:-\nI had concluded my activity there\n[\nPrague\n]\nfor the winter semester\n1944\n-\n45\n[\nat the end of February\n]\nand was in Berlin, where during the war I was busy full time at the Foreign Office. I looked after the work in Prague for only two days in the week during the semester, travelling there at night in a sleeper coach, two night later back in a sleeper coach, thus working four days a week in Berlin, two days in Prague. During the vacations I was busy only in Berlin. I intended to return to Prague for the summer semester\n1945\n[\nat the end of April\n]\n. I had as always left everything personal behind in the Institute, in particular books, lecture manuscripts, etc. But at the beginning of April\n1945\nI was already in the store of the Foreign Office in Thuringia.\nAfter the war ended, in\n1948\nRohrbach published a paper in two parts entitled\nMathematische und Maschinelle Methoden bei Chiffrieren und Deschiffrieren\nⓉ\n(\nMathematical and automated methods in encryption and decryption\n)\n. These were translated into English and published as\n[\n4\n]\nand\n[\n5\n]\nin\n1978\n. Here is Rohrbach's introduction to the paper:-\nIn this report we are dealing with a field of applied mathematics which has been foreign to most mathematicians and on which practically nothing has been published up to now. Methods and results have generally been left in secrecy, existing largely in the minds of the people involved. For these reasons we must go into the basic concepts and principles of this field rather thoroughly. Further, we cannot expect this report, as a first approach, to be exhaustive. The written materials needed for a foundation, including in particular the only publication to my knowledge of the character of a scientific journal\n(\nScientific papers of the Dahlem Special Service, published by the Foreign Office, Berlin,\n1940\n-\n45)\n, either have been destroyed or have been retained by the Allies; the workers concerned are known to me only in small part or cannot be contacted. Accordingly, I can bring only scattered examples to the best of my memory. They come largely from the work of the Foreign Office, the Department of Defense\n(\nOKW\n)\n, and the Department of the Army\n(\nOKH\n)\n. By agreement with those workers that I have been able to contact, I will not give any names - it's a chance selection at best. Naturally much more work in this field has been done in Germany than I am able to take into consideration here, for the reasons already given. It seems to me at least, as will be brought out sufficiently in the material that follows, that mathematical cryptology is a very attractive field of applied mathematics. With good reason have all larger nations selected mathematicians for special use, particularly for use in cryptanalysis.\nRohrbach recommended including vulnerability to errors when assessing the security of a method, on the principle that humans err. He developed what is today called Rohrbach's Maxim: In judging the encryption security of a class of methods, cryptographic faults and other infringements of security discipline are to be taken into account.\nFriedrich Bauer writes\n[\n1\n]\n:-\nThe good cryptologist knows that he cannot rely on anything, not even on the adversary continuing his mistakes. He is particularly critical about his own possible mistakes. Surveillance of one's own encryption habits by a \"Devil's advocate\" is absolutely necessary, as the experiences of the Germans in the Second World War showed only too clearly.\nThe U.S. cryptologists could not imagine that Rohrbach had broken their M-\n138\n-A strip cipher which he did in\n1943\nafter working on it for a year. This cipher was originally used by the U.S. State Department and the U.S. Navy from\n1940\nto\n1944\n. Rohrbach led a team of mathematicians who used IBM/Hollerith punch card equipment and also built their own special decoding device which they called 'Automaton'. In\n[\n2\n]\nthere are some details of Rohrbach's personal file in the political archives of the Foreign Office:-\nFrom it we learn that since\n10\nMay\n1940\n, thus at a time when he was still senior assistant in Göttingen, he was temporarily employed as a scientific labourer in the Foreign Office and was assigned to the Personnel and Management Department, Project Z, Cyphers and Communication.\nThe file also states that\nErnst Mohr\nwas assigned to be Rohrbach's replacement in Prague during his activities in the Foreign Office in Berlin.\nAfter the war ended, Rohrbach was not allowed to teach for a number of years. However, he was appointed as Professor of Mathematics at the University of Mainz in\n1951\n. He continued to hold this chair until he retired in\n1977\nwhen he was made professor emeritus. He was rector of the University in session\n1966\n-\n67\n. He was also an editor of '\nCrelle\n's Journal' from\n1952\nto\n1977\nassisting\nHelmut Hasse\nwith this publication.\nFinally, let us return to Rohrbach's \"missionary concerns\" which we mentioned above. After the war, Rohrbach and his wife Rose became enthusiastic Christians with a missionary zeal to bring others to the faith. Rohrbach was the first president of\nStudentenmission in Deutschland\n, an organisation which aimed to spread Christian values in German schools and universities. He published a number of books relating to his Christian beliefs:\nNaturwissenschaft, Weltbild, Glaube\nⓉ\n(\nScience, world-view, faith\n)\n(1967)\n,\nMit dem Unsichtbaren leben: Unsichtbare Mächte und die Macht Jesu\nⓉ\n(\nWith the invisible life: invisible powers and the power of Jesus\n)\n(1976)\n;\nUnsichtbare Mächte und die Macht Jesu: Zur Seelsorge an belasteten Menschen\nⓉ\n(\nInvisible powers and the power of Jesus: For pastoral care of people\n)\n(1985)\n;\nDas anstössige Glaubensbekenntnis: Ein Naturwissenschaftler zum christlichen Glaubensbekenntnis\nⓉ\n(\nThe offensive Creed: A scientist approach to the Christian creed\n)\n(1987)\n;\nDie Faszination des Übersinnlichen\nⓉ\n(\nThe fascination of the supernatural\n)\n(1988)\n;\nSchöpfung - Mythos oder Wahrheit?\nⓉ\n(\nCreation - Myth or Truth?\n)\n(1990)\n; and\nWunder: Das Ungewöhnliche im Wirken Gottes\nⓉ\n(\nWonder: What is unusual in the work of God\n)\n(1992)\n. In\n1977\nRohrbach and his wife Rose moved to Bischofsheim an der Rhön where they built the Christian Conference Centre 'Christlichen Tagungsstätte Hohe Rhön'\nⓉ\n(\nChristian Meeting House for Hohe Rhön\n)\n. This Centre, on the hill overlooking Bischofsheim an der Rhön, is still run today as a Christian retreat.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Number Theory",
    "Statistics"
  ]
}