{
  "nome_completo": "Harlow Shapley",
  "nome_curto": "Harlow Shapley",
  "ano_nascimento": "1885",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shapley_Harlow/",
  "lugar_nascimento": "near Nashville, Missouri, USA",
  "lugar_morte": "Boulder, Colorado, USA",
  "biografia": "Harlow Shapley\ncame from a rural background. His father, Willis Harlow Shapley\n(1854\n-\n1913)\n, and mother, Sarah Stowell\n(1848\n-\n1932)\n, had come to Missouri from Hampton, New York, and now possessed a big farm. Shapley had a twin brother, Horace\n(1885\n-\n1980)\n; an older sister, Lillian\n(\nborn\n1881)\n; and a younger brother, John\n(1890\n-\n1978)\n. Two other sisters, Bertha Shapley\n(1877\n-\n1880)\nand Edith Shapley\n(1878\n-\n1884)\ndied as children. Let us make brief notes about Harlow's siblings.\nHorace Shapley, Harlow's twin brother, became a farmer. At the time of the\n1920\ncensus he was widowed and living on the family farm near Nashville, Barton, Missouri with his mother and sister Lillian. Lillian became a teacher and married Willard Willis Golladay on\n27\nSeptember\n1920\n. John Shapley studied at the University of Missouri, Princeton University and the University of Vienna. He married Fern Helen Rusk on\n19\nSeptember\n1918\n. An expert on early Christian and Byzantine art, he was on the faculty of Brown University, then Professor at New York University and finally Professor and Chairman of the Department of Art at University of Chicago.\nHarlow Shapley attended elementary school in Jasper, Missouri, but his education stopped after that, aside from a brief period in a normal school where he was only permitted to take a business course. He then continued studying in his own free time, at home. He did have one year attending school, however, on a family visit to Hampton, New York.\nAt age\n15\n, he became a crime reporter for the\nDaily Sun\nin Chanute, Kansas. He also worked as a police reporter for the\nJoplin\n(\nMissouri\n)\nTimes\n. He made use of the Carnegie library in Chanute to continue his self-study. When he had enough money, he and his brother John decided to attend high school and they applied to enter Carthage High School. Both were refused admission because their lack of much formal education indicated that they would not have the necessary background. Their next attempt was to apply to the less prestigious Presbyterian Carthage College Institute which accepted them. Harlow Shapley proved his self-study had been effective, and he completed the six years of the curriculum in just eighteen months.\nIn\n1907\n, at almost age\n22\n, he entered the University of Missouri. His initial intention was to study journalism, but the University did not offer courses leading to that career at this time. Shapley recalls in his autobiography that he decided to study the first subject in the alphabetically ordered list, but, not knowing how to pronounce archaeology, he ended up studying astronomy. He was fortunate to be taught by many talented lecturers, including Frederick Hanley Seares, who later became one of the most important astronomers at Mount Wilson Observatory. Shapley assisted Seares in running the small campus observatory. His mathematics lecturers included\nOliver Kellogg\nand\nEarle Hedrick\n. He obtained an A.B.\n(\nBachelor of Arts\n)\ndegree in\n1910\n, and the degree of A.M.\n(\nMaster of Arts\n)\na year later. Shapley was still interested in literature, the classics in particular. A result of this was his first paper\nAstronomy in Horace\n(1909)\n, published in \"Popular Astronomy\" where, as he indicates rather surprisingly at the beginning of the paper, he is not concerned with scholarly views of astronomy:-\nThe most reliable sources of information relating to the popular astronomical notions of the Romans are those found in Latin literature. The works of Virgil, Ovid, Lucretius, and the philosophical writers of the later republic and early empire contain numerous astronomical allusions, but these are not serviceable in a consideration of the ideas of the average Roman in the realm of natural science, for the conceptions of the masses of the people can not well be inferred from those of the more learned writers. To ascertain what the ordinary Roman said and believed of the celestial bodies, we must turn to one who dealt largely with the thoughts of the common people. Such a writer was the poet Horace. Horace was a lover of nature, but he was not a scholar. From his studies at Athens he tells us that he learned to distinguish right from wrong; but be ridicules the professional student, who, grown old in books, goes forth dumb as a statue and amuses the populace. Probably Horace never studied the stars, being content to accept the popular ideas. Since it is these common, every day notions that find expression in his songs of love and wine, his references to celestial phenomena may be taken as an indication of the astronomical knowledge of the Roman people of the early empire.\nDuring his final year at the University of Missouri, following\nOliver Kellogg\n's suggestion, Shapley applied for and was awarded the Thaw Fellowship at Princeton University Observatory. While at Princeton, he worked on the analysis of light curves of eclipsing binaries, together with Henry Norris Russell, the head of the Department. They calculated masses and distances for many of the stars they studied. Shapley's doctoral dissertation was on the topic of eclipsing binaries. He also studied Cepheid variables stars, which at that time were suspected of being a type of binary star. He presented an alternate explanation of their properties in\nOn the Nature and Cause of Cepheid Variation\n(1914)\n, where he correctly posited Cepheid stars were pulsating single stars. In\n1913\n, while Shapley was on a trip through Europe with his brother John meeting many leading European astronomers, his father died struck by lightning. On\n15\nApril\n1914\n, he married\nMartha Betz\n, a fellow student he had met in the University of Missouri who was then studying for a Ph.D. at Bryn Mawr College. Kopal posits in\n[\n30\n]\nthat, since her mathematical skills exceeded those of both Shapley and his advisor Henry Norris Russell,\nBetz\nmight have helped with the calculations in Shapley's Ph.D. thesis, the\nPrinceton Observatory Contribution No.\n3\n, which was hugely important for the study of eclipsing binary systems. That same year, he obtained a position as Junior Astronomer at Mount Wilson Observatory in California.\nBetz\nand Shapley were married after Shapley completed his Ph.D. and he had persuaded\nBetz\nto give up her research for a Ph.D. at Bryn Mawr\n[\n1\n]\n:-\nIn April\n1914\n, on his way from Princeton, New Jersey to Pasadena, California and the Mount Wilson Observatory, Shapley stopped in Kansas City, Missouri. His fiancée\nMartha Betz\nhad arrived earlier from Bryn Mawr, and was waiting for him at her parents' home. They were married at her home by Dr George Hamilton Combs, a well-known pastor in the Disciples of Christ Church in Kansas. After the wedding they boarded a train for California. Shapley recollected, \"It was a long trip, but I had some nice observations with me, and we worked on the orbits of eclipsing binaries on the honeymoon. Mrs Shapley was very quick at computing, so we enjoyed ourselves for a couple of days.\"\nAfter their honeymoon they moved to the Mount Wilson Observatory, in California, where they both started working as astronomers. At this time they lived in Los Robles, Pasadena, Los Angeles. This stay at Mount Wilson was the most prolific era of Shapley's life. He published over one hundred different papers. Among them, his most important one was his study of variable stars in globular star clusters, which he undertook after Solon Irving Bailey suggested it during a visit of Shapley's to Harvard College Observatory. His work led to the discovery of the centre of the Milky Way galaxy. Shapley noticed that the globular clusters were distributed in a large spheroidal system, far away from the Sun. He then identified the centre of the system of clusters with the centre of the Milky Way and found the distance between it and the sun\n(\nhe overestimated it to be\n17000\nparsecs\n)\n.\nEdwin Powell Hubble\nwould later use the same techniques as Shapley to determine the distances between galaxies.\nShapley published his findings in\nRemarks on the Arrangement of the Sidereal Universe\n(1918)\n. His conclusion of the Solar System being far from the centre of the Milky Way was accepted with little opposition, but his values for the estimated distances of the globular star clusters were disputed, as they fell outside expectations. Under the suggestion of the Director of Mount Wilson Observatory, George Ellery Hale, the\nNational Academy of Sciences\norganised two successive lectures: one from Shapley and one from one of his most vocal opponents, Heber Doust Curtis, an astronomer from Lick Observatory who would later that year become the Director of Allegheny Observatory. On\n26\nApril\n1920\n, the Great Debate\n(\nas it came to be known\n)\ntook place in the annual meeting of the\nAcademy\nin Washington D.C. The debate had no real winner for, while Shapley did argue correctly about the size of the Milky Way, he also defended that the spiral and ellipsoidal nebulae outside of it were much smaller in scale. We now know that this is false and that the nebulae are as big as or bigger than the Milky Way, as Curtis proposed in the Great Debate. Shapley had been influenced by the wrong measurements of his friend the Dutch astronomer Adriaan Van Mannen, who also worked at Mount Wilson Observatory.\nAside from astronomy, he developed the hobby of studying the ants around the Observatory. He published several papers on myrmecology and befriended William Morton Wheeler, one of the leading ant specialists of the United States.\nBecause of his astronomical discoveries, Shapley gained the attention of people with influence at Harvard, who decided he was the best candidate to succeed Edward Charles Pickering as Director of the Harvard Observatory, a position Shapley took up in\n1921\n.\nCecilia Payne-Gaposchkin\nwrites\n[\n5\n]\n:-\nThe young director was everywhere, running upstairs two steps at a time, pushing his soft sandy hair off his forehead, greeting everyone with the same casual cheerfulness. He knew exactly what every member of staff was doing. He made regular stops at each desk, and with a few well-chosen words made each of us feel important. ...\n[\nHe gave us\n]\npersonal encouragement, which conveyed the sense that everyone's work was of real importance. It was the secret of his early success.\nThere, his scientific output decreased, because he focused on improving the reputation of the institution he now directed. He led a research project on the southern star clouds of Magellan and encouraged\nAnnie Jump Cannon\nto complete the Henry Draper catalogue of stellar spectra. Many astronomers from all parts of the world came to Harvard to work with Shapley and his associates. Also during this time, the Harvard College Observatory in Peru was relocated to a site near Bloemfontein, in South Africa.\nAlthough\nCecilia Payne-Gaposchkin\nwrites very positively about Shapley in\n[\n5\n]\n, she also comments on his more negative characteristics:-\nHe liked to be flattered ... With his susceptibility to flattery went a less endearing trait. He never forgot or forgave a slight. He was vain and vindictive. A generous supporter, a stimulating companion, he could also be an implacable enemy. In his published recollections he says that he does not remember disliking anyone. I think that was an exaggeration.\nHe became a member of the\nNational Academy of Sciences\nin\n1924\nand a foreign member or associate of over twelve National Academies. He was active in the\nInternational Astronomical Union\nand was awarded a Gold Medal by the\nRoyal Astronomical Society\nin\n1934\n. He was President of the American Association for the Advancement of Science, the American Astronomical Society, the\nAmerican Academy of Arts and Sciences\n, and Sigma Xi. He was awarded the Bruce Medal by the Astronomical Society of the Pacific in\n1939\n. In presenting him with this award, Hamilton H Jeffers, the retiring president, said\n[\n28\n]\n:-\nDr Shapley's many contributions to astronomical research may be concisely, if not fully, classified as being in the fields of photometry, spectroscopy, and cosmogony. He has been a leader in the study of variable stars, especially those of the eclipsing and Cepheid types. He has devised and applied methods of determining the colour indices of faint stars both in and outside of clusters. With the results of these, and other, studies, combined with a remarkable amount of ingenuity and resourcefulness, he has been able to develop indirect but very powerful means for measuring the distances of objects in our universe. He has succeeded in plumbing depths of space that are far beyond those that can be dealt with by the classical methods. Now, given the distances and directions of objects, their actual situations in space become known. By these general means our Medallist has investigated, and continues to investigate, the distribution in space of stars, star clusters, and nebulae, the systems of which these objects are parts, their cosmological relations and significance, or, in general, the \"anatomy\" of our universe.\nDuring the Second World War, Shapley participated in humanitarian actions. He helped many Jewish scientists flee from Europe, giving them refuge in the United States. Once the war ended, he participated in several international efforts to guarantee peace, which distracted him from his duties as director and caused Harvard Observatory to lose part of its reputation. He was responsible for adding the S to UNESCO\n(\nUnited Nations Educational, Scientific and Cultural Organization\n)\nand firmly subscribed to its ideals, even after many Americans had abandoned the project.\nIn the\n1940\ns and\n1950\ns, he continued acting with a liberal attitude. He became president of the National Council of the Arts, Sciences and Professions, which raised money for democratic candidates. He was in contact with Presidents Franklin D Roosevelt and Harry S Truman. He supported the National Science Foundation. Shapley's actions found opposition in the more conservative part of American politics. Senator Joseph McCarthy accused him of being a communist in\n1950\n, and Shapley was subject to an investigation.\nCecilia Payne-Gaposchkin\nwrites in\n1947\n[\n32\n]\n:-\nTo a young student who asked the secret of his success, Shapley replied that it had lain in his power of synthesis: of recognising, and giving effect to, the interrelationships of neighbouring fields. It is this power that has led him to the fifth phase of his career - his work as an internationalist. Early a moving spirit of the\nInternational Astronomical Union\n, he has broadened his activities until they extend far beyond the strict boundaries of the sciences and concern themselves with the graver problems of understanding and cooperation among the world's peoples.\nHarlow Shapley retired in\n1952\nand moved to Sharon, New Hampshire. He abandoned research, but continued giving lectures throughout the country, inspiring many young people to become astronomers. Though Shapley was a declared agnostic, he enjoyed discussing religion, and he obtained a doctorate in Divinity in\n1969\nfrom the Meadville-Lombard Theological School. Also in that same year, he published an informal autobiography, titled\nThrough Rugged Ways to the Stars\n.\nIn March\n1933\nAlbert Einstein\nattended the Banquet of the Jewish Telegraphic Agency held in the Hotel Commodore in New York. In addition to an address by\nEinstein\nin German\n(\nlater translated into English\n)\nthere were several noted speakers. One of these was Harlow Shapley who gave this address on 'The Cosmic Parade'. We give a version of his address at\nTHIS LINK\n.\nShapley died in\n1972\n, at age\n86\n, while staying in Boulder, Colorado. He is buried in the local cemetery of Sharon. He left behind his wife\nMartha\nand his five children, Mildred\n(\nborn\n15\nFebruary\n1915)\n, Willis Harlow\n(\nborn March\n1917)\n, Alan Horace\n(\nborn March\n1919)\n, Lloyd Stowell\n(\nborn\n2\nJune\n1923)\nand Carl Betz\n(\nborn\n11\nOctober\n1927)\n. Let us say a little about some of these children.\nMildred Shapley married Ralph Matthews and she became Assistant Director of the Observatory in Trieste, Italy. Willis Harlow Shapley became a NASA official involved in developing the project to land a man on the moon. Alan Horace Shapley was Director of the National Oceanic and Atmospheric Administration and served as Vice-Chairman of the U.S. Committee for the International Geophysical Year in\n1957\n-\n58\n. Lloyd Stowell Shapley became a mathematician and economist at the RAND corporation then a professor at the University of California Los Angeles. He won the Nobel Prize in Economic Sciences in\n2012\n. Carl Betz Shapley worked for the National Gallery of Art, and then became a teacher in private schools going on to open his own private school in Ridgefield, Connecticut.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}