{
  "nome_completo": "Harry Raymond Pitt",
  "nome_curto": "Harry Pitt",
  "ano_nascimento": "1914",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pitt/",
  "lugar_nascimento": "Greets Green, West Bromwich, Staffordshire, England",
  "lugar_morte": "Derby, England",
  "biografia": "Harry Pitt\nwas often known as H R Pitt. His father, also named Harry Pitt, was a motorcar engineer who had no formal education beyond the age of thirteen. Harry Pitt Senior married Florence Harriet Draper and they had two children; Harry and Sybil\n(\nborn\n1921)\n. Harry, the subject of this biography, entered Greets Green Primary School when he was five years old. Two years later, in\n1921\n, his family moved to Wall Heath\n(\nnow in West Midlands\n)\nand he began attending the Church of England School there. His secondary education began in\n1924\n, when he was ten years old, when he won a scholarship to attend King Edward's School, Stourbridge. He spent eight years at this school and described his time there in a personal statement\n(\nsee for example\n[\n1\n]\n)\n:-\nKing Edward's had a large sixth form and, particularly in the early thirties, a very high academic standard. Teaching in Science and Mathematics was excellent and I do not regret the fact that I spent my last four years at school reading little else. My response to teaching in humane studies was less satisfactory and my early introduction to History, Literature and Languages left me with a positive distaste for these subjects which lasted well into my undergraduate years.\nDuring these years, in\n1928\n, his family moved from Wall Heath to Kingswinford. In his final year at King Edward's School, Pitt won a scholarship to read mathematics at Peterhouse, Cambridge. Without this financial assistance his parents would have not been able to support him through university. He matriculated at Cambridge in\n1932\nand there studied the Mathematical Tripos. He was tutored by\nJ C Burkill\nand attended courses by world-leading mathematicians such as: functions of a complex variable from\nA E Ingham\n, almost periodic functions from\nA S Besicovitch\n, the theory of functions from\nJ E Littlewood\n, and divergent series from\nG H Hardy\n. He was ranked first class in Part I and in Part II, then obtained a distinction in Part III in\n1935\n. Following the award of his degree he remained at Cambridge as a research student supervised by\nG H Hardy\n. He held a Bye-Fellowship at Peterhouse from\n1936\nto\n1939\n, but spent session\n1937\n-\n38\nat Harvard University where he was a Chaote Memorial Fellow.\nPitt undertook research on Tauberian Theorems, an area that had been greatly developed by\nNorbert Wiener\nin the early\n1930\ns. It was therefore particularly beneficial for him to spend a year in Cambridge, Massachusetts, during which time he was able to collaborate with\nDavid Widder\nat Harvard and with\nNorbert Wiener\nat the Massachusetts Institute of Technology. Pitt was awarded a doctorate by the University of Cambridge in\n1938\nfor his thesis\nGeneral Tauberian Theorems\n. Few research students can have had a more productive beginning to their careers for, after publishing\nA note on bilinear forms\nin\n1936\n, and\nTheorems on Fourier series and powers series\nin\n1937\n, he then published no fewer than eight papers in\n1938\n. One of these\n1938\npapers,\nOn absolutely convergent Fourier-Stieltjes transforms\n, was written jointly with\nNorbert Wiener\n.\nIn\n1939\nPitt was appointed as an assistant lecturer at the University of Aberdeen in Scotland. He married Catherine Jacoby on\n5\nApril\n1940\n; they had four sons Mathew\n(\nborn\n1945)\n, John\n(\nborn\n1947)\n, Daniel\n(\nborn\n1954)\nand Julian\n(\nborn\n1958)\n. Of course Pitt's time in Aberdeen coincided with the first years of World War II and, in\n1942\n, he began to use his mathematical skills as part of the war effort. Michael Sewell writes\n[\n3\n]\n:-\nWith his developing analytical skills, Pitt moved to London in\n1942\nto work at the Air Ministry and the Ministry of Aircraft Production for three years. Within R.A.F. Coastal Command he used\nprobability theory\n, and the newly developing operational research, to devise methods for attacking German U-boats. 'The Times' remarks that Pitt refused a commission because he felt that such status would limit his freedom to influence senior officers.\nThe war ended in\n1945\nand Pitt finished his war work, being appointed as Professor of Mathematics at Queen's University Belfast. It was a remarkable leap from assistant lecturer to professor in one step, but by\n1945\nhe had\n20\npapers in print and his three years experience undertaking war service was exceptionally positive. After five years in Belfast, Pitt moved to Nottingham in\n1950\nwhen appointed as Professor of Pure Mathematics at the university there. His appointment was to fill the chair left vacant by the retiral of\nHenry Piaggio\nwho had taught at Nottingham for\n42\nyears.\nPiaggio\nhad filled the first chair of Mathematics at Nottingham, there only being a chair of Physics and Mathematics before that. Then Pitt, the second holder of the Mathematics chair, persuaded the university to found a chair of Applied Mathematics. The first Professor of Applied Mathematics was Rodney Hill, appointed in\n1953\n. Michael Sewell writes in\n[\n3\n]\nof his undergraduate days at Nottingham:-\n... when I joined the Mathematics Department at Nottingham in\n1954\nas an undergraduate, all the factors had been put in place which provided an excellent mathematical education. With other arrangements which Pitt made, the atmosphere felt as if, provided one worked conscientiously, good values were handed out on a plate. Experienced staff were qualified to teach the major areas of analysis, algebra, geometry, statistics, and the mechanics of rigid and deformable bodies, fluids and electromagnetism. The pleasure in the Department was real when Harry Pitt was elected a Fellow of The\nRoyal Society\nin\n1957\n, and Rodney Hill likewise in\n1961\n. ... Harry Pitt ... regarded it as his duty to give tailored courses himself at\n[\nPass\n]\nlevel, and not merely to concentrate on the Honours stream. The result was, over the years, a body of graduates who were grateful for the kindness and attention which he devoted to them.\nPitt became involved in university administration being first a member of the Council, then Vice-dean followed by Dean of the Faculty of Science and, finally, Deputy Vice-Chancellor. Naturally this change of emphasis meant that he had less time for mathematical research and, during fourteen years at Nottingham from\n1950\nto\n1964\nhe published only three papers. However he took the opportunity to write two classic texts publishing\nTauberian theorems\nin\n1958\nand\nIntegration, measure and probability\nin\n1963\n. S Ikehara begins his review of the first of these as follows:-\nThis is the first book exclusively devoted to the study of Tauberian theorems, which have been associated with the names of\nHardy\n,\nLittlewood\n, and\nWiener\namong others. The author has succeeded in giving a brief introduction to some of the more important Tauberian theorems, including mercerian theorems as limiting cases, and the methods which have been developed to prove them.\nN Dinculeanu reviewed the second of these texts, beginning his review as follows:-\nAs the author states in the preface, the purpose of this book is to provide an introduction to the modern theory of probability and the fundamental ideas and techniques on which it is based, namely, those of measure and integration. Consequently, the book is divided into two distinct parts. The first part is devoted to the theory of integration in a sufficiently general context to make it applicable in other branches of analysis. The second part deals with more specialised topics, such as convergence theorems and random sequences and functions. All this material is excellently exposed within only\n106\npages.\nThe book\nIntegration, measure and probability\nappeared after he had spent the year\n1962\n-\n63\nas a visiting professor at Yale University. The change in direction for Pitt's career into administration became, in a sense, complete in\n1964\nwhen he was appointed as Vice-Chancellor of Reading University. He remained in this post until he retired in\n1978\n. The authors of\n[\n1\n]\nwrite that:-\nHe was calm and thoughtful as a Vice-Chancellor and as a man. ... His colleagues recall a kind man who led by consensus.\nThe author of\n[\n2\n]\nwrites:-\nPitt's friends and acquaintances described him as a man of great modesty and integrity, capable of considerable clarity of thought. Being both always willing to be helpful to others, and a meticulous and excellent administrator, he was able to generate a great deal of good will.\nAfter he retired as Vice-Chancellor, Pitt served in a number of ways such as being a member of the\nRoyal Society\nEducation Committee from\n1980\nto\n1985\nand he was president of the Institute of Mathematics and its Applications in\n1984\n-\n85\n. His presidential address to the Institute was\nThe place of mathematics\n. Also in\n1985\nhe published the third of his texts, namely\nMeasure and integration for use\n. The cover of the book contains the following description of its contents:-\nAlthough of unquestioned power and practical utility, the\nLebesgue\nTheory of measure and integration tends to be avoided by mathematicians, due to the difficulty of obtaining detailed proofs of a few crucial theorems. In this concise and easy-to-read introduction, the author demonstrates that the day-to-day skills gleaned from\nLebesgue\nTheory far outweigh the effort needed to master it. This compact account develops the theory as it applies to abstract spaces, describes its importance to differential and integral calculus, and shows how the theory can be applied to geometry, harmonic analysis, and probability. Postgraduates in mathematics and science who need integration and measure theory as a working tool, as well as statisticians and other scientists, will find this practical work invaluable.\nMiguel A Jiménez Pozo writes in a review:-\nAs the title implies, this book deals with measure and integration. It gives a compact account of the essential theory and some of its applications. For reasons of brevity, the author derives the concepts of measure and measurability from that of the integral. This approach is far from the original development of the theory and consequently, perhaps, less pedagogical for beginners. On the other hand, the details of many proofs are left to the reader in accordance with the author's objectives. The exposition, however, is rigorous, clear and precise and the three chapters in the first part of the book cover the main results of measure and integration, such as the theorems of\nLebesgue\n,\nFubini\nand\nRadon\n-\nNikodym\n. The second part also has three chapters: Each one of them considers an area of application: geometry, harmonic analysis and probability.\nPitt received many honours in addition to election to a fellowship of the\nRoyal Society\nwhich we mentioned above. He was awarded honorary degrees by the universities of Aberdeen\n(1970)\n, Nottingham\n(1970)\n, Reading\n(1978)\n, and Belfast\n(1980)\n. He was knighted in\n1978\nfor his contributions as Vice-Chancellor of Reading University.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}