{
  "nome_completo": "Heinrich Martin Georg Friedrich Weber",
  "nome_curto": "Heinrich Weber",
  "ano_nascimento": "1842",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weber_Heinrich/",
  "lugar_nascimento": "Heidelberg, Germany",
  "lugar_morte": "Strasbourg, Germany (now France)",
  "biografia": "Heinrich Weber\nwas born in Heidelberg, the son of Georg Weber\n(1808\n-\n1888)\nwho was an historian, author of\nHistory of the World\n, and principal of a high school. Georg Weber had been born in the Rhine Palatinate town of Bergzabern, which was at this time under French rule, and studied at Speyer and the University of Erlangen before being awarded a doctorate from the University of Heidelberg in\n1832\nfor his dissertation\nDe Gytheo et rebus navalibus Lacedaemoniorum\nⓉ\n(\nOn Gytheio and the  Spartan navy\n)\n. He married Ida Helene Marie Wilhelmine Becher\n(\ndied\n1887)\nin\n1839\nand Heinrich was their eldest son. Heinrich's love of mathematics began while he was at the Lyceum in Heidelberg. There he was taught by Arthur Arneth\n(1802\n-\n1858)\nwho was professor of mathematics and physics at the Lyceum and also a\nprivatdozent\nat the University of Heidelberg. Arneth wrote the important book\nHistory of Pure Mathematics in its Relation to the History of the Development of the Human Mind\n(1852)\n. The Weber family were very involved in education and they strongly encouraged Heinrich to think in terms of an academic career from a young age. The influence of Weber's family was particularly strong since he lived at home throughout his school and university studies in Heidelberg.\nAfter graduating from the Lyceum, Weber entered the University of Heidelberg in\n1860\nto study mathematics and physics. At this time Heidelberg had some outstanding physicists and mathematicians on the staff who gave courses that Weber attended. These included\nGustav Kirchhoff\n(\nappointed to Heidelberg in\n1854)\n, Robert Bunsen\n(\nappointed to Heidelberg in\n1852)\n,\nHermann von Helmholtz\n(\nappointed to Heidelberg in\n1858)\n,\nOtto Hesse\n(\nappointed to Heidelberg in\n1856)\n, and\nMoritz Cantor\n(\nappointed to Heidelberg in\n1853)\n. As was the common practice of German students at this time, Weber spent part of his time studying at a different university. He chose the University of Leipzig in the middle of his studies, spending a semester there in\n1862\nbefore returning to Heidelberg to complete his education. He was awarded a doctorate from the University of Heidelberg on\n19\nFebruary\n1863\nhaving been advised by\nOtto Hesse\n. He was not required to write a thesis.\nIn order to become a university teacher, Weber needed to write a further thesis, his\nhabilitation\nthesis. He went to Königsberg where he studied under\nFranz Neumann\nand Friedrich Julius Richelot, who had been a student of\nJacobi\n. Although\nJacobi\nhad died over ten years before Weber began his studies at Königsberg, his influence was still strongly felt and it would not be unreasonable to say that Weber, through his teachers at Königsberg, was strongly influenced by\nJacobi\n's style of mathematics. In\n[\n15\n]\nPeter Roquette examines why Weber went to Königsberg for his postgraduate study and notes that three of his teachers at Heidelberg,\nHesse\n,\nKirchhoff\nand\nHelmholtz\n, came from Königsberg:-\n... academic life in Heidelberg around\n1863\n, as far as mathematics and the neighbouring sciences were concerned, was flourishing, and that it was largely dominated by people who came from Königsberg. They knew the stimulating and challenging atmosphere which Königsberg offered to young mathematicians at that time. So it seems natural that young Weber, when he asked his academic teachers where he should go for his postdoctoral studies, was advised to move to Königsberg.\nThere were other students at Königsberg at this time who would become important in the development of mathematics, in particular\nAlbert Wangerin\n, who studied for his doctorate around the same time as Weber worked for his habilitation, and former students such as\nAlbert Clebsch\nwhose influence was still being felt. In fact Weber mentions the names of nine of his fellow students at Königsberg who went on to high profile careers as scientists.\nOn\n11\nAugust\n1866\nWeber's habilitation thesis\nSinguläre Auflösungen partieller Differentialgleichungen erster Ordnung\nⓉ\n(\nSingular resolutions of partial differential equations of first order\n)\nwas accepted and he became a privatdozent at Heidelberg in that year. His habilitation thesis was published in Volume\n66\nof\nCrelle\n's journal. Three years later, on\n20\nJuly\n1869\n, he was appointed as extraordinary professor at Heidelberg but later in the same year he accepted an appointment as a full professor at the Eidgenössische Technische Hochschule in Zürich. He married Emilie Dittenberger in\n1870\nin Zürich. Emilie was the daughter of a chaplain to the Weimar court. Heinrich and Emilie Weber had seven children, three of whom died young. A daughter, Emilie Weber, gained fame as the translator from French into German of\nHenri Poincaré\n's philosophical writings. Her translations were published in\n1906\nand she died in\n1911\n. A son, Rudolph Heinrich Georg Weber, born\n16\nAugust\n1874\nin Zürich, went on to study mathematics and physics. Rudolph was appointed to the University of Heidelberg in\n1902\nbut spent most of his career as professor of mathematical physics at the University of Rostock. Rudolph sometimes collaborated with his father and we mention in particular a joint publication on\nGauss\n's work on fluids. Over the next twenty-five years, Heinrich Weber taught at a surprising number of different institutions. As well as teaching in Zürich at the Eidgenössische Polytechnikum, he also taught at the University of Königsberg from\n1875\nto\n1883\nhaving been appointed as Richelot's successor - Richelot, born in\n1808\n, died in\n1875\n.\nTogether with\nRichard Dedekind\n, Weber had been editing\nRiemann\n's Collected works and this important book was published in\n1876\n. However, one of the most significant things to happen during his time teaching at Königsberg was in\n1880\nwhen two young students,\nDavid Hilbert\nand\nHermann Minkowski\n, enrolled there. At this time Weber was lecturing on\nnumber theory\n, also gave a course on elliptic functions, and ran a seminar on the theory of invariants. All of these courses were attended by the young\nHilbert\n(\nand probably also by\nMinkowski\n)\n. The lecture notes from one of these courses has been preserved, the course on number theory, and Roquette gives an indication of the contents in\n[\n15\n]\n:-\nWeber's course started from the very beginning of number theory, working through congruence calculus,\ncontinued fractions\n, towards quadratic reciprocity. After that, binary quadratic forms are discussed, their classes, their composition, and the analytic class number formulas. Also, the existence of primes in arithmetic progressions, using L-series, is included. In this last part the reader gets the impression that things went quite fast but the proofs are recorded in detail. We conclude that much of the concept of the lecture was based on\nGauss\n's 'Disquisitiones' and\nDirichlet\n's papers. In addition Weber was quite explicit in making use of modern notions, for instance the abstract notion of a group is to be found, as well as what we now call the \"main theorem on finite abelian groups\", i.e., decomposition of finite abelian groups into cyclic factors\n(\nin the context of description of characters\n)\n.\nAfter leaving Königsberg in\n1883\n, Weber was appointed to the Technische Hochschule in Charlottenburg where he spent only one year before he moved again to the Philipps University of Marburg where he was rector of the university during session\n1890\n-\n91\n. His next move, in\n1892\n, was to the Georg-August University of Göttingen where he spent three years. His successor at Göttingen was\nHilbert\n. While at Göttingen he published\nDie allgemeinen Grundlagen der Galois'schen Gleichungstheorie\nwhich is the first paper to contain a discussion of an abstract group, either finite or infinite. Weber's final post was to Strasbourg where he was appointed in\n1895\n. It is reasonable to consider why Weber left Göttingen, perhaps the leading mathematical centre in the world at this time, to move to Strasbourg.\nGermany had captured Strasbourg after a\n50\n-day siege during the Franco-Prussian war of\n1870\n-\n71\nand annexed the city. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strasbourg in\n1872\n. Two mathematics chairs were founded at this time, the first in Mathematics which was filled by\nElwin Christoffel\nand the second in Geometry and Mechanics which was filled by\nTheodor Reye\n. Both\nChristoffel\nand\nReye\nconsidered it their patriotic duty to assist in making the University of Strasbourg a German university.\nChristoffel\nhad been forced to stop teaching in\n1892\ndue to health problems and in\n1894\nretired leaving the chair vacant. However, Weber did not move to Strasbourg for mathematical reasons, but rather for personal ones. Strasbourg was quite close to Weber's native city of Heidelberg, and one of Weber's daughters, Lina Weber-Holtzmann, had married Heinrich Holtzmann, the professor of theology at Strasbourg, and was living there. Another reason was that his salary was higher in Strasbourg than Göttingen, at least in part because taxes in Alsace were significantly less than those in Prussia. Once he had arrived in Strasbourg he had as colleagues\nTheodor Reye\nand the extraordinary professor Adolph Krazer\n(1858\n-\n1926)\n, a student of Friedrich Emil Prym\n(1841\n-\n1919)\n.\nAgain Weber served as rector of the university in which he was working, taking on this role at Strasbourg during session\n1900\n-\n01\n. Note that Weber served as rector three times during his career at three different universities. Weber remained in Strasbourg for the rest of his life and during this time it remained a German city; only at the end of the World War I in\n1918\ndid the city revert to France. Of course, the reader of this biography will have noted the large number of different universities at which Weber worked. In fact he holds the record for the largest number of different university posts by any\n19\nth\ncentury German mathematician.\nWeber's main work was in algebra, number theory, analysis and applications of analysis to mathematical physics. This seems a contradiction in terms, for we have now almost said that Weber's main work spans the whole spectrum of mathematics. In fact this is not far from the truth for Weber's work was characterised by its breadth across a wide range of topics. To a certain extent this breadth can be attributed to the various influences on Weber from colleagues around him. The applications to mathematical physics certainly grew from working with\nFranz Neumann\nin Königsberg. But in Königsberg there was also the Jacobi influence, particularly coming through one of his other teachers Friedrich Richelot, which saw Weber doing important work on algebraic functions.\nPerhaps Weber is today remembered for his outstanding text\nLehrbuch der Algebra\nⓉ\n(\nTextbook of algebra\n)\npublished in\n1895\nand it is for his work in algebra and number theory that he is best known. If he was influenced by his colleagues to work in different areas of mathematics then it is a very fair question to ask where the influence came from which prompted Weber to work on algebra and number theory. The answer must be\nDedekind\n. He wrote an important paper with\nDedekind\n,\nTheorie der algebraischen Funktionen einer Veränderlichen\nⓉ\n(\nTheory of algebraic functions of one variable\n)\n, published in\n1882\nin\nCrelle\n's journal, in which they examined algebraic functions from an algebraic rather than analytic point of view. In this paper\n[\n16\n]\n:-\n... the notion of point on an abstract algebraic curve is defined for the first time in history, thus taking a decisive step towards the creation of modern algebraic geometry.\nThe third volume of\nLehrbuch der Algebra\nⓉ\n(\nTextbook of algebra\n)\n, published in\n1903\n, was dedicated by Weber to\nDedekind\n,\nHilbert\nand\nMinkowski\n:-\n... the three men to whom I feel closest in scientific respect.\nWeber's\nLehrbuch der Algebra\nⓉ\n(\nTextbook of algebra\n)\nis an outstanding work but, although he tried hard to connect the various algebraic theories, even fundamental concepts such as a field and a group are only seen as tools and not properly developed as theories in their own right. It was, however, a remarkable book which was effective over many years as a teaching tool.\nJames Pierpont\nwrites in a review\n[\n13\n]\n:-\nA classic from the day of its publication, it is destined to a long and useful career, a monument of honour to its genial author.\nG A Miller\nwrote in\n1913\n[\n11\n]\n:-\nAmong the advanced text-books on algebra there is probably none which is more favourably known than Weber's \"Lehrbuch der Algebra\" in three large volumes.\nFor longer extracts from these reviews\nTHIS LINK\n.\nNorbert Schappacher writes\n100\nyears after the book was published:-\n[\nT\n]\nhis work marks the transition from the late\n19\nth\ncentury treatment of algebra to the \"modern algebra\" whose first full-fledged textbook treatment was going to be\nvan der Waerden\n's well-known treatise of\n1930\n-\n31\n. The third volume would not be called algebra today. It ... contains a classical treatment of\nelliptic functions\n, especially their arithmetic theory, along with parts of\nalgebraic number theory\nand class field theory, as well as a small chapter on differentials of curves in the higher rank case including\nRiemann\n-\nRoch\n.\nThis third volume of\nLehrbuch der Algebra\nⓉ\n(\nTextbook of algebra\n)\nwas built on three papers he had written on class field theory entitled\nÜber Zahlengruppen in algebraischen Zahlkörpern\nⓉ\n(\nOn groups of numbers in algebraic number fields\n)\n(1897\n-\n98)\n. In these\n[\n16\n]\n:-\n... he emphasized the decomposition behaviour, as opposed to\nHilbert\n's chief interest in the unramifiedness of the\n(\nHilbert\n)\nclass field.\nAmong other books by Weber we mention\nDie Partiellen Differentialgleichungen der Mathematischen Physik\nⓉ\n(\nThe partial differential equations of mathematical physics\n)\nand\n(\nwith Josef Wellstein\n)\nEncyklopädie der Elementar-Mathematik\nⓉ\n(\nEncyclopedia of elementary mathematics\n)\n.\nAgain extracts from reviews of these books are given at\nTHIS LINK\nBruno Schoeneberg, in\n[\n1\n]\n, comments on Weber as a teacher:-\nWeber was an enthusiastic and inspiring teacher who took great interest in educational questions.\nVoss writes of Weber's character in\n[\n21\n]\n:-\nOn closer contact he opened up without reservation to his friends whom he found through scientific cooperation and common interests.\nTowards the end of Weber's life a number of tragedies affected him deeply. His wife Emilie died in\n1901\nand one of his daughters then looked after the household. However, this daughter died in\n1909\n.\nWeber received many honours including the publication of a\nFestschrift\ncompiled by his friends and colleagues to celebrate his\n70\nth\nbirthday on\n5\nMarch\n1912\n. He received an honorary doctorate from the University of Kristiana in\n1902\nat the time of\nAbel\n's centenary celebrations. He received an honorary doctorate from the University of Heidelberg in\n1912\n. He was elected to the\nGöttingen Academy of Sciences\n(1875)\n, the\nBerlin Academy of Science\n(1896)\n, the Munich Academy of Sciences\n(1903)\n, the\nRoyal Swedish Academy of Sciences\n, the Uppsala Academy of Sciences, and the\nAccademia dei Lincei\n. He was elected president of the\nGerman Mathematical Society\ntwice, in\n1895\nand again in\n1904\n. He was also President of the International Congress of Mathematicians held in Heidelberg in\n1904\n. From\n1893\nhe served as an editor of the\nMathematische Annalen\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Number Theory"
  ]
}