{
  "nome_completo": "Heinrich-Wolfgang Leopoldt",
  "nome_curto": "Heinrich-Wolfgang Leopoldt",
  "ano_nascimento": "1927",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leopoldt/",
  "lugar_nascimento": "Schwerin, Mecklenburg, Germany",
  "lugar_morte": "Unterlüss, Germany",
  "biografia": "Heinrich-Wolfgang Leopoldt\nwas brought up in Schwerin, the town of his birth, on the south west shore of Schweriner Lake, about\n65\nkm southwest of the city of Rostock. He was studying at the\nGymnasium\nin Schwerin when World War II began in\n1939\n. He continued his secondary education until January\n1943\nwhen Germany began the Luftwaffenhelfer programme. This drafted all boys born in\n1926\nor\n1927\n, which included Leopoldt, into the military where they were supervised by the Hitler youth who began a programme of ideological indoctrination. Members of the Luftwaffe also trained the boys in military duties. After the war in\n1945\nthe future looked very uncertain and Leopoldt decided that his best option was to take up an apprenticeship. However, he was very fortunate that his love for playing music meant that he joined a group one of whom was the mathematics teacher who had taught him in the Gymnasium. The teacher was, of course, already fully aware of Leopoldt's mathematical abilities and he began to teach him the mathematical principles of astronomy. Soon the teacher was encouraging Leopoldt return to the Gymnasium to complete his school education so that he might gain admission to university. Leopoldt took his teacher's advice and went back to the Gymnasium, gaining the qualifications to enter university in\n1947\n. He then enrolled to study mathematics at the Humboldt University in Berlin, matriculating in the autumn of\n1947\n. The authors of\n[\n4\n]\nwrite:-\nOne of the first lecture courses he attended was an introduction to number theory by\nHelmut Hasse\n. In his Erinnerungen Leopoldt reports that this lecture had left a deep impression upon him, in particular\nHasse\n's remarks on the relationship between beauty and truth in mathematics, combined with various instances of parallels between number theory and music. This lecture, Leopoldt recalls, led him to study number theory with highest priority. We can observe this dedication to number theory throughout his mathematical work. In the year\n1950\nHasse\nleft Berlin for Hamburg and his student Leopoldt followed him there.\nLeopoldt was awarded his doctorate in\n1954\nby the University of Hamburg for his thesis\nÜber Einheitengruppe und Klassenzahl reeller algebraischer Zahlkörper\nⓉ\n(\nOn the unit group and the class number of real algebraic number field\n)\n. In his\n1952\nmonograph\nÜber die Klassenzahl abelscher Zahlkörper\nⓉ\n(\nOn the number of classes of abelian number fields\n)\n,\nHelmut Hasse\nhad proposed a programme:-\n... to make the class of absolute-abelian number-fields so accessible, in a systematic and structure-invariant way, that one can work with them just as freely as with the quadratic number fields.\nThis programme played a major role in Leopoldt's research throughout his career. He explains in\n[\n2\n]\nthe progress that he had made by\n1962\nfollowing this line of research. His first two publications, appearing before he submitted his thesis, were\nZur Geschlechtertheorie in abelschen Zahlkörpern\nⓉ\n(\nOn gender theory in Abelian number fields\n)\n(1953)\nand\nÜber die Einheitengruppe und Klassenzahl reeller Abelscher Zahlkörper\nⓉ\n(\nOn the unit group and the class number of real Abelian number fields\n)\n(1953)\n.\nFollowing the award of his doctorate, he was appointed as an assistant in the University of Erlangen. However, he was in the United States during\n1956\n-\n58\nwhen he had a two-year post-doctoral position at the Institute for Advanced Study in Princeton. While in Princeton he wrote the paper\nZur Struktur der l-Klassengruppe galoisscher Zahlkörper\nⓉ\n(\nThe structure of the l-class group Galois number field\n)\nwhich studied the class group of an absolute\nGalois\nnumber field. This paper was published in\n1958\nand\n[\n3\n]\n:-\n... won widespread interest among number theorists - not only because it offered a common background for classically known results about divisibility properties of class numbers, but also since it admitted to obtain much more information of this kind.\nIn\n1959\nhe received his\nhabilitation\nat the University of Erlangen after he submitted a Habilitationsschrift in which he studied the structure of the ring of integers in an abelian field K. This extended results obtained by\nEmmy Noether\nshowing that in a tamely ramified field there exists an integral normal base. Leopoldt was able to prove a modification of\nNoether\n's result in the case where the ramification is not tame even though in this case an integral normal base does not exist. In\n1962\nhe was appointed to the University of Tübingen although during the two years he was on the faculty there he spent time as a visiting professor in the United States at Johns Hopkins University in Baltimore. In\n1964\nhe was offered a permanent position at Johns Hopkins University and he also received an offer of a professorship from the University of Karlsruhe. He made the, quite difficult, decision to accept the offer from Karlsruhe where he was also director of the Mathematical Institute.\nIt is probably for his discovery of the\np\np\np\n-adic\nL\nL\nL\n-functions that Leopoldt is best known although some may say that it is for the Leopoldt Conjecture. The\np\np\np\n-adic\nL\nL\nL\n-functions, which are analogues of the\nRiemann\nzeta function\nbut whose domain and target are\np\np\np\n-adic, were introduced by Leopoldt in a joint paper with Tomio Kubota:\nEine p-adischeTheorie der Zetawerte: I, Einführung der p-adischen Dirichletschen L-Funktionen\nⓉ\n(\nA p-adic theory of zeta values: I, imposition of p-adic Dirichlet L-Functions\n)\n(1964)\n. The Leopoldt Conjecture claimed that a collection of linear independent units in a number field\nK\nK\nK\nwill also be\nZ\np\n\\mathbb{Z}_{p}\nZ\np\n​\n-linearly independent in the\np\np\np\n-adic completions of\nK\nK\nK\n. In\n1967\n, Armand Brumer building on results of James Ax in\n1965\n, established the Conjecture for abelian extensions\nK\nK\nK\nof the rationals. Preda Mihailescu\n(2009\n,\n2011)\nclaims to have proved the conjecture, but the status of the proof is still difficult to determine. Mihailescu  proved the\nCatalan\nconjecture, publishing the proof in\nCrelle\n's Journal in\n2004\n, so he has a good record in this area.\nLeopoldt's approach to\nalgebraic number theory\nalways tended to be algorithmic and this has led to the development of computer implemented tools\n[\n3\n]\n:-\nA characteristic feature of Leopoldt's work is that he aims at concrete results given by explicit and effective formulas. He competently uses and investigates abstract structures, but such considerations serve him as motivation only, as guideline towards the goal of explicit algorithms. To a large degree his results were obtained by extended numerical computations. This attitude led him quite early to develop computer programs for the use in algebraic number theory. His team in Karlsruhe was one of the first in Germany which systematically developed the necessary algorithms for this project, also in cooperation with\nHans Zassenhaus\n.\nAmong Leopoldt's service to mathematics we should mention that he was an editor of the\nJournal of Number Theory\nfrom\n1969\nto\n1987\n. Another important contribution was being one of the two editors\n(\nthe other being Peter Roquette\n)\nof the\nCollected Works of Helmut Hasse\n. This was published in\n1975\n. He had been invited to lecture in Marburg on\n8\nDecember\n1972\n, at a meeting to celebrate the Goldenes Doktorjubiläum of\nHasse\n.\nPeter Roquette describes Leopoldt's personality in\n[\n3\n]\n:-\nLeopoldt's personality can be characterized as quiet, unassuming, always willing to hold back his own in favor of supporting the cause. His firm and objective counsel in scientific matters, always to the point, was valued by all who had to deal with him. His lectures stood out by their clarity and intensity. He was known as a master in exposition. The list of his publications is not large but his work belongs to the pearls of mathematical research in the last century.\nAmong the honours he received, we mention his election to the\nHeidelberg Academy of Sciences\nin\n1979\n. The article\n[\n1\n]\nis his inaugural lecture to the Academy delivered on\n31\nMay\n1980\n, in which he outlines the course of his life and his work in algebraic number theory, in particular describing the influence of his teacher,\nHelmut Hasse\n, in detail. After Leopoldt retired from his professorship at the university of Karlsruhe, he moved to the village of Unterlüss about\n28\nkm north east of Celle. There he devoted his last years to his favourite hobby, namely music. He played the piano to a high standard and he got great pleasure from his playing. He died following a long illness at the age of almost\n84\nyears. He was survived by his wife and five children.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}