{
  "nome_completo": "Ernst Paul Heinz Prüfer",
  "nome_curto": "Heinz Prüfer",
  "ano_nascimento": "1896",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Prufer/",
  "lugar_nascimento": "Wilhelmshaven, Germany",
  "lugar_morte": "Münster, Germany",
  "biografia": "Heinz Prüfer\nwas born in Wilhelmshaven, a city and port situated on Jadebusen\n(\nJade Bay\n)\n, a North Sea inlet on the western end of Germany's North Sea coast. The town was not an ancient one, being only founded in\n1853\nand given its present name in\n1869\n(\nnamed for Wilhelm I\n)\n, twenty-seven years before Heinz was born there. His father had an engineering background and worked for the Imperial Navy as a technical secretary at the large naval base in Wilhelmshaven but later he moved to Berlin and worked for the Department of Transportation. Heinz was brought up in a household where science was an everyday part of life. His early education was in a school in Wilhelmshaven.\nAfter leaving Wilhelmshaven, Prüfer studied at the\nGymnasium\nin Berlin-Zehlendorf completing his schooling there in\n1915\n. He entered the Humboldt University of Berlin at Easter\n1915\nwhere he was taught by\nGeorg Frobenius\nin the year before his death. He was also taught by\nHermann Schwarz\n,\nPaul Koebe\nand\nIssai Schur\n. Now\nSchur\nwas not at Berlin when Prüfer began his studies but returned to the University of Berlin, taking up a position there in\n1916\nafter holding a professorship in Bonn. Now the young student greatly impressed his teachers, particularly\nFrobenius\nand\nSchwarz\n.\nFrobenius\ntaught Prüfer about\nDedekind\n's way of thinking and his approach to mathematics and this made Prüfer enthusiastic about abstract algebra. Prüfer himself later said what a strong impression\nSchwarz\n's personality had made on him. Prüfer applied himself to his academic studies with extreme diligence, even thinking deeply about comments which others might have passed over as unimportant trifles. This way of working would be a characteristic of Prüfer's approach throughout his life as was his independence of thought.\nThe 'Königlich Preussische Landesaufnahme' was set up in\n1875\nto undertake surveying and topographic mapping of the German Reich. Now World War I began in\n1914\nbefore Prüfer began his university studies but this had not stopped him matriculating at the University of Berlin. By April\n1917\nthe Germans decided that they required a greater emphasis on surveying as a contribution to their war effort and the Königlich Preussische Landesaufnahme was re-established with a Trigonometric Department, a Topographical Department, a Photometric Department, a Cartographic Department, a Geological Department and some other supporting units. For his military service, Prüfer was drafted to work at the Königlich Preussische Landesaufnahme in\n1917\n-\n18\n. He was able to return to his university studies after the war ended and, after taking the required state examinations, he was awarded his state qualification to teach in Gymnasiums in\n1920\n. The topics he was examined in were mathematics, theoretical physics, experimental physics, and chemistry.\nIt had been\nSchur\n's mathematics which had attracted Prüfer most so, after completing his first degree, he undertook research for his doctorate under\nSchur\n's supervision. This was an exciting time for algebraists at the University of Berlin for\nSchur\nwas gathering a group of talented young people around him. During the time that Prüfer worked with\nSchur\n, students such as\nAlfred Brauer\nand his brother\nRichard Brauer\nattended\nSchur\n's seminar.\nSchur\nheld weekly problem hours, and in these sessions he would give the students difficult problems most of which he had solved, but occasionally he gave the class an open problem which he did not know how to solve. Early in his years as a research student working on algebra, Prüfer published his first paper\nNeuer Beweis eines Satzes über Permutationen\nⓉ\n(\nNew proof of a theorem on permutations\n)\n.\nFor his doctorate, Prüfer was examined on\n28\nApril\n1921\n. The mathematics oral was conducted by\nIssai Schur\nand\nErhard Schmidt\nwho, respectively, evaluated Prüfer as very good and as excellent. He was also examined in theoretical physics by\nMax Planck\nwho rated his performance as excellent. Prüfer wrote his doctoral thesis on abelian groups, the topic for which he is best remembered today. His thesis entitled\nUnendliche Abelsche Gruppen von Elementen endlicher Ordnung\nⓉ\n(\nInfinite abelian groups of elements of finite order\n)\nwas submitted to the University of Berlin in\n1921\nand after he was examined by\nIssai Schur\nand\nErhard Schmidt\nhe was awarded the degree on\n13\nOctober of that year. The thesis was rated 'opus valde laudabile', very praiseworthy work, as indeed it was. It is worth noting that the results that Prüfer proved in this work are all stated in terms of countable abelian groups although they hold for abelian groups of arbitrary cardinality. The reason for restricting the results in that way was that cardinals greater than countable were not accepted by all mathematicians at that time.\nAfter the award of his doctorate, Prüfer was appointed as an assistant in Hamburg. In\n1923\nhe moved to a second assistantship, this time in Jena as an assistant to\nPaul Koebe\n. Now\nKoebe\n, who had been an ordinary professor at Jena since\n1914\n, left in\n1926\nwhen he moved to Leipzig. However, Prüfer remained at Jena, where he had obtained his permission to teach, and gave courses during the two semesters of session\n1926\n-\n27\n. In October\n1927\nhe became a\ndocent\nat the Westfälische Wilhelms University of Münster, holding this post until he was promoted to professor in\n1930\n. He gave his inaugural lecture at Münster on\n17\nDecember\n1927\nentitled\nDas Problem der heutigen mathematischen Grundlagenforschung\nⓉ\n(\nThe problem of today's  basic mathematical research\n)\n. At Münster he regularly taught large classes giving courses on analytic geometry, projective geometry and\ndifferential geometry\n. He also gave short specialised courses on higher algebra, knot theory and the logical foundations of mathematics. He held this chair for less that four years due to his early death from lung cancer at the age of\n37\n. Adolf Mader writes in\n[\n2\n]\n:-\nHeinz Prüfer was a shy but independent person, and not easy to approach. He was a dedicated and serious teacher and in all his work extremely careful - a trait that his dissertation demonstrates convincingly with its even and impeccable script. In spite of his youth he was quite bald, chubby and wearing a beard, not exactly handsome in appearance. He left a wife when he died of lung cancer at the age of\n37\n. However, they had no children.\nHeinrich Behnke\nand Gottfried Köthe described Prüfer in\n[\n1\n]\nin a similar way:-\n... as reserved, very independent and conscientious, for example in his lectures.\nPrüfer was an algebraist whose name is familiar to many people even though his bibliography comprises only a few items, four of which are concerned with the structure of abelian groups. The usual claim is that he published only\n9\npapers and one book. We should note, however, that several of the papers are long, being around\n40\npages. One of the papers is in two parts. In addition he published solutions to two problems posed by\nGeorge Pólya\n. The posthumous book,\nProjective Geometry\n(1935)\n, was edited by G Fleddermann and G Köthe based on Prüfer's lecture notes at Münster University. With later editions of the book included, this means that in total we are able to list\n15\npublications by Prüfer. See\nTHIS LINK\n.\nIn\n1923\nhe published\nUntersuchungen über die Zerlegbarkeit der abzählbaren primären Abelschen Gruppen\nⓉ\n(\nStudies on the dismantling of countable primary Abelian groups\n)\nwhich investigates the decomposability of countable primary abelian groups. This paper introduces the concepts of height and purity, and investigates how far the basis theorem for finite abelian groups generalises to countable\np\np\np\n-groups. It also contains the 'Theorem of Prüfer':-\nEvery countable p-group is the direct sum of rank\n1\ngroups if and only if every element of infinite height is contained in a subgroup of type\np\n∞\np^{\\infty }\np\n∞\n.\nThe 'Prüfer group'\nZ\n(\np\n∞\n)\n\\mathbb{Z}(p^{\\infty )}\nZ\n(\np\n∞\n)\nprovides an example to show that there exist countable\np\np\np\n-groups that are not the direct sum of rank\n1\ngroups.\nIn his next major contribution to abelian groups Prüfer published a two part paper\nTheorie der Abelschen Gruppen\nⓉ\n(\nTheory of Abelian groups\n)\n. The first part appeared in\n1924\nand the second in the following year. In this paper Prüfer stresses that all the results hold for modules over a principal ideal domain. The 'Prüfer topology' in introduced in the second paper as is a concept which Lefschetz called 'linearly compact groups' in a paper he published in\n1942\n. Prüfer gives a decomposition theorem for 'linearly compact groups' and shows that those of finite rank are the direct product of rank\n1\ngroups.\nIn addition to his work on abelian groups, Prüfer also worked on\nalgebraic numbers\n, publishing the paper\nNeue Begründung der algebraischen Zahlentheorie\nⓉ\n(\nNew justifications in algebraic number theory\n)\nin\n1925\n, and knot theory. His lecture notes on knot theory were published in\n1933\nas a\n40\npage paper with the title\nKnotentheorie\nⓉ\n(\nKnot theory.\n)\n. A reviewer writes:-\nA clear and easy to understand introduction to the problems and methods of knot theory: Formulation of knot problems; older methods\n(\nthe knot scheme\n)\n; the fundamental group of knot space; the linking number; a knot associated matrix and its elementary divisors; closed and open braids.\nHe also published a paper on\nSturm\n-\nLiouville\ntheory;\nNeue Herleitung der Sturm-Liouvilleschen Reihenentwicklung stetiger Funktionen\nⓉ\n(\nNew derivation of Sturm-Liouville series expansion of continuous functions\n)\n(1926)\n. In it Prüfer gives a very simple proof of an expansion theorem for a particular second order linear homogeneous differential equation coming from the oscillation and evolution theorem.\nLudwig Bieberbach\nand Erich Kamke\n(1890\n-\n1961)\nboth included Prüfer's ideas into the\n1930\neditions of their respective books. After Prüfer's death his lectures notes on projective geometry were collected and published as the\n314\npage book\nProjektive Geometrie\nⓉ\n(\nProjective geometry\n)\n(1933)\n. A second edition of the book was published in\n1953\n.\nExtracts from three reviews of this books are given at\nTHIS LINK\n.\nAdolf Mader sums up Prüfer's contributions to the theory of abelian groups in\n[\n2\n]\n:-\nWhile Prüfer's dissertation 'Unendliche Abelsche Gruppen von Elementen endlicher Ordnung'\nⓉ\n(\nInfinite Abelian groups of elements of finite order '\n)\nis elegant, definitive, and modern, the papers 'Theorie der Abelschen Gruppen\n1\n'\nⓉ\n(\nTheory of Abelian groups\n1\n)\nand 'Theorie der Abelschen Gruppen\n2\n'\nⓉ\n(\nTheory of Abelian groups\n2\n)\n, although impressive, are largely outdated and difficult to read. They did, however, inspire a flurry of research by Pietrkowski,\nKrull\n, Schöneborn, Leptin and\nKaplansky\n, and linearly compact modules and rings are still objects of active research although few will know that the concept originated with Heinz Prüfer.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}