{
  "nome_completo": "Heinrich Maschke",
  "nome_curto": "Heinrich Maschke",
  "ano_nascimento": "1853",
  "ano_morte": "1908",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maschke/",
  "lugar_nascimento": "Breslau, Prussia (now Wrocław, Poland)",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Heinrich Maschke\n's father was an important medical man. Heinrich attended the\nGymnasium\nin Breslau where he showed great ability. He entered the University of Heidelberg in\n1872\n, studying there under\nKönigsberger\n.\nMilitary service was required at that time so Maschke spent a year in the army before he continued his studies at the University of Berlin. At Berlin he was taught by some outstanding mathematical teachers including\nWeierstrass\n,\nKummer\nand\nKronecker\n. He took the examinations to become a secondary school teacher in\n1878\nbut he was aiming higher than this for he wanted to become a university teacher. In common with the standard practice of the time he moved around different German universities, next going to Göttingen from where he received his doctorate in\n1880\n. Realising that it would be almost impossible to obtain a university position, Maschke decided to take up secondary school teaching.\nHis first teaching post was in the Luisenstädtische Gymnasium in Berlin. However he found both the long hours teaching and the elementary nature of the mathematics he was having to teach made him feel that he was in the wrong profession. This said, he was by all accounts a very good school teacher. He was given a sabbatical year and returned to Göttingen for the year\n1886\n-\n87\n, working there with\nKlein\n. He had become a close friend of\nBolza\n's while the two studied together at Berlin, and they were now together again at Göttingen both working with\nKlein\n. Maschke found working with\nKlein\nin his home in the evenings very rewarding and was fascinated with\nKlein\n's ideas on using\ngroup theory\nto solve algebraic equations. Due to\nKlein\n's encouragement, Maschke published his first paper in\n1887\n, namely\nÜber die quaternäre endliche, lineare Substitutionsgruppe der Borchardt'schen Moduln\nⓉ\n(\nOn the quaternary finite, linear substitution group of modules of Borchardt\n)\n.\nHermite\n,\nKronecker\nand\nBrioschi\nhad, in\n1858\n, discovered how to solve the quintic equation by means of\nelliptic functions\n. In\n1888\nMaschke proved that a particular sixth-degree equation could be solved by using hyperelliptic functions and\nBrioschi\nshowed that any sixth-degree algebraic equation could be reduced to Maschke's equation and therefore solved in the same way.\nMaschke had returned to the Gymnasium in Berlin before he wrote the paper we just mentioned but, as is evident, he was not teaching in a secondary school yet concentrating on research. However, he wrote to\nKlein\non\n8\nDecember\n1888\n:-\n... everyone here works in isolation and can hardly be moved to talk about his research.\nBy\n1889\nhe had made a definite decision to give up school teaching. In this year\nBolza\n, who was by now in the United States, was working at Johns Hopkins University where he had been given a temporary short-term appointment, and he had already accepted an appointment at Clark University in Worcester, Massachusetts. Maschke decided that the best course of action for him was to follow\nBolza\nto the United States but\nBolza\nwarned him that it was not easy to get academic positions there. Maschke thought he had better have qualifications to enter some other profession otherwise he might emigrate to the United States and end up there as a school teacher - the profession he had now decided to give up. Keeping his teaching post, he began part-time study of electrotechnics at the Polytechnicum in Charlottenburg in\n1889\n-\n90\n. In\n1890\nhe resigned his teaching post and took up full-time technical training in Darmstadt.\nIn\n1891\nMaschke emigrated to the United States and worked for a year with the Western Electrical Instrument Company, Newark, New Jersey. In\n1892\nthe University of Chicago opened and the head of the mathematics department,\nEliakim Moore\n, began building up a strong unit.\nBolza\njoined the University of Chicago in\n1892\nand then he persuaded\nMoore\nto appoint Maschke to Chicago. The three were highly influential in building up a strong mathematics research school in Chicago. R C Archibald writes:-\nThese three men supplemented one another remarkably.\nMoore\nwas a fiery enthusiast, brilliant, and keenly interested in the popular mathematical research movements of the day;\nBolza\n, a product of the meticulous German school of analysis led by\nWeierstrass\n, was an able, and widely read research scholar; Maschke was more deliberate than the other two, sagacious, brilliant in research, and a most delightful lecturer in geometry. During the period\n1892\n-\n1908\nthe University of Chicago was unsurpassed in America as an institution for the study of higher mathematics.\nBetween\n1892\nand\n1910\nthe mathematics department was outstandingly successful with thirty-nine students graduating with doctorates\n(\nbut only five of them were students of Maschke\n)\n. Maschke was promoted to associate professor in\n1896\nand then to full professor in\n1907\n.\nUnder\nKlein\n's inspiration while at Göttingen, Maschke had worked in group theory, in particular working on finite groups of linear transformations. He is best known today for Maschke's theorem, which he published in\n1899\n, which states that if the order of the finite group\nG\nG\nG\nis not divisible by the characteristic of the field\nK\nK\nK\n, then the\n(\nfinite-dimensional\n)\nK\nK\nK\n-representations of\nG\nG\nG\nare completely reducible. A closer look at events surrounding this provide an interesting insight into the interplay between various mathematicians. Maschke proved a special case of his theorem in the paper\nÜber den arithmetischen Charakter der Coefficienten der Substitutionen endlicher linearer Substitutionsgruppen\nⓉ\n(\nOn the arithmetic nature of the coefficients of linear finite substitution groups\n)\npublished in\n1898\n. The general result appeared in the following year in\nBeweiss des Satzes, dass diejenigen endlichen linearen Substitutionesgruppen, in welchen einige durchgehends verschwindende Coefficienten auftenen intransitiv sind\nⓉ\n(\nProof of the result that those finite linear substitution groups in which some coefficients vanish are intransitive\n)\n. In his proof Maschke used a theorem by\nMoore\nwhich he had announced to the Mathematics Club at the University of Chicago on\n10\nJuly\n1896\n. He had subsequently written it up in a paper which he submitted to\nKlein\nfor publication in\nMathematische Annalen\n.\nKlein\nreported to\nMoore\nthat\nAlfred Loewy\nhad stated the result without proof in an article he published in\n1896\n. Moore's paper appeared in\nMathematische Annalen\ntwo years later and the\nLoewy\n-Moore theorem provided Maschke with a critical step in the proof of his own theorem.\nMaschke's second area of work was on\ndifferential geometry\nin particular the theory of quadratic differential quantics. In this area, which he started to work in after\n1900\n, he led the symbolic treatment of the subject.\nAt Chicago, together with\nMoore\n, Maschke was responsible for the rapid rise to eminence of the University in mathematics research.\nDavid Smith\nwriting in\n[\n8\n]\nsays:-\nHe devoted the remainder of his life to the training of mathematicians and to assisting in building up and maintaining a strong department in that university. He was a teacher of great ability and his courses were made more valuable by his all-round culture, by his originality of thought, and by his personal interest in the large numbers of young mathematicians who attended his lectures.\nAmong the papers he published while at Chicago are:\nOn systems of six points lying in three ways in involution\n(1896)\n,\nNote on the unilateral surface of Möbius\n(1900)\n,\nA new method of determining the differential parameters and invariants of quadratic differential quantics\n(1900)\n,\nOn superosculating quadric surfaces\n(1902)\n,\nA symbolic treatment of the theory of invariants of quadratic differential quantics of n variables\n(1903)\n,\nDifferential parameters of the first order\n(1906)\n;\nThe Kronecker-Gaussian curvature of hyperspace\n(1906)\nand\nA geometrical problem connected with the continuation of a power-series\n(1906)\n. Six of these papers were published in the\nTransactions of the American Mathematical Society\nand Maschke played a large role in getting the\nAmerican Mathematical Society\nestablished, being a founder member of the Chicago Section of the Society in\n1897\n. Maschke served on the Council of the\nAmerican Mathematical Society\nfrom\n1902\nto\n1905\nand was vice president of the Society in\n1907\n.\nEliakim Moore\nrecognised the influence of Klein, through\nBolza\nand Maschke, on his leading American research university and wrote to him in\n1904\nsaying\n[\n7\n]\n:-\nCertainly in the domain of mathematics German scholars in general and yourself in particular have played, by way of example and counsel and direct and indirect inspiration, quite a leading role in the development of creative mathematicians in this country ...\nAt the end of February\n1908\nMaschke entered hospital to undergo emergency surgery. He died following complications.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}