{
  "nome_completo": "Heinz Bauer",
  "nome_curto": "Heinz Bauer",
  "ano_nascimento": "1928",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bauer/",
  "lugar_nascimento": "Nuremberg, Germany",
  "lugar_morte": "Nuremberg, Germany",
  "biografia": "Heinz Bauer\nwas educated at the\nRealgymnasium\nin Nürnberg, obtaining his leaving qualification in\n1947\n. He spent the year\n1947\n-\n48\ndoing compulsory service as an assistant construction worker. Then, in\n1948\n, he entered the University of Erlangen, officially named the Friedrich-Alexander-Universität at this time, to begin his studies of mathematics and physics. His lecturers included Georg Nöbeling and\nOtto Haupt\nwho suggested that he went to study for a period with\nJean Dieudonné\nand\nLaurent Schwartz\nat the University of Nancy in France.\nDieudonné\nand\nSchwartz\nwere at this time two of the leading members of\nBourbaki\n, and the style of mathematics which they were promoting had a lasting influence on Bauer. In fact his first paper\nEine Rieszsche Bandzerlegung im Raum der Bewertungen eines Verbandes\nⓉ\n(\nA Riesz-band decomposition in the space of an association ratings\n)\n(1953)\n, which studies decompositions of valuations of a lattice by use of\nF Riesz\n's bands in complete vector lattices, shows strong\nBourbaki\ninfluences.\nIn the autumn of\n1952\nBauer took the examinations to qualify as a high school teacher in Bavaria, then in February of the following year he was awarded a doctorate, with distinction, from Erlangen for his thesis\nReguläre und singuläre Abbildungen eines distributiven Verbandes in einen vollständigen Vektorverband, welche der Funktionalgleichung\nf\n(\nx\n∨\ny\n)\n+\nf\n(\nx\n∧\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nf (x \\lor  y) + f (x \\land  y) =  f (x) + f (y)\nf\n(\nx\n∨\ny\n)\n+\nf\n(\nx\n∧\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\ngenügen\nⓉ\n(\nRegular and singular images of a distributive lattice in a complete vector lattice which satisfy the functional equation  f\n(\nx {wedge} y\n)\n+ f\n(\nx {vec} y\n)\n= f\n(\nx\n)\n+ f\n(\ny\n)\n)\nwhich he had written with\nOtto Haupt\nas his advisor. The work was published in the papers\nEine Rieszsche Bandzerlegung im Raum der Bewertungen eines Verbandes\nⓉ\n(\nA Riesz-band decomposition in the space of an association ratings\n)\n(1953)\nand a paper with the same title as his thesis which was published in\nCrelle\n's Journal in\n1955\n. He remained at Erlangen as an assistant, and he\nhabilitated\nthere in\n1956\n. His main interests at this time were in measure and integration, and in the work submitted for his habilitation he studied an abstract\nRiemann\nintegral, introduced by L H Loomis, from the point of view of the theory of\nRadon\nmeasure.\nBauer spent\n1956\n-\n57\nas a Research Fellow at the Centre National de la Recherche Scientifique, Paris, working with Gustave Choquet and Marcel Brelot. It was at this time that he became interested in potential theory and convexity theory, two areas to which he was to make major contributions over the rest of his career. In\n1961\nBauer was appointed to the University of Hamburg where he was appointed director of the Institute of Actuarial Mathematics and Mathematical Statistics and together with\nEmil Artin\n,\nLothar Collatz\n,\nHelmut Hasse\n,\nEmanuel Sperner\nand\nErnst Witt\nbecame one of the directors of the Mathematics seminar at the University of Hamburg. However, he did not take up the appointment at Hamburg straight away, for he had already planned spending the period from August\n1961\nto April\n1962\nas Visiting Associate Professor at the University of Washington in Seattle. In Hamburg, Bauer replaced Leopold Schmetterer, who had moved to Vienna to succeed\nJohann Radon\nwho had died in\n1956\n. Bauer made a research visit to Paris in the spring of\n1964\n. He has served as Dean of the Faculty of Sciences at the University of Hamburg in session\n1964\n-\n65\n.\nOn\n1\nSeptember\n1965\n, Bauer became a full professor at the University of Erlangen. We note that the University of Erlangen had been renamed Friedrich-Alexander-University Erlangen-Nurnberg in\n1961\nafter merging with the Nurnberg College of Economics and Social Sciences. He held this chair for\n31\nyears until his retirement, but he also held visiting positions in a number of universities, some of which we have mentioned above, but the remainder include the University of Munich, the University of Washington, the Sorbonne, the California Institute of Technology, New Mexico State University, and Aarhus University.\nChatterji\n[\n2\n]\nwrites:-\nWhat obviously impresses any one reading any of the papers of Bauer is the clarity and precision of the presentation; these qualities are perceptible right from his very first publications. It is therefore not surprising that he has written several highly successful textbooks and very useful expository articles.\nWe now look briefly at some of these 'highly successful textbooks' he published. The first of these\nWahrscheinlichkeitstheorie und Grundzüge der Masstheorie\nⓉ\n(\nProbability theory and Broad Mass Theory\n)\nwas published in\n1964\nwhile he was still at Hamburg. L L Helms writes in a review:-\nThis book is in two parts. The first part is a standard development of\nmeasure theory\n, containing three chapters dealing with measure theory, integration theory, and product measure spaces in that order. ... The second part of the book is devoted to\nprobability theory\n. Generally speaking, only probability theory as it pertains to product measure spaces is discussed. ... The book is efficiently organized, with emphasis entirely on positive results.\nLectures Bauer gave in the summer semester of\n1965\nat Hamburg were published as\nHarmonische Räume und ihre Potentialtheorie\nⓉ\n(\nHarmonic spaces and their potential theory\n)\n(1966)\nand further lectures, inspired by\nDieudonné\n's book\nFoundations of modern analysis\nappeared as two separate texts\nDifferential- und Integralrechnung\n. I, II\nⓉ\n(\nDifferential and integral calculus. I, II\n)\n(1966)\n. These latter two texts give an excellent account of the basic concepts of analysis. In\n1968\nhe published a second book with the title\nWahrscheinlichkeitstheorie und Grundzüge der Masstheorie\nⓉ\n(\nProbability theory and Broad Mass Theory\n)\n. The first half of this volume consists of the\n1964\ntext, and it is followed by a section on measure in topological spaces and on the\nFourier\ntransform. The final part of the text proceeds at a much faster pace and covers topics such as the central limit theorem, conditional expectation, martingales, and some topics in stochastic processes. An English version\nProbability Theory and Elements of Measure Theory\nwas published in\n1972\n.\nFurther editions of the German text appeared, the third in\n1978\n, and the fourth edition of\n1991\nwas published with the title\nWahrscheinlichkeitstheorie\nⓉ\n(\nProbability theory\n)\n. Because of the great popularity the book enjoyed, an extensive reworking and expansion of the sections on probability appeared in English translation as\nProbability theory\nin\n1996\n, with the same treatment was given to the sections of measure theory, published in English translation as\nMeasure and integration theory\nin\n2001\n.\nAnother book by Bauer also became a classic. This was\nMass- und Integrationstheorie\nⓉ\n(\nDimensions and integration theory\n)\n(1990)\nwhich provided an introduction to measure theory and the theory of integration. A second edition was published in\n1992\n. A collaboration with Bernd Anger led to the publication of\nMehrdimensionale Integration\n(1976)\nwhich developed\n(\nfrom a review by L Janos\n)\n:-\n... the theory of multidimensional Lebesgue integration as a tool for handling integrals involved in problems of analysis and mathematical statistics\n(\nthe gamma function, the\nGauss\ndistribution function, potential theory, the volume of the\nn\nn\nn\n-dimensional sphere, etc.\n)\n.\nBauer has served as Editor of\nInventiones mathematicae\n(1966\n-\n79)\n,\nMathematische Annalen\n,\nExpositiones Mathematicae\n, and\nAequationes Mathematicae\n. He served as a member of the Board of the Mathematical Research Institute of Oberwolfach for sixteen years from\n1966\n. He was honoured with election to the Bavarian Academy of Sciences in\n1975\n, and was also elected to the\nFinnish Academy of Sciences\n, the\nAustrian Academy of Sciences\n, the\nRoyal Danish Academy of Sciences\nand the\nGerman Academy of Natural Scientists Leopoldina\n. He was the chairman of Mathematics section of this Academy in\n1991\n. He was a winner of the Bavarian Order of Merit and the Bavarian Maximilian's Order of Science and the Arts. The Charles University, Prague, awarded him their medal in\n1987\nand in\n1992\nawarded him an honorary doctorate. The University of Dresden also awarded him an honorary doctorate in\n1994\n. He was for many years a member of the\nGerman Mathematical Society\nand served as its President during\n1976\n-\n77\n.\nNetuka writes\n[\n7\n]\n:-\nIn\n1974\nBauer was an invited speaker at the International Congress of Mathematicians in Vancouver. His contribution ti the Proceedings starts as follows: \"In\n1964\nPierre Jacquinot opened a colloquium on potential theory in Orsay, France, by comparing potential theory with a road intersection in mathematics. This was ten years ago. Meanwhile traffic has increased, and crossroads had to be converted into interchanges of highways - also in potential theory.\" The first part of the contribution addresses three aspects of classical potential theory: superharmonic functions, Newtonian kernel and potentials, Brownian motion. The role of balayage is emphasised. The second part reflects two main sspects of potential theory of the early seventies: harmonic spaces and Markov processes. The last part is devoted to Fuglede's theory of finely harmonic functions, including an application to asympototic paths for subharmonic functions.\nIn April\n1979\nBauer was a plenary speaker at the\nBritish Mathematical Colloquium\nwhich was held at University College, London. He spoke on\nKorovkin approximation and convexity\n.\nIn\n1980\nBauer received the Chauvenet Prize from the\nMathematical Association of America\n. The\nAmerican Mathematical Monthly\nreported\n[\n1\n]\n:-\nThe Board of Governors of the\nMathematical Association of America\nvoted to award the\n1980\nChauvenet Prize to Professor Heinz Bauer for his paper \"Approximation and Abstract Boundaries,\" which appeared in this Monthly in\n1978\n. A certificate and monetary award in the amount of five hundred dollars were presented to Professor Bauer at the Business Meeting of the Association on January\n6\n,\n1980\n. The Chauvenet Prize is awarded for a noteworthy paper of an expository or survey nature published in English that comes within the range of profitable reading for members of the Association. ... Professor Bauer is involved in research in integration theory, functional analysis\n(\nconvexity and approximation theory\n)\n, potential theory, and Markov processes. ... The paper for which Professor Bauer received the Chauvenet Prize discusses three famous theorems of P P Korovkin that concern uniform approximation of functions. These theorems are presented in a well-chosen setting and are illustrated and illuminated superbly with a collection of examples and applications. The paper is accessible to graduate students who have learned about the Lebesgue integral.\nBauer retired from his chair in Erlangen in the spring of\n1996\n. Sadly he suffered a stroke in the summer of that year from which he never fully recovered. In addition to his outstanding professional qualities, Bauer was known for his exceptionally broad general education, his knowledge of literature and history, his love of music and his high appreciation of cultural values.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}