{
  "nome_completo": "Heinz Hopf",
  "nome_curto": "Heinz Hopf",
  "ano_nascimento": "1894",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hopf/",
  "lugar_nascimento": "Gräbschen (near Breslau), Germany (now Wrocław, Poland)",
  "lugar_morte": "Zollikon, Switzerland",
  "biografia": "Heinz Hopf\n's father was Wilhelm Hopf and his mother was Elizabeth Kirchner. Wilhelm Hopf was from a Jewish family. He joined Heinrich Kirchner at his brewery in Breslau in\n1887\n. Wilhelm married Elizabeth, Heinrich Kirchner's eldest daughter, in\n1892\nand by that time he owned the brewery firm. They had two children, the eldest Hedwig was born in\n1893\nwhile Heinz was born in the following year. Elizabeth Hopf was a Protestant and, in\n1895\n, Wilhelm converted to his wife's religion.\nHeinz attended Dr Karl Mittelhaus's school from\n1901\nuntil\n1904\nand following this he began his studies at the König-Wilhelm\nGymnasium\nin Breslau. He attended the Gymnasium until\n1913\nand it was at this school that his talent for mathematics first became clear to his teachers. In his other subjects, however, his results were less good and it is probable that he devoted too much time to sport, he was particularly fond of swimming and tennis, and not enough to his academic subjects. He left the Gymnasium with the mathematics report stating:-\nHe has shown an extraordinary gift in this topic, especially in the algebraic direction.\nIn April\n1913\nHopf entered the Silesian Friedrich Wilhelms University in Breslau to read for a degree in mathematics. There he was taught by\nKneser\n,\nSchmidt\n, and\nRudolf Sturm\n. He also attended lectures by\nDehn\nand\nSteinitz\nwho taught at the polytechnic in Breslau. However, his studies were interrupted by the outbreak of World War I in\n1914\n. He immediately enlisted and for the duration of the war he fought on the Western front as a lieutenant. During a fortnight's leave from military service in\n1917\nHopf went to a class by\nSchmidt\non set theory at the University of Breslau. From that time on he knew that he wanted to undertake research in mathematics. He wrote in\n[\n13\n]\nabout the influence\nSchmidt\n's lectures had on him :-\nI was fascinated; this fascination - of the power of the method of the mapping degree - has never left me since, but has influenced major parts of my work. And when I look for the cause of this effect, I see particularly two things: firstly,\nSchmidt\n's vividness and enthusiasm in his lecture, and secondly my own increased receptiveness during a fortnight off after many years of military service.\nAfter the war Hopf returned to his studies in Breslau but after about a year he left and went to the University of Heidelberg. By this time\nSchmidt\nhad left Breslau and it appears that Hopf wanted to go to Heidelberg to be with his sister who had begun her studies there in the previous year. At Heidelberg Hopf took courses in philosophy and psychology as well as attending courses by\nPerron\nand\nStäckel\n. In\n1920\nHopf went to study for his doctorate at the University of Berlin where\nSchmidt\nwas now teaching. He attended several courses by\nSchur\nin Berlin and he received his doctorate in\n1925\nwith a thesis, supervised by\nSchmidt\n, studying the\ntopology\nof manifolds. Among other results, he classified simply connected Riemannian\n3\n-manifolds of constant curvature in this thesis. It was an impressive piece of work which received the following praise from\nSchmidt\nin his report\n(\nsee for example\n[\n11\n]\n)\n:-\nThe boldness of the questions deserves as much admiration as the surprising results of the solutions. But the most beautiful thing in the thesis is the method of proving, which is, particularly rarely found in works in that area, abstract and comprehensible in every step, and which, due to the abstractness, shows equally clearly the richness of the concrete geometric imagination.\nBieberbach\nand\nSchmidt\nexamined him in mathematics, while\nPlanck\nexamined him in physics.\nHopf went to Göttingen in\n1925\nwhere he met\nEmmy Noether\n. Her contributions would play an important part in Hopf's developing ideas. Perhaps even more significant was the fact that\nAleksandrov\nwas also spending time in Göttingen and Hopf wrote in\n[\n13\n]\n:-\nMy most important experience in Göttingen was to meet Pavel\nAleksandrov\n. The meeting soon became friendship; not only topology, not only mathematics was discussed; it was a fortunate and also a very happy time, not restricted to Göttingen but continued on many joint journeys.\nDuring this year in Göttingen Hopf worked on his\nhabilitation\nthesis which was completed by the autumn of\n1926\n. The thesis contains a different proof of the fact just shown by\nLefschetz\nthat for any closed manifold the sum of the indices of a generic vector field is a topological invariant, namely the\nEuler\ncharacteristic.\nAleksandrov\nand Hopf spent some time in\n1926\nin the south of France with\nNeugebauer\n. Then the two spent the academic year\n1927\n-\n28\nat Princeton in the United States. This was an important year in the development of topology with\nAleksandrov\nand Hopf in Princeton and able to collaborate with\nLefschetz\n,\nVeblen\nand\nAlexander\n. During their year in Princeton,\nAleksandrov\nand Hopf planned a joint multi-volume work on\nTopology\nthe first volume of which did not appear until\n1935\n. This was the only one of the three intended volumes to appear since World War II prevented further collaboration on the remaining two volumes.\nHopf married Anja von Mickwitz in October\n1928\n. He was offered an assistant professorship by Princeton in December\n1929\nbut he rejected the offer. In\n1930\nWeyl\nleft his chair in the ETH in Zürich to take up a chair at Göttingen and in\n1931\nHopf was approached to see if he was interested in accepting this chair. In part the offer had been prompted by a very positive recommendation which\nSchur\nhad sent to Zürich:-\nHopf is an excellent lecturer, a mathematician of strong temperament and strong influence, a leading example in his discipline ... I cannot wish you a better colleague in respect to his manners, his education and his sympathetic nature.\nHopf replied to the approach of the ETH in Zürich indicating that he would accept a formal offer:-\nA call to Switzerland, to the beautiful city of Zürich, could indeed tempt and honour me, particularly to such a famous chair. I therefore declare that I am in principle willing to accept such an offer.\nHowever, before receiving the formal offer from Zürich, Hopf received the offer of a chair at Freiburg but he waited for the Zürich offer and accepted it. He took up his duties in Zürich in April\n1931\n. The next few years were not easy ones for Hopf. After the Nazis came to power in Germany in\n1933\n, Hopf's father, being Jewish, came under increasing pressure. Hopf continued to visit his parents in Breslau up until\n1939\n. Seeing the difficulties that his father faced Hopf arranged for his parents to receive immigration papers for Switzerland. However, his father fell ill and could not travel.\nHopf was able to provide refuge in Switzerland for friends who had to flee Germany under the Nazis. In particular\nSchur\ncame for a while before finally going to Palestine in\n1939\n. Hopf's own position became more difficult, however, for he was still a German citizen.\nLefschetz\n, realising Hopf's difficulties, invited him to Princeton but Hopf refused. Then in\n1943\nhe was told to move back to Germany or he would lose his German citizenship. Faced with this he had little choice but to quickly apply for Swiss citizenship, which was soon granted.\nWith the end of World War II Hopf was able to help his German friends again. He did much more than this, however, for he put much energy into trying to re-establish a mathematical community in Germany. His visit to the research centre in Oberwolfach in August\n1946\nwas part of his efforts. Soon after the Oberwolfach visit, Hopf went to the United States where he spent six months and there he renewed many old friendships. He was offered professorships by many of the most prestigious of the American universities but, after careful consideration, he decided to remain loyal to Zürich.\nOver the next few years he enjoyed invitations to lecture at leading international conferences, and he visited many places including Paris, Brussels, Rome and Oxford. He spent the academic year\n1955\n-\n56\nwith his wife in the United States.\nMost of Hopf's work was in\nalgebraic topology\nwhere he can be thought of as continuing\nBrouwer\n's work. He studied\nhomotopy\nclasses and vector fields producing a formula about the integral curvature.\nHopf extended\nLefschetz\n's fixed point formula in work which he undertook in\n1928\n. It is in this\n1928\npaper that he first explicitly used homology groups. His work on the homology of manifolds, undertaken in Princeton in\n1927\n-\n28\n, led to his definition of the intersection ring by defining a product on cycles by their intersection. This idea was later seen to be connected to\ncohomology\n.\nHe defined what is now known as the 'Hopf invariant' in\n1931\n. This was done in his work on maps between spheres of different dimensions which cannot be distinguished homologically so required the introduction of a new invariant. In\n1939\nhe examined the homology of a compact Lie group. This was to attack questions posed to him by\nÉlie Cartan\n. The ideas which he introduced in this investigation led to him defining what is today called a Hopf algebra.\nIn the early\n1940\ns Hopf published\n[\n11\n]\n:-\nThe paper Fundamentalgruppe und zweite Bettische Gruppe\nⓉ\n(\nThe fundamental group and Betti's second group\n)\n[\nwhich\n]\nis legitimately regarded to be the beginning of homological algebra. It opened the way for the definition for the homology and cohomology of a group. This step was made independently at different places shortly after the paper became known ...\nThe honours which Hopf received are almost too numerous to list. He was President of the\nInternational Mathematical Union\nfrom\n1955\nuntil\n1958\n. He received honorary doctorates from many universities including Princeton, Freiburg, Manchester, Sorbonne, Brussels, and Lausanne. He was awarded many prizes including the\nGauss\n-\nWeber\nmedal and the\nLobachevsky\naward. He was elected to honorary membership of many learned societies throughout the world.\nFreudenthal\ngives this description of Hopf in\n[\n1\n]\n:-\nHopf was a short, vigorous man with cheerful, pleasant features. His voice was well modulated, and his speech slow and strongly articulated. His lecture style was clear and fascinating; in personal conversation he conveyed stimulating ideas.\nFrei and Stammbach in\n[\n11\n]\npay this tribute to Hopf:-\nWithout doubt Heinz Hopf was one of the most distinguished mathematicians of the twentieth century. His work is closely linked with the emergence of algebraic topology; it is most decisively thanks to his early works that this area established itself as a new and important branch of mathematics. his work has influenced profoundly the evolution not only of topology but of a large part of mathematics. But Heinz Hopf was not only a gifted researcher: he was also an excellent teacher and a personality of the highest integrity. at the same time, he effervesced with charm and subtle humour.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Topology"
  ]
}