{
  "nome_completo": "Helmut Hasse",
  "nome_curto": "Helmut Hasse",
  "ano_nascimento": "1898",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hasse/",
  "lugar_nascimento": "Kassel, Germany",
  "lugar_morte": "Ahrensburg (near Hamburg), Germany",
  "biografia": "Helmut Hasse\n's father was a judge. His mother was born in Milwaukee, Wisconsin, USA but lived in Kassel from the age of five. Helmut's education was at various secondary schools near to Kassel until in\n1913\n, when he was\n15\nyears of age, his father was appointed to an important position in Berlin and the family moved there. Helmut studied for two years at the Fichte-\nGymnasium\nin Berlin before volunteering for naval service during World War I.\nIn the academic year\n1917\n/\n18\nHasse was stationed at Kiel on his naval duties and he was able to attend the lectures of Otto\nToeplitz\n. On leaving the navy he entered the University of Göttingen. His teachers there included\nEdmund Landau\n,\nHilbert\n,\nEmmy Noether\nand\nHecke\n. In fact he was most influenced by\nHecke\ndespite the fact that\nHecke\nleft Göttingen to take up an appointment in Hamburg only a few months after Hasse arrived in Göttingen.\nIt might be supposed that Hasse would have followed\nHecke\nto Hamburg but he did not take this route, going to study under\nHensel\nat Marburg in\n1920\n.\nHensel\n's work on\np\np\np\n-adic numbers was to have a major influence on the direction of Hasse's research. In October\n1920\nHasse discovered the 'local-global' principle which shows that a\nquadratic form\nthat represents\n0\nnon-trivially over the\np\np\np\n-adic numbers for each\nprime\np\np\np\n, and over the real numbers, represents\n0\nnon-trivially over the\nrationals\n. The importance of this result, now known as the Hasse principle, is that both the representability of a number by a given form and whether two forms are equivalent can be decided using only local information.\nThe 'local-global' principle and its applications form an important part of his doctoral thesis\nÜber die Darstellbarkeit von Zahlen durch quadratische Formen im Körper der rationalen Zahlen\nⓉ\n(\nOn the description of numbers by quadratic forms in the field of rational numbers\n)\nof\n1921\nand also of his\nhabilitation\nthesis\nÜber die Aquivalenz quadratischer Formen im Körper der rationalen Zahlen\nⓉ\n(\nOn the equivalence of quadratic forms in the field of rational numbers\n)\n.\nIn\n1922\nHasse was appointed a lecturer at the University of Kiel, then three years later he was appointed professor at Halle. During his time at Kiel, Hasse kept in close contact with the mathematicians at Hamburg including\nArtin\n,\nHecke\n, Ostrowski and\nSchreier\n. He extended\nHeinrich Weber\n's work on class field theory writing several important papers and starting work on his famous report on class field theory which included the contributions of\nKronecker\n,\nHeinrich Weber\n,\nHilbert\n,\nFurtwängler\nand\nTakagi\n. As H M Edwards says in\n[\n1\n]\n:-\n...\n[\nthe text\n]\n, like any good exposition, contained a great deal of Hasse's own reworking of the material.\nAt Halle Hasse obtained fundamental results on the structure of central simple algebras over local fields. In\n1930\nHensel\nretired from Marburg and Hasse was appointed to fill his chair. While in Marburg he began joint work with\nBrauer\nand\nEmmy Noether\non simple algebras, culminating in the complete determination of what is today called the\nBrauer\ngroup\nof an\nalgebraic number field\n. He also started work on elliptic curves and, with\nBaer\n, on\ntopological\nfields. At this time he obtained a result that is particularly associated with his name, when\n(\ninspired by\nMordell\nand\nDavenport\n)\nhe proved the analogue of the\nRiemann Hypothesis\nfor\nzeta functions\nof elliptic curves.\nThe year\n1933\nwas to be significant for all of Germany and for Hasse in particular. In that year the Nazis came to power and its effect on mathematics in Germany was profound.\nMac Lane\n, who was at Göttingen at this time writes in\n[\n2\n]\n:-\nOn April\n7\n,\n1933\n, a new law ... summarily dismissed all those who were Jewish ...The effect on the Mathematical Institute\n[\nat Göttingen\n]\nwas drastic. ... All told, in\n1933\neighteen mathematicians left or were driven out from the faculty at the Mathematical Institute in Göttingen.\nWhen\nWeyl\nresigned from his professorship in Göttingen, Hasse received an offer as his successor. As Edwards says in\n[\n1\n]\n:-\n...\n[\nHasse\n]\nappeared to be potentially acceptable to the Nazis and yet was a mathematician of the highest calibre.\nFollowing the advice of\nWeyl\n, Hasse decided to accept the offer, although\n(\nsee\n[\n4\n]\nand\n[\n10\n]\n)\nhe met with fierce opposition from the fundamentalist Nazi functionaries within the Mathematics Institute and the University. In\n1934\nhe was appointed to Göttingen.\nIt is hard to understand exactly what Hasse's views were in the middle of this political mess. Edwards sums up the position in\n[\n1\n]\nas he saw it:-\nHasse's political views and his relations with the Nazi government are not easily categorised. On the one hand, his relations with his teacher\nHensel\n, who was unambiguously Jewish by Nazi standards, were extremely close, right up to\nHensel\n's death in\n1941\n... One of his most important papers was a collaboration with\nEmmy Noether\nand\nRichard Brauer\n, both Jewish, published in\n1932\nin honour of Hensel's\n70\nth\nbirthday. ... Hasse did not compromise his mathematics for political reasons ... he struggled against Nazi functionaries who tried\n(\nsometimes successfully\n)\nto subvert mathematics to political doctrine ... On the other hand, he made no secret of his strong nationalistic views and his approval of many of Hitler's policies.\nAt one point, Hasse hoped to increase his influence with the authorities and so he applied for membership in the Nazi Party. But one of Hasse's antecendents was a Jew and, therefore, membership was not granted. Officially his application was put on hold till after the war. See\n[\n2\n]\nand\n[\n10\n]\n.\nFrom\n1939\nuntil\n1945\nHasse was on war leave from Göttingen and he returned to naval duty, working in Berlin on problems in ballistics. He returned to Göttingen where, in September\n1945\nhe was dismissed from his post by the British occupation forces. His right to teach was terminated and he refused the offer of a research only position, moving to Berlin in\n1946\nwhen he took up a research post at\nBerlin Academy\n.\nH W Leopoldt\nwrites in\n[\n5\n]\n:-\nWhen he resumed teaching in\n1948\nin Berlin he attracted a large audience. In his first official lecture he compared aesthetic principles working in music and in\nnumber theory\n. Most of his examples regarding music he took from the late piano sonatas of Beethoven, which he - always an ardent piano player - intimately studied during those years. I had just begun to study mathematics, and this lecture made a lasting impression on me, in fact, it decided the further course of my studies.\nIn May\n1949\n, Hasse was appointed professor at the Humboldt University in East Berlin. His work on determining arithmetical properties of abelian number fields\nÜber die Klassenzahl abelscher Zahlkörper\nⓉ\n(\nOn the class number of abelian number fields\n)\nwas published at this time. At about the same time his textbook\nZahlentheorie\nⓉ\n(\nNumber theory\n)\nappeared which contained, for the first time, a systematic introduction to\nalgebraic number theory\nbased on the local method. It was later translated into English.\nIn\n1950\nHasse was appointed to Hamburg where he continued to teach until he retired in\n1966\n. His influence is summed up in\n[\n1\n]\nwhere Edwards writes:-\nOne of the most important mathematicians of the twentieth century, Helmut Hasse was a man whose accomplishments spanned research, mathematical exposition, teaching and editorial work.\nThis reference to editorial work is made because Hasse was editor of\nCrelle\n's Journal for\n50\nyears.\nHasse was honoured by many organisations during his life. Among them were:\nDeutsche Akademie der Naturforscher Leopoldina zu Halle,\nAkademie der Wissenschaften zu Göttingen,\nFinnische Akademie der Wissenschaften in Helsinki,\nDeutsche Akademie der Wissenschaften zu Berlin,\nAkademie der Wissenschaften und der Literatur in Mainz,\nDeutscher Nationalpreis\n1\n.Klasse für Wissenschaft und Technik,\nSpanische Akademie der Wissenschaften zu Madrid,\nDoctor honoris causa Universität Kiel,\nCothenius Medaille der Deutschen Akademie der Naturforscher Leopoldina.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}