{
  "nome_completo": "Acharya Hemchandra",
  "nome_curto": "Hemchandra",
  "ano_nascimento": "1089",
  "ano_morte": "1173",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hemchandra/",
  "lugar_nascimento": "Dhandhuka, Gujarat, India",
  "lugar_morte": "Gujarat, India",
  "biografia": "Hemchandra\n's mother was named Pahini and his father Chachadev. The name Hemchandra was one he took later in life and he was named Candradeva after he was born. The city of Dhandhuka where he was born is about\n50\nkm south west of Ahmadabad the capital of Gujarat. Candradeva, when still young, was taken to a Jain temple where he became a monk and changed his name to Somacandra. He was instructed in religion, Indian philosophy, the sacred scriptures, logic and grammar. When Candradeva was ordained in\n1110\ninto the Shvetambara\n(\nWhite-robed\n)\nsect of Jainism and he was given the name Acharya Hemchandra.\nGujarat at this time was ruled by the Solanki dynasty. Gujarat expanded to its largest extent under this dynasty and learning flourished, particularly in the economic and cultural fields. King Siddharaja made excellent use of Hemchandra's great skills, knowledge and learning in ruling Gujarat. King Kumarapala succeeded King Siddharaja and from\n1125\nhe was advised by Hemchandra. Of course as a spiritual leader, Hemchandra was in a strong position to see that his ideas were put into practice and indeed this led to Gujarat becoming considerable more advanced in culture and learning. Hemchandra was a strong believer in non-violence and Gujarat flourished in peace for many years. He convinced King Kumarapala to bring in laws which not only prohibited violence between people, but also made it illegal to kill animals. Hemchandra convinced the King to make the Jain religion the official religion of Gujarat.\nHemchandra was an eloquent religious teacher, skilful political advisor, and a scholar of the highest standing\n[\n1\n]\n:-\nA prodigious writer,\n[\nHemchandra\n]\nproduced Sanskrit and Prakrit grammars, textbooks on science and practically every branch of Indian philosophy, and several poems, including the Trishashtishalakapurusha-carita\n(\nDeeds of the\n63\nIllustrious Men\n)\n, a Sanskrit epic of the history of the world as understood by Jain teachers. He was also a logician. Although derivative in many ways, his works have become classics, setting high standards for Sanskrit learning.\nThe book\nDeeds of the\n63\nIllustrious Men\nmentioned in the above quote has now been translated into English by Fynes and published by Oxford University Press. The book recounts in a collection of fascinating stories historical myths of the Jain religion.\nOne might reasonably ask at this point why we have included Hemchandra in an archive of mathematicians. The answer lies in his contribution to the Fibonacci numbers which was made fifty years before\nFibonacci\nwrote\nLiber Abaci\nwith its famous rabbit problem. Kak, in\n[\n3\n]\n, explains how these entered Hemchandra's writings. In a text written about\n1150\nhe looked at the following problem. Suppose we assume that lines are composed of syllables which are either short or long. Suppose also that each long syllable takes twice as long to articulate as a short syllable. A line of length\nn\nn\nn\ncontains\nn\nn\nn\nunits where each short syllable is one unit and each long syllable is two units. Clearly a line of length\nn\nn\nn\nunits takes the same time to articulate regardless of how it is composed. Hemchandra asks: How many different combinations of short and long syllables are possible in a line of length\nn\nn\nn\n?\nHemchandra then finds the answer explicitly. Suppose that there are\nf\n(\nn\n)\nf (n)\nf\n(\nn\n)\npossibilities for a line of length\nn\nn\nn\n. The line of length\nn\nn\nn\neither ends in a short syllable or in a long syllable. If it is the former than there remains a line of length\nn\n−\n1\nn-1\nn\n−\n1\nwhich can be composed in\nf\n(\nn\n−\n1\n)\nf (n-1)\nf\n(\nn\n−\n1\n)\nways and if the line of length\nn\nn\nn\nends in a long syllable then there is a line of length\nn\n−\n2\nn-2\nn\n−\n2\nremaining which can be composed in\nf\n(\nn\n−\n2\n)\nf (n-2)\nf\n(\nn\n−\n2\n)\nways. Hence, argues Hemchandra,\nf\n(\nn\n)\n=\nf\n(\nn\n−\n1\n)\n+\nf\n(\nn\n−\n2\n)\nf (n) = f (n-1) + f (n-2)\nf\n(\nn\n)\n=\nf\n(\nn\n−\n1\n)\n+\nf\n(\nn\n−\n2\n)\n.\nBefore we rush to try to change the name of the\nFibonacci numbers\ninto Hemchandra number it is worth noting that Gopala had studied these numbers in about\n1135\nand Indian mathematicians as early as the\n7\nth\ncentury had looked at sequences which are produced by the familiar\nFibonacci\nrule.",
  "math_areas": [
    "Calculus",
    "Combinatorics",
    "Logic"
  ]
}