{
  "nome_completo": "Henry Crozier Keating Plummer",
  "nome_curto": "Henry Plummer",
  "ano_nascimento": "1875",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plummer/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Henry Plummer\nwas the son of William Edward Plummer\n(1849\n-\n1928)\nand Sarah Ann Crozier\n(1850\n-\n1927)\n. Henry was born into a family of astronomers. His father William Plummer was the youngest of his parents' four children and had one older brother, John Isaac Plummer\n(1845\n-\n1925)\n. William had no high level education but started his career at the age of fifteen as a computer at the Royal Observatory. In\n1868\nhe left the Royal Observatory when appointed as an assistant at Mr Bishop's private observatory at Twickenham. There he gained observing skills and while working there married Sarah Ann Crozier at Holy Trinity Church, Blackheath Hill, Greenwich on\n28\nJuly\n1870\n. She was the daughter of the licenced victualler Henry Crozier. Their first child Alice was born a year later and, in\n1874\n, they moved to Oxford when William was appointed First Assistant at the newly established Oxford University Observatory. William's brother John Plummer began his astronomical career as an assistant astronomer at Glasgow Observatory in\n1866\n, then moved to the Durham Observatory in\n1868\n. In June\n1874\nhe was appointed at Orwell Park Observatory so, when Henry Plummer was born in\n1875\n, his father and his uncle were both established astronomers.\nHenry Plummer was educated in Oxford, attending St Edward's School, Oxford, from\n1889\nto\n1892\nwhen he won a Scholarship at Hertford College. Founded in\n1863\n, St Edward's School's:-\n... early intentions were to primarily educate the sons of middle class clergy and to emphasise the teachings of the Anglican faith as its core priority.\nPlummer entered Hertford College in\n1892\n, the year his parents moved away from Oxford when William Plummer was appointed as Director of the Liverpool Observatory. He studied mathematics and was highly successful, being awarded first class in Mathematical Moderations in\n1895\nand first class in Final Schools in\n1897\n. Even before taking the finals examinations, he had published his first paper, namely\nA graphical method of solving Kepler's equation\nwhich was published in the\nMonthly Notices\nof the\nRoyal Astronomical Society\nin\n1896\n. The paper had been communicated by Herbert Hall Turner\n(1861\n-\n1930)\n, who was the Savilian Professor of Astronomy and Director of the Radcliffe Observatory at Oxford University. Plummer's begins the paper as follows:-\nThe prominence which Dr T J J See in a recent paper published in the Monthly Notices gave to the\nWaterston\n-Dubois method of solving\nKepler\n's Equation makes it appear likely that another graphical method may have some interest. The question of authorship to which that paper gave rise causes hesitation in claiming originality; but the method which is here described has not, so far as I am aware, been published previously.\nAfter taking Finals, he won an Open Mathematical Scholarship and remained at Hertford College studying natural science. He was awarded a Second Class Degree in physics in\n1898\n. While at Hertford College he wrote is second paper\nOn the star-image formed by a parabolic mirror\n(1898)\n. This begins:-\nThe interesting papers which have been published recently on the subject of the aberration of parabolic mirrors, have only considered the rays which are incident in a plane passing through the axis of the mirror. It is proposed here to find the approximate form of the star-image in the focal plane, and to estimate the distribution of intensity.\nHe was appointed as a Lecturer in Mathematics at Owen's College, Manchester in\n1899\n, but only stayed there for a year before returning to Oxford in\n1900\nwhen appointed as a Demonstrator at the Clarendon Laboratory. His third paper was published in\n1900\n, namely\nAn application of projective geometry to binary star orbits\n. The paper begins:-\nIn the numerous methods which have been employed in the determination of the orbits of double stars, it is natural, on account of the comparatively course nature of the observations, that much use has been made of graphical devices. These for the most part are the \"trial and error\" kind.\nT N Thiele\nand J M Wilson, however, have given direct geometrical constructions by which the relations between the apparent and the real orbit are exhibited, and the former has made practical use of his method. It is my object here to deduce these relations from a consideration of the projective properties of the ellipse, and to show how the geometrical elements of the orbit may be determined by a tolerably simple construction.\nIn\n1901\nPlummer was appointed as an assistant at the Radcliffe Observatory at Oxford University where Herbert H Turner was the Director. It had not been entirely straightforward accepting this post\n[\n15\n]\n:-\n... when the post of second assistant at the University Observatory was offered him, he faced the difficulties of living on a very small salary in order to have more time for work at the science to which he was devoted.\nHe now began publishing many papers, with twelve appearing in\n1901\n-\n02\n. He became interested in studying systematic errors of measurement and statistical analysis of data. Turner was very pleased with his assistant and, in\n1907\n, strongly recommended Plummer for a travelling fellowship to enable him to spend a year as a Research Fellow at the Lick Observatory in California. He sailed to Halifax in Canada, arriving on\n19\nAugust\n1907\n. He then, in September, crossed into the United States on his way to the Lick Observatory on the summit of Mount Hamilton, east of San Jose, California. This observatory was run by the University of California and when Plummer was there the director was William Wallace Campbell\n(1862\n-\n1938)\n. It was Campbell who pioneered the application of the spectrograph to the study of stellar motions\n[\n22\n]\n:-\nAs a young and ambitious astronomer Plummer early realised the immense potentialities of spectroscopy, and his year's stay in America gave him the much-prized opportunity of making himself conversant with the large-scale developments then proceeding rapidly in the great American Observatories.\nHe returned to England on the\nMauretania\n, sailing from New York to Liverpool, arriving on\n2\nOctober\n1908\n.\nIn\n1909\nPlummer criticised\nKarl Pearson\n's work on variable stars in which\nPearson\nhad found a correlation between the range of brightness of a variable star and its maximum brightness. Plummer published\nOn correlation and the characters of variable stars, in reply to Professor Karl Pearson\n(1909)\nin which he showed that\nPearson\n's correlation did not correspond to a physical relationship. Plummer wrote in this paper:-\nThe paper in which Professor\nPearson\nhas discussed some of the statistical relationships to which different classes of variable stars may be subject has natural claims to our respectful attention. Much work in modern astronomy, whether expressly inspired by the evolutional view or not, is of the nature of classification. Professor\nPearson\nhas done so much to provide the necessary theoretical basis for studying the correlation of classified characters that we should be grateful to him for dealing with some of the problems connected with variable stars which are of this kind, and thereby drawing more general attention to a branch of astrophysics which is of the greatest interest and importance.\nAt the same time it seems to me that some of Professor\nPearson\n's results stand in need of serious qualification, being open to a very simple line of criticism which he has apparently overlooked. If this be conceded, these results must lose much of their value, and no very great confidence can be placed in certain ulterior speculations which have been based on them. This may be thought a harsh judgment. But if it can be shown that in this instance Professor\nPearson\n, possibly misled by a certain want of familiarity with the subject of variable stars, has made a not altogether judicious use of his own machinery, it will surely be better to vindicate the general methods, even at the expense, if need be, of the particular results.\nPerhaps an example will serve to explain, if not to justify, the feeling that such a critical attitude is necessary. In the case of long period variables, Professor\nPearson\nfinds a correlation between the light range and the maximum light of seventy-nine stars which is a little short of unity\n(\n.\n9996)\n. Now if this means anything at all, it should mean that the light range is almost rigorously a linear function of the maximum light. But if this be so, a similar relation ought to hold between the maximum light and the minimum light. Now this is not so.\nWe have quoted quite a substantial piece here to show how confident Plummer was and also just how kind he was in showing\nPearson\n's errors. Later in his paper Plummer turns \"to the point in the theory of statistics which Professor\nPearson\nhas apparently overlooked\", corrects\nPearson\n's statistics and shows \"Professor\nPearson\nhas placed a false interpretation on his results.\"\nPlummer had made a contribution to the study of globular clusters in\n1904\nbut his most important paper on this topic was\nThe distribution of stars in globular clusters\n(1911)\n. In this paper\n[\n22\n]\n:-\n... he devised elegant mathematical formulae giving the relation between the space-distribution of the cluster-stars and their two-dimensional distribution on photographs.\nIn May\n1912\nPlummer was appointed Royal Astronomer of Ireland and Andrews Professor of Astronomy at Trinity College, Dublin. These positions had become vacant when\nEdmund Whittaker\n, who had held these roles since\n1906\n, went to Scotland, to the chair of mathematics at the University of Edinburgh\n[\n15\n]\n:-\nThe appointment of Mr H C Plummer to the position of Royal Astronomer of Ireland is a well-deserved recognition of much steady work of a high class during the last decade. He has already published fifty-one papers on astronomical and allied subjects. Some of these are, of course, only brief notes on points of passing interest, but others show great power of getting to fundamental principles. Such was his essay on the Principle of Relativity, and again his paper on the Structure of Globular Clusters of Stars. A recent attack on the modern problem of stellar movements and distances has already produced results of remarkable interest and promises more in the future. We should have to go back to the eighteenth century to find a comparable instance of success in an Oxford astronomer.\nFurther details of Plummer's appointments were reported in\n[\n13\n]\n:-\nThe Dublin Professorship dates from the year\n1783\n, and takes its name from Francis Andrews, a Fellow of Dublin University, who bequeathed a sum of £\n3000\nand an annual income to build and endow an astronomical observatory in the University. In\n1792\nletters patent were issued\n(32\nGeorge III., A.D.\n1792)\n, in which it is recited that \"there shall be for ever hereafter a Professor of Astronomy on the foundation of Dr Andrews, to be called and known by the name of the Royal Astronomer of Ireland.\" Mr Plummer is, therefore, Royal Astronomer of, not Astronomer Royal for, as some announcements have given the title, and by virtue of his office he is Director of the Observatory at Dunsink.\nThe names of the holders of the office from its foundation are Ussher,\nBrinkley\n(\na mathematician and an astronomer who was Andrews Professor for thirty-six years, and afterwards Bishop of Cloyne\n)\n, Sir\nWilliam Rowan Hamilton\n(\na brilliant mathematician, whose name is associated with the invention of the calculus of Quaternions, but was certainly not a working astronomer\n)\n, Dr Brünnow\n(\nwho as certainly was\n)\n, Sir\nRobert Ball\n(\nhappily still with us, who has not only delighted many audiences and many readers, but has also shown his genius in recondite mathematical science\n)\n, Dr Arthur Rambaut\n(\nnow Radcliffe Observer at Oxford\n)\n, the late Professor\nJoly\n, and Dr\nWhittaker\n, the last two being renowned for their connection with mathematical physics. It will be seen from the list that the post has been as much associated with mathematics as with astronomy. Mr Plummer's tastes incline in both directions.\nAlthough these appointments looked extremely good, in fact they came with difficulties. The equipment at Dunsink was out of date and required upgrading but obtaining funds for this proved impossible. This was certainly in part due to the outbreak of World War I in\n1914\nwhich put financial pressures on all possible funding sources. In\n1918\n, when the war ended, Ireland was hit hard by the Spanish flu pandemic but, far worse as far as Plummer was concerned, was the unrest which eventually led to the establishment of the Irish Free State. The Easter Rising of\n1916\nhad been crushed by the British government but in\n1919\nSinn Féin proclaimed Irish independence setting up an assembly in Dublin. The Irish War of Independence then broke out and Plummer, who was a gentle, peace-loving man, shut himself up in the Dunsink Observatory, reluctant to even venture into Dublin. When the Professorship of Mathematics at the Military College of Science at Woolwich became vacant in\n1921\nhe was delighted to be offered the position. He held the Professorship for the next nineteen years until he retired in\n1940\n.\nIn\n1924\nPlummer married Beatrice Howard\n(1867\n-\n1946)\nin St Martin, London. Beatrice was the daughter of the surgeon H Howard Hayward and had previously been married to Llewellyn Oliver.\nPlummer wrote a number of books. The first,\nAn Introductory Treatise on Dynamical Astronomy,\nwas written while he was at Dunsink Observatory and published in\n1918\n.\nHarold Jeffreys\nwrites\n[\n7\n]\n:-\nThere has long been a need for a general book on celestial mechanics on a smaller scale and at a more accessible price than the standard work of\nTisserand\n, and Prof Plummer's recent publication is a very successful effort to satisfy that need.\nHis second book,\nThe Principles of Mechanics,\nwas written when he was Professor of Mathematics at Woolwich and was published in\n1929\n.\nL M Milne-Thomson\nwrites\n[\n11\n]\n:-\nGood introductory text-books on mechanics are rare. Where a teacher is available the book is not the most important matter. For a student reading by himself a good book is absolutely essential. This one can be recommended.\nHis third major work was\nProbability and Frequency\npublished in\n1940\n, the year he retired.\nFor more information about all of Plummer's books, including extracts from several reviews of each work, see\nTHIS LINK\n.\nWhile looking at the books Plummer wrote, we should explain briefly about\nThe Correspondence of Isaac Newton\n. The first three volumes were published in\n1959\n,\n1960\nand\n1961\nedited by\nH W Turnbull\n. In fact Plummer had agreed to undertake on the editorship of\nIsaac Newton\n's correspondence in\n1938\nbut was still working on the project when he died in\n1946\n.\nH W Turnbull\ntook over the editorship and published the first three volumes by\n1961\n, the third volume only appearing in print after his death. In fact four further volumes were published, the seventh in\n1978\n, exactly\n40\nyears after Plummer took on the task.\nThe article\n[\n18\n]\nlets us understand something of Plummer's views about mathematics.\nG H Hardy\nwrote in\nA Mathematician's Apology\n:-\nEvery young mathematician of real talent whom I have known has been faithful to mathematics, and not from lack of ambition but from abundance of it; they have all recognised that there, if anywhere, lay the road to a life of any distinction.\nPlummer replies to\nHardy\nin\n[\n18\n]\n:-\nThe question naturally arises whether it is better to seek fame as a mathematician or to serve one's day and generation in some other way. Whether it is better to rectify the cycloid or to build St Paul's Cathedral? The choice comes to few, but Professor\nHardy\n's answer is not altogether convincing. If today the choice seems to be made easily the explanation lies near at hand in two facts. In the first place, given the requisite ability of a special kind, the path of the mathematician through scholarships and fellowships is ridiculous in its simplicity and it leads automatically to its end. In the second place before we are impressed by the small number of desertions it may be well to ask, what are the opportunities and the temptations to desert? At the present day they seem to be negligible, and it is possible that great talents capable of serving the interests of society in manifold ways are confined within too narrow a track.\nThe\nRoyal Astronomical Society\nelected Plummer as their president in\n1939\nand he served in this role until\n1941\n. He gave three presidential addresses during this time. The first, on\n12\nMay\n1939\nwas on the award of the Society's Gold Medal to Bernard Lyot\n(1897\n-\n1952)\n. He began the address with a little history about the Society\n[\n19\n]\n:-\nThis is not the first time that we have met outside our own apartments, for the first meetings of our Society\n(\nin\n1820)\nwere held in the house of the Geological Society in Bedford Street. But it must be many years since an Ordinary Meeting has been held elsewhere than in our own premises. For the more ample accommodation we are enjoying on the present occasion we are indebted to the\nRoyal Society\n, and it is my first duty to express on your behalf our gratitude and appreciation for this act of neighbourly hospitality.\nHis second presidential address was on the award of the Society's Gold Medal to\nEdwin Hubble\n. Plummer began\n[\n20\n]\n:-\nThe award of the Gold Medal is a practice which we have observed annually almost without intermission for more than a century. Year by year it has given us the privilege of paying tribute to some individual work which we agree in thinking of outstanding importance to astronomy. More than that, it has been frequently associated in recent years with the opportunity of hearing an account of this work from the lips of the Medallist himself. Unhappily in the present year there is no prospect of Dr\nHubble\nmaking the journey from California. But though we are debarred from welcoming him in person, we are not debarred from adding his name to the list of those whom our Society has delighted to honour in the past.\nThe third address, given in March\n1941\n, was delivered during World War II. No one was awarded a medal that year and Plummer spoke on\nThe Development of the Vertical Telescope\n. He began the address as follows\n[\n21\n]\n:-\nFor the first time for many years it has appeared to the Council inexpedient to award the Gold Medal of the Society. To justify this decision it is not difficult to find a good and sufficient reason. The value of the award from year to year depends in a large measure on one condition, that the choice is world-wide and free from bias. Can that freedom be said to exist today? Even though our impartiality were above suspicion, freedom of communication with many countries has been lost. In these circumstances the Fellows will understand the action of Council in making no grant of the Medal.\nSince there is no Medallist, your President cannot make his work the text of a presidential address. Whether there shall be a\nGeorge Darwin\nLecture later in the year is an independent question, which will be carefully considered. In the meantime a retiring President might be allowed to fold his tent \"like the Arabs, and as silently steal away.\" But it has been represented to me that even in these sombre days an address is expected. It is a tradition, and as such it is not to be lightly disturbed by passing events however grave. Therefore it only remains to choose a subject, and for that we may recall some of those events which have occurred in the development of modern astronomical instruments, and especially in the evolution of that extremely interesting form, the tower telescope.\nWe quote the following from the address\n[\n21\n]\n:-\nIt may now be permitted to recall the rough sketch which was shown in this room exactly thirty-six years ago. It is hardly likely that this crude idea had any influence on the design which took a material form some two years later in the first tower telescope on Mount Wilson, though Hale made a generous reference to it. Yet the first tower telescope met with such outstanding success, in which it has been followed by others of a like type, that an intelligent anticipation of the principle may still claim a certain interest. The tower and the substitution of a long-focus refractor for the reflector are due to the genius of Hale, aided by suggestions from Dr C G Abbott. These are features not likely to occur to a modest English astronomer to whom it is never given to command considerable financial resources. Thus under the pressure of economy the nearest approach to the original suggestion is to be seen in the vertical telescope at Oxford, designed by Professor Plaskett. It may be hoped that in happier times this installation, the only one of its kind in this country, will give him every satisfaction\nPlummer wrote a number of obituaries including\nLord Kelvin\nand\nArthur Stanley Eddington\n. We give a version of his obituary of\nLord Kelvin\nat\nTHIS LINK\n.\nThe\nRoyal Astronomical Society\nhad elected Plummer as a Fellow on\n8\nDecember\n1899\n. He served on the Council in\n1915\nand again in\n1935\n-\n42\n. He was Vice-President in\n1936\n-\n37\nand again in\n1941\n-\n42\nfollowing his term as President. He was elected to the\nRoyal Society of London\nin\n1920\n. He was also honoured by having the crater Plummer on the Moon named after him.\nAfter Plummer retired, he moved to\n3\nCanterbury Terrace, Oxford. His wife Beatrice died on\n20\nFebruary\n1946\nand Plummer was devastated. He struggled on for a few further months, but died in September\n1946\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Statistics",
    "Topology"
  ]
}