{
  "nome_completo": "Henrietta Swan Leavitt",
  "nome_curto": "Henrietta Swan Leavitt",
  "ano_nascimento": "1868",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leavitt/",
  "lugar_nascimento": "Lancaster, Worcester County, Massachusetts, USA",
  "lugar_morte": "Cambridge, Middlesex, Massachusetts, USA",
  "biografia": "Henrietta Swan Leavitt\n's parents were George Roswell Leavitt\n(1838\n-\n1911)\nand Henrietta Swan Kendrick\n(1844\n-\n1922)\n. George Roswell Leavitt was a Congregationalist minister, born in Lowell, Massachusetts, who had studied at Williams College before being awarded a doctorate in divinity from the Andover Theological Seminary. His father was Erasmus Darwin Leavitt, a merchant, while one of George Roswell Leavitt's brothers was also named Erasmus Darwin Leavitt. This uncle of Henrietta's was an engineer who gained fame designing the Leavitt pumping engine. He was the second president of the American Society of Mechanical Engineers and was elected a fellow of the\nAmerican Academy of Arts and Sciences\n. George Roswell Leavitt married Henrietta Swan Kendrick, a daughter of Henry Kendrick of Cambridge, Massachusetts, on\n2\nOctober\n1866\n. Henrietta, the subject of this biography, was the oldest of her parents' seven children, the others being Roswell Harvey Leavitt\n(\nborn\n4\nOctober\n1871\nand died an infant\n)\n, Martha Almira Leavitt\n(\nborn\n1\nAugust\n1873)\n, George William\n(\nborn\n2\nSeptember\n1875)\n, Mira Fay Leavitt\n(\nborn\n20\nSeptember\n1878\nand died aged\n2)\n, Caroline Reed Leavitt\n(\nborn\n16\nMay\n1880)\nand Darwin Ashley Leavitt\n(\nborn\n15\nJune\n1882)\n.\nAt the time of the\n1870\ncensus, Henrietta was two years old and living in her grandfather's home in Lowell, Middlesex, Massachusetts. The head of the household was Erasmus Darwin Leavitt\n(\nSr.\n)\n, at that time\n60\nyears old and retired, and the house was run by his wife Almira who was\n57\n. At least ten others were living in the house\n(\nall named Leavitt\n)\n, including Erasmus Darwin Leavitt\n(\nJr.\n)\n, at that time\n34\nyears old, and Henrietta's mother and father.\nGeorge Roswell Leavitt became pastor at the Pilgrim Congregational Church in Cambridge, Middlesex, Massachusetts and, by the time that his second child was born in\n1871\n, the family were living in Cambridge. The\n1880\ncensus gives us a picture of the Leavitt family living at\n9\nWarland Street, close to the church where George was the pastor. George is listed at head of the house with his wife \"keeping house\". Five of their seven children are there, with the two eldest, Henrietta and Martha, being at school. Also living with them is Mary Kendrick, Henrietta's aunt, and a\n25\nyear old servant Catherine McDonald. Living next door, at\n11\nWarland Street, is Erasamus Darwin Leavitt, Henrietta's grandfather, with his wife Almira and daughter Almira\n(\nwho is recorded as having spinal difficulties\n)\n. Erasamus has a\n22\nyear old servant Ada L Marston.\nThe Leavitt family moved to Cleveland, Ohio and in\n1885\nHenrietta Leavitt enrolled at Oberlin College. This College, founded in\n1833\n, was coeducational from its founding and was the earliest coeducational college in the United States. She studied the preparatory course in the academic year\n1885\n-\n86\n, then spent two years\n1886\n-\n88\non undergraduate studies. After completing the course she returned to Cambridge and, in\n1888\n, she applied to enter Radcliffe College. This is not strictly accurate since Radcliffe College was not so named until\n1894\n. Some professors from Harvard University had begun teaching women in informal arrangements in the\n1870\ns and this became the Society for the Collegiate Instruction of Women in\n1879\n. Before being accepted, she was tested on her knowledge of classic literature, she had to write a short composition, was tested on her language skills in Latin, Greek and German, was tested on her knowledge of history and of mathematics, physics and astronomy. She passed all these tests successfully except for history but she was allowed to \"rectify this deficiency\" during her course.\nThe course that Leavitt took at the Society for the Collegiate Instruction of Women was very arts based and contained little science. She took language courses on Latin, Greek, English, German, French, and Italian. She also studied fine arts, philosophy, introductory physics and mathematics. This course covered analytic geometry and differential calculus and she was awarded an A for this but for an astronomy course that she took in her final year she was awarded A-. She graduated in June\n1892\nreceiving a certificate which stated that, if she had been a man, she would have qualified for a B.A.\nHer final year astronomy course had been taken at the Harvard Observatory and, after graduating, she offered to work at the Observatory for free. The head of the Observatory at this time was Edward Charles Pickering who had been a professor of physics at the Massachusetts Institute of Technology before being appointed director of the Harvard Observatory in\n1876\n. He believed that the task of the Observatory was to collect as much data as possible on the stars so that others might be helped in theoretical work. He aimed to tabulate the position, colour and magnitude of as many stars as possible. Delighted to have Leavitt's assistance without having to pay her, he set her the task of studying photographic plates from which she had to record the required data. However, it was known that many stars changed in brightness so one of Leavitt's tasks was to look out for such variable stars. During\n1896\nshe wrote up a draft manuscript of her findings.\nIn September\n1896\nLeavitt applied for a passport to travel abroad. At this time she was living in Cambridgeport which today is part of Cambridge but at that time was a separate town close to Cambridge. The application was to allow her to go abroad and return \"in about two years.\" The application gives a physical description of Leavitt: Age -\n28\n, Stature -\n5\nft\n8\nins, Forehead - High, Eyes - Gray, Nose - Long, Mouth - Medium, Chin - Long, Hair - Black, Complexion - Light, Face - Long. She sailed from Boston to Europe. On her return, Leavitt went to Harvard to discuss her work with Pickering. He made some suggestions on how she might make some improvements to her manuscript and then Leavitt set off for Beloit, Rock, Wisconsin where her father was now the Congregational Minister. The\n1900\ncensus records the family living at\n1263\nChafin Street in Beloit; Leavitt's parents and their five surviving children are all at this address. At this time she described herself as a teacher and she taught art in Beloit College. However, she longed to return to her work on astronomy but, as she explained in a letter to Pickering dated\n13\nMay\n1902\n, she had various difficulties. She wrote:-\nThe winter after my return was occupied with unexpected cares. When, at last, I had leisure to take up the work, my eyes troubled me so seriously as to prevent my using them so closely.\nIt is not at all surprising that the work she had been doing, requiring very careful intense inspection of images on photographic plates, had caused her eyes trouble. However, her eyes now having recovered she wanted Pickering to send her the materials that she needed to complete the manuscript she had been working on in\n1896\n. Her letter continues:-\nI am more sorry than I can tell you that the work I undertook with such delight, and carried to a certain point with such keen pleasure, should be left uncompleted. I apologise most sincerely for not writing concerning the matter long ago. I am having some trouble with my hearing, worrying, a little oddly, that stargazing might make it worse. My friends say, and I recognise the truth of it, that my hearing is not nearly as good when absorbed in astronomical work. Cold weather seems to aggravate my condition. It is evident that I cannot teach astronomy in any school or college where I should have to be out with classes on cold winter nights. My aurist forbids any such exposure. Do you think it is likely that I could find employment either in an observatory or in a school where there is a mild winter climate? Is there anyone besides yourself to whom I might apply?\nPickering replied immediately offering her a full-time position:-\nFor this I should be willing to pay thirty cents an hour in view of the quality of your work, although our usual price, in such cases, is twenty-five cents an hour. If it was not possible for you to relocate, I would pay your fare for a short visit to Cambridge. You could get work in order to take home to Beloit. I do not know of any observatory in a warm climate, where you could be employed on similar work and it would be difficult to furnish you with a large amount of work that you could carry on elsewhere. In any case, I should doubt if astronomy had anything to do with the condition of your hearing, unless you have been assured that this is the case by a good aurist.\nLeavitt replied:-\nMy dear Prof. Pickering, it has proved possible for me to arrange my affairs here so that I can go to Cambridge next month and remain until the work is completed. Your very liberal offer of thirty cents an hour will enable me to do this.\nAiming to take up her position by the end of July, Leavitt set out for Cambridge but, stopping to visit a relative in Ohio, she discovered the relative was ill and so she spent time helping out. This delayed her arrival in Cambridge until the end of August.\nShe did not work too long before taking a winter break and applied for a passport on\n1\nJanuary\n1903\n. Her physical description is identical to the one on the earlier application in\n1896\nexcept she now describes her hair as \"dark\" rather than \"black.\" She asked for the passport to be sent to the U S Consul in Naples, Italy, so she must have been travelling to Naples. Certainly she was on the\nS S Commonwealth\nsince she sent a letter from that ship on\n3\nJanuary. After spending time in Europe she returned to Boston from Liverpool, England, on the\nS S Ivernia\n, leaving Liverpool on\n29\nJuly and arriving in Boston on\n6\nAugust. From Boston she went by train to Beloit, then returned to Cambridge to again take up her permanent position at the Observatory. She lived with her uncle Erasmus Darwin Leavitt, the engineer, in a large villa he had built on Garden Street in Cambridge, only a short walk from the Observatory.\nIn spring\n1904\n, while examining plates taken of the Small Magellanic Cloud by the Arequipa Observatory, she discovered variable stars. The Small Magellanic Cloud and the Large Magellanic Cloud are galaxies close to Milky Way. To get an idea of distances, the Small Magellanic Cloud is about\n7\n,\n000\nlight years in diameter, and lies about\n190\n,\n000\nlight years from the Milky Way. The Large Magellanic Cloud is about\n14\n,\n000\nlight years in diameter and\n160\n,\n000\nlight years from the Milky Way. The Milky Way itself is about\n140\n,\n000\nlight years in diameter. Both Magellanic Clouds are only visible from the Southern Hemisphere. After the Arequipa Observatory was established in Peru in\n1891\n, plates of southern stars were sent to the Harvard Observatory. It was these plates that Leavitt was working on, measuring magnitudes and position of stars. She began to find \"an extraordinary number\" of variables - these were her own words.\nIn\n1908\nLeavitt published a full account of her work in the\n21\n-page paper\n1777\nVariables in the Magellanic Clouds\n. The paper begins as follows:-\nIn the spring of\n1904\n, a comparison of two photographs of the Small Magellanic Cloud, taken with the\n24\n-inch Bruce Telescope\n[\nat the Arequipa Observatory\n]\n, led to the discovery of a number of faint variable stars. As the region appeared to be interesting, other plates were examined, and although the quality of most of these was below the usual high standard of excellence of later plates,\n57\nnew variables were found, and announced in Circular\n79\n. In order to furnish material for determining their periods, a series of sixteen plates, having exposures from two to four hours, was taken with the Bruce Telescope the following autumn. When they arrived in Cambridge, in January\n1905\n, a comparison of one of them with an early plate led immediately to the discovery of an extraordinary number of new variable stars. It was found, also, that plates taken within two or three days of each other, could be compared with equally interesting results, showing that the periods of many of the variables are short. The number thus discovered, up to the present time, is\n969\n. Adding to these\n23\npreviously known, the total number of variables in this region is\n992\n. The Large Magellanic Cloud has also been examined on\n18\nphotographs taken with the\n24\n-inch Bruce Telescope, and\n808\nnew variables have been found, of which\n152\nwere announced in Circular\n82\n. As much time will be required for the discussion of these variables, the provisional catalogues given below have been prepared.\nAt the end of the paper she gave a list of sixteen variable stars, showing their periods and magnitudes. She then made the important statement:-\nIt is worthy of notice that the brighter variables have the longer periods.\nLet us note that since no distance scale was known at this time, the absolute magnitude of variables in the Milky Way could not be estimated from their apparent brightness. However, the absolute magnitude of stars in the Small Magellanic Cloud, being at least approximately the same distance away from the Earth, could be fairly accurately deduced from their apparent magnitude. This allowed Leavitt to make the vitally important observation that the periods of the variables was related to their absolute magnitudes. However, although the results were convincing they were only based on a sample of sixteen stars. Leavitt needed to continue to work on making further measurements. However, this work was interrupted when she fell ill.\nBy December\n1908\nLeavitt was in hospital in Boston. On her release she went to Beloit to stay with her parents and two unmarried brothers, George William Leavitt, now a missionary, and Darwin Ashley Leavitt, now a Congregationalist minister. She spent much of the year\n1909\nat the family home in Beloit, intending to resume work at the Observatory in the autumn. However a \"slight illness\" prevented her from carrying out this aim. Pickering was keen that she return, but not to work on the variable stars project, but rather to work on his favourite project of obtaining accurate data on\n96\nstars close to Polaris. Eventually, when she still was not well enough to come to Cambridge, Pickering sent her material to work on at Beloit. She carried out work on these plates, returning data to the Harvard Observatory, until May\n1910\nwhen she was well enough to resume her work in Cambridge.\nFurther interruptions to her work followed, for example in March\n1911\nher father died and again she returned to the family home at Beloit. She was again sent plates for the\n96\nnear Polaris stars and worked on these while in Beloit. She was back in Cambridge by the autumn of\n1911\nwhen, in addition to other work, she was able to continue to work on the variable stars in the Small Magellanic Cloud. Her work is reported on in a Harvard Circular of\n1912\nwhere she wrote:-\nA remarkable relation between the brightness of these variables and the lengths of their periods will be noticed.\n[\nIn the\n1908\npaper\n]\nattention was called to the fact that the brighter variables have longer periods, but at that time it was felt that the number was too small to warrant the drawing of general conclusions. The periods of\n8\nadditional variables which have been determined since that time, however, conform to the same law. The relation is shown graphically ... The resulting curves, one for maxima and one for minima, are surprisingly smooth, and of remarkable form. ... A straight line can readily be drawn among each of the two series of points corresponding to maxima and minima, thus showing that there is a simple relation between the brightness of the variables and their periods. The logarithm of the period increases by about\n0\n.\n48\nfor each increase of one magnitude in brightness  ... Since the variables are probably at nearly the same distance from the Earth their periods are apparently associated with their actual emission of light, as determined by their mass, density, and surface brightness.\nLeavitt did not refer to these variable stars as Cepheid variables, but they are known today by that name after the first such star discovered in\n1784\nby John Goodricke. Leavitt's discovery allowed the scale of the universe to be determined, although more work was required since the relation that she discovered only allowed relative distances to be determined while other techniques were required to determine the distance to at least one such variable star to calibrate the scale. Leavitt was not given the chance to participate in this as Pickering used her skills on other projects.\nFor the next four years Leavitt worked at the Harvard Observatory, except for a break of three months in the first half of\n1913\nwhen she had surgery to her stomach. She completed work on the\n96\nnear Polaris stars and published the results, a remarkable piece of work which she and checked and rechecked using data from\n299\nplates produced by\n13\ndifferent telescopes.\nHarlow Shapley\nwas working on the size of the Milky Way galaxy and he contacted Pickering in August\n1917\nwith questions for Leavitt concerning variables in globular clusters. He wrote in his letter:-\nHer discovery of the relation of period to brightness is destined to be one of the most significant results of stellar astronomy, I believe.\nOnly after writing again in July\n1918\ndid\nShapley\nreceive a response from Pickering saying that Leavitt had plates to investigate his question. She corresponded with\nShapley\nherself in\n1920\n, asking advice on what she should focus her research and he replied, again suggesting variables in globular clusters. In March\n1921\nShapley\nbecame Director of the Harvard Observatory and by this time Leavitt was Head of Stellar Photometry. However, by November\n1921\nshe was serious ill with stomach cancer, living as she had done for some time, with her mother on Linnean Street, Cambridge. A friend visited her on\n6\nDecember and wrote:-\nWent to see poor Henrietta Leavitt, dying with a malignant stomach trouble. So thin and changed. Very, very, sad.\nLeavitt died at\n10\n.\n30\np.m. on\n12\nDecember, and her funeral was held at the Chapel of the\n1\nst Congregational Church on\n14\nDecember. She was buried in Cambridge Cemetery. We note that her mother did not outlive her daughter by much for she died in\n1922\n. Although Leavitt died without making a will, she owned a share of two adjacent properties in Beloit and her share went, after her death, to her brothers\n(\nsince her mother had died before this was settled\n)\n.\nThere is a postscript that we must add. In\n1925\nGösta Mittag-Leffler\nwrote to Leavitt at the Harvard Observatory, not being aware that she had died. He wrote:-\nHonoured Miss Leavitt, What my friend and colleague Professor von Zeipel of Uppsala has told me about your admirable discovery of the empirical law touching the connection between magnitude and period-length for the S Cepheid-variables of the Little Magellan's cloud, has impressed me so deeply that I feel seriously inclined to nominate you to the Nobel prize in physics for\n1926\n...\nThe letter was given to Shapely who informed\nMittag-Leffler\nof Leavitt's death. However, his reply does him no credit for it is clear that he was trying to take much of the credit for Leavitt's discovery, probably in the hope that\nMittag-Leffler\nwould nominate him for a Nobel prize!",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}