{
  "nome_completo": "Henry Walter Stager",
  "nome_curto": "Henry Stager",
  "ano_nascimento": "1879",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stager/",
  "lugar_nascimento": "Nutley, Essex, New Jersey, USA",
  "lugar_morte": "Palo Alto, San Mateo, California, USA",
  "biografia": "Henry Walter Stager\nwas the son of John Willis Stager\n(1853\n-\n1933)\nand Bertha Dittig\n(1855\n-\n1895)\n. He was born in Nutley, a town whose origins and schools are described in\n[\n2\n]\n:-\nNutley was at first, and for many years after its first settlement, a part of the original Dutch grant known as Newark. In\n1812\nthe area was separated from Newark and made a part of Bloomfield. This arrangement continued until\n1839\n, when the eastern section of Bloomfield was separated and became Belleville Township. At this time the Nutley section was called North Belleville. In\n1874\nBelleville became a town, and this section became Franklin Township. In the township three areas had local names, i.e., Avondale, Nutley Center, and Spring Garden. Finally in\n1902\n, Franklin Township became the Town of Nutley.\nJohn Stager was born Belleville, New Jersey on\n17\nDecember\n1854\n. He became a grocer and married Bertha A Dittig on\n17\nJuly\n1878\nin Brookdale, New Jersey. Bertha had been born in New Jersey to parents who had emigrated from Germany. John and Bertha Stager had five children: Henry Walter Stager\n(1879\n-\n1937)\n, the subject of this biography; Cora Elisabeth Stager\n(1884\n-\n1956)\nwho became a teacher in a state college; Raymond Milford Stager\n(1886\n-\n1941)\n, who became an assistant storekeeper at a university, later a store keeper in a wireless manufacturing company, and still later a manager of a book store; Bertha Amelia Stager\n(1892\n-\n1980)\n, who became a servant in a private house; and Robert Russell Stager\n(1893\n-\n1957)\n, who became a plumber with his own firm, then a carpenter in the building trade. Neither of the two girls married and the\n1940\nCensus records them living together at\n936\nWaverley Street, Palo Alto.\nIn\n1856\nHenry Stager, presumably a relative of the subject of this biography, donated land on which a school was built in Nutley\n[\n2\n]\n:-\nThis was a two-story frame building on Church Street facing east, and hence was known as the 'Church Street School,' with a separate entrance for boys and girls. The Church Street School burned in\n1874\n- the year that Nutley separated from Belleville and became the Township of Franklin - and in\n1875\na two-story brick building was erected and used until the Park School was built in\n1894\n.\nHenry Walter Stager's elementary education was in the public schools of Nutley and the neighbouring town of Montclair. He was prepared for college at the Montclair High School which had been founded in\n1886\nand, when Stager studied there, was located on Orange Road. Stager graduated from the Montclair High School with high honours in\n1897\n, was awarded the Wilde prize medal for excellence in scholarship, and was also one of the class essayists. After graduating, he went to California to study mathematics at Leland Stanford Junior University. This University is today known by all as Stanford University but its legal name remains Leland Stanford Junior University. It was founded in Palo Alto in\n1885\nby California senator and railroad magnate Leland Stanford and his wife, Jane Lathrop:-\n... to promote the public welfare by exercising an influence in behalf of humanity and civilisation.\nThe university was a memorial to the Stanfords' only child Leland Jr who died from typhoid in\n1884\n. It opened in\n1891\n, six years before Stager began his studies there in the autumn of\n1897\n. He was taught by\nRobert Allardice\nwho was the first Professor of Mathematics at Stanford University, appointed to the position in\n1892\n. At the time of the\n1900\nCensus, Stager was studying at Stanford and living as a boarder, along with other boarders, in the home of Marcia Greggory at\n517\nWaverley Street, Palo Alto. He graduated from Stanford University in\n1902\nhaving in his final year been taught by\nG A Miller\nwho was appointed to Stanford in\n1901\n. In his senior year of\n1901\n-\n02\nStager had been appointed as an assistant professor in mathematics.\nAfter graduating from Stanford in\n1902\n, Stager spent the next three years teaching mathematics at various high schools in California. On\n2\nAugust\n1905\nhe married Ella May Peterson\n(1880\n-\n1944)\n, born in Chicago, the daughter of Swedish parents Victor and Gustava Peterson. The Peterson family had moved from Chicago to Kingsburg, California in\n1894\nand the marriage of Henry Stager and Ella May Peterson took place in Kingsburg. Shortly after the wedding, Stager took up an appointments as an assistant in applied mathematics at Stanford University, and advised by\nRobert Allardice\nand\nG A Miller\nstudied for his Master's Degree. He was awarded the degree of A.M. in\n1906\nand in September\n1907\nhe began studying for a PhD at the University of California Berkeley.\nThe mathematics department in which Stager studied at Berkeley had been built up by\nIrving Stringham\nwho had been appointed as head in\n1882\n. In\n1890\nMellen Woodman Haskell\n(1863\n-\n1948)\nwas appointed to Berkeley. He had been an undergraduate at Harvard and then had undertaken research for his doctorate supervised by\nFelix Klein\nat Leipzig and Göttingen. He had been awarded his doctorate on\n18\nJune\n1889\nand appointed as an Instructor in Mathematics at Berkeley. He was promoted to assistant professor at Berkeley in June of the following year. This was the first new professorial appointment in mathematics following the appointment of Stringham. They were joined by\nDerrick Norman Lehmer\nwho was appointed as an instructor in mathematics in\n1900\n. In\n1902\nJohn Hector McDonald had been hired as an instructor. McDonald was born in Toronto on\n11\nDecember\n1874\n, received a BA from the University of Toronto in\n1895\nand, after graduate study at the University of Chicago advised by\nOskar Bolza\n, had been awarded a Ph.D. for his thesis 'On a System of a Binary Cubic and Quadratic and the Reduction of Hyperelliptic Integrals to Elliptic by a Transformation of the Fourth Kind'. At Berkeley he taught the graduate courses 'Theory of Functions of a Real Variable' and 'Elliptic and Other Special Functions' at the time when Stager was studying there. Hugo Karl Schilling was born at Saalfeld, Germany, on\n28\nMarch\n1861\n. He was not a mathematician but a scholar of modern languages who came to the United States in\n1885\n, taught at Johns Hopkins University, Wittenberg College and Harvard before being appointed to the chair of German at Berkeley in\n1901\n.\nStager undertook graduate work for his doctorate under the direction of Mellen Haskell,\nDerrick N Lehmer\n, John H McDonald and Hugo K Schilling. He submitted his\n26\n-page thesis\nOn Numbers which Contain no Factors of the Form p\n(\nkp +\n1)\nin\n1909\n. The Introduction begins as follows\n[\n12\n]\n:-\nIf\np\na\np^{a}\np\na\nis the highest power of a prime p which divides the order of a group G, the subgroups of G of order\np\na\np^{a}\np\na\nform a single conjugate set and their number is congruent to unity, mod p.\nThe above well-known theorem, which was first established by\nSylow\n, suggests the segregation of numbers into two distinct classes: the class to contain all numbers which have factors o the form p\n(\nkp +\n1)\nwhich p may be any prime except unity and k may have any integral value greater than zero; the other class to contain all remaining numbers. Numbers in the second class will be found to have certain properties analogous to the properties of primes and will be denoted by P, the numbers in the first class will be found to have certain properties analogous to the properties of composite numbers and will be denoted by C. If a C should be of the form p\n(\nkp +\n1)\n, and not merely a multiple of a number of that form, we will call it a \"fundamental\" C. Certain Cs are fundamental for certain p's and not for others; e.g.\n12\n=\n2\n(\n2\n(\n1\n×\n2\n+\n1\n)\n)\n=\n3\n(\n1\n×\n3\n+\n1\n)\n12 = 2(2(1 \\times  2 + 1)) = 3(1 \\times  3 + 1)\n1\n2\n=\n2\n(\n2\n(\n1\n×\n2\n+\n1\n)\n)\n=\n3\n(\n1\n×\n3\n+\n1\n)\n,\nand\n12\nis therefore fundamental for p=\n3\n, but not for p=\n2\n; whether a given C is to be considered a fundamental C or not will be made clear by the context. Two fundamental C's will be called \"different\" if the values of the p's and k's respectively are not both the same in the two C's. The present investigation is intended to develop some of the more fundamental properties of the P's and C's and to establish certain formulae for the number of P's within a given limit.\nHe gives the following Acknowledgement in the thesis, thanking the members of the examining committee\n[\n12\n]\n:-\nI wish to express my appreciation for the kindly interest of all my instructors. My thanks are especially due to the members of my Committee, Professors\nLehmer\n, Haskell, and Schilling; and more especially to Professor\nLehmer\n, whose encouragement and sympathetic advice have been a constant source of help in preparing my dissertation.\nHe was awarded a Ph.D. in\n1909\n, becoming only the second person to be awarded a Ph.D. in mathematics from Berkeley. The first Berkeley Ph.D. was\nFrank Elmore Ross\nin\n1901\n. Even before he submitted his thesis, Stager had joined the\nAmerican Mathematical Society\n[\n14\n]\n:-\nFebruary\n1908\n:  Stager, Henry Walter, M.A.; Assistant in Mathematics, University of California, Berkeley, California.\n1700\nWard Street.\nIn the\n1910\nCensus, Stager is recorded as an Instructor in Mathematics at Berkeley. He is living with his wife and daughter in Ward Street. His daughter, Helen Elizabeth Stager\n(1906\n-\n1991)\n, had been born on\n16\nMay\n1906\nin Fresno, California and was three years old at the time of the\n1910\nCensus. We note that Helen Stager married Dana Poulsen on Thursday\n27\nAugust\n1929\nin Salinas\n[\n15\n]\n:-\nThe marriage of Miss Helen Stager and Dana Poulsen of Santa Rosa was solemnised Thursday at high noon at the home of the bride's parents, Mr and Mrs H W Stager. Rev H K Hamilton of the First Methodist church officiated. The couple will reside in Santa Rosa, where Mr Poulsen is in business. He was formerly in charge of the company's store in this city.\nLeaving Berkeley, Stager was appointed to Fresno Junior College in Fresno, California. This College opened in\n1910\nwith\n20\nstudents and\n3\ninstructors. The report\n[\n17\n]\n, giving data from\n1912\n, lists a faculty of\n8\nwith Henry W Stager as the only mathematician. He was delivering the courses: Solid geometry; Trigonometry,\n1\n/\n2\nyear; Analytical geometry,\n1\n/\n2\nyear; Algebraic theory,\n1\n/\n2\nyear; Descriptive geometry,\n1\n/\n2\nyear; Differential Calculus, Integral Calculus,\n1\nyear. The College was playing a role in easing pressure on the University of California\n[\n17\n]\n:-\n... because of having to mass lower division students at the University of California in very large classes, it is impossible to give them anything like the opportunities they need. The instructors and the equipment are overtaxed. It was asserted expressly that Fresno students had a better chance and could do better college Freshman and Sophomore work in their \"junior college\" than at the university. Here at home, in their small classes they could get closer to, and keep closer to, their studies and their instructors.\nWhile teaching in the College, Stager lived at\n265\nHoward Street, Fresno. He also played an important role in the California High School Teachers' Association, being chairman of the Mathematics Section in\n1914\n. For two communications written by Stager for the California High School Teachers' Association, see\nTHIS LINK\n.\nStager published the book\nA Sylow Factor Table of the First Twelve Thousand Numbers\nin\n1916\n.\nD H Lehmer\nwrites in the review\n[\n9\n]\n:-\nThe author is to be congratulated upon the completion of so important and formidable a piece of work. While the reviewer has, of course, not checked over any part of the table he has the utmost confidence in the accuracy of the list. The printing has been done by the photographic methods employed by the Carnegie Institution in the publication of the Factor Tables and the List of Primes. Both the author and the publishers deserve the gratitude of every lover of science in putting in the hands of mathematicians results of such permanent value.\nIn the review\n[\n1\n]\nof this book the reviewer writes:-\nIt is obvious that, apart from its special purpose, this table will be very useful to arithmeticians ...\nFor further details of the reviews\n[\n1\n]\nand\n[\n9\n]\n, see\nTHIS LINK\n.\nIn\n1920\nStager moved from Fresno Junior College to the University of Washington\n[\n16\n]\n:-\nProfessor H W Stager, of Fresno Junior College, has been appointed instructor in mathematics at the University of Washington.\nLater he worked at Salinas Junior College from the\n1920\ns where he was head of the mathematics department. At the time of the\n1930\nCensus he was working at the College and living with his wife at\n47\nStone Street, Salinas, Monterey, California. After he retired in\n1931\nhe continued to be an important figure in using his expertise in mathematics teaching in Californian junior colleges. He was a member of a committee of junior college mathematics instructors appointed by the California State Department of Education which made and published in\n1937\na survey of the mathematics courses taught in the public junior colleges of California. See\n[\n18\n]\nfor details of the report:-\n... for which the committee deserves commendations as well as honourable mention.\nAfter he retired he moved back to Palo Alto, where he taught at the Palo Alto Evening School. He lived at\n565\nHamilton Avenue, Palo Alto, where he died of a heart attack at the age of\n58\n. His funeral was at\n10\n:\n30\nin the morning of Thursday\n23\nDecember\n1937\nin the Roller and Hapgood chapel in Palo Alto, and he was interred at Alta Mesa Memorial Park.",
  "math_areas": [
    "Applied Mathematics",
    "Number Theory"
  ]
}