{
  "nome_completo": "Henri Auguste Delannoy",
  "nome_curto": "Henri Delannoy",
  "ano_nascimento": "1833",
  "ano_morte": "1915",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Delannoy/",
  "lugar_nascimento": "Bourbonne-les-Bains, Haute-Marne, France",
  "lugar_morte": "Guéret, La Creuse, France",
  "biografia": "Henri Delannoy\n's parents were Omère Benjamin Joseph Delannoy, a military accountant, and Françoise Delage. In fact on his birth certificate his name appears as 'Henry' but in later life he had it officially changed to 'Henri' so in this biography we use the version of the name by which Delannoy himself wanted to be known. Omère Delannoy had fought in a number of Napoleon's military campaigns, in particular at the Battle of Waterloo, before becoming an administrator in the military. He met Françoise Delage in Guéret, in central France, and they were married there on\n24\nNovember\n1830\n. Henri was brought up in Guéret where he attended the Collège de Guéret.\nIn\n1849\nhe was awarded his baccalaureate, having received permission to take the examination when he was still officially too young. He then spent two years studying mathematics at the Lycée de Bourges, going there because his family were living in the vicinity at the time. He then attended Sainte-Barbe College in Paris, in order to prepare for the difficult entrance exams to the prestigious École Polytechnique. He was ranked\n62\nnd\nin the entrance examinations and entered the École Polytechnique in\n1853\n. The records contain the following physical description of him: dark brown hair, height\n1\n.\n68\nm, average forehead, medium nose, blue eyes, small mouth, round chin, round face. His academic record was certainly not particularly strong since he came\n91\nst\nout of a class of\n106\nin\n1854\nand he graduated in the following year coming\n67\nth\nout of\n94\nstudents. He joined the military on\n1\nMay\n1855\nand trained at the Artillery School in Metz, graduating\n12\nth\nout of\n37\nstudents in\n1856\n. He was given the rank of sub-lieutenant in\n1856\nand promoted to lieutenant on\n1\nMay of the following year.\nDelannoy saw action in\n1859\nin the Second Italian War of Independence. France, led by Napoleon III, was allied with the Kingdom of Piedmont-Sardinia against Austria. War between Austria and Sardinia was declared on\n29\nApril\n1859\nand a large French army marched towards Piedmont to support the greatly out-numbered Sardinian forces. Delannoy was with this French army and took part in the decisive Battle of Solferino on\n24\nJune which proved to be a tactical victory for the French-Piedmontese forces but at a high cost in terms of soldiers lost and wounded. Delannoy survived unscathed and, after spending time stationed in Brescia and on Lake Garda, returned to Guéret where he married Olympe-Marguerite Guillon, daughter of the chemist Antoine Guillon, on\n10\nNovember\n1859\n; they had two daughters and one son.\nIn\n1863\nDelannoy was promoted to captain\n[\n2\n]\n:-\nHe spent three years in Africa\n(6\nOctober\n1866\n-\n25\nOctober\n1869)\n. He was the governor of the military Hospital of Sidi-bel-Abes, Algeria, during the terrible typhus epidemic\n(\nhe belonged the Supply Corps and they were in charge of the sanitary affairs\n)\n. He translated for himself, and perhaps also for his hierarchy, several German books/notes about the Supply Corps. He took part in the\n1870\nwar between France and Prussia. ... he was in Germany on July\n26\n,\n1870\n(\nthat is,\n4\ndays after the declaration of war ...\n)\nand on March\n7\n,\n1871\n(\nthat is,\n3\ndays before the Treaty of London ...\n)\n.\nIn\n1876\nDelannoy's wife died after being severely burnt in a tragic accident in her own kitchen. We have not mentioned any mathematical activity by Delannoy, except as part of his schooling, up to this point and this is actually an accurate picture of his involvement in mathematics. Only in\n1879\ndid he start to become interested in mathematics when he read articles by\nÉdouard Lucas\nin\nLa Revue Scientifique.\nHe began corresponding with\nLucas\nin the following year and the two began to exchange mathematical ideas. His interests were in mathematical puzzles, mathematical recreations, and\nprobability\n. In all he seems to have published eleven articles but he also published many problems and solutions to problems set by others. His first publication was\nEmploi de l'échiquier pour la solution de problèmes arithmétiques\nⓉ\n(\nUsing the chessboard to solve arithmetic problems\n)\n(1886)\nfollowed by\nSur la durée du jeu\nⓉ\n(\nOn the length of the game\n)\n(1888)\n. Both of these were published while he was still in the army, working as a military intendant in the city of Orléans. However, Delannoy decided that he wanted to retire from the army and pursue his interests in mathematics and also his interests as a historian. He retired from the army on\n9\nJanuary\n1889\nand returned to Guéret where he had been brought up. He lived there for the rest of his life devoting himself to his mathematical and historical interests. Let us now look briefly at his mathematical contributions.\nThe first paper by Delannoy, mentioned above, literally means 'Using a chessboard to solve arithmetical problems' but it would be much more understandable if we translated 'échiquier' as 'array' for indeed this is what Delannoy uses. In this paper he introduces numbers which are now known as 'ballot numbers' or 'Delannoy-Segner numbers'. They count the number of lattice paths between\n(1\n,\n0)\nand\n(\nm\n,\nn\n)\n,\nm\n>\nn\n(m, n), m > n\n(\nm\n,\nn\n)\n,\nm\n>\nn\n, which do not cross the diagonal. The\n1888\npaper,\nThe length of a game\n, uses lattice paths to analyse the following game previously considered by\nEugène Rouché\nand\nJoseph Bertrand\n:-\nPierre and Paul play a game against each other with equal probabilities. At the start of the game each has\nn\nn\nn\nfrancs; at each round, the winner gets one franc from his opponent. The game continues until one player is ruined. What is the probability\nP\nP\nP\nthat the game ends at the beginning of the round\nm\nm\nm\n.\nIn\nEmploi de l'échiquier pour la résolution de divers problèmes de probalilités\nⓉ\n(\nUsing the chessboard to solve various problems in probability\n)\n(1889)\n, Delannoy uses his lattice paths in arrays to solve seven problems already studied by mathematicians such as\nAmpère\n,\nBertrand\n,\nHuygens\n,\nLaplace\nand\nRouché\n. In this paper Delannoy introduces the 'Delannoy numbers' which count the lattice paths from the origin to\n(\nm\n,\nn\n)\n(m, n)\n(\nm\n,\nn\n)\nwhere the path from each point can go up, right, or across the\n(\nright-up\n)\ndiagonal. For example, the number of such paths from the origin to\n(1\n,\n1)\n, to\n(2\n,\n2)\n, to\n(3\n,\n3)\n, to\n(4\n,\n4)\n, ... is\n3\n,\n13\n,\n63\n,\n321\n,\n1683\n,\n8989\n,\n48639\n,\n265729\n, ...\nIt is interesting to note that in the\n1950\ns a mysterious connection was spotted between these diagonal Delannoy numbers and\nLegendre\npolynomials. Only very recently has Gábor Hetyei explained this connection, which was previously thought to be a coincidence, giving a geometric interpretation of the relation between the diagonal Delannoy numbers and the\nLegendre\npolynomials in\n[\n3\n]\n.\nOther papers by Delannoy are:\nProblèmes divers concernant le jeu\nⓉ\n(\nVarious problems on games\n)\n(1890)\n,\nFormules relatives aux coefficients du binôme\nⓉ\n(\nFormulas on binomial coefficients\n)\n(1890)\n,\nSur le nombre d'isomères possibles dans une molécule carbonnée\nⓉ\n(\nOn the number of possible isomers of a carbonaceous molecule\n)\n(1894)\n,\nSur les arbres géométriques et leur emploi dans la théorie des combinaisons chimiques\nⓉ\n(\nOn the geometrical trees and their use in chemical combination theory\n)\n(1894)\n,\nSur une question de probabilités traitée par d'Alembert\nⓉ\n(\nOn a question of probabilities treated by d'Alembert\n)\n(1895)\n,\nEmploi de l'échiquier pour la résolution de certains problèmes de probabilités\nⓉ\n(\nUsing the chessboard to solve various problems in probability\n)\n(1895)\n, and\nSur la probabilité des événements composés\nⓉ\n(\nOn the probability of compound events\n)\n(1898)\n.\nWe mentioned above that, in addition to his mathematical interests, Delannoy was an active historian, indeed he published numerous articles in the\nMémoires de la Société des Sciences Naturelles et archéologiques de la Creuse\n. He wrote about criminal trials in La Marche, riots in Guéret in\n1705\n, grapevines in La Creuse, local abbeys and abbots, and other similar topics. Following his retirement, he was very active in the Société des Sciences Naturelles et archéologiques de la Creuse, serving as its president from\n1896\nuntil his death in\n1915\n. Finally let us note another of Delannoy's interests - he painted watercolours.",
  "math_areas": [
    "Statistics"
  ]
}