{
  "nome_completo": "Jules Henri Poincaré",
  "nome_curto": "Henri Poincaré",
  "ano_nascimento": "1854",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Poincare/",
  "lugar_nascimento": "Nancy, Lorraine, France",
  "lugar_morte": "Paris, France",
  "biografia": "Henri Poincaré\n's father was Léon Poincaré and his mother was Eugénie Launois. They were\n26\nand\n24\nyears of age, respectively, at the time of Henri's birth. Henri was born in Nancy where his father was Professor of Medicine at the University. Léon Poincaré's family produced other men of great distinction during Henri's lifetime. Raymond Poincaré, who was prime minister of France several times and president of the French Republic during World War I, was the elder son of Léon Poincaré's brother Antoine Poincaré. The second of Antoine Poincaré's sons, Lucien Poincaré, achieved high rank in university administration.\nHenri was\n[\n2\n]\n:-\n... ambidextrous and was nearsighted; during his childhood he had poor muscular coordination and was seriously ill for a time with diphtheria. He received special instruction from his gifted mother and excelled in written composition while still in elementary school.\nIn\n1862\nHenri entered the Lycée in Nancy\n(\nnow renamed the Lycée Henri Poincaré in his honour\n)\n. He spent eleven years at the Lycée and during this time he proved to be one of the top students in every topic he studied. Henri was described by his mathematics teacher as a \"monster of mathematics\" and he won first prizes in the concours général, a competition between the top pupils from all the Lycées across France.\nPoincaré entered the École Polytechnique in\n1873\n, graduating in\n1875\n. He was well ahead of all the other students in mathematics but, perhaps not surprisingly given his poor coordination, performed no better than average in physical exercise and in art. Music was another of his interests but, although he enjoyed listening to it, his attempts to learn the piano while he was at the École Polytechnique were not successful. Poincaré read widely, beginning with popular science writings and progressing to more advanced texts. His memory was remarkable and he retained much from all the texts he read but not in the manner of learning by rote, rather by linking the ideas he was assimilating particularly in a visual way. His ability to visualise what he heard proved particularly useful when he attended lectures since his eyesight was so poor that he could not see the symbols properly that his lecturers were writing on the blackboard.\nAfter graduating from the École Polytechnique, Poincaré continued his studies at the École des Mines. His\n[\n21\n]\n:-\n... meticulous notes taken on field trips while a student there exhibit a deep knowledge of the scientific and commercial methods of the mining industry; a subject that interested him throughout his life.\nAfter completing his studies at the École des Mines Poincaré spent a short while as a mining engineer at Vesoul while completing his doctoral work. As a student of\nCharles Hermite\n, Poincaré received his doctorate in mathematics from the University of Paris in\n1879\n. His thesis was on\ndifferential equations\nand the examiners were somewhat critical of the work. They praised the results near the beginning of the work but then reported that the\n(\nsee for example\n[\n21\n]\n)\n:-\n... remainder of the thesis is a little confused and shows that the author was still unable to express his ideas in a clear and simple manner. Nevertheless, considering the great difficulty of the subject and the talent demonstrated, the faculty recommends that M Poincaré be granted the degree of Doctor with all privileges.\nImmediately after receiving his doctorate, Poincaré was appointed to teach mathematical analysis at the University of Caen. Reports of his teaching at Caen were not wholly complimentary, referring to his sometimes disorganised lecturing style. He was to remain there for only two years before being appointed to a chair in the Faculty of Science in Paris in\n1881\n. In\n1886\nPoincaré was nominated for the chair of mathematical physics and\nprobability\nat the Sorbonne. The intervention and the support of\nHermite\nwas to ensure that Poincaré was appointed to the chair and he also was appointed to a chair at the École Polytechnique. In his lecture courses to students in Paris\n[\n2\n]\n:-\n... changing his lectures every year, he would review optics, electricity, the equilibrium of fluid masses, the mathematics of electricity, astronomy, thermodynamics, light, and probability.\nPoincaré held these chairs in Paris until his death at the early age of\n58\n.\nBefore looking briefly at the many contributions that Poincaré made to mathematics and to other sciences, we should say a little about his way of thinking and working. He is considered as one of the great geniuses of all time and there are two very significant sources which study his thought processes. One is a lecture which Poincaré gave to l'Institute Général Psychologique in Paris in\n1908\nentitled\nMathematical invention\nin which he looked at his own thought processes which led to his major mathematical discoveries. The other is the book\n[\n30\n]\nby Toulouse who was the director of the Psychology Laboratory of l'École des Hautes Études in Paris. Although published in\n1910\nthe book recounts conversations with Poincaré and tests on him which Toulouse carried out in\n1897\n.\nIn\n[\n30\n]\nToulouse explains that Poincaré kept very precise working hours. He undertook mathematical research for four hours a day, between\n10\nam and noon then again from\n5\npm to\n7\npm. He would read articles in journals later in the evening. An interesting aspect of Poincaré's work is that he tended to develop his results from first principles. For many mathematicians there is a building process with more and more being built on top of the previous work. This was not the way that Poincaré worked and not only his research, but also his lectures and books, were all developed carefully from basics. Perhaps most remarkable of all is the description by Toulouse in\n[\n30\n]\nof how Poincaré went about writing a paper. Poincaré:-\n... does not make an overall plan when he writes a paper. He will normally start without knowing where it will end. ... Starting is usually easy. Then the work seems to lead him on without him making a wilful effort. At that stage it is difficult to distract him. When he searches, he often writes a formula automatically to awaken some association of ideas. If beginning is painful, Poincaré does not persist but abandons the work.\nToulouse then goes on to describe how Poincaré expected the crucial ideas to come to him when he stopped concentrating on the problem:-\nPoincaré proceeds by sudden blows, taking up and abandoning a subject. During intervals he assumes ... that his unconscious continues the work of reflection. Stopping the work is difficult if there is not a sufficiently strong distraction, especially when he judges that it is not complete ... For this reason Poincaré never does any important work in the evening in order not to trouble his sleep.\nAs Miller notes in\n[\n21\n]\n:-\nIncredibly, he could work through page after page of detailed calculations, be it of the most abstract mathematical sort or pure number calculations, as he often did in physics, hardly ever crossing anything out.\nLet us examine some of the discoveries that Poincaré made with this method of working. Poincaré was a scientist preoccupied by many aspects of mathematics, physics and philosophy, and he is often described as the last universalist in mathematics. He made contributions to numerous branches of mathematics, celestial mechanics, fluid mechanics, the special theory of relativity and the philosophy of science. Much of his research involved interactions between different mathematical topics and his broad understanding of the whole spectrum of knowledge allowed him to attack problems from many different angles.\nBefore the age of\n30\nhe developed the concept of automorphic functions which are functions of one complex variable invariant under a group of transformations characterised algebraically by ratios of linear terms. The idea was to come in an indirect way from the work of his doctoral thesis on differential equations. His results applied only to restricted classes of functions and Poincaré wanted to generalise these results but, as a route towards this, he looked for a class functions where solutions did not exist. This led him to functions he named Fuchsian functions after\nLazarus Fuchs\nbut were later named automorphic functions. The crucial idea came to him as he was about to get onto a bus, as he relates in\nScience and Method\n(1908)\n:-\nAt the moment when I put my foot on the step the idea came to me, without anything in my former thoughts seeming to have paved the way for it, that the transformation that I had used to define the Fuchsian functions were identical with those of\nnon-euclidean geometry\n.\nIn a correspondence between\nKlein\nand Poincaré many deep ideas were exchanged and the development of the theory of automorphic functions greatly benefited. However, the two great mathematicians did not remain on good terms,\nKlein\nseeming to become upset by Poincaré's high opinions of\nFuchs\n's work. Rowe examines this correspondence in\n[149]\n.\nPoincaré's\nAnalysis situs\nⓉ\n(\nAnalysis of situation\n)\n, published in\n1895\n, is an early systematic treatment of\ntopology\n. He can be said to have been the originator of\nalgebraic topology\nand, in\n1901\n, he claimed that his researches in many different areas such as differential equations and multiple integrals had all led him to topology. For\n40\nyears after Poincaré published the first of his six papers on algebraic topology in\n1894\n, essentially all of the ideas and techniques in the subject were based on his work. The\nPoincaré conjecture\nremained as one of the most baffling and challenging unsolved problems in algebraic topology until it was settled by\nGrisha Perelman\nin\n2002\n.\nHomotopy theory\nreduces topological questions to algebra by associating with topological spaces various groups which are algebraic invariants. Poincaré introduced the\nfundamental group\n(\nor first homotopy group\n)\nin his paper of\n1894\nto distinguish different categories of\n2\n-dimensional surfaces. He was able to show that any\n2\n-dimensional surface having the same fundamental group as the\n2\n-dimensional surface of a sphere is topologically equivalent to a sphere. He conjectured that this result held for\n3\n-dimensional\nmanifolds\nand this was later extended to higher dimensions. Surprisingly proofs are known for the equivalent of Poincaré's conjecture for all dimensions strictly greater than three. No complete classification scheme for\n3\n-manifolds is known so there is no list of possible manifolds that can be checked to verify that they all have different homotopy groups.\nPoincaré is also considered the originator of the theory of analytic functions of several complex variables. He began his contributions to this topic in\n1883\nwith a paper in which he used the\nDirichlet\nprinciple to prove that a\nmeromorphic function\nof two complex variables is a quotient of two\nentire functions\n. He also worked in\nalgebraic geometry\nmaking fundamental contributions in papers written in\n1910\n-\n11\n. He examined algebraic curves on an algebraic surface\nF\n(\nx\n,\ny\n,\nz\n)\n=\n0\nF(x, y, z) = 0\nF\n(\nx\n,\ny\n,\nz\n)\n=\n0\nand developed methods which enabled him to give easy proofs of deep results due to\nÉmile Picard\nand\nSeveri\n. He gave the first correct proof of a result stated by\nCastelnuovo\n,\nEnriques\nand\nSeveri\n, these authors having suggested a false method of proof.\nHis first major contribution to\nnumber theory\nwas made in\n1901\nwith work on\n[\n1\n]\n:-\n... the\nDiophantine\nproblem of finding the points with rational coordinates on a curve\nf\n(\nx\n,\ny\n)\n=\n0\nf (x,  y) = 0\nf\n(\nx\n,\ny\n)\n=\n0\n, where the coefficients of f are rational numbers.\nIn applied mathematics he studied optics, electricity, telegraphy, capillarity, elasticity, thermodynamics,\npotential theory\n,\nquantum theory\n, theory of relativity and\ncosmology\n. In the field of celestial mechanics he studied the three-body-problem, and the theories of light and of electromagnetic waves. He is acknowledged as a co-discoverer, with\nAlbert Einstein\nand\nHendrik Lorentz\n, of the special theory of relativity. We should describe in a little more detail Poincaré's important work on the\n3\n-body problem\n.\nOscar II, King of Sweden and Norway, initiated a mathematical competition in\n1887\nto celebrate his sixtieth birthday in\n1889\n. Poincaré was awarded the prize for a memoir he submitted on the\n3\n-body problem in celestial mechanics. In this memoir Poincaré gave the first description of homoclinic points, gave the first mathematical description of chaotic motion, and was the first to make major use of the idea of invariant integrals. However, when the memoir was about to be published in\nActa Mathematica\n,\nPhragmen\n, who was editing the memoir for publication, found an error. Poincaré realised that indeed he had made an error and\nMittag-Leffler\nmade strenuous efforts to prevent the publication of the incorrect version of the memoir. Between March\n1887\nand July\n1890\nPoincaré and\nMittag-Leffler\nexchanged fifty letters mainly relating to the Birthday Competition, the first of these by Poincaré telling\nMittag-Leffler\nthat he intended to submit an entry, and of course the later of the\n50\nletters discuss the problem concerning the error. It is interesting that this error is now regarded as marking the birth of chaos theory. A revised version of Poincaré's memoir appeared in\n1890\n.\nPoincaré's other major works on celestial mechanics include\nLes Méthodes nouvelles de la mécanique céleste\nⓉ\n(\nNew methods of celestial mechanics\n)\nin three volumes published between\n1892\nand\n1899\nand\nLeçons de mecanique céleste\nⓉ\n(\nLessons on celestial mechanics\n)\n(1905)\n. In the first of these he aimed to completely characterise all motions of mechanical systems, invoking an analogy with fluid flow. He also showed that series expansions previously used in studying the\n3\n-body problem were convergent, but not in general uniformly convergent, so putting in doubt the stability proofs of\nLagrange\nand\nLaplace\n.\nHe also wrote many popular scientific articles at a time when science was not a popular topic with the general public in France. As\nWhitrow\nwrites in\n[\n2\n]\n:-\nAfter Poincaré achieved prominence as a mathematician, he turned his superb literary gifts to the challenge of describing for the general public the meaning and importance of science and mathematics.\nPoincaré's popular works include\nScience and Hypothesis\n(1901)\n,\nThe Value of Science\n(1905)\n, and\nScience and Method\n(1908)\n. A quote from these writings is particularly relevant to this archive on the history of mathematics. In\n1908\nhe wrote:-\nThe true method of foreseeing the future of mathematics is to study its history and its actual state.\nFinally we look at Poincaré's contributions to the philosophy of mathematics and science. The first point to make is the way that Poincaré saw logic and intuition as playing a part in mathematical discovery. He wrote in\nMathematical definitions in education\n(1904)\n:-\nIt is by logic we prove, it is by intuition that we invent.\nIn a later article Poincaré emphasised the point again in the following way:-\nLogic, therefore, remains barren unless fertilised by intuition.\nMcLarty\n[119]\ngives examples to show that Poincaré did not take the trouble to be rigorous. The success of his approach to mathematics lay in his passionate intuition. However intuition for Poincaré was not something he used when he could not find a logical proof. Rather he believed that formal arguments may reveal the mistakes of intuition and logical argument is the only means to confirm insights. Poincaré believed that formal proof alone cannot lead to knowledge. This will only follow from mathematical reasoning containing content and not just formal argument.\nIt is reasonable to ask what Poincaré meant by \"intuition\". This is not straightforward, since he saw it as something rather different in his work in physics to his work in mathematics. In physics he saw intuition as encapsulating mathematically what his senses told him of the world. But to explain what \"intuition\" was in mathematics, Poincaré fell back on saying it was the part which did not follow by logic:-\n... to make geometry ... something other than pure logic is necessary. To describe this \"something\" we have no word other than intuition.\nThe same point is made again by Poincaré when he wrote a review of\nHilbert\n's\nFoundations of geometry\n(1902)\n:-\nThe logical point of view alone appears to interest\n[\nHilbert\n]\n. Being given a sequence of propositions, he finds that all follow logically from the first. With the foundations of this first proposition, with its psychological origin, he does not concern himself.\nWe should not give the impression that the review was negative, however, for Poincaré was very positive about this work by\nHilbert\n. In\n[181]\nStump explores the meaning of intuition for Poincaré and the difference between its mathematically acceptable and unacceptable forms.\nPoincaré believed that one could choose either euclidean or non-euclidean geometry as the geometry of physical space. He believed that because the two geometries were topologically equivalent then one could translate properties of one to the other, so neither is correct or false. For this reason he argued that euclidean geometry would always be preferred by physicists. This, however, has not proved to be correct and experimental evidence now shows clearly that physical space is not euclidean.\nPoincaré was absolutely correct, however, in his criticism that those like\nRussell\nwho wished to axiomatise mathematics; they were doomed to failure. The principle of mathematical induction, claimed Poincaré, cannot be logically deduced. He also claimed that arithmetic could never be proved consistent if one defined arithmetic by a system of axioms as\nHilbert\nhad done. These claims of Poincaré were eventually shown to be correct.\nWe should note that, despite his great influence on the mathematics of his time, Poincaré never founded his own school since he did not have any students. Although his contemporaries used his results they seldom used his techniques.\nPoincaré achieved the highest honours for his contributions of true genius. He was elected to the\nAcadémie des Sciences\nin\n1887\nand in\n1906\nwas elected President of the Academy. The breadth of his research led to him being the only member elected to every one of the five sections of the Academy, namely the geometry, mechanics, physics, geography and navigation sections. In\n1908\nhe was elected to the Académie Francaise and was elected director in the year of his death. He was also made chevalier of the Légion d'Honneur and was honoured by a large number of learned societies around the world. He won numerous prizes, medals and awards.\nPoincaré was only\n58\nyears of age when he died\n[\n3\n]\n:-\nM Henri Poincaré, although the majority of his friends were unaware of it, recently underwent an operation in a nursing home. He seemed to have made a good recovery, and was about to drive out for the first time this morning. He died suddenly while dressing.\nHis funeral was attended by many important people in science and politics\n[\n3\n]\n:-\nThe President of the Senate and most of the members of the Ministry were present, and there were delegations from the French Academy, the\nAcadémie des Sciences\n, the Sorbonne, and many other public institutions. The Prince of Monaco was present, the Bey of Tunis was represented by his two sons, and Prince Roland Bonaparte attended as President of the Paris Geographical Society. The\nRoyal Society\nwas represented by its secretary,\nSir Joseph Larmor\n, and by the Astronomer Royal, Mr F W Dyson.\nLet us end with a quotation from an address at the funeral:-\n[\nM Poincaré was\n]\na mathematician, geometer, philosopher, and man of letters, who was a kind of poet of the infinite, a kind of bard of science.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}