{
  "nome_completo": "Henry Seely White",
  "nome_curto": "Henry White",
  "ano_nascimento": "1861",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/White/",
  "lugar_nascimento": "Cazenovia, New York, USA",
  "lugar_morte": "Poughkeepsie, New York, USA",
  "biografia": "Henry White\n's parents were Isadore Maria Haight and Aaron White. Henry attended Cazenovia Seminary where his father was a teacher of elementary mathematics and surveying. From there White entered the Wesleyan University, in Middletown, Connecticut, which was founded in\n1831\nby a group of Methodists. At the Wesleyan University White was taught mathematics and astronomy by\nVan Vleck\n's father, John Monroe Van Vleck. It was John Monroe Van Vleck who persuaded White that he should continue to study mathematics at graduate level.  John Monroe Van Vleck was himself a graduate of the Wesleyan University, taught there from\n1853\nuntil he retired in\n1912\n, and was actively involved in the development of the\nAmerican Mathematical Society\n.\nAfter graduating with an A.B. in\n1882\n, White was appointed as an assistant to John Monroe Van Vleck in the astronomical observatory at the Wesleyan University, then he moved to Centenary Collegiate Institute, Hackettstown, New Jersey where he taught mathematics and chemistry for a year before returning to the Wesleyan University to become a tutor. In\n1887\n, following advice from  John Monroe Van Vleck, he decided to study for his doctorate in Germany and travelled to Leipzig to begin working with\nStudy\nand\nLie\n. However, he spent only one semester in Leipzig and during this time he was mostly taken up with improving his knowledge of German. White's friend, William J James, had studied under\nKlein\nat Göttingen and also under\nKronecker\nand\nFuchs\nin Berlin. James gave White what he described in\n[\n4\n]\nas:-\n... very valuable advice.\nJames\n[\n4\n]\n:-\n... held up\nKlein\nas not only the leading research mathematician but also as a magazine of driving power, whoses students received personal attention and stimulus, and in most cases became themselves productive investigators.\nTaking James' advice, White went to study at the University of Göttingen for his doctorate between\n1887\nand\n1890\nunder\nKlein\n's supervision. When he arrived he discovered that he was one of six American students undertaking mathematics research at Göttingen. Since he had missed the first semester of\nKlein\n's advanced course on hyperelliptic functions, he decided not to attend the second half of the course but instead to wait for the start of an advanced course in the next academic year. White did attend one of\nKlein\n's courses from the time he arrived, however, taking the slightly less advanced course on potential theory. White's other task was to use this semester to learn background on abelian functions so that he could start\nKlein\n's three semester course on that topic in the next academic year. He later wrote\n[\n4\n]\n:-\nKlein\nreceived me kindly and admitted me to his seminar course ... in abelian functions\n[\nin the summer of\n1888]\n, ...\nKlein\nexpected hard work, and soon had in succession Haskell, Tyler,\nOsgood\n, and myself working up the official Heft or record of his lectures, always kept for reference in the mathematical Lesezimmer. This gave the fortunate student extra tuition, since what the Göttingen geometer gave in one day's lecture\n(\ntwo hours\n)\nmust be edited and elaborated and submitted for\nKlein\n's own correction and revision within\n48\nhours.\nWhite's doctorate was awarded for the thesis\nAbelsche Integrale auf singularitätenfreien, einfach überdeckten, vollständigen Schnittkurven eines beliebig ausgedehnten Raumes\nin\n1891\n.\nIn fact White returned to the United States in March\n1890\n, before completing his doctorate, to take up a temporary position in a school attached to Northwestern University in Evanston, Illinois. Later that year he married Mary Willard Gleason; they had three children. He was appointed to Clark University, which opened in Worcester, Massachusetts, in\n1887\n, and began teaching there at the start of session\n1890\n-\n91\n. Clark University was established by Jonas Gilman Clark, a Worcester native and successful merchant, and G Stanley Hall, a psychologist and first president of the university. The university started as a graduate institution, the first undergraduates entering only in\n1902\n. The University hired some excellent mathematicians, and there White became a colleague of\nStory\nand\nBolza\n. White began teaching advanced courses in his area of research interest, in particular on algebraic geometry, projective geometry, and\ninvariant theory\n. However a serious political situation arose at Clark University and a vote of no confidence was passed in the president G Stanley Hall. Nine of the eleven members of faculty left Clark including both  White and\nBolza\n.\nEliakim Moore\ntried to arrange an appointment for White at the University of Chicago, but this did not work out. Instead he became an associate professor of pure mathematics at Northwestern University in\n1892\nbeing promoted to full professor there two years later. Parshall writes\n[\n3\n]\n:-\nThe thirteen years White spent in Evanston, Illinois, proved fruitful for him both mathematically and relative to the wider arena of the developing American mathematical research community. In\n1893\nhe, together with\nEliakim Moore\n,\nOskar Bolza\n, and\nHeinrich Maschke\nof the University of Chicago, organised the Mathematical Congress of the World's Columbian Exposition in Chicago, the first major mathematical meeting held on American shores.\nKlein\nattended the Columbian Exposition and then went to Evanston to spend two weeks there at White's invitation to give a series of lectures on contemporary mathematical research. The result was the Evanston Colloquium lectures which were published by Macmillan and Co. in\n1894\n. White's success here led him to approach the\nAmerican Mathematical Society\nsuggesting that such Colloquium lectures should become a feature. White wrote to\nFiske\nin\n1896\n:-\nOur summer meeting last year was profitable in various ways; but not specially, perhaps, as a stimulus to mathematical thought. One would likely derive more direct advantage from an hour in any one of several lecture rooms in this country. Yet each one found two or three papers out of the program of high interest. Now, why would it not be possible to combine with this miscellaneous program\n(\nwhich ought by all means to be kept up\n)\nsomething more akin to university models? Would not a series of three or six lectures on nearly related topics, if well chosen, prove attractive and useful to larger numbers?\nWhite's proposal was indeed taken up by the\nAmerican Mathematical Society\nand the result was the American Mathematical Society Colloquium lectures which are published as the\nAmerican Mathematical Society Colloquium Publication\nseries.\nIn\n1905\nWhite was appointed as professor at Vassar College in Poughkeepsie, New York. This may seem like a rather strange career move, but the reason was a personal one, namely the illness of his mother. Vassar College was then a college for women, founded to provide women with a quality of education previously only available to men.\nGrace Hopper\nwas one who benefited from the quality education provided there. White retired from Vassar College in\n1936\n.\nWhite was an excellent research mathematician. He worked on invariant theory, the geometry of curves and surfaces, algebraic curves and\ntwisted curves\n. Examples of the papers he wrote are:\nTwo elementary geometrical applications of determinants\n(1899)\n,\nConics and cubics connected with a plane cubic by certain covariant relations\n(1900)\n,\nPlane cubics and irrational covariant cubics\n(1900)\n,\nOn twisted cubic curves that have a directrix\n(1903)\n,\nTriangles and quadrilaterals inscribed to a cubic and circumscribed to a conic\n(1906)\n,\nTriple-systems as transformations, and their paths among triads\n(1913)\n, and\nThe multitude of triad systems on\n31\nletters\n(1915)\n. In\n[\n1\n]\nArchibald describes in detail a theorem proved by White in\n1915\n:-\nIf seven points on a twisted cubic be joined, two and two, by twenty-one lines, then any seven planes that contain these\n21\nlines will\nosculate\na second cubic curve. This theorem is more strictly fundamental than\nvon Staudt\n's ...\n[\nwhich\n]\ncan be deduced from White's.\nDespite White's impressive mathematical contributions, he may be most important for his work for the\nAmerican Mathematical Society\n. Having instigated the Colloquium Lectures, as we described above, he was a Colloquium Lecturer himself in\n1903\nwhen he lectured on\nLinear systems of curves on algebraic surfaces\n.  White was vice-president of the\nAmerican Mathematical Society\nin\n1901\nand then president from\n1907\nto\n1908\n. He was an editor of the\nAnnals of Mathematics\n(1899\n-\n1905)\nand editor of the Transactions of the\nAmerican Mathematical Society\n(1907\n-\n1914)\n. The papers we mentioned above all appear in one of these two journals. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1915\n.\nIn\n[\n1\n]\nArchibald notes his love of music and the fact that White's wife was the composer Mary Gleason. White is described as:-\nWise, kind, the soul of courtesy.\nCoble\nwrites in the preface to\n[\n4\n]\n:-\nWhite was one of perhaps a dozen men who furnished the inspiration and set the pattern for the development of the present school of American mathematics.",
  "math_areas": [
    "Geometry"
  ]
}