{
  "nome_completo": "Henry Maurice Sheffer",
  "nome_curto": "Henry Sheffer",
  "ano_nascimento": "1882",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sheffer/",
  "lugar_nascimento": "Odessa, Russia (now Ukraine)",
  "lugar_morte": "Boston, Massachusetts, USA",
  "biografia": "Henry Sheffer\nwas the son of Max Sheffer\n(\nborn about\n1859)\nand Ida Hirshberg\n(1862\n-\n1942)\n. Max and Ida were married in\n1881\nand they had nine children, seven of whom survived. The family were Jewish and their spoken language was Yiddish. Henry's six surviving siblings were Rose\n(\nborn about\n1889\nin Russia\n)\n, Mary\n(\nborn about\n1890\nin Russia\n)\n, Meyer\n(\nborn\n26\nDecember\n1894\nin Boston, died\n1981)\n, Sadie\n(\nborn\n26\nOctober\n1896\nin Boston, died\n10\nJune\n1987)\n, William\n(\nborn about\n1898\nin Boston\n)\n, and Isadore Mitchell\n(\nborn\n14\nOctober\n1901\nin Boston\n)\n. Let us remark that Isadore Mitchell Sheffer, who died\n20\nApril\n1992\n, became a mathematician with a Ph.D. from Harvard University in\n1927\nwith\nGeorge Birkhoff\nas his advisor; he became a professor of mathematics at Pennsylvania State University.\nThe members of the family who were born in Russia did not all emigrate to the United States at the same time. Max entered first in\n1891\n, while his wife and children followed two years later: official forms show that Ida, Mary, Henry, and Rose entered in\n1893\n. The\n1893\nvoyage was on the ship\nCalifornia\nwhich sailed from Rotterdam in August\n1893\n.\nWe note that many Jewish families emigrated from Odessa and the surrounding area in the second half of the\n19\nth century to try to find a better life away from anti-Jewish agitation and attacks. The government did nothing to protect the Jewish population, so many felt they had no alternative but to emigrate. The way that the Sheffer family left, in that the husband would leave first and set up things in their chosen country, followed by the rest of the family a couple of years later, was fairly typical.\nArriving in Boston in\n1893\n, Henry quickly prepared for schooling, and entered the Eliot grammar school\n[\n15\n]\n:-\nHis aptness in all matters educational soon attracted the attention of the teachers, and young Sheffer succeeded in attaining enough knowledge to pass the entrance examinations to the Boston Latin school.\nThe Boston Latin School is one of the most prestigious secondary schools in America established in\n1635\n. We note that Sheffer was the only member of his family to attend the school. The headmaster at this time was Moses Merrill\n(\nheadmaster from\n1871\nto\n1901)\nand Sheffer studied the standard course of education offered by the Latin School at that time, namely English, Latin, Greek, French, science, mathematics and classical history. Susanne Langer writes\n[\n10\n]\n:-\nWith amazing agility young Henry fitted himself into the new educational system, caught up to his schoolmates in the subjects they had laboriously learned in their four previous grades, and in due time found his place in the Boston Latin School. An extraordinary ear for language seems to have helped him over the newcomer's most formidable barrier, the strange tongue.  His linguistic talent was evident throughout his life. He spoke English without any foreign accent, though with a New England \"a\" and \"r\" which reflected the sources of his learning. The thorough training in Latin and Greek that the famous Boston Latin School provided, as well as some ability to read Hebrew which he owed to his grandfather in Russia\n(\naccording to his mother, he wrote poems in Hebrew before he was ten years old\n)\n, made a solid foundation for the acquisition of modern languages, French, German and Italian as well as English. This man without any literary pretensions had a great and accurate command of the tongue he had made his own, so that his lectures and his few brief writings had a rare style and dignity, befitting the nature of his thought.\nThe article in the Boston Daily Morning Post from June\n1901\n[\n15\n]\ntells us more of Sheffer's success at the Boston Latin School:-\nLike many successful predecessors, Henry Sheffer picked up a goodly knowledge of the world while selling newspapers. He always attracted customers by his brightness and gentlemanly manners, and soon he had established a very good business. Upon his admission to the Boston Latin school he devoted even more time to his studies, and so persevering was he that in three years he has succeeded in finishing the regular six years' course. This in itself is a remarkable distinction for one so young, but he has also commanded the respect and envy of his classmates by winning the Derby prize at the Latin school for the best original essay in Latin. For this young Sheffer was presented with a gold medal. He also received the following highest prizes at the award of prizes at the school building last Wednesday\n[\n29\nMay\n1901]\n: For excellence in classics; For exemplary conduct and punctuality; and For the best written exercise. This bright youth will be graduated from the Latin School this month and is assured of his entrance into Harvard University. He has already passed the Harvard preliminary examinations, doing so with much honour last June. He will take the final examinations this month, entering the university in the fall. He hopes to complete the four years' course in the three years.\nIn the autumn of\n1901\n, Sheffer entered Harvard University. While he was an undergraduate student, he became a citizen of the United States of America completing the necessary form on\n1\nAugust\n1904\n. His application was supported by Hyman Morrison and Robert Silverman. Hyman Morrison\n(1881\n-\n1963)\nwas a Jewish student at Harvard University who, like Sheffer, was born in Russia and had emigrated to the United States in\n1894\n. Morrison went on to have a prestigious medical career. Robert Silverman was an active Zionist law student at Boston University who was also born in Russia and emigrated to the United States in\n1893\n.\nSheffer was awarded a B.A. in\n1905\nand continued to work towards his Master's Degree. He was awarded an M.A. in\n1907\nand then undertook research for a doctorate advised by Josiah Royce\n(1855\n-\n1916)\n. Even before the award of his M.A., in\n1906\n, he was appointed as an assistant to Josiah Royce. Although Sheffer did not agree with Royce's metaphysical views, nevertheless, Royce had been making a deep study of mathematical logic following criticism of his use of logic by\nCharles S Peirce\n. Sheffer, who approached philosophy in a scientific and mathematical way, was very much in tune with Royce's recent enthusiasm for symbolic logic. His thesis was entitled A Program of Philosophy based on Modern Logic and he was examined in\n1908\nby the committee consisting of Josiah Royce, Edwin B Holt, and\nEdward V Huntington\n. Michael Scanlan writes in\n[\n18\n]\n:-\nHenry Sheffer's\n1908\nHarvard Ph.D. thesis contains an interesting appendix on a central feature of the logical work of his thesis advisor, Josiah Royce. This is the claim in Royce's\n1905\narticle \"The Relations of the Principles of Logic to the Foundations of Geometry\" that an unsymmetric ordering relation can be defined on the single symmetric O-relation for which he gives postulates in that paper. Sheffer criticises Royce's specific definition from the point of view of the evolving twentieth century conception of axiomatic method and also shows more generally that an unsymmetric order relation cannot be defined in the system of the\n1905\npaper based on the O-relation.\nWe note that the confidence that Sheffer has at this stage in his career, in giving an appendix showing a major error by his thesis advisor who, of course, was also an examiner of the thesis. In\n1909\nhe published the paper\nIneffable Philosophies\nwhere again we see his approach to philosophy:-\nThat the method of philosophy is that of logic, of articulate thought, and of a corresponding coherent formulation, no one, philosophers will say, has ever doubted. The fact is, however, that reputable philosophers have, in practise, often shown themselves blind to this elementary requirement. Many a philosopher might as well have called his work a work of art, a lyric poem, or an unfinished drama, as to have called it a philosophic system. For many a system-builder has forgotten the simple truth that although various things in life are neither coherent nor articulate, philosophy can not be one of those things.\nFollowing the award of his doctorate, he won a Sheldon Traveling Fellowship to fund two years of study in Europe. On\n18\nApril\n1910\nhe applied for a passport to make his European trip. The application contains a nice description of Sheffer: age\n27\n; height\n5\nft\n2\nin; forehead high; eyes brown; nose straight; mouth medium; chin square; hair brown; complexion light; face long. His first European visit was to be to\nBertrand Russell\nat the University of Cambridge, England, and Royce had written to\nRussell\non\n29\nJune\n1910\nsaying, \"we have, in America, no more promising research student of the new logic than Sheffer is.\"\nRussell\nhad just published the article\nMathematical Logic as Based on the Theory of Types\n(1908)\nand Sheffer attended\nRussell\n's 'Mathematical Philosophy' lectures in the Michaelmas term. After visiting\nRussell\n, Sheffer travelled to Göttingen, Germany visiting\nDavid Hilbert\nbefore going on to Italy where\nGiuseppe Peano\nwas about to give a course on 'The New Mathematical Logic'. Later in his career, when one of his students asked how he managed to understand lectures in Italy, he replied\n(\nsee\n[\n10\n]\n)\n:-\nProfessor\nPeano\nwas very considerate, and conducted the seminar in French for most of the first term, until I could speak Italian.\nWhile on his travels he met and had discussions with, in addition to those mentioned above,\nGottlob Frege\n,\nCesare Burali-Forti\n,\nAlessandro Padoa\nand others.\nBack in the United States by the autumn of\n1911\nhe began a series of one year appointments:\n1911\n-\n12\n, Instructor in Philosophy and Psychology at the University of Washington, in Seattle;\n1912\n-\n13\n, Lecturer in Mathematical Logic at Cornell;\n1913\n-\n14\n, Instructor in Philosophy and Psychology at the University of Minnesota;\n1914\n-\n15\n, in Philosophy at the University of Missouri;\n1915\n-\n16\n, at City College in New York;\n1916\n-\n17\n, at the University of Michigan. Sheffer had just started his one year appointment at the University of Michigan when Josiah Royce died on\n14\nSeptember\n1916\n. Harvard Philosophy Department asked Sheffer to return there as a temporary instructor to help cover their teaching commitments and he took up this position in the winter of\n1917\n. We note the uncomfortable fact that, since Sheffer was Jewish, Harvard University insisted his salary should be provided by outside sources. Before taking up the position, in June\n1917\n, he married Adele Blonden who was\n12\nyears younger than her husband.\nFor details of Sheffer's difficult marriage, see\nTHIS LINK\n.\nBy this time Sheffer had already published the ideas for which he is now most famous. These ideas are contained in\nTotal determinations of deductive systems with special reference to the algebra of logic\n(1910)\n; A set of postulates for Boolean algebra\n(1913)\n, and\nA set of five independent postulates for Boolean algebras, with application to logical constants\n(1913)\n. These three were all published by the\nAmerican Mathematical Society\n, the first two are abstracts in the Bulletin of lectures Sheffer gave to the\nSociety\n, the third is a paper in the Proceedings. These contain the now famous \"Sheffer stroke\". Sheffer\n[\n17\n]\n:-\n... is well-known as the discoverer of the eponymous \"Sheffer stroke\", a binary truth-functional operator with which any truth-functional operator can be defined. This was presented in his\n1913\npaper, \"A Set of Five Independent Postulates for Boolean Algebras, with application to logical constants\". As the title indicates, Sheffer's stroke operator was not originally developed by him in the context of truth-functional logic, but to use in postulate sets for Boolean Algebra. This idea could be applied to the propositional logic of 'Principia Mathematica', and Sheffer does this by giving definitions of the \"primitive ideas\" of negation and disjunction using his stroke with the interpretation of \"\np\n∣\nq\np | q\np\n∣\nq\n\" as \"neither p nor q\".\nBertrand Meyer writes\n[\n13\n]\n:-\n[\nSheffer\n]\nwas not very prolific, but his introduction of\n(\nwhat is now called\n)\nthe NAND operator can be said to lie at the basis of the entire computer industry! He showed that all logical operators can be derived from a single one, NAND.\nWe note that in fact Sheffer's stroke was discovered by\nCharles Sanders Peirce\nin\n1880\nand is in an unpublished manuscript of this date and another dated\n1902\n. This, however, only came to light long after Sheffer's\n1913\npublication. In fact, the discovery of\nC S Peirce\n's\n1880\nmanuscript was made by Paul Weiss in the autumn of\n1926\nin a basket labelled \"to be discarded.\"\nBertrand Russell\nwas impressed by Sheffer's introduction of the Sheffer stroke and when he revised\nPrincipia Mathematica\nfor a second edition he skilfully integrated the stroke into the work.\nWittgenstein\nmade extensive use of the Sheffer stroke in his\nTractatus\n, but does not give credit to Sheffer\n(\nin fact he gives no sources\n)\nbut\nRussell\nin his\nIntroduction to the Tractatus\ngives full credit to Sheffer.\nDespite these strong endorsements of Sheffer's work, he remained an instructor at Harvard for ten years. It is hard to tell exactly why this was the case as a number of different factors played a part but these factors are not independent. One factor was undoubtedly the fact that Sheffer was Jewish. William Ernest Hocking\n(1873\n-\n1966)\nwas the Professor of Philosophy at Harvard and Abbott Lawrence Lowell\n(1856\n-\n1943)\nwas President of the University. Lowell wrote to Hocking, who had already proposed ways to eliminate \"undesirable Jews\", suggesting that a limit be put on the number of Jewish students claiming that their numbers would cause Protestants to leave and thus \"ruin the College.\" Although no limits on Jews were agreed, selecting students not only for their academic abilities but also for their \"character and personality\" was brought in as a new admission policy by Harvard in\n1922\n. It was seen by many as a way of limiting the number of Jewish students and the general anti-Semitic atmosphere must have affected Sheffer. When talking with\nKarl Menger\nin\n1930\n, Sheffer spoke of his \"serious social difficulties at Harvard\" and the importance of\nRussell\n's support, given the speed with which gossip spreads in universities.\nSheffer had other problems relating to his health. He suffered from episodes of severe depression. Although the following description by Morton White in\n[\n3\n]\nrelates to an episode in\n1948\n, it illustrates Sheffer's problems:-\nHenry Aiken\nwas also very fond of Sheffer and would go to his room in the old Ambassador Hotel just to sit there with the poor man while he sat with his face to a wall and groaned loudly. I vividly remember this groaning on a day when I went to lunch with Sheffer and\nLewis\nwhile Sheffer was ill.\nLewis\n, who was familiar with the ways of his almost lifelong friend, paid no attention to Sheffer's peculiar noises throughout the meal and kept up a conversation with me alone. It was clear to\nLewis\nthat Sheffer wanted merely to be with people and not talk to them during these episodes.\nIn addition, he had serious problems with his marriage as detailed in\n[\n8\n]\n. Of course it is impossible to say whether his depression caused marriage difficulties and social problems or whether marriage difficulties and anti-Semitism caused\n(\nor at least added to\n)\nhis depression. His other major difficulty regarding promotion was his lack of papers. Most of his publications are abstracts of lectures or reviews of other works. Again, perhaps his depression and other difficulties made it hard for him to write papers, but perhaps there was pressure on him to publish which added to his difficulties.\nIn\n1927\n, after ten years as an instructor, Sheffer was promoted to assistant professor. This seems to have been the result of a serious breakdown by Sheffer and the consequent realisation by the philosophy department of how valuable he was as a teacher. Also an important factor was a memorandum by\nA N Whitehead\ndated\n23\nJanuary\n1927\nin which he wrote\n[\n2\n]\n:-\nSymbolic Logic, as the general theory of structure, has been generalized to its utmost extent by Dr Sheffer. He has not only enunciated the general principles, but achieved the far more difficult task of making substantial progress in constructing the ground work of the science. ... In the department of philosophy at Harvard, Mr Sheffer has been notably successful in exciting interest among those students with aptitude for this study.\nNow it is clear that the philosophy department supported Sheffer while the university administration was hostile for his promotion to assistant lecturer in\n1927\nand to associate professor two years later, were both funded by the philosophy department and not from university funds. He was promoted to full professor in\n1938\nand continued in that role until he retired in\n1952\n.\nFelix Frankfurter write in\n[\n7\n]\n:-\nThe essays which make up this book have been written in honour of Henry Maurice Sheffer. The colleagues, pupils, and friends who contribute them do so, not in order to signalize any special occasion, such as a birthday but in spontaneous acknowledgment of the comrade's qualities of mind and heart. All his life Professor Sheffer has been a kind, quiet, sensitive man, burdened with responsibilities that only an unusually firm will and courageous spirit could sustain. The conditions under which he has done his work in his chosen fields have been arduous, the handicaps as severe as any philosopher has known. Nevertheless, although he has published little, he has created greatly, and all of his work has been seminal, and may become, like that of\nCharles Peirce\n, the guidelines for new ways of thinking among a later generation. Upon the present one, his impact comes, as did that of Socrates, in his face-to-face relations with his pupils. Not a few have built elaborate systems upon aperçus, and by means of techniques, they have drawn from him. A notable philosopher who was a pupil of his describes his teaching as a unique experience. \"All the energy that most of us divide between teaching and writing he put into his courses alone. All his research went straight across the seminar table ... to his students. I remember one day when he said to us: 'Today I want to talk without interruption because this is a new theory I am just working out, and if you weren't here I'd be talking to the wall. I'd rather talk to people. I'm tired of the wall. But please be just as quiet as the wall, and if I have to write and erase a few things before I really expound them, just give me time.' We did, and he worked out before our eyes the reduction of a complex relational statement to the \"shorthand\" form in which it appears as the attribution of a property to a term; leaving us to draw, if we would, the moral for metaphysics.\"\nOther references to Sheffer as a person include the following from Morton White\n[\n3\n]\n:-\nHe was an extremely sweet man, and very generous to me when I came there. He would often invite me out to lunch ... and reminisce charmingly about Royce, James, Santayana, and his friend Morris Cohen.\nKarl Menger\nvisited him in\n1930\nand wrote afterwards:-\nOf the Harvard philosophers, the one I saw most frequently was Henry Maurice Sheffer, a very personable and likeable man. On hikes in the beautiful surroundings of Cambridge we had long, if inconclusive, talks about philosophy. Does logic describe correct thinking and what is correct thinking anyway? Or is logic simply the grammar of the particles not, and, all, etc? Is it a coincidence that practically all languages agree in the use of the logical particles?\nWillard Van Quine\nwrites\n[\n16\n]\n:-\nScarcely five feet tall, Sheffer was vehement, irritable, witty, unpretentious, and amiable. He kept his classes small and would seldom admit an unenrolled auditor, but if he thought a student was seriously interested in logic, he was generous with his help. ... Many philosophers got their first view of modern logic from Shaffer, and many found it inspiring.\nSheffer died at Beth Israel Hospital in Boston at the age of\n80\nand was buried at the Jewish Congregation Chai Odom cemetery in West Roxbury, Massachusetts. His wife Adele predeceased him on\n13\nAugust\n1961\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Logic"
  ]
}