{
  "nome_completo": "Henry William Watson",
  "nome_curto": "Henry Watson",
  "ano_nascimento": "1827",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Watson_Henry/",
  "lugar_nascimento": "Marylebone, London, England",
  "lugar_morte": "Berkswell (near Coventry), England",
  "biografia": "Henry Watson\n's mother was Eleanor Mary Kingston, and his father was Thomas Watson who served in the Royal Navy. Henry was educated at King's College, London, winning the first mathematical scholarship which had been set up there, then in\n1846\nhe went to Trinity College, Cambridge, again with a scholarship. He graduated in\n1850\nas second\nwrangler\nand Smith's prizeman.\nIn\n1851\nWatson became a fellow of Trinity College and from\n1851\nuntil\n1853\nhe was a tutor in mathematics at Cambridge. In\n1854\n, after he had spent a short time studying law in London, he became a mathematics master at the City of London School. While holding this position, Watson married Emily Rowe from Cambridge in\n1856\n. They had three children, one son and two daughters. From\n1857\nWatson lectured at King's College, London. In\n1860\n-\n61\nCambridge appointed him moderator and examiner for the Mathematical Tripos.\nIn fact Watson has been ordained a deacon in\n1856\nand he took priest's orders two years later. From\n1857\nuntil\n1865\nhe was mathematics master at Harrow School. He left in\n1865\n, however, to become Rector of Berkswell with Barston near Coventry where he remained until he retired\n[\n3\n]\n:-\nThis afforded him ample leisure to pursue his mathematical and scientific studies ...\nAfter leaving Berkswell, Watson went to live in Brighton.\nWatson wrote a number of mathematics books during the time he was rector of Berkswell. He wrote\nThe elements of plane and solid geometry\n(1871)\n,\nTreatise on the kinetic theory of gases\n(1876)\n. After this book appeared Watson corresponded with\nMaxwell\nand the results of this correspondence is contained in the second edition of the book which appeared in\n1893\n.\nAfter publishing on dynamics in\n1879\n, Watson wrote a two volume work\nThe mathematical theory of electricity and magnetism\n. The first volume\nElectrostatics\nappeared in\n1885\n, the second\nMagnetism and electrodynamics\nappeared in\n1889\n.\nIn addition to these books he wrote on\nLagrange\n's method and\nMonge\n's method for solving\npartial differential equations\nand, jointly with\nGalton\n, he wrote\nOn the\nprobability\nof extinction of families\n. This paper was written after a correspondence between the authors in\n1873\nand the paper contains a version of the 'Criticality Theorem' which is the foundation of the modern theory of branching processes.\nKendall\ndescribes in\n[\n5\n]\nhow the work started:-\nGalton\n... gave to the problem\n[\nof extinction of families\n]\na precise mathematical formulation, and communicated it in\n1873\nto ... the Educational Times. ... The only solution received did not please\nGalton\n... He therefore persuaded Watson to take up the matter. ...\nGalton\nhad consulted Watson a year or so earlier about a device for obtaining useful work from the energy of waves...\nWatson was elected a fellow of the\nRoyal Society\nin\n1881\nand given an honorary D.Sc. by Cambridge in\n1883\n. He was nominated by the Senate of Cambridge University to represent it as a governor on the King Edward's Foundation in Birmingham. He was bailiff of King Edward's School for three years.\nAmong his interests was mountaineering and he was an early member of the Alpine Club. He was also a founder member of the Birmingham Philosophical Society and served as its president in\n1880\n-\n81\n.",
  "math_areas": [
    "Geometry",
    "Statistics"
  ]
}