{
  "nome_completo": "Henry Briggs",
  "nome_curto": "Henry Briggs",
  "ano_nascimento": "1561",
  "ano_morte": "1630",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Briggs/",
  "lugar_nascimento": "Warleywood, Yorkshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Henry Briggs\nwas the man most responsible for scientists' acceptance of logarithms. He is of great importance in the development of mathematics but, as Hill writes in\n[\n8\n]\n:-\n... significant though Briggs was as a mathematician in his own right, his greatest importance was as a contact and public relations man.\nBriggs was born at Warley Wood\n(\nor Warleywood\n)\nin the parish of Halifax, Yorkshire. His birth is recorded in the Halifax parish register as February\n1561\nyet this information contradicts a notice by J Mede written at Christ's College Cambridge on\n6\nFebruary\n1630\n, a few days after Briggs died, which states\n(\nsee for example\n[\n1\n]\n)\n:-\nMr Henry Briggs of Oxford, the great mathematician, is lately dead, at\n74\nyears of age.\nIf Mede were correct then Briggs would have been born in\n1556\n, but it seem highly unlikely that he is correct, for there seems no possible reason to think that the Halifax parish records could be wrong. We know little of Briggs's family but there is a history of Norfolk, by Blomefield, which states that Briggs's family were originally from Salle in that county. Blomefield is known to be wrong in a number of other such claims so not too much weight should be put on this statement, although, on the other hand, there is some evidence that other members of Briggs's family did have Norfolk connections. In fact Richard Briggs, who was Henry Briggs's brother, became headmaster of a school in Norfolk. Richard Briggs had important friends such as Ben Jonson, the dramatist, poet, and literary critic and a letter from Ben Jonson to Richard Briggs still exists.\nHenry Briggs attended a grammar school near Warley Wood where he became highly proficient at Greek and Latin. After completing his school studies, he entered St John's College of Cambridge University in\n1577\n. Admitted as a scholar on\n5\nNovember\n1577\n, Briggs received the degree of B.A. in\n1581\n, receiving his M.A. four years later. In\n1588\n(\nsome sources give\n1589)\nhe was elected a fellow of St John's College and then, in\n1592\n, he became:-\nReader of the Physic Lecture founded by Dr Linacre.\nThomas Linacre, born almost exactly\n100\nyears before Briggs, had been so upset by the fact that medicine was practised by barbers and clergymen without proper qualifications that he founded the Royal College of Physicians of London. The Linacre lectureship that Briggs was appointed to was therefore a medical lectureship but, in the same year of\n1592\n, Briggs was also appointed as an examiner and lecturer in mathematics at Cambridge. It certainly appears that his talents were wide ranging.\nIn\n1596\nBriggs became the first professor of geometry at Gresham College, London which had just been founded. He was to hold this position in Gresham College for\n23\nyears, the College being famed as the birthplace of the\nRoyal Society\nof London about\n25\nyears after Briggs left. We know something of Briggs's work at this time since he became firm friends with James Ussher in\n1609\n. Ussher was then a professor at Trinity College, Dublin, but later, in\n1625\n, became archbishop of Armagh. Letters sent to Ussher have survived and some have been published, in particular one written by Briggs in August\n1610\n. This letter shows that at this time Briggs was greatly interested in astronomy, in particular he was studying eclipses. This was a topic which involved many heavy calculations so Briggs was greatly struck when he read\nNapier\n's work on logarithms by the great help that they would provide to those involved in astronomy.\nIt was not only the fact that logarithms were so useful for astronomical calculations which attracted Briggs to them. He was already highly involved in producing tables to aid calculation and he had published two types of tables before he read about\nNapier\n's logarithms. In\n1602\nBriggs had published\nA Table to find the Height of the Pole, the\nMagnetic Declination\nbeing given\nand in\n1610\nhe had published\nTables for the Improvement of Navigation\n.\nBriggs read\nNapier\n's\n1614\nLatin text on logarithms and, on the\n10\nMarch\n1615\n, wrote in a letter to his friend James Ussher that he was:-\n... wholly employed about the noble invention of logarithms, then lately discovered.\nBriggs continued:-\nNapper, lord of Markinston, hath set my head and hands a work with his new and admirable logarithms. I hope to see him this summer, if it please God, for I never saw a book which pleased me better or made me more wonder.\nAs soon as Briggs had read about logarithms he began thinking about improvements and was soon teaching his students about the new topic. He wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nI myself, when expounding this doctrine publicly in London to my auditors in Gresham College, remarked that it would be much more convenient that\n0\nshould be kept for the logarithm of the whole sine ... concerning this matter I wrote immediately to the author himself.\nLet us look at the problem which Briggs was attempting to address. The logarithms Nap.log invented by\nNapier\nare different from the logarithms that we use today. The fact that Nap.log\n1\ndoes not equal\n0\nis a major difficulty which makes Nap.logs much less convenient for calculations than today's logarithms. It is often written in books on the history of mathematics that Briggs was responsible for the change to logarithms with log\n1\n=\n0\n. However, although logarithms with log\n1\n=\n0\nfirst appear in print in Briggs's work, he himself gives the credit for the idea to\nNapier\n. Certainly the idea came about in discussions between\nNapier\nand Briggs.\nBriggs made the difficult journey from London to Edinburgh to see\nNapier\nin the summer of\n1615\n. It was not the easy journey of\n4\nhours by train that we could make today, but rather for Briggs it was a journey of at least\n4\ndays by horse and coach. It was not a journey one would undertake lightly but Briggs was desperately keen to meet\nNapier\n. A description of their meeting was told by John Marr to William Lilly who writes the following\n(\nsee\n[\n6\n]\n)\n:-\nMr Briggs appoints a certain day when to meet at Edinburgh; but failing thereof, Merchiston was fearful he would not come. It happened one day as John Marr and the Lord\nNapier\nwere speaking of Mr Briggs, \"Oh! John,\" saith Merchiston, \"Mr Briggs will not come now\"; at the very instant one knocks at the gate, John Marr hastened down and it proved to be Mr Briggs to his great contentment. He brings Mr Briggs into my Lord's chamber, where almost one quarter of an hour was spent, each beholding the other with admiration, before one word was spoken. At last Mr Briggs began, -\"My Lord, I have undertaken this long journey purposely to see your person, and to know by what engine of wit or ingenuity you came first to think of this most excellent help unto astronomy, viz. the Logarithms; but, my Lord, being by you found out, I wonder nobody else found it out before, when now known it is so easy.\nBriggs had suggested to\nNapier\nin a letter sent before their meeting that logs should be\n(\nin our terminology\n)\nto base\n10\nand Briggs had begun to construct such tables.\nNapier\nreplied that he had had the same idea but\n(\n[\n6\n]\n)\n:-\n... he could not, on account of ill-health and for other weighty reasons undertake the construction of new tables.\nAt their meeting\nNapier\nsuggested to Briggs the new tables should be constructed with base\n10\nand with log\n1\n=\n0\n. Briggs wrote that\nNapier\nproposed\n(\nsee for example\n[\n1\n]\n)\n:-\n... that\n0\nshould be the logarithm of unity and\n10\n,\n000\n,\n000\n,\n000\nthat of the whole sine, which I could not but admit was by far the most convenient.\nIndeed Briggs did construct such tables. He spent a month with\nNapier\non his first visit of\n1615\n, made a second journey from London to Edinburgh to visit\nNapier\nagain in\n1616\n, and would have made yet a third visit the following year but\nNapier\ndied in the spring before the planned summer visit.\nBriggs's first work on logarithms\nLogarithmorum Chilias Prima\nwas published in London in\n1617\n. The recent death of\nNapier\nis referred to in the preface as is Briggs reason to publish that work, namely:-\n... for the sake of his friends and hearers at Gresham College.\nBriggs published an article\nA Description of an Instrument Table to find the Part Proportional, devised by Mr Edward Wright\nin Wright's English translation of\nNapier\n's\nCanon\n. After Wright's death, Briggs published two further editions of this work\n(1616\nand\n1618)\nwith a preface he wrote himself. Briggs's mathematical treatise\nArithmetica Logarithmica\nwas published in\n1624\n. This gave the logarithms of the natural numbers from\n1\nto\n20\n,\n000\nand\n90\n,\n000\nto\n100\n,\n000\ncomputed to\n14\ndecimal places. It also gave tables of natural sine functions to\n15\ndecimal places, and the tan and sec functions to\n10\ndecimal places. In this book Briggs suggested that the logs of the missing numbers might be computed by a team of people and he even offered to supply specially designed paper for the purpose.\nThe completed tables were printed at Gouda, in the Netherlands, in\n1628\nin an edition by\nVlacq\nin which\nVlacq\nhad added the logarithms of the natural numbers from\n20\n,\n000\nto\n90\n,\n000\n. The tables were also published in London in\n1633\nunder the title of\nTrigonometria Britannica\n. The printing of the London edition took place after Briggs had died but he had asked his friend\nHenry Gellibrand\nto look after the project on his behalf.\nGellibrand\nwas professor of astronomy at Gresham College and was particularly interested in applications of logarithms to trigonometry. He therefore added a preface of his own on applications of logarithms to both plane trigonometry and to spherical trigonometry.\nWe have followed through Briggs involvement with logarithms but we should go back and look at his other work and the final stage of his life after he left Gresham College. His interest in astronomy continued throughout his years at Gresham College and six letters still exist which were written to him between\n1603\nand\n1619\nby Sir Christopher Heydon on comets and other astronomical and mathematical topics.\nIn\n1619\nSavile\nfounded a chair of geometry at Oxford because:-\n... geometry is almost totally unknown and abandoned in England.\nSavile\ngave the first lectures himself then asked Briggs to fill the chair. Briggs accepted and after receiving high praise from\nSavile\nin his last lecture, took over the course continuing from the point that\nSavile\nhad reached, namely the ninth proposition of\nEuclid\n's\nElements\n. Briggs was made a fellow of Merton College Oxford to enable him to hold the Savilian chair but he did not resign his position in Gresham College until a few months later, ending his\n23\nyear employment with the Gresham College on\n25\nJuly\n1620\n.\nBriggs's first publication after his appointment at Oxford was an edition of the first six book of\nEuclid\n's\nElements\nwhich he published in\n1620\n. He chose not to include the fact that he was the editor on these texts, merely attributing the entire work to\nEuclid\n. His next work published in\n1622\nwas not on a mathematical topic, but rather on one of great interest at the time:\nA Treatise of the Northwest Passage to the South Sea, Through the Continent of Virginia and by Fretum Hudson\n. This publication was more natural than it appears for Briggs had interests outside the academic world, being a member of a company trading with Virginia. Again Briggs chose not to put his name on the work, the author simply appearing as H. B.\nIn addition to his publications, Briggs wrote a number of other works which have never been published. These include works on the geometry of Ramus and on Longomontanus's treatise on\nsquaring the circle\n. A treatise on geometry and another on arithmetic were similarly never published.\nBriggs was highly regarded by other mathematicians. We have already referred to\nSavile\n's high regard for him and another contemporary,\nOughtred\n, described Briggs as:-\n... the mirror of the age for excellent skill in geometry.\nBarrow\n, born the year the Briggs died, was appointed professor of geometry at Gresham College in\n1662\n. In his inaugural lecture he referred to Briggs, who had held the same post some\n50\nyears earlier, as the man who made logarithms a vital tool for all scientists.\nOf his character we know only his modesty from his writings, his fairness in giving full attributions to others and\n[\n12\n]\n:-\n... from the references to him by his contemporaries ... that he was a man of amiable character.\nA final comment on his character is worth making, namely that in an age where astrology was an important topic for most men of learning, Briggs strongly opposed it. William Lilly, from whom we quoted the description of the meeting of\nNapier\nand Briggs above, wrote that\n(\nsee for example\n[\n12\n]\n)\n:-\n...\nNapier\nwas a great lover of astrology, but Briggs was the most satirical man against it that hath been known.",
  "math_areas": [
    "Geometry"
  ]
}