{
  "nome_completo": "Henry Moseley",
  "nome_curto": "Henry Moseley",
  "ano_nascimento": "1801",
  "ano_morte": "1872",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moseley/",
  "lugar_nascimento": "Long Buckby, Northamptonshire, England",
  "lugar_morte": "Olveston, Gloucestershire, England",
  "biografia": "Henry Moseley\nwas the son of William Moseley and Margaret Robins. Let us make it clear before we proceed that the details at the beginning of the\nDictionary of National Biography\narticle\n[\n16\n]\n, contain errors. The article begins:-\nMoseley, Henry\n(1801\n-\n1872)\n, mathematician and writer on mechanics, was born on\n9\nJuly\n1801\n, the son of Dr William Willis Moseley, who kept a large private school at Newcastle under Lyme, and his wife, Margaret Jackson. He was educated at the grammar school in Newcastle under Lyme ...\nWilliam Moseley was a student at Hoxton Academy in London which was for dissenting divinity students. He was invited to become a pastor at Atherstone in Warwickshire in a church formed on\n19\nFebruary\n1794\n, he left Atherstone to become an independent pastor in Long Buckby, Northamptonshire in\n1795\n. On\n27\nMay\n1796\nhe married Margaret Robins, the daughter of Robert and Margaret Robins. Their first child, William Michael Robert Moseley, was born in Long Buckby on\n25\nJanuary\n1798\n; he became an architect. Their second child was Henry Moseley, the subject of this biography. In\n1802\nthe family moved to Hanley in Staffordshire when the Rev William Moseley was appointed as a Congregational minister at the Independent Hanley Tabernacle Church on the High Street\n[\n13\n]\n:-\nThe Congregationalists possess one of the finest groups of buildings in\n[\nHanley\n]\n, known as the Tabernacle Church, to which are attached a lecture hall, schools, vestries, and class rooms. The buildings, which are situated in High Street, are in the perpendicular style of architecture, erected with red brick and stone. In the centre rises an embattled tower, with octagonal stair turret and pyramidal spire, attaining a total height of\n100\nfeet. The lecture hall, which is a very spacious apartment, has a richly traceried window of seven lights. Below the chapel is a large hall, around which are placed the various school and class rooms, and a library.\nWe note that Hanley was in the parish of Stoke but not far from Newcastle-under-Lyme. The Moseley family remained in Hanley until\n1814\n, so Henry was brought up in this town where he was a member of an ever increasing family. Children born after Henry included Margaret\n(\nborn\n1802)\n, Francis Xavier\n(\nborn\n1804)\n, Eliza\n(\nborn\n1805)\n, Harriot\n(\nborn\n1809)\n, Louisa\n(\nborn\n1810)\n, Andrew\n(\nborn\n1814)\n, Joseph Newman\n(\nborn\n1816)\n, Emma\n(\nborn\n1818)\n, and George Willis\n(\nborn\n1820)\n. We note that the births were recorded several years after the children were born and there are many inconsistencies in the dates of birth. For example, the birth of Henry, the subject of this biography, is recorded as\n19\nJuly\n1800\nwhile, in later life, he seemed to believe his birth was on\n9\nJuly\n1801\n.\nLet us note that the Rev William Moseley published several books, some consisting of his sermons, such as\nEssays on the Evidences of Christianity\n(1797)\n,\nA Memoir on the Importance and Practicality of Translating and Printing the Holy Scriptures in the Chinese language\n(\nSecond Edition,\n1801)\n,\nActual sin and future misery traced to their real causes; in which the Doctrine of Reprobation is examined\n(1805)\n, and\nThe New Token for Children\n(1805)\n. While in Hanley, he was also making a map\n[\n14\n]\n:-\nThe Rev William Moseley, of Hanley, Staffordshire, has long been engaged in preparing a map to exhibit the geography and history of the Old Testament at one view, and he has now nearly completed his design. This map will contain all the places of any note mentioned in the writings of Moses and the prophets, the division of the Land of Israel into tribes, the distances of the principal places, and the travels of the children of Israel from Egypt into Canaan, with an historical account of each place.\nAfter leaving Hanley in\n1814\n, the family probably spent time in Abbeville, Somme, France; certainly Henry attended school there. By\n1816\nthey were living in Hampshire Terrace, Southsea, Portsmouth, Hampshire when Joseph Newman Moseley was born. Henry attended a naval school in Portsmouth and while there wrote the paper\nOn measuring the Depth of the Cavities seen on the Surface of the Moon\n. By\n1818\nthe family were living at Canonbury, Islington, Middlesex, and from there on\n26\nSeptember, he submitted the paper to the\nPhilosophical Magazine\n. His paper begins:-\nThe attention of astronomers having for years past been directed to measuring the altitudes of lunar mountains, I have frequently been surprised that no attempts have yet been made to ascertain the depth of those cavities which are so conspicuous on the surface of the moon. Under a conviction that determining the depths of such cavities will not be considered unworthy of notice, after the first astronomers of Europe have endeavoured to ascertain the heights of mountains on the moon's surface, I beg leave to submit to the examination of your readers the enclosed method of measuring the depths of lunar cavities.\nFrom the same address on\n12\nJuly\n1819\n, Moseley sent the letter \"On cohesion\" to the\nPhilosophical Magazine\n. In it he wrote\n[\n4\n]\n:-\nConvinced that the known properties of matter present us with sufficient data for ascertaining the true law of cohesion, and that the ill success of a few, whose aim was rather to reconcile experiment with theories the favourite phantoms of their imaginations, than to deduce such theories from facts, did not stamp impossibility on the undertaking; I have been induced to commence an investigation of the subject, the result of which I beg leave to submit to the public through the medium of your valuable magazine.\nWe are unable to find the article with the results of his investigation which he promised.\nMoseley was admitted as a pensioner at St John's College, Cambridge on\n21\nAugust\n1821\n. Being a pensioner means that he did not have a scholarship and paid for his tuition. He matriculated in the Michaelmas term of\n1822\nand began his study of the mathematical tripos. He attended lectures by\nGeorge Peacock\nand\nWilliam Whewell\n, the latter being a particularly important influence on Moseley since he published the textbooks\nAn Elementary Treatise on Mechanics\n(1819)\nand\nA Treatise on Dynamics\n(1823)\n. Also at St John's College at this time was\nJohn Hymers\nand John Hallowes Miller\n(1801\n-\n1880)\nwho were both studying the mathematical tripos. In the B.A. examinations of\n1826\n,\nHymers\nwas Second\nWrangler\n, Miller was Fifth Wrangler, and Moseley was Seventh Wrangler. One of his friends at Cambridge was James Challis\n(1803\n-\n1882)\nwho studied at Trinity College and graduated as Senior Wrangler in the mathematical tripos in\n1825\n. Challis was elected to a fellowship at Trinity College in\n1826\n, was ordained in\n1830\nand became director of the Cambridge Observatory and Plumian Professor in\n1836\n.\nFollowing his degree from Cambridge, Moseley entered the Church of England. He was ordained a deacon in Bath and Wells on\n23\nDecember\n1827\nand a priest on\n19\nApril\n1828\n; he then became a curate at West Monkton, near Taunton, in Somerset. He certainly had not left mathematics and natural philosophy behind, however, for during his time as a curate he was writing the textbook\nA treatise on hydrostatics and hydrodynamics for the use of students in the University\nwhich was published in\n1830\n. His friendship with James Challis was clearly important to Moseley for he wrote in the Preface\n[\n6\n]\n:-\n... the Author has to acknowledge his important obligations to his friend Mr Challis, of Trinity College. He is indebted to that Gentleman for the Chapter\n(\nVII\n)\non the general Equations of the Motion of Fluids, and the Appendix\n(\nA\n)\non the Oscillations of a cylindrical Column of Air. In the former of these papers, Mr Challis has completely solved the general equation expressing the continuity of a moving fluid.\nYou can read the whole Preface to this book and see information about other books by Moseley at\nTHIS LINK\n.\nMoseley was appointed Professor of Natural and Experimental Philosophy and Astronomy at King's College, London, on the\n20\nJanuary\n1831\n. Now King's College, London had been founded in\n1829\nand required governors and professors to be members of the Church of England but the College was open to \"nonconformists of all sorts to enter the college freely.\" This would seem to fit Moseley particularly well, being ordained in the Church of England but having a father, William Moseley, as a well-known nonconformist. In fact, in addition to his professorship at King's College, London, he was chaplain there during\n1831\n-\n33\n. As the first Professor of Natural and Experimental Philosophy and Astronomy at King's College, London, he was responsible for building the College's Department of Engineering and Applied Science.\nFew people publish a book giving the syllabus of the first university course they will teach before they actually teach it, but this is precisely what Moseley did, publishing\nSyllabus of a Course of Experimental Lectures on The Theory of Equilibrium\nin\n1831\n. The syllabus is for a course\n[\n5\n]\n:-\n... to be delivered at The King's College, London, in the October Term of the year\n1831\nby Rev H Moseley, Professor of Natural and Experimental Philosophy. These Lectures require no introductory course of mathematical reading; the method of demonstration being exclusively experimental.\nOn\n23\nApril\n1835\n, Moseley married Harriet Nottidge, the daughter of William and Mary Nottidge of Wandsworth Common, Surrey. William Nottidge\n(1767\n-\n1853)\nhad married Louisa Browning in\n1792\nbut, following her death in\n1797\n, he married Mary Varnham, daughter of John Varnham, in\n1799\n. Harriet, their second daughter, was born on\n1\nOctober\n1801\nand baptised on\n17\nNovember\n1801\nat Saint Mary Magdalene, Bermondsey, London. Henry and Harriet Moseley had daughters Harriet Mary Moseley, born\n19\nDecember\n1836\n, and Emily Moseley, born in July\n1839\n, and a son Henry Nottidge Moseley, born\n14\nNovember\n1844\n. Henry Nottidge Moseley became a leading naturalist and he sailed on the global scientific expedition of the HMS Challenger in\n1872\nto\n1876\n. At the time of the\n1841\nUK census, the family were living in St Ann's Lane, Wandsworth.\nDuring the years\n1831\nto\n1844\nMoseley was Professor of Natural and Experimental Philosophy at King's College, London, and during this time wrote important papers and books\n[\n1\n]\n:-\nMoseley embarked upon a rigorous investigation of the statics of masonry arches and published his findings in\n1833\n, 'On the theory of resistance in statics', and 'On a new principle in statics, called the principle of least pressures' ...\nThe first of these papers begins:-\nIn a paper inserted in the 'Philosophical Magazine' for October, I have given a demonstration of the following theorem: \"If there be a system of forces in equilibrium among which there enter the resistances of any number of fixed points, then are these resistances such that their sum is a\nminimum\n; each being considered a function of the coordinates of its point of application, taken with a positive sign, and subjected to the conditions imposed by the equilibrium of the whole.: I have also pointed out the steps by which this principle may be applied to the actual determination of the amount and direction of the resistance upon each point of the system in terms of the other forces which compose it. It is my object at present to give the actual solution of that particular but very important case, of the more general proposition, in which the forces and resistances of the system are all parallel to one another. The solution of this case is entirely free from that elaboration of analysis which besets the more general proposition.\nIn addition to the two books mentioned above, he published several others. In\n1834\nhe published\nA Treatise on Mechanics applied to The Arts; including Statics and Hydrostatics.\nHe writes in the Preface\n[\n7\n]\n:-\nThe following work contains treatises on the sciences of Statics and Hydrostatics, comprising the whole theory of\nEquilibrium\n. It was intended as the first volume of a course of Natural Philosophy, for the use of those who have no knowledge of Mathematics, or who have made but little progress in their mathematical reading.\nIn\n1838\nhe published\nLectures on Astronomy delivered at King's College, London.\nHe writes in the Preface\n[\n8\n]\n:-\nThis work originally formed part of a course of Lectures delivered to the Class of Natural Philosophy and Astronomy, at King's College. They were subsequently printed in the 'Magazine of Popular Science', and have since been revised by the Author, and adapted for publication in a separate volume, in the belief that it may serve the purposes of Popular Instruction.\nHe published\nIllustrations of Mechanics\nin\n1839\n, writing in the Preface\n[\n9\n]\n:-\nThis work is the first of a series, entitled 'Illustrations of Science', by Professors of King's College, London, to be published at intervals of three months, and continued until the circle of the Physical Sciences, and the Sciences of Observation, is embraced in it. The author has proposed to himself the development of that system of experimental facts and theoretical principles on which the whole superstructure of mechanical art may be considered to rest, and its introduction, under an available form, to the great business of practical education.\nHis most famous book, however, was\nThe Mechanical Principles of Engineering and Architecture\npublished in\n1843\n. T M Charlton writes\n[\n1\n]\n:-\nThere seems little doubt that Moseley's major contribution to bridge construction related to the development of the wrought iron girder bridge. The appearance of his excellent book could hardly have been more timely: it was only a few years later that Robert Stephenson, I K Brunel and others with the cooperation of William Fairbairn, were to embark upon some spectacular railway bridge projects taking advantage of the merits of the then novel rolled iron plate and bars. The tubular or hollow iron girder, forerunner of the currently fashionable box girder, was one result.\nFor more information about all these books, see\nTHIS LINK\n.\nMoseley was elected a fellow of the\nRoyal Society of London\nin February\n1839\n. A couple of years earlier, in October\n1836\n, his father William Moseley had been tried at Middlesex sessions charged with\n[\n15\n]\n:-\nKeeping an unlicensed house in Charlotte Street, Bloomsbury\n[\nMiddlesex\n]\nfor the reception of lunatics.\nHis initial sentence was twelve months imprisonment in Middlesex House of Correction and a fine of £\n50\n. William Moseley petitioned with the following grounds for clemency\n[\n15\n]\n:-\nActed out of ignorance when housed two lunatics in his house; then applied for licence but convicted before had time to comply with conditions of licence; has wife and seven children dependent on him; sale of house will cover his debts; willing to enter into recognisance; elderly age; committed on false information that house was intended for dangerous lunatics not harmless ones; all magistrates involved recommend reducing sentence further from\n6\nto\n3\nmonths.\nIn January\n1844\nMoseley resigned his professorship at St John's College. London, and was appointed as one of the first of Her Majesty's Inspectors of Schools. One of his first reports was on Chester College. He observed the construction of the College chapel:-\nWhen I visited the College in November, I found\n[\nthe students\n]\nbusily employed in quarrying the stone of which an abundant supply is found on the premises, they had made some progress with the oak carvings, and the stonework of a very beautiful window was nearly completed. Nothing could be more lively or interesting than the scene presented by the grounds and workshops during the intervals of study. In one place the foundations of the structure were being dug out; in another the stone was quarried. In the workshops I found carpenters, turners, carvers in oak and blacksmiths, plying their several trades; and, in a shed, a group of stone-cutters carving with great success the arch mouldings, mullions, and lights of a decorated window.\nHe published a number of reports as an Inspector of Schools, for example\nReport on the Battersea Training School and the Battersea Village School for Boys\n(1846)\n,\nAn Account of the King's Somborne School: Extracted with Permission from the Minutes of the Committee of Council of Education\n1847\n-\n1848\n(1849)\n, and\nSpecial report on grants to aid in the purchase of apparatus for instruction in science\n(1853)\n.\nMoseley also addressed the Metropolitan Association of Church Schoolmasters on\n20\nMay\n1854\n, delivering the address\nFaith in the Work of the Teacher\n. You can read a version of his address at\nTHIS LINK\n.\nHe continued his work as a school inspector until\n1853\nand while undertaking these duties, he continued his mathematical research publishing works such as\nOn a machine for calculating the products, quotients, logarithms, and powers of numbers\n(1847)\n,\nOn the dynamical stability and on the oscillations of floating bodies\n(1850)\n,\nOn dynamical stability, and on the oscillations of floating bodies\n(1851)\n, and\nOn the rolling motion of a cylinder\n(1851)\n.\nIn\n1851\nthe Exhibition of The Works of Industry of all Nations, known as the 'Great Exhibition', was held in the Crystal Palace in Hyde Park in London. In\n1850\nthe Royal Commission for the Great Exhibition of\n1851\nhad been set up to administer the Exhibition. The Royal Commission, with Prince Albert as its President, set up an extensive jury system to judge all the exhibits displayed in the Crystal Palace. From\n17000\nexhibitors, the jurors selected the Prize Medal winners and those who should receive an Honourable Mention, and also recommended exhibitors for the prestigious Council Medal. Moseley was asked to be one of the jurors and he was pleased to accept. He was then appointed as Chairman of Class V: Machines for direct use, including Carriages and Railway and Naval Mechanism. This class was divided into seven Sections:\nSection A: Steam Engines and Boilers.\nSection B: Separate Parts of Machines, Specimens of Workmanship.\nSection C: Pneumatic Machines.\nSection D: Hydraulic Machines, Cranes, Pile Drivers etc.\nSection E: Railway.\nSection F: Railway Machinery and Permanent Ways.\nSection G: Weighing, Measuring and Registering Machines for Commercial and not for Philosophical Purposes.\nMoseley's Report, detailing the medals awarded by his jurors, was published in\n[\n11\n]\n. As Chairman of one of the juries, he came to the attention of Prince Albert who then sought to further his career\n[\n2\n]\n:-\n... in\n1853\nhe was presented to a residential canonry in Bristol Cathedral; in\n1854\nhe became vicar of Olveston, Gloucestershire, and he was appointed chaplain in ordinary to Queen Victoria in\n1855\n.\nWe have already mentioned Moseley's election to the\nRoyal Society\nin\n1839\n. He was also honoured by election as a Corresponding member in the Mechanics Section of the\nAcadémie de Sciences\non\n6\nMarch\n1848\n. Oxford University awarded him an honorary D.C.L.\n(\nDoctor of Civil Law\n)\nin\n1870\n.\nAt the time of the\n1861\nUK Census, Moseley was living at the Parsonage, Fernhill Road, Olveston, Gloucestershire with his wife, daughter Emily Moseley, son Henry Nottidge Moseley, and five servants: a cook, parlour maid, house maid, lady's maid, and kitchen maid. He gives his occupation as Canon of Bristol Cathedral and Vicar of Olveston. At the time of the\n1871\nUK Census, he was living alone at Canon's House, Deanery Road, Bristol, except for his four servants: a butler, cook and two housemaids. He gives his occupation as Canon of Bristol Cathedral.\nDuring his time as Canon of Bristol Cathedral, Moseley continued to undertake research and publish articles. Rather remarkably, he published six papers in the last two years of his life. Papers he published after\n1854\ninclude:\nOn the rolling motion of a cylinder\n(1854)\n,\nOn the descent of glaciers\n(1856)\n, On certain elementary formulae, &c.\n(1857)\n,\nOn the motion of a plate of metal on an inclined plane, when dilated and contracted; and on the descent of glaciers\n(1862)\n,\nOn the descent of a solid body on an inclined plane when subjected to alternations of temperature\n(1869)\n,\nOn the mechanical possibility of the descent of glaciers, by their weight only\n(1869)\n,\nOn the uniform motion of an imperfect fluid\n(1869)\n,\nOn the \"Veined Structure\" of the ice of glaciers\n(1870)\n,\nOn the mechanical properties of ice\n(1870)\n,\nOn the uniform flow of a liquid\n(1871)\n, and\nOn the steady flow of a liquid\n(1871)\n.\nMoseley died in Olveston, Gloucestershire and his wife went to live at Cecil Lodge, Stoke Bishop. She died there four years after her husband on\n9\nMarch\n1876\n.\nLet us note that Moseley's son Henry Nottidge Moseley\n(1844\n-\n1891)\nmarried  Amabel Gwyn Jeffreys\n(1852\n-\n1928)\nin\n1881\nand their son, Henry Gwyn Jeffreys Moseley\n(1887\n-\n1915)\n, one of five children, became a well-known physicist who developed the important law of X-ray spectra which provided a major step forward in atomic theory and provided experimental evidence supporting\nNiels Bohr\n's theory.",
  "math_areas": [
    "Analysis"
  ]
}