{
  "nome_completo": "Henry George Forder",
  "nome_curto": "Henry Forder",
  "ano_nascimento": "1889",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Forder/",
  "lugar_nascimento": "Shotesham All Saints, near Norwich, England",
  "lugar_morte": "Selwyn Village, Port Chevalier, Auckland, New Zealand",
  "biografia": "Henry Forder\n's parents were Mary Ann Chilvers and Henry Forder, a joiner, blacksmith, farrier and wheelwright. Henry was the eldest of his parent's six children, having three brothers and two sisters. Henry Forder Sr. bought the village blacksmith's business in Worstead, Norfolk, and the family moved there when Henry was young. One might have expected that a tradesman's family would have little appreciation for learning, but this was certainly not the case. In fact Henry Forder Sr. loved books and his son Henry, the subject of this biography, read avidly as a child, continuing this throughout his life. Henry was fortunate in several ways which enabled him to obtain a first class education. Firstly the headmaster of the local Worstead church school which he attended realised that Henry was an exceptionally gifted boy and gave him special tuition. Secondly, county scholarships were introduced in\n1902\nto allow gifted children to obtain a better education. Encouraged by the headmaster and by his family, Henry won a scholarship which enabled him to attend Paston Grammar School, about\n5\nkm from his home\n[\n4\n]\n:-\nAt Paston he was exposed to the rich world of classical scholarship and to the contrasting world of modern philosophical and scientific speculation. While his facility with languages was nurtured at this school, his mathematical development flourished to some extent independently of the school. Although he was greatly influenced by some gifted mathematics teachers, his own ability was of such an order that he was able to work most successfully unaided.\nWe know a lot about Paston Grammar School since the Venerable Archdeacon Charles R Forder, who was Henry's youngest brother, wrote a history of the school. Henry, together with another pupil, founded the school debating society in\n1907\nand Henry took part in debates on topics such as conscription, female suffrage, the House of Lords and the justifiability of Mary Queen of Scots' execution. He won a scholarship from Norfolk County Council to study at the University of Cambridge and this was augmented with further support from the Governors of Paston School and by Sidney Sussex College. He also won many prizes from the school and he chose himself the books\nLay Sermons\nby Thomas Henry Huxley,\nThe Essays of Elia\nby Charles Lamb,\nPoems\nby Henry Wadsworth Longfellow,\nPoems\nby John Milton,\nVanity Fair\nby William Makepeace Thackeray, and\nOliver Cromwell\nby John Morley.\nForder matriculated at Sidney Sussex College on\n2\nOctober\n1907\n. He was ranked first class in Part I of the Mathematical Tripos of\n1908\n(\nand was awarded a further scholarship for his performance\n)\nand, two years later, was a\nWrangler\n(\nFirst Class\n)\nin Part II. He would have liked to remain at Cambridge to continue to a research career, but lack of finance forced him to give up this idea. He then chose the profession that he wanted to follow and became a mathematics master. He taught at Hulme grammar school in Oldham, Lancashire, from\n1910\nto July\n1913\n, then at Cardiff High School, next at St Olave's School in London, and finally at\nHymers\n' College in Hull, Yorkshire. His brother Charles\n(\nwho we mentioned above\n)\nwrote\n[\n9\n]\n:-\nWhen I was vicar in Hull,\n1947\n-\n57\n, I met many of his former pupils from\nHymers\n' College, and all remembered him with affection.\nIn\n1921\n, while Forder was teaching at\nHymers\n' College, he married his cousin Dorothy Whincup of Bingham, Nottinghamshire; they had no children. By\n1933\nForder had become somewhat dissatisfied with teaching so when he was invited to apply for the Chair of Mathematics at Auckland University College in New Zealand he put in an application. One of the referee's for his application,\nArthur Milne\n, wrote in his report:-\nForder is extremely widely read in mathematical logic and philosophy, pure mathematics, relativity, quantum mechanics and astrophysics, and on these subjects I have heard him speak with knowledge, and authority, and with marked originality.\nHe was not, of course, the only applicant; his main rival was Keith Bullen.\nG H Hardy\nwas asked to give an opinion on all the applicants and wrote of Forder that he\n[\n8\n]\n:-\n... is plainly, in his way, a rather remarkable man, since he combines so much experience of comparatively elementary teaching with a real understanding of and enthusiasm for the logic of his subject .... I bought his book\n[\nFoundations of Euclidean Geometry\n(1927)]\n... and read quite a lot of it, and was genuinely interested by it.\nForder spent the rest of his career in the Chair of Mathematics at Auckland. In fact he only once left New Zealand after settling there, this being in\n1947\nwhen he spent part of his leave in England. He spent\n21\nyears building up the Mathematics Department at Auckland from a Department of a professor with one assistant when he arrived to one of six staff by the time he retired in\n1955\n. Nield writes\n[\n8\n]\n:-\nThe mathematical syllabus which Forder found when he arrived at Auckland shocked him. After one term he was invited to report to Council. He wrote that he would attempt to raise the standard at Auckland to the standard of the scholarship examinations taken in schools in England. He reported that it was at present possible for a student to get First Class Honours and be completely unaware of the existence of the whole of modern mathematics, and by modern mathematics he meant not the mathematics of this century but the last! Such was the inertia of the University of New Zealand system, coupled with the political need to cater for large numbers of part-time and exempt students, that it took him until\n1936\nto get the theory of complex variables into the course, and until\n1938\nto get calculus into the syllabus for Pure Mathematics I.\nIt is the books that Forder wrote which have given him a high reputation in the mathematical world. These are:\nThe Foundations of Euclidean Geometry\n(1927)\n,\nA School Geometry\n(1930)\n,\nHigher Course Geometry\n(1931)\n,\nThe Calculus of Extension\n(1941)\n,\nGeometry\n(1950)\n, and\nCoordinates in Geometry\n(1953)\n. In the Preface to the first of these, Forder writes:-\nAlthough the Euclidean geometry is the oldest of the sciences and has been studied critically for over two thousand years, it seems there is no textbook which gives a connected and rigorous account of that doctrine in the light of modern investigations. It is hoped that this book will fill the gap.\nF W Owens\n[\n11\n]\nfeels that he succeeds:-\nThere may be a difference of opinion on the question of the completeness of the gap filling, but Mr Forder has written an interesting book and one which should be welcomed by those interested in seeing the rigour of modern analysis achieved in geometrical studies.\nDover Publications\nproduced an unabridged and unaltered republication of the\n1927\nbook in\n1958\n.\nThe Calculus of Extension\n(1941)\nis in many ways the most interesting of all Forder's books. He explains in the Preface how he came to write the book:-\nThis book had its origin when Professor\nNeville\nin\n1929\npassed on to me some papers left to the\nMathematical Association\nby Professor Genese. These contained lecture notes and examples on\nGrassmann\n's methods. Though the notes themselves have been used but little, a large number of examples from this source have been incorporated in the earlier chapters. As I had been interested in this field for years, I thought it might be worthwhile to extend the work beyond the strictly elementary field covered in Genese's notes, and give a coherent account of\nGrassmann\n's methods, with a number of applications sufficient to justify their use. The emphasis on identities is my own, and my aim has been to express geometric theorems as identities, involving not coordinates but the geometric entities themselves which appear in the theorems. ... The algebra of vectors created by\nGrassmann\nand\nHamilton\nhas at last won an established place in physics.\nGrassmann\n's methods are of equal use in geometry, but this application is less widely appreciated. It is hoped that this book will redress the balance.\nThe book was reviewed by\nEduard Helly\nwho writes:-\nThe book is the first modern textbook of\nGrassmann\n's calculus of extension. It gives a very lucid account of\nGrassmann\n's original methods and of the investigations of other mathematicians who continued his work.\nH V Craig\n[\n5\n]\nwrites:-\nForder's 'The calculus of extension' not only presents a wealth of specific applications of the subject to geometry, that are either new or not readily obtainable elsewhere; but in addition furnishes an admirable and fresh exposition of the 'Ausdehnungslehre'. It is very carefully written and the individual proofs are uniformly short and easy to follow. The theorem density is exceptionally high and consequently despite the superior exposition it is not an easy book to work straight through - perhaps the key chapters suffer from lack of recapitulation. Books that contain a wealth of material are never easy to read through, and it is my conviction that The calculus of extension provides the best exposition of the fundamental processes of the 'Ausdehnungslehre' and the most inclusive treatment of the geometrical applications available at present. It is a book that should be in the library of anyone who is interested in either algebra, the algebraic treatment of geometry, or vector and tensor analysis.\nGeometry\n(1950)\nwas reviewed by\nDonald Coxeter\nwho was clearly fascinated by Forder's use of language:-\nThe two-cusped epicycloid is described as the bright curve seen \"when the sun shines on a cup of tea.\" ... The chapter on logical structure stresses the abstract nature of the order relation\n(\nABC\n)\nby comparing it with the human relation \"A prefers C to B.\" The possibility of coordinatising any descriptive geometry of three or more dimensions is epitomized in the statement that \"we can create magnitudes from a mere muchness,\" and\nArchimedes\n' axiom in the statement that \"you will always reach home, if you walk long enough.\"\nCoordinates in Geometry\n(1953)\nwas reviewed by\nMarshall Hall, Jr\nwho writes:-\nThere are three chapters in this monograph. In the first there is an elegant presentation of the consequences of the minor theorem of\nDesargues\nand its equivalence to coordinates from an alternative division ring. This leads naturally to the full theorem of\nDesargues\nand associative coordinates. The second chapter, without axioms of order deals with congruence of angles\n(\ncrosses\n)\nand line segments\n(\npoint pairs\n)\nin a Pappian geometry. The third chapter uses properties of convex functions to develop the trigonometry of the hyperbolic plane.\nOf course Forder's love of language was closely related to his love of books which we have mentioned already. He showed this love in many ways, not least in building a fine mathematics library in large part with funds he supplied himself. His love of books extended to books of a wide range of subjects\n[\n8\n]\n:-\nOf course Forder continued to read lots of books, particularly on history. He made a point of telling Rutherford, the Professor of History, that he read history when he was too tired to read mathematics, and he took a delight in correcting colleagues who, in the course of conversation in the Senior Common Room, made slips of historical fact. Indeed, Forder was renowned as a wit and conversationist. In his entry in Who's Who in New Zealand he listed his interests as \"walking and talking\", and the latter predominated.\nButcher\n[\n4\n]\nasks if Forder was a good teacher:-\nStudents who wanted nothing more than a set of notes to swot up for exams would have said not. Students who were themselves mathematicians and scientists in the making would have said that he was. For these people, he was more than a good teacher, he was a brilliant teacher. While a good set of notes can be copied from a textbook, an insight into what mathematics is certainly cannot, and that is exactly what he gave to those who were prepared to receive this insight. He loved mathematics with a burning intensity and most of all he loved geometry. You had to share this with him or, intellectually speaking, you had to part company with him.\nD A Nield writes about the lectures by Forder which he attended in the final three years that Forder taught at Auckland University:-\nI remember him as one of medium height and build, slightly stooped, with a roundish face of florid complexion surmounted by short white hair, wearing glasses with round lenses and thin metal frames which, from time to time, he used to raise in order to peer at his lecture notes. These were usually written in an extremely concise format in small notebooks from which the staples had been removed.\nFinally let us record some of the honours which Forder received. He was elected a fellow of the\nRoyal Society of New Zealand\n(1947)\n, the University of Auckland awarded him an honorary D.Sc. in\n1959\nand the book\n[\n1\n]\ncommemorates his eightieth birthday. The\nMathematical Chronicle\npublished a H G Forder\n90\nth\nbirthday volume in\n1980\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}