{
  "nome_completo": "Henri Léon Lebesgue",
  "nome_curto": "Henri Lebesgue",
  "ano_nascimento": "1875",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lebesgue/",
  "lugar_nascimento": "Beauvais, Oise, Picardie, France",
  "lugar_morte": "Paris, France",
  "biografia": "Henri Lebesgue\n's father was a printer. Henri began his studies at the Collège de Beauvais, then he went to Paris where he studied first at the Lycée Saint Louis and then at the Lycée Louis-le-Grand.\nLebesgue entered the École Normale Supérieure in Paris in\n1894\nand was awarded his teaching diploma in mathematics in\n1897\n. For the next two years he studied in its library where he read\nBaire\n's papers on discontinuous functions and realised that much more could be achieved in this area. Later there would be considerable rivalry between\nBaire\nand Lebesgue which we refer to below. He was appointed professor at the Lycée Centrale at Nancy where he taught from\n1899\nto\n1902\n. Building on the work of others, including that of\nÉmile Borel\nand\nCamille Jordan\n, Lebesgue formulated the theory of measure in\n1901\nand in his famous paper\nSur une généralisation de l'intégrale définie\nⓉ\n(\nOn a generalization of the definite integral\n)\n, which appeared in the\nComptes Rendus\non\n29\nApril\n1901\n, he gave the definition of the Lebesgue integral that generalises the notion of the\nRiemann\nintegral by extending the concept of the area below a curve to include many discontinuous functions. This generalisation of the\nRiemann\nintegral revolutionised the integral calculus. Up to the end of the\n19\nth\ncentury, mathematical analysis was limited to continuous functions, based largely on the\nRiemann\nmethod of integration.\nHis contribution is one of the achievements of modern analysis which greatly expands the scope of\nFourier analysis\n. This outstanding piece of work appears in Lebesgue's doctoral dissertation,\nIntégrale, longueur, aire\nⓉ\n(\nIntegral, length, area\n)\n, presented to the Faculty of Science in Paris in\n1902\n, and the\n130\npage work was published in Milan in the\nAnnali di Matematica\nin the same year. Having graduated with his doctorate, Lebesgue obtained his first university appointment when in\n1902\nhe became mâitre de conférences in mathematics at the Faculty of Science in Rennes. This was in keeping with the standard French tradition of a young academic first having appointments in the provinces, then later gaining recognition in being appointed to a more junior post in Paris. On\n3\nDecember\n1903\nhe married Louise-Marguerite Vallet and they had two children. However the marriage only lasted until\n1916\nwhen they were divorced.\nOne honour which Lebesgue received at an early stage in his career was an invitation to give the Cours Peccot at the Collège de France. He did so in\n1903\nand then received an invitation to present the Cours Peccot two years later in\n1905\n. Lebesgue first fell out with\nBaire\nin\n1904\n, when\nBaire\ngave the Cours Peccot at the Collège de France, over who had the most right to teach such a course. Their rivalry turned into a more serious argument later in their lives. Lebesgue wrote two monographs\nLeçons sur l'intégration et la recherche des fonctions primitives\nⓉ\n(\nLectures on integration and research on primitive functions\n)\n(1904)\nand\nLeçons sur les séries trigonométriques\nⓉ\n(\nLectures on trigonometric series\n)\n(1906)\nwhich arose from these two lecture courses and served to make his important ideas more widely known. However, his work received a hostile reception from classical analysts, especially in France. In\n1906\nhe was appointed to the Faculty of Science in Poitiers and in the following year he was named professor of mechanics there.\nLet us attempt to indicate the way that the Lebesgue integral enabled many of the problems associated with integration to be solved.\nFourier\nhad assumed that for bounded functions term by term integration of an infinite series representing the function was possible. From this he was able to prove that if a function was representable by a trigonometric series then this series is necessarily its\nFourier\nseries. There is a problem here, namely that a function which is not\nRiemann\nintegrable may be represented as a uniformly bounded series of\nRiemann\nintegrable functions. This shows that\nFourier\n's assumption for bounded functions does not hold.\nIn\n1905\nLebesgue gave a deep discussion of the various conditions\nLipschitz\nand\nJordan\nhad used in order to ensure that a function\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nis the sum of its\nFourier\nseries. What Lebesgue was able to show was that term by term integration of a uniformly bounded series of Lebesgue integrable functions was always valid. This now meant that\nFourier\n's proof that if a function was representable by a trigonometric series then this series is necessarily its\nFourier\nseries became valid, since it could now be founded on a correct result regarding term by term integration of series. As Hawkins writes in\n[\n1\n]\n:-\nIn Lebesgue's work ... the generalised definition of the integral was simply the starting point of his contributions to integration theory. What made the new definition important was that Lebesgue was able to recognise in it an analytic tool capable of dealing with - and to a large extent overcoming - the numerous theoretical difficulties that had arisen in connection with\nRiemann\n's theory of integration. In fact, the problems posed by these difficulties motivated all of Lebesgue's major results.\nHe was appointed mâitre de conférences in mathematical analysis at the Sorbonne in\n1910\n. During the first world war he worked for the defence of France, and at this time he fell out with\nBorel\nwho was doing a similar task. Lebesgue held his post at the Sorbonne until\n1918\nwhen he was promoted to Professor of the Application of Geometry to Analysis. In\n1921\nhe was named as Professor of Mathematics at the Collège de France, a position he held until his death in\n1941\n. He also taught at the École Supérieure de Physique et de Chimie Industrielles de la Ville de Paris between\n1927\nand\n1937\nand at the École Normale Supérieure in Sèvres.\nIt is interesting that Lebesgue did not concentrate throughout his career on the field which he had himself started. This was because his work was a striking generalisation, yet Lebesgue himself was fearful of generalisations. He wrote:-\nReduced to general theories, mathematics would be a beautiful form without content. It would quickly die.\nAlthough future developments showed his fears to be groundless, they do allow us to understand the course his own work followed.\nHe also made major contributions in other areas of mathematics, including\ntopology\n,\npotential theory\n, the\nDirichlet\nproblem, the\ncalculus of variations\n, set theory, the theory of surface area and dimension theory. By\n1922\nwhen he published\nNotice sur les travaux scientifique de M Henri Lebesgue\nhe had written nearly\n90\nbooks and papers. This ninety-two page work also provides an analysis of the contents of Lebesgue's papers. After\n1922\nhe remained active, but his contributions were directed towards pedagogical issues, historical work, and elementary geometry.\nLebesgue was honoured with election to many academies. He was elected to the\nAcademy of Sciences\non\n29\nMay\n1922\n, to the\nRoyal Society\n, the\nRoyal Academy of Science and Letters of Belgium\n(6\nJune\n1931)\n, the Academy of Bologna, the\nAccademia dei Lincei\n, the\nRoyal Danish Academy of Sciences\n, the\nRomanian Academy of Sciences\n, and the Kraków Academy of Science and Letters. He was also awarded honorary doctorates from many universities. He also received a number of prizes including the Prix Houllevigue\n(1912)\n, the Prix\nPoncelet\n(1914)\n, the Prix Saintour\n(1917)\nand the Prix Petit d'Ormoy\n(1919)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}