{
  "nome_completo": "Henry More",
  "nome_curto": "Henry More",
  "ano_nascimento": "1614",
  "ano_morte": "1687",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/More_Henry/",
  "lugar_nascimento": "Grantham, Lincolnshire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Henry More\n's father was Alexander More who had been mayor of Grantham on several occasions. Alexander More was financially well off and able to give his son a top class education. Little is known of his childhood except for a few comments More makes himself in the Preface of his Collected Works. There he writes that he was brought up\n(\nsee\n[\n7\n]\nor\n[\n2\n]\n)\n:-\n... parents ... who were great Calvinists\n(\nbut withall very pious and good ones\n)\n.\nHe was brought up to be always thinking of religion:-\n... even in my earliest childhood, an inward sense of the Divine Presence was so strong upon my mind, that I did then believe, there could be no deed, word, or thought hidden from Him.\nAfter attending Grantham Free School\n(\nthe Grammar School\n)\n, More was sent to Eton when he was fourteen years old. Here he came to change his religious views, rejecting Calvinism which had the notion of predestination as a metaphysical necessity and the basis of faith. More came to the belief, which he held strongly throughout his life, that salvation was possible though goodness. During this time his father had put his upbringing in the hands of an uncle who tried to prevent the young More from being so forward by flogging him to try to make him return to the Calvinist ideas about free-will. Flogging certainly did nothing to return More to Calvinism, perhaps it had just the opposite effect.\nIn\n1631\nMore entered Christ's College Cambridge. He wrote of his experiences as an undergraduate\n(\nsee\n[\n7\n]\nor\n[\n2\n]\n)\n:-\n[\nI plunged\n]\nover head and ears in the study of philosophy; promising a most wonderful happiness to myself in it.\nAristotle\n, therefore,\nCardan\n, Julius Scaliger and other philosophers of the greatest note I very diligently pursued. In which the truth is, that I met here and there with some things wittily and acutely and sometimes also solidly spoken: yet the most seemed to me either false or uncertain, or else so obvious and trivial, that I look upon myself as having plainly lost my time in reading such authors. And to speak all in a word, those almost whole four years which I spent on studies of this kind ... ended in nothing, in a manner, but mere scepticism.\nMore graduated with a B.A. in\n1636\nand remained at Cambridge to continue his studies being elected a Fellow of Christ's College in\n1639\n. He turned his philosophical studies towards Plato, the Platonists and the Neoplatonists becoming a member of the Cambridge Platonists.\nPerhaps we should move towards the reason why More is included in an archive of mathematicians. He was a man of broad learning, and the ideas of experimental natural philosophy were to the fore due to those who would form the\nRoyal Society\n. These ideas of experimental philosophy attracted More and he also became influenced by the writings of Descartes which\n[\n1\n]\n:-\n... seemed to show how to combine a scientific interest in nature with a primary concern for vindicating the reality of God and immortal human souls.\nHowever, as he studied the mechanical philosophy of\nDescartes\nhe became unhappy with it. More argued that\nDescartes\n' ideas must inevitably remove God from nature and so lead to atheism. During\n1648\nand\n1649\nMore and\nDescartes\ncorresponded about the mechanical philosophy and this correspondence was eventually published as\nThe Immortality of the Soule\n(1659)\n.\nMore argued that the motion of a body was an inherent property of that body, and that it was impossible for motion to be transferred from one body to another. This, of course, seems to contradict common sense for if a rolling ball strikes a ball which is at rest then the ball starts to move. More does not deny this fact which any simple experiment will verify, but he claimed that the motion of the second ball is from an internal property of its own, awakened by the impact of the first ball.\n... I am the more inclined to this opinion, that there is absolutely no transfer of motions; but that a second body is as it were awakened into motion by the impact of the first body, as this or that event awakens the soul to reflection. And that the second body does not so much receive motion from the first, as put itself into motion at the bidding of the first.\nOf course More's ideas here are totally fallacious but when he attacks\nDescartes\n' vortex theory planetary motion the he is on stronger ground:-\nWhy are not your vortices in the form of columns or cylinders rather than ellipses, since any point of the axis of a vortex is as it were a centre from which the celestial matter recedes with, as far as I can see, a wholly constant impetus? ... Who causes all the planets not to revolve in one plane\n(\nthe plane of the ecliptic\n)\n? ... And the Moon itself, neither in the plane of the Earth's equator nor in a plane parallel to this?\nMore published\nAntidote Against Atheisme\nin\n1652\n. In this work he argues that all areas of natural philosophy require a \"Spirit of Nature\". In particular he argued against the mechanical explanations of the spring and weight of the air as\nBoyle\nput forwards by\nBoyle\nshortly before. More wrote in a letter:-\nI be not altogether satisfied that his paradoxical inferences from the experiments are true. There will be a Spirit of Nature for all of this ...\nIn all his arguments one would have to say that either More had not read the works of\nGalileo\nand\nPascal\n, or that he had failed to understand their arguments. Certainly More puts forward arguments against the spring and weight of air which had already been answered by\nPascal\n. More did not just use philosophical arguments against\nBoyle\n, however. He was a committed experimental scientist and he undertook a series of hydrostatic and pneumatic experiments to disprove\nBoyle\n's theory.\nMore may have been strongly opposed to\nBoyle\n's mechanical philosophy, but he was well disposed towards the experimental philosophy of those in the\nRoyal Society\n. He was proposed for fellowship of the\nRoyal Society\nby\nWilkins\non\n4\nJune\n1662\nand elected on\n17\nSeptember of that year. However, when the Society received its Charter from Charles II on\n10\nMay\n1663\n, More\n(\nand several others\n)\nwere omitted from the list of Fellows. On\n25\nMay\n1664\nWilkins\nagain proposed More for the fellowship and he was elected\n(\nfor a second time\n)\nat the meeting one week later.\nIn\n1670\nMore published\nEnchridion Metaphysicum\n. This work repeated More's objections to the mechanical philosophy of\nBoyle\nand several other members of the\nRoyal Society\n. Of course there were deep problems which related to space and matter, action at a distance and the vacuum which scientists were struggling with at this time and More's views provided motivation to many scientists to clarify their own ideas and improve their arguments. Space was a particularly difficult concept and More essentially identifies it with God:-\nI on the contrary when I have manifestly proved that the internal space is really distinct from matter, I conclude that it is for that reason a certain incorporeal substance or spirit, just as the Pythagoreans formerly thought. And so through that same gate through which the Cartesian philosophy seemed to intend to exclude God from the world, I on the contrary\n(\nand I am confident that success will be vouchsafed me\n)\nstrive to reintroduce Him. And this infinite and immobile extension appears to be not only real but divine.\nOne other thing about Henry More which we should discuss is his relation to\nNewton\n.\nNewton\nwas born close to Grantham and attended the Free School in Grantham. In fact he had lodgings in Grantham for seven years with a Mr Clark, the brother of a teacher at the Free School. More, who was about\n30\nyears older than\nNewton\n, often returned to his home town of Grantham and when he did so he lived with one of the two Clark brothers. Therefore when More was a major figure at Cambridge he must have got to know the young pupil\nNewton\n. We certainly know that there was contact between\nNewton\nand More up till the time More was around\n70\nyears of age.\nDid More's ideas of space influence\nNewton\n? It is impossible to say with any certainty, but we can certainly note that\nNewton\n's idea of absolute space and time was crucial to his physics and that this notion of space is closely related to that put forward by More in his arguments against\nDescartes\n. Also in terms of gravity, for\nDescartes\nit was necessary to have an interaction through matter between the bodies. For\nNewton\ngravity was a force which acted through empty space and although he does not appear to have identified space with God as More did, nevertheless the spiritual aspect of space supported\nNewton\n's gravitational theories.\nMore never sought advancement within Cambridge, refusing to stand for positions such as Master. He was a modest man who felt that he did not have the necessary talents for such roles. He wrote\n(\nsee\n[\n7\n]\nor\n[\n2\n]\n)\n:-\nI have measured myself from the height to the depth; and what I can do, and what I ought to do, and I do it.",
  "math_areas": [
    "Analysis"
  ]
}