{
  "nome_completo": "Heraclides of Pontus",
  "nome_curto": "Heraclides",
  "ano_nascimento": "387 BC",
  "ano_morte": "312 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heraclides/",
  "lugar_nascimento": "Heraclea Pontica (now Eregli, Turkey)",
  "lugar_morte": "Heraclea Pontica",
  "biografia": "Heraclides of Pontus\nhas achieved fame for a long time as the first to propose that the sun was the centre of the\nsolar system\nbut this has been shown to be due to a misinterpretation of what he wrote.\nWe do have some details of Heraclides' life. His father was named Euthyphron, a wealthy man of high status from Heraclea Pontica, who was descended from one of the original founders of this Greek city on the south coast of the Black Sea. Heraclides attended the\nAcademy\nin Athens and was left in charge of it during\nPlato\n's third visit to Sicily in\n360\nBC.\nAlthough in some sense he was a pupil of\nPlato\n, he also studied with\nAristotle\nand with\nSpeusippus\nwho was\nPlato\n's successor as head of the\nAcademy\n. When Speusippus died in\n339\nBC there was an election for the new leader despite\nXenocrates\nhaving been chosen to head the\nAcademy\nby Speusippus. It was a close battle between\nXenocrates\n,\nMenedemus of Pyrrha\nand Heraclides Ponticus but\nXenocrates\ntriumphed by just a few votes.\nAt this point Heraclides left the Athens and returned to Heraclea Pontica. Stories told of his death are not really believable yet they must at least point to the type of person that Heraclides was. It is said that Heraclea Pontica suffered a famine and Heraclides bribed the messengers sent to the\nDelphic oracle\nto say that the city would be saved if Heraclides was given a gold crown and made a hero after his death. The story relates that Heraclides died while being presented with the golden crown.\nPerhaps Heraclides had the last laugh here for indeed he did become a hero after is death based on a false interpretation of his writing. For example\nHeath\n[\n2\n]\nwrites:-\nHeraclides of Pontus,\nPlato\n's famous pupil, is known on clear evidence to have discovered that Venus and Mercury revolve round the sun like satellites. He may have come to the same conclusion about the superior planets but this is not certain...\nThe misunderstanding comes from a commentary by\nCalcidius\nin the fifth century AD on\nPlato\n's\nTimaeus\n. This reads\n(\nin\nNeugebauer\n's translation in\n[\n3\n]\n)\n:-\nHeraclides Ponticus, when describing the circle of Venus as well as that of the sun, and giving the two circles one centre and one mean motion, showed how Venus is sometimes above, sometimes below the sun.\nT H Martin, in\n1849\n, pointed out the significance of the passage saying that Venus is sometimes above, sometimes below the sun clearly means that Heraclides believed that it was in orbit round the sun. Schiaparelli accepted Martin's argument and went further to claim that Heraclides must have proposed the theory that the sun revolves round the earth, but the planets revolve round the sun. This theory, first proposed by\nTycho Brahe\nat the end of the\n16\nth\ncentury, was never as far as we know put forward by a Greek astronomer.\nNeugebauer\n[\n3\n]\nshows clearly that the passage indicating that Venus is sometimes above, sometimes below the sun, means that it is sometimes ahead of the sun, sometimes behind it. Toomer in\n[\n1\n]\nagrees completely with\nNeugebauer\n's interpretation but a still more amazing interpretation of Heraclides had been proposed by\nvan der Waerden\n. Rather than basing his argument on Calcidius's words,\nvan der Waerden\ninterpreted a diagram in Calcidius to mean that the sun, Venus and the earth all revolve round a common centre.\nThe article\n[\n6\n]\nby\nvan der Waerden\nwas an attempt by him to defend his hypothesis despite the new interpretation of the situation by\nNeugebauer\n. It is an unconvincing article and it seems to only repeat\nvan der Waerden\n's earlier hypothesis without making any attempt to counter the rather simple and totally convincing argument by\nNeugebauer\n.\nHeraclides does, however, still have a claim to fame for an astronomical hypothesis. A number of sources quote his belief that the earth is at the centre of the universe but that it rotates on its axis once a day. Certainly he is the first known to have held this view and deserves great credit for it.\nWe do know a little more concerning Heraclides. He is said to have\n(\nsee\n[\n1\n]\n)\n:-\n... dressed richly, was very fat and stately, and was nicknamed \"stately and magnificent\" by the Athenians.\nThis nickname is a Greek pun based on the word Pompikos\n(\nmeaning stately and magnificent\n)\nreplacing Pontikos\n(\nmeaning from Pontus\n)\n.\nApart from his writings on astronomy, Heraclides wrote on many of the usual topics that a leading philosopher of his day would have written on. These topics included\nethics\n, literature,\nrhetoric\n, history, politics and music.",
  "math_areas": []
}