{
  "nome_completo": "Karl Johannes Herbert Seifert",
  "nome_curto": "Herbert Seifert",
  "ano_nascimento": "1907",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Seifert/",
  "lugar_nascimento": "Bernstadt, Saxony, Germany",
  "lugar_morte": "Heidelberg, Germany",
  "biografia": "Herbert Seifert\n's father was a middle ranking official at court. He moved with his family from Bernstadt, where Herbert was born, to Bautzen which is another town in Saxony. Herbert attended the local primary school for boys, in Bautzen. He then attended secondary school, the Oberrealschule, in Bautzen but there was little evidence of the brilliant mathematical career that he would achieve. that is not to say that he performed badly at school, just that he appeared simply to be a good pupil close to the top of the class.\nSeifert took his Abitur in early\n1926\nat the age of eighteen and, leaving school, he entered the Technische Hochschule in Dresden to study mathematics and physics.. it was in\n1927\nthat his whole life took a new turn when he attended a topology course by\nWilliam Threlfall\nwho was a\nPrivatdozent\nat the technical university. Not only did\nThrelfall\nturn Seifert into an enthusiastic student of\ntopology\n, but far more than that, they became firm friends and mathematical collaborators. We should note in passing the considerable age difference between the two with Seifert being twenty years younger than his friend and teacher. It was common practice for German students to spend time at a number of different universities and Seifert spent part of the session\n1928\n-\n29\nat Göttingen University.\nAt this time Göttingen was the leading mathematics centre of the whole world so it was a good choice for Seifert. More than this, however, as well as world leaders in mathematics such as\nHilbert\n, it had some of the leading topologists in the world.\nHopf\nwas a Privatdozent at Göttingen and he had just returned from an exciting year at Princeton with\nAleksandrov\n. During Seifert's time at Göttingen,\nAleksandrov\nwas again a visitor and Seifert's visit only heightened his knowledge of, and passion for, topology. He returned to Dresden for the summer term of\n1929\nand his friendship with\nThrelfall\nwas now so close that he lived in\nThrelfall\n's very fine house in Dresden. Seifert took his examinations to become a school teacher which he passed on\n17\nJuly\n1930\n. He had already written a thesis on\n3\n-dimensional closed\nmanifolds\nand having submitted this he was awarded a doctorate a month later.\nAt this stage Seifert was awarded a scholarship by the Technische Hochschule in Dresden to allow him to continue to study for a doctorate of philosophy. He chose to use the scholarship to allow him to go to Leipzig University where he was supervised by\nvan der Waerden\n. Although this was the official position, in fact Seifert returned to Dresden every weekend and he worked with\nThrelfall\n, so certainly\nThrelfall\nwas an unofficial supervisor. Seifert and\nThrelfall\nalso spent vacations together working on mathematics but of course it was to Leipzig that Seifert submitted his dissertation\nTopology of\n3\n-dimensional fibred spaces\non\n1\nFebruary\n1932\nand he was awarded his doctorate of philosophy after his oral examination on\n3\nMarch. In this paper Seifert introduced the term \"fibre space\" for the first time, although its definition was not quite the same as the one used today.\nMuch of Seifert and\nThrelfall\n's collaboration at this time was working on making a textbook out of\nThrelfall\n's lecture notes on topology. The book\nLectures on topology\nwas published in\n1934\n.\nThrelfall\nwrote a preface which reads\n(\nsee for example\n[\n1\n]\n)\n:-\nThis textbook arose from a course which one of us gave to the other at the Technische Hochschule in Dresden. But soon the student contributed new ideas to such an extent and changed the presentation so fundamentally that it would be more justifiable to omit on the title page the name of the original author than his.\nThere is little doubt that\nThrelfall\nhad honestly described Seifert's enormous contribution but Seifert was far too modest to allow such a preface. After some discussion, the two friends settled on the following compromise which appears in the preface of the published work:-\nThe first step towards writing this textbook was a course which one of us\n(\nThrelfall\n)\ntaught at the Technische Hochschule in Dresden. But only part of the course was included in the book. The main part of its contents originated later from daily discussions between the two authors.\nPuppe describes the merits of the text in\n[\n1\n]\n:-\nThe book gives an excellent account of what was known in topology at that time. It was superior in contents and in ways of presentation to other books in the field not only when it appeared but for a long time to come. it was translated into several languages, and generation of topologists in all countries of the world studied it. Even now, more than\n60\nyears later, it is worth reading because of its lucid style and because, for some special problems, it is still the best source of information ...\nFor his\nhabilitation\nSeifert submitted his paper\nContinuous vector fields\nand by the beginning of\n1934\nhe was ready to become a university teacher. Turning down an offer of a post from the University of Greifswald, he became an extraordinary professor at the Technische Hochschule in Dresden before the end of\n1934\n. This was of course a difficult time in German universities.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Although he did not realise what was happening at first, this worked in a certain way to Seifert's advantage. The two professors of mathematics, Heinrich Liebmann and Artur Rosenthal, at Heidelberg University were both Jewish and were dismissed under the Nazi laws. This, although effectively correct, is not strictly true since Liebmann chose to take ill-health retirement, knowing what was coming.\nSeifert was offered Liebmann's in November\n1935\n(\nagain according to\nThrelfall\nthis is not strictly true as he claims that Seifert was ordered to take the chair\n)\n. Certainly Seifert was no supporter of the Nazis and it was a situation with which he was very unhappy. In fact the authorities, knowing that he was not supporting the cause in the way they wanted, delayed confirming his appointment even though he was in Heidelberg carrying out the job. In August\n1936\nSeifert attended the International Mathematical Congress in Oslo. While there he contracted poliomyelitis and was taken to hospital in Oslo. While in hospital he received the formal offer of his Heidelberg chair. Strangely though, by the time he returned to Heidelberg the chair had been transferred from mathematics to another subject and Seifert spent the war years as an extraordinary professor although he was given the rights of an ordinary professor.\nFrom the time that Seifert took up his duties in Heidelberg until the start of World War II in\n1939\n, he continued his collaboration was\nThrelfall\n. they exchanged letters and, as in previous years, spent holidays together working on mathematics. they published their second joint book in\n1938\nwhich was the monograph\nVariational calculus in the large\nwhich was a text on\nMorse\ntheory. The book was accepted by\nBlaschke\nfor the Hamburg monograph series but the two authors ran into problems with a Latin epigraph which they wished to put at the beginning. It was a quote from\nKepler\nwhich reads in translation:-\nToday it is very hard to write mathematical books.\nBlaschke\n, who went along with the Nazi ideas, objected on the grounds that it looked like a political statement, and of course so it was meant to be. It is remarkable that\nThrelfall\nand Seifert risked their positions by insisting that the epigram remain. they won their case, the epigram appeared in the book when published, and\nBlaschke\nwrote a letter to Seifert expressing fury that the quote had not been deleted.\nWhen war broke out Seifert volunteered for war work with the Institut für Gasdynamik which was a research centre attached to the German Air Force. This was a clever move which meant that he avoided what would almost certainly been far worse and he was able to continue with research into mathematics throughout the war. Seifert, on leave from Heidelberg University, became Head of a department in the Institut für Gasdynamik. He was successful in getting\nThrelfall\nappointed in his department.\nSeifert, still able to do mathematical research, worked on\ndifferential equations\nand wrote a series of papers on the topic through the war years. At the end of the war the University of Heidelberg was closed down while the Allies ensured that the Nazis were removed from the staff. Seifert was one of only a very few professors accepted by the Allies and he returned to the university when it reopened in\n1946\n. He now tried to continue his collaboration with\nThrelfall\nby pressing for him to be appointed to Heidelberg. Indeed he achieved his aim and after accepting an invitation from Marston\nMorse\nto spend the winter term of\n1948\n-\n49\nat Princeton he intended to return to Heidelberg and continue his collaboration with\nThrelfall\n. Sadly\nThrelfall\ndied at age\n60\nbefore they could restart their joint work.\nNot long after he returned to Heidelberg in\n1949\n, Seifert married Katharina Korn. For three years he was the only ordinary professor of mathematics at Heidelberg but from\n1952\nthe department rapidly expanded. Seifert retired in\n1975\nand enjoyed gardening and entertaining his former colleagues and students.\nWe have already mentioned some of Seifert's work. other important work related to knot invariants. In particular, in\n1934\nhe published results, using surfaces today called Seifert surfaces, which he used to calculate homological knot invariants. Another topic which Seifert worked on was the homeomorphism problem for\n3\n-dimensional closed manifolds. In a paper on this problem which he published in\n1932\n, the results of which also appear in his\n1934\nbook with\nThrelfall\n, he writes:-\n... instead of investigating a complete system of topological invariants of\n3\n-dimensional manifolds, we search for a system of invariants for fibre preserving maps of fibred\n3\n-manifolds. This problem is completely solved in this paper.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Topology"
  ]
}