{
  "nome_completo": "Hermann Ludwig Ferdinand von Helmholtz",
  "nome_curto": "Hermann von Helmholtz",
  "ano_nascimento": "1821",
  "ano_morte": "1894",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Helmholtz/",
  "lugar_nascimento": "Potsdam, Prussia (now  Germany)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Hermann von Helmholtz\n's father was August Ferdinand Julius Helmholtz while his mother was Caroline Penn. Hermann was the eldest of his parents four children. His childhood had a strong influence on both his character and his later career. In particular the views on philosophy held by his father restricted Helmholtz's own views.\nFerdinand Helmholtz had served in the Prussian army in the fight against Napoleon. Despite having a good university education in philology and philosophy, he became a teacher at Potsdam\nGymnasium\n. It was a poorly paid job and Hermann was brought up in financially difficult circumstances. Ferdinand was an artistic man and his influence meant that Hermann grew up to have a strong love of music and painting. Caroline Helmholtz was the daughter of an artillery officer. From her Hermann inherited\n[\n1\n]\n:-\n... the placidity and reserve which marked his character in later life.\nHermann attended Potsdam Gymnasium where his father taught philology and classical literature. His interests at school were mainly in physics and he would have liked to have studied that subject at university. The financial position of the family, however, meant that he could only study at university if he received a scholarship. Such financial support was only available for particular topics and Hermann's father persuaded him that he should study medicine which was supported by the government.\nIn\n1837\nHelmholtz was awarded a government grant to enable him to study medicine at the Royal Friedrich-Wilhelm Institute of Medicine and Surgery in Berlin. He did not receive the money without strings attached, however, and he had to sign a document promising to work for ten years as a doctor in the Prussian army after graduating. In\n1838\nhe began his studies in Berlin. Although he was officially studying at the Institute of Medicine and Surgery, being in Berlin he had the opportunity of attending courses at the University. He took this chance, attending lectures in chemistry and physiology.\nGiven Helmholtz's contributions to mathematics later in his career it would be reasonable to have expected him to have taken mathematics courses at the University of Berlin at this time. However he did not, rather he studied mathematics on his own, reading works by\nLaplace\n,\nBiot\nand\nDaniel Bernoulli\n. He also read philosophy works at this time, particularly the works of Kant. His research career began in\n1841\nwhen he began work on his dissertation. He rejected the direction which physiology had been taking which had been based on vital forces which were not physical in nature. Helmholtz strongly argued for founding physiology completely on the principles of physics and chemistry.\nHelmholtz graduated from the Medical Institute in Berlin in\n1843\nand was assigned to a military regiment at Potsdam, but spent all his spare time doing research. His work still concentrated, as we remarked above, on showing that muscle force was derived from chemical and physical principles. If some vital force were present, he argued, then perpetual motion would become possible. In\n1847\nhe published his ideas in a very important paper\nÜber die Erhaltung der Kraft\nⓉ\n(\nOn the conservation of energy\n)\nwhich studied the mathematical principles behind the conservation of energy.\nHelmholtz argued in favour of the conservation of energy using both philosophical arguments and physical arguments. He based many ideas on the earlier works by\nSadi Carnot\n,\nClapeyron\n, Joule and others. That philosophical arguments came right up front in this work was typical of all of Helmholtz's contributions. He argued that physical scientists had to conduct experiments to find general laws. Then theoretical argument\n(\nquoting from the paper\n)\n:-\n... endeavours to ascertain the unknown causes of processes from their visible effects; it seeks to comprehend them according to the laws of causality. ... Theoretical natural science must, therefore, if it is not to rest content with a partial view of the nature of things, take a position in harmony with the present conception of the nature of simple forces and the consequences of this conception. Its task will be completed when the reduction of phenomena to simple forces is completed, and when it can at the same time be proved that the reduction given is the only one possible which the phenomena will permit.\nHe showed that the assumption that work could not continually be produced from nothing led to the conservation of kinetic energy. This principle he then applied to a variety of different situations. He demonstrated that in various situations where energy appears to be lost, it is in fact converted into heat energy. This happens in collisions, expanding gases, muscle contraction, and other situations. The paper looks at a broad number of applications including electrostatics, galvanic phenomena and electrodynamics.\nThe paper is an important contribution and it was quickly seen as such. In fact it played a large role in Helmholtz's career for the following year he was released from his obligation to serve as an army doctor so that he could accept the vacant chair of physiology at Königsberg. He married Olga von Velten on\n26\nAugust\n1849\nand settled down to an academic career.\nOn one hand his career progressed rapidly in Königsberg. He published important work on physiological optics and physiological acoustics. He received great acclaim for his invention of the ophthalmoscope in\n1851\nand rapidly gained a strong international reputation. In\n1852\nhe published important work on physiological optics with his theory of colour vision. However, experiments which he carried out at this time led him to reject\nNewton\n's theory of colour. The paper was rightly criticised by\nGrassmann\nand\nMaxwell\n. Helmholtz was always prepared to admit his mistakes and indeed he did just this three years later when he published new experimental results showing those of his\n1852\npaper to be incorrect.\nA visit to Britain in\n1853\nsaw him form an important friendship with\nWilliam Thomson\n. However, on the other hand, there were problems in Königsberg.\nFranz Neumann\n, the professor of physics in Königsberg was involved in disputes concerning priority with Helmholtz and the cold weather in Königsberg had a bad effect on his wife's delicate health. He requested a move and, in\n1855\n, was appointed to the vacant chair of anatomy and physiology in Bonn.\nIn\n1856\nhe published the first volume of his\nHandbook of physiological optics\n, then in\n1858\nhe published his important paper in\nCrelle's Journal\non the motion of a perfect fluid. Helmholtz's paper\nÜber Integrale der hydrodynamischen Gleichungen, welche den Wirbelbewegungen entsprechen\nⓉ\n(\nOn integrals of hydrodynamic equations, which correspond to the vortex motion\n)\nbegan by decomposing the motion of a perfect fluid into translation, rotation and deformation. Helmholtz defined vortex lines as lines coinciding with the local direction of the axis of rotation of the fluid, and vortex tubes as bundles of vortex lines through an infinitesimal element of area. Helmholtz showed that the vortex tubes had to close up and also that the particles in a vortex tube at any given instant would remain in the tube indefinitely so no matter how much the tube was distorted it would retain its shape.\nHelmholtz was aware of the\ntopological\nideas in his paper, particularly the fact that the region outside a vortex tube was multiply connected which led him to consider many-valued potential functions. He described his theoretical conclusions regarding two circular vortex rings with a common axis of symmetry in the following way:-\nIf they both have the same direction of rotation they will proceed in the same sense, and the ring in front will enlarge itself and move slower, while the second one will shrink and move faster, if the velocities of translation are not too different, the second will finally reach the first and pass through it. Then the same game will be repeated with the other ring, so the ring will pass alternately one through the other.\nThis paper, highly rigorous in its mathematical approach, did not attract much attention at the time but its impact on the future work by\nTait\nand\nThomson\nwas very marked. For details of the impact of this work, particularly Helmholtz's results on vortices, see the article\nTopology and Scottish mathematical physics\n.\nBefore the publication of this paper Helmholtz had become unhappy with his new position in Bonn. Part of the problem seemed to revolve round the fact that the chair involved anatomy and complaints were made to the Minister of Education that his lectures on this topic were incompetent. Helmholtz reacted strongly to these criticisms which, he felt, were made by traditionalists who did not understand his new mechanical approach to the subject. It was a somewhat strange position for Helmholtz to be in for he had a very strong reputation as a leading world scientist. When he was offered the chair in Heidelberg in\n1857\n, he did not accept at once however. When further sweeteners were put forward in\n1858\nto entice him to accept, such as the promise of setting up a new Physiology Institute, Helmholtz agreed.\nHelmholtz suffered some personal problems. His father died in\n1858\n, then at the end of\n1859\nhis wife, whose health had never been good, died. He was left to bring up two young children and within eighteen months he married again. On\n16\nMay\n1861\nHelmholtz married Anna von Mohl, the daughter of another professor at Heidelberg\n[\n1\n]\n:-\nAnna, by whom Helmholtz later had three children, was an attractive, sophisticated woman considerably younger than her husband. The marriage opened a period of broader social contacts for Helmholtz.\nSome of his most important work was carried out while he held this post in Heidelberg. He studied mathematical physics and acoustics producing a major study in\n1862\nwhich looked at musical theory and the perception of sound. In mathematical appendices he advocated the use of\nFourier series\n. In\n1843\nOhm\nhad stated the fundamental principle of physiological acoustics, concerned with the way in which one hears combination tones. Helmholtz explained the origin of music on the basis of his fundamental physiological hypotheses. He formulated a resonance theory of hearing which provided a physiological explanation of\nOhm\n's principle. His contributions to the theory of music are discussed fully in\n[\n8\n]\n.\nFrom around\n1866\nHelmholtz began to move away from physiology and move more towards physics. When the chair of physics in Berlin became vacant in\n1870\nhe indicated his interest in the position.\nKirchhoff\nwas the other main candidate and because he was considered a superior teacher to Helmholtz he was offered the post. However, when\nKirchhoff\ndecided not to accept Helmholtz was in a strong position. He was able to negotiate a high salary as well as having Prussia agree to build a new physics institute under Helmholtz control in Berlin. In\n1871\nhe took up this post.\nHelmholtz had begun to investigate the properties of\nnon-Euclidean\nspace around the time his interests were turning towards physics in\n1867\n. Bernardo in\n[\n9\n]\nwrites:-\nIn the second half of the\n19\nth\ncentury, scientists and philosophers were involved in a heated discussion on the principles of geometry and on the validity of so-called non-Euclidean geometry. ... Helmholtz's research on the subject began between\n1867\nand\n1868\n. Moving from the observation that our geometric faculties depend on the existence, in nature, of rigid bodies, he presumed he had given a proof that Euclidean geometry was the only one compatible with these bodies, maintaining, at the same time, the empirical, not a priori, origin of geometry. In\n1869\n, after\nBeltrami\n's letter ... he realized he had made a mistake: the empirical concept of a rigid body and mathematics alone were not enough to characterize Euclidean geometry. The following year, fully sharing the mathematical itinerary that, through\nGauss\n,\nRiemann\n,\nLobachevsky\nand\nBeltrami\n, led to the creation of the new geometry, he proposed to spread this knowledge among philosophers while at the same time criticizing the Kantian system. This marked the beginning of a heated philosophical discussion that led Helmholtz in\n1878\nto try to appease the criticisms of the Kantian a priori.\nA major topic which occupied Helmholtz after his appointment to Berlin was electrodynamics. He discussed with\nWeber\nthe compatibility of\nWeber\n's electrodynamics with the principle of the conservation of energy. In fact the argument was heated and lasted throughout the\n1870\ns. It was an argument which neither really won and the\n1880\ns saw\nMaxwell\n's theory accepted. Helmholtz attempted to give a mechanical foundation to thermodynamics, and he also tried to derive\nMaxwell\n's electromagnetic field equations from the least action principle.\nR Steven Turner writes in\n[\n1\n]\n:-\nHelmholtz devoted his life to seeking the great unifying principles underlying nature. His career began with one such principle, that of energy, and concluded with another, that of least action. No less than the idealistic generation before him, he longed to understand the ultimate, subjective sources of knowledge. That longing found expression in his determination to understand the role of the sense organs, as mediators of experience, in the synthesis of knowledge.\nTo this continuity with the past Helmholtz and his generation brought two new elements, a profound distaste for metaphysics and an undeviating reliance on mathematics and mechanism. Helmholtz owed the scope and depth characteristic of his greatest work largely to the mathematical and experimental expertise which he brought to science. ... Helmholtz was the last great scholar whose work, in the tradition of\nLeibniz\n, embraced all the sciences, as well as philosophy and the fine arts.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}