{
  "nome_completo": "Hermann Günter Grassmann",
  "nome_curto": "Hermann Grassmann",
  "ano_nascimento": "1809",
  "ano_morte": "1877",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grassmann/",
  "lugar_nascimento": "Stettin, Prussia (now Szczecin, Poland)",
  "lugar_morte": "Stettin, Germany (now Szczecin, Poland)",
  "biografia": "Hermann Grassmann\n's father was Justus Günter Grassmann and his mother was Johanne Luise Friederike Medenwald, who was the daughter of a minister from Klein-Schönfeld. Justus had been ordained a minister but he had taken a position in the\nGymnasium\nat Stettin as a teacher of mathematics and physics. He was a fine academic who wrote several school books on physics and mathematics, and also undertook research on crystallography. Johanne and Justus had twelve children, Hermann being their third child. Hermann's brother Robert also became a mathematician and the two collaborated on many projects.\nWhen Hermann was young he was taught by his mother, who was a well educated woman. He then attended a private school before entering the\nGymnasium\nin Stettin where his father taught. Most of the mathematicians in this archive impressed their teachers from a young age, but surprisingly, despite having excellent educational opportunities in an educationally minded family, Hermann did not excel during his first few years at the Gymnasium. His father felt that he should aim at a manual job such as a gardener or a craftsman. Hermann did find pleasure in music and learnt to play the piano. As he progressed through the school he did slowly improve and by the time he took his final secondary school examinations at the age of eighteen, he was ranked second in the school. Having proved himself at least a very competent scholar, Hermann decided that he would study theology, and he went to Berlin in\n1827\nwith his eldest brother to study at the University of Berlin. He took courses on theology, classical languages, philosophy, and literature but does not appear to have taken any courses on mathematics or physics.\nAlthough he seems to have had no formal university training in mathematics, it was this topic which interested him on his return to Stettin in the autumn of\n1830\nafter completing his university studies in Berlin. Clearly his father's influence was important in taking him in that direction, and he decided at this time that he would become a school teacher but he was determined to undertake mathematical research on his own. After a year undertaking research in mathematics and preparing himself to take the examinations to teach in gymnasiums, he went to Berlin in December\n1831\nto take the necessary examinations. His papers could not have been of a good standard, since his examiners only gave him at a pass to teach at the lower levels of a gymnasium. He was told that before he could teach at higher levels he would need to retake the examinations and show a much greater knowledge of the subjects for which he had presented himself. In the spring of\n1832\nhe was appointed to the Gymnasium at Stettin as an assistant teacher.\nIt was about this time that he made his first significant mathematical discoveries which were to lead him to the important ideas he would develop a few years later. In the Foreword of his\nDie Lineale Ausdehnungslehre, ein neuer Zweig der Mathematik\nⓉ\n(\nLinear extension theory, a new branch of mathematics\n)\n(1844)\nGrassmann described how he was led to these ideas starting around\n1832\n.\nAn extract from the Foreword of\nDie Lineale Ausdehnungslehre, ein neuer Zweig der Mathematik\nⓉ\n(\nLinear extension theory, a new branch of mathematics\n)\nin which he explained how he made his initial discoveries is at\nTHIS LINK\n.\nIn\n1834\nGrassmann took the theology examinations, at level one, set by the Lutheran Church Council of Stettin but although this might have been his first step towards becoming a minister in the Lutheran Church, instead he went to Berlin in the autumn of that year to take up an appointment as a mathematics teacher at the Gewerbeschule. The vacancy had occurred since the previous teacher,\nJacob Steiner\n, had just been appointed to a mathematics chair at the University of Berlin. Grassmann only spent a year at the Gewerbeschule before a new opportunity arose back in his home town of Stettin. A new school, the Otto Schule, had just opened and Grassmann was appointed to teach mathematics, physics, German, Latin, and religious studies. He had only qualified to teach at a low level, and this explains to some extent the wide range of topics he taught.\nOver the next four years Grassmann took his teaching very seriously, yet he was able to find time to devote to mathematical research as well as concentrating on preparing himself for further examinations. In\n1839\nhe passed the theology examinations, at level two, set by the Lutheran Church Council of Stettin, and in\n1840\nhe went to Berlin to take examinations which would allow him to teach certain subjects at the highest gymnasium level. From then on he was able to teach mathematics, physics, chemistry and mineralogy at all secondary school levels.\nIn fact the examinations that Grassmann took in\n1840\nwere significant for him in another way. He had to submit an essay on the theory of the tides as part of the examination. He took the basic theory from\nLaplace\n's\nMéchanique céleste\nⓉ\n(\nCelestial Mechanics\n)\nand from\nLagrange\n's\nMéchanique analytique\nⓉ\n(\nAnalytical Mechanics\n)\nbut he realised that he was able to apply the vector methods which he had been developing since\n1832\n(\ndescribed in the preface to\nDie Lineale Ausdehnungslehre\nat\nTHIS LINK\n)\nto produce an original and simplified approach. His essay\nTheorie der Ebbe und Flut\nⓉ\n(\nTheory of the tides\n)\nwas\n200\npages long and introduced for the first time an analysis based on vectors, including vector addition and subtraction, vector differentiation, and vector function theory. Although his essay was accepted by the examiners they totally failed to see the importance of the innovations which Grassmann had introduced. On the other hand it had shown Grassmann that his theory was widely applicable and he decided to spend as much time as he could spare on further developing his ideas on vector spaces.\nOf course Grassmann could not devote too much time to research since he was a dedicated teacher who wanted to put considerable effort into doing that job to the very best of his ability. He wrote a number of textbooks, two of which were published in\n1842\n: one was on spoken German, the other on Latin. After writing these textbooks, he turned his full attention to writing\nDie lineale Ausdehnungslehre, ein neuer Zweig der Mathematik\nⓉ\n(\nLinear extension theory, a new branch of mathematics\n)\n. He started in the spring of\n1842\nand by the autumn of\n1843\nhe had completed the manuscript. It was published in the following year. In this work, which must be considered as a masterpiece of originality, he developed the idea of an algebra in which the symbols representing geometric entities such as points, lines and planes, are manipulated using certain rules. He represented subspaces of a space by coordinates leading to point mapping of an algebraic\nmanifold\nnow called the Grassmannian.\nFearnley-Sander writes in\n[\n27\n]\nabout the vector methods which Grassmann set out in this work and then refined further in\n1862\n:-\nBeginning with a collection of ''units''\ne\n1\n,\ne\n2\n,\ne\n3\n,\n.\n.\n.\ne_{1},  e_{2} , e_{3} , ...\ne\n1\n​\n,\ne\n2\n​\n,\ne\n3\n​\n,\n.\n.\n.\nhe effectively defines the free linear space which they generate; that is to say, he considers formal linear combinations\na\n1\ne\n1\n+\na\n2\ne\n2\n+\na\n3\ne\n3\n+\n.\n.\n.\na_{1}e_{1} + a_{2}e_{2} + a_{3}e_{3} + ...\na\n1\n​\ne\n1\n​\n+\na\n2\n​\ne\n2\n​\n+\na\n3\n​\ne\n3\n​\n+\n.\n.\n.\nwhere the\na\nj\na_{j}\na\nj\n​\nare real numbers, defines addition and multiplication by real numbers\n[\nin what is now the usual way\n]\nand formally proves the linear space properties for these operations. ... He then develops the theory of linear independence in a way which is astonishingly similar to the presentation one finds in modern linear algebra texts.\nHe defines the notions of subspace, independence, span, dimension, join and meet of subspaces, and projections of elements onto subspaces. He is aware of the need to prove invariance of dimension under change of basis, and does so. He proves the\nSteinitz\nExchange Theorem, named for the man who published it in\n1913\n... Among other such results, he shows that any finite set has an independent subset with the same span and that any independent set extends to a basis, and he proves the important identity\ndim\n(\nU\n+\nW\nU + W\nU\n+\nW\n)\n= dim\nU\nU\nU\n+ dim\nW\nW\nW\n- dim\n(\nU\n⋂\nW\nU \\bigcap  W\nU\n⋂\nW\n)\n.\nHe obtains the formula for change of coordinates under change of basis, defines elementary transformations of bases, and shows that every change of basis\n(\nequivalently, in modern terms, every invertible linear transformation\n)\nis a product of elementaries.\nGrassmann also realised that once geometry is put into this algebraic form then the apparent restrictions of\n3\n-dimensional space vanish. Grassmann wrote in the\nAusdehnungslehre\nⓉ\n(\nLinear extension theory\n)\nof\n1844\n:-\nIf two different rules of change are applied, then the collection of elements produced... forms a system of the second step.... If still a third independent rule is added, then a system of the third step is attained, and so forth. Space theory may serve here as an example.... The plane is the system of the second step.... If one adds a third independent direction, then the whole infinite space\n(\nsystem of the third step\n)\nis produced.... One cannot here go further than up to three independent directions\n(\nrules of change\n)\n, while in the pure theory of extension their quantity can increase up to infinity.\nGrassmann invented what is now called exterior algebra. This was joined to\nHamilton\n's\nquaternions\nby\nClifford\nin\n1878\n.\nClifford\nreplaced Grassmann's rules\ne\np\n∧\ne\np\n=\n0\ne_{p}\\land e_{p} = 0\ne\np\n​\n∧\ne\np\n​\n=\n0\nand\ne\np\n∧\ne\nq\n=\n−\ne\nq\n∧\ne\np\ne_{p}\\land e_{q} = -e_{q}\\land e_{p}\ne\np\n​\n∧\ne\nq\n​\n=\n−\ne\nq\n​\n∧\ne\np\n​\nfor\np\np\np\nnot\nq\nq\nq\nby the rules\ne\np\ne\np\n=\n1\ne_{p} e_{p} = 1\ne\np\n​\ne\np\n​\n=\n1\nand\ne\np\ne\nq\n=\n−\ne\nq\ne\np\ne_{p} e_{q} = -e_{q} e_{p}\ne\np\n​\ne\nq\n​\n=\n−\ne\nq\n​\ne\np\n​\nfor\np\np\np\nnot\nq\nq\nq\n.\nClifford\nalgebras are used today in the theory of\nquadratic forms\nand in relativistic\nquantum mechanics\n.\nClifford\nalgebras appear together with Grassmann's exterior algebra in\ndifferential geometry\n. See\n[\n66\n]\n.\nWhat did mathematicians make of this revolutionary text? Sadly it was far too much ahead of its time to be appreciated.\nMöbius\ndid not understand the significance of Grassmann's approach and declined to write a review. As a consequence the book was largely ignored. Grassmann, however, went on to apply his new concepts to other situations, feeling that once people saw how the theory could be applied they would take it seriously. He published\nNeue Theorie der Elektrodynamik\nⓉ\n(\nNew theory of electrodynamics\n)\nin\n1845\nand wrote various papers with applications to algebraic curves and surfaces over the next ten years. He received most recognition for a work he produced in\n1846\n.\nMöbius\nsuggested that he enter for the prize proposed by the Fürstliche Jablonowski'schen Gesellschaft for entries which solved a problem, first proposed by\nLeibniz\n, to establish geometric characteristic without using metric properties. Grassmann submitted\nDie Geometrische Analyse geknüpft und die von Leibniz Characteristik\nⓉ\n(\nGeometric analysis and of Leibniz's characteristc\n)\nwhich received the award on\n1\nJuly\n1846\n. However, it was not all good news for Grassmann since his was the only entry and\nMöbius\n, who was one of the judges, criticised the way that Grassmann introduced abstract ideas without providing the reader with an intuitive hook on which to hang them.\nGrassmann felt somewhat aggrieved that he was producing highly innovative mathematics which he felt was important yet he was still teaching in secondary schools. In fact although he had been in Stettin since first appointed to the Otto Schule, he had been moved first to the Stettin Gymnasium, then to the Friedrich Wilhelm Schule due to educational reorganisation in the town. In May\n1847\nhe received the title Oberlehrer at the Friedrich Wilhelm Schule and in the same month he wrote to the Prussian Ministry of Education requesting that he be put on a list of those to be considered for university positions. The Ministry of Education asked\nKummer\nfor his opinion of Grassmann who read his prize winning essay\nGeometrische Analyse\nⓉ\n(\nGeometric Analysis\n)\nand reported that it contained:-\n... commendably good material expressed in a deficient form.\nKummer\n's report ended any hopes that Grassmann might have had to obtain a university post. It is interesting to see just how many leading mathematicians failed to recognise that the mathematics Grassmann presented would become the basic foundation of the subject in\n100\nyears time.\nThe years\n1848\n-\n49\nwere marked by revolutions. The overthrow of King Louis-Philippe of France in February\n1848\nwas the signal for revolutions in the German Confederation. Moves were made towards political unification of Germany but bitter disputes followed as to the way the country should be governed. During this revolutionary period of\n1848\n-\n49\nGrassmann, together with his brother Robert, published a political weekly newspaper. Their political position was one of pressing for the unification of Germany as a constitutional monarchy. After writing a series of articles on constitutional law, Grassmann became increasingly at odds with the political direction the newspaper was going and withdrew form it.\nEarlier in\n1849\nhe had married Therese Knappe, the daughter of a landowner, on\n12\nApril. They had eleven children of whom seven reached adulthood. One of their sons, Hermann Ernst Grassmann, received a doctorate in\n1893\nfor his thesis\nAnwendung der Ausdehnungslehre auf die Allgemeine Theorie der Raumkurven und Krummen Flächen\nⓉ\n(\nApplication of the theory of extension to the general theory of space curves and Krummen surfaces\n)\nwritten under\nAlbert Wangerin\n's supervision at the University of Halle-Wittenberg. He went on to become professor of mathematics at the University of Giessen.\nIn March\n1852\nGrassmann's father Justus died and later that year Grassmann was appointed to fill his father's former position at Stettin Gymnasium. This meant that, although still teaching in a secondary school, he now had the title of professor. It is worth noting that two of Grassmann's sons, Justus and Max, eventually became teachers at Stettin Gymnasium. Having failed to gain recognition for his mathematics, Grassmann turned to one of his other favourite subjects, the study of Sanskrit and Gothic. In fact during his life it is fair to say that he gained more recognition for his study of languages:-\nBy demonstrating that Germanic actually was \"older\" in one phonological pattern than was Sanskrit, Grassmann undermined the position of Sanskrit as the language which was the earliest attainable in Indo-European linguistics. By this demonstration Grassmann also undermined the notion that language developed from an analytic to a synthetic structure through\n[\ncombining simple words without changing their form to make new words\n]\n.\nBut Grassmann also studied problems in physics, in particular publishing a theory of the mixing of colours in\n1853\nwhich contradicted that proposed by\nHelmholtz\n. By the middle of the following year, however, he had returned to mathematics and his theory of extension deciding that rather than write a second volume, as he had originally intended, he would completely rewrite the work in an attempt to have its significance recognised. In fact, despite writing a work which appears to us today to be in the style of a modern textbook, Grassmann failed to convince mathematicians of his own time. Perhaps he was just so assured of the importance of the topic that he could not bring himself to set out to sell it to sceptical readers. Certainly the book\nDie Ausdehnungslehre: Vollständig und in strenger Form bearbeitet\nⓉ\n(\nLinear extension theory: fully processed in strict form\n)\npublished by Grassmann in\n1862\nfared no better that the first version of\n1844\n.\nYou can read part of the Foreword to the\n1862\nbook at\nTHIS LINK\n.\nDisappointed that he could not convince mathematicians, he turned again to research in linguistics. Here he did indeed fare much better and he was honoured for his contributions to this area of scholarship by being elected to the American Oriental Society, and with the award of an honorary degree by the University of Tübingen. He did return to mathematics in the last couple of years of his life and, despite failing health, prepared another edition of the\n1844\nAusdehnungslehre\nfor publication. It did appear, but only after his death. Grassmann died of heart problems after a period of slowly failing health.\nGrassmann's mathematical methods were slow to be adopted but eventually they inspired the work of\nÉlie Cartan\nand have since been used in studying differential forms and their application to analysis and geometry. Other who were directly influenced included\nHankel\n,\nPeano\n,\nWhitehead\n, and\nKlein\n. Much of\nPeano\n's contributions were, as he acknowledges himself, based on the ideas of Grassmann. As A C Lewis writes:-\nIt seems to be Grassmann's fate to be rediscovered from time to time, each time as if he had been virtually forgotten since his death in\n1879\n.\nFearnley-Sander writes in\n[\n27\n]\n:-\nAll mathematicians stand, as\nNewton\nsaid he did, on the shoulders of giants, but few have come closer than Hermann Grassmann to creating, single-handedly, a new subject.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Topology"
  ]
}