{
  "nome_completo": "Hermann Bondi",
  "nome_curto": "Hermann Bondi",
  "ano_nascimento": "1919",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bondi/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Cambridge, England",
  "biografia": "Hermann Bondi\n's father was Samuel Bondi\n(1878\n-\n1959)\n, a medical heart specialist, who before Hermann's birth was working in a hospital for Russian prisoners of war in a remote part of Austria. Samuel had married Helene Hirsch\n(1892\n-\n1960)\non\n12\nMay\n1914\n, and Hermann was the second of their two children, the eldest being Gabriele born in Vienna on\n29\nMarch\n1915\n. Hermann was brought up in Vienna and he wrote of this upbringing:-\nI grew up in Vienna in a non-believing Jewish family. But whereas my father liked the forms of the Jewish religion as a social cement\n(\nand indeed we kept the household such that we could entertain our numerous Orthodox relatives\n)\n, I acquired from my mother an intense dislike of the narrowness and exclusivity of the religion. Ethical principles were very strong at home. It soon became clear to me that a moral outlook was at least as strong among non-believers. I similarly acquired a strong dislike of the alternative religion, the Catholic Church\n(\nin Austria dominant and very reactionary\n)\n. So I was set early on the path of non-belief, with strong ethical principles, and soon was ready to declare my attitude ....\nHe attended the Vienna\nRealgymnasium\nwhere he excelled in mathematics. His father had a broad interest in science, but there was a rather distant family member who could advise on mathematical matters, namely\nAbraham Fraenkel\n. Bondi's problems during his years at the Realgymnasium were not academic, however, but related to the political situation in Austria at the time. After Hitler came to power in Germany in\n1933\nthere were two distinct factions in Austria, one strongly supporting closer ties with Nazi Germany and the anti-Semitic policies they were putting in place, while the other faction strongly supported an independent Austria. Bondi, in his mid teens, became very interested in theoretical physics and astronomy, as well as mathematics, and when\nEddington\nvisited Vienna, Bondi's mother engineered an opportunity for her son to meet him. Encouraged by\nEddington\nto study at Trinity College, Cambridge, this seemed such a superb opportunity for Bondi, who was unhappy with the ever increasing anti-Semitism to which he was subjected. He applied to Cambridge and, in\n1937\n, began his studies at Trinity College.\nVery happy to be free from the problems back in Austria, Bondi began to become increasingly worried about the situation that his parents were in. The moves made by Hitler in February\n1938\nto force Austria to comply with his wishes under threat of force made Bondi act. He sent his parents a telegram to which they rapidly responded and left Austria for Switzerland before German troops crossed into Austria on\n12\nMarch. Bondi's parents eventually settled in New York. Bondi thrived at Cambridge, completing his undergraduate studies in\n1940\n. The difficulties of his situation had been quickly recognised by Cambridge and he was given a special award less than a year after beginning his studies. He later wrote:-\nThe warmth and readiness to look after me when the fortunes of my family suffered collapse because of enforced emigration made a deep and lasting impression on me.\nBondi quickly felt an affinity with Britain and never wanted, as his parents expected, to follow them to the United States. However, Britain was now at war with Germany, and after the Anschluss of\n1938\n, of course Austria and Germany were one nation. In May\n1940\n, immediately after completing his degree, Bondi was interned as an \"enemy alien\" by the British government. He spent around\n15\nmonths at camps on the Isle of Man and in Canada, but a positive consequence of this was that he met Thomas Gold, who was a fellow Austrian, on his first day of internment. Both quickly became firm friends and, after their release near the end of\n1941\n, returned to England. Bondi's potential to help in the war effort had been recognised and he was appointed Temporary Experimental Officer for the Admiralty to work under\nFred Hoyle\n. At Bondi's request Gold was also brought in as a member of the team that was working on radar at the Admiralty Signals Establishment. Their research\n[\n10\n]\n:-\n... had a number of special problems, such as \"ground clutter\" interference. Bondi, among other things, led a research team with all its cumbersome equipment to the top of Snowdon\n(\nHoyle\n's idea\n)\n, to make systematic measurements of these effects. The experiments were a great success except that, on the way down after weeks on the summit, highly secret data was briefly lost in deep soft snow by a faller who let go of his knapsack. This and the data were eventually retrieved, at substantial cost, by a company of commandos.\nDuring the time that Bondi,\nHoyle\nand Gold worked together on this wartime project they were discussing theoretical astronomy, and their collaboration which began at that time lasted for many years. Bondi became a research fellow at Trinity College in\n1943\nand was appointed as Assistant Lecturer in Mathematics at Cambridge University in\n1945\n, then, in the following year, he became a British subject. On\n1\nNovember\n1947\nhe married Christine Stockman\n(\nborn\n15\nJune\n1923\n, in London\n)\n, who had been a research student of\nHoyle\n's, in Cambridge. They met while both were trying to arrange a meeting with\nHoyle\n. Hermann and Christine Bondi had five children: Alison Joy\n(\nAlice\n)\n(\nborn\n19\nJune\n1949\n, Cambridge\n)\n, Jonathan Richard\n(\nJohn\n)\n(\nborn\n1\nNovember\n1951\n, Cambridge\n)\n, Elizabeth Anne\n(\nLiz\n)\n(\nborn\n24\nJune\n1955\n, Reigate\n)\n, David Keith\n(\nborn\n29\nJune\n1957\n, Reigate\n)\n, and Deborah Jane\n(\nDebbie\n)\n(\nborn\n20\nOctober\n1959\n, Reigate\n)\n. In\n1948\nBondi was promoted to lecturer in mathematics at Cambridge, and in\n1954\nhe became Professor of Mathematics at King's College, London.\nBondi is perhaps best known as a creator of the steady-state theory of the universe which goes further than the accepted theory that the universe looks essentially the same from every place, and proposes in addition that the universe essentially remains 'the same' for all time. As a consequence of this, in order to explain how this might be possible in an expanding universe Bondi, Gold and\nHoyle\nproposed that matter was continually created so that the average density remains constant despite the expansion. They first put the theory forward in\n1946\n. H P Robertson, reviewing Bondi's book\nCosmology\n(1952)\nwrites:-\n... the leitmotiv of the problem here considered is to be found in the \"Cosmological Principle\", the assumption that for properly chosen real or ideal observers the over-all views of the world are indistinguishable. For the extrapolative theories, such as the theory of relativity, this \"principle\" is merely an aid to the formulation of a problem which is to be attacked within the framework of the extrapolated physical laws; for the deductive theories, such as\nMilne\n's kinematical relativity, it is an a priori requirement, a sort of categorical imperative, to which physical experience must conform. Of special note is the case of the \"Perfect Cosmological Principle\", which would require that the world-views obtained by equivalent observers are in addition stationary\n(\nbut not necessarily static\n)\n; upon it are based the Bondi-Gold steady-state theory\n(\ndeductive\n)\nand the\nHoyle\ntheory of continuous creation\n(\nmainly extrapolative\n)\n.\nIt would certainly be a mistake to think that this represents the most important part of Bondi's scientific work, however, for he was a leading expert on many topics in applied mathematics, in particular in relativity theory. When evidence began to accumulate showing that the steady-state theory did not hold, Bondi's reputation was not seriously affected.\nLet us look at a few examples of Bondi's other contributions. His early paper\nOn the generation of waves on shallow water by wind\n(1942)\nextended work of\nJeffreys\nfrom the mid\n1920\ns. With R A Littleton, he wrote two papers\nOn the dynamical theory of the rotation of the earth\n(1948\nand\n1953)\n. Also with co-authors, he wrote a series of papers\nGravitational waves in general relativity\n. With W H McCrea he published\nEnergy transfer by gravitation in Newtonian theory\n(1960)\nand then went further with his single authored paper\nOn the physical characteristics of gravitational waves\n(1962)\n. In the same year he wrote the survey\nRelativity and cosmology\nand then published\nThe contraction of gravitating sphere\ntwo years later which a referee described as an:-\n... important paper, written in the author's usual lucid style ...\nAlso in\n1964\nhe published\nMassive spheres in general relativity\nwhich he describes as follows:-\nThe exact relativistic form of the equation of hydrostatic support by an isotropic pressure is found in an especially convenient form.\nLet us now note some remarkable pure mathematics papers published by Bondi. In collaboration with\nKathleen Ollerenshaw\nhe wrote\nThe nine prisoners problem\n(1978)\nand\nMagic squares of order four\n(1982)\n. Charlotte Huang writes:-\nNine prisoners are to be taken out for a walk every day for six days; each day they are divided into three groups of three and the prisoners of the same group are linked together by two pairs of handcuffs. The problem of the nine prisoners is to find ways of arranging them so that two prisoners are handcuffed together on one and only one walk. ... The correct number of solutions to the problem is\n332\n.\nAs to the\nmagic squares\npaper, D A Klarner writes:-\nThis remarkable paper presents a history of the work on\n4\n×\n4\nmagic squares. Over\n300\nyears ago\nFrénicle\nlisted all\n880\nof the\n4\n×\n4\nmagic squares, which he found by exhaustive search.\n(\nOne supposes that besides exhausting the possibilities,\nFrénicle\nwas a bit exhausted, too.\n)\nBesides presenting a history, this paper also presents a much more analytical construction of the squares. In fact, two different methods are used. The paper concludes with a complete list of the\n880\nmagic squares set down in an order that takes structure into account.\nThere is one further paper by Bondi of this kind, namely\nThe cubes\n(1979)\n. Bondi writes in the introduction:-\nA toy consists of\n8\ncubes of equal size. Each face of each cube shows either one straight line joining the centres of opposite edges or one quadrant of a circle joining the centres of adjacent edges or nothing, with every line always continued over the edge and no two cubes identical. It is required to combine these\n8\ncubes into a cube in which again every line showing is continued over the edge.\nBondi defines when two solutions are considered equivalent, then finds\n123\ndistinct solution.\nPopularising science and teaching were topics which interested Bondi throughout his life. In\n[\n1\n]\nBondi expresses the following views:-\nWe show that there are two ways in which a subject may be taught: educationally or vocationally; and that a division has been created whereby science based subjects are traditionally taught vocationally whereas humanities are taught as part of a broad education. It will be our contention that this is an unnecessarily narrow view of how science should be taught, and leads to the fostering of a very limited view of science amongst both students and the broader public.\nIn\n1985\n, after holding his chair of mathematics at King's College London for\n31\nyears, he retired and became Professor Emeritus. He had, however, held a large number of other roles: Secretary of the\nRoyal Astronomical Society\n(1956\n-\n1964)\n; Director-General of the European Space Research Organisation\n(1967\n-\n1971)\n; Chief Scientific Adviser to the Ministry of Defence\n(1971\n-\n1977)\n; Chief Scientific Adviser to the Department of Energy\n(1977\n-\n1980)\n; Chairman of the Natural Environment Research Council\n(1980\n-\n1984)\n; President of the Society for Research into Higher Education\n(1981\n-\n1997)\n; and President of the Hydrographic Society\n(1985\n-\n1987)\n. He was also Master of Churchill College, Cambridge from\n1983\nto\n1990\n. Perhaps one of the reasons he served in so many different ways is illustrated by his joke that it is bad for anyone to get into a rut because:-\n... ruts are like graves, only longer ...\nHe received many honours during his outstanding career. He was awarded honorary doctorates from the universities of Sussex, Bath, Surrey, York, Southampton, Salford, Birmingham, St Andrews, Portsmouth, and Vienna. He was elected a fellow of the\nRoyal Society\nin\n1959\nand he was appointed a Knight Commander of the Bath in\n1973\n. He was awarded a number of medals including the\nEinstein\nSociety Gold Medal in\n1983\n, the Gold Medal of the Institute of Mathematics and its Applications in\n1988\n, the G D Birla International Award for Humanism in\n1990\n, and the Gold Medal of the\nRoyal Astronomical Society\nin\n2001\n.\nHaving noted that he was awarded a medal for Humanism, let us give a small taste of his views in this regard. We noted at the beginning of this article about Bondi's upbringing, in particular about the influences on his at that time. In an article in the\nJournal of the British Humanist Association\nin\n2002\nhe wrote:-\nI think in this country we are too impressed by the concept of God. Many religions, like Buddhism and Confucianism, don't have a God at all. On the other hand, Communism in its heyday had a 'sacred text'  which was the writings of Marx and Lenin, and you justified an argument by referring to these writings. So it seems to me that the important thing is not the concept of God -- indeed we cannot quarrel with an undefined God, for how can we disagree with a concept that is undefined. No, what makes a religion is a 'revelation'. And it is the belief in a revealed truth that is the source of religious problems ...\nIndeed, one of the really irritating things about religion is that because it deals with certainties, humanists are accused of having no firm foundation for their ethics, which is utter nonsense. They accuse us of changing our ethical ideas -- well they certainly have changed in my lifetime, for example our attitude towards other races -- but Christian morals have changed also. For centuries they drowned witches and invented fiendish punishments like burning alive people accused of heresy. They don't do that now, although I suspect many of them would like to. And so their attitude has changed too. ...\nI think ethics must always be rooted in society and culture, and change as it changes, and I really hope that we become more tolerant in our attitudes ...\nHe is described in\n[\n10\n]\nas follows:-\nBeaming at you from behind huge spectacles, framing his Austrian-tinged sentences meticulously, he might have been mistaken for the archetypal hand-waving 'boffin' of light fiction. The reality was very different. Bondi was an organiser, shaped by determination to be understood, by intellectual weight and by a manifest desire to be on top. He was tough, seeming tireless, a good skier and climber who, in advancing years, still enjoyed the physical pressures of the dawn-to-midnight public life demanded of the highest fliers on the international circuit. ... he could look at old problems with great freshness of mind, and overturn accepted ideas with a disarming combination of sheer speed, clear and incisive analysis and a childlike, bubbling sense of fun.",
  "math_areas": [
    "Analysis"
  ]
}