{
  "nome_completo": "Hermann Amandus Schwarz",
  "nome_curto": "Hermann Schwarz",
  "ano_nascimento": "1843",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwarz/",
  "lugar_nascimento": "Hermsdorf am Kynast, Silesia (now Sobieszów, Jelenia Góra, Poland)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Hermann Schwarz\n's father was an architect. Hermann studied at the\nGymnasium\nin Dortmund where his favourite subject was chemistry. When he left school he intended to take a degree in chemistry and he entered the Gewerbeinstitut, later called the Technical University of Berlin, with this aim.\nSchwarz began his study of chemistry at Berlin but it was not long before\nKummer\nand\nWeierstrass\nhad influenced him to change to mathematics. The first of his teachers to influence the direction that his research would eventually take was Karl Pohlke. Through him Schwarz became interested in geometry. Schwarz attended\nWeierstrass\n's lectures on\nThe integral calculus\nin\n1861\nand the notes that Schwarz took at these lectures still exist. His interest in geometry was soon combined with\nWeierstrass\n's ideas of analysis. As Bölling writes in\n[\n3\n]\n:-\n... ideas coming from geometrical considerations were translated\n[\nby Schwarz\n]\ninto the language of analysis.\nHe continued to study in Berlin, being supervised by\nWeierstrass\n, until\n1864\nwhen he was awarded his doctorate. His doctoral dissertation was examined by\nKummer\n.\nWhile in Berlin, Schwarz worked on minimal surfaces\n(\nsurfaces of least area\n)\n, a characteristic problem of the\ncalculus of variations\n.\nPlateau\npublished a famous memoir on the topic in\n1866\nand in the same year\nWeierstrass\nestablished a bridge between the theory of minimal surfaces and the theory of analytic functions. Schwarz had made an important contribution in\n1865\nwhen he discovered what is now known as the Schwarz minimal surface. This minimal surface has a boundary consisting of four edges of a regular tetrahedron.\nSchwarz continued studying in Berlin for his teacher's training qualification which he completed by\n1867\n. In that year he was appointed as a\nPrivatdozent\nto the University of Halle. In\n1869\nhe was appointed as professor of mathematics at the Eidgenössische Technische Hochschule in Zürich then, in\n1875\n, he accepted appointment to the chair of mathematics at Göttingen University.\nPerhaps surprisingly after Schwarz succeeded\nWeierstrass\naccepting a professorship in Berlin in\n1892\n, the balance in favour of the most eminent university in Germany for mathematics, which had undoubtedly been Berlin, began to shift towards Göttingen. There were several reasons for this. Firstly Schwarz failed to keep up his output of mathematical research after his move.\nBieberbach\nin\n[\n2\n]\nput it rather well when he wrote that Schwarz retired to Berlin in\n1892\n. That this was the case should not have come as a complete surprise to those making the appointment for Schwarz had published his Complete Works in\n1890\n, two years earlier. Boerner writes in\n[\n1\n]\nthat:-\n... teaching duties and concern for\n[\nSchwarz's\n]\nmany students took so much of his time that he published very little more. A contributing element may have been his propensity for handling both the important and the trivial with the same thoroughness, a trait also evident in his mathematical papers.\nWe should not give the impression that the only reason for Berlin moving down from being the leading German university for mathematics to become its second university was due to Schwarz. The other effect was\nKlein\nwhose dynamic leadership in Göttingen made it prosper at the expense of Berlin where\nFrobenius\nand Schwarz could not provide the same inspired approach. Perhaps the final sign that Göttingen had overtaken Berlin came in\n1902\nwhen\nFrobenius\nand Schwarz chose\nHilbert\nto succeed to the Berlin chair which had become vacant on the death of\nFuchs\n.\nHilbert\nturned down the offer, preferring to remain at Göttingen. The Berlin chair was then filled by\nSchottky\nbut, like Schwarz before him, he had moved to Berlin after his best days for mathematical research were behind him.\nSchwarz continued teaching at Berlin until\n1918\n. We shall describe some of his very fine mathematical achievements in a moment, but first we note that he had several interests outside mathematics, although his marriage was a mathematical one since he married\nKummer\n's daughter. Outside mathematics he was the captain of the local Voluntary Fire Brigade and, more surprisingly, he assisted the stationmaster at the local railway station by closing the doors of the trains.\nOne important area which Schwarz worked on was that of\nconformal mappings\n. In\n1870\nhe produced work related to the\nRiemann\nmapping theorem. Although\nRiemann\nhad given a proof of the theorem that any simply connected region of the plane can be mapped conformally onto a disc, his proof involved using the\nDirichlet\nproblem.\nWeierstrass\nhad shown that\nDirichlet\n's solution to this was not rigorous, see\n[\n10\n]\nfor details. Schwarz's gave a method to conformally map polygonal regions to the circle. Then, by approximating an arbitrary simply connected region by polygons he was able to give a rigorous proof of the\nRiemann\nmapping theorem. Schwarz also gave the alternating method for solving the\nDirichlet\nproblem which soon became a standard technique. This aspect of Schwarz's work is examined in detail in\n[\n10\n]\n.\nHis most important work is a Festschrift for\nWeierstrass\n's\n70\nth\nbirthday. Schwarz answered the question of whether a given minimal surface really yields a minimal area. An idea from this work, in which he constructed a function using successive approximations, led\nÉmile Picard\nto his existence proof for solutions of\ndifferential equations\n. It also contains the inequality for integrals now known as the 'Schwarz inequality', see\n[\n9\n]\nfor details.\nThe fact that Schwarz should have come up with a special case of the general result now known as the\nCauchy\n-Schwarz inequality\n(\nor the\nCauchy\n-\nBunyakovsky\n-Schwarz inequality\n)\nis not surprising for much of his work is characterised by looking at rather specific and narrow problems but solving them using methods of great generality which have since found widespread applications. That he found such general methods says much for his great intuition which was perhaps based on a deep feeling for geometry.\nFor example the\nCauchy\n-Schwarz inequality appears in arithmetic, geometric and function-theoretic formulations in works of mathematicians such as\nBunyakovsky\n,\nCauchy\n,\nGrassmann\n,\nvon Neumann\nand\nWeyl\n. The form in which the inequality is usually presented today:\n<\nx\n+\nm\ny\n,\nx\n+\nm\ny\n>\n≥\n0\n< x + my, x + my > ≥ 0\n<\nx\n+\nm\ny\n,\nx\n+\nm\ny\n>\n≥\n0\nwith its standard modern proof seems to have been first given by\nWeyl\nin\n1918\n.\nIn answering the problem of when\nGauss\n's hypergeometric series was an algebraic function Schwarz, as he had done so many times, developed a method which would lead to much more general results. It was in this work that he defined a conformal mapping of a triangle with arcs of circles as sides onto the unit disc which is now known as the 'Schwarz function'. This function is an early example of an automorphic function and in this work Schwarz was looking at ideas which led\nKlein\nand\nPoincaré\nto develop the theory of automorphic functions.\nLet us end with quoting Bölling\n[\n3\n]\non Schwarz's character. He writes:-\nSchwarz was deeply influenced by\nWeierstrass\n. From their correspondence one finds that Schwarz addressed his teacher often with an accuracy going down to the last detail, sometimes almost timidly. Schwarz's demeanour has been described as naive, dramatic, coarse. In spite of giving the impression of self-confidence, he was, in fact, rather insecure and besides, not efficient in business matters.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}