{
  "nome_completo": "Hermann Ludwig Gustav Wiener",
  "nome_curto": "Hermann Wiener",
  "ano_nascimento": "1857",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wiener_Hermann/",
  "lugar_nascimento": "Karlsruhe, Germany",
  "lugar_morte": "Darmstadt, Germany",
  "biografia": "Hermann Wiener\n's parents were\nLudwig Christian Wiener\nand Pauline Hausrath. At the time of Hermann's birth,\nChristian Wiener\nwas professor of descriptive geometry at the Technische Hochschule of Karlsruhe, having moved there five years earlier when appointed to the chair. Hermann entered the\nGymnasium\nin Karlsruhe in\n1866\nand he took his final examinations ten years later. Then, in\n1876\n, he entered the Technische Hochschule in Karlsruhe where his father taught, studying there mathematics and the natural sciences.\nAfter graduating from the Technische Hochschule in Karlsruhe in\n1879\n, Wiener went to the Technische Hochschule in Munich to study for his doctorate. After submitting his doctoral thesis\nÜber Involutionen auf ebenen Curven\nⓉ\n(\nOn involutions on planar curves\n)\nto the University of Munich in\n1881\n, he spent some time at the University of Leipzig. He returned to Karlsruhe in the following year to take the state examinations which qualified him to teach in high schools and, following this, he taught as a trainee teacher for a year in the Gymnasium in Karlsruhe. In addition to teacher training, Wiener was also undertaking research for his\nhabilitation\nthesis with his father at the Technische Hochschule in Karlsruhe.\nWiener submitted his habilitation thesis\nRein geometrische Theorie der Darstellung binärer Formen durch Punktgruppen auf der Geraden\nⓉ\n(\nGeometric theory of representing binary forms by point groups on the line\n)\nto the University of Halle in\n1885\n. His habilitation thesis formed the first part of the monograph\nRein geometrische Theorie der Darstellung binärer Formen\nⓉ\n(\nPure geometric theory of representing binary forms\n)\npublished in\n1885\n. For the following nine years he worked as a\nPrivatdozent\nat the University of Halle.\nThe\nGerman Mathematical Society\n(\nDeutsche Mathematiker-Vereinigung\n)\nwas founded in\n1890\nat a meeting of the Society of German Scientists and Physicians which took place in Bremen from\n15\nto\n20\nSeptember. Wiener was a founder member of the\nGerman Mathematical Society\n, as were\nCantor\n,\nGordan\n,\nHilbert\n,\nKlein\n,\nMinkowski\n,\nStudy\nand\nHeinrich Weber\nwho all gave lectures at the Bremen meeting. Also in\n1890\nWiener published three papers:\nDie Zusammensetzung zweier endlichen Schraubungen zu einer einzigen\nⓉ\n(\nThe composition of two finite Screw transformations into a single one\n)\n;\nZur Theorie der Umwendungen\nⓉ\n(\nOn the theory of inversions\n)\n; and\nÜber geometrische Analysen\nⓉ\n(\nOn geometric analysis\n)\n. In the following year he published two further papers:\nÜber geometrische Analysen. Fortsetzung\nⓉ\n(\nOn geometric analysis: continuation\n)\n; and\nÜber die aus zwei Spiegelungen zusammengesetzten Verwandtschaften\nⓉ\n(\nOn the composite of two reflectional affinities\n)\n.\nIn\n1894\nWiener was appointed as an ordinary professor of mathematics at the Technische Hochschule in Darmstadt. His most important publication after his appointment to the chair at Darmstadt was the book\nDie Einteilung der ebenen Kurven und Kegel dritter Ordnung\nⓉ\n(\nThe classification of plane curves and cones of the third order\n)\nwhich was published in\n1904\n. He retired from his duties in\n1927\n, at the age of seventy. His health slowly deteriorated and he died after a long illness.\nAlthough Wiener is not explicitly credited with influencing\nHilbert\nin his championing of the axiomatic method, it is still worth noting that he gave the talk\nÜber Grundlagen und Aufbau der Geometrie\nⓉ\n(\nOn the foundations and structure of the geometry\n)\nto the\nGerman Mathematical Society\nwhich was published in the first volume of the\nJahresberichte der Deutschen Mathematiker vereinigung\nⓉ\n(\nAnnual Reports of the German Mathematicial Association\n)\n(1892)\n. Wiener proposed that geometry be studied without using visual images, but rather by abstract axiomatic methods. He also joined his father in the creation of mathematical models of geometric surfaces, constructed from plaster and wire.\nAmong the honours that Wiener received was election to the\nGerman Academy of Scientists Leopoldina\nin\n1895\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}