{
  "nome_completo": "Matthieu Paul Hermann Laurent",
  "nome_curto": "Hermann Laurent",
  "ano_nascimento": "1841",
  "ano_morte": "1908",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Laurent_Hermann/",
  "lugar_nascimento": "Echternach, Luxembourg",
  "lugar_morte": "Paris, France",
  "biografia": "Hermann Laurent\n's mother was Anne-Françoise Schrobilgen and his father was Auguste Laurent. Hermann's paternal grandparents were Jean Baptiste Laurent, who owned a small farm, and Marie-Jeanne Maistre. The second of Jean and Marie's four children was Augustin Laurent, who in later life always signed himself Auguste. He went on to study chemistry and made impressive discoveries. He married Anne-Françoise Schrobilgen, who came from an important Luxembourg family, in\n1838\n, and at this time he was working as an industrial chemist in a ceramics works in Luxembourg. When Hermann Laurent was born his father was the professor of chemistry at the University of Bordeaux, a position he had taken up in early\n1839\nhaving been appointed on\n30\nNovember\n1838\n.\nHermann Laurent was born at the home of his mother's parents in Luxembourg. However he was brought up in Bordeaux until his father's death in\n1853\n. At this time the Laurent family were awarded a state pension, and Hermann was sent to study first at the École Polytechnique in Paris and then at the École d'Application at Metz. He followed a military career, raising to the rank of officer before he resigned in\n1865\n. However he was already working on writing mathematics texts, his first being\nTraité des séries\nin\n1862\n. In the year he resigned his military career he published the\nTraité des résidus\nⓉ\n(\nTreatise on residues\n)\n. His research in mathematics had now taken him to the stage he could submit his findings for a doctorate.\nHis doctoral thesis, submitted to the University of Nancy, was on continuity of functions of a complex variable. He was appointed as répétiteur at the École Polytechnique in\n1866\nbut the political situation led to a break in his academic career. Prussia's defeat of Austria in\n1866\nhad made them a competitor to France as the leading power in Europe. In June\n1870\nmoves for Prussia and Spain to unite alarmed France and the French emperor, Napoleon III, declared war on Prussia on\n19\nJuly\n1870\n. Prussia mobilised quickly but the French were less efficient. Laurent, as a former military man, returned to active service to fight for his country against the Prussians. The war was disastrous for France, however, and after\n83000\nencircled French troops surrendered on\n2\nSeptember\n1870\n, the Prussians began to besiege Paris on\n19\nSeptember. Paris surrendered on\n28\nJanuary\n1871\nand the war was lost for the French. Laurent resigned from military service and took up his post again as répétiteur at the École Polytechnique.\nHe wrote\n30\nbooks and a fair number of papers on infinite series, equations,\ndifferential equations\nand geometry. He also developed statistical and interpolation formulae for calculating actuarial tables. His textbooks and his teaching of mathematics were particularly important, probably more so than his research contributions.\nIn\n1871\nLaurent was appointed as an actuary for the Compagnie d'Assurance de l'Union. In\n1883\nhe became an examiner at the École Polytechnique which had the effect that he could not publish textbooks related to the syllabus that he examined. His way round this, which was also adopted by others, was to publish under a different name. Laurent did this in\n1895\nwhen he published\nTraité d'arithmétique\nunder the names of two of his friends C A Laisant and E Lemoine. Perhaps his most important work, however, was published earlier being the seven volume\nTraité d'analyse\nⓉ\n(\nTreatise on analysis\n)\nwhich appeared between\n1885\nand\n1891\n. Grattan-Guinness writes in\n[\n1\n]\n:-\nIt is divided into two parts, of two and five volumes respectively, on the differential and integral calculus, and included not only the standard treatment of the derivative and the integral and their applications to geometry but also substantial sections on the theory of functions,\ndeterminants\nand elliptic functions. The last three volumes are devoted entirely to the solution and application of ordinary and partial differential equations.\nA contribution by Laurent is discussed in\n[\n3\n]\n. There the author describes how mathematicians moved from studying first derivatives, second derivatives, etc., to study fractional derivatives. N Ya Sanin and A V Letnikov published a series of papers in\nMatem. Sbornik\nbetween\n1868\nand\n1872\nusing\nCauchy\n's integral formula as a starting point, but changing\nn\n!\nn!\nn\n!\ninto\nG\n(\nn\n+\n1\n)\nG(n + 1)\nG\n(\nn\n+\n1\n)\nso that it made sense for non-integral\nn\nn\nn\n. For non-integral\nn\nn\nn\n, however, one obtains a branch point and it was Laurent who overcame this difficulty in\n1884\nby choosing an open circuit called the 'Laurent loop'.\nLaurent married Berthe Moutard in\n1874\n. He was appointed as professor at the École Agronomique in Paris in\n1889\nand he was honoured in\n1905\nwhen he was made Chevalier de la Légion d'Honneur.\nLet us end with one final comment. Particularly given the topics on which Laurent worked, it is easy to assume that Laurent series must be named after him. However this is not the case and Laurent series are in fact named after\nPierre Laurent\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Statistics",
    "Topology"
  ]
}