{
  "nome_completo": "Hermann Minkowski",
  "nome_curto": "Hermann Minkowski",
  "ano_nascimento": "1864",
  "ano_morte": "1909",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Minkowski/",
  "lugar_nascimento": "Alexotas, Russian Empire (now Lithuania)",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Hermann Minkowski\n's parents were Lewin Minkowski, a businessman, and Rachel Taubmann. Hermann was his parents' third son. Hermann's oldest brother Max\n(1844\n-\n1930)\ntook over the family business, but he was also an art collector and the French consul in Königsberg. The second brother Oskar\n(1858\n-\n1931)\nwas a physician, best known for his work on diabetes, and father of astrophysicist Rudolph Minkowski\n(1895\n-\n1976)\n. Apart from Max and Oskar, Minkowski also had an older sister, Fanny\n(1863\n-\n1954)\nand a younger brother, Toby\n(1873\n-\n1906)\n. Lewin and Rachel Minkowski were Germans although their son Hermann was born while they were living in Russia. When Hermann was eight years old the family returned to Germany and settled in Königsberg where Lewin Minkowski conducted his business.\nMinkowski first showed his talent for mathematics while studying at the\nGymnasium\nin Königsberg. Already at this stage in his education he was reading the work of\nDedekind\n,\nDirichlet\nand\nGauss\n. The outstanding abilities he showed at this time were noted in a letter that\nHeinrich Weber\n, then at Königsberg University, wrote to\nDedekind\nin\n1881\n(\nsee\n[\n14\n]\n)\n. He studied at the University of Königsberg, entering the university in April\n1880\n. He spent three semesters at the University of Berlin, for example spending the winter semester of the academic year\n1882\n-\n83\nthere. His became close friends with\nHilbert\nwhile at Königsberg, for\nHilbert\nwas an undergraduate at the same time as Minkowski. In\n1884\n, while he was a student at Königsberg,\nHurwitz\nwas appointed to the staff. The student Minkowski soon became close friends with the newly appointed academic\nHurwitz\n. He received his doctorate in\n1885\nfrom Königsberg for a thesis entitled\nUntersuchungen über quadratische Formen, Bestimmung der Anzahl verschiedener Formen, welche ein gegebenes Genus enthält\nⓉ\n(\nStudies on square shapes, determining the number of different forms, containing a given genus\n)\nMinkowski became interested in\nquadratic forms\nearly in his university studies. In\n1881\nthe\nAcademy of Sciences\n(\nParis\n)\nannounced that the Grand Prix for mathematical science to be awarded in\n1883\nwould be for a solution to the problem of the number of representations of an integer as the sum of five squares.\nEisenstein\nhad given a formula for the number of such representations in\n1847\n, but he had not given a proof of the result. In fact the\nAcademy\nhad set a problem for the Grand Prix which had already been solved, for\nHenry Smith\nhad published an outline of a proof in\n1867\n. However the\nAcademy\nwere unaware of\nSmith\n's contributions when the prize topic was set.\nEisenstein\nhad been studying quadratic forms in\nn\nn\nn\nvariables with integer coefficients at the time he published his unproved formula in\n1847\nbut as he was already ill by this time details were never published. Minkowski, although only eighteen years old at the time, reconstructed\nEisenstein\n's theory of quadratic forms and produced a beautiful solution to the Grand Prix problem.\nSmith\nreworked his earlier proof, adding detail and submitted that to the\nAcademy\n. The decision was that the prize be shared between Minkowski and\nSmith\nbut this was a stunning beginning to Minkowski's mathematical career. On\n2\nApril\n1883\nthe\nAcademy\ngranted the Grand Prize in Mathematics jointly to the young Minkowski at the start of his career and the elderly\nSmith\nat the end of his. Minkowski's doctoral thesis, submitted in\n1885\n, was a continuation of this prize winning work involving his natural definition of the genus of a form. After the award of his doctorate, he continued undertaking research at Königsberg.\nIn\n1887\n, a professorship became vacant at the University of Bonn, and Minkowski applied for that position; according to the regulations of German universities, he had to submit orally to the faculty an original paper, as an\nHabilitationsschrift\n. Minkowski presented\nRäumliche Anschauung und Minima positiv definiter quadratischer Formen\nⓉ\n(\nSpatial intuition and minima of positive definite quadratic forms\n)\nwhich was not published at the time but in\n1991\nthe lecture was published in\n[\n12\n]\n.\nDieudonné\nwrites:-\nThis lecture is particularly interesting, for it contains the first example of the method which Minkowski would develop some years later in his famous \"geometry of numbers\".\nMinkowski taught at Bonn from\n1887\n, being promoted to assistant professor in\n1892\n. Two years later he moved back to Königsberg where he taught for two years before being appointed to the Eidgenössische Polytechnikum Zürich. There he became a colleague of his friend\nHurwitz\nwho had been appointed to fill\nFrobenius\n's chair after he left Zürich for Berlin in\n1892\n.\nEinstein\nwas a student in several of the courses he gave and the two would later become interested in similar problems in relativity theory. Minkowski married Auguste Adler in Strasbourg in\n1897\n; they had two daughters, Lily born in\n1898\nand Ruth born in\n1902\n.\nThe family left Zürich in the year that their second daughter was born for Minkowski accepted a chair at the University of Göttingen in\n1902\n. It was\nHilbert\nwho arranged for the chair to be created specially for Minkowski and he held it for the rest of his life. At Göttingen he became interested in mathematical physics gaining enthusiasm from\nHilbert\nand his associates. He participated in a seminar on electron theory in\n1905\nand he learnt the latest results and theories in electrodynamics.\nMinkowski developed a new view of space and time and laid the mathematical foundation of the theory of relativity. By\n1907\nMinkowski realised that the work of\nLorentz\nand\nEinstein\ncould be best understood in a\nnon-euclidean\nspace. He considered space and time, which were formerly thought to be independent, to be coupled together in a four-dimensional 'space-time continuum'. Minkowski worked out a four-dimensional treatment of electrodynamics. His major works in this area are\nRaum und Zeit\nⓉ\n(\nSpace and time\n)\n(1907)\nand\nZwei Abhand lungen über die Grundgleichungen der Elektrodynamik\nⓉ\n(\nTwo contributions on the basic equations of electrodynamics\n)\n(1909)\n.\nKline\n, reviewing\n[\n10\n]\nwrites:-\nA key point of the paper is the difference in approach to physical problems taken by mathematical physicists as opposed to theoretical physicists. In a paper published in\n1908\nMinkowski reformulated\nEinstein\n's\n1905\npaper by introducing the four-dimensional\n(\nspace-time\n)\nnon-Euclidean geometry, a step which\nEinstein\ndid not think much of at the time. But more important is the attitude or philosophy that Minkowski,\nHilbert\n- with whom Minkowski worked for a few years -\nFelix Klein\nand\nHermann Weyl\npursued, namely, that purely mathematical considerations, including harmony and elegance of ideas, should dominate in embracing new physical facts. Mathematics so to speak was to be master and physical theory could be made to bow to the master. Put otherwise, theoretical physics was a subdomain of mathematical physics, which in turn was a subdiscipline of pure mathematics. In this view Minkowski followed\nPoincaré\nwhose philosophy was that mathematical physics, as opposed to theoretical physics, can furnish new physical principles. This philosophy would seem to be a carry-over\n(\nmodified of course\n)\nfrom the Eighteenth Century view that the world is designed mathematically and hence that the world must obey principles and laws which mathematicians uncover, such as the principle of least action of\nMaupertuis\n,\nLagrange\nand\nHamilton\n.\nEinstein\nwas a theoretical physicist and for him mathematics must be suited to the physics.\nThis space-time continuum provided a framework for all later mathematical work in relativity. These ideas were used by\nEinstein\nin developing the general theory of relativity. In fact Minkowski had a major influence on\nEinstein\nas Corry points out in\n[\n7\n]\n:-\nIn the early years of his scientific career,\nAlbert Einstein\nconsidered mathematics to be a mere tool in the service of physical intuition. In later years, he came to consider mathematics as the very source of scientific creativity. A main motive behind this change was the influence of two prominent German mathematicians:\nDavid Hilbert\nand Hermann Minkowski.\nWe have mentioned several times in this biography that Minkowski and\nHilbert\nwere close friends. Less well known is the fact that Minkowski actually suggested to\nHilbert\nwhat he should take as the theme for his famous\n1900\nlecture in Paris. Minkowski, in a letter to\nHilbert\nwritten on\n5\nJanuary\n1900\n, writes:-\nWhat would have the greatest impact would be an attempt to give a preview of the future, i.e. a sketch of the problems with which future mathematicians should occupy themselves. In this way you could perhaps make sure that people would talk about your lecture for decades in the future.\nTime has certainly proved Minkowski correct!\nThe first International Congress of Mathematicians was held in Zürich in\n1897\n.\n[\n8\n]\nMinkowski joined the organising committee in December\n1896\n-- he might not yet have been in Zürich for the preliminary meeting in July. He joined the amusement committee and was appointed to the sub-committee that was responsible for choosing the speakers. He suggested inviting Hilbert to give a talk in case\nKlein\ncould not attend, as it was,\nKlein\ndid attend the congress but\nHilbert\ndid not. Minkowski also offered to give a talk himself in one of the section meetings, but for reasons that are not explained in the minutes he did not after all. At the congress, he chaired section I: Arithmetic and Algebra.\nMinkowski acted as one of the secretaries at the\n1900\nICM in Paris, and gave a talk in section I at the\n1904\nICM in Heidelberg, entitled\nZur Geometrie der Zahlen\n(\nOn the Geometry of Numbers\n)\n. At this point he represented the University of Göttingen, likewise at the\n1908\nICM in Rome.\nMinkowski's original mathematical interests were in pure mathematics and he spent much of his time investigating quadratic forms and\ncontinued fractions\n. His most original achievement, however, was his 'geometry of numbers' which he initiated in\n1890\n.\nGeometrie der Zahlen\nⓉ\n(\nThe geometry of numbers\n)\nwas first published in\n1910\nbut the first\n240\npages\n(\nof the\n256)\nappeared as the first section in\n1896\n.\nGeometrie der Zahlen\nwas reprinted in\n1953\nby Chelsea, New York, and reprinted again in\n1968\n. Minkowski published\nDiophantische Approximationen: Eine Einführung in die Zahlentheorie\nⓉ\n(\nDiophantine approximations: An Introduction to Number Theory\n)\nin\n1907\n. It gave an elementary account of his work on the geometry of numbers and of its applications to the theories of Diophantine approximation and of\nalgebraic numbers\n. Work on the geometry of numbers led on to work on convex bodies and to questions about packing problems, the ways in which figures of a given shape can be placed within another given figure.\nAt the young age of\n44\n, Minkowski died suddenly from a ruptured appendix.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}