{
  "nome_completo": "Hermann Bleuler",
  "nome_curto": "Hermann Bleuler",
  "ano_nascimento": "1837",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bleuler/",
  "lugar_nascimento": "Hottingen, Zürich, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Hermann Bleuler\n's father Johann Caspar\n(1801\n-\n1882)\nwas a merchant and silk manufacturer; he was also a member of Zürich's cantonal parliament for some years. Hermann's mother Sophie Regula née Arter\n(1811\n-\n1880)\ncame from a family of merchants. Hermann, the second oldest child of the family, had two sisters and three brothers, one of whom became a doctor; the other two became planters in Guatemala.   At the age of eight he entered the boarding school for boys \"zum Felsenhof\" in Männedorf\n(\ncanton Zürich\n)\n. This international school 'replaced the then missing secondary school'\n[\n3\n]\n. Afterwards Bleuler attended the\nGymnasium\nand then the Industrieschule in Zürich. He was one of the first students at the Polytechnic: He matriculated at the Engineering Department in\n1855\n, the school's first year. After his graduation in\n1858\n, as one of the Polytechnic's first eight civil engineers, he worked as an engineer for two years, at the machine factory Bell & Co in Kriens\n(\ncanton Luzern\n)\n.\nBleuler had a stellar career in the Swiss army, in which he enrolled in\n1861\n. A year later he became head of the Federal Artillery Bureau in Aarau and secretary of the Federal Artillery Committee. He was promoted to captain in\n1864\n, to major in\n1868\n, to lieutenant colonel in\n1869\nand to colonel in\n1871\n. In\n1870\nhe was appointed to chief instructor of the artillery, a position that he held for eighteen years. As such he helped to improve the standard and training of the artillery. He also invented a 'ground-breaking'\n[\n4\n]\nfield howitzer. In\n1883\nhe became commanding officer of the\n6\nth\ndivision, and in\n1891\nhe took command of the\n3\nrd\ncorps. In addition, he became a member of the National Defence Committee.\nBleuler became a member of the Federal School Board in\n1881\n, the year when the Polytechnic's regulations were revised. As a result, the age at entry for students was raised, students had a greater freedom to choose their courses in their last two years, the standard of technical education was raised, and the teaching staff were allowed to elect the school's Director -- the first one being\nGeiser\n. Moreover, the School Board now consisted of seven members instead of five, of whom some came from industry\n[\n5\n]\n. Alfred Escher\n(1819\n-\n1882)\nwas a Swiss politician and railways pioneer whose influence on Swiss politics and economy in the\n19\nth\ncentury remained unequalled. Escher was instrumental in founding the Polytechnic and served as Vice-President of the School Board from\n1854\n-\n1882\n. Bleuler became Vice-President after Alfred Escher's death in\n1882\n, and in\n1888\nhe succeeded Karl Kappeler as president of the School Board. Both the President and Vice-President used to be appointed for life, but Bleuler retired in\n1905\ndue to health reasons.\nIncidentally, he was a good friend of\nGeiser\n. He helped to improve the Polytechnic's reputation by supporting the construction of engineering laboratories and appointing excellent teaching staff. Following Kappeler's method, Bleuler often attended lectures of teaching candidates incognito to assess their qualities. On the whole, the Polytechnic continued to boom during his presidency, particularly economically. However, when the Polytechnic professors demanded the right to award doctorates, more freedom in their research and greater freedom of choice for their students at the beginning of the\n20\nth\ncentury, Bleuler used his position and connections to the government to thwart these reform attempts\n[\n5\n]\n.   In addition to his positions in the army and at the Polytechnic, he also served as president of the Polytechnic's alumni association, the\nGesellschaft Ehemaliger Polytechniker\n(\nGEP\n)\n, from\n1885\n-\n1888\n.\nIn\n1873\n, Bleuler married Emma Huber whose father had also been a silk manufacturer. The couple had a son, Walter\n(\nborn\n1875)\n. In\n1887\n, the family moved into the so-called \"Villa Bleuler\", which was built for them. Today the building houses the Swiss Institute of Cultural Studies .\nBleuler signed the invitation circular for the first International Congress of Mathematicians from January\n1897\nin his capacity as School Board president. Later he was invited to join the organising committee, which he did in May\n1897\n. He also attended the congress, as one of few non-mathematicians. His wife Emma provided some entertainment for the accompanying ladies at the congress\n[\n6\n]\n:\nIn the afternoon\n[\nTuesday,\n10\nAugust\n]\nthe ladies were invited by Mrs School Board President Bleuler.\nHermann Bleuler died on\n7\nFebruary\n1912\nafter a long illness.",
  "math_areas": []
}