{
  "nome_completo": "Phoebe Sarah Hertha Marks Ayrton",
  "nome_curto": "Hertha Marks Ayrton",
  "ano_nascimento": "1854",
  "ano_morte": "1923",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ayrton/",
  "lugar_nascimento": "Portsea, near Portsmouth, England",
  "lugar_morte": "North Lancing, Sussex, England",
  "biografia": "Hertha Marks Ayrton\nwas given the name Phoebe Sarah Marks when she was born. Ayrton is her married name but less obvious is why she is always known as Hertha. In fact this was a nickname she received after the age of sixteen and she is now almost always known by the name Hertha Ayrton. Her parents were Levi Marks and Alice Theresa Moss. The Jewish Levi Marks had been born in Poland, the son of a Polish innkeeper, but had fled to England when Russian reprisals against Polish uprisings caused many to flee. In England, Levi, a watchmaker and jeweller in Petworth, Sussex, married Alice Theresa Moss, the daughter of Joseph Moss who was a Jewish glass merchant of Portsea. Hertha was the third child of Levi and Alice Marks, having two older brothers. She was born at\n6\nQueen Street, Portsea, on the south coast of England. She had four younger brothers by\n1861\nwhen her father died. Her mother was pregnant with their eighth child at the time. The family had struggled financially while Levi was alive and, after his death, it was a much harder struggle. Alice earned some money as a seamstress while Hertha, who was seven at this time, helped to look after her younger siblings. Let us note at this point that we will refer to the subject of this biography as \"Hertha\" throughout to avoid the change to her married name half way through, and to avoid confusing her with her husband.\nHertha's aunt, Marion Hartog\n(1821\n-\n1907)\n, ran a school in north-west London along with her husband Alphonse Hartog\n(1815\n-\n1904)\n. Marion, who was the fourth child of Joseph Moss, had married her French teacher Alphonse Hartog in\n1845\nand they set up their school at\n68\nMansell Street, Goodman's Fields. Marion wrote poetry and articles for the\nJewish Chronicle\nand other Jewish magazines. Marion and Alphonse Hartog had five children: Numa Edward Hartog\n(1846\n-\n1871)\nbecame the first Jewish Senior\nWrangler\nin mathematics at Cambridge in\n1869\n; Héléna Hartog\n(1848\n-\n1923)\nbecame a portrait painter; Marcus Manuel Hartog\n(1851\n-\n1924)\ntook the Natural Science Tripos at Cambridge and became a zoologist; Cécile Sarah Hartog\n(1857\n-\n1940)\nbecame a composer and pianist; and Philip Joseph Hartog\n(1864\n-\n1947)\nstudied chemistry. When Hertha was nine years old, Marion Hartog invited her to come and live with her and to be educated at her school. Hertha's mother encouraged her to go for, unlike the general view, she believed that an education for girls was as important\n(\nperhaps even more important\n)\nas it was for boys.\nHertha studied at Marion Hartog's school from age nine to age sixteen\n[\n2\n]\n:-\n[\nThere she\n]\nestablished her reputation both as a scholar and a fighter in the cause of justice, once going on hunger strike for two days when wrongly accused of some misdemeanour.\nThere she learnt French and music but it was the Hartog children who taught her topics that girls at this time would not have expected to study. From them she learnt mathematics, science and Latin. At age sixteen she began working as a governess in London and she sent home money that she earned to help support her mother and her siblings. She was now living with the family with whom she worked as a governess but she continued to join in the Hartog's circle of intellectual friends who also included some who had fled their own lands because of persecution. One such family was that of Karl Blind, a German Jew who had emigrated to England. Karl had a daughter Ottilie Hancock who became a close friend of Hertha and, in fact, it was Ottilie who gave her the nickname of 'Hertha' after the heroine of a novel named\nHertha\n, published\n1856\n, by the feminist Swedish author, Frederika Bremer\n(1801\n-\n1865)\n. This novel was highly influential in gaining women's rights in Sweden and was an inspiration for suffragettes in Britain. Barbara Bodichon\n(1827\n-\n1891)\nwas a leading  suffragette and the co-founder of Girton College, and Ottilie Hancock introduced Hertha to her. Hertha was persuaded to study for the Cambridge University Local Examinations for secondary schools which, partly through the efforts of Bodichon, were in\n1865\nopen to women for gaining admission to Cambridge University. Bodichon did more than persuade Hertha to study for these examination for she paid for advanced mathematics lessons for her. A P Trotter writes\n[\n14\n]\nthat Hertha passed these examinations:-\n... after a few months' coaching instead of grinding for years over elementary classics like boys at public schools. She told me that she never regretted the time and trouble of acquiring a smattering of Greek, and agreed that the true object of a 'pass' examination is to discover the capability of acquiring knowledge quite apart from the value of that knowledge.\nHertha entered Girton College, University of Cambridge, in\n1877\n. Her tutor was Richard Glazebrook\n(1854\n-\n1935)\nwho had graduated from Cambridge with a mathematics degree in\n1876\nand was elected as a fellow in\n1877\n. During the time that Glazebrook was tutoring Hertha, he was studying with\nJames Clerk Maxwell\nand\nLord Rayleigh\n. Hertha did not excel in her studies of mathematics but showed amazing talents in other ways. She invented a line-divider which she later patented and constructed a sphygmomanometer for recording the pulse in the arteries. She led the College Choral Society, founded the Girton Fire Brigade and, in collaboration with\nCharlotte Scott\n, founded a mathematical club. She began publishing mathematical problems and their solutions in\nMathematical Questions from the Educational Times,\nsomething which she continued for nearly twenty years. At this time women were not allowed to sit the Tripos examinations with the male students but were allowed to sit the examinations in their college. Their rank position relative to the men was indicated but they could not graduate. Hertha did not distinguish herself in the Tripos examination which she took in\n1880\nand was ranked as Third Class. She wrote to Barbara Bodichon\n(\nsee\n[\n16\n]\n)\n:-\nI think it is very hard on you after all you have done for me, that I should do no better. It is not for want of work, nor even entirely of brains, but rather a want of memory and still more presence of mind in the exam room. So I have turned out a failure.\nIn order to get a degree, Hertha sat the external B.Sc. examinations of the University of London in\n1881\nand was awarded the bachelor's degree.\nBack in London, Hertha used her mathematical training to teach at Notting Hill High School and Ealing High School. She continued to devise mathematical puzzles which, as we noted above, she published. In addition to these activities, she ran a club for working girls, held singing classes for girls who worked in laundries, and looked after her sister who was an invalid. In\n1882\nshe met William Edward Ayrton\n(1847\n-\n1908)\n, known as Will, who taught physics and was a pioneer in electrical engineering. Ayrton was married to Matilda and they had a daughter Edith. By this time Matilda was seriously ill with consumption and she died in\n1883\n. Ayrton had studied at Glasgow under\nKelvin\nand, after working in India and Japan, had returned to England setting up the City and Guilds Institute in\n1879\n. This became the Finsbury Technical College in\n1883\nand, in the following year, Hertha began to attend evening classes on electricity at the College. In the same year of\n1884\nshe patented the line-divider she had invented while an undergraduate. Taking out a patent requires money but this was paid for by Barbara Bodichon and fellow suffragette Lady Goldsmid who, like Bodichon, had helped found Girton College.\nIn\n1885\nHertha married Will Ayrton and in the following year they had a daughter whom they named Barbara Bodichon Ayrton in honour of Barbara Bodichon was such a strong support for Hertha. Let us at this point sat a little about Barbara Bodichon Ayrton\n(1886\n-\n1950)\n. She married the poet, essayist and journalist Gerald Gould\n(1885\n-\n1936)\nin\n1910\n. Barbara, like her mother, became a leading suffragette and her actions smashing store windows in the West End of London led to her being sent to prison in\n1912\n. She became a member of the National Executive of the Labour Party in\n1929\nand became a Labour member of parliament for Hendon North in\n1945\n. Let us now return to describe Hertha's major contributions to science.\nAfter her marriage and the birth of her daughter, Hertha was fully occupied as a housewife but on the death of Barbara Bodichon in\n1891\n, she was left a substantial sum of money which enabled her to employ a housekeeper and, in addition, to provide financial support for her mother. Her research on the electric arc began through an accident but first let us quote from\n[\n8\n]\nto put this work into context:-\nArc lights had been used in lighthouses from the mid\n1800\ns, and by the\n1890\ns were taking over from gas for street lighting. To strike the arc, a high voltage was established between two carbon rods a short distance apart in air, so that carbon evaporated from the positive electrode, forming a crater at the tip. A high current was carried by the ionised carbon atoms and counter-streaming electrons as they moved between the two rods, forming what would now be called a plasma in the electrode gap region. Arcs were plagued with problems of humming, hissing, spluttering and instability, and needed constant adjustment of the electrode separation as the carbon evaporated.\nThe accident which led to Hertha's research is described in\n[\n14\n]\n:-\nDuring the Chicago Electrical Conference of\n1893\n, a Negro servant lighted a fire with a paper written by Ayrton on \"Variation of Potential Difference of the Electric Arc with Current, Size of Carbons, and Distance apart\". No rough copy or even an abstract existed of the paper which had not been read in full, and had described an unfinished and inconclusive research.\nAyrton was unhappy with his inconclusive paper and had no wish to rewrite it so his wife began her own research on the electric arc\n[\n8\n]\n:-\nHertha Ayrton showed that the major problems were caused by oxidation of the carbon anode at its tip. The hissing was due to air rushing in, enlarging the crater and promoting unstable conditions. She achieved the reproducible conditions that had eluded other experimenters by shaping the ends to prevent oxidation, and by careful control.\nIn the years\n1895\nand\n1896\nshe published her results in\n12\npapers in\nThe Electrician\n. In\n1899\nthe Institution of Electrical Engineers invited her to read her paper\nThe Hissing Arc\nto the Institution. A journalist who was present at the lecture described Hertha as:-\n...a little dark-haired, dark-eyed lady, wearing pince-nez, who created a sensation which perhaps accounted in some degree for the unusually large attendance of young men members.\nThe\nDaily Telegraph\nreported on her demonstration of the electric arc to the Institution, writing that it was attractive because of:-\n... the feminine running commentary ... as ... when a peculiar modification of the negative carbon that appears to be due to hissing, the formation of a mushroom, ... failed to make its prompt appearance. \"Mushrooms,\" observed the lady dryly, \"won't grow to order;\" and again, \"It's coming now, but I'm afraid it's on the side you can't see.\"\nThe demonstration was such a success that the\nRoyal Society of London\ninvited her to give a demonstration of her experiments to their Society in\n1899\n. The report in\nThe Daily News\nstated:-\nWhat astonished the lady visitors ... was to find one of their own sex in charge of the most dangerous looking of all the exhibits - a fierce arc light enclosed in glass. She calmly showed how, by excluding air from the light, its unpleasant hissing could be prevented, and by throwing a picture of the burning carbon on the screen, she made the reason evident to the dullest.\nHertha's mathematical training was evident too, since not only did she conduct experiments but she was able to give an equation, now called the Ayrton equation, exhibiting a linear relation between arc length, pressure, and potential difference. For her innovative work Hertha was elected to membership of the Institution of Electrical Engineers in\n1899\n. She was the first woman member, the next being elected\n60\nyears later. In\n1900\nshe read her paper\nL'intensité lumineuse de l'arc à courants continus\nⓉ\n(\nThe brightness of the direct current arc\n)\nto the International Electrical Congress in Paris. She submitted a paper\nThe mechanism of the electric arc\nto the\nRoyal Society\nin\n1901\nand this was read to the Society by John Perry\n(\na colleague of her husband\n)\n. She gave a detailed description of her work in the book\nThe Electric Arc\nwhich she published in\n1902\n.\nIn\n1902\nshe was proposed for a fellowship of the\nRoyal Society\n. She was rejected, however, the reason given being:-\nWe are of the opinion that married women are not eligible as Fellows of the\nRoyal Society\n.\nHertha undertook other important scientific work which she began in\n1901\n. At that time, her husband was ill and sea air was recommended. They went to Margate and, while on the beach there, she became fascinated by the ripples in the sand created beneath the water. On her return to London, she conducted experiments and attempted to give a mathematical model of the effect. Her mathematical model is, however, defective since we now know that chaotic effects of turbulence are involved. Her experiments, however, were of exceptional quality\n[\n4\n]\n:-\nHertha Ayrton demonstrated in an elegant manner the association of vortices with mature wave ripples, the shifting of the vortices about the ripple crests in response to the changing direction of the oscillatory wave currents, and the role of vortices in promoting the initiation of the ripples at obstacles and the spread of a pattern of ripples. It was not until the\n1940\ns that experiments of comparable quality and range were to be performed.\nShe read a paper to the\nRoyal Society\nin\n1904\non this topic, the first paper read by a woman to the Society, and also a paper to the Engineering Section of the\nBritish Association\nin August\n1904\n. She lectured to the Physical Society in June\n1907\nand again to the\nRoyal Society\nin\n1908\nand\n1911\n. Although the\nRoyal Society\ndenied her a fellowship, they did award her their Hughes Medal in\n1906\n(\nthe first award of this medal to a woman\n)\n.\nFor more details concerning the award of the Hughes Medal, see\nTHIS LINK\n.\nWill Ayrton died in\n1908\nand\n[\n14\n]\n:-\n... she turned the large drawing-room of her house at\n41\nNorfolk Square into a laboratory, and equipped it with glass tanks. Some were a yard long and about ten inches wide and deep, filled with water, and a layer of sand about an inch deep on the bottom. They were mounted on rollers and moved to and fro to make waves swing backwards and forwards. Some were kept in motion by electric motors.\nWorld War I began in\n1914\nand Hertha carried out experiments as part of the war effort:-\nEarly in\n1915\nthe Germans with fiendish brutality began to use poison gas. She thought that eddies of air might be used to repel gas attacks. ... The Ayrton fan was quite capable of rolling it back in the open, and, unexpectedly, even I think by Mrs Ayrton, of clearing dugouts into which gas had fallen.\nShe described her fan in the paper\nOn a New Method of Driving off Poisonous Gases\nwhich was published in the\nProceedings\nof the\nRoyal Society of London\n. Over\n100\n,\n000\nAyrton fans were manufactured for use on the Western Front in World War I.\nThere are some other comments we should make about Hertha. She was a close friend of Marie Curie and in the summers of\n1912\nand\n1913\nMarie Curie and her daughters spent their summer holidays staying with Hertha. When the discovery of radium was attributed to Marie Curie's husband, Hertha campaigned to have its discovery correctly attributed. She wrote that:-\n... errors are notoriously hard to kill, but an error that ascribes to a man what was actually the work of a woman has more lives than a cat.\nThe end of Hertha's life is described in\n[\n7\n]\n:-\nHertha Ayrton helped found the International Federation of University Women in\n1919\nand the National Union of Scientific Workers in\n1920\n. She died of blood poisoning\n(\nresulting from an insect bite\n)\non\n26\nAugust\n1923\nat New Cottage, North Lancing, Sussex.",
  "math_areas": []
}