{
  "nome_completo": "Armand-Hippolyte-Louis Fizeau",
  "nome_curto": "Hippolyte Fizeau",
  "ano_nascimento": "1819",
  "ano_morte": "1896",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fizeau/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Nanteuil-le-Haudouin, Seine-et-Marne, France",
  "biografia": "Hippolyte Fizeau\nwas the eldest son of Béatrice and Louis Fizeau. His father Louis Fizeau, coming from a family many generations of which had been doctors, was Professor of Pathology at the Paris Medical School. It was certainly expected that Hippolyte would follow in the family tradition and enter the medical profession - anything else would have been unthinkable. He attended the prestigious Collège Stanislas in Paris where he was friendly with one of his fellow students\nLéon Foucault\n.\nAn important event, which was to have a marked affect on Fizeau's future, happened in September\n1839\n. Louis-Jacques Daguerre put on a free course on his new photographic techniques in Paris and the two friends Fizeau and\nFoucault\nattended. They watched Daguerre expose a plate in a camera pointing out the window, then after talking about his process for about\n30\nminutes, he developed the plate using a variety of chemicals to reveal the picture. Although Fizeau and\nFoucault\nwere impressed they also realised the limitations of the process - it would be wonderful to be able to take portraits, they thought, but the subject could not be expected to remain motionless for\n30\nminutes. After the course ended they began to experiment to try to speed up the process, and Fizeau had the idea of sensitizing the plate using bromine. Experimentation led to them reducing the exposure time from\n30\nminutes to\n20\nseconds. The discovery did not have the impact that it might, however, for other photographic methods were coming into use.\nAfter an excellent education at the Collège Stanislas, Fizeau entered the Paris Medical School in\n1840\n. However, he suffered severe migraines and decided to give up medicine. He spent a while travelling during which time he regained his health, then he turned to physics. He attended\nArago\n's lectures at the Observatory, and enrolled in a course on optics at the Collège de France given by the famous Henri Victor Regnault. Fizeau had another method of building up his knowledge of mathematics and physics, which was to make a deep study of the notebooks containing the lecture notes taken by his brother who attended courses at the École Polytechnique.\nArago\nwas aware of the great scientific potential of the new methods of photography and, in particular, he was aware of the advances made by Fizeau and\nFoucault\n. He approached the two friends in\n1845\nand suggest that they might attempt to make photographs of an image of the sun produced by a telescope. They were highly successful and produced the first ever photograph of the sun. It clearly shows groups of sunspots.\nIn\n1842\nDoppler\nhad published\nOn the coloured light of the double stars and certain other stars of the heavens\nwhich presented for the first time the\nDoppler\nprinciple which relates the frequency of a source to its velocity relative to an observer. However, Fizeau was unaware of\nDoppler\n's work and in\n1848\ngave a similar explanation of the shift in wavelength in light coming from a star\n[\n2\n]\n:-\nFizeau, however, predicted that subtle displacements of the absorbsion lines in stellar spectra could be used to measure much smaller\n[\nthan suggested by\nDoppler\n]\ncelestial velocities, and the motion of the terrestrial observer, and this correct prediction underpins much of modern astrophysical inquiry.\nArago\nwas delighted with the success of Fizeau and\nFoucault\nin photographing the sun, and suggested to them that they try to calculate the speed of light with an earth based experiment. The only previous calculation had been by Rømer using the moons of Jupiter.\nArago\nwas also interested in whether light travelled more slowly or more quickly through water than through air since this was a crucial test of whether light was corpuscular or a wave. Both Fizeau and\nFoucault\nhad their own ideas how to proceed and after an initial period working on this together they split up. In July\n1849\nFizeau set up a mirror at his parents' home at Suresnes and another on Montmartre, the hill on the right bank of Paris. These were\n8633\nmetres apart. Between them he set up a rapidly rotating toothed wheel and determined the speed of rotation necessary for the time taken by the light travelling between the mirrors to equal the time taken for the wheel to rotate by one tooth. He was thus the first to make a successful terrestrial measurement of the velocity of light. We know today that the value he found was almost as accurate as Rømer's astronomical measurement having an error of about\n5\n%. In April\n1850\nFoucault\nbecame the first to show that light travelled more slowly in water than in air - Fizeau confirmed this result with his apparatus seven weeks later. In\n1851\nFizeau tried to measure the passage of the earth through the ether and achieved a negative result. This was an important first step in a rather lengthy process which eventually led to the discarding of the ether hypothesis in the early years of the\n20\nth\ncentury. Melcher writes that\n[\n9\n]\n:-\n... written testimony by\nEinstein\nexists which verifies the influence of Michelson's experiments on the former's work. Since\nEinstein\nfrequently referred to the Fizeau experiment\n(1851)\nwhich Michelson had repeated in\n1886\n, but more recent literature often cites Hoek's experiment\n(1868)\ninstead, we finally analyze these experiments and their historical significance.\nWhile we are considering this aspect of Fizeau's contributions, we note the interesting article\n[\n6\n]\nwhich discusses sealed letters by Fizeau and\nFoucault\nwhich were only studied in\n1983\n. We quote from Costabel's summary:-\nSealed Letter No.\n1002\n, deposited by\nFoucault\non May\n27\n,\n1850\nand opened on February\n23\n,\n1983\n, ... reveals that\nFoucault\nonce collaborated in his laboratory with Fizeau in testing ether drag by transparent bodies. ... The integral text of Fizeau's memoir of September\n29\n,\n1851\n, when reread in the light of this first, unsatisfactory project, is indicative of a new approach. This therefore ... sheds light on the importance of a moment in history, in the intertwining of hypotheses and  'decisive' experiments concerning the undulatory nature of light and the motion of the Earth.\nFizeau was made a knight of the Légion d'Honneur in\n1849\n. In\n1853\nhe married Thérèse Valentine de Jussieu, a daughter of famous botanist Adrien de Jussieu; they had two daughters and one son. He had attempted to gain membership of the\nAcademy of Sciences\nin March\n1851\n. Fifty-two members of the Academy voted in a secret ballot to elect one of seven candidates. In the first round he was fourth equal with eight votes and dropped out in later ballots.\nFoucault\n, who was also one of the seven candidates, fared better but was not elected. Fizeau was elected to the\nAcademy of Sciences\non\n2\nJanuary\n1860\n, rather surprisingly before\nFoucault\nwho was not elected until\n1865\n. He had been earlier honoured by the Institut de France when it awarded him the Triennial Grand Prix on\n9\nJuly\n1856\n. Further honours were to follow when, in particular, he was awarded the Rumford Medal of the\nRoyal Society\nin\n1866\n, then elected an a foreign member in\n1875\n. In\n1877\nhe became vice-president of the Physics Section of the\nAcademy of Sciences\n, then President of the Section in the following year. In his Presidential address he spoke of\n[\n8\n]\n:-\n... the dignity and independence of natural science as well as to its limits of action, preventing it from interfering in philosophic or social questions, and not permitting it to put itself in opposition to the noble emotions of the heart nor to the pure voice of conscience.\nAlso in\n1878\nhe became a member of the Bureau des Longitudes. Thérèse died young and after this Fizeau retired to his home near Jouarre. From there he rarely went into Paris for meetings of the\nAcademy\nor of the Bureau des Longitudes.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}