{
  "nome_completo": "Robert Hjalmar Mellin",
  "nome_curto": "Hjalmar Mellin",
  "ano_nascimento": "1854",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mellin/",
  "lugar_nascimento": "Liminka, Northern Ostrobothnia, Finland",
  "lugar_morte": "Helsinki, Finland",
  "biografia": "Hjalmar Mellin\n, the son of the clergyman Gustaf Robert Mellin\n(1826\n-\n1880)\nand his wife Sofia Augusta Thermén\n(1821\n-\n1888)\n, was born in Liminka, northern Ostrobothnia, in Finland in\n1854\n. Gustaf Robert Mellin was a school teacher before becoming a priest, serving in Hyrynsalmi, Muhos, and Tyrnävä before taking up a position in Liminka where his son Hjalmar was born. He continued to move frequently, serving in Haukipudas, Turtola, Karunki, Kemi, and Ylikiiminki before becoming chaplain of Sievi in\n1862\n. However, he was suspended because of heavy drinking in\n1864\nand expelled from the priesthood in\n1866\n. After this he worked as a translator of religious and literary works. Hjalmar's mother, Sofia Augusta Thermén, was the sister of Karl Otto Thermén\n(1818\n-\n1893)\nwho became Councillor of State. Hjalmar was the oldest of his parents' four children having siblings Naimi Natalia Mellin, born\n1856\nin Haukipudas, Alexis Herbert Mellin\n(1857\n-\n1892)\n, born in Turtola, and Hilma Sofia Hildegard, born in\n1859\nin Karunki.\nMellin grew up and received his schooling in Hämeenlinna\n(\nabout\n100\nkm north of Helsinki\n)\nwhere he attended Hämeenlinna Lyceum and graduated in\n1875\n. He then undertook his university studies at the University of Helsinki where he was a member of Hämäläis-Osakunta, one of fifteen student nations at the University. He majored in mathematics and physics but also took courses on astronomy, chemistry, botany and the history of the Nordic countries. His lecturers included the mathematician Sakari Levänen\n(1841\n-\n1898)\nwho had been appointed as a docent in\n1876\n, the physicist August Fredrik Sundell\n(1843\n-\n1924)\n, and the mathematician and author Ernst Bonsdorff\n(1842\n-\n1936)\n. One of his teachers was the Swedish mathematician\nGösta Mittag-Leffler\nwho, after studies in Paris and Berlin, was appointed as a professor at the University of Helsinki in\n1876\n.\nMittag-Leffler\nintroduced Mellin to function theory in the style of\nWeierstrass\nand was the greatest influence on his mathematical education.\nOn\n30\nDecember\n1880\n, Mellin graduated with his first degree, a Bachelor of Arts, and continued to undertake research for his doctorate at the University of Helsinki advised by\nMittag-Leffler\n. In the autumn of\n1881\nMellin defended his doctoral dissertation\nDe algebraiska funktionerna af en oberoende variabel\nⓉ\n(\nThe algebraic functions of an independent variable,\n)\n, on algebraic functions of a single complex variable, and was awarded a Licentiate of Philosophy in\n1882\n. He made two sojourns in Berlin in\n1881\nand\n1882\nto study under\nKurt Weierstrass\nand\nLeopold Kronecker\n. In\n1883\n-\n84\nhe to continue his studies with\nMittag-Leffler\nwho had by this time moved to Stockholm.\nMellin was appointed as a\ndocent\nat the University of Stockholm from\n1884\n-\n91\nbut never actually gave any lectures. Also in\n1884\nhe was appointed a senior lecturer in mathematics at the recently founded Polytechnic Institute in Helsinki which was later\n(\nin\n1908)\nto become the Technical University of Finland. In\n1901\nMellin withdrew his application for the vacant chair of mathematics at the University of Helsinki in favour of his illustrious\n(\nand younger\n)\nfellow countryman\nErnst Lindelöf\n. During the period\n1904\n-\n07\nMellin was Director of the Polytechnic Institute and in\n1908\nhe became the first professor of mathematics at the new university. He remained at the university for a total of\n42\nyears, retiring in\n1926\nat the age of\n72\n.\nMellin was married twice. His first wife was Hilda Koskinen with whom he had a son and two daughters. Hilda was born on\n15\nJune\n1857\nin Eräjävi and died in Helsinki on\n23\nDecember\n1909\n. One of their daughters was Hilda Ingeborg Mellin born in Helsinki on\n27\nNovember\n1885\n. She married the statistician Martti Adolf Kovero in\n1909\nand died in\n1978\n. Hilda and Hjalmar Mellin's son was Ilmari Teodor Mellin\n(1880\n-\n1959)\n. After the death of his wife Hilda in\n1909\n, Mellin married again\n(\nto another lady with the name Hilda\n)\n, this time in\n1917\nto Hilda Maria Sofia Peltola\n(1888\n-\n1927)\n. There were no children from this marriage.\nWith regard to the ever-burning language question, Mellin was a fervent fennoman with an apparently fiery temperament. It must be recalled, at this juncture, that Finland had for a long time been part of the kingdom of Sweden and had consequently been subjected to its language and culture. After the Napoleonic wars Finland became an autonomous Grand Duchy under Russia, to finally emerge as an independent republic in the aftermath of the First World War. Mellin's passionate defence of the Finnish language and culture did not go down well with everyone, of course, and he made enemies among his Swedish-speaking colleagues. For example, when he was director of the Polytechnic Institute he objected to the fact that its name was written on the wall outside in Swedish only. He took matters into his own hands and, with a pot of paint, added the name of the institution in Finnish. Despite his strong opinions about the Finnish language and culture he was not really interested in politics. By nature he was much more interested in research and teaching.\nAs a teacher he is said to have delivered very clear lectures, and it was important to him that his students were given a clear picture of the things he discussed. It is not known with certainty how demanding he was as a teacher, but he is remembered for sometimes becoming heated and, surprisingly strongly, giving his opinions. His main passion other than his research and teaching was his family. He seemed to shy away from a social life and seldom made unnecessary public appearances. His free time was rare but when he did find time for hobbies he was interested in cycling, sailing and hunting.\nMellin was one of the founders of the\nFinnish Academy of Sciences and Letters\nin\n1908\nas a purely Finnish alternative to the predominantly Swedish-speaking Finnish Society of Sciences and Letters which had been founded in\n1838\n. From\n1908\nuntil his death in\n1933\n, at the age of\n79\n, he represented his country on the editorial board of\nActa Mathematica\n.\nTo describe Mellin's mathematical contributions we take a paragraph directly from Richard Paris\n[\n2\n]\n:-\nMellin's research work was principally in the area of the theory of functions which resulted from the influence of his teachers\nMittag-Leffler\nand\nWeierstrass\n. He studied the transform which now bears his name and established its reciprocal properties. He applied this technique systematically in a long series of papers to the study of the\ngamma function\n,\nhypergeometric functions\n,\nDirichlet\nseries, the\nRiemann\nzeta function\nand related number-theoretic functions. He also extended his transform to several variables and applied it to the solution of\npartial differential equations\n. The use of the inverse form of the transform, expressed as an integral parallel to the imaginary axis of the variable of integration, was developed by Mellin as a powerful tool for the generation of asymptotic expansions. In this theory, he included the possibility of high-order poles\n(\nthereby leading to the inclusion of logarithmic terms in the expansion\n)\nand to several sequences of poles yielding sums of asymptotic expansions of very general form.\nFor a list of Mellin's publications, in German, Finnish, French and Swedish, see\nTHIS LINK\n.\nDuring the last decade of his life Mellin was, rather curiously for an analyst, preoccupied by\nEinstein\n's theory of relativity and he wrote no less than ten papers on this topic. In these papers, where he was largely concerned with general philosophical problems of time and space, he adopted a quixotic standpoint in his attempt to refute the theory as being logically untenable. His first paper on this topic was\nDas Lichtproblem\nⓉ\n(\nThe Light Problem\n)\npublished in the\nAnnals\nof the\nFinnish Academy of Sciences and Letters\nin\n1925\n. Professor P A Poukan spoke about his work on the theory of relativity in his commemorative speech delivered on\n13\nOctober\n1933\n(\nsee\n[\n5\n]\n)\n:-\nAbout ten years before Mellin's death he stopped working on mathematics. This was due to the fact that\nEinstein\n's theory of relativity, and the issues involved with it, cast its spell over him in his old age, despite the fact that his earlier research work had been exclusively devoted to the field of pure mathematics. He completed a full ten different publications, which is proof of the passionate enthusiasm with which he approached these questions. As soon as the first appeared he argued sharply against the theory of relativity, and with later papers expressed his opinions still more strongly. His publications included criticism, but partly also outlined his own theory, the core point being the simultaneity issue. Mellin insisted that simultaneity is necessary, absolute and not relative, as it is assumed the light signals are assigned thereto in\nEinstein\n's theory. This settled his views on the theory of relativity, to which he responded totally negatively using the strongest of language in his judgement. This sharp and judgmental view was probably also influenced by his second position in a similar manner. Mellin wanted, as he said, to mark his position so strongly, so that it should be noticed. He was not liked by all who saw only one being so aggressive, so that his views were not able to triumph during his lifetime. In this belief he spent his last years, and that is this belief he maintained until he died, closing his eyes to eternal sleep on\n5\nApril\n1933\nin the evening.\nIn\n1895\nMellin received a prize from the Finnish Society of Sciences and Letters. In\n1927\nhe received a major award from the Alfred Kordelin Foundation set up in\n1918\nto support the sciences, literature, the arts and public education with grants and awards.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}