{
  "nome_completo": "Horatio Scott Carslaw",
  "nome_curto": "Horatio Carslaw",
  "ano_nascimento": "1870",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carslaw/",
  "lugar_nascimento": "Helensburgh, Dumbartonshire, Scotland",
  "lugar_morte": "Burradoo, Bowral, New South Wales, Australia",
  "biografia": "Horatio Carslaw\nwas the son of the Rev William Henderson Carslaw. He attended Glasgow Academy and entered Glasgow University in\n1887\nto study mathematics and physics. The breadth of his course in comparison to courses of today is shown by the fact that he also studied Latin, Greek, Moral Philosophy and Logic. He received his MA degree in\n1891\nwith First Class Honours in mathematics and physics.\nFrom Glasgow Carslaw went to Emmanuel College, Cambridge, where he graduated in\n1894\n. Returning to the University of Glasgow as a lecturer in\n1896\n, he made a visit to Göttingen during session\n1896\n-\n97\n, where he worked with\nSommerfeld\n, as well as visiting Rome and Palermo.\nIn\n1903\nCarslaw, then\n33\nyears old, moved from his native Scotland to Australia where he had been offered the Chair of Mathematics at the University of Sydney. He had some impressive supporters.\nThomson\ndescribed his teaching as follows:-\nHis zeal and high acquirements as a mathematician, and his personal qualities, render him, in my opinion, remarkably well fitted for mathematical teaching in universities ...\nThomson\nalso said he was:-\n... an enthusiast in original research, and having studied the mathematical papers and memoirs bearing on\nFourier's series\nand their application in mathematical physics, purposes writing a book on the subject.\nIt is doubtful whether his research record would put him in line for a chair today since before taking up the chair in Sydney he had published only four papers. However, he published two important books within three years of being appointed to Sydney. One was\nAn introduction to the\ninfinitesimal\ncalculus\npublished in\n1905\n. Deakin remarks in\n[\n4\n]\nthat the book was probably influenced by\nHardy\n's lectures, saying:-\n... it would be a brave historian indeed who saw Carslaw's 'little book' as being better than\nHardy\n's tome, and a downright foolish one to claim it as more influential, nevertheless it did come first.\nThe second book was\nIntroduction to the theory of\nFourier\n's series and integrals and the mathematical theory of the conduction of heat\n. This was to be the main area of Carslaw's research throughout his life. Jaeger in\n[\n5\n]\n,\n[\n2\n]\nand\n[\n6\n]\nclaims this book to be Carslaw's most important contribution but Deakin in\n[\n4\n]\nclaims it to be his later work on\nLaplace transforms\n. The fact that Jaeger himself collaborated with Carslaw on the\nLaplace\ntransform work may explain why there are differing opinions here.\nCarslaw married Ethel Maude Clarke from Rupertswood, Victoria, in\n1907\nbut, sadly, she died within a year of their marriage.\nJaeger and Carslaw published\nOperational methods in applied mathematics\nin\n1941\n. This put\nHeaviside\n's operational calculus on a rigorous footing following the approach proposed by\nGustav Doetsch\n. Deakin writes in\n[\n4\n]\n:-\nIn\n1935\n, the\nLaplace\ntransform was a topic of frontline research, by\n1955\nit was standard fare in undergraduate courses. No other advance has achieved such ready acceptance, and Carslaw and Jaeger's text can take a great deal of the credit.\nIn fact this text was published six years after Carslaw retired. His final work published in\n1947\nwas on income tax scales, one of the interests he had throughout his life\n[\n1\n]\n:-\nIn his old age he interested himself in formulas designed to help in the just and efficient collection of income tax.\nOther topics to interest Carslaw throughout his career, which we have not touched on above, included an interest in\nnon-euclidean\ngeometry,\nGreen\n's functions and the history of\nNapier\n's logarithms.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}