{
  "nome_completo": "Horace Lamb",
  "nome_curto": "Horace Lamb",
  "ano_nascimento": "1849",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lamb/",
  "lugar_nascimento": "Stockport, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Horace Lamb\n's father, John Lamb\n(\nborn in Huddersfield, Yorkshire about\n1813)\nwas the foreman of a cotton mill who had become well known for his improvements to spinning machines. His mother was Elizabeth Lamb\n(\nborn Hayfield, Derbyshire about\n1817)\n. John Lamb died when Horace was young and after his mother remarried, Horace went to live with Mrs Holland who was his mother's sister. She was kindly lady but nevertheless brought Horace up in a severe Puritan manner.\nHorace was educated at the Grammar School in Stockport. In\n1866\n, when Horace was only\n17\n, he won a scholarship to read classics at Queen's College, Cambridge but declined the scholarship to spend a year studying at Owens College, Manchester.\nIt was at Owens College that Lamb's interests turned firmly towards mathematics so that, when he entered Trinity College, Cambridge, the following year it was to study mathematics. Lamb was taught by\nStokes\nand\nMaxwell\nat Cambridge and graduated as Second\nWrangler\nin\n1872\n(\nmeaning that he was second in the ranked list of those students awarded a First Class degree\n)\n. The same year he was awarded a Smith's Prize and he was elected a Fellow and Lecturer at Trinity College.\nIn\n1875\nhe married Elizabeth Foot, who came from Dublin, and they had three sons and four daughters. In the same year he was appointed to the chair of mathematics at Adelaide, Australia, where he remained for\n10\nyears. Adelaide was extremely fortunate in their choice of Lamb as their first professor of mathematics and he rapidly built the reputation of the mathematics department there. His own reputation as a teacher at Adelaide was very high and he was described as a wonderful teacher who gave very clear, very lucid lectures.\nLamb left Australia in\n1885\n, accepting a chair at Victoria University in England\n(\nnow the University of Manchester\n)\n. In\n[\n5\n]\nhis influence on the mathematics department at Manchester is described:-\nUnder him it grew rapidly. His lecture courses were numerous, and his books provide a record of his methods. Many of his students were engineers, and they found in him a sympathetic guide, one who understood their difficulties and shared their interest in applications of mathematics to mechanics.\nDescribing his own teaching at the celebrations for his eightieth birthday, Lamb said:-\nI did try to make things clear, first to myself\n(\nan important point\n)\nand then to my students, and somehow to make these dry bones live.\nLamb held the chair at Manchester until\n1920\nwhen, at the age of\n70\n, he retired and moved to Cambridge. An honorary lectureship, the\nRayleigh\nlectureship, was specially created for him and he continued his research.\nLamb wrote important texts and made important contributions to applied mathematics, in particular to acoustics and fluid dynamics, for example\nMathematical Theory of the Motion of Fluids\n(1878)\n. His book\nHydrodynamics\n(1895)\nwas for many years the standard work on the subject. In his address to the\nBritish Association\nin\n1904\nhe explained his reasons for writing these books:-\nIt is ... essential that from time to time someone should come forward to sort out and arrange the accumulated material, rejecting what has proved unimportant, and welding the rest into a connected system.\nLamb's texts had a major role on teaching in British universities for many years.\nOther topics he worked on include wave propagation, electrical induction, earthquakes, aeronautics, and the theory of tides. He wrote important papers on the oscillations of a viscous spheroid, the vibrations of elastic spheres, waves in elastic solids, electric waves and the absorption of light. In a famous paper in the\nProceedings of the London Mathematical Society\nhe showed how\nRayleigh\n's results on the vibrations of thin plates fitted with the general equations of the theory. Another paper reported on his study of the propagation of waves on the surface of an elastic solid where he tried to understand the way that earthquake tremors are transmitted around the surface of the Earth. His view of science is explained in\n[\n3\n]\n:-\nThe primary aim of science in Lamb's view was to explore the facts of nature, to ascertain their mutual relations, and to arrange them so far as is possible in a consistent and intelligible way. ... The mathematician's task, to his mind, had an aesthetic character. He took delight in the comparison of a well-ordered piece of algebraic analysis with a musical composition, and bemoaned the passing of the scientific memoir, which in the hands of a\nLagrange\nor a\nPoisson\nhad a completeness and austerity of a great work of art.\nLamb wrote books in addition to those mentioned above, including\nInfinitesimal\nCalculus\n(1897)\n,\nDynamical Theory of Sound\n(1910)\n, and\nHigher Mechanics\n(1920)\n.\nLove\n, writing in\n[\n6\n]\n, describes his writing:-\nHis writings call up before one the picture of an extremely acute and wonderful alert mind, endowed with a profound knowledge of the facts of physics, especially on its dynamical side, keenly interested in the work of others, particularly when it had a bearing on any matter of mechanics or wave transmission, equipped with an exceptionally varied and powerful mathematical technique, and ever on the look-out for topics on which his analysis could be employed for the promotion of natural knowledge.\nElected to the\nRoyal Society\nin\n1884\n, he was a member of the Council of the Society and twice its Vice-President. He received the Royal Medal from the Royal Society in\n1902\nand in\n1923\nwas further honoured with the award of its Copley Medal. An extremely strong supporter of the\nLondon Mathematical Society\n, he served that Society as President in\n1902\n-\n04\nand received its\nDe Morgan\nMedal in\n1911\n.\nHe was honoured with memberships of many mathematical societies in Europe including the\nReale Accademia dei Lincei\n, and received the highest award of his country when he was knighted in\n1931\n. He received honorary doctorates from seven universities.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}