{
  "nome_completo": "Horst Tietz",
  "nome_curto": "Horst Tietz",
  "ano_nascimento": "1921",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tietz/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Hanover, German",
  "biografia": "Horst Tietz\n's father was Willi Hermann Tietz\n(1885\n-\n1944)\nand his mother was Amanda Cornils\n(1889\n-\n1944)\n. Willi Tietz had been born into a Jewish family but the family had converted to the Christian Evangelical Church. Amanda Cornils and Willi Tietz had met at a wedding reception in Marburg; they married in Hamburg on\n3\nApril\n1920\n. Willi Tietz owned a wood business which he had inherited from his father. In\n1927\nHorst and his parents moved to a new apartment in the Sievekingsallee district of Hamburg. The family of three were part of a large extended family and they kept in close contact with many of their relations as Horst grew up. In fact, although six years younger than his cousin Rolf Tietz, the two boys were close as they grew up. Horst, like his cousin, attended the Jewish elementary school of Ehepaars Moosengel in Papenstrasse in the Eilbek district of Hamburg. He sat the entrance examination to enter the Kirchenpauer-\nRealgymnasium\nand began his studies there.\nTensions arose in the family because the Cornils side were Aryan and the Tietz side Jewish. On\n1\nJanuary\n1930\n, Amanda's brother Walter Cornils joined the Nazi Party increasing the tensions between the two sides. Added to these difficulties was the severe economic problems. The Great Depression hit most countries world-wide and the German economy went into decline in\n1928\nand did not begin to recover until the autumn of\n1932\n. This depression caused major problems for Willi Tietz's wood business which hit desperate times. The problems suffered by Willi's brother Hermann were similar and he had to give up his pharmacy in Berlin in\n1935\n, and then, in total despair, he took his own life. Willi Tietz would probably have taken the same way out of his problems had it not been for the strong support he received from his wife Amada.\nIn the Hamburg Realgymnasium, mathematics was the subject Horst loved but his plans changed when World War II broke out. After graduating from school with his Abitur at Easter\n1939\n, Tietz was drafted into the Reichsarbeitsdienst\n(\nthe Reich Labour Service\n)\n. The Nazi government decreed that soldiers could take leave to continue their studies if they took courses in chemistry or medicine since these were considered war-related courses. He had no interest at all in medicine so, even though chemistry was not a subject he liked, he decided to enter university to study chemistry. At this time Hamburg University was closed, so he enrolled to study chemistry at the University of Berlin beginning his studies in January\n1940\n. In Berlin he was able to live with Meta Tietz, the widow of his uncle Hermann who had committed suicide. Although he had a Jewish background, he was allowed to enrol since his father had fought for Germany in World War I. Chemistry courses did not prove to be a great success for him and when Hamburg University reopened, he was able to begin studying mathematics there in January\n1940\n. He was taught by\nErich Hecke\n, who held the chair of mathematics, and by his assistant\nHans Zassenhaus\n. However, Tietz said he was always afraid of\nWilhelm Blaschke\n, another of his professors at Hamburg. We get an impression of the atmosphere at the university at the time when we read Tietz's descriptions of his student days. Tietz relates that all the lecturers began their lecture with a Nazi salute and \"Heil Hitler\"\n(\nwhich was compulsory\n)\nexcept for\nHecke\nwho gave a silent nod to the class before beginning his lectures. Tietz writes about being with a group of fellow students when they met\nHecke\nin the street\n(\nsee\n[\n5\n]\nor\n[\n1\n]\nfor slightly different versions\n)\n:-\nWhile coming from the Mathematics Department ... we overtook Professor\nHecke\n. There was a bone-rattling chill in the air and we were all heavily wrapped up. With a smart \"Heil Hitler, Herr Professor\" and quickly raised right arm, my fellow students passed the old gentleman. With an astonished-indulgent look,\nHecke\nglanced around him, raised his hat, lightly bowed, and said, \"Good morning, ladies and gentlemen\". After that I never heard the \"Germanic greeting\" from my fellow students.\nTietz's permission to attend university because of his father's service in World War I only lasted a year. He was expelled from Hamburg University by the Nazis in December\n1940\nand his cousin Rolf Christiansen petitioned the Chancellor of the University in an attempt to allow him to be reinstated. The petition was unsuccessful and Christiansen, who was serving in the German army, was punished by being demoted and sent to the Russian front where he was killed in February\n1942\n. Christiansen's mother took her own life on the day she learnt of her son's death. After Christiansen's petition failed, Tietz asked\nErich Hecke\nwhat he should do and was told to continue to attend lectures secretly\n[\n1\n]\n:-\nHecke\nsaid that naturally Tietz should come secretly to his mathematical lectures, also those of\nHans Zassenhaus\n... Tietz was somewhat afraid of\nZassenhaus\n, who always wore the insignia of a Nazi organisation, but Hecke calmed him by saying that\nZassenhaus\nwas their trusted agent who behaved in a politically correct manner so as to protect them. This in fact happened in\n1942\n, when somehow Tietz's presence as a secret student at the university became known and a denunciation was threatened:\nZassenhaus\nwarned Tietz, and\nHecke\nimmediately cancelled the class, giving back the student fees. In fact, Tietz only discovered much later that\nZassenhaus\nwas connected with a resistance effort that helped hide endangered people.\nIn March\n1942\nTietz reached the age of\n21\nand this allowed him to be registered as the new owner of his father's wood company. However, Tietz had no experience in that area at all and had never taken any interest in learning about this trade. Even before this the family realised the peril they were in since Tietz's aunt Dora, her husband Arnold and their daughter Anne Marie were deported to the ghetto of Minsk in November\n1941\n. In July\n1943\nHamburg was bombed, the Tietz home was destroyed and all their possessions were lost. Also the Tietz family were aware that the Gestapo were looking to arrest Willi Tietz. They decided to leave Hamburg and go to Marburg\n[\n3\n]\n:-\n... for no cogent reason other than that my parents had met each other here, and because my brother's friend, the future philosopher Gerd Guenther-Grey, was studying chemistry there.\nIn a letter written to Tietz in Marburg,\nErich Hecke\nsuggested that he make contact with\nKurt Reidemeister\nat the university.\nReidemeister\nhad been\nHecke\n's student while studying for his doctorate. However, he was unable to make contact with\nReidemeister\nbefore they were arrested by the Gestapo. In Marburg they lived in accommodation rented from a private landlady in the Upper Town. The rent had been set high by the landlady because she realised that the Tietz family were in danger of arrest. When they failed to keep up the high rent payments, the owner denounced the Tietz family as Jews to the Marburg Gestapo. On Christmas Eve in\n1943\nTietz, his father and his mother, were all arrested by the Marburg Gestapo. Pressure was put on Amanda Tietz, who was Aryan, to sign papers divorcing her husband - she refused. Willi Tietz attempted to commit suicide believing this would save his wife but his attempt failed. Willi, Amanda and Horst were brought to the district court prison in the Wilhelmstrasse and kept there in individual cells until\n6\nMarch\n1944\nwhen they were sent to the work camp at Breitenau. This camp was being used as a collection point for those in the area who were to be sent on to concentration camps. At Breitenau, Tietz and his father were forced to undertake agricultural work.\nHorst Tietz tried hard to take care of his father who became seriously ill. On\n22\nApril\n1944\n, Horst was allowed to join his father in a cell which was also occupied by eight other prisoners. On his way to this cell he saw a woman with a shaven head who was crying and shouting to him. It was his mother on her way to the transport to take her to the camp at Ravensbrück - he never saw her again. His father died in his arms in the morning of the next day and he later learnt that his mother died at Ravensbrück on\n6\nJune. Tietz was transferred from Breitenau, first to a police cell in Leipzig, then on\n2\nMay to Fürstenberg in Mecklenburg where the Ravensbrück concentration camp was situated, and finally to the Buchenwald concentration camp near Weimar. On\n4\nApril\n1945\nthe US\n89\nth\nInfantry Division liberated a small subcamp of Buchenwald and on\n8\nApril the Germans began to evacuate the prisoners from the main camp. Thousands were forced to join evacuation marches but Tietz was still in the camp when it was liberated by the US Third Army on\n11\nApril. The soldiers were given a hero's welcome by the emaciated inmates. We note that, in the mid\n1950\ns,\nLudwig Bieberbach\ncame to Tietz in tears saying that he had not known before about the true conditions in the concentration camps or about the German death camps in Poland.\nTietz returned to Marburg to try to restart his undergraduate studies but quickly moved to Hamburg. He wrote\n[\n5\n]\n:-\nI first made my way with difficulty to Marburg, but then to Hamburg, because there the university already started to function again on\n6\nNovember\n1945\n.\nErich Hecke\n, although he was mortally ill, lectured on Linear Differential Equations. Nowadays we cannot comprehend the situation - how hungrily the emaciated figures with their clothes in tatters followed the fascinating lecture in an atmosphere charged with tension.\nHecke\ncombined warmth with dignity, and thus revived an image of humanity that had become deformed during the Nazi era.\nAt Hamburg he was able to attend courses and also take part in\nHecke\n's seminar. He met Lotti whom he later married. He learnt much from both\nHecke\nand\nZassenhaus\nbut by the summer of\n1946\nHecke had become too ill to lecture and\nZassenhaus\nwas preparing to emigrate. Tietz decided to return to Marburg\n[\n8\n]\n:-\nThe war was over. In the four occupation zones life was stirring. Many universities opened their doors again. The Philipps University of Marburg began operating again in the year\n1945\n-\n46\n. Because the city had been largely spared from the destruction of war, it exerted a strong attraction to streams of people returning home, refugees and the homeless who crisscrossed the country. The student body that expectantly filled the lecture rooms was accordingly very mixed: the students from Marburg, who still had the background of a family and had just come from school, were in stark contrast to these people, who were visibly in a terrible state.\nKurt Reidemeister\nwas the only Professor of Mathematics and he had the help of Associate Professor Maximilian Krafft\n(1893\n-\n1971)\n. The other person, who only held an assistant's position, was Herbert Grötzsch\n(1902\n-\n1993)\n. He had been a student of\nPaul Koebe\nand on the staff at Giessen. However, Giessen was not operating, so Grötzsch taught at Hamburg but was paid so little that he could neither feed nor clothe himself properly. However\n[\n8\n]\n:-\nWithout Grötzsch mathematics teaching would have collapsed: he was tirelessly active and approachable.\nTietz suffered serious health problems, particularly with his stomach and kidneys, which resulted from his time in the concentration camp. It was the care that he received from his wife Lotti that helped him recover his health during these years. We note that the Tietz family eventually became larger with the birth of two daughters. He took the State Examination in\n1947\n. It required three subjects and he had chosen mathematics, physics and chemistry. However, his practical abilities in chemistry were very poor so when applied mathematics became a possible subject, he quickly changed to take the examination in that topic. He was examined in mathematics by Krafft and Grötzsch while in physics Erich Hückel was the examiner. After the examination Hückel asked Tietz if he would take a position as his assistant. Hückel said he understood the physics but thought that Tietz would be a good assistant to help him with the mathematics. Tietz held this position for three years while he worked for his doctorate advised by Maximilian Krafft. He was awarded the degree in\n1950\nby the Philipps-Universität Marburg for his thesis\nFabersche Entwicklung auf geschlossenen Riemannschen Flächen\nⓉ\n(\nFaber's development of closed Riemann surfaces\n)\n. After his\nhabilitation\nin Brunswick, in\n1956\nhe was appointed as a lecturer in the University of Münster, where\nHeinrich Behnke\nhad built a school of function theory. The other professor at Münster was\nHans Petersson\n. Tietz taught at Münster until\n1962\nwhen he was appointed as professor of mathematics at the University of Hanover. From\n1962\nuntil his retirement in\n1989\n, Tietz held this professorship, being Dean on several occasions.\nWe now look briefly at some of the papers that Tietz published before his habilitation.\nDie klassische Mechanik als Transformationstheorie\nⓉ\n(\nClassical mechanics as transformation theory\n)\n(1951)\ngives a clever demonstration that Hamiltonian theory can be completely described by canonical transformations. In the same year he published\nEine Rekursionsformel der Faberschen Polynome\nⓉ\n(\nA recurrence for Faber's polynomials\n)\nwhich presents a recursion formula for\nFaber\npolynomials. In\nFabersche Entwicklungen auf geschlossenen Riemannschen Flächen\nⓉ\n(\nFaber's developments on closed Riemann surfaces\n)\n(1952)\nTietz describes a system of functions that play a similar role on a closed\nRiemann\nsurface to that played by the\nFaber\npolynomials in plane regions. In\nBeweis der Konvergenz eines Verfahrens von W Bartky zur Berechnung von bestimmten Integralen\nⓉ\n(\nEvidence of the convergence of a method of W Bartky to calculate definite integrals\n)\n(1952)\n, Tietz discusses Walter Bartky's method for the evaluation of certain definite integrals. The\n1953\npaper\nDie Kinematik des starren Körpers\nⓉ\n(\nThe kinematics of the rigid body\n)\nwas a joint work with Rudolf Iglisch in which the authors derive\nEuler\n's equation in kinematics by means of vector algebra. Tietz introduces a new aspect of the theory of conformal mapping in\nZur Realisierung Riemannscher Flächen\n(1955)\n. In\nEine Normalform berandeter Riemannscher Flächen\nⓉ\n(\nA normal form for deterministic Riemann surfaces\n)\n(1955)\nTietz proves the theorem:-\nAny open\nRiemann\nsurface of finite genus which has\nn\nn\nn\nnon-degenerate boundary components can be mapped conformally onto a\nRiemann\nsurface consisting of a number of full planes and\nn\nn\nn\nunit disks.\nWe should also mention the textbooks that Tietz published.\nLineare Geometrie\nⓉ\n(\nLinear Geometry\n)\n(\nfirst edition\n1967\n, second edition\n1973)\nwas a text based on lecture courses that Tietz had given on analytic geometry. The first chapter gives the geometrical background. In the second chapter the concepts of semigroup, group, ring and skew fields precede the definition of a left vector space. Then the standard results on linear dependence, bases, dimension etc. are given. The third chapter studies subspaces, direct sums, quotient spaces, dual spaces etc. The theory of linear transformations is discussed in Chapter\n4\nbefore studying a unified treatment of real and complex inner product spaces in Chapter\n5\n. The final chapter looks at affine spaces.\nHe also contributed to a two-volume encyclopaedia of mathematics published in\n1965\n, and the two-volume introduction to mathematics for engineers\n(1979\n-\n1980)\n. The chapters are:\n1\n. Figures and functions;\n2\n. Linear geometry;\n3\n. Elementary functions;\n4\n. The analytical calculus;\n5\n. Applications of analysis;\n6\n. Series expansions;\n7\n. Differential equations;\n8\n. Multidimensional analysis.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}