{
  "nome_completo": "Howard Hathaway Aiken",
  "nome_curto": "Howard Aiken",
  "ano_nascimento": "1900",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aiken/",
  "lugar_nascimento": "Hoboken, New Jersey, USA",
  "lugar_morte": "St Louis, Missouri, USA",
  "biografia": "Howard Aiken\n's parents were Daniel H Aiken\n(\nborn about\n1870)\nand Margaret Emily Mierisch\n(1874\n-\n1961)\n. Daniel Aiken came from a wealthy Indiana family but, sadly, he was addicted to alcohol and this led to the family problems that we describe below. Margaret Mierisch was the daughter of German immigrants who had settled in the United States. Daniel and Margaret Aiken were married on\n16\nMay\n1899\nin Manhattan. Their only child was Howard Aiken, the subject of this biography. The family lived in Hoboken until around\n1911\nwhen Howard, his parents and his maternal grandparents all moved to Indianapolis, Indiana. There he attended Arsenal Technical High School which was founded in\n1912\n. This school is so named because the buildings were originally a U.S. Government arsenal but, when they became obsolete for that purpose, they were converted into the third public high school in Indianapolis.\nNow Aiken's time at the Arsenal Technical High School was soon interrupted. His father had, as we mentioned above, a drink problem and when drunk he would abuse Margaret, Aiken's mother. When one such episode occurred around\n1912\n, Aiken picked up the poker from the fireplace and drove his father out of the house. Daniel Aiken never returned and his parents, Aiken's paternal grandparents, would have nothing further to do with Aiken and his mother. After Aiken had completed the eighth grade at the school, when he was around\n14\nyears old, he had to leave in order to earn money to support his mother and his maternal grandparents. He took a job installing telephones in Indianapolis but he continued his education by taking correspondence courses. His teachers at the Arsenal Technical High School were well aware of Aiken's potential, particularly in mathematics, and one of the teachers went to see Margaret Aiken to try to persuade her to let her son return to the high school. Aiken's mother could not allow this since her son was providing the only income for the family. However, the teacher persisted and found a job for Aiken with the Indianapolis Light and Heat Company which involved night work. He was then able to attend the High School during the normal daytime hours.\nThe work with the Indianapolis Light and Heat Company was as a switchboard operator, a job that bored Aiken so much that he took up knitting socks to pass the time. It is not unreasonable to ask how Aiken could work both day and night but, being young and able to get by with a few hours sleep, allowed him to succeed. He completed his studies in\n1918\nand was among the first students to graduate from the High School. This was only achieved with the help of the Principal of Arsenal Technical High School, Milo H Stewart. Because of his interrupted studies, Aiken did not have the necessary number of credits to graduate but Stewart set a special examination for him to give him the extra credits. Stewart also assisted Aiken in applying for a job and this led to an offer from the Madison Gas and Electric Company. Aiken and his mother moved to Madison so that he could take up the job as a nighttime telephone operator working from\n4\npm to midnight. This enabled him to enroll as a student in electrical engineering at the University of Wisconsin, Madison. During his undergraduate studies he also worked as an assistant to the professor of physics. Aiken, however, was extremely poor throughout his undergraduate years. He had found an apartment for his mother to live in and he shared with two or three other students. He did not enjoy certain aspects of his undergraduate course. He said many years later\n(\nsee\n[\n2\n]\n)\n:-\nI only wish that as an undergraduate I\n[\nhadn't\n]\nwasted my time on mechanical drawing, machine shop, and other tommy-rot required of a freshman in a conventional engineering school.\nAfter obtaining a first degree from the University of Wisconsin, Aiken continued to work for the Madison Gas and Electric Company as an:-\n... electrical engineer responsible for design and reconstruction of the company's electrical generating station.\nHe had been promoted to Chief Engineer after receiving his degree. He spent four years in this post during which time he:-\n... completely redesigned and rebuilt the electrical equipment in the company's power house, supervised the construction of a three million cubic foot gas holder, and made many other improvements in the company's gas works.\nHe left Madison in\n1927\nand moved to Chicago when he was appointed as a general engineer in the Central Station Division of the Westinghouse Electrical and Manufacturing Company. His work was mainly involved in designing electric generation stations. At this time he told his friends that he wanted to study more mathematics and was considering further studies in the topic. However, looking for a better salary, he accepted the post of district manager of the Line Material Company in Detroit, Michigan in\n1931\n. The better salary did not compensate for the fact that now he was no longer involved in scientific work. He only spent a year in that post before entering the University of Chicago in\n1932\nas a graduate student in physics. However, he did not like the programme of study that Chicago suggested and, quite soon after he had begun the course, he spoke to one of the professors and asked for advice. It was suggested to him that he would prefer the research topics that interested the Harvard professors. After only part of a year at Chicago, Aiken transferred to the Graduate School of Arts and Sciences at Harvard in\n1933\n. His mother moved to Cambridge, Massachusetts, and soon they had an apartment at\n8\nPlympton Street.\nAiken was\n33\nyears old when he began his graduate studies at Harvard. He struggled to fit in with the physics programme but things improved markedly when Emory Leon Chaffee\n(1885\n-\n1975)\nbecame his thesis advisor. Aiken was awarded an A.M. in physics in June\n1937\nand obtained a doctorate from Harvard in February\n1939\nfor his thesis\nTheory of space charge conduction\n. He was appointed as a Faculty Instructor\n(\nthe Harvard equivalent of Assistant Professor\n)\nin Physics and Communication Engineering at Harvard in September\n1939\n. In his first year in that role he taught the Applied Mathematics course. Aiken married Louise T Mancill in\n1939\n; they had one daughter Rachel but they were divorced in\n1942\n. Louise had been born around\n1907\nin Philadelphia to Horace L Mancill and his wife Rachel Townsend.\nWhile he was a graduate student and an instructor in the Department of Physics at Harvard, Aiken began to make plans to build a large computer. These plans were made for a very specific purpose, for Aiken's research had led to a system of differential equations which had no exact solution and which could only be solved using numerical techniques. However, the amount of hand calculation involved would have been almost prohibitive, so Aiken's idea was to use an adaptation of the punched card machines which had been developed by\nHerman Hollerith\n.\nAiken wrote a report on how he envisaged such a machine, and in particular he described how a machine designed to be used in scientific research would differ from a punched card machine. He listed four main points\n[\n6\n]\n:-\n... whereas accounting machines handle only positive numbers, scientific machines must be able to handle negative ones as well; that scientific machines must be able to handle such functions as logarithms, sines, cosines and a whole lot of other functions; the computer would be most useful for scientists if, once it was set in motion, it would work through the problem frequently for numerous numerical values without intervention until the calculation was finished; and that the machine should compute lines instead of columns, which is more in keeping with the sequence of mathematical events.\nThe report was sufficient to prompt senior staff at Harvard to contact IBM and an agreement was made that Aiken would build his computer at the IBM laboratories at Endicott, helped by IBM engineers. Working with three engineers, Aiken developed the ASCC computer\n(\nAutomatic Sequence Controlled Calculator\n)\nwhich could carry out five operations, addition, subtraction, multiplication, division and reference to previous results. Aiken was much influenced in his ideas by\nBabbage\n's writings and he saw the project to build the ASCC computer as completing the task which\nBabbage\nhad set out on but failed to complete.\nThe ASCC had more in common with Babbage's analytical engine that one might imagine. Although it was powered by electricity, the major components were electromechanical in the form of magnetically operated switches. It weighed\n35\ntons, had\n500\nmiles of wire and could compute to\n23\nsignificant figures. There were\n72\nstorage registers and central units to perform multiplication and division. To gain an idea of the performance of the machine, a single addition took about\n6\nseconds while a division took about\n12\nseconds. The ASCC was controlled by a sequence of instructions on punched paper tapes. Punched cards were used to enter data and the output from the machine was either on punched cards or produced by an electric typewriter.\nThe work by Aiken on the computer was interrupted by World War II. During World War II, Aiken was a Lieutenant Commander in the Navy and taught at the Naval Mine Warfare School. He was later promoted to  Commander. Robert Campbell spoke about the difficulties caused by the war in\n[\n5\n]\n:-\nSo we were in New York over Christmas holidays in\n1941\n. I got a call from a faculty member at Harvard I didn't know by the name of Howard Aiken. He wanted to see me. So we met in Grand Central Station. He was on his way to Yorktown, Virginia where he was teaching magnetic mine technology. He was a Lieutenant Commander in the Navy, later a Commander, and was teaching in the Naval Mine Warfare School. We met in Grand Central Station. He told me about the computer. He called it \"Calculator\". It was a large scale calculator which he had conceived and was being built at IBM. Then he had been called up by the Navy. He was in Naval Reserve, and wasn't able to continue working with IBM during the final stages of design. The machine construction was well along. Some aspects of the design were still incomplete, especially those relating to the LOG, EXP and SIN functions. He told me Harvard needed someone to continue the liaison with IBM. This sounded sort of intriguing so I said I'd do it, after perhaps about an hour's conversation. I had never met him before. He had picked my name out of a file at the physics laboratories.\nHaving completed construction of ASCC in\n1943\nit was decided to move the computer to Harvard University where it began to be used from May\n1944\n.\nGrace Hopper\nworked with Aiken from\n1944\non the ASCC computer which had been renamed the Harvard Mark I and given by IBM to Harvard University. The computer figured highly in the Bureau of Ordnance's Computation Project at Harvard University, to which\nHopper\nhad been assigned, being used by the US navy for gunnery and ballistics calculations. Hopper described her first meeting with Aiken: see\nTHIS LINK\n.\nA picture of Aiken's Mark I machine is at\nTHIS LINK\n.\nRichard Bloch also worked with Aiken at Harvard on the ASCC. Speaking of Aiken he said\n[\n3\n]\n:-\nI think that Howard Aiken accomplished a great deal at a time when the tools were few and far between. He clearly came up with a machine, and probably the first machine really that could be called a computer today, one which was essentially automatically sequenced. He also should be given a great deal of credit for concentrating on what the machine did and for whom it did it and the accuracy with which it did it. ... He certainly was, as far as I am concerned, a great pioneer, a tough task master. I remember that he'd come in at any hour of the morning or night and sometimes he'd show up at four in the morning. I might be there trying to get some bug out of the machine. And he'd show up having had, I don't know, three or four hours of sleep and his comment was \"are we making numbers?\" That was a favourite expression, \"are we making numbers?\" His big satisfaction, once the machine was designed was to see this output coming forth. ... He had a way about him which either endeared him to somebody or made him absolutely ferocious.\nAiken was married for a second time in January\n1943\n. His wife Agnes Montgomery, known as Monty, was a high school teacher who taught Latin and French. Howard and Agnes Aiken had one daughter, Elizabeth. Monty had studied at Radcliffe College of Harvard University. Howard and Agnes were divorced in\n1961\n.\nIn\n1946\nAiken and\nHopper\npublished three joint papers with the title\nThe automatic sequence controlled calculator\n. These were translated into Russian and published two years later. Also in\n1946\nAiken published\nA Manual of Operation for the Automatic Sequence Controlled Calculator\n. John Lee writes\n[\n17\n]\n:-\nAiken's\n1937\nproposal for a calculating machine began with a series of paragraphs devoted to an account of the pioneers in machine calculation:\nPascal\n, Moreland,\nLeibniz\n, and, above all,\nBabbage\n. This same historical homage characterizes the series of articles\n[\nwith\nGrace Hopper\n]\nin 'Electrical Engineering' in\n1946\n. The whole of the first chapter of the 'Manual of Operations' for Mark I was a historical chronicle, stressing the work of\nCharles Babbage\n; one of the illustrations even showed a set of calculating wheels from\nBabbage\n's never-completed Difference Engine.\nYou can read an excerpt from the Introduction to a reprint of this Manual at\nTHIS LINK\n.\nAiken completed the Harvard Mark II, a completely electronic computer, in\n1947\n. He continued to work at Harvard on this series of machines, working next on the Mark III and finally the Mark IV up to\n1952\n. Aiken described the Mark IV in the paper which he wrote in French:\nLe calculateur Mark IV\n(1953)\n. He not only worked on computer construction, but he also published on electronics and switching theory.\nIn\n1961\nAiken retired from Harvard and was appointed as Distinguished Professor of Information at the University of Miami at Fort Lauderdale. Aiken did not teach at the University of Miami but rather became a businessman starting up\nHoward Aiken Industries Incorporated\n, a New York consulting firm. He married Mary McFarland in\n1963\n. Mary had been an elementary school teacher in Boston. Richard Bloch spoke about the later part of Aiken's life\n[\n3\n]\n:-\nI saw him before his death fairly frequently. He had interests in some new developments, interestingly enough in miniaturization of computers for home use and so on. He foresaw the advantages of having not only mini-circuits, but mini-input and mini-output devices. He was talking to me about even setting up some companies to probe this and move into this area at the time. So he kept his aggressive thinking in the field going all the way really to his death. He was a man that kept up with the field all the way through and to his last days was still conjuring up new ideas.\nIn\n1964\nAiken received the Harry M Goode Memorial Award, a medal and $\n2\n,\n000\nawarded by the Computer Society:-\nFor his original contribution to the development of automatic computers that led to the first large-scale, general-purpose, automatic digital computer ever to be put in operation; for his continuous work in the field of digital computers as an engineer; and for the knowledge and inspiration imparted to many as a teacher.\nThis was one of many honours which Aiken received for his pioneering work on the development of computers. These awards were from many countries including the United States, France, The Netherlands, Belgium, and Germany. For example he received the Navy Distinguished Public Service Award from the United States, Chevalier, Legion of Honour, and Palmes de l'Academie Francais from France, Officer's Cross of the Order of the Crown from Belgium, and an honorary degree from Technische Hochschule, Darmstadt, Germany.\nHe received the John Price Wetherill Medal from the Franklin Institute in\n1964\nand the IEEE Edison Medal in\n1970\n:-\n... for a meritorious career of pioneering contributions to the development and application of large-scale digital computers and important contributions to education in the digital computer field.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}