{
  "nome_completo": "Hugh Blackburn",
  "nome_curto": "Hugh Blackburn",
  "ano_nascimento": "1823",
  "ano_morte": "1909",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Blackburn/",
  "lugar_nascimento": "Craigflower, Fife, Scotland",
  "lugar_morte": "Roshven, Loch Ailort, Scotland",
  "biografia": "Hugh Blackburn\n's mother was Rebecca Leslie Gillies, the daughter of a Church of Scotland minister, and a relative of\nColin Maclaurin\n. His father was John Blackburn, a Glasgow sugar merchant, who was a wealthy man having made his fortune in Jamaica. John had built an impressive mansion house, Killearn House, north of Glasgow in the valley of the river Blane running between the Campsie Fells and the Kilpatrick Hills. The house stands close to where the Blane runs into Endrick Water which in turn drains into Loch Lomond about\n10\nkm north west of the house. It is situated in a beautiful country spot yet within easy access of Glasgow - an ideal place to bring up a large family and entertain a wide circle of friends.\nHugh was the seventh of his parents eight children. We have mentioned the visitors to Killearn House when Hugh was growing up, and among these we must note in particular the Wedderburn family. Isabella Clerk, the sister of\nJames Clerk Maxwell\n's father, had married James Wedderburn, Solicitor General for Scotland, and they had a daughter Jemima Wedderburn who was an outstanding artist.\nJames Clerk Maxwell\nwas about eight years younger than Hugh, but Jemima Wedderburn was almost exactly the same age. Hugh was a serious boy, interested in mathematics and science, who loved conducting scientific experiments. He avidly read\nCharles Hutton\n's\nMathematical Recreations\nfrom which he acquired a love of the subject. Hugh and Jemima became childhood sweethearts.\nFrom\n1831\nuntil\n1836\nBlackburn attended the Edinburgh Academy then continued his education at Eton. He continued his high quality education by entering Trinity College, Cambridge, in\n1841\nwhich was the same year as\nWilliam Thomson\n. The two were soon close friends\n[\n1\n]\n:-\nIn the middle of winter they went outdoor swimming together and spent evenings reading Faust. In Blackburn's rooms they swung on 'Blackburn's pendulum', an ingenious device with a double suspension, which could oscillate in planes at right angles to each other.\nIn the Mathematical Tripos examinations of\n1845\nThomson\nwas second\nWrangler\nand Blackburn was fifth wrangler\n(\nfifth place in the list of those obtaining a first class degree\n)\n. After graduating the two friends set out for Paris where they studied mathematics together. In the year following his graduation Blackburn was elected to a fellowship at Trinity College, but at this stage his intention was to follow a career in the law and he was admitted at the Inner Temple on\n2\nNovember\n1847\n. A common career route for many high Wranglers at this time was to enter the legal profession, and Blackburn's older brother Colin Blackburn was already a star of that profession.\nThomson\n, however, strongly encouraged Blackburn to enter the academic profession.\nThomson\n's father,\nJames Thomson\n, was professor of mathematics at Glasgow and\nThomson\nhad written to his father following the Mathematical Tripos in the hope that his friend might obtain a professorship at a Scottish university:-\nI wish you could hear of a professorship for him at a Scotch University. I think if there were any more professorships in Natural Philosophy he would answer exceedingly well.\nWhen\nJames Thomson\ndied on\n12\nJanuary\n1849\nduring a cholera epidemic, the chair of mathematics at Glasgow became vacant. Blackburn was appointed to the chair, with a strong recommendation from\nCayley\n, and took up his duties on\n23\nApril\n1849\n. He withdrew from his legal training a couple of weeks later; he was never called to the bar. On\n12\nJune\n1849\nBlackburn married his childhood friend Jemima Wedderburn. Rather surprisingly Blackburn's elder brother Peter Blackburn married Jean Wedderburn, an elder sister of Jemima. Hugh and Jemima had four children; William\n(\nnamed after his god-father\nWilliam Thomson\n)\n, Margaret, Hugh, and Alan. The newly married couple Jemima and Hugh had few friends in Glasgow, as Jemima recalled:-\n... except for\nWilliam Thomson\n, who was our greatest friend. He was like a brother to us.\nIn\n1855\nthe Blackburns built Roshven House on the south shore of Loch Ailort which is a sea loch on the west coast of Scotland. The remote situation of the house is in spectacular scenery with the mountains of Moidart to the east and south, with the costal road to the north ending at Mallaig where one can sail to the Isle of Skye. It was a wonderful spot in which the Blackburns would spend most summers\n[\n1\n]\n:-\nIt became a meeting place for many notables in the sciences and the arts .... Sailing from Skye on one occasion,\nThomson\ntook his yacht Lalla Rookh to Loch Ailort in the company of\nHermann von Helmholtz\n, who was impressed by the friendly and relaxed atmosphere of the Blackburns' home. Around their dinner table could be found all shades of political and religious affiliation. Hugh was a devout Christian and apolitical, while Jemima's atheism was coupled with a stout defence of Disraeli's brand of toryism. ... The Blackburns were prodigious travellers: Algeria, Spain, Italy, Corfu, Greece, and Iceland\n(\nin the company of Anthony Trollope\n)\nwere all visited, where their largely unplanned expeditions progressed at a leisurely pace.\nThe Blackburns were famous, particularly Jemima who John Ruskin described as:-\n... the best artist I know.\nHer watercolours were, and remain, famous, and she is recognised as a leading illustrator of her age. The Blackburn' homes in Glasgow and on Loch Ailort were regularly visited by some of the leading figures of the day including John Ruskin, Sir John Everet Millais, Anthony Trollope, the Duke of Argyll, Benjamin Disraeli, Lord Lister,\nHermann von Helmholtz\n,\nWilliam Thomson\nand\nJames Clerk Maxwell\n.\nAt this point one might expect that we would detail some of Blackburn's contributions to mathematics. However, this is not easy to do as he published little\n(\nin fact just one paper on astronomy while at Cambridge\n)\n. There is no doubt that he was an excellent mathematician who was highly regarded by\nThomson\nand frequently consulted by him. However he was a major figure in the development of the University of Glasgow, both in terms of his successful leading a flourishing mathematics department and in terms of wider university administration which he undertook with enthusiasm. As a teacher of mathematics he had great talents and he presented his subject with great skill. However he seems to have been unable to control the large classes of students who flocked to his lectures\n[\n1\n]\n:-\nHis explanations were models of logical exposition and he presented them with the lucidity of a cultured man, but in his boisterous lecture room this mastery often counted for little. As the air grew thick with flying paper darts, Blackburn retreated to his chair hoping for calm but powerless to effect it.\nMacRobert\nwrites\n[\n4\n]\n:-\nBlackburn's outlook was conservative, and he was a strong champion of the rights of the Faculty as against the other professors. ... During his time attendance on classes in Mathematics became compulsory for candidates for degrees in Arts.\nHe continued as a major figure in Glasgow University until he was forced to retire in\n1879\nafter becoming progressively more deaf. Since one of his favourite pastimes had been to listen to music, this was a particularly harsh blow. He enjoyed thirty years in retirement living at the remote Roshven House spending his days reading and enjoying photography.",
  "math_areas": []
}