{
  "nome_completo": "Conel Hugh O'Donel Alexander",
  "nome_curto": "Hugh Alexander",
  "ano_nascimento": "1909",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alexander_Hugh/",
  "lugar_nascimento": "Cork, Ireland",
  "lugar_morte": "Cheltenham, England",
  "biografia": "Hugh Alexander\n's parents were Hilda Barbara Bennett, who came from Birmingham, and Conel William Long Alexander, who was professor of engineering at University College, Cork. Hugh was the eldest of his parents four children. When he was eleven years old his father died and his mother returned to her home town of Birmingham with the family. There Hugh attended King Edward's School where he showed remarkable talent for mathematics and for chess. He won the British Boys' Chess Championship in\n1926\n. He also won a mathematics scholarship for Cambridge and in\n1928\nhe entered King's College, Cambridge.\nAt Cambridge Alexander continued to divide his time between his chess and his study of mathematics. He was playing on the top board for Cambridge University with outstanding success by the time he was sitting the Mathematical Tripos in\n1931\n. His performance in that examination was excellent but he missed out on the award of a fellowship which would have allowed him to continue to undertake mathematics research.\nHardy\nknew that, but for the time he devoted to chess, he would have easily made his mark as a research mathematician.\nHardy\ndescribed Alexander as\n[\n1\n]\n:-\n... the only genuine mathematician he knew who did not become a professional mathematician.\nAlexander was appointed as a mathematics teacher at Winchester in\n1932\n. He married Enid Constance Crichton Neate, the daughter of a sea captain, on\n22\nDecember\n1934\n. They had two sons.\nBeing a mathematics teacher certainly allowed Alexander to play chess at the highest level. He was placed second in the British Chess Championship of\n1932\n. In\n1934\nhe took part in the Nottingham International Chess Tournament which was played at the University of Nottingham. The top tournament comprised of eleven leading international players, including four world champions, and four British players.\nEuwe\nand\nLasker\n, two chess playing mathematicians with biographies in this archive, played. It was too strong a field for Alexander to excel at this point in his career but he did have victories over Flohr and Tartakover. Watts writes\n[\n3\n]\n:-\nAlexander was perhaps the surprise of the English contingent, and the good impression he made has since been more than confirmed in the Stockholm Team Tournament. He has shown himself able to devise attacking combinations and ideas that escape the most wary and the strongest of the masters, and a little more experience should put him in the front rank and once again place British Chess on the map.\nIndeed Alexander gained this experience and in\n1938\nhe won the British Chess Championship and came equal second with Paul Keres in the Hastings Christmas International Congress. It was in\n1938\nthat he left his job as a mathematics teacher to take up the position of head of research in the John Lewis Partnership, London. He was captain of the English team at the International Team Tournament in Benos Aires in\n1939\n, and in fact the tournament was only half completed when news reached Buenos Aires that World War II had begun. Alexander did not remain to complete the tournament but immediately caught a boat back to England to offer to serve his country.\nIt was now that Alexander's mathematical and problem solving abilities were put to full use. In February\n1940\nhe was sent to Bletchley Park where he joined Hut\n6\nat the Government Code and Cypher School. Here he worked on decoding messages sent through army and air force Enigma machines, then in March\n1941\nhe moved to Hut\n8\nas second in command to\nTuring\n. Alexander and\nTuring\nworked on decoding naval Enigma messages, and by August they had solved the Kriegsmarine cipher\n(\nsee\n[\n4\n]\n)\n. However, much time was still required to decode the messages and in October\nTuring\nand Alexander appealed directly to Winston Churchill for some junior assistants. Although\nTuring\nwas the head of Hut\n8\n, Alexander soon slotted into this role since he was an outstanding administrator while\nTuring\nwas uninterested in organisational matters. When\nTuring\nwent to the United States in November\n1942\n, Alexander became the official head. His colleagues appreciated his leadership describing him as:-\n... a quite splendid head of Hut\n8\nand\n... a model manager\n[\nwho\n]\ntreated us cryptographers as colleagues and was remarkably tolerant of our foibles.\nHe made many outstanding contributions to the decoding work at Bletchley Park, devising new Bayesian scoring methods which became necessary since the Germans, realising that their code was being broken, continued to increase its complexity.\nAfter the end of World War II, Alexander returned to his position as head of research at the John Lewis Partnership, but quickly realised that code breaking was a far more exciting occupation. In the summer of\n1946\nhe joined GCHQ\n(\nGovernment Communications Headquarters\n)\n, an organisation based on the teams at Bletchley Park. He became Head of Section H\n(\nthe cryptanalysis section\n)\nin\n1949\nand remained with GCHQ as Head of Section H until he retired in\n1971\n. In fact he was offered promotion at GCHQ but refused, and he was also offered a leading position by NSA, the equivalent organisation to GCHQ in the United States, and again refused but only after being seriously tempted to accept.\nWorld War II put an end to any chances that Alexander might have had at becoming World Chess Champion. Mikhail Botvinnik, who was World Chess Champion during\n1948\n-\n57\n,\n1958\n-\n60\nand\n1961\n-\n63\n, wrote:-\n... with his urge for overcoming and taming opposition, with his enthusiasm for uncompromising struggle, Alexander pioneered the way for British players to modern, complicated and daring chess; chess players will never forget him.\nIn fact Alexander did play chess at the highest level again after the war, winning the Hastings International Tournament in\n1946\nand coming first equal with David Bronstein in the Hastings Tournament of\n1953\n. He had victories over some of the top players in the world including Botvinnik,\nEuwe\nand Bronstein. He wrote chess columns for the Sunday Times, the Financial Times, the Evening News, and The Spectator. He was captain for the British Chess Federation and played in Olympiad competitions abroad, except when the competitions were in Eastern Europe. His job with GCHQ prevented him travelling to certain countries, for example he could not play in the\n1956\nOlympiad in Moscow.\nIt is interesting to note that, although he was born in Ireland, he played chess for England, something which was certainly noted when he played in the Dublin Zonal in\n1957\n. He did, however, indicate clearly that despite living most of his life in England, he considered himself Irish. He wrote in\n1957\n:-\nI do think of myself as an Irishman, not an Englishman, in spite of my long time here.\nIn\n[\n1\n]\nhe is described as follows:-\nAlexander was that rarest of men: a superbly skilled cryptanalyst who was also an excellent manager. He also combined a razor-keen intelligence with considerable energy and enthusiasm. His exceptional technical skills, and his gifts of leadership, man management, and administrative ability, made him an inspiring head of both Hut\n8\nat Bletchley and section H in GCHQ. He became an almost legendary figure to the intelligence communities of Great Britain and the USA. ... Hugh Alexander was a most vivid and attractive personality, who delighted his friends with his gaiety, humour, and warmth. A magnificent talker, he loved to argue but was ever ready to see his opponent's point of view.\nHe had wide interests including bridge, croquet and philately.\nFor his outstanding contributions to his country Alexander was awarded an OBE in\n1946\n, a CBE in\n1955\n, and a CMG in\n1970\n.",
  "math_areas": [
    "Combinatorics"
  ]
}