{
  "nome_completo": "Hyman Levy",
  "nome_curto": "Hyman Levy",
  "ano_nascimento": "1889",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levy_Hyman/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Wimbledon, London, England",
  "biografia": "Hyman Levy\n's father was  Marcus Levy\n(\nborn in Russia about\n1862)\nwho  was a picture frame maker and dealer in paintings in Edinburgh. His mother was  Minna Levy\n(\nborn in Germany about\n1864)\nwho was a draper. Hyman had two older siblings: Joseph\n(\nborn about\n1885)\n, Fanny\n(\nborn about\n1887)\n, and several younger siblings: Sophia\n(\nborn about\n1892)\n, Millie\n(\nborn about\n1894)\n, Morris\n(\nborn about\n1895)\n, and David\n(\nborn about\n1897)\n.\nHyman Levy was the third of eight children in the orthodox Jewish family. The actual date of his birth seems a little hard to determine, given as\n7\nMarch in\nWho's Who\nand one has to assume that Levy himself supplied this information. Yet Barnard in\n[\n2\n]\nclaims that although\n7\nMarch appears on his birth certificate this is incorrect and his actual date of birth was\n28\nFebruary.\nLevy attended George Heriot's School in Edinburgh, then entered the University of Edinburgh to study mathematics and physics. He graduated from Edinburgh in\n1911\nwith an M.A. with First Class honours and then won a Ferguson Scholarship, a\n1851\nExhibition and a Carnegie Research Fellowship which enabled him to undertake research at the University of Göttingen.\nIn\n1914\nwhen World War I broke out, Levy was in Göttingen working with\nHilbert\nand\nRunge\n. Escaping from Germany, he returned to England where he worked at the University of Oxford with\nA E H Love\nuntil\n1916\n. In\n1916\nLevy was honoured by being elected a fellow of the\nRoyal Society of Edinburgh\n. Then, between\n1916\nand\n1920\n, he worked as a member of the aeronautics research staff of the National Physical Laboratory.\nLevy left the National Physical Laboratory in\n1920\nand became an assistant professor of mathematics at the Royal College of Science of the Imperial College of Science and Technology, London. He was promoted to Professor of Mathematics three years later, then, in\n1946\n, he became Head of the Mathematics and Mechanics Department. Under his leadership the Department expanded greatly and he also provided leadership to the whole of the Royal College of Science, being its Dean from\n1946\nto\n1952\n. His contributions to Imperial College are noted in\n[\n1\n]\n:-\nHis presence in the council chamber will be remembered by many colleagues for his remarkable gift of quick appreciation and sensible comment; and his regular attendance at student gatherings, either as a lecturer or after dinner speaker, an art at which he excelled, will be long remembered with affection by generations of students.\nIn\n1954\nLevy retired and became Professor Emeritus but he agreed to continue to act as head of the mathematics department at Imperial College for one further year until\n1955\n.\nLevy's main work was in numerical methods, numerical solution of\ndifferential equations\n, finite\ndifference equations\nand statistics. As Barnard writes in\n[\n2\n]\n:-\nHe published books on these topics long before their importance, later taken for granted, was recognised in Britain.\nAmong Levy's most important mathematical books was\nAeronautics in Theory and Experiment\n(1918)\nwhich was\n[\n2\n]\n:-\n... perhaps the earliest text covering, at advanced level, the whole theory of aeroplane design and operation...\nAmong other mathematical works he published were\nNumerical Studies in Differential Equations\n(1934)\n,\nElements of the\nTheory of Probability\n(1936)\n, and\nFinite Difference Equations\n(1958)\n. However, Levy was more than a mathematician. He was a philosopher of science and also a political activist who\n[\n2\n]\n:-\n... strongly influenced by poverty and degradation he saw around him in childhood, ... devoted his life to the idea that science should be used to provide the basis of a full life for all humanity.\nHe expounded his materialistic philosophy in a number of books, the first being\nThe Universe of Science\n(1932)\n. He was a political activist in the Labour Party in the\n1920\ns. His advice was followed and the Labour Party set up a Science Advisory Committee which Levy chaired from\n1924\nto\n1930\n. In\n1931\nhe moved further to the political left, becoming a member of the British Communist Party. He visited Moscow in\n1956\nas a member of a British Communist Party Delegation with the remit of investigating\n[\n1\n]\n:-\n... reports that Jewish writers, artists and intellectuals had been tortured and killed and Jewish culture suppressed.\nThe persecution of Jewish intellectuals in Russia which he found in the investigation appalled Levy. Rather than resign from the British Communist Party, Levy attacked the leadership of his own Party demanding to know whether they had been aware of the treatment of the Jews in Russia. He wrote an exposure in the communist weekly\nWorld News\nin January\n1957\n. Later that year he published a book\nJews and the National Question\n. A review by a leading member of the British Communist Party stated\n(\nsee\n[\n1\n]\n)\n:-\nWith this book Levy finally parts company with Marxism.\nThen in\n1958\nhe was expelled from the Communist Party.\nLevy had also suffered family problems because of his Jewish upbringing. In\n1918\nhe married Marion Aitken, the daughter of the headmaster of a school in Selkirk. Marion was a devout Presbyterian and this caused a breakdown of relations between Levy and his own family. The marriage produced one daughter and two sons.\nA strong supporter of the\nLondon Mathematical Society\nduring his career in London, Levy served the Society on its Council from\n1929\nto\n1933\n, being vice-president of the Society during\n1931\n-\n32\n.\nHe is described in\n[\n2\n]\nas follows:-\nWith the soft Scottish accent that he retained throughout his life, Levy's warmth, human kindness, and ready wit won him many friends and much respect amongst those who strongly disagreed with his politics.\nIn\n[\n1\n]\nthe author writes:-\nNeither in his mathematics nor his political interests was Levy content merely to study and write; he strove to express his views wherever possible in speech and action.",
  "math_areas": [
    "Statistics"
  ]
}