{
  "nome_completo": "Iain Thomas Arthur Carpenter Adamson",
  "nome_curto": "Iain Adamson",
  "ano_nascimento": "1928",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adamson/",
  "lugar_nascimento": "Dundee, Scotland",
  "lugar_morte": "Nedlands, WA, Australia",
  "biografia": "Iain Adamson\n's parents, Alexander Adamson and Margaret Abel, were married in Lochee, Dundee, in\n1927\n. Iain's mother, Margaret, died shortly after he was born at the age of twenty-five\n(\nshe was born in\n1903)\n, and Iain was brought up in Dundee by his father and his father's sisters. Iain's secondary education was at Morgan Academy in Dundee and, in\n1945\n, he graduated as Dux of the Academy. In the same year he entered the University of St Andrews where he studied for a B.Sc. He graduated in\n1949\nwith First Class Honours in Mathematics. He was one of six students taking the honours mathematics course at St Andrews in that year. The courses he took for his finals were the compulsory papers in Geometry, Algebra, Analysis, Statics, and Dynamics, along with the two Special Topic papers Fluid Mechanics and Algebra. In fact he was the only student to take the Special Topic paper in Algebra in\n1948\n-\n49\nand his performance in this paper was quite outstanding. He was awarded the Carstairs Prize and the Class Medal as the best student.\nAfter graduating from the University of St Andrews, Adamson went to Princeton University in the United States where he undertook research in algebra supervised by\nEmil Artin\n. He was awarded his doctorate in\n1952\nfor his thesis\nThe Cohomology Structure of Formations\n. Some results from this thesis appear in his\n1954\npaper\nCohomology theory for non-normal subgroups and non-normal fields\n. In\n1953\nhe was appointed to the Mathematics Department at Queen's University, Belfast, returning to Dundee in\n1960\nwhere he was appointed as a lecturer in mathematics in Queen's College, at that time part of the University of St Andrews. He made a research visit to the University of Western Australia in\n1966\nand there met Robin Adison who was a Senior Tutor in the French Department. Iain married Robin in Dundee in\n1967\n; their daughter Margaret was born in\n1969\n. Also in\n1967\n, Queen's College became the new University of Dundee and Iain automatically changed from being employed by the University of St Andrews to being a lecturer in the University of Dundee. I\n[\nEFR\n]\ngot to know Iain well in\n1970\nwhen we both attended a Category Theory conference held in the Villa Monastero in Varenna on Lake Como in Italy. His quiet sense of humour added greatly to my enjoyment of the conference.\nWe will look at other aspects of Adamson's life later in this biography, but first we want to look at his greatest mathematical contribution which was as a writer of textbooks. His interest in teaching was evident from an early stage in his career and while a lecturer at Queen's University, Belfast, he published articles such as\nTransformations of Integrals\n(1958)\n,\nA new approach to limits\n(1958)\n, and\nA \"Static\" Approach to Derivatives\n(1959)\n. To get a flavour of these articles, let us quote from his paper on limits:-\nIn a recent series of articles and books,\nMenger\nhas raised grave doubts about the meaning, if any, which can be attached to the phrase  \"a function f\n(\nx\n)\nof the real variable x\". He proposes to talk instead of \"a function f whose domain is the set of real numbers\", claiming that on this basis he can develop the calculus without the use of variables at all; his book 'Calculus: A modern approach' is a triumphant vindication of this claim. By denying himself the use of the variable x,\nMenger\nis no longer able to use the phrase \"as x tends to a\" in discussing limits; he boldly returns to a usage similar to that of the nineteenth century ... To drop the phrase \"as x tends to a\" may be held by some to be a tragedy; certainly its introduction, and that of the arrow notation, were hailed as a great improvement. But the word \"tends\" inevitably conjures up a picture of x\n(\nwhatever x is\n)\nmoving towards a; and as\nFrege\npointed out in an early discussion of the meaning of variables and functions, movement can take place only in time, while pure mathematics has nothing to do with time.\nAdamson's first textbook was\nIntroduction to field theory\n(1964)\n. He writes in the Preface:-\nAmid all the current interest in modern algebra, field theory has been rather neglected - most of the recent textbooks in algebra have been concerned with groups or vector spaces. But field theory is a very attractive branch of algebra, with many fascinating applications; and its central result, the 'Fundamental Theorem of Galois Theory', is by any standards one of the really \"big\" theorems of mathematics. This book aims to bring the reader from the basic definitions to important results and to introduce him to the spirit and some of the techniques of abstract algebra. It presupposes only a little knowledge of elementary group theory and a willingness on the reader's part to remember definitions precisely and to engage in close argument.\nNeil Grabois expresses the widely held view that this is an excellent book\n[\n5\n]\n:-\nThis is an attractive book on field theory and\nGalois theory\n... The text is very clearly written, with many examples, and the exercises are good ... All told this is an excellent introduction to field theory.\nD B Scott, however, writes\n(\nsomewhat harshly many Scotsmen would say\n)\n[\n8\n]\n:-\nThe presentation is clear and convincing. It is perhaps a hard-headed rather than an exciting presentation, but the author, an ardent Scotsman writing in the Edinburgh series, would presumably wish to have it that way.\nThe book was a great popular success, running to\n5\neditions. Adamson's next book\nRings, modules and algebras\n(1971)\nwas again in his own specialist area of algebra. This book ran to\n3\neditions and his next book,\nElementary rings and modules\n(1972)\n, ran to two editions. Reviewing the first of these, H H Storrer writes:-\nThe presentation is very clear, detailed and complete, only rarely a proof or even a small argument is left to the reader. This should be particularly useful for students reading the book on their own.\nOn the second of these Colin Fletcher writes\n[\n4\n]\n:-\nI enjoyed reading the work. The author's style makes the pages and the time fly.\nAdamson turned to analysis for his next textbook\nElementary mathematical analysis\n(1975)\n. From the information given above of Adamson's three papers on teaching elementary analysis, we could guess that his approach in this book would be innovative; indeed it is. Victor Bryant in his review\n[\n2\n]\n, however, points out that, due to Adamson's non-standard notation, a student who learns analysis from this book might find it hard reading other analysis books. Perhaps the two most successfully innovative textbooks by Adamson are\nA general topology workbook\n(1996)\n, and\nA set theory workbook\n(1998)\n. These books are based on the Moore method of teaching\n(\nnamed for\nR L Moore\n)\n. Let us quote Adamson's own explanation from the Preface of the 'Topology' book:-\nThis book is called a 'Workbook' to make it clear from the start that it is not a conventional textbook. Conventional textbooks proceed by giving in each section or chapter first the definitions of the terms to be used, the concepts they are to work with, then some theorems involving these terms\n(\ncomplete with proofs\n)\nand finally some examples and exercises to test the readers' understanding of the definitions and the theorems. Readers of this book will indeed find all the conventional constituents - definitions, theorems, proofs, examples and exercises - but not in the conventional arrangement.\nIn the first part of the book will be found a quick review of the basic definitions of\ngeneral topology\ninterspersed with a large number of exercises, some of which are described as theorems. ... The exercises are deliberately not \"graded\" - after all the problems we meet in mathematical \"real life\" do not come in order of difficulty; some of them are very simple illustrative examples; others are in the nature of tutorial problems for a conventional course, while others are quite difficult results. No solutions of the exercises, no proofs of the theorems are included in the first part of the book - this is a 'Workbook' and readers are invited to try their hand at solving the problems and proving the theorems for themselves. I have been persuaded, with some reluctance, to offer suggestions about how to tackle the exercises which are not entirely straightforward; really dedicated 'Workbook'-ers should ignore these!. The second part of the book contains complete solutions to all but the most utterly trivial exercises and complete proofs of the theorems.\nThe 'set theory' book is written in the same innovative style. As the reviews\n[\n1\n]\nand\n[\n9\n]\nboth point out, Adamson's \"best laid plans\" can be foiled by students who turn to the second part for the proofs of the results as they are reading the first part. Also in\n1996\n, Adamson published\nData structures and algorithms\n. At first this looks like an unlikely topic but he had turned to teaching Computing Science when the Department had asked for volunteers and, true to his way of thinking, he did this properly by first taking an M.Sc. in Computer Science at the University of St Andrews. The book was the result of teaching several different Computer Science courses over a number of years:-\nThe book is written in an informal and friendly way specifically to appeal to students.\nMore information and reviews of Iain Adamson's books are at\nTHIS LINK\n.\nWe promised to return to what we can only describe as \"another side\" of Adamson's life. When the University of Dundee asked if members of staff would consider early retirement with part-time re-engagement, Adamson accepted the offer. However he continued to give much more to the university than the\n35\n% of a full-time post required in his contract. He had earlier taken over the running of the departmental library and continued in this role after becoming part-time. He also trained as a minister in the Church of Scotland. The Rev. Dave Robinson writes\n[\n6\n]\n:-\nIain had a long involvement as an Elder and Session Clerk in the Church of Scotland and when he decided to partly retire from his University teaching he undertook a course of training to equip him to become an Auxiliary Ordained Minister of the Church of Scotland. When he completed this training he was appointed to assist in a parish on the outskirts of Dundee where the incumbent minister had four congregations to serve. Iain quickly became a well known and well respected Minister, especially in regard to pastoral care where his willingness to be a listener rather than a speaker endeared him to people with problems.\nIn\n2001\nIain and Robin Adamson decided to go to Australia and take up permanent residence in Nedlands. There he continued to serve the Church, becoming involved with the Nedlands Uniting Church in Australia. His interests outside mathematics and the Church are described in\n[\n6\n]\n:-\nIain had a great love of classical music, including opera and studied Italian at the University of Western Australia - no doubt to help him understand some of the operas he attended. He had a great appreciation of art, attended as many concerts as he could and also loved to travel.\nFinally let us mention that he was elected as a member of the of the\nLondon Mathematical Society\non\n19\nDecember\n1957\n, and as a member of the\nAmerican Mathematical Society\nin May\n1958\n. He was a member of the\nEdinburgh Mathematical Society\nand was honoured by being elected President of the Society in\n1983\n-\n84\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}