{
  "nome_completo": "Ian Naismith Sneddon",
  "nome_curto": "Ian Sneddon",
  "ano_nascimento": "1919",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sneddon/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Ian Sneddon\n's father was Naismith Sneddon. He was from a Scottish family that had emigrated to Arizona in the United States with the hopes of finding gold. Naismith was born in Arizona but his parents found times very hard there and returned to Scotland when he was\n23\nyears old. Naismith was recruited into the army at the start of World War I, but suffered gassing in the trenches which ruined his health. He married Mary Ann Cameron in\n1918\nand they settled in Renfrew. There Ian, their only child, was born but shortly afterwards the family moved to Partick on the outskirts of Glasgow. There Naismith worked, as best he could given his poor health, as a plasterer and slater. Ian was brought up in a loving, caring, but poor, home.\nIan attended Thornwood Primary School from where, at the age of\n10\n, he was successful in competing for a place at the newly opened Hyndland Secondary School in Glasgow. This school provided Ian with an outstanding education in the full range of subjects and at age\n15\nhe became Dux of the school. His mathematics teacher, James Milroy, recognised his great talent for the subject and persuaded him to remain at school for one further year working mainly at studying mathematics on his own. One year later, in\n1936\n, still only\n16\nyears old he entered the University of Glasgow. His interests at university were divided between mathematics and physics and he graduated in\n1940\nwith First Class Honours in these two topics.\nAfter graduating from Glasgow, Sneddon was awarded a Bryce Fellowship which allowed him continue his studies at Trinity College, Cambridge. However, as was the custom at that time, he took the undergraduate courses at Cambridge leading to the Mathematical Tripos. Of course World War II meant that much of Europe was on a war footing even before Sneddon entered Cambridge and it was inevitable that he would soon end up undertaking war work. Indeed after taking Part II of the Mathematical Tripos in\n1942\nhe was assigned to duties with the Ministry of Supply as a scientific officer and he was sent to the Cavendish Laboratory.\nHis remarkable talents in applied mathematics and physics were quickly directed towards military problems requiring these skills and he began to work on a project examining how to penetrate armour. Before this it is doubtful whether he had developed a particular interest in problems concerning elasticity, but the work he began at the Cavendish Laboratory so fascinated him that he continued to have a deep interest in problems of elasticity throughout his career.\nIn September\n1943\nSneddon married Mary Campbell Macgregor, whom he had known since his school days, in All Saints Episcopal Church in Jordanhill; they had a daughter and two sons\n[\n2\n]\n:-\nMary was at all times a tower of strength to him and enabled him to offer the generous and gracious hospitality for which, along with his gifts as a raconteur, he was renowned.\nWar work often meant that personnel were moved from place to place and soon Sneddon was transferred to work at Fort Halstead in Kent. Here he found himself a colleague of the leading physicist N F Mott and soon they were forming plans for a joint text. When the war ended Sneddon was appointed to a research post in the H H Wills Physical Laboratory at Bristol University where he continued to work with Mott on nuclear physics and also on their book on wave mechanics.\nWave Mechanics and its Applications\nwas published in\n1948\nwith Mott and Sneddon as joint authors. The book discussed applications of quantum mechanics rather than studying the theoretical foundations of the topic. The book looks at applications to the electronic structure of atoms including perturbation and variation methods and a study of electron spin. Also considered are interatomic forces and valence, the theory of solids, collision problems, radiation theory and relativistic quantum theory. W H Furry, reviewing the text, wrote:-\n... the physical viewpoints used are interesting and stimulating.\nBefore the book was published Sneddon had returned to Glasgow as a lecturer in physics, or rather natural philosophy as the subject was called in the ancient Scottish Universities at that time. He took up the appointment in\n1946\nand his outstanding research achievements led to the award of a D.Sc. and also the award of the Kelvin Medal.\nMunn\nwrites in\n[\n3\n]\n:-\nStudents of that era knew that his youthful appearance and relaxed, friendly manner concealed a formidable intellect. They will also doubtless recall being amazed at the first sight of his unique, immaculate handwriting.\nMartin\n[\n2\n]\nmakes similar comments about Sneddon as a lecturer:-\nHis lectures were always clear and well presented, and he will be remembered for his exceptionally neat writing or, rather, printing both on the blackboard and on paper.\nAlthough in the physics department, Sneddon continued to be interested in applied mathematics. His next major text was\nFourier Transforms\nwhich appeared in\n1951\n. Remarkably the book was reprinted from the\n1951\noriginal in\n1995\n, showing what a classic text Sneddon wrote. The original book was dedicated:-\nTo the University of Glasgow on the occasion of its fifth centenary,\n1451\n-\n1951\n.\nThe book discusses applications of\nFourier\n,\nMellin\n,\nLaplace\nand\nHankel\ntransforms to the solution of problems in physics and engineering. It is a major text containing around\n550\npages and is mainly concerned with applications which involve the solution of ordinary differential equations, and boundary value and initial value problems for partial differential equations. The types of physical problems considered include: vibrations of strings, membranes, heavy chains, elastic beams and plates, potential flow, surface waves, slow viscous flow, and heat conduction. More unusual applications are to topics such as the theory of cosmic ray showers.\nThe book concludes with chapters which bring together many results from Sneddon's own papers on boundary value problems in elasticity. G E H Reuther gave this evaluation of the work:-\nThe book is distinguished from existing textbooks on operational methods both by its more \"applied\" flavour and by its much wider scope. It does not confine itself merely to the\nLaplace transform\n, and many of the applications are of a more advanced nature than is usual - the later chapters are based almost entirely on work published within the last ten years. The exposition is lucid ... and answers to problems are often evaluated numerically and illustrated by diagrams. The problems are well chosen to illustrate various points of technique in using transform methods ...\nBefore the book appeared in print Sneddon had left Glasgow to take up the chair of mathematics at the University College of North Staffordshire\n(\nwhich later became Keele University\n)\n. He enjoyed the challenge of building up a department in a new institution and now in a department of mathematics Sneddon made the small shift in attitude required to be an applied mathematician rather than a theoretical physicist. Each of Sneddon's previous two moves had preceded the publication of a major work by him and Sneddon's final move back to the University of Glasgow in\n1956\nfollowed a similar pattern.\nGlasgow established the\nSimson\nChair of Mathematics to which Sneddon was appointed. Although he had been happy at the University College of North Staffordshire still Glasgow held a special place in his affections and in many ways it was a happy homecoming. This time two books were published around the time of his move. The first was\nSpecial functions of mathematical physics and chemistry\npublished in the Oliver and Boyd series in\n1956\n. It was aimed at students of applied mathematics, physics, chemistry and engineering who needed to work with the 'special' functions of\nLegendre\n,\nBessel\n,\nHermite\nand\nLaguerre\n. I\n[\nEFR\n]\npurchased this book when I was a student in the\n1960\ns. It was, as all the Oliver and Boyd series books, sold at a price a student could afford and it provided a straightforward account of the topic in a short but very clear style.\nSneddon's next text\nElements of partial differential equations\nappeared the following year in\n1957\n. It was written with exactly the same basic philosophy as all Sneddon's previous books. He describes his aims in the Preface:-\nThe aim of this book is to present the elements of the theory of partial differential equations in a form suitable for the use of students and research workers whose main interest in the subject lies in finding solutions of particular equations rather than in the general theory.\nThe applications of the methods are again the strength of the book which considers the use of partial differential equations in thermodynamics, stochastic processes, and birth and death processes for bacteria. The book deals with, among other topics,\nLaplace's equation\n, mixed boundary value problems, the wave equation, and the heat equation.\nIn\n1960\nSneddon published a joint text with J G Defares,\nAn introduction to the mathematics of medicine and biology\n. The applications considered in this text are at the forefront of research interests today and show how forward thinking Sneddon was in areas to which to apply his powerful mathematical methods. Another major text which he published was\nMixed boundary value problems in potential theory\nin\n1966\n. This was again a work at the cutting edge of research containing a very complete description of the classical problem of potential theory, namely to determine the electrostatic potential due to a thin circular disk raised to a prescribed potential. Essentially every interesting result which had been published on the topic in the preceding twenty years was discussed with hardly any work of significance being omitted.\nIn\n1969\nSneddon published\nCrack problems in the classical theory of elasticity\nwith M Lowengrub. This book, which examined the problem of the formation and propagation of cracks in elastic bodies, was another masterpiece. Written on a topic on which Sneddon published many papers, it was a comprehensive account of the mathematical analysis of the theoretical distribution of stresses induced in perfectly elastic bodies by the presence of cracks.\nAnother major contribution by Sneddon was his work editing Russian translations of major texts. He began this work around\n1960\nand was involved with the translation into English of the five volume work by V I\nSmirnov\nA course of higher mathematics\n. He was also involved with the English translation of works by\nGelfond\nand\nLinnik\n. By some sort of symmetry many of Sneddon's texts were translated into Russian.\nSneddon travelled widely, particularly in North America where he held a number of visiting professorships, but he also made visits to Poland, Russia, Italy and Australia. He received many honours for his work, notably election to the\nRoyal Society of Edinburgh\nin\n1958\nand to the\nRoyal Society of London\nin\n1983\n. He received honorary degrees from a number of universities including Hull, Strathclyde, Warsaw and Heriot-Watt. He was also elected to other academies such as the\nPolish Academy of Sciences\nand appointed a Commander of the Order of Polonia Restituta. He was awarded an OBE in\n1969\nto recognise his contributions on numerous government committees. He retired from the Simson Chair of Mathematics in\n1985\nbut continued as an honorary senior fellow.\nOther than mathematics Sneddon's main love was music and the arts in Scotland. This was not just a private interest to occupy his leisure time, rather he gave generously of his time on the boards including that of the Scottish National Orchestra, the Citizen's Theatre and he served on the advisory board of Scottish Opera.\nIn\n[\n3\n]\nMunn\nsums up his personal qualities with these words:-\nAt a personal level Ian will be remembered with affection for his warm personality, his irrepressible, boyish sense of humour - no-one had a greater fund of anecdotes - and his unfailing kindness in helping young people with their careers.\nPack\n, in\n[\n4\n]\n, expresses similar sentiments:-\nSneddon was a great conversationalist, with a story for every occasion. He knew so many people, from all over the world, that he could always come up with something interesting. He had a lively sense of humour and a warm, kind personality.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}