{
  "nome_completo": "Ion N Ionescu-Bizet",
  "nome_curto": "Ion Ionescu",
  "ano_nascimento": "1870",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ionescu/",
  "lugar_nascimento": "Stoienoaia, Creata, Ilfov, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Ion Ionescu\nwas born on\n22\nNovember\n1870\naccording to the calendar in Romania at the time of his birth, but we give\n4\nDecember\n1870\n, the date of his birth corrected to the present calendar. We also note here that he was known by the nickname Iancu throughout his life. He was the son of Nicolae Ionescu and Atina Diamandescu. Nicolae and Atina Ionescu had five children, all boys: Constantin, Ion, Iosif, Cristu and Alexandru. Ion was, therefore, the second oldest of the children. Nicolae Ionescu was the administrator of the Stoienoaia estate, about\n30\nkm from Bucharest, which was owned by the two brothers Constantin and Iosif Darvari. In\n1878\n, when he was seven year old, Ion began his primary school education in nearby Carbuneşti. After spending one year at this school, however, his parents decided that, since he was demonstrating such talents, he deserved a better school. He was enrolled in the Clementa school in Bucharest in\n1879\n. This primary school, founded in\n1877\n, was the first in Bucharest to take both girls and boys. He next studied at the Scoala de Rosu nr.\n1\n, also in Bucharest.\nIn\n1880\n, while Ion was still at primary school, the family received a severe blow when Nicolae Ionescu died. A few days before his death, Nicolae, who was being treated at the Colea Hospital, asked to see his son Ion. Realising that he was close to death Nicolae gave Ion advice which would be decisive for his life and career. Let us explain by quoting Ion himself\n[\n11\n]\n:-\nHe told me to read a lot and learn well so that I could take care of my mother when I grow up. I understood that he felt that he would not live long and I started crying so I don't know when I was taken home. I kept his word with holiness, for I learned with all my might, and stayed with my mother until her death. I had her as an example of work and conscience in fulfilling my duty; from her I took the spirit of fairness, economy, modest living ...\nNow feeling that he had the responsibility of supporting his family, he decided that attending secondary school and then university, which would mean that it would be ten years before he could provide an income, was too long and that he could support the family after five years if he studied at a business school. This route even allowed him to give his family financial support for he won a competitive scholarship which supported him throughout his years at the business school and, by living frugally, he was able to give a part of the money to his family.\nDuring the school holidays Ion Ionescu worked as an accountant to earn extra money and after graduating from the business school, he took a job as Iosif Darvari's accountant on the estate where his family lived. Although he received a lower salary than he had been offered by some firms in Bucharest, he had housing and maintenance provided. This job as an accountant saw him busy in the summer months but having less work to do over the winter. Following his father's advice, he used this less busy time to study hard, reading books on a range of subjects but concentrating on mathematics. After a while his studies began to be aimed at a specific goal, namely to allow him to compete in the recently instituted competition for admission to the National School of Bridges and Roads set up in\n1881\n. This competition aimed at enrolling students of the highest quality to the National School. Let us note here that the National School of Bridges and Roads became the Polytechnic School of Bucharest and then in\n1992\nbecame the Polytechnic University of Bucharest.\nIn\n1889\nIonescu took the entrance examination, was placed first and awarded a scholarship. This meant he could study the preparatory year course, at the end of which he took the even more demanding examination which allowed entry to the first year of studies. At the National School, pure mathematics was taught by David Emmanuel\n(1854\n-\n1941)\n, applied mathematics by\nSpiru C Haret\n(1851\n-\n1912)\n, physics and chemistry by Constantin I Istrati\n(1850\n-\n1919)\n, engineering by Anghel Saligny\n(1854\n-\n1925)\nand rational mechanics by Gheorghe Kirilov\n(1845\n-\n1908)\n. Ionescu was not only a diligent, brilliant student in examinations but he provided substantial help to his teachers by assisting in writing the course of rational mechanics with Kirilov. In addition, Ionescu worked as a tutor, translated books, and earned money to support his entire family. Of his teachers, perhaps the one who influenced him most was Istrati who was a model lecturer, giving clear presentations, and his style did much to influence Ionescu's style when he became a lecturer. Ionescu graduated from the National School of Bridges and Roads in\n1894\nwith an engineering degree. He received the highest marks that any student had recorded up to that time.\nAfter graduating in\n1894\n, Ionescu was employed as a railway engineer, working on the Cernavoda-Fetesti\n21\nkm line connecting the Cernavoda-Constanta railway line and the new Bucharest-Fetesti railway line. He was already working with fellow engineers on founding a mathematical journal, the\nGazeta Matematica\n, and he made a sizeable contribution to the cost of producing the journal\n[\n13\n]\n:-\nIn October\n1894\n, five young engineers Victor Balaban, Vasile Cristescu, Ion Ionescu, Mihail Roco and Ioan Zottu\n(\nnow considered as the founders of 'Gazeta Matematica'\n)\n, young graduates of the School of Bridges and Roads in Bucharest\n(\nnow the Polytechnic University of Bucharest\n)\n, discussed the poor results obtained by the candidates in that year's entrance examination. In conclusion, it was proposed to set up a Romanian mathematics journal for \"our high school students\". The name of the magazine \"Gazeta Matematica\" was proposed by Victor Balaban. He did not see his dream come true because he becomes seriously ill and died at the age of\n25\n.\nThe first editor of the\nGazeta Matematica\nwas\nGheorghe Țițeica\n. Let us note that, remarkably, over the years from\n1895\nto\n2005\n, Ionescu published\n421\narticles in the\nGazeta Matematica\n, well over double that of any other contributor over this period. Many of these articles were on the history of mathematics. He also contributed\n635\nproblems to the journal, the third largest number that anyone contributed over that period. Let us at this stage say a little about the best known of the problems that Ionescu contributed. This is the inequality, now known as the Ionescu-Weitzenböck inequality, which states that in a triangle\nA\nB\nC\nABC\nA\nB\nC\nwith area\nS\nS\nS\n,\n4\nS\n√\n3\n≤\na\n2\n+\nb\n2\n+\nc\n2\n4S√3 ≤ a^{2} + b^{2} + c^{2}\n4\nS\n√\n3\n≤\na\n2\n+\nb\n2\n+\nc\n2\n,\nwhere\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nare the lengths of the sides of the triangle.\n(\nActually, to be strictly correct, Ionescu stated the contrapositive of this proposition.\n)\nA rigorous proof was given by N Muzicescu and published in\nGazeta Matematica\nin\n1898\n, the year after it was posed by Ionescu. Weitzenböck's name is attached simply because after he published it in the much more widely read\nMathematische Zeitschrift\nin\n1919\nit became known as the Weitzenböck inequality but later when Ionescu's earlier statement was noted, it was given its current name.\nThe first part of the first volume of the\nGazeta Matematica\nwas published on\n15\nSeptember\n1895\n, the day of the inauguration of the King Carol I Bridge over the Danube constructed as part of the Cernavoda-Fetesti line. This bridge had been designed by Anghel Saligny, who had taught engineering to Ionescu. It was, at this time, the third longest bridge in the world, constructed with novelties including a cantilever lattice beam system.\nOn completing of the Cernavoda-Fetesti line, Ionescu worked on numerous bridge construction projects and other works on the railways. At that time, the metal superstructure of the bridges, which could not be built in Romania, was ordered from abroad. Ionescu was delegated to receive the bridges ordered in France and Germany and, as part of these duties, he spent six months in each of these countries. Returning to Romania, he was in charge of the metal workshops required for completing the Ploiesti-Predeal railway line\n(1898\n-\n1899)\n. On\n1\nJanuary\n1900\n, he was transferred to the Hydraulic Service in Bucharest, as deputy director of the service. He soon became the director, being in charge of work diverting the waters of the Siret to the Prut. As director of the Hydraulic Service, he had to oversee all major construction projects in riverbeds, especially bridge projects. For example, the railway bridge over the Giurgiu basin was designed and executed under his direct guidance. One of his major achievements as director of the Hydraulic Service was the creation of the Hydrographic Map of the Danube, an extremely accurate map at the scale of\n1\n:\n10000\n, including the navigable channels.\nIonescu continued to be one of the main figures involved with the\nGazeta Matematica\nand, in\n1901\n, the journal inaugurated the collection of books known as the\nMathematical Gazette Library\n. The first volume in this new series was \"Collection of problems of arithmetic, algebra, geometry and trigonometry\", the authors being I Ionescu, A Ioachimescu,\nGh Țițeica\n, and V Cristescu.\nThe Second Balkan War broke out in June\n1913\nwhen Bulgaria attacked Serbia and Greece. Romania mobilised its army on\n5\nJuly\n1913\nand Ionescu was drafted with the rank of lieutenant. His task was to help with the movement of the troops crossing the Danube. On\n10\nJuly\n1913\nRomania declared war on Bulgaria and their troops crossed into Bulgaria meeting no resistance. For his contribution to the efficient movement of the troops, Ionescu was promoted to captain. For his contributions, he was decorated with the Order of Manhood and Faith Grade\n1\n. Again during World War I,\n1914\n-\n1918\n, he was mobilised and served at the General Headquarters.\nAfter World War I, he was appointed Director of the Metal Bridge Service on\n1\nJanuary\n1919\n, and Director General of the Service on\n1\nApril\n1921\n. In this position he led the reconstruction works of the metal bridges which had been destroyed during the war. In\n1919\nIonescu was elected as a corresponding member of the\nRomanian Academy\nand\nGheorghe Țițeica\nspoke at the meeting during which he was received into the Academy.\nȚițeica\nended his address as follows\n[\n6\n]\n:-\nTherefore, as a distinguished engineer, eminent professor, chosen writer and fighter in the cultural field, Mr Ionescu is considered to have all the qualities to be elected a corresponding member of the\nRomanian Academy\n.\nWe have not mentioned before his role as a professor, but he taught for many years as a professor of engineering. In\n1903\nhe was appointed professor of graphic works and, in\n1914\n, tenured professor at the Department of Bridges. He taught there until he retired. After\n1921\nhe worked as a professor at the Polytechnic School, being from that time on solely a teacher.\nAmong the honours given to Ionescu, he was elected to the Polytechnic Society in\n1899\n, serving as secretary for\n13\nyears. He was later elected vice president for nine years, and president between\n1932\nand\n1934\n. To help his former teacher Ionescu, who was seriously ill by\n1943\n, Emil Prager suggested that he print a collection of Ionescu's articles which had appeared in various bulletins and magazines, with the title 'Technical Stories', and give him the income from the sale of the\n200\npaperbacks signed by him. We end this biography by quoting extracts from what Nicolae Noica writes in\n[\n11\n]\nabout 'Technical Stories' and other aspects of Ionescu's contributions:-\nToday, rereading 'Technical Stories', after more than twenty years, I found, once again, the talent and skill of the forerunners in carrying out difficult works ..., but also their seriousness and competence in dealing with the essential economic and social problems ....\nToday, the topicality of these technical analyses, made almost a century ago, regarding floods, the navigability of rivers and their economic advantages is surprising. ... Ion Ionescu's description of the Roman Public Works under Emperor Trajan is not only interesting, but also instructive. With extensive quotes from\nVitruvius\n, Ionescu shows that \"the engineering and architecture of the Romans required work and studies and that is why they were able to do great works that are admired even after\n2000\nyears.\"\nHe describes the engineering work done before and during Trajan's time, so that progress can be seen. The cities had their streets paved with mosaics of large slabs on strong foundations and were provided with sewerage installations that ensured, in Rome, during Trajan's time, a consumption of almost\n1\n,\n000\n,\n000\nm/day, of which\n2\n3\n\\large\\frac{2}{3}\\normalsize\n3\n2\n​\nwas for public services. The water was brought from great distances through aqueducts. In Trajan's time, there were\n443\nkm of aqueducts, of which about\n50\nkm was supported by vaults and legs\n32\n.\n0\nm high, true works of art. Ion Ionescu claimed that Emperor Trajan was concerned with ensuring the sanitation of cities and the health of their inhabitants. About the roads that crossed the empire he says that \"they totalled a length equal to twice the length of the equator.\"\nAn important road along the Danube ran from Vienna to the southeast to Dacia. Near Cazanelor, upstream of the Portile de Fier, part of the profile of the road enters the rock, the rest of the width was built to be supported on beams embedded in holes dug in the rock. The complexity of the works, the art and the science with which they were made, are noted. 'Technical Stories' highlight the teacher's writing talent, since he manages to present in a simple and attractive way technical aspects that are often arid. In fact Professor of Engineering Cristea Mateescu writes that Professor Ion Ionescu \"is the first Romanian mathematician and engineer who had the audacity and passion to spend a lifetime\n(1900\n-\n1946)\nwith research on the history of mathematics and construction in Romania and to write a synthesis of the most interesting works in this field.\"\nUniversity professor Florica T Câmpan writes: \"With zeal and self-sacrifice he searched libraries, archives, and erased, as the poet puts it, the 'old column from the chronicle' so that he could paint the 'column of long-gone times.' A meticulous, continuous and passionate work, for almost half a century.\"\nIon Ionescu was an excellent teacher. He understood that to cultivate the field of science and technology it was necessary to educate the youth and to stimulate them as much as possible. He offered them, therefore, a vast work - spread over\n10\n,\n000\npages - in which he described, with talent and skill, the history of construction in our country and beyond. Professor Ion Ionescu's contribution to the historiography of Romanian constructions was fundamental.\nIonescu died in\n1946\nafter a long and painful period of suffering. He had a simple funeral and his wishes that no speeches be made was carried out. In his will, he left his house at Rasuri Street, no.\n25\nto the \"Gazeta matematica\" Society with instructions that two rooms should be converted into reading rooms for high school students in Bucharest. Although, following his wishes, he had a simple funeral, his friends and colleagues felt that they had to organise a fitting memorial for him. Exactly one year after his death a commemoration of his life was held in the hall which was named for him in the Polytechnic School in Bucharest. On this occasion several speeches were made which praised his outstanding achievements.\nIn\n1995\n, to commemorate the\n100\nth anniversary of the founding of the\nGazeta Matematica,\nRomania issued a stamp to commemorate \"Ion N Ionescu Spiritus rector\". See\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}