{
  "nome_completo": "Irmgard Flügge-Lotz",
  "nome_curto": "Irmgard Flügge-Lotz",
  "ano_nascimento": "1903",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flugge-Lotz/",
  "lugar_nascimento": "Hameln, Germany",
  "lugar_morte": "Stanford, USA",
  "biografia": "Irmgard Flügge-Lotz\n's name before she married Wilhelm Flügge was Irmgard Lotz. Her father, Osark Lotz, was a journalist who married Dora Grupe from the family who ran the Grupe construction firm. Osark Lotz was interested in mathematics and had quite a talent for the subject. He transmitted his enthusiasm for mathematics to his daughter while she was still a young child. However, there were other significant influences on the young Irmgard who visited building sites as a child with different members of her mother's family who were construction engineers. This gave her an interest in construction but yet another influence on the young girl came through seeing airship tests being conducted near her home by Count von Zeppelin. She attended a number of schools as her father moved between different towns as a journalist; in Frankenthal, Mönchen-Gladbach and then in\n1914\nin Hanover where Osark Lotz accepted a position as a journalist for a Hanover city newspaper.\nOsark Lotz was due to begin his new job in Hanover on\n1\nAugust\n1914\n, a day that many will recognise as the one on which Germany declared war on Russia leading to France entering the war in support of Russia. Germany attacked Belgium\n(\nleading to Great Britain entering the War\n)\nand, after occupying the country, advanced towards Paris. Osark Lotz was sent to occupied Belgium as part of the German war effort, and the Lotz family had lost their income. By this time Irmgard was studying at a Girls'\nGymnasium\nin Hanover but in order to help out with money to support herself, her mother and younger sister, she began to tutor mathematics and Latin to bring in some much needed cash. Several years later, when Osark returned to Hanover he was in poor health and so Irmgard continued to work to bring in extra money for the family.\nAfter graduating from the Gymnasium in\n1923\nshe entered the Technische Hochschule of Hanover to study mathematics and engineering. She explained, later in her life, why she made the decision to study these topics:-\nI wanted a life which would never be boring. That meant a life in which always new things would occur ... I wanted a career in which I would always be happy even if I were to remain unmarried.\nOf course, given the topics she was studying, Lotz was usually the only girl in most of the classes she took at the Technische Hochschule. She obtained her first degree, a Diplom-Ingenieur, in\n1927\nand then a doctorate, a Doktor-Ingenieur, in\n1929\nfor the thesis\nMathemathische Theorien im Bereich der Wärmeleitung kreisförmiger Zylinder\nⓉ\n(\nOn math theories in the field of heat conduction in a circular cylinder\n)\nwhich studied the mathematical theory of circular cylinders and heat conduction. She then went to the Aerodynamics Research Institute in Göttingen where she was appointed as a Junior Research Engineer in Ludwig Prandtl's research group. Here she applied her mathematical skills in solving\ndifferential equations\nto solve an important problem on the distribution of lift on wings\n(\none that Prandtl himself had been unable to solve\n)\n. She published what is now known as the 'Lotz method' on\n1931\nfor calculating the lift on a three-dimensional wing, which became a standard technique used internationally. While working in Prandtl's research group, she met Wilhelm Flügge who had been appointed as a\nPrivatdozent\nin\n1932\n. As the authors of\n[\n3\n]\nrecount, Flügge was well aware of the difficulties that Lotz had is a male dominated team:-\nHowever, the position of a female in the world of science and engineering was difficult. Wilhelm has told of the secretary who served tea to the group at the weekly conference, but refused to serve Irmgard: \"\nShe\ncan make her own tea.\"\nLotz continued research at the Aerodynamics Research Institute making major advances in techniques to predict the aerodynamic pressure on various parts of a plane such as its body, wings, and turbine blades. The five years from\n1933\nto\n1938\nwere difficult ones for Lotz and Flügge in Göttingen as the Nazi policies had a major affect on the staff. Flügge was branded \"politically unreliable\" and realised that his chance of an academic career had vanished. However, as they prepared to marry, Lotz's career progressed well and by\n1938\nshe had been appointed Head of the Department of Theoretical Aerodynamics. In\n1938\nIrmgard Lotz and Wilhelm Flügge were married, and in the following year they moved to Berlin where Flügge was appointed to the Deutschland Versuchsanstalt Luftfahrt. Flügge-Lotz, as she was known after her marriage, became a consultant on aerodynamics and flight dynamics at the Deutschland Versuchsanstalt Luftfahrt. However, as the war progressed Berlin came under increasingly heavy bombing raids from the allies\n[\n3\n]\n:-\nIn the spring of\n1944\n, the destruction of Berlin had progressed so far that Wilhelm and Irmgard moved with their departments to Saulgau, a little town in the hills of southern Germany. After the end of the war, Saulgau was in the French zone of occupation. The French aeronautical establishment was resurrected after the war on an enlarged scale and was eager to take in the German intelligentsia. In\n1947\nWilhelm Flügge and Irmgard Flügge-Lotz moved with many of their co-workers to Paris, to become part of the Office National d'Études et de Recherches Aéronautiques.\nAlthough Flügge-Lotz and her husband were happy living in Paris, the positions they held there gave them little hope of progressing in their careers. They wrote to Stephen Timoshenko enquiring about the possibilitiy of working in the United States and, in\n1948\n, both received offers of posts at Stanford University which they quickly accepted. However, Stanford University had a policy that a husband and wife could not both have a professorial role in the same Department. With Wilhelm Flügge being appointed as a professor, this meant that, despite Flügge-Lotz's eminence in research, she had to accept a lowly position of \"lecturer\"\n[\n6\n]\n:-\nLack of an appropriate title did not deter her from embarking upon a full and useful life of teaching and research at Stanford. She immediately undertook the guidance of Ph.D. dissertation research in aerodynamic theory, and in the spring of\n1949\n, taught her first Stanford course, which was in boundary-layer theory.\nAt Stanford, Flügge-Lotz undertook research in numerical methods to solve boundary layer problems in fluid dynamics. In\n1951\nshe set up a weekly Fluid Mechanics Seminar that was valuable for the many students who were researching in the topic since it provided a forum for discussing the latest ideas and developments. Her pioneering research involved finite difference methods and the use of computers. She worked on automatic\ncontrol theory\nand published important books on that topic:\nDiscontinuous Automatic Control\n(1953)\nand\nDiscontinuous and Optimal Control\n(1968)\n. L A MacColl, reviewing the first of these writes:-\nIn the simplest case a discontinuous automatic control system is a control system in which the correcting force is a positive constant A, or the corresponding negative constant -A, depending upon whether the sign of the error is positive or negative. Because of their simplicity, such systems are widely used, and the literature contains discussions of many particular systems of this kind. The present book represents the first attempt to treat such systems in a comprehensive and general way. ... the book constitutes a highly valuable contribution to the subject of automatic control, and it will, undoubtedly, lead to many further advances in the field.\nIn the Preface to\nDiscontinuous and Optimal Control\nFlügge-Lotz sets out her aims in writing the text:-\nThe purpose of this book is to acquaint the reader with the problem of discontinuous control by presenting the essential phenomena in simple examples before guiding him to an understanding of systems of higher order.\nIn\n[\n1\n]\n, D Bushaw reviews\nDiscontinuous and Optimal Control\n:-\nThis book is a distillation from the author's nearly three decades as a pioneering contributor to control theory. It thus deals with a highly individual selection of topics in a highly individual manner.\nWorking on automatic control devices brought Flügge-Lotz into contact with the Department of Electrical Engineering at Stanford since the devices were almost always of an electrical nature.\nFlügge-Lotz became Stanford's first woman Professor of Engineering in\n1961\n. She retired in\n1968\nhaving reached the age of sixty-five, but continued to undertake research particularly on the control of satellites. She received many honours including the Achievement Award by the Society of Women Engineers in\n1970\n, being chosen to give the\nvon Kármán\nlecture to the American Institute of Aeronautics and Astronautics in\n1971\n, and being awarded an honorary degree from the University of Maryland in\n1973\n. The citation, read at the ceremony at which the honorary degree was awarded, states:-\nProfessor Flügge-Lotz has acted in a central role in the development of the aircraft industry in the Western world. Her contributions have spanned a lifetime during which she demonstrate, in a field dominated by men, the value and quality of a woman's intuitive approach in searching for and discovering solutions to complex engineering problems. Her work manifests unusual personal dedication and native intelligence.\nAs she grew older her health deteriorated and she suffered increasingly severe pain from arthritis that spread over her body. Despite what she had to bear, Flügge-Lotz remained cheerful and kept in touch with friends and colleagues. She died in Stanford hospital.\nFinally, regarding Wilhelm Flügge and Irmgard Flügge-Lotz's family life we note\n[\n3\n]\n:-\nThe Flügges did not have children, but possibly compensated by adopting, in their own formal way, all the mechanics colleagues, students, and visitors. A regular schedule of inviting people for evening tea at their home in Los Altos was maintained.\nIn fact Wilhelm lived sixteen years after the death of Irmgard yet he\n[\n3\n]\n:-\n... maintained the home exactly as it was with her, occasionally inviting guests for evening tea and on rarer occasions preparing an elaborate meal for guests. The spirit of Irmgard was always present.\nThe authors of\n[\n6\n]\ngive this assessment of Irmgard Flügge-Lotz:-\nIrmgard Flügge-Lotz, teacher, researcher, friend, and gracious hostess, set out on her career hoping never to be bored - there is every indication she achieved her goal. In everything, whether helping students, pursuing her professional work, or bringing together an interesting group of people for an evening of quiet conversation, she displayed enthusiasm, good humour, and a sense of purpose and accomplishment.",
  "math_areas": [
    "Algebra"
  ]
}