{
  "nome_completo": "Irving Kaplansky",
  "nome_curto": "Irving Kaplansky",
  "ano_nascimento": "1917",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kaplansky/",
  "lugar_nascimento": "Toronto, Ontario, Canada",
  "lugar_morte": "Sherman Oaks, Los Angeles, California, USA",
  "biografia": "Irving Kaplansky\n's parents were Samuel Kaplansky\n(1888\n-\n1942)\nand Anna Zuckerman\n(1890\n-\n1972)\nboth of whom were Polish Jews. The names here are confusing; the original version of Kaplansky is Kaplanski for the men and Kaplanska for the women although even here there are variants to the spelling such as Kaplaniski which the family used in Poland. Samuel was born in Iwaniska, Poland, also known by its Yiddish name of Ivansk which is the version Samuel himself used. Anna, the daughter of a miller, was born in Raków, a village in Kielce County, Poland, only about\n10\nkm from Iwaniska. This district was in the Russian part of Poland. Samuel and Anna were married in\n1907\nand their daughter Miriam Edith, also recorded as Mary, was born on\n19\nDecember\n1908\n. Samuel emigrated to Canada in May\n1911\ngiving, on arrival, his name as Izmil Kaplaniski, his destination Toronto, his occupation bookbinder but uncertain of what his occupation would be in Canada. Like many others of their religion, the family were fleeing from religious persecution and systematic killings of Jews.\nOnce in Toronto, Samuel worked hard and the money he made he sent back to his wife in Poland so that she would be able to afford the fare for herself and children to come to Toronto. Anna and daughter remained in Raków, Poland, where Max Lewis Copeland was born on\n17\nAugust\n1911\n. Although he is recorded on official documents as Samuel and Anna's son, and later gave his name sometimes as Max Kaplansky sometimes Max Copeland, in fact on his marriage certificate he gives his parents as Monchay and Sarah Copeland. He must be an adopted son of the Kaplanskys. In September\n1913\nAnna and the two children travelled to Canada. She gave her name as Chana Kaplaniska, and the children as Mania Kaplaniska and Maks Kaplaniski. Mania may be Maria but it certainly looks like Mania. She states that she is going to join her husband who is a tailor and has been in Canada for two years. Two further sons were born in Toronto, namely Morris Ben Kaplansky\n(\nknown as Kip\n)\nwho was born on\n11\nAugust\n1914\nand Irving Kaplansky, the subject of this biography known widely as Kap, born on\n22\nMarch\n1917\n.\nThe\n1921\nCanadian Census records the family living at\n29\nGerrard Street, Toronto, and Samuel gives this version of his name on the census and gives his occupation as grocer with his own shop. His wife is recorded as Annie and the children as Mary, Max, Morris and Isaac. Also living with them at this time is Getzel Kaplaniski, Samuel's father, who is a baker. Getzel first went to Toronto in\n1905\nbut must have returned to Poland since he enters Canada again just before the\n1921\ncensus.\nThe surprise in this census data is that Irving, who is four years old at this time, is recorded as Isaac. This is not the only surprise with Irving Kaplansky's name and we note the complications here. When he graduated in\n1938\nhis name appears as Irving Kaplansky, but when he first travelled to United States on\n12\nSeptember\n1940\nhe gave his name as Izidor Kaplansky. When he filled in a 'Petition for Naturalization' to the United States on\n29\nNovember\n1946\nhe stated \"My full, true, and correct name is Izidor Kaplansky\" ending the application with the statement \"Wherefore, I, your petitioner for naturalization, pray that I may be admitted a citizen of the United States of America, and that my name be changed to Irving Kaplansky.\" He signs the petition \"Izidor Kaplansky\" and his application is supported by\nPaul Halmos\nand Dorothy J Mac Lane\n(\nSaunders Mac Lane\n's wife\n)\n.\nIrving's early interest was music, an interest which he has kept all his life. He said in the interview\n[\n3\n]\n:-\nMy mother says I was  four years old and that's approximately right. Anyway, I was taken to a Yiddish musical comedy. I remember the name of it. It was 'Die Goldene Kala - The Golden Bride'. It was probably a low-grade piece of musical comedy, but it was a revelation to me that  there could be this kind of entertainment with music. The family had acquired a piano so that my sister could take lessons, and when I came home I sat down and played the show's hit song. So I was rushed off to piano lessons before I even started school. The lessons continued for approximately eleven years. Then I realized there was no point in continuing; I was not going to be a pianist of any distinction.\nAnyone who has heard him play the piano at a conference\n(\nas I\n[\nEFR\n]\nhave been fortunate enough to do\n)\nwill have seen him exude the same infectious joy of music as for mathematics. However Irving knew from a very young age that mathematics, and not music, was to be his life. Anna Kaplansky set up the first of her Health Bread Bakery shops in Toronto in\n1928\nat\n530\nCollege Street where the family lived above the shop. It was instantly successful and soon they moved a few blocks to\n630\nCollege Street. Kaplansky's older brother Kip left school at the age of fourteen and helped run the shop.\nKaplansky's secondary education was at the Harbord Collegiate Institute, founded in\n1892\n, where he was very involved in both mathematics and music, singing in Gilbert and Sullivan productions. About\n90\n% of the pupils at this school at this time were Jewish. He graduated from Harbord in\n1934\nwinning the Gordon Galloway Gold Medal for Proficiency in Mathematics. He also won the Prince of Wales Scholarship for the best school pupil in the Province of Ontario, consisting of four years of college at the University of Toronto. While Kaplansky was at Harbord, two of his siblings married: Mary Edith Kaplansky married Myer Freeman on\n23\nMay\n1933\nand Morris Ben Kaplansky\n(\nKip\n)\nmarried Miriam Birch on\n14\nMarch\n1934\n, both marriages being in Toronto. Max Lewis Copeland married Helen Lehrer on\n11\nAugust\n1935\n, also in Toronto.\nIn many ways Kaplansky was lucky in entering the University of Toronto when he did, for the Mathematics Department was very much on the up.\nRichard Brauer\n, a German Jew who had fled from Nazi persecution, accepted an assistant professorship at the University of Toronto in the autumn of\n1935\n, his appointment being largely as a result of\nEmmy Noether\n's recommendation, which she made while visiting Toronto. In the following year\nDonald Coxeter\njoined him in the Department in which\nG de B Robinson\nhad been working since the early\n1930\ns.\nIn\n1938\nKaplansky graduated with a B.A. from the University of Toronto. He showed his great potential for mathematics at this stage, being on the winning team of the first William Lowell Putnam competition. This is a mathematical contest for students from the USA and Canada. The\n1938\ncompetition was sponsored by the\nMathematical Association of America\nand was both a team and individual competition. Question were set by Harvard University and their students were excluded. Kaplansky was a Putnam fellow in the individual competition and Toronto won the team competition. The\n1938\nTorontonensis\nrecords that Kaplansky was first in years I, II and III and that he\n[\n11\n]\n:-\nConsiders mathematics the best of professions and music the best of hobbies.\nThe summer of\n1938\nwas, in many ways, a vital step in Kaplansky's development as a mathematician.\nA A Albert\norganised a Conference followed by a summer of algebra at the University of Chicago.\nRichard Brauer\nwho was attending the Chicago summer of algebra and was giving lectures, advised his student Kaplansky to attend.\nNathan Jacobson\ngave a course on 'Continuous Groups' which Kaplansky attended and he also learnt much from\nAlbert\n's lectures. In total fourteen leading algebraists gave lectures including, in addition to the three just mentioned,\nL E Dickson\n,\nEmil Artin\n,\nSaunders Mac Lane\n,\nSolomon Lefschetz\nand\nOscar Zariski\n. When near the end of his career, Kaplansky wrote\n[\n1\n]\n:-\nThe summer long event at Chicago in\n1938\nwas an algebra program dominated by\nAdrian Albert\n. ... That summer put a stamp on me that lasted a lifetime.\nIn\n1940\nKaplansky received his M.A. from Toronto, and continued his studies at Harvard University. While at Toronto he published the paper\nOn a generalization of the \"Problème des Rencontres\"\nin the\nAmerican Mathematical Monthly\n. It gives a generalisation to the classic problem of finding the number of arrangements of the integers\n1\n,\n2\n, ...,\nn\nin which no digit\ni\nis in the\ni\nth place. When at Harvard, he published the following problem in the\nAmerican Mathematical Monthly\n:\nIf\nn\n,\nr\nn, r\nn\n,\nr\nand\na\na\na\nare positive integers, the congruence\nn\n2\n=\nn\n(\nm\no\nd\n \n \n1\n0\na\n)\nn^{2} = n (\\mod 10^{a})\nn\n2\n=\nn\n(\nm\no\nd\n1\n0\na\n)\nobviously implies\nn\nr\n=\nn\n(\nm\no\nd\n \n \n1\n0\na\n)\nn^{r} = n (\\mod 10^{a})\nn\nr\n=\nn\n(\nm\no\nd\n1\n0\na\n)\n.\n(\nWhen such a number\nn\nn\nn\nhas only\na\na\na\ndigits, it is called an automorphic number.\n)\nFor what values of\nr\nr\nr\ndoes\nn\nr\n=\nn\n(\nm\no\nd\n \n \n1\n0\na\n)\nn^{r} = n (\\mod 10^{a})\nn\nr\n=\nn\n(\nm\no\nd\n1\n0\na\n)\nimply\nn\n2\n=\nn\n(\nm\no\nd\n \n \n1\n0\na\n)\nn^{2} = n (\\mod 10^{a})\nn\n2\n=\nn\n(\nm\no\nd\n1\n0\na\n)\n?\n[\nKaplansky shows that the answer is \"all even numbers not ending in\n6\n.\"\n]\nKaplansky was awarded a doctorate by Harvard in\n1941\n. His thesis supervisor at Harvard was\nSaunders Mac Lane\nand Kaplansky's thesis was entitled\nMaximal Fields with Valuations\n. Kaplansky was appointed a\nBenjamin Peirce\nInstructor in Harvard that year and he continued to hold that post there until\n1944\n.\nThe year\n1944\n-\n45\nKaplansky spent in the Applied Mathematics Group of the National Defense Council at Columbia University working on aerial photography. He wrote:-\nSo that year was spent largely on ordinary differential equations. I had a taste of real life and found that mathematics could actually be used for something.\nWhile spending this year at Columbia University\n[\n4\n]\n:-\nKap shared a room in New York with a younger mathematician, Daniel Zelinsky, who had interrupted his graduate studies to work at the project.\nIn\n1945\n, with no invitation to return to Harvard, he accepted an invitation from\nA A Albert\nto become an instructor at the University of Chicago. This was to be the main university where he spent most of his career and where he was promoted to professor. He wrote in\n[\n14\n]\n:-\nI arrived in Chicago in early October\n1945\n. Perhaps on my very first day, perhaps a few days later, I was in\nAlbert\n's office discussing some routine matter. His student Daniel Zelinsky entered. A torrent of words poured out, as\nAlbert\ntold him how he had just cracked the theory of special\nJordan\nalgebras. His enthusiasm was delightful and contagious. I got into the act and we had a spirited discussion. It resulted in arousing in me an enduring interest in\nJordan\nalgebras.\nIn\n1950\nhe met Rachelle I Brenner at a party in Harvard. She was a graduate student, known to all as Chellie, who had been born in Manhattan, New York on\n19\nMay\n1923\n[\n8\n]\n:-\nKap was not a naturally sociable person before his marriage, but his world was vastly enriched when he married Chellie Brenner in\n1951\n. Chellie and Kap had three children, Steven, Alex and Lucy. Chellie was Kap's opposite in terms of outgoing open warmth. Chellie brought streams of friends and colleagues into their home, and in the years of Kap's directorship at MSRI she presided as a mother hen over the many visitors as well as over Kap himself. When Chellie became ill in the last part of Kap's life the tables were turned, and he nursed her faithfully.\nChellie died on\n11\nDecember\n2010\n, four years after her husband, in Sherman Oaks, Los Angeles, California. She was buried in the Beth Israel Memorial Park, Fords, New Jersey and her grave has the following inscription:\nRachelle Kaplansky\n\"Chellie\"\nChellie loved life. She loved music,\nart and people. She especially\nadored her husband, her sister,\nher children and grandchildren.\nShe was warm, kind and generous.\nShe was loved by all who met her.\nHer favorite saying:\n\"And this too shall pass.\"\nSpeaking of her father, Lucy said:-\nHe taught me and my brothers a lot,\n(\nincluding\n)\nwhat is really the most important lesson: to do the thing you love and not worry about making money.\nDuring the years\n1962\n-\n67\nKaplansky was chairman of the department in Chicago. In\n1969\nhe was appointed George Herbert Mead Distinguished Service Professor at Chicago where he remained till his retirement in\n1984\n. Despite holding important positions he remained accessible to colleagues and students alike, and\n[\n2\n]\n:-\n... one could always rely on his availability and on a challenging idea or question as a result of each conversation.\nAfter he retired in\n1984\n, Kaplansky went to California where he became director of the Mathematical Sciences Research Institute at the University of California, Berkeley.\nKaplansky's work in mathematics was wide ranging although mostly it was in areas of algebra. He has made major contributions to ring theory, group theory, topological algebra, Lie theory and field theory. To single out one paper from his many important ones might seem silly, but let us say that\nRings with polynomial identity\n(1948)\nis, in our opinion, the most influential since it opened a vigorous new area of study. Asked what his own favourite paper was, Kaplansky said it was\nAny Orthocomplemented Complete Modular Lattice is a Continuous Geometry\n(1955)\n. Here is the introduction to that paper:-\nA continuous geometry is a complete complemented modular lattice in which it is further assumed that the lattice operations satisfy certain continuity assumptions. It is known that one cannot drop these continuity assumptions, the pertinent example being the lattice L of all subspaces of an infinite-dimensional vector space. In fact L satisfies one of the two continuity assumptions but fails to satisfy the dual. Of course by taking the direct product of L with its dual we get a lattice satisfying neither continuity axiom. However, this lattice is not orthocomplemented, that is, there does not exist a mapping of period two assigning to each element a canonical complement. This suggests that in an orthocomplemented complete modular lattice it might be possible to prove the continuity axioms.\nHis book\nInfinite Abelian Groups\nwas written at a time when this area was causing little interest but it has now blossomed into a major area in its own right. Similarly his many other books are beautiful introductions to various areas of algebra and have been enjoyed for their clarity, style and beauty by large numbers of undergraduate and graduate students. They include\nFields and rings\n(2\nnd ed,\n1972)\n,\nAn introduction to differential algebra\n(1957)\n,\nCommutative rings\n(1970)\nand\nLie algebras and locally compact groups\n(1971)\n. Kaplansky's books\n[\n2\n]\n:-\n... at a range of levels, are numerous ...\n[\nbut\n]\nthey are certainly not ponderous. He is a man of a few words, writing with polished economy to get the important ideas across.\nFor more information about Kaplansky's books, see\nTHIS LINK\n.\nMany students were inspired by Kaplansky's remarkable lectures. Joe Rotman, one of his students, wrote\n[\n8\n]\n:-\nEvery course, indeed, every lecture, was a delight. Courses were very well organized, as was each lecture. Results were put in perspective, their applications and importance made explicit. Humour and droll asides were frequent. Technical details were usually prepared in advance as lemmas so as not to cloud the main ideas in a proof. Hypotheses were stated clearly, with examples showing why they were necessary. The exposition was so smooth and exciting; I usually left the classroom feeling that I really understood everything. To deal with such arrogance, Kap always assigned challenging problems, which made us feel a bit more humble, but which also added to our understanding. He was a wonderful teacher, both in the short term and for the rest of my mathematical career. His taste was impeccable, his enthusiasm was contagious, and he was the model of the mathematician I would have been happy to be.\nIn\n[\n6\n]\nwe learn of Kaplansky as a Ph.D. advisor\n(\nremarkably he had\n55\npostgraduate students complete a doctorate under his supervision\n)\nand also about his character.\nRichard Kadison\nwrites\n(\ncalling Kaplansky both Kap and Irv\n)\n:-\nKap was almost as close, where I'm concerned, as a beloved parent. Of all my graduate school teachers\n(\nStone\n,\nZygmund\n,\nChern\n,\nSpanier\n,\nHalmos\n,\nSegal\n,\nWeil\n, Graves, Hestenes,\nMac Lane\n,\nAlbert\n, etc.\n)\n, and I revered each and every one of them, Kap was my favourite. A half-hour-to-hour conversation with him about mathematics generated so much excitement that I spent the rest of the day walking on a cloud. Irv was immensely popular with the graduate students; he was always ready to talk math with us and make good and useful suggestions for our work, but he was also somewhat \"scary\" for many of the students. His \"social\" behaviour was even more peculiar than the \"standard\" behaviour of dedicated mathematicians. Most of us have an exaggerated sense of the \"futility\" of small talk; Irv's view of that had to be described as \"excessive\". For example, if you met him in the hallway and stopped for a conversation with him, when the conversation was clearly over, he just walked on, turned and walked away, whatever - absolutely no decompression stage\n(\nor phrases, e.g., the currently popular, and almost always, fatuous \"have a nice day\" - recently inflated to \"have a great day\"\n)\n. Handshakes? Forget it! As fast and smart and creative as he was, and all that\n(\ngenuine, not affected\n)\nno-nonsense behaviour of his, we loved\n(\n\"worshipped\" might be more accurate\n)\nhim.\nKaplansky received numerous awards. He served for many years on the\nAmerican Mathematical Society\n, being on the Council in\n1951\n-\n53\n, vice-president in\n1975\n, and he was elected president of the\nSociety\nshortly after he retired during session\n1985\n-\n86\n. There were many other ways in which Kaplansky served the Society, particularly with respect to the publications of the\nAmerican Mathematical Society\n. From\n1945\nto\n1947\nand again from\n1979\nto\n1985\nhe was on the editorial board of the\nBulletin\nof the\nAmerican Mathematical Society\n; from\n1947\nto\n1952\nhe was on the editorial board of the\nTransactions\nof the\nAmerican Mathematical Society\n; and from\n1957\nto\n1959\nhe was on the editorial board of the\nProceedings\nof the\nAmerican Mathematical Society\n.\nDespite this remarkable record of service to the\nSociety\n, there were still further ways in which Kaplansky used his many talents to its benefit. He served on the Committee on Translations from Russian and other Slavic Languages from\n1949\nuntil\n1958\nand was on the Nominating Committee in\n1977\n-\n78\n.\nKaplansky was awarded a Guggenheim Fellowship and elected to the\nNational Academy of Sciences\nand the\nAmerican Academy of Arts and Sciences\n. In\n1987\nhe was made an honorary member of the\nLondon Mathematical Society\n. Two years later, in\n1989\n, the\nAmerican Mathematical Society\nawarded Kaplansky their Steele Prize. There are three Steele Prizes awarded for different achievements. Kaplansky was awarded one\n[\n2\n]\n:-\n... in recognition of cumulative influence extending over a career, including the education of doctoral students.\nThe citation for the prize gives an excellent summary of Kaplansky's many achievements. The citation is available from a number of sources, see for example\n[\n3\n]\n:-\nBy his energetic example, his enthusiastic exposition and his overall generosity, he has made striking changes in mathematics and has inspired generations of younger mathematicians. His early works range over number theory, statistics, combinatorics, game theory, as well as his principal interest of commutative algebra. He completed the solution of\nKurosh\n's problem on algebraic algebras of bounded degree, where\nJacobson\nhad made a decisive reduction, and considered numerous questions in the area of\nBanach\nalgebras, always from the algebraist's viewpoint. ...\nAs commutative algebra took on new life with the infusion of homological methods, he turned his interest once more in this direction, always trying to see past the formalism into \"what was really going on\". His remarkable success in doing so is witnessed by his publications from the later fifties onwards and the influence they have had on other writers. ...\nKaplansky could not be present at the Summer Meeting of the\nAmerican Mathematical Society\nin\n1989\nto reply in person to this citation. However, he did give a written response which was read at the meeting. In this response he showed his modesty by claiming that the \"citation ... is too flattering\" but he also gave some good advice which he wanted to put into print and it is well worth repeating here\n[\n2\n]\n:-\n... spend some time every day learning something new that is disjoint from the problem on which you are currently working\n(\nremember that the disjointness may be temporary\n)\n, and read the masters.\nLucy, his daughter, became a singer-songwriter. She wrote about her father in\n[\n6\n]\nand we quote here her description of his final years:-\nWhen my dad was already in his eighties, my parents often went on the road with me when I was doing concerts. We'd all get in the car and stay in hotels, and he would sell my CDs for me after the show, sometimes he was even asked for autographs. And if there was a piano on stage he would accompany me on a couple of his songs. He always brought down the house. I'm so grateful we were able to share this. The last time he sat in with me onstage he was\n88\nyears old.\nKaplansky died after a long illness at the home of his son Steven and was buried in New Jersey where his wife's parents were buried.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Number Theory"
  ]
}