{
  "nome_completo": "Irving Reiner",
  "nome_curto": "Irving Reiner",
  "ano_nascimento": "1924",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reiner/",
  "lugar_nascimento": "Brooklyn, New York, USA",
  "lugar_morte": "Urbana, Illinois, USA",
  "biografia": "Irving Reiner\n's parents were Max and Molly Reiner. Max Reiner was born in Austria and emigrated to the United States in\n1907\nwhen he was twenty-two years old. His wife Molly was born in Russia and also emigrated to the United States in\n1907\n. She was sixteen at the time. Both Max and Molly had Yiddish as their first language. Their first child Harry was born around\n1913\nand their second child Blanche was born around\n1918\n. Irving, the subject of this biography, was their third child. When he was born his father Max was working in a candy store, as was Max's younger sister Regina who was also living with them. In the\n1930\ncensus, Max gives his occupation as an operator in a clothing factory, and ten years later he gives his occupation as self employed in stationery.\nIrving attended both elementary school and high school in Brooklyn then, in\n1940\n, he entered Brooklyn College. His first paper on formulae for\nprimes\n,\nFunctions not Formulas for Primes\n, was published in\n1943\nwhile he was still an undergraduate. During the summer of\n1943\nhe visited Brown University where he studied in the School of Advanced Instruction and Research in Mechanics. He met Alex Heller\n(1925\n-\n2008)\n, who was also spending the summer at Brown University, and the two became good friends. Alex Heller, who was a year younger than Reiner, was, like him, born and brought up in New York. Heller was a student at Columbia University.  Reiner graduated from Brooklyn College with a B.A. in\n1944\n. The degree was awarded magna cum laude and he continued his studies entering the graduate school at Cornell University. Burton Wadsworth Jones\n(1902\n-\n1983)\n, who had written is own Ph.D. thesis on\nRepresentation by positive ternary quadratic forms\n, was assigned as Reiner's advisor. Reiner was awarded a Master's Degree for his thesis on binary\nquadratic forms\nin\n1945\n. He published the results from this in the paper\nOn genera of binary quadratic forms\nwhich was published in\n1945\nin the\nBulletin\nof the American Mathematical Society. Arnold Ephraim Ross\n(1906\n-\n2002)\n, at that time a professor at St Louis University, writes in a review:-\nEmploying\nDirichlet\n's theorem on the infinity of primes in an arithmetic progression, the author proves two well-known theorems of\nGauss\n, one relating to the existence of genera of properly primitive binary quadratic forms and the other on the equality of the number of classes of such forms in different genera of the same\ndeterminant\n.\nReiner was awarded his doctorate in June\n1947\nfor his thesis\nA generalisation of Meyer's theorem\n, his doctoral advisor being Burton W Jones. Two years later he published a paper containing material from his thesis with the same title as that thesis. The Introduction begins:-\nThis paper is concerned with a generalization of the following theorem: Every properly primitive binary quadratic form represents infinitely many primes in any pre-assigned arithmetic progression\nM\nx\n+\nN\nMx + N\nM\nx\n+\nN\nconsistent with the generic character of the form, where\nM\nM\nM\nand\nN\nN\nN\nare relatively prime.\nDirichlet\nconjectured this result in\n1840\n, and sketched a method of proof.\nWeber\ngave a complete proof for the special case where the words \"in any pre-assigned arithmetic progression ...\" are omitted, and the theorem as stated was finally proved by\nMeyer\nin\n1888\n. The generalization consists of replacing the set of classes of properly primitive binary quadratic forms of given determinant D, which forms a group under composition, by an abelian group ...\nWhile at Cornell University, Reiner met Irma Moses who was also a graduate student of mathematics being supervised by Burton W Jones. They were married in August\n1948\nand had two children, David Reiner and Peter Reiner. After completing work on his doctoral thesis, Reiner went to the Institute for Advanced Study at Princeton where he spent a year. At Princeton he met\nLoo-Keng Hua\nand they began a collaboration which led to three joint papers:\nOn the generators of the symplectic modular group\n(1949)\n;\nAutomorphisms of the unimodular group\n(1951)\n; and\nAutomorphisms of the projective unimodular group\n(1952)\n. Now it is clear from the dates of these papers that the collaboration went on beyond the time they spent together at the Institute for Advanced Study. In fact they collaborated so well at Princeton that they decided that they would seek positions at the same university and indeed, after the year at Princeton, both were appointed to the University of Illinois in Urbana-Champaign. Reiner remained at the University of Illinois for the rest of his career but\nLoo-Keng Hua\nwas only there for two years before returning to his native China. Although Reiner was to remain at the University of Illinois throughout his career, he held various visiting appointments in particular in London and at the University of Warwick, England.\nGerald J Janusz wrote in\n[\n5\n]\n:-\n[\nReiner lived\n]\na life dedicated to mathematics. He gave encouragement to everyone in whom he saw some mathematical talent and, in return, he was stimulated by the success of other mathematicians with whom he had contact. Students, who might at first have felt intimidated by his reputation, were always quickly put at ease during their conversations with him about mathematics. ... He would often work in streaks, putting in long hours on many consecutive days and nights. In order to refresh himself after such periods of intensive work, he would like to relax by attending a concert. ... During the summers, the vacation of his choice would be a couple of weeks in the mountains.\nAfter his doctoral thesis Reiner worked on classical\nsubgroups\nof\nG\nL\n(\nn\n,\nZ\n)\nGL(n, \\mathbb{Z})\nG\nL\n(\nn\n,\nZ\n)\n. He solved problems concerning minimal generating sets. He then found generators for the\nautomorphism group\nG\nL\n(\nn\n,\nZ\n)\nGL(n, \\mathbb{Z})\nG\nL\n(\nn\n,\nZ\n)\nand of related groups. In\n1955\nhe wrote his first paper on\nrepresentations of groups\n, namely\nReal linear characters of the symplectic modular group\n. His most famous book,\nRepresentation theory of finite groups and associative algebras\nwas published in\n1962\n. It was written jointly with Charles W Curtis\n(1926\n-\n)\nwho was based at the University of Wisconsin, Madison, and Reiner claimed it was the only mathematics book written in a museum and a hotel lobby. Since Chicago was approximately half way between Madison and Urbana, Curtis and Reiner would make day trips there, about once a month, to discuss the progress of the book, meeting first at the Art Institute\n(\nwhich was between their train stations\n)\nwhere the day's work was planned during a stroll through the galleries. When it was time to work on their manuscript... they usually found a congenial place in some out-of-the-way corner of the lobby of the Palmer House to spread out their papers. W E Jenner writes in a review:-\nThe appearance of this masterful book is very timely, especially in view of the recent renewal of activity in the representation theory of finite groups. It provides a remarkably complete introduction to the subject and contains for the first time a large amount of material that has been available hitherto only in the original memoirs. It undoubtedly will be the canonical reference work on its subject for a long time, and should do much to revive interest in non-commutative algebras. ... the authors have written a book worthy of the subject and have rendered an important service to the mathematical community.\nFred E J Linton writes\n[\n6\n]\n:-\n... the book incorporates much recent research work ..., calculates many examples, both easy and intricate, and suggests, here and there, lines of inquiry that look promising for fruitful investigation. These features make it well suited as a text for the serious graduate student and as a reference work for the professional group representation theorist.\nCurtis and Reiner produced a completely rewritten book on representation theory in two volumes published in\n1981\nand\n1987\n, entitled\nMethods of representation theory. With applications to finite groups and orders\n. It was described by a reviewer as:-\n... a massive treatise on the representation theory of finite groups and related orders and algebras.\nReiner wrote over\n100\npapers and books in a highly productive career. Gerald J Janusz, in\n[\n1\n]\n, gives an overview of Reiner's papers:-\nHis early papers were concerned with groups of invertible matrices over integral domains and their automorphisms. These studies led naturally to the study of integral representations of groups and orders with attempts to classify their representations using\nGrothendieck\nrings and their relative versions,\nPicard\ngroups, and class groups. His later papers dealing with zeta-functions bring quantitative methods and new ideas to the representation theory. The influence of Reiner's work is most strongly felt by research mathematicians interested in problems related to integral representation theory.\nWe have already looked at Reiner's most influential book but he wrote other books:\nIntroduction to matrix theory and linear algebra\n(1971)\n;\nMaximal orders\n(1975)\n; and\n(\nwith Klaus Roggenkamp\n)\nIntegral representations\n(1979)\n. The first of these is a concise introduction to elementary matrix theory for undergraduates. Frederick Michael Hall\n(1935\n-\n2005)\n, Head of Mathematics at Shrewsbury School, writes\n[\n4\n]\n:-\nThis book is written at an essentially elementary level, and emphasises basic concepts and manipulative skills rather than stressing proofs of theorems. It deals with the basic manipulation of matrices and determinants, and follows this with a brief discussion of vector spaces and linear transformations, defining a vector rather naively as a matrix with a single row or column and a scalar as a 'number'. The book finishes with chapters on characteristic vectors, orthogonal vectors and matrices, symmetric matrices and Jacobians. Not only are few proofs of theorems given, but there is practically no motivation ...\nIrving Allen Dodes\n(1915\n-\n1993)\n, the mathematics coordinator of the New York school system, writes\n[\n3\n]\n:-\n.... the author stresses concepts and skills rather than proofs; where proofs are omitted, references are given to the sources where proofs may be found. There are many worked examples and exercises, some with answers. Nicely written.\nMaximal orders\nis aimed at a very different audience to that the linear algebra book, for it is a text aimed at graduate students. Heinz Jacobinski writes in a review:-\nThis book is about the classical theory of maximal orders over a\nDedekind\nring in a separable algebra. The presentation and methods of proof are essentially the classical ones in a modernized version. The book has developed from a series of lectures for graduate students, and the author's intention has been to make the book - and the subject - easily accessible to a large variety of readers.\nReiner's joint publication with Klaus Roggenkamp is really a two-part book, the first part being a published form of Reiner's lectures\nTopics in integral representation theory\n.\nAs a Ph.D. advisor, Reiner quickly gained a reputation for his firm, but fair and kind, treatment of his students\n[\n5\n]\n:-\nHis Ph.D. students comment on his rather firm treatment of them; he was a strong advisor but not one who wrote the student's thesis. He met regularly with his students and required them to write up intermediate results. He would read these write-ups carefully and correct style as well as mathematics. He demanded the clear, precise writing from his students that could be found in all his own work. He treated his students with great respect, as, in fact, he treated everyone. He expected his doctoral students to attend seminars and participate in them on an equal basis with the faculty, to read the literature and to keep up on new developments. Many mathematicians, not only his former students, comment on the encouragement they received from him, especially as young scholars starting out. This was a reflection of his own enthusiasm for mathematical research, and his unselfish interest in having others share his excitement through their own successes.\nAlthough he devoted much of his life to mathematics, he did love playing table tennis\n[\n5\n]\n:-\nIrving enjoyed playing a game or two, especially with young visitors to the department who thought themselves good players. Irving was not an aggressive player; he played in a relaxed, gentle way, sometimes carrying on a conversation with his opponent during the game. But somehow he managed to return virtually every ball hit to his side of the table - much to the frustration of the opponent who was concentrating intensely on every shot. Lee Albert Rubel\n(1928\n-\n1995)\ntells of losing such a game to Irving and then attempting to excuse his loss with a remark to the effect that he had not been feeling well earlier that day and was not up to his usual game. Irving was understanding but remarked \"I don't recall ever winning a game from a well man.\"\nIllness forced him to become confined to his home during the last year of his life. However, his will to continue to work on mathematical projects was as strong as ever and he exhibited a spirit to fight against the cancer that slowly crippled him that amazed and inspired all who knew him. He died quietly in his sleep.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}