{
  "nome_completo": "Isaac Jacob Schoenberg",
  "nome_curto": "Isaac Schoenberg",
  "ano_nascimento": "1903",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schoenberg/",
  "lugar_nascimento": "Galatz, Romania",
  "lugar_morte": "Madison, Dane, Wisconsin, USA",
  "biografia": "Isaac Schoenberg\nwas known as Iso to his friends and colleagues. His father Jacob Schoenberg\n(1864\n-\n1930)\n, an Austro-Hungarian subject, was trained as an accountant but he was fascinated by mathematical puzzles, an interest he soon gave to Isaac. Isaac's mother, Rachel Segal, wrote poetry. Her father, Isaac Segal, had owned a lumber business which Rachel inherited. Jacob ran the lumber business for a while but, being a poor business man, it was not successful. Isaac was the youngest of his parents four children with an elder brother Heinrich\n(\nHarry\n)\nand sisters Elsa and Irma\n(1902\n-\n1984)\n. In\n1913\nthe family moved to Iasi, in Romania, and there Jacob worked for the Banca Moldova. The bank had completed a new building in\n1910\nand the Schoenberg family occupied half of the second floor of the building. Jacob and Rachel Schoenberg were Zionists and very active in the Zionist community in Iasi. Isaac's mother Rachel was a frequent speaker at Zionist meetings while his father Jacob trained young boys and girls in farming techniques so that they could emigrate to Palestine and farm there. During World War I, Austro-Hungary and Romania were on opposing sides which gave the family some difficulties. After the war ended they took Romanian citizenship.\nRachel Schoenberg was fluent as writing and speaking French and she taught Isaac the language. This enable him to read French physics books from the age of twelve when he became interested in the topic. However, to understand physics required mathematics and very soon Isaac had become more interested in mathematics than in physics. He read many mathematics textbooks in French, including\nJacques Hadamard\n's\nLeçons de Géométrie Elémentaire\nⓉ\n(\nLessons in elementary geometry\n)\nand other mathematics books in the same series. He studied at the High School in Iasi but during\n1917\n-\n18\nand\n1918\n-\n19\nhe studied at home for his Baccalaureate examinations. Titu Patriciu, a mathematics teacher at the High School, helped him with his mathematical studies. After sitting his Baccalaureate examinations in\n1919\n, later in the same year he began his studies at the University of Iasi.\nIn his first year,\n1919\n-\n20\n, Schoenberg studied Victor Costin's course in 'Projective and Descriptive Geometry' and, in\n1920\n-\n22\n, he studied the following courses leading to the degree of M.A.: 'Analytic Geometry', taught by Alexandru Myller; 'Algebra Including\nGalois Theory\n', taught by\nSimion Stoilow\n; 'Analysis', taught by Simion Sanielevic; 'The Theory of Analytic Functions', taught by Vera Myller-Lebedev; 'Mechanics', taught by Simion Sanielevici; and 'Astronomy', taught by Constantin Popovici. He also took some extra courses which were not part of the M.A. syllabus: 'Differential Geometry', taught by Alexandru Myller; and 'Differential Equations including Fuchs Theory', taught by Simion Sanielevici. Let us say a little about some of those who taught Schoenberg at the University of Iasi. Alexandru Myller\n(1879\n-\n1965)\nstudied with\nFelix Klein\nand\nDavid Hilbert\nat Göttingen from\n1902\nand was awarded his Ph.D. in\n1906\n. He was appointed in\n1910\nas a professor at the Department of Analytical Geometry at the University of Iasi. Simion Sanielevici\n(1870\n-\n1963)\nstudied at the University of Bucharest and then undertook research in Paris. He was awarded a doctorate by the Sorbonne in\n1909\n. After teaching in Bucharest he was appointed as a professor at the University of Iasi in\n1920\n. Vera Myller-Lebedev\n(1880\n-\n1970)\n, born Vera Myller, studied at St Petersburg and then undertook research at Göttingen where she met Alexandru Myller; they later married. She was awarded a Ph.D. from Göttingen in\n1906\nand worked at the University of Iasi from\n1911\n. She became a professor in the department of higher algebra and functions theory in Iasi in\n1918\n. Taught by these excellent mathematicians, Schoenberg received his M.A. in Mathematics\n(\nwith distinction\n)\nin\n1922\n.\nDuring\n1922\n-\n25\nhe studied at Germany. The first semester of\n1922\n-\n23\nhe spent in Göttingen, then he spent the second semester of that academic year at Berlin. There were two main attractions to Berlin; his sister Irma was there studying piano and he was enthused by\nIssai Schur\n's courses at the University of Berlin. He remained in Berlin for the whole of the academic year\n1923\n-\n24\nand during the three semesters there he attended\nSchur\n's courses on 'Algebra', 'Number Theory', and 'Analytic Number Theory'. It was the 'Analytic Number Theory' course, in which\nSchur\nhad discussed\nHermann Weyl\n's results on the uniform distribution of numbers mod\n1\n, that gave Schoenberg the ideas which would eventually form his Ph.D. thesis. Göttingen was also very attractive since\nEdmund Landau\nwas teaching there, so Schoenberg spent the whole of the academic year\n1924\n-\n25\nat Göttingen. He attended\nEdmund Landau\n's courses on 'Entire Functions', 'Trigonometric Series', 'The Big\nFermat\nProblem', and 'Analytic Number Theory'. By the time he returned to Göttingen in\n1924\n,\nAlexander Ostrowski\nwas teaching there and Schoenberg attended his course on 'Overconvergence of Power Series' and also the seminar that\nOstrowski\nran.\nSchoenberg had obtained his Baccalaureate in Romania and this was not recognised by Germany so he was not allowed to submit his thesis to a German university. He therefore returned to the University of Iasi in\n1925\nwhere he was appointed as an assistant to Victor Costin but his thesis advisor was now Simion Sanielevici. Schoenberg presented his thesis\nÜber die asymptotische Verteilung reeller Zahlen mod\n1\nⓉ\n(\nOn the asymptotic distribution of real numbers mod\n1\n)\nto the University of Iasi and was awarded his Ph.D. in June\n1926\n. All High School graduates had to serve for a year in the army so Schoenberg spent six months at the Field Artillery School in Timisoara, a city that had been allotted by the Treaty of Trianon to Romania in\n1920\n. Graduating as a corporal, he spent the following six months in a horse drawn Field Artillery Regiment near Chisinau in Bessarabia. Chisinau was a city which was Russian before it was allotted by the Treaty of Trianon to Romania in\n1920\n. Schoenberg writes\n[\n9\n]\n:-\nThe year\n1926\n-\n1927\nwas as peaceful as Europe experienced between the wars. In recollection and by old photographs my military service has some elements of musical comedy. As a lifelong vegetarian I could not eat at the officers' mess, but with my doctorate in Mathematics I was well treated.\nAt Göttingen Schoenberg had got to know\nEdmund Landau\nwell and it was\nLandau\nwho arranged a visit for Schoenberg to the Hebrew University of Jerusalem which he made in the spring semester of\n1928\n.\nEdmund Landau\n, an enthusiastic Zionist, was one of founders of the Hebrew University of Jerusalem in\n1925\nand worked there until\n1930\n. Schoenberg lectured in Hebrew in Jerusalem on Higher Algebra. It was during this visit that\n[\n1\n]\n:-\n... Schoenberg became interested in estimating the number of real zeros of a polynomial and so began his very influential work on Total Positivity and Variation diminishing linear transformations...\nLandau\n, however, proved important in other ways in Schoenberg's life for in Jerusalem he met\nLandau\n's elder daughter. In\n1930\n, after his return from Jerusalem, Schoenberg married\nLandau\n's daughter Charlotte in Berlin. Charlotte, known as Dolli, had been born on\n12\nMarch\n1907\nin Berlin. This was not Schoenberg's only mathematical connection by marriage since his sister Irma, a concert pianist, married\nHans Rademacher\n.\nIn\n1930\nSchoenberg was awarded a Rockefeller fellowship which enabled him to go with his wife to the United States. There he was a postdoctoral worker at Chicago during\n1930\n-\n31\n, where he studied the Calculus of Variations and collaborated with\nGilbert Bliss\n. This went very well and\nBliss\narranged for Schoenberg to remain at Chicago for the year\n1931\n-\n32\nas his assistant. During these two years Schoenberg wrote seven papers, two of which were jointly written with\nBliss\n. These papers are:\n(\nwith\nGilbert Bliss\n)\nOn separation, comparison, and oscillation theorems for self-adjoint systems of linear second order differential equations\n(1931)\n;\nThe minimizing properties of geodesic arcs with conjugate end points\n(1931)\n;\nOn finite and infinite completely monotonic sequences\n(1932)\n;\nOn finite-rowed systems of linear inequalities in infinitely many variables\nI\n(1932)\n;\nOn finite-rowed systems of linear inequalities in infinitely many variables\nII\n(1932)\n;\n(\nwith\nGilbert Bliss\n)\nOn the derivation of necessary conditions for the problem of Bolza\n(1932)\n; and\nSome applications of the calculus of variations to Riemannian geometry\n(1932)\n. While in Chicago, Iso and Dolli Schoenberg's first child Elizabeth was born on\n17\nSeptember\n1931\n.\nIn\n1932\nthe family left Chicago and went to Cambridge Massachusetts where he attended courses both at Harvard and at the Massachusetts Institute of Technology. At Harvard he attended lectures by\nDavid Vernon Widder\n, and at M.I.T. he studied the courses given by\nDirk Struik\nand\nJesse Douglas\n. In\n1933\nhe became a member of the Institute for Advanced Study at Princeton and he remained a member until\n1935\n. During this time he received some financial support working for the\nAnnals of Mathematics\n. At Princeton, influenced by Leonard Mascot Blumenthal\n(1901\n-\n1984)\nwho was a visiting scholar at the Institute for Advanced Study from\n1933\nto\n1936\n, he began working on distance geometry. His work on the\nAnnals of Mathematics\nled to him reading a paper by\nMaurice Fréchet\nwhich motivated him to write nine papers on\n[\n1\n]\n:-\n...the isometric imbedding of metric spaces into\nHilbert space\nand positive definite functions.\nSchoenberg was acting assistant professor at Swarthmore College from January\n1935\nuntil June\n1936\n. He was then appointed to Colby College in Waterville where he spent the next five years. The article\n[\n4\n]\ngives an excellent picture of his work at Colby in\n1940\n. He is described as:-\n... a man in his late thirties, whose dark hair, ruddy high cheekbones and flashing grin give his maturity a boyish expression. ... Strangely enough, it is the elementary classes which he particularly enjoys teaching. He says that it keeps him conscious of fundamentals and he enjoys the challenge of making students see the fascination of his subject. Something of Schoenberg's approach is seen in a new course called \"Non-technical mathematics\" which he introduced last year. Aimed for students who do not plan to take any further work in mathematics, he is freed from the necessity of drilling them on fundamentals preparatory for advanced work, and so can teach the subject solely for its cultural and mind-stretching values. Students say it is a hard course, but fun. ... His classroom manner is vigorous, energetic, never losing the attention of the class, and using the blackboard constantly and effectively. One notes his vivid and concrete analogies, his ability to crystallise abstract concepts. English is, of course, an acquired language, and yet he has an extraordinary gift for precision of phrase, and he talks with wit and grace. It is more than linguistic ability, it reveals clarity of mind and a quality of personal distinction.\nPerhaps, given these comments about his ability in the English language, it is a good place to note that the Schoenberg archive\n[\n7\n]\ncontains letters, notes, and documents, written in Romanian, German, French, Italian, Dutch, and Russian. On\n17\nOctober\n1937\ntheir second daughter, Beatrice, was born in Waterville. Five months later Schoenberg's father-in-law\nEdmund Landau\ndied and his mother-in-law Marianne Landau\n(1886\n-\n1963)\n, a daughter of Paul Ehrlich\n(\nNobel Laureate and founder of Chemotherapy\n)\n, emigrated to the USA and joined them in Waterville.\nIn\n1941\n, he was appointed to the faculty at the University of Pennsylvania. During the years\n1943\n-\n45\nhe was released from the University of Pennsylvania for war work as a mathematician at the Army's Ballistic Research Laboratory in Aberdeen, Maryland\n(\nthe Aberdeen Proving Ground\n)\n. It was during this war work that he initiated the area for which he is most famous, the theory of splines. Karlin writes in\n[\n5\n]\n:-\n... Schoenberg is noted worldwide for his realisation of the importance of spline functions for general mathematical analysis and in approximation theory, their key relevance in numerical procedures for solving differential equations with initial and/or boundary conditions, and their role in the solution of a whole host of variational problems. The fundamental papers by Schoenberg\n[\ntwo papers in\n1946]\nform a monument in the history of the subject as well as its inauguration.\nThe authors of\n[\n1\n]\nstate:-\nFor the next\n15\nyears, Schoenberg had splines all to himself. This changed around\n1960\n, when computers became more widespread and splines first assumed their role as the premier tool for data fitting and computer-aided geometric design. Schoenberg's more than\n40\npapers on splines after\n1960\ngave much impetus to the rapid development of the field.\nAlthough his research was producing extremely important mathematics, he suffered a family tragedy\n[\n9\n]\n:-\nMy family received a heavy blow when my beloved wife Dolli died of acute Leukemia on July\n2\n,\n1949\n. My older daughter Elizabeth left for College\n(\nRadcliffe\n)\nin the Fall of the same year. On December\n2\n,\n1950\n, I married Dolly van der Hoop, of Amsterdam, who was visiting Mark Dresden and his wife in Media PA.\nIso and Dolly Schoenberg had a son Michael Jan, born in Santa Monica, California, on\n12\nSeptember\n1951\n.\nSchoenberg made further outstanding contributions in a series of papers between\n1950\nand\n1959\non the theory of\nPólya\nfrequency functions. His work here extended that begun by\nPólya\n,\nLaguerre\nand\nSchur\non approximating functions by polynomials with only real zeros. This work led Schoenberg to discover remarkable properties of polynomials all of whose zeros are negative and real.\nIn\n1966\nSchoenberg moved from the University of Pennsylvania to the University of Wisconsin where he became a member of the Mathematics Research Center. He remained at Wisconsin-Madison until he retired in\n1973\n. However, he continued to produce important works after he retired and of his\n174\npapers and books, over\n50\nappeared after his retirement. During his time at Wisconsin, Schoenberg introduced another concept of major importance, namely cardinal splines. He investigated their wide applications in approximation theory in a series of three papers between\n1969\nand\n1973\n.\nSchoenberg published joint papers with a number of mathematicians including his brother-in-law Rademacher. He also collaborated with\nBesicovitch\n,\nErdős\n,\nCurry\n,\nvon Neumann\nand\nSzegő\n. Although he never produced a joint publication with his father-in-law\nEdmund Landau\n, he did spend a great deal of his time working on problems that\nLandau\nhad considered.\nIn\n[\n5\n]\n, written at the time he retired in\n1973\n, his interests were described:-\nSchoenberg is a man of broad culture, fluent in several languages, addicted to art, music and world literature, sensitive, gracious and giving in all ways.\n[\nHe\n]\nfrequently builds physical models related to his mathematical enquiries. ... The working desk at his home where he engages in research is actually a draftsman's bench complete with T-square, etc. and a tall stool. Mobiles, artistic works, models of ruled surfaces, icosahedrons and other objects are strewn throughout the room. English, French and German novels, numerous paintings and artefacts are scattered on all the nearby easy chairs. He buys and collects books of all vintages with passion. Historical mathematical discourses especially fascinate him and his articles frequently reflect this interest.\nWe noted above that retirement did not slow Schoenberg's productivity. In\n1983\nhis book\nMathematical time exposures\nwas published by the\nMathematical Association of America\n. You can read extracts from a review of this book at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}