{
  "nome_completo": "Isaac Newton",
  "nome_curto": "Isaac Newton",
  "ano_nascimento": "1643",
  "ano_morte": "1727",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Newton/",
  "lugar_nascimento": "Woolsthorpe, Lincolnshire, England",
  "lugar_morte": "London, England",
  "biografia": "Isaac Newton\n's life can be divided into three quite distinct periods. The first is his boyhood days from\n1643\nup to his appointment to a chair in\n1669\n. The second period from\n1669\nto\n1687\nwas the highly productive period in which he was Lucasian professor at Cambridge. The third period\n(\nnearly as long as the other two combined\n)\nsaw Newton as a highly paid government official in London with little further interest in mathematical research.\nIsaac Newton was born in the manor house of Woolsthorpe, near Grantham in Lincolnshire. Although by the calendar in use at the time of his birth he was born on Christmas Day\n1642\n, we give the date of\n4\nJanuary\n1643\nin this biography which is the \"corrected\" Gregorian calendar date bringing it into line with our present calendar.\n(\nThe Gregorian calendar was not adopted in England until\n1752\n.\n)\nIsaac Newton came from a family of farmers but never knew his father, also named Isaac Newton, who died in October\n1642\n, three months before his son was born. Although Isaac's father owned property and animals which made him quite a wealthy man, he was completely uneducated and could not sign his own name.\nYou can see a picture of Woolsthorpe Manor as it is now at\nTHIS LINK\n.\nIsaac's mother Hannah Ayscough remarried Barnabas Smith the minister of the church at North Witham, a nearby village, when Isaac was two years old. The young child was then left in the care of his grandmother Margery Ayscough at Woolsthorpe. Basically treated as an orphan, Isaac did not have a happy childhood. His grandfather James Ayscough was never mentioned by Isaac in later life and the fact that James left nothing to Isaac in his will, made when the boy was ten years old, suggests that there was no love lost between the two. There is no doubt that Isaac felt very bitter towards his mother and his step-father Barnabas Smith. When examining his sins at age nineteen, Isaac listed:-\nThreatening my father and mother Smith to burn them and the house over them.\nUpon the death of his stepfather in\n1653\n, Newton lived in an extended family consisting of his mother, his grandmother, one half-brother, and two half-sisters. From shortly after this time Isaac began attending the Free Grammar School in Grantham. Although this was only five miles from his home, Isaac lodged with the Clark family at Grantham. However he seems to have shown little promise in academic work. His school reports described him as 'idle' and 'inattentive'. His mother, by now a lady of reasonable wealth and property, thought that her eldest son was the right person to manage her affairs and her estate. Isaac was taken away from school but soon showed that he had no talent, or interest, in managing an estate.\nAn uncle, William Ayscough, decided that Isaac should prepare for entering university and, having persuaded his mother that this was the right thing to do, Isaac was allowed to return to the Free Grammar School in Grantham in\n1660\nto complete his school education. This time he lodged with Stokes, who was the headmaster of the school, and it would appear that, despite suggestions that he had previously shown no academic promise, Isaac must have convinced some of those around him that he had academic promise. Some evidence points to Stokes also persuading Isaac's mother to let him enter university, so it is likely that Isaac had shown more promise in his first spell at the school than the school reports suggest. Another piece of evidence comes from Isaac's list of sins referred to above. He lists one of his sins as:-\n... setting my heart on money, learning, and pleasure more than Thee ...\nwhich tells us that Isaac must have had a passion for learning.\nWe know nothing about what Isaac learnt in preparation for university, but Stokes was an able man and almost certainly gave Isaac private coaching and a good grounding. There is no evidence that he learnt any mathematics, but we cannot rule out Stokes introducing him to\nEuclid\n's\nElements\nwhich he was well capable of teaching\n(\nalthough there is evidence mentioned below that Newton did not read\nEuclid\nbefore\n1663)\n. Anecdotes abound about a mechanical ability which Isaac displayed at the school and stories are told of his skill in making models of machines, in particular of clocks and windmills. However, when biographers seek information about famous people there is always a tendency for people to report what they think is expected of them, and these anecdotes may simply be made up later by those who felt that the most famous scientist in the world ought to have had these skills at school.\nNewton entered his uncle's old College, Trinity College Cambridge, on\n5\nJune\n1661\n. He was older than most of his fellow students but, despite the fact that his mother was financially well off, he entered as a\nsizar\n. A sizar at Cambridge was a student who received an allowance toward college expenses in exchange for acting as a servant to other students. There is certainly some ambiguity in his position as a sizar, for he seems to have associated with \"better class\" students rather than other sizars. Westfall\n(\nsee\n[\n23\n]\nor\n[\n24\n]\n)\nhas suggested that Newton may have had Humphrey Babington, a distant relative who was a Fellow of Trinity, as his patron. This reasonable explanation would fit well with what is known and mean that his mother did not subject him unnecessarily to hardship as some of his biographers claim.\nNewton's aim at Cambridge was a law degree. Instruction at Cambridge was dominated by the philosophy of\nAristotle\nbut some freedom of study was allowed in the third year of the course. Newton studied the philosophy of\nDescartes\n,\nGassendi\n,\nHobbes\n, and in particular\nBoyle\n. The mechanics of the Copernican astronomy of\nGalileo\nattracted him and he also studied\nKepler\n's\nOptics\n. He recorded his thoughts in a book which he entitled\nQuaestiones Quaedam Philosophicae\nⓉ\n(\nCertain philosophical questions\n)\n. It is a fascinating account of how Newton's ideas were already forming around\n1664\n. He headed the text with a Latin statement meaning \"\nPlato\nis my friend,\nAristotle\nis my friend, but my best friend is truth\" showing himself a free thinker from an early stage.\nHow Newton was introduced to the most advanced mathematical texts of his day is slightly less clear. According to\nde Moivre\n, Newton's interest in mathematics began in the autumn of\n1663\nwhen he bought an astrology book at a fair in Cambridge and found that he could not understand the mathematics in it. Attempting to read a trigonometry book, he found that he lacked knowledge of geometry and so decided to read\nBarrow\n's edition of\nEuclid\n's\nElements\n. The first few results were so easy that he almost gave up but he:-\n... changed his mind when he read that parallelograms upon the same base and between the same parallels are equal.\nReturning to the beginning, Newton read the whole book with a new respect. He then turned to\nOughtred\n's\nClavis Mathematica\nⓉ\n(\nThe key of  mathematics\n)\nand\nDescartes\n'\nLa Géométrie\nⓉ\n(\nGeometry\n)\n. The new algebra and analytical geometry of\nViète\nwas read by Newton from\nFrans van Schooten\n's edition of\nViète\n's collected works published in\n1646\n. Other major works of mathematics which he studied around this time was the newly published major work by\nvan Schooten\nGeometria a Renato Des Cartes\nⓉ\n(\nGeometry of Descartes\n)\nwhich appeared in two volumes in\n1659\n-\n1661\n. The book contained important appendices by three of\nvan Schooten\n's disciples,\nJan de Witt\n,\nJohan Hudde\n, and\nHendrick van Heuraet\n. Newton also studied\nWallis\n's\nAlgebra\nand it appears that his first original mathematical work came from his study of this text. He read\nWallis\n's method for finding a square of equal area to a\nparabola\nand a\nhyperbola\nwhich used indivisibles. Newton made notes on\nWallis\n's treatment of series but also devised his own proofs of the theorems writing:-\nThus\nWallis\ndoth it, but it may be done thus ...\nIt would be easy to think that Newton's talent began to emerge on the arrival of\nBarrow\nto the Lucasian chair at Cambridge in\n1663\nwhen he became a Fellow at Trinity College. Certainly the date matches the beginnings of Newton's deep mathematical studies. However, it would appear that the\n1663\ndate is merely a coincidence and that it was only some years later that\nBarrow\nrecognised the mathematical genius among his students.\nDespite some evidence that his progress had not been particularly good, Newton was elected a scholar on\n28\nApril\n1664\nand received his bachelor's degree in April\n1665\n. It would appear that his scientific genius had still not emerged, but it did so suddenly when the plague closed the University in the summer of\n1665\nand he had to return to Lincolnshire. There, in a period of less than two years, while Newton was still under\n25\nyears old, he began revolutionary advances in mathematics, optics, physics, and astronomy.\nWhile Newton remained at home he laid the foundations for differential and integral calculus, several years before its independent discovery by\nLeibniz\n. The 'method of fluxions', as he termed it, was based on his crucial insight that the integration of a function is merely the inverse procedure to differentiating it. Taking differentiation as the basic operation, Newton produced simple analytical methods that unified many separate techniques previously developed to solve apparently unrelated problems such as finding areas,\ntangents\n, the lengths of curves and the maxima and minima of functions. Newton's\nDe Methodis Serierum et Fluxionum\nⓉ\n(\nOn methods of series and on fluxions\n)\nwas written in\n1671\nbut Newton failed to get it published and it did not appear in print until John Colson produced an English translation in\n1736\n.\nWhen the University of Cambridge reopened after the plague in\n1667\n, Newton put himself forward as a candidate for a fellowship. In October he was elected to a minor fellowship at Trinity College but, after being awarded his Master's Degree, he was elected to a major fellowship in July\n1668\nwhich allowed him to dine at the Fellows' Table. In July\n1669\nBarrow\ntried to ensure that Newton's mathematical achievements became known to the world. He sent Newton's text\nDe Analysi\nto\nCollins\nin London writing:-\n[\nNewton\n]\nbrought me the other day some papers, wherein he set down methods of calculating the dimensions of magnitudes like that of Mr\nMercator\nconcerning the hyperbola, but very general; as also of resolving equations; which I suppose will please you; and I shall send you them by the next.\nCollins\ncorresponded with all the leading mathematicians of the day so\nBarrow\n's action should have led to quick recognition.\nCollins\nshowed\nBrouncker\n, the President of the\nRoyal Society\n, Newton's results\n(\nwith the author's permission\n)\nbut after this Newton requested that his manuscript be returned.\nCollins\ncould not give a detailed account but\nde Sluze\nand\nGregory\nlearnt something of Newton's work through\nCollins\n.\nBarrow\nresigned the Lucasian chair in\n1669\nto devote himself to divinity, recommending that Newton\n(\nstill only\n27\nyears old\n)\nbe appointed in his place. Shortly after this Newton visited London and twice met with\nCollins\nbut, as he wrote to\nGregory\n:-\n... having no more acquaintance with him I did not think it becoming to urge him to communicate anything.\nNewton's first work as Lucasian Professor was on optics and this was the topic of his first lecture course begun in January\n1670\n. He had reached the conclusion during the two plague years that white light is not a simple entity. Every scientist since\nAristotle\nhad believed that white light was a basic single entity, but the chromatic aberration in a telescope lens convinced Newton otherwise. When he passed a thin beam of sunlight through a glass prism Newton noted the spectrum of colours that was formed.\nHe argued that white light is really a mixture of many different types of rays which are refracted at slightly different angles, and that each different type of ray produces a different spectral colour. Newton was led by this reasoning to the erroneous conclusion that telescopes using refracting lenses would always suffer chromatic aberration. He therefore proposed and constructed a reflecting telescope.\nIn\n1672\nNewton was elected a fellow of the\nRoyal Society\nafter donating a reflecting telescope. Also in\n1672\nNewton published his first scientific paper on light and colour in the\nPhilosophical Transactions of the Royal Society\n. The paper was generally well received but\nHooke\nand\nHuygens\nobjected to Newton's attempt to prove, by experiment alone, that light consists of the motion of small particles rather than waves. The reception that his publication received did nothing to improve Newton's attitude to making his results known to the world. He was always pulled in two directions, there was something in his nature which wanted fame and recognition yet another side of him feared criticism and the easiest way to avoid being criticised was to publish nothing. Certainly one could say that his reaction to criticism was irrational, and certainly his aim to humiliate\nHooke\nin public because of his opinions was abnormal. However, perhaps because of Newton's already high reputation, his corpuscular theory reigned until the wave theory was revived in the\n19\nth\ncentury.\nNewton's relations with\nHooke\ndeteriorated further when, in\n1675\n,\nHooke\nclaimed that Newton had stolen some of his optical results. Although the two men made their peace with an exchange of polite letters, Newton turned in on himself and away from the\nRoyal Society\nwhich he associated with\nHooke\nas one of its leaders. He delayed the publication of a full account of his optical researches until after the death of\nHooke\nin\n1703\n. Newton's\nOpticks\nappeared in\n1704\n. It dealt with the theory of light and colour and with\ninvestigations of the colours of thin sheets\n'Newton's rings' and\ndiffraction of light.\nTo explain some of his observations he had to use a wave theory of light in conjunction with his corpuscular theory.\nAnother argument, this time with the English Jesuits in Liège over his theory of colour, led to a violent exchange of letters, then in\n1678\nNewton appears to have suffered a nervous breakdown. His mother died in the following year and he withdrew further into his shell, mixing as little as possible with people for a number of years.\nNewton's greatest achievement was his work in physics and celestial mechanics, which culminated in the theory of universal gravitation. By\n1666\nNewton had early versions of his three laws of motion. He had also discovered the law giving the centrifugal force on a body moving uniformly in a circular path. However he did not have a correct understanding of the mechanics of circular motion.\nNewton's novel idea of\n1666\nwas to imagine that the Earth's gravity influenced the Moon, counter- balancing its centrifugal force. From his law of centrifugal force and\nKepler\n's third law of planetary motion, Newton deduced the inverse-square law.\nIn\n1679\nNewton corresponded with\nHooke\nwho had written to Newton claiming:-\n... that the Attraction always is in a duplicate proportion to the Distance from the Center Reciprocall ...\nM Nauenberg writes an account of the next events:-\nAfter his\n1679\ncorrespondence with\nHooke\n, Newton, by his own account, found a proof that Kepler's areal law was a consequence of centripetal forces, and he also showed that if the orbital curve is an\nellipse\nunder the action of central forces then the radial dependence of the force is inverse square with the distance from the centre.\nThis discovery showed the physical significance of\nKepler\n's second law.\nIn\n1684\nHalley\n, tired of\nHooke\n's boasting\n[\nM Nauenberg\n]\n:-\n... asked Newton what orbit a body followed under an inverse square force, and Newton replied immediately that it would be an ellipse. However in 'De Motu..' he only gave a proof of the converse theorem that if the orbit is an ellipse the force is inverse square. The proof that inverse square forces imply\nconic section\norbits is sketched in Cor.\n1\nto Prop.\n13\nin Book\n1\nof the second and third editions of the 'Principia', but not in the first edition.\nHalley\npersuaded Newton to write a full treatment of his new physics and its application to astronomy. Over a year later\n(1687)\nNewton published the\nPhilosophiae naturalis principia mathematica\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\nor\nPrincipia\nas it is always known.\nThe\nPrincipia\nis recognised as the greatest scientific book ever written. Newton analysed the motion of bodies in resisting and non-resisting media under the action of centripetal forces. The results were applied to orbiting bodies, projectiles, pendulums, and free-fall near the Earth. He further demonstrated that the planets were attracted toward the Sun by a force varying as the inverse square of the distance and generalised that all heavenly bodies mutually attract one another.\nFurther generalisation led Newton to the law of universal gravitation:-\n... all matter attracts all other matter with a force proportional to the product of their masses and inversely proportional to the square of the distance between them.\nNewton explained a wide range of previously unrelated phenomena: the eccentric orbits of comets, the tides and their variations, the precession of the Earth's axis, and motion of the Moon as perturbed by the gravity of the Sun. This work made Newton an international leader in scientific research. The Continental scientists certainly did not accept the idea of action at a distance and continued to believe in\nDescartes\n' vortex theory where forces work through contact. However this did not stop the universal admiration for Newton's technical expertise.\nJames II became king of Great Britain on\n6\nFebruary\n1685\n. He had become a convert to the Roman Catholic church in\n1669\nbut when he came to the throne he had strong support from Anglicans as well as Catholics. However rebellions arose, which James put down but he began to distrust Protestants and began to appoint Roman Catholic officers to the army. He then went further, appointing only Catholics as judges and officers of state. Whenever a position at Oxford or Cambridge became vacant, the king appointed a Roman Catholic to fill it. Newton was a staunch Protestant and strongly opposed to what he saw as an attack on the University of Cambridge.\nWhen the King tried to insist that a Benedictine monk be given a degree without taking any examinations or swearing the required oaths, Newton wrote to the Vice-Chancellor:-\nBe courageous and steady to the Laws and you cannot fail.\nThe Vice-Chancellor took Newton's advice and was dismissed from his post. However Newton continued to argue the case strongly preparing documents to be used by the University in its defence. However William of Orange had been invited by many leaders to bring an army to England to defeat James. William landed in November\n1688\nand James, finding that Protestants had left his army, fled to France. The University of Cambridge elected Newton, now famous for his strong defence of the university, as one of their two members to the Convention Parliament on\n15\nJanuary\n1689\n. This Parliament declared that James had abdicated and in February\n1689\noffered the crown to William and Mary. Newton was at the height of his standing - seen as a leader of the university and one of the most eminent mathematicians in the world. However, his election to Parliament may have been the event which let him see that there was a life in London which might appeal to him more than the academic world in Cambridge.\nAfter suffering a second nervous breakdown in\n1693\n, Newton retired from research. The reasons for this breakdown have been discussed by his biographers and many theories have been proposed: chemical poisoning as a result of his alchemy experiments; frustration with his researches; the ending of a personal friendship with Fatio de Duillier, a Swiss-born mathematician resident in London; and problems resulting from his religious beliefs. Newton himself blamed lack of sleep but this was almost certainly a symptom of the illness rather than the cause of it. There seems little reason to suppose that the illness was anything other than depression, a mental illness he must have suffered from throughout most of his life, perhaps made worse by some of the events we have just listed.\nNewton decided to leave Cambridge to take up a government position in London becoming Warden of the Royal Mint in\n1696\nand Master in\n1699\n. However, he did not resign his positions at Cambridge until\n1701\n. As Master of the Mint, adding the income from his estates, we see that Newton became a very rich man. For many people a position such as Master of the Mint would have been treated as simply a reward for their scientific achievements. Newton did not treat it as such and he made a strong contribution to the work of the Mint. He led it through the difficult period of recoinage and he was particularly active in measures to prevent counterfeiting of the coinage.\nIn\n1703\nhe was elected president of the\nRoyal Society\nand was re-elected each year until his death. He was knighted in\n1705\nby Queen Anne, the first scientist to be so honoured for his work. However the last portion of his life was not an easy one, dominated in many ways with the controversy with\nLeibniz\nover which of them had invented the calculus.\nGiven the rage that Newton had shown throughout his life when criticised, it is not surprising that he flew into an irrational temper directed against\nLeibniz\n. We have given details of this controversy in\nLeibniz\n's biography and refer the reader to that article for details. Perhaps all that is worth relating here is how Newton used his position as President of the\nRoyal Society\n. In this capacity he appointed an \"impartial\" committee to decide whether he or\nLeibniz\nwas the inventor of the calculus. He wrote the official report of the committee\n(\nalthough of course it did not appear under his name\n)\nwhich was published by the\nRoyal Society\n, and he then wrote a review\n(\nagain anonymously\n)\nwhich appeared in the\nPhilosophical Transactions of the Royal Society\n.\nNewton's assistant\nWhiston\nhad seen his rage at first hand. He wrote:-\nNewton was of the most fearful, cautious and suspicious temper that I ever knew.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}