{
  "nome_completo": "Isaac Todhunter",
  "nome_curto": "Isaac Todhunter",
  "ano_nascimento": "1820",
  "ano_morte": "1884",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Todhunter/",
  "lugar_nascimento": "Rye, Sussex, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Isaac Todhunter\n's father, George Todhunter, was a minister at a church in Rye. He died when Isaac was six years old and this left the family in severe financial difficulties. Isaac's mother Mary Bower\n(1790\n-\n1860\n; the daughter of William Bower\n)\nmoved to Hastings and opened a girls' school. Isaac Todhunter had an older brother George Todhunter born\n27\nMay\n1819\n.\nTodhunter was sent to a school in Hastings but did not show any promise even being described as 'unusually backward'. However, after being sent to a new school set by J B Austin from London, Isaac made excellent progress.\nAfter leaving school he became an assistant school master at a school in Peckham but attended evening classes at London University where he was taught by\nDe Morgan\n. He passed the entrance examinations and won a scholarship to study mathematics at London University, where, in addition to\nDe Morgan\n, he was taught by\nSylvester\n. While taking his degree course Todhunter also worked as a mathematics teacher at a large school in Wimbledon. He obtained a BA from University College London in\n1842\nand then an MA in\n1844\nwith a prize for the top mark in the examination.\nHe went to St John's College Cambridge, entering the College in\n1844\nand becoming senior\nwrangler\nand Smith's prizeman in\n1848\n. He was elected a fellow of the college in\n1849\nand taught there for\n15\nyears. He also undertook work as a private tutor and\nP G Tait\nand\nE J Routh\nwere among his pupils. One of his pupils was Leslie Stephen, the father of the author Virginia Woolf, who studied mathematics at Cambridge with Todhunter as his tutor. Stephen gave a delightful description of Todhunter as follows:-\nHe lived in a perfect atmosphere of mathematics: his books, all ranged in the neatest order, and covered with uniform brown paper, were mathematical. His talk, to us at any rate, was one round mathematics. Even his chairs and tables strictly limited to the requirements of pupils, and the pattern on his carpet, seemed to breath mathematics. By what mysterious process it was that he accumulated stores of miscellaneous information and knew all about the events of the time\n(\nfor such I afterwards discovered to be the fact\n)\nI have never been able to guess. Probably he imbibed it through the pores of his skin. Still less can I imagine how it came to pass that he published a whole series of excellent mathematical works. He probably wrote them in momentary interstices of time between one pupil's entering his sanctum and another leaving it.\nIn\n[\n7\n]\nthere is a description of Todhunter's interests which suggests that he had more interests outside mathematics than his students realised:-\nTodhunter's life was mainly that of a studious recluse. His sustained industry and methodical distribution of his time enabled him to acquire a wide acquaintance with general and foreign literature; and besides being a sound Latin and Greek scholar, he was familiar with French, German, Spanish, Italian, and also Russian, Hebrew, and Sanscrit. He was well versed in the history of philosophy, and on three occasions acted as examiner for the moral sciences tripos. His habits and tastes were singularly simple; and to a gentle kindly disposition he united a high sense of honour, a warm sympathy with all that was calculated to advance the cause of genuinely scientific study in the university, and considerable humour.\nTodhunter married Louisa Anna Maria Davies. They had four children Edward\n(\nborn\n1867)\n, Arthur\n(\nborn\n1869)\n, Agnes\n(\nborn\n1870)\n,and Herbert\n(\nborn\n1875)\n.\nTodhunter progressed from fellow to principal mathematical lecturer at St John's College where he resisted all attempts to reduce the central role of\nEuclid\nin mathematics courses.\nSylvester\nhad said in his\nBritish Association\naddress of\n1869\n:-\nI should rejoice to see ...\nEuclid\nhonourably shelved or buried deeper than ever did plummet sound, out of the schoolboy's reach....\nTodhunter replied:-\nWhatever may have produced the dislike to\nEuclid\nin the illustrious mathematician..., there is no ground for supposing that he would have been better pleased with the substitutes which are now offered and recommended in its place.\nTodhunter was always ready to respond to arguments and when\nTait\nsaid:-\nFrom the majority of the papers in our few mathematical journals, one would almost be led to fancy that British mathematicians have too much pride to use a simple method, while an unnecessarily complex one be had.\nTodhunter replied:-\nI take down some of these volumes, and turning over the pages I find article after article by Profs\nCayley\n,\nSalmon\nand\nSylvester\n, not to mention many other highly distinguished names. The idea of amending the elaborate essays of these eminent mathematicians seems to me something like the audacity recorded in poetry with which a superhuman hero climbs to the summit of the Indian Olympus and overturns the thrones of Vishnu, Brahma and Siva.\nIn\n1864\nTodhunter resigned his fellowship at St John's College, which he was forced to do as he wished to marry. His marriage to Louisa Anna Maria Davies took place on\n13\nAugust\n1864\n. Todhunter had been elected a fellow of the\nRoyal Society\nin\n1862\n. He became a founding member of the\nLondon Mathematical Society\nin\n1865\nalong with\nDe Morgan\n.\nIn\n1874\nTodhunter was elected as an honorary fellow of St John's College but he was taken ill in\n1880\nand, from that time on, his health deteriorated. He became progressively more paralysed with an illness which led to his death.\nTodhunter is best known for his textbooks and his writing on the history of mathematics. Among his textbooks are\nAnalytic Statics\n(1853)\n,\nPlane Coordinate Geometry\n(1855)\n,\nExamples of Analytic geometry in Three Dimensions\n(1858)\n. He also wrote some more elementary texts, for example\nAlgebra\n(1858)\n,\nTrigonometry\n(1859)\n,\nTheory of Equations\n(1861)\n,\nEuclid\n(1862)\n,\nMechanics\n(1867)\nand\nMensuration\n(1869)\n.\nAmong his books on the history of mathematics are\nA History of the Mathematical Theory of\nProbability\nfrom the Time of\nPascal\nto that of\nLaplace\n(1865\n, reprinted\n1965)\nand\nHistory of the Mathematical Theories of Attraction\n(1873)\n.\nThe wide circulation of his books is described in\n[\n7\n]\n:-\nNo mathematical treatises on elementary subjects probably ever attained so wide a circulation; and, being adopted by the Indian government, they were translated into Urdu and other Oriental languages.\nTodhunter received many awards for his contributions to mathematics. In addition to the fellowship of the\nRoyal Society\nhe served on its Council in\n1874\n, the same year in which he was awarded the\nAdams\nPrize for his work\nResearches on the\ncalculus of variations\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}