{
  "nome_completo": "Ismael Boulliau",
  "nome_curto": "Ismael Boulliau",
  "ano_nascimento": "1605",
  "ano_morte": "1694",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boulliau/",
  "lugar_nascimento": "Loudun, France",
  "lugar_morte": "Paris, France",
  "biografia": "Ismael Boulliau\n's mother was Susanna Motet and his father was Ismael Boulliau; both were Calvinists. Ismael Boulliau, the father, was a notary by profession but was an amateur astronomer who made observations in Loudun. His son, the subject of this biography, described him as having\n[\n6\n]\n:-\n... a very clever mind and a character suited both to seriousness and pleasantness.\nSusanna and Ismael Senior had their first son on\n3\nAugust\n1604\n. He was called Ismael after his father but he did not live. They then called their second child, who was born in the following year, Ismael. He did survive and become a famous astronomer and mathematician. He is the Ismael Boulliau of this biography.\nLet us note that there was in Loudun an important circle of intellectuals of which Ismael Boulliau Senior was part. They met in a local hotel and provided a focus for other visiting scholars. It was important for the young Ismael who attended these meetings and became acquainted with many leading men of the day. Certainly as the young boy grew up he was taught about astronomy by his father although he studied law and the humanities rather than science. We know that Boulliau's father observed the comet of\n1607\nwhich would later be called\nHalley\n's comet. He also observed another comet in\n1618\nwhen his son was\n13\nyears old. This must have been an exciting event for both father and son, and Boulliau later published details of his father's observations of these comets in his famous treatise of\n1645\n.\nBoulliau was brought up a Calvanist by two Calvanist parents. However when he was\n21\nyears old he became a convert to Roman Catholicism. By the age of\n26\nhe was ordained as a Catholic priest and one year later, in\n1632\n, he went to Paris. There he worked as a librarian associated with the brothers Pierre and Jacques Dupuy who were working on the Bibliothèque du Roi. This library, which dated back to the fourteenth century, was moved to Paris between\n1567\nand\n1593\n. It had been catalogued in\n1622\n, ten years before Boulliau arrived in Paris, and Pierre and Jacques Dupuy travelled throughout France amassing books and manusctripts for the library. The de Thou family were also heavily involved with the Bibliothèque du Roi, and they provided financial support for Boulliau in his work as a librarian. Boulliau had the right skills for the work he undertook, for he was a broad scholar with a deep interest in history, philosophy and classics, yet equally at home in the scientific circles of Paris where he began to shine building on the firm foundations in astronomy taught by his father.\nIn his capacity as librarian Boulliau travelled widely in Italy, Holland and Germany buying books. In\n1657\n, after the death of his two employers the brothers Dupuy, he worked as a secretary to the French ambassador to Holland who was a member of the de Thou family. He was to work again as a librarian, this time for the same French ambassador de Thou, but after a dispute with him in\n1666\nhe lived at the Collège de Laon. He spent the last five years of his life in the same occupation in which he started his career, becoming a priest at the Abbey St Victor.\nBoulliau was a friend of\nPascal\n,\nMersenne\nand\nGassendi\nand supported\nGalileo\nand\nCopernicus\n. He published\nDe natura lucis\nⓉ\n(\nThe Nature of Light\n)\n(1638)\nwhich was based largely on the discussions he had been having with\nGassendi\non the nature of light. He certainly did not agree with\nGassendi\n's atomic theory but took his own three dimensional view of light. His next work\nPhilolaus\nⓉ\n(\nPhilolaus of Croton\n)\n(1639)\nhad in fact been available in manuscript form for some years before it was published. It supported the world view of\nCopernicus\n, and is only remarkable in that it must have been quite difficult for a recent convert to Catholicism to openly support such views. His next work was on mathematics, namely his edition of the arithmetic text\nExpositio rerum mathematicarum ad legendum Platonem utilium\nⓉ\n(\nExposition of the mathematical works of Plato\n)\nby\nTheon of Smyrna\nwhich was the first printed version of this text. It appeared in\n1644\nand later in the same year he wrote to\nMersenne\n(\nwho was in Rome\n)\non\n16\nDecember\n[\n6\n]\n:-\nI think few people have seen my Theon, as only a few copies were taken to Italy. The Dutch and Polish received several.\nIn\n1645\nBoulliau published\nAstronomia philolaica\nⓉ\n(\nThe astronomy of Philolaus\n)\nwhich accepts elliptical orbits for planets. He wrote in the same letter to\nMersenne\n:-\nThe Astronomia philolaica is finally complete, but I have a quarrel on my hands, as\nJean-Baptiste Morin\n, the Prince - according to his own views - of the whole of Astronomy, has come across something not to his advantage or liking.  The simple suggestion I put to him should make him wiser and more reserved in making injurious statements against someone who has never made such cruel remarks, and who has never offended him.\nHe claimed that if a planetary moving force existed then it should vary inversely as the square of the distance\n(\nKepler\nhad claimed the first power\n)\n:-\nAs for the power by which the Sun seizes or holds the planets, and which, being corporeal, functions in the manner of hands, it is emitted in straight lines throughout the whole extent of the world, and like the species of the Sun, it turns with the body of the Sun; now, seeing that it is corporeal, it becomes weaker and attenuated at a greater distance or interval, and the ratio of its decrease in strength is the same as in the case of light, namely, the duplicate proportion, but inversely, of the distances that is,\n1\nd\n2\n\\large\\frac{1}{d^{2}\\normalsize}\nd\n2\n1\n​\n.\nHowever he then argues that the sun does not produce a planetary moving force:-\n... I say that the Sun is moved by its own form around its axis, by which form it was ignited and made light, indeed I say that no kind of motion presses upon the remaining planets ... indeed\n[\nI say\n]\nthat the individual planets are driven round by individual forms with which they were provided ...\nThe\nAstronomia philolaica\nrepresents the most significant treatise between\nKepler\nand\nNewton\nand it was praised by\nNewton\nin his\nPrincipia\n, particularly for the inverse square hypothesis and its accurate tables. There is one aspect of Boulliau's philosophy which is well worth commenting on - namely the fact that he believed in simple explanations and moreover he wanted many different observed properties to result from a single cause. He did not achieve his aim, that would be achieved by\nNewton\n, but at least he set the scene for such developments. He later published further mathematics texts, but they are not of much significance.\nDe lineis spiralibus\n(1657)\nrelated to work by\nArchimedes\nand\nPappus\n. Then in\n1682\nhe published\nOpus novum ad arithmeticam infinitorum\nⓉ\n(\nA new work on infinite arithmetic\n)\nwhich he claimed clarified the\nArithmetica infinitorum\nⓉ\n(\nInfinite arithmetic\n)\nof\nWallis\n. The other astronomy text worth mentioning is\nAd astronomos monita duo\nⓉ\n(\nTwo warnings to astronomers\n)\n(1667)\nin which he established for the first time the period of the variable star Mira Ceti, a long-period variable. He gave\n333\ndays which is a good estimate and only about one day too long.\nBoulliau was a close associate of\nHuygens\nwho turned to him first with his discovery of the rings of Saturn and sent him pendulum clocks. One of the most interesting aspects for modern research into Boulliau, however, is that he was a prolific correspondent. This correspondence covers about sixty years, between shortly after his arrival in Paris in\n1632\nand the year before his death. It is also interesting that this correspondence covers\n45\nyears after\nMersenne\n's death, so we can think of him as filling his role. How many letters are we talking about here? It is amazing to realise that historians have over\n5\n,\n000\nletters and so their assessment is still an ongoing task. They are full of news, much of it trivial in nature, about science and politics.\nAlthough he moved in the circles associated with\nMersenne\nwhich later became the\nAcademy of Sciences\n, he was never elected to that body. However, he was elected a foreign associate of the\nRoyal Society\nin\n1667\n.",
  "math_areas": []
}