{
  "nome_completo": "István Fenyő",
  "nome_curto": "István Fenyő",
  "ano_nascimento": "1917",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fenyo/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "István Fenyő\n's first name appears on papers he wrote as Étienne, Stefan, Stephan or Stephen, as well as István. He was born into a family who were cultured and interested in the arts. They provided an environment in which István, from a young age, was able to enjoy a wide variety of art forms as well as interesting himself in the humanities and sciences. He made the most of these opportunities\n[\n3\n]\n:-\nEverything attracted and excited his curiosity, his insatiable thirst for knowledge and his love of life. Mathematics, technics, art, music, really every expression of human creativity, fascinated him to the extent of desiring to master whatever subject he explored.\nHe studied mathematics and physics at the Pázmány Péter University in Budapest advised by Lipót Fejér who held the chair of mathematics at the University for\n48\nyears from\n1911\nto\n1959\n. In\n1939\nFenyő graduated with a qualification which allowed him to teach mathematics and physics at secondary school in Hungary. However he continued his studies at the University, not in mathematics or physics but rather in chemistry. In\n1942\nhe was awarded a Diploma in Chemistry but he undertook research in mathematics publishing\nÜber die \"Polynom-Kerne\" der linearen Integralgleichungen\nⓉ\n(\nOn 'polynomial kernels' of linear integral equations\n)\nin\n1943\n. After studying for his doctorate he submitted his thesis\nOn the theory of mean values\n(\nHungarian\n)\nin\n1945\n. Following this he was appointed as a lecturer in the Technical University of Budapest where he was promoted to Extraordinary Professor of Mathematics in\n1950\n, then full Professor ten years later.\nThe papers he published up to his promotion to extraordinary professor included\nThe inversion of an algorithm\n(1947)\n,\n(\nwith János Aczél\n)\nOn fields of forces in which centres of gravity can be defined\n(1948)\n,\n(\nwith János Aczél\n)\nÜber die Theorie der Mittelwerte\nⓉ\n(\nOn the theory of mean values\n)\n(1948)\n,\nÜber den Mischalgorithmus der Mittelwerte\nⓉ\n(\nOn the mixed algorithm of averages\n)\n(1949)\n,\nThe notion of mean-values of functions\n(1949)\n, and\n(\nwith János Aczél and János Horváth\n)\nSur certaines classes de fonctionnelles\nⓉ\n(\nOn some functional classes\n)\n(1949)\n. In addition during this period he wrote\n(\nwith G Alexits\n)\nthe book\nMathematics and the dialectial materialism\n(\nHungarian\n)\n(1948)\nand the paper\nLes fondaments des mathématiques et la philosophie du matérialisme dialectique\nⓉ\n(\nThe foundations of mathematics and the philosophy of dialectical materialism\n)\ndelivered at the Tenth International Congress of Philosophy in Amsterdam in August\n1949\nand printed in the Proceedings in the following year.\nFenyő wrote a number of famous textbooks on applications of mathematics to chemistry and technology. His book on\nMathematics for chemists\nwas written jointly with G Alexits and published first in Hungarian in\n1951\n. The third Hungarian edition of\n1960\nwas translated into German under the title\nMathematik für Chemiker\nⓉ\n(\nMathematics for chemists\n)\n(1962)\nand into French under the title\nLes méthodes mathématiques en chimie\nⓉ\n(\nMathematical methods in chemistry\n)\n(1969)\n. Fenyő's Hungarian text\nMathematics in electrical engineering\nwas written with Thomas Frey and published in two volumes, the first in\n1964\nwith the second appearing in the following year. A Bulgarian translation of these two volumes was published in\n1977\nand\n1979\n. Fenyő also wrote\nModerne mathematische Methoden in der Technik\nⓉ\n(\nModern mathematical methods in technology\n)\n, a three volume work published in\n1967\n,\n1971\nand\n1980\n. The first volume was written jointly with Thomas Frey, but the second volume was written by Fenyő alone. Both volumes were later translated into English.\nKeith Stewartson\nreviewed the first volume and we present extracts from that review:-\nThe aim of this book is to describe some of the developments in mathematics during this century which have had or are likely to have a significant impact on the work of a theoretical engineer or technologist. The material should therefore be regarded as supplementing the methods of classical analysis, algebra and geometry which are now the bread and butter of research workers. ...\nThe book opens with a discussion of elementary set theory,\nLebesgue\nintegration and\nStieltjes\nintegration and then goes on to the first major topic, the operator calculus, following the ideas of\nMikusinski\nand others. The authors prove\nTitchmarsh\n's theorem, which is central to the theory, and include a number of worked examples. The next major topic is the theory of distributions. Here, after laying the groundwork, the authors discuss sequences, Fourier transforms and the regularization of functions, and conclude with a number of applications. The last topic in the book is the theory of non-linear ordinary differential equations, beginning with questions of existence consequences and stability. The structure of the solutions is then examined, including singular points and limit cycles, and the book concludes with an account of the elementary theory of non-linear oscillations.\nV Komkov reviewing the second volume of the English addition adds this interesting comment after his review:-\nMost textbooks with titles \"Mathematical methods for engineers\"\n(\nor for technicians, or for other users of mathematics at the elementary level\n)\ncontain a mixture of topics which depend on the applications the author has in mind and on the mathematical background of the author. The unusual feature of this volume is the unified content: linear algebra, graph theory and network theory, with heavy reliance on linear algebra methods throughout.\nThe third volume published in\n1980\n, although still presenting methods for engineers, is more involved with one of Fenyő's main research topics, namely\nintegral equations\n. The contents are described in a review:-\nThe first section, comprising over half the book, deals with the theory of linear operators. The matters discussed are metric and normed spaces with particular reference to\nHilbert spaces\n,\nHahn\n-\nBanach\ntheory, operators\n(\nincluding inverse, dual and compact operators\n)\nand eigenvalues and eigenvectors. The second section, which is over a quarter of the book, discusses linear integral equations. Amongst the topics covered are\nVolterra\nintegral equations and their relation with ordinary differential equations,\nFredholm\nequations, self-conjugate and non-self-conjugate integral operators, and the associated eigenvalue theory. The third section is on applications of integral equations. This covers topics such as the\nGreen\nfunction technique for a one-dimensional\nSturm\n-\nLiouville\nproblem, and\nDirichlet\nand\nCarl Neumann\nproblems for the two- and three-dimensional Laplacian operator.\nOther books by Fenyő on integral equations are\nIntegral equations - a book of problems\n(\nHungarian\n)\n(1957)\n, and the four volume work\n(\nwritten with H-W Stolle\n)\nTheorie und Praxis der linearen Integralgleichungen\nⓉ\n(\nTheory and practice of linear integral equations\n)\n(1982\n,\n1983\n,\n1983\n,\n1984)\n. A E Heins, reviewing the final three volumes, writes:-\nThese three volumes complete the encyclopaedic work\n(\nroughly\n1700\npages\n)\nby Fenyő and Stolle on the theory and application of linear integral equations. Their thesis is that the classical theory of linear integral equations produced many ideas for the later development of the theory of linear operators, and in turn\nfunctional analysis\nhas helped the further development of integral equations.\nIn\n[\n3\n]\nPaganoni describes Fenyő's personality:-\nAn extremely cordial man, full of drive and initiative, he was a source of constant inspiration to those who had the good fortune of knowing him. He spoke several languages fluently and therefore was able to communicate directly, sharing the richness of his mind, with people of varied linguistic background. A brilliant conversationalist, with his lively anecdotal style he was able to captivate all who had the pleasure of talking to him.\nHe also described the range of Fenyő's interests:-\n... he was an extraordinarily eclectic spirit, as witnessed by the interest which, in his later years, he expressed in the mathematical aspects of\nLeonardo da Vinci\n's manuscripts. Such investigative curiosity is also clearly reflected in his mathematical studies. The soundness of his basic culture, coupled with his innate curiosity, led István Fenyő to seek the solution of problems in various areas of mathematics. Therefore it is not surprising to find, in addition to his scientific works in Mathematical Analysis, also works on the History of Mathematics, on the Philosophy of Science, and countless others on the applications of mathematics to Medicine, Engineering and Computer Science.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}