{
  "nome_completo": "Ivan Vsevolodovich Meshchersky",
  "nome_curto": "Ivan Vsevolodovich Meshchersky",
  "ano_nascimento": "1859",
  "ano_morte": "1935",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meshchersky/",
  "lugar_nascimento": "Arkhangelsk, Russia",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Ivan Vsevolodovich Meshchersky\n's family were not particularly well off but they managed to give him a solid education at the\nGymnasium\nat Arkhangelsk. He entered this secondary school in\n1871\nand graduated with the gold medal in\n1878\n. He then entered the Physics and Mathematics Faculty of St Petersburg University where he studied mathematics and mechanics. There he attended mathematics lectures by\nChebyshev\nand\nA N Korkin\n, who was himself a student of\nChebyshev\n.\nMeshchersky taught in St Petersburg for\n58\nyears. He obtained a Master's Degree in applied mathematics in\n1889\nand was appointed as a\ndozent\nat the university in\n1890\n. In the following year he was appointed to the chair of mechanics at St Petersburg Women's College and he held this, in addition to a number of other posts, until\n1919\nwhen the College ceased to exist as an independent institution being incorporated into St Petersburg University.\nHe undertook research on mechanics, publishing works such as\nThe pressure on a wedge in a two-dimensional stream of unbounded width\nin\n1886\n. This paper generalised the solution of the problem of the flow of a jet around a symmetric wedge obtained by D K Bobylev in\n1881\nto a nonsymmetric wedge. Meshchersky obtained a complete solution for this more complex case of flow around a nonsymmetric wedge and the paper\n[\n3\n]\nconsiders in detail the mathematical methods which he used, in particular comparing his methods to analogous ones of Western authors.\nMeshchersky is best known, however, for his work on the motion of bodies of variable mass which he described in January\n1893\nat a meeting of the\nSt Petersburg Mathematical Society\n. He continued to develop his work on this topic for his dissertation entitled\nThe dynamics of a point of variable mass\n, which he submitted in\n1897\n[\n1\n]\n:-\nHe began the thesis with a discussion of the many instances in which the mass of a moving body changes, citing as examples the increase of the mass of the earth occasioned by meteorites falling on it; the increase of the mass of an iceberg with freezing and its decrease with thawing; the increase of the mass of the sun through its gathering of cosmic dust and its decrease with radiation; the decrease of the mass of a rocket as its fuel is consumed ...\nHe applied his theory to comets being the first to study the inverse problem of determining the loss of mass from a knowledge of the orbit and the forces acting. His work on the motion of particles of variable mass formed the basis for rocket technology developed after\n1945\n.\nEven before he had submitted his dissertation Meshchersky had shown that he had another major interest in his life which was in teaching. He published\nThe teaching of mechanics in certain institutions of higher education in Italy, France, Switzerland and Germany\nin\n1895\n. This played a major role in raising the standards of the teaching of mechainis in Russia. The St Petersburg Polytechnic Institute was being set up at this time and Meshchersky played a major role in developing the curriculum. He was appointed as Head of Applied Mathematics at the Polytechnic Institute in\n1902\n.\nThe course which Meshchersky developed in mechanics became famous and in\n1914\nhe published a textbook on the topic\nA collection of problems of mechanics\n. This famous book had reached its\n26\nth\nRussian edition by\n1960\nand it was this\n26\nth\nedition which was translated into English and adapted to British units by R Romicki. This was published by Pergamon Press of the Macmillan Company of New York in\n1965\n. The text has three parts: Statics of rigid bodies, Kinematics, and Dynamics.",
  "math_areas": [
    "Applied Mathematics"
  ]
}