{
  "nome_completo": "Erik Ivar Fredholm",
  "nome_curto": "Ivar Fredholm",
  "ano_nascimento": "1866",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fredholm/",
  "lugar_nascimento": "Stockholm, Sweden",
  "lugar_morte": "Danderyd, County of Stockholm, Sweden",
  "biografia": "Ivar Fredholm\n's parents were Ludvig Oscar Fredholm and Catharina Paulina Stenberg. Ludvig Fredholm was a merchant who made his fortune replacing gas lamps with electric lamps. He married Catharina, who was herself the daughter of a merchant, on\n2\nMay\n1861\nin Arboga. They were wealthy, well-educated people who wanted the very best education for their sons Ivar and John Oscar\n(\nborn\n1875)\n, and they were able to afford the very best. Ivar, who was born in the Klara area of Stockholm City, proved a brilliant school pupil at the Beskowska School in Stockholm and he was awarded his baccalaureate on\n16\nMay\n1885\n.\nSoon after the award of his baccalaureate, Fredholm entered the Royal Technological Institute in Stockholm\n(\nknown as KTH\n)\n, studying there for a year. Bernkopf writes in\n[\n1\n]\n:-\nDuring this single year he developed an interest in the technical problems of practical mechanics that was to last all his life and that accounted for his continued interest in applied mathematics.\nAfter the year at the Royal Technological Institute, Fredholm enrolled as a student at the University of Uppsala. There was a very definite reason why he chose to go to Uppsala rather than Stockholm. At this early stage of his university education he had plans to eventually undertake doctoral studies and Uppsala was the only university in Sweden at that time which granted doctorates. Uppsala awarded him a Master of Science degree on\n28\nMay\n1888\nbut now he had some problems as how to proceed for it was only through Uppsala that he could be awarded a doctorate yet the person whom he really wanted to work under was\nMittag-Leffler\n. It was eight years earlier that\nMittag-Leffler\nhad been appointed as the first holder of the chair of mathematics at the newly founded University of Stockholm\n(\ncalled Stockholms Högskola at this time\n)\nso to be his student Fredholm had to study at Stockholm. He solved his difficulties by remaining registered for his doctorate at Uppsala but studying at Stockholm under\nMittag-Leffler\n.\nFredholm's first publication came in\n1890\nwhen he published\nOn a special class of functions\nin the\nRoyal Swedish Academy of Sciences\n. In this paper he constructed a function which is analytic on the unit disk, is infinitely differentiable on the closed disk, but has no analytic continuation outside the disk. As was always the case with all the deep mathematical results which Fredholm produced, this result was inspired by mathematical physics, in this case by the heat equation. The result went further than earlier examples by\nMittag-Leffler\nand\nWeierstrass\n. It so impressed\nMittag-Leffler\nthat he sent a copy of the paper to\nPoincaré\n. We should note, however, that there is an error in Fredholm's paper, but fortunately one which can be corrected. He used a result proved by\nKovalevskaya\nin her\nHabilitation\nthesis but, through a misinterpretation, applied the result in a case where it was not valid. This paper is discussed in detail in\n[\n6\n]\nwhere the authors show how Fredholm's argument can be corrected.\nOn\n30\nMay\n1893\nFredholm was awarded his Ph.D. from the University of Uppsala and then on\n31\nMay\n1898\nhe received the degree of Doctor of Science from the same university. His\n1898\ndoctoral dissertation involved a study of partial differential equations, the study of which was motivated by an equilibrium problem in elasticity. He solved his operator equation in the particular cases which arise in the study of the physical problem in his thesis\n(\nand in the paper which appeared in\n1900\nbased on that thesis\n)\nwhile the general case was solved by Fredholm somewhat later and not published until\n1908\n.\nFredholm is best remembered for his work on\nintegral equations\nand\nspectral theory\n. The basis for his thinking is explained in\n[\n10\n]\n(\nsee also\n[\n4\n]\n)\n:-\nWe may ask what in Fredholm's eyes was the essential basis of his work. The answer is immediate: potential theory ... Already in\n1895\nafter a seminar lecture in\n1895\nhe had talked about\nDirichlet\n's problem as one of elimination. ... Two years later in Stockholm a lecture about the 'principal solutions' of Roux and their connections with\nVolterra\n's equation led to a vivid discussion Finally, after a long silence Fredholm spoke and remarked in his usual slow drawl: in potential theory there is also such an equation.\nIn fact much of this work was accomplished during the months of\n1899\nwhich Fredholm spent in Paris studying the\nDirichlet\nproblem with\nPoincaré\n,\nÉmile Picard\n, and\nHadamard\n. In\n1900\na preliminary report on his theory of Fredholm integral equations was published as\nSur une nouvelle méthode pour la résolution du problème de Dirichlet\nⓉ\n(\nOn a new method for solving the Dirichlet problem\n)\n.\nVolterra\nhad earlier studied some aspects of integral equations but before Fredholm little had been done. Of course\nRiemann\n,\nSchwarz\n,\nCarl Neumann\n, and\nPoincaré\nhad all solved problems which now came under Fredholm's general case of an integral equation; this was an indication of how powerful his theory was.\nFredholm's contributions quickly became well known to the world of mathematics when Holmgren lectured on Fredholm's theory at Göttingen in\n1901\n.\nHilbert\nimmediately saw the he importance of Fredholm's theory, and during the first quarter of the\n20\nth\ncentury the theory of integral equations became a major research topic. Fredholm published a fuller version of his theory of integral equations in\nSur une classe d'équations fonctionelle\nⓉ\n(\nOn a class of functional equations\n)\nwhich appeared in\nActa Mathematica\nin\n1903\n.\nHilbert\nextended Fredholm's work to include a complete\neigenvalue\ntheory for the Fredholm integral equation. This work led directly to the theory of Hilbert spaces.\nGarding writes in\n[\n3\n]\n:-\nFredholm's work on integral equations was met with great interest and boosted the morale and self-respect of Swedish mathematicians who so far had been working under the shadow of the continental cultural empires Germany and France. Integral equations had now become a new mathematical tool not confined to symmetrical kernels. It was developed during several decades and was seen as a universal tool with which it was possible to solve the majority of boundary value problems of physics. But the qualitative insight that the theory gave could also be achieved in a simpler way. The significance of Fredholm's work was more the qualitative insight than the explicit formulas.\nWe have moved forward in time in our discussions in order to explain something of the importance of Fredholm's mathematical discoveries. As to his career, after the award of his Doctor of Science degree in\n1898\nhe was appointed as a lecturer in mathematical physics at the University of Stockholm. He spent his whole career at the University of Stockholm being appointed to a chair in mechanics and mathematical physics on\n28\nSeptember\n1906\n. In\n1909\n-\n1910\nhe was Pro-Dean and then Dean in Stockholm University.\nHowever, Fredholm also held various other positions, becoming a civil servant in\n1899\nand then a Head of Department for the Swedish State Insurance Company in\n1902\n. He was an actuary in the Skandia Insurance Company from\n1904\nto\n1907\n. Fredholm also served on many government committees and he also served on the International Committee for Weights and Measures.\nOn\n31\nMay\n1911\nFredholm married Agnes Maria Liljeblad, the daughter of Protestant clergy parents, in Sankt Olai. At this time Fredholm was\n45\nyears old and his wife was\n33\n. Their eldest son, Bengt Ivar Fredholm, was born in\n1912\nand he became a major in the Swedish army.\nFredholm wrote papers with great care and attention so he produced work of high quality which quickly gained him a high reputation throughout Europe. However his papers required so much effort from him that he wrote only a few and in fact his\nComplete Works\nin mathematics comprises of only\n160\npages. After\n1910\nhe wrote little beyond revisiting his earlier work.\nIn\n[\n10\n]\n(\nsee also\n[\n4\n]\n)\n, Zeilon, who was a student of Fredholm's, described his style as a lecturer:-\nIn his Stockholm lectures Fredholm loved to talk at length about the great problems and methods of classical mathematical physics which had been the main theme of his scientific work. But this did not prevent him from talking about all parts of modern physics. Fredholm was not what is usually called a brilliant speaker He talked slowly in a monotone voice and it could happen that he got embroiled in computational mistakes at the blackboard But this had little importance In fact, his lectures revealed an unusual mastery of his subject and he had the ability of communicating to his students a feeling for the unity and logic of physical theory which is so apparent in his own written work.\nFredholm also, as we indicated above, had a career in actuarial science and from\n1902\nonwards he occupied himself with studying various questions in this area. He made a particularly important contribution by proposing an elegant mathematical formula to determine the surrender value of a life insurance policy.\nIt is tempting to think that with two mathematical careers running in parallel, namely applications to physical applied mathematics and applications to actuarial science, Fredholm would have had little time for other interests. This, however, was not so for he was also a musician and for him this was more than just a leisure activity. As a young boy he played the flute, but later took up playing the violin. He particularly loved to play Bach. Again he combined his talents, applying his mechanical skills to music as well as to mathematics. Unlikely as it sounds, he built his first violin from half a coconut, while he also used his talents at building machines to make one to solve differential equations. His interest in machines and mechanics led to his membership of the Swedish Society of Engineers and he frequently provided scientific advice to that Society. At the time of his death he was working on the mathematics of the acoustics of the violin, but the unfinished work he left on this topic has proved impossible to understand.\nFredholm received many honours for his mathematical contributions, including the V A Wallmarks Prize for the theory of differential equations in\n1903\n, the\nPoncelet\nPrize from the French\nAcademy of Sciences\nin\n1908\n, and an honorary doctorate from the University of Leipzig in\n1909\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}