{
  "nome_completo": "John Charles Burkill",
  "nome_curto": "J C Burkill",
  "ano_nascimento": "1900",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burkill/",
  "lugar_nascimento": "Holt, Norfolk, England",
  "lugar_morte": "Sheffield, England",
  "biografia": "J C Burkill\nwas an only child who was called Charlie by members of his family but John by those outside his family until he was twenty-four years of age. His mother was Bertha Bourne from a family of farmers and builders based in Woodchurch, Kent. His father was Hugh Roberson Burkill, known as Rob, a schoolmaster who came from a farming family from Winteringham in Lincolnshire. To avoid the problem of different names, we will refer to the subject of this biography as Burkill throughout.\nBurkill began his secondary education at Richmond county school which he entered in\n1911\n. Three years later he entered St Paul's School, London, where he was an outstanding scholar of classical Greek and Latin as well as showing considerable talent for mathematics. After winning a scholarship to Trinity College, Cambridge in\n1917\nhe spend a short time in the Royal Engineers as World War I had not ended. However he was soon commissioned but then demobbed after the war ended. He continued with his education entering Trinity College, Cambridge in January\n1919\n. After taking his first degree in\n1921\nhe remained at Cambridge as a research student being elected to a fellowship in the following year after submitting a dissertation on surface areas. He then won a Smith's prize in\n1923\nfor\nFunctions of intervals and the problem of area\n.\nIn\n1924\nBurkill accepted the chair of pure mathematics at Liverpool and two years later\nBesicovitch\njoined him on the staff. He married Margareta Braun on\n1\nAugust\n1928\nand, at her insistence, he was known to all as Charles from that time on. Greta Braun\n(\nas she was called\n)\nhad been born in Germany, having a German father and a Russian mother. Greta and Charles had three children, a son and two daughters. In\n1929\nBurkill returned to Cambridge taking up a a university lectureship and a lectureship at Peterhouse where he was also elected to a fellowship. He remained in this post for the rest of his life.\nAfter Hitler came to power in Germany in\n1933\nthere were many refugees who came to England and the Burkills did amazing work supporting refugee children\n[\n1\n]\n:-\nFrom\n1933\nonwards\n[\nGreta Burkill\n]\nhelped to bring out of Germany and settle in England many hundreds of refugee children, and the Burkills themselves took into their family and assumed responsibility for the education of an Austrian and a German boy\n(\nHarry Reuter\n)\n, who both went on to achieve positions in university departments of mathematics ... Several other children became for a time in effect members of the Burkill family while being helped to build new lives.\nIn fact the years of World War II saw Burkill with tasks which gave him no time to continue with his mathematical research. He remained at Cambridge while many others took up war service, but he now had to take on administrative duties to cover for his absent colleagues. He also joined the university training corps and had reached the rank of major in the Royal Engineers section by the time the war ended. He resumed his research in mathematics winning the\nAdams\nprize in\n1948\nfor an essay on integrals and trigonometric series. His research achievements were recognised in\n1953\nwhen he was elected to a fellowship of the\nRoyal Society\n.\nBurkill is equally well known for his research in analysis and the excellent teaching books which he wrote. He research is introduced in\n[\n2\n]\nby saying:-\nBurkill's work is all in the theory of functions of a real variable with its main emphasis on theories of differentiation and integration. This was a particularly active area of research in the early decades of this century after the pioneering work of\nLebesgue\n,\nBorel\nand their contemporaries in establishing the concepts of measure and the Lebesgue integral associated with it.\nBurkill introduced what is now called the 'Burkill integral' and applied it to extend\nW H Young\n's work on the definition of the area of a curved surface. He introduced the notion of approximate differentiation extending and simplifying work of\nBesicovitch\n.\nAmong his books are\nThe Lebesgue integral\n(1951)\n,\nA first course in mathematical analysis\n(1962)\nand\nA second course in mathematical analysis\n(1970)\n. These are described in\n[\n2\n]\nas follows:-\nThese all display, as we might expect, not only his mastery of the field but a lucidity and elegance that encourages his readers to appreciate the profound aesthetic quality of good mathematics.\nBurkill himself sets out is aims in writing\nThe Lebesgue integral\nin the introduction to the text:-\nMy aim is to give an account of the theory of integration due to\nLebesgue\nin a form which may appeal to those who have no wish to plumb the depths of the theory of real functions. There is no novelty of treatment in this tract; the presentation is essentially that of\nLebesgue\nhimself. The groundwork in analysis and calculus with which the reader is assumed to be acquainted is, roughly, what is in\nHardy\n's \"A course of pure mathematics \"\n(1908)\n.\nA second course in mathematical analysis\nis described by\nT M Apostol\nin a review as a:-\n... well-written text is designed as an introductory course in real and complex analysis for students familiar with elementary calculus and linear algebra.\nThe book covers: sets and functions, metric spaces, continuous functions on metric spaces, real and complex limits and series, uniform convergence,\nRiemann\n-\nStieltjes\nintegration, multivariable differential and integral calculus,\nFourier\nseries,\nCauchy\n's theorem,\nLaurent\nexpansions, residue calculus, infinite products, the factor theorem of\nWeierstrass\n, asymptotic expansions, and applications to special functions in particular the gamma function.\nIn\n1961\nCambridge promoted Burkill to be Reader in Mathematical Analysis. He retired in\n1967\nand a year later Sir Herbert Butterfield retired as Master of Peterhouse. Burkill was appointed to succeed Butterfield as Master and he served from\n1968\nuntil\n1973\n[\n1\n]\n:-\n... it was as keeper of the college and its traditions that Burkill saw his role. Coming to office at a time of widespread student unrest, he took a far-sighted view of its eventual course, and devised effective machinery for consultation and dialogue with junior members without saddling the college with a statutory commitment to full participation in its government more easily incurred than shed. His relationship with the fellows was also based on consultation, and in particular on cultivating a spirit of trust and co-operation between the master and the tutors ...\nAfter retiring as Master, he served as editor of the\nMathematical Proceedings of the Cambridge Philosophical Society\n. However he continued his interest in integration theories and published a short paper\nFourier-Stieltjes integrals\nin\n1973\n. It examines problems in\nFourier analysis\nthat led to the development of the theory of generalised functions.\nIn\n[\n2\n]\nBurkill is described as having a:-\n... fastidious concern for accuracy and economy in the use of words. In respect of the spoken word, this economy became something of a legend. Taciturn is not a sufficiently friendly word to describe his conversational style, because it contained no hint of malice or lack of concern but only an unerring judgement about what was important, and the clearest way of saying it. What is even more important is that his distaste for excessive display of feeling concealed, at first, a truly generous and hospitable nature.\nHis character is described in\n[\n1\n]\nas follows:-\nBrevity, precision, and conciseness were as characteristic of Burkill's conversation as of his written style, and his silences could be eloquent. He was an accomplished mimic. As a boy he had been given to practical joking, and though in later life his sense of humour was well under control it was never far from the surface. Fellows of Peterhouse were familiar with\n(\nand were indeed known to imitate\n)\nthe slight sideways vibration of the body which betokened amusement and often precluded a mildly ironical or deflationary quip.\nGreta Burkill died in\n1984\nand Burkill did a large amount of work in putting her papers on her refugee work into order so that they could be deposited in the Cambridge University Library. We mentioned above that the Burkills took over the responsibility of educating two refugee children who went on to become professional mathematicians. One of these was Harry Burkill who was on the staff at Sheffield University. After his health failed, Burkill lived in a Sheffield nursing home. He died there of bronchopneumonia although he had suffered from Alzheimer's disease for some time. After he was cremated his ashes were scattered at Hutcliffe Wood crematorium in Sheffield.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}