{
  "nome_completo": "John William Scott Cassels",
  "nome_curto": "J W S Cassels",
  "ano_nascimento": "1922",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cassels/",
  "lugar_nascimento": "Durham, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "J W S Cassels\nis known as Ian Cassels. His parents were John William Cassels, Director of Agriculture in County Durham in the north of England, and Muriel Speakman Lojoit. He attended Neville's Cross Council School in Durham and from there he went to George Heriot's School in Edinburgh where he completed his schooling. He then entered Edinburgh University, graduating with an M.A. in\n1943\n.\nFrom about July\n1943\n, shortly after graduating, until after VJ day in\n1945\nhe worked in the Naval Section of the Government Code and Cypher School at Bletchley Park. He started in the newly formed NS II J\n(\nG\n)\n, which was established under Edward Simpson to attack JN\n25\n, the principal code of the Japanese Navy. He was a 'TJAO'\n(\ntemporary junior assistant officer, which was equivalent to the most junior commissioned rank in the armed forces\n)\n.\nJN\n25\nwas an enciphered code, in which\n5\n-figure code groups were enciphered by adding\n5\n-figure random 'additives'\n(\nmodulo\n10)\n. The main task of his part of NS II J was to 'strip'  the additive from the final group as transmitted. To do so they partly relied on established 'good groups' : code groups known to be in the codebook because they had appeared previously. Simpson's team had to determine how one speculative additive rated against another. Simpson later wrote that\nA rapidly expanding team of civilians and WRENS had to make quick judgments -- subtle, quickly learned, objective, and standardized judgments -- about whether the weight of evidence suggested that particular five-digit groups might be part of the Japanese code or just random.\nCassels worked with Simpson and Jimmy Whitworth, another mathematician. They adopted applied\nBayes\n'  Theorem, when it was definitely unorthodox to do so, to combine the weights of the evidence that each speculative codegroup provided, then used logarithms to allow addition and finally rounded the logarithms to two-digit scores which could be added easily by unskilled staff.\n(\nSee\n[\n1\n]\nand\n[\n2\n]\n)\n.\nCassels wrote, or contributed to, the following GCCS histories\n(3\nare still retained on the grounds of national security\n)\n-\nHW\n8\n/\n151\nJ Cassels,\nHistory of the Japanese Naval Subtractor Systems Research Party\n,\n1944\nNov\n01\n-\n1945\nSep\n30\n[\nRetained Until\n26\nJune\n2009]\nHW\n43\n/\n26\nC H O'D Alexander, J W S Cassels, H R Foss, P Hall and A S C Ross,\nGC&CS Naval Cryptanalytic Studies Volume I: Introduction and Scoring Techniques\n1939\nSep\n01\n-\n1945\nAug\n30\n[\nRetained by Department under Section\n3\n.\n4]\nHW\n43\n/\n33\nGC&CS J W S Cassels and M A N Loewe,\nNaval Cryptanalytic Studies Volume VIII: The Japanese Fleet General Purpose System I\n1939\nSep\n01\n-\n1945\nAug\n30\n[\nRetained by Department under Section\n3\n.\n4]\nHW\n43\n/\n36\nC H O'D Alexander, L S Brown, J W S Cassels, J E T English, H R Foss, H L John, J T Martin, J M G Pollard, B E Russell, L E S Taylor, H A Thurtson and G C Wall,\nGC&CS Naval Cryptanalytic Studies Volume XI: Japanese Early High-Grade Cyphers and Minor Additive Cyphers\n1939\nSep\n01\n-\n1945\nAug\n30\n[\nRetained by Department under Section\n3(4)\nof the Public Records Act\n1958]\nIn order to study for his doctorate Cassels entered Trinity College Cambridge, being awarded a Ph.D. in\n1949\n. In this year he was elected a fellow of Trinity College. Also in\n1949\nhe married Constance Mabel Merritt Senior; they had one son and one daughter. Constance Cassels died in\n2000\n.\nAfter one year as a lecturer in mathematics at the University of Manchester Cassels returned to Cambridge in\n1950\nas a lecturer. In\n1963\nhe was appointed Reader in Arithmetic at Cambridge and in the same year he was honoured with election as a fellow of the\nRoyal Society of London\n. Then, in\n1967\n, he was appointed Sadleirian Professor of Pure Mathematics at Cambridge. Two years later, in\n1969\n, he became Head of the Department of Pure Mathematics and Mathematical Statistics at Cambridge and he continued as Sadleirian Professor and Head of Department until he retired in\n1984\n.\nCassels served the\nRoyal Society\nand the\nLondon Mathematical Society\nin various roles. He was a member of the Council of the Royal Society in\n1970\n-\n71\nand he served as vice-president in\n1974\n-\n78\n. He was the\n58\nth\npresident of the\nLondon Mathematical Society\nin\n1976\n-\n78\nand he was a member of the Executive of the\nInternational Mathematical Union\nfrom\n1978\nto\n1982\n.\nCassels has worked on every aspect of the theory of numbers, particularly on the theory of rational\nquadratic forms\nand local fields. His mathematical publications started in about\n1947\nwith a series of papers on the geometry of numbers, in particular papers on theorems of\nKhinchin\nand of\nDavenport\n, and on a problem of\nMahler\n. After further papers on\nDiophantine equations\nand\nDiophantine approximation\nhe wrote a series of five papers on\nSome metrical theorems in Diophantine approximation\n. He next worked on\nVinogradov\n's theorem on uniform distribution and, in\n1957\n, he published his first book\nIntroduction to Diophantine approximation\n(1957)\nwhich was reprinted in\n1972\n.\nAfter further papers on\nsubgroups\nof infinite\nabelian groups\nand normal numbers he wrote a series of eight papers on\nArithmetic on curves of genus\n1\n. Then in\n1959\nhe published another book,\nAn introduction to the geometry of numbers\n. Among work undertaken after this was work on the representation of\nrational functions\nas sums of squares, integral points on certain elliptic curves,\nKummer\nsums, and on factorising polynomials in several variables.\nCassels has received a number of awards for his outstanding contributions. These include the\nSylvester\nMedal from the\nRoyal Society\nin\n1973\n:-\n... for his numerous important contributions to the theory of numbers.\nHe also received the\nDe Morgan\nMedal from the\nLondon Mathematical Society\nin\n1986\n. The citation for this award reads:-\nIan Cassels has made many distinguished contributions to the theory of numbers; possibly his most important work is on the arithmetic of elliptic curves, published in a series of papers between\n1959\nand\n1964\n. These papers remain fundamental to our understanding of the problems involved and have provided the foundation for much subsequent work.\nIan Cassels has contributed to almost all branches of number theory. His work includes numerous papers on Diophantine Approximation and the Geometry of Numbers, and seminal contributions to the theory of quadratic forms and sums of squares. He has written excellent books on Diophantine Approximation, Geometry of Numbers, Algebraic Number Theory and Rational Quadratic Forms.\nHe lists his leisure interests as The Higher Arithmetic and gardening.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}