{
  "nome_completo": "Josiah Willard Gibbs",
  "nome_curto": "J Willard Gibbs",
  "ano_nascimento": "1839",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gibbs/",
  "lugar_nascimento": "New Haven, Connecticut, USA",
  "lugar_morte": "New Haven, Connecticut, USA",
  "biografia": "J Willard Gibbs\n' father, also called Josiah Willard Gibbs, was professor of sacred literature at Yale University. In fact the Gibbs family originated in Warwickshire, England and moved from there to Boston in\n1658\n. However Gibbs is said to have taken after his mother in physical appearance.\nGibbs was educated at the local Hopkins Grammar School where he was described as friendly but withdrawn. His total commitment to academic work together with rather delicate health meant that he was little involved with the social life of the school. In\n1854\nhe entered Yale College where he won prizes for excellence in Latin and Mathematics.\nRemaining at Yale, Gibbs began to undertake research in engineering, writing a thesis in which he used geometrical methods to study the design of gears. When he was awarded a doctorate from Yale in\n1863\nit was the first doctorate of engineering to be conferred in the United States. After this he served as a tutor at Yale for three years, teaching Latin for the first two years and then Natural Philosophy in the third year. He was not short of money however since his father had died in\n1861\nand, since his mother had also died, Gibbs and his two sisters inherited a fair amount of money.\nFrom\n1866\nto\n1869\nGibbs studied in Europe. He went with his sisters and spent the winter of\n1866\n-\n67\nin Paris, followed by a year in Berlin and, finally spending\n1868\n-\n69\nin Heidelberg. In Heidelberg he was influenced by\nKirchhoff\nand\nHelmholtz\n.\nGibbs returned to Yale in June\n1869\nand, two years later in\n1871\n, he was appointed professor of mathematical physics at Yale. However, as Crowther points out in\n[\n2\n]\n:-\nHe returned more a European than an American scientist in spirit-one of the reasons why general recognition in his native country came so slowly.\nRather surprisingly his appointment to the chair at Yale came before he had published any work. Perhaps it is also surprising that Gibbs did not publish his first work until\n1873\nwhen he was\n34\nyears old. Few scientists who produce such innovative work as Gibbs did are\n34\nyears of age before producing signs of their genius.\nGibbs' important\n1873\npapers were\nGraphical Methods in the Thermodynamics of Fluids\nand\nA Method of Geometrical Representation of the Thermodynamic Properties of Substances by Means of Surfaces\n. In\n1876\nGibbs published the first part of the work for which he is most famous\nOn the Equilibrium of Heterogeneous Substances\n, publishing the second part of this work in\n1878\n.\nThe first of these papers describes diagrams in thermodynamics. Bumstead\n(\nsee\n[\n11\n]\nor\n[\n3\n]\n)\nwrites:-\nOf the new diagrams which he first described in this paper, the simplest, in some respects, is that in which entropy and temperature are taken as coordinates... the work or heat of any cycle is proportional to its area in any part of the diagram ... it has found most important applications in the study of the steam engine.\nThe second paper extended the diagrams into three dimensions and this work impressed\nMaxwell\nso much that he constructed a three dimensional model of Gibbs's thermodynamic surface and, shortly before his death, sent the model to Gibbs.\nHowever the third paper is the most remarkable. Bumstead in\n[\n11\n]\nor\n[\n3\n]\nwrites:-\nIt is universally recognised that its publication was an event of the first importance in the history of chemistry. ... Nevertheless it was a number of years before its value was generally known, this delay was due largely to the fact that its mathematical form and rigorous deductive processes make it difficult reading for any one, and especially so for students of experimental chemistry whom it most concerns...\nGibbs' work on vector analysis was also of major importance in pure mathematics. He first produced printed notes for the use of his own students in\n1881\nand\n1884\nand it was not until\n1901\nthat a properly published version appeared prepared for publication by one of his students. Using ideas of\nGrassmann\n, Gibbs produced a system much more easily applied to physics than that of\nHamilton\n.\nHe applied his vector methods to give a method of finding the orbit of a comet from three observations. The method was applied to find the orbit of Swift's comet of\n1880\nand involved less computation than\nGauss\n's method.\nA series of five papers by Gibbs on the electromagnetic theory of light were published between\n1882\nand\n1889\n. His work on\nstatistical mechanics\nwas also important, providing a mathematical framework for\nquantum theory\nand for\nMaxwell\n's theories. In fact his last publication was\nElementary Principles in Statistical Mechanics\nand this work is a beautiful account putting the foundations of statistical mechanics on a firm foundation.\nExcept for his early years and the three years in Europe, Gibbs spent his whole life living in the same house which his father had built only a short distance from the school Gibbs had attended, the College at which he had studied and the University where he worked the whole of his life. Crowther, in\n[\n2\n]\n, sums up his life as follows:-\n[\nGibbs\n]\nremained a bachelor, living in his surviving sister's household. In his later years he was a tall, dignified gentleman, with a healthy stride and ruddy complexion, performing his share of household chores, approachable and kind\n(\nif unintelligible\n)\nto students. Gibbs was highly esteemed by his friends, but U.S. science was too preoccupied with practical questions to make much use of his profound theoretical work during his lifetime. He lived out his quiet life at Yale, deeply admired by a few able students but making no immediate impress on U.S. science commensurate with his genius.\nBumstead describes Gibbs' personal character in the following glowing terms:-\nUnassuming in manner, genial and kindly in his intercourse with his fellow-men, never showing impatience or irritation, devoid of personal ambition of the baser sort or of the slightest desire to exalt himself, he went far toward realising the ideal of the unselfish, Christian gentleman. In the minds of those who knew him, the greatness of his intellectual achievements will never overshadow the beauty and dignity of his life.\nThe\nAmerican Mathematical Society\nnamed a lecture series in honour of Gibbs. An annual lecture has been given by a distinguished mathematician most years since\n1923\n. You can see a list of the lecturers and their titles at\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}