{
  "nome_completo": "Jérôme Franel",
  "nome_curto": "Jérôme Franel",
  "ano_nascimento": "1859",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Franel/",
  "lugar_nascimento": "Travers, Neuchâtel canton, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Jérôme Franel\nwas born  and grew up in Travers\n(\ncanton Neuchâtel\n)\nwith his twelve siblings. His place of origin, however, was Provence\n(\ncanton Vaud\n)\n. After attending the industrial school in Lausanne he studied at the Polytechnic in Zürich for four years, at the Department for Mathematics and Physics Teachers. He then continued his studies in Berlin, where his teachers included\nWeierstrass\n,\nKronecker\nand\nKummer\n, and in Paris, where he attended\nCharles Hermite\n's lectures in particular. He graduated with a degree in mathematics from the Paris Academy in\n1883\nand returned to Switzerland to teach at his old school in Lausanne for a couple of years. In\n1886\nhe was appointed to a professorship in mathematics mathematics in French at the Federal Polytechnic in Zürich, succeeding Eduard Méquet. He held this post until his retirement in\n1929\n. At the beginning, he was the only mathematician who lectured in French; later on a second chair for mathematics in French was created. Franel co-supervised\n(\nat least\n)\nfour PhD students, three jointly with\nHurwitz\nand one with\nHermann Weyl\n.\nFranel served as the Polytechnic's Director from\n1905\n-\n1909\n. In this capacity he fought for more liberal study regulations and for the Polytechnic's right to award doctorates. He also succeeded Geiser as president of the Federal Matura Committee, from\n1909\n-\n1915\n, and 'he had a fortunate influence on the development of Swiss middle schools'\n[\n3\n]\n-- however, this influence is not elaborated. On several occasions Franel acted as intermediary between the Polytechnic and secondary schools or the Gesellschaft ehemaliger Polytechniker. Furthermore, he supported the students from French-speaking Switzerland  throughout his time at the Polytechnic. Together with\nGeiser\n,\nHerzog\nand Robert Gnehm he founded the Polytechnic's Civil Fund for Widows and Orphans.\nIn recognition of his work the University of Zürich awarded him an honorary doctorate in\n1901\n. Four years later he was made an honorary citizen of the town Zürich; this happened on the occasion of the Polytechnic's\n50\nth\nanniversary. As Director, Franel was heavily involved in organising the celebrations.\nFranel was first and foremost a teacher and not a researcher. His former student and later colleague and friend Louis Kollros speaks of him very fondly, claiming that Franel 'was one of the School's most popular teachers'\n[\n3\n]\n. His colleague\nGeorge Pólya\ncommented that 'Old Franel\n[\nwas\n]\ninteresting. He always dressed in the manner of an earlier generation'\n[\n4\n]\n. He also said about Franel\n[\n4\n]\n:-\nHe is not very much remembered as a mathematician, but he was an especially attractive kind of person and a very good teacher. He gave the introductory lectures on calculus in French for several decades. He had a real interest in mathematics, but he was more interested in French literature. Teaching occupied a good deal of his time but in French literature he had to read everything available. He had no time left to do mathematics. But when he retired he suddenly tackled two of the great problems: the\nRiemann\nHypothesis and '\nFermat\n's last theorem'.\nFranel wrote a couple of papers on problems in geometry, but then turned to analysis and number theory. He published most of his papers in the\n1890\ns, including work on\nEuler\nsums, a fundamental formula by\nKronecker\nand the\nRiemann\nzeta function. Franel also regularly contributed to the French journal\nL'Intermédiaire des mathématiciens\n. His most important paper was\nLes suites de Farey et le problème des nombres premiers\nⓉ\n(\nFarey sequences and the problem of prime numbers\n)\nwhich was published in the Göttinger Nachrichten in\n1924\n, a few years before his retirement. In this short paper he proved that it is possible to link the\nFarey\nsequence to the\nRiemann\nhypothesis. The German mathematician\nEdmund Landau\n, who held a professorship at the University of Göttingen at the time, then wrote a few papers on the same topic based on and expanding Franel's ideas. Guthery says of Franel's proof\n[\n2\n]\n:-\nThat the relationship between a series of fractions so simple can be connected to a mathematical hypothesis so profound with such economy is the mark of a teacher of mathematics of the very highest order.\nFranel joined the organising committee of the first International Congress of Mathematicians in July\n1896\n, where he was responsible for the French translations. Furthermore, he was on the committee for board and lodging and was asked to join the sub-committee that chose the speakers. With\nGeiser\n,\nDumas\nand\nHirsch\nhe also edited the final congress programme. At the congress itself he acted as the general secretary for French. Franel did not give a talk himself, but he read out\nPoincaré\n's talk in the first general meeting, which he is remembered for.\nOn a more trivial note, he was also the first to propose a toast\n(\nto Switzerland\n)\nat the congress banquet on the Monday.   Despite having been general secretary, Franel never had the chance to edit the congress proceedings in French. Originally, the organising committee had decided to publish German and French editions of the proceedings. But since the talks were to be published in the language in which they were given, the committee decided that the two editions would be identical for the most part, and that only a German edition should be published, with French translations of the most important speeches.\nFranel was a member of the organising committee of the\n1932\nICM in Zürich again, but did not give a talk at the congress.\nFranel was married and he had two daughters, Jeanne\n(\nborn\n1889)\nand Marie-Louise\n(\nborn\n1893)\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}