{
  "nome_completo": "Joseph-Jérôme Lefrançais de Lalande",
  "nome_curto": "Jérôme Lalande",
  "ano_nascimento": "1732",
  "ano_morte": "1807",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lalande/",
  "lugar_nascimento": "Bourg-en-Bresse, Ain, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jérôme Lalande\n's father was Pierre Le Français. There is the obvious question of why Lalande's father was not called Lalande. Let us clarify this right at the beginning of this article. In fact, for the first twenty years of his life Lalande was known as Jérôme Le Français, but after this he called himself Jérôme Le Français de la Lande. Aristocratic names were certainly to be avoided at the time of the French Revolution, so at this time he made the \"le\" and \"la\" part of the following names and wrote Jérôme Lefrançais de Lalande.\n[\nThink just how many French mathematicians of this period have names beginning with Le... or La... for just this reason\n]\n. For simplicity we shall use the name Lalande throughout this article.\nReturning to Lalande's parents, his father Pierre, who ran a post office and traded in tobacco in Bourg-en-Bresse, had married Marie-Anne-Gabrielle Monchinet. They only had one child so, very unusually for this period, Jérôme grew up an only child. He studied at the Jesuit College in Lyon and at this stage he nearly decided to join the Jesuit Order. In fact it was his parents who encouraged him to continue his education by going to Paris to study law, which he did. It is somewhat ironical that Lalande, who would later become renowned as an atheist, should have come so close to becoming a Jesuit.\nIt was his parents wish that he study law that stopped Lalande joining the Jesuits, but more surprisingly it was also this wish which turned him into an astronomer. While studying for his law degree he lodged at the Hotel de Cluny in Paris and it was there that the astronomer Joseph-Nicolas Delisle had his observatory. Lalande was fascinated by astronomy and, although he continued to study law, he also attended Delisle's astronomy lectures at the Collège Royale as well as Pierre Lemonnier's lectures on mathematical physics. He not only studied the theoretical side of the subject in lectures but he also participated as an enthusiastic observer and assistant to Delisle. Despite his interest in astronomy, Lalande completed his law studies and in\n1751\n, still only aged nineteen, he qualified and prepared to return to his home town of Bourg-en-Bresse to practise law. However Lemonnier had other plans for the young man.\nA project had been set up to measure the parallax of the moon and Mars and hence determine their distances. Several sites had been chosen from which to make simultaneous observations and\nNicolas Lacaille\nwas sent by the\nAcadémie des Sciences\nto make observations from the Cape of Good Hope while Lemonnier, who was responsible for the observations to be made in Berlin, asked Lalande to go in his place. As no suitable instrument was available in Berlin, Lemonnier lent him his own quadrant which was reported to be the best such instrument in France. The visit proved highly successful for Lalande who, despite his youth, was admitted to the\nBerlin Academy\nand was able to discuss science with Voltaire,\nMaupertuis\nand\nEuler\n. Lalande's observations were published in\nActa eruditorum\n, and in publications of the\nBerlin Academy\nand the\nParis Academy\n. After his return to France, Lalande was elected to the\nAcadémie des Sciences\nin Paris on\n4\nFebruary\n1753\n.\nThis was a great achievement for so young a man and for the vain Lalande it was extremely pleasing. He always sought fame and he had readily achieved it at a young age. Yet he was someone whose whole career was based on seeking more fame and his every action was made in order to gain further plaudits and praise. On the other hand when he did lose a public argument, or suffered attacks, he held no grudges and merely set himself back to working towards further recognition. He said\n(\nsee for example\n[\n1\n]\n)\n:-\nI am an oilskin for insults and a sponge for praise.\nIn fact he enjoyed being in the limelight even when on the losing end of an argument, but in his first public dispute he ended up on the winning side.\nIn order to compute the lunar parallax it was necessary to allow for the fact that the Earth is not a perfect sphere but is flattened at the poles. To do this it was, of course, necessary to know the precise amount by which the Earth differed from a perfect sphere and Lalande disagreed with Lemonnier on the issue. The\nParis Academy\nset up a commission to settle the argument and it decided in favour of Lalande. This certainly did not please Lemonnier and relations between him and Lalande soured.\nOne of the next tasks that Lalande undertook was to assist\nClairaut\nin calculating a more accurate orbit for\nHalley\n's comet. The observations of its orbit made by\nHalley\nhad been used to predict its return based on the assumption that the comet's orbit was not affected by any bodies in the solar system except the sun. On this assumption a date of late\n1758\nor early\n1759\nhad been predicted for its return.\nClairaut\n,\nd'Alembert\nand\nEuler\nhad all worked on the three-body problem and\nClairaut\nnow had the necessary mathematical knowledge to compute the perturbations in the orbit of the comet. The calculations were very demanding and were undertaken by Lalande together with Mme Lepaute. Many accounts of this work ignored the enormous contributions made by Mme Lepaute, who worked night and day on the mathematical calculations, but Lalande was always keen to acknowledge the large scientific contribution being made by women and we mention below other projects on which he collaborated with women mathematicians. In September\n1757\nthe results were released which showed that\nHalley\n's comet would return a year earlier than previously expected. By December of\n1757\nthe comet was sighted, a great triumph for the new mathematical techniques available for the three-body problem. Lalande went on to publish a corrected edition of the tables of\nHalley\n's Comet based on these computations.\nIn\n1759\nLalande was asked if he would take over the editorship of the astronomical almanac\nConnaissance des temps\nⓉ\n(\nKnowledge of time\n)\n. He was editor from\n1760\nuntil\n1776\nbut during the French Revolution he was asked to take over the editorial duties again which he did from\n1794\nuntil his death in\n1807\n. During his editorship, Lalande added accurate tables of lunar distances from stars which were valuable in navigation. In the year he took over as editor, Lalande was offered another prestigious position namely to follow his teacher Delisle as professor of astronomy at the Collège Royale. He took up the post in\n1762\nand held it for\n46\nyears.\nTwo transits of Venus occurred, the first in\n1761\nand the second eight years later. Again observations taken from different places on the Earth of the precise timing of the passage of the planet in front of the sun would allow parallax measurements to be made and the distance from the Earth to the sun to be calculated. These events were of sufficient importance to have international cooperation organised to have the observations made from different sites, and Lalande played a role in coordinating this project. Between these transits, during\n1765\n-\n1766\n, he travelled in Italy. There he met the Pope and petitioned him to remove the writings of\nCopernicus\nand\nGalileo\nfrom the\nIndex\nof prohibited works. He published an account in\nVoyage d'un français en Italie\nⓉ\n(\nTravels of  Frenchman in Italy\n)\n(1769)\nwhich ran to eight volumes\n[\n1\n]\n:-\nLalande went into great detail about prices, interesting places to visit, and other information of interest to the tourist.\nHe also visited England, in particular the Greenwich Observatory, and found out details of Harrison's clocks which had been successful in determining longitude. He wrote an account of these travels too which is fascinating for historians to read but was never published.\nAs well as his accurate observations, Lalande was also famous for his books. Some were written at a high-powered research level, while others were at a popular level where he had great success in presenting ideas to non-experts. He wrote on many topics, not just astronomy, but his most famous text was an astronomy one,\nTraité d'astronomie\nⓉ\n(\nA Treatise on astronomy\n)\n. He first published it in two volumes in\n1764\n, with a second edition in four volumes appearing between\n1771\nand\n1781\n. A third edition, containing important contributions by his student\nDelambre\n, consisting of three volumes was published in\n1792\n. As well as being an excellent astronomy text,\nTraité d'astronomie\nⓉ\n(\nA Treatise on astronomy\n)\nwas a practical manual for anyone wishing to observe and reduce their own calculations since it contained much information on instruments, their use, and how to compute.\nBefore the publication of the third edition, in\n1791\n, Lalande achieved the great honour of being elected Head of the Collège de France. One of his first acts as Head was to admit women to all classes. He made other forward looking moves too, such as stopping Latin citations for prize winners.\nBy this time Lalande was sixty years old, he had survived the Terror during the French Revolution unscathed, something which he put down to his atheist views. He began to express these views more openly, perhaps the most public arena being on\n8\nJune\n1794\nat the first Festival of the Supreme Being. What was being celebrated was a religion to substitute for Christianity and Lalande played a leading role. He gave a speech which allowed him a platform to express his atheist views and he also took the opportunity to try to moderate the extreme form of patriotism which was gripping France\n(\nquoted in\n[\n2\n]\n)\n:-\nThe time has come to declare these important and incontestable truths, known to all people, at all times, and in every corner of the globe: love of country, love of virtue and the reign of reason ... . Love of country is not a patriot's only duty. We cannot all serve our nation in the army, in the state, in the arts and sciences, but we can all come to the aid of our brothers ... . It is this way that charity, added to love of country, will make us truly worthy of our revolution, our victories, and the admiration of the entire Universe.\nHis career went from strength to strength and on\n17\nMay\n1795\nhe was appointed director of the Paris Observatory. He had for some time been creating a major star catalogue and by\n1796\nit contained\n30\n,\n000\nstars and by this stage had, in fact, achieved his original aim. However he continued with the task and by\n1797\nhis star catalogue listed\n41\n,\n000\nstars. When he published\nHistoire céleste française\nⓉ\n(\nHistory of the  French sky\n)\nin\n1801\nit including a catalogue of over\n47\n,\n000\nstars. These star catalogues were constructed with the help of his family, and we will make some comments about them later in this article.\nWe are nearing the end of our description of Lalande's career, but let us pause to look at some aspects of his character. First his appearance is described in\n[\n2\n]\nas follows:-\nHe was an extremely ugly man, and proud of it. His aubergine-shaped skull and shock of straggly hair trailing behind him like a comet's tail made him the favourite of portraitists and caricaturists. He claimed to stand five feet tall, but precise as he was at calculating the heights of stars he seems to have exaggerated his own altitude on earth. He loved women, especially brilliant women, and promoted them in word and deed.\nMany laughed at his atheist views saying that they were his revenge against God who had made him so ugly\n[\n2\n]\n:-\n... his knock knees and rickety legs, his hunched back and little monkey's head, his pale wizened features and narrow creased forehead, and under those red eyebrows, his empty grassy eyes.\nIn fact Lalande character seemed to contain many contradictions. He was in the late\n1790\ns\n[\n2\n]\n:-\n... a free-thinker who preferred monarchy, an atheist who admired the Jesuits, a feminist who propositioned young women, as ugly as ever and still just as vain.\nContinuing to promote atheist views, in\n1799\nhe began to look for scholars to add to his\nDictionary of Atheists\n. In this work he said\n(\nquoted in\n[\n2\n]\n, see also\n[\n1\n]\n)\n:-\nIt is up to the scholars to spread the light of science, so that one day they may curb those monstrous rulers who bloody the earth; that is to say, the warmongers. As religion has produced so many of them, we may hope to see an end to that as well.\nOne might imagine that someone with these views would have opposed Napoleon, but he did not do so and on the contrary he welcomed Napoleon's rise to power\n1802\n-\n1804\n. In fact Napoleon had been happy to agree that Lalande add his name to the\nDictionary of Atheists\nin\n1799\n. Later, however, Napoleon decided that the Church would make a better ally than enemy and the Pope came to Paris for his installation as Emperor. Lalande took the opportunity to reissue his\nDictionary of Atheists\nwith Napoleon's name included which caused the new Emperor to demand that the Institut de France censure Lalande.\nDelambre\n, who was at this time the Permanent Secretary to the Institut, tried hard to make Lalande bend to the Emperor's demands without being seen to undermine the highly prized intellectual freedom that members of the Institut enjoyed. Lalande refused to stop putting forward his atheist views.\nWe promised earlier to say something of Lalande's family who played a large role in computing and producing tables. He never married but he had an illegitimate daughter\nMarie-Jeanne-Amélie Harlay\nwhom he trained in mathematics so that she could help him with his work. He also trained his cousin Michel Lefrançais whom he called his nephew. Michel married his illegitimate daughter\nAmélie\nwhom Lalande then called his niece.\nAmélie\nand Michel became important members of the Lalande family team working day and night on many of his projects. For example Lalande's\nAbrégé de navigation historique, théorétique, et practique, avec des tables horaires\nⓉ\n(\nAbstract of historical, theoretical, and practical navigation with timetables\n)\n(1793)\nwere navigation tables containing a wealth of calculations carried out by his daughter. Michel Lefrançais assisted\nDelambre\nin his measurements of the meridian in the\n1790\ns and played an important role in that project. Although, as we remarked above, Lalande never married he lived with Louise-Elizabeth-Félicité du Piery. She was the chief investigator on Lalande's large-scale study of lunar astronomy, which was undertaken at the Paris Observatory, and she became the first woman in Paris to teach astronomy. The importance in which Lalande held women's contributions to astronomy, particularly as mathematicians and calculators, is seen in his\nAstronomie des dames\nfirst published in\n1785\n, with new editions in\n1795\nand\n1806\n.\nIn addition to his role in organising science that we have mentioned above, let us also note that he was an active member of the Masonic order and that he founded the Masonic Lodge of the Nine Sisters in Paris which was open to leading writers and scientists. Most of the leading authors, scientists, artists and politicians joined including Voltaire in\n1778\n. See\n[\n3\n]\nfor more details. When the French Revolution led to the closure of the\nAcadémie des Sciences\n, Lalande attempted to set up a new organisation which he called Réunion des Sciences to carry on its functions.\nOne important task Lalande undertook near the end of his career was to complete the remaining two volumes of\nMontucla\n's four volume\nHistoire des mathématiques\nⓉ\n(\nHistory of Mathematics\n)\n. Volume three covered\n18\nth\ncentury pure mathematics, optics and mechanics in\n832\npages, while the fourth volume covered\n18\nth\ncentury astronomy, mathematical geography and navigation in\n688\npages. They were published in\n1802\nwhen Lalande was\n70\nyears old. We should also mention that he instituted the Lalande Prize, also in the year\n1802\n. It was to be awarded annually for the most important contribution to astronomy made in that year.\nNapoleon's insistence that Lalande stop his public support of atheism became unnecessary since Lalande fell ill. Towards the end of\n1806\nhe contracted a chest complaint which almost certainly developed into tuberculosis. A few days before his death he wrote:-\nI have sometimes amused myself by saying that I thought I possessed all the human virtues. This phrase of mine has been bitterly cast up against me as if I had claimed \"to have all the human virtues\". In fact, what I said was that \"I thought I had them\", which is quite a different matter. Nevertheless, I was perhaps wrong to have said as much; but my conscience required it of me.\nIt is hard to assess Lalande's contributions for his personality certainly affected the way he was viewed in his own lifetime. It is clear, however, that he made enormous contributions to the development of the mathematical sciences although this was not through scientific innovation of which he displayed little. Rather his importance lies as a teacher, particularly in supporting his students like\nDelambre\nand\nMéchain\n, through his organisation of science, by his superbly accurate observations which helped to provide evidence to support\nNewton\n's theory of gravitation and later results on the\n3\n-body problem, and his successful popularising astronomy.",
  "math_areas": []
}