{
  "nome_completo": "János Dezső Aczél",
  "nome_curto": "János Aczél",
  "ano_nascimento": "1924",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aczel/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Ottawa, Ontario, Canada",
  "biografia": "János Aczél\nwas known as\nJohn Aczél\nafter he came to Canada. He was the son of Deszo Scheibel\n(1881\n-\n1965)\nand Irenae Adler\n(1887\n-\n1972)\n. Deszo Scheibel worked for a company producing chemical and medical products but after the Treaty of Trianon in\n1920\nthe company became Romanian and Deszo wanted to remain in Hungary so he started his own business in Budapest selling medical equipment produced by various companies. He married Irenae, who had a daughter Maria\n(\nborn about\n1908)\nfrom a previous marriage. They ran a boarding house in Bálvány street to make extra income and some time after János was born they moved to Vilmos Császáar street which has been renamed Bajcsy-Zsilinszky street. Their house also contained an elementary school and János attended this school for four years beginning in\n1931\n.\nAt age ten, János attended an English language school in which all the subjects were taught in English. He said\n[\n9\n]\n:-\nFrom that time on my parents were insistent on my learning English but not French, because whenever they wanted to leave me out of the discussion they used French between them. So I teamed up with one of my classmates and we took private classes from a teacher of French.\nNot only did he learn English and French but also German. This was learnt at home since he had a grandmother living with his family who had been born in Vienna and did not speak Hungarian, only German. János learnt German speaking with his grandmother. He then entered the Magyar Királyi Berzsenyi Dániel Gimnázium, a humanist secondary school in Budapest's\n5\nth district named after a nineteenth-century Hungarian poet. It was an eight year grammar school and he studied there from\n1935\nto\n1943\n. For a long time he did not know which subject he would study at university. One day his mathematics teacher came into the classroom and said that János Aczél was the only pupil to hand in correct solutions to the mathematics test. He decided immediately that he would study mathematics and so, having successfully graduated from the high school, entered the Pázmány Péter University in\n1943\nto study that subject. We note that in\n1950\n, the university was renamed to\nEötvös Loránd\nUniversity.\nAt Pázmány Péter University, Aczél was taught by a number of outstanding mathematicians. Among his mathematics lecturers were Pál Veress\n(1893\n-\n1945)\nwho worked on number theory and topology and had published the textbook 'Real Analysis', Pál Szász who taught an analysis course, and\nBéla Kerékjártó\nwho taught an analytical geometry course. Aczél explained\n[\n9\n]\n:-\nPál Szász did a very good job of teaching us the fundamentals but\nKerékjártó\nwas different. Although his lectures were held with the charm of a French charmeur, they were often not clear enough and he also made mistakes that he took very lightly.\nGermany invaded Poland in September\n1939\nand World War II began. Italy joined Germany declaring war on Britain and France in June\n1940\nand in November of that year Hungary signed the Tripartite Pact. Hungary began to recover territory lost through the\n1920\nTreaty of Trianon and invaded Yugoslavia in April\n1941\n. These events were worrying for Aczél but he was not directly affected and his time at secondary school and his first year at university was not disrupted. Things changed dramatically after Germany invaded Hungary on\n19\nMarch\n1944\n. Hitler had feared that Hungary was seeking to negotiate peace with the Allies and as a consequence would turn against Germany. Life now changed completely for Aczél. The Pázmány Péter University closed and, on\n15\nMay\n1944\nhe was called up for labour service.\nHe was sent to Miskolc to work at the wood mill at the end of the narrow-gauge Lillafüred Forest railway. This railway, opened in\n1920\n, brought wood down from the forests of the Bükk Mountains. The railway still exists today as a tourist attraction and I\n[\nEFR\n]\nhave enjoyed rides on it on two separate visits to Miskolc. It was no tourist attraction when Aczél was made to work at the wood mill and, although he said the work was not too hard, he tried to escape on\n5\nOctober. He returned to Budapest but was again forced to do hard labour, this time sent to the village of Fertorákos on the Austrian-Hungarian border where he was made to dig ditches as part of tank defences. There he met up with\nJános Horváth\n, who had been a fellow mathematics student in Budapest. They had Pál Veress's textbook with them and one day they were caught reading the book when they should have been digging. Asked by the foreman what the book was, they got away with it by saying they were using it as toilet paper. Aczél later told this story to\nFejér\n[\n9\n]\n:-\nAfter the war we told the story to\nLipót Fejér\nwho was angry with Pál Veress and so he answered that after all it was not a big lie, actually.\nFrom Fertorákos, Aczél was marched to the Mauthausen concentration camp then to Gunskirchen, one of the sub-camps of the Mauthausen concentration camp. He was lucky that he was liberated by the Americans soon after reaching Gunskirchen. He took quite a while to reach Budapest but when he did he found that both his parents and his half-sister had survived although most of his more distant relations had been killed.\nBack in Budapest, Aczél married Zsuzsi on\n26\nDecember\n1946\n. She had been born in\n1927\nand later when they lived in Canada she was known as Susan. At the time they were married, both were still mathematics students. They had two daughters, Catherine\n(\nknown as Kati\n)\nand Julie. János Aczél continued the university course he had been on prior to the German invasion of Hungary. He was, in parallel, doing research for a Ph.D. and studying for a teaching qualification. His thesis advisors were\nLipót Fejér\nand\nFrigyes Riesz\n. Aczél wrote\n[\n16\n]\n:-\nBoth, but mainly\nFejér\n, were my thesis supervisors. They gave me huge leeway on what I wanted to do and include in my thesis. Another professor who influenced me greatly was Pál Szász. What impressed me most about all three was that they were accessible to a measure unusual for that time and place and gave occasion to me\n(\nand other advanced students\n)\nto present my results\n(\nSzász in seminars,\nRiesz\nin his regular classes\n)\n. From\nFejér\none learned mostly in informal conversations and informal parts of his lectures.\nFejér\nwas not a strict examiner, yet most Hungarian mathematicians were\n(\nand are\n)\ngenuinely his students or his students' students. Personality, accessibility, and genuine caring seem to have more effect than formal teaching.\nAczél graduated with his Ph.D. in\n1947\nhaving made up the time he had lost in labour camps. His thesis was\nFinite differences and functional equations\nand he had ten papers published in\n1947\n-\n48\n.\nThe notion of mean values\nand\nA generalization of the notion of convex functions\nwere published in\n1947\nand the following eight papers in\n1948\n:\nOn mean values\n;\nÜber eine Klasse von Funktionalgleichungen\nⓉ\n(\nOn a class of functional equations\n)\n;\nOn mean values and operations defined for two variables;\n(\nwith\nIstván Fenyö\n)\nOn fields of forces in which centres of gravity can be defined\n;\n(\nwith\nIstván Fenyö\n)\nÜber die Theorie der Mittelwerte\nⓉ\n(\nOn the theory of averages\n)\n;\nSur une équation fonctionnelle\nⓉ\n(\nOn a functional equation\n)\n;\nUn problème de M L Fejér sur la construction de Leibniz\nⓉ\n(\nA problem with M L Fejér on the construction of Leibniz\n)\n; and\nSur les opérations définies pour nombres réels\nⓉ\n(\nOn operations defined for real names\n)\n.\nWe noted above how Aczél learnt English, French and German. We see that his first mathematics papers were written in these three languages but none in his native Hungarian.\nIn\n1947\nAczél was awarded a Ph.D. and received his teaching qualification but he had no job. He applied for a position as a quality controller and was made to sit a written intelligence test. When asked for the next number in the sequence\n1\n,\n4\n,\n9\n, ... he gave the answer, \"Any number is possible.\" He was not offered the job; it was not for his lack of mathematical skill but rather because he was seen to be \"over qualified.\" He was then employed by a trade union as a statistician, a subject he knew nothing about. He quickly pleased his employer, however, who doubled his salary. This meant that when he was appointed as an assistant lecturer at Szeged University in\n1948\nhe took a large cut in his income.\nWhen Aczél was appointed as an assistant lecturer in mathematics at the Mathematics Department at Szeged University he was joining an impressive staff. The head of the department was\nLászló Kalmár\nand his colleagues included\nLászló Rédei\n, Gyula Szökefalvi-Nagy\n(1887\n-\n1953)\nand his son Béla Szökefalvi-Nagy\n(1913\n-\n1998)\n[\n9\n]\n:-\nThe atmosphere in Szeged was very good, it was great talking to the various people. The hot tempered\nKalmár\nhad great theories about maths education. I was impressed by the calm Béla Szökefalvi-Nagy. Zsuzsi thought that the bit strange\nRédei\nwas the best lecturer. We had a good relationship with Károly Tandori\n(1925\n-\n2005)\n, who was another assistant lecturer.\nIn order to make more money, Aczél had a second occupation as a secondary school teacher. He was able to arrange for all his school teaching to be from\n8\n:\n00\nto\n10\n:\n00\neach day, and he then went to the Mathematical Institute.\nAczél left Szeged in\n1950\nwhen he was sent to Miskolc University to be the head of the mathematics department. He spent three years there but although there were good times, he found that the quality of the students was getting poorer. He organised conferences on teaching mathematics and applications of mathematics at Miskolc, although there was no international participation. Relations between some colleagues at Miskolc were difficult so when he was sent to Debrecen to be head of the analysis department he was happy to move. He had excellent colleagues there including\nTibor Szele\n,\nOttó Varga\nand\nBéla Gyires\n. The atmosphere in Hungary changed, however, in November\n1956\nwhen Soviet tanks rolled into the country\n[\n9\n]\n:-\nAfter the war, the German occupation and the \"shoah\" we had great hopes in the new system and disillusionment came gradually. Most of the mathematicians were members of the Socialist Party before\n1956\nand were not after that. We had to persuade each other to enter the Party because it was not advantageous for the Institute if it had no party members. You just started to realise what was going on and were getting disappointed. There were prisoners working at the new university in Miskolc. You just slowly came to accept things you could not believe at first.\nIn Debrecen he began writing two books, namely\nFunktionalgleichungen der Theorie der geometrischen Objekte\nⓉ\n(\nFunctional equations of the theory of geometric objects\n)\nand\nVorlesungen über Funktionalgleichungen und ihre Anwendungen\nⓉ\n(\nLectures on functional equations and their applications\n)\nwhich were published in\n1960\nand\n1961\nrespectively. The first of these was a joint work written in collaboration with\nStanislaw Golab\nwho was Head of the Department of Mathematics at the Jagiellonian University in Kraków, Poland. For information about these books, see\nTHIS LINK\n.\nAczél also collaborated with the Polish mathematician\nJan Mikusinski\n. By\n1960\ntravel outside the Soviet Union became possible for Aczél and in that year he made visits to both East Germany and West Germany. In\n1961\nhe was invited to a geometry meeting at the German research centre in Oberwolfach to be held\n12\n-\n16\nJune\n1962\n. Problems obtaining a visa meant that he only arrived just before the meeting closed. The meeting was productive, however, since he was invited to be one of three organisers of a functional equations meeting in Oberwolfach in September\n1962\n. The other two organisers were\nOtto Haupt\nand\nAlexander Markowich Ostrowski\n. This meeting had been arranged to take place after the International Congress of Mathematicians in Stockholm in August\n1962\n. Berthold Schweizer writes\n[\n22\n]\n:-\nI first met the person behind the name\n[\nAczél\n]\nin August of\n1962\nin Stockholm. We had both come to take part in the International Congress of Mathematicians; we and our spouses took to each other immediately; we began our unending exchange of jokes and stories; and when I pointed out that the fundamental tenet at a crowded smorgasbord was \"to each according to his ability\", our friendship was sealed.\nThe Oberwolfach meeting was successful even though there were relatively few participants. Among those attending, in addition to the three organisers, were: Susan Aczél, János Aczél's wife;\nIstván Fenyo\nfrom Budapest;\nEinar Hille\nfrom New Haven, Connecticut;\nOlga Taussky-Todd\nfrom Pasadena; and\nJack Todd\n, also from Pasadena.\nIn\n1963\nAczél began to have travel problems. He was one of the organisers for the October\n1963\nfunctional equations meeting in Oberwolfach, the other two organisers again being\nOtto Haupt\nand\nAlexander Markowich Ostrowski\n. He was then to go to Florida for a ten month research visit. He said\n[\n9\n]\n:-\nMy permission to travel and the visa\n(\nfor which you could not apply individually but only through the department of foreign relations\n)\narrived\n2\nmonths later. I am a precise man, and I wrote a letter to the Ministry that the\n10\n-month holiday they permitted was beginning right then. I had been invited to a longer session, a six-week conference at Stanford University. There I received a telegram asking why I had not returned to Hungary yet. Then I contacted the Hungarian Embassy in Washington, where I was told that the problem had been settled and my holiday ended in September. It was a narrow escape from getting disciplinary measures. My saving grace was that it was all in writing. But I was banned from travelling abroad for a few years.\nBerthold Schweizer writes\n[\n22\n]\n:-\nIn the fall of\n1963\n, Janos was a Visiting Professor at the University of Florida. I was at the University of Arizona and invited him to come to Tucson to give a series of lectures. I chose Thanksgiving because the weather is ideal then and because the holiday break would give us ample time for sightseeing. And so he arrived on November\n23\n. En route his plane had stopped in Dallas. In his hand he carried a copy of that city's newspaper - its headline screaming out the news of Kennedy's assassination. In the days of apprehension and mourning that followed, we grew much closer to each other.\nThe difficulties that Hungarians had obtaining permission to travel contributed to Aczél's decision that he would try to emigrate. First he went with his family to Vienna, Austria, then to Cologne, Germany. An invitation to join the faculty of the University of Massachusetts in Amherst, USA, was tempting but Aczél feared that, although he was too right-wing for Hungary at this time, he was probably too left-wing to enjoy spending the rest of his life in the United States. He was working in Cologne, and still considering the American invitation, when he attended another functional equations meeting in Oberwolfach, organised by the same three mathematicians as the previous two, in July\n1965\n. Michel Amedee McKiernan, who had been a student of\nKarl Menger\nand was at that time a member of the Functional Equations group at the University of Waterloo in Canada, was one of the participants at Oberwolfach. He invited Aczél to join the faculty of the University of Waterloo. Aczél quickly received a formal invitation, rapidly accepted and by September\n1965\nhe was teaching at the University of Waterloo. He said\n[\n9\n]\n:-\nThe university in Waterloo was relatively new. The research council was very happy to see me there, so I received quite a huge grant. I had several doctoral students, but\n[\nJohn Baker, Mark Taylor and Che Tat Ng\n]\nare really the most outstanding ones. I became a Canadian citizen in\n1971\n. I often went to conferences and we also went on holiday a lot around the world. The conferences in functional equations and information theory continued.\nShortly after arriving in Waterloo, Aczél wrote the Foreword to the English translation to his\n1961\nbook on functional equations. He wrote in October\n1965\n[\n2\n]\n:-\nThe revisions in this new edition are partly based on experiences of further lectures in Debrecen\n(\nHungary\n)\n, Gainesville\n(\nFlorida\n)\n, Giessen and Cologne\n(\nGermany\n)\n, and Waterloo\n(\nOntario\n)\n. Warmest thanks go to students and colleagues at all these places for their valuable comments.\nFor further information about this book, including the Publisher's information, the Foreword, and extracts from some reviews, see\nTHIS LINK\n.\nThe authors of\n[\n8\n]\ntell us that soon after arriving at Waterloo:-\n... he founded 'Aequationes Mathematicae' and set up an editorial office at Waterloo. ... During his tenure at Waterloo, he brought a continuous stream of scholars to the university. Some of them came to Canada to attend the International Symposium on Functional Equations, some came to Waterloo as visiting scholars for a few months, and some came as faculty members. The lectures they delivered broadened and deepened the subject areas. He wrote a mini-course type survey article on webs and quasigroups. Amongst his doctoral students at Waterloo, Mark Taylor carried that torch. The two of us were more interested in information theory. John Baker specialised in analysis. János always allowed his students to develop naturally.\nAczél was given the title \"distinguished professor\" in\n1969\n. He retired in\n1993\nbut continued to write excellent papers. He had for many years been interested in the application of functional equations to the behavioral sciences and his last few papers were written on this topic with Duncan Luce, Tony Marley, and Che Tat Ng.\nAczél received many honours for his outstanding mathematical contributions. At a conference on functional equations in Spain in\n1988\nhe received a Santiago Ramón y Cajal Medal from the scientific council. In\n1990\nhe was elected honorary doctor at the university of Karlsruhe, surprisingly in economics, not in mathematics. In\n1971\nhe was elected a member of the\nRoyal Society of Canada\nand in\n1991\nhe was elected a member of the\nHungarian Academy of Sciences\n. He received honorary doctorates from Graz University in\n1995\n, from the Silesian University of Technology in Katowice in\n1996\nand from the University of Miskolc in\n1999\n. In\n2004\nhe won the Kampé de Fériet Award of the annual Information Processing and Management of Uncertainty conference\n[\n19\n]\n:-\n... for his pioneering work on the theory of functional equations, with applications in many fields, such as information measures, index numbers, group decision making, aggregation, production functions, laws of science, theory of measurement and utility theory.\nIn\n2008\n, he was elected an honorary member of the\nHamburg Mathematical Society\n.\nSusan Aczél died on\n23\nMay\n2010\nafter a short illness\n[\n24\n]\n:-\nWhile we all mourn her loss, we will always treasure our memories of her life and recall her gentle, caring attitude and her wisdom. The Aczel family believes that an investment in talented graduate students will result in far-reaching benefits for Canada at home and abroad. To this end, they have established the Susan and Janos Aczel Graduate Scholarship at the University of Waterloo.\nJános Aczél died peacefully in hospital, following a brief illness, on Wednesday,\n1\nJanuary\n2020\n, six days after his\n95\nth birthday. He was buried at the Capital Funeral Cemetery in Ottawa on\n26\nJanuary\n2020\nand a Celebration of Life was held at the University of Waterloo on\n17\nApril\n2020\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}