{
  "nome_completo": "János Bolyai",
  "nome_curto": "János Bolyai",
  "ano_nascimento": "1802",
  "ano_morte": "1860",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bolyai/",
  "lugar_nascimento": "Kolozsvár, Hungary (now Cluj, Romania)",
  "lugar_morte": "Marosvásárhely, Hungary (now Târgu-Mureş, Romania)",
  "biografia": "János Bolyai\n's parents were Zsuzsanna Benkö, from Kolozsvár, and\nFarkas Bolyai\n, from Bolya\n(\nnear Nagyszeben\n)\n. János was born in Zsuzsanna's parents home in Kolozsvár\n(\nnow renamed Cluj in Romania\n)\nbut soon went to Marosvásárhely where his father Farkas had a job at the Calvinist College teaching mathematics, physics and chemistry.\nFarkas Bolyai\nalways wanted his son to be a mathematician, and he brought him up with this in mind. One might suppose that this would mean that János's education was put first in the Bolyai household, but this was not so for Farkas believed that a sound mind could only achieve great things if it was in a sound healthy body, so in his early years most attention was paid to János's physical development. It was clear from early on, however, that János was an extremely bright and observant child\n[\n7\n]\n:-\n... when he was four he could distinguish certain geometrical figures, knew about the sine function, and could identify the best known constellations. By the time he was five\n[\nhe\n]\nhad learnt, practically by himself, to read. He was well above the average at learning languages and music. At the age of seven he took up playing the violin and made such good progress that he was soon playing difficult concert pieces.\nIt is important to understand that although Farkas had a lecturing post he was not well paid and even although he earned extra money from a variety of different sources, János was still brought up in poor financial circumstances. Also János's mother was a rather difficult person and the household was not a particularly happy place for the boy to grow up.\nUntil János was nine years old the best students from the Marosvásárhely College taught him all the usual school subjects except mathematics, which he was taught by his father. Only from the age of nine did he attend school. By the time Bolyai was\n13\n, he had mastered the calculus and other forms of analytical mechanics, his father continuing to give him instruction. By this time, however, he was attending the Calvinist College in Marosvásárhely although he had started in the fourth year and often attended lessons intended for the senior students.\nIn\n1816\nFarkas wrote to his friend\nGauss\nasking him if he would let János live with him and take him on as a pupil so that he might receive the best possible mathematical education. Certainly it would have been a wonderful education for János and it is interesting to speculate what benefits might have come to the world of mathematics if he had accepted the plan.\nGauss\n, however, rejected the idea. When János graduated from Marosvásárhely College on\n30\nJune\n1817\nit was not clear how he might obtain a good mathematical education. Neither of the universities at Pest or Vienna offered a good quality mathematical education at this time, and Farkas could not afford to send his son to a more prestigious university abroad. The decision that János would study military engineering at the Academy of Engineering at Vienna was not taken without a lot of heartache and soul-searching but in the end this route was chosen as the least bad of the options. This is not to say that the Academy did not excel in teaching mathematics, for indeed the subject was emphasised throughout the course. János remained for one further year at Marosvásárhely College attempting to gain entry to the Academy at Vienna at the highest possible level which he achieved.\nHe studied at the Royal Engineering College in Vienna from\n1818\nto\n1822\ncompleting the seven year course in four years. He was an outstanding student and from his second year of study on he came top in most of the subjects he studied. He also had time to become an outstanding sportsman, and he continued to take his violin playing seriously and performed while in Vienna. His mother died on\n18\nSeptember\n1821\nbut he was able to continue his studies. When he graduated from the Academy on\n6\nSeptember\n1822\nhe had achieved such outstanding success that he spent a further year in Vienna on academic studies before entering military service. Of course he had received military training during his time in Vienna, for the summer months were devoted to this, but Bolyai's nature did not allow him to accept easily the strict military discipline.\nIn September\n1823\nhe entered the army engineering corps as a sublieutenant and was sent to work on fortifications at Temesvár. He spent a total of\n11\nyears in military service and was reputed to be the best swordsman and dancer in the Austro-Hungarian Imperial Army. He neither smoked nor drank, not even coffee, and at the age of\n23\nhe was reported to still retain\nthe modesty of innocence\n. He was also an accomplished linguist speaking nine foreign languages including Chinese and Tibetan.\nAround\n1820\n, when he was still studying in Vienna, Bolyai began to follow the same path that his father had taken in trying to replace\nEuclid\n's parallel axiom with another axiom which could be deduced from the others. In fact he gave up this approach within a year for still in\n1820\n, as his notebooks now show, he began to develop the basic ideas of hyperbolic geometry. On\n3\nNovember\n1823\nhe wrote to his father that he had:-\n... created a new, another world out of nothing...\nbut he still added a few lines later that it was not created yet. By\n1824\n, however, there is evidence to suggest that he had developed most of what would appear in his treatise as a complete system of\nnon-Euclidean geometry\n. In early\n1825\nBolyai travelled to Marosvásárhely and explained his discoveries to his father. However\nFarkas Bolyai\ndid not react enthusiastically which clearly disappointed János. Bolyai was posted to Arad in\n1826\nand there he found that Captain Wolther von Eckwehr, one of his old teachers of mathematics from the Academy in Vienna, was also stationed. Bolyai gave him a draft of the materials which he was writing on the theory of geometry, probably because he hoped for some constructive comments from him. However it would appear from Bolyai's later writings that he got nothing from von Eckwehr, in particular he never received the manuscript back.\nIn\n1830\nBolyai learnt that he was to be sent to a posting in Lemberg. Early in\n1831\nhe set off for Lemberg but visited his father in Marosvásárhely on his way. By now Farkas had come to understand the full significance of what his son had accomplished and strongly encouraged him to write up the work for publication as an Appendix to the\nTentamen\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\nwhich was close to publication. Bolyai later wrote:-\nHad my father not happened to urge or even force me at Marosvásárhely, on my way to duty in Lemberg, to immediately put things to paper, possibly the contents of the Appendix would never have seen the light of day.\nWhat was contained in this mathematical masterpiece? After setting up his own definitions of 'parallel' and showing that if the Fifth Postulate held in one region of space it held throughout, and vice versa, he then stated clearly the different systems he would consider:-\n... denote by Σ the system of geometry based on the hypothesis that\nEuclid\n's Fifth Postulate is true, and by S the system based on the opposite hypothesis. All theorems we state without explicitly specifying the system Σ or S in which the theorem is valid are meant to be absolute, that is, valid independently of whether Σ or S is true.\nToday we call these three geometries Euclidean, hyperbolic, and absolute. Most of the\nAppendix\ndeals with absolute geometry. By\n20\nJune\n1831\nthe\nAppendix\nhad been published for on that day\nFarkas Bolyai\nsent a reprint to\nGauss\nwho, on reading the\nAppendix\n, wrote to a friend saying:-\nI regard this young geometer Bolyai as a genius of the first order .\nTo\nFarkas Bolyai\n, however,\nGauss\nwrote:-\nTo praise it would amount to praising myself. For the entire content of the work ... coincides almost exactly with my own meditations which have occupied my mind for the past thirty or thirty-five years .\nThere is no doubt that\nGauss\nwas simply stating facts here. The clearest reference in\nGauss\n's letters to his work on non-euclidean geometry, which shows the depth of his understanding, occurs in a letter he wrote to\nTaurinus\non\n8\nNovember\n1824\nwhen he wrote:-\nThe assumption that the sum of the three angles of a triangle is less than\n180\n° leads to a curious geometry, quite different from ours\n[\ni.e. Euclidean geometry\n]\nbut thoroughly consistent, which I have developed to my entire satisfaction, so that I can solve every problem in it excepting the determination of a constant, which cannot be fixed a priori. .... the three angles of a triangle become as small as one wishes, if only the sides are taken large enough, yet the area of the triangle can never exceed, or even attain a certain limit, regardless of how great the sides are.\nBolyai did not remain long in Lemberg for in\n1832\nhe was posted to Olmütz where he was now a captain. The discovery that\nGauss\nhad anticipated much of his work, however, greatly upset Bolyai who took it as a severe blow. He became irritable and a difficult person to get on with. His health began to deteriorate and he was plagued with a fever which frequently disabled him so he found it increasingly difficult to carry out his military duties. He retired on\n16\nJune\n1833\n, asking to be pensioned off, and for a short time went to live with his father.\nAfter spending a while with his father, Bolyai went to live on the family estate at Domáld which the family had inherited from\nFarkas Bolyai\n's mother. He had met Rozália Kibédi Orbán and they lived together at Domáld from\n1834\n. They did not marry, however, since the law insisted on money being deposited before a marriage could take place and Bolyai could not afford the money. He had two children with Rozália but his pension was insufficient to allow the family to live in comfort. He seems neither to have managed well what money he did have nor to have kept the estate in good order. It seems that\nFarkas Bolyai\ndid not approve of Rozália, was unhappy about his son's financial position, was unhappy that the family estate at Domáld was not being properly cared for, and was unhappy that his son was damaging his good name for Farkas was a highly respected member of the community.\nCertainly Bolyai continued to develop mathematical theories while he lived at Domáld, but being isolated from the rest of the world of mathematics much of what he attempted was of little value. His one major undertaking, to attempt to develop all of mathematics based on axiom systems, was begun in\n1834\n, for he wrote the preface in that year, but he never completed the work. What he did write concerned geometry and there are several ideas in this unpublished work which were ahead of their time such as notions of topological invariance.\nIn addition to his work on geometry, Bolyai developed a rigorous geometric concept of complex numbers as ordered pairs of real numbers. This he did because the Jablonowsky Society in Leipzig had put out a call for papers on the topic. Both Bolyai and his father submitted papers but neither were well received. János's paper was called\nResponsio\nand it was written to answer the question of whether the imaginary quantities used in geometry could be constructed. Bolyai chose to argue that the question was wrongly formulated, not perhaps the best way to find favour with judges. He argued that it was not their construction that was important, rather it was their definition and role in geometry which were significant.\nIn\n1846\nBolyai moved from the estate at Domáld to Marosvásárhely. This meant that he was closer to his father and this seemed to make relations between the two even more strained. In\n1848\nBolyai discovered that\nLobachevsky\nhad published a similar piece of work in\n1829\n. Kagan writes\n[\n14\n]\n:-\nJános studied\nLobachevsky\n's work carefully and analysed it line by line, not to say word by word, with just as much care as he administered in working out the Appendix. The work stirred a real storm in his soul and he gave outlet to his tribulations in the comments added to the 'Geometrical Examinations'.\nThe 'Comments' to the 'Geometrical Examinations' are more than a critical analysis of the work. They express the thoughts and anxieties of János provoked by the perusal of the book. They include his complaint that he was wronged, his suspicion that\nLobachevsky\ndid not exist at all, and that everything was the spiteful machinations of\nGauss\n: it is the tragic lament of an ingenious geometrician who was aware of the significance of his discovery but failed to get support from the only person who could have appreciated his merits.\nIn spite of his mental agitation amidst which János put observations to paper, he preserved enough objectivity to highly appreciate the work of his rival. In his comment to Theorem\n35\nhe remarks that the proofs of\nLobachevsky\nconcerning spherical trigonometry bear the impress of genius and his work should be esteemed as a masterly achievement.\nIn\n1852\nBolyai left Rozália, whom he had married on\n18\nMay\n1849\nbelieving that the law had now changed due to the Hungarian declaration of independance, and splitting with Rozália at least had the advantage that relations with his father improved. He gave up working on mathematics in his last years and instead tried to construct a theory of all knowledge. There are interesting ideas contained in the sections on linguistics and sociology.\nAlthough he never published more than the few pages of the Appendix he left more than\n20000\npages of manuscript of mathematical work when he died of pneumonia at the age of\n57\n. These are now in the Bolyai-Teleki library in Târgu-Mureș. In\n1945\nthe Hungarian university in Cluj was named after him. The Romanian University of Cluj which had been the King Ferdinand I University, was renamed Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. The two universities combined to become the Babeș-Bolyai University in\n1959\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}