{
  "nome_completo": "Józeph Miksa Petzval",
  "nome_curto": "Józeph Petzval",
  "ano_nascimento": "1807",
  "ano_morte": "1891",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petzval/",
  "lugar_nascimento": "Spisská Belá, Hungary (now in Slovakia)",
  "lugar_morte": "Vienna, Austria",
  "biografia": "There are different versions of\nJózeph Petzval\n's name, and, in addition to the one given here, he is often known as\nJozef Maximilian Petzval\nbut his family name sometimes appears as\nPecval\n,\nPeczival\nor\nPecivál\n. While giving different versions, let us also remark that the town of his birth is Spisská Belá which is sometimes written as Szepesbéla. This town was in Hungary when Petzval was born there but it is now in Slovakia. In fact since this area of Europe has seen different peoples over time all names have several different versions and we realise that we have not been consistent in the names we give below.\nJozef was the son of the schoolmaster Johann\n(\nJán\n)\nFriedrich Petzval and his wife Susanna\n(\nZuzana\n)\nCreutzman. Susanna, the daughter of Joseph and  Susanna Creutzman, was baptised in Spisská Belá on\n20\nApril\n1776\n. Johann, born on\n4\nJuly\n1775\nin Lodenice, taught in the evangelical school in Spisská Belá and\n[\n13\n]\n:-\n... was a great influence on Joseph. A well-rounded man, Johann Friedrich was an incredibly gifted musician, composer, and hobby mechanic. He made a lasting musical contribution to the churches in their district, but also made pianos, improved the riding saddle for the Hungarian military, and even worked on the Perpetuum - an early flying machine. He was known for being very eccentric and would often be found directing the church choir in his pyjamas.\nJozef was one of his parents' six children\n(\nactually seven but one died while a baby\n)\n. He had a younger brother Otto Balthasar Petzval who was born on\n6\nJanuary\n1809\n. Note the coincidence that both brothers were born on the same day but an even greater coincidence is that the third brother Ján was only one day different, born on\n7\nJanuary, or some say also on\n6\nJanuary. The\n6\nJanuary is the Christian festival of the Epiphany when the three Kings, Melchior, Caspar and Balthasar, visited the new born Jesus and hence the naming of Josef's brother as Otto Balthasar. Unsurprisingly the three brothers were known in their family as the \"Three Kings\". Let us note at this stage that Otto Petzval also became a professor of mathematics and published\nElementary mathematics\n(\nHungarian\n)\n(1856)\nand\nHigher mathematics\n(\nHungarian\n)\n(1867)\n. The other three children were girls, one of whom was Maria Mathilda.\nJohann had to leave Spisská Belá because of problems in his church, and in\n1815\nthe family moved to Késmárk. Joseph attended primary school in Késmárk\n(\nnow Kezmarok in Slovakia\n)\nand, after that, the gymnasium at Podolin\n(\nnow Podolinec\n)\n. He completed his schooling in Levoca where the family moved in\n1819\n. At first his best subjects were Latin and religious studies while he performed badly in mathematics having no interest in the topic. Petzval's teacher advised his father that he should leave school and take up a trade and the family considered having him become an apprentice to a cobbler. However, he found an interesting book on mathematics, namely\nAnalytische Abhandlung der Anfangsgründe der Mathematik\nⓉ\n(\nAnalytical treatise on the foundations of mathematics\n)\n(1807)\nby Mathias Hauser. He studied this book over the summer and his performance improved markedly so that when he returned to school in the autumn he was now the best mathematics student in his class. After leaving school in\n1823\nhe went to Košice\n(\nnamed Kassa at the time\n)\nwhere he attended the Lyceum for a while but he was financially poor and was forced to undertake work as a tutor to earn money to survive. He spent two years studying with Professor Barlai, the Professor of Mathematics and Philosophy. After completing his studies, he took a one-year position as a tutor employed by Count Almássy.\nIn\n1826\nPetzval entered the Institutum Geometricum of the University of Pest\n(\ntoday the Eötvös Loránd University\n)\nto study philosophy and mathematics. Later, in\n1872\n, the town of Pest was to join with the town of Buda on the opposite bank of the Danube to form Budapest. The main language of instruction at the university at this time was German and not until\n1860\ndid Hungarian become the language of instruction. During his two years at the university he studied the works of\nLacroix\n,\nLaplace\nand\nLagrange\n. He also made quite a reputation for himself in the student body as a highly skilled fencer. After graduating from the University with an engineering degree in\n1828\n, Petzval was appointed to the city of Pest as an expert in flood prevention and drainage. He undertook this work for seven years and showed real talents in his job.\nPetzval taught mechanics and mathematics at the University of Pest from\n1832\nand he became a professor in Higher Mathematics at the University of Pest in\n1835\n. Then, two years later, he accepted a chair of mathematics at the University of Vienna. We note that soon after Petzval left the University of Pest, his brother Otto Petzval was appointed as a professor of Higher Mathematics at the University of Pest in\n1839\n, a position he held until his death in\n1883\n.\nPetzval worked for much of his life on the\nLaplace transform\n. He was influenced by the work of\nLiouville\nand wrote both a long paper and a two volume treatise on the\nLaplace\ntransform and its application to ordinary linear\ndifferential equations\n. His study is thorough but not entirely satisfactory since he was unable to use contour integration to invert the transform. But for a student of Petzval we might today call the\nLaplace\ntransform the Petzval transform. Petzval fell out with this student who then accused Petzval of plagiarising\nLaplace\n's work. Although this was untrue,\nGeorge Boole\nand\nHenri Poincaré\n, influenced no doubt by the quarrel, called the transformation the\nLaplace\ntransform. Szénássy writes\n[\n5\n]\n:-\n... in the\n[\n19\nth\n]\ncentury\n[\nHungarian\n]\nscientists obtained particularly nice results in the theory of differential equations. ... special mention must be made of Józef Petzval who, after a whole range of articles on remarkable results of his own, around the middle of the\n[\n19\nth\n]\ncentury published a two-volume monograph on differential equations that was the only guide in the field for a long time\n[\nIntegration der linearen Differentialgleichungen\nⓉ\n(\nIntegration of linear differential equations\n)\n(\nVol.\n1\n,\n1853\n; Vol.\n2\n,\n1859)]\n. Decades later it will still be referred to as a major source. Among his original results, the most important ones concern the singular solutions to linear differential equations with a complex variable. He went deeper into this subject than\nRiemann\nand was ahead of\nPoincaré\nin several respects. The nowadays fairly complete theory of\nRiccati\n's differential equations owes a lot to him.\nToday Petzval is best remembered for his work on optical lenses and lens aberration done in the early\n1840\n's\n(\nPetzval curvature is named after him\n)\nwhich allowed the construction of modern cameras. Petzval produced an achromatic portrait lens that was vastly superior to the simple meniscus lens then in use. In\n[\n11\n]\nhis work in optics is described as follows:-\n[\nAt the University of Vienna\n]\nhe studied in detail L M Daguerre's invention, the so-called daguerreotype, and took on shortening its exposure time from minutes to seconds. In\n1840\n, his extraordinary mathematical talent allowed him to assess and build an anastigmatic with six times greater luminosity. This Petzval highly luminous early form of photo lens was used by the enterprising Viennese optician Voigtländer, who launched its mass production and won a silver medal at the World's Exhibition Fair in Paris. Petzval also perfected the telescope and designed the opera glasses.\nThis description actually hides a lot of the difficulties that Petzval encountered. After he was appointed to the chair of mathematics at the University of Vienna he rented an abandoned monastery on the Kahlenberg mountain in the Vienna Woods and there set up his own glass workshop. The portrait lens he designed was a great improvement on previous lenses and Petzval had completed the calculations by May\n1840\n. He handed the design over to the company\nVoigtländer & Sohn\nrun by Peter Wilhelm Friedrich Voigtländer\n(1812\n-\n1878)\nand received a small sum for them. Voigtländer's company, which had been founded by his grandfather Johann Christoph Voigtländer in\n1756\n, marketed a camera using Petzval's lens design in\n1841\nand it revolutionised portrait photography. Voigtländer made a fortune but Petzval had not taken out patents and received no royalties. He fell out with Voigtländer and attempted to construct his lens at his workshop on the Kahlenberg. He was approached by the Military Geographic Institute and they asked him to design a landscape lens. He did so and produced the design of a lens which again vastly improved on what was in current use. In collaboration with the optician Carl Dietzler they discussed marketing the lens around\n1854\n. He presented his lens at a meeting of the\nAcademy of Sciences Leopoldina\nin\n1856\n, but, although his work was received with great enthusiasm, Dietzler's firm went bankrupt in\n1862\n. Voigtländer again used Petzval's designs to market his own cameras, further increasing the enmity between the two men.\nAlthough Petzval is now recognised for his remarkable work on optics, he was so disillusioned by how things turned out that he gave up all his work on optics and even stopped lecturing on the subject. The last straw came in\n1859\nwhen his home was burgled and the manuscript of a treatise on optics which he was writing was destroyed. After that he turned to research in acoustics but he still was a founder of the Photographische Gesellschaft in\n1861\nbut declined the offer of the presidency, preferring instead to be awarded an honorary membership.\nPetzval seems to have been entirely in the right over his arguments with Voigtländer but, unfortunately, he also had an argument with\nChristian Doppler\nwhere he was totally incorrect. The problems arose for a number of reasons. First Petzval considered photography as an art form for portraits and landscapes, not as a tool in scientific research. Secondly, he was a firm believer in scientific discoveries being firmly mathematically based and only if one could describe the science via differential equations was it, for him, proper science. It was these beliefs that led to his completely incorrect attack on\nDoppler\n's theories regarding light.\nThe\nAustrian Academy of Sciences\nwas founded in Vienna in\n1846\n.\nChristian Doppler\nwas elected to the\nAcademy\nin\n1848\nand Petzval in\n1851\n. The first sign of trouble between the two occurred in\n1851\nwhen, at the\n27\nMay meeting,\nDoppler\nproposed that the\nAcademy\noffer a prize for improvements in the Daguerre photographic process. Petzval objected to this proposal and it was not taken further. It is a little unclear what Petzval objected to. Perhaps he considered he was the expert and\nDoppler\nshould not stray into his area. Perhaps he considered that his work had already overtaken the basic premise of the competition.\nSoon Petzval launched another attack on\nDoppler\n, attacking the\nDoppler\nprinciple which relates the frequency of a source to its velocity relative to an observer.\nDoppler\nhad proposed this in his\n1842\npaper\nÜber das farbige Licht der Doppelsterne und einige andere Gestirne des Himmels\nⓉ\n(\nOn the coloured light of the twin stars and some other stars of heaven\n)\n.\nDoppler\nderived the principle in a few lines treating both light and sound as longitudinal waves in the ether and matter, respectively. Although, of course, the\nDoppler\nprinciple is correct and extremely important for astronomical research, nevertheless much of\nDoppler\n's paper is incorrect, in particular his belief that the\nDoppler\nprinciple explained the different colours of binary stars. Petzval's attack came at the meeting of the\nAustrian Academy of Sciences\non\n15\nJanuary\n1852\nwhere he presented his paper\nÜber die Unzukömmlichkeiten gewisser populärer Anschaungsweisen in der Undulationstheorie und ihre Unfähigkeit des Princip der Erhaltung der Schwingungsdauer zu ersetzen\nⓉ\n(\nOn the unsuitability of certain popular ways of looking at the undulation theory and their inability to replace the principle of maintenance of the wavelength\n)\n. It was published later in\n1852\nin\nSitzungsberichte der Kaiserlichen Akademie der Wissenschaften. Mathematisch-Naturwissenschaftliche Classe\nⓉ\n(\nMeeting reports of the Imperial Academy of Sciences. Mathematical and Natural Sciences\n)\n. His attack was based on the fact that\nDoppler\nderived the principle in a few lines using only simple equations. Petzval claimed in his paper:-\nWithout the application of differential equations, it is not possible to enter the realms of great science.\nThe minute of the\nAcademy\n's meeting of\n15\nJanuary\n1852\nreads\n[\n1\n]\n:-\n... the full member, Professor Petzval held a lecture 'On the unsuitability of certain popular ways of looking at the undulation theory and their inability to replace the principle of maintenance of the wavelength'. He presented the manuscript for the report on the meeting. The full member, Professor\nDoppler\n, hereupon read a note entitled 'Remarks on the essays: on a general principle of the undulation theory' and presented this for the report on the meeting. The full member Director van Ettingshausen also read some remarks on the essay referred to which are also intended for the report.\nAlec Eden writes\n[\n1\n]\n:-\nIn these objections Petzval confused two completely different cases: one in which there is relative movement between the sound source and the listener, and the other in which the medium is in motion but the sound source and listener are stationary. In the second case there is, according to the\nDoppler\nprinciple, no change in tone. In fact, Petzval's protracted and hard attacks, which came to a head during the meeting of the\nAustrian Academy of Sciences\nunder the presidency of Andreas von Baumgartner on\n21\nMay\n1852\n, were eventually shown to be the best mathematical proof of\nDoppler\n's theory.\nA third meeting of the\nAcademy\non\n21\nOctober\n1852\nagain saw Petzval attack\nDoppler\nbut by this time\nDoppler\nwas too ill to defend himself and had travelled south hoping to restore his health. Petzval's attack was vicious\n(\nsee for example\n[\n4\n]\n)\n:-\nOne cannot say exactly that\nDoppler\n's theory is of no value because it points to the facts of a phenomenon in a way that is definitely incorrect. On the contrary one has to say it has negative value because it has caused so many interested in that science to be misled through an illusion of simplicity and clarity which, however, is nothing more than superficial and lacks depth of understanding.\nThe result of all this was that the\nAcademy\nsupported Petzval belief that\nDoppler\n's theory was incorrect despite the fact that it had been verified experimentally many times since it was first proposed.\nThe dispute was summed up by Egon von Opplzer in\n1901\nat a speech he gave of the unveiling of a statue of\nDoppler\nin the University of Vienna\n[\n1\n]\n:-\nHis opponent\n[\nPetzval\n]\nbandied with such expressions as 'great science' and 'small science' in the\nAustrian Academy of Sciences\n, being of the opinion that great truths could not be found in a few lines and through an equation with only one unknown, and that at least one differential equation is necessary - and in this way he believes to have shown the incorrectness of the\nDoppler\nprinciple. Whoever probes somewhat deeper will find in these attacks, not a purely scientific motive, but a more personal goal. It is the old contradiction between genius and talent which must lead to a struggle when, on the side of the talent there is no understanding of intuitive action and individual brilliance. For\nDoppler\n, surveying his principle, it is of clear certainty, and for him - a true natural researcher - the attack on a law that has already been confirmed through experiments is completely incomprehensible. He responded in a factual and decisive manner.\nAs a teacher, Petzval was well-liked by his students\n[\n15\n]\n:-\nAs Professor of Mathematics at the University of Vienna, he was known for his lively lectures and incredibly unique teaching style. He lectured on optics, linear and differential equations, analytical mechanics, acoustics, ballistics and mechanical vibrations. Petzval was very critical of academic teaching methods - a feat he probably developed out of his own experience with the limited teaching styles which he encountered as a child. He was very outspoken against his department and the university administration and strove to bring imagination and creativity into his classes.\nIn January\n1869\nPetzval married his housekeeper Katarina Schlegl. He was\n62\nyears old at this time but we have been unable to find out Katarina's age. Sadly, she died three years later. In\n1877\n, on reaching the age of\n70\n, Petzval retired from his professorship at the University of Vienna. After this, he retired to the Kahlenberg where he lived essentially alone for the final\n14\nyears of his life. His only company on the Kahlenberg seems to have been his horse. When he died there were no family members at his funeral, only a few students, a couple of old friends and a representative of the University of Vienna. In\n1905\nthe mayor of Vienna recalled that Petzval had been a great man and a great scholar who brought glory to the city of Vienna and glory to the University of Vienna. Because of him, said the mayor, Vienna had become a world centre for photography. However, he said that although Petzval had lived in Vienna for\n54\nyears he had remained faithful to his native country, he remained Hungarian.\nPetzval won many distinctions for his work. In addition to those mentioned above, he was elected a member of the\nHungarian Academy of Sciences\nin\n1873\n, an honorary member of the\nUnion of Czech Mathematicians and Physicists\nin\n1881\n, and he received the platinum medal of Charles Chevalier from France. A street in Vienna bears his name as does a crater on the far side of the Moon.\nSzénássy writes\n[\n5\n]\n:-\nStudents liked Petzval and considered him a true firm and helpful friend, but his colleagues suffered much from his strong criticism.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}