{
  "nome_completo": "József Kürschák",
  "nome_curto": "József Kürschák",
  "ano_nascimento": "1864",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kurschak/",
  "lugar_nascimento": "Buda (now part of Budapest), Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "József Kürschák\n's mother was Jozefa Teller and his father was András Kürschák, a manual worker who died when József was six years old. After the death of his father, József was brought up in Budapest by his mother. It is correct to say that József, although born in Buda, was brought up in Budapest after the death of his father since Budapest was created by the unification of Buda, Obuda and Pest in\n1872\n. Kürschák attended secondary school in the flourishing city that became not only the capital of Hungary but also a major centre for industry, trade, communications, and architecture. Most importantly for the young boy, he was growing up in a city which was a centre for education, and for intellectual and artistic life.\nKürschák entered the Technical University of Budapest in\n1881\nand graduated in\n1886\nwith qualifications to teach mathematics and physics in secondary schools. He then taught at a school in Roznyo, Slovakia, for two years before returning to the Technical University of Budapest to undertake research. He received his doctorate in\n1890\nand then taught in Budapest, at the Technical University, for the whole of his career. He was appointed in\n1891\nand successively promoted, achieving the rank of professor in\n1900\n.\nIn\n[\n2\n]\nthe authors describe a paper by Kürschák written in\n1898\nin which a regular dodecagon\ninscribed\nin a unit circle is investigated. A trigonometric argument can be used to show that its area of the dodecagon is\n3\nbut Kürschák gives a purely geometric proof. He proves that the dodecagon can be dissected into a set of triangles which can be rearranged so as to fill three squares with sides having length\n1\n. Kürschák's tile, which occurs in the title of\n[\n2\n]\n, is constructed as follows. Start with a square and construct an equilateral triangle drawn inwards on each side. A regular dodecagon has the following\n12\npoints as vertices: the\n8\nintersections of the corresponding sides of adjacent equilateral triangles and the\n4\nmid-points of the sides of the new square formed by the vertices of the four triangles. In fact the first paper which Kürschák wrote was concerned with polygons. This was\nÜber dem Kreise ein-und umgeschriebene Vielecke\nⓉ\n(\nOn the circles on  rewritten polygons\n)\n(1887)\nwhich investigated extremal properties of polygons inscribed in, and circumscribed about, a circle.\nAnother topic which Kürschák investigated was the differential equations of the calculus of variations. Papers such as\nÜber partielle Differentialgleichungen zweiter Ordnung mit gleichen Charakteristiken\nⓉ\n(\nOn partial differential equations of second order with the same characteristics\n)\n(1890)\n,\nÜber die partielle Differentialgleichung des Problems\nⓉ\n(\nOn the partial differential equation of the problem\n)\n(1894)\n,\nÜber die Transformation der partiellen Differentialgleichungen der Variationsrechnung\nⓉ\n(\nOn the transformation of partial differential equations of the calculus of variations\n)\n(1902)\n, and\nÜber eine charakteristische Eigenschaft der Differentialgleichungen der Variationsrechnung\nⓉ\n(\nOn a characteristic property of the differential equations of the calculus of variations\n)\n(1905)\nare examples of his work in this area. He proved invariance of the differential equations he was considering under contact transformations. Another problem he solved in this area was to find, in his\n1905\npaper, necessary and sufficient conditions for\n[\n1\n]\n:-\n... a second-order differential expressions to provide the equation belonging to the variation of a multiple integral.\nLed to consider linear algebra in the context of the above work, he wrote a number of papers on matrices and\ndeterminants\nsuch as\nÜber symmetrische Matrices\nⓉ\n(\nOn symmetric matrices\n)\n(1904)\nand\nEin irreduzibilitätssatz in der Theorie der symmetrischen matrizen\nⓉ\n(\nAn irreducibility theorem in the theory of symmetric matrices\n)\n(1921)\n.\nKürschák's most important work, however, was in\n1912\nwhen he founded the theory of valuations. His idea was to define\n∣\nx\n∣\n| x |\n∣\nx\n∣\nfor a rational number\nx\nx\nx\nas follows. Express\nx\nx\nx\nin lowest terms as\np\nn\n(\na\nb\n)\np^{n}(\\Large\\frac{a}{b}\\normalsize )\np\nn\n(\nb\na\n​\n)\nand then define\n∣\nx\n∣\np\n=\np\n−\nn\n| x |_{p} = p^{-n}\n∣\nx\n∣\np\n​\n=\np\n−\nn\n. For example\n∣\n20\n11\n∣\n2\n=\n1\n4\n| \\large\\frac{20}{11}\\normalsize  |_{2} = \\large\\frac{1}{4}\\normalsize\n∣\n1\n1\n2\n0\n​\n∣\n2\n​\n=\n4\n1\n​\n,\n∣\n20\n11\n∣\n3\n=\n1\n| \\large\\frac{20}{11}\\normalsize  |_{3} = 1\n∣\n1\n1\n2\n0\n​\n∣\n3\n​\n=\n1\n,\n∣\n20\n11\n∣\n5\n=\n1\n5\n| \\large\\frac{20}{11}\\normalsize  |_{5}= \\large\\frac{1}{5}\\normalsize\n∣\n1\n1\n2\n0\n​\n∣\n5\n​\n=\n5\n1\n​\n, and\n∣\n20\n11\n∣\n11\n=\n11\n|\\large\\frac{ 20}{11}\\normalsize  |_{11} = 11\n∣\n1\n1\n2\n0\n​\n∣\n1\n1\n​\n=\n1\n1\n.\nThe rationals are not complete with this metric and their completion is the field of\np\np\np\n-adic numbers. Kürschák's work was inspired by earlier work of\nJulius König\n,\nSteinitz\nand\nHensel\n. The importance of Kürschák's valuations is that they allow notions of convergence and limits be used in the theory of abstract fields and greatly enrich the topic.\nDénes König\nand\nVon Neumann\nwere both students of Kürschák and many other famous mathematicians benefited from his teaching.\nDénes König\nreceived his doctorate in\n1907\nfor a thesis written under Kürschák's supervision.\nPeter\nwrites in\n[\n4\n]\nthat:-\n... outstanding mathematicians such as\nHunyadi\n,\nJulius König\n, Kürschák and Rados have contributed to the high standard of mathematical education at the Technical University\n[\nof Budapest\n]\n. Their scientific and teaching activity affected mathematical life in the whole country and laid the foundation of the internationally recognized mathematical school in Hungary.\nIndeed Kürschák achieved this through his excellent teaching as well as bringing the very best out of his students. He was one of the main organisers of mathematical competitions and to honour his outstanding contributions in this area the\nLoránd Eötvös\nMathematics Competition, started in\n1925\n, was renamed the József Kürschák Mathematics Competition in\n1949\n.\nKürschák was elected to the Hungarian Academy of Sciences in\n1897\n.",
  "math_areas": [
    "Algebra",
    "Calculus"
  ]
}