{
  "nome_completo": "Jacobus Stephanus de Wet",
  "nome_curto": "Jack de Wet",
  "ano_nascimento": "1913",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Wet/",
  "lugar_nascimento": "Rouxville, Orange Free State, South Africa",
  "lugar_morte": "Basingstoke, England",
  "biografia": "Jacobus Stephanus de Wet\n, known as\nJack de Wet\n, was the son of Jacobus Rees de Wet\n(1877\n-\n1962)\nand Ellen Johanna Le Roux\n(1883\n-\n1926)\n. Jacobus Rees de Wet, known as Jim, was given the name of Rees after Dr Rees who was present at his birth. He attended Wellington Boys High School in Wellington, a town in the Western Cape Winelands of South Africa, before studying law at Victoria College, Stellenbosch which is now known as Stellenbosch University. He then moved to the University of Cape Town where he graduated with a law degree in\n1905\n. An athletic young man, he represented the Western Province in rugby in\n1905\nand\n1906\n. He practiced as a lawyer in Rouxville and married Ellen Johanna Le Roux, the daughter of Petrus Jacobus le Roux and Elsie Johanna de Kock, on\n25\nSeptember\n1909\nin Cape Town. They had two children, both born in Rouxville: Ellen Johanna de Wet\n(\nborn on\n23\nNovember\n1911)\nand Jacobus Stephanus de Wet\n(\nborn\n1\nJuly\n1913)\n, the subject of this biography. Jack de Wet was the grandson of an Afrikaner general in the Boer War.\nLet us note at this point that Jacobus Rees de Wet continued to practice as a lawyer in Rouxville until\n1922\nafter which he accepted a position as managing director of Smithfield Executors' Chamber in Smithfield, about\n30\nkm north of Rouxville. He also served as mayor of Smithfield for a time. Jack de Wet's older sister Ellen Johanna de Wet\n(1911\n-\n1991)\ngraduated with an M.Sc. with major subjects mathematics and botany. She became a mathematics teacher in a school and married Marthinus Lourens Malan on\n4\nJuly\n1939\nin Lindley, Orange Free State, South Africa.\nJack de Wet began his schooling in Rouxville Primary School, before going to Smithfield High School in Smithfield for his secondary education. He graduated from the High School in\n1929\nwith a performance which ranked him in the top ten students in the Free State and led to him being awarded a scholarship to attend the University of Cape Town. He enrolled as an engineering student and quickly showed his potential by being ranked first in the examinations at the end of the first year. He continued to impress and was awarded a bronze medal at the end of his second year followed by a silver medal at the end of his third year. He graduated in\n1932\nwith the engineering degree B.Sc.\n(\nEng.\n)\nbut decided he wanted to study more mathematics and remained at the University of Cape Town for a further year taking courses in mathematics, applied mathematics and physics. He graduated with a B.A. in mathematical sciences in\n1933\nbeing awarded distinction in all three topics.\nAfter studying the mathematical sciences, de Wet was certain that mathematics was the topic for him and he gave up any idea that he might have a career as an engineer. He was appointed as a junior lecturer at the University of Cape Town in\n1934\nbut keen to continue his studies abroad he applied for a Rhodes scholarship to enable him to study at the University of Oxford in England. The award of the scholarship enabled him to travel to England and to begin studying at Balliol College Oxford for a B.A. degree in October\n1935\n. Leaving Durban, South Africa on the ship the\nCarnarvon Castle\nhe sailed to Southampton, England, arriving on\n30\nSeptember\n1935\n. He matriculated as a student at Balliol College, Oxford and studied mathematics. He returned to South Africa for the\n1936\nsummer vacation, leaving Southampton on\n26\nJune\n1936\nsailing on the ship the Balmoral Castle to Cape Town, South Africa. After spending the summer vacation in South Africa, he returned to Balliol College, Oxford sailing from Durban on the Carnarvon Castle and arriving in Southampton on\n5\nOctober\n1936\n. After two years at Oxford, he graduated with a B.A. with first class honours in June\n1937\n. We note here that Edward Heath, who became Prime Minister of the United Kingdom in\n1970\n, was a student at Balliol College, matriculating in\n1935\nthe same year as de Wet. Heath and de Wet became university friends.\nAfter graduating from Oxford, de Wet moved to Cambridge where he was appointed as a research assistant at St John's College and began undertaking research in mathematical physics for a doctorate. After a year at the University of Cambridge, he was awarded a Commonwealth Fellowship which provided funds for him to go to Princeton University in the United States to complete his Ph.D. Before travelling to the United States, he returned to South Africa for the summer of\n1938\nsailing from Southampton on the\nCapetown Castle\nto Cape Town arriving on\n1\nJuly\n1938\n. He then went to the United States via England, sailing from Durban to Southampton on the\nStirling Castle\n, arriving on\n2\nSeptember\n1938\n, continuing his journey leaving from Liverpool, England, on the\nLaconia\n, and arriving in New York on\n20\nSeptember\n1938\n. On this ship there were at least fourteen people going to the United States to study funded by a Commonwealth Fellowship. On entering the United States, de Wet gives the following personal details: Height,\n5\nft\n10\nins; Hair Colour, Brown; Eye Colour, Grey; Complexion, Dark.\nAt Princeton, de Wet became a member of the School of Mathematics of the Institute for Advanced Study from September\n1938\nuntil June\n1929\nand again from September\n1939\nuntil June\n1940\n. De Wet's research at Princeton progressed rapidly and in January\n1940\nhe submitted the paper\nOn the connection between the spin and statistics of elementary particles\nto the\nPhysical Review\njournal. The Abstract reads:-\nIt is shown that\nFermi\n-\nDirac\nquantisation by the procedure of\nHeisenberg\nand\nPauli\ncannot be carried out for tensor wave equations. Since the general wave equations for particles with integral spin are tensor equations, it follows that for these integral spin equations\nFermi\n-\nDirac\nquantisation cannot be carried out. During the course of the discussion it appears that for equations derived from Lagrangians which are nonlinear in the derivatives of the functions,\nFermi\n-\nDirac\nquantisation cannot be carried out. Since the\nHeisenberg\n-\nPauli\ntheory applies only to nonlinear Lagrangians, a special discussion of linear Lagrangians\n(\nlinear in the derivatives of the functions\n)\nis given. It is shown how equations derived from such Lagrangians can be put into Hamiltonian form. Lagrangians of this type occur for the equations for half-odd spin.\nHoward Robertson\nreviewing the paper writes in\n[\n9\n]\n:-\nThe author applies the\nHeisenberg\n-\nPauli\nprocedure for the quantisation of wave fields to various wave equations, with especial reference to the statistics satisfied by the particles described thereby. He shows that the\nFermi\n-\nDirac\nquantisation cannot be carried out on tensor equations, thus confirming Fierz's conclusion that a particle with integral spin cannot obey the\nFermi\n-\nDirac\nstatistics; the possibility of subjecting particles of half-odd spin to this statistics is attributed to the fact that their equations are derivable from a Lagrangian which is linear in the derivatives of the wave function. Particles of any spin may be subjected to the\nEinstein\n-\nBose\nstatistics, but Sokolow and Iwanenko's objection to this quantisation in the case of spin\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nare shown to be relevant for any half-odd spin.\nDe Wet also published\nOn the spinor equations for particles with arbitrary spin and rest mass zero\n(1940)\nin the\nPhysical Review\njournal. He submitted this paper in April\n1940\nwith the following Abstract:-\nThe spinor equations for arbitrary spin and rest mass zero are examined in some detail. Fierz has shown that for all values of the spin\nf\n(\n>\n1\n2\nf (> \\large\\frac{1}{2}\\normalsize\nf\n(\n>\n2\n1\n​\n)\nthere exists only two \"really\" independent plane wave solutions instead of\n(2\nf +\n1)\nwhen the rest mass is not zero. Fierz later showed, in rather a complicated way, that these two plane waves correspond to components of spin ±f along the momentum vector of the wave. We will arrive here at the same result but in a much simpler and more direct way.\nHoward Robertson\nalso reviewed this paper and writes in\n[\n10\n]\n:-\nThe Fierz-\nPauli\ntheory of particles of higher spin is re-examined in the case when no forces are present, and in particular for the rest-mass\n0\n. By a consequent use of the spinor calculus some results of Fierz are obtained in a considerably simpler way: the existence of only\n2\n\"really\" independent plane waves\n(\nfor positive rest-mass their number would be\n2\nj+\n1\n, if the spin is j\n)\n, and the fact that these waves correspond to spin components\n±\nj\n±j\n±\nj\nalong the momentum vector of the plane wave.\nDe Wet was awarded a Ph.D. by Princeton in\n1940\nfor his thesis\nOn the connection between the spin and statistics of elementary particles.\nThe Introductions begins:-\nThe purpose of this dissertation is to study the connection between the spin and statistics of elementary particles. The study of this problem was started by\nPauli\n, who attempted to show that the scalar wave equation did not admit\nFermi\n-\nDirac\nquantisation. His work was incorrect, the result he expected to find has turned out to be correct.\nWe have given quite a lot of details of this work by de Wet but we feel that it was important; for example the authors of\n[\n5\n]\nconsider de Wet's thesis to be fifteen or so years ahead of its time.\nReturning to South Africa, in July\n1940\nde Wet was appointed as a lecturer at the University of Cape Town. He married Madge Annie Glass\n(1905\n-\n2001)\n, the daughter of the commercial traveller Ernest Edward Glass, in Cape Town on\n27\nJune\n1941\n. Madge had been born in Solihull, England on\n16\nDecember\n1905\nand had an elder brother Cecil Frank Glass, born\n24\nMarch\n1901\n. The Glass family emigrated to South Africa in\n1911\n. We note here that Madge's brother Frank Glass was deeply affected by the treatment of the South African black majority, became politically active and in\n1921\nwas a founder member of the Communist Party of South Africa but resigned from it in\n1925\n. He became a journalist.\nJack and Madge de Wet had a son Jacobus Stephanus de Wet born on\n13\nJune\n1942\n. From\n1942\nto\n1946\nJack was professor of mathematics at the University of Pretoria. He then returned to Balliol College, Oxford in\n1946\nwhere he accepted a one year ICI fellowship together with a college research fellowship. The family\n(\nJack, Madge, and Jacobus Stephanus Jr, together with\n13\nyear old John de Wet, Jack's stepson\n)\nsailed from Cape Town to Southampton on the\nCarnarvon Castle\narriving on\n7\nSeptember\n1946\n. After a year at Balliol College, in\n1947\nde Wet was appointed as a mathematics tutor at Balliol College and lecturer at Oxford University. He held these positions for\n24\nyears.\nOn\n24\nFebruary\n1952\n, Jack and Madge de Wet's second child, Christiaan Dominic de Wet, was born in Oxford. He went on to become a computer programmer and IT consultant.\nDuring his first few years in Oxford, Jack de Wet was a very active researcher publishing\nSymmetric energy-momentum tensors in relativistic field theories\n(1947)\n,\nOn the quantization of field theories derived from higher order Lagrangians\n(1948)\n,\nOn the relativistic invariance of quantized field theories\n(1948)\n,\nA note on the relativistic invariance of quantized field theories\n(1950)\n,\nThe interaction representation in the quantum theory of fields\n(1950)\n,\n(\nwith Alan Schwartz\n)\nThe minors of a determinant in terms of Pfaffians\n(1950)\n, and\n(\nwith Franz Mandl\n)\nOn the asymptotic distribution of eigenvalues\n(1950)\n. Four of these papers were published in the\nProceedings\nof the Cambridge Philosophical Society and three were published in the\nProceedings\nof the\nRoyal Society of London\n.\nThe work as a college tutor and as a university lecturer was demanding and de Wet did not continue his research career but devoted himself enthusiastically to his tutoring and lecturing duties. The author of\n[\n8\n]\nwrites:-\nJack de Wet was the doyen of mathematics tutors in Oxford. His personality was ideally suited to guiding and directing the studies of the young\n(\nin some cases the not so young\n)\n; his extraordinary command of both pure and applied mathematics at the undergraduate level became legendary at the university. The range of his tutorial and lecture teaching was without equal during these years; from abstract algebra through analysis to classical applied mathematics and modern quantum theory there seemed to be no subject that was not within his grasp.\nHis enthusiasm for mathematics\n(\nat times he could never sit still in tutorials for the sheer excitement of the subject\n)\nwas infectious. He inspired the able and gifted to their first class honours, and guided and sometimes firmly directed the average to leaving the college with a qualification appropriate to their abilities. At the blackboard he was a bundle of nervous energy; some mistakes were inevitable but for most students such minor deficiencies led to a more complete understanding of both the concrete and the abstract.\nHis range of mathematical interests is illustrated by the fact that he was asked to review\nThe theory of groups\nby Ian D Macdonald by the\nLondon Mathematical Society\n. De Wet writes about Macdonald's book as someone who has much experience tutoring students studying group theory\n[\n14\n]\n:-\nThis is an excellent introduction to the theory of groups and one which satisfies a real need. In the earlier chapters the pace is very leisurely and eminently suitable for students with no background to speak of in abstract algebra. In the later chapters the exposition is still a model of clarity but, quite appropriately, becomes gradually less detailed. ...\nAmong the many students that de Wet tutored at Balliol College, let us mention Robin James Wilson, the son of the former Prime Minister of the United Kingdom Harold Wilson, who went on to have an outstanding career researching in graph theory and the history of mathematics.\nIn\n1971\nde Wet and his wife decided to return to South Africa and he resigned his positions at the University of Oxford. He was appointed as Dean of the Faculty of Science at the University of Cape Town and he held that position from\n1971\nto\n1982\n. He was also appointed as Assistant Principal of the University of Cape Town in\n1975\nand had other major roles in the university serving on the Council to advise on science and industrial research. Although de Wet was a very modest man, there was one achievement of which he was proud. He served as a member of the Rhodes Scholarship selection committee and it was mainly through his strong arguments that the first non-White was elected to a scholarship in\n1976\n.\nDe Wet left the University of Cape Town in\n1982\nto take up a position as adviser to the Council for Scientific and Industrial Research. He was given the task to:-\n... investigate options for research funding in higher education and to advise the CSIR in indicating the role the Research Grants Division\n(\nRGD\n)\ncould play to satisfy these research funding needs.\nSue Krige writes\n[\n12\n]\n:-\nAfter discussions between Prof de Wet and the CSIR Executive, Prof de Wet and Dr Arndt made a series of visits during February and March\n1983\nto vice-chancellors and personnel of the ten universities most active in research. Draft documents, containing the framework of Prof de Wet's ideas, were sent to university authorities for their approval prior to the rounds of discussions. During these visits, Prof de Wet's new concepts for research funding were discussed in depth, after which comments and suggestions were incorporated into the documentation. All further drafts of the document were also sent to universities on a regular basis for their comments. The draft report - A new look at the role of the Research Grants Division in the promotion of research in the South African Universities - was sent to universities for their comments on\n8\nApril\n1983\n.\n...\nIn May and June of\n1983\n, Prof de Wet and Dr Arndt visited western Europe, the USA and Canada to investigate university research funding systems. Two months later, in August\n1983\n, Prof de Wet submitted the foundational report A framework for the promotion of free research in universities and an integrated research effort in the areas of national concern between the universities, CSIR institutes and other bodies - attached to which was 'An addendum to a framework etc.' This also contained his suggestions for one CSIR body responsible for the funding of external research ...\nIt is worth quoting what de Wet wrote about \"The good researcher\" in May\n1983\n(\nsee for example\n[\n12\n]\nor\n[\n13\n]\n)\n:-\nSelf initiated or curiosity research is what people do to satisfy their own curiosity. It is what turns them on and for good people to do what turns them on is both highly satisfying for the researcher and often the most productive use of a good person's time. What they do often seems quite useless in the eyes of others until, often very much later, the seminal nature of their work becomes abundantly clear to everybody. The moral is to support and encourage the good researcher to do their own thing.\nDe Wet's term of office officially ended in August\n1985\nand in\n1986\nhe returned to England and taught for a while at the University of Oxford before retiring to Odiham, Hampshire. He continued to help others working on a voluntary basis at the local Computer Open Learning Centre and occasionally teaching mathematics at Robert May's School, a secondary school with academy status located in Odiham. He always retained an interest in the affairs of Balliol College and in the students he had tutored there\n[\n8\n]\n:-\nDuring these last years the \"Balliol de Wet mathematicians\", all former Balliol students of de Wet, formed themselves into a college group. A number of meetings were organised for the purpose of renewing friendships, and dining well in the college hall. On these memorable occasions de Wet's remarkable memory rarely failed him and all his former students were greeted with their first names. This group numbered about\n185\nand on the occasion of de Wet's\n80\nth birthday celebration no fewer than\n70\nwere present in the college to pay him tribute.\nThose who knew Jack de Wet all speak of his warmth, quickness of mind and enthusiasm. Francis Muir writes\n[\n7\n]\n:-\nAfter a lapse of more than\n40\nyears I renewed acquaintance with Jack de Wet, my Balliol Mathematics Tutor, when he discovered Internet and email. Rather shortly after this Jack died, and his son Chris sent me several obituaries ... . By way of explanation I should add that it was a pleasant custom at Oxford for the most senior and distinguished professors to teach the most junior courses. Jack seems to have carried this one step further by, in his eventual retirement, teaching classes in a village education centre.\nThere is a plaque, numbered\n20\n, which commemorates Jacobus Stephanus de Wet, on the Balliol College East Wall.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Statistics"
  ]
}