{
  "nome_completo": "Jack Todd",
  "nome_curto": "Jack Todd",
  "ano_nascimento": "1911",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Todd_John/",
  "lugar_nascimento": "Carnacally, Co Down, Ireland",
  "lugar_morte": "Pasadena, California, USA",
  "biografia": "John Todd\nwas known as Jack to his friends and colleagues. He was born in Carnacally, County Down, in what is now Northern Ireland. His parent were primary school teachers\n[\n1\n]\n:-\n... they had studied in Dublin, and had their honeymoon in the south. When they were courting, they wrote to each other in Esperanto, which was supposed to become the universal language. They learned it on their own. My father was director of the church choir and also was quite active in chess, winning many prizes. I recall playing with his trophies. One was a terrestrial globe, about a foot in diameter, driven by a\n24\n-hour clock, which rotated in front of a brass sun. It had to be given, manually, one turn daily on a threaded circular arc to display the changes of seasons.\nJack was the eldest of his parents' five children; he had three brothers, William, Herbert and George Stewart, and a sister Margaret Louise. In\n1917\n, when he was six years old, his father became a teacher at a primary school nearer to Belfast and Jackn became a pupil at this school. After a year the family moved again, then when John was ten they moved to Belfast so that he could attend secondary school. In\n[\n1\n]\nTodd tells a nice story about how he started to study mathematics at the age of ten while still in primary school:-\nI was in a singing class. My singing was so bad the teacher said I was disturbing the class and had to leave! There were some extra classes, ones with national examinations. And so I had to be put in one of them - it was a second-year algebra class! That's when I started learning mathematics.\nAt age eleven he entered Methodist College Belfast after winning a scholarship. He studied at the school for six years during which time he became firmly convinced that he wanted to become an engineer. With this aim in mind, he studied only mathematics in his final year at the College. After graduating from Methodist College Belfast, Todd entered Queen's University Belfast in\n1928\nwhere he was influenced by\nA C Dixon\n. Todd said of\nDixon\n:-\nHe was a good teacher who could do anything. I started to work for a Cambridge scholarship, and I had to come to him with eight problems from the Cambridge entrance scholarship exam that were really difficult. He could always solve them.\nTodd failed in his attempt to gain a scholarship to Cambridge so he completed his undergraduate degree at Belfast, graduating in\n1931\n. He then went to St John's College, Cambridge, where his studies were partly funded by a grant from St John's College and partly from Queen's University Belfast. He wished to take the Mathematical Tripos at Cambridge but, because he had chosen a course relevant to engineering when at school, he had no Latin qualification so could not enter Cambridge as an undergraduate. However, since he had a first class degree from Queen's University Belfast, the rules did allow Todd to enter Cambridge as a postgraduate student and this is precisely what he did. There was no analyst at St John's College to supervise Todd's studies so\n[\n1\n]\n:-\n... so they sent me next door to Trinity College to see\nHardy\nor\nLittlewood\n. I went to see\nHardy\n, but he wasn't in - he was out watching cricket. However,\nLittlewood\nwas in, and he took me on.\nLittlewood\nadvised Todd against taking a doctorate, suggesting instead that he just do research in mathematics:-\nHe said, \"You can either come and just work here, or you can sign up for a doctor's degree program. I haven't a doctor's degree. You only need one if you want to get a non-academic job. Then I'll write a postcard for you.\"\nAfter two years of research on transfinite superpositions of absolutely continuous functions, developing ideas introduced by\nNina Bari\n, Todd was appointed to Queen's University Belfast. By this time\nA C Dixon\nhad retired and\nSemple\nwas the Professor of Mathematics there.\nSemple\nmoved to a position at King's College London in\n1936\nand the following year he invited Todd to join him there. Before that Todd had attended the International Congress of Mathematicians in Oslo in\n1936\nand, following that, had visited mathematicians in Poland including\nKuratowski\n,\nSaks\nand\nSierpiński\n.\nTemple\nwas the head of the mathematics department at King's College, London. Todd explained\n[\n1\n]\n:-\nHe became ill while giving a lecture series on group theory and quantum mechanics. I knew a bit of quantum mechanics because my first introduction to matrix theory was\nHeisenberg\n's matrix mechanics, based on infinite matrices. I had enough background to begin an elementary course on group theory. I found a problem about the axioms of group theory to mark time. It was an unsolved problem, and I didn't solve it either.\nThe group theory problem was to describe groups in which the normal subgroup relation is transitive\n(\na difficult problem which is still the subject of research\n)\nand it led to Todd asking\nOlga Taussky\n, who was at Westfield College, for advice on it. Their first meeting was in\n1937\nand on the\n30\nSeptember of the following year they were married. After World War II began in\n1939\n, King's College was evacuated to Bristol. Todd was told that he was not needed to teach and should find another job. It was a difficult time with bombs falling on London. Todd and his wife wrote six mathematical papers while sitting in bomb shelters. These papers included\nA characterisation of algebraic numbers\n(1940)\n,\nMatrices with finite period\n(1940)\n,\nMatrices of finite period\n(1941)\n,\nInversion in groups\n(1941)\nand\nInfinite powers of matrices\n(1942)\n. In\nMatrices of finite period\n, published in the\nProceedings\nof the\nRoyal Irish Academy\n, they proved that for a fixed modulus\nm\nm\nm\nevery\n2\n×\n2\nmatrix with integral entries and\ndeterminant\n1\nis congruent, modulo\nm\nm\nm\n, to a matrix of finite order if and only if\nm\n=\n2\nm = 2\nm\n=\n2\nor\nm\n=\n3\nm = 3\nm\n=\n3\n.\nAfter failing to get a job in weather forecasting, Todd was appointed in\n1940\nto the Methodist College, Belfast, where he had himself studied, and also did some teaching at Queen's University, Belfast. After a year he took a job with the Admiralty in Portsmouth working on the problem of how to de-magnetise ships so that they did not set off German magnetic mines. Observing the mathematicians and physicists working on war-time research made Todd realise where the weaknesses lay.\nHe realised that much of the work of physicists was hindered through lack of mathematical and computational skills. He persuaded the Admiralty to let him go to London to set up the Admiralty Computing Service. Then, with\nErdélyi\nand\nSadler\n, he was asked to set up a National Mathematical Laboratory as a division of the National Physics Laboratory. After World War II ended, Todd went to Germany where he examined computers made by\nZuse\n. He also discovered the mathematics research centre at Oberwolfach in the Black Forrest run by\nSüss\nand persuaded Moroccan troops, who arrived shortly after he did, not to destroy the building and the books. For this Todd became known as \"The Saviour of Oberwolfach\". He returned to London and continued to work there until\n1947\n.\nIn the United States\n[\n1\n]\n:-\n... John Curtiss had started his National Applied Mathematics Laboratory, which became a division of the National Bureau of Standards. He invited me to come to America to help when the National Applied Mathematics Laboratory was being started.\nTodd and his wife moved to the United States in September\n1947\n. They spent time in Washington D.C., then time at the Institute for Advanced Study at Princeton before going to Los Angeles in April\n1948\n. Later\n[\n1\n]\n:-\n... John Curtiss asked me to come to Washington to be the head of the Computation Laboratory. It was on the books as a section of a division of the National Bureau of Standards. We worked there until\n1957\n...\nTodd had already become interested in practical mathematics as his article in\nNature\nin\n1946\n, written with\nErdélyi\n, shows.\nSee the article\nPractical Maths\nat\nTHIS LINK\n.\nHe spent ten years in Washington at the National Applied Mathematical Laboratories, developing high-speed computer programming, and becoming a world leader in numerical analysis and numerical algebra. Kobata writes in\n[\n2\n]\nthat in Washington:-\n... Todd was chief of the computation laboratory\n[\nfrom\n1949]\nand later headed the numerical analysis section\n[\nfrom\n1954]\n, while Olga served as a consultant.\nHis work during this period was described in\n2002\nwhen he was honoured by the National Institute of Standards and Technology for his contributions:-\nTodd assembled a capable group of researchers, and both led and participated actively in research on mathematical methods for exploiting the new computational power that was at hand. He studied methods for evaluating mathematical functions, generating random numbers\n(\nfor Monte Carlo calculations\n)\n, conformal mappings, and computations with matrices. He worked on the construction of mathematical tables.\nOver this period Todd's publications included:\nThe condition of a certain matrix\n(1950)\n;\nOn the relative extrema of the Laguerre orthogonal functions\n(1950)\n;\nNotes on modern numerical analysis. I. Solution of differential equations by recurrence relations\n(1950)\n;\nExperiments on the inversion of a\n16\n×\n16\nmatrix\n(1953)\n;\nExperiments in the solution of differential equations by Monte Carlo methods\n(1954)\n;\nThe condition of the finite segments of the\nHilbert\nmatrix\n(1954)\n;\nMotivation for working in numerical analysis\n(1954)\n; and\nA direct approach to the problem of stability in the numerical solution of partial differential equations\n(1956)\n.\nKobata describes in\n[\n2\n]\nTodd's next move from Washington to the California Institute of Technology in Pasadena:-\nIn\n1956\n, the couple received job offers from Caltech, which was just entering computer science. The following year, they arrived at the Institute, where Todd developed the first undergraduate courses in numerical analysis and numerical algebra, prerequisites to learning computing. As a faculty research associate,\nOlga Taussky-Todd\nalso broke new ground - she was the first woman to receive a formal Caltech teaching appointment, and, in\n1971\n, full professorship.\nThe style of the course Todd developed in Caltech is seen from the book\nIntroduction to the constructive theory of functions\nwhich he published in\n1963\n. Todd states in the introduction that he has three aims in writing the book:-\nTo present prospective mathematicians an account of some elegant, but usually overlooked ideas from classical analysis ... to provide ... some mild propaganda for numerical analysis ...\n[\nand\n]\nto put on record ... some of the properties ... of orthogonal polynomials.\nP J Davis writes in a review:-\nThis is not a textbook in the usual sense. Nor is it a survey, nor a collection of expository articles. It is rather a set of blueprints for a problem course, a course in which the quantity of subject matter is secondary and the students' active participation in the process of discovery is crucial. ... The book is absolutely handsome, and can serve as a model to publishers for the excellence of its bookmakers' art and to authors for its punctilio in galley.\nIn an age when many textbooks have become too heavy to lift from the shelf, this book represents a new tack. We wish it well, and hope that it will serve as the mathematical lagniappe its author intends\n.\nIn\n1977\nTodd published the classic two volume work\nBasic Numerical Mathematics\n.\nSee Todd's Preface to the two volumes:\nTHIS LINK\n.\nA S Householder\nwrites in a review:-\nProbably no one has a practical and theoretical background surpassing that of the author, and this book is altogether unique.\nD G Rogers writes of Todd in\n[\n6\n]\n:-\nJack Todd was an exceptionally generous and enthusiastic host on the two brief visits I made to Caltech, although it was a bit hair-raising to ride in the passenger seat with a driver who had had both knees replaced and was on the verge of being declared legally blind - fortunately it was in leafy Pasadena with little traffic about.\nIn May\n2001\nTodd was honoured by Caltech when a conference was held for his\n90\nth\nbirthday. On\n5\nSeptember\n2002\nTodd was honoured with the installation of his portrait in the National Institute of Standards and Technology Gallery of Distinguished Scientists, Engineers and Administrators on its campus in Gaithersburg, Maryland.\nOlga Taussky-Todd\n, who died in\n1995\n, was similarly honoured at the same ceremony. In May\n2006\n, Todd was honoured at a\n95\nth\nbirthday dinner in the Athenaeum Library given by the Division of Physics, Math and Astronomy. We end this biography with some quotes from\n[\n4\n]\n:-\nThomas A Tombrello, chair of the Division of Physics, Mathematics, and Astronomy and William R Kenan, Jr Professor of Physics at Caltech says, \"Jack and his wife Olga were among the pioneers who made us what we are in teaching and research in mathematics. Our sense of collegiality and common purpose are a tribute to them.\"\n\"It was a terrific day for the mathematics department when we succeeded in attracting Jack and Olga to come to Caltech,\" says Gary Lorden, professor of mathematics. \"Not only did we gain eminent scholars, but wonderful colleagues and teachers. They made a remarkably generous commitment to the future of Caltech and the mathematics department, and their legacy also includes the inspiring stories of their lives and careers - Olga, as one of the very first women to make a mark in\n20\nth\n-century mathematics, and Jack as a pioneer in numerical analysis and computing. These two remarkable people will always be remembered with great affection and regard by mathematicians and the Caltech community.\"",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}