{
  "nome_completo": "Jacobus Golius",
  "nome_curto": "Jacob Gool",
  "ano_nascimento": "1596",
  "ano_morte": "1667",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Golius/",
  "lugar_nascimento": "The Hague, Netherlands",
  "lugar_morte": "Leiden, Holland",
  "biografia": "Jacob Gool\nis better known by the Latin version of his name,\nJacobus Golius\n. His parents were Dirck Pietersz Gool and Anna Hemelaers. Dirck Gool had been a resident of the city of Leiden and had lived through the siege of that city by the Spanish from May until October\n1574\n. The siege had been relieved on\n3\nOctober and, after he went to live in The Hague, Dirck returned to Leiden on that day every year to commemorate the day with his former comrades and their descendants. Dirck Gool held various important administrative positions in the Court of Holland in The Hague and was first clerk in the State Council. Later in his life he was an amanuensis to Constantin Huygens, the father of\nChristiaan Huygens\n. Constantin Huygens was, in fact, born in the same year as Jacob, the subject of this biography. Little is known of Jacob's mother, Anna, but it is recorded that Jacob was named after the pastor Jacob Starck who was a great uncle of his mother. Jacob had a brother Petrus Gool.\nGolius attended school in The Hague and then in\n1612\n, went to Leiden to begin his studies at the university there. Both\nWillebrord Snell\nand his father Rudolph Snell\n(1546\n-\n1613)\n, the professor of mathematics at Leiden, were teaching mathematics at Leiden when Golius began his studies. Also teaching mathematics at the university was Frans van Schooten The Elder, father of the better known\nFrans van Schooten\n. Golius was also taught by Aelius Everhardus Vorstius\n(1565\n-\n1624)\nwho had become an extraordinary professor of Natural Philosophy at Leiden in\n1598\n, and a full professor of Natural History and Medicine in the following year. Golius initially focused on the study of medicine, mathematics and astronomy. However, during his studies he became fascinated reading the texts of the ancient Greek mathematicians, particularly the\nConics\nby\nApollonius of Perga\n. The masterpiece\nConics\nwas written in eight books but only the first four have survived in Greek. In Arabic, however, the first seven of the eight books of\nConics\nsurvive. This meant that Golius was keen to learn Arabic to read this work.\nThomas van Erpe\n(1584\n-\n1624)\n, who is also known as Thomas Erpenius, was appointed professor of Arabic and other Oriental languages in Leiden in February\n1613\n. From\n1618\nhe began teaching Arabic to Golius who became extremely enthusiastic about the language and also became a close friend of van Erpe. Golius, who eventually became an expert on Persian, Turkish, Armenian, and Chinese, wanted to extend his knowledge of Oriental languages by travelling to Oriental countries. In\n1622\n-\n24\nhe was sent by the Dutch States General to Morocco to work as an engineer, being a member of a mission headed by Albert Ruyl. Golius was responsible for an investigation into the condition of the Bay of Agadir and asked to study the feasibility of building a harbour there. He visited Muley Zidan, Sultan of Morocco, who had become Sultan in\n1594\nand spent much of his time in the city of Safi, on the coast about\n250\nkm north of the Bay of Agadir, where he worked with Muslim scholars. In particular he met with Ahmad ben Qâsim with whom he had both diplomatic contacts but they also discussed ancient manuscripts.\n(\nFor information on this scholar, see\n[\n8\n]\n.\n)\nAhmad ben Qâsim had made copies of some manuscripts in his own hand and at least one of these is now in the Leiden University Library. After Golius returned to Leiden in\n1624\nhe continued to correspond with Ahmad ben Qâsim about these manuscripts.\nVan Erpe died in\n1624\nand Golius was appointed to succeed him in\n1625\nas the professor of Arabic and other Oriental languages at Leiden. However, in the same year that he was appointed, Golius was given permission to travel in Arabic countries and he made an extensive visit. His first task was as a chancellor in the Dutch consulate at Aleppo from where he visited other major Syrian cities. He was particularly interested in visiting Mesopotamia with its strong reputation for ancient studies in mathematics, astronomy and medicine. He also went to Constantinople where he remained for quite a long time. His learning, especially as a physician and astronomer, impressed the scholars of Constantinople. During his travels Golius collected a large number of Oriental manuscripts which he brought back to Leiden. This gave Leiden the largest collection of Oriental manuscripts anywhere in Europe and aroused a great deal of interest from scholars all over Europe. A list of about\n300\ntitles of these Arabic, Turkish and Persian works were listed in\n1630\nin Paris in a catalogue compiled by\nPierre Gassendi\n. These, however, were only those manuscripts which he had given to the Leiden library. His extensive personal collection of manuscripts is now held in the Bodleian Library in Oxford, England. The manuscripts arrived there after they were purchased by Narcissus Marsh, Archbishop of Armagh, in\n1696\nwho then left them to the Bodleian.\nWillebrord Snell\ndied in\n1626\nand, in\n1629\nGolius was appointed as professor of mathematics at Leiden in addition to his position as professor of Arabic and other Oriental languages. Cornelis Schoneveld writes\n[\n3\n]\n:-\nIn the autumn of\n1633\n, when walking to the academy building, to the botanical garden adjacent to it, or to the library ... housed in the church-building across the Rapenburg canal,\n[\none\n]\nmust have heard the noise made by the carpenters on the roof of the academy erecting a small wooden shed-like structure for the use of Jacobus Golius, Professor not only of Arabic but of Mathematics. He needed it as a kind of observatory \"to demonstrate to the students the course of the heavens and the stars\". For this purpose the \"quadrant or instrumentum mathematicum\", which\nWillebrord Snellius\n, Golius's predecessor, had owned, was bought by the Curators from\nSnellius\n's widow. In addition, Golius received permission to install there the two globes normally placed in the library.\nGolius used this observatory to make good quality observations of lunar eclipses, comets and planets. He also lectured on mathematics, teaching his students about the advances made by the Arabs, particularly the decimal place-value number system. He also taught his students about the ancient Greek mathematics, usually using the Arabic versions of the Greek texts. One of his contributions is related in\n[\n9\n]\n:-\nGolius's interest in chronology led him to investigate the \"Catayan\" system of twelve branches or duodecimal cycles from a Persian work of the\n15\nth\ncentury. Golius obtained additional verbal information from Father Martino Martini, a learned Jesuit, whom he met at Leiden on the latter's passage from Amsterdam to Antwerp. In the interview Golius discovered that Catay referred to China. With the aid of Heurnius's dictionary\n[\nwhich Golius had in his library\n]\nand Martini's advice, he was to publish the cycle of twelve in Chinese characters. It was the first instance of Chinese letters printed\n(\nfrom wood\n)\nin Europe.\nLet us give some details of two of the people mentioned in this quote. Martino Martini\n(1614\n-\n1661)\nwas a Jesuit missionary working mainly in China. Justus Heurnius studied medicine and theology in Leiden and became a protestant missionary. So that missionaries could speak to locals in their own language he published 'Dictionarium Sinense' in\n1628\n.\nIn around\n1630\nGolius married Rensburg van der Goes, the daughter of Matthias van der Goes and Aleyt van Beveren. They had three children, a daughter and two sons, Dirk and Matthias.\nGolius became known as the \"father of Arabic literature\". J T P de Bruijn writes\n[\n5\n]\n:-\nThrough Golius's work the scope of Persian studies, as they had been pursued by Dutch Arabists since the end of the\n16\nth\ncentury, was widened. In the course of the preparation of his famous \"Lexicon Arabico-Latinum'\n(\nLeiden,\n1653)\n, which is partly based on Persian and Turkish lexicographical sources, he also assembled dictionaries for Persian and Turkish. Whereas the latter was never printed, the 'Dictionarum persico-latinum', completed in\n1643\n, was posthumously published by the Cambridge scholar Edmundus Castellus as an appendix to the multilingual dictionary 'Lexicon Heptaglotton'\n(\nLondon,\n1669)\n.\nFurther details of his contributions in this area are given in\n[\n7\n]\n.\n(\nWe have slightly modified and corrected this quote\n)\n:-\nThe \"Arabic Grammar\" of Erpenius, first published in\n1636\n... had given a new impulse to the study of the Arabic, and prepared the philologists of Holland and Germany to demand a work like that of Golius. He, instead of republishing and enlarging Anton Giggaeus 'Thesaurus Linguae Arabicae\n(1632)\n, wisely chose to translate the Arabic lexicon of Jouhari, partly, that the public might thus have both the great native Arabic lexicons in a European dress, and partly for the sake of the passages from various authors which are cited in that work. Jouhari, also, being by birth a Turk, gives his definitions and difficult forms in a way to suit the wants of a foreigner more completely than any native could have done. Golius published his lexicon under the title 'Lexicon Arabico-Latinum contextum ex probatioribus Orientis Lexicographis,' in folio, at Leiden, in\n1653\n.\nWe note that Jouhari means 'the Jeweller' and it is the name by which Abu Nasr Ismael ibn Hammad is known. His first profession was as a jeweller and his dates are unknown but probably are between\n1000\nand\n1100\n. We note that Jouhari's lexicon was one which gave definitions of Arabic words in Arabic, in the same way that the OED gives the meaning of English words with an English description. There is an obvious difficulty here in that no language tends to have two words with the same meaning, so definitions have to be somewhat roundabout. However, what Golius produced with his translation of Jouhari was a lexicon in which the definition of an Arabic word was given in Latin. Although we have called this a translation, in fact it is not really a translation since Golius was able to use many other sources to help him define the Arabic words in Latin.\nWe have already explained above how many of Golius's manuscripts ended up in the Bodleian Library in Oxford, England. In fact, after Golius died his books and manuscripts were sold off in two separate sales. His books were sold in\n1668\nwhile his manuscripts were sold in\n1696\n. The Leiden University would have liked to have been able to make a good offer for Golius's books and manuscripts but they could not make any realistic offer due to a lack of funds. However, one of Golius's students, Levinus Warner\n(1618\n-\n1665)\n, who had studied Middle Eastern languages with Golius, was inspired by him to become a collector of ancient Middle Eastern books and manuscripts. When he died in\n1665\nhe left his private collection of over\n900\nmanuscripts to Leiden University.",
  "math_areas": []
}