{
  "nome_completo": "Jacob Amsler",
  "nome_curto": "Jacob Amsler",
  "ano_nascimento": "1823",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Amsler/",
  "lugar_nascimento": "Stalden bei Brugg, Switzerland",
  "lugar_morte": "Schaffhausen, Switzerland",
  "biografia": "Jacob Amsler\n's father was a farmer. He grew up in Stalden, a town in the Vispa valley six kilometres south of the main Rhône valley. His school education was in the local schools from which he graduated with the intention of studying theology.\nAmsler studied theology first at the University of Jena and then at the University of Königsberg. It was at Königsberg that Amsler changed his course from theology to mathematics and physics. The reason, as is so often in such cases, was inspiring teaching. The teacher who changed Amsler's future was\nFranz Neumann\nwhose lectures and laboratory sessions he attended at the University of Königsberg. In\n1848\nAmsler was awarded his doctorate from the University of Königsberg and he then returned to Switzerland to continue his education.\nBack in Switzerland, Amsler worked for a year at the observatory in Geneva. He completed his studies at Zürich where he was awarded his\nhabilitation\n, thus gaining the right to teach in universities. In\n1850\n-\n51\nhe taught at the university in Zürich, teaching courses on mathematics and on mathematical physics topics. In\n1851\n, wishing to have more time to devote to his research, Amsler took a position at the\nGymnasium\nin Schaffhausen, a town in northern Switzerland situated on the bank of the Rhine. Indeed the Gymnasium did allow him to find more time to undertake research and as a consequence he published a number of article on mathematical physics over the next few years, in particular writing papers on magnetism, heat conduction and on the attraction of ellipsoids.\nIt is worth mentioning this last result in more detail for he worked on a problem which had quite a famous history. That was the problem of the attraction of an ellipsoid, which was first studied in depth by\nIvory\nwhose solution was later generalised by\nPoisson\n. Amsler extended the theorems of both\nIvory\nand\nPoisson\non this topic. It was a promising start to his research career in mathematical physics.\nIn\n1854\nAmsler married and this may have been the turning point in his career. His wife, Elsie Laffon, was the daughter of a well known Swiss scientist and, as was the custom in Switzerland at that time,  he was known as Amsler-Laffon from this time on. Elsie and Jacob Amsler-Laffon's children were, however, always known by the name Amsler rather than Amsler-Laffon.\nShortly after his marriage Amsler changed his research interests and his career. He began to study the construction of precision mathematical instruments and quite quickly he had an idea for the design of a new type of planimeter. He invented the polar planimeter, a device for measuring areas enclosed by plane curves. It was based on polar coordinates whereas earlier instruments were based on cartesian coordinates. In\n1856\nAmsler published a paper\nÜber das Planimeter\nⓉ\n(\nOn the planimeter\n)\nin which he gave details of his idea. As Mahoney writes in\n[\n1\n]\n, Amsler's planimeter:-\n... adapted easily to the determination of static and inertial moments and to the coefficients of\nFourier series\n: it proved especially useful to shipbuilders and railway engineers.\nIn order to make money from his invention, Amsler set up a workshop in Schaffhausen in\n1854\nspecially designed to produce his polar planimeter. Three years later he had given up al his other interests to concentrate fully on producing instruments in the workshop. His shop produced\n50\n000\nsuch instruments during his lifetime.\nAmsler did not rest his fame on this single inspired idea but continued to invent new precision instruments. None of his other inventions came close to the polar planimeter in importance, but they were of sufficient quality to win him prizes at the world exhibition at Vienna in\n1873\n, at Paris in\n1881\n, and again in Paris in\n1889\n. His brilliance was recognised with election to the Paris\nAcadémie des Sciences\nin\n1892\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}