{
  "nome_completo": "Jacob Bronowski",
  "nome_curto": "Jacob Bronowski",
  "ano_nascimento": "1908",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bronowski/",
  "lugar_nascimento": "Łódź, Russian Empire (now Poland)",
  "lugar_morte": "East Hampton, New York, USA",
  "biografia": "Jacob Bronowski\n's father, Abram Bronowski, was the owner of a haberdashery firm which traded between Poland and London, and his mother was Celia Flatto. When Russia occupied Poland during World War I Bronowski's family emigrated to Germany where they lived until the war ended. Then, in\n1920\n, the family moved to London, England.\nThings were not easy for Bruno, as Bronowski was known, when he arrived in England since he spoke no English. This meant a difficult start for him at the Central Foundation School in London. At school he soon found an equal interest for both science and literature. He later wrote:-\nI grew up to be indifferent to the distinction between literature and science, which in my teens were simply two languages for experience that I learned together.\nBronowski won a mathematics scholarship to Jesus College, Cambridge, and there he began his mathematical studies. He was a\nWrangler\n(\nFirst Class\n)\nin Part I of the mathematical tripos in\n1928\nand Senior Wrangler\n(\nranked top of the list of First Class students\n)\nin Part II of the mathematical tripos in\n1930\n. However at Cambridge Bronowski's interests were much wider than mathematics and he continued with his love of literature editing a literary magazine\nExperiment\nwith another mathematics student. It first appeared in\n1928\nand showed, as he later wrote, that poetry was for him as early a love as was mathematics. He stressed his wide interests when he later described his years at Cambridge:-\nAll intellectual life was exhilarating and on the move in the six years that I spent there. Quantum physics was transformed by\nDirac\nand the others. Cockcroft split the atom, and Chadwick discovered the neutron. At the same time, literature and painting were made over by the shock of surrealism and the films\n(\nand later the radio\n)\ngrew to an art.\nHe continued with mathematical research at Cambridge after the award of his first degree working on problems in geometry. After completing the research for his doctorate, he lived for a while in Mallorca during\n1933\n. He went there with Eirlys Roberts, who later published\nWhich\nmagazines, with the intention of being near Robert Graves and Laura Riding. Bronowski worked on a poetry project with Laura Riding but the two fell out. Bronowski then returned to Cambridge where he received his doctorate in mathematics for a thesis which looked at problems in geometry and topology. In\n1933\nhe published a solution of the classical functional\nWaring\nproblem, to determine the minimal\nn\nn\nn\nsuch that a general degree\nd\nd\nd\npolynomial\nf\nf\nf\ncan be expressed as a sum of\nd\nd\nd\nth powers of\nn\nn\nn\nlinear forms, but his argument was incomplete. In the same year that he received his doctorate, namely\n1933\n, he became a British citizen.\nIn\n1934\nhe was appointed a lecturer in mathematics at University College, Hull, which at that time awarded University of London external degrees. Later he was promoted to senior lecturer. He continued his research in geometry publishing a series of papers\nOn triple planes\nand a paper\nThe figure of six points in space of four dimensions\n. His first book was published in\n1939\nand it was not a mathematics book but rather\nThe Poet's Defence\nwhich\n[\n5\n]\n:-\n... wrestled with the relation between the truth of science and that of poetry ...\nIn\n1941\nhe married Rita Coblentz, who was a sculptor, then in\n1942\nhe left Hull to take up war work. His wife later wrote:-\nBruno and I were married bright and early one Monday morning in\n1941\nduring a daylight air raid on London. We lived in Hull for a short time until we were moved to more secret places because of his war work.\nHe worked in the Military research unit of the Home Office where he was a pioneer in\noperational research\n, using the mathematical theory he developed to increase the effectiveness of bombing raids. Not everyone appreciated this work, however, for the government science adviser reported his doubts concerning his competence for this work.\nBronowski went to Japan in\n1945\nwith the British Chiefs of Staff Mission to study the effects of the atomic bomb on Nagasaki. This was to change his life and, after this experience, he gave up military research to concentrate on the\nethics\nof science and later on life sciences. In his book\nScience and Human Values\n(1956)\nhe described this visit to Nagasaki:-\nOn a fine November day in\n1945\n, late in the afternoon, I was landed on an airstrip in Southern Japan. From there a jeep was to take me over the mountains to join a ship which lay in Nagasaki Harbour. ... suddenly I was aware that we were already at the centre of damage in Nagasaki. The shadows behind me were the skeletons of the Mitsubishi factory buildings, pushed backwards and sideways as if by a giant hand. What I had thought to be broken rocks was a concrete power house with its roof punched in. I could now make out the outline of two crumpled gasometers; there was a cold furnace festooned with service pipes; otherwise nothing but cockeyed telegraph poles and loops of wire in a bare waste of ashes. I had blundered into this desolate landscape as instantly as one might wake among the craters of the moon.\nAfter this visit Bronowski wrote his famous report\nThe Effects of Atomic Bombs at Hiroshima and Nagasaki\n. After his war work ended Bronowski did not return to being a mathematics lecturer. He had by this time published a second book\nWilliam Blake, a man without a mask\nin\n1944\n; a work written in his spare time. He continued with the mathematical interests which he had taken up during the war, however, continuing to work on operations research. He published a statistics paper with\nNeyman\nThe variance of the measure of a two-dimensional random set\nin\n1945\n. He then worked for UNESCO applying statistics to the economics of industry from\n1947\nto\n1950\n. Then in\n1950\nhe was appointed as director of the Coal Research Establishment of the National Coal Board. He headed the research into smokeless fuels and one early form of such fuel was called \"Bronowski's Bricks\".\nThe\n1950\ns saw a change in Bronowski's interests. He expressed this himself as follows:-\n[\nI am a\n]\nmathematician trained in physics, who was taken into the life sciences in middle age by a series of lucky chances.\nIt was because of Bronowski's skills as a mathematician that he was approached to look at a problem in palaeontology. He was asked to use statistical methods to try to determine whether the fossilised skull of a child, which had been found at Taung in Eastern Africa many years earlier, was a possible ancestor to human beings. Bronowski wrote:-\nIn\n1950\n, when\n[\nthe Taung child's\n]\nhumanity was by no means accepted, I was asked to do a piece of mathematics. Could I combine a measure of the size of the Taung child's teeth with their shape, so as to discriminate them from the teeth of apes?\nThis turned his interests towards the unique biology of human beings and, something which had always interested him, their unique intellectual products. About the same time Bronowski began his career as a broadcaster, perhaps the part of his life for which he is most widely remembered. He frequently appeared on the programme\nThe Brains Trust\nrapidly gaining a reputation as a scientist with great depth and breadth of knowledge yet with a great gift for explaining difficult scientific concepts in an understandable way. In\n1953\nhe was visiting professor of history at Massachusetts Institute of Technology. It was during this period that he worked on the ideas which were to appear in his book\nScience and Human Values\n:-\n... from which the great debate on 'two cultures' sprang - one in which Bronowski never accepted the idea of a separation between the scientific and the humanistic aspirations of man.\nBronowski wrote:-\nFor me science is an expression of the human mind, which seeks for unity under the chaos of nature as the writer seeks for it in the variety of human nature.\nAmong his books are\nThe Common Sense of Science\n(1951)\n,\nScience and Human Values\n(1956\n, revised edition\n1965)\n, which we quoted from above, and\nThe Identity of Man\n(1965)\n.\nThrough his new interests in biology, Bronowski became involved in the setting up of the Salk Institute for Biological Studies at La Jolla, near San Diego, California. The Institute aimed to examine the integration of the biological and human sciences. He was a non-resident fellow at the Salk Institute from\n1960\n, becoming resident there in\n1964\nwhen he was appointed Senior Fellow, becoming Director of the Council for Biology at La Jolla in\n1970\n.\nAlready known for his exceptional abilities to communicate science and philosophy both in books and in broadcasting, he received many invitations to lecture. He had presented a series for BBC television in the early\n1960\ns called\nInsight\nin which he had looked at mathematical ideas such as\nprobability\n, scientific ideas such as entropy and also the extent of human intelligence. His last major project was to write and narrate the BBC television series\nThe Ascent of Man\nwhich was filmed between July\n1971\nand December\n1972\n. The thirteen part series was broadcast in\n1973\nand also published in book form in that year. He wrote in the introduction to the book:-\nIt demands an unflagging intellectual and physical vigour, a total immersion, which I had to be sure I could sustain with pleasure; for instance, I had to put off researches I had already begun.\nI\n[\nEFR\n]\nremember watching this remarkable television series which, in a style much copied since, described in humanist terms the work of\nPythagoras\n,\nNewton\n,\nEinstein\n, Galen, Versalius, Darwin, Mendel, Szilard,\nJohn von Neumann\nand many others showing their contributions as significant highlights in human development.\nHe was a short man, less than five feet tall, but in his young days he was physically strong and athletic. However, he became ill while making\nThe Ascent of Man\nand his health deteriorated. He died of a heart attack on Long Island, New York but he is buried in Highgate Cemetery in north London.\nEric and Freda Roll write\n[\n2\n]\n:-\nHe was ... a warm and vibrant human being. Every encounter with him was a powerful tonic which left one feeling intellectually and emotionally stimulated and enhanced. He did not, however, suffer fools gladly and could be bitingly sardonic about human folly or about the glaring discrepancies so often to be found between public acclaim and true worth. But to his friends he was kind and affectionate, a companion whose gaiety and wit counterbalanced his serious approach to life.\nPerhaps Bronowski's philosophy of life is best summed up in his own words:-\nI see now that the problem of man's status between the world and himself has haunted me since the difficult days of boyhood. All that I have written, though it has seemed to me so different from year to year, turns to the same centre: the uniqueness of man that grows out of his struggle\n(\nand his gift\n)\nto understand both nature and himself.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}