{
  "nome_completo": "Jacob Palis Jr",
  "nome_curto": "Jacob Palis Jr",
  "ano_nascimento": "1940",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Palis/",
  "lugar_nascimento": "Uberaba, Minas Gerais, Brazil",
  "lugar_morte": null,
  "biografia": "Jacob Palis Jr\n. was the son of Jacob Palis Sr who emigrated to Brazil from Lebanon. Jacob Palis Sr married Sames, an immigrant to Brazil from northern Syria. Jacob Jr is the youngest of his parents' family of eight children, having four older brothers and three older sisters. Jacob Palis Sr had a large store in Uberaba, a city in the Brazilian Highlands, which sold everything. He did not let his children help in the store, however, since he was very keen that they should have the best quality education and all study at a university, this was his obsession. Jacob said in the interview\n[\n26\n]\n:-\nWhen I was four years old, my parents enrolled me in a small school near my house. I would walk to school and back home by myself. When I went to the public elementary school, I already knew how to add, subtract, multiply and I knew the elements of mathematics.\nPalis attended school in Uberaba then in\n1956\n, when he was sixteen years old, he moved to Rio de Janeiro where he lived with one of his older brothers who by this time was studying engineering at the Federal University of Rio de Janeiro. Let us note that this university was called the University of Brazil at this time and only acquired its present name of Federal University of Rio de Janeiro in\n1965\n. Palis's brother had a very comfortable apartment that faced the Sugar Loaf Mountain which is on a peninsular jutting out into the Atlantic Ocean. After studying for one year at High School in Rio de Janeiro, Palis sat the entrance examination for the University of Brazil. He was awarded the highest grade but was not allowed to begin his studies as he had not reached the minimum entry age for the University. After one further year at the High School, he again sat the entrance examinations, again was ranked with the highest grade and entered the National School of Engineering at the University of Brazil to begin his studies in\n1958\n.\nAlthough Palis was studying for an engineering degree, the subjects that he loved were mathematics and physics. At this time it was a standard route for those interested in mathematics to take engineering courses and mathematicians taught in the National School of Engineering. For example the mathematician\nMaurício Matos Peixoto\nwas the professor of Rational Mechanics in the National School of Engineering and he strongly influenced Palis. When he was well into the engineering course, Palis began to attend talks at the Instituto de Matemática Pura e Aplicada\n(\nIMPA\n)\nin Rio de Janeiro and also, but rather less often, he went to the Centre of Brazilian Physics Research\n(\nCBPF\n)\nin Rio de Janeiro. At this time Palis still intended to have a career in engineering but he planned, after gaining his engineering degree, to study mathematics and physics, then to return to engineering with the great advantage of having a very strong mathematical and physical base behind him. He graduated with his engineering degree in\n1962\nand then, influenced by\nMaurício Peixoto\n, he went to the Institute of Pure and Applied Mathematics\n(\nIMPA\n)\nas an intern.\nAt the Institute of Pure and Applied Mathematics he studied with\nMaurício Peixoto\nand\nElon Lima\n.\nPeixoto\nhad studied for a doctorate at the University of Chicago but had returned to Rio de Janeiro when offered a professorship at the University of Brazil without completing his Ph.D. studies.\nElon Lages Lima\n(1929\n-\n2017)\nhad been awarded a Ph.D. by the University of Chicago in\n1958\n. Both\nPeixoto\nand\nLima\nhad met with\nStephen Smale\nin Princeton in\n1958\nand were very impressed with his work on dynamical systems. They suggested to Palis that he should go to the United States and study for a Ph.D. on dynamical systems with\nSmale\n. Palis took the advice and wrote to\nSmale\nwho was at that time at Columbia University in New York. With strong recommendations from\nPeixoto\nand\nLima\n,\nSmale\nrapidly accepted Palis and agreed to be his advisor. In December\n1963\nhe accepted a place at Columbia University to study for a Ph.D. beginning in September\n1964\n.\nThe next major task for Palis was to obtain a scholarship to support his doctoral studies. In April\n1964\nthere was a coup by the armed forces in Brazil which led to a military dictatorship. The National Council of Scientific and Technological Development which gave scholarships to outstanding Brazilians to study abroad ceased to operate after the coup and Palis feared this would put a stop to his plans. He had relied on financial support from his father through much of his education and felt there was no way to ask him for further financial support. Then somebody suggested that he apply to the Instituto Brasil-Estados Unidos. This Binational Centre had as its mission promoting understanding between the American and Brazilian people through cultural and educational activities and could award Fulbright scholarships. Palis applied and, after being examined by a committee, was awarded a Fulbright scholarship. The committee said that they would choose the best place in the United States for him to study but Palis told them that he would only accept if he could go to Columbia University and study under\nSmale\n.\nIn June\n1964\nSmale\nwrote to Palis saying that he was accepting a position at the University of California at Berkeley. Since it was too late for Palis to apply to study at Berkeley he wrote to\nSmale\nasking what he should do. He was told not to worry, that\nSmale\nwould speedily arrange his enrolment. At Berkeley, Palis studied at first for a Master's Degree which he was awarded in\n1966\n. He was undertaking research for his doctorate while studying for the Master's Degree and was able complete work on his thesis\nOn Morse-Smale Diffeomorphisms\nby September\n1967\n. He submitted a paper with the same title as his thesis to the\nAmerican Mathematical Society\nin February\n1968\n. It has the following note:-\nThe results announced here are contained in the author's doctoral thesis at the University of California, written while he held a fellowship from C.N. Pq., Brazil. The author wishes to thank Professor\nS Smale\nfor his guidance.\nIn his thesis he proved that, in dimension no greater that\n3\n, the set of\nMorse\n-\nSmale\ndiffeomorphisms is open and its elements are structurally stable. Palis was awarded a Ph.D. for his thesis in\n1968\nand had two further papers published in that year:\nOn Morse-Smale dynamical systems\n; and\nOn the local structure of hyperbolic points in Banach spaces\n.\nAfter completing work of his thesis, Palis visited Brown University in late\n1967\n. Alberto Verjovsky writes\n[\n39\n]\n:-\nI remember vividly when I saw Jacob Palis for the first time at Brown University in the winter of\n1967\n. He was there to visit my advisor\nMaurício Peixoto\nand gave a beautiful seminar about his thesis at Berkeley under\nStephen Smale\n. I was immediately impressed by his mathematics but also by his kindness and generosity in sharing ideas.\nPalis also visited the Massachusetts Institute of Technology and Harvard. He returned to Berkeley in February\n1968\nwhere he had been offered a position as Assistant Professor. The fifteenth Summer Mathematical Institute of the\nAmerican Mathematical Society\n, with the topic of global analysis was to be held at Berkeley from\n1\nJuly to\n26\nJuly and Palis was keen to attend. Palis has two papers in the Proceedings of the Symposium, namely\nA note on\nΩ\n\\Omega\nΩ\n-\nstability\nand\n(\nwith\nStephen Smale\n)\nStructural stability theorems\n. Kenneth Meyer reviews the second of these papers in\n[\n29\n]\nand writes:-\nThis paper proves that the class of diffeomorphisms or vector fields called\nMorse\n-\nSmale\nsystems are structurally stable on an arbitrary compact n-manifold. This settles an old conjecture about structurally stable systems and generalises a result of\nM M Peixoto\nfor\n2\n-manifolds and the result of the first author for\n3\n-manifolds in \"On Morse-Smale diffeomorphisms'', Ph.D. Thesis, University of California, Berkeley, California,\n1968\n.\nIn August\n1968\nPalis returned to Brazil and he explained his reasons in the interview\n[\n26\n]\n:-\nAt that time,\nElon Lima\n, who had been a professor in Brasilia and then had come back to IMPA, was at Berkeley as a visiting professor. Manfredo do Carmo, another colleague and mathematician, was there as well, studying for his post-doctorate degree. I used to talk to them a lot and we had the impression that Brazil had very few mathematicians - but those few were top notch, especially\nLeopoldo Nachbin\nand\nMaurício Peixoto\n. These two professors spent long period abroad for scientific and other reasons. Elon, Manfredo and I had the feeling that it would be important to have a permanent scientific environment, where research studies would be conducted systematically and new researchers would also be systematically trained.\nBack in Rio de Janeiro, Palis accepted posts at both the Federal University of Rio de Janeiro and at the Institute of Pure and Applied Mathematics. In the summer of\n1969\nhe spent some time at the Differential Equations Symposium at the University of Warwick and both Palis and\nSmale\nare in June\n1969\nConference photograph.\nSee\nTHIS LINK\n.\nDuring this visit to Europe, he also visited the Institut des Hautes Études Scientifiques in France where the American mathematician Harold William Rosenberg\n(\nborn\n1941)\nwas working. In\n1970\nPalis was elected to the\nBrazilian Academy of Sciences\n. In that year, he decided that he did not want to divide his work between two institutions and from that time on worked only at the IMPA.\nIn\n1970\n,\nElon Lima\n,\nMaurício Peixoto\nand Palis were organising the first International Symposium on Dynamical Systems, to be held at the University of Bahia, Salvador, Brazil from\n26\nJuly to\n14\nAugust\n1971\n. This became possible through a chance meeting of Palis and José Pelúcio Ferreira one day when Palis got off at a different bus stop from his usual one and took a longer walk home. Pelúcio was Deputy Secretary General of the Ministry of Planning and General Coordination and managed the newly created National Fund for Scientific and Technological Development. Palis spoke with great enthusiasm to him about a new doctoral programme they were introducing at IMPA and said that it would be good for their students if they could organise an international conference. Pelúcio promised funding while the two men chatted on a quiet little street. In\n[\n28\n]\nPalis explains why the conference was held at the University of Bahia:-\n... our conditions, on Rua Luís de Camões, at that point, really did not allow us to hold a large meeting. Five years later this was possible due to modifications that were made, but at that time the building, which is very beautiful, was not suitable for a mathematics institute. So the three committee members, we decided on something different. Why not think of a centre, for example, in the northeast? ... The idea was to open up a little space for mathematical activity in the country. Also, on the other hand, given that the meeting would be attended by many mathematicians and students, especially from Rio and, in part, from São Paulo, we thought that the location itself was not very important, as long as it was suitable for the meeting. ... We then left for a visit to Salvador, Recife and Fortaleza. In fact Salvador, due to the fact that it was opening a new building for Mathematics, naturally imposed itself.\nThe new doctoral programme at IMPA began with great success with three of Palis's students completing their degree by\n1973\n:\nWelington de Melo\n(\nStructural Stability on\n2\n-Dimension Manifolds\n)\n, Pedro Mendes\n(\nEstabilidade em Variedades Abertas\nⓉ\n(\nStability in open varieties\n)\n)\nand\nRicardo Mañé\n(\nPersistent Invariant Manifolds are Normally Hyperbolic\n)\n. In\n1972\nPalis was awarded a John Simon Guggenheim Fellowship which enabled him to spend\n1973\nat the University of California at Berkeley.\nPalis was awarded the Moinho Santista Prize in\n1976\n; this is the most prestigious prize for science in Brazil. He was an invited speaker at the International Congress of Mathematicians in Helsinki in\n1978\ngiving the address\nModuli of stability and bifurcation theory\n. He dedicated his talk \"To\nRufus Bowen\n, in memoriam.\" The talk begins:-\nBifurcation theory of dynamical systems goes as far back as\nPoincaré\n. One aims at describing the changes in the phase portrait\n(\nspace of orbits\n)\nof a system depending on parameters when such parameters vary. This lecture concerns a line of recent developments in this direction, especially on bifurcations of one parameter families of vector fields and diffeomorphisms. A relevant role, in this context, is played by certain differentiable invariants of topological equivalence for systems that exhibit non-transversal saddle connections. Such invariants bring up, in a natural way, the notion of moduli of stability in dynamical systems. They also imply, as explained in one of the topics below, the existence of moduli of stability for holomorphic vector fields near a singularity.\nAs he did in\n1969\n, Palis went to Europe in the summer of\n1980\nand again spent a little time at both the University of Warwick in England and at the Institut des Hautes Études Scientifiques in France. This began a series of regular visits, roughly every two years, usually to Europe but in\n1984\nto the United States and in\n1988\nto Japan. Also in\n1988\n, along with\nChris Zeeman\n, he organised the four-week long Summer School on Dynamical Systems held in Trieste, Italy. Palis taught the course \"Introduction to Dynamical Systems: Geometric Theory\" with problem sessions run by Rodrigo Bamon and Maria Josè Pacifico.\nGiving details of the extraordinary research contributions that Palis has made requires deep technical details; these are given in\n[\n30\n]\n. Our best option is to let Palis himself describe his contributions, quoting from the acceptance speech he gave in Italy when receiving the Balzan Prize in\n2010\n[\n13\n]\n:-\nIn the development of my scientific work, I have travelled a long way, from the global stability of dynamical systems, to the bifurcations of\nPoincaré\n's cycles and fractal dimensions and finally, to a meaningful proposal of a global scenario for dynamics, comprising chaotic systems. I have begun to prove that gradient-like dynamical systems in lower dimensions are stable, meaning that the structure of their orbit remains qualitatively the same under small perturbations of the law of evolution. This has considerably extended a previous remarkable work by\nPeixoto\n. The methods of proof used, have embodied a new geometric approach that will fundamentally influence subsequent developments in this area of research: the creation of the notion of stable foliations being partially subfoliated to include those of critical points or isolated period motions of higher indices where they accumulate. Immediately after that, this result was extended to all dimensions in a joint work with\nSmale\n, who had been my thesis adviser. Together, we formulated the well-known stability conjecture that became a major topic of research in the area, partially solved, about two decades later, in a remarkable exposition by\nMañé\n, one of my students, and subsequently by Hyashi in a similar context. Liao also contributed to the solution of this question. Since the early seventies, I have become very interested in the theory of bifurcations of\nPoincaré\n's cycles, together with Newhouse and, sometime later, Takens. It became clear that fractal dimensions would play a key role in understanding such bifurcations. My early collaboration with Newhouse and Takens was later extended to\nYoccoz\nand Viana in the eighties and then Moreira in the nineties. Together, we have proved that fractal dimensions indeed determine the frequency of stability in homoclinic bifurcations in all dimensions. The case of heterodimensional cycles in higher dimensions have been successfully considered by Bonatti, Diaz and Rocha, among others. Based on previous work, I was able to formulate by\n1995\na bold series of ideas and conjectures that encompassed a global view of dynamics with much more of a probabilistic character than attempted before. The Russian school of\nKolmogorov\nand\nSinai\n, among others, was inspiring. Such a programme has spurred significant activity and some successful results derived from this can be seen in works by Lyubich,\nde Melo\n,\nAvila\n, Moreira, Martens, Viana, and also Abdenur, Bonatti, Diaz, Rocha, Crovisier, Pujals, Sambarino and Wen among others, as well as\nYoccoz\nand myself.\nFor Palis's own description of the Balzan Project that he carried out\n2011\n-\n2015\nfunded by the award of the Balzan Prize, see\nTHIS LINK\n.\nFor information about books written by Palis, see\nTHIS LINK\n.\nIn addition to the prizes we have mentions, Palis has also won\nThe World Academy of Science\nPrize\n(1988)\n, the National Prize for Science and Technology, Brazil\n(1990)\n, the InterAmerican Prize for Science from the Organization of the American States\n(1995)\n, the Prize Mexico for Science and Technology\n(2001)\n, the Trieste Science Prize in Mathematics\n(2006)\n, the\nAccademia Nazionale dei Lincei\nInternational Prize\n(2008)\n, and the Abdus Salam Medal\n(2015)\n.\nThere is another important contribution that Palis has made to mathematics, namely the leading roles he has played in both Brazilian and International Scientific Institutions. In Brazil he served as Director of the Instituto Nacional de Matemática Pura e Aplicada\n(\nIMPA\n)\n1993\n-\n2003\n, and has been a member of the Scientific Committee of National Research Council of Brazil\n1988\n-\n1992\n;\n1994\n-\n1998\n; and\n2001\n-\n2005\n. He served as a director of the\nBrazilian Academy of Sciences\n1977\n-\n1979\n;\n1979\n-\n1981\n; and\n2001\n-\n2004\n. He was elected Vice-President of the\nBrazilian Academy of Sciences\n1999\n-\n2001\nand its President\n2007\n-\n2010\n. On the international scene he served as a member of the Executive Board for the International Council for Science\n1993\n-\n1996\n, and was its Vice-President\n1996\n-\n1999\n. He was a member of Executive Board of the\nInternational Mathematical Union\n1982\n-\n1991\n, its Secretary\n1991\n-\n1999\nand its President\n1991\n-\n1999\n. He was a Founding Member of the Latin American and Caribbean Mathematical Union and served as the Chair of its first Scientific Committee. He was a member of the Scientific Advisory Committee of the Eidgenössische Technische Hochschule Zürich\n1990\n-\n2006\n. He was Secretary General of the\nThe World Academy of Sciences\n2000\n-\n2006\n, then its President\n2007\n-\n2010\n.\nLet us end with a couple of quotes. First from Sheldon Newhouse\n[\n30\n]\n:-\nI think it's really fair to say that in our time Jacob Palis has been one of the main figures responsible for the development of Mathematics and Science, primarily in Latin America and, in fact, in many other places, through his organisation of meetings, symposia, workshops, and the support of sciences and Mathematics in developing countries, most notably, that I'm familiar with, in Trieste. He has facilitated the contacts between scientists who have had great difficulty in traveling to the west for political or other reasons. They were able to establish contacts with western mathematicians in the settings of meetings, workshops, and schools where one can get to meet many people. I myself met a number of people from mainland China in Trieste, at a time when it was extremely difficult for them to travel to Western Europe. Jacob has been one of the primary organisers and supporters of such occasions. Moreover, he has been responsible, in great measure, for the tremendous growth of IMPA, this wonderful institute, as a researcher and, more recently, also as the Director. I think it's fair to say that IMPA has become the principal centre for Mathematics in Latin America and, certainly, one of the world centres for Dynamical Systems. In no small measure is this due to his efforts and, again, his vision.\nFinally a quote from\nDavid Mumford\n, see page\n28\nof\n[\n1\n]\n:-\nI have come to believe that something like\n50\n% of research mathematicians are somewhere on the \"autistic spectrum\". How could it be otherwise? Research for most of us is a solitary occupation, necessitating endless hours of mulling over abstract ideas, trying to sort them out and imprint their key ideas into our brains. This can be torture for the gregarious nature. But now and then, someone comes along who transcends this trap, someone who can work collaboratively and also love the give and take of mathematical discussion. Even rarer is the individual who possesses such personal charisma that both powerful and wealthy people rise to the challenge of understanding the deep importance of mathematics - then, wonder of wonders, they agree to fully support our work. Needless to say, this great institute IMPA would never have existed without your stewardship, your infectious enthusiasm and the political skills that brought it into existence. The IMPA is something like Coleridge's Xanadu, a true pleasure dome for our community of mathematics lovers. There it is, rising above the chaotic craziness of Rio into the midst of a beautiful tropical forest, an assembly of intense people drinking the strongest Brazilian coffee and talking mathematics! ... What you have accomplished, that I have glimpsed from afar, is something so inspiring that it has often made me wish for a second life to devote to that field. One thing I do know: we had tremendous fun working together all over the world at meetings of the\nInternational Mathematical Union\nand I have had so much unforgettable pleasure and delight from my half dozen visits to Rio at your invitation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}