{
  "nome_completo": "Jacques-Louis Lions",
  "nome_curto": "Jacques-Louis Lions",
  "ano_nascimento": "1928",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lions_Jacques-Louis/",
  "lugar_nascimento": "Grasse, Alpes-Maritimes, France",
  "lugar_morte": "Neuilly-sur-Seine, France, France",
  "biografia": "Jacques-Louis Lions\ngrew up in Grasse, Alpes- Maritimes, which is a town in the Provence- Alpes- Côte- d'Azur region of southeastern France. A beautiful town in the foothills of the Alps, it is the centre of the French perfume industry with the countryside filled with roses, jasmine, bitter orange blossom and other flowers from which the perfumes are distilled. Lions was deeply attached to the town that he grew up in, and it always remained as a place to return to whenever possible throughout his life. Jacques-Louis's father Honoré Lions was a contractor and his mother was Annette Muller. Honoré Lions was the mayor of Grasse for nearly\n30\nyears and was\n[\n2\n]\n:-\n... a politician who is said to have been generously devoted to the good of his constituency.\nJacques-Louis attended school in Grasse but World War II meant that France became an occupied country while he was studying. At the end of\n1943\n, although he was only\n15\nyears old, he joined the French Resistance showing great determination to free his country. While serving with the French Free Forces of the Interior, he met a girl Andrée Olivier, also from the south of France, who was in the Resistance. They later married, on\n21\nAugust\n1950\n, and their only child,\nPierre-Louis Lions\n, was born in\n1956\n. He has become as famous a mathematician as his father and he too has a biography in this archive.\nIn\n1946\nLions left the Collège de Grasse and studied for one year at the Lycée Félix-Faure in Nice. While there he was advised by an examiner, after an oral exam, to sit the entrance examinations for the École Normale Supérieure in Paris. It was good advice indeed! Passing the examinations he studied at the École Normale Supérieure from\n1947\nto\n1950\n. Most students from the École Normale Supérieure went on to become school teachers but Lions, and his friend and fellow student\nBernard Malgrange\n, decided that they wanted to become university teachers. Spending\n1950\n-\n51\nat the École Normale Supérieure, Lions was awarded a grant from the National Centre for Scientific Research to enable him to undertake doctoral studies which he did at the University of Nancy under the supervision of\nLaurent Schwartz\n.\nIn becoming a student of\nSchwartz\n, Lions was being supervised by an outstanding mathematician who had the previous year won a Fields medal.\nSchwartz\nhad received the medal at the International Congress of Mathematicians in Harvard on\n30\nAugust\n1950\nfor his work on the theory of distributions.\nSchwartz\nhad made a big breakthrough in the understanding of partial differential equations which he saw should be completely recast in the context of distribution theory. Lions was one of several students who\nSchwartz\ndirected to take this new approach and his doctoral thesis developed what has become the standard variational theory of linear elliptic and evolution equations. Lions received his Docteur ès sciences in\n1954\nand he was appointed Maître de Conférences at Nancy. Later he became Professor in the Faculty of Science there, remaining until\n1963\n. During the years\n1954\nto\n1957\nLions held a number of visiting appointments in the United States, India and Japan.\nIt is an impossible task to indicate all the areas in which Lions worked, his output was so enormous;\nMathematical Reviews\nlists\n529\npapers and books under his name. We make this point before we say anything about the mathematics he studied since as soon as we mention topics he studied the reader should be aware that Lions would be studying many other problems which we are not mentioning at the same time. This said, let us remark that Lions was very fond of collaborating with other mathematicians and during his time at Nancy he was collaborating with several Italian mathematicians. In one of these collaborations with\nEnrico Magenes\n, they were investigating inhomogeneous boundary problems for elliptic equations and inhomogeneous initial-boundary value problems for parabolic and hyperbolic evolution equations. The work which Lions did in this area, both by himself and in collaboration with\nMagenes\n, was included in their three volume treatise\nProblèmes aux limites non homogènes et applications\nⓉ\n(\nProblems with inhomogeneous boundary and applications\n)\n. Volumes\n1\nand\n2\nwere published in\n1968\nwith the third volume appearing in\n1970\n:-\n... the results are deep and penetrating and the exposition is masterful. It is a work to be recommended to every serious student of partial differential equations and particularly to those who are fascinated by the manner in which modern\nfunctional analysis\nhas aided and influenced their study.\nAs was typical in France at this time, university professors began their careers in the provinces and if they were successful enough could be promoted to a chair in Paris. Lions followed this pattern when he was appointed Professor in the Faculty of Science of the University of Paris in\n1963\n. He had been quick to see the impact that computers would have on mathematics and among many problems he had considered while in Nancy were applications of numerical methods to scientific problems. In Paris he began a weekly numerical analysis seminar series and, later, he set up a numerical analysis laboratory. Although at this stage Lions did not publish on the topic, the lecture notes from graduate courses he gave on numerical analysis began to circulate and be used to set up numerical analysis courses in other institutions. In\n1966\n, in addition to his post in the Faculty of Science, Lions became a part-time professor at the École Polytechnique; an appointment he held until\n1986\n.\nFrance passed the Orientation Act in\n1968\nreforming higher education. In particular the University of Paris was to be split into thirteen separate universities from\n1970\n. Lions chose to work in Paris VI, the university which was later named Université Pierre et Marie Curie. In\n1973\n, at a very young age, he was elected to the\nAcadémie des Sciences\n. In the same year he became Professor in the Collège de France when he was named to the chair of Analyse Mathématique des Systèmes et de leur contrôle. Roger Teman in\n[\n2\n]\nexplains what Lions had in mind when he chose this title for his chair:-\nThe systems he had in mind are those described by linear and nonlinear partial differential equations. Analysis meant here everything from the most abstract existence theorems to approximation and numerical issues and computer implementations; control would come later.\nHe had already published a major work on control of systems\nContrôle optimal de systèmes gouvernés par des équations aux dérivées partielles\nⓉ\n(\nOptimal control of systems governed by partial differential equations\n)\nin\n1968\nwhich investigates deterministic optimisation problems involving partial differential equations. One notable feature of this work is that Lions introduces an infinite dimensional version of the\nRiccati\nequation in it.\nLet us describe one or two more major treatises by Lions. He published\nQuelques méthodes de résolution des problèmes aux limites non linéaires\nⓉ\n(\nSome methods of solving problems for nonlinear boundary conditions\n)\nin\n1969\n.\nL Cesari\n, reviewing this important work, writes that Lions:-\n... reports on methods of solving nonlinear boundary value problems for partial differential equations, on a theoretical and functional analysis basis. The vast material is organized into four chapters, according to methods. In all cases the methods are shown to yield existence theorems.\n(1)\nMethods based on compactness. By this we mean that approximate solutions are constructed by a reduction of the problem to a finite-dimensional one, and these are then shown to form a relatively compact family in a suitable topology, by means of a priori estimates and other evaluations. ...\n(2)\nMethods based on monotonicity. The same scheme as above, except that the passage to the limit is facilitated by monotonicity properties of the operators under consideration ...\n(3)\nMethods of regularization, viscosity methods and penalty methods. These comprise methods in which the approximate solutions are regularized, or smoothed, before the passage to the limit is performed\n(4)\nMethods of successive approximation,\nNewton\n's method, discretisation, decomposition methods. Here a number of approaches are discussed, some rather classical, some which have become familiar since the advent of electronic computers ...\nPerhaps the most outstanding contribution by Lions was the vast treatise\nMathematical analysis and numerical methods for science and technology\nwhich he wrote with Robert Dautray. This work is in nine volumes published in\n1984\nand\n1985\nand contains about\n4000\npages. It really assembled into a consistent whole all his previous work, but also included many generalisations which went well beyond the original works. Here is what each of the five volumes covers:\nVol.\n1\n. Physical origins and classical methods.\nVol.\n2\n. Functional and variational methods.\nVol.\n3\n. Spectral theory and applications.\nVol.\n4\n. Integral equations and numerical methods.\nVol.\n5\n. The operator spectrum.\nVol.\n6\n. Integral and numerical methods.\nVol.\n7\n. Evolution:\nFourier\n,\nLaplace\n.\nVol.\n8\n. Evolution: semigroups, variational methods.\nVol.\n9\n. Evolution: numerical methods, transport.\nWith this incredible output of work it is hard to believe that Lions would have time for anything else. However, he managed to find time to make many other contributions outside his mathematical research. He was President of many organisations: Institut National de Recherche en Informatique et en Automatique\n(1980\n-\n1984)\n; Centre National d'Études Spatiales\n(1984\n-\n19920\n; Conseil Scientifique d'Électricité de France\n(1986\n-\n1992)\n; Comité Scientifique de la Météorologie Nationale\n(1990\n-\n2001)\n;\nInternational Mathematical Union\n(1991\n-\n1995)\n;\nAcadémie des Sciences\n(1996\n-\n1998)\n; and Conseil Scientifique de France Telecom\n(1998\n-\n2001)\n.\nIn his capacity as President of the\nInternational Mathematical Union\nhe proposed that the year\n2000\nbecome World Mathematical Year. This led to many events world-wide which enhanced the image of mathematics with the general public.\nPerhaps we should say more about his work as President of the\nAcadémie des Sciences\n. In this role he was required in\n1997\nby the French President, Jacques Chirac, to produce a document detailing the world-wide state of the art in each of the following areas and make proposals\n[\n1\n]\n:-\n... access to knowledge for all and electronic processing of information; knowledge of our planet and ways of life; and understanding life systems and improving health care of all.\nGiven this unbelievably wide remit, Lions set up Committee\n2000\nwith himself as chairman, setting himself the target of completing the task by the year\n2000\n. He succeeded, and the report was handed personally by Lions to President Chirac on\n25\nJanuary\n2000\nin a ceremony at the Elysée Palace.\nWe have mentioned a few honours that Lions received. We should mention a few more, although again space makes it impossible to give the full list. He was an invited lecturer at the International Congress of Mathematicians in\n1958\n,\n1970\n, and\n1974\n. Among the prizes he won are the\nJohn Von Neumann\nPrize in\n1986\n, the Prize of Japan in\n1991\n, the Harvey Prize from Technion in\n1991\n, the Daedalon Gold Medal for Science and Technology from Greece in\n1991\n, and W T et Idalia Reid Prize from the\nSociety for Industrial and Applied Mathematics\nin\n1998\n. He was elected an honorary member of over twenty learned societies and academies world-wide. He received honorary degrees from nineteen universities world-wide. He received the following distinctions: Commandeur de la Légion d'Honneur\n(1993)\n; Grand Officier dans l'Ordre National du Mérite\n(1998)\n; Ordre du Soleil Levant, étoile d'Or et d'Argent\n(1998)\n.\nLet us record some of the tributes made to him after his death.\nRoger Teman writes\n[\n2\n]\n:-\nJacques-Louis Lions was a scientist of remarkable prescience and immense energy. His vision extended to the development of entire areas of mathematical science. He understood that mathematics can make a great contribution to science, and he worked to see this goal realised.\nPeter D Lax\nwrites\n[\n2\n]\n:-\nLions had an open, friendly, generous personality, with a light touch and a subtle sense of humour.\nEnrico Magenes writes\n[\n2\n]\n:-\n... I had the opportunity to fully appreciate the intellectual and human qualities of Lions: his unaffected manners; his commitment and energy in work; his rapidity of intuition and decision; his openness to new ideas and new problems in a body of knowledge that increased more and more over time, even outside mathematics; his love of freedom; and his respect for the opinions of others.\nJohn Ball said\n(\nsee\n[\n1\n]\n)\n:-\nJacques-Louis Lions was a man of considerable personal magnetism and charm, whose charisma, brilliance as a teacher, and accessibility attracted other to work with him.\nPierre Bernhard writes:-\n... to his co-workers and friends, he will be much more remembered as a man of great vision and wisdom, always available when you would need his advice, with a solid sense of humour even in serious situations and a great care for individuals. He was such a nice personality that his charm would operate on everybody around him, from clerks to angered union leaders, who would feel that they had really been listened to and taken seriously. This man, who accomplished more in any time span than several of us together, never seemed to be in a hurry. ...\nSeldom has a single man displayed so many abilities and gifts, seldom will a scientist be so much missed by his colleagues and friends.\nIn\n2003\nthree volumes of 'Selected works of Jacques-Louis Lions' were published. The first volume covered his work on Partial differential equations and Interpolation, the second volume contained Control and Homogenization, and the third volume Numerical analysis, Scientific computation and Applications. All three volumes contain a Preface which gives a good overview of his contributions. We quote from the Preface to the third volume:-\nStarting in\n1990\n, Lions expressed interest in a major application, climatology. The models used in that field consist of complex sets of partial differential equations, including the Navier-Stokes equations and the equations of thermodynamics. ... In spite of what Lions himself liked to call the 'truly diabolical' complexity of the set of partial differential equations, boundary conditions, transmission conditions, nonlinearities, physical hypotheses, etc., that appeared in those models, Lions, in collaboration with Roger Temam and Shou Hong Wang, was able to study the questions of the existence and uniqueness of solutions, to establish the existence of attractors, and to do a numerical analysis of these models. He was even able to teach this material in the classroom, which was quite a pedagogical challenge! In a series of works begun with Évariste Sanchez-Palencia in\n1995\n, he also developed the theory of 'sensitive problems', particularly as they arise in the theory of elastic shells. ...\nThe variety of topics that Lions tackled in the above works is very impressive. In a long series of notes published in the Comptes Rendus until\n2001\n, Lions returned to numerical analysis, and in particular to parallel computation and domain decomposition methods. These subjects had long interested him ... Always in search of new subjects, Lions even pursued the study of a problem of dislocation in crystallography, a problem that no one really knew how to tackle. And, amazingly enough, he was the first person to establish\n(\nin\n2000)\na result of existence and uniqueness of the solution of this type of problem. Finally, with Vivette Girault, he worked until January\n2001\non perfecting a finite element method using two meshes, one 'rough' and one 'fine', for the numerical simulation of the Navier-Stokes equations. The inventiveness and mathematical richness of the article that resulted from that collaboration are remarkable.\nOne cannot help being struck by the quality, diversity and novelty of the mathematics used in this immense body of work, and by Lions's ability to decipher among the applications some vast areas that had been thought to be inaccessible. Like\nJohn von Neumann\n, for whom he expressed profound admiration, Jacques-Louis Lions was a visionary who understood very quickly that the use of increasingly powerful computing tools could revolutionize the modelling of phenomena and improve our knowledge and mastery of the physical world as long as the corresponding mathematics was created and developed. This was the task to which he devoted himself so admirably.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}