{
  "nome_completo": "Jacques Feldbau",
  "nome_curto": "Jacques Feldbau",
  "ano_nascimento": "1914",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Feldbau/",
  "lugar_nascimento": "Straßburg, Germany (now Strasbourg, France)",
  "lugar_morte": "Ganacker, Bavaria, Germany",
  "biografia": "Jacques Feldbau\nwas born into a Jewish family living in Alsace which, at the time he was born, was part of Germany. His father was Hermann\n(\nor Armand\n)\nFeldbau whose family originated in Poland. Some of his ancestors were rabbis in Kraków. In the late\n19\nth\ncentury the family left Poland, going first to Munich before settling in Strasbourg which at that time was part of Germany.\n(\nThe city had been annexed by Germany in the Franco-Prussian war of\n1870\n-\n71)\n. Armand Feldbau was a wholesale distributor of butter, eggs and cheese having a business in the Rue Hannong, Strasbourg.\nLa Tribune juive\n(\nStrasbourg\n)\nrefers to him as a \"highly respected member of the Orthodox community Ets-Haim\".\nJacques' mother was Dorothée\n(\nor Dora\n)\nGittler and the family home was\n16\nRue du\n22\nNovembre, just round the corner from where Armand had his business. This house, along with others on that side of the road, had been built around\n1912\nwhen it was a new residential area. The road had been named \"Neue Strasse\" from\n1912\nto\n1918\nand renamed \"Rue du\n22\nNovembre\" after Strasbourg returned to France following World War I. Jacques had a sister Jeannette, who had been born on\n30\nAugust\n1916\n. Jacques and Janette were very close as they were growing up. Let us note that, although Jacques Feldbau is considered to be a French mathematician, in fact the family were German speaking and German was Jacques' first language. This is not surprising since at this time the majority of the families in Strasbourg were German speaking.\nThe family moved from Rue du\n22\nNovembre to\n8\nRue des Pontonniers as Jacques was growing up and this reflects the fact that they were well-off and living a comfortable life. This Strasbourg address would remain Feldbau's home address for the rest of his life. On\n1\nOctober\n1920\nFeldbau began his primary school education in the\nGymnasium\nFustel de Coulanges. At this time girls were only educated for the first few classes, and his sister Janette attended the same school from October\n1922\nto July\n1924\n. Feldbau remained at this school until\n10\nJuly\n1925\n. He had been an excellent pupil although, probably because he was bored with the elementary material he was taught, he was somewhat restless. Feldbau was eleven years old in\n1925\nand he spent the school year\n1925\n-\n26\nat the rabbinical school in Paris. On\n1\nOctober\n1926\n, having returned to Strasbourg, he re-entered the Gymnasium Fustel de Coulanges for his secondary education.\nFeldbau was awarded his Premier Baccalauréat on completing Class\n1\ne and in the following year\nLa Tribune juive\nnotes on\n22\nJuly\n1932\nthat Jacques Feldbau passed the baccalaureates in mathematics and philosophy. He then spent the two years\n1932\n-\n33\nand\n1933\n-\n34\nat the Gymnasiums Kleber preparing to take the entrance examinations in mathematics for the École Polytechnique and the École Normale Supérieure. He was taught in the Mathématiques\n(\nspéciales\n)\npréparatoires class by a teacher M Roy and in the Mathématiques spéciales class by M Picardat. However, he was not considered for entry to the École Normale supérieure since one of the entrance examinations was on a Saturday and he refused to take this because of his Jewish faith. As a consequence, he enrolled at the University of Strasbourg in the autumn of\n1934\n.\nIn his first year at university, he attended courses on differential and integral calculus given by\nHenri Cartan\nand on mechanics given by René Thiry. He performed well in the examinations in June\n1935\nand continued to his second year of study taking courses on general physics and on higher analysis. This analysis course was given, at least in part, by\nAndré Weil\n. In\n1936\n-\n37\nhe continued to study for the\nAgrégation\n, the examination which was required to qualify as a secondary school teacher. It appears that he did not satisfy the examiners for his oral and so he went to the École Normale supérieure where he spent the academic year\n1937\n-\n38\nas a guest student. Only the best students not studying at the École Normale supérieure were invited to spend a year there as guests in order to get the best level of instruction to sit the Agrégation. There were four examinations, elementary mathematics, special mathematics, differential and integral calculus, and rational mechanics. Feldbau took the first of these on\n30\nMay\n1938\nand, being one of the\n51\nbest students, he continued to take two further written papers on descriptive geometry and calculating, and two oral examinations, one on elementary mathematics and the other on special mathematics. Of the\n51\nstudents who were allowed forward to take these examinations, Feldbau was ranked eighth.\nLa Tribune Juive\nnotes on\n12\nAugust\n1938\nthat it has pleasure in announcing that Jacques Feldbau of Strasbourg has successfully passed the Agrégation in mathematics. The report states that he was ranked seventh in the written tests but had to miss an oral examination which was held on Saturday.\nFeldbau had been particularly inspired to undertake research in topology because of the course he attended given by\nAndré Weil\n. After the award of his\nagrégation\nhe returned to Strasbourg to begin work on his doctoral dissertation. He asked\nWeil\nabout possible topics for his dissertation and\nWeil\nsuggested that Feldbau speak to\nCharles Ehresmann\nwho had just been appointed as a lecturer at Strasbourg.\nPerhaps before we continue to relate the events which followed the outbreak of World War II, we should look briefly at Feldbau's character and interests. One of his friends, Georges Cerf, said that Feldbau was\n(\nsee\n[\n2\n]\n)\n:-\n... a tall, well-built young man, who enthusiastically took part in all sports, was enraptured by music and, thanks to his sincerity and his goodness and his cheerful character, only had friends.\nHe was an excellent pianist, and the large range of sports he was involved in\n(\nat surprisingly high levels\n)\nincluded swimming, football, skiing and cycling.\nAs Feldbau began his postgraduate studies, life in Strasbourg was not easy for Jews. Many German Jews had fled there to escape the Nazi anti-Semitic policies and the local people accused the Jewish inhabitants of encouraging a war against Germany. By the time that Feldbau began research in the autumn of\n1938\nthe situation had become nasty. An incident that took place in November\n1938\nis related in\n[\n2\n]\n. The \"Maison Kammerzell\" put up a sign which read, \"Dogs and Jews are forbidden\". Feldbau tore the sign down and a scuffle with some guests at the Maison resulted. Feldbau and some fellow students were then approached by the police and arrested. Around this time the same group of students were involved in an incident with a pro-Nazi bookshop, but it is uncertain whether Feldbau was one of the students who damaged the store. However, on the mathematical side Feldbau's work was progressing well and he wrote the paper\nSur la classification des espaces fibrés\nⓉ\n(\nOn the classification of fiber spaces\n)\nwhich was published by the\nAcademy of Sciences\nin\n1939\n. This paper, read in May\n1939\n, introduced the important notion of a fibre bundle for the first time. It contains an important theorem, namely the classification of fibre bundles over spheres.\nNot only was Feldbau's mathematics progressing well, but so were his sporting activities. In July\n1939\nhe became the French university champion at the\n200\nmetres butterfly in the Tourelles swimming pool in Paris. In August\n1939\n, Russia and Germany signed a secret pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged German attack on Poland began on\n1\nSeptember\n1939\nand, on the following day, Britain, France and several other countries, declared war on Germany. Over the following months France was not involved in any fighting, but spent time strengthening the Maginot line, designed to protect the country from an invasion by Germany. Feldbau had already completed military training as an officer cadet earlier in\n1939\n, this having been postponed earlier when he was a guest student at the ENS. With the outbreak of war, France mobilised and Feldbau was posted to the airbase at Tours where he had already undertaken training. He was based at the Châteauroux officers' school from October\n1939\nand, in early\n1940\n, he was involved in the fighting, flying around\n20\nmissions against the advancing Germans. He did not find this easy, however, saying later:-\nYou do not know how terrible it is when you get the order to bomb.\nThe war had changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders. Five days later German forces crossed into France and quickly headed for the coast. German forces entered Paris on\n14\nJune and a couple of days later France requested armistice terms but fighting continued. The armistice was signed on\n22\nJune and within a couple of days all hostilities in France had ended. Feldbau was demobilized and became a high school teacher in Châteauroux, a small town in central France, taking up this position in the autumn of\n1940\n.\nThe armistice had divided France into two regions, one under German military occupation and the other, known as Vichy France, nominally under French control but with a government which cooperated with the Germans. Châteauroux, where Feldbau became a teacher, was in Vichy France. However, on\n3\nOctober\n1940\nthe Vichy government passed anti-Semitic laws dismissing Jewish teachers. On\n21\nNovember Feldbau was still in Châteauroux when he wrote to\nGeorges de Rham\n(\nsee for example\n[\n2\n]\n)\n:-\nI have the reprints that you had the kindness to send me, they arrived safe and sound and I am very grateful to you.\nThese are more useful to me since almost all my books have remained in Strasbourg and must be considered as lost.\nMM\nEhresmann\nand\nA Weil\nare at present in Clermont-Ferrand\n(\nPuy de Dôme\n)\n. M\nEhresmann\nis a professor at the Faculty of Science, while M\nWeil\nis waiting to depart to America.\nI am mainly interested in topological questions\n(\nfibrations, absolute parallelism on spheres, homotopy of the orthogonal group, etc.\n)\nand would be happy to stay in contact with the Swiss school, which is interested in the same questions.\nAlthough he was in Châteauroux, Feldbau must have kept in contact with his Strasbourg colleagues since he clearly knew exactly what was happening. Clermont-Ferrand is where the University of Strasbourg moved in September\n1939\nbefore the German armies invaded France so by the time Feldbau is writing this the University of Strasbourg had been located there for over a year. In December\n1940\n, dismissed from his teaching position in Châteauroux, Feldbau arrived in Clermont-Ferrand. His family joined him there in April\n1941\n.\nLaurent Schwartz\nwrites\n[\n4\n]\n:-\nThere were only three graduate students for the whole illustrious faculty of Clermont-Strasbourg: Jacques Feldbau, a student of\nEhresmann\n, Gorny, a Polish refugee in France and a student of\nMandelbrojt\n, both brilliant, and myself. We could hardly imagine a better pedagogical situation. Feldbau had been an auditor at the ENS - he had not succeeded in entering the ENS because, as a practising Jew, he had refused to pass one of the exams on a Saturday. He had passed his agrégation in\n1938\nand, like me, he had arrived in Clermont in\n1940\n. He taught me a lot of\nalgebraic topology\nand we became very friendly. I had studied algebraic topology in a brochure on homology written by\nEhresmann\n, and Feldbau taught me\ncohomology\n, invented by\nKolmogorov\n.\nDuring the sessions\n1941\n-\n42\nand\n1942\n-\n43\nFeldbau was enrolled as a doctoral student in mathematics. He worked mainly with\nEhresmann\nbut also with\nAndré Weil\nfor a month before he left for America in January\n1941\n. Despite the extraordinary difficulties imposed by the war, mathematics flourished in Clermont-Ferrand during these years. To earn money to live Feldbau gave private mathematics lessons but he also learned Russian, played the piano, learned the profession of a metal lathe operator, and made new friends with whom he often went for long bicycle rides in the mountains. However, he also took an active role in the French Resistance. He joined the French underground movement as part of the Organisation of Jewish Combat Fighters; he joined the underground French Fighters and Partisans; and was a member of La Sixieme\n(\nthe Sixth\n)\n.\nIn collaboration with his thesis advisor\nEhresmann\n, Feldbau published the joint paper\nSur les propriétés d'homotopie des espaces fibrés\nⓉ\n(\nOn the homotopy properties of fibre spaces\n)\nin\n1941\n. After this, in order to protect his Jewish identity, Feldbau published his mathematics under the pseudonym Jacques Laboureur. Two papers published under this name are:\nLes structures fibrées sur la sphère et le problème du parallélisme\nⓉ\n(\nFibred structures on the sphere and the problem of parallelism\n)\n(1942)\nand\nPropriétés topologiques du groupe des automorphismes de la sphère S\nn\nⓉ\n(\nTopological properties of the automorphism group of the sphere S\nn\n)\n(1943)\n. Both were published in the\nBulletin\nof the\nFrench Mathematical Society\n. By June\n1943\nhe had completed research for his doctoral thesis and intended to write it up over the summer and defend his thesis before the end of the year. A friend wrote about him around this time:-\nEverything was effortless for him. He spoke several languages, he was a man of great intelligence and humanity. He also had a tremendous amount of humour.\nHowever, the situation in Clermont-Ferrand had changed since German troops had occupied the town in November\n1942\n. On\n24\nJune\n1943\ntwo Gestapo agents were shot in Clermont-Ferrand and reprisals were expected. Feldbau decided to go underground and left the student accommodation where he was living. However, on the morning of\n25\nJune he returned to his room to pick up manuscripts which formed part of his thesis. German soldiers and Gestapo agents had raided the building during the night and were interrogating the students when Feldbau arrived. He was arrested immediately.\nTaken to the La Malcoiffée prison in Moulins, Feldbau gave lessons in astronomy, mathematical games and topology to fellow prisoners. From there he was taken to the concentration camp at Drancy near Paris, a standard holding place for French Jews who were being sent to the extermination camps in Poland. On\n7\nOctober\n1943\nhe was taken in a cattle truck, with over a thousand other prisoners, to the Auschwitz concentration camp in Poland. They arrived at the camp on\n10\nOctober and about half were immediately taken to the gas chambers. Feldbau was put to work as the secretary in the surgical block of the infirmary. He continued to give mathematics and physics lessons to the other prisoners. To take their minds off the terrible situation they were in, a number of mathematicians in the camp, led by Feldbau, set and solved mathematical problems each day.\nOn\n18\nJanuary\n1945\nthe Russian army was approaching Auschwitz and the Germans decided to evacuate it. The prisoners, who were extremely malnourished and poorly clothed, were marched through snow in extreme cold for long distances. Feldbau is said to have discussed\nFermat\n's Last Theorem with a fellow mathematician as they marched. Many died of exhaustion and those who could not keep up were shot. After three days they were put into open rail trucks and taken to Flossenburg, where those who survived arrived on\n30\nJanuary. They remained there for several weeks and then they were taken to the Ganacker concentration camp. By this time Feldbau was very weak and he died of exhaustion in the concentration camp on\n22\nApril\n1945\n, two days before the liberation of the camp and fifteen days before the war ended.\nSome results which were to form part of his thesis had not been published before he died. The\n17\n-page paper\nSur la loi de composition entre éléments des groupes d'homotopie\nⓉ\n(\nOn the law of composition between elements of homotopy groups\n)\ncontaining these results was published in\n1958\n. For a discussion of this paper and the other papers that Feldbau wrote, see\n[\n6\n]\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}