{
  "nome_completo": "Jakob Rosanes",
  "nome_curto": "Jakob Rosanes",
  "ano_nascimento": "1842",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rosanes/",
  "lugar_nascimento": "Brody, Austria-Hungary (now Ukraine)",
  "lugar_morte": "Breslau, Germany (now Wrocław, Poland)",
  "biografia": "Jakob Rosanes\nwas a Galician-born Jew from an old Sephardic family. His maternal grandfather was Akiva Eger, an outstanding Talmudic scholar who, for the last twenty years of his life, was the rabbi of the city of Posen. Let us note at this stage that Posen is the German name for the city, at that time under Prussian control, which today is known by its Polish name of Poznań. Akiva Eger's second marriage was to Brendel HaLevy Feibelman, the eleventh of their children being Beile Eger who was Jakob Rosanes's mother. Jacob's father was Leo Meir Rosanes who had married Hadassah Eger, another of the children of Akiva Eger. However after Hadassah's death in Brody some time before\n1837\n, Leo Meir Rosanes married her sister Beile Eger who had been born in Posen in\n1822\n. Leo Rosanes, Jakob's father, was a merchant in Brody which was becoming increasingly important as a trade centre because of its location which made it a transit point for goods moving between the Austrian and Russian empires.\nJakob's education was not quite what one would have expected of someone who would go on to an academic career. This, basically, was because his parents did not envisage this future for their son, expecting him to follow his father's career. He attended the high school in Brody, then, in\n1858\nwhen he was sixteen years old, he went to Breslau where he became a clerk in a Mercantile house. Rosanes, however, wanted to attend university and between\n1858\nand\n1860\nhe prepared himself to enter the University of Breslau. At first it was not mathematics that attracted him; rather his initial choice was to study chemistry which he did between\n1860\nand\n1862\n. In this latter year he began to concentrate on mathematics and physics and, advised by\nHeinrich Schroeter\n, he undertook research and submitted his dissertation\nDe polarium reciprocarum theoria observationes\nⓉ\n(\nThe theory of reciprocal Polar observations\n)\nto the University of Breslau and was awarded his Ph.D. in\n1865\n. In addition to\nSchroeter\n, Rosanes had been taught by some excellent lecturers at Breslau such as\nFerdinand Joachimsthal\n,\nRudolf Lipschitz\n, O E Meyer, and\nPaul Bachmann\n. He formed a close friendship with his fellow student\nMoritz Pasch\n, who also had\nHeinrich Schroeter\nas a thesis advisor and was awarded his doctorate in the same year as Rosanes. Burau writes\n[\n1\n]\n:-\nRosanes' mathematical papers concerned the various questions of\nalgebraic geometry\nand\ninvariant theory\nthat were current in the nineteenth century. One of his first papers, written with\nMoritz Pasch\n, discussed a problem on conics in closure-position.\nFollowing the award of his doctorate, Rosanes went to Berlin to continue his studies. He returned to Breslau where he submitted his\nHabilitation\nthesis and became a\nPrivatdozent\nin\n1870\n. Burau writes\n[\n1\n]\n:-\nIn\n1870\nhe provided a demonstration that each plane\nCremona\ntransformation can be factored as a product of quadratic transformations, a theorem that\nMax Noether\nalso proved independently at about the same time.\nIn fact there were gaps in both Rosanes' and\nMax Noether\n's proofs, and these were not filled until the first years of the\n20\nth\ncentury by\nGuido Castelnuovo\n.\nRosanes taught at Breslau for the rest of his life. He became an extraordinary professor in\n1873\n, a full professor in\n1876\n, and was given the title 'Geheime Regierungsrat' in\n1897\n. He was elected rector of the university during the years\n1903\n-\n4\n. He married Emilie Rawitscher in\n1876\n, the year in which he became a full professor.\nRosanes wrote on many aspects of algebraic geometry and invariant theory\n(\nparticularly between\n1870\nand\n1890)\nwhich were in fashion at that time. His papers include the joint paper with\nPasch\nwe mentioned above\nDas einem Kegelschnitt Umschriebene und einem Andern Eingeschriebene Polygon\nⓉ\n(\nThe  circumscribed and inscribed polygons of a conic\n)\nwhich was published in\nCrelle\n's\nJournal\nin\n1865\n. We also mention\nÜber Dreiecke in Perspectiver Lage\nⓉ\n(\nOn triangles in perspective position\n)\n(1870)\n;\nÜber Systeme von Kegelschnitten\nⓉ\n(\nOn systems of conics\n)\n(1873)\n;\nÜber Ein Princip der Zuordnung Algebraischer Formen\nⓉ\n(\nOn a principle of allocation algebraic forms\n)\n(1873)\n;\nÜber linear-abhängige Punktsysteme\nⓉ\n(\nOn linearly dependent point systems\n)\n(1879)\n; and\n(\nwith\nFerdinand Rudio\n)\nZur Theorie der Flächen deren Krümmungsmittelpunktsflächen confocale Flächen zweiten Grades sind\nⓉ\n(\nOn the theory of surfaces whose centre of curvature surfaces are confocal surfaces of the second degree\n)\n(1883)\n. Let us mention a particularly important result, namely giving conditions for a form to be expressed as a power-sum of other forms. He also wrote a series of papers on linearly dependent point systems in a plane and in space. However, his research activity diminished as he grew older and he produced little of importance in the later part of his career.\nMax Born\nattended Rosanes' course on linear algebra, which introduced him to matrix theory, in the first years of the\n20\nth\ncentury. He later said these lectures were particularly important in his development as a mathematician and led him to one of his greatest ideas namely the realisation that\nHeisenberg\n's quantum mechanics was represented by matrices. Not everyone was an enthusiastic as\nBorn\n, however, for Rosanes had a mixed reputation as a lecturer. He was considered a good teacher but seemed to lack some basic skills in lecturing techniques.\nRichard Courant\n, for example, described Rosanes' lecturing as follows:-\n... he scribbled equations which his students never quite saw because as he wrote he hid them with his body and as he moved along he rubbed them out with his sponge.\nRosanes' rectorial address, however, everyone agreed was inspirational. In this address he said that the estrangement of mathematics and physics, which had been going on for several decades, was past and an epoch of closer union had begun. The address was published in\n1904\n. He also acted as thesis advisor to a number of outstanding students including\nErnst Steinitz\n, who was awarded his doctorate in\n1894\n, and\nOtto Toeplitz\n, who was awarded his doctorate in\n1905\n.\nPerhaps Rosanes' main interest outside mathematics was chess. He was able to beat even one of the leading players of his time Adolf Anderssen which he did in Breslau in\n1862\n(\nalthough he lost to him in the following year\n)\n. He wrote an excellent chess book\nTheorie und Praxis des Schachspiels\n. He retired in\n1911\nbut continued to live in Breslau for the rest of his life.",
  "math_areas": [
    "Geometry"
  ]
}