{
  "nome_completo": "Jakob Steiner",
  "nome_curto": "Jakob Steiner",
  "ano_nascimento": "1796",
  "ano_morte": "1863",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steiner/",
  "lugar_nascimento": "Utzenstorf, Switzerland",
  "lugar_morte": "Bern, Switzerland",
  "biografia": "Jakob Steiner\n's parents were Anna Barbara Weber\n(1757\n-\n1832)\nand Niklaus Steiner\n(1752\n-\n1826)\n. Anna and Niklaus were married on\n28\nJanuary\n1780\nand they had eight children. Jakob was the youngest of the children and spent his early years helping his parents with the small farm and business that they ran near the village of Utzenstorf, about\n24\nkm north of Bern. He did not learn to read and write until he was\n14\nbut he then proved invaluable\n[\n1\n]\n:-\nAs a child he had to help his parents on the farm and in their business: his skill in calculation was of great assistance.\nJakob, however, wanted something better for himself but his parents were delighted to have his help with their business. At the age of\n18\n, against the wishes of his parents, he left home to attend Johann Heinrich Pestalozzi's school at Yverdon at the south-east end of the Lake of Neuchâtel. Pestalozzi ran his innovative school in the town from\n1805\nto\n1825\nand Steiner entered in the spring of\n1814\n. The fact that Steiner was unable to pay anything towards his education at the school was not a problem, for Pestalozzi wanted to try out his educational methods on the poor. Pestalozzi's school had a very significant effect on Steiner's attitude both to the teaching of mathematics and also to his philosophy when undertaking research in mathematics. He wrote in\n1826\n(\nsee for example\n[\n1\n]\n)\n:-\nThe method used in Pestalozzi's school, treating the truths of mathematics as objects of independent reflection, led me, as a student there, to seek other grounds for the theorems presented in the courses than those provided by my teachers. Where possible I looked for deeper bases, and I succeeded so often that my teachers preferred my proofs to their own. As a result, after I had been there for a year and a half, it was thought that I could give instruction in mathematics. ... Without my knowledge or wishing it, continuous concern with teaching has intensified by striving after scientific unity and coherence. Just as related theorems in a single branch of mathematics grow out of one another in distinct classes, so, I believed, do the branches of mathematics itself. I glimpsed the idea of the organic unity of all the objects of mathematics; and I believed at that time that I could find this unity in some university; if not as an independent subject, at least in the form of specific suggestions.\nIn the autumn of\n1818\n, Steiner left Yverdom and travelled to Heidelberg where he earned his living giving private mathematics lessons. He attended lectures at the Universities of Heidelberg on combinatorial analysis, differential and integral calculus and algebra. Also at this time he became interested in mechanics and he wrote three unpublished manuscripts on the topic in\n1821\n,\n1824\nand\n1825\n. At Easter\n1821\nhe left Heidelberg and travelled to Berlin, where again he supported himself with a very modest income from tutoring. He had no formal teaching qualifications so he decided that he needed to sit the necessary examinations to allow him to become a mathematics master in a\ngymnasium\n. He was not completely successful for after taking the necessary examinations in Berlin he was only awarded a restricted license to teach. His problem was not in mathematics but in the other subjects which were examined such as history and literature. This restricted license was, however, sufficient to allow him to be appointed to the Werder Gymnasium in Berlin.\nSteiner's time as a mathematics teacher at the Werder Gymnasium proved a difficult one. At first he received good reports on his teaching but he fell out with the director of the school, Dr Zimmermann. Perhaps, understandably, Zimmermann wanted Steiner to teach his courses using a textbook written by Zimmermann himself. Steiner, who was a firm believer in Pestalozzi's methods of teaching, used those methods in the classroom. Zimmermann claimed that these were only suitable for elementary courses, and Steiner was dismissed in the autumn of\n1822\n. The official reason was that his teaching was receiving criticism but the real reason was clearly his desire to use the methods he thought best rather than those required by the director, Dr Zimmermann. Again he took up private tutoring to earn enough money to allow him to attend courses at the University of Berlin, which he did from November\n1822\nto August\n1824\n.\nCarl Jacobi\n, although eight years younger than Steiner, was a student at the University of Berlin at this time and soon Steiner and\nJacobi\nbecame friends. In\n1825\nSteiner was appointed as an assistant master at the Technical School of Berlin.\nThe type of difficulties that Steiner had experienced at the Werder Gymnasium again arose at the Technical School. He was expected to follow the orders of the director, K F von Klöden, without question. Klöden, almost certainly correctly, believed that Steiner was not giving him the respect that he deserved. He retaliated in a severe manner, making unreasonable demands of Steiner that\n[\n1\n]\n:-\n... even a soldier subject to military discipline could hardly be expected to accept.\nDespite the bad atmosphere, Steiner managed to carry out some outstanding mathematical research while teaching at the Technical School. He was promoted to senior master in\n1829\n. We have already mentions that Steiner became friendly with Jacobi, but he also became friendly with other influential mathematicians in Berlin. Perhaps most important of these was\nAugust Crelle\nbut his friendship with\nNiels Abel\nafter he arrived in Berlin in\n1826\nwas also significant. Steiner became an early contributor to\nCrelle\n's Journal, the\nJournal für die reine und angewandte Mathematik\n, which was the first journal devoted entirely to mathematics founded. The first volume of the journal appeared in\n1826\nand contains Steiner's first long work,\nEinige geometrische Betrachtungen\nⓉ\n(\nSome geometric considerations\n)\n. This paper is important as being the first published systematic account of the theory of the power of a point with respect to a circle, and the points of similitude of circles. It is also important for Steiner's use of the principle of inversion in many of the proofs. This paper was the first of\n62\npapers which Steiner published in\nCrelle\n's Journal. In his paper Several laws governing the division of planes and space, which also appeared in the first volume of\nCrelle\n's Journal, he considers the problem: What is the maximum number of parts into which a space can be divided by\nn\nn\nn\nplanes? It is a beautiful problem and has the solution\n(\nn\n3\n+\n5\nn\n+\n6\n)\n/\n6\n(n^{3} + 5n + 6)/6\n(\nn\n3\n+\n5\nn\n+\n6\n)\n/\n6\n. See\n[\n3\n]\nfor a solution.\nIn\n1832\nSteiner published his first book\nSystematische Entwicklung der Abhangigkeit geometrischer Gestalten voneinander\nⓉ\n(\nSystematic development of the dependence of geometric shapes on each other\n)\n. Much of the material had already appeared in Steiner's papers over the preceding six years. The Preface of this book gives an interesting view of Steiner's approach to mathematics in general and the geometric material of book in particular:-\nThe present work is an attempt to discover the organism through which the most varied spatial phenomena are linked with one another. There exist a limited number of very simple fundamental relationships that together constitute the schema by means of which the remaining theorems can be developed logically and without difficulty. Through the proper adoption of the few basic relations one becomes master of the entire field. Order replaces chaos: and one sees how all the parts mesh naturally, arrange themselves in the most beautiful order, and form well-defined groups. In this manner one obtains, simultaneously, the elements from which nature starts when, with the greatest possible economy and in the simplest way, it endows the figures with infinitely many properties. Here the main thing is neither the synthetic nor the analytic method, but the discovery of the mutual dependence of the figures and of the way in which their properties are carried over from the simple to the more complex ones. This connection and transition is the real source of all the remaining individual propositions of geometry. Properties of figures the very existence of which one previously had to be convinced through ingenious demonstrations and which, when found, stood as something marvellous, are now revealed as necessary consequences of the common properties of these newly discovered basic elements, and the former are established a priori by the latter.\nSoon Steiner was being honoured for his remarkable achievements. He was awarded an honorary doctorate by the University of Königsberg on\n20\nApril\n1833\non the recommendation of\nJacobi\n, then elected to the\nBerlin Academy of Sciences\non\n5\nJune\n1834\n. He was appointed to a new extraordinary professorship of geometry at the University of Berlin on\n8\nOctober\n1834\n. The post had been specially created for him by Alexander and Wilhelm von Humboldt; he held it until his death. He was in Rome in\n1844\nand on this visit he spent his time investigating a fourth order surface of the third class now called the 'Roman surface' or 'Steiner surface'. He spent the winter of\n1854\n-\n55\nin Paris and during his stay there was elected to the\nAcadémie des Sciences\n.\nHe was one of the greatest contributors to\nprojective geometry\n. He discovered the 'Steiner surface' which has a double infinity of\nconic sections\non it. The 'Steiner theorem' states that the two pencils by which a conic is projected from two of its points are projectively related. Another famous result is the '\nPoncelet\n-Steiner theorem' which shows that only one given circle and a straight edge are required for Euclidean constructions. This was basically the topic of his second book\nDie geometrischen Konstructionen ausgefuhrt mittelst der geraden Linie and eines festen Kreises\nⓉ\n(\nGeometric construction executed by means of the straight line and a circle\n)\n(1833)\n. The proof, essentially as given by Steiner, is reproduced in\n[\n3\n]\n. Many of his publications involved an investigation of conic sections and surfaces. For example he considered the problem: Of all ellipses that can be circumscribed about\n(\ninscribed in\n)\na given triangle, which one has the smallest\n(\nlargest\n)\narea? Today these ellipses are called the 'Steiner ellipses'.\nIn a short paper of fundamental importance written in\n1848\nentitled\nAllgemeine Eigenschaften algebraischer Curven\nⓉ\n(\nGeneral properties of algebraic curves\n)\nhe discussed polar curves of a point with respect to a given curve. He also introduced Steiner curves, discussed tangents at points of inflection, double tangents, cusps and double points. In particular he indicated the resulting relationships for the twenty-eight double tangents of the fourth degree curve. This wealth of material is presented, however, without any indication of the proofs which Steiner had found.\nOtto Hesse\ndescribed these results saying:-\n... they are, like\nFermat\n's theorems, riddles for the present and future generations.\nComplete proofs of all the results in this paper were found by\nLuigi Cremona\nand published in his book on algebraic curves.\nSteiner disliked algebra and analysis and believed that calculation replaces thinking while geometry stimulates thinking. He was described by\nThomas Hirst\nas follows:-\nHe is a middle-aged man, of pretty stout proportions, has a long intellectual face, with beard and moustache and a fine prominent forehead, hair dark rather inclining to turn grey. The first thing that strikes you on his face is a dash of care and anxiety, almost pain, as if arising from physical suffering - he has rheumatism. He never prepares his lectures beforehand. He thus often stumbles or fails to prove what he wishes at the moment, and at every such failure he is sure to make some characteristic remark.\nJacobi\nwrote of his friend Steiner:-\nStarting from a few spatial properties Steiner attempted, by means of simple schema, to attain a comprehensive view of the multitude of geometric theorems that had been rent asunder. He sought to assign each its special position in relation to the others, to bring order to chaos, to interlock all parts according to nature, and to assemble them into well-defined groups. In discovering the organism through which the most varied phenomena of space are linked, he not only furthered the development of a geometric synthesis; he also provided a model of a complete method and execution for all other branches of mathematics.\nDespite being a mathematical genius, in other ways Steiner was a difficult person. Burckhardt writes\n[\n1\n]\n:-\nStudents and contemporaries wrote of the brilliance of Steiner's geometric research and of the fiery temperament he displayed in leading others into the new territory he had discovered. Combined with this were very liberal political views. Moreover, he often behaved crudely and spoke bluntly, thereby alienating a number of people.\nThe last ten years of Steiner's life were increasingly difficult through illness. Kidney problems caused him to spend most of the year in his native Switzerland, only going to Berlin in the winter to deliver his lectures. Eventually he became totally bedridden and was unable to carry out any teaching duties. Steiner never married and, perhaps as a consequence, left a fortune on his death. One third of this fortune went to the\nBerlin Academy\nto found the Steiner Prize. The rest of the money was divided between his relatives and the school in his native village of Utzenstorf. His last wish was that poor children in his home town could have a better educational opportunity than he himself had.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}