{
  "nome_completo": "James MacPherson Wattie",
  "nome_curto": "James Wattie",
  "ano_nascimento": "1862",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wattie/",
  "lugar_nascimento": "Aberdeen, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "James Wattie\nwas born in the parish of St Nicholas, in the centre of the city of Aberdeen. His parents were Alexander Wattie\n(1829\n-\n1864)\nand Betsey McPherson\n(1828\n-\n1915)\n, born in Strachan, Kincardineshire. James was the third of his parents' three children, having two sisters, Annie Wattie and Sarah E Wattie who were ten and two years older than him respectively. His father died when he was two years old and his mother Betsey Wattie supported the family working as a school teacher. At the time of the\n1871\ncensus the family were living at Hillhead of Auchattie on the south side of the River Dee from Banchory in Kincardineshire. Betsey was teaching in the parish school of Banchory Ternan in the small town of Banchory. Annie was an apprentice dressmaker while Sarah and James were both at school. James went on to attend Old Aberdeen Grammar School before he matriculated at the University of Aberdeen in\n1879\n. At the time of the\n1881\ncensus Betsey and her daughter Sarah were living in the School House at Milton of Tullich, Glenmuick, Aberdeenshire where Betsey was a teacher. James was a student at the University of Aberdeen living as a boarder at\n21\nKing Street, Aberdeen with Peter Diack, his wife Mary and four children. We note at this stage that one of Peter and Mary Diack's children was Katherine Carney Diack whom James later married. James graduated from the University of Aberdeen with an M.A. in\n1883\nwith First Class Honours in Classics and First Class Honours in Mathematics.\nAfter studying at Aberdeen, Wattie went to the University of Oxford, matriculating at Pembroke College on\n30\nJanuary\n1884\nwhere he was a Henney Scholar:-\nCertain relatives and friends of the Rev Thomas Frederick Henney, M.A., Fellow and Tutor of Pembroke College, who died in\n1859\n, to testify to his services and do honour to his memory, subscribed a sum of money to found a Scholarship, to be called the Henney Scholarship, subject to such conditions and regulations as the College shall from time to time determine.\nWattie was First Class in Classical Mods in\n1885\n.\n(\nMods is the name of the first public examination for the degree of B.A. at Oxford.\n)\nHe was First Class in Mathematical Mods in\n1885\n. He was First Class in Lit. Hum.\n(\nliterae humaniores\n, the name of the examination for the B.A. at Oxford\n)\nin\n1887\n.\nAfter he received his B.A. from Oxford, Wattie taught at George Watson's College, Edinburgh from\n1887\nto\n1893\n. He married Katherine Carney Diack\n(\nborn in Aberdeen\n1864\n, died\n1931)\nin Old Machar, Aberdeen in\n1892\n; they had four daughters, Mary Frances Carney Wattie\n(\nborn\n1892\nin Old Machar, Aberdeen\n)\n, Katherine B McPherson Wattie\n(\nborn\n1896\nin Old Machar, Aberdeen\n)\n, Nora Isabel Wattie\n(\nborn\n1899\nin St Andrew, Edinburgh\n)\nand Margaret Patricia McPherson Wattie\n(\nborn\n1903\nin Monifieth\n)\n.\nHe became a lecturer in English at the Church of Scotland Training College in Aberdeen in\n1893\n. In\n1897\nhe became one of His Majesty's Inspectors of Schools in Edinburgh. Scotland had first appointed His Majesty's Inspectors of Schools in\n1840\n. The task of inspectors was to report:-\n... what improvements in the apparatus and internal management of schools, in school management and discipline, and in the methods of teaching have been sanctioned by the most extensive experience.\nAfter three years in Edinburgh, living at\n12\nInverleith Gardens, he moved to Keith, in Banffshire. At the time of the\n1901\ncensus the family were living at Earlsmount in Regent Street, Keith. This very large house, built on behalf of Colonel C George in\n1869\n, was in fine gardens overlooking the River Isla. The family had two servants, a general domestic and a nurse.\nThe posting in Keith lasted around four years after which he was based in Broughty Ferry, a town on the estuary of the River Tay a few miles from Dundee. In Keith, the family lived at Linton in Strathern Road. After two years he returned to his native city of Aberdeen. In Aberdeen the Wattie family lived first at\n60\nQueen's Road, next at\n1\nRubislaw Dens, then at\n14\nHamilton Place. In\n1910\nhe was appointed Chief Inspector of Schools, and at the time of the\n1911\nScottish Census the family were living in Old Machar, Aberdeen. In\n1927\nWattie became Senior Chief Inspector of Schools in Scotland; he retired in the same year.\nAfter he retired, Wattie had several articles published with contributions to the\nYear Book of Education,Â\n1932\nwhere he wrote Chapter\n5\n,\nScotland: elementary education\n; the English Association's\nEssays and Studies\ncontributing the articles\nThe Grammarian and his Material\n(1930)\nand\nTense\n(1931)\n; and the\nTransactions\nof Glasgow Philosophical Society in which he published\nA discourse on parody\n(\nread before the Society on\n17\nOctober\n1928\n, published\n1929)\n.\nWe note that James and Katherine Wattie's daughter Katherine won a bursary to Aberdeen University in\n1912\n-\n13\n:-\nThe third bursar was Miss Katherine B MacPherson Wattie\n(\nseventeen\n)\n, a daughter of Mr James MacPherson Wattie, H.M. Inspector of Schools. She was educated at the Aberdeen High School for Girls, and won the Town Council Gold Medal for University Subjects as dux of the school recently.\nWattie joined the\nEdinburgh Mathematical Society\nin January\n1889\nwhen he was teaching English at George Watson's College, Edinburgh. He remained a member of the Society through his career, leaving the Society around\n1921\n. After his death in\n1943\n, when he was living at\n24\nBurnbank Gardens, Glasgow, he was buried in Allenvale Cemetery, Aberdeen. We note that, throughout his life, his favourite recreation was walking.\nAfter Wattie died in\n1943\nhis daughters Nora Isabel Wattie MB ChB\n(\nAssistant Medical Officer in the Public Health Department in Glasgow\n)\n, Mary Frances Carney Wattie MA\n(\nmarried name Gant after her marriage to Thomas Harold Gant in\n1921)\n, Katherine B McPherson Wattie MA\n(\nmarried name Cope after her marriage to Thomas Cope\n)\n, and Margaret Wattie\n(\nmarried name Espinasse after her marriage to the professor of zoology Paul Gilbert 'Espinasse\n)\n, founded the Wattie Prize in Arts and Social Sciences at the University of Aberdeen. The prize is:-\n... to commemorate the name of James Macpherson Wattie, their father, the prize is awarded annually to the best candidate in English Language in the English Honours examination, provided that his or her work shows distinction.\nYou can read a little about Wattie's daughter Nora Isabel Wattie at\nTHIS LINK\n.",
  "math_areas": []
}