{
  "nome_completo": "James Hopwood Jeans",
  "nome_curto": "James Jeans",
  "ano_nascimento": "1877",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jeans/",
  "lugar_nascimento": "Ormskirk, Lancashire, England",
  "lugar_morte": "Dorking, Surrey, England",
  "biografia": "James Jeans\n' father was William Tullock Jeans. William Jeans was a parliamentary journalist of Scottish descent who wrote two books on the lives of scientists. The name Hopgood was James mother's maiden name; she came from the north of England. It was a very religious Christian family with James the eldest of the three children and the only boy. James' family moved to Brighton when he was eighteen months old then, when he was three years old, they moved to London.\nJeans was educated in Merchant Taylor's School in London which he entered in\n1890\n. The first topic which interested him was classics but soon his interests turned towards mathematics. An excellent mathematics teacher at the school encouraged Jeans' interest in the subject but from the time he was a young child he had shown a fascination with numbers. Several stories about his remarkable abilities as a child indicate both an interest and curiosity about numbers and an outstanding memory.\nMilne\nrelates in\n[\n5\n]\nthat:-\nHis interest in numbers was early and deep-seated: he not only factorised cab-numbers, but retained in his memory the numbers that he encountered ... At the age of seven he found his father's book of logarithms, tried to discover what they were for but failed, and learnt the first twenty or so seven-figure logs by heart, and remembered them until near the end of his life.\nJeans went to Trinity College Cambridge in October\n1896\nhaving won a mathematical scholarship. There he was a fellow student with\nG H Hardy\nwho was in the same year. He was taught as an undergraduate at Cambridge by\nJ W L Glaisher\n,\nW W Rouse Ball\n,\nA N Whitehead\n, R A Herman and\nE T Whittaker\n. He was Second\nWrangler\nin the Mathematical Tripos examinations of\n1898\n(\nranked seconf in the list of First Class students\n)\nand was awarded a First Class degree in the Mathematical Tripos of\n1900\n. Although he would not return again to pure mathematics, Jeans wrote a paper on the theory of numbers while an undergraduate. Both Jeans and\nHardy\nwere awarded a Smith's prize with 'unspecified relative merit'. Jeans was awarded an Isaac\nNewton\nStudentship in astronomy and optics, then in\n1901\nhe was elected a Fellow of Trinity.\nAlready while he was still an undergraduate Jeans had gained experience in experimental physics having worked in the Cavendish Laboratory during the academic year\n1899\n-\n1900\n. He was very active in research publishing work on a variety of topics in applied mathematics, physics and astronomy from\n1901\nonwards. In particular he published on the specific heats of gases and the mechanism of radiation. However this was achieved despite health problems. He suffered from tuberculosis during\n1902\nand\n1903\nand he had to go to a sanatorium to recover. He spent some time at a sanatorium in Ringwood, Lyndhurst, then later at a sanatorium in Mundesley.\nDuring this period of forced rest due to the tuberculosis, Jeans worked on his first major text\nThe dynamical theory of gases\n. It was a book which incorporated much of Jeans own researches.\nMilne\nwrites that the work includes\n[\n5\n]\n:-\n... the theory of the equipartition of energy and\nMaxwell\n's law, and the chapters in which he ... treats the statistical mechanics of a gas ... sweep the reader off his feet by their charm of expression, boldness of exposition, and power of generality.\nMilne\nwrites that studying this work when he was a student was one of his:-\n... most vivid and pleasurable mathematical experiences.\nHe goes on to show what an impact the work had on him as the start of his career:-\nIt is all a joyous adventure. Pure mathematicians will know what I mean when I describe the effect of the impact of Jeans' statistical mechanics on a young man's mind as comparable with the impact of a first introduction to the theory of functions of a complex variable. One is astounded that such a rich harvest of results arises from so thin a sowing of assumptions and definitions.\nThe dynamical theory of gases\nis far more than an account of Jeans' own research. It is a scholarly account of the whole area including a description of the physical properties of gases. Viscosity and conduction of heat are other topics which he included. The book benefits from Jeans' expertise in several areas: his physical intuition, his mathematical skills, and not least his ability to write with extraordinary clarity.\nIn\n1905\nJeans published a paper in the\nPhilosophical Magazine\nwhich showed the impossibility of the ether reaching thermal equilibrium with matter. Of course\nPlanck\nhad announced in\n1900\nhis formula, now known as\nPlanck\n's radiation formula, on black-body radiation but Jeans was strongly opposed to\nPlanck\n's results, see for example\n[\n4\n]\n. Of course Jeans' paper can be seen as a mathematical \"proof\" that classical physics does not suffice, but it is interesting to note that his pre-quantum ideas concerning the very long time required for systems to come into equilibrium and the observed breakdown of equipartition in specific heat measurements on molecular gases have been used again in relatively recent times more than\n80\nyears after Jeans introduced them. We should also note that Jeans' paper was written after the Michelson-Morley experiment disproved the existence of the ether, and in the same year that\nEinstein\npublished the special theory of relativity.\nJeans was appointed a Lecturer in Mathematics at Cambridge in\n1904\n, then he lectured at Princeton from\n1905\nuntil\n1909\nwhere he was Professor of Applied Mathematics. During this period he published his second major text\nTheoretical Mechanics\n(1906)\nand then, in\n1907\n, he was elected a Fellow of the\nRoyal Society\n.\nIn\n1907\nJeans married an American, Charlotte Tiffany Mitchell, who became a poet of some note. He published\nThe Mathematical Theory of Electricity and Magnetism\nin\n1908\nwhile still in the United States. In\n1909\nJeans returned to England and the following year he was appointed\nStokes\nLecturer in Applied Mathematics at Cambridge. He only held this post until\n1912\nwhen he retired to Guildford to devote himself completely to mathematical research and writing books.\nCertainly Jeans continued to produce a remarkable output, and he wrote an excellent report on\nRadiation and Quantum Theory\nfor the Physical Society in\n1914\n. In this work he showed that he had come to accept\nPlanck\n's formula on black-body radiation which he had rejected in\n1905\n. Although World War I prevented Jeans' report from being widely read in Britain until after\n1918\n, it then had a major impact on having quantum theory and the Bohr theory of the atom accepted by the British scientific community.\nIn\n1917\nJeans won the\nAdams\nPrize from the University of Cambridge for his essay entitled\nProblems of cosmogony and stellar dynamics\n. This was published as a book in\n1919\n. The high work-load was taking its toll, however, and in\n1917\nJeans began to show his first signs of heart problems. In\n1918\nJeans and his family moved to Dorking, Surrey, where they occupied a fine house Cleveland Lodge. He was a great lover of music and in his home he had an organ built which he often played for three or four hours a day. Despite considerable talents, he never played in public, not even playing for his friends.\nThere was a long running scientific argument between Jeans and\nEddington\nover the mechanism by which energy was created in stars. Jeans favoured, incorrectly as it turned out, the theory that the energy was the result of contraction while\nEddington\n, correctly of course, believed it resulted from a slow process of annihilation of matter.\nJeans' work in fluids led him to believe that\nLaplace\n's nebular hypothesis for the creation of the\nsolar system\nwas incorrect. He had studied compressible fluids in his\nAdams\nPrize essay. Examining the stability of a rotating mass of fluid he concluded that the result of George\nDarwin\nwhich showed that a pear shape of fluid was stable, was wrong. Taking the calculations to a higher degree of accuracy he showed that the shape was in fact unstable. He deduced from these results a mechanism whereby the rotating mass can split into two, giving a model for double star formation.\nFrom his results he deduced that\n[\n1\n]\n:-\n... rotation of a concentrating mass evidently could not give rise to the formation of a planetary system.\nInstead he proposed a tidal theory based on a star passing close to the Sun and pulling matter out which condensed into the planets. He explained his theories in\nThe nebular hypothesis and modern cosmogony\nin his\nHalley\nlecture of\n1922\n. In\n1923\nhe undertook research at the Mount Wilson Observatory in Pasadena, California where he was appointed as Research Associate.\nJeans' wife died in\n1934\nand he remarried in the following year. His second wife, Suzanne Hock, came from Vienna and she was an accomplished musician. Jeans, therefore, had a second organ installed in his Dorking home and, using his scientific skills, he designed the acoustics in his house to allow both his wife and himself to play their organs without disturbing each other.\nAs we have noted Jeans worked on thermodynamics, heat and other aspects of radiation, publishing major works on these topics and on applications to astronomy. His technical books, other than those mentioned above, are\nAstronomy and Cosmogony\n(1928)\n, and\nIntroduction to the Kinetic Theory of Gases\n(1940)\n.\nIn\n1928\nJeans was knighted. This was one of a great number of honours which he received; we shall note a few more below. After\n1929\nJeans gave up original research and spent most of his time writing popular texts; he wrote nine such texts in all. One such book\nThe Universe Around Us\n(1929)\nwas based in part on broadcast talks he had given in the previous year.\nMilne\nwrites\n[\n5\n]\n:-\nLike his technical treatises, this book sustains the reader's interest and excited attention from cover to cover.\nHe also gave the Rede lecture in\n1930\nwhich was written up as\nThe Mysterious Universe\n(1930)\n. In this Jeans writes:-\nWe have already considered with disfavour the possibility of the universe having been planned by a biologist or an engineer; from the intrinsic evidence of the creation, the Great Architect of the Universe now begins to appear as a pure mathematician.\nReally despite his work in astronomy and physics, Jeans always thought as a mathematician and always considered himself a mathematician.\nFurther popular texts included\nThe New Background of Science\n(1933)\n,\nThrough Space and Time\n(1934)\n,\nScience and Music\n(1938)\n, and\nPhysics and Philosophy\n(1943)\n. In this last mentioned text Jeans explains in the preface the purpose of the work:-\nThe aim of the present book is very simply stated; it is to discuss - and to some extent to explore - that borderland territory between physics and philosophy which used to seem so dull, but suddenly became so interesting and important through recent developments of theoretical physics. The new interest extends far beyond the technical problems of physics and philosophy to questions which touch human life very closely, such as materialism and free-will. Thus I hope the book may interest many who are neither physicists nor philosophers by profession.\nThe work examines what Jeans calls the 'mechanical age' from\nNewton\nto\nEinstein\nthe 'new physics' of\nPlanck\n, Rutherford, and\nNiels Bohr\nand 'From appearance to reality' with Bohr,\nHeisenberg\n,\nde Broglie\n,\nSchrödinger\n, and\nDirac\n. Although Jeans never published original contributions to quantum theory, he showed in such popular books that he had kept up with the developments in this area. The\n[\n2\n]\n:-\n... phenomenal sales\n[\nof Jeans popular books\n]\nwere equalled only by a few imaginative or religious works. Jean's literary success might have been predicted from his treatises, where the non-mathematical sections can be enjoyed even by the layman. As expositions of science these popular books are unexcelled.\nJeans had a heart attack in January\n1945\nbut made a good recovery and, in July\n1946\nwent on holiday with his wife to Montreux. However after a second heart attack in September Jeans died in his home.\nMilne\nrecords in\n[\n5\n]\nthat Jeans spent part of his last day listening to music.\nThe honours which Jeans received are far too numerous to give a full record here. Let us note a few such as: awarded the Gold Medal of the\nRoyal Astronomical Society\n(1922)\n, elected President of the\nRoyal Astronomical Society\n(1925\n-\n27)\n, awarded the Franklin Medal\n(1931)\n, elected President of the\nBritish Association for the Advancement of Science\n(1934)\n, awarded the Mukerjee Medal\n(1937)\n, awarded the Calcutta Medal\n(1938)\n, received the Order of Merit\n(1939)\n, elected vice-President of the\nRoyal Society\n(1938\n-\n40)\n. Among the universities to give him an honorary doctorate were Oxford, Manchester, Benares, Aberdeen, Johns Hopkins, St Andrews, Dublin, and Calcutta.\nLet us end by quoting further from\nThe Mysterious Universe\n(1930)\n:-\nThe terrestrial pure mathematician does not concern himself with material substance but with pure thought. His creations are not only created by thought but are pure thought. ... And the concepts which now seem to be fundamental to our understanding of nature ... four dimensional space, a space which expands forever; a sequence of events which follows the laws of probability instead of the laws of causation; all these concepts seem to my mind to be structures of pure thought. To my mind the laws which nature obeys are less suggestive of those which a machine obeys in its motion than those which a musician obeys in writing a fugue, or a poet in composing a sonnet. ... If all this is so, then the universe can best be pictured, although still very imperfectly and inadequately, as consisting of pure thought, the thought of what, for want of a wider word, we must describe as a mathematical thinker.",
  "math_areas": [
    "Applied Mathematics",
    "Statistics"
  ]
}