{
  "nome_completo": "James Gilbert Glimm",
  "nome_curto": "James Glimm",
  "ano_nascimento": "1934",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Glimm/",
  "lugar_nascimento": "Peoria, Illinois, USA",
  "lugar_morte": null,
  "biografia": "James Glimm\nwas the son of  William Frederick Glimm Jr\n(1893\n-\n1983)\nand Barbara Gilbert Hooper\n(1904\n-\n1992)\n. William Glimm, born\n7\nMay\n1893\nin Jersey City, New Jersey, USA, was a superintendent in a paper mill. He married Barbara, born\n10\nMay\n1904\nin Manhattan, New York, in St Johns Church, Jersey City, New York, on\n23\nApril\n1927\n. William and Barbara Glimm had three children, Letitia Anne Glimm\n(1928\n-\n2012)\n, William Frederick Glimm III\n(1930\n-\n2010)\n, and James Gilbert Glimm, the subject of this biography. We note that William F Glimm was elected to the First Ward of the Republican County Committee in\n1961\n.\nJames was born in Peoria, Illinois, but at the time of the\n1940\ncensus he was living at\n833\nCarleton Road, Westfield, Union, New Jersey. At this time, all three children were at elementary school in Westfield, with James in the\n1\nst Grade. The family had a\n19\nyear old maid, Alice Chamberlain. James grew up in Westfield and in\n1947\n, when he was twelve years old, he received a First Class Award and a Merit Badge from the District\n4\n, Watchung Area Council, Boy Scouts of America, the presentation taking place in Roosevelt Junior High School.\nGlimm attended the New Westfield High School, graduating in\n1952\n. He was Vice-president of the National Honor Society, president of the Writer's Club. He took part in swimming, track and football. He was a member of the Catalyst Club\n(\na Chemistry Society\n)\n, the Literary Club and the Forum Club. As a member of the Forum Club he was involved in debates: \"In assembly Jim Glimm and Yvonne Nelson debated Universal Military Training with two Union Junior College students.\" As a member of the Class of\n1952\nhe was described as:-\nHigh intelligence and the friendliest of personalities ... swimming one of many activities ... great leadership ... persuasive powers ... always willing to lend a hand ... polished manners ...\nAfter graduating from Westfield High School, Glimm entered Columbia University, New York, where he studied engineering. He graduated with a B.A. in Engineering in\n1956\n. With interests in mathematics, physics and engineering, he had difficulty choosing between them but realised that he could keep his interests in all three. He said\n[\n1\n]\n:-\nI have always been interested in mathematics, physics and engineering. While I was a student, I felt it very difficult to choose among these interests. As it turns out, I have managed to do all three, mostly by choice of projects and goals that rotated among these choices. The mixture of these topics especially when combined with computing is very powerful, as it allows one to address a very wide range of problems.\nAfter graduating with a B.A., Glimm remained at Columbia University undertaking research advised by\nRichard V Kadison\n. While a graduate student, he married Adele Strauss on\n30\nJune\n1957\n. Adele, the daughter of Sidney and Sobel Strauss, was born in the Bronx, New York City on\n27\nAugust\n1937\n. She was awarded an A.B. from Barnard College in\n1958\nand, after the birth of James and Adele's daughter Alison, Adele studied at Columbia University receiving an A.M. in\n1962\n. She then became a freelance writer of fiction.\nGlimm was awarded a Ph.D.by Columbia University in\n1959\nfor his\n40\n-page thesis\nOn a certain class of operator algebras\n. The thesis was published as a paper in\n1960\nin the\nTransactions\nof the\nAmerican Mathematical Society\n. Here is the Introduction to that paper\n(\nwhich differs slightly from the Abstract of the thesis\n)\n:-\nIn this paper we study\nC\n∗\nC^{*}\nC\n∗\n-algebras which are the uniform closure of strictly ascending sequences of full\nn\n×\nn\nn \\times  n\nn\n×\nn\n(\nn\nn\nn\nfinite\n)\nmatrix algebras. We call these algebras uniformly hyperfinite. Factors of type II_\n1\nwhich are the weak closure of such a sequence were first studied by R Murray and\nJ von Neumann\nin 'On rings of operators'\n(1943)\n, where it was proved that all such factors are isomorphic. The algebras we study are not all isomorphic. In §\n1\nwe classify uniformly hyperfinite algebras according to algebraic type  and obtain a characterization of these algebras. In §\n2\nwe identify the pure states and the pure state space of uniformly hyperfinite algebras. The w*-closure of the pure states of one of these algebras is the set of all states of the algebra. This is not the first example of a C*-algebra whose set of pure states is not closed. In §\n3\nwe classify the irreducible representations of uniformly hyperfinite algebras according to unitary equivalence. In §§\n4\nand\n5\nwe study certain representations of uniformly hyperfinite algebras.\nThe author is pleased to record his gratitude to Professor\nR V Kadison\nfor many helpful suggestions, for simplification of several proofs and for patient supervision of the research in this paper, which is the author's doctoral dissertation at Columbia University.\nThree further papers by Glimm appeared in\n1960\n, namely\nUnitary operators in C*-algebras\n,\nA Stone-Weierstrass theorem for C*-algebras\n, and\nTwo Cartesian products which are Euclidean spaces\n. The first of these was a joint work with\nRichard Kadison\n.\nA National Science Foundation Fellowship\n(1959\n-\n1960)\nallowed Glimm to spend the year from June\n1959\nto June\n1960\nat the Institute for Advanced Study at Princeton. In\n1960\n, he was appointed as an Assistant Professor at Massachusetts Institute of Technology and, a few years later, he was promoted to Associate Professor. In the summer of\n1967\nhe was invited to a workshop at Stanford. Arthur Jaffe writes\n[\n2\n]\n:-\nJim and Adele visited Stanford that summer\n[1967]\n. Jim's colloquium concerned his \"random choice\" method now known as the \"Glimm scheme\" to construct the first global solution for a system of conservation laws in one space dimension. This fascinating and original probabilistic approximation method for non-linear PDEs resonated with the experts who attended. During that workshop Jim and I began to talk in earnest about mathematical physics. That summer I also moved from Stanford to Harvard, so with Jim close by at M.I.T. we had easy opportunity to interact. Our collaboration eventually blossomed into working together for over twenty years - an unusually long and productive time. ... And what luck that Jim was ensconced on Arlington Street, only a few minutes\" walk from Fernald Drive, where I rented a small apartment from Harvard. We often met at one of our homes for an afternoon to discuss field theory and to work. Jim's apartment provided an especially comfortable and congenial atmosphere. Although I worried about becoming a burden, Jim and Adele often invited me for dinner. I was enormously appreciative and happy to accept their kind hospitality - which on occasion I could reciprocate. Jim is a great teacher, and I learned much that winter. Most of our joint work focused on proving and establishing consequences of a priori estimates.\nIn\n1968\nGlimm was appointed as full Professor at the\nCourant\nInstitute, New York University. Arthur Jaffe explains in\n[\n2\n]\n:-\nIn\n1968\n, just a year after Jim and I began to collaborate, the Glimms moved to New York. Jim had been oscillating between Boston and Courant, where he was wooed by the many analysts and which he found attractive. Adele liked the atmosphere in the City for writers, so they were off.\nIn\n1970\nThomas Spencer became Glimm's research student at the\nCourant\nInstitute. Spencer writes\n[\n2\n]\n:-\nIn\n1970\n, I was accepted as a graduate student at\nCourant\nInstitute and hoped that Glimm would become my thesis advisor. The first time that I walked into Jim's office is still fresh in my mind today. After introducing myself, I asked Jim whether he could suggest a problem that I could work on. He was sitting behind a huge desk in an enormous office. He was very relaxed and quite friendly and then he asked me, \"What do you know?\" Of course I thought to myself, I know nothing, nothing at all, but blurted out that I had studied\nKato\n's book on functional analysis. This seemed to be a satisfactory reply and Jim started to tell me about some of the basic ideas of quantum field theory. I had only the vaguest idea of what he was talking about but hoped that I could learn something about this strange area of mathematical physics. Jim assigned some basic reading about\nFock\nspaces, annihilation and creation operators and Wick order. He kept fairly close contact with his students and so I would frequently stop by to ask him questions and to learn about his latest ideas.\nGlimm remained at the\nCourant\nInstitute until\n1974\nwhen he became a full professor at the Rockefeller University. He worked there for six years before returning to the Courant Institute in\n1982\n. In\n1989\nhe became a Distinguished Professor at SUNY at Stony Brook. He explained in\n[\n1\n]\nthat he went to Stony Brook because of the:-\nOpportunities to build and lead a research group.\nTo see some information about books that Glimm has written, including some extracts from Introductions and reviews, see\nTHIS LINK\n.\nGlimm was a plenary speaker at the\n1974\nInternational Congress of Mathematicians held in Vancouver in August\n1974\n. He delivered the lecture\nAnalysis over Infinite-Dimensional Spaces and, Applications to Quantum Field Theory.\nHe has received many other honours including the following prizes: the\nNew York Academy of Sciences\nAward in the Physical and Mathematical Sciences\n(1979)\n; the Dannie Heineman prize for Mathematical Physics\n(1980)\n; the Steele Prize from the\nAmerican Mathematical Society\n(1992)\n; and the National Medal of Science\n(2002)\n.\nThe Dannie Heineman prize recognises outstanding publications in the field of mathematical physics. In\n1980\nit was awarded jointly to James Gilbert Glimm and Arthur Michael Jaffe:-\nFor their joint contributions to constructive quantum field theory; in particular for their solutions of models of interacting fields in two and three space-time dimensions, thereby demonstrating the compatibility of relativistic invariance, quantum mechanics, and local field theory.\nThe\n1992\nLeroy P Steele Prize was awarded to Glimm:-\n... for his paper \"Uniqueness in the Cauchy Problem for Partial Differential Equation\".\nIn\n[\n3\n]\nwe have the following report about Glimm being awarded the National Medal of Science in\n2002\n:-\nJames Glimm, a noted mathematician whose work has revolutionized shock-wave theory and other fields of study, has been named a\n2002\nNational Medal of Science Laureate. Raised in Westfield, Dr Glimm is the Director of the Center for Data Intensive Computing and Chair of the Department of Applied Mathematics and Statistics at Stony Brook University. President Bush made the announcement on October\n28\nin Washington. Dr Glimm and seven other distinguished scientists and engineers will receive their medals November\n6\n. In addition, six National Medal of Technology Laureates were announced. Dr Glimm has made enormous contributions to shock wave theory, which explains the intense compression in natural phenomena, such as air pressure in sonic booms. His work in quantum field theory and statistical mechanics had a major impact on mathematical physics and probability.\nThe citation for this award reads as follows:-\nFor his original approaches and creative contributions to an array of disciplines in mathematical analysis and mathematical physics, which are fundamental to the theory of operator algebras, shock-wave theory, advanced quantum field theory, quantum statistical mechanics, applied mathematics, and scientific computation Also affiliated with Brookhaven National Laboratory\nGlimm was elected President of the\nAmerican Mathematical Society\nserving in\n2007\n-\n08\n. He was proposed for this role by\nR V Kadison\n,\nD McDuff\nand\nI M Singer\nand their nominations are given in\n[\n4\n]\n. Let us quote\nDusa McDuff\n:-\nI am happy to write in support of Jim Glimm's nomination for President of the AMS. For many years now, Glimm has been the chair of the Department of Applied Mathematics and Statistics at Stony Brook. He reinvigorated its existing groups in fluid dynamics and statistics, unifying them around the core theme of computation, and started new groups in computational geometry and, more recently, computational biology. As a result the Department plays a greatly enhanced role both in the Engineering College at Stony Brook and nationally. In the past few years Glimm has also been a key participant in the establishing of a Center for Data Intensive Computing at Brookhaven National Lab, providing essential scientific direction for this new and successful unit. Glimm's outstanding leadership abilities are shown in his talent for spotting mathematical topics that are ripe for development and then for assembling interdisciplinary teams of researchers to focus on specific problems in the area, with participants ranging from the most theoretical mathematicians to the end users in engineering. He has extensive experience in interfacing with the wider community of mathematical scientists. His talent for strategic thinking and experience in building bridges between mathematics and its applications should prove very important assets in helping the AMS find its way forward.\nLet us end this biography by quoting from Glimm himself about his views on the future of mathematics. In his election statement for the President of the\nAmerican Mathematical Society\nhe wrote: -\nFundamental advances in mathematical reasoning have seldom been as pervasively important to society as they are today, and at the same time they are more at risk of being compromised.\nIn the interview\n[\n6\n]\nhe was asked:-\nCan you expand on this? What exactly is at risk?\nHe replied\n[\n6\n]\n:-\nA lot of this is tied to computation and the way that computation is replacing experiments in many cases. Not only are the physicists using mathematical reasoning, which they have done since the days of\nIsaac Newton\n, but with the computer they are actually solving equations and using them to build things. They are relying on mathematical models, as opposed to trial and error. The Edisonian style of invention is not the same driving force as it was one hundred years ago. Analytic models are the workaday method of engineering, and you see this across many industries. So the role of mathematics is certainly increasing. Even outside the engineering and physical sciences, entire new areas are becoming mathematized. Economics and finance is an example, and biology is another example, where twenty years ago the mathematicians wouldn't have gotten in the front door. Now they often have a leading intellectual role in making decisions in those areas and guiding the direction. The human genome project is wildly successful, and strong mathematical modelling and analysis were part of both of the teams that competed to complete the project. The importance of mathematics to society is unquestioned. This has been well documented: for instance, in the promotional materials created by the\nAMS\n, the \"Mathematical Moments\", which are on the bulletin boards of math departments around the world and have been translated into many languages. The second part of the question was, What is at risk? Actually, mathematics is in danger of drowning in its own success, because as it succeeds, people are trying to capture, control, and direct it. This is probably more true for the applied than for the pure mathematician, but there are certainly forces that would take away the freedom to control our research agenda. These forces are very pervasive, and they are subtle; they sort of lap up like rising water, so you don't notice it from year to year, and people even welcome it because it comes with good news attached as well as bad. But it is definitely a danger. I think it is worth some thought.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}