{
  "nome_completo": "James Hutton",
  "nome_curto": "James Hutton",
  "ano_nascimento": "1726",
  "ano_morte": "1797",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hutton_James/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "James Hutton\nwas a chemist but is best known as a geologist. Why then include him in this archive? There are two reasons. First his remarkable theory of the age of the Earth was inspired by\nNewton\n's world view as presented in the teaching of\nColin Maclaurin\n, and second that one of his main collaborators in his geological research was\nJohn Playfair\n.\nJames Hutton's mother was Sarah Balfour and his father was William Hutton. James was born into a wealthy family for his father William was a merchant who held the office of Edinburgh city treasurer. William owned a\n140\nacre farm at Slighhouses and a nearby hill farm of\n590\nacres named Nether Monynut. Slighhouses is west of Berwick-upon-Tweed, about\n7\nkm north of Duns and Chirnside. William Hutton died when James was about two years old and Sarah Hutton was left to bring up James and his three sisters\n(\nJames had an older brother who died young\n)\n. Sarah did not marry again, as many women of this time would have had to do, and was able to bring up the family with no financial difficulties.\nIn\n1736\n, when he was ten years old, James entered Edinburgh High School. There he studied Latin, Greek and mathematics, and in November\n1740\n, at the age of fourteen, he entered the University of Edinburgh. This was not as remarkable as it now sounds, for at this time the Scottish universities competed with the schools to educate the brightest pupils. At the University of Edinburgh Hutton was taught mathematics by\nMaclaurin\nand logic and metaphysics by John Stevenson. He graduated in the spring of\n1743\n, still only seventeen years old.\nAfter graduating, Hutton took a job as an apprentice to a solicitor, but his mind was not on the work as\nPlayfair\nrecounts\n[\n7\n]\n:-\n... the young man's propensity to study continued, and he was often found amusing himself and his fellow apprentices with chemical experiments when he should have been copying papers, or studying the forms of legal proceedings.\nHutton, deciding to take the training which involved the most chemistry, returned to the University of Edinburgh in November\n1744\nto undertake medical studies. However before he could begin his second year of studies the\n1745\nrebellion had broken out and his former lecturer\nMaclaurin\nwas organising the defence of the city against the Jacobite armies. It was a year before he could resume his studies, which he did in\n1746\n.\nIn\n1747\nHutton fathered an illegitimate child. Probably for that reason he left Edinburgh and went to Paris where he continued his studies at the University. After a year there he moved again, this time to complete his medical studies in Leiden. After submitting a thesis entitled\nDe sanguine et circulatione in microcosmo\nto the University of Leiden he graduated with his medical degree in September\n1749\n. It may have been that Hutton never intended to practise medicine as a career, or he may have decided to avoid Edinburgh for a while since that was where his illegitimate son was living. For whatever reason he returned from Leiden to live in London rather than Edinburgh.\nWhile in London, Hutton corresponded with James Davie who had been a school friend and was still living in Edinburgh. They had made a chemical discovery while students in Edinburgh, discovering a way to make sal ammoniac, a chemical used in welding metal. In the summer of\n1750\nHutton visited Edinburgh, where he and James Davie set up a chemical works. The works was an immediate success and provided Hutton with an income for the rest of his life.\nContinuing to live in London, Hutton now made frequent visits to the farm at Slighhouses, west of Berwick-upon-Tweed, which he had inherited from his father. He planned to farm there but decided that first he would make a study of modern farming methods. In\n1752\nHutton moved to a farm in Norfolk where he spent two years. These were good years as\nPlayfair\nrecalled\n[\n7\n]\n:-\n... there was ... no period of his life to which he more frequently alluded, in conversation with his friends; often describing, with singular vivacity, the rural sports and little adventures, which, in the intervals of labour, formed the amusements of their society.\nThese were important years for Hutton in another way, for it was during these years that his interest in geology began. We should stress that at this time geology would not have been considered as a science in its own right and Hutton would consider himself as a natural philosopher. Many mathematicians were interested in natural philosophy, and geology in particular. It was around this time that Hutton began to read books on the topic; reading the works\nDiscourse on earthquakes\n(1705)\nby\nHooke\n,\nNew theory of the Earth\n(1696)\nby\nWhiston\n,\nProtogaea\n(1749)\nby\nLeibniz\nand\nHistoire naturelle\nby\nBuffon\n, as well as Steno's treatise\nDissertation concerning a solid body enclosed by the process of nature within a solid\n.\nIn the summer of\n1754\nHutton moved to Slighhouses where he began farming. It was the beginning of a period spanning thirteen years during which he made some trips to Edinburgh but spent most of his time farming and working on his theories of geology. At first he did not seem very happy at Slighhouses but evidence from a letter he wrote to his friend George Clerk Maxwell\n(\nthe great great grandfather of\nJames Clerk Maxwell\n)\nin\n1755\nsuggests that the cause might well have been a love affair which went wrong. Among other asides in the letter which suggest this, he writes\n(\nsee\n[\n5\n]\n)\n:-\nO if the ladies were but capable of loving us men with half the affection that I have towards the cows and calves that happen to be under my nurture and admonition, what a happy world we would have.\nHutton returned to live in Edinburgh in\n1767\n, living in the family home with his three sisters. He came back to a city which was undergoing a revolution in scholarship. Here he joined in the intellectual activity which was bursting out throughout the city. The most important of his friends were Joseph Black who discovered carbon dioxide, James Watt who made the first practical steam engine, and Adam Smith the economist.\nThe house in which Hutton lived in Edinburgh now became his laboratory as well as his home and he continued to pursue his theories of the history of the Earth. A visitor to his home wrote\n(\nsee for example\n[\n5\n]\n)\n:-\nHis study is so full of fossils and chemical apparatus of various kinds that there is barely room to sit down.\nHis interest in geology led him to other projects too, and he was a member of the committee of nine who organised the construction of the Forth and Clyde Canal. He joined the committee in\n1767\nwhen it was based in Edinburgh where construction of the canal began, and remained on it until\n1775\nby which time the committee were based in Glasgow as the construction neared the Clyde.\nThe age of the Earth was a topic which, certainly in Europe at that time, was highly religious in nature. The Bible was taken as literal truth, despite the acceptance by most that the Earth revolved around the sun. Scientists such as\nNewton\nhad expounded much energy working on a chronology of the Earth using the scriptures. The standard date taken for the creation was around\n4000\nBC and the accepted belief was that Christ was born\n4000\nyears after the creation, the second coming would occur\n2000\nyears after the birth of Christ, and he would reign on Earth for\n1000\nyears. There were two major reasons for this chronology. One was a study of ages given in the Bible of those from the time of Adam and Eve onwards. The second was a literal interpretation of the six days God took to create the world as described in the Book of Genesis together with the quotation that to God one day is like a thousand years.\nHutton looked at the rocks around him to understand the history of the Earth rather than seeking answers from the Bible. Realising that soil is caused by erosion of rocks, he also understood that there is a second mechanism creating rocks beneath the surface which are then elevated to form new land. He understood that this was an extremely slow cyclic process and that the Earth therefore had to be extremely ancient. However he did not see any mechanism which would allow him to give even an estimate for this age.\nSome time during\n1784\nthe\nRoyal Society of Edinburgh\ninvited Hutton to give two lectures on his theory. The first of these was arranged to be given on\n7\nMarch\n1785\nbut unfortunately he was ill and unable to address the Fellows himself. His lecture\nConcerning the system of the Earth, its duration, and stability\nwas delivered by his friend Joseph Black. Hutton was well enough to deliver the second of his lectures four weeks later on\n4\nApril. Of course many saw his conclusions as an attack on the Christian Church and some opposed his views vigorously. Hutton's reaction was what one would expect of an outstanding scientist - he undertook trips to view rock formations to try to gain further evidence to prove that his theory was correct. One such expedition was in the summer of\n1788\nwhen Hutton,\nPlayfair\n, and Sir James Hall sailed down the North Sea coast of Scotland viewing the exposed rock formations in the cliffs.\nA printed version of Hutton's two lectures to the\nRoyal Society of Edinburgh\ndid not appear in print until\n1788\n, but since the further evidence which Hutton had gathered in the years following his lectures is not mentioned one has to assume that the delay was in the printing of the paper in the\nProceedings of the Royal Society of Edinburgh\n. He then worked on a book which would explain his theory in more detail. This treatise\nThe theory of the earth\nappeared in\n1795\nbut sadly it was not nearly such a good book as it might have been since Hutton wrote it during a time of deteriorating health. One also has to add that, even before the severe health problems, Hutton always seemed much more successful in convincing his fellow scientists when he spoke to them than when he wrote. Hutton had a rather peculiar written style of presentation which made his theory less intelligible and, as a result, he received less acclaim than he deserved. His style led to many misrepresentations and to attacks from the few who had read the work. It remained to others, particularly\nPlayfair\n, to present his views more successfully.\nPlayfair\n's published\nIllustrations of the Huttonian Theory of the Earth\nin\n1802\n. He presented Hutton's theories in a different style from that of\nThe theory of the earth\n. His simple and eloquent style consisted of a series of chapters clearly stating the Huttonian theory, giving the facts to support it, and the arguments given against it. The success of\nPlayfair\n's presentation can be judged by the fame and credit which have since been given to Hutton, who is now regarded as the first great British geologist.\nPlayfair\nspent almost five years, from Hutton's death in\n1797\nuntil\n1802\n, writing the\nIllustrations\n. The majority of his spare time was spent travelling through Britain searching for evidence to support Hutton's theories, having learned on trips made with Hutton, such as the\n1788\ntrip mentioned above, how to interpret the rock formations he saw.\nAs to Hutton's character,\nPlayfair\nin\n[\n7\n]\ngives this account:-\nTo his friends his conversation was inestimable; as great talents, the most perfect candour, and the utmost simplicity of character and manners, all united to stamp upon it. ... The simplicity pervaded his whole conduct; while his manner, which was peculiar, but highly pleasing, displayed a vivacity, hardly ever to be found among men of profound and abstract speculation. His great liveliness, added to the aptness to lose sight of himself, would sometimes lead him into little eccentricities, that formed an amusing contrast with the graver habits of philosophic life. ... But it is impossible by words to convey any idea of the effect of his conversation, and of the impression made by so much philosophy, gaiety nd humour, accompanied by a manner at once so animated and simple.",
  "math_areas": [
    "Logic"
  ]
}