{
  "nome_completo": "James Mercer",
  "nome_curto": "James Mercer",
  "ano_nascimento": "1883",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mercer/",
  "lugar_nascimento": "Bootle, Liverpool, England",
  "lugar_morte": "London, England",
  "biografia": "James Mercer\n's father was Thomas Mercer\n(\nborn at Upholland, Lancashire about\n1852)\nwho was a bank cashier. His mother was Sarah Alice Mercer\n(\nborn in Liverpool about\n1858)\n. James had eight younger siblings: Mary\n(\nborn about\n1885)\n, Alice\n(\nborn\n1887)\n, Richard\n(\nborn\n1889)\nand Thomas\n(\nborn about\n1891)\n, Frank\n(\nborn about\n1893)\n, Eric\n(\nborn\n1894)\n, Sarah\n(\nborn about\n1897)\nand Ernest\n(\nborn about\n1899)\n.\nJames Mercer was educated in Liverpool, attending University College there before entering Trinity College Cambridge to study the mathematical Tripos. Among his contemporaries there were\nG N Watson\nand\nJ E Littlewood\nwhile he was taught by\nWhitehead\n,\nWhittaker\nand\nHardy\n.\nHardy\nhad just come onto the staff at Trinity and he acted as a private tutor to Mercer. In\n[\n2\n]\nLittlewood\ndescribes the Mathematical Tripos examinations which he and Mercer sat. Describing Part I of the Tripos,\nLittlewood\nwrites:-\n[\nThe examination\n]\nconsisted of\n7\npapers\n(\n'first four days'\n)\non comparatively elementary subjects, the riders, however, being quite stiff, followed a week later by another\n7\n(\n'second four days'\n)\n. A pass on the first four days qualified for a degree, but the second four days carried double the marks, and since it was impossible to revise everything the leading candidates concentrated on the second four days ... On the problem paper\n[\nfor the first four days\n]\nMercer got\n270\nout of\n760\nfor\n18\nquestions\n(\nI got only\n180)\n. ... In the second four days\n(\nignoring the problem paper\n)\nMercer and I each got about\n2050\nout of\n4500\n(\neach about\n330\nout of\n1340\nin the\n18\nquestion problem paper\n)\n.\nMercer graduated in\n1907\nbracketed Senior\nWrangler\n(\nfirst equal\n)\nwith\nLittlewood\n. He was awarded a Smith's prize and, in\n1909\n, he was elected a Fellow of Trinity. He returned to his home town of Liverpool for a while, being appointed as an Assistant Lecturer there, but soon after, when the opportunity came to return to Cambridge, he accepted a Fellowship and Lectureship in Christ's College.\nDuring the First World War Mercer served as a Naval Instructor. He saw active service at the Battle of Jutland, the only major encounter between the British and German fleets during the First World War. Fought off the coast of Denmark, it began on\n31\nMay\n1916\n. The battle was inconclusive but the British fleet suffered heavy losses. Mercer survived the battle and at the end of the war returned to his duties at Cambridge.\nBack in Cambridge he resumed his mathematical research, continuing his work on function theory. He was elected a Fellow of the\nRoyal Society\nin\n1922\nbut after this time his health, which had been poor for some time, began to fail. He took ill health retirement in\n1926\n.\nHobson\n[\n1\n]\ngives this overview of Mercer's mathematical achievements:-\nMercer was a mathematical analyst of originality and skill; he made noteworthy advances in the theory of\nintegral equations\n, and especially in the theory of the expansion of arbitrary functions in series of orthogonal functions. His output of original work would no doubt have been much larger had he not been continually hampered by bad health.\nMercer's theorem about the uniform convergence of eigenfunction expansions for kernels of operators appears in his\n1909\npaper\nFunctions of positive and negative types and their connection with the theory of integral equations\npublished in the\nPhilosophical Transactions\n. There have been many papers written since then generalising Mercer's theorem to various other settings. For example\nMathematical Reviews\ncontains at least\n65\npapers studying such generalisations which have been published since\n1980\n.",
  "math_areas": [
    "Analysis"
  ]
}