{
  "nome_completo": "James Thomson",
  "nome_curto": "James Thomson",
  "ano_nascimento": "1786",
  "ano_morte": "1849",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thomson_James/",
  "lugar_nascimento": "Annaghmore, near Ballynahinch, Co. Down, Ireland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "James Thomson\n's father was also named James Thomson and his mother was Agnes Nesbitt. Although originally Scottish, the family were Presbyterians who had been forced to leave Ayrshire in the\n1640\ns during the struggle between the episcopacy of Charles I and the Covenanters. They settled in the Presbyterian north of Ireland. James Thomson senior was a farmer who gave his children what little education they would receive. James, the subject of this biography, was his parents' third son.\nThomson showed his mathematical skills and interests at a young age. He constructed sundials and also a night-dial which enabled the time at night to be found using the stars. When still about ten years old he had calculated how to make a sundials for any latitude. However events of the time were to create a strong impression on the young Thomson which greatly affected his outlook on life. The country was poor and there were bitter divisions between Catholics and Protestants. However the Society of United Irishmen was founded in Belfast in\n1791\nwho promoted a nation freed of religious division and corrupt monarchy. They inspired a series of rebellions in\n1798\nwhich were brutally repressed by the British. In that year Thomson witnessed the battle of Ballynahinch where the United Irishmen were defeated\n[\n1\n]\n:-\nSeeing the wanton destruction of the town by the king's forces, and the futility of the armed rebellion, moulded the young Thomson, whose lifelong radicalism would lead him to challenge all manner of establishments.\nTwo years later, in\n1800\n, Thomson attended a new school opened by a secessionist Presbyterian minister Dr Edgar to train young men for the ministry. After studying at the school, Thomson began to teach there himself and by\n1808\n, he later wrote\n(\nsee for example\n[\n4\n]\n)\n:-\nI was teaching eight hours a day at Dr Edgar's, and during the extra hours - often fagged and comparatively listless - I was reading Greek and Latin to prepare me for entering College, which I did not do till nearly two years after.\nNot only did he prepare himself academically for his university studies, but he also tried to save some money so that he might have enough to live on. He matriculated at the University of Glasgow in\n1810\nand, two years later, was awarded an M.A. He could not afford to study without earning some more money, and this he was able to do during the summer months by returning to teach at Dr Edgar's school. After graduating in\n1812\nhe continued to attend classes in Medicine and Divinity still with the intention of entering the Church.\nIn\n1814\nhe was appointed to the Belfast Academical Institution. This Institution had been founded in\n1810\nand had both a school department and a college department. Thomson's first appointment was to the school department where he taught arithmetic, geography, and bookkeeping for a year before moving to the college department where he became professor of mathematics. In Belfast he met Margaret Gardner, the daughter of a Glasgow merchant, and they were married in\n1817\n. The newly married couple lived in a house opposite the Belfast Academical Institution and their seven children were born in that house. The first son of the marriage was James who was born in\n1822\n. He went on to become professor of engineering at Glasgow. The second son, born in\n1824\n, is the famous\nWilliam Thomson\n, later Lord Kelvin.\nMargaret Thomson died in\n1830\nleaving Thomson to bring up his seven children. He was offered the Chair of Mathematics at Glasgow University and took up the appointment in\n1832\n. Thomson and his children lived in the old college off the High Street in Glasgow during the teaching term which occupied the six winter months. In the summer, however, they moved to accommodation which they rented in their favourite locations on the Clyde, perhaps the favourite location of all being in Arran.\nMacRobert\nwrites\n[\n5\n]\n:-\nIn his first year as professor the salary went to Millar\n[\nthe previous professor\n]\n, and he found that he was left with no income at all, for which he had to work very hard. To remedy this he gave lectures on Geography and Astronomy to large and enthusiastic classes of ladies. These lectures he continued for some years till, the mathematical classes having increased in numbers, he was compelled by pressure of work to discontinue them.\nTwo years after taking up the professorship his two sons James\n(\nthen twelve years old\n)\nand\nWilliam\n(\nthen ten years old\n)\nbegan their university studies at Glasgow. These two young men turned out to be Thomson's most talented mathematics students. He was an important figure in the development of Glasgow University\n[\n1\n]\n:-\nThomson's reform campaigns began fundamentally to change the character of Glasgow University from that of an ancient, inward-looking corporation whose primary function was the training of ministers of the established Kirk to that of a knowledge-producing institution whose aims harmonized with the industrial, progressive goals of the second city of the empire.\nAs a mathematician he is famed as a writer of textbooks. While in Belfast he published\nA Treatise on Arithmetic in Theory and Practice\n(1819)\n,\nTrigonometry, Plane and Spherical\n(1820)\n,\nIntroduction to Modern Geography\n(1827)\n, and\nThe Differential and Integral Calculus\n(1831)\n. He later edited a version of\nEuclid\n's\nElements\n(1834)\nand wrote his most famous text\nAn Elementary Treatise on Algebra Theoretical and Practical\n(1844)\n.\nThomson arrived in Glasgow in\n1832\njust after a cholera epidemic had passed but it was a second cholera epidemic in\n1848\nwhich took his life.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Number Theory"
  ]
}