{
  "nome_completo": "James Burton Serrin",
  "nome_curto": "James Serrin",
  "ano_nascimento": "1926",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Serrin/",
  "lugar_nascimento": "Chicago, Illinois, USA",
  "lugar_morte": "Minneapolis, Minnesota, USA",
  "biografia": "James Serrin\nis known to his friends and colleagues as Jim. His parents were James Burton Serrin and Helen Elizabeth Wingate. Although James was born in Chicago, he was brought up in Evanston, Illinois. It was in Evanston that James's brother Richard Wingate Serrin was born in\n1928\n. Both boys attended Evanston Township High School with James graduating in\n1944\nand his brother Richard two years later. Both boys loved music and art and Richard was on his way to becoming an established artist by the time he graduated from the High School. For James, however, music and art were hobbies as he entered Northwestern University in\n1944\nto study science and engineering. He majored in Electrical Engineering at Northwestern University before going on to Western Michigan College, Kalamazoo in\n1946\n(\nit did not become Western Michigan University until\n1957)\n. He received a Bachelor of Arts degree from Western Michigan College in\n1947\n.\nSerrin undertook graduate studies at Indiana University, Bloomington, where, after attending mathematics courses, he received his Master's degree. He wrote\n[\n2\n]\n:-\nIn the years\n1948\nto\n1950\n, James Serrin had the unique opportunity of attending lecture courses on elliptic differential equations given by Professors\nEberhard Hopf\nand\nDavid Gilbarg\nat Indiana University. These exemplary lectures first awakened his interest in this theory and in particular of the maximum principle.\nAs well as the two mathematicians mentioned in this quote, we should also note that at Indiana University Serrin met\nClifford Truesdell\n. As well as giving Serrin a lifelong interest in thermodynamics, the two became firm friends. Serrin worked for his doctorate at Indiana University with\nDavid Gilbarg\nas his thesis advisor. Before the submission of this thesis he had already published the paper\nFree boundaries and jets in the theory of cavitation\nwritten in collaboration with\nGilbarg\n. E Pinney writes in a review of this paper:-\nThe authors discuss the theory of a finite cavity containing a backward jet behind a body in two dimensional irrotational incompressible flow. The backward jet is a mathematical fiction whose departure from the physical facts does not appear to seriously effect the field of flow not in its immediate vicinity, according to experimental evidence now available. One of the usual conformal mapping techniques effective in solving problems involving straight boundaries is used to treat the problems of flow about an inclined plate and a wedge, in which, however, emphasis is placed on a generalization of the Schwarz transformation in which branch points are arbitrarily placed in the interior of the polygon which as a result occupies a\nRiemann\nsurface. A set of conditions is given for the solution of flow problems involving curved boundaries.\nSerrin was awarded a Ph.D. in\n1951\nfor his thesis\nThe Existence and Uniqueness of Flows Solving Four Free Boundary Problems\n. He published this work under the title\nExistence theorems for some hydrodynamical free boundary problems\nin the first issue of the\nJournal of Rational Mechanics and Analysis\nin\n1952\n. This journal was later renamed the\nArchives for Rational Mechanics and Analysis\nand Serrin joined the editorial board in\n1963\n. After the award of his doctorate, he was appointed as Fine Instructor of Mathematics at Princeton University. From Princeton he moved to the Massachusetts Institute of Technology where he was a C L E Moore Instructor of Mathematics during\n1952\n-\n54\n. It was on\n6\nSeptember\n1952\nthat he married Barbara West; they had three daughters, Martha\n(\nborn\n1953)\n, Elizabeth\n(\nborn\n1957)\nand Janet\n(\nborn\n1963)\n. In addition to his work on hydrodynamics, he also began publishing very significant results on elliptic differential equations with papers such as\nOn the Phragmen-Lindelöf theorem for elliptic partial differential equations\n(1954)\n,\nOn the Harnack inequality for linear elliptic equations\n(1956)\nand\n(\nwith\nDavid Gilbarg\n)\nOn isolated singularities of solutions of second order linear elliptic equations\n(1956)\n.\nIn\n1954\nSerrin was appointed as Assistant Professor of Mathematics at the University of Minnesota. He was promoted to Associate Professor of Mathematics in\n1956\nand to full professor in\n1959\n. As an example of his publications from this period, we quote the first paragraph of his paper\nOn the uniqueness of compressible fluid motions\n(1959)\n:-\nOne of the fundamental questions which should be answered concerning any problem of applied mathematics is whether it is well set, that is, whether solutions actually exist and whether they are unique. We shall be concerned here with the initial value problem for compressible fluid flow, and we shall study in particular the uniqueness of its solutions.\nAlso in\n1959\nhe published the monograph\nMathematical principles of classical fluid mechanics\nin the\nHandbuch der Physik\nas well as papers on the calculus of variations such as the two major papers\nOn a fundamental theorem of the calculus of variations\nand\nA new definition of the integral for non-parametric problems in the calculus of variations\nwhich appeared one following the other in\nActa Mathematica\n. Laurent Véron writes\n[\n3\n]\n:-\nFor the first time he defined the value of the functional by using some ideas from the theory of surfaces, a set of ideas which will come back triumphantly a few years later. The period\n1963\n-\n1964\nhighlights the full maturity of Jim Serrin's thought, in particular in mastering the art of well adapted test functions for studying general quasilinear equations. It is during that period that his two articles\n[\n'Local behavior of solutions of quasi-linear equations'\n(1964)\nand 'Isolated singularities of solutions of quasi-linear equations'\n(1965)]\non isolated singularities were published in 'Acta Mathematica'. Shortly afterwards, in collaboration with Howard Jenkins, James Serrin published a surprising article on construction of minimal surfaces. And this was the first evidence of his growing interest in differential geometry. ... The climax of this work is his famous article 'The problem of Dirichlet for quasilinear differentials equations with many independent variables', published in London in\n1969\nin the 'Philosophical Transactions of the Royal Society'.\nAt the University of Minnesota, Serrin served as Head of School of Mathematics during\n1964\n-\n65\nand, in\n1969\n, was named Regents' Professor of Mathematics. He was an invited speaker at the International Congress of Mathematicians in Nice in\n1970\ngiving the lecture\nBoundary curvatures and the solvability of Dirichlet's Problem\n. He was also an invited speaker at the\n1983\nInternational Congress held in Warsaw giving, on this occasion, the lecture\nThe structure and laws of thermodynamics\n. It was between these two major honours that Serrin received many others major honours such as an honorary doctorate from the University of Sussex in\n1972\nand, in the following year, the\nGeorge David Birkhoff\nPrize in Applied Mathematics from the\nAmerican Mathematical Society\n:-\n... for his fundamental contributions to the theory of nonlinear partial differential equations, especially his work on existence and regularity theory for nonlinear elliptic equations, and applications of his work to the theory of minimal surfaces in higher dimensions.\nHe served on the Council of the\nAmerican Mathematical Society\nduring\n1972\n-\n74\n. In\n1979\nhe received the Distinguished Alumni Award from Indiana University and, in the following year, was elected a fellow of the American Association for the Advancement of Science and a member of the\nNational Academy of Sciences\n. In\n1984\nhe was elected a member of the\nAmerican Academy of Arts and Sciences\nand, in\n1992\n, received honorary doctorates from the University of Ferrara and the University of Padova. In\n1995\nSerrin retired and was named Professor Emeritus of Mathematics by the University of Minnesota. In the same year he was elected to the\nFinnish Academy of Sciences\n.\nWe have seen that he spoke about thermodynamics in his\n1983\naddress to the International Congress. His progression to this area, influenced by his friendship with\nClifford Truesdell\n, is described as follows\n[\n2\n]\n:-\nMathematical analysis, calculus of variations and geometry were not sufficient for James Serrin. Hence, after some brilliant first contributions to hydrodynamics, he turned his research towards other problems arising from physics, such as boundary layers phenomenon, tornadoes, phase transitions and finally on thermodynamics.\n[\nHe\n]\nis now widely considered as the\nBourbaki\nof thermodynamics.\nMany research visits made by Serrin over the years led to him holding visiting positions at Stanford University\n(\nSummer\n1961)\n, the University of Chicago\n(\nSpring\n1964\n, Spring\n1975)\n, Johns Hopkins University\n(\nSpring\n1966)\n, University of Sussex\n(1967\n-\n68\n,\n1970\n,\n1972)\n, the Mittag-Leffler Institute in Stockholm\n(1975)\n, the University of Naples\n(\nSummer\n1979)\n, the University of Perugia\n(\nSpring\n1985\n, Summer\n1992)\n, Oxford University\n(\nSpring\n1986)\n, the University of Modena\n(\nSpring\n1988)\n, and the Georgia Institute of Technology\n(\nAutumn\n1990)\n. During his visit to the University of Chicago, Serrin gave lectures which were published as\nFoundations of classical thermodynamics\n(1975)\n. Vadim Komkov writes that:-\n... as an introduction to the axiomatic formulation of thermodynamics these notes are definitely stimulating.\nThe next book by Serrin was not published until after his retired. This was the important\nThe maximum principle\nwritten in collaboration with Patrizia Pucci. The authors write in the Preface\n[\n2\n]\n:-\nThe maximum principle enables us to obtain information about solutions of differential equations and inequalities without any explicit knowledge of the solutions themselves, and thus can be a valuable tool in scientific research. In particular, this book should prove useful not only to professional mathematicians and students primarily interested in mathematics, but also to physicists, chemists, engineers and economists. The maximum principle moreover occurs in so many places and in such varied forms that anyone learning about it becomes acquainted with the classically important partial differential equations and, at the same time, discovers the reason for their importance.\nRodney Josué Biezuner reviewed the book. Here is a brief extract from the review:-\nSince its first applications in the study of the\nLaplace\nand linear elliptic operators in general, the maximum principle has found a wide range of applications in nonlinear partial differential equations and inequalities, including equations involving the celebrated p-\nLaplace\noperator. A wealth of instances of such applications can be found in this book, clearly presented and thoroughly discussed. Complete or almost complete proofs are given to most results, and the presentation is usually very clear. Many results and even some of the proofs of standard results are new. Furthermore, the reader will find the first presentations in book form of the compact support principle and the general theory of structured elliptic inequalities. Notable features of this book include the careful historical research and the presence of interesting problems of varying difficulty at the end of each chapter, a rarity in books at this level.\nWe noted above the two addresses that Serrin gave to the International Congress. He has given many other invited addresses at numerous international conferences held in the United States, England, Scotland, Italy, Canada, Israel, Poland, Hungary, India, France and Spain. He has addressed meetings of the\nAmerican Mathematical Society\n, the\nSwedish Mathematical Society\n, the\nFinnish Mathematical Society\n, the\nItalian Mathematical Union\n, the\nCircolo Mathematico di Palermo\n, and the\nCanadian Mathematical Society\n. He has served on the editorial boards of many major journals including the\nArchive for Rational Mechanics and Analysis\n, the\nJournal of Differential Equations\n,\nCommunications in Partial Differential Equations\n, the\nBulletin of the American Mathematical Society\n,\nRendiconti Circolo Matematico di Palermo\n,\nAsymptotic Analysis\n,\nDifferential and Integral Equations\n,\nCommunications in Applied Analysis\n, and\nAdvances in Differential Equations\n.\nPatrizia Pucci describes in\n[\n1\n]\nSerrin's interests outside mathematics, such as:-\n... his interest in classical music and his sophisticated and ample collection of rare records; his sincere love of art and architecture and his splendid paintings\n(\nmany by Professor Serrin's brother Richard\n)\n, and his selection of fine objects collected with Barbara year by year, his warm and large library with impressive and almost unique books on art; and the collection of photographs taken essentially during his scientific travels.\nLaurent Véron writes\n[\n3\n]\n:-\nWhat exquisite hosts Barbara and Jim Serrin are! In their house, with antiques and memories, paintings and books, I had the privilege to have lunch on beautiful Wedgwood china, before attending a concert in their company.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}