{
  "nome_completo": "James Glenie",
  "nome_curto": "James Glenie",
  "ano_nascimento": "1750",
  "ano_morte": "1817",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Glenie/",
  "lugar_nascimento": "Leslie, Fife, Scotland",
  "lugar_morte": "Chelsea, London, England",
  "biografia": "James Glenie\n's mother was Margaret Smith and his father was John Glenie, who was an officer in the army. James attended the local parish school before matriculating at the University of St Andrews where he studied the standard syllabus taken by all students which included classics, mathematics and science. However he was mainly interested in divinity since at this stage he was intending to enter the church. However he soon became fascinated by mathematics and he was briefly an assistant in mathematics at St Andrews. Eventually, however, he decided to follow his father by making a career for himself in the army.\nGlenie then qualified as an engineer at the Royal Military Academy, Woolwich. He was an artillery officer when his regiment was sent out to North America in\n1775\nat the start of the American War of Independence. After reaching the rank of second lieutenant in the artillery in November\n1776\nhe later transferred to the engineers, becoming second lieutenant in February\n1779\n. During his time in North America with the army Glenie worked on mathematics. In fact, even before being sent to North America, he had discovered what he called the antecedental calculus in\n1774\n. This was an attempt to base\nNewton\n's fluxional calculus on the\nbinomial theorem\nrather than on the concept of motion. He published a number of papers on this and other topics;\nThe division of right lines, surfaces and solids\nbeing published in the\nPhilosophical Transactions of the Royal Society\nin\n1776\nwhile\nThe general mathematical laws which regulate and extend proportion universally\nwas published in the same journal in the following year. In\n1778\nthe\nRoyal Society\npublished Glenie's paper on the antecedental calculus. In addition to these papers he had also published a book on gunnery entitled\nThe History of Gunnery with a New Method of Deriving the Theory of Projectiles\nin\n1776\n. For his achievements in mathematics and its applications he was elected a fellow of the\nRoyal Society\non\n18\nMarch\n1779\nwhile he was still based with the army in Quebec.\nIn\n1780\nGlenie returned to England and at this time he married Mary Anne Locke from Plymouth. Three years later he became involved in a serious dispute within the\nRoyal Society\nwhich is described in detail in\n[\n3\n]\nbut which we now sketch. In\n1779\nHutton\nhad became foreign secretary of the\nRoyal Society\nbut was forced to resign in\n1783\nby Sir Joseph Banks, the president of the Society. It was an unfortunate affair which led to considerable controversy. Banks claimed that\nHutton\nhad failed to carry out his duties efficiently, but many in the Society supported\nHutton\nand felt that it was in fact Banks who had failed to manage the affairs of the Society competently.\nHutton\nwas supported by Glenie as well as by\nAtwood\nMaseres\n,\nMaskelyne\n,\nLanden\n, Hornsby and others. They accusing Banks of using excessive authority and of being \"despotic\" and Glenie made a strong speech opposing Banks and supporting his fellow mathematicians at a meeting of the Society in February\n1784\n. It was certainly a serious affair with the mathematicians threatening to secede from the Society. In fact there was another element to the argument which reflected the rapid increase in the use of mathematics in physical sciences. Glenie, and the others in the mathematicians' mutiny, strongly supported this.\nThe \"mathematicians' mutiny\" in the\nRoyal Society\nwas only one of several disputes that Glenie became involved in. The next involved a dispute with the Duke of Richmond described in\n[\n1\n]\n:-\nThe duke of Richmond, appointed master-general of the ordnance in\n1783\n, consulted Glenie about his plans to fortify all naval arsenals and to create lines of defence along the British coast. Glenie's somewhat tactless declaration that these plans were absurd and impracticable was ill received and led to a flurry of pamphleteering on both sides.\nIn many ways Glenie won the argument since the Duke's plans failed to gain the approval of Parliament in\n1786\n. However Glenie chose to resign his commission in the army as a consequence of this dispute and emigrated with his wife and children to New Brunswick, Canada. Glenie still retained his interest in mathematics and he published his ideas in a book entitled the\nAntecedental Calculus\n(1793\n,\n1794)\n. He had other interests in Canada, however, serving as a member of the New Brunswick House of Assembly but failing in a business venture as a contractor for ships' timber. Eventually his political career also failed and in\n1805\nhe returned to England with his family. He then taught at the East India Company Royal Military College at Addiscombe from\n1805\nto\n1810\n. Glenie, sadly, suffered yet another major set-back\n[\n1\n]\n:-\nHe was summoned to testify for the crown at the prosecution of G L Wardle MP, but his evidence provoked severe censure from chief justice Lord Ellenborough, and led to his dismissal from his existing posts.\nYet again Glenie tried to succeed in another venture. He went to Copenhagen in\n1812\nin an attempt to purchase a large plantation, acting for a member of parliament. Perhaps, as in other ventures, Glenie was rather naive and had not set up the proper legal protections for himself. When Glenie returned he was not recompensed so he put in a claim for compensation which eventually went to arbitration. Even the arbitrators could not agree and Glenie was left financially ruined. He turned again to his mathematics, attempting to make some money by taking pupils but, like so many of Glenie's ventures, this too was not successful. He died in poverty.",
  "math_areas": [
    "Calculus",
    "Logic"
  ]
}