{
  "nome_completo": "James Gourlay Clunie",
  "nome_curto": "James Clunie",
  "ano_nascimento": "1926",
  "ano_morte": "2013",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clunie/",
  "lugar_nascimento": "St Andrews, Fife, Scotland",
  "lugar_morte": "York, England",
  "biografia": "James Clunie\nwas known as Jim to his friends and colleagues. As a child he suffered from an attack of polio which affected his health for the rest of his life. He attended Madras College in St Andrews but these were difficult years since, when he was\n13\nyears old, World War II began. St Andrews was not badly affected by bombing raids, despite being close to the air base at Leuchars. However, studies at school were made considerably more difficult due to the war. After the war ended, the headmaster wrote in\n1947\n:-\nDuring the war years we had to work in trying conditions - black-out restrictions, shorter school days, potato holidays, overcrowding etc. but we have, I think, fully maintained the high standards of the school.\nOne of the reasons that the headmaster was able to say that they had maintained their high standards was the fact that several of the former pupils, including Clunie, were by this time being highly successful at university.\nClunie graduated from Madras College in\n1945\nhaving been awarded the Sir William Robertson Medal as Dux in Science and the Tullis Medal as Dux in Mathematics. In the autumn of\n1945\nhe matriculated at the University of St Andrews where he studied mathematics, applied mathematics and physics.\nHerbert Turnbull\nwas the Regius professor of mathematics and head of the mathematics department. Applied mathematics had been built up by\nDan Rutherford\nwho was also teaching in the department during Clunie's four years as an undergraduate. Clunie graduated with a First Class Honours B.Sc. in Mathematics in\n1949\nand for his outstanding performance he was awarded the Carstairs Prize. In his final two honours years he had studied the five compulsory topics, Geometry, Algebra, Analysis, Statics, and Dynamics. There were also five optional courses on offer from which he had to choose two. Clunie chose the optional courses Statistics and Special Functions. Although Clunie's performance had been outstanding in all the courses he took, he was not the best student in his year; this distinction went to\nIain Adamson\n.\nAfter graduating, Clunie went to Aberdeen to undertake research at the University of Aberdeen where his thesis advisor was\nArchibald James Macintyre\n. He was awarded his Ph.D. by the University of Aberdeen in\n1952\nfor his thesis\nOn Certain Topics Concerning the External Behaviour of Functions\n[\n1\n]\n:-\nIn his PhD thesis Jim developed what quickly became the 'modern' approach to the subject of\nWiman\n-\nValiron\ntheory, published in two papers in the Journal of the\nLondon Mathematical Society\n.\nThe two papers referred to in this quote are\nThe determination of an integral function of finite order by its Taylor series\n(1953)\nand\nOn the determination of an integral function from its Taylor series\n(1955)\n. In the first of these, Clunie begins his Introduction as follows:-\nThis paper contains a revised account, for integral functions of finite order, of\nWiman\n's analysis of the determination of an integral function by its power series. The method used differs in several particulars from previous accounts. ...\nHe also expresses his thanks to his thesis advisor\nArchibald Macintyre\n:-\nI wish to express my gratitude to Dr\nA J Macintyre\nfor suggesting the problems treated in this paper, and for his advice and criticism throughout the work.\nThese two papers were certainly not the only ones he published over these years. Other papers are:\nAn extension of quasi-monotone series\n(1953)\n;\nOn Bose-Einstein functions\n(1954)\n;\nUnivalent regions of integral functions\n(1954)\n;\nThe asymptotic paths of integral functions of infinite order\n(1955)\n;\nOn a theorem of Collingwood and Valiron\n(1955)\n;\nThe asymptotic behaviour of integral functions\n(1955)\n;\nNote on integral functions of infinite order\n(1955)\n;\nNote on a theorem of Parthasarathy\n(1955)\n;\nThe maximum modulus of an integral function of an integral function\n(1955)\n; and\nSeries of positive terms\n(1955)\n.\nAfter the award of his doctorate from the University of Aberdeen, Clunie was appointed as a lecturer in mathematics at the University College of North Staffordshire, which was in Keele, Newcastle-under-Lyme, Staffordshire, and became Keele University in\n1961\n. He married Nancy Tuff\n(\nborn\n22\nOctober\n1922)\nat Newcastle-under-Lyme at the beginning of\n1955\n. Their daughter Fiona was born on\n25\nOctober\n1955\n. Clunie did not remain at the University College of North Staffordshire until it became Keele University for, in\n1956\n, he moved to London.\nWalter Hayman\nwas appointed as the first Professor of Pure Mathematics at Imperial College, London, in\n1956\nand immediately began to build a major research centre for complex analysis. Clunie was one of\nHayman\n's first appointments to Imperial College. He lived at\n45\nSt Andrews Avenue, Wembley, a very appropriate address for someone who was born in St Andrews! At Imperial College he had an exceptionally productive research career\n[\n1\n]\n:-\nAt Imperial College, Jim's complex analysis research flourished and he wrote many hugely influential papers, and supervised seven research students. His papers included one on the coefficients of univalent functions, published in Annals of Mathematics, that led to the introduction of the so-called 'Clunie constant'; another in the Journal of the London Mathematical Society that contains a result now known as 'Clunie's lemma'; and a joint paper in Crelle's Journal with Professor J Milne Anderson and Professor Christian Pommerenke that established the theory of so-called\nBloch\nfunctions.\nLet us give a little more detail to the highlights of Clunie's research which are indicated in this quote. The paper in which he introduced the 'Clunie constant' was\nOn schlicht functions\n(1959)\nbut he continued the investigation in numerous later papers including\nOn meromorphic schlicht functions\n(1959)\nand\nOn the coefficients of univalent functions\n(1974)\n. This\n1974\npaper was written jointly with Christian Pommerenke\n(\nborn\n17\nDecember\n1933\nin Copenhagen\n)\n. Pommerenke had studied at the University of Göttingen where he\nhabilitated\nbut he had spent the years\n1965\n-\n67\nat Imperial College, London, where he worked closely with Clunie. Returning to the quote above, let us note that 'Clunie's lemma' appeared in his paper\nOn integral and meromorphic functions\n(1962)\n. The theory of\nBloch\nfunctions was developed in the three-author paper\nOn Bloch functions and normal functions\n(1974)\n. Clunie's co-authors on this paper were Christian Pommerenke and J Milne Anderson. James Milne Anderson\n(\nborn\n1938)\nwas a Ph.D. student of Clunie's at Imperial College and was awarded his doctorate for his thesis\nThe Behaviour of Integral and Subharmonic Functions\nin\n1963\n. He taught at University College, London.\nClunie spent the academic year\n1959\n-\n60\nin the United States. With his wife and daughter, he left Southampton on\n26\nAugust\n1959\nbound for New York on the liner Bremen and they returned on the liner Queen Elizabeth. They left New York and arrived in Southampton on\n13\nJuly\n1960\n. At the age of\n39\n, Clunie was promoted to a professorship at Imperial College in\n1964\n. Terry Sheil-Small gives some insight into his influence as a teacher\n[\n2\n]\n:-\nJim Clunie was Professor of Pure Mathematics at Imperial College when I arrived in September\n1965\nas an undergraduate. He taught me complex analysis and\nfunctional analysis\n. I was extremely lucky to be assigned one of his tutees. He was responsible for converting me from being\n[\ninterested in\n]\nfluid dynamics to being a real mathematician. We were never colleagues in the same department. Jim was struck down by polio as a child, so giving a lecture had always been a bit of a struggle.\nTerry Sheil-Small tells a nice story about Clunie's love for beer\n[\n2\n]\n:-\nJim's love of beer is legendary. At a mathematics meeting at the University of Durham in the\n1980\ns, the bursar remarked that the consumption of alcohol was extremely high. He could only recall one occasion when the consumption was even higher, and that was a conference organized by Professor Clunie in\n1979\n.\nIn\n1981\nhe reached the age of\n55\nwhich made retirement possible. Because his health problems made lecturing so difficult, he took the opportunity to retire from his chair at Imperial College but he had no intention of giving up mathematical research. He took up a research fellowship at the Open University in Milton Keynes where he worked until\n1986\nwhen he accepted a research fellowship at York University.\nWe have already noted Clunie's love of beer, but we should say a little more about his personality\n[\n1\n]\n:-\nJim was regarded extremely warmly by many friends, and widely respected as a wise and knowledgeable colleague with a fine sense of humour. Indeed, his general knowledge was extraordinary, and his ability to complete 'The Times' crossword before breakfast at conferences legendary.\nWe also quote a nice story recounted by Terry Sheil-Small which again recalls Clunie's love of beer\n[\n2\n]\n:-\nOnce, Jim was external examiner for a PhD thesis. For the oral examination, he arrived at the university very early, and so headed straight for the bar. There he enjoyed some beer and a lengthy conversation with a mathematics student. He was able to announce later that he had examined the student in the bar!\nClunie died peacefully in Lamel Beeches Nursing Home on\n5\nMarch\n2013\n, aged\n86\nyears. He was survived by his daughter Fiona, her husband Simon, and his granddaughter  Alex. The funeral took place at York Crematorium on Friday,\n5\nApril. His daughter paid this tribute to her father:-\nDear Dad, though I am grieving I know your struggle is over and you had the peaceful ending you always wanted. If only you could have known it would be like that. There will be bagpipes at your funeral!\n(\nNot real ones!\n)\nI'll miss our Sunday lunches and reading the papers while you snoozed.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}