{
  "nome_completo": "James Gordon Gray",
  "nome_curto": "James Gray",
  "ano_nascimento": "1876",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gray_James/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Dowanhill, Glasgow, Scotland",
  "biografia": "James Gray\n's parents were Annie Gordon\n(\nborn Gullatown, Fife in\n1850)\nand\nAndrew Gray\n.\nAndrew Gray\nwas a famous scientist and mathematician who was born in Lochgelly, Fife in\n1847\n. He had served as Private Secretary to\nSir William Thomson\n(\nLord Kelvin\n)\n, was Professor of Physics at University College, Bangor, North Wales, and finally Professor of Natural Philosophy at Glasgow University. Among his publications were\nAbsolute Measurements in Electricity and Magnetism\n(1883)\n,\n(\nwith\nG B Mathews\n)\nTreatise on Bessel Functions\n(1895)\n, and\nThe Scientific Work of Lord Kelvin\n. James Gray had seven siblings: John\n(\nborn\n1872)\n, Annie\n(\nborn\n1874)\n, Margaret\n(\nborn\n1879)\n, Isabella\n(\nborn\n1882)\n, Thomas\n(\nborn\n1884)\n, Kenneth\n(\nborn\n1886)\n, and Euphemia\n(\nborn\n1889)\n.\nAlthough James was born in Glasgow, his father was at this time professor at Bangor and James attended Friars Grammar School, Bangor, Caernarvonshire. After completing his school education, Gray entered the University College of North Wales.\nIn\n1899\nGray's father was appointed to the Glasgow Chair and he moved to Glasgow to continue his undergraduate studies. He graduated with a B.Sc. in electrical engineering and was appointed an Assistant Lecturer in Applied Physics at Glasgow University in\n1904\n. Four years later he was promoted to Senior Lecturer. During World War I Gray undertook scientific work in naval and aerial defence and in navigation. In\n1920\nhe was appointed Professor of Applied Physics. A newspaper report in\nThe Scotsman\non Saturday\n2\nOctober\n1920\nstated:-\nNEW GLASGOW PROFESSOR\nGlasgow University Court have appointed Mr James Gordon Gray, D.Sc., to the Cargill Chair of Applied Physics, established at Gilmorehill through the generosity of Sir John T Cargill, Bart. The second son of Professor Gray, F.R.S., Professor of Natural Philosophy in the University, Dr Gray has for some years been performing the duties of a Professor of Applied Physics, conducting the classes in physics in the University for engineering students and for students of medicine. He is a graduate of Glasgow University, and has become widely known for his original scientific work.\nGray was a member of the\nEdinburgh Mathematical Society\n, joining in March\n1909\n. He was also a member of the Institute of Electrical Engineers. He was elected to the\nRoyal Society of Edinburgh\non\n18\nJanuary\n1909\n, his proposers being\nAndrew Gray\n,\nWilliam Jack\n,\nCargill Gilston Knott\n,\nGeorge Chrystal\n.\nAn obituary, written by Robert Alexander Houstoun, appears in the\nProceedings\nof the\nRoyal Society of Edinburgh\n, Volume\n55\n(1934\n-\n35)\n,\n154\n-\n155\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nAfter his death\nThe Scotsman\npublished the following obituary:-\nSCOTS SCIENTIST DEAD\nProfessor J G Gray, Glasgow\nAPPLIED PHYSICS\nA Scottish scientist of world-wide reputation, Professor James Gordon Gray, D.Sc., F.R.S.E., M.I.E.K., of Glasgow University, died yesterday in Glasgow. Professor Gray occupied the Chair of Applied Physics, and was widely known for his experiments and original scientific work. He made valuable contributions to aeronautical discoveries in the form of gyroscopic instruments for cloud flying and bomb sighting. During the war he conducted experiments on behalf of the Allied Forces, employing gyroscopic principles in naval and aerial defence and in navigation.\nSince the war Britain has benefited further from Professor Gray's experiments, and when the Cargill Chair of Applied Physics was instituted in Glasgow in\n1920\nhis appointment to the Professorship met with the warm commendation of scientists all over the world. Previously he had declined two tempting offers from America to carry on research work in applied physics in that country. Professor Gray took a prominent part in building up the organisation by means of which his department at the University was brought to its present high state of efficiency.\nCO-OPERATED WITH HIS FATHER\nMuch of his gyroscopic work was carried out in close co-operation with his father, the late Professor Andrew Gray, of the Natural Philosophy Chair in Glasgow University. Along with his father, too, he planned the building and equipping of the now Natural Philosophy Institute of Glasgow University. Professor Gray took a keen interest in the Royal Philosophical Society of Glasgow, and rendered valuable service to its mathematical and physical section. For some years past he had been engaged perfecting apparatus and methods for use in the production of gyroscopic helms and stabilisers for aerial and marine craft. A native of Glasgow, Professor Gray, received his early education at Friars Grammar School, Bangor, and subsequently entered the University College of North Wales. In\n1904\nhe joined the staff of Glasgow University, and lectured in the Department of Applied Physics. He was unmarried. His publications included \"A Treatise on Dynamics\"\n(\nwith his father\n)\n, and about\n150\nscientific papers and patent specifications. He was the pioneer inventor of the inductor compass used by Colonel Lindbergh in his Atlantic flight.\nHis bequest to the University of Glasgow was reported shortly afterwards:-\nGlasgow Professor's Bequest\nAPPARATUS FOR UNIVERSITY\nProfessor James Gordon Gray, D.Sc., M.I.E.E., F.R.S.E., of La Mancha, Dowanhill, Glasgow, Cargill Professor of Applied Physics in the University of Glasgow, a famous authority on gyroscopes, and author of numerous scientific papers, son of the late Professor Andrew Gray, F.R.S.\nPersonal estate in Great Britain  ...  £\n6408\n.\nHe left to the University of Glasgow his whole collection of gyroscopes and apparatus at the University or elsewhere, to be used for demonstration purposes at the University or elsewhere, by or under the charge of the Professor of Applied Physics of Glasgow University for the time being, or anyone authorised by him.",
  "math_areas": []
}