{
  "nome_completo": "James Wiegold",
  "nome_curto": "James Wiegold",
  "ano_nascimento": "1934",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wiegold/",
  "lugar_nascimento": "Trecennydd, near Caerphilly, Wales",
  "lugar_morte": "Penarth, near Cardiff, Wales",
  "biografia": "James Wiegold\nwas known to all his friends and colleagues as Jim. We give details of the first years of his life up to the time he went to Manchester University by quoting, almost verbatim, from\n[\n3\n]\n. James Wiegold was born near Caerphilly on\n15\nApril\n1934\n. This fact was somewhat obscure to him through his childhood: for many years he celebrated his birthday erroneously on\n17\nApril. James, or Jimmy Boy as he was then called, much to his later chagrin, was the fifth child of Walter Wiegold, a mining surface worker originally from London, and his Welsh wife Elizabeth, a woman of remarkable intelligence and forceful personality. The family was caught at the harsh end of the\n1930\ns depression, with Walter unemployed until rearmament for war. Their house in Abertridwr, where Jim spent most of his childhood, had no electricity except for a single electric light bulb introduced during his childhood. The children were sometimes short of food and regularly short of clothing: at one point Jim was unable to go to school because his mother could find no shoes for him, while on another occasion the only coat she could find was a girl's coat. He simply dumped the offending item somewhere, rather than go to school in it. At the right times of year, however, food was more easily supplemented from natural sources. The family regularly foraged for food, including blackberries, bilberries, sloes, burdock, nettles, trout, and rabbits.\nOne might expect that this story of financial deprivation would be balanced from the beginning by extraordinary academic success. In fact, in the early years of primary school the future mathematics professor was thought to be backward. Despite this inauspicious start, however, at the age of\n10\nJim won a scholarship to Caerphilly Boys Grammar School, a success almost unheard of in his community. On his first day in September\n1944\n, the whole street waved him off on the train from Abertridwr to Caerphilly. At the grammar school, the educationally deprived child's world opened up: many times he has recalled the day he brought home his Latin books and peeped awestruck into this brave new world. A few years later, however, a potential disaster struck. The teenage Jim was looking out of the window at home one evening and was surprised to see, as he thought, that \"they had put a second light on Aber mountain.\" When he looked back into the room, he saw that there was suddenly a second everything. This was the beginning of the double vision with which he lived throughout his life. He always saw two images of everything, with one image moving round the other. At first, the teenager did not dare to tell anyone, because he thought he would not be believed, but when he started falling down stairs and pouring tea into the wrong cup his mother realised that there must be a problem. The diagnosis was a minor brain haemorrhage; the prognosis extremely discouraging, with the medical profession proclaiming that he would never be able to go to university or to pursue any worthwhile activity. Naturally, Jim was not going to let that stand in his way. The only everyday activity which was closed to him was driving. Go to university he certainly did, to study mathematics at Manchester.\nWhen Jim went north in\n1951\n, he had never previously been out of the counties of Glamorganshire, Gloucestershire, Herefordshire and Somerset and had never seen a bathroom. At first he was horrendously homesick, but soon he warmed to the intellectual, social, and cultural opportunities offered by a university city. Jim used to go to Halle concerts in the Free Trade Hall. One occasion was the first time Jim had ever heard, either live or recorded, Beethoven's fifth Symphony: he recounted his overwhelming excitement and a feeling of \"walking on air\". At Manchester, Jim met a fellow mathematics undergraduate Christine. Their first meeting was at a mathematics department Christmas dance, and she was singularly unimpressed with him, but soon a friendship grew which flourished into a romance and finally a marriage, on Easter Monday,\n7\nApril\n1958\n. Not only were Jim and Christine fellow undergraduates but both also became research students of\nBernhard Neumann\n. Jim and Christine Wiegold had three children, Helen, Alison and Richard.\nWiegold had graduated B.Sc. with First Class Honours in Mathematics from Manchester in\n1954\n, then spent a year working for his M.Sc. which he received one year later. He submitted his doctoral dissertation entitled Nilpotent products of groups with amalgamations in\n1958\nand was awarded his Ph.D. In his thesis he combined two ideas, namely the theory of generalized free and direct products of groups with amalgamations, and the theory of nilpotent products and verbal products of groups. By the time he received his doctorate he was already employed as an Assistant Lecturer at the University College of North Staffordshire, now the University of Keele. He held this position from\n1957\nto\n1960\nwhen he moved back to Manchester as a Lecturer in the Faculty of Technology. The Pure Mathematics Department in the Faculty of Technology was led by\nHanna Neumann\nand Wiegold had already started joint work with her on certain products of groups which they called linked products before he joined the staff at Manchester. Their joint paper\nLinked products and linked embeddings of groups\nappeared in\n1960\n. In\n1963\nWiegold left Manchester and returned to Wales when he was appointed as a Lecturer at the University College of South Wales and Monmouthshire, now Cardiff University. He returned with his young family to Wales, in order to be closer to his now-widowed father and siblings, rather than because of any pro-Welsh drive.\nIn\n1966\nWiegold was promoted to Senior Lecturer. Then in\n1968\nhe went to the School of General Studies of the Australian National University where he spent two years, first as a Visiting Senior Lecturer and in the second year as a Visiting Reader. Both\nBernhard\nand\nHanna Neumann\nhad left Manchester in the same year that Wiegold went to Cardiff. When Wiegold visited,\nHanna Neumann\nheld the chair of pure mathematics in the School of General Studies and Bernhard Neumann was Head of the Mathematics Department at the Institute of Advanced Studies. Wiegold's youngest sister Liz went out to Australia with Jim and his family, and remained at ANU as a history student after they left. Liz married Daniel Neumann, the youngest of\nBernhard\nand\nHanna Neumann\n's children. Wiegold was promoted to a Readership at Cardiff in\n1969\n. In\n[\n2\n]\nJohn Lennox recalls an interesting aspect of this promotion:-\nJim was amused by the fact that I got to know about his Readership before he did!  One day, towards the end of my own PhD research,\nPhilip Hall\ntold me that there was a certain James Wiegold who was about to get a Readership at Cardiff. Hall suggested I should apply for a lectureship in Cardiff, remarking: \"Jim is an excellent man and I think you two will get on very well.\" He could not have been more prophetic - Jim and I were subsequently involved in writing\n26\njoint papers. I thus got my first post as a result of Jim's ability - typical of the man, helping others without even knowing it.\nIn\n1974\nWiegold became a professor when given a personal chair in the University College, Cardiff. From\n1982\nto\n1985\nhe served as Dean of Science.\nWe have already indicated the contents of Wiegold's thesis, the main results of which he published in\n1959\n. This was not his first paper, however, for he had already published\nGroups with boundedly finite classes of conjugate elements\nin the Proceeding of the\nRoyal Society of London\nin\n1957\n. In\n1960\n, in addition to the paper with\nHanna Neumann\nmentioned above and a short paper\nOn a note of B H Neumann\n, Wiegold published two further papers\nOn direct factors in groups\nand\nSome remarks on generalised products of groups with amalgamations\n. In the first of these two papers he proved that a group\nG\nG\nG\nhas the property that every normal subgroup is a direct factor if and only if\nG\nG\nG\nis a restricted direct product of simple groups, while the second paper extended the results of his earlier paper\nNilpotent products of groups with amalgamations\n. In\n1962\nhe published two papers on embeddings, namely\nEmbedding group amalgams in wreath products\nand\n(\nwith\nBernhard Neumann\n)\nOn certain embeddability criteria for group amalgams\n.\nThe range and quantity of Wiegold's mathematics make it impossible to give here anything other than an impression of the many areas on which Wiegold worked and the remarkable range of his co-authors. We shall, however, indicate two topics which were important to Wiegold and on which he devoted continued effort over many years. The first is the theory of the Schur multiplicator\n(\nor multiplier\n)\n: his papers on this topic include\nMultiplicators and groups with finite central factor-groups\n(1965)\n,\nThe multiplicator of a direct product\n(1971)\n,\nSome groups with non-trivial multiplicators\n(1971)\n,\n(\nwith Michael Jones\n)\nA subgroup theorem for multipliers\n(1973)\n, and\n(\nwith Michael Jones\n)\nIsoclinisms and covering groups\n(1974)\n. In\n1981\nWiegold gave a five-lecture survey entitled\nThe Schur multiplier: an elementary approach\nat the first Groups St Andrews conference. In his introduction, he said:-\nThe aim is to take a little corner of the study of multipliers, namely the specifically 'group-theoretic' corner, and talk about that in as self-contained a manner as possible.\nThe article Wiegold wrote for the conference Proceedings based on these lectures is today the most cited of all his\n127\npapers. Having mentioned Wiegold's most cited paper, let us note that his second most cited paper is\nGroups with all subgroups normal-by-finite\n(1995)\nwhich he wrote jointly with John Lennox,\nBernhard Neumann\nand Howard Smith.\nWe promised to mention two topics that were particularly important to Wiegold: the second is growth sequences. If\nd\n(\nG\nn\n)\nd(G^{n})\nd\n(\nG\nn\n)\ndenotes the minimum number of generators of the\nn\nn\nn\nth power of a group\nG\nG\nG\n, then growth sequences study the asymptotic behaviour of the sequence\n(\nd\n(\nG\nn\n)\n)\n(d(G^{n}))\n(\nd\n(\nG\nn\n)\n)\n. Between\n1974\nand\n1980\nhe published four articles entitled\nGrowth sequences of finite groups\n, all in the Journal of the\nAustralian Mathematical Society\n. In\n1978\n, jointly with John S Wilson, he published\nGrowth sequences of finitely generated groups\nand, in\n1989\n, a second part appeared written jointly by Wiegold and Alastair G R Stewart. In\n1990\n, at the\n21\nst\nAnnual Iranian Mathematics Conference held in Isfahan, he gave a survey entitled\nGrowth sequences\n.\nWiegold's papers are a joy to read. He had a wonderful feel for the important questions in his subject and he initiated research into a great variety of areas which are active today. His papers are highly readable, simply and honestly written with a clarity that brings out the significant ideas. Also his papers are rich in conjectures and unsolved problems. Let us illustrate this by quoting from his\n1981\nsurvey on the Schur multiplier\n(\nmissing out technical statements of the problems and his comments on what is already known\n)\n:-\nHere is a fantastically difficult problem.\n[\nProblem\n5\n.\n3]\n... although I like Problem\n5\n.\n3\n, I think it will be a long time before anything happens to it. In this area, problems are easy to invent. ...\nPerhaps the most persistent problem is\n[\nProblem\n6\n.\n1]\n. ... we do not know the answer to\n[\nProblem\n6\n.\n2]\n... One might have more luck with\n[\nProblem\n6\n.\n3]\n. Kite-flying, I know: but I guess that something more about the elusive multiplier will be discovered if it is tackled.\nBefore leaving our discussion of Wiegold's research, we mention the importance he put on checking the correctness of any results from papers by other authors which he had used in the proof of his own theorems. Whenever he used a result he felt bound to check the proof of that result so as to ensure its correctness as well as the correctness of his own arguments.\nA major contribution by Wiegold came from his editorial appointments which included being a Member of the Editorial Board of the\nLondon Mathematical Society\n(1973\n-\n74)\n, Secretary of the Journal of the\nLondon Mathematical Society\n(1974\n-\n77)\n, and Joint Editor in Chief\n(\nwith Desmond Evans\n)\nof the Proceedings of the\nLondon Mathematical Society\n(1986\n-\n1992)\n. He translated many articles and books from Russian into English, and this led to him serving as Assistant Editor of Sbornik Mathematics starting in\n1994\n. He also held important posts in the administration of UK mathematics, for example as a Member of the Mathematical Sciences Subcommittee of the University Grants Committee\n(1981\n-\n86)\nand Chairman of the British Mathematical Olympiad Committee\n1997\n-\n98\n.\nWiegold spent research visits of up to three months at the Institute of Advanced Studies, Australian National University\n(1965)\n, Adelaide\n(1973)\n, Aachen\n(1978)\n, York University, Toronto\n(1979)\n, Western Michigan\n(1982)\n, Manitoba\n(1982)\n, York University, Toronto\n(1982)\n, Padova\n(1986)\n, Aachen\n(1986)\n, and Napoli\n(1988)\n. He was a plenary speaker at many conferences including 'Groups St Andrews\n1981\n' in St Andrews, Scotland\n(1981)\n, Botswana\n(1981)\n, 'Group theory' in Bressanone, Italy\n(1989)\n, 'Groups - Canberra\n1989\n' at A.N.U. Canberra\n(1989)\n, Trento, Italy\n(1992)\n, Western Michigan\n(1992)\n, 'Infinite groups\n1994\n' in Ravello, Italy\n(1994)\n, and 'Groups Galway' in Galway, Ireland\n(1995)\n. He also was a colloquium speaker at universities in Britain, Ireland, Germany, Canada, USA, India, Australia and Zimbabwe.\nLet us end this biography with some quotes from those who knew him best. Joe Buckley writes\n[\n2\n]\n:-\nJim was the best colleague I ever had. The time of collaboration with him was the most satisfying period in my professional life ... he was the most generous mathematician I ever met.  He didn,t guard his maths problems.  He enjoyed sharing them with others.\nHis daughter, Alison Sharrock, writes\n[\n3\n]\n:-\nInside the successful mathematician there was always a linguist struggling to get out. It was a particular delight to him when the two interests met, both in his translating of Russian mathematical articles into English and also in the publication of mathematical work in Welsh. He was equally fascinated by English, considering Middle English the most beautiful language ever and wishing he had time to master Anglo-Saxon. One of his longest standing interests was in place names; the Oxford Dictionary of English Place Names acquired a near-mystical significance for him.\nJohn Lennox writes:-\nJim had a sharp wit but was never unkind.  He also had a tremendous sense of humour.  ...\n[\nHe\n]\nwas an interesting man because he was interested in virtually everything, and we all loved his conversation.  I can see him now, walking down Senghenydd Road, talking animatedly and every so often pausing to uproot a buddleia plant, muttering under his breath that he was saving the Cardiff council money by preventing the cracking of pavements and walls. He had an infectious sense of wonder at creation and was fascinated by all aspects of learning, science, literature, language and music.  I vividly recall watching him give an amazing performance of Gilbert and Sullivan that one would have thought challenging to one of Jim's athletic build.  He was equally at home singing regularly in the church choir.\nFinally we quote from Jeff Griffiths who writes about Wiegold's love of mathematics at all levels\n[\n2\n]\n:-\nProbably Jim's fondest activity was running the Maths Club for local school children with\nJohn Rigby\n- a task which he enthusiastically continued right up to the last few months of his life. Indeed, when I visited him at the hospice a few days before his passing, his last words to me\n(\neven though he was desperately ill\n)\nwas that he needed to get home so he could prepare the Maths Problem Sheet for the next meeting of the Club in October. The school pupils who attended the Maths Club absolutely adored him.",
  "math_areas": [
    "Logic"
  ]
}