{
  "nome_completo": "James Whitbread Lee Glaisher",
  "nome_curto": "James Whitbread Lee Glaisher",
  "ano_nascimento": "1848",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Glaisher/",
  "lugar_nascimento": "Lewisham, Kent, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "James Whitbread Lee Glaisher\nwas known as Lee within his family. His mother was Cecilia Louisa Belville and his father, a leading mathematician and astronomer, was named James Glaisher. James senior worked at the Royal Observatory where he was the Superintendent of the Magnetical and Meteorological Department, and he had married Cecilia, the daughter of Henry Belville who was an assistant at the Observatory for forty years. Before examining Lee's biography, let us note that his father was the first to recognise the existence of the stratosphere. He made balloon ascents which are described in the Report of the Council of the\nRoyal Astronomical Society\nof\n1862\n:-\nOne of the main objects of\n[\nGlaisher and Coxwell's\n]\nascents was to extend and improve our knowledge of the relation which exists between increase of elevation and the corresponding variations of temperature and moisture, these variations in their turn having an intimate bearing on the theoretic determination of atmospheric refraction. The results of Mr Glaisher's observations indicate that the\n[\ncurrent\n]\nhypothesis ... must be abandoned ...\nLee was his parents' eldest son, having one brother named Ernest and one sister. We should say a little about relations between family members to show the environment in which he was brought up. Certainly family life was happy during the first decade of Lee's life, but later it became strained. Cecilia was an artistic lady whose temperament made it difficult for her to live the highly regulated life her husband wanted. Lee, as one might expect, inherited certain characteristics from each parent: like his father he was extremely conscientious, to the degree that it made both of them difficult people to live with; like his mother he was socially retiring with a love of things artistic.\nHe attended St Paul's School in London from\n1858\n, where he became somewhat of a celebrity when he was made two balloon ascents with his father in\n1861\n. In fact his father played a major role in directing Lee's education at St Paul's to the extent that his fellow pupils were very aware of the unusual degree of his involvement. Lee showed himself a highly gifted mathematician, winning a Campden Exhibition in\n1867\nto study at Trinity College, Cambridge. He entered Cambridge in October\n1867\nand he was awarded a scholarship one year later for his outstanding performance. His mathematical researches began while he was still an undergraduate and he wrote a paper on the sine integral, cosine integral, and exponential integral, giving tables of these integrals which he had computed himself. The paper was communicated to the\nRoyal Society\nby\nCayley\n.\nIn the final examination of\n1871\nGlaisher was placed second\n[\n6\n]\n:-\nAs he went up to receive his degree the undergraduates who had gathered in the gallery at the Cambridge Senate House began to sing a music hall ditty entitled 'Up in a balloon, boys'. The students, like his schoolfellows, evidently associated him with his father's exploits.\nElected to a fellowship at Trinity College in\n1871\n, he became a tutor and lecturer and taught at Cambridge all his life. In the same year in which he graduated Glaisher joined the\nRoyal Astronomical Society\nand so began a long association with that Society. In\n1872\nhe joined the\nLondon Mathematical Society\n. He went on to hold high office in both these Societies, being Secretary of the\nRoyal Astronomical Society\nfrom\n1877\nto\n1884\n, then President from\n1886\nto\n1888\nand again from\n1901\nto\n1903\n. He was President of the\nLondon Mathematical Society\n1884\n-\n1886\n. He served on the Council of the\nRoyal Astronomical Society\nfrom\n1874\nuntil his death\n54\nyears later. He also played an important role in the\nBritish Association for the Advancement of Science\n. He joined the Association in\n1869\n, being appointed to the Committee on Mathematical Tables in\n1872\n. He was Secretary of Section A, then President of the Section in\n1890\n. His presidential address, given at Leeds on\n4\nSeptember\n1890\n, was on\nMathematical and Physical Science\n. In this address he explained what he considered pure mathematics to be:-\nBy pure mathematics I do not mean the ordinary processes of algebra, differential and integral calculus etc., which every worker in the so-called mathematical sciences should have at his command. I refer to the abstract sciences which do not rest upon experiment in the ordinary sense of the term. Their fundamental principles are derived from observations so simple as to be almost axiomatic. To this class belong the theories of magnitude and position, the former, including all that relates to quantity, whether discrete or continuous, and the latter to all branches of geometry.\nDuring his time as a lecturer at Cambridge Glaisher had many interests. He was a keen cyclist, riding a 'penny-farthing' bicycle, and also a keen walker striding out at a speed few could match. He also found great pleasure in travelling enjoying frequent visits to the Continent and to the United States. Two favourite hobbies were reading and collecting pottery, although he took them so seriously that it seems somewhat inappropriate to call them hobbies. We say more below about his pottery collection but let us record here his lifelong passion for reading led to him amass of vast library which he bequeathed to Cambridge University.\nGlaisher wrote over\n400\narticles on his main interests of astronomy,\nspecial functions\n, calculation of numerical tables,\nnumber theory\n, and the history of mathematics. His historical interests were on the early development of numerical computation,\nStevin\nand the beginnings of the decimal system,\nNapier\n,\nBriggs\nand the beginnings of logarithms as well as the mathematical notation + and -. He applied special functions to problems in number theory, in particular representations of integers as sums of squares.\nThe importance of Glaisher is less in the original research he did, much more in that he brought these mathematical topics into the Cambridge syllabus so setting it up to produce the outstanding English mathematicians who were educated there shortly afterwards.\nForsyth\n, writes in\n[\n3\n]\n:-\nThe earliest years of his teaching at Cambridge were a time of transition in the mathematical ideals of the University.\nCayley\nwas almost a voice in the wilderness; Glaisher himself described Cambridge pure mathematics as generals without armies. When he had ceased teaching, Cambridge pure mathematics had marched beyond his active vision mainly under men whom, as students, he had guided at the beginning. His voice was that of a teacher, yet not in the least similar to the great Cambridge coaches, for he contributed to his science and ranged far beyond conventional examination learning. He was a personality in his day; and he left a name, high among the noted names of his generation, in two widely different fields of constructive thought and human activity.\nHunt\n[\n5\n]\nwrites that Glaisher:-\n... was an extraordinary teacher who inspired others to accept positive attitudes to research. He was less concerned with the necessity of teaching pupils how to pass examinations than he was giving them a wide-ranging interest in the subject. He applied this all-embracing and open approach to every activity in which he became interested and that is one reason he was able to excel in a number of different fields. ... During lectures at the University he dealt with his subjects explicitly, if in an unorthodox manner. He spoke clearly and used blackboard illustrations freely. At the end of a lecture his gown was often covered with chalk dust.\nGlaisher received many honours. He was elected a Fellow of the\nRoyal Society\nin\n1875\n, served three terms on its council, received the Society's\nSylvester\nMedal in\n1913\n, and was vice-president in\n1917\n-\n19\n. He received the\nDe Morgan\nMedal of the\nLondon Mathematical Society\nin\n1908\n. He was elected a Fellow of the\nRoyal Society of Edinburgh\n, the\nNational Academy of Sciences\nin the United States, and was awarded an honorary degree by Victoria University Manchester\n(1902)\nand the University of Dublin on the occasion of their tercentenary. He also served as president of some Societies with interests far removed from mathematics being president of the Cambridge Antiquarian Society and the Cambridge University Bicycle Club from\n1882\nto\n1885\n. He was president of the Cambridge Philosophical Society\n1882\n-\n84\n, and elected an honorary fellow of the Manchester Literary and Philosophical Society.\nOne honour, which it is almost certain he was offered, was the office of Astronomer Royal. It is believed that Glaisher was offered this post when\nAiry\nretired in\n1881\nbut that he declined\n[\n5\n]\n:-\nAcceptance would have meant that he would have been obliged to leave his beloved Cambridge for Greenwich and lose the security he obviously felt as a resident of Trinity. It is also highly likely that he was plagued by recollections of traumatic events which took place at Greenwich during his adolescence.\nNow if being Astronomer Royal was one post offered to Glaisher that he turned down, one which he would dearly have loved to accept was the Sadleirian Chair. It became vacant in\n1895\nwhen\nCayley\ndied but A R Foster, one of Glaisher's pupils, was appointed rather than Glaisher himself. There is no obvious reason why he should have been passed over for the Chair. However, Hunt suggests\n[\n5\n]\n:-\nSoon after his appointment to the post of Lecturer at Trinity he began to campaign for the reform of the Cambridge Tripos Examination. This may have not impressed all members of the Establishment and in the pursuit of what he deemed to be correct he may have failed to cultivate the good offices of men who were well placed to help him in his career.\nWe should also say a little about the important editorial work done by Glaisher. He edited both the\nMessenger of Mathematics\nand the\nQuarterly Journal of Mathematics\n. In both cases he began as one of a team of editors and ended up as the sole editor. We should note one particularly important result of his editorial work with the\nMessenger of Mathematics\n.\nThomas Fiske\nwas an American who spent time at the University of Cambridge while undertaking graduate studies. He wrote that:-\n... from Dr J W L Glaisher, who made me an intimate friend, who spent many an evening with me in heart to heard talks, who took me to meetings of the\nLondon Mathematical Society\nand the\nRoyal Astronomical Society\n, and entertained me with gossip about scores of contemporary and earlier mathematicians, I gained more in a general way than from anyone else.\nWhat had this to do with the\nMessenger of Mathematics\n? Well, after\nFiske\nreturned to the United States he went on the organise the\nNew York Mathematical Society\n(\nwhich became the\nAmerican Mathematical Society\n)\nand set up the\nBulletin\nof the\nNew York Mathematical Society\nbased on the format of the\nMessenger of Mathematics\nthat Glaisher had established.\nOne of Glaisher's hobbies was collecting works of art\n[\n2\n]\n:-\n... he will be remembered as one of the leading pottery collectors of his time. His attention in this direction was at first occupied by Delft ware, but from the Dutch pottery he was led to take an interest in the English wares made in emulation of it, and so in other types of English pottery of early date.\nForsyth\n[\n3\n]\ndescribes the affect on his rooms at Cambridge:-\n... his collections never ceased to grow, always under his earnest care. ... his collections outgrew available space, downstairs, upstairs, even in his remote bedroom. He was granted an additional set of rooms at the top of his staircase and next to the upper floor of his own set; they, too, soon were filled. He then hired a sort of warehouse, that also became filled in due course. ... the Fitzwilliam Museum ... granted him a room\n(\nalso soon filled\n)\nin the new wing...\nAs to Glaisher's character,\nForsyth\ntells us\n[\n3\n]\nthat:-\nHis smile of appreciation was delightful and infectious; when appreciation waxed into admiration, his attractive eyes would glow in his enthusiasm. Singularly fluent, he never aimed at eloquence in speech, yet dignified passages abound in his formal addresses. ... There was no shred of pomposity in his bearing, which was frank and simple.",
  "math_areas": [
    "Calculus",
    "Number Theory"
  ]
}