{
  "nome_completo": "Jan Geniusz Mikusiński",
  "nome_curto": "Jan Mikusiński",
  "ano_nascimento": "1913",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mikusinski/",
  "lugar_nascimento": "Stanislawów, Austrian-Hungarian Empire (now Ivano-Frankivsk, Ukraine)",
  "lugar_morte": "Katowice, Poland",
  "biografia": "Jan Mikusiński\n's parents were Kazimierz Geniusz Mikusiński\n(1882\n-\n1942)\nand Anna Beldowska\n(1889\n-\n1960)\n. Kazimierz was an Austrian officer and a secondary school teacher in Stanisławów, but he was originally from Lithuania. In fact, the family name of Mikusiński had a strange origin. Kazimierz's father, the paternal grandfather of the subject of this biography, was Jan Geniusz who lived in Lithuania in an area which had been Poland before the partition of that country in the\n18\nth\ncentury. Jan Geniusz took part in the January Uprising of\n1863\n, which began when Poles objected to being conscripted into the Russian Army. The uprising was put down and those who took part were executed or deported. Jan Geniusz fled to Austria but later returned to Lithuania having changed his name to Mikusiński to avoid reprisals. Jan Geniusz was married to Berta von Lesser, a Swedish pianist and pupil of Franz Liszt. Jan Mikusiński's maternal grandparents were Leopold Beldowski, an Austrian nobleman, and Emilia Skomorowska. Kazimierz and Anna Mikusiński had four children, Władysław, Jan, Franciszek, and Stefan. The youngest, Stefan, died aged four.\nPoland was in a difficult position during World War I since it was partitioned between countries that were at war with each other. However, most Poles saw the war as an opportunity for the country to regain its independence. As the Red Army advanced from the east, the Mikusiński family fled in\n1917\nto Austria and lived for a year in Vienna. In March\n1918\nthe Soviet government relinquished control of their part of Poland. This, of course, did not by itself unite Poland since World War I was still in progress. After the war ended with the surrender of the Central Powers, Poland proclaimed itself independent on\n11\nNovember\n1918\n. The Mikusiński family returned to Poland and lived for a while in Rogozno, about\n40\nkm north of Poznań, before settling in Poznań. In\n1918\nthe family began again to use the name Geniusz but retained Mikusiński. Jan's school education was in Poznań. He entered the Ignacy Jan Paderewski Humanistic\nGymnasium\nin\n1923\nand studied there for five years. However, he showed a special aptitude for mathematics so his parents decided that he would receive an education more suited for his interests at the Gotthilf Berger Gymnasium so he studied there between\n1929\nand\n1932\n.\nAlthough Mikusiński excelled in mathematics, it was engineering that had always been his main interest. However, his health was very fragile and he felt that he would not be physically able to become an engineer so, after beginning his studies in\n1932\nat the University of Poznań, he concentrated on mathematics. His health did not allow him to continue even with mathematics and he took a break of about three years before his health recovered sufficiently to enable him to continue his studies. He graduated with a Master's Degree on\n3\nDecember\n1937\n. He remained at the University of Poznań where he was appointed as an assistant. At the start of World War II in\n1939\n, Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged attack - the Germans from the west and the Russians from the east - quickly defeated the Polish army. The University of Poznań was closed down by the occupying  German forces in October\n1939\nand many of the faculty were arrested - Mikusiński fled to Kraków. He spent the war years, partly in Kraków and partly in Zakopane\n[\n16\n]\n:-\nHe took an active part in secret education of secondary school pupils and students in Kraków. Because of the teaching activity he was arrested twice by the occupying Nazi force. He also took part in Professor\nTadeusz Ważewski\n's underground seminar together with a group of Kraków mathematicians. The participants of\nWażewski\n's seminar, in\n1943\n, were the first persons to come in contact with a new theory which is now very well known in the world of mathematics as the Mikusiński operational calculus. The objects of the theory, operators, provide a common generalization of numbers and locally integrable functions on the positive half-line. The author first called them \"hypernumbers\" and gave this title to a paper containing the main ideas of the theory.\nIn\n1983\nStudia Mathematica\npublished an English translation of\nHypernumbers\n. The paper contains a Preface explaining its wartime origins:-\nThis paper is quite unusual. It is not a new paper. It has been published already\n(\nin Polish\n)\n, but the size of the first edition and the circumstances of its publication were out of the ordinary. The edition was limited to seven copies, and printing was made by the author himself by using X-ray films. The matter will become clear when we add that the paper appeared in Kraków, in the year\n1944\n, during the Nazi occupation of Poland. It also explains why the author conceals his identity under the initials J.G.-M., and why only initials appear in the acknowledgement at the end of the author's introduction. The time has come to solve this riddle. The letters J.G.-M. stand for Jan G.-Mikusiński\n(\nG, being the first letter of Geniusz, the author's patronymic, which he later abandoned\n)\n. This name is well known nowadays in the world of mathematics. It belongs to an eminent Polish mathematician ... The paper 'Hypernumbers' represents the first version of the Mikusiński operational calculus\n(\nimproved afterwards by the use of the Titchmarsh theorem\n)\nand contains already the main ideas of this theory. The date of the edition of the paper is\n1944\n, but the results were already presented by the author in\n1943\n, during one of the secret wartime seminars conducted by Professor\nTadeusz Ważewski\nin Kraków.\nIn January\n1945\nSoviet forces liberated Kraków from the German occupation. Even before that Mikusiński had been undertaking research advised by\nTadeusz Ważewski\n, but once the city was liberated, he was able to obtain an official position at the Jagiellonian University of Kraków. He submitted his Ph.D. thesis\nSur un problème d'interpolation pour les intégrales des équations diffèrentielles linéaires\nand, after defending it, was awarded the degree on\n25\nJuly\n1945\n. The Germans had opened a new German University of Poznań in\n1941\n, but it was not well received; it operated until\n1944\n. By the time Mikusiński was awarded his Ph.D., the Polish University of Poznań had reopened and he was able to return there and take up a position as assistant professor in the department headed by\nWładysław Orlicz\n. He held this position for the academic year\n1945\n-\n46\nduring which time he also taught at the Engineering School in Poznań. On\n28\nFebruary\n1946\nhe\nhabilitated\nat the Maria Sklodowska-Curie University of Lublin and was appointed as a\ndocent\n. On\n15\nOctober\n1947\nhe was promoted to associate professor of mathematics at Lublin, a position he held for a year. He was appointed to the University of Wrocław as an associate professor of mathematics on\n30\nOctober\n1948\nand he remained there until August\n1955\nwhen he was appointed to the University of Warsaw.\nOn\n20\nNovember\n1948\nthe Polish government set up the State Mathematical Institute. Just before the outbreak of World War II, Poland had been planning two research institutes, one for pure mathematics and one for applied mathematics. However, this plan was put on hold when war broke out and, during the six years of war, the educational system severely damaged. The Institute, opened in\n1948\n, was based on the earlier planned two Institutes, but they were merged into a single mathematics institute, divided into sections which correspond to the particular areas of mathematics. Mikusiński worked at the State Mathematical Institute from its foundation. He submitted a collection of his papers under the title\nA new approach to the operational calculus\nfor a degree similar to the present D.Sc. and he was awarded the degree on\n10\nDecember\n1955\n. He was promoted to full professor on\n4\nFebruary\n1958\n. Jan Mikusiński married Urszula and their son Piotr Jan Mikusiński was born in\n1956\n. Piotr Mikusiński became a mathematician with interests similar to those of his father. He was awarded a doctorate from the Institute of Mathematics of the\nPolish Academy of Sciences\nin\n1983\nfor his thesis\nConvergence of Boehmians\n. He is currently professor of mathematics at the University of Central Florida, Orlando, United States.\nLet us look now at some of the contributions which Mikusiński submitted for his D.Sc. Rudolf Hilfer, Yury Luchko and Zivorad Tomovski write in\n[\n7\n]\n:-\nIn the\n1950\n's, Jan Mikusiński proposed a new approach to develop an operational calculus for the operator of differentiation\n(\nsee J Mikusiński, Operational Calculus\n(\nPergamon Press, New York,\n1959))\n. This algebraic approach was based on the interpretation of the Laplace convolution as a multiplication in the ring of the continuous functions on the real half-axis. The Mikusiński operational calculus was successfully used in ordinary differential equations, integral equations, partial differential equations and in the theory of special functions. It is worth mentioning that the Mikusiński scheme was extended by several mathematicians to develop operational calculi for differential operators with variable coefficients ...\nArthur Erdélyi\n, reviewing the Polish version of Mikusiński's book\nThe Calculus of Operators\n(1953)\n, writes:-\nMikusiński's book is a remarkable, and pioneering, venture. It presents a modern and abstract mathematical theory, in a completely elementary manner, to students of physics and engineering. Although the essence of the author's theory is the extension of a ring to a field, and the introduction of a suitable topology in this field, the terms ring, field, topology do not occur in the book. The exposition is precise but never abstract. The analogy with the extension of the number concept from integers to rationals to reals is pointed out. No knowledge of algebra or topology, and no training in abstract thinking, is required. The author assumes that the reader is familiar with the notions of limit, continuity, convergence, but not necessarily with uniform convergence\n(\nwhich is explained in the book together with the principal theorems relating to it\n)\nor\nEuler\n's integral of the second kind and the gamma function\n(\nwhich are also explained\n)\n. By and large, freshman and sophomore calculus are not quite sufficient for reading this book, a good course in advanced calculus is more than sufficient.\nHenry Schaerf, reviewing the second Polish edition of Mikusiński's\nThe Calculus of Operators\n(\npublished in\n1957)\n, writes\n[\n14\n]\n:-\nIn several papers the author has published a theory containing a direct justification of the\nHeaviside\nCalculus as opposed to the various well known indirect methods using functional transforms. The purpose of the book under review is to present this theory and its applications both to engineers primarily interested in the use of efficient computational procedures and to readers desiring to understand why these procedures work. To reach such a heterogeneous readership, the author uses the text-book approach and leads the reader gently and with great skill from a completely elementary level to rather abstract concepts.\nMikusiński's career took an unfortunate turn shortly after he became a full professor. He developed serious eye problems which made teaching and research almost impossible and he requested a period of sick leave in which he might recover his health. His request, however, was refused so he resigned his professorship on\n10\nSeptember\n1959\n. The State Mathematical Institute had become the Mathematical Institute of the\nPolish Academy of Sciences\nafter the Academy was founded in\n1952\nand Mikusiński retained his position at the Institute. In\n1960\nMikusiński moved to Katowice. Krystyna Skornik writes\n[\n16\n]\n:-\nHis arrival to Katowice was an event of great importance for the mathematicians working there. Shortly afterwards a group of young mathematicians from the Higher Pedagogical School in Katowice got in touch with him. The Professor delivered for them a series of lectures on operational calculus. After a year, the lectures turned to a regular seminar, first held at the Higher Pedagogical School, then at Mikusiński's home. The participants of this seminar ... remember the unique atmosphere of these meetings, discussions at a blackboard hanging in the garage or on the terrace, the rooms replacing a seminar room. The informal scientific contacts of Professor Mikusiński with Silesian mathematicians became formal only in\n1966\nwhen the Mathematical Laboratory\n(\nnow the Branch of the Mathematical Institute of the\nPolish Academy of Sciences\n)\nwas established.\nPiotr Antosik and Andrzej Kaminski discuss Mikusiński's seminar in Katowice in\n[\n2\n]\n:-\nThe topics of the seminar were closely connected with the mathematical interests of Professor Jan Mikusiński and included the operational calculus, generalized functions, convergence structures and integration theory. In\n1966\nthe members of the seminar organized in Katowice an international conference on generalized functions, in which about seventy mathematicians took part, among them those as eminent as\nSergei Sobolev\n,\nLaurent Schwartz\n,\nJean Dieudonné\n,\nGeorge Temple\n, Hikosaburo Komatsu, Thomas K Boehme and others. Members of the seminar were invited to many mathematical centres all over the world. In the period of the duration of the seminar\n(1960\n-\n1987)\nits members published several books\n(\nmore than\n20\neditions altogether\n)\nand about\n250\nscientific papers. Eight members of the seminar received their Ph.D.'s, two of them were habilitated and then two were promoted to the position of full professor.\nThe existence of the seminar led to the establishment of the Katowice Branch of the Institute of Mathematics of the\nPolish Academy of Sciences\nwhich Mikusiński headed from its founding in\n1966\nuntil\n1985\n. Mikusiński had, before the founding of the Katowice Branch of the Institute of Mathematics, been made head of the Department of Mathematical Analysis in the Mathematical Institute of the\nPolish Academy of Sciences\n.\nWe should mention a number of Mikusiński's books in addition to\nThe Calculus of Operators\n(1953)\nwhich we discussed above. The list of his publications given in\n[\n8\n]\nlists\n26\nbooks including:\n(\nwith Stanisław Hartman\n)\nTheory of measure and Lebesgue integral\n(\nPolish\n)\n(1957)\n, English edition published under the title\nThe theory of Lebesgue measure and integration\n(1961)\n;\n(\nwith\nRoman Sikorski\n)\nThéorie élémentaire des distributions\nⓉ\n(\nElementary theory of distributions\n)\n(1964)\n;\n(\nwith Piotr Antosik and\nRoman Sikorski\n)\nTheory of distributions. The sequential approach\n(1973)\n;\nThe Bochner integral\n(1978)\n;\nOperational calculus. Vol\n.\nI\n(1983)\nand\n(\nwith Thomas K Boehme\n)\nOperational calculus. Vol.\nII\n(1987)\nand\n(\nwith Piotr Mikusiński\n)\nAn Introduction to Analysis: From Number to Integral\n(1993)\n. This last mentioned work, a collaboration between Mikusiński and his son Piotr, is described by the Publisher\n(\nWiley\n)\nas follows:-\nBased on the lifetime work of leading teacher and researcher Jan Mikusiński, this classroom-tested book provides a thorough grounding in mathematical analysis, calculus and mathematical proofing. It introduces natural numbers through a new mathematical approach; replaces the\nRiemann\nintegral with the more general\nLebesgue\nintegral; and rigorously develops the real number system from four simple axioms of natural numbers. Additional features include a wider range of problems than other texts - including simple and routine as well as problems requiring more in depth creativity, answers to common questions, a new approach to the concept of equivalence relation which simplifies the construction of real numbers, and a large number of computational applications.\nMikusiński received numerous honours, prizes and awards. He was awarded  the\nBanach\nPrize by the\nPolish Mathematical Society\nin\n1950\n, he received the National Prize\n(\nClass II\n)\nin\n1953\n, the University in Rostock awarded him an honorary degree in\n1970\n, he was elected to the Serbian Academy of Sciences and Art in\n1975\n, the\nPolish Mathematical Society\nmade him an Honorary Member in\n1984\nand he received the\nSierpiński\nMedal from the\nPolish Mathematical Society\nand Warsaw University in\n1985\n.\nDuring the\n27\nyears that he spent in Katowice, Mikusiński struggled to overcome health problems\n[\n8\n]\n:-\nIn spite of bad conditions of his health, he was a very active researcher and worked to the last days of his life.\nJan Mikusiński died on\n27\nJuly\n1987\nand was buried on the cemetery in Katowice. When\nStudia Mathematica\npublished Mikusiński's\n1944\npaper\nHypernumbers\nin\n1983\nit was to celebrate both the\n40\nth\nanniversary of the original publication and Mikusiński's\n70\nth\nbirthday. We end this biography with the final words from the\n1983\nPreface:-\nWe would like to thank\n[\nProfessor Jan Mikusiński\n]\nfor all the theories and theorems with which he has enriched Polish and world mathematics and for his constant pursuit of beauty, simplicity and elegance in mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}