{
  "nome_completo": "Jan de Witt",
  "nome_curto": "Jan de Witt",
  "ano_nascimento": "1625",
  "ano_morte": "1672",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Witt/",
  "lugar_nascimento": "Dordrecht, Netherlands",
  "lugar_morte": "The Hague, Netherlands",
  "biografia": "Jan de Witt\nattended Beeckman's school in Dordrecht, then in\n1641\nhe entered the University of Leiden to study law. At university he showed remarkable talents, especially in mathematics and law. In\n1645\nJan and his elder brother Cornelius visited France, Italy, Switzerland and England, then on his return Jan lived at The Hague as an advocate from\n1647\nto\n1650\n. He had received a doctorate in law from University of Angers in\n1645\n.\nDe Witt was an associate of\nvan Schooten\nand lived for a while in his house. His most important work\nElementa curvarum linearum\nⓉ\n(\nElements of curves\n)\n(1659\n-\n61)\nwas finished in\n1649\n, and was the first systematic development of the analytic geometry of the straight line and\nconic\n. It was published by\nvan Schooten\nas part of his edition of\nDescartes\n'\nGéometrie\n(1660)\n. We look briefly at the work and the part played by\nvan Schooten\nin its eventual publication below. At this point we note that the reason for this long delay was that de Witt held high office in Holland  during the period following completion of the book and he was too occupied with his political work to do the necessary editing to prepare it for publication.\nIn\n1650\nde Witt was appointed Pensionary of Dordrecht, the leader of Dordrecht's deputation in the government of Holland. Three years later he was appointed Grand Pensionary of Holland; this was the office of the Government Attorney\n(\ncounsel for the defence of the rights of Holland\n)\nwhich effectively combined the offices of Prime Minister and Foriegn Secretary making de Witt the political leader of Holland. As leader of Holland, de Witt applied his mathematical knowledge to the financial and budgetary problems of the republic. He wrote\nThe Worth of Life Annuities Compared to Redemption Bonds\nwhich applied\nprobability\nto questions of state finance. De Witt brought about peace with England in\n1654\nand after this he was extremely successful in bringing prosperity to Holland. When war broke out again with England in\n1665\nde Witt was able to bring about a very satisfactory settlement at the Treaty of Breda\n(1667)\n. His political skills were further seen in the Triple Alliance\n(1668)\nbetween the Dutch Republic, England and Sweden.\nIn\n1672\nFrance invaded and there were demonstrations against de Witt. His brother Cornelius was arrested on July\n24\nand two weeks later Jan de Witt resigned as political leader of Holland. When Jan came to visit Cornelius in prison they were attacked and killed by a large crowd. Quoting\n[\n2\n]\n:-\nCornelius was put to the torture and on August\n19\nsentenced to deprivation of his offices and banishment. His brother came to visit him in the Gevangenpoort at The Hague. A vast crowd, hearing this, collected outside and finally burst in, seized the two brothers, and tore them to pieces. Thus perished one of the greatest statesmen of his age and of Dutch history.\nLet us look now at de Witt's major mathematical work, the\nElementa curvarum linearum\nⓉ\n(\nElements of curves\n)\n. In the book he explains his intentions. He was annoyed that well known conic sections, which are clearly plane curves, were generated by three dimensional means. He wrote in the work:-\nWhen I studied more carefully the books on the curved lines - as far as they have been transmitted by the Ancients and explained by later mathematicians - I thought it absolutely against the natural order, which in mathematics one should respect as much as possible, to seek the origin of these curves in a solid and then transfer them to the plane.\nLet us point out that the word\ndirectrix\nwas first used by de Witt and appears in this work.\nVan Schooten\nplayed a major role in getting the book published. He wrote to de Witt in\n1658\n:-\nI like it very much, as I think the ideas are very original and the way in which you express yourself is very correct and clear.\nHe offered to help prepare the work for publication. On\n8\nOctober\n1658\nde Witt wrote a letter in which he expressed the view that before the main work\n(\nwhich is now part II of the text\n)\n, a preceding \"brief treatise\" must be published\n(\nnow part I of the text\n)\n. In fact in the published part I occupies\n83\npages while part II is not much longer at\n97\npages. In the same letter Witt criticises\nApollonius\nwho, in his opinion, had made things much too complicated. His own methods he claims are much simpler.\nVan Schooten\nhelped prepare the text by editing it and drawing the figures with great precision. De Witt read the proofs and had the final say regarding changes to what\nvan Schooten\nproduced.\nLet us end by quoting the praise that\nHuygens\ngave to de Witt in a letter written to\nWallis\n6\nJune\n1659\n:-\nIn my opinion no century has been so abounding in mathematicians as ours, amongst whom this man even might have reached the first place, if he had been less occupied by his official duties.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Statistics"
  ]
}