{
  "nome_completo": "Jean Charles de La Faille",
  "nome_curto": "Jan-Karel della Faille",
  "ano_nascimento": "1597",
  "ano_morte": "1652",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/La_Faille/",
  "lugar_nascimento": "Antwerp, Dutch Republic (now Belgium)",
  "lugar_morte": "Barcelona, Spain",
  "biografia": "Jan-Karel della Faille\nor\nJean-Charles de La Faille\nwas born into a rich aristocratic family of Antwerp traders who were Jesuits. His father was Jean-Charles de La Faille, seigneur de Rymenam, while his mother was Marie van de Wouwere. Charles, the subject of this biography, attended the Jesuit school in Antwerp, joining the Jesuit Order on\n12\nSeptember\n1613\n. He spent two years at a Jesuit College in Malines before returning to Antwerp. De la Faille became a disciple of\nSaint-Vincent\n, whom he met in Antwerp where he was also influenced by François d'Aguilon. In\n1620\nhe went to France taking a theology degree at Dôle and teaching mathematics there. De la Faille taught at the Jesuit College of Louvain from\n1626\nuntil\n1628\nwhen, after a short stay in Lier, he left for Spain on\n23\nMarch\n1629\nwhere he was appointed as a professor at the Imperial College in Madrid.\nPhilip IV had become king of Spain and Portugal in\n1621\n. He led Spain and Portugal to victories up to\n1635\nbut then France declared war and he suffered defeats. De la Faille advised Philip IV on questions of defence and of military engineering during this period. La Faille also taught mathematics and military engineering in Madrid. He began teaching at the Imperial College in\n1629\n[\n2\n]\n:-\n... where he enjoyed a distinguished teaching career. Apart from the courses in the Royal Studies, he gave private lessons in mathematics to various members of the nobility and taught military arts and fortifications to the royal pages. In\n1638\nPhilip IV named della Faille Chief Cosmographer of the Council of the Indies ...\nIn fact there were\n21\nroyal pages. These young men, according to de la Faille's letters of April\n1639\n, 'enjoyed their classes.'\nIn\n1640\nPhilip IV suffered the loss of Portugal when it declared its independence. De la Faille helped Philip IV by serving as adviser on fortifications to the Duke of Alba along the Spanish-Portuguese border from\n1641\nuntil\n1644\n. He wrote to a colleague in the Spanish Netherlands in\n1642\n[\n3\n]\n:-\nIs it possible to find in Flanders some map of Portugal or Catalonia? I would be very grateful if you would tell me, so that I can have it brought here, because here we know very little about this country. I can see that the maps of Orrelius\n[\nmade in the\n1560\ns\n]\nare highly erroneous on Portugal and its frontiers so I am not surprised that our enemies, with smaller forces, are getting the better of us.\nAfter returning to Madrid after he three years of absence he wrote to a friend\n[\n4\n]\n:-\n... now his Majesty and his ministers are so occupied with these wars. ... and there is such a lack of money here that they cannot even attend to very urgent requests. ... I have found Madrid so changed that I scarcely recognise it: such is the need and poverty of the people. ... It is a shame to have to see things as they are: those persons who were once rich are suffering poverty today, and these wars destroy us. ... I study very little, for these times are not conducive to the quiet contemplation that our studies require.\nHe was, however, soon given new duties by Philip IV\n[\n2\n]\n:-\n... in\n1644\n[\nPhilip IV\n]\nappointed him preceptor to his illegitimate son Juan José de Austria. Della Faille soon became the prince's trusted advisor, and accompanied him on his military campaigns. The education that Juan José de Austria received from della Faille must have exerted a decisive influence on his interest in modern science, for he subsequently became Maecenas to Spanish scientists, employing as his personal physician such significant figures in Spanish scientific renewal as Juan Bautista Juanini.\nJuan José de Austria was the son of Philip IV and the actress Maria Calderón. De la Faille made military expeditions to Naples, Sicily and Catalonia with Juan José de Austria who was given his first military command in\n1647\nwhen sent to Naples to attempt to crush an uprising. In\n1651\nde la Faille accompanied him when he led the Spanish army against the rebellion in Catalonia. The army besieged Barcelona, the capital of the province, and in October\n1652\nthe city surrendered and de la Faille entered the captured city along with the army. He died in the in the city a month later.\nDe la Faille wrote\nTheses mechanicae\nin\n1625\n. He is famed, however, for a work\nTheoremata de centro gravitatis partium circuli et ellipsis\nin\n1632\nin which he was the first to determine the centre of gravity of the sector of a circle. The work was written at the suggestion of\nSaint-Vincent\n[\n2\n]\n:-\nDella Faille's exposition is rigorously geometrical and Archimedean, and the text was praised by the young\nHuygens\n.\nBusard describes some of de la Faille's results in this text\n[\n1\n]\n:-\nHe proved that the centres of gravity of a sector of a circle, of a regular figure inscribed in it, of a segment of a circle, or of an ellipse lie on the diameter of the figure. These theorems are founded on a postulate from\nLuca Valerio\n's De centro gravitatis solidorum\n(1604)\n. ... La Faille ended his work with four corollaries which revealed his ultimate goal: an examination of the quadrature of the circle.\nOne of de la Faille's close personal and scientific friends was van Langren. Michael Florentius van Langren\n(1600\n-\n1675)\nwas an engineer and cartographer employed as the Mathematician and Royal Cosmographer to the King of Spain. He determined the longitude by studying the phases of the moon and put his solution forward for the prize offered by Spain for a solution to the longitude problem. De la Faille supported van Langren's solution to the longitude problem but no decision was reached about awarding the prize\n[\n2\n]\n:-\nIn della Faille's letters to van Langren one can appreciate the breadth of his scientific interests and the attention and critical spirit with which he followed progress in mathematics, astronomy, geography, cartography, and natural philosophy.\nAt the request of his family, the Belgian painter Anthony Van Dyck painted de la Faille's portrait. In this famous portrait, de la Faille is in religious habit and is represented with his mathematical instruments such as a compass, a square and a globe.",
  "math_areas": []
}