{
  "nome_completo": "Margaret Jane Helen Arnott Wadsworth",
  "nome_curto": "Jane Wadsworth",
  "ano_nascimento": "1942",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wadsworth/",
  "lugar_nascimento": "Ashwood, Woking, Surrey, England",
  "lugar_morte": "Lambeth, London, England",
  "biografia": "Jane Wadsworth\nwas the daughter of James Arnott and Barbara Edwards; she was the eldest of their four children. Given the name Margaret Jane Helen Arnott, she chose to be known as Jane rather than Margaret and, after she married, she took her husband's name of Wadsworth. We will refer to her as Jane up until the time she married. James Arnott, born in Sevenoaks, Kent, on\n4\nSeptember\n1914\n, became a medical doctor with an M.B. B.Ch. degree and, in\n1939\n, was a Hospital House Physician in St Thomas's Hospital, London. He was called up for military service when World War II broke out in\n1939\n. When his daughter Jane was born in\n1942\n, he was serving as a Flying Officer in the Middle East Forces. The war ended in\n1945\nand James Arnott was demobbed and set up a medical practice in Sevenoaks, Kent. At that time Jane, of course, moved to Sevenoaks where she was brought up.\nJane was educated at West Heath Girls' School just outside Sevenoaks. This independent boarding school had started in London in\n1865\nbut, in\n1932\n, had moved into the\n18\nth-century Ashgrove House near Sevenoaks. While at this school she excelled in mathematics but also had many hobbies; she loved music, riding horses and took up sailing. After graduating from West Heath Girls' School, she matriculated at the University of St Andrews, in Scotland, in\n1961\n. She studied mathematics taking the First Year Mathematics class with around\n100\nstudents. In the examinations she was ranked fifth. During her second academic year,\n1962\n-\n63\nshe again performed exceptionally well in the Second Year Mathematics course and was ranked even closer to the top place. She graduated with a B.Sc.\n(\nPure Science\n)\nfrom the University of St Andrews on\n26\nJune\n1964\nand moved to London to take up a position as a computer programmer. Mary Boulton writes\n[\n4\n]\n:-\nThese formative experiences endowed her with a graciousness and social ease that were her hallmark, but also with a reserve which some found intimidating.\nWhile working as a computer programmer, Jane met Michael E J Wadsworth who was a few months older than she was and had been born in Wycombe, Buckinghamshire. They were married in late summer\n1966\nin Tonbridge, Kent and then moved to Edinburgh. While in Edinburgh their first child Emma Wadsworth was born and Jane Wadsworth became a full-time mother and house keeper\n[\n4\n]\n:-\nShe never quite gave up paid employment while her children were young, and when the family returned to London she worked part-time at the Institute for Social Studies in Medical Care, beginning a lasting family connection with the social scientist Ann Cartwright. When Wadsworth's second child, Harry, went to school, she did an MSc in Medical Statistics at the London School of Hygiene ...\nIn\n1976\nWadsworth was elected a Fellow of the\nRoyal Statistical Society\nand, in the same year, she was appointed as a Computer Programmer in the Computing Unit for Medical Sciences, St Bartholomew's Hospital, West Smithfield, London\n[\n4\n]\n:-\n... she had a thorough knowledge of statistical techniques and was skilled in applying these across a wide range of research projects. Her real interest was in helping younger colleagues and clinicians who would arrive in her office with an armful of data, thinking that somewhere in it there might be the answer to a question that needed asking.\nBy\n1977\nshe had worked with her colleagues on a number of projects and was a joint author on the following papers submitted for publication in that year and being published in\n1978\n:\nStudies of cardioselectivity and partial agonist activity in β-adrenoceptor blockade comparing effects on heart rate and peak expiratory flow rate during exercise\n;\nCardiovascular responses to mianserin hydrochloride: a comparison with tricyclic antidepressant drugs\n;\nSome clinical pharmacological studies with terfenadine, a new antihistamine drug\n; and\nPlasma protein binding interaction between phenytoin and valproic acid in vitro\n.\nShe was a co-author on six articles published in\n1978\n, five published in\n1979\nand two published in\n1980\n. To illustrate her work let us quote from the Abstract of two of these papers. The Abstract of\nPrimary suture of the perineal wound following rectal excision for inflammatory bowel disease\n(\naccepted\n17\nMarch\n1978)\nbegins\n[\n9\n]\n:-\nDelay in healing of the perineal wound is a major cause of disability in patients after excision of the rectum. The outcome of primary suture in\n76\npatients treated at St Mark's Hospital between\n1967\nand\n1976\nwas correlated with a number of factors describing the patients, their preparation for surgery and details of surgical technique and management.\nHere is the Abstract of the paper\nEffect of treatment of malignant disease on growth in children\n(\nreceived\n8\nAugust\n1979)\n[\n6\n]\n:-\nThe growth of\n95\nchildren with malignant disease was studied over a\n3\n- or\n4\n-year period, and compared with the growth of normal children matched for age and sex by calculation of the standard deviation score. The mean standard deviation score of the children with leukaemia fell in the first year of treatment, and thereafter showed little change, remaining below the normal. This effect was related to cranial and craniospinal irradiation, but not to age or duration of chemotherapy. The loss in eventual height attained was small and does not suggest any long-term interference with growth hormone production.\nIn\n1979\nWadsworth was appointed as a Scientific Officer in the Department of Medical Physics at St Bartholomew's Hospital. She also collaborated with Ioanna Burnell who worked at the University of Bristol and in\n1981\nthey produced a joint Interim Report\nChildren in One-parent Families: The Effects on Children of Changing Family Status at Birth to Age Five\nfor the Child Health Research Unit, Department of Child Health, University of Bristol. By\n1982\nshe was publishing papers giving her address as Child Health and Education Study, Department of Child Health, University of Bristol. We note that there is a\n1982\npaper with Jane Wadsworth M.Sc. as a joint author which gives her address as Departments of Surgery and Medicine and the Biostatistics Laboratory, Memorial Sloan-Kettering Cancer Center and Cornell University Medical College, New York, N. Y. We are unsure if this is a misprint; some of the joint authors have the New York address, others have St Mark's Hospital for Diseases of the Rectum and Colon, London, England. What is clear from all the papers that Wadsworth was writing is that she was collaborating with people in many different institutions.\nThis first paper we have found with Wadsworth as the first author is\nFamily Type and Accidents in Preschool Children\n(1983)\nwhich has the following Abstract\n[\n14\n]\n:-\nChildren living in single-parent families or stepfamilies were found to be more likely to suffer accidental injuries in their first five years of life than children living with two natural parents. Frequent household moves, low maternal age, and perceived poor behaviour in the child were all more strongly associated with overall accident rates than family type, and these disadvantages were more common in atypical families. Family type appeared to be the most important influence on hospital admission after accidents. Overall, there was a close similarity in accident rates between children of single-parent families and stepfamilies, and both groups were more at risk than children living with both natural parents.\nFrom\n1983\n, in addition to her research positions, Wadsworth was a Lecturer in Medical Statistics at St Mary's Hospital Medical School. She was promoted to Senior Lecturer in\n1989\nand continued in this role until her death in\n1997\n[\n4\n]\n:-\nShe had a gift for communicating with doctors and for reconstructing their initial efforts into realistic research projects. She was enormously generous to those who wanted to collaborate with her but firmly showed the door to those who tried to treat her like a handmaiden. She hated self-promotion in others and would not tolerate it in herself. In the increasingly competitive academic world, however, this meant that her contribution, though widely appreciated by her colleagues, had not yet led to further promotion.\nIt was Wadsworth's work on Sexual Behaviour in Britain, prompted by AIDS and HIV, for which she is best known today. What later became known as AIDS was first identified in\n1981\nand its cause, the Human Immunodeficiency Virus\n(\nHIV\n)\n, became officially recognised in\n1986\n[\n4\n]\n:-\nWith the onset of the Aids epidemic, she became involved in early work to establish the pattern of HIV infection in Britain and to describe its likely spread. This led to the first ever attempt in the UK to conduct a survey about sexual behaviour using a random sample of the population. This was uncharted territory for sex research. Jane Wadsworth was excited by the possibilities it opened up and for the first time took a leading role in initiating her own research programme. Her personal life was more difficult over this period, however, and the end of the\n1980\ns saw the painful break-up of her marriage.\nShe initiated a pilot study in\n1987\nand, working with a range of collaborators, she published\nA pilot study of sexual lifestyle in a random sample of the population of Great Britain\nin\n1989\n. The Abstract of the paper begins as follows\n[\n7\n]\n:-\nRates of sexual-partner change and patterns of high-risk behaviour are important determinants of the spread of HIV. We carried out a survey to assess the feasibility of studying sexual lifestyle in a random sample of the British population, aged\n16\n-\n64\nyears, in November\n1987\n.\nTwo thousand and seventy-seven households were selected using a multi-stage probability sampling procedure. Seven hundred and eighty-five adults participated in a structured interview. The schedule included demographic details, attitudes to AIDS, numbers of sexual partners in different time periods, history of homosexuality and contact with prostitutes.\nThe Abstract ends with the comment\n[\n7\n]\n:-\nFurther work is necessary to improve the response rate and questionnaire design.\nFunding for a major survey in Britain hit difficulties after government refused to support such an investigation.\nThe Times\nreported on\n10\nSeptember\n1989\n(\nsee\n[\n11\n]\n)\n:-\nThatcher halts survey on sex. The prime minister has vetoed plans for the biggest-ever official investigation of Britain's sexual habits. She believes the £\n750\n000\nGovernment survey would invade the privacy of the\n20\n000\npeople due to be questioned. The decision has angered medical researchers, who say the inquiry would have produced the most comprehensive picture of sexual activity yet compiled and provided valuable information for the battle against AIDS. Interviews should have started last April but the project, enthusiastically supported by Government medical officers, was postponed by the Department of Health after resistance from\n10\nDowning Street. Thatcher has now rejected the project, which would have involved adults answering detailed and explicit questions about their sex lives.\nFour weeks later the Wellcome Trust agreed to fund the project. Anne M Johnson, Jane Wadsworth, Kaye Wellings, Julia Field and Sally Bradshaw undertook the design of a survey. Donald Mosher writes that the researchers defined their\n[\n10\n]\n:-\n... measurement objectives to include components of sexual history, the prevalence and distribution of sexual orientations, the frequency and extent of sexual practices, attitudes and knowledge of health risks and relationship with behaviour, demographic characteristics of those at greatest risk of HIV, and changes in sexual lifestyles across generations.\nThe BBC television programme\nHorizon\nmade a film about the survey in\n1992\nwhen they interviewed the researchers\n[\n4\n]\n:-\nJane Wadsworth became a media star, recognised the next day by her greengrocer and the ticket collector at her tube station. She was delighted by such encounters but never took her fleeting fame too seriously.\nThe full survey\nNational Survey of Sexual Attitudes and Lifestyles\nwas published in\n1994\nand Donald Mosher writes\n[\n10\n]\n:-\nBecause of its careful construction, implementation, and analysis, the British\n1990\nNational Survey of Sexual Attitudes and Lifestyles represents the state of the art in national survey research on sexual behaviour.\nMary Boulton writes\n[\n4\n]\n:-\nThis brought invitations for Jane Wadsworth to lecture all over the world; these she enjoyed to the full, travelling often with her new partner, John McEwan. She had an immense enthusiasm for life and died too young, aged\n55\n.\nWadsworth has been honoured with the Jane Wadsworth clinic in the Jefferiss wing of St Mary's Hospital, Praed Street, London being named for her.",
  "math_areas": [
    "Algebra",
    "Number Theory",
    "Statistics"
  ]
}