{
  "nome_completo": "Jason John Nassau",
  "nome_curto": "Jason J Nassau",
  "ano_nascimento": "1893",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nassau/",
  "lugar_nascimento": "Smyrna, (now Izmir) Turkey",
  "lugar_morte": "Cleveland, Ohio, USA",
  "biografia": "Jason J Nassau\nemigrated to the United States in his youth. He studied at Columbia University and the University of Syracuse in New York State. During World War I he served in the American Expeditionary Force in France. In\n1918\nhe went to the University of Edinburgh, Scotland, and after spending some time there moved back to the University of Syracuse where he submitted his thesis\nSome Theorems in Alternants\nfor which he was awarded a Ph.D. in\n1920\n.\nHe became an assistant professor of astronomy at Case Institute of Technology, Cleveland, Ohio, in\n1921\n. He was one of three who discussed the founding of the Cleveland Astronomical Society in February\n1922\n. In\n1924\nhe became the first chair of astronomy at Case. He was chairman of the graduate division from\n1936\nto\n1940\n, and was also director of the Case Western Reserve University Warner and Swasey Observatory from\n1924\n. He retired in\n1959\n, being made Professor Emeritus.\nAmong Nassau's achievements are his discovery of a cluster of\n9\n,\n000\nstars, his co-discovery of two novae in\n1961\n, and his development of a technique for studying the distribution of red stars.\nFurther details are given in J J Nassau's obituary, written by Victor M Blanco, which appeared in the\nQuarterly Journal of the Royal Astronomical Society\n, volume\n7\n(1966)\n. We give a version of the obituary at\nTHIS LINK\nIn\n1932\nNassau's\nA Textbook of Practical Astronomy\nwas published by the McGraw-Hill Book Company. We give a version of a review of the book at\nTHIS LINK\n.\nAmong the honours given to Nassau, we mention that the Nassau Astronomical Station at the Warner and Swasey Observatory is named after him. Also the Jason J Nassau Prize was established by the Cleveland Astronomical Society in\n1965\n. It is awarded annually to an outstanding senior student in the Case Western Reserve University Department of Astronomy. His name is given to two astronomical objects: Nassau crater on the Moon is named after him, as is asteroid\n9240\nNassau, discovered on\n31\nMay\n1997\n.\nNassau joined the\nAmerican Mathematical Society\nin February\n1921\n(\nhe was one of\n114\npeople who joined at that time\n)\n. He had already joined the\nEdinburgh Mathematical Society\nin June\n1919\n.\nFinally we list a few of Nassau's papers:\nQuestions and Discussions: Discussions: Evaluation of the Determinant\n∣\n1\n/\n(\nr\n+\ns\n−\n1\n)\n!\n∣\n|1/(r + s - 1)! |\n∣\n1\n/\n(\nr\n+\ns\n−\n1\n)\n!\n∣\n(1924)\n;\nSome extensions of the generalized Kronecker symbol\n(1926)\n;\nQuestions and Discussions: Discussions: Concerning a Theorem in Determinants\n(1927)\n; and\n(\nwith O E Brown\n)\nA Navigation Computer\n(1947)\n.",
  "math_areas": []
}