{
  "nome_completo": "Jean Nicolas Pierre Hachette",
  "nome_curto": "Jean Nicolas Pierre Hachette",
  "ano_nascimento": "1769",
  "ano_morte": "1834",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hachette/",
  "lugar_nascimento": "Mézières, Ardennes, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean Nicolas Pierre Hachette\n's father was Jean Pierre Hachette, a bookseller by trade, while his mother was Marie Adrienne Gilson. He attended the Collège de Charleville, then went on to attend courses at the École Royale du Génie of Mézières where he was taught by, among others, C Ferry and\nMonge\n. This first contact with\nMonge\nwould be one of many throughout his career, and even at this young age Hachette greatly impressed him.\nIn\n1785\n, when Hachette was sixteen years old, he entered the University of Rheims. He graduated in\n1787\nafter two years of study and then from\n1788\nhe was employed by his old school, the École Royale du Génie of Mézières, as a draftsman and technician.\nMonge\nhad set up a descriptive geometry course at the École Royale du Génie which Ferry was teaching when Hachette was appointed to the staff.\nMonge\n, who had alternated between Mézières and Paris for a number of years, had finally left Mézières in December\n1784\nbut the courses which he had set up were still being taught. Hachette assisted Ferry in teaching the descriptive geometry course.\nOf course\n1789\nwas an eventful year in French history with the storming of the Bastille on\n14\nJuly\n1789\nmarking the start of the French Revolution. This was to change the course of Hachette's life, particularly since he was a strong supporter of the Revolution. At first Hachette continued with his post in Mézières, then in\n1792\nhe entered a competition for professor of hydrography at Collioure and Port Vendres. He won the competition was was appointed to the chair.\nHowever, political events were gathering pace. France had declared war on Austria and Prussia on\n20\nApril\n1792\n. French defeats led to unrest in France and, on\n10\nAugust\n1792\n, there was further revolutions by the people with nobles and clergy murdered during September. On\n21\nSeptember the monarchy was abolished in France and a republic was declared.\nFerry was elected to be a deputy on the National Convention in\n1873\nand Hachette returned to the École Royale du Génie of Mézières to take over his position teaching mathematics. During this period Hachette showed his strong support for the Revolution. He was\n[\n1\n]\n:-\n... active in the political life of his native city, and at the École du Génie he sought rapid training of officers qualified for the revolutionary army and to remove teachers and students whose patriotism seemed doubtful to him.\nThis period in his life was short, however, for in the following year the Committee of Public Safety in Paris required his services and he went there immediately. He advised on various technological tasks, such as manufacture of weapons and military applications. In March\n1794\nthe National Convention set up a body whose task it was to establish the École Centrale des Travaux Publics\n(\nsoon to become the École Polytechnique\n)\n. Hachette took an active role in setting up the École using his experience at Mézières to good effect. He was appointed as an assistant professor in descriptive geometry at the School in November\n1794\n. The School began to operate from June\n1795\nbut Hachette had been teaching before that at the short-lived École Normale de l'An III from January to May of that year as\nMonge\n's assistant.\nIn\n1799\nHachette was promoted to full professor at the École Polytechnique and continued to serve the School both as a teacher and an organiser. The students at the School were served well as Hachette encouraged his best students with research projects, raising the level and reputation of the School. He was an editor of the\nJournal de l'École Polytechnique\nand then in\n1804\ncreated a new publication for the School setting up the\nCorrespondance sur l'École Polytechnique\n. Hachette edited this publication until he was forced out of the School in\n1816\n. The book\n[\n2\n]\ndiscusses these two publications, and Hachette's role in them.\nAnother educational establishment, the École Normale, was set up to train secondary school teachers and from\n1810\nHachette taught there and at the Faculty of Sciences in Paris in addition to the École Polytechnique. However, in\n1816\nthe Government reorganised the École Polytechnique and Hachette found himself excluded from the school. It is a little difficult to understand this, as is Louis XVIII refusing to confirm Hachette's election to the\nAcadémie des Sciences\nin\n1823\n. The usual reason for such decisions would be political and so it must be that Hachette was out of favour. Since his political activity seems confined to Mézières in\n1793\n, and in other ways he seems to have remained in favour in Paris, speculation about his exclusion seems pointless.\nHachette worked on descriptive geometry, collected work by\nMonge\nand edited\nMonge\n's\nGéométrie descriptive\nⓉ\n(\nDescriptive Geometry\n)\nwhich was published in\n1799\n. He also published on a wide range of topics from his own major works on geometry, to works on applied mechanics including the theory of machines. His work on machines includes much in the area of applied mechanics, but he was also interested in applied hydrodynamics and steam engines. In fact he published interesting work on the history of steam engines.\nThe final area which interested Hachette was physics. Again his interests in this topic were wide, including work on optics, electricity, magnetism and scientific instruments. His contribution is summed up in\n[\n1\n]\nas follows:-\nAlthough not a scientist of the first rank, Hachette nevertheless contributed to the progress of French science at the beginning of the nineteenth century by his efforts to increase the prestige of the École Polytechnique and by making\nMonge\n's work widely known, especially in descriptive and analytic geometry and in the theory of machines.",
  "math_areas": [
    "Geometry"
  ]
}