{
  "nome_completo": "Betty Jean Jennings Bartik",
  "nome_curto": "Jean Bartik",
  "ano_nascimento": "1924",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bartik/",
  "lugar_nascimento": "Alanthus Grove, Gentry County, Missouri, USA",
  "lugar_morte": "Poughkeepsie, New York, USA",
  "biografia": "Jean Bartik\n's maiden name was Jennings but to simplify this biography we will call her \"Jean\" until we reach the time when she married. Her father, William Smith Jennings\n(1893\n-\n1971)\nfrom Alanthus Grove, was both a schoolteacher and a farmer. He began teaching at the age of seventeen, in the same year as he completed his own school education. In fact many members of the family were teachers; Jean's grandmother, uncles and aunts were all teachers. Jean's mother, Lula May Spainhower\n(1887\n-\n1988)\nfrom Alanthus, married William Jennings on\n21\nFebruary\n1914\nin Alanthus Grove. Jean, who was actually known as \"Betty Jean\" when she was growing up, was born into a large family; she was the sixth of seven children. She had three older brothers: William Smith Jennings, born\n10\nJanuary\n1915\n; Robert Newton Jennings, born\n15\nMarch\n1918\n; and Raymond D Jennings, born\n23\nJanuary\n1922\n. She also had two older sisters, Emma Estella Jennings, born\n11\nAugust\n1916\n, Lula May Jennings, born\n22\nAugust\n1919\n, and one younger sister, Mable Kathleen Jennings, born\n15\nDecember\n1928\n[\n2\n]\n:-\nWe lived in a little four-room house: we had a boys' room and a girls' room and a kitchen, and then the living room, and my parents had a folding-up bed that was in the living room. My oldest sister was the cook, my second sister cleaned the house, and I was the third daughter, without household duties, so I always worked in the field, and helped with raking and ploughing and all that kind of stuff. We, of course, had cows to milk, and things like that, so we always had chores to do, and animals to feed, and things like that.\nJean's grandmother, who was a retired schoolteacher, lived about a mile and a half away and Jean rode on horseback to see her every day. This grandmother became one of Jean's role models and had a major influence on her life. Jean's family were too poor to buy a daily newspaper, but her grandmother bought one and gave it to Jean every day. Jean began her education in a little one-room school, the Jennings School. She was good at mathematics but this did not make her stand out in the family since her parents, brothers and sisters were all good at mathematics. However she began to play softball while at this school and this was the thing that first made her stand out from other members of the family. She played for local girls teams and became quite a star in the neighbourhood with newspaper articles written about her skills as a softball pitcher.\nThe nearest High School was in Stanberry, a town of about\n2000\ninhabitants, but as there was no way of getting to the town, her older brothers and sisters had to live in Stanberry during the week while they attended high school there. However, later there was a bus service between Stanberry and Alanthus. She lived with her sister for her first year at high school, then lived at home and travelled to school by bus. Now she still had to get to the bus, for her house on the farm was still quite a way from the little village of Alanthus. From the age of fourteen she drove a car to reach the village. Although she was only\n14\nyears old, driving off the main roads was allowed and so she could drive to the village to get the bus to Stanberry. She graduated from Stanberry High School in\n1941\nat the age of\n16\nranked as the second best pupil in the school having attained the highest mathematics mark anyone had ever achieved at the school.\nAfter graduating from Stanberry High School, Jean entered Northwest Missouri State Teachers College\n(\nnow Northwest Missouri State University\n)\nin Maryville, Missouri. Money was a problem since her family were far too poor to support her through college, but she was given a loan of $\n25\na month from her aunt Gretchen and she made some extra money by working in a bookstore. When she entered the College she intended to take a degree in journalism, but she did not like her advisor so quickly decided to change to major in mathematics with English as her minor subject.\nShe was in her first year of studies when, on\n7\nDecember\n1941\n, the Japanese attacked the American naval base at Pearl Harbor on Oahu Island, Hawaii, an action which brought the United States into World War II on\n8\nDecember. The most immediate effect on the College was that almost all the male students left to undertake war service and even many of the young teachers left. Eventually the College began to train naval personnel and it changed markedly. After two years at the College, Jean's father asked her to help him on the farm during the summer since Jean's brothers were undertaking war service\n[\n2\n]\n:-\nIt was actually one of the best experiences of my life. With seven children - and my father was a schoolteacher and a farmer - I had never had any time alone with my father. I basically didn't know my father that well. I'd never been close to him; I never really knew what he thought, and things like that. I worked with him all summer, out in the fields. We ate our lunch out in the field, and I was with him all the time.\nReturning to Northwest Missouri State Teachers College for her junior year, she found that nobody else was majoring in mathematics and, in some of the courses, for example Calculus and Astronomy, she was one of only two students, the other student being a young man from Peru. In other courses such as Analytic Geometry, Trigonometry and Physics, the only students besides Jean were young men undergoing naval training. However, in order to graduate she needed to take courses which were no longer given. Special arrangements were made, two retired teachers were brought back to teach courses, and Modern Geometry and the Theory of Numbers were put on just for her. She completed her undergraduate studies in January\n1945\nbeing the only student to major in mathematics from the College.\nAlthough Jean came from a family of teachers, the one thing that she was sure of by the time she graduated was that she did not want to teach. She applied for a job with IBM and she also applied to be a \"computer\" at the Moore School at University of Pennsylvania where war work was being carried out and the ENIAC computer\n(\nElectronic Numeric Integrator and Computer\n)\nwas being developed. IBM turned her down and she went home and waited to hear from the University of Pennsylvania at Philadelphia. Quite a bit of pressure was put on her by her family to become a mathematics teacher for, due to the war, there was a considerable shortage. However, she resisted until, in March\n1945\n, she received a telegram asking her to go to Philadelphia. Once there she began work calculating trajectories for firing tables for guns. She was one of around\n80\ngirls, all employed as calculators working on trajectories. In June\n1945\n, after working on trajectories for a few months, an announcement was made asking if any of the girls would like to apply to be one of five operators of the ENIAC.\nAt this stage Jean knew nothing about the ENIAC computer project but, led by\nJohn Mauchly\nand\nJ Presper Eckert Jr\n, it had started in early\n1943\nunder the direction of\nHerman Goldstine\nwith consultant\nJohn von Neumann\n. It was not an all-purpose computer, for it was specifically designed to calculate trajectories. She was selected for the project and spent a few months at the Aberdeen Proving Ground\n[\n2\n]\n:-\n... we learned how to wire up those boards for the punch-card machines - because the input of the ENIAC was a card reader, and the output was a card punch; and our printer was a tabulator. We had a sorter and a key-punch and a collator, and a few other things; and we had to wire up the boards to do whatever we wanted to do.\nShe returned to the Moore School in August\n1945\nand the five girls discussed operating the ENIAC with\nJohn Mauchly\n. The idea was that Jean and the other four girls would operate the ENIAC but anyone wanting to use it to solve a problem would program it themselves. This, however, did not happen since the ENIAC was so complex to program that the five girls became the programmers. They worked out how to use subroutines, nested subroutines and other programming techniques. In February of\n1946\nthe ENIAC was demonstrated to the press, computing trajectories as programmed by the five girls. However, with World War II over, firing tables were no longer important and Dick Clippinger, together with\nJohn von Neumann\n, began to work out how to use the ENIAC as a stored program machine. Clippinger set up a group led by Jean at the University of Pennsylvania to work on this project. They would visit Princeton regularly to discuss progress with\nvon Neumann\n. Jean also regularly visited Aberdeen where she taught Clippinger to program the ENIAC.\nJean had met William John Bartik, an engineer, while working at the Moore School; they married on\n14\nDecember\n1946\n. It was\nJohn Mauchly\nwho took her down the aisle at her wedding. Jean Bartik continued to work on computers until\n1951\n, only then leaving and starting a family. The Bartiks had three children: Timothy John Bartik\n(\nborn\n26\nMarch\n1954)\n, Jane Helen Bartik\n(\nborn\n8\nAugust\n1959)\n, and Mary Ruth Bartik\n(\nborn\n2\nFebruary\n1961)\n. Jean and William Bartik were divorced in\n1968\n.\nPresper Eckert\nand\nJohn Mauchly\nleft the Moore School at the University of Pennsylvania in October\n1946\nand started up the Electronic Control Company which soon became the Eckert-Mauchly Computer Corporation. They received an order from Northrop Aircraft Company to build the Binary Automatic Computer\n(\nBINAC\n)\n. One of the major advances of this machine, which was used from August\n1950\n, was that data was stored on magnetic tape rather than on punched cards. Jean Bartik worked with\nEckert\nand\nMauchly\non the design of this computer\n[\n4\n]\n:-\nThe BINAC was designed supposedly to control the Snark Missile. That's why it had twin computers that checked each other ... when you're controlling a missile you don't want it to make a mistake.\nShe also worked on logical design for UNIVAC I. In\n1950\nthe Remington Rand Corporation took over the Eckert-Mauchly Computer Corporation and changed its name to the UNIVAC Division of Remington Rand. Soon after this Bartik's husband left the Moore School, taking a job in Washington, and she went with him to Washington where she worked in the Remington Rand sales office. There she trained the Census Bureau programmers, worked with the salesmen selling Remington Rand equipment, and worked on programs for the Aviation Supply Office for the Navy on the UNIVAC. Bartik's husband then took a job with Remington Rand in Philadelphia but she was not allowed to work in the same place as her husband. At this point, fed-up with Remington Rand, Bartik left computing and took\n16\nyears out to have a family.\nIn\n1967\nBartik studied for a Master's Degree from the University of Pennsylvania, then went back into working with computers\n[\n4\n]\n:-\n... when I went back in the business, it was interesting. ... the minicomputer was just coming in. So I never worried about mainframes again. I worried about minicomputers and communications.\nShe got a job with the Auerbach Corporation\n[\n4\n]\n:-\nI saw the reports they wrote, and they were very technical. And I thought the greatest way in the world for me to get back into the business is to do technical reports ... to read them and to edit them. So that's what I did ... worked for Auerbach Corporation publishers and developed a service on minicomputers.\nShe worked for the Auerbach Corporation for eight years\n[\n4\n]\n:-\nAnd then, I began working for many computer companies. I worked for Interdata\n[1975\n-\n76]\n. And I was Market Manager of their megamini. And then I worked for Systems Engineering Labs in Florida\n[1976\n-\n77]\n. I was Product Support Manager. And then I worked for Honeywell, as a Manager of Minicomputer Competitive Analysis. And then, I worked for Data Decisions, developed a communications project and then, edited it.\nShe was at Honeywell from\n1978\nto\n1980\nwhen she went back into the publishing business with Data Decisions. She worked there until\n1986\nwhen Data Decisions was closed down.\nJean Bartik received many awards for her remarkable contributions. She was inducted into the 'Women in Technology International Hall of Fame' in\n1998\n; she received a 'Museum Fellows Award' from the 'Computing History Museum' at Mountain View, California, in\n2008\n; she was awarded the prestigious 'Computer Pioneer Award' in\n2008\nfrom the 'Institute of Electrical and Electronics Engineers Computer Society' Board of Governors:-\nJean was honoured for her pioneering efforts as one of the first computer programmers. Jean, who also programmed the BINAC and UNIVAC I, led a team to turn the ENIAC into the first stored program computer, which she did successfully in the late\n1940\ns.\nBartik also received the Joan S Korenman Award in\n2009\nfor her pioneering efforts as one of the first computer programmers. She received the award in Baltimore, Maryland, at the Multinational Development of Women in Technology Conference on\n12\nMarch.\nShe worked as a real estate agent for the last years of her life. She died from congestive heart failure in a nursing home in Poughkeepsie, New York.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}