{
  "nome_completo": "Jean Baptiste Joseph Delambre",
  "nome_curto": "Jean-Baptiste-Joseph Delambre",
  "ano_nascimento": "1749",
  "ano_morte": "1822",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Delambre/",
  "lugar_nascimento": "Amiens, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean-Baptiste-Joseph Delambre\n's father was a draper. The name Delambre is a form of \"de Lambre\" which probably comes from \"lambeau\" meaning \"rag\". He was the eldest of his parents children. Childhood illnesses at this time were extremely serious and when he developed smallpox at the age of\n15\nmonths his parents must have doubted that he would ever have much of a future. He almost lost his eyesight as a result of this illness and he did lose his eyelashes which never grew in again. In all his portraits he has a rather unusual appearance because of this but often, unless one is aware that he has no eyelashes, one does not realise why he looks unusual. Given his poor eyesight it is even more remarkable that he took up astronomy, but it has to be said that his eyesight continued to improve during the thirty years following the smallpox. To give an indication of just how bad his eyesight still was when he was\n20\nyears old, we should note that even at that time he could hardly read his own handwriting and could not bear to be in direct sunlight.\nHe attended the Jesuit College in Amiens, studying under the abbé Jacques Delille who was a poet and classicist. There Delambre studied English and German but in\n1764\nthe Jesuits were banned from France and at this stage he continued his education in Amiens, studying under teachers who had been brought from Paris. At this time he was intent on becoming a parish priest, but one of these new teachers encouraged him to continue his education in Paris. He was awarded a scholarship to the Collège du Plessis in Paris and there he studied classical languages preparing himself for a university education. However, when he sat the university entrance examinations his weak eyesight meant that he could not read the examination paper properly and he failed to gain a scholarship. His parents could not afford to send him to university without the scholarship and so encouraged him to return to Amiens but he remained in Paris trying to educate himself.\nClaude Mathieu\n, who was a student of Delambre, wrote in his article on him in\nBiographie universelle\n:-\nOne would have to have heard this modest and sincere man giving an account of his way of life after leaving the Collège du Plessis in order to believe the tiny amount that he spent during one year.\nUp until this time Delambre had little reason to learn mathematics but now this changed. To support himself he took a position as a tutor to the son of a nobleman in Compiègne and he now had to teach himself mathematics so that he could teach his pupil. He soon became an expert, developing exceptional calculating skills.\nIn\n1771\nDelambre came back to Paris where he became tutor to the son of Jean-Claude Geoffroy d'Assy, Receiver General of Finances. It was an ideal position for Delambre for he lived at in Geoffroy d'Assy's house and, choosing to accept far less in payment that d'Assy offered, he accepted a small pension and enjoyed living cheaply but learning all he could. At this time, although he had never taken holy orders, he called himself the Abbé de Lambre. He would change \"de Lambre\" to \"Delambre\" at the time of the Revolution to avoid its aristocratic appearance.\nDelambre's interests moved from the study of Greek and Greek literature to Greek science, and he read much on the topic. Soon his interest in Greek astronomy led him to find out about modern astronomy and in about\n1780\nhe read\nLalande\n's\nTraité d'astronomie\nⓉ\n(\nTreatise on astronomy\n)\n. He began attending\nLalande\n's astronomy lectures at the Collège de France and soon impressed\nLalande\nwith his knowledge. When\nLalande\nwas looking for a new assistant in\n1783\nto undertake observations for a new edition of his\nTraité d'astronomie\nⓉ\n(\nTreatise on astronomy\n)\n, he turned to Delambre who was his best student.\nLalande\nlent Delambre some equipment and the observational data he collected with it was incorporated into the third edition of\nLalande\n's\nTraité d'astronomie\nⓉ\n(\nTreatise on astronomy\n)\nwhich would appear in print in\n1792\n.\nIn\n1786\nDelambre recorded a transit of Mercury across the Sun. At the time which had been predicted for the transit there was cloud and nothing was visible. Most astronomers gave up, but not Delambre who did not believe that the time predicted for the transit by\nLalande\nwas correct. When the cloud cleared forty minutes after the transit was predicted to end, Delambre was able to observe that the transit was still taking place. It was the realisation that the existing tables were inaccurate which led him to devote much effort into producing new ones.\nDelambre attended a meeting of the\nAcadémie des Sciences\nat which\nLalande\npresented the data from the Mercury observations. At the same meeting\nLaplace\npresented a paper on his mathematical results which allowed the perturbations produce by one planet on the orbit of another to be calculated. Delambre was very impressed and decided to make observations of the orbit of Uranus in order to verify\nLaplace\n's theoretical results.\nA letter which\nLalande\nwrote to Bugge on\n16\nJune\n1788\nshows how impressed he was with Delambre:-\nMonsieur Delambre ... is currently the most able astronomer of any country in the world. ... We must encourage so valuable a recruit, and bind him to a science in which he performs prodigious feats without hope of any position or advantage.\nWhen the\nAcademy\nannounced that the Grand Prix for\n1789\nwould be for the calculation of the precise orbit of Uranus, Delambre had already done much of the work. The topic had been suggested by\nLaplace\nand\nLalande\nwith Delambre in mind, and the committee consisting of\nDominique Cassini\n,\nLalande\nand\nMéchain\nduly awarded him the prize, declaring him to be:-\n... an astronomer of wisdom and fortitude, able to review\n130\nyears of astronomical observations, assess their inadequacies, and extract their value.\nBy this time Delambre had his own observatory. In\n1787\nGeoffroy d'Assy moved into a new house in the le Marais district of Paris, west of the Bastille, and in\n1788\n, encouraged by\nLalande\n, he began building an observatory for Delambre above his bedroom on the top floor of the house. The observatory, fitted with the latest equipment, was completed by\n1789\n.\nDelambre worked in his observatory and in\n1792\nhe published\nTables du Soleil, de Jupiter, de Saturne, d'Uranus et des satellites de Jupiter\nⓉ\n(\nTables of the Sun, Jupiter, Saturn, Uranus and Jupiter's satellites\n)\n. Wilson, in\n[\n10\n]\nand\n[\n11\n]\n:-\n... undertakes to follow the steps whereby the lunar and planetary perturbations of the Earth's motion were introduced into solar tables. The principal landmarks in the development were the tables of\nLacaille\n(1758)\n, and the tables of Delambre that were published in the third edition of\nLalande\n's Astronomie\n(1792)\n, and the revised version of these tables published by the Bureau des Longitudes in\n1806\n.\nArago\nwrote of Delambre's work\n(\nsee for example\n[\n1\n]\n)\n:-\nIn perfecting the methods of astronomical calculation he merits, by reason of the variety and elegance of his methods, a distinguished place among the ablest mathematicians France can boast.\nIn the same year of\n1792\nDelambre received the Grand Prix of the\nAcadémie des Sciences\nfor the second time. He had already been elected an associate member in the mathematical sciences section of the\nAcadémie\non\n15\nFebruary of that year. In fact it was a major project undertaken by the\nAcadémie des Sciences\nwhich would occupy him for the next few years and his election came at precisely the right time.\nThe\nAcadémie\nhad already set up a Commission of Weights and Measures in\n1790\nconsisting of\nBorda\n,\nCondorcet\n,\nLaplace\n,\nLegendre\nand Lavoisier to advise on a metric system of weights and measures. After some changes of direction, it eventually recommended, in a report of\n19\nMarch\n1791\n, that the system be based on a metre defined as one ten millionth part of one quarter of the Earth's meridian. The report was approved by the National Assembly one week later and it remained to calculate a more accurate value of the length of the meridian. The\nAcadémie des Sciences\nappointed\nMéchain\n,\nLegendre\nand\nDominique Cassini\nto carry out this task.\nIt was decided to measure, using the method of triangulation with sightings made with the\nBorda\nrepeating circle which was an extremely accurate new instrument, that part of the meridian between Dunkerque and Barcelona. This was divided into two unequal parts, Dunkerque to Rodez and Rodez to Barcelona. The northern part was much the longer since it had been accurately measured by\nCassini de Thury\nin\n1740\n. Although\nDominique Cassini\nwas keen to take charge of the project, he refused to personally measure one sector and, on\n5\nMay\n1792\nDelambre was given charge of the Dunkerque to Rodez sector and\nMéchain\nthe Rodez to Barcelona sector. The task proved much harder than anticipated because of the French Revolution and wars with France's neighbours.\nA picture of the Borda repeating circle is at\nTHIS LINK\n.\nDelambre set out in June and began to seek triangulation points round Paris. However he was arrested in September since his authorisation came from the King who by this time had himself been arrested. Released after getting new official papers, Delambre was arrested again shortly afterwards since his instruments were thought to be suspicious and meant he was a spy. He was able to obtain official papers from the National Convention in Paris and continued his mission. Delambre made comparatively little progress before returning to Paris for the winter, then set out the next spring to begin working his way south from Dunkerque. In December\n1793\n, however, he was removed from the meridian measuring task by the Committee of Public Safety who decreed that\n(\nsee for example\n[\n3\n]\n)\n:-\n... government officials\n[\nmust\n]\ndelegate their powers and functions solely to men known to be trustworthy for their republican virtues and their abhorrence of kings ...\nIn May\n1795\nDelambre was reinstated and carried on the task he had been forced to end abruptly eighteen months earlier. He triangulated between Orléans and Bourges in the second half of\n1795\n, between Bourges and Evaux in the summer of\n1796\n, completing his part of the task by triangulating between Evaux and Rodez in\n1797\n. Between these triangulation tasks he had travelled to Dunkerque in December\n1795\nand spent the first months of\n1796\ncalculating very precise latitude data. Also required was an accurate baseline measurement so that the scale of the triangulation could be fixed precisely. Delambre made accurate baseline measurements in Melun, near Paris, in April\n1798\n.\nAn International Commission for Weights and Measures was set up and Delambre reported his results to it in February\n1799\n. By June of that year, after\nMéchain\nhad also reported, a definitive platinum bar of length one metre was made to become the basis of the metric system. Details of the whole project were published by Delambre in\nBase du système métrique\nⓉ\n(\nThe base of the metric system\n)\n. The first of the three volumes, containing the history of measurement of the Earth and the project's triangulation data, was published in\n1806\n. When Delambre presented it to Napoleon, the emperor said\n(\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nConquests will come and go but this work will endure.\nThe second volume of the work, published in\n1807\n, contained the data for the accurate latitude calculations of Dunkerque and Barcelona. The third volume of\n1810\nlooked at the errors in the calculations and at the Earth's eccentricity.\nFourier\n, who wrote an obituary of Delambre for the\nAcadémie des Sciences\n, wrote\n(\nsee for example\n[\n1\n]\n)\n:-\n... the geodetic operation, for which we are chiefly indebted to him, and of which he bore the greatest share, is the most perfect and extensive which has been executed in any country. It has served as the model of all enterprises of the kind which have been since projected.\nLet us now look at some other landmarks in Delambre's career. In\n1795\nhe was admitted to the Bureau des Longitudes, becoming President in\n1800\n. In\n1801\nhe was appointed secretary to the\nAcadémie des Sciences\nmaking him the most powerful figure in science in France. In\n1803\nhis health took a turn for the worse when he developed rheumatic fever but he continued to devote most of his time to work. However, in\n1804\n, he married Elizabeth de Pommard, the widowed mother of his assistant. They lived at first in the d'Assy house in the le Marais district of Paris where, except for when he had been on his travels, he had continued to observe in the observatory above his room from the time it was first built for him. Tragedy struck his family in\n1807\nwhen his wife's son, who had previously been Delambre's assistant, died in Naples at the age of\n26\n. Delambre attained further achievements in his career, however, including his appointment to the chair of astronomy at the Collège de France in Paris in\n1807\n. The position had been held by\nLalande\nuntil his death in that year and Delambre was proud to succeed his former teacher. He was also appointed treasurer to the Imperial University in\n1808\nand at this time moved with his wife from the d'Assy house in the le Marais district to the official residence of the Treasurer of the University.\nIn\n1809\nNapoleon requested that the\nAcadémie des Sciences\naward a prize for the best scientific publication of the decade. The award went to Delambre for his work on the meridian. He won so many other distinctions that it is impossible to list them all here. However we should mention that after he retired from public life in\n1815\nhe was made a chevalier of Saint Michel. He had earlier been invested as chevalier of the Legion of Honour by Napoleon at the first such occasion in\n1804\nat the Hotel des Invalides in Paris, and in\n1821\nhe was made an officier of the Legion of Honour.\nIn the last part of his career Delambre became interested in the history of mathematics and astronomy. We have already noted that in the first volume of\nBase du système métrique\nⓉ\n(\nThe base of the metric system\n)\nhe presented a history of measurement of the Earth. In his\nRapport historique sur les progrès des sciences mathématiques depuis\n1789\nⓉ\n(\nHistory of the progress of the mathematical sciences since\n1789\n)\n, which he read to the Institute in February\n1808\nand published in\n1810\n, he says:-\nIn almost all branches of Mathematics one is blocked by insurmountable difficulties\n(\nbut\n)\nthe spectacle of analysis and mechanics in our time\n(\nconvinces me that\n)\nthe generations to come will not see anything impossible in what remains to be done.\nHe published a two volume work\nHistoire de l'astronomie ancienne\nⓉ\n(\nHistory of ancient astronomy\n)\nin\n1817\n, then\nHistoire de l'astronomie du moyen age\nⓉ\n(\nHistory of astronomy of the middle ages\n)\nin\n1819\n, two volumes of\nHistoire de l'astronomie moderne\nⓉ\n(\nHistory of modern astronomy\n)\nin\n1821\n, and his work on the history of astronomy in the eighteenth century was published by\nClaude Mathieu\nafter Delambre's death. Grattan-Guinness in\n[\n5\n]\nnotes that he approached the subject matter more as a calculating astronomer than as a historian. This is fair, for Delambre did not see himself writing for historians, rather\n(\nsee for example\n[\n1\n]\n)\n:-\n... mainly for astronomers and mathematicians.\nHe says that his aim was to produce:-\n... a repository where could be found all the ideas, all the methods, and all the theorems that have served successively for the calculation of phenomena.\nBernard Cohen writes in\n[\n1\n]\n:-\nDelambre ... presents each major chronological period in a series of discrete analyses of one treatise after another. ... As one would expect, Delambre is especially good on astronomical tables and on methods of observation and calculation. A great virtue is the wealth of information on minor figures, for whom no other account may be available. Above all, Delambre spices his presentation with acerb and delightful comments ... Unquestionably the six volume Histoire is the greatest full-scale technical history of any branch of science ever written by a single individual. It sets a standard very few historians of science may ever achieve.\nFourier\nwrote in his obituary of Delambre\n(\nsee for example\n[\n1\n]\n)\n:-\nBefore him astronomical calculations were founded on numerical processes, which were at one indirect and irregular. These he has changed throughout, or ingeniously remodelled. Most of those which astronomers use at the present time belong to him, having been deduced from analytic formulae, which, in their application, have been found alike, sure, uniform and manageable.\nHe is honoured by having a large lunar crater named after him.",
  "math_areas": [
    "Analysis"
  ]
}