{
  "nome_completo": "Jean Baptiste Biot",
  "nome_curto": "Jean-Baptiste Biot",
  "ano_nascimento": "1774",
  "ano_morte": "1862",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Biot/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean-Baptiste Biot\n's father was Joseph Biot, whose ancestors were farmers in Lorraine, had achieved an important role working in the Treasury. Jean-Baptiste was educated at the college of Louis-le-Grand in Paris, where he specialised in classics. He completed his studies at Louis-le-Grand in\n1791\nfollowing which, since his father wanted him to make a career in commerce, he took private lessons in mathematics from Antoine-Rene Mauduit who was professor of mathematics at the Collège de France. Joseph Biot then sent his son to Le Havre to become a clerical assistant to a merchant. His job there consisted of copying vast numbers of letters\n(\nwe have to be thankful for photocopiers!\n)\nwhich bored Biot so much that he volunteered for the army. He joined the French army in September\n1792\n, and served in the artillery at the Battle of Hondschoote in September\n1793\n. In this battle the French defeated the British and Hanoverian soldiers besieging Dunkirk. After the battle Biot, suffering from an illness, decided to leave the army and return to his parents. As he was walking towards Paris, he was befriended by an important person who passed in his carriage. He took Biot in his carriage to Paris where he\n(\nBiot\n)\nwas arrested as a deserter\n(\nhe was still in uniform\n)\nand brought before a revolutionary committee. This would have had serious consequences for Biot had not the stranger intervened and he was set free. Despite Biot's efforts, he was not able to identify the important stranger and thank him.\nIt took Biot some months to recover from the illness during which time he continued with his studies of mathematics. He took the entrance examinations for the École des Ponts et Chausées and was accepted in January\n1794\n. The École Polytechnique was founded later in\n1794\n(\nactually named 'École centrale des travaux publics' for its first year\n)\nand Biot transferred there in November of that year.\nGaspard Monge\n, one of the founders of l'École Polytechnique who taught the first intake of students, quickly realised Biot's potential. Biot, however, quickly became involved in student politics and was made a section leader. There was an attempted insurrection by the royalists against the Convention and Biot took part. He was captured by government forces and taken prisoner. Had it not been for Monge, who could not see someone with such talents remain in jail, or even die, pleading successfully for his release his promising career might have ended. It is not surprising that for a second time he had come close to a death sentence, giving the dangerous times in Revolutionary France through which he lived. He returned to his studies at the École Polytechnique, befriending a fellow student,\nSiméon-Denis Poisson\n, and graduated in\n1797\n. He had found a patron in\nSylvestre-François Lacroix\nwho was highly influential in helping Biot develop his career.\nHe became Professor of Mathematics at the École Centrale de l'Oise at Beauvais in\n1797\n. It might seems remarkable that even someone as able as Biot could move from being an undergraduate straight into a professorship. However, things had worked in his favour\n[\n7\n]\n:-\nThe Convention, in a law of\n25\nFebruary\n1795\nhad called for a system of Écoles Centrales, one in each large town, to replace the Collèges of the Ancien Régime as seats of secondary education. The curricula of the new schools was practical and modern and included two years devoted to mathematics, experimental physics and chemistry. These subjects had never been taught before on a high school level, so, inevitably, there was a shortage of qualified teachers.\nBiot got to know of the vacant mathematics professorship through his friendship with Barnabé Brisson, the son of Antoine François Brisson de Beauvais, while studying at l'École Polytechnique. Through Barnabé Brisson, Biot had got to know his sister Gabrielle. Although Gabrielle was only sixteen years old, they married in\n1797\nsoon after Biot took up his position at Beauvais. Biot taught Gabrielle mathematics and physics so that she might translate into French a German text by Ernst Gottfried Fischer. It was Claude Louis Berthollet who had asked Biot to make the translation which was published as\nPhysique mécanique\nⓉ\n(\nMechanical Physics\n)\nin\n1806\n. Biot's wife was well educated and fluent in German, so her translation was excellent. However, in line with the practice of the time, the book records Biot himself as the translator rather than his wife. Biot and his wife had a son Édouard Constant Biot who was born in\n1803\n.\nIt was largely through\nLacroix\nthat Biot had been appointed at Beauvais and\nLacroix\nadvised him frequently through the first years that he worked there. However, he also managed to get support in his career from\nLaplace\n. In fact in late\n1799\nBiot approached\nLaplace\n, who had taught him at l'École Polytechnique, and offered to proof-read the\nMécanique céleste\nⓉ\n(\nCelestial mechanics\n)\nwhich at that time was with the publisher. He did not give up when\nLaplace\nsaid \"No thanks\" but persisted in a polite way and eventually\nLaplace\nagreed. Biot was, by this time, an entrance examiner at the École Polytechnique so was frequently in Paris. He wrote\n[\n7\n]\n:-\nFrom that time on, each time I went to Paris I brought my proof-reading work and personally presented it to M\nLaplace\n. He always received it with kindness, examined it and discussed it, and that gave me the opportunity to submit to him the difficulties that had stopped me. His willingness to explain them was boundless. But even he could not always do it without stopping to think for a long while. This usually occurred in places where he had used the expedient phrase 'it can easily be seen'.\nCertainly the effort required by Biot was enormous. He wrote near the end of\n1799\n[\n7\n]\n:-\nI spent all of my days at this work\n[\nproof-reading the 'Mécanique céleste'\n]\nwhich I felt to be important in several respects, and I hope I have succeeded. I worked like a devil to finish it on time, and\n1\nremained at the task eighteen hours in a row the last day, without eating or drinking. Finally, thank heaven, it is finished, and I can flatter myself that I understand the 'Mecanique celeste'\nⓉ\n(\nCelestial mechanics\n)\n. If this were to be the only benefit I would get from it, it would still be a lot.\nLaplace\nwas also interested in the research on mathematics which Biot was undertaking and gave him advice both on the material and on getting it published. In\n1800\nhe was appointed Professor of Mathematical Physics at the Collège de France, an appointment which was due mainly to the influence of\nLaplace\n. In\n1800\nBiot was elected an associate to the First Class of the Institute, replacing\nJean Montucla\nwho died in December\n1799\n. Again\nLaplace\n's support was important to Biot in this election. In January\n1803\nthe Institut was reorganised and\nDelambre\nbecame perpetual secretary, creating a vacancy in the Mathematics Section. Although Biot had produced excellent mathematics memoirs in the years up to\n1800\n, he had concentrated on experimental physics from that time on. However, presumably to improve his chances of gaining a place in the Mathematics Section, he submitted a memoir on the axes of tautochronous curves just before the election was to take place. It was sufficient to keep his mathematical reputation high and he was elected on\n11\nApril\n1803\n.\nThe first balloon ascent made for scientific purposes was by Biot and Joseph-Louis Gay-Lussac from the garden of the Conservatoire des Arts on\n24\nAugust\n1804\n. They achieved a height of\n4000\nmetres and measured magnetic, electrical, and chemical properties of the atmosphere at various heights. In\n1806\n, again with the support of\nLaplace\n, Biot was appointed as an assistant astronomer at the Bureau de Longitudes in addition to his other roles. On\n3\nSeptember of that year he set out with\nFrançois Arago\nto Formentera, in the Balearic Islands, to complete earlier work begun there on calculating the measure of the arc of the meridian. They were still undertaking measurements when, in May\n1808\n, Napoleon declared his brother Joseph Bonaparte as Spanish ruler and the War of Independence began. Biot and\nArago\nmust have looked extremely suspicious; two Frenchmen with sophisticated measuring instruments working on Spanish territory. Biot fled back to France immediately. Later in\n1808\n, together with\nClaude-Louis Mathieu\n, he embarked on a series of measurements of the length of the seconds pendulum at different points on the meridian, in particular at Bordeaux and at Dunkirk. Both\nMathieu\nand Biot received a prize from the\nAcadémie des Sciences\nin\n1809\nfor this highly accurate work, and in\n1812\nthey received a second prize from the Academy for their achievements. In\n1809\nBiot was appointed Professor of Physical Astronomy at the Faculty of Sciences. He held this position for over fifty years.\nBiot studied a wide range of mathematical topics, mostly on the applied mathematics side. He made advances in astronomy, elasticity, electricity and magnetism, heat and optics on the applied side while, in pure mathematics, he also did important work in geometry. He collaborated with\nArago\non refractive properties of gases. Biot, together with\nFelix Savart\n, discovered that the intensity of the magnetic field set up by a current flowing through a wire varies inversely with the distance from the wire. This is now known as Biot-\nSavart\n's Law and is fundamental to modern electromagnetic theory.\nMorris Kline\n, reviewing\n[\n8\n]\n, writes:-\nBiot depended entirely upon experiments to determine the interaction of a magnet and a straight line of electrical current and then inferred a mathematical law concerning the force between current and magnet.\nLight was the topic on which Biot devoted most time, making the major discovery of the laws of rotary polarization by crystalline bodies. Having discovered these laws he used them in analysis of saccharine solutions using an instrument called a polarimeter which he invented. For this work on the polarisation of light passing through chemical solutions he was awarded the Rumford Medal of the\nRoyal Society of London\nin\n1840\n. He had been elected as a foreign member of the\nRoyal Society\nin\n1815\n.\nOne of his important works was\nMémoire sur la figure de la terre\nⓉ\n(\nMemoir on the shape of the earth\n)\n(1827)\nwhich describes the shape of the Earth. Among his other major works we mention:\nAnalyse de la mécanique céleste de M Laplace\nⓉ\n(\nAnalysis of the celestial mechanics of M Laplace\n)\n(1801)\n;\nTraité analytique des courbes et des surfaces du second degré\nⓉ\n(\nAnalytical Treatise on curves and surfaces of the second degree\n)\n(1802)\n;\nRecherches sur l'intégration des équations différentielles partielles et sur les vibrations des surfaces\nⓉ\n(\nResearch on the integration of partial differential equations and vibrations of surfaces\n)\n(1803)\n;\nEssai de géométrie analytique appliqué aux courbes et aux surfaces de second ordre\nⓉ\n(\nEssay on analytic geometry applied to curves and surfaces of second order\n)\n(1806)\n;\nRecherches expérimentales et mathématiques sur les mouvements des molécules de la lumière autour de leur centre de gravité\nⓉ\n(\nExperimental research and mathematics on the movement of molecules of light around their center of gravity\n)\n(1814)\n;\nTraité de physique experimentale et mathématique\nⓉ\n(\nTreatise on experimental physics and mathematics\n)\n(1816)\n;\nPrecis de physique\nⓉ\n(\nSummary of Physics\n)\n(1817)\n;\n(\nwith\nArago\n)\nRecueil d'observations géodésiques, astronomiques et physiques exécutées en Espagne et Écosse\nⓉ\n(\nCollection of geodetic, astronomical and physical observations collected in Spain and Scotland\n)\n(1821)\n;\nMémoire sur la vraie constitution de l'atmosphère terrestre\nⓉ\n(\nMemoir on the true constitution of the Earth's atmosphere\n)\n(1841)\n;\nTraité élémentaire d'astronomie physique\nⓉ\n(\nElementary treatise on physical astronomy\n)\n(1805)\n;\nRecherches sur plusieurs points de l'astronomie égyptienne\nⓉ\n(\nResearch on several points of the Egyptian astronomy\n)\n(1823)\n;\nRecherches sur l'ancienne astronomie chinoise\nⓉ\n(\nResearch on ancient Chinese astronomy\n)\n(1840)\n;\nÉtudes sur l'astronomie indienne et sur l'astronomie chinoise\nⓉ\n(\nStudies on Indian and Chinese astronomy\n)\n(1862)\n;\nEssai sur l'histoire générale des sciences pendant la Révolution\nⓉ\n(\nAn Essay on the general history of science during the Revolution\n)\n(1803)\n;\nDiscours sur Montaigne\nⓉ\n(\nLecture on  Montaigne\n)\n(1812)\n;\nLettres sur l'approvisionnement de Paris et sur le commerce des grains\nⓉ\n(\nLetters on the provisioning of Paris and on the grain trade\n)\n(1835)\n;\nTraite d'astronomie physique\nⓉ\n(\nTreatise on physical astronomy\n)\n(1850)\n; and\nMélanges scientifiques et littéraires\nⓉ\n(\nScientific and literary notes\n)\n(1858)\n.\nHe tried twice for the post of Secretary to the\nAcadémie des Sciences\nand to improve his chances for election to this post he wrote\nEssai sur l'Histoire Générale des Sciences pendant la Révolution\n. However he lost out in\n1822\nto\nFourier\nfor this post, then again when\nFourier\ndied in May\n1830\nhe applied again for the post of Secretary, only to lose to\nArago\non this occasion. The rivalry between\nArago\nand Biot was again evident in\n1839\nwhen different photographic processes were competing\n[\n10\n]\n:-\nArago\nand Biot, France's leading authorities in the field of optics, had spent the past thirty years disagreeing about the ability of optical instruments to represent the world. Photography became one more opportunity for them to disagree, and they did not shrink from the task. The debate extended beyond questions of assigning priority and apportioning credit. At its heart was the question of what the photographic surfaces showed, what relation the visible inscription bore to the real world.\nArago\nsupported the Daguerre photographic process with silver plates while Biot championed an approach with paper soaked in a silver solution as developed by\nHenry Fox Talbot\n. This was not because he thought this process produced clearer photographs, rather it was because he believed that the images captured 'chemical radiation' invisible to the eye. We should note that the idea of 'chemical radiation' was widely believed at this time. Biot also believed that the photographic process should be one reserved for scientific use and not made available for public use. There was a period of collaboration between Biot and\nTalbot\n, the two exchanging letters frequently. Basically the photographic process became another tool for Biot to use in his investigations of light which had always been a major interest to him.\nAs well as interests in almost every branch of science, Biot was interested in the history of the subject. He published works on this topic such as:\nEssai sur l'histoire générale des sciences pendant la Révolution française\nⓉ\n(\nAn Essay on the general history of science during the French Revolution\n)\n(1803)\n;\nNotice historique sur la vie et les ouvrages de Newton\nⓉ\n(\nHistorical notice on the life and works of Newton\n)\n(1822)\n;\nRecherches sur plusieurs points de l'astronomie égyptienne appliquées aux monuments astronomiques trouvés en Égypte\nⓉ\n(\nsearches on several points of the Egyptian astronomy applied to astronomical monuments found in Egypt\n)\n(1823)\n;\nSur la manière de calculer les positions des étoiles relativement à l'équateur et à l'écliptique pour les époques anciennes\nⓉ\n(\nHow to calculate the positions of the stars relative to the equator and the ecliptic to the ancient times\n)\n(1823)\n;\nOpuscule sur l'Astronomie ancienne des Chinois, des Indous et des Arabes\nⓉ\n(\nA leaflet on  ancient Chinese, Hindu and Arab astronomy\n)\n(1840)\n;\nMémoire sur le Zodiaque de Denderah\nⓉ\n(\nMemoir on the Dendera Zodiac\n)\n(1844)\n;\nPrécis de l'histoire de l'Astronomie planétaire\nⓉ\n(\nSummary of the history of planetary astronomy\n)\n(1847)\n; and\nÉtudes sur l'astronomie indienne et l'astronomie chinoise\nⓉ\n(\nStudies on Indian astronomy and Chinese astronomy\n)\n(1862)\n.\nIn\n[\n4\n]\nSt Beuve says that Biot was endowed to the highest degree with all the qualities of curiosity, finesse, penetration, precision, ingenious analysis, method, clarity, in short with all the essential and secondary qualities, bar one, genius, in the sense of originality and invention.\nA contrasting comment by\nOlinthus Gregory\nin\n1821\nis:-\nWith regard to M Biot, I had an opportunity of pretty fully appreciating his character when we were together in the Zetland\n[\n= Shetland\n]\nIsles; and I do not hesitate to say that I never met so strange a compound of vanity, impetuosity, fickleness, and natural partiality, as is exhibited in his character.\nIn addition to the honours we mentioned above, Biot was also honoured by being made Chevalier of the Legion of Honour in\n1814\nand Commander in\n1849\n. He was elected to the to the Academy of Inscriptions and Belles-Lettre in\n1841\nand to the\nFrench Academy\nin\n1856\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}