{
  "nome_completo": "Jean-Christophe Yoccoz",
  "nome_curto": "Jean-Christophe Yoccoz",
  "ano_nascimento": "1957",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yoccoz/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean-Christophe Yoccoz\nwas placed first in the entrance examination for the École Normale Supérieure and also for the École Polytechnique in\n1975\n. He received the\nAgrégation de Mathématiques\nin\n1977\nin joint first position.\nYoccoz did his military service in Brazil in\n1981\n-\n1983\n. He was a student of M Herman and submitted his doctoral thesis in\n1985\n. As a student of Herman, a leading word expert on\ndynamical systems\n, it was not surprising that Yoccoz would himself work on dynamical systems. However, it was remarkable how quickly Yoccoz was to establish himself as the most brilliant researcher in this area. In his thesis, Yoccoz improved theorems of his supervisor Herman by giving simpler proofs but also obtaining the same results under weaker hypotheses.\nGiven his outstanding work it was clear that he would quickly be offered appointments and indeed he was appointed as professor at the University of Paris-Sud\n(\nOrsay\n)\n. He became a member of the Institut Universitaire de France and a member of the Unité Recherche Associé \"\nTopology\nand Dynamics\" of the Centre National de la Recherche Scientifique at Orsay.\nAt the International Congress of Mathematicians in Zürich in\n1994\n, Yoccoz received his greatest honour for this work on dynamical systems when he was awarded a\nFields Medal\n. In his own address to the Congress, he began by stating the aim of his subject:-\nBroadly speaking, the goal of the theory of dynamical systems is, as it should be, to understand most of the dynamics of most systems.\nThe theory of dynamical systems really began with\nPoincaré\nwho was studying the stability of the\nsolar system\n. This is typical of what the theory of a dynamical system tries to do: it describes how a system evolves over time given a rule which, for any particular state of the system, describes the following state. The solar system example shows exactly what one wants to know - given any configuration of the system it evolves according to\nNewton\n's laws but will it remain stable or, after many years, will one of the planets be ejected from the system?\nAfter\nPoincaré\n, the theory was developed by a large number of mathematicians such as Arnold,\nFatou\n, Herman,\nJulia\n,\nKolmogorov\n,\nPalis\n,\nSiegel\n,\nSmale\nand Yoccoz. Douady writes in\n[\n3\n]\n:-\n... they have proved stability properties - dynamic stability, such as that sought for the solar system, or structural stability, meaning persistence under parameter changes of the global properties of the system.\nYoccoz in his own address at the International Congress of Mathematicians in Zürich in\n1994\nsaid:-\nThe dynamical features that we are able to understand fall into two classes, hyperbolic dynamics and quasiperiodic dynamics; it my well happen, especially in the conservative case, that a system exhibits both hyperbolic and quasiperiodic features. ... we seek to extend these concepts, keeping a reasonable understanding of the dynamics, in order to account for as many systems as we can. The big question is then: Are these concepts sufficient to understand most systems?\nDouady describes Yoccoz's contributions in general terms in\n[\n2\n]\nbut in more detail in\n[\n3\n]\nwhich was the article describing the mathematics leading to the award of the Fields Medal. We quote\n[\n2\n]\nand advise those looking for more technicalities to consult\n[\n3\n]\n:-\nHe combines an extremely acute geometric intuition, an impressive command of analysis, and a penetrating combinatorial sense to play the chess game at which he excels. He occasionally spends half a day on mathematical \"experiments\", by hand or by computer. \"When I make such an experiment\", he says, \"it is not just the results that interest me, but the manner in which it unfolds, which sheds light on what is really going on.\" Yoccoz has developed a method of combinatorial study of\nJulia\nsets and\nMandelbrot\nsets - called \"Yoccoz puzzles\" - which permit deep insight.",
  "math_areas": [
    "Combinatorics",
    "Logic",
    "Topology"
  ]
}