{
  "nome_completo": "Jean-Baptiste Brasseur",
  "nome_curto": "Jean-Baptiste Brasseur",
  "ano_nascimento": "1802",
  "ano_morte": "1868",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brasseur/",
  "lugar_nascimento": "Esch-sur-Alzette, French Empire (now Luxembourg)",
  "lugar_morte": "Liège, Belgium",
  "biografia": "Jean-Baptiste Brasseur\nwas born in Esch-sur-Alzette, a town in the south of Luxembourg near the border with France. His father, Alexis Brasseur\n(1775\n-\n1841)\nwho was a bailiff and also the town clerk, had thirteen children by two wives, Marie-Marguerite Schneider\n(1771\n-\n1818)\nand Marie-Anne Schockmel\n(1794\n-\n1873)\n. Jean-Baptiste was the eldest of Marie-Marguerite and Alexis's children. His mother died when he was sixteen years old and his father remarried and had eight children with his second wife. Jean-Baptiste's childhood was difficult since the large family was quite poor but he had the determination and temperament to overcome such difficulties. As soon as he was old enough, he had to help his parents provide for the large family that he loved. The times in which he grew up, following the defeat of Napoleon Bonaparte, added to his difficulties in obtaining a normal education since the public educational establishments were closed for several years. The difficulties that he had to overcome led him to develop a stoic character which helped him throughout his life. His philosophy for living, \"Non multa, sed multum\" which means \"Not quantity, but quality,\" was formed by his youthful struggles.\nIn his early years Brasseur was self-educated but even this presented difficulties since a lack of money meant he could only have a few books from which to study. After being given a little private tuition, he entered the Athénée of Luxembourg which prepared him for university studies. He was, of course, not the only young man to suffer difficulties in hard times so he was one of a large group of young people at the Athénée who were passionate about the opportunity to study. Already he had developed a love for science so, when he entered the University of Liège in\n1824\nat the age of\n22\n, he matriculated in the Faculty of Science. There he studied metaphysics with Bernard-Ignace Denzinger, who held the chair of philosophy at the University of Liège. He studied mathematics with Richard van Rees\n(1797\n-\n1875)\n, Jean-Michel Vanderheyde\n(1767\n-\n1836)\nand\nGerminal Dandelin\n(1794\n-\n1847)\n, and he studied science with Jean-Charles Delvaux de Fenffe\n(1782\n-\n1863)\n. It was\nDandelin\nwho had a profound influence on Brasseur - he taught him geometry and encouraged him to undertake research on that topic. Brasseur was awarded his doctorate in mathematics and physics in\n1829\nfor his thesis\nDe resolubilitate functionum algebricarum integrarum in factores primi vel secundi gradus\nⓉ\n(\nResolving integer algebraic functions into factors of the first or second degree\n)\n. He then went to Paris where he spent a year attending mathematics lectures at the Collège de France delivered by\nJacques Binet\nand at the Sorbonne by\nJean Hachette\nand by\nAugustin-Louis Cauchy\n. He also attended lectures at the Sorbonne by the chemist Louis-Jacques Thénard\n(1777\n-\n1857)\n, by the physicists\nJean-Baptiste Biot\n(1774\n-\n1862)\nand Claude Servais Mathias Pouillet\n(1791\n-\n1868)\n, and by two scientists who researched in both physics and chemistry Joseph-Louis Gay-Lussac\n(1778\n-\n1850)\nand Pierre Louis Dulong\n(1785\n-\n1838)\n. However, there was a revolution in Paris in July\n1830\n, and it was following this that Brasseur left the city and returned to Liège.\nAt this time Brasseur began twin careers, one as an academic and the other in the military. He began teaching mathematics in a private capacity and was also a captain in the artillery of the Civic Guard of Liège. Now we have to look briefly at the events of the time to understand the events of Brasseur's life. We have already noted the effects of the Napoleonic wars on Brasseur's education. After the defeat of Napoleon, the Allied powers did not want Belgium to remain under French control so in\n1815\nthey created the Kingdom of the Netherlands from Belgium and Holland with William I as King. The north and south, which had been united until the\n16\nth\ncentury, had developed very differently during their centuries apart. William began a process of increased industrialisation in the south, building roads and bridges, and also set up two new state-funded but partially autonomous universities at Ghent and Liège, the latter being where Brasseur studied. However, following the Paris revolution of\n1830\n, there was a movement, particularly strong in Liège, for an independent Belgium. Both sides prepared for war but an international conference in\n1831\nrecognised Belgium as an independent country.\nBrasseur began giving courses on analytic geometry and descriptive geometry which were designed to complete the instruction of lieutenants of artillery and so allow them take the examinations of the  École Militaire necessary to rise to the rank of captain. In\n1831\nhe was appointed to a project constructing roads and bridges in the Brabant region of Belgium. In the same year, on\n1\nSeptember, he married Thérèse Grosfils, who came from Liège. He was assigned to oversee naval work at Boom but, as the work was still at the planning stage, he was sent to Louvain to await developments. The university at Louvain was an ancient one, founded in\n1425\n, but it had been suppressed at the time of the French Revolution in\n1797\n. A temporary Faculty was in its place when Brasseur arrived there and he taught elementary mathematics in that Faculty until\n1832\n. In fact the university would be re-established two years later but by this time Brasseur held a position in Liège. He had for a long time wanted an academic position and in\n1832\nhe was appointed as a lecturer at the University of Liège to teach the course on Descriptive Geometry and also the course on Higher Analysis Applied to Geometry. He based his geometry courses on the work of\nGaspard Monge\n.\nNow we noted above that William I set up the University of Liège following the creation of the Kingdom of the Netherlands in\n1815\n. This had happened in\n1817\n, but in\n1831\nBelgium had become independent and, as a consequence, the university was reorganised and it became a fully state run university in\n1835\n. At this time Brasseur took over teaching the Analysis course, the Elementary Mathematics course, and was appointed to the Chair of Applied Mechanics and the Chair of Descriptive Geometry. Two years later he became an extraordinary professor and, in the same year, published his book\nProgramme du cours de géométrie descriptive donné par J-B Brasseur\nⓉ\n(\nCourse of descriptive geometry given by J-B Brasseur\n)\n. This text was very well received with a second edition appearing in\n1850\n, a third in\n1860\nand a fourth edition in\n1867\n. When the Royal Society of Sciences of Liège was set up in the\n1830\ns, Brasseur, who was a founder member, was appointed as its first Secretary General, serving in that capacity under four presidents. He was elected to serve as president of the Society in January\n1849\n. By this time he had been promoted to full professor, which happened in\n1844\n.\nBrasseur's publications, following those mentioned above, include:\nApplications des projections cotées à diverses recherches sur l'étendue\nⓉ\n(\nApplications of listed projections to various researches on the extent\n)\n(1841)\n;\nLignes de courbure de quelques surfaces exprimées par des équations différentielles partielles, et note sur une propriété de l'hyperboloïde à une nappe, et du paraboloïde hyperbolique\nⓉ\n(\nCurved lines on some surfaces expressed by partial differential equations, and note on a property of the hyperboloid of one sheet and the hyperbolic paraboloid\n)\n(1843)\n;\nSur la double génération des surfaces du second degré par le mouvement d'un cercle\nⓉ\n(\nOn the double generation of surfaces of the second degree by the movement of a circle\n)\n(1843)\n;\nNote sur un nouvel énoncé des conditions d'équilibre d'un système de forces\nⓉ\n(\nNote on a new statement of the conditions of equilibrium of a system of forces\n)\n(1846)\n;\nMémoire sur divers lieux géométriques du second degré, déterminés par la géométrie descriptive\nⓉ\n(\nMemorandum on various loci of the second degree, determined by descriptive geometry\n)\n(1846)\n;\nTransformation du principe des moments en celui des vitesses virtuelles et note sur une construction géométrique de la surface d'élasticités\nⓉ\n(\nTransformation of the principle of  moments into those of virtual velocity and a note on a geometric construction of the surface of elasticity\n)\n(1849)\n; and\nNote sur une construction graphique de centre de gravité d'un polygone quelquonque, en supposant connue la construction du centre de gravité du triangle\nⓉ\n(\nnote a graphical construction of the center of gravity of a polygon quelquonque, assuming known construction of the triangle's center of gravity\n)\n(1849)\n. Perhaps his most significant geometrical contribution, however, was his\n148\n-page memoir\nSur une nouvelle méthode d'application de la géométrie descriptive à la recherche des propriétés de l'étendue\nⓉ\n(\nOn a new method of applying descriptive geometry in search of properties of the extent\n)\nwhich he published in the\nMemoirs\nof the\nRoyal Belgium Academy of Science\nin\n1855\n. The memoir contains an original presentation of projective geometry.\nJean-Baptiste and Thérèse Brasseur had five children. Their daughter, Constance\n(1836\n-\n1912)\n, married Dominique Brasseur\n(1833\n-\n1906)\n, one of sons of Jean-Baptiste Brasseur's father Alexis with his second wife Marie-Anne Schockmel. Jean-Baptiste and Thérèse Brasseur had a four sons, Paul, Alfred, Auguste and Leopold. Alfred\n(\nborn\n1835\nin Liège, died\n1898\nBrussels\n)\nmade a career in the army and was an inspector of studies at the École Militaire. Leopold followed his father in becoming a mathematician, becoming a lecturer in Liège in\n1858\n. He took over some of his father's courses and published the paper\nDémonstration d'un théorème de Steiner\nⓉ\n(\nDemonstration of Steiner's theorem\n)\nin\n1865\nbut, sadly, died in the year this paper was published. Brasseur died three years after Leopold's death following a chill. Following his death,\nFrançois Folie\nedited two of Brasseur's works, namely\nPrécis du cours de mécanique appliquée\nⓉ\n(\nSummary of an applied mechanics course\n)\nand\nExposition nouvelle des principes du calcul différentiel et intégral\nⓉ\n(\nNew exposition of the principles of differential and integral calculus\n)\nwhich were both published in\n1868\n.\nWe have already noted above the honour that was given to Brasseur by his election as president of the Royal Society of Sciences of Liège. He was also honoured by being elected a corresponding member of the\nRoyal Belgium Academy of Science\non\n17\nDecember\n1847\nand a full member of the Academy on\n14\nDecember\n1855\n. He was elected as a corresponding member of the Society of Natural Sciences of Luxembourg on\n15\nJune\n1864\n. On\n26\nOctober\n1860\n, Brasseur received the Knight's Cross of the Order of Leopold. The Knight's Cross is the highest of five classes of the Order of Leopold which is the highest order of Belgium named in honour of King Leopold I. On\n19\nFebruary\n1868\nBrasseur was appointed Officer of the Order of the Oak Crown by the king of the Netherlands and the Grand Duke of Luxembourg. The Officer is the second highest of five classes of the Order of the Oak Crown, instituted by the Grand Duke King William II in\n1841\nwhen he ruled over both the Grand Duchy of Luxembourg and the Kingdom of the Netherlands.\nLucien Godeaux\nsums up Brasseur's achievements in\n[\n3\n]\n:-\nBrasseur's biographers agree in their praise of the clarity and precision of his teaching, and these qualities are reflected in his works and in his memoirs. He has had a profound influence on mathematics education at the University of Liège and was the founder of the School of Geometry that continued to shine brightly with his successors\nF Folie\n,\nC Le Paige\nand Fr Deruyter. On the other hand, he had the idea to create a laboratory for applied mechanics; it was the latter that later supported V Dwelshauvers-Dery's research on the steam engine.\nHis energy was nicely illustrated by his son Alfred Brasseur who said\n(\nsee\n[\n4\n]\n)\n:-\nNever in his life did Brasseur sit in an armchair.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}