{
  "nome_completo": "Jean Marie Constant Duhamel",
  "nome_curto": "Jean-Marie Duhamel",
  "ano_nascimento": "1797",
  "ano_morte": "1872",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Duhamel/",
  "lugar_nascimento": "St Malo, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean-Marie Duhamel\nstudied at the Lycée in Rennes before becoming a student at the École Polytechnique in\n1814\n. In order to understand the events which totally disrupted his studies there, we need to look at some of the extraordinary events which took place in France around this time.\nIn\n1804\nNapoleon had made the École Polytechnique into a military school and the decision was taken to move it to the Montagne Sainte Geneviève.\nMonge\n, who was the director of the École Polytechnique, was a staunch supporter of Napoleon and the École was greatly in favour and flourished. However, the allies advanced on France after Napoleon's Russian disaster and crossed the Rhine after the Battle of Leipzig in October\n1813\n. Despite Napoleon's skill in using the troops at his disposal, the allies reached Paris in\n1814\n. Even though the École Polytechnique's students defended Paris fiercely, the city fell to the advancing allies. Napoleon abdicated on\n6\nApril\n1814\nand was banished to Elba.\nMonge\nremained as director of the École Polytechnique and it was as this time that Duhamel began his university studies there.\nAfter Napoleon escaped from Elba and returned to Paris,\nMonge\nimmediately rallied to him and gave him his full support. Even after Napoleon was defeated at Waterloo,\nMonge\ncontinued to see him until he was put on board a ship on\n15\nJuly\n1815\n. By October\nMonge\nfeared for his life and fled from France but returned to Paris in March\n1816\n. King Louis XVIII had been returned to power by the allies but there was severe friction between supporters of the King and the new Chamber of Deputies which had been elected in August\n1815\n.\nMonge\nwas dismissed from the directorship of the École Polytechnique immediately following his return, and the students took violent action to support him. There had been other measures imposed on the École which had also angered the students. The King moved against the students sending them all down, and all courses were cancelled until\n1817\n. Duhamel returned to Rennes, but did not go back to Paris after the École Polytechnique was reorganised and reopened in\n1817\n, preferring to remain in Rennes where he studied law.\nDuhamel did return to Paris after taking his law degree and taught mathematics and physics both at the Institution Massin and at the Lycée Louis-le-Grand. He then decided to open his own school which was later called the École Sainte-Barbe. Despite having a heavy work laod, Duhamel found time to continue his mathematical studies and in\n1823\nhe presented his first paper\nProblèmes et développements sur diverses parties des mathématiques\nⓉ\n(\nProblems and developments in various parts of mathematics\n)\nwritten jointly with\nAntoine-André-Louis Reynaud\n. He began teaching at at the École Polytechnique in\n1830\n, becoming professor there in\n1834\n. He was highly thought of as a teacher of mathematics and was reported to have given very fine lectures. He published articles such as\nSur les équations générales de la propagation de la chaleur dans les corps solides dont la conductibilité n'est pas la même dans tous les sens\nⓉ\n(\nOn the general equations of the propagation of heat in solids whose conductivity is not the same in all directions\n)\n(1832)\nand\nSur la méthode générale relative au mouvement de la chaleur dans les corps solides plongés dans des milieux dont la température varie avec le temps\nⓉ\n(\nOn the general approach regarding the movement of heat in solid bodies immersed in environments where the temperature varies with time\n)\n(1833)\nin the\nJournal of the École Polytechnique\n. He submitted his work on the mathematical theory of heat, written up as a doctoral thesis\nThéorie mathématique de la chaleur\nⓉ\n(\nMathematical theory of heat\n)\n, to the Faculty of Science and he was awarded his doctorate in\n1934\n. Duhamel was elected to the\nAcademy of Sciences\nin\n1840\n.\nAppointed as entrance examiner at the École Polytechnique in\n1835\n, Duhamel was named professor of analysis and mechanics in\n1836\n. He continued to occupy posts at the École Polytechnique, being made permanent examiner in\n1840\nand then, during the period\n1848\nuntil\n1851\n, was Director of Studies. A commission removed him from his posts in\n1850\nsince he had resisted proposed changes. However, from\n1851\n, he again filled the analysis chair at the École Polytechnique after\nLiouville\nwas appointed to the vacant chair at the Collège de France. Also from\n1851\nDuhamel was professor at the Faculté des Sciences in Paris.\nDuhamel worked on\npartial differential equations\nand applied his methods to the theory of heat, to rational mechanics, and to acoustics. His acoustical studies involved vibrating strings and the vibration of air in cylindrical and conical pipes. His techniques in the theory of heat were mathematically similar to\nFresnel\n's work in optics with his theory of the transmission of heat in crystal structures based on earlier work by\nFourier\nand\nPoisson\n. 'Duhamel's principle' in partial differential equations arose from his contributions to the distribution of heat in a solid with a variable boundary temperature. In fact his theoretical predictions relating to the propogation of heat in non-isotropic solids was later verified experimentally by the physicist Henri de Sénarmont. However, Duhamel did some experimental work of his own, particularly in the area of vibrating strings. He invented a recording instrument which consisted of a pen attached to a vibrating string which left a recond on a moving plate behind it. He suggested that the different sounds which one perceives from musical instruments was due to the ear receiving a complex number of harmonics which were heard as a single sound. This understanding of sound was made independently by\nG S Ohm\n.\nDuhamel published\nCours d'analyse de l'École Polytechnique\nⓉ\n(\nAnalysis Course of the polytechnic\n)\nin two volumes, the first in\n1840\nand the second in the following year. Another two volume work\nCours de mécanique\nⓉ\n(\nMechanics course\n)\nappeared in\n1845\nand\n1846\n, then both volumes of\nEléments de calcul infinitésimal\nⓉ\n(\nElements of infinitesimal calculus\n)\nwere published in\n1856\n.\nDes Méthodes dans les sciences de raisonnement\nⓉ\n(\nThe methods in science reasoning\n)\nappeared in five volumes between\n1866\nand\n1872\n.\nPaul Tannery\ngives this interesting description of Duhamel's lectures:-\nThe pupils of the École Polytechnique have given his name to a glass of sweetened water which, at the beginning of each lesson, he was accustomed to prepare while summarizing, in a voice initially hardly audible, but which rose little by little, the contents of the preceding lesson.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}