{
  "nome_completo": "Jean Bourgain",
  "nome_curto": "Jean Bourgain",
  "ano_nascimento": "1954",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bourgain/",
  "lugar_nascimento": "Ostend, Belgium",
  "lugar_morte": "Bonheiden, Belgium",
  "biografia": "Jean Bourgain\n's father, René Bourgain\n(1926\n-\n2011)\n, was a professor of physiology in the faculty of medicine of the Free University of Brussels and his mother was a paediatrician. His parents had two children, a son Jean Bourgain, the subject of this biography born\n1954\n, and a daughter Claire Bourgain who was nearly seven years younger than her brother. By the time Claire was born Jean had a collection of favourite toys, particularly a rabbit that he had to take to bed with him before he could go to sleep. He was so delighted to have a sister, that he gave the new-born baby all his favourite toys including the beloved rabbit. Claire wrote about young Jean in the letter\n[\n10\n]\nread to the conference held in his memory in\n2019\n:-\nRemember how you made me your little partner in crime to drive our mother crazy with your incredible inspiration for mischief? Once you piled up her most delicate precious crystal glassware into a huge complicated tower. I was a\n4\nor\n5\nyear-old toddler watching you; pretty confident you wouldn't break anything. When our mom came in almost getting a heart attack, you whispered with a grin: \"Shush we are almost finished, just one more glass to put on top ... \" Your teachers at school were not spared either. You had the talent to be so innocently nerve wrecking, that you were almost sent away from school. It took our parents tons of patience to fill the gap between you and school. Nobody in this room would believe calculation was a big issue for you at that time, as your brain seemed unable to deal with a teaching method consisting of visually adding up apples instead of abstract numbers. When you discovered mathematics, you got more serious.\nJean attended primary school and high school in Ostend. He became interested in mathematics around the middle of his time in the high school, not from the teaching at the school but rather from looking at calculus books that belonged to his parents. He graduated from the High School in\n1971\nand, in the same year, enrolled for a mathematics degree in the Free University of Brussels.\nIngrid Daubechies\nenrolled at the Free University of Brussels at the same time as Bourgain but she wanted to major in physics. For the first two years, they largely took the same courses.\nDaubechies\nwrites\n[\n16\n]\n:-\nJean's and my courses of study diverged after the second year; nevertheless he and I shared a total of about\n10\nmaths classes over the first two academic years, from calculus and linear algebra to topology and complex analysis. As a small university, the Free University of Brussels prided itself on providing a nurturing experience, with many tutorial sessions and problem seminars. As the two strongest students in mathematics, Jean and I had soon spotted each other. Jean already knew more mathematics than I did - one day an engineering student challenged us to find the curve in a pursuit problem, and he knew tricks to solve differential equations that I had never heard of. ... In the weekly two-hour problem sessions held for each of our maths courses, students were typically handed a sheet with problems at the start, and would then try to solve them, with help from a circulating Teaching Assistant. Jean and I would race each other; I earned his grudging respect by beating him a fair share of the time - and I am sure he was not letting me win! We hung out with each other a great deal the first year, talking maths most of the time when we were not in classes, going to empty classrooms to use the blackboard. When I occasionally proposed that we talk about something else, or play a game, Jean would be puzzled.\nBourgain began his study of the 'Licentiaat' in\n1973\nand was awarded the degree\n(\nequivalent to an M.Sc.\n)\nin\n1975\n. He had taken Freddy Delbaen's course on probability theory in the first year of his Licence studies and, having impressed him, worked on the thesis for his Licence advised by Freddy Delbaen. Delbaen\n(\nborn\n21\nNovember\n1946\nin Duffel, Belgium\n)\nhad studied at the Free University of Brussels and awarded a Ph.D. in\n1971\nafter which he taught at the University. At Delbaen's suggestion, Bourgain worked on a topic on\nBanach\nspace theory for his Licence thesis and submitted the paper\nStrongly Exposed Points in Weakly Compact Convex Sets in Banach Spaces\n, based on the thesis,\nto the\nProceedings\nof the\nAmerican Mathematical Society\nin September\n1975\n.\nIn the year\n1975\nhe won a Belgium Research Fellowship to study for his doctorate at the Free University of Brussels. Although Freddy Delbaen was his Ph.D. thesis advisor, in practice by this time Bourgain did not need an advisor. Delbaen writes\n[\n16\n]\n:-\nWhen colleagues asked how it feels to have a student like Jean, my response was always the same. Jean was my student only for a small amount of time. I learned more maths from him than he learned from me. ... For me it became more and more difficult to follow Jean's mathematical progress. By the time I had read one of his papers, he already had finished two others. When he saw a problem he quickly understood what was the essential part of it. He had a lot of tricks\n(\ncalled techniques\n)\nto transform the problem to its basics and then solve it. Sometimes he needed more time to rebuild the original problem, sometimes new difficulties showed up, but most of the time he was right.\nBourgain attended several conferences while studying for his Ph.D. and quickly gained a reputation as an exceptional mathematician. As early as October\n1975\nhe came to the Maurey-\nSchwartz\nseminar at the École Polytechnique in Paris. The seminar was organised by\nGilles Pisier\nand the speaker was Charles Stegall who had recently proved some remarkable results on the\nRadon\n-\nNikodym\nproperty for\nBanach\nspaces.\nPisier\nrecalls in\n[\n16\n]\n:-\nOut of the blue appears a very young\n(\nhe was\n21)\nbut very straight-looking fellow carrying an attaché case and wearing a jacket who comes and sits down without talking to anyone. I approach him after the talk to try to socialise, but cutting short he says he came from Brussels to talk with the speaker. I play the go-between; of course Stegall agrees and off they go to his office to discuss one on one. After what was surely more than an hour, they come out. Jean leaves immediately and Stegall looks exhausted. Feeling a sense of responsibility as host to the visitor, I worry that he might have been bombarded with too many questions and to my surprise, he says, no, no, more like bombarded with answers. He then tells me solemnly\n(\nmuch to his credit, as I distinctly remember\n)\n: \"I am absolutely sure that I just met someone exceptional.\" Of course I was a priori sceptical but gradually the whole\nBanach\nspace community\n(\nincluding myself\n)\ndiscovered, before many other communities, that Jean Bourgain was indeed an exceptional mathematician, head and shoulders above anyone else in the field. After that initial appearance, Jean came back as a speaker six times in the subsequent five years of existence of the Maurey-\nSchwartz\nseminar.\nHe was awarded his Ph.D. in\n1977\nand continued to study for his\nHabilitation\nat the Free University of Brussels. He published results from his thesis in a number of papers, for example in the paper\nPointwise compact sets of Baire-measurable functions\nwhich was submitted in September\n1976\nand published in\n1978\n. This paper was written jointly with David H Fremlin and Michel Talagrand who were both at the University of Paris VI when much of the work was being done. Fremlin, who was on the staff at the University of Essex in England, held a temporary post at the University of Paris VI and Michel Talagrand was on the staff at Paris VI. In the paper they thank the American mathematician Haskell Paul Rosenthal \"for introducing us to each other and for providing copies of his work.\" Rosenthal, an expert on\nBanach\nspaces, was a frequent visitor to Paris. We note Bourgain had eleven papers in print by\n1978\nall submitted while he was still undertaking research for his Ph.D.\nHis Habilitation was awarded in\n1979\n\"for work on the structural theory of\nBanach\nSpaces and the relation between their local and infinite dimensional properties\" and Bourgain received the Alumni Prize from the Belgium Scientific Research Fund. This was the first of many prizes awarded to Bourgain.\nA list of\n15\nof these prizes is given at\nTHIS LINK\n.\nWhen his Research Fellowship ended in\n1981\n, Bourgain was appointed a professor at the Free University of Brussels. He held this appointment until\n1985\n, receiving great honours for his research work. He was awarded the Empain Prize by the Belgium NSF in\n1983\n, and, in the same year, he also received the Salem Prize. Vitali Milman recalls in\n[\n16\n]\n:-\nI first met Jean sometime in\n1982\n-\n1983\nat a conference. At that time he was involved in all aspects of the classical\n(\ninfinite-dimensional\n)\nBanach\nspace theory. I noted his interest in finite-dimensional talks and suggested that I could \"introduce\" him to this theory. A quick ironic smile passed over his face, but he came to Israel in the\n1983\n-\n84\nacademic year, first to Jerusalem and then to Tel Aviv to see me, and we started our first discussion and later published a paper\n(\non \"distances between normed spaces\"\n)\n. The next academic year\n1984\n-\n85\nwe spent together at the Institut des Hautes Études Scientifiques, Bures-sur-Yvette\n(\nnear Paris\n)\n. It was an amazingly productive time, many open problems were solved and we became very close friends.\nThe year\n1984\n-\n85\nspent at the Institut des Hautes Études Scientifiques was so that Milman and Bourgain could attend the special year on high dimensional convexity. Their joint work solved\n[\n3\n]\n:-\n... an old problem of\nK Mahler\non the volume of convex bodies and their polar, proving a converse to\nSantaló\n's inequality. One of the original motivations lies in the geometry of numbers, but\n[\ntheir\n]\nwork became later also important to theoretical computer science.\nIn\n1985\nBourgain was awarded the highest science honour from Belgium, the De Leeuw-Damry-Bourlart Excellence Prize. Also in\n1985\nBourgain left Belgium and accepted two appointments, one as\nJ L Doob\nProfessor of Mathematics at the University of Illinois in the United States and the other as Professor at the Institut des Hautes Études Scientifiques at Bures-sur-Yvette in France. The\nFrench Academy of Sciences\nawarded Bourgain its Langevin Prize in\n1985\nand its highest award, the\nÉlie Cartan\nPrize in\n1990\n.\nBourgain has made outstanding contributions across a whole range of topics in analysis. At the International Congress of Mathematicians in Zürich in\n1994\n, he received his greatest honour for this work when he was awarded a\nFields\nMedal.\nCaffarelli\naddressed the Congress on Bourgain's work which had led to this honour\n[\n12\n]\n:-\nBourgain's work touches on several central topics of mathematical analysis: the geometry of\nBanach\nspaces, convexity in high dimensions, harmonic analysis, ergodic theory, and finally, nonlinear partial differential equations from mathematical physics.\nLindenstrauss\nwrites in\n[\n37\n]\n:-\nHe has an extremely strong analytic power which he often combined with ideas and methods of \"soft\" analysis to solve a very long list of well-known hard problems from many different areas. In his work one also finds many surprising and fascination connections between areas which were, prior to his work, quite unrelated.\nIn his work on\nBanach\nspaces, Bourgain has studied problems examining how large a section of a finite dimensional\nBanach\nspace can look like a\nHilbert\nsubspace. In\n1989\nhe proved some remarkable results, using analytic and probabilistic methods, which solved the\nL\n(\np\n)\nL(p)\nL\n(\np\n)\nproblem which had been a longstanding one in\nBanach\nspace theory and harmonic analysis.\nAs mentioned above, he proved\nSantaló\n's inequality on the volume of the unit ball of a norm on\nR\nn\n\\mathbb{R}^{n}\nR\nn\nwhich is having important consequences in a variety of different areas including number theory and theoretical computer science. His work on ergodic theory has been extremely innovative, setting up a new theory examining averages under families of polynomial iterations.\nAnother important contribution was Bourgain's result for the circle maximal function. Given a continuous function\nf\nf\nf\non\nR\n2\n\\mathbb{R}^{2}\nR\n2\na new function\nF\n(\nx\n)\nF(x)\nF\n(\nx\n)\ncan be defined where\nF\n(\nx\n)\nF(x)\nF\n(\nx\n)\nis the maximum, relative to the radius, of the averages of the values of\nf\nf\nf\non circles centred at\nx\nx\nx\n. Bourgain obtained bounds for\nF\nF\nF\nin the\n2\n-dimensional case in\n1986\n, using\n[\n12\n]\n:-\n... delicate geometric arguments. This result also solved a long-standing open problem concerning the existence of certain fractal sets in the plane.\nA more technical description of some of Bourgain's work can be found in\n[\n12\n]\nand\n[\n37\n]\n; the article\n[\n42\n]\ncontains a selected list of Bourgain's papers up to\n2007\n. The paper\n[\n11\n]\ncontains a survey relating to Bourgain's work on nonlinear partial differential equations from mathematical physics, including later results than was covered in the articles describing his work up to the award of the\nFields\nMedal.\nIn\n1988\nBourgain was named Lady Davis Professor of Mathematics at the Hebrew University in Jerusalem and, in\n1991\n, Fairchild Distinguished Professor at the California Institute of Technology in the United States. In\n1995\nBourgain left his appointment at the Institut des Hautes Études Scientifique, having been appointed to the Institute for Advanced Study at Princeton in\n1994\n.\nBourgain married the mathematician Mei-Chu Chang who was awarded a Ph.D. in\n1982\nfrom the University of California, Berkeley for the thesis\nSome results on stable rank\n2\nvector bundles and reflexive sheaves on\nP\n(\n3\n)\n\\mathbb{P}(3)\nP\n(\n3\n)\n. Mei-Chu Chang has\n95\npublications listed in MathSciNet\n(\nin November\n2023)\n, ten of them written jointly with Jean Bourgain. She is a professor at the University of California, Riverside researching in algebraic geometry and combinatorial number theory. Jean Bourgain and Mei-Chu Chang have one child, Eric Bourgain-Chang, who is also a mathematician with two published papers, one jointly authored with his father. As well as working in the Department of Mathematics, Eric also works in the Interdisciplinary Center for Quantitative Modeling in Biology, University of California, Riverside, California.\nBourgain was awarded a number of honorary degrees and awards in addition to those mentioned above. In\n1991\nhe received an honorary degree from the Hebrew University and, in the same year, he was awarded the Ostrowski Prize from the Ostrowski Foundation in Switzerland. In\n1994\nhe was awarded an honorary degree from the Université Marne-la-Valle in France and, in the following year, from the Free University of Brussels.\nIn addition to the honours mentioned above, Bourgain was elected to the\nAcademy of Sciences\nin Paris\n(2000)\n, the\nPolish Academy of Sciences\n(2000)\n, the Academia Europaea\n(2008)\n, the\nRoyal Swedish Academy of Sciences\n(2009)\n,\nNational Academy of Sciences\n(2011)\n, and the Royal Flemish Academy of Arts and Sciences\n(2013)\n. He has been invited to give addresses at major conferences such as the International Congress of Mathematicians in Warsaw\n(1983)\n, the International Congress of Mathematicians in Berkeley\n(1986)\n, the European Mathematical Congress in Paris\n(1992)\n, the International Congress of Mathematicians in Zürich\n(1994)\n, and the European Mathematical Congress in Amsterdam\n(2008)\n.\nHe has also been invited to give many prestigious lecture series such as: the\nA Zygmund\nLectures, University of Chicago\n(1989)\n, the R de Francia Memorial Lectures, Autonoma University, Spain\n(1991)\n, the\nAmerican Mathematical Society\nColloquium Lectures\n(1994)\n, the A Ziwet Lectures, University of Michigan\n(1995)\n, the IAS/Park City Lectures, Park City\n(1995)\n, the\nFields\nLectures, Toronto, Canada\n(2004)\n, the T Wolff Memorial Lectures, California Institute of Technology\n(2004)\n, the\nLandau\nLectures, Hebrew University, Jerusalem\n(2005)\n, and the Trjitzinsky Memorial Lectures, University of Illinois\n(2005)\n, Goran Gustafsson Lectures, KTH Royal Institute of Technology in Stockholm\n(2010)\n, the\nAhlfors\nLectures, Harvard University\n(2010)\n, the\nLeonardo da Vinci\nLectures, Milan\n(2011)\n, and the\nChern\nLectures, University of California, Berkeley\n(2012)\n.\nBetween\n2009\nand his death in\n2018\n, he was awarded six major prizes and the honour of having the title of Baron bestowed on him by King of Belgium in July\n2015\n. The coat of arms was designed by Bourgain and is inscribed IN SPEM CONTRA SPEM\n(\nin hope against hope\n)\n. Bourgain explained his design\n[\n50\n]\n:-\nThe essential part is the centre where you see four mutually tangent circles that generate a so-called Apollonian circle packing\n(\nnamed after\nApollonius of Perga\n,\n2\nnd century B.C.\n)\n. Such a packing is a fractal set in the plane, which one obtains if one keeps removing from the curvilinear triangles the tangent discs. In the Renaissance, these configurations were a subject of study for the French philosopher and mathematician\nRené Descartes\nand later, in the twentieth century, for Frederick Soddy, who won the\n1921\nNobel Prize in Chemistry. Soddy discovered the integral Apollonian packings\n(\nIACP\n)\nwhere the reciprocals of the radii are integers, for all circles in the packing. The theory of these IACP is today a rich mathematical research area, at the interface of hyperbolic geometry, dynamics, and number theory.\nIn\n2010\nBourgain won the Shaw Prize\n[\n51\n]\n:-\n... for his profound work in mathematical analysis and its application to partial differential equations, mathematical physics, combinatorics, number theory, ergodic theory and theoretical computer science.\nFor more information about Bourgain and the\n2010\nShaw Prize, see\nTHIS LINK\n.\nIn\n2012\nBourgain and\nTerence Tao\nwon the Crafoord Prize\n[\n49\n]\n:-\n... for their brilliant and ground-breaking work in harmonic analysis, partial differential equations, ergodic theory, number theory, combinatorics, functional analysis and theoretical computer science.\nFor more information about Bourgain and the\n2012\nCrafoord Prize, see\nTHIS LINK\n.\nIn\n2017\nBourgain won the Breakthrough Prize in Mathematics for\n[\n20\n]\n:-\n... multiple transformative contributions to analysis, combinatorics, partial differential equations, high-dimensional geometry, and number theory.\nFor more information about Bourgain and the\n2017\nBreakthrough Prize in Mathematics, see\nTHIS LINK\n.\nIn\n2018\nBourgain won the Steele Prize for Lifetime Achievement. Bourgain\n[\n30\n]\n:-\n... is a giant in the field of mathematical analysis, which he has applied broadly and to great effect. In many instances, he provided foundations for entirely new areas of study and in other instances he gave mathematics new tools and techniques. He has solved long-standing problems in\nBanach\nspace theory, harmonic analysis, partial differential equations, and Hamiltonian dynamics. Bourgain's work has had important consequences in probability theory, ergodic theory, combinatorics, number theory, computer science, and theoretical physics. His vision, technical power, and broad accomplishments are astounding.\nFor more information about Bourgain and the\n2018\nSteele Prize for Lifetime Achievement, see\nTHIS LINK\n.\nWe have described many wonderful contributions to mathematics by Bourgain but we have not yet mentioned his editorial work. He has been on the editorial boards of many journals including: the\nAnnals of Mathematics\n, the\nJournal de l'Institut de Mathématiques de Jussieu\n, the\nPublications Mathématiques de l'IHES\n, the\nInternational Mathematical Research Notices\n, the\nJournal of Geometrical and Functional Analysis\n, the\nJournal d'Analyse de Jérusalem\n, the\nJournal of Discrete and Continuous Dynamical Systems\n, the\nJournal of Functional Analysis\n, the\nDuke Mathematical Journal\n, the\nJournal\nof the\nEuropean Mathematical Society\n, and\nComptes Rendus\nof the\nAcademy of Sciences in Paris\n.\nBourgain did not like lecturing at undergraduate level and throughout his career made every effort to avoid giving such lectures. He loved lecturing on the latest results he had just proved but he found it difficult to realise that even when top mathematicians were in the audience, they would not understand things that he found obvious. Vitali Milman tried to encourage Bourgain to make his talks more elementary\n[\n16\n]\n:-\nGenerally, in his young years Jean's talks have been considered to be non-understandable. I think that he just did not put an effort to realise, what the audience may not know. This worried me very much during the\n1984\n-\n85\nyears at IHES. Our joint dream was that he will impress the permanent members there to the level that he will be invited to stay at IHES at least for the next two years. In the evening before each of his talks there\n(\nand Jean gave a lot of those\n)\nwe discussed it. I, usually, would tell him: \"When people at the conferences don't understand, how you solved problems they worked on for years, they respect you even more. However, if the people at IHES, like\nGromov\n,\nSullivan\n,\nConnes\nand others, will not understand you, they will consider you to be an idiot, not themselves! So, if you want to impress them, they should understand!\" And Jean tried, and succeeded!\nIn October\n2014\nBourgain was diagnosed with pancreas cancer. A month later he wrote to Vitali Milman\n[\n52\n]\n:-\nRight now I am in Belgium and will remain there for quite some time. In fact, confidentially speaking, I should update you about something not very pleasant. Basically, I am in quite bad shape as a way of putting it. A month ago I got diagnosed with pancreas cancer and presently undergoing chemo in my sister's hospital. This will be going on for several more months so surely in January I will still be here. Otherwise I'm in good mood because maths is going well ...\nA few months later, Milman visited Bourgain in Belgium\n[\n52\n]\n:-\nJean was a very nice and open person with the people he liked, and he had an extremely responsible and strong personality. When we\n(\nme and my wife\n)\nvisited him in his sister's house in Belgium a few months after he was diagnosed with cancer, almost the first thing he said was: \"Why should we be sad? Is being sad helpful? It is not, so we are not going to be sad!\" Saying this he brought a bottle of a very good wine, which he could not drink himself, as we learned after it was opened, and served it to us. He knew at that time, as did we, that the expected survival rate with his diagnosis was between half a year and one year! It was a miracle that he survived and worked\n(\n!\n)\nfour and a half years after he was diagnosed. The creator of this miracle was, of course, his sister, Professor of Medicine, Claire Bourgain. We are infinitely grateful to her.\nHis sister Claire writes in the letter\n[\n10\n]\nread to the conference held in his memory:-\nThe news of your cancer was a shock. You came to live with us in our home, you were so confident that I would help you through. We tried every possible therapy that was available, your incredible will to live helped everyone of the medical staff to push away the boundaries and go on searching for a cure. Even after your terrible stroke, you found the strength not to give up and to pursue your beloved mathematics. This also deserves a special thank you to everyone at the IAS, who allowed you to continue your work remotely. Without doubt, to be able to work was a major contribution to improve your health. Despite all the pain and fear, curiously we also had a great time together during your illness. We resumed gastronomic events whenever you felt well enough, we showed you parts of Europe you had never seen before, you enjoyed flying with us in our ultralight plane, we had long walks and vibrant discussions ...\nRemarkably\n60\npapers with Bourgain as an author\n(14\nsingle authored,\n46\njointly authored\n)\nhave been published between\n2015\nand\n2023\n. He was against holding a conference in\n2014\nin honour of his\n60\nth birthday but was happy that a conference was held in\n2016\nto celebrate his\n500\nth publication. The conference \"Analysis and Beyond: Celebrating Jean Bourgain's Work and Impact\" was held at the Institute for Advanced Study\n21\nMay\n2016\n-\n24\nMay\n2016\n. Although Bourgain was too ill to attend, a video of his lecture was presented to the conference. This video and those of the other lectures are available, see\n[\n53\n]\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}