{
  "nome_completo": "Jean Le Fèvre",
  "nome_curto": "Jean Le Fèvre",
  "ano_nascimento": "1652",
  "ano_morte": "1706",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Fevre/",
  "lugar_nascimento": "Lisieux, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean Le Fèvre\nis thought to have started work as a weaver. We know nothing of the first thirty years of Le Fèvre's life but some biographers suggest that he came from a humble background\n(\nwhich is almost certain to be true\n)\n.\nThe first definite mention of him in the scientific record is as a friend of an amateur astronomer by the name of Father Pierre. Father Pierre was Professor of\nrhetoric\nat the Collège de Lisieux in Paris and as such he was a colleague of\nJean Picard\nand de\nLa Hire\n.\nPicard\nneeded help with carrying out calculations for his work\nConnaissances des temps\nand looked for an assistant.\nFather Pierre recommended his friend Le Fèvre to\nPicard\nas a possible assistant and, after\nPicard\nhad tested Le Fèvre's abilities, he employed him to assist in the production of\nConnaissances des temps\n. Le Fèvre thus became an associate of\nPicard\nand de\nLa Hire\n, and these two recommended him for membership of the\nAcadémie des Sciences\nshortly after this. Indeed Le Fèvre was elected to membership and began work with\nPicard\non calculating astronomical tables.\nIn October\n1682\nJean Picard\ndied. Le Fèvre continued with the task he had been set of calculating the tables, and he published\nConnaissances des temps\nduring the period\n1685\nto\n1701\n. There is some evidence that in fact he may have published an earlier edition during\n1682\nto\n1684\nbut this is not certain. He also appears to have assisted de\nLa Hire\nwith the surveys of France that he was carrying out.\nLe Fèvre accused\nLa Hire\nof stealing his astronomical tables after\nLa Hire\npublished\nTabulae astronomicae\nin\n1687\n. This was a strange episode for one might have expected Le Fèvre to be well disposed towards\nLa Hire\n. Despite the ill-feeling which now grew up between these two men, nothing dramatic happened during the years from\n1687\nto\n1700\n. Then in that year\nLa Hire\n's son, Gabriel-Philippe de La Hire who had been commissioned by the\nAcadémie des Sciences\nto draw up new astronomical tables, published in Paris\nEphemerides ad annum\n1701\n.\nWith this publication by Gabriel-Philippe de La Hire, Le Fèvre's anger exploded. It is likely that he felt that he should have been named the official publisher of ephemerides by the\nAcadémie des Sciences\nand he was angry that this commission had been given to Gabriel-Philippe de La Hire when he felt that this he should have been given to him. In\n1701\nLe Fèvre vented his anger by publishing a preface to\nConnaissances des temps\nwhich attacked both de\nLa Hire\nand his son. The preface was replaced on government orders by one which praised both de\nLa Hire\nand his son. Le Fèvre was excluded from the\nAcademy\nsoon after this, almost certainly because of his preface, but the official reason given was his failure to attend regularly meetings of the\nAcadémie des Sciences\n(\nwhich was indeed a rule of the Academy\n)\n.\nLe Fèvre continued to publish ephemerides under the pseudonym J de Beaulieu, these appearing in\n1702\n,\n1703\n, and\n1706\n.\nLalande\nidentifies J de Beaulieu as Charles Desforges, but McKeon in\n[\n1\n]\nargues convincingly that J de Beaulieu was Le Fèvre's pseudonym.",
  "math_areas": []
}