{
  "nome_completo": "Jean-Pierre Albert Achille Serre",
  "nome_curto": "Jean-Pierre Serre",
  "ano_nascimento": "1926",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Serre/",
  "lugar_nascimento": "Bages, Pyrénées Orientales, France",
  "lugar_morte": null,
  "biografia": "Jean-Pierre Serre\n's parents, Jean Serre and Adèle Diet, were both pharmacists. His mother Adèle had been a pharmacy student at the University of Montpellier and she took a calculus course\n(\njust for fun, she said, since she liked mathematics\n)\n. In\n1932\nJean-Pierre began his primary school education at the École de Vauvert. It was at the age of seven or eight that he began to enjoy doing mathematics. In\n1937\nhe moved from the École de Vauvert to study at the Lycée Alphonse-Daudet in Nîmes. His mother had kept the calculus books that she had bought when she took the mathematics course at the University of Montpellier and Jean-Pierre began to learn mathematics from these books\n[\n9\n]\n:-\nWhen I was\n14\nor\n15\n, I used to look at these books, and study them. This is how I learned about derivatives, integrals, series and such\n(\nI did that in a purely formal manner -\nEuler\n's style so to speak: I did not like, and did not understand, epsilons and deltas.\n)\nAt this time mathematics wasn't the only subject he enjoyed. Although he never took much interest in physics, he enjoyed chemistry which was a topic that his parents, being pharmacists, knew a lot about. In particular his father had a lot of chemistry books which Jean-Pierre read when he was fifteen or sixteen years old. In fact he enjoyed one of these books so much that he kept a copy of it - this was the book \"Les colloïdes\", Gauthier-Villars,\n1922\nby Jacques Duclaux\n(1877\n-\n1978)\n. However, as he went deeper into chemistry he became less enthusiastic about the subject and became more convinced that mathematics was the topic for him.\nHe spoke about his time at the Lycée Alphonse-Daudet in Nîmes in\n[\n9\n]\n:-\nIn high school I used to do problems for more advanced classes. I was then in a boarding house in Nimes, staying with children older than I was, and they used to bully me. So to pacify them, I used to do their mathematics homework. It was as good a training as any.\nAt the Lycée in Nîmes in the year\n1943\n-\n44\nhe had a good mathematics teacher who was nicknamed \"Le Barbu\" since he had a beard. He was\n[\n9\n]\n:-\n... very clear, and strict; he demanded that every formula and proof be written neatly.\nHe coached Serre for the Concours General in mathematics which he sat in\n1944\nand was placed first. Also in\n1944\nhe sat the Concours General in physics but since he spent the whole six-hour examination using an incorrect formula, he scored poorly. Serre was awarded his Bachelier ès sciences et ès lettres in\n1944\nbut remained at the Lycée until\n1945\npreparing to take the entrance examination to enter the École Normale Supérieure in Paris. While at the Lycée\n[\n9\n]\n:-\nI had no idea one could make a living by being a mathematician. It was only later I discovered one could get paid for doing mathematics! What I thought at first was that I would become a high school teacher: this looked natural to me. Then, when I was\n19\n, I took the competition to enter the École Normale Superieure, and I succeeded. Once I was at \"l'École\", it became clear that it was not a high school teacher I wanted to be, but a research mathematician.\nFrom\n1945\nto\n1948\nSerre studied at the École Normale Supérieure and was awarded his Agrégé des sciences mathematique in\n1948\n. At this time he became the youngest member of the\nBourbaki\ngroup of mathematicians. This group included those who had been involved since the mid\n1930\ns such as\nHenri Cartan\n,\nClaude Chevalley\n,\nJean Delsarte\n,\nJean Dieudonné\nand\nAndré Weil\n. Around the time that Serre joined the\nBourbaki\ngroup, others such as\nRoger Godement\n,\nPierre Samuel\nand\nJacques Dixmier\nalso joined.\nSerre married Josiane Heulot\n(1922\n-\n2004)\non\n10\nAugust\n1948\n; they had one child, a daughter Claudine born on\n29\nNovember\n1949\n. Josiane was an organic chemist working at the École Normale Supérieure de jeunes filles at Sèvres.\nFrom\n1948\nto\n1954\nSerre held positions at the Centre National de la Recherche Scientifique in Paris, first as attaché and then as chargé de recherches. In\n1948\n-\n49\nhe attended\nHenri Cartan\n's seminar which was on\nalgebraic topology\nand sheaf theory. Also attending\nHenri Cartan\n's seminar in that year were\nClaude Chevalley\n,\nJean Delsarte\n,\nJean Dieudonné\n,\nRoger Godement\n,\nLaurent Schwartz\n, and\nAndré Weil\n. One of Serre's fellow students was\nAlexander Grothendieck\nand he also attended the seminar.\nGrothendieck\nand Serre became friends at this time. Serre was advised by\nHenri Cartan\nbut\n[\n18\n]\n:-\n...\nCartan\ndid not suggest research topics to his students: they had to find one themselves; after that he would help them. This is what happened to me. I found that\nLeray\n's theory\n(\nabout fibre spaces and their spectral sequence\n)\ncould be applied to many more situations than was thought possible and that such an extension could be used to compute homotopy groups.\nHe was awarded his doctorate from the Sorbonne in\n1951\nfor his thesis\nHomologie singulière des espaces fibrés. Applications\nⓉ\n(\nSingular homology of fiber spaces: applications\n)\n. In\n1952\nhe went to Princeton where he lectured on the results in his thesis and also on\nC\nC\nC\n-theory which was the continuation of this work. While in Princeton he attended the\nArtin\n-\nTate\nseminar on class field theory. Returning to Paris, he again attended the\nHenri Cartan\nseminar which, in that year, was discussing functions of several complex variables and\nStein\nmanifolds. The ideas he met in this seminar motivated the direction of his research. In\n1953\n-\n54\nhe was maître de recherches at the Centre National de la Recherche Scientifique.\nIn\n1954\nSerre went to the University of Nancy where he worked until\n1956\n. From\n1956\nhe held the chair of Algebra and Geometry in the Collège de France until he retired in\n1994\nwhen he became an honorary professor. He describes in\n[\n16\n]\nhis inaugural lecture at the Collège de France:-\nI was a young man, about\n30\n, when I arrived at the Collège. The inaugural lecture was almost like an oral examination in front of professors, family, mathematician colleagues, journalists etc. I tried to prepare it, but after a month I only managed to write half a page. When the day of the lecture came, it was quite a tense moment. I started by reading the half page I had prepared and then I improvised.\nA few months later he was informed that inaugural lectures were published and he was asked to supply a transcript. As the lecture had been improvised he had no transcript but tried to recreate it by giving an impromptu lecture into a tape recorder and then giving the tape to a secretary to type up. However, the secretary said that the recording was inaudible. Serre then gave up and his inaugural lecture was never published. This makes it unique as every other inaugural lecture at the Collège de France that has been published.\nHe has also spoken about his teaching career at the Collège de France\n(\nsee for example\n[\n16\n]\n)\n:-\nTeaching at the Collège is both a marvellous and a challenging privilege. Marvellous because of the freedom of choice of subjects and the high level of the audience: Centre National de la Recherche Scientifique researchers, visiting foreign academics, colleagues from Paris and Orsay - many regulars who have been coming for\n5\n,\n10\nor even\n20\nyears. It is challenging too: new lectures have to be given each year, either on one's own research\n(\nwhich I prefer\n)\n, or on the research of others. Since a series of lectures for a year's course is about\n20\nhours, that's quite a lot.\nHis permanent position in the Collège de France allowed Serre to spend quite a lot of time making research visits. In particular he spent time at the Institute for Advanced Study at Princeton\n(\nin\n1955\n,\n1957\n,\n1959\n,\n1961\n,\n1963\n,\n1967\n,\n1970\n,\n1972\n,\n1978\n,\n1983\n,\n1999)\nand at Harvard University\n(\nin\n1957\n,\n1964\n,\n1974\n,\n1976\n,\n1979\n,\n1981\n,\n1985\n,\n1988\n,\n1990\n,\n1992\n,\n1994\n,\n1995\n,\n1996)\n. Here is a list of the universities where Serre delivered courses\n(\nin alphabetical order\n)\n: Algiers\n(1965\n,\n1966)\n, Bonn\n(1976)\n, CalTech\n(1997)\n, Eugene\n(1998)\n, Geneva\n(1999)\n, Göttingen\n(1970)\n, McGill\n(1967)\n, Mexico\n(1956)\n, Moscow\n(1961\n,\n1984)\n, Princeton\n(1952\n,\n1999)\n, Singapore\n(1985)\n, U.C.L.A.\n(2001)\n, Utrect\n(1974)\n.\nSerre's early work was on spectral sequences. A spectral sequence is an algebraic construction like an exact sequence, but more difficult to describe. Serre did not invent spectral sequences, these were invented by the French mathematician\nJean Leray\n. However, in\n1951\n, Serre applied spectral sequences to the study of the relations between the homology groups of fibre, total space and base space in a fibration. This enabled him to discover fundamental connections between the homology groups and homotopy groups of a space and to prove important results on the homotopy groups of spheres.\nSerre's work led to topologists realising the importance of spectral sequences. The Serre spectral sequence provided a tool to work effectively with the homology of fiberings. For this work on spectral sequences and his work developing complex variable theory in terms of sheaves, Serre was awarded a\nFields Medal\nat the International Congress of Mathematicians in\n1954\n. Serre's theorem led to rapid progress not only in homotopy theory but in algebraic topology and homological algebra in general. As an example of Serre's approach to attacking a problem, we quote from the interview\n[\n9\n]\n. Here Serre was answering a question about the importance of inspiration:-\nI don't know what \"inspiration\" really means. Theorems, and theories, come up in funny ways. Sometimes, you are just not satisfied with existing proofs, and you look for better ones, which can be applied in different situations. A typical example for me was when I worked on the\nRiemann\n-\nRoch\ntheorem\n(\ncirca\n1953)\n, which I viewed as an \"\nEuler\n-\nPoincaré\n\" formula\n(\nI did not know then that\nKodaira\n-\nSpencer\nhad had the same idea.\n)\nMy first objective was to prove it for algebraic curves - a case which was known for about a century! But I wanted a proof in a special style; and when I managed to find it, I remember it did not take me more than a minute or two to go from there to the\n2\n-dimensional case\n(\nwhich had just been done by\nKodaira\n)\n. Six months later, the full result was established by\nHirzebruch\n, and published in his well-known\nHabilitation\nthesis. Quite often, you don't really try to solve a specific question by a head-on attack. Rather you have some ideas in mind, which you feel should be useful, but you don't know exactly for what they are useful. So, you look around, and try to apply them. It's like having a bunch of keys, and trying them on several doors.\nOver many years Serre has published many highly influential texts covering a wide range of mathematics. These texts, which show the topics Serre has worked on, are\nHomologie singulière des espaces fibrés\nⓉ\n(\nSingular homology of fiber spaces\n)\n(1951)\n,\nFaisceaux algébriques cohérents\nⓉ\n(\nConsistent algebraic beams\n)\n(1955)\n,\nGroupes d'algébriques et corps de classes\nⓉ\n(\nAlgebraic Groups and classes of body\n)\n(1959)\n,\nCorps locaux\nⓉ\n(\nLocal rings\n)\n(1962)\n,\nCohomologie galoisienne\nⓉ\n(\nGalois cohomology\n)\n(1964)\n,\nAlgèbre Locale. Multiplicités\nⓉ\n(\nLocal algebra: multiplicities\n)\n(1965)\n,\nLie Algebras and Lie Groups\n(1965)\n,\nAlgèbres de Lie semi-simples complexes\nⓉ\n(\nComplex semi-simple Lie algebras\n)\n(1966)\n,\nAbelian l-adic representations and elliptic curves\n(1968)\n,\nReprésentations linéaires des groupes finis\nⓉ\n(\nLinear representations of finite groups\n)\n(1968)\n,\nCours d'arithmétique\nⓉ\n(\nA course of Arithmetic\n)\n(1970)\n,\nReprésentations linéaires des groupes finis\nⓉ\n(\nLinear representations of finite groups\n)\n(1971)\n,\nArbres, amalgames\nⓉ\n(\nTrees, amalgams\n)\n,\nS\nL\n2\nSL_{2}\nS\nL\n2\n​\n(1977)\n,\nLectures on the Mordell-Weil theorem\n(1989)\n,\nTopics in Galois theory\n(1992)\n,\nExposés de Séminaires\nⓉ\n(\nSeminar Presentations\n)\n1950\n-\n1999\n(2001)\n,\nCorrespondance Grothendieck-Serre\nⓉ\n(\nCorrespondence between Grothendieck and Serre\n)\n(2001)\n,\n(\nwith S Garibaldi and A Merkurjev\n)\nCohomological Invariants in Galois Cohomology\n(2003)\n, and\nLectures on\nN\nX\n(\np\n)\nN_{X}(p)\nN\nX\n​\n(\np\n)\n(2011)\n.\nYou can see some extracts from reviews of these books at\nTHIS LINK\n.\nThese books are outstanding and led to Serre being honoured. In\n1995\nhe was awarded the Steele Prize for mathematical exposition and the citation for the award reads\n[\n2\n]\n:-\nIt is difficult to decide on a single work by a mathematician of Jean-Pierre Serre's stature which is most deserving of the Steele Prize. Any one of Serre's numerous other books might have served as the basis of this award. Each of his books is beautifully written, with a great deal of original material by the author, and everything smoothly polished. It would be hard to make any significant improvement on his expositions; many are the everyday standard references in their areas, both for working mathematicians and graduate students. Serre brings his whole mathematical personality to bear on the material of these books; they are alive with the breadth of real mathematics and are an example to all of how to write for effect, clarity, and impact.\nThe references\n[\n8\n]\nand\n[\n9\n]\nprovide a fascinating view of Serre's views on some aspects of his career up to\n1985\n:-\nPresently, the topic which amuses me most is counting points on algebraic curves over finite fields. It is a kind of applied mathematics: you try to use any tool in\nalgebraic geometry\nand number theory that you know of, ... and you don't quite succeed!\nThe interview in\n[\n8\n]\nand\n[\n9\n]\nalso provides a chance to examine Serre's views on mathematics. However, we choose here to quote from\n[\n16\n]\non Serre's view on applications of mathematics:-\nAs for the place of mathematics in relation to other sciences, mathematics can be seen as a big warehouse full of shelves. Mathematicians put things on the shelves and guarantee that they are true. They also explain how to use them and how to reconstruct them. Other sciences come and help themselves from the shelves, mathematicians are not concerned with what they do with what they have taken. this metaphor is rather coarse, but it reflects the situation well enough.\n(\nOf course one does not choose to do mathematics just for putting things on shelves; one does mathematics for the fun of it.\n)\nHere is a personal example. My wife, Josiane, was a specialist in quantum chemistry. She needed linear representations of certain symmetry groups. The books she was working with were not satisfactory; they were correct, but they used very clumsy notation. I wrote a text that suited her needs, and then published it in book form, as 'Linear Representations of Finite Groups'. I thus did my duty as a mathematician\n(\nand as a husband\n)\n: putting things on shelves.\nIn the interview\n[\n18\n]\nSerre speaks about his hobbies. He loved rock climbing, skiing and table tennis. I\n[\nEFR\n]\ncan certainly say from personal experience what an excellent table tennis player Serre was, for I've seen him playing at many conferences that we both attended. I always had the\n(\nvery silly\n)\nthought: How can someone who is so good at mathematics be so good at table tennis! Other things that Serre enjoys are chess, reading books and the movies. He said he liked books\n[\n9\n]\n:-\n... of all kinds, from Giono to Böll to Kawabata, including fairy tales and the Harry Potter series.\nSerre has received numerous awards. In addition to the\nFields\nMedal in\n1954\nhe was elected an honorary member of the\nLondon Mathematical Society\nin\n1973\n, and a Fellow of the\nRoyal Society of London\nin\n1974\n. He has also been made an Officer Légion d'Honneur and Commander Ordre National du Mérite. He has been elected to many national academies in addition to the Royal Society, in particular the academies of France\n(1977)\n, the Netherlands\n(1978)\n, the United States\n(1979)\n, Sweden\n(1981)\n, Russia\n(2003)\n, Norway\n(2009)\n, Turin\n(2010)\nand Taiwan\n(2010)\n. He was awarded the Prix Peccot-Vimont by the Collège de France\n(1955)\n, the Prix\nFrancoeur\nby the\nAcadémie des Sciences\n(1957)\n, the Prix\nGaston Julia\n(1970)\n, the Médaille\nÉmile Picard\nby the\nAcadémie des Sciences\n(1971)\n, the Prix Balzan\n(1985)\n, the Gold Medal from the C.N.R.S.\n(1987)\n, the Steele Prize, described above, from the\nAmerican Mathematical Society\n(1995)\nand the Wolf Prize in\n2000\n. He has been awarded honorary degrees from the University of Cambridge in\n1978\n, the University of Stockholm in\n1980\n, the University of Glasgow in\n1983\n, the University of Athens in\n1996\n, Harvard  University in\n1998\n, the University of Durham in\n2000\n, the University of London in\n2001\n, the University of Oslo in\n2002\n, the University of Oxford in\n2003\n, the University of Bucharest in\n2004\n, the University of Barcelona in\n2004\n, the University of Madrid in\n2006\nand the University of McGill in\n2008\n. In June\n2003\nhe was awarded the first\nAbel\nPrize by the Norwegian Academy of Science and Letters\n[\n6\n]\n:-\n... for playing a major role in giving a number of mathematical topics their modern form, notably topology, algebraic geometry and the theory of numbers.\nThe events surrounding this ceremony are described in several articles. The following is extracted from\n[\n18\n]\n:-\nThe events started in bright sunshine in Oslo on Sunday,\n1\nJune\n2003\n, with a simple ceremony at the\nAbel\nMonument in Slottsparken. After Jens Erik Fenstad, chair of the Abel Board\n(\norganizer of the prize events\n)\n, had given a short speech, the\nAbel\nlaureate, Jean-Pierre Serre, laid a wreath at the monument. On\n2\nJune the scientific program started in Georg Sverdrup's house, the wonderful new library at the University of Oslo in Blindern. ... Serre's lecture was entitled \"Prime numbers, equations and modular forms\". He fully lived up to his reputation as a master expositor, lecturing in the old-fashioned way with chalk on the blackboard, and impressed everybody with a very clear presentation without notes. ... Later in the afternoon, Jean-Pierre Serre received several parties of journalists for interviews. On Tuesday morning Serre and representatives of the Abel Committee and the Abel Board met the world press: ten journalists from Norway, England, France, and Germany. On Tuesday afternoon the prize was presented at a ceremony, with due pomp and circumstance, at the University of Oslo. King Harald and Queen Sonja attended, and after some speeches the king presented the prize to Serre.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}