{
  "nome_completo": "Jean-François Champollion",
  "nome_curto": "Jean-François Champollion",
  "ano_nascimento": "1790",
  "ano_morte": "1832",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Champollion/",
  "lugar_nascimento": "Figeac, Lot, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean-François Champollion\nwas the son of the book seller Jacques Joseph Champollion\n(1744\n-\n1821)\nand his wife Jeanne Françoise Gallieu\n(1744\n-\n1805)\n. Jacques Joseph married Jeanne Françoise in Figeac on\n28\nJanuary\n1773\n. They had seven children: Guillaume Champollion\n(1773\n-\n1773)\n; Thérèse Champollion\n(\nborn\n1774)\n; Pétronille Champollion\n(\nborn\n1776)\n; Jacques-Joseph Champollion-Figeac\n(1778\n-\n1867)\n; Jean-Baptiste Champollion\n(\nborn\n1780)\n; Marie Jeanne Champollion\n(\nborn\n1782)\n; and Jean-François Champollion\n(1790\n-\n1832)\n, the subject of this biography. Jacques Joseph Champollion had been born in La-Roche-des-Engelas which today is known as Valbonnais, Rhône-Alpes, France. He was an itinerant book seller before he moved to Figeac in\n1770\nwhere he bought a house in the narrow lane, the Rue de la Boudousquerie, in\n1772\n, and a bookshop overlooking the market place in the Place Basse in\n1779\n[\n42\n]\n:-\nThere are strong hints from his contemporaries that Jacques enjoyed the bohemian life, and he unquestionably took to the bottle in his later years, which destroyed his bookselling business and poisoned relations with his children.\nLet us say right at the beginning of this biography that Jean-François Champollion was not a mathematician, having very little mathematical training. We have included him in this archive, partly because his approach to solving the problems of hieroglyphics was similar to the approach that a mathematician would take in solving problems, partly because some mathematicians worked on the same problems, and partly because his work in understanding hieroglyphics eventually led to others understanding more about the mathematical skills of the ancient Egyptians.\nJean-François Champollion was the last of his parents' children, born eight years after the next youngest. Some biographers, for example Alain Faure, Jean Lacouture and Andrew Robinson, suggest that he was not the child of Jeanne Françoise but rather an illegitimate child of his father Jacques Joseph. Among the reasons for suggesting this is the age of Jeanne Françoise in\n1790\n, the fact that Jean-François Champollion never mentioned his mother in any of the many letters he wrote but does mention a woman in Figeac who is dear to him, a marked difference in temperament between Jean-François and his siblings, and the fact that Jean-François was so dark skinned that he could pass as an Arab in Egypt.\nThe family were poor and Jean-François seems to have been brought up by his brother Jacques-Joseph Champollion-Figeac who was twelve years older. We should explain why his older brother is known as Champollion-Figeac. As the brothers grew up Jean-François became known as 'Champollion le Jeune' but eventually he became the more famous and at this stage his older brother began calling himself Champollion-Figeac. Jean-François's mother, Jeanne Françoise, was illiterate so could not teach her son to read and write. She was, however, a very religious Roman Catholic and had memorised large parts of the Mass. When he was about five years old, she taught Jean-François to recite these from memory and he then seems to have been able to teach himself to read by comparing what he had learnt by heart with the printed text in the prayer book. We note that this experience may have been a positive one when in later life he attempted to decipher hieroglyphics. Jacques-Joseph was impressed when he realised how his young brother had taught himself to read and, beginning in the spring of\n1797\n, he gave the young boy further instruction in reading and writing.\nJacques-Joseph left Figeac and went to Grenoble in\n1798\nto work for an export firm and, left without his brother's tutoring, Jean François was sent to primary school. He did not do well, hated mental arithmetic and soon gave up the schooling. He was then tutored by Jacques-Joseph's former teacher, who taught the young boy Greek and Latin.\nBy the age of ten, Jean-François had not only mastered French but could read Greek and Latin and recite passages from Homer and Virgil\n[\n42\n]\n:-\nHis relations recalled enjoying the family's youngest son act out dramatic scenes from these classics in his own French translation during winter evenings spent around the fireplace at home. Sometimes their friends would slip into the room and gaze with curiosity at the unheard-of spectacle of the boy, seated on a stool next to the hearth\n(\nChampollion always relished physical warmth as a child and as an adult\n)\nwith his eyes sparkling, bringing alive for his family the ancient stories he had learnt how to read.\nJean-François's tutor became worried about his progress, however, writing to Jacques-Joseph in Grenoble to say that his young brother had an apathy to learning, sometimes being keen and at other times refusing to work at all. Jean-François also wrote to his brother explaining his difficulties with studying and in February\n1801\nJacques-Joseph asked Jean-François to join him in Grenoble. He seems to have travelled alone on the stagecoach, arriving in Grenoble on\n27\nMarch and there lived with his brother in a two-room flat on the Grande Rue. He was now taught by his brother and by a private tutor employed by his brother. In November\n1802\nhe entered an excellent day school run by the Abbé Dussert. He did well at this school and studied Hebrew. By the end of his first year of study in\n1803\nhe received an excellent report and now also began to study Arabic, Syriac and Chaldean. At the age of thirteen, in\n1804\n, Champollion wrote his first paper\nRemarks on the fable of the Giants as taken from Hebrew etymologies\n.\nAbbé Dussert's school was excellent and Champollion was thriving there but his brother could not afford the fees. Champollion sat the entrance examinations for the Grenoble Lycée and was accepted and given a bursary to cover his boarding expenses. After a visit back to Figeac, in November\n1804\nhe became a boarder at the Grenoble Lycée. This was not a great success for its extremely strict regime was hated by Champollion. He did take an active part in school activities but his health deteriorated, partly because he spent his nights in private study which was not allowed during the strict school day. Life became a little better for Champollion during his second year at the school. His brother was a friend of\nJoseph Fourier\nwho at this time was Prefect of Grenoble.\nFourier\nhad joined Napoleon's army in its invasion of Egypt in\n1798\nas a scientific adviser. He had helped found the Cairo Institute and was one of the twelve members of the mathematics division; he helped establish educational facilities in Egypt and carried out archaeological explorations. He shared a love of Egypt with Champollion's brother and was writing\nDescription of Egypt\n.\nFourier\nwas interested to hear about the brilliant pupil Champollion who was not allowed time for private study by the Lycée. He spoke to his friend\nJean-Baptiste Biot\nwho met the young student and set about getting the Lycée to allow him time for independent study.\nCertainly the Lycée recognised Champollion's talents and, in August\n1806\n, he was chosen to give a speech during a school visit by Prefect\nFourier\n. Champollion spoke about the Hebrew text of the Bible and answered questions about Oriental languages. In his report,\nFourier\nnoted that he was very impressed by Champollion's wide knowledge which included skills in biology. Champollion continued his independent studies, demanding many texts from his brother.\nFourier\nbecame more involved with Champollion whose deep interest in Egypt he was able to encourage. On\n1\nApril\n1807\nChampollion stopped boarding at the Lycée and returned to live with his brother. This was possible with official permission granted by Prefect\nFourier\n. He continued to study for the leaving examinations and gained some remarkably high marks in the subjects he loved but poor marks in those he disliked. He even received a prize for mathematics which was one of his weakest subjects. When he graduated from the Lycée all his friends knew that studying the mysteries of the Egyptian civilisation would be the passion of his life. At this time the Napoleonic Wars were taking place and Champollion would have been drafted had it not been for\nFourier\narguing that his work studying Egypt was too important to be interrupted.\nChampollion's brother Champollion-Figeac was a secretary of the Grenoble Society of Arts and Sciences and, with\nFourier\n's approval, arranged for Champollion to deliver the lecture\nEssay on the geographical description of Egypt before the conquest of Cambyses\nto the Society on\n1\nSeptember\n1807\n; Champollion was only sixteen years old. He was elected to the Society a few months later.\nSoon after delivering his lecture, Champollion went to Paris where he studied with Silvestre de Sacy, Louis-Mathieu Langlès, and Raphaël de Monachis. Muriel Weissbach writes\n[\n51\n]\n:-\nIn Paris, Jean François attended courses at the College de France and the École des Langues Orientales, where he studied Hebrew, Arabic, Persian, Syriac, Chaldean, and Coptic. He loved languages, and threw himself into their study with incredible joy. As he wrote his brother in December\n1807\n, his course of study was intensive:-\nAt nine o'clock\n[\nMondays\n]\nI follow M de Sacy's Persian class until\n10\n.\n00\n. Leaving the Persian class, since Hebrew, Syriac, and Chaldean are at\n12\n.\n00\n, I go to M Audran's, who offered to take me Mondays, Wednesday, and Fridays from\n10\n.\n00\nto\n12\n.\n00\n. ... We spend these two hours talking oriental languages, translating Hebrew, Syrian, Chaldean, or Arabic. And we always dedicate a half-hour to work on Chaldean and Syriac grammar. At noon, we go down, and he gives his Hebrew class. He calls me the patriarch of the class, because I am the best ... .\nAll this intensive study, Champollion experienced as great fun. In fact, play was a constant element in his language study. When he was concentrating on Arabic, Jean François sported Arab dress, and adopted the nickname, \"al Seghir,\" the younger, in Arabic. And when he immersed himself in Coptic, the language which became his overriding passion, he knew no bounds. He wrote his brother in\n1809\n: \"I am totally immersed in Coptic, I want to know Egyptian as well as I know French, because my great work on the Egyptian papyrus\n[\nhieroglyphics\n]\nwill be based on this language ... . My Coptic is moving along, and I find in it the greatest joy, because you have to think: to speak the language of my dear Amenhotep, Seth, Ramses, Thuthmos, is no small thing. ... As for Coptic, I do nothing else. I dream in Coptic. I do nothing but that, I dream only in Coptic, in Egyptian. ... I am so Coptic, that for fun, I translate into Coptic everything that comes into my head. I speak Coptic all alone to myself\n(\nsince no one else can understand me\n)\n. This is the real way for me to put my pure Egyptian into my head. ... In my view, Coptic is the most perfect, most rational language known.\"\nIn\n1808\nhe first began working on the Rosetta stone. Let us briefly explain the importance of this object. The Rosetta stone was found by soldiers from Napoleon's army when digging the foundations of a fort near the town of Rosetta in July\n1799\n. It was clear to the officer in charge that it was an important discovery which, after Napoleon's defeat, became the property of the British. It arrived in England in February\n1802\n. The Rosetta stone is a part of a larger slab which must have been about twice the size of the existing fragment. It contains three types of writing, Egyptian hieroglyphics, demotic script and ancient Greek. Although the three scripts are not literal translations of each other, they clearly expressed the same message, a decree about King Ptolemy V from around\n200\nBC. We know this since scholars of the time could read the ancient Greek and the final sentence reads:-\nThis decree shall be inscribed on a stela of hard stone in sacred\n[\nhieroglyphic\n]\nand native\n[\ndemotic\n]\nand Greek characters and set up in each of the first, second, and third rank temples beside the image of the ever-living king.\nThe Rosetta stone, therefore, provided an opportunity to try to understand how to read Egyptian hieroglyphics and demotic script. Unfortunately, although most of the demotic script and ancient Greek script survive, only a small part of the Egyptian hieroglyphics remain, the majority having been broken off.\nYou can see a picture of the Rosetta stone at\nTHIS LINK\n.\nChampollion left Paris and returned to Grenoble in\n1810\nwhen he was appointed as Professor of Ancient History at Grenoble University. Although an ancient institution, it had been shut down at the time of the French Revolution and was only re-established by Napoleon in\n1805\n-\n08\n. Although Champollion was not an enthusiastic supporter of Napoleon, after the defeat of Napoleon and the restoration of the royalist in\n1813\n, he decided that Napoleon presented the lesser of two evils. In\n1815\nNapoleon escaped from exile on Elba and assembled an army which entered Grenoble being enthusiastically acclaimed as liberators. Champollion met Napoleon at this time and he remembered that Champollion had managed to avoid being drafted into the army on the grounds that his Egyptian work was important. Napoleon asked Champollion how it was progressing and requested that he send his Coptic grammar to Paris for publication. Champollion's brother Champollion-Figeac joined Napoleon's army and, after defeat at Waterloo in\n1815\n, both brothers were in danger, being supporters of Napoleon. Champollion lost his professorship at Grenoble and was exiled to Figeac.\nContinuing in his attempt to understand Egyptian hieroglyphics, Champollion undertook research on the Rosetta stone as well as using many other examples of hieroglyphics. The question that had to be answered in order to make any headway was\n[\n48\n]\n:-\n... whether Egyptian hieroglyphics even constituted a spoken language. Did the written characters and pictures denote letters, syllables, or words, or were they solely ideographic symbols representing an idea or action like today's \"no smoking\" icons or emojis. These convey concepts, but do not represent speech.\nOf course Egyptian hieroglyphics had puzzled the world for many centuries and the accepted view of those studying them was that they were symbolic and not phonetic. In other words, a picture of a bird did not represent a spoken sound but rather represented an idea such as 'swift'. Little progress had been made in understanding hieroglyphics until the work of two men at almost the same time, namely\nThomas Young\nand Champollion. These two men were very different in that\nThomas Young\nwas a mathematician, physicist and polymath who made contributions to the most amazingly wide range of topics, while Champollion was completely single minded in his research on Egypt and its languages. Although today there is a belief among many that\nThomas Young\nstudied hieroglyphics first, and then Champollion made a major advance building on\nYoung\n's work, in fact this is a vast over simplification. In fact we saw above that Champollion began studying the Rosetta stone in\n1808\nbut, although it was displayed in London from\n1802\nonwards,\nYoung\ndid not begin his studies until\n1814\n. He made a major breakthrough in\n1815\nwhen he\n[\n46\n]\n:-\n... was able to trace how the recognisably pictographic hieroglyphs, showing human figures, animals, plants and objects of many kinds, had developed into their cursive equivalents in the hieratic and demotic scripts.\nHe realised that there was no demotic alphabet but it consisted of imitations of the hieroglyphics mixed with letters of an alphabet. He wrote to Silvestre de Sacy, Champollion's former teacher, about his discoveries and received a surprising reply\n(\nsee for example\n[\n46\n]\n)\n:-\nIf I might venture to advise you, I would recommend you not to be too communicative of your discoveries to M Champollion. It may happen that he may hereafter make pretension to the priority. He seeks, in many parts of his book, to make it believed that he has discovered many words of the Egyptian inscription of the Rosetta Stone; but I am afraid that this is mere charlatanism: I may add that I have very good reason for thinking so.\nThere is a complicated three-way political situation playing out here. We are just post-Waterloo with obvious political stresses between Britain and France. But, post-Waterloo, there are strong political differences in France itself between the Royalist, de Sacy and the supporter of Napoleon, Champollion. Sadly, scholarship often fails to rise above politics. This said, de Sacy probably knew Champollion well enough to understand the young man's personality.\nBefore continuing with Champollion's achievements, let us note that, on\n30\nDecember\n1818\nin Grenoble, Champollion married Rosine Blanc\n(1794\n-\n1871)\n, who came from a family of glove makers from Grenoble. Their only child was a daughter, Zoraïde Chéronnet-Champollion\n(1824\n-\n1889)\n. In\n1821\nChampollion was involved in an uprising against the French King\n[\n5\n]\n:-\n[\nIn\n]\nMarch, Champollion's friend Thévenet started a rumour that Louis XVIII had abdicated. In response, several hundred Grenoblois converged on the prefecture waving the tricolore, and d'Haussez struggled to persuade his troops to venture out against them. \"D'Haussez and Pamphile then issued blood-curdling proclamations,\" writes Robert Alexander, \"put Grenoble in a state of siege, and ordered arrests.\" Champollion was already under suspicion. On\n3\nMarch the Royal Council had suspended his position at the lycée, and during the revolt, he had been seen among the rebels. D'Haussez attacked with renewed ferocity, attempting to have Champollion charged with treason, an offence punishable by death. Champollion escaped this fate thanks to the arrival in Grenoble of Claude-Victor Perrin, Duc de Bellune, who had been sent by the king to prevent destabilising repercussions. Tried in civil court rather than for sedition, Champollion was acquitted, but his position at the lycée was a lost cause. As this setback only confirmed his father-in-law's low opinion of him, sheltering with Rosine's well-to-do family was also out of the question. Nothing was left but to abandon Isère, leaving Rosine with her family, and to regroup under his brother's protection in Paris.\nChampollion left Grenoble for Paris in July\n1821\nbut three months earlier he had published a paper on hieroglyphics. In this paper he made four claims, two of which were significant. One of these two was the same claim\nYoung\nhad made in\n1819\n, namely that demonic was a simple modification of hieroglyphic. This claim was correct but made no reference to\nYoung\n. He claimed he had not read\nYoung\n's paper at this stage, which is probably true. The other claim was that hieroglyphics was signs of things not of sounds, which is incorrect. Once in Paris, Champollion did read\nYoung\n's paper. He realised that his own paper had been in error and tried to suppress it. He claimed, however, that this was not because of\nYoung\n's paper, something which is hard to believe. Although Champollion comes out of this incident with little credit, he then went on to go far further than\nYoung\nand made remarkable breakthroughs.\nOn\n27\nSeptember\n1822\nhe announced his major breakthrough in a paper to the Academy of Inscriptions and in the following month he published a complete list of signs of both hieroglyphics and demotics with their Greek equivalents.\nThomas Young\nsat beside Champollion at the\n27\nSeptember meeting at the Academy of Inscriptions and was very impressed by his advances. He was, however, sad not to receive the credit from Champollion that he felt he deserved. Champollion continued to make further major advances, announcing these in April\n1823\nand then publishing definitive results in\nPrécis du système hiéroglyphique des anciens Égyptiens\nⓉ\n(\nSummary of the hieroglyphic system of the ancient Egyptians\n)\n(1824)\n.\nIn\n1824\nhe travelled to Turin to view Egyptian materials, which he catalogued, then went to Rome to view further Egyptian monuments. He began to make plans to visit Egypt. In\n1826\nhe was appointed curator of the Egyptian collections of the Musée du Louvre and, with the help of his brother, Champollion-Figeac, he created an Egyptian exhibition in four rooms at the Louvre. In July\n1828\nChampollion sailed to Egypt. Once there he examined texts at many sites and made an important step in being able to read divisions of time. He was, however, appalled at the looting that had gone of at the tombs of the kings in the Valley of the Kings. He returned to France in\n1830\nbringing many antiquities with him.\nBack in Paris the chair of Egyptian history and archaeology at the Collège de France was specially created for him and he was appointed to it in March\n1831\n. He gave only three lectures before he became too ill to continue. Poor health throughout his life had been made worse by his Egyptian expedition, and he died of a stroke in March\n1832\n. He was buried in Père Lachaise Cemetery in Paris.\nHe had almost completed\nGrammar and Dictionary of Ancient Egyptian\nat the time of his death and his brother Champollion-Figeac published this in\n1838\n.\nChampollion has been honoured with a museum in Figeac and there is a Champollion Museum at the home of his brother in Vif, near Grenoble. A street in Cairo is named for him and there is also a crater named for him on the far side of the moon. Egypt issued a\n110\nEgyptian millieme stamp in honour of 'Champollion, the Rosetta Stone and Hieroglyphics' on\n16\nOctober\n1972\n. Also on\n14\nOctober\n1972\nFrance issued a\n90\n-centimes stamp for 'Champollion and the Rosetta Stone'. A\n5\n-franc stamp has also been issued by Monaco on\n4\nSeptember\n1990\nto commemorate the\n200\nth anniversary of  Champollion's birth. Egypt issued a Champollion stamp in\n1999\nto commemorate\n200\nyears of discovery of the Rosetta Stone and the Central African Republic issued a stamp in\n2002\n.\nSee\nTHIS LINK\n.",
  "math_areas": [
    "Number Theory"
  ]
}