{
  "nome_completo": "Jean Leray",
  "nome_curto": "Jean Leray",
  "ano_nascimento": "1906",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leray/",
  "lugar_nascimento": "Chantenay, near Nantes, Loire-Inférieure, France",
  "lugar_morte": "La Baule, Loire-Atlantique, France",
  "biografia": "Jean Leray\n's father was Francis Leray, who was a professor, and his mother was Baptistine Pineau. Jean attended the Lycée at Nantes, then moving to the Lycée at Rennes before completing his education at the École Normale Supérieure where he was awarded his doctorate. In Paris he worked on hydrodynamics. He married Marguerite Trumier on\n20\nOctober\n1932\n. They had three children, Jean-Claude, Françoise, and Denis.\nIn\n1933\nJuliusz Schauder\narrived in Paris on a Rockefeller scholarship to work with\nHadamard\n. This led to a collaboration between Leray and\nSchauder\nand their joint work led to a paper\nTopologie et équations fonctionelles\nⓉ\n(\nTopology and functional equations\n)\npublished in the\nAnnales scientifiques de l'École Normale Supérieure\n. This\n1934\npaper on topology and partial differential equations is of major importance:-\nIn this paper what is now known as Leray-\nSchauder\ndegree\n(\na homotopy invariant\n)\nis defined. This degree is then used in an ingenious method to prove the existence of solutions to complicated partial differential equations.\nAfter his\n1934\npaper with\nSchauder\n, Leray published a paper on\nalgebraic topology\nin the following year on the topology of\nBanach\nspaces. He then returned to work on analysis, in particular studying differential equations arising from hydrodynamics. He studied solutions of the initial value problem for three-dimensional\nNavier\n-\nStokes\nequations. He examined not only the existence and uniqueness of solutions but he showed that the solutions remained smooth for only a finite time after which turbulent solutions arise. In producing this theory Leray introduced many ideas of functional analysis which have today become standard tools.\nIn\n1936\nLeray was appointed Professor at the Faculty of Science at Nancy. World War II began in\n1939\nand Leray served as an army officer. He was captured in\n1940\nand sent to a prisoner of war camp in Austria where he remained until the end of the war in\n1945\n. While at the camp Leray and some of his fellow captives organised a \"université en captivité\" and Leray became its rector. Not wishing the Germans to know that he was an expert in hydrodynamics, since he feared that if they found out he would be forced to undertake war work for them, Leray claimed to be a topologist. He worked only on topological problems for the years he was held captive in the camp.\nAlthough he had undertaken some topological work it was not easy for Leray to work on the topic without reading topological literature. He was able to obtain some papers through\nHopf\nwho was at this time in Zürich but much of Leray's work was done independently of the developments which had taken place in the subject. After his release in\n1945\nLeray published a three part work\nAlgebraic topology taught in captivity\n.\nLeray continued to work on topological questions after his return to Paris where he became professor at the Collège de France in\n1947\n. For Leray\n[\n2\n]\n:-\n... algebraic topology should not only study the topology of a space, i.e. algebraic objects attached to a space, invariant under homomorphisms, but also the topology of a representation\n(\ncontinuous map\n)\n, i.e. topological invariants of a similar nature for continuous maps.\nFollowing this line he published papers which introduced sheaves, and the spectral sequence of a continuous map.\nIn the\n1950\ns Leray worked in a number of areas. He studied time dependent hyperbolic partial differential equations and also began to work on the\nCauchy\nproblem. In particular he published a paper on the\nCauchy\nproblem for equations with variable coefficients in\n1956\n. In\n1957\nhe explained the aims of his work in this area:-\nWe propose to study globally the linear\nCauchy\nproblem in the complex case, then in the real hyperbolic case, assuming that the given data is analytic.\nHe was able to generalise results in the theory of ordinary linear analytic differential equations to obtain similar results for partial differential equations. Leray's work on the\nCauchy\nproblem led him to study residues theory. In\n1959\nhe\n[\n2\n]\n:-\n... developed a general residue theory on complex manifolds and applied it to the investigation of concrete integrals depending on parameters arising from solving the Cauchy problem.\nIn\n[\n5\n]\nEkeland sums up Leray's achievements as follows:-\nLeray was so far ahead of his time because of his tremendous technical capability and geometrical insight. In his hands, energy estimates for partial differential equations became combined with ideas from algebraic topology\n(\nsuch as fixed point theorems\n)\nin a highly original combination which cracked open the toughest problems. He was the first to adopt the modern point of view, whereby a function is not a complicated relation between two sets of variables, but a point in some infinite dimensional space ... Leray\n[\ncan be said to have been\n]\nthe first modern analyst.\nLeray received many honours. He was a member of the\nAcademy of Sciences\nfrom\n1953\nand he was elected to the\nNational Academy of Sciences\nin the United States in\n1965\n. The following year he was elected to the\nUSSR Academy of Sciences\n. He was also a member of the Royal Academy of Belgium, a fellow of the\nRoyal Society of London\n, and a member of the academies of Milan, Boston,\nGöttingen\n,\nTurin\n, Palermo, Warsaw, and\nLincei\n. In\n1967\nhe was awarded an honorary doctorate from the University of Chicago. The citation stated:-\nMathematician of penetration and originality, whose inventions revolutionized partial differential equations and algebraic topology.\nHe was awarded the Malaxa prize in\n1938\n, the Feltrinelli prize in\n1971\n, the Wolf prize in\n1979\nand the M V Lomonosov Gold Medal in\n1988\n. He was also made Commandeur de la Légion d'Honneur.\nWe should end this biography with some comments on Leray's lecturing style\n[\n5\n]\n:-\nHe was a mild mannered, dapper man with a grey moustache, who squinted at his audience and lost it rather quickly; but he continued to write on the blackboard amidst a respectful silence, confident that the mathematics were there for all to see and needed no further explanation.",
  "math_areas": [
    "Analysis",
    "Topology"
  ]
}