{
  "nome_completo": "Jenő Hunyadi",
  "nome_curto": "Jenő Hunyadi",
  "ano_nascimento": "1838",
  "ano_morte": "1889",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hunyadi/",
  "lugar_nascimento": "Pest, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Jenő Hunyadi\n's father was a doctor in Pest. He was in a position to give Jeno an excellent education and he spared no expense to do so. Jeno was brought up in a home which was filled with music and the fact that all leading musicians visiting Pest would be welcome there, meant that he grew up with a deep knowledge of music. He attended school in Pest and his teachers quickly recognised that he was someone with exceptional mathematical talents.\nDramatic events were taking place in Hungary when Hunyadi was a young boy. Revolutionary protests involving ten thousand people took place in Pest on\n15\nMarch\n1848\n. Reforms were passed but Hungary was invaded by Croatia and a Hungarian army was recruited which was victorious over the invaders. However, following this Austrian imperial forces attacked Hungary and took Pest on\n4\nJanuary\n1849\n. The Hungarian government transferred to Debrecen and reorganised the army. In the spring of\n1849\nthey were victorious and drove the imperial forces out. Hungary declared independence on\n14\nApril\n1849\n. However, the Habsburgs formed an alliance with the Russians and their combined army defeated the Hungarians. A period of great hardship followed with many Hungarians imprisoned or shot. Hunyadi was young enough to escape from the worst of these problems and was able to continue his education in Pest.\nAfter graduating from secondary school, Hunyadi entered the Technical College of Pest where he studied mathematics. He quickly achieved an interest and ability in the subject which meant that he was capable of mathematical research, but resources were not available in Pest to allow him to read the latest developments. In\n1857\nhe went to study abroad, going first to Vienna. Perhaps the most fruitful of all the visits he made was to Berlin where the remarkable team of\nKummer\n,\nBorchardt\n,\nWeierstrass\nand\nKronecker\nwere lecturing. It was the lecture courses given by\nKummer\nand\nKronecker\nwhich had the greatest influence on Hunyadi. He was also greatly influenced by Clebsch and Hesse. Hunyadi submitted his doctoral thesis on the theory of algebraic curves to the University of Göttingen in\n1864\nand in the following year, after eight years away from his native Hungary, he returned to Pest. He was appointed as a\ndozent\nat the Technical College in\n1865\n.\nAfter Hungary's attempt at independence in\n1849\nhad been defeated, the country was controlled by the Habsburg Empire. However that Empire was weakened by external conflicts over the following decades and in the Compromise of\n1867\nthe Hungarian Kingdom and the Austrian Empire became independent states within the Austro-Hungarian Monarchy. Some Hungarians were happy with this arrangement, while others were not and would be satisfied with nothing short of full independence. It did have a positive effect on the middle classes with improvements in the country's economic position. Tied in with this was a need for education and consequently a need to train more school teachers. The mathematical level began to rise steadily and Hunyadi contributed to this improvement.\nRózsa, in\n[\n3\n]\n, describes the improving mathematical education at the Technical University of Budapest:-\nThe Institutum Geometrico-Hydrotechnicum - the predecessor of the university - was established in\n1782\n. It gradually developed into the Technical University\n(\nestablished in\n1871)\nwith the right of issuing diplomas. Since that time outstanding mathematicians such as Hunyadi,\nJulius König\n, Kürschák and Rados have contributed to the high standard of mathematical education at the Technical University. Their scientific and teaching activity affected mathematical life in the whole country and laid the foundation of the internationally recognized mathematical school in Hungary.\nIn\n1867\nHunyadi was elected to the\nHungarian Academy of Sciences\n, and two years later he became a mathematics professor at the Technical University. We should look now at the mathematical contributions that he made.\nHunyadi worked mainly on geometrical topics and his contributions were not to produce new theories but rather to improve the methods of others by simplifying proofs, finding elegant proofs to replace non-transparent ones, and putting apparently unrelated results into a general setting. In a paper published in\nCrelle\n's Journal in\n1880\nhe explained his view on the relation of algebra and geometry\n(\nsee for example\n[\n3\n]\n)\n:-\n... considering that analytic geometry is principally a geometrical discipline, it is the author's modest view that we have to make every effort not to delegate the main role to algebra and analysis, confusing the means with the end, but to give the main aim 'geometry' its due importance. This position is further supported by the argument that if we do approach analytic geometry from the opposite end, we might commit the error of reducing the analytic teaching of geometry to a collection of exercises in algebra and analysis which would certainly go against the spirit of the science.\nSome of Hunyadi's most significant results concern\ndeterminants\n. They were recorded by\nMuir\nin his famous work\nThe history of determinants\nand some of the most significant are presented in\n[\n2\n]\n.\nWe mentioned at the start of this article that Hunyadi came from a well-off family. The improving position in Hungary after the Compromise of\n1867\nwas not without its problems, however, and there were periodic financial crises. One of these occurred in\n1873\nand left Hunyadi in severe financial difficulties but he had the personality to come through such difficulties with his sense of humour intact\n[\n2\n]\n:-\nHe liked to live in an affectionate and friendly atmosphere and enjoyed witty conversation while having a few glasses of wine.\nHe had heart problems, however, and although he was able to contribute strongly to the Mathematical Society\n(\nMathematikai Társaság\n)\n, an informal private society for the mathematicians in Budapest founded in\n1885\n, he did not live to see the formal founding of the\nJános Bolyai Mathematical Society\nin\n1891\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}