{
  "nome_completo": "Jenő Elek Egerváry",
  "nome_curto": "Jenő Egerváry",
  "ano_nascimento": "1891",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Egervary/",
  "lugar_nascimento": "Debrecen, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Jenő Egerváry\n's parents were Béla Frigyes Egerváry and Ilona Madarassy. He was baptised into the Hungarian Catholic Church in Debrecen on\n17\nMay\n1891\n. In\n1901\nhe entered the Fazekas Mihály State School. This famous school had opened in November\n1873\nand, when Egerváry studied there, the director was Sándor Fazekas. There were two teachers at this school who were important in developing Egerváry's mathematical interests. Sándor Jaszencsák\n(1855\n-\n1914)\nwas an excellent but very strict teacher who taught him for three year before being forced to give up teaching through an illness in which he lost the sight of an eye. His duties were taken over by Károly Laczkó who prepared Egerváry's class, consisting of\n22\nstudents, for their final examination. One of these\n22\nstudents was Ferenc Varga, the father of Tünde Kántor, the author of\n[\n3\n]\n. The other mathematics teacher who strongly influenced Egerváry was Antal Kovaliczky\n(1851\n-\n1926)\n. Kovaliczky, who had been born in Kismedvés\n(\nnow Medvedie in Slovakia\n)\nand studied at the University of Budapest, taught descriptive geometry. He was a conscientious teacher who taught geometry in a very visual way exhibiting eye-catching drawings to give a concrete visualisation of abstract concepts. Tünde Kántor writes\n[\n3\n]\n:-\nBoth teachers were outstanding in mathematics and in the teaching of mathematics. They published in the world famous Hungarian Mathematical and Physical Journal for Secondary Schools\n(\nnowadays so called KöMaL\n)\n, they wrote articles and posed problems for young mathematicians. They could pass their knowledge to their students. They composed precise mathematical definitions, theorems and proofs.\nEgerváry performed well in all his subjects at the Fazekas Mihály State School and graduated in\n1909\n. Later that year he entered the Pázmány Péter University of Budapest where he studied courses on mathematics, physics and cosmography.\nLipót Fejér\nwas appointed to the chair of mathematics at the Pázmány Péter University of Budapest in\n1911\nand he taught Egerváry in the second half of his undergraduate studies. Egerváry completed his undergraduate studies in\n1913\nand in the summer of that year he went to England on a study tour financed by a state grant. Back in Budapest he continued research for his Ph.D. advised by\nFejér\n. Following a suggestion by\nFejér\n, Egerváry studied a class of integral equations of second kind in which the kernel is a periodic function and the matrix of the approximating system of algebraic equations is cyclic. He submitted his thesis\nOn a class of integral equations\n(\nHungarian\n)\n, was examined on mathematics, theoretical physics and cosmography and, after the publication of his thesis in the\nHungarian Mathematical and Physical Journal\n, he was awarded a Ph.D. in\n1914\n. The Pasquich Foundation awarded him their Pasquich prize for his mathematical essay in their\n1913\n-\n1914\ncompetition. This prize was named after János Pasquich\n(1754\n-\n1829)\nwho had been a professor of mathematics and director of the Buda Observatory.\nAfter the award of his Ph.D., Egerváry was employed in the Seismological Observatory in Budapest but also worked for his qualifications as a secondary school teacher of mathematics and physics. He was awarded his teacher's diploma in\n1917\n. As part of his training as a secondary school teacher, he had worked at the Upper State Industrial School of Budapest from\n1915\n. Now World War I had begun in\n1914\nwith Hungary supporting Germany. Egerváry was conscripted for military service in\n1917\nbut, later that year was discharged as unfit to serve. Now it seems unlikely that Egerváry was physically unfit since he was a remarkable sportsman and mountaineer. He had climbed in the Tatra mountains with the famous mountaineer Lajos Rokfalusy\n(1887\n-\n1974)\nand during\n1910\n-\n1920\ndeveloped a strong reputation as a mountaineer, climbing the Gerlach Peak, the highest of the Tatras. After his discharge, Egerváry was employed again as a high school teacher at the Upper State Industrial School of Budapest. He had published\nOn seismic trajectories and their connection with Bertrand's problem\n(\nHungarian\n)\n(1917)\n,\nÜber seismischen Trajektorien und über das Bertrandsche Problem in der Seismologie\nⓉ\n(\nOn seismic trajectories and Bertrand's problem in seismology\n)\n(1918)\nand\nÜber die charakteristischen geometrischen Eigenschaften der Legendreschen und Tschebyscheffschen Polynome\nⓉ\n(\nOn the characteristic geometric properties of Legendre and Chebyshev polynomials\n)\n(1918)\n.\nThe Ferenc József University of Kolozsvár was founded in Kolozsvár\n(\ntoday Cluj in Romania\n)\nin\n1872\n. This Hungarian university was in severe difficulties when, following the end of World War I, Kolozsvár was occupied by Romanian troops on\n24\nDecember\n1918\n. Faced with the university becoming Romanian with teaching in Romanian many professors fled to Budapest and those who remained were expelled in October\n1919\n. For the next two years the university operated in Budapest and Egerváry\nhabilitated\nthere with his dissertation\nApplications of Analysis\n(\nHungarian\n)\nteaching at the university from\n1919\n. In\n1922\n, following the\n1921\nTreaty of Trianon which defined Hungary's boundaries, the Ferenc József University moved from its temporary home in Budapest to Szeged. Most of the professors moved to Szeged but a few resigned and remained in Budapest. It is unclear what Egerváry did at this time. He certainly did not resign for he remained a\ndocent\nof the university until\n1927\n. However, it is unclear whether he ever taught in Szeged. The biographies listed in the references below are rather vague or contradictory on this point. His publications are of no help in settling this issue since he published nothing between two papers published in\n1922\nand two published in\n1928\n. The\n1922\npapers are\nOn a maximum-minimum problem and its connexion with the roots of equations\n, and\nA minimization problem for a symmetric multilinear form\n(\nHungarian\n)\n. The two\n1928\npapers are\nÜber gewisse Extremumprobleme der Funktionentheorie\nⓉ\n(\nOn some extremal problems in complex analysis\n)\n, and\n(\nwith Ottó Szász\n)\nEinige Extremalprobleme im Bereiche der trigonometrischen Polynome\nⓉ\n(\nSome extremal problems in the area of trigonometric polynomials\n)\n. The first of these papers published in\n1928\nwas submitted on\n11\nJune\n1927\nand gives his address simply as Budapest while the second, submitted on\n27\nMay\n1927\nalso gives his address as Budapest. He gives has name as \"E Egerváry\" on the first on these but as \"Eugen von Egerváry\" on the second.\nIn\n1927\nEgerváry's right to lecture at the Ferenc József University was revoked. Again it is unclear exactly why this was done. It may have been simply because he had not taught at the University after it moved to Szeged, it may have been due to an illness he suffered, or it may have been for political reasons. His original habilitation in\n1919\nhad been during the time of the short-lived Hungarian Soviet Republic and the right-wing government of\n1927\nmay have cancelled his permission to teach because of that. Certainly shortly after this Egerváry was teaching at the University in Budapest. In\n1930\nhe published the paper\nOn the trinomial equation\n(\nHungarian\n)\n. This paper is discussed at length by Péter Gábor Szabó in\n[\n9\n]\n. He gives the following introduction:-\nIn\n1930\n, Egerváry published a paper on the arrangements of the roots of trinomial equations in the complex plane. He studied the distribution of the roots based on their arguments and moduli. The central idea here came from an interesting observation: the roots of the trinomial equations can be interpreted as the equilibrium points of unit masses that are located at the vertices of two regular concentric polygons centred at the origin in the complex plane. Using the symmetry and continuity properties of this force field he showed how the roots could be separated according to their arguments. In this separation Egerváry determined sectors in the complex plane, where each sector contains a root of the equation, and the sum of the angles of these sectors is of order π/\n2\n. He also gave a characterization of the distribution of the roots according to their moduli. Egerváry localized the roots in annulus form. The crowning achievement of his work was a synthesis of these results. Based on previous studies, he was able to separate the roots into sectors of annuli.\nIn the following year he published\nOn combinatorial properties of matrices\n(\nHungarian\n)\n. The paper\n[\n2\n]\n:-\n... describes the duality theorem for the weighted bipartite matching problem, which is called today the assignment problem, proves the integrality result, and develops the underlying idea of the first primal-dual type algorithm that is called throughout the literature the 'Hungarian Method', a name introduced by H Kuhn who actually used Egerváry's ideas to develop an efficient algorithm. It is remarkable that this algorithm turned out to be strongly polynomial.\nThis work by Egerváry means that today he is considered to be one of the founding fathers of 'Combinatorial Optimisation'.\nFor his outstanding mathematical contributions, in\n1932\nEgerváry was awarded the Gyula König Prize of the\nEötvös Loránd\nMathematical and Physical Society. In\n1918\nDénes König\nand his brother had established this prize for mathematics to commemorate their father. In the same year Egerváry was appointed to the Institute for Training Secondary School Teachers and he taught there until\n1938\nwhen he again became a docent, this time at the Technical University of Budapest submitting the dissertation\nAnalysis and its mathematical and physical applications.\nIn the same year he was made an extraordinary professor and, in\n1941\n, a full professor.\nTamás Rapcsák, the son of\nAndras Rapcsák\n, gives the following overview of Egerváry's mathematical contributions in\n[\n5\n]\n:-\nA characteristic feature of Jenö Egerváry's academic works was his wide-ranging scientific interests. His early results were related to\nLeopold Fejér\n's research topics, and he wrote a number of papers on analysis and function theory. However, at this time, he also became interested in algebraic equations. In his first papers, he extensively applied the theory of determinants and demonstrated how important and useful this tool was. At the same time, he became deeply interested in problems in theoretical physics and geometry. For about\n15\nyears, starting in\n1938\n, he published his results in geometry and differential equations. In geometry, he examined the important and deep question about the curvature of metric curves, which is related to measurement and applications. In the last\n6\nyears of his life, he almost exclusively devoted his efforts to matrix theory, with an emphasis on its applications. In all the works of Egerváry and in his lectures there is an unmistakable striving for clarity, precision, and elegance. His style was concise, he didn't use superfluous words, but it was not at the expense of clarity. One of his main tools through which he was able to keep the reader's or listener's interest was that of illustration. Another typical feature which runs throughout his works is the need to show that his results - even when they belonged to the most abstract areas - had concrete applications.\nPál Rózsa was a student of Egerváry and has described his teaching\n(\nsee\n[\n3\n]\n)\n:-\nI learnt mathematics from him. He was an outstanding lecturer. He was a very clear-headed teacher. He always spoke about mathematics in a crystal-clear way. I often attended his examinations, not only when I was being examined. I observed he had about\n15\nto\n16\nquestions from which he posed some to the students. If somebody could not answer them then the professor failed the student. I worked out the answers and organized seminars for my fellow students. Those students who were prepared by me for the examinations never failed. Here began my love for teaching.\nHe was elected as a corresponding member of the\nHungarian Academy of Sciences\nin\n1943\nand as an ordinary member in\n1946\n. In\n1947\nhe began his efforts to set up the Institute of Applied Mathematics of the\nHungarian Academy of Sciences\n. In\n1950\nhe was made chairman of the Scientific Council of the Research Institute for Applied Mathematics of the\nHungarian Academy of Sciences\nbut, later that year, it was\nAlfréd Rényi\nwho became the first director of the new Institute. Dalma Paloczi Takacs suggests in\n[\n10\n]\nthat choosing\nRényi\nover Egerváry was a political act:-\nEgerváry did not enjoy the results of his efforts in organising the Institute. A new figure appeared on the horizon in the person of\nAlfréd Rényi\n, a mathematician well-grounded in the doctrines of Marxism. He had recently returned from the Soviet Union, where he had completed his doctoral dissertation. Soon he supplanted Egerváry as head of the Research Institute.\nEgerváry was honoured with the award of the Kossuth Prize in\n1949\nand again in\n1953\n. This State Prize was established in\n1948\nand awarded for achievements in the fields of science, culture and the arts. He retained his professorship at the Technical University of Budapest until\n1955\nwhen the University was split into two separate institutions. After this he became the head of the Department of Mathematics at the 'Construction Industry and Transportation Engineering' Technical University until he retired on\n15\nOctober\n1958\n. In addition to his work at the Technical University, almost every year he taught courses on differential equations at\nEötvös Loránd\nUniversity in Budapest. When he retired he was\n67\nyears old.\nAfter his retirement, Egerváry lived only a few weeks before he took his own life. Tamás Rapcsák writes:-\nFor our country and the society of mathematicians it was a great loss, that Jenö Egerváry, with all his creative energy, took his own life. He wanted to make a point at the end of a period of repression which began in\n1958\n. This process was an unworthy and humiliating act of human denigration in his life. There was also a personal vendetta against him under a financial-economic pretext which he felt also attacked his scientific esteem.\nSilvano Martello writes\n[\n4\n]\n:-\nIn\n1958\n, in the period of the Communist repression that followed the\n1956\nrevolution, fearing imprisonment for specious accusations, Jenö Egerváry committed suicide.\nThe authors of\n[\n1\n]\nwrites about his death as well as his legacy:-\nJenő Egerváry ... is best known for his contribution to the Hungarian method. However, his research activity included much more than that and he obtained many important and genuine results in other areas of mathematics and its applications. He was also an outstanding teacher and a key person of Hungarian applied mathematics until\n1958\n, when he committed suicide. This was the aftermath of the\n1956\nrevolution of Hungary with a harsh oppression. Not long after Egerváry's death, his research department was dissolved and by the early seventies he and his results were rarely mentioned in mathematical circles apart from his relation to the Hungarian method. At the end of the eighties his linear algebra related research came into light due to its connection with the ABS\n[\nnamed after J Abaffy, A Galanti, E Spedicato, 'A class of direct methods for linear systems'\n(1984)]\nand other conjugate direction methods used in optimization algorithms. In\n1999\n, the Bergamo University of Italy issued an Egerváry prize to Zhang Liwei of Dalien University of China. The Hungarian Operations Research Society was founded in\n1990\n. It was one of HORS' principal aims to reach a higher level recognition of Egerváry and applied mathematics as well. The Society organized a special memorial session for Egerváry on the\n25\nth\nConference of HORS and established the Egerváry medal for lifetime Operations Research achievements in\n2004\n. ... Due to the efforts of HORS and former students of Egerváry, a statue of Egerváry was erected in the campus of the Technical University of Budapest in\n2006\n. In\n2007\nProfessors Emilio Spedicato and Tamás Rapcsák proposed a memorial celebration of Egerváry on the occasion of the\n50\nth\nanniversary of his death. Two such parallel events took place. The first one was organized as a special section of the\n39\nth\nAnnual Conference of the Italian Operational Research Society held in Ischia,\n7\n-\n11\nSeptember\n2008\n. ...The second event took place as a special memorial workshop organized by the Operations Research Committee of the\nHungarian Academy of Sciences\nand by the Hungarian Operations Research Society in Budapest Tech\n(\nBudapest\n)\non the\n12\nth\nDecember,\n2008\n. The latter event consisted of\n9\nlectures that partly covered the scientific activity of Egerváry. It is worth noting that between\n1918\nand\n1921\nEgerváry was a teacher at the State Industrial College which was one of the legal predecessors of the Budapest Tech college.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}