{
  "nome_completo": "Jerzy Witold Rozycki",
  "nome_curto": "Jerzy Rozycki",
  "ano_nascimento": "1909",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rozycki/",
  "lugar_nascimento": "Olszana, Russian Empire  (now Vilshana, Ukraine)",
  "lugar_morte": "Mediterranean Sea, near the Balearic Islands",
  "biografia": "Jerzy Rozycki\n, known as Jurek, was the fourth child of Zygmunt Rozycki\n(\nborn\n1872)\n, a pharmacist and graduate of Saint Petersburg University, and his wife Wanda Leopolda Benita\n(\nborn\n1883)\n. His older siblings were Aleksandra Rozycka\n(\nborn\n1903)\n, Halina Rozycka\n(\nborn\n1905\n, died\n1978)\n, whose married name was Skierczyvska, and Eugeniusz Rozycki\n(\nborn\n1907\n, died\n1925)\n. Jerzy was born in Olszana in the Russian Empire, now called Vilshana in Ukraine. He spent the early part of his life in Ukraine, attending the Borderlands Middle School in Kiev which was for pupils of Polish origin. In\n1918\n, before he was old enough to graduate, he left this school, since he parents moved to Wyszkow in Poland. This was a consequence of the Polish-Soviet war, fought from\n1918\nto\n1921\n, which was the result of a dispute over territories held before World War I by the Russian Empire and the Austro-Hungarian Empire. Rozycki attended secondary school in Wyszkow, graduating in\n1926\n.\nAt school in Wyszkow, Rozycki had been drawn to mathematics and modern languages, and wished to study both subjects at university. His father, a graduate of Saint Petersburg University, was keen to support his son who entered the Faculty of Mathematics and Natural Sciences of the University of Poznan in\n1927\n. This was a comparatively new university at this time having been founded in\n1919\nfollowing the end of World War I. Rozycki took courses in German, showing great linguistic skills, but his main topic was mathematics where he particularly enjoyed the courses taught by the professor of mathematics\nZdzisław Krygowski\n.\nKrygowski\nhad been awarded a doctorate in mathematics by Kraków University in\n1895\n, had studied with\nLazarus Fuchs\nand\nHermann Schwarz\nin Berlin, then with\nÉmile Picard\nin Paris. He taught at Lwow Polytechnic where he was rector in\n1917\n-\n18\nbut moved to Poznan University as professor of mathematics in the year that the new university opened. Rozycki attended\nKrygowski\n's courses on higher algebra and on mathematical analysis at Poznan University. In January\n1929\nRozycki took a new cryptology course and, because of the importance of this, we must fill in a little background about the course.\nPoland had monitored German and Russian radio messages from at least\n1918\nonwards. The importance of decoding these messages was clear since it allowed them to be aware of secret German rearmament and joint German-Russian military cooperations. The Germans had begun to develop the Enigma machine from around\n1919\nand it became the coding method for the German navy from\n1926\n. The Poles began intercepting German army radio messages in this new cipher from July\n1928\nand immediately the Polish General Staff, who ran Section II\n(\nthe Intelligence Section\n)\n, decided that new ideas were required to beak these codes. They decided to collaborate with\nZdzisław Krygowski\nin putting on a cryptology course for selected students at Poznan University. This university was chosen as the place to put on the course since there were good quality students there and, a vital requirement, many had been educated in German speaking schools so were equally fluent in both German and Polish. Students had to be German speaking but loyal citizens of the Polish state. Only mathematics students were to take the course but they also had to possess qualities such as intuition, meticulousness, patience, and orderliness. The course was not put on in the university building but it was held in the evenings, twice a week, at the newly set up Cipher Bureau in a near-by military facility. The course was based on the book\nCours de cryptographie\nby the French General Marcel Givièrge. Rozycki was one of twenty students who were selected for this course as were his fellow mathematics students from Poznan University,\nMarian Adam Rejewski\nand\nHenryk Michal Zygalski\n(\nknown as Zyga\n)\n.\nIn\n[\n18\n]\nthere is a description of how the students were selected for the course:-\nWell, one day or one evening, I don't remember which, one of the younger mathematics students came up to me and said that on such-and-such a day, at such-and-such an hour, Professor\nZdzisław Krygowski\n, director of Poznan University's Mathematics Institute, wanted me to come to the Institute. This student had some sort of list, and he would go and tell each of the persons on the list about this. Not everyone was invited, only a certain number of selected students. What the criteria were, I can only guess . ... I expect it wasn't Professor\nKrygowski\nwho selected the students but rather Section II, the Intelligence Section of the Polish General Staff, that had made the selection. Probably there had been correspondence between Section II and Professor\nKrygowski\n, and on the basis of this correspondence Professor\nKrygowski\nhad given them a list of all the third- and fourth-year students ... who were close to graduating, and then Section II had by its own methods conducted some kind of selection. In any case, not all the students were selected ...\nSlawo Wesolkowski explains in\n[\n35\n]\nhow the students were tested during the course:-\nA few weeks into the course, the students were given real German ciphergrams to solve. The students were told that this system had already been broken although for a time some consultants of the Polish Cipher Bureau had considered it unbreakable. The students were also told what the text was about which helped to narrow down the vocabulary used. A couple of hours later, some of the students including\nRejewski\n,\nZygalski\nand Rozycki proved capable of decoding the message. As the course progressed, the ciphers became increasingly more difficult. Unsuccessful students started dropping out of the course and others decided they did not have enough skill to keep going. Only the above-named three students managed to reconcile their regular course work with the cryptography course.\nThe positive result of this test opened the door to a career for these three students. While still a student, Rozycki was employed in the Poznan branch of the Cipher Bureau. There he worked on decoding German radio and telephone messages. During\n1929\n-\n32\n, together with\nMarian Rejewski\nand\nHenryk Zygalski\n, he dealt mainly with the decryption of the four-letter code of the German navy. Rozycki, using cryptanalysis resulting from linguistic investigations, managed to reconstruct the entire code of the German navy. At the end of this period, in\n1932\n, he defended his master's thesis in mathematics at the University of Poznan and, on\n1\nSeptember of that year, he began working full time at the Warsaw Cipher Bureau of the General Staff of the Polish Army. This was situated in the Ministry of War building in Marshal Pilsudski Square in central Warsaw but later the team moved to Biuro Szyfrow-\n4\n, the cipher office dealing with German messages in Kabackie Woods outside Warsaw.\nThere was a commercial model of the Enigma machine but the military were using a type which had been modified by the Germans in a major way to make the resulting codes, they believed, unbreakable. Rozycki and his two fellow mathematicians were presented with a commercial version of the Enigma machine and set to work, using the intercepted coded messages, to reconstruct the modifications made in the military version. Only the superiors of the three cryptologists were allowed to contact them: the head of the Bureau, Lieutenant Colonel Karol Gwidon Langer and Major Maksymilian Ciezki.\nMarian Rejewski\nnoted\n[\n26\n]\n:-\nThere were a few secretaries, a few employees ... . In addition, when passing through the corridors of the Staff Building we knew some people by sight, like the manager of the Russian ciphers cell and the manager of the Polish ciphers cell. Soon, Rozycki,\nZygalski\nand me were so thoroughly isolated from the rest of the staff that even the janitor who brought tea for breakfast did not have the right to enter our room, at the door of which, on top of that, a black curtain was hung, as a result of which our room was jokingly nicknamed \"Black peace\".\nRozycki worked under enormous pressure, and yet he showed incredible patience to tediously repeat the same activities thousands of times\n[\n36\n]\n:-\nThe Polish team tackled what was considered by the German military to be unbreakable. These twenty-year-old mathematicians, unversed in traditional schematic routines of academia, using their linguistic and imaginative abilities, formulated bold new theories of probability, permutations and group theory.\nMaciej Pienkowski describes in\n[\n25\n]\nhow hard work and brilliance led to success:-\nAt the end of\n1932\n, Rozycki was entrusted with an additional task related to the theoretical foundations of breaking Enigma codes. Using a converted commercial machine and a photocopy of the day keys provided by Captain Gustav Bertrand from the French intelligence service, Rozycki and his colleagues managed for the first time to read German military radio messages from the period from September to October\n1932\n, secured with the Enigma. However, this was only a partial success, as it was due in part to the mistakes of the German ciphers, who used repeated letters in the ciphers and thus used only a small part of the machine's capabilities.\nCompletely unraveling the mystery required extremely hard work. Initially, the number of combinations generated by the Enigma machine was set to\n3\n×\n1\n0\n114\n3 \\times  10^{114}\n3\n×\n1\n0\n1\n1\n4\n. Determining the design details allowed the number to be reduced to\n105\n,\n456\ncombinations. This, however, was still very large, and developing a method for finding the correct key among all possible machine settings was difficult. ... Rozycki's contribution to the development of Enigma was significant. He was responsible for the invention of the so-called 'clock methods' which made it possible to determine which Enigma rotor is in the first position. It was based on a brilliant observation about the statistical properties of the language and the picking of identical pairs of characters vertically from the German text. If their number in relation to the length of the message corresponded to German, the shift was appropriate. In this way, Rozycki independently developed a method that was the first theoretically described by the American cryptologist William Frederic Friedman in the\n1920\ns under the name \"Index of coincidence\".\nThe year\n1938\nproved important for Rozycki. His achievements were recognised in that year and he was awarded the Silver Cross of Merit and cash prizes. In the same year he married Maria Barbara Majka\n(11\nSeptember\n1910\n-\n4\nOctober\n1991)\n, the daughter of Jan Majka and Aniela Pieniazek. Jerzy and Maria had one child, a son Jan Rozycki.\nIncreased German aggressive military activity led to Jerzy Rozycki and his colleagues meeting with British and French cryptologists in Warsaw in the summer of\n1939\nto explain to them the Polish achievements in deciphering the Enigma. One of the British cryptologists at this meeting was Dillwin\n(\nDilly\n)\nKnox, one of the few cryptographic experts of World War One, who was heading the British attack on the German enigma.\nOn\n1\nSeptember\n1939\n, at\n4\n.\n45\na.m., Germany invaded Poland. Rozycki with his wife and son, together with Rejewski and Zygalski were evacuated from Warsaw on\n5\nSeptember. They journeyed to Brest\n(\nknown as Brzesc nad Bugiem in Polish\n)\n, at that time a Polish town on the Polish-Soviet border but now in Belarus. The journey was dangerous and described by Maria Rozycki in her diary\n(\nsee for example\n[\n25\n]\n)\n:-\n... on that day\n[9\nSeptember\n]\nwe were so close to personal tragedy when we hid from a raid: myself with our child, Jurek\n[\nRozycki\n]\nand Zyga\n[\nZygalski\n]\nwhen a bomb fell nearby. A deep funnel had formed in front of us, but luckily we are only partially covered with sand.\nRozycki left his family in Brest: he would never see them again. Rozycki,\nRejewski\nand\nZygalski\nwere given a car to take them to Romania; they crossed the border into Romania on\n17\nSeptember. Reaching Bucharest, they presented themselves at the British Embassy but were told to go away and come back in a few days. They did not wait but contacted the French who arranged for them to go to Paris and issued them with passports. They then returned west through the north of Italy which, at this time, was not at war. Rozycki was questioned by the Italian police in Turin who were suspicious that the young man had not been drafted into the army but they allowed him to continue. From Italy they entered into France and made their way to Paris by rail arriving on\n25\nSeptember. On\n20\nOctober\n1939\n, the three Polish mathematicians began decoding German ciphers from station P.C. Bruno which was established in Gretz-Armainvillers close to Paris.\nThe British had been impressed with the three young Poles and Alastair Denniston, who was the head of the British Government Code and Cypher School, wrote to the French in December\n1939\nasking them to send:-\n... three young Poles - Jerzy Rozycki,\nMarian Rejewski\nand\nHenryk Zygalski\n. ... the experience of these people can shorten our work by months.\nThe French, however, did not want to lose the Polish cryptologists so they did not send them to Britain. Remaining close to Paris, they decoded around\n9000\nmessages relating to the Norwegian and French campaigns. In May\n1940\nGermany invaded Holland, Belgium and Luxembourg, continued to attack France and entered Paris on\n14\nJune. Within a couple of days France surrendered. Rozycki and his two colleagues were transferred to Algeria, first to Oran and then to Algiers.\nAfter the Franco-German Armistice, Vichy France was set up led by Philippe Pétain. Vichy France was the southern part of France, not occupied by German forces but it collaborated with Germany, becoming a puppet state. It was allowed a degree of independence such as keeping the French army and navy and the French colonial empire. After a few months in Algeria, following the creation of Vichy France, Rozycki returned to that region where he continued his work on cryptanalysis in the château Les Fouzes near Usès in Provence, in the centre code-named Cadix which operated from October\n1940\nto November\n1942\n. There he worked in a rather frightening and strange situation\n[\n25\n]\n:-\n... there was a deeply disguised French counterintelligence in the area, organised by Vichy state officers sabotaging the activities of Marshal Philippe Petain and cooperating with the Allies. Jerzy Rozycki then used the false name Julien Rouget. The conditions in which he worked were not the best. The cryptologists were placed in rather primitive quarters without running water, but the Polish mathematician received a salary and food from the French.\nRozycki continued working on decoding Enigma messages much of which were somehow reported to the Allies. He was able to send reports about listening stations set up by the Germans in the south of France to track the positions of transmitters used by underground organisations. The German police in Paris were aware that there was a Pole who was sending information back to England, but despite trying to track Rozycki they were unsuccessful.\nIn the summer of\n1941\nRozycki was sent back to Algiers, where he supervised the reading of the dispatches sent by the Germans and Italians. The German Africa Corps had been set up in north Africa by Germany in March\n1941\nto help the Italians defend their colonies. Information about movements of German and Italian troops was vital to the Allies. After organising a unit decoding messages, he was told to return to France. He boarded the\nSS Lamoricière\n, operated by the Compagnie Générale Transatlantique, in Algiers bound for Marseille. The ship, captained by Captain Joseph Milliasseau, had\n272\npassengers,\n88\nof whom were military personnel. It sank in a storm near Balearic Islands on\n9\nJanuary\n1942\nbut the circumstances have never been entirely clear. It is known that it changed course on\n8\nJanuary when it received a signal to say the ship\nJumieres\nwas in difficulties; the\nJumieres\nsank before\nLamoricière\nreached it. The\nLamoricière\nran out of coal and began to take in water in the gale. There were\n93\nsurvivors of the disaster, but sadly Rozycki drowned; his body was never recovered.\nThe fact that Rozycki had no grave was not rectified until\n2019\n. Elzbieta Szczuka writes\n[\n30\n]\n:-\nA group of several dozen people from Wyszkow participated in the commemoration of Polish cryptologists -\nMarian Rejewski\n, Jerzy Rozycki and\nHenryk Zygalski\n- which took place on\n6\nSeptember\n[\n2019]\nin Kraków. In the Crypt of the National Pantheon, in the crypt of the Church of Saints Peter and Paul, urns with soil from places related to the death or burial of the Polish cryptologists were placed in a sarcophagus. For Jerzy Rozycki ... it is a symbolic grave.\nThe primary task for the Board of the National Pantheon Foundation was to create a symbolic grave for Jerzy Rozycki, for whom, despite the benefits he gave to his country and the world, there was no place that could be described as his eternal resting place. However, taking into account the fact that the achievements in deciphering the Enigma was the work of all three mathematicians equally, the Pantheon Chapter decided to erect one sarcophagus in the Crypt, containing the earth from the three places related to their deaths, i.e. the bottom of the Mediterranean Sea, from Chichester and from the vicinity of the grave in Powazki.\nThe three Polish mathematicians received many awards. On\n21\nFebruary\n2000\n, Polish President Aleksander Kwasniewski posthumously awarded Rozycki the Grand Cross of the Order of Polonia Restituta for outstanding contributions to his homeland. A monument to the three mathematicians was unveiled in\n2007\n[\n9\n]\n:-\nIn\n2002\n, a group of history and cryptology enthusiasts proposed commemorating this achievement with a monument where the history of breaking the Enigma ciphers began - in Poznan, Poland. ... From the\n24\nproposals received, the jury unanimously selected the design by Grazyna Bielska-Kozakiewicz and Mariusz Krzysztof Kozakiewicz. Their work represented the prism of a regular triangular base - its sides covered with rows of numbers. On each side of the monument, the name of one of the codebreakers emerges from the chaos of numbers. In its verdict, the jury remarked that the winning project \"represents in the purest form the brilliant thought of the three mathematicians. The artist himself seems to step aside permitting the spectator to contemplate the purely intellectual achievement of the three cryptologists.\"\nThe monument was unveiled on\n10\nNovember\n2007\nin Poznan Castle, the site of the Department of Mathematics where the three had studied. The date was the\n75\nth anniversary of the first Enigma code being broken. You can see the monument at\nTHIS LINK\n.\nOther events commemorating their remarkable achievements have been a conference \"Secrets of Enigma\" held in Bydgoszcz, Poland, on\n9\n-\n10\nNovember\n2004\n, a stamp issued to commemorate their achievement by Poland in\n2009\n, the visit to Bletchley Park in\n2014\nby relatives of the three cryptologists, and the publication of books, several of which are listed in the References to this biography. The IEEE Milestone in Electrical Engineering and Computing was awarded to them on\n5\nAugust\n2014\n. Details of the ceremony are in\n[\n22\n]\n. Also in\n2014\na commemorative plaque was unveiled in the Mathematical Institute of the\nPolish Academy of Sciences\nin Warsaw. Wyszkow have, rightly, been proud that Rozycki attended school in that town and in\n2018\na bench with a figure of Rozycki, was put in a park in the town, see a picture at\nTHIS LINK\n.\nIn September\n2021\nthe Enigma Cipher Centre dedicated to Polish Enigma codebreakers opened in Poznan. Stuart Dowell writes that\n[\n7\n]\n:-\n... modelled on an educational and scientific institution, the new Enigma Cipher Centre is divided into three parts which include opportunities for visitors to test their own code-breaking skills, send messages in morse code and see an actual German Enigma machine on loan from the Museum of Polish Arms in Kolobrzeg.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}