{
  "nome_completo": "Jerzy Neyman",
  "nome_curto": "Jerzy Neyman",
  "ano_nascimento": "1894",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neyman/",
  "lugar_nascimento": "Bendery, Bessarabia, Russian Empire (now Transnistria, Moldova)",
  "lugar_morte": "Oakland, California, USA",
  "biografia": "Jerzy Neyman\n's parents were Czeslaw Neyman, who was a lawyer, and Kazimiera Lutoslawska. Kazimiera came from Kiev and, in fact, Czeslaw and Kazimiera met when he was studying law at Kiev and rented a room in a house run by Kazimiera's mother. Jerzy was the youngest of his parents four children but, since the oldest child Karol was sixteen when Jerzy was born and two girls had by this time died, he was essentially brought up as an only child. It is worth noting that despite the political situation which existed at the time\n(\nofficially Poland did not exist as a separate country\n)\n, Jerzy was born into a Roman Catholic family which considered itself to be Polish and was certainly Polish speaking. We should also note that Neyman wrote papers for a few years under the name Splawa-Neyman, but he dropped the first part\n(\nwhich is more like a sign of nobility\n)\nat the age of\n30\n. The Russian version of his name was Yuri Czeslawovich and he was known by this name when he was a student.\nAs a young boy, Jerzy lived in several different towns: first Bendery, then Kherson, then Melitopol in the Crimea, and by the time he was eight years old the family lived at Simferopol also in the Crimea. Up to the age of ten he was taught at home by a governess and then he entered the local\ngymnasium\n. Remarkably he could speak five languages by this time, Polish, Ukrainian, Russian, French and German. In\n1906\n, however, his father died of a heart attack and his mother, now having little money to bring up her son, moved to Kharkov where she had relatives. Neyman excelled at the gymnasium at Kharkov and he decided, probably because he had an outstanding mathematics teacher, that he would study mathematics at university. Between completing his schooling and entering university, he made a European train journey through Austria and Italy. His mother must have saved hard to have been able to afford to send him on this trip.\nNeyman began his studies at Kharkov University in the autumn if\n1912\n. He was interested both in physics and in mathematics and at first it was practical physics experiments which he enjoyed most. Many students left for military service when World War I started in\n1914\nbut Neyman failed the eyesight test so remained at University. He was quickly coming to realise that he did not have the necessary manual dexterity to be a talented experimenter and when the professor who was lecturing to him on the theory of functions suggested that he read\nLebesgue\n's paper\nLeçons sur l'intégration et la recherche des fonctions primitives\nⓉ\n(\nLessons on integration and research on primitive functions\n)\nhe immediately became fascinated. He wrote a paper on\nLebesgue\nintegration which he completed in July\n1915\nand submitted for the Gold Medal\n(\nwhich it later won\n)\n. In the academic year\n1915\n-\n16\nAleksandr Bernstein\nlectured to him on probability; he strongly influenced Neyman and encouraged him to read\nKarl Pearson\n's\nThe Grammar of Science\n. Reviewing a new edition of\nPearson\n's book many years later he recalled its impact\n(\nsee for example\n[\n4\n]\n)\n:-\nWe were a group of young men who had lost our belief in orthodox religion, not from any sort of reasoning, but because of the stupidity of our priests.\n[\nBut\n]\nwe were not freed from dogmatism and were prepared in fact to believe in authority, so far as it was not religious. The reading of The Grammar of Science ... was striking because ... it attacked in an uncompromising manner all sorts of authorities. ... At first reading it was this aspect that struck us. What could it mean? We were not used to this tone in any scientific book. Was the work a hoax and the author a scoundrel on a grand scale? But our teacher, Bernstein, had recommended the book; we must read it again.\nIn September\n1917\n, having completed his undergraduate studies, Neyman remained at Kharkov University preparing for an academic career. He lectured and assisted with tutorial sessions and began to take an interest in statistical ideas. However the last year of the war, the Russian Revolution, and the civil war, totally disrupted the academic life of the University. There was great hardship and not surprisingly Neyman's health began to deteriorate. The doctors diagnosed tuberculosis and he was told to go south to recover. He travelled to the Crimea in\n1919\nand on the journey he met a Russian girl Olga Solodovnikova. Shortly after he returned to Kharkov to begin teaching in the autumn of\n1919\n, Olga returned too and their friendship led to marriage on\n4\nMay\n1920\n. However the complex political situation in Europe had taken another twist and at the time of their marriage Poland and Russia were at war. Ten days after he was married, Neyman was imprisoned and held for about six weeks.\nDespite the difficulties that he was under, Neyman passed his examinations and became a lecturer at Kharkov University, teaching higher algebra, integration, and set theory. Fearing he was about to be arrested again, he fled from Kharkov but returned on learning it was now safe for him. In\n1921\nhe went to Poland and made contact with\nSierpiński\nwho said that an academic post later that year might be possible. To earn some money he took a job as senior statistical assistant at the Agricultural Institute in Bydgoszcz\n(\nGerman name Bromberg\n)\n. Keen to be in Warsaw, in December\n1922\nhe took a job in the State Meteorological Institute there. He began to write papers on applications of statistics. He was appointed as an assistant at Warsaw University at the beginning of the academic year\n1923\n-\n24\nand he also taught at the College of Agriculture. He received a doctorate in\n1924\nfor a thesis on application of\nprobability\nto agricultural experimentation after being examined by a panel which included\nSierpiński\nand\nMazurkiewicz\n.\nReceiving a Rockefeller Fellowship to work with\nKarl Pearson\nin London, he arrived there in September\n1925\nbut was disappointed to discover that Pearson was ignorant of modern mathematics. He did however become friendly with\nEgon Pearson\n,\nKarl Pearson\n's son.\nEgon Pearson\n, writing in\n[\n3\n]\n, describes Neyman at this time:-\nWhat I remember ... is a week-end which we spent together in the spring of\n1926\nat our family holiday cottage\n(\nthe Old School House\n)\nat Coldharbour on Leith Hill in Surrey. It was then that I listened with fascination to an account of his early life in Russia and of the experiences which he had later undergone in the shadow of those disruptive forces, set in train throughout Central Europe by war and the Russian Revolution.\nDisappointed at the lack of mathematics in the statistics being studied at University College, London, Neyman obtained an extension of his fellowship to allow him to spend a year in Paris. He arrived in Paris in the summer of\n1926\nto visit\nBorel\n. In Paris for session\n1926\n-\n27\nNeyman attended lectures by\nBorel\n,\nLebesgue\n(\nwhose lectures he particularly enjoyed\n)\nand\nHadamard\nand his interests began to move back towards sets, measure and integration. However his interest in statistics was stimulated again by a letter from\nEgon Pearson\n, who sought a general principle from which\nGosset\n's tests could be derived. Neyman went on to produce fundamental results on hypothesis testing and, when\nEgon Pearson\nvisited Paris in the spring of\n1927\n, they collaborated in writing their first paper.\nNeyman returned to Poland in May\n1927\nand immediately tried to set up a biometric laboratory in Warsaw. He spent time in both Warsaw and Kraków and on\n26\nJune obtained his\nhabilitation\nand began lecturing as a\ndocent\n. In June\n1927\nNeyman wrote:-\nCertainly\n[\nthe laboratory\n]\nis not yet sure, especially as our loan in America is not yet signed.\nHowever by\n1928\nhe had managed to set up a Biometric Laboratory at the Nencki Institute for Experimental Biology in Warsaw. His collaboration with\nEgon Pearson\ncontinued with\nOn the problem of two samples\nbeing published by the\nPolish Academy of Sciences\nin Kraków in\n1930\n. However life in Poland was becoming increasingly hard and\n1931\nNeyman wrote to\nEgon Pearson\n:-\n... we have in Poland a terrific crisis in everything. Accordingly the money from the Government given usually to the Nencki Institute will be diminished considerably and I shall have difficulties in feeding my pups.\nNeyman's 'pups' were the research workers in his laboratory! By\n1932\nthings seemed even worse for Neyman who wrote:-\nI simply cannot work, the crisis and the struggle for existence takes all my time and energy.\nBetween\n1928\nand\n1933\nNeyman and\nEgon Pearson\nhad written a number of important papers on hypothesis testing and the collaboration was highly productive with papers such as\nOn the problem of the most efficient tests of statistical hypotheses\n(1933)\nand\nThe testing of statistical hypotheses in relation to probabilities a priori\n(1933)\n.\nIn\n1933\nKarl Pearson\nretired as from the\nGalton\nChair of Statistics in University College London and\nEgon Pearson\nbecame Head of the Department of Applied Statistics. Neyman obtained a three month leave of absence to go in England in\n1934\nto fill a temporary post in\nEgon Pearson\n's department. The following year the post was made permanent and Neyman held it until\n1938\n.\nThe arrangement which put\nFisher\nand\nEgon Pearson\ninto the same building at University College did not work well on a personal level. Although\nFisher\nhad inspired much of Neyman's work, now that they were working in the same building relations seemed to break down. In the spring of\n1937\nNeyman spent six weeks in the United States on a lecture tour of universities organised by\nWilks\n. Shortly after his return he had a major paper\nOutline of a theory of statistical estimation based on the classical theory of probability\naccepted for publication by the\nRoyal Society\n. He hoped to obtain a chair at University College but that seemed unlikely, so he also considered returning to Warsaw. However,\nEgon Pearson\nworked hard to keep him in London and managed to arrange salary increases. Then Neyman received an offer from\nEvans\nof a lectureship at the University of California at Berkeley.\nIn\n1970\nNeyman received an honorary degree and the letter of recommendation listed his achievements in London\n(\nsee\n[\n4\n]\n)\n:-\nDuring the years\n1934\n-\n38\nNeyman made four fundamental contributions to the science of Statistics. Each of them would have been sufficient to establish an international reputation, both for their immediate effect and for the impetus which the new ideas and methods had on the thinking of young and old alike. He put forward the theory of confidence intervals, the importance of which in statistical theory and analysis of data cannot be overemphasised. His contribution to the theory of contagious distributions is still of great utility in the interpretation of biological data. His paper on sampling stratified populations paved the way for a statistical theory which, among other things, gave us the Gallup Poll.\n[\nHis\n]\nwork, and that of\nFisher\n, each with a different model for randomised experiments, led to the whole new field of experimentation so much used in agriculture, biology, medicine, and physical sciences.\nOn\n21\nApril\n1938\nNeyman accepted the offer from Berkeley and he arrived there in August; he worked in Berkeley for the rest of his life. There he taught probability and statistics in the mathematics department but aimed to set up a centre to train American statisticians. Soon there was an officially recognised Statistical Laboratory within the Department of Mathematics but the start of World War II diverted most academics from their intended course. Neyman undertook military research, particularly working on bomb sights and targeting problems. He was just getting back to building statistics at Berkeley at the end of the war when he received a request to go to Greece as part of a team to observe the elections there. Clearly a statistician would be invaluable on such a team.\nThe mission to Greece was not a great success as far as Neyman was concerned. He contacted a Greek professor of international law whom he knew to have been in Paris when he was there in\n1926\n-\n27\n. Since the professor was not neutral in the elections, articles were published in the press, and Neyman was dismissed when he disobeyed orders not to respond. Back in the United States, he resumed his efforts to build a world-leading school of mathematical statistics at Berkeley. He worked tirelessly towards his goal and statistics became a separate department at Berkeley on\n1\nJuly\n1955\n. In\n[\n4\n]\na memo from the assistant president of Berkeley is quoted:-\nHere, a wilful, persistent and distinguished director has succeeded, step by step over a fifteen year period, against the wish of his department chairman and dean, in converting a small 'laboratory' or institute into, in terms of numbers of students taught, an enormously expensive unit; and he then argues that the unit should be renamed a 'department' because no additional expense will be incurred.\nNeyman's contributions to research in statistics over the latter part of his career were mostly in the areas of applications to meteorology and medicine. He received many honours for his remarkable contributions. In particular we note the Guy Medal of the\nRoyal Statistical Society\nin\n1966\nand the Medal of Science from President Johnson in January\n1969\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Statistics"
  ]
}