{
  "nome_completo": "Joachim Jungius",
  "nome_curto": "Joachim Jungius",
  "ano_nascimento": "1587",
  "ano_morte": "1657",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jungius/",
  "lugar_nascimento": "Lübeck, Holstein (now Germany)",
  "lugar_morte": "Hamburg, Germany",
  "biografia": "Joachim Jungius\nwas given the name\nJoachim Junge\n(\nor\nJung\n)\nwhen he was born; Jungius is the Latin version of Junge which he used in all his publications. His father, Nicolaus Junge, was a teacher at the\nGymnasium\nSt Katharinen in Lübeck and his mother was Brigitte Holdmann, the daughter of Joachim Holdmann who was a minister in the Lutheran Cathedral in Lübeck. However, Nicolaus Junge was murdered when Joachim was only two years old and, in\n1589\n, Brigitte married Martin Nordmann who was a teacher at the Gymnasium St Katharinen in Lübeck. Joachim was brought up by his mother and step-father. He attended the Gymnasium St Katharinen in Lübeck until\n1605\n[\n1\n]\n:-\n... where he commented on the Dialectic of Peter Ramus, as well as writing on logic and composing poetry.\nIn May\n1606\nhe entered the University of Rostock, rather later than one might expect due to his delicate physique, where he studied\nmetaphysics\n. Hans Kangro writes\n[\n1\n]\n:-\nAt Rostock Jungius studied with Johann Sleker, from whom he learned metaphysics in the tradition of Francisco Suarez and his school. In general, however, he preferred to concentrate on mathematics and logic.\nOn leaving Rostock, Jungius matriculated at the University of Giessen in May\n1608\nand he was awarded an M.A. on\n22\nDecember\n1608\n. In\n1609\nhe was appointed as a professor of mathematics at Giessen and there he taught pure mathematics, the physical applications of mathematics to optics, harmonics, astronomy and geography, and the mechanical applications to the theory of refraction, hydrostatics and architecture. In his inaugural lecture, delivered on taking up his appointment at Giessen, he spoke of his belief that mathematics was the basis for all scientific subjects and, as such, was of vital importance in teaching. He studied the new ideas in algebra which had been introduced a few years earlier by\nFrançois Viète\nin his\nIn artem analyticam isagoge\nⓉ\n(\nIntroduction to the analytic art\n)\n. In\n1612\n, along with his Gissen colleague Christoph Helvig, Jungius went to Frankfurt for the coronation of Matthias, King of Hungary and King of Bohemia, as the Holy Roman Emperor. While on this journey he observed sunspots; at the time\nGalileo\n(\nMarch\n1612)\n, David Fabricius and his son Johannes\n(1611)\n, and Christoph Scheiner\n(\nJanuary\n1612)\nwere all claiming priority in their discovery.\n(\nIn fact unknown to all of them\nThomas Harriot\nhas priority, beginning to record sunspot observations on\n8\nDecember\n1610\n.\n)\nIt was while on this visit to Frankfurt that Jungius met with the educational reformer Wolfgang Ratke who had developed his own system of education. Jungius was very interested in Ratke's ideas and together they discussed starting schools in Augsburg and Erfurt which would teach according to Ratke's system. In\n1614\nJungius resigned his position at Giessen with the idea that he would devote himself to educational reform, but he soon decided that he wanted to increase his knowledge of medicine. He enrolled at the University of Rostock to study medicine in August\n1616\n. After some time studying there, he went to Padua to continued medical education:-\n... he must have found the atmosphere of Padua congenial, because of the school's emphasis on a research-oriented natural philosophy, medical training, and mathematics.\nHe received a medical degree from the University of Padua on\n1\nJanuary\n1619\n. Thereafter Jungius practised medicine at Lübeck from\n1619\nto\n1623\n, he held the chair of mathematics at the University of Rostock from\n1624\nto\n1625\n, practised medicine at Brunswick and Wolfenbüttel in\n1625\nand then from\n1626\nto\n1628\nhe again held the chair of mathematics at the University of Rostock. For one year in\n1625\nhe held the chair of medicine at the University of Helmstedt in addition to practicing medicine. When giving his inaugural address on taking up the chair at Rostock, Jungius gave a similar address to the one he had given at Giessen, stressing his belief that mathematics was the basis for all scientific subjects. These years from\n1619\nto\n1629\nwere ones during which he was at the height of his powers, able to use knowledge and skills in many different areas across a whole spectrum of scientific activities. Also during this period he married Catharina Havemann, the daughter of Brauers Valentin Havemann from Rostock, on\n10\nFebruary\n1624\n. Perhaps the mathematical work which occupied him most over these years was his work reconstructing\nApollonius\n's\nPlane Loci\nwhich, although lost had been described by\nPappus\nof Alexandria in Book VII of his\nCollection\n. Jan Hogendijk explains\n[\n16\n]\n:-\nJungius worked on\n[\na reconstruction of\nApollonius\n's Plane Loci\n]\nfrom\n1622\nto\n1629\n, and the work was completed by his pupil Weland in the period between\n1638\nand his death in\n1641\n. Around\n1670\nthe re-construction was annotated by Johannes Muller, who evidently planned to prepare the work for the press. However, the work remained in manuscript until\n[\nit was published in\n1988]\n.\nThe reason that Jungius stopped working on the reconstruction in\n1629\nwas that in that year he moved to Hamburg where he became professor of natural science at the Akademisches Gymnasium. Administrative duties prevented him from completing the reconstruction of\nPlane Loci\n. He became Rector of the Gymnasium and also of the Johanneum, a Latin school which shared the same premises as the Akademisches Gymnasium. On\n19\nMarch\n1629\nhe gave his inaugural oration, similar to the one he had given in Giessen and Rostock, on the use of mathematics in studying liberal arts. Many professors begin their careers teaching in secondary schools, but few make the move which Jungius did and leave university education to teach in schools. It was a move made because of his desire to improve school education and he took charge of the Akademisches Gymnasium and the Johanneum, about fifteen years after it was founded, at a time when it was in difficulties. Under Jungius's leadership the school prospered and many pupils outwith Hamburg or the surrounding area, moved there to benefit from the education. However, he faced difficulties during the\n1630\ns\n[\n1\n]\n:-\nHis wife, Catharina ... died on\n16\nJune\n1638\n. During the\n1630\n's, too, he became subject to the envy of his colleagues and even to attacks by the clergy, despite his devout Protestantism. He was thereafter reluctant to publish his writings and left some\n75\n,\n000\npages in manuscript at the time of his death, of which two-thirds were destroyed in a fire in\n1691\n...\nWhile at the Academic Gymnasium in Hamburg, where he taught until\n1640\n, Jungius delivered \"physics\" lectures which were published by Christopher Meinel in the\n1980\ns. Owen Hannaway writes\n[\n15\n]\n:-\nCopies of the course have survived in a number of manuscript recensions, some revised by Jungius himself. ... In spite of the title\n[\nphysics\n]\n, these are not concerned with the subject matter of\nAristotle\n's 'Physics', nor with the new mathematised physics. Instead they concern substantial change as defined in\nAristotle\n's 'De generatione et corruptione' and Book IV of the 'Meteorologica'.\nWalter Pagel writes in\n[\n24\n]\nabout the wide-ranging contributions which Jungius did publish:-\nJungius was primarily an explorer of nature, interested in the composition of matter, the reaction of bodies with each other and the techniques which would best allow insight into their working. It was notably in the fields of botany and chemistry that he found the empirical directives and morals for his epistemology. It was thus that his 'Logica Hamburgensis'\nⓉ\n(\nHamburg logic\n)\nbecame something profoundly different from the usual textbooks of syllogisms on Peripatetic lines.\nThe\nLogica Hamburgensis\nⓉ\n(\nHamburg logic\n)\n(1638)\nof Jungius, composed for the use of pupils at the Akademisches Gymnasium, presented late medieval theories and techniques of logic. In it he discussed valid oblique cases of arguments that do not fit into simpler forms of inference. For example:\nThe square of an even number is even;\n6\nis even; therefore, the square of\n6\nis even.\nThe oblique case of an even number had to be put into the subject position so that standard arguments could be used.\nAristotle\nhad also dealt with this type of logical argument.\nHoward Bernstein gives the following overview of Jungius's contributions\n[\n8\n]\n:-\nJoachim Jungius was a German polymath somewhat in the Leibnizian tradition of encyclopaedic range as well as originality in several domains of knowledge, including logic, mathematics, and natural philosophy. While\nLeibniz\nadministered a princely library, Jungius assembled an extensive private book and manuscript collection over a long and intellectually ecumenical career. ... At different times in his career, Jungius's scholarly \"centre of gravity\" ... shifted: from his early training in the late scholasticism of Francisco Suarez and his like, to astronomy, logic and mathematics, educational reform, medicine, and chemical philosophy\n(\nin his case corpuscularism\n)\n, to an ambitious program to organise, systematise, and taxonomise - as well as further to contribute to\n(\nbased on a mathematical paradigm\n)\n- the sum total of human knowledge.\nIn mathematics Jungius proved that the\ncatenary\nis not a\nparabola\n(\nGalileo\nassumed it was\n)\n. He was one of the first to use exponents to represent powers and he used mathematics as a model for the natural sciences. As well as mathematics, Jungius was interested in natural science. Audrey Davis in\n[\n6\n]\n(\nreviewing Kango's book\n[\n4\n]\n)\nwrites:-\nKangro's most fortunate discovery, in his own estimation, was a fragment that reflects Jungius's fundamental ideas on logic applied to science.\n[\nIt is\n]\nentitled the \"Protonoeticae philosophiae sciagraphia\" .... From it we learn that Jungius was confident of predicting and explaining natural phenomena by adopting the natural laws that he distinguished. He differentiated three grades of knowledge: Empiricus, Epistemonicus, and Heureticus. Empiricus remained verifiable through experience, Epistemonicus is grounded in principles and rules - as are the axioms of\nEuclid\n's geometry - and Heureticus reveals new methods for the solution of problems previously insoluble. These three methods replaced the prevalent ancient form of logic based on the syllogism. In brief, Jungius transformed the relevant parts of the Peripatetic notion of physics into what was to become physical chemistry by the analysis of unique experiences and experiments and the mathematical method of synthesis.\nIn particular, Jungius is known for his atomic theories. Christoph Meinel\n[\n22\n]\nwrites about Jungius's scientific approach:-\nThe closest amalgamation of the concepts of atom, element, and pure substance that can be found before the nineteenth century, however, was reached by Joachim Jungius in\n1632\n. Here the gap between perceivable and experimentally accessible qualities of macroscopic bodies and those of the ultimate constituents of matter had almost disappeared. ... In\n[\nJungius's\n]\nopinion a distinct science of nature required above all a finite number of principles, just as Euclidean geometry relies upon a small number of basic entities such as the point, the line, and the angle. Jungius's attempt to rebuild the system of physical knowledge belongs to the widespread quest for making both philosophy and natural science as axiomatically structured as geometry. In contrast to most of his contemporaries, Jungius insisted that only the evidence of sensuous experience and an inductive methodology would lead to the identification of these ultimate units of reality. ... Jungius used the magnifying glass to study textile fabric and apparently homogeneous substances such as polished surfaces. He observed that they were in fact always heterogeneous if viewed through a microscope\n(\nanchiscopium\n)\n. In\n1633\n, commenting on Sennert's 'Epitome scientiae naturalis' of\n1618\n, in which Sennert had shown that arguments from geometry about divisibility and continuity must not be applied to the physical sciences, Jungius remarked that until then no physical body had ever been proved to be entirely homogeneous. For no surface could be so smooth that one could not think of a more powerful microscope that would reveal its true discontinuity. Consequently, Jungius categorically stated that continuity was foreign to the realm of sensuous experience. On the other hand he had to admit that if there were no truly continuous parts in the end, infinite progression and divisibility would result. This was the vicious circle of every observational approach to the atoms.\nThis approach led Jungius to a concept of an element\n[\n24\n]\n:-\n... he comes to list a number of substances\n(\nsilver, gold, mercury, sulphur, salt and some others\n)\nthe particles of which he thought to be not subject to further diacrisis, e.g. through acid or preferably fire. They are - so he believed - really homogeneous and therefore true elements.\nHe was led to make important chemical discoveries as Robert Multhauf describes in\n[\n23\n]\n:-\nIn\n1642\nthe little remembered German chemist, Joachim Jungius, published a criticism of contemporary mineral chemistry which represents a step in the development of the chemical theory comparable to that of Agricola with respect to the physical theory. Jungius begins with a common criticism of the chemical system, the impossibility of obtaining from metals any alleged elementary salt. But he goes on to suggest that blue vitriol\n(\ncopper sulphate\n)\nis a combination of copper with \"spirit of sulphur,\" and that the proximity of the more imperfect metal, iron, presents the spirit of sulphur with a combination for which it has a greater sympathy. Hence it releases the copper. A similar replacement occurs when copper itself is introduced into a solution of silver in aqua fortis. Thus the fact that metals can exist in the form of salts and liquids does not, according to Jungius, prove that salts and liquids exist as ingredients of metals.\nFinally let us quote the opinion of one of Jungius's contemporaries.\nJohn Pell\nwrote\n[\n20\n]\n:-\n... there are few men that have not some idol, some man or woman whom they esteem, and admire, above the rest of mankind and Jungius is mine. ... I profess to expect more solidity in Jungius's writings than in any other man living ...\nGottfried Wilhelm Leibniz\n, who was only eleven years old when Jungius died, wrote:-\nWhile Jungius of Lübeck is a man little known even in Germany itself, he was clearly of such judiciousness and such capacity of mind that I know of no other mortal, including even\nDescartes\nhimself, from whom we could better have expected a great restoration of the sciences, had Jungius been either known or assisted.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}