{
  "nome_completo": "Joan Sylvia Lyttle Birman",
  "nome_curto": "Joan Sylvia Lyttle Birman",
  "ano_nascimento": "1927",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Birman/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "Joan Sylvia Lyttle\nparents were George and Lillian Lyttle\n(\nBirman is her married name following her marriage to Joseph L Birman\n)\n. The family was Jewish. George was born in Russia, brought up in Liverpool, England, and had emigrated to the United States when he was seventeen years of age. He ran a successful business as a dress manufacturer. Lillian was born in New York, but was the daughter of Russian-Polish immigrants. Lillian and George Lyttle had four daughters; in order of eldest to youngest, Helen, Ruth, Joan\n(\nthe subject of this biography\n)\nand Ada. Despite the fact that George praised the opportunities that the United States had given him in business, he wanted his daughters to concentrate on their education and not consider entering the business world.\nAs a young child Joan developed a love of patterns, for example in primary school she was fascinated by the odd and even patterns which arose in adding and multiplying whole numbers. She attended the Julia Richmond High School, an all-girls school in New York, where she developed a love for geometry\n[\n2\n]\n:-\nIt was really a rough inner-city high school, but within it there was a small academic unit, a school within a school. We had some very good teachers. We had a course in Euclidean geometry, and every single night we would have telephone conversations and argue over the solutions to the geometry problems. That was my introduction to proof, and I just loved it, it was wonderful.\nAfter graduating from Richmond High School, she entered Swarthmore College, a coeducational institution of higher learning in Swarthmore, Pennsylvania. At school she had shown little talent for languages but loved physics, biology and astronomy but, deciding against studying astronomy as she liked living in cities, she aimed to major in mathematics at college. However, she was unhappy living in the Swarthmore college dorm so transferred to Barnard College, a women's only college affiliated to Columbia University, in order to be able to live at home in New York. She received a B.A. in mathematics from Barnard College in\n1948\nbut had been put off continuing to study mathematics by courses such as calculus which left her feeling she did not understand the subject.\nAfter graduating, she worked for an engineering firm that made microwave frequency meters. She enjoyed the first task she was given which was basically a research task involving calibration but after this was completed she was given routine work and soon became bored. Offered a position as a physics assistant by her physics professor at Barnard College, she accepted with enthusiasm and, while taking up the position, she registered for a Master's degree in physics. She married Joseph L Birman in\n1950\n, the same year as she was awarded her M.A. in physics. However, she felt she did not have much feel for physics and had only passed with mediocre grades having no physical intuition. After being awarded this degree she worked as a systems analyst for the engineering firm General Precision Equipment on aircraft navigation systems from\n1950\nto\n1953\n. Then she was employed from\n1953\nto\n1955\nas a system analyst for the W L Maxson Corporation. Birman gave up work when her first child Kenneth was born in\n1955\n. Two further children, Deborah, and Carl David were born over the next five years. During this time she did some part-time work for the Technical Research Group. The family spent six months at the University of Pennsylvania where Joseph Birman was a visiting professor. Joan had to give up her part-time job to make this move so she took a computer course at the university. This course made her feel she wanted to learn more mathematics.\nIn January\n1961\n, immediately after Carl David was born, she registered for a part-time Master's Degree in mathematics at New York University's Courant Institute. Since her husband was now a professor of physics at New York University, she could study free of charge. In fact this move owed something to Joseph Birman, not only for his encouragement but also the example he had showed switching from industry to work in the academic world. When she began her studies, it was with the aim of concentrating on applied mathematics courses. However, it was the pure mathematics courses that enthused her most. Birman took linear algebra in her first year, then real and complex analysis in the following year. Courses by\nLouis Nirenberg\non complex variable and by Jack Schwartz on topology were particularly significant in making her realise that pure mathematics was the area she loved. She also took a course by\nCathleen Morawetz\non applied mathematics.\nAfter taking the examinations for the Master's degree she was given the opportunity to undertake research for a Ph.D. although, to qualify for a fellowship, this had to be on a full-time basis. However, she could use the fellowship to pay for childcare that would allow her to become a full-time research student. She approached Michel Kervaire, a topologist, who did not think she had the right background to work in his area; he also thought she was too old. She then approached\nLouis Nirenberg\nwho, after asking her about the topics she enjoyed, said she would be better suited to pure mathematics research rather than applied mathematics. She then approached\nWilhelm Magnus\nwho was pleased to take her on as a doctoral student\n[\n2\n]\n:-\nHe was an algebraist, but he had noticed that I loved topology, and so he met me halfway and gave me a paper to read about braids. That showed great sensitivity on his part. It was a terrific topic. He later told me of his habit of picking up strays, and in some way I was a stray.\nBirman was awarded a Ph.D. from New York University for her thesis\nBraid Groups and Their Relationship to Mapping Class Groups\nin\n1968\n. The abstract of her thesis reads:-\nIn\n1962\nR H Fox\nintroduced a new definition of the braid group as the fundamental group of the space of\nn\nn\nn\nunordered distinct points of the Euclidean plane.\nFox\n's definition suggested a natural generalization to the concept of a braid group on an arbitrary manifold, as the fundamental group of the space of\nn\nn\nn\nunordered, distinct points of that manifold. The present investigation begins with\nFox\n's definition, and studies the algebraic and geometric properties of these braid groups on arbitrary manifolds. In Part I a new meaning is given to the\nFox\nbraid groups, by relating them to the mapping class groups of the manifold. Part\n2\ncontains an algebraic investigation of the braid groups. In Part\n3\nthe algebraic connection between braid groups and mapping class groups is studied.\nIn August\n1968\nBirman was offered a position of Assistant Professor of Mathematics at the Stevens Institute of Technology in Hoboken after an unexpected vacancy arose there. She explained in\n[\n1\n]\nhow lucky this opportunity was:-\nI knew I wanted to do research. The job market was very poor when I got my Ph.D. Also, I was a woman, and there were very few women in mathematics; I was older, and there was a lot of prejudice against that. ,,, I was restricted geographically; because we had children it was impossible to go any place far from home. So I was limited to all the colleges in the New York area. I was offered a job in one of the branches of the city university with a high teaching load and uninteresting courses. I didn't want to do that. I really wanted to be a research mathematician.\nAt the Stevens Institute she began a fruitful collaboration with Mike Hilden\n(\nHugh M Hilden\n)\n[\n1\n]\n:-\n... he, like me, was a little bit beyond the usual age, though much younger than me. He had been an engineer and he didn't like what he was doing, so he went back to graduate school and had just got his degree. ... We began to have lunch together. I talked to him about this problem that I had tried to solve. We talked about it through the whole year.\nThis led to their first paper\nOn the mapping class groups of closed surfaces as covering spaces\nwhich was published in the Proceedings of the\n1969\nConference at Stony Brook, New York. Further joint papers followed such as\nMapping class groups of closed surfaces as covering spaces\n(1971)\n,\nOn lifting and projecting homeomorphism\n(1972)\nand\nIsotopies of homeomorphisms of Riemann surfaces and a theorem about Artin's braid group\n(1972)\n. Birman was a Visiting Assistant Professor at Princeton University during\n1971\n-\n72\nand was asked to lecture on her work, particularly on her joint research with Hilden. Notes of these lectures were taken by James Cannon, at that time a post-doctoral researcher at Princeton, and these became her classic book\nBraids, links, and mapping class groups\n. Wilbur Whitten writes in a review:-\nCentring on\nEmil Artin\n's braid group and its applications in geometric topology, this thorough, skilfully written monograph, the first devoted entirely to the theory of braids, covers each of its topics - roughly, one for each of five chapters - from its historic beginnings. ... The book is a pleasure to read.\nWilhelm Magnus\nexpresses the brilliance of Birman's text in his own insightful way\n[\n7\n]\n:-\nTalleyrand is supposed to have said that nobody could know the full sweetness of life who had not lived before the French Revolution. One may say that nobody can know the full charm of topology who had to learn it after it became rigorous.\nArtin\n's first paper\n(\npublished in\n1925)\non the theory of braids is a perfect and lasting monument of this charm. It is a paper containing almost exclusively ideas and results but practically no machinery. Birman's monograph gives a nearly complete account not only of\nArtin\n's results but also of the numerous important applications, later developments and generalizations of the theory of braids, many of which are due to the author. Her presentation is, of course, completely rigorous, but it is remarkable that she has been able to preserve much of the appeal to geometric intuition which helped to make\nArtin\n's paper so attractive. The book is written in a concise but lucid style.\nAfter spending the year\n1971\n-\n72\nat Princeton, Birman returned to the Stevens Institute of Technology where she was promoted to Associate Professor of Mathematics. She left the Stevens Institute one year later, accepting an appointment as Professor of Mathematics at Barnard College. She served as Chairman of the Mathematics Department in\n1973\n-\n87\n,\n1989\n-\n1991\n, and\n1995\n-\n1998\n.\nLet us use Birman's own words to summarise the many different areas of research to which she has contributed\n[\n2\n]\n:-\nI think I was very lucky because my Ph.D. thesis led me to many different parts of mathematics. The particular problems that are suggested by braids have led me to knot theory, to operator algebras, to mapping class groups, to singularity theory, to contact topology, to complexity theory and even to ordinary differential equations and chaos. I'm working in a lot of different fields, and in most cases the braid group had led me there and played a role, in some way.\nIn\n2004\nBirman retired from her position as Professor of Mathematics and was made Professor Emerita. However, at the same time she was appointed as a Research Professor at Columbia University's Barnard College, a position she held until\n2007\n[\n2\n]\n:-\nBirman has had twenty-one doctoral students and numerous collaborators. She has served on the editorial boards of several journals and was among the founding editors of two journals, 'Geometry and Topology' and 'Algebraic and Geometric Topology'. Both journals are now published by the nonprofit Mathematical Sciences Publishing Company, for which Birman serves on the board of directors.\nBirman has received many distinctions for her achievements including a Sloan Foundation Fellowship in\n1974\n-\n6\nand a Guggenheim Foundation Fellowship in\n1994\n-\n5\n. In\n1987\nshe was selected by the Association for Women in Mathematics to be their\nNoether\nLecturer. She was awarded the\nChauvenet\nPrize by the\nMathematical Association of America\nin January\n1996\nfor her article\nNew points of view in knot theory\n, which appeared in the\nBulletin\nof the\nAmerican Mathematical Society\nin April\n1993\n. Let us quote from the Introduction to this important paper:-\nIn this article we shall give an account of certain developments in knot theory which followed upon the discovery of the Jones polynomial in\n1984\n. The focus of our account will be recent glimmerings of understanding of the topological meaning of the new invariants. A second theme will be the central role that braid theory has played in the subject. A third will be the unifying principles provided by representations of simple\nLie algebras\nand their universal enveloping algebras. These choices in emphasis are our own. They represent, at best, particular aspects of the far-reaching ramifications that followed the discovery of the Jones polynomial. ... Our goal, throughout this review, is to present the material in the most transparent and non-technical manner possible in order to help readers who work in other areas to learn as much as possible about the state of the art in knot theory. Thus, when we give \"proofs\", they will be, at best, sketches of proofs. We hope there will be enough detail so that, say, a diligent graduate student who is motivated to read a little beyond this paper will be able to fill in the gaps.\nOther honours awarded to Birman include an honorary degree from the Israel Institute of Technology\n(\nTechnion\n)\nin June\n1997\nand New York City Mayor's Award in Science and Technology in January\n2006\n. She has been elected to the European Academy of Sciences\n(\nApril\n2003)\n, as a fellow of the\nNew York Academy of Sciences\n, and as an Honorary Foreign Associate of the\nMoscow Mathematical Society\n(1996)\n.\nIn\n2015\nBirman was elected to Honorary Membership of the\nLondon Mathematical Society\nin its\n150\nth\nAnniversary year. The short citation reads:-\nProfessor Birman has revealed deep and surprising connections between fields. She has played a leading role in\n3\n-manifold topology, knot theory, and geometric group theory.\nFinally, we record that in\n1990\nBirman donated funds to set up the Ruth Lyttle Satter Prize in Mathematics in memory of her sister, Ruth Lyttle Satter, who was a plant physiologist:-\nProfessor Birman requested that the prize be established to honour her sister's commitment to research and to encouraging women in science. The prizes are awarded every two years to recognize an outstanding contribution to mathematics research by a woman in the previous five years.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}