{
  "nome_completo": "Joan Elisabeth Lowther Clarke Murray",
  "nome_curto": "Joan Clarke",
  "ano_nascimento": "1917",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clarke_Joan/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Headington, Oxfordshire, England",
  "biografia": "Joan Clarke\n's parents were William Kemp Lowther Clarke, a Clergyman, and Dorothy Elisabeth Clarke. She was their youngest child and had three elder brothers and one sister. Joan was educated at Dulwich High School and in\n1936\nmatriculated at Newnham College, Cambridge, to study Mathematics. In\n1937\nand\n1939\nrespectively, she achieved a First in Part I and Part II of the Mathematical Tripos\n(\na three-year course leading to a BA degree\n)\nand became a\nWrangler\n. In\n1939\nClarke graduated, achieving a double first in Mathematics; however this was merely the title of her degree, as Cambridge did not admit women to \"full membership of the body academic\" until after the end of the Second World War. In\n1939\nClarke was awarded the distinguished\nPhilippa Fawcett\nPrize and in\n1939\n-\n1940\nthe Helen Gladstone Scholarship.\nGordon Welchman was one of the four top mathematicians recruited in\n1939\nto set up decoding operations at Bletchley Park. During the time that Joan Clarke was an undergraduate at Cambridge, Gordon Welchman had supervised her in Geometry during Part II and, aware of her mathematical ability, he was responsible for recruiting Clarke to join the 'Government Code and Cypher School'\n(\nGCCS\n)\nat Bletchley Park. Records describe Clarke as congenial but shy, gentle and kind, non-aggressive and always subordinate to the men in her life; qualities that would allow her to conform within the male dominated world of Bletchley Park. Let us examine in a little more detail the background to the GCCS.\nThe Germans had successfully developed a device called an Enigma machine to encrypt their messages. They believed that the Enigma code was unbreakable. The machine was an electro-mechanical device that relied on assorted rotating wheels and rotors to scramble plain text messages into jumbled cyphertext. The machine's variable elements could be set in billions of combinations. The Germans changed the settings on the Enigma machines every day and each branch of their military intelligence and civil services used different enigma settings. Not knowing the settings meant the chances of being able to decipher a message was an astonishing\n150\nmillion million million to one.\nTo defeat the Germans, it was imperative that the Enigma code was broken and Churchill's Government searched the country for the best mathematicians, chess champions, Egyptologists and others of suitable ability, who would know anything about the possible permutations of formal systems, to assist in the operation of cracking the enigma code. In August\n1939\n, the GCCS was set up in great secrecy at Bletchley Park, a Victorian mansion in Buckinghamshire, with the singular intention of breaking the German Enigma code. Bletchley Park would provide a safer home than London for the code breakers, plus it had rail and teleprinter connections to all parts of the country and was at the junction of a major road - all ideal attributes.\nTo highlight the complexity of the task the code breakers faced, Alastair Denniston, who was to become the first Head of Bletchley Park, at one time actually shared the German belief that the military Enigma was invincible; he is recorded as telling his fellow code breakers\n[\n6\n]\n:-\n... all German codes were unbreakable.\nJoan Clarke and her colleagues were destined to prove him wrong. Initially, Clarke was not exactly told what the job would entail, only that\n[\n1\n]\n:-\n... the work didn't really need mathematics but mathematicians tended to be good at it.\nClarke accepted the post and the challenge, agreeing to start work at Bletchley Park in June\n1940\n, after she had completed Part III of the Mathematical Tripos. She arrived at Bletchley Park on\n17\nJune\n1940\n. Her first placement was humble enough, joining a large group of women, generally referred to as \"the girls\" who were engaged in routine clerical work in Hut\n8\n. Even though the ratio of women to men working at Bletchley Park was\n8\n:\n1\n, women were mostly employed in clerical and administration work and not the more intricate cryptology, which was a male dominated area. During her time at Bletchley Park, Clarke only ever knew of one other female mathematical cryptanalyst. Clarke was originally paid £\n2\na week - but as this was an era of female discrimination in the workplace, similarly qualified men received significantly more money.\nClarke's first promotion at work was to Linguist Grade - even though Clarke did not speak another language - this promotion was engineered to enable her to earn extra money - thereby acknowledging her workload and contributions to the team. Clarke has written that she\n[\n1\n]\n:-\n... enjoyed answering a questionnaire with 'Grade: Linguist, Languages: none!\nShe believed she struggled to get a further promotion purely because of her sex. The Deputy Director at Bletchley Park, Commander Edward Travis, later told her that she might have to enroll in the WRNS\n(\nWomen's Royal Naval Service\n)\nin order to earn significantly more money, but Clarke did not wish to pursue this route.\nIn Hut\n8\n, Clarke was quickly promoted to her own table in a small room, joining a team which included\nAlan Turing\n, Tony Kendrick and Peter Twinn. Collectively they were applying themselves to non-routine tasks of trying to break the complex Naval Enigma - codenamed Dolphin.\nWilliam F Friedman, the founder of modern US cryptology wrote that a code breaker required unusual powers of inductive and deductive reasoning, much concentration, perseverance and a vivid imagination. The fact that Joan Clarke was able to move so quickly into the male cryptology area at Bletchley Park indicates she possessed these attributes.\nThe Naval Enigma was different to the Army and Luftwaffe Enigma and more complex to break. Firstly, two extra wheels had been added so there was now a choice of three from five giving a total number of\n336\npossible wheel orders. Secondly, to give added security, a different indicator system was applied; instead of transmitting the indicators directly, they were super enciphered using bigram tables.\nThe need for breaking the Naval Enigma code was growing greater by the day. By mid\n1940\n, following the German occupation of France, German U-Boats now had easy access to the Atlantic from the Bay of Biscay. Britain had become extremely dependent on imports and was importing half of its food and all of its oil. The provisions now had to come across the Atlantic from North America and the convoys rapidly become targets for the U-boats. At one stage, Britain was only three days from running out of food and therefore it was crucial the Naval Enigma code was broken.\nIn early May\n1940\n, matched plaintext and Enigma cyphertext became available from a German patrol boat, Schiff\n26\n, captured off the Norwegian Coast. Joan Clarke's first task on arriving at Bletchley Park was to use a new key-finding aid called the Bombe, against the recovered data. This successfully resulted in Clarke and her colleagues breaking approximately six days of April traffic over a period of three months.\nBy the end of\n1940\nrotors VI, VII and VIII had been recovered and a library of cribs built up - the cribs were assembled by using anticipated text from German weather ships that were relaying messages in the German Meteorological cipher\n(\nwhich was easier to decipher than the dolphin cipher\n)\n. This provided Clarke and the team, with the knowledge of what information to expect in a message and how the Naval indicator system worked.\nWith\n336\npossible rotor combinations and the double indicator decipherment, the usual methods of codebreaking were futile. For this reason\nAlan Turing\ninvented a new codebreaking technique called Banburismus. The name was given to the technique because it involved the use of long sheets of paper printed in Banbury. The aim of this method was to identify the right hand and middle wheel and thus reduce the possible wheel orders from\n336\nto as little as\n20\n. There were few Bombes in\n1941\nand with so many different combinations of wheels it was far too time consuming.\nTuring\n's method exploited the German cryptographic mistake of having different positions of turnover for each wheel\n(\nthough the Germans did learn from their mistake and wheels VI, VII and VIII all had the same positions of turnover\n)\n. Professor Jack Good, who also worked on Banburismus, has since said that it was the first example of Sequential Analysis and describes it as\n[\n6\n]\n:-\n... a complicated but enjoyable game.\nThere were eight male Banburists and Joan Clarke was the only female Banburist. However, she was one of the best Banburists and was so enthusiastic and fascinated with the technique that she would sometimes be unwilling to hand over her workings at the end of her shift and would continue to see if a few more tests would produce a result. A method known as Yoxallismus was devised to speed up this work and was named after its inventor Leslie Yoxall. Shortly afterwards, Clarke devised a method of her own to also speed up the technique, and she was told, to her surprise, that she had used pure Dillysimus. This was a method which had been invented by Dillwin\n(\nDilly\n)\nKnox, one of the few cryptographic experts of World War One, who had originally headed the attack on the German enigma.\nBanburismus was impossible without the Bigram substitution tables and therefore without them, very little progress against the Naval Enigma was accomplished. The breakthrough came in February and June\n1941\n, when trawlers were captured along with cipher equipment and codes. Clarke and her co-workers successfully performed Banburismus for two years, only stopping in August\n1943\nwhen ultra fast Bombes became available. The successful results of their efforts were evident immediately. Between March and June\n1941\n, the Wolf Packs\n(\na term used to describe the mass attack tactics used against convoys by U-boats\n)\n, had sunk\n282\n,\n000\ntons of shipping a month. From July, the figure dropped to\n120\n,\n000\ntons a month and by November, to\n62\n,\n000\ntons.\nIn the spring of\n1941\n, Joan Clarke developed a close friendship with her Hut\n8\ncolleague\nAlan Turing\n. Clarke and\nTuring\nhad actually met previously to working at Bletchley Park, as\nTuring\nwas a friend of her older brother. For a time, they became inseparable,\nTuring\narranged their shifts so they could work together and they spent many of their leave days together. Soon after this blossoming friendship,\nTuring\nproposed marriage and Clarke accepted. However, devastatingly for Clarke, a few days after the proposal,\nTuring\ntold her\n[\n2\n]\n:-\n... to not count on it working out as he had homosexual tendencies.\nTuring\nexpected this to be the end of their affair, but Clarke was undeterred by his declaration, and their engagement continued. To understand her decision to continue with the engagement following his disclosure, it has to be made clear that during this period in history, marriage for many women, was considered a social duty and it was not necessary that marriage should correspond with sexual desires.\nClarke was formally introduced to\nAlan Turing\n's family and vice versa, he gave her an engagement ring, although she did not wear it when in the Hut, choosing to keep their engagement secret from their colleagues. They talked of the future and\nTuring\ntold her of his desire to have children. They shared many interests, both were keen chess players and, as Clarke had studied Botany at school, she could become involved with\nTuring\n's life long enthusiasm of the growth and form of plant life. When\nTuring\nwrote his account of the Enigma Theory for the use of new recruits in Hut\n6\nand Hut\n8\n,\n(\nknown at Bletchley Park as \"Prof's book\"\n)\nhe used Joan Clarke as his 'guinea pig' - she had to read and trial it, checking that it was understandable for them.\nIn the late summer of\n1941\n, following a holiday in North Wales, their engagement ended by mutual consent, because of\nTuring\n's belief that the marriage would be a failure because of his homosexuality. Clarke was to remain friends with\nTuring\nfor the rest of his life. Years later, after they had both left Bletchley Park,\nTuring\nrevealed in a letter to Clarke that he \"did occasionally practice\" his homosexuality and that he had been \"found out\". Homosexuality was illegal at this time, with imprisonment or chemical castration the punishment for offenders. In\n1952\nin Manchester,\nAlan Turing\nwas convicted of \"acts of gross indecency\" following admission to a relationship with another man. In his defence,\nTuring\nsaid he did not consider he had done anything wrong. As a result of the conviction,\nTuring\nwas given oestrogen injections for a year, and shortly afterwards\nAlan Turing\ncommitted suicide.\nAs well as continuing to break the Dolphin Enigma, Clarke and the Naval Enigma team were allotted responsibility for breaking the Shark Enigma - codename for the\n4\n-rotor key introduced in late\n1941\n. The Hut\n8\nteam successfully broke the code in mid-December\n1942\n, but at the end of\n1943\n, the US codebreaking unit\n(\nOP-\n20\n-G\n)\ntook over the responsibility for continuing with the Shark Enigma. As a result, many of the Hut\n8\nstaff transferred to other parts of Bletchley Park. However, Joan Clarke remained in Hut\n8\n, becoming Deputy Head in early\n1944\n. She and her team continued to break the Naval Enigma until the end of the war. The war in the west officially ended at midnight on\n9\nMay\n1945\n. By March\n1946\n, all the workers had vacated Bletchley Park and every scrap of evidence of their secret code breaking exploits was disposed of.\nIn\n1947\n, Clarke was appointed a Member of the British Empire\n(\nMBE\n)\nfor her codebreaking expertise during the war, but due to the restraints of the Official Secrets Act, her work was to remain confidential for many years to come. The codebreaking effort continued when the GCCS was renamed GCHQ\n(\nGovernment Communications Headquarters\n)\nand moved to Eastcote. Clarke transferred to Bletchley Park's successor and there she met a colleague named Lieutenant-Colonel J\n(\nJock\n)\nK R Murray, a retired army officer, whom she went on to marry in\n1952\n. The couple did not have children.\nShortly after their marriage and due to her husband's poor health, the couple moved to Scotland where they both had a keen interest in Scottish History. It was from her husband that Clarke gained an interest in numismatic history, as he had published many important papers on the Scottish coinage of the\n16\nth\nand\n17\nth\ncenturies. They returned to Cheltenham in\n1962\nand Clarke rejoined the GCHQ where she remained until retiring at the age of\n60\nin\n1977\n. In\n1974\n, after the lifting of Official Secrets Act restrictions, details of the code breakers brilliant work became widely known. The Bombe and the impact of all their endeavors began to emerge.\nIn\n1986\n, following the death of her husband, Clarke moved to Headington, near Oxford, where she continued her numismatic research. The \"Numismatic Circular\" recorded\n[\n6\n]\n:-\nJoan Murray's greatest achievement was to establish the sequence of gold unicorns and heavy groats of James III and James IV, an extremely complex series which caused great difficulty for previous students.\nIn\n1987\n, Clarke was awarded the Sandford Saltus Medal - the Society's premier distinction, voted for by its members for scholarly contributions to British Numismatics.\nAfter her retirement, Clarke also assisted Sir Harry Hinsley on what became Appendix\n30\nto Volume\n3\n, Issue\n2\nof the\n1988\nBritish Intelligence in the Second World War, a substantially revised assessment of the Polish, French and British contributions to breaking the Enigma. In\n1987\n, the play \"Breaking the Code\" by Hugh Whitmore, about the life of\nAlan Turing\n, opened in London. The play is based on the\n1983\nbook, \"Alan Turing, the Enigma\" by Andrew Hodges. Whitmore based the character in the play named Pat Smith, on Joan Clarke. Clarke co-operated with Andrew Hodges when he was researching and writing his book, but she chose not see Whitmore's play, declaring that\n[7\n:-\n... it would have been too painful.\nJoan Clarke died at her home in Headington, Oxford. Her obituary offers an insight into how she was perceived, both personally and professionally\n[\n7\n]\n:-\nShe is remembered as \"one of the really good cryptanalysts\" of GCHQ who was liked and admired by colleagues throughout her long and dedicated career.\nThe full extent of Joan Clarke's mathematical contributions and accomplishments at Bletchley Park remain unknown, because of the continuing secrecy amongst cryptanalysts. Furthermore, Clarke's work is still somewhat overshadowed by her relationship with\nAlan Turing\n. Joan Clarke played a notable role in Britain's crucial achievements during World War II and it is clear that her mathematical expertise on the Naval Enigma helped to shorten the war and thereby save thousands of lives.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}