{
  "nome_completo": "João Baptista Lavanha",
  "nome_curto": "João Baptista Lavanha",
  "ano_nascimento": "1555",
  "ano_morte": "1624",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lavanha/",
  "lugar_nascimento": "Lisbon, Portugal",
  "lugar_morte": "Madrid, Spain",
  "biografia": "João Baptista Lavanha\nwas born into a Jewish family. His father, Luis de Lavanha, was a gentleman in the Portuguese Court while nothing is known of his mother except her name, D Jerónima Dança. Nothing is known of Lavanha's childhood or is youth but he is said to have been sent by his patron, the king of Portugal D Sebastian\n(1554\n-\n1578)\n, to study in Rome under the professor of mathematics there. It is believed that he entered the service of Sebastian in\n1572\nand studied in Rome between\n1572\nand\n1578\n. During this period he wrote a book on astronomy, namely\nTaboas do lugar do Sol\nbut it was not published until\n1600\n. He was appointed by king Philip II\n(1527\n-\n1598)\nof Spain to be professor of mathematics in Madrid in\n1582\n. Perhaps we should look at the background to see how this came about.\nAt the beginning of the\n16\nth\ncentury, Spain and Portugal were both major sea powers conquering parts of the new world. Both were Roman Catholic countries and, particularly Spain, was a major force behind the Counter-reformation against the Protestant lands. Sebastian, who had become king of Portugal in\n1557\n, dreamed that he might be able to lead new Crusades. His attempt at a Crusade was to invade North Africa in\n1578\nbut his army was defeated by the Sultan of Morocco. The position of Portugal was greatly weakened by this defeat in which Sebastian was killed. Philip II had become king of Spain in\n1556\nbut he also ruled over an empire including the Netherlands and Italy. The royal houses of Spain and Portugal were related by marriage and Philip II was an uncle of Sebastian of Portugal. Sebastian had tried to get Philip's support for his Morocco Crusade but Philip had other projects in mind and was not interesting in supporting Portugal. Philip II sent the Duke of Alba with an army to conquer Portugal in\n1580\nand he absorbed it into the Spanish empire. However, after conquering Portugal, he realised that Portugal was more advanced in the study of navigation than Spain. In an attempt to correct this, Philip founded an Academy of Mathematics in Madrid with Lavanha as its first professor. Lavanha was given his mission by Philip to:-\n... take care of our Court ... in matters of cosmography, topography, and geography and to teach mathematics.\nPhilip II appointed a wide range of experts to the Academy of Mathematics in Madrid. There were cosmographers, military experts, architects together with civil and military engineers. The idea for the Academy had been due to Juan de Herrera\n(1530\n-\n1597)\n, a mathematician and architect, who was appointed as its first director. Founded on\n25\nDecember\n1582\n, it began operating in October\n1583\n. The idea was that theoretical developments in mathematics should produce corresponding practical advances, both military and civil. Lavanha taught mathematics at the Academy from the time it began operating\n[\n2\n]\n:-\nThe 'Tratado del arte de navegar' contains notes from classes he taught at the Academy of Mathematics, in Madrid. Its content is essentially theoretical, based on work of\nPedro Nunes\n...\nOn\n4\nNovember\n1586\n, Lavanha was appointed chief engineer to Philip II making him chief engineer of the Kingdom of Portugal. He took on these duties in addition to his teaching duties at the Academy. However, only a few years after the founding of the Academy, Spanish naval superiority was broken in\n1588\nwhen Philip II sent an Armada to invade England but was defeated by a smaller English fleet. Lavanha was appointed cosmographer to the king in\n1591\n(\nalthough he did not assume the full duties of that position for a few years\n)\nand about the same time he moved from Madrid to Lisbon where he taught mathematics to sailors and navigators. At this time he was paid a salary of\n40\n,\n000\nreales as cosmographer to the king in addition to\n20\n,\n000\nreales as professor of mathematics in Lisbon.\nLavanha returned to Madrid in\n1599\nwhen he was appointed royal historian to Philip III who succeeded to the throne on the death of his father Philip II in\n1598\n. Lavanha was given a special task of writing the history of the Spanish royal family. He travelled to Flanders to gather information for this project and remained there during\n1600\n-\n01\n. There he was able to find information about the Austrian royal family as part of the history, piecing together the complicated way that the royals had married over the years. In fact Lavanha himself had married in the\n1590\ns. His wife was Leonarda de Mesquita and together they had six children.\nLavanha is best known for his contributions to navigation. His book\nRegimento nautico\n(1595)\nis\n[\n2\n]\n:-\n... a work printed by Lavanha shortly after being appointed chief cosmographer of Portugal. The text provides pilots with the knowledge needed to performing their tasks.\nIn the same year he published a further two books,\nTratado da gnómica\nand\nTratado do Astrolábio\non the use of the quadrant and the\nastrolabe\n. Lavanha gives rules for determining latitude and tables of\ndeclination\nof the Sun. Theoretical work on the construction of ships was one of his tasks as cosmographer to the king. This role he fulfilled in\n1598\nby writing down a set of rules to be followed in constructing ships which were designed to sail to India. Around two years later he published\nLivro Primeiro de Architectura Naval\nin which he argues that ship design must be based on modelling and he stressed the importance of the use of mathematics in the design process. He also worked on maps, producing some interesting new ideas. He began work on a map of Aragon in about\n1611\nby making a series of geodesic measurements\n[\n1\n]\n:-\nTo determine the coordinates of the fundamental points of the map Lavanha used a goniometer of his own design. This instrument was later perfected and proved very useful in surveying.\nIn fact he was one of the first to use this method of making a map and he completed his map of Aragon in\n1615\n. It was remarkable for its accuracy and it would be over\n150\nyears before a more accurate map of this region was produced. In addition to the map, he had produced a political description of the country in\nItenerário do reyno de Aragao\n(1611\n-\n12)\nwhich consists of the notes he made while travelling round the district making measurements for the map. Another work by Lavanha in this area is his\nCompendio de Geografia\n.\nLavanha also studied instruments used in navigation, constructing astrolabes, quadrants and compasses. He also devised a new navigational instrument. He worked on hydraulic projects, in particular working on the Esgueva and Pisuerga rivers in the vicinity of the city of Valladolid\n(\nthe capital of Spain until\n1561\n, which is situated at the confluence of these two rivers\n)\nin\n1604\n-\n06\n, working on a project related to the river Douro in\n1606\n(\nthe third longest river in the Iberian Peninsula\n)\n, and then working on a project to bring water to the city of Lisbon in\n1618\n. Lavanha taught mathematics to many leading people including Prince Emmanuel Filiberto of Sabóia\n(1528\n-\n1580)\n(\nwho was Duke of Savoy from\n1553\nto\n1580)\n, the famous novelist, poet and playwright Miguel de Cervantes\n(1547\n-\n1616)\n, the dramatist and poet Félix Arturo Lope de Vega\n(1562\n-\n1635)\n, and Philip IV\n(1605\n-\n1665)\nof Spain before he ascended to the throne of Spain in\n1621\n.\nAmong Lavanha's publications was a translation of\nEuclid\n(1584)\n, the tables of the sun\nTaboas do lugar do So\n(1600)\n, and a work containing all the mathematical facts a learned man needed to know,\nDescripción del Universo\n(1613)\n.\nIn\n1609\n, Lavanha joined the Order of Christ which, given his Jewish origins, caused some criticism. King Sebastian had been Grand Master of the Order and, at that time, members had been divided into two classes, namely lay members and military members. To make Lavanha's position secure, Philip III directly intervened to support him against the criticism. He was appointed as chief chronicler of Portugal on\n9\nMarch\n1618\non a salary of\n100\n,\n000\nreales. One might have thought that such a distinguished man who had held so many important positions for his country, would have ended his days well-off. However, when he died in Madrid in\n1624\nhe was heavily in debt.",
  "math_areas": [
    "Applied Mathematics"
  ]
}