{
  "nome_completo": "Joaquim Gomes de Souza",
  "nome_curto": "Joaquim Gomes de Souza",
  "ano_nascimento": "1829",
  "ano_morte": "1864",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Souza_Gomes/",
  "lugar_nascimento": "Itapecuru-Mirim, Maranhao, Brazil",
  "lugar_morte": "London, England",
  "biografia": "Joaquim Gomes de Souza\nwas the son of Inácio José Gomes de Souza and Antonia Carneiro de Brito e Sousa. He was the grandson of José Antônio Gomes de Souza. The Gomes de Souza were of Portuguese origin and by the end of the\n18\nth and beginning of the\n19\nth century they played an important role in the politics and the economy of the Brazilian State of Maranhao. José Antônio Gomes de Souza, Joaquim's grandfather, was a wealthy man involved in the export trade. He had a military career becoming a lieutenant colonel and was also an alderman of the Chamber of São Luís. He was the official responsible for gauging weights and measures, taxation and distribution of foodstuffs. Joaquim's father, Inácio José Gomes de Souza, was a major in the army, owned land, made investments and held a high social position which made him financially well off and able to give his children a high quality education. Joaquim was born in Itapecuru-Mirim into a large family, the seventh of nine children. Itapecuru-Mirim is in the northeast of Brazil about\n110\nkm south of San Luís. He was given the nickname of\nSouzinha\nwhen he was still a child and he was widely known by that name for the rest of his life. We shall refer to him as Souzinha in this biography.\nSouzinha began his schooling in San Luís, the capital and largest city in the state of Maranhao. In\n1841\n, when he was twelve years old, his father sent him to Olinda, a city on the northeast corner of Brazil which is on the Atlantic coast. It was an important city partly because of the Catholic Seminary there, which was built at the time of the Portuguese colonisation, and also for the Faculty of Law of Olinda which is now part of the Federal University of Pernambuco. Souzinha was sent there to join an elder brother who was studying in the city. The intention was that Souzinha would go on to study law at the Faculty of Law of Olinda but these plans all had to change when, after one year there, his brother died. His father thought he was too young to live in Olinda on his own so in\n1842\nhe returned to San Luís to continue his education.\nAs we have seen, the Gomes de Souza family had strong connections with the military so, in\n1843\n, when he was fourteen years old, Souzinha was sent to continue his studies at the Escola Militar of Rio de Janeiro. This College dates back to\n1792\n, and was modelled on the Military Academy in Lisbon. It became the Royal Military Academy in\n1811\n, then the Imperial Military Academy in\n1822\nwhen Brazil gained its independence. It became the Academia Militar da Corte in\n1832\nand, in\n1840\n, it was renamed the Escola Militar. At the Escola Militar, Souzinha excelled academically in the engineering course, showing outstanding abilities in mathematics. The military training, however, did not go well since he was a thin boy with a poor physique. After two years at the Escola Militar, he realised that he did not want a career in the army and left the Escola Militar. In\n1845\nhe took examinations in Latin and Philosophy and gained entry to the Faculty of Medicine in Rio de Janeiro. The Faculty of Medicine had been founded in\n1808\nand today is part of the Federal University of Rio de Janeiro.\nIn his first year at the Faculty of Medicine he enjoyed the courses he took on physics and chemistry. Keen to increase his knowledge of mathematics he began to study the subject from books, particularly differential and integral calculus, mechanics and astronomy. His passion for mathematics was such that after two years studying medicine he decided to give up his medical studies and concentrate on mathematics. Although he had never registered for a degree in Mathematical and Physical Sciences at the Escola Militar, the request he made in\n1847\nto be allowed to take the examinations for that course was granted. He took a series of examinations and was awarded a bachelor's degree in Mathematical and Physical Sciences on\n10\nJune\n1848\n. Souzinha believed that he had taken his studies of mathematics to the level of a doctorate since he had been undertaking research for several years so he now requested the Escola Militar to be allowed to undertake a public defence of a doctoral thesis. This was allowed and, on\n14\nOctober\n1848\n, he defended his\n55\n-page thesis\nDissertação Sobre o Modo de Indagar Novos Astros Sem o Auxílio das Observações Diretas\nⓉ\n(\nDissertation on how to Investigate new stars without the aid of direct observations\n)\n.\nSee the title page of the thesis at\nTHIS LINK\n.\nSouzinha's thesis had been motivated by the work of\nJohn Couch Adams\nand\nUrbain Le Verrier\nwho had used the way that Uranus deviated from its expected orbit to predict the position of a previously unknown planet to account for the deviations. Their predictions were made known in September\n1845\nand June\n1846\nrespectively and led to the discovery of Neptune on\n23\nSeptember\n1846\nby Galle at the Berlin Observatory. Souzinha had clearly been studying\nLaplace\n's\nMécanique Céleste\nⓉ\n(\nCelestial mechanics\n)\nand this forms the basis for the work of his thesis. Souzinha writes:-\nAfter a planet has been found that satisfies the perturbations of the known planet, is it not possible to find another that produces the same as it does? Is it not possible to find a system of planets that replaces the other? If this takes place when trying to solve the question exactly, isn't there a mistake when it comes to approximate formulas? To what degree of approximation should we bring our formulas so that the mistake disappears? These are the questions that mainly form the object of this dissertation. We will deal first with the movement of the centre of gravity of the stars, then with their figures and with their movement around the same centre.\nThe thesis is not a great work for the scientific results it contains but it is a remarkable work by someone who was essentially self-taught in mathematics. It is also important for it is the first mathematics doctorate to be awarded by Brazil and it marks the beginning of mathematical research in Brazil.\nAfter obtaining his doctorate, he was successful in a competition for a position on the teaching staff of the Escola Militar, being also appointed lieutenant colonel and honorary captain of the Escola Militar. Before taking up the position he returned to Maranhao where he studied languages, political economy and constitutional law. He took up his position on the teaching staff at the Escola Militar in\n1849\n. He continued to undertake research in mathematics and he published a paper\nResolution of numerical equations\nin number\n5\nof\nGuanabara\n, a monthly artistic, scientific and literary magazine. The paper presents a method which he claims is simpler than that of\nLagrange\nbut he admits that it may not give as accurate results. He ends the paper with this comment:-\nOur method does not give limits as close as those of\nLagrange\n. To remedy this, when one wants to approximate the roots, it will be convenient to use\nDaniel Bernoulli\n's method\n(\nthat of recurrent series\n)\nas a first approximation. The method we have presented, notwithstanding this minor inconvenience, is, I believe, the simplest imaginable. Considering the advantages of so expeditious a method, I shall perhaps treat this subject in more detail on another occasion for the benefit of practical engineers and the students of the Escola Militar.\nBetween\n1851\nand\n1854\nSouzinha published a series of three articles entitled\nFirst memoir on general methods of integration\n. He described existing methods, in particular those given by\nEuler\n,\nLaplace\n,\nLiouville\n,\nFourier\nand\nJacobi\n. It is clear that these three papers constitute around half of what Souzinha intended to publish in this series. In the third part, for instance, he states explicitly that the series would continue but it never did. The magazine\nGuanabara\nceased publication in\n1856\n.\nSouzinha believed that he had produced some important mathematical results but with no colleagues undertaking mathematical research in Brazil, he was very limited both in undertaking research and in making his results known. In\n1854\nhe requested the government of Brazil for permission to travel to Europe. His request was granted and he was asked to undertake two missions, first to study the penitentiary system of European countries with the aim of improving the system in use in the Rio de Janeiro prison, the Casa de Correção da Corte, and secondly to obtain information about European astronomical observatories. If the first of these missions seems a strange one to give Souzinha in fact it was not since he was the secretary of the Casa de Correção da Corte. He spent\n1855\nand\n1856\npartly in London and partly in Paris at the Sorbonne where he attended courses. He presented papers to the\nFrench Academy of Sciences\nand enrolled at the Faculty of Medicine in Paris, obtaining the degree of Doctor of Medicine in\n1856\n. He also submitted the paper\nOn the Determination of Unknown Functions Which Are Involved under Definite Integrals\nto the\nRoyal Society of London\nin\n1856\nand\nStokes\n, the secretary of the\nRoyal Society\n, published the report\n[\n32\n]\nwhile waiting for a referee to report on the paper.\nStokes\n' report begins:-\nThe author, after referring to a previous memoir on the same subject, presented by him to the\nFrench Academy\n, proposes to himself the problem of determining the function\nϕ\n(\nx\n)\n\\phi(x)\nϕ\n(\nx\n)\nwhich\n(\nf, F being given functions, and the limits α, β of the integration being also given\n)\nsatisfies the equation\n∫\nα\nβ\nf\n(\nx\n,\nθ\n)\nϕ\n(\nx\n+\nθ\n)\nd\nθ\n=\nF\nx\n\\int _{\\alpha}^{\\beta}f(x, \\theta) \\phi(x + \\theta) d\\theta = Fx\n∫\nα\nβ\n​\nf\n(\nx\n,\nθ\n)\nϕ\n(\nx\n+\nθ\n)\nd\nθ\n=\nF\nx\n.\nHe observes, that, unlike the methods employed in his former memoir, and the solutions there employed, which are quite rigorous, the methods of the present memoir depend upon developments into series, the strictness of which has been contested by some mathematicians; but that passing over these difficulties, he has solved the famous problem, the solution of which has been vainly sought after for the last two hundred years, because on the above-mentioned equation depends the integration of the generally linear equation of any order whatever of two variables, and consequently the whole Integral Calculus.\nA committee consisting of\nLiouville\n,\nLamé\nand\nBienaymé\nwas set up by the\nFrench Academy of Sciences\nto report on the memoirs Souzinha had submitted to the\nAcademy\nand later\nCauchy\nwas asked to join the committee. There is no record that the committee ever met.\nWe have not mentioned the fact that Souzinha had been working on making an anthology of poetry. While on his European trip he visited Germany in\n1856\nand discussed the publication of his anthology with the Brazilian poet Antônio Gonçalves Dias who was in Leipzig on a mission from the Brazilian government to study the state of public instruction in the educational institutions of Europe. Souzinha's\nAnthologie Universalle\nⓉ\n(\nUniversal anthology\n)\nconsists of\n944\npages and was published in Leipzig in\n1859\n. The anthology contains poems in seventeen languages, each poem in its original language, German, English, French, Italian, Portuguese, Spanish, Russian, Polish, Serbian, Bohemian, Hungarian, Dutch, Danish, Swedish, Modern Greek, Latin, and Ancient Greek. Why would anyone buy such a book consisting of poems most of which were in languages they could not understand? Even more puzzling, why would a publisher take on such a publication? Souzinha begins the Preface with the following justification:-\nWith the increasing development of civilisation and the extension that our knowledge has taken, such a bond of brotherhood has been established between nations, that there is no longer anyone who can be content with the literature of their own country, and that, crossing the physical limits of the place in which they were born, do not endeavour to gather, in other climates and under other skies, the flowers and fruits of the tree of science which the human spirit has sown, everywhere on earth, as traces of its divine origin. How many times has man truly fond of literary art felt, in moments of solitude, when their mind needs a diversion after very serious reflections, and a quiet occupation, the desire to have in hand a meeting of the most perfect literatures all nations possess, in order to let their thoughts wander and find feelings that correspond to the dispositions of their spirit?\nWhen Charles Henry wrote the Preface\n[\n16\n]\nto the posthumous publication of Souzinha's mathematical work\n[\n15\n]\nhe spends more time giving details of this anthology of poetry than he does of the mathematics. You can read the Preface at\nTHIS LINK\n.\nWhile he was in Germany, Souzinha received the news from one of his brothers that he had been nominated for the position of deputy general for the province of Maranhao. He thought it would be appropriate for a member of the Brazilian parliament to be married and be the head of a family, so he returned to England to propose marriage to Rosa Edith Hamber, the daughter of the Rev Thomas Hamber\n(1790\n-\n1875)\nand Elizabeth Marsh\n(1803\n-\n1871)\nwhom he had met on his visit to England one year before. Rosa had been born on\n18\nAugust\n1838\nin Islington, London, and baptised in Islington Holy Trinity Church on\n14\nApril\n1839\n. Souzinha wanted to return quickly to Brazil so the marriage on\n18\nMarch\n1857\ntook place in the Holy Trinity Church, Brompton, Middlesex, only eight days after he had asked the Rev Hamber for the hand of his daughter. Souzinha immediately returned to Brazil leaving his new wife in England.\nBack in Brazil, Souzinha was sworn in as Deputy on\n19\nMay\n1857\nand made his first speech on\n25\nJune\n1857\n. In fact he was elected as a representative of the province of Maranhao by the Liberal Party in three consecutive legislatures\n(1857\n-\n1860\n,\n1861\n-\n1864\n, and\n1864\n-\n1867)\n. Sadly, tragedy soon struck him and his family. In\n1858\nhe brought his wife from England to Brazil and they had a son. On\n18\nFebruary\n1861\n, his wife died of typhoid fever contracted on a trip he made to the countryside of Maranhao to introduce his wife to his family and to meet his electorate, as he was running for a second term of deputy. Two years later, in\n1863\n, his son died in São Luís, a victim of a sudden illness which, despite his medical training, he had not realised was serious. Souzinha's own health was also deteriorating and, suffering from the lung disease hemoptysis, he had returned to Maranhao for health reasons in\n1862\n. He wanted to continue his duties despite his health problems and returned to Rio de Janeiro taking up residence on the Santa Teresa hill. By March\n1864\n, when he married again, he was seriously ill. His second wife was Paulina Guerra, his neighbour on Santa Teresa. Hoping for good medical treatment in England, he made the trip in March\n1864\n, but he died two months later.\nSome of Souzinha's memoirs have been lost but eight were published in Leipzig in\n1882\n(\n[\n15\n]\nis a modern reprinting of the\n1882\nedition\n)\n. The eight memoirs are:\n(1)\nDissertation on general methods of integration.\n(2)\nAddition to the Memoir on general methods of integration.\n(3)\nOn the determination of the constants, which, in the problems of mathematical physics, enter into the integrals of the partial differential equations, according to the initial state of the system.\n(4)\nProof of some general theorems for the comparison of new transcendental functions.\n(5)\nDissertation on a theorem of integral calculus and its applications to the solution of problems in mathematical physics.\n(6)\nMemoir on the determination of the unknown functions which enter under the sign of definite integration.\n(7)\nOn the analogy between linear differential equations and ordinary algebraic equations.\n(8)\nMemoir on sound.\nIn addition to their mathematical content, these memoirs contain information about Souzinha's efforts to get his work published. For example Souzinha writes in\n(6)\n:-\nFrom the questions written above, as well as from more general ones, I have given a large number of solutions, based either on convergent series, or on entirely series-independent methods, always deducing as particular cases of my formulas the solutions by\nLiouville\n. This memoir\n(\nperhaps the least important of the ones I have written\n)\nwas presented to the Institute in France, which has not yet wished to give an opinion, with\nLiouville\nas the rapporteur; what I believe I have the right to attribute to 'petite jalousie', having the celebrated\nLamé\n, one of the commissioners whom I urged that the commission give his opinion, wrote a letter to me in which he said:\nI have read your memoir: it proves that you are a good analyst; I greet you as such and think that my colleagues will not be of a different opinion.\nIn his\nMemoir on sound\n, Souzinha states how he believes he has improved on the work of others:-\nNo one until today has tried to determine the movement or vibration of the air, considering things as they are in Nature: everyone has abstracted from gravity except\nPoisson\n, who considers it in case where air moves in a straight tube. He then tried to apply his solution to the case where air has three dimensions, but as I demonstrate, his reasoning is entirely erroneous. His reasoning is this one - the speed of sound is proportional to the square root of the quotient of the elasticity and density of air, in the case where forces are not considered; now, in the case of the latter, he says, this relationship does not change; so the speed of sound is constant. But whence did he deduce the above law of the propagation of sound? From a certain differential equation, the form of which changes profoundly from the other, to which he intends, applicable to the conclusions drawn from the first, which is a monstrous absurdity, which, if only by an absurdity, he could have escaped. So, for the first time, I am dealing with the problem with all rigour. Geometricians who have dealt with the theory of sound, in order to simplify the formulas, assume that all vibrations of air molecules are very small. I assume any: the equations are no longer linear, but I completely resolve the issue. They also assume that the air temperature is always uniform.\nPoisson\nwas the only one who considered motion in the case of variable temperature, as it exists in nature, but he deals only with motion in a straight tube. I, however, consider the case of curvilinear tubes and any laws of heat variation.\nLet us quote from Souzinha himself, the reasons he gives for attacking the mathematical problems that interested him\n(\nsee for example\n[\n16\n]\n)\n:-\nLoving above all else the sciences which have as their object the study of nature, I have determined study mathematics in order to know them better. But when one begins this study, one constantly stops before the insurmountable difficulties offered by the integral calculus. If there is however something really attractive, it is the study of this branch of Analysis. Do you want to know the theory of the distribution of heat on the surface of conducting bodies? You stop before the obstacles presented to you by the integral calculus. Do you want to know the movement of heat in the interior of solid bodies of any figure whatsoever? Here again it is the integral calculus which obliges you to stop almost at the beginning of your study. Do you want to know the propagation of motion inside bodies? the vibrational state of their molecules? tidal theory? the figure of the planets which deviate significantly from a spherical shape? the law of variation of their densities, etc. etc.? You find integral calculus before you immense, impassive, insurmountable, resisting the combined efforts of all the distinguished geometers of Europe, not a single one of whom has been able to prevent himself from struggling, at least for some time, hand to hand with it. When you see all these theories depending on this calculation and this calculation itself reduced to a single problem, there is something that pushes you, which pulls you along almost in spite of yourself.\nSouzinha was hailed as a genius by most Brazilians following his death. Only the book\n[\n9\n]\nwritten in\n1878\nby Frederico José Correia\n(1817\n-\n1881)\nis highly critical,  calling Souzinha a charlatan and saying that his only talent was in deceiving public opinion by overestimating himself. For a modern look at Souzinha's mathematics see\n[\n12\n]\nwhere the authors write:-\nHe was audacious and fought with insistence for his scientific recognition in Europe. His effort was fruitless, though. This paper is concerned with the relations between Gomes de Souza's mathematical works and the controversy about the legitimate use of divergent series in the nineteenth century. It brings a brief introduction of Gomes de Souza. Then, it succinctly describes the characteristics of the polemic about the use of divergent series. Finally, it reveals the critical considerations of these authors concerning Gomes de Souza's Works.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}