{
  "nome_completo": "Jock Hoe",
  "nome_curto": "Jock Hoe",
  "ano_nascimento": "1929",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hoe/",
  "lugar_nascimento": "Te Kuiti, New Zealand",
  "lugar_morte": "Christchurch, New Zealand",
  "biografia": "Jock Hoe\nis sometimes known as\nJohn Hoe\n. He was born in Te Kuiti, a small town of about\n3\n,\n000\ninhabitants situated in the valley of the Mangaokewa Stream in the North Island of New Zealand, about\n40\nmiles south of Hamilton. His Cantonese parents had immigrated to Te Kuiti where his father, J Hoe, had a fruit and vegetable shop. The\nKing Country Chronicle\nof Saturday\n14\nDecember\n1929\ncontains an advertisement for the Hoe Bros. Fruiterers, Rora Street, Te Kuiti. It advertises: Chinese Sunshades, Finest Chinese Silks, China Tea, Toys for the Children, High-class confectionary, Best Fruit and Vegetables in Season, Tobaccos, Cigarettes etc. We are unsure when Jock's parents arrived in Te Kuiti but the shop was operating by\n1922\n.\nJock Hoe was the seventh of his parents' nine children. The family moved from Te Kuiti to Newtown, Wellington and then to Wanganui\n(\nsince\n2009\nmore often known as Whanganui\n)\n. We are unsure when they arrived in Wanganui but they were certainly there by\n1936\n. Jock began his primary schooling in Newtown and, after the family moved to Wanganui, continued studying at primary school there. As in Te Kuiti, Jock's father had a fruit and vegetable shop in Wanganui.\nThe family were all very talented and we give extracts from local papers about some of Jock's siblings. When Jock was ten years old we see the following reports from January\n1940\n[\n3\n]\n:-\nBrilliant Record Of Chinese Family. Three members of the family of a Chinese fruiterer Mr J Hoe passed this year's matriculation examination entitling them to entrance to the University. One child, Jack Hoe, attended Wanganui College. His sisters attended Wanganui Girls' College and a younger member of the family was dux of Queen's Park School, Wanganui.\nWe note that Queen's Park School, Wanganui, was a girls' school founded in\n1879\n. The same achievements are recorded in\n[\n7\n]\n:-\nJack Hoe, Verbena R Hoe and Patricia Hoe, whose matriculation passes were announced on Saturday are all members of the same Chinese family of Wanganui. The boy will go to the Wanganui Collegiate School, and the girls go to Wanganui Girls' College. Another member of the same family Gan Hoe. is starting off well for she is dux of the Queen's Primary School.\nA year later, in March\n1941\n, there is the following\n[\n8\n]\n:-\nJack William Hoe, a\n17\nyear old Chinese pupil of Wanganui Collegiate School who has won a university bursary this year, is one of three members of the same family who gained matriculation last year. The other two were his sisters Ruby and Patricia. Their parents are Mr and Mrs J Hoe, Swiss Avenue. Jack Hoe was\n147\nth in the list of\n209\nbursary awards.\nJack William Hoe attended Wanganui Collegiate School from\n1936\nto\n1941\n, then went on to study medicine being awarded an M.B., Ch.B. He was placed on the Medical Register of the Dominion of New Zealand in\n1948\n. Verbena R Hoe also studied medicine. Jack William Hoe was about six years older than his brother Jock Hoe and had left Wanganui Collegiate School the year before Jock began his studies there\n[\n13\n]\n:-\nJock went to primary and intermediate school in Wanganui, and won a feepaying scholarship to Wanganui Collegiate. During his childhood he helped in the shop\n(\nwashing dirt off potatoes, displaying fruit outside the door, sweeping the footpath, etc.\n)\n. His father had bought a piano for ten pounds and Jock taught himself to play it, later having piano lessons because he showed such interest and promise.\nIt was in\n1942\nthat Jock entered Wanganui Collegiate School and he studied there until\n1946\n. At this time Frank William Gilligan\n(1893\n-\n1960)\nwas the headmaster of the school. An English scholar, he was famed as a cricketer playing in the Essex County side for ten years. He was headmaster of Wanganui Collegiate School for eighteen years\n(1936\n-\n1954)\nand the school wrote:-\n[\nGilligan\n]\nbelieved in good sportsmanship, modesty, tolerance, and seeing the other man's point of view, and he was himself an exemplar of these qualities. He would go to endless trouble to help anybody. To watch him taking a game was a liberal education in the art of coaching. A devotee of using one's feet to play slow bowling and of forward play.\nIn January\n1947\nJock Hoe was awarded a National Scholarship, being only one of\n20\nstudents to receive such an award, which paid both his university fees and provided a living allowance. He had pleaded with Gilligan to allow him not to sit English as a scholarship subject\n(\nwhich he achieved despite Gilligan being an English scholar\n)\n, and took as his scholarship subjects French, Latin, Mathematics, Applied Mathematics and Physics.\nJock Hoe entered the University of Otago in\n1947\nto study mathematics. His success came, however, despite difficulties\n[\n1\n]\n:-\nHe was encouraged by scholarships\n(\nto Wanganui Collegiate School and to Otago University\n)\nbut disempowered by racism, in forms both systemic and personal.\nHe graduated in\n1950\nwith a B.A. degree, the\nOtago Daily Times\nof\n9\nMay\n1950\nreporting that he had been awarded the degree of Bachelor of Science\n(\nin absentia\n)\n. He then decided to continue to study for a Master's degree and to do this he entered the Victoria University of Wellington. At Victoria University he was supported and encouraged by Professor James Towers Campbell\n(1906\n-\n1994)\n, the Head of Mathematics. Paul Scott writes about Campbell in\n[\n22\n]\n:-\nI managed to switch to a third year of Pure and Applied Mathematics\n[\nat Victoria University of Wellington\n]\n. I have a fond memory of Professor Jim Campbell dressed in his black/grey/green academic gown in full flight across the front of the lecture hall, surrounded by a cloud of chalk dust, talking quickly, writing rapidly and illegibly with his right hand, and erasing his notes with his left hand. He was an inspiration, and a real character.\nCampbell had studied at the University of Otago under\nRobert J T Bell\nand, taking\nBell\n's advice, he had gone to Scotland to study for a Ph.D. under\nAlex Aitken\n. Campbell had become the first President of the New Zealand Statistical Association when it was founded in\n1948\nand he encouraged Jock Hoe to concentrate on statistics for his Master's Degree. While he was at Wellington, Hoe obtained an Associateship diploma from Trinity College London for piano performance.\nAfter the award of his Master's Degree, Hoe decided to obtain a teaching qualification. He went to the Auckland Teachers College based in Epsom, near Auckland, which was part of the University of Auckland. After qualifying, his first teaching position was at Wanganui Collegiate School where he had himself been taught. He was appointed by Frank William Gilligan who was still headmaster at the school. After a short while Hoe decided that he would like to study mathematics in England at the University of Cambridge so he sent in an application. Rather strangely the reply did not come back to Hoe but rather to Frank Gilligan. In Hoe's own words\n[\n13\n]\n:-\nI didn't get a reply but Mr Gilligan got a reply to say: \"We have had an application from Mr Jock Hoe for entry to Cambridge to do mathematics. Why does he want to do mathematics and why does he want to come to Cambridge? Yours sincerely, Senior Tutor, Corpus Christi College.\" Mr Gilligan called me in and told me he'd had this letter, showed the letter and said - This is my reply: \"Dear Senior Tutor, I do not understand why Mr Hoe wants to come to Cambridge, but I did understand that Cambridge was able to give an education of some kind, Yours sincerely F W Gilligan, MA\n(\nOxford\n)\n.\" I got a reply by return post offering me a place at Corpus Christi College.\nHoe matriculated at Corpus Christi College Cambridge in\n1953\nand read the mathematical tripos, specialising in mathematical statistics. He also obtained a Diploma in Mathematical Statistics. He did not return to teaching at the Wanganui Collegiate School but went to France where he was appointed to a position teaching statistics to engineers in French. He then was appointed to a lectureship in statistics at the University of Malaya in Kuala Lumpur. While there\n[\n13\n]\n:-\n... he added Malay to his portfolio of languages\n(\nEnglish, French, Latin, German, Cantonese, Mandarin, plus some Russian and Greek\n)\n.\nWhile at the University of Malaya, Hoe collaborated in writing the\n465\n-page book\nTraffic flows through Port Swettenham projected to\n1975\nwhich was published in\n1964\n. By the time the book was published Hoe had left the University of Malaya and returned to New Zealand where he was appointed as a lecturer in mathematics at the Victoria University of Wellington. He was appointed by James Towers Campbell who was still head of mathematics there. Shirley Pledger writes in\n[\n13\n]\n:-\nJock was appointed to teach the newly-offered courses in Statistics, but it is a measure of his breadth of scholarship that in\n1963\nwhen he was also required to teach rigid body dynamics in third-year applied mathematics, he did it so well that his students\n(\nwell, this writer at least\n)\nthought he must be a specialist applied mathematician.\nBetween\n1968\nand\n1972\nHoe went to France during most of the New Zealand summer vacations to spend time undertaking research for a Ph.D. in Paris, where, of course, it was mid-winter\n[\n12\n]\n:-\nWhile teaching in Wellington he spent study leaves and many southern summers in Paris winters, studying under the supervision of Jacques Gernet, founder and director of the Unit for Teaching and Research on Languages and Civilisations of East Asia\n(\nUniversité de Paris VII\n)\nand, later, Professor at the Collège de France.\nHoe's thesis was\nL'algèbre chinois à la fin du XIIIe siècle à travers l'étude des systèmes d'équations polynômes traités par Zhu Shijié dans son livre 'Le miroir de jade des quatre inconnues: Siyuán Yùjiàn' de\n1303\nⓉ\n(\nChinese algebra at the end of the\n13\nth century through the study of systems of polynomial equations treated by Zhu Shijié in his book 'The jade mirror of the four unknowns: Siyuán Yùjiàn' of\n1303\n)\n. This consisted of a translation into French of the methods given in the\n1303\nChinese book\n(\nrediscovered in\n1802)\nand a commentary on them; this occupies\n338\npages. There were then three appendices, the first translating the\n284\nproblems in the Chinese text into modern symbolic terminology, the second appendix providing a translation into semi-symbolic terminology and the third appendix giving the original Chinese text. The three appendices occupied in total\n526\npages. Hoe successfully defended his thesis at the University of Paris VII in\n1976\n. Let us give some extracts from Ulrich Libbrecht's review\n[\n18\n]\nwhere he describes Hoe's work as:-\n... the first valuable investigations of the mathematical work of\nZhu Shijie\nin European languages ... John Hoe, who teaches in the Mathematics Department of the Victoria University of Wellington, New Zealand, has written a profound study of the 'Ssu-yuan yü-chien'. He defended it as a doctoral dissertation at the University of Paris VII.\nIn the first chapter, the author elucidates the bases of Chinese algebra: the numeral notation, the operations on the counting-board, the 't'ien-yuan' method and the Pythagorean theorem. None of this is peculiar to\nZhu Shijie\n, but it is necessary to explain this system to those who are not acquainted with the character of Chinese mathematics.\nChapter\n2\nis the most important part of the work. Indeed, the non-sinologist historian of mathematics, who until now had at his disposal only the explanation of Van Hée, could hardly understand\nZhu\n's algorithm. In this chapter, the author explains the four introductory problems in which\nZhu\nelucidates the method for solving non-linear simultaneous equations with one, two, three or four unknowns. The explanation is at first sight long-winded, but the detail is indispensable to full comprehension. The special notation used in\nZhu Shijie\n's work is evidence of his great mathematical skill but it is also largely responsible for the stagnation of Chinese mathematics. It limited its own possibilities, and could never develop into a general mathematical notation.\nChapter\n3\nis devoted to the mathematical content of the work: numerical equations of higher degree, areas and volumes, series and interpolation, simultaneous linear equations, and a kind of proto-trigonometry - the usual topics of Sung and Yuan mathematical handbooks.\nFrom the mathematical point of view, this is an extremely good study of\nZhu Shijie\n's work. The explanation of the Chinese text is Cartesian in its clarity and the material is made accessible to non-sinologists.\nFrançois Hominal is also impressed with Hoe's impressive contributions\n[\n14\n]\n:-\nThe author excels at describing the procedures employed by Chinese algebraists; he shows the impressive results they have achieved with their application, but he also highlights the handicap they presented at some stage of development. He has succeeded in rendering the Chinese text in an original way ...\nWe mentioned above the semi-symbolic language Hoe invented and used in Appendix\n2\nof his thesis. This is explained in\n[\n12\n]\n:-\nJock's translation process reveals how Chinese mathematical thought proceeded. He observed that the Chinese language used certain words much like algebraic variables and operators, and how that technical use of everyday language allowed mathematics to meld seamlessly into the surrounding prose. He devised a semi-symbolic English to convey this\n(\ne.g. \"HYP MULT BASE\" for \"multiply the length of the hypotenuse by the length of the base\"\n)\n, contrasting both historiography and mathematics against the translations and studies of Mesopotamian and Greek mathematics then available. Jock hence demonstrated that Chinese script inherently provided a symbolic handling for algebraic quantities and actions, and that this ability of the Chinese language helps to explain why a separate symbolic algebra did not develop in China: it was not needed.\nFor more information about Hoe's thesis, see\nTHIS LINK\n.\nJacques Gernet, Hoe's advisor, strongly recommended that the thesis should be published but this is where the difficulties arose. Clearly there are difficulties with the size of the text, over\n840\npages, and also with the printing of the Chinese characters. The first part\n(\nwithout the appendices\n)\nwas published with the title\nLes systèmes d'équations polynômes dans le Siyuan Yujian\n(1303)\nby the Collège de France in\n1977\nin their series Mémoires de l'Institut des Hautes Études Chinoise. They could not afford to publish the appendices, however, and when Hoe tried to find another publisher for the appendices, they all said that they made no sense without the commentary of the first part.\nAlthough Hoe continued to teach in the Mathematics Department of the Victoria University of Wellington, his interests turned more towards Chinese language and culture. James Campbell retired as Head of Mathematics and the statistician David Vere-Jones had become professor of mathematics in\n1970\n.  David Vere-Jones\n[\n13\n]\n:-\n... was very helpful to Jock, getting him an unasked-for promotion to Reader\n(\nwhich Jock found out about on his return from Paris\n)\n, and providing him with a sanctuary in the mathematics department while knowing that Jock's main interests by now were in languages and cultures; teaching English speakers about Chinese thought and culture and teaching Chinese speakers about English and Western culture. In the late\n1970\ns Jock reduced his mathematics lecturing load to two-thirds, freeing up time to teach Mandarin in the Chinese Department at Victoria University. During that time he was a leading member of the New Zealand China Society, promoting a better understanding of China. In\n1978\nhe led a trip of New Zealand observers\n(\nincluding Mary Vere-Jones\n)\nto China.\nAs an example of Hoe's increased interest in Chinese culture, we note that he published, jointly with James Bertram, the paper\nThe poetry of Mao Tse Tung\nin the\nJournal of the Australasian Universities Language and Literature\nin\n1977\n. The above quote refers to a\n1978\ntrip of New Zealanders to China. David Vere-Jones writes in\n[\n25\n]\nthat it was led by:-\n... Jock Hoe, our much beloved and respected Chinese statistician scholar. The trip played an important part in Jock's subsequent career, I suspect, for he ended up in a Chinese hospital, experiencing an effective combination of western and Chinese treatments which may well have disposed him subsequently to join the English Language Institute in Shanghai - not a common career move but he is now widely respected in both hemispheres as an expert on early Chinese mathematical texts.\nIt was, in fact, in\n1982\nthat Hoe resigned his position at the Victoria University of Wellington and moved to Shanghai. Of course, his position as a supporter of China, living in New Zealand had caused some problems as the following shows\n[\n23\n]\n:-\nThe New Zealand China Friendship Society was formed at a meeting in Auckland on\n27\nFebruary\n1952\n. ... The Society was being actively promoted from China. ... There were few Chinese formerly involved in the Society because it was difficult, in particular for those whose own immigration status was unclear, to be seen to be supportive of Communist China. The fear of intervention from a few Chinese-New Zealanders who had citizenship such as Jim Wong, Nancy Goddard\n(\nnée Kwok\n)\nand later Jock Hoe rose to prominence but for many their involvement was either veiled in secrecy or through a companion front organisation. ... Although ... Graeme Clarke said that in\n1980\nJock Hoe had made pro-cultural revolution comments, Hoe had long drifted away from the Society by this stage and had lived outside of New Zealand for much of the intervening period. ... Jock Hoe, who taught history in Shanghai, had been involved with the Society for many years ... When Graeme Clarke visited Hoe\n[\nin Shanghai\n]\nin\n1980\n, Hoe was still defending the Cultural Revolution.\nHoe taught history and English at the English Language Institute in Shanghai for a few years, then returned to New Zealand to take up an appointment teaching Chinese at Christchurch Polytechnic and at Massey University. He gave the invited lecture\nMathematics education in China\nto the\n1989\nNew Zealand Mathematics Colloquium held at Massey University, Palmerston North,\n15\n-\n17\nMay\n1989\n. The Abstract of his talk is as follows\n[\n10\n]\n:-\nMathematics in ancient China was needed for practical purposes such as the calculation of the calendar, the surveying of fields, the building and construction of city walls, the planning of corvée duty, the gathering of taxes and so on. Government officials needed to be trained in the elements of mathematics and, at certain periods, mathematics was included as a formal part of the curriculum for the state civil service examinations. A small number of text-books for teaching mathematics is extant, the earliest dating from the Han dynasty\n(206\nBC -\n220\nAD\n)\n.\nAfter he retired from teaching, Hoe welcomed groups of students to his home to discuss the history of Chinese science. He also worked on an English version of his thesis which he completed but again had difficulty finding a publisher. Eventually be published his English version as\nThe jade mirror of the four unknowns by Zhu",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}