{
  "nome_completo": "Johann Benedict Listing",
  "nome_curto": "Johann Benedict Listing",
  "ano_nascimento": "1808",
  "ano_morte": "1882",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Listing/",
  "lugar_nascimento": "Frankfurt am Main, Germany",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Johann Benedict Listing\n's family were of Czech descent. His father, also named Johann Benedict Listing, was a maker of brushes while his mother, Caroline Friederike Listing, came from a poor peasant background. Listing was an only child and brought up in a family which struggled with financial difficulty.\nHe was a bright boy and his talents were such that he received help with his education from several benefactors including the Städel foundation, supporters of art and museums. He received a good foundation for his education at the Musterschule which he attended from the age of eight. In this school he first became interested in science and mathematics, mainly because of his talented teacher Müller, but he had a real talent for art. Listing pleased his parents by helping out with the family's finances by earning a little money from drawing and calligraphy from the age of thirteen.\nIn\n1825\nListing entered a\nGymnasium\nwhere he studied for five years. He mastered English, French, Italian and Latin and well as increasing his knowledge of mathematics and science at this school. He had already decided to pursue an academic career and his talents were recognised by the award of a generous scholarship by the Städel foundation. Being an art foundation they could not support Listing to undertake a degree in mathematics, which would have been his preferred option, but instead awarded him the scholarship for the study of mathematics and architecture. Although there was a time when architecture was considered as a branch of mathematics, it certainly was not considered such in Listing's day so the combination was a rather peculiar one dictated by a compromise between Listing's wishes and the remit of the Städel foundation.\nListing entered Göttingen University in\n1830\nand attended a remarkably broad range of courses, much broader than the mathematics and architecture specified by his scholarship. In addition to these two topics he also took courses on astronomy, anatomy, physiology, botany, mineralogy, geology and chemistry. Soon Listing was attending mathematics courses given by\nGauss\nand he was quickly spotted by\nGauss\nas being both a very able and a very hard working student.\nGauss\ninvited him to join his circle of friends who included\nWeber\n.\nListing was not the only student invited into close friendship with\nGauss\n. Another student was Sartorius von Walterhausen who was one year younger than Listing. Walterhausen, who was interested in geology, became a lifelong friend of Listing. The influence of\nGauss\non Listing was, however, very marked. It was from\nGauss\nthat Listing began to learn\ntopological\nconcepts. He also was a talented experimenter and collaborated with\nGauss\nin physics experiments, particularly those relating to terrestrial magnetism.\nGauss\nbecame the supervisor of Listing's dissertation\nDe superficiebus secundi ordinis\nⓉ\n(\nSurfaces of the second order\n)\nwhich was on surfaces of the second degree and ternary forms. He received his doctorate in June\n1834\n.\nWalterhausen was setting out on a trip to Sicily to study volcanoes. He had also agreed to collect data on terrestrial magnetism for\nGauss\non this trip. Listing was an obvious choice for an assistant to accompany him and the pair set off less than a month after Listing had obtained his doctorate. It was a journey on which Listing maintained his interests in many different topics and as well as the geology and physics which were the purpose of the trip. He worked in his spare time on mathematics, in particular working on the topological ideas which had first been suggested by\nGauss\n. He decided to summarise his thoughts on the topic and did so in a long letter to his old school teacher Müller. It is in this letter that the word \"topology\" appears for the first time. He disliked the term \"geometria situs\", then used for topological ideas, and\n[\n4\n]\n:-\nThe entire doctrine being rather new, he felt justified to give it a new name and therefore called it \"topology\", which he though more appropriate.\nWhile on his travels Listing was approached by the Höhere Gewerbeschule Hannover asking if he would be interested in a post as a teacher of applied mathematics. Without saying yes or no he politely thanked them for the offer. Because of a cholera epidemic Sartorius and Listing delayed their return to Göttingen. In fact they took a ship to England where they spent a short while before returning to Germany. Listing went to Hannover to be interviewed for the post in the Gewerbeschule and was appointed, starting his teaching career in November\n1837\n.\nWhen Victoria became Queen of Britain in\n1837\nher uncle became ruler of Hanover and revoked the liberal constitution.\nWeber\n, the professor of physics at Göttingen and a close collaborator of\nGauss\n, was one of seven professors at the university to sign a protest and all seven were dismissed.\nWeber\nremained at Göttingen without a position until\n1843\n. However his professorship of physics had to be filled and after a while\nGauss\nwas asked to suggest possible candidates. He produced a list of three names with Listing in third place. When the first two turned down the offer, Listing was appointed in\n1839\ndespite never having published a paper.\nAs professor of physics Listing could choose his area for research. A versatile scientist, he chose yet another area to the ones which he had already worked in, and began to study the optics of the human eye. He published\nBeiträge zur physiologischen Optik\nⓉ\n(\nContributions to physiological optics\n)\nin\n1845\nwhich became a classic. As well as containing data from careful experimental work, the book was beautifully illustrated by Listing using all his skills in drawing and calligraphy.\nIn September\n1846\nListing married Pauline Elvers. Almost immediately the couple were in financial problems as Pauline seemed unable to keep her spending within the family's income.\nListing continued to think about topological ideas, however, and he wrote the book\nVorstudien zur Topologie\nin\n1847\n. It was the first published use of the word topology although, as we mentioned above, it was first used in Listing's letter of\n1836\n. The subject was known as\nanalysis situs\nfor many years and only in the late\n1920\ns was the English word\ntopology\nused by\nLefschetz\n. In this book, really an extended essay meant only, as the title states, as a preliminary work, Listing writes:-\nBy topology we mean the doctrine of the modal features of objects, or of the laws of connection, of relative position and of succession of points, lines, surfaces, bodies and their parts, or aggregates in space, always without regard to matters of measure or quantity.\nIn\n1848\nthe revolution which swept Europe had its consequences. The most marked effect was that\nWeber\nwas reappointed to the chair at Göttingen which he had lost ten years before. Of course Listing had been appointed to fill\nWeber\n's chair so a compromise had to be reached. This was that Listing was promoted to ordinary professor of mathematical physics while\nWeber\nbecame professor of experimental physics. Although little changed in the research that Listing undertook, since he had always gone in the direction which interested him, he did have to give up a large part of his laboratory to\nWeber\n.\nHowever, Listing's family life did not go well. The couple had two daughters - one in\n1848\nand the second in the following year. However Pauline Listing's\n[\n4\n]\n:-\n... treatment of servants brought her before the magistrates any number of times, while her relations with landlords led to many moves for the family.\nNeither Listing nor his wife seemed capable of managing the family finances\n[\n4\n]\n:-\nListing borrowed frequently and heavily, sometimes from usurers; Pauline habitually abused credit, and again ended up in court with some regularity. They tended to live beyond their means, and on one occasion barely avoided bankruptcy.\nThe near bankruptcy came around the time that Listing was publishing another remarkable contribution to topology. In\n1858\nhe had discovered the properties of the\nMöbius band\nat almost the same time, and independently of,\nMöbius\n. In\n1862\nhe published\nDer Census raumlicher Complexe oder Verallgemeinerung des Euler'schen Satzes von den Polyedern\nⓉ\n(\nSurvey of spatial Complexes or generalization of Euler's theorem on polyhedra\n)\nwhich discusses extensions of\nEuler\n's formula for the\nEuler\ncharacteristic of oriented three-dimensional polyhedra to the case of certain four-dimensional simplicial complexes. This second work on topology by Listing is discussed by detail in\n[\n8\n]\nwhere Tripodi compares it with some work by\nCayley\n.\nIn fact bankruptcy was avoided due to the ministry in Hannover saving him. It was Sartorius who had arranged for the rescue act by the ministry and here he was repaying a debt to Listing who had saved his life by nursing him through a serious illness during their journey of nearly thirty years earlier. However, Listing did not find favour with his colleagues because of the behaviour of himself and his wife and it is certain that he received less recognition for his scientific achievements because of it. Yet he was\n[\n4\n]\n:-\n... industrious and inquisitive, kind and helpful, gregarious and witty, good-natured to a degree, a true friend to many, and an enemy to none.\nThe range of contributions made by Listing is quite remarkable. Breitenberger in\n[\n4\n]\nwrites:-\n... he studied the figure of the earth in minute detail; he made observations in meteorology, terrestrial magnetism, and spectroscopy; he wrote on the quantitative determination of sugar in the urine of diabetics; he promoted the nascent optical industry in Germany and better street lighting in Göttingen; he travelled to the world exhibitions in London\n1851\n, Vienna\n1873\nand London\n1876\nas an observer for his government; he assisted in geodetic surveys; ... he invented a good many terms\n[\nother than topology\n]\n, some of which have became current: \"entropic phenomenona\", \"nodal points\", \"homocentric light\", \"telescopic system\", \" geoid\" ...he coined \"one micron\" for the millionth of a metre ...\nAmong the honours which Listing did receive were election to the\nGöttingen Academy\nand the\nRoyal Society of Edinburgh\n. He was awarded an honorary doctorate by Tübingen.\nHe died of a stroke.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Topology"
  ]
}