{
  "nome_completo": "Johannes Robert Rydberg",
  "nome_curto": "Johannes Robert Rydberg",
  "ano_nascimento": "1854",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rydberg/",
  "lugar_nascimento": "Halmstad, Sweden",
  "lugar_morte": "Lund, Sweden",
  "biografia": "Johannes Robert Rydberg\nwas known as J\nanne Rydberg\n. His father, Sven R Rydberg, was a merchant who also owned several boats, while his mother was Maria Beata Andersson. However, Sven Rydberg died when his son Janne was only four years old and the family was left in an extremely difficult financial position. Janne attended school in Halmstad which is in southwestern Sweden, on the eastern shore of the Kattegat, at the mouth of Nissan River. At the\nGymnasium\n, he studied a full range of subjects, geography, history, languages, mathematics, natural history, philosophy, physics, and religion. He completed his secondary school education at the Gymnasium in Halmstad in\n1873\nand, in the autumn of the same year, he entered the University of Lund. The University of Lund, in the town of Lund in southern Sweden northeast of Malmo, is the second oldest university in Sweden being founded in\n1666\n. Now Rydberg had performed very well in all his school subjects but his favourite one had been mathematics so this was the major topic of his undergraduate studies.\nRydberg received his bachelor's degree in\n1875\nfrom the University of Lund. He continued his study of mathematics and wrote a main dissertation on\nconic sections\nfor his doctorate in mathematics with a second thesis on algebraic integrals of algebraic functions. He was awarded his doctorate in\n1879\n. While he was studying mathematics, Rydberg also taught physics at the Lund Physics Institute where he had been appointed as an assistant in\n1876\n. After the award of his doctorate, in\n1880\nhe was appointed to the post of assistant lecturer, or\ndocent\n, in mathematics at Lund University but his research interests were now turning towards mathematical physics rather than to pure mathematics. During his two years as a lecturer in mathematics he worked on problems relating to electricity. The physics research he undertook at this time was experimental rather than theoretical.\nIn\n1882\nRydberg moved from an assistant lectureship in mathematics to become an assistant lecturer in physics at the University of Lund. In the same year the University of Lund's request for a new physics building to house the Institute of Physics was approved. This new Institute would eventually become Rydberg's place of work for the rest of his career. In\n1886\nhe married Lydia Eleonora Mathilda Carlsson, the daughter of a medical official to the provincial county council; they had two daughters and a son Helge who became a biologist. In\n1897\nhe took over the duties of the professor of physics but this was only on a temporary basis and he remained an assistant lecturer. With an extremely poor salary, Rydberg was forced to take a position as an accountant in a local saving bank so that he could supplement his income sufficiently to allow him to support his family. In\n1897\nRydberg applied for the chair of physics at the University of Lund which became vacant when Karl Albert Viktor Holmgren\n(1824\n-\n1905)\nretired. Six people applied for the chair but the process went on several years and the appointing procedure became almost farcical.\nWe look at the details of this, and in particular at the referee's assessment of Rydberg, in a separate article. See\nTHIS LINK\nThe outcome was that\nAlbert Victor Bäcklund\n, who was an applicant that the referees had considered as not worth ranking for the position, was appointed. After his appointment,\nBäcklund\ntried to get Rydberg promoted to professor. It is unclear whether\nBäcklund\nwas trying to right the wrong of the chair appointment or whether he wanted an additional chair appointment so that he had a lighter teaching load. In March\n1901\nRydberg was named as an extraordinary professor but it only became a full professorial appointment in January\n1909\n. From this time until his retirement he held the chair of physics at Lund.\nRydberg's most important work is on spectroscopy where he found a relatively simple expression relating the various lines in the spectra of the elements. We quote from the obituary\n[\n9\n]\n(\nsee also\n[\n11\n]\n)\n:-\nNotwithstanding the imperfect spectroscopic tables then at his disposal Rydberg discovered most of the important properties of series spectra, including the relation between corresponding series in the spectra of related elements, and foreshadowed discoveries which were made later, when experimental work has sufficiently advanced. Some of the features noted by Rydberg were observed about the same time by Kayser and\nRunge\n, but his work had the special merit of connecting different series in the spectrum of the same element into one system, which could be represented by a set of simple formulae having but few adjustable constants. He especially insisted that the hydrogen constant, now generally called the \"Rydberg constant,\" should appear in all series and, apart from slight variations from element to element suggested by the theoretical work of\nBohr\n, nearly all subsequent attempts to improve the representation series have involved this supposition, and have had Rydberg's formula as a basis.\nWe know that he had found his results by September\n1887\nsince he wrote to the\nRoyal Swedish Academy of Sciences\nat this time requesting financial support and attached to his application an appendix listing the results he later announced publicly. His first public announcement of his results was in\nOn the Structure of the Line Spectra of Chemical Elements. Preliminary Notice Communicated by the Author\nwhich was published in\n1890\n. In this preliminary notice, he stated that his researches had been only on elements in groups I, II, and III of the periodic table. However, he was certain that the laws he had found applied to all elements. He had presented his main paper\nRecherches sur la constitution des spectres d'émission des élements chimiques\nⓉ\n(\nResearch on the constitution of the emission spectra of chemical elements\n)\nto the\nRoyal Swedish Academy of Sciences\non\n13\nNovember\n1889\n. It also was published by the\nAcademy\nin\n1890\n. We now look at some of Rydberg's comments in these papers.\nHe had been led to study spectral lines of elements because of the work of Dmitri Ivanovich Mendeleyev\n(1834\n-\n1907)\nwho had produced his periodic table of the elements in\n1871\n. Mendeleyev's work was, at first, greeted with little enthusiasm but this changed over the years. Rydberg writes in\nRecherches\n:-\nWith the discovery by Mendeleyev of the periodic table of elements, there has arisen a new point of departure of great importance for all the work which I study here. However, it has been used but little. In 'Om de kemiska' I have concluded that the periodicity of a great number of physical coefficients must depend on the fact that the force which acts between two atoms of the same, or of different elements, is a periodic function of the atomic weight.\nHe states that, except for the Balmer formula for the spectrum of the hydrogen atom, the:-\n... problem of the constitution of luminous spectra is still unsolved and most of the attempts that have been made to compare and calculate the spectra of the elements have been done in such a way as to throw discredit on all work of this kind and to exaggerate the difficulties their authors having let their imaginations run so freely in the formation of their hypothesis.\nHe gives a formula based on various constants and notes that:-\n... the wave-lengths and wave numbers of corresponding lines, as well as the values of the three constants of the corresponding series of different elements, are periodical functions of the atomic weight. Therefore, if the spectra of two elements in the periodic table are known, the spectrum of the element in between them can be calculated using interpolation.\nHe continued to study the problem of spectral lines and in his paper\nLines in the Hydrogen Spectrum\n(1897)\nhe writes:-\nAs I have pointed out already in my general exposition of the constitution of line spectra, and have afterwards tried further to confirm, there can be no doubt that these series are really parts of a single group of lines with two variable integral parameters, the general formula of which can be written approximately.\nHe hoped to determine the structure of the atom but, although his work did provide the basis for the structure theory, he himself did not reach his goal. Only after Ernest Rutherford had proposed his model of the atom, and\nNiels Bohr\nand\nMax Planck\nhad added a quantum theory approach to the theory of atomic structure, was the foundation in place to give a correct theoretical account of spectral data.\nWe have seen above that Rydberg only became a full professor in\n1909\n. He was\n54\nyears old, but sadly his health soon began to deteriorate. He had a stroke in\n1911\nand, although he recovered sufficiently to return to work, he began to suffer heart and circulation problems. His health continued to deteriorate and he became seriously ill in\n1914\n. Although he continued to hold the chair he took sick leave in\n1914\nand was absent from the university from that time on. Manne Siegbahn\n(1886\n-\n1978)\n, who had been a student of Rydberg from\n1906\nto\n1911\n, then Rydberg's assistant from\n1911\nto\n1914\n, took over his teaching duties in\n1914\n. He carried these out until Rydberg reached the age of\n65\nin\n1919\n. We note that Siegbahn wrote the biography of Rydberg\n[\n13\n]\n. Rydberg resigned his position in\n1915\nand in\n1916\nhe was taken into hospital. He spent three years in hospital before dying from a brain haemorrhage. Siegbahn became a professor in\n1915\nwhen Rydberg retired but it was only early in\n1920\nthat he was appointed to Rydberg's chair of physics.\nThe authors of\n[\n8\n]\nwrite about Rydberg's character:-\nRydberg was considered by many of his contemporaries as a complicated person and his sadness was apparent, but his modesty and kindliness of heart were also appreciated.\nThe author of\n[\n13\n]\nwrites about:-\n... his quiet sense of humour especially when concerned with those who were apparently unable to appreciate him. For years chairman of the 'Fysiska föreningen' in Lund, Rydberg was always interested in discussions with the younger men in the society and the institution, and with graduate students nearing their goal.\nWe have already seen that, despite his groundbreaking work, Rydberg struggled to get a professorial appointment. He also failed to receive the Nobel prize for physics despite being nominated for the\n1917\nprize\n(\nno award was made that year\n)\nand again for the\n1920\nprize\n(\nhis death in December\n1919\nmeant he was not eligible\n)\n. Even more surprising is that he failed to get elected to the\nRoyal Swedish Academy of Sciences\n. However, shortly before his death, on\n29\nJune\n1919\n, he was elected a fellow of the\nRoyal Society of London\n. Certainly he has achieved more fame after his death than during his lifetime. A conference was held at the University of Lund in July\n1954\nto celebrate the\n100\nth\nanniversary of his birth. It was attended by the leading physicists of the day and the proceedings was published\n(\nsee\n[\n3\n]\n)\n. Two of the scientists who attended were\nNiels Bohr\n, who contributed the article\n[\n5\n]\n, and\nWolfgang Pauli\n, who contributed the article\n[\n10\n]\n. The crater Rydberg on the Moon and asteroid\n10506\nRydberg have been named in his honour.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}