{
  "nome_completo": "Johann Heinrich Graf",
  "nome_curto": "Johann Heinrich Graf",
  "ano_nascimento": "1852",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Graf/",
  "lugar_nascimento": "Töss, Zürich, Switzerland",
  "lugar_morte": "Bern, Switzerland",
  "biografia": "Johann Heinrich Graf\nwas the son of Margaretha Kläui and Rudolf Graf, a policeman. Although his parents were from Töss\n(\nwhich is now part of Winterthur\n)\n, his place of origin is Wildberg, Zürich.\nAfter having attended primary school in Töss and secondary school in Zürich, Graf studied at the private teachers' college Muristalden, close to Bern, from\n1868\n-\n1871\n.  He obtained a certificate as a primary school teacher, but went on to do further studies at the Eidgenössisches Polytechnikum Zürich\n(\nsince\n1911\nEidgenössische Technische Hochschule Zürich\n)\n.\nIn\n1874\nhe graduated from the Polytechnikum with a certificate as a secondary school science teacher. In the same year, he married Anna Luisa Däniker, from Zürich. Also, he moved back to Bern where he taught mathematics and physics at the private secondary school Lerberschule\n(\nfounded in\n1859\n, renamed Freies\nGymnasium\nBern in\n1892)\n. Furthermore, he matriculated at the University of Bern as a PhD student. His supervisor was\nLudwig Schläfli\n, whom he admired\n[\n3\n]\n:-\nSchläfli\n, who held the chair of mathematics at the University of Bern at the time, guided his research and to him became a beloved teacher whom he never forgot.\nGraf was awarded his doctorate for his thesis\nBeiträge zur Theorie der Riemann'schen Fläche\nⓉ\n(\nContributions to the theory of the Riemann surface\n)\nin\n1877\n. In\n1878\n, he became a private lecturer\n(\nPrivatdozent\n)\nat the University of Bern. In addition to his duties at the university, he continued teaching at the Lerberschule and, in\n1885\n, he even became the first deputy headmaster of the school. However, being an \"inveterate\"\n[\n2\n]\nadvocate of the sciences, Graf was not deemed a suitable candidate for the position as headmaster of the school a few years later, as the school was based on Christian and humanistic principles. Furthermore, his workload at the university increased.\nIn\n1890\nhe was appointed as an extraordinary professor; two years later he became\nSchläfli\n's successor when\nSchläfli\nretired, being appointed to an ordinary professorship. Graf was a popular teacher and lecturer\n[\n3\n]\n:-\nHis well-prepared courses, his clear and lively lectures always attracted the sympathy of his audience. Besides, he loved his students. ... Even when they had been released into life, he did not leave them and continued to take an interest in their careers, their success in education or in the pursuit of their scientific research.\nIn\n1898\n, he entered his second marriage, with Maria Magdalena Balli from Aarmühle. He held the chair of mathematics at the University of Bern until his death in\n1918\n.\nGraf's main mathematical interests were in\nBessel functions\n, gamma functions and spherical functions. Crelier remarks in\n[\n3\n]\nthat much of Graf's research was inspired by\nSchläfli\n's papers on these functions. Today he is best known for Graf addition theorems for\nBessel\nfunctions and other such functions. Examples of his papers are:\nÜber die Addition und Subtraction der Argumente bei Bessel'schen Functionen nebst einer Anwendung\nⓉ\n(\nOn the addition and subtraction of arguments of Bessel functions and an application.\n)\n(1893)\n;\nBeiträge zur Auflösung von linearen Differentialgleichungen zweiter Ordnung mit linearen Coefficienten sowie von Differentialgleichungen zweiter Ordnung, denen gewisse bestimmte Integrale genügen\nⓉ\n(\nSome contributions to the solving of linear second order differential equations with linear coefficients and of second order differential equations, with certain definite integrals\n)\n(1894)\n; and\nBeitrag zur Auflösung von Differentiagleichungen zweiter Ordnung, denen gewisse bestimmte Integrale genügen\nⓉ\n(\nContribution to the resolution of second order differential equations to be satisfied by certain definite integrals\n)\n(1902)\n. Graf also took a keen interest in actuarial sciences; he published a number of papers on insurance funds and lectured on actuarial mathematics from\n1902\n-\n1918\nat the University of Bern.\nHis other areas of interest were in the history of mathematics and cartography. Between\n1890\nand\n1912\n, he wrote numerous articles called\nNotes on the History of Mathematics and Sciences in Switzerland\n. He published biographies of a several Swiss mathematicians, cartographers and astronomers, including\nLudwig Schläfli\nand\nJakob Steiner\n. Graf also edited\nSchläfli\n's correspondence with\nSteiner\n,\nArthur Cayley\nand\nCarl Borchardt\n.\nThroughout his life, Graf held a large number of administrative positions. At the University of Bern, he served as dean of the faculty of philosophy and sciences for three years\n(1900\n-\n1902\nand\n1910\n-\n1911)\n. During\n1905\n-\n1906\nhe was also vice chancellor of the university. Furthermore, he was a member of various committees and introduced several insurance funds, such as the university's fund for widows and orphans.\nFor most of his professional life, Graf was a member of the Swiss and the Bernese Societies for Natural Scientists; he was the editor of the communications of the Bernese society from\n1883\n-\n1910\n.\nFrom\n1895\nuntil his death, Graf was president of the Swiss library committee. He was one of the people responsible for the foundation of the Swiss National Library. Moreover, he was a member of the Bernese city council during\n1889\n-\n1895\nand a member of the Bernese district council during\n1896\n-\n1911\n. Although originally from Zürich, Graf became\n[\n3\n]\n:-\n... an excellent Bernese who was held in high esteem by all his fellow citizens.",
  "math_areas": []
}