{
  "nome_completo": "Johannes de Groot",
  "nome_curto": "Johannes de Groot",
  "ano_nascimento": "1914",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Groot/",
  "lugar_nascimento": "Garrelsweer, The Netherlands",
  "lugar_morte": "Rotterdam, The Netherlands",
  "biografia": "Johannes de Groot\n's mother was Maria Margaretha Kuylman\n(1881\n-\n1969)\nand his father, also named Johannes de Groot\n(1886\n-\n1942)\n, was, at the time his son was born, a minister in a church. In\n1928\nJohannes de Groot Sr. was appointed professor of Hebrew linguistics and Israelite archeology at the University of Groningen, succeeding Franz M Th Bohl. In\n1931\nhe became professor of Exegesis of the Old Testament at the University of Utrecht. He married Maria Margaretha Kuylman who was the daughter of a minister of the Church and had literary gifts; she wrote two novels.\nThe de Groot family had been traditionally a farming family. In the\n17\nth century they had settled in the Het Bildt region which had been reclaimed from the Middelsee\n(\nor Bordine\n)\n. The father of Johannes de Groot Sr. had owned a large farm on the border of Groningen and Friesland. However, falling transportation costs saw an American 'grain invasion' into Europe around\n1890\nwhich had a massive impact on the European farmers. The grandfather of the subject of this biography gave up farming and lived in Groningen on the income from his properties. Despite being a farming family, the de Groot family was fascinated with mathematical problems and, when there was little farming activity during the winter months, they would entertain themselves solving mathematical problems. De Groot Sr. was interested in mathematics but had decided to study theology and literature at the University of Groningen.\nJohannes de Groot, the subject of this biography, attended the Christelijk\nGymnasium\nin The Hague for two years and Willem Lodewijk Gymnasium in Groningen for two years. It was his mathematics teacher J Scholten at the Willem Lodewijk Gymnasium who first awakened his interest in mathematics which led to him deciding to study mathematics at university. He entered the University of Groningen in\n1933\nbut, although mathematics was his main subject, he also studied physics and philosophy as secondary subjects. Among his mathematics lecturers were Johannes Gaultherus van der Corput\n(1890\n-\n1975)\nand Gerrit Schaake\n(1892\n-\n1945)\n. Van der Corput's area of research was analytic number theory and he was a professor at Groningen from\n1923\nto\n1946\n. He then moved to Amsterdam where he was the cofounder, with\nDavid van Dantzig\nand\nJurjen Ferdinand Koksma\n, of the research and service institution, the Mathematisch Centrum, in February\n1946\n. Schaake had studied at Amsterdam and, advised by\nHendrik de Vries\n, was awarded his Ph.D. in\n1922\nfor the thesis\nAfbeeldingen van figuren op de punten eener lineaire ruimte\nⓉ\n(\nImages of figures on the points of a linear space\n)\n. After graduating with his first degree, de Groot went on to study for his doctorate, advised by Schaake. He began to undertake research on\nalgebraic geometry\nalso looking at certain problems in algebra. However, he moved towards topology and was awarded a Ph.D. in\n1942\nfor the\n102\n-page thesis entitled\nTopologische Studien. Compactificatie, Voortzetting van Afbeeldingen en Samenhang\nⓉ\n(\nTopological studies, compactification, extension of mappings and connectivity\n)\n. He had already published a summary of the results of his thesis in the\n6\n-page paper written in German entitled\nSätze über topologische Erweiterung von Abbildungen\nⓉ\n(\nRemarks about the topological enlargement of figures\n)\nwhich appeared in\n1941\n. Baayen and Maurice write in\n[\n4\n]\n:-\nIn his thesis, de Groot considered several interconnected problems concerning compactification of topological spaces, extension of mappings and\n(\nquasi-\n)\nconnectivity.\nMany fascinating conjectures arose from the work in de Groot's thesis which are discussed in the book\n[\n2\n]\n. We quote below from the Preface of that book.\nHans Freudenthal\nmet de Groot's while de Groot was working on his thesis, see\n[\n5\n]\nor\n[\n6\n]\n:-\nI got to know Johannes de Groot in the summer of\n1941\nwhen he was working on his thesis. When he came to me, he was already well advanced and in possession of the main result ... Indeed, he had chosen that topic independently - in all his studies he has been his own mentor. I recognized the work which he described to me was related to the subject of my dissertation and the work of\nLeo Zippin\n- his work partly overlapped ours, although his angle of approach was quite different.\nOf course, de Groot's years studying at university had been made difficult by World War II. This began in September\n1939\nwith the German invasion of Poland but at this stage The Netherlands remained neutral. Their neutrality was not respected, however, for in May\n1940\nthe German armies took over the country. The Netherlands was under German occupation for the following years and this was certainly the case when de Groot completed his university studies. It was not until May\n1945\nthat Allied forces liberated the country. The position in\n1942\nwas that although under German occupation, the country's administration attempted to keep things operating as best as they could in very difficult circumstances. De Groot became a secondary school teacher of mathematics, first at Coevorden and then at The Hague. However, he continued his mathematical research and over the following years published a number of papers. Let us look at some papers he published in\n1942\n, the year his Ph.D. was awarded.\nIn\n1942\nhe published\nOn the extension of continuous functions\nin which he proves that it is impossible to extend every continuous\n(\nbounded\n)\nreal function on a nonclosed subset of a metric space to a continuous\n(\nbounded\n)\nreal function on that space. In\nBemerkung zum Problem der topologischen Erweiterung von Abbildungen\nⓉ\n(\nRemark on the problem of topological enlargement of images\n)\n(1942)\nhe proves that given a nonclosed or a nonbounded subset of\nR\nn\n\\mathbb{R}^{n}\nR\nn\nthen there exists a homeomorphism taking the given subset into a subset of\nR\nn\n\\mathbb{R}^{n}\nR\nn\nwith the property that this homeomorphism can not be extended to\nR\nn\n\\mathbb{R}^{n}\nR\nn\n. In another\n1942\npaper,\nBemerkung über die analytische Fortsetzung in bewerteten Körpern\nⓉ\n(\nRemark on the analytical continuation in fields with valuation\n)\n, he gives a new proof of the theorem that it is impossible to obtain an analytic extension of a power series with coefficients in a\np\np\np\n-adic field.\nNathan Jacobson\nreviewed de Groot's\n1942\npaper\nTopologische Eigenschaften bewerteter Körper\nⓉ\n(\nTopological properties of fields with valuation\n)\nand writes:-\nAn element x of an extension of a non-Archimedean valued field is called completely transcendental if it is not the limit of a sequence of algebraic elements. As is well known, any field can be obtained from its prime field by a succession of simple transcendental extensions followed by a succession of algebraic extensions. The authors show that a field with a nontrivial non-Archimedean valuation is separable if and only if it is possible to choose the\n(\ntransfinite\n)\nsequence of transcendental extensions in such a way that there is only a denumerable number of elements which are completely transcendental over the field that they extend. Using a result of\nZippin\n(1935)\nit is proved that the space of such a field can be made compact by adjoining a denumerable number of points.\nIn\n1946\n, with the country beginning to recover from World War II, de Groot was appointed as a scientific officer at the Mathematical Centre in Amsterdam. There were two universities in Amsterdam, the University of Amsterdam\n(\nfounded\n1632)\nand the Free\n(\nVrije\n)\nUniversity\n(\nfounded\n1880)\n. The Mathematical Centre, however, was an independent institution not attached to either of these universities. We mentioned above that Van der Corput, one of de Groot's influential teachers at university, had been the co-founder of the Mathematical Centre in Amsterdam in February\n1946\n.\nThe following year, de Groot was appointed a lecturer in mathematics at the University of Amsterdam. Then, in\n1948\n, he was appointed professor of mathematics at the Technological University of Delft. De Groot married Lutgerdina Steffina Koster in\n1949\n; they had one daughter. Three years later, in\n1952\n, he was appointed Professor of Mathematics at the University of Amsterdam. He also retained his position at the Mathematical Centre in Amsterdam and, in\n1960\n, was appointed Head of Pure Mathematics there.\nIn\n1964\nhe became Dean of the Faculty of Science at the University of Amsterdam and, at this time, he gave up his position of Head of Pure Mathematics at the Mathematical Centre but remained associated with the Mathematical Centre as Advisor to Pure Mathematics\n[\n4\n]\n:-\n... actively participating in and in many instances decisively influencing its research activity.\nAlthough he worked in Amsterdam for the rest of his career, he made many visits to the United States. He visited Purdue University\n(\nSeptember\n1959\n-September\n1960)\n, Washington University at St. Louis\n(\nSeptember\n1963\n-February\n1964)\n, the University of Florida at Gainesville\n(\nAugust\n1966\n-March\n1967)\n, and the University of South Florida in Tampa\n(\nDecember\n1971\n-March\n1972)\n. In fact, from November\n1967\nhe was appointed graduate research professor at the University of Florida at Gainesville and, from that time on, divided his time between this position and his professorship in Amsterdam.\nWe mentioned above that before de Groot began researching in topology he was interested in algebra. In fact, later in his career he returned to his interest in algebra when he undertook some research in group theory. One of the topics he studied was that of rigid groups, that is groups with only trivial automorphisms. These play a role in\nAutomorphism groups of rings\nwhich was the topic of his address to the International Congress of Mathematicians in Edinburgh, Scotland, in\n1958\n.\nLater de Groot worked on set-theoretic topology. He introduced the concept of co-compactness and other topological concepts. Baayen writes in\n[\n1\n]\n:-\nIn the last ten years of his life, de Groot was involved with new general approaches, mainly in set-theoretic topology. His early work in compactness and its generalizations, combined with new interest in Baire spaces, led him to introduce concepts like subcompactness, co-compactness, and co-topological properties in general. He elaborated a new compactification method through the use of so-called superextensions. He introduced and studied topological operators that change a given topology into another one by assigning as a closed subbase for the new topology all sets in the first topology with a specific property\n(\nfor instance, all compact sets, or all connected closed sets\n)\n. In his last few years, de Groot also began to do research in infinite dimensional topology and in the topology of manifolds.\nThe book by J M Aarts and T Nishiura,\nDimension and extensions\n(1993)\n, discusses a long-standing problem of de Groot. The main conjecture made by him, which went back to his\n1942\nthesis, had been solved not long before this book was written. In the Preface of this book the problem of de Groot is described as follows:-\nTwo types of seemingly unrelated extension problems are discussed in this book. Their common focus is a long-standing problem of Johannes de Groot, the main conjecture of which was recently resolved. As is true of many important conjectures, a wide range of mathematical investigations had developed. These investigations have been grouped into the two extension problems under discussion. The problem of de Groot concerned compactifications of spaces by means of an adjunction of a set of minimal dimension. This minimal dimension was called the compactness deficiency of a space. Early success in\n1942\nlead de Groot to invent a generalization of the dimension function, called the compactness degree of a space, with the hope that this function would internally characterize the compactness deficiency which is a topological invariant of a space that is externally defined by means of compact extensions of a space. From this, the two extension problems were spawned. The first extension problem concerns the extending of spaces. Among the various extensions studied here, the important ones are compactifications and metrizable completions. ... The natural problems are the construction of dimension preserving extensions satisfying various extra conditions and the construction of extensions possessing adjoined subsets satisfying certain restrictions. The second extension problem concerns extending the theory of dimension by replacing the empty space with other spaces. The compactness degree of de Groot was defined by the replacement of the empty space with compact spaces in the initial step of the definition of the small inductive dimension.\nHans Freudenthal\nexplains in\n[\n5\n]\n(\nor\n[\n6\n]\n)\nthe aspects of de Groot's personality which defined the direction of his research:-\nHe has always - as I said earlier - been his own mentor and the creator of the methods he used. Therefore, he continued to work in fields and research problems where no specific research methods existed or were required - and not where one must first pass a long route through someone else's domain before one can get started oneself. This trait was his strength, where the riches came from his grasp of simple ideas without much background knowledge, which made it possible for him to lead others to work together and to encourage them. The number of publications by others on which he has exerted influence is great.\nAn important feature of de Groot's career was the number of Ph.D. students that he supervised who later became university lecturers. McDowell writes in\n[\n9\n]\n:-\nHis students essentially constitute the topology faculties at the Dutch universities.\nDe Groot received many honours, perhaps the most prestigious of which was his election in\n1969\nto the Royal Dutch Academy of Sciences.\nFor many years de Groot suffered prolonged periods of poor health but, despite this, his death was sudden and unexpected.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}