{
  "nome_completo": "Johann Andreas von Segner",
  "nome_curto": "Johann Segner",
  "ano_nascimento": "1704",
  "ano_morte": "1777",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Segner/",
  "lugar_nascimento": "Pozsony, Hungary (now Bratislava, Slovakia)",
  "lugar_morte": "Halle, Prussia (now Germany)",
  "biografia": "The Hungarian version of\nSegner\n's name is\nJan Andrej Segner\nor\nJános András Segner,\nwhile in German he is often known as\nJohann Andreas von Segner.\nSimilarly, the town in which he was born had the German name of Pressburg and the Hungarian name of Pozsony. Today it is Bratislava, the capital of Slovakia. There is genuine reason for both German and Hungarian versions, for Segner was from a family of German origins, and although he spent about\n25\nyears of his life in Hungary he spent most of his career in Germany.\nSegner attended school at Pozsony's Lyceum where he showed special talents for medicine and mathematics. He also attended school in Györ and, while it is not completely certain, it does seem highly probable that he spent the year\n1724\nat the College in Debrecen. In\n1725\nhe went to Germany and entered the University of Jena, studying medicine there. While he was an undergraduate he published essays on a wide variety of topics including mathematics, philosophy, physics, astronomy, chemistry, and medicine. He qualified as a medical doctor in\n1729\nand, in the following year, he was employed as a doctor by the authorities in Debrecen, taking up his new post in November\n1730\n. He did not find being a doctor of medicine to his liking and, after spending eighteen months in the job at Debrecen, he returned to the academic world returning to the University of Jena to take a Master's Degree. Although he would spend the rest of his life in Germany, Szénássy notes that\n[\n4\n]\n:-\n... when he lived in Germany his interest in Hungarian affairs never diminished, and Hungarians visiting Germany were always welcome in\n[\nhis\n]\nhome.\nHis studies at Jena were so successful that he was soon offered a post at the university. He had the great distinction of becoming the first professor of mathematics at Göttingen taking up the chair in\n1735\n. Segner's was therefore the first to fill what was to become one of the foremost chairs of mathematics in the world. In\n1743\nSegner was put in charge of the construction of the university observatory which was finished in\n1751\n.\nWhile at Göttingen Segner discovered that every solid body has three axes of symmetry. He used\nDaniel Bernoulli\n's theoretical work on the 'reaction effect' to produce a horizontal waterwheel using the same principle which drives a modern lawn sprinkler. Segner's work, which influenced\nEuler\nto work on turbines, is described in\n[\n7\n]\n:-\nSegner's wheel established the basic principles on which the jet turbine was developed decades later. It works on the principle of a stream of water coming out of a cylinder which at its lowest part has several horizontal paddles bent in one direction. The water streaming through the paddles produces a counter-pressure able to turn the cylinder in the opposite direction.\nIn\n1751\nSegner introduced the concept of the surface tension of liquids and made an unsuccessful attempt to give a mathematical description of capillary action. Other work which he undertook included the theory of spinning tops. His publications include\nElements of Arithmetic and Geometry\nand\nNature of Liquid Surfaces\n. Szénássy writes\n[\n4\n]\n:-\nSegner had a subtle sense to discover long-forgotten values in the heritage of the past and an ability to elaborate the achievements of his age systematically so as to be understood by a wide readership. These features of his textbooks made them highly popular. The proofs of several theorems of algebra and geometry have been adopted by subsequent textbooks and some of his Latin and German technical terms ... are still in use in most languages in verbatim translation.\nHe left Göttingen in\n1755\nand, with\nEuler\n's assistance, became professor at Halle where he lectured on mathematics, physics and medicine. He continued to write good textbooks and in Halle, as in Göttingen, he established an observatory.\nSegner received many honours for his work, several being from Frederick II of Prussia. He was made a member of the\nSt Petersburg Academy of Sciences\n, the\nBerlin Academy\nand the\nRoyal Society\nin London. Recently he has been honoured with a crater on the Moon being named after him.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}