{
  "nome_completo": "Johann Werner",
  "nome_curto": "Johann Werner",
  "ano_nascimento": "1468",
  "ano_morte": "1522",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Werner/",
  "lugar_nascimento": "Nuremberg, Germany",
  "lugar_morte": "Nuremberg, Germany",
  "biografia": "Johann Werner\nwas born in Nuremberg, Bavaria, three years before the painter and mathematician\nAlbrecht Dürer\nwas born in the same city.\n(\nIn fact in later life\nDürer\nconsulted Werner on mathematical matters.\n)\nWerner, in later life writing about his upbringing, said that, from early childhood, he knew he would be a mathematician.\nOn\n21\nSeptember\n1484\nhe entered the university at Ingolstadt, also in Bavaria. The university had been founded just four years after Werner's birth; in fact this university moved to Landshut in\n1800\nand then to Munich in\n1826\nbecoming the present University of Munich. After studying in Ingolstadt, Werner was appointed chaplain in Herzogenaurach in\n1490\n. He moved to Rome in\n1493\nwhere he was ordained a priest. He returned to Nuremberg in\n1497\nand celebrated his first mass in the church of St Sebald on\n29\nApril\n1498\n. He became the parish priest at a small church in Wöhrd, just outside the city, in\n1503\nbut by\n1508\nhe was the priest at the Church of St John\n(\nSt Johannis\n)\nin the city of Nuremberg. He continued as a priest at this church until his death in\n1522\n. Folkerts writes\n[\n1\n]\n:-\nWerner was reputed to have been \"very diligent\" in carrying out all official responsibilities. Since his pastoral duties were rather limited, he devoted much time to scientific study.\nWerner's main scientific work was on astronomy, mathematics and geography. In astronomy he followed\nRegiomontanus\n, having access to all his writings which he studied carefully, while on the practical side was a skilled maker of instruments. His instruments include astrolabes, clocks, sundials, improved versions of Jacob's staff, and instruments to solve theoretical problems in spherical astronomy. He gave a description of a cross-staff with an angular scale on the staff from which degrees could be read off. Also a skilled observer with instruments of his own and those made by others, he recorded a comet on\n1\nJune\n1500\nand kept a record of observations until\n24\nJune\n1500\n.\nWerner's most famous work on astronomy and geography is\nIn Hoc Opere Haec Continentur Nova Translatio Primi Libri Geographicae Cl Ptolomaei\nⓉ\n(\nIn the First Book of this work is a translation of the New Geography of Ptolemy\n)\nwritten in\n1514\n. This book contains a translation of the\nPtolemy\n's\nGeography\nwith a commentary by Werner himself.  He gives a method to determine longitude based on eclipses of the Moon\n(\nwhich had been suggested earlier by\nRegiomontanus\n)\n. In addition, Werner suggested using the position of the Moon between the stars or the distance of the Moon from the Sun to allow an absolute time to be calculated. Then a calculation of local time would give the longitude. Later\nPeter Apianus\nand\nGemma Frisius\nadopted Werner's ideas on determining longitude but when Werner suggested these ideas they were not really practical as sufficiently precise ephemeres could not be prepared. Werner suggested using for these measurements a cross-staff of the type which sailors already used for determining the latitude of a ship at sea by measuring the height of the pole star. Werner wrote:-\nOur aim is to find the distance in longitude between two distant places. The geographer will be in one of these places and will measure with a cross-staff the distance of the Moon from a star on the Ecliptic. If then we divide this distance by the velocity of the Moon per hour, we will know at what time in the future the Moon will be in conjunction with this body.\nIn mathematics Werner worked on spherical trigonometry and\nconic sections\n. A work on spherical triangles was not published during his lifetime but was published in\n1907\naround\n400\nyears after it was written. He was the first to use the formula\n2\nsin\n⁡\n(\na\n)\nsin\n⁡\n(\nb\n)\n=\ncos\n⁡\n(\na\n−\nb\n)\n−\ncos\n⁡\n(\na\n+\nb\n)\n2\\sin(a)\\sin(b) = \\cos(a-b) - \\cos(a+b)\n2\nsin\n(\na\n)\nsin\n(\nb\n)\n=\ncos\n(\na\n−\nb\n)\n−\ncos\n(\na\n+\nb\n)\nas an aid to calculation. This was used by\nRheticus\nand\nBrahe\nand others up to the invention of logarithms.\nSome historians have suggested that Werner was the last writer in the medieval tradition of conic sections to produce anything original. He seems to have based his ideas on work by Giorgio Valla, on the\nSpeculi almukefi compositio\nⓉ\n(\nTreatise on a parabolic mirror\n)\n(\nin\nRegiomontanus\n's version\n)\n, as well as on the short but influential anonymous work\nDe duabus lineis\nⓉ\n(\nOn a pair of lines\n)\nwhch had been translated by Johannes of Palermo, a member of Frederick II's court along with\nFibonacci\nin the early thirteenth century. Werner's selection of the particular parts of the material to be included in his own work was largely based on what he needed for those parts of his omnibus volume of\n1522\non the duplication of the cube and the section of the sphere. Werner's work was not much cited at the time but this is most likely because a translation of the\nConics\nof\nApollonius\nsoon led to it being superfluous. His work on the duplication of the cube was not original but simply collected eleven methods which were known to the ancient Greeks. Perhaps of more interest is a series of twelve supplementary notes to this work. In one of these he shows that light is focused by a parabolic mirror.\nWerner studied several other topics and we mention one, namely weather forecasting. Between\n1513\nand\n1520\n, he made the first regular observations of the weather conditions in Germany.\nRegula aurea de aeris dispositione diiudicanda singulis diebus\n, one of several works which were published after his death, appeared in manuscript in\n1546\nand has never been printed. It contained:-\n... guidelines that explain the principles and observations of the changes in the atmosphere.\nMany consider Werner as a pioneer of modern meteorology and weather forecasting.",
  "math_areas": []
}