{
  "nome_completo": "Johannes Nikolaus Tetens",
  "nome_curto": "Johannes Tetens",
  "ano_nascimento": "1736",
  "ano_morte": "1807",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tetens/",
  "lugar_nascimento": "Tetenbüll (near Tönning), South Schleswig (now Germany)",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Johannes Tetens\nwas professor of physics at Bützow University\n(1760\n-\n1765)\nthen was made director of the Bützow Pädagogium in\n1765\n. He was appointed professor of philosophy at the University of Kiel in\n1776\nand he was later appointed to the chair of mathematics at Kiel. However, Tetens decided to give up an academic life in\n1789\nand to offer his services to public life. He first became an assessor but then he was appointed councillor of state and deputy in the Danish Ministry of Finance in Copenhagen.\nTetens' major academic work was in philosophy. He wrote\nPhilosophische Versuche über die menschliche Natur und ihre Entwickelung\nⓉ\n(\nPhilosophical experiments on human nature and its development\n)\nⓉ\n(\nPhilosophical experiments on human nature and its development\n)\n(\nPhilosophical Experiments on Human Nature and Its Development\n)\n(1777)\n, which is an investigation of the origin and structure of knowledge. This was certainly influenced by Kant's\n1770\ndissertation, but, on the other hand, Teten's work itself was a major influence on Kant and that influence shows up clearly in Kant's\nCritique of Pure Reason\n(1781)\n. Empirical foundations for philosophical studies were of great importance to Tetens and Kant is clearly seen to reiterated some of Tetens' arguments in his famous\n1781\nmasterpiece.\nSlightly earlier, Tetens had published\nÜber die allgemeine spekulativische Philosophie\nⓉ\n(\nOn the general speculative philosophy\n)\n(1775)\n. His work in philosophy is rather unusual for a German philosopher, having connections with ideas from both the British and French Schools. In particular he expressed some similar views to the Scottish philosopher David Hume\n(1711\n-\n1776)\n.\nIn\n1786\nTetens introduced ideas which began progress towards a stochastic approach to life insurance mathematics. Keiding writes\n[\n2\n]\n:-\nThe method of expected number of deaths is an integral part of standardization of vital rates, which is one of the oldest statistical techniques. The expected number of deaths was calculated in\n18\nth\ncentury actuarial mathematics\n(\nTetens,\n1786)\nbut the method seems to have been forgotten ...\nWhat Tetens showed was that, given an insurance portfolio with\nn\nn\nn\npolicies, the risk to the portfolio increases with\nn\nn\nn\n, but the risk to an individual policy decreases in proportion to\n√\nn\n√n\n√\nn\n. There are random fluctuations in mortality which create a risk to the portfolio but a smoothing effect takes place with increasing\nn\nn\nn\nwhich reduces the risk to individuals.",
  "math_areas": []
}