{
  "nome_completo": "Johannes Kepler",
  "nome_curto": "Johannes Kepler",
  "ano_nascimento": "1571",
  "ano_morte": "1630",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kepler/",
  "lugar_nascimento": "Weil der Stadt, Württemberg, Holy Roman Empire (now Germany)",
  "lugar_morte": "Regensburg (now in Germany)",
  "biografia": "Johannes Kepler\nis now chiefly remembered for discovering the three laws of planetary motion that bear his name published in\n1609\nand\n1619)\n. He also did important work in optics\n(1604\n,\n1611)\n, discovered two new regular polyhedra\n(1619)\n, gave the first mathematical treatment of close packing of equal spheres\n(\nleading to an explanation of the shape of the cells of a honeycomb,\n1611)\n, gave the first proof of how logarithms worked\n(1624)\n, and devised a method of finding the volumes of solids of revolution that\n(\nwith hindsight!\n)\ncan be seen as contributing to the development of calculus\n(1615\n,\n1616)\n. Moreover, he calculated the most exact astronomical tables hitherto known, whose continued accuracy did much to establish the truth of\nheliocentric\nastronomy\n(\nRudolphine Tables\n, Ulm,\n1627)\n.\nA large quantity of Kepler's correspondence survives. Many of his letters are almost the equivalent of a scientific paper\n(\nthere were as yet no scientific journals\n)\n, and correspondents seem to have kept them because they were interesting. In consequence, we know rather a lot about Kepler's life, and indeed about his character. It is partly because of this that Kepler has had something of a career as a more or less fictional character\n(\nsee historiographic note below\n)\n.\nChildhood\nKepler was born in the small town of Weil der Stadt in Swabia and moved to nearby Leonberg with his parents in\n1576\n. His father was a mercenary soldier and his mother the daughter of an innkeeper. Johannes was their first child. His father left home for the last time when Johannes was five, and is believed to have died in the war in the Netherlands. As a child, Kepler lived with his mother in his grandfather's inn. He tells us that he used to help by serving in the inn. One imagines customers were sometimes bemused by the child's unusual competence at arithmetic.\nKepler's early education was in a local school and then at a nearby seminary, from which, intending to be ordained, he went on to enrol at the University of Tübingen, then\n(\nas now\n)\na bastion of Lutheran orthodoxy.\nKepler's opinions\nThroughout his life, Kepler was a profoundly religious man. All his writings contain numerous references to God, and he saw his work as a fulfilment of his Christian duty to understand the works of God. Man being, as Kepler believed, made in the image of God, was clearly capable of understanding the Universe that He had created. Moreover, Kepler was convinced that God had made the Universe according to a mathematical plan\n(\na belief found in the works of\nPlato\nand associated with\nPythagoras\n)\n. Since it was generally accepted at the time that mathematics provided a secure method of arriving at truths about the world\n(\nEuclid\n's common notions and postulates being regarded as actually true\n)\n, we have here a strategy for understanding the Universe. Since some authors have given Kepler a name for irrationality, it is worth noting that this rather hopeful epistemology is very far indeed from the mystic's conviction that things can only be understood in an imprecise way that relies upon insights that are not subject to reason. Kepler does indeed repeatedly thank God for granting him insights, but the insights are presented as rational.\nUniversity education\nAt this time, it was usual for all students at a university to attend courses on \"mathematics\". In principle this included the four mathematical sciences: arithmetic, geometry, astronomy and music. It seems, however, that what was taught depended on the particular university. At Tübingen Kepler was taught astronomy by one of the leading astronomers of the day,\nMichael Mästlin\n(1550\n-\n1631)\n. The astronomy of the curriculum was, of course, geocentric astronomy, that is the current version of the Ptolemaic system, in which all seven planets - Moon, Mercury, Venus, Sun, Mars, Jupiter and Saturn - moved round the Earth, their positions against the fixed stars being calculated by combining circular motions. This system was more or less in accord with current\n(\nAristotelian\n)\nnotions of physics, though there were certain difficulties, such as whether one might consider as 'uniform'\n(\nand therefore acceptable as obviously eternal\n)\na circular motion that was not uniform about its own centre but about another point\n(\ncalled an 'equant'\n)\n. However, it seems that on the whole astronomers\n(\nwho saw themselves as 'mathematicians'\n)\nwere content to carry on calculating positions of planets and leave it to natural philosophers to worry about whether the mathematical models corresponded to physical mechanisms. Kepler did not take this attitude. His earliest published work\n(1596)\nproposes to consider the actual paths of the planets, not the circles used to construct them.\nAt Tübingen, Kepler studied not only mathematics but also Greek and Hebrew\n(\nboth necessary for reading the scriptures in their original languages\n)\n. Teaching was in Latin. At the end of his first year Kepler got 'A's for everything except mathematics. Probably\nMästlin\nwas trying to tell him he could do better, because Kepler was in fact one of the select pupils to whom he chose to teach more advanced astronomy by introducing them to the new, heliocentric cosmological system of\nCopernicus\n. It was from\nMästlin\nthat Kepler learned that the preface to\nOn the revolutions\n, explaining that this was 'only mathematics', was not by\nCopernicus\n. Kepler seems to have accepted almost instantly that the Copernican system was physically true; his reasons for accepting it will be discussed in connection with his first cosmological model\n(\nsee below\n)\n.\nIt seems that even in Kepler's student days there were indications that his religious beliefs were not entirely in accord with the orthodox Lutheranism current in Tübingen and formulated in the\nConfessio Augustana\nⓉ\n(\nAugsburg Confession\n)\n. Kepler's problems with this Protestant orthodoxy concerned the supposed relation between matter and 'spirit'\n(\na non-material entity\n)\nin the doctrine of the Eucharist. This ties up with Kepler's astronomy to the extent that he apparently found somewhat similar intellectual difficulties in explaining how 'force'\n[\nSee the History Topic on\nKepler's planetary laws\n]\nfrom the Sun could affect the planets. In his writings, Kepler is given to laying his opinions on the line - which is very convenient for historians. In real life, it seems likely that a similar tendency to openness led the authorities at Tübingen to entertain well-founded doubts about his religious orthodoxy. These may explain why\nMästlin\npersuaded Kepler to abandon plans for ordination and instead take up a post teaching mathematics in Graz. Religious intolerance sharpened in the following years. Kepler was excommunicated in\n1612\n. This caused him much pain, but despite his\n(\nby then\n)\nrelatively high social standing, as Imperial Mathematician, he never succeeded in getting the ban lifted.\nKepler's first cosmological model\n(1596)\nInstead of the seven planets in standard geocentric astronomy the Copernican system had only six, the Moon having become a body of kind previously unknown to astronomy, which Kepler was later to call a 'satellite'\n(\na name he coined in\n1610\nto describe the moons that\nGalileo\nhad discovered were orbiting Jupiter, literally meaning 'attendant'\n)\n. Why six planets?\nMoreover, in geocentric astronomy there was no way of using observations to find the relative sizes of the planetary orbs; they were simply assumed to be in contact. This seemed to require no explanation, since it fitted nicely with natural philosophers' belief that the whole system was turned from the movement of the outermost sphere, one\n(\nor maybe two\n)\nbeyond the sphere of the 'fixed' stars\n(\nthe ones whose pattern made the constellations\n)\n, beyond the sphere of Saturn. In the Copernican system, the fact that the annual component of each planetary motion was a reflection of the annual motion of the Earth allowed one to use observations to calculate the size of each planet's path, and it turned out that there were huge spaces between the planets. Why these particular spaces?\nKepler's answer to these questions, described in his\nMysterium cosmographicum\nⓉ\n(\nMystery of the Cosmos\n)\n, Tübingen,\n1596\n, looks bizarre to twentieth-century readers\n(\nsee the figure on the right\n)\n. He suggested that if a sphere were drawn to touch the inside of the path of Saturn, and a cube were inscribed in the sphere, then the sphere inscribed in that cube would be the sphere circumscribing the path of Jupiter. Then if a regular tetrahedron were drawn in the sphere inscribing the path of Jupiter, the insphere of the tetrahedron would be the sphere circumscribing the path of Mars, and so inwards, putting the regular\ndodecahedron\nbetween Mars and Earth, the regular\nicosahedron\nbetween Earth and Venus, and the regular\noctahedron\nbetween Venus and Mercury. This explains the number of planets perfectly: there are only five convex regular solids\n(\nas is proved in\nEuclid\n's\nElements\n, Book\n13)\n. It also gives a convincing fit with the sizes of the paths as deduced by\nCopernicus\n, the greatest error being less than\n10\n%\n(\nwhich is spectacularly good for a cosmological model even now\n)\n. Kepler did not express himself in terms of percentage errors, and his is in fact the first mathematical cosmological model, but it is easy to see why he believed that the observational evidence supported his theory.\nKepler saw his cosmological theory as providing evidence for the Copernican theory. Before presenting his own theory he gave arguments to establish the plausibility of the Copernican theory itself. Kepler asserts that its advantages over the geocentric theory are in its greater explanatory power. For instance, the Copernican theory can explain why Venus and Mercury are never seen very far from the Sun\n(\nthey lie between Earth and the Sun\n)\nwhereas in the geocentric theory there is no explanation of this fact. Kepler lists nine such questions in the first chapter of the\nMysterium cosmographicum\nⓉ\n(\nMystery of the Cosmos\n)\n.\nKepler carried out this work while he was teaching in Graz, but the book was seen through the press in Tübingen by\nMästlin\n. The agreement with values deduced from observation was not exact, and Kepler hoped that better observations would improve the agreement, so he sent a copy of the Mysterium cosmographicum to one of the foremost observational astronomers of the time,\nTycho Brahe\n(1546\n-\n1601)\n.\nTycho\n, then working in Prague\n(\nat that time the capital of the Holy Roman Empire\n)\n, had in fact already written to\nMästlin\nin search of a mathematical assistant. Kepler got the job.\nThe 'War with Mars'\nNaturally enough,\nTycho\n's priorities were not the same as Kepler's, and Kepler soon found himself working on the intractable problem of the orbit of Mars\n[\nSee the History Topic on\nKepler's planetary laws\n]\n. He continued to work on this after\nTycho\ndied\n(\nin\n1601)\nand Kepler succeeded him as Imperial Mathematician. Conventionally, orbits were compounded of circles, and rather few observational values were required to fix the relative radii and positions of the circles.\nTycho\nhad made a huge number of observations and Kepler determined to make the best possible use of them. Essentially, he had so many observations available that once he had constructed a possible orbit he was able to check it against further observations until satisfactory agreement was reached. Kepler concluded that the orbit of Mars was an\nellipse\nwith the Sun in one of its foci\n(\na result which when extended to all the planets is now called \"Kepler's First Law\"\n)\n, and that a line joining the planet to the Sun swept out equal areas in equal times as the planet described its orbit\n(\n\"Kepler's Second Law\"\n)\n, that is the area is used as a measure of time. After this work was published in\nAstronomia nova,\n...\nⓉ\n(\nNew Astronomy\n)\n, Heidelberg,\n1609\n, Kepler found orbits for the other planets, thus establishing that the two laws held for them too. Both laws relate the motion of the planet to the Sun; Kepler's Copernicanism was crucial to his reasoning and to his deductions.\nThe actual process of calculation for Mars was immensely laborious - there are nearly a thousand surviving folio sheets of arithmetic - and Kepler himself refers to this work as 'my war with Mars', but the result was an orbit which agrees with modern results so exactly that the comparison has to make allowance for secular changes in the orbit since Kepler's time.\nObservational error\nIt was crucial to Kepler's method of checking possible orbits against observations that he have an idea of what should be accepted as adequate agreement. From this arises the first explicit use of the concept of observational error. Kepler may have owed this notion at least partly to\nTycho\n, who made detailed checks on the performance of his instruments\n(\nsee\nthe biography of Brahe\n)\n.\nOptics, and the New Star of\n1604\nThe work on Mars was essentially completed by\n1605\n, but there were delays in getting the book published. Meanwhile, in response to concerns about the different apparent diameter of the Moon when observed directly and when observed using a\ncamera obscura\n, Kepler did some work on optics, and came up with the first correct mathematical theory of the\ncamera obscura\nand the first correct explanation of the working of the human eye, with an upside-down picture formed on the retina. These results were published in\nAd Vitellionem paralipomena, quibus astronomiae pars optica traditur\nⓉ\n(\nSupplements to Witelo, on the optical part of astronomy\n)\n, Frankfurt,\n1604\n. He also wrote about the New Star of\n1604\n, now usually called 'Kepler's supernova', rejecting numerous explanations, and remarking at one point that of course this star could just be a special creation 'but before we come to\n[\nthat\n]\nI think we should try everything else'\nDe stella nova\nⓉ\n(\nOn the new star\n)\n, Prague,\n1606\n, Chapter\n22\n, KGW\n1\n, p.\n257\n, line\n23\n.\nFollowing\nGalileo\n's use of the telescope in discovering the moons of Jupiter, published in his\nSidereal Messenger\n(\nVenice,\n1610)\n, to which Kepler had written an enthusiastic reply\n(1610)\n, Kepler wrote a study of the properties of lenses\n(\nthe first such work on optics\n)\nin which he presented a new design of telescope, using two convex lenses\n(\nDioptrice\n, Prague,\n1611)\n. This design, in which the final image is inverted, was so successful that it is now usually known not as a Keplerian telescope but simply as the astronomical telescope.\nLeaving Prague for Linz\nKepler's years in Prague were relatively peaceful, and scientifically extremely productive. In fact, even when things went badly, he seems never to have allowed external circumstances to prevent him from getting on with his work. Things began to go very badly in late\n1611\n. First, his seven year old son died. Kepler wrote to a friend that this death was particularly hard to bear because the child reminded him so much of himself at that age. Then Kepler's wife died. Then the Emperor Rudolf, whose health was failing, was forced to abdicate in favour of his brother Matthias, who, like Rudolf, was a Catholic but\n(\nunlike Rudolf\n)\ndid not believe in tolerance of Protestants. Kepler had to leave Prague. Before he departed he had his wife's body moved into the son's grave, and wrote a Latin epitaph for them. He and his remaining children moved to Linz\n(\nnow in Austria\n)\n.\nMarriage and wine barrels\nKepler seems to have married his first wife, Barbara, for love\n(\nthough the marriage was arranged through a broker\n)\n. The second marriage, in\n1613\n, was a matter of practical necessity; he needed someone to look after the children. Kepler's new wife, Susanna, had a crash course in Kepler's character: the dedicatory letter to the resultant book explains that at the wedding celebrations he noticed that the volumes of wine barrels were estimated by means of a rod slipped in diagonally through the bung-hole, and he began to wonder how that could work. The result was a study of the volumes of solids of revolution\nNova stereometria doliorum\n...\nⓉ\n(\nNew Stereometry of wine barrels\n)\n, Linz,\n1615\n, in which Kepler, basing himself on the work of\nArchimedes\n, used a resolution into 'indivisibles'. This method was later developed by\nBonaventura Cavalieri\n(\nc.\n1598\n-\n1647)\nand is part of the ancestry of the\ninfinitesimal\ncalculus.\nThe Harmony of the World\nKepler's main task as Imperial Mathematician was to write astronomical tables, based on\nTycho\n's observations, but what he really wanted to do was write\nThe Harmony of the World\n, planned since\n1599\nas a development of his\nMystery of the Cosmos\n. This second work on\ncosmology\n(\nHarmonices mundi libri V\nⓉ\n(\nHarmonic of the world, Book\n5\n)\n, Linz,\n1619)\npresents a more elaborate mathematical model than the earlier one, though the polyhedra are still there. The mathematics in this work includes the first systematic treatment of tessellations, a proof that there are only thirteen convex uniform polyhedra\n(\nthe Archimedean solids\n)\nand the first account of two non-convex regular polyhedra\n(\nall in Book\n2)\n.\nThe Harmony of the World\nalso contains what is now known as 'Kepler's Third Law', that for any two planets the ratio of the squares of their periods will be the same as the ratio of the cubes of the mean radii of their orbits. From the first, Kepler had sought a rule relating the sizes of the orbits to the periods, but there was no slow series of steps towards this law as there had been towards the other two. In fact, although the Third Law plays an important part in some of the final sections of the printed version of the\nHarmony of the World\n, it was not actually discovered until the work was in press. Kepler made last-minute revisions. He himself tells the story of the eventual success:-\n...and if you want the exact moment in time, it was conceived mentally on\n8\nth\nMarch in this year one thousand six hundred and eighteen, but submitted to calculation in an unlucky way, and therefore rejected as false, and finally returning on the\n15\nth\nof May and adopting a new line of attack, stormed the darkness of my mind. So strong was the support from the combination of my labour of seventeen years on the observations of\nBrahe\nand the present study, which conspired together, that at first I believed I was dreaming, and assuming my conclusion among my basic premises. But it is absolutely certain and exact that \"the proportion between the periodic times of any two planets is precisely the sesquialterate proportion of their mean distances ...\"\n(\nHarmonice mundi Book\n5\n, Chapter\n3\n, trans. Aiton, Duncan and Field, p.\n411)\n.\nWitchcraft trial\nWhile Kepler was working on his\nHarmony of the World\n, his mother was charged with witchcraft. He enlisted the help of the legal faculty at Tübingen. Katharina Kepler was eventually released, at least partly as a result of technical objections arising from the authorities' failure to follow the correct legal procedures in the use of torture. The surviving documents are chilling. However, Kepler continued to work. In the coach, on his journey to Württemberg to defend his mother, he read a work on music theory by Vincenzo Galilei\n(\nc.\n1520\n-\n1591\n,\nGalileo\n's father\n)\n, to which there are numerous references in\nThe Harmony of the World\n.\nAstronomical Tables\nCalculating tables, the normal business for an astronomer, always involved heavy arithmetic. Kepler was accordingly delighted when in\n1616\nhe came across\nNapier\n's work on logarithms\n(\npublished in\n1614)\n. However,\nMästlin\npromptly told him first that it was unseemly for a serious mathematician to rejoice over a mere aid to calculation and second that it was unwise to trust logarithms because no-one understood how they worked.\n(\nSimilar comments were made about computers in the early\n1960\ns.\n)\nKepler's answer to the second objection was to publish a proof of how logarithms worked, based on an impeccably respectable source:\nEuclid\n's\nElements\nBook\n5\n. Kepler calculated tables of eight-figure logarithms, which were published with the\nRudolphine Tables\n(\nUlm,\n1628)\n. The astronomical tables used not only\nTycho\n's observations, but also Kepler's first two laws. All astronomical tables that made use of new observations were accurate for the first few years after publication. What was remarkable about the\nRudolphine Tables\nwas that they proved to be accurate over decades. And as the years mounted up, the continued accuracy of the tables was, naturally, seen as an argument for the correctness of Kepler's laws, and thus for the correctness of the heliocentric astronomy. Kepler's fulfilment of his dull official task as Imperial Mathematician led to the fulfilment of his dearest wish, to help establish Copernicanism.\nWallenstein\nBy the time the\nRudolphine Tables\nwere published Kepler was, in fact, no longer working for the Emperor\n(\nhe had left Linz in\n1626)\n, but for Albrecht von Wallenstein\n(1583\n-\n1632)\n, one of the few successful military leaders in the Thirty Years' War\n(1618\n-\n1648)\n.\nWallenstein, like the emperor Rudolf, expected Kepler to give him advice based on astrology. Kepler naturally had to obey, but repeatedly points out that he does not believe precise predictions can be made. Like most people of the time, Kepler accepted the principle of astrology, that heavenly bodies could influence what happened on Earth\n(\nthe clearest examples being the Sun causing the seasons and the Moon the tides\n)\nbut as a Copernican he did not believe in the physical reality of the constellations. His astrology was based only on the angles between the positions of heavenly bodies\n(\n'astrological aspects'\n)\n. He expresses utter contempt for the complicated systems of conventional astrology.\nDeath\nKepler died in Regensburg, after a short illness. He was staying in the city on his way to collect some money owing to him in connection with the\nRudolphine Tables\n. He was buried in the local church, but this was destroyed in the course of the Thirty Years' War and nothing remains of the tomb.\nHistoriographic note\nMuch has sometimes been made of supposedly non-rational elements in Kepler's scientific activity. Believing astrologers frequently claim his work provides a scientifically respectable antecedent to their own. In his influential\nSleepwalkers\nthe late Arthur Koestler made Kepler's battle with Mars into an argument for the inherent irrationality of modern science. There have been many tacit followers of these two persuasions. Both are, however, based on very partial reading of Kepler's work. In particular, Koestler seems not to have had the mathematical expertise to understand Kepler's procedures. Closer study shows Koestler was simply mistaken in his assessment.\nThe truly important non-rational element in Kepler's work is his Christianity. Kepler's extensive and successful use of mathematics makes his work look 'modern', but we are in fact dealing with a Christian Natural Philosopher, for whom understanding the nature of the Universe included understanding the nature of its Creator.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}