{
  "nome_completo": "Johann van Waveren Hudde",
  "nome_curto": "Johann Hudde",
  "ano_nascimento": "1628",
  "ano_morte": "1704",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hudde/",
  "lugar_nascimento": "Amsterdam, Netherlands",
  "lugar_morte": "Amsterdam, Netherlands",
  "biografia": "Johann Hudde\n's father was Gerrit Hudde\n(1595\n-\n1647)\nwho was a well-off merchant who served as an Amsterdam member on the governing body of the Dutch East India Company from\n1632\n. Johann's mother was Maria Jonas de Witsen. From around\n1648\nJohann\nattended the University of Leiden where he studied law. However he was introduced to advanced mathematics at Leiden where he received private tuition from his teacher\nvan Schooten\n.\nVan Schooten\nhad established a vigorous research school in Leiden which included Hudde, and this school was one of the main reasons for the rapid development of Cartesian geometry in the mid\n17\nth\ncentury.\nSluze\n,\nHuygens\n,\nvan Schooten\n, Hudde and\nvan Heuraet\ncorresponded regarding the properties of curves, in particular Hudde was interested in techniques for determining tangents and finding maxima and minima. Most of the correspondence was directed through\nvan Schooten\nin the sense that his students would tell him of their discoveries and he would inform the others as well as publish certain of their results as appendices to his own publications.\nFrom\n1654\nuntil\n1663\nHudde worked on mathematics as part of\nvan Schooten\ngeometry research group at Leiden. He went with\nvan Heuraet\nto the Protestant university in Saumur, a town on the river Loire in western France, in\n1658\n. From\n1663\nhe worked in various roles for the Amsterdam City Council and as a juror, as Chancellor, and as deputy for the admiralty. Also, like his father, he was involved with the Dutch East India Company. He served for\n30\nyears as burgomaster of Amsterdam being first appointed around\n1670\n. There were four burgomasters but by law they could only serve for two out of every three years. This meant that Hudde was reappointed twenty-one times from his first appointment until his death. Politically he was considered as a moderate.\nAll of Hudde's mathematics was done before he began to work for the city council in\n1663\n.\nVan Schooten\nedited and published a Latin translation of\nDescartes\n'\nLa Géométrie\nin\n1649\n. A second two-volume translation of the same work\n(1659\n-\n1661)\ncontained appendices by\nde Witt\n, Hudde and\nvan Heuraet\n.\nHudde worked on maxima and minima and the theory of equations. He gave an ingenious method to find multiple roots of an equation which is essentially the modern method of finding the highest common factor of a polynomial and its derivative. An example of Hudde's rule appeared first in\nvan Schooten\n's\nExercitatione mathematicae\nⓉ\n(\nMathematical practice\n)\nin\n1657\n. In\n1658\nhe wrote a letter entitled\nEpistola secunda, de maximis et minimis\nⓉ\n(\nThe second letter, concerning maxima and minima\n)\nwhich was sent to\nvan Schooten\nand published as an appendix to his\n1659\nedition of\nDescartes\n'\nLa Géométrie\n. He gives his rule as follows\n[\n3\n]\n:-\nIf in an equation two roots are equal and if it be multiplied by any arithmetical progression, i.e. the first term by the first term of the progression, the second by the second term of the progression, and so on: I say that the equation found by the sum of these products shall have a root in common with the original equation.\nThis may seem mysterious so let us examine it further. Take the polynomial\nf\n(\nx\n)\n=\na\n0\nx\n0\n+\na\n1\nx\n1\n+\na\n2\nx\n2\n+\n.\n.\n.\nf (x) = a_{0}x^{0} + a_{1}x^{1} + a_{2}x^{2} + ...\nf\n(\nx\n)\n=\na\n0\n​\nx\n0\n+\na\n1\n​\nx\n1\n+\na\n2\n​\nx\n2\n+\n.\n.\n.\nand the arbitrary arithmetic progression\np\n,\np\n+\nk\n,\np\n+\n2\nk\n,\np\n+\n3\nk\n,\n.\n.\n.\np, p+k, p+2k, p+3k, ...\np\n,\np\n+\nk\n,\np\n+\n2\nk\n,\np\n+\n3\nk\n,\n.\n.\n.\nand form a new polynomial\nf\n∗\n(\nx\n)\n=\np\na\n0\nx\n0\n+\n(\np\n+\nk\n)\na\n1\nx\n1\n+\n(\np\n+\n2\nk\n)\na\n2\nx\n2\n+\n.\n.\n.\nf ^{*}(x) = pa_{0}x^{0} + (p+k)a_{1}x^{1} + (p+2k)a_{2}x^{2} + ...\nf\n∗\n(\nx\n)\n=\np\na\n0\n​\nx\n0\n+\n(\np\n+\nk\n)\na\n1\n​\nx\n1\n+\n(\np\n+\n2\nk\n)\na\n2\n​\nx\n2\n+\n.\n.\n.\nThen Hudde is claiming that if\na\na\na\nis a double root of\nf\n(\nx\n)\n=\n0\nf (x) = 0\nf\n(\nx\n)\n=\n0\n, then\na\na\na\nis a root of\nf\n∗\n(\nx\n)\n=\n0\nf ^{*}(x) = 0\nf\n∗\n(\nx\n)\n=\n0\n. Note that\nf\n∗\n(\nx\n)\n=\np\nf\n(\nx\n)\n+\nk\nx\nf\n′\n(\nx\n)\nf ^{*}(x) = pf (x) + kx f ' (x)\nf\n∗\n(\nx\n)\n=\np\nf\n(\nx\n)\n+\nk\nx\nf\n′\n(\nx\n)\n, and in the special case that\np\n=\n0\n,\nk\n=\n1\np = 0, k = 1\np\n=\n0\n,\nk\n=\n1\n, then\nf\n∗\n(\nx\n)\n=\nx\nf\n′\n(\nx\n)\nf ^{*}(x) = x f ' (x)\nf\n∗\n(\nx\n)\n=\nx\nf\n′\n(\nx\n)\n, where\nf\n′\n(\nx\n)\nf ' (x)\nf\n′\n(\nx\n)\nis the derivative. He uses this rule to find maxima and minima of polynomials and, even more impressively, quotients of polynomials.\nCurtin writes\n[\n6\n]\n:-\nIn Jan Hudde's work on maxima there appear for the first time rules that are almost exactly those we use today, including a mechanical rule for handling polynomials that is almost \"bring down the n and reduce by one\"\n(\nthe meaning of the derivative for many of our students\n)\n. Even more interesting is his introduction of the quotient rule in handling\nrational\nexpressions. ... Hudde had no notion of the derivative, but his approach to finding maxima of algebraic expressions is procedurally similar to ours - and yet curiously different ...\nHudde is able to use his rule to compute tangents to curves of the form\nf\n(\nx\n,\ny\n)\n=\n0\nf (x, y) = 0\nf\n(\nx\n,\ny\n)\n=\n0\n. He gives the following instructions\n[\n3\n]\n:-\nPut all the terms on one side. Remove x, y from the divisors. Arrange in ascending powers of y and multiply each term by the corresponding term in any arithmetic progression whatsoever. Repeat this process for the terms containing x. Divide the first sum of products by the second. Multiply the quotient by -x and this will give the subtangent.\nA fuller account of Hudde's rule was given in a letter he wrote dated\n21\nNovember\n1659\nwhich was not published at the time but, was published during the\nNewton\n-\nLeibniz\ncontroversy on who deserved priority for discovering the calculus, Hudde's letter was published as part of the evidence. This was entirely appropriate since\nNewton\nrefers to Hudde's rule many times.\nLeibniz\nalso studied Hudde's manuscripts and reported finding many excellent results. The manuscripts must have had an important influence on\nLeibniz\n's introduction of the calculus.\nBut Hudde made many more outstanding contributions. First let us mention that he was the first to treat the coefficients in algebra without considering whether they were positive or negative in\nDe reductione aequationum\n. In\n1656\nhe gave the power series expansion of\nln\n⁡\n(\n1\n+\nx\n)\n\\ln(1+x)\nln\n(\n1\n+\nx\n)\n. The following year he directed the flooding of parts of Holland to block the advance of the French army. He also worked on optics, publishing his short treatise\nSpecilla circularia etc\nⓉ\n(\ncircular lenses, etc.\n)\n. in\n1656\n. No copies of this seem to have survived but two manuscript versions have been found, one in London and the other in Hanover. Using the manuscripts, the work has recently been republished in\n[\n10\n]\n. E Knobloch writes:-\nHudde's treatise has to be read against the background of\nDescartes\n's theory of ovals and the dominance of paraxial optics. It is meant to be a complement to\nDescartes\n's work on the unison of rays after refraction, and that from a practical point of view, because\nDescartes\n's lenses could not be manufactured to a sufficient degree of accuracy. Hudde proposed a \"mechanical\" solution, which was not mathematically exact. Its originality lies in the exact way of dealing with inexactness.\nHe also produced microscopes and constructing telescope lenses. For many, however, Hudde is best known for his mathematical study of annuities\n[\n4\n]\n:-\nLife annuities ... were a very common source of revenue for governments ... During the sixteenth and seventeenth centuries governments began to suspect that the prices they were setting on life annuities made them much more costly than alternative ways of borrowing money. ... In\n1671\nthe city of Amsterdam was preparing to raise funds through the sale of a life annuity, and Johannes Hudde, a mathematician and city magistrate, investigated the appropriate price to set for the annuities. Using the theories of\nprobability and demography being developed by his contemporaries\nHuygens\nand Graunt, Hudde gathered data from the records of a previous annuity issued in Amsterdam during the years\n1586\n-\n90\n. Hudde's recommendations were used to establish the form of a life annuity issued by the city in\n1672\nand\n1674\n. ... Hudde arranged the data that he had collected into a table headed by the age of the nominee at the time of purchase.\nIn fact we still have Hudde's table, for he included it in a letter he sent to\nHuygens\non\n18\nAugust\n1671\n. Hudde also corresponded with\nde Witt\nconcerning annuities with letters between September\n1670\nand October\n1671\n. In this correspondence he framed the law of mortality which today is attributed to\nDe Moivre\nbut properly should be attributed to Hudde. Although, on Hudde's recommendations, Amsterdam sold annuities at age dependent prices in\n1672\n, there was no rapid move for others to adopt the practice.\nHudde also corresponded with\nHuygens\non problems of canal maintenance and together they undertook a review of the lower Rhine and IJssel rivers so that they could produce a strategy to prevent the rivers from silting up. He also used his position to promote scholarly studies. He himself studied the philosophy of Spinoza and was able to arrange for Burchardus de Volder to be appointed to the University of Leiden in\n1670\n. Burchardus de Volder was the first to teach natural philosophy in the Netherlands using experimental demonstrations during his lectures.\nGreatly respected and a man of great influence, many dedicated their works to Hudde. For example Gerard Blasius's history of discoveries in anatomy.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}