{
  "nome_completo": "Johann Jakob Balmer",
  "nome_curto": "Johann Balmer",
  "ano_nascimento": "1825",
  "ano_morte": "1898",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Balmer/",
  "lugar_nascimento": "Lausen, Basel-Land, Switzerland",
  "lugar_morte": "Basel, Switzerland",
  "biografia": "Johann Balmer\n's father was also named Johann Jakob Balmer and he was a Chief Justice. Johann's mother was Elizabeth Rolle Balmer. Johann was the eldest of his parents sons. He attended his first school in Liestal, a town which had just become the capital of the half canton of Basel-Landschaft. Then, for his secondary education, he studied at a school in Basel where he excelled in mathematics and decided to study that topic at university.\nFor his university studies in mathematics Balmer attended the University of Karlsruhe and the University of Berlin. His course of studies led to a doctorate which he received from the University of Basel in\n1849\nfor a dissertation on the cycloid.\nBalmer taught in Basel all his life. From\n1859\nuntil his death in\n1898\nhe was a school teacher of mathematics at a secondary school for girls in the city. From\n1865\nuntil\n1890\nhe was also a university lecturer in mathematics at the University of Basel where his main field of interest was geometry. He married Christine Pauline Rinck in\n1868\nwhen he was\n43\nyears old and they had six children.\nHowever, despite being a mathematics teacher and lecturer all his life, Balmer is best remembered for his work on spectral series and his formula, given in\n1885\n, for the wavelengths of the spectral lines of the hydrogen atom. This was set out in one of only two papers which he wrote on spectra of the elements, the second being in\n1897\n. It is surprising to realise that Balmer was sixty years old when he wrote the paper for which he is famous on the spectral lines of the hydrogen atom and that he was seventy-two when he wrote his only other work on this topic. But for his work on what amounts to a problem in physics, Balmer would be unknown today within the history of mathematics since he made no contribution to geometry of special significance despite it being the topic of interest throughout his life.\nThe major contribution which Balmer made, however, depended much more on his mathematical skills than on his understanding of physics, for he produced a formula which gave the wavelengths of the observed lines produced by the hydrogen atom without giving any physical explanation. Balmer's famous formula is\nλ\n=\nh\nm\n2\n/\n(\nm\n2\n−\nn\n2\n)\n\\lambda = hm^{2}/(m^{2} - n^{2})\nλ\n=\nh\nm\n2\n/\n(\nm\n2\n−\nn\n2\n)\n.\nPutting\nn\n=\n2\nn = 2\nn\n=\n2\nand\nh\n=\n3654.6\n×\n1\n0\n−\n8\nh = 3654.6 \\times  10^{-8}\nh\n=\n3\n6\n5\n4\n.\n6\n×\n1\n0\n−\n8\ncm, the wavelengths given by the formula for\nm\nm\nm\n=\n3\n,\n4\n,\n5\n,\n6\nwere correct to a high degree of accuracy. Previous attempts had looked for formulae of quite different types and had failed to come up with anything which matched the experimental evidence. Putting\nm\n=\n7\nm = 7\nm\n=\n7\ngave Balmer a predicted value for the next line and indeed a colleague at the University of Basel was able to tell Balmer that this line had been observed and the wavelength agreed with a high level of accuracy with the one Balmer's formula predicted.\nIn his paper of\n1885\nBalmer suggested that giving\nn\nn\nn\nother small integer values would give the wavelengths of other series produced by the hydrogen atom. Indeed this prediction turned out to be correct and these series of lines were later observed. The reason why the formula holds was not understood in Balmer's lifetime and had to wait until the theoretical work of\nNiels Bohr\nin\n1913\n.\nBalmer's formula led to more general formulae for the spectral lines of other atoms. Others who, basing their ideas on those of Balmer, were able to achieve such results included\nRydberg\n, Kayser and\nRunge\n.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}