{
  "nome_completo": "Johan Ludwig William Valdemar Jensen",
  "nome_curto": "Johan Ludwig Jensen",
  "ano_nascimento": "1859",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jensen/",
  "lugar_nascimento": "Nakskov, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Johan Ludwig Jensen\n's father was the sort of person who undertook a whole series of different projects yet, despite his good education and cultured style, the projects tended to end up financial failures. When Jensen was young his father took a position in Sweden as the manager of an estate in the north of the country. Jensen always said in later life that these childhood years were \"the most wonderful of his life\".\nWhen his position as estate manager ended Jensen's father returned to Denmark and Jensen completed his schooling in Copenhagen. In\n1876\nhe entered the College of Technology and there he studied a range of science subjects including physics, chemistry and mathematics. It was, however, mathematics which began to dominate his life as he lost interest in other topics so that he could devote all his attention to the mathematics he loved most of all. Dropping all other subjects except mathematics, he began to undertake research on his own, publishing his first papers while a student at the College of Technology.\nJensen was essentially self taught in research level mathematics and never held an academic appointment. At just the time when mathematics was the only subject that interested him and one would have expected someone of his abilities and keenness to go on to research degrees, he accepted an appointment working for a telephone company. This was not out of desire to give up mathematical research, rather it was to enable him to earn money to support himself so that he could continue to enjoy himself as a mathematician. His position was with the Copenhagen Division of the International Bell Telephone Company and, not unexpectedly for someone of his outstanding abilities, he soon impressed both for these abilities and for the hard work he was prepared to put in for the company.\nIn the following year,\n1882\n, the Copenhagen Division of the International Bell Telephone Company became the Copenhagen Telephone Company. The Company thrived, at least in part through the high level of technical skill that Jensen possessed. He continued to work for the company until\n1924\nbecoming head of the technical department in\n1890\n. For his whole working life Jensen was an amateur mathematician only doing mathematics in his spare time. However, he reached a very high level of expertise as a mathematician as he did as a telephone engineer.\nJensen contributed to the\nRiemann Hypothesis\n, proving a theorem which he sent to\nMittag-Leffler\nwho published it in\n1899\n. The theorem is important, but does not lead to a solution of the\nRiemann\nHypothesis as Jensen had hoped. It expresses\n[\n1\n]\n:-\n... the mean value of the logarithm of the absolute value of a\nholomorphic\nfunction on a circle by means of the distances of the zeros from the centre and the value at the centre.\nHe also studied infinite series, the\ngamma function\nand inequalities for convex functions. In a paper which he published in\nActa mathematica\nin\n1906\n, Jensen proved an inequality for convex functions which had a whole host of classical inequalities as special cases.\nJessen\nwrites in\n[\n1\n]\n:-\nWeierstrass was his ideal, and his papers are patterns of exact and precise exposition.",
  "math_areas": [
    "Analysis"
  ]
}