{
  "nome_completo": "John Colson",
  "nome_curto": "John Colson",
  "ano_nascimento": "1680",
  "ano_morte": "1760",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Colson/",
  "lugar_nascimento": "Lichfield, Staffordshire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "John Colson\n's was the eldest of his parents six children. His father, Francis Colson, was vicar-choral of Lichfield cathedral and his mother was Elizabeth. The family were closely related to the historian John Strype\n(1643\n-\n1737)\n. John Colson attended Lichfield grammar school and we know from letters from Francis Colson written to John Strype in\n1696\nthat his son John had visited London and called on John Strype but not found him at home. John Colson matriculated at Christ Church, Oxford, on\n26\nMay\n1699\nbut does not appear to have graduated with a degree.\nIn\n1707\nColson published\nThe universal resolution of cubic and biquadratic equations viz. Analytic, Geometrical and Mechanical\nin the\nPhilosophical Transactions\nof the\nRoyal Society\n. This was the most original piece of research that Colson produced in his whole career. In the paper he gave a method to solve a cubic equation which was similar to that which had been discovered by several other mathematicians.\nSuppose\nx\n3\n+\n3\nm\nx\n=\n2\nn\nx^{3} + 3mx = 2n\nx\n3\n+\n3\nm\nx\n=\n2\nn\n. Notice that\n(\na\n−\nb\n)\n3\n+\n3\na\nb\n(\na\n−\nb\n)\n=\na\n3\n−\nb\n3\n(a - b)^{3} + 3ab(a - b) = a^{3} - b^{3}\n(\na\n−\nb\n)\n3\n+\n3\na\nb\n(\na\n−\nb\n)\n=\na\n3\n−\nb\n3\nso if\na\na\na\nand\nb\nb\nb\nsatisfy\na\nb\n=\nm\nab = m\na\nb\n=\nm\nand\na\n3\n−\nb\n3\n=\n2\nn\na^{3} - b^{3} = 2n\na\n3\n−\nb\n3\n=\n2\nn\nthen\na\n−\nb\na - b\na\n−\nb\nis a solution of\nx\n3\n+\n3\nm\nx\n=\n2\nn\nx^{3} + 3mx = 2n\nx\n3\n+\n3\nm\nx\n=\n2\nn\n. But now\nb\n=\nm\na\nb = \\Large\\frac m a\nb\n=\na\nm\n​\nso\na\n3\n−\nm\n3\na\n3\n=\n2\nn\na^{3} - \\Large\\frac {m^{3}}{a^{3}}\\normalsize = 2n\na\n3\n−\na\n3\nm\n3\n​\n=\n2\nn\n, i.e.\na\n6\n−\n2\nn\na\n3\n−\nm\n3\n=\n0\na^{6} - 2na^{3} - m^{3} = 0\na\n6\n−\n2\nn\na\n3\n−\nm\n3\n=\n0\n. This is a quadratic equation in\na\n3\na^{3}\na\n3\n, so it can be solved for\na\n3\na^{3}\na\n3\nusing the usual formula for a quadratic. This gives\na\n3\n=\nn\n+\n√\n(\nn\n2\n+\nm\n3\n)\na^{3} = n + √(n^{2} + m^{3})\na\n3\n=\nn\n+\n√\n(\nn\n2\n+\nm\n3\n)\nand\nb\n3\n=\n−\nn\n+\n√\n(\nn\n2\n+\nm\n3\n)\nb^{3} = -n + √(n^{2} + m^{3})\nb\n3\n=\n−\nn\n+\n√\n(\nn\n2\n+\nm\n3\n)\n.\nNow at this point Colson came up with a clever idea that nobody seems to have thought of before this time. He knew that a number had three cube roots, in particular\n1\nhad the cube roots\n1\n,\n1\n2\n(\n−\n1\n+\n√\n−\n3\n)\n\\large\\frac{1}{2}\\normalsize (-1+√-3)\n2\n1\n​\n(\n−\n1\n+\n√\n−\n3\n)\n,\n1\n2\n(\n−\n1\n−\n√\n−\n3\n)\n\\large\\frac{1}{2}\\normalsize (-1-√-3)\n2\n1\n​\n(\n−\n1\n−\n√\n−\n3\n)\n. He therefore knew that there were three possible values for\na\na\na\nand three possible values for\nb\nb\nb\n. This, however, gave nine possible values for\nx\n=\na\n−\nb\nx = a - b\nx\n=\na\n−\nb\n. Colson tested each of these\n9\npossible solutions to see if it satisfies the original equation, and was able to identify the three actual solutions. This paper by Colson was the first to give all three solutions to a cubic equation. He then went on the give all four roots of a quartic, again being the first to do so. In the final part of the paper he gives a method to solve cubic and quartic equations using geometric constructions of circles and parabolas.\nColson was appointed as a master at the Sir Joseph Williamson Mathematical School in Rochester, Kent, in\n1709\n. He was elected a fellow of the Royal Society on\n11\nJune\n1713\nand nominated to the Vicarage of Chalk, in the County of Kent, on\n10\nSeptember\n1724\n. In\n1726\nhe published another mathematical work in the\nPhilosophical Transactions\nof the Royal Society, namely\nA Short Account of Negativo-Affirmative Arithmetick\n. The paper begins as follows:-\nThe usefulness of this arithmetic consists in this, that it performs all the operations with more ease and expedition than the common affirmative arithmetic, especially in large numbers. And it differs from the common arithmetic chiefly in this, that it admits of negative figures promiscuously with the affirmative, by the sign - placed over them. Thus\n_  __  _ ___  _\n3709286573961472\nis one of these numbers, which may be converted into its equivalent common number\n2308726432039468\n, in this manner\n3009006503000470\n0700280070961002\n----------------\n2308726432039468\nColson then goes on to show how to add, subtract, multiply and divide his negativo-affirmative numbers. He ends his paper with a promise of a mechanical device to calculate with these numbers:-\nBut all these operations, whether in the common decimal arithmetic, or in this here compendiously described; and not only in decimal arithmetic, but in several other species, as duodecimal, sexagesimal, centesimal, etc. all these operations\n(\nI say\n)\nmay be much more easily and readily performed, and with equal accuracy, by an instrument I have contrived called Abacus, or the Counting-Table, which I hope shortly to communicate to the inquisitive in these matters, and by which all long calculations may be very much facilitated. In the mean time this short account of negativo-affirmative arithmetic, in Denary or decimal numbers, may be premised, by way of introduction to the knowledge and use of the said instrument.\nColson was awarded a Master's Degree by the University of Cambridge in\n1728\nand, on\n23\nApril of that year, he was elected a member of Emmanuel College. In\n1736\nhe published\nThe Construction and Use of Spherical Maps, or Such as are Delineated upon Portions of a Spherical Surface\nin the\nPhilosophical Transactions\nof the\nRoyal Society\n. His article begins:-\nGeographical maps and hydrographical charts, though they are representations of a convex spherical surface, yet were first delineated upon planes, as being the most easy and obvious, though not the most natural and accurate representations: And they will be sufficiently near the truth when the part of the Earth or Seas to be described is not of a very large extent. Such as these have been usually called chorographical and topographical maps; but when the map is any thing general, or is to contain any large tract of the Earth or Seas, suppose\n(\nfor instance\n)\none of the four quarters of the World as they are called; then, when they are projected, or represented upon a plane, the parts must necessarily be distorted, one way contracted beyond the truth, another way dilated, so as to give no just idea of the whole.\nAfter explaining the problems this causes in teaching young people, he goes on to describe a method of projecting a spherical surface onto a plane which is \"best adapted for conveying just notions to young minds, and for preventing all false conceptions and prepossessions.\" He ends the paper by describing what he calls the 'British hemisphere':-\n... adapted to the meridian and horizon of London, and exhibits one half of the Earth's surface as it lies round about this city ...\nColson continued as master at the Sir Joseph Williamson Mathematical School in Rochester and in\n1737\nhe taught David Garrick\n(1717\n-\n1779)\nwho went on to became a famous actor, producer, dramatist, and poet. In March\n1739\nColson left Rochester when he was appointed as Taylor lecturer at Sidney Sussex College, Cambridge.\nRouse Ball\nwrites in\n[\n3\n]\nthat Colson:-\n... having acquired some reputation as a successful teacher was recommended by Robert Smith\n(1689\n-\n1768)\n, the master of Trinity, to come to Cambridge and lecture there. He had rooms in Sidney, but apparently was not a member of that college ...\nIn April\n1739\n, the fourth Lucasian professor of mathematics at Cambridge,\nNicholas Saunderson\n, died. There appears to have been only two candidates to fill the vacant Lucasian chair, Colson and\nAbraham De Moivre\n. William Cole, the antiquary, wrote\n[\n2\n]\n:-\n[\nColson\n]\nwas a plain, honest man, of great industry and assiduity, but the university was much disappointed in its expectations of a professor that was to give credit to it by his lectures. He was opposed by old Mr\nDe Moivre\n, who was brought down to Cambridge and created M.A. when he was almost as much fit for his coffin; he was a mere skeleton, nothing but skin and bones, and looked wretchedly ... .\nA similar description of his appointment is given by\nRouse Ball\n[\n3\n]\n:-\nWhen a candidate for the Lucasian chair in\n1739\n[\nColson\n]\nwas  opposed by\nAbraham de Moivre\n, who was admitted a member of Trinity College and created M.A. to qualify him for the office. Robert Smith really decided the election, and as\nde Moivre\nwas very old and almost in his dotage he pressed the claims of Colson. The appointment\n[\nof Colson\n]\nwas admitted to be a mistake ...\nCole also describes the time following Colson's appointment\n[\n2\n]\n:-\nHe was a very worthy, honest man; an old bachelor when he was first brought to Cambridge through the interest of Dr Smith, master of Trinity College, when he had chambers in Sidney College, and read lectures there in the mathematics. He was an humourist and peevish, and afterwards removed to an house in Jesus Lane, where a sister lived with him very uncomfortably, as their tempers did not suit.\nColson produced no further original mathematics, but did make a number of important translations and assisted in the publication of several texts. Robert Bruen writes\n[\n5\n]\n:-\nHis most notable translation is probably that of\nNewton\n's work. In\n1736\n, he published an English version of\nNewton\n's 'Method of Fluxions and Infinite Series' originally written in Latin. In the same year he also published the English edition of 'Geometrica Analytica' by\nNewton\n. Each of these translations contained substantial commentary by Colson. In\n1761\n, an edition of\nNewton\n's 'Arithmetica universalis' was published in Latin with Colson's commentary, also in Latin. Colson showed himself to be ahead of his times by his translation of 'Analyitical Institutions' written originally in Italian by Donna\nMaria Agnesi\n, a professor of mathematics and philosophy at the University of Bolgna. It was the first book on calculus written by a woman, and Colson intended the translation to make calculus more accessible to women. His manuscript was not published until\n1801\n, forty-one years after his death. He had also prepared a manuscript, with the same idea in mind, called 'The Plan of the Lady's System of Analytics', which still remains in the Cambridge Library.\nAlthough, as we have seen, many consider Colson to be a poor appointment to the Lucasian chair, Johnson\n[\n8\n]\nis much more positive:-\nFew had much good to say of the appointment, and history has been content to see no great worth in it. That valuation may, in my opinion, deserve to be somewhat modified in virtue of his appreciation of the teaching needs of students. Colson had published\nNewton\n's\n(\nLatin\n)\nFluxions in English, in\n1736\n.\nAgnesi\n's volumes afforded him an excellent opportunity to display the value of fluxions and, particularly in Volume\n2\n, he demonstrated many examples of what could be achieved, rendering\nAgnesi\n's differentials as Newtonian fluxions ... It seems probable that Colson's two works of translation, of\nNewton\nand\nAgnesi\n, well served English students at large, and, despite opinions to the contrary, also provided a fluxional tool adequate for research. This is indicated by the papers of the virtually unknown William Moore writing about rocket flight nearly five years before the start of the Cambridge Analytical Society.",
  "math_areas": [
    "Calculus"
  ]
}