{
  "nome_completo": "John Greaves",
  "nome_curto": "John Greaves",
  "ano_nascimento": "1602",
  "ano_morte": "1652",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Greaves_John/",
  "lugar_nascimento": "Alresford, Hampshire, England",
  "lugar_morte": "London, England",
  "biografia": "John Greaves\n' parents were Sara and John Greaves. John senior was a priest who was both the rector of Colmer and also a respected schoolteacher. John junior, the subject of this biography, was the eldest of his parents four children, the others being Nicholas, Thomas and Edward. All of them achieved distinction in their own field.\nOne advantage in this period of having a father who was an excellent teacher was that he was able to get the best start in terms of education. Taught by his father until his death in\n1616\n, John was able to enter Balliol College, Oxford, in the following year aged fifteen. After studying for six years, he graduated in\n1623\n, then was elected a fellow at Merton College, Oxford, in the following year. At Merton he became a friend of the Savilian professors\nHenry Briggs\nand John Bainbridge. His interests were broad and in addition to studying mathematics, he had studied Persian, reading Persian astronomy texts in the original language. He also studied Greek and Arabic prompted by his broad interests.\nWith support from John Bainbridge and\nPeter Turner\n, Greaves was appointed as Professor of Geometry at Gresham College, London, in February\n1631\n. He was able to retain his fellowship at Merton College, Oxford. His main scientific aim was the\n[\n5\n]\n:-\n... practical and sober project of standardising and synchronising the weights and measures of all ancient and modern nations.\nHis desire to find out about measurements in the ancient world led him to plan visits to Italy and Egypt, where he wanted to make measurements of the pyramids. As Shalev puts it\n[\n5\n]\n:-\nIt is metrology which fuelled Greaves's fascination with ancient monuments, and with the Great Pyramid above all.\nGreaves set out on his travels in\n1637\n, along with Edward Pococke. He took with him the instruments he required for his task\n[\n1\n]\n:-\nFor his astronomical observations he recognized that for accuracy he had to have large instruments, some of which were produced for him by Elias Allen; the degree arcs of the large brass sextant and quadrant were divided with transversals, and a cross-staff was\n10\nfeet long with\n10\n000\ndivisions.\n(\nSeveral of the instruments are now in the Museum of the History of Science at Oxford University.\n)\nWell, it is not completely true to say that he took all the instruments he required for in the spring of\n1638\nhe wrote from Istanbul\n(\nConstantinople\n)\nto Peter Turner at Merton College, Oxford\n[\n5\n]\n:-\n... I wonder that in so long time since I left England I should neither have received my brass quadrant which I left to be finished for my journey thither, nor any notice of it ... I agreed with Mr Allen upon price and the time that he should finish it. If he has failed me, he has done me the greatest injury that can be.\nHe made two visits to Italy, visiting there on both his outward and on his return journey\n[\n5\n]\n:-\nIn Rome he measured, among many other ancient structures, Cestius's Pyramid and St Peter's basilica. In Lucca, deeply impressed, he counted his paces around the beautiful city walls. In Sienna he observed together with a mathematical professor\n[\nBenedetto Giovanelli Orlandi\n]\none of the Sidera Medicea\n[\na moon of Jupiter\n]\nusing a glass.\nTwo of the projects that he attempted were suggested to him by John Bainbridge. One of these was to measure the latitudes of Istanbul, Rhodes\n(\nwhich he visted on his way from Istanbul to Alexandria on his way to the Pyramids\n)\nand Alexandria. This Greaves did successfully, except that he unfortunately miscalculated the latitude of Rhodes. The other Bainbridge project was more ambitious. It involved arranging for simultaneous observations of a lunar eclipse in Baghdad, Istanbul, Smyrna, and Alexandria. This Greaves attempted to organise while he was in Istanbul, but although he carried out the necessary observations of the eclipse in Istanbul himself, he did not manage to arrange the simultaneous observations.\nThe most important aspect of his travels, in Greaves's way of thinking, was to make precise measurements of the pyramids in an attempt to study the weights and measures of the ancients\n[\n5\n]\n:-\nHe gave his own\n[\nmeasurements\n]\n, obtained \"by experience and by diligent calculation,\" using \"an exquisite radius of ten feet,\" \"most accurately divided\". ... in the second gallery he took his measures as precisely as he could, \"judging this to be the fittest place for the fixing of measures for posterity. A thing which has been much desired by learned men, but the manner how it might be exactly done has been thought of by none.\"\nHe left Egypt through Alexandria, returning to Italy where he visited Florence, Rome, and Naples making astronomical and magnetic observations there. By early in the year\n1640\nGreaves had returned to London but he was dismissed from his Gresham professorship for having neglected the duties of the position. However, in\n1643\nhe was appointed to the more prestigious position of Savilian professor of astronomy at Oxford. In\n1646\nhe published\nPyramidographia, or a Description of the Pyramids in Egypt\n. This was a scholarly work which contained the measurements he had made of the pyramids. But it contained much more, for it was a deep archaeological study based on all the written sources that he could find, including Arabic, Persian and Greek manuscripts he had collected on his travels. He\n[\n5\n]\n:-\n... identified the pyramids' builders, established the chronology and history of their construction and use, and described their physical attributes.\nGreaves published an edition of Bainbridge's\nCanicularia\nin\n1648\nadding observations which had been made by\nUlugh Beg\n. However, Greaves was a supporter of the King, and as a Royalist he was in trouble after the events of the civil war. Charles I suffered defeats in\n1644\n-\n45\nand fled to Scotland. However he was handed over to the English Parliament in\n1646\n, escaped in\n1647\n, only to be recaptured in the following year. In November of\n1648\nOxford was visited by representatives of Cromwell's parliamentary party with the purpose of ensuring that the scholars in post there were loyal to Parliament. Greaves was dismissed from the Savilian chair but he was not too unhappy as it was given to his friend\nSeth Ward\n. He also lost his fellowship at the same time. Greaves went to London where he continued his research into Egyptology, staying with John Marsham who was himself an expert Egyptologist. The loss of his Oxford positions was not a great tragedy since he had adequate financial resources to live in comfort.\nIn\n1649\nhe published\nA Discourse of the Roman Foot, and Denarius; from whence, as from two Principles, the Measures and Weights used by the Ancients may be deduced\n. In the same year he published\nElementa Linguae Persicae\n. In the latter part of\n1651\nhe married, something he could not have done had he retained his fellowship. His wife Elizabeth Gibbon was from Bishopstone, Kent. Greaves died about a year later. He was buried in St Benet Sherehog, London.",
  "math_areas": [
    "Geometry"
  ]
}