{
  "nome_completo": "John Williamson",
  "nome_curto": "John Williamson",
  "ano_nascimento": "1901",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Williamson/",
  "lugar_nascimento": "Kinross, Scotland",
  "lugar_morte": "Baltimore, USA",
  "biografia": "John Williamson\nwas born in The Manse, Kinross, where his father was the Presbyterian minister. He attended the Edinburgh Academy from\n1912\nto\n1919\n. He sat the Leaving Certificate examinations passing Mathematics, Latin, Greek, French, and English at Higher grade. After having passed the Preliminary Examination, Williamson first matriculated at the University of Edinburgh in October\n1919\n.\nAs an undergraduate at Edinburgh, Williamson studied Ordinary Mathematics, Natural Philosophy and Greek in session\n1919\n-\n20\n. His performance was outstanding and he was awarded the Bruce of Grangehill Bursary in June\n1920\n. In his second session he studied Intermediate Honours Mathematics, Dynamics, and General Physics. He also took the Intermediate Honours course on Heat in Spring\n1921\n, the Intermediate Honours course on Electricity in Summer\n1921\n, and Ordinary Philosophy. Again his performance was outstanding and he was awarded the Horsliehill Bursary in June\n1921\n. In session\n1921\n-\n22\nhe took Advanced Mathematics, Electricity I, Waves, Dynamics, Heat, and Electricity II. He graduated M.A. with First Class Honours in Mathematics and Natural Philosophy on\n13\nJuly\n1922\n.\nHe was appointed as a Lecturer in Mathematics at the University of St Andrews but, on the award of a Commonwealth Scholarship, he went to Chicago in\n1925\n. After studying with\nL E Dickson\nand\nE H Moore\n, he was awarded a Ph.D. by Chicago in\n1927\nfor his thesis\nConditions for Associativity of Division Algebras Connected with Non-Abelian Groups\n. He then returned to his lectureship at the University of St Andrews.\nTurnbull\nwrites\n[\n1\n]\n:-\nHe brought back to Scotland the fruits of what\nWedderburn\nhad taken to America which had inspired\nDickson\nand formed the central theme of his lecture course at Chicago. Williamson was probably the first to lecture in Scotland\n(1927)\nupon algebras and their arithmetics: his interest in this led to original contributions in the region of division algebras.\nWilliamson was elected a Fellow of the\nRoyal Society of Edinburgh\non\n5\nMarch\n1928\nhaving been proposed by\nHerbert Westren Turnbull\n, Sir\nEdmund Taylor Whittaker\n, Ralph Allan Sampson, and\nCharles Glover Barkla\n.\nWilliamson left St Andrews when he accepted a Associate Professorship in Mathematics at Johns Hopkins University in Baltimore, USA. The announcement in the January\n1929\npart of the\nAmerican Mathematical Monthly\nreported:-\nDr John Williamson has been appointed associate in mathematics at Johns Hopkins University.\nOn\n1\nFebruary\n1924\n, when he was a Lecturer in Mathematics at the University of St Andrews, Williamson joined the\nEdinburgh Mathematical Society\n. He read the paper\nOn the Linear Complexes belonging to the Invariant System of Three Quadrics\nto the meeting of the Society on Friday\n11\nJanuary\n1924\n. It was at this meeting that he was proposed for membership, which was confirmed at the next meeting. Williamson read the paper\nThe irreducible covariants belonging to the concomitant system of three quadrics\nto the meeting of the Society in St Andrews on Saturday\n14\nJune\n1924\n. At the meeting on Friday\n16\nJanuary\n1925\na joint paper by Williamson and\nTurnbull\nOn the general invariant theory of two quadratics in n variables\nwas read.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n.\nWilliamson married Lydia Stevenson, who had been a student at St Andrews.\nwrites:-\nHis early death in\n1949\n, due to heart failure as he was returning from church one Sunday evening, has taken away one who came to be regarded in America as a leading exponent of the theory of matrices. Throughout his life he was devoted to teaching and mathematical research, producing an impressive stream of papers, on invariants, algebras and matrices. The general trend in this programme was to pass from the ordinary field of complex numbers to more restricted and specialised fields.\nAlso\n[\n1\n]\n:-\nIn Scotland we remember him as a cheerful and generous colleague, an admirable lecturer and a welcome collaborator in research: to his work he brought perseverance, thoroughness and care as the background to results of considerable merit and originality.\nA list of some of Williamson's papers is at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra"
  ]
}