{
  "nome_completo": "John Arthur Todd",
  "nome_curto": "John Todd",
  "ano_nascimento": "1908",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Todd/",
  "lugar_nascimento": "Liverpool, England",
  "lugar_morte": "Croydon, England",
  "biografia": "John Todd\n's father was John Arthur Todd\n(\nborn in Bradford, Yorkshire  about\n1880)\nwho was a Science Teacher and Demonstrator working for Liverpool City Council. His mother was Agnes Todd\n(\nborn in Bingley, Yorkshire about\n1878)\n.\nJohn Todd was educated at Liverpool Collegiate School and, having sat the scholarship examination for Cambridge, he was awarded an entrance scholarship to Trinity College. Entering Trinity in October\n1925\nhe achieved distinction in an undergraduate career which ended with his graduation in\n1928\n.\nAfter graduation Todd remained at Trinity to study for his doctorate in geometry under\nH F Baker\n's supervision. He was supported by a research scholarship and, in\n1930\n, he was awarded the highly prestigious Smith's Prize. Among his fellow students at Cambridge at this time were a number of others studying geometry including\nP du Val\n,\nH S M Coxeter\nand\nW L Edge\n.\nAfter an impressive prize winning record Todd hoped for a Research Fellowship at Trinity but he failed in three attempts, on one occasion losing out to\nCoxeter\nwho won the Fellowship.\nDisappointed at his failure to win the Fellowship, Todd left Cambridge and accepted\nMordell\n's offer of an assistant lectureship at the University of Manchester in\n1931\n. An important year for Todd's mathematical development was the session\n1933\n-\n34\nwhich he spent at Princeton on a Rockefeller Scholarship.\nLefschetz\nproved the major influence on Todd during this year in the United States, and this broadened Todd's geometrical interests beyond the classical approach he had learnt under\nBaker\n.\nIn until\n1937\nTodd was appointed a lecturer at Cambridge.\nBaker\nhad retired from the Lowndean Chair in\n1936\nand the chair had been filled by\nHodge\n. Todd and\nHodge\nbegan to change the geometry at Cambridge to areas that were then of great interest internationally. However the outbreak of World War II meant that their reforms had to be delayed. Sadly, by the time peace had returned and progress could recommence, Todd was no longer a young reformer.\nIn\n1948\nTodd had been elected a Fellow of the\nRoyal Society of London\nand, given his long association with Trinity College, it seemed inconceivable that he would not be elected a Fellow of the College. Despite strong backing by mathematicians in the College, Todd failed to on a number of occasions to be elected. As\nAtiyah\nwrites in\n[\n1\n]\n:-\nUnfortunately, opposition in other quarters, based no doubt on the perception of Todd as socially gauche, was too strong.\nBy\n1958\ndisillusioned with his treatment by Trinity, Todd went to Downing College. He became a reader in\n1960\nand taught in Cambridge until he retired in\n1973\n. His time at Downing became a happier period in his life as the following extract from the Downing College Magazine indicates:-\nWhen first he arrived ... he was withdrawn and difficult to get to know; perhaps his essentially donnish and reclusive nature had not been helped in that regard by Trinity's not having embraced its own. But ... he grew into an active and genuinely loved person. To his pupils, we think he seemed a benevolent if mildly austere godfather, complete, or perhaps replete, with pipe and moustache. ... He needed friendship; he found it and gave it as a Fellow. ... Every well-equipped College should have a John Todd and we were privileged to have had him and to have enjoyed his company.\nAtiyah\nin\n[\n1\n]\ndivides Todd's mathematical interests into\ninvariant theory\n,\ngroup theory\nand canonical systems. He writes:-\nIn each case there is a major algebraic component but, as represented in Todd's work, the essential insight, interest and emphasis was on the geometric meaning behind the formula. Todd was a superb technician and manipulator of formulae but he also brought to bear a keen appreciation of the underlying geometry.\nTodd generalised the arithmetic genus and the invariants of the canonical system on an algebraic variety to a system of invariants of every codimension. This work is the origin of the Todd genus and Todd polynomials which were named after him. Todd polynomials, and certain other closely related polynomials, are much studied today and have played a major role in the study and classification of\nmanifolds\n.\nIn group theory Todd provided, certainly according to\nCoxeter\n, the main contribution to their joint work on the Todd-\nCoxeter\nprocedure which they published in\n1936\n. The procedure, today much used in computer implementations, enumerates the cosets of a\nsubgroup\nof finite index in a\nfinitely presented group\n.\nCoxeter\nexplained to me\n[\nEFR\n]\nonce how Todd used the back of old rolls of wallpaper on which to enumerate cosets which he could do at the rate of about\n200\nan hour. The Todd-\nCoxeter\nprocedure became the most fundamental idea in the development of computational group theory yet the authors found difficulty in getting their paper published. Certainly several referees failed to recognise the importance of this new idea.\nI\n[\nEFR\n]\ndo recall one occasion which saddened me greatly. It was at a\nBritish Mathematical Colloquium\n(\nTodd attended the Colloquium for each one of its first\n25\nyears\n)\nwhere Todd talked on\nMathieu\ngroups, a subject to which he made considerable contributions. Some young research students in the audience heckled Todd, presumably they considered his mathematics old fashioned.\nAfter Todd retired, to the surprise of his colleagues, he married. He also seemed to give up his mathematical work at that time but he had other interests to occupy his time such as stamp collecting and music.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}