{
  "nome_completo": "John George Brotchie Meiklejohn",
  "nome_curto": "John Meiklejohn",
  "ano_nascimento": "1872",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meiklejohn/",
  "lugar_nascimento": "Weydale, Thurso, Caithness, Scotland",
  "lugar_morte": "Dundee, Scotland",
  "biografia": "John Meiklejohn\n's father was  James Meiklejohn\n(\nborn in Dunnet, Caithness about\n1827)\nwho was a farmer. His mother was  Janet Meiklejohn\n(\nborn in Walls, Orkney about\n1831)\n. He had several older siblings: Elizabeth\n(\nborn about\n1857)\n, Donald\n(\nborn about\n1858)\n, James\n(\nborn about\n1859)\n, Margaret\n(\nborn about\n1861)\n, Janet\n(\nborn about\n1864)\n, Mary Ann\n(\nborn about\n1866)\n, William\n(\nborn about\n1868)\nand Sinclair\n(\nborn about\n1870)\nand one younger brother, David\n(\nborn about\n1875)\n.\nJohn Meiklejohn attended Weydale Public School for five years, followed by the Miller Institution for four and a half years. He sat the Preliminary Examinations of Thurso School Board obtaining passes in Higher Mathematics, Latin, and English in\n1892\n, also passing Lower Greek in the same year. After having passed the Preliminary Examination he first matriculated at Edinburgh University in October\n1892\n. It is perhaps worth noting that Meiklejohn did not seem particularly fond of his middle names since he gave 'John Meiklejohn' as his 'Name in full' when he matriculated.\nHe went to the University of Edinburgh to study classics and in his first session studied Ordinary Latin and Greek. However, after taking one of\nChrystal\n's Mathematics classes he became a mathematician. He was awarded an M.A. in\n1898\nwith First Class Honours in Mathematics and Natural Philosophy. Following this, he was appointed as an Assistant Master at Dundee High School. In\n1902\nhe was promoted to Head of Mathematics at the School, a post which he held until he retired in\n1938\n. Henry Jack writes\n[\n1\n]\n:-\nAs a teacher he was supreme.\nSir Edmund Whittaker\nonce told the present writer that he was the best teacher of Mathematics in the East of Scotland. If there were any doubts as to his rapid promotion to the headship after only four years of teaching, these were soon dispelled, for three years later there began an almost unbroken sequence of highly-placed John Welsh Mathematical Bursars at his old University. His outstanding success as a teacher depended on three things -\n(1)\nhe was a first-class mathematician with a great love for his subject;\n(2)\nhe prepared every lesson with meticulous care;\n(3)\nhe was a strict disciplinarian.\nMeiklejohn joined the\nEdinburgh Mathematical Society\nin December\n1898\n, in the year in which he graduated from Edinburgh University.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n.\nAs to his hobbies,\nHenry Jack\nwrites\n[\n1\n]\n:-\nMeiklejohn was a keen swimmer all his life, and a month of every summer was spent in exploring some new part of the Highlands and Islands, either on foot or on cycle.",
  "math_areas": []
}