{
  "nome_completo": "John Landen",
  "nome_curto": "John Landen",
  "ano_nascimento": "1719",
  "ano_morte": "1790",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Landen/",
  "lugar_nascimento": "Peakirk (near Peterborough), England",
  "lugar_morte": "Milton (near Peterborough), England",
  "biografia": "John Landen\n's mother was Elizabeth Cole and his father was Matthew Landen. John trained to become a surveyor and practised that occupation in Peterborough from\n1740\nto\n1762\n. After\n22\nyears as a surveyor he took up a position as land agent to Earl Fitzwilliam on his estate at Milton, near Peterborough. He was elected a Fellow of the\nRoyal Society\non\n16\nJanuary\n1766\n. He continued to work for William Fitzwilliam until\n1788\nwhen he had to give up since by this time he was suffering the effects of a painful illness. He had married Elizabeth and they had two daughters. His wife's death occurred shortly after he gave up his position as land agent and only a short time before his own death.\nLanden was never a professional mathematician and his interest in mathematics was for him a leisure activity. He began contributing to the mathematical problem section of the\nLadies diary\nfrom\n1744\nsoon after he began working as a surveyor. In\n1754\nhe published the first of his eight articles in the\nPhilosophical Transactions of the Royal Society\nand in the following year he published\nMathematical Lucubrations\n. He sent his results on making the differential calculus into a purely algebraic theory to the\nRoyal Society\n.\nLacroix\ndiscussed this work in\nTraité Du calcul différentiel\nwhere he stated that Landen was the first to present calculus in a purely algebraic setting. Landen's work appeared as\nA Short Discourse Concerning the Residual Analysis\npublished in\n1758\nand, in a more complete form, in\nResidual analysis\nwhich was published in\n1764\n. His ideas on this topic were later taken up by\nLagrange\nalthough he describes Landen's contribution as an unsophisticated early attempt.\nLanden investigated the dilogarithm in\n1760\n, about the same time as\nEuler\n, and introduced the trilogarithm. The trilogarithm was studied further by\nSpence\naround\n1809\nand\nKummer\naround\n1840\n. Landen wrote on dynamics, summation of series and an important transformation giving a relation between\nelliptic functions\n. This last result, known by his name, expressed a hyperbolic arc in terms of two elliptic ones. It was published in the\nPhilosophical Transactions of the Royal Society\nin\n1775\n. The paper\n[\n7\n]\ndescribes this result in detail. Moll writes in the introduction to\n[\n7\n]\n:-\nThe problem of rectification of conics was a central question of analysis in the\n18\nth\ncentury.\n[\nWe\n]\ndescribe Landen's work on rectifying the arc of a hyperbola in terms of an ellipse and a circle. Naturally, Landen's language is that of his time, in terms of fluents and fluxions, and his arguments are not rigorous in the modern sense. The main result ... is a special relation between the length of an ellipse, the length of a hyperbolic segment, and the length of a circle. The proof is based on a generalization of\nEuler\n's formula for the lemniscatic curve ...\nApplications of this result appeared in Landen's\nMathematical memoirs\nof\n1780\n. He also solved the problem of the spinning top and explained\nNewton\n's error in calculating its precession. He put these results into a second volume of\nMathematical memoirs\nwhich was published only days before his death. He also corrected\nStewart\n's result on the distance of the Sun from the Earth in\n1771\n.\nIn\n[\n4\n]\nhis achievements are summed up as follows\n(\na similar passage occurs in\n[\n2\n]\n)\n:-\nThough foreigners gave him a high rank among English analysts, he failed to develop and combine his discoveries. He led a retired life, chiefly at Walton in Northamptonshire. Though humane and honourable, he was too dogmatic in society.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}