{
  "nome_completo": "John Hellins",
  "nome_curto": "John Hellins",
  "ano_nascimento": "1749",
  "ano_morte": "1827",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hellins/",
  "lugar_nascimento": "North Tawton, Devon, England",
  "lugar_morte": "Potterspury, Northamptonshire, England",
  "biografia": "John Hellins\nwas born into a poor family. His father worked as a labourer at Ashreigney, a small village about\n5\nkm west of Chulmleigh, in Devon. Both these places are around\n20\nkm south of Barnstaple. His date of birth is unknown but his age at death, namely\n78\n, is recorded in the Potterspury Burial records. R Polwhele describes Hellins' education\n(\nor perhaps, more accurately, we should say lack of education\n)\nin\n[\n6\n]\n:-\n... he learned to write by himself; but, be that as it may, his education at best did not extend beyond the first four rules of arithmetic. By occasionally looking on, he literally stole the art of a cooper, and worked at that business as a livelihood till about twenty years old.\nIn fact he worked as a cooper, making and repairing wooded casks and barrels, at Chumleigh. However, during these years he taught himself elementary mathematics and this led to his finding work as a school teacher\n[\n6\n]\n:-\nHaving in the meantime purchased Emerson, and some other mathematical books, without the help of a master, he made himself well acquainted with algebra, etc. Showing his books one day to a schoolmaster of the vicinity, the latter, on conversation with him, perceived more learning than generally falls the lot of a maker of pails, and being asked, soon after, whether he knew of any young man fit to teach writing etc in a small neighbouring school then vacant, he recommended our cooper.\nIn fact the small school where Hellins had become a master was at Bishop's Tawton, a village close to the south side of Barnstaple. While he was teaching at this school, he became friendly with Malachy Hitchins\n(1741\n-\n1809)\n, who had done computations for\nNevil Maskelyne\nworking in his own home and later had worked at Greenwich for a while as his assistant. At the time when he became friendly with Hellins, Hitchins had taken holy orders and left Greenwich to become vicar of Hennock, Exeter. He was later vicar of both St Hilary, Cornwall, and of Gwinear. He recommended Hellins to\nMaskelyne\n, suggesting that he would make an excellent assistant. In\n1773\nHitchins became\nMaskelyne\n's assistant at the Royal Observatory at Greenwich. He was given board and lodgings at the Royal Observatory and, in addition, an annual salary of £\n86\n. He continued to study, however, making up for the schooling he had missed\n[\n6\n]\n:-\nWhile his nights were engaged at\n[\nthe Royal Observatory at Greenwich\n]\nin stargazing for Dr\nMaskelyne\n, he was employed by day in studying Latin and Greek, which at length enabled him to get into holy orders.\nNote that Hitchins had also taken holy orders while he was\nMaskelyne\n's assistant. From\n1779\nHellins served as a Curate at the village of Constantine, Cornwall,\n8\nkm south west of Falmouth and less than\n40\nkm from Land's End. In\n1780\nhis paper\nTheorems for computing logarithms\nwas published in the\nPhilosophical Transactions\nof the\nRoyal Society\n, having been communicated by\nNevil Maskelyne\n. We learn something of Hellins' character from this paper so we quote the introduction and the conclusion\n[\n4\n]\n:-\nThe utility of logarithms is so well known, that much need not be said upon it. In our days he must be a slender mathematician who does not know that they are useful, not only in trigonometry, navigation, astronomy, the calculation of compound interest and annuities, but also in the finding of fluents, and the summation of infinite series. Some of the greatest mathematicians that this kingdom ever produced, as Sir\nIsaac Newton\n, Dr\nHalley\n, Mr\nCotes\n, and Mr\nSimpson\n, have thought it not beneath them to improve the construction of logarithms, which strongly argues the utility of those artificial numbers, and may suggest to us that the construction of them cannot be much further improved. Now, although we should be very diffident in our expectations of improvement in any part of the mathematics after it has been handled by such great men, yet, if the method of computing be in general long and tedious, or if there still remain any particular difficulty, I believe, no good reason can be given why every attempt to abridge the one, or remove the other, should be discouraged.\nAfter giving his theorems, Hellins then writes:-\nThe observations and reasonings which led me to the discovery of the above theorems, I imagine, need not here be mentioned. Such as they are, I beg leave to lay them before the candid an skilful in these matters, in hopes that the invention will appear to them, as it does to me, to be a useful one. It has, indeed, been objected, by a gentlemen of my acquaintance, that improvements in the construction of logarithms cannot now be useful, because logarithms are already constructed. I answer, that argument, if it has any weight, operates equally against Sir\nIsaac Newton\n, Dr\nHalley\n, Mr\nCotes\n, and Mr\nSimpson\n, and several other ingenious mathematicians; for logarithms were invented, and tables of them constructed, before their time; so that if I should be thought to have misemployed my time in improving the computation of these artificial numbers, I have some consolation in thinking that I have therein followed the example of the very respectable company just mentioned. I trust, however, that, with mathematicians, every improvement in calculation will be acceptable.\nIn\n1783\nHellins left Constantine to take up a position at Easton Neston, near Towcester, Northamptonshire, as a teacher of mathematics to Lord Pomfret's children, George and Thomas Fermor\n(\nwho were fifteen and thirteen\n)\n. In\n1789\nhe returned to a position in the Church, being appointed as a Curate in Green's Norton, south of Northampton, and just to the north of Towcester. This was close to where he had taught Lord Pomfret's children for the Easton Neston estate and Green's Norton are on opposite sides of Towcester. On\n4\nJuly\n1789\nhe was admitted to Trinity College, Cambridge as a 'Ten-year man' to undertake work in divinity for a B.D. which he was awarded in\n1800\n. A 'Ten-year man' was a mature student who could proceed to the divinity degree without first obtaining a B.A. Hellins only held the curacy at Green's Norton for a year before he was presented as vicar at Potterspury, Northamptonshire, by Henry Bathurst, the Second Earl Bathurst. On\n10\nNovember\n1794\nHellins married Anne Brock of North Tawton; they had one son.\nHellins published many papers; the following were all in the\nPhilosophical Transactions\nof the\nRoyal Society\n:\nA new method of finding the equal roots of an equation by division\n(1782)\n;\nDr Halley's method of computing the quadrature of the circle improved; being a transformation of his series for that purpose, to others which converge by the powers of\n60\n(1794)\n;\nMr Jones' computation of the hyperbolic logarithm of\n10\ncompared\n(1796)\n;\nA method of computing the value of a slowly converging series, of which all the terms are affirmative\n(1798)\n;\nAn improved solution of a problem in physical astronomy, by which swiftly converging series are obtained, which are useful in computing the perturbations of the motions of the Earth, Mars, and Venus, by their mutual attraction\n(1798)\n;\nA second appendix to the improved solution of a problem in physical astronomy\n(1800)\n; and\nOn the rectification of the conic sections\n(1802)\n. He was elected a fellow of the\nRoyal Society\nin\n1796\nand, mainly for his\n1798\npaper mentioned above, he received the Copley Medal from the\nRoyal Society\nin\n1798\n. Again to illustrate Hellins' contributions, we quote from his\n1802\npaper whose title we gave above:-\nThe utility of hyperbolic and elliptic arches, in the solution of various problems, and particularly in the business of computing fluents, has been shown by those eminent mathematicians,\nMaclaurin\n,\nSimpson\nand\nLanden\n; the last of whom has written a very ingenious paper on hyperbolic and elliptic arches, which was published in the first volume of his 'Mathematical Memoirs', in the year\n1780\n. I have indeed heard that some improvement in the rectification of the ellipse and hyperbola had been produced, and some of the same theorems discovered by a learned Italian many years before Mr\nLanden\n's 'Mathematical Memoirs' were published; but, as Mr\nLanden\nhas declared that he had never seen or heard any thing of that work, and as various instances are found of different men discovering the same truth, without knowledge of each other's works, I see no reason for disbelieving him. But I have seen no writings on this subject which contain anything more than what is very common, besides those of the three gentlemen above mentioned, and Dr\nWaring\n's 'Meditationes Analyticae'; and, while I have no inclination to detract from their merits, I may be allowed to say that I have borrowed nothing from their works.\nHellins also published articles in other journals, for example in the\nBritish Critic\n, a quarterly church review journal established in\n1793\n. In this journal he published\nOn Mr Wales method of finding the longitude\nin\n1795\n. This was a commentary on William Wales\n(1734\n-\n1798)\nwork\nThe Method of Finding the Longitude by Timekeepers\n(1794)\n. He published\nOn Bishop Horsley's mathematical treatises\nin\n1803\n. This discussed treatises by Samuel Horsley\n(1733\n-\n1806)\nwho was a mathematician and bishop of Rochester from\n1792\n. Hellins published three articles in the\nBritish Critic\nentitled\nOn Donna Agnesi's 'Analytical Institutions'\nin\n1804\nand\n1805\n. In fact Hellins had edited the translation by Colson of\nMaria Gaetana Agnesi\n's\nInstituzioni analitiche ad uso della gioventù italiana\n. This English translation of the\n1748\nItalian work had been published in\n1801\n. Next he published,\nOn Keith's 'Trigonometry'\n, in the\nBritish Critic\nin\n1808\n, discussing\nAn introduction to the theory and practice of plane and spherical trigonometry\nby the English mathematician Thomas Keith\n(1759\n-\n1824)\n. Finally let us mention Hellins'\n1811\narticle\nOn F Baily's work on the 'Doctrine of Interest and Annuities'\nwhich discussed\nThe Doctrine of Interest and Annuities\n(1808)\nwritten by the astronomer Francis Baily\n(1774\n-\n1844)\nwho is famed for 'Baily's beads' observed during an eclipse of the Sun.\nDavis Gilbert, President of the\nRoyal Society\n, explained another aspect of Hellins' contributions in a tribute some months after he died\n(\nsee\n[\n5\n]\nand\n[\n2\n]\n)\n:-\nMr Hellins at one time computed for the National Almanac. He afterwards assisted at Greenwich. And, what is now perhaps almost unknown, he furnished the late Mr Windham with all the calculations and tables on which that gentleman brought forward his new military system, as Minister of War, in\n1806\n.\nJack Clamp writes in\n[\n3\n]\nabout Hellins' founding of a school in Potterspury during his time as the vicar there:-\nJohn Hellins carried out his work as a country vicar, and perhaps mindful of his own early years, in\n1817\nhe persuaded the local landowner, the\n4\nth\nDuke of Grafton to donate land and money to construct a school for the village. The school opened in March\n1817\nand was attended by about\n50\nboys - girls were not actually excluded, but none applied as they were apparently all too busy lace-making. The school was initially housed in a single room, but by October a new school building was under construction and in March\n1818\nHellins reported that the building was nearly ready to have glass installed in the windows. This building is still at the heart of John Hellins School today.\nToday the John Hellins School is a small primary school for children aged\n4\nto\n11\n, with around\n120\npupils, in Potterspury. It was named the John Hellins School in\n1990\n.\nHellins continued to serve as vicar of Potterspury until his death in\n1827\n. The parish church of St Nicholas, in Potterspury, contains a small white marble plaque in its North Aisle which reads:\nIn Memory of The Revd. John Hellins, B.D. & F.R.S.\nupwards of\n36\nyears Vicar of this parish,\nwho died April\n5\nth\n1827\naged\n78\nyears.\nof Anne Hellins his widow,\nwho died June\n3\nrd\n1827\n. Aged\n72\n.\nDavis Gilbert, President of the\nRoyal Society\n, spoke to the\nRoyal Society\nabout Hellins a few months after his death\n(\nsee\n[\n5\n]\nand\n[\n2\n]\n)\n:-\nJohn Hellins was one of those extraordinary men who, deprived of early advantages, have elevated themselves, by the force of genius and industry, to a level above most persons blessed with regular education. ... I have known Mr Hellins for above forty years, and I can testify to his virtues, It once happened that, through the late Dr\nMaskelyne\n, I had nearly obtained for him the Observatory at Dublin. The failure cannot, however, be lamented, since\nBrinkley\nwas appointed in his stead.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}