{
  "nome_completo": "John Stewart Bell",
  "nome_curto": "John Bell",
  "ano_nascimento": "1928",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bell_John/",
  "lugar_nascimento": "Belfast, Northern Ireland",
  "lugar_morte": "Geneva, Switzerland",
  "biografia": "John Bell\n's great achievement was that during the\n1960\ns he was able to breathe new and exciting life into the foundations of quantum theory, a topic seemingly exhausted by the outcome of the\nBohr\n-\nEinstein\ndebate thirty years earlier, and ignored by virtually all those who\nused\nquantum theory in the intervening period. Bell was able to show that discussion of such concepts as 'realism', 'determinism' and 'locality' could be sharpened into a rigorous mathematical statement, 'Bell's inequality', which is capable of experimental test. Such tests, steadily increasing in power and precision, have been carried out over the last thirty years.\nIndeed, almost wholly due to Bell's pioneering efforts, the subject of quantum foundations, experimental as well as theoretical and conceptual, has became a focus of major interest for scientists from many countries, and has taught us much of fundamental importance, not just about quantum theory, but about the nature of the physical universe.\nIn addition, and this could scarcely have been predicted even as recently as the mid-\n1990\ns, several years after Bell's death, many of the concepts studied by Bell and those who developed his work have formed the basis of the new subject area of quantum information theory, which includes such topics as quantum computing and quantum cryptography. Attention to quantum information theory has increased enormously over the last few years, and the subject seems certain to be one of the most important growth areas of science in the twenty-first century.\nJohn Stewart Bell's parents had both lived in the north of Ireland for several generations. His father was also named John, so John Stewart has always been called Stewart within the family. His mother, Annie, encouraged the children to concentrate on their education, which, she felt, was the key to a fulfilling and dignified life. However, of her four children - John had an elder sister, Ruby, and two younger brothers, David and Robert - only John was able to stay on at school much over fourteen. Their family was not well-off, and at this time there was no universal secondary education, and to move from a background such as that of the Bells to university was exceptionally unusual.\nBell himself was interested in books, and particularly interested in science from an early age. He was extremely successful in his first schools, Ulsterville Avenue and Fane Street, and, at the age of eleven, passed with ease his examination to move to secondary education. Unfortunately the cost of attending one of Belfast's prestigious grammar schools was prohibitive, but enough money was found for Bell to move to the Belfast Technical High School, where a full academic curriculum which qualified him for University entrance was coupled with vocational studies.\nBell then spent a year as a technician in the Physics Department at Queen's University Belfast, where the senior members of staff in the Department, Professor Karl Emeleus and Dr Robert Sloane, were exceptionally helpful, lending Bell books and allowing him to attend the first year lectures. Bell was able to enter the Department as a student in\n1945\n. His progress was extremely successful, and he graduated with First-Class Honours in Experimental Physics in\n1948\n. He was able to spend one more year as a student, in that year achieving a second degree, again with First-Class Honours, this time in Mathematical Physics. In Mathematical Physics, his main teacher was Professor Peter Paul Ewald, famous as one of the founders of X-ray crystallography; Ewald was a refugee from Nazi Germany.\nBell was already thinking deeply about quantum theory, not just how to use it, but its conceptual meaning. In an interview with Jeremy Bernstein, given towards the end of his life and quoted in Bernstein's book\n[\n1\n]\n, Bell reported being perplexed by the usual statement of the\nHeisenberg\nuncertainty or indeterminacy principle\n(\nΔ\nx\nΔ\np\n≥\nℏ\n\\Delta x \\Delta p ≥ \\hbar\nΔ\nx\nΔ\np\n≥\nℏ\n, where\nΔ\nx\n\\Delta x\nΔ\nx\nand\nΔ\np\n\\Delta p\nΔ\np\nare the uncertainties or indeterminacies, depending on one's philosophical position, in position and momentum respectively, and ℏ is the\n(\nreduced\n)\nPlanck\n's constant\n)\n.\nIt looked as if you could take this size and then the position is well defined, or that size and then the momentum is well defined. It sounded as if you were just free to make it what you wished. It was only slowly that I realized that it's not a question of what you wish. It's really a question of what apparatus has produced this situation. But for me it was a bit of a fight to get through to that. It was not very clearly set out in the books and courses that were available to me. I remember arguing with one of my professors, a Doctor Sloane, about that. I was getting very heated and accusing him, more or less, of dishonesty. He was getting very heated too and said, 'You're going too far'.\nAt the conclusion of his undergraduate studies Bell would have liked to work for a PhD. He would also have liked to study the conceptual basis of quantum theory more thoroughly. Economic considerations, though, meant that he had to forget about quantum theory, at least for the moment, and get a job, and in\n1949\nhe joined the UK Atomic Research Establishment at Harwell, though he soon moved to the accelerator design group at Malvern.\nIt was here that he met his future wife, Mary Ross, who came with degrees in mathematics and physics from Scotland. They married in\n1954\nand had a long and successful marriage. Mary was to stay in accelerator design through her career; towards the end of John's life he returned to problems in accelerator design and he and Mary wrote some papers jointly. Through his career he gained much from discussions with Mary, and when, in\n1987\n, his papers on quantum theory were collected\n[\n21\n]\n, he included the following words:-\nI here renew very especially my warm thanks to Mary Bell. When I look through these papers again I see her everywhere.\nAccelerator design was, of course, a relatively new field, and Bell's work at Malvern consisted of tracing the paths of charged particles through accelerators. In these days before computers, this required a rigorous understanding of electromagnetism, and the insight and judgment to make the necessary mathematical simplifications required to make the problem tractable on a mechanical calculator, while retaining the essential features of the physics. Bell's work was masterly.\nIn\n1951\nBell was offered a year's leave of absence to work with Rudolf Peierls, Professor of Physics at Birmingham University. During his time in Birmingham, Bell did work of great importance, producing his version of the celebrated CPT theorem of quantum field theory. This theorem showed that under the combined action of three operators on a physical event:\nP\nP\nP\n, the parity operator, which performed a reflection;\nC\nC\nC\n, the charge conjugation operator, which replaced particles by anti-particles; and\nT\nT\nT\n, which performed a time reversal, the result would be another possible physical event.\nUnfortunately Gerhard Lüders and\nWolfgang Pauli\nproved the same theorem a little ahead of Bell, and they received all the credit.\nHowever, Bell added another piece of work and gained a PhD in\n1956\n. He also gained the highly valuable support of Peierls, and when he returned from Birmingham he went to Harwell to join a new group set up to work on theoretical elementary particle physics. He remained at Harwell till\n1960\n, but he and Mary gradually became concerned that Harwell was moving away from fundamental work to more applied areas of physics, and they both moved to CERN, the Centre for European Nuclear Research in Geneva. Here they spent the remainder of their careers.\nBell published around\n80\npapers in the area of high-energy physics and quantum field theory. Some were fairly closely related to experimental physics programmes at CERN, but most were in general theoretical areas.\nThe most important work was that of\n1969\nleading to the Adler-Bell-Jackiw\n(\nABJ\n)\nanomaly in quantum field theory. This resulted from joint work of Bell and Ronan Jackiw, which was then clarified by Stephen Adler. They showed that the standard current algebra model contained an ambiguity. Quantisation led to a symmetry breaking of the model. This work solved an outstanding problem in particle physics; theory appeared to predict that the neutral pion could not decay into two photons, but experimentally the decay took place, as explained by ABJ. Over the subsequent thirty years, the study of such anomalies became important in many areas of particle physics. Reinhold Bertlmann, who himself did important work with Bell, has written a book titled\nAnomalies in Quantum Field Theory\n[\n10\n]\n, and the two surviving members of ABJ, Adler and Jackiw shared the\n1988\nDirac\nMedal of the International Centre for Theoretical Physics in Trieste for their work.\nWhile particle physics and quantum field theory was the work Bell was paid to do, and he made excellent contributions, his great love was for quantum theory, and it is for his work here that he will be remembered. As we have seen, he was concerned about the fundamental meaning of the theory from the time he as an undergraduate, and many of his important arguments had their basis at that time.\nThe conceptual problems may be outlined using the spin-\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nsystem. We may say that when the state-vector is\nα\n+\n\\alpha_{+}\nα\n+\n​\nor\nα\n−\n\\alpha_{-}\nα\n−\n​\nrespectively,\ns\nz\ns_{z}\ns\nz\n​\nis equal to\n1\n2\nℏ\n\\large\\frac{1}{2}\\normalsize \\hbar\n2\n1\n​\nℏ\nand\n−\n1\n2\nℏ\n-\\large\\frac{1}{2}\\normalsize \\hbar\n−\n2\n1\n​\nℏ\nrespectively, but, if one restricts oneself to the\nSchrödinger\nequation,\ns\nx\ns_{x}\ns\nx\n​\nand\ns\ny\ns_{y}\ns\ny\n​\njust do not have values. All one can say is that if a measurement of\ns\nx\ns_{x}\ns\nx\n​\n, for example, is performed, the probabilities of the result obtained being either\n1\n2\nℏ\n\\large\\frac{1}{2}\\normalsize \\hbar\n2\n1\n​\nℏ\nor\n−\n1\n2\nℏ\n-\\large\\frac{1}{2}\\normalsize \\hbar\n−\n2\n1\n​\nℏ\nare both\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n.\nIf, on the other hand, the initial state-vector has the general form of\nc\n+\nα\n+\n+\nc\n−\nα\n−\nc_{+}\\alpha_{+}+ c_{-}\\alpha_{-}\nc\n+\n​\nα\n+\n​\n+\nc\n−\n​\nα\n−\n​\n, then all we can say is that in a measurement of\ns\nz\ns_{z}\ns\nz\n​\n, the probability of obtaining the value of\n1\n2\nℏ\n\\large\\frac{1}{2}\\normalsize \\hbar\n2\n1\n​\nℏ\nis\n∣\nc\n+\n2\n∣\n|c_{+}^{2} |\n∣\nc\n+\n2\n​\n∣\n, and that of obtaining the value of\n−\n1\n2\nℏ\n-\\large\\frac{1}{2}\\normalsize \\hbar\n−\n2\n1\n​\nℏ\nis\n∣\nc\n−\n2\n∣\n|c_{-}^{2} |\n∣\nc\n−\n2\n​\n∣\n. Before any measurement,\ns\nz\ns_{z}\ns\nz\n​\njust does not have a value.\nThese statements contradict two of our basic notions. We are rejecting\nrealism\n, which tells us that a quantity has a value, to put things more grandly -- the physical world has an existence, independent of the actions of any observer.\nEinstein\nwas particularly disturbed by this abandonment of realism -- he insisted in the existence of an\nobserver-free realm\n. We are also rejecting\ndeterminism\n, the belief that, if we have a complete knowledge of the state of the system, we can predict exactly how it will behave. In this case, we know the state-vector of the system, but cannot predict the result of measuring\ns\nz\ns_{z}\ns\nz\n​\n.\nIt is clear that we could try to recover realism and determinism if we allowed the view that the\nSchrödinger\nequation, and the wave-function or state-vector, might not contain all the information that is available about the system. There might be other quantities giving extra information --\nhidden variables\n. As a simple example, the state-vector above might apply to an ensemble of many systems, but in addition a hidden variable for each system might say what the actual value of\ns\nz\ns_{z}\ns\nz\n​\nmight be. Realism and determinism would both be restored;\ns\nz\ns_{z}\ns\nz\n​\nwould have a value at all times, and, with full knowledge of the state of the system, including the value of the hidden variable, we can predict the result of the measurement of\ns\nz\ns_{z}\ns\nz\n​\n.\nA complete theory of hidden variables must actually be more complicated than this -- we must remember that we wish to predict the results of measuring not just\ns\nz\ns_{z}\ns\nz\n​\n, but also\ns\nx\ns_{x}\ns\nx\n​\nand\ns\ny\ns_{y}\ns\ny\n​\n, and any other component of\ns\ns\ns\n. Nevertheless it would appear natural that the possibility of supplementing the\nSchrödinger\nequation with hidden variables would have been taken seriously. In fact, though,\nNiels Bohr\nand\nWerner Heisenberg\nwere convinced that one should not aim at realism. They were therefore pleased when\nJohn von Neumann\nproved a theorem claiming to show rigorously that it is impossible to add hidden variables to the structure of quantum theory. This was to be very generally accepted for over thirty years.\nBohr\nput forward his\n(\nperhaps rather obscure\n)\nframework of\ncomplementarity\n, which attempted to explain why one should not expect to measure\ns\nx\ns_{x}\ns\nx\n​\nand\ns\ny\ns_{y}\ns\ny\n​\n(\nor\nx\nx\nx\nand\np\np\np\n)\nsimultaneously. This was his\nCopenhagen interpretation\nof quantum theory.\nEinstein\nhowever rejected this, and aimed to restore realism. Physicists almost unanimously favoured\nBohr\n.\nEinstein\n's strongest argument, though this did not become very generally apparent for several decades lay in the famous\nEinstein\n-Podolsky-Rosen\n(\nEPR\n)\nargument of\n1935\n, constructed by\nEinstein\nwith the assistance of his two younger co-workers, Boris Podolsky and Nathan Rosen. Here, as is usually done, we discuss a simpler version of the argument, thought up somewhat later by David Bohm.\nTwo spin-\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nparticles are considered; they are formed from the decay of a spin-\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nparticle, and they move outwards from this decay in opposite directions. The combined state-vector may be written as\n(\n1\n√\n2\n)\n(\nα\n1\n−\nα\n2\n+\n−\nα\n1\n−\nα\n2\n+\n)\n(\\large\\frac{1}{√2}\\normalsize )(\\alpha_{1-}\\alpha_{2+} - \\alpha_{1-} \\alpha_{2+})\n(\n√\n2\n1\n​\n)\n(\nα\n1\n−\n​\nα\n2\n+\n​\n−\nα\n1\n−\n​\nα\n2\n+\n​\n)\n, where the\nα\n1\n\\alpha_{1}\nα\n1\n​\ns and\nα\n2\n\\alpha_{2}\nα\n2\n​\ns for particles\n1\nand\n2\nare related to the\nα\n\\alpha\nα\ns above. This state-vector has a strange form. The two particles do not appear in it independently; rather either state of particle\n1\nis correlated with a particular state of particle\n2\n. The state-vector is said to be\nentangled\n.\nNow imagine measuring\ns\n1\nz\ns_{1}z\ns\n1\n​\nz\n. If we get\n+\n1\n2\nv\n+\\large\\frac{1}{2}\\normalsize v\n+\n2\n1\n​\nv\n, we know that an immediate measurement of\ns\n2\nz\ns_{2}z\ns\n2\n​\nz\nis bound to yield\n−\n1\n2\nℏ\n-\\large\\frac{1}{2}\\normalsize \\hbar\n−\n2\n1\n​\nℏ\n, and vice-versa, although, at least according to Copenhagen, before any measurement, no component of either spin has a particular value.\nThe result of this argument is that at least one of three statements must be true:\n(1)\nThe particles must be exchanging information instantaneously i.e. faster than light;\n(2)\nThere are hidden variables, so the results of the experiments are pre-ordained; or\n(3)\nQuantum theory is not exactly true in these rather special experiments.\nThe first possibility may be described as the renunciation of the principle of\nlocality\n, whereby signals cannot be passed from one particle to another faster than the speed of light. This suggestion was anathema to\nEinstein\n. He therefore concluded that if quantum theory was correct, so one ruled out possibility\n(3)\n, then\n(2)\nmust be true. In\nEinstein\n's terms, quantum theory was not\ncomplete\nbut needed to be supplemented by hidden variables.\nBell regarded himself as a follower of\nEinstein\n. He told Bernstein\n[\n1\n]\n:-\nI felt that\nEinstein\n's intellectual superiority over\nBohr\n, in this instance, was enormous; a vast gulf between the man who saw clearly what was needed, and the obscurantist.\nBell thus supported realism in the form of hidden variables. He was delighted by the creation in\n1952\nby David Bohm of a version of quantum theory which included hidden variables, seemingly in defiance of\nvon Neumann\n's result. Bell wrote\n[\n21\n]\n:-\nIn\n1952\nI saw the impossible done.\nIn\n1964\n, Bell made his own great contributions to quantum theory. First he constructed his own hidden variable account of a measurement of any component of spin. This had the advantage of being much simpler that Bohm's work, and thus much more difficult just to ignore. He then went much further than Bohm by demonstrating quite clearly exactly what was wrong with\nvon Neumann\n's argument.\nVon Neumann\nhad illegitimately extended to his putative hidden variables a result from the variables of quantum theory that the expectation value of\nA\n+\nB\nA + B\nA\n+\nB\nis equal to the sum of the expectation values of\nA\nA\nA\nand of\nB\nB\nB\n.\n(\nThe expectation value of a variable is the mean of the possible experimental results weighted by their probability of occurrence.\n)\nOnce this mistake was realised, it was clear that hidden variables theories of quantum theory were possible.\nHowever Bell then demonstrated certain unwelcome properties that hidden variable theories must have. Most importantly they must be non-local. He demonstrated this by extending the EPR argument, allowing measurements in each wing of the apparatus of any component of spin, not just\ns\nz\ns_{z}\ns\nz\n​\n. He found that, even when hidden variables are allowed, in some cases the result obtained in one wing must depend on which component of spin is measured in the other; this violates locality. The solution to the EPR problem that\nEinstein\nwould have liked, rejecting\n(1)\nbut retaining\n(2)\nwas illegitimate. Even if one retained\n(2)\n, as long as one maintained\n(3)\none had also to retain\n(1)\n.\nBell had showed rigorously that one could not have local realistic theories of quantum theory. Henry Stapp called this result\n[\n18\n]\n:-\nthe most profound discovery of science.\nThe other property of hidden variables that Bell demonstrated was that they must be\ncontextual\n. Except in the simplest cases, the result you obtained when measuring a variable must depend on which other quantities are measured simultaneously. Thus hidden variables cannot be thought of as saying what value a quantity 'has', only what value we will get if we measure it.\nLet us return to the locality issue. So it has been assumed that quantum theory is exactly true, but of course this can never be known. John Clauser, Richard Holt, Michael Horne and Abner Shimony adapted Bell's work to give a direct experimental test of local realism. Thus was the famous CHHS-Bell inequality\n[\n19\n]\n, often just called the Bell inequality. In EPR-type experiments, this inequality is obeyed by local hidden variables, but may be violated by other theories, including quantum theory.\nBell has reached what has been called\nexperimental philosophy\n; results of considerable philosophical importance may be obtained from experiment. The Bell inequalities have been tested over nearly thirty years with increasing sophistication, the experimental tests actually using photons with entangled polarisations, which are mathematically equivalent to the entangled spins discussed above. While many scientists have been involved, a selection of the most important would include Clauser, Alain Aspect and Anton Zeilinger.\nWhile at least one loophole still remains to be closed\n[\nin August\n2002]\n, it seems virtually certain that local realism is violated, and that quantum theory can predict the results of all the experiments.\nFor the rest of his life, Bell continued to criticise the usual theories of measurement in quantum theory. Gradually it became at least a little more acceptable to question\nBohr\nand\nvon Neumann\n, and study of the meaning of quantum theory has become a respectable activity.\nBell himself became a Fellow of the\nRoyal Society\nas early as\n1972\n, but it was much later before he obtained the awards he deserved. In the last few years of his life he was awarded the Hughes Medal of the\nRoyal Society\n, the\nDirac\nMedal of the Institute of Physics, and the Heineman Prize of the American Physical Society. Within a fortnight in July\n1988\nhe received honorary degrees from both Queen's and Trinity College Dublin. He was nominated for a Nobel Prize; if he had lived ten years longer he would certainly have received it.\nThis was not to be. John Bell died suddenly from a stroke on\n1\nst\nOctober\n1990\n. Since that date, the amount of interest in his work, and in its application to quantum information theory has been steadily increasing.",
  "math_areas": [
    "Algebra",
    "Statistics"
  ]
}