{
  "nome_completo": "John Maior",
  "nome_curto": "John Maior",
  "ano_nascimento": "1469",
  "ano_morte": "1550",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maior/",
  "lugar_nascimento": "Gleghornie (near Haddington), Scotland",
  "lugar_morte": "St Andrews, Fife, Scotland",
  "biografia": "John Maior\nis also known as Jean Mair, John Mair or Maioris. His family were farmers but we know little of his early life. We do know that he attended grammar school in Haddington and the next definite event we know about is when he went to God's House in Cambridge\n(\nwhich today is known as Christ's College\n)\nin\n1491\n. Maior was\n22\nyears old in\n1491\n, so it seems likely that he attended university in Scotland before studying at Cambridge. The claim by many historians that Maior must have attended St Andrews University seems out of the question since he states plainly that in\n1510\nhe still had never visited the city. If he did attend university in Scotland, it must have been Glasgow University.\nAfter studying for the academic year\n1491\n-\n92\nat Cambridge, Maior went to Paris where he enrolled at the Collège de Sainte-Barbe. Graduating with a master's degree in\n1495\nhe then went to the Collège de Montaigu, one of the colleges making up the Faculty of Arts of the University of Paris. Giles Aicelin, the Archbishop of Rouen, had founded the college under the name Collège des Aicelins in\n1314\n. Later one of his relations Pierre Aicelin de Montaigu, the Bishop of Nevers and Laon, restored the college and its name was changed at this time. Jan Standonck became Master of the College in\n1483\nand he filled that position when Maior began his theology studies there. In\n1499\nStandonck was forced to leave Paris and Noël Béda and Maior, both Standonck's students, took charge. However Maior soon left to move to the Collège de Navarre leaving Béda to maintain the position of the Collège de Montaigu as one of the leading theological colleges of Paris.\nMaior became a doctor of theology in\n1506\n, while at the Collège de Navarre. He then became a teacher at the Collège de Sorbonne, a theological college of the University of Paris founded in\n1257\nby Robert de Sorbon, certainly the leading theology college in Paris but perhaps the world leader at this time. The College was frequently required to give opinions on important ecclesiastical and theological issues and at the time Maior taught there it made the final decisions as whether translations of sacred texts should be accepted or banned. The time Maior spent in Paris was not only the most productive of his life, but also the most influential. He started a school there which consisted of mainly Spanish and Scottish students. A Spanish student who was a member of the school studying under Maior, wrote to the representative of the Spanish King in Paris:-\nI am following the theology course of John Maior with great interest as he is a deeply knowledgeable man whose virtue is as great as his faith. ... may the eternal king deign to grant him long life that he may for long years be useful to our alma mater, the University of Paris.\nThe Spanish members of Maior's school returned to Spain to form the \"calculatores\" who studied mechanics, being particularly involved with numerical examples, and using as their main tools the elements of proportion theory and infinitesimal arithmetic. Lax was a student of Maior in Paris, who returned to Spain to be a leading calculatores.\nMaior also had an outstanding reputation as a prolific author and an outstanding teacher. In\n1518\n, when at the height of his fame in Paris, he returned to Scotland. He had written in a text a few years earlier:-\nOur native soil attracts us with a secret and inexpressible sweetness and does not permit us to forget it.\nIn fact Maior returned to Scotland to become principal of Glasgow University. Was he attracted back not only to his native soil but also to his alma mater? During this period he wrote\nHistoria Majoris Britanniae tam Angliae quam Scotiae\n(\nHistory of Greater Britain, England and Scotland\n)\n. Of course 'Historia Majoris' is a pun on Maior's History. During this time he was also a canon of the Chapel Royal at Stirling, and a priest at Dunlop in Ayrshire. In June\n1523\nMaior took up an appointment at the University of St Andrews. He lectured both to theology students and to arts students, giving couses on logic to the latter group of students. He also held important administrative roles, being assessor to the Dean of Arts. In this capacity he served on a committee which revised the examination system at St Andrews, giving it a similar structure to that of Paris.\nIf Scotland had attracted him back when in Paris, now that he had spent eight years in Scotland he was attracted back to Paris. Returning in\n1526\nhe seems to have wanted to become fully involved in teaching again and indeed he took up his teaching career in Paris much where he had left it eight years earlier. After five years teaching in Paris, Maior returned again to Scotland and in particular to St Andrews. He again took up major administrative roles being provost of St Salvator's College from\n1534\nand Dean of the Faculty of Theology. He continued to tutor, however, and one of the students he taught during this period was John Knox, the main instigator of the Reformation in Scotland. Knox wrote that Maior was a man:-\n... whose word was then held as an oracle on matters of religion.\nRather strangely Maior had also taught John Calvin, who became the leading French Protestant Reformer, during his second spell in Paris. Certainly the fact that Maior taught two major Protestant Reformers should not make one think that Maior was anything but totally conservative on Roman Catholic doctrine. On the other hand this did not mean that he was not critical of those in the Church. He spoke out strongly in favour of proper treatment of American Indians, and included in his writings a proper moral theological framework for such treatment. He condemned the way many priests neglected their duty of care, he condemned priests who were always absent from the parish they were appointed to, he condemned the 'grasping abbots', and most of all he condemned corruption in the Church:-\nThey deceive themselves who think that the approval of even the supreme pontiff can reconcile such things to the dictates of conscience.\nHe was interested in mathematics and logic and applied these to physics, writing an important text on the infinite\nPropositum de infinito\nin\n1506\n[\n1\n]\n:-\n... in which he argues in favour of the existence of actual infinities and discusses the possibility of motion od an infinite body.\nMaior was also influential in spreading the work of\nBradwardine\nand Swineshead in his teaching\n[\n1\n]\n:-\nMaior's importance for physical science derives from his interest in logic and mathematics and their application to the problems of natural philosophy. He became an important avenue through which the writings of the fourteenth-century Mertonians, especially\nBradwardine\n, Heytesbury, and Swineshead, exerted an influence in the schools of the sixteenth century, including those at Padua and Pisa, where the young\nGalileo\nreceived his education.\nMaior wrote important commentaries on works of\nAristotle\n. In his commentary of the\nEthics\n, he wrote:-\nIn almost all opinions he agrees with the catholic and truest Christian faith in all its integrity ... in so great and manifold a work\n[\nas the Ethics\n]\nif it be read as we explain it, you meet scarcely a single opinion unworthy of a Christian gentlemen.\nBroadie in\n[\n2\n]\nends his article with these words:-\nBy the time Maior died, in\n1550\n, just ten years before the Reformation in Scotland, he must have known that the world to which he had dedicated his life was gone for ever.",
  "math_areas": [
    "Logic",
    "Topology"
  ]
}