{
  "nome_completo": "John Frankland Rigby",
  "nome_curto": "John Frankland Rigby",
  "ano_nascimento": "1933",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rigby/",
  "lugar_nascimento": "Westhoughton, near Bolton, Greater Manchester, England",
  "lugar_morte": "Cardiff, Wales",
  "biografia": "John Frankland Rigby\nwas the son of Fred Frankland Rigby\n(1904\n-\n1979)\nand Bessie May Hodkinson\n(1906\n-\n1936)\n. Fred Frankland Rigby had been born in Westhoughton, near Bolton, Lancashire, on\n13\nFebruary\n1904\n. He was the eldest child of Matthew Frankland Rigby, a calico printer in the cotton industry, and his wife Margaret Alice Hampson. Fred had been educated at Bolton Grammar School and then studied at the University of Manchester, graduating with the degree of B.Sc. in\n1925\n. He then did teacher training and qualified as a school teacher. Bessie May Hodkinson was the daughter of Benjamin Hodkinson, a rate collector's clerk, and his wife Frances. Bessie was the fifth of her parents' children but two had died as infants so by the time of the\n1911\ncensus she was aged\n4\nand by far the youngest of the three surviving children with two brothers aged\n15\nand\n12\n. Fred Frankland Rigby married Bessie May Hodkinson at St Bartholomew's Church, Westhoughton, on\n6\nApril\n1931\n. John Frankland Rigby, their only child, was born at Westhoughton on\n22\nApril\n1933\n.\nIn\n1935\nFred Frankland Rigby took up a new teaching position in Bournemouth and the family made their home at \"Moorland\", Wallisdown Road. Bessie, however, suffered from chronic tuberculosis and tragically died on\n31\nAugust\n1936\n, leaving three year old John without a mother. He soon had a step-mother for his father, Fred Frankland Rigby, married the teacher Zora Lilian Crampion\n(1902\n-\n1990)\non\n27\nMarch\n1937\n, at St Luke's Church, Parkstone, Dorset. The family set up home at\n77\nUplands Road, Bournemouth but soon Fred gave up teaching after deciding in\n1938\nto train for ministry in the Anglican Church. At the time of the\n1939\nRegistry, the family were still living at\n77\nUplands Road, Bournemouth with Fred's occupation given as \"teacher\" and registered for war ARP service but Fred was preparing for ordination at Egerton Hall Theological College in Manchester. He was ordained in Manchester Cathedral in\n1940\nand moved to\n100\nHall Road, Ashton-under-Lyne when became a curate at St James's church. He remained in that post until\n1942\nwhen he became curate at Christ Church, Ashton-under-Lyne from\n1942\nto\n1947\n.\nAfter elementary school, John Frankland Rigby studied at Manchester Grammar School, entering the school in\n1943\nand graduating in\n1950\n. We learn something of his years at school from ULULA, the Manchester Grammar School Magazine. For example, there are various reports of Rigby playing chess for the school. There are also references to his musical skills which he inherited from his father who was a bell ringer\n[\n3\n]\n:-\nAs well as a ringer, he\n[\nFred Rigby\n]\nwas a competent musician, and played the organ and recorder. Amateur dramatics was another hobby activity with which he was much involved.\nJohn Rigby was involved in both music and amateur dramatics while at Manchester Grammar School. For example, in the April\n1947\nedition of ULULA, there is a review of the school play 'Julius Caesar' which praised the\n[\n16\n]\n:-\n... performance of young Lucius\n(\nJ F Rigby\n)\nand his singing to his own accompaniment on the lyre of the Elizabethan love song \"Go to bed, sweet maid,\" which was both dainty and charming.\nBoth Rigby and his father were highly skilled recorder players and, in the Lent term of\n1950\n, which began in January, a concert of recorder music was given by Rigby and his father at the school.\nRigby was awarded a State Scholarship in\n1949\nwhich was reported in the November issue of ULULA\n(\nsee\n[\n16\n]\n)\n. In addition, in the December\n1949\nScholarship Examinations, Rigby was awarded a Scholarship to Trinity College, Cambridge. Matriculating at Trinity College in the autumn of\n1950\n, he completed the Mathematical Tripos in three years. The Autumn\n1953\nedition of ULULA reports\n[\n18\n]\n:-\nJ F Rigby\n(1950)\nhas been awarded a First, with Distinction, in Part III of the Mathematical Tripos at Cambridge.\nHe continued to study at the University of Cambridge, undertaking research for his doctorate advised by\nPhilip Hall\n. After three years of study, he took a job at GCHQ while he completed writing up his thesis. The Spring\n1958\nedition of ULULA reports\n[\n19\n]\n:-\nJ F Rigby\n(1950)\nhas obtained the degree of Ph.D.\nHe was awarded a doctorate from the University of Cambridge in\n1958\nfor his thesis\nTopics in the theory of Finite Linear Groups\n. In December\n1958\nhe submitted two papers to the\nLondon Mathematical Society\n. The paper\nPrimitive Linear Groups Containing a Normal Nilpotent Subgroup Larger Than the Centre of the Group\nwas published in the\nJournal\nof the\nLondon Mathematical Society\nin\n1960\n. In the paper he writes:-\nMy grateful thanks are due to Professor\nP Hall\n, who suggested many of the following proofs to me during my period of research.\nThe second paper\nMonomial Groups with Respect to a Basic Abelian Group\nwas published in the\nProceedings\nof the\nLondon Mathematical Society\nalso in\n1960\n.\nIn\n1959\nRigby was appointed to the School of Mathematics at the University of Cardiff. Jeff Griffiths, who later became a Professor of Mathematics at Cardiff, was a student of Rigby's and wrote\n[\n4\n]\n:-\nI owe him a debt of gratitude. ... in John's first year as a member of staff ... he gave wonderful lectures on Complex Analysis with his own inimitable blackboard sketches of complicated curves.  ... He told us that he had previously been working at GCHQ, finishing off his PhD while working there.  ... we tried to wheedle out of him what went on in this mysterious establishment, but John was typically tight-lipped - not a comma nor full-stop could be drawn out of him.\nRigby's papers in the\nLondon Mathematical Society\nwere not his first publication. In the Spring\n1960\nedition of ULULA it is reported\n[\n20\n]\n:-\nJ F Rigby\n(1950)\nis part author with his father of 'Playing the Recorder'\n(\nFaber and Faber\n)\n, a copy of which has been kindly presented to the Library.\nAlthough Rigby's research for his doctorate had been in group theory, his interests turned towards geometry. The Autumn\n1963\nedition of ULULA reports\n[\n21\n]\n:-\nDr J F Rigby\n(1950)\n, Lecturer in Pure Mathematics at University College, Cardiff, has been appointed Assistant Professor at the University of Toronto for\n1963\n-\n64\n.\nAt the University of Toronto, Rigby had many useful discussions with Frank Arthur Sherk\n(1932\n-\n2015)\n. Sherk had been educated at Victoria School, Kitchener Collegiate Institute, McMaster University, and the University of Toronto. He had undertaken research for a PhD at the University of Toronto, advised by\nDonald Coxeter\n, and was awarded the degree in\n1957\nfor his thesis\nThe theory of Regular Maps\n. While at Toronto, Rigby worked on the paper\nAffine subplanes of finite projective planes\nwhich he submitted to the\nCanadian Mathematical Society\non\n9\nJuly\n1964\n. He writes in the paper:-\nI should like to thank F A Sherk and the referee for their helpful suggestions.\nRigby was always most interested in teaching mathematics and, in the year after joined the School of Mathematics at the University of Cardiff, he joined the\nMathematical Association\n[\n8\n]\n:-\nJohn Rigby ... was an active member of the\nMathematical Association\nfrom the day he joined in\n1960\n, serving as President of the Cardiff Branch as well as its meticulous Secretary. He contributed many articles on Euclidean Geometry to the 'Gazette', which were distinguished by their precision, concise style and freedom from jargon. His elegant solutions to the Problem Corner reflected his encyclopaedic knowledge of results that most of us were not even aware of, and his regular talks at Mathematical Association Conferences were always a magnet of attraction.\nFor information on a few of Rigby's papers published in\nThe Mathematical Gazette\n(\nand on some other papers by Rigby\n)\n, see\nTHIS LINK\n.\nAt the University of Cardiff, Rigby was a colleague of\nJim Wiegold\n. I\n[\nEFR\n]\nwas a friend of\nJim Wiegold\nand we worked on some joint projects together. At least on one of my trips to Cardiff, I met Rigby and enjoyed talking to him over coffee. I discovered that we were both interested in the history of mathematics but from a slightly different perspective. Rigby was interested in the history of mathematics mainly because it led him to find interesting examples that he could use in teaching. Rigby and\nWiegold\njointly organised a Mathematics Club aimed at school pupils in their final year at high school. Jeff Griffiths explained something of the style of the Club\n(\nsee\n[\n8\n]\n)\n:-\n... a worksheet was circulated to the schools a month before each meeting. At the meeting students were invited to present their solution on the blackboard. Although they often produced a technically correct solution, John would inevitably produce a far more elegant one, drawing gasps of admiration from the audience. His perfectly-drawn circles were indeed a wonder to behold.\nAs an example of Rigby's interest in teaching, particularly using geometry, we list a few of his papers:\nA Problem in Projective Geometry\n(1961)\n;\nA Problem in Projective Geometry\n(\nContinued\n)\n(1965)\n;\nA \"Semi-Converse\" of the Theorem of Apollonius\n(1968)\n;\nInequalities Concerning the Areas Obtained When One Triangle Is Inscribed in Another\n(1972)\n;\nA Concentrated Dose of Old-Fashioned Geometry\n(1973)\n;\nFactor Lattices\n(1975)\n;\nAdventitious Quadrangles: A Geometrical Approach\n(1978)\n;\nEquilateral Triangles and the Golden Ratio\n(1988)\n;\nTrackword Maths\n(1989)\n;\nSome New Regular Compound Tessellations\n(1989)\n;\nPaper Patterns\n(1990)\n;\nCycles and Tangent Rays\n(1991)\n;\nNapoleon, Escher, and Tessellations\n(1991)\n;\nCompound Tilings and Perfect Colourings\n(1991)\n;\nOctagrammum Mysticum and the Golden Cross-Ratio\n(2002)\n.\nNot surprisingly, Rigby's keen interest in teaching led to him being a very popular lecturer at Cardiff. In\n[\n4\n]\na number of student assessments are given; here are two of them:-\n1\n. Dr Rigby is amazing the way in which he explains and presents his material, is very methodical and he makes it extremely easy to understand! Why didn't we have him last year? ...\n2\n. It's a pity that our other lecturers aren't as good as this. Maybe then more people would attend and enjoy it, rather than being bored!\nAs a research mathematician, Rigby is best known for the 'Rigby points'. Clark Kimberling writes\n[\n7\n]\n:-\nJohn F Rigby is well-known in geometric circles. For example, Ross Honsberger's 'Episodes in Nineteenth and Twentieth Century Euclidean Geometry'\n(\nMathematical Association of America\n,\n1995)\nreserves a page on which special acknowledgment is given to John Rigby for his contributions to the book. Pages\n132\n-\n136\nintroduce a Rigby point which serves as a seed for families of points in the 'Encyclopedia of Triangle Centers'\n[\nhttps://faculty.evansville.edu/ck\n6\n/encyclopedia/etc.html\n]\nbeginning at X\n(2677)\n. Two other Rigby points are indexed in the 'Encyclopedia of Triangle Centers' as X\n(1371)\nand X\n(1372)\n.\nFor more information about both kinds of Rigby points, see\n[\n22\n]\n.\nIn addition to his year at the University of Toronto, Rigby made extended visits to Turkey, Japan, the Philippines, and Singapore. He spent\n1972\n-\n73\nat Hacettepe University in Ankara, Turkey where he gave lecture courses in English on group theory and projective geometry. While there he found many mathematical connections which fascinated him. He described these in the paper\n[\n14\n]\n; see the short extract at\nTHIS LINK\n.\nWe have already mentioned Rigby's interest and expertise in music. This was, however, only one of his hobbies, some of which involved his mathematical knowledge\n[\n8\n]\n:-\nHe was a dedicated defender of wildlife and an ardent supporter of environmental conservation, as well as a keen rambler in the Lake District and along the canals around Manchester. John was also a devoted member of the Welsh Folk Dance Society and a regular participant in both Highland and Scottish country dancing. Indeed, his attraction to patterns led him to devise and publish dances, creating several for the Cardiff Caledonian Society.\nAnother of his loves was art and again he used his mathematical knowledge and skills\n[\n4\n]\n:-\nJohn became a world expert in the connection between mathematics and 'ornamental art', and created his own designs and patterns.  His drawings were often shared with privileged friends as Christmas cards.  Many of the patterned 'kneelers' in Llandaff Cathedral were designed by John.  He also worked on other church textiles.  Every stitch was depicted on graph paper, and then translated into needlepoint by parish groups.\nHe was a member of Llandaff Cathedral, the Anglican cathedral for the Diocese of Llandaff and for the City of Cardiff. It has the only dedicated choir school in the Church in Wales and Rigby's love and expertise in music meant that for many years he was involved with the choir. He wrote music for the Llandaff Cathedral Parish Choir and also sang in that choir. He was also a director of Cathedral Court\n(\nLlandaff\n)\nLimited from\n30\nJuly\n1997\ngiving his address as Flat\n5\n, Cathedral Court, Cathedral Green Llandaff, Cardiff and his occupation as Retired University Lecturer. The Company was set up to acquire and manage the property of Cathedral Court.\nRigby retired from the University of Cardiff in\n1996\nbut for some years continued to work part-time. His enthusiasm for teaching mathematics to young people remained and he gave workshops and spoke at conferences. Even when he began suffering from Parkinson's Disease, he kept up his love of teaching. When his illness became too severe, he was taken to the University of Wales Hospital in Cardiff where he died on\n29\nDecember\n2014\n. His funeral was held at Llandaff Cathedral on\n13\nJanuary\n2015\nwith the Dean of the Cathedral and the Archbishop of Wales taking the service.\nLet us end by giving Jeff Griffiths' description of Rigby's character\n[\n4\n]\n:-\nJohn was a dedicated defender of wildlife, and an ardent supporter of environmental conservation.  A keen rambler while health allowed, he loved the countryside, though the Manchester canals and the Thames also offered favourite places to walk. The Lake District was particularly dear to him. His pleasure on being taken by friends to enjoy fresh air in local parks during the last two years of his life was palpable. In their turn, those friends took pleasure in the strong sense of humour which had been with John from childhood. ...  John's acute powers of observation, his lack of self-pity, his sharp wit, the one-liners and repartee never left him. Even in his final, painful days in hospital, hardly able to speak, he nevertheless told a visiting friend, with the ghost of a smile, that he was 'not dead yet'.  John had disarming charm, and will be remembered with appreciation, affection, and respect by his many friends and colleagues at Cardiff University.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}