{
  "nome_completo": "John Venn",
  "nome_curto": "John Venn",
  "ano_nascimento": "1834",
  "ano_morte": "1923",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Venn/",
  "lugar_nascimento": "Hull, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "John Venn\n's mother, Martha Sykes, came from Swanland near Hull and died while he was still quite a young boy. His father was the Rev Henry Venn who, at the time of John's birth, was the rector of the parish of Drypool, near Hull. The Rev Henry Venn, himself a fellow of Queen's, was from a family of distinction. His father, John's grandfather, was the Rev John Venn who had been the rector of Clapham in south London. He became the leader of the Clapham Sect, a group of evangelical Christians centred on his church. They successfully campaigned for the abolition of slavery, advocated prison reform and the prevention of cruel sports, and supported missionary work abroad.\nIt was not only Venn's grandfather who played a prominent role in the evangelical Christian movement, for so did his father the Rev Henry Venn. The Society for Missions in Africa and the East was founded by evangelical clergy of the Church of England in\n1799\nand in\n1812\nit was renamed the Church Missionary Society for Africa and the East. The Rev Henry Venn became secretary to this Society in\n1841\nand in order to carry out his duties moved to Highgate near London. He held this position until his death in\n1873\n.\nAs might be expected from his family background, John was very strictly brought up, and there was never any thought other than that he would follow the family tradition into the priesthood. He attended first Sir Roger Cholmley's School in Highgate, then the private Islington Preparatory School.\nWhen he entered Gonville and Caius College Cambridge in October\n1853\nhe had:-\n... so slight an acquaintance with books of any kind that he may be said to have begun there his knowledge of literature.\nHaving been awarded a mathematics scholarship in his second year of study, he graduated as sixth\nWrangler\nin the Mathematical Tripos of\n1857\n, meaning that he was ranked in the sixth place out of those students who were awarded a First Class degree in mathematics. He was elected a Fellow of Gonville and Caius College shortly after graduating, and two years later was ordained a priest. In fact the year after his graduation, in\n1858\n, he had been ordained a deacon at Ely, then after his ordination as a priest he had served as a curate first at Cheshunt, Hertfordshire, and then for a year as a curate at Mortlake, Surrey.\nIn\n1862\nhe returned to Cambridge University as a lecturer in Moral Science, studying and teaching logic and\nprobability theory\n. He had already become interested logic, philosophy and metaphysics, reading the treatises of\nDe Morgan\n,\nBoole\n, John Austin, and John Stuart Mill. Back at Cambridge he now found interests in common with many academics such as\nTodhunter\n. He also played a large role in developing the Moral Sciences Tripos over many years. He lectured and examined the Tripos, developing a friendly atmosphere between the lecturers and the students.\nVenn extended\nBoole\n's mathematical logic and is best known to mathematicians and logicians for his diagrammatic way of representing sets, and their unions and intersections. He considered three discs\nR\n,\nS\nR, S\nR\n,\nS\n, and\nT\nT\nT\nas typical subsets of a set\nU\nU\nU\n. The intersections of these discs and their complements divide\nU\nU\nU\ninto\n8\nnon-overlapping regions, the unions of which give\n256\ndifferent\nBoolean\ncombinations of the original sets\nR\n,\nS\n,\nT\nR, S, T\nR\n,\nS\n,\nT\n.\nVenn wrote\nLogic of Chance\nin\n1866\nwhich\nKeynes\ndescribed as:-\n... strikingly original and considerably influenced the development of the theory of statistics.\nIn\n1867\nVenn married Susanna Carnegie Edmonstone, the daughter of the Rev Charles Edmonstone. They had one child, a son John Archibald Venn, who became president of Queen's College, Cambridge, in\n1932\n, and undertook major collaborative research projects with his father that we give more details on below.\nVenn published\nSymbolic Logic\nin\n1881\nand\nThe Principles of Empirical Logic\nin\n1889\n. The second of these is rather less original but the first was described by\nKeynes\nas:-\n... probably his most enduring work on logic.\nIn\n1883\nVenn was elected a Fellow of the\nRoyal Society\nand in the same year was awarded a Sc.D. by Cambridge. About this time his career changed direction for in the same year that he was elected to the\nRoyal Society\n, he left the priesthood. His son, John Archibald Venn, wrote his father's obituary in the\nDictionary of National Biography\nand explained the position:-\nIt had long ceased to be regarded as an anomaly for a clergyman to preach the then circumscribed evangelical creed and at the same time, without the slightest insincerity, to devote himself actively to philosophical studies; yet ... finding himself still less in sympathy with the orthodox clerical outlook, Venn availed himself of the Clerical Disabilities Act. Of a naturally speculative frame of mind, he was want to say later that, owing to subsequent change in accepted opinion regarding the Thirty-nine Articles, he could consistently have retained his orders; he remained, indeed, throughout his life a man of sincere religious conviction.\nVenn's interest turned towards history and he signalled this change in direction by donating his large collection of books on logic to the Cambridge University Library in\n1888\n. He wrote a history of his college, publishing\nThe Biographical History of Gonville and Caius College\n1349\n-\n1897\nin\n1897\n, which:-\n... involved a vast amount of painstaking and methodical search among university, episcopal, and other records.\nThe annals of a clerical family\n(1904)\ntrace the history of his own family back to the seventeenth century and record that he was the eighth generation of his family to have a university education. In\n1910\nhe published a work on historical biography, namely a treatise on John Caius, one of the founders of his College. Three years later he published\nEarly Collegiate Life\nwhich collected many of his writings describing what life was like in the early days of Cambridge University. He then undertook the immense task of compiling a history of Cambridge University\nAlumni Cantabrigienses\n, the first volume of which was published in\n1922\n. He was assisted by his son John Archibald Venn in this task which was described by another historian in these terms:-\nIt is difficult for anyone who has not seen the work in its making to realise the immense amount of research involved in this great undertaking.\nIt was\n[\n3\n]\n:-\n... nothing less than a \"biographical list of all known students, graduates, and holders of office at the University of Cambridge from the earliest times to\n1900\n\". ... The Venns, father and son, spared no industry in building up these records, which are of extraordinary value to historians and genealogists ...\nThe first part contained\n76\n,\n000\nnames and covered the period up to\n1751\n. At the time of Venn's death the second part, covering the period from\n1751\nto\n1900\n, existed in manuscript and contained a further\n60\n,\n000\nnames.\nVenn had other skills and interests too, including a rare skill in building machines. He used his skill to build a machine for bowling cricket balls which was so good that when the Australian Cricket team visited Cambridge in\n1909\n, Venn's machine clean bowled one of its top stars four times.\nHis son gives this description:-\nOf spare build, he was throughout his life a fine walker and mountain climber, a keen botanist, and an excellent talker and linguist.",
  "math_areas": [
    "Logic",
    "Statistics"
  ]
}