{
  "nome_completo": "John Cruickshank",
  "nome_curto": "John Cruickshank",
  "ano_nascimento": "1787",
  "ano_morte": "1875",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cruickshank/",
  "lugar_nascimento": "Milltown of Rothiemay, Moray, Scotland",
  "lugar_morte": "Aberdeen, Scotland",
  "biografia": "John Cruickshank\nwas the son of James Cruickshank of Rothiemay who worked as a handloom weaver, sharing the tenancy of the small farm of Barnhills with his brother in law. John Cruickshank was born on the Barnhills farm and lived on the farm for the first seven years of his life until, in\n1794\n, his father James Cruickshank died during a fever epidemic. John's mother was forced to leave the farm and went first to Grange, then to the house next door to her sister Ann Leslie who lived in Knowehead in Marnoch.\nAnn Leslie was married to William Ogilvie and they had two children William Ogilvie Jr.\n(1798\n-\n1872)\nand John Ogilvie\n(1797\n-\n1867)\nwho, of course, were John Cruickshank's cousins and we will meet them again a little later.\nJohn Cruickshank's first teacher at the local school was Margaret Brown. Margaret's brother was married to the sister of the astronomer James Ferguson\n(1710\n-\n1776)\nwho had been famed as a lecturer giving public lectures in most major English cities. It is highly likely that John would have heard about his teacher's famous relation and his fame as a lecturer and inventor of astronomical instruments. Certainly John became interested in astronomy and, sent to work as a herd boy, he spent the nights watching the sky and observing the motions of the planets. In later life he recalled his wonder at observing a meteor shower on\n12\nNovember\n1799\n. This was the Leonids meteor shower which occurs every year but has its most spectacular displays about every\n33\nyears, with stunning displays in\n1799\n,\n1833\n,\n1866\netc. We now know that this event is caused by the earth passing through the orbit of comet Tempel-Tuttle.\nIn\n[\n3\n]\nwe learn about John Cruickshank's early education:-\nAlthough he had little formal education in his early years, other than a winter quarter or \"raith\", or two at the parish school of Rothiemay, by the age of sixteen he had set his mind on going to university. So for two years he went to the parish school at Ordiquhill, and for a short  time he was, as older boys often were in those days, put in charge of other pupils.\nTwo of the pupils that Cruickshank taught in the parish school at Ordiquhill were his cousins John and William Ogilvie. Let us record something of these two boys at this point. First John Ogilvie was\n[\n4\n]\n:-\n... born at Knowehead in Marnoch, Banffshire\n(\nnow in Aberdeenshire\n)\n. Like his cousin\n[\nJohn Cruickshank\n]\nhe had little elementary education, other than one winter quarter at Ordiquhill parish school, and although he was interested in mathematics and literature, as eldest son he seemed destined for a farming life. At about the age of\n20\nhe had an accident to his knee which led to the need for his leg to be amputated, so his career had to take a different turn. Encouraged by his cousin, now Professor of Mathematics, he enrolled at Marischal College and graduated with Honours in Mathematics. He went on to teach mathematics at Gordon's Hospital, Aberdeen from\n1831\nuntil\n1859\n.\nJohn Ogilvie is, however, famed as a lexicographer publishing\nThe Imperial Dictionary\n(1850\n-\n51)\n, one of the most popular dictionaries of its day. His younger brother William Ogilvie\n[\n6\n]\n:-\n... was probably just as gifted as his brother but stayed in farming to become farmer at Ternemny. Like his brother he had little formal elementary education other than a quarter at Ordiquhill school, but his love for books seems to have been communicated to his sons who were to have a great impact on Scottish education.\nReturning to the life of John Cruickshank, after attending the parish school at Ordiquhill, he studied for a short time at the Grange school. He had set his mind on going to university and the obvious place was Marischal College in Aberdeen. The family did not have the financial means to support his university education but he believed he would be able to win a bursary in the Marischal College bursary competition. He lived\n40\nmiles\n(\nabout\n65\nkm\n)\nfrom Aberdeen and had no obvious means of transport to get there for the competition but this was not going to stop the determined young man who walked the\n65\nkm to the College and sat the bursary competition in\n1805\n. He was awarded a bursary of £\n5\na year for two years, which might not sound much today but at that time it was sufficient to cover the fees. He entered Marischal College in\n1806\nand with the bursary to cover his first two years, his outstanding performance saw him awarded the prestigious Gray bursary in\n1808\n. He graduated with an Honours M.A. degree in\n1809\nwith distinction in mathematics. He had been taught by Patrick Copland, who had succeeded William Trail in the Chair of Mathematics but taught physics, and Robert Hamilton who was appointed to the Chair of Natural Philosophy but taught mathematics.\nAfter graduating with his M.A., Cruickshank worked as a teacher at Boharm, and as a tutor at Haddo and then at Netherdale. From\n1814\nhe assisted Robert Hamilton at Marischal College teaching mathematics to the first and second year classes. Betty Ponting writes\n[\n8\n]\n:-\nAfter some initial difficulties with the insubordinate mathematics classes, he soon established a reputation for good discipline and excellent teaching, keeping his classes alert with a system of daily oral tests. A student rhyme of\n1815\nsummed up his attitude:\nTo fining this class I'm very unwilling,\nBut give me an answer or down with a shilling.\nThe instruction in elementary arithmetic needed by his first class was a symptom of the generally low standards of the early nineteenth century.\nIn\n1817\nHamilton and Copland exchanged chairs and, on\n9\nJuly\n1817\n, Cruickshank was appointed as \"assistant and successor to Professor Hamilton\", now the Professor of Mathematics. He had been examined by Professors Hamilton and Copland, together with Professors Paul and Tulloch, of King's College Aberdeen, who reported him \"fully competent to teach Mathematics in any University.\" In both\n[\n2\n]\nand\n[\n7\n]\nthere is the report:-\nJohn Cruickshank, admitted\n9\nth July\n1817\n. Assistant professor of Mathematics, and successor to Dr Hamilton; appointment made by the Magistrates and Town Council of Aberdeen.\nAlthough Cruickshank was appointed as Hamilton's successor, in fact it was not until\n1824\nthat Hamilton retired completely from teaching. William Kennedy\n[\n5\n]\ngives the mathematics syllabus for Marischal College in the year\n1818\n:-\nRobert Hamilton, LL.D. and John Cruickshank, A.M. Joint Professors of Mathematics give three mathematical courses every session, to different classes. In the first year, they explain to the students under their charge the principles of arithmetic, teach the first six books of\nEuclid\n's Elements of Geometry, the first principles of algebra, plane trigonometry, in all its branches, principles of geography, and the use of the globes. In the second year, they teach algebra, with its application to various kinds of calculation, elements of solid geometry, principles of perspective, navigation, spherical geometry, dialing and conic sections. In the third, they instruct the student in the higher branches of algebra, genesis and properties of higher curves, methods of indivisibles, prime and ultimate ratios, &c,; methods of fluxions, direct and inverse; higher parts of astronomy, with the detail of astronomical calculation. The instruments, of which a considerable number, of the best construction, connected with the different branches of this science, belong to the college, are exhibited, and their adjustments and uses explained: and, in every part of the course, the application of the principles to the practical purposes of life is pointed out, and illustrated by examples.\nOnce Cruickshank was secure in his position as Professor of Mathematics at Marischal College he was able to marry Janet Mitchell\n(22\nJuly\n1789\n-\n24\nApril\n1879)\n. John and Janet Cruickshank were married  on\n22\nOctober\n1818\n; they had three children, Alexander Cruickshank\n(\nborn\n21\nSeptember\n1819)\n, Anne Hamilton Cruickshank\n(\nborn\n21\nOctober\n1820)\nand John Forbes Cruickshank\n(\nborn\n25\nFebruary\n1823)\n. Alexander Cruickshank died on\n23\nOctober\n1897\nand we quote from his obituary\n[\n10\n]\n:-\nBorn in\n1819\n, the elder son of the gifted Professor of Mathematics in Marischal College, he had all his life to mourn over the fateful incident which led his gracious mother to her door a few days before he was born. Yet, crippled, twisted, and shaky in every movement, he could during full sixty years of his life go through bodily and mental fatigue with less trouble than most men. From the end of his College days till near the end of his long life his time was mostly spent in literary and scientific work, and in mountain-climbing. ... No more worthily-won distinction did his Alma Mater ever confer than when it made him LL.D. Few men knew so much, and fewer still made a better use of what they had than Dr Cruickshank. His constant good humour his ready wit, and his very absolute defiance of bodily infirmities come up in pleasant remembrance.\n[\nNote by EFR: I did not at first understand\nthe fateful incident which led his gracious mother to her door\nthinking that \"her\" referred to \"his gracious mother,\" but when I realised that \"her\" refers to \"the fateful incident\" it made more sense.\n]\nAnne Hamilton Cruickshank died on\n13\nApril\n1911\nat the age of\n80\n, but John Forbes Cruickshank, who became a student of law, died on\n30\nJanuary\n1842\nat the age of\n18\n[\n8\n]\n:-\nAnne, ensured the perpetuation of the family name in the University by setting up a trust fund in\n1898\nto purchase and support the Botanical Gardens in memory of her brother Alexander and in\n1906\nerected a stained glass window in memory of her father in the library of Marischal College. This window, which was over the entrance gateway was dismantled about\n1970\nand is now in store. The trust was further augmented on Anne Cruickshank's death to support several other University institutions including a lectureship in Astronomy, the Science Library and a prize in the Faculty of Law.\nIn fact the stained glass window is now on display in the V&A in Dundee. You can see my\n[\nEFR\n]\npicture of it at\nTHIS LINK\n.\nCruickshank became involved with a Scottish trigonometrical survey and in particular with the Belhelvie baseline. Details come from\n[\n9\n]\n:-\nIn\n1814\n, Thomas Colby visited the Aberdeen area looking for a site where he could measure a Scottish baseline for the trigonometrical survey. Patrick Copland, and probably others, went with him to the Belhelvie links a few miles north of Aberdeen. In a letter to Copland, Colby confirms that it was the best situation he had yet seen in Scotland and in fact it was the one finally chosen by Colby. In\n1817\n, Colby returned with\nRamsden\n's sector and steel chain, spending from\n5\nMay to\n6\nJune making measurements. Another visitor to the measuring site was John Cruickshank, a former pupil of Copland who was later to occupy Copland's chair of mathematics at Marischal College. In a short biography of Cruickshank there is an account of Colby's work at Belhelvie as observed by Cruickshank. The result of the measurements confirmed the excellence of the trigonometrical survey. Each end of the baseline was temporarily marked by a post with a tripod support, with an engraved brass plate on top of the post. Two gun barrels were dispatched to Aberdeen by sea later in the year with instructions on how to sink them into the sands to replace the wooden posts. This information was transmitted to Copland by\nOlinthus Gregory\nand Colby. It would appear that the matter was not attended to immediately but was taken up again by John Cruickshank in\n1820\n. Unfortunately it was found that the temporary posts had been uprooted in ignorance by the local proprietors while erecting game-keepers' lookouts and thus precisely the same base line could not be re-measured at a later date.\nBetty Ponting\n[\n8\n]\n, explains how Cruickshank reformed both the mathematics teaching and the degree structure at Marischal College:-\nCruickshank became a leader of reform, an advocate of concentrated work and strict examinations. It was his motion, passed in\n1823\n, which reduced the students' Christmas vacation from three days to one, a reduction he considered necessary since the holiday \"tends to withdraw their attention from their studies and to lead them into amusements which are not always relinquished.\" Degree examinations on all subjects of the Arts course, extending over six days, were introduced in\n1825\n. From\n1826\nthe bursars had to pass entrance examinations each year, including one in arithmetic for the first mathematical class, and these were extended a year later to all except private students. Degree results listed 'particularly distinguished' candidates from\n1828\n. ... From\n1848\nthe first three books of\nEuclid\nand elementary algebra became a prerequisite for the first mathematical class, enabling Cruickshank to introduce\nLeibniz\n' differential and integral calculus, which had replaced fluxions, in his second class.\nCruickshank corresponded with\nJohn Herschel\nand letters of\n1843\nand\n1847\nare extant. He acted as the librarian of Marischal College from\n1844\nto\n1860\n. In\n1845\nhe was paid £\n45\nfor trouble in rearranging books. In\n1851\nit was reported that he had spent\n1200\nhours in arranging books after the fire of\n1845\n, and in completing the catalogue begun by Professor Knight. Finally we record his other contributions\n[\n8\n]\n:-\nThe University owed much to Cruickshank as an administrator. He acted as secretary and procurator of public funds from\n1821\n,\n[\nand\n]\nlater organised building work .... Outside, he took an active interest in banking and insurance, being an early advocate of the decimalisation of money. He gave service as a school inspector\n[\nthe Milne Bequest Inspector of Schools for Aberdeenshire\n]\nand to many charitable organisations, work which he continued after his retirement in\n1860\nuntil his death in\n1875\n.\nJames Clerk Maxwell\nwas appointed as Professor of Natural Philosophy at Marischal College in\n1856\nand he and Cruickshank were colleagues for four years. In\n1860\nMarischal College, Aberdeen, and King's College, Aberdeen, combined to form the University of Aberdeen.\nMaxwell\nas the junior of the two Professors of Natural Philosophy, had to seek another post. Cruickshank was\n73\n, and the senior Professor of Mathematics, but he chose to retire at this time.\nWe note that he was buried in Saint Nicholas Churchyard in Aberdeen where his younger son was already buried. His wife, his elder son and his daughter were eventually buried there too and the five members of the family share a common gravestone.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Number Theory"
  ]
}