{
  "nome_completo": "John Griggs Thompson",
  "nome_curto": "John Thompson",
  "ano_nascimento": "1932",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thompson_John/",
  "lugar_nascimento": "Ottawa, Kansas, USA",
  "lugar_morte": null,
  "biografia": "John Thompson\nstudied at Yale University, receiving his B.A. in\n1955\n. He went to the University of Chicago to undertake research and completed his doctorate in\n1959\n. His doctoral thesis, entitled\nA Proof that a Finite Group with a Fixed-Point-Free Automorphism of Prime Order is Nilpotent\nwas supervised by\nMac Lane\n. In fact his doctoral thesis solved one of the conjectures of\nFrobenius\nwhich had remained unsolved for around\n60\nyears. Thompson's thesis, as is clear from its title, proved\nFrobenius\n's conjecture that a finite group with an automorphism which does not fix any group element is necessarily nilpotent.\nThe solution of\nFrobenius\n's conjecture was not done by simply pushing the existing techniques further than others had done; rather it was achieved by introducing many highly original ideas which were to lead to many developments in group theory.\nThompson was an assistant at Harvard University in\n1961\n-\n62\n, then, in\n1962\n, he was appointed professor at the University of Chicago. In\n1968\nThompson accepted a fellowship at University College, Cambridge in England. He was appointed\nRouse Ball\nProfessor of Pure Mathematics at Cambridge in\n1970\n.\nIt is no coincidence that starting at the time of Thompson's thesis,\ngroup theory\nleapt into prominence as the mathematical topic which was attracting most attention and which was undergoing the most rapid development. The reason was that suddenly progress began to be made on one of the main problems of finite group theory, namely the classification of finite\nsimple groups\n.\nEvery finite group can be viewed as built from a finite collection of finite simple groups. The finite simple groups are therefore the building blocks from which finite groups are built. To classify finite groups therefore reduces to two problems, namely the classification of finite simple groups and the solution of the extension problem, that is the problem of how to fit the building blocks together.\nEarly contributions were made by\nGalois\n,\nJordan\nand\nÉmile Mathieu\n. Claude\nChevalley\nshowed in\n1955\nthat the\nLie groups\nhave finite analogues which are finite simple groups. M Suzuki in\n1960\ndiscovered new infinite families of finite simple groups. These were discovered by him independently of\nChevalley\n's theory but then it was noticed that they were indeed twisted\nChevalley\ngroups. An automorphism had been missed in the original working out of\nChevalley\n's theory which is why the Suzuki groups were only discovered some time after.\nThompson, working with\nWalter Feit\n, proved in\n1963\nthat all nonabelian finite simple groups were of even order. They published this result in\nSolvability of Groups of Odd Order\na\n250\npage paper which appeared in the\nPacific Journal of Mathematics\n13\n(1963)\n,\n775\n-\n1029\n. Despite the importance of the paper several journals declined to publish it because of its length. The paper consists of one whole part of Volume\n13\nof the\nPacific Journal\n. This result stunned the world of mathematics but it also led mathematicians to believe that a classification of finite simple groups might prove possible. Both Thompson and\nFeit\nreceived the\nFrank Nelson Cole\nPrize in\n1965\nwhen the thirteenth award was made to them for this their joint paper.\nAnother major early step by Thompson towards the classification of finite simple groups was his classification of those finite simple groups in which every\nsoluble subgroup\nhas a soluble normaliser.\nThompson was awarded a\nFields Medal\nfor his work at the International Congress of Mathematicians in Nice in\n1970\n.\nBrauer\n, speaking of Thompson's work at the Congress, first spoke of the 'odd order paper':-\nThe first paper I have to mention is a joint paper by\nWalter Feit\nand John Thompson and, of course,\nFeit\n's part in it should not be overlooked. Here, the authors proved a famous conjecture, to the effect that all non-cyclic finite simple groups have even order. I am not sure who was the first to observe this. Fifty years ago\n[1920]\nthis was already referred to as a very old conjecture. While it was usually mentioned in courses on algebra, it is only fair to say that nobody ever did anything about it, simply because nobody had any idea how to get started. It was not even clear that the whole problem made sense. Was the role of the prime\n2\nsimply a little accident; did\n2\nplay an entirely exceptional role, or were there properties of other prime divisors of the group order which bore at least some resemblance to those of\n2\n? It was only after the\nFeit\n-Thompson paper that one could be sure that the whole question was a reasonable one.\nBrauer\nwent on to speak of Thompson's subsequent work:-\nThompson's work which has now been honoured by the Fields medal is a sequel to this first paper. In it he determined the minimal simple finite groups, this is to say, the simple groups whose proper subgroups are solvable. Actually, a more general problem is solved. It suffices to assume that only certain subgroups, the so-called local subgroups, are solvable. These are the normalizers of the subgroups of prime power order ... These results are the first substantial results achieved concerning simple groups. A number of important corollaries show that one is now able to answer questions on finite groups which were completely out of reach before. I mention one: a finite group is solvable if and only if every subgroup generated by two elements is solvable.\nThe nonabelian finite simple groups fall into a small number of infinite series and\n26\nsporadic groups. During the\n1970\ns Thompson contributed to the understanding of these groups.\nBrauer\n, in a personal comment at the end of\n[\n3\n]\npredicted this:-\nOn reaches a point in life where one wonders what one still expects of life, what one would still like to see happen. This applies to mathematics too. I have passed the point I have mentioned. I like to say that I would like to see the solution of the problem of the finite simple groups and the part I expect Thompson's work to play in it. Quite generally I would like to see to what further heights Thompson's future work will take him.\nJohn Thompson's interests after\n1970\nbecame broader and over the\n1970\ns he also made major contributions to coding theory. His work on coding theory was to lay the foundation for the solution of a long standing problem, namely the fact that there is no finite plane of order\n10\n.\nDuring the\n1980\ns much of Thompson's work was on the problem of which finite groups could occur as\nGalois groups\n. Work in this area was started by\nHilbert\nwith his proof of the irreducibility theorem, and the authors of\n[\n4\n]\nstate that:-\nThompson's work may well be the most important advance since\nHilbert\n's time.\nIn\n1989\nThompson was one of the five main speakers at the Groups St Andrews meeting. He gave a series on lectures on\nGalois groups\nat that meeting. The picture of Thompson shown here was taken in St Andrews during the conference.\nThompson has received many awards for his outstanding contributions to mathematics. In addition to the\nCole\nPrize from the\nAmerican Mathematical Society\nand the Fields Medal in\n1970\ndescribed above, he was awarded the Senior Berwick Prize from the\nLondon Mathematical Society\nin\n1982\n, the\nSylvester\nMedal from the\nRoyal Society\nin\n1985\nand he received the Wolf Prize and the\nPoincaré\nPrize in\n1992\n. He was elected to the\nNational Academy of Sciences\nin the United States in\n1971\nand the\nRoyal Society of London\nin\n1979\n. He was awarded the National Medal of Science in\n2000\n.\nAmong the honorary degrees that Thompson has received are ones from Yale University\n(1980)\n, the University of Chicago\n(1985)\n, the University of Oxford\n(1987)\nand Ohio State University\n(2008)\n.\nIn\n2008\nthe\nNorwegian Academy of Science and Letters\nawarded the\nAbel\nPrize to John Griggs Thompson and\nJacques Tits\n:-\n... for their profound achievements in algebra and in particular for shaping modern group theory.\nThe Press Release gives the following summary of Thompson's contributions:-\nThompson revolutionised the theory of finite groups by proving extraordinarily deep theorems that laid the foundation for the complete classification of finite simple groups, one of the greatest achievements of twentieth century mathematics. Simple groups are atoms from which all finite groups are built. In a major breakthrough,\nFeit\nand Thompson proved that every non-elementary simple group has an even number of elements. Later Thompson extended this result to establish a classification of an important kind of finite simple group called an\nN\nN\nN\n-group. At this point, the classification project came within reach and was carried to completion by others. Its almost incredible conclusion is that all finite simple groups belong to certain standard families, except for\n26\nsporadic groups. Thompson and his students played a major role in understanding the fascinating properties of these sporadic groups, including the largest, the so-called Monster. The achievements of John Thompson and of\nJacques Tits\nare of extraordinary depth and influence. They complement each other and together form the backbone of modern group theory.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}