{
  "nome_completo": "John Maynard Keynes",
  "nome_curto": "John Maynard Keynes",
  "ano_nascimento": "1883",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keynes/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "Firle, Sussex, England",
  "biografia": "John Maynard Keynes\n(\npronounces Canes\n)\nwas born into an academic family. His father, John Nevile Keynes, was a lecturer at the University of Cambridge where he taught logic and political economy. John Nevile published\nFormal Logic\nfour months after John Maynard was born. John Maynard's mother, Florence Ada Brown, was a remarkable woman who was a highly successful author, and also a great pioneer in social reform. It is worth commenting at this stage that, although John Maynard Keynes lived to the age of\n63\n, his parents both outlived him.\nAt the age of seven, Keynes entered Perse School Kindergarten but he learnt more from lessons given at home. Two years later he entered St Faith's preparatory school but there was little sign at this stage that he was an exceptional pupil. As time went by he did begin to show more promise, however, and in\n1894\nhe topped the class for the first time and received a prize for mathematics. By\n1896\nhe was described by the headmaster as\n(\nsee for example\n[\n6\n]\n)\n:-\n... head and shoulders above all the other boys in the school.\nThe following year Keynes sat the entrance examination for Eton and came tenth out of the twenty boys who were accepted into the school in that year. He did, however, come first equal in mathematics.\nKeynes enjoyed his school days in Eton. Harrod writes in\n[\n6\n]\n:-\n... Eton greatly helped his development. He found there associates who were congenial to him, youths of intellectual distinction with whom he could quickly get on to terms of intimacy on the basis of common interests.\nKeynes did well at Eton winning the Senior Mathematics Prize in\n1899\n, and again in\n1900\n. But it was not only in mathematics that he did well; for example in\n1901\nhe was first in mathematics, first in history, and first in the English essay. In\n1902\nhe won a scholarship to King's College, Cambridge, in mathematics and classics. Before we leave our description of Keynes' time at Eton, we should note that it was here that he continued with one of his passions\n(\nbegun at the age of twelve\n)\n, namely collecting old books. He had purchased\n329\nold books before he entered the University of Cambridge in October\n1902\n.\nAt Cambridge Keynes was tutored mathematics by\nE W Hobson\nwhom he called \"Hobbema\". Although he studied mathematics he was no mathematical genius. His\n[\n6\n]\n:-\n... logical faculty, his accuracy and his lightning speed of thought made him a thoroughly competent mathematician. He had no specific genius for mathematics; he had to take pains with his work; ... he did not seek out those abstruse regions which are a joy to the heart of the professional mathematician.\nHe had many interests at Cambridge beyond his academic work, spending much time with literary friends, reading, and involving himself in political activity\n[\n3\n]\n:-\nHe was President of the Cambridge Union\n[\nand\n]\nwon the Members' English essay Prize for an essay on the political opinions of Burke ...\nHe put in some effort as the examinations approached to achieve a reasonable degree and he was placed twelfth\nWrangler\nin the Mathematical Tripos of\n1905\n, that is twelfth in the ranked list of those receiving a First Class degree.\nImmediately following taking the Tripos examinations, Keynes began a serious study of economics, reading major texts on the subject. He did briefly consider taking a second Tripos examination in Economics but decided against it. After a holiday in Switzerland, he returned to Cambridge in October\n1905\nand attended lectures there by Alfred Marshall on economics. In August\n1906\nhe took the Civil Service examinations and was placed second of the ten who were accepted that year. The top person had first choice of which department to enter, and chose to enter the treasury\n(\nwhich Keynes would have done had he come top\n)\n. Keynes, with the next choice, entered the India Office.\nKeynes was very unhappy when he received detailed results of the examination. He came top in logic, psychology, and the essay, while his worst subjects were mathematics and economics. He expressed disbelief at both the mathematics and economics results, and commented, probably accurately, that he knew more about economics than his examiners.\nThe India Office did not provide a career to Keynes' liking. He worked mostly on his own work, devoting all his spare time to the study of the\ntheory of probability\n. He then submitted a dissertation on probability for a Fellowship at King's College.\nJohnson\nand\nWhitehead\nwere appointed as assessors of the dissertation but, after a close contest in March\n1908\n, Keynes was not elected. On\n5\nJune\n1908\nhe resigned from the India Office and, with some financial assistance from his father, went to King's with the hope that he would be successful in the Fellowship competition the following year.\nUsing the detailed comments on his probability dissertation by both\nJohnson\nand\nWhitehead\n, Keynes worked hard to improve it. He also discussed his work with\nRussell\n. After submitting a new version of his dissertation on probability, Keynes was elected to a Fellowship in March\n1909\n. The reports were impressive;\nWhitehead\nwrote:-\n... his axioms are good; they are simple and few and by the aid of the symbolism he deduces the whole subject from them by rigid reasoning. The very certainty and ease by which he is enabled to solve difficult questions and to detect ambiguities and errors in the work of his predecessors exemplifies and at the same time almost conceals the advance which he has made.\nRussell\n, writing about the book which Keynes eventually published on probability, praised the work highly:-\nThe mathematical calculus is astonishingly powerful, considering the very restricted premises which form its foundation... The book as a whole is one which it is impossible to praise too highly and it is hoped that it will stimulate further work on a most important subject which philosophers and logicians have unduly neglected.\nKeynes now taught economics at Cambridge. He published papers in statistics, in particular he attacked strongly work by\nKarl Pearson\nin letters published in\n1910\nand\n1911\nin the\nJournal of the Royal Statistical Society\n. Whether\nPearson\nor Keynes had the better scientific case is open to question, but there is no doubt that Keynes was by far the more skilful in his style of letter writing, making\nPearson\n(\nprobably unfairly\n)\nlook rather silly. Keynes also wrote on economics related to India and he published a major book\nIndian Currency and Finance\nin\n1913\n. The book is considered a classic and contains a description of the \"gold exchange standard\".\nKeynes was appointed secretary of a Commission to examine Indian Finance and Currency in\n1913\nand he began to seek a publisher for his major treatise on probability based on his fellowship dissertation. His life, however, changed markedly with the beginning of World War I in August\n1914\n. At first he continued much as before, publishing\nWar and the Financial System, August\n1914\nin the\nEconomic Journal\n. During the first term of the academic year\n1914\n-\n15\nhe carried out his duties as normal at Cambridge but already Cambridge was a different place. In November\n1914\nhe published a paper on\nThe City of London and the Bank of England\nbut a letter he wrote at this time shows the effect that the war was having\n(\nsee for example\n[\n6\n]\n)\n:-\nFor myself I am absolutely and completely desolated. It is utterly unbearable to see day by day the youths going away, first to boredom and discomfort, and then to slaughter.\nBy\n1915\nKeynes was working at the Treasury where\n[\n2\n]\n:-\n...he was daily concerned with the economic management of the war. His special responsibility covered relations with allies and the conservation of England's scant supply of foreign currencies.\nHis position at the Treasury meant that he could no longer publish. In particular his treatise on probability had to be put to one side until the war was over. In many ways these war years saw Keynes at the height of his powers and at his most influential. Certainly he had the confidence to believe his opinions were right while others in the highest positions of power could be seriously wrong. Not long after he began to work at the Treasury he was present when Lloyd George, then Chancellor of the Exchequer, made a statement regarding the position in France. He then asked for comments to which Keynes replied:-\nWith the utmost respect, I must, if asked for my opinion, tell you that I regard your account as rubbish.\nAfter the war ended, Keynes represented the Treasury at the Versailles Peace Conference, but, in June\n1919\n, he resigned on the grounds that the proposals being put forward for German reparations were both unfair and impractical. He was then in a position to publish again and he attacked the conclusions of the Versailles Peace Conference in December\n1919\nwith\nThe Economic Consequences of the Peace\n. In this work he attacked the leading political figures in no uncertain terms and as a consequence he was never fully trusted by the government again.\nIn\n1920\nKeynes began to prepare his\nTreatise on Probability\nfor publication. This he found a little difficult, for he had not looked at the work for six years. Its publication in\n1921\nis the most important of his works as far as this mathematical archive is concerned. In this work he argues that probability is a logical relation and so it is objective. A statement involving probability relations has a truth-value independent of people's opinions. In\n1926\nRamsey\npublished a paper\nTruth and probability\narguing against these arguments of Keynes. The paper\n[\n17\n]\nexamines the two points of view of Keynes and\nRamsey\non probability.\nOther important ideas discussed by Keynes in\nTreatise on Probability\nis that probability relations forms only a partially ordered set in the sense that two probabilities cannot necessarily always be compared. Keynes also argues that probability is a basic concept which cannot be reduced to other concepts.\nAnother important period of Keynes' career was during the\n1930\ns. This was a period of unemployment and the depression. Conventional economics could not cope with the extraordinary events which took place leaving traditional economic theory with no answer. Keynes first major work which indicates the direction his ideas were taking away from the conventional approach was\nA Treatise on Money\npublished in\n1930\n. His most important work giving the culmination of his ideas was\nThe General Theory of Employment, Interest and Money\npublished in\n1935\n-\n36\n. The two main messages of this work are\n[\n2\n]\n:-\n... the existing theory of unemployment nonsense. In a depression ... there was no wage so low that it could eliminate unemployment. Accordingly, it was wicked to blame the unemployed for their plight. The second proposition proposed an alternative explanation about the origins of unemployment and depression. This centred upon aggregate demand - i.e. the total spending of consumers, business investors, and public agencies. When aggregate demand was low, sales and jobs suffered. When it was high, all was well.\nBy\n1937\nKeynes' health began to deteriorate. He would never be fully fit again. However, his expertise was such that he was given an honorary role in the Treasury during World War II. One of the most important projects he was involved in during his last years was the setting up of the International Monetary Fund.\nThere are a couple of other aspects of Keynes' interests which we should comment on. We have already mentioned his interest in old books, which he had from a very young age. He had a similar interest in modern paintings. One of his main interests was in works of the seventeenth and eighteenth centuries and in particular he was fascinated by\nNewton\n's manuscripts. In\n1936\nNewton\n's papers were sold at Sotheby's and they were dispersed by this sale. Keynes made strenuous attempts to acquire the manuscripts after the sale and these attempts are described in\n[18]\n.\nThe year\n1942\nmarked three hundred years from\nNewton\n's birth\n[\nNewton\nwas born on Christmas day\n1642\nalthough this became\n4\nJanuary\n1643\nin the new calendar\n]\n. Keynes wrote an article\nNewton, the Man\nfor the celebrations. Unlike most accounts of\nNewton\n's life and work which concentrate on\nNewton\n's achievements in mathematics and physics, Keynes gave equal weight to\nNewton\n's writings on alchemy and religion. The reason for this was that he based his account on the manuscripts of\nNewton\n's which he owned and these clearly showed him that, to\nNewton\n, his work on these other topics was as important as his work on mathematical physics.\nIn\n1942\nKeynes was elevated to the peerage and took his seat in the House of Lords, where he sat on the Liberal benches. Around the same time he became chairman of the newly formed Committee for the Encouragement of Music and the Arts which, before the end of the war, was renamed the British Arts Council. Keynes described the purpose of the Arts Council in a radio broadcast:-\nThe purpose of the Arts Council of Great Britain is to create an environment, to breed a spirit, to cultivate an opinion, to offer a stimulus to such purpose that the artist and the public can each sustain and live on the other in that union which has occasionally existed in the past at the great ages of a communal civilised life.\nIn\n[\n3\n]\nKeynes is described as follows:-\nLord Keynes's genius was expressed in his important contributions to the fundamentals of economic science; in his power of winning public interest in the practical application of economics on critical occasions; in his English prose style ... in the brilliant wit, the wisdom, and the range of his private conversation, which would have him a valued member of any intellectual salon or coterie in the ages of polished discussion.",
  "math_areas": [
    "Calculus",
    "Logic",
    "Statistics"
  ]
}