{
  "nome_completo": "John Forbes Nash",
  "nome_curto": "John F Nash",
  "ano_nascimento": "1928",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nash/",
  "lugar_nascimento": "Bluefield, West Virginia, USA",
  "lugar_morte": "New Jersey, USA",
  "biografia": "John F Nash\n's father, also called John Forbes Nash so we shall refer to him as John Nash Senior, was a native of Texas. John Nash Senior was born in\n1892\nand had an unhappy childhood from which he escaped when he studied electrical engineering at Texas Agricultural and Mechanical. After military service in France during World War I, John Nash Senior lectured on electrical engineering for a year at the University of Texas before joining the Appalachian Power Company in Bluefield, West Virginia. John F Nash's mother, Margaret Virginia Martin, was known as Virginia. She had a university education, studying languages at the Martha Washington College and then at West Virginia University. She was a school teacher for ten years before meeting John Nash Senior, and the two were married on\n6\nSeptember\n1924\n.\nJohnny Nash, as he was called by his family, was born in Bluefield Sanitarium and baptised into the Episcopal Church. He was\n[\n2\n]\n:-\n... a singular little boy, solitary and introverted ...\nbut he was brought up in a loving family surrounded by close relations who showed him much affection. After a couple of years Johnny had a sister when Martha was born. He seems to have shown a lot of interest in books when he was young but little interest in playing with other children. It was not because of lack of children that Johnny behaved in this way, for Martha and her cousins played the usual childhood games: cutting patterns out of books, playing hide-and-seek in the attic, playing football. However while the others played together Johnny played by himself with toy airplanes and matchbox cars.\nHis mother responded by enthusiastically encouraging Johnny's education, both by seeing that he got good schooling and also by teaching him herself. Johnny's father responded by treating him like an adult, giving him science books when other parents might give their children colouring books.\nJohnny's teachers at school certainly did not recognise his genius, and it would appear that he gave them little reason to realise that he had extraordinary talents. They were more conscious of his lack of social skills and, because of this, labelled him as backward. Although it is easy to be wise after the event, it now would appear that he was extremely bored at school. By the time he was about twelve years old he was showing great interest in carrying out scientific experiments in his room at home. It is fairly clear that he learnt more at home than he did at school.\nMartha seems to have been a remarkably normal child while Johnny seemed different from other children. She wrote later in life\n(\nsee\n[\n2\n]\n)\n:-\nJohnny was always different.\n[\nMy parents\n]\nknew he was different. And they knew he was bright. He always wanted to do things his way. Mother insisted I do things for him, that I include him in my friendships. ... but I wasn't too keen on showing off my somewhat odd brother.\nHis parents encouraged him to take part in social activities and he did not refuse, but sports, dances, visits to relatives and similar events he treated as tedious distractions from his books and experiments.\nNash first showed an interest in mathematics when he was about\n14\nyears old. Quite how he came to read\nE T Bell\n's\nMen of Mathematics\nis unclear but certainly this book inspired him. He tried, and succeeded, in proving for himself results due to\nFermat\nwhich\nBell\nstated in his book. The excitement that Nash found here was in contrast to the mathematics that he studied at school which failed to interest him.\nHe entered Bluefield College in\n1941\nand there he took mathematics courses as well as science courses, in particular studying chemistry, which was a favourite topic. He began to show abilities in mathematics, particularly in problem solving, but still with hardly any friends and behaving in a somewhat eccentric manner, this only added to his fellow pupils view of him as peculiar. He did not consider a career in mathematics at this time, however, which is not surprising since it was an unusual profession. Rather he assumed that he would study electrical engineering and follow his father but he continued to conduct his own chemistry experiments and was involved in making explosives which led to the death of one of his fellow pupils.\n[\n2\n]\n:-\nBoredom and simmering adolescent aggression led him to play pranks, occasionally ones with a nasty edge.\nHe caricatured classmates he disliked with weird cartoons, enjoyed torturing animals, and once tried to get his sister to sit in a chair he had wired up with batteries.\nNash won a scholarship in the George Westinghouse Competition and was accepted by the Carnegie Institute of Technology\n(\nnow Carnegie-Mellon University\n)\nwhich he entered in June\n1945\nwith the intention of taking a degree in chemical engineering. Soon, however, his growing interest in mathematics had him take courses on tensor calculus and relativity. There he came in contact with\nJohn Synge\nwho had recently been appointed as Head of the Mathematics Department and taught the relativity course.\nSynge\nand the other mathematics professors quickly recognised Nash's remarkable mathematical talents and persuaded him to become a mathematics specialist. They realised that he had the talent to become a professional mathematician and strongly encouraged him.\nNash quickly aspired to great things in mathematics. He took the William Lowell Putnam Mathematics Competition twice but, although he did well, he did not make the top five. It was a failure in Nash's eyes and one which he took badly. The Putnam Mathematics Competition was not the only thing going badly for Nash. Although his mathematics professors heaped praise on him, his fellow students found him a very strange person. Physically he was strong and this saved him from being bullied, but his fellow students took delight in making fun of Nash whom they saw as an awkward immature person displaying childish tantrums. One of his fellow students wrote:-\nHe was a country boy unsophisticated even by our standards. He behaved oddly, playing a single chord on a piano over and over, leaving a melting ice cream cone melting on top of his cast-off clothing, walking on his roommate's sleeping body to turn off the light.\nAnother wrote:-\nHe was extremely lonely.\nAnd a third fellow student wrote:-\nWe tormented poor John. We were very unkind. We were obnoxious. We sensed he had a mental problem.\nHe showed homosexual tendencies, climbing into bed with the other boys who reacted by making fun of the fact that he was attracted to boys and humiliated him. They played cruel pranks on him and he reacted by asking his fellow students to challenge him with mathematics problems. He ended up doing the homework of many of the students.\nNash received a BA and an MA in mathematics in\n1948\n. By this time he had been accepted into the mathematics programme at Harvard, Princeton, Chicago and Michigan. He felt that Harvard was the leading university and so he wanted to go there, but on the other hand their offer to him was less generous than that of Princeton. Nash felt that Princeton were keen that he went there while he felt that his lack of success in the Putnam Mathematics Competition meant that Harvard were less enthusiastic. He took a while to make his decision, while he was encouraged by\nSynge\nand his other professors to accept Princeton. When\nLefschetz\noffered him the most prestigious Fellowship that Princeton had, Nash made his decision to study there.\nIn September\n1948\nNash entered Princeton where he showed an interest in a broad range of pure mathematics:\ntopology\n,\nalgebraic geometry\n,\ngame theory\nand logic were among his interests but he seems to have avoided attending lectures. Usually those who decide not to learn through lectures turn to books but this appears not to be so for Nash, who decided not to learn mathematics \"second-hand\" but rather to develop topics himself. In many ways this approach was successful for it did contribute to him developing into one of the most original of mathematicians who would attack a problem in a totally novel way.\nIn\n1949\n, while studying for his doctorate, he wrote a paper which\n45\nyears later was to win a Nobel prize for economics. During this period Nash established the mathematical principles of game theory. P Ordeshook wrote:-\nThe concept of a Nash equilibrium\nn\nn\nn\n-tuple is perhaps the most important idea in noncooperative game theory. ... Whether we are analysing candidates' election strategies, the causes of war, agenda manipulation in legislatures, or the actions of interest groups, predictions about events reduce to a search for and description of equilibria. Put simply, equilibrium strategies are the things that we predict about people.\nMilnor\n, who was a fellow student, describes Nash during his years at Princeton in\n[\n6\n]\n:-\nHe was always full of mathematical ideas, not only on game theory, but in geometry and topology as well. However, my most vivid memory of this time is of the many games which were played in the common room. I was introduced to Go and Kriegspiel, and also to an ingenious topological game which we called Nash in honour of the inventor.\nIn fact the game \"Nash\" was almost identical to Hex which had been invented independently by Piet Hein in Denmark.\nHere are three comments from fellow students:-\nNash was out of the ordinary. If he was in a room with twenty people, and they were talking, if you asked an observer who struck you as odd it would have been Nash. It was not anything he consciously did. It was his bearing. His aloofness.\nNash was totally spooky. He wouldn't look at you. he'd take a lot of time answering a question. If he thought the question was foolish he wouldn't answer at all. He had no affect. It was a mixture of pride and something else. He was so isolated but there really was underneath it all a warmth and appreciation of people.\nA lot of us would discount what Nash said. ... I wouldn't want to listen. You didn't feel comfortable with the person.\nHe had ideas and was very sure they were important. He went to see\nEinstein\nnot long after he arrived in Princeton and told him about an idea he had regarding gravity. After explaining complicated mathematics to\nEinstein\nfor about an hour,\nEinstein\nadvised him to go and learn more physics. Apparently a physicist did publish a similar idea some years later.\nIn\n1950\nNash received his doctorate from Princeton with a thesis entitled\nNon-cooperative Games\n. In the summer of that year he worked for the RAND Corporation where his work on game theory made him a leading expert on the Cold War conflict which dominated RAND's work. He worked there from time to time over the next few years as the Corporation tried to apply game theory to military and diplomatic strategy. Back at Princeton in the autumn of\n1950\nhe began to work seriously on pure mathematical problems. It might seem that someone who had just introduced ideas which would, one day, be considered worthy of a Nobel Prize would have no problems finding an academic post. However, Nash's work was not seen at the time to be of outstanding importance and he saw that he needed to make his mark in other ways. We should also note that it was not really a move towards pure mathematics for he had always considered himself a pure mathematician. He had already obtained results on manifolds and algebraic varieties before writing his thesis on game theory. His famous theorem, that any compact real manifold is diffeomorphic to a component of a real-algebraic variety, was thought of by Nash as a possible result to fall back on if his work on game theory was not considered suitable for a doctoral thesis. He said in a recent interview:-\nI developed a very good idea in pure mathematics. I got what became Real Algebraic Manifolds. I could have published that earlier, but it wasn't rushed to publication. I took some time in writing it up. Somebody suggested that I was a prodigy. Another time it was suggested that I should be called \"bug brains\", because I had ideas, but they were sort of buggy or not perfectly sound. So that might have been an anticipation of mental problems. I mean, taking it at face value.\nIn\n1952\nNash published\nReal Algebraic Manifolds\nin the\nAnnals of Mathematics\n. The most important result in this paper is that two real algebraic manifolds are equivalent if and only if they are analytically homeomorphic. Although publication of this paper on manifolds established him as a leading mathematician, not everyone at Princeton was prepared to see him join the Faculty there. This was nothing to do with his mathematical ability which everyone accepted as outstanding, but rather some mathematicians such as\nArtin\nfelt that they could not have Nash as a colleague due to his aggressive personality.\nHalmos\nreceived the following letter in early\n1953\nfrom Warren Ambrose relating to Nash\n(\nsee for example\n[\n2\n]\n)\n:-\nThere's no significant news from here, as always. Martin is appointing John Nash to an Assistant Professorship\n(\nnot the Nash at Illinois, the one out of Princeton by\nSteenrod\n)\nand I'm pretty annoyed at that. Nash is a childish bright guy who wants to be \"basically original,\" which I suppose is fine for those who have some basic originality in them. He also makes a damned fool of himself in various ways contrary to this philosophy. He recently heard of the unsolved problem about imbedding a Riemannian manifold isometrically in Euclidean space, felt that this was his sort of thing, provided the problem were sufficiently worthwhile to justify his efforts; so he proceeded to write to everyone in the math society to check on that, was told that it probably was, and proceeded to announce that he had solved it, modulo details, and told\nMackey\nhe would like to talk about it at the Harvard colloquium. Meanwhile he went to\nLevinson\nto inquire about a\ndifferential equation\nthat intervened and\nLevinson\nsays it is a system of\npartial differential equations\nand if he could only\n[\nget\n]\nto the essentially simpler analog of a single ordinary differential equation it would be a damned good paper - and Nash had only the vaguest notions about the whole thing. So it is generally conceded he is getting nowhere and making an even bigger ass of himself than he has been previously supposed by those with less insight than myself. But we've got him and saved ourselves the possibility of having gotten a real mathematician. He's a bright guy but conceited as Hell, childish as\nWiener\n, hasty as X, obstreperous as Y, for arbitrary X and Y.\nAmbrose, the author of this letter, and Nash had rubbed each other the wrong way for a while. They had played silly pranks on each other and Ambrose seems not to have been able to ignore Nash's digs in the way others had learned to do. It had been Ambrose who had said to Nash:-\nIf you're so good, why don't you solve the embedding theorem for manifolds.\nFrom\n1952\nNash had taught at the Massachusetts Institute of Technology but his teaching was unusual\n(\nand unpopular with students\n)\nand his examining methods were highly unorthodox. His research on the theory of real algebraic varieties, Riemannian geometry, parabolic and elliptic equations was, however, extremely deep and significant in the development of all these topics. His paper\nC\nC\nC\n1\nisometric imbeddings\nwas published in\n1954\nand\nChern\n, in a review, noted that it:-\n... contains some surprising results on the\nC\n1\nC^{1}\nC\n1\n-isometric imbedding into an Euclidean space of a Riemannian manifold with a positive definite\nC\n0\nC^{0}\nC\n0\n-metric.\nNash continued to develop this work in the paper\nThe imbedding problem for Riemannian manifolds\npublished in\n1956\n. This paper contains his famous deep implicit function theorem. After this Nash worked on ideas that would appear in his paper\nContinuity of solutions of parabolic and elliptic equations\nwhich was published in the\nAmerican Journal of Mathematics\nin\n1958\n. Nash, however, was very disappointed when he discovered that E De Giorgi had proved similar results by completely different methods.\nThe outstanding results which Nash had obtained in the course of a few years put him into contention for a\n1958\nFields Medal\nbut since his work on parabolic and elliptic equations was still unpublished when the Committee made their decisions he did not make it. One imagines that the Committee would have expected him to be a leading contender, perhaps even a virtual certainty, for a\n1962\nFields\nMedal but mental illness destroyed his career long before those decisions were made.\nDuring his time at MIT Nash began to have personal problems with his life which were in addition to the social difficulties he had always suffered. Colleagues said:-\nNash was always forming intense friendships with men that had a romantic quality. He was very adolescent, always with the boys. He was very experimental - mostly he just kissed.\nHe met Eleanor Stier and they had a son, John David Stier, who was born on\n19\nJune\n1953\n. Eleanor was a shy girl, lacking confidence, a little afraid of men, did not want to be involved. She found in Nash someone who was even less experienced than she was and found that attractive.\n[\n2\n]\n:-\nNash was looking for emotional partners who were more interested in giving than receiving, and Eleanor, was very much that sort.\nNash did not want to marry Eleanor although she tried hard to persuade him. In the summer of\n1954\n, while working for RAND, Nash was arrested in a police operation to trap homosexuals. He was dismissed from RAND.\nOne of Nash's students at MIT, Alicia Larde, became friendly with him and by the summer of\n1955\nthey were seeing each other regularly. He also had a special friendship with a male graduate student at this time: Jack Bricker. Eleanor found out about Alicia in the spring of\n1956\nwhen she came to Nash's house and found him in bed with Alicia. Nash said to a friend:-\nMy perfect little world is ruined, my perfect little world is ruined.\nAlicia did not seem too upset at discovering that Nash had a child with Eleanor and deduced that since the affair had been going on for three years, Nash was probably not serious about her. In\n1956\nNash's parents found out about his continuing affair with Eleanor and about his son John David Stier. The shock may have contributed to the death of Nash's father soon after, but even if it did not Nash may have blamed himself. In February of\n1957\nNash married Alicia; by the autumn of\n1958\nshe was pregnant but, a couple of months later near the end of\n1958\n, Nash's mental state became very disturbed.\nAt a New Year's Party Nash appeared at midnight dressed only with a nappy and a sash with \"\n1959\n\" written on it. He spent most of the evening curled up, like the baby he was dressed as, on his wife's lap. Some described his behaviour as stranger than usual. On\n4\nJanuary he was back at the university and started to teach his game theory course. His opening comments to the class were:-\nThe question occurs to me. Why are you here?\nOne student immediately dropped the course! Nash asked a graduate student to take over his course and vanished for a couple of weeks. When he returned he walked into the common room with a copy of the New York Times saying that it contained encrypted messages from outer space that were meant only for him. For a few days people thought he was playing an elaborate private joke.\nNorbert Wiener\nwas one of the first to recognize that Nash's extreme eccentricities and personality problems were actually symptoms of a medical disorder. After months of bizarre behaviour, Alicia had her husband involuntarily hospitalised at McLean Hospital, a private psychiatric hospital outside of Boston. Upon his release, Nash abruptly resigned from MIT, withdrew his pension, and went to Europe, where he intended to renounce his US citizenship. Alicia left her newborn son with her mother, and followed the ill Nash. She then had Nash deported - back to the United States.\nAfter their return, the two settled in Princeton where Alicia took a job. Nash's illness continued, transforming him into a frightening figure. He spent most of his time hanging around on the Princeton campus, talking about himself in the third person as Johann von Nassau, writing nonsensical postcards and making phone calls to former colleagues. They stoically listened to his endless discussions of numerology and world political affairs. Her husband's worsening condition depressed Alicia more and more.\nIn January\n1961\nthe despondent Alicia, John's mother, and his sister Martha made the difficult decision to commit him to Trenton State Hospital in New Jersey where he endured insulin-coma therapy, an aggressive and risky treatment, five days a week for a month and a half. A long sad episode followed which included periods of hospital treatment, temporary recovery, then further treatment. Alicia divorced Nash in\n1962\n. Nash spent a while with Eleanor and John David. In\n1970\nAlicia tried to help him taking him in as a boarder, but he appeared to be lost to the world, removed from ordinary society, although he spent much of his time in the Mathematics Department at Princeton. The book\n[\n2\n]\nis highly recommended for its moving account of Nash's mental sufferings.\nSlowly over many years Nash recovered. He delivered a paper at the tenth World Congress of Psychiatry in\n1996\ndescribing his illness; it is reported in\n[\n3\n]\n. He was described in\n1958\nas the:-\n... most promising young mathematician in the world ...\nbut he soon began to feel that:-\n... the staff at my university, the Massachusetts Institute of Technology, and later all of Boston were behaving strangely towards me. ... I started to see crypto-communists everywhere ... I started to think I was a man of great religious importance, and to hear voices all the time. I began to hear something like telephone calls in my head, from people opposed to my ideas. ...The delirium was like a dream from which I seemed never to awake.\nDespite spending periods in hospital because of his mental condition, his mathematical work continued to have success after success. He said:-\nI would not dare to say that there is a direct relation between mathematics and madness, but there is no doubt that great mathematicians suffer from maniacal characteristics, delirium and symptoms of schizophrenia.\nIn the\n1990\ns Nash made a recovery from the schizophrenia from which he had suffered since\n1959\n. His ability to produce mathematics of the highest quality did not totally leave him. He said:-\nI would not treat myself as recovered if I could not produce good things in my work.\nNash was awarded\n(\njointly with Harsanyi and\nSelten\n)\nthe\n1994\nNobel Prize in Economic Science for his work on game theory. In\n1999\nhe was awarded the Leroy P Steele Prize by the\nAmerican Mathematical Society\n:-\n... for a seminal contribution to research.\nNash and\nLouis Nirenberg\nwere awarded the Abel prize in\n2015\nfor:-\n... striking and seminal contributions to the theory of nonlinear partial differential equations and its applications to geometric analysis.\nA few days after picking up the prize in Norway, Nash and his wife Alicia were killed in an accident to their taxi on the New Jersey turnpike.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}