{
  "nome_completo": "John Michael Hammersley",
  "nome_curto": "John Hammersley",
  "ano_nascimento": "1920",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hammersley/",
  "lugar_nascimento": "Helensburgh, Dunbartonshire, Scotland",
  "lugar_morte": "Oxford, England",
  "biografia": "John Hammersley\n's parents were Guy Hugh Hammersley and Marguerite Whitehead. Guy Hammersley worked for the United States Steel Corporation and at the time of John's birth he was in charge of their Glasgow office. He had married Marguerite in\n1914\n. She had been born in Russia but her parents were English engaged in selling textile machinery manufactured in Lancashire but she had been educated at an English boarding school. The Hammersley family moved to England when John was very young then, when he was five years old, his father was made redundant but found employment as the London manager for the Youngstown Steel and Tube Company.\nJohn's primary education began in\n1925\nwhen he entered the Waterside School in Bishops Stortford. In\n1929\n, his last year at this elementary school, he was taught Latin and algebra. He then was sent as a boarder to Bembridge School on the Isle of Wight. The education at this school appeared poor and after two terms his parents took him away from the school and sent him instead to a preparatory school in Stratton Park near Bletchley which he attended from\n1930\nto\n1934\n. Here, after a poor experience with his first mathematics teacher, he was taught by Gerald Meister\n[\n1\n]\n:-\nDuring his time at Stratton Park he gave me a solid education in mathematics and a liking for the subject. This covered plenty of Euclidean geometry\n(\nincluding such topics as the nine-point circle\n)\nand algebra\n(\nNewton\n's identities for roots of polynomials\n)\nand trigonometry\n(\nidentities governing angles of a triangle, circumcircle, incircle, etc\n)\n, but no calculus. Due to his help, I got a scholarship to Sedbergh.\nAt Sedbergh he gained qualifications in mathematics, physics and chemistry in\n1937\n. Then, in December\n1937\n, he sat the scholarship examination for Emmanuel College, Cambridge. Having no success, in March\n1938\nhe sat the scholarship examination of New College, Oxford, but again was not successful. Another attempt to win a scholarship to Emmanuel College in December\n1938\nwas successful and he entered the College to begin his university studies in\n1939\n. Of course the start of World War II in that year interrupted his university studies. He enlisted and continued to study mathematics at Cambridge while waiting to be called up for military service. He only obtained a\n3\nrd\nclass pass in the examinations of\n1940\n, then began his war service in the Royal Artillery\n[\n1\n]\n:-\nI was called up for military service in the late summer of\n1940\n, first as a gunner and next as a lance-bombardier at a training camp at Arborfield until being sent to an officer training cadet unit at Shrivenham. I was commissioned as a second lieutenant in the spring of\n1941\nand posted to an anti-aircraft gun site defending an armament factory near Warsham.\nHammersley had learnt of the experiments being conducted with radar while at Shrivenham and he now requested that he receive training\n[\n1\n]\n:-\nThis training began with a six weeks course on basic wireless technology at the Regent Street Polytechnic, followed by a longer and more specialized course on radar at Watchet in Somerset. ... On passing out of Watchet as a qualified I.F.C., which carried the automatic rank of captain, I was posted first to an establishment at Oswestry which trained operators of radar equipment, and next to anti-aircraft brigade headquarters in the Orkneys where I was responsible for the radar installations of the gun sites defending Scapa Flow. Finally in\n1942\nI was transferred to the Trials Wing at Lydstep.\nIn fact this war service proved highly significant in fashioning the future direction of his mathematical career:-\nThere were certain bits of mathematics, of which I had no previous knowledge; in particular I needed to learn about numerical methods and statistics. ... to cover this\n[\nlack of knowledge of statistics\n]\nI obtained leave of absence to return to Cambridge for a few weeks. The first volume of\nM G Kendall\n's book on mathematical statistics had just been published. I also read\nR A Fisher\n's book on statistical methods for research workers. Statistical techniques played an important role at Lydstep in assuring the performance of anti-aircraft radars and predictors, and in liaising with radar developments from the Radar Research Establishment at Malvern. By the end of the war I had been promoted to the rank of major, and appointed a consultant to the Ordnance Board in London.\nReturning to Cambridge in\n1946\nafter the end of World War II, Hammersley was now considerably more motivated than he had been in his pre-war university year. He graduated as a\nWrangler\nin Part II of the Mathematical Tripos in\n1948\nhaving enjoyed courses from A J Ward,\nJ A Todd\nand R A Lyttleton. He had already begun publishing statistical papers with\nThe \"effective\" number of independent observations in an autocorrelated time series\n, a joint publication with G V Bayley apprearing in the\nJournal of the Royal Statistical Society\nin\n1946\n.  After graduating he applied unsuccessfully for lectureships at the universities of Reading and St Andrews, then was appointed\n[\n1\n]\n:-\n... as a graduate assistant at Oxford in the Lectureship in the Design and Analysis of Scientific Experiment.\nWhile at Oxford he published papers such as\nThe unbiased estimate and standard error of the interclass variance\n(1949)\n,\nThe numerical reduction of non-singular matrix pencils\n(1949)\n,\nFurther results for the counterfeit coin problems\n(1950)\n,\nThe distribution of distance in a hypersphere\n(1950)\n, and\nOn estimating restricted parameters\n(1950)\n. Reviewing this last mentioned paper D G Chapman writes:-\nSeveral estimation problems are considered where the parameter space is a discrete set of points. These problems introduce variations from those usually encountered and at the same time focus attention on some of the deeper aspects of the whole general question of estimation. The extensive discussion, in particular, raises several questions in this direction.\nHammersley published a variety of papers in\n1951\nincluding\nA theorem on multiple integrals\n,\nOn a certain type of integral associated with circular cylinders\n,\nThe sums of products of the natural numbers\n, and\nThe total length of the edges of the polyhedron\n. In the same year he married Shirley Gwendolene Bakewell, known as Gwen, on\n14\nJune. They had two sons Julian\n(\nborn\n1954)\nand Hugo\n(\nborn\n1956)\n.\nIn\n1955\nhe was appointed as Principal Scientific Officer at the Atomic Energy Research Establishment, Ministry of Supply, at Harwell, Berkshire. After four years, he returned to Oxford in\n1959\nwhen appointed as Senior Research Officer at the Institute of Economics and Statistics. He was promoted to Reader in Mathematical Statistics in\n1969\n, and in the same year was elected to a Professorial Fellowship at Trinity College, Oxford.\nGeoffrey Grimmett writes\n[\n2\n]\n:-\nHe was the only mathematics don at Trinity until Chris Prior joined in\n1976\n, and he organised Trinity Maths in his own special way. If there were no sufficiently strong candidates in any given year, he would admit none. He believed an Oxford Tutor should be capable of teaching every branch of his subject for the undergraduate degree, and that undergraduates should, in principle, be able to answer questions in all areas. If he was not acquainted with an area, he would work it out live within the tutorial. True to his beliefs, he volunteered classes on problem-solving, but his problems were rather difficult, and few students were able to meet his high standards. Those able to make some progress recognised him as a tremendous force for good in their mathematics education.\nIn\n[\n3\n]\nGrimmett writes:-\nJohn Hammersley was an exceptionally inventive mathematician and a fearless problem-solver. He had the rare ability to identify the basic mathematics of a scientific problem, and to develop an applicable theory. His most outstanding achievements were in the two areas of spatial disorder and Monte Carlo methods, and his scientific legacies in these important fields have proved extremely influential.\nOne of the areas which typified Hammersley's mathematical contributions was in Monte Carlo methods, a technique to estimate a quantity through computations involving random numbers. It is an important method to solve problems using a probabilistic method and in much used in computer systems to attack very hard problems. In\n1965\n, after contributing many papers on the topic, Hammersley published the book\nMonte Carlo Methods\n, jointly authored with D C Handscomb. R R Coveyou writes in a review that the little book of only\n178\npages:-\n... deserves to become the standard introduction to the study of Monte Carlo methods. No detailed analysis of its content is here made because it would be irrelevant. Anyone interested in the subject should read the book. Also, anyone who reads the book will, with probability one, become interested in the subject, and will be able to begin to use it.\nThe book was translated into French and published as\nLes méthodes de Monte-Carlo\nin\n1967\n. With the publication of the book Hammersley seemed to feel that he should move on to other topics, which indeed he did. Although this was his only book, he did publish around\n135\npapers. Let us note the title of a few of these papers to indicate the breadth of his interests:\nElectronic computers and the analysis of stochastic processes\n(1950)\n;\nThe absorption of radioactive radiation in rods\n(1951)\n;\nCapture-recapture analysis\n(1953)\n;\nTables of complete elliptic integrals\n(1953)\n;\nPercolation in crystals: gravity crystals\n(1956)\n;\nThe zeros of a random polynomial\n(1956)\n;\nOn the statistical loss of long-period comets from the solar system\n(1961)\n;\nThe mathematical analysis of traffic congestion\n(1962)\n;\nLong-chain polymers and self-avoiding random walks\n(1963)\n;\nContribution to discussion on subadditive ergodic theory\n(1973)\n;\nThe design of future computing machinery for functional integration\n(1985)\n;\nand Biological growth and spread\n(1980)\n.\nIn addition to his research, Hammersley was also passionately interested in mathematical education and wrote many articles on the topic. His views are clearly stated in the titles of some of these papers, such as:\nOn the enfeeblement of mathematical skills by 'Modern Mathematics' and by similar soft intellectual trash in schools and universities\n(1968)\n; and\nModern mathematics, the great debate: Motion proposing that this house deplores the enthusiastic teaching of modern mathematics, particularly in schools\n(1973)\n.\nIn\n1987\nhe retired from his positions in Oxford and\nDavid Kendall\ngave a\nSpeech proposing the toast to John Hammersley -\n1\nOctober\n1987\nwhich was subsequently published under this title. Hammersley was also honoured with a conference at the Mathematical Institute in Oxford in\n1990\nto celebrate his\n70\nth\nbirthday. Many colleagues and friends came to wish him well and to speak about work which had been influenced by his contributions. The proceedings of the conference were published under the title\nDisorder in physical systems\nedited by G R Grimmett and D J A Welsh\n(\nwho were both Hammersley's doctoral students\n)\n.\nHammersley received many honours for his outstanding contributions. He was awarded the\nVon Neumann\nMedal for Applied Mathematics by the University of Brussels\n(1966)\n. He was elected to the\nRoyal Society\nin\n1976\n.  In\n1984\nhe was awarded the Gold Medal of the Institute of Mathematics and its Applications, and the\nPolya\nPrize of the\nLondon Mathematical Society\nin\n1997\n. He gave the\n1980\nRouse Ball\nlecture under the title\nRoom to wriggle\nat Cambridge University.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}