{
  "nome_completo": "John Dougall",
  "nome_curto": "John Dougall",
  "ano_nascimento": "1867",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dougall/",
  "lugar_nascimento": "Kippen, Stirlingshire, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "John Dougall\n's father was  Robert Dougall\n(\nborn Glasgow\n1840)\nwho was a watch and clock maker as well as the local postmaster. His mother was  Jane Shirra\n(\nborn\n1850)\n. His parents married in Stirling on\n16\nOctober\n1864\n. John Dougall had eight younger siblings:\nCharles Dougall\n(\nborn\n1868)\n, Annie\n(\nborn\n1870)\n, Jessie\n(\nborn\n1873)\n, Robert\n(\nborn\n1874)\n, Mary\n(\nborn\n1876)\n, James\n(\nborn\n1878)\n, Elizabeth\n(\nborn\n1880)\nand Norma\n(\nborn\n1899)\n.\nJohn Dougall was brought up in Kippen, Stirlingshire.  He attended Kippen School, leaving at the age of thirteen in\n1880\n, and taking up a job as a Post Office worker in Stirling. After working for a year, he entered Glasgow University in\n1881\n, still only fourteen years of age. He graduated from Glasgow with an M.A. in\n1886\n.\nAfter graduating, Dougall worked as a Lecturer in Mathematics at the Glasgow and West of Scotland Technical College, Glasgow. He then tutored mathematics in a tutorial college in Glasgow before taking up the employment that he would retain for the rest of his career: namely Publisher's Reader at Blackie & Sons, Glasgow. He was in charge of the mathematical publications of the well-known Glasgow publishers.\nDougall was an excellent research mathematician publishing articles on both pure and applied mathematics in the\nProceedings\nof the\nEdinburgh Mathematical Society\nand the\nTransactions\nof the\nRoyal Society of Edinburgh\n. The\nRoyal Society of Edinburgh\nawarded him their Makdougall-Brisbane Prize\n1902\n-\n4\n.\nHe joined the\nEdinburgh Mathematical Society\nin April\n1885\n, in the third session of the new Society, while he was still an undergraduate at Glasgow University. He was only seventeen years old on joining. Examples of papers he read at meeting of the Society are\nElementary Proof of the Collinearity of the Mid Points of the Diagonals of a Complete Quadrilateral\non Friday\n12\nFebruary\n1897\n;\nMethods of Solution of the Equations of Elasticity\non\n10\nDecember\n1897\n; and\nNotes on Spherical Harmonics\non\n12\nDecember\n1913\n. He was honoured by the Society when elected president for session\n1925\n-\n26\n.\nHe was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1921\n, his proposers being\nGeorge Alexander Gibson\n,\nSir Edmund T Whittaker\n,\nCargill Gilston Knott\n,\nJames Gordon Gray\n.\nAn obituary, written by\nIan N Sneddon\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1962\n, pages\n33\n-\n34\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nWe illustrate his mathematical publication with two examples. In\n1952\nhe published\nThe double six of lines and a theorem in Euclidean plane geometry\nin\nProc. Glasgow Math. Assoc\n. In a review of the paper\nCoxeter\nwrote:-\nRepresenting the lines of projective\n3\n-space by the points of a quadric fourfold Q in projective\n5\n-space, the author shows that\nSchläfli\n's \"double six\" theorem is equivalent to the following:\n\"If a simplex is inscribed in Q in such a way that five of the six bounding hyperplanes touch Q, then the sixth hyperplane likewise touches Q.\"\nBy regarding Q as a\n4\n-sphere in complex Euclidean\n5\n-space, and making some projections, he relates this to a simple theorem of plane geometry:\n\"If a triangle is inscribed in a circle and circumscribed about an ellipse, then the squared product of the radius of the circle and the minor axis of the ellipse is equal to the product of the powers of the two foci with respect to the circle.\"\nHe deduces this from the classical invariant relation, thus providing a new proof for the double six theorem itself.\nIn the following year Dougall published\nThe product of two Legendre polynomials\nin the same journal.\nErdélyi\nwrote:-\nThis paper contains a new derivation of the coefficients in the expansion into a series of\nLegendre\npolynomials of the product of two\nLegendre\npolynomials. The author's ingenious proof is based on the repeated application of\nLaplace\n's operator to homogeneous harmonic polynomials.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}