{
  "nome_completo": "John Charles Fields",
  "nome_curto": "John Charles Fields",
  "ano_nascimento": "1863",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fields/",
  "lugar_nascimento": "Hamilton, Ontario, Canada",
  "lugar_morte": "Toronto, Ontario, Canada",
  "biografia": "John Charles Fields\nwas of Scots-Irish extraction although his parents, Harriet Bowes and John Charles Fields, were both Canadians and lived at\n150\nKing Street East, Hamilton. John Charles Fields Senior was a merchant who owned a leather shop at\n32\nKing Street West, Hamilton, but travelled extensively in the United Kingdom and Europe. He died when his son was eleven years old. Fields attended Hamilton Collegiate Institute where he proved himself to be an outstanding pupil. He was awarded several scholarships and graduated from the Institute in\n1880\n.\nAfter leaving Hamilton Collegiate Institute, Fields entered the University of Toronto in\n1880\nto study mathematics. His undergraduate years were not too easy, for having already lost his father, his mother died while he was in the middle of his university course. Despite this he had an outstanding undergraduate record and he received his B.A. in mathematics from the University of Toronto in\n1884\n, winning the gold medal for mathematics. He then went to the United States to study for his Ph.D. at Johns Hopkins University. After the award of the degree in\n1887\nfor his thesis\nSymbolic Finite Solutions, and Solutions by Definite Integrals of the Equation\n(\nd\nn\n/\nd\nx\nn\n)\ny\n−\n(\nx\nm\n)\ny\n=\n0\n(d^{n}/dx^{n})y - (x^{m})y = 0\n(\nd\nn\n/\nd\nx\nn\n)\ny\n−\n(\nx\nm\n)\ny\n=\n0\n, he remained teaching at Johns Hopkins for a further two years.\nFields was appointed in\n1889\nProfessor of Mathematics at Allegheny College, one of the oldest colleges in Pennsylvania, but resigned after three years so that he might further his mathematical researches by studying in Europe. From\n1892\nto\n1900\nFields studied in Paris, Göttingen and Berlin with\nFuchs\n,\nFrobenius\n,\nHensel\n,\nSchwarz\n,\nWeierstrass\n, and\nPlanck\n. He was awarded the gold medal for mathematics at Berlin. He also met and formed a life-long friendship with\nMittag-Leffler\n. This period was clearly important for his future development as a research mathematician.\nSynge\nwrites in\n[\n4\n]\n:-\nThis long period of study, which exercised a decisive influence on his life and outlook, was rendered possible by a modest private income, combined with simple living and abstemious habits.\nIn\n1902\nFields was appointed to the position of lecturer at the University of Toronto where he remained until his death, although he frequently visited Europe where he was acquainted with many national leaders. For example he attended a dinner party given by the King of Sweden in\n1912\n. He became an Associate Professor in\n1905\nbefore being promoted top full Professor in\n1914\n. In\n1923\nhe was promoted to Research Professor at the University of Toronto.\nHis main research topic was on algebraic functions. He wrote an important book which was published in\n1906\n. The main purpose of the book was to present the\nRiemann\n-Roch Theorem, the\nWeierstrass\nGap Theorem and the related\nHurwitz\nTheorem, and theorems of\nBrill\nand\nMax Noether\n. A colleague and former pupil of Fields gives this summary of his contributions in\n[\n4\n]\n:-\nThe work of Professor Fields on algebraic functions must be regarded as the development and organisation of ideas on the subject which he happened to have at the turn of the century. These had very little reference to prevailing methods. He made it his life work, first to show that they could be used to create a satisfactory theory and then to give to the structure thus secured both elegance and generality. His treatment has the great merit of being completely algebraic in character and of meeting every difficulty without an appeal to geometric intuition. The machinery, which he had to invent for the purpose, is simple, and its parts are beautifully coordinated.\nIt was, however, rather as an organiser of mathematics that Fields excelled. The series of International Congresses of Mathematicians began in Zürich in\n1897\nbut no congress was held during World War I\n(1914\n-\n18)\n. The\nInternational Mathematical Union\nwas set up in\n1920\nat the first post war Congress in Strasbourg to run future congresses but, in the aftermath of war, Germany, Austria-Hungary, Bulgaria, and Turkey were excluded from the Union. This was unfortunate and feelings ran high on the issue. Many felt that mathematics should not be subjected to political pressures but should welcome equally mathematicians of all nations. Leading advocates of that view were\nHardy\nand\nMittag-Leffler\n. Others held equally sincere views that the Union's exclusion rules were right.\nIn\n1922\n, following the collapse of a bid from New York to hold the\n1924\nCongress, Fields made a bid to hold it in Toronto under the auspices of the\nInternational Mathematical Union\n, and although this meant that the congress could not be truly international because of the exclusion rules, it did prevent a break-up of the congress. He was a skilled politician and was able to persuade many opponents of the Union to attend the Toronto Congress and have it succeed. This was not easily achieved and Fields spend several months in Europe working relentlessly to make the Congress a success. He also had to get financial support so that Europeans could be helped with their travel costs to North America. So successful was he in getting financial support that he had money left at the end of the Congress. It gave him the opportunity to come up with a wonderful idea.\nFields is best remembered for conceiving the idea of, and for providing funds for, an international medal for mathematical distinction. The original proposals were put on\n24\nFebruary\n1931\nto the committee who had run the\n1924\nCongress, and money left over from the finances were to be used. Fields had everything in place to travel to the September\n1932\nCongress in Zürich to put forward his proposal for Medals. He had already done the ground work and by January\n1932\nhe had support for awarding Medals from the leading mathematical societies in France, Germany, Italy, Switzerland and the United States.\nYou can see Fields's Letter setting out his proposals at\nTHIS LINK\n.\nHowever, his health began to fail in May of\n1932\nwhen he suffered heart problems. A few days before his death he drew up a will, with\nSynge\nat his bedside, including an amount of $\n47\n,\n000\nto be added to the funds for the medals. He did not live to attend the Congress but his plans were still put forward. Adopted at the International Congress of Mathematicians at Zürich in\n1932\n, the first Fields Medals were awarded at the Oslo Congress of\n1936\n. Notice that they were named \"Fields Medals\" despite his wish that they should not bear anyone's name.\nFields Medals were to be awarded to two mathematicians under\n40\nyears of age every four years at the International Congress of Mathematicians. These conditions were set down to recognise Fields's wish that the awards recognise both work completed and point to the potential for future achievement. Notice that the\n40\nage limit was not explicitly due to Fields. The first Fields Medals were awarded to\nLars Ahlfors\nand\nJesse Douglas\nin\n1936\n. No awards were made during World War II, then beginning from\n1950\nthe Medals have been awarded every four years. In\n1966\nit was decided that no fewer than two Medals would be awarded at each Congress, and no more than four.\nA prize of\n15\n,\n000\nCanadian dollars is awarded with each Fields Medal, which is made of gold, and shows the head of\nArchimedes\n. A quotation attributed to\nArchimedes\nis inscribed:-\nTransire suum pectus mundoque potiri.\n(\nRise above oneself and grasp the world.\n)\nThe inscription:-\nCongregati ex toto orbe mathematici ob scripta insignia tribuere\n(\nThe mathematicians assembled here from all over the world pay tribute for outstanding work\n)\nappears on the reverse.\nFields received several important honours. He was elected a fellow of the\nRoyal Society of Canada\nin\n1907\nand, in\n1913\n, he was elected a fellow of the\nRoyal Society of London\n. In\n1924\nthe International Congress of Mathematicians was held at Toronto and Fields was honoured by being President of the Congress. He was vice-president of the next International Congress of Mathematicians at Bologna in\n1928\n(\nat which the excluded nations were readmitted\n)\n. He also held the position of President of the Royal Canadian Institute from\n1919\nto\n1925\n. He was president of the\nInternational Mathematical Union\n, vice-president of the\nBritish Association for the Advancement of Science\n, and vice-president of the American Association for the Advancement of Science all in the year\n1924\n. He was also elected a member of the\nRussian Academy of Sciences\nand of the Institute of Coimbra. An interesting aside is that the Italian Government wanted to honour Fields with the title \"Commander of the Crown of Italy\", but the Canadian Government had a law forbidding Canadian citizens from holding titles, so Fields had to refuse the Italian government's offer.\nLet us end this biography by giving a few details of Fields's life outside the world of mathematics. He never married. As a young man he loved sport, playing baseball, football and hockey. He also loved walking. Music was a great joy to him and he played the violin, and loved dancing\n[\n4\n]\n:-\nIn his habits of life he was abstemious, avoiding tea, coffee, alcohol, and condiments, and he did not smoke ... he possessed a good sense of humour ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}