{
  "nome_completo": "John West",
  "nome_curto": "John West",
  "ano_nascimento": "1756",
  "ano_morte": "1817",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/West/",
  "lugar_nascimento": "Logie (near Cupar), Scotland",
  "lugar_morte": "Morant Bay, Jamaica",
  "biografia": "John West\n's parents were Samuel West and Margaret Mein. Samuel was a Church of Scotland minister in Logie, about ten km north west of St Andrews, from\n1751\n. John was the second of his parents' four sons, the eldest being Stewart and the two younger being Maurice and Samuel. There were also five girls in the family, two born before John and three later.\nJohn's father Samuel West died in\n1766\n, the year that Stewart matriculated at the University of St Andrews. The family were now in financial difficulties and although they were helped out by the kindness of the presbytery clerk who donated his small salary from that role, Margaret West had a hard struggle to educate her sons. John matriculated at the University of St Andrews in\n1769\nat the age of thirteen and was successful in his studies winning prizes for mathematics and physics. Like most students at this time he chose not to pay the necessary fee to graduate.\nNicholas Vilant\nwas the regius professor of mathematics at St Andrews when West was a student, but around\n1775\nhis health deteriorated and he employed assistants. West was assistant to\nNicholas Vilant\nfrom\n1775\nto\n1780\nin which year he was given full charge of all mathematics classes at St Andrews. This resulted in a small increase in his salary but it was still hard for him to make ends meet. His mother had died in\n1777\nand since both his brothers Stewart and Maurice West had emigrated to Jamaica, it left John as the eldest son responsible for supporting his sisters.\nWhile teaching at St Andrews, West taught\nJohn Leslie\nand\nJames Ivory\n. The obituary\n[\n3\n]\nfor\nSir John Leslie\n(\npossibly written by\nWilliam Wallace\n)\npraises West as a teacher:-\n[\nLeslie\n]\nhad the advantage of receiving the instruction of Mr West, the author of an elementary course of mathematics, a man of original and inventive genius, and, after Dr\nMatthew Stewart\n, one of the greatest masters of the ancient geometry, whom Scotland has produced. From this meritorious individual, who has never had justice rendered to his talents, and who, perhaps from that ignorance of the arts of advancement which is so frequently the lot of the secluded student, never succeeded in surmounting the obstacles of an unfavourable position,\nLeslie\nreceived an impulse to which he owed, in a great degree, all his future success.\nFor financial reasons, he resigned his position at the University of St Andrews and went to Jamaica in\n1784\n. By this time two of his four sisters had already emigrated to Jamaica and the two sisters who had remained in Scotland now emigrated with John West. Perhaps his poor treatment by the University in financial terms and a desire to reunite the family were both behind his move. In other ways his career was becoming successful at precisely the time he left for he had just published his\nElements of Mathematics\nand\nA new system of shorthand\n. Apart from a few visits to England, he spent the remainder of his life in Jamaica becoming first a teacher at Manning's Free School at Savannah-la-Mar. He returned to England in\n1785\nwhen he was ordained an Anglican priest and, after leaving Manning's Free School, was for\n28\nyears rector of St Thomas in the East, Morant Bay. In the year he left Manning's School, West married Anne Kelly; they had several children. A fascinating account of West's time in Jamaica is given by\nCraik\nin\n[\n2\n]\n.\nLet us look now at West's\nElements of Mathematics\n(1784)\n. The first thing to say about this work is that it is a geometry book. The second is to say that, although not a commentary on\nEuclid\n's\nElements\n, nevertheless it does follow a similar path albeit with West's own ordering and own proofs. First let us quote from the Preface to see exactly how West thought about the connection between his book and\nEuclid\n:-\nMy original intention was not to include the First Elements of Geometry ... that the 'Elements' of\nEuclid\nmight continue to serve the purpose which they had done for many ages. My design was only to build upon the foundation which that illustrious author had laid, and, under the several heads of 'Conic Sections', Mensuration', and 'Spherics', to complete a system of Geometry for the purpose of youth. ...\n... As I proposed to establish it entirely upon geometrical principles, I could derive no assistance from some of the best authors on the subject I treat, who have introduced both Algebra and Fluxions into their demonstrations ...\n[\nbut\n]\nconsidering the improved state of mathematics,\nEuclid\n's Geometry is now inadequate and defective, as an elementary work ...\nThe doctrine of Proportion is perhaps the most important in mathematics, and as treated by\nEuclid\n, discovers great penetration and sagacity ...\n[\nyet\n]\nhis manner of treating this difficult subject is so obscure as to render it almost unintelligible to the reader. ...\n[\nThis\n]\ndetermined me to attempt a new theory of proportion, and to introduce a new system of the Elements of Geometry as the first part of my work.\n... I have continually kept in view the celebrated Ancient. Indeed, I have never departed from him, unless I could give more easy demonstrations, or could substitute more useful or more general theorems .... I reflect with pleasure that, notwithstanding considerable additions, ... the number of propositions is so much abridged as to render the study of it a task of much less labour and difficulty. ...\nI am aware of an objection arising from the conciseness of this work. It will be said, perhaps, that many propositions are left undemonstrated, and annexed as corollaries to others. ... But I have to observe that such propositions serve to sharpen the genius, and to exercise the invention of youth; and that, considering how much they are accustomed to exercises of memory, ... it is of the utmost importance to engage them now to exert the powers of the understanding. ... Many students estimate the difficulty of their task by its length; they wish to continue to lay the burden on their memory, and they imagine that to repeat is the same thing as to comprehend. That they may be induced, therefore, to apply all their powers of reason ... i have thought it requisite ... to leave such propositions as easily follow from those that are demonstrated, without further evidence of their truth. For if the evidence ... be explained, when necessary, by the teacher, thy will be much sooner apprehended than in the more formal demonstration.\nTwo manuscript treatises were sent, after his death, to\nJohn Leslie\n, but these were not published until\n1838\n. These show West to have been familiar with the works of\nLagrange\n,\nLaplace\nand\nArbogast\nand, had they been published promptly, would have established him as a leading British exponent of Continental analysis and its applications. We refer the reader to\n[\n2\n]\nfor a detailed discussion of this work.\nWest died in Jamaica. His parishioners erected a plaque:-\n... as a testimony of their high sense of his exemplary conduct during the long period of his ministry and of his many private virtues.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}