{
  "nome_completo": "John Torrence Tate",
  "nome_curto": "John Torrence Tate",
  "ano_nascimento": "1925",
  "ano_morte": "2019",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tate/",
  "lugar_nascimento": "Minneapolis, Minnesota, USA",
  "lugar_morte": "Lexington, Massachussets, USA",
  "biografia": "First let us clarify that\nJohn Torrence Tate\nshould have Jr after his name since his father was also named John Torrence Tate. John Tate Sr\n(\nborn Lennox, Iowa,\n28\nJuly\n1889)\nhad a father of Scottish descent and a mother of Irish descent. He obtained a degree in physics from the University of Nebraska and was then awarded a doctorate by the University of Berlin. He married Lois Beatrice Fossler, a high school teacher of English, on\n28\nDecember\n1917\nby which time he was on the staff at the University of Minnesota. John Tate Sr. was a full professor of physics at the University of Minnesota when his son John Torrence Tate Jr was born. John Tate Jr, the subject of this biography, was brought up in Minneapolis.\nIn\n1939\nJohn's mother died. During World War II, John's father served on the National Defense Research Committee, in charge of the Division which researched undersea warfare. John grew up with a fascination for mathematical puzzles, in particular reading books by\nHenry Dudeney\nthat his father owned. When at high school, he read\nE T Bell\n's\nMen of mathematics\nfrom which he learnt about quadratic reciprocity and Dirichlet's theorem on primes in an arithmetic progression. However, despite loving the ideas he had read about, he thought that mathematics was a subject for people who were cleverer than he was, so he decided to study physics at university. He graduated from Harvard University in\n1946\nand went to Princeton University, still with the intention of undertaking research in physics. However, during his first year of graduate study at Princeton it became clear to him that mathematics was not only the subject he liked best but it was also the subject for which he had the most talent. He was allowed to transfer to graduate study in mathematics and was assigned\nEmil Artin\nas his thesis advisor. It was pure coincidence that his thesis advisor had made major contributions to the topics that had most fascinated Tate when he was a schoolboy.\nIn\n1950\nTate was awarded his doctorate for his thesis\nFourier Analysis in Number Fields and Hecke's Zeta Functions\n[\n5\n]\n:-\nIn his doctoral thesis, Tate introduced harmonic analysis into number theory, paving the way for the adelic approach to automorphic forms and the\nLanglands\nprogramme.\nIn\n[\n4\n]\nthe authors write:-\nIn his thesis, which has become a classic, he proved the functional equation for\nHecke\n's L-series by a novel method involving\nFourier analysis\non idele groups.\nThe thesis was published in\n1967\n. Returning to\n1950\n, the year Tate was awarded his doctorate, we note that his father died in May of that year.\nTate was appointed as a research assistant and instructor at Princeton in\n1950\n. The\nArtin\n-Tate seminar on class field theory given at Princeton University in\n1951\n-\n1952\ncovered cohomology theory of groups, the fundamentals of\nalgebraic number theory\n, a preliminary discussion of class formations, local class field theory, global class field theory, and the abstract theory of class formations and\nWeil\ngroup. Parts of this was written up as the book\nClass field theory\nby\nArtin\nand Tate and published in\n1968\n. During his three years\n(1950\n-\n53)\nas a research assistant at Princeton, Tate published papers such as:\nOn the relation between extremal points of convex sets and homomorphisms of algebras\n(1951)\n;\n(\nwith\nEmil Artin\n)\nA note on finite ring extensions\n(1951)\n;\nGenus change in inseparable extensions of function fields\n(1952)\n;\n(\nwith\nSerge Lang\n)\nOn Chevalley's proof of Luroth's theorem\n(1952)\n; and\nThe higher dimensional cohomology groups of class field theory\n(1952)\n. For this last mentioned paper, Tate received the\nFrank Nelson Cole\nPrize in Number Theory from the\nAmerican Mathematical Society\nin\n1956\n. He spent the year\n1953\n-\n54\nas a visiting professor at Columbia University then, in\n1954\n, he was appointed to Harvard University. He remained in this position until\n1990\nwhen he accepted the Sid Richardson Regents Chair at the University of Texas at Austin.\nThe\nLondon Mathematical Society\nelected Tate to Honorary Membership in\n1999\n. We quote from the citation in\n[\n5\n]\nwhich gives an overview of Tate's remarkable contributions to mathematics:-\nHis work on class field theory and\nGalois\ncohomology over local and global fields, especially his duality theory, underpins much of modern number theory; and the Tate cohomology groups for finite groups, which he invented for use in class field theory, are a standard tool of algebraists. Tate's deep insights have had a crucial impact on the development of arithmetic\nalgebraic geometry\nfrom the sixties onwards. Perhaps most celebrated are his conjectures about algebraic cycles on varieties over finite and global fields, formulated\n35\nyears ago but still largely unproved. Equally striking is his seminal\n1966\npaper 'p-divisible groups', which for the first time recognised the richness of p-adic representations of the absolute\nGalois\ngroup of a p-adic field, as well as indicating the existence of a p-adic analogue of\nHodge\ntheory. This is now a key tool in understanding the arithmetic of algebraic varieties. Tate's work on classification of abelian varieties over finite fields is a core part of standard theory, underpinning almost all work on the L-functions of\nShimura\nvarieties as well as being the starting point for the study of motives over finite fields. Through his discovery of rigid analytic spaces, he established new foundations for p-adic global analysis which have wide applicability in number theory, algebraic geometry and\nrepresentation theory\n. The theory of elliptic curves owes an enormous amount to his contributions, both theoretical and computational; the theory of height functions\n(\nNeron-Tate and Mazur-Tate\n)\nand descent theory\n(\nincluding his construction of the notorious\nShafarevich\n-Tate group\n)\nare of key importance in understanding the arithmetic of elliptic curves, and Tate's algorithm for determining the bad reduction of an elliptic curve plays an equally important role in computation. Other contributions of deep significance include his work with\nSerre\non the deformation theory of abelian varieties, his contributions to algebraic K-theory and its relation with\nGalois\ncohomology, his work on the Stark conjectures, and most recently his work in non-commutative ring theory.\nTate received a Sloan Fellowship during\n1959\n-\n61\n, and a Guggenheim Fellowship during\n1965\n-\n66\n. He was a plenary speaker at the International Congress of Mathematicians held in Nice in\n1970\nwhen he gave the lecture\nSymbols in Arithmetic\n. In\n1972\nhe was the\nAmerican Mathematical Society\n's Colloquium Lecturer and spoke on\nThe arithmetic of elliptic curves\n. He was a member of the committee that decided on the awards of the\nFields Medals\nin\n1974\n. The committee surprised the mathematical world by only making two awards\n(\nto\nEnrico Bombieri\nand\nDavid Mumford\n)\n. It was Tate who reported on\nMumford\n's work at the awarding ceremony at the International Congress of Mathematicians in Vancouver.\nTate was honoured with election to the\nU.S. National Academy of Sciences\nin\n1969\nand to the\nAcadémie de Sciences\nin Paris in\n1992\n. In\n1995\nhe received the Leroy P Steele Prize For Lifetime Achievement from the\nAmerican Mathematical Society\n[\n6\n]\n:-\n... for scientific accomplishments spanning four and a half decades. He has been deeply influential in many of the important developments in algebra, algebraic geometry, and number theory during this time.\nIn\n2003\nhe received the Wolf prize:-\n... for his creation of fundamental concepts in algebraic number theory.\nAlthough the citation is similar to that of the\nLondon Mathematical Society\nwhich we quoted above, we give the following extract:-\nFor over a quarter of a century, Professor John Tate's ideas have dominated the development of arithmetic algebraic geometry. Tate has introduced path breaking techniques and concepts, that initiated many theories which are very much alive today. These include\nFourier\nanalysis on local fields and adele rings,\nGalois\ncohomology, the theory of rigid analytic varieties, and p-divisible groups and p-adic\nHodge\ndecompositions, to name but a few. Tate has been an inspiration to all those working on number theory. Numerous notions bear his name: Tate cohomology of a finite group, Tate module of an abelian variety, Tate-\nShafarevich\ngroup, Lubin-Tate groups, Neron-Tate heights, Tate motives, the\nSato\n-Tate conjecture, Tate twist, Tate elliptic curve, and others. John Tate is a revered name in algebraic number theory.\nIn the first semester of the academic year\n1980\n-\n81\nTate gave a course of lectures on Stark's conjectures at Université de Paris-Sud\n(\nOrsay\n)\n. This was published in\n1984\nas\nLes conjectures de Stark sur les fonctions L d'Artin en s\n=\n0\n. This is not the only book by Tate based on a lecture course he had given previously. In\n1992\nhe published\nRational points on elliptic curves\ncoauthored with Joseph H Silverman. This book was based on a course Tate had given over\n30\nyears earlier in\n1961\nat Haverford College. Andrew Bremner begins a review as follows:-\nThe authors' goal has been to write a textbook in a technically difficult field which is accessible to the average undergraduate mathematics major, and it seems that they have succeeded admirably. The book is quite delightful. ... The most obvious drawback to a text for undergraduates in a field such as this is that it is not possible to be entirely rigorous, and so, as the authors declare, \"much of the foundational material on elliptic curves presented in Chapter I is meant to explain and convince, rather than rigorously prove.\" An appendix does develop the necessary algebraic geometry, but throughout the book the approach to the underlying geometry is informal, allowing a more rapid and intuitive access to the number theory.\nOn\n24\nMay\n2000\n,\nAtiyah\nand Tate presented the Clay Mathematics Institute Millennium Prize Problems in Paris. Tate's lecture covers the\nRiemann\nhypothesis, the Birch-Swinnerton-Dyer conjecture and the\nP\n=\nN\nP\nP = NP\nP\n=\nN\nP\nproblem. He explained the problems and put them into their historical context.\nOn\n24\nMarch\n2010\nthe President of the Norwegian Academy of Science and Letters announced that Tate would be presented with the\nAbel\nPrize in Oslo on\n25\nMay:-\n...  for his vast and lasting impact on the theory of numbers.\nThe press release reads:-\nThe theory of numbers stretches from the mysteries of prime numbers to the ways in which we store, transmit, and secure information in modern computers. Over the past century it has developed into one of the most elaborate and sophisticated branches of mathematics, interacting profoundly with other key areas. John Tate is a prime architect of this development. John Tate's scientific accomplishments span six decades. A wealth of essential mathematical ideas and constructions were initiated by Tate and later named after him, such as the Tate module, Tate curve, Tate cycle,\nHodge\n-Tate decompositions, Tate cohomology,\nSerre\n-Tate parameter, Lubin-Tate group, Tate trace,\nShafarevich\n-Tate group, Néron-Tate height, to mention just a few. According to the\nAbel\ncommittee, \"Many of the major lines of research in algebraic number theory and arithmetic geometry are only possible because of the incisive contributions and illuminating insights of John Tate. He has truly left a conspicuous imprint on modern mathematics.\"\nWe should end with one final note. Tate was one of the younger members of the\nBourbaki\nteam and almost unique in that team in that he was not French.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}