{
  "nome_completo": "John Wishart",
  "nome_curto": "John Wishart",
  "ano_nascimento": "1898",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wishart/",
  "lugar_nascimento": "Montrose, Scotland",
  "lugar_morte": "Acapulco, Mexico",
  "biografia": "John Wishart\n's father was  John Wishart\n(\nborn in Montrose, Forfarshire about\n1867)\nwho was a 'boot cutter and closer'. His mother was  Elizabeth Wishart\n(\nborn in Edinburgh about\n1866)\n. He had an older brother Scott\n(\nborn about\n1897)\nand a younger brother James\n(\nborn about\n1900)\n.\nWishart's family moved from Montrose to Perth in Scotland when John was two years old. He attended Perth Academy and then, in\n1916\n, entered the University of Edinburgh. There he was taught mathematics by\nE T Whittaker\n.\nWorld War I meant that Wishart's university career was disrupted. He spent two years from\n1917\nto\n1919\nin the Black Watch regiment and served in France in\n1918\n. He completed his university course in\n1922\n, graduating with a First Class degree in mathematics and physics. He had taken a teacher training course at Moray House as part of his degree and, after graduating, he moved to Leeds accepting a post as mathematics teacher at West Leeds High School.\nIn\n1924\n, after a recommendation from\nWhittaker\n, Wishart was offered a post in University College, London, as assistant to\nPearson\n.\nPearson\nhad a project for Wishart to work on and, given that\nWhittaker\nhad set up his mathematical laboratory in Edinburgh, it was clear why\nWhittaker\n's advice on a possible assistant had been sought.\nPearson\nhad published his\nTables of the Incomplete\nGamma Function\nin\n1922\nand now he was looking for computational help in his next 'tables' project\nTables of the Incomplete\nBeta Function\n.\nWishart learned a great deal of statistics during his three years with\nPearson\n. He attended\nPearson\n's lectures and learnt how to go about statistical research. After a few months as a Mathematical Demonstrator at Imperial College, Wishart accepted an offer from\nR A Fisher\nto be his statistical assistant at Rothamsted.\nWhen\nYule\nleft his Cambridge lectureship in Statistics in\n1931\nthere was a reorganisation of statistics teaching at Cambridge. A Readership in Statistics was created in the Faculty of Agriculture to teach courses in that Faculty and courses in Mathematics. A separate lectureship in Economic Statistics was also created. Wishart was appointed to the Readership in the Faculty of Agriculture.\nA laboratory was set up by Wishart at Cambridge for his postgraduate students.\nCochran\nwas one of these postgraduates and he described his time studying with Wishart:-\nIn those days he believed in his students keeping office hours. When he assigned me a desk in the Laboratory, he told me that he expected me to be sitting at the desk most of the day when not in class. He instructed me to do three hours computing a day on a table of the\n1\n% level of z to\n7\ndecimal places ... Having anticipated a free and easy life as a graduate student, punctuated of course by periods of esoteric thinking when the spirit moved me, I didn't much like either the office hours or the computing, but I don't think they did me any harm.\nThere were two aspects to Wishart's teaching at Cambridge since he taught both mathematics students and agriculture students. This suited him well since he had both a flair for mathematical statistics and a flair for very practical applications of experimental design. The arrangement did not suit other academics at Cambridge, however, and Wishart had to fight many academic battles.\nThe problem that Wishart's position caused at Cambridge was that he was too high powered a statistician for those in Agriculture but the mathematicians were also unhappy to send their students to the Faculty of Agriculture for statistics courses, and they would have much preferred to have statistics completely within Mathematics.\nIf World War II had not come along it is unclear how the problems would have resolved themselves. As it was, Wishart worked in army Intelligence from\n1940\nto\n1942\nand then on statistical work for the Admiralty from\n1942\nto\n1946\n. The problems he had been having at Cambridge before the War made him think long and hard about whether to return, but his love of teaching, more than anything else, took him back.\nAt Cambridge more statisticians were taken on within Mathematics and a Statistical Laboratory was set up within the Mathematics Faculty in\n1949\n. Wishart became Head of the Statistical Laboratory in\n1953\n.\nIn\n[\n2\n]\nWishart's international connections are summed up:-\nThere are probably few statisticians who have had more friends scattered across the world that had John Wishart. Many of these friendships were made in the course of his work as a teacher of statistical method to practical agriculturists overseas. ... A pioneering visit to Nanking University in\n1934\nhad been followed after the war by visits to Spain in\n1947\n, to the United States in\n1949\n, to India in\n1954\nand then, in his last year, to Mexico, where he was taking a leading part in the work of the Training Centre in Experimental Design arranged by the United Nations Food and Agricultural Organisation.\nSome of Wishart's most important publications were in the\n1928\n-\n32\nperiod before he became so involved with teaching at Cambridge. In\n1928\nhe derived the generalised product-moment distribution which is now named the Wishart distribution. This distribution is described in\n[\n1\n]\nas:-\n... fundamental to multivariate statistical analysis ...\nand is fully described on pages\n154\nto\n163\nof\n[\n2\n]\n. As well as further papers on the Wishart distribution, he also studied properties of the distribution of the multiple correlation coefficient which\nFisher\nhad considered earlier. In addition he wrote many papers on agricultural applications of statistics such as fertiliser trials, sugar beet experiments, crop experimentation and pig nutrition.\nWishart was also much involved with the work of the\nRoyal Statistical Society\n. He was one of the Fellows who formed the organising committee of the Agriculture research section in\n1933\n. In\n1945\nhe became chairman of the\nRoyal Statistical Society\n's Research Section. He also sat on two committees of the\nRoyal Statistical Society\non the Teaching of Statistics: the reports of these committees appearing in the\nJournal of the Royal Statistical Society\nin\n1948\nand\n1955\n.\nOne other service that Wishart performed for statistics was his editorial work for\nBiometrika\n. He served as Assistant editor from\n1937\nand Associate Editor from\n1948\n.\nWishart died in a bathing accident in Acapulco, Mexico, which he was visiting as a representative of the United Nations Food and Agriculture Organisation to arrange setting up a research centre to apply statistical techniques in agricultural research.",
  "math_areas": [
    "Analysis",
    "Statistics"
  ]
}