{
  "nome_completo": "John Machin",
  "nome_curto": "John Machin",
  "ano_nascimento": "1680",
  "ano_morte": "1751",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Machin/",
  "lugar_nascimento": null,
  "lugar_morte": "London, England",
  "biografia": "Little is known about\nJohn Machin\n's early life. We know that he acted as a private tutor to\nBrook Taylor\nteaching him mathematics in\n1701\n, two years before\nTaylor\nentered St John's College Cambridge. He continued to correspond with\nTaylor\nfor many years and this is a useful source for understanding his mathematical thinking. The two met in coffeehouses, a standard place where mathematical discussions were held during this period. We also know that Machin was friendly with\nKeill\n, who taught at Oxford, and with\nde Moivre\nwho like Machin was a private tutor of mathematics at this time.\nIn\n1706\nWilliam Jones\npublished a work\nSynopsis palmariorum matheseos or, A New Introduction to the Mathematics, Containing the Principles of Arithmetic and Geometry Demonstrated in a Short and Easie Method ... Designed for ... Beginners\n. This contains on page\n243\nthe following passage:-\nThere are various other ways of finding the lengths or areas of particular curve lines, or planes, which may very much facilitate the practice; as for instance, in the circle, the diameter is to the circumference as\n1\nto\n(\n16\n5\n−\n4\n239\n)\n−\n1\n3\n(\n16\n5\n3\n−\n4\n23\n9\n3\n)\n \n.\n.\n.\n=\n3.14159...\n=\nπ\n(\\frac{16}{5} - \\frac{4}{239}) - \\frac{1}{3} (\\frac{16}{5^3} - \\frac{4}{239^3})\\, ... = 3.14159 ... = \\pi\n(\n5\n1\n6\n​\n−\n2\n3\n9\n4\n​\n)\n−\n3\n1\n​\n(\n5\n3\n1\n6\n​\n−\n2\n3\n9\n3\n4\n​\n)\n.\n.\n.\n=\n3\n.\n1\n4\n1\n5\n9\n.\n.\n.\n=\nπ\n. This series\n(\namong others for the same purpose, and drawn from the same principle\n)\nI received from the excellent analyst, and my much esteemed friend Mr John Machin; and by means thereof,\nvan Ceulen\n's number, or that in Art.\n64\n.\n38\nmay be examined with all desirable ease and dispatch.\nJones\nalso reports that this formula allows π be calculated:-\n... to above\n100\nplaces; as computed by the accurate and ready pen of the truly ingenious Mr John Machin.\nNo indication is given in\nJones\n's work, however, as to how Machin discovered his series expansion for π so when\nde Moivre\nwrote to\nJohann Bernoulli\non\n8\nJuly\n1706\ntelling him about Machin's series for π he suggested that\nJohann Bernoulli\nmight tell\nJakob Hermann\nabout Machin's unproved result. He did so and\nHermann\nquickly discovered a proof that Machin's series converges to π. He produced techniques that show other similar series also converge rapidly to π and he wrote on\n21\nAugust\n1706\nto\nLeibniz\ngiving details. Two years later, on\n6\nJuly\n1708\n,\nde Moivre\nwrote again to\nJohann Bernoulli\nabout Machin's series, on this occasion giving two different proofs that it converged to π.\nOn\n30\nNovember\n1710\nMachin was elected a Fellow of the\nRoyal Society\n.\nKeill\nhad published a paper in the\nTransactions of the Royal Society of London\nwhich accused\nLeibniz\nof plagiarism and\nLeibniz\nwrote to the\nRoyal Society\ncomplaining strongly.\nKeill\nrepeated his accusations in a letter to\nLeibniz\nsaying that two letters from\nNewton\n, sent to\nLeibniz\nthrough Oldenburg, must have given him the principles of the calculus.\nLeibniz\nwrote again to the\nRoyal Society\nasking them to correct the wrong done to him by\nKeill\n's claims. In response to this letter the\nRoyal Society\nset up a committee to pronounce on the priority dispute. It was totally biased, not asking\nLeibniz\nto give his version of the events and having a membership consisting of\nNewton\n's friends. Machin, as well as\nKeill\nand\nTaylor\n, sat on the committee and, of course, found in favour of\nNewton\n.\nWe have already mentioned that\nTaylor\nwas a friend of Machin and that the two corresponded about mathematical questions.\nTaylor\nwrote to Machin on\n26\nJuly\n1712\nstating what we now call\nTaylor's theorem\n.\nTaylor\nwrote in this letter that a comment made by Machin during a coffeehouse conversation had given him the idea. Machin had explained to\nTaylor\nin Child's Coffeehouse how to use\nNewton\n's series to solve\nKepler's problem\nand also how\nHalley\n's method finds roots of polynomial equations. This was the spark which led\nTaylor\nto one of two versions of his theorem which he published three years later.\nOn\n16\nMay\n1713\nMachin was appointed as Professor of Astronomy at Gresham College, London. He succeed Dr Torriano and went on to hold the chair until his death\n38\nyears later. For nearly\n30\nof these years he acted as Secretary to the\nRoyal Society\n, being appointed in\n1718\nand holding the post until\n1747\n.\nBernard Cohen and Anne Whitman write of the third edition of\nNewton\n's\nPrincipia\n[\n1\n]\n:-\nWhile\nNewton\nwas planning for a third edition, he received two independent solutions of the problem of the motion of the nodes of the moon's orbit, one by John Machin, the other by Henry Pemberton. He chose to include in the third edition the presentation by Machin rather than the one by Pemberton.\nA Scholium was added to Book\n3\n, Proposition\n33\nof the third edition of the\nPrincipia\nwhich begins:-\nJ Machin, Professor of Astronomy, and Henry Pemberton, M.D., have independently found the motion of the nodes by yet another method. Some mention of the latter's method have been made elsewhere. And the papers\n(\nwhich I have seen\n)\nof both men contained two propositions, which agreed with each other. Here I shall present Mr Machin's paper, since it was the first to come into my hands.\nHowever, in\n[\n2\n]\n, Machin's paper\nThe Laws of the Moon's Motion According to Gravity\nwhich was included in Andrew Motte's\n1729\nEnglish translation of\nNewton\n's\nPrincipia\nis described at \"a poor performance\". Machin's\nQuadrature of the Circle\nappeared as an appendix to\nMaseres\n'\nA Dissertation on the Use of the Negative Sign in Algebra: Containing a Demonstration of the Rules Usually Given Concerning it\n, published in London in\n1758\n. In\nScriptores Logarithmic\n(1796)\nMaseres\nwrites:-\nMr William\nJones\n's Synopsis palmariorum matheseo which was published in the year\n1706\nis the only book in which as I believe the series of Mr Machin had ever made its appearance before the publication of my Dissertation on the Use of the Negative Sign in Algebra in the year\n1758\n. And the short and obscure manner in which it is stated in the foregoing passage of Mr\nJones\n's book left the mathematicians in England in the dark as to the method in which it was obtained.\nOne other publication by Machin is worth noting, namely\nThe solution of\nKepler\n's problem\nwhich was published in the\nPhilosophical Proceedings of the Royal Society\nin\n1738\n. However this work, like most of his contributions to astronomy, is not highly rated.\nClerke writes in\n[\n2\n]\nabout another astronomy project:-\nA large work on the lunar theory taken in hand by\n[\nMachin\n]\nin\n1717\nnever saw the light, but a mass of his manuscripts is preserved by the\nRoyal Astronomical Society\n; and writing to\nJones\nin\n1727\n, he asserted his claim to the parliamentary reward of £\n10\n,\n000\nfor amending the lunar tables.\nMachin's work on the series for has proved of lasting importance, but most of his other contributions are not of the same high standard. Despite this he had a considerable influence of the development of mathematics in England and, in his time,\n[\n2\n]\n:-\n... enjoyed a high mathematical reputation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}