{
  "nome_completo": "John Kemeny",
  "nome_curto": "John Kemeny",
  "ano_nascimento": "1926",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kemeny/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Etna, New Hampshire, USA",
  "biografia": "John Kemeny\n's mother was Lucy Fried and his father was Tibor Kemeny who  worked as an import-export wholesaler. John attended primary school in Budapest. He came from a Jewish family and, in\n1940\n, his father had the good sense to take his family to the United States. Understandably, not all the family wanted to leave their home but Kemeny's grandfather, who refused to leave, died in the Holocaust. An aunt and uncle of Kemeny's also failed to survive the Nazis.\nKemeny's family settled in New York and John attended the George Washington High School in New York City. Kemeny entered Princeton in\n1945\n,  after becoming an American citizen, where he studied mathematics and philosophy. However he took a year off during his undergraduate course to work on the Manhattan Project in Los Alamos. His boss in Los Alamos was\nRichard Feynman\nand he also worked there with\nvon Neumann\n.\nReturning to Princeton in\n1946\n, Kemeny worked as a research and teaching assistant and an instructor in mathematics even though he was still an undergraduate. He graduated with his B.A. in\n1947\n, then worked for his doctorate under\nAlonzo Church\n's supervision. Kemeny was awarded his doctorate in\n1949\nfor a dissertation entitled\nType-Theory vs. Set-Theory\n.  While a doctoral student he was appointed as\nAlbert Einstein\n's mathematical assistant. Kemeny later wrote:-\nPeople would ask - did you know enough physics to help\nEinstein\n? My standard line was:\nEinstein\ndid not need help in physics. But contrary to popular belief,\nEinstein\ndid need help in mathematics. By which I do not mean that he wasn't good at mathematics. He was very good at it, but he was not an up-to-date research level mathematician. His assistants were mathematicians for two reasons. First of all, in just ordinary calculations, anybody makes mistakes. There were many long calculations, deriving one formula from another to solve a\ndifferential equation\n. They go on forever. Any number of times we got the wrong answer. Sometimes one of us got the wrong answer, sometimes the other. The calculations were long enough that if you got the same answer at the end, you were confident. So he needed an assistant for that, and, frankly, I was more up-to-date in mathematics than he was.\nKemeny spent two years on a postdoctoral fellowship granted by the Office for Naval research. In\n1950\nhe married Jean Alexander; they had two children. He had continued to study both mathematics and philosophy and his first full-time teaching position, in\n1951\n, was a philosophy appointment at Princeton. But Snell writes in\n[\n2\n]\n:-\nHe was on his way to a traditional distinguished scholarly career as a promising young assistant professor at Princeton with a joint appointment in mathematics and philosophy when he decided instead to accept the challenge of developing a new mathematics department at a college which he had barely heard of and which was certainly not known as a centre of excellence in mathematics.\nSo Kemeny was appointed to the Mathematics Department at Dartmouth in\n1953\nand, two years later, he became chairman of the Department. He held this post until\n1967\n. He was president of Dartmouth between\n1970\nand\n1981\nand, in\n1982\n, he returned to full-time teaching. In fact he never gave up teaching while he was president, he had made it a condition of taking the post.\nKemeny will be remembered by most people as the co-inventor of the BASIC\n(\nBeginners All-purpose Symbolic Instruction Code\n)\ncomputer language. It was in\n1963\nthat Kemeny with Thomas Kurtz decided that they wanted to give students easy access to computing. Snell in\n[\n2\n]\nwrites:-\nJust as\nvon Neumann\nrealised that a computer that did only ordinary arithmetic operations could have extraordinary power, Kemeny realised that to make this power available to everyone, a programming language could and should be exceedingly simple. This led him to develop with Tom Kurtz the computer language BASIC ...\nKemeny and Kurtz designed the first \"time sharing\" system so that many students could a single computer at the same time. BASIC was designed to allow students to write programs easily. The first BASIC program was run at Dartmouth at\n2\nam on\n4\nMay\n1964\n. In the following year the General Electric Company established the first commercial time sharing system based on what Kemeny and Kurtz had set up at Dartmouth. In\n1967\nthe two co-inventors of BASIC published their book on the language\nBASIC programming\n.\nA teaching innovation which Kemeny introduced was in developing a\nFinite Mathematics\ncourse including topics that are no surprise to us today: logic,\nprobability\nand\nmatrix\nalgebra. It was designed because he was unhappy that mathematics\n(\nentirely calculus in first year courses at that time\n)\nwas\n[\n2\n]\n:-\n...the only subject you can study for\n14\nyears and not learn a single thing that has been done since\n1800\n.\nAlong with co-authors Laurie Snell and Oskar L Thompson from Dartmouth, Kemeny wrote a number of famous texts on finite mathematics. They wrote\nIntroduction to finite mathematics\n(1957)\nwhich appeared in later versions aimed at social science students in\n1960\nand business students in\n1962\n. They also wrote\nFinite mathematical structures\n(1959)\nwhich gave a more theoretical approach to the topic but included applications to electricity and engineering. Kemeny also wrote\nA philosopher looks at science\n(1959)\nand with Snell and Anthony Knapp from Cornell he wrote\nDenumerable Markov chains\n(1966)\n.\nKemeny was well known outside mathematical circles however for, in\n1979\n, President Jimmy Carter asked him to chair the commission investigating the Three Mile Island nuclear accident\n[\n1\n]\n:-\nThe Kemeny Commission, as it came to be called, was very critical of the nuclear power industry and its federal regulators.\nKemeny's character was painted by his wife:-\nHe liked science fiction, football games, shrimp, all kinds of puzzles, Agatha Christie, and solitude\n(\nfor two\n)\n. He did not enjoy socialising. Before he retired, John recognised only two flowers, the tulip and the rose, and two pieces of music, the\n1812\nOverture and Poor Little Buttercup. These last years he had time to enjoy Mozart, wildflowers, pileated woodpeckers, eclipses. Sometimes he liked just to sit still and think.\nMany awards and honours were bestowed on Kemeny such as election to the\nAmerican Academy of Arts and Sciences\n(1967)\n. He was given the New York Academy of Sciences Award in\n1984\n, the Institute of Electrical Engineers Computer Medal in\n1986\nand the Louis Robinson Award on\n1990\n. He received twenty honorary degrees.",
  "math_areas": [
    "Calculus",
    "Number Theory",
    "Statistics"
  ]
}