{
  "nome_completo": "John Robertson Pullar",
  "nome_curto": "John Pullar",
  "ano_nascimento": "1860",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pullar/",
  "lugar_nascimento": "Caputh, Perthshire, Scotland",
  "lugar_morte": "Morningside, Edinburgh, Scotland",
  "biografia": "John Pullar\nwas born in Caputh, a small village about\n15\nkm north of Perth. His father, James Pullar, was a farmer who worked in Caputh. His mother was Margaret Jane Robertson. John had one brother Charles, born in February\n1854\n, and one sister Margaret Ann, born on\n3\nJanuary\n1858\n. John Pullar's secondary education was at Madras College, St Andrews.\nFounded by Dr Andrew Bell in\n1832\n, Madras College provided an outstanding education and many families moved to St Andrews so that their children could benefit from this education. The school had grown rapidly after its foundation and when Pullar attended the number of pupils there was many times the number of students at the University in St Andrews.\nAfter completing his secondary education at Madras College, Pullar first matriculated at the University of St Andrews in October\n1878\n, becoming a Pyper bursar. In his first year of study he took classes in Greek\n1\n, Latin\n1\n, and Mathematics\n1\n. In\n1879\n-\n80\n, his second year of study, Pullar took the courses Logic, Greek\n2\n, and Latin\n2\n. In the following year he took Moral Philosophy, Mathematics\n2\n, and English Literature, then in his final year\n1882\n-\n83\nhe studied Mathematics\n3\nand Education. He graduated with an M.A. on\n22\nApril\n1883\n.\nAfter graduating, Pullar was an Assistant Mathematics teacher at Madras College before moving to the west of Scotland where he was appointed to Hamilton Academy, again as a mathematics teacher. He moved in\n1889\n, this time returning to the east of Scotland to take up a post as teacher of Mathematics and Science at Montrose Academy.\nPullar joined the\nEdinburgh Mathematical Society\nin June\n1898\nwhen he was at the Academy in Montrose. He remained in the Society for about five years.\nPullar married Mary Scrimgeour who came from Surrey in England. They had a son David Scrimgeour Pullar who was born on\n13\nNovember\n1888\nwhen Pullar was teaching in the west of Scotland. Mary Pullar died in Edinburgh in\n1940\n, and David Pullar, who was a mining engineer, also died in Edinburgh on\n10\nNovember\n1967\n. David Pullar was unmarried and left his home at\n1\nRavelston Terrace, Edinburgh, to the Rev. Henry James Young, Minister of the Dean Parish Church.",
  "math_areas": []
}