{
  "nome_completo": "John Hadley",
  "nome_curto": "John Hadley",
  "ano_nascimento": "1682",
  "ano_morte": "1744",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hadley/",
  "lugar_nascimento": "Bloomsbury, London, England",
  "lugar_morte": "East Barnet, Hertfordshire, England",
  "biografia": "John Hadley\n's mother was Katherine Fitzjames and his father was George Hadley. Both parents were from leading families, with his father having an estate at Enfield Chase near East Barnet, Hertfordshire which is now in London. George Hadley became high sheriff of Hertfordshire when John was nine years old. John was the second of his parents' six children having an older sister and two younger brothers George and Henry. John was five years older than Henry and three years older than George. No records survive to show how and where he was educated but certainly he must have acquired a high level of expertise in mechanics, and optics as well as mathematics.\nHadley was elected a fellow of the\nRoyal Society\non\n21\nMarch\n1717\nand he attained high office in the Society when he was elected Vice President on\n12\nFebruary\n1728\n. Although he had no need to earn a living, he did devote considerable time to looking after the family estates and also served the local community as governor of Barnet grammar school from\n1720\n. His father died in\n1729\nand, as the eldest son, Hadley inherited the estate near East Barnet as well as other land owned by the family. This certainly put in in an exceptionally good financial position and enabled him to pursue his scientific interests. On\n6\nJune\n1734\nhe married Elizabeth Hodges who herself was wealthy. They had one child, a son John born in\n1738\n.\nWe have indicated above that Hadley had a financial position which enabled him to devote both time and money to science. We must now look at his achievements in this area. He built, in collaboration with his brothers George and Henry, the first effective Newtonian reflecting telescope during the years\n1719\nto\n1720\n. It had a\n6\ninch mirror and proved a very useful instrument. It was tested by\nHadley\nand also by\nHalley\n, the astronomer royal, in\n1721\nand\nHalley\nreported to the\nRoyal Society\n(\nsee for example\n[\n2\n]\n)\nthat the telescope:-\n... shows the limbs of the planets with a greater degree of distinctness than other sort of telescopes do, in which particular ... it excels even the great telescope at Wanstead.\nBradley\nalso tested the telescope, comparing it with the refractor at Wanstead, and found it an excellent instrument which produced as good results as much larger refracting telescopes which, because of their size, were much more unwieldy to use. He built a Gregorian reflector in\n1726\n. It was due to him that reflecting telescopes of sufficient accuracy and power to be useful in astronomy were developed.\nAt this time one of the major problems which many scientists attacked was that of determining longitude at sea. The shipwreck of the fleet under the command of Sir Cloudesley Shovell on the Scilly Islands in\n1707\nled to Parliament putting up a large amount of money for any method to find longitude at sea to within one degree. This motivated Hadley to tackle the problem and in\n1730\nhe invented the reflecting octant which measured the altitude of the sun or of a star. The construction of the octant was, as his telescope had been, undertaken jointly by Hadley together with his brothers George and Henry. In\n1731\nHadley showed his new quadrant to the\nRoyal Society\nand published a description in his paper\nDescription of a new instrument for taking angles\nwhich appeared in the\nPhilosophical Transactions of the Royal Society\n. Hadley wrote in the paper:-\nThe instrument is designed to be of use where the motion of the objects, or any circumstance occasioning an unsteadiness in the common Instruments renders the observations difficult or uncertain.\nIn\n1734\nhe showed a new version of the instrument, with an added bubble-level, to the\nRoyal Society\n. It was used to determine position at sea.\nEdmund Stone\nwrote:-\nMr Hadley tells us, that upon trial of one of these instruments, three observations made at sea of the distance between two stars with a brass octant of this kind differed from Mr\nFlamsteed\n's at land, only about a minute.\nHadley published\nA description of a new instrument for taking the latitude or other altitude at sea\n(1734)\n. His design evolved into that of a sextant. A magnifying glass was added to read the scale, a telescopic sight was added with cross-wires to divide the field of view. The arc was extended from an octant to a sextant and a stout handle was added at the back of the instrument.",
  "math_areas": [
    "Algebra"
  ]
}