{
  "nome_completo": "John Hopkinson",
  "nome_curto": "John Hopkinson",
  "ano_nascimento": "1849",
  "ano_morte": "1898",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hopkinson/",
  "lugar_nascimento": "Manchester, England",
  "lugar_morte": "Evalona, Val d'Herens, Switzerland",
  "biografia": "John Hopkinson\n's mother was Alice Dewhurst from Skipton and his father, named John Hopkinson, was a mechanical engineer. John junior, the subject of this biography, was the eldest of a family of five children. He was fortunate in that being brought up in Manchester he had good schooling at Queenwood School and in\n1865\nentered Owens College in that city. Owens College, which went on to become the University of Manchester, was an excellent institution in which to study.\nAfter showing great abilities in mathematics, Hopkinson was awarded a scholarship to allow him to continue his study of that subject at Trinity College, Cambridge. He entered Cambridge in\n1867\n, where he was coached by\nRouth\n, and graduated with a mathematics degree in\n1871\n, being Senior\nWrangler\nin the Mathematical Tripos of that year\n(\nmeaning he was ranked as the top First Class student\n)\n. He was also first Smith's prizeman and made a fellow of Trinity College, so he looked set for a stunning university career in mathematics. Although he had been awarded a Whitworth scholarship which would have allowed him to continue his mathematical studies at Cambridge, Hopkinson decided to put his mathematics to practical use in engineering. First he took a science degree at the University of London which he was awarded in\n1871\n. Immediately on completing this second degree he began working in his father's engineering firm in Manchester.\nThere had been no chair of engineering at Owens College when Hopkinson studied there, but it is interesting to note that\nOsborne Reynolds\nwas appointed to such a chair while Hopkinson was studying at Cambridge. In\n1872\nHopkinson was appointed as the engineering manager of Chance Brothers and Company, a glass manufacturing company in Birmingham. There he studied the problems of efficient ways of shining lights from a lighthouse and, in particular, he recommended the use of flashing groups of lights. He made good use of his mathematical abilities\n[\n2\n]\n:-\nHis great mathematical abilities proved to be of the utmost value to him in his optical work, and later on in his electrical work. In one of his papers he proved mathematically that alternating current dynamos could be connected to work in parallel.\nDibner writes in\n[\n1\n]\n:-\nHopkinson's application of\nMaxwell\n's electromagnetic theories to the analysis of residual charge and displacement in electrostatic capacity led to his election as a fellow of the\nRoyal Society\nin\n1877\n.\nIn\n1878\nHopkinson founded his own electrical engineering company. Collaborating with Edward Hopkinson, one of his brothers, he applied the theory of electricity and magnetism to the development of electric motors. He used his mathematical expertise to give a general theory of alternating currents and he applied this theory to the operation of alternating current generators in parallel.\nHopkinson was appointed professor of electrical engineering at King's College, London, in\n1890\n. At the same time he became director of the newly founded Siemens Laboratory. In the same year he was awarded a\nRoyal Society\nmedal for his work on the magnetic properties of iron. He became famed for his expertise in electricity and as a result was employed as a consultant on many projects. In particular Manchester corporation employed him to advise on providing electric light for the city in\n1891\n. He devised a system to charge customers for the amount of electricity that they used with\n[\n6\n]\n:-\n... a charge, which is calculated partly by the quantity of energy contained in the supply and partly by a yearly or other rental, depending upon the maximum strength of the current to be supplied.\nFrom\n1896\nhe was employed to advise on electric traction for the corporations of Liverpool, of Leeds, and of St Helens. Railway companies used him as a consultant such as the City and South London Railway and the Kirkstall and Roundhay Tramway in Leeds.\nWhen at the height of his powers Hopkinson was killed in a mountaineering accident while on holiday in Switzerland. His son and two daughters died in the same accident on Mount Petite Dent de Veisivi. Although Hopkinson's life was cut short by the accident, he had already received several honours for his contributions of applying mathematics to engineering. In addition to his election to the\nRoyal Society\nwhich we mentioned above, he was President of the Institution of Electrical Engineers on two occasions. A member of the Institution of Civil Engineers from\n1877\n, he gave the James Forrest lecture to the Institution in\n1894\non the relation of mathematics to engineering, and served on the Council in\n1895\n.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}