{
  "nome_completo": "John Ceres Amson",
  "nome_curto": "John Amson",
  "ano_nascimento": "1927",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Amson/",
  "lugar_nascimento": "Liverpool, England",
  "lugar_morte": "Anstruther, Fife, Scotland",
  "biografia": "John Amson\nwas the son of Harry Amson\n(1887\n-\n1962)\nand Eleanor Maude\n(1897\n-\n1981)\n. Harry Amson was born in Liverpool on\n23\nSeptember\n1887\n. The\n1911\ncensus gives his occupation as a cashier working for a grain merchant. The\n1921\ncensus, taking place in June of that year, records him as a grain inspector working for H & R Ainscough Flour Millers & Grain Merchants. Later in\n1921\nhe married Eleanor Maude who had been born in Liverpool on the\n10\nJanuary\n1897\n. She was the daughter of Benjamin Maude who was an Examining Officer with H. M. Customs. Harry and Eleanor Amson had a daughter Frances Mary Amson\n(1925\n-\n2010)\nwho was born on\n21\nMarch\n1925\n. John Ceres Amson, the subject of this biography, was born two years later. His younger brother, Harry Amson, born on\n5\nFebruary\n1930\n, became an artist and a passionate environmentalist. Harry Jr died in November\n2016\n.\nAfter primary education in Liverpool, John Amson began his studies in September\n1938\nat Liverpool Institute High School for Boys at Mount Street, Liverpool. This grammar school had been founded in\n1825\nand had been managed by Liverpool City Council from\n1905\n. It was an excellent school with a good record of its pupils going to top universities but Amson left the school when he was fifteen. It is not entirely clear why such a talented young boy would leave school so early, but it was in the middle of World War II and the authors of this article, having known John Amson well, think that he could well have thought that he would give better support to his family by undertaking a more practical training. He entered the Liverpool School of Art and Design in\n1942\n, acquired skills in architectural drawing, and by\n1948\nhad trained as a Chartered Land Surveyor.\nIn September\n1949\nJohn Amson, his brother Harry and a friend Dave, were rescued in choppy seas in Liverpool Bay when their boat\nGypsy Meg\n[\n16\n]\n:-\n... sprang a leak and was out of control after the foremast had snapped and the sheet torn away by a squall. An auxiliary engine fitted to the boat was not in working order.\nThey were rescued by the pleasure cruiser,\nSt Tudno\n, of the Liverpool and North Wales Steamship Company which had over\n1000\nholidaymakers on board\n[\n10\n]\n:-\nThe men who were rescued carried suitcases, haversacks, cameras and rolled up blankets. When they arrived at the Liverpool landing stage they left hurriedly to avoid photographers.\nSee some pictures of this at\nTHIS LINK\n.\nIn\n1949\nAmson was appointed as a Senior Town Planning Assistant for the North Riding of Yorkshire County Council. In the following year he married Margaret Theresa Newson. She had been born on\n9\nMarch\n1927\nin Guisborough, Yorkshire, the daughter of a banker Reginald Robert Henry Newson and his wife Gladys Askew Steavenson. John and Margaret Amson had a son Christopher C Amson, born in\n1952\n. Although working as a Town Planning Officer, John Amson began teaching himself mathematics, a subject he increasingly found both fascinating and useful, and in\n1954\nhe joined the\nLondon Mathematical Society\n.\nMargaret Amson became ill with heart disease and John was determined to raise money for her treatment\n[\n12\n]\n:-\nDesperate to save her, John tried to raise money for treatment by entering a design for an international architecture competition. With herculean effort, while caring for his wife and young son, he also completed A-level correspondence courses in pure and applied mathematics. In light of his results Reading University offered him a scholarship to study mathematics while a kindly professor, impressed by John's intellect, lent the family a caravan to live in on campus.\nThe quality of an essay he wrote on mathematics and aesthetics was one of the factors leading to the award of the National Mature Student Scholarship to study at Reading University. He began his studies in\n1955\n, living in a Modular Caravan on Shinfield Road, Whiteknights Park, Reading. Sadly, despite all Amson's efforts to save his wife, she died in\n1957\nand was buried on\n4\nJune of that year. Amson was awarded a B.Sc. with honours and two prizes in Special Mathematics in\n1958\n. After graduating he was appointed as Senior Research Officer and Team Leader\n(\ntheoretical and experimental\n)\nin the Physics of Electric Welding Arc at the British Welding Research Association which was situated in Abington Hall, near Cambridge.\nAmson rapidly become internationally known for his brilliant contributions to welding. NASA had begun their Apollo program in\n1960\nwith the aim of building a three person spacecraft. Amson became a consultant in\n1961\n, contributing to studies of welding arc in low pressure and space environments. He was a Keynote Lecturer at the International Institute of Welding Annual University Research Conference of the Welding Research Council in New York in\n1961\n. He flew from London to New York on\n9\nApril\n1961\nand, on entering the USA, gave the New York address Sheraton-Atlantic Hotel, Broadway, New York. He was a co-organizer of\n2\nnd British Commonwealth Welding Physics Conference held in London in\n1962\n. In the same year his paper\nAn analysis of the gas-shielded consumable metal arc welding system\nwas published in the\nBritish Welding Journal.\nThe Abstract begins\n[\n1\n]\n:-\nEquations characterising drop detachment in the gas-shielded consumable-metal-arc welding system are derived, using basic physical principles together with certain physical assumptions and approximations deduced from observations. ....\nFor more information about that paper, and other papers by Amson, see\nTHIS LINK\n.\nIn\n1962\nhe was the British Delegate on the International Institute of Welding's Physics of Welding Arc Committee. He continued to advise this committee as an Expert until\n1975\n. He was also invited to collaborate with Professor N N Rykalin, the Chairman of USSR Welding Committee, Moscow in\n1962\n.\nAlthough by\n1962\nAmson was an internationally known leading expert in welding, he felt that he wanted to learn more mathematics. Feeling that functional analysis was important for future applications of mathematics, he applied to Cambridge University to undertake research for a Ph.D. He was awarded a Churchill College Research Studentship in\n1962\nand undertook research advised by\nFrank Smithies\nfrom\n1952\nto\n1965\n. He submitted his thesis\nPolynomial operators in Banach space\nin\n1968\nand was awarded his Ph.D. in the following year. He submitted the paper\n[\n5\n]\nto the Journal of the London Mathematical Society in December\n1969\n. He notes\n[\n5\n]\n:-\nThe contents of this paper were included in my thesis. I am indebted to Dr\nF Smithies\nfor suggesting these ideas, and for his guidance and encouragement during their development.\nIn fact Amson had been appointed by the Regius Professor of Mathematics,\nEdward Copson\n, to a Senior Lectureship in Mathematics at the University of St Andrews in\n1965\n, three years before submitting his Ph.D. thesis to the University of Cambridge. The vacancy had been caused by\nDavid Borwein\naccepting a professorship at the University of Western Ontario in\n1964\n. Remarkably, Amson published eight papers in\n1972\n, some on functional analysis, some on planning of cities, and one on the physics of welding. He gives this summary of his research interests between\n1965\nand\n1982\nin\n[\n13\n]\n:-\nSenior Lectureship in Mathematics, St Andrews University, specialising in Real, Complex and Functional Analysis, Banach Algebras\n(1965\n-\n1982)\n. Primary research interest: Spectral Theory of Homogeneous Polynomial Operators in Hilbert Space. Awarded Social Sciences Research Council Grants: Advanced Mathematics in Urban Studies\n(1970\n-\n1971\n,\n1977\n-\n1978)\n. Introduced discontinuous and catastrophic Evolutionary Dynamics into Urban-&- Regional Systems Studies\n(1971\n-\n1978)\n.\nHis work on urban studies resulted in two papers,\nEquilibrium Models of Cities:\n1\n. An Axiomatic Theory\n(1972)\nand\nEquilibrium Models of Cities:\n2\n. Single-Species Cities\n(1973)\n. The Abstract of the first begins\n[\n3\n]\n:-\nA study is undertaken of the concept of a city as an 'urban gravitational plasma' consisting of one or more species of civic matter\n(\npopulations, activity rates, and so on\n)\ninteracting on themselves and each other, and, at the same time, responding to relocation coercions induced by satisfaction potentials of various kinds\n(\nhousing rentals, amenity levels, and so on\n)\n. The latter are assumed to be coupled to the territorial densities of the individual species of civic matter through equations of state, for which the housing rental-population density relation in market equilibrium theory is a prototype.\nThe Abstract to the second paper begins:-\nThis second part of a study of a city as an 'urban gravitational plasma' investigates in detail the case where the city consists of only one species of civic matter, and is circularly symmetric. To increase the relevance of the theory to actual urban situations, this civic matter is assumed throughout to be a citizen population, though the theory would apply just as well if other illustrations, such as floor space or traffic flows, etc., were to be chosen instead. The population is assumed to attract itself in a way which tends to increase its density in high density regions and to decrease it in low density regions. This 'clumping' effect is offset by another inducement on the population to relocate itself in places where some 'dissatisfaction potential' is less. Again, for illustration, it is assumed throughout that the dissatisfaction has the form of a housing rental, that is, the price of the composite bundle of 'housing' commodities and utilities.\nFor a fuller version of the Abstracts of these two papers, see\nTHIS LINK\n.\nLet me note that I\n[\nEFR\n]\nwas appointed to the staff in mathematics at the University of St Andrews in\n1968\nand became Amson's colleague. It was immediately clear to me that John was bubbling over with innovative ideas many of which were unconventional. While undertaking research at Cambridge, Amson had become interested in the Cambridge Language Research Unit. This had been founded in\n1955\nand there Amson met Fredrick Parker-Rhodes, Ted Bastin and others who were all influenced by\nArthur Eddington\n's ideas regarding various dimensionless and cosmological constants.\nEddington\nhad a fascination with the fundamental constants of nature and produced some surprising numerical coincidences most of which were published after his death in\nFundamental Theory\n(1946)\n, a book prepared for publication by\nEdmund Whittaker\n. Amson and Parker-Rhodes began working on the Combinatorial Hierarchy, a four level bit string hierarchy they had discovered. This hierarchy had four levels, leading to the sequence\n3\n,\n10\n,\n137\n,\n1.7\n×\n1\n0\n38\n3, 10, 137, 1.7 \\times  10^{38}\n3\n,\n1\n0\n,\n1\n3\n7\n,\n1\n.\n7\n×\n1\n0\n3\n8\n, the last two terms being closely associated with the Structure Constants of physics. They wrote two papers,\nHierarchies of Descriptive Levels in Physical Theory\n(1964)\nand\nEssentially Finite Chains\n(1965)\n. Both papers remained unpublished until\n1998\n.\nFor more information about these\n1998\npapers, see\nTHIS LINK\n.\nAmson began working with\nClive Kilmister\non the Combinatorial Hierarchy beginning in\n1965\n. He also worked with Pierre Noyes on approaches to discrete physics via the Combinatorial Hierarchy beginning in\n1973\n. Ted Bastin, Pierre Noyes, John Amson and Clive Kilmister published the paper\nOn the physical interpretation and the mathematical structure of the combinatorial hierarchy\nin\n1973\n.\nFor a review of this paper by Slawomir Bugajski, see\nTHIS LINK\n.\nThe five collaborators we have just mentioned, Amson, Bastin,\nKilmister\n, Noyes and Parker-Rhodes, formed the Alternative Natural Philosophy Association in\n1979\n. It produced an official Statement of Purpose\n[\n13\n]\n:-\nThe primary purpose of the Association is to consider coherent models based on a minimal number of assumptions, so as to bring together major areas of thought and experience within a Natural Philosophy alternative to the prevailing scientific attitude. The Combinatorial Hierarchy, as such a model, will form an initial focus of our discussions.\nThe Association will seek ways to use its knowledge and facilities for the benefit of humanity and will try to prevent such knowledge and facilities being used to the detriment of humanity.\nThe Preface to the Proceedings of the\n7\nth Alternative Natural Philosophy Association Conference gave more information about the motivation of the five founders\n[\n13\n]\n:-\nCurrently accepted ideas and results based on them in elementary particle physics and cosmology are exciting for some, frustrating for others, and incomprehensible to many who sense the excitement but don't know quite how to join in the game. The group represented by these proceedings share some mix of all three attitudes in varying proportions. Some of us think we are on the track of new physics, or even new philosophy, while others are sceptical. We are not trying to conceal these internal problems from the reader. Rather, we ask him to share our perplexity - along with our excitement.\nI\n[\nEFR\n]\nmentioned above Amson's innovative ideas. Of course, not all these ideas proved the success that he hoped. When given the First Year analysis course to teach, he wondered how to convince the young students, who were just beginning their university mathematical studies, that rigour in mathematical reasoning was essential. He decided that he would spend the first two lectures \"proving\" obviously incorrect \"facts\" such as\n1\n=\n2\nusing convincing looking mathematical arguments. It looked like a great idea, but sadly it was not the success that Amson had hoped for since many of the students ended up thinking they would never be able to trust a mathematical argument again. He never tried that approach again.\nAfter he took up the Senior Lectureship in St Andrews, Amson lived in the centre of the old town at\n26\nBell Street. By\n1968\nhe was living at\n15\nHoward Place and, in the following year, he married Christine Crow in Dundee. Christine was born in Ashford, Kent in\n1940\n, read Modern Languages at Girton College, Cambridge, and studied in Paris as part of a Ph.D. on the work of Paul Valéry. She was appointed to lecture on French Literature at the University of St Andrews in\n1965\n, taking up the appointment at the same time that John Amson took up his appointment in Mathematics.\nMargaret Thatcher became Prime Minister in\n1979\nand her government set about making major reforms to higher education, one part of which involved universities making cuts in staff numbers from\n1981\n.\nJohn Howie\n, the head of the Pure Mathematics Department at St Andrews, seemed to believe that the best way he could help the university was to reduce the number of staff in his department. A last-in-first-out policy followed by\nHowie\nled to Roy Dyckhoff, who had been appointed as a Lecturer in the Department of Pure Mathematics in\n1975\n, moving to Computer Science in\n1981\n. Amson was not in any danger of being forced out by this policy but we are certain that, for the sake of his colleagues, he chose to take a very early retirement in\n1982\n. Chris Ferguson writes\n[\n8\n]\n:-\nRetirement was in name only, however. There followed many an enabling innovation such as place adjustable sundials, differential gears for tidal clocks, geological research for tidal range lagoons in Scotland and multiple exploratory mathematics and physics papers as president of the Alternative Natural Philosophy Association ...\nIn\n[\n13\n]\nwe get some further details given by John himself:-\nSole proprietor, Navigational Software Firm\n(1982\n-\n1999)\n, created the first commercial Tidal Prediction Software Package, Europe,\n1989\n. Royal Yachting Association Scotland Volunteer of the Year Award,\n2004\n. Fellow of the Royal Astronomical Society\n(1988\n-\n)\n.\nThe author of the article\n[\n12\n]\nin\nThe Times\nwrites:-\nHe set up two small businesses: one selling mathematical software for the early personal computers; and the other selling software for navigational position fixing. The latter included early technology for tide prediction and provided information about the daily tides in\n31\nlocations around the UK. For several years it took up a small space on the back page of this newspaper.\nHis passion for early computing equipment is also mentioned in\n[\n7\n]\n:-\nHe was a collector of, and fount of knowledge on, the history of computing hardware; just before he died he donated a collection of early computing equipment to the University Museums.\nJohn and Christine went to live in Anstruther, on the south coast of Fife. Their house there was\n[\n12\n]\n:-\n... overflowing with books, with windowsills stuffed with John's octants, sextants, binoculars, telescopes, cameras and devices with winding handles that implemented astrolabes.\nThe move to Anstruther meant that Amson could sail on boats and be involved in his passionate love of the sea. He was a member of the Anstruther Sailing Club and organised the Anstruther Harbour Muster, an annual gathering of boats from various places in the east coast, which started in\n1997\n.\nIn\n2008\nhe published a charming paper on\nGregory\n's meridian line.\nYou can read this paper at\nTHIS LINK\n.\nHis mind remained remarkably active in his last years but his mobility deteriorated and eventually even trips to the local cafe to meet with a friend became beyond him. He wrote in one of his many log books:-\nJohnny Amson had,\nso much to do,\nit wasn't true.\nHe hadn't even time to die.\nThis self-penned epitaph typified his sense of humour\n[\n7\n]\n:-\nHis mind continued to bubble over with ideas, although he was increasingly frail. His wife, Christine Crow, nursed him at home till the end.\nFor someone who had been, for his whole life, passionate about the sea it was fitting that, following his wishes, he was buried at sea.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}