{
  "nome_completo": "John Henry Michell",
  "nome_curto": "John Henry Michell",
  "ano_nascimento": "1863",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Michell/",
  "lugar_nascimento": "Maldon, Victoria, Australia",
  "lugar_morte": "Camberwell, Victoria, Australia",
  "biografia": "John Henry Michell\n's parents were John Michell and Grace Rowse. John Michell was born on\n11\nDecember\n1825\nin Marytavy, Devon, England and Grace Rowse was born on\n26\nOctober\n1828\nin Kenwyn, Cornwall, England. John Michell was a miner, the son of the miner Thomas Michell and his wife Elizabeth Saunders. Grace Rowse was a daughter of Anthony Rowse and Ann Wilcocks. Again this was a mining family and, around\n1828\n, Anthony Rowse had moved to Marytavy, Devon, to become the manager of a copper mine. John and Grace Michell were married on\n21\nApril\n1853\nin Tavistock, Devon and, in the following year, they emigrated to Port Phillip, Australia. There were good reasons for this since mining deposits in Devon and Cornwall were becoming exhausted. In\n1851\nrich gold deposits had been found in Victoria, Australia, so many left England looking for a better life. In fact Grace was one of a large family and at about this time all her brothers, trained as miners by their father, were taking up mining in various parts of the world. John and Grace Michell had five children: Elizabeth Ann Michell was born in April\n1855\nin Creswick Creek, Victoria, Australia;  Grace Michell was born in July\n1857\nin Ballarat, Victoria, Australia; Amelia Michell was born in February\n1861\nin Maldon, Victoria, Australia; and John Henry Michell, the subject of this biography, was born in October\n1863\n, also in Maldon, Victoria, Australia, a small rural mining field. As a young child John was taught reading, writing and arithmetic at home by his older sisters. In\n1870\nthe family returned to England to spend time with their parents and relatives and their fifth child, Anthony George Maldon Michell, was born in Islington, London, England in June\n1870\n. George Michell, as he was known, went on to become a well-known engineer who wrote the obituary\n[\n7\n]\nof his older brother. George Michell:-\n... invented the Michell Thrust Bearing, a tilting-pad device which made possible much of the modern development of steam and water turbines and of propeller drives for large fast ships.\nThe family were still in England at the time of the April\n1871\ncensus, and were living at\n3\nMillbrook Villas, Tavistock, Devon.\nReturning to Australia in\n1873\n, the family lived at Maldon until\n1877\n. There, in December\n1874\n, Michell's father showed him the transit of Venus by means of smoked glass. It was in Maldon that John Michell attended elementary schools and, since he showed great promise, his parents moved from Maldon to the suburbs of Melbourne in\n1877\nso that he could attend Wesley College there. This school had opened in\n1866\nand, two years before Michell entered, the school colours had been changed to light blue and white to match both Cambridge University and the University of Melbourne. Henry Martyn Andrew\n(1845\n-\n1888)\nhad become the third headmaster of the school in\n1876\nand, a few years earlier in\n1872\n, he had been a\nWrangler\nin the mathematics tripos at Cambridge. Andrew, described as \"a severe but inspiring teacher\" certainly seems to have inspired Michell who came top in all the mathematics classes and was awarded the Draper and Walter Powell scholarships at Wesley College. Michell graduated from Wesley College in\n1881\nand, in that year, entered the University of Melbourne.\nAt the University of Melbourne Michell had to take a broad course of study including geology, political economy and classics in addition to mathematics. However, at this time there was only one mathematician on the faculty at the University of Melbourne, namely Edward John Nanson\n(1850\n-\n1936)\n, who had been Second Wrangler in the mathematical tripos at Cambridge in\n1873\n. Nanson was an expert on the mathematics of\nCayley\n,\nSalmon\nand\nSylvester\nand wrote many papers on\ndeterminants\n[\n7\n]\n:-\n... in the handling of which he had extraordinary facility.\nMichell graduated with a B.A. in\n1884\nand he was strongly encouraged by both Nanson and Andrew, who was by this time professor of natural philosophy at the University of Melbourne, to continue with his mathematical studies at the University of Cambridge. This would, of course, put severe financial pressure on Michell's parents but they were quite prepared to make the necessary sacrifices. But Michell was not sent to England on his own for his whole family left Australia and set up home in Cambridge. Once there Michell's younger brother George continued his education in Perse Grammar School, Cambridge.\nOn\n10\nOctober\n1884\nMichell was admitted as a pensioner at Trinity College, Cambridge. As a pensioner, he would have had to support himself financially. His tutor at Cambridge was\nJames Whitbread Lee Glaisher\n. He became a scholar in\n1885\n, indicating that by this time he had won a scholarship. He sat Part I of the mathematical tripos in\n1887\nand was bracketed as Senior Wrangler along with three other students, one of whom was\nHenry Baker\n.\n(\nHaving four students come first equal is, perhaps, a unique event in the Cambridge tripos.\n)\n. His coach for the mathematical tripos was the famous\nEdward Routh\nand he attended lectures by\nAndrew Forsyth\n,\nJoseph Larmor\n, Joseph John Thomson\n(\nthe Cavendish Professor of Experimental Physics, and later the discoverer of the electron\n)\n, and\nGeorge Stokes\n. Michell was also First Class in Part II of the tripos in\n1888\nand, in the following year, he was a Smith's prizeman. The only other Smith's prizeman in that year was\nHenry Baker\n. His brother George Michell had graduated from Perse Grammar School after spending three years there, but remained with the family in Cambridge and attended lectures at Cambridge University as a matriculated non-collegiate student. George Michell, writes in\n[\n7\n]\nabout his brother Henry's time at Cambridge:-\nMichell put all his energy into his training for these contests, doubtless feeling that he owed it to his parents to qualify himself for obtaining some remunerative employment without delay, and that securing a high place in the lists was the only means available to him, compatible with his temperament, for securing that end. It is probable that the strain which he imposed on himself caused permanent injury to his health and spirits. at any rate, it is certain that, both at the time and later, he deplored the effort spent in acquiring the arts of 'problem-solving' in the manner of the Cambridge examinations of those days and that he put them aside as soon as the examinations were over in order to plunge into the reading of such authors as\nCauchy\n,\nClebsch\n,\nRiemann\n,\nWeierstrass\nand\nPoincaré\n. For\nRiemann\nespecially he had an admiration which was profound and lifelong.\nIn\n1890\n, still at Cambridge, Michell was elected to a Fellowship at Trinity College. In this year he published five papers:\nThe small deformation of curves and surfaces with applications to the vibrations of a helix and a circular ring\n;\nOn the exhaustion of Neumann's mode of solution for the motion of solids of revolution in liquids, and similar problems\n;\nVibrations of a string stretched on a surface\n;\nOn the stability of a bent and twisted wire\n; and\nOn the theory of free stream lines\n. This last mentioned paper was, perhaps the most remarkable\n[\n7\n]\n:-\n... by a new mathematical transformation, a complete solution was obtained, in forms readily available for detailed application to concrete cases, of the two-dimensional flow of non-viscous fluid. Earlier attacks on the problem, even by\nHelmholtz\nand\nKirchhoff\n, had yielded only the solutions of a few special cases not of the highest importance.\nFor a list of all Michell's publications, see\nTHIS LINK\n.\nFor a discussion of the problem studied in\nOn the stability of a bent and twisted wire\nsee\nTHIS LINK\n.\nSoon after accepting the Trinity fellowship, Michell was offered a lectureship at the University of Melbourne. He accepted and later in\n1890\nhe took up the post in Melbourne. T M Cherry writes in\n[\n3\n]\n:-\nOn returning to Melbourne the household, reduced shortly afterwards to the four unmarried children and their mother, built a solid house, where with mutual support and in orderly Victorian comfort they lived until, in the fullness of time, their sands ran out. Few families can have been more closely knit. Round the house the brothers established a most remarkable garden reminiscent of a tropical forest. The upper storey consisted mainly of palms of many species and the middle storey of exotic shrubs, mostly South African and Australian\n(\nat this time any non-European shrubs in Melbourne gardens would have been called 'exotic'\n)\n. The visitor never saw a leaf on the paths or otherwise out of place. It was said that this was the only foreign site on which the Lord Howe Island palm\n(\nmuch used for indoor civic greenery\n)\nhad ever set seed; but the brothers explained that there was no magic in this - it was simply that their specimens were the only ones outside the Island that had achieved the requisite age. In contrast to the palms there were fruit trees again exotic - cumquat, guava, feijoa, and a\n30\n-foot mulberry tree - this last completely enclosed in a cage to foil the blackbirds ...\nWe note that this quote suggests that Michell's father died soon after they returned to Australia and indeed he died at Camberwell, Melbourne, on\n16\nJuly\n1891\n. It also suggests that one of the children had married and that was the eldest daughter Elizabeth Ann who married John Dabb in\n1877\n. The other four children never married. Michell's mother died in\n1921\n.\nWhen Michell became a lecturer at Melbourne he became a colleague of Nanson, his former professor. In fact he became the only other member of Nanson's Department of Mathematics and so had to work extremely hard. Certainly he took his responsibilities as a teacher very seriously which meant that his workload was even greater than it might have been\n[\n7\n]\n:-\nMichell took his work as a teacher very seriously and gave to it almost the whole of his time and mental energy. His notes for his class lectures were recast repeated, in fact almost every year, with immediate regard to the character of the prospective classes as indicated by the intending students themselves in their entrance examinations and subsequently. He was always most solicitous that his students should get an accurate record of his lectures, and, to ensure this, his rule was to writ every word on the blackboard. The pace therefore appeared to be slow, but this was deceptive; he achieved economy of words by omitting unessentials, and his judgement in this matter was so sure that he covered more than the normal extent of ground rather than less. He also took a great deal of trouble in setting his examination papers. Nearly all the problems were original, and it was rare for him to set anything that could be recognised as a repetition.\nDuring the first years as a lecturer in Melbourne, Michell published eighteen papers in addition to the five he published in\n1890\n. The most important of these papers, according to Ernest Oliver Tuck\n(1939\n-\n2009)\n[\n11\n]\n, was\nThe wave resistance of a ship\n(1898)\n. Tuck writes:-\nThe paper is concise and to the point, occupying\n17\nsmall pages in total, the main formula being derived within the first\n8\npages. The paper reads like a modern research article, apart from the lack of partial derivative notation, which Michell wanted but did not get from the printers. The problem is simply to obtain that portion of the drag force on a steadily moving ship which is due to the loss of energy into its wave pattern. Hence viscosity is neglected, this being justified by arguments pioneered by Froude for separating wave and viscous drag, but in Michell's own introductory words by boundary-layer-like arguments that could be said to anticipate\nPrandtl\n's by a decade or more. Once viscosity is neglected, classical inviscid-fluid theory indicates that the flow is irrotational almost everywhere, and a velocity potential exists. The task of determining the velocity potential is then a boundary-value problem for\nLaplace's equation\n...\nHowever, there is remarkable final part to the paper that Tuck highlights:-\nHowever, a little-known feature of the ship paper is that, almost as an afterthought, Michell also includes on its last two pages a mini-study of the shallow water case, i.e. of the limit as the water depth vanishes ... This shallow-water analysis is itself of remarkable historical interest, since it uses what we would now identify as an analogy between sub- or super-critical hydraulics, and sub- or super-sonic aerodynamics. Since manned flight was still a decade away, and supersonic flight a half century away, this is truly remarkable work, that would make these two pages significant even if the infinite-depth portion were discounted. However, it must be said that quite similar and now better known aerodynamic work was being done by\nJoukowski\nat about that time\n(\nthough published later ...\n)\n. Michell gives no indication that he has seen any of\nJoukowski\n's work, and it hardly seems likely in view of his geographical isolation that he had done so. At the very least, Michell's application of the hydraulic analogy to the ship context is original, and personally I believe that\n(\nbased on nothing more than these two pages\n)\nhe should be given at least equal credit with\nJoukowski\nfor this whole research area.\nAs we mentioned above, Michell published\n18\npapers between\n1892\nand\n1902\n. In the year\n1902\nhe was elected a fellow of the\nRoyal Society of London\n. He published no further research after\n1902\nalthough in that year he was only\n39\nyears old. Although Michell was under great pressure as a teacher, Tuck\n[\n11\n]\nsuggests that the most significant reason for his giving up research was the lack of recognition he received. Michell's brother seems to, at least partially, support this when he writes\n[\n7\n]\n:-\nMichell never showed concern for recognition of his work, but the absence of any response to such a paper as the 'Ship Waves' inevitably discouraged the making, or at least the publication, of investigations involving, for him, so much anxious labour.\nThe idea that lack of recognition made him give up publishing research may, however, be an over simplification. What more recognition could one receive than to be elected a fellow of the\nRoyal Society of London\n? This happened in\n1902\n, exactly the date when he stopped publishing. Could the opposite be true - that he stopped publishing because he had received recognition as a world-leading researcher and so, in some sense, had proved himself as a researcher? There seems no possibility that we will ever know the answer, but it is certain that the world of mathematics would have benefited greatly from another\n30\nyears of Michell's research publications. Let us note that Michell's brother also became a fellow of the\nRoyal Society of London\n, being elected in\n1934\n. There cannot be many instances of two brothers both being fellows of the\nRoyal Society\n.\nIn\n1923\nNanson retired and Michell became Professor of Pure and Mixed Mathematics at Melbourne. Up to that time he had lectured mainly on applied mathematics topics\n(\nknown as mixed mathematics at this time\n)\nbut, from\n1923\nuntil his retirement in\n1928\n, he lectured on topics across the whole range of mathematics. He was able to appoint a number of mathematicians to his department in Melbourne including Maurice Belz with whom he collaborated in writing his only book, the two volume\nThe Elements of Mathematical Analysis\n(1937)\npublished nine years after his retirement. The authors write in the Preface:-\nIn writing the present book we have tried to make it conform to three main conditions. ...\n(\ni\n)\nThe book should assume as known only those elements of Algebra, Geometry and Trigonometry which are taught in the secondary schools to all those preparing to attend any lectures in Mathematics at a university. ...\n(\nii\n)\nThe second main condition is that the book should form a practical or working text provided with an abundance of illustrative examples treated at length and of other examples to be solved by the student. ...\n(\niii\n)\nThe third condition is that the subject should be expounded on the basis of the theory of real numbers, geometrical notions being employed only illustratively and not as replacing abstract discussions ....\nFrederic Miller, in the review\n[\n10\n]\n, writes:-\nThe authors have succeeded admirably in meeting their aims.\nP J Daniell\n, in the review\n[\n4\n]\n, writes:-\nWe have here a course in Calculus written by authors with a mathematical conscience and an ability to teach. Every attempt is made not only to be rigorous and clear but also to explain at some length what is being done. It is a great pleasure to find such a work on calculus.\nOther than mathematics, Michell's interests were music, reading and, as we noted above, gardening. Cherry writes\n[\n2\n]\n:-\nHe found relaxation in classical music - he was a capable performer on the organ - in wide reading and in gardening; he was a learned connoisseur and lover of plant life, especially Australian trees and shrubs.\nMichell retired in\n1929\n, becoming an Honorary Research Professor, and continued to live at Camberwell, Melbourne, Victoria, Australia where, after a short illness, he died in\n1940\n. He was buried in Boroondarra Cemetery, Victoria.\nToday, Michell is probably best remembered by the J H Michell Medal which is awarded annually\n(\nif there is a candidate of sufficient merit\n)\nby the Australian and New Zealand Industrial and Applied Mathematics which is a Division of the\nAustralian Mathematical Society\n. The award is made to someone who has made an outstanding contribution to applied and/or industrial mathematics, must have worked mainly in Australia and/or New Zealand, and be less than ten years from the award of their Ph.D.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}