{
  "nome_completo": "John Aitchison",
  "nome_curto": "John Aitchison",
  "ano_nascimento": "1926",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aitchison/",
  "lugar_nascimento": "East Linton, East Lothian, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "John Aitchison\n's parents were John Aitchison, a railway signalman, and Margaret Blackhall. The family lived in East Linton, a small town about\n35\nkm east of Edinburgh. John attended East Linton Primary School, a Victorian stone single storey building which was built in\n1880\n. For his secondary education he attended Preston Lodge High School, in Prestonpans, a town on the Firth of Forth about half way between Edinburgh and East Lothian. This school had been opened in\n1924\n, two years before Aitchison was born, and when he attended, the headmaster was Andrew H Millar. Aitchison excelled at Preston Lodge High School but never had any thoughts of attending university. However, when he was in his final year, the headmaster, Andrew Millar, said to him \"You'll be going to university, won't you?.\" Aitchison said later that being a shy boy he certainly was not going to argue with the headmaster, so he said \"Yes\", and applied to the University of Edinburgh.\nAitchison was only\n13\nwhen World War began in\n1939\n. This had little impact on his school career and, by the time he entered the University of Edinburgh in\n1943\n, the war was still in progress. The M.A. degree was a four year course and Aitchison was taught by a collection of leading mathematicians and physicists such as\nAlec Aitken\n,\nArthur Erdélyi\nand\nMax Born\n.\nEdmund Whittaker\nshould have retired in\n1943\n, the year Aitchison matriculated, but he had agreed to remain in post because of the war and so Aitchison was also taught by\nWhittaker\n. Aitchison was very successful, being awarded the Foundations of Analysis Medal in\n1946\nand a Bruce of Grangehill Scholarship in\n1947\n. He graduated with an M.A. with First Class honours in mathematics in\n1947\n. When he reached the age of\n18\nthe war was still raging and he became eligible to be called up for war service. However his call-up was deferred since one of the topics he was studying was radar techniques.\nAlthough the war ended in\n1945\n, young men were still required to undertake two years of national service when Aitchison graduated in\n1947\n. His mathematics degree allowed him to avoid military duties if he undertook civil work of national importance. One possibility which allowed a mathematics graduate to avoid the military was actuarial work and this was the route Aitchison decided to follow. He undertook actuarial training with the Standard Life Assurance Company and passed Part II of the Faculty of Actuaries Examination in\n1947\n. At the end of the two years, in\n1949\n, he was free to continue his education. Awarded a scholarship to Trinity College, Cambridge, he began to take courses leading to a B.A. Although it might seem strange that someone was an M.A. would then study for a B.A., it was not uncommon for someone with a Scottish degree to study for an undergraduate Cambridge degree. His interests turned towards statistics after he had attended an introductory course given by Frank Ascombe. He was fortunate that in\n1949\n, the year he entered Cambridge, a Statistical Laboratory was set up within the Mathematics Faculty although at first it was accommodated in a \"temporary hut.\" Continuing to study statistics at Cambridge, Aitchison was taught by, among others,\nJohn Wishart\n, David Cox\n(\nborn\n1924\nand joined the Cambridge Statistical Laboratory in\n1950)\n, Henry Daniels\n(1912\n-\n2000\n, appointed to Cambridge in\n1947\nand a founder member of the Cambridge Statistical Laboratory\n)\n, Frank Ascombe\n(1918\n-\n2001\n, also a founder member of the Cambridge Statistical Laboratory\n)\n, and Dennis Lindley\n(1923\n-\n2013\n, appointed as a demonstrator in the Cambridge in\n1948\nand joined the Statistical Laboratory when it was founded\n)\n. Aitchison graduated in\n1951\nand, in the following year, he married Muriel Shackleton; they had three children, two sons Simon and Michael, and a daughter Susan.\nIn\n1952\nAitchison was appointed as a statistician in the Department of Applied Economics at the University of Cambridge. This Department had been proposed by\nJohn Maynard Keynes\nin\n1939\nbut, due to the outbreak of World War II, it was not set up until\n1945\n. When Aitchison joined the Department in\n1952\nthe director was Richard Stone\n(1913\n-\n1991)\nwho was strongly encouraging the Department to undertake research programmes involving statistical methodology. Around this time Aitchison published papers such as\n(\nwith S J Prais\n)\nThe grouping of observations in regression analysis\n(1954)\nand\nOn the distribution of a positive random variable having a discrete probability mass at the origin\n(1955)\n. In\n1955\nWilliam Brian Reddaway\n(1913\n-\n2002)\n, a critic of mathematics in economics, became director. In the following year Aitchison left Cambridge when he was appointed as a Lecturer in Statistics in the Department of Mathematics of the University of Glasgow. He held this position in Glasgow until\n1962\nwhen he was appointed as a Senior Lecturer and also head of Mathematical Statistics at the University of Liverpool.\nIt was while he was at Glasgow that Aitchison published\nThe lognormal distribution, with special reference to its uses in economics\n(1957)\nwritten jointly with J A C Brown. Alan Brown\n(1922\n-\n1984)\nwas a statistician in the Department of Applied Economics at the University of Cambridge from\n1952\nto\n1965\nand it was there that he had begun the collaboration with Aitchison resulting in this important book. We quote from John Creedy concerning this work\n[\n1\n]\n:-\nThis book has perhaps reached the point of being a 'classic' in the econometrics literature. This was a pioneering volume in more than one sense. It was innovative in devoting a whole book to a single distribution, but it was very much broader in scope. Indeed it provided pioneering studies of the use of probit analysis, covering quantal and quantitative responses, in economics - in the context of Engel curves and new commodities. It was several decades before probit analysis became widespread - it is now of course ubiquitous in applied econometrics work - and 'The Lognormal Distribution' also derived some interesting analytical results regarding aggregation. This book was thus also a pioneering volume in nonlinear econometric methods, devoting considerable attention to iterative maximum likelihood methods based on\nFisher\n's famous 'method of scoring'. The convergence properties of iterative methods were examined in detail, including the problem of how to choose initial values. This kind of work would not have been possible without access to mainframe computing facilities, and the book therefore also reflects pioneering work in computer programming in econometrics - making use of the unique computing facilities in Cambridge during the\n1950\ns - necessarily using machine code rather than high level languages. ... 'The Lognormal Distribution' book was exemplary in showing respect for the historical development of the statistical methods involved and in paying attention to the stochastic processes capable of generating the form of the lognormal distribution, rather than simply adopting a convenient approximation. It is also the only econometrics book I know that has a perfectly apposite quote from Shakespeare at the head of each chapter.\nFor an extract from a review of this book, and of other of Aitchison's books, see\nTHIS LINK\n.\nIn\n1964\nAitchison was promoted to Reader at the University of Liverpool but he only remained there for another two years before returning to the University of Glasgow in\n1966\nwhere he was appointed Titular Professor of Statistics and Mitchell Lecturer in Statistics. In\n1968\nhe was elected a fellow of the Royal Society of Edinburgh. In the same year he published the first of his important student level texts\nSolving problems in statistics\n. The first volume was published in\n1968\nand the second in\n1972\n. Between these he published\nChoice Against Chance: An Introduction to Statistical Decision Theory\n(1970)\n. For extracts from reviews of these textbooks, see\nTHIS LINK\n.\nAitchison continued to hold the chair at the University of Glasgow until\n1976\nwhen he was seconded to the University of Hong Kong as Head of the Department of Statistics. After a year, during which time he had retained his chair in Glasgow, Aitchison decided to make the move to Hong Kong permanent and resigned his position in Glasgow. In the same year of\n1977\nhe founded the Hong Kong Statistical Society. The obituary\n[\n2\n]\ngives some details:-\nThe Hong Kong Statistical Society was founded by Professor Aitchison in\n1977\nwith the aim of promoting the development of statistics in Hong Kong. He was the President of the Hong Kong Statistical Society during\n1977\nto\n1979\nand was one of the Honorary Members. The Hong Kong Statistical Society provides a medium for advancing knowledge and enhancing appreciation of the theory and application of statistics. Thanks to the efforts made by Professor Aitchison, an active, professional forum has been established for practising statisticians in Hong Kong to exchange research findings and opinions. At the same time, the statistical literacy in the community has been greatly enhanced through the continuous promotion of correct use and interpretation of statistics by the Hong Kong Statistical Society.\nIn\n1989\nAitchison retired from the University of Hong Kong and was made professor emeritus. He was not, however, retiring from academic work being only\n63\nyears of age. He went to the United States where he was appointed as Professor and Chairman of the Division of Statistics of the University of Virginia. He spent five years in this role before retiring for a second time in\n1994\n. One of his last papers while he was still on the staff at the University of Virginia was\nPrinciples of compositional data analysis\n(1994)\n. He gives the following introduction:-\nCompositional data consisting of vectors of positive components subject to a unit-sum constraint arise in many disciplines, for example in geology as major-oxide compositions of rocks, in economics as budget share patterns of household expenditure, in medicine as compositions of renal calculi, in psychology as activity patterns of subjects. 'Standard' multivariate techniques, designed for unconstrained data, are wholly inappropriate for such data and yet are still being commonly misapplied. Recognition that the study of compositions must satisfy simple principles has led recently to the advocacy of new forms of analysis of compositional data. The nature of the absurdities arising from applying traditional multivariate techniques to compositions is briefly highlighted and a description of the essential aspects and the advantages of the new methodology is provided.\nAfter retiring in\n1994\n, Aitchison returned once again to Glasgow and he was appointed as an Honorary Senior Research Fellow in the Department of Statistics\n[\n3\n]\n:-\nBesides still-intensive academic activities, John now devoted his time to gardening in his house in Carrington Castel, Lochgilphead, conjuring, and enjoying music.\nLet us briefly list a few of Aitchison's other papers. We mention:\nOn the Distribution of a Positive Random Variable Having a Discrete Probability Mass at the Origin\n(1955)\n;\nThe Construction of Optimal Designs for the One-Way Classification Analysis of Variance\n(1961)\n;\nLarge-Sample Restricted Parametric Tests\n(1962)\n;\nA Geometrical Version of Bayes' Theorem\n(1971)\n;\nBayesian Risk Ratio Analysis\n(1981)\n; and\nBiplots of Compositional Data\n(2002)\n.\nIn addition to honours mentioned above, we note that Aitchison received two highly prestigious awards. He was awarded the Guy Medal in Silver by the\nRoyal Statistical Society\nin\n1988\nand a Krumbein Award from the International Association for Mathematical Geology in\n1995\n. The article\n[\n3\n]\ngives detains of this last mentioned award:-\nPresident Ricardo A Olea presented John Aitchison with the Twentieth Krumbein Medal during the\n1997\nAnnual Conference of the Association, which was held in Barcelona, Spain, September\n22\n-\n27\n. The William Christian Krumbein Medal is the highest award given by our association. According to the by-laws, this medal is awarded to individuals who have made exceptional contributions in the field of mathematical geology. Conditions include\n(1)\noriginal contributions to the science,\n(2)\nservice to the profession, and\n(3)\nsupport of the association. Professor Aitchison's accomplishments clearly satisfy the requirements. I am not only firmly convinced that he deserves the medal, but also happy that he was chosen. He has done important work in statistical research that is crucial to the advancement of quantitative thinking in the earth sciences.\nIn addition he was elected to the\nRoyal Statistical Society\nin\n1960\n. He was a member of the International Statistical Institute\n(1974\n-\n1994)\n; the Bernoulli Society for Mathematical Statistics and Probability\n(1979\n-\n1994)\n; the International Association for Mathematical Geology\n(\nelected\n1980\n, Vice-President\n1989\n-\n1993)\n; and the Institute of Mathematical Statistics. He served as Editor of the\nRoyal Statistical Society, Series B\nfrom\n1963\nto\n1965\nand Associate Editor of\nBiometrika\nfrom\n1966\nto\n1969\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Statistics"
  ]
}