{
  "nome_completo": "Jonas Kubilius",
  "nome_curto": "Jonas Kubilius",
  "ano_nascimento": "1921",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kubilius/",
  "lugar_nascimento": "Fermos, Erzvilkas, Jurbarkas, Lithuania",
  "lugar_morte": "Vilnius, Lithuania",
  "biografia": "Jonas Kubilius\n's name appears in several different forms - his first name as\nJonas\nor\nIonas\n, and his family name as\nKubilius\nor\nKubilyus\n. Let us note at this point that MathSciNet has separate entries for Jonas Kubilius and I P Kubilyus but this is an error as both refer to the subject of this biography. Jonas was born into a farming family in Fermos not far from the village of Erzvilkas. He was the eldest of his parents five boys. He attended the Rudkiskiai primary school about two kilometres from Fermos before continuing his education at the middle school at Erzvilkas where he was prepared for entry to a\nGymnasium\n. He graduated from the school in Erzvilkas in\n1935\nand he then attended the Gymnasium in Raseiniai\n[\n2\n]\n:-\n... a school of classical type,\n[\nwhich\n]\ngave good education in the humanities, including basic Latin and abilities to speak fluent German and French. Describing these years, Kubilius used to mention his attempts to write poetry, to make a radio apparatus, ... and rediscovering the Pythagorean triples.\nKubilius was an outstanding pupil in mathematics and in his final year at school he sometimes helped his mathematics teacher explaining difficult concepts to his fellow students. Towards the end of his schooling, the political situation in Europe was becoming extremely serious. Lithuania, which had been occupied by Germany during World War I, had been recognised as an independent country by the League of Nations in\n1921\n, the year that Kubilius was born. It remained independent and attempted to remain neutral when Germany tried to get them to join the attack on Poland in\n1939\n. However, they were forced to accept Soviet troops and bases on their land. This did not last long for, on\n15\nJune\n1940\n, Soviet forces occupied the country. Kubilius graduated from the Gymnasium in Raseiniai on\n16\nJune and on his graduation day a Soviet tank stood in the centre of the city.\nDespite the dire situation in the country, Vilnius University was still operating and Kubilius matriculated in the Mathematics and Natural Sciences Faculty in October\n1940\n. The university, along with the city of Vilnius, had been controlled by Poland in the years between the wars, although Lithuania had never accepted this international decision, and had operated as the Stefan Batory University. It had been brought back under Lithuanian control in\n1939\nand at that time many Polish staff left the university, for example,\nAntoni Zygmund\nleft at this time. By the time Kubilius entered the university, it was under Soviet control and was being reorganised to fit the Soviet model\n[\n1\n]\n:-\nStudent organisations were closed. Studies were brutally made Soviet. The dismissal of several professors was politically motivated. Thus, lecturers, students and office employees became actively involved in the anti-Soviet resistance movement.\nKubilius was able to study there until\n1943\ndespite the German invasion of Lithuania which meant that from July\n1941\nVilnius was under German control\n[\n1\n]\n:-\nAt the beginning of the Nazi occupation, all Jewish professors and students were dismissed from the University by order of the occupiers. Jewish professors and the majority of the Jewish students were shot dead or tortured to death in concentration camps. The staff of the University who had fled East or were rather active during the Sovietisation process were dismissed, too. Later the Nazis demanded the dismissal of all Russian and Polish students.\nHowever, in March\n1943\nthe university was closed by the occupying German forces in retaliation for some staff and students participating in an anti-Nazi movement, and the buildings began to be used as a military barracks and military hospital. Some of the staff were arrested. It remained closed until the autumn of\n1944\nwhen the Soviets again took control. During the closure, Kubilius spent a year as a teacher of mathematics at the middle school in Erzvilkas where he himself had studied. After returning to Vilnius University to continue his studies, Kubilius decided to write a dissertation on number theory. He had learned number theory in a course given in\n1941\n/\n2\nby Viktoras Birziska. Kubilius graduated\nsumma cum laude\nin\n1946\n.\nAfter graduation, Kubilius was employed as an assistant in the Department of Physics and Mathematics. He held this position for the two years\n1946\n-\n48\n, after which he went to Leningrad to undertake postgraduate studies at the University. At Leningrad University he was advised by\nYuri Vladimirovich Linnik\nand began undertaking research in number theory. He published three papers\n(\nall in Russian\n)\nduring his time as a research student:\nOn the application of I M Vinogradov's method to the solution of a problem of the metric theory of numbers\n(1949)\n;\nThe distribution of Gaussian primes in the sectors and contours\n(1950)\n; and\nOn the decomposition of prime numbers as the sum of two squares\n(1951)\n. In this last mentioned paper, he showed that there are infinitely many primes that can be written as the sum of two squares. Heini Halberstam, reviewing Kubilius's paper on Gaussian primes, writes:-\nHecke\n's results about the asymptotic distribution of primes in algebraic fields were sharpened by Rademacher\n(1935)\nin the case of real quadratic fields, in that he was able to obtain estimates for the error terms in the corresponding prime number theorems. In the present paper the author follows\nRademacher\n's programme in the field\nk\n(\ni\n)\nk(i)\nk\n(\ni\n)\n, and his proof is based to a considerable extent on\nRademacher\n's work.\nKubilius was awarded a Candidate's degree\n(\nequivalent to a Ph.D.\n)\nin\n1951\nfor his thesis\nGeometry of Prime Numbers\n. He published results from his thesis in\nOn some problems of geometry of prime numbers\n(1952)\n. When interviewed later in life, Kubilius always stressed the high quality of the advice he received from\nLinnik\nduring his years as a research student and emphasised how\nLinnik\nhad a wonderful intuition as to which problems would be challenging yet might be solved with enough effort. In fact in\n1951\nhe published a joint paper with\nLinnik\n, namely\nOn the decomposition of the product of three primes into the sum of two squares\n(\nRussian\n)\n.\nFollowing the award of his Candidate's Degree, Kubilius returned to Vilnius where, from\n1951\n, he was in the Institute of Physics and Technology of the\nLithuanian Academy of Sciences\n. In\n1952\n, in addition to his research position, he took on a second part-time position as a lecturer at the university.  He preferred this because a person with his background could appear undesirable during the strong control of the teaching staff. In the same year he published\nOn some problems of the geometry of prime numbers\n(\nRussian\n)\n.\nAlbert Ingham\nwrites in a review:-\nThis is a development of the \"analytical number-theory in\nn\nn\nn\ndimensions\" introduced by\nHecke\non the basis of his zeta-functions associated with an algebraic number-field\nK\nK\nK\nof degree\nn\nn\nn\n. The existing theory is extended and strengthened by the use of the more powerful methods now available for estimating trigonometrical sums and the density of zeros of zeta-functions.\nThe next step for Kubilius was to write a doctoral thesis\n(\nequivalent in level to a D.Sc. or\nhabilitation\n)\n.\nLinnik\nadvised him to submit his doctoral thesis to the\nUSSR Academy of Sciences\nsince this was a more prestigious institution than the\nLithuanian Academy of Sciences\n. To accomplish this, he tried to join the Mathematics Institute of the\nUSSR Academy of Sciences\nin Moscow and his application was accepted. However, he was only a member for one day for, on the following day, his membership was revoked. This was because Moscow had contacted the Lithuanian Communist Party which had sent a telegram to Moscow saying that Kubilius was not reliable. Why, one might ask, would they make such a response? Well, Kubilius's brother Juozas had been a Lithuanian partisan opposed to the Soviets and he had been arrested and sentenced to\n25\nyears in the spring of\n1948\n. Other members of his family had also been deported to Siberia, namely his mother and his brother Antanas while another of his brothers, Bronius, had been expelled from the university for being unacceptable to the communists.\nThe political situation in the Soviet Union was, however, changing. Stalin died in March\n1953\nand Nikita Khrushchev brought about a softening of the hard-line Soviet stance known as the \"thaw\". In\n1956\nKhrushchev denounced Stalin's crimes and everyone, including the Lithuanian Communist Party, took a less hard line. Kubilius participated in reorganizing the Institute of Physics and Technology into the Institute of Physics and Mathematics and, in\n1956\n, became an assistant director of the Institute and the head of the Division of Mathematics. He continued to lecture at the University and, also in\n1956\n, he was able to enroll for his doctorate. He submitted his dissertation\nProbability methods in number theory\nto the Mathematics Institute of the USSR Academy of Sciences in Moscow in late\n1956\nbut did not defend  until November\n1957\n. According to Kubilius, the reason for the delay was a quarrel between the director of Institute\nI M Vinogradov\nand\nA N Kolmogorov\n.  It was thought that Kubilius was among the followers of the latter. Moreover,\nVinogradov\ndid not recognized probabilistic ideas in his area of Number Theory. It was\nLinnik\nwho advised to Kubilius to call the thesis \"a contribution to probability theory\". After this had been done, the process went smoothly. When Kubilius returned by train from Moscow to Vilnius he was met at the railway station by a large group of Lithuanian mathematicians who had come to celebrate his success.\nKubilius published\nProbability methods in number theory\nas a monograph in\n1959\n.\nJ W S Cassels\nwrites in a review:-\nThis monograph is almost entirely devoted to the statistics of the distribution of the values taken by an additive function, i.e., a function\nf\n(\nn\nf (n\nf\n(\nn\n)\nof the positive integer\nn\nn\nn\nsuch that\nf\n(\nm\nn\n)\n=\nf\n(\nm\n)\n+\nf\n(\nn\n)\nf (mn) = f (m) + f (n)\nf\n(\nm\nn\n)\n=\nf\n(\nm\n)\n+\nf\n(\nn\n)\nwhen\nm\n,\nn\nm, n\nm\n,\nn\nare coprime. ... There is a detailed exposition of several important results, several of them due to the author. Much of the detail of the proofs and several of the results do not seem to have appeared in print before or have appeared only in comparatively inaccessible journals. There is comparatively little discussion of the history of the subject or of how the results obtained fit into the general framework of what is known about additive functions. There is, however, a pretty full bibliography which covers a much wider field than the book itself. The monograph is to be welcomed as a useful addition to the literature of a topic of considerable current interest.\nVilnius University was going through difficult times. Juozas Bulovas became the Rector of the University in\n1956\nand he tried to make the university \"Lithuanian\". He dismissed poor quality staff who had only been given positions because they were \"good Soviets\". He reemployed some professors who were returning from exile in Siberia, where they had been sent for their political views. However, his reforms were too much for the Soviet authorities, despite the softer approach that they were now taking and Bulovas was dismissed for having failed to rid the University of:-\n... bourgeois ideology, relics of nationalism, of clinging to the past, and national isolationism.\nKubilius was offered the position of Rector to replace Bulovas. At first Kubilius was reluctant to accept since he was deeply involved with mathematical research and he did not see how he could take on the role of rector without it interfering with his research output. However he decided that he should put Vilnius University before his personal wishes and decided to accept after he had decided that there were three important tasks that he had to achieve in the role of rector. First he wanted to preserve the Lithuanian character that Bulovas had introduced. He felt that Bulovas had precisely the right aims but lacked the political skill to achieve them in the extremely difficult environment. Secondly Vilnius University had a proud history and he wanted it to regain its former glories. Thirdly, Kubilius felt that although some research was being undertaken at the university, it was necessary to increase this markedly and to do so would require putting the right infrastructure in place.\nDespite the work involved in his role as rector, which he undertook for\n33\nyears, Kubilius was able to continue to undertake outstanding research on applying\nprobability theory\nto the theory of numbers. He published a second edition of\nProbabilistic methods in the theory of numbers\n(\nRussian\n)\nin\n1962\nwhich was considerably different from the first edition. Much new material was incorporated in this edition, in particular a completely new chapter giving Kubilius's results on the number of distinct prime divisors of an integer m. This second edition was translated into English and published by the\nAmerican Mathematical Society\nin\n1964\n. He published some papers in Russian such as\nAsymptotic expansion of the distribution laws of certain arithmetical functions\n(1962)\n,\nOn asymptotic laws of distribution of additive arithmetical functions\n(1965)\n, and\nOn the distribution of number-theoretic functions\n(1970)\n. He also published\nOn local theorems for additive number-theoretic functions\n(1969)\nin English in a collection of papers in honour of\nEdmund Landau\n.\nAs rector he had to tread a very difficult line to try to achieve his aims within the difficult conditions imposed by the Communist party. The softer approach adopted during Khrushchev's time as premier of the Soviet Union was, to some extent, reversed when Leonid Brezhnev took over. When Kubilius became rector, the University of Vilnius was the only university in the Soviet Union in which the language of instruction was not Russian. It took great political skill to maintain this despite the demands of the Soviets. But he was helped in his task because of the international recognition of his research achievements. He encouraged his colleagues to write Lithuanian textbooks and he himself published\nFunction Theory of a Real Variable\n(1970)\nand\nProbability Theory and Mathematical Statistics\n(1979)\nas Lithuanian student texts.\nIn\n1979\nVilnius was\n400\nyears old and Kubilius wanted to ensure that the event to celebrate the occasion enhanced its reputation and did not become highjacked for political purposes. He achieved his aims by inviting a large number of guests\n[\n5\n]\n:-\nIn his speech at this celebration, president Kubilius said: \"The past is the root that is closely joined to this day and frequently it sprouts with unexpected buds even for the future.\" These words certainly were a heresy for the Soviet ideology and they expressed the president's different view on the role of our past and of the\n400\n-year-old institution of learning. Indeed, looking at the past according to the meaning of the words he uttered is irreconcilable with the Marxist ideology and the effort to renounce the old world and to create a new one as even the Marxist anthem says. Neither did the rest of the Kubilius's speech at this celebration follow the rules of the Soviet style, since he did not mention Lenin or Marx even once.\nHe also participated in the political life of Vilnius and in\n1989\nwas elected people's deputy. Kubilius received much international recognition for his achievements, in particular he was awarded honorary degrees from the universities of Greifswald, Prague, Latvia and Salzburg.\nKubilius was married and when asked the secret of their happiness he replied, \"I had a good wife, a wonderful woman.\" They had a son Kestutis who became a mathematician and a daughter Birute who became a professor of medicine.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}