{
  "nome_completo": "Jordanus Nemorarius",
  "nome_curto": "Jordanus Nemorarius",
  "ano_nascimento": "1225",
  "ano_morte": "1260",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jordanus/",
  "lugar_nascimento": "Borgentreich (near Warburg), Germany",
  "lugar_morte": "At sea",
  "biografia": "Jordanus Nemorarius\nis also called\nJordanus de Nemore\n. He is someone who has been the subject of considerable research without any definite conclusions being reached about his life. Perhaps the most significant fact is a very negative one, namely that Jordanus de Nemore's name does not appear in any list of clerics so it is generally assumed that he was a layman. On the positive side we note that Richard de Fournival, who was Chancellor of the Cathedral of Amiens, made a list of works which were desirable for the Cathedral library in\n1250\nand four works by Jordanus appear.\nThere are two things which research has discovered which are controversial. One is a marginal note written on a manuscript which states:-\nThis is enough to say for the instruction of the students of Toulouse.\nThis was, for quite some time, thought to have been written by Jordanus so proving that he taught at Toulouse. However Thomson, in\n[\n14\n]\n, discounts the manuscript as being written by Jordanus and in this case there is no reason to associate him with Toulouse.\nThe second controversy among scholars regarding Jordanus is whether Jordanus de Nemore and Jordanus de Saxonia are the same person. It is known that Jordanus de Saxonia was the first successor to Saint Dominic as the Grand Master of the Dominicans. Jordanus de Saxonia:-\n... was renowned in Paris for his secular knowledge particularly in mathematics and, it is said, wrote two very useful books ...\nThis is fair evidence that the two Jordanus's are the same person but it is far from conclusive. Hughes\n(\nsee for example\n[\n3\n]\n)\ndoes not believe that the two are the same.\nWhat we do know of Jordanus is his works, many of which have survived. These show that he was someone of considerable importance in the development of mathematics and science. Hughes writes\n[\n3\n]\n:-\nJordanus de Nemore was, and is, recognised as one of the most prestigious natural philosophers of the thirteenth century. His activities encompassed the field of mathematical physics. In particular, he laid the foundation for the entire area of medieval statics. At a more elementary level, his mathematical works on arithmetic, both logistic and specious, and algebra were copied and printed many times, well into the sixteenth century.\nJordanus was the first to correctly formulate the law of the inclined plane. He wrote several books on arithmetic, algebra, geometry and astronomy. He also used letters to replace numbers and was able to state general algebraic theorems but this early use of algebraic notation was not used by subsequent writers. Let us look in more details at his mathematical work.\nThere are six mathematical treatises written by Jordanus. The\nDemonstratio de algorismo\nⓉ\n(\nA demonstration of notation\n)\ngives a practical explanation of the Arabic number system. It deals only with integers and their uses while, on the other hand, the text\nDemonstratio de minutiis\nⓉ\n(\nA demonstration of trivia\n)\ndeals with fractions. A theoretical work on arithmetic which became the standard source of Middle Ages texts is\nDe elementis arithmeticae artis\nⓉ\n(\nElements of arithmetic art\n)\n. Geometry is developed in the work\nLiber phylotegni de triangulis\nⓉ\n(\nBook of study of triangles\n)\nwhich is an excellent example of a Middle Ages Latin geometry text. The\nDemonstratio de plana spera\nⓉ\n(\nDemonstration of a plane sphere\n)\nis a specialised work on geometry which studies stereographic projection. Perhaps the most impressive of all is the\nDe numeris datis\nⓉ\n(\nOn the numbers given\n)\nwhich is the first advanced algebra to be written in Europe after\nDiophantus\n. It\n[\n3\n]\n:-\n... is recognised as the first advanced algebra composed in western Europe.\nIn\nDe numeris datis\nJordanus gives results on solving quadratic equations similar to those given by\nal-Khwarizmi\nexcept general forms are given rather than the numerical examples of the earlier text. The proofs given by Jordanus, like those of\nal-Khwarizmi\n, are by the method of completing the square. Let us give an example of one of the problems\n(\nusing the translation given in\n[\n3\n]\n)\n:-\nIf a given number is separated into two parts such that the product of the parts is known, then each of the parts can be found.\nThe solution illustrates the use of letters by Jordanus:-\nLet the given number\na\na\na\nbe separated into\nx\nx\nx\nand\ny\ny\ny\nso that the product of\nx\nx\nx\nand\ny\ny\ny\nis given as\nb\nb\nb\n. Moreover, let the square of the sum of\nx\nx\nx\nand\ny\ny\ny\nbe\ne\ne\ne\n, and the quadruple of\nb\nb\nb\nbe\nf\nf\nf\n. Subtract this from\ne\ne\ne\nto get\ng\ng\ng\n, which will then be the square of the difference of\nx\nx\nx\nand\ny\ny\ny\n. Take the square root of\ng\ng\ng\n, call it f. Then h is also the difference of\nx\nx\nx\nand\ny\ny\ny\n. Since\nh\nh\nh\nis known, then\nx\nx\nx\nand\ny\ny\ny\ncan be found.\nWhat Jordanus has done, of course, is to use the fact that\n(\nx\n−\ny\n)\n2\n=\n(\nx\n+\ny\n)\n2\n−\n4\nx\ny\n(x - y)^{2} = (x + y)^{2} - 4xy\n(\nx\n−\ny\n)\n2\n=\n(\nx\n+\ny\n)\n2\n−\n4\nx\ny\n. After the general result he then gives a numerical example of the method he has just explained:-\nThe mechanics of this is easily done. For example, separate\n10\ninto two numbers whose product is\n21\n. The quadruple of this is\n84\n, which subtracted from the square of\n10\n, namely\n100\n, yields\n16\n. Now\n4\nis the root of this and also the difference of the two parts. Subtracting this from\n10\nto get\n6\n, which halved yields\n3\n, the lesser part; and the greater is\n7\n.\nIn astronomy Jordanus used letters to denote the magnitudes of stars\n(\nnot unrelated to his use of letters for algebraic notation\n)\n. He wrote a treatise on mathematical astronomy called\nPlanisphaerium\nas well as\nTractatus de Sphaera\n. On statics he wrote\nDe ratione ponderis\nwhich contains results such as:-\nIf the arms of a balance are proportional to the weights suspended, in such manner that the heavier weight is suspended from the shorter arm, the weights will have equal positional gravity.\nWe can compare this result on statics with a result from\nDe numeris datis\nⓉ\n(\nOn the numbers given\n)\nwhich illustrates a possible motivation for the algebraic results in the latter text:-\nIf the ratio of the two parts of a given number is known, then each of them can be found.\nJordanus visited the Holy Land and, on the return journey, he lost his life at sea.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}