{
  "nome_completo": "Jorgen Pedersen Gram",
  "nome_curto": "Jorgen Gram",
  "ano_nascimento": "1850",
  "ano_morte": "1916",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gram/",
  "lugar_nascimento": "Nustrup (18 km W of Haderslev), Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Jorgen Gram\n's father, Peder Jorgensen Gram, was a farmer and his mother was Marie Magdalene Aakjaer. After completing two parts of his primary school education, Jorgen entered the Ribe Katedralskole secondary school in\n1862\n. He graduated in\n1868\nand began his university education.\nIn\n1873\nGram graduated with a Master's degree in mathematics. This degree was of a higher level than the present British/American Master's degree and more on a par with today's British/American Ph.D. Gram had published his first important mathematics paper before he had graduated. This was a work on modern algebra which appeared first in\nTidsskrift for Mathematik\nbut, in\n1874\n, Gram published a fuller account of the same material in French. This fuller version appeared in\nMathematische Annalen\nunder the title\nSur quelques théorèmes fondamentaux de l'algèbre moderne\nⓉ\n(\nOn some fundamental theorems of modern algebra\n)\n. This work provided a simple and natural framework for\ninvariant theory\n.\nIn\n1875\nGram was appointed as an assistant in the Hafnia Insurance Company. Around the same time he began working on a mathematical model of forest management. We give more details below of this research interest which Gram followed for many years. His career in the Hafnia Insurance Company progressed well and soon he was promoted to a more senior role in the company. However his work for the insurance company led him back into mathematical research. He began working on\nprobability\nand numerical analysis, two topics whose practical applications in his day to day work in calculating insurance made their study important to him.\nGram's mathematical career was always a balance between pure mathematics and very practical applications of the subject. We have already mentioned the very practical applications to forestry which he continued to study at this time, and his work on probability and numerical analysis involved both the theory and its application to very practical situations. He published a paper on these topics\nOn series expansions determined by the methods of least squares\nand for this work he was awarded the degree of Doctor of Science in\n1879\n. This degree, equivalent to today's British D.Sc., is at a higher level than a doctorate. Gram later published this work in the\nJournal für Mathematik\nand it proved to be of fundamental importance in the development of the theory of\nintegral equations\n.\nThe year\n1879\nwas important for Gram in another context, for on\n30\nSeptember of that year, he married Dorthe Marie Sørensen who was the daughter of a blacksmith. Also in\n1879\nGram published the second of his four papers on forestry which all appeared in Danish Forestry Journals. The first had appeared in\n1876\n, a year after he began this research, and it presented a mathematical model for maximising the profit in managing a forest. The paper was written in Danish and failed to be noticed outside his own country. In fact Gram never gained the international recognition for this work which he deserved but German researchers, unaware of Gram's contributions, published their own results on the same problems. There is little doubt that their work was far less satisfactory than that of Gram's yet because it was readily accessible it was the Germans and not Gram who gained international acclaim. Gram extended his work on forestry in later papers. After the\n1879\npaper he published two further papers in\n1883\nand\n1889\n. These papers included developments of his forestry model which he was able to make in the light of experiments on trees which he carried out over a number of years. He work in this area was later widely used.\nGram's work on probability and numerical analysis led him in a natural way to study abstract problems in\nnumber theory\n. In\n1884\nhe won the Gold Medal of the\nRoyal Danish Academy of Sciences\nfor his paper\nInvestigations of the number of primes less than a given number\nwhich he published in the journal of the Society. Gram had corresponded with\nMeissel\non this topic and in\n1885\nMeissel\ntravelled to Denmark and met with Gram. It was\n1885\nthat\nMeissel\npublished his work on the number of primes less than\n1\n0\n9\n10^{9}\n1\n0\n9\nso the two had much to discuss on the topic. Gram also worked on the\nRiemann\nzeta function\n.\nZeuthen\nwrites in\n[\n1\n]\n:-\nHis brilliance and scientific training together with his practical skills made his contributions to pure and applied mathematics very significant.\nAlthough he continued to work for the Hafnia Insurance Company in more and more senior roles, Gram founded his own insurance company, the Skjold Insurance Company, in\n1884\n. He was the director of this company from its founding until\n1910\n. From\n1895\nuntil\n1910\nGram was also an executive of the Hafnia Insurance Company. On\n9\nApril\n1895\nGram's wife Dorthe died. Gram married again just over one year later on\n15\nMay\n1896\n, his second wife being Emma Birgitte Hansen. From\n1910\nuntil his death in\n1916\nGram was Chairman of the Danish Insurance Council. It was through his work for the insurance companies that Gram became close to another Danish mathematician, Thorvald\nThiele\n, who worked as an actuary.\nDespite not teaching mathematics in a university and as a consequence never having any students, Gram still managed to influence the next generation of Danish mathematicians in a very positive way. He often lectured in the\nDanish Mathematical Society\n, he was an editor of\nTidsskrift for Mathematik\nfrom\n1883\nto\n1889\n, and he also reviewed papers written in Danish for the\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\n.\nGram received honours for his mathematical contributions despite being essentially an amateur mathematician. The\nDanish Academy\nhad awarded him their Gold Medal in\n1884\nbefore he became a member, but in\n1888\nhe was honoured with election to the Society. He frequently attended meetings of the Society and published in the Society's journals. For many years he was the Treasurer of the\nDanish Academy\n.\nGram is best remembered for the Gram-\nSchmidt\northogonalisation process which constructs an orthogonal set of vectors from an independent one. He was not however the first to use this method. The process seems to be a result of\nLaplace\nand it was essentially used by\nCauchy\nin\n1836\n.\nGram met his death in a rather strange and very sad way. He was on his way to a meeting of the\nDanish Academy\nwhen he as struck and killed by a bicycle. He was sixty-five years old when he met his death in this tragic accident.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}