{
  "nome_completo": "Jorge Andrés Ize Lamache",
  "nome_curto": "Jorge Ize",
  "ano_nascimento": "1946",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ize/",
  "lugar_nascimento": "Tulancingo, Hidalgo, Mexico",
  "lugar_morte": "Mexico City, Mexico",
  "biografia": "Jorge Andrés Ize\nwas the son of Jorge Julio Ize Theodorides\n(1915\n-\n1988)\nand Ana Agnés Maria Lamache\n(1916\n-\n1983)\n. Jorge Ize Theodorides, the son of Louis Ize and Blanca Theodorides, was born in Tulancingo, Hidalgo, Mexico on\n17\nOctober\n1915\n. Tulancingo is a city about\n90\nkm north east of Mexico City. He worked in France and there married Ana Agnés Maria Lamache on\n26\nFebruary\n1938\nat La Mulatière, Rhône, Rhône-Alpes. Ana Agnés Lamache, daughter of Georges Marie Gabriel Lamache and Anne Marie Louise Jullien, had been born in La Mulatière, Rhône, France on\n10\nSeptember\n1916\n. La Mulatière is a district of Lyon. We note that Lamache often appears as La Mache. Jorge Ize and Ana Agnés Lamache de Ize had five children: Juan Francisco Ize Lamache, born in Lyon, France on\n18\nSeptember\n1938\n; Maria Blanca Ize Lamache, born in Le Lavandou, France on\n15\nNovember\n1939\n; Luis Vincente Ize Lamache, born in Tulancingo, Hidalgo, Mexico on\n4\nSeptember\n1942\n; Jorge Andrés Ize Lamache, the subject of this biography born in Tulancingo, Hidalgo, Mexico on\n24\nJanuary\n1946\n; and Alain Ize Lamache, born in Tulancingo, Mexico on\n4\nOctober\n1947\n.\nWorld War II started with the German invasion of Poland on\n1\nSeptember\n1939\nand, on\n3\nSeptember, France declared war on Germany. In October of that year Hitler ordered an immediate invasion of France but it was postponed till the spring of\n1940\n. The Ize family were in France at this time and Maria Blanca was born there in November\n1939\n. But for the war they might have stayed in France but they left and went to Mexico, living in Jorge Julio's home town of Tulancingo. This city would become their permanent home but all members of the family spent much time in France over the following years. Of course this was not possible while World War II was being fought. The last two children, Jorge Andrés, the subject of this biography, and Alain were both born in Tulancingo shortly after World War II ended. On\n26\nJune\n1949\nJorge Julio and Ana Agnés Ize, together with their three eldest children, flew to Paris leaving Jorge Andrés and Alain with other members of the family in Tulancingo. The family returned flying via New York on\n30\nSeptember\n1949\n.\nJorge Andrés made his first trip to France in\n1953\nsailing from New York to Le Havre, France on the ship\nIle de France\n, departing on\n22\nAugust\n1953\n. The whole family, parents and five children, made this trip to Lyon where several siblings of Jorge Andrés' mother lived. They did not return together, however, with Jorge Andrés' father returning from Paris to Mexico via New York on\n17\nFebruary\n1954\n. Jorge Andrés' mother returned with Jorge Andrés and Alain, also via New York, flying New York to Mexico City on\n14\nOctober\n1954\n. The three eldest Ize children remained in France for their education. Jorge Andrés and Alain returned to France, sailing with their parents from New York to Barcelona on\n2\nAugust\n1955\n. Although he made return visits to Mexico, from this point on Jorge Andrés' education was in France. Writing about his education, Carlos Bosch Giral and Gilberto Flores explain in\n[\n3\n]\n:-\nAlways professional, prepared and responsible, those were without a doubt the principles that he acquired from his family and especially from his mother, a mathematician by training, who took charge of his basic instruction in Tulancingo, his birthplace. At the end of that stage, his parents sent him along with his brothers to finish their studies in Lyon, France, where some aunts lived. He also studied there for a bachelor's degree in mathematics and a master's degree in physics. In that period he came across the \"May Revolution\" of\n1968\n.\nIze was studying at the University of Lyon in\n1968\nwhen the \"May Revolution\" took place. There were protests by students and workers which led to civil unrest across France\n(\nand, in fact, many other countries\n)\n. Students protested about the university system and about their teachers. They occupied buildings and the police were called in by university administrations. It was an important event for the young Jorge Ize and in many ways marked his attitude towards his students when he became a university teacher. As a consequence, he always worried about his students, wanted the best of facilities for them and tried to always be approachable.\nAfter the award of his Master's Degree in\n1969\n, Ize began studying for a Ph.D. at the\nCourant\nInstitute, part of New York University. His advisor at the\nCourant\nInstitute was\nLouis Nirenberg\nand, after completing a Master's Degree in Mathematics, he began undertaking research for his doctorate.\nThe year\n1972\nproved important for Ize since in that year he met Teresa Ludlow whom he would later marry. The way they met is worth recounting. The Ize family arranged a Greek holiday in that year. It was organised by Jorge's grandmother Blanca Theodorides who was Greek and the group would consist of Jorge's paternal grandparents, his parents and the five children. Now, for various reasons, Luis Vincente could not take part but by this time he was married to Isabel Ludlow and she was included in the holiday group. Not wanting Isabel to lack company, the Ize family invited Isabel's sister Teresa Ludlow to join them. Isabel and Teresa\n[\n3\n]\n:-\n... arrived in Athens on the agreed date, where Teresa says: \"... I met a conversational friend like never before, nice, interesting, gentlemanly ... that first evening with Jorge is unforgettable for me ... \". The next day they embarked and became engaged on the cruise. At the end of the tour, Jorge returned to New York. They wrote to each other abundantly and saw each other on vacation.\nWhile still a research student, Ize met Alfonso Vignoli, Massimo Furi and Mario Martelli at the International Summer Institute of the University of Montreal in June\n1973\n. Alfonso Vignoli is an Italian mathematician born on\n1\nFebruary\n1940\n, in Florence while Massimo Furi and Mario Martelli are also Italian mathematicians, both having been awarded doctorates by the University of Florence. The authors of\n[\n1\n]\nwrite:-\nJorge met Alfonso first, in\n1973\n, in a month long meeting in Montreal which has been quite important since many of us started, at that time, a long friendship. Jorge was still a graduate student, taking careful notes at every talk and proud that his adviser,\nLouis Nirenberg\n, had included some of the results of his thesis in his mini-course. Alfonso was with a lively group of Italians, in particular the other two musketeers\n[\nMassimo Furi and Mario Martelli\n]\n, who used to sing, laugh and talk about politics until very late at night. They made a Latin group with the participation of some Germans and even a native Hawaiian.\nJorge Ize married Teresa Ludlow on\n19\nJanuary\n1974\n. Ana Teresa María de Guadalupe had been born on\n10\nMarch\n1950\n.  Her father was Cristobal Carlos Iarlato Antonio and her mother Isabel Saldivar Fernández del Valle. She is the fifth oldest of her parents eight children. Jorge and Teresa Ize had three children: Pablo Andrés Ize, born on\n15\nMay\n1975\n; Felipe Jorge Ize, born on\n13\nNovember\n1978\n; and Andrés Luis Ize, born on\n9\nNovember\n1980\n.\nLater in\n1974\n, Jorge Ize submitted his doctoral thesis\nBifucation Theory for Fredholm Operators\nwhich was considered to be of exceptional quality by the examiners. He published an extended version of his thesis as the\n129\n-page book\nBifucation Theory for Fredholm Operators\nin the\nMemoirs\nof the\nAmerican Mathematical Society\nin\n1976\n. He writes in the Acknowledgements\n[\n7\n]\n:-\nThis paper is an extended version of the author's doctoral thesis written at the Courant Institute of New York University. The author would like to express his gratitude to Professor\nLouis Nirenberg\nfor his advice, for his insight and his kindness. Thanks are also due to the Consejo Nacional de Ciencia y Tecnologia of Mexico which provided a partial support for the author's doctoral studies and in particular for this research.\nYou can read the Introduction to this book at\nTHIS LINK\n.\nAfter the award of his doctorate, Ize returned to Mexico City where he began working at the Universidad Nacional Autonoma de Mexico\n(\nUNAM\n)\n. He was employed at\n[\n3\n]\n:-\n... the Institute for Research in Applied Mathematics and Systems\n(\nIIMAS\n)\nof the UNAM, which became his second home. Every day he arrived around ten and at three without fail he left his office to go to his house in Tizapán where he ate with his family, outdoors under a leafy tree. He would return to his office at half past five where he would stay until nine or ten at night, because \"the Institute is quieter and you can work better there.\" Jorge Ize was always a talented and tireless worker.\nIze and Alfonso Vignoli got to know each other well in\n1976\nwhen Alfonso was a visitor to the UNAM\n[\n1\n]\n:-\nAfter a few casual encounters at meetings, Alfonso spent a month in\n1976\nat the Universidad Nacional Autonoma de Mexico, where he lectured on the nonlinear spectrum and stayed at Jorge's home. One of Jorge's students wrote his bachelor thesis on this topic.\nAt this time Alfonso Vignoli was giving lectures on results he had obtained with Massimo Furi and Mario Martelli but soon Ize became an important collaborator with Vignoli. Ize began publishing papers on bifurcation theory, the topic of his doctoral thesis. Let us quote the beginning of the description of bifurcation theory from\n[\n2\n]\n:-\nThe study of bifurcation, vaguely understood as \"change in morphology\", arises in many different areas of mathematics as well as in the natural sciences and various branches of engineering. Each of these fields has given his own imprint to the concept, which ultimately led to its indeterminacy. However, one particular aspect of bifurcation theory, bifurcation of solutions of a parametrised family of equations from a trivial branch of solutions, is one of the oldest and better understood notions of bifurcation in mathematics. Indeed, the earliest example of a specific bifurcation phenomenon of this type can be traced back to\nLeonard Euler\nwho, in\n1757\n, studied the deviation of a loaded vertical elastic column as it buckled from its position of equilibrium, which he modelled as a boundary value problem parametrised by the load. By increasing the load on the top of the column the vertical equilibrium position becomes unstable and the column changes its configuration, acquiring a new configuration each time the amount of load, considered as a parameter, crosses some critical values. The boundary value problem always has a solution corresponding to the vertical configuration, and new solutions appear at critical values of the load.\nEuler\nproved that those critical values, when suitably normalised, coincide with the eigenvalues of the linearisation at the trivial solution of the boundary value problem.\nFor information on four of Ize's single-author papers on bifurcation theory between\n1979\nand\n1985\n, see\nTHIS LINK\n.\nThe beginning of the collaboration between Ize and Vignoli began in the spring of\n1982\nwhen Ize visited Cosenza, Italy, where Vignoli was working at the University of Calabria. Ize had taken a sabbatical year in\n1981\n-\n82\nand, not surprisingly given his French upbringing, had spent most of that year in France at the University of Nice. He then spent a while in Germany before accepting an invitation from Vignoli to spend a month in Cosenza and give a series of lectures on bifurcation theory at the University of Calabria\n[\n1\n]\n:-\nIn Nice, Ize had been working on the relationship between extensions of maps and the non-triviality of bifurcation invariants for several parameters. Alfonso Vignoli, Ivar Massabò and Jacobo Pejsachowicz had been playing with the idea of \"complementing maps\" applied to different classes of maps. The idea of complementing maps consists in \"filling up\" the dimension of the range, in rather the same way as the implicit function theorem may be proved by means of the inverse function theorem. They had given a very nice argument, based on\nZorn\n's lemma, to simplify the\nAlexander\n-Antman proof of the dimension of \"bifurcating surfaces\". This combination of ideas and previous work led them to begin a collaboration ... In Cosenza the whole \"gang of four\"' worked very intensely, in the house on campus. ... This first step was followed by a whole year that Alfonso spent in Mexico\n[\nworking with Ize\n]\nand where he fell in love with the country.\nOne of the two papers which came directly from this four author collaboration was\nStructure and dimension of global branches of solutions to multiparameter nonlinear equations\n(1985)\n. It begins:-\nThis paper arose from an attempt to unify, clarify and extend some recent work on the topological dimension of global branches of solutions appearing in different problems of Nonlinear Analysis.\nThe paper notes that it was:-\nWork performed while the fourth named author\n[\nAlfonso Vignoli\n]\nwas visiting the Department of Mathematics and Mechanics, IIMAS-UNAM, Mexico.\nFor more information on this paper, see\nTHIS LINK\n.\nIn\n1989\n-\n90\nIze was a visiting professor in Italy at the Seconda Universita di Roma. During this time, however, he also taught at the University of Calabria which is in Cosenza, about\n430\nkm south of Rome. He made the journey from Rome to Cosenza by train every week to allow him to spend one day teaching students there.\nIn December\n1995\nJorge Ize Lamache set up FENOMEC at the National Autonomous University of Mexico. FENOMEC\n(\nProyecto Universitario de Fenómenos Nolineales y Mecánica\n)\nis the University Project of Nonlinear Phenomena and Mechanics and its purpose is to support research, teaching and dissemination activities, which tend to establish and strengthen collaborations between departments of the National Autonomous University of Mexico. You can read more about FENOMEC and Ize's views on the type of research it carried out at\nTHIS LINK\n.\nPerhaps Ize's most important contribution was his collaboration with Vignoli on the book\nEquivariant degree theory\n(2003)\n. Wieslaw Krawcewicz begins the review\n[\n9\n]\nas follows:-\nThe book under review is the first of its kind on equivariant degree theory and should be considered as an important contribution to modern nonlinear analysis. The importance of symmetry in every aspect of life cannot be underestimated. Unfortunately, studying nonlinear problems with symmetries is not simple and involves advanced mathematical methods and techniques that make this area difficult to access by non-specialists. The book by Ize and Vignoli is an honest and substantial effort to open the area of equivariant analysis to applied mathematicians interested in nonlinear equations with symmetries.\nFor more information about this book, see\nTHIS LINK\n.\nIze died at the young age of\n66\nin\n2012\n. The author of\n[\n10\n]\nwrites:-\nAlmost\n40\nyears after beginning his scientific career at UNAM, Dr Jorge Andrés Ize Lamache passed away on\n16\nAugust\n2012\n, sheltered by the love and respect of his loved ones. Committed to the University until the last moments of his life, his integrity, dedication, loyalty and honesty will be an example of the academic and human being who enhances the environment in which he lives.\nTo end this biography, we give the Foreword of\n[\n2\n]\n:-\nWe were all shocked and devastated by the news of Jorge's passing. His mathematical ideas and personal relationship have permanently influenced our lives. Jorge constructively affected our professional attitudes, gave us a strong sense of responsibility as researchers and professionals, and was a close personal friend. We believe that nobody is better suited to express the feelings confronting Jorge's premature departure than Alfonso Vignoli, his dearest friend and close collaborator for forty years.\nI met Jorge in June\n1973\nat a conference in Canada. Our encounter could have not been more explosive. I found myself talking to a person very different from me: reserved and of few, albeit essential words. After each conference I was astounded by the depth in analysis of the results submitted. He often put me in a difficult spot by asking my opinion on a newly announced theorem. He was not, I underscore, a mathematics 'crank'. He adored art, food, travelling and knowing the history of nations. He was abreast of politics, even Italian, and his readings were always lucid. I remember our visits to the church of Santa Maria Maggiore in Rome, with Jorge equipped with small, powerful binoculars to probe the mosaics, looking for precious particulars. I think some of the best results we achieved upon return in our Roman home with a good glass of wine that was never missing. Coming to Italy relieved him from the headaches that assailed him after a glass of wine in Mexico City, probably, due to altitude. I believe one of the reasons our friendship grew stronger over the years is tied to\n(\nquite\n)\na few hearty drinks and laughter, and to his subtle irony that let transpire a deep affection for me and my family. Of his extended scientific production I only want to highlight the book 'Equivariant Degree Theory' a book Jorge did not want to write. I had to insist manifold, and almost court him, to convince him. The result was a much cleaner version of the theory and a text filled with his ideas that I believe will give several cues to the coming schools of researchers. Many were the research projects upon which we fantasised, dreamed and ironized of. Many were the meetings we had planned for the coming months and years, even 'just' to drink our glass of wine, to laugh and see him raise his eyebrow to my free and odd stories.\nAlfonso Vignoli.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}