{
  "nome_completo": "José Sebastiao e Silva",
  "nome_curto": "José Sebastiao e Silva",
  "ano_nascimento": "1914",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Silva/",
  "lugar_nascimento": "Mértola, Alentejo, Portugal",
  "lugar_morte": "Lisbon, Portugal",
  "biografia": "José Sebastiao e Silva\nattended secondary school in Évora where his abilities in mathematics were very evident and he obtained outstandingly high grades where he graduated from the high school. He then entered the Faculty of Sciences in Lisbon where he studied Mathematical Sciences graduating in\n1937\n. Being unable to continue to undertake research at this stage, Silva had to wait until\n1940\nbefore he received a grant from the Instituto de Alta Cultura to support his work. He published his first paper in\nPortugaliae Mathematica\nin\n1940\n, this being\nOn the numerical resolution of algebraic equations\n(\nPortuguese\n)\n. In the following year he published\nProblems concerning rational functions of the roots of an algebraic equation\n(\nPortuguese\n)\nin the same journal. These two papers were major works, the first being around\n30\npages long and the second being\n15\npages.\nMax Zorn\nreviewed this second article. Here is an extract from his review:-\nIn section\n5\nof this paper the author outlines a procedure to find the irreducible factors of a polynomial in a field. The coefficients of a normalized factor belong to a field generated by the symmetric functions of\np\np\np\nof the\nn\nn\nn\nroots. In favorable cases, this field is generated by the sum or the product of these\np\np\np\nroots. Determine the equation whose roots are all sums of\np\np\np\nroots; if there is a factor in the field, then this equation has a root in the field. Assuming that it is possible to find all roots of an equation in a field, the preceding section furnishes a method of finding the coefficients of the factor, if it exists.\nSilva continued publish papers with two further papers appearing in\nPortugaliae Mathematica\nin\n1941\n, namely\nSur l'axiomatique des espaces de Hausdorff\nⓉ\n(\nOn the axioms of Hausdorff spaces\n)\nin which he characterized\nHausdorff\nspaces with the operations of frontier, orle and border, and\nSur une méthode d'approximation semblable à celle de Gräffe\nⓉ\n(\nOn a method of approximation similar to that of Graffe\n)\n. A further research paper in\n1942\nwas\nLes ensembles fermés et le problème de Wiener\nⓉ\n(\nClosed sets and the Wiener problem\n)\nin which he considered a problem on abstract spaces proposed by Wiener and described in\nFréchet\n's book\nLes espaces abstraits\nⓉ\n(\nAbstract spaces\n)\n(1928)\n. Silva reproved Wiener's results and proved a number of new related results. But Silva was not only publishing research articles, he was also publishing articles on mathematical education during these years such as\nMathematical logic and education\n(\nin three parts all published in\n1941)\n,\nOn the way to establish Taylor's formula\n(1942)\n,\nThe theory of the logarithms in school education\n(1942)\n, and\nReason?\n(1942)\n.\nIn\n1942\nthe Instituto de Alta Cultura awarded Silva a grant which allowed him to go to Rome to further his research career. There he learnt from\nEnriques\n,\nCastelnuovo\n,\nSeveri\nand Fantappie. Silva began working on a doctoral thesis in logic entitled\nTowards a general theory of homomorphisms\n.\nEnriques\nthought that the proposed thesis would not be understood at that time, and thus Silva produced a second thesis in functional analysis\nAnalytic functions and functional analysis\n. The first work\n[\n2\n]\n:-\n... was only published posthumously, forty years after being written, but is, in the recent opinion of scholars, a work of great originality, containing a wealth of ideas, which continue to be of interest today.\nHe did, however, publish\nSugli automorfismi di un sistema matematico qualunque\nin Italian in\n1945\n. The paper has a Latin summary which translated in English reads:-\nAfter defining the general concepts of a \"mathematical system\" and \"automorphism\" the author reaches conclusions which broaden as far as possible the doctrines expounded by\nF Klein\nin his \"Erlanger Programm\" and thereby extend\nGalois\ntheory to this domain. These conclusions not only systematize and clarify many things in all parts of mathematics, but can also be usefully applied to problems in functional analysis. The theorems which are announced here will shortly be demonstrated in another paper.\nHe also published papers on functional analysis such as\nSull'analisi funzionale lineare nel campo delle funzioni analitiche\nⓉ\n(\nLinear functional analysis in the field of analytic functions\n)\n(1946)\n. The paper summarises the results Silva had obtained modifying the work of\nFantappiè\non the theory of analytic functionals of analytic functions.\nSilva's functional analysis thesis was submitted to the Faculty of Sciences in Lisbon in\n1949\nand Silva was awarded his doctorate; the thesis was published as a\n130\npage paper in\nPortugaliae Mathematica\nin\n1950\n. A reviewer writes:-\nThis paper appears to be inspired in part by the work of\nPincherle\nand\nFantappiè\n, but it is written more in the recent style of functional analysis in which abstract spaces, particularly\nBanach spaces\n, play a central role. A considerable portion of the paper is given over to the exposition of background material and known results. There is an eight-page summary in French.\nSilva was appointed as a professor in the Instituto Superior de Agronomia in\n1951\nand remained there for ten years before returning to the Faculty of Sciences in Lisbon to the chairs of Mechanics and Astronomy. For twenty years he was Director of the Centre for Mathematical Studies of Lisbon.\nIn\n[\n6\n]\nKöthe\nlooks at Sila's contributions to functional analysis appearing in\n25\npapers between\n1947\nand\n1967\n. In these papers Silva investigates analytic functionals, the theory of distributions, vector-valued distributions, ultradistributions, the operational calculus, and differential calculus in locally convex spaces.\nSilva died of cancer at the age of\n57\n. He is considered by many to be the greatest Portuguese mathematician. The authors of\n[\n2\n]\nwrite:-\nThose who were fortunate enough to be amongst his disciples were impressed not only by his rare professional stature, but also by his character, his generosity in helping and stimulating students at the beginning of his career, and the immense courage he revealed at the end of his life, working with enthusiasm despite suffering. Sebastiao e Silva was truly a great man.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}