{
  "nome_completo": "José Fernando Escobar",
  "nome_curto": "José Escobar",
  "ano_nascimento": "1954",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Escobar/",
  "lugar_nascimento": "Manizales, Colombia",
  "lugar_morte": "Cali, Colombia",
  "biografia": "José Escobar\nwas the son of Gustavo Escobar and Yadira Velásquez. José was widely known by the nickname 'Chepe', a common Spanish nickname for José. Gustavo and Yadira had three children, Maria Victoria Escobar\n(\nborn\n1951)\n, Arturo Escobar\n(\nborn\n1952)\nand José Escobar, the subject of this biography. Maria Victoria became a psychologist. Arturo Escobar became a professor of anthropology and political ecology at the University of North Carolina, Chapel Hill, United States. Writing about his father, Gustavo, in\n[\n4\n]\n, he explains:-\nI want to remember my father, Gustavo, who died in\n1990\nstill dreaming of his small hometown while trying\n(\nwithout great success in terms of conventional economic and development indicators\n)\nto make it in the big city so that his children could \"get ahead\" and become modern.\nWhen José was very young, his parents moved from Manizales, about\n120\nkm west of Bogotá in the mountainous coffee-growing region of western Colombia, to Cali, about\n200\nkm south east of Manizales. Cali is famous for salsa dancing and, indeed, José would become an enthusiastic salsa dancer. José was brought up in Cali and he always considered that his hometown\n[\n11\n]\n:-\n[\nCali\n]\nbecame his home since early childhood and stamped characteristic features on his personality, like his joy for la salsa and la rumba, and his great love for sports. During his childhood and youth he was several times national champion of ornamental dives and in this specialty he won international titles for Colombia. He was extremely fond of soccer. He was almost as proud of his expertise in this matter as he was of his mathematical achievements, and he used to play it regularly during his entire life.\nIn fact he won the title of South American champion in diving and Central American and Caribbean champion in ornamental jumps.\nEscobar was educated at the Colegio Lacordaire, a school in Cali which had been founded in\n1956\nby the Dominicans. In\n1973\nhe graduated from the Colegio Lacordaire and entered the Universidad del Valle in Cali to study mathematics. He proved to be an outstanding student and graduated in\n1977\n. In August of that year the Brazilian government awarded him a scholarship to allow him to undertake postgraduate studies at the Instituto Nacional de Matemática Pura e Aplicada in Río de Janeiro. His studies were supervised by the Uruguayan mathematician Ricardo Mañé Ramirez\n(1948\n-\n1995)\nwho researched dynamical systems and ergodic theory. Escobar was awarded an M.Sc. in\n1979\nfor his thesis\nEquações elíticas de\n2\nª ordem: soluções C* ao problema de Dirichlet\nⓉ\n(\nElliptic Equations of the\n2\nnd Order: C\n*\nSolutions to the Dirichlet Problem.\n)\n. Being in Brazil for these years of postgraduate study meant that, in addition to his mathematical studies, he enjoyed learning about Brazilian music and dance. Of course, Brazil was a country where he could continue his passion for sport, especially soccer.\nThe exceptional quality of his work at the Instituto Nacional de Matemática Pura e Aplicada led to the award of a scholarship by the Brazilian National Council of Scientific and Technological Development to allow Escobar to undertake research at the University of California at Berkeley. His thesis advisor was\nRichard Melvin Schoen\nwho was an expert on differential geometry and geometric analysis, making major contributions to the\nYamabe\nproblem. Escobar was, however, diagnosed with lymphatic cancer and spent two years being treated by Stanford's Medical Center. His exceptional fitness from his sporting activities together with his remarkable determination to overcome the disease, led to his eventual cure. He was helped in his recovery by María Elena Jiménez, a chemical laboratory specialist, whom he married in San Francisco on\n22\nOctober\n1982\n. María Jimenez was aged\n24\nat the time of the marriage. After his recovery, Escobar made two research visits in\n1985\n, one to the\nMittag-Leffler\nInstitute in Sweden which was holding a non-linear analysis year, and the other to the Institut des Hautes Études Scientifiques at Bures-sur-Yvette, south of Paris. He was awarded a Alfred P Sloan Doctoral Dissertation Fellowship for\n1985\n-\n86\n.\nOf course, the very serious health problem meant that Escobar did not complete his Ph.D. until\n1986\nwhen he was awarded the degree for his thesis\nLinear and Non-Linear Partial Differential Equations with Applications to Geometry\n. Fernando Codá Marques writes in\n[\n12\n]\nthat a:-\n... remarkable theorem was obtained in his Ph. D. thesis in collaboration with\nR Schoen\n. He completely determines the functions which can be realised as the scalar curvature of a conformal metric on nontrivial quotients of the three-sphere, extending the well-known\nMoser\n's result for\nR\nP\n2\n\\mathbb{R}P^{2}\nR\nP\n2\n.\nLet us note that the\nMoser\nreferred to in this quote is\nJürgen Kurt Moser\n. This result was published in a joint paper of Escobar and\nSchoen\n,\nConformal metrics with prescribed scalar curvature\nwhich was published in\nInventiones mathematicae\nin\n1986\n. This was one of two papers Escobar published in\n1986\n, the other being\nOn the spectrum of the Laplacian on complete Riemannian manifolds\n.\nThe authors of\n[\n15\n]\nexplain a little about Escobar's work on the\nYamabe\nproblem:-\nA fundamental problem in differential geometry is the\nYamabe\nproblem, which asks whether every manifold can be mapped conformally to a manifold of constant curvature. When Chepe began his thesis work, the\nYamabe\nproblem had recently been solved affirmatively for manifolds without boundary by a group of mathematicians including\nRich Schoen\n, his thesis advisor. Chepe's thesis, and much of his subsequent work, dealt with the\nYamabe\nproblem for manifolds with boundary, where there are additional difficulties to be overcome; for example, new ideas are required just to determine what conditions should hold for the boundary. Chepe was able to solve this problem in most cases, and to do so he had to introduce new methods in nonlinear partial differential equations.\nFollowing the award of his doctorate, Escobar spent the rest of his career in the United States. He worked at the\nCourant\nInstitute in New York\n(1986\n-\n1987)\nand then as a\nL E Dickson\nInstructor at the University of Chicago\n(1987\n-\n88)\n. He was promoted to an Assistant Professor at Chicago in\n1989\n. Peter May, who was Head of Mathematics at Chicago, wrote in\n1989\n(\nsee, for example,\n[\n11\n]\n)\n:-\n... the assistant teachers of the University of Chicago form an extremely select group. Escobar is outstanding among the best, even within that group. The research in mathematics requires rare talents and there are very few people in the world with his capacity. People like him are the ones who are needed to fill in the best mathematics departments ...\nEscobar then spent the years\n1990\nto\n1994\nas an associate professor at Indiana University at Bloomington before becoming a full professor at Cornell University in\n1994\n.\nLet us quote from\n[\n12\n]\nthe overview given there of his research achievements:-\nEscobar's powerful technical skills and his wide range of interests were certainly influenced by his Ph. D. studies under the supervision of\nRichard Schoen\n. During his mathematical career he touched several different and difficult problems lying in the domain of Geometric Analysis - the part of Differential Geometry concerned with the partial differential equations that naturally arise in geometrical questions. We can safely classify his results into two broad classes of problems.\nThe first class encompasses problems of prescribing the scalar curvature and the boundary mean curvature under conformal deformations of metrics. What is perhaps his greatest contribution falls in this class - the solution of the Yamabe Problem on manifolds with boundary in almost all cases. As a consequence of that achievement he proved a generalisation of the profound Riemann mapping theorem to higher dimensions, showing that, except possibly for dimensions\n4\nand\n5\n, every smooth bounded open set of a Euclidean space admits a conformal scalar-flat metric with constant mean curvature on the boundary. ...\nIn the second class we can distinguish his work concerned with the spectral properties of the Laplacian on manifolds and isoperimetric inequalities. He was interested in the\nLaplace\n-\nBeltrami\noperator on complete and noncompact manifolds of nonnegative sectional curvature, together with similar questions on the differential form spectrum of the\nHodge\nLaplacian. Motivated by his work on the\nYamabe\nProblem he also became interested in the\nSteklov\neigenvalue problem on manifolds, which somehow had been forgotten in the literature. He obtained various comparison results for the first nontrivial\nSteklov\neigenvalue and studied its relation to isoperimetric constants. Very recently he also worked on isoperimetric inequalities in three dimensional PL-manifolds of nonpositive curvature.\nLet us note that we\n[\nJJO'C and EFR\n]\npublished a paper with Escobar in\n1995\nin the\nObituario matemático\n1992\n-\n1994\nseries of\nLecturas Matemáticas\n, a joint publication of the\nColombian Mathematical Society\nand the University of the Andes.\nAlthough Escobar was employed in the United States, his influence on Colombian mathematics was enormous and decisive: for example after the award of his doctorate in\n1986\nhe visited Colombia at least once a year, guided and worked with the Geometry and Topology Group of Universidad del Valle, collaborated actively with researchers from the National University in Bogotá and Medellín, and the Universidad de los Andes, organised Summer Schools in Differential Geometry, Partial Differential Equations and Numerical Analysis, as well as giving numerous lectures and workshops.\nIn\n1992\nEscobar was awarded a Presidential Faculty Fellowship. This programme was established in September\n1991\nat the request of President George Bush to\n[\n14\n]\n:-\n... recognise, honour, and promote the integration of high-quality teaching and research in science and engineering fields; foster innovative and far-reaching developments in science and technology; create the next generation of academic leaders; and improve public understanding of the work of scientists and  engineers.\nEscobar visited the White House on\n21\nJune\n1992\nto receive the award in person from President George Bush. He was the only mathematician to receive the award of $\n100\n,\n000\nper year for five years. Also in\n1992\nhe was made an honorary member of the\nColombian Mathematical Society\nand was awarded an honorary doctorate by the Universidad del Valle.\nIn the year\n1992\nhe published another major contribution to extending the\nYamabe\nProblem in his paper\nThe Yamabe Problem on manifolds with boundary\n. In the same letter by Peter May from which we quoted above, he wrote about this paper:-\nThis article is an extraordinarily deep work, original and technically difficult, a really big contribution to Mathematics. Possibly no one without an exceptional ability could have proved the theorems existing in it. ...\n[\nIt\n]\nis an article that any of the best mathematicians in the world would be proud to have written.\nEscobar produced further outstanding results on the\nYamabe\nProblem on compact manifolds with boundary in his\n1996\npaper\nConformal deformation of a Riemannian metric to a constant scalar curvature metric with constant mean curvature on the boundary\n. In\n2002\nhe published the book\nTopics in PDE's and differential geometry\nwhich was highly praised by Emmanuel Hebey in the review\n[\n6\n]\n:-\nThis is a very nice short book in which the author examines several topics on partial differential equations and their applications to Riemannian geometry. The book is very well written and contains very elegant mathematics. Chapter one discusses the Laplacian comparison theorem. Chapter two discusses the\nSteklov\nproblem. Chapter three discusses conformal deformation of metrics. I strongly recommend this book, which I like very much.\nWe have looked at Escobar's outstanding research but we should note that he was also a charismatic teacher. Maria Antonia Garcés was a colleague of Escobar at Cornell University and wrote in an obituary which was published in the Cali newspaper\nEl Pais\n:-\n[\nIn Cornell\n]\nChepe knew how to create a special environment for Latin-American graduate students, mainly Colombians and Brazilians, who began to arrive at Cornell attracted by his brilliance and the things he published. As a teacher, Chepe's charisma, became proverbial in the Cornell Mathematics Department. Bringing down the barriers that separated great scientists from their students, Chepe built all environment of inspiration and camaraderie with his students, even the ones who were not doing their theses with him. He accomplished this by inviting them to his home and making them part of his family life.\nThe authors of\n[\n15\n]\nwrite about Escobar's political views:-\nAs one who had come to the United States as a graduate student, Chepe had strong opinions about the treatment of international graduate students and the problems they had to overcome, often pointing out that seemingly minor changes in the local rules governing international applicants have serious consequences. He was a consistent advocate for students who were less than privileged and was particularly outspoken about those who made their careers pretending to be their advocates while often doing more harm than good. And quietly, he held strong opinions about the effects of United States policies on Latin America. Once, after returning from a visit to his family, he volunteered that things were much better in Colombia now that the United States was more concerned about the situation in Venezuela.\nAt the Universidad del Valle in Cali, Colombia, Escobar had met the mathematician María Mercedes Franco. His marriage to his first wife María Elena Jimenez ended in divorce and he married María Mercedes Franco. The book\n[\n5\n]\n, which is written by her, contains the following biography:-\nMaría Mercedes Franco Tello was born\n1\nOctober\n1970\nin Cali, Colombia , South America, the third child of Justo Pastor Franco Franco and Jeny Tello Mera. Her father died on\n30\nDecember\n1976\n. Blessed with an extraordinary mother, wise twin brothers, a lively extended family\n(\nfrom her mother's side\n)\n, the colourful people of el barrio San Juan Bosco in Cali, and the invaluable  richness that only modest life can offer, Mercedes had a very happy and intense childhood and adolescence. Her interest in mathematics grew slowly and mainly because of her teaching experiences with high school classmates and students from other schools. She started her formal studies in Mathematics at the Universidad del Valle in Cali, Colombia, where she also worked as a computer lab assistant, mathematics tutor, and teaching assistant. Aside from the college life, she also worked as a mathematics high school teacher. She moved to the United States in\n1994\nto join her partner and future husband José Fernando Escobar Velásquez.\nIn early\n2000\n, Escobar visited the Instituto de Matemática Pura e Aplicada in Rio de Janeiro where he was beginning a sabbatical year. While there, he was diagnosed with stomach cancer. He went to New York where he had a major operation. By August\n2000\nhe was well enough to return to his teaching and research at Cornell. He published further major papers:\nUniqueness and non-uniqueness of metrics with prescribed scalar and mean curvature on compact manifolds with boundary\n(2003)\n;\nA new\n3\n-dimensional curvature integral formula for PL-manifolds of non-positive curvature\n(2003)\n; and\nConformal metrics on the ball with zero scalar curvature and prescribed mean curvature on the boundary\n(2004)\n. By the time this\n2004\npaper was published in the June part of the\nJournal of Functional Analysis\n, Escobar had already died. The paper, written jointly with Gonzalo García who had been a Ph.D. student of Escobar's graduating in\n1999\n, has the following abstract:-\nThis paper considers the prescribed zero scalar curvature and mean curvature problem on the n-dimensional Euclidean ball for n ≥\n3\n. We consider the limits of solutions of the regularisation obtained by decreasing the critical exponent. We characterise those subcritical solutions which blow-up at the least possible energy level, determining the points at which they can concentrate, and their\nMorse\nindices. We show that when n =\n3\nthis is the only blow-up which can occur for solutions. We use this in combination with the\nMorse\ninequalities for the subcritical problem to obtain a general existence theorem for the prescribed zero scalar curvature and mean curvature on the three-dimensional Euclidean ball. In the higher-dimensional case n ≥\n4\n, we give conditions on the function h to guarantee there is only one simple blow-up point.\nIt was in the second semester of\n2003\nthat Escobar began to feel his health deteriorating again. He returned to Cali, Colombia, in November\n2003\n, realising that he did not have long left and he wanted to be back in the home town he loved. His forty-ninth birthday was on\n20\nDecember\n2003\nand he died two weeks later.\nThe article\n[\n11\n]\ncontains Jaime Lesmes' speech at the opening ceremony of the conference held in memory of Escobar. He said:-\nI was bound up with Chepe by a friendship that goes back in time over\n26\nyears, since I had the pleasure of being his teacher at the Instituto de Matematica Pura e Aplicada\n(\nIMPA\n)\nin Rio de Janeiro. This occasion allows me to express my great admiration and appreciation for his outstanding mathematical capacity, for his work as a scientist, as a teacher and guide, and for his honesty and remarkable human qualities. Admiration and appreciation which was always felt by these who knew Chepe. I would like to point out very specially the gratitude and recognition of the Colombian mathematical community for his untiring determination to be helpful, and his extensive work and decisive contributions to the development and rising of the mathematical level in Colombia. Chepe loved Colombia, his country and our country, and throughout his life he maintained close ties with it.\nIn\n2005\n, Escobar's wife María Mercedes Franco published the book\nExistence and Regularity of Minimizers for a One-dimensional Elasticity Problem Without Convexity\n. She dedicated the work to Chepe:-\nTo my late husband José Fernando \"Chepe\" Escobar. For ten years we shared life, family, friends, joys, griefs, and dreams. We shared work and leisure times. We danced, drank wine, cooked, travelled, we were life partners and went through life events that ranged from absolutely joyous to extremely painful. Without a doubt, ours was an extraordinary journey and I will forever cherish the memories and value the lessons. Through him I got to meet and enjoyed many wonderful people, amongst them the members of the Escobar Velásquez family and mathematicians Alexander Freire, Jaime Lesmes, Sumio Yamada, Jia-ping Wang, Gonzalo García, Juan Carlos Uribe, Jean Carlos Cortissoz, Nelia Charalambous, Henrique Araújo, Fernando Codá Márques, Fernando Schwartz.\nIn\n2017\nthe\nColombian Mathematical Society\ninstituted the \"José Fernando Escobar\" Prize for Research in Mathematics.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}