{
  "nome_completo": "Joseph Diez Gergonne",
  "nome_curto": "Joseph Gergonne",
  "ano_nascimento": "1771",
  "ano_morte": "1859",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gergonne/",
  "lugar_nascimento": "Nancy, France",
  "lugar_morte": "Montpellier, France",
  "biografia": "Joseph Gergonne\n's father was an architect and also a painter. However, he died when Joseph was twelve years old. Joseph was educated at the Collège de Nancy which was a religious establishment. After leaving the Collège he did some private tutoring but, like everyone else in France at this time, he was caught up in the events surrounding the French Revolution.\nIn\n1791\nthe French Assembly was at a difficult stage trying to stabilise the country following the French Revolution. The Assembly was not helped by the King, Louis XVI, attempting to flee the country in June of that year. After the King was returned to Paris, the Assembly reinforced the frontiers of France by calling for\n100\n,\n000\nvolunteers from the National Guard. Gergonne gave his support becoming a captain in the National Guard.\nIn April\n1792\nFrance went to war against Austria and Prussia. The French attack was quickly halted and then Prussian forces invaded France. The Assembly called for\n100\n,\n000\nmilitary volunteers and Gergonne joined the French army being assembled to defend Paris against the Prussians. On\n20\nSeptember\n1792\nKellermann led the French forces at Valmy with Gergonne in his army. The French defeated the Prussians in an artillery duel and, following this, the Austrian and Prussian armies retreated from France.\nFollowing this great French victory, Gergonne went to Paris where he became a secretary to his uncle. It was a time of much military action, however, and Austria and Prussia were not going to simply accept the defeat at Valmy as the end of the war. By\n1793\nthey were joined by Spain, Piedmont, and Britain. The French forces were soon in trouble, fighting on many different fronts and being defeated everywhere. Gergonne returned to the French army, this time as secretary to the general staff of the Moselle army.\nGergonne spent a month at the Châlons artillery school in\n1794\nand after this he was commissioned as a lieutenant. With Spain having declared war on France in\n1793\n, France sent forces to attack Spain in\n1794\n. Gergonne was attached to these forces which entered Spain and laid siege to the town of Figueras capturing it.\nIn\n1795\nFrederick William II of Prussia made a separate treaty, the Treaty of Basel, with the French and withdrew from the coalition against France. At this stage Gergonne was sent with his regiment to Nimes in southern France. In that city the École Centrale had been set up shortly before and Gergonne was appointed to the chair of transcendental mathematics.\nThis was not the end of problems in French politics, with the great military campaigns of Napoleon Bonaparte over the following years. Gergonne, however, settled down at this point. He married and began to concentrate on mathematics. His career was much influenced by\nMonge\nwho, by this time, was Director of the École Polytechnique in Paris.\nFinding problems getting his mathematics papers published, Gergonne established his own mathematics journal, the first part appearing in\n1810\n. The Journal was officially called the\nAnnales de mathématiques pures et appliquées\nⓉ\n(\nAnnals of Pure and Applied Mathematics\n)\nbut became known as\nAnnales de Gergonne\n. Gergonne's mathematical interests were in geometry so it is not surprising that it was this topic which figured most prominently in his journal. In fact many famous mathematicians published in the twenty-one volumes of the\nAnnales de Gergonne\nwhich appeared during a period of twenty-two years. In addition to Gergonne himself\n(\nwho published around\n200\narticles\n)\n,\nPoncelet\n,\nServois\n,\nBobillier\n,\nSteiner\n,\nPlücker\n,\nChasles\n,\nBrianchon\n,\nDupin\n,\nLamé\n,\nGalois\nand many others had papers appear in the Journal.\nIn\n1813\nGergonne wrote a prize winning essay for the Bordeaux Academy\nMethods of synthesis and analysis in mathematics\n. The essay has never been published but a summary of it appears in\n[\n5\n]\n. The essay tells us a lot about Gergonne's mathematical ideas. Despite the title of the essay, he suggests that the terms \"analysis\" and \"synthesis\" should not be used since everyone uses them with a different meaning. Perhaps surprisingly, since Gergonne was himself a geometer, he suggests that algebra is a more important topic than geometry. In a remarkable piece of foresight, he saw a time in the future when quasi-mechanical methods would be used to discover new results.\nWe will examine Gergonne's contributions to geometry later in this article, but for the moment it is worth noting that he did publish on other topics. For example in\n1815\nhe published\nApplication de la méthode des moindre quarres a l'interpolation des suites\nin his own journal. This paper examines the problem of observing values of a response function which depends upon a single independent variable. Gergonne looked at how to estimate the values of the response function, and of its derivatives, at a point when there are random errors in the observed values.\nGergonne was appointed to the chair of astronomy at the University of Montpellier in\n1816\n. There is a nice story told by\nStruik\nin\n[\n1\n]\nwhere he writes:-\n... during the July Revolution of\n[1830]\n, when rebellious students began to whistle in his class, he regained their sympathy by beginning to lecture on the acoustics of the whistle.\nIt was in\n1830\nthat Gergonne became rector of the University of Montpellier. He decided to end publication of his journal at this time although the monthly parts continued to appear until\n1832\n. Gergonne retired in\n1844\nat the age of\n73\n.\nGergonne provided an elegant solution to the Problem of\nApollonius\nin\n1816\n. This problem is to find a circle which touches three given circles. Gergonne introduced the word polar and the principle of duality in\nprojective geometry\nwas one of his main contributions. Gergonne's first contributions to duality appear in a series of papers beginning in\n1810\n. He noticed the fact that certain forms of geometry yielded theorems which appeared in related pairs, and this led him to a more detailed analysis of why this was so. Then\n[\n1\n]\n:-\n... in three articles in the Annales\n[1824\n-\n27]\n, Gergonne\n[\ngave\n]\nthe general principle that every theorem in the plane, connecting points and lines, corresponds to another theorem in which points and lines are interchanged, provided no metrical relations are involved.\nWe have already illustrated Gergonne's interest in the philosophy of mathematics with a description of his unpublished essay on the topic in\n1813\n. He sprinkled charming philosophical comments around his papers.\nChasles\n, in\nAperçu historique ...\nⓉ\n(\nHistorical overview ...\n)\n, notes the comment by Gergonne:-\nIt is not possible to feel satisfied at having said the last word about some theory as long as it cannot be explained in a few words to any passer-by encountered in the street.\nGiven this criterion, I doubt whether any theory has had the last word said about it!",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}