{
  "nome_completo": "Joseph Jean Baptiste Neuberg",
  "nome_curto": "Joseph Neuberg",
  "ano_nascimento": "1840",
  "ano_morte": "1926",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neuberg/",
  "lugar_nascimento": "Luxembourg City, Luxembourg",
  "lugar_morte": "Liège, Belgium",
  "biografia": "Joseph Neuberg\n's father was a merchant from an old Luxembourg family of farmers, several generations having lived in the town of Mersch, about\n18\nkm north of Luxembourg City. Joseph's mother came from Schifflange, about\n12\nkm south west of Luxembourg City. He was the second of his parents' seven children, having one younger brother and five sisters. When he reached school age his parents sent him to primary school having decided that he would follow in his father's footsteps and make a career in commerce. However, he made rapid progress at school, having a remarkable memory and intelligence. When he left school after four years of study, he was certain that he wanted to continue with his education rather than become an apprentice learning a trade. His parents were quite determined that their son should continue to follow the plans that they had made for his future and it was only through considerable determination by the young Neuberg that, one year after he left the primary school, he was able to enter the Athénée of Luxembourg in October\n1853\n.\nAt the Athénée de Luxembourg he was able to start his studies without taking the preparatory class. His work was outstanding, and he was placed first in his final years at the school. He took his maturity examinations in July\n1859\nand produced a performance that was equally brilliant in all the subjects in which he was examined. An all-round talent, he showed the same outstanding abilities in both arts and science subjects. After completing his school education in Luxembourg, Neuberg went to Belgium to undertake his university studies. In Brussels in October\n1859\nhe took the examinations which were necessary to become a university student, and then he went to Ghent where he took the entrance examinations for the École Normale des Sciences which was part of the Faculty of Sciences at the University of Ghent. Here he was one of a small number of students so they received an excellent education preparing them to become teachers in secondary schools or colleges. He graduated in July\n1862\nand so did not meet his future collaborator\nPaul Mansion\nwho began his studies to the École Normale des Sciences three months after Neuberg graduated.\nThe first part of Neuberg's career was spent in various colleges. He was a temporary teacher of mathematics at the École Normale de Nivelle from November\n1862\nto October\n1865\n, then a teacher at the Athénée Royal d'Arlon from October\n1865\nto December\n1867\n. It was while he was at the Athénée Royal d'Arlon that, in\n1866\n, he married Fanny Reuter from Luxembourg. Joseph and Fanny Neuberg had two daughters, Louise and Maria and a son who died very young. Louise married M Ries, who was a director of Luxembourg railways, while Maria was very religious and entered the Sisters of Notre-Dame. Neuberg was a teacher at the Athénée Royal and the École Normale at Bruges from January\n1868\nto April\n1878\n. His wife Fanny died in\n1877\nand, in the following year, he married Maria de Gruytters; they had one daughter\n(1880\n-\n1914)\nand one son\n(1884\n-\n1920)\nwho died fighting with the Belgium army during World War I. These tragedies were not the only ones to bring deep sadness to Neuberg's life for Maria, his second wife, died in\n1904\n.\nAfter leaving Bruges in\n1878\n, Neuberg was appointed as a teacher at the Athénée Royal of Liège, holding this position from May\n1878\nto December\n1884\n. In parallel with this position, he was also a lecturer at the École des Mines from October\n1878\nto October\n1880\n, then he was promoted to professor at this college holding this position from October\n1880\nto October\n1884\n. After nearly twenty years of wanting to become a university teacher, during which time he had produced a huge research output, Neuberg was appointed as an extraordinary professor at the University of Liège in\n1884\nand was promoted to ordinary professor there in\n1887\n, holding this chair until he retired on\n30\nOctober\n1910\n. Although when he was appointed to the university post he resigned from his position at the Athénée, he retained his professorship at the École des Mines until October\n1911\n. At the University of Liège he taught analysis, higher algebra, descriptive geometry,\nprojective geometry\n, analytic geometry, and the foundations of mathematics. At the École des Mine he taught higher algebra, analytic geometry and infinitesimal analysis. After he was promoted to professor he also gave a course on mathematical methods for students who were studying for a doctorate in mathematics and physics. He was made professor emeritus by the University on\n27\nDecember\n1911\n.\nAdolphe Quetelet\nand Jean-Guillaume Garnier\n(1766\n-\n1840)\n, the professor of astronomy and higher mathematics at Ghent, edited the Belgium publication\nCorrespondance mathématique et physique\n. In\n1874\nNeuberg, together with\nEugène Catalan\nand\nPaul Mansion\n, founded a journal\nNouvelle correspondance mathématique\nnamed by Neuberg to honour the earlier\nCorrespondance mathématique et physique\n. His idea was to follow the pattern set by the French journal\nNouvelles Annales de Mathématiques\nwhich followed the\nAnnales de Mathématiques.\nThe\nNouvelle correspondance mathématique\nfounded by\nMansion\n,\nCatalan\nand Neuberg was published between\n1874\nand\n1880\n. After this\nCatalan\nencouraged\nMansion\nand Neuberg to collaborate in publishing a new journal and, indeed, they did precisely this, publishing\nMathesis\nfrom\n1881\nonwards. The difficulties of continuing a normal life during World War I meant that publication of\nMathesis\nhad to stop in\n1915\nand, since\nMansion\ndied in\n1919\n, when\nMathesis\nrestarted publication in\n1922\nit was jointly edited by Neuberg together with Ad Mineur.\nNeuberg worked on the geometry of the triangle, showing great ingenuity, discovering many interesting new details but developing no large new theory. Pelseneer writes in\n[\n1\n]\n:-\nThe considerable body of his work is scattered among a large number of articles for journals; in it the influence of\nA Möbius\nis clear. In general, his contribution to mathematics lies in the discovery of new details, rather than in any large contribution to the development of his subject.\nTogether with\nHenri Brocard\nand\nÉmile Lemoine\n, he is considered as the creators of the geometry of the triangle and of the tetrahedron. He was also involved in the study of various algebraic surfaces, including the cyclide of\nDupin\n, geometry of ruled surfaces and curves arising from linkages. In the early part of his career he published papers in the\nNouvelles Annales de Mathématiques\non inscribed and circumscribed conics, as well as on the geometry of the triangle. Examples of these papers are\nDémonstration de quelques théorèmes de M Faure\nⓉ\n(\nDemonstration of some theorems of Faure\n)\n(1868)\n,\nTriangles et coniques combinés\nⓉ\n(\nTriangles and conics combined\n)\n(1870)\nand\nThéorie des indices des points, des droites et des plans par rapport à une surface du second ordre\nⓉ\n(\nTheory of indices of points, lines and planes with respect to a surface of the second order\n)\n(1870)\n. During the years that\nNouvelle correspondance mathématique\nappeared\n(1874\n-\n1880)\n, Neuberg published\n24\npapers in the journal such as\nSur les polygones circonscrits à une conique et inscrits à une seconde conique\nⓉ\n(\nOn polygons circumscribed to a conic and enscribed in a second conical\n)\n,\nQuelques propriétés du triangle\n,\nSur les triangles homologiques\nⓉ\n(\nSome properties of the triangle, On homological triangles\n)\n, and\nSur les points de Brocard\nⓉ\n(\n, On the Brocard points\n)\n. In\nMathesis\nhe published well over\n100\npapers as well as contributing a wide variety of notes and questions. He published three memoirs:\nÉtudes sur les coordonnées tétraédriques\nⓉ\n(\nStudies on  tetrahedral coordinates\n)\n;\nMémoire sur le tétraèdre\nⓉ\n(\nMemoir on the tetrahedron\n)\n; and\nSur les projections et contre-projections d'un triangle fixe et sur le système de trois figures semblables\nⓉ\n(\nOn contra-projections and projections of a fixed triangle and the system of three similar figures\n)\n. In the year he retired,\n1911\n, he published the interesting historical work\nVie et oeuvre de Grégoire de Saint-Vincent\nⓉ\n(\nThe life and work of Gregory Saint-Vincent\n)\nabout the\n17\nth\ncentury Belgium mathematician\nGregory Saint-Vincent\nwho spent much of his career teaching in Ghent. Certainly he did not lessen his contributions to mathematics following his retirement and he continued to publish papers and undertake editorial work for\nMathesis\n.\nAd Mineur, who edited 'Mathesis' with Neuberg after it restarted publication in\n1922\n, wrote about Neuberg's last days in\n[\n6\n]\n:-\nTowards the end of December\n1925\nhe suffered from what he described as a bad cold but what was actually a severe dose of bronchitis. But this had not prevented him from working, and though his letters had been less frequent, I had learned of his illness at the same time as his recovery, for he had found it useful to make me aware of the risk having got through it safely. I did not fail to congratulate him on his recovery and to add my customary good wishes for the new year, one to celebrate the fiftieth anniversary of 'Mathesis' with him. He replied that he felt that his recovery was more apparent than real and that he felt too old to realise the fulfilment of my wish, adding that I would celebrate alone the fiftieth anniversary of 'Mathesis'. Alas, it was so, he should have been celebrating the fiftieth anniversary of the founding of the 'Mathesis' last January, but his memory and that of Mansion meant that I had to be alone, as he had predicted, to celebrate this anniversary, preferring to wait until the fiftieth volume of 'Mathesis' to remember its foundation.\nAs a lecturer Neuberg had a high reputation, as\nLucien Godeaux\nrecalls in\n[\n4\n]\n:-\nA teacher with remarkable clarity, Neuberg was total dedicated to his students. Despite heavy teaching loads, he organised exercise sessions for students of the Physical Sciences and Mathematics, thus filling a serious gap in the programmes. He published his lessons on Infinitesimal Analysis, on Higher Algebra and on Analytic Geometry; these works were a great success.\nAlthough he was a citizen of Luxembourg, Neuberg took Belgium nationality in\n1866\nand was elected a corresponding member of the\nRoyal Belgium  Academy of Sciences\nin\n1891\nand a full member in\n1897\n. In fact he achieved the honour of being elected as director of the Sciences Section of the Academy in\n1911\nafter he retired from his chair at Liège. Neuberg's life and work are discussed in\n[\n6\n]\nwhere the many honours that he received are listed. He was an honorary member of the Société des Sciences of Luxembourg, from July\n1870\n; a member of the Royal Society of Sciences of Liège, from\n1880\n; a member of the French Association for the Advancement of Science, from\n1885\n; a member of the\nFrench Mathematical Society\n, from\n1886\n; an honorary foreign member of the Mathematical Society of Amsterdam, from\n1888\n; a corresponding member of the Institute of Coimbre, from\n1906\n; a founder member of the\nBelgium Mathematical Society\n, from\n1921\n; Commander of the Crown, from\n12\nMay\n1902\n; Commander of the Order of the Oak Crown presented by the king of the Netherlands and the Grand Duke of Luxembourg, from\n9\nNovember\n1920\n; Commander of the Order of Leopold which is the highest order of Belgium named in honour of King Leopold I, from\n9\nApril\n1921\n; and he received the commemorative medal of Leopold II on\n16\nFebruary\n1906\n, and the Civil Cross First Class on\n11\nJanuary\n1899\n.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}