{
  "nome_completo": "Joseph Saurin",
  "nome_curto": "Joseph Saurin",
  "ano_nascimento": "1659",
  "ano_morte": "1737",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Saurin/",
  "lugar_nascimento": "Courthézon, Vaucluse, France",
  "lugar_morte": "Paris, France",
  "biografia": "Joseph Saurin\nwas educated at home, being brought up as a Calvinist by his father, Pierre Saurin, who was a Calvinist minister. Joseph was the youngest of his parents three children, who were all boys. His brother, Élie Saurin, went on to become a famous Protestant theologian. Pierre Saurin was the only tutor for all three of his sons and he wanted them all to enter the ministry. He taught them to read and write and then took them on to more advanced topics eventually teaching them theology and Hebrew.\nSaurin entered the Calvinist ministry as a curate in Eure in\n1684\nbut was soon in trouble for his outspoken views which he delivered in sermons from the pulpit. He was forced to leave France and went first to Geneva in Switzerland. He then became a curate at Bercher, Yverdon. However, although he established himself in this position, he continued to be too outspoken for his own good and, in\n1685\n, refused, despite strong pressure being exerted on him, to sign the Consensus of Geneva. This document had been drawn up by John Calvin in\n1552\nin an attempt to unite the Swiss Reformed churches with regard to the doctrine of predestination. This had become a fundamental part of the Calvinist belief but created divisions within the Protestant Churches. Saurin, always someone with strong opinions of his own, did not accept the doctrine of predestination as presented in the Consensus.\nOn\n18\nOctober\n1685\n, Louis XIV had revoked the Edict of Nantes and deprived the French Protestants of all religious and civil liberties. This now put Saurin in a very difficult position, unable to return to France as a Protestant minister.\nFontenelle\nwrites in\n[\n4\n]\nthat of the two systems of religion, he found one too severe, the other too soft. He went to Holland where he had discussions with many elders regarding his religious problems.\nSaurin had married a daughter of the noble family de Crouzas in Switzerland; they had at least one son Bernard-Joseph who became a poet and writer of plays. Saurin now, however, found himself in difficulties since in October\n1688\na French army marched into the Palatinate and a war had begun. However he was able to go to France to discuss his religious problems with the Roman Catholic Bishop Bossuet and, on\n21\nSeptember\n1690\n, he converted to Roman Catholicism. He made the difficult return to Switzerland to be reunited with his wife, frightened of religious persecution after his religious conversion. After some adventures\n(\nrecounted in\n[\n4\n]\n)\nhe was able to return to France with his wife.\nBack in Paris in\n1690\nhe had to seek a new career and he felt that it was either to be mathematics or the legal profession. Eventually he decided on mathematics and he began first to learn the subject and then to teach it. He became friends with\nde L'Hôpital\n,\nMalebranche\nand\nVarignon\nbut, by\n1702\n, he was in dispute with\nRolle\nover the calculus. This came about because of his role as mathematics editor of the\nJournal des Sçavants\n.  He appealed to the\nAcadémie Royal des Sciences\nbut, although Saurin was correct, they had no wish to come out against Rolle who was a member. Perhaps to be diplomatic, Saurin was elected to the\nAcadémie Royal des Sciences\nin\n1707\n.\nHe spent several months in jail for writing libellous poems about Rousseau. However on\n7\nApril\n1712\nhe was exonerated by the Parliament and Rousseau was sent into exile. Then he retired to spend the rest of his life working on mathematics.\nSaurin made contributions to the calculus, wrote on\nJacob Bernoulli\n's problem of quickest descent and\nHuygens\n' theory of the pendulum. Mahoney writes\n[\n1\n]\n:-\nSaurin made no original contributions to mathematics. Rather, firmly committed to the new infinitesimal calculus, he explored the limits and possibilities of its methods and defended it against criticism based on lack of understanding.\nRolle\n, for example, assumed that the new method of tangents could not handle singularities of multivalued curves where dy/dy took the form\n0\n/\n0\n. In reply\n[\nRéponse à écrit de M Rolle de l'Académie Royale des Sciences inséré dans le Journal du\n13\nAvril\n1702\n, sous le titre de Règles et Remarques pour le Problème général des Tangentes par M Saurin\n(1702)\n, Remarques sur les courbes des deux premiers exemples proposés par M Rolle dans le Journal du jeudi\n13\nAvril\n1702\n(1703)\n, and Remarques sur un cas singulier du problème général des tangentes\n(1716)]\n, Saurin explicated the nature and treatment of such indeterminate expressions on the basis of\nde L'Hôpital\n's theorem ...\nHis contributions to the problem of curves of quickest descent amount first to solving the original problem and then to solving a generalisation. His two papers on this topic both appeared in\n1709\n, the first being\nSolutions et analyses de quelques problème appartenants aux nouvelles méthodes\n, and the second\nSolution générale du problème\n.... Other contributions by Saurin include\nManière aisée de démontrer l'égalité des temps dans les chutes d'un corps tombant par une cycloude\n...\n(1703)\nin which he gave proofs of\nHuygens\n' theorems on centrifugal force and the cycloidal path. He defended\nHuygens\n' theory of the pendulum after it was attacked by le Chevalier de Liouville in\néclaircissement sur une difficulté proposé aux mathématiciens par M le Chevalier de Liouville\n(1722)\n. In\n1709\nhe proposed a modification of\nDescartes\n' vortex theory of gravity in\nExamen d'une difficulté considérable proposée par M Huygens contre le système cartésien sur la cause de la pesanteur\n.\nJohann Bernoulli\nconsidered it the best theory of gravity so far proposed and, as Aiton points out in\n[\n2\n]\n, Saurin could have brought together the ideas of\nNewton\nand\nDescartes\nwith his proposed theory. He did not go down that road, however, choosing to attack\nNewton\n's ideas as being a return to ancient style philosophies.\nIt is clear from the biographical details that we have related above that Saurin fell out with many people around him. In fact\nFontenelle\n[\n4\n]\nsays that he had few friends other than\nde L'Hôpital\nand\nMalebranche\n, and that he adopted the somewhat strange working routine of sleeping in the day and doing mathematics throughout the night. He died of lethargic fever at the age of\n78\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}