{
  "nome_completo": "Joseph Bishop Keller",
  "nome_curto": "Joseph Keller",
  "ano_nascimento": "1923",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keller_Joseph/",
  "lugar_nascimento": "Paterson, New Jersey, USA",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Joseph Keller\nwas the son of Isaac Keller and Sally Bishop. He attended East Side High School in Paterson, New Jersey, where he was taught mathematics by several excellent teachers. After graduating from the High School, he entered New York University intending to major in mathematics. During his first year of study he took both mathematics and physics courses and enjoyed physics so much that he decided to change to major in physics. However he majored in both mathematics and physics for his B.A. which he received in\n1943\n. He, along with a friend\n[\n3\n]\n:-\n... attended\nCourant\n's initial lecture on 'Methods of Mathematical Physics'. At the end of the lecture we went up and told him we were undergraduate students, and we asked, \"Can we sit in on this course?\" He said, \"No, it's absolutely not allowed. However, if you sit in the front row there, maybe I won't see you. But just because I can't see you doesn't mean you can't ask questions.\" So we did attend the course, and obviously that was what he wanted, but he told us in that funny way to make evident the foolishness of the university rules.\nAfter graduating, Keller was appointed as an Instructor in Physics at Princeton in July\n1943\n. Of course,\n1943\nwas in the middle of World War II, so in\n1943\n-\n44\nKeller taught courses at Princeton put on to train engineers serving in the military. He attended graduate mathematics and physics courses given by a number of eminent mathematicians, for example\nSolomon Lefschetz\n,\nAlbert Tucker\n,\nAlonzo Church\n, Frederic Bohnenblust,\nClaude Chevalley\nand\nWolfgang Pauli\n.\nAfter Keller had been at Princeton for a few months the training courses for engineers were discontinued since it was realised that the war would be over before these men had completed their training. His position at Princeton ended in February\n1944\nand Keller then had to find another role in which to serve. The American Institute of Physics sent him to Columbia University where he became a research assistant in March\n1944\n. In New York, he worked for the Office of Scientific Research and Development of the Division of War Research. His office was in the Empire State Building and the work involved submarine detection\n[\n3\n]\n:-\nWe worked there on the following kind of question: How much sound is reflected back from a submarine? ... The problem was to calculate how the waves traveled through the water, spread out, became weaker, hit the object, and then how much was scattered back, and what the strength of the signal would be when it got back to the receiving sonar. We wanted to know, for example, at what range would it be possible to detect a submarine, and what was the best frequency to use? The projector sent out a beam, and the beam spread out, and if you didn't detect anything, then you would change direction and do it again. How much should you move each time, through what angle? How long should you wait for the signal to come back? How deep is the submarine, and should you look down and up?\nNot only did he work on theoretical aspects of the research but he was also involved in practical experiments at a laboratory in Mountain Lakes, New Jersey. When the war ended, Keller returned to his academic studies in October\n1945\nbut his research continued to be closely linked to the work he had been carrying out for the Division of War Research. He was awarded an M.S. by New York University in\n1946\nand continued to work towards his doctorate supervised by Henry Primakoff. However, Primakoff was appointed to Washington University, St Louis in\n1946\nand so for the final part of Keller's research he was nominally advised by\nRichard Courant\n. Keller was awarded a Ph.D. in\n1948\nfor his thesis\nReflection and Transmission of Electromagnetic Waves by Thin Curved Shells\n.\nA number of Keller's publications had appeared in print before the award of his doctorate. The paper\nDiffraction of sound around a circular disk\n(1947)\nwas written jointly with Henry Primakoff, Martin Klein and E L Carstensen. Another paper\nReflection and transmission of sound by thin curved shells\n(1947)\nwas a joint work of Keller with his research advisor Henry Primakoff. Albert Heins writes:-\nThe authors discuss the reflection and transmission properties of thin curved shells by sound waves. First an inhomogeneous\nintegral equation\nis derived for the sound field in an infinite medium containing a thin curved shell of different material. By appropriate approximations, the solution of the integral equation is reduced to the evaluation of a surface integral. This surface integral is similar to one obtained from the usual\nKirchhoff\ndiffraction theory. The integral is evaluated approximately and provides a basis for calculating the various physical parameters.\nIn\n1948\nKeller published a paper\nReflection and transmission of sound by a spherical shell\nwritten jointly with his younger brother Herbert Keller. Albert Heins writes:-\nA periodic point source is at the center of a sphere. This sphere is surrounded by a second sphere of different density and radius. The authors solve the problem of finding the reflection and transmission of sound in these three media\n(\ni.e., inside the first sphere, the spherical shell and exterior to the second sphere\n)\n. All of these regions have different radii and densities. ...\nKeller's first two single-author papers appeared in\n1948\n:\nOn the solution of the Boltzmann equation for rarefied gases\n; and\nThe solitary wave and periodic waves in shallow water\n.\nRichard Courant\nstarted the task of building up what is now named the\nCourant\nInstitute of Mathematical Sciences at New York University in\n1935\n. Then it was the Department of Mathematics but it was renamed the Institute for Mathematics and Mechanics in\n1946\n. Projects begun at this time led to the setting up of the Institute's Division of Wave Propagation and Applied Mathematics. Keller was appointed as an Assistant in the\nCourant\nInstitute of Mathematical Sciences in\n1948\n. He was promoted, first to Associate Professor of Mathematics, and then to Full Professor of Mathematics. He served as Director of the Division of Wave Propagation and Applied Mathematics from\n1967\nto\n1979\n. He was also Chairman of the Department of Mathematics, University College, School of Engineering and Science, and the Graduate School of Engineering and Science, New York University from\n1967\nto\n1973\n. On\n29\nAugust\n1963\n, Keller married Evelyn Fox; they had two children Jeffrey M Keller and Sarah N Keller. The Kellers were divorced on\n17\nNovember\n1976\n.\nWhile holding his chair at New York University, Keller spent time at Stanford University, being Visiting Professor of Mathematics there in\n1969\n-\n1970\nand again in\n1976\n-\n1978\n. In\n1978\nhe accepted the position of Lewis M Terman Professor of Mathematics and Mechanical Engineering at Stanford University, a role he continued to hold until\n1993\nwhen he became Professor Emeritus. He has been a research associate at the Woods Hole Oceanographic Institute since\n1969\n. He was also an Honorary Professor of Mathematical Sciences at the University of Cambridge during\n1989\n-\n93\n.\nKeller has made deep and important contributions to a wide range of areas of applied mathematics\n[\n4\n]\n:-\nKeller originated the Geometrical Theory of Diffraction to solve problems of wave propagation. The theory is an indispensable tool for engineers and scientists working on radar, the design of antennas and on high frequency systems in complicated environments. He also formulated methods to solve the problems of wave propagation through heterogeneous, turbulent, or random media in which fluctuations occur due to the irregular and fluctuating properties of the medium. Keller has worked extensively on problems related to national security, including sonar, underwater explosions, atmospheric explosions of hydrogen bombs, and A-bomb explosions on ships and submarines.\nHis achievements have been as a researcher and also an as expositor, and he has been honoured throughout his career for both. In fact the first major awards he received were for his outstanding writing. In\n1976\n, jointly with David W McLaughlin, he received the\nLester R Ford\nAward of the\nMathematical Association of America\nwhich recognises authors of articles of expository excellence published in\nThe American Mathematical Monthly\nor\nMathematics Magazine\n. The paper for which the prize was awarded was\nThe Feynman integral\n(1975)\n:-\nThe authors give an elementary introduction to the\nFeynman\nintegral and some of its physical applications. In particular, they present the definition of the integral given by E Nelson\n(1964)\n, and show that the integral does satisfy the corresponding appropriate\nSchrödinger\nequation.\nIn the following year Keller again received the\nLester R Ford\nAward, this time for his paper\nInverse problems\n(1976)\n. Clarence Ablow writes in a review:-\nTwo problems are inverses if the formulation of each involves all or part of the solution of the other. The direct problem of the pair has been extensively studied or has a solution readily obtained by standard methods. The author presents numerous examples from everyday discourse as well as more technical questions from potential and scattering theory to show that inverse problems are frequently presented as questions of data reduction. They can have no or only partly determined solutions even though the corresponding direct problems are well posed.\nThe\nAmerican Mathematical Society\nhonoured Keller by choosing him to be their\nGibbs\nLecturer in\n1977\n, and the\nSociety of Industrial and Applied Mechanics\nhonoured him as their\nvon Neumann\nLecturer in\n1983\n. He has won major awards such as the\nvon Karman\nPrize from the\nSociety of Industrial and Applied Mathematics\nin\n1979\n, the Eringen Medal from the Society of Engineering Sciences in\n1981\n, the Timoshenko Medal from the American Society of Mechanical Engineers in\n1984\n, and the National Medal of Science in\n1988\n. In\n1995\nhe received the\nNational Academy of Sciences\nAward in Applied Mathematics and Numerical Analysis. The citation states that Keller was given the awarded Award:-\n... for his seminal contributions to applied mathematics, with special reference to his geometrical theory of diffraction and his work on water-wave propagation.\nIn\n1996\nthe Frederic Esser Nemmers Prize in Mathematics from Northwestern University, Evanston, Illinois, was given to Keller who:-\n... is regarded by many as the world's most distinguished applied mathematician.\nHe received the Wolf Prize in Mathematics\n(\nshared with\nYakov G Sinai\n)\nin\n1997\n:-\n... his profound and innovative contributions, in particular to electromagnetic, optical, acoustic wave propagation and to fluid, solid, quantum and statistical mechanics.\nThe article\n[\n5\n]\nannouncing the award of the Wolf Prize gives an overview of his contributions:-\nKeller is a pre-eminent applied mathematician in the classical tradition. He has brought a deep understanding of physics and a superb skill at asymptotics to an astonishing range of problems. These include reflection, scattering, and diffraction of waves, whether acoustic, electromagnetic, elastic, or fluid. His outstanding contributions cover problems in mechanics, quantum mechanics, thermodynamics, and statistical mechanics, and include the so-called Keller-Maslov index, the Keller-Rubinov formula for forward scattering, and pioneering work on random media. He is really the model of what a mathematician interested in a wide variety of physical phenomena can and should be.\nIn\n2007\nthe International Congress on Industrial and Applied Mathematics awarded its\nLagrange\nPrize to Keller. His:-\n... profound contributions to applied mathematics have had great impact in science and engineering as well as in pure mathematics. He developed the geometrical theory of diffraction that provided the first systematic description of wave propagation around edges and corners of an obstacle. It has been widely used for radar reflection from targets, elastic wave scattering from defects in solids, acoustic wave propagation in the ocean radar, and many other fields. It also served as a starting point for development of the modern theory of linear partial differential equations\nThe article\n[\n1\n]\n(\nfrom which the citation is quoted\n)\ncontinues:-\nOther areas in which he has contributed include singular perturbation theory, bifurcation studies in partial differential equations, nonlinear geometrical optics and acoustics, inverse scattering, effective equations for composite media, biophysics, biomechanics, carcinogenesis, optimal design, hydrodynamic surface waves, transport theory, and waves in random media.\nKeller twice won an\nIg Nobel Prize\n; in\n1999\nfor calculating how to make a teapot spout that does not drip, and in\n2012\nfor analysing the motion of a runner's ponytail.\nFinally let us note that Keller gave as his hobbies hiking and skiing.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics"
  ]
}