{
  "nome_completo": "Joseph Privat de Molières",
  "nome_curto": "Joseph Privat de Molières",
  "ano_nascimento": "1677",
  "ano_morte": "1742",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Privat_de_Molieres/",
  "lugar_nascimento": "Tarascon, Bouches-du-Rhône, France",
  "lugar_morte": "Paris, France",
  "biografia": "Joseph Privat de Molières\n's parents were Charles Privat de Molières and Martine de Robins de Barantane. He was born into an aristocratic Provencal family, the second of his parents sons. He was given a good educations at schools run by the Congregation of the Oratory. The Congregation of the Oratory of Jesus and Mary Immaculate, often called the Oratorians, was a Roman Catholic sect founded by Pierre de Bérulle in\n1611\nand approved by the Pope in\n1613\n. It had a fine reputation for providing a good education with particular emphasis on the classical languages. Joseph studied at Oratorian schools in Aix, Marseilles, Arles and Angers. At the last of these schools he studied under\nCharles-René Reyneau\nfrom\n1698\nuntil\n1699\n. After the death of his elder brother, Joseph was expected to devote his life to running the affairs of his family. He chose, however, against his parents wishes, an ecclesiastical life and entered the Congregation of the Oratory in\n1699\n.\nHis first posts were teaching in schools belonging to the Congregation of the Oratory, first at Saumur, then at Juilly and finally at Soissons. However he had a deep love of science in general, and mathematics in particular, and in\n1704\nhe went to Paris to take up a more active scientific career. There he studied mathematics and physics with\nMalebranche\nuntil\n1715\n. In\n1723\nhe was appointed to a chair at the Collège Royal to succeed\nVarignon\n.\nHe argued against\nNewton\nand for\nDescartes\n' view of physics although he knew\nNewton\n's to be the more precise. Of course, although we now accept\nNewton\n's ideas of gravitation without much thought, it is clear if one thinks about it for a while that the idea of action at a distance through a vacuum is absurd. Many around this time voiced such an opinion\n(\nNewton\nhimself realised this was a weakness in his theories\n)\nbut where Privat de Molières differed from other critics of\nNewton\n's theory of gravitation is that he attempted to make a mathematically sound theory based on the idea of vortices. Understanding the accuracy of the theory of gravitation, Privat attempted to bring\nNewton\n's calculations into the vortex theory of matter of\nMalebranche\n. The problem was\nKepler\n's laws, easily explained by\nNewton\n, but the cause of real problems for\nDescartes\n' vortex theory of planetary motion. Nakata gives details of Privat's theory in\n[\n5\n]\n. In fact in a memoir written in\n1733\nPrivat criticised\nNewton\n's theories for being too accurate saying that physical phenomena did not have geometrical precision:-\nHowever it will happen that it is only approximately that the points of the vortex will have this force which depends on the square of the distance and thus the area they span will also be only approximately as the time; but this will simply be more in conformity with the astronomical observations; thus the mechanical forces of the vortex give us the astronomical laws as they are in effect with a better precision than the purely metaphysical forces of Newton which give those laws with too much geometrical precision.\nFontenelle\n, the secretary of the Academy of Sciences, agreed with Privat de Molières. He wrote in his annual report on the work of the Academy:-\nM l'Abbé de Molières astutely criticizes\nNewton\non his extreme precision; physical principles are not so precise when we come to apply them to phenomena.\nAlthough his arguments were very effective particularly as he was able to incorporate a theory of electrical and chemical phenomena within his little vortices theory, eventually Newtonian physics came to the fore in France.\nPrivat de Molières published\nLecons de mathematiques\nⓉ\n(\nLessons of Mathematics\n)\n(1726)\n, a work on the principles of algebra and calculus. His\nLecons de physique, contenant les éléments de la physique déterminés par les seules lois des méchaniques\nⓉ\n(\nPhysics Lessons, containing the physical elements determined by the laws of mechanical\n)\n(1734\n-\n1739)\n, was a four volume work based on his lectures at the Collège Royal and contains details of the mathematical theory of his elastic \"little vortices\". He also published a series of Memoirs of the Academy and in several articles in the\nJournal de Trevoux\n.\nPrivat de Molières was honoured by being elected to the\nAcademy of Sciences\nin\n1721\n, and became a Fellow of the\nRoyal Society of London\nin\n1729\n.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}