{
  "nome_completo": "Joseph Antoine Ferdinand Plateau",
  "nome_curto": "Joseph Plateau",
  "ano_nascimento": "1801",
  "ano_morte": "1883",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plateau/",
  "lugar_nascimento": "Brussels, French Empire (now Belgium)",
  "lugar_morte": "Ghent, Belgium",
  "biografia": "Joseph Plateau\n's father was an artistic man with a great talent for painting flowers. He wanted Joseph to follow an artistic career and his schooling was arranged with this aim. After excelling at primary school, Joseph was sent to the Academy of Fine Arts. However Joseph became an orphan at the age of fourteen when his father died, his mother having died one year earlier. A brother of Joseph's mother who was a lawyer, a M Thirion, took over bringing up Joseph and his two sisters. Joseph had a serious illness around this time and for a while could not attend the Academy. However, once he had recovered he resumed his course.\nAlthough the training at the Academy was mainly in the arts, Plateau's interests were in science. He was enthusiastic about physics and carried out experiments in the evenings with apparatus which he had constructed himself. These were not simply for his own amusement, for the young Plateau was putting on a show to entertain an audience. In this he combined showmanship with a display of dexterity and excellent understanding. Plateau entered the Athenaeum in Brussels in\n1817\nto complete his secondary education. There he was fortunate to be taught by\nAdolphe Quetelet\nwho was appointed to the chair of elementary mathematics at the Athenaeum in\n1819\n. A fellow pupil at the Athenaeum,\nPierre Verhulst\n, provided someone with whom Plateau could spend many hours in deep scientific discussions, while both were strongly encouraged by their teacher\nQuetelet\nwho became their friend. It was\nQuetelet\nwho arranged for Plateau and his friends to frequently visit the National Observatory which encouraged his interest in astronomy.\nIn\n1822\nPlateau graduated from the Athenaeum having achieved outstanding success. His tutor advised him to study literature and philosophy at the University of Liège with the aim of going on to study law. Of course his guardian was a lawyer so law was in some ways a natural choice. However, although Plateau had shown great ability in these subjects, they were not the ones which interested him. He felt he had no choice but to follow the advice and indeed obtained a bachelor's degree in literature and philosophy and then a bachelor's degree in law. He had already decided that he would complete this course but then register to study the subjects which he really loved. He did just that, studying courses in mathematics and physics at the University of Liège.\nPlateau now was responsible for providing for his sisters and he took this responsibility seriously. Rather than concentrate on working for a doctorate in mathematics and physics, he took a job as a secondary school teacher of mathematics  at the Athenaeum of Liège; he also acted as a tutor for his sister Joséphine. Despite having all these duties, Plateau was still able to write an outstanding doctoral dissertation in a period of two years and he was awarded a doctorate on\n3\nJune\n1829\n[\n4\n]\n:-\nHis thesis was a remarkable study of the properties of the impressions which light can exercise on the eye. Unfortunately, the same year\n[1829]\n, his ardour for experimentation pushed him to carry out a very dangerous experiment consisting in looking directly into the bright sun during approximately twenty-five seconds. A long time after that imprudence, his eyes were still irritated.\nHealth problems meant he was forced to resign from his teaching position at the Athenaeum in Liège and he moved to Brussels where he soon was given the position of professor in a College run by M Gaggia. An advantage of being in Brussels was that he could join the circle of young scientists who gathered round\nQuetelet\n. It was through\nQuetelet\n's influence that Plateau was offered the position of extraordinary professor of physics at the University of Ghent in\n1835\n. He was highly successful both as a university teacher, researcher and as a promoter of science. On\n27\nAugust\n1840\nhe married Augustine- Thérèse- Fanny Clavareau; they had two sons Félix and Ernest, and a daughter Alice. In fact\n1840\nwas important for another reason for Plateau, for in that year he first began experiments which would lead him to study minimal surfaces. We shall say more about this below.\nAlthough Plateau had carried out his experiment of staring at the sun in\n1829\n, he had retained reasonable vision until\n1841\n. In that year he began to suffer with inflammation of his eyes. At first he suffered from blurring of vision with many black spots floating about in front his sight. Treatment during the following two years was ineffective and by\n1843\nhe had become totally blind.\nFaraday\nlater wrote:-\n... although bodily Plateau remained plunged in the darkness of a sad profound night, the perspicacity of his mind, having become more intensive than ever, was to lead to the most brilliant discoveries and to conquer for Belgium science an immortal glory.\nDespite now being unable to teach because of his blindness, Plateau was made a full professor at the University of Ghent on\n29\nJune\n1844\n.\nPlateau's first major contributions were related to the work of his doctorate on perceptions of colour by the human eye. He published an important article on this topic in\n1828\nbefore submitting his doctoral dissertation. In\n1830\nhe made a remarkable discovery for which he should receive much more credit. He discovered that by observing a periodically moving object through a hole in a rotating disk, it was possible to make the object appear stationary by rotating the disk at a suitable speed. Of course this is the principle which underlies all viewing of moving pictures. This device was called the\nPhenakistiscope\n(\nwith various spellings\n)\nand can be regarded as one of the first forms of moving media entertainment. It is celebrated in the Google doodle at\nTHIS LINK\n.\nThe next work he published on the topic of vision related to the mechanism by which eye retains an impression of a coloured object in the complementary colour.\nHe is best remembered in mathematics, however, for\nPlateau Problems\n. The starting point for this investigation was in\n1840\nwhen a servant spilt oil into a container filled with a mixture of water and alcohol. Plateau noticed that the drops of oil formed into perfect spheres in the mixture. He then carried out a series of experiments repeating the original accident but also investigating the shape of the drops of oil when the mixture of water and alcohol is rotating. He later used a solution of soapy water and glycerine and dipped wire contours into it, noting that the surfaces formed were minimal surfaces. He did not have the mathematical skills to investigate the problem theoretically but\nWeierstrass\n,\nRiemann\nand\nSchwarz\nworked on the problem which was finally solved by\nDouglas\nand\nRadó\n. Plateau also wrote some mathematical articles on\nnumber theory\nand wrote a joint article with\nQuetelet\n.\nMore details of the experiments are at\nTHIS LINK\n.\nAs to his character Grosjean and Rassias write in\n[\n4\n]\n:-\nHe had a vivid and humorous character, his memory seldom let him down, and in contrast to most people, it became prodigious as he grew older. He was fond of visiting scholars and liked to welcome them at his home. ... he reached old age, bodily and mentally in excellent state, exception made for his blindness.\nPlateau received many honours. He was elected a corresponding member of the\nRoyal Belgium Academy of Science\n(\nAcadémie Royale des Sciences, des Lettres et des Beaux Arts\n)\non\n15\nApril\n1834\nand was elected a full member on\n15\nDecember\n1836\n. He was awarded the quinquennial prize for Mathematics and physics twice, first in\n1854\nfor his work over the period\n1849\n-\n53\n, then for a second time in\n1869\nfor his work over the period\n1864\n-\n68\n. On\n13\nDecember\n1841\nhe was named Knight of the Order of Leopold, later being promoted to officer on\n15\nNovember\n1859\nand finally to commander on\n28\nMay\n1872\n.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}