{
  "nome_completo": "Joseph Fels Ritt",
  "nome_curto": "Joseph Ritt",
  "ano_nascimento": "1893",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ritt/",
  "lugar_nascimento": "New York City, USA",
  "lugar_morte": "New York City, USA",
  "biografia": "Joseph Ritt\n's parents were Eva Steinberg and Morris Ritt. The family were not well off and his studies were made much more difficult because of this. He entered City College in\n1908\nand studied there for two years. He showed great mathematical ability and in each year he was awarded the Belden Mathematical Prize. In\n1910\nhe was appointed to the Naval Observatory in Washington D.C. whose main work was in determining standard time in the United States. The Observatory measured the position of celestial objects for purposes of timekeeping and navigation and in\n1904\n, six years before Ritt took a job there, the Observatory broadcast the world's first radio time signals. Ritt really wanted to continue his education but he had to earn money to help with the family finances.\nWhile he was in Washington D.C. Ritt did manage to continue his education as well as working at the Observatory. He studied at the George Washington University\n(\nit had university status from\n1873\nbut had adopted its current name only six years before Ritt began to study there\n)\n. He was awarded a B.A. in\n1913\nand, following the award, he took a summer graduate course at Columbia University\n(\nColumbia College had been renamed Columbia University in the year before Ritt took the course\n)\n.\nEdward Kasner\n, who was on the faculty at Columbia University, recognised Ritt's remarkable talents and he was offered a fellowship to undertake research for his doctorate at Columbia. Ritt resigned his position at the Naval Observatory and began working for his doctorate which was awarded in\n1917\nfor his thesis\nOn a general class of linear homogeneous differential equations of infinite order with constant coefficients\n.\nOf course World War I had been taking place during the most of the time that Ritt was undertaking research and when he had completed the work he undertook war work doing calculations for the Ordnance Department. In\n1921\nRitt was appointed as an assistant professor at Columbia University and was promoted to associate professor in\n1927\n. In the following year he married Estelle Fine\n[\n1\n]\n:-\nBoth were avid travellers, and Ritt, who visited Asia and Europe frequently, was fluent in a number of languages. Several of his early papers were published in French.\nIn fact Ritt published two important papers in\n1922\n, namely\nPrime and composite polynomials\nand\nOn algebraic functions which can be expressed in terms of radicals\n. In the following year he published\nPermutable rational functions\nwhich studies rational functions\nf\nf\nf\nand\ng\ng\ng\nwhich satisfy\nf\n(\ng\n(\nx\n)\n)\n=\ng\n(\nf\n(\nx\n)\n)\nf (g(x)) = g(f (x))\nf\n(\ng\n(\nx\n)\n)\n=\ng\n(\nf\n(\nx\n)\n)\n. In\n1925\nhe began his study of elementary functions and his work in this area was presented in his monograph\nIntegration in Finite Terms. Liouville's Theory of Elementary Methods\nwhich was published in\n1948\n.\nLaurence Young\n, reviewing the book, writes:-\nThis little book is the first treatise to deal with the theory of elementary integrals according to\nAbel\nand\nLiouville\n, i.e. with the question of characterizing those indefinite integrals which reduce to elementary functions. The question itself is, of course, by no means an elementary one: the precise definition of elementary function requires a considerable background of complex function-theory and\nRiemann\nsurfaces.\nOne year before the publication of this work, Ritt had published\nTheory of Functions\nwhich provides an introduction to the theory of functions in a series of short and to the point lecture notes giving the student an account of the fundamental definitions and theorems of the subject. In fact his lecturing style, captured in these notes, was described by\nLorch\nin\n[\n3\n]\nas follows:-\nHis lectures were etched on the mind of his hearers who carried away a feeling of masterfulness.\nRitt had begun a new major research topic in the\n1930\ns when he began to create a theory of ordinary and partial differential equations. He produced two books on the subject which contained the results from a long series of papers which he produced on the topic. The first book was\nDifferential equations from an algebraic standpoint\n(1932)\nand the second, a very major revision and extension of the first, was\nDifferential Algebra\n(1950)\n. The book considers the results obtained by Ritt and his students on topics such as differential polynomials, differential ideals, and differential manifolds.\nWe left our description of Ritt's career at the point where he was associate professor at Columbia University. He continued on the faculty at Columbia for the rest of his life, being promoted to full professor in\n1931\nand Davies Professor of Mathematics in\n1945\n. He served as Head of Department during\n1942\n-\n45\n.\nIn the last three years of his life Ritt began a deep study of the applications of\nLie\ntheory to homogeneous differential equations. In a remarkable series of papers which appeared in the\nAnnals of Mathematics\nhe investigated a differential group of order\nn\nn\nn\nwas he defined as a power series, with certain properties, in two sets of\nn\nn\nn\nindeterminates and their derivatives of various orders. He was invited to lecture on this work at the International Congress of Mathematicians, held in Cambridge, Massachusetts in\n1950\n.\nRitt received many honours during his career. He was\nAmerican Mathematical Society\nColloquium Lecturer in\n1932\nand served as the vice president of the\nAmerican Mathematical Society\nfrom\n1938\nto\n1940\n. He served on the\nAmerican Mathematical Society\nColloquium Editorial Committee from\n1943\nto\n1948\n, and he also served on the editorial board of the\nAmerican Journal of Mathematics\nfrom\n1936\nto\n1940\n. He was elected a member of the\nNational Academy of Sciences\n(\nUnited States\n)\n. However, he never received any prize, a matter which annoyed him. He wrote the follwong epitaph for himself\n[\n2\n]\n:-\nHere at your feet J F Ritt lies\nHe never won the\nBôcher\nPrize.\nDauben writes in\n[\n1\n]\n:-\nFor the most part\n[\nRitt\n]\nworked by himself; perhaps his innate shyness made it difficult for him to work comfortably with others ... It is clear that Ritt took an unusual interest in reading the great mathematical works of his predecessors. He drew substantial inspiration from careful study of classic texts, especially those by the great figures of the eighteenth and nineteenth centuries. Among his heroes were\nNiels Henrik Abel\n,\nAugustin Louis Cauchy\n,\nDavid Hilbert\n,\nCarl G J Jacobi\n,\nJoseph-Louis Lagrange\n, the marquis\nPierre Simon de Laplace\n,\nJoseph Liouville\nand\nJules Henri Poincaré\n. Their works set the standards Ritt tried to reach in his own mathematics, and were they to judge his work, he hoped it would be found worthy.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}