{
  "nome_completo": "Josef Stefan",
  "nome_curto": "Josef Stefan",
  "ano_nascimento": "1835",
  "ano_morte": "1893",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stefan_Josef/",
  "lugar_nascimento": "St Peter (near Klagenfurt), Austria",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Both\nJosef Stefan\n's parents, although living near Klagenfurt in Austria-Hungary\n(\nnow Austria\n)\n, were of Slovenian origin and spoke Slovenian. His father, Ales Stefan\n(1805\n-\n1872)\n, worked as a miller of flour and as a baker. Josef's mother, Marija Startinik\n(1815\n-\n1863)\n, was employed as a maidservant. They were both illiterate and were not married. Josef showed his brilliance when at elementary school in Klagenfurt and he showed himself to have both the desire and ability to do well at the\nGymnasium\nwhich was recommended by his teachers. However, as an illegitimate child he would not be allowed to attend a Gymnasium so, when he was eleven years old, his parents married to give Josef to opportunity of a good education. Stefan entered the Gymnasium in Klagenfurt in\n1846\n.\nOn\n13\nMarch\n1848\n, eleven days before Stefan's thirteenth birthday, a Revolution began in Austria. It was prompted by the Paris Revolution in February of the same year. People sought basic freedoms but the country was divided and revolutionary and counter-revolutionary groups fought for power. Stefan was at an impressionable age and the Revolution made him much more aware of the various ethnic groupings and his own Slovenian origins. He reacted by writing Slovenian poetry which he published. His poetry touched on scientific topics as well as sometime being fiercely patriotic while at other times it was romantic. In\n1853\nhe completed his studies at the Gymnasium as the top student in his class and, although having a range of interests which he could have chosen to study at university, nevertheless was quite certain that mathematics and physics were for him. He did consider joining the Benedictine Order for a while but soon gave up the idea.\nStefan entered the University of Vienna in\n1853\n. He graduated four years later with a degree in mathematics and physics. He continued to write Slovenian poetry and prose throughout his student years but after criticisms by the Slovenian literary experts, he gave this up around the time he graduated from the University of Vienna. For the next year he taught physics for pharmacy students, then accepted a position with Karl Ludwig at the Physiology Institute of Vienna University. Here he carried out experimental work on the flow of water through tubes. During this period he was preparing to\nhabilitate\nwhich he did in\n1858\n. Appointed a lecturer in mathematical physics at the University of Vienna in\n1858\n, he was elected to the\nAustrian Academy of Sciences\nin\n1860\n, then he became a professor at the University of Vienna in\n1863\n. In\n1866\nhe became director of the Physical Institute at Vienna. This Institute had been founded by\nDoppler\nin\n1850\n.\nHis career at the University of Vienna included a spell as dean of the Philosophy Faculty in\n1869\n-\n70\n, and rector in\n1876\n-\n77\n. We noted his election to the\nAustrian Academy of Sciences\nin\n1860\n. He became a full member in\n1865\n, was secretary of the Mathematical Sciences Class of the Academy from\n1875\n, and was vice-president of the Academy from\n1885\nuntil his death.\nThe programme of research that Stefan embarked on was wide ranging across a number of different areas. He was a great admirer of\nMaxwell\n's contributions and was a major player in making his work known on the Continent. It was in\nMaxwell\n's papers that he came across the following:-\nIt would be almost impossible to establish the value of the conductivity of a gas by direct experiment, as the heat radiated from the sides of the vessel would be far greater than the heat conducted through the air, even if current could be entirely prevented.\nOf course\nMaxwell\nwas right about the difficulties but Stefan was one to rise to a challenge, especially when it came to devising experiments thought to be almost impossible. A new instrument would be needed to determine the thermal conductivity of air, reasoned Stefan, and he set about devising one which he called a diathermometer described in his paper\nUntersuchung über die Wärmeleitung in Gasen, Erste Abhandlung\nⓉ\n(\nStudy on heat conduction in gases, First Treatise\n)\n(1872)\n. With this he was able to find a value of the thermal conductivity or air which only has an error of about\n10\n%.\nMaxwell\n, and also\nClausius\nwho had also worked on the problem, had deduced that thermal conductivity should be independent of the pressure of the gas, and Stefan was able to verify this experimentally. He went on the find the thermal conductivity of hydrogen, nitrous oxide, methane, carbon monoxide, and carbon dioxide, presenting the results in\nUntersuchung über die Wärmeleitung in Gasen, Zweite Abhandlung\nⓉ\n(\nStudy on heat conduction in gases, Second Treatise\n)\n(1875)\n.\nStefan showed empirically, in\n1879\n, that total radiation from a blackbody is proportional to the fourth power of its absolute temperature. This is the result for which he is best known and it was the work which we have described above which set him up to undertake this next piece of research. In fact he was led to the result by data produced by Tyndall in an\n1865\nbook. Tyndall measured the radiation from a platinum wire heated by an electric current. Stefan, using Tyndall's data, wrote in\nÜber die Beziehung zwischen der Wärmestrahlung und der Temperatur\nⓉ\n(\nOn the relationship between thermal radiation and temperature\n)\n(1879)\n:-\nFrom weak red heat\n(\nabout\n525\n° C\n)\nto complete white heat\n(\nabout\n1200\n° C\n)\nthe intensity of radiation increases from\n10\n.\n4\nto\n122\n, thus nearly twelvefold\n(\nmore precisely\n11\n.\n7)\n. This observation caused me to take the heat radiation as proportional to the fourth power of the absolute temperature. The ratio of the absolute temperature\n273\n+\n1200\nand\n273\n+\n525\nraised to the fourth power gives\n11\n.\n6\n.\nStefan then applied it to determine the approximate temperature of the surface of the Sun.\nBoltzmann\n, who was one of Stefan's students, showed in\n1884\nthat this Stefan-\nBoltzmann\nlaw could be demonstrated mathematically.\nAfter this work, Stefan looked at the problem of the polar ice caps. Several ships had been trying to find the Northwest Passage and in so doing had become stuck in the polar ice over the winter. The scientists on board had taken recordings of the air temperature and ice growth. Stefan realised that this was a variant of the problem he had been studying. Instead of considering the transfer of heat across a fixed boundary, this problem involved the transfer of heat across a moving boundary. He presented his results in\nÜber die Theorie der Eisbildung, insbesondere über die Eisbildung im Polarmeere\nⓉ\n(\nOn the theory of the formation of ice, especially on the ice in the polar seas\n)\n(1889)\n.\nOther work by Stefan includes studies of surface tension and evaporation, during which he proposed what today is called 'Stefan's number' and 'Stefan's law'. He also undertook research on alternating electric currents, studying the induction coefficients of wire coils. His wide range of topics can be illustrated by noting that he also made important contributions to optics, discovering secondary rings in Newton's experiments.\nThe life which Stefan led was totally dedicated to science. He frequently slept in his laboratory and on occasions would spend several days in the laboratory without ever leaving. Of course with such total dedication to his work, Stefan had little time for friends and had hardly any social life. However he was liked by his students who found him an excellent teacher who could enthuse them for physics. Although his great strength as a researcher was on the experimental side, nevertheless he was an excellent mathematician who could show insight on the theoretical side too. His most famous student,\nBoltzmann\nsaid this of him\n(\nsee for example\n[\n5\n]\n)\n:-\nHe used the tools of advanced mathematics and understood how to present the most difficult developments in the clearest and most lucid form without ever having to resort to mathematical formalism. ...\n[\nHe\n]\nnever tried to flaunt\n[\nhis\n]\nmental superiority.\n[\nHis\n]\nuplifting humour, which turned the most difficult discussion into an entertaining game for the student, made such a deep impression on me.\nBoltzmann\npainted a picture of a wonderful research environment:-\nNothing diminishes the excellence of\n[\nStefan's\n]\ncharacter, the magic\n[\nhe\n]\nworked on the young academics. That magic could only be experienced personally.\n[\nThe experience\n]\nstayed with me my whole life as a symbol of serious, inspired experimental activity.\nFor most of his life Stefan was unmarried, too dedicated to his profession to have space for wife or family. However, in\n1891\nwhen he was\n56\nyears old, he married Marija Neumann who was a widow. He lived only a little over a year after his marriage, suffering a stroke. He was buried in the Zentralfriedhof in Vienna.",
  "math_areas": [
    "Applied Mathematics"
  ]
}