{
  "nome_completo": "Joseph Bernard Kruskal, Jr.",
  "nome_curto": "Joseph Kruskal",
  "ano_nascimento": "1928",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kruskal_Joseph/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Maplewood, New Jersey, USA",
  "biografia": "Joseph Kruskal\n's parents were Joseph Bernard Kruskal Sr.\n(1885\n-\n1950)\n, the owner of Kruskal & Kruskal, a wholesale fur business, and Lillian Rose Vorhaus\n(1898\n-\n1992)\nwho became a leading populariser of origami in America from the\n1950\ns onward. Lillian was born in New York but her father had emigrated from Poland. Perhaps we should note that Lillian taught origami to\nPersi Diaconis\nwhen he was working as a magician; he later he became a famous mathematician. Joseph was one of his parents' five children,\nWilliam Henry Kruskal\n(1919\n-\n2005)\n, Molly L Kruskal\n(1921\n-\n)\n, Rosaly Kruskal\n(1923\n-\n)\n,\nMartin David Kruskal\n(1925\n-\n2006)\nand Joseph Kruskal, the subject of this biography. Both Joseph's brothers,\nWilliam Kruskal\nand\nMartin Kruskal\nbecame professors of mathematics and have biographies in this archive. While Joseph was growing up, his older brother\nMartin David\ntook every opportunity to teach him mathematics.\nKruskal studied mathematics at the University of Chicago. He was awarded a BS in\n1948\nand an MS in\n1949\nby Chicago. Joseph Bernard Kruskal Sr. died in\n1950\n. Joseph Kruskal's mother Lillian married Harry C Oppenheimer in\n1954\n. Kruskal married Rachel Solomon in\n1953\n; they had two children, Joyce and Benjamin. He then went to Princeton University where he undertook research for a Ph.D. advised by\nRoger Lyndon\nand\nAlbert W Tucker\n. He explained how it was\nPaul Erdős\n, and not his advisors, who gave him the problem that led to his doctorate:-\nPaul Erdős\nwas telling lots of people about a conjecture due to a Hungarian mathematician, Andrew Vázsonyi\n(1916\n-\n2003)\n(\nalso known as Endre Weiszfeld\n)\n, he was friendly with and whom he said \"had died\", meaning that he left mathematics for a well-paying job with some company - I think it was an airplane manufacturer. I was one of many people who heard him describe this conjecture. Roughly a year later, I had put a lot of work into this problem, but was still not close to a solution. By chance I bumped into\nErdős\nat the Princeton Junction station. We chatted. I don't know how the conversation turned to the Vázsonyi conjecture - probably I told him I had been working on it. He said, oh, you must read a recent paper by\nRichard Rado\n. I quickly went to the library and found his paper, which I read with fear and trembling. Had I been scooped? It turned out that he had made significant progress, but hadn't cracked the nut. His work combined with mine finally led to a solution.\nIn\n1954\n, Kruskal was awarded a Ph.D. by Princeton for his thesis\nThe Theory of Well-Partially-Ordered Sets\n. He published\nWell-Quasi-Ordering, The Tree Theorem, and Vazsonyi's Conjecture\n(1960)\nbased on his thesis. He gives the following acknowledgement in this paper:-\nThis paper presents an expanded version of part of my doctoral dissertation at Princeton University. I wish to express my gratitude for the encouragement and direction of\nR Lyndon\nand\nA W Tucker\n. I also wish to acknowledge my debt to\nP Erdős\nfor acquainting me with the problem and to my brother\nMartin Kruskal\nfor his collaboration in the early development of the theory.\nWe should explain that while Kruskal was working towards his Ph.D., he was also employed at the US Office of Naval Research. This meant that, from\n1950\nto\n1953\n, he worked at George Washington University on the Logistical Research Project. After the award of his doctorate, Kruskal continued to work for the US Office of Naval Research, spending the years\n1954\n-\n1956\nworking on Princeton's Analytical Research Project.\nBefore publishing the paper based on his Ph.D. thesis, he had already published a number of articles including:\nMonotonic subsequences\n(1953)\n;\nOn the shortest spanning subtree of a graph and the traveling salesman problem\n(1956)\n;\n(\nwith Alan J Hoffman\n)\nIntegral boundary points of convex polyhedra\n(1956)\n; and\n(\nwith R J Aumann\n)\nThe coefficients in an allocation problem\n(1958)\n. The authors of this last mentioned paper state:-\nThe research described in this paper has extended over a period of years, during which the authors have been affiliated with various institutions. These include Princeton University, Bell Telephone Laboratories, Inc., The University of Wisconsin, the Hebrew University, and the National Bureau of Standards.\nThey explain what the allocation problem is in the Introduction:-\nThe allocation or assignment problem is one of the most important problems of management science. It may be stated very briefly: We are given a system with a number of vacant positions and an equal number of available parts. We know how well each part performs in each position; we wish to assign the parts to the positions so that the system performance is optimised. Applications range far and wide, from employment to aircraft assignment to naval overhaul programmes. The computational aspects of the problem have been solved, under the assumption that a numerical value is associated with each assignment and that the value of the system is given by the sum of the values of the individual assignments. The crux of the problem, therefore, becomes the finding of values to use for the individual assignments.\nDuring the three years\n1956\n-\n59\n, Kruskal lectured at the University of Wisconsin at Madison and at the University of Wisconsin at Ann Arbor. In\n1959\nhe took up an appointment at Bell Laboratories, in Murray Hill, New Jersey, where he continued to work for the rest of his career. However, he was a visiting professor at Yale University in\n1967\n-\n68\n. He formally retired in\n1993\nbut continued to undertake research at the Bell Laboratories for several years.\nIn\n[\n5\n]\nKruskal lists his scientific interests as: multidimensional scaling; minimum spanning trees; clustering; and statistical linguistics. His name is well-known for being attached to a number of important concepts. For example 'Kruskal's algorithm', a graph theory algorithm which finds a minimal spanning tree of a weighted graph, was described in his\n1956\npaper\nOn the shortest spanning subtree of a graph and the traveling salesman problem\n. The 'Kruskal's tree theorem' is the name now given to Kruskal's proof of the Vazsonyi's Conjecture which he published in\nWell-Quasi-Ordering, The Tree Theorem, and Vazsonyi's Conjecture\n(1960)\n. The 'Kruskal-Katona theorem' appears in Kruskal's\n1963\npaper\nThe number of simplices in a complex\nand in Gyula O H Katona's\n1968\npaper\nA theorem of finite sets\n. The 'Kruskal rank' or '\nk\nk\nk\n-rank' appears in Kruskal's\n1977\npaper\nThree-way arrays rank and uniqueness of trilinear decompositions, with applications to arithmetic complexity and statistics\n.\nIn\n1978\nKruskal published the book\nMultidimensional Scaling\nwhich was co-authored by Myron Wish. Mark Hansel writes in the review\n[\n3\n]\n:-\nThis book successfully emphasizes the underlying assumptions, substantive interpretation, and applications of multidimensional scaling ...\nThere is another area to which Kruskal has made a major contribution, namely a field known as lexicostatistics or glottochronology which is a form of comparative linguistics. Working with Isidore Dyen and Paul Black, Kruskal published the monograph\nAn Indoeuropean Classification, a Lexicostatistical Experiment\nin the\nTransactions of the American Philosophical Society\nin\n1992\n. In\n1997\nKruskal announced that the 'Comparative Indoeuropean Data Corpus' was available. It included a\n200\n-item lexicostatistical lists for\n95\nIndo-European speech varieties, cognation judgments between the lists, lexicostatistical percentages, individual replacement rates for\n200\nmeanings, and time separations based on these rates.\nKruskal's interest in languages extended to an interest in how to write good scientific articles. His ideas in this area are contained in a letter he wrote to the journal\nScience\n. In the\n5\nSeptember\n1969\nissue of\nScience\n, John H Wilson Jr published the letter\nBetter Written Journal Papers - Who Wants Them?\nKruskal replied in\n[\n4\n]\n:-\nIn the field of technical exposition, good writing does not mean graceful prose. It does mean explanations which are as easy to follow as the intrinsic difficulty of the subject will permit. It is not easy to describe the nature of clear exposition. However, in my editorial capacity I have had ample opportunity to observe the most common breaches. It may be useful to describe a few.\n1\n. No common failure is more disastrous than omitting an important part of the argument or some important piece of evidence.\n2\n. Authors frequently mislead their readers by emphasizing matters of marginal importance, and touching only lightly on the central issues.\n3\n. Papers are often badly arranged. Arguments get separated from the propositions they are designed to support, definitions come long after terms are used, and observations which belong in one section intrude irrelevantly in another.\nI freely confess to a love of beautiful English prose. ... Even in scientific exposition one occasionally encounters beautiful writing, and I enjoy it there as much as in John Barth's writings. However, graceful prose contributes only slightly to clarity of exposition, as any reader of 'Finnegans Wake' will testify.\nHis nephew, Clyde P Kruskal, wrote a tribute to his uncle following his death. He recalled some personal memories:-\nI recall as a child how happy I was when he came to visit, usually after giving a talk somewhere. I also remember that once, when our extended family had a get together on the Long Island Sound, he spent all day taking the children one-by-one out sailing. ... There was a period of time when I used to visit Bell Labs, where Joe worked. I would stay with him and my Aunt Rachel, who were wonderful hosts. I used to enjoy our wide ranging dinner conversations, and I learned so much about words, politics, statistics, my family, etc.\nThe authors of\n[\n1\n]\nand\n[\n2\n]\npay this tribute to Kruskal:-\nJoe was both a pure and an applied mathematician par excellence. In studying over our folders of Joe's correspondence and publications, we are particularly struck by how encouraging his advice was to junior colleagues like the two of us, and even benign to ideological adversaries in his own peer group. He was a self-effacing person who seemed unaware of his own truly monumental accomplishments. As both a kindly friend and top-internationally recognized major mathematician, his absence is a very sorrowful one.\nKruskal was a fellow of the\nAmerican Statistical Association\nand was honoured by being elected president of both the Psychometric Society and the Classification Society of North America. In\n1979\nhe was awarded the\nMathematical Association of America\n's The\nLester R Ford\nAward for his paper, written jointly with Lawrence A Shepp,\nComputerized tomography: the new medical x-ray technology\n. This paper was published in the\nAmerican Mathematical Monthly\nin\n1978\n.\nHe died in his home in Maplewood, New Jersey, of pancreatic cancer at the age of\n82\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}