{
  "nome_completo": "Josif Zakharovich Shtokalo",
  "nome_curto": "Josif Zakharovich Shtokalo",
  "ano_nascimento": "1897",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shtokalo/",
  "lugar_nascimento": "Skomorokhy, Sokal, Galicia (now Ukraine)",
  "lugar_morte": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "biografia": "Josif Zakharovich Shtokalo\n's parents were peasants. In\n1904\nhe began his education at the local Skomorokhy primary school where he studied for three years. Given his background, he had to work very hard to make a success of his time at this rural school and indeed he succeeded brilliantly but only through very hard work. In\n1907\nhe entered the\nGymnasium\nin Sokal where he was still studying when World War I broke out in\n1914\n. However, his family could not afford to support their son financially through this long educational process and Shtokalo had to earn money by teaching his fellow students. Of course, this was hard on the boy but at the same time it gave him some early experience as a teacher which would prove a benefit to his career.  Many families, including Shtokalo's family, fled from the fighting which was taking place around them in\n1914\nand escaped towards the east of Ukraine. Shtokalo himself had been drafted into the Russian army but in the spring of\n1915\n, together with thousands of other Ukrainians, he deserted and joined his family which had settled in Katerinoslav\n(\nwhich is now called Dnipropetrovsk\n)\n. There Shtokalo completed his secondary education at the Katerinoslav Classical Gymnasium. He gained a diploma which qualified him to teach at primary schools and obtained a position in the elementary school in the village of Popasnoe, Novomoskovskii District. In\n1918\n, he was appointed as a teacher of mathematics at a school in Kam'yans'ke\n(\nnow Dneprodzerzhinsk\n)\n. After two years he became the director of the school. Shtokalo married and his daughter Miroslava Iosifovna Shtokalo was born in Dneprodzerzhinsk on\n24\nAugust\n1926\n; she became a professor of chemistry publishing over\n250\npapers and two monographs. She is a member of the Academy of Engineering Sciences of Ukraine, and the New York Academy of Sciences.\nShtokalo studied at Dnipropetrovsk University in south-central Ukraine, beginning his studies there in\n1927\n. It was while he was an undergraduate in the department of physics and mathematics of Dnipropetrovsk University that his first mathematics work was published, namely\nHandbook of Mathematics for Workers in Heavy Industry\n(1928)\n. He studied at Dnipropetrovsk University until\n1931\nbut at the same time he had positions teaching mathematics at Vocational Technical Schools and in the Dnepropetrovsk Evening Metallurgical School of the G I Petrovsk Factory. After graduating from Dnipropetrovsk University, he was accepted as a postgraduate student in the Ukrainian Research Institute of Mathematics and Mechanics of Kharkov University in\n1931\nand he undertook research there for three years on the theory of functions of a complex variable and their applications. He submitted a candidate's thesis\n(\nequivalent to a Ph.D.\n)\nin\n1934\n; it was on the pressure of a flux of finite width on a plane lamina. After the award of the degree, he was appointed as head of mathematics at the Kharkov Textile Institute and, at the same time, gave mathematics courses at Kharkov University. His research on the theory of functions of a complex variable and its applications included work on conformal mappings,\ndifferential equations\n, and variational statistics. However, during the second half of the\n1930\ns he worked almost exclusively on differential equations.\nAlthough World War II started in September\n1939\nwith the German invasion of Poland, because of the Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union, this had little effect in Russia and Ukraine. However, on\n22\nJune\n1941\nthe German armies invaded their former allies pushing rapidly east into Soviet lands. At first their main advance was aimed towards Moscow, but by August they made a strong push in the south deep into Ukraine capturing Kharkov on\n24\nOctober\n1941\n. Shtokalo had been given the task of evacuating the\nUkrainian Academy of Sciences\nfrom Kharkov to the Urals so by the time Kharkov fell to the Germans, Shtokalo and the\nAcademy\nhad moved far towards the east. An attempt by the Red Army to retake the city of Kharkov from the Germans failed in May\n1942\n. The German occupation of Kharkov lasted until\n1943\n. The first liberation of the city in February\n1943\nonly lasted until March\n1943\nwhen again it was captured by the Germans, but the city was finally liberated on\n23\nAugust\n1943\n. Shtokalo had moved to Ufa, the capital of the Bashkortostan republic in western Russia, where the\nUkrainian Academy of Sciences\nhad been relocated. In Ufa he worked as a senior scientific researcher at the Institute of Mathematics and Physics of the\nUkrainian Academy of Sciences\nand as a lecturer at the Department of Mathematical Analysis headed by\nNikolai Nikolaevich Bogolyubov\nat the Ufa State Aviation Technical University. Shtokalo continued to undertake research on differential equations while in Ufa, but the direction of his research was at this time influenced by the joint work of\nBogolyubov\nwith\nNikolai Mitrofanovich Krylov\nin which they developed a theory of non-linear oscillations; they called their topic 'non-linear mechanics'.\nIn\n1943\nShtokalo left Ufa and moved to Moscow where the Institute of Mathematics of the\nUkrainian Academy of Sciences\nhad been moved. There he defended his doctoral dissertation\n(\nequivalent in level to the D.Sc. or the\nhabilitation\n)\non\nAsymptotic and Symbolic-Analytic Methods in the Solution of Certain Classes of Linear Differential Equations with Variable Coefficients\n. In\n1944\nhe also received an appointment as head of the Department of Mathematics at Kiev State University. This was a difficult time following the war when there were not enough textbooks, teaching aids, and stationery for the students. Also many of the students had come straight from the trenches having been drafted as soldiers before completing a good general education. Many had insufficient background to begin their university studies and Shtokalo had to organise the Department to cope with difficulties of this kind. He had a reputation as an excellent lecturer and his teaching skills were of great use in these difficult circumstances. Shtokalo was also greatly assisted by\nNikolai Nikolaevich Bogolyubov\nwho worked at Kiev State University from\n1946\nto\n1949\n.\nAs examples of Shtokalo's work at this time we note his remarkable publication record. In\n1945\nseveral papers appeared including:\nMéthode asymptotique pour la solution de certaines classes d'équations différentielles linéaires à coefficients variables\nⓉ\n(\nAsymptotic method for the solution of certain classes of linear differential equations with variable coefficients\n)\n;\nGénéralisation de la formule fondamentale de la méthode symbolique pour le cas des équations différentielles à coefficients variables\nⓉ\n(\nGeneralization of the fundamental formula of the symbolic method to the case of differential equations with variable coefficients\n)\n;\nCriteria for stability and instability of the solutions of linear differential equations with quasiperiodic coefficients\n(\nUkrainian, Russian\n)\n,\nLinear differential equations of the n th order with quasiperiodic coefficients\n(\nUkrainian, Russian\n)\n,\nSystems of linear differential equations with quasiperiodic coefficients\n(\nUkrainian, Russian\n)\n, and\nGeneralized Gibbs formula for the case of linear differential equations with variable coefficients\n(\nUkrainian, Russian\n)\n. Then in\n1949\nhe went to Lvov\n(\nnow Lviv in Ukraine\n)\nwhen he became the Chairman of the Lvov Branch of the\nUkrainian Academy of Sciences\n. While there he was involved in local politics being elected to the Lvov City Council.\nIn\n1956\nShtokalo returned to Kiev where he again took up his posts at the Institute of Mathematics of the\nUkrainian Academy of Sciences\nand his chair at Kiev University. At the Institute of Mathematics Shtokalo set up a seminar on the history of mathematics and was head of the Department of History of Mathematics from\n1956\nto\n1963\n. In\n1963\n, while retaining his position at Kiev University, he moved from the Institute of Mathematics to the Institute of History of the\nUkrainian Academy of Sciences\nin Kiev where he was head of the section on the History of Technology and Science. The held this position until\n1986\n. From\n1957\nto\n1967\nhe was Chairman of the Terminology Commission of the Presidium of the\nUkrainian Academy of Sciences\n. In\n1974\nhe moved into apartment number\n19\nin\n14\n/\n7\nNikolsko Botanica Street in Kiev where he lived until\n1987\n. On\n30\nNovember\n1989\na bronze plaque was put up on the apartment to mark the place where Shtokalo had lived.\nShtokalo worked mainly in the areas of differential equations, operational calculus and the history of mathematics.\nVolodymyr Petryshyn\n, writing in\n[\n12\n]\n, describes Shtokalo's work:-\nAfter\n1945\nhe became particularly interested in the qualitative and stability theory of solutions of systems of linear ordinary differential equations in the\nLyapunov\nsense and in the\n1940\ns and\n1950\npublished a series of articles and three monographs in these areas.\nShtokalo's work had a particular impact on linear ordinary differential equations with almost periodic and quasi-periodic solutions. He extended the applications of the operational method to linear ordinary differential equations with variable coefficients. In\n1960\nhe published\nOn the operational calculus\n(\nRussian\n)\n, giving the following English summary:-\nThis paper contains a brief outline of investigations in the field of the calculus of operations, indicating the main trends and principal stages of development, as well as a substantiation of the methods of the calculus of operations. The author elucidates the role of native scientists and their contributions in this field of mathematics, which are of great importance both for the development of mathematical theory and for application to urgent problems.\nIn the following year his\n128\n-page monograph\nOperational methods and their development in the theory of linear differential equations with variable coefficients\n(\nRussian\n)\nwas published. In\n1961\nthe English text\nLinear differential equations with variable coefficients. Criteria of stability and unstability of their solutions\nwas published being a translation of the Russian book which appeared one year earlier. His\n303\n-page book\nOperational calculus\n(\nRussian\n)\nwas published in\n1972\n. Hans-Jurgen Glaeske begins a review as follows:-\nThis book is an introduction to operational calculus, which is based on the theory of the\nLaplace transformation\n. It differs from other books in this domain by the consideration of solutions of ordinary differential equations with variable coefficients, based on papers of the author and of K G Valeev.\nAn English translation of this book was published in\n1976\n.\nIn\n[\n12\n]\nVolodymyr Petryshyn\ndescribes Shtokalo's work on the history of mathematics:-\nHe is regarded as one of the founders of the history of Soviet mathematics and particularly of the history in Ukraine and articles about\nM Ostrogradski\nand\nH Voronoy\n, he edited the three volume collections of\nVoronoy\n's\n(1952\n-\n3)\nand\nOstrogradski\n's works\n(1959\n-\n61)\n, a Russian-Ukrainian mathematical dictionary\n(1960)\nand approximately eighteen other Russian-Ukrainian terminology dictionaries.\nAmong the other works he published on the history of mathematics we mention:\nAchievements in mathematical science in the Academy of Sciences of the URSR during the\n30\nyears of Russian hegemony\n(\nUkrainian\n)\n(1947)\n;\nDevelopment of mathematics in the URSR during the\n30\nyears of Russian hegemony\n(1948)\n;\nWorks of M V Ostrogradskii on mathematical physics\n(1952)\n;\n(\nwith I B Pogrebusskii\n)\nThe Life and Scientific Pursuits of G F Voronoi\n(1953)\n;\nAchievements in mathematics in the T G Shevchenko Kiev State University in the years of Soviet power\n(1957)\n;\n(\nwith I B Pogrebusskii\n)\nOn the works of M V Ostrogradskii on mathematical physics\n(1959)\n; and\n(\nwith N I Simonov\n)\n,\nPhilosophical works of V I Lenin and some questions of the development of mathematics\n(1960)\n. The authors of\n[\n10\n]\nnote another of his achievements in the history of mathematics:-\nAt the initiative of I Z Shtokalo, under his direct editorship, and with his participation as author of several chapters, there has been published the multi-volume fundamental collection of papers, 'History of Indigenous Mathematics'\n(\nin five books\n)\n. He carried out a good deal of the scientific and organizational work for this publication, putting together a potent collection of authors. It should be mentioned that such a publication is the first, not only domestically, but in the world's scientific history literature.\nShtokalo has received many honours. He was elected a corresponding member of the\nUSSR Academy of Sciences\nin\n1948\nand, three years later, became a full member. In\n1965\nhe was elected to the International Academy of the History of Science, becoming an honorary member of the Academy in\n1978\n. He received the prestigious Koyré award from the International Academy of the History of Sciences in\n1970\n. He was awarded the\nN M Krylov\nPrize in\n1973\n. He also received State awards such as Honoured Worker in Science in the USSR\n(1968)\nand the Order of Lenin. He was buried at the Baikovoe cemetery in Kiev. We end this biography by quoting the authors of\n[\n10\n]\nwho gave the following appreciation of Shtokalo on his\n70\nth\nbirthday:-\nTeacher in primary, intermediate, and advanced schools, scholar, organiser and director of scientific endeavours, researcher in the area of the theory of differential equations, in the domain of operational calculus, in the area of the history of mathematics, organiser of the publication of works which are classics of indigenous science - such is a far from complete enumeration of the contributions of Iosif Zakharovich Shtokalo to the development of domestic science and culture.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics"
  ]
}