{
  "nome_completo": "Jovan Karamata",
  "nome_curto": "Jovan Karamata",
  "ano_nascimento": "1902",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Karamata/",
  "lugar_nascimento": "Zagreb, Austria-Hungarian Empire (now Croatia)",
  "lugar_morte": "Geneva, Switzerland",
  "biografia": "Jovan Karamata\nwas the son of Stevan Karamata\n(1866\n-\n1940)\nand his wife Desanka Vukomanovic\n(1870\n-\n1910)\n. Stevan Karamata, who came from a famous family, was the fourth child of Atanasije Karamata and his wife Marija Jovica. He became a founder member of the Serbian Bank in Zagreb. This bank was very successful and he became director of a branch of the bank which was established in Budapest. We should mention that Stevan had a brother Kosta Karamata\n(1862\n-\n1920)\nwho was a gymnasium mathematics teacher in Zemun. Kosta was a fine teacher, but also a research mathematician publishing three papers in the journal of the\nYugoslav Academy of Sciences and Arts\nin Zagreb. Another of Stevan's brothers, also named Jovan Karamata, was the owner of a famous printing house, the director of the savings bank in Zemun, and a member of the Hungarian Parliament. Stevan Karamata married Desanka Vukomanovic and they had six children: Atanasije, Ozren, Srdan, Smiljka, Kosta, and Jovan, the subject of this biography. Atanasije died as a child so Jovan had four older siblings.\nIn\n1909\nJovan Karamata began his primary schooling in Budapest, but soon his family moved to Zemun where there had been a Karamata family home for several generations. There he continued his primary schooling, completing it in\n1912\n. By this time, however, Jovan's mother had died and Marija Karamata, his fraternal grandmother\n(\nby this time a widow\n)\n, took on the role of mother to all of Stevan's children. \"Nanna\" Marija\n[\n5\n]\n:-\n... the devoted and deeply pious woman, about whom Jovan Karamata spoke with great respect, had, according to him, a lasting influence on his spiritual development.\nJovan began his secondary education at the Gymnasium in Zemun in\n1912\n. Had the world situation been very different, his school education would almost certainly have been completed in Zemun, a town he always considered his home town which he dearly loved. The First Balkan War broke out in\n1912\nand involved the four Balkan states successfully defeating the Ottoman Empire. This had a relatively minor effect on Jovan's schooling in Zemun but the Second Balkan War, which broke out in\n1913\nworried Jovan's family much more. This war, a direct consequence of the various countries being dissatisfied with the treaty following the First Balkan War, led to Bulgaria attacking Serbia and Greece, while Romania attacked Bulgaria. Zemun, in Austro-Hungary at this stage, was considered in danger of Serbian attack, so Jovan's family sent the young boy to Osijek before the outbreak of World War I. Indeed Zemun did fall to the Serbian forces in August\n1914\n, only a couple of weeks after World War I broke out. In\n1915\nJovan's family moved him again, still trying to avoid the areas of conflict, and he went to Susak near Rijeka.\nNot surprisingly, Jovan found these years extremely difficult and his education was suffering; he came close to having to repeat his third year at secondary school. His father, Stevan Karamata, worried about his children's education and also about the uncertainty caused by the fighting of World War I, decided later in\n1915\nto take his children to Switzerland to give them a better chance. Srdan, Smiljka, Kosta and Jovan went to Switzerland at this time but Jovan's brother Ozren only joined them at the beginning of\n1917\n. Jovan spent one year studying at a boarding school in Cressier in the Canton of Bern where he became fluent in French. In\n1916\nhe enrolled in a Gymnasium in Lausanne. Only\n14\nyears old, he was alone at this time, living in a boarding house in the Vidy area of Lausanne which today is the headquarters of the International Olympic Committee. Karamata graduated from the Gymnasium in\n1918\nand, later that year, began to study at the Gymnase Scientifique. This college had been set up in\n1908\nas part of the Gymnase de la Cité. There he met\nGeorges de Rham\nwho arrived at the school one year later. Karamata graduated from the Gymnase Scientifique in\n1920\nand, World War I now being over, returned to his homeland which had undergone major political changes.\nThe end of World War I in\n1918\nsaw the collapse of the Austro-Hungary Empire and the creation of the independent country Yugoslavia with Belgrade as its capital. Karamata's father, Stevan Karamata, moved to Belgrade where two banks were merging to become the Jadransko-Podunavska Banka. This was formally established on\n11\nMay\n1924\nwith Stevan Karamata as its Managing Director. Stevan Karamata had seen the increasingly attractive economic and financial potential of Belgrade and had advised his son Jovan Karamata to study civil engineering. Following this advice, in\n1920\nJovan had enrolled in the Department of Civil Engineering at the Faculty of Technical Sciences of the University of Belgrade. In\n1922\n, when he had completed two years of this course, he was advised by one of his professors, Bogdan Gavrilovic\n(1864\n-\n1947)\n, to transfer from engineering to mathematics. Gavrilovic taught mathematics, physics and philosophy at the University of Belgrade but his main interests were in pure mathematics. He had written important texts including\nAnalytical Geometry\n,\nTheory of Determinants\n, and\nLinear Algebra\n. Following his advice, Karamata transferred to study mathematics in the Faculty of Philosophy at the University of Belgrade.\nThe leading mathematician at Belgrade at this time was\nMihailo Petrović\nand he played an important role in Karamata's university education. Aleksandar Nikolic writes\n[\n5\n]\n:-\nKaramata did not mind much for formal school knowledge, and even as a student he aspired to do independent research work. The first teacher, an example and role model in scientific work, a man he respected all his life, was\nMihailo Petrović\n. According to the Serbian mathematician, academician Miodrag Tomic, he was the one who passed on to him the great and sincere love of science, the wide outlook, the desire to do scientific work, ideas free from formal restraints, and mathematical directions one should take in search of results.\nKaramata graduated in\n1925\nand he was appointed as a temporary assistant of\nMihailo Petrović\n. He was already undertaking research and he explained how his found the right area\n[\n10\n]\n:-\nI wanted to improve my knowledge of the foundations of the theory of functions. This is the reason why I first started to study the theory of series, but when I entered into this theory, I found so many old and new results that I remained there.\nHe presented his first work on series to the\nSerbian Academy of Sciences and Arts\nin a lecture he gave on\n14\nDecember\n1925\n; this would be published by the Academy. It also formed part of his doctoral thesis\nO jednoj vrsti granica slicnih odredenim integralima\nⓉ\n(\nOn types of limits similar to certain integrals\n)\non which he was examined on\n9\nMarch\n1926\n. On\n22\nMarch\n1926\nhe sat his Ph.D. examination before the same examiners who had conducted his thesis oral. He passed the examination and graduated as doctor of philosophy. A few days later he submitted\nSur Certaines Limites Rattachées aux Intégrales de Stieltjes\nⓉ\n(\nOn certain limits attached to the Stieltjes integrals\n)\nto the\nParis Academy of Sciences\n.\nJacques Hadamard\nwrote\n(\nsee for example\n[\n5\n]\n:-\nM Karamata's astute ideas partly coincide with some of those presented by\nPaul Lévy\n. On the other hand, the two very different methods in which these two authors came to the solution, demonstrates the productivity of a new kind of thinking.\nBefore continuing his career, he had to undertake military service. He served for one year from April\n1926\nto April\n1927\n. He took the examination to become an officer at the military school but failed with the grade \"incompetent\" having been asked to list all the lakes in the Kingdom of Serbs, Croats and Slovenes but he missed one out!\nAfter his military service was complete, he was awarded a Rockefeller Scholarship which enabled him to spent the period December\n1927\nto September\n1928\nin Paris. He made many friends during this visit, for example he had a lasting friendship with both\nAndré Lichnerowicz\nand\nPaul Montel\n. While in Paris, he had ideas for two papers which would be highly significant. Let us stress that he already had written several papers, in fact eleven of his papers were published between\n1926\nand\n1929\n, five in Serbian and six in French. The authors of\n[\n1\n]\nwrite:-\nTwo works from this period have a particular place and importance and have made Karamata a mathematician of world reputation. Both papers were published in\n1930\n, the first one in the renowned German journal \"Mathematische Zeitschrift\", the paper 'Über die Hardy-Littlewoodsche Umkehrungen des Abelschen Stätigkeitssatzes', while the second one in the little-known Romanian journal \"Mathematica\"\n(\nCluj\n)\n, 'Sur une mode de croissancerégulière des fonctions'. The first paper, which consisted only of two pages, provides a new, concise and elegant proof of the\nLittlewood\n's theorem in the theory of summability of infinity series.\nThe impact of this paper can be seen from\nG H Hardy\n's reaction reported by Vojislav Maric via\nEdward Copson\n[\n4\n]\n:-\nWhen visiting the St Andrews University in Scotland I was introduced to\nE T Copson\n(\nthe author of widely used textbook on the theory of complex functions\n)\n. He told me: \"I have known only one Yugoslavian mathematician - Karamata. When cooperating with\nHardy\nat Oxford I found him one day nervously pacing up and down his office. Not responding to greetings he abruptly said: 'I just received a letter from a young man in Belgrade who claims he can prove the\nHardy\n-\nLittlewood\ntheorem in just two pages! This is simply impossible!'\"\nG H Hardy\nwas wrong, it was not impossible, for Karamata had indeed proved this important theorem in two pages and his method would provide insightful and give a new method which led to further advances. In\n1979\nMathematische Zeitschrift\ncelebrated\n60\nyears of publishing mathematics and listed what they considered the\n50\nmost important papers published in these\n60\nyears. Karamata's\n2\n-page\n1930\npaper was one of the\n50\n.\nWe mentioned two highly significant papers above, so let us quote from the authors of\n[\n1\n]\nabout the second:-\nThe second paper established the foundations for the theory of regularly varying functions, which will later find numerous applications in probability theory, number theory, differential equations, complex analysis, and even mathematical analysis of cosmological parameters.\nReturning to Belgrade, Karamata began a period of remarkably intense work. The authors of\n[\n11\n]\nwrite:-\nThe most significant period of Karamata's work was from\n1927\nto\n1937\n, or perhaps between\n1929\nand\n1933\n. He was obsessed with mathematics then. In order to be free, in order to be able to think solely and uninterruptedly about mathematics, he scheduled all his classes\n(\nhe was an assistant professor then\n)\non one day, from eight o'clock in the morning until eight in the evening. And those courses were: Introduction to Analysis, Elementary Algebra, Algebra , Foundations of Geometry, Descriptive Geometry, Introduction to the Theory of Functions, and a Seminar. Although in ill health, he spoke without stopping, in a classroom where students and subjects followed each other in constant succession. One can see from this itself that when he worked he didn't let up. He made many innovations in the teaching process, which hadn't changed in decades. A great many of the students, accustomed to formality in the teaching process, were perplexed and dissatisfied. In the seminars, instead of the literature, textbooks and monographs, he used research papers and recent ones at that.\nKaramata was promoted to assistant professor in\n1930\nand in the following year he married the lawyer Emilija Nikolajevic\n(1906\n-\n1959)\n, the daughter of the Belgrade judge Borislav Nikolajevic. Jovan and Emilija Karamata had four children: two sons, Vladimir Karamata\n(\nborn in\n1934\n, who became an architect in Geneva\n)\nand Dimitri Karamata\n(\nborn in\n1935\n, who became a professor at the Medical Faculty of the University of Lausanne\n)\n, and twin daughters, Maria\n(1938\n-\n1940)\nand Katarina\n(1938\n-\n2005\n, who became a biologist in Geneva\n)\n. Emilija was fluent in French and German and she assisted Karamata by typing his papers and taking the role of secretary in his correspondence with other mathematicians.\nKaramata's mathematical output was very large with around\n120\npapers,\n15\nbooks\n(\nboth monographs and textbooks\n)\nand\n7\nworks about teaching. In addition to the fame from the\nHardy\n-\nLittlewood\ntheorem, he gained a world reputation for his work on slowly varying functions and his work on Tauberian theory. Tomic\n[\n1\n]\nwrites:-\nKaramata had the most effective period of scientific and teaching work during\n1929\n-\n1939\n, before World War II started. These ten years were marked not only by the appearance of his most important work, but also by attempts to introduce new directions in teaching. This has stimulated the awakening of mathematics in Yugoslavia which, until then, followed outdated fixed paths. Apart from greatest efforts in scientific work, Karamata also had other activities. He visited many universities in Europe and presented many lectures on his investigations. He participated in almost all of the largest scientific meetings and conferences between the two world wars, he met many scientists with whom he not only corresponded, but also had some sort of friendly relationship - among others several famous mathematicians of that time, such as:\nE Landau\n,\nKnopp\n,\nI Schur\n,\nFejér\n,\nM Riesz\n,\nP Montel\n,\nW Blaschke\n, ... His reviews in the 'Zentralblatt für Mathematik' and in the 'Jahrbuch über die Fortschritte der Mathematik' were noted for their criticism and conscientious comments.\nIn\n1937\nhe was promoted to associate professor but World War II, beginning in\n1939\n, proved a difficult time for Karamata. He had always tried to avoid expressing any political views, concentrating on his mathematics and his family. In a collaboration with a friend, he had, however, built a textile factory which began operation just before the start of the war. He had also set up a blacksmiths' workshop behind his own house. On\n6\nApril\n1941\nGermany, Italy and Hungary all invaded Yugoslavia and within a week Belgrade was occupied. The different races in Yugoslavia now reacted in different ways, too complicated to attempt to explain here. Karamata did not accept to rule of Milan Nedic's government, so was dismissed from his university position. Before the end of\n1941\n, the German Ministry of Education offered him a position in any German university of his choice, but he refused. He returned to his hometown of Zemun, now in the occupied Independent State of Croatia, and there with skill and bribery managed to survive the war years. He was arrested several times but, with textiles and output from the blacksmith shop, he was able to use bribery to ensure his release. Although the textile factory was supposed to work to support the invaders, somehow he managed to ensure it did not. When the invaders were expelled, Karamata was again arrested in the belief he had collaborated. Again he survived, but the textile factory was nationalised and he lost almost all of his blacksmiths' shop.\nWhen the war ended in\n1945\n, the University of Belgrade reopened. It was, however, a strange time since there were five years of students all wanting to begin their studies at the same time. Karamata worked hard to assist these students but times were difficult without most of his former friends and with new ideas about teaching but no new books. He attempted to help remedy the situation by publishing textbooks. His book\nTheory and application of Stieltjes integral\n(\nSerbian\n)\n(1949)\nwas reviewed by\nWilliam Feller\n:-\nA textbook containing a careful exposition of all details and a wealth of examples and counter-examples. There are four main parts. Some\n36\npages are devoted to general properties of functions of bounded variation. Next some\n70\npages treat the\nStieltjes\nintegral, mean value theorems, etc. The third and main part\n[\nabout\n110\npages\n]\nis called \"applications.\" Its chapter headings are, approximately:\n(1)\nFunctions of sequences of numbers,\n(2)\nApplications to infinite series,\n(3)\nGeneral summation formulas,\n(4)\nSpecial summation formulas,\n(5)\nDirichlet\nseries,\n(6)\nBehaviour of\nDirichlet\nseries on the boundary of the domain of convergence,\n(7)\nAnalytic continuation to the left of the abscissa of convergence. The last section\n[\nabout\n95\npages\n]\ncontains various notes and explanations concerning infinite series, calculus, and inequalities.\nThe review in\n[\n1\n]\nstates that Karamata's\nComplex Numbers with Applications to Elementary Geometry\n(\nSerbian\n)\n(1950\n,\n1960)\n:-\n... consists of two parts - 'Algebra of Complex Numbers' and 'Applications in Geometry'. In the first part, the notion of a complex number is informally introduced in relation to solving algebraic equations. Afterwards, the structure of complex numbers is based on the axiomatic method. The concepts of general algebra are mentioned, such as algebraic structures of rings - associative and commutative law, as well as the law of the neutral element and others. Using these identities, the other algebraic properties of the considered algebraic operations are formally derived. The field of complex numbers is defined as it is generally accepted today - complex numbers are ordered pairs\n(\ncomplexes\n)\nwith common definitions of addition and multiplication operations. Trigonometric and\nEuler\n's formulas for complex numbers are also introduced, as well as power and exponential functions for complex numbers.\nGiven Karamata's background, despite his attempts to fit in, it was inevitable that he would be considered \"a reactionary bourgeois capitalist\" by the Communist regime. His influence in the Department of Mathematics was minimal because he was seen as unfriendly towards the regime. He became frustrated and, despite being elected a full member of the\nSerbian Academy of Sciences and Arts\nin\n1948\n, and promoted to full professor at the University of Belgrade in\n1950\n, he decided to accept a full professorship at the University of Geneva in the following year\n[\n10\n]\n:-\nKaramata's commitment to young talent in Belgrade didn't slacken even after he moved to the University of Geneva in\n1951\n. On the contrary, it only intensified. During his frequent and regular visits to Belgrade he magnetically attracted young mathematics students who had never even seen him before, let alone heard him in the classroom. He would meet with them individually, always in regard to some mathematical problem, usually at the Hotel Majestic, or else frequently - in groups, at the Mathematical Institute of the\nSerbian Academy of Sciences\n. The conversation topics would be related to some specific problem\n)\nor to general developments in mathematics.\nKaramata's wife Emilija died in\n1959\nand after this he seems to have become less happy with the direction of the Department of Mathematics at Geneva. He made many trips to the United States, particularly as a visiting professor at the Mathematical Research Center in Madison, Wisconsin. There he collaborated with other mathematicians who, like him, had chosen to leave Yugoslavia. He now visited Belgrade less often only going to Yugoslavia to visit his brothers. Although aware that his health was deteriorating, he never complained and tried to avoid seeing medical doctors. He certainly did not realise how close he was to death, for he was organising a trip to the United States with plans to lecture at several universities. He became seriously ill and was admitted to hospital on\n13\nJuly\n1967\n. He died one month later from cancer. Both Karamata and his wife were heavy smokers and subsequently they both died prematurely from cancer. Following his wishes, his ashes were laid to rest in Zemun.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}