{
  "nome_completo": "Juan Manuel Cajigal y Odoardo",
  "nome_curto": "Juan Manuel Cajigal",
  "ano_nascimento": "1803",
  "ano_morte": "1856",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cajigal/",
  "lugar_nascimento": "Barcelona, Venezuela",
  "lugar_morte": "Yaguaraparo, Venezuela",
  "biografia": "Juan Manuel Cajigal\nwas the son of Gaspar de Cajigal y Pontón Gobernador de Cumaná\n(\nborn in Ávila, Spain in\n1773)\nand Matilde Odoardo Bouchet de Grand Pré\n(\nborn in Cumana, Venezuela\n)\nwho was ten years younger than her husband. Let us note at this point that there are two spellings of Juan Manuel's family name, Cajigal and Cagigal. Of the\n35\nreferences below that include his name in their title,\n21\ngive the spelling Cajigal and\n14\ngive Cagigal. We shall say a little more about this later in our biography. Juan Manuel had a brother Alejandro Manuel Cajigal.\nGaspar de Cagigal y Pontón was a Spanish army officer who was governor of Cumaná, Venezuela from\n1795\nand lived in Barcelona, Anzoátegui. At this time Venezuela was a colony of Spain but there was a strong movement for independence. Gaspar died on\n5\nJuly\n1810\n[\n25\n]\n:-\n... poisoned by the patriots in the midst of the independence events of\n1810\n. His house in Barcelona was burned by order of Colonel Agustín Arriojas. This forced Matilde to return to her family in Cumaná, where, a few years later, she  married the surgeon Alonso Ruiz Moreno.\nAfter the death of his father, Juan Manuel and his brother Alejandro Manuel were left in the care of Juan Manuel Cagigal de la Vega y Martinez Nino\n(1757\n-\n1823)\n, a cousin of Gaspar de Cajigal. This cousin was also a Spanish military man who fought against the Venezuelan independence fighters. He returned to Spain, landing in Cádiz on\n8\nFebruary\n1816\n, after a stay in San Juan de Puerto Rico. He took both Juan Manuel and his brother Alejandro Manuel to Spain with him.\nJuan Manuel studied as a cadet in the Corps of Mounted Hussars and then at the University of Alcalá de Henares. His love of mathematics took him to Paris in\n1823\nwhere he took courses at the École des Ponts et Chaussées and the Collège de France given by\nAugustin-Louis Cauchy\n,\nSylvestre François Lacroix\n,\nAdrien-Marie Legendre\n,\nSiméon Denis Poisson\nand\nPierre-Simon Laplace\n. He showed outstanding abilities and he was offered a position as professor of mathematics at the Complutense University of Madrid. He decided, however, to return to South America. At the École des ponts et chaussées, Cajigal had met Lino de Pombo, a Columbian engineer and diplomat, who had written on\n13\nJanuary\n1828\nto General Carlos Soublette, the Minister of War of Colombia, saying that Cajigal was a young man of great talents who would be a great asset to Columbia. We note that at this time Venezuela was effectively a province of Colombia.\nHaving completed his studies in Paris, Cajigal returned to Venezuela where, in\n1829\n, he approached José María Vargas who had been appointed by Simón Bolívar to restore the Royal and Pontifical University of Caracas. Vargas had created the new Central University of Venezuela in Caracas and was keen to employ Cajigal as the first professor of mathematics. He wrote to the Minister of Education\n(\nsee\n[\n35\n]\n)\n:-\nBy one of those lucky chances to the country, Juan Manuel Cajigal has appeared among us, a young man filled with the noble desire to be useful to his country, whose record proves his outstanding abilities are the best criterion in these inquiries, they make him a precious find for the country and present him as the most calculated to fill the indicated position.\nThe political situation was, however, very difficult at this time and there was no response from the Minister of Education, so Cajigal went to Cumaná where he became the secretary of General José Francisco Bermúdez, the military chief of that province.\nAlthough there had been no immediate response to Vargas's approach to the Minister of Education concerning Cajigal, by\n1830\nthings began to move when Congress met in Valencia, and decreed on\n14\nOctober to establish a Military and Mathematics Academy in Caracas. The purpose of the Academy was to give mathematical and military training to men in both the civil and military fields. The Military and Mathematics Academy was formally founded on\n26\nOctober\n1831\nas part of the University of Caracas and Cajigal took up his duties as Director of the Academy on\n4\nNovember\n1831\n. It is not surprising to see that the syllabus which was set up by Cajigal was based on the teaching that he had experienced in Paris. He created a cycle of three courses, each course being two years in length.\nThe first of the three courses taught arithmetic, algebra and geometry in the first year, then conic sections, plane and spherical trigonometry, and topography in the second year. The second of the three courses taught analytic geometry, descriptive geometry\n(\nwith applications to shadows, perspective and stone cutting\n)\n, and differential calculus in the first year, followed by integral calculus, and analytic mechanics\n(\nwith its applications to machines, architecture and other civil works\n)\nin the second year. The third course was designed for military students aspiring to the Corps of Engineers. The first year topics were tactics of weapons in general, artillery, strategy, making a military camp, and military bridges. The second year involved eight months studying field fortification and mines while the remaining four months involved practical skills learning how to build batteries, parapets, etc. There were also technical drawing classes which were taken by all students.\nCajigal spent ten years directing the Military and Mathematics Academy. In December\n1832\nhe made a plea for the setting up of a library and the purchase of instruments. He wrote\n(\nsee for example\n[\n13\n]\n)\n:-\nMost of the students cannot afford the classic works, nor the academic collections, because of their great cost, and for Venezuela it would be very easy to allocate two thousand pesos for the time being to buy books and instruments ...\nHe was also very concerned about the well-being of his students, realising that to be able to profit from the teaching, the students required good living conditions. He wrote to the Secretary of State in the Offices of War and Navy\n(\nsee for example\n[\n13\n]\n)\n:-\n... it will not be out of place to include my opinions about what can be done to improve the situation of the students and offer them the necessary incentives so that they continue with zeal and consecration the important and difficult studies that must form their institution. It is not enough that the Government, desirous of giving impetus to public education, and with the wise object of forming a body of engineers, has achieved the establishment of a school, fixed the subjects that must be taught there and indicated the final reward for those who apply and laboriously reach the term indicated for their incorporation into it. It is necessary, in addition, to ensure a comfortable existence while the studies last, that by having them sheltered from misery, leave them the necessary time to dedicate themselves exclusively to the tasks that are demanded.\nDuring his time running the Military and Mathematics Academy, Cajigal was also involved in other activities. On the academic side he directed the Literature Chair at the Central University of Venezuela. He installed the first telescopes in Venezuela when he founded the first astronomical observatory in the country in Caracas and he computed the first astronomical charts in the country. But his work was not restricted to academic issues for he became involved in politics, the first time in\n1833\nwhen he became Deputy for Caracas. This was a difficult period following the separation of Columbia into various countries such as Venezuela. The Michelena-Pombo Treaty was an agreement drawn up to deal with issues such as friendship, trade, and navigation rights between Venezuela and Columbia. Cajigal worked on evaluating this controversial treaty which was signed on\n14\nDecember\n1833\n.\nHe was a founding member and correspondence secretary of the Economic Society of Friends of the Country in\n1829\n,\n1830\nand\n1841\n. In the\nMemoirs\nof that Society he published an article about specimens of flora he had collected in\n1833\n. For an extract from a talk he gave to the Economic Society of Friends of the Country in\n1839\n, see\nTHIS LINK\n.\nHe also took part in debates on the adoption of the metric system and the immigration of workers from the Canary Islands. A second involvement in politics came in\n1835\nwhen he became a senator for Barcelona in Anzoátegui.\nThe year\n1835\nwas a difficult one for during that year the Military and Mathematics Academy had to close for a while. José María Vargas, who had played a role in Cajigal's career, became president of Venezuela in that year. There was, however, an attempted coup led by Pedro Carujo which began as an insurrection on\n7\nJune\n1835\n[\n3\n]\n:-\nThe Academy of Mathematics suspends its activities and Cajigal himself must abandon books and scientific instruments to lead a battalion destined to defend the civilian and legitimate government.\nThe\nDictionary of the History of Venezuela\ngives information about some other of Cajigal's activities\n[\n13\n]\n:-\n... during this time he worked on the War and Navy, and Foreign Relations commissions. His work in Congress was linked to issues as important such as the Michelena-Pombo Treaty, the Organic Law of the Provinces, and the exile of Archbishop Ramón Ignacio Méndez. He also acted in the Electoral Colleges, in the Provincial Council, and in the General Directorate of Public Instruction\n(1840)\n.... He founded and edited, together with José Hermenegildo García and Fermín Toro, the newspaper 'Correo de Caracas'\n(1838\n-\n1841)\n. He wrote about the layout of the highway to the valleys of Aragua, on the Caracas-La Guaira highway, and was the first to point out the advantages of the railway between that port and the capital.\nGiven the remarkable number of different activities that Cajigal was undertaking, it is not too surprising that his mental health began to deteriorate. In\n1841\nhe left the Military and Mathematics Academy and travelled to London as secretary to Alejo Fortique\n(1797\n-\n1845)\n, Minister of Venezuela in London. He soon moved to Paris as an official of the Government of Venezuela, spending a couple of years there. In Paris he met with colleagues who had been his friends when he had studied there in the\n1820\ns. They entertained him with a banquet and told him that he had made a mistake returning to Venezuela after his studies. They were convinced that had he would have had a better career had he remained in Europe as a professor of mathematics\n[\n8\n]\n:-\nIn a burst of nationalistic enthusiasm, Cajigal replied that he preferred the glory of founding mathematical studies in his homeland to all the honour that standing out as a man of science in Paris could bring him. To reciprocate the entertainment of his hosts, Cagigal ordered the manufacture of gold and silver tableware engraved with his initials: JMC. The Venezuelan also dedicated himself to updating his scientific knowledge, visiting museums and libraries and participating in Parisian social life.\nIn\n1843\nCajigal returned to Venezuela but by this time his mental health had deteriorated further. Some have blamed this on a passion he had for a young theatre artist, Marie Duplessis, who had rejected him but there is no solid evidence for this. Back in Venezuela Cajigal retired from public life and from all his teaching activities. He spent the last ten years of his life in Yaguaraparo on the Paria Peninsula in the Sucre State of Venezuela. He spent several years in a state of melancholy silence before he finally passed away\n[\n8\n]\n:-\nThe misfortune began with calm, shy monomania. He believed that people were going to persecute him, that they wanted to kill him. And those ideas were slowly isolating such a luminous intelligence from the scientific and social world.\nFollowing his death he was buried in the Río Caribe Church but his remains are no longer there. Maximilian Kopp Marcano writes\n[\n24\n]\n:-\nUnfortunately, and like other great men from the East such as Antonio José de Sucre and José Antonio Anzoátegui, the remains of the Barcelona wise man Juan Manuel Cagigal are not in Caracas, in the National Pantheon. In\n1889\n, the then President of Venezuela, Doctor Juan Pablo Rojas Paúl, decreed his transfer to the temple reserved for illustrious Venezuelans, for which his bones were exhumed from the Río Caribe Church where they had rested since his death, next to his mother and his stepfather, however, as confirmed by research carried out in\n1952\nby his biographer Don Ángel Grisanti for the National Academy of History, the remains of Juan Manuel Cagigal were lost, but not his indelible example of dignity, dedication and work for current generations.\nCajigal is rightly credited as the founder of mathematical and engineering studies in Venezuela. He did not, as far as we know, produce any original mathematics, at least he certainly never published results from original research. He did, however, write a\nMemoir on Definite Integrals\n. It is not known when he wrote that work but it originally circulated as a handwritten text for students in his Military and Mathematics Academy. The book follows closely\nCauchy\n's approach to the subject and was clearly strongly influenced by courses that Cajigal had taken while he had been a student in Paris. Walter Beyer discusses this work in detail in\n[\n5\n]\ngiving this Abstract:-\nThis study consists of a description and critical analysis of the book 'Memoria sobre las integrales limitadas'\nⓉ\n(\nMemoir on definite integrals\n)\n, written by Juan Manuel Cajigal\n(1803\n-\n1856)\nand published posthumously in\n1929\n. Prepared on a date not yet precisely determined, it is the only mathematical writing of his that still exists. It initially circulated in handwritten form and was used as a text in the Academy of Mathematics of Caracas. His 'Memoria' does not pretend to be an original contribution to mathematics having a didactic purpose and to disseminate the advances in Integral Calculus of its time, closely following\nCauchy\n's ideas.\nCajigal also wrote the texts\nTreatise on astronomy\nand\nTreatise on elementary mechanics\nfor use by students but neither has been published.\nToday Cajigal's name is remembered for Avenida Cajigal and in Caracas as well as Avenida Cajigal in Barcelona, Anzoátegui. The Cagigal Naval Observatory is named for him. Asteroid\n12359\nwas named \"Cajigal\" in his honour.\nFinally we promised at the beginning of this article to say a little about the fact that his name appears sometimes as Cajigal and sometimes as Cagigal. The version Cajigal is an older spelling which changed over time to Cagigal. We suspect that he was given the name Cajigal when he was born but one fact is certain and that is that he signed himself using the form Cagigal. Several versions of his name written in his own hand still exist and they quite definitely are Cagigal with a 'g' instead of a 'j'.\nLet us end with this description by José Sant Roz of how the brilliant Cajigal was destroyed by the times through which he lived\n[\n34\n]\n:-\nJuan Manuel Cajigal was not a man with the qualities of a warrior, nor of a politician, despite the fact that he suffered through an era in which without these two \"qualities\" it was practically impossible to survive. Still, with all the \"progress\" of which we boast, we see how certain luminaries of science, certain people anointed with intellect, find it impossible to escape from the small world of partisan diatribe. They end up changing the solitary rooms of libraries and laboratories, the silent battle of ideas, for the bitter confrontation with the personal interests of groups possessed of foolish ambitions: the tropical caprice of leadership, the enjoyment of honours and prebends.\nIt was impossible for Juan Manuel Cajigal to overcome the stupidity of his time, and his tragic end is nothing but the result of a man before the defeated vision of his Destiny. He is a man who watches his talent shattered by the pack of dogs playing games. His life and his talent is irretrievably lost. He never had peace to think, to order his ideas in the midst of the demanding discipline required by the study of the exact sciences.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}