{
  "nome_completo": "Juan de Ortega",
  "nome_curto": "Juan de Ortega",
  "ano_nascimento": "1480",
  "ano_morte": "1568",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ortega/",
  "lugar_nascimento": "Palencia (now Spain)",
  "lugar_morte": null,
  "biografia": "Juan de Ortega\nwas a member of the Dominican Order which had been founded by Dominic, a priest of the Spanish diocese of Osma, in\n1215\n. It was one of the major Orders within the Roman Catholic Church, and it was very active in the universities where its members were soon concentrated. The Dominican order was a collection of priests, organized in provinces under a master general. Members of the Order were sent wherever they were needed. Often those who wished to teach in universities in the fifteenth century would join the Dominican Order, for those in the Order taught not only theology but also philosophy and the other ancient branches of learning.\nJuan de Ortega had no university education and, as a Dominican with a vow of poverty, needed little in the way of an income as a Friar. He was assigned by his superiors to the province of Aragon where he earned his living teaching commercial arithmetic, although not in a university. Although we do not have details of his travels we do know that he was abroad at various times teaching both in Spain and Italy. Almost certainly had a teaching post within the Dominican Order but he tutored privately as well.\nOrtega's book\nA Tradado subtilisimo d'arithmetica y de geometria\nⓉ\n(\nA very subtle treatise on arithmetics and geometry\n)\npublished in Barcelona in\n1512\ncovered commercial arithmetic and the rules of geometry. The first part of the book contains practical rules for calculations necessary for trade and includes conversion tables between the different Spanish currencies. At that time each of the Spanish provinces had their own currency and conversion between them was clearly an essential for anyone who was trading goods. In the second part of the book, devoted mostly to geometry, Ortega gives a method of extracting square roots very accurately using\nPell\n's equation, which is surprising since a general solution to\nPell\n's equation does not appear to have been found before\nFermat\nover\n100\nyears later. The book achieved fame and was published in several cities including a French version in Lyon in\n1515\n, being the first commercial arithmetic to be published in French. It was also published in Rome in\n1515\n, Messina in\n1522\nand Seville in\n1552\n.\nVery little is known about Ortega and it appears that his importance rests entirely on the interesting method for taking square roots. It is not easy to assess how significant this is since different historians place different significance on it. For example in\n[\n5\n]\nSesiano describes a similar algorithm for the approximation of surds written by an unknown author in Palmiers around\n1430\n.\nChuquet\nalso devised a similar algorithm which appears in\nTriparty\nwhich was probably written no later than May\n1484\n.\nOrtega also published\nCursus quattuor mathematicarum artium liberalium\nⓉ\n(\nCourse of four liberal arts: mathematics\n)\npublished in Paris in\n1516\n.",
  "math_areas": [
    "Geometry"
  ]
}