{
  "nome_completo": "Juha Heinonen",
  "nome_curto": "Juha Heinonen",
  "ano_nascimento": "1960",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heinonen/",
  "lugar_nascimento": "Toivakka, Finland",
  "lugar_morte": "Ann Arbor, Michigan, USA",
  "biografia": "Juha Heinonen\n's parents were Liisa and Vilho Heinonen. He was born in Toivakka, which is a small town about\n25\nkm southeast of the city of Jyväskylä in south-central Finland. Juha's mother single-handedly ran the Toivakka old folks home and it was there that Juha and his sister Maritta were brought up. His father was a lumberjack, an important trade in the heavily forested area, but he was also involved in local politics representing the socialists. While at high school, Heinonen was passionate about athletic pursuits, especially cross-country skiing. At the age of sixteen years he became the National Finnish\n5\nkm Champion in his class. After graduating from high school, Heinonen was conscripted into the Finnish army to serve as an officer for a year.\nThe first Finnish teachers' training college was founded in Jyväskylä in\n1863\n. In\n1934\nit became a pedagogical institute that in turn became the University of Jyväskylä in\n1966\n. Heinonen entered this university to study mathematics after serving for a year in the army. He was awarded his Candidate's Degree in\n1984\nand was appointed as a Research Assistant in the\nFinnish Academy of Science and Letters\nwhile he undertook research at the University of Jyväskylä advised by Olli Martio. In\n1985\nhe spent a semester in the United States as a visiting graduate student at the University of Michigan at Ann Arbor. In\n1986\nhe made a research visit to the\nUSSR Academy of Sciences\nat Novosibirsk. He completed his thesis on non-linear potential theory in\n1987\nand in the same year his first publication appeared, namely\nEstimates for F-harmonic measures and Oksendal's theorem for quasiconformal mappings\nwritten jointly with his thesis advisor Olli Martio.\nFollowing the award of his doctorate, Heinonen continued to work as a research assistant for the Academy until\n1988\n. He also made a research visit to the Deutsche Forschunsgemeinschaft at Bonn in\n1987\n-\n88\nfollowed by a visit to the Centre de Recerca Matemática in Barcelona. The year\n1988\nwas a remarkable year for Heinonen in terms of his publications, for no fewer than six of his publications appeared. Three were written jointly with Tero Kilpeläinen:\nA-superharmonic functions and supersolutions of degenerate elliptic equations\n;\nPolar sets for supersolutions of degenerate elliptic equations\n; and\nOn the Wiener criterion and quasilinear obstacle problems\n. The others were the single author publications\nBoundary accessibility and elliptic harmonic measures\nand\nAsymptotic paths for subsolutions of quasilinear elliptic equations\n, and the paper\nOn quasiconformal rigidity in plane and space\nwritten with K Astala. In the autumn of\n1988\nhe was appointed to a three-year postdoctoral Assistant Professorship at the University of Michigan\n[\n3\n]\n:-\nWhen Heinonen originally came to the United States, his intention was to stay for a short period. His plans changed when he met his future wife,\nKaren Smith\n, a first-year graduate student of mathematics, who also arrived in Ann Arbor in the fall of\n1988\n. They married in\n1991\n.\nIn\n1992\nHeinonen's postdoctoral Assistant Professorship came to an end and he was appointed again as a Research Assistant in the Finnish Academy of Science and Letters. He also accepted a tenure track Assistant Professorship at the University of Michigan. Heinonen's wife Karen, completed her doctorate at the University of Michigan in\n1993\nand in the following year she was appointed as a Moore Instructor at the Massachusetts Institute of Technology. Heinonen was promoted to Associate Professor at Michigan in\n1994\nand in that year he and his wife both went to Boston so that she could fill the Moore Instructorship; they remained there for three years. In\n1997\nboth returned to Michigan and in\n2000\nHeinonen became a full professor at Michigan.\nHeinonen's research record was outstanding which was recognised by the award of an Alfred P Sloan Foundation Grant in\n1992\n, and National Science Foundation Grants during\n1989\n-\n1991\n,\n1991\n-\n1993\n,\n1994\n-\n1995\n, and\n1996\n-\n1999\n. He was awarded the Excellence in Research Award by the University of Michigan in\n1997\n. Much of his work involved quasiconformal mappings so it is appropriate to quote a few sentences from\n[\n1\n]\nwhere Heinonen gives an excellent overview of the topic:-\nQuasiconformal mappings are generalizations of conformal mappings. They can be considered not only on\nRiemann\nsurfaces, but also on Riemannian manifolds in all dimensions, and even on arbitrary metric spaces. Quasiconformal mappings occur naturally in various mathematical and often a priori unrelated contexts. The importance of quasiconformal mappings in complex analysis was realized by\nAhlfors\nand\nTeichmüller\nin the\n1930\ns.\nAhlfors\nused quasiconformal mappings in his geometric approach to\nNevanlinna\n's value distribution theory. He also coined the term \"quasiconformal\" in his\n1935\nwork on 'Überlagerungsflächen' that earned him one of the first two\nFields medals\n.\nTeichmüller\nused quasiconformal mappings to measure a distance between two conformally inequivalent compact\nRiemann\nsurfaces, starting what is now called\nTeichmüller\ntheory. ... In the past ten years, it has become known that a full-fledged quasiconformal mapping theory exists in rather general metric measure spaces. This theory has subsequently been applied to new rigidity studies in geometric group theory. There is also a budding theory of quasiconformal mappings in infinitedimensional\nBanach\nspaces, based on the concept of quasisymmetry. ... Quasiconformal mappings are fascinating objects in mathematics. They are flexible enough to be ubiquitous, yet they harbour enough subtle analytic and geometric properties so as to be useful in a variety of contexts.\nHeinonen published two important books:\n(\nwith Olli Martio and Tero Kilpeläinen\n)\nNonlinear Potential Theory of Degenerate Elliptic Equations\n(1993)\n; and\nLectures on Analysis on Metric Spaces\n(2001)\n. A review of the first of these begins:-\nThis excellent book is the first monograph dealing with a potential theory of second-order quasilinear elliptic equations of\n[\na certain\n]\ntype ... It contains results of this theory obtained in the past ten years generalizing the classical theory in a natural way.\nA new edition, containing four additional chapters, was published in\n2006\n. The second book mentioned above is described by Christopher Bishop. We quote a couple of sentences from the beginning and the end of his review:-\nThis very interesting book deals with how various concepts of Euclidean analysis\n(\ne.g., gradients,\nSobolev\nspaces,\nPoincaré\ninequalities, quasiconformal mappings, etc.\n)\ncan be extended to more general metric spaces. The book is based on a\n1996\ncourse given by the author at the University of Michigan and it retains a comfortable, conversational style with numerous remarks, comments, references and conjectures. ... The author summarizes and describes an area which has been very active recently and does an excellent job of giving the flavour and main ideas in the field. It is a well-written and enjoyable book containing something for both beginners and experts and deserves to be on the shelf of anyone interested in the interplay of analysis, geometry and topology.\nIn addition to these books, a\n44\n-page pamphlet\nGeometric embeddings of metric spaces\nwas published in\n2003\nbeing notes from a graduate level course Heinonen gave at the University of Jyväskylä. Matti Vuorinen writes:-\nThe purpose of this course was to introduce the students to several aspects of metric geometry. Some of the key notions are doubling spaces,\nGromov\n-\nHausdorff\nconvergence, different notions of dimensions and bi-\nLipschitz\nembeddings.\nIn August\n2004\nHeinonen lectured on\nLipschitz\nanalysis at the\n14\nth\nJyväskylä Summer School and the notes were published in a\n77\n-page pamphlet.\nIn\n2002\nHeinonen gave the invited lecture\nThe branch set of a quasiregular mapping\nat the International Congress of Mathematicians held in Beijing. This was only one of many invited address he gave for, in addition, he gave plenary addresses at the\nRolf Nevanlinna\nColloquium in Ann Arbor, Michigan in\n1993\n, at the\nRolf Nevanlinna\nColloquium in Lausanne, Switzerland in\n1997\n, at the\nAhlfors\n-\nBers\nColloquium at the University of Connecticut in\n2001\n, and at the\nAhlfors\nCentennial in Helsinki, Finland in\n2007\n. He also gave invited addresses at the XVIIth Geometry Festival at the Courant Institute in New York in\n2002\nand at the\nAmerican Mathematical Society\nmeeting in Boulder, Colorado in\n2003\n. Another way in which he made a major contribution to mathematics was through being an editor of the\nProceedings\nof the\nAmerican Mathematical Society\nfrom\n2000\n. His outstanding mathematical contributions were further recognised in\n2004\nwhen he was elected to the\nFinnish Academy of Science and Letters\n.\nWe have already mentioned Heinonen's love of sport and his cross-country skiing achievements while at high school. He kept this sporting interests after going to the United States\n[\n2\n]\n:-\n... he travelled around Finland and North America to compete in orienteering, placing in nearly every major US competition he entered. He is widely remembered in US orienteering circles for winning both the US and the North American gold medal in his class in the year\n2000\n, but also for his outgoing and upbeat personality that made competing with him a joy.\nWe have mentioned above that Heinonen married the mathematician\nKaren Smith\nin\n1991\n; they had three children, a daughter Sanelma\n(\nborn in\n1998)\nand boy-girl twins Tapio and Helena\n(\nborn in\n2003)\n. We note that Heinonen's family called him Isi and they lived:-\n... in a beautiful old house built in\n1910\nin Ann Arbor, Michigan, less than a kilometre from downtown.\nLet us give a quote to understand Heinonen's character and interests\n[\n2\n]\n:-\nJuha was a vibrant, balanced, satisfied person. He loved the outdoors, particularly Michigan autumns and Finnish winters. A devoted father, Juha read animatedly to his children, taught them to bake authentic Finnish rye bread, and shared his love of nature by taking them on hiking trips from the days he carried them on his back. He also enjoyed the company of his children on everyday errands, and was often spotted with a child on the AATA bus or on his bike-seat. His Finnishness remained deeply important to him; he taught his children, and his wife, to love Finland and to speak Finnish. Each time he spoke of his family, the pride was evident through the twinkle in his eye and his broad grin.\nHeinonen died at the age of\n47\n'after a brief but courageous battle with kidney cancer'. The Department of Mathematics at the University of Michigan established the Juha Heinonen Memorial Graduate Student Fellowship in his honour. An international conference in his memory\nQuasiconformal Mappings and Analysis on Metric Spaces\nwas organised at the University of Michigan, Ann Arbor in May\n2008\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}