{
  "nome_completo": "Irenée-Jules Bienaymé",
  "nome_curto": "Jules Bienaymé",
  "ano_nascimento": "1796",
  "ano_morte": "1878",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bienayme/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jules Bienaymé\n's first name of Irenée is usually written Irénée but the form without an accent was used by the subject of this biography and thereafter became a family tradition. However, he did not use the name, always using the name Jules. We note that his father used the spelling Bienaimé as did Jules until\n1812\nwhen he changed the spelling to Bienaymé. His parents, Jean Charles Bienaimé and Houdar de la Motte Pierre Marie, were married in the church of St Roch in Paris on\n3\nJuly\n1795\n. They had two children; Irenée Jules\n(\nthe subject of this biography\n)\nwas born at the rue de la Loi\n(\nnow called rue de Richelieu\n)\nand his brother Charles Philippe Aimé was born on\n4\nFebruary\n1800\n. The city of Bruges had become French in\n1794\nand French officials were sent there to administer the city. Jean Charles Bienaimé became the chef des bureaux du secrétariat in\n1803\n. In this capacity he got to know Napoleon Bonaparte who lodged in Bruges in\n1804\nand again in\n1810\n. Jules attended the Lycée impérial at Bruges and the city had happy memories for him. He wrote\n(\nin a letter to\nQuetelet\nwritten on\n25\nJune\n1861)\n[\n4\n]\n:-\nI can't forget Bruges, and regret not being able to go there again. Perhaps it would not be particularly cheerful in my old age to revisit the places of my happy childhood.\nIn\n1811\nthe Bienaimé family returned to Paris where Jules attended the Lycée Louis-le-Grand. Both brothers changed the spelling of their name to Bienaymé early in\n1812\n. After taking part in the defence of Paris in\n1814\n, Jules Bienaymé entered the École Polytechnique in the following year. This was not an easy time in Paris, as France lost its Empire and the monarchy was restored, and the École Polytechnique was closed in\n1816\ninterrupting his studies. Also in\n1816\nJean Charles Bienaimé died and, as Jules became responsible for the family, he took a job at the Ministry of Finances. In\n1819\nBienaymé, wanting to make a career in science rather than administration, became a lecturer in mathematics at the military academy of St Cyr. However, he only held the post from\n1\nNovember\n1819\nto\n10\nFebruary\n1820\nwhen he returned to his Civil Service job in the Administration of Finances. It is not clear why he left his teaching post although we do know that the director of the academy wrote that he had \"not having found conditions compatible with his tastes and habits\". There do seem to be more reasons why he left and one seems related to\nSiméon Denis Poisson\n, who had chosen him for the post, for from that time on Bienaymé became openly hostile to him. In the Ministry of Finances he was soon promoted to inspector, then in\n1834\nhe became inspector general.\nIn the late\n1820\ns, rather remarkably, the Bienaymé brothers married two sisters. Jules married Frangoise Gabrielle Clemence Harmand and his brother Charles Philippe Aimé married Jeanne Justine Lucie Harmand. Their wives were daughters of the Philippe Nicolas Harmand who was a family friend and had signed Jules' birth certificate. They had long known each other for the Bienaymé and Harmand families had shared the same house in Paris for a while. Jules and his wife had two sons and three daughters, The children, in order of birth, were: Lilia Nathalie Françoise Laure, Lucie Gabrielle Léonie\n(\nborn\n4\nSeptember\n1831)\n, Arthur François Alphonse\n(\nborn\n13\nJanuary\n1834)\n, Louis Irenée Alexis\n(\nborn\n8\nApril\n1836)\n, and Adrienne Clementine Laure\n(\nborn\n19\nJune\n1840)\n. Despite not being in the academic world, Bienaymé produced mathematical work of remarkable ingenuity but\n[\n14\n]\n:-\n... characterised, to the frustration of the reader, by lack of mathematical proofs for assertions sometimes far ahead of their time, ...\nHe explained in a letter written to\nAdolphe Quetelet\non\n21\nApril\n1846\n[\n14\n]\n:-\n... that his everyday work and the state of his health do not permit him to complete the preparation of his writings for publication, and that he works seriously on applications which are of interest to both of them. His ill-health, especially his trembling hands, were to plague him to the end of his life.\nAfter the revolution of\n1848\nBienaymé was forced to retire from the Ministry of Finances for political reasons as the new regime installed their own people in top posts. Shortly after he left the Civil Service he was asked to give a lecture course on\nprobability\nat the Faculty of Sciences. In August\n1850\nhe was reinstated into the Ministry of Finances as Inspecteur général des finances but he resigned for a final time in April\n1852\n. Eugene Seneta writes in\n[\n14\n]\nthat Bienaymé's:-\n... last home\n(\nin\n1866)\nwas at rue de Fleurus, No\n1\n, just before the western entrance of Jardin du Luxembourg and a short walk from the great church of St Sulpice, at which a commemorative service was held a year after his death. He died on\n19\nOctober\n1878\nand is buried at the Cimitière de Montparnasse, Paris, in a modest family grave at Division\n10\n, Ligne\n4\nSud, Numéro\n12\nouest.\nIn\n1852\nBienaymé was elected to the Paris\nAcademy of Sciences\nand for the next\n23\nyears he was the referee for the statistics prize. He was also a founding member of the\nSociété Mathématique de France\nbecoming president of the Society in\n1875\n. He was elected to the Société Philomatique de Paris in January\n1838\nand, from\n1837\nto\n1845\n, much of his published material appears as reports of his addresses to meetings of the Society, reported in its journal\nL'Institut\n.\nIn fact Bienaymé only published\n23\narticles during his life and half of these were published in obscure places such as the\nL'Institut\n. The early articles discuss demography and life tables. He also wrote on the size of juries and the majority need for a conviction. In fact the jury system in France at that time was based on\nLaplace\n's conclusions but it was under attack by\nPoisson\n. Bienaymé supported\nLaplace\non this issue. In fact Bienaymé supported\nLaplace\nin general since it was\nLaplace\n's\nThéorie analytique des probabilités\nⓉ\n(\nAnalytic theory of probabilities\n)\n(1812)\nthat was the biggest influence on Bienaymé's scientific thinking throughout his life. One of his many contributions was to generalise the\nLaplace\nmethod of least squares - in fact much of his work can be thought of as extending and generalising ideas introduced by\nLaplace\n.\nAn excellent linguist, Bienaymé translated\nPafnuty Chebyshev\n's work from Russian into French. In fact Bienaymé was a friend of\nChebyshev\n(\nthey first met in October\n1852)\n, and also of other important mathematicians such as\nAdolphe Quetelet\n,\nAntoine Cournot\nand\nGabriel Lamé\n. In fact\nQuetelet\nand Bienaymé were born in the same year and corresponded regularly between\n1846\n(\nthe year in which they first met\n)\nand\n1871\n. On the other side, there were a number of mathematicians who Bienaymé seems particularly keen to criticise, such as\nAugustin-Louis Cauchy\n,\nSiméon Poisson\nand\nJoseph Bertrand\n. He argued with\nCauchy\nover the least squares method and, in\n1842\n, he criticised\nPoisson\n's law of large numbers. Bienaymé was quite wrong in his criticism of\nPoisson\nbut in general he was years ahead of his time in the depth of his statistical ideas.\nBienaymé published the Bienaymé-\nChebyshev\ninequality, which was used to give a very simple and precise demonstration of the generalised law of large numbers, in his important paper\nConsidérations à l'appui de la découverte de Laplace sur la loi de probabilité dans la méthode des moindres carrés\nⓉ\n(\nConsiderations to support the discovery of Laplace on the probability distribution in the least squares method\n)\n(1853)\n.\nChebyshev\npublished the inequality in a Russian paper and its French translation which both appeared in\n1867\n. The French paper was published in\nLiouville\n's\nJournal de Mathématiques Pures et Appliquées\nand the editor clearly realised that the inequality had been given by Bienaymé fourteen years earlier since he reprinted Bienaymé's\n1853\npaper immediately before\nChebyshev\n's paper\n[\n14\n]\n:-\nIt is a pity that their common interest in the Inequality somehow \"slipped through the cracks\" in the early contacts between Bienaymé and\nChebyshev\n. Possibly the Inequality was regarded by Bienaymé as a minor result compared with his main themes of linear least squares and Laplacian defence.\nChebyshev\n's recognition of its significance and its clear statement has, at any rate, always been a defensive point in his favour stressed by some historiographers.\nBienaymé also worked on independent binomial trials and his most important contribution was his statement of the criticality theorem for simple branching processes which he gave in\n1845\n- eventual extinction of a family name has probability one if and only if the mean number of male children is one or less. His work on this predates that by\nGalton\nand Haldane.\nDavid Kendall\nwrites in\n[\n12\n]\n(\nreviewing C C Heyde and E Seneta's book\n[\n1\n]\n)\n:-\nSome years ago the present authors\n[\nHeyde and Seneta\n]\nmade the startling discovery that the criticality theorem for branching processes, previously assigned to the year\n1873\n, was in fact known in\n1845\n, and indeed that earlier version due to Bienaymé is complete and correct, unlike the\nGalton\n-Watson version which contains an error that was not cleared up for many years. This discovery necessitated the re-writing of the history of branching processes ...\nHe also gave a simple test for randomness of observations on a continuously varying quantity. He stated, and gave a proof which leaves something to be desired, of a sophisticated limit theorem which was studied again by\nvon Mises\nin\n1919\n. Eugene Seneta writes in\n[\n14\n]\n:-\nIt is also clear\n[\nthat Bienaymé\n]\nunderstood the idea of covariance of random variables in\n1842\n, and had a notion of conditional expectation.\nEugene Seneta also tries to explain why Bienaymé's brilliance has been forgotten\n[\n14\n]\n:-\nContributing to his being largely forgotten were the facts that Bienaymé was modest as regards his own achievements, made no great efforts to assert his priority, and was ahead of his time in mathematical statistics. He left no disciples, not being in academia; and wrote no book.",
  "math_areas": [
    "Calculus",
    "Logic",
    "Statistics"
  ]
}