{
  "nome_completo": "Jules Tannery",
  "nome_curto": "Jules Tannery",
  "ano_nascimento": "1848",
  "ano_morte": "1910",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tannery_Jules/",
  "lugar_nascimento": "Mantes-sur-Seine, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jules Tannery\n's parents were Delphin Tannery, who was an engineer working for the French railways, and Opportune Perrier. Delphin and Opportune Tannery had three children, the eldest being a daughter while the second oldest was\nPaul Tannery\nand Jules was the youngest. Delphin Tannery's job with the railways involved him moving around the country depending on where railways were being constructed. The family moved from Mantes to Redon in Ille-et-Vilaine in the Brittany region of northwestern France. He later worked at Mondeville close to Caen.\nJules was brought up in a deeply Christian family. His parents Delphin and Opportune Tannery, who were Roman Catholics, gave him his early education, but he was also greatly influenced at home by his elder brother\nPaul Tannery\nwho had a passion for classics and philosophy. Jules attended schools in several towns as his parents moved because of his father's job, but he completed his secondary education at the Lycée at Caen.\nAt Caen Jules proved himself to be a truly outstanding pupil, winning prizes and delighting his parents who were very keen to see their sons achieve great things with their education. Completing his secondary education in\n1866\n, Tannery sat the entrance examinations in science for both the École Normale Supérieur and the École Polytechnique. Having attained the highest possible grade in both examinations, he had the choice of the two schools and, perhaps rather surprisingly, chose the École Normale Supérieur.\nGraduating in\n1869\nand placed top of among all the graduates in that year, Tannery became a mathematics teacher at the Lycée in Rennes, then in\n1871\nhe moved to teach the Lycée at Caen. This proved to be a difficult time for him, for he had been given a very strict Christian upbringing, but had became deeply interested in the culture of the ancient scholars. In particular he admired the ideas of Lucretius, a Latin poet and philosopher who lived in the first century BC. Lucretius's ideas on ethical and logical doctrines caused Tannery to undergo a religious crisis as he found himself drawn towards the philosophy of this pagan writer.\nIn\n1872\nTannery returned to Paris and began teaching at the École Normale Supérieur. He had left the school without studying for his doctorate and, now that he had returned there,\nHermite\nencouraged him to undertake research in mathematics. He was awarded his doctorate in\n1874\nfor his thesis\nPropriétés des intégrales des équations différentielle linéaires à coefficients variables\nⓉ\n(\nProperties of the integrals of linear differential equations with variable coefficients\n)\n.\nTannery was an outstanding teacher of mathematics and he taught at a number of different establishments. He taught higher mathematics at the Lycée Saint-Loius, and taught at the Sorbonne. Then in\n1881\nhe was appointed Maître de Conférences at the École Normale Supérieur, and soon after this to the École Normale for women in Sèvres. From\n1884\nhe was an adviser of studies at the École Normale and, from\n1903\n, Professor of differential and integral calculus at the Faculty of Science in Paris. Speziali, writes in\n[\n1\n]\n:-\n... Tannery played an important role in the pedagogical reforms in France at the beginning of the twentieth century. Through his lectures and supervisory duties at the École Normale this gifted teacher gave valuable guidance to many students and inspired a number of them to seek careers in science\n(\nfor example,\nPaul Painlevé\n,\nJules Drach\n, and\nÉmile Borel\n)\n.\nHis main contributions were to the history and philosophy of mathematics. He also wrote some excellent books with a large impact on younger mathematicians. Speziali, writes in\n[\n1\n]\n:-\nTannery possessed considerable gifts as a writer. the pure and elegant style of the poems he composed in his free hours clearly bears the stamp of a classic sensibility. his vast culture, nobility of character, and innate sense of a rationally grounded morality are reflected in his Pensées, a collection of his thoughts on friendship, the arts, and beauty. often they exhibit a very refined sense of humour.\nTannery worked on\nGalois\n' notes and letters. On June\n13\n,\n1909\n, a plaque was placed on\nGalois\n's birthplace at Bourg-la-Reine. See\nTHIS LINK\n. Jules made an eloquent speech of dedication. It was published in the\nBulletin des Sciences Mathématiques\n(1909)\n. It is worth noting that Tannery had been an editor of the\nBulletin des Sciences Mathématiques\nsince\n1876\nand he continued in that role until his death. He worked on this major project with\nDarboux\n,\nHoüel\nand\nÉmile Picard\n. Tannery made an impressive contribution to the Bulletin, writing large numbers of reviews. For example he wrote over\n200\nbook reviews for the Bulletin in the period between\n1905\nand\n1910\n.\nÉmile Picard\nwrites in\n[\n2\n]\nabout both Jules Tannery and his brother\nPaul Tannery\n:-\nThey were extremely close all their lives. Of very different natures, the two braothers complement each other ... Jules's philosophy ... did not free him from intellectual anxiety. his outlook was less universal than his brother's, but also more profound. He had both the subtle mind of the metaphysician and the penetrating insight of the disillusioned moralist.",
  "math_areas": [
    "Calculus"
  ]
}