{
  "nome_completo": "Jules Antoine Lissajous",
  "nome_curto": "Jules Lissajous",
  "ano_nascimento": "1822",
  "ano_morte": "1880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lissajous/",
  "lugar_nascimento": "Versailles, France",
  "lugar_morte": "Plombières, France",
  "biografia": "Jules Lissajous\nentered the École Normale Supérieure in\n1841\n. In\n1847\nhe became professor of mathematics at the Lycée Saint-Louis, holding this position until\n1874\n. He was awarded a doctorate in\n1850\nfor a thesis on vibrating bars using Chladni's sand pattern method to determine nodal positions. In\n1874\nLissajous became rector of the Academy at Chambéry, then in the following year he was appointed rector of the Academy at Besançon.\nLissajous was interested in waves and developed an optical method for studying vibrations. He wanted to be able to see the waves that were created by vibrations, usually expressed in the form of sound. At first he studied waves produced by a tuning fork in contact with water, studying the ripples that were caused. Working on these ideas, he published\nSur la position des noeuds dans les lames qui vibrent transversalement\nⓉ\n(\nOn the position of the nodes in blades which vibrate transversely\n)\n(1850)\n. In\n1855\nhe described a way of studying acoustic vibrations by reflecting a light beam from a mirror attached to a vibrating object onto a screen. He published\nSur un cas particulier de stéréoscopie fourni par l'étude optique des mouvements vibratoires\nⓉ\n(\nOn a particular case of stereoscopy provided by the optical study of vibratory movements\n)\n(1856)\n, then his major work\nMémoire sur l'étude optique des mouvements vibratoires\nⓉ\n(\nDissertation on the optical study of vibratory movements\n)\n(1857)\nwhich is an\n85\npage paper. In the following year he published\nSur les vibrations transversales des lames élastique\nⓉ\n(\nOn the transverse vibrations of elastic blades\n)\n.\nJean-Marie Duhamel\nhad tried to demonstrate these vibrations with a mechanical linkage but Lissajous wanted to avoid the problems caused by the linkage. He obtained Lissajous figures by successively reflecting light from mirrors on two tuning forks vibrating at right angles. The curves are only seen because of persistence of vision in the human eye. Lissajous studied beats seen when his tuning forks had slightly different frequencies, in this case a rotating\nellipse\nis seen. Perhaps he gained greatest fame through the quality of his lectures and fortunately we have a detailed description of one of his famous lectures by John Tyndall who had been named as Professor of Natural Philosophy at the Royal Institution in\n1853\n. The description below is by Taylor\n[\n3\n]\n, with quotations from Tyndall:-\nLecturers at the Friday Evening Discourses\n[\nat the Royal Institution\n]\ncome from many parts of the world and it is worth recording one particularly memorable evening that was reported by John Tyndall. It was a visit by Jules Antoine Lissajous to the Royal Institution in\n1857\n.\nLissajous had exhibited his experiments on the combination of oscillations before the Societé d'Encouragement and before the French Emperor\n[\nNapoleon III\n]\nhimself. Tyndall was intrigued by the demonstrations and planned to repeat them, but when Lissajous was consulted he offered to come to London himself. Tyndall reported the details of the lecture and records that, at the beginning of the lecture, Lissajous: \"... congratulated the audience on the presence of M Duboscq who took charge of his own electric lamp; this being the source of light made use of on this occasion.\"\nThe demonstration began with a 'sheaf of light' thrown from the lamp on to a mirror held in the lecturer's hand; when he moved the mirror quickly he could produce a ring of light on the ceiling and various other figures, thus illustrating the persistence of vision that is an essential feature of many of the remainder of the demonstrations. He then performed a number of experiments demonstrating what we now know as 'Lissajous figures'.\nFor example he attached a small mirror to one prong of a tuning fork and arranged for a beam of light to be reflected from this mirror on to the hand held mirror.\nWhen a violin bow was drawn across the fork the image elongated itself to a line. By turning the mirror in the hand, the image upon the screen was resolved into a bright sinuous track many feet in length.\nHe then went on to show various combinations of oscillations including the one most commonly associated with his name in which the light falls first on a mirror attached to one tuning fork and then to a mirror on a second tuning fork placed so that the oscillation given to the light beam is at right angles to that given by the first.\nHe also demonstrated his 'phonoptomètre'. This was a microscope in which the objective was attached to a tuning fork so that it could be made to vibrate along a particular direction. If some other vibrating object, such as a string, was viewed through the microscope so that the two oscillations were at right angles, the frequency ratio between that of the fork and that of the object under test could be established with considerable precision.\nAt the conclusion of this beautiful series of experiments, which, thanks to the skill of those who performed them, were all successful, on the motion of Mr\nFaraday\n, the thanks of the meeting were unanimously voted to M M Lissajous and Duboscq and communicated to those gentlemen by his Grace the President, The Duke of Northumberland.\nDuboscq, who assisted Lissajous in this demonstration, himself invented the Bioscope, a viewer for showing moving\n3\n-dimensional pictures. Twelve or more pairs of photographic images were placed around a cardboard disc, the images of each pair arranged one above the other. The pictures could be viewed through two small angled mirrors. It had only a limited sale - in fact only one viewer is known to have survived. Lissajous was very impressed by the clever idea contained in this instrument but doubted that it was a commercial proposition:-\nThis apparatus which is particularly remarkable because it represents the solution to a difficult problem, has, unfortunately, no chance of being sold in quantity, since the number of pictures need is very considerable: not less than\n32\npictures are required.\nActually the minimum number was\n24\nbut perhaps there were\n16\npairs in the only ones that Lissajous saw. Although Lissajous was right about this particular apparatus, of course the method of sequentially showing still pictures was adopted for motion pictures on film.\nLissajous was praised by his contemporaries for his work and awarded the Lacaze Prize in\n1873\nfor his optical observation of vibration and, in particular, \"for his beautiful experiments\". Perhaps it is entirely fair that \"his beautiful experiments\" were a major factor in the award of the prize since Lissajous figures had been investigated forty years earlier by\nNathaniel Bowditch\n. He had produced them in\n1815\nwith a compound pendulum and, because of this, sometimes the figures are referred to as\nBowditch\nfigures or Lissajous-\nBowditch\nfigures. We should note, however, that Lissajous' work was entirely independent of that of\nBowditch\n.\nQuickly Lissajous figures became a standard topic in physics texts and demonstrations. The experiments were exhibited at the Paris Universal Exhibition in\n1867\n. We have noted above John Tyndall's discussion of Lissajous's experiments, and he described them in detail in his acoustics text.\nLord Rayleigh\nalso discussed Lissajous figures in his classical treatise on acoustics.\nHermann von Helmholtz\nused Lissajous' instruments in his study of string vibrations.\nPerhaps today it is Australians are most familiar with Lissajous figures since the Australian Broadcasting Corporation\n(\nABC\n)\nhas used such a figure for its logo since\n1965\n. If Lissajous had produced this logo in a demonstration he would have needed to use two tuning forks at right angles, one vibrating three time as rapidly as the other.",
  "math_areas": [
    "Algebra"
  ]
}