{
  "nome_completo": "Julius Weingarten",
  "nome_curto": "Julius Weingarten",
  "ano_nascimento": "1836",
  "ano_morte": "1910",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weingarten/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Freiburg im Breisgau, Germany",
  "biografia": "Julius Weingarten\nwas born in Germany, but his family were Polish and had emigrated to Germany. He certainly did not come from an academic family for his father was a weaver, and the family were not well off which would have a serious effect on the whole of Weingarten's career.\nWeingarten attended the Municipal Trade School in Berlin. He completed his studies there in\n1852\nand, in the same year, he entered the University of Berlin to embark on a course of study which involved mainly mathematics and physics. At the University of Berlin Weingarten attended lectures on\npotential theory\ngiven by\nDirichlet\n. These lectures were particularly inspiring and, although this would not be Weingarten's main area of research, he continued to work, from time to time, on problems related to this topic throughout his career. He also studied chemistry at the Berlin Gewerbeinstitut\n(\nthe Institute for Crafts\n)\nduring these years.\nComing from a poor family Weingarten did not have the financial support to allow him to complete his doctorate at Berlin without earning his living so, in\n1858\n, he began teaching at a school in Berlin. Despite having to work as a teacher at various schools while he undertook research, his work on the theory of surfaces progressed remarkably well. In fact the work was of such quality that Weingarten received a prize for work on the lines of curvature of a surface in\n1857\n.\nIn\n1864\nhe received a doctorate from the University of Halle for the same work which had won him the prize from the University of Berlin, but he had been far from idle over the years for he had published other important work on the theory of surfaces. The theory of surfaces was the most important topic in\ndifferential geometry\nand\n[\n1\n]\n:-\n... one of its main problems was that of stating all the surfaces isometric to a given surface. The only class of such surfaces known before Weingarten consisted of the developable surfaces isometric to the plane.\nIn\n1863\nWeingarten was able to make a major step forward in the topic when he gave a class of surfaces isometric to a given surface of revolution. Surfaces of constant mean curvature or constant Gaussian curvature are now called the Weingarten surfaces.\nHaving produced work of outstanding quality, while one must remember he was teaching in schools, it would be reasonable to expect that Weingarten would find a good academic post. However, this was not easy at that time except for those who had the necessary funds to allow them the luxury of starting an academic career with little income. Weingarten had to take the option which would provide him with an income so he accepted a rather unsatisfactory position at the Bauakademie in Berlin.\nWeingarten was promoted to professor at the Bauakademie in\n1871\nbut left the rather unsatisfactory post to take on what was another rather unsatisfactory position at the Technische Hochschule in Berlin. By\n1902\n, at the age of\n66\n, his health began to fail and for that reason he moved to Friburg im Breisgau where he was appointed as an honorary professor. He taught there until\n1908\nin what was in many ways the most satisfactory of his teaching positions.\nWeingarten's work on the infinitesimal deformation of surfaces, undertaken around\n1886\n, was praised by\nDarboux\nwho included it in his four volume treatise on the theory of surfaces. In fact\nDarboux\nsaid that Weingarten's work was worthy of\nGauss\n, a compliment indeed. The interest which\nDarboux\nshowed in his work, encouraged Weingarten to push his results further and he wrote a long paper which won the Grand Prix of the\nAcadémie des Sciences\nin Paris in\n1894\n. The work was published in\nActa mathematica\nin\n1897\nand was another major step forward in solving the problems on which Weingarten had worked all his life. In this work he reduced the problem of finding all surfaces isometric to a given surface to the problem of determining all solutions to a\npartial differential equation\nof the\nMonge\n-\nAmpère\ntype.\nDarboux\nwas not the only leading mathematician in Weingarten's time who was also interested in the theory of surfaces. Another was\nBianchi\nand a major correspondence grew up between Weingarten and\nBianchi\n. In fact in\n[\n2\n]\n, which is a\n304\npage book containing all\nBianchi\n's correspondence, the most extensive correspondence of all is the one with Weingarten.",
  "math_areas": [
    "Geometry"
  ]
}