{
  "nome_completo": "Julian Lowell Coolidge",
  "nome_curto": "Julian Coolidge",
  "ano_nascimento": "1873",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coolidge/",
  "lugar_nascimento": "Brookline, Boston, Massachusetts, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Julian Coolidge\n's father, John Randolph Coolidge, was a lawyer. Julian's mother was Julia Gardner. Coolidge was educated at Harvard from where he received his B.A. degree summa cum laude in\n1895\n. He then went to England to attend Balliol College, Oxford, and he graduated with a B.Sc. in\n1897\n. It is interesting that this degree from Oxford was in natural science and it was the first natural science degree ever awarded by Oxford.\nAfter studying at Oxford, Coolidge returned to the United States where he taught at Groton school in Connecticut from\n1897\nto\n1899\n. Another interesting note is that one of the pupils that Coolidge taught at this school was Franklin D Roosevelt and the two remained friends for life. In\n1899\nCoolidge was appointed as an instructor at Harvard and, three years later, he became an assistant professor there. In\n1902\nhe married Theresa Reynolds and they had two sons and five daughters.\nGranted two years leave of absence from\n1902\nto study in Europe, he went to Turin where he studied under\nCorrado Segre\nand then to Bonn where he studied under\nEduard Study\n. His doctoral dissertation was supervised by\nStudy\nand, in\n1904\n, he was awarded his doctorate by Bonn University for a thesis entitled\nDie dual-projektive Geometrie im elliptischen und sphärischen Raume\n(\nDual-projective geometry in elliptical and spherical spaces\n)\n.\nAfter spending two years in Europe, Coolidge returned to Harvard where he taught for most of his career\n(\nthe exception being\n1927\nwhen he returned to the Sorbonne in Paris as an exchange professor\n)\n. He was promoted to associate professor in\n1908\n. During World War I he served as a major in the US Army and, at the end of the war in\n1918\n, he was promoted to full professor at Harvard. He was liaison officer to the French General Staff in Paris, where he had\n2000\nAmerican men under his command, from\n1918\nto\n1919\n. Coolidge organised courses for his men at the Sorbonne in\n1919\nand in that year the French government made him a chevalier of the Légion d'Honneur. In\n1927\nCoolidge was appointed as chairman of the Mathematics Department at Harvard. Two years later he became master of Lowell House where he lived until he retired in\n1940\n. In\n1936\nhe returned to Paris to receive further honours from the French Government.\nCoolidge wrote many good texts on geometry including\nThe Elements of\nNon-Euclidean\nGeometry\n(1909)\n,\nA Treatise on the Circle and the Sphere\n(1916)\n,\nThe Geometry of the Complex Domain\n(1924)\nand\nA Treatise on Algebraic Plane Curves\n(1931)\n. He also wrote on\nprobability\nwith\nAn Introduction to Mathematical Probability\n(1925)\n. After he retired his interests turned to the history of mathematics and he published works such as\nA History of Geometrical Methods\n(1940)\n,\nA History of the Conic Sections and\nQuadric\nSurfaces\n(1945)\n, and\nThe Mathematics of Great Amateurs\n(1949)\n.\nWe shall say a little about some of these works. The first four books listed above on geometry follow the style of Eduard\nStudy\nand\nCorrado Segre\nbut contain many original ideas due to Coolidge himself.\nAn Introduction to Mathematical Probability\nis\n[\n4\n]\n:-\n... one of the subject's first treatments in English and one of Coolidge's best known works ... it defined probability ... in terms of frequency, thereby making the subject amenable to mathematical applications in the sciences generally.\nA History of Geometrical Methods\nwas inspired by\nChasles\n' classical\nAperçu historique sur l'origine et le développement des méthodes en géométrie\nof\n1837\n. In Coolidge's own words in the preface it was:-\n... a new book dealing with the history of the methods which men have employed in dealing with geometrical questions.\nThe book is in three parts: synthetic geometry,\nalgebraic geometry\n, and\ndifferential geometry\n.\nStruik\nreviewed the work and wrote:-\nThis is the book to be consulted by everyone who wants to know what we might call modern classical geometry and its history. It is not only a summary or description of results, but a systematic development of the material with proofs and corollaries, a kind of multiform textbook, from which the student cannot only get an orientation, but which he can use as a basis for his studies. A great number of special topics are briefly or amply discussed, from the geometry of the spider's web to modern criticism of enumerative geometry,\nDouglas\n's work on the\nPlateau\nproblem,\nquaternions\nand some\ntensor analysis\n. Anecdotes and personal remarks enliven the argumentation.\nIn\nThe Mathematics of Great Amateurs\nCoolidge writes in the preface that he looks at the mathematical work of:-\n... sixteen men who were principally known for some other activity, yet whose success in the field of mathematics enabled them to make contributions of permanent value.\nIt will not surprise anyone who has read any of Coolidge's books that he was\n[\n1\n]\n:-\n... an enthusiastic teacher with a flair for witty remarks.\nOutside the field of mathematics his interests were running, swimming, rowing, and sailing\n[\n3\n]\n:-\nHe had a unique and loyal personality and had a good sense of humour. He was a robust and enthusiastic oarsman, and in the Torpids had the pleasure of helping to make\n12\nbumps for the college\n[\nBalliol\n]\nin two successive years.\nCoolidge served both the\nMathematical Association of America\nand the\nAmerican Mathematical Society\nas vice-president, the first in\n1924\nand the second in\n1918\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}