{
  "nome_completo": "Juliusz Pawel Schauder",
  "nome_curto": "Julius Schauder",
  "ano_nascimento": "1899",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schauder/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Lwów, Poland (now Lviv, Ukraine)",
  "biografia": "Juliusz Schauder\nwas the son of Samuel Schauder and Regina Grünstein; it was a Jewish family. His father, Samuel Schauder\n(1870\n-\n1927)\n, was a lawyer who ran a successful law firm in both Lemberg and Rohatyn. He was a doctor of law, wrote articles in professional journals, and devoted his entire life to his professional work and family. Regina Grünstein, the daughter of the doctor Juliusz Grünstein and his wife Karolina, was born on\n30\nJune\n1872\nin Zaleszczyki and educated at the Ursuline Sisters' school. Samuel and Regina Schauder were married on\n25\nDecember\n1898\n. They had four children: Julius Schauder, the subject of this biography born\n21\nSeptember\n1899\n; Anna, born on\n15\nNovember\n1900\n; Marian, born\n29\nJuly\n1905\n; and Karol, born\n14\nJune\n1909\n. The three youngest children were all born in Rohatyn, a town about\n70\nkm south east of Lviv.\nAt this point let us say a word about Juliusz Paweł Schauder's name. On his birth certificate and all official records up to his doctorate, his name appears as Paweł Juliusz Schauder. His mathematical papers, however, are all published under the name J Schauder, Juliusz Schauder, Jules Schauder or Julius Schauder. Since he seems to have preferred to use the name Juliusz, we have reversed the order of his given names and placed Juliusz first. His friends called him Julek.\nJuliusz attended primary school in Rohatyn but for his secondary school education he studied first at Gymnasium III in Lemberg\n(\nnow Lviv, Ukraine\n)\n, then at Gymnasium VIII in Lemberg. His mathematics teachers at the Gymnasiums were Jerzy Orłowski and Jerzy Mihułowicz\n(1877\n-\n1950)\n, a well-known mathematics teacher and author of textbooks aimed at Gymnasium pupils. At this time Lemberg was in Galicia, the part of partitioned Poland which was under Austrian control. Schauder was still at school when World War I started but when he graduated from school in March\n1917\nhe was drafted into the Austro-Hungarian army. He was with the Austro-Hungarian army in the north of Italy when he was taken prisoner by the Italians. He was freed after the Padua Armistice of November\n1918\nbetween the Allies and Austria-Hungary, and then joined the Polish army of General Haller which was being organised in France. He returned to Poland with this army in early\n1919\n. By this time the country of Poland had been re-established and it was to a Polish Lwów\n(\nformerly Lemberg, now Lviv\n)\nthat Schauder went. With Haller's army he took part in the defence of Lwów which was besieged by Ukrainians. He continued to serve in the Polish army in Lwów until the autumn of\n1919\nbut he participated in the Mathematical-Physical Society of the Jan Kazimierz University in Lwów from March\n1919\nin the blue uniform of an army sergeant in Haller's army. On\n1\nMarch\n1919\nhe gave the lecture\nOn the theory of the Lebesgue integral\nto the Mathematical-Physical Society. How could Schauder deliver such a lecture when his only formal mathematical training up to that point had been at a Gymnasium? Henry Schaerf gives us the answer in\n[\n31\n]\n:-\nHe told me that his university study was delayed by his army service and that, to make up for lost time, he had read\nHausdorff\n's book \"Grundzüge der Mengenlehre\"\nⓉ\n(\nFundamentals of set theory\n)\nfrom cover to cover during the summer preceding his enrolment at the university. He had also read\nGoursat\n's \"Cours d'Analyse\"\nⓉ\n(\nAnalysis Course\n)\nand worked out all the problems in it early in his study years.\nHe formally registered at the University in autumn\n1919\nwhere he was taught mathematics by\nStanisław Ruziewicz\n,\nEustachy Żyliński\n,\nStefan Banach\nand\nHugo Steinhaus\n.\nMarceli Stark\nwrote in\n[\n33\n]\n:-\nJuliusz Schauder attended lectures on mathematics and physics. He never took notes, only listened and read a lot in the early years. He worked non-stop. He did not recognise either holidays or vacations. He spent all his vacations at home, lying on the couch, with a book in his hand. ... Juliusz Schauder devoted all his thoughts to mathematics, he discussed with his colleagues very willingly, he was interested not only in his own problems, but also in those of others. There were quite a few breaks of an hour or more between lectures, the place of discussions was the corridor in front of the lecture hall. There, leaning against the stove, he stood for hours, formed problems, specified their titles, developed proofs, in a word, he began his independent scientific start early. A little later, these discussions from the corridor moved a few hundred metres away from there to the Roma or Szkocka cafes, located opposite each other, where\nStefan Banach\ninitiated broad mathematical discussions. There were always several people sitting at one table, and among them very often was Juliusz Schauder.\nSchauder was examined for his diploma on\n3\nMay\n1921\nby Roman Negrusz\n(1874\n-\n1926)\n, a graduate of the Jan Kazimierz University in Lwów who was by that time was professor and head of the Department of Experimental Physics. After passing this examination, Schauder then worked for his doctorate advised by\nSteinhaus\nand also by\nBanach\n.\nHe submitted his doctoral thesis\nThe theory of surface measure\nin October\n1923\n. Perhaps surprisingly, the thesis was written in English. It was examined by\nSteinhaus\nand\nBanach\nand the work was rated excellent. He still had to be examined for his doctorate with oral examinations. His mathematics and physics oral was on\n23\nJune\n1924\nwhen he was examined by\nE Żyliński\n,\nH Steinhaus\n,\nS Ruziewicz\n, R Negrusz and S Krzemieniewski. He also had to take a philosophy oral examination on\n8\nOctober\n1924\nwith examiners K Twardowski, M Wartenberg and J Ptaśnik. He was formally awarded his doctorate on\n13\nOctober\n1924\n.\nAt this stage Schauder would have liked an appointment as an assistant at the University in Lwów while he worked on an\nhabilitation\nthesis. The University only had two assistant positions in mathematics, however, and both were filled so Schauder looked for a teaching position in a gymnasium. Even this proved hard since young teachers were expected to begin their careers in small towns and he could not find a job in Lwów. In\n1925\nhe was appointed as a mathematics teacher in Przemyślany, a small town about\n60\nkm from Lwów where he taught for two years.\nAlthough spending two years as a teacher in a small town did not make working for his habilitation easy, nevertheless on\n31\nMarch\n1927\nhe submitted his thesis\nContributions to the theory of continuous mappings on function spaces\ntogether with the other necessary material to the Council of the Faculty of Mathematics and Natural Sciences of the Jan Kazimierz University. He was examined by\nE Żyliński\n,\nH Steinhaus\n,\nS Ruziewicz\nand\nS Banach\nwho unanimously agreed he could proceed to give his habilitation lecture. He delivered the lecture entitled\nCauchy's Problem and Boundary Problems in Differential Equations\non\n28\nMay\n1927\nand the Faculty Council unanimously granted Schauder his\nveniam legendi\nin mathematics. This was formally approved by the Ministry on\n16\nJanuary\n1928\nallowing Schauder to teach at the University.\nOf course the process had taken almost a year and during that time Schauder had to earn his living. He did so by working for the Italian Insurance Company Riunione Adriatica di Sicurtà in Vienna and Lwów. This company had been founded in Trieste in\n1838\nat a time when Trieste was in the Austrian Empire. This work certainly did not suit Schauder and Henry Schaerf reports in\n[\n31\n]\nthat Schauder told him:-\nNot only could I do no Mathematics during this period, but also the entire year after.\nWorking for the Insurance Company was not good for Schauder but he did not seem to have pleased the Company much either. At that time firms were giving their employees psychological tests to see which type of work they were best suited to. Schauder told a friend\n[\n20\n]\n:-\nI received the result of the test I took, which shows that I am not suitable for any job.\nIn September\n1928\nhe was appointed as a teacher at Gymnasium V\n(\nStanislaw Zolkiewski\n)\nin Lwów. One of the two assistants in the Department of Mathematics at the University of Lwów left and Schauder was appointed as an assistant from\n16\nJanuary\n1928\n. His first courses were given at the University during\n1928\n-\n29\nbut he continued also with his position as a secondary school teacher. As\nUlam\nwrites in\n[\n36\n]\n:-\nAlthough Lwów was a remarkable centre for mathematics, the number of professors both at the Institute and at the University was extremely limited and their salaries were very small. ... Schauder had to teach in high school in order to supplement a meagre income as lecturer ...\nIn fact Schauder continued to give lectures as the University and to teach in schools up until the outbreak of World War II. He was a dedicated school teacher and one of his pupils,\nMarceli Stark\n, wrote\n[\n33\n]\n:-\nSchauder was one of the teachers full of dedication. He spared no effort and work for his students, not only during lessons at school, but also during numerous free additional hours, some of which started as early as\n6\na.m. His thoughts were constantly absorbed in scientific issues, he often gave the impression of being absent-minded, which on the one hand gave the students many opportunities for pranks and jokes, but on the other hand they highly valued their professor because of his knowledge and the work he put into teaching.\nIn the late\n1920\ns, Juliusz Schauder decided to get married, as his friend Henry Schaerf recalled\n[\n20\n]\n:\nHis approach to important matters of life was unusual. Once when we were taking a walk in a park he told me: \"I am now approaching the age of thirty. This is a serious age, it is time for me to marry and to settle down. I would like to marry a girl studying Mathematics, preferably one knowing some foreign languages, so that she can help me to prepare my results for publication. Among your classmates I like the looks of only two girls: Miss X and Miss Y, but I have not met either of them. Tell me, which one of them do you think I should marry\". I replied: \"Marry Miss X\". This he did, after first confirming my recommendation with\nStefan Banach\n.\nSchauder married Emilia Löwenthal on\n17\nDecember\n1929\n. Born on\n5\nSeptember\n1907\n, she also came from a Jewish family although her grandfather had been expelled from the Jewish community on the grounds that he was an atheist. Her father was Abraham Löwenthal, a bookkeeper living in Drohobych, and her mother was Chaja Opperman. Lech Maligranda writes that Emilia\n[\n20\n]\n:-\n... was a dark-haired girl, of medium height, with delicate facial features. ...She  had no academic ambitions, although she was a very talented student. In\n1931\n, she wrote her master's thesis \"Picard's Theorem\" under\nBanach\n's supervision. She later worked as a teacher. She was very devoted to Juliusz, cared for him and helped him as much as she could.\nJuliusz and Emilia Schauder had one daughter Eva Schauder born on\n19\nJanuary\n1938\n. On\n14\nFebruary\n1938\nBanach\nwrote to\nUlam\n:-\nSchauder has a daughter\n(\nwho is currently a few weeks old\n)\n. Poor Schauder complains that he cannot sleep at night because his daughter screams.\nBrouwer\npublished his fixed point theorems in\n1911\nfor finite dimensional spaces. Schauder published fixed point theorems for\nBanach\nspaces in\n1930\n. In\n1932\nhe was awarded a Rockefeller scholarship which enabled him to spend part of\n1932\n-\n33\nin Leipzig. Schauder first met\nLeon Lichtenstein\nat the First Polish Mathematical Congress in Lwów in September\n1927\nand Schauder had invited him to spend a trimester at Lwów in\n1930\nwhen he gave a series of lectures on integral and integral-differential equation. Schauder went to Leipzig to work with\nLichtenstein\nand had planned to go from there to Göttingen to spend the second semester working with\nHans Lewy\nand\nRichard Courant\n. Hitler's rise to power and his anti-Semitic legislation made Schauder change his plans so, still financed by the Rockefeller scholarship, in May\n1933\nhe moved to Paris to work with\nHadamard\n.\nWalter Forster writes\n[\n9\n]\n:-\nSchauder and his wife met\nHans Lewy\nin the spring of\n1933\nin Paris.\nBanach\nalso came to Paris.\nBanach\n,\nLewy\n, Schauder and others spent many evenings together in Paris. All the mathematicians met at\nHadamard\n's seminar - any other would have been considered un-French.\nLewy\nintroduced Schauder to\nJean Leray\nwho described their meeting in\n[\n14\n]\n:-\nOne beautiful spring day,\nHans Lewy\nintroduced us to each other in a modest restaurant on the Rue Soufflot. I immediately said to Schauder: \"I have read your paper on the relationship between existence and uniqueness of the solution of a nonlinear equation. I know now that existence is independent of uniqueness. I admire your topological methods. In my opinion they ought to be useful for establishing an existence theorem independent of any uniqueness and assuming only some a priori estimates.\" To this he replied\n(\nin German\n)\n- \"Now that would be a theorem!\" Forty-eight hours later the theorem existed; it had been formulated and meticulously proved in the beautiful Jardin du Luxembourg. A day or two later, in the same park, Jules Schauder proposed to enrich our work with a result which is the most beautiful of his applications: the proof of the existence, in the whole plane and convex domain, of a solution of the\nDirichlet\nproblem for an elliptic equation of a particular form ... After\n15\ndays of strenuous but joyful work - it was carried out in the Jardin du Luxembourg or in Meudon, where I lived, or in the surrounding woods - our article \"Topologie et équations fonctionnelles\"\nⓉ\n(\nTopology and functional equations\n)\nwas finally written.\nTheir joint paper\nTopologie et équations fonctionelles\nⓉ\n(\nTopology and functional equations\n)\nwas published in the\nAnnales scientifiques de l'École Normale Supérieure\n. This\n1934\npaper on topology and partial differential equations is of major importance\n[\n8\n]\n:-\nIn this paper what is now known as\nLeray\n-Schauder degree\n(\na homotopy invariant\n)\nis defined. This degree is then used in an ingenious method to prove the existence of solutions to complicated partial differential equations.\nIn\n1938\nhe received the Grand Prix Internationaux de Mathématiques Malaxa\n(\njointly with\nLeray\n)\nfor the work of the\n1934\npaper. Nicolae Malaxa\n(1884\n-\n1965)\nwas a Romanian engineer from Bucharest who founded much heavy mechanical industry building locomotives, diesel engines, etc. One of the richest men in Romania, he founded the prize in\n1937\n. An international jury was appointed to make the first award in\n1938\n: it consisted of\nTullio Levi-Civita\n; Henri Villat\n(1879\n-\n1972)\n, professor of fluid mechanics at the University of Paris;\nWerner Heisenberg\n;\nGheorghe Țițeica\n;\nDimitrie Pompeiu\n; and\nOctav Onicescu\n. Although the original amount of the prize was\n50\n,\n000\nFrench francs, in fact, with Nicolae Malaxa's consent, it was unanimously decided to award a prize of\n300\n,\n000\nFrench francs to\nLeray\nand\n200\n,\n000\nFrench francs to Schauder.\nOnicescu\nreported in his\nMemoirs\nthat\nLeray\nwas very pleased with his award, while Schauder was deeply dissatisfied and felt that he had been wronged receiving less than\nLeray\n. He even sent an angry letter to\nOnicescu\nwho did not dare show it to Nicolae Malaxa, telling him that he had lost it.\nIn fact by the time Schauder received this prize his final publication generalising results of\nCourant\n,\nFriedrichs\nand\nLewy\non hyperbolic partial differential equations\n(1937)\nhad appeared in print. His short career was about to come to an end with the start of World War II but, despite his publications spanning only\n10\nyears, he had written\n33\nworks.\nKuratowski\n, in\n[\n13\n]\n, sums up Schauder's main mathematical contributions:-\nSchauder's main achievement consists in transferring some topological notions and theorems to\nBanach\nspaces\n(\nthe fixed point theorem, invariance of domain, the concept of index\n)\n. In particular, Schauder's formulation of a fixed point theorem originated a new, extremely fruitful method in the theory of differential equations, known as Schauder's method ...\nForster, in\n[\n8\n]\n, writes:-\nSchauder's fixed point theorem and his skilful use of function space techniques to analyse elliptic and hyperbolic partial differential equations are contributions of lasting quality. Existence proofs for complicated nonlinear problems using his fixed point theorem have become standard. The topological method developed in the\n1934\nLeray\n-Schauder paper ... is now utilised not only to obtain qualitative results but also to solve problems numerically on computers.\nDespite Schauder's outstanding work, he remained as an assistant at the University of Lwów.\nMark Kac\nexplains in\n[\n39\n]\n:-\nEven for\ndocents\nof great scientific renown the chances of obtaining a professorship in a reasonable length of time were extremely small. They were nil for docents who were Jewish\n(\nthe name of the mathematician Juliusz Schauder, an internationally famous Lwów docent, who never became a professor, comes to mind\n)\n.\nSteinhaus\nused to say in jest that the United States is a poorer country than Poland because Poland educates superb mathematicians and then finds no use for them, while the States could not afford such waste.\nSchauder was well aware of the danger he faced after the Nazis came to power in Germany in\n1933\n. In\n1936\nSergi Bernstein\ninvited him to Leningrad with the offer of a job there but Schauder believed that only the United States would provide a safe country for him.\nLeray\nencouraged him to accept\nBernstein\n's offer, but Schauder replied to him on\n8\nAugust\n1936\n[\n19\n]\n:-\nAs long as I can earn a living in my own country - even if in a way that is inappropriate for me - I will not agree to this offer.\nAround this time he tried unsuccessfully to get an invitation to Princeton in the United States.\nIn\n1939\n, at the beginning of the World War II, Soviet troops occupied Lwów. Schauder was treated well by the new Soviet administration. He was appointed as a professor at the university, now renamed the Ivan Franko University.\nStefan Banach\nbecame the Dean of the Faculty of Mathematics and Natural Sciences of the Ivan Franko State University of Lviv. From\n31\nDecember\n1939\nto\n22\nJune\n1941\n, Schauder was a professor and head of the Department of Theoretical Mechanics at the Faculty of Mathematics and Natural Sciences. He was also appointed to the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev. This provided him with a salary in addition to his university salary and for this short period he was well off.\nSergei Sobolev\nand\nPavel Aleksandrov\ncame to Lwów and lectured at the Ivan Franko University in April\n1940\n. They reported back regarding the high quality of mathematics that was being carried out in Lwów and Schauder was invited to Moscow spending the time from\n5\nJanuary\n1941\nto\n10\nFebruary\n1941\nthere. He received a Soviet doctorate and the title of professor on\n25\nMarch\n1941\n.\nIn June\n1941\nthe German army entered Lwów and a systematic extermination of Jews, academics and communists began. On Friday,\n4\nJuly\n1941\n, the Germans shot\n22\nprofessors in Lwów. Shortly after, Schauder's his former student Alfred Jahn spotted him walking in Lviv\n[\n39\n]\n:-\nI met Schauder in the evening in a quiet, empty street near the Lviv citadel, where I lived at the time. We walked up to each other, almost face to face. He was without an armband, walking with his head down. When I said, \"Good evening, Professor,\" I saw terrified eyes, like those of a hunted animal. He stopped for a moment and without raising his head immediately disappeared into the darkness. A terrified, hiding man who suddenly realised that someone knew him. I think he didn't have time to look at me, he didn't recognise me, although I was one of his closest students.\nSoon after, in August\n1941\n, the Schauders' apartment at\n29\nTarnowskiego Street was taken over by the army. He lost both his apartment and his library, and Schauder, together with his wife and daughter, moved to Drohobycz to stay with his wife's parents. He got a friend to produce a false birth certificate for him in the name of Sitko. On\n29\nOctober\n1942\n, Schauder wrote from Drohobych to\nvan der Waerden\npleading for help.\nVan der Waerden\nforwarded the letter to various mathematicians such as\nCarathéodory\n,\nHeisenberg\nand\nSüss\nbut nobody would help - they all feared for their own safety if they helped a Jew.\nHeisenberg\nwrote to Heinrich Scholz\n(1884\n-\n1956)\n, who helped Polish mathematicians, but he refused to help Schauder.\nEmilia and Eva returned to Lwów followed a few days later by Schauder himself. Having no apartment, they lived with various friends and parents of former students spending only a short time with each before moving on. Schauder's wife Emilia and his daughter Eva left Lwów and lived for a while in Warsaw with\nAlfred Tarski\n's wife. When it became dangerous in that house, they lived for a while in the sewers of Warsaw. Emilia gave Eva to a Catholic convent and soon after Emilia was captured and sent to concentration camp near Lublin where she died. Eva, Schauder's daughter, survived until the end of the war when she went to Italy to live with Schauder's brother who lived there.\nThere are many versions of how Schauder died and it is impossible to tell which is correct. What is certain is that he was in regular contact with friends until May\n1943\nbut he was not seen after this. Also certain is that he was murdered by the Germans but where and when is not known. One version states that he was betrayed to the Gestapo who then arrested him and, like many Jews, he was never seen again. The second version of his death\n(\nthought by Forster the author of\n[\n8\n]\nto be more likely\n)\nis that he was shot by the Gestapo in September\n1943\nin one of their regular searches for Jews. Some versions have him shot on the street, others say he was arrested and a few days later was in a group of Jews being set to a concentration camp. He tried to escape and was shot.\nWe should comment on the picture of Schauder above.\nUlam\n[\n36\n]\nexplains that\nLeray\n, the French mathematician with whom Schauder collaborated, wrote to him several years after the end of World War II:-\nLeray\nwanted to have a photograph of\n[\nSchauder\n]\nfor himself and for Schauder's daughter who survived the war and lives in Italy. But he could not find any in Poland or anywhere and he wrote to me asking whether I might have a snapshot. Some months after\nJohnny von Neumann\n's death I was looking at some of the books in his library and a group photo of the participants in the\n[1935]\nMoscow conference fell out. Schauder was there, as were\nAleksandrov\n,\nLefschetz\n,\nBorsuk\n, and some dozen other topologists. I sent this photograph to\nLeray\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Topology"
  ]
}