{
  "nome_completo": "Julius Peter Christian Petersen",
  "nome_curto": "Julius Petersen",
  "ano_nascimento": "1839",
  "ano_morte": "1910",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petersen/",
  "lugar_nascimento": "Soro, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Julius Petersen\n's father was Jens Petersen, who worked as a dyer, and his mother was Anna Cathrina Petersen who was born in Wiuff. From his early childhood Julius was friends with\nHieronymous Georg Zeuthen\nwho lived four houses away on the same street. Julius first attended a private school in Soro then, in\n1849\n, he entered Soro Academy School. Most of the pupils at the school were boarders but the school also admitted some day pupils like Julius who lived in the town. His interest in mathematics began when he was at this high school. He was passionate about problem solving and spent a great deal of time trying to solve the classical problem of trisecting an angle with\nruler and compass\n. He later wrote\n[\n9\n]\n:-\nMathematics had, from the time I started to learn it, taken my complete interest, and most of my work consisted in solving problems of my own and my friends, and in seeking the\ntrisection of the angle\n; a problem that has had a great influence on my whole development.\nHis family were poor and although they had tried their best to give Julius a good education, by\n1854\nhe had to leave school since his parents could no longer afford to keep him there. Petersen had an uncle who worked in Kolding, Jutland, and he went there to work as a grocery apprentice to his uncle. After about a year his uncle died and left some money to Petersen. He returned to Soro, passed the school leaving examinations, and entered the College of Technology in Copenhagen in\n1856\n. His first publication was two years later when he published an elementary text on logarithms. In\n1860\nhe passed his civil engineering examinations and, in the same year, submitted an essay on the history and properties of the cycloid for a University prize. When the judges found that he was not a university student they ruled out his entry.\nAlthough he had decided that he wanted to study mathematics at university long before graduating from the College of Technology, he had used up his inheritance by this time so had no way of funding himself through university. He therefore taught in a prestigious private school from\n1859\nto\n1871\nand also took other part-time teaching jobs to support himself.\nIn\n1862\nhe passed the entrance examinations for the University of Copenhagen and began his mathematical studies there. In the same year he married Kirstine Bertelsen\n(\nwho was two year older than he was\n)\n; they had two sons and a daughter. Although he was now a student he still taught six to seven hours a day, six days a week, to support himself, his wife, and children. He was considered a good teacher of mathematics, but school teaching did present a great problem to Petersen for he seemed incapable of controlling the pupils. In\n1866\nhe graduated from the university with the degree of Master of Mathematics but remained there to study for his doctorate. He was awarded the Gold Medal for his treatise on the equilibrium of floating bodies in\n1867\nbut although the work was judged to be excellent, nevertheless he did fail to know of one of the most important works on the topic, namely that by\nPierre Dupin\nin\n1814\n.\nPetersen was awarded his doctorate in\n1871\n. The interest he had shown in ruler and compass constructions when he was at school had continued to influence his research topic and his doctoral thesis was entitled\nOn equations which can be solved by square roots, with application to the solution of problems by ruler and compass\n. Petersen was unsure about a specific result which he used in his thesis, namely:\nIf the equation of degree\n2\nn\n2^{n}\n2\nn\ncan be solved by square roots, one of the roots can be expressed by\nn\nn\nn\nsuch different square roots, where each can appear several times.\nPetersen corresponded with\nSylow\nduring\n1870\n-\n71\n, mostly about this result. Details of the correspondence appear in\n[\n8\n]\n.\nAfter the award of his doctorate in\n1871\nhe was appointed as a\ndozent\nat the College of Technology in Copenhagen. In\n1877\nhe was appointed as professor of mathematics at the University of Copenhagen and continued to hold this post throughout his career. His friend and colleague at the University of Copenhagen was\nZeuthen\nwho was almost exactly the same age as Petersen. The two had been friends since childhood as we noted near the beginning of this article. Petersen also taught at the Officers School of the Army from\n1881\nto\n1887\n.\nHe wrote a series of school and undergraduate texts which achieved international acclaim despite being too difficult for all but the ablest pupils. For example he published\nPlane and spherical trigonometry\nin\n1863\n. First published three years later, his\nMethods and theories for the solution of problems of geometrical construction\nappeared in various editions and languages. This work aimed at making geometric problem solving systematic but the geometrical constructions he considered were always those of ruler and compass.\nHis research was on a wide variety of topics from algebra and\nnumber theory\nto geometry, analysis, differential equations and mechanics. He published\nThe theory of algebraic equations\nin\n1877\nwhich was written in a concise style, treating as many topics as possible without using\nGalois theory\n. He wrote a series of textbooks based on courses he had given at the College of Technology: one on plane geometry in\n1877\n; one on statics in\n1881\n; one on kinematics in\n1884\n; and one on dynamics in\n1887\n.\nHe also wrote on mathematical physics, mathematical economics and a pamphlet on cryptography. His work on economics began in\n1871\nwith the publication of a pamphlet investigating how goods could be redistributed to favour workers. Another work studied aspects of social policy. Petersen was enthusiastic about such matters and joined a committee to support Georg Brandes but this was short lived. Brandes was a Danish critic and scholar who set himself the task of liberating Denmark from its cultural isolation and provincialism with progressive ideas aimed at reforming society. Petersen joined the National Economic Society and translated an economics text by Henry Fawcett into Danish. He also developed his own ideas on economics beginning in\n1872\n, publishing these ideas in\n1874\n. Quite suddenly he changed from studying economics to studying cryptography. He published a pamphlet on this topic in\n1875\nwhich he funded privately. This was written in French, unlike all his previous works which were in Danish\n[\n9\n]\n:-\nPetersen never returned to cryptography; this seems to be another instance of a problem that must have occupied him intensely for a period, until he found a satisfactory solution and moved on to something else.\nHis most important work however was in geometry with innovative ideas on regular graphs. A paper which he wrote in\n1891\nDie Theorie der regulären Graphs\nmarks the birth of graph theory. Sabidussi\n[\n13\n]\nwrites that this is:-\n... the first major graph-theoretical paper, not only in size but also in significance.\nWatkins writes about Petersen's paper in\n[\n16\n]\n:-\nIn\n1891\nJulius Petersen published a paper that contained his now famous theorem: any bridgeless cubic graph has a\n1\n-factor. These days Petersen's theorem is always proven indirectly using major results such as\nHall\n's theorem from\n1935\nand\nTutte\n's theorem on\n1\n-factors from\n1947\n.\nAlthough the Petersen graph is usually the first time an undergraduate will today come across his name, this does not appear in this\n1891\nmasterpiece. In fact this ten-vertex graph appears in a later paper published in\n1898\n. It is reasonable to ask why Petersen began working in graph theory. In fact his aim was to discover results in invariant theory and he corresponded with\nSylvester\non this topic.\nIn\n[\n9\n]\nit is stated that:-\n... the work of Petersen and\nZeuthen\nis regarded as being responsible for the emergence of Danish mathematics on the international scene towards the end of the\n19\nth\ncentury.\nIn the last part of his career, from\n1888\nto\n1909\n, Petersen worked on function theory, latin squares, and number theory.\nPetersen contributed to many areas other than mathematics, some of which we have mentioned above. In addition to these he was a member of the \"kontrolkomité\" of the insurance company\nHafnia\n. Petersen was also a founder member of the\nDanish Mathematical Society\n, which came into existence in\n1873\n, and he remained a very active member of the Society. In\n1887\nhe was appointed a member of the Commission of Education for the Learned Schools which was an education inspectorate under the Ministry of Education.\nHis obituary states:-\nAmong Danish mathematicians he was the embodiment of the best sense of humour and the most vigorous joy of life.\nPerhaps his own words sum up best his attitude to his life:-\nWhen throughout life you have obtained honour and money for enjoying yourself, what more can you ask for!",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}