{
  "nome_completo": "Kamalakara",
  "nome_curto": "Kamalakara",
  "ano_nascimento": "1616",
  "ano_morte": "1700",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kamalakara/",
  "lugar_nascimento": "Benares (now Varanasi), India",
  "lugar_morte": "India",
  "biografia": "Kamalakara\nwas an Indian astronomer and mathematician who came from a family of famous astronomers. Kamalakara's father was Nrsimha who was born in\n1586\n. Two of Kamalakara's three brothers were also famous astronomer/mathematicians, these being Divakara, who was the eldest of the brothers born in\n1606\n, and Ranganatha who was younger than Kamalakara.\nAs was common throughout the classical period of Indian mathematics, members of the family acted as teachers to other family members. In particular Kamalakara was taught by his elder brother Divakara while Divakara himself had been taught by their uncle Siva. Pingree writes in\n[\n1\n]\n:-\n[\nKamalakara\n]\ncombined traditional Indian astronomy with Aristotelian physics and Ptolemaic astronomy as presented by Islamic scientists\n(\nespecially\nUlugh Beg\n)\n. Following his family's tradition he wrote a commentary, Manorama, on Ganesa's Grahalaghava and, like his father, Nrsimha, another commentary on the Suryasiddhanta, called the Vasanabhasya ...\nKamalakara's most famous work, the\nSiddhanta-tattva-viveka\n, was commented on by Kamalakara himself. The work was completed in\n1658\n. It is a work of fifteen chapters covering standard topics for Indian astronomy texts at this time. It deals with the topics of: units of time measurement; mean motions of the planets; true longitudes of the planets; the three problems of diurnal rotation; diameters and distances of the planets; the earth's shadow; the moon's crescent; risings and settings; syzygies; lunar eclipses, solar eclipses; planetary transits across the sun's disk; the patas of the moon and sun; the \"great problems\"; and a final chapter which forms a conclusion.\nThe third chapter of the\nSiddhanta-tattva-viveka\ncontains some of the most interesting mathematical results. In that chapter Kamalakara used the addition and subtraction theorems for the sine and the cosine to give trigonometric formulae for the sines and cosines of double, triple, quadruple and quintuple angles. In particular he gives formulae for\nsin\n⁡\n(\n1\n2\nA\n)\n\\sin(\\large\\frac{1}{2}\\normalsize A)\nsin\n(\n2\n1\n​\nA\n)\nand\nsin\n⁡\n(\n1\n4\nA\n)\n\\sin(\\large\\frac{1}{4}\\normalsize A)\nsin\n(\n4\n1\n​\nA\n)\nin terms of\nsin\n⁡\n(\nA\n)\n\\sin(A)\nsin\n(\nA\n)\nand iterative formulae for\nsin\n⁡\n(\n1\n3\nA\n)\n\\sin(\\large\\frac{1}{3}\\normalsize A)\nsin\n(\n3\n1\n​\nA\n)\nand\nsin\n⁡\n(\n1\n5\nA\n)\n\\sin(\\large\\frac{1}{5}\\normalsize A)\nsin\n(\n5\n1\n​\nA\n)\n. See for example\n[\n7\n]\nand\n[\n8\n]\nfor a discussion of the details of Kamalakara's work in this area.\nThe\nSiddhanta-tattva-viveka\nis a Sanskrit text and in it Kamalakara makes frequent use of the place-value number system with Sanskrit numerals. This and many other aspects of the work are discussed in\n[\n3\n]\n.",
  "math_areas": []
}