{
  "nome_completo": "Karel Rychlik",
  "nome_curto": "Karel Rychlik",
  "ano_nascimento": "1885",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rychlik/",
  "lugar_nascimento": "Benešov, Austria-Hungary (now Czech Republic)",
  "lugar_morte": "Prague, Czechoslovakia (now Czech Republic)",
  "biografia": "Karel Rychlik\n's parents were Vilém Evzen Rychlik and Barbora Srbová. He was the oldest of his parents three children, having a brother Vilém born in\n1887\n, and the youngest of the family was his sister Jana. The family only lived in Benesov for the first three years of Karel's life before they moved to Vlasim. It was in Vlasim, which is only about\n18\nkm south east of Benesov, that Karel began his primary education. In\n1896\n, at age eleven, he entered the\nGymnasium\nin Chrudim\n(\nabout\n70\nkm to the north east of Vlasim\n)\nbut he only studied for a year in this school before returning to Benesov, the town of his birth, where he entered the Gymnasium. Certainly his family moved frequently, for towards the beginning of\n1900\nthey moved yet again, this time to Prague, and Karel completed his schooling at the Academical Gymnasium School in Prague graduating with distinction in July\n1904\n. He had been awarded the first prize in a mathematics competition for each of his years at the Gymnasium in Prague.\nAfter graduating from the Gymnasium, Rychlik entered the Charles-Ferdinand University in Prague in October\n1904\n. He spent the session\n1907\n-\n08\nin Paris. At the Faculty of Science he attended lectures by a number of outstanding mathematicians such as\nJacques Hadamard\n,\nÉmile Picard\n,\nGaston Darboux\n,\nÉdouard Goursat\n, Louis Raffy, and\nPaul Painlavé\n. He also attended\nGeorges Humbert\n's lectures on number theory at the Collège de France. After he returned to Prague he completed the examinations to qualify him to teach in secondary schools in December\n1908\nand in March of the following year he was awarded his doctorate for his thesis on substitution groups\n(\npermutation groups in today's terminology\n)\n. Already before his doctorate had been conferred, Rychlik was appointed as an assistant at the Charles University in Prague although for the first year he was unpaid. He began to receive payment from December\n1909\nand then began to submit papers to be considered as his\nhabilitation\nthesis. The first of these was\nA Contribution to the theory of forms\n(\nsubmitted November\n1910)\n, followed by\nA Contribution to the theory of forms II\n(\nsubmitted June\n1911)\n. After giving an address\nThe Evolution of the Concept of Divisibility\nhe was appointed as a\ndozent\nin January\n1912\n. In this role Rychlik gave lectures on the\nTheory of Algebraic Fields\nand on the\nTheory of Algebraic Functions\n.\nIn\n1913\nRychlik's younger brother Vilém died at the age of\n26\n. Vilém had, like his older brother, studied mathematics and physics at the Charles University. After the award of his doctorate he had been appointed as an assistant in mathematics at the Czech Technical University in Prague and had a very promising career in front of him when he caught a cold and died three days later. Perhaps the fact that he smoked\n40\ncigarettes a day was a factor.\nFor Rychlik, having a position at the Charles University of Prague was a good thing in terms of status but it did not provide a sufficient income for him to live. So in addition he had to take on other employment which he did from July\n1913\nat the Czech Technical University in Prague. When World War I broke out, František Velisek who was a professor at the Technical University, enlisted in the army; he was killed in the war. Rychlik took over his lecture courses at the Technical University. He married in\n1918\nbut it was two years later, in November\n1920\n, that he was appointed as an extraordinary professor at the Technical University and for the first time received a good salary.\nRychlik's contributions cover a number of different areas. He did excellent work on algebra and number theory, for example he generalised\nHensel\n's ideas on\ng\ng\ng\n-adic numbers in\n1914\n, later approaching them via sequences and limits unlike the 'generalised decimal expansion' approach of\nHensel\n. He introduced the theory of pseudo-valuation in a paper in\n1916\n, twenty years before the corresponding definition by\nMahler\n, who is usually considered the founder of the theory. In fact it is easy to see why Rychlik did not receive as much credit for this work as one might expect for many of his papers were written in Czech and therefore not read outside his country. Rychlik is best known, however, for his contributions to the history of mathematics, particularly his work on Bernard\nBolzano\n.\nOn\n5\nMarch\n1924\nthe\nCzech Academy of Sciences\nset up the\nBolzano\nCommittee to edit and publish\nBolzano\n's manuscripts. Rychlik was one of eight members of this Committee and it was he who edited and provided notes for the first of the Committee's publications 'Bernard\nBolzano\n,\nSpisy Bernarda Bolzano - Bernard Bolzano's Schriften\nVol.\n1\n,\nFunctionenlehre, Edited and with notes by K Rychlik\n(\nKrálovská Ceská Spolecnost Nauk, Prague,\n1930)\n.' This publication comprised an edited version of\nFunctionenlehre\nⓉ\n(\nThe law of functions\n)\nwhich was written by\nBolzano\nbefore\n1834\n. It contains the famous\nBolzano\nfunction which is continuous on an interval\n[\na\n,\nb\n]\n[a, b]\n[\na\n,\nb\n]\nbut not monotonic on any subinterval. Given two points in the interval at which no derivative exists,\nBolzano\nshowed there was an point lying between them at which no derivative exists. Rychlik also edited and provided notes for the second of the Committee's publications 'Bernard\nBolzano\n,\nSpisy Bernarda Bolzano - Bernard Bolzano's Schriften\nVol.\n2\n,\nZahlentheorie, Edited and with notes by K Rychlik\n(\nKrálovská Ceská Spolecnost Nauk, Prague,\n1931)\n.' It contains part of\nBolzano\n's manuscript entitled\nZahlentheorie\nⓉ\n(\nNumber theory\n)\n, namely the part in which he presented the integers and their elementary properties.\nWhen World War II broke out in\n1939\nall the Czech universities were closed down. By the time that the war ended in\n1945\nRychlik was sixty years old and at that stage he thought he should retire; he formally retired from his university positions in\n1948\n. However he began to undertake deep research in the history of mathematics, and in particular he worked again on\nBolzano\n. Other works by Rychlik on\nBolzano\nfrom this later period of his research career include\nTheory of real numbers in the manuscripts left by Bolzano\n(\nCzech\n)\n(1956)\n,\nTheorie der reellen Zahlen im Bolzano's handschriftlichen Nachlasse\nⓉ\n(\nTheory of real numbers in Bolzano's handwritten notes\n)\n(1957)\n,\nBetrachtungen aus der Logik im Bolzano's handschriftlichen Nachlasse\nⓉ\n(\nConsideration of logic in Bolzano's handwritten notes\n)\n(\nCzech\n)\n(1958)\n,\nBetrachtungen aus der Logik in Bolzanos handschriftlichem Nachlasse\nⓉ\n(\nReflections on logic in Bolzano handwritten notes\n)\n(1958)\n,\nLa théorie des nombres réels de Bolzano d'après ses manuscrits inédits\nⓉ\n(\nThe theory of  real numbers  from the unpublished manuscripts of Bolzano\n)\n(\nRussian\n)\n(1958)\n, and\nTheorie der reellen Zahlen in Bolzanos handschriftlichem Nachlasse\nⓉ\n(\nTheory of real numbers in Bolzano handwritten notes\n)\n(1962)\n. Other works by Rychlik on the history of mathematics include\nA Cauchy manuscript in the archives of the Czechoslovakian academy of sciences\n(\nCzech\n)\n(1957)\n,\nUn manuscrit de Cauchy aux archives de l'académie tchécoslovaque des Sciences\nⓉ\n(\nA Cauchy manuscript in the archives of the Czechoslovak Academy of Sciences\n)\n(1957)\n,\nCauchys Schrift \"Mémoire sur la dispersion de la lumière\" herausgegeben während seines Aufenthaltes in Prag durch die Königliche böhmische Gesellschaft der Wissenschaften\nⓉ\n(\nCauchy's manuscript 'Memoir on the dispersion of light' published during his stay in Prague by the Royal Bohemian Society of Sciences\n)\n(1958)\n, and\nBerechnung der Grundzahl e der natürlichen Logarithmen\nⓉ\n(\nCalculation of the base number e of natural logarithms\n)\n(\nCzech\n)\n(1960)\n. In this last mentioned paper Rychlik looked at the calculation of\ne\ne\ne\nto\n225\ndecimal places carried out by the Czech mathematician Bohumir Tichánek in\n1890\nusing a\ncontinued fraction\nmethod. The\nCauchy\nmanuscript which Rychlik discussed in the above mentioned papers was\nMemoire sur l'intégration des équations differentielles\nⓉ\n(\nMemoir on the integration of differential equations\n)\nwhich was dated 'Prague\n1835\n' in\nCauchy\n's own hand. Because\nCauchy\nleft Prague in\n1836\n, this manuscript was not printed, as he had intended, in the Proceedings of the Société Royale des Sciences de Bohême.\nHyksová writes in\n[\n2\n]\nabout Rychlik's involvement with Societies and Academies:-\nIn\n1904\nRychlik became a member of the\nUnion of Czech Mathematicians and Physicists\nand until World War II he was also a member of its committee. Almost the whole of his life Rychlik lectured in the Union and his lectures were very closely related to his scientific research. He was also a member of the Royal Bohemian Society of Sciences\n(\nelected on\n11\nJanuary\n1922)\n, the\nCzech Academy of Sciences and Arts\n(23\nMay\n1924)\nand the Czechoslovak National Research Council under the Academy\n(19\nMay\n1925)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}