{
  "nome_completo": "Karl Walter Gruenberg",
  "nome_curto": "Karl Gruenberg",
  "ano_nascimento": "1928",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gruenberg/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "London, England",
  "biografia": "Karl Gruenberg\nwas born into a Jewish family in Vienna. While he was still a young child his parents separated and the young boy was brought up in a country which became increasingly hostile to those of Jewish origin. In\n1933\nHitler came to power in Germany and Dollfuss took control of Austria in what was essentially a Fascist coup. Austria attempted to remain independent of Germany but on\n12\nMarch\n1938\n, the day before a plebiscite was to be held on the independence issue, German troops invaded. Many Austrians of Jewish origin, seeing what was happening, tried to leave the country. The Kindertransport allowed Karl to be sent to England in March of\n1939\nbut life was not easy for the ten year old German speaking boy. He was extremely unhappy for a few months but life became somewhat easier when his mother was able to join him before World War II began in September\n1939\n.\nAt first Karl attended Shaftesbury Grammar School in Dorset. With Britain at war with Germany, life was not easy for a schoolboy who spoke German and little English. Gradually life got better and in\n1943\nKarl and his mother moved to London where he entered Kilburn Grammar School. Soon Gruenberg flourished, achieving excellent school grades, and his broad international based views meant he became very happy with his new life. He won a scholarship to study mathematics at Magdalene College, Cambridge, and after the award of a BA in\n1950\nhe continued to undertake research at Cambridge under\nPhilip Hall\n's supervision. Roseblade writes\n[\n2\n]\n:-\nBefore\nHall\n's lectures young mathematicians were mostly silent; only one stood out - Karl Gruenberg - always talking animatedly. That animation was characteristic; sometimes one felt he would never stop, particularly when he was in argumentative mood. But it was always friendly and he never had quarrels.\nBy this time Gruenberg had become a British citizen, all the procedures being completed by\n1948\n. He was awarded a doctorate in\n1954\nfor his thesis\nA Contribution to the Theory of Commutators in Groups and Associative Rings\n.\nBefore the award of his doctorate Gruenberg had published a number of papers such as\nSome theorems on commutative matrices\n(1951)\n,\nA note on a theorem of Burnside\n(1952)\n,\nTwo theorems on Engel groups\n(1953)\n, and\nCommutators in associative rings\n(1953)\n. The first and last of these papers were written jointly with M P Drazin. Also before he was awarded his PhD, Gruenberg had been appointed as an Assistant Lecturer in Mathematics at Queen Mary College, part of London University\n[\n1\n]\n:-\n... this was the first of\nKurt Hirsch\n's many inspired appointments.\nHe was awarded a Commonwealth Fund Fellowship which enabled him to spend\n1955\n-\n56\nat Harvard then\n1956\n-\n57\nat the Institute for Advanced Studies at Princeton\n[\n2\n]\n:-\nIn between he caught the travel bug that never left him.\nBack in England after his two years in the United States, Gruenberg returned to Queen Mary College where he was appointed as a Lecturer in Mathematics. He remained at Queen Mary College for the rest of his career being promoted to Reader in\n1961\n, then Professor in\n1967\n. He was Head of the Pure Mathematics Department at Queen Mary College from\n1973\nuntil\n1978\n. Roseblade writes\n[\n2\n]\n:-\n... throughout his\n70\ns, he was an active mathematical visitor to top-ranking universities all over the world. For many years he helped organise algebra meetings at the mathematical research institute in Oberwolfach, where he loved Black Forest walks. After dinner, he would take on all comers at table tennis - and win.\nGruenberg's first research topic led him to a study of\nEngel\ngroups. However the direction of his research moved towards cohomology theory, particularly its applications to group theory. Typical of this is his famous\nSome cohomological topics in group theory\nwhich appeared in the Queen Mary College Mathematics Notes series in\n1967\n. I B S Passi writes in a review:-\nThe subject of these notes - which are based on the lectures the author gave at Queen Mary College, London, in\n1965\n-\n6\nand at Cornell University in\n1966\n-\n7\n- is \"group theory with a cohomological flavour\". These notes are of great interest to workers in group theory who have some background in homological algebra.\nThe chapters are:\n(1)\nFixed point free action;\n(2)\nThe\ncohomology\nand homology groups;\n(3)\nPresentations and resolutions;\n(4)\nFree groups;\n(5)\nClassical extension theory;\n(6)\nMore cohomological machinery;\n(7)\nFinite\np\np\np\n-groups.  Results of many mathematicians such as\nBurnside\n,\nThompson\n,\nSerre\n,\nMac Lane\n,\nMagnus\n, Fox, Iwasawa, Golod, Safarevic, Roquette, and Gaschütz are discussed, but large parts of the work was based on results by Gruenberg himself. In\n1970\nthese notes were republished as\nCohomological topics in group theory\nby\nSpringer-Verlag\nwith four additional chapters:\n(8)\nCohomological dimension;\n(9)\nExtension categories: general theory;\n(10)\nMore module theory;\n(11)\nExtension categories: finite groups.\nIn\n1976\nhe published\nRelation modules of finite groups\nwhich appeared in the Conference Board of the Mathematical Sciences Regional Conference Series in Mathematics of the\nAmerican Mathematical Society\n. He writes in the Preface:-\nThis booklet reproduces a course of ten lectures that I gave at an N S F Regional Conference at the University of Wisconsin-Parkside\n22\nJuly-\n26\nJuly\n1974\n. The aim of the lectures was twofold. On the one hand, I wanted to show group theorists how the presentation theory of finite groups can nowadays be successfully approached with the help of integral\nrepresentation theory\n. On the other hand, I hoped to persuade ring theorists that here was an area of group theory well suited to applications of integral representation theory. As a result, the course had to be constructed so that only a modicum of either group theory or module theory would be presupposed of the audience. The aim of this printed version remains the same. To achieve it, I have felt it advisable to fill in and expand the Parkside lectures at a number of places. For this I have drawn on lectures that I gave at the Australian Summer Research Institute held at the University of Sydney in\n1971\nand at the Australian National University at Canberra in\n1974\n.\nMartin Dunwoody writes:-\nThe author gives an excellent account of the theory of the relation modules of finite groups. Practically all of the theory has previously appeared in papers of the author and his collaborators.\nIn addition to these research level texts, Gruenberg also published an undergraduate level text\n(\nwritten jointly with A J Weir\n)\nLinear geometry\n. L M Kelly writes:-\nThe authors observe that with a limited number of selective omissions the book could be used as a first course in linear algebra. The method of exposition is purely algebraic. The book is not graced\n(\nsullied\n)\nwith a single diagram because \"we feel that diagrams are of most help if drawn by the reader\". Thus the appeal is more to the algebraist than to the geometer. ... The writing style is direct, clear and efficient. The introduction of topics is generally well motivated. There are over\n250\nexercises mostly non-routine, designed \"to shed further light on the subject matter\".\nThe authors of\n[\n1\n]\nwrite about Gruenberg's \"forty almost continuous years at Queen Mary College\":-\nDuring this period Queen Mary College has become one of the major centres for Mathematics in Britain and Karl Gruenberg has been at the heart of that development. This is due not only to his mathematical ability but also his personality and enthusiasm for mathematics.\nGruenberg was always encouraging to his mathematical colleagues, and he showed particular kindness to those embarking on a mathematical career. I\n[\nEFR\n]\nremember the first\nBritish Mathematical Colloquium\nI attend at Swansea in\n1967\n. I gave a talk in the 'Group Theory' splinter group session on work which I was doing for my doctorate.\nKurt Hirsch\nand Karl Gruenberg sat in the front row and both made encouraging and helpful comments to me after my talk.\nAs to Gruenberg's life outside mathematics Wehrfritz writes\n[\n3\n]\n:-\nGruenberg was a very cultured person with many interests well outside of mathematics. Particular interests of his were the theatre, music, architecture and painting. Years ago, I remember him as a pretty nifty left-handed table tennis player, though he always wrote with his right hand.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}