{
  "nome_completo": "Karl Peter Heinrich Maruhn",
  "nome_curto": "Karl Maruhn",
  "ano_nascimento": "1904",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maruhn/",
  "lugar_nascimento": "Chemnitz, Germany",
  "lugar_morte": "Giessen, Germany",
  "biografia": "Karl Maruhn\n's parents were Karl Maruhn and his wife Charlotte Schmitz who was known as Lotti. Karl, the subject of this biography, studied at the Königin-Carola-\nGymnasium\nin Leipzig. He then  took courses in mathematics and physics at the University of Leipzig and the University of Tübingen. Of course, it was typical of German students of this time to take courses at more than one university. He undertook research on the mathematical theory of the formation of the celestial bodies and, along with Viktor Garten, he received a prize from the University of Leipzig in\n1928\nfor\nUntersuchungen über die Gestalt der Himmelskörper\nⓉ\n(\nStudies of the figure of the heavenly bodies\n)\n. This prize-winning work was published as a joint paper by Maruhn and Garten in\nMathematische Zeitschrift\nin\n1932\n.\nMaruhn was awarded his doctorate from the Faculty of Philosophy of the University of Leipzig in\n1930\nfor his thesis\nEin Beitrag zur mathematischen Theorie der Gestalt der Himmelsjörper\nⓉ\n(\nA contribution to the mathematical theory of the shape of heavenly bodies\n)\n. His thesis advisor was\nLeon Lichtenstein\n(1878\n-\n1933)\nand in the years before obtaining his doctorate Maruhn had been\nLichtenstein\n's assistant. The second examiner for his thesis had been Julius Bauschinger\n(1860\n-\n1934)\nwho, along with Gustave Stracke\n(1887\n-\n1943)\n, published\nTafeln zur theoretischen Astronomie\nⓉ\n(\nTables for theoretical astronomy\n)\nin\n1934\n. Maruhn's doctoral thesis was published as a\n20\n-page paper in\nMathematische Zeitschrift\nin\n1931\n.\nMaruhn sat the State examination to become a Gymnasium teacher in\n1931\nand he then taught at a number of different schools in Leipzig until\n1935\n. At first he was a trainee teacher, then a Studienassessor, that is a graduate teacher who has recently completed his training. During these years as a school teacher he was very active in research publishing the papers:\nÜber den Laplaceschen Ringkörper\nⓉ\n(\nOn the Laplace annulus\n)\n(\nsubmitted from Leipzig on\n26\nJanuary\n1932)\n,\nÜber den von Laplace postulierten Urkörper\nⓉ\n(\nOn the body shape postulated by Laplace\n)\n(\nsubmitted from Leipzig on\n6\nJanuary\n1933)\n,\nÜber einige Gleichgewichtsfiguren rotierender Flüssigkeiten, auf deren Oberflächen singuläre Punkte liegen\nⓉ\n(\nOn some equilibrium figures of rotating liquids on their surfaces singular points\n)\n(\nsubmitted from Leipzig on\n17\nNovember\n1933)\n,\nÜber zwei Gleichgewichtsfiguren rotierender inhomogener Flüssigkeit\nⓉ\n(\nOn two equilibrium figures of rotating inhomogeneous liquid\n)\n(\nsubmitted from Leipzig on\n14\nApril\n1934)\n, and\nÜber die Verzweigung der Lösung einer Integro-Differentialgleichung aus der Theorie der Gleichgewichtsfiguren rotierender Flüssigkeiten\nⓉ\n(\nOn the branching of the solution of an integro-differential equation of the theory of equilibrium figures of rotating liquids\n)\n(\nsubmitted from Leipzig on\n30\nOctober\n1934)\n. All these papers continue work done by Maruhn's former research advisor\nLeon Lichtenstein\n. In\n1934\nMaruhn married Eva Feldt.\nIn\n1935\nMaruhn became a research associate at the German experimental station for flight, the Deutschen Versuchsanstalt der Luftfahrt, which was situated in Berlin-Adlershorst. This German Research Institute for Aviation, founded in\n1912\n, was situated at the former Johannisthal-Adlershof airfield. During most of the time Maruhn worked there the director was Günther Bock. At the Institute Maruhn\n[\n2\n]\n:-\n... occupied himself with rigorous solutions for the flow around ellipsoidal bodies, and thereby obtained both beautiful and numerically valuable results.\nFrom Berlin, he submitted the paper\nZur Theorie der Gleichgewichtsfiguren rotierender inhomogener Flüssigkeiten\nⓉ\n(\nOn the theory of equilibrium figures of inhomogeneous rotating liquids\n)\nwhich was published in\n1936\n.\nIn\n1937\nMaruhn\nhabilitated\nat the Technische Hochschule in Berlin-Charlottenburg and began lecturing there in the following year. When World War II began in\n1939\nhis work at the Deutschen Versuchsanstalt der Luftfahrt became his contribution to the war effort. However, he also continued to lecture at the Technische Hochschule in Berlin-Charlottenburg. He published\nÜber ein Existenzproblem der Hydrodynamik\nⓉ\n(\nOn an existence problem of hydrodynamics\n)\n(\nsubmitted from Berlin on\n6\nOctober\n1938)\n, and\nZur eindeutigen Lösbarkeit der potentialtheoretischen Randwertaufgaben bei nichtbeschränkten Randwerten\nⓉ\n(\nOn unique solvability of the potential theoretical boundary value problems in non-restricted boundary values\n)\n(\nsubmitted from Berlin on\n13\nDecember\n1941)\n. In this last mentioned paper, Maruhn reminds the reader that the solutions of the boundary value problems for\nLaplace's equation\nare not unique when the boundary functions are allowed to assume infinite values. He then considers what restrictions must be placed on the boundary functions and the solution functions to insure uniqueness. His next paper\nEinige Bemerkungen zu den Randwertaufgaben der Potentialtheorie\nⓉ\n(\nSome remarks on the boundary value problems of potential theory\n)\n(1942)\nis in four parts and contains theoretical work on boundary value problems of potential theory which is applied, in the final part, to airfoil theory.\nHe continued to undertake these two roles in Berlin until\n1944\nwhen he was appointed as an Ordinary Professor of Applied Mathematics and head of the Department of Applied Mathematics at the German University of Prague. He worked in Prague, which was under German occupation, until May\n1945\nwhen the Czechs rebelled against the occupying Germans. Maruhn was arrested by the Czechs but, after being held for a while, was released. In\n1945\nhe became a lecturer at the University of Jena being promoted to extraordinary professor in\n1946\nand ordinary professor two years later. He was appointed as Director of the Mathematical Institute in Jena and he taught there until\n1949\n. At Jena, he continued his research on potential theory. He had submitted the paper\nÜber einige Klassen nichtlinearer Randwertaufgaben der Potentialtheorie\nⓉ\n(\nOn some classes of nonlinear boundary value problems of potential theory\n)\nto\nMathematische Zeitschrift\non\n18\nMarch\n1944\nbut, because of collapse of Germany in\n1945\n, the paper did not appear in print until\n1947\nby which time he had moved to Jena. He published\nPotentialtheorie\nⓉ\n(\nPotential theory\n)\nin\n1948\nwhich was reviewed by F W Perkins who wrote:-\nThis summary contains a brief account of papers on\n(\nA\n)\nspecial solutions of the potential equation,\n(\nB\n)\nboundary value problems,\n(\nC\n)\nconnections with boundary value problems for other differential equations,\n(\nD\n)\nconnections with the theory of functions,\n(\nE\n)\nbiharmonic functions.\nMaruhn published\nBemerkungen über das Verhalten von Potentialfunktionen im Unendlichen\nⓉ\n(\nComments on the behavior of potential functions at infinity\n)\nsubmitted from Jena on\n24\nJanuary\n1948\n. He left Jena in\n1949\nwhen he was appointed to the Technische Hochschule in Dresden. He was also the Director of the Institute for Pure Mathematics in Dresden. His first publication when in this new position was\nÜber die Potentiale von Belegungen auf unendlichen Flächen\nⓉ\n(\nOn the potentials of assignments on infinite surfaces\n)\n, submitted from Dresden on\n10\nJuly\n1952\n. J W Green writes in a review:-\nThe paper is devoted to obtaining bounds for the Newtonian potentials of single and double layers, and their derivatives, when the layers lie on a surface which extends to infinity.\nIn a collaboration with the algebraist Heinrich Grell\n(1903\n-\n1974)\nand the differential geometer and topologist Willi Ludwig August Rinow\n(1907\n-\n1979)\n, he edited a series of books aimed at teaching mathematics to Gymnasium pupils and college students. These books were entitled\nHochschulbücher für Mathematik\nⓉ\n(\nHigh school textbooks for mathematics\n)\n, the first,\nLehrgang der höheren Mathematik\nⓉ\n(\nCourse of higher mathematics\n)\n, was published in\n1953\n. By the time of Maruhn's death in\n1976\naround\n80\nbooks had appeared in the series and it continued to produce texts until\n1990\n.\nIn\n1958\n-\n59\nMaruhn spent a year as a Visiting Professor at the Justus-Liebig University of Giessen. He left his position in Dresden in\n1959\nwhen he was appointed as an ordinary professor at the University of Giessen. The chair had become vacant due to the death of Egon Ullrich in\n1957\n. He continued to work at Giessen for the rest of his career, retiring in\n1973\n. During the\n24\nyears he taught at Giesson, he was the doctoral advisor of more than a dozen students. He did take study leave during these years, spending\n1966\n-\n67\nas a visiting professor at the University of Waterloo in Canada. He published only a few papers during his time at Giessen the last,\nBemerkungen über singuläre Gleichgewichtsfiguren rotierender Flüssigkeiten\nⓉ\n(\nComments on singular equilibrium figures of rotating liquids\n)\n, being published in\n1971\n. In\n1973\nMaruhn was made professor emeritus by Giessen.",
  "math_areas": [
    "Applied Mathematics"
  ]
}