{
  "nome_completo": "Karl August Reinhardt",
  "nome_curto": "Karl Reinhardt",
  "ano_nascimento": "1895",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reinhardt/",
  "lugar_nascimento": "Frankfurt am Main, Germany",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Karl Reinhardt\n's ancestors were merchants and small-time farmers, some from Franconia and some from Bavaria. In\n[\n2\n]\nWilhelm Maier suggests that Reinhardt's character must have been inherited from these ancestors; as a consequence he was tough, daring, yet could show a light-hearted humour and was a sociable person. One of Karl's childhood friends was\nWilhelm Süss\n; the two were almost exactly the same age and they remained friends throughout their lives. Reinhardt attended school in Frankfurt am Main, studying at the\nGymnasium\nthere. He completed his schooling in\n1913\nand, later in the same year, entered the University of Marburg. Although his main subject was mathematics, he also studied physics, chemistry, and philosophy as part of his university degree.\nReinhardt had only been studying for a year at the University of Marburg when World War I broke out in the summer of\n1914\n. This caused severe disruption of Reinhardt's university education; he fought briefly in the war, served for a while as an assistant to\nDavid Hilbert\nat Göttingen, and spent some time teaching in secondary schools as part of his war service. Certainly there were positive aspects to these years, particularly the time he spent with\nHilbert\nat Göttingen.\nHilbert\n, who hated nationalist emotions, often talked about the political situation with Reinhardt but his greatest influence was to inspire in Reinhardt a passion for research in mathematics. Not only was this important in developing Reinhardt's character, but their discussions also encouraged Reinhardt to look at various problems that\nHilbert\ndeemed the most important.\nLudwig Bieberbach\nwas appointed to the Johann Wolfgang von Goethe University of Frankfurt in\n1915\n. He had written his\nhabilitation\nthesis, submitted in\n1911\n, on groups of Euclidean motions. In this thesis he had found conditions which forced the group to have a transitional subgroup, the vectors of which span Euclidean space. This was a step towards providing a solution to\nHilbert\n's Eighteenth Problem for it solved the first part, showing that there are only finitely many essentially different space groups in\nn\nn\nn\n-dimensional Euclidean space. It did not answer, however, the second part of the problem which asked if there existed a polyhedron which, although it is not the fundamental region of any space group, tiles\n3\n-dimensional Euclidean space. Reinhardt worked on these problems for his doctorate, advised by\nBieberbach\n. He submitted his thesis\nÜber die Zerlegung der Ebene in Polygone\nⓉ\n(\nOn the decomposition of the plane into polygons\n)\nto the University of Frankfurt in\n1918\n, graduating there on\n16\nJuly. He explained the background to the tiling problems coming from\nHilbert\n's Eighteenth Problem in the Introduction to the thesis. He then wrote:-\nTo investigate these questions, I was inspired by Professor Dr\nLudwig Bieberbach\n. I will not forget my revered teacher at this point, giving him my heartfelt thanks both for the hard work and great interest he has shown at all times ....\nIn his thesis Reinhardt found five convex pentagons that tile the plane in such a way that the automorphism group acts transitively on the tiles. At the time of writing of this biography\n(\nMay\n2012)\nfourteen different types of convex pentagons that tile the plane are known, see\n[\n3\n]\n. However, it is still an unsolved problem as to whether this list of\n14\ngives all possible such tilings.\nAfter World War I ended, Reinhardt qualified to teach mathematics, physics and philosophy in Gymnasiums. In addition to teaching, he worked towards gaining a qualification which would allow him to teach at university level and on\n7\nMay\n1921\nhabilitated\nat the University of Frankfurt after submitting his habilitation thesis\nÜber Abbildungen durch analytische Funktionen zweier Veränderlicher\nⓉ\n(\nOn images of analytic functions of two variables\n)\n.\nBieberbach\nand\nSüss\nhad both been at the University of Frankfurt up to\n1921\n, and\nBieberbach\nhad assisted Reinhardt with his habilitation thesis but, shortly after Reinhardt was appointed,\nBieberbach\nmoved to take up the Chair of Geometry at the University of Berlin and\nSüss\nwent with him as his assistant. At this stage Reinhardt was teaching both at secondary level and also at the University of Frankfurt, something which he struggled to do due to the poor state of his health. It was only with a very determined effort that he was able to do both jobs and to continue his research. In\n1922\n, continuing his research into polygons, he published\nExtremale Polygone gegebenen Durchmessers\nⓉ\n(\nExtremal polygons of a given diameter\n)\n.\nIn\n1924\nReinhardt left Frankfurt when he was appointed as an extraordinary professor of Pure and Applied Mathematics at the Ernst-Moritz-Arndt University of Greifswald. This was a position that provided him with a sufficient income to live comfortably without supplementing his income by teaching in secondary schools as he had done in Frankfurt. At this time\nJohann Radon\nwas the ordinary professor of mathematics at Greifswald, having succeeded\nFelix Hausdorff\nin\n1921\n. Over the next few years, Reinhardt undertook research on tiling\n2\n-dimensional space and also tilings in higher dimensional space. This led to the publication of six papers in the years\n1927\nand\n1928\n:\nZwei Beweise für einen Satz über die Zerlegung der Ebene\nⓉ\n(\nTwo proofs of a theorem on the decomposition of the plane\n)\n(1927)\n;\nAnalytische Flächen und Minimalflächen\nⓉ\n(\nAnalytical surfaces and minimal surfaces\n)\n(1927)\n;\nÜber die Zerlegung der hyperbolischen Ebene in konvexe Polygone\nⓉ\n(\nOn the decomposition of the hyperbolic plane in convex polygons\n)\n(1928)\n;\nÜber schlichte konforme Abbildungen des Einheitskreises\nⓉ\n(\nOn simple conformal mapping of the unit circle\n)\n(1928)\n;\nÜber die Zerlegung der euklidischen Ebene in kongruente Bereiche\nⓉ\n(\nOn the decomposition of the Euclidean plane into congruent areas\n)\n(1928)\n; and\nZur Zerlegung der euklidischen Räume in kongeuente Polytope\nⓉ\n(\nOn dividing the Euclidean spaces into congruent polytopes\n)\n(1928)\n. It was in the last of these papers that Reinhardt completed the solution of\nHilbert\n's Eighteenth Problem by finding a polyhedron which, although it is not the fundamental region of any space group, tiles\n3\n-dimensional Euclidean space.\nReinhardt was made an ordinary professor at Greifswald in\n1928\n. His friend\nWilhelm Süss\nhad been lecturing in Japan since\n1923\nand the two friends had exchanged letters. Reinhardt told\nSüss\nthat if he submitted his papers to Greifswald he could habilitate there and obtain a position.\nSüss\naccepted Reinhardt's suggestion and returned from Japan in\n1928\nto take up the lecturing post at Greifswald. Reinhardt supervised several doctoral students at the Ernst-Moritz-Arndt University of Greifswald, perhaps the best known being Theodor Schmidt who submitted his thesis\nÜber die Zerlegung des\nn-dimensionalen Raumes in gitterförmig angeordnete Würfel\nⓉ\n(\nOn the decomposition of n-dimensional space into cubes arranged in a lattice\n)\nin\n1933\n. In this thesis Schmidt proved a conjecture of\nHermann Minkowski\nin dimension\nn\nn\nn\n, where\nn\nn\nn\n<\n8\n. The conjecture was completely solved in\n1941\nwhen György Hajós verified the cases\nn\nn\nn\n≥\n8\n. Among Reinhardt's other doctoral students we mention Heinrich Engelhardt who submitted the thesis\nÜber die Zerlegung der euklidischen Ebene und des euklidischen Raums in kongruente Bereiche\nⓉ\n(\nOn the decomposition of Euclidean plane and Euclidean space into congruent areas\n)\nin\n1933\n, and Heinrich Voderberg who also studied tiling problems in\nForm eines Neunecks eine Lösung zu einem Problem von Reinhardt\nⓉ\n(\nOn a nonagon as a solution to a problem of Reinhardt\n)\n(1934)\n.\nIn addition to his innovative research career, Reinhardt was interested in teaching, particularly looking at ways to make mathematics more understandable to students at the beginning of their university careers. In\n1934\nhe published the book\nMethodische Einfuhrung in die Hohere Mathematik\nⓉ\n(\nMethodological introduction to higher mathematics\n)\nwhich contained a novel approach to teaching calculus. J R Musselman begins a review of this book as follows\n[\n3\n]\n:-\nThe author believes that a youth can comprehend and understand the idea of finding the area between a curve and the x-axis much easier than he can assimilate the notion of the slope of a tangent to the curve. For the German schoolboy has made determinations of area - such as the quadrature of the circle - in his secondary school training long before he has taken up the measurement of the slope of tangent lines. On account of this belief Professor Reinhardt has presented us with a book in which integral calculus is developed first, completely independent of differential calculus; in fact the latter appears simply as the inverse operation of the former. The text has been planned for use by the German youth when he first arrives at the University and to form a connecting link with his previous mathematical preparation. Although it represents an introduction to the calculus, it cannot be compared with our ordinary calculus texts; the American youth would find difficulty in studying it before his junior or senior year as it contains many topics which appear here in courses on the theory of functions of a real variable. The choice of material includes not only the integration of the ordinary simple functions, but contains also the derivation of the fundamental rules for manipulating integrals, such as the methods for introducing new variables and for integrating a product of two functions. Lack of space confines the author to limit his discussion to the study of the functions of a single variable; nevertheless among its pages we find a proof of the irrationality of π and a chapter on the fundamental law of algebra.\nBy this stage in his career, Reinhardt was in an excellent position with an outstanding research record and a reputation as a fine, thoughtful teacher. He was married with one daughter and Reinhardt's father also lived with the family in Greifswald. However, Reinhardt's health had always been delicate and this prevented his continuing a successful career. His wife took care of him as his health sank lower but, in the end, after suffering for a long time, he died in Berlin at the age of forty-six. Maier writes\n[\n2\n]\n:-\nIn him we lose a German mathematician, a geometer of marked individuality ...",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}