{
  "nome_completo": "Karl Menger",
  "nome_curto": "Karl Menger",
  "ano_nascimento": "1902",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Menger/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Karl Menger\n's father, Carl Menger\n(1840\n-\n1921)\nwas a famous economist, a professor at the University of Vienna, and founder the Austrian School of Economics. Karl's mother was Hermine Andermann\n(1869\n-\n1924)\n, a journalist, author and musician. Carl was Roman Catholic and Hermine was Jewish so, although they lived together, the two could not marry\n(\nall marriages in Austria at this time were religious ceremonies\n)\n. When their only child Karl\n(\nthe subject of this biography\n)\nwas born in\n1902\nthis was seen as unacceptable by the Viennese social conventions and Carl was forced to withdraw from public life. He stopped teaching at the University of Vienna as soon as his son was born and he resigned his chair at the University a year later. Carl applied to Emperor Franz Joseph of Austria to have his son Karl made legitimate and his request was eventually granted. Twenty-five years earlier, Carl Menger had given Franz Joseph a three month course on economics.\nKarl Menger attended the Döblinger\nGymnasium\nin Vienna\n(1913\n-\n1920)\nwhere two of his fellow students were\nWolfgang Pauli\nand Richard Kuhn\n(1900\n-\n1967)\n. It is worth noting that Kuhn was awarded the Nobel Prize for Chemistry in\n1938\nand\nPauli\nwas awarded the Nobel Prize for Physics in\n1945\n. One of the students in Menger's class was Heinrich Schnitzler\n(1902\n-\n1982)\nwho went on to become an actor and film director. Heinrich Schnitzler was the son of the famous author Arthur Schnitzler\n(1862\n-\n1931)\nand, at this stage, Menger had ideas of writing dramas. This was not an easy time to be growing up in Vienna for, after the outbreak of World War I, in September\n1914\nthe Döblinger Gymnasium building was converted into a war hospital, and teaching was transferred to a secondary school building in the Krottenbachstrasse. In February\n1916\nthe war hospital closed and pupils returned to the original building. The years following the end of World War I in\n1918\nwere particularly hard at the school. Political events such as the end of the monarchy forced major educational changes and the Gymnasium became a state school. After Menger graduated from the Döblinger Gymnasium, he entered the University of Vienna in\n1920\nto study physics. He had not given up his idea of writing dramas, for at this time he began to write a drama about the apocryphal Pope Joan.\nAt the University of Vienna, Menger attended physics lectures by the theoretical physicist Hans Thirring\n(1888\n-\n1976)\nwho had made significant contributions to the theory of general relativity. However\nHans Hahn\nbecame a lecturer in Vienna in March\n1921\nand Menger attended a course he gave on\nWhat's new concerning the concept of a curve\n. Seymour Kass writes\n[\n21\n]\n:-\nIn the first lecture\nHahn\nformulated the problem of making precise the idea of a curve, which no one had been able to articulate, mentioning the unsuccessful attempts of\nCantor\n,\nJordan\n, and\nPeano\n. The topology used in the lecture was new to Menger, but he \"was completely enthralled and left the lecture room in a daze\"\n[\n1\n]\n. After a week of complete engrossment, he produced a definition of a curve and confided it to fellow student\nOtto Schreier\n, who could find no flaw but alerted Menger to recent commentary by\nHausdorff\nand\nBieberbach\nas to the problem's intractability, which\nHahn\nhadn't mentioned. Before the seminar's second meeting Menger met with\nHahn\n, who, unaccustomed to giving first-year students a serious hearing, nevertheless listened and after some thought agreed that Menger's was a promising attack on the problem.\nAlthough Menger was now fascinated in the topic and was encouraged by\nHahn\nto work on it, he was diagnosed with tuberculosis and went to a sanatorium in Aflenz in the mountains of Styria in southern Austria. Menger's mathematical investigations, carried out in the sanatorium, led him to a definition of dimension independently of\nPavel Urysohn\n. However\nUrysohn\nhad died in a drowning accident before he could publish his work and Menger was not aware of it. The severe lung disease forced Menger to spend more than a year in the sanatorium, but he returned to Vienna with important papers he had written on dimension while in the sanatorium and, advised by\nHahn\n, completed his doctorate in\n1924\nwith his thesis\nÜber die Dimensionalität von Punktmengen\nⓉ\n(\nOn the dimensionality of point sets\n)\n. This was not the only work Menger undertook at this time. His father, Carl Menger, had died while Menger was in the sanatorium and had left the second edition of his book\nGrundsätze der Volkswirthschaftslehre\nⓉ\n(\nPrinciples of teaching economics\n)\n(1\nst  edition\n1871)\nunfinished. Menger completed his father's work and supervised the publication of the second edition which appeared in\n1922\n. By the time he had completed this work, Menger had gained considerable expertise in economics.\nIn March\n1925\nMenger was invited by\nL E J Brouwer\nto use his recently won Rockefeller Fellowship to come to the University of Amsterdam where he spent two years working as\nBrouwer\n's assistant. He wrote from Amsterdam to his girlfriend Hilda Axamit, an actuarial mathematics student, in Vienna\n[\n22\n]\n:-\nI am lecturing on the calculus of variations. Personally, I am occupied by geometry of all kinds, furthermore by epistemology. I hope I'll get the energy to put together my views about the problem of truth. In the last weeks, I have had so many ideas that I don't have any time at all to write them down, and run away every evening to distract myself ... in order not to overwork. Apart from that, I curse the fact that I am not in Vienna but rather here. I can't get used to living here, and I will try my best to leave here forever in the month of June.\nIn\n1927\nMenger was invited by Hahn to accept the chair of geometry at the University of Vienna when\nKurt Reidemeister\nleft for Königsberg. Menger was not sorry to leave Amsterdam since he had become involved in a priority dispute with\nBrouwer\nand they were not on the best of terms. However, he certainly respected\nBrouwer\n[\n21\n]\n:-\nThough he found\nBrouwer\ntesty, he retained warm feelings about his stay in Amsterdam and cited the good\nBrouwer\ndid for some young mathematicians and \"the beautiful experience of watching him listen to reports of new discoveries\".\nIn Vienna, Menger became a member of the Vienna Circle which comprised philosophers, mathematicians and logicians. He also started up the Mathematical Colloquium in Vienna in\n1928\nwhich was addressed by leading mathematicians and Menger published the Proceedings. Steve Abbott, reviewing a\n1998\nreprinting of the Proceedings, writes\n[\n3\n]\n:-\nThe 'Ergebnisse eines Mathematischen Kolloquiums' were published in Vienna between\n1929\nand\n1937\n. The eight issues included many contributions by highly respected mathematicians but suffered from a limited distribution, and few complete sets remain. This book reprints all the articles\n(\nin German\n)\nalong with chapters\n(\nin English\n)\nsurveying the important developments in economics, logic, topology and geometry that were reported in the 'Ergebnisse'. The 'Kolloquiums' were organised by Karl Menger at the University of Vienna, initially in response to a request from some of the mathematical students there. The meetings included a mixture of lectures, discussions of unsolved problems and reviews of recent work. Menger kept a record of the meetings and published the notes through Teubner Verlag or Deuticke. ... It is the stellar collection of 'Kolloquium' speakers that justifies the reprinting of the papers. There are contributions from\nČech\n,\nGödel\n, Menger, Popper,\nTarski\n,\nTaussky\n,\nvon Neumann\n,\nWald\nand\nWiener\n.\nIn\n1928\nMenger published the book\nDimensiontheorie\nⓉ\n(\nDimension theory\n)\n.. Paul Althaus Smith\n(1900\n-\n1980)\nwrites in a review\n[\n37\n]\n:-\nThere is an important phase in the development of modern point set theoretical geometry which has been closely associated with the concept of dimensionality, - we refer to the attempt to create precise mathematical meaning for the simple geometric spaces of our intuition in terms of primitive non-arithmetical concepts. That the idea of dimensionality should have come into play and itself have been studied and made precise is indeed natural, since the curves, surfaces, and solids of our experience furnish the very basis for our intuitive ideas of dimensionality. ...\n[\nA definition of dimension\n]\nwas introduced by Professor Karl Menger of Vienna and developed in a sequence of shorter papers characterized by their elegance and generality. The essentials of the dimensionality theory, which has by now attained a considerable perfection through the recent writings of Menger,\nHurewicz\n,\nP S Aleksandrov\nand others, have been developed with admirable clarity and completeness in a recently published book by Professor Menger.\nOf course, more sophisticated ideas on dimension continue to be developed. However, James Kesling, in a\n1977\nreview of another work, wrote of Menger's\nDimensiontheorie\nⓉ\n(\nDimension theory\n)\n:-\nIt reveals at one and the same time the naiveté of the early investigators by modern standards and yet their remarkable perception of what the important results were and the future direction of the theory.\nMenger spent the academic year\n1930\n-\n31\nin the United States. He visited Harvard University and the Rice Institute in Houston, Texas. Before Menger went to the United States,\nKurt Gödel\nhad joined his Mathematical Colloquium. While in the United States, Menger kept in touch with the Colloquium in Vienna through Georg Nöbeling and also corresponded with\nGödel\n. For example, in early\n1931\nhe wrote:-\nI am replying to your charming letter in a moving train and therefore by typewriter. Nöbeling had already written to me last autumn about your great discovery. I read your article with the utmost interest and immediately delivered a report on it here. I rank your achievement among the greatest of modern logic and send you my heartiest congratulations.\nBack in Vienna, Menger published\nKurventheorie\nⓉ\n(\nCurve Theory\n)\nin\n1932\n. Wallace Alvin Wilson writes\n[\n42\n]\n:-\nThe book under discussion is to be the second volume of a work entitled 'Mengentheoretische Geometrie'. In addition to being the first treatise on the theory of curves and their topological properties, the book performs the further service of gathering together in an organic whole much of the research work on this subject done since the war - work which, from the nature of its piecemeal appearance, must have seemed to many to be of a pointless character.\nThis book contains Menger's '\nn\nn\nn\n-Arc Theorem', described by\nFrank Harary\nas:-\n... one of the most important results in graph theory ... the fundamental theorem on connectivity in graphs.\nMenger attended the International Congress of Mathematicians in Zürich in September\n1932\nwhen he gave one of the plenary addresses on\nNeuere Methoden und Probleme der Geometrie\nⓉ\n(\nNew methods and problems of geometry\n)\n. He became engaged to his girlfriend Hilda Axamit and in\n1934\nthey spent a holiday together in Ramsau and Strobl. They married on\n5\nDecember\n1934\nand had four children; Karl Jr\n(\nborn\n9\nJuly\n1936)\n, twins Rosemary and Fred\n(\nborn\n13\nDecember\n1937)\n, and Eve\n(\nborn\n1942)\n. When Hitler came to power in Germany in\n1933\n, Menger soon realised the problems that lay ahead for Austria. Steve Abbot, writing about Menger's Colloquium, explains\n[\n3\n]\n:-\nThe Ergebnisse was criticised at the time for having 'too many Jewish contributors'. With the rise of the Nazis in Germany, it was only a matter of time before the political situation in Austria forced the end of the Kolloquium meetings. Menger left the country a year before the Anschluss.\nThe problems had become very real to Menger when, in June\n1936\n, Moritz Schlick\n(\nprofessor of philosophy in Vienna and one of the founders of the Vienna Circle\n)\nwas shot dead by a student. A month later Menger, still stunned by the tragedy, was in Oslo at the International Congress of Mathematicians. He explained to everyone how the situation in Vienna was deteriorating fast. Soon after this he was offered a chair at the University of Notre Dame, Indiana and he went to the United States in\n1937\nto take up the post. At this stage he kept open his chair in Vienna but, in March\n1938\n, as a result of the political situation in Austria, he resigned his chair in Vienna. Certainly at this stage he was still expecting to return to Vienna after the war but, as Karl Signund writes:-\nAfter the war, the reconstruction of the bombed-out State Opera was accorded highest priority by democratic new Austria. Men like ... Menger, however, were politely told that the University of Vienna had no place for them.\nAt Notre Dame, Menger was a colleague of\nEmil Artin\nwho was escaping from the Nazis and spent the year\n1937\n-\n38\nthere. Also on the staff at Notre Dame was Paul Milton Pepper\n(1909\n-\n2010)\nwho had just completed his doctorate at the University of Cincinnati. Menger, with these two colleagues and a couple of others, set up a Ph.D. programme at Notre Dame. Menger also organised a Mathematical Colloquium based on the one he had set up at Vienna and began publishing\nReports of a Mathematical Colloquium\nin\n1938\n. He arranged a visit by\nGödel\nto Notre Dame but failed to persuade him to accept a post there. However after the war began to affect the United States in\n1941\n, academic life was disrupted and Menger's Mathematical Colloquium failed to become as influential as the Vienna Circle had been. The\nReports\nstopped publication in\n1946\n. Rudolf Carnap, one of Menger's colleagues in the Vienna Circle, had also emigrated to the United States and had set up the Chicago Circle. Even while Menger was running his own Colloquium at Notre Dame, he still made the effort to attend Carnap's Chicago Circle whenever possible.\nAround this time Menger's interests in mathematics broadened and he began to work on hyperbolic geometry, probabilistic geometry and the algebra of functions. Menger's work on geometry failed to have the impact that his work on dimension theory had. This is almost certainly because geometry, at this time, was a rather neglected area of mathematics, particularly in the United States. Also during the war years Menger's contribution to the war effort was teaching calculus to Naval cadets as part of the V-\n12\nNavy College Training Program which ran from\n1942\nto\n1944\n. This led to his interest in mathematical education and, during the\n1950\ns and\n1960\ns, he wrote articles on mathematical education and published books with new ideas on teaching calculus, geometry and other branches of mathematics.\nAn article  by Menger on teaching is available at\nTHIS LINK\nand\nreviews of Karl Menger's books are at\nTHIS LINK\n.\nThe visits that Menger made to Carnap's Chicago Circle led to him feeling that Chicago would be both a better place for him to work and a better place for his children to be educated. The chairman of the mathematics department at the Illinois Institute of Technology in Chicago was\nLester R Ford\nwhom Menger had known from the time of his\n1931\nvisit to the Rice Institute in Houston, Texas. Menger talked to\nFord\nabout wanting to move to Chicago and\nFord\nwas soon in a position to make him an offer. In\n1948\nMenger went to the Illinois Institute of Technology and he was to remain in Chicago for the rest of his life. Seymour Kass, who was a colleague of Menger's at Chicago during the\n1960\ns, writes\n[\n21\n]\n:-\nMenger has been described as a fiery personality. As a junior faculty member at IIT in the\n1960\ns, I found him gracious, charming, and vivacious. Menger was solicitous of students. From his early days in Vienna onward he invited students and faculty to his home. In Chicago it included a tour of his decorative tile collection, which lined the walls of his living room. And he sometimes invited doctoral students for early morning mathematical walks along Lake Michigan. His office was a showplace of chaos, the desktop covered with a turbulent sea of papers. He knew the exact position of each scrap. On the telephone he could instruct a secretary exactly how to locate what he needed. Once, in his absence, a new secretary undertook to \"make order\", making little stacks on his desk. Upon his return, discovering the disaster, he nearly wept, because \"Now I don't know where anything is.\"\nMenger taught in Chicago until he retired in\n1971\n.\nWe have seen how Menger's interests extended beyond mathematics to philosophy and economics. Donald Gillies, in his fascinating paper on 'Karl Menger as a Philosopher', writes\n[\n13\n]\n:-\nMenger is not always given his due recognition as a philosopher. In fact ..., many important ideas of the Vienna Circle originated with Menger - though they are often attributed to others. Moreover, Menger's own philosophy of mathematics\n(\nfor which I have coined the name: 'laissez-faire formalism'\n)\nis the implicit philosophy of many working mathematicians. Generally, Menger could be described as the most logical positivist of them all.\nIn\nAustrian Marginalism and Mathematical Economics\n(1973)\n, Menger writes:-\nSince I am the son of the author of the 'Grundsätze' as well as a mathematician, 'two souls reside within my breast '. I hope that this fact will help me in discussing various points of the controversy objectively.\nKarl Sigmund, reviewing Menger's paper, writes:-\nBy bringing together economists and mathematicians, Menger had played a catalytic role for which he was uniquely predisposed by his upbringing and education.\nIn\n[\n1\n]\nhis interests are described as follows:-\nHe had a great love of music. ... he built up a notable collection of decorative tiles from all over the world. ... he ate meat sparingly, particularly in his last years. But he was always glad to sample cuisines, from Cuban to Ethiopian, that were new to him. He liked baked apples.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}