{
  "nome_completo": "Karl Heun",
  "nome_curto": "Karl Heun",
  "ano_nascimento": "1859",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heun/",
  "lugar_nascimento": "Wiesbaden, Germany",
  "lugar_morte": "Karlsruhe, Germany",
  "biografia": "Karl Heun\nwent to school in Wiesbaden and he began his study in mathematics and philosophy in\n1878\nin Göttingen\n(\nwith Ernst Schering, Alfred Enneper,\nHermann Amandus Schwarz\n)\n. After two years he moved to Halle to study with\nEduard Heine\nwho, in\n1861\n, had published his famous book on spherical harmonics. The first part of this book appeared in its second edition in\n1878\n. Heun stayed in Halle only between April and October\n1880\n, probably due to the deteriorating health of\nHeine\nwho died in\n1881\n.\nHe returned to Göttingen and started with his thesis which was inspired by\nHeine\nand supervised by the astronomer Ernst Schering. His\n1881\ndoctoral thesis bears the title\nDie Kugelfunctionen und Laméschen Functionen als Determinanten\nⓉ\n(\nThe spherical harmonics and Lamé functions as determinants\n)\n. After his doctorate he worked as an instructor at an agricultural winter school in Wehlau\n(\neastern Prussia\n)\n. This led to his qualification as teacher for secondary schools in Prussia.\nHeun then moved to England and taught for two and a half years\n(1883\n-\n1885)\nat the Public School in Uppingham. In\n1885\n/\n86\nhe complemented his studies in London. His Munich\nhabilitation\nthesis from July\n1886\nis entitled\nÜber lineare Differentialgleichungen zweiter Ordnung, deren Lösungen durch den Kettenbruchalgorithmus verknüpft sind\nⓉ\n(\nOn linear second order differential equations whose solutions are linked by the continued fraction algorithm\n)\n. From\n1886\nto\n1889\nhe lectured at the University of Munich on topics like: the theory of rational functions and their integrals, the theory of linear differential equations, introduction to the theory of linear substitutions and the general theory of differential equations. The seminal work from his time at Munich is\nZur Theorie der Riemann'schen Functionen zweiter Ordnung mit Vier Verzweigungspunkten\nⓉ\n(\nOn the theory of Riemann functions of the second order with four branch points\n)\n[\n3\n]\n.\nDue to lack of financial support he left Munich and worked again as a teacher in Berlin from\n1890\nto\n1902\n. At this time he became known in Germany, mainly due to his\n1899\naddress at the Munich meeting of the DMV\n(\nDeutsche-Mathematiker-Vereinigung\n)\nwhose complete version was published as\nDie kinetischen Probleme der wissenschaftlichen Technik\nⓉ\n(\nThe kinetic problems of scientific technology\n)\n[\n5\n]\n.\nIn\n1900\nHeun was honoured with the title professor, and in\n1902\nhe was nominated as first candidate for the vacant chair in technical mechanics at Technische Hochschule Karlsruhe. He had been recommended by\nFelix Klein\n. Heun accepted this offer and stayed in Karlsruhe until his death in\n1929\n.\nIn\n1883\nHeun had married a widow Henriette Jatho\n(\nnée Bock\n)\nwith two children Alfred and Paul Jatho; together they had a son Howard\n(1884\n-\n1902)\nand a daughter Charlotte\n(1891\n-\n1948)\n.\nIn\n1912\nhe was honoured with the title 'Geheimer Hofrat'. Technische Hochschule Berlin-Charlottenburg awarded him an honorary doctorate in\n1921\n.\nHis assistants in Karlsruhe were\nGeorg Hamel\n(\nfrom\n1902\nto\n1905)\n, Max Winkelmann\n(\nfrom\n1905\nto\n1911)\nand Fritz Noether\n(\nfrom\n1911\nto\n1918)\n. Kurt von Sanden was his student from\n1905\nto\n1909\n, and he became Heun's successor in\n1923\n.\nHeun did not recover from a stroke he suffered in\n1921\nand retired in\n1922\n.\nThe Heun equation is a second order linear differential equation of the Fuchsian type with four singular points. It generalizes the\nhypergeometric\ndifferential equation which has three singular points, and is used today in mathematical physics, e.g. in the context of integrable systems.\nd\n2\ny\nd\nz\n2\n+\n(\nγ\nz\n+\nδ\nz\n+\n1\n+\nϵ\nz\n−\na\n)\nd\ny\nd\nz\n+\nα\nβ\nz\n−\nq\nz\n(\nz\n−\n1\n)\n(\nz\n−\na\n)\ny\n=\n0\n\\Large\\frac{d^{2}y}{d z^{2}}\\normalsize + \\Large\\left(\\frac{\\gamma}{z}\\normalsize + \\Large\\frac{\\delta}{z+1}\\normalsize  + \\Large\\frac{\\epsilon}{z-a}\\right)\\frac{dy}{dz}\\normalsize + \\Large\\frac{\\alpha\\beta z - q}{z(z-1)(z-a)}\\normalsize y =0\nd\nz\n2\nd\n2\ny\n​\n+\n(\nz\nγ\n​\n+\nz\n+\n1\nδ\n​\n+\nz\n−\na\nϵ\n​\n)\nd\nz\nd\ny\n​\n+\nz\n(\nz\n−\n1\n)\n(\nz\n−\na\n)\nα\nβ\nz\n−\nq\n​\ny\n=\n0",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}