{
  "nome_completo": "Karol Borsuk",
  "nome_curto": "Karol Borsuk",
  "ano_nascimento": "1905",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borsuk/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Karol Borsuk\n's father, Marian Borsuk, was a surgeon in Warsaw while his mother was Zofia Maciejewska. Karol attended school in Warsaw but with World War I beginning before Karol had begun secondary school, major changes occurred in Poland.\nIn August\n1915\nthe Russian forces which had held Poland for many years withdrew from Warsaw. Germany and Austria-Hungary took control of most of the country and the University of Warsaw was refounded and it began operating as a Polish university. Rapidly a strong school of mathematics grew up in the University of Warsaw, with\ntopology\nbeing one of the main topics. This was begun by\nJaniszewski\nand\nMazurkiewicz\nthen carried further by\nKuratowski\nand\nSierpiński\n. When Borsuk entered the University of Warsaw to study mathematics it was an exciting centre for research in topology;\nSaks\nand\nMazurkiewicz\nwere both teaching at the University and making major advances in the topic.\nBorsuk obtained his master's degree from the University of Warsaw in\n1927\nand then, from\n1929\n, he taught at the University. He continued to study for his doctorate, under the supervision of\nMazurkiewicz\n, and this was awarded in\n1930\nfor his dissertation\nSur les rétractes\nⓉ\n(\nOn retractions\n)\n(\npublished in\n1931)\nin which he invented the theory of retracts. On\n26\nApril\n1936\nBorsuk married Zofia Paczkowska. They would have two children, both girls.\nThe second centre for mathematical research in Poland at this time was Lwów. Borsuk visited there and during one such visit began a collaboration with\nUlam\n. In\n[\n3\n]\nUlam\ndescribes their joint mathematical projects:-\nWe started collaborating from the first. From him I learned about the truly geometric, more visual, almost \"palpable\" tricks and methods of topology. Our results were published in a number of papers which we sent to Polish journals and to some journals abroad. Actually my first publication in the United States appeared while I was in Lwów. It was a joint paper with Borsuk, published in the Bulletin of the\nAmerican Mathematical Society\n. We defined the idea of \"epsilon homeomorphism\" - approximate homeomorphisms - and the behaviour of some topological invariants under such more general transformations - continuous ones, but not necessarily one to one. A joint paper on symmetric products introduced an idea that modifies the definition of Cartesian product and leads to the construction of some curious\nmanifolds\n.\nIn Lwów Borsuk joined the mathematicians in the Scottish Café and contributed to the open problems which they wrote down in the famous book. In fact in\n1938\nhe posed questions about the\nHilbert\ncube and doing so, as Keesling remarks in\n[\n1\n]\n:-\nBorsuk showed exceptional insight in conceiving of this result so early in his career.\nYou can see a picture of the Scottish Café at\nTHIS LINK\n.\nBorsuk's career was of course about to be interrupted by the start of World War II. After the German invasion of Poland in\n1939\n, life there became extremely difficult. There was a strategy by the Germans to put an end to the intellectual life of Poland and in attempting to achieve this aim they sent many academics to concentration camps and murdered others. The Poles had experience of surviving such attacks, however, and they employed the same tactics as they had during the period of Russian domination and they organised an underground university in Warsaw.\nKuratowski\nwrites in\n[\n2\n]\n:-\nAlmost all our professors of mathematics lectured at these clandestine universities, and quite a few of the students then are now professors or\ndocents\nthemselves. Due to that underground organisation, and in spite of extremely difficult conditions, scientific work and teaching continued, though on a considerably smaller scale of course. The importance of clandestine education consisted among others in keeping up the spirit of resistance, as well as optimism and confidence in the future, which was so necessary in the conditions of occupation. The conditions of a scientist's life at that time were truly tragic. Most painful were the human losses.\nDuring the Nazi occupation Borsuk tried to keep the University of Warsaw functioning in the way that\nKuratowski\ndescribes in the quote above. However, he was unable to do this without being found out by the Nazis and he was imprisoned for this \"crime\". Borsuk, however, escaped and was able to survive by remaining in hiding throughout the rest of the war.\nBy the end of World War II the whole educational system had been destroyed and so needed to be completely rebuilt. Borsuk and\nKuratowski\nboth played important roles in this reconstruction. Borsuk continued in his post in the University of Warsaw, a post he held throughout his career, being promoted to professor in\n1946\n. He spent some time in the United States with a number of one year appointments. He was at the Institute for Advanced Study at Princeton during session\n1946\n-\n47\n, the University of California at Berkeley during session\n1959\n-\n60\n, and the University of Wisconsin at Madison during session\n1963\n-\n64\n.\nIn Warsaw, Borsuk led a seminar in which he developed a unique atmosphere of successful international cooperation. He influenced strongly the development of the whole area of infinite-dimensional topology with his theory of retracts and his theory of shape which became major topics for discussion at his seminar.\nBorsuk introduced the important concept of absolute neighbourhood retracts in his doctoral dissertation, published in\n1931\n, which was to lead to new and fruitful ideas in metric\ndifferential geometry\n, see\n[\n11\n]\nfor details. In\n1936\nhe introduced the notion of cohomotopy groups, see\n[\n8\n]\nfor details, which could be said to mark the beginning of stable\nhomotopy theory\n. Also in\n[\n8\n]\nBorsuk's concept of the divisor of a map, which he introduced in\n1956\n, is discussed. The paper\n[\n12\n]\ndescribes Borsuk's work in shape theory from the time he introduced the concept in\n1968\n. The notion had immediate impact on other topologists, and in particular on Borsuk's own students. Shape theory grew up at the same time as infinite-dimensional topology and the interaction between the two fields was of great mutual benefit. The author of\n[\n11\n]\nemphasises the importance of the many deep questions which Borsuk posed which stimulated most of the top mathematicians working in the area.\nMany honours were given to Borsuk for his remarkable contributions. He became vice director of the Mathematical Institute of the\nPolish Academy of Sciences\nin Warsaw in\n1956\n. He was granted honorary life membership in the\nPolish Mathematical Society\nin\n1978\nand the address, relating the importance of his mathematical contributions, given on that occasion is reproduced in\n[\n13\n]\n. The year\n1978\nis also that in which Borsuk organised the International Conference on Geometric Topology, held in Warsaw, which\n[\n1\n]\n:-\n... demonstrated his widespread and profound influence on topology and the high regard in which he was held.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Topology"
  ]
}