{
  "nome_completo": "Katherine Adebola Okikiolu",
  "nome_curto": "Katherine Okikiolu",
  "ano_nascimento": "1965",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Okikiolu_Katherine/",
  "lugar_nascimento": "London, England",
  "lugar_morte": null,
  "biografia": "Katherine Okikiolu\nis widely known as Kate Okikiolu. Her parents are\nGeorge Olatokunbo Okikiolu\nand Patricia Natasha Edwards.\nGeorge Okikiolu\nis a Nigerian who came to England to study for an undergraduate degree in mathematics in\n1959\n. He studied at the Sir John Cass College in London where he met the English girl Patricia Edwards who was studying mathematics and physics. Patricia was\n[\n3\n]\n:-\n... from a family with a trade-union background and a central interest in class struggle.\nGeorge and Patricia Okikiolu were married on\n19\nSeptember\n1962\nand had two daughters, the first was Jeannie Adetokunbo Okikiolu who went on to study mathematics at the University of Cambridge and was awarded an MA. She then trained as a chartered accountant before working as a forensic accountant. George and Patricia Okikiolu's second daughter was Katherine Adebola Okikiolu, the subject of this biography, who was born shortly before\nGeorge Okikiolu\ntook up an appointment as an assistant lecturer in mathematics at the University of Sussex. After one year the family moved to Norwich when\nGeorge Okikiolu\nwas appointed to the University of East Anglia in Norwich, Sussex. In Norwich they lived at\n23\nÂ Mile End Road. Kate Okikiolu writes\n[\n3\n]\n:-\nMy father ... went on to a position in the mathematics department of the University of East Anglia. While I was growing up, the elementary school I attended was extremely ethnically homogeneous. I was unable to escape from heavy issues concerning race, which my mother always explained in a political context.\nBy\n1974\n, unhappy that he was not being promoted to a professorship despite having published around\n30\npapers in the ten years\n1965\n-\n74\n, George Okikiolu decided to resign his university appointment and concentrate on his inventions. At this point George and Patricia Okikiolu separated and from this time Kate Okikiolu was brought up by her mother\n[\n3\n]\n:-\nMy parents separated after my father resigned his university position to focus on his inventions, and my mother then finished her education and became a school mathematics teacher. We moved to a very cosmopolitan area of London, which was like a new birth for me; it was there that my interest in mathematics really began.\nAt high school Okikiolu developed an interest in mathematics and in art. She was also an outstanding athlete and she won the high school long jump championship for her school in\n1985\n, the year she graduated from the high school. She explains in\n[\n3\n]\nhow she came to study mathematics at university rather than art:-\nI learned mathematics on my own from textbooks which is perhaps strange given that both my parents were involved in the subject. At the same time, I spent a good deal of time studying art and wanted to follow a career in that direction until I was eventually convinced by my family that I should first work for a mathematics degree to ensure that I could earn a living.\nOkikiolu matriculated at Newnham College, University of Cambridge, in\n1985\n. This College is a women's college, founded in\n1871\n. She writes\n[\n3\n]\n:-\nI went to Cambridge, which represented a second major change in my life. As I learned more mathematics, I saw that it is an entire world of its own which many people choose to live in, a world in many ways more real than the real world; it feels permanent, eternal, and offers a deep sense of security because nearly everyone who understands it agrees on what is truth. By the time I had finished at Cambridge, I was very involved with mathematics and did not consider other careers.\nIn\n1987\nOkikiolu graduated with a B.A. in mathematics from the University of Cambridge and she went to the United States to undertake research for a doctorate. She undertook research at the University of California, Los Angeles advised by\nSun-Yung Alice Chang\nand John Brady Garnett. John Garnett\n(\nborn\n1940)\nhad been awarded a Ph.D. by the University of Washington in\n1966\n, appointed an assistant professor at the University of California, Los Angeles in\n1968\n, becoming a full professor there in\n1974\n. Okikiolu was awarded a Ph.D. in\n1991\nfor her thesis\nThe Analogue of the Strong Szego Limit Theorem on the Torus and the\n3\n-Sphere\n. There is minor inconsistency in the information about Okikiolu's advisors. All biographies which give her advisors state they are\nSun-Yung Alice Chang\nand John Brady Garnett. Certainly John Garnett advised Okikiolu for in her first publication, the\n1992\npaper\nCharacterization of subsets of rectifiable curves in\nÂ\nR\nn\n\\mathbb{R}^{n}\nR\nn\n, she writes:-\nI would like to thank John Garnett for a lot of very helpful advice.\nThe inconsistency occurs in the\nProQuest LLC\nlisting of her thesis where her advisors are given as Joseph Rudnik and\nAlice Chang\n. Joseph Rudnik is in the Department of Physics and Astronomy at the University of California, Los Angeles, and gives his research interests as follows:-\nI do research on a variety of problems in condensed matter physics. My primary interests are in the general field of statistical mechanics.\nWe suggest that Joseph Rudnik may have been an examiner of the thesis rather than a thesis advisor but we hope a reader of this biography will be able to clarify this.\nLet us return to the\n1992\npaper we mentioned above. In this paper Okikiolu solved a conjecture of Peter Wilcox Jones on the continuous\n[\nsometimes called the 'analyst's'\n]\nversion of the 'travelling salesman problem' which, in its traditional form, seeks to minimise the route visiting each member of a finite set of cities. Peter Jones of Yale University writes:-\nMy work in geometric measure theory has centred on results in quantitative rectifiability. I proved\n[\nin\n1990]\nthat in the plane one can give a geometric multi-scale condition for solving the analyst's travelling salesman problem: When is a set contained in a curve\n(\nconnected set\n)\nof finite length? One half of that proof works in any dimension; the other half was later\n[\nin\n1992]\nproven in all dimensions by Kate Okikiolu.\nOkikiolu was an instructor and later assistant professor atÂ Princeton UniversityÂ from\n1993\nto\n1995\n. Part of this time, from September\n1993\nto June\n1994\n, she spent at the Institute for Advanced Studies at Princeton. While at Princeton she met the mathematician Hans Lindbad and they were married. She published two further papers while at Princeton, namely\nThe Campbell-Hausdorff theorem for elliptic operators and a related trace formula\n(1995)\nand\nThe multiplicative anomaly for determinants of elliptic operators\n(1995)\n. A third paper,\nThe analogue of the strong SzegQ limit theorem on theÂ\n2\n- andÂ\n3\n-dimensional spheres\n, published in\n1996\nalso contains results she obtained while at Princeton.\nShe then worked as a visiting assistant professor at theÂ Massachusetts Institute of TechnologyÂ from\n1995\nto\n1997\nwhere she began a collaboration with Victor William Guillemin. He had received a B.A. from Harvard in\n1959\n, an M.A. from the University of Chicago in\n1960\n, and a Ph.D. from Harvard in\n1962\n.After working as an instructor at Columbia University, he was appointed to theÂ Massachusetts Institute of TechnologyÂ in\n1966\n, being promoted to professor in\n1973\n. By the time Okikiolu was appointed to theÂ Massachusetts Institute of Technology, Guillemin was the Norbert Wiener Professor of Mathematics. His research interests are in differential geometry and symplectic geometry.Â Okikiolu and Guillemin published the three joint papers,\nSzegÅ theorems for Zoll operators\n(1996)\n,\nSpectral asymptotics of Toeplitz operators on Zoll manifolds\n(1997)\n, and\nSubprincipal terms in SzegÅ estimates\n(1997)\n.\nIn\n[\n3\n]\nOkikiolu explains the type of mathematical problems she worked on:-\nMy research is in the field of spectral geometry, the study of how the shape of an object affects the modes in which it can resonate. A famous question in the field is, can one hear the shape of a drum? Spectral geometry bridges different branches of science, including engineering and physics, as well as a number of different fields of mathematics. However, quite different sorts of questions are studied within each discipline. I am a mathematical analyst, which gives me an appreciation for the infinite and the infinitesimal. At the moment, one of the things I am working on understanding is the total wavelength of a surface like a sphere or something of greater complexity, such as the surface of a bagel or a pretzel. What is this total wavelength? If you strike a surface it can resonate at any one of a list of frequencies, and the wavelength of the sound produced by the vibration is inversely proportional to the frequency. In the mathematically idealized model there are infinitely many possible wavelengths. The total wavelength should be the sum of all of these individual wavelengths except that this infinite sum equals infinity. Fortunately, a finite number can be assigned to it by a slightly elusive process called regularization.\n(\nThis process is also used in mathematical physics to mysteriously obtain true answers from formulas which do not really make sense!\n)\nI first became interested in the total wavelength as a model related to a question which can be roughly stated as, can one hear the shape of the universe? However, the total wavelength shows up in many quite different areas of mathematics and I am finding these connections intriguing.\nOkikiolu joined the faculty at theÂ University of California at San DiegoÂ in\n1997\nwhere she became an associate professor.Â She received two major awards in\n1997\n, the Sloan Research Fellowship and the Presidential Early Career Award for Scientists and Engineers for her project 'Determinants of Elliptic and Toeplitz Operators with Applications to Geometry'. The project received $\n500\n,\n00\nand ran from August\n1997\nto December\n2006\n. The Abstract was as follows:-\nThe research supported in this award lies in the general area of geometric analysis. More specifically, the investigator is to study properties of the determinant of the Laplacian on closed compact Riemannian manifolds under all smooth perturbations in the metric which leave the total volume fixed. This may have implications for the Poincare conjecture. In addition, the investigator is to consider the wave operator on general negatively curved manifolds in connection with quantum chaos theory. This award is made under the Faculty Early Career Development\n(\nCAREER\n)\nprogram which funds projects that contain highly meritorious research coupled with a strong educational component. For example, the investigator of this award intends to run summer workshops for students introducing them to various current problems in geometric analysis using numerical methods. Also, she is to help develop inner-city K-\n12\nmathematics and science curricula by producing a series of videos depicting model lessons for the inner-city classroom. The lessons will involve design and construction activities which lead directly to the study of mathematics, and incorporate elements from minority social cultures.\nDuring the years that this project was running, Okikiolu spent two further periods at the Institute for Advanced Study, from September\n2003\nto December\n2003\nand from September\n2008\nto December\n2008\n. She gave three talks at the University of PennsylvaniaÂ on\n24\nMarch\n2005\n,\n3\nOctober\n2006\nand\n14\nMarch\n2007\n. As well as giving her affiliation as theÂ University of California at San Diego, it is also indicated that she is affiliated to the University of Pennsylvania. In\n2002\nshe delivered the\nClaytor\n-\nWoodard\nlecture at the conference of the\nNational Association of Mathematicians\n, an organization for African-American mathematicians.\nIn\n2011\nshe joined the Mathematics Department atÂ Johns Hopkins University. She gave this description in\n2011\nof her research which repeats some of the above quote from\n[\n3\n]\nbut is worth giving in full\n[\n4\n]\n:-\nI am a mathematical analyst, and most of my research is in the area of spectral geometry. Problems in spectral geometry are also studied by various kinds of geometers, number theorists, applied mathematicians, mathematical physicists, and others. What is Spectral geometry? Spectral geometry most usually means the study of how the geometry of an object is related to the natural frequencies of the object. These are the frequencies at which the object can vibrate. A vibrating object often produces a sound, and the frequencies can be heard as the dominant tone and the overtones of the sound. The well known question highlighting what spectral geometry is all about is the question \"Can one hear the shape of a drum?\" I am a mathematical analyst, and most of my research is in the area of spectral geometry. Problems in spectral geometry are also studied by various kinds of geometers, number theorists, applied mathematicians, mathematical physicists, and others. In mathematical terms, the natural frequencies of an object\n(\nor rather their squares\n)\nare the eigenvalues of a partial differential operator called the Laplacian. This Laplacian takes each function defined on the object and differentiates it twice to give a new function. The eigenvalues of the Laplacian form an infinite sequence of numbers tending to infinity. In spectral geometry we study how these numbers depends on the shape of the object. For people who like to know the full story, I should mention that many spectral geometers\n(\nincluding me\n)\nwho work on the Laplacian on smooth manifolds study the whole sequence of eigenvalues of the Laplacian. Now the low eigenvalues can give accurate values for the frequencies at which a real life object vibrates, but the very high eigenvalues do not correspond to genuine physical vibrations of the object because of molecular forces and damping. These effects are not included in the model where the vibration is driven by the Laplacian alone. This means that my research is rather different from that of an engineer who wishes to model precisely the vibrations of a real life object. In actual fact the questions I work on are more closely related to mathematics arising in quantum physics and string theory. In addition, I don't always study the Laplacian, but also the eigenvalues of other operators, which might represent other physical quantities than the frequencies of vibration. I mostly study spectral geometry for nice smooth objects such as spheres and tori, but some people work on rough objects and even discrete objects like graphs. In the last eight years, I have worked mostly on the spectral zeta function, which is an infinite sum of powers of the eigenvalues. In particular, I have worked on the zeta-regularised determinant, which is used in topology, quantum field theory, and string theory. Recently, I have been very interested in the sum of squares of the wavelength of a surface, which is related to all kinds of different things including vortex theory.\nBy\n2009\nshe had published\n14\nvery high quality research papers, the\n2009\npaper being\nA negative mass theorem for surfaces of positive genus\n. At the time of writing this biography in\n2019\n, we note that she has not published any further papers. Her husband Hans Lindbad is a member of the Mathematics Department atÂ Johns Hopkins University but Okikiolu does not now appear in the staff lists. We end this biography with a quote from Okikiolu published in\n2009\n[\n3\n]\n:-\nAlthough I cannot claim to find it easy to balance my ambitions in mathematical research with the desire to be a good parent, to be an inspiring teacher, or to effect positive social change in the world, I do feel very fortunate to be able to spend my life tackling these challenges, which are extremely interesting and important to me.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}