{
  "nome_completo": "Kazimierz Urbanik",
  "nome_curto": "Kazimierz Urbanik",
  "ano_nascimento": "1930",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Urbanik/",
  "lugar_nascimento": "Krzemieniec, Poland (now Kremenets, Ukraine)",
  "lugar_morte": "Wrocław, Poland",
  "biografia": "Kazimierz Urbanik\nwas born in Krzemieniec in Eastern Poland. He was brought up there and entered the famed educational establishment of the city, the Lyceum. However World War II was to cause a major disruption throughout his school years.\nOn\n1\nSeptember\n1939\n, after signing a non-aggression pact with the Russians, the German armies invaded Poland. On\n17\nSeptember the Russians invaded and by\n28\nSeptember Hitler and Stalin had agreed to partition Poland. Krzemieniec, by this agreement, came under Soviet control. A couple of months later it became part of Soviet Ukraine. However, in June\n1941\nthe Germans attacked the Soviet Union and Krzemieniec eventually came under German control. By\n1944\nthe Soviet armies had driven the Germans out and the Yalta Conference in February\n1945\nsaw the district become part of Ukraine\n(\nwhich it still is\n)\n. However the Yalta agreement saw the town of Brzeg,\n50\nkm south-east of Wrocław in Lower Silesia, being returned to Poland. The Urbanik family set up home in Brzeg.\nCompleting his secondary education in Brzeg in\n1948\nby passing the matura, Urbanik entered the University of Wrocław. There he studied a wide range of scientific topics, but he concentrated on mathematics and physics for his final degree which he obtained in\n1952\n. Two of his lecturers at Wrocław had a major influence on the direction of his studies, namely\nHugo Steinhaus\nand\nEdward Marczewski\n. These two mathematicians had played a large part in the development of the Polish University of Wrocław which had been set up in August\n1945\n, built on the previous University and Technical University of Wrocław. Lectures had begun at the new Polish University of Wrocław on\n15\nNovember\n1945\n.\nMarczewski\n, who had been held as a prisoner by the Germans in Wrocław during their wartime occupation, had been appointed as a professor and\nSteinhaus\nhad been appointed as Dean of the Faculty of Mathematics, Physics and Chemistry.\nAfter graduating Urbanik was employed to teach at the university while he studied for his doctorate with\nMarczewski\nas his thesis advisor. His first work was on topology and he published\nSur les espaces complets séparables de dimension\n0\nⓉ\n(\nOn separable complete spaces of dimension\n0\n)\nin\n1953\nwhich was a joint paper with\nB Knaster\n.\nGordon Whyburn\nwrites:-\nAn orderly presentation is given of results, mostly new, concerning the topological structure and classification of ... the\n0\n-dimensional separable complete spaces.\nUrbanik then began to mix an interest in topology with\nmeasure theory\nand probability and his\n1954\npapers show this mix:\nSur un problème de J F Pàl sur les courbes continues\nⓉ\n(\nOn a J F Pàl problem on continuous curves\n)\n;\nLimit properties of homogeneous Markov processes with a denumerable set of states\n;\nSur la structure non-topologique du corps des opérateurs\nⓉ\n(\nOn the non-topological structure of the body of operators\n)\n; and\nQuelques théorèmes sur les measures\nⓉ\n(\nSome theorems on measures\n)\n. Let us give\nPaul Halmos\n's description of this last mentioned paper:-\nThis paper is motivated by the measure-theoretic formulation of the\nSteinhaus\ncake problem. The problem is to divide a cake among\nn\nn\nn\npeople, with possible different standards of value for the various parts of the cake, so that the value of each person's share is, in his own estimation, at least\n1\nn\n\\large\\frac{1}{n}\\normalsize\nn\n1\n​\ntimes the value of the whole cake. In the author's mathematization of the problem it is assumed that the\nn\nn\nn\nnormalized measures that enter are non-atomic, have the same null-sets, and are not all identical. The main theorem asserts that the cake can be divided so that the value of each person's share is, in his own estimation, exactly\np\np\np\ntimes the value of the whole cake, where\np\np\np\nis strictly greater than\n1\nn\n\\large\\frac{1}{n}\\normalsize\nn\n1\n​\n, and, moreover, a best possible\np\np\np\ncan be attained. The number of distinct partitions of this kind, with the same optimal\np\np\np\n, is either\n1\nor else greater than or equal to the power of the continuum.\nDuring the years\n1955\nand\n1956\n, sixteen of his papers appeared in print, some written in English, some in Polish, some in French, some in German and some in Russian. He was awarded his doctorate in\n1956\nfor his work on a stochastic model of a cascade. He followed a suggestion of\nMarczewski\nand gave a model for a temporally homogeneous cascade process where individual lines of descent can be distinguished. Among the results he proved were:\n(1)\nEvery cascade process defined in extensive form determines a temporally homogeneous\nMarkov\nprocess whose probabilities satisfy the usual relations for cascade processes; and\n(2)\nEvery\nMarkov\nprocess of the type mentioned can be generated by an appropriate extensive cascade process.\nUrbanik remained at the University of Wrocław and\nhabilitated\nthere in\n1957\nbecoming a\ndozent\n. His work on generalized stochastic processes is of great importance and he published many papers of the topic such as the two\n65\npage papers\nGeneralized stochastic processes\nand\nLocal characteristics of generalized stochastic processes\nboth published in\n1958\n. The depth and quantity of his research meant that he was soon promoted to professor, which happened in\n1960\nfollowing his visit at Tulane University in New Orleans in the United States, in the academic year\n1959\n-\n60\n.\nThe article\n[\n3\n]\ndivides Urbanik's research into five different major areas: topology, measure theory and analysis;\nprobability theory\n; stochastic processes; information theory and theoretical physics; and general algebras. In the light of the comments we have already made about Urbanik's research, we need only explain where his interest in the last two of these five areas arose. Although information theory and theoretical physics might sound like a topic unrelated to his other interests, in fact most of the work was related to statistical physics and was closely linked with his important results on generalized stochastic processes. His work on general algebras was, however, essentially unrelated to the other topics he studied. His interest here came through his mentor\nEdward Marczewski\nwho, in\n1958\n, introduced the concept of independence in universal algebras. Urbanik published a number of highly significant papers on this topic such as\nRepresentation theorem for Marczewski's algebras\n(1959)\n,\nA representation theorem for Marczewski's algebra\n(1960)\n,\n(\nwith\nE Marczewski\n)\nAbstract algebras in which all elements are independent\n(1960)\n, and\nLinear independence in abstract algebras\n(1966)\n. We have spoken of the five areas in which he undertook research, but we should also mention the large number of research papers he wrote; the article\n[\n3\n]\nlist\n181\nsuch papers.\nIn\n1965\nUrbanik was elected to the\nPolish Academy of Sciences\n, later serving two terms as Vice President. He was Director of the Institute of Mathematics of the Wrocław University from\n1967\nto\n1978\nand again from\n1981\nto\n1996\n. From\n1975\nto\n1981\nhe served as Rector of the University. He was a fine teacher\n[\n2\n]\n:-\nAs a teacher Urbanik developed a large and faithful following. His delivery was crisp and velvety, and we were all mesmerized by his lectures in which deep theories unfolded effortlessly in front of our eyes without any help from notes or textbooks. He had developed original approaches to almost every subject he lectured on and we regret that most of his course offerings were never converted into published textbooks.\nThe authors of\n[\n3\n]\ndescribe his character:-\nUrbanik's fairness, warmth, generosity and devotion to students were legendary and they reciprocated in kind. He loved doing and teaching mathematics and, despite his long and incapacitating illness about which he never complained, continued working with the students, publishing and fulfilling his editorial duties almost to the last days of his life.\nUrbanik married Stefania; they had a son Witold and a daughter Jadwiga. He retired in\n2000\nbut continued to undertake research.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Statistics",
    "Topology"
  ]
}