{
  "nome_completo": "Kazimierz Kuratowski",
  "nome_curto": "Kazimierz Kuratowski",
  "ano_nascimento": "1896",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kuratowski/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Kazimierz Kuratowski\n's father, Marek Kuratowski was a leading lawyer in Warsaw. To understand what Kuratowski's school years were like it is necessary to look a little at the history of Poland around the time he was born. The first thing to note is that really Poland did not formally exist at this time.\nPoland had been partitioned in\n1772\nand the south was called Galicia and under Austrian control. Russia controlled much of the rest of the country and in the years prior to Kuratowski's birth there had been strong moves by Russia to make \"Vistula Land\", as it was called, be dominated by Russian culture. In a policy implemented between\n1869\nand\n1874\n, all secondary schooling was in Russian. Warsaw only had a Russian language university after the University of Warsaw became a Russian university in\n1869\n. From\n1906\n, however, the Underground Warsaw University was set up to provide a Polish university education for those prepared to risk teaching and learning in this illegal institution. Galicia, although under Austrian control, retained Polish culture and was often where Poles from \"Vistula Land\" went for their education.\nWhen Kuratowski was nine years old the policy of Russian schooling was softened, but although Polish language schools were allowed, a student could not proceed from such a secondary school to university without taking the Russian examinations as an external candidate. As a consequence most Poles in \"Vistula Land\" at this time went abroad for their university education. Some went to Galicia where, although under Austrian control, Polish education still flourished. Kuratowski, however, when he left secondary school decided that he wanted to become an engineer. The University of Glasgow, in Scotland, had an engineering school with a long established history, the chair of engineering being established in\n1840\n. It rightly appeared to Kuratowski as an outstanding place to study engineering.\nAfter Kuratowski made the decision to study in Glasgow, he matriculated there as a student in October\n1913\n. Interestingly, Sneddon relates in\n[\n15\n]\n:-\nHe must have feared that his name would present difficulty to his fellow students for it appears in the registry of the Ordinary Class in Mathematics as Casimir Kuratov.\nAt the end of his first year Kuratowski was awarded the Class Prize in Mathematics. He then studied chemistry at the Technical College during the summer and returned to Poland for a holiday before starting his second year of study. However, back in Poland in August\n1914\nat the outbreak of World War I, returning to Scotland became impossible for Kuratowski. Although his education was disrupted, one benefit to mathematics was that Kuratowski could no longer study engineering and mathematics would gain enormously.\nIn August\n1915\nthe Russian forces which had held Poland for many years withdrew from Warsaw. Germany and Austria-Hungary took control of most of the country and a German governor general was installed in Warsaw. One of the first moves after the Russian withdrawal was the refounding of the University of Warsaw and it began operating as a Polish university in November\n1915\n. Kuratowski was one of the first students to study mathematics when the university reopened. He attended seminars given by\nJaniszewski\nand\nMazurkiewicz\nin Warsaw before the end of the war. He writes in\n[\n2\n]\n:-\nAs early as\n1917\n[\nJaniszewski\nand\nMazurkiewicz\n]\nwere conducting a\ntopology\nseminar, presumably the first in that new, exuberantly developing field. The meeting of that seminar, taken up to a large extent with sometimes quite vehement discussions between\nJaniszewski\nand\nMazurkiewicz\n, were a real intellectual treat for the participants.\nThere were two others on the staff at the University of Warsaw who were also to have a major influence on Kuratowski. One was\nŁukasiewicz\n, a professor of philosophy who worked on mathematical logic. The second person, who arrived in\n1918\n, was\nSierpiński\n. In fact the first paper which Kuratowski wrote was\nOn the definitions in mathematics\n, written in\n1917\n, which was a consequence of discussions which he had while attending\nŁukasiewicz\n's seminar. After graduating in\n1919\n, Kuratowski undertook his doctoral studies working under\nJaniszewski\nand\nMazurkiewicz\n.\nIn\n1921\nKuratowski was awarded his doctorate, but sadly one of his supervisors\nJaniszewski\nhad died in\n1920\n.\nJaniszewski\nhad been the leader in a move to set up the new journal\nFundamenta Mathematicae\nand the first volume, which appeared in\n1920\n, contained a joint paper\nSur les continus indécomposable\nⓉ\n(\nOn the indecomposable continuum\n)\nby\nJaniszewski\nand Kuratowski.\nKuratowski was appointed as a professor at the Technical University of Lwów in\n1927\n. In\n[\n4\n]\nUlam\n, who began his university undergraduate career the year Kuratowski began lecturing in Lwów, wrote:-\nHe was a freshman professor, so to speak, and I was a freshman student. From the very first lecture I was enchanted by the clarity, logic, and polish of his exposition and the material he presented. ... Soon I could answer some of the more difficult questions in the set theory course, and I began to pose other problems. Right from the start I appreciated Kuratowski's patience and generosity in spending so much time with a novice.\nThe mathematicians of Lwów did a great deal of mathematical research in the cafés of the city. The Scottish Café was the most popular with the mathematicians in general but not with Kuratowski who, together with\nSteinhaus\n(\naccording to\nUlam\n[\n4\n]\n)\n:-\n... usually frequented a more genteel tea shop that boasted the best pastry in Poland.\nThis café was Ludwik Zalewski's Confectionery at\n22\nAkademicka Street. It was in the Scottish Café, however, that the famous\nScottish Book\nconsisting of open questions posed by the mathematicians working there came into being. Kuratowski\n(\nand\nSteinhaus\n)\nsometimes joined their colleagues in the Scottish Café but he had left Lwów before the mathematicians began writing down the problems in the Scottish Book.\nYou can see a picture of the Scottish Café at\nTHIS LINK\n.\nAt Lwów, however, Kuratowski worked with\nBanach\nand they answered some fundamental problems on\nmeasure theory\n.\nUlam\n, who had become\nBanach\n's research student also worked with them. As Arboleda writes in\n[\n1\n]\n:-\nThis was a beautiful example of scientific collaboration and understanding, and of the ability to organise and encourage creative activity at its height.\nKuratowski retained his links with Warsaw while in Lwów, returning each summer to his house outside the capital. In\n1934\nhe left Lwów and became professor of mathematics at the University of Warsaw. He was to spend the rest of his career at the University of Warsaw although he became involved in mathematical activities which saw him travelling world-wide. It was now that Kuratowski began to devote his energies to the cause of Polish mathematics rather than to give all his efforts to his research. He was still extremely active in research, however, and while spending a month at Princeton in\n1936\nhe wrote a joint paper with\nvon Neumann\n. During his time in the United States he also made contact with\nRobert Moore\n's topology group, meeting mathematicians whom he would keep in contact with for many years.\nJaniszewski\nhad made the case for Polish mathematics concentrating on its areas of strength when he wrote his report at the end of World War I. In\n1936\na committee was set up by the Polish Academy of Learning to look at the way forward for Polish science. Kuratowski became secretary to the mathematics committee and his report was made in\n1937\n. He recommended that the time had come to go beyond the era of concentrating on strengths, proposed by\nJaniszewski\n, and to develop across the whole of the mathematical spectrum. In particular there was a need:-\n... to raise applied mathematics to such a standard that it can fulfil its tasks as required by other branches of science, as well as those tasks connected with the problems of the country.\nThe recommendations of the report to set up two research institutes, one for pure mathematics and one for applied mathematics, may have been implemented had it not been for the political situation. After the German invasion of Poland in\n1939\nlife there became extremely difficult. There was a strategy by the invaders to put an end to the intellectual life of Poland and to achieve this they sent many academics to concentration camps and murdered others. The Poles had experience of surviving such attacks, however, and they employed the same tactics as they had during the period of Russian domination and organised an underground university in Warsaw. Kuratowski risked his life to teach in this illegal educational establishment through the war. He writes in\n[\n2\n]\n:-\nAlmost all our professors of mathematics lectured at these clandestine universities, and quite a few of the students then are now professors or\ndocents\nthemselves. Due to that underground organisation, and in spite of extremely difficult conditions, scientific work and teaching continued, though on a considerably smaller scale of course. The importance of clandestine education consisted among others in keeping up the spirit of resistance, as well as optimism and confidence in the future, which was so necessary in the conditions of occupation. The conditions of a scientist's life at that time were truly tragic. Most painful were the human losses.\nBetween the two world wars Poland had made a remarkable leap forward in mathematical teaching and research. At the end of World War II the whole educational system was destroyed and had to be completely rebuilt. It was Kuratowski who now took on the role of leader in this rebuilding process and, through the\nPolish Mathematical Society\nof which he was president for eight years immediately following the war, he set about arguing for the implementation of the recommendations of his\n1937\nreport.\nThe two research institutes, one for pure mathematics and one for applied mathematics, were merged into a plan for a single mathematics institute and accepted in\n1948\n. Kuratowski was appointed the Director of the Mathematical Institute of the\nPolish Academy of Sciences\nin\n1949\n. Despite being\n53\nyears of age when appointed, Kuratowski held this position of director for\n19\nyears. He held other positions of importance in the Polish scientific scene. For example, he served as a vice president of the\nPolish Academy of Sciences\n.\nKuratowski also played a major role in the publishing of mathematics in general and Polish mathematics in particular. He served on the editorial board of\nFundamenta Mathematicae\nfrom\n1928\n, replacing\nSierpiński\nas editor-in-chief in\n1952\nand continuing in this role for the rest of his life. He was also one of the founders and an editor of the important\nMathematical Monographs\nseries. He contributed the third volume in this series with his monograph on topology which we will mention again below.\nAs an ambassador for Polish mathematics, Kuratowski did a remarkable job with many foreign visits and lecture tours. He lectured in London\n(1946)\n, Geneva\n(1948)\n, many universities in the United States during\n1948\n-\n49\n, Prague, Berlin, Budapest, Amsterdam, Rome, Peking\n(1955)\n, Canton\n(1955)\n, Shanghai\n(1955)\n, Agra\n(1956)\n, Lucknow\n(1956)\n, and Bombay\n(1956)\n. All this was during the Stalinist era when travel was restricted, and after travel became easier Kuratowski did indeed take full advantage with many visits to western Europe, Britain, USA, and Canada.\nKuratowski's main work was in the area of topology and set theory. He used the notion of a limit point to give closure axioms to define a topological space. In\n1922\n[\n1\n]\n:-\n... he used\nBoolean algebra\nto characterise the topology of an abstract space independently of the notion of points. Subsequent research showed that, together with Felix Hausdorff's definition of topological space in terms of neighbourhoods, the closure operator yielded more fertile results than the axiomatic theories based on\nMaurice Fréchet\n's convergence\n(1906)\nand\nFrigyes Riesz\n's point of accumulation\n(1907)\n.\nOther major contributions by Kuratowski were to compactness and metric spaces. He was the author of\nTopologie\n, referred to above, which was the crowning achievement of the Warsaw School in\npoint set topology\n. The first volume of this work was the major source on metric spaces for several decades.\nHis\n1930\nwork on non-planar graphs is of fundamental importance in graph theory, he showed that a necessary and sufficient condition for a graph\nG\nG\nG\nto be planar is that it does not contain a subgraph homeomorphic to either\nK\n5\nK_{5}\nK\n5\n​\nor\nK\n3\n,\n3\nK_{3,3}\nK\n3\n,\n3\n​\n.\nHis work in set theory considered a function as a set of ordered pairs and this made the function notion as proposed by\nFrege\n,\nCharles Peirce\nand\nSchröder\nredundant. He also considered the topology of the continuum, the theory of connectivity, dimension theory, and answered measure theory questions.\nKuratowski was honoured with prizes and election to academies. The\nUSSR Academy of Sciences\n, the\nHungarian Academy\n, the\nAustrian Academy of Sciences\n, the Academy of the German Democratic Republic, the Academy of Sciences of Argentina, the\nAccademia dei Lincei\n, the Academy of Arts and Letters of Palermo, and the\nRoyal Society of Edinburgh\nall elected him to membership. He received honorary degrees from many universities including Glasgow, the Sorbonne, Prague and Wrocław.\nUlam\n, in the preface which he wrote to\n[\n2\n]\n, sums up Kuratowski's contribution in the following words:-\nProfessor Kuratowski stands out not only as a great figure in mathematical research, but in his ability, so rare among original scientists, to organise and direct schools of mathematical research and education.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Topology"
  ]
}