{
  "nome_completo": "Keith Stewartson",
  "nome_curto": "Keith Stewartson",
  "ano_nascimento": "1925",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stewartson/",
  "lugar_nascimento": "Barnsley, Yorkshire, England",
  "lugar_morte": "London, England",
  "biografia": "Keith Stewartson\n's father George was a master baker in Billingham, County Durham, and it was in this town that Keith was brought up. He was the youngest of his parents' three children, having one older brother Roy and a sister who died while Keith was too young to remember her. He did not get off to the most promising start in terms of his education, for at the age of eleven he failed the examinations at the end of his primary schooling. Put on a reserve list for entry to Stockton Secondary School, he was fortunate to be selected despite having failed the examinations.\nAt Stockton Secondary School he performed brilliantly but World War II started before he had completed his school education. His outstanding performance was rewarded with the award of a State Scholarship and a Kitchener Memorial Scholarship to Catharine's College, Cambridge, where his brother Roy had taken an engineering degree. Soon after this their family home suffered a direct hit during a bombing raid, but they had been given sufficient warning to seek protection in their air-raid shelter which was strong enough to let all the family survive, if somewhat shaken by their experiences.\nStewartson was an undergraduate at St Catharine's College, entering in\n1942\n, but by that time special regulations for the Mathematical Tripos had been introduced because of the War. As a result Stewartson completed Part II of the Tripos in two years, receiving the Drury Prize for his outstanding work. It was in\n1943\nthat Stewartson had attended a lecture given at Cambridge by\nBrodetsky\non\nAeronautical mathematics\n. It made a lasting impression on him. He then undertook War service with the Ministry of Aircraft Production, working first at the experimental firing and bombing range at Orford Ness on the Suffolk coast. The Bomb Ballistics Building there had been built in\n1933\nand contained equipment to record the flight of bombs in order to improve their aerodynamics and to provide data for the production of the tables used to refine bomb aiming. By the time Stewartson arrived, however, activity at Orford Ness was on the decrease and after a while he was moved to the Guided Projectiles Establishment at Westcott, Buckinghamshire.\nIt was at Westcott that Stewartson became involved in studying compressible fluid flow problems, and he worked there until\n1946\nwhen he returned to Cambridge. He now continued his Tripos studies taking Part III of the Tripos, which he completed with distinction, and was awarded the Mayhew Prize. He then undertook research, supervised by Leslie Howarth, on boundary layer theory. The results Stewartson obtained were impressive, and he published his first paper\nCorrelated incompressible and compressible boundary layers\nin the\nProceedings of the Royal Society\nin\n1949\n. This work:-\n... treats the compressible boundary layer under the following three assumptions:\n(\na\n)\nthe boundary layer is thermally insulating,\n(\nb\n)\nthe viscosity varies as the absolute temperature, and\n(\nc\n)\nthe Prandtl number of the fluid is unity.\n... It is shown that under the above three conditions, for each problem of a compressible boundary layer, a corresponding problem of an incompressible boundary layer can be set up by a suitable transformation of variables. Thus, any result or development of the theory for incompressible boundary layers can be immediately applied to the study of the compressible case. This completes the correlation of these two cases first discussed by Howarth\n(1948)\n...\nStewartson found time while working for his doctorate to become enthusiastic about rowing. He was a member of the College Eight and it became a serious commitment. He received a doctorate in\n1949\nfor his impressive contributions to boundary layer theory and, following the award, was appointed Lecturer in Mathematics at Bristol. This was the same year that his research supervisor at Cambridge, Leslie Howarth, was appointed to the Chair of Applied Mathematics at Bristol. After teaching at Bristol for a year, he took his summer holidays in Austria in\n1950\nand there met Jean Forrester who was a physical education teacher. They were married in\n1953\nand had two sons and a daughter. Shortly after the marriage, Keith and Jean Stewartson set sail for the United States where they spent a year at the California Institute of Technology. This was the first of many visits which Stewartson made to the United States, Israel, and Australia. When he returned to Bristol in\n1954\n, he was promoted to Reader in Mathematics.\nHis commitment to his College Eight at St Catharine's was translated into a major coaching effort to make Bristol the leading provincial university for rowing. He selected a new Bristol crew and expected a lot of them in training and for three years he gave a great deal of his time, energy, and determination to the task. By\n1953\nhe had reached his goal when the Bristol Eight won the Universities Championship. He knew, however, that he would move on from Bristol, and he brought in the right man to succeed him as rowing coach.\nIn\n1958\nStewartson was appointed to a chair at the new Durham Colleges division of University of Durham.\nLighthill\n, in\n[\n4\n]\n, writes of Stewartson's time in Durham:-\nIn the countryside around Durham, Keith and Jean were able to pursue their great love of upland walks as well as being athletically active in tennis mixed doubles\n(\nusually on opposite sides!\n)\nand in many other ways. But artistic pursuits were not neglected, and Keith found great pleasure in playing the works of his favourite composers\n(\nMozart, Beethoven, Schubert\n)\non his fine baby-grand piano.\nIn\n1963\nStewartson and\nLighthill\nplayed major roles in the founding of the Institute of Mathematics and its Applications. It formally existed from April\n1964\nwith\nLighthill\nas President and Stewartson as Vice-President, and Stewartson played a large role in setting the direction for the new body.\nHowever Durham was not proving ideally suited to Stewartson's personality\n[\n7\n]\n:-\nAt that time the Durham Colleges division was small and conservative, with a limited tradition in applied mathematics, and consequently a less than comfortable place for a man of Stewartson's drive and ambition.\nGiven the situation in Durham, it was natural that he should look for other possibilities and his move to the Goldsmid Chair in University College, London in\n1964\nwas the consequence. He spoke on boundary layer theory, in particular flows at high\nReynolds\nnumbers, in his inaugural lecture in London. In London Stewartson made his home in Golders Green. The family were happy living in the city, and Stewartson was able to indulge his love of the theatre and of opera.\nStewartson studied rotating fluid flows, shear layers, magnetohydrodynamics, the triple-deck theory, and flow at both high and low\nReynolds\nnumbers. As stated in\n[\n1\n]\n:-\nKeith Stewartson's abiding passion in mathematical research lay in the solution of the equations governing the motion of liquids and gases, and in the comparison of his theoretical predictions with experiment and observation.\nHis work on separation of the boundary layer was summarised in the\nVon Neumann\nlecture he gave to the American\nSociety for Industrial and Applied Mathematics\nin\n1980\n. Here is his own summary taken from the published version of his talk:-\nSince classical inviscid theory leads to the patently absurd conclusion that the resistance experienced by a rigid body moving through a fluid with uniform velocity is zero, great efforts have been made during the last hundred or so years to propose alternate theories and to explain how a vanishingly small frictional force in the fluid can nevertheless have a significant effect on the flow properties. The methods used are a combination of experimental observation, computation often on a very large scale, and analysis of the structure of the asymptotic form of the solution as the friction tends to zero. This three-pronged attack has achieved considerable success, especially during the last ten years, so that now the paradox may be regarded as largely resolved. We review these achievements in subsonic and supersonic flow, for bluff bodies, for trailing-edge flows and for internal flows. Most of the work has been on steady two-dimensional problems but the special difficulties in unsteady and three-dimensional flow are also touched on.\nHis output was large, with\n186\npapers. He was quick to recognise the importance of computers. In\n[\n7\n]\nRiley writes:-\n... he recognised the value of the computer, and the impact that it would make on his subject, at an early stage. For him computational methods were a complement to analytic techniques. They could be used to help verify a delicate analytical structure ..., or even suggest the analytic structure ... Alternatively they could reveal unexpected phenomena which would then be subjected to analysis.\nStewartson received many honours. He was elected a Fellow of the\nRoyal Society of London\non\n18\nMarch\n1965\n. Four years later he was awarded an honorary degree by the University of East Anglia.\nIn\n[\n1\n]\nStewartson is compared with\nThomson\n,\nRayleigh\nand\nStokes\n. Others have compared him with\nEuler\n. This is indeed praise but his international domination of his subject clearly makes him worthy of the comparisons.\nHis character is described in\n[\n1\n]\nas follows:-\nThe hospitality of Stewartson and his wife was legendary, and his happy, generous personality, coupled with his staunch support of those conducting good research and teaching, made him one of the most widely loved and revered of mathematicians.\nRiley writes in\n[\n1\n]\n:-\nHe was never less than generous to his collaborators, and to work with him was as stimulating an experience as it was profitable; those who did learned to respect his passion for fluid mechanics and applied mathematics, his industry and his mathematical power which, combined with an ability to see a problem from what might often appear to be an unorthodox point of view, made him a dominant international figure in his subject.\nStewartson first had a health problem in\n1974\nwhen he suffered a small heart attack. He made a good recovery from that and continued to undertake his research and duties as vigorously as before. He moved from Golders Green to a house in Hampstead Garden Suburb in\n1979\n. It was nine years after his first heart attack, in April\n1983\n, that he suffered a second. He was on a very demanding tour of the West Coast of the United States at the time. He was flown home and taken to University College Hospital. For two weeks it looked as though he would again make a good recovery but, sadly, while in the hospital he suffered a third heart attack from which he died.\nLighthill writes in\n[\n4\n]\n:-\nThis premature death, at the age of\n57\n, of one of the century's greatest exponents of the application of advanced mathematical methods in fluid mechanics produced worldwide grief and dismay, and applied mathematicians everywhere joined with the family in mourning Keith Stewartson as a warmly loved, as well as an intensely admired and respected figure.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}