{
  "nome_completo": "Kunihiko Kodaira",
  "nome_curto": "Kunihiko Kodaira",
  "ano_nascimento": "1915",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kodaira/",
  "lugar_nascimento": "Tokyo, Japan",
  "lugar_morte": "Kofu, Japan",
  "biografia": "Kunihiko Kodaira\n's parents were Gon-ichi\n(1884\n-\n1976)\nand Ichi Kodaira\n(1894\n-\n1993)\n. Gon-ichi, Kunihiko's father, had studied agriculture and politics at Tokyo Imperial University and, at the time his son was born, was working at the Ministry of Agriculture. He retired from the Ministry of Agriculture in\n1939\nand was elected to the Japanese Parliament where he served during World War II. After Japan was defeated, the Allies removed him from public office. In addition to these activities, he wrote around\n40\nacademic books and\n350\nacademic papers. Ichi, Kunihiko's mother, was the daughter of the schoolmaster Kyuji Kanai. Kunihiko was the eldest of his parents' sons, having a younger brother Nobuhiko\n(\nborn\n1919)\n.\nKunihiko entered elementary school in\n1921\nbut these were not easy years for the young boy. He was rather shy and stammered when he spoke, especially when he was under stress. He was certainly not the athletic type and, as a consequence, he had a strong dislike of the physical education classes. In his autobiography\n[\n6\n]\nhe says that he was a poor pupil in primary school and, although on the whole he is overly modest, nevertheless he probably did not shine at this stage. However, he showed a fascination with numbers from a young age, loved counting beans and, when he was ten years old he conducted an experiment to see if his dog could count. When she produced puppies, Kunihiko hid them and the dog was upset searching until he returned them to her. However, when he hid a couple of the puppies the dog seemed happy so the ten year old Kunihiko decided that \"dogs can't count\". Gon-ichi, Kunihiko's father, spent time in Germany in\n1921\n-\n22\nand, with German inflation out of control, he found that the strong Japanese yen could buy large quantities of goods very cheaply. He brought back to Japan many gifts for his children and the young Kunihiko had much enjoyment from the wonderful German construction kits his father gave him. This toy made Kunihiko decide at a young age that he wanted to be an engineer.\nKodaira completed his primary education in\n1927\nand entered the middle school. He claims in\n[\n6\n]\nthat he was a poor middle school pupil but this does not quite fit the facts. He did well in English classes and in mathematics, soon getting far ahead of his fellow pupils. By the time he had completed half of the three year course, he had covered the whole syllabus of arithmetic, algebra,\n2\n- dimensional and\n3\n-dimensional geometry and solved all the problems in the set text. He therefore purchased\nAlgebra\nby M Fujiwara, an undergraduate university text, and began to work his way through matrices, determinants,\ncontinued fractions\n, quadratic reciprocity and other concepts. We note that Fujiwara Matsusaburo\n(1881\n-\n1946)\nwas an erudite and prolific author who published the two-volume treatise\nDaisugaku\n(\nAlgebra\n)\nin\n1928\n-\n29\n. Some have compared this quality text with the classic books by\nJoseph Serret\nand\nHeinrich Weber\nand it is worth mentioning that he had studied in Paris, Göttingen and Berlin.\nOne of the many things that Kodaira's father had brought back from his\n1921\n-\n22\ntrip to Germany was a piano. When he was fifteen years old, Kodaira began to learn to play the piano and had a student from Tokyo University, Mr Nakajima, as his piano teacher. When Mr Nakajima graduated from the university and moved away, his sister Tazuku Nakajima acted as Kodaira's music teacher although she was a violinist rather than a pianist. After middle school, Kodaira studied at the First High School where he was taught by Hideo Aramata\n(1905\n-\n1947)\nwho was an excellent mathematician writing books on matrices and\ndeterminants\nas well as interesting papers on the zeta-function. Kodaira saw how much Aramata enjoyed mathematics and realised that it was the subject for him. He decided at this stage of his education that he wanted to become a mathematics school teacher.\nIn\n1935\nKodaira began his university education at the University of Tokyo. In his first year of study he took the course 'Introduction to Analysis' given by\nTeiji Takagi\n. This was\nTakagi\n's last year lecturing before he retired in\n1936\n.\nShokichi Iyanaga\n, the author of\n[\n13\n]\n, conducted the exercise class for this course. He writes\n[\n13\n]\n:-\nI had given as an exercise problem to prove that the base e of the natural exponential function is not an irrational of the second degree\n(\nafter it had been proved in a lecture that e is irrational\n)\n. Kodaira came to the blackboard and wrote his proof in a few lines without speaking any word. In reading these lines with the other students, we admired his perfect proof, where every word was to the point!\nZyoiti Suetuna\nwas appointed to the chair of arithmetic and algebra at the University of Tokyo in\n1936\nwhen\nTakagi\nretired. In\n1936\n-\n37\nKodaira attended\nIyanaga\n's course on modern analysis which was based on the ideas of\nvon Neumann\n. He also attended lectures by\nSuetuna\nand, towards the end of\n1937\n, approached\nSuetuna\nasking to be admitted to his seminar in the following year. He was accepted but later\nSuetuna\nwrote to him suggesting that he thought that studying geometry in\nIyanaga\n's seminar would be more appropriate. He joined\nIyanaga\n's seminar and, in the year\n1937\n-\n38\n, he was often in\nIyanaga\n's home. There he played the piano showing his great talents as a pianist.\nIyanaga\n's sister Seiko was also a keen musician, and was a student of the violin studying with Tazuku Nakajima. Kodaira graduated from the University of Tokyo in March\n1938\nwith a Bachelor of Science in mathematics. Not content with one degree, he graduated from the physics department at the University of Tokyo in March\n1941\nwith a Bachelor of Science in physics. We note that by\n1941\nhe already had ten papers published. During these years while he studied physics he became more friendly with the Iyanaga family. In addition to Seiko,\nShokichi Iyanaga\n's daughter, there were two boys in the family. Both achieved much in their lives: Kyojiro Iyanaga became president of Nikon Optics, and Teizo Iyanaga became a professor of Japanese history at the University of Tokyo. Tazuku Nakajima organised concerts and Kodaira accompanied the violinists on the piano. He accompanied Seiko, who played in these concerts, and the two became close. They married in\n1943\nand went to Gora for their honeymoon. Gora is a hot spring resort near Hakone, in south-central Honshu, lying on the south bank of Lake Ashino, in the caldera of the extinct volcano Mount Hakone. Their honeymoon was not quite so idyllic as this sounds since, with Japan at war, food was very scarce and the couple had to bring their own rice to the hotel they stayed in as its kitchens were bare. In March\n1944\ntheir first child, a boy they named Kazuhiko, was born but conditions in Tokyo became steadily more difficult as Japan came under severe attacks. Sadly, Kazuhiko developed kidney problems and died in\n1946\n. The Kodairas also had two daughters, Yasuko and Mariko.\nKodaira had been appointed as a Lecturer in the Department of Physics of the Imperial University of Tokyo in April\n1941\nand then as an Associate professor in the Department of Mathematics of Tokyo Bunri University in April\n1942\n. In addition to this latter post, he was promoted to Associate professor in the Department of Physics of the Imperial University of Tokyo in April\n1944\n. By the autumn of\n1944\nTokyo was considered too dangerous for the family and all the women and children moved to the safety of the town of Karuizawa, in the mountains far north of Tokyo. After Kodaira completed his teaching in Tokyo at the end of the autumn term, he joined his family in Karuizawa. As Tokyo came under heavy attack with over\n1000\nUS planes bombing the city in February\n1945\n, the Physics and Mathematics Institutes were evacuated. On\n13\nApril, an air raid destroyed their home in Tokyo and Kodaira and his family moved to Yonezawa where his father owned a house. On\n6\nAugust\n1945\nan atomic bomb was dropped on Hiroshima and on\n9\nAugust a second atomic bomb was dropped in Nagasaki. Japan surrendered to the Allies on\n14\nAugust and, later that autumn the Physics and Mathematics Institutes reopened in Tokyo. Kodaira returned to the Institutes a couple of weeks after they reopened, leaving his family in Yonezawa. Rather amazingly, Kodaira was able to quickly restart his seminar and began again producing remarkable results. However, he writes in\n[\n6\n]\n:-\nI had thought to live always in Japan, enjoying mathematics and music. This thought was completely destroyed by the War.\nAt this time Kodaira was interested in\ntopology\n,\nHilbert spaces\n,\nHaar\nmeasure,\nLie groups\nand almost periodic functions. Of course, World War II had a severe affect on Japan, in particular it effectively isolated Japanese scientists from contacts with other scientists around the world. Despite this Kodaira was able to obtain papers to read of mathematical developments and he was most influenced by reading the works of\nWeyl\n,\nStone\n,\nvon Neumann\n,\nHodge\n,\nWeil\nand\nZariski\n. Kodaira was awarded his doctorate from the University of Tokyo in April\n1949\nfor his thesis\nHarmonic Fields in Riemannian Manifolds\nand published it in an\n80\n-page paper in the\nAnnals of Mathematics\nin\n1949\n. Through this paper he became well known to mathematicians world-wide and, in particular, on the strength of this paper he received an invitation from\nWeyl\nto come to Princeton.\nDonald Spencer\nwrites\n[\n21\n]\n:-\nThis paper also impressed others, including me, and I invited Kodaira to lecture on his paper at Princeton University during the academic year\n1949\n-\n1950\n. This was the beginning of a collaboration which resulted in twelve papers and our close friendship extending to his recent death.\nKodaira accepted\nWeyl\n's invitation and, from September\n1949\n, he spent a year as a fellow of the Institute for Advanced Study at Princeton. Following this he was a Visiting professor at Johns Hopkins University from September\n1950\nto June\n1951\nwhen he returned to the Institute for Advanced Study at Princeton. At this time his wife Seiko and their two young daughters Yasuko and Mariko, who had remained in Japan untill then, joined him in Princeton. He was appointed as an Associate professor at Princeton University in September\n1952\nand was promoted to a full professorship there in September\n1955\n. Up to this time he had kept open his position in Tokyo but, after being made a full professor at Princeton he resigned his positions in Tokyo.\nMichael Atiyah\nwrites about the remarkable mathematics that Kodaira produced in this period\n[\n8\n]\n:-\nDuring his time at Princeton, Kodaira continued his involvement with harmonic forms, particularly in their application to\nalgebraic geometry\n, the area which had also provided the motivation for\nHodge\n's work. The\n1950\ns saw a great flowering of complex algebraic geometry, in which the new methods of sheaf theory, originating in France in the hands of\nLeray\n,\nCartan\nand\nSerre\n, provided a whole new machinery with which to tackle global problems. Sheaf theory fitted with\nHodge\ntheory, so it was natural that Kodaira should have been well placed to exploit the new developments. This he did, in a rapid succession of papers written in collaboration with\nDonald Spencer\n. These papers altered the face of algebraic geometry, and provided the framework in which\nHirzebruch\nand others of the younger generation were able to make spectacular progress. Large numbers of problems left unsolved or incomplete by the Italian geometers of the classical school were now disposed of in convincing fashion.\nThis work led to Kodaira being nominated for a\nFields Medal\nin\n1954\n. He sailed from New York in mid August to travel to the International Congress of Mathematicians to be held in Amsterdam in September\n1954\n. He was presented with the\nFields\nMedal by\nHermann Weyl\nat the opening ceremony on\n2\nSeptember, as was the other Field Medalist\nJean-Pierre Serre\n. Kodaira delivered his lecture 'Some results in the transcendental theory of algebraic varieties' to the Congress on\n3\nSeptember. However, when he returned to the United States he did not find conditions at Princeton entirely to his liking. He wrote\n[\n6\n]\n:-\nSince\nLefschetz\nhad retired, I gradually realised that the older professors at Princeton hated me.\nAfter spending a year as a visiting professor at Harvard from September\n1961\nfollowing\nOscar Zariski\n's invitation, in September\n1962\nhe was appointed to the chair of mathematics at Johns Hopkins University.  In\n1965\nKodaira left Johns Hopkins to take up the chair of mathematics at Stanford University.\nDonald Spencer\nwas so angry that Princeton had not made an attempt to keep Kodaira on the faculty there, that he resigned from Princeton and moved to Stanford to be with Kodaira. While at Stanford Kodaira gave an introduction to the study of abstract complex analytic manifolds and his course was written up as the book\nComplex manifolds\n(1971)\n. After two years at Stanford, he returned to Japan and held the chair of mathematics at the University of Tokyo from\n1967\n[\n8\n]\n:-\nAfter Kodaira's return to Japan, he gave lectures and ran seminars which attracted many able students. Kodaira's influence was so pronounced that one could say that he established a new school of Japanese algebraic geometers.\nAt the University of Tokyo he served as Dean of the Faculty of Science\n1971\n-\n73\nbefore retiring in March\n1975\n. We should note that he was a reluctant Dean for he had been given a guarantee by the Mathematics Department that he would not be given any administrative duties when he returned in to the University of Tokyo in\n1967\n. The Faculty of Science had no such agreement with Kodaira and elected him Dean much against his wishes. He was an excellent Dean but hated the role. A consequence of his period as Dean was that he stopped doing research. He never restarted even after he resigned as Dean after two years. This explains the title of his autobiographical work\n[\n7\n]\nNotes on an idle mathematician\n.\nKodaira's work covers many topics. These include applications of\nHilbert\nspace methods to\ndifferential equations\nwhich was an important topic in his early work and was largely the result of influence by\nWeyl\n. This time through the influence of\nHodge\n, he worked on harmonic integrals and later he applied this work to problem in algebraic geometry. Another important area of Kodaira's work was to apply sheaves to algebraic geometry. In around\n1960\nhe became involved in the classification of compact, complex analytic spaces. One of the themes running through much of his work is the\nRiemann\n-\nRoch\ntheorem and this plays an important role in much of his research.\nKodaira received many honours for his outstanding research. Perhaps the most noteworthy was the award of a\nFields\nMedal in\n1954\nwhich we have already mentioned but he also received the\nJapan Academy\nPrize from the Academy of Japan in\n1957\nand the Order of Culture from the Japanese Government in the same year. He received the prestigious Fujiwara Prize in\n1975\nand the Wolf Foundation Prize in Mathematics in\n1984\n. The citation for the Wolf Prize states that the prize was awarded to Kunihiko Kodaira:-\n... for his outstanding contributions to the study of complex manifolds and algebraic varieties. ... Professor Kunihikio Kodaira made a profound study of harmonic integrals with incisive, important applications to algebraic and complex geometry. These include the projective imbedding theorem, deformations of complex structures\n(\nwith\nD C Spencer\n)\n, and the classification of complex analytic surfaces. His work has greatly influenced and inspired researchers in these subjects throughout the world.\nHe was made an honorary member of several academies and learned societies throughout the world, including the\nGöttingen Academy of Sciences\n(1974)\n, the\nNational Academy of Sciences\n(1975)\n, the\nAmerican Academy of Arts and Sciences\n(1978)\nand the\nLondon Mathematical Society\n(1979)\n.\nAfter retiring from the University of Tokyo in\n1975\n, he was appointed as Professor in the Faculty of Science of Gakushuin University, a highly-rated private university. He taught for ten years at this university but became increasingly worried about falling standards of the students. This led him to write to the Ministry of Education\n[\n14\n]\n:-\n... accusing the Ministry of Education of crushing individualism, and eliminating creativity and initiative in children and university students ...\nand to write school and university textbooks to try to improve the standard of mathematics teaching. For example, in\n1977\nhe wrote\nComplex analysis\n(\nJapanese\n)\nwhich was translated into English and published in\n2007\n. The publisher writes:-\nWritten by a master of the subject, this textbook will be appreciated by students and experts. The author develops the classical theory of functions of a complex variable in a clear and straightforward manner. In general, the approach taken here emphasises geometrical aspects of the theory in order to avoid some of the topological pitfalls associated with this subject. Thus,\nCauchy\n's integral formula is first proved in a topologically simple case from which the author deduces the basic properties of\nholomorphic\nfunctions. Starting from the basics, students are led to the study of conformal mappings,\nRiemann\n's mapping theorem, analytic functions on a\nRiemann\nsurface, and ultimately the\nRiemann\n-\nRoch\nand\nAbel\ntheorems. Profusely illustrated and with plenty of examples, and problems\n(\nsolutions to many of which are included\n)\n, this book should be a stimulating text for advanced courses in complex analysis.\nIn\n1979\nhe published the five volume\nIntroduction to analysis\nin Japanese covering real numbers, functions, differentiation, integration, infinite series, functions of several variables, curves and surfaces,\nFourier series\n,\nFourier\ntransforms, ordinary differential equations, and distributions. In\n1986\nhe published the monograph\nComplex manifolds and deformation of complex structures\n. Andrew Sommese begins a detailed review as follows:-\nIn mathematics and science it is a familiar occurrence to have objects, such as systems of equations, depending on parameters. The investigation of this dependence goes under many names such as the study of bifurcations, or of unfoldings, or of deformations depending on the area. Historically and conceptually, the local deformation theory of compact complex manifolds has played a central role in the modern understanding of these phenomena. 'Complex manifolds and deformation of complex structures' is a careful exposition of this local compact complex analytic deformation theory by one of its founders.\nJames Carlson, reviewing the same book, writes:-\nThe author, who with\nSpencer\ncreated the theory of deformations of a complex manifold, has written a book which will be of service to all who are interested in this by now vast subject.\nThe last ten years of his life were ones during which he battled against health problems. He suffered from respiratory problems and also became very deaf, which sadden him greatly since he could not enjoy music which had meant so much to him throughout his life. He was too ill in\n1990\nto attend the International Congress of Mathematicians in Kyoto.\nFriedrich Hirzebruch\nrecalled in\n[\n12\n]\nhis last meetings with Kodaira:-\nKunihiko Kodaira was friend and teacher for me. My wife and I remember our last visit to the Kodairas' house in Tokyo. He was working at the kitchen table on textbooks for secondary schools. Seiko Kodaira had to push the papers away when preparing the meal. In\n1995\nI congratulated him on his eightieth birthday. He answered in his charming way. But when we came to Tokyo in\n1996\n, he was already in the hospital. We could not talk to him anymore.\nKodaira's wife, Seiko, died in January\n2000\n, two and a half years after her husband.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}