{
  "nome_completo": "Kushyar ibn Labban",
  "nome_curto": "Kushyar ibn Labban",
  "ano_nascimento": "971",
  "ano_morte": "1029",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kushyar/",
  "lugar_nascimento": "Gilan (now in Iran)",
  "lugar_morte": "Baghdad (now in Iraq)",
  "biografia": "Kushyar ibn Labban\nwas from the village of Gilan, which was situated south of the Caspian sea in Persia. He is known by several different variants of his name, which has been transliterated as Kusyan, Kushiyad, Koshar, Kusiar or Kossar. Sometimes he has been called Jabah, Halebi and al-Kiya. The name Labban, sometimes written as Labbar, was his father's name and means \"lion\".\nVery little is known of Kushyar ibn Labban's life. There are various different claims, one of which suggests that he was a Jew, but none are substantiated. The only fact which is certain, other than the material in his works, is that he taught\nal-Nasawi\n.\nFrom his works we know that Kushyar was primarily an astronomer who wrote texts on astronomy and geography. He produced astronomical tables and also wrote a work on the astrolabe. Most significant in terms of this archive is his work on Hindu reckoning being the earliest known work on Arabic arithmetic which deals with Hindu numerals. An earlier text by\nAbu'l-Wafa\non arithmetic did not use Hindu numerals.\nKushyar's\nPrinciples of Hindu reckoning\nwas written about\n1000\nAD. In\n[\n1\n]\nits importance is described as follows:-\nKushyar ibn Labban's Principles of Hindu reckoning ... is singularly important in the history of mathematics, not only for its mathematical content, but also for its linguistic interest and its relation to earlier and succeeding algorisms. It may be the oldest Arabic mathematical text using Hindu numerals, and ibn Labban's concepts reveal considerable originality ...\nLet us consider the\nPrinciples of Hindu reckoning\nin a little more detail. The first point to note is that Kushyar uses a symbol for zero, but does not use any separating symbol to distinguish the fractional part of a number from the integral part. He discusses decimal numbers in the main body of the text, relegating sexagesimal numbers to a separate treatment in tables. Topics considered include addition and subtraction of decimal numbers followed by multiplication and division of decimal numbers. Kushyar gives methods to construct exact square roots, as well as approximate methods to calculate the square roots of non-square numbers. Similarly he gives methods to construct exact cube roots, and an approximate method to calculate the cube root of a non-square number. As a check on the accuracy of his results, Kushyar uses the method of \"casting out nines\" or \"checking the nines\" which basically checks that the sums are correct modulo\n9\n.\nLevy and Petruck write in\n[\n1\n]\n:-\nIbn Labban's Arabic text was written in a highly abbreviated style that must have been difficult to understand when studied alone. It is easily seen, therefore, why\nal-Nasawi\nfound it worthwhile to elaborate on the work of his teacher ...",
  "math_areas": []
}