{
  "nome_completo": "László Filep",
  "nome_curto": "László Filep",
  "ano_nascimento": "1941",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Filep/",
  "lugar_nascimento": "Csaszlo, Szabolcs-Szatmar-Bereg, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "László  Filep\n's father was the Calvinist minister for the community around the village of Csaszlo in the Northern Great Plain region of eastern Hungary close to the Romanian border. The elementary school in Csaszlo had a single room in which all pupils in different years were educated, and Filep studied at this school until he reached the age to attend secondary school. He attended the Secondary Grammar School in Mátészalka, one of the major towns in the county of Szabolcs-Szatmar-Bereg where he lived.\nFilep graduated from Mátészalka Secondary School and entered the Kossuth Lajos Tudományegyetem, or the Lajos Kossuth University in Debrecen as it is called in English. The University was founded in\n1912\nbut it had been a Protestant College from\n1550\n. It was named after Lajos Kossuth, the leader of the revolutionary government, who declared the independence of Hungary from the Habsburgs in Debrecen in\n1849\n. Filep graduated from the Kossuth University in\n1964\n, qualifying as a secondary teacher of mathematics and physics. He then became a secondary school teacher of mathematics.\nIn\n1973\nFilep was appointed as a lecturer at the College of Nyíregyháza. He worked for the degree of dr. univ. submitting his thesis\nLife and work of Gyula Farkas\n(1847\n-\n1930)\nto the Kossuth University in Debrecen in\n1978\n. This is the English title of an abridged version of the thesis which he published as a paper in\n1983\n. G H Moore writes in a review that the paper:-\n... contains a biography of the Hungarian mathematician and theoretical physicist\nGyula Farkas\n, together with a bibliography of his publications. There is some discussion of the\nFarkas\ntheorem\n(\nused in linear programming\n)\nand, more generally, of\nFarkas\n's research on linear inequalities. His contributions to physics were concerned with mechanical equilibrium, thermodynamics, and electrodynamics.\nIn the introduction of a Hungarian version of the work published\n1981\n, Filep writes:-\nFifty years ago, on December\n26\n,\n1930\n, the outstanding Hungarian mathematician and physicist\nGyula Farkas\ndied. He was a member of the\nHungarian Academy of Sciences\nand an honorary member of the\nLoránd Eötvös\nMathematics and Physics Institute. After his death both he and his accomplishments for the most part fell into obscurity. However, at present renewed attention is being given to his results in optimization theory and mechanics.\nBut this was not Filep's first publication, for he had published a number of articles in the prestigious Hungarian popular scientific magazine,\nTermeszet Vilaga\n(\nThe World of Nature\n)\n. The first of these articles was\nFarkas Gyula\n(1847\n-\n1930)\npublished in\n1976\n, was followed by\nA matematika nagy nöalakjai\nⓉ\n(\nMajor female characters in mathematics\n)\n(1977)\nand\nHelyunk a tudomany vilagaban\nⓉ\n(\nSpace science world\n)\n(1979)\n. He published many other articles on the history of mathematics such as\nLajos David\n(1881\n-\n1962)\n, historian of Hungarian mathematics\n(1981)\n,\nGreat female figures of Hungarian mathematics in\n19\nth\n-\n20\nth\ncenturies\n(1983)\n,\nThe development, and the developing of, the concept of a fraction\n(2001)\n,\nThe genesis of\nEudoxus\n's infinity lemma and proportion theory\n(2001)\n,\nFrom Fejer's disciples to Erdős's epsilons - change over from analysis to combinatorics in Hungarian mathematics\n(2002)\n, and\nIrrationality and approximation of √\n2\nand √\n3\nin Greek mathematics\n(2004)\n. He also published biographies of many mathematicians including\nJanos Bolyai\n, John C Harsanyi,\nJohn von Neumann\n, and\nPaul Erdős\n.\nLet us look in slightly more detail at three of Filep's articles on the history of mathematics by quoting his own summary to these papers. He published\nPal Gyula-Julius Pal\n(1881\n-\n1946)\n, the Hungarian-Danish mathematician\nin\n2000\n, writing in the summary:-\nJulius Pal\n(\nPál Gyula in Hungarian usage\n)\nwas a noted mathematician of the first half of the twentieth century. The first part of his life is connected to Hungary, the second to Denmark. As a consequence of this fact, and of turbulent history, very little exact information concerning his life and work has survived. We started our common research work on Pal some years ago, and now we are able to give an overview of his path of life, and to gain some insight into his scientific work. For studying his life we mainly relied on primary sources from state and primary archives both in Hungary and in Denmark.\nHe summarised his\n2003\npaper\nProportion theory in Greek mathematics\nas follows:-\nThe concepts of ratio, equal ratio, and proportion played an important role in ancient Greek mathematics. Book V of\nEuclid\n's 'Elements' contains a proportion theory of\n(\ngeometrical\n)\nmagnitudes based on the equal ratio definition of\nEudoxus\n(\nDefinition V.\n5)\n. In this paper we study both the pre-Eudoxian theory of proportion, and the genesis of\nEudoxus\n's definition.\nFinally Filep's abstract of his paper\nA new approach for explaining Rhind's Recto - and its utility in teaching\nreads as follows:-\nThe Recto is a table in the Rhind Mathematical Papyrus\n(\nRMP\n)\nof ancient Egypt containing the unit fraction decompositions of fractions\n2\nn\n\\Large\\frac{2}{n}\\normalsize\nn\n2\n​\n(\n3\n≤\nn\n≤\n101\n,\nn\n3 ≤ n ≤ 101, n\n3\n≤\nn\n≤\n1\n0\n1\n,\nn\nodd\n)\n. To the question how\n(\nand why\n)\nthe decompositions were made, there exists no generally accepted answer. The fact that in some other sources of Egyptian mathematics decompositions different from those in Recto exist makes the problem more difficult. Researchers normally try to find the answer in some formulas by which the entries of the table were calculated\n[\nsee e.g.\n1\n,\n42]\n. We are convinced that the correct answer is not hidden in formulas but in the characteristics of Egyptian mathematics namely those of fraction and division concepts. To study them is important not only from historical point of view but also from methodological one: how to develop fraction concept and how to make division easier.\nWe must not give the impression that Filep's only research interest was in the history of mathematics for he also published a long series of papers on fuzzy groups, some written with his collaborator\nGyula Iulius Maurer\n, beginning in\n1987\n.\nChanges in the Hungarian system of doctorates in the early\n1990\ns meant that Filep felt the dr. univ. he acquired in\n1978\nwas not now satisfactory for his academic position so he submitted a thesis for a Ph.D. to the University of Debrecen in\n1995\n. This was awarded for his thesis\nLife and Work of Gyula Farkas\nwritten under supervision from Barna Szénássy and Lajos Tamássy. We should note that between his two doctoral degrees the Lajos Kossuth University in Debrecen had joined with the Medical University of Debrecen and a Technical University in Debrecen to become the University of Debrecen.\nWe\n[\nJOC and EFR\n]\nmet László Filep in\n2004\nwhen we attended a conference on the history of mathematics in Miskolc, Hungary. Philip Davis also attended the conference in Miskolc, having attended another conference in Vienna in the days before. Filep brought Davis from Vienna to Miskolc so that he could attend both conferences. Shortly after the Miskolc conference, Filep collapsed and died during a lecture that he was giving at the Sapientia College of Theology of Religious Orders in Budapest. Shortly before his death he had received the Beke Mano Award from the\nBolyai Janos\nMathematical Association.",
  "math_areas": [
    "Analysis",
    "Combinatorics"
  ]
}