{
  "nome_completo": "Lamberto Cesari",
  "nome_curto": "Lamberto Cesari",
  "ano_nascimento": "1910",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cesari/",
  "lugar_nascimento": "Bologna, Italy",
  "lugar_morte": "Ann Arbor, Michigan, USA",
  "biografia": "Lamberto Cesari\nstudied at the Scuola Normale Superiore in Pisa. He undertook research there in the Mathematical Seminar run by\nLeonida Tonelli\n. He published the paper\nSulle serie doppie\nⓉ\n(\nOn double series\n)\nin\n1932\nand in it he acknowledged his debt to the Pisa Mathematical Seminar. He was awarded his laurea in\n1933\nafter submitting his thesis\nSulle condizioni sufficienti per le successioni di Fourier\nⓉ\n(\nOn sufficient conditions for  Fourier series\n)\n. He then went to Munich where he studied with\nConstantin Carathéodory\nduring the academic year\n1934\n-\n35\n. While he extending his mathematical experience in Munich he met Isotta Hornauer, the daughter of Franziska Brandl and Ludwig Hornauer, who had been born in Marktredwitz, Bavaria in\n1913\n. They were married and formed a strong partnership throughout their lives.\nAfter spending this year in Munich, Cesari returned to the Scuola Normale Superiore in Pisa where he taught for the academic year\n1935\n-\n36\nbefore going to Rome where he spent the two years\n1936\n-\n38\nat the Istituto Nazionale per le Applicazioni del Calcolo. This Institute had been founded by the mathematician Mauro Picone in\n1927\nand is today named after him. Influenced by Picone, Cesari looked at some new research areas while in Rome and he published the significant paper\nSulla risoluzione dei sistemi di equazioni lineari per approssimazioni successive\nⓉ\n(\nOn solving systems of linear equations by successive approximations\n)\nin\n1937\n. This paper on iterative methods contains his general theory of stationary iterations given in terms of matrix splittings. The paper also contains applications of his general methods to more specialised problems, solutions to which had been found by\nCarl Jacobi\nand\nRichard von Mises\n. It was in applying his theory to the method discovered\nvon Mises\nthat Cesari was led to the idea of 'polynomial preconditioning'. His important discoveries during this period are discussed in\n[\n2\n]\n:-\nIn\n1937\n, Cesari proposed the concept of L-integrable functions f\n(\nx, y\n)\nof bounded variation, and these functions were later called BVC functions. He proved that a suitably generalized area of the discontinuous surface z = f\n(\nx, y\n)\nis finite if and only if f is BVC, a difficult extension to the discontinuous case of\nTonelli\n's analogous statement for the continuous case. Cesari also proved that the double\nFourier series\nof any BVC function f\n(\nx, y\n)\nconverges almost everywhere to f\n(\nx, y\n)\n, a sharp result.\nWhile in Rome his wife, Isotta, worked as a language instructor and translated Italian literature into German. Cesari had published several other works during these years, for example\nSulle funzioni a variazione limitata\nⓉ\n(\nOn functions with bounded variation\n)\n(1936)\nand\nSulle serie di Fourier delle funzioni lipschitziane di più variabili\nⓉ\n(\nOn the Fourier series of Lipschitz functions of several variables\n)\n(1938)\n. In\n1938\nthe Cesaris left Rome and returned to Pisa where Lamberto was appointed as 'professore incaricato'\n(\nassistant professor\n)\nat the University of Pisa. They spent the first years of World War II in Pisa and gained great respect for the humanitarian work they carried out at this time. During this period he studied surfaces given by parametric equations, in particular the\nLebesgue\narea of such a surface. He succeeded in giving necessary and sufficient conditions for such an area to be finite, a result which many mathematicians had tried unsuccessfully to produce.\nThe Cesaris left Pisa in\n1942\nwhen Lamberto was appointed to the University of Bologna. Again during these war years spent in Bologna they carried out humanitarian work. He was appointed as Professor of Mathematical Analysis at the University of Bologna in\n1947\nafter winning a competition for the chair. However, his work on the\nLebesgue\narea of surfaces which we mentioned above, and other variational problems he had studied, had given him an international reputation and he was invited to spend time at the Institute for Advanced Study at Princeton in the United States. At the Institute he met\nTibor Radó\nwho, like Cesari, had been undertaking research on area theory.\nRadó\nand Cesari were invited to address the International Congress of Mathematicians in Cambridge, Massachusetts in September\n1950\nand they presented their paper\nApplications of area theory in analysis\n. In the lecture, R G Helsel writes, they describe:-\n... the two-dimensional concepts of bounded variation and absolute continuity devised by L Cesari,\nT Radó\n, and P V Reichelderfer and ... show applications of these concepts in the transformation of double integrals, calculus of variations, and\nLebesgue\narea theory.\nAfter a spell as a visiting member of the Institute where he arrived in\n1949\n, he was invited as a Visiting Professor to the University of California at Berkeley. A further invitation saw him occupy a similar role at the University of Wisconsin, Madison, in\n1950\n. Wendell Fleming writes:-\nLamberto Cesari visited from Italy in the second semester. His course on calculus of variations and seminar fostered my interest in that area. Soon after, Cesari moved to Purdue University, and I joined his group there in\n1955\n.\nAs Fleming suggests, Cesari was offered a professorship of mathematics at Purdue University, Lafayette, Indiana in\n1952\n. Again Cesari was invited to address the International Congress of Mathematicians, this time in Amsterdam in\n1954\n. He gave the lecture\nRetraction, homotopy, integral\nwhich,\nTibor Radó\nwrites:-\n... is an excellent expository paper on surface area theory and its application in various fields of analysis. ...\n[\nThe\n]\npaper furnishes a valuable account of many of the principal lines of research in this general field, with particular emphasis upon topics where the author and his associates made outstanding contributions. These include concepts of bounded variation, absolute continuity, and generalized Jacobians for continuous mappings T, and the principal theorems relating to these concepts; tangential properties of general continuous surfaces; the theory of a general\nWeierstrass\n-type double integral; extremely general forms of the\nGauss\n-\nGreen\nand\nStokes\ntheorems; theorems on homotopy and retraction for general continuous surfaces; and far-reaching results in calculus of variations for double integrals.\nIn\n1956\nPrinceton University Press published Cesari's monograph\nSurface area\n.\nLaurence Chisholm Young\nwrites:-\nSince\n[\nRadó\n's 'Length and area'\n(1948)]\nhas inspired many researches during the intervening years, it has rendered Cesari's task all the more arduous, by the wealth of new material to be presented as well by the high standard of its proved excellence. ... Cesari's \"Surface area'' ... constitutes, like\n[\nRadó\n's 'Length and area'\n]\n, a new departure in area theory, likely to have a profound influence on future developments.\nThree years later, in\n1959\n, Cesari published the monograph\nAsymptotic behavior and stability problems in ordinary differential equations\n. Cesari writes in the Introduction that:-\n.. the purpose of the present volume is to present many viewpoints and questions in a readable short report ...\nJ A Nohel, in a review, explains that \"this objective has been accomplished admirably\" and writes of the author's \"clarity of presentation\".\nIn\n1960\nCesari was called to the chair of mathematics at the University of Michigan, Ann Arbor. He was appointed to the\nR L Wilder\nDistinguished Professorship of Mathematics in\n1975\nand was named the Henry Russel Lecturer for\n1976\n. He retired in\n1980\n. In\n[\n4\n]\nhis research contributions are summarised:-\nOne of Cesari's abiding interests was the study of problems in the calculus of variations, and he also did a great deal of work in optimal control. Particularly noted for his study of the existence theorems for optimal solutions for both single- and multi-dimensional systems, he also contributed to the theory of necessary conditions and the analysis of Pareto problems.\nIn fact much of this appears in his book\nOptimization - theory and applications: Problems with ordinary differential equations\npublished in\n1983\n. We will return to say more about this book after giving further details of his research contributions from\n[\n4\n]\n:-\nIn the last twenty years, much of his attention was devoted to the study of questions arising in nonlinear analysis and its applications to differential equations. He continued his work, begun in the\n1950\ns, on the Alternative Method, especially as applied to problems with large nonlinearities. He also investigated the existence of solutions to certain quasi-linear hyperbolic systems. In recent years, he continued his study of existence theorems, analysis various problems, including those which arise in the theory of plasticity and whose optimal trajectories may have jump discontinuities. During the last few years of his life, Cesari worked on the theory of functions of bounded variation, a field that he himself had pioneered, and its applications to the theory of hyperbolic systems of conservation laws.\nWe promised to return to his book\nOptimization - theory and applications: Problems with ordinary differential equations\npublished three years after he retired. Thomas Angell writes in  a review:-\nThis book is an encyclopedic treatment dedicated to the exposition of both the classical and modern theories. ... It is devoted to problems in one independent variable, and in particular to nonparametric problems. ... this work is unique both in scope and scholarly approach. ... This book is very carefully written, quite detailed, and for the most part, self-contained. ... Some of these technical sections will require close attention, but the rewards will be great.\nJ Warga\nwrites in\n[\n7\n]\n:-\nCesari lays great stress on the connection of theory to applications and devotes two chapters to illustrative examples from geometry, mechanics, aerospace science, economics and other fields. In addition, he provides a large number of examples and counterexamples to illustrate the power and the limitations of various theorems. These very welcome features of Cesari's book distinguish it from most other texts on optimal control. Aside from Young's book\n[\nL C Young\n, Lectures on the calculus of variations and optimal control theory\n(1969)]\n, Cesari's text is perhaps the only one attempting to bridge the gap between the calculus of variations and optimal control theory. This is especially true in existence theory in which the ideas of\nTonelli\nare merged with those of Filippov and of Cesari himself to construct a largely unified framework.\nE O Roxin also reviewed the book writing in\n[\n5\n]\n:-\n... this book is an excellent addition to the existing literature. As a reference manual for the subject, it is very useful, as it presents different kinds of approaches and their relations, which are often quite confusing. But this book is not addressed only to the specialists. It could be used very well for a graduate level course, provided a judicious selection is made on which sections to cover.\nFinally we note that, in collaboration with his wife, Cesari published\nMathematics in the Mediterranean: today's view\nin\n1990\n. Cesari and his wife took much pleasure from their home and its garden in Ann Arbor. They planted trees and kept a garden that was a pleasure to visit providing a peaceful haven in the middle of a busy city. Perhaps Isotta Cesari's poem which was published in the\nAmerican Mathematical Monthly\ngives an idea of part of their home life.\nSee\nTHIS LINK\n.\nCesari received many honours including election to the\nAccademia dei Lincei\nin Rome and the Academies of Bologna, of Modena and of Milan. In\n1976\nhe was awarded an honorary degree by the University of Perugia. The University of Texas organised a conference in his honour in\n1980\nand, two years later, the University of Bologna organised an international conference in his honour.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}