{
  "nome_completo": "Lancelot Thomas Hogben",
  "nome_curto": "Lancelot Hogben",
  "ano_nascimento": "1895",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hogben/",
  "lugar_nascimento": "Southsea, Portsmouth, Hampshire, England",
  "lugar_morte": "Wrexham, Wrexham, Wales",
  "biografia": "Lancelot Hogben\nwas the son of Thomas Hogben\n(1850\n-\n1921)\nand Margaret Alice Prescott\n(1858\n-\n1949)\n. Thomas was a Methodist who left school at the age of ten and, by the time of the\n1871\ncensus, was a coal merchant living as a boarder at the home of the plumber and house decorator William Prescott and his wife Mary Alice née Tunbridge who were also a Methodists. We note that William and Mary's thirteen year old daughter Margaret Alice Prescott was also living there and, at the\n1881\ncensus, Thomas Hogben was still living with the Prescotts. On\n4\nOctober\n1881\nThomas married Margaret Alice Prescott, the marriage taking place at Mildmay Park Methodist Chapel in Islington. Thomas' occupation at the time was given as shop fitter and they lived in Stoke Newington, Middlesex. Thomas and Margaret Hogben had seven children, the first three, Margaret Hogben\n(1883\n-\n1960)\n, Alice Mary Hogben\n(1885\n-\n1904)\nand William Bramwell Hogben\n(\nborn and died\n1890)\n, being born in Stoke Newington. Thomas became an enthusiastic Methodist preacher devoting more and more of his time to this occupation.\nAt the time of the\n1891\ncensus Thomas was a helper at the Soldier's Institute in Portsmouth and his occupation is given as director of mission work while his wife and two surviving children were living at Stoke Newington. Shortly after this Thomas's father-in-law, William Prescott, retired to Southsea, Portsmouth and set aside part of his home there for Thomas, Margaret and their children. Thomas, supported by his father-in-law, could now be a full-time Methodist preacher and missionary. He owned a 'Welcome Mission' in Portsmouth where he aimed to convert sailors who, he hoped, would in turn take the Methodist message around the world. Thomas and Margaret's four youngest children, Dorothy Hogben\n(1893\n-\n)\n, Lancelot Thomas Hogben\n(1895\n-\n1975)\n, the subject of this biography, George Hamilton Hogben\n(1897\n-\n1967)\n, and Bernard Tunbridge Hogben\n(1901\n-\n1973)\nwere all born in Portsmouth. We note at this point that George Hamilton Hogben became a medical doctor and became a medical officer of health for Hornsey and Tottenham, London.\nLancelot was brought up in a very strict austere regime determined by his parents' Methodist beliefs. There were lengthy prayer sessions before breakfast and after tea every day, while cards, alcohol and tobacco were forbidden and there was careful control of all reading material. The Bible was the main source of reading with insistence that every last detail had to be accepted literally. Lancelot, whose parents decided that he must become a Methodist missionary, had been named after the Methodist missionary the Reverend Lancelot Railton. He was sent to a small private school in Southsea, Portsmouth, to avoid him coming into contact with children his parents described as \"common people.\" It probably achieved that aim but provided an extremely poor education. He was allowed to make occasional visits to his paternal grandfather George Hogben\n(1809\n-\n1906)\nwho lived in Hougham near Folkestone in Kent. George, although long retired, had earnt his living thatching houses and digging ditches and was very knowledgeable about the countryside around his home. Lancelot and his grandfather would go for walks and collect plants and animals which Lancelot classified, a passion he would retain throughout his life.\nOn\n24\nOctober\n1905\n, William Prescott\n(1830\n-\n1905)\n, Lancelot's maternal grandfather, died leaving his property to Lancelot's mother. Some time after this, the Hogben family moved to Stoke Newington and Lancelot attended the Middlesex County Secondary School in Tottenham. At the time of the\n1911\ncensus, the family, consisting Thomas, Margaret, their daughters Margaret and Dorothy, and sons Lancelot Thomas, George Hamilton, and Bernard Tunbridge, are in Stoke Newington, living at\n91\nBethune Road. Thomas gives his occupation as the editor of \"One by One Magazine\" of the One by One Working Band. Thomas had\n[\n144\n]\n:-\n... invented, and led for some thirty years, a non-denominational association called the One by One Band, each member of which concentrated on one or more target individuals to be prayed for by name, exhorted, saved and hopefully enrolled in the Band. It grew in this way from a small group of enthusiasts into an internationally distributed organisation with many thousands of members.\nAt first Lancelot did not excel at the Middlesex County Secondary School. His educational background was weak and his strict background prevented him from taking part in many sporting and social events. The year\n1909\nwas, however, very significant for in the autumn of that year he contracted scarlet fever and could not attend school for a term. He found school books in his home which had belonged to a cousin who was a teacher and he enjoyed learning various subjects on his own, a skill he continued throughout his life. After recovering from scarlet fever, he returned to school, and now topped his classes. He would spend hours at the Stoke Newington public library where he studied works on biology and other academic disciplines. In addition he read widely plays and novels ignoring his parents' rules that he read\n[\n76\n]\n:-\n... no fiction which mentioned an unmarried mother, or work tainted with Darwinism ...\nHe soon passed examinations in Latin, physics, chemistry, botany and zoology, took the entrance examinations at Trinity College, Cambridge, and was awarded a Major Entrance Scholarship. He also received a London County Council Bursary.\nHogben began his university studies at Trinity College in October\n1913\nhaving sought the cheapest possible accommodation. His tutor was the mathematician\nErnest William Barnes\nand this proved a major influence in Hogben's religious development.\nBarnes\nhad been ordained a deacon but had outspoken views on religion and, rather surprisingly for someone who went on to hold high office in the Church, often unorthodox religious beliefs. Although Hogben had turned against the fundamentalist views of his parents before matriculating at Trinity College, he was still attending Methodist services when he became a student. His discussions with\nBarnes\ncertainly gave him confidence to seek his own position within Christianity.\nHe was an outstanding student, although he still preferred to teach himself rather than listening to formal lectures. He loved discussions and attended public lectures from many outstanding thinkers such as\nBertrand Russell\n. Clearly one of the best students, he was awarded a Senior Scholarship and moved into College. In\n1914\nhe sat the External B.Sc. examinations from the University of London and was awarded the degree. He then took the examinations for Part I of the Natural Sciences Tripos and was awarded a First. He also received the Frank Smart Prize as the best student in zoology.\nIn Hogben's first year at Cambridge the seemingly inevitable path towards a war was clear. Hogben was saddened to see his Methodist contemporaries enthusiastically joining the Officers Training Corps and a student friend suggested he might like to join the Quakers. He wrote\n[\n76\n]\n:-\nI already knew of the Quakers as a denomination which had taken an active part in the emancipation of the slaves, that they regarded military service as contrary to the profession of a Christian and that they proclaimed no dogmas to which a modernist could not subscribe.\nHe began attending Quaker meetings and by the summer of\n1914\n, just before the outbreak of World War I, he joined the Society of Friends. After passing Part I of the Tripos, he used the rule introduced by Cambridge that war work would count as residence, and first worked for the War Victims Contingent helping build homes for those made homeless by the war, then worked for the Friends' Ambulance Unit based in Dunkirk. Both of these were Quaker organisations. In January\n1916\nthe government passed the Military Service Act making conscription compulsory for all men aged between\n18\nand\n41\n. There were exemptions and he could almost certainly have been exempted by continuing his work for the Friends' Ambulance Unit. Hogben, however, saw that the Military Service Act changed things - he had undertaken this war work voluntarily but if he continued he would be doing it to avoid conscription. He returned to Cambridge intending to refuse to undertake any type of war work as a conscientious objector.\nHe graduated in June\n1916\nbefore his call-up papers arrived. When the papers arrived he refused to serve, was interrogated at Cambridge, court martialled on Salisbury Plain and, after refusing to undertake a medical examination on religious grounds, was imprisoned in Wormwood Scrubs. Sewing mail bags while in solitary confinement, his health broke down and he was discharged before the end of his three month sentence. He worked as a journalist in London but then, in September\n1917\n, he was appointed as a lecturer in zoology at Birkbeck College.\nWhile working as a journalist in London, he had met up with Dorothy Enid Charles\n(1894\n-\n1972)\nwhom he had known at Cambridge. Known as Enid, she was the daughter of the Welsh Congregational Minister James Charles\n(1847\n-\n1920)\nand his wife Mary Jane Davis\n(1854\n-\n)\n. Enid had studied at Newnham College, Cambridge from\n1913\nto\n1916\ntaking Part I of the Mathematical tripos and Part II Economics followed by a Social Science diploma from Liverpool University. She was an enthusiastic socialist and feminist, and had arrived in London as an organiser of the women's wing of the Trade Union Movement\n[\n144\n]\n:-\nThey moved into a flat in the autumn of\n1917\nand married shortly afterwards in anticipation of the birth of their first child.\nTheir first child, Ennyd Sylvia Hogben\n(1918\n-\n1999)\n, was born on\n9\nDecember\n1918\nand was followed by three more children, Charles Adrian Michael Hogben\n(1921\n-\n2001)\n, Claire Estelle Hogben\n(1924\n-\n1999)\n, and David Julian Lancelot Hogben\n(1929\n-\n)\n. Let us note that C A M Hogben became a medic and served as Professor and Executive Officer in Physiology at George Washington University in Washington D.C. and then as Professor and Head of the Physiology and Biophysics Department in the University of Iowa.\nHogben wrote in his autobiographical work\n[\n76\n]\n:-\nFor each of us, socialism now filled the religious vacuum that human nature abhors ... Much of my mental energy had hitherto been absorbed in a fruitless search for an intellectually compelling rationale to rescue some fragments from the wreckage of my family faith. The mood of liberation I experienced when I offloaded the last lumber of theism from my mental luggage was no less exhilarating than that of Bunyan's Pilgrim when the burden of sin fell from his back. I was at last free to mobilise all my intellectual resources to pursue a career of scientific research with steadfastness of purpose and, thanks to an over-active thyroid gland, with almost demoniacal energy.\nIndeed, his output was remarkable as can be seen from the\n144\npublications listed in\n[\n144\n]\nand the selection of his books presented at\nTHIS LINK\n.\nAfter teaching for the two years\n1917\n-\n19\nat Birkbeck he remained in London, taking up an appointment at the Royal College of Science, part of the Imperial College of Science and Technology. Up until this time he had not studied advanced mathematics but while at the Royal College of Science he attended mathematics lectures by\nHyman Levy\n. Hogben and\nHyman Levy\nwere friends and both were politically active with left-wing views. At this time, Hogben was living in a cottage near Amersham and commuted by train every day. While on the train he did the mathematical homework set by\nHyman Levy\nand, as was always the case with Hogben, made his own studies of the subject.\nIn\n1922\nHogben moved to Edinburgh, taking up the position of Deputy Director of the Animal Breeding Research Laboratory. His reason for the move was to continue his cytological work with his friend Frank Crew who had been appointed as Director of the Laboratory. Hogben was awarded a Mackinnon Research Studentship by the\nRoyal Society\nto support his work in Edinburgh. Although his research at the Laboratory went very well, after a year he accepted a senior lectureship at the University of Edinburgh. While in Edinburgh he was a major figure in the founding of the\nJournal of Experimental Biology\n. Despite having a highly productive academic life in Edinburgh, he was not particularly happy in that city and made another move in\n1925\n, accepting an Assistant Professorship of Medical Zoology at McGill University in Montreal, Canada.\nHogben, his wife and their three children, sailed from Southampton on the \"Empress of Scotland\" on\n22\nAugust\n1925\n. They arrived in Quebec on\n29\nAugust and travelled to Montreal. They stayed in Canada for only a short while, however, for in January\n1927\nthey sailed on an Elder Dempster cargo boat to South Africa where Hogben was appointed to the Chair of Zoology in Cape Town. He was delighted to find what he described as a \"zoologist's paradise\" for both teaching and research. He was enthusiastic about teaching and always looked to break with traditional ways and find better methods. His first year lectures at Cape Town became the book\nPrinciples of Animal Biology\n(1930)\n, see extracts from some reviews at\nTHIS LINK\n.\nPerhaps the main reason that Hogben deserves a biography in a History of Mathematics Archive is the fact that he wrote\nMathematics for the Million\n(1936)\n, one of the most popular mathematics books ever published. It was in Cape Town that this book took shape. He writes\n[\n76\n]\n:-\n... the Education Department of Cape Town had decided to introduce Biology as a compulsory subject into the school curriculum; but then there were as yet few, if any, qualified teachers. At\n5\n.\n00\np.m. I put on a duplicate course of my morning undergraduate lectures for teachers ... It was indeed a challenge to deal with a more critical audience than the docile recipients of instruction earlier in the day. Also it earned me the friendship of Freddie\n(\nlater Sir Frederick\n)\nClarke, then Professor of Education in Cape Town, but later Director of the London Institute of Education. At his request I met weekly his students for the Education Diploma with carte blanche to talk about anything.\nMuch of the time, Hogben chose to talk about mathematics with these Education Diploma students. Although it would be some years before he wrote\nMathematics for the Million\n, nevertheless it was these discussions that formed the basis for the book.\nDespite South Africa being a \"zoologist's paradise,\" there was one aspect of the country that Hogben detested, namely the increasing moves towards apartheid. Although neither Hogben nor his wife were politically active, it was clear by their actions that they were determined to treat all races equally. Their views were clear, for example, from the fact that Hogben sponsored the young Communist and anti-apartheid activist Edward Roux who was a frequent visitor to his home. Hogben writes\n[\n76\n]\n:-\n... by the beginning of\n1929\nthe prospect was not at all healthy for university staff who openly opposed the Government's racial policy.\nThe British Association met in Cape Town in\n1929\nand Hogben's outstanding contributions to the meeting led to his increasingly high reputation among British scientists. His views were also becoming very well known through the books he was publishing, and in particular he made his opposition to the Eugenics Society clear. He returned to England in\n1930\nwhen appointed to the newly created Chair of Social Biology at the London School of Economics.\nThe\n2015\npaper\n[\n138\n]\nexplains that Hogben's appointment was not quite the direct competition with\nR A Fisher\nas had previously been believed:-\nFrom\n1930\nto\n1937\nLancelot Hogben FRS occupied the Chair of Social Biology at the London School of Economics and Political Science. According to standard histories of this appointment, he and\nR A Fisher\nFRS both applied for the position, but Hogben was selected over\nFisher\n. The episode has received attention in large part because of the later prominence of the two figures involved. The surviving archival records, however, tell a remarkably different story. Neither\nFisher\nnor Hogben was ever an official candidate for the chair. Indeed,\nFisher\nseems not to have applied for the position at all, and Hogben was approached only behind the scenes of the official search.\nIn\n1933\nHogben became ill and required an operation on his sinuses. While in hospital, he claimed, he wrote up the mathematics notes he had made when teaching in Cape Town, to produce the book\nMathematics for the Million.\nHe claimed it was \"to pass the time\" in hospital, but in fact there was a very serious social purpose behind what he wrote. He writes in the Preface:-\n... without a knowledge of mathematics, the grammar of science and order, we cannot plan the rational society in which there will be leisure for all and poverty for none.\nIt must be worth noting that Hogben's wife had a degree in mathematics so discussions with her may have helped develop the book.\nAt this time Hogben was keen to become a fellow of the\nRoyal Society\nand he felt that publishing\nMathematics for the Million\nwould damage his chances. He therefore offered it to Socialist Book Club to be published anonymously but they turned it down saying \"mathematics is a worst seller.\" Two years later, when talking to his American publisher, he was told that if someone could do for mathematics what H G Wells had done with his\nOutline of History\n, it would sell well. Hogben replied that he might have just something in one of his drawers that would fit the bill. When shown the typescript the publisher was keen and\nMathematics for the Million:\nA Popular Self-Educator\nwas published in\n1936\n. It was an instant best seller, loved by some experts, hated by others. See extracts from a selection of reviews at\nTHIS LINK\n.\nIt was in\n1936\nthat Hogben was elected to the\nRoyal Society of London\n, but he felt that he should have been elected sooner\n[\n144\n]\n:-\nHe was elected into the\nRoyal Society\nin\n1936\n, but he thought, as many of his friends did, that he should have got in sooner. He had begun to suspect that enemies were keeping him out. He had always taken the outward signs of academic success very seriously, and those who knew him well can remember his extreme misery, almost despair, when he heard that X or Y had been preferred, and he must wait for at least another year.\nThe success of\nMathematics for the Million\nencouraged Hogben to publish a similar work\nScience for the Citizen: A Self-Educator Based on the Social Background of Scientific Discovery\n(1938)\nbased on lectures he had been asked to deliver to Civil Service candidates. See extracts from a selection of reviews at\nTHIS LINK\n.\nIn\n1937\nhe moved again, this time to become Regius Professor of Natural History in the University of Aberdeen. Perhaps, given his experience in Edinburgh, he might have realised that he would find Aberdeen socially difficult and indeed he did. Royalties from\nMathematics for the Million\nallowed him to purchase a large house there in two acres of land. While in Aberdeen, he became interested in linguistics and would publish several books on this topic. In March\n1940\n, a few months into World War II, he went to Norway to lecture and also to bring his elder daughter, who had been living in Stockholm, back to Scotland. He met with his daughter, gave his last lecture in Oslo, and went to the airport to fly to Copenhagen when Germany invaded and bombed the airport. Soon German troops were on the streets and Hogben, with his daughter, persuaded a lorry driver to take them to the Swedish border. Their return to Scotland proved difficult. They spent two months in Sweden, during which time Hogben translated Swedish books into English, then they flew to Moscow, took the trans-Siberian railway to Vladivostok, continued to Japan, sailed from there to San Francisco, then took a train to New York. After one semester as a visiting professor at the University of Wisconsin, he had saved enough money to pay his fare back to Britain, and sailed to Liverpool arriving in February\n1941\n. He was only to remain in Aberdeen for a few more months, and later in\n1941\nhe was appointed as Mason Professor of Zoology at the University of Birmingham.\nD'Arcy Thompson\nwrote about Hogben in a letter, dated March\n1943\n, addressed to\nDorothy Wrinch\n[\n140\n]\n:-\nYou ask about Hogben. I believe he's going very strong indeed, and taking his place on the Council of the\nRoyal Society\nvery seriously. But I haven't seen him for ever so long. I never go to London these days. ... Hogben seemed to me to leave Aberdeen without the very least tinge of regret, a little to my surprise. He doesn't worry about that sort of sentimentality!\nHogben had been becoming increasingly ill for a couple of years and in December\n1942\nhe had an operation and spent two months in hospital. Soon after he came out of hospital, he was asked to go to London and undertake war work on the Army Medical Statistics in the War Office. It was the start of a new direction for Hogben who now, when he returned to Birmingham in\n1947\n, worked on medical statistics. You can read extracts from reviews of his statistics texts at\nTHIS LINK\n.\nIn\n1957\nHogben was divorced and, later in the same year, he married Sarah Jane Evans\n(1903\n-\n1974)\n. His first marriage had effectively ended in\n1953\n, the divorce being arranged so that he could marry again. Sarah had been previously married to Arthur Roberts. In\n1961\nHogben retired from Birmingham and was made an Honorary Senior Fellow in Linguistics. With incredible dedication, he continued to write on the broad range of subjects that fascinated him, always relating them to social issues. His last books included science books written for children. He did, however, have one further appointment, namely to British Guiana, to become Vice-Chancellor of the projected University of Guyana. The final decade of his life,\n1965\n-\n75\n, was spent in Wales where both he and his wife suffered from poor health. His wife died of cancer in April\n1974\nand, after a lonely final year, he died in August\n1975\n.\nLet us end by quoting George Philip Wells' description of his character\n[\n144\n]\n:-\nHe was small, lightly built, bright-eyed, intensely alive. His ceaseless activity is legendary, as is the range of his interests - much wider even than the range of his publications. He was, for example, a great quoter of the Bible. He was fascinated by theological disputation and could explain the doctrinal peculiarities of a dozen or so Christian sects. He was expert on the flora of Dartmoor and on the cynipid galls in his Devonshire garden. Most of the furniture in his various cottages was made by himself. He wrote two volumes of poetry. He played the recorder, reputedly with more persistence than skill. He walked and gardened, but had no inclination for organized sport or games.\n...\nIf he liked you he was wonderful company - witty, erudite, warmly and genuinely interested in people. But he was also shy and sensitive, and his friendships were often interrupted by quarrels. ... He could be a difficult colleague. He was incapable of concealing disapproval or personal dislike. He was ambitious; he would have liked, and at one time thought he was going to get, a knighthood. The belief that contemporary university education is all wrong was built into his humanist faith and this led him, not only to drastic revision of the educational structure of the Departments of which he was made the head, but also to putting forward recommendations, not always tactful and not always welcome, about how other areas of the University should be set in order. His plans were often frustrated and he could be unforgiving in defeat. Some saw in him at least a touch of paranoia ...\nLet us note that G P Wells, the author of\n[\n144\n]\n, was a leading zoologist and the son of H G Wells.",
  "math_areas": [
    "Statistics"
  ]
}