{
  "nome_completo": "Lars Valter Hörmander",
  "nome_curto": "Lars Hörmander",
  "ano_nascimento": "1931",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hormander/",
  "lugar_nascimento": "Mjällby, Blekinge, Sweden",
  "lugar_morte": "Lund, Sweden",
  "biografia": "Lars Hörmander\n's father Armand Per Hilding Jönsson\n(1893\n-\n1981)\nwas a school teacher in the small fishing village on the south coast of Sweden where Lars was born. Armand Jönsson had been born in Smedstorp, Kristianstad to parents Ola Jönsson and Hanna Nordqvist. Lars' mother was Alma Elisabeth Kristiansson\n(1899\n-\n1983)\nwho was born in Mjällby. Lars was the youngest of his parents five children; his siblings included Oskar, born\n1921\n, Olof, born\n1923\n, and Karin. Lars mother Alma was\n[\n4\n]\n:-\n... a bright farmer's daughter who recalled her few years in school as a highlight of her life. Together\n[\nLars's parents\n]\ncreated an atmosphere characterized by a strong thirst for knowledge and education, and all five children graduated quickly from secondary school and then continued with higher education.\nLars attended his first school in Mjällby, then made a daily train journey to attend a higher level school in a larger nearby town. For the next stage in his schooling he had to move to Lund where, from\n1946\n, he attended the\ngymnasium\nwhich, at that time, was called the Lund Private Elementary School but since\n1986\nhas been called Spyken. There he was able to devote much time to studying university level mathematics, encouraged by a teacher, Nils Erik Fremberg\n(1908\n-\n1952)\n, who was also a\ndocent\nat Lund University and had been a research student of\nMarcel Riesz\n. Fremberg taught Hörmander the material covered in the first semester of Lund University while he was at the gymnasium in Lund.\nIn\n1948\nHörmander graduated from the gymnasium and began his studies at the University of Lund. His original intention had been to study engineering, following in the footsteps of his oldest brother Oskar, but Fremberg had persuaded him that mathematics was the topic he should study. At university he was taught by\nMarcel Riesz\nwho lectured to him on classical function theory and harmonic analysis. Hörmander was awarded a bachelor's degree in the autumn of\n1949\nand a master's degree in the spring of\n1950\n. He began to undertake research supervised by\nMarcel Riesz\nand was awarded his licentiate degree in October\n1951\nwith a thesis\nApplications of Helly's theorem to estimates of Chebyshev typ\ne. Two months later, at the Christmas party, Hörmander met Viveka Sonesson who, two years later would become his wife.\nAfter\nMarcel Riesz\nretired in\n1952\nand went to the United States, Hörmander began working on the theory of partial differential equations. He had been well prepared to study this topic from\nRiesz\n's excellent lectures and he was also supported by the two new professors,\nLars Gårding\nand\nÅke Pleijel\nwho were both working on that topic. He delivered an impressive lecture in the summer of\n1953\nat the Scandinavian Congress of Mathematicians, which on this occasion was held in Lund.\nBefore completing his doctorate, Hörmander spent the year\n1953\n-\n54\ndoing military service but, since he was mainly undertaking defence research in Stockholm, he was able to continue reading mathematics during this time. Hörmander had married Viveka while he was on military service and their first child, a daughter Gisela, was born in October\n1954\n. When he returned to Lund in the autumn of\n1954\nhe lectured in\nLars Gårding\n's seminar which was held once a week. Hörmander was to give two lectures on\nBourbaki\nstyle general topology and one of the postgraduate students at Lund, Vidar Thomée, attended his first lecture. Thomée explains in\n[\n26\n]\nthat after Hörmander's first lecture he had understood very little of it and this got back to\nGårding\n. The problem was solved by\nGårding\nwho told Thomée that he would deliver the second lecture and Hörmander would teach him the necessary mathematics. Thomée writes in\n[\n26\n]\n:-\nOf course it was hard work for both of us, but the programme was implemented, and I think I learned something significant from the experience.\nViveka and Lars Hörmander's second daughter was Sofia\n(\nwho was born in\n1965)\nand she writes in\n[\n4\n]\nabout her father working on his doctoral thesis:-\nSince my mother had only been able to stay at home to take care of Gisela for the first few months, much of the dissertation was actually written with my sister in his\n(\npulled-out\n)\ndesk drawer\n(\nwhich was just the right size for the carriage insert\n)\n. He apparently didn't find this distracting, which was typical of my father - the only effect an interruption seemed to have on his work was the few minutes lost to the actual distraction, nothing more.\nHörmander's doctorate was completed in\n1955\nwhen he was examined on this thesis\nOn the theory of general partial differential operators\non\n22\nOctober of that year. His formal thesis advisor had been\nGårding\nbut in reality Hörmander had worked independently, finding his own problems and solving them. The thesis was published in\nActa Mathematica\nin\n1955\n. Hörmander writes\n[\n15\n]\n:-\nIt was to a large extent inspired by the thesis of\nBernard Malgrange\nwhich was announced in\n1954\n, combined with techniques developed for hyperbolic differential operators by\nJean Leray\nand\nLars Gårding\n.\nThe chair of the examining panel was\nGårding\nand the three student opponents were\nJacques-Louis Lions\n, Bent Fuglede and Nils Aslund.\nJacques-Louis Lions\nasked questions in French, Bent Fuglede spoke in Danish and Nils Aslund asked his first question in Hungarian! Hörmander was awarded a \"distinction\" for both the thesis and for his defence. On\n4\nNovember, Hörmander gave a lecture to prove his abilities for a lectureship. He lectured on \"The\nFourier\ntransform\" and was examined by Erik Larsson, a chemist who was assistant dean, and by\nÅke Pleijel\n.\nAfter the award of his doctorate, he applied for a professorship at the University of Stockholm. Before a decision was made on the professorship Hörmander left for a visit to the United States where he spent time at the universities of Chicago, Kansas and Minnesota. He also visited the Institute for Mathematical Sciences\n(\nnow the\nCourant\nInstitute\n)\nwhich was directed at that time by\nRichard Courant\n. Back in Sweden he took up the appointment of professor at Stockholm on\n1\nJanuary\n1957\nwhich had been offered to him while he was in the United States. He was only\n25\nyears of age when he took up the position but was\n26\nby the time he was officially installed. The University of Stockholm's student newspaper,\nGaudeamus\n, published an article headed \"\n26\n-year-old mathematics professor solemnly installed\". The text beneath a photograph of Lars and Viveka Hörmander reads: \"Sweden's youngest professor, mathematics genius Lars Hörmander, smiles indulgently to his sweet wife during the solemn installation ceremony in the Blue Hall.\"\nHe continued to spend time in the United States, particularly at Stanford University and the Institute for Advanced Study\n[\n18\n]\n:-\nHörmander spent the summers\n1960\n-\n61\nat Stanford University as an invited professor, and took advantage of this time to honour the offer of the 'Springer Grundlehren series' of publishing a book about partial differential equations.\nIn Stockholm he had to set up a research group in partial differential equations. In\n[\n4\n]\nJan Boman explains the situation:-\nSince there was no activity in partial differential equations at Stockholm University at this time, he had to start from the beginning and lecture on distribution theory,\nFourier\nanalysis, and\nfunctional analysis\n. In\n1961\n-\n62\nhe lectured on the material that was to become his\n1963\nbook, 'Linear Partial Differential Operators'. He quickly gathered a large group of students around him. Among them were Christer Kiselman and Vidar Thomée. One of us\n(\nJan Boman\n)\nhad the privilege to be a member of that group. Lars's lectures were wonderful, and there was excitement and enthusiasm around him. His vast knowledge, fast thinking, and overwhelming capacity for work inspired all of us, but also sometimes scared his students. The clattering from his typewriter, which was constantly heard through his door, is famous.\nHe lectured, supervised research students, wrote papers and worked on the book\nLinear Partial Differential Operators\nwhich was published in\n1963\n[\n18\n]\n:-\nThat book was a milestone in the study of PDE, and a large mathematical public discovered L Hörmander's exposition of recent progress in the area. In the first place, the role of Distribution Theory was emphasized as the perfect tool for linear PDE. Although the notion of weak solution for a PDE was already known to\nSergei Sobolev\nand to the Russian school in the thirties, it is indeed\nLaurent Schwartz\n's definition of distributions which created the best perspective, combining abstract aspects of functional analysis with\nFourier analysis\n. Lars Hörmander had been familiar for quite a long time with\nSchwartz\ntheory, but he had noticed that many mathematicians, including his mentor\nMarcel Riesz\n, were rather negative\n(\nto say the least\n)\nabout it. ... During his thesis work, Lars Hörmander managed to avoid explicit reference to\nSchwartz\ntheory, but in\n1963\n, it was a different story and he chose to present\nSchwartz\nDistribution Theory as the basic functional analytic framework of his book.\nFor extracts of reviews of\nLinear Partial Differential Operators\nsee\nTHIS LINK\n.\nOne of his Ph.D. students at this time was Christer Kiselman who writes in\n[\n17\n]\n:-\nEvery Monday to Friday at\n15\n:\n00\ntea and buns were served. It was usually the Registry clerk Anita Ahlbert, called by some the wife of Ahlbert, and by others Anita, who arranged it. A bell tolled and called everyone to the meeting. Such meetings were very important to create a working community when the institution was not too large. Lars was always present if he was not abroad. The discussions often touched on mathematics. Lars was always available for consultations. Students knocked on his door; he could answer everything at once. I never had trouble discussing mathematics with him. He was usually sitting and writing articles, or writing his book, the one that was published in\n1963\n. There was the clatter of his typewriter. He would also write lecture notes and handouts. ... When I left his room, he resumed the clatter of his typewriter after zero seconds.\n(\nPersonally, I would have needed at least a few seconds to find the place where I could continue.\n)\nIn August\n1962\nthe International Congress of Mathematicians was held in Stockholm and Hörmander, as well as being heavily involved in the organisation, received a\nFields\nMedal for his work on partial differential equations.\nLars Gårding\n, describing Hörmander's contributions that earned him the\nFields Medal\n, writes in\n[\n9\n]\nof early contributions by\nJacques Hadamard\nto linear differential operators which led to the first complete results by\nIvan Georgievich Petrovsky\n. He continues:-\n... in a lecture in\n1945\n[\nPetrovsky\n]\nexplicitly asked for a general theory of linear differential operators including those which do not appear in the mathematical models of physics. ... In his book on distributions\nLaurent Schwartz\n... stated a number of problems about differential operators. Since then a rather comprehensive theory has been worked out. Many people have contributed but the deepest and most significant results are due to Hörmander.\nYou can see some comments by Hormander on the work for which  he was awarded the medal at\nTHIS LINK\n.\nNicolas Lerner writes in\n[\n18\n]\nabout the work which led to the award of the\nFields\nMedal:-\nHis impressive work on Partial Differential Equations, in particular his characterization of hypoellipticity for constant coefficients and his geometrical explanation of the\nLewy\nnon-solvability phenomenon were certainly very strong arguments for awarding him the Medal. Also his new point of view on Partial Differential Equations, which combined functional analysis with 'a priori' inequalities, had led to very general results on large classes of equations, which had been out of reach in the early fifties.\nIn\n1963\nHörmander made an arrangement which allowed him to spend the academic teaching year in Stockholm while he spent spring and summer at the University of Stanford in the United States. However, he writes in\n[\n15\n]\n:-\nI had barely arrived at Stanford when I received an offer to come to the Institute for Advanced Study as a permanent member and professor. Although I had previously been determined not to leave Sweden, the opportunity to do research full time in a mathematically very active environment was hard to resist.\nHörmander spent from\n1964\nto\n1968\nat Princeton but felt the pressure of a full time research position so returned to Sweden to take up the chair of mathematics at the University of Lund in\n1968\n. However he returned for frequent visits to the United States, in particular to the Institute for Advanced Study and to Stanford.\nMichael Atiyah\nwrites in\n[\n4\n]\n:-\nI think the transition from Princeton to Lund was not easy for Lars. He was at home in the Swedish countryside and culture, but mathematically he was somewhat isolated, despite his fame and his international connections.\nIn\n[\n16\n]\nHörmander describes the direction of his research after the award of the\nFields\nMedal. In particular he describes how the main areas developed which are covered by his four volume text\nThe analysis of linear partial differential operators\nthe volumes of which appeared between\n1983\nand\n1985\n. This work updates his original book\nLinear Partial Differential Operators\n(1963)\nwhich contained the results which led to the award of his\nFields\nMedal. The\nAmerican Mathematical Society\nawarded Hörmander its Leroy P Steele Prize in\n2006\n:-\n... for his book \"The Analysis of Linear Partial Differential Operators\".\nThe citation reads:-\nIn the history of mathematics, one is hard-pressed to find any comparable 'expository' work that covers so much material, and with such depth and understanding of such a broad area of mathematics.\nTragedy struck the family in\n1978\nwhen Hörmander's eldest daughter Gisela took her own life. She was twenty-three years of age.\nHörmander describes in\n[\n15\n]\nthe later stages of his career:-\nAfter five years devoted to writing a four volume monograph on linear partial differential operators, I spent the academic years\n1984\n-\n86\nas director of the\nMittag-Leffler\nInstitute in Stockholm. I had only accepted a two year appointment with leave of absence from Lund since I suspected that the many administrative duties there would not agree very well with me. The hunch was right, and since\n1986\nI have been in Lund where I became professor emeritus in January\n1996\n.\nHörmander's text,\nAn Introduction to Complex Analysis in Several Variables\n, has become a classic dealing with the theory of functions of several complex variables. It developed from lecture notes of a course which he gave in Stanford in\n1964\nand published in book form two years later. Extra material was added to later expanded editions of the work which appeared in\n1973\nand in\n1990\n. In\n1994\nhe published the book\nNotions of Convexity\n. You can read extracts from reviews of these books at\nTHIS LINK\n.\nIn\n[\n3\n]\nJan Boman spoke about Hörmander's approach to mathematics:-\nI learned a lot about Lars' approach to correctness in mathematics. First, that he had an unusual ability to avoid making mistakes, both large and small. Second, he was extremely critical of mathematics that was not entirely accurate.\nAs noted above, on\n1\nJanuary\n1996\nHörmander retired and was made professor emeritus by the University of Lund.\nWe should say a little about Hörmander's personality. His daughter Sofia, writing in\n[\n4\n]\n, paints an excellent picture of family life in the Hörmander household:-\nI adored my father as a child, and we spent countless hours together building with Legos, doing jigsaw puzzles, playing backgammon and Scrabble\n(\nfor the latter my mother would also join\n)\n, or doing carpentry. My father loved to work with his hands, especially with wood, having contemplated a future as a carpenter as a child. Among other things he built a Barbie dollhouse for me with four rooms, each fitted with electricity and completely furnished - my sister also helping with some of the smaller details, like textiles or earthenware. And I loved the weeks before Christmas when he would spend long hours in the basement crafting presents for me - it was frustrating that I couldn't join, but at the same time exciting. One year I was deeply intrigued by screeching sounds coming from the basement. It turned out that he had built the kitchen for the doll house, complete with refrigerator, stove, sink, cupboards, drawers, even a broom closet, and that the strange sounds came from sanding down four coins to make them into stove plates. I was very fortunate that my father always had a lot of spare time, so much so that my mother used to complain that she couldn't keep up with him, and this was even more so in the summers when he would take long periods away from work. On the island of Askerön off the west coast of Sweden my parents had bought a summer house by the sea, and there we spent much time outdoors together. Either in the forest - a highlight was an osprey nest that we would visit every day for years - or on the sea - my father loved sailing. When I was very young we had a SeaCat, which, to my great chagrin, was later traded in for a much smaller boat for day trips only. We also fished for plaice, with nets, together with a friend and his children. When not actively engaged with the family or the house, my father would spend his spare time reading. He always read a lot, fiction as well as fact, mostly history or science. He had a very inquisitive mind and loved to learn new things up until the last days of his life. In all this he was much aided by his excellent memory; he seemed unable to forget anything he had learned and, unfortunately, unable to realize that other people did not have quite his powers of memory ... he could be quite impatient with me. And I had to be careful when asking him a question: there was always the risk of a long and enthusiastic lecture, containing a lot more information than I wanted. ... Before his death my father often said to me that he was content with his life, that it had been a good life. I do believe he died a happy man.\nWe have mentioned above a number of awards that Hörmander received. There is one other major award that we must mention, namely the Wolf Prize which was awarded to Hörmander in\n1988\n. He was elected to the\nNational Academy of Sciences\nin\n1976\nand he served as a vice president of the\nInternational Mathematics Union\nfrom\n1987\nto\n1990\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}