{
  "nome_completo": "Laurent Moise Schwartz",
  "nome_curto": "Laurent Schwartz",
  "ano_nascimento": "1915",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwartz/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Laurent Schwartz\ncame from a Jewish background. His father Anselme Schwartz\n(1872\n-\n1957)\nwas born in Balbronn, near Westhoffen, in Alsace shortly after the Franco-Prussian War of\n1870\n-\n71\nwhich resulted in Alsace being annexed by Germany. He was French and did not like the idea of living in Germany so, at the age of fourteen he left his home town and went to Paris where he became a surgeon. He married his first cousin, Claire Debré\n(1888\n-\n1972)\n, the daughter of a rabbi, in\n1907\n. Although Anselme was brought up in the Jewish faith, he became an atheist and brought his children up as atheists. Their family contained many brilliant people such as Claire's brother, Professor Robert Debré\n(1882\n-\n1978)\n, the founder of Unicef, and Robert Debré's son Michel Debré\n(1912\n-\n1996)\n, who became a highly successful politician being Prime Minister of France in\n1959\n-\n62\n. There was also leading mathematicians in the extended family;\nJacques Hadamard\nwas married to a sister of Claire Debré's mother. Laurent was the oldest of his parents three sons, having brothers Daniel\n(\nborn\n1917)\nand Bertrand\n(\nborn\n1919)\n.\nWhen he was eleven years old, Laurent contracted polio. Although he recovered in a few months, the disease left him rather weak for the whole of his life. In September\n1926\n, when he was still in the recovery phase of polio, his parents bought a country house at Autouillet. It was a large house with magnificent gardens surrounded by meadows and fields in which the children could play. When Laurent was young, the family would spend every weekend at Autouillet but lived in Paris during the week. At the lycée he attended in Paris, Schwartz excelled at both mathematics and the classical languages of Greek and Latin. He was faced with a difficult choice, particularly after he was placed first in the national 'concours général' in Latin, and fourth in translating. He had to make a choice between spending his final school years studying philosophy and humanities to prepare for university studies in the classics or taking mathematics and philosophy. His mother, who had always played an important role in encouraging her son to study, asked her brother Robert Debré for advice. His medical expertise was in the care of children and he gave his professional opinion that Schwartz should study mathematics. This, together with the same opinions from his teachers at the lycée, led Schwartz to decide that he would drop Latin, study both mathematics and philosophy and take the baccalaureate in both subjects. In his final years at the lycée Janson de Sailly he took courses in mathematics and philosophy. He fell in love with geometry, taught by an inspiring teacher, but was disappointed by the philosophy course where the teaching was much less good. Also at the lycée Janson de Sailly he fell in love with Marie-Hélène Levy, who was in the class above him. Marie-Hélène was the daughter of\nPaul Lévy\n.\nSchwartz entered the École Normale Supérieure in Paris in\n1934\nwhere he was taught by some of the leading mathematicians in the world. He became engaged to Marie-Hélène, who also studied mathematics, in\n1935\n. Being friendly with her father,\nPaul Lévy\n, was an important mathematical influence on the young man.\nLévy\n, whose principle interests were in probability theory and\nfunctional analysis\n, gave the young man a love of these topics which would become his main research interests throughout his life. University is often a time for students to become involved in politics and, indeed, Schwartz was active with left-wing beliefs. His political activities at this time are described in\n[\n1\n]\n:-\nThe intellectual ferment of these years was paralleled by political engagement. Though from a traditionally right-wing background, he was a strong supporter of Leon Blum's Popular Front Government until he became disillusioned by its failure to support the Spanish Republicans. Similarly, his sympathies for communism were soon dampened by Stalin's show trials, though he then spent ten years as a Trotskyite, up to\n1947\n. He claimed never to regret this, even though it almost prevented him travelling to America to receive the\nFields Medal\n.\nHe graduated, after an outstanding undergraduate career, with the\nAgrégation de Mathématiques\nin\n1937\n. At this stage he decided that he would do his compulsory military service rather than delay it. He was assigned to the D.C.A.\n(\nDéfense Contre Aéronefs - Defense Against Aircraft\n)\nbut, being physically weak and lacking dexterity, he found that he was unable to perform tasks such as dismantling and assembling machine guns. He was posted first to Ballancourt, then to Biscarrosse, and although he had to extend his military service because of World War II, he never saw combat and was demobbed in August\n1940\n. During this time, in\n1938\n, he had married Marie-Hélène. In fact they had planned to marry in December\n1935\nbut Marie-Hélène contracted a pulmonary tubercular infection and was sent to a sanatorium at Passy, Haut Savoie. The forced separation of eighteen months, during which time they could only correspond by letter, had been extremely difficult for both of them. After Schwartz left military service in\n1940\nhe went with his wife to Toulouse where his parents had moved following the German invasion and the fall of France.\nWhile in Toulouse, he met\nHenri Cartan\nwhen he visited there to conduct an oral on behalf of the École Normale Supérieure. In fact Marie-Hélène also took the opportunity to talk to Henri Cartan since she wanted to resume her mathematical studies.\nCartan\nadvised him to study for a doctorate at Clermont-Ferrand which is where the University of Strasbourg moved after the German armies invaded France at the start of World War II. Schwartz became a member of the Caisse National des Sciences\n(\nwhich later became the CNRS\n)\nwhich supported him until the end of\n1942\n. After this support ended, he received funds from the ARS\n(\nAid à la Recherche Scientifique\n)\n, which supported him to the end of the war. Schwartz received mathematical advice from\nGeorges Valiron\nwho was based in Paris. He had known\nValiron\nsince attending his course\nFunctions of a complex variable\nwhile he was an undergraduate.\nSchwartz's thesis\nÉtude des sommes d'exponentielles\nⓉ\n(\nStudy of sums of exponentials\n)\n, submitted to the University of Strasbourg in\n1943\n, contains the following acknowledgement as to the help that\nValiron\nhad given:-\nI want to especially thank\nGeorges Valiron\nwho not only gave me much advice, but also, through the correspondence he kindly entered into with me, helped me to overcome many difficulties.\nValiron\nwas an examiner of the thesis, as was\nCharles Ehresmann\nand Andre Roussel. Schwartz also wrote in his thesis:-\nI would also like to express my gratitude to\nJacques Hadamard\nand\nPaul Lévy\nwho have guided and enriched my mathematical development.\nDuring the war his political activities, Trotskyist beliefs and Jewish background put him in all manner of delicate situations. He adopted a false identity, calling himself Laurent-Marie Sélimartin, and only by a combination of skill and good luck did he escape detection. However, his weak physical condition meant that he was unable to assist the Resistance movement. He had been a staunch supporter of the Trotskyist party since his days as a student at the École Normale Supérieure but his feelings began to change during the war\n[\n4\n]\n:-\nTrotskyism gave me, during my years at the ENS, a remarkable education, clearly more advanced and sophisticated than that of most youngsters of my age. But by the extremism and sectarianism of its ideas, and by its stereotyped language, it neutralised me during the occupation. My judgment remains extremely severe on my own actions as well as those of the majority of the Trotskyist party during that period.\nIn March\n1943\nthe Schwartz's son Marc-André was born; this only increased their danger. Marc-André went on to become a writer and poet but had a tragic life - see below. Schwartz spent the academic year\n1944\n-\n45\nlecturing at the Faculty of Science at Grenoble before moving to Nancy where, on the recommendation of\nJean Delsarte\nand\nJean Dieudonné\n, he became a professor in the Faculty of Science. It was during this period of his career that he produced his famous work on the theory of distributions. We described this idea in more details below but, at this point, we quote Schwartz's own description of coming up with the idea in\n1944\n[\n4\n]\n:-\nIn my youth I used to have insomnias lasting several hours and never took sleeping pills. I remained in my bed, the light off and without writing, did mathematics. My inventive energy was redoubled and I advanced rapidly without tiring. I felt entirely free, without any of the brakes imposed by my daily life and writing. After some hours ... especially if an unexpected difficulty came up ... I would stop and sleep until morning. I would be tired but happy for the whole of the following day. ... On this particular night I felt sure of myself and filled with a sense of exaltation. I lost no time in rushing to explain everything to\nHenri Cartan\nwho ... lived next door. He was enthusiastic: \"There you are. You've just resolved all the difficulties of differentiation. Now we'll never again have functions without derivatives\".\nHe also continued to be politically active, standing in the French elections of\n1945\nas a Trotskyist and, after failing to be elected, he again stood\n(\nalso unsuccessfully\n)\nin\n1946\nwhen in Nancy. During his time in Nancy, he taught a remarkable collection of students, including\nBernard Malgrange\n,\nJacques-Louis Lions\n,\nFrançois Bruhat\n, and\nAlexander Grothendieck\n. Also during these years he became an international star in the mathematical world, lecturing, at the invitation of\nHarald Bohr\n, in Copenhagen in October\n1947\nand was one of four main speakers at the First Canadian Mathematical Congress in Vancouver in\n1949\n. The Schwartz's daughter, Claudine, was born in\n1947\n; she became a mathematician and is the author of\n[\n42\n]\n.\n(\nClaudine married the mathematician Raoul Robert in\n1971\n.\n)\nIn\n1953\nSchwartz's wife, Marie-Hélène Schwartz, was awarded a doctorate by the University of Paris for her thesis\nFormules apparentées à celles de Gauss-Bonnet et Nevanlinna-Ahlfors pour certaines applications d'une variété à n dimensions dans une autre\nⓉ\n(\nFormulas related to those of  Gauss-Bonnet-Nevanlinna and Ahlfors for certain maps of an n-dimensional manifold to another\n)\n.\nValiron\nwas an examiner of her thesis as he had been for her husband's ten years earlier.\nIn\n1953\nSchwartz returned to Paris where he became professor, holding this position until\n1959\n. He taught at the École Polytechnique in Paris from\n1959\nto\n1980\n. He then spent three years at the University of Paris VII before he retired in\n1983\n. We say a little below about his remarkable mathematical contributions but before we look at these we recount some of the political activity he took part in during his career in Paris.\nIn\n1956\nhe was one of the leaders of protests in France against the Russian invasion of Hungary. Then in the following year he became involved in an event much closer to him personally, the \"\nAudin\nAffair\" in Algeria\n[\n1\n]\n:-\nAudin\n, a mathematician and communist based in Algiers, was writing his thesis under Schwartz's supervision. But in June\n1957\nthe\n25\n-year-old father of three and opponent of French rule in Algeria was abducted by paratroopers, tortured and killed. Schwartz was tireless in his calls for justice, and organised a presentation of the young man's thesis in his absence.\nVocal in his opposition to the French campaign, he signed the famous \"Declaration des\n121\n\" in favour of military insubordination. The riposte of Pierre Messmer, the Minister for the French Army\n(\nand, by the same token, of the École\n)\n, was to strip him of his position at the Polytechnique, for reasons of \"common sense and honour\". To which Schwartz replied that since the Army commanded by Messmer had sanctioned torture and promoted torturers, such remarks were absurd.\nAfter a brief exile in New York, he regained his post two years later ...\nThe outstanding contribution to mathematics which Schwartz made in the late\n1940\ns was his work in the theory of distributions. Above, we gave his own description of the night he came up with the idea. The first publication in which he presented these ideas was\nGénéralisation de la notion de fonction, de dérivation, de transformation de Fourier et applications mathématiques et physiques\nⓉ\n(\nGeneralization of the notion of function, derivative, Fourier transform and mathematical and physical applications\n)\nwhich appeared in\n1948\n. The theory of distributions is a considerable broadening of the differential and integral calculus.\nHeaviside\nand\nDirac\nhad generalised the calculus with specific applications in mind. These, and other similar methods of formal calculation, were not, however, built on an abstract and rigorous mathematical foundation. Schwartz's development of the theory of distributions put methods of this type onto a sound basis, and greatly extended their range of application, providing powerful tools for applications in numerous areas.\nThe lectures he gave in Vancouver in\n1949\nbecame the basis for Schwartz's two-volume treatise\nThéorie des distributions\n(1950\n,\n1951)\n.\nIrving Segal\nwrites in a review:-\nThis is a generally clear, carefully organized, and detailed account of the basic aspects of the theory of \"distributions'' due to the author, and described by him in earlier publications ... This theory provides a convenient formalism for many common situations in theoretical and applied analysis, but its greatest significance may be in connection with\npartial differential equations\n, particularly those of hyperbolic type, where its adaptability to local problems gives it an advantage over\nHilbert space\n(\nand other primarily global\n)\ntechniques.\nIn the article on 'Analysis' in\nEncyclopaedia Britannica\nFrançois Treves describes Schwartz's work as follows:-\n... Schwartz's idea\n(\nin\n1947)\nwas to give a unified interpretation of all the generalized functions that had infiltrated analysis as\n(\ncontinuous\n)\nlinear functionals on the space Cç of infinitely differentiable functions vanishing outside compact sets. He provided a systematic and rigorous description, entirely based on abstract functional analysis and on duality. It is noteworthy that such an approach had a precedent, in the presentation by\nAndré Weil\nof the integration of locally compact\ngroups\n... Because of the demands of differentiability in distribution theory, the spaces of test-functions and their duals are somewhat more complicated. This has led to extensive studies of topological vector spaces beyond the familiar categories of\nHilbert\nand\nBanach\nspaces, studies that, in turn, have provided useful new insights in some areas of analysis proper, such as partial differential equations or functions of several complex variables. Schwartz's ideas can be applied to many other spaces of test-functions beside Cç, as he himself and others have shown ...\nHarald Bohr\npresented a\nFields\nMedal to Schwartz at the International Congress of Mathematicians in Harvard on\n30\nAugust\n1950\nfor his work on the theory of distributions.\nHarald Bohr\n[\n7\n]\ndescribed Schwartz's\n1948\npaper as one:-\n... which certainly will stand as one of the classical mathematical papers of our times. ... I think every reader of his cited paper, like myself, will have left a considerable amount of pleasant excitement, on seeing the wonderful harmony of the whole structure of the calculus to which the theory leads and on understanding how essential an advance its application may mean to many parts of higher analysis, such as\nspectral theory\n,\npotential theory\n, and indeed the whole theory of linear partial differential equations ...\nSchwartz has received a long list of prizes, medals and honours in addition to the Fields Medal. He received prizes from the\nParis Academy of Sciences\nin\n1955\n,\n1964\nand\n1972\n. In\n1972\nhe was elected a member of the Academy. He has been awarded honorary doctorates from many universities including Humboldt\n(1960)\n, Brussels\n(1962)\n, Lund\n(1981)\n, Tel-Aviv\n(1981)\n, Montreal\n(1985)\nand Athens\n(1993)\n.\nLater work by Schwartz on stochastic differential calculus is described by him in the survey article\n[\n45\n]\n, see also\n[\n44\n]\n. Later political campaigns include those against American involvement in Vietnam, the Soviet invasion of Afghanistan, and the Russian war against Chechnya. His political activities led, however, to a family tragedy\n[\n21\n]\n:-\nHis son Marc-André committed suicide in\n1971\n, the result of the life-long trauma following his kidnapping at the hands of French nationalists seeking revenge on his father for his commitment to anti-colonialism and support of the Algerians seeking independence.\nWith such involvement in mathematics and politics one might imagine that Schwartz would not have had time for a major hobby. This however would be entirely wrong for he was an avid collector of butterflies, with over\n20\n,\n000\nspecimens.\nAmong several other books which Schwartz has written, we mention\nMéthodes mathématiques pour les sciences physiques\nⓉ\n(\nMathematical methods for the physical sciences\n)\n(1961)\n. It was reviewed by\nGeorge Temple\nwho wrote\n[\n48\n]\n:-\nThose who have been privileged to see the notes of the lectures which Professor Schwartz delivered in British Columbia a few years ago will know that he is a master of clear, precise exposition which can be readily adapted to the needs of mathematical physicists. The title of this volume has clearly been chosen with some care, to indicate that it treats of mathematical methods involved in modern mathematical physics, and that it is not necessarily an introductory text-book for the mathematical physicist. The book does give, in fact, a splendid introduction to a number of basic topics in mathematical physics, treated with a degree of rigour and abstraction which may well surprise the physics student at British universities. ... The whole book is written in a concise and lucid style which we have learnt to associate with the name of Professor Schwartz.\nLet us end by giving two quotes from Schwartz; the first on politics and the second on mathematics:-\nI have always thought that morality in politics was something essential, just like feelings and affinities.\nTo discover something in mathematics is to overcome an inhibition and a tradition. You cannot move forward if you are not subversive.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Statistics",
    "Topology"
  ]
}