{
  "nome_completo": "Lennart Axel Edvard Carleson",
  "nome_curto": "Lennart Carleson",
  "ano_nascimento": "1928",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carleson/",
  "lugar_nascimento": "Stockholm, Sweden",
  "lugar_morte": null,
  "biografia": "Lennart Carleson\ncompleted his secondary schooling in Karlstad, Sweden, graduating in\n1945\n. He then entered Uppsala University, obtaining his first degree\n(\nFil. kand.\n)\nin\n1947\n, and his Master's Degree\n(\nFil. lic.\n)\nin\n1949\n. Carleson's research thesis was supervised by\nArne Beurling\nand he was awarded his doctorate in\n1950\nfor\nOn a Class of\nMeromorphic Functions\nand Its Exceptional Sets\n. He spoke of his supervisor in\n1984\n[\n1\n]\n:-\nIt was my great fortune to have been introduced to mathematics by\nArne Beurling\n; the tradition he,\nT Carleman\nand\nMarcel Riesz\ninitiated is very obviously responsible for the good standard of mathematics in our country. Personally I am very happy for this opportunity to express to\nArne Beurling\nmy gratitude for having guided me into a fruitful area of mathematics and for having given an example that only hard problems count.\nFollowing the award of his doctorate he was appointed as a lecturer in mathematics at Uppsala University.\nCarleson spent session\n1950\n-\n51\nin the United States, undertaking post-doctoral work at Harvard University. There he was greatly influenced by\nA Zygmund\nand\nR Salem\nwho were both at Harvard that year and, as we explain below, it was\nZygmund\n's influence which set him on the path to proving his most famous result. Carleson returned to Sweden, taking up his lectureship at Uppsala University at the beginning of session\n1951\n-\n52\n. In\n1954\nhe was appointed to a professorship at the University of Stockholm but he returned to Uppsala in the following year, holding a chair of mathematics there until\n1993\n. During this time he made a number of research visits to the United States, being a visiting research scientist at MIT during the autumn of\n1957\n, spending session\n1961\n-\n62\nat the Institute for Advanced Studies, Princeton, being a guest professor at Stanford University in session\n1965\n-\n66\n, and holding a similar position at MIT during\n1974\n-\n75\n.\nAmong many important roles which Carleson has occupied, we should mention three in particular. First his very significant role as Director of the\nMittag-Leffler\nInstitute, Stockholm, from\n1968\nto\n1984\n, during which time he built the Institute from a small base into one of the leading mathematical research institutes in the world. His other highly significant roles were that of editor of\nActa Mathematica\nfrom\n1956\nto\n1979\n, and as President of the\nInternational Mathematical Union\nfrom\n1978\nto\n1982\n. In this last mentioned position, he worked tirelessly to have the People's Republic of China represented on the Union and was the main driving force behind the creation of the\nNevanlinna\nPrize honoring the contributions of computer science to mathematics by rewarding young theoretical computer scientists.\nCarleson's mathematical contributions have been far too many, and much too deep, to be described in any detail in a biography of this type. However we will try to give some idea of the importance of his contributions. We begin with a quote from Marcus du Sautoy who writes:-\nThe mark of a great mathematician is someone who not only cracks a big open problem that has defeated previous generations of mathematicians but who then goes on to create tools for future generations. During his career as a mathematician Carleson has been influential in several major areas of analysis and dynamical systems over nearly half a century of mathematical activity. Carleson's mathematics is characterized by a deep geometric insight combined with an amazing control of the branching complexities of the proofs. His contributions have provided future generations with tools to carry out a systematic study of analysis and\ndynamical systems\n.\nA major problem solved by Carleson in\n1962\nwas the famous 'corona problem' in the paper\nInterpolations by bounded analytic functions and the corona problem\n. As so often in his work, not only did he solve the problem but in doing so he introduced what are today called 'Carleson measures' which went on to become a fundamental tool in complex analysis and harmonic analysis. In\n1967\nHörmander\nintroduced some ideas to simplify Carleson's proof and Carleson lectured on\nThe corona theorem\nto the Fifteenth Scandinavian Congress in Oslo in\n1968\n. The conference Proceedings contains a complete proof by Carleson:-\nIn the paper ... a complete proof is given incorporating\nHörmander\n's ideas. Moreover, the presentation is quite clear, so that the proof, while remaining non trivial, is now reasonably easy to read.\nIn\n1966\nCarleson solved one of the outstanding problems of mathematics in his paper\nOn convergence and growth of partial sums of Fourier series\n.\nFourier\n, in\n1807\n, had claimed that every function equals the sum of its\nFourier series\n. Of course\nFourier\nwas thinking about 'well-behaved' functions so his initial claim has to be modified somewhat. A major research area throughout the\n19\nth\ncentury concerned the convergence of\nFourier series\n, and continuous functions whose\nFourier\nseries diverges at a dense set of points were constructed by\ndu Bois-Reymond\n.  In\n1913\nLuzin\nconjectured that if a function\nf\nf\nf\nis square\nLebesgue\nintegrable then the\nFourier\nseries of\nf\nf\nf\nconverges pointwise to\nf\nf\nf\nalmost everywhere.\nKolmogorov\nproved results in\n1928\nwhich seemed to suggest that\nLuzin\n's conjecture must be false but Carleson amazed the world of mathematics when he proved\nLuzin\n's long-standing conjecture in\n1966\n. He explained in\n[\n4\n]\nhow he was led to prove the theorem:-\n... the problem of course presents itself already when you are a student and I was thinking about the problem on and off, but the situation was more interesting than that. The great authority in those days was\nZygmund\nand he was completely convinced that what one should produce was not a proof but a counter-example. When I was a young student in the United States, I met\nZygmund\nand I had an idea how to produce some very complicated functions for a counter-example and\nZygmund\nencouraged me very much to do so. I was thinking about it for about\n15\nyears on and off, on how to make these counter-examples work and the interesting thing that happened was that I realised why there should be a counter-example and how you should produce it. I thought I really understood what was the background and then to my amazement I could prove that this \"correct\" counter-example couldn't exist and I suddenly realised that what you should try to do was the opposite, you should try to prove what was not fashionable, namely to prove convergence. The most important aspect in solving a mathematical problem is the conviction of what is the true result. Then it took\n2\nor\n3\nyears using the techniques that had been developed during the past\n20\nyears or so.\nCarleson lectured on his spectacular result at the International Congress of Mathematicians at Moscow in\n1966\nwhen he gave the address\nConvergence and summability of\nFourier\nseries\n. He began his address with the words:-\nI do not intend to give in this lecture any survey of the very large field covered by the title. I rather want to present my personal interests which are concentrated on the almost everywhere behaviour of the partial sums. Also the subject of summability will only be touched upon.\nIn\n1967\nhe published the book\nSelected problems on exceptional sets\nwhich\nAhlfors\ndescribes as follows:-\nThe author announces that he had originally prepared a survey of the theory of small sets in\n1959\n. At that time several books covering parts of the subject were published, and he found that a survey was less desirable. In\n1961\nhe collected those parts that seemed to contain new or less known aspects, methods of proof or results. Some later results were added, and the author states that the selection reflects his own personal tastes. Readers will agree that he has successfully eliminated the dull parts. A substantial portion of the results are original and once again bear witness to the author's extraordinary technical skill.\nCarleson received the Wolf Prize\n1992\ntogether with\nJohn G Thompson\n. The authors of\n[\n6\n]\nwrite:-\nThe citation emphasizes not only Carleson's fundamental scientific contributions, the best known of which perhaps are the proof of\nLuzin\n's conjecture on the convergence of\nFourier\nseries, the solutions of the corona problem and the interpolation problem for bounded analytic functions, the solution of the extension problem for quasiconformal mappings in higher dimensions, and the proof of the existence of 'strange attractors' in the Hénon family of planar maps, but also his outstanding role as scientific leader and advisor.\nIn\n2006\nCarleson received his greatest honour when he received the\nAbel\nPrize:-\n... for his profound and seminal contributions to harmonic analysis and the theory of smooth dynamical systems.\nThe citation by the\nAbel\nCommittee states:-\nCarleson is always far ahead of the crowd. He concentrates on only the most difficult and deep problems. Once these are solved, he lets others invade the kingdom he has discovered, and he moves on to even wilder and more remote domains of Science. ...\nCarleson's work has forever altered our view of analysis. Not only did he prove extremely hard theorems, but the methods he introduced to prove them have turned out to be as important as the theorems themselves. His unique style is characterized by geometric insight combined with amazing control of the branching complexities of the proofs\n.\nOn\n23\nMay\n2006\nhe received the Prize from Queen Sonja. He said in reply:-\nCarl Friedrich\nGauss\nonce described mathematics at the queen of science, and for a servant of this queen like me to stand here in these beautiful surroundings and receive the grand\nAbel\nPrize from a real queen is really an overwhelming event in my life.\nPeter W Jones in\n[\n5\n]\ngives this summary:-\nCarleson's influence extends far beyond his research, a fact well known to the broad mathematical community. Besides his papers Carleson has published an influential book on potential theory 'Selected problems in the theory of exceptional sets' and helped make accessible the unpublished work of\nArne Beurling\n(\ni.e., as co-editor with P Malliavin, J Neuberger, and J Wermer of 'The collected works of Arne Beurling'\n2\nVols\n1989)\n... But Carleson's influence extends far beyond his publications. He has trained many PhD students, and many more mathematicians who came from around the world to learn from him. As director of the\nMittag-Leffler\nInstitute, he not only developed a world-class research centre, but moulded an entire generation of analysts. His research in analysis is a series of towering and fundamental discoveries. His friends know well his generosity, encouragement and selfless giving of himself.\nCarleson has received a host of honours for his truly outstanding contributions. Many learned societies around the world have been eager to elect him to membership. These are the\nRoyal Swedish Academy of Sciences\n, the\nAmerican Academy of Arts and Sciences\n, the\nRussian Academy of Sciences\n, the\nRoyal Society, London\n, the\nFrench Academy of Sciences\n, the\nRoyal Danish Academy of Sciences and Letters\n, the\nNorwegian Academy of Science and Letters\n, the\nRoyal Norwegian Society of Science and Letters\n, the\nFinnish Academy of Science and Letters\n, and the\nHungarian Academy of Sciences\n. He had also won numerous prizes, some of which we have mentioned above. These are the Leroy Steel Prize from the\nAmerican Mathematical Society\n(1984)\n, the Wolf Prize\n(1992)\n, the Lomonosov Gold Medal from the\nRussian Academy of Sciences\n(2002)\n, the\nSylvester\nMedal from the\nRoyal Society\n, London\n(2003)\n, and the\nAbel\nPrize\n(2006)\n. He has been awarded honorary doctorates by the University of Helsinki\n(1982)\n, the University of Paris\n(1988)\n, and the Royal Institute of Technology, Stockholm\n(1989)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}