{
  "nome_completo": "Lenore Carol Blum",
  "nome_curto": "Lenore Blum",
  "ano_nascimento": "1942",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Blum/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": null,
  "biografia": "We should make it clear from the beginning of this biography of\nLenore Blum\nthat Blum is her married name which she only took after marrying Manuel Blum, who was also a mathematician. However, to avoid confusion we shall refer to her as Blum throughout this article. Lenore's parents were Irving and Rose Epstein and, in addition to a sister Harriet who was two years younger than Lenore, she was part of an extended Jewish family with several aunts and uncles. Her mother Rose was a high school science teacher in New York. Lenore attended a public school in New York City until she was nine years old when her family moved to South America.\nHer father Irving was in the import/expert business and he and his wife set up home in Venezuela for Lenore and Harriet. For her first year in Caracas Lenore did not attend school but was taught by her mother. Basically the family were too poor to be able to afford the school fees. After a year Rose took a teaching post in the American School Escuela Campo Alegre in Caracas and this provided sufficient money to allow Lenore to attend junior school and then high school in Caracas. While in Caracas, she met Manuel Blum, who was also from a Jewish family. He left Caracas while Lenore was still at school there and went to the United States where he studied at the Massachusetts Institute of Technology.\nReturning to the United States, Lenore applied to the Massachusetts Institute of Technology both because it was an excellent place for her to study and also since Manuel was there, but she was not accepted. At this stage she was not set on taking a degree in mathematics but had other interests so she enrolled in the Department of Architecture at Carnegie Institute of Technology in Pittsburgh. It was during her first year of study, which she began in\n1959\n, that the mathematics courses she was studying made her realise that she should change her course to specialise in that topic. For her second year at the Carnegie Institute of Technology she took mainly mathematics courses but still studied courses on sculpture and design. She did take a course on experimental computing which would prove important for her future interests.\nAfter two years at the Carnegie Institute in Pittsburgh, Blum transferred in\n1961\nto Simmons College in Boston to study mathematics. The main reason for the move was that she had married Manuel and of course they wanted to be together. It was not an entirely satisfactory move for her from the academic point of view, however, since the mathematics course at Simmons did not stretch her as she would have wished. She had made a number of unsuccessful applications to the Massachusetts Institute of Technology but at last she made a successful one and began to study there while completing her first degree at Simmons College. She was awarded her B.S. from Simmons in\n1963\nand continued working towards her doctorate at MIT. While studying at MIT her son Avrim was born.\nIn\n1968\nshe was awarded a Ph.D. for a thesis\nGeneralized Algebraic Structures: A Model Theoretical Approach\n. She was offered an appointment as a postdoctoral student, Lecturer in Mathematics, and research associate at the University of California at Berkeley and she remained there for two years. In\n1973\nshe was employed by Mills College to teach an algebra course, but finding the course unsatisfactory she began to develop new educational ideas. In\n1974\nshe founded the Mathematics and Computer Science Department at Mills College and served as its Head or co-Head until\n1987\n. During this time, in\n1979\n, she became the first holder of the Letts-Villard Chair at Mills College.\nOver many years Blum has championed increased participation of women and girls in mathematics and has been actively engaged in promoting this cause through different organisations. In\n1975\nshe became President of the\nAssociation for Women in Mathematics\n, an organisation she which had helped to found. Also in\n1975\nshe became co-director of the Math/Science Network which organised \"Expanding Your Horizons\" conferences for girls attending high school.\nIn addition to these organisations, Blum is also a member of the\nAmerican Mathematical Society\n, serving on its Council and she also as Vice President of the Society in\n1990\n-\n1992\n. She represented the Society at the Pan African Congress of Mathematicians in Nairobi in the summer of\n1991\nand after this continued to work at building links between African and American mathematicians. Elected a Fellow of the American Association for the Advancement of Science in\n1979\n, she served as Chair of the Mathematics Section in\n1998\n-\n1999\n.\nWe should now discuss Blum's impressive contributions to research. After her thesis, perhaps her next important piece of work was\nTowards a Mathematical Theory of Inductive Inference, Information and Control\nwhich she published jointly with her husband Manuel Blum. The paper studies the mathematical model of inductive inference introduced by E M Gold in\n1967\n. An inductive inference machine produces, from any enumeration of a partial function, a certain output sequence of numbers. After defining when such a machine is reliable on a set of partial functions they characterize the sets of functions that can be identified by machines which are reliable on all partial functions.\nBlum's next important paper was\nDifferentially closed fields: a model-theoretic tour\nwhich appeared in\n1977\nand, for the first time, made accessible some results she had found ten years earlier and included in her thesis. The\n1980\ns, however, saw Blum make a major decision to devote herself exclusively to research. A National Science Foundation award in\n1983\nallowed her to begin a most fruitful collaboration with Mike Shub. She was Visiting Professor at the City University of New York Graduate Center for a while and later she was a Visiting Scientist at the IBM TJ Watson Research Center. Then, in\n1988\n, she became a member of the Theory Group of the International Computer Science Institute in Berkeley. After this Blum served as Deputy Director of the Mathematical Sciences Research Institute in Berkeley from\n1992\nto\n1997\n.\nBeginning in the late\n1980\ns and continuing throughout the\n1990\ns Blum, with several co-authors, has developed new directions in the theory of computation and complexity. An important first contribution was Blum's\n1989\npaper\nLectures on a theory of computation and complexity over the reals\n(\nor an arbitrary ring\n)\nwhich extended the theories of computation and computational complexity from the standard discrete situation to study how these ideas can be developed in continuous domains such as the real number system. Working with\nSmale\n, she answered a question in\n1990\nwhich had been posed by Roger\nPenrose\n. They proved that the\nMandelbrot\nset is undecidable, a question which\nTuring\ntheory does not allow one to even formulate. In the same year Blum was invited to address the International Congress of Mathematicians in Kyoto, Japan, on these new theories.\nThe first textbook on this important new area was\nComplexity and Real Computation\npublished in\n1998\njointly by Blum, Steve\nSmale\n, Mike Shub, and Felipe Cucker. In this book they argue that classical complexity theory, based on the\nTuring\nmodel, is inadequate for studying many problems and algorithms in modern scientific computing; the book then develops a complexity theory which can be applied to these areas. To illustrate this new approach let us quote from the Introduction:-\nThe classical theory of computation had its origin in the work of logicians - of\nGödel\n,\nTuring\n, ... , among others - in the\n1930\ns. The model of computation developed in the following decades, the\nTuring\nmachine, has been extraordinarily successful in giving the foundations and framework for theoretical computer science.\nThe point of view of this book is that the\nTuring\nmodel\n(\nwe call it \"classical\"\n)\nwith its dependence on\n0\n's and\n1\n's, is fundamentally inadequate for giving such a foundation for modern scientific computation, where most of the algorithms - with origins in\nNewton\n,\nEuler\n,\nGauss\n, et al. - are real number algorithms.\nKlaus Meer, reviewing the book, writes:-\nThe book is very well written. Each topic is developed from its very beginning and therefore the book is already perfect to use on a graduate level. Nevertheless most of the results presented define the current state of the art and, thus, this monograph is a must for anyone interested in the field. Especially striking is the interplay of various mathematical disciplines such as\nalgebraic number theory\n,\nalgebraic geometry\n, logic, and numerical analysis, to mention a few. This shows in a very convincing manner the many different aspects of the current approach.\nBlum spent the academic years\n1996\n-\n98\nas Visiting Professor of Mathematics and Computer Science at the City University of Hong Kong. As well as continuing to develop her important ideas in research, Blum helped to undertake a revamping of the mathematics courses. While in Hong Kong she gave an interview in which she explained the current direction of her research. Although to some extent it repeats what we have written above, it is a non-technical description which is well worth quoting:-\nTheoretical computer science is very well developed but the kinds of problems that it deals with are what we call discrete problems - problems that have to with graphs or counting. There's a whole other kind of computation which has to do with more continuous problems. ... Calculus uses real numbers rather than counting numbers because it's measuring things in the real world. The theory of computer science deals with counting numbers but not real numbers.\nWe've developed a parallel theory ... of computation that deals with the real, physical world. Continuity is the mathematics of calculus and physics but there's never been a theory of computation that deals with this continuum. That's what we've developed.\nIn\n1999\nBlum was appointed Distinguished Career Professor of Computer Science at Carnegie Mellon University.\nShe is also co-director of ALADDIN, the Center for ALgorithm ADaptation Dissemination and INtegration, which aims to improve the process of incorporating powerful algorithms into application domains.\nOn\n16\nMay\n2005\nPresident George W Bush announced that Blum was one of the recipients of the\n2004\nPresidential Award for Excellence in Science, Mathematics and Engineering Mentoring. The citation reads:-\nLenore Blum of Carnegie Mellon University helped pioneer the Expanding Your Horizons program at Mills College in\n1973\n. The program - designed to introduce young female students to women in science and related careers - has since gone national through the Math/Science Network. Blum's leadership has also been instrumental in transforming the culture of computing at Carnegie Mellon to embrace diversity as critical for the field and future of our nation and by creating a model mentorship organization, Women@SCS, for women students in computer science.\nIn fact in June\n1999\n, on the\n25\nth\nanniversary of the founding the Department of Mathematics and Computer Science at Mills College, the College had awarded her an honorary Doctor of Laws.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Number Theory"
  ]
}