{
  "nome_completo": "Leo Königsberger",
  "nome_curto": "Leo Königsberger",
  "ano_nascimento": "1837",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Konigsberger/",
  "lugar_nascimento": "Posen, Prussia (now Poznań, Poland)",
  "lugar_morte": "Heidelberg, Germany",
  "biografia": "Leo Königsberger\ncame from a rich Jewish family, his father Jakob Löb Königsberger\n(1800\n-\n1882)\nbeing a wealthy merchant. Jakob had intended to study medicine but on the death of his own father, Leo's paternal grandfather, he had to take over a major manufacturing business to support his mother and siblings. Leo's mother Henriette Kantorowicz\n(1810\n-\n1895)\nhad poor health but devoted herself to the education of her children. Leo was the oldest of his parents twelve children, four of whom died at a young age. It was in the family's beautiful and spacious house in the market square of Poznań that Leo grew up.\nAfter attending primary school where he learnt to read, write, and do arithmetic, Leo entered the Friedrich-Wilhelms\nGymnasium\nin Poznań. There he was taught elementary mathematics and science by a teacher named Brüllow whose lessons were both rigorous and interesting. However, the political situation resulting from attempts to divide the Province of Poznań between Germany and Prussia at this time, led to high tensions between the German and Polish schools, disrupting the pupils' education. Fighting between the German Gymnasium students, to which Königsberger belonged, and those of the Polish Mary's Gymnasium were almost daily events. The Revolution of March\n1848\nsaw Königsberger's father take him away from the school as troops entered the middle of the town. A bombardment of the town from the fortress began and Jakob Königsberger decided to take his family away to live with an uncle until the situation had improved. In the days before they left for Berlin by train, shots were fired from the fortress every night. The frightened women and children sat in the living room of the Königsberger home while the men, armed with revolvers and axes, guarded the door to the house. After two weeks in Berlin, the family returned to Poznań to find that the situation had become much calmer.\nLazarus Fuchs\narrived in Poznań at Easter\n1853\nand lived for a year in the Königsberger home. Leo learnt a great deal from\nFuchs\n, who acted as a tutor to him during this year, so that by the time\nFuchs\nleft at Easter\n1854\nto begin his studies at the University of Berlin, Königsberger's education was transformed. Before that he had struggled at school but, after\nFuchs\n's tuition, he had learnt how to study mathematics independently from books so that he was able to study topics not covered by his school. They had spent the evenings reading books on differential calculus and analytical geometry, working at a table in a small sitting room which they shared.\nFuchs\nhad also given Königsberger a love for mathematics, so from this time on he knew that it was the subject he wanted to study. He graduated from the Gymnasium and entered the University of Berlin at Easter in\n1857\n.\nWhen Königsberger arrived at the University of Berlin, his friend and former tutor\nFuchs\nwas still an undergraduate there. The two shared a large variety of different homes in Berlin, for even after\nFuchs\ngraduated in\n1858\nhe continued to live in Berlin and teach mathematics there. In his first semester at the university, which was in the year\n1857\n, Königsberger was taught by\nKarl Weierstrass\nwho had been appointed to the University of Berlin in the previous year. In fact Königsberger had been so well prepared for university study that he attended\nWeierstrass\n's lectures on the theory of elliptic functions\n(\nwhich was\nWeierstrass\n's main research topic\n)\nand by the end of the course he was one of only four or five students who remained including\nFuchs\n. Many years later, in\n1917\n, he published his account of these lectures. This was the first course that\nWeierstrass\ngave on elliptic functions and Königsberger's publication was of considerable historical importance. Königsberger also attended lectures by\nEduard Kummer\n, who had been appointed to Berlin two years before Königsberger began his undergraduate studies. Among\nKummer\n's courses that he attended were higher number theory, the theory of surfaces, mechanics, and analytical geometry. Königsberger notes in\n[\n2\n]\nthat\nKummer\nattached:-\n... more importance to the elementary parts of these disciplines, but with unmatched clarity to his listeners ...\nKönigsberger was given a research topic by\nWeierstrass\n. He submitted his doctoral thesis\nDe motu puncti versus duo fixa centra attracti\nand was given an oral examination on\n22\nMay\n1860\n. In addition, he was given a mathematics examination by\nMartin Ohm\nand\nEduard Kummer\n, a physics examination by Heinrich Gustav Magnus, and a philosophy examination by Friedrich Adolf Trendelenburg. After graduating with a doctorate from the University of Berlin with 'distinction', he qualified as a gymnasium teacher and spent the three years from Easter\n1861\nto Easter\n1864\nteaching mathematics and physics to the Berlin Cadet Corps. He writes\n[\n2\n]\n:-\nAs I had to give four or five lessons to the Cadet Corps every day, as well as carefully prepare the physics experiments, and in addition I was forced to give private lessons, so it was mainly in the evening and night hours that I carried out my mathematical researches.\nIn\n1864\nhe obtained his first academic appointment as an extraordinary professor at the University of Greifswald, recommended for the position by Weierstrass. Although the salary he was offered was low, he did not hesitate to accept for the honour of receiving such an appointment. However, his long standing friendship with\nFuchs\nmade him sad to think that the two would now be separated. Five years later he was appointed to a chair of mathematics at Heidelberg. On leaving Greifswald, the students presented him with a beautifully bound edition of the first four volumes of\nGauss\n's works to show their appreciation. While a professor in Heidelberg he had married Sophie Beral-Kappel\n(1848\n-\n1923)\non\n13\nAugust\n1873\nin Baden-Baden with Bunsen and\nKirchhoff\nas witnesses; they had two children one son Johann and one daughter Ani. Johann Georg Königsberger\n(1874\n-\n1946)\nwent on to become professor of physics at the University of Freiburg, being mainly interested in electrical, optical and thermal properties of minerals.\nIn April\n1875\nLeo Königsberger left Heidelberg and moved to the Technische Hochschule in Dresden. This was not a move he really wanted to make so when he received the offer his first thought was to reject it. However, he felt that he had a duty to his wife to improve his situation so, with great sadness at leaving his friends and colleagues Bunsen and\nKirchhoff\n, he accepted. He moved into a nicely situated house in fine surroundings and was settled in by the time lectures were due to start\n[\n2\n]\n:-\nMy lectures on differential and integral calculus, mechanics, etc. were held in new magnificent rooms with many students attending. I had time for extensive scientific work, including completion of the second part of my work on\nelliptical functions\n.\nAfter two years in Dresden, Königsberger moved again, this time to the University of Vienna at Easter\n1877\n. He returned to Heidelberg in\n1884\n. After accepting the position in Heidelberg he travelled with his wife and two children to visit his mother, and then to visit his sister who was married and living in Russia. After these visits they spent two weeks holiday in the Crimea, relaxing in the beautiful seaside resort of Yalta.\nFrom\n1884\nhe taught in Heidelberg until he retired in\n1914\n. So from an academic career spanning\n50\nyears, despite the many moves, Königsberger spent\n36\nof these years at the University of Heidelberg. Returning to Heidelberg in\n1884\nwas not easy after being away for seven years for during this time much had changed. The University of Heidelberg celebrated the\n500\nth\nanniversary of its foundation in\n1886\n. This was a particularly happy time for Königsberger who was joined by\nHermite\n,\nFuchs\n,\nHelmholtz\n, Bunsen, Roscoe,\nBrioschi\nand other friends from the world of mathematics and science. In the summer of\n1889\nthere was a scientific meeting in Heidelberg at which Königsberger met\nHeinrich Hertz\nfor the first time.\nHertz\nhad, shortly before, announced his famous discoveries which were causing great excitement in the scientific community. Königsberger entertained\nHertz\n,\nHelmholtz\n, Kundt, Paalzow, Wiedemann and others to lunch in his home. This was also the year that he had a new house built in the Kaiserstrasse specifically designed to meet his wishes. He lived in this home for the rest of his life.\nAt Heidelberg, Königsberger was supported by some other excellent teachers. In particular the mathematical historian\nMoritz Cantor\nworked there for most of his career, beginning in\n1853\n, while\nGeorg Landsberg\n, whom Königsberger described as an \"inspiring teacher,\" taught at Heidelberg between\n1893\nand\n1904\n.\nBurau sums up Königsberger's contributions in\n[\n1\n]\n:-\nKönigsberger was one of the most famous mathematicians of his time, member of many academies, and universally accepted. He contributed to many fields of mathematics, most notably to analysis and analytic mechanics.\nHis early work was heavily influenced by his teacher\nWeierstrass\n's lectures on elliptic functions, for this was the topic of much of his early research. He wrote an important text on elliptic functions\nVorlesungen über elliptische Funktionen\nⓉ\n(\nLectures on elliptic functions\n)\nin\n1874\nand another important textbook on hyperelliptic integrals\nVorlesungen über die Theorie der hyperelliptischen Integrale\nⓉ\n(\nLectures on the theory of hyperelliptic integrals\n)\nfour years later. Much of Königsberger's work on differential equations was influenced by the function theory developed by his friend\nFuchs\n. His work on differential equations was, however, also influenced by the applications which interested Bunsen,\nKirchhoff\nand\nHelmholtz\n, with whom he was close friends in Heidelberg. His approach to the differential equations of analytic mechanics showed novelty\n[\n1\n]\n:-\nKönigsberger was the first to treat not merely one differential equation, but an entire system of such equations in complex variables.\nOn this topic he published\nLehrbuch der Theorie der Differentialgleichungen mit einer unabhängigen Veränderlichen\nⓉ\n(\nTextbook of the theory of differential equations with an independent variable\n)\nin\n1889\n. Königsberger writes\n[\n2\n]\n:-\nIn\n1889\nI published 'Lehrbuch der Theorie der Differentialgleichungen', which is a coherent presentation of my previous work extending that of\nWeierstrass\n,\nFuchs\nand\nPoincaré\n. ... My further work led me now more and more into analytical mechanics, and I published in mathematical journals and in the proceedings of various academies a greater number of articles dealing with the extension of the principles of mechanics and potential theory ...\nKönigsberger is also famed for his two volume biography of\nHelmholtz\n(1902)\nand his biographical Festschrift for\nJacobi\n(1904)\n.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}