{
  "nome_completo": "Leonard Jimmie Savage",
  "nome_curto": "Leonard Jimmie Savage",
  "ano_nascimento": "1917",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Savage/",
  "lugar_nascimento": "Detroit, Michigan, USA",
  "lugar_morte": "New Haven, Connecticut, USA",
  "biografia": "Leonard Jimmie Savage\n's parents, Louis Ogashevitz and Mae Rugawitz, were Jewish; Jimmie was the first of their four children. The first question that the reader will naturally ask, therefore, is why Jimmie Savage is named Savage. In fact the reason he was called 'Jimmie Savage' is even more complicated. Louis Ogashevitz, who was in the real estate business, was born in Detroit in\n1897\nto parents who had emigrated to the United States from Russia. After Jimmie was born, his mother, who had a high school education and was a trained nurse, was seriously ill and, as a consequence, there was a delay in giving him a name. A nurse at the hospital where he was born put the name \"Jimmie\" against his entry in the hospital records but when his mother recovered he was given the name Leonard Ogashevitz. However, the name 'Jimmie' stuck and he was known as Jimmie as he was growing up. In\n1920\nhis father changed his name from Ogashevitz to Savage but this name change did not apply to his children. Many years later, when Jimmie was undertaking classified war work, he had his name legally changed from Leonard Ogashevitz to Leonard Jimmie Savage. Although known as Jimmie all his life, he wrote his papers under the name Leonard Savage.\nAllen Wallis writes in\n[\n12\n]\nabout Jimmie's father:-\nHis father, Louis, was the most significant figure in Savage's life. His respect and love for his father had extraordinary depth and devotion. Except for Louis's unwavering devotion and support ... Jimmie would not have had as productive a life nor as happy a one.\nJimmie had a difficult time growing up. In part this was due to poor eyesight, caused by nystagmus\n(\ninvoluntary eye movement\n)\nand extreme myopia, which meant that he had only very limited vision. But there was another problem which was a direct consequence of his parent's fear that their children might be kidnapped - a real possibility in Detroit at this time. Jimmie was confined to his home\n(\nwhich was protected by a surrounding wall\n)\nand educated by a governess but this caused much stress and arguments between Jimmie and his two sisters Joan\n(\nborn\n1921)\nand Barbara\n(\nborn\n1922)\n. His parents tried to improve matters by sending Jimmie to boarding school but he later described the year spent there as one of the worst in his life. He then attended Central High School, Detroit, but his teachers were unimpressed with him and would not recommend him for university studies. Richard, Jimmie's brother born in\n1925\nwho also became a well-known statistician, said in a\n1999\ninterview\n[\n10\n]\n:-\nCentral High was a very academic-oriented public high school with mostly Jewish students. Both Jimmie and Joan had rather unpleasant experiences there.\nRichard also explained why Jimmie had so much trouble at school\n[\n10\n]\n:-\nJimmie was truly a polymath from a very young age. He was a brilliant child, but he paid no attention to what was going on in school because he couldn't see what was going on in school. The teachers thought he was more or less feebleminded.\nJimmie's father Louis did everything he could to get his son an education and persuaded one of his friends to recommend Jimmie to Wayne University in Detroit. He studied engineering for a year at Wayne and did well enough that he was allowed to enter the University of Michigan, Ann Arbor, to study chemical engineering.\nAt the University of Michigan things again went badly for Savage who, because of his poor eyesight, caused a fire in the chemistry laboratory. He was expelled but again his father intervened and Jimmie was allowed to take some mathematics courses with the aim of majoring in physics. His grades began to improve: C in analytic geometry; B in calculus; B in differential equations; A in\nRaymond Wilder\n's foundations of mathematics; and A in\nRaymond Wilder\n's point set topology course. Inspired by\nWilder\nhe received all A grades from that point on and changed to major in mathematics. He received his BS from the University of Michigan in\n1938\n. In that year he married Jane Kretschmer; they had two sons, Sam Linton and Frank Albert. Their eldest son, Sam Linton Savage, received his Ph.D. in computer science from Yale University in\n1973\n. He has worked in the Management Science Department at Chicago and at Stanford. He is the author of\nThe Flaw of Averages: Why we underestimate risk in the face of uncertainty\nand\nDecision making with insight\n.\nIn\n1941\nSavage received his PhD with a thesis was on metric and\ndifferential geometry\n. Writing in\n1950\nhe described his doctoral thesis\nThe Application of Vectorial Methods to the Study of Distance Spaces\nas follows\n(\nsee\n[\n12\n]\n)\n:-\nMy dissertation for the Ph.D. degree at the University of Michigan was on applications of vectorial methods to metric geometry\n(\nin the sense of the Menger school\n)\n, especially with a view to the merging of metric geometry in that sense with differential geometry. Professor S B Myers at the University of Michigan sponsored my dissertation, but I was particularly close to\nR L Wilder\nthere.\nHe spent session\n1941\n-\n42\nat the Institute for Advanced Study at Princeton as a Rackham fellow, and there he continued to work on pure mathematics. While at the Institute he solved an open problem in the calculus of variations suggested to him in discussions with\nJohn von Neumann\nand\nMarston Morse\n. He published this result in\nOn the crossing of extemals at focal points\n(1943)\n. He was then appointed as an Instructor in Mathematics at Cornell University where he spent the academic year\n1942\n-\n43\n, following which he spent a year at Brown University as a Research Mathematician in the classical mechanics group as part of his contribution to the war effort. In\n1944\n, still undertaking war work, he joined the Statistical Research Group at Columbia University as a Research Associate - this move into statistics was suggested by\nvon Neumann\nwho had recognised Savage's talents when he was at Princeton.\nFollowing the end of World War II in\n1945\n, Savage spent a year working with\nRichard Courant\nat the Institute of Applied Mathematics at New York University and then he was awarded a Rockefeller Fellowship to spend time at the Institute of Radiobiology and Biophysics at the University of Chicago. He went to Chicago in the autumn of\n1946\nand began one of the most productive periods of his life being appointed as a Research Associate at Chicago in\n1947\n. He published a joint paper with the economist Milton Friedman\nThe Utility Analysis of Choices Involving Risk\nin\n1948\nin the\nJournal of Political Economy\nand, in the following year, a joint paper with\nPaul Halmos\nApplication of the Radon-Nikodym theorem to the theory of sufficient statistics\n. Remaining at Chicago, Savage was one of the founders of the Statistics Department there in\n1949\n. An interesting snapshot of Savage at this time can be had from a reference written to support his application for a Guggenheim Foundation Fellowship in\n1950\n(\nsee\n[\n2\n]\n)\n:-\nDr Savage is brilliant and scholarly, has broad and varied interests, and knows a number of fields rather deeply. He is in addition a remarkable personality, vitally stimulated and interested by, and stimulating and interesting to, others. His basic training is in pure mathematics, but fundamentally he is equally interested in empirical science, whether physical, biological, or social. Statistics, in which he began to work about\n1944\n, has provided a suitable meeting ground for his formal-abstract and his empirical-inductive interests. At least two of the several contributions he has already made to statistics are of major importance, and have stimulated a flow of papers by others. In addition, he has published significant papers in economics, biology, and medicine. It is quite possible, though obviously too early to predict, that he will become one of the great figures of his generation in the field of statistics.\nHe was awarded the Guggenheim Foundation Fellowship and, in addition, was a Fulbright grantee allowing him to spend the academic year\n1951\n-\n52\nin Paris and in Cambridge, England. In\n1954\nSavage was promoted to professor at Chicago and he served as Chairman of the Statistics Department from\n1956\nto\n1959\n.\nSavage wrote on the foundations of statistics which led him into deep philosophical questions both about statistics and knowledge in general. The other main direction of his work was to study gambling as a source to stimulate problems in\nprobability\nand decision theory. Savage's book\nThe Foundations of Statistics\n(1954)\nis perhaps his greatest achievement. It shows\nvon Neumann\n's influence and also that of\nRamsey\n. The book starts with six axioms, which are both motivated and discussed, and from these are deduced the existence of a subjective 'personal' probability and a utility function. A special case of a utility function had been introduced by\nvon Neumann\nand\nMorgenstern\nin their theory of games.\nThe Foundations of Statistics\nsets out Savage's ideas on Bayesian statistics and, in particular, explains his theory of subjective and personal probability. These important ideas did, however, lead to difficult relations with his colleagues.\nWilliam Kruskal\n, one of these Chicago colleagues, wrote\n[\n11\n]\n:-\nIn his development of personal probability, Savage moved more and more to a proselytizing position. Personal probability was not only useful and interesting to study; it became for him the only sensible approach to probability and statistics. Thus, orthodoxy of neoradicalism developed: if one were not in substantial agreement with him, one was inimical, or stupid, or at the least inattentive to an important scientific development. This attitude, no doubt sharpened by personal difficulties and by the mordant rhetoric of some anti-Bayesians, exacerbated relationships between Jimmie Savage and many old professional friends. The problem had a special poignancy for those who, like myself, took an eclectic point of view.\nSavage left Chicago in\n1960\nand took up a professorship at the University of Michigan. Chicago had tried hard to keep him and, in a letter he wrote before leaving Chicago, he expressed his appreciation for the Chicago Department\n(\nsee\n[\n12\n]\n)\n:-\nFor a person who wants to do original, realistic, and critical work in statistics there is no atmosphere anywhere in the world today to compare with this Department.\nHe remained at Michigan for four years before moving to Yale University where he was named Eugene Higgins Professor of Statistics. An important work by Savage, published in\n1965\nafter he took up the chair at Yale, is\nHow to gamble if you must : Inequalities for stochastic processes\n, written jointly with Lester Dubins. They describe their motivation in the Introduction:-\nImagine yourself at a casino with $\n1\n,\n000\n. For some reason, you desperately need $\n10\n,\n000\nby morning; anything less is worth nothing for your purpose. What ought you to do? ... As is well known, any policy of compounding bets that are subfair to you must decrease your expected wealth. Consequently, no matter how you play, your chance of converting $\n1\n,\n000\ninto $\n10\n,\n000\nwill be less than\n1\n10\n\\large\\frac{1}{10}\\normalsize\n1\n0\n1\n​\n. How close to\n1\n10\n\\large\\frac{1}{10}\\normalsize\n1\n0\n1\n​\ncan you make it and by what strategy?\nOther articles written by Savage relate to statistical inference, in particular the Bayesian approach. He introduced Bayesian hypothesis tests and Bayesian estimation. His Bayesian approach, however, opposed the views of\nFisher\nand\nNeyman\n. In his later years he wrote on the philosophy of statistics.\nJimmie Savage was divorced in\n1964\nand, on\n10\nJuly of that year, he married Jean Strickland. Sadly, Savage only had seven years at Yale before he died at the early age of fifty-three. However, these were good years\n[\n12\n]\n:-\nYale proved much to his liking, especially the close association with Frank Anscombe, whom he had held in high personal and professional regard from the time they first met and to whom, in fact, Savage had enthusiastically offered a professorship at Chicago. The agreeable professional circumstances during the seven Yale years, and above all his great happiness with Jean, combined to make the last period of Savage's life personally the happiest.\nHe was president of the Institute of Mathematical Statistics\n(1957\n-\n58)\n, invited to give the\nFisher\nlecture\nOn rereading R A Fisher\nin\n1970\n, and due to give the\n1972\nWald\nlectures at the time of his death. In\n1963\nhe was awarded an doctorate by the University of Rochester. His early death, however, prevented him receiving many honours which would almost certainly have been given to him. He has been honoured with the establishment in\n1977\nof the Savage Award made each year to two outstanding doctoral dissertations in Bayesian econometrics and statistics. The\nAmerican Statistical Association\nand the Institute of Mathematical Statistics decided to sponsor the publication of a memorial volume\n[\n2\n]\nfor Savage which was published in\n1981\n. Also in his honour was\nStudies in Bayesian econometrics and statistics\npublished as\nContributions to Economic Analysis\nNo\n86\n(1975)\n.\nFinally, let us quote Milton Friedman writing in\n1964\n(\nsee\n[\n2\n]\n)\n:-\nJimmie is one of the few really creative people I have met in the course of my intellectual life. He has an original, independent mind capable of throwing new light on whatever problems he looks at. He also has a wide-ranging curiosity. In whatever fields he turns his mind to, he gets new insights, ideas, and approaches. ... Here is one of those extraordinary people of whom there are only a handful in any university at any time.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}