{
  "nome_completo": "Leon Mirsky",
  "nome_curto": "Leon Mirsky",
  "ano_nascimento": "1918",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mirsky/",
  "lugar_nascimento": null,
  "lugar_morte": "Sheffield, England",
  "biografia": "Leon Mirsky\nwas usually known as Leon but his full name was Leonid. His father was a medical doctor while his mother was a dentist. Conditions in Russia were difficult at the time Leon was born for the Russian Revolution had begun in\n1917\n. The Revolution marked the start of a Civil War which took place over the years\n1918\n-\n1921\n. After\n1921\nthe New Economic Policy chose not to enforce total socialism, which the leaders wanted, but moved strongly towards state control of major industries. Mirsky's parents wanted to leave Russia but were unable to do so. However they were able to send Leon to Germany when he was\n8\nyears old to live with an uncle and aunt. This move, Leon's parents hoped, would give Leon a chance of a better life than Soviet Russia presented. Leon's uncle was in the wool trade and the family were comfortably off. Leon spent five years in Germany where his education was of high quality since his family were passionately education minded. However, the Germany to which young Leon had entered in\n1926\nwas suddenly dramatically changed in\n1933\nwhen Hitler and the Nazi party came to power. Leon's uncle and aunt decided quickly to move to England where they set up home in Bradford.\nHerne Bay College, at Eddington south east of Herne Bay in Kent, was run by Captain Eustace Turner and it specialised in engineering, having one of the best equipped engineering workshops in England during the\n1930\ns. The school had a high reputation for successes in engineering examinations. The school, from which Mirsky graduated in\n1936\n, was taken over by the military for the war effort in\n1939\nand never reopened as a school. Leaving Herne Bay College, at age seventeen, Mirsky entered King's College, London, where he had to study four subjects in his first year for the Intermediate Science Examination. Three of these subjects were Pure Mathematics, Applied Mathematics, and Physics. Mirsky had already discovered at Herne Bay College that laboratory work was not his strong point so he was quite proud to cope with the laboratory work in the Physics course. His performance in the Intermediate Science Examination was outstanding and, as a consequence, he was awarded a scholarship to study the Course for the B.Sc. Special Degree in Mathematics. This degree was designed as a three-year course.\nOne of the friends that Mirsky made at King's College, London, was\nGeoffrey Kneebone\nwho was one year ahead of him. Mirsky and\nKneebone\nshared interests in philosophy, literature and history as well, of course, as mathematics. They shared their interest in exploring these topics throughout the rest of Mirsky's life. Another friend he made at King's College was Ron Clark who introduced Mirsky to rock climbing and the two shared this interest in the vacations when they went youth hostelling. Another fellow student with Mirsky was Peter Gant who later taught mathematics at Felsted School. Gant described Mirsky in his student days as having\n[\n3\n]\n:-\n... formal dress, complete with rolled umbrella, which went well with his remarkable erudition but contrasted delightfully with his lively sense of fun.\nDuring this time he took a passionate interest in the theory of numbers and became a great admirer of\nEdmund Landau\n. He read widely on his own and he kept a record of the parts of the theory that pleased him by filling up a whole series of notebooks.\nOn\n1\nSeptember\n1939\nGerman armies invaded Poland and, following the British Prime Minister Chamberlain's ultimatum to Hitler, which was ignored, Britain declared war on Germany on\n3\nSeptember. In August\n1939\n, Russia and Germany had signed a secret pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. Soviet troops invaded Poland on\n17\nSeptember and by\n29\nSeptember Poland was partitioned between Russia and Germany. Mirsky was now in a very unhappy situation of being educated in England having been born in Russia and brought up for five years in Germany.\nHe graduated from King's College, London, in\n1940\nwith a First Class Honours B.Sc. Special Degree in Mathematics. However the war meant that students from King's College were sent to Bristol University and it was there that he began to study for a Master's Degree. It may appear surprising that a student with such an outstanding undergraduate record did not immediately register for a Ph.D. but, feeling awkward as an alien in war-time Britain, he wanted to complete his studies and start a career as quickly as he could. He was lucky that with the move to Bristol, he now came in contact with\nHubert Linfoot\n.\nLinfoot\nhad spend the academic year\n1928\n-\n29\nat Göttingen in Germany attending lectures by\nEdmund Landau\non\nWaring\n's problem and on Schlicht functions.\nLinfoot\nhad taken notes of high quality of all courses he attended. He already spoke German fluently before his Göttingen visit, and after spending the year in Germany he was often mistaken for being German. In fact the courses\nLinfoot\nattended in Göttingen were delivered in German but written up by him in English. By the time Mirsky arrived in Bristol,\nLinfoot\nhad begun to undertake research in optics which he did for patriotic reasons when war started. However he was still an excellent advisor for Mirsky who was keen to write his Master's thesis on number theory. He completed his Master's degree in a year and was awarded the degree with distinction.\nIn\n1942\nhe was appointed as a temporary assistant lecturer at Sheffield University where\nPercy John Daniell\nwas Town Trust Professor of Mathematics and the Head of Department. This was a difficult period with professors involved in war work and having relatively few students to teach due to the war. In fact\nDaniell\n, despite deteriorating health, worked for the Ministry of Supply. One important consequence of his period at Sheffield was the friendship that Mirsky formed with\nRichard Rado\n[\n3\n]\n:-\n[\nRado\n]\nand his wife Luise took Leon under their wing: they provided him with the affectionate home atmosphere that he craved as a newcomer to a strange city, and they enormously influenced his intellectual development as well. Leon greatly admired Richard's power as a mathematician and often paid glowing tribute to the benefit he derived from the association ... Luise Rado encouraged Leon's literary interests, particularly by reading English and German poetry with him. Jointly with Richard she opened the world of music to him and he became especially fond of the\n19\nth century German songs which Luise used to sing to him.\nAfter completing the two year temporary position, Mirsky went to the University of Manchester where he had again a temporary assistant lectureship. After one year in Manchester, he was offered an assistant lectureship\n(\nthis time not a temporary one\n)\nback at Sheffield and he took up this position in\n1945\n. This meant that he was again a colleague of\nRado\nbut this only lasted two years since, in\n1947\n,\nRado\nmoved to King's College, London. In the same year of\n1947\nMirsky was promoted to lecturer at Sheffield. We noted before that Mirsky had not undertaken research for a Ph.D. but once on the permanent staff at Sheffield he set his sights on earning a doctorate. Being a staff member, this was not a standard route to a Ph.D. and Mirsky worked on his own without the benefit of a thesis advisor. He began publishing many short papers on number theory:\nOn the number of representations of an integer as the sum of three r-free integers\n(1947)\n;\nNote on an asymptotic formula connected with r-free integers\n(1947)\n;\nOn coprime values taken by given polynomials\n(1948)\n;\nThe additive properties of integers of a certain class\n(1948)\n;\nOn a theorem in the additive theory of numbers due to Evelyn and Linfoot\n(1948)\n;\nOn a problem in the theory of numbers\n(1948)\n;\nNote on a theorem of Carlitz\n(1948)\n;\nA remark on D H Lehmer's solution of the Tarry-Escott problem\n(1948)\n;\nArithmetical pattern problems relating to divisibility by rth powers\n(1949)\n;\nThe number of representations of an integer as the sum of a prime and a k-free integer\n(1949)\n;\nA property of square-free integers\n(1949)\n;\nGeneralizations of a problem of Pillai\n(1949)\n;\nSummation formulae involving arithmetic functions\n(1949)\n;\nA theorem on representations of integers in the scale of r\n(1949)\n;\nOn the distribution of integers having a prescribed number of divisors\n(1949)\n, and\nOn the frequency of pairs of square-free numbers with a given difference\n(1949)\n. We see that he had at least\n15\npapers published in the three years\n1947\n-\n49\n. He was awarded a Ph.D. in\n1949\nby Sheffield University.\nIn\n1953\nMirsky married Aileen Guilding who was, at that time, a lecturer in Biblical History and Literature at Sheffield but later became a professor and Head of Department. Aileen and Leon Mirsky shared a love of music and literature. They also enjoyed long walks together in the Derbyshire countryside. Except for the year\n1951\n-\n52\nspent at Bristol\n(\nworking with Heilbronn\n)\n, he was to spend the rest of his career at Sheffield. He was promoted to Senior Lecturer in\n1958\n, Reader in\n1961\nand Professor in\n1971\n.\nMirsky had three main areas of research.\n1\n. The theory of numbers, where he studied\nr\nr\nr\n-free numbers, i.e. numbers not divisible by the\nr\nr\nr\nth power of any integer. He obtained analogues of\nVinogradov\n's result on the representation of an odd integer as the sum of three primes, the\nGoldbach conjecture\non the representation of an even integer as the sum of two primes, and the\ntwin primes conjecture\n.\n2\n. Linear algebra, where he wrote his famous text\nAn introduction to linear algebra\n(1955)\nand went on to publish\n35\npapers on the topic. In particular he proved results on the existence of matrices with given\neigenvalues\nand given diagonal elements.\nFor extracts from reviews of his linear algebra book see\nTHIS LINK\n.\n3\n.  Combinatorics, where he also wrote an important book\nTransversal Theory\nand he developed ideas coming from\nHall\n's theorem:-\nA finite family of sets has a system of distinct representatives if and only if the union of every\nk\nk\nk\nsets of the family contains at least\nk\nk\nk\nelements.\nFor extracts from reviews of his combinatorics book see\nTHIS LINK\n.\nReferring to the success of his two books,\nLinear Algebra\nand\nTransversal Theory\nthe author of\n[\n1\n]\nwrites that it:-\n... bears witness to Mirsky's gift for exposition; his hallmark was elegance combined with clarity.\nYou can read more about these books at\nTHIS LINK\n.\nLet us look briefly at how he came to work on these three topics. His early work was on number theory which was his first love but, after\nGeoffrey Walker\nwas appointed as his head of department at Sheffield in\n1947\nand asked Mirsky to teach a course on linear algebra, he became fascinated in that topic in addition to his number theory interest. However, when he was a morning speaker at the British Mathematical Colloquium at St Andrews in\n1956\nhis topic was\nAdditive prime number theory\n. He worked on doubly stochastic matrices in the first half of the\n1960\ns, publishing papers such as\nResults and problems in the theory of doubly-stochastic matrices\n(1963)\nand two papers with Hazel Perfect,\nSpectral properties of doubly-stochastic matrices\n(1965)\nand\nThe distribution of positive elements in doubly-stochastic matrices\n(1965)\n. This led to him applying\nHall\n's theorem and so his interests turned towards combinatorics. For example he published\n(\nwith Hazel Perfect\n)\nSystems of representatives\n(1966)\n,\nSystems of representatives with repetition\n(1967)\n,\n(\nwith Hazel Perfect\n)\nApplications of the notion of independence to problems of combinatorial analysis\n(1967)\nand\nA theorem on common transversals\n(1968)\n.\nMirsky's talent for teaching was clearly related to his gifts as a writer and is described in\n[\n3\n]\nas follows:-\nLeon was a born teacher. He welcomed the challenge of presenting a whole theory or just one proof in a logical, efficient, clear and elegant manner. ... His lectures ... were highly individual performances. There was never any hint of familiarity with his audience and Leon always wore a gown to emphasize the formality of the occasion. On the other hand, the alert student could spot a succession of jokes all made with an entirely straight face and no change of tone.\nHe believed that mathematics research should not be a solitary occupation, but firmly believed in collaborating with others\n[\n1\n]\n:-\nHe was particularly eager to share ideas at research level and firmly believed that research should always be a cooperative rather than competitive venture.\nOutside mathematics Mirsky had a wide variety of interests\n[\n1\n]\n:-\nHis knowledge of literature, history and philosophy was wide and, in some areas, almost professional. Many of his former colleagues will miss the stimulus of conversations with him on these and a host of other subjects.\nThe authors of\n[\n3\n]\ngo into more detail:-\nAmongst scientists the awe-inspiring spread and depth of Leon's learning in the humanities must have been almost unique. In philosophical, historical and literary discussions he could hold his own with professionals. A phenomenal memory and an exceptional reading speed made this possible, but enthusiasm was the driving force. Literature, particularly poetry, gave him most pleasure. He was fluent in German and Russian, read comfortably in French and taught himself enough Italian to appreciate Dante in the original. But Leon's tastes reflected the lighter side of his nature as well. He was captivated by P G Wodehouse and he knew the Gilbert and Sullivan operas by heart. At one time he also read great quantities of detective novels - at great speed, of course. A somewhat unexpected interest of his was cricket. Friends were apt to regard this as an amusing pose, but they were wrong, for he found the spectacle of the game aesthetically pleasing and the tactics appealed to his intellect.\nMirsky retired from his chair in Sheffield in September\n1983\nand the paper\n[\n4\n]\nwas planned to honour his achievements at Sheffield. However, he died suddenly in December\n1983\nand the paper\n[\n4\n]\nbecame an obituary. We end our biography with the following quote from\n[\n4\n]\n:-\n... no account of Leon, however brief, is complete without mention of his kindness and the steadfast friendship he displayed throughout his life. In any crisis he was the person his friends would first turn to, and they were never disappointed.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}