{
  "nome_completo": "Leon Melvyn Simon",
  "nome_curto": "Leon Simon",
  "ano_nascimento": "1945",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Simon/",
  "lugar_nascimento": "Adelaide, South Australia, Australia",
  "lugar_morte": null,
  "biografia": "Leon Simon\nstudied at the University of Adelaide where he was awarded a B.Sc. in\n1967\n. He then continued to undertake research at the University of Adelaide with James H Michael as his research supervisor and was awarded his Ph.D. in\n1971\nfor his thesis\nInterior Gradient Bounds for Non-Uniformly Elliptic Equations\n. During his years as a doctoral student, he was employed from\n1968\nto\n1971\nas a Tutor in Mathematics by the University.\nFollowing the award of his Ph.D., Simon was appointed as a Lecturer in Mathematics at Flinders University of South Australia for the academic year\n1972\n-\n73\n. He then travelled to the United States where he was first Visiting Assistant Professor at Stanford University in\n1973\n, then appointed as Assistant Professor at Stanford holding this position until\n1976\n. He was a Sloan Fellow during\n1974\n-\n75\n. Papers which Simon published over this period were:\n(\nwith his Ph.D. supervisor James H Michael\n)\nSobolev and mean-value inequalities on generalized submanifolds of\nR\nn\n\\mathbb{R}^{n}\nR\nn\n(1973)\n;\nGlobal estimates of Hölder continuity for a class of divergence-form elliptic equations\n(1974)\n;\n(\nwith\nRichard M Schoen\nand Shing-Tung\nYau\n)\nCurvature estimates for minimal hypersurfaces\n(1975)\n;\nInterior gradient bounds for non-uniformly elliptic equations\n(1976)\n; and\nRemarks on curvature estimates for minimal hypersurfaces\n(1976)\n. Let us note that Simon's co-author\nRichard M Schoen\nwas his first doctoral student and was working on his Ph.D. under Simon's supervision at the time the above paper was written.\nIn\n1976\nSimon returned to Australia being a Visiting Professor at the University of Adelaide during the academic year\n1976\n-\n77\n, then was appointed Associate Professor at the University of Minnesota where he worked for the year\n1977\n-\n78\nbefore again returning to Australia when appointed as Professor of Mathematics at the University of Melbourne. He held this chair from\n1978\nto\n1981\nwhen he moved to the Australian National University as Professor of Mathematics. He held this post until\n1986\n. In\n1983\nhe was honoured with election as a fellow of the\nAustralian Academy of Science\nand in the same year he became the third recipient of the\nAustralian Mathematical Society\nMedal. This Medal is:-\n... awarded to a member of the Society under the age of\n40\nyears for distinguished research in the mathematical sciences. A significant portion of the research work should have been carried out in Australia.\nSimon published\nLectures on geometric measure theory\nin\n1983\n. In a review, J S Joel writes:-\nMany years ago\nH Federer\n's book on geometric\nmeasure theory\nappeared and immediately became a reference for those working in and interested in the field. Its very size and comprehensiveness lent it more the nature of a reference book than a textbook. In the meantime there has also been considerable progress in the field, including deeper regularity theorems and a closer connection with differential-geometric and analytic objects. The book under review, which the author says is a preliminary version of a more complete book he hopes to write, is both an introduction to geometric measure theory and related variational problems and to the regularity theory. The exposition is clear throughout ...\nIn\n1986\nSimon was appointed Professor in the Mathematics Department at Stanford University. In\n1994\nhe was awarded the\nBôcher\nMemorial Prize by the American Mathematical Society. The citation gives a good overview of Simon's important contributions\n[\n1\n]\n:-\nThe\n1994\nBôcher\nPrize is awarded to Leon Simon for his profound contributions towards understanding the structure of singular sets for solutions of variational problems.\nPowerful methods were developed in the\n1960\ns to establish the partial regularity of minima and critical points of the\nPlateau\nproblem and later extended to other variational problems such as the harmonic mapping problem. These results left open basic questions about the structure of the set of singularities exhibited by the solutions of such variational problems.\nIn a series of papers over the past ten years, Simon has developed methods for analysing this structure. This development began with his\n1983\npaper \"Asymptotics for a class of nonlinear evolution equations, with applications to geometric problems.\" The first stage of his work on general singular sets is principally described in \"Cylindrical tangent cones and the singular set of minimal submanifolds\"\n(1993)\n, and the remaining work appears in his paper \"Rectifiability of the singular set of energy minimizing maps\"\n(1995)\n. This latter paper establishes rectifiability for singular sets of energy minimising maps into an arbitrary compact real analytic target manifold.\nIn\n1996\nSimon published\nTheorems on regularity and singularity of energy minimizing maps\nwhich was based on lectures which he gave while holding a visiting position at Eidgenössische Technische Hochschule Zürich. Nathan Smale gives the following overview as part of his review of the book:-\nThe volume under review provides a detailed exposition of the more fundamental results on the regularity theory of energy minimizing maps between Riemannian manifolds. After a preliminary section, the book covers the main partial regularity results, due to\nSchoen\nand\nUhlenbeck\n, then a fairly comprehensive discussion of minimizing tangent maps including a somewhat simplified proof of the author's celebrated theorem on the uniqueness of tangent maps, and finally an account of recent results on the rectifiability of the singular set. Despite the depth of the results, the book is completely self-contained\n(\nassuming only a rudimentary knowledge of real analysis, such as one would find in a first year graduate course\n)\n, and gets rapidly to the heart of the subject, providing detailed, concise proofs of the theorems.\nWe have mentioned above some of the honours which Simon has received. Let us finally mention that he was elected a fellow of the\nAmerican Academy of Arts and Sciences\nin\n1994\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}