{
  "nome_completo": "Leopold Karl Schulz von Strassnitzki",
  "nome_curto": "Leopold Karl Schulz von Strassnitzki",
  "ano_nascimento": "1803",
  "ano_morte": "1852",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schulz/",
  "lugar_nascimento": "Kraków, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Bad Vöslau, near Vienna, Austria",
  "biografia": "Leopold Karl Schulz von Strassnitzki\n's name appears in various spellings such as\nStraßnitzki\n,\nStrasznitzki\n,\nStrasznicki\nand\nStraschnizki\n. He was the grandson of Leopold Ludwig Schulz\n(1743\n-\n1814)\nwho was awarded a doctorate in philosophy in\n1774\nand in\n1776\nwas given the title of Imperial and Royal Councillor in recognition of his honourable service in the teaching field. In\n1808\nhe was raised to the nobility with the title of von Straßnitzki, from the Straßnitz estate in Moravia. Leopold Ludwig Schulz and Antonie von Schönauer had three sons, Martin\n(\nborn\n5\nJanuary\n1771)\n, Leopold\n(\nborn\n5\nDecember\n1773)\nand Anton\n(\nborn\n15\nDecember\n1775)\n.\nAccording to\n[\n8\n]\n, Anton married Karoline Hillmayr on\n20\nMay\n1800\nin Michov, Moravia and they had two sons Joseph\n(\nborn\n10\nApril\n1802)\nand Leopold Karl\n(\nborn\n31\nMarch\n1803)\n, the subject of this biography. Not all sources, however, agree that Anton Schulz was Leopold Karl Schulz's father, for example\n[\n6\n]\ngives Leopold Ludwig Schulz's second son, Leopold, as Leopold Karl Schulz's father. All sources agree, however, that Karoline Hillmayr was Leopold Karl Schulz's mother.\nGalicia had become part of the Austrian Empire in the First Partition of Poland in\n1772\nalthough at this stage Kraków was still part of a reduced Poland. In the Third Partition of Poland in\n1795\nKraków became part of Galicia ruled by the Austrian authorities. Leopold Karl's father was appointed as Imperial and Royal District Commissioner in Galicia and carried out this role while living in Kraków. He was there when his two sons were born in\n1802\nand\n1803\n. Leopold Karl was a bright child and he quickly learnt to read and soon became an avid reader of books. His health, however, was poor and because of this he was unable to play games with other children.\nThe family remained in Kraków until, on\n25\nMarch\n1811\n, a few days before Leopold Karl's eighth birthday, his mother Karoline died. Leopold Karl and his brother Joseph were sent to Vienna to be brought up by their grandfather Leopold Ludwig Schulz von Strassnitzki. Leopold Ludwig had been appointed Governor of Western Galicia in\n1796\nand had lived in Kraków until he retired in\n1803\n. His wife, Antonie von Schönauer, had died in Kraków in\n1802\nso after he retired he returned to Vienna, his native city, where he lived with his two unmarried daughters. It was in Vienna, in his grandfather's home, that Leopold Karl went to live in\n1811\n. He was given a little desk, adjacent to his grandfather's writing desk, and received from him a wonderful education over the next few years. His grandfather had been a university professor and had many friends who were professors at the University of Vienna. They would visit and encourage the young boy to study and learn. One professor in particular, Martin Johann Wikosch\n(1754\n-\n1826)\n, who had been appointed as a full professor of world history at the Vienna University in\n1807\n, was particularly kind to the young boy and it is thought that he was a major influence in Leopold Karl deciding at a young age that he wanted a career as a teacher.\nLeopold Karl's grandfather died on\n14\nFebruary\n1814\nbut the young boy, although he took very badly with his grandfather's death, remained in Vienna studying at a Gymnasium. He was taught by the student Ignaz Grassl von Rechten\n(1795\n-\n1889)\nwho was just starting his career\n(\nhe later became professor of civil law and rector of the University of Vienna\n)\nand by the student Josef von Bergmann\n(1796\n-\n1872)\nwho later became an antiques expert and taught history and Latin. Leopold Karl continued his love of literature while at the Gymnasium but he became even more interested in mathematics and decided to become a mathematics teacher.\nHe entered the Philosophy Faculty of the University of Vienna in\n1819\nand, although his main interests were in mathematics and physics, he attended almost all the courses offered by the faculty. He attended lectures on mathematics and astronomy by Jozef Jenko\n(1776\n-\n1858)\n, Andreas Freiherr von Ettingshausen\n(1796\n-\n1878)\nand Joseph Johann von Littrow\n(1781\n-\n1840)\n, and also on philosophy delivered by Leopold Rembold\n(1785\n-\n1844)\n. He also attended lectures on rational law and statistics in the Law faculty and even attended lectures on practical geometry, mechanics and architecture at the Polytechnic Institute. This Institute had only been founded in\n1815\nand had moved into its main building on the Karlsplatz in autumn\n1818\n. One of Schulz's friends was the fellow student Johann Gabriel Seidl\n(1804\n-\n1875)\nwho later became an archaeologist and dramatist. Another of his friends was Franz Seraphin Exner\n(1802\n-\n1853)\nwho became a professor of philosophy at the young age of\n25\n. Jozef Jenko organised Schulz's examination on\n22\nJuly\n1823\n; Schulz \"put forward several mathematical theses and defended them with mastery.\"\nIn January\n1823\nSchulz had been awarded a scholarship to continue his studies of mathematics and later that year he was appointed as an assistant professor for mathematics and physics at the Polytechnic Institute. In addition to this position, in November\n1824\nhe was appointed as an assistant professor for mathematics and physics at the University of Vienna. He found that the department at the University lacked equipment so he took on extra private tutoring work to make some money to fund buying equipment out of his own pocket. From his youth his health had been weak and this excessive amount of work took its toll. On\n13\nJune\n1828\nthe position of head of mathematics at Ljubljana Lyceum was advertised and Schulz was appointed.\nFranc Močnik\nwas a student at Ljubljana Lyceum when Schulz was teaching there and he wrote about his outstanding teacher\n[\n7\n]\n:-\nThe state of academic life at the Ljubljana Lyceum was regrettable at that time. The professors limited themselves, as was usually the case at other lyceums at that time, to reading from their notebooks, to give explanations in their lectures, and if, in spite of this, an ambitious talent did emerge in exceptional circumstances, this was truly only due to a vital drive for knowledge breaking through despite all obstacles. Then the brilliant Schulz came to Ljubljana bringing with him a hitherto unknown excitement and ambition among the young students. His inaugural speech made a moving impression. With awe-inspiring power and captivating eloquence he described the whole life of a high school student and in particular the sublime importance of the true study of the mathematical discipline. Filled with a fiery love of science, he knew superbly how to instil the spiritual delight of scientific endeavour in his listeners with warmth and emotion. In a humorous way, delivered with a deep philosophical eye, he turned this subject into a true gymnastics of the mind and the theories developed into a self-acquired, inalienable possession of his students. ... He gave lectures on higher mathematics to those with talent. Schulz ... was always eager to present in its best light the practical importance of mathematics in its many-sided applications to all branches of knowledge. This was demonstrated by the practical measurements that he carried out with his students every year in the summer months and which were a real celebration of joy for them; he showed this through his lectures on popular astronomy, which were as comprehensible as they were witty and which were attended by a large audience from all classes of the population. His all-round beneficial activity, his extensive knowledge, his cheerful, friendly and honest character won him the love of the young students as quickly as the respect and trust of the entire population. Schulz was the invigorating focal point around which all people of science and art gathered. Everyone sought his friendship and his witty, instructive company.\nOn\n9\nSeptember\n1830\n, Schulz married Sophie Anna Seeliger\n(1800\n-\n1891)\nin Vienna. They had five children: Johann Schulz von Strasznitzki\n(\nborn\n6\nJuly\n1831\nin Ljubljana\n)\n; Aloisia Schulz von Strasznitzki\n(\nborn\n15\nJuly\n1833\nin Ljubljana\n)\n; Leopold Franz Schulz von Strasznitzki\n(\nborn\n3\nFebruary\n1835\nin Lwów\n)\n; Friedrich Schulz von Strasznitzki\n(\nborn\n13\nJune\n1836\nin Lwów\n)\n; Sophie Antonia Karolina Schulz von Strasznitzki\n(\nborn\n25\nJuly\n1839\nin Vienna\n)\n. The eldest of the children, Johann Schulz, obtained a doctorate in law after completing his legal studies. He chose a career in the civil service and became a secretary in the Ministry of Agriculture. He published several articles on national economics. He died in Vienna on\n28\nJune\n1917\n. Their second son, Leopold Franz Schulz, also entered the civil service working in the Ministry of Culture and Education, where he became head of the Department of Education. He published works on art history and died on\n20\nDecember\n1881\nin Vienna. The youngest of the three sons, Friedrich Schulz, became an engineer at the Empress Elisabeth Western Railway. He also published articles, mainly for the\nJournal of the Austrian Engineers and Architects Association\n, and died in Vienna on\n17\nOctober\n1914\n. Let us now return to our description of Leopold Karl Schulz's life.\nDuring his time at the Ljubljana Lyceum, Schulz published a number of works:\nÜber das geradlinige Dreieck und die dreiseitige Pyramide\nⓉ\n(\nOn the right triangle and the three-sided pyramid\n)\n(1827)\n;\nElemente der reinen Arithmetik\nⓉ\n(\nElements of pure arithmetic\n)\n(1831)\n; and\nElemente der reinen Geometrie\nⓉ\n(\nElements of pure geometry\n)\n(1835)\n. After teaching at Ljubljana Lyceum for seven years, in\n1834\nhe was appointed as professor of mathematics and practical geometry at the University of Lwów\n(\nknown also at that time as Lemberg in German, and now as Lviv in Ukrainian\n)\n. Yaroslav Prytula writes in\n[\n5\n]\n:-\nThe higher mathematics was taught at the university for the first time by Leopold Schulz von Straschnizki. He was one of the best Austrian mathematicians of those times. In\n1835\ntwo of his students defended dissertations in pure mathematics. In\n1838\nL Schulz obtained a chair in Vienna Polytechnic, which was a considerable loss for the University of Lwów.\nDuring his time in Lwów\n(\nLemberg\n)\nhe continued to deliver free popular lectures on astronomy as he had done in Ljubljana. He served as Dean of the Faculty of Philosophy at the University of Lwów in\n1835\n-\n36\n.\nThe Polytechnic of Vienna had been founded in\n1815\nto meet the needs of the fast growing industries, commerce and economy. Adam Freiherr von Burg\n(1797\n-\n1882)\nwas the professor of Higher Mathematics from\n1827\nto\n1837\n. He moved to the Chair of Mechanics in\n1837\nand Joseph Salomon\n(1793\n-\n1856)\nwas appointed to the Chair of Higher Mathematics in\n1838\n. By a resolution dated\n3\nApril\n1838\n, Schulz was appointed to the Chair of Elementary Mathematics at the Polytechnic of Vienna. When he was appointed, his salary was less than the other professors but it was made up by a staff allowance. On\n29\nJanuary\n1843\nhe was given equal salary and status to the other professors and was allowed to teach Higher Mathematics as well as Elementary Mathematics. Teaching, however, was Schulz's main concern and most of his publications were aimed at making mathematics more accessible to as many people as possible. His publications included\nInstructions for using the English slide rule\n(1843)\n,\nHandbook of special and general arithmetic for practitioners\n(1844)\n,\nInstructions for calculations with decimal fractions\n(1844)\n,\nLogarithms and other useful tables\n(1844)\n,\nHandbook of geometry for practitioners\n(1850)\n, and\nFundamental theories of analysis\n(1851)\n. Let us quote from\n[\n7\n]\nto illustrate how successful he was in bringing mathematics to a wide audience:-\nThrough his writing he sought to raise and stimulate interest in mathematics: for example, in his \"Handbook of Special and General Arithmetic for Practitioners\" he made many of the treasures of science, which had previously only been accessible with the help of infinitesimal calculus, accessible to a wider public by carrying out many proofs using elementary methods. This work was often associated with extraordinary difficulties and expenditure of time and brought him far less fame than the successful results of research investigations, but for this work those involved in practical work had to be particularly grateful to him. In the same spirit, Schulz offered to hold popular lectures on geometry and arithmetic for artists and craftsmen on Sundays and holidays \"free of charge\", and the government accepted this request. Even in these lectures, Schulz's great teaching ability and the practical tact that always and everywhere distinguished him in his profession were preserved. In addition to these lectures on the elements of arithmetic and geometry, which were attended by the largest audience and had the most beneficial effects for the industrial classes, he also gave lectures on the use of the English slide rule, which he was the first to draw attention to in Austria and Germany and which he endeavoured to introduce especially in the handicrafts sector. On his instructions, this instrument was made by a Viennese mechanic, and his instructions for its use were then published by Rohrmann in\n1843\n. He himself invented a slide rule, an instrument that is very suitable for all kinds of construction calculations and was published under the title: \"Professor Schulz von Straßnitzki's slide rule, published by Anton Schefzik\"\n(1845)\n.\nLet us note that\nZacharias Dase\nattended Schulz's lectures in Vienna in\n1844\n. Schulz urged\nDase\nto use his exceptional calculating ability for scientific purposes and suggested that he calculate digits of π.\nDase\nused his calculating ability to calculate π to\n200\nplaces and published the result, which is correct and contains the most digits known at this time, in\nCrelle\n's\nJournal\n.\nOn\n18\nMay\n1848\nthe first German National Assembly was held in Frankfurt am Main with representatives, who had been elected on\n1\nMay\n1848\n, of all German-populated regions of the Austrian Empire. Schulz had been elected and attended the German National Assembly, enthusiastically putting forward his political views. With other Austrian representatives he visited the University of Heidelberg. He then went to Hanover and Berlin, with the Austrians receiving a great welcome everywhere. Schulz was received as a reception at the University of Berlin and there gave a speech to the students. Here is the end of that speech where he makes very clear his political views:-\nWe now see the dawn of Germany's freedom and greatness; what we longed for in our youth, what we only imagined in bold images, is now nearing fulfilment; but many struggles and persevering strength are still needed before the bright day breaks; we older people will not live to see it; we will only see the promised land like Moses, without entering it. But the hope that the honest, intelligent, great German people will no longer be torn apart, no longer enslaved, no longer mocked by even the smallest of neighbours - but that it will be powerful, strong, and will take the place worthy of its intelligence among the peoples of Europe - this hope inspires us, and this hope is based primarily on our brave German youth, who are so passionate about freedom and order, justice and truth, who are actively working on the building of the future and who will protect the palladium of social order with a firm hand. The present anxious times are only the birth pangs of the coming great time, which will blossom not for us, but for our children and grandchildren.\nIn\n1850\nSchulz began to deliver popular lectures on astronomy in Vienna. The audience was so large that even though a big hall had been chosen not everyone could find a seat. He decided to deliver that same lecture twice a week so that all who wanted to listen, both young people and old people, could attend. His inaugural lecture,\nPosition of astronomy in the realm of mankind\n, was published in\n1850\n.\nLeo, count von Thun und Hohenstein, was the Austrian Minister for Education from\n1849\nto\n1860\n. In\n1851\nhe appointed Schulz to the committee to examine candidates for teaching mathematics in secondary schools. Leo also sent Schulz on a state funded visit to the London Great Exhibition of\n1851\nand to observe the British school and educational system. He was asked to report back to the Austrian government on the mathematical, physical and astronomical instruments on display at the Exhibition. Although Schulz's health had been poorly for a number of years, he felt able to make the journey to London in the summer of\n1851\n. One of the features of the English education system which impressed him was the institutions where tradesmen, merchants and other workers could obtain adult education in evening classes.\nThe journey to London made his health deteriorate, and the English climate and diet also seemed to make him suffer badly. On his return to Vienna he was diagnosed with chronic kidney disease and told to take a complete rest and stop lecturing. He did not do as the doctor told him and continued to lecture. By following a suitable diet, Schulz was relatively free of pain until the last two days of his life; on the other hand, his weakness and lack of energy increased day by day, until finally a stroke put an end to his life on\n9\nJune\n1852\nin Vöslau; he was\n49\nyears old. His funeral was held in Vöslau and a special train took the staff and students of the Vienna Polytechnic from Vienna to Vöslau to attend. His aunt, Aloisia Baroness Odelga, who had taken the place of his mother in his youth, had a beautiful granite monument erected for him in the Vöslau local cemetery.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}