{
  "nome_completo": "Leopold Infeld",
  "nome_curto": "Leopold Infeld",
  "ano_nascimento": "1898",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Infeld/",
  "lugar_nascimento": "Kraków, Austria-Hungary (now Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Leopold Infeld\nwas born in Kazimierz, the Jewish ghetto of Kraków. His father, Salomon Infeld, was a leather merchant and although the family was better off than many others around them, their living conditions were still poor. For the first eighteen years of his life he slept on a sofa in the same room as his two sisters, the room in which the family lived and ate during the day. His first education was at a Jewish religious school, but as he grew up he rebelled against the religion and against the Yiddish language which his parents spoke at home. Infeld wanted desperately to escape and be able to go to university, so he begged his parents to allow him to attend a\ngymnasium\nwhich would prepare him for university entrance. His father, however, wanted his son to enter the family business so he sent him to a commercial school.\nInfeld certainly was not going to give up his ambitions that easily, so he studied on his own to enable him to take the 'matura' exams. Subjects like Latin were not covered at all at the commercial school so he had to learn that without any support from teachers. When he passed his 'matura' exams in\n1916\nwith very high grades his father relented and allowed him to enter the Jagiellonian University in Kraków. Since Europe was, at this time, in the middle of World War I, Infeld was first drafted into the Austrian Army but his Jewish background and academic interests meant that his career as a soldier was never going to go well. As soon as possible he left the army behind and began his study of mathematics and physics at the Jagiellonian University. Since theoretical physics was not strong in Poland, Infeld decided that he needed to study abroad to gain experience in research for his doctorate\n[\n8\n]\n:-\nFeeling the need for wider academic contacts, he spent the year\n1920\n-\n21\nin Berlin, where he met\nEinstein\nand produced his first paper entitled \"Light waves in the theory of relativity.\"\nOne could say that\nEinstein\nacted as his thesis advisor, for he submitted the work he had carried out in Berlin to the Jagiellonian University on his return to Kraków. He was awarded his doctorate in\n1921\n- the first in theoretical physics to be awarded by a Polish university. He had achieved his childhood ambitions and now stood on the brink of an academic career. However his attempts to find an academic post failed and he was left in little doubt as to the reasons; it was, he felt, certainly because he was a Jew looking for a post in anti-Semitic universities. However, in his own estimation, his troubles went deeper than that for becoming a teacher in a Jewish school seemed equally hard. He wrote\n[\n2\n]\n:-\nTo the Polish world I was a Jew. To the Polish Jews I was not sufficiently Jewish.\nAt last, in\n1922\n, he was appointed headmaster at a Jewish co-educational high school in Konin. He was desperately unhappy in this small town. He wrote in\n[\n2\n]\n:-\nWhile I was there my world was divided into two parts: isolated Konin in which, I thought, I should probably die, and the rest of the world which I should never see.\nHis living conditions there were worse than they had been in the Jewish ghetto of Kraków. He wrote in\n[\n1\n]\n:-\nOur outhouse was about\n220\nyards from the house. I still remember my visits there at night with a candle in my hand and despair in my heart.\nThese were not conditions conducive to carrying on with his research\n[\n2\n]\n:-\nWhen I returned home I could not bear to look at my scientific books, collected during years of study. I did not believe that I would ever open one of them again in my life.\nAfter two years spent in Konin, Infeld was appointed as a physics teacher at a Jewish gymnasium for girls in Warsaw. The job was not great but at least he was in Warsaw. He was aware, however, that the years which should be the most productive for a scientist were being wasted\n[\n2\n]\n:-\nThe best years in the life of any scientist, the years in which imagination reaches its peak. Those years were gone ...\nIn\n1928\nhe met Halina; they married in the same year. In\n1930\nhe at last managed to get an academic appointment, a senior assistantship in theoretical physics in Lwów\n(\nnow Lviv in Ukraine\n)\n. This was the sort of position he had expected to get eight years earlier, but despite this he was very happy and soon promoted to\nDocent\n[\n2\n]\n:-\nEverything was changed, everything seemed beautiful and full of hope ...\nIn\n1932\nhe visited Leipzig where he worked with\nHeisenberg\nand\nvan der Waerden\n, with whom he wrote the paper\nSpinors in Riemannian geometry\n. Tragedy struck in this year, however, for Halina died after suffering a long drawn out wasting disease. Unable to work through grief, and realising that progress in Lwów would be well nigh impossible, Infeld decided to accept a Rockefeller Foundation Grant to study in Cambridge, England. He spent two years\n1933\n-\n35\nin Cambridge where he thrived in the academic environment. During this time he wrote six joint papers with\nMax Born\n- examples of their papers in the\nProceedings of the Royal Society\nare\nFoundations of the new Field Theory\n(1934)\nand\nOn the Quantization of the New Field Equations\n(1935)\n. Bialynicki-Birula writes\n[\n3\n]\n:-\nSixty-five years ago Leopold Infeld went to England as a Fellow of the Rockefeller Foundation. In Cambridge he met Rutherford and\nDirac\nand entered into the collaboration with\nMax Born\n, who has just arrived in England. The result of this collaboration was the\nBorn\n-Infeld electrodynamics.\nScientifically these were good years but his social life in England proved less successful. He eloped with, and married, one of his English cousins but the marriage was not a success. He returned to Lwów in\n1935\nbut by this time the Nazi threat was evident. He corresponded with\nEinstein\nwho suggested he apply for a grant to visit the Institute for Advanced Study at Princeton. His application, with\nEinstein\n's support, was successful and he left in\n1936\nfor America. Before he left he returned to Kraków for a final visit which he describes in\n[\n2\n]\n:-\nI wandered through the ghetto of my town. On a summer morning the voices of Jewish boys singing in chorus the words of the Torah reached me through the open window of the school. There may be among them someone who hates this place as I hated it and who dreams of going to a gymnasium. I went nearer. The school windows were open, the first-floor windows of a dreary house. I smelt the foul air of the room. It was the same air, the same smell of onions and potatoes, which I had smelled over thirty years before. I saw the tired, thin, badly nourished faces with burning dark eyes and for the first time in my life I was conscious of a touch of poetry in this sad ghetto scene.\nIn Princeton, Infeld collaborated with\nEinstein\nwriting a popular text\nEvolution of Physics\n(1938)\n. Gajewski writes\n[\n5\n]\n:-\nInfeld enjoyed writing. Most of his literary output was in English.\n(\nHe would remark with mocking modesty that in the history of world literature there were two Polish writers who wrote in the English language; the other one was Joseph Conrad.\n)\nAs a translator of two of his books I had the opportunity to admire from up close the mastery of his literary craft: short sentences, rhythmic cadences and, above all, utter clarity of exposition. 'The Evolution of Physics', co-authored with\nEinstein\n, is a true masterpiece. It set a standard for generations to come on how to popularize cutting-edge science.\nIn\n1938\nInfeld received an offer from\nJ L Synge\nof a professorship at the University of Toronto. He gladly accepted the invitation full of hope for a new life in Canada. However, he did fell uneasy about the world and his place in it. He wrote\n[\n2\n]\n:-\nBut will I be able to destroy the restlessness which up to now has grown from the years of my childhood? Perhaps I will miss the atmosphere of fight and struggle which I have breathed for so many years. Have I really crossed all the bridges leading to the outside world from the island on which I was born? Perhaps I will be forced to retreat and to start my wanderings again if darkness and hate spread over the world. Passively to await the future means to approve the world of today and to share the responsibility for its fate. Where is my place in the world?\nIn\n1939\nInfeld married Helen, an American who was a graduate from Cornell in mathematics. Already famed as a collaborator of\nEinstein\n, Infeld published many important papers over the next few years. For example he published\n(\njointly with\nA Einstein\nand B Hoffmann\n)\nThe gravitational equations and the problem of motion\n(1938)\nand a second part, jointly with\nEinstein\n, two years later. In the first paper the authors showed, as\nH P Robertson\nwrote, that:-\n... the gravitational field equations, satisfied in regions free of matter, imply the vanishing of certain surface integrals taken over\n2\n-dimensional surfaces enclosing spatial regions containing the particles responsible for the field. In obtaining this result the authors made use of a normalizing condition restricting the choice of coordinates; with it they were able to show that the vanishing of the surface integrals led to equations of motion for the particles.\nThe second paper showed that the same results could be proved without the normalizing condition. Other papers he published around this time include\n(\nwith P R Wallace, one of his doctoral students\n)\nThe equations of motion in electrodynamics\n(1940)\n,\nOn the Theory of Brownian Motion\n(1940)\n,\nOn a new treatment of some eigenvalue problems\n(1941)\n,\nA generalization of the factorization method for solving eigenvalue problems\n(1942)\n, and\nClocks, rigid rods and relativity theory\n(1943)\n. He published two papers with A Schild, one of his doctoral students, in\n1945\n, namely\nA note on the Kepler problem in a space of constant negative curvature\n, and\nA new approach to kinematic cosmology\n.\nAfter the war Infeld's wife Helen lectured to engineers while bringing up their two children Eric and Joan who had both been born in Toronto. Infeld had all his life been a pacifist. This became a problem in North America in the later\n1940\ns and Infeld was not one to keep his political views to himself. Stern\n[\n10\n]\nrelates one incident:-\nOn the evening of April\n16\n,\n1948\n, a member of the Royal Canadian Mounted Police's \"special branch\" attended a public lecture at McGill University in Montreal. The special branch served as a domestic spy agency, forerunner to the Canadian Security Intelligence Service. On this spring night the operative mingled in the audience, probably posing as a scholar or student, most of whom were associated with McGill's theology department. The agent had been assigned to report on guest speaker Dr Leopold Infeld, then Canada's greatest physicist. A professor at the University of Toronto, Infeld was well known as a close collaborator of\nAlbert Einstein\n. It was a great prize for Canada's scientific community when,\n10\nyears earlier, Dr Infeld left the United States to come north. Like\nEinstein\n, Infeld was a peace activist.\nTwo years later the Canadian government acted against Infeld and his family\n[\n10\n]\n:-\n... Parliament denounced Infeld as a traitor who planned, if he hadn't done so already, to provide Russia with atomic secrets. ... the allegations against Infeld were based on rumour. Even so, his photograph was splashed across the nation's newspapers, his family was harassed, and in\n1950\nhe moved to Poland, his country of birth. His Canadian citizenship and that of his young Canadian-born children were revoked.\nG de B Robinson\nwrites in\n[\n8\n]\n:-\nInfeld returned to Warsaw in\n1950\nas a member of the Praesidium of the newly formed\nPolish Academy\nand Head of the Institute of Theoretical Physics as well as Director of the same Institute in the University. He who had been ignored before the war was now accorded the highest honours. The years\n1950\n-\n68\nwere full of scientific activity as evidenced by the publication of more than forty papers and the book with J Plebanski 'Motion and relativity' in\n1960\n. ... but the withdrawal of\n[\nCanadian\n]\ncitizenship of his two children, born in Toronto, came as a cruel blow.\nThe important book\nMotion and relativity\nreferred to in this quote is an important monograph. Here is a short extract from F A E Pirani's review:-\nThis is not a general textbook, but a monograph for specialists. In it are collected \"final results\" of the study, begun by Infeld with\nEinstein\nand Hoffmann in Princeton in\n1938\n, and carried on by him with his students in Warsaw during the last decade, of the problem of motion in the general relativity theory of gravitation. The \"problem of motion\" is the problem of determining the motion, in their mutual fields, of gravitating particles of given structure. The problem is a substantial one, because the field equations are non-linear, and because they are connected by differential identities. ...\nHe end his review with the words:-\nThe whole book bears the marks of the senior author's vigorous and enthusiastic style. It will have permanent value, in any serious library of the subject, as a definitive, detailed account of this part of general relativity theory.\nInfeld's return to Poland had been greatly welcomed but life under the Communist regime became increasingly difficult. Gajewski, who was his student in Warsaw, tells in\n[\n5\n]\nof investigations by the Polish security police into Infeld. He writes of Infeld's final years\n[\n5\n]\n:-\nI did not talk politics with Infeld when he was at the height of his political power. I did toward the end of his life. He was utterly disillusioned with the regime, disappointed in its policies towards science and culture, disgusted with the raging official anti-Semitism. Despite failing health, and at a considerable personal risk, he was willing to publicly join in major initiatives protesting the policies of the government. Those initiatives were the precursors to the formation of the Worker's Defence Committee which, in turn, was the precursor to Solidarity. And the rest, as they say, is history.\nGajewski describes Infeld as a teacher\n[\n5\n]\n:-\nInfeld was an inspired, and inspiring, teacher. Lecturing mostly without notes, he would meticulously cover the blackboard with calligraphic formulas. He used tensor notation at that time a novelty to me.\n(\nInfeld liked to quip that mankind can be classified into two categories: those who knew what a tensor was, and all the rest; and he would add \"I don't much care about that rest\".\n)",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}