{
  "nome_completo": "Leopold Karl Schmetterer",
  "nome_curto": "Leopold Schmetterer",
  "ano_nascimento": "1919",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schmetterer/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "near Vienna, Austria",
  "biografia": "Leopold Schmetterer\n's father, also named Leopold Schmetterer, worked for an insurance firm. His mother was Gisela Busch and it was mainly through her efforts that Leopold survived when a baby during a period of extreme hardship and poverty. He attended primary school from the age of five, going on to study at the Hamerling\nGymnasium\nin Vienna. He became interested in mathematics when he was about twelve years old, his interest beginning when he read a book on analysis which defined logarithms of complex numbers. Because his family was poor, they could not afford to buy him mathematics books, which were expensive, but he still managed to find and read books on algebra and calculus. At the Gymnasium he showed his outstanding talents, not only for mathematics but also for Latin and music. Musical talents ran in the family, with an uncle and a brother also being very musical. He graduated with distinction from the Hamerling Gymnasium in\n1937\n. He then studied at a teacher training college in Vienna qualifying on\n30\nMay\n1938\n. The political chaos in Austria in\n1938\nmeant that teaching positions were not available so he entered the University of Vienna in the winter semester of\n1938\nto study mathematics, physics and meteorology.\nSchmetterer attended lectures by Wolfgang Gröbner, Hans Hornich, Karl Mayrhofer and Karl Strubecker. He formed a close friendship with\nEdmund Hlawka\nwho was an assistant\n[\n4\n]\n:-\nI frequently had the opportunity to discuss mathematical problems with\nHlawka\n. Even in his early time he was a man who was able to fascinate young students.\nThe university had few students during the war years, and most of them were women. Schmetterer continued to study for his doctorate with Nikolaus Hofreiter, who had been a student of\nFurtwängler\n, as his advisor and on\n12\nJuly\n1941\nhe was awarded his doctorate for the thesis\nApproximation komplexer Zahlen durch Zahlen\nK\n(\ni\n√\n11\n)\nK (i√11)\nK\n(\ni\n√\n1\n1\n)\nⓉ\n(\nApproximation of complex numbers by numbers K\n(\ni√\n11)\n)\n[\n4\n]\n:-\nMy thesis was concerned with diophantine approximation, at that time an important part of number theory. The great influence of\nFurtwängler\nremained for a long time in the Mathematical Institute in Vienna.\nSchmetterer had been a research assistant from October\n1940\n, but in September\n1941\n, after the award of his doctorate, he had to undertake military service. He served in the Air Force until October\n1943\nwhen he was allowed a short holiday and returned to the Mathematical Institute in Vienna. In February\n1944\nhe was sent to the Henschel aircraft factory in Berlin where he worked as a mathematician on aircraft construction. He\n[\n4\n]\n:-\n... was mostly concerned with differential equations in the field of aerodynamics.\nIt is interesting to note that this work brought him into contact with the computer pioneer Konrad Kuse.\nAfter the war ended he spent several weeks in an American internment camp, then was able to return to his assistantship in the Mathematical Institute in Vienna. One advantage of working in the Henschel aircraft factory was the fact that he had to use\nFourier series\n, and now back in the Mathematical Institute he began to study these series more deeply.\nJohann Radon\nwas appointed to Vienna in\n1946\n, and he influenced strongly the direction of Schmetterer's research. On\n21\nApril\n1947\nSchmetterer married Elisabeth Schaffer who had been a mathematics student: they had four children, sons George\n(\nborn\n1948)\n, Victor\n(\nborn\n1951)\nand Leopold\n(\nborn\n1964)\nand a daughter Eva\n(\nborn\n1955)\n. In\n1949\nhe obtained the right to teach in universities after submitting his\nHabilitation\nthesis\nÜber die Approximation gewisser trigonometrischer Reihen\nⓉ\n(\nOn the approximation of certain trigonometric series\n)\non the theory of trigonometrical series.\nSchmetterer's interests turned towards probability. He explained in\n[\n4\n]\nhow this came about:-\nIn\n1948\nI was asked by the mathematicians in Vienna to give lectures in\nprobability theory\n... The reason was that an old professor of astronomy retired. He had lectured in the field of probability from a standpoint of the theory of errors. ... I did not know anything about probability at this time. So I had to work very hard to be able to instruct students in this field. One year later I was asked by the Technical University in Vienna to give lectures in mathematical statistics ... I did not know anything about mathematical statistics and again I had a very hard time to be able to give lectures in this field which was already very well developed in many countries outside Austria.\nThe outcome of this teaching was Schmetterer's book\nEinführung in die mathematische Statistik\nⓉ\n(\nIntroduction to Mathematical Statistics\n)\n(1956)\n.\nHarald Cramér\n, reviewing the text, writes:-\nAs the author states in his Preface, the lack of a modern text-book on Mathematical Statistics in the German language has made itself felt in an unfortunate way. The present book has grown out of the author's lectures at the University and the Technological Institute of Vienna. It begins with an introductory chapter on Mathematical Probability, well and clearly written though, as the author points out, not designed to give a completely rigorous mathematical treatment. ... As the author states, he is mainly concerned with those classical branches of Mathematical Statistics associated with the names of\nFisher\n,\nPearson\nand, above all,\nNeyman\n. ... The treatment is clear and accurate, and takes account of recent developments in statistical theory.\nIt is worth noting that a second German edition appeared in\n1966\n, an English translation in\n1974\n, and a Russian translation in\n1976\n.\nOn\n10\nAugust\n1955\nhe was appointed extraordinary titular professor at the University of Vienna. Then he received an offer of a Chair of Mathematics with special emphasis on mathematical statistics at the University of Hamburg. He took up this post in Hamburg on\n1\nOctober\n1956\n, when he was also appointed Director of the Institute of Mathematical Statistics. Realising that Hamburg had large insurance companies which wanted links with his professorship, he gave an inaugural lecture\nGrundlagen und Probleme der mathematischen Statistik\nⓉ\n(\nFundamentals and problems of mathematical statistics\n)\nwhich looked at stochastic processes relevant to risk theory.\nHamburg at this time contained a host of leading mathematicians, and Schmetterer's colleagues included\nHelmut Hasse\n,\nHeinrich Behnke\n,\nWilhelm Blaschke\n,\nErnst Witt\n,\nEmil Artin\n,\nEmanuel Sperner\n,\nLothar Collatz\nand\nHans Zassenhaus\n. The famous algebraists in this group were a major influence on Schmetterer who attended lectures by\nArtin\nand started research on probability on algebraic structures. He spent the academic year\n1958\n-\n59\nas a research professor at the University of California at Berkeley. Although he enjoyed his year at Berkeley, he turned down the offer of a permanent post there on the grounds that he did not wish to live permanently in the United States. This was not the first offer he had received and rejected.\nRadon\nhad died in\n1956\n, the year Schmetterer took up his appointment at Hamburg, and in\n1957\nSchmetterer was offered the chair in Vienna to succeed\nRadon\n. He turned this down, as he did an offer from Cologne in\n1958\n. However Vienna again made him an offer in\n1960\nand this time he accepted, taking up the appointment in the following year\n[\n4\n]\n:-\nAmong other reasons, this was due to the fact that all my family, or let me say my parents and the parents of my wife, all stayed in Vienna.\nSchmetterer was elected to the\nGerman Academy of Sciences Leopoldina\nin\n1970\n, to the\nAustrian Academy of Sciences\nin\n1971\n, to the Academy of Sciences of Saxonia in\n1983\nand to the Academy of Sciences of Bavaria in\n1984\n. He served as secretary general of the\nAustrian Academy of Sciences\nfrom\n1975\nto\n1983\n. He received many prizes and honours, including the\nBoltzmann\nprize, the\nSchrödinger\nprize of the\nAustrian Academy of Sciences\n, the Medal of Merit Leopoldina as well as an honorary degree from the University of Clermont-Ferrand.\nIn\n1990\nSchmetterer retired. His lack of nourishment as a baby caused him eyesight problems which became progressively worse. It his later years he continued to take part fully in the mathematical life of the Institute, despite being unable to read what was written on the blackboard.\nHis death in\n2004\nwas tragic. He was out walking with his wife and, due to his blindness, she was leading him by the arm in their usual manner. However, she fell and, in order to get help, Schmetterer flagged down a passing car and asked the driver to take him to the nearest village to get assistance. He climbed in the car which set off but minutes later it was hit by a train on an unsafe railway crossing.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Statistics"
  ]
}