{
  "nome_completo": "Leopold Alexander Pars",
  "nome_curto": "Leopold Pars",
  "ano_nascimento": "1896",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pars/",
  "lugar_nascimento": "Whittlesford (8km south of Cambridge), England",
  "lugar_morte": "Acton, England",
  "biografia": "Leopold Pars\n' parents were Laura Unwin and Albertus McLean Pars. Albertus worked as an accountant for a firm who manufactured farm machinery, but the great love of his life was music. He was an excellent pianist but also regularly played the church organ. Somewhat confusingly, Leopold was known to his friends as Alan from his university days onward, but his family always called him Leo. Although we shall call him \"Pars\" through most of this biography, nevertheless we shall sometime refer to him as \"Leopold\" and on the odd occasion as \"Alan\". Leopold had a sister Dora who was four years older than he was, and the other member of the household was Aleathea Starling who not only was nursemaid to the two young children but also looked after the family home.\nHis schooling took place in London after his family moved to Shepherd's Bush in\n1899\nwhen Leopold was three years old. In fact their house in Shepherd's Bush remained home to Albertus and Laura, together with their two children and Aleathea, until\n1926\nwhen they moved to a new home in Acton. This then became home to all five for the rest of their lives. Leopold was educated at Latymer Upper School in Hammersmith where, in addition to his academic work, he took part in sport, particularly in athletics. In December\n1914\nhe won a Foundation Scholarship in Mathematics and Physics to study at Jesus College, Cambridge. He entered Jesus College to begin his studies in October\n1915\nbut, after missing two terms through ill health, he waited until\n1917\nbefore he sat Part I of the Mathematical Tripos. Despite his ill health, Pars continued to take part in athletic events at University and won the Mile in the inter-University sports. Despite the ill health which affected him throughout his undergraduate days, he produced outstanding results.\nAlan, as Pars became known when he was an undergraduate, then took a London University M.Sc. and, in\n1921\n, he was the First Smith's Prizeman at Cambridge. His prize essay was entitled\nVector and\nTensor\nFields\nand was in two parts. Part\n1\nwas\nGeometrical Vector Theory and the Restricted Principle of Relativity\nand Part\n2\nwas\nOn the General Theory of Relativity\n. On the strength of this work he was awarded a Fellowship at Jesus College in\n1921\nwhich he held for\n64\nyears\n[\n1\n]\n:-\nPars never married, and the bachelor quarters he occupied in college were among the rooms most frequented by undergraduates. They could hardly fail to be charmed by his friendly interest in their activities, astounded by his wide knowledge range of exact quotation, and delighted by his knowledge of and enthusiasm for the theatre - though latterly few may have been aware of his earlier skill as a mountaineer.\nAppointed Praelector in\n1923\n, he held this post, which made him responsible for presenting the undergraduates for their degrees, until\n1946\n. He was appointed Director of Studies for mathematics at Jesus College in\n1925\n, and a University Lecturer in\n1927\n. He remained in the first of these roles until\n1951\n, and in the second until\n1961\nwhen he retired. He became President of Jesus College in\n1958\nand was a founder member of the Department of Applied Mathematics when it was set up in\n1959\n. His only extended time away from Cambridge during his career was when he took study leave for one year. He spent the academic year\n1948\n-\n49\nat the Institute for Advanced Study at Princeton and at the University of California at Berkeley.\nPars's first publications, influenced by\nLarmor\nand\nEddington\n, were on relativity and were part of his prize essay. Thereafter he published little, although he did publish two valuable textbooks,\nIntroduction to dynamics\nin\n1953\nand\nCalculus of variations\nin\n1962\n, until he published a monumental\n650\npage work\nTreatise on analytical dynamics\nin\n1965\n. This book, published\n4\nyears after he retired, was his life work in a single book.\nA colleague, writing after Pars's death, described the book in these terms:-\nA Treatise on Analytic Dynamics is a massive, scholarly, systematic\n650\n-page survey of the classical canon of mathematical dynamics. It is an exposition of enormous elegance, rigour and clarity, honed by decades of teaching undergraduate Tripos candidates and broadened by a perspective which encompassed all the major developments in dynamics from\nGalileo\nto the mid-twentieth century. Within its context it is a pedagogical masterpiece.\nPars's aim in writing the book is described in\n[\n2\n]\nas:-\n... to give a compact, consistent and reasonably complete account of the subject as it then stood. He based his treatment on the theorem of\nLagrange\nthat he called the fundamental equation, which he proceeded to translate into six different forms, each exploited in appropriate contexts.\nPars devoted much of his life to teaching, which explains his relatively small research output, and so it will come as no surprise that someone so devoted to teaching undergraduates should be an expert\n[\n1\n]\n:-\nHe was a teacher and lecturer of great skill and clarity whose range ... was beyond the reach of most of his younger colleagues in the faculty.\nAfter retirement from teaching he remained as President of Jesus College until\n1964\n. On leaving this role he visited the Florida Atlantic University, the University of Sydney, and his travels took him to visit friends in Trinidad, New Zealand, Tasmania and Uganda. Although after retirement he lived at his home in Acton with his sister Dora, he continued to make visits to exotic places but retained his connection with Jesus College where he kept his College rooms. He dined there frequently and remained on the College Council until the end of his life\n[\n2\n]\n:-\n[\nHe\n]\nwas a familiar sight in Cambridge, taking his regular afternoon constitutional in his characteristic attitude with eyes downcast and walking stick raised behind.\nWe have mention above some of Pars' interests outside mathematics such as mountaineering anf the theatre. Like his father he had a great love of music and, also like his father, he played the piano. As Taunt writes in\n[\n2\n]\n:-\nThough by no means an eccentric, he was a great Cambridge character, a survivor of an era which is passing from living memory.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}