{
  "nome_completo": "Leslie Bennet Craigie Cunningham",
  "nome_curto": "Leslie Cunningham",
  "ano_nascimento": "1895",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cunningham_Leslie/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Middlesex, England",
  "biografia": "Leslie Cunningham\n's mother was Jane Craigie. He had an older sister Margaret\n(\nborn about\n1887)\n.\nHe entered The Edinburgh Academy in\n1903\n, at the age of eight, and after spending three years there, according to\n[\n1\n]\nhe entered Sedbergh School, Yorkshire, in\n1906\n. However, the matriculation records which he completed at the University of Edinburgh\n(\nin\n1913)\nshow that he spent three years at St Mary's, Melrose, after leaving The Edinburgh Academy, before attending Sedbergh School.\nHe began his studies at Edinburgh University in\n1913\nand in session\n1913\n-\n14\nhe studied Mathematics, Natural Philosophy, and Chemistry. However, at this point in his education, World War I began and Cunningham put his studies on hold, joining the King's Own Scottish Borderers. In the later part of the war he served with the Royal Engineers.\nOnly in\n1920\ndid Cunningham return to Edinburgh University to resume his studies after a six year gap. He was awarded an M.A. with Honours in Mathematics and Natural Philosophy in\n1923\nand was awarded a B.Sc. in the same year. He graduated on\n17\nJuly\n1924\n. He then took up employment as Education Officer in the Royal Air Force after graduating.\nAs Education Officer, Cunningham taught mathematics at a fairly low level. But he also engaged in mathematical research with military applications and, on\n4\nJuly\n1930\n, was awarded a Ph.D. from the University of Edinburgh for a thesis on the trajectory of a falling bomb entitled\nThe motion of an Aircraft Bomb in the Attenuated Atmosphere\n.\nIn\n1936\n, whilst at the Royal Aircraft Establishment he patented the Gyro gunsight, produced by Ferranti and immediately used by both the RAF and USAF and eventually used in the Spitfire. He also worked on position-finding equipment based on mathematical predictions\n(\na precursor to radar\n)\n.\nDuring World War II he was Superintendent of the Air Warfare Analysis Section, Ministry of Aircraft Production and he was given the rank of Honorary Squadron Leader.\nLeslie Cunningham was a member of the\nEdinburgh Mathematical Society\n, joining in March\n1925\nwhen he was living in Buckingham Terrace, Edinburgh. He was elected to the\nRoyal Society of Edinburgh\non\n5\nMarch\n1945\n, his proposers being\nSir Edmund T Whittaker\n,\nEdward T Copson\n,\nDavid Gibb\n,\nAlexander C Aitken\n.\nAn obituary, written by\nJ M Whittaker\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1947\n, pages\n18\n-\n19\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nHe was honoured with the award of an O.B.E.\nIn\n1946\n, the year of his death, Cunningham published the paper\nRandom processes in problems of air warfare\nin collaboration with W R B Hynd in\nJ. Roy. Statist. Soc\n.\nW Feller\nreviewed the paper and we give an extract from his review:-\nSeveral applications of the theory of stochastic processes are described of which the following is typical. In anti-aircraft gunnery an automatic predictor predicts the position of the target at any future date. The prediction is based on data, provided by a radar set, where random errors are superimposed upon the true values. The various harmonic components of the error are magnified by factors which are functions of their frequencies. To select an optimum predictor the error spectrum of the particular radar set must be investigated. In normal practice the errors are smoothed, but an analysis shows that smoothing may introduce large new errors and that only high frequency components of the tracking errors can be practically eliminated. In the analysis the predictor is considered as a linear device and is characterized by its response to the so-called\nHeaviside\nimpulse function. The spectrum of a random process is obtained in the now usual way from the\nFourier\ntransform of the correlogram.\nThe last section\n[\npp.\n81\n-\n85]\ndescribes a relay-machine constructed for the Ministry of Aircraft Production\n(\ndesigned and constructed by Weir and Barnes\n)\n...",
  "math_areas": [
    "Analysis"
  ]
}