{
  "nome_completo": "Leslie Fox",
  "nome_curto": "Leslie Fox",
  "ano_nascimento": "1918",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fox_Leslie/",
  "lugar_nascimento": "Dewsbury, Yorkshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Leslie Fox\n's mother was Annie Vincent and his father was Job Senior Fox who was a coalminer. Leslie won a scholarship to the Wheelwright Grammar School in Dewsbury where he became interested in mathematics through excellent mathematics teaching at the school. He won a scholarship to study mathematics at Christ Church, Oxford, and entered the University in\n1936\n.\nAt Oxford, Fox was highly successful in his mathematical studies but also took a full part in university life. Not only did he play football for the university Football Club but he also played for Oxford City Football Club. He was awarded First Class Honours in Mathematics in\n1939\nand continued to undertake research in the engineering department under Richard Southwell. Although working for his DPhil in computational and engineering mathematics, Fox was also engaged in highly secret war work. We should note that Fox was undertaking numerical work solving partial differential equations which arose in engineering problems but which could not be solved by analytic techniques. However at this time no electronic computers were in use and Fox had to undertake the numerical calculations using a desk calculator. It was therefore extremely important to develop methods which would yield accurate results with the minimum of computation.\nAlthough Fox produced a considerable amount of material which was publishable, the secret nature of his work in a wartime environment meant that most of his early work was either not published, or at least publication was delayed until after the end of the war. His paper\nRelaxation methods applied to engineering problems\nwritten jointly with Richard Southwell appeared in\n1945\n. After the award of his doctorate in\n1942\nFox joined the Admiralty Computing service. He married Pauline Helen Dennis on\n10\nJuly\n1943\n; they had no children. In\n1945\nhe went to work in the mathematics division of the National Physical Laboratory. As well as his mathematical work, which we describe below, Fox continued his sporting interests\n[\n1\n]\n:-\nAt the National Physical Laboratory he was club tennis champion and captain of the cricket team, and distinguished himself as a sprinter in the civil service championships.\nAt both the Admiralty and the National Physical Laboratory he became involved in the computation of special functions and also in the production of tables which were important at that time. For example the National Physical Laboratory published Fox's\nThe use and construction of mathematical tables\nin\n1956\n. This work surveys interpolation methods which might be used by someone, with access to mathematical tables, who has to do the computations with a desk calculator. Fox was keen to establish rapid convergence for the methods used, describing the auxiliary quantities needed in the table in order to carry out the interpolation.\nDuring this period he continued to publish on the relaxation methods which he had begun studying while at Oxford. For example he published\nSome improvements in the use of relaxation methods for the solution of ordinary and partial differential equations\n(1947)\n,\nA short account of relaxation methods\n(1948)\n, and\nThe solution by relaxation methods of ordinary differential equations\n(1949)\n. He left the National Physical Laboratory in\n1956\nand spent a year at the University of California. In\n1957\nFox took up an appointment at Oxford University where his task was to set up a Computing Laboratory\n[\n6\n]\n:-\nHe saw clearly that there would be a need to educate the next generation of mathematicians in computational work, and he took up his new post in the University with energy and enthusiasm.\nIn\n1963\nFox was appointed as Professor of Numerical Analysis at Oxford also being elected to a professorial fellowship at Balliol College. He contributed in many ways to promoting numerical analysis, for example in running summer schools, in developing links to industry, forming links with schools through the\nMathematical Association\n, and with the writing of a wonderful series of books on the subject. His first book appeared in print in the year in which he was first appointed to Oxford, namely\n1957\n. This book was\nThe numerical solution of two-point boundary problems in ordinary differential equations\nand it is a great tribute to his expository skills that it was reprinted by\nDover Publications\nin\n1990\n. The book summarises at an elementary level the methods for numerical construction of the solutions of boundary-value problems which can be expressed in terms of ordinary differential equations of orders one to four. Z Kopal, reviewing the book, writes:-\nThe book is well organized and printed, and its leisurely discursive style facilitates its reading for the non-initiated.\nFox published\nAn introduction to numerical linear algebra\nin\n1964\n. It contains chapters on: Matrix algebra; Elimination methods of\nGauss\n,\nJordan\n, and\nAitken\n; Compact elimination methods of Doolittle, Crout,\nBanachiewicz\nand\nCholesky\n; Orthogonalization methods; Condition, accuracy and precision; Comparison of methods, measure of work; Iterative and gradient methods; Iterative methods for latent roots and vectors; and Notes on error analysis for latent roots and vectors. In\n1968\nhe published\nChebyshev polynomials in numerical analysis\nin collaboration with I B Parker. The authors write in the Preface that:-\nThe audience we have in mind includes mathematical undergraduates in their early years ... The material might also be used in the numerical analysis part of diplomas in computation, and perhaps also by scientists, with a reasonable mathematical training ...\nThis was not the only book Fox published in\n1968\nfor he also published\nComputing methods for scientists and engineers\nthis time collaborating with D F Mayers. With a practical yet rigorous approach, methods to investigate topics such as recurrence relations, zeros of polynomials, linear equations, eigenvalues and eigenvectors, approximations, interpolation, integration, and ordinary differential equations are described and analysed.\nAnother collaboration between Fox and Mayers led to\nNumerical solution of ordinary differential equations\npublished in\n1987\n, four years after Fox retired. The authors write in the Preface:-\nThough there are two main types of ordinary differential equations, those of initial value type and those of boundary value type, most books until quite recently have concentrated on the former, and again until recently the boundary value problem has had little literature. Very few books, even now, treat both problems between the same two covers, and this book, which does this in quite an elementary way, must be almost unique in these respects.\nIn addition to these outstanding texts, Fox continued to produce top quality research articles.\nSome numerical experiments with eigenvalue problems in ordinary differential equations\n(1960)\nconsiders methods for solving such equations using a computer.\nPartial differential equations\n(1963)\nis summarised by Fox as follows:-\nThis expository paper discusses the present state of our ability to solve partial differential equations. It considers the success achieved in the production of new techniques, machine-oriented techniques, error analysis, mathematical theorems and the solution of practical problems, and contrasts this with corresponding work in the field of linear algebra. Outstanding problems include a determination of the error of finite-difference approximations, the automatic machine production of finite-difference formulae in complicated regions, the smoothing of physical data, and the classification of equations for computing-machine library routines.\nSome of his later papers examine numerical methods for factorising polynomials, for solving elliptic partial differential equations, and methods for treating singularities in boundary value problems. In a survey paper\nFinite-difference methods for elliptic boundary-value problems\n(1977)\nFox writes:-\n... there are a surprising number of new developments, in economic direct methods ... ,  strongly implicit iterative and factorization methods ... , and in the treatment of nonlinear problems ...\n[\nWe give\n]\na short account of recent attempts at mechanization of some of the efforts at acceleration devices of the original 'relaxation workers', and ... attempt some evaluation of the present state of the art with recommendations for future work.\nHis retirement in\n1983\nwas earlier than it might have been since to suffered a heart attack in\n1981\nand after this, although making a rapid recovery, decided to leave his official duties earlier than was necessary. He was made an emeritus fellow of Balliol on his retirement and continued to be involved with academic affairs as well as continuing his research. One of his last papers was\nEarly numerical analysis in the United Kingdom\npresented to a conference on the history of scientific computing held at Princeton in\n1987\n.\nWe mention that Fox had been divorced from his first wife early in\n1973\nand had remarried Clemency Mary Holme Clements on\n20\nJuly\n1973\n. We also note two further aspects of Fox's career. One is his association with NAG, the Numerical Algorithms Group. Fox's laboratory at Oxford was one of the founding organisations of NAG in\n1970\nand he strongly encouraged the development of the group, offering considerable resources from his own Computing Laboratory. He was the Oxford representative on NAG until the year following his retirement. The second aspect we mention is Fox's association with the Institute of Mathematics and its Applications. He served on its council and as editor of its journal until he became editor of its\nJournal of Numerical Analysis\nwhen it started publication in\n1981\n. The Institute of Mathematics and its Applications held a symposium in\n1983\nto mark his retirement and elected him an honorary fellow in\n1989\n.\nFox, who had enjoyed trouble free health up to\n1981\n, continued to suffer from heart problems during his retirement. He died from a ruptured aneurysm in the John Radcliffe Hospital, Oxford. His character is described in\n[\n1\n]\nas follows:-\nThroughout his life Fox remained true to his roots, a forthright socialist and above all a Yorkshireman.\nIn\n[\n6\n]\nthe authors write:-\nHis friendships and contacts were very wide, and he was excellent company in many different surroundings.\nAn indication of the high regard he was held in by his friends and colleagues is the enthusiastic response to support the creation of a Leslie Fox Prize for Numerical Analysis. The Institute of Mathematics and its Applications organises the award of the prize, setting topics for the competition which continues to attract entrants of the highest quality from around the world.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}