{
  "nome_completo": "Lester Randolph Ford",
  "nome_curto": "Lester R Ford",
  "ano_nascimento": "1886",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ford/",
  "lugar_nascimento": "Rich Hill, Bates, Missouri, USA",
  "lugar_morte": "Charlottesville, Virginia, USA",
  "biografia": "Lester R Ford\nwas educated at Missouri State Normal School\n(\nfrom which he graduated Pd.B., that is Bachelor of Pedagogy\n)\nand then attended Missouri State University. He graduated with an A.B. in\n1911\n, then continued to study for his Master's Degree.\nHe was awarded a Master's Degree from The Department of Mathematics in the University of Missouri-Columbia in\n1912\nwith a dissertation on\nPoint-wise Discontinuous Functions\n. He then undertook research at Harvard with\nMaxime Bôcher\nas his advisor, graduating M.A. in\n1913\n. From\n1914\nhe lectured at the University of Edinburgh in Scotland, where he was appointed as Junior Lecturer in Mathematics following the death of John Urquhart. The following article appeared in an Edinburgh student magazine called\nThe Gambolier\n[\n2\n]\n:-\nIt is not often we fill up vacancies in, or augment the staff of, our University from across the Atlantic. It is in fact rather to us that America appeals when she requires a particularly brilliant or competent man for one of her educational institutions. Not a few of our very best men have gone over there and have stepped into professorships right away. Such a state of affairs says a great deal for the general efficiency of our teaching staff, and the fact that on this occasion we have gone to the United States for our new lecturer in Mathematics implies exceptional brilliancy in the gentleman who has been chosen.\nMr Lester R Ford, the lecturer in question, was appointed in succession to the late John Urquhart, M.A., whose sudden and lamented death during summer vacation, it was our melancholy duty to record in the first issue of 'The Gambolier' of the present session.\nMr Ford, like the proverbial nation, is happy in the fact that he has no history. So far as we have been able to discover, he has never killed a man, or broken into a bank, or even attempted to commit suicide, but he has succeeded since\n1886\n, when he first launched upon this troubled sea of life, in amassing a collection of weird degrees, and a still more weird collection of mathematical lore which he is now busy shovelling into the skulls of not too enthusiastic students.\nMr Ford was born in the State of Missouri, U.S.A., and the greater part of his education was acquired in that State. At the Missouri State Normal School he commenced his triumphant course of Academic honours by graduating Pd.B., which being interpreted, means Bachelor of Pedagogy. From that seminary, he passed to the Missouri State University, in which he graduated A.B. in\n1911\n, and A.M. in\n1912\n. He then proceeded to Harvard University where he spent two years, graduating M.A. in\n1913\n, and winning a Fellowship entitling him to study abroad. And here he is, and glad indeed we are to welcome him as a teacher in our University.\nMr Ford does not boast of any prowess as a sportsman unless Chess can be placed in that category. After Mathematics, Chess is his hobby, and he played that game in the Harvard Chess Team. Whether the great American University confers a \"blue\"  for proficiency in that game or not, we do not know, but we have no doubt that our new lecturer deserved one at least. As a man Mr Ford with his kindly welcoming smile and genial disposition, is a great acquisition to our Alma Mater, and as he has already expressed a liking for the city in which his present home is situated, we trust we shall long be able to keep him in our midst.\nIt was during his period in Edinburgh that he joined the\nEdinburgh Mathematical Society\nin December\n1914\n. Ford read the paper\nOn the Roots of a Derivative of a Rational Function\nto the meeting of the Society on Friday\n14\nMay\n1915\n, the paper\nOn the Oscillation Functions derived from a Discontinuous Function\nto the meeting on\n11\nJune\n1915\n, and the paper\nA method of solving algebraic equations\nto the meeting on\n12\nJanuary\n1917\n.\nHe published\nAn introduction to the theory of automorphic functions\nas an\nEdinburgh Mathematical Tract No\n6\nin\n1915\n.\nA C Dixon\nwrites in a review:-\nIt will be easily understood that any one writing a tract of ninety pages on a subject with such wide ramifications must choose between undue compression and judicious compression. Mr Ford has chosen the latter, and has devoted most of his space to a careful treatment of introductory matters, thereby probably making his book more useful; for the student who wishes to go further, he has provided a very full bibliography.\nFord read a paper to the\nEdinburgh Mathematical Society\nOn a class of continued fractions\nat the second meeting of the\n1916\n-\n17\nsession. Ford returned to the United States and completed work for a doctorate at Harvard University. He was awarded his doctorate in\n1917\nfor his thesis\nOn Rational Approximations to an Irrational Complex Number\n. A major paper based on his thesis\nRational approximations to irrational complex numbers\nwas published in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1918\n. The paper, submitted in\n1917\n, gives Ford's address as The University of Edinburgh. In\n1919\nhe published\nElementary Mathematics for Field Artillery\nwhich was prepared and published by direction of the Chief of Field Artillery, Field Artillery Central Officers' Training School, Camp Zachary Taylor, Kentucky. It was an extremely useful course:-\nAbout\n15\n000\nstudents took the course in the three months prior to the signing of the armistice. The staff of instructors, recruited chiefly from the candidates who had mathematical training, was ordinarily well over a hundred, and at one time numbered as many as one hundred sixty-nine.\nSee\nTHIS LINK\nfor an interesting review of the book.\nFollowing his contributions to the war effort, Ford joined the faculty at the Rice Institution, Houston, Texas and while there he published papers such as\nOn the closeness of approach of complex rational fractions to a complex irrational number\n(1925)\n,\nThe Solution of Equations by the Method of Successive Approximations\n(1925)\n,\nOn motions which satisfy Kepler's first and second laws\n(1927\n/\n28)\n, and\nThe limit points of a group\n(1929)\n. He married Marguerite Eleanor John\n(\nborn on\n26\nJanuary\n1890\nto Robert A John and Margaret Houston Morrow\n)\non\n15\nJune\n1924\n; their children include Lester Randolph Ford\n(\nborn on\n23\nSeptember\n1927\nin Houston\n)\n, and Margaret Houston Ford\n(\nborn\n3\nSeptember\n1930)\n. Lester Randolph Ford, Jr went on to become an outstanding mathematician who worked for the RAND Corporation.\nTwo significant books published by Ford are\nAutomorphic Functions\n(1929)\nand\nDifferential Equations\n(1933\n, second edition\n1955)\n.\nSee reviews at\nTHIS LINK\nfor\nDifferential Equations\nand\nTHIS LINK\nfor\nAutomorphic Functions\n.\nIn addition to his work on point-wise discontinuous functions which we mentioned above, Ford is best known for an \"absolutely marvellous geometric interpretation of the Farey series\". This geometric interpretation came from his introduction of Ford circles. He introduced the concept in a\n1938\narticle called \"Fractions\"\n[\nFord, L R\n(1938)\nFractions.\nThe American Mathematical Monthly\n. Vol.\n45\n, No.\n9\n, pages\n586\n-\n601]\n.\nIn the late\n1930\ns Ford moved from the Rice Institute to the Armour Institute of Technology in Chicago, Illinois where he was appointed Professor and Chairman of the Department of Mathematics. In\n1940\nthe Armour Institute of Technology merged with the Lewis Institute\n(\nwhich had been founded in\n1896)\nto form the Illinois Institute of Technology. He had gained a reputation as an excellent expositor and he wrote outstanding articles as well as contributing many mathematical problems and solutions.\nFrom\n1942\nto\n1946\nFord was editor of the\nAmerican Mathematical Monthly\n. When he completed five years of service he wrote\nRetrospect\n(\nAmer. Math. Monthly\n53\n(10)\n(1946)\n,\n582\n-\n585)\nin which he described the experience. He wrote:-\nThis is the last issue of the MONTHLY to appear under my editorship. As I pause and look back over the past five years and while the details are fresh in my mind, it seems appropriate to relate for the readers something of the story of this eventful period. My editorship has spanned the war years. The Japanese attack on Pearl Harbor occurred while the first issue was being set into type. We are reading proof on the last number while treaties of peace are being debated in a broken world. The four dozen issues between them were produced amidst all sorts of difficulties engendered by the war. If the editor who took up his duties so light-heartedly five years ago could have foreseen the future, would he have recoiled from the task? I am not sure.\nFor the full text of Ford's article on his editorship see\nTHIS LINK\n.\nThe next major role played by Ford was that of President of the\nMathematical Association of America\nfrom\n1947\nto\n1948\n. Having played such a leading part it is not surprising that many wished to mark is seventieth birthday with a mathematical tribute. It came with the following dedication:-\nOctober\n25\n,\n1956\n, was the seventieth birthday of Lester R Ford, President of the\nMathematical Association of America\n(1947\n-\n1948)\n, editor of the AMERICAN MATHEMATICAL MONTHLY\n(1942\n-\n1948)\n. In the spring of\n1956\n, some of the numerous friends and former students of Dr Ford decided to dedicate papers to him on this occasion as tokens of their appreciation and friendship. The collection of manuscripts was presented to Dr Ford on his birthday by Drs W L Duren, Jr,\nKarl Menger\n, and\nG T Whyburn\n. Some of the papers are related to the fields of Ford's major interests: complex functions, interpolation, differential equations, and numerical analysis. Other papers were inspired by remarks that Ford made in talks and lectures. Still others have to do with Ford's former activity as editor of the MONTHLY, where he started the series of papers with the titles \"What is ... ?\"\nIn this number of the\nSlaught\npapers, the papers dedicated to Dr Ford are arranged alphabetically according to the authors' names. All authors are united in the feeling expressed in the final remark contained in the paper of\nG T Whyburn\n.\nKarl Menger\n, Gordon Pall\nSuch was his contribution to mathematics that the Lester R Ford Award was established in\n1964\nto recognize authors of articles of expository excellence published in\nThe American Mathematical Monthly\nor\nMathematics Magazine\n. From\n1975\nonwards a separate award was set up for articles appearing in the\nMathematics Magazine\nso from then on the Lester R Ford Award applied only to papers appearing in\nThe American Mathematical Monthly\n. The awards are for $\n500\nand up to five are given annually at the Summer Meeting of the\nMathematical Association of America\n. The following description of the fund was published some time after it was set up:-\nTHE LESTER R FORD FUND\nTo honour the late Professor Lester R Ford, the Association has established a fund to be known as the Lester R Ford Fund to replace the fund previously carried in the Treasurer's records as the Fund Established by an Anonymous Donor.\nThe capital of this fund consists of contributions made by Professor Ford during his lifetime which have been listed anonymously at his request, a bequest in his will, and by gifts made in his memory by his family and friends. It is expected that the principal of the fund will be about $\n25\n,\n000\n.\nFormer colleagues and students of Professor Ford may wish to contribute to the fund. Payments should be sent to the MAA Buffalo office marked for the Lester R Ford Fund. Since the Association is a non-profit organization, all such gifts are deductible for income tax purposes.\nIncome from the Ford Fund will be used for payment of the Ford Awards to authors of expository articles published in the MONTHLY and MATHEMATICS MAGAZINE\n(\nsee this MONTHLY, Aug.-Sept.\n1967\n, p.\n908)\n, and for such publication and other purposes as may be voted by the Board of Governors.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}