{
  "nome_completo": "Lev Genrikhovich Shnirelman",
  "nome_curto": "Lev Shnirelman",
  "ano_nascimento": "1905",
  "ano_morte": "1938",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shnirelman/",
  "lugar_nascimento": "Gomel, Belarus",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Lev Shnirelman\n's father was a school teacher. Lev showed remarkable abilities when he was still a young child and his parents quickly realised that he had outstanding abilities. These abilities are illustrated by the fact that he studied, in his own  home, the complete school course of mathematics between the ages of eleven and twelve. He entered the University of Moscow in\n1921\nat the remarkably young age of\n16\n. There he was taught by outstanding mathematicians such as\nKhinchin\n,\nLuzin\nand\nUrysohn\n. Shnirelman started research in algebra, geometry and\ntopology\nas a student but did not consider his results sufficiently important to merit publication. He was advised by\nLuzin\nwhile working for his postgraduate degrees.\nShnirelman was appointed to the chair of mathematics at the Don Polytechnic Institute in Novocherkassk in\n1929\n. Then, in\n1930\n, he returned to Moscow University but went to study at Göttingen in\n1931\n. The paper\n[\n4\n]\ndescribes his stay there based on two of his letters he wrote to his mother which are reproduced in\n[\n4\n]\n. After the Göttingen visit, he returned to Moscow to continue teaching at the University but, after election to the\nSoviet Academy of Sciences\nin\n1933\n, he worked at the Mathematical Institute of the\nAcademy\nbeginning in the following year. He was only\n33\nyears old when he died in\n1938\n, having made deep contributions to two quite separate areas of mathematics.\nThere is some doubt about how he died. According to\nPontryagin\n's autobiography\n[\n3\n]\nL A Lyusternik reported that Shnirelman gassed himself, probably because he was depressed that he could no longer prove results as good as the ones he had found earlier in his career. However, according to the\nE B Dynkin\n, in an interview he gave in\n1988\n[\n2\n]\nthe mathematician and historian Sofia Alexandrovna Yanovska reported that Schnirelman had been recruited by the NKVD\n(\nthe Soviet intelligence service\n)\nand was shot by them.\nL A Lyusternik became a friend and important collaborator with Shnirelman and together they made significant contributions to topological methods in the\ncalculus of variations\nin a series of paper written jointly between\n1927\nand\n1929\n. These include the three joint papers published in\n1929\n:\nSur un principe topologique en analyse; Existence de trois géodésiques fermée sur toute surface de genre\n0\nⓉ\n(\nOn topological principle analysis; Existence of three closed geodesics on any surface of genus\n0\n)\n; and\nSur le problème de trois géodésiques fermée sur les surfaces de genre\n0\nⓉ\n(\nOn the three geodesic problem on closed surfaces of genus\n0\n)\n. Also an important contribution to this topic is their joint paper\nTopological methods in variational problems\n(1930)\n. Youschkevitch writes\n[\n1\n]\n:-\nTheir starting point was\nPoincaré\n's problem of the three geodesics, which they first solved completely and generally by showing the existence of three closed geodesics on every simply connected surface\n(\nevery surface homeomorphic to a sphere\n)\n. For the proof of this theorem the authors used a method, which they broadly generalised, that had been devised by\nG D Birkhoff\n, who in\n1919\nshowed the existence of one closed geodesic. Shnirelman and Lyusternik also applied their \"principle of the stationary point\" to other problems of geometry \"im Grossen\". They also presented a new topological invariant, the category of point sets.\nIn\n1930\nShnirelman introduced important new ideas into\nnumber theory\n. Using these ideas of compactness of a sequence of natural numbers he was able to prove a weak form of the\nGoldbach conjecture\nshowing that every number can be written as a sum of at most\nC\nC\nC\nprimes where\nC\nC\nC\nis a definite number. He was able to show that\nC\nC\nC\n<\n300\n000\n. Later mathematicians have been able to find much better bounds for\nC\nC\nC\n. He presented these ideas in\nÜber additive Eigenschaften von Zahlen\nⓉ\n(\nOn additive properties of numbers\n)\npublished in\nMathematische Annalen\nin\n1933\n. Concerning this paper Halberstam wrotes over\n50\nyears later:-\n... Shnirelman had many more results and ideas than those that were eventually to find their way into the standard texts, and ... mathematicians might well find a visit to his classical memoir rewarding.\nIn a talk delivered at a meeting of the\nGerman Mathematical Society\non the morning of\n17\nSeptember\n1931\n, Shnirelman first reported on his now famous researches in additive number theory which were to be presented in the\n1933\npaper given above. His talk, given in German, appears in Russian translation in\n[\n3\n]\n.\nThe Goldbach conjecture\nthat every number is the sum of at most\n3\nprimes still appears to be open. Later significant contributions by Shnirelman include his two papers\nOn the additive properties of numbers\n, and\nOn addition of sequences\npublished in\n1940\nafter his death.\nI M Gelfand\n, in an interview on\n11\nJanuary\n1992\nat the Joint Mathematics Meetings in Baltimore, was asked \" Who was most influential on you as a young man?\"\nGelfand\nreplied \"Many people, but especially Shnirelman: A person must learn from everyone in order to be original.\"",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}