{
  "nome_completo": "Lev Davidovich Landau",
  "nome_curto": "Lev Landau",
  "ano_nascimento": "1908",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Landau_Lev/",
  "lugar_nascimento": "Baku, Azerbaijan, Russian Empire",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Lev Landau\n's mother, Lyubov Veniaminovna Harkavi\n(1876\n-\n1941)\n, had trained in medicine and she had undertaken work in physiology. She went on holiday to Switzerland with her friend Anna and met Anna's cousin, David Lvovich Landau\n(\nborn\n1866)\n. Both Lyubov and David were Jewish and they fell in love\n[\n81\n]\n:-\n[\nDavid Lvovich\n]\nwas a composed and restrained person, and never raised his voice;\n[\nLyubov\n]\nwas a bundle of energy, quick-tempered and excitable. But opposites are often compatible and complement each other.\nThey were married in\n1905\nand went to live in Baku where David Lvovich worked. He was a petroleum engineer with the Black Sea and Caspian Sea Stock Company who worked at the oil fields in Baku on the Caspian Sea. He was well-off and owned a six-room apartment in the centre of the city. Their daughter Sonya was born on\n8\nAugust\n1906\n, and their son Lyova\n(\nthe subject of this biography, known as Lev\n)\nin January\n1908\n. After the birth of her children, Lyubov Veniaminovna worked as a midwife and gynecologist then, from\n1911\n, was a physician in a girls' high school. After doing war service in\n1915\n-\n16\n, she worked as a teacher of natural sciences in the Baku Jewish High School. In addition to his work as an engineer, David Lvovich undertook research, wrote scientific papers and was a highly competent mathematician. He taught his son Lev mathematics from a young age. Both Sonya and Lev were very bright but very stubborn children.\nA Jewish high school opened in Baku in September\n1916\nand the eight year old Lev began his schooling there. The school was designed to teach Russian, Hebrew, and Biblical Studies to Jewish children but also taught a full range of other subjects. Lev was brilliant in science and mathematics but only mediocre in Hebrew and Yiddish. His fellow pupils described him at this time:-\nHe was a quiet, shy boy, although the manner in which he related to his classmates, and even to his teachers, was somewhat condescending.\nFrom his mother, Lev learnt French and German and quickly became fluent. He had piano lessons which he hated so he was soon allowed to stop these and study more mathematics. While Lev was at high school, the Russian Revolution took place. Lev was a staunch believer in Communist principles but, as we will see below, came to hate the Soviet leadership. His achievements at school were such that by the age of thirteen he had completed his secondary schooling and had the qualifications to enter university. Although calculus was not part of the school syllabus, Lev had studied this own topic his own and, later in life, would say that he could not remember a time when he was not proficient at differentiation and integration. His parents did not like the idea that he should begin his university studies a such a young age, and this was almost certainly a wise decision on their part. David Lvovich wanted his son to have a career in finance or administration so Lev was sent to Baku Economic Technical School for a year to delay his entry to university studies.\nLandau was still only fourteen years old when he entered Baku University\n(\nlater called the Kirov Azerbaijan State University\n)\nin\n1922\nand by this time he was already enthusiastic about mathematics, physics and chemistry. There he studied physics in the department of Mathematics and Physics but he also studied chemistry and, although he did not carry his studies of this topic any further through his university education, it remained one of his life-long interests. In\n1924\n, after two years at Baku University, he moved to the Leningrad State University, graduating in\n1927\n[\n66\n]\n:-\nIn Leningrad - that main centre of Soviet physics at the time - he first made the acquaintance of genuine theoretical physics, which was then going through a turbulent period. He devoted himself to its study with all his youthful zeal and enthusiasm and worked so strenuously that often he became so exhausted that at night he could not sleep because he was still turning over formulas in his mind. Later he used to describe how at that time he was entranced by the incredible beauty of the general theory of relativity\n(\nsometimes he even would declare that such a rapture on first making one's acquaintance with this theory should in general be a characteristic of any born theoretical physicist\n)\n. He also described the state of ecstasy to which he was brought on reading the articles by Heisenberg and Schrödinger signaling the birth of the new quantum mechanics. He said that he derived from them not only delight in the glamour of genuine science but also an acute realization of the power of the human genius, whose greatest triumph is that man is capable of apprehending things beyond the pale of his imagination.\nIn fact his first publication\nOn the Theory of the Spectra of Diatomic Molecules\nappeared in print in\n1926\n, while he was an eighteen year old undergraduate, and his second paper\nThe Problem of Damping in Wave Mechanics\nappeared in the year he graduated, being his first paper on quantum theory. He continued research at the Leningrad Physico-Technical Institute.\nIn\n1929\n, supported with a Rockefeller Foundation Fellowship, Landau set off for eighteen months of foreign travel, visiting Germany, Switzerland, Holland, England, Belgium, and Denmark. The visits which were most valuable to his research were those to Göttingen, Leipzig and particularly to Copenhagen where he worked in\nNiels Bohr\n's Institute for Theoretical Physics on three occasions,\n8\nApril to\n3\nMay\n1930\n, from\n20\nSeptember to\n22\nNovember\n1930\n, and from\n25\nFebruary to\n19\nMarch\n1931\n[\n66\n]\n:-\nThis scientific atmosphere, magnified by the charm of the personality of\nBohr\nhimself, decisively influenced Landau in forming his own view of physics.\nFrom that time on he considered himself a pupil of\nBohr\nand it was\nBohr\n's influence that dictated the direction of Landau's future work\n[\n49\n]\n:-\n... he also learned his teaching and training methods from\nBohr\n.\nThe visits to Copenhagen also seemed to mark a change in Landau's character\n[\n77\n]\n:-\nLandau, then and for some years afterwards, was an extremely provocative young man, who liked to shock.\nDuring his trip abroad he went to Zürich where he worked from December\n1930\nto January\n1931\n. There he collaborated with Rudolf Peierls\n(1907\n-\n1995)\non relativistic quantum mechanics and their joint paper\nQuantum Electrodynamics in Configuration Space\nwas published in\n1931\n. Landau and Peierls discussed, in German, many topics including astrophysics. Peierls said in an interview in May\n1977\n:-\nHe obviously was a very impressive character. I mean, his way of working was - if he saw a paper that interested him, he would glance at it to see what the problem was, and as a result he would sit down and solve the problem himself, and see whether his answer agreed with the paper.\nWhile in Zürich he wrote the paper\nOn the theory of stars\nbut did not submit it for publication until he had returned to Leningrad\n[\n44\n]\n:-\nLandau opened his four-page paper by arguing that theoretical astrophysicists were wrong to analyse stellar structure with the aid of mathematically convenient, but physically unrealistic assumptions. He illustrated this point by commenting on\nEdward Arthur Milne\n's ongoing campaign to overthrow\nArthur Stanley Eddington\n's orthodox model of stars as gas spheres in which inward gravitational pressure is counteracted by outward radiation pressure. ...  Believing that he had demonstrated the irrationality of \"astrophysical methods,\" Landau averred that it was \"reasonable to try to attack the problem of stellar structure\n[\nwith the\n]\nmethods of theoretical physics.\"\nIn\n1931\nLandau returned to Leningrad to work at the Physical Technical Institute, but in the following year he was appointed as head of the Theory Division of the Ukrainian Technical Institute in Kharkov and he was also appointed to the chair of theoretical physics at the Kharkov Institute of Mechanical Engineering. He moved to Kharkov to take up these posts, receiving a doctorate in Physical and Mathematical Sciences in\n1934\n. One of his first projects in Kharkov was to organise an international conference on theoretical physics, and\nNiels Bohr\nattended the meeting\n[\n77\n]\n:-\nLandau presided;\nBohr\nopened the discussions on all papers ...\nSoon afterward Landau was back in Copenhagen at a conference organised by\nBohr\n[\n77\n]\n:-\n... wearing a red coat and still provocative. During the next two years he produced original scientific papers at an average rate of one every six weeks and covered an astonishing range of subjects.\nThis extraordinary productivity was soon rewarded for, in addition to his other positions, in\n1935\nhe received the title of professor and was made head of Physics at the Kharkov Gorky State University. Landau soon made his School in Kharkov the centre of theoretical physics in the USSR. In Kharkov, Landau met Konkordiya Drobantseva, a chemistry graduate known as Kora. She was a food technologist and from\n1935\nthey lived together in a civil marriage which, some years later in\n1946\n, they made formal when their son Igor was born. In Karkov, Landau had a talented student\nEvgenii Mikhailovich Lifshitz\nwho began studying for his Ph.D. under him in\n1933\n.\nLifshitz\nwas an exceptionally talented writer and Landau teamed up with him to create the ten volume 'Course of Theoretical Physics'. We give more details below.\nIn\n1937\nLandau went to Moscow to become Head of the Theory Division of the Physical Institute of the USSR Academy of Sciences. He worked on atomic collisions, astrophysics, low-temperature physics, atomic and nuclear physics, thermodynamics, quantum electrodynamics, kinetic theory of gases, quantum field theory, and plasma physics. The work he did on the theory to explain why liquid helium was super-fluid earned him the\n1962\nNobel Prize for Physics. The citation states that he received the Nobel Prize for Physic:-\n... for his pioneering theories for condensed matter, especially liquid helium.\nPerhaps some details of the strange behaviour of liquid helium at a temperature just above absolute zero would be useful. It had been noted experimentally that if liquid helium at these low temperatures was placed in a beaker, then it climbed out of the beaker until the level outside was equal to that inside. Similarly liquid helium would climb into the beaker if the level outside exceeded that in the beaker. Landau devised a theory to explain such behaviour which was published in\n1941\n. It predicted a new phenomenon, namely a temperature wave described a \"second sound\", and three years later experimental evidence produced in Moscow confirmed the existence of \"second sound\".\nAs we noted above, Landau believed in Communist principles, writing in\n1935\nthat there were\n[\n35\n]\n:-\n... unprecedented opportunities for the development of physics in our country, provided by the Party and the government.\nHowever, he became increasingly unhappy with the way that Joseph Stalin was leading the country. Beginning in\n1935\n, Stalin began a systematic elimination of his opponents in the 'Great Purge'. Soon it was leading members of his party, of the military, and important people from all walks of life who were being sent to prison, penal camps or work camps. Soon Landau was under investigation by the KGB who had received information from informers that he was making anti-government statements. It is not known whether he was the author of a pamphlet attacking the regime which was produced in\n1938\nbut, if he wasn't, nevertheless it is clear that he supported and helped in its production. It begins as follows\n[\n35\n]\n:-\nThe great cause of the October Revolution is being despicably betrayed. The country is inundated with torrents of blood and filth. Millions of innocent people are being thrown into prisons and no-one can tell when his own turn will come. It is clear, comrades, that the Stalinist clique has carried out a fascist coup. Socialism has remained only on the pages of the habitually lying newspapers. In his rabid hatred of genuine socialism, Stalin is not different from Hitler and Mussolini.\nOn\n28\nApril\n1938\n, Landau was arrested and taken to Lubyanka prison. After two months of being forced to stand for seven hours a day and threatened with transfer to Lefortovo prison\n(\nwhich was much worse than Lubyanka prison\n)\nhe wrote and signed a confession. One cannot take seriously a document produced under such circumstances but, in fact, it does seem to give a true account of Landau's views. He wrote later:-\nI spent a year in prison and it was clear that I would be unable to live for even another half year.\nRussian scientists tried to force the authorities to release him, with the leading physicist Peter Kapitza claiming he would stop his scientific work unless Landau was released. Kapitsa and\nNiels Bohr\nboth wrote letters to Stalin insisting that Landau must be released. He was released in\n1939\nand reinstated as a research fellow at the Institute of Physical Problems.\nLandau did some work on the Soviet atomic bomb in the second half of the\n1940\ns. He certainly undertook mathematical calculations for work on the project and published a couple of papers which were outcomes of this work. It was not work he wanted to do but felt obliged to undertake it, particularly after his arrest and imprisonment some years before.\nWe mentioned above that one major contribution made by Landau was the writing of a number of outstanding textbooks and research monographs. His most famous book is his ten volume\nCourse of Theoretical Physics\nwritten jointly with\nE M Lifshitz\nwho was Landau's research student. They began work on this in the\n1930\n's and the first part of the book is based on lecture notes.\nLifshitz\ncontinued to work on the book after Landau's death and it was not completed until\n1979\n. The work includes many of the results of Landau and\nLifshitz\n's research over many years including the results of many jointly written research papers. The chapters of the book indicates the main topics of their joint research: Mechanics, theory of fields, quantum mechanics, quantum electrodynamics, classical statistical physics, quantum statistical physics, fluid mechanics, theory of elasticity, electrodynamics of continuous media, and physical kinetics.\nSee extracts from the Prefaces to Landau and Lifshitz:\nCourse of Theoretical Physics\nat\nTHIS LINK\nSee extracts from  Reviews of Landau and Lifshitz:\nCourse of Theoretical Physics\nat\nTHIS LINK\nLet us give some information about Landau's seminar. Before being accepted as a member of Landau's school, a candidate had to pass Landau's 'theoretical minimum'. This was a series of examinations that Landau set for which students had to spend a long time preparing. For example, Boris Ioffe, the author of\n[\n45\n]\nand\n[\n46\n]\n, took almost two years to pass Landau's 'theoretical minimum'. Ioffe writes in\n[\n46\n]\nabout Landau's seminar:-\nTo be Landau's disciple implied no privileges, only obligations. That's because anybody could have scientific discussions with Landau and get his advice. Moreover, only a few among those who passed Landau's minimum became his graduate students\n(\nI did not\n)\n. Landau's students enjoyed full rights as participants of Landau's seminar. But, again, anyone could participate in his seminar, ask questions and make remarks. The obligations of the \"full-right\"  participants were to prepare, in a regular way, in alphabetical order, review talks for the seminar. After each seminar Landau would take a recent issue of Physical Review\n(\nat that time it was not divided into sections\n)\nand point out to a speaker-to-be which papers he was supposed to report on at the seminar. As a rule, he would choose a dozen such papers from all branches of physics. ... The speaker not only had to review the paper, i.e. present its basic idea and final results, but was supposed to understand well how the results were obtained, present and explain to the audience all necessary formulae, including experimental techniques, and have his own opinion, as to whether or not the results were reliable.... The presentation of a theoretical report would proceed differently. A person, who wanted to present a theoretical investigation at the seminar\n(\nhis own or from the literature\n)\nwas first supposed to tell the story to Landau privately. If Landau agreed with the basic points of the work, then the talk at the seminar would be allowed. During the talk, Landau gave clarifying comments and quite often his explanation of the work was strongly different from that of the author. A hot discussion would then often follow. One could hear from Landau: \"The author, in fact, did not understand what he did.\"  Landau's understanding in all cases was quite original and for normal people it was not easy to follow his line of reasoning.\nOn\n7\nJanuary\n1962\n, Landau was involved in a car accident on the road from Moscow to Dubna. The road was slippery and his car hit a truck coming in the opposite direction. Others in his car suffered only minor cuts and bruises but Landau suffered serious fractures and injuries to his internal organs. He was taken to hospital in Moscow where he was unconscious for six weeks. Several times doctors declared him clinically dead. Remarkably Landau regained consciousness and although in many ways he returned to normal, he could never again perform creative work. Having never completely recovered, he died six years after his accident following a major operation to free an intestinal blockage. Sadly, these last six years were ones of constant suffering and pain.\nWe have given some quotes above concerning Landau's character. Further remarks are given in\n[\n77\n]\n:-\nHis personal qualities are something of an enigma. He had a flaming sincerity for - and about - science. He attracted students by his enthusiasm and evident knowledge, but to a greater age than most retained aspects of the enfant terrible. He could also be hot and merciless in criticism. Yet those who knew him, from\nNiels Bohr\nto the writer of a Soviet appreciation of his\n50\nth\nbirthday, agreed that there was human warmth below his sharpness.\nPeter Kapitza, who knew him well, writes in\n[\n49\n]\n:-\nHis uncompromising attitudes, typical of all distinguished scientists in their work, extended to Landau's personal relationships. However, those who knew him well were aware that behind the abruptness was a very kind and responsive man, always ready to help people who had been unjustly wronged. In his youth Landau was very shy and even shunned society; any contact with people required great effort. It would appear that with age shyness waned but Landau was never able to adjust to society. It was only the many-sided talents of Landau's personality which drew people to him, and as he got to know them they would begin to like him and find great pleasure in his company. Everyone at the Institute of Physical Problems loved landau and his loss is sorely felt by the whole staff and in particular by his students, whose feelings towards him were especially profound.\nLandau received many international honours for his contributions. He was elected to the\nRoyal Danish Academy of Sciences\n(1951)\n, The\nRoyal Netherlands Academy of Sciences\n(1956)\n, The British Physical Society\n(1959)\nand the\nRoyal Society of London\n(1960)\n. Also in\n1960\nhe was elected to the\nU.S. National Academy of Sciences\nand the\nAmerican Academy of Arts and Sciences\n. In addition to the Nobel Prize in\n1962\n, he received the Fritz London Prize in\n1960\nfor research in low-temperature physics and, in the same year, the\nMax Planck\nMedal. In\n1962\nhe was elected to the French Physical Society and the\nNew York Academy of Sciences\n. He also received honours from his own country: he was elected to the USSR Academy of Sciences\n(1946)\n, received the State Prize three times\n(1946\n,\n1949\n,\n1953)\n, received the Lenin Prize in\n1962\n(\njointly with\nEvgenii Mikhailovich Lifshitz\nfor the 'Course of Theoretical Physics'\n)\n, was given the title Hero of Socialist Labour\n(1953)\nand twice awarded the Order of Lenin.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Statistics"
  ]
}