{
  "nome_completo": "Lev Arkad'evich Kaluznin",
  "nome_curto": "Lev Arkad'evich Kaluznin",
  "ano_nascimento": "1914",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kaluznin/",
  "lugar_nascimento": "Moscow, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Shortly after\nLev Arkad'evich Kaluznin\n's birth, his parents were divorced and his father, Arkadii Rubin, a well-known businessman, moved to England. Lev was brought up by his mother, Maria Pavlovna Kaluznina. She came from an old noble family many of whose members had become prominent figures in Russian culture, education, and the Arts. She passed her cultural values on to her son, especially her deep love for literature and music. She had a great influence on Lev Arkad'evich throughout her life - sometimes markedly so.\nDuring the revolution of\n1917\nand the civil war which followed, mother and son lived in Petrograd\n(\nnow St Petersburg\n)\n. In\n1923\nthey moved to Germany. To make ends meet Maria Pavlovna worked as a governess. In\n1925\nLev entered a secondary school\n(\nRealschule\n)\nof high academic standing, from which he graduated in\n1933\n. The school provided a solid background in mathematics, including topics in the foundations of analysis, differential equations and complex variables. In the autumn of\n1933\nhe entered the Humboldt University of Berlin, where he spent the next three years. While at Humboldt he was greatly influenced by\nSchur\n, whose lectures on algebra shaped Lev's mathematical interest. In\n1936\nhe moved to Hamburg, where, at the University of Hamburg, he attended lectures of\nArtin\nand\nHecke\nand seminars of\nZassenhaus\nand other famous mathematicians. It was here that he obtained his first research result - a generalisation of what is today a well-known theorem of\nKurosh\non the classification of abelian groups. In the Spring of\n1938\nLev Arkad'evich moved with his mother to France, where, about a year later, he started attending lectures at the Sorbonne.\nWorld War II and the occupation of Paris by German troops forced Kaluznin to terminate his mathematical studies. To make a living during these difficult times he attended a vocational school and became an electrician. On\n22\nJune\n1941\nhis life changed dramatically - as did the lives of many Soviet citizens, who, like Kaluznin, were interned and sent to a camp in Compiègne near Paris. In the beginning, conditions in the camp were tolerable and some prisoners, being specialists in certain fields, would entertain themselves by lecturing to others on diverse subjects.\n(\nIn fact, in later years, Lev Arkad'evich could still recall great lectures he had heard there on world history, Roman law, etc.\n)\nDuring this time he did some research in\nGalois theory\n. In March\n1942\nhe was transferred, as one of a group of prisoners, to a concentration camp in Wahlsburg. There, the horrors of camp life were felt to their fullest extent. Had it not been for the devotion and efforts of his mother, who found ways of surreptitiously sending him food during this period, Kaluznin may not have survived to see the camp liberated by American soldiers.\nIn the Spring of\n1945\nKaluznin returned to Paris. For a while he worked as a translator for the Soviet Embassy, but after a while he returned to his mathematical studies. He worked for the CNRS, published a series of papers on the structure of Sylow p-subgroups of symmetric groups, and in\n1948\ndefended his doctoral thesis on the same topic. The following three years were extremely fruitful: he published several fundamental papers, collaborated with M Krasner, and presented his results at seminars and conferences.\nAt about this time, Lev Arkad'evich and mother had made the decision to return to the USSR. In response to their application, the Soviet authorities him to spend some time in East Germany, where there was an acute shortage of scientists. To meet this condition Kaluznin began working at the Humboldt University in Berlin in\n1951\n- first as a lecturer, and then later, after\nhabilitation\nwith his thesis\nStable automorphism groups\n, as a full professor. During this period he also held a research position at the Mathematical Institute of the\n(\nEast\n)\nGerman Academy of Sciences.\nIn\n1955\nLev Arkad'evich returned to the USSR. Through the recruitment efforts of mathematicians\nGnedenko\nand G E Shilov, he was given a professorship at Kiev State University, an appointment he would hold for\n31\nyears. At this time the University, though steeped in tradition as one of the finer mathematical research centres in the USSR, was in a relatively poor state. Memories of Stalin's recent atrocities were fresh in people's minds, and there was a pervasive atmosphere of political denunciation. Many good faculty members were forced to leave. In\n1957\nKaluznin defended his postdoctoral thesis\n(\na Soviet version of habilitation\n)\non the topic\nSylow p-subgroups of symmetric groups. Complete products of groups. Generalisations of\nGalois\ntheory\n. With his successful defence he almost certainly became the only person to have ever received the highest degree in mathematics from three different countries - despite having never completed his formal education!\n(\nIn France permission had been granted by a special committee.\n)\nIn\n1959\nKaluznin became Head of the Department of Algebra and Mathematical Logic, a department created as a result of his own initiative. He became interested in mathematical linguistics and played an important role in the creation of the Department of Mathematical Linguistics at Kiev State University. His activities and achivements during the decade\n1960\n-\n1970\nincludes: conducting research, teaching at Kiev State University and the Kiev Pedagogical Institute, consulting for the Department of Mathematical Linguistics, serving as a senior researcher at the Institute of Cybernetics of the\nUkrainian Academy of Sciences\n, organising series of public lectures on mathematics, and serving as a member on editorial boards of several scientific journals. In\n1962\nhe married Zoya Mikhailovna Volotskaya, a well-known linguist. They had two children, but after that lived apart most of the time.\nIn\n1968\nseveral friends and students of Kaluznin signed a letter condemning the closed political trials that were then commonplace in Ukraine. In\n1970\nthe political climate deteriorated still further. Having always been perceived as an \"alien\", Kaluznin was forced to leave his position as Head of the Department of Algebra and Mathematical Logic, though he retained his professorship at Kiev State University until\n1985\n. He was also denied permission to attend numerous conferences abroad to which he had been invited, and his only contact with Western mathematicians was now only by correspondence. During these years he devoted most of his time to his students, to his research activity on permutation groups, and to his newly cultivated interest in computer algebra. In\n1984\n, due to deteriorating health, Lev Arkad'evich relinquished his teaching duties, and in\n1985\nhis position within the faculty was changed to that of a 'senior researcher'. At the same time his son Mikhail returned to religious involvement, left Komsomol\n(\na Russian Communist youth organisation\n)\n, and became the target of constant attacks. There was no chance that young Mikhail's activities would go unnoticed by the communist authorities since this was the time of his graduation from Kiev State University, so his actions came under close scrutiny. All this contributed heavily to Kaluznin's forced retirement and to his subsequent move to Moscow. As time passed Kaluznin's health deteriorated, and his death came as the result of severe burns caused by an accident.\nAs a researcher, Kaluznin is best known for his work in group theory and in particular permutation groups. He studied the\nSylow\np\np\np\n-subgroups of symmetric groups and their generalisations. In the case of symmetric groups of degree\np\nn\np^{n}\np\nn\n, these subgroups were constructed from cyclic groups of order\np\np\np\nby taking their wreath product. His work allowed computations in groups to be replaced by computations in certain polynomial algebras over the field of\np\np\np\nelements. Despite the fact that the earliest applications of wreath products of permutation groups was due to\nC Jordan\n,\nW Specht\nand\nG Polya\n, it was Kaluznin who first developed special computational tools for this purpose. Using his techniques, he was able to describe the characteristic subgroups of the\nSylow\np\np\np\n-subgroups, their derived series, their upper and lower central series, and more. These results have been included in many textbooks on group theory.\nKaluznin was also the first to introduce the wreath product of abstract groups and the wreath product of an infinite family of groups. His constructions could be applied to group extensions. A particularly important result is the well-known theorem of Krasner and Kaluznin concerning the embeddings of a group with a subnormal series into the wreath product of the factors of the series. This theorem is widely used in the theory of group varieties, combinatorial group theory, and permutation group theory. Kaluznin made several applications of the wreath product to mathematical logic and mathematical chemistry.\nKaluznin's other significant contributions to group theory include his work on stable automorphism groups, the structure of the variety of\nn\nn\nn\n-abelian groups, a classification of metabelian groups, work on locally normal groups of higher categories, and characterisations of the maximal subgroups of the symmetric and alternating groups.\nAnother area of algebra which had always attracted Kaluznin's interest was\nGalois\ntheory. His first papers in this area were devoted to\nGalois\ntheory of normal extensions of fields. The ideas in this work were later employed by\nJacobson\nin his study of the\nGalois\ntheory of arbitrary finite extensions of fields. Developing further the methods of abstract\nGalois\ntheory which had been initiated by Krasner, Kaluznin and his students were able to establish a\nGalois\ncorrespondence between\nPost\nalgebras and Krasner algebras. His work led to considerable activity in the new area of algebraic combinatorics. Kaluznin also worked in the area of geometrical algebra, particularly on arrangements of subspaces in euclidean and unitary spaces.\nThough Lev Arkad'evich had never considered himself to be an expert in mathematical linguistics, automata theory, and applications of computers in algebra, his mathematical interests were broad and he did not hesitate to do research in these areas outside of his main strengths. He believed in the fruitfulness of cooperation among people representing different mathematical disciplines, and that there were certain advantages to be had by \"amateurs\" having solid experience in another field. Often the areas he chose to concentrate on were little known to the scientific communities of the former Soviet Union.\nKaluznin was an outstanding teacher. His lectures were inspiring. He was sometimes a bit impatient with the details of proofs, concentrating instead on presenting the broad picture of the mathematical terrain with regard to events that had taken place. At this he was hugely successful. He liked to discuss questions in their proper historical context, to motivate new concepts, and to stress the meaning and importance of a particular result. Lev Arkad'evich had a gift for recognising sparks of talent and potential in his students at a very early stage, often during their first semester at Kiev State University.\nDespite the absurdities and humiliations of Soviet life, with its constant dependencies on the whims of those who were in power, Lev Arkad'evich was never heard to regret his return to the USSR. Trying to avoid direct political involvement, he nevertheless found ways to make his position on social and political issues known, or to respond to pseudo-scientific political propaganda. He fully realised the extent of his accomplishments as a researcher, teacher, writer, and founder of scientific groups, and he well understood his impact on mathematical education. It is hard to overestimate the influence he has had on the lives of his many students.\nFinally we make a few remarks on personality. Lev Arkad'evich used to be a heavy smoker, smoking sixty a day even during his lectures. He gave up smoking on\n1\nJanuary\n1970\n, and never smoked another cigarette. He was well-versed in classical music, classic philosophy and Western prose, all of which he loved passionately. He did not care much for poetry, saying that:-\n... a bear, probably, stepped on my poetic ear.\nKaluznin was associated with many members of Kiev's intellectual elite. He organised mathematical gatherings in a cafe\n(\nsimilar to a famous Scottish Café in Lwów during the\n1930\ns\n)\n, and started musical evenings for the students.\nLev Arkad'evich liked and valued good red wines and also good beer. He also liked to dress well but at the end of a lecture his clothes would be entirely covered with chalk. At least this happened until the early\n1970\ns when, after visiting the GDR, he had returned with a white smock, the purpose of which was to protect his clothing during lectures. This unconventional attire prompted the joke among his students that Kaluznin is the \"only real doctor of the Department\".\nOn the other hand, Kaluznin sometimes found it difficult to part with old clothing. One day, a well-meaning secretary decided to help him by asking someone to dispose of a dilapidated jacket he liked to wear. The jacket, which normally hung on the wall of his office, was dumped into a waste bin in the men's room. To the secretary's dismay, she later saw a smiling Lev Arkad'evich, jacket in hand, puzzled by how it came to be in the bin. The very next day she disposed of it herself, only this time to a bin in the ladies' room!\nHe was deeply respected and loved by most who knew him. His clever and gentle humour, his aristocratically cultivated manner and free spirit, his extraordinary friendliness and openness to his companions, his clear and strict rejection of all forms of discrimination\n(\nbe they nationally, religiously or politically based\n)\n, his everyday deeds and reflections leave memories that will not disappear for a generation.\nThis is a shortened form of an article submitted by M H Klin.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Logic"
  ]
}