{
  "nome_completo": "Levi ben Gerson",
  "nome_curto": "Levi ben Gerson",
  "ano_nascimento": "1288",
  "ano_morte": "1344",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levi/",
  "lugar_nascimento": "Bagnols now Bagnols sur Cèze, Provence, France",
  "lugar_morte": "Avignon, France",
  "biografia": "Levi ben Gerson\nis known by a large number of different names. Other than Levi ben Gerson, the commonest seem to be\nGersonides\nand\nLevi ben Gershon\n. However, others refer to him as\nLevi ben Gershom\n, and less commonly as\nGersoni\n,\nLeo de Bagnols\n,\nLeo de Balneolis\n,\nLeo Judaeus\n,\nLeo Hebraeus\n, or by the acronym\nRalbag\n. The large number of references attached to this article testify to the large number of studies by historians. Yet little is known of his life and what some historians claim as certain, is sometimes disputed by others. The 'facts' we give here are, therefore, simply those which are believed by the majority. Levi ben Gerson certainly came from a family of outstanding scholars. His father was Gershon ben Solomon, a scholar who wrote\nSha'ar ha-Shamayim\n. Levi states that his grandfather was Levi ha-Kohen, and it is believed that he was his mother's father. Levi was also closely related to Nahmanides\n(1194\n-\n1270)\nwho was a Spanish scholar, a rabbi and Jewish religious leader who is known for his work on philosophy, poetry, and medicine. Levi was a cousin of Judah Delesfils whose grandson was Simon ben Zemah Duran\n(1361\n-\n1444)\n, a Spanish Jewish rabbi who wrote several famous works.\nWe know that Levi ben Gerson lived in Orange, a town which today is in France but this was not so when he lived there. This is, in fact, quite significant, for the king of France at the time Levi was born was Philip IV, known as Philip the Fair. He expelled the Jews from France in\n1306\nseizing their property and confiscating all money owed to them, but Levi was not affected. However, even in Provence Jews had a difficult time and Levi wrote in Preface to\nMilhamot\n(1329)\nthat the suffering of the Jews:-\n... are so intense that they render meditation impossible.\nThe period\n1309\n-\n1377\nis that of the Roman Catholic papacy in Avignon and these popes had quite good relations with the Jews. Levi certainly had good relations with leading men of the district, both Jewish and Christian. He dedicated one of his works to Pope Clement VI, one of the Avignon popes, and another work was requested by Philip of Vitry, Bishop of Meaux. Yet another of his works was written at the request of a group of Jewish and Christian noblemen. As is already evident from what we have just written, what little information we have about Levi comes from his works. Sadly, these contain very little information about his life. Similarly, there are mentions of him in the writings of others during his lifetime, but again little can be gleaned about his life. For example Isaac de Lattes writes in the Preface to one of his works:-\nThe great prince, our master Levi ben Gershon, was the author of many valuable works. He wrote a commentary on the Bible and the Talmud; and in all branches of science, especially in logic, physics, metaphysics, mathematics, and medicine, he has no equal on earth.\nThis leads naturally to two questions. How did Levi ben Gerson become an expert in so many subjects? How did he make a living? Neither question can be answered with any certainty, but we can say a little. For example, given the family of scholars he came from, it is almost certain that he received training in religious matters by family members. There is no evidence where he could have received a scientific training, however, so many experts believe that he was self-taught in these topics. As to his profession, the most common theory is that he made a living from his medical expertise, but other theories suggest that he made money from money lending, or astrology, or that he was of independent means and did not need to earn a living. One might expect that someone expert in so many areas would read the languages of the day with ease but this appears not to be the case. He spoke Provençal but wrote all his works in Hebrew. This may at first look unlikely since only Latin versions of many of his works survive. However, these are translations, the original Hebrew text being lost. He certainly refers to Latin as the \"language of Christians,\" and almost all historians believe that he could not read Latin. Whenever he quotes from Latin works by authors such as\nAristotle\n, he always gives the quotation in Hebrew. Similarly, it is believed that he could not read Arabic, so had to read the works of the Arabic scholars in Hebrew translations. These deductions clearly have some bearing on his education. The only other\n(\nalmost certain\n)\nfact about his life is that he married the sister of Judah Delesfils, whom we mentioned above, so was distantly related to his wife; no record exists of any children from the marriage. We now look at Levi's works.\nFirst we examine his contributions to mathematics. He wrote\nArt of Calculation\n(\nor\nArt of the Computer\n)\nin\n1321\n, which is sometimes incorrectly described as the\nBook of Number\n. It deals with arithmetical operations, including extraction of square roots and cube roots. In this work he also looks at the summation of series, permutations and combinations, and basic algebraic identities. He gives formulas for the sum of squares and the sum of cubes of natural numbers as well as studying the binomial coefficients. In proofs, he uses induction making this one of the earliest texts to use this important technique. In\n[\n57\n]\nand\n[\n58\n]\n, Shai Simonson publishes the problems from this remarkable work by Levi. In fact, it is the\nArt of Calculation\nwhich allows us to give the year of Levi's birth, since he says he finished writing it in\n1321\n, when he was thirty-three years old.\nIn\n1342\n, at the request of the bishop of Meaux, he wrote\nThe Harmony of Numbers\nwhich contains a proof that\n(1\n,\n2)\n,\n(2\n,\n3)\n,\n(3\n,\n4)\nand\n(8\n,\n9)\nare the only pairs of consecutive numbers whose only factors are\n2\nor\n3\n. One year later, he wrote\nOn Sines, Chords and Arcs\nwhich examined trigonometry, in particular proving the sine theorem for plane triangles and giving\n5\nfigure sine tables. He calculated his sine tables using\nPtolemy\n's methods and his tables are very accurate. In this work he studied chords, sines, versed sines, cosines but not tangents\n(\nwhich were not in use at this time\n)\n.\nGino Loria\nsuggested that the sine theorem be named after Levi but he was not the first to present the theorem, which was known to\nJabir ibn Aflah\nin the\n12\nth\ncentury, but he may have rediscovered it. He also published two geometry books, one being a commentary and introduction to the first five books of\nEuclid\n, but not presented axiomatically. The other is the\nScience of Geometry\nof which only a fragment has survived. It is interesting to note that Levi was interested in\nEuclid\n's parallel postulate and appears to have been part of a lively debate about whether it could be deduced from the other axioms. He proved the parallel postulate with an argument based on an assumption on the convergence or divergence of straight lines that is\n(\nas of course it must be\n)\nequivalent to the parallel postulate; see\n[\n43\n]\nfor further details.\nWe now look at some of Levi's contributions to astronomy. One of these is associated with astronomical instruments.  He invented Jacob's staff, an instrument to measure the angular distance between celestial objects. We should note that the term 'Jacob's staff' was not used by Levi but rather by his Christian contemporaries; he used a Hebrew name which translates as 'Revealer of Profundities'. It is described as consisting:-\n... of a staff of\n4\n1\n2\n4{1\\over2}\n4\n2\n1\n​\nfeet long and about one inch wide, with six or seven perforated tablets which could slide along the staff, each tablet being an integral fraction of the staff length to facilitate calculation, used to measure the distance between stars or planets, and the altitudes and diameters of the Sun, Moon and stars.\nThis was far from his only contribution to improvements in astronomical instruments. In\n[\n23\n]\nBernard Goldstein looks at Levi's various innovations in instrument design. A striking example is the design of a transversal scale for reading fifteenths of degrees on the graduated outer circle of an astrolabe. We note that, remarkably, it was around\n250\nyears later that\nTycho Brahe\nused a similar transversal scale on his great mural quadrant. Goldstein also, in an appendix to\n[\n23\n]\n, examines Levi's transversal scale for the Jacob staff. We note that while Levi's method for constructing the scale is theoretically correct, it requires making measurements that seem extremely difficult, so perhaps the theory was never put into practice.\nThese instruments are described in the astronomical part of Levi's major work\nThe Wars of the Lord\nwhich took him twelve years to compose beginning in\n1317\nand finishing on\n24\nNovember\n1328\n. The work is divided into six books, with the fifth of these dealing with astronomy. The astronomy part was translated into Latin at the request of Pope Clement VI in\n1340\nbut this translation includes later revisions of the work by Levi. We will look later at some of the other books but for the moment we make some comments on Book V which alone contains\n136\nsections. The Hebrew text, with translation and commentary, of the first\n20\nsections is published in\n[\n8\n]\n. H W Guggenheimer writes in a review:-\nThis is the first edition of any of Levi's astronomical writings in Hebrew; as the editor points out, because of the author's critical attitude towards\nPtolemy\nhis work did not find many readers who were willing to acknowledge that they had read it\n(\nwhich was translated into Latin at the papal court of Avignon\n)\n. These first\n20\nsections contain a general philosophical introduction, Levi ben Gerson's trigonometry, a description of the construction and use of an instrument invented by him\n(\nthe Jacob staff\n)\nfor exact determination of angular differences, remarks about the exact construction of the astrolabe and improvements invented by him, followed by practical and theoretical methods for the determination of the meridian and the position of stars and, finally, a proof that\nPtolemy\n's theory does not account for the facts - neither for the moon\n(\nwhich in an epicycle motion would have to be seen from both its sides\n)\nnor for the planets, and a preliminary exploration of alternative\n(\nexcentric circle\n)\ntheories.\nSo Levi's passion for accurate astronomical instruments came from a desire to make sure that any proposed theoretical model was actually in accord with observation, and the more accurate the observation, the better a theory could be put to the test. It was a bold move by Levi to reject\nPtolemy\n's system and certainly shows his strength of character that he was prepared to argue against such a deeply held standard model of the universe. However, he realised that\nPtolemy\n's model does not match the facts. Most importantly, although various tinkerings with epicycles and other corrective devices could always be used to correct the position of the heavenly objects, it still left the apparent size of the objects far from that which was observed. For example, according to\nPtolemy\n's model the size of Mars should vary by a factor of\n6\nbut Levi observed only a factor of\n2\nin the size of the planet. Levi observed a solar eclipse in\n1337\n. After he had observed this event he proposed a new theory of the Sun, which he proceeded to test by further observations. Another eclipse observed by Levi was the eclipse of the Moon on\n3\nOctober\n1335\n. He described a geometrical model for the motion of the Moon and made other astronomical observations of the Moon, Sun and planets using a camera obscura. José Luis Mancha, reviewing\n[\n25\n]\nwrites:-\nFaced with the conflict between physical and mathematical accounts of celestial phenomena,\n[\nLevi\n]\nrejected\n(\nagainst Aristotelian tradition\n)\nthe confinement of astronomy within the limits of a merely predictive theory, and intended\n(\nagainst most of the Ptolemaic tradition\n)\nto construct a true mathematical representation - not only a possible one - of the heavens and the motions of the heavenly bodies, being able to satisfy at the same time the requirements of observation and natural philosophy.\nHaving explained that Levi rejected\nPtolemy\n's model, we must make it clear that the model which Levi gives is of a similar type consisting of\n48\nspheres. Some of these spheres are concentric with the Earth, while others are not. Levi considers that these solid spheres are separated by layers of fluid that lubricate their motions, each sphere being moved by an immaterial intelligence. He gives an iterative calculation for the size of the fluid layer and is led to a calculation of the size of the universe which differs very significantly from\nPtolemy\n's. For example, for\nPtolemy\nthe distance to the sphere of fixed stars is\n20\n,\n000\nEarth radii, while Levi calculates it to be\n160\n×\n1\n0\n12\n160 \\times  10^{12}\n1\n6\n0\n×\n1\n0\n1\n2\nEarth radii. Of course these beliefs were well wide of the truth such as his belief that the\nMilky Way\nwas on the sphere of the fixed stars and shines by the reflected light of the Sun. His lunar model, however, is very interesting for he was able to eliminate epicycles and come up with a model which agreed with observation much better than that of\nPtolemy\n, see\n[\n28\n]\nand\n[\n29\n]\n. The\n99\nth\nchapter of Book V consists of astronomical tables made for the meridian of Orange in\n1320\n.\nDespite spending some time on considering Levi's mathematical and astronomical contributions, we have not yet mentioned the bulk of his work which was on philosophy and religious studies; he wrote many complex Biblical commentaries. It is important to realise that Levi's scientific work was often in conflict with Judaism. He leaves us in no doubt as to his views on such conflicts writing in the Preface to\nThe Wars of the Lord\n:-\nThe Law cannot prevent us from considering to be true that which our reason urges us to believe.\nWe promised to say a little more about\nThe Wars of the Lord\n. In fact the six books of this work are designed to examine six philosophical questions: the immortality of the soul; prophecy; God's omniscience; divine providence; the nature of the celestial spheres; and the eternity of matter. These six questions are examined, one in each of the six books, beginning with a discussion of the views of earlier philosophers, in particular\nAristotle\n. In his discussion of the immortality of the soul, Levi examines the material intellect, which he believes is born with man but only has potential existence, but acquired intellect reaches an effective existence by acquired ideas and conceptions. The acquired intellect, Levi argues, does not cease to exist with the death of the body, so achieving immortality. On prophecy, Levi considers whether it is possible and argues strongly that it is. For anyone like Levi who believes in astrology, such a conclusion is inevitable. The topic of the third book, God's omniscience, was a subject debated at length by philosophers and Levi gives his own views\n[\n56\n]\n:-\nThe sublime thought of God, he says, embraces all the cosmic laws which regulate the evolutions of nature, the general influences exercised by the celestial bodies on the sublunary world, and the specific essences with which matter is invested; but sublunary events, the multifarious details of the phenomenal world, are hidden from His spirit. Not to know these details, however, is not imperfection, because in knowing the universal conditions of things, He knows that which is essential, and consequently good, in the individual.\nOn divine providence, Levi reaches the conclusion that some are protected and guided by general providence while others are under an individual providence. We have looked in some detail at Book V, Levi's astronomical theories, so it remains to comment on Book VI which discusses creation and miracles. On creation, he argues against the 'ex nihilo' theory, arguing instead that 'inert undetermined matter, devoid of form and attribute' had existed for all time. This was really potential matter brought into form and being in an instant act of creation by God. His argument regarding miracles is interesting, for he claims that they exist but are neither due to God nor to prophets. They are the result, he argues, of the active intellect. But miracles have their own limitations: they cannot alter the laws of nature; they cannot produce a contradiction; and they cannot affect the motion of the celestial spheres.\nLet us end this biography by quoting from Tamar Rudavsky's conclusion\n[\n53\n]\n:-\nGersonides' philosophical ideas went against the grain of traditional Jewish thought. Gersonides reflects the following characteristics: first, his writings demonstrate a fundamental interplay and harmony between astrological and theological beliefs. It is clear that the appeal of astrology lay in the fact that it offered useful information, while it looked and operated like a science. ... Gersonides believed that life on earth had a meaning, and that terrestrial events had an order. Astrology was a means of ascertaining that meaning. Gersonides' views on prophecy, providence, free-will and evil reflected ingredients of this philosophical determinism. Whereas his commentaries occupied a central place in Jewish theology, his philosophical work was rejected. .... Only in recent years has Gersonides received his rightful place in the history of philosophy. As scholars have rediscovered his thought and have made his corpus available to a modern audience, Gersonides is once again appreciated as an insightful, ruthlessly consistent philosopher.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}