{
  "nome_completo": "Lipman Bers",
  "nome_curto": "Lipman Bers",
  "ano_nascimento": "1914",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bers/",
  "lugar_nascimento": "Riga, Russia (now Latvia)",
  "lugar_morte": "New Rochelle, New York, USA",
  "biografia": "Lipman Bers\n, always known as Lipa, was born into a Jewish family. His parents Isaac Bers and Bertha Weinberg were teachers, his mother being head at an elementary school in Riga where teaching was in Yiddish while his father was head at the Yiddish high school in Riga. Born in\n1914\n, Lipa's early years were much affected by the political and military events taking place in Russia. Latvia had been under Russian imperial rule since the\n18\nth\ncentury so World War I meant that there were evacuations from Riga. The Russian Revolution which began in October\n1917\ncaused fighting between the Red Army and the White Army and for the next couple of years various parts of Russia came first under the control of one faction then of the other. Lipa's family went to Petrograd, the name that St Petersburg had been given in\n1914\nwhen there was strong anti-German feeling in Russia, but Lipa was too young to understand the difficulties that his parents went through at this time.\nAt the end of World War I in\n1918\n, Latvia regained its independence although this was to be short-lived. Lipa spent some time back in Riga, but he also spent time in Berlin. His mother took him to Berlin while she was training at the Psychoanalytic Institute. During his schooling mathematics became his favourite subject and he decided that it was the subject he wanted to study at university. He studied at the University of Zürich, then returned to Riga and studied at the university there.\nAt this time Europe was a place of extreme politics and, in\n1934\n, Latvia became ruled by a dictator. Lipa was a political activist, a social democrat who argued strongly for human rights. He was at this time a soap-box orator putting his views across strongly both in speeches and in writing for an underground newspaper. Strongly opposed to dictators and strongly advocating democracy it was clear that his criticism of the Latvian dictator could not be ignored by the authorities. A warrant was issued for his arrest and, just in time, he escaped to Prague. His girl friend Mary Kagan followed him to Prague where they married on\n15\nMay\n1938\n.\nThere were a number of reasons why Bers chose to go to Prague at this time. Firstly he had to escape from Latvia, secondly Prague was in a democratic country, and thirdly his aunt lived there so he could obtain permission to study at the Charles University without having to find a job to support himself. One should also not underestimate the fact that by this stage his mathematical preferences were very much in place and Karl\nLoewner\nin Prague looked the ideal supervisor.\nIndeed Bers did obtain his doctorate which was awarded in\n1938\nfrom the Charles University of Prague where he wrote a thesis on\npotential theory\nunder Karl\nLoewner\n's supervision. At the time Bers was rather unhappy with\nLoewner\n[\n1\n]\n:-\nLipa spoke of feeling neglected, perhaps even not encouraged, by\nLoewner\nand said that only in retrospect did he understand\nLoewner\n's teaching method. He gave to each of his students the amount of support needed ... It is obvious that Lipa did not appear too needy to\nLoewner\n.\nIn\n1938\nCzechoslovakia became an impossible country for someone of Jewish background. Equally dangerous was the fact that Bers had no homeland since he was a wanted man in Latvia, and was a left wing academic. With little choice but to escape again, Bers fled to Paris where his daughter Ruth was born. However, the war followed him and soon the Nazi armies began occupying France. Bers applied for a visa to the USA and, while waiting to obtain permission, he wrote two papers on\nGreen\n's functions and integral representations. Just days before Paris surrendered to the advancing armies, Bers and his family moved from Paris to a part of France not yet under attack from the advancing German armies. At last he received the news that he was waiting for, the issue of American visas for his family.\nIn\n1940\nBers and his family arrived in the United States and joined his mother who was already in New York. There was of course a flood of well qualified academics arriving in the United States fleeing from the Nazis and there was a great scarcity of posts, even for the most brilliant, so he was unemployed until\n1942\n, living with other unemployed refugees in New York. During this time he continued his mathematical researches. After this he was appointed Research Instructor at Brown University where, as part of work relevant to the war effort, he studied two-dimensional subsonic fluid flow. This was important at that time since aircraft wings were being designed for planes with jet engines capable of high speeds.\nBetween\n1945\nand\n1949\nBers worked at Syracuse University, first as Assistant Professor and later as Associate Professor.\nGelbart\nwanted to build up the department at Syracuse and attracting both Bers and\nLoewner\nwas an excellent move. Here Bers began work on the problem of removability of singularities of non-linear elliptic equations. His major results in this area were announced by him at the International Congress of Mathematicians in\n1950\nand his paper\nIsolated singularities of minimal surfaces\nwas published in the\nAnnals of Mathematics\nin\n1951\n.\nCourant\nwrites:-\nThe nonparametric differential equation of minimal surfaces may be considered the most accessible significant example revealing typical qualities of solutions of non-linear partial differential equations. With a view to such a general objective,\n[\nBers\n]\nhas studied singularities, branch-points and behaviour in the large of minimal surfaces.\nAbikoff writes in\n[\n1\n]\nthat this paper is:-\n... a magnificent synthesis of complex analytic techniques which relate the different parameterisations of minimal surfaces to the representations of the potential function for subsonic flow and thereby achieves the extension across the singularity.\nBers then became a member of the Institute for Advanced Study at Princeton where he began work on\nTeichmüller\ntheory, pseudoanalytic functions, quasiconformal mappings and Kleinian\ngroups\n. He was set in the right direction by an inequality he found in a paper of\nLavrent'ev\nwho attributed the inequality to\nAhlfors\n. In a lecture he gave in\n1986\nBers explained what happened next:-\nI was in Princeton at the time.\nAhlfors\ncame to Princeton and announced a talk on quasiconformal mappings. He spoke at the University so I went there and sure enough, he proved this theorem. So I came up to him after the talk and asked him \"Where did you publish it?\", and he said \"I didn't\". \"So why did\nLavrent'ev\ncredit you with it?\"\nAhlfors\nsaid \"He probably thought I must know it and was too lazy to look it up in the literature\".\nWhen Bers met\nLavrent'ev\nthree years later he asked him the same questions and, indeed,\nAhlfors\nhad been correct in guessing why\nLavrent'ev\nhad credited him. Bers continued in his\n1986\nlecture:-\nI immediately decided that, first of all, if quasiconformal mappings lead to such powerful and beautiful results and, secondly, if it is done in this gentlemanly spirit - where you don't fight over priority - this is something that I should spend the rest of my life studying.\nIt is ironic, given Bers strong political views on human rights, that he should find that\nTeichmüller\n, a fervent Nazi, had already made stunning contributions. In one of his papers on\nTeichmüller\ntheory, Bers quotes Plutarch:-\nIt does not of necessity follow that, if the work delights you with its grace, the one who wrought it is worthy of your esteem.\nIn\n1951\nBers went to the\nCourant\nInstitute in New York, where he was a full professor, and remained there for\n13\nyears. During this time he wrote a number of important books and surveys on his work. He published\nTheory of pseudo-analytic functions\nin\n1953\nwhich Protter, in a review, described as follows:-\nThe theory of pseudo-analytic functions was first announced by\n[\nBers\n]\nin two notes. These lecture notes not only contain proofs and extensions of the results previously announced but give a self-contained and comprehensive treatment of the subject.\nThe author sets as his goal the development of a function theory for solutions of linear, elliptic, second order partial differential equations in two independent variables\n(\nor systems of two first-order equations\n)\n. One of the chief stumbling blocks in such a task is the fact that the notion of derivative is a hereditary property for analytic functions while this is clearly not the case for solutions of general second order elliptic equations.\nAnother classic text was\nMathematical aspects of subsonic and transonic gas dynamics\npublished in\n1958\n:-\nIt should be said, even though this is taken for granted by everybody in the case of Professor Bers, that the survey is masterly in its elegance and clarity.\nIn\n1958\nBers address the International Congress of Mathematicians in Edinburgh, Scotland, where he lectured on\nSpaces of Riemann surfaces\nand announced a new proof of the measurable\nRiemann\nmapping theorem. In his talk Bers summarised recent work on the classical problem of moduli for compact\nRiemann\nsurfaces and sketched a proof of the\nTeichmüller\ntheorem characterizing extremal quasiconformal mappings. He showed that the Teichmüller space for surfaces of genus g is a\n(6\ng-\n6)\n-cell, and showed how to construct the natural complex analytic structure for the\nTeichmüller\nspace.\nBers was a Guggenheim Fellow in\n1959\n-\n60\n, and a Fulbright Fellow in the same academic year. From\n1959\nuntil he left the\nCourant\nInstitute in\n1964\n, Bers was Chairman of the Graduate Department of Mathematics.\nIn\n1964\nBers went to Columbia University where he was to remain until he retired in\n1984\n. He was chairman of the department from\n1972\nto\n1975\n. He was appointed Davies Professor of Mathematics in\n1972\n, becoming Emeritus Davies Professor of Mathematics in\n1982\n. During this period Bers was Visiting Miller Research Professor at the University of California at Berkeley in\n1968\n.\nTilla Weinstein describes in\n[\n1\n]\nBers as a lecturer:-\nLipa's courses were irresistible. He laced his lectures with humorous asides and tasty tidbits of mathematical gossip. He presented intricate proofs with impeccable clarity, pausing dramatically at the few most critical steps, giving us a chance to think for ourselves and to worry that he might not know what to do next. Then, just as the silence got uncomfortable, he would describe the single most elegant way to complete the argument.\nJane Gilman\n[\n1\n]\ndescribes Bers' character:-\nUnderneath the force of Bers' personality and vivacity was the force of his mathematics. His mathematics had a clarity and beauty that went beyond the actual results. He had a special gift for conceptualising things and placing them in the larger context.\nIn\n[\n1\n]\nBers life is summed up by Abikoff as follows:-\nLipa possessed a joy of life and an optimism that is difficult to find at this time and that is sorely missed. Those of us who experienced it directly have felt an obligation to pass it on. That, in addition to the beauty of his own work, is Lipa's enduring gift to us.\nWe have yet to say something about Bers' great passion for human rights. In fact this was anything but a sideline in his life and one could consider that he devoted himself full-time to both his mathematical work and to his work as a social reformer. Perhaps his views are most clearly expressed by quoting from an address he gave in\n1984\nwhen awarded an honorary degree by the State University of New York at Stony Brook:-\nBy becoming a human rights activist ... you do take upon yourself certain difficult obligations. ... I believe that only a truly even-handed approach can lead to an honest, morally convincing, and effective human rights policy. A human rights activist who hates and fears communism must also care about the human rights of Latin American leftists. A human rights activist who sympathises with the revolutionary movement in Latin America must also be concerned about human rights abuses in Cuba and Nicaragua. A devout Muslim must also care about human rights of the Bahai in Iran and of the small Jewish community in Syria, while a Jew devoted to Israel must also worry about the human rights of Palestinian Arabs. And we American citizens must be particularly sensitive to human rights violations for which our government is directly or indirectly responsible, as well as to the human rights violations that occur in our own country, as they do.\nBers received many honours for his contributions in addition to those we have mentioned above. He was elected to the\nAmerican Academy of Arts and Sciences\n, to the\nFinnish Academy of Sciences\n, and to the American Philosophical Society. He served the American Mathematical Society in several capacities, particularly as Vice-President\n(1963\n-\n65)\nand as President\n(1975\n-\n77)\n. The\nAmerican Mathematical Society\nawarded him their Steele Prize in\n1975\n. He received the New York Mayor's award in Science and Technology in\n1985\n. He was an honorary life member of the\nNew York Academy of Sciences\n, and of the\nLondon Mathematical Society\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}