{
  "nome_completo": "Lothar Collatz",
  "nome_curto": "Lothar Collatz",
  "ano_nascimento": "1910",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Collatz/",
  "lugar_nascimento": "Arnsberg, Westphalia, Germany",
  "lugar_morte": "Varna, Bulgaria",
  "biografia": "Lothar Collatz\n, like most German students of his time, studied at a number of different universities. He entered the University of Greifswald in\n1928\n, moving to Munich, then to Göttingen, and finally to Berlin where he studied for his doctorate under Alfred Klose. Collatz was awarded his doctorate in\n1935\nfor his dissertation\nDas Differenzenverfahren mit höherer Approximation für lineare Differentialgleichunge\nⓉ\n(\nDifference methods with higher approximation for linear differential equations\n)\n. In\n[\n8\n]\nMeinardus and Nürnberger write:-\nHe often told how much he had been impressed by the lectures of\nHilbert\n,\nCourant\n,\nvon Mises\n,\nSchur\n, and other famous mathematicians of that period. He was convinced that mathematics and mathematicians had a responsibility to apply their results to, and be motivated by, real world phenomena. he never wearied of fighting for this conviction.\nMany will know the name of Collatz today because of the \"Collatz problem\". In many ways it might seem a pity that a mathematician who has produced so much important and fundamental work should be most remembered for a novelty, yet this problem has intrigued mathematicians ever since he proposed it in\n1937\n. The Collatz problem is simple to state. Define a function\nf\nf\nf\non the positive integers by\nf\n(\nn\n)\n=\n3\nn\n+\n1\nf (n) = 3n+1\nf\n(\nn\n)\n=\n3\nn\n+\n1\nif\nn\nn\nn\nis odd;\nf\n(\nn\n)\n=\nn\n2\nf (n) =  \\Large\\frac n 2\nf\n(\nn\n)\n=\n2\nn\n​\nif\nn\nn\nn\nis even.\nGiven any integer\nm\nm\nm\ndefine a sequence by putting\na\n(\n1\n)\n=\nm\na(1) = m\na\n(\n1\n)\n=\nm\nand, for\ni\n≥\n1\n,\na\n(\ni\n+\n1\n)\n=\nf\n(\na\n(\ni\n)\n)\ni ≥ 1, a(i+1) = f (a(i))\ni\n≥\n1\n,\na\n(\ni\n+\n1\n)\n=\nf\n(\na\n(\ni\n)\n)\n.\nThe problem asks if, for every starting value\nm\nm\nm\n, the sequence\na\n(\ni\n)\na(i)\na\n(\ni\n)\nalways reaches\n1\n? The problem remains unsolved, but before you try a few small numbers yourself looking for a counterexample, let us say that the conjecture has been verified for all numbers\nm\nm\nm\nup to about\n1\n0\n14\n10^{14}\n1\n0\n1\n4\n.\nIn\n1943\nCollatz was appointed to a professorship at the Technical University of Hanover. After holding this position for nine years, in\n1952\nhe moved to the University of Hamburg. There he founded the Institute of Applied Mathematics.\nMathSciNet lists\n238\nitems under Collatz' name. Most of these publications are in numerical analysis but those range through almost every area within the subject. Among his early papers are\nGenäherte Berechnung von Eigenwerten\nⓉ\n(\nApproximate calculation of eigenvalues\n)\n(1939)\nin which he considers various methods of approximating characteristic values,\nDas Hornersche Schema bei komplexen Wurzeln algebraischer Gleichungen\nⓉ\n(\nThe Horner scheme with complex roots of algebraic equations\n)\n(1940)\nin which he presents a more efficient way of using\nHorner\n's method to approximate the complex roots of an algebraic equation, and\nSchrittweise Näherungen bei Integralgleichungen und Eigenwertschranken\nⓉ\n(\nGradual approximations for integral equations and eigenvalue limits\n)\n(1940)\nin which inequalities between the eigenvalues of certain\nintegral equations\nare studied.\nCollatz began publishing important books early in his career.\nEigenwertprobleme und ihre numerische Behandlung\nⓉ\n(\nEigenvalue  problems and their numerical treatment\n)\n(1945)\ncontains three parts, the first containing a collection of practical applications which lead to boundary value problems for ordinary and partial differential equations. The second part provides the theory of boundary value problems while the final part provides numerical method to solve these. This was followed by\nNumerische Behandlung von Differentialgleichungen\nⓉ\n(\nNumerical treatment of differential equations\n)\n(1951)\nwhich provides a comprehensive text on numerical methods for solving differential equations. Collatz was keen to provide methods for scientists as in\nDifferentialgleichungen für Ingenieure: Eine Einführung\nⓉ\n(\nDifferential equations for engineers: An Introduction\n)\n(1960)\n:-\nThis small book gives a wealth of information on differential equations. ... The concise formulation is clear and precise, and it will appeal to engineers on account of its many graphic examples.\nAn interesting combining of two areas was presented in\nFunctional analysis and numerical mathematics\n(1966)\n, which was an English translation of a German book published two years earlier.\nA S Householder\nwrites:-\nIt seems strange that this book should be the first of its kind, since it hardly needs to be said that \"numerical mathematics\" must draw heavily from functional analysis. Nevertheless, in an unnecessarily modest preface, the author disclaims any intention of writing a textbook on either functional analysis or numerical mathematics, offering the book instead as illustrating the artificiality of any separation of applied from pure mathematics. In spite of the disclaimer, the book could be used as a basis for a rather extensive course on functional analysis for numerical analysts, and the footnotes and the bibliography provide for a considerable amount of collateral reading.\nA very different area was covered in\nOptimierungsaufgaben\nⓉ\n(\nOptimization problems\n)\n(1966)\n(\nwritten jointly with W Wetterling\n)\n. This is an introductory textbook which introduces students to linear programming, two-person-zero-sum games, quadratic programming, and convex programming. The book\nAufgaben aus der Angewandten Mathematik\nⓉ\n(\nProblems of applied mathematics\n)\n(1972)\n(\nwith J Albrecht\n)\nprovides a collection of problems\n(\nwith their solutions\n)\non the solution of equations and systems of equations, interpolation, quadrature, approximation, and harmonic analysis.\nApproximationstheorie. Tschebyscheffsche Approximation mit Anwendungen\nⓉ\n(\nApproximation theory. Chebyshev approximation with applications\n)\n(1973)\n(\nwith W Krabs\n)\nis described by J L Ullman as follows:-\n[\nT\n]\nhe total effect is to provide a stimulating introduction to the subject to people with both pure and applied inclinations, and at the same time, providing a good primary or secondary reference for an advanced undergraduate course, or a beginning research seminar in approximation theory and/or numerical analysis.\nLater texts by Collatz include\nOptimization problems\n(1975)\nand\nDifferential equations\n(1986)\n, the second of these being an English translation of an earlier German book.\nCollatz received many honours for his contributions including election to the\nGerman Academy of Scientists Leopoldina\n, the academy at Bologna and that at Modena. He was made an honorary member of the\nHamburg Mathematical Society\nand given honorary degrees by the University of São Paulo, the Technical University of Vienna, the University of Dundee in Scotland, Brunel University in England, the Technical University of Hanover, and the Technical University of Dresden.\nMeinardus and Nürnberger write\n[\n6\n]\n:-\nProfessor Collatz was a truly wonderful individual. He was modest in his behaviour, and ever amiable and helpful.\nHe died in Varna, Bulgaria, while attending a mathematics conference on Computer Arithmetic.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Number Theory"
  ]
}