{
  "nome_completo": "Louis Benjamin Francoeur",
  "nome_curto": "Louis Benjamin Francoeur",
  "ano_nascimento": "1773",
  "ano_morte": "1849",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Francoeur/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Fontainbleau, Paris, France",
  "biografia": "Louis Benjamin Francoeur\nwas born into a famous Paris family of musicians. His father, Louis-Joseph Francoeur\n(1738\n-\n1804)\n, was the son of Louis Francoeur\n(1692\n-\n1745)\n, who was the leader of the Vingt-Quatre Violons du Roi, and the nephew of François Francoeur who also played in the Vingt-Quatre Violons. Louis-Joseph, Louis and François all also played in the Opéra orchestra. At the time Louis Benjamin was born, his father was maître of the Opéra orchestra and he became its director in\n1779\n. Louis Benjamin was brought up in Saint Cloud, a wealthy commune to the west of Paris, and educated at the College d'Harcourt. This ancient educational establishment was founded in\n1280\nbut was renamed the Lycée Saint-Louis in\n1820\n; it is today known for its exceptional teaching. He became a clerk to a notary in\n1790\nbut, by this time, Paris was in turmoil as the Revolution took its course. The Opera had been the Royal Opera until\n1792\nwhen it became a public utility independent of the king. Louis Francoeur resigned as director of the Opera and tried to set up a new company with the King's support. He founded the Francoeur-Cellerier company in\n1792\nand Louis Benjamin he took a position as deputy cashier in his father's opera company. Like other members of his family he was exceptionally talented musically, so working for an opera company was a pleasant task.\nThe execution of Louis XVI on\n21\nJanuary\n1793\nmeant that the Francoeur-Cellerier company was short-lived and a financial disaster. Louis Benjamin lost his position and, in September\n1793\n, his father was imprisoned because of his royal connections; Louis-Joseph Francoeur spent nearly a year in prison and when he was released he had no pension and was heavily in debt. Now, as well as internal strife, France was faced with attacks from the Austrians and Prussians and, from\n1793\n, Louis Benjamin was required to serve in the French Revolutionary army. At first he was sent as a sergeant major to a regiment of the French Guard stationed at Péronne in northern France. Following this he served in the Auvergne Regiment which was at Maubeuge trying to defend against the Austrian army under the command of Prince Josias of Coburg. Francoeur, however, became involved in a musical role at Maubeuge. He had risen to 'Chef de brigade', a rank equivalent to colonel, but on hearing that technicians for the arms factories were being recruited in Paris, he quickly returned there. Having failed to get such a position, he sadly set off for Maubeuge in August\n1794\nbut when he heard that students were being sought for the new École Centrale des Travaux Publics\n(\nsoon to be renamed the École Polytechnique\n)\nhe returned again to Paris.\nPassing the entrance examination, he studied mathematics with\nGaspard Monge\nat the École Centrale des Travaux Publics, beginning in November\n1794\n. He was a brilliant pupil, completing his studies in\n1797\n. Then he was appointed to the School of Geographical Engineers, which allowed him to remain in Paris to give private lessons to favoured students, such as Jérôme Bonaparte, the youngest brother of Napoleon Bonaparte. He also studied botany under the direction of René Louiche Desfontaines and Jean-Louis Thuillier while he waited to continue an army career as a geographer. However,\nGaspard de Prony\nhad realised that Francoeur was a talented mathematician and lecturer so, in\n1798\n, he appointed him as répétiteur d'analyse to teach an analysis course for\nSylvestre Lacroix\n.\nDe Prony\nwas the first teacher of mechanics at the École Polytechnique and Francoeur, as his teaching assistant, quickly produced the substantial\nTraité de méchanique élémentaire\nⓉ\n(\nTreatise on elementary mechanics\n)\n(1801)\nto serve as an introduction to the subject for students at the École. His academic position saved Francoeur from the dangers and discomforts of army life but he carried on with both a military and an academic career. He was theoretically made a sub-lieutenant in the artillery in\n1802\nalthough by this time he was taking no active part in the military. In\n1804\nhe was appointed professor of mathematics at the École Polytechnique, then in\n1805\nhe became professor of mathematics at the Lycée Charlemagne. In\n1808\nhe was made professor of mathematics at the Faculté des Sciences in Paris, a post he was to hold in addition to others until\n1845\n.\nFrancoeur had many duties in his capacity as an examiner for the École Polytechnique and he often travelled in France and Italy carrying out these duties. The French, under Napoleon, fought inconclusive battles and campaigns in various parts of Spain and Portugal during\n1809\n-\n10\n. Francoeur was sent on this Peninsular Campaign but he broke a leg in an accident with a carriage. During\n1810\nhe spent four months in bed as a result of this accident. In\n1811\na comet appeared causing great interest with the public. It was first observed in March of that year, but it was not until September that it was a bright object in the evening sky, reaching its maximum brightness in October. Francoeur became interested in astronomy as a result of this comet and was appointed professor of astronomy at the Athénée in Paris. However, in\n1814\nNapoleon Bonaparte was defeated and the Bourbon Restoration government was set up. In\n1815\nover\n50\n,\n000\ncivil servants were sacked, and\n15\n,\n000\narmy officers dismissed. Francoeur lost his chair at the Lycée Charlemagne and also his position at the École Polytechnique. In\n1816\nhe became a founding member of the Société pour l'enseignement élémentaire, a society whose aim was to promote elementary instruction in schools. He later became secretary of the Society. Francoeur encouraged learning in schools and he did his part writing books, particularly\nLe dessin linéaire d'après la méthode de l'enseignement mutuel\n(1819)\nwhich popularised line drawing in French schools.\nFrancoeur is famed as a writer of excellent texts mostly based on lecture courses he gave. He published his mechanics book\nTraité de mécanique élémentaire, à l'usage des élèves de l'École Polytechnique, rédigé d'après les méthodes de R Prony\nⓉ\n(\nTreatise on elementary mechanics, for use by students of the Ecole Polytechnique, prepared by the methods of R Prony\n)\nin\n1800\n, an elementary course of mathematics in two volumes\nCours complet de mathématiques pures\nⓉ\n(\nA complete course of pure mathematics\n)\nin\n1809\n, and two astronomy texts\nl'Uranographie, ou Traité élémentaire d'astronomie, à l'usage des personnes peu versées dans les mathématiques, accompagné de planisphères\nⓉ\n(\nStar mapping or treatise on elementary astronomy, the use of beginners in mathematics, with maps of the stars\n)\n(1812)\nand\nAstronomie pratique, usage et composition de la Connaissance des temps\nⓉ\n(\nPractical Astronomy, use and composition of the Time Knowledge\n)\n(1830)\n. His other books include\nÉlémens de statique\nⓉ\n(\nElements of statics\n)\n(1810)\n,\nLa goniométrie\nⓉ\n(\nDirection finding\n)\n(1820)\n,\nL'enseignment du dessin linéaire\nⓉ\n(\nTeaching of linear drawing\n)\n(1827)\n,\nAstronomie practique\nⓉ\n(\nPractical Astronomy\n)\n(1830)\n,\nÉlémens de technologie\nⓉ\n(\nElements of technology\n)\n(1833)\n,\nGéodésie, ou Traité de la figure de la terre et de ses parties, comprenant la topographie, l'arpentage, le nivellement, la géomorphie terrestre et astronomique, la construction des cartes, la navigation, leçons données à la Faculté des sciences de Paris\nⓉ\n(\nGeodesy, or treatise on the shape of the earth and its parts, including topography, surveying, leveling, terrestrial and astronomical geomorphism, drawing maps, navigation, lessons taught at the Faculty of Science Paris\n)\n(1835)\n,\nAlgèbre supérieure\nⓉ\n(\nHigher Algebra\n)\n(1838)\n,\nMémoire sur l'Aréométrie\nⓉ\n(\nMemoir on the measurement of area\n)\n(1842)\n, and\nTraité d'arithmétique appliquée à la banque, au commerce, à l'industrie, etc., recueil de méthodes propres à résoudre les problèmes et à abréger les calculs numériques\nⓉ\n(\nTreatise on arithmetic  applied to banking, commerce, industry, etc., collection of methods to solve problems and to shorten numerical calculations\n)\n(1845)\n. Finally, let us also mention his text\nFlore parisienne ou Description des caractères de toutes les plantes qui croissent naturellement aux environs de Paris, distribuées suivant la méthode du jardin des plantes\nⓉ\n(\nDescription of Parisiam Flora or characters of all plants that grow naturally around Paris, distributed according to the method of garden plants\n)\n(1800\n-\n01)\n.\nMany of these works were dedicated to famous mathematicians, for example the\nÉlémens de statique\nⓉ\n(\nElements of statics\n)\nwas dedicated to\nPierre-Simon Laplace\n, the\nGéodésie\nⓉ\n(\nGeodesy\n)\nwas dedicated to\nLouis Puissant\n, and the fifth edition\nl'Uranographie\nⓉ\n(\nStar mapping\n)\npublished in\n1837\nwas dedicated to\nFrançois Arago\n, the fourth edition of\n1828\nhaving been dedicated to\nSadi Carnot\nwho died in\n1832\n.\nIt was for his work in line drawing that Francoeur became most famous, the method he proposed being known as \"Francoeur's method\". It was first used in a school in Libourne in Aquitaine in south-western France which had been founded by Élie, duc Decazes. His method was published in\n1819\nin\nLe dessin linéaire d'après la méthode de l'enseignement mutuel\nbut, before publication of this book, Francoeur had submitted a report on his method to the Société pour l'enseignement élémentaire on\n22\nJuly\n1818\n. Extracts from this report are given in\n[\n5\n]\n. Francoeur's method was used in countries other than France. For example William B Fowle translated Francoeur's book into English and published it as\nAn Introduction to Linear Drawing: Translated from the French of M. Francoeur, and Adapted to the Use of Public Schools in the United States\n(1825)\n[\n3\n]\n:-\nFowle's text, which was used by students attending Cambridge High School as early as\n1841\n, teaches drawing according to the mastery of basic geometric shapes. Fowle was a staunch advocate of mandatory drawing classes in public schools and also served as editor of the 'Common School Journal'.\nAn anonymous review of a later edition of Fowle's translation of Francoeur's text appeared in\n1842\nthe\nCommon School Journal\n:-\nThe little work upon 'Linear Drawing' exhibits a plan of teaching large classes at once, by means of a black-board, all the elements of the art of drawing. The teacher stands at the board, draws and explains every line - linear, oblique, curved - and then proceeds to copy from patterns, or objects - explaining every thing in the process - while the pupils copy each line,\n[\nand so on\n]\n, upon their slates or paper, as she slowly proceeds.\nFrancoeur, in his report of\n1818\n, describes how the students are divided into four classes\n[\n5\n]\n:-\nThe lower\n[\nclass\n]\ntraces the lines, parallels, perpendiculars, triangles, etc. In the second class, students make circles, regular polygons and plane figures that depend on them. In the third, they mimic perspective in some three-dimensional bodies, such as pyramids, prisms, cylinders, cones, spheres, etc. In the fourth class, they draw some architectural features, vases and ornaments of their choice.\nWe explained as the beginning of this biography that Francoeur came from an exceptionally musical family so it will come as no surprise that he also reported to the Société pour l'enseignement élémentaire on the teaching of singing and the Society adopted the method he proposed.\nAmong the honours Francoeur received was election to the\nAcadémie des Sciences\nin\n1842\n. He was elected to the many other Academies including St Petersburg, Lisbon, Edinburgh, Rouen, Lyon, Cambra, and Toulouse.\nFrom\n1840\nan illness of the larynx curtailed his activities and he visited many spas looking for a cure by taking the waters. The illness forced him to retire from his chair in the Faculty of Sciences in\n1845\n. He health deteriorated further through a disease of his spinal chord and eventually he went blind forcing him to stop all his activities. He died at Fontainbleau and was buried at Chatillon-la-Borde\n(\nSeine-et-Marne\n)\n.\nFinally we note that Francoeur's son, Isidore Francoeur, the author of\n[\n1\n]\n, was himself a professor of mathematics at the Collège Chaptal and at the École des Beaux-Arts. He bequeathed to them his library and that of his father. Isidore Francoeur's widow made a gift to set up the mathematics prize the Prix Francoeur.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}