{
  "nome_completo": "Louis Couturat",
  "nome_curto": "Louis Couturat",
  "ano_nascimento": "1868",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Couturat/",
  "lugar_nascimento": "Ris-Orangis (near Paris), France",
  "lugar_morte": "Between Ris-Orangis and Melun, France",
  "biografia": "Louis Couturat\nshowed talents as a child over a large range of different topics as well as displaying artistic skills. He won prizes in most subjects he studied at the Lycée and he entered the École Normale Supérieure in Paris in\n1887\n. After three years of study he was awarded the lauréat in philosophy and mathematics. He continued to study mathematics at the École Normale Supérieure, being taught by\nJules Tannery\nin academic year\n1890\n-\n91\n, then studying with\nÉmile Picard\nand\nCamille Jordan\nduring\n1891\n-\n92\n. In this year he also attended lectures by\nPoincaré\nand graduated on\n25\nJuly\n1892\nwith his licentiate in mathematics.\nAt this stage in his education, before undertaking research for his doctorate, Couturat published a paper on\nZeno of Elea\n's paradox of Achilles and the Tortoise in the\nRevue philosophique\n. For his doctorate he worked on two theses, one being a Latin thesis which made a scientific study of the myths of\nPlato\nin the\nDialogues\n, the other being a mathematical thesis on infinity. We will say more below about the content of this thesis, written at a time when\nCantor\n's ideas of the infinite were causing vigorous arguments and discussions among mathematicians and philosophers. Both of his theses were completed by May\n1894\nbut it was two years later before he defended his theses at the Sorbonne and was awarded his doctorate with the highest distinction. The mathematical thesis was published as\nDe l'Infini mathématique\nⓉ\n(\nFrom the mathematical infinity\n)\n(1896)\n.\nIn this work Couturat argued strongly in favour of the actual infinite.\nDedekind\n,\nKronecker\n, and\nHelmholtz\nwere already strong advocates of formalist theories so Couturat took a stand against major established figures - a brave move in a doctoral thesis. For him the actual infinite was a generalisation of number, in the same way that negative numbers, fractions, irrational numbers and complex numbers had all been seen at extending the concept of number. Couturat argued that all of these generalisations had at first encountered strong opposition, but had become accepted in the end because they were suitable for representing new magnitudes and they allowed a calculus of operations which was impossible before their introduction. Infinite numbers, he claimed, were necessary in order to maintain the continuity of magnitudes.\nCouturat became professor at the University of Toulouse in\n1895\nand taught philosophy there, lecturing on Lucretius and\nPlato\n. He obtained unpaid leave of absence and was able to undertake further study in Paris at the time when he defended his theses there. Of course for Couturat to be able to take unpaid leave he had to have independent means. Indeed he was well off and had no need to work to earn his living. During this leave of absence he attended lectures by Edmond Bouty and Victor Robin at the Sorbonne. In\n1897\nhe moved to the University of Caen, taking up his appointment on\n27\nOctober, and there he taught mathematical philosophy. He remained in Caen until\n1899\nwhen he moved to Paris, again taking leave of absence, to continue his research on the logic of\nLeibniz\n. During\n1900\n-\n01\nhe worked in Hanover studying the unpublished works of\nLeibniz\nin the Royal Library. He published\nLa Logique de Leibniz\nⓉ\n(\nThe logic of Leibniz\n)\n(1901)\nin which he wrote that\nLeibniz\n's:-\n... logic was not only the heart and soul of his system, but the centre of his intellectual activity, the source of all his discoveries, ... the obscure or at least concealed hearth from which sprang so many flashes of lightning.\nCouturat published many previously unpublished manuscripts of\nLeibniz\nin\nOpuscules et fragments inédits de Leibniz\nⓉ\n(\nBooklets and unpublished fragments of Leibniz\n)\n(1903)\n. This work on\nLeibniz\nbrought Couturat into contact with\nRussell\n, who had published\nA Critical Exposition of the Philosophy of Leibniz\n(1900)\n. Couturat produced, in\n1905\n, an edition of\nRussell\n's\nPrincipia Mathematica\nwith a commentary on contemporary works on the subject. In fact the Couturat-\nRussell\ncorrespondence began in\n1897\n, the first letter being from Couturat to\nRussell\nconcerning the\nRussell\n's\nAn essay in the foundations of geometry\n.  Couturat published a review of this essay of\nRussell\nin\n1898\nand the review, and\nRussell\n's reply to it, attracted\nPoincaré\n's attention to\nRussell\n's work. In\n[\n16\n]\n198\nletters and postcards between Couturat and\nRussell\n, found in the\n1970\ns, are described. The topics covered in the correspondence include: the foundations of geometry, extension versus intension in logic, the\nRussell\nparadox, the\naxiom of choice\n, the controversies with\nPoincaré\n, logic,\nLeibniz\n,\nPeano\n, Kant, arithmetical induction, mathematical existence, politics, international language, and some personal matters.\nIn\n1905\nCouturat became Henri-Louis Bergson's assistant at the Collège de France, working on the history of logic during the academic year\n1905\n-\n06\n.\n[\nBergson was the first philosopher to propose what is today called a process philosophy, that is one which rejected static values in favour of values of motion, change, and evolution.\n]\nThe article\n[\n7\n]\ndiscusses Couturat's inaugural lecture at the Collège de France in which he argued against the irrationalism of his time and firmly rejected all attempts to subordinate philosophy to psychology, sociology, or religion. He argued that philosophy must remain true to itself, and affirm its freedom from other disciplines. Following his year at the Collège de France, Couturat took no further employment and devoted himself to his researches. F C Kreiling writes:-\nOutside of France he is generally known for his\nLeibniz\nstudies, but he was distinctly a philosopher in his own right, with a central interest in mathematical logic.\nLeibniz\nhad proposed a calculus of reason which would allow the mind to think directly of things themselves. He wanted this calculus of reason to be supported by a logical universal language. Couturat, following his hero\nLeibniz\n, became a prime mover in the development of the international language Ido based on Esperanto\n[\n1\n]\n:-\nOn\n1\nOctober\n1907\ndelegates from\n310\nsocieties throughout the world met and elected a committee to modify Esperanto. Couturat and Léau were the secretaries. With the collaboration of the Akademie di la Lingue Internaciona Ido, created in\n1908\n, Couturat constructed the complete vocabulary of Ido, a language derived from Esperanto with reforms growing out of scientific linguistic principles. Couturat stood firmly for the application of his own logical principles, despite opposition from many quarters to changes in the already established forms of Esperanto.\nHis other work includes\nL'Algèbre de la logique\nⓉ\n(\nThe algebra of logic\n)\n(1905)\nand\nLes Principes des Mathematiques\nⓉ\n(\nThe principles of mathematics\n)\n(1905)\n.\nCouturat was killed in a car accident, his car being in hit by the car carrying the orders for mobilisation of the French army the day World War I broke out. Ironically he was a noted pacifist.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}