{
  "nome_completo": "Louis Antoine de Bougainville",
  "nome_curto": "Louis-Antoine de Bougainville",
  "ano_nascimento": "1729",
  "ano_morte": "1811",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bougainville/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Louis-Antoine de Bougainville\n's father was Pierre-Yves de Bougainville. He was a notary, that is a public official who authenticates writings such as deeds and takes affidavits, and depositions. It was not a profession which appealed to his son, Louis-Antoine, who made career decisions to avoid following in his father's footsteps.\nAfter completing his secondary schooling Bougainville was influenced by\nd'Alembert\nand he wrote\nTraité du calcul -intégral\nin\n1752\n. This extended\nde l'Hôpital\n's book, written more that half a century earlier, to cover the integral calculus and also updated the differential calculus providing an up-to-date text. George writes in\n[\n1\n]\n:-\nHe bought such clarity and order to the subject, as well as incorporating new work, that he achieved immediate recognition. The\nAcadémie des Sciences\nnoticed the work in January\n1753\n. It was published the following year ...\nThis work led to Bougainville's election to the\nRoyal Society of London\nin\n1756\n. Also in\n1756\nhe published a second volume but this marks the end rather than the beginning of his career as a mathematician.\nBougainville then gave up mathematics. He had joined the army in\n1754\nand now, in\n1756\n[\n3\n]\n:-\n... he went to Canada as aide-de-camp to Gen. Louis-Joseph de Montcalm and distinguished himself against the British in the French and Indian War.\nBack in France he left the army in\n1763\nand joined the navy. In\n1764\nsailed from France out into the Atlantic and sailed down the coast of South America to the Falkland Islands where he established a French colony.\nIn\n1766\nthe French government commissioned Bougainville to sail round the world. No Frenchman had ever sailed round the world, but many islands had been discovered in the Pacific and many European nations joined in the search for new lands. The Englishman William Dampier had discovered New Hanover, New Britain, and New Ireland while in command of a Royal Navy ship. In\n1722\nthe Dutchman Jacob Roggeveen crossed the Pacific from east to west and discovered Easter Island, more of the Tuamotu Archipelago, some of the Society group, and some of the Samoan islands. The Englishman John Byron was sent in\n1765\nto try to find a southern continent which many believed must exist. He did not find a continent but he did find more of the Tuamotus and the southern Gilberts.\nBougainville had an open mind on the question of a southern continent. On the one hand he declared:-\n... that it is difficult to conceive such a number of low islands and almost drowned lands without a continent near them ...\nBut one the other hand he found it hard to believe that a southern continent existed for surely it would have been discovered by the earlier explorers:-\n... if any considerable land existed hereabouts we could not fail meeting with it.\nIn November\n1766\n, accompanied by naturalists and other scientists, Bougainville sailed from Nantes in the frigate La Boudeuse. He put into Brest for repairs and set off again on\n5\nDecember. He took much the same route via the Falkland Islands as he had when he set out in\n1764\n. He called in at Rio de Janeiro and there met up with his supply ship. On that ship was the botanist Commerson who had discovered a shrubby climbing deciduous plant whose flowers were insignificant but were surrounded by brilliant coloured purple-red papery bracts that lasted for a long time. He named the plant bougainvillea in honour of Bougainville.\nThe two ships left Rio de Janeiro in July\n1767\non their way to Montevideo. They left the River Plate in November\n1767\nand sailed through the Strait of Magellan in December. Bougainville went northwest through the South Pacific and by the end of March\n1768\nhe discovered islands in the archipelago of Tuamoto, now French Polynesia. Continuing he landed on Tahiti which he found had been discovered eight months earlier in\n1767\nby the Englishman Samuel Wallis. Bougainville then sailed west reaching what is now named Bougainville reef, just to the east of the Great Barrier reef. At this point he turned north, where he came very close to sighting Australia, reaching the Louisiade Archipelago, an island group of Papua New Guinea,\n200\nkm southeast of the island of New Guinea. Bougainville named the Archipelago after Louis XV of France.\nContinuing north he discovered two of the Treasury Islands. Then he sailed along the west coast of Choiseul island, in the western Solomon Islands, southeast of\n(\nnow named\n)\nBougainville Island across the\n(\nnow named\n)\nBougainville Strait. He then sailed for three days along the coast of the\n(\nnow named\n)\nBougainville Island which he described as\n[\n3\n]\n:-\n... a new coast which is of astonishing height.\nBougainville continued on to New Britain but, because his men were by then suffering from scurvy and his ships needed refitting, he stopped at Buru in the Moluccas in September\n1768\n. There he found a\n[\n3\n]\n:-\n... species of wild cat that carries her young in a pocket below her belly.\nAt Batavia\n(\nnow Jakarta\n)\nin Java, Bougainville stopped again before returning to Saint-Malo, in Brittany, in March\n1769\n.\nThis voyage made Bougainville the first Frenchman to sail round the World. He made systematic astronomical observations on his voyage which provided important navigation charts to later explorers. However\n[\n1\n]\n:-\nIt has been said by Frenchmen that, in spite of his mathematical abilities, Bougainville was no great navigator.\nThis seems a harsh judgement for someone who achieved so much on his voyage. Perhaps a quote from Bougainville himself, taken from\n[\n3\n]\nwhich describes his round-the-world voyage in detail, shows most clearly his attitude to exploration:-\nBut geography is a science of facts: one cannot speculate from an armchair without the risk of making mistakes which are often corrected only at the expense of the sailors.\nBougainville received great acclaim after he returned to France. He was promoted in both the navy and the army. In\n1772\nhe was appointed secretary to Louis XV. He married in\n1780\nand he had four children. From\n1779\nto\n1782\nhe served as commodore in operations of the French fleet off North America, supporting the American Revolution. On\n12\nApril\n1782\n, after a French defeat off Martinique, he was court-martialled.\nDuring the French Revolution, he escaped the massacres of Paris in\n1792\ndespite his well known Royalist views. He settled on his estate in Normandy and later Napoleon made him a senator, a count, and a member of the Legion of Honour.",
  "math_areas": [
    "Calculus"
  ]
}