{
  "nome_completo": "Louis Charles Karpinski",
  "nome_curto": "Louis Karpinski",
  "ano_nascimento": "1878",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Karpinski/",
  "lugar_nascimento": "Rochester, New York, USA",
  "lugar_morte": "Winter Haven, Florida, USA",
  "biografia": "Louis Karpinski\n's parents were Henry Hermanagle Karpinski\n(1852\n-\n1935)\nand Mary Louise Engesser. Henry Karpinski came from a family who lived in Warsaw, Poland, and Mary Louise Engesser came from a family from Guebweiler, Alsace. They were married in Manhattan, New York, on\n26\nNovember\n1875\n. Both had emigrated to the United States, Henry being nineteen years of age when he started a new life in Rochester, New York. There he worked for George Eastman\n(1854\n-\n1932)\nbefore moving with his family to Oswego, New York where he took over the Oswego Steam Dye Works from J R Summerville in\n1883\n.\n[\nIn the Oswego newspaper of\n1882\nthe Oswego Steam Dye Works is advertised as owned by J R Summerville but, by January\n1884\n, the advertisement gives Henry Karpinski as owner and states that J R Summerville was the former owner.\n]\nHere is a description of the business, a few years after Henry Karpinski took over\n[\n2\n]\n:-\nHenry Karpinski, practical steam dyer and scourer, is the popular and enterprising proprietor, which from the start has borne a very enviable reputation. Mr Karpinski was born in the famous city of Warsaw, Poland, but came to the United States quite a number of years ago. Being a thoroughly practical dyer and scourer, he inaugurated this business on his own responsibility, after he had been here a few years, which at the start bounded into public favour, and he soon built up a very liberal patronage. The premises utilized comprise the first floor of a fine three-story building, which is suitably arranged for the business, with a well equipped store and office in front, with dye works in the rear.\nLouis was the younger of his parents' two sons, having an older brother named Henry Joseph Karpinski born a couple of years earlier. Louis attended high school in Oswego where he studied the English and German curriculum. Karpinski became fluent in English, French, and German and, later in life. would write letters in all three languages. He didn't, however, learn his father's first language of Polish, a fact he rather regretted in later life. He showed himself to be highly intelligent, gaining a reputation as an outstanding chess player. He played at the highest level in matches organised by the New York State Chess Association. Karpinski graduated from Oswego High School in\n1894\nand continued his education at the Oswego State Normal School where he trained to be a school teacher. While at this school be won the New York State Chess Championship in\n1896\n.\nIn\n1897\nKarpinski obtained his teaching qualification from the Oswego State Normal School and, later that year, took a teaching job in Southold, a town on the north east end of Long Island, New York. He moved to Berea College, Kentucky, in January\n1898\nwhen he took up a teaching position in the Normal School which trained school teachers. At the time that Karpinski went there, this College trained students of all races but only six year later Kentucky passed a law preventing the education of black and white students together\n[\n6\n]\n:-\nThis Appalachian experience of training teachers to serve in poor mountain communities taught Karpinski about the large demands made on public-school teachers and convinced him of the need for a practical approach to teaching mathematics in order to educate a numerate population. These ideas would be incorporated in his later writing.\nKarpinski did not teach at Berea College for long since, in\n1899\n, he entered Cornell University to study mathematics. He had a very successful undergraduate career, playing chess at championship level, and winning prizes for public speaking. To realise the level at which he was playing chess, we note that in\n1901\nhe played Harry Nelson Pillsbury, the U.S. Chess Champion who had earlier won matches against the world champion Wilhelm Steinitz and against\nEmanuel Lasker\n. Karpinski, playing Black, lost this match to Pillsbury, which was played in Buffalo, but to be competing against the best chess player in the United States indicates Karpinski's abilities. His most important public speaking prize was the gold medal he won in the\n1901\nCornell University Woodford Prize Contest. He used his experience at Berea in his speech \"The Southern Mountaineer\" but this also demonstrates his concern for people and for social-economic problems. He graduated from Cornell University with a A.B. in\n1901\n.\nWith outstanding references, Karpinski sought a university position. He had been described as an\n(\nsee\n[\n6\n]\n)\n:-\n... excellent student, clear in thought, thorough in his work, good looking with fine manners, making a favourable impression ... he is human and takes a living active interest in the affairs of the day.\nHowever, he quickly realised that he required a Ph.D. to get a university post so, on\n1\nSeptember\n1901\n, he enrolled in the Kaiser Wilhelm University of Strasbourg. This university was German at this time and had been since Strasbourg had been annexed by Germany in the Franco-Prussian war of\n1870\n-\n71\n. He received some financial support from his parents and he made some money by taking a teaching position in the American College in Strasbourg which taught the children of rich Americans living there. His thesis advisor at Strasbourg was\nHeinrich Weber\nand Karpinski was awarded his doctorate in\n1903\nfor his number-theory thesis\nÜber die Verteilungen der quadratischen Reste\n. He had been examined by a committee consisting of\nHeinrich Weber\n,\nTheodor Reye\n, and the physicist Ferdinand Braun.\nReturning to the United States, Karpinski was employed at the Oswego State Normal School where he had obtained his teaching qualification a few years earlier. There he was appointed as head of physics and chemistry. He also taught arithmetic at the Normal School. Having taught there for the academic year\n1903\n-\n04\n, he took a summer teaching position at New York University in\n1904\n. He accepted an offer of an instructorship in mathematics at the University of Michigan and he began teaching there in the autumn of\n1904\n.\nKarpinski had been an undergraduate at Cornell University from\n1899\nto\n1901\n. Grace Maude Woods, the daughter of a county school superintendent in Lockport, New York, entered Cornell on a scholarship in the same year as Karpinski began his studies. They became close friends and Grace continued to study at Cornell while Karpinski was undertaking doctoral studies in Strasbourg. She graduated from Cornell in\n1904\nand, during\n1904\n-\n05\n, she taught physics, chemistry, Greek and Latin at a school in New Jersey. On\n20\nApril\n1906\nLouis Karpinski and Grace Woods were married; they had six children, Robert Whitcomb Karpinski, Mary Karpinski, Louise Karpinski, Ruth Karpinski, Joseph Louis Karpinski and Charles Elwin Karpinski.\nKarpinski's first publications were on the teaching of mathematics. He published\nNon Euclidean Geometry\n(1905)\n,\nFinger Reckoning\n(1908\n-\n09)\n,\nThe Decimal System of Numbers\n(1909)\n,\nReform in the Teaching of Mathematics\n(1909)\n,\nThe Program of the International Commission\n(1909)\n, and\nPreliminary Report of the International Commission on Secondary Mathematics\n(1909)\n. These were published in journals such as\nProceedings of the Michigan Schoolmasters' Club\n,\nThe School Review\nand\nAmerican Education\n. However, the most significant step in his career occurred in the academic year\n1909\n-\n10\nwhen he spent a year at Columbia University's Teachers College. The historian of mathematics\nDavid E Smith\nhad been appointed as a professor there in\n1901\nand during the year that Karpinski spent at the Teachers College, the two collaborated on writing the book\nThe Hindu-Arabic numerals\n(\nGinn and Company, Boston,\n1911)\n. We give the Preface to this book and short extracts from two reviews of the book at\nTHIS LINK\n.\nThe year working with\nDavid E Smith\nconverted Karpinski into a historian of mathematics, and he is best known today for his many papers on this topic. In fact the obituary\n[\n6\n]\n, written by the historian of mathematics Phillip Sanford Jones\n(1912\n-\n2002)\n, lists\n166\npublications by Karpinski\n(\nincluding many reviews\n)\n. He taught, from\n1904\nonwards, at the University of Michigan where he was promoted to Assistant Professor in\n1910\n, to Associate Professor in\n1914\n, and to full Professor in\n1919\n. The Classroom Profile\n[\n5\n]\n, written three years before he retired, explains that:-\nProfessor Louis C Karpinski is a mathematician of international reputation, but is well known also for his intense interest in maps and old books. Starting as a hobby, his search into the history of mathematics publications, and the history of America, has benefited the University to the extent that one of the world's largest collections on the history of science is in the University Library. Through his efforts, both the Clements Library and the General Library have been able to acquire photographs of historical material to supplement the maps, atlases and manuscripts in their archives. His sabbatical and several leaves of absence have taken him to Europe to follow his interests and to lecture, and add to the University Library by purchases and photography. In this connection, he claims to have \"visited more old bookshops than any living man.\" He has published innumerable works and articles on his various interests, among them his \"Bibliography of Mathematical Works Printed in America through\n1850\n,\" which starts with a Spanish work printed in\n1556\n, of which there are only three known copies.\nThe authors of\n[\n8\n]\nwrite:-\n... he located and studied manuscripts and early printed arithmetics of Spain, Italy, Provencal, and England, the latter culminated in the book \"Robert of Chester's Latin Translation of the Algebra of Al-Khwarizmi\"\n(1915)\n, which together with his extensive work on the algebra of\nAbu-Kamil\nis internationally known and cited. ... He was an inveterate traveller, and to the amazement of many of his colleagues frequently took along his whole family on trips abroad. Of course, this was not possible on a professor's salary, even when the dollar was worth more than it is now. It was the result of astute utilization of opportunities, clever financing, including the sale of map or book collections, and business sense.\nWhen Karpinski's interests moved to the history of mathematics, he certainly did not give up his interest in mathematical education. Having interests in the history of elementary mathematics and also in the teaching school level mathematics meant that Karpinski was able to put together exceptionally valuable courses for training secondary school teachers of mathematics. He was a co-author, with Harry Yandell Benedict\n(1869\n-\n1937)\nand John William Calhoun\n(1871\n-\n1947)\n, of the college level mathematics text\nUnified Mathematics\n(1918)\n. Charles Napoleon Moore\n(1882\n-\n1967)\nwrites in a review\n[\n13\n]\n:-\nThe work under consideration here has many excellent features. One of its principal merits may be found in the interesting way in which the theories developed are illustrated by numerous applications which are of real importance in the world of to day. This particular characteristic of the book is all the more commendable in view of the fact that many mathematical texts are rather lacking in this respect. ... the subject matter includes all the more important topics of algebra, trigonometry and analytical geometry that are ordinarily treated in freshman courses. Moreover, excellent use has been made of the relationship between these three fields and a real unification has been achieved. The arrangement of material is good both from a logical and a pedagogical standpoint. ...\nWe still have to give details of Karpinski's contributions to cartography. The Huntington Library contains an 'Inventory of the Louis Charles Karpinski Collection,\n1500\n-\n1799\n'. The background to Karpinski's map collection reads:-\nOne of\n[\nKarpinski's\n]\nimportant projects was to go to Europe and select unpublished manuscript maps relating to the history of America before\n1800\nfrom archives in France, Spain, and Portugal. These maps, which were difficult to obtain in the United States, were reproduced in large clear facsimile form to make them available for scholarly research here. His project was sponsored jointly by the Clements Library, Library of Congress, New York Public Library, Ayers Collection of the Newberry Library and the Huntington Library. Each institution was to receive a collection of facsimiles of the maps he selected and a copy of his inventory.\nThe paper\n[\n7\n]\nby Karpinski describes his contributions to cartography. In\n[\n14\n]\nMary Sponberg Pedley writes:-\nFor Great Lakes map enthusiasts and Michigan historians, the word \"Karpinski\" evokes two related phrases: \"Karpinski number\" or \"not in Karpinski.\" These phrases refer, of course, to the\n1931\n'Bibliography of the Prated Maps of Michigan', by Louis Karpinski, with its accompanying 'Historical Atlas of the Great Lakes and Michigan'.\nKarpinski was elected to the Comité International d'Histoire des Sciences in\n1928\nand, in\n1937\n, he was the American representative at the Symposium held in Paris on the life and work of\nRené Descartes\nwhich celebrated the tercentenary of the publication of his \"La Géométrie\". He was a member of the\nAmerican Mathematical Society\n, the\nMathematical Association of America\n, the American Association for the Advancement of Science, and the Historical Science Society. He was elected vice-president of the American Association for the Advancement of Science  in\n1939\nand president of the Historical Science Society in\n1943\n. At the summer meeting of the\nMathematical Association of America\nheld in the University of Michigan, Ann Arbor in September\n1919\nhe presented a Library exhibition:-\nThe mathematical and astronomical collections of the Library of the University of Michigan compare most favourably with any collections in America to be found outside of New York City. In the Exhibit, which was arranged for the Association meeting and which was visited by many during the sessions and on Friday afternoon when Professor Karpinski personally explained the collection, were placed all the works on the history of mathematics and astronomy, a fairly complete collection, the bibliographies, the dictionaries of mathematics and astronomy, the mathematical tables, and all mathematical and astronomical works in the library which were published before\n1800\n.\nOver many years Karpinski battled against health problems\n[\n8\n]\n:-\nFor over two decades he had had a series of operations and injections, suffered from anemia and diabetes, and surprised his contemporaries and colleagues by his ability to continue active, physically and mentally, in spite of these physical handicaps, simply because he had the will and determination to do so.\nAt the age of\n78\n, he died peacefully in his sleep.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}