{
  "nome_completo": "Luís Antoni Santaló Sors",
  "nome_curto": "Luís Antoni Santaló",
  "ano_nascimento": "1911",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Santalo/",
  "lugar_nascimento": "Girona, Spain",
  "lugar_morte": "Buenos Aires, Argentina",
  "biografia": "Luís Antoni Santaló\n's father was Silvestre Santaló i Palvorell\n(1875\n-\n1960)\nand his mother was Consol Sors, the daughter of the local doctor. Silvestre and Consol were married in Camattera in September\n1903\nand had seven children: Neus, Marcel, Joan, Luís\n(\nthe subject of this biography\n)\n, Dolors, Xavier and Maria. We note that Marcel also became a mathematician. On\n1\nDecember\n1905\nSilvestre Santaló became a teacher at the Escolar de Girona, which today is CEIP Joan Bruguera in the Gran Via de Jaume. Let us note at this point that Luís Antonio Santaló also gives his name as Lluis Antoni Santaló, and he uses this version of his first and second names on a couple of papers.\nIt was at the primary school that was part of the Escolar de Girona that Luís began his education. He was a shy but very bright pupil and as he grew up he exhibited a special ability to solve mathematical problems. At the secondary school he was taught mathematics by Lorenzo González Calzada, and Luís always appreciated his excellent teaching. Two of his fellow pupils were Jaume Vicens Vives and Santiago Sobrequés, both of whom became well-known historians. Luis completed his Baccalaureate in\n1927\n, when he was sixteen years old, but was undecided whether he should study Civil Engineering at the University of Barcelona or Exact Sciences at the Complutense University of Madrid.\nSantaló, perhaps influenced by his older brother Marcel who was studying mathematics at Madrid, moved to Madrid entering the Complutense University of Madrid. He lived in a university residence which provided an excellent intellectual environment and he took mathematics courses taught by, among others,\nJulio Rey Pastor\nand Esteban Terrades i Illa both of whom had a major influence on him. Esteban Terrades\n(1883\n-\n1950)\nhad been appointed to the chair of Differential Equations in Madrid in\n1932\n.\nRey Pastor\nhad by this time a permanent position in Argentina but made regular return visits to Spain to teach courses.\nSantaló completed his studies in Madrid in\n1934\n, having undertaken in parallel his part-time military service, and was awarded a Degree in Mathematics.\nAfter graduating, Santaló took up a position as a mathematics teacher at the Lope de Vega Institute, a middle school in Madrid. However, he was advised by\nRey Pastor\nto continue his studies in Germany, and\nRey Pastor\nhelped arrange a scholarship which enabled Santaló to go to Hamburg to work with\nWilhelm Blaschke\n. The Nazis under Hitler were in power in Germany by this time and Santaló felt very uncomfortable in the atmosphere that they were creating. However, the mathematics he was introduced to by\nBlaschke\nhe found very exciting.\nShiing-shen Chern\nwrites\n[\n9\n]\n:-\nIntegral geometry was the name coined by\nWilhelm Blaschke\nin\n1934\nfor the classical subject of geometric probability. During that year Luis Santaló came to Hamburg from Madrid and I\n[\nS S Chern\n]\nfrom China, and we sat in\nBlaschke\n's course on geometric probability. The main reference was an \"Ausarbeitung\" of a course by the same name given by\nG Herglotz\nin Göttingen. At the end of\n1934\nLuis Santaló found his now famous proofs of the isoperimetric inequality in the plane and\nBlaschke\nhimself found the fundamental kinematic formula and started a series of papers under the general title of \"integral geometry\". It was a fruitful and enjoyable year for all concerned.\nSantaló returned to Madrid and submitted his thesis\nNuevas aplicaciones al concepto de medida cinemática en el plano y en el espacio\nⓉ\n(\nNew applications of the concept of kinematic measurement in the plane and in space\n)\nto the University of Madrid and was awarded a doctorate in\n1936\n. He was still in Madrid, enjoying a holiday, when the outbreak of the civil war caused major disruption to his career.\nSpain was plunged into a civil war in July\n1936\n. The war began with a military coup against the left-wing Popular Front government which had been elected near the beginning of\n1936\n. This coup did not achieve a quick success and the country was split between the Republicans, who were loyal to the left-wing democratically elected government, and the Nationalist led by the fascist General Francisco Franco. Santaló left Madrid and returned to his home town of Girona where he joined the Republican air force. He was sent first to the pilot school in Murcia, then to Barcelona to the School of Military Aviation, directed by Josep Canudas. There he attained the rank of Captain. Although the Spanish Civil War is known as a civil war, in fact the Nationalist side was supported by both Germany and Italy who supplied both air power and troops. The war raged on with the Republicans slowly losing territory and by the middle of\n1938\nthey held two areas which were not connected. By early\n1939\nthe Republicans were defeated and Santaló together with many of his fellow soldiers and civilian refugees, escaped from Barcelona to France. The journey was horrific in extremely harsh winter weather.\nSantaló was now one of around\n500\n,\n000\nSpanish refugees in France but they were not welcomed there, especially the Republican soldiers. In fact Santaló was sent to a concentration camp at Argeles sur Mer but managed to escape to Collioure from where he wrote to\nRey Pastor\nand\nBlaschke\nasking for help. Given the political situation,\nBlaschke\nknew that Germany was no place to invite Santaló to come, so he wrote to\nÉlie Cartan\nwho invited Santaló to Paris where, in March\n1939\n, he delivered three lectures at the Institut\nHenri Poincaré\non integral geometry and geometric probabilities. Unable to return to Spain, he went to Portugal, arriving in Lisbon. There he learnt that World War II had just started but that Portugal had announced its intention to remain neutral. Santaló knew that many of his fellow Republicans had, after fleeing to France, been shipped to South America. He was also aware that\nRey Pastor\nwas in Argentina and had strongly advised him to do the same. He decided to emigrate to Argentina, and arrived in the port of Buenos Aires on\n12\nOctober\n1939\n. On arrival he was met by another Spanish mathematician, Manuel Balanzat\n(1912\n-\n1994)\n, who had arrived in Argentina after a similar experience to Santaló, having fled to France at the end of the Spanish Civil War and from there sailing to Argentina.\nJulio Rey Pastor\nhad arranged for Balanzat to meet Santaló when his ship arrived in Buenos Aires. This began a friendship between Santaló and Balanzat which lasted throughout their lives.\nOnce in Argentina, Santaló went to the city of Rosario in the Province of Santa Fe, on the banks of the Rio Paraná where\nRey Pastor\nhad arranged for him to be appointed to the National University of the Littoral. Founded in\n1889\nas the Provincial University of Santa Fe, it became the National University of the Littoral in\n1919\n. Santaló taught courses in the Faculty of Mathematical, Physical-Chemical and Natural Sciences Applied to Industry which was at that time about to set up a Mathematical Institute. The head of this new Mathematical Institute was the\n64\nyear old\nBeppo Levi\nwho had been dismissed from his chair of the theory of functions at the University of Bologna due to Mussolini's July\n1938\nanti-Semitic Manifesto of Race which removed Italian citizenship from Jews and banned them from jobs in education.\nBeppo Levi\nhad emigrated to Argentina with his wife and two daughters to take up the position as head of the new Mathematical Institute of the National University of the Littoral. Santaló was appointed as Principal Investigator and Deputy Director of the Institute, positions he held for ten years from\n1939\nto\n1949\n.\nRemarkably, although\nBeppo Levi\nwas\n64\nwhen he took up the positions of professor and director of the Mathematical Institute in Rosario, he was able to continue to teach, undertake research and undertake administrative duties for a further\n20\nyears. Hence Levi was there for ten years after Santaló left but the two would continue to collaborate.\nWhile in Rosario, Santaló met Hilda Rossi, who was of Swiss descent, and they were married in\n1945\n. Also while in Rosario, their daughter Maria Inés\n(\nknown as Tessi\n)\nwas born in\n1947\n. She was the first of their three children, the other two being Alicia and Claudia.\nWith a grant to study differential geometry from the Guggenheim Foundation he spent the academic year\n1948\n-\n49\nat Princeton accompanied by his wife and daughter. There he met\nAlbert Einstein\n,\nJohn von Neumann\n,\nDeane Montgomery\n,\nHermann Weyl\nand\nKurt Gödel\n, and also renewed his friendship with\nS S Chern\nwith whom he had spent a year in Hamburg. Also during this period he visited the University of Chicago, invited by\nMarshall Stone\n, and gave a course of lectures. At Chicago he met\nSaunders Mac Lane\n,\nAndré Weil\n,\nHassler Whitney\n,\nAntoni Zygmund\nand other leading mathematicians. While in the United States, Santaló received a number of offers of positions in that country but, certainly influenced by his family, he decided to return to Argentina.\nBack in Argentina, Santaló was appointed as a Professor of Higher Mathematics at the National University of La Plata in the city of La Plata, in the Province of Buenos Aires. His second daughter Alicia was born in La Plata but times were hard financially so Santaló took on a number of additional roles. He served as a Member of the Mathematical Section of the National Commission for Atomic Energy from\n1952\nto\n1957\nand, between\n1955\nand\n1959\n, he was Professor of Geometry at the Technical School of the Army. La Plata is only about\n50\nkm from Buenos Aires and Santaló was often at the University of Buenos Aires, supervising the theses of his first two doctoral students, Leticia Varela\n(\nwho received a Ph.D. in\n1952)\nand of Alberto Ayub\n(\nwho received a Ph.D. in\n1955)\n. Around this time his third daughter Claudia was born.\nBy\n1957\nSantaló already had almost\n100\npublications and, as one of the foremost mathematicians in Argentina, it is not surprising that in that year he became a full professor in the Faculty of Exact and Natural Sciences at the University of Buenos Aires. The family settled in a modest apartment on the Calle Cochabamba in the San Telmo district of Buenos Aires. The full professorship allowed him to give up the multiple jobs that he had taken on earlier and he was able to concentrate fully on teaching and research.\nSantaló wrote several books, some in English and some in Spanish:\nIntroduction to Integral Geometry\n(1953)\n;\nGeometrias no Euclidianas\nⓉ\n(\nNon-Euclidean geometry\n)\n(1961)\n;\nGeometria proyectiva\nⓉ\n(\nProjective geometry\n)\n(1966)\n;\nIntegral Geometry and Geometric Probability\n(1976)\n;\nVectores y tensores con sus aplicaciones\nⓉ\n(\nVectors and tensors with their applications\n)\n(1977)\n.\nA summary of his contributions is given in\n[\n16\n]\n:-\nA pioneer in the field of integral geometry, he published over two hundred research papers on integral geometry, metric geometry, affine geometry, projective differential geometry, the geometry of convex bodies, number theory, geometric probability and unified field theory. His works, which have been particularly influential in the scientific community of Spanish-speaking nations, were published in the major North American, British, German and Russian scientific journals. Although the mathematical work of Santaló was basic research, some of his findings were of decisive importance for other applied disciplines, particularly in operative research, biology and stereology. A key aspect of Santaló's work was his profound contribution to social progress and his constant efforts to modernize the teaching of mathematics in Spanish-speaking countries. Part of his work was devoted to this end in the form of articles and books on the teaching of mathematics in secondary education.\nIn a\n1982\ninterview, Santaló spoke about the importance of mathematics and mathematical education\n[\n20\n]\n:-\nWhen speaking of the resources of a country there is one, usually scarce, that it is not customary to mention: mathematical talents. Every child captures the essence of our science, but only some, naturally gifted, will come to stand out or attempt creative work. We know that they bloom at a very early age and if they are not educated then they fail; it is the duty of the school to discover and guide them; it is society's obligation to offer them an opportunity for their development. The rest of the citizens, without that special capacity or vocation, must, however, learn all the mathematics necessary to understand the world we live in. To ignore the language to which the sciences aspire and use its techniques, is to be locked away in illiteracy that a civilized country can not tolerate. Here the price of mismanagement is dependence, the loss of sovereignty.\nHe received much recognition in Argentina during his career: the First National Prize for Culture\n(1954)\n, the Prize of the Argentine Scientific Society\n(1959)\nand he was elected to the National Academy of Exact and Natural Sciences\n(1960)\n. Also in Spain his achievements were recognised was awards. He was elected to the\nRoyal Academy of Exact, Physical and Natural Sciences of Madrid\n(1955)\n, elected to the Royal Academy of Sciences and Arts of Barcelona\n(1970)\n, awarded an honorary doctorate by the Polytechnic University of Catalonia\n(1977)\n, was awarded the Prince of Asturias Prize for Scientific Research\n(1983)\n, and awarded the Narcis Monturiol Medal for Science and Technology of the Generalitat of Catalonia\n(1984)\n. The citation for this award reads:-\nThe Jury values in Professor Santaló his outstanding research in various fields of mathematics, especially in integral geometry, of great importance in the development of modern tendencies in this science. His research, combined with exemplary university work, form the personality of this great Spanish-American mathematician, internationally recognised and considered as one of the most important contemporary geometricians.\nHe was awarded an honorary doctorate by the Autonomous University of Barcelona\n(1986)\n, awarded an honorary doctorate by the University of Seville\n(1990)\n, awarded the Medal of the University of Valencia\n(1993)\n, awarded the Cross of Saint George from the Generalitat de Catalunya\n(1994)\n, awarded the Tribute of Alfonso X\n(\nThe Wise\n)\n, granted by King Juan Carlos, by the Ambassador of Spain in Argentina\n(1996)\nand made an Honorary Member of the Spanish Royal Mathematical Society\n(1999)\n. The University of Girona created the Santaló Chair on July\n27\n,\n2000\n.\nFor a speech he gave on the occasion of his award of an honorary doctorate by the University of Seville, see\nTHIS LINK\n.\nAs to his character and interests outside mathematics, Santaló said he had a total ineptitude for manual tasks and little interest in so-called cultured music; liking folk songs and, above all, tangos. In literature he preferred Agatha Christie's detective novels and short stories. In sports he watched football on television but regretted that new scheduling diminished the number of games.\nFor several quotes which tell us something of his character, see\nTHIS LINK\n.\nLet us end this biography by quoting from the Preface to\n[\n2\n]\nwritten by\nSimon Donaldson\n:-\nThe word geometry can cover many different things. The paths that can be traced from the most ancient concepts to sophisticated modern abstractions form one of the charms of the subject. We can all agree that the study of lines in three dimensional Euclidean space is a part of geometry. It is a wonderful idea that the set of all lines can itself be considered as a space, which has in turn its own geometry. Of course this leap into abstraction may seem commonplace now ... Modern differential geometry provides the language and tools for doing calculus on such spaces and in particular for integration. Then we can talk about the volume of a set of lines, the mean value of a function on the space of lines and so on. This is the beginning of Integral Geometry, to which Luis Santaló contributed so much.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}