{
  "nome_completo": "Luca Pacioli",
  "nome_curto": "Luca Pacioli",
  "ano_nascimento": "1445",
  "ano_morte": "1517",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pacioli/",
  "lugar_nascimento": "Sansepolcro (now Italy)",
  "lugar_morte": "Sansepolcro (now Italy)",
  "biografia": "Luca Pacioli\n's father was Bartolomeo Pacioli, but Pacioli does not appear to have been brought up in his parents house. He lived as a child with the Befolci family in Sansepolcro which was the town of his birth. This town is very much in the centre of Italy about\n60\nkm north of the city of Perugia. As far as Pacioli was concerned, perhaps the most important feature of this small commercial town was the fact that Piero della\nFrancesca\nhad a studio and workshop in there and della\nFrancesca\nspent quite some time there despite frequent commissions in other towns\nAlthough we know little of Pacioli's early life, the conjecture that he may have received at least a part of his education in the studio of\ndella Francesca\nin Sansepolcro must at least have a strong chance of being correct. One reason that this seems likely to be true is the extensive knowledge that Pacioli had of the work of\nPiero della Francesca\nand Pacioli's writings were very strongly influenced by those of\nPiero\n.\nPacioli moved away from Sansepolcro while he was still a young lad. He moved to Venice to enter the service of the wealthy merchant Antonio Rompiasi whose house was in the highly desirable Giudecca district of that city. One has to assume that Pacioli was already well educated in basic mathematics from studies in Sansepolcro and he certainly must have been well educated generally to have been chosen as a tutor to Rompiasi's three sons. However, Pacioli took the opportunity to continue his mathematical studies at a higher level while in Venice, studying mathematics under Domenico Bragadino. During this time Pacioli gained experience both in teaching, from his role as tutor, and also in business from his role helping with Rompiasi's affairs.\nIt was during his time in Venice that Pacioli wrote his first work, a book on arithmetic which he dedicated to his employer's three sons. This was completed in\n1470\nprobably in the year that Rompiasi died. Pacioli certainly seemed to know all the right people for he left Venice and travelled to Rome where he spent several months living in the house of\nLeone Battista Alberti\nwho was secretary in the Papal Chancery. As well as being an excellent scholar and mathematician,\nAlberti\nwas able to provide Pacioli with good religious connections. At this time Pacioli then studied theology and, at some time during the next few years, he became a friar in the Franciscan Order.\nIn\n1477\nPacioli began a life of travelling, spending time at various universities teaching mathematics, particularly arithmetic. He taught at the University of Perugia from\n1477\nto\n1480\nand while there he wrote a second work on arithmetic designed for the classes that he was teaching. He taught at Zara\n(\nnow called Zadar or Jadera in Croatia but at that time in the Venetian Empire\n)\nand there wrote a third book on arithmetic. None of the three arithmetic texts were published, and only the one written for the students in Perugia has survived. After Zara, Pacioli taught again at the University of Perugia, then at the University of Naples, then at the University of Rome. Certainly Pacioli become acquainted with the duke of Urbino at some time during this period. Pope Sixtus IV had made Federico da Montefeltro the duke of Urbino in\n1474\nand Pacioli seems to have spent some time as a tutor to Federico's son Guidobaldo who was to become the last ruling Montefeltro when his father died in\n1482\n. The court at Urbino was a notable centre of culture and Pacioli must have had close contact with it over a number of years.\nIn\n1489\n, after two years in Rome, Pacioli returned to his home town of Sansepolcro. Not all went smoothly for Pacioli in his home town, however. He had been granted some privileges by the Pope and there was a degree of jealousy among the men from the religious orders in Sansepolcro. In fact Pacioli was banned from teaching there in\n1491\nbut the jealousy seemed to be mixed with a respect for his learning and scholarship for in\n1493\nhe was invited to preach the Lent sermons.\nDuring this time in Sansepolcro, Pacioli worked on one of his most famous books the\nSumma de arithmetica, geometria, proportioni et proportionalita\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\nwhich he dedicated to Guidobaldo, the duke of Urbino. Pacioli travelled to Venice in\n1494\nto publish the\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\n. The work gives a summary of the mathematics known at that time although it shows little in the way of original ideas. The work studies arithmetic, algebra, geometry and trigonometry and, despite the lack of originality, was to provide a basis for the major progress in mathematics which took place in Europe shortly after this time. As stated in\n[\n1\n]\nthe\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\nwas:-\n... not addressed to a particular section of the community. An encyclopaedic work\n(600\npages of close print, in folio\n)\nwritten in Italian, it contains a general treatise on theoretical and practical arithmetic; the elements of algebra; a table of moneys, weights and measures used in the various Italian states; a treatise on double-entry bookkeeping; and a summary of\nEuclid\n's geometry. He admitted to having borrowed freely from\nEuclid\n,\nBoethius\n,\nSacrobosco\n,\nFibonacci\n, ...\nThe geometrical part of Pacioli's\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\nis discussed in detail in\n[\n6\n]\n. The authors write:-\nThe geometrical part of L Pacioli's Summa\n[\nVenice,\n1494]\nin Italian is one of the earliest printed mathematical books. Pacioli broadly used\nEuclid\n's Elements, retelling some parts of it. He referred also to Leonardo of Pisa\n(\nFibonacci\n)\n.\nAnother interesting aspect of the\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\nwas the fact that it studied games of chance. Pacioli studied the problem of points, see\n[\n9\n]\n, although the solution he gave is incorrect.\nLudovico Sforza was the second son of Francesco Sforza, who had made himself duke of Milan. When Francesco died in\n1466\n, Ludovico's elder brother Galeazzo Sforza became duke of Milan. However, Galeazzo was murdered in\n1476\nand his seven year old son became duke of Milan. Ludovico, after some political intrigue, became regent to the young man in\n1480\n. With very generous patronage of artists and scholars, Ludovico Sforza set about making his court in Milan the finest in the whole of Europe. In\n1482\nLeonardo da Vinci\nentered Ludovico's service as a court painter and engineer. In\n1494\nLudovico became the duke of Milan and, around\n1496\n, Pacioli was invited by Ludovico to go to Milan to teach mathematics at Ludovico Sforza's court. This invitation may have been made at the prompting of\nLeonardo da Vinci\nwho had an enthusiastic interest in mathematics.\nAt Milan Pacioli and\nLeonardo\nquickly became close friends. Mathematics and art were topics which they discussed at length, both gaining greatly from the other. At this time Pacioli began work on the second of his two famous works,\nDivina proportione\nⓉ\n(\nDivine proportion\n)\nand the figures for the text were drawn by\nLeonardo\n. Few mathematicians can have had a more talented illustrator for their book! The book which Pacioli worked on during\n1497\nwould eventually form the first of three books which he published in\n1509\nunder the title\nDivina proportione\nⓉ\n(\nDivine proportion\n)\n(\nsee for example\n[\n3\n]\n)\n. This was the first of the three books which finally made up this treatise, and it studied the 'Divine Proportion' or '\ngolden ratio\n' which is the ratio\na\n:\nb\n=\nb\n:\n(\na\n+\nb\n)\na : b = b : (a + b)\na\n:\nb\n=\nb\n:\n(\na\n+\nb\n)\n. It contains the theorems of\nEuclid\nwhich relate to this ratio, and it also studies regular and semiregular polygons\n(\nsee in particular\n[\n4\n]\nfor a discussion of Pacioli's work on regular polygons\n)\n. Clearly the interest of\nLeonardo\nin this aesthetically satisfying ratio both from a mathematical and artistic point of view was an important influence on the work. The golden ratio was also of importance in architectural design and this topic was to form the second part of the treatise which Pacioli wrote later. The third book in the treatise was a translation into Italian of one of\ndella Francesca\n's works.\nLouis XII became king of France in\n1498\nand, being a descendant of the first duke of Milan, he claimed the duchy. Venice supported Louis against Milan and in\n1499\nthe French armies entered Milan In the following year Ludovico Sforza was captured when he attempted to retake the city. Pacioli and\nLeonardo\nfled together in December\n1499\n, three months after the French captured Milan. They stopped first at Mantua, where they were the guests of Marchioness Isabella d'Este, and then in March\n1500\nthey continued to Venice. From Venice they returned to Florence, where Pacioli and\nLeonardo\nshared a house.\nThe University of Pisa had suffered a revolt in\n1494\nand had moved to Florence. Pacioli was appointed to teach geometry at the University of Pisa in Florence in\n1500\n. He remained in Florence, teaching geometry at the university, until\n1506\n.\nLeonardo\n, although spending ten months away working for Cesare Borgia, also remained in Florence until\n1506\n. Pacioli, like\nLeonardo\n, had a spell away from Florence when he taught at the University of Bologna during\n1501\n-\n02\n. During this time Pacioli worked with\nScipione del Ferro\nand there has been much conjecture as to whether the two discussed the algebraic solution of\ncubic equations\n. Certainly Pacioli discussed this topic in the\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\nand some time after Pacioli's visit to Bologna,\ndel Ferro\nsolved one of the two cases of this classic problem.\nDuring his time in Florence Pacioli was involved with Church affairs as well as with mathematics. He was elected the superior of his Order in Romagna and then, in\n1506\n, he entered the monastery of Santa Croce in Florence. After leaving Florence, Pacioli went to Venice where he was given the sole rights to publish his works there for the following fifteen years. In\n1509\nhe published the three volume work\nDivina proportione\nⓉ\n(\nDivine proportion\n)\nand also a Latin translation of\nEuclid\n's\nElements\n. The first printed edition of\nEuclid\n's\nElements\nwas the thirteenth century translation by\nCampanus\nwhich had been published in printed form in Venice in\n1482\n. Pacioli's edition was based on that of\nCampanus\nbut it contained much in the way of annotation by Pacioli himself.\nIn\n1510\nPacioli returned to Perugia to lecture there again. He also lectured again in Rome in\n1514\nbut by this time Pacioli was\n70\nyears of age and nearing the end of his active life of scholarship and teaching. He returned to Sansepolcro where he died in\n1517\nleaving unpublished a major work\nDe Viribus Quantitatis\nⓉ\n(\nOn the powers of numbers\n)\non recreational problems, geometrical problems and proverbs. This work makes frequent reference to\nLeonardo da Vinci\nwho worked with him on the project, and many of the problems in this treatise are also in\nLeonardo\n's notebooks. Again it is a work for which Pacioli claimed no originality, describing it as a compendium.\nDespite the lack of originality in Pacioli's work, his contributions to mathematics are important, particularly because of the influence which his book were to have over a long period. In\n[\n10\n]\nthe importance of Pacioli's work is discussed, in particular his computation of approximate values of a square root\n(\nusing a special case of\nNewton\n's method\n)\n, his incorrect analysis of certain games of chance\n(\nsimilar to those studied by\nPascal\nwhich gave rise to the\ntheory of probability\n)\n, his problems involving\nnumber theory\n(\nsimilar problems appeared in\nBachet\n's compilation\n)\n, and his collection of many\nmagic squares\n.\nIn\n1550\nthere appeared a biography of\nPiero della Francesca\nwritten by Giorgio Vasari. This biography accused Pacioli of plagiarism and claimed that he stole\ndella Francesca\n's work on perspective, on arithmetic and on geometry. This is an unfair accusation, for although there is truth that Pacioli relied heavily on the work of others, and certainly on that of\ndella Francesca\nin particular, he never attempted to claim the work as his own but acknowledged the sources which he used.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}