{
  "nome_completo": "Peter Ludwig Mejdell Sylow",
  "nome_curto": "Ludwig Sylow",
  "ano_nascimento": "1832",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sylow/",
  "lugar_nascimento": "Christiania (now Oslo), Norway",
  "lugar_morte": "Christiania (now Oslo), Norway",
  "biografia": "Ludwig Sylow\n's parents were Thomas Edvard von Westen Sylow\n(1792\n-\n1875)\nand Magdalena Cecilie Cathrine Mejdell\n(1806\n-\n1898)\n. Thomas Edvard Sylow was a captain in the cavalry and later became a government minister. From\n1848\nto\n1854\nhe was Minister and Chief of the Army Ministry. He was born in Snasa, Nord-Trondelag, Norway, the son of Peter Ludvik von Westen Sylow and Elisabeth Christine Niemeyer. Magdalena Cecilie Cathrine Mejdell was born in Septon, Land, Oppland, Norway, the daughter of Johan Ernst Mejdell and Fredrikke Caroline Sophie Kierulf. Peter Ludwig Mejdell Sylow was the eldest of his parents' ten children, having younger siblings Fredrikke Caroline Sophie Sylow\n(\nborn\n1834)\n, Elisabeth Arnolda von Westen Sylow\n(\nborn\n1835)\n, Johan Ernst Mejdell Sylow\n(\nborn\n1837)\n, Carl Christian Weinwich Sylow\n(\nborn\n1838)\n, Sverre Thomas Sylow\n(\nborn\n1839)\n, Halfdan Sylow\n(\nborn\n1840\n-\n56)\n, Johanne Hermine Sylow\n(\nborn\n1843)\n, Stephanie Martine Sylow\n(\nborn\n1844)\n, and Martin Kierulf Sylow\n(\nborn\n1848\n-\n58)\n. Not all of these ten children reached adulthood: Sverre Thomas died as a baby, Halfdan died aged sixteen, and Martin Kierulf died aged ten.\nAlthough Sylow had a good upbringing, learning how to work on his own, being taught the importance of doing one's best and working hard, nevertheless in some ways his upbringing would prove a disadvantage in his career. This was because he was taught to be modest and although this was done with the best of intentions, still it meant that he was happy to spend many years in a more lowly position than he should have had. It is interesting to note that in\n1902\n, when Sylow gave the welcoming address at a conference to mark the centenary of\nNiels Abel\n's birth, he said\n(\nsee\n[\n2\n]\n)\n:-\n... such a great modesty maybe does not fit this world, it may also be seen as a weakness.\nSylow attended Christiania Cathedral School, graduating in\n1850\n. He then began his studies of natural sciences at Christiania University where won a mathematics contest in\n1853\n. He then took the high school teacher's examination in\n1856\n, qualifying as a teacher of mathematics and natural science with excellent grades. As no university post was available, he taught for two years at the at Hartvig Nissen school. He then moved to the town of Fredrikshald\n(\nnow called Halden\n)\nin Ostfold county, where he taught at secondary school from\n1858\nto\n1898\n. Sadly, although Sylow would have made an outstanding university lecturer, he did not make a particularly good school teacher. He was interested in the advanced areas of mathematics and had little enthusiasm for teaching at lower levels. Also he found it difficult to keep discipline in his classroom so the fact that his career was largely in schools rather than universities was a poor use of his talents on two scores - universities were the poorer for not having Sylow as a lecturer, while schools were poorer for having him as a teacher!\nSylow continued his mathematical studies however\n(\nsee\n[\n5\n]\n)\n:-\n... at first working on\nelliptic functions\nin the tradition of\nAbel\nand\nJacobi\n, inspired by the professor of pure mathematics\nOle Jacob Broch\n. Finding\nAbel\n's papers on the solvability of algebraic equations by\nradicals\nmore interesting, Sylow was led from them\n(\nby the professor in applied mathematics,\nCarl Bjerknes\n)\nto\nGalois\n.\nOle Jacob Broch\nhad studied mathematics at Christiania University after which he travelled to Paris, Berlin and Königsberg where he studied a range of mathematical topics, particularly optics and statistics. After returning to Norway, together with his friend Hartvig Nissen\n(1815\n-\n1874)\n, he founded the Hartvig Nissen school, an independent girls' school in the Uranienborg district of Christiania.\nBroch\nbecame a lecturer in applied mathematics at Christiania University in\n1848\n, but took over\nBernt Holmboe\n's pure mathematics teaching in\n1850\nfollowing his death.\nBroch\nretained his interest in the Hartvig Nissen school, of which he had been a co-founder, and gave the young teacher Sylow much encouragement to continue his advanced mathematical researches. Although at first Sylow found reading\nAbel\n's papers a difficult task, soon he found that\nAbel\nhad achieved a far deeper understanding of the theory of equations than his published papers indicated. Sylow's first attempts to publish some of Abel's unpublished results that he had found in his papers proved a problem. This was due to the fact that he sent a paper containing these results to\nCrelle\n's\nJournal\nwhere the paper was considered for publication by\nLeopold Kronecker\n. Now the difficulty arose since\nKronecker\nhad already published these results having discovered them himself, and had no wish to have a paper in print which showed that\nAbel\nhad proved them long before he had.\nKronecker\n, therefore, rejected Sylow's paper but, of course, since Sylow had correctly portrayed\nAbel\n's unpublished results, eventually they were indeed attributed to\nAbel\nrather than\nKronecker\n.\nIn\n1861\nSylow obtained a scholarship to travel and visited Berlin and Paris. In Paris he attended lectures by\nMichel Chasles\non the\ntheory of conics\n, by\nJoseph Liouville\non rational mechanics and by\nJean-Marie Duhamel\non the theory of limits. He says, in the report he wrote at the end of the scholarship, that he also:-\n... made myself acquainted with newer works, particularly in the theory of equations.\nIn Berlin he had useful discussions with\nKronecker\nbut was unable to attend courses by\nKarl Weierstrass\nwho was ill at the time. Bent Birkeland writes in\n[\n5\n]\nthat, as there were no courses being given in Berlin that interested him:-\n... he worked instead in the library, studying number theory and the theory of equations. He also got acquainted with\nCarl Borchardt\n, the editor of '\nCrelle\n's Journal' ... It is interesting to note that no lectures in algebra or the theory of equations are mentioned from his stay either in Paris or in Berlin.\nIn\n1862\nSylow lectured at the University of Christiania, substituting for\nBroch\nwho had been elected to serve in the Storting, the Norwegian parliament. In his lectures Sylow explained\nAbel\n's and\nGalois\n's work on algebraic equations. A summary of these lectures is presented in\n[\n4\n]\n. It is worth noting that although he had not proved 'Sylow's theorems' at this time\n(\nhe published them\n10\nyears later\n)\nhe did pose a question about them. After proving\nCauchy\n's theorem that a\ngroup\nof order divisible by a\nprime\np\np\np\nhas a subgroup of order\np\np\np\n, Sylow asks whether it can be generalised to powers of\np\np\np\n. These lectures are significant for several reasons, not least that a young student attending them was\nSophus Lie\n. Sylow's lectures were extremely valuable in giving Lie a fundamental appreciation of a topic to which he would make major contributions.\nBroch\nwas again in the Storting from\n1865\nto\n1868\nand he was keen to have Sylow take over his university teaching during this time. However, the school in Fredrikshald refused to give Sylow leave to teach at the university. In\n1869\nBroch\nleft his chair of pure mathematics, leaving a vacancy that Sylow was well qualified to have filled. However, the University of Christiania did not rate pure mathematics very highly at that time, preferring more practical and applicable topics. Sylow was too theoretical in his approach so he was not appointed.\nIn\n1870\n-\n71\nSylow exchanged nine letters with\nJulius Petersen\nwho, at this time, was working on his doctoral dissertation.\nPetersen\nsought Sylow's advice about the main theorem of his dissertation and these letters all deal with this. The article\n[\n8\n]\ndiscusses these letters. The two mathematicians exchanged another sixteen letters in\n1876\n-\n77\n. Between\n1873\nand\n1881\nSylow and\nLie\nprepared an edition of\nAbel\n's complete work published under the title\nOeuvres complète de Niels Henrik Abel\nⓉ\n(\nComplete Works of Niels Henrik Abel\n)\n. The motivation for this had come from the\nNorwegian Academy of Science\nwho applied to the Norwegian Parliament for funding for the project which was quickly granted. This funding allowed Sylow to take leave from his school for four years in order to devote himself to the project. Arild Stubhaug writes in\n[\n3\n]\n:-\nIn the course of the work Sylow had an eager discussant in\nC A Bjerknes\n, who for his part, worked on the\nAbel\nbiography that was published in\n1880\n.\nBjerknes\nwanted as much as possible of\nAbel\n's early works to come out, not only his great treatises with their exemplary stringency, and perhaps there had been more\nAbel\nmaterial than what\nHolmboe\nused in his edition of\n1839\n?\nMuch additional\nAbel\nmaterial was found and published in the Sylow/\nLie\nedition which appeared on\n9\nDecember\n1881\n.\nLie\nsaid that most of the work was done by Sylow and commented that Sylow deserved a university position because of his:-\n... broad knowledge, his sharp powers of criticism, and his outstanding mathematical work.\nHowever, today Sylow's fame rests on one\n10\npage paper published in\n1872\n. In this paper\nThéorèmes sur les groupes de substitutions\nwhich Sylow published in\nMathematische Annalen\nVolume\n5\n(\npages\n584\nto\n594)\nappear the three Sylow theorems although we know that he had already proved his famous theorem by September\n1870\n.\nCauchy\nhad already proved that a group whose order is divisible by a prime\np\np\np\nhas an element of order\np\np\np\n. Sylow generalised this, proving what is perhaps the most profound result in the theory of finite groups:\nIf\np\nn\np^{n}\np\nn\nis the largest power of the prime\np\np\np\nto divide the order of a group\nG\nG\nG\nthen\nG\nG\nG\nhas subgroups of order\np\nn\np^{n}\np\nn\nG\nG\nG\nhas\n1\n+\nk\np\n1 + kp\n1\n+\nk\np\nsuch subgroups\nany two such subgroups are conjugate.\nAlmost all work on finite groups uses Sylow's theorems. Sylow's original\n1872\npaper is discussed by Rod Gow in\n[\n7\n]\nand also by the authors of\n[\n6\n]\nand the author of\n[\n15\n]\n. In\n[\n11\n]\nWinfried Scharlau describes how Sylow was led to his discovery by his study of\nGalois\n' work, in particular of\nGalois\n' criterion for the solvability of equations of prime degree. The paper\n[\n11\n]\nexplains how Sylow used methods from\nGalois theory\nin his proofs.\nSylow became an editor of\nActa Mathematica\n, was elected a member of the\nAcademy of Sciences of Göttingen\nin\n1883\n, and, in\n1894\n, was awarded an honorary doctorate from the University of Copenhagen.\nLie\nhad a special chair created for Sylow at Christiania University and Sylow taught at the university from\n1898\n. Note that he was\n65\nyears old before he obtained a university post but, remarkably, he was still able to hold this position for\n20\nyears.\nG A Miller\nwrites\n[\n10\n]\n:-\nNotwithstanding the advanced age at which Sylow entered the university faculty he is said to have filled the position during twenty years with marked success. The duties of his professorship did not seem to be burdensome to him until the last year of his life when he frequently remarked that he felt tired.\nAlthough at the age of\n65\nhe had at last become a university professor, we should note that he did not receive the salary of a professor. At first, he was paid a headmaster's salary which was approximately half the salary of a university professor. Later he received salary increases.\nIn\n1902\nSylow gave the welcoming address at a conference to mark the centenary of\nNiels Abel\n's birth. He said\n(\nsee\n[\n2\n]\n)\n:-\nIn the early nineteenth century, applied mathematics had already achieved great triumphs, especially in the fields of astronomy and physics. But just at the same time mathematics ... started to turn its gaze back to the pure and abstract theories.\n[\nGauss\nand\nCauchy\n]\ninitiated that great movement, which has run through the whole of the previous\n[19\nth\n]\ncentury, and which has reformed mathematics from its foundations at the same time it enriched it with new theories. ... It was in this movement that\nNiels Abel\ntook such a significant part that he will forever he counted as one of the greatest mathematicians ever.\nIn\n1902\nSylow, in collaboration with Elling Holst, published\nAbel\n's correspondence. Further\nAbel\ndocuments had been discovered after the Sylow/\nLie\nbook came out in\n1881\nand, at the 'Third Scandinavian Congress of Mathematicians' which was held in Kristiania in\n1913\n, Sylow discussed this new material.\nA version of the introduction to Sylow's discussion is at\nTHIS LINK\nIn\n[\n9\n]\nG A Miller\nquotes\nGeorg Frobenius\n's opinion of Sylow:-\n[\nSylow\n]\nwas known to mathematicians of every civilised country on account of a well-known theorem that bears his name. In\n1876\nFrobenius remarked that \"as every educated person knows the Pythagorean theorem so does every mathematician speak of\nAbel\n's theorem and Sylow's theorem\".\nWe must not give the impression that the Sylow theorems and the\nAbel\nmaterial were Sylow's only mathematical contributions. He also published a few papers on elliptic functions, particularly on complex multiplication, as well as papers on group theory. Finally we should say a little about Sylow's life outside mathematics. He never married but was a warm person with a nice sense of humour. He was an avid lover of being out of doors and often spent summer vacations in the mountains, usually in Kongsvoll, where he studied plants. Kongsvoll is a mountain station providing food and shelter on the route between Oslo and Trondheim, erected when the route was used by pilgrims visiting the shrine of St Olav in Trondheim.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Number Theory"
  ]
}