{
  "nome_completo": "Ludwig Dmitrievich Faddeev",
  "nome_curto": "Ludwig Faddeev",
  "ano_nascimento": "1934",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faddeev_Ludwig/",
  "lugar_nascimento": "Leningrad (now St Petersburg), Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Ludwig Dmitrievich Faddeev\nwas the son of\nDmitrii Konstantinovich Faddeev\nand Vera Nikolaevna Zamyatina. Both his parents were famous mathematicians with biographies in this Archive. We note that Vera Nikolaevna Zamyatina has a biography under her married name\nVera Nikolaevna Faddeeva\n. Ludwig was brought up in Leningrad\n(\nnow St Petersburg\n)\nbut experienced the evacuation of the city during World War II when the city came under siege from the German armies.\nIn September\n1939\n, Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad. In June\n1941\n, however, the course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow. As the German armies rapidly advanced towards Leningrad in August\n1941\n, many people were evacuated from the city including the Faddeev family. For the duration of the siege of Leningrad, the Faddeev family lived in Kazan which is about\n800\nkm due east of Moscow and considered safe from the German invasion. For a long time there was no opportunity to return to Leningrad which was only liberated from the siege in January\n1944\n. Even after the siege was lifted, access to the devastated city was for a considerable time only possible with a special permit. The Faddeev family, together other colleagues, obtained such permits and Ludwig could return with his parents.\nWhen Faddeev was young he needed to make a difficult choice between pursuing a career in music or academia. In fact his parents encouraged him to have a musical career since he played the piano to a very high standard. At one time he thought he would study music at the Leningrad Conservatory rather than go to university. He finished middle school #\n155\nin the Smolninskiy district of Leningrad. In high school he had many different interests including radio modelling, cross-country skiing and photography. He claimed he enjoyed algebra much more than geometry and when he was told how to solve trigonometrical problems by analytical geometry methods, he felt excited. He spoke of his school days in\n[\n20\n]\n:-\nAs a schoolboy, I did not have any particular interest in mathematics. I was a passionate reader. For instance, I learned much of English medieval history from Shakespeare's chronicles. Of course, the general intellectual atmosphere of my family had a great influence upon me. One precious thing that I owe to it is my love for music. But I cannot say that it gave me a particularly professional orientation. I remember at one point, after we had evacuated to Kazan, my father was greatly excited with his latest results. This was the time when he made important discoveries in homological algebra. I asked him how many people in the world would be able to understand his results and he replied that there might be five or six of them. I thought that this would not suit me.\nAfter graduating from High School in\n1951\n, he chose to enter the Physics Department of Leningrad State University\n(\ncurrently St Petersburg State University\n)\n. At that time his father was Dean of the Mathematics Department and he said\n[\n20\n]\n:-\nI wanted to make my own way. I believe that in general a reasonable share of stubbornness and non-conformism proved to be of much importance in my formation as a scholar.\nWhen Faddeev began his university studies Joseph Stalin was Premier of the Soviet Union and people had to conform. Not long after Faddeev began his university studies he was required to appear before the local Comsomol\n(\nCommunist Youth\n)\nCommittee. He was asked about the fact that he was keen on reading the novels of  Knut Hamsun, a Norwegian writer who won the Nobel Prize for Literature in\n1920\n. Hamsun had supported Germany during World War II, and his novels, therefore, were considered by Stalin as unacceptable. Faddeev said\n[\n20\n]\n:-\nFortunately for me, Stalin died a few months later and this story did not have any sequel.\nAs an undergraduate, Faddeev mostly enjoyed doing mathematics, especially analytical geometry. He had never liked trigonometry but in analytical geometry everything was solved by applying algebraic methods. He did not enjoy working in a laboratory either. During his university years academicians\nVladimir Ivanovich Smirnov\nand\nVladimir Aleksandrovich Fock\nrealized that physicists should be taught mathematics differently from students in the Mathematics and Mechanics Department. This led to the creation of the Department of Mathematical Physics, which involved teaching topics such as Mathematical Analysis, Higher Algebra, Probability Theory and Differential Equations. Faddeev was one of the first five people graduating from this course in\n1956\nbeing a student of\nOlga Alexandrovna Ladyzhenskaya\nand\nVladimir Fock\n. He said that\nLadyzhenskaya\n, who was the chair of Mathematical Physics, was the most important person to him during the university years. Faddeev attended her courses on complex variables, partial differential equations, and operator theory. She organised special seminars and taught Faddeev how to work efficiently and she did not make him follow her route in mathematics, unlike many academicians forced their students, and she gave him full freedom in research.\nHe attended\nFock\n's course on general relativity but, although\nFock\nhad given quantum theory courses in the past, he was not lecturing on that topic at the time Faddeev was an undergraduate. Faddeev, however, was given a copy of\nFock\n's lecture notes which he studied. Advised by\nLadyzhenskaya\n, he read first a paper by\nNorman Levinson\nfollowed by\nKurt Friedrichs\n' book\nMathematical aspects of the quantum theory of fields\n(1951)\nin session\n1954\n-\n55\nand took part in a seminar on the book run by\nLadyzhenskaya\n. He explained how this fitted into his thesis research\n[\n20\n]\n:-\nThis book has shaped my interest in mathematical problems of Quantum Field Theory and also encouraged a kind of aversion to the computation of Feynman diagrams that was so very popular among my fellows from the Chair of Theoretical Physics. Making an independent advance in Quantum Field Theory was of course too difficult a bid at that stage and my first research work was on a much easier subject: the potential scattering and spectral decomposition for the\nSchrödinger\noperators with continuous spectrum. As I was working on the subject, with the aim of combining the ideas of\nFriedrichs\nwith concrete methods borrowed from the book of Boris M Levitan on singular\nSturm\n-\nLiouville\noperators, an important paper of Aleksandr Yakovlevich Povzner on the continuous spectrum expansions was published and it remained for me only to refine and to generalize his work. In the course of this I wrote my first university thesis.\nFaddeev began publishing a series of important papers written in Russian:\nUniqueness of solution of the inverse scattering problem\n(1956)\n,\nOn expansion of arbitrary functions in eigenfunctions of the Schrödinger operator\n(1957)\n,\nAn expression for the trace of the difference between two singular differential operators of the Sturm-Liouville type\n(1957)\n,\nOn the relation between S-matrix and potential for the one-dimensional Schrödinger operator\n(1958)\n, and\nOn continuous spectrum perturbation theory\n(1958)\n. He said\n[\n20\n]\n:-\nWhen it became known that I had prepared an exhaustive exposition of the inverse scattering problem for the radial\nSchrödinger\noperator, I was invited by\nNikolai Nikolaevich Bogolyubov\nto give a plenary talk on the subject at the inaugural meeting of the Laboratory of Theoretical Physics in Dubna, in the presence of\nIsrail Moiseevic Gelfand\n, Boris M Levitan,\nMark Grigorievich Krein\n,\nVladimir Aleksandrovich Marchenko\n, and other senior figures. This was a rather exceptional honour for me at the time. A written version of this talk was published the next year in 'Uspekhi'.\nThe written version was\nThe inverse problem in the quantum theory of scattering\n(\nRussian\n)\n(1959)\nand it formed the basis of his candidate's thesis\n(\nthe degree is equivalent to a Ph.D.\n)\n. He was awarded his candidate's degree for his thesis\nProperties of S-Matrix for the Scattering on a Local Potential\n(1959)\n.\nAround this time Faddeev married Anna Veselova, the daughter of Mikhail G Veselov\n(1906\n-\n1987)\n, a professor of physics at Leningrad State University who worked closely with\nVladimir Aleksandrovich Fock\nand E N Yustova, the latter working on colour vision.\nLudwig and Anna Feddeev had two daughters Maria, who became a theoretical physicist, and Elena who became a mathematician.\nFor the rest of this biography, we closely follow\n[\n27\n]\n.\nEven though he managed to solve a difficult problem in his dissertation, Faddeev decided to stop research in this area and move to something different. Faddeev taught his students that it is extremely important to change the direction of their research. He said:-\nIf you have written five papers on the same topic, change the area of your research and look into something new and interesting. If after a significant discovery I realise I could work more on this problem, I turn to another one. Why? Because it becomes uninteresting and too easy to develop it further. Why would I do something that others can do if I can always find something new?\nHe valued knowledge over skills when it came to education. He believed that a person having great knowledge\n(\nregardless of the academic discipline\n)\nis free.\nIn\n1970\nVladimir Evgen'evich Zakharov introduced Faddeev to the inverse scattering method of solving nonlinear evolution equations in two-dimensional space-time. Working together, they introduced the Hamiltonian interpretation and complete integrability of the\nKorteweg\n-\nde Vries\nequation. Later, Faddeev and his students worked further on this problem and achieved the unravelling of the algebraic structure of quantum integrable models\n(\nthe Yang-Baxter equation\n)\nand the formulation of the algebraic\nBethe\nansatz.\nSince the\n1970\ns Faddeev began working on the quantum theory of solitons. This theory, constructed by him, created a new approach to quantum field theory and gave birth to the new concept of quantum groups.\nSince\n1960\ns he had been lecturing to students on quantum mechanics in the Mathematics and Mechanics Faculty. Being a good teacher, he contributed a great amount to the faculty and made it one of the largest mathematical centres, which, by the end of the\n1980\ns, involved many different specialists in a wide range of areas of mathematics.\nFaddeev also engaged in a large amount of organisational work. He was the head of the St Petersburg Department of the\nSteklov\nInstitute of Mathematics, part of the\nRussian Academy of Sciences\n, during the years\n1976\n-\n2000\n. Faddeev was also the head of Russian National Committee of Mathematicians. Since\n1992\nhe was a secretary-academician of the Mathematical Department in the\nRussian Academy of Sciences\n. Many of his students moved abroad, but Faddeev could not see himself living in any other country. He established the\nEuler\nInternational Mathematical Institute in St Petersburg in order to facilitate communication between Russian mathematicians and their international colleagues. He became the director of the\nEuler\nInternational Mathematical Institute in\n1993\n. He always felt, however, that there was a lack of substantial funding for further development of this Institute. He was also disappointed that there was a poor representation of academicians in the president's administration in Russia in comparison with the USA. He actively tried to raise the government's attention to the development of the\nRussian Academy of Sciences\n.\nLudwig Faddeev called himself a mathematical physicist whose main interest was in quantum theory. He believed that the aim of mathematical physics is making discoveries in fundamental physics while using mathematical intuition. He saw Mathematical Physics and Theoretical Physics as competitors although he acknowledged that different methods could be used in either discipline. Fadeev was convinced that physics solved all the theoretical problems in chemistry, thus 'closing' that science. He believed that mathematics will create the 'unified theory of everything' and 'close' physics as well, which can be seen as quite a radical opinion. He believed that the more physics uses mathematical methods, the more fundamental this science becomes. He also claimed that there is only one most important unsolved problem in physics: the microscopic description of the structure of matter. He said that physics will be 'finished' for him when the theories of gravitation, relativity and quantum mechanics will be put together into one solid theory. He said that mathematical physics is a universal science and that all the parts of theoretical mathematics, as well as numerical methods and applications of probability theory, are used for finding solutions to its problems. Faddeev said that physics could be fully understood only in mathematical language since mathematics has a fundamental role in the sciences: it creates a language, which provides truthful answers. He believed mathematics to be 'an infinity science' because it can develop all the time unlike any other fundamental science which will finally reach its limits.\nFaddeev said:-\nMathematics is the sixth sense, but not many people have it. Mathematics is a made up science, a product of abstract reasoning, it does not have anything to do with the usual world unlike other sciences. Special intuition and understanding of its inner logic and harmony are important for mathematics.\nHe was given the Dannie Heinemann Award, which is the most significant award of American Physical Society, in\n1975\n. The citation is as follows:-\nFor his mathematically and physically incisive work on the three-body problem, and for his profound contribution to the quantization of gauge fields by the method of functional integration.\nHe became a member of the\nRussian Academy of Sciences\nin\n1976\n. He was also a member of several foreign academies such as the\nFrench Academy of Sciences\n, the\nNational Academy of Sciences\nof the United States and a fellow of the\nRoyal Society of London\n. He was awarded the\nRussian Academy of Sciences\nDemidov Prize in\n2002\nand the\nHenri Poincaré\nPrize, sponsored by the Daniel Iagolnitzer Foundation, for outstanding contributions in mathematical physics in\n2006\n. He was awarded the Shaw Prize in\n2008\nfor his wide and significant contribution to mathematical physics.\nFor details of Faddeev's Shaw Prize, together with his Shaw autobiography, see\nTHIS LINK\n.\nIn almost any book about nuclear physics there will be a chapter about Faddeev's integral equations and his methods for continual integration.\nFollowing Faddeev death, Sergey Kislyakov spoke about his contributions:-\nLudwig Dmitrievich was the head of the institute for more than\n25\nyears and the institute prospered because of him. For many people working in our institute he was the teacher, for some of them he was a good friend. He was a very competent leader - he could be tough but very polite and kind at the same time.\nValentin Makarov, who was the president of software association \"Russoft\", said:-\nThe fact that Ludwig Faddeev was able to create the institute, which is well-known worldwide, is an amazing motivation for all scientists and businessmen, who want to be noticed at the global IT market, since Mathematics is the base for programming and IT. If there had been no Faddeev's efforts, there would not be such a school, which 'gave birth' to the best mathematicians, and we would not have the foundations for growth.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}