{
  "nome_completo": "Antonio Luigi Gaudenzio  Giuseppe Cremona",
  "nome_curto": "Luigi Cremona",
  "ano_nascimento": "1830",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cremona/",
  "lugar_nascimento": "Pavia, Lombardy (now Italy)",
  "lugar_morte": "Rome, Italy",
  "biografia": "Luigi Cremona\nwas educated at the Ginnasio in Pavia. Luigi's father died when Luigi was\n11\nyears old and this nearly prevented him from having a proper education. However, his stepfather supported him through school so that he was able to complete his school education and enter the University of Pavia.\nPolitical events, however, were to have a major effect on Cremona's life and the first impact came from the revolution of\n1848\nwhich attempted to achieve a new and more liberal constitution. The Austrian government arrested opposition leaders of the revolution in Venice and Milan, and suppressed student demonstrations in Padua and Pavia. Cremona, all his life an ardent Italian nationalist, immediately joined the 'Free Italy' battalion.\nWithin a few days the Austrian army lost nearly all of Lombardy - Venetia and retreated. Sardinia - Piedmont declared war on Austria. After some initial successes by the Italians, the Austrian armies began to win victories. In Lombardy the Austrian reconquest of Brescia in March\n1849\n, after\n10\ndays of fighting, left Venice isolated. Cremona, by this time a sergeant, was with the troops defending Venice. The city resisted Austrian forces until\n24\nAugust\n1849\n. The bravery of the defending forces had been such that the Austrian attackers allowed them to leave the city with honour. Cremona was able to return to Pavia.\nBack in Pavia, Cremona discovered that his mother had died while he had been fighting to free Italy. Again he was financially unable to return to university without the support of his family and again his family rallied round and provided the necessary support. He entered the University of Pavia on\n27\nNovember\n1849\nto study for a degree in civil engineering. There he was taught by\nBordoni\n,\nCasorati\nand\nBrioschi\nbut he was most influenced by\nBrioschi\n. Cremona later wrote, see\n[\n6\n]\n:-\nThe years that I passed with\nBrioschi\nas pupil and later as colleague are a grand part of my life; in the first portion of these years I learned to love science and in the other how to transfer it to a large circle of auditors.\nOn\n9\nMay\n1853\nCremona was awarded his doctorate in civil engineering from the University of Pavia. By this time Camillo Benso di Cavour had become the head of the cabinet, and the unification of Italy had begun. But Austria still controlled the region and this made life hard for Cremona who had fought against the Austrian occupation. As Greitzer writes in\n[\n1\n]\n:-\nHis record of military service against Austrian rule prevented him from obtaining an official teaching post in the education system, so his first employment was as a private tutor to several families in Pavia.\nCremona was by this time engaged in mathematical research and his first paper appeared in March\n1855\n. This must have had some effect in helping him to gain permission to teach physics on a temporary basis at the Ginnasio in Pavia where he had himself been trained for university. In May\n1856\nhis second mathematical paper appeared and this, together with his good teaching, seems to have helped him secure the position of associate teacher at the Ginnasio in December\n1856\n.\nOn\n17\nJanuary\n1857\n, Cremona was appointed a full teacher at the Ginnasio in Cremona. Cremona, the capital of the Cremona region of Lombardy was situated on the north bank of the Po River southeast of Milan. Cremona was to remain at the school there for three years and during this time he wrote a number of mathematical articles. They are not of great importance except that some of them were examining curves using projective methods, techniques which would be characteristic of Cremona's later important mathematics.\nWhile the mathematician Cremona taught in the town of Cremona, political events were taking place which would have a large effect on his future. In July\n1858\nCavour made an agreement with Napoleon III of France for his support of Piedmont. When Austria declared war on Piedmont on\n26\nApril\n1859\n, France honoured its alliance with Piedmont. After a number of battles the Austrians were in retreat and a treaty was signed at Villafranca by Napoleon III accepting the cession of Lombardy from Austria, which he then passed to Piedmont. Lombardy, liberated from Austrian rule, were quick to see that Cremona should no longer be held back for political reasons. On\n28\nNovember\n1859\nhe was appointed as teacher at the Lycée St Alexandre in Milan.\nWith events moving quickly towards a unified Italy under Victor Emmanuel II as King, Cremona was appointed by Royal decree as an ordinary professor at the University of Bologna on\n10\nJune\n1860\n. The Kingdom of Italy was officially proclaimed on\n17\nMarch\n1861\n, by a parliament sitting in Turin. Cremona was to remain in Bologna until October\n1867\n.\nIn Cremona's\nComplete Works\nthere appear\n45\narticles which he published while at Bologna. Sixteen of these articles are answers to questions posed in the\nNouvelles Annales\n. There are eight book reviews and four historical articles intended to encourage research into geometry. Also included are Cremona's important work on transformations of plane curves, which were published during this period in\n1863\nand\n1865\n. It was this work which won him the\nSteiner\nPrize for\n1866\n, the prize being awarded jointly to Cremona and\nRudolf Sturm\n. Also while at Bologna Cremona developed the theory of birational transformations, later known as Cremona transformations, and wrote a series of papers on\ntwisted cubic\nsurfaces.\nWhite\ndescribes this period of Cremona's work in\n[\n11\n]\n:-\nChasles was the type on whom at first Cremona modelled his own work. The geometrical purism of\nvon Staudt\nwas a later influence. Hence it is natural to find metric foundations for geometric definitions instead of, or interchangeably with, projective. The apparatus of\nalgebraic geometry\nis built upon polars, and these upon distances. The geometric method is principally a use of terms or descriptive relations instead of equations. And the beginnings of enumerative geometry are here...\nGreitzer, writing in\n[\n1\n]\n, describes the importance of Cremona transformations which he introduced in his Bologna period:-\nCremona transformations have been used for studying rational surfaces, for the resolution of singularities of plane and space curves, and for the study of\nelliptic integrals\nand Riemann surfaces. They are effective in the reduction of singularities of curves to double points with distinct\ntangents\n.\nIn October\n1867\n, on\nBrioschi\n's recommendation, another Royal Decree was issued, this time appointing Cremona to the Polytechnic Institute of Milan. He received the title of Professor in\n1872\nwhile at Milan. Greitzer writes in\n[\n1\n]\n:-\nThe period in Milan, where he remained until\n1873\n, was the time of Cremona's greatest creativity. He wrote articles on such diverse topics as twisted cubics, developable surfaces, the theory of\nconics\n, the theory of plane curves, third- and fourth-degree surfaces, statics and\nprojective geometry\n.\nCremona's work in statics is of great importance and gives, in a clearer form, some theorems due to\nMaxwell\n. In a paper of\n1872\nCremona took an idea of\nMaxwell\n's on forces in frame structures that had appeared in an engineering journal in\n1867\nand interpreted\nMaxwell\n's notion of reciprocal figures as duality in projective\n3\n-space. These reciprocal figures, for example, have three forces in equilibrium in one figure represented by a triangle while in the reciprocal figure they are represented by three concurrent lines.\nIn\n1873\nCremona was offered a political post as secretary general of the new Italian Government. This was a fitting tribute to the highly patriotic Cremona yet his mathematics researches were of such interest that he refused to accept the political post. Instead he moved to Rome on\n9\nOctober\n1873\n, again appointed by Royal Decree, as director of the newly established Polytechnic School of Engineering. In addition he was appointed professor of graphic statics. However, if he had hoped that refusing the political post would leave him able to continue his mathematical research he soon found that his administration and teaching duties put an effective end to research.\nIn November\n1877\n, Cremona was appointed to the chair of higher mathematics at the University of Rome. However political pressures made him feel that he should serve the new Italian State. On\n16\nMarch\n1879\nhe was appointed a senator and at this point his mathematical work ended completely. He became Minister of Public Education and ended his political career as Vice-President of the Senate. Greitzer writes in\n[\n1\n]\n:-\nOn\n10\nJune\n1903\n, after leaving a sickbed to act on some legislation, Cremona succumbed to a heart attack.\nCremona had a large influence on geometry in Italy. Many of\nSteiner\n's proofs on synthetic geometry were revised and improved by Cremona. One of the themes which were present in almost all his work throughout his career was projective geometry. But, Greitzer\n[\n1\n]\n, states:-\nCremona made no startling discoveries in this area: but he did derive many properties of projectively related figures, and he did present the subject to has classes in a manner calculated to clarify and bring out relationships most simply.\nIn fact Cremona had a fine reputation as a lecturer\n[\n1\n]\n:-\nCremona was an excellent lecturer: calm, rigorous, yet interesting and even exciting.\nWhite\n[\n11\n]\nwrites:-\n... it is evident from his writings that it was the innate love of his chosen science that moved him to teaching and to the preparation of the books through which his name is most widely known.\nCremona was extremely fair in citing the works of others, something which was not too common among many mathematicians at that time. Again we quote White\n[\n11\n]\n:-\nCremona himself was conscientious and indefatigable in searching out the work of his predecessors upon matters that he himself was investigating.\nIn one of his works, after two pages of historical summary, he gives a footnote excusing:-\n... his previous ignorance of, and failure to cite, the works of\nMöbius\nand Seydewitz to which the essay of\nSchröter\nhad now directed his attention.\nCremona had many pupils who were to make major contributions to geometry, for example\nBertini\n,\nVeronese\nand\nGuccia\n.\nIn\n1879\n, the year he became a Senator, he received the scientific honour of becoming a corresponding member of the\nRoyal Society of London\n.",
  "math_areas": [
    "Geometry"
  ]
}