{
  "nome_completo": "Mário Schenberg",
  "nome_curto": "Mário Schenberg",
  "ano_nascimento": "1914",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schenberg/",
  "lugar_nascimento": "Recife, Pernambuco, Brazil",
  "lugar_morte": "São Paulo, Brazil",
  "biografia": "Mário Schenberg\nwas the son of Salomão Schönberg\n(1885\n-\n1953)\nand Fânia Musij\n(1893\n-\n1980)\n; the family had Jewish origins. Let us note that the name Schenberg was originally Schönberg or Schoenberg and Mário Schenberg was given the name Mayer Schönberg when he was born and most of his publications appear under that version of his name. Note also that Musij was originally Mushier. Salomão Schönberg was born in Kiev, Ukraine and emigrated to Brazil in the early\n1900\ns. Fânia Musij was born in Djora, on the outskirts of Kishenev, Bessarabia. Today Kishenev, Bessarabia is known as Chisinau and is the capital and largest city of Moldova. Fânia Musij was known as Fanny and she came to Brazil shortly before the outbreak of World War I. Ana Clara Guerrini Schenberg, Mário Schenberg's daughter, said\n[\n23\n]\n:-\nMy father told me that we were related to the Austrian musician Arnold Schoenberg and Groucho Marx, whose mother was also Schoenberg. ... Fanny came to Brazil to meet Salomão, who was in partnership with her brother in Recife. Salomão had fallen in love with a photo of Fanny that her brother had shown him! They married in Recife and had\n3\nchildren: Mário, Saul and José. José died prematurely, aged\n10\n, after falling from the top of a staircase. Saul graduated in Medicine ...\nMário Schenberg attended primary, junior high and high school in Recife, a large city on the northeast corner of Brazil. He attended the Colégio Americano Batista which had been founded in\n1906\nwith the aim of providing quality education for those who could not afford private schooling. When he was about ten years old, Schenberg began to read French technical books which he bought with money he won in a game and these started his interest in science. He was influenced by trips made with his parents to Europe, where he came into contact with Gothic architecture and began to be interested in history.\nAt the time Schenberg was growing up, Brazil had various movements seeking democratic changes. It was a period when many cultural ideas were being promoted and the young Schenberg read articles describing Marxist views which attracted him. By the age of thirteen, Schenberg had developed a passion for mathematics but his life was certainly not all studying for he spent much leisure time wandering on the beaches of Recife and Olinda.\nSchenberg's family could not afford to send their son to Europe for his university studies so, in\n1931\n, Schenberg entered the Pernambuco Engineering School. There he was taught by Luís de Barros Freire\n(1896\n-\n1963)\nwho had been awarded a civil engineering degree from the Escola de Engenharia de Pernambuco in\n1918\nand, in the following year, had been appointed to the chair of mathematics at the Escola Normal de Pernambuco. He joined the Pernambuco Engineering School in\n1920\nand became a full professor of physics there in\n1934\n. He realised that his student Schenberg was very talented and he advised him to transfer to the Polytechnic School of São Paulo. This Schenberg did in\n1933\nknowing that a school of science was about to open there\n[\n23\n]\n:-\nSchenberg arrived in São Paulo at a time of important transformation in scientific activities in Brazil. It was the transition from a science of positivist, utilitarian, professional inspiration, taught by the polytechnics at the end of the Empire and the beginning of the Republic, to the teaching of pure, non-applicable science, which would be taught by the faculties of philosophy, now equipped with laboratories for research. This transition occurred in the midst of the Constitutionalist Revolution of\n1932\n, when the State of São Paulo rebelled against federal interventionism and saw the foundation of University of São Paulo as the path to the formation of an elite capable of promoting the country's development through knowledge.\nThe University of São Paulo was founded in\n1934\nand several mathematicians and physicists were brought in from Europe so that the new university would begin life with high quality teachers and researchers. Those who were to be influential in Schenberg's development were Gleb Vassielievich Wataghin\n(1899\n-\n1986)\n, Giuseppe Paolo Stanislao Occhialini\n(1907\n-\n1993)\n,\nLuigi Fantappiè\n(1901\n-\n1956)\nand\nGiacomo Albanese\n(1890\n-\n1948)\n. Wataghin was a Ukrainian who had moved to Italy in\n1919\nwhen the Civil War broke out. His dislike of the Fascist government in Italy persuaded him to accept the invitation to São Paulo in\n1934\nwhere he worked on astrophysics and particle physics. Wataghin invited Giuseppe Occhialini to join him in São Paulo in\n1937\n. Occhialini was an Italian who had worked at the University of Cambridge before returning to Italy but, like Wataghin, was unhappy with Fascism. He also worked on particle physics.\nFantappiè\nand\nAlbanese\nare both mathematicians with biographies in MacTutor.\nSchenberg studied at the Polytechnic School of São Paulo beginning in\n1933\nand graduated with an Electrical Engineering degree in\n1935\n. He was already studying in the Faculty of Philosophy, Sciences and Letters at the University of São Paulo and graduated with the degree of Bachelor of Mathematical Sciences in\n1936\n. He published the paper\nErratum zu: Sull'interazione degli elettroni\nⓉ\n(\nErratum to: On the interaction of electrons\n)\non Quantum Electrodynamics in the journal\nIl Nuovo Cimento\nand was employed as an Assistant in Experimental Physics\n(1936\n-\n37)\nworking with Gleb Wataghin. After Giuseppe Occhialini arrived in São Paulo in\n1937\n, Schenberg was employed as an Assistant in Theoretical Physics working with Occhialini on cosmic rays\n(1937\n-\n38)\n. Schenberg also became an assistant in charge of courses in relativity in\n1937\n.\nOn\n10\nNovember\n1937\n, there was a coup and Getúlio Vargas became the leader of Brazil taking powers of a dictator. He used these powers to censure the press and by December political parties were abolished. There was political persecution of university professors which led to Schenberg applying for a grant to move to Italy. In\n1938\n, having been awarded the grant, he travelled to Italy where he worked with\nEnrico Fermi\nat the Institute of Physics. While in Rome he published the paper\nRelativistic commutation rules in the quantum theory of fields\n(1938)\n. It was written in English, submitted in May\n1938\nand has the following abstract\n[\n31\n]\n:-\nIn the present paper are discussed the commutation rules between the field quantities at different times. Commutation rules for electron waves are established with the general assumption of a variable electromagnetic field. For an arbitrary material field with first order equation of motion the commutation rules are seen to be analogous to those of the electron, the case of the neutrino field is examined.\nJordan\nand\nPauli\n's rules for the electromagnetic field strengths are analysed in connection with\nMaxwell\n's equations, it is shown that the rules can be written in a symmetrical form similar to those of a material field.\nIn October\n1938\nhe submitted a second part of the paper with the following abstract\n[\n32\n]\n:-\nThe analysis of the commutation rules between field variables at different times, begun in the first part of this paper, is extended to more general cases, in connection with the\nHeisenberg\n-\nPauli\nquantum theory of wave fields. This theory is discussed in connection with the wave equations of the classical field. The theory involves difficulties in the case of first order equations of motion. It is shown that the commutation rules between field quantities at different times can be determined by means of the commutation rules at the same time and the equations of motion, when these equations are linear. The case of second order wave equations is explicitly treated, the commutation rules for the same time being known from the\nHeisenberg\n-\nPauli\ntheory. The study of the functions involved in the relativistic rules shows that the knowledge of these functions is equivalent to the complete solution of the wave equations, any solution being calculable by integrations involving the initial values.\nUnhappy with the signs that war was about to break out, he went to Zurich, still in\n1938\n, and worked there with\nWolfgang Pauli\n. In\n1939\nhe moved to Paris where he worked with Frédéric Joliot-Curie at the Collège de France. He published\nÉquations relativistes de mouvement du premier ordre en Mécanique quantique\nⓉ\n(\nRelativistic equations of motion of the first order in Quantum Mechanics\n)\n(1939)\nin the\nAcademy of Sciences\njournal\nComptes Rendus\n. In this paper he investigated the problem of linearization of the Gordon-\nKlein\nrelativistic equation. He gave a new form of spinor equations in addition to those given by\nDirac\n. In the same year he published another paper on relativity,\nFirst order relativistic equations of motion in quantum mechanics\n, in the\nAnnals\nof the\nBrazilian Academy of Sciences\n.\nAlso in\n1939\nhe was appointed Acting Professor of Physics at the University of São Paulo. After Schenberg returned from Paris to São Paulo in\n1940\n, Wataghin commented how his research had developed\n[\n36\n]\n:-\nMário was a different person and had learned much more than I could have taught him. He had done fine work in cosmic rays and had later began working on electrodynamics. ... He had learned a lot in Rome, and I decided that he didn't have much more to learn from me, and he should travel again ...\nSchenberg applied for a Guggenheim Fellowship which he was awarded in\n1940\n[\n19\n]\n:-\nMário Schenberg is appointed for studies of the application of nuclear and atomic physics to astrophysics; tenure, twelve months from the autumn of\n1940\n.\nSchenberg travelled to the United States, sailing on the\nS S Argentina\nfrom Buenos Aires on\n11\nOctober\n1940\nand arriving in New York on\n26\nOctober\n1940\n. He joined George Gamow's research team at George Washington University in Washington, D.C. Their joint work quickly made a major breakthrough, Alberto Luiz da Rocha Barros writes\n[\n28\n]\n:-\nSchenberg introduced the neutrino into astrophysics to explain the stellar collapse that causes cosmic explosions known as novae and supernovae.\nAntonio Carlos da Silva Miranda writes\n[\n38\n]\n:-\nIt was during a conversation with Gamow that Schenberg had an epiphany and realised that the loss of neutrinos from a star could cause a supernova.\nTheir first joint paper, sent to the\nPhysical Review\nin November\n1940\nwas\nThe Possible Role of Neutrinos in Stellar Evolution\n. It has an abstract which you can read at\nTHIS LINK\n.\nIn February\n1941\nthey sent the second highly significant paper\nNeutrino Theory of Stellar Collapse\nto the\nPhysical Review.\nIt has an abstract which you can read at\nTHIS LINK\n.\nGeorge Gamow called this the Urca process\n[\n14\n]\n:-\nUrca is the name of a casino in Rio de Janeiro, and was used by George Gamow to name the process, as Schenberg once joked to him that \"the process makes the energy disappears from the core of a supernova as fast as money in the roulette game during a visit to Casino da Urca.\"\nYou can read Schenberg's own description of this work with Gamow at\nTHIS LINK\n.\nSchenberg was awarded a second Guggenheim Fellowship for the academic year\n1941\n-\n42\nwhich he spent partly as a member of the Institute for Advanced Study in Princeton, and partly at the University of Chicago's Yerkes Observatory with\nSubrahmanyan Chandrasekhar\n. Schenberg's joint work with\nChandrasekhar\nquickly produced another major breakthrough with the paper\nOn the Evolution of the Main-Sequence Stars\n(1942)\n. The paper has the following abstract\n[\n34\n]\n:-\nThe evolution of the stars on the main sequence consequent to the gradual burning of the hydrogen in the central regions is examined. It is shown that, as a result of the decrease in the hydrogen content in these regions, the convective zone\n(\nnormally present in a star\n)\neventually gives place to an isothermal core. It is further shown that there is an upper limit\n(\n10\nper cent\n)\nto the fraction of the total mass of hydrogen which can thus be exhausted. Some further remarks on what is to be expected beyond this point is also made.\nFor an extract from the paper, see\nTHIS LINK\n.\nHe returned to Brazil from the United States on\n20\nJuly\n1942\n. Back at the University of São Paulo, Schenberg taught courses on Classical Mechanics and Celestial Mechanics. He wrote the thesis\nPrincípios da Mecânica\nⓉ\n(\nPrinciples of Mechanics\n)\nwhich he defended in a public competition in\n1944\nand became Professor of Rational and Celestial Mechanics at the University of São Paulo. The delay in holding the competition prevented Schenberg returning to the United States to continue research in astrophysics and resulted in changes in his research interests. He said\n[\n41\n]\n:-\nI thought about returning to the United States, but, as I had entered a mechanics competition, which took several years to complete, I was unable to return. During that time, I became interested in other problems, not dealing directly with astronomy and astrophysics. I turned my interest to some branches of physics, such as, for example, the theory of general relativity, which, of course, is linked to those sciences.\nSchenberg had held left-wing political views since he was a young boy, but now he became more involved in politics. He was elected Federal Deputy for the Brazilian Communist Party in\n1945\n. In fact the Brazilian Communist Party had been illegal under the dictatorship of Getúlio Vargas but after this ended in\n1945\nthe Brazilian Communist Party became a legal organisation and by\n1947\nhad\n200\n,\n000\nmembers. Schenberg was elected as a State Deputy to the Constituent Assembly of São Paulo in\n1946\nas a Communist Party representative. He was involved in drafting the São Paulo State Constitution in\n1947\nand put into that Constitution an Article calling for the State to provide research funding.\nEurico Gaspar Dutra became President of Brazil in January\n1946\nand by\n1947\nhis government moved against the Brazilian Communist Party. Schenberg was impeached and arrested for his involvement with the Communist Party. In\n1948\nhe left Brazil and went to the University of Brussels where he spent five years. Giuseppe Occhialini, whom Schenberg had worked with in São Paulo, had left Brazil and, after spending time in England, had been appointed to the Free University of Brussels in\n1948\n. Schenberg collaborated with Occhialini's research group and also worked with Ilya Prigogine\n(1917\n-\n2003)\n, a Russian born Belgium physicist who shared with Schenberg a love of art and architecture.\nSchenberg returned to the University of São Paulo in\n1953\nwhere he was appointed as head of the Department of Physics. Between\n1953\nand\n1962\nhe published papers on a variety of topics;\n19\nof these papers are in MathSciNet. These include:\nA generalization of the quantum mechanics\n(1953)\n;\nOn the hydrodynamical model of the quantum mechanics\n(1954)\n;\nA non-linear generalization of the Schrödinger and Dirac equations\n(1954)\n;\nOn the Grassmann and Clifford algebras\n(1956\n,\n1960)\n;\nQuantum mechanics and geometry\n(5\npapers,\n1957\n-\n58)\n; and\nOn the Clifford and Jordan-Wigner algebras\n(1962)\n. During these years, at the University of São Paulo\n[\n14\n]\n:-\n... he founded the Solid State Physics Laboratory and participated in the purchase of the first computer of the Universidade de São Paulo, showing remarkable ability to predict the course of science and technology.\nCésar Lattes\n(1924\n-\n2005)\nwas a physicist who had trained at the University of São Paulo with Gleb Wataghin and Giuseppe Occhialini, and had spent time with Occhialini in England studying cosmic rays. He was appointed to the Federal University of Rio de Janeiro but, in\n1957\n, Schenberg persuaded him to accept a position in the Department of Physics at São Paulo. Schenberg, Lattes and others worked as a Brazilian cosmic rays group. Always interested in art as well as science, Schenberg began making both major interests. The artist José Roberto Aguilar said\n[\n27\n]\n:-\nI attended several meetings at Schenberg's home. In the same evening, he'd be discussing atomic particles with Lattes one minute, and the next he'd be talking to the musician Jorge Mautner ...\nMautner had been born in in Rio de Janeiro in\n1941\n, a month after his Jewish parents had emigrated from Austria to escape the Holocaust. He studied music in São Paulo and was invited by Schenberg to join the Brazilian Communist Party in\n1962\n. It was in\n1962\nthat Schenberg was elected for a second term as a State Deputy to the Constituent Assembly of São Paulo, this time as a representative of the Brazilian Labour Party. Schenberg had made a more major move from science to art in\n1961\nwhen he resigned as head of the Department of Physics and organised an exhibition by the artist Alfredo Volpi in the São Paulo Biennial. This art exhibition had been founded in\n1951\nand is the second oldest art biennial in the world.\nOn\n1\nApril\n1964\nthere was a military coup in Brazil leading to a dictatorship. Because of his membership of the Brazilian Communist Party, seven days after the coup Schenberg was arrested, forced to resign his university position and put in prison. He was\n50\ndays in prison and, while there, the police raided his apartment, took away a Baroque statue of a saint, thinking it was a statue of Lenin, and, after checking though all his books, removed several including\nPlato\n's\nDialogues\n. His daughter, Ana Clara Schenberg, said\n[\n27\n]\n:-\nAfter he was released, the court gave my father permission to go to the police station and explain that there was no way\nPlato\ncould have been a communist. He managed to get his book back, but not before spending several hours expounding on Platonic philosophy at the police station. For several months, he went to the police station every Thursday and spent the afternoon explaining the contents of the books they had seized until he was able to recover them.\nSchenberg could have left Brazil and continued his mathematical physics research but he chose to stay in the country and devote most of his energies to art. He was invited to act as a judge for the São Paulo Biennial in\n1965\nand\n1967\n. Because of pressure from the authorities, however, they did not appoint Schenberg as a judge for\n1969\nand this caused the Art Advisory Board to almost stop functioning. For more details of this, see\n[\n42\n]\n,\n[\n43\n]\nand\n[\n44\n]\n.\nAlthough now essentially a full-time art critic, Schenberg did not give up mathematical physics completely, publishing\nTime and mass in relativity\n(1973)\n. For Schenberg's Abstract to this paper, see\nTHIS LINK\n.\nIn\n1979\nhe was included in the Amnesty Law promoted by President João Figueiredo and returned to teaching at the Physics Institute of the University of São Paulo. In\n1983\nhe received the Science and Technology Award from the National Research Council.\nSchenberg was married to the author Julieta Bárbara Guerrini\n(1908\n-\n2005)\n. In addition to being a poet, she was a painter and wrote articles for the Rio newspaper\nA Manhã\n. She had previously been married to the poet Oswald de Andrade\n(\nshe was the fourth of his five wives\n)\n, and to the artist Lourdes Cedran. Mário Schenberg and Julieta Guerrini had one daughter, Ana Clara Guerrini Schenberg, who is a geneticist.\nSchenberg died in São Paulo in\n1990\nat the age of\n76\n. In\n1989\nthe conference\nClifford algebras and their applications in mathematical physics\nwas held in Montpellier, France. In the\nProceedings\npublished in\n1992\n, Schenberg's paper\nAlgebraic structures of finite point sets. I\n, which dated back to\n10\nNovember\n1964\n, was printed with the note:-\nThis is being done today as reparation for the suffering inflicted on this man of Peace and Science by a regime of injustice.\nThe paper, intended to be the first in a series, had never been published as a result of the\n1964\nBrazilian coup. Alum Morris writes in a review:-\nIt contains a very original construction of\nClifford\nalgebras and was intended as the first of a number of articles. Its publication now is an important contribution to the history of the subject.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}