{
  "nome_completo": "Mór Réthy",
  "nome_curto": "Mór Réthy",
  "ano_nascimento": "1846",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rethy/",
  "lugar_nascimento": "Nagykörös, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Mór Réthy\nwas born with the name Rothbaum but, in\n1871\n, he changed his name as a sign of solidarity with the Hungarian culture. Unlike most contemporary scientists he didn't come from a well-to-do family. His father, a man of high morality, was an outstanding teacher at the elementary school of Nagykörös. However, he had a big family to care for so he was forced to give up teaching and he became a merchant.\nMór went to primary and to secondary school in his native town of Nagykörös. Later he attended the Technical Universities of Vienna and Budapest. Meanwhile he worked for a year as an officer at the Central Postal and Telegraph Service to support his father. He graduated with a degree in mathematics and descriptive geometry from the Technical University of Budapest in\n1870\n. In the same year he married Etelka Finály, the sister of the famous classical-philology professor Henrik Finály. Following his graduation, Réthy worked for two years as a teacher of mathematics and descriptive geometry at the Modern Technical School of Körmöcbánya.\nThanks to a state bursary suggested by Baron\nLoránd Eötvös\n, he had the opportunity to continue his studies at the famous universities of Göttingen and Heidelberg. At Göttingen he had the good fortune to be able to admire\nAlfred Clebsch\n's lectures and his wonderful way of teaching. Unfortunately, although only\n39\nyears old,\nClebsch\ndied of diphtheria in November\n1872\nand Réthy had to face up to his sudden death. His first paper on the diffraction of light was presented at Göttingen in\n1872\n. The second part of his bursary was spent at Heidelberg University, where\nKirchhoff\n,\nKönigsberger\nand Schering assured him lifelong mental munition.\nLeo Königsberger\nand Réthy remained in a close contact: Réthy's nine letters from\n1875\nto\n1898\ncan still be found in the Staatsbibliothek zu Berlin Handschriftabteilung. He obtained his doctoral degree from Heidelberg University in\n1874\n.\nReturning home after the award of his doctorate, he was appointed extraordinary professor at the University of Kolozsvár. His seminars in mathematics - on elliptic functions, complex functions and determinants - gave a new colour to contemporary mathematical life. During his stay at Kolozsvár problems concerning of navigation, including the question of constructing the most efficient propeller, were the focus of interest. Mór Réthy took part in very fruitful debates between outstanding mathematicians of his age and soon enriched the literature with two papers on the topic. In\n1876\nhe was promoted professor in the Mathematical and Theoretical Physics Department at Kolozsvár.\nIn\n1878\nhe was elected a corresponding member of the\nHungarian Academy of Sciences\n. He was promoted to dean at Kolozsvár University, serving in this role on two separate occasions. From\n1884\nto\n1886\nhe was the Head of the Department of Elementary Mathematics.\nHis whole life was interwoven with analysing, communicating and developing the work of the two Bolyais. This theme began to dominate contemporary mathematical thinking\n[\n2\n]\n:-\nThe prelude was Mór Réthy's lecture delivered at Kolozsvár University in\n1874\n, which soon appeared in print. This paper throws light on Réthy's efforts to introduce and popularize absolute geometry. His aim was to kindle interest in reading the Appendix itself, and with this in mind, he gave reformulations of several basic definitions and concepts\n(\nBolyai\n's definition of parallelism, the paracycle, parasphere, hypercycle, hypersphere\n)\nthat are easier to follow than their originals in the Appendix. And he went a step further: starting from the fact that in absolute geometry in infinitely small segments of space the theorems of Euclidean geometry hold true, and relying on the recognition that spherical trigonometry is independent of\nEuclid\n's\n5\nth\npostulate, Réthy built up\nBolyai\n's trigonometry independently. Thus, he set the trend aiming at the simplest possible exploration of absolute trigonometry relying on the fewest possible axioms. Of the wealth of literature in this vein, let us only mention the articles by Pál Szász.\nAnother merit of Réthy is that he was the first to review and elaborate the hyperbolic constructions of the Appendix in detail.\nIn\n1886\nMór Réthy was invited to the Technical University of Budapest, where he first lectured on geometry. Then his interest turned to theoretical problems of physics and mechanics. From\n1892\nhe was professor of the Analytical Mechanics and Theoretical Physics Department. Similarly to his years at Kolozsvár, he served two spells as dean of the Technical University of Budapest. In\n1891\nhe became not only a founding member of the Mathematical and Physical Society\n(\ntoday named the\nJános Bolyai Mathematical Society\n)\n, but he worked as a committee member from its inception.\nMór Réthy was one of the professors -\nGyula König\n, Arpád Geötze,\nJenö Hunyadi\n,\nGyula Farkas\netc. - who lectured both on mathematics and physics at a very high level.\n(\nAs stated in\n[\n1\n]\n)\nUnfortunately he is often referred to as either a mathematician or a physician in spite of the fact that he embodied both. Another problem is that though he was born in\n1846\nhis year of birth is often erroneously written\n1848\n. Of course the correct data can also be found: Réthy, Mór; früher Rothbaum\n(1846\n-\n1925)\nPhysiker und Mathematike.\n)\nHis literary heritage is divided between mathematics and physics. Most of his work was published in Hungarian, but a great many papers were written in German or at least have been titled in English:\nÜber ein Dualitätsprinzip in der Geometrie\nⓉ\n(\nOn a duality principle in geometry\n)\n(1872)\n,\nThe so-called non-Euclidean plane trigonometry of the three-dimensional homogeneous space\n(1875\n, Hungarian\n)\n,\nDie Fundamentalgleichungen der nicht-euklidischen Geometrie auf elementare Wege abgeleitet\nⓉ\n(\nThe fundamental equations of non-Euclidean geometry derived from elementary paths\n)\n(1876)\n,\nA contribution to the theory of propeller and peripeller surfaces\n(1876\n, Hungarian\n)\n,\nTo the theory of the propeller\n(1877\n, Hungarian\n)\n,\nTheorie d. Reflexion und Brechung; Ueber die Polarisation d. gebeugten Lichts\nⓉ\n(\nTheory of reflection and refraction concerning the polarization of diffracted light\n)\n(1880)\n,\nEndlich-gleichen Flächen\nⓉ\n(\nFinite equal surfaces\n)\n(1890\n&\n1891)\n,\nÜber endlich-gleichen Flächen\nⓉ\n(\nOn finite equal surfaces\n)\n(1893)\n,\nEnd-like equal areas\n(1890\n&\n1893\n, Hungarian\n)\n,\nZum Beweise des Haupsatztes über die Endlichkeit zweier ebener Systeme\nⓉ\n(\nProvong fundamental theorems on the finiteness of two plane systems\n)\n(1894)\n,\nFlüssigkeitsstrahlen in incompressiblen reibenslosen Flüssigkeiten\nⓉ\n(\nLiquid jets in incompressible smooth fluids\n)\n(1894)\n,\nFluid currents\n(1894\n, Hungarian\n)\n,\nÜber das Princip der kleinsten Action,\n(\nund über das von Hamilton\n)\nⓉ\n(\nOn the principle of least action\n(\nand that of Hamilton\n)\n)\n(1896)\n,\nÜber schwere Flüssigstrahlen\nⓉ\n(\nOn heavy liquid jets\n)\n(1898)\n,\nAn introduction to János Bolyai's \"new, different world\"\n(1903\n, Hungarian\n)\n,\nDas Ostwaldsche Princip vom Energieumsatz in der Mechanik\nⓉ\n(\nThe Ostwald principle of energy conversion in mechanics\n)\n(1905)\n.\nIn\n1900\nMór Réthy became a full-member of the\nHungarian Academy of Sciences\n. Regarding his results concerning hydrodynamics, because of his studies on end-like equal areas and finally his treaties on mechanical principles\n(\nand the fact that all of them created significant international interest\n)\nMór Réthy was awarded the Marczibányi Prize by unanimous voting of the Committee of the\nHungarian Academy of Sciences\nin\n1904\n[\n2\n]\n:-\nEndowed with extreme modesty and working capacity, Réthy was a person worthy of affection and an ardent servant of all Hungarian causes. His most significant essays deal with the legacy of the two Bolyais and the development of some of their results. Internationally, however, better known are Réthy's investigations in physics. His results concerning the shape of jets of incompressible fluids - where he applied deep tools of function theory - were the basis for many a further investigation. Also well known is Réthy's research into the Ostwald theory and into the classic \"principles\" of mechanics.\nAt the last decades of the\n19\nth\ncentury the\nHungarian Academy of Sciences\ndecided to bring into being the second edition of the two Bolyais' immortal work: the\nTentamen\nⓉ\n(\nAn attempt to introduce studious youths to the elements of pure mathematics\n)\n. Some outstanding scientists took part in that time-consuming enterprise, but it was only Mór Réthy, who persisted in doing so from the beginning to the end:-\nWolfgangi Bolyai de Bolya: Tentamen iuventutem studiosam in elementa matheseos purae elementaris ac sublimioris methodo intuitiva evidentiaque huic propria introducendi, cum appendice triplici\n(1897)\n(\nI. Conspectus arithmeticae generalis. Mandato Academiae scientiarum hungaricae suis adnotationibus adiectis ediderunt Julius König et Mauritius Réthy. - II. Elementa geometriae et appendices ... ediderunt Josephus Kurschák, Mauritius Réthy, Béla Tötössy de Zepethnek\n)\nⓉ\n(\nWolfgang Bolyai: An attempt to introduce the student to the elements of pure elementary mathematics and to a more sublime intuitive method and proofs proper to this, with a triple appendix.\n(1897)\n(\nPublished by order of the Academy of Sciences:\n1\n. General Conspectus of arithmetic -- Maurice Rethy, Julius Konig\n2\n. Elements of geometry and appendices -- Joseph Kurschak, Mauritius Rethy, Bela Totossy of Zepethnek\n)\n)\nAt the time of the celebrations of\nJános Bolyai\n's centenary Mór Réthy published an essay on the new different world of\nJános Bolyai\n. At that time he wrote something very personal in his diary\n[\n7\n]\n:-\nThe atmosphere of these celebrations led me back to the absolute geometry. Suddenly I have noticed that an error crept into the last sentence in the new edition of the Appendix. The remark concerning it originates from me.\nThe last quarter of Mór Réthy's life was shadowed by personal and historical losses: the decease of his second son as a victim of World War I, his four-year-old granddaughter's death; at the University the change of the atmosphere for the worse, further the separation from Transylvania, Kolozsvár, and his beloved garden at Hója.\nIn the last but one year of his life, on\n24\nJuly\n1924\n, he was awarded a Jubilee doctorate from Heidelberg University.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}