{
  "nome_completo": "Machgielis Euwe",
  "nome_curto": "Machgielis Euwe",
  "ano_nascimento": "1901",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Euwe/",
  "lugar_nascimento": "Watergraafsmeer, near Amsterdam, Netherlands",
  "lugar_morte": "Amsterdam, Holland",
  "biografia": "Machgielis Euwe\nis better known by the name\nMax Euwe,\nand he is better known as the world chess champion from\n1935\nto\n1937\nthan as a mathematician. However, Euwe was indeed a very fine mathematician who concentrated more on his mathematics throughout his life than on his chess.\nMax Euwe's parents were Elisabeth and Cornelius Euwe. Cornelius was a teacher and he often played chess with his wife who loved the game. By the time Max was five years old his parents had taught him to play and soon he was able to beat them. Max attended school in Amsterdam where he excelled in mathematics, and he began to play chess at ever more advanced levels. In\n1911\n, when he was ten years old, Max entered his first chess tournament, a one day Christmas congress, and won every game. He became a member of the Amsterdam chess club when he was twelve years old and by the time he was fourteen he was playing in the Dutch Chess Federation tournaments. This was a difficult time in most European countries as World War I was totally disrupting normal life in most places, but The Netherlands remained neutral, so life in Amsterdam was relatively comfortable.\nWhen he was eighteen years old Euwe was awarded his\nAbitur\nafter attending a six-form High School in Amsterdam. By this time World War I had ended and international travel became possible again. Euwe made his first trip abroad, going to England to play in the famous Hastings Chess Tournament where he took fourth place. There had been little doubt in his mind what subject he should study at university, and he entered Amsterdam University to begin his study of mathematics. It should not be thought that Euwe kept his study of chess distinct from his mathematical studies. On the contrary he saw mathematics as being able to provide him with a logical, precise, even algebraic, approach to the game. We mention below an interesting mathematics paper he wrote which was motivated by chess.\nBy\n1920\nhe was the leading Dutch player and he won the Dutch Championship for the first time in August\n1921\n. In\n1923\nhe was awarded an Honours Degree in mathematics from Amsterdam University. He then undertook research in mathematics which led to him being awarded a doctorate in\n1926\nfrom the University of Amsterdam. His dissertation,\nDifferentiaalinvarianten van twee covariantie-vectorvelden met vier veranderlijken\nⓉ\n(\nDifferential invariants of two covariance vector fields with four variables\n)\n, was supervised by Roland Weitzenböck and Hendrick de Vries\n(\nwho also supervised\nvan der Waerden\naround this time\n)\n. Euwe then lectured on mathematics in Winterswyk and Rotterdam and was appointed to the Lyceum for Girls in Amsterdam, teaching mathematics there from\n1926\nto\n1940\n.\nHis doctoral studies behind him, from December\n1926\nto January\n1927\nEuwe narrowly lost a match with Alekhine\n2\ngames to\n3\nwon with\n5\ndraws. At this stage Alekhine was not World Chess Champion, but soon after this he won the title and Euwe saw that, having competed so well with Alekhine, he was in with a chance at becoming World Champion himself. In\n1928\nhe beat Bogolyubov twice in matches played in Amsterdam, Rotterdam and Utrecht.\nIn\n1929\nhe published a mathematics paper in which he constructed an infinite sequence of\n0\n's and\n1\n's with no three identical consecutive subsequences of any length. He then used this to show that, under the rules of chess that then were in force, an infinite game of chess was possible. It had always been the intention of the rules that this should not be possible, but the rule that a game is a draw if the same sequence of moves occurs three times in succession was not, as Euwe showed, sufficient.\nIn\n1930\nhe won the Hastings tournament ahead of Capablanca. However in an Euwe - Capablanca match which was played later Euwe lost\n0\nwins to\n2\nwith\n8\ndraws. The year\n1932\nwas a very successful one beating Spielmann, drawing twice with Flohr and taking second place behind Alekhine in a tournament in Berne.\nDuring\n1933\n-\n34\nhe played very little chess while he concentrated on mathematics. Then, in the summer of\n1935\n, he challenged Alekhine; the match began on\n3\nOctober. It was held at twenty-three different locations in Amsterdam, The Hague, Delft, Rotterdam, Utrecht, Gouda, Groningen, Baarn, Hertogenbosch, Eindhoven, Zeist, Ermelo, and Zandvoort. L Pins and B H Wood write in\n[\n1\n]\n:-\nThe dramatic result of his first match against Alekhine is old history. Three points down after seven games, he pulled up to equality, only to see his redoubtable opponent draw away again. Battling gamely, he was still two down at the two-thirds stage, but won the twentieth, twenty-first, twenty-fifth, and twenty-sixth games and retained his grip on a now desperate adversary to the end.\nIn\n[\n1\n]\nthere is also a description of Euwe's style of play:-\nEuwe's great characteristic is economy of force. He is logic personified, a genius of law and order. His play is accurate and aggressive. One would hardly call him an attacking player, yet when his genius is functioning at its smoothest he strides confidently into some extraordinary complex positions: he is no disciple of simplicity. His greatest weakness is a tendency to blunder.\nEuwe played the Nottingham International Chess Tournament from\n10\nAugust to\n28\nAugust\n1936\nwhile he was World Champion. In the Introduction to the Book of the Tournament, W H Watts writes:-\nEuwe is the essence of caution. To win the world's championship and to secure a place only half a point behind the winner on caution alone is impossible, there must be depth and imagination, but the outstanding impression to be gained from his games is caution and dogged perseverance.\nDespite this overall impression of caution, it is worth noting that Euwe shared the prize for the most wins in his score during the tournament.\nWhile Euwe was World Champion he changed the way that players competed for the title. From that time on the rights to organise World Championship matches was given to FIDE\n(\nFédération Internationale des échecs - the World Chess Federation\n)\n. The one exception was the return match between Euwe and Alekhine which went ahead according to the conditions already arranged at the time of the first match.\nIn his return match with Alekhine things went badly for Euwe after winning the first game, and he lost the match by a margin of five points. Various reasons have been put forward as to why he was defeated so heavily, but the main reason was almost certainly the fact that his advisor, Reuben Fine, had taken ill with appendicitis and could not assist him.\nAfter this Euwe went through a rather bad spell as regards his chess. His teaching duties made it difficult for him to concentrate on tournaments and in the Dutch championship which followed his defeat as World Champion he could only play matches in the evening as he had teaching commitments through the day. For other tournaments, although he did receive time off from his teaching duties to play, he had no time to prepare as he would teach up to the last moment.\nHe played at Hastings at Christmas\n1938\n-\n39\nand won the Dutch Championship again in\n1939\nbut the onset of war made international play difficult over the next few years. During the war Euwe led work to provide food for people through an underground charity organisation.\nAfter the war he won the London Tournament in\n1946\nand it looked for a while as though he might challenge again for the World Championship. However after some impressive play in the couple of years following the war, he then began to look past his best. Euwe became interested in electronic data processing and was appointed as Professor of Cybernetics in\n1954\n. In\n1957\nhe visited the United States to study computer technology in that country. While in the United States he played two unofficial chess games in New York against Bobby Fischer, winning one and drawing the second. He was appointed director of The Netherlands Automatic Data Processing Research Centre in\n1959\n. He was chairman, from\n1961\nto\n1963\n, of a committee set up by Euratom to examine the feasibility of programming computers to play chess. Then, in\n1964\n, he was appointed to a chair in an automatic information processing in Rotterdam University and, following that, at Tilburg University. He retired as professor at Tilburg in\n1971\n.\nIn\n1970\nEuwe was elected the president of FIDE and held that position until\n1978\n. His role as arbitrator of the Fischer - Spassky World Championship match in Reykjavik, Iceland in\n1972\nwas a very difficult one which he carried out with great tact and skill. He was unfortunate that during his time as president negotiations for the World Championship match between Fischer and Karpov became extremely difficult. Euwe made huge efforts to ensure that the match was played but, unfortunately, despite every effort eventually the match had to be awarded to Karpov by default.",
  "math_areas": [
    "Logic"
  ]
}