{
  "nome_completo": "Magnus Joseph Wenninger",
  "nome_curto": "Magnus Wenninger",
  "ano_nascimento": "1919",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wenninger/",
  "lugar_nascimento": "Park Falls, Wisconsin, USA",
  "lugar_morte": "Collegeville, Minnesota, USA",
  "biografia": "Magnus Wenninger\nwas named Joseph Wenninger, taking the monastic name, Magnus after becoming a monk. His parents were both born in Germany and had emigrated to the United States, settling in Wisconsin. Magnus\n(\nwe will refer to him by that name although at the time he was called Joe\n)\nwas the second of his parents' seven children. His father was a baker in Park Falls, a town about\n70\nkm south of the southern shore of Lake Superior. Magnus attended St Anthony Elementary School in Park Falls from\n1925\nto\n1933\n. His parents expected the oldest of their boys to follow his father in becoming a baker, and Magnus as the second child to become a priest. When Magnus was about thirteen years old his parents saw an advertisement for Saint John's Preparatory School, Collegeville, Minnesota, in a German newspaper\nDer Wanderer\n. The monks and priests of Saint John's Abbey, a Benedictine community, had founded the school in\n1857\n. The reason for the German connection was that the first Benedictines who came to Minnesota in\n1856\ncame originally from the Bavarian abbey of Metten in southeastern Germany. The school prepared boys for the Benedictine college, St John's University, so Magnus's parents thought this would be the right place for Magnus to receive his education. He entered Saint John's Preparatory School in\n1933\n[\n1\n]\n:-\nI was homesick being away at first, but by the end of the first year I had made so many friends and I liked it so much that I never left.\nAfter graduating in\n1937\n, Wenninger entered Saint John's University, Collegeville. He graduated with a B.A. in philosophy in\n1942\n, having taken education as his minor subject. However, in parallel to this he had entered Saint John's Abbey and professed Benedictine monastic vows on\n11\nJuly\n1940\n. He attended Saint John's Seminary and was ordained a Roman Catholic priest on\n2\nSeptember\n1945\n. When he entered the Order of Saint Benedict he was give the name Magnus so from this point on we will refer to him as Father Magnus. At this stage Father Magnus's education had not contained much mathematics. He explained in\n[\n1\n]\nhow he was led to mathematics:-\nAfter the usual high school courses, I had only one semester of college algebra in all my studies at St John's. One day, after I had been ordained a priest, the Abbot called me in to say that the Order was starting a school in the Bahamas, and he wanted me to go there and teach. \"What will I teach?\" I asked. \"They'll tell you when you get there.\" But he said that before I went there, I should go to the University of Ottawa and get a Master's degree.\nThe Abbot suggested that he should study educational psychology. However\n[\n1\n]\n:-\nWhen I got there I found that almost all of the courses I was interested in were being taught in French, which I had never learned. Fortunately there was one man there, Thomas Greenwood, in the philosophy department, who was willing to give me a course in English, in symbolic logic. I did my M.A. thesis on 'The Concept of Number According to\nRoger Bacon\nand\nAlbertus Magnus\n'. It had to be done quickly, because I had to get ready to go down to the Bahamas.\nAfter being awarded an M.A. in Philosophy from the University of Ottawa in\n1946\n, Father Magnus was sent to St Augustine's College, Nassau, in the Bahamas. The headmaster of the school said he needed a teacher of English and a teacher of mathematics and gave Father Magnus the choice. Because of the mathematics he had studied during his Master's studies, he chose mathematics which, he said, proved to be the most significant decision in his life after deciding to become a Benedictine monk. His teaching was only at an elementary level but, after ten years, he felt rather stale and his headmaster suggested that he take a summer course. He decided to take a Master's Degree at Columbia University Teachers College in New York by studying there for four summer sessions. He was awarded his M.A. in Mathematics Education in\n1961\n.\nIt was while studying at Columbia University Teachers College that he became interested in polyhedra after seeing models in display cases along the walls. He read\nMathematical Models\nby H Martyn Cundy and A P Rollett, and then\nThe Fifty-nine Icosahedra\nby\nH S M Coxeter\n,\nP Du Val\n, H T Flather and J F Petrie. After reading this book he began to make models of all the fifty-nine icosahedra and many of the uniform polyhedra. In\n1966\nthe National Council of Teachers of Mathematics published Father Magnus's\nPolyhedron Models for the Classroom.\nThe original booklet contained\n40\npages but the revised edition, published in\n1975\n, had\n80\npages. Father Magnus writes in the Introduction:-\nThis booklet, first published in\n1966\n, went through its sixth printing in\n1973\n, making up a total of\n35000\nprinted copies. That fact alone attests to the continuing interest in this work on the part of teachers and students alike.\nHis Abstract for this edition reads as follows:-\nThis second edition explains the historical background and techniques for constructing various types of polyhedra. Seven center-fold sheets are included, containing full-scale drawings from which nets or templates may be made to construct the models shown and described in the text. Details are provided for construction of the five Platonic solids, the thirteen Archimedean solids, stellations or compounds, and other miscellaneous polyhedra. The models may be used to illustrate the ideas of symmetry, reflection, rotation, and translation.\nAfter the publication of the first edition of the booklet in\n1966\n, Father Magnus had written to\nDonald Coxeter\n[\n1\n]\n:-\nHe was very helpful. He sent me a copy of the monograph on 'Uniform Polyhedra' written by himself, J C P Miller and M S Longuet-Higgins. That was the first time I saw a full list of the seventy-five uniform polyhedra. I started making the models one after the other, using cardstock paper, tagboard it was called. I made sixty-five of them, and they were on display in my classroom. At that point I decided to contact a publisher to see if they would be interested in a book. I sent the pictures and the text to Cambridge University Press.\nCompleting the task of constructing the remaining ten uniform polyhedra proved difficult and R Buckley of Oxford University assisted Father Magnus by supplying the precise measurements. Father Magnus published\nPolyhedron models\nwith Cambridge University Press in\n1971\n.\nDonald Coxeter\nwrote in the Foreword to the book:-\nIn his infectious enthusiastic style, the author gives clear instructions for making models of many kinds of polyhedra. These instructions are illustrated by photographs of his own collection, including what is almost certainly the only complete set ever made of the known uniform polyhedra. But photographs cannot really show the models in their full splendour. The most complicated 'snub' solids are not only extremely difficult to make but also highly decorative: a perfect instance of the connection between truth and beauty.\nOne might be surprised by\nCoxeter\n's phrase 'known uniform polyhedra', but he uses this with care since at the time of writing it was not known whether the\n75\nuniform polyhedra exhausted the list of such polyhedra. However, in\n1975\n, John Skilling of Cambridge University proved, using a computer search, that the list was complete.\nArthur Loeb\n[\n6\n]\nwrites in a review of\nPolyhedron models\n:-\nThe author describes with loving care the pitfalls or special effects to be encountered with each model, reflecting fifteen years of experience in the assembly of these fascinating and beautiful structures.\nThe book was also reviewed by D A Quadling\n[\n7\n]\nwho writes:-\n... and this is the book to give your favourite godchild, or perhaps your head of department on the occasion of his retirement\n(\nfor there is material here for whiling away\n2000\nor more happy hours\n)\n.\nFather Magnus taught mathematics at St Augustine's College in Nassau until\n1971\n, then spent the next ten years as Accountant and Comptroller for the College. In\n1981\nbe returned to Minnesota and spent three years as Accountant in the Liturgical Press, Order of Saint Benedict, Collegeville. He then retired but continued to live at Saint John's Abbey, Collegeville.\nRemarkably Father Magnus has published over\n25\nbooks and articles on mathematics, mostly on polyhedra. His articles include\nStellated Rhombic Dodecahedron Puzzle\n(1963)\n,\nThe World of Polyhedrons\n(1965)\n,\nSome Facts About Uniform Polyhedrons\n(1966)\n,\nFancy Shapes from Geometric Figures\n(1966)\n,\nSome Interesting Octahedral Compounds\n(1968)\n,\nA New Look for the Old Platonic Solids\n(1971)\n,\n(\nwith H Martyn Cundy\n)\nA Compound of Five Dodecahedra\n(1976)\n,\nGeodesic Domes by Euclidean Construction\n(1978)\n,\nAvenues for Polyhedronal Research\n(1980)\n,\nPolyhedrons and the Golden Number\n(1990)\n, and\nArtistic Tessellation Patterns on the Spherical Surface\n(1990)\n.\nTo end this biography we look at two further books published by Father Magnus. The first of these is\nSpherical models\n(1979)\n, which is described by E Jucovic in a review as follows:-\nThis is the author's second book on geometric models inspired by\nH S M Coxeter\nand is written in the same style as the first\n[\nPolyhedron models\n]\n. It describes precisely - with a minimum of theory - procedures for constructing\n(\npaper\n)\nmodels of special decompositions of the\n2\n-sphere\n(\nthe regular and the Archimedean ones\n)\nand of geodesic domes and of some related models\n(\nhoney-combs, etc.\n)\n. By its contents the book should appeal mainly to students and teachers in mathematics, but it can be of interest to specialists in art, architecture and engineering. The book is illustrated by many excellent photographs and drawings, and effects nice aesthetic feelings.\nThe book was also reviewed by John Ede\n[\n4\n]\nwho writes:-\nThis sequel to the author's 'Polyhedron Models' is all that devotees of the earlier book would expect; admirably clear, beautifully produced and alive with Magnus Wenninger's infectious enthusiasm. You may, like the reviewer, have made a great many models and may even be a byword for patience among your friends and yet you will surely feel faint at the thought of Wenninger's collection. This book is, however, more than instructions for a series of models: the underlying ideas are explained in enough detail to add greatly to one's satisfaction without taking control of what is intended as a practical book.\nAlso David Brisson\n[\n2\n]\nremarks that:-\n... such a beautiful, clear and expository study of the class of forms presented by Wenninger is a delight.\nThe second of Father Magnus's two books we were going to look at is\nDual models\n(1983)\n. It was reviewed by\nDonald Coxeter\n:-\nThis book contains a beautifully illustrated description of the isohedral polyhedra whose vertices are surrounded like the apices of right pyramids based on regular polygons\n(\nincluding star polygons such as the pentagram\n)\n. It begins with an enthusiastic foreword by Skilling, who once made an important contribution to the subject by establishing the completeness of the list of uniform polyhedra described by the author in his earlier book\n[\nPolyhedron models\n]\n. The introduction includes a careful description of the process of reciprocation with respect to a circle\n(\nin the plane\n)\nor a sphere\n(\nin space\n)\n. This clarifies the principle\n(\nattributed to the late Dorman Luke\n)\nthat the vertex figure of each uniform polyhedron yields by reciprocation the face of the dual polyhedron. Another useful principle, enunciated on page\n3\n, is that the dual of a given nonconvex uniform polyhedron π is a stellated form of the dual of the convex hull of π. Many pages are devoted to photographs of intricate models and well-illustrated instructions whereby the reader can try to duplicate this achievement. Two especially appealing solids, because of their extraordinarily sharp corners, are the great pentakisdodecahedron and the medial inverted pentagonal hexecontahedron.\nFinally we quote from John Ede's review of the book\n[\n3\n]\n:-\nThose model makers who already value 'Polyhedron Models' and 'Spherical Models' will welcome Wenninger's new book. Once again it is a volume that is a delight to handle, with clear diagrams and good photographs, and is a credit to publisher as well as author.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}