{
  "nome_completo": "María Andresa Casamayor de La Coma",
  "nome_curto": "María Andresa Casamayor",
  "ano_nascimento": "1720",
  "ano_morte": "1780",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Casamayor/",
  "lugar_nascimento": "Zaragoza, Spain",
  "lugar_morte": "Zaragoza, Spain",
  "biografia": "María Andresa Casamayor\nwas named Andresa because she was born on\n30\nNovember which is St Andrew's day. St Andrew in Spanish is San Andrés, the female version being Andrea or Andresa. María Andresa was the daughter of Juan Joseph Casamayor, a French textile merchant, and his wife Juana Rosa de La Coma, the daughter of Zaragoza merchants of French descent. Her father was born in Oloron, France, the son of Juan Casamayor and María Abales. Her mother was Juana Rosa de La Coma from Zaragoza, daughter of the merchant Juan de La Coma and María Alexandre.\nMaría Andresa's parents married in Zaragoza on\n13\nApril\n1705\nand they had nine children of which María Andresa was the seventh. She was baptised the day after her birth at the Basilica of Our Lady of Pilar and she was given the names María Juana Rosa Andresa.\nThe family were financially well-off and it is thought that all the children would have been educated at their rented home on Calle del Pilar close to the Basilica of Our Lady of Pilar. At this time there were many French people in Zaragoza involved in commerce. Being part of the French community would have an influence on the way María Andresa was brought up since their customs and way of thinking was a little different from the Spanish people. The standard education for girls in Spain at this time would be teaching them to sew, do housework and understand the Christian religious principles. We know, however, from the skills that María Andresa had acquired by the age of\n17\n, that she must have been taught writing and arithmetical skills to a high standard. For boys who were part of the merchant and commerce industry of Zaragoza at this time, arithmetical skills would have been vital. Trade with the neighbouring territories involved Aragonese, Castilian and French areas and these all had different units of currency, length, area and weight. It would have been vital for anyone trading with these communities to be expert in converting from one system to another. María Andresa certainly acquired these skills and, throughout her life, strongly believed the importance of all girls and boys acquiring them. This surely indicates that she was taught these skills along with her siblings.\nSince María Andresa became a teacher, we should briefly look at how education was organised in Zaragoza in the first half of the\n18\nth century. There were ten teachers in the city who gave elementary lessons to boys, either in their establishments or in the homes of their pupils. This type of education would later be extended to girls in the second half of the\n18\nth century. The city also had a public elementary school with its own classrooms located in the Jesuit College of the Eternal Father\n[\n2\n]\n:-\nOf special importance for our history is the role of Piarist fathers who arrived in Zaragoza on\n27\nOctober\n1731\n. The Piarists gave good quality, free and universal education\n(\nbut only for men\n)\nboth in letters and in science. One of these first Piarists was Juan Francisco de Jesús, professor of Mathematics ...\nIn\n1738\nMaría Andresa published\nTyrocinio: arithmético, instrucción de las quatro reglas llanas\nⓉ\n(\nTyrocinio: arithmetic, instruction of the four plain rules.\n)\n. The first thing to note is that she was only seventeen years old at the time. The second thing to note is that this publication is the first science book published by a woman in Spain. She states on the title page that she is a \"disciple of the Escuela Pía\" and dedicates the\nTyrocinio\nⓉ\n(\nTyrocinio: arithmetic, instruction of the four plain rules.\n)\nto the same \"Escuela Pía del Colegio de Santo Tomás de Zaragoza\". One might ask how María Andresa can be a disciple of the Escuela Pía when their school only educated boys? Well, she does not admit to being a girl on the title page since the author of the book appears with a male name as Casandro Mamés de La Marca y Araioa. Those good at anagrams will see that in fact Casandro Mamés de La Marca y Araioa is simply an anagram of María Andresa Casamayor de La Coma. One can only assume that she would have wished to have been able to attend this school and so called herself a disciple.\nOn the following pages there is a Preface by the author and then an \"Approbation\" by Pedro Martinez, the rector and regent of the Colegio de San Vicente Ferrer de Zaragoza. This College was founded by the Dominican Jerónimo Xavierre in\n1584\n. The friars dedicated themselves mainly to prayer, teaching and study. The convent was later suppressed by the decrees of\n1835\n. The \"Censor\" of the book is Juan Francisco, the professor of Mathematics of the Colegio de Santo Tomás de Aquino de las Escuelas Pías de Zaragoza. He clearly knew the book was by María Andresa and he must have been one of those who encouraged her. He writes that texts of this type used to be longer, which increased their price, revealing the author's intentions: \"His purpose, in this Work, is only to facilitate this instruction to many, who cannot achieve it otherwise.\" It was necessary for anyone publishing such a book to have approval from Pedro Martinez and Juan Francisco.\nFrom the mathematical point of view, the book is written in easily understood and eminently practical language, with a large number of examples and actual case studies that allow the reader to learn directly how to handle the four rules of arithmetic: addition, subtraction, multiplication and division. It also shows the author to have a precise knowledge of the units of length, weight, currency, etc. used in Aragon, together with their equivalents in the surrounding regions; units that were handled daily in the eighteenth century world of commerce.\nUp to this point María Andresa Casamayor had been highly successful and looked to have a good future ahead of her supported by several influential men. Two of her most important supporters were her father Juan Joseph Casamayor and Pedro Martínez, the rector and regent of the Colegio de San Vicente Ferrer de Zaragoza. Within a year of the publication of the book, however, she had lost both, her father dying on\n14\nMarch\n1738\nand Pedro Martínez on\n14\nNovember of the following year. The Colegio de Santo Tomás de Aquino was named in homage to the patronage of Archbishop Tomás Crespo Agüero. He was someone who was very concerned about the education of women and he too was a supporter of Casamayor but he died on\n3\nMarch\n1742\n. The professor of Mathematics at the Colegio de Santo Tomás de Aquino de las Escuelas Pías de Zaragoza, Juan Francisco de Jesús, was the only one left to help Casamayor but soon he left Zaragoza and went to the College of the Piarists of Valencia. The death of her father had removed her financial support and a debt process for the family which began in\n1740\nended in\n1748\nwith the loss of all their houses.\nCasamayor did not marry or become a nun, the routes thought almost essential for a woman at this time. She therefore had to work so she became a teacher of girls. We know a little about her from the population census of\n1766\nwhich can be consulted in the Municipal Historical Archive of Zaragoza. It tells us that, in\n1766\n, Casamayor was living on her own in a house on the corner of what today is called Calle Viola. This short street runs from the Calle Dr Alejandro Palomar to the Plaza de San Agustín, in the La Magdalena area of the city. Remarkably, the house still exists today. In the\n1766\ncensus it was owned by Joseph Lasala, a royal scribe, and the entry states that living there is \"Andresa Casamayor, not paying.\" The Municipal Historical Archive of Zaragoza also contains a document listing the licences issued to teachers of girls which also gives the place where they taught. The first line in the list is \"Seminario Viejo. Maria Casamaior.\" Let us look briefly at where she was teaching, the Seminario Viejo or Old Seminary.\nWhen explaining how children were taught in Zaragoza at the time when Casamayor was growing up, we mentioned the Jesuit College of the Eternal Father. The Jesuits were suppressed in Portugal in\n1759\n, France in\n1764\nand then Spain in\n1767\n. The expulsion of the Jesuits meant that the buildings of the College of the Eternal Father became empty and another use was sought for them. The Jesuits had run a school there so it was natural for them to think of continuing to use at least part of the building as a school. The first floor was converted into a seminary and, for a few years, was known as the Seminario Viejo, the Old Seminary. This is where Casamayor taught.\nCasamayor wrote a second arithmetic text,\nEl Para Sí Solo\nⓉ\n(\nFor Himself Alone\n)\n, which was never published, remained a manuscript work but was eventually lost. This\n109\n-page book covered more advanced arithmetical material such as using tables and roots. As with her first book, Casamayor did not give her name as the author of this text, giving Casandro Mamés de la Marca y Araioa. How do we know about this book? The information comes from an\n1802\ntext\n[\n10\n]\n:-\nIt was confirmed by the bibliographer Félix de Latassa in his book 'New Library of Aragonese Authors'\n(1802)\n, which describes the author as a woman \"of particular ingenuity and wisdom in arithmetic.\" In that volume he also explained that there was a second work by Casamayor, 'El Para si solo', which was never published because the author died in\n1780\n. Nothing of this\n109\n-page manuscript is preserved.\nOn\n23\nOctober\n1780\n, after receiving the sacraments of the Last Rights, namely Penance, Viaticum and Extreme Unction, she died. Her body was buried in the cemetery of the Basilica of Our Lady of Pilar.\nHaving recounted the known facts about Casamayor, there remains the question that a quick look at the references will produce, namely that only in the last couple of years does anything seem to have been written about her. The reason is that she has only lately been \"rediscovered\" and it is worth quoting a translation of extracts for one of the references which explains how this has come about.\nMaría Pilar Perla Mateo writes in\n[\n8\n]\n:-\n\"I came across her while I was working on a special 'On the road to science' programme on the occasion of the \"Day of Women and Girls in Science,\" recalls Mirella Abrisqueta. In an article, she found four facts about Casamayor, enough to understand that \"she deserved a documentary, researching her and making her known. She was a woman, a scientist and an Aragonese: she had it all,\" she thought. And she picked up the phone to find someone who could advise and take care of the content, while Sintregua Comunicación was in charge of the production. On the other side was Pedro J Miana, a researcher at the University Institute of Mathematics and Applications\n(\nIUMA\n)\nof the University of Zaragoza, to whom \"the name sounded familiar, I had read something about her and I took it almost as a mathematical investigation, with that real fear, when you start looking you find nothing.\" But nothing could be further from reality, crucial data would be revealed and also unexpected elements. Drop by drop, and in parallel to the making of the documentary, the new information would sometimes bring relief and sometimes despair.\nTo begin with, \"I had a great concern: let's see if it turns out that she is not Aragonese!\" The director was concerned. It was \"a very reasonable doubt,\" says Miana. \"Her birth certificate did not appear and we doubted that she was Aragonese because her father was French and in those troubled times he could have temporarily fled Zaragoza just when she was born. It had to be verified.\" In the Historical Archive of Pilar there was proof that she was from Zaragoza: the annotation of her christening ...\nThat is why the most desired moment was to find Casamayor's baptism certificate. It was known that her parents had married in what was then called the Iglesia del Pilar and that some of her sisters were baptised there, so they went to the Pilar Historical Archive to consult the baptismal books, searching year after year, thinking that she had been born in the early part of the\n18\nth century. \"She was nowhere to be found.\" Then \"we realised that a sister of hers, Valeria, had been born on San Valero's day\", so they thought that if her name was Andrea - as it appeared in all the references until then -, she had to have been born on Saint Andrew's day. With the most precise aim, inquiries were centred around\n30\nNovember of each year, until the volume ended in\n1719\n. In the first year of the following,\n1720\n, there was the proof that she was from Zaragoza, the record of her baptism on\n1\nDecember.\nBut in that document there was something else: the discovery of her real name, María Andresa. Bernués returned to the anagram of 'Tyrocinio' and recomposed it, verifying that the letters of her name, shuffled to compose Casandro Mamés de la Marca and Arioa, only fit with Andresa. ... The baptism note found in the Historical Archive of Pilar confirms that she was born in Zaragoza on the day of Saint Andrew,\n30\nNovember, from whom she would take the name, and was baptised the following day,\n1\nDecember\n1720\n, as María Juana Rosa Andresa Casamayor de La Coma. She was the daughter of Juan Joseph Casamayor, a native of Oloron, and Juana Rosa de La Coma, of Zaragoza. ...\nAlong the way Miana has met a woman \"independent, fighter, intelligent, rebellious in her way.\" More adjectives are added in a cascade. For Miana she is \"a free woman, who does what she has to do, the universality of her values makes her very current and makes us agree and sympathise with her\". Bernués highlights \"her uniqueness for her time: she publishes a book, investigates mathematics, does not marry and lives off her work; she maintains her way of thinking, alone, all her life.\"\nThe discovery of these facts allowed celebrations to he held for the\n300\nth anniversary of her birth in\n2020\n. The documentary\nLa mujer que soñaba con números\nⓉ\n(\nThe woman who dreamed of numbers\n)\n, which had led to discovering the basic facts about her life, was screened in February\n2020\n. The\nTyrocinio arithmético\n, of which only one copy of the original publication is known to have survived, was republished in an edition edited by Pedro Miana and Julio Bernués. A Spanish stamp was issued on\n29\nJune\n2020\nto commemorate the\n300\nth anniversary of her birth\n[\n13\n]\n:-\nThe stamp, commemorating the birth of this incredible woman who was so ahead of her time, and with unusual interests, shows a blurred female image, a kind of mirage, as it was with her literary authorship most of the time. A hand tracing numbers with white chalk rounds off the design which seeks to highlight the work of the woman of science. Not just hers but of all those who reached great scientific milestones, who are reaching them and who, of course, will reach them.\nYou can see the stamp at\nTHIS LINK\n.\nA street in Zaragoza was named Grupo Andrea Casamayor by the Zaragoza City Council in the Las Fuentes area of the city. A street in the city of Gijón has also been named for her, Calle María Andrea Casamayor, appropriately around the Scientific Technology Centre. There is also a Colegio Andrea Casamayor near Madrid.\nIt may have taken\n300\nyears, but at last María Andresa Casamayor's achievements have been recognised.",
  "math_areas": [
    "Logic",
    "Number Theory"
  ]
}