{
  "nome_completo": "Marcel Paul Schützenberger",
  "nome_curto": "Marcel-Paul Schützenberger",
  "ano_nascimento": "1920",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schutzenberger/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Marcel-Paul Schützenberger\nwas known as Marco to his friends and often published papers as Marco Schützenberger. His family were originally from Alsace but moved to Paris around the time of the Franco-Prussian war of\n1870\n-\n71\n. Since this was\n50\nyears before Schützenberger was born it might not seem worth mentioning, but Schützenberger himself was always very aware of his Alsatian origins. One of his ancestors was the famous chemist Paul Schützenberger who worked at the Collège de France in Paris and discovered the acetylation of cellulose by acetic anhydride in\n1865\n.\nMarco Schützenberger was interested in both mathematics and medicine from a young age. He studied at the Faculty of Medicine in Paris during World War II but he was also undertaking research in mathematics and published\nSur la théorie des structures de Dedekind\nⓉ\n(\nOn the theory of Dedekind structures\n)\nin\n1943\nwhich studied properties of complemented Dedekind structures. In this paper he introduced the concept of a lower generating element as one having a single predecessor. Upper generating elements are defined in an analogous way. Another paper on the same topic\nSur les structures de Dedekind\nⓉ\n(\nOn Dedekind structures\n)\n(1944)\nproved that in any finite Dedekind structure the number of upper generating elements equals the number of lower generating elements. Of course studying in Paris in the early\n1940\nduring the German occupation was a difficult time for anyone and Schützenberger was no exception.\nAfter the French defeat by Germany Marshal Philippe Pétain led a government working with the German invaders. General Charles de Gaulle, who was by then based in London, set up the Forces Françaises Libres, or Free French Forces. A small organisation at first, de Gaulle tried to bring all the anti-Nazi Resistance into it and changed its name to Forces Françaises Combattantes\n(\nFighting French Forces\n)\nin\n1943\n. Schützenberger joined the Forces Françaises Combattantes in September\n1943\nand he served in the organisation until August\n1944\nwhen they drove the Germans from Paris and de Gaulle entered the city in triumph. After this Schützenberger resumed his studies at the Faculty of Medicine. He received the degree of Doctor in Medicine in\n1948\n.\nSchützenberger continued his interest in mathematics and published seven papers in\n1947\n. As well as papers on lattices and\nAxiomatisation de la géométrie dans un complexe linéaire de droites\nⓉ\n(\nAxiomatization of geometry in a complex of straight lines\n)\nin which he gives a framework for the axiomatic treatment of linear complexes, Schützenberger wrote on statistics. His\n1947\npapers on that topic include\nSur certains paramètres caractéristiques des systèmes d'événements compatibles et dépendants et leur application au calcul des cumulants de la répétition\nⓉ\n(\nOn some characteristic parameters  of dependent and compatible systems of events and their application to the calculation of expectation of repetition\n)\nand\nRemarques sur des relations d'ordre entre variables aléatoires indépendantes\nⓉ\n(\nNotes on the order relations between random variables\n)\n. In this latter paper he gives abstract definitions of several types of order postulates applicable to chance variables.\nAfter becoming Doctor in Medicine, he was employed at the National Institute of Hygiene for five years between\n1948\nand\n1953\n. There he worked on genetic problems, in particular being one of the team of researchers who discovered trisomy, where three copies of a chromosome instead of two are inherited. He pioneered a wide variety of statistical method in medical research and, during these years, he published on statistics, medical topics, and mathematics\n(\nin particular on lattices and combinatorial structures\n)\n. By\n1953\nhe had published\n40\npapers, averaging over five papers per year from\n1947\nto\n1953\n. In\n1953\nhe was awarded a doctorate in mathematics for his work on the mathematical theory of communications, developing ideas that Shannon had presented in his famous\n1948\npaper\nA Mathematical Theory of Communication\n. From\n1953\nSchützenberger worked for three years as a researcher at the Centre Nationale de la Recherche Scientifique. There he continued his research on communications and combinatorics, but from this time he became more involved in studying semigroups, automata and codes.\nAn invitation took him to the Research Laboratory of Electronics at the Massachusetts Institute of Technology in\n1956\nto spend a year as part of Shannon's research team. This was arranged to coincide with the year\n1956\n-\n57\nwhich Shannon spent as a visiting professor at M.I.T. Schützenberger returned to France to take up an appointment as Professor in the Faculty of Sciences in Poitiers. This position meant that he taught statistics but his research covered a wide range of topics from semigroups, automata and codes. He remained on the staff at Poitiers until\n1963\nbut spent the year\n1961\n-\n62\nas a Lecturer in the Faculty of Medicine at Harvard University. He returned to the Centre Nationale de la Recherche Scientifique for the year\n1963\n-\n64\nwhen he was Director of Research, then was appointed as Professor in the Faculty of Sciences at the Sorbonne. He held this chair until\n1970\nwhen he was appointed as Professor in the Faculty of Sciences at the University of Paris VII where he remained until his death.\nThe range of Schützenberger's contributions is so vast that it is almost impossible to do them justice in a biography of this type - his list of publications numbers over\n250\n. Let us quote from some tributes to him made after his death in\n1996\n. Herbert Wilf writes about his contributions to combinatorics and theoretical computer science:-\nHis contributions to combinatorics are wide ranging and of the first magnitude. In the theory of Young tableaux he discovered the jeu de taquin that became the basis for so many later investigations; he illuminated the Schensted correspondence between pairs of permutations and tableaux by revealing many facets of its fine structure; he created the subject of context-free languages and explored some of its many consequences, as well as finding many results in the theory of combinatorial words and languages of other kinds; with Foata he developed a general theory of counting families of unlabeled combinatoral objects by factoring them into primes, etc. His work has found important and numerous applications. For example his theory of formal languages has spawned many fine successes in the enumeration of various kinds of polyominoes and cellular structures and his work on factorisation of families of unlabeled objects has been responsible for methods of selecting such objects at random.\nHis contributions to semigroups is summarised in\n[\n1\n]\n:-\nAmong the many algebraic structures that appear in Schützenberger's works a dominant one is the structure of semigroups. Semigroups appear in his works essentially in two forms:\n1)\nas free monoids, for example in coding and language theories and often in combinatorial designs;\n2)\nas finite semigroups, for example in transition semigroups of automata or in the theory of pseudo-cvarieties for the study of varieties of languages. ... Schützenberger's works contributed strongly to giving semigroup theory its letters of nobility by taking it out of its self-contemplation and putting it at work in areas of mainstream mathematics.\nA fundamental tool in the study of finite semigroups is\nGreen\n's relations and their corresponding classes. It was in this area that Schützenberger introduced what have been called Schützenberger groups and Schützenberger representations by\nClifford\nand\nPreston\nin their influential book\nThe Algebraic Theory of Semigroups\n(1961)\n.\nDominique Perrin writes:-\nHe found there an incredible interplay between algebra through the use of finite semigroups,\nprobability theory\nand combinatorics. Many of his favourite subjects were put together. Later he published a series of results on variable-length codes all of them reported in our book with Jean Berstel\n(\nTheory of Codes, Academic Press,\n1984)\n.\nOne topic which we have not mention so far is one which Schützenberger held very strong views - the theory of evolution. A short quote from\n[\n3\n]\nin given at\nTHIS LINK\n:\nSchützenberger on Darwinism\n.\nLet us look at Schützenberger's character as described by those who knew him best. Herbert Wilf writes:-\nHe was possessed of a lively curiosity, a brilliant mind, a passion for all kinds of mathematics and for substantive intellectual achievement of all sorts, a low tolerance for poseurs and fools, a warm and vibrantly supportive personality as regards his interaction with young people of promise, a deep affection for the human race despite its numerous foibles, and a personal charm, grace and good humour that was totally captivating.\nDominique Foata writes:-\nHis discourse was full of unexpected images and paradoxes; he never had a banal view on any subject, but always developed a well-structured and original reasoning in which plenty of new ideas flourished naturally. He undeniably was a great master of the Word. A conversation with him was an enrichment in which all kinds of subjects would be discussed: Mathematics, Physics, Biology, Philosophy, Political Science, ... , or simply l'air du temps.\nLallement and Perrin write\n[\n1\n]\n:-\nHis was a complex and unorthodox personality. He was witty, humorous, had a passion for discussion, if not controversy, an immoderate love for paradoxes and was capable of the most laudatory praise as well as the most ironic sarcasm. His lectures, reflecting his personality, were often difficult to follow. Many of his listeners would after a lecture ask themselves \"What does he see that I cannot see yet?\" To some, this was strong motivation to find out and be awed by what there was to be seen.\nSchützenberger married Hariati and they had two children, a daughter Hélène  and a son Mahar. However, there was a great tragedy in his life. Mahar was killed in a car accident in\n1980\nat the age of twenty-three. Hariati died in\n1993\n, three years before Schützenberger.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Statistics"
  ]
}