{
  "nome_completo": "Marcel Riesz",
  "nome_curto": "Marcel Riesz",
  "ano_nascimento": "1886",
  "ano_morte": "1969",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Riesz_Marcel/",
  "lugar_nascimento": "Györ, Hungary",
  "lugar_morte": "Lund, Sweden",
  "biografia": "Marcel Riesz\n's father, Ignácz Riesz, was a medical man. Marcel was the younger brother of\nFrigyes Riesz\n. He was brought up in the problem solving environment of Hungarian mathematics teaching which proved so successful in creating a whole generation of world-class mathematicians. He excelled in this environment and won the\nLoránd Eötvös\ncompetition in\n1904\n. He studied at Budapest University and, influenced by\nFéjér\n, undertook research on problems from the theory of series. Riesz wrote his doctoral thesis\nSummierbare trigonometrische Reihen und Potenzreihen\nⓉ\n(\nSummable trigonometric series and power series\n)\nin\n1907\nand presented it to the University of Budapest; it was published in the following year. In it he gave the correct generalisation of\nCantor\n's uniqueness theorem for convergent trigonometric series to trigonometric series summable by the\nCesàro\nmethod. His doctoral thesis was written in Hungarian, but he extended the results further before publishing the main ones in a paper\nÜber summierbare trigonometrische Reihen\nⓉ\n(\nOn summable trigonometric series\n)\nwritten in German in\n1911\n. Perhaps we should add at this point that after writing a few early papers in Hungarian, and one later paper in Swedish, all his papers are written in French or German until the latter part of his career when he wrote in English.\nInvited by\nMittag-Leffler\nto Sweden in\n1908\n, he spent the whole of his life there up to his retirement. Appointed to Stockholm in\n1911\nhe had a number of outstanding doctoral students including Olof Thorin,\nHarald Cramér\n, Franz Berwald, and\nEinar Hille\n. In\n1923\nhe applied for a chair at Lund but was unsuccessful as\nCarleman\nwas appointed to fill the chair.\nVon Koch\n, who was the professor at Stockholm, died in March\n1924\nand several mathematicians, including\nIvar Bendixson\nand\nIvar Fredholm\n, supported Riesz to fill the vacancy. However, again he lost out to\nCarleman\nbut in\n1926\nRiesz was appointed to a chair at Lund\n[\n6\n]\n:-\nLund did not have much of a mathematical tradition but Riesz's arrival meant a change of atmosphere. He was now an international star, active with his own research and he also had the time and incentive to broaden his interests.\nAmong his doctoral students at Lund, we mention Otto Frostman and\nLars Hörmander\n.\nMarcel Riesz's interests ranged from\nfunctional analysis\nto\npartial differential equations\n, mathematical physics,\nnumber theory\nand algebra. Later in his career he also worked on\nClifford\nalgebras and spinors. The first period of his work, from the beginning of his doctoral research up to around the beginning of World War I, concentrated on the theory of series, in particular the summability theory of power series, trigonometric series and\nDirichlet\nseries. In\n1914\nhe gave an interpolation formula for trigonometric polynomials. This was an important discovery and the formula now appears in most texts on interpolation. It leads to quick proofs of\nBernstein\n's inequality and\nMarkov\n's inequality. Another highlight from this period is his beautiful proof of\nFatou\n's theorem which give conditions under which the power series of an analytic function converges to a point on its circle of convergence.\nIn a joint work with\nHardy\nThe general theory of Dirichlet's series\n, published by\nCambridge University Press\nin\n1915\n, he introduced Riesz means. He has only one joint paper with his brother, but it is an important contribution written during World War I and published in\n1920\n, on the boundary behaviour of an analytic function. W H J Fuchs, reviewing\n[\n2\n]\n, writes about how Riesz's interests developed through the\n1920\ns:-\nTo the consummate skill in handling formulas which is typical of the classical Hungarian school he now added a more abstract, functional analytic view, long before functional analysis had become a commonplace tool.\nRiesz broadened his range of interests during the\n1930\nwhen he became interested in potential theory and in partial differential equations. He was motivated by wave propagation and in particular\nDirac\n's relativistic equation for the electron. In\n1949\n, Riesz published a\n223\npage paper\nL'intégrale de Riemann-Liouville et le problème de Cauchy\nⓉ\n(\nThe integral of Riemann-Liouville and the Cauchy problem\n)\nin which he introduced a multiple integral of\nRiemann\n-\nLiouville\ntype and showed how important this idea is in the theory of the wave equation.\nFeller\nwrites that the paper:-\n... contains an account of all results previously published without detailed proofs. Formally, therefore, we have a research paper. However, the paper is written in the style of a book. All details are given and, where desirable, passages of previously published papers are reproduced. The author takes care to compare his method with others and to point out the details which make the mechanism work. The paper is self-contained and should be accessible also to non-experts.\nIn\nProblems related to characteristic surfaces\nRiesz extended these ideas to obtain the solution of the wave equation for a very general class of characteristic boundaries.\nWe noted above that Riesz was interested in number theory but as yet have given no examples of his work in this area. Let us fill this gap by mentioning\nSur le lemme de Zolotareff et sur la loi de réciprocité des restes quadratiques\nⓉ\n(\nOn the lemma of Zolotareff and the reciprocity law for quadratic residues\n)\n(1953)\nwhich bring a comment from\nDerrick Lehmer\n:-\nThe whole presentation is very elegant.\nW H J Fuchs, reviewing\n[\n2\n]\n, writes:-\nM Riesz was a perfectionist and a gentleman. He spent endless trouble on giving his presentation a high polish and he worked as hard on improving the proofs of known theorems as on the finding of new ones. The final publication of his results often took place many years after their first announcements. His masterful exposition makes his papers a joy to read. His work covered a wide area of analysis and just an enumeration would be too long for a review.\nGarding, in\n[\n6\n]\n, writes from personal experience of Riesz from his time as a student in Lund:-\nHe then had a small circle of graduate students. Each one got personal attention. Riesz loved to talk about mathematics and he appreciated having listeners. He could go on for hours and when he was in good form, his grip on the listener never slackened. Riesz lived alone and these personal lectures took place sometimes in his home, sometimes in his favourite café and sometimes over the telephone. ... He worked constantly, often at late hours and periodically with great intensity. These habits did not change much with advancing age ...\nRiesz retired in\n1952\nand went to the United States. He spent ten years in several different universities such as Maryland and Chicago. He gave an important series of lectures\nClifford numbers and spinors\nat the University of Maryland between October\n1957\nand January\n1958\n. The first four of six intended chapters was published in\n1958\nbut, despite the title, these published notes do not reach spinors. In\n1993\na facsimile reproduction of Riesz's notes from these lectures was published. D Lambert writes:-\nThe seminal material which contributed greatly to the start of modern research on\nClifford\nalgebras is supplemented by notes which Riesz dictated to Folke Bolinder in the following year and which were intended to be a fifth chapter of the Riesz lecture notes.\nAfter spending ten years in the United States during which time he continued to work for many hours a day, Riesz suffered a breakdown in\n1962\nand returned to Lund. He continued to work after this but at nothing like the intensity that had typified his whole life up to that point. During the final seven years of his life his health deteriorated steadily and he\n[\n6\n]\n:-\n... bore the burden of his last illness with great courage.\nAmong the many honours Riesz received, let us mention his election to the\nSwedish Academy of Sciences\n, the Physiographical Society in Lund, and the Videnska Selskab in Copenhagen. He was awarded honorary degrees from the universities of Copenhagen and Lund and an honorary membership of the\nSwedish Mathematical Society\n.",
  "math_areas": [
    "Analysis",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}