{
  "nome_completo": "Marcel Grossmann",
  "nome_curto": "Marcel Grossmann",
  "ano_nascimento": "1878",
  "ano_morte": "1936",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grossmann/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Marcel Grossmann\n's parents were Jules Grossmann and Katharina Henriette Lichtenhahn. Marcel had a brother named Eugen. Jules Grossmann was Swiss but came from a family originally from Alsace. In\n1870\n, he founded a factory in Budapest where he was known by the Hungarian version of his name, Grossmann Gyula. The factory, founded jointly with someone of the name of Rauschenbach, was situated close to the present Lehel Square in Budapest and manufactured agricultural machinery. Jules Grossmann was the joint owner of this successful factory. Marcel was brought up in Budapest where he attended the Dániel Berzsenyi\nGymnasium\n. This famous high school had an excellent educational reputation and gave Grossmann an excellent background in mathematics.\nIn\n1893\n, when Marcel was fifteen years old, his family moved to Switzerland and settled in Basel. There he attended the Oberrealschule from\n1893\nto\n1896\n. After completing his high school education in Basel, Grossmann entered the Zürich Polytechnikum\n(\nlater named the Eidgenössische Technische Hochschule\n)\nto study mathematics with the aim of qualifying as a Gymnasium teacher of mathematics. Two of Grossmann's ten fellow students were Mileva Maric and\nAlbert Einstein\n. All three became close friends and\nEinstein\n, who did not attend many lectures, borrowed Grossmann's lecture notes in order to take his examinations in\n1898\n. This was a good choice by\nEinstein\n, for Grossmann took careful notes - in fact these notes by Grossmann have survived so their quality can be seen today. In the final diploma examinations taken by six candidates in\n1900\nboth Grossmann and\nEinstein\nwere awarded diplomas while Mileva Maric failed. Certainly by this time Mileva and\nEinstein\nwere deeply in love.\nIn\n1900\nGrossmann became an assistant to the geometer\nOtto Wilhelm Fiedler\nin Zürich.\nFiedler\n, a student of\nAugust Möbius\n, had been professor of geometry at the Polytechnic Institute of Prague before taking up a similar position at the Polytechnikum at Zürich. He had taught geometry to Grossmann,\nEinstein\nand Maric during their undergraduate studies and it was Grossmann who had excelled in the examinations of the geometry course. Grossmann was advised by\nFiedler\nas he undertook research towards his doctorate which he obtained from Zürich Polytechnikum in\n1902\nfor his thesis\nÜber die metrischen Eigenschaften kollinearer Gebilde\nⓉ\n(\nOn the metric properties of collinear structures\n)\n. Before the award of his doctorate, he became a teacher in a school in Frauenfeld, northern Switzerland, in\n1901\n, moving to take up a similar position in Basel in\n1905\n.\nAfter\nEinstein\nand Grossmann graduated in\n1900\nthey continued their friendship.\nEinstein\nwas looking for position and Grossmann wrote to him on\n13\nApril\n1901\ntelling him that his father, who was a friend of the Director of the Patent Office in Bern, had recommended\nEinstein\nfor the next vacancy.\nEinstein\nwas delighted to have Grossmann's support and replied in a letter written on the same day:-\nDear Marcel!  When I found your letter yesterday, I was deeply moved by your devotion and compassion which did not let you forget your old luckless friend ... I would be delighted to get such a nice sphere of activity and I would spare no effort to live up to your recommendation.  I came here to my parents three weeks ago in order to search from here for an assistant's position at a university.  I could have found one long ago had\nHeinrich Weber\nnot played a dishonest game with me. All the same, I leave no stone unturned and do not give up my sense of humour ...\nGrossmann married Anna Keller, the daughter of the engineer Eduard Keller, in\n1903\n. He had continued to undertake research in geometry and he published\nDie fundamentalen Konstruktionen der nichteuklidischen Geometrie\nⓉ\n(\nThe fundamental structures of the non-Euclidean geometry\n)\nin Frauenfeld in\n1904\n. In the following year he left school teaching when appointed as a\ndozent\nat the University of Basel.\nEinstein\ncertainly did not forget about his friend and when he wrote his thesis in\n1905\nhe wrote on the title page: \"Dedicated to my friend Dr Marcel Grossmann\". In\n1907\nGrossmann became professor of descriptive geometry at the Eidgenössische Technische Hochschule in Zürich.\nIn August\n1912\n,\nEinstein\narrived back at the Eidgenössische Technische Hochschule in Zürich having been appointed to the chair of theoretical physics. He was struggling to extend his special theory of relativity to include gravitation and immediately began collaborating with his old friend Grossmann. It was Grossmann who pointed out to him the relevance to general relativity of the\ntensor calculus\nwhich had been proposed by\nElwin Bruno Christoffel\nin\n1864\n, and developed by\nGregorio Ricci-Curbastro\nand\nTullio Levi-Civita\naround\n1901\n.\nEinstein\n, who previously had played down the importance of mathematics, was quickly convinced by Grossmann's expert explanations.\nEinstein\nwrote to\nArnold Sommerfeld\non\n29\nOctober\n1912\n:-\nI am now working exclusively on the gravitation problem and believe that I can overcome all difficulties with the help of a mathematician friend of mine here\n[\nMarcel Grossmann\n]\n. But one thing is certain: never before in my life have I toiled any where near as much, and I have gained enormous respect for mathematics, whose more subtle parts I considered until now, in my ignorance, as pure luxury. Compared with this problem, the original theory of relativity is child's play.\nThe collaboration between Grossmann and\nEinstein\nled to the first paper on the general theory of relativity in\n1913\n. It was\nEntwurf einer verallgemeinerten Relativitätsheorie und einer Theorie der Gravitation\nⓉ\n(\nDraft of generalized Relativity theory and a theory of gravitation\n)\npublished in the\nZeitschrift für Mathematik und Physik\n. In one sense it is a joint paper but in another sense it consists of two separate papers, the first\n22\npages being 'Physikalischer Teil' by\nEinstein\nand the next\n16\npages being 'Mathematischer Teil' written by Grossmann. Also in\n1913\nGrossmann published\nMathematische Begriffsbildungen zur Gravitationstheorie\nⓉ\n(\nMathematical trends in gravitational theory\n)\n. He continued to collaborate with\nEinstein\nand they published another joint paper in\n1914\n, namely\nKovarianzeigenschaften der Feldgleichungen\nⓉ\n(\nCovariance of the field equations\n)\n. Other publications by Grossmann that we should mention are the textbooks\nDarstellende Geometrie\nⓉ\n(\nDescriptive geometry\n)\n(\nseven editions between\n1915\nand\n1932)\n,\nDarstellende Geometrie für Maschineningenieure\nⓉ\n(\nDescriptive geometry for mechanical engineers\n)\n(\nthree editions between\n1915\nand\n1927)\n,\nElemente der darstellenden Geometrie\nⓉ\n(\nElements of descriptive geometry\n)\n(1917)\n, and\nEinführung in die darstellende Geometrie\nⓉ\n(\nIntroduction to descriptive geometry\n)\n(1917)\n.\nIn\n1910\n, Grossmann co-founded the\nSwiss Mathematical Society\nalong with\nRudolf Fueter\n, professor of mathematics at the University of Basel, and Henri Fehr\n(1870\n-\n1954)\n, professor for algebra and higher geometry at the University of Geneva.\nFueter\nwas the first president\n(1910\n-\n12)\n, Fehr the second president\n(1913\n-\n15)\nand Grossmann the third president\n(1916\n-\n17)\n. Grossmann's time as president was a particularly significant one since the First World War\n(1914\n-\n18)\n, which saw France and Germany at war with each other, caused high tension between the German speaking part of Switzerland and the French speaking part. It was in large part due to Grossmann that the Society maintained a Switzerland-wide perspective in spite of the tension. The\nSwiss Mathematical Society\nwas not the only society that Grossmann co-founded. He was also a co-founder of the Neue Helvetische Gesellschaft in\n1914\n, shortly before the outbreak of World War I. This Society saw itself as a successor of the Helvetic Society, which had contributed from\n1761\nto\n1858\nto strengthen the Confederation and the formation of the Swiss Federal State, with its New Federal Constitution, in\n1848\n. Grossmann, and the other founders, realised that differences of opinion between different parts of Switzerland threatened the internal peace of the country and wanted to create a new Helvetic Society to preserve Swiss unity. In addition to founding these important Societies, Grossmann was a co-founder and editor of the newspaper\nNeuen Schweizer Zeitung\n.\nFinally we should mention the honour given to Marcel Grossmann by naming the series of conferences, the Marcel Grossmann Meetings\n(\non Recent Developments in Theoretical and Experimental General Relativity, Gravitation, and Relativistic Field Theories\n)\n. These conferences, begun in\n1975\n, are international meetings held every three years, which provide opportunities for discussing recent advances in gravitation, general relativity and relativistic field theories. They emphasise mathematical foundations, physical predictions and experimental tests.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}