{
  "nome_completo": "Marian Smoluchowski",
  "nome_curto": "Marian Smoluchowski",
  "ano_nascimento": "1872",
  "ano_morte": "1917",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smoluchowski/",
  "lugar_nascimento": "Vorderbrühl, near Vienna, Austria",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Marian Smoluchowski\n's parents were Wilhelm Smoluchowski and Teofila Szczepanowska. Wilhelm and Teofila had five children, three boys and two girls. However one son died in the same year that he was born and one daughter died at about five years of age. Marian had a brother Tadeusz who was four years older and was a significant influence on him as he grew up. Marian's father Wilhelm had trained as a lawyer then worked in the Imperial Office as a high ranking member of Franz Joseph's privy council. He\n[\n7\n]\n:-\n... was a stern but very loving man who observed rigorously rules, traditions and titles, including his own.\nMarian's mother Teofila was much younger than his father. She was\n[\n7\n]\n:-\n... a cultured and deeply musical person whose Polish traditions made a strong impression on her son. It was through her influence that Smoluchowski became, like his mother, an expert pianist ...\nIn addition to his parents, an important influence on Marian as he grew up was Benigna Wolska, his mother's sister, who lived in a hill top suburb of Florence. Marian spent several week there every year throughout his childhood and enjoyed Benigna's home which was always filled with music. Benigna was both a fine pianist and singer who often held concerts in her home.\nMarian attended the Collegium Theresianum in Vienna between\n1880\nand\n1890\n. This was a very good school which was specifically intended for the children of high ranking officials like his father. At this school Marian was at first attracted by the humanities and it was not until late in his school education that he became fascinated by physics and astronomy. This change in direction came about as a result of outstanding teaching by Alois Höfler, a physics and philosophy teacher at the school. He formed friendships with Fritz Hassenöhrl and Kazimierz Twardowski, two of his fellow students at the school, which lasted throughout his life. One of Smoluchowski's life long passions was climbing and he was introduced to this while still at school by his brother Tadeusz\n[\n7\n]\n:-\n... the two brothers soon became known as a pair of expert alpinists.\nWith Fritz Hassenöhrl, Smoluchowski not only shared a love of physics\n(\nHassenöhrl also became a physics professor\n)\nbut also a love of climbing and a love of music.\nIn\n1890\nSmoluchowski graduated from the Collegium Theresianum, being awarded his certificate with distinction, and entered the University of Vienna to study physics. There he was taught by\nJosef Stefan\n, who was nearing the end of his career,\nEmil Weyr\nand Franz Exner. He published his first paper on the internal damping of liquids in\n1893\nand was awarded his doctorate\n(\nwith the highest distinction\n)\nin\n1895\nfor his thesis\nAcoustical studies of elasticity of soft materials\n. An important influence on Smoluchowski was\nBoltzmann\nwho moved back to Vienna in\n1894\nto the chair of theoretical physics which became vacant on the death of his teacher\nJosef Stefan\n. We should note here that during\n1894\n-\n95\nSmoluchowski had to spend time doing military service.\nSmoluchowski spent the two years studying abroad following the award of his doctorate. From November\n1895\nto July\n1896\nhe undertook research on heat radiation in Paris at the laboratory of Gabriel Lippman at the Sorbonne. He spent the summer of\n1896\nin England, at Eastbourne and London then, from September\n1896\nto April\n1897\n, he was in Glasgow undertaking research on X-rays and uranium radiation in the laboratory of\nWilliam Thomson\n(\nLord Kelvin\n)\n. Leaving Glasgow, Smoluchowski then spent four months undertaking research in Berlin at the laboratory of Emil Warburg where he discovered the temperature discontinuity in rarefied gases. In\n1898\nhe became a\nprivatdozent\nat the University of Vienna but a year later he accepted a position as a privatdozent at the University of Lemberg in what is now knownn as Lviv. Promoted to extraordinary professor there in\n1900\n, he married Zofia Baraniecka on\n1\nJune\n1901\n. They had two children, a daughter Aldona, born in\n1902\n, and a son Roman born in\n1910\n. Smoluchowski was promoted to full professor of physics at Lviv in\n1903\n. He taught a variety of courses: potential theory, mechanics, electricity, optics, thermodynamics, kinetic theory of gases, differential equations, and mathematical physics.\nAfter spending the winter semester of\n1905\n-\n06\nat the Cavendish Laboratory in Cambridge, England, Smoluchowski was elected dean of the Faculty of Philosophy at Lviv, a post he held during the academic year\n1906\n-\n07\n. He returned to Cambridge in\n1912\nwhen he was invited to lecture at the International Congress of Mathematicians held from\n22\nAugust to\n28\nAugust. In the following year he was appointed to the chair of experimental physics at the Jagellonian University of Kraków. The outbreak of World War I in\n1914\nseverely disrupted his work\n[\n7\n]\n:-\n... there was a food shortage and in the late summer of\n1914\nhe and his family ... had to travel across the Carpathian mountains in a horse drawn carriage into Hungary and thence by train to Vienna. As an Austrian reserve officer he was drafted and put in command of an artillery detachment which guarded an important railway bridge between Vienna and Kraków. One of his tasks at this time was to censor all mail written by his soldiers and he was deeply moved by the family problems and human misery that the letters revealed. Within a few months he was permitted to return to Vienna where he was received enthusiastically at the university. In spite of this in a year or so he returned to Kraków and continued his work.\nSeveral universities attempted to entice him to leave Kraków. Both Warsaw and Vienna made moves but he remained in Kraków. To show their appreciation, the Jagellonian University of Kraków elected him rector in\n1917\nbut he was never able to take up his duties. He contracted dysentery during an epidemic in the summer of\n1917\nwhich led to his death at the age of\n45\n. He had already served as Dean of the Faculty of Philosophy at Jagellonian University during\n1916\n-\n17\n.\nSmoluchowski made many contributions to physics and mathematics, particularly to the theory of\nBrownian motion\n, stochastic processes and related problems, of which the most important are the 'Smoluchowski equations' bearing his name. At Lviv he found the theoretical explanation of Brownian motion, the piece of work for which today he is best known.\nEinstein\nindependently proposed a theory of Brownian motions at roughly the same time. This theory marks the start of the study of stochastic processes in mathematics. In\n1908\nhe proposed his theory of critical opalescence which explains the fluctuations in the refractive index of a fluid, liquid or gas. Smoluchowski devoted his life to his scientific work making a very deliberate decision. He wrote in a letter in\n1915\n:-\nI renounced a long time ago all kind of social, political and national activities. It was just after graduation when I decided, that science would be a leading star of my life. This is the basic rule of my life, to which I will be faithful and which is above any other aspect of my life.\nSmoluchowski received many honours both for his scientific achievements and as an alpinist. Of course dying at the age of\n45\nmeant that he would have received a much longer list of honours had he lived a full life span. He was awarded an honorary doctorate by the University of Glasgow in\n1901\n, awarded the Haitnger's prize of the Vienna Academy of Sciences for his theoretical explanation of Brownian motion in\n1908\n, was Wolfskehl Foundation lecturer at Göttingen in\n1913\nand again in\n1916\n, and was awarded the Silber Edelweiss by the German and Austrian Alpine Society in\n1916\n. He was elected a Corresponding member of the Academy of Sciences and Letters in Kraków in\n1908\n, becoming a full member in\n1917\n. He was also a member of the\nCopernicus\nSociety of Natural Scientists in Lviv, being a member of the board for twelve years from\n1900\n, and President of the Society in\n1906\n-\n08\n.\nFinally let us quote from Smoluchowski himself regarding his interest in climbing. He wrote to his alpine club:-\nThere are three most valuable things which I get from the mountains:\n1\n. get used to undertaking difficult tasks,\n2\n. get happiness from overcoming the challenges,\n3\n. They embellish my everyday life with the loftiest poetry: the poetry of the world of mountains.",
  "math_areas": []
}