{
  "nome_completo": "Marian Adam Rejewski",
  "nome_curto": "Marian Rejewski",
  "ano_nascimento": "1905",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rejewski/",
  "lugar_nascimento": "Bromberg, Prussian partition of Poland (now Bydgoszcz, Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Marian Rejewski\n's parents were Józef Rejewski, who was a cigar merchant, and Matylda Thoms. The town of Bydgoszcz, where Rejewski was born and brought up, was in the Prussian partition of Poland and was also known by the German name Bromberg. It was at a German speaking\nGymnasium\nin Bydgoszcz, the Königliches Gymnasium of Bromberg, that Rejewski was educated. He graduated in\n1923\nand entered the Adam Mickiewicz University of Poznań to study mathematics.\nAfter Rejewski graduated with his first degree in mathematics, he remained at Poznań University to study for his Master's degree. He was awarded that degree on\n1\nMarch\n1929\nfor his thesis\nTheory of double periodic functions of the second and third kind and its applications\n. He then went to Göttingen University in Germany to enrol in a two-year actuarial statistics course. However, he did not complete the course for, in the summer of\n1930\nwhen he had returned home for a break in his studies, he was offered a position as a teaching assistant in mathematics at Poznań University. He accepted the offer and began teaching there.\nNow before going to Göttingen, Rejewski had attended a cryptology course which was put on by the Cipher Bureau for the best German speaking mathematics students. Among other teachers in these classes were\n[\n28\n]\nSierpiński\nand\nMazurkiewicz\n. After he accepted the teaching position at Poznań University he began to work part-time for the Poznań Branch of the Cipher Bureau. They were interested in decoding intercepted German radio transmissions which were broadcast using a new cipher system. These messages were coded by an Enigma machine, but at this time even this fact was not known to the Poles. However, the Poznań Branch of the Cipher Bureau was disbanded in the summer of\n1932\nand, on\n1\nSeptember\n1932\n, Rejewski began to work full-time at the Cipher Bureau in Warsaw. There he was joined by another two young Polish mathematicians,\nJerzy Rozycki\nand\nHenryk Zygalski\n.\nThe team had a commercial Enigma machine which Rejewski was able to study, but it was clear that the messages were being sent by military style Enigma machines which were modified versions of the commercial type. Rejewski explained in\n[\n23\n]\nhow he broke the codes. His introduction to the paper gives an overview\n(\nwe've made a few changes to the English\n)\n:-\nCryptology, that is the science of ciphers, has from the very beginning applied some mathematical methods, mainly the elements of\nprobability theory\nand statistics. Mechanical and electromechanical ciphering devices, introduced to practise in the\n1920\ns, broadened considerably the field of applications of mathematics in cryptology. This is particularly true of the theory of permutations, known for over a hundred years, called formerly the theory of substitutions. Its application by Polish cryptologists in the years\n1932\n-\n33\n, enabled the German Enigma cipher to be broken, which subsequently exerted a considerable influence on the course of the\n1939\n-\n1945\nwar operation in the European and African, as well as the Far East, war theatres. The present paper is intended to show, necessarily in great brevity and simplification, some aspects of the Enigma cipher breaking, in particular those which used the theory of permutations. This paper is not a systematic outline of the process of breaking the Enigma cipher, but presents, however, its important part.\nOn\n20\nJune\n1934\nRejewski married Irena Maria Lewandowska; they had two children, Andrzej born in\n1936\nand Janina born in\n1939\n. During this time, he continued to work at the Cipher Bureau in Warsaw. Although the methods devised by Rejewski allowed many messages encoded by the Enigma machine to be read, in September\n1936\nthe Germans changed the coding procedure to introduce a more secure system. Again Rejewski, with assistance from\nRozycki\nand\nZygalski\n, was able to make good progress with the greater complexity which had been introduced, and by January\n1938\nthey were able to read about three-quarters of the Enigma messages which were passed to them for decoding. However, the Germans added further complexities to the Enigma machine in December\n1938\n, and again the Poles worked on breaking the codes. Rejewski was able to pass his knowledge of decoding the Enigma messages to the British and French at a meeting which took place in July\n1939\nat Pyry to the south of Warsaw.\nAfter the Germany army invaded Poland on\n1\nSeptember\n1939\n, it advanced rapidly towards Warsaw. Rejewski, along with others who had worked at the Cipher Bureau in Warsaw, was evacuated to Romania\n(\nalthough his wife and family remained in Poland\n)\nbefore the German troops reached Warsaw. Rejewski,\nRozycki\nand\nZygalski\nmanaged to avoid being forced into a refugee camp and they reached Bucharest where, after an unsuccessful attempt to get help from the British embassy, they made contact with the French embassy. The three Polish mathematicians were evacuated to Paris which they reached before the end of September. In October they joined a joint French-Polish-Spanish decoding unit at the Château de Vignolles north east of Paris and by the end of the year they were again managing to decode messages sent by the German Enigma machines.\nIn May\n1940\nGermany invaded France, and on\n14\nJune German troops entered Paris. France surrendered on\n22\nJune and, two days later, Rejewski and his colleagues were evacuated to Algeria. Germany occupied the north and east of France while the French set up a new government in Vichy under the leadership of Marshal Pétain which saw itself as a partner of Germany. Rejewski and his colleagues returned to this unoccupied Vichy France in September\n1940\nto work there in secret. To hide his real identity, Rejewski posed as a professor of mathematics from a lycée in Nantes. He worked at the Château des Fouzes near Uzès where a secret intelligence unit was set up. Again Rejewski and his colleagues began decoding German messages but on\n9\nJanuary\n1942\nJerzy Rozycki\ndied when a ship on which he was returning to France after a stay in Algeria was sunk. Later that year, after the Allies invaded North Africa, the German troops occupied Vichy France. The secret intelligence unit in the Château des Fouzes was in severe danger and it was evacuated on\n9\nNovember\n1942\n, three days before German soldiers discovered it.\nRejewski and his remaining colleague\nZygalski\nmoved around many of the cities of southern France avoiding capture. They eventually decided to attempt to cross the Pyrenees to reach Spain. Despite being robbed by their guide at gun point, they reached Spain, only to be put in prison. At first they were imprisoned at Séo de Urgel where they were held from January to March\n1943\n, then they were moved to a prison in Lerida. On\n24\nMay they were released and sent to Madrid. From there they made their way to Portugal and, after transfer by Royal Navy ship to Gibraltar, they were flown to Britain where they arrived\n3\nAugust\n1943\n. Rejewski then joined the Polish Army in Britain and remained there for the rest of the war, again working on decoding. Had the British authorities had a greater understanding of Rejewski's abilities he would surely have been sent to Bletchley Park to assist the decoding operations being carried out there; sadly this opportunity was missed.\nOn\n21\nNovember\n1946\nRejewski was demobbed and returned to Poland to be reunited with his family. They were living with their parents in Bydgoszcz and so, following his return, Rejewski chose not to return to his position as a mathematician at Poznań University\n(\nalthough it was still open to him\n)\nand took a job as a supervisor of sales at Polish Cable. Rejewski's family suffered a tragic loss shortly after his return when his eleven year old son died from polio. Their life was, over many years, made extremely difficult by enquiries carried out by the Polish Security Service. Rather remarkably, however, the Security Service never discovered his role in deciphering Enigma code. Despite not finding this out, nevertheless they demanded that he be dismissed from his position which happened in\n1950\n. He then held a number of positions before becoming a bookkeeper at the Provincial Union of Labour Cooperatives in\n1954\n. He held this position until he retired in\n1967\n.\nUp to the time of his retirement Rejewski had maintained complete secrecy about his work in cryptology. However he writes in\n[\n23\n]\n:-\nIt should be mentioned that the present paper is the first publication on the mathematical background on the Enigma cipher breaking. There exist, however, several reports related to this topic by the same author: one - written in\n1942\n- can be found in the General Władysław Sikorski Historical Institute in London, and the other - written in\n1967\n- is deposited in the Military Historical Institute  in Warsaw\n.\nRejewski and his family moved to Warsaw in\n1969\nand the full story of his involvement with the Enigma cipher breaking emerged in\n1973\n. This led to him becoming famous through newspaper articles, radio and television programmes. He himself wrote a number of technical articles, see\n[\n6\n]\n,\n[\n19\n]\n, and\n[\n23\n]\n.\nIn\n2002\n, a group of history and cryptology enthusiasts proposed commemorating this achievement with a monument where the history of breaking the Enigma ciphers began - in Poznań, Poland. ... From the\n24\nproposals received, the jury unanimously selected the design by Grazyna Bielska-Kozakiewicz and Mariusz Krzysztof Kozakiewicz. Their work represented the prism of a regular triangular base - its sides covered with rows of numbers. On each side of the monument, the name of one of the codebreakers emerges from the chaos of numbers. In its verdict, the jury remarked that the winning project \"represents in the purest form the brilliant thought of the three mathematicians. The artist himself seems to step aside permitting the spectator to contemplate the purely intellectual achievement of the three cryptologists.\"\nThe monument was unveiled on\n10\nNovember\n2007\nin Poznań Castle, the site of the Department of Mathematics where the three had studied. The date was the\n75\nth anniversary of the first Enigma code being broken.\nOther events commemorating their remarkable achievements have been a conference \"Secrets of Enigma\" held in Bydgoszcz, Poland, on\n9\n-\n10\nNovember\n2004\n, the visit to Bletchley Park in\n2014\nby relatives of the three cryptologists mentioned above, and the publication of several books, four of which are listed in the References to this biography. You can see the monument at\nTHIS LINK\n.\nRejewski died at his home in Warsaw following a heart attack and was buried with full military honours.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Statistics"
  ]
}