{
  "nome_completo": "Marion Cameron Gray",
  "nome_curto": "Marion Gray",
  "ano_nascimento": "1902",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gray_Marion/",
  "lugar_nascimento": "Ayr, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Marion Gray\n's parents were Marion Cameron and James Gray. She attended Ayr Grammar School from\n1907\nto\n1913\n, then Ayr Academy from\n1913\nto\n1919\n. Her home address in Ayr was\n60\nChurch Street. She passed the Scottish Leaving Certificate examination in Latin at Lower level in\n1916\n, then at Higher level English, Mathematics, French, and Science in\n1918\nand Dynamics in\n1919\n. She entered the University of Edinburgh in October\n1919\nafter having passed Preliminary Examination and having won a bursary. In the information she gave on first matriculation, she put United Free Church of Scotland under the heading 'Religious Denomination'.\nIn session\n1919\n-\n20\nGray took classes in English, Mathematics and Natural Philosophy at Ordinary level. In the following session she took Intermediate Honours courses in Mathematics, Natural Philosophy, and Chemistry. In\n1921\n-\n22\nshe studied Final Honours Mathematics, and Advanced Natural Philosophy\n(\nDynamics, Waves, Heat, Electricity I and II\n)\n. She graduated from Edinburgh on\n13\nJuly\n1922\nwith an M.A. with First Class Honours in Mathematics and Natural Philosophy. During her final year at the University she gave her address as \"c/o Miss Laidlaw,\n16\nEast Mayfield, Edinburgh\". In June\n1922\nshe had been awarded the Napier Medal and Gadgil Prize in Mathematics, and she won the John Edward Baxter Scholarship in Mathematics.\nAfter spending two years undertaking research in Edinburgh, Gray went to Bryn Mawr College in the United States in\n1924\nwhere she undertook research with\nAnna Wheeler\nas her supervisor. She was awarded a Ph.D. in\n1926\nfor her thesis\nThe theory of singular ordinary differential equations of the second orde\nr having offered physics as an allied subject. She returned to Scotland and, in July\n1926\n, attended the St Andrews Colloquium of the\nEdinburgh Mathematical Society\nheld in University Hall, St Andrews. The photograph above was taken at this colloquium.\nGray replaced A M Cassie during\n1926\n-\n27\nas an Assistant in Natural Philosophy in the Arts Faculty of Edinburgh University. In the Edinburgh University Calendar she appears as staff under 'University Assistants, Arts, Natural Philosophy' in the period\n1927\n/\n28\nto\n1929\n/\n30\n. However, despite her name appearing in the Calendar in the last of these sessions, she left Edinburgh in\n1927\nand worked as an assistant in mathematics at Imperial College of Science and Technology, South Kensington, London for three years.\nIn\n1930\nGray returned to the United States. The\nAmerican Mathematical Monthly\nfor\n1930\nreported:-\nDr Marion C Gray has been appointed to a position in the department of development and research of the American Telephone and Telegraph Company.\nIndeed Gray worked for the American Telephone and Telegraph Company from\n1930\nto\n1934\nwhen she joined the staff at the Bell Telephone Laboratories where she continued to work until she retired in\n1967\n. She became a naturalised citizen of the United States in\n1937\n. One might imagine that working for the American Telephone and Telegraph Company and then for Bell Telephones would have prevented her from continuing the research she had begun in her doctoral thesis. However, this was not the case and we list some examples of her contributions:\nIn\n1925\nE T Whittaker\ncommunicated the paper\nThe equation of conduction of heat\nby Marion C Gray to the\nRoyal Society of Edinburgh\n.\nMarion C Gray, Note on some Self-Reciprocal Functions in the Double Fourier Transform,\nJ. London Math. Soc\n.\n(1931)\n,\n247\n-\n250\n.\nMarion C Gray, A modification of Hallén's solution of the antenna problem,\nJ. Appl. Phys\n.\n15\n(1944)\n,\n61\n-\n65\n.\nMarion C Gray and S A Schelkunoff, The approximate solution of linear differential equations. Bell\nSystem Tech. J\n.\n27\n(1948)\n,\n350\n-\n364\n.\nMarion C Gray, Legendre functions of fractional order,\nQuart. Appl. Math\n.\n11\n(1953)\n,\n311\n-\n318\n.\nMarion C Gray, Bessel functions of integral order and complex argument,\nComm. ACM\n4\n(1961)\n,\n169\n.\nSo far we have not mentioned the mathematical result for which Gray is best known. In\n1932\nshe discovered a semisymmetric cubic graph on\n54\nvertices which today is known as the 'Gray graph'. It was first published by I Z Bouwer in\n1968\nin a paper entitled\nAn edge but not vertex transitive cubic graph\npublished in the\nCanadian Mathematical Bulletin\n, then, in\n2002\n, Malnic et al. showed that the Gray graph is the smallest possible semisymmetric cubic graph. Bouwer wrote to Gray in\n1969\nsaying how remarkable her discovery was:-\n... at a time when graph theory was almost non-existent.\nSee\nTHIS LINK\n.\nAfter joining the Bell Telephone Laboratories in\n1934\nshe worked\n[\n4\n]\n:-\n... first in New York City and later at Murray Hill, New Jersey. ... In addition to writing book reviews in journals she wrote\n258\nreviews in the first fourteen volumes of 'Mathematical reviews'. One hundred forty of her reviews were classified as \"optics, electromagnetic theory, circuits\" while another\n52\nwere classified as \"special functions.\" In\n1954\nGray served on an ad hoc committee formed when the National Science Foundation asked the National Bureau of Standards to prepare a handbook of mathematical tables. The outcome of that project was the 'Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables' published in\n1964\n.\nLet us note that looking at the\n258\nreviews that Gray wrote it is clear that she was equally happy reading papers in English, French, German and Italian. A common feature of these reviews is that they explain the content and context of the paper or book in question in a concise yet precise way.\nMarion Gray joined the\nEdinburgh Mathematical Society\nin session\n1921\n-\n22\n, while she was an undergraduate at Edinburgh, although she was formally elected in the meeting in December\n1922\n. Various papers by Gray were read to the Society:\nThe equation of telegraphy\n(\nwhich appeared in volume\n42\nof the\nProceedings\nand she read to the meeting of the Society in November\n1923)\n,\nThe equation of conduction of heat\n(\nwhich also appeared in volume\n42\nof the\nProceedings\n)\n, and\nOn the equation of heat\n(\nwhich appeared as\nParticular solutions of the equation of conduction of heat in one dimension\nin volume\n43\nof the\nProceedings\n)\n. She was elected to the Committee of the\nEdinburgh Mathematical Society\nin November\n1923\n. Gray continued to be a member of the Society through the various changes in her career.\nIt is interesting to wonder about Gray's life outside her passion for mathematics, physics and her career. We can report that when asked her favourite recreation, she replied that she got the greatest pleasure from walking. After she retired from the Bell Telephone Laboratories in\n1967\nshe returned to Scotland where she lived in Edinburgh. She spent the final twelve years of her life in this city where she died in\n1979\n.",
  "math_areas": []
}