{
  "nome_completo": "Mario Fiorentini",
  "nome_curto": "Mario Fiorentini",
  "ano_nascimento": "1918",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fiorentini/",
  "lugar_nascimento": "Rome, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Mario Fiorentini\n's father was Pacifico Fiorentini and his mother was Maria Moscatelli.\nHe had broad interests when he was young\n[\n5\n]\n:-\nAs a young man, he was deeply interested in literature, theatre and cinema, as well as the graphic arts.\nItaly joined World War II on the side of Germany in June\n1940\n. Their campaigns in Greece and North Africa were unsuccessful as were almost all of their military actions. In July\n1943\nthe Allies invaded Sicily, soon taking control, and by September of that year Italy had agreed an armistice. Germany then took control of Rome and northern Italy but from September\n1943\nthere were very active groups of Italians, some formerly part of the Italian army, others from different sources, who formed a vigorous armed resistance against the Germans. Fiorentini played a leading role in this resistance\n[\n5\n]\n:-\nHis resistance campaign lasted from\n1943\nto\n1945\nand included time as a prisoner. Through his action, he became a Major and eventually received numerous decorations - three silver medals, three war crosses for merit, a medal from the Special Forces, and a medal given by General William Donovan of the United States Army.\nIt was while he was active in the Resistance that Fiorentini met Lucia Ottobrini\n(1924\n-\n2015)\nwho was also playing a major role in that organisation. They married in\n1945\nand had three children: Claudia\n(\nborn\n1946)\n, Giancarlo\n(\nborn\n1951)\n, and Davide\n(\nborn\n1963)\n.\nWe have said nothing above about Fiorentini's education, but this is mainly because he was largely self-educated. He received his laurea in mathematics and physics in July\n1963\nfrom the University \"La Sapienza\" in Rome. He visited Canada in\n1964\nbut his professional career was as a high school teacher. However\n[\n6\n]\n:-\nMario Fiorentini has spent almost all his scientific life in Ferrara, where he was appointed to the chair of Geometria Superiore in\n1971\n, and where he remained until his retirement in\n1996\n.\nHe published\nUn speciale famiglia di ideali di classe principale generalizzata\nⓉ\n(\nA special family of ideals of generalized principal class\n)\nin\n1970\nand, in the same year, produced a\n150\npage text written jointly with Aldo Marruccelli\nComplementi di matematiche moderne: Logica matematica, teoria degli insiemi, struxture algebriche\nⓉ\n(\nSupplements of modern mathematics: Mathematical logic, set theory, algebraic structure\n)\n.\nHaskell Curry\n, in a review of this work, writes:-\nThis is an expository work at a fairly elementary level. There are three parts, dealing with logic\n(\ni.e., first order predicate calculus\n)\n, set theory and algebraic structures, respectively. In these the authors explain the meaning of the basic notions\n(\ne.g., truth-table valuation, formal proof, set, relation, cardinal number, well ordering,\naxiom of choice\n, associative law, group, ring, field, isomorphism\n)\nand state some of their properties, but give no proofs except in the very simplest cases.\nIn\n1971\nFiorentini published four papers:\nOn relative regular sequences\n;\nEsempi di anelli di Cohen-Macaulay semifattoriali che non sono di Gorenstein\nⓉ\n(\nExamples of Cohen-Macaulay semifactorial rings that are not Gorenstein\n)\n;\nEsempi di anelli di Cohen-Macaulay che non sono di Gorenstein\nⓉ\n(\nExamples of Cohen-Macaulay rings that are not Gorenstein\n)\nand\n(\nwith Aldo Marruccelli\n)\nOggetto e fondamenti della matematica\nⓉ\n(\nObjects and the foundations of mathematics\n)\n. Other examples of his work from a slightly later period are\n(\nwith L Badescu\n)\nCriteri di semifattorialità e di fattorialità per gli anelli locali con applicazioni geometriche\nⓉ\n(\nCriteria for semifactoriality and factoriality for local rings with geometric applications\n)\n(1975)\nand\n(\nwith Alexandru T Lascu\n)\nA formula of enumerative geometry\n(1981)\n. In a review of\n[\n1\n]\nNicolae Manolache writes:-\nThis volume contains most of the mathematical writings of Mario Fiorentini. Some of the articles are published here for the first time. Many papers were written in collaboration, but, nevertheless, the whole shows a continuity of interest for certain themes:\n1\n. regular sequences and refinements of this notion, leading to special classes of rings, important in algebraic geometry\n(\ncomplete intersection,\nGorenstein\n, Cohen-Macaulay, Buchsbaum, etc.\n)\n;\n2\n. linkage of curves;\n3\n. classical\n(\nItalian\n)\ngeometry in the perspective of the modern methods.\nIt is instructive and of real interest to follow the deepening of understanding and of mathematical contribution from one article to the other.\nRibenboim\nwrites in\n[\n5\n]\n:-\nMany of Fiorentini's papers are written in collaboration. This reflects his working style. Through a combination of charisma and single-mindedness he inspired others to join him and work on his problems. Among his many associations, the most fruitful has been, no doubt, with Mario's long-time friend and university colleague, Alexandru T Lascu.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic"
  ]
}