{
  "nome_completo": "Marion Ilse Walter",
  "nome_curto": "Marion Walter",
  "ano_nascimento": "1928",
  "ano_morte": "2021",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Walter/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Eugene, Oregon, USA",
  "biografia": "Marion Walter\nwas born in Berlin, Germany, to Jewish parents. Her father was a business man who dealt in costume jewellery. Her mother was Erna Else Walter. She had a sister, Ellen Paula Walter, who was two and a half years older than her. In\n1933\nthe Nazi party came to power and passed a law restricting the number of Jewish students in schools and universities. Marion, who was just starting school, remembers that nobody would sit beside her although at this time she did not understand why that was happening. She was made to sit at the back of the class by herself and when the children put on a play she was not allowed to take part in it. One day there was an incident that made her believe that being good at arithmetic was useful. On that day she was sick and could not go school but later in the day she felt better and a nanny took her out for a walk in the park. In the park she met her teacher who was just leaving the school and the next day her mother was called into the school because she had not said 'Heil Hitler' to her teacher. Her mother explained that when Marion was at home she was not allowed to say 'Heil Hitler', but in school she had to say 'Heil Hitler'. When she met her teacher in the park she did not know if she was at home or at school and had said nothing. The teacher said she would not report Marion on this occasion since she was the best in her class at arithmetic. Marion said that maybe this made her try extra hard to be good at arithmetic after that. Later, around\n1936\n, she was told not to say things on the phone like where her uncle Alfred was sleeping that night. However, mathematics was always a safe topic to talk about since Hitler did not object to\n2\n+\n2\n=\n4\n. Mathematics became for Marion a safe subject while many others were not.\nLater, in late\n1935\n, Marion was sent to a Jewish boarding school near Ulm. This she thought was a wonderful school where she made many friends among her fellow students whom she kept up with all her life. She spent three years at this school but was too young to benefit much from the excellent teaching. While at this school she saw troops and tanks on manoeuvres in the forest. The headmaster of the school knew when the Gestapo was coming to inspect and many books were burnt before the visit. The pupils had the task of stirring the ashes so that nothing could be read in the ashes. She was the only girl in the junior part of the school and one day she was told to go to the senior school and told not to look out of the window. However, she did look out and saw the headmaster being taken away by the Gestapo. Somehow, perhaps after paying a bribe, he was released and later returned to his position at the school. Marion came back to Berlin before the end of\n1938\nfor her Christmas holidays. There she saw smashed shop windows of Jewish shops which had happened on Kristallnacht, the\n9\n-\n10\nNovember\n1938\n, when much Jewish property was destroyed. She spent Christmas in Berlin but by this time her parents realised that they had to try to get their daughters out of Germany. It was the events of Kristallnacht that made the British realise that they must try to help Jewish children in Germany. The Kindertransport started at the beginning of December\n1938\ntaking children to England to live with relatives or foster families. Similar transport systems were set up taking children to other countries such as France, Belgium and the Netherlands. Marion's parents arranged for her and she sister to go to England where they had a distant relative.\nThe actual trip took place on\n15\n-\n16\nMarch. Marion explained that she never asked her parents, \"What was it like to see your children leave on the Kindertransport.\" Only at the\n60\nth reunion event which took place in London did people start to talk about it. Even more surprisingly, she never spoke to her sister about it. She remembers that the night before they left she cried because she did not speak English. Her mother showed her England on the atlas. At the station the children formed a circle waiting for the train to arrive. Marion and her sister got on the train which had six children in each compartment. In their compartment there was an older girl who had an engagement ring and they discussed how to hide it. The girl wore the ring and the Nazi who entered the compartment to make sure none of the children had any valuables with them did not notice the ring when he came to check. There was great relief when the train crossed the border into Holland and Dutch ladies gave the children food. They were then put on a ship and there was a rough crossing from the Hook of Holland to Harwich in England. The British people who met them were in uniform which was frightening. However, Marion was given a banana which she thought was a wonderful little act of kindness.\nOnce in England, Marion was sent to Eastbourne Boarding School but soon after she arrived the school stopped for the Easter holidays. Easter that year was on\n9\nApril and Marion and her sister had to stay in the school during the holidays since they had nowhere else to go. The two young girls were the two token refugee children at the school. She was kept apart from her sister so that they would learn English more quickly. In fact this lack of English was in some ways an advantage to her mathematics since, not understanding the teacher through language difficulties, she had to work things out for herself. During the summer of\n1939\nMarion's parents were able to get out of Germany and come to England so the family met up again. However, they saw little of each other and, following the German invasion of Poland on\n1\nSeptember, Britain declared war on Germany two days later. Immediately after this the children had to go to air raid shelters when the sirens went off. By May-June of\n1940\n, following the fall of France, it was decided to evacuate the school children from Eastbourne. The plan was to have children return to their families but not everyone had a family to go to. Marion waited for days with her suitcase packed, then the remaining school children were evacuated to Wykey in Shropshire. There they had to sleep in dog kennels all summer and classes were held in chicken coops. When they heard bombs falling, the children went into the large nearby house where they lay down under a billiard table. They spent one term at Hatton Grange, big house near Shifnal, then made a third move to Conbermere Abbey, a\n14\nth century abbey. Marion liked it there and she spent the rest of the war in the Abbey. The children slept on the\n3\nrd floor where the monks used to sleep but with no heating, it was bitterly cold in winter. She spent the school holidays back in Wykey, seeing little of her mother who worked illegally in London. Her father was interned on the Isle of Man in\n1940\nbut he had been free up until then because he had been oppressed by the Nazis. He died in the internment camp in\n1943\n. Marion sat the Cambridge University School Certificate examinations at the age of\n16\n. Then she returned to Wykey for Christmas\n1944\n. The local mathematics teacher had resigned, replacements were hard to find at this time, and so Marion was asked to teach mathematics at the Wykey school. She had to sleep with the students, but this chance happening was her rather strange way into becoming a mathematician.\nWalter spent two terms teaching mathematics at Wykey, discovering that she enjoyed teaching. Although she had always enjoyed mathematics, before this experience she had wanted to have a career involving art. She attended College in England for two years and was living with her mother and sister at\n75\nLinden Gardens in London before taking the ship\nNieuw Amsterdam\nfrom Southampton, England, to New York, United States, arriving on\n9\nJanuary\n1948\n. Her sister Ellen Paula, who was a typist, and her mother Erna Else, a housewife and shorthand typist, accompanied her to New York. When in New York, Walter became a student at Hunter College, a famous women's college which around the time that Walter studied there had begun to admit men. At Hunter College she took mathematics as her main topic but also studied education as a minor topic. She graduated in\n1950\nand became a school teacher.\nHer first teaching positions were as a mathematics teacher at Hunter College High School, at that time an all girls' school, and at George Washington High School. However, permanent positions were only available to teachers with a Master's Degree so Walter studied part-time at New York University. This was not easy as it involved a fairly long commute each day to attend classes in the evenings. When she was offered a research assistant position at the Institute for Mathematics and Mechanics of New York University\n(\nnow the\nCourant\nInstitute\n)\nshe accepted despite being reluctant to give up teaching. The US Atomic Energy Commission had installed one of the first electronic computers there and Walter's job mainly involved computing. She worked for Eugene Isaacson who had been awarded his Ph.D. in\n1949\nadvised by\nK O Friedrichs\n. Walter applied for a National Bureau of Standards Summer Student Scholarship to spend summers at the Institute of Numerical Analysis at the University of California, Los Angeles\n(\nUCLA\n)\n. The Institute had been set up on the UCLA campus under sponsorship of the National Bureau of Standards with funding from the Office of Naval Research. Its primary function was \"to conduct research and training in the types of mathematics pertinent to the efficient exploitation and further development of high-speed automatic digital computing machinery.\" She was invited for interview but only received the letter asking her to attend after the date of the interview. Isaacson was informed that this was because they did not employ women at the Institute. Isaacson then wrote to\nDerrick H Lehmer\n, the Director of the Institute, recommending Walter. As a consequence, she was awarded one of the five fellowships to work at the Institute of Numerical Analysis at UCLA over the summer of\n1952\n. At the Institute the senior staff that summer included\nDerrick H Lehmer\n,\nA Adrian Albert\n,\nGertrude Blanch\n,\nGeorge E Forsythe\n,\nGilbert A Hunt\n,\nMark Kac\n,\nIrving Kaplansky\n,\nCornelius Lanczos\n,\nTheodore S Motzkin\n,\nIsaac J Schoenberg\n,\nJoseph L Walsh\n, and\nJacob Wolfowitz\n. Walter was granted a second fellowship to enable her to spend the following summer at the Institute of Numerical Analysis. Many of the same senior staff were the same as the previous year but one notable addition was\nMarshall Hall Jr\n.\nOlga Taussky-Todd\nbecame Walter's mentor and encouraged her to continue work for her Master's Degree. While at the Institute of Numerical Analysis over these two summers Walter took many photographs of the famous mathematicians who were at the Institute and a collection of\n70\nphotographs is now available at the Dolph Briscoe Center for American History, see\n[\n14\n]\n.\nOn\n22\nJune\n1953\nWalter became a naturalised American citizen. At that time she was living at\n251\nWest\n71\nst Street, New York. Walter graduated with a Master's Degree from New York University in\n1954\nand, despite being encouraged to continue working towards a Ph.D. by\nLipman Bers\n, she decided that she wished to leave computing and return to teaching mathematics. She was a teaching assistant in mathematics at Cornell University during\n1954\n-\n56\n, then became a lecturer in mathematics at Simmons College in Boston. The College did not offer majors in mathematics but at the end of her one year appointment, she was asked to stay on and set up a mathematics major course. In the summer of\n1959\nshe spent three months back in England, sailing from New York to Southampton on the ship 'United States' arriving on\n24\nJune. In England she lived in the village of Brookmans Park, near Hatfield in Hertfordshire.\nIn\n1960\nshe was awarded a fellowship to attend the National Science Foundation Summer Program at Stanford University.\nGeorge Pólya\nran a seminar on \"how to solve it\" which greatly influenced Walter. In\n1965\nshe resigned her position at Simmons College in order to concentrate on her doctorate which was awarded by Harvard University in\n1967\nfor her thesis\nTwo Samples of Informal Geometry for Young Children\n.\nShe had published\nAn example of informal geometry: Mirror Cards\nin\n1966\nin\nThe Arithmetic Teacher\n. On the paper her address is given as \"Educational Services Incorporated.\" The paper states:-\nMarion Walter is a part-time mathematics instructor at the Harvard University Graduate School of Education. She is on the staffs of Educational Services Incorporated in the Elementary Science Study and the Cambridge Conference on School Mathematics. She teaches mathematics students in elementary school education at the Harvard Graduate School of Education.\nIn the following year she published\nSome mathematical ideas involved in the Mirror Cards\nin the same journal.\nIn the first of these papers she writes:-\nThe need for informal geometry especially in the earlier grades, is being recognized by educators, psychologists, and  mathematicians. The Mirror Cards were created by the author to provide a means of obtaining, on an informal level, some geometric experience that combines the possibility of genuine spatial insight with a strong element of play.\nWalter explains how the work came about:-\nThis work was begun while the author was working during the summer of\n1963\nwith the Elementary Science Study, a project supported by grants from the National Science Foundation and administered by Educational Services Incorporated, a non-profit organization engaged in educational research. She would like to thank the members of the group she worked with that summer and the group in optics of the previous summer for their help and encouragement ...\nAfter the award of her doctorate, Walter taught at the Harvard University Graduate School of Education. There she taught students who were training to become primary school teachers and also students training to become high school mathematics teachers.\nIn addition to many papers on mathematical education, Walter published a number of books, some single authored and some with her collaborators. The first of these was the\n28\n-page single authored work\nMagic mirror tricks\n(1971)\n. Here are some comments about this work:-\nThis is one of my favourite mirror books. This book has many mirror tricks in it that are simple enough for a\n4\n1\n2\n4\\large\\frac{1}{2}\\normalsize\n4\n2\n1\n​\nyear old to enjoy. I use them in my classroom and the students just love them.\nThis is the most entertaining book ever! Simple yet dynamic.\nEnjoyed using this book with a child and to create a program about symmetry. It came with an unbreakable mirror and asked children to use the mirror to do different things ... i.e. \"Can you make this shape bigger? Can you make this shape smaller?\" Simple and inexpensive.\nFor extracts from reviews of other books by Walter, see\nTHIS LINK\n.\nWalter's niece Rachel writes in\n2000\n:-\nMarion Walter is actually my aunt, and she wrote most of her books with us nieces in mind. I can tell you from personal experience that as a child they were great books to learn from and fun to play with. Her aim has always to make education fun, and she certainly achieves this in her books. All the mirror books teach you about symmetry in a really creative way, and teach children to think for themselves. The books are also illustrated in a colourful fun way, other books which run along this line are no where near as clever.\nIn\n1972\nHarvard University terminated the program that Walter was teaching. She spent nine months at the Atlantic Institute of Education and at Dalhousie University in Halifax, Nova Scotia, before teaching for a short time as a UNESCO consultant for mathematics teaching in Israel, and then at the State University of New York in Buffalo. In\n1977\nshe was appointed to the University of Oregon where she remained until her retirement in\n1994\n.\nThe following tribute from one of Walter's former students, Peter Orton, was written in\n2003\n:-\nIn the\n1970\ns I was Marion Walter's student at Harvard University Graduate School of Education. I went on to teach children for six years in Arlington and Cambridge\n(\nMA\n)\nPublic Schools, and then seventeen years for the California State University. I've used Dr Walter's manipulative materials and approach throughout all those years, and they work wonderfully in enabling students to understand concepts, both abstract and concrete. You cannot do better than Marion Walter's insights for teaching mathematics. She is the BEST!\nFinally we should mention \"Marion's Theorem.\" This theorem, first stated by Walter in\n1994\n, is the following:\nLet\nA\nB\nC\nABC\nA\nB\nC\nbe any triangle. Trisect each side, so that\nA\nB\nAB\nA\nB\nhas\nC\n1\nC_{1}\nC\n1\n​\nand\nC\n2\nC_{2}\nC\n2\n​\nas the two trisection points and similarly for the other two sides. Draw the lines\nA\nA\n1\n,\nA\nA\n2\n,\nB\nB\n1\n,\nB\nB\n2\n,\nC\nC\n1\n,\nC\nC\n2\nAA_{1}, AA_{2}, BB_{1}, BB_{2}, CC_{1}, CC_{2}\nA\nA\n1\n​\n,\nA\nA\n2\n​\n,\nB\nB\n1\n​\n,\nB\nB\n2\n​\n,\nC\nC\n1\n​\n,\nC\nC\n2\n​\n. These lines define an hexagonal region in the middle of triangle\nA\nB\nC\nABC\nA\nB\nC\n. Then the area of the hexagonal region is\n1\n10\n\\large\\frac{1}{10}\\normalsize\n1\n0\n1\n​\nthe area of\nA\nB\nC\nABC\nA\nB\nC\n.\nYou can see a diagram for this theorem at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}