{
  "nome_completo": "Maria Mitchell",
  "nome_curto": "Maria Mitchell",
  "ano_nascimento": "1818",
  "ano_morte": "1889",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mitchell_Maria/",
  "lugar_nascimento": "Nantucket, Massachusetts, USA",
  "lugar_morte": "Lynn, Massachusetts, USA",
  "biografia": "Maria Mitchell\nwas the daughter of William B Mitchell\n(1791\n-\n1869)\nand Lydia Coleman\n(1792\n-\n1861)\n. William and Lydia were married in Nantucket on\n10\nDecember\n1812\n. Both William and Lydia were Quakers and came from families who had, several generations before, come to Nantucket to avoid discrimination. Maria Mitchell was one of her parents' ten children: Andrew Coleman Mitchell\n(1814\n-\n1871)\n; Sally Mitchell\n(1816\n-\n1876)\n; Maria Mitchell\n(1818\n-\n1889)\n, the subject of this biography; Ann Mary Mitchell\n(1820\n-\n1900)\n; Francis Macy Mitchell\n(1823\n-\n1891)\n; William Foster Mitchell\n(1825\n-\n1892)\n; Phebe Mitchell\n(1828\n-\n1907)\n; Eliza Mitchell\n(1830\n-\n1833)\n; Henry Mitchell\n(1830\n-\n1902)\n; and Eliza Catherine Mitchell\n(1833\n-\n1907)\n.\nWilliam Mitchell was a cooper when Maria was born but, with an interest in mathematics and astronomy, he became a schoolteacher. Although the family lived by the strict Quaker rules, William Mitchell loved bright colours despite the Quaker dress being required to be dull. He bought books with red covers when possible, painted the stand of his telescope red, and had bright carpets and wallpaper in his home. The children attended schools but learning continued at home too. Lydia Mitchell was a very honest well-organised person who organised the family, particularly the children's education. Phebe Mitchell, one of Maria's younger sisters, writes in\n[\n20\n]\n:-\nIn Maria Mitchell's childhood the children of a family sat around the table in the evenings and studied their lessons for the next day, - the parents of the older children assisting the younger if the lessons were too difficult. The children attended school five days a week, - six hours in the day, - and their only vacation was four weeks in the summer, generally in August.\nLife, however, was not easy for the family, but in later life Maria felt that the difficulties were important motivation. She wrote\n[56]\n:-\nOur lack of opportunity was our opportunity - our privations were our privileges, our needs were our stimulants - we are what we are partly because we had little and wanted much, and it is hard to tell which was the more powerful factor.\nThe family greatly valued books and looked after them carefully, passing them down from one child to the next. For example, the Mitchell family owned a copy of Warren Colburn's\nAn introduction to algebra upon the inductive method of instruction\n(1825)\n. The book was first used by Sally Mitchell, Maria's elder sister, whose name is written on it, followed by Maria's name, then those of her six younger siblings, one after the other in order of their ages. Note that Eliza Mitchell had died as a baby so Maria only had six younger siblings. The Preface of Colburn's book begins:-\nThe first object of the author of the following treatise has been to make the transition from arithmetic to algebra as gradual as possible. The book, therefore, commences with practical questions in simple equations, such as the learner might readily solve without the aid of algebra.\nLet us return to Maria Mitchell's schooling. She began her education at the age of four, going to a school run by a lady who was widowed and taught youngsters to provide an income. It was a difficult experience for the young Maria who had a stubborn nature. To read Maria's own description of her experiences at this school, see\nTHIS LINK\n.\nHer next schooling was more successful attending Elizabeth Gardner's small school in a room in the house of Gardner's father. Gardner, a distant relative of Maria's, \"first made the study book charming\" but quickly realised that Maria was both shy and stubborn. When she was nine years old, Maria attended the North Grammar school, the first public school on Nantucket that stood around the corner in the Town Hall at Main and Milk Streets. Her father taught at that school and, two years later, he opened his own school on Howard Street. Maria moved to the Howard Street school, aged eleven, but as well as being a pupil, she assisted her father teaching the other children.\nWilliam Mitchell was an enthusiastic observer using a\n2\n3\n4\n2\\large\\frac{3}{4}\\normalsize\n2\n4\n3\n​\ninch Dollond telescope. He taught Maria to use the telescope and also a chronometer. There was an annular solar eclipse on\n12\nFebruary\n1831\nfor which Nantucket was ideally situated for viewing. William Mitchell removed the parlour window of their home at\n1\nVestal Street and set up the telescope there. It was a clear cold day and he observed the eclipse with Maria by his side counting the seconds with the chronometer. Her expertise with chronometers became well known and soon she was assisting captains of whaling ships by rating their chronometers which, at that time, were used for determining longitudes.\nWilliam closed his school when he became Chief Cashier at the Pacific Bank and at that time Maria moved to study at Cyrus Peirce's School for Young Ladies on Orange Street. Cyrus Peirce\n(1790\n-\n1860)\nwas both a Unitarian minister and fine school teacher. He taught in various schools, in particular one in Nantucket from\n1831\nto\n1837\n[40]\n:-\n[\nCyrus Peirce\n]\nwas a fine teacher of mathematics. He soon found out Maria was a good student. He gave her difficult problems to solve. The harder they were, the better Maria liked them. What she needed most was a quiet place to study at home. Mother and Father talked it over. \"The closet at the bottom of the attic stairs might be a good place,\" Mother suggested. \"Fine,\" Father agreed. \"The window at the front will give plenty of light in the daytime. And I'll put in some shelves. To Maria it was wonderful to have her own study, tiny though it was.\nMaria Mitchell completed her education at Cyrus Peirce's School for Young Ladies in\n1834\nbut, for a short time, she became a teaching assistant at the school. In\n1835\nshe opened her own school, training girls in mathematics and science. She rented a room in which to teach her pupils and put an advertisement in the newspaper. In order to learn more mathematics and astronomy, she studied Bewick Bridge's book \"A Compendious and Practical Treatise on the Construction, Properties, and Analogies of the Three Conic Sections\" and\nCharles Hutton\n's famous\nA Course of Mathematics\n. Although her school made an excellent start, Maria closed the school and accepted a job as Nantucket Atheneum's first librarian in\n1836\n. The library contained books that she wanted to read herself, and she studied\nBowditch\n's English translation of\nLaplace\n's\nMécanique Céleste\nas well as\nGauss\n's\nTheoria Motus\nwhich she read in Latin.\nNow that William Mitchell was working for the Pacific Bank he was able to take his astronomy hobby more seriously. A little observatory was constructed on the roof of the bank building and he was able to put in it the Dollond telescope and other instruments from his home. Since he was making useful observations for the Coast Survey, they lent him a larger rather fine telescope. The West Point Academy lent him an \"altitude and azimuth circle\" and also two transit instruments which he housed in buildings erected in the yard outside the bank. This provided a wonderful place for Maria to learn astronomy. In fact it may have been the best place in the whole of America to study to become an astronomer at that time.\nMaria Mitchell's work at the Atheneum's library was an ideal one for her in many ways. The hours that the library was open were relatively short and, the subscription being expensive, not too many people came there. This left Maria with much time in which she enthusiastically continued to educate herself. She studied Latin, German, physics and advanced mathematics. This was all possible because of the books available in the library. Public lectures were often held in the library and this allowed her to listen to some leading academics and talk to them. Every night she spent with the family's telescopes sweeping the sky.\nAlthough she was brought up in a Quaker family, in\n1843\nMaria decided that she would no longer follow the principles of the Quakers and chose to follow the teachings of the Unitarian Church. It was a decision that didn't seem to cause any difficulty in relations with her family and seems to have been made to allow her more freedom. She continued to have strong principles, for example she was strongly opposed to slavery, attended an anti-slavery convention in Nantucket in\n1841\n, and stopped wearing clothes made from Southern cotton.\nThe event which changed her life took place on\n1\nOctober\n1847\n; on that evening when sweeping the sky with her telescope at\n10\n:\n50\npm, she spotted a comet which was not bright enough to be visible with the naked eye. She asked her father to confirm her observation which he did. William Mitchell said that it should be announced immediately but Maria was more cautious and wanted to see if it had been spotted by others. William Mitchell, however, thought her discovery should be made public and wrote to his friend William Cranch Bond\n(1789\n-\n1859)\n, the first director of the Harvard College Observatory\n[\n20\n]\n:-\nNantucket, October\n3\nrd,\n1847\n.\nMy dear Friend: I write now merely to say that Maria  discovered a telescopic comet at half-past ten on the evening  of the first instant, at that hour nearly vertical above Polaris  five degrees. Last evening it had advanced westwardly; this  evening still further, and nearing the pole. It does not bear  illumination, but Maria has obtained its right ascension and  declination, and will not suffer me to announce it. Pray tell  me whether it is one of George's; if not, whether it has been  seen by anybody. Maria supposes it may be an old story. If  quite convenient, just drop a line to her; it will oblige me  much. I expect to leave home in a day or two, and shall be  in Boston next week, and I would like to have her hear from  you before I can meet you. I hope it will not give thee much  trouble amidst thy close engagements.\nThe comet was discovered independently by several others before it became visible to the naked eye, but these were all later than Maria's discovery. On\n10\nJanuary\n1848\na letter was sent to William Mitchell telling him that\nGeorge Airy\n, the Astronomer Royal, should be informed of Maria's discovery so that she might be able to claim the medal of the King of Denmark for the first discovery of a telescopic comet. Father Francesco de Vico at Rome had observed the same comet on\n3\nOctober and had been the first to report it. Several others observed it in the days that followed, but Maria's observation on\n1\nOctober was recognised as the first. In\n1831\nFrederick VI, the King of Denmark, who was himself an amateur astronomer, had created a gold medal to be awarded to the first observer to see any new telescopic comet. Frederick VI had died in\n1839\nbut his successor, Christian VIII, presented Maria with the gold medal on\n6\nOctober\n1848\n. It is inscribed in Latin with\nNon Frustra Signorum Obitus Speculamur et Ortus\nwhich translates as \"Not in vain do we watch the setting and the rising of the stars.\" We note that although Maria was presented with the medal on\n6\nOctober, this was not in person, and the medal was sent to her but did not arrive until March\n1849\n.\nAfter her discovery, even before she received the medal, Maria Mitchell had achieved great fame. On\n29\nMay\n1848\nshe had been elected to the\nAmerican Academy of Arts and Sciences\n, becoming the first woman member. We note that her father, William Mitchell, was already a member having been elected to the\nAmerican Academy of Arts and Sciences\nin\n1842\n. In\n1849\nshe accepted a job with the U.S. Coast Survey which involved working as a computer for the new American Ephemeria and Nautical Almanac. She computed positions of the planets, particularly Venus, for the Almanac which was designed to be used by sailors in navigation.\nIn\n1850\n, she was elected a fellow of the American Association for the Advancement of Science, again becoming the first woman member. Fame did little to change Maria's life in the first place, however, and she continued to work as the librarian at the Atheneum's library. At the time of the\n1850\nUS Census, Maria was still living with her parents and five of her younger siblings. Her father is listed as a \"cashier\", her brother Francis as an \"assistant cashier,\" and her brother Henry as a \"civil engineer.\" John Richards Quinell and his wife Fidelia Quinell\n(\nnée Butler\n)\nare also living in the house. We assume that Fidelia, who cannot read or write, is a servant.\nIt is interesting to see what a typical day was like for Maria Mitchell at this stage in her career. In\n1854\nthe family servant left and the members of the family took it in turns to undertake their duties. Maria tells us what she did on\n21\nOctober\n1854\n(\nsee, for example,\n[\n20\n]\n)\n:-\nThis morning I arose at six, having been half asleep only for some hours, fearing that I might not be up in time to get breakfast, a task which I had volunteered to do the preceding evening. It was but half light, and I made a hasty toilet. I made a fire very quickly, prepared the coffee, baked the graham bread, toasted white bread, trimmed the solar lamp, and made another fire in the dining-room before seven o'clock.\nI always thought that servant-girls had an easy time of it, and I still think so. I really found an hour too long for all this, and when I rang the bell at seven for breakfast I had been waiting fifteen minutes for the clock to strike.\nI went to the Atheneum at\n9\n.\n30\n, and having decided that I would take the Newark and Cambridge places of the comet, and work them up, I did so, getting to the three equations before I went home to dinner at\n12\n.\n30\n. I omitted the corrections of parallax and aberrations, not intending to get more than a rough approximation, I find to my sorrow that they do not agree with those from my own observations. I shall look over them again next week.\nAt noon I ran around and did up several errands, dined, and was back again at my post by\n1\n.\n30\n. Then I looked over my morning's work, - I can find no mistake. I have worn myself thin trying to find out about this comet, and I know very little now in the matter.\nI saw, in looking over Cooper, elements of a comet of\n1825\nwhich resemble what I get out for this, from my own observations, but I cannot rely upon my own.\nI saw also, today, in the 'Monthly Notices,' a plan for measuring the light of stars by degrees of illumination, - an idea which had occurred to me long ago, but which I have not practised.\nIn\n1856\nMaria Mitchell resigned her position as librarian to the Atheneum. She had been made an offer by the banker General Richard Kellogg Swift to take his daughter Prudence Elizabeth Swift\n(1838\n-\n1920)\non a trip to the Southern United States and also to Europe. In March\n1857\nMaria set out, first taking a coach to Chicago to join Prudence, then going to St Louis. They visited many places, spending some time in New Orleans, then by\n23\nApril they were in Charleston. After visiting Nashville and Chattanooga in May, they returned to prepare for their European trip. They sailed to England from New York, arriving in Liverpool on\n3\nAugust\n1857\n. Although this was in part a sight seeing trip, for Maria it was an opportunity to visit observatories and talk with mathematicians and astronomers. Prudence returned to the United States after a while and Maria continued making visits. Maria returned to the United States on the ship\nAsia\n, sailing from Liverpool to New York arriving on\n11\nJune\n1858\n.\nWe give a few extracts from her writings relating to her\n1857\n-\n58\ntrip to Europe, in particular those in which she describes meeting\nGeorge Airy\n,\nWilliam Whewell\n,\nJohn Couch Adams\n,\nJohn Herschel\n,\nUrbain Le Verrier\n, and\nMary Somerville\n, at\nTHIS LINK\n.\nIn\n1861\nMaria's mother died and after that, together with her father, she left Nantucket and went to live in Lynn, Massachusetts. In Lynn, she continued her work for the Coast Survey and Nautical Almanac.\nIn\n1861\nMatthew Vassar\n(1792\n-\n1868)\nbegan planning to build a women's college in Poughkeepsie, New York. He was interested in the sciences and one of the first buildings planned for the new college was an observatory. The building of Vassar College began in\n1863\nand Matthew Vassar wanted Maria Mitchell, the most famous woman astronomer in the United States, to become the professor of astronomy. To make the post of director of the Vassar Observatory attractive, he had purchased an excellent telescope. This\n12\n-inch refractor was the second largest telescope in the United States at this time. Maria agreed to become both the Professor of Astronomy at Vassar College and also the Director of the Observatory. She was the first professor appointed to Vassar College and began teaching there as soon as it opened in\n1865\n. At the time of the\n1865\nCensus, on\n12\nJune of that year, she was still living with her father in Lynn along with the Irish servant Bridget Harty. Before the start of the\n1865\n-\n66\nacademic year all three moved to the Vassar Observatory which contained accommodation for the director. William Mitchell continued to live at the Vassar Observatory with his daughter until his death in\n1869\n.\nIn\n1871\nMaria Mitchell discovered that women professors at Vassar College were being paid less than the male professors. Details of the ensuing arguments are complicated and the reader interested in the details should see\n[\n29\n]\n. When Maria threatened to resign over the issue, improvements were made but it does not appear that it was ever settled to her complete satisfaction. After this episode, she began more openly to fight for women's rights. In\n1873\nshe was active in the founding of the American Association for the Advancement of Women and served as its president in\n1875\n-\n77\n. Despite unhappiness at her treatment at Vassar College, she continued to hold her positions there until\n1888\n.\nIn\n[\n24\n]\nwe are given a picture of her life as a professor at Vassar:-\nMaria soon found that her role\n[\nat Vassar College\n]\nwas not only as a professor, but also as a mentor and guide for the young women. Maria was expected to act not only as a teacher, but also, in some respects, as a guardian and a motherly figure. Before leaving their daughters at their new school, the mothers begged Maria and the other teachers to take special care of each one and to make certain that they did as they had been told. ... Maria couldn't help but laugh at the fact that she was supposed to be in charge of her students' development as \"proper\" young ladies.\nWithin the first few years, Vassar students had many opportunities to conduct research and observation. Maria took her students on study trips to observe solar eclipses, with the first trip taking place in August\n1869\nto Burlington, Iowa. Some time later, in\n1878\n, she took students to Denver, Colorado to see a second total eclipse of the Sun. She was known for keeping students up at night past their curfew so that they could observe with her, and she enjoyed a close relationship with many of her astronomy students. She had a reputation for expecting much of her students, but she was a favourite professor of many. She treated her students as equals; she famously said, to her classes, that, \"We are women studying together.\"\nMary Whitney\nwho was her student and became her successor at Vassar College wrote\n[\n20\n]\n:-\nAs a teacher, Miss Mitchell's gift was that of stimulus, not that of drill. She could not drill; she would not drive. But no honest student could escape the pressure of her strong will and earnest intent. The marking system she held in contempt, and wished to have nothing to do with it. 'You cannot mark a human mind,' she said, 'because there is no intellectual unit;' and upon taking up her duties as professor she stipulated that she should not be held responsible for a strict application of the system.\nFor a collection of quotes by Maria Mitchell and quotes about her, see\nTHIS LINK\n.\nMaria made a second European trip in\n1873\nvisiting Russia and England. During her visit to the Russian observatory in Pulkovo near St Petersburg, where the director was Otto von Struve, Maria was surprised to hear von Struve's well-educated wife say that there were thousands of women who studied science at St Petersburg's universities.\nIn\n1888\nwhen suffering from poor health, Maria resigned her positions at Vassar and went to live with her sister in Lynn. It was only a short retirement for in the following year she died in Lynn. Her death certificate gives the cause of death as \"brain disease.\" She was buried next to her parents in the family plot in Prospect Hill Cemetery, Nantucket.",
  "math_areas": [
    "Algebra"
  ]
}