{
  "nome_completo": "Mario Pieri",
  "nome_curto": "Mario Pieri",
  "ano_nascimento": "1860",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pieri/",
  "lugar_nascimento": "Lucca, Tuscany (now Italy)",
  "lugar_morte": "S Andrea di Compito (near Lucca), Tuscany, Italy",
  "biografia": "Mario Pieri\n's parents were Pellegrino Pieri and Erminia Luporini. Pellegrino, who was born in Vellano east of Lucca, was a lawyer but he was also a highly respected scholar who had written historical works. He had been honoured for his achievements with election to the Royal Lucca Academy of Sciences, Letters and Arts. Pellegrino and Erminia Pieri had eight children: Teresa\n(\nborn\n1853)\n, Silvio Dante\n(\nborn\n1856)\n, Mario\n(\nthe subject of this biography\n)\n, Gemma\n(\nborn\n1863)\n, Ferruccio Fabio\n(\nborn\n1864)\n, Paolina Livia\n(\nborn\n1865)\n, Felice Ettore Pacifico Giovanni\n(\nborn\n1866)\nand Virginia\n(\nborn\n1867)\n. Mario attended elementary school in Lucca from\n1866\nto\n1872\nand there learnt to play the piano. In fact his music teacher, Gaetano Luporini, had a big influence on the young boy and for a long time he was unsure whether he should pursue a career in music or in mathematics. After elementary school, he spent four years at the Technical School in Lucca.\nIn\n1876\nMario entered the Royal Technical Institute in Bologna. His elder brother Silvio was undertaking postgraduate work at the University of Bologna on literature and philology at this time and Mario lived with his brother who took on the role of being his guardian and mentor. Mario studied Italian, French, German, social studies and mathematics throughout his four-year course, taking courses in physics, chemistry and natural history in his final two years. His physics teacher was Augusto Righi, a young man who went on to have a fine research career in physics, and Righi quickly saw the great potential in his student Mario. His performance improved steadily during these four years so that he moved from being a middle-ranked student to the top of his class by the time he graduated in\n1880\n.\nMario's family wanted him to study at the Scuola Normale Superiore in Pisa but their finances did not stretch to sending him there at that time. A decision was taken that he would spend one year at the University of Bologna so he could continue to live with Silvio\n(\nwho had one more year of study there\n)\n. He entered the University of Bologna in\n1880\n, having had the fees waived, taking the courses on '\nProjective geometry\n' and 'Design for projective geometry' with Pietro Boschi. He also took the 'Algebra and analytic geometry' course given by\nCesare ArzelÃ\n, and courses on physics, chemistry and mineralogy. His talents for mathematics were quickly spotted by\nSalvatore Pincherle\n, who took up the chair of mathematics at Bologna in\n1881\n, when he examined Pieri in June of that year. As his family had hoped, Pieri was awarded a scholarship to study at the Scuola Normale Superiore in Pisa and he began his studies there in November\n1881\n. At Pisa, Pieri had some distinguish mathematicians as his lecturers both at the Scuola Normale Superiore and at the University of Pisa\n(\nhe attended courses at both institutions\n)\n. He was taught 'Calculus' in\n1881\n-\n82\nby\nUlisse Dini\nwho also taught him 'Higher analysis' in the following year.\nEnrico Betti\ntaught him 'Mechanics' in\n1882\n-\n83\n, and 'Mathematical physics' and 'Celestial mechanics' in the following year.\nLuigi Bianchi\ntaught him 'Algebraic functions' in\n1882\n-\n83\nand '\nDifferential geometry\n' in\n1883\n-\n84\n. Pieri's thesis,\nOn the Singularities of the Jacobian of Four, of Three, of Two Surfaces\n, which supervised by\nBianchi\n, was submitted to the University of Pisa in\n1884\n. His graduation at the University of Pisa took place on\n28\nJune\n1884\n; he received a commendation in mathematics. He wrote the thesis,\nStudies in Differential Geometry\n, also supervised by\nBianchi\n, which he submitted to the Scuola Normale Superiore in Pisa in September\n1884\n.\nAfter graduating, he began teaching at a secondary school in Livorno, then returned to Pisa in October\n1885\nwhen, with a recommendation from Dini, he was appointed to the Technical School there. He also gave a series of lectures on polyhedra at the Scuola Normale Superiore. After teaching for a year in Pisa, Pieri won the competition for a professorship at the Royal Military Academy in Turin where he became professor of projective and descriptive geometry in November\n1886\n. His father had died in\n1882\nand his brother Silvio was teaching in secondary schools, so Pieri had his mother and sister Virginia come to live with him in Turin. In\n1888\nhe also was appointed an assistant to the chair of projective geometry at the University of Turin\n[\n3\n]\n:-\nBy then Pieri had published seven research papers. Soon,\nD'Ovidio\npresented Pieri's\n1889\npaper 'On Triple Tangents of Certain Surfaces of Sixth Order' to the Royal Academy of Sciences of Turin, the first of fourteen that Pieri would publish in its journals. By\n[1890]\nhe had published about ten works, including an edited translation of\nG K C von Staudt\n's\n1847\n'Geometrie der Lage'\nâ\n(\nGeometry of place\n)\n.\nIn\n1891\nPieri received his 'libero docente', which is similar to the\nhabilitation\nand gives the right to lecture in universities, from the University of Turin. This was awarded in the light of his outstanding research papers published over the preceding few years as well as his lecture notes\nGeometria proiettiva: Lezioni per gli allievi nella Reale Accademia Militare di Torino\n, which \"students found very beneficial\". He taught projective geometry courses there for several years. However, he continued to seek university appointments. In\n1891\nhe entered the competition for the chair of analytic and projective geometry at the University of Rome which was won by\nGuido Castelnuovo\n(\nPieri came third equal\n)\n. Two years later he entered the competition for the chair of projective geometry at the University of Naples\n(\nDomenico Montesano\nwon with Pieri fourth equal\n)\n, and the  competition for the chair of projective and descriptive geometry at the University of Turin\n(\nLuigi Berzolari\nwon with Pieri second equal\n)\n.\nThe chair at Bologna was left vacant when\nMontesano\nleft to take up the chair at Naples.\nPincherle\ninvited Pieri to apply writing\n(\nsee\n[\n3\n]\n)\n:-\nI knew already the outcome, rather flattering to you, of the competitions at Naples and Turin, and would be quite happy if, having had you as student in Bologna, it should be possible to have you as colleague.\nPincherle\nhoped that he could appoint Pieri without holding a competition and, on\n18\nNovember\n1893\n, Augusto Righi contacted Pieri with the news that the Faculty at Bologna had approved his appointment. He congratulated Pieri. However,\nFederigo Enriques\nhoped he might still have a chance to be appointed and approached Volterra and others to press his claims. It appeared that it was a formality that the minister of education took the advice of the Faculty of Bologna and would confirm Pieri's appointment but the government became embroiled in a scandal and the minister of education resigned. The new minister of education did not approve Pieri's appointment, telling the Faculty at Bologna that they had to hold a competition and make a temporary appointment while this was taking place.\nEnriques\nwas appointed to the temporary post in January\n1894\n. Pieri remained in Turin and concentrated on research, becoming less interested in finding a more prestigious post. The competition for the permanent Bologna post did not take place until October\n1896\n;\nEnriques\nwas appointed with Pieri coming a close second.\nIn\n1900\nPieri left Turin to take up an appointment at the University of Catania in eastern Sicily, after winning the competition for a chair. In Catania he taught projective geometry and descriptive geometry but also took on the teaching of projective geometry to give him a better salary. He married Angiolina Anastasio Janelli on\n27\nJuly\n1901\n. Angiolina was the sister of the husband of Pieri's sister Virginia and she came from Castroreale in Sicily. They had no children, but for several years they looked after two children of Pieri's sister Gemma who was in Brazil during those years. He was promoted to ordinary professor in the University of Catania in April\n1903\n. After spending eight years in Sicily, Pieri moved to the north of Italy, taking up an appointment in Parma. During these years in Catania\n[\n3\n]\n:-\n... he produced two research papers on\nalgebraic geometry\n, two book reviews, four papers on logic and foundations of arithmetic, and about seven on foundations of geometry, including two major works axiomatising Euclidean and complex projective geometry.\nIn fact, although Pieri's main area was projective geometry, and he is an important member of the Italian School of Geometers, however, after he moved to Turin, he became influenced by\nGiuseppe Peano\nat the University and\nCesare Burali-Forti\nwho was a colleague at the Military Academy. Their influence had led Pieri to study the foundations of geometry. In\n1895\nhe set up an axiomatic system for projective geometry with three undefined terms, namely points, lines and segments. He improved on results of\nMoritz Pasch\nand\nGiuseppe Peano\nand then, in\n1905\n, he gave the first axiomatic definition of complex projective geometry which does not build on real projective geometry. In\n1898\nPieri had published the memoir\nThe principles of the geometry of position\nthrough the Academy of Sciences of Turin.\nBertrand Russell\nwas impressed by this memoir and wrote, in his\nPrincipia\n:-\nThis is, in my opinion, the best work on the present subject.\nPieri had been invited to attend both the Congress of Philosophy and the International Congress of Mathematicians in Paris in\n1900\n. He did not attend these conferences but submitted a paper to the first of these on\nGeometry considered as a purely logical system\n. It certainly impressed\nHans Freudenthal\nwho wrote:-\nIn the field of the philosophy of sciences the Italian phalanx was supreme:\nPeano\n,\nBurali-Forti\n,\nPadoa\n, Pieri absolutely dominated the discussion.\nThe first\nLobachevsky\nPrize was awarded to\nSophus Lie\nin\n1897\n. Pieri submitted an entry for the\nLobachevsky\nPrize on the third time the Prize was offered. He received an 'honourable mention', as did Barbarin,\nLemoine\nand\nStudy\n, while the Prize went to\nDavid Hilbert\nfor the\n1903\nedition of his\nDie Grundlagen der Geometrie\nâ\n(\nFoundations of geometry\n)\n. In\n1908\nPieri was honoured by being named Knight of the Crown of Italy.\nIn\n1907\nhis health had begun to fail and he was unable to teach for three months. However, he recovered and after moving to Parma in\n1908\nhe became both an ordinary professor and director of the School of Projective and Descriptive Geometry with Design. The move from Catania to Parma was not promotion, but Pieri was looking to return to somewhere nearer to his native Tuscany. After he had succeeded in getting his former student\nBeppo Levi\nappointed to Parma in\n1909\nthe two cooperated in expanding the university\n[\n3\n]\n:-\nDuring the next years they worked to enhance the university's offerings in mathematics, creating schools of fundamentals of algebra, of ornamental design and architecture, and of infinitesimal calculus in\n1911\n. By then assistants had been hired for the first two of these, as well as for Pieri's school.\nIn\n1911\nPieri became interested the vector calculus through the work of\nCesare Burali-Forti\nand Roberto Marcolongo. However, around this time his health began to fail and cancer was diagnosed. His mathematical work came to an abrupt end at a time when he was at the height of his creative powers. In early\n1912\nBertrand Russell\ninvited Pieri to address the philosophy section of the International Congress of Mathematicians to be held in Cambridge, England in August of that year. Russell wrote\n(\nsee for example\n[\n3\n]\n)\n:-\nAs secretary of the philosophy section of the congress of mathematicians that will be held during the month of August in Cambridge, and as an admirer of your works, I have the honour of earnestly asking you to give a talk and take part in our discussions. The works of\nWhitehead\nand me, as you know, are based on the works of the Italian school, and I deeply desire that it will be well represented here in the philosophy section. Have faith, dear sir, in the assurance of my highest esteem.\nPieri, however, was by this time too ill to attend the Congress. Following Pieri's death from cancer in\n1913\n, his colleague and former student\nBeppo Levi\nwrote\n(\nsee for example\n[\n3\n]\n)\n:-\nThe work of Pieri was distinguished by carefulness of method, of order, and of rigour. And such were the signs of his character: he was on every occasion sincere, exact, and honest without possible compromise.\nPeano in\n[\n14\n]\nwrites:-\nPieri was totally dedicated to science and teaching. He was an untiring worker, honest, and of a singular modesty. When, some twenty years ago, the professors in Italy agitated for higher salaries, Pieri declared that their salaries were already above the work they did and their merit.\nWe have already noted Pieri's passion for music but he had other hobbies, including climbing. He made a number of assents in the Alps during his time in Turin. Gino Arrighi presents a clear picture of his character:-\nPieri was slightly smaller than usual in stature, bald, myopic, of a very reserved character, taciturn, and always absorbed in his thoughts about the most delicate concerns.\nLet us end this biography by quoting from Ugo Cassina who wrote, in\n1960\n:-\nMore than forty-seven years have passed since the death of Pieri, so that we can better evaluate - from the perspective of time - his collective works and recognise those of major importance which have contributed to place the name of Mario Pieri in the restricted circle of Italian mathematicians well-known in Italy and abroad at the turn of the century. ...\n[\nThese\n]\nworks of Pieri have ... major originality\n[\nand have\n]\nbrilliantly withstood the passage of decades and the fashion of the moment.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}