{
  "nome_completo": "Mark Aleksandrovich Krasnosel'skii",
  "nome_curto": "Mark Krasnosel'skii",
  "ano_nascimento": "1920",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krasnoselskii/",
  "lugar_nascimento": "Starokonstantinov, Ukraine",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Mark Aleksandrovich Krasnosel'skii\n's mother was Fanni Moiseevna, a secondary school teacher of Russian, and his father was Aleksandr Yakovlevich Krasnosel'skii who was a civil engineer. Mark Aleksandrovich was the youngest of his parents' two children, having an older brother Iosif. When Mark was twelve years old the family moved to Berdyansk, a port in southeast Ukraine on the Berdyansk Gulf of the Sea of Azov. He attended the local secondary school and graduated in\n1938\n. It was at this time, when eighteen years old, that he married Sarra Belotserkovskaya; they had three children, Veniamin\n(\nborn\n1939)\n, Alexandra\n(\nborn\n1945)\n, and Alexander\n(\nborn\n1955)\n. In\n1938\nMark Aleksandrovich entered the Department of Physics and Mathematics of Kiev University but after he had completed only one year of study World War II began.\nAt first the war had relatively little effect on Krasnosel'skii's university studies but in June\n1941\nGerman troops invaded and rapidly advanced towards Moscow, Leningrad and Kiev. To enable university education to continue, Kiev University was transferred to Kazakhstan and renamed the United Ukrainian University. Krasnosel'skii then graduated from the United Ukrainian University in\n1942\nand at that point joined the Soviet army. He spent four years in the army, unable to continue his mathematical studies, but his duties were as an instructor in the Ryazan Artillery School. The Artillery School was moved to Talgar in the Alma-Ata region and he remained there until\n1946\nwhen he was released from military duties. He had reached the rank of lieutenant.\nIn August\n1946\nKrasnosel'skii returned to Kiev where he was able to continue his studies, but he also worked, first as an lecturer in descriptive geometry at the Kiev Highway Institute and later as a junior scientist at the Institute of Mathematics of the\nUkrainian Academy of Sciences\n. He attended lectures by many leading mathematicians including\nAndrey Nikolaevich Kolmogorov\n,\nMark Grigorievich Krein\n,\nBoris Vladimirovich Gnedenko\n,\nMikhail Alekseevich Lavrent'ev\n, and\nAleksandr Gennadievich Kurosh\n. Krasnosel'skii was awarded his Candidates Degree\n(\nequivalent to a Ph.D.\n)\nin\n1948\nfor his thesis on\nThe theory of extension of Hermitian operators\n.\nKrasnosel'skii's first publication appeared in\n1946\n, the year he returned to Kiev, and was\nSur un critère pour qu'un domaine soit étoilé\nⓉ\n(\nOn a criterion for a domain to be starred\n)\n. Following this he achieved a remarkable publication record with papers\n(\nall written in Russian\n)\nsuch as\nOn the deficiency numbers of closed operators\n(1947)\n,\n(\nwith\nM G Krein\n)\nOn the centre of a general dynamical system\n(1947)\n,\n(\nwith\nM G Krein\n)\nFundamental theorems on the extension of Hermitian operators and certain of their applications to the theory of orthogonal polynomials and the problem of moments\n(1947)\n,\nOn the extension of Hermitian operators with a nondense domain of definition\n(1948)\n,\nOn self-adjoint extensions of Hermitian operators\n(1949)\n,\n(\nwith\nM G Krein\n)\nOn a proof of the theorem on category of a projective space\n(1949)\n, and\nOn a fixed point principle for completely continuous operators in functional spaces\n(1950)\n. In fact this last mentioned paper is one of six papers on topological properties of nonlinear operators which appeared in\n1950\nand formed part of his doctoral thesis\n(\nequivalent to the German\nhabilitation\n)\nwhich he submitted in\n1950\n.\nHaving remained at Kiev until\n1952\n, in that year Krasnosel'skii was appointed to the Chair of Functional Analysis at Voronezh State University in Voronezh, western Russia. He held this position until\n1968\nby which time he had achieved world-wide fame through a number of outstanding monographs which had been published first in Russian then translated into English. For example\nPositive solutions of operator equations\n(1962)\nwhich studied the existence, uniqueness, and properties of positive solutions of linear and non-linear equations in a partially ordered\nBanach space\n,\nVector fields in the plane\n(1963)\nwhich the angular variation of a plane vector field relative to a curve, and\nDisplacement operators along trajectories of differential equations\n(1966)\nwhich is described by\nC Olech\nas follows:-\nThe goal of this work is three-fold. First the author gives a detailed exposition of the so-called method of guiding functions and its various applications developed by himself and his students. ... The second subject covered in the book concerns the existence and uniqueness of positive periodic solutions for systems satisfying certain monotonicity assumptions. ... The third part is concerned with the study of the connection between convexity and concavity of the displacement operator and the stability or instability of periodic solutions. ... The book is an elegant and very clear exposition of some unsophisticated but powerful ideas.\nThe next monograph, which Krasnosel'skii wrote jointly with three former doctoral students whom he advised at Voronezh State University, Petr Zabreiko, Evgenii Pustylnik, and Pavel Sobolevskii, was\nIntegral operators in spaces of summable functions\n(1966)\n. H H Wicke writes:-\nThis monograph performs the valuable service of assembling a great deal of material from the current literature and giving a clear exposition of the subject. It is highly recommended to those interested in the applications of\nfunctional analysis\n.\nIn\n1968\nKrasnosel'skii left Voronezh and moved to Moscow where he was appointed as a Senior Scientific Fellow at the Institute of Automation and Remote Control, which was later renamed the Institute of Control Sciences, part of the\nUSSR Academy of Sciences\n. He was head of the Department of Mathematical Methods for Analysis of Complex Systems and, as a result, his research investigated applications to control theory as well as theoretical developments. Given his incredible publication record, we cannot give even a good impression of the range and depth of his research, and that of the school which he led. We merely give one or two comments by reviewers to indicate their opinions on his monographs written with members of his research team. For example\nApproximate solution of operator equations\n(1969)\n:-\n... is devoted to the investigation of approximate methods of solving operator equations. Such methods form an important branch of functional analysis, with various applications to numerical analysis, where they usually originated. ... The richness of the methods, the clarity of the exposition and the importance of the results make this book highly valuable for those interested in functional analysis, as well as for numerical analysts.\nThe monograph\nGeometric methods of nonlinear analysis\n(1975)\n:-\n... is one of the best books on nonlinear analysis. It presents a well organized and compact treatment of modern methods in nonlinear analysis.\nThe monograph\nSystems with hysteresis\n(1983)\n:-\n... is devoted to a systematic presentation of new general approaches for the investigation of large classes of systems with hysteresis. In order to do this the authors develop new mathematical techniques based on the separation of elementary carriers of hysteresis which are the hysterons. ... The book is very carefully written, very clear, precise, rigorous and attractively presented ...\nThe monograph\nPositive linear systems. The method of positive operators\n(1989)\n:-\n... is a remarkable and important book, treating the theory and application of ordered\nBanach\nspaces and positive\n(\nlinear and nonlinear\n)\noperators.\nIn\n1990\n, remaining in the\nUSSR Academy of Sciences\nin Moscow, he moved to the Institute for Information Transmissions Problems. He remained working there until his death in\n1997\n.\nKrasnosel'skii was awarded many honours for his outstanding contributions including the Andronov Prize from the\nUSSR Academy of Sciences\n, the Humboldt Prize, and an honorary degree from the University of Rouen in France.\nP E Kloeden writes\n[\n10\n]\n:-\nIn over a half century of scientific activity Mark Krasnosel'skii wrote more than\n380\nscientific articles and\n14\nmonographs. He was an indefatigable hard worker, an outstanding teacher, an energetic scientific organiser and an inspiration to all those who came into contact with him. Throughout his scientific career he worked and published extensively with many other mathematicians and scientists in Russia and further afield. In addition,\n33\nof his students completed the Doctor of Science degree. His scientific interests were extensive and covered many aspects of modern mathematics. In particular, he was responsible for opening up important new mathematical directions, the development of which created the foundations of modern nonlinear analysis. ... Mark Krasnosel'skii was of noble personality, straightforward and uncompromising in matters of principle but always open minded and ready to help everyone. He was a Big Man in both body and mind. He was a superb mathematician.\nThe authors of\n[\n4\n]\nwrite:-\nThe scientific activity of M A Krasnosel'skii always went hand in hand with his pedagogical work. The desire and ability of M A Krasnosel'skii to attract gifted young people to the research activity made themselves manifest from the beginning of his research work. The reserve of scientific enthusiasm and optimism obtained by the students of M A Krasnosel'skii during the years of communication and joint research inspires them for many years. Scores of his students have scientific degrees; over thirty of them are doctors of science, professors leading their own research domains and scientific schools.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}