{
  "nome_completo": "Marshall Harvey Stone",
  "nome_curto": "Marshall Stone",
  "ano_nascimento": "1903",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stone/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "Madras (now Chennai), India",
  "biografia": "Marshall Stone\n's mother was Agnes Harvey. His father, Harlan Fiske Stone, was a distinguished lawyer who served as dean of Columbia Law school from\n1910\nto\n1923\nand was on the supreme court for\n21\nyears, serving as chief justice for the last five of these from\n1941\nto\n1946\n. The family tradition would have had Marshall follow his father's into a law career and while he attended public schools in Englewood, New Jersey, it was assumed that he would become a lawyer. He entered Harvard in\n1919\nstill intending to continue his studies at Harvard law school after first taking his bachelor's degree, but he was so enthused by the mathematics courses that he took that, by the time he graduated in\n1922\n, he began to think that it  was mathematics, not law, that would be his life. An inspired, but extraordinary, arrangement by the Harvard Mathematics Department saw him appointed as an instructor for session\n1922\n-\n23\nto see whether he would enjoy teaching mathematics and whether he would decide to take his mathematical studies further.\nIndeed he did rapidly decide that he wanted to pursue a career in mathematics and undertook research for his doctorate under\nBirkhoff\n's supervision. His doctorate was awarded in\n1926\nfor a thesis entitled\nOrdinary Linear Homogeneous Differential Equations of Order n and the Related Expansion Problems\n.  In\n1925\nhe had been appointed as an instructor in mathematics at Columbia University,and he spend two years there before being appointed to Harvard as an instructor in\n1927\n. In this latter year he married Emmy Portman; they had three children but eventually the marriage ended in divorce in\n1962\n.\nDuring the period that he was an instructor Stone's interests followed very much those of his research supervisor\nBirkhoff\n. He published eleven papers on the theory of orthogonal expansions between\n1925\nand\n1928\n. For example he published\nAn unusual type of expansion problem\n(1924)\n,\nA comparison of the series of Fourier and Birkhoff\n(1926)\n,\nDevelopments in Legendre polynomials\n(1926)\n, and\nDevelopments in Hermite polynomials\n(1927)\n. In these papers a special role is played by expansions in terms of the eigenfunctions of linear differential operators.\nIn\n1928\nStone was promoted to associate professor at Harvard. Although he would return to Harvard again in\n1933\n, Stone first accepted a post as associate professor at Yale from\n1931\nto\n1933\n. Back at Harvard as an associate professor in\n1933\n, he was promoted to full professor there in\n1937\n.\nDuring these years Stone's research took a number of different directions. From\n1929\nhe worked on self-adjoint operators in Hilbert space and included his results in the major publication of his\n662\npage book\nLinear transformations in Hilbert space and their applications to analysis\n(1932)\n.\nHalmos\nwrites about the book in\n1990\nwhen it was reprinted by the\nAmerican Mathematical Society\n:-\nThis book is a classic by now. ... In the language of the\n1990\n's the book belongs to functional analysis\n(\na subject we used to call topological algebra - didn't we?\n)\n. One of the most famous books in that subject is\nStefan Banach\n's Théorie des opérations linéaires - it too was published in\n1932\n(\nin Warsaw, when\nBanach\nwas\n30)\n. Banach begins with a chapter on\nLebesgue\nintegration followed by a chapter on metric spaces\n(\nbut I couldn't find a mention of either\nHilbert\nor Stone in his book\n)\n. Stone's book is very different in spirit, in aim, in tone, in style, in timeliness, and in applicability. The work was begun in\n1928\n, when Stone was\n25\n; it was published when he was\n29\n. A leisurely foreword tells the reader that he hopes to offer \"a detailed treatment which would start with the foundations and carry the development as far as possible in every direction ... . In order to compress the material into the compass of six hundred odd pages, it has been necessary to employ as concise a style as is consistent with completeness and clarity of statement ... .\"  After the foreword, he dives right in; there is a short meditation on what the word \"space\" might mean, followed immediately\n(\non page\n2)\nby the axiomatic definition of abstract Hilbert space.\n(\nThe only reference to\nBanach\nconcerns a\n1924\npaper in the Fundamenta.\n)\nThe work consists of ten chapters, of which the last\n(\nApplications\n)\nis more than a third of the book.\nBecause of lack of space, results from Stone's\n1930\narticle\nLinear transformations in Hilbert space III : Operational methods and group theory\n, which had appeared  in the\nProceedings of the National Academy of Sciences\n, had to be omitted. This article included the celebrated Stone-\nvon Neumann\nuniqueness theorem.\nIn\n1932\nhe proved results on\nspectral theory\n, arising from\ngroup theoretical\nmethods in\nquantum mechanics\n, which had been conjectured by\nWeyl\n. Then in\n1934\nhe published two papers on\nBoolean algebras\n:\nBoolean algebras and their applications to topology\nand\nSubsumption of Boolean algebras under the theory of rings\n. Both appeared in the\nProceedings of the National Academy of Sciences\n. These papers contain what today is called\nStone-\nČech\ncompactification theory\n. He made this study while attempting to understand more deeply the basics underlying his results on spectral theory. One particularly important result proved by Stone during this period was a substantial generalisation of\nWeierstrass\n's theorem on uniform approximation of continuous functions by polynomials. This result is now known as the\nStone-Weierstrass theorem\n.\nDuring World War II Stone undertook secret war work being attached to the Office of Naval Operations during\n1942\n-\n43\nand then the Office of the Chief of Staff of the War Department for the rest of World War II. Then in\n1946\nhe left Harvard to take up the chairmanship of the mathematics department at the University of Chicago. This did not happen easily for Stone negotiated for a year with Robert Maynard Hutchins, President of the University of Chicago, before taking up the appointment. One problem was certainly the protests from the faculty members at Chicago who wished their present chairman, Ernest P Lane, to continue in office. In\n[\n8\n]\nStone explains why he decided to leave Harvard. A major motivation was:-\n... my conviction that the time was also ripe for a fundamental revision of graduate and undergraduate mathematical education.\nStone did an outstanding job in returning this famous research school to the eminence it had previously known. First he had to overcome the resistance to his appointment from his own Department, then he had to persuade the University authorities to accept his proposals.  However\n[\n1\n]\n:-\nStone was a man of forceful character and unquestioned integrity.\nHis first argument with the university administration was over his wish to offer an appointment to Hassler\nWhitney\n. Stone won the argument, the offer was made to\nWhitney\n, but he turned it down preferring to remain at Harvard. Stone next decided to appoint\nAndré Weil\nbut he\n[\n8\n]\n:-\n... was a somewhat controversial personality, and I found a good deal of hesitation, if not reluctance, on the part of the administration to accept my recommendation.\nAgain Stone won the argument and this time the offer was accepted. This was\n[\n8\n]\n:-\n... an important event in the history of . . . American mathematics.\nStone continued to appoint leading mathematicians. Next came\nMac Lane\n, then\nZygmund\nfollowed by\nChern\n. This last appointment proved the hardest to get past the Chicago administration and Stone threatened to resign in a bid to get his own way. He wrote\n[\n8\n]\n:-\nThis was the stormiest incident in a stormy period.\nFrom\n1952\nStone stepped down as head of department in favour of\nMac Lane\nbut he remained at Chicago until he retired in\n1968\n. He then accepted a professorship at the University of Massachusetts where he worked full-time until\n1973\n, then half-time until\n1980\n. We noted above that he was divorced from his first wife in\n1962\nand he subsequently married Ravijojla Kostic.\nStone received many honours for his outstanding achievements. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1938\n, in the following year he was\nAmerican Mathematical Society\nColloquium Lecturer and he was president of the Society in\n1943\n-\n44\n. He was honoured by being named\nJosiah Willard Gibbs\nlecturer for\n1956\n, delivering a lecture on\nMathematics and the future of science\nat Rochester, New York, on\n27\nDecember\n1956\n. Stone was elected president of the\nInternational Mathematical Union\nin\n1952\n-\n54\nand he was president of the International Committee of Mathematical Instruction from\n1961\nto\n1967\n. In this capacity he founded the Inter-American Committee on Mathematical Education\n(\nComitê Interamericano de Educaçao Matemática - CIAEM\n)\nin\n1961\n.\nStone's interests, which included cooking, are described in\n[\n1\n]\n:-\nOf all Stone's many interests his love of travel was surely dominant. He began to travel when he was quite young and was on a trip to India when he died. ... Marshall Stone was a man with a very broad outlook and a wide range of interests who seems to have thought rather deeply about a number of issues. ... here was an unusually thoughtful man with a high degree of penetration and insight.  ... he seemed well endowed with a quality which I can only describe as wisdom.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Topology"
  ]
}