{
  "nome_completo": "Martin David Kruskal",
  "nome_curto": "Martin Kruskal",
  "ano_nascimento": "1925",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kruskal_Martin/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Martin Kruskal\n's father was Joseph Kruskal who was a successful businessman, the owner of Kruskal & Kruskal, a major fur wholesale  business. William's mother was Lillian Vorhaus who became famous as an expert on origami. Martin was one of five children, having two sisters and two brothers. Both brothers\nWilliam Kruskal\nand\nJoseph Kruskal Jr\nwent on to become famous mathematicians. When Martin was very young, the family moved to New Rochelle, a suburb of New York. Martin attended Fieldston High School in Riverdale, New York, and after graduating entered the University of Chicago. He obtained his B.S. from Chicago in\n1945\n, then went to New York University to study for his Master's Degree with the aim of going on to work for a doctorate.\nWe mentioned above that the Kruskal family lived in New Rochelle. There was a famous mathematician living in New Rochelle who was a near neighbour, namely\nRichard Courant\n. At this time\nCourant\nwas in the process of building his new Institute of Mathematical Sciences at New York University and was very keen to attract high quality graduate students. He soon persuaded Kruskal that he should undertake research at his new Institute and managed to obtain a position for him as Assistant Instructor in the Mathematics Department. Kruskal became an assistant in\n1946\nand, after studying for his M.S. was awarded the degree in\n1948\n. He then undertook research advised by\nRichard Courant\nand Bernard Friedman. During his time as a research student he married Laura in\n1950\n; they had three children. He submitted his thesis\nThe Bridge Theorem for Minimal Surfaces\nand was awarded his doctorate in\n1952\n. By this time, however, his assistant instructorship at New York University ended in\n1951\nand in the same year he had moved to Princeton where he had taken up a post in Project Matterhorn, which today is named the Princeton Plasma Physics laboratory\n[\n1\n]\n:-\n[\nI\n]\nt was among the first places in the world to start research on the possibility of producing useful energy from controlled thermonuclear fusion.\nIn\n1956\nhe was promoted to Associate Head of the Theoretical Division of Project Matterhorn. During this period he wrote a number of highly significant papers on plasma physics with a variety of different colleagues. These include\nExact nonlinear plasma oscillations\n(1957)\n,\nAn energy principle for hydrodynamic stability problems\n(1958)\n,\nOn the stability of plasma in static equilibrium\n(1958)\n, and\nEquilibrium of a magnetically confined plasma in a toroid\n(1958)\n. In\n1959\n, while continuing to hold his post in Project Matterhorn, Kruskal was also appointed as a lecturer in astronomy at Princeton. An important paper on astronomy was\nMaximal extension of Schwarzschild's metric\n(1960)\nwhich showed that, using what are now called Kruskal coordinates, certain solutions of the equations of general relativity which are singular at the origin are not singular away from the origin, so allowing the study of black holes.\nThe award of a National Science Foundation Senior Fellowship saw Kruskal spend\n1959\n-\n60\nat the Max Planck Institute in Munich. In\n1961\nKruskal was promoted to Professor of Astronomy at Princeton but continued his position within Project Matterhorn until\n1964\n. He spent the winter of\n1965\n-\n66\nin the USSR as part of an exchange programme. Continuing his different roles at Princeton, Kruskal was appointed as director of the Applied Mathematics programme in\n1968\n, a role he held for\n20\nyears. He had been slowly moving from physics towards pure mathematics and that move became complete in\n1979\nwhen he was appointed as Professor of Mathematics. He worked at Princeton until\n1979\nwhen he retired. However, he did not give up academic work, but rather was appointed to the newly created\nDavid Hilbert\nChair of Mathematics at Rutgers University.\nKruskal's later work studied soliton equations, asymptotic analysis, and surreal numbers. He was led to asymptotic analysis in his plasma physics studies and from there to solutions of Hamiltonian equations as in\nAsymptotic theory of Hamiltonian and other systems with all solutions nearly periodic\n(1962)\n. In\n1965\n, he and N J Zabusky wrote\nInteraction of \"Solitons\" in a Collisionless Plasma and the Recurrence of Initial States\n. This publication was a highly influential piece in the study of nonlinear wave equations and solitons and has been cited nearly\n6000\ntimes. Analysing asymptotic series also led Kruskal to become interested in surreal numbers, generalisations of real numbers introduced by\nJohn Conway\n. Kruskal's important paper\n(\nwritten jointly with Clifford S Gardner, John M Greene and Robert M Miura\n)\nKorteweg-de Vries equation and generalizations. VI. Methods for exact solution\npublished in\n1974\nwas fundamental, and the ideas developed in it were later extended to dynamical systems, inverse scattering, and symplectic geometry. He was awarded the\nAmerican Mathematical Society\n's Steele Prize for a Seminal Contribution to Research in\n2006\n. The prize was awarded jointly to Kruskal and Gardner for the above mentioned\nKorteweg\n-\nde Vries\npaper. The citation reads:-\nThis is a fundamental paper in the theory of solitons, inverse scattering transforms, and nonlinear completely integrable systems. Before it, there was no general theory for the exact solution of any important class of nonlinear differential equations. In applications of mathematics, solitons and their descendants\n(\nkinks, anti-kinks, instantons, and breathers\n)\nhave entered and changed such diverse fields as nonlinear optics, plasma physics, and ocean, atmospheric, and planetary sciences. Nonlinearity has undergone a revolution: from a nuisance to be eliminated, to a new tool to be exploited.\nThis was certainly not the first honour that Kruskal had received. The\nAmerican Mathematical Society\nawarded him their\nGibbs\nlectureship in\n1979\n. He was elected to the\nNational Academy of Sciences\nin\n1980\nand to the\nAmerican Academy of Arts and Sciences\nin\n1983\n. In the same year he received the Dannie Heineman Prize in Mathematical Physics. In\n1986\nhe received the Potts Gold Medal of the Franklin Institute and then the\nNational Academy of Sciences\nAward in Applied Mathematics and Numerical Analysis in\n1989\n. He received the President's National Medal of Science in\n1993\n. The medal was presented by President Clinton and Vice President Gore at a ceremony on the White House South Lawn on\n30\nSeptember:-\nFor his influence as a leader in nonlinear science for more than two decades as the principal architect of the theory of soliton solutions of nonlinear equations of evolution.\nIn\n1997\nKruskal was elected to the\nRoyal Society of London\n, in\n2000\nhe received an honorary doctorate from Heriot-Watt University in Edinburgh, Scotland, and in\n2001\nhe was elected an Honorary Fellow of the\nRoyal Society of Edinburgh\n.\nThe authors of\n[\n1\n]\nwrite:-\nFinally we mention two of Martin Kruskal's deep interests apart from mathematics: limericks and origami. For years, as director of the Program in Applied Mathematics at Princeton, he wrote an appropriate original limerick to appear on the announcement of the applied mathematics colloquium for each speaker. His interest in origami was motivated by his wife Laura, a world renowned creator and teacher of origami, and his mother, the late Lillian Oppenheimer, who founded the Origami Center of America.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}