{
  "nome_completo": "Mary Celine Fasenmyer",
  "nome_curto": "Mary Fasenmyer",
  "ano_nascimento": "1906",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fasenmyer/",
  "lugar_nascimento": "Crown, Pennsylvania, USA",
  "lugar_morte": "Erie, Pennsylvania, USA",
  "biografia": "Mary Fasenmyer\n's parents were George and Cecilia Fasenmyer who were devoted Roman Catholics. George Fasenmyer owned an oil lease in Crown, Pennsylvania and he ran his own business from there. Mary's mother Cecilia died when she was only one year old. Three years later George remarried and his new wife was Josephine who was\n25\nyears younger than her husband.\nMary was sent to school in Titusville, a town in Crawford county north-western Pennsylvania about\n30\nmiles from Crown. There she attended St Joseph's Academy which was a Roman Catholic school. As an aside we note that the world's first successful oil well was drilled beside Titusville in about\n1860\nand this marked the start of a Pennsylvania oil boom of which, of course, Mary's father was a part.\nAt St Joseph's Academy Mary showed her mathematical talents but after she graduated in\n1923\nthere was no university education for her. Rather she began to teach and for the next ten years that is what she did. However she studied at the Catholic Mercyhurst College in Erie, Pennsylvania after its foundation in\n1926\n. Mercyhurst College was run by the Sisters of Mercy which was a Roman Catholic religious congregation founded in Dublin in\n1831\n. The Sisters of Mercy had spread through the English speaking world and they ran many colleges and high schools in the United States. In\n1933\nFasenmyer was awarded an A.B. by Mercyhurst College and in the same year she took her vows and joined the Sisters of Mercy becoming Sister Celine.\nThe Sisters of Mercy had a strong programme of education as well as social and medical programmes which cared for the sick, old people and orphans, both in their homes and in hospitals. As part of their education programme Sister Celine was sent to Pittsburgh to teach at St Justin's High School. Later the Sisters of Mercy sent her to undertake graduate studies at the University of Pittsburgh.\nFirst she studied for her Master's Degree and for this she specialised in mathematics but also took physics as a minor subject. In\n1937\nshe was awarded the degree but later, in\n1942\n, she returned to her studies at the University of Pittsburgh to work for her doctorate in mathematics. There her doctoral studies were supervised by Earl Rainville who suggest that she examine some combinatorial problems related to\nhypergeometric series\n. In her thesis she gave algorithms to find recurrence relations between sums of terms in hypergeometric series. Sister Celine was awarded her doctorate in\n1946\nafter writing an excellent thesis.\nSister Celine published just two mathematical papers. The first of these was\nSome generalized hypergeometric polynomials\nwhich appeared in the\nBulletin of the American Mathematical Society\nin\n1947\n. It examined certain special sets of generalized hypergeometric polynomials containing as special cases\nLegendre\n's,\nJacobi\n's,\nBateman\n's polynomials, and others. In this paper some pure recurrence relations, contiguous polynomial relations and integral relations are stated without proof.\nThe second of the two papers was\nOn Recurrence Relations\nwhich was published in\n1949\nin the\nAmerican Mathematical Monthly\n. This paper, which did not arouse much interest at the time, illustrated the algorithms which she had discovered during her doctoral work, and which she had set out in detail in her thesis, by deriving a pure recurrence relation for\nBateman\n's polynomials.\nSister Celine returned to Mercyhurst College, the Sisters of Mercy's educational establishment in Erie, Pennsylvania, where she taught mathematics as a professor for many years. After her retirement from Mercyhurst College she lived in a Catholic retirement home in Erie. Although involved in teaching mathematics for her whole career, she engaged in no further research and it is doubtful whether she was aware that the work in her thesis eventually proved to be important until after she retired.\nIn fact the results did reach a wider audience in\n1960\nwhen Sister Celine's supervisor Earl Rainville published a book\nSpecial Functions\ntwo chapters\n(\nChapters\n14\nand\n18)\nof which presented the results from Sister Celine's thesis. Although Rainville believed:-\n... that there was some very pretty mathematics going on ...\nthe significance of the results was still not properly recognised. It was only in\n1978\nthat Doron Zeilberger realised the significance and used Sister Celine's methods to prove combinatorial identities. Another mathematician Herbert Wilf, Professor of Mathematics at the University of Pennsylvania, read Zeilberger's paper:-\nI remember feeling that I was about to connect to a parallel universe that had always existed but which until then had remained very well hidden, and I was about to find out what sort of creatures lived there.\nWilf and Zeilberger then worked to push Sister Celine's methods even further to produce what today is called \"WZ theory\". It allows an extremely elegant proof of certain classes of combinatorial identities and also provides an algorithm to generate new identities from old ones. The algorithmic approach was, of course, ideally suited for use with computers and the importance of Sister Celine's original work has really come about because it has led to such powerful computer techniques. The joint publication by Wilf and Zeilberger of\nRational functions certify combinatorial identities\nin\n1990\nled to them being awarded the Steele Prize by the\nAmerican Mathematical Society\n.\nDonald Knuth\nread the Wilf and Zeilberger paper and was extremely impressed.\nKnuth\nwrote the Foreword to the book\nA=B\nwhich was published in\n1996\nby Wilf and Zeilberger in collaboration with the Slovenian mathematician Marko Petkovsek. Let us quote from this Foreword by\nKnuth\n:-\nScience is what we understand well enough to explain to a computer. Art is everything else we do. During the past several years an important part of mathematics has been transformed from an Art to a Science: No longer do we need to get a brilliant insight in order to evaluate sums of binomial coefficients, and many similar formulas that arise frequently in practice; we can now follow a mechanical procedure and discover the answers quite systematically.\nI fell in love with these procedures as soon as I learned them because they worked for me immediately. Not only did they dispose of sums that I had wrestled with long and hard in the past, they also knocked off two new problems I was working on at the time I first tried them. The success rate was astonishing.\nThe book discusses proving identities by computer and is an account of this area which Sister Celine's results form an important starting point. In fact it answers a challenge which\nKnuth\nmade in his book\nThe art of computer programming\nVol.\n1\nwhich he suggests is of equal difficulty to proving\nFermat's Last Theorem\n:-\n... develop computer programs for simplifying sums that involve binomial coefficients.\nWe have followed the story of Sister Celine's work forward because only by doing so is it possible to see the significance of the inspiration which she had in\n1945\n. However, due to Wilf, Sister Celine has now achieved the recognition that she deserves. There is a charming story told by Wilf of how he contacted Sister Mary in\n1994\n. He went to the retirement home in Erie where she lived and invited her to attend a discrete mathematics conference in Boca Raton, Florida. The diocese awarded her a travel grant and she was able to attend the conference:-\nWhen\n[\nWilf\n]\nintroduced her from the audience, the\n87\n-year-old nun slowly rose to her feet. She said she had only two remarks to make. First, she wanted to thank Professor Wilf for the invitation. And second, she said, casting a level gaze at the assemblage of distinguished mathematicians, \"I want you all to know - I really did that work.\" There wasn't a dry eye in the house.",
  "math_areas": [
    "Logic"
  ]
}