{
  "nome_completo": "Mary Frances Winston Newson",
  "nome_curto": "Mary Winston Newson",
  "ano_nascimento": "1869",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Newson/",
  "lugar_nascimento": "Forreston, Illinois, USA",
  "lugar_morte": "Poolesville, Maryland, USA",
  "biografia": "Mary Newson\nwas named\nMary Frances Winston\nat her birth, the name Newson being the name of the husband she married. She was always known as May by her friends and family. Her parents were Thomas Winston, a country doctor, and Caroline Eliza Mumford. Thomas Winston had been born in Wales but had come to the United States at the age of two years when his parents emigrated. Caroline had been a teacher before her marriage, teaching French, art and mathematics. Mary was one of her parents' seven surviving children. She was taught at home by her mother, who taught herself Latin and Greek so that she could prepare her children for a university education. Her mother had also studied geology, taking a correspondence course with the Field Museum in Chicago.\nIn\n1884\n, when she was fifteen years old, Mary and her older brother Ambrose Paré Winston\n(5\nOctober\n1867\n-\n4\nDecember\n1959)\n, who was seventeen, entered the University of Wisconsin. The University, about\n140\nkm from their home town, had admitted women from\n1863\n. Ambrose earned his bachelor's degree in\n1887\nbut Mary took a year out to teach in a high school before graduating with an A.B. from the University of Wisconsin in\n1889\n. She then taught at Downer College, a women's college in Fox Lake, Wisconsin. Downer College had been founded as Wisconsin Female College in\n1854\nas a Baptist college preparing women for missionary service. However, it was left considerable funds by Jason Downer in\n1883\nand was providing general education for women when Winston taught there. After teaching at Downer College for a year, Winston applied for a mathematics fellowship at Bryn Mawr College in Pennsylvania.\nCharlotte Scott\nwas the professor of mathematics at Bryn Mawr and she encouraged Winston to apply again for the fellowship in the following year having narrowly failed to gain the fellowship at her first attempt. Winston taught for a second year at Downer College and was awarded a fellowship to study at Bryn Mawr College in the following year. After spending the year\n1891\n-\n92\nat Bryn Mawr College, Winston decided to apply to continue her studies at the University of Chicago which was opening on\n1\nOctober\n1892\n. This was attractive to her partly because she would be returning to Illinois, but also because the mathematics department looked very attractive with professors\nEliakim Hastings Moore\n,\nOskar Bolza\n, and\nHeinrich Maschke\n.\nWinston was awarded a fellowship to study at Chicago and she spent the year\n1892\n-\n93\nthere. The International Mathematical Congress was held in Chicago in August\n1893\nand the starring attraction at this meeting was\nFelix Klein\n. Winston was a participant. A second meeting, the Evanston Colloquium, took place at Northwestern University, Evanston, Illinois from\n28\nAugust to\n9\nSeptember\n1893\n. This two-week Colloquium, attended by\n24\nmathematicians including Winston, was arranged to allow\nKlein\nto deliver a course of\n12\nlectures, one on each day. Now one thing which\nKlein\nhad to do while in the United States was to see if he could find a suitable woman to study at Göttingen. The University had decided to have a trial with women students and a decision had been made that mathematics was the area in which the experiment would be carried out and the trial would be made with a foreign woman.\nKlein\nexplained:-\nMathematics was here rendering a pioneering service to the other disciplines. With mathematics matters are, indeed, most straightforward. In mathematics, deception is least possible as to whether real understanding is present or not.\nWinston, encouraged by\nBolza\nand\nMaschke\n, was keen to study abroad. In fact\nMaschke\nwrote to Klein in April\n1893\n, before his trip to the United States, telling him about Winston's wish to study in Germany. She spoke to\nKlein\nwhile he was in the United States and he tested her to see if her understanding of mathematics, in particular of differential equations, was good enough to profit from doctoral studies. He decided that it was, but Winston required financial support to be able to study for a doctorate in Germany so she applied to the Association of Collegiate Alumnae\n(\nnow called the American Association of University Women\n)\n.\nChristine Ladd-Franklin\nhad proposed that this organisation establish a European Fellowship in\n1888\nand, when the Association of Collegiate Alumnae decided not to support Winston,\nChristine Ladd-Franklin\nwrote to her offering a grant of $\n500\nto study abroad.\nChristine Ladd-Franklin\nhad met Winston during the summer of\n1893\nwhen her husband\nFabian Franklin\nattended the Evanston Colloquium. Although she did not know whether Göttingen would accept her, Winston travelled to Germany for the beginning of the\n1893\n-\n94\nacademic year.\nOn\n15\nOctober\n1893\nWinston wrote home, explaining that\n[\n5\n]\n:-\n... people who I see here are in general very sceptical as to my chances for admission.\nOn\n17\nOctober she wrote\n[\n3\n]\n:-\nKlein\nsaid that I was to write out an application in my own name and that it was to be sent to Berlin together with that of two other ladies, one in Mathematics\n[\nGrace Chisholm\n]\nand one in physics who are also asking admission, and in the meantime we are to be admitted to the lectures. That, of course, means a great deal but there's \"many a slip\" and everything is to be done very quietly. We are to go to Prof\nKlein\n's private office before the regular time for changing classes so as not to meet the students in the halls and from there we are to go into the class. The gentleman in the Physics department ... came also and Prof\nKlein\nsat down and, with an occasional suggestion from the other gentleman, proceeded practically to write my application for me.\nWinston wrote home again on\n29\nOctober\n[\n5\n]\n:-\n[\nI\n]\nreceived this morning the official permission to study in the University of Göttingen.\nShe attended lectures by\nKlein\non '\nHypergeometric Series\n' and also lectures by\nHeinrich Weber\n. In December\n1893\nshe read the paper\nEine Bemerkung zur Theorie der hypergeometrischen Function\nin\nKlein\n's Seminar, becoming the first woman to address the seminar. She wrote home after delivering her lecture\n[\n3\n]\n:-\n... it is altogether a sufficiently difficult thing to write and read a paper in a strange language before such a gathering as Prof\nKlein\n's Seminar and before such a man as Prof\nKlein\nwithout the added difficulty of being the first woman to do it in the University. ... It went off reasonably well. I cannot say that I cast much honour on the feminine sex thereby but on the other hand I do not think that anyone will draw the conclusion from it that women cannot learn Mathematics.\nHer paper was published in\nMathematische Annalen\nin\n1895\n. It was not all work for her in Germany, however, and in January\n1894\nshe wrote home describing a hike she had been on up the Ravenskopf with the Morgensternes. This was the family she was living with, the same family with whom\nGrace Chisholm\nstayed during her time in Göttingen\n[\n11\n]\n:-\nWe took the train from Göttingen and arrived at Bad Sachsa station at the foot of the mountains at quarter of ten. ... The thermometer stood at about\n10\n° F when we left Göttingen and I suppose it was somewhat warmer when we got to the station. I felt pretty cold at first. The wind was cold and I had some misgivings as to the comfort of walking in winter time. But by the time we got to the top of the second hill we were warmed up again and did not suffer from the cold at all. ... The fir trees on both sides were covered heavily with snow, but as yet the road was pretty good. ... The sun shone very brightly, there was no wind, and altogether we could not have hoped for a better day. ... We stopped a minute or two and each ate one of the sandwiches which Frau Morgensterne had put up for us. We could not stop long, however, as our feet would get cold.\nThe Association of Collegiate Alumnae gave Winston a fellowship to fund her during the academic year\n1895\n-\n96\n. She completed her thesis\nÜber den Hermiteschen Fall der Laméschen Differentialgleichungen\n(\nOn the\nHermite\ncase of the\nLamé\ndifferential equations\n)\nin the summer of\n1896\nand was examined in July\n1896\n. She had to have the thesis published before she could be awarded a doctorate and she returned to the United States with the manuscript of the work intending to publish it there. However, no publisher in the United States was able to print the mathematical symbols in her thesis so she had to return it to Göttingen. It was published in\n1897\nand she received the doctorate magna cum laude in that year.\nGrace Chisholm\nhad been awarded a doctorate in\n1895\n, so Winston became the second woman, and the first American, student to be awarded a doctorate by Göttingen.\n[\nSofia Kovalevskaya\nwas awarded a doctorate by Göttingen in\n1874\nbut she was never allowed to enrol as a student.\n]\nAfter she returned to the United States, Winston was appointed to teach at St Joseph's High School in St Joseph, Missouri in September\n1896\n. After a year she was appointed as Head of Mathematics at Kansas State Agriculture College in Manhattan, Kansas. This was  not quite as grand as it sounds, since she was the only member of the department.\nIn\n1897\n, she was one of the first women to join the\nAmerican Mathematical Society\n. See\nTHIS LINK\n.\nShe was married on\n21\nJuly\n1900\nto Henry Byron Newson in Chicago. Henry Newson\n(1860\n-\n1910)\nwas a professor of mathematics at the University of Kansas and had published the book\nContinuous groups of projective transformations treated synthetically\n(1895)\n. After his marriage he published the books:\nGraphic Algebra for Secondary Schools\n(1905)\n;\nThe five types of projective transformations of the plane\n(1895)\n; and\nTheory of collineations\n(1911)\n. Mary Newson, as she now became, resigned her position at the Kansas State Agriculture College and over the next ten years she brought up their three children, a daughter Caroline born in\n1901\n, a second daughter Josephine born in\n1903\nand a son Henry born in\n1909\n. Although she was not now employed as a mathematician, Winston did translate\nHilbert\n's 'Mathematical problems', which he had delivered in\n1900\n, into English and her\n40\n-page translation\n(\nmade with\nHilbert\n's permission\n)\nwas published in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1902\n.\nIn\n1910\nHenry Newson died following a heart attack. He had a history of heart problems and, as a consequence, had been unable to get insurance. He had to work\n20\nyears before his widow would qualify for a pension but he died just a few months short. This meant that Mary Newson was in an extremely difficult financial position with no income and three young children to bring up. Also working for the University of Kansas was not possible since Mary's younger sister Eugenie had just been appointed to the English Department. Mary Newson lived in Laurence, Kansas with her parents for three years after her husband died then, in\n1913\n, she was appointed as an assistant professor at Washburn College in Topeka, Kansas. It was only about\n45\nkm\n(28\nmiles\n)\nfrom Topeka to Laurence and Newson left her children to be looked after by her parents in their Laurence home while she lived in Topeka during the week but she was able to return to Laurence to spend every weekend with her children. She participated in the Kansas Association of Teachers and was chair of the Association in\n1915\n. In\n1921\nshe was appointed as Head of the Mathematics Department at Eureka College in the City of Eureka, Illinois. This College, founded in\n1855\n, admitted men and women on an equal basis\n(\nit was one of the first to do so\n)\n. Judy Green and Jeanne LaDuke write\n[\n1\n]\n:-\nNewson taught courses in both mathematics and astronomy and shared the leadership of the combined mathematics and science division from\n1928\nto\n1934\nwhen she became chairman of that division. She was required to retire from full-time teaching in\n1937\nwhen the college instituted a mandatory retirement policy, but she remained chair of the division another two years and continued teaching part-time until\n1942\n.\nIn\n1940\nshe wrote a review\n[\n7\n]\nof the book\nThomas Jefferson and Mathematics,\nby\nDavid Smith\n. After describing Jefferson's support for mathematics, she ends her review with this comment:-\nWhen we turn from these thoughts of this early leader of the Republic to the present rather precarious position of our science, we may well wish that more of our politicians and statesmen or even our leaders in education had as sound an understanding of the principles of mathematics and as correct a judgement of its followers.\nAfter she finished teaching at Eureka College, Newson moved to Lake Dalecarlia in Lowell, Indiana. This was a village beside a picturesque artificial lake which Newson loved and had spent vacations there throughout her life. In\n1956\n, when she was\n87\nyears old, she moved into a nursing home in Poolesville, Maryland, where she was close to her daughter Caroline Beshers. She died one day after the death of her brother Ambrose Paré Winston who had been a professor of economics.\nShe was honoured at the Women's Centennial Congress in New York City in\n1940\nas one of\n100\nwomen who held positions not open to women one hundred years earlier. After her death, her children founded the Mary Winston Newson Memorial Lecture on International Relations at Eureka College. The reason that the lecture is on International Relations, is that this was one of Newson's hobbies.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}