{
  "nome_completo": "Masayoshi Nagata",
  "nome_curto": "Masayoshi Nagata",
  "ano_nascimento": "1927",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nagata/",
  "lugar_nascimento": "Obu, Aichi Prefecture, Japan",
  "lugar_morte": "Kyoto, Japan",
  "biografia": "Masayoshi Nagata\n's father ran a small factory in Obu and, for several years, served on the town council. In\n1933\n, when he was six years old, Masayoshi began his schooling at the local primary school. The standard education for Japanese children at this time involved six years in primary school, followed by a number of years in middle school and finally three years in high school as a preparation for university studies. He had only just begun his studies in middle school in the nearby town of Kariya in\n1939\nwhen World War II started. Particularly as the years went by his education became disrupted with pupils being sent from the schools into the countryside to work in factories and on the land. It was also a difficult time with food shortages and bombing raids. In\n1944\nNagata completed his middle school education and began his studies at the Eighth High School in Nagoya where he was a boarder. Certainly at this stage he did not think of himself as a mathematical star\n[\n1\n]\n:-\nThough I did not think I was any good at mathematics, I liked mathematics only. ... Several of my friends seemed better at mathematics than I was. ... I do not think that I am a late bloomer. I was a usual boy who liked to think of problems in mathematics.\nImmediately after the war ended in\n1945\nfood shortages became even worse and high inflation made life incredibly difficult. Nagata entered Nagoya Imperial University in April\n1947\nand there he studied mathematics under\nTadasi Nakayama\n. It was a few years before that, in\n1942\n, that\nNakayama\nhad been appointed to Nagoya Imperial University, becoming a professor two years later. He was producing outstanding research on infinite dimensional algebras and he advised Nagata in his studies in algebra. Nagata graduated in\n1950\nbut he had already undertaken research in algebra and, resulting from this, had a number of papers in print:\n(\nwith Noboru Ito\n)\nNote on groups of automorphisms\n(1949)\n,\nOn the structure of complete local rings\n(1950)\n, and\nOn the theory of semi-local rings\n(1950)\n. In the two ring theory papers he generalised results already obtained for Noetherian rings to rings which are not necessarily Noetherian. In doing so he answered a open question by I S Cohen.\nSix months after graduating, Nagata was appointed as a research assistant in the Faculty of Science of Nagoya University. Despite the name change, this was the same university at which he had studied - Nagoya Imperial University had been renamed Nagoya University in\n1947\n. He held this position for three years, then moved to Kyoto University in May\n1953\nwhen he was appointed as an instructor. During these three years he had published many articles on ring theory and valuations\n(\nand one on group theory\n)\n, three articles appearing in each of\n1951\n,\n1952\nand\n1953\n. In Kyoto he joined the Kyoto School of\nAlgebraic Geometry\nwhich was being developed by Yasuo Akizuki and attracting many talented young mathematicians. For example\nHeisuke Hironaka\n, who won a\nFields Medal\nin\n1970\n, was in his final undergraduate year at Kyoto when Nagata arrived and he continued to work in the Kyoto School of Algebraic Geometry for the following four years.\nNagata was promoted to associate professor at Kyoto University in\n1957\nand, in February\n1963\n, was appointed to the Chair of Algebra at Kyoto succeeding Yasuo Akizuki. The authors of\n[\n2\n]\nwrite about his mathematical contributions:-\nNagata played outstanding roles, especially in the\n1950\ns and\n1960\ns, in the development of commutative algebra and algebraic geometry. Many of his contributions were through a result of producing crucial counterexamples.\nIt is worth commenting at this point that Nagata's skill in producing counterexamples led to his fellow mathematicians giving him the nickname \"Mr Counterexample\". The authors of\n[\n2\n]\ncontinue:-\nThe most famous among\n[\nthese counterexamples\n]\nis a nonfinitely generated ring of invariants for a group acting on a polynomial ring, thereby negatively solving\nHilbert\n's\n14\nth\nproblem in\n1958\n.\nIn fact Nagata announced his negative solution to\nHilbert\n's\n14\nth\nproblem in his invited lecture\nOn the fourteenth problem of Hilbert\nat the International Congress of Mathematicians held in Edinburgh, Scotland, in August\n1958\n. The authors of\n[\n2\n]\ncontinue:-\nAnother\n[\ncounterexample\n]\nis a complete nonsingular\n3\n-dimensional algebraic variety that cannot be embedded in any projective space. ... A series of papers in the late\n1950\ns on algebraic geometry over\nDedekind\ndomains laid the foundation for later developments of algebraic geometry in terms of schemes. The concept of the Henselization of rings, developed in a series of papers in the\n1950\ns, turned out to be fundamental for algebraic spaces and étale topology. The completion of algebraic varieties - that is, embedding of algebraic varieties as open subvarieties of complete varieties - published in his paper in\n1962\n, remains one of the basic techniques in algebraic geometry.\nAs well as this outstanding research contribution, Nagata is famed for his outstanding books. With Yosikazu Nakai, he published\nAlgebraic geometry\n(\nJapanese\n)\nin\n1957\n. T Kambayashi writes:-\nIf you can read Japanese, know some algebraic geometry already and have enough nerves not to mind the five-page errata, then you will greatly enjoy reading this book.\nNagata's most famous book,\nLocal rings\n, appeared in\n1962\n. R C Hartshorne begins a review as follows:-\nThis authoritative work, by an expert in the field, gives a complete up-to-date account of the theory of local rings, starting from the beginning. The early part of the book contains basic results of commutative algebra, often with new proofs. The latter part of the book treats the advanced theory of local rings, reuniting most of the results of the author's many research papers, and containing some new results, notably concerning pseudo-geometric rings.\nIt is worth noting that the Noetherian rings which Nagata calls 'pseudo-geometric rings' in this book are now known as 'Nagata rings'. A number of Nagata's books are based of lecture courses he gave at different institutions.\nLectures on the fourteenth problem of Hilbert\n(1965)\nresulted a course of lectures he gave at the Tata Institute of Fundamental Research, Bombay, in\n1964\n.\nOn flat extensions of a ring\n(1971)\nis a book in which the lectures he gave in the summer of\n1970\nat the University of Montreal as published.\nPolynomial rings and affine spaces\n(1978)\nis a written version of lectures given by Nagata in\n1977\nat Northern Illinois University.\nSome of his books came about because of a research visits but were not lecture notes.\nOn automorphism group of k\n[\nx, y\n]\n(1972)\narose as a result of Nagata's visit to Purdue University as he explains in the Preface:-\nDuring my stay at Purdue University in\n1970\n, I discussed the problem of investigating the structure of the automorphism group of polynomial rings over a field. The one variable case is nearly obvious. Although it was known that in the two variable case the group of automorphisms is generated by automorphisms of the type\n(\nx\n,\ny\n)\n↦\n(\nx\n+\nf\n(\ny\n)\n,\ny\n)\n(x, y) \\mapsto  (x + f (y), y)\n(\nx\n,\ny\n)\n↦\n(\nx\n+\nf\n(\ny\n)\n,\ny\n)\nand by linear transformations, the known proofs were not easy. Furthermore, the three variables case was completely open. For the two variables case, I could give a new proof. For the case of more variables, I understand that there are many difficulties in studying the structure of the automorphism group. I give here some comments on the general case.\nFinally we mention his texbook\nTheory of commutative fields\npublished in Japanese in\n1985\nand in English translation by the\nAmerican Mathematical Society\nin\n1993\n.\nIn\n[\n4\n]\nNagata's other contributions to mathematics are mentioned:-\nThe mathematical influence of Masayoshi Nagata is enormous not only through his research works but also through his contributions to the domestic and international mathematical communities. He played a quite active role in the mathematical community in Japan by serving as trustee of the\nMathematical Society of Japan\nand as a member of the Science Council of Japan. At the International Mathematical Union, he served as a member of the Executive Committee between\n1975\nand\n1978\nand as vice president from\n1979\nto\n1982\n.\nHe was awarded the Chunichi Cultural Prize\n(1961)\n, the Matsunaga Prize\n(1970)\nand the\nJapan Academy\nPrize\n(1986)\n. The work which led to the award of the Academy Prize is discussed in\n[\n2\n]\n. He was honoured with the Order of the Sacred Treasure, Gold and Silver Star, in November\n1998\n.\nAmong Nagata's students, we must mention\nShigefumi Mori\nwho studied for his doctorate with Nagata at Kyoto between\n1975\nand\n1978\n.\nMori\nwas awarded a\nFields\nMedal in\n1990\nat the International Congress of Mathematicians held in Kyoto. In fact\nMori\nwas appointed to a chair at Kyoto University in\n1990\n, the year in which his former supervisor Nagata retired. Nagata died of cancer at the age of\n81\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}