{
  "nome_completo": "Matthew Stewart",
  "nome_curto": "Matthew Stewart",
  "ano_nascimento": "1717",
  "ano_morte": "1785",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stewart/",
  "lugar_nascimento": "Rothesay, Isle of Bute, Scotland",
  "lugar_morte": "Catrine, Ayrshire, Scotland",
  "biografia": "Matthew Stewart\n's father was Dugald Stewart, minister of Rothesay, and his mother was Janet Bannatyne. Matthew attended a grammar school on the Isle of Bute, then in\n1734\nhe began to work under\nSimson\nat the University of Glasgow. In\n1741\nhe moved from working under one outstanding Scottish mathematician to working under another outstanding Scottish mathematician when he began to study with\nMaclaurin\nat the University of Edinburgh. During this time, however, he continued to correspond with\nSimson\n, who was by now a friend rather than a teacher, on Greek geometry.\nSimson\nwas working trying to restore the\nPorisms\nof\nPappus\nand while Stewart was studying in Glasgow he had impressed\nSimson\nby coming up with some brilliant ideas on the\nPorisms\n.\nSimson\nwrote to Stewart on\n27\nDecember\n1742\n[\n5\n]\n:-\nI renew the desire I made to you when last here that you would not communicate these things till I see you at least. In the mean time I wish you would as your leisure can permit find out as many as may be of them, and be sure to write down both analysis and composition, because when I publish an account of the \"Porisms\" I shall be glad to have your store to increase mine which shall every one of them be particularly acknowledged in the book.\nThis certainly pleased the young man who replied to\nSimson\non\n30\nDecember\n1742\nsaying he expected to have up to twenty new results\n[\n5\n]\n:-\nI was not resolved to publish any of my Propositions in the form of Porisms, though that was the form I thought several of them ought to appear in, but as you was pleased to let me know that you had some thoughts of publishing something on the subject soon I was resolved as much as possible to avoid any thing that would seem to have the least tendency of this.\nTweddle writes in\n[\n3\n]\n:-\nSimson's next letter to Stewart is dated\n3\nJanuary\n1743\n. In it he makes various suggestions for the publication of Stewart's results - an Appendix to the \"Plane loci\", incorporation in the proposed work on \"Porisms\", or some in one and some in the other - and he reiterates his concern for confidentiality ...\nIn May\n1743\nStewart spent several weeks in Glasgow working on mathematics with\nSimson\nand assisting him in the production of his text\nPlane loci\n. He returned to Rothesay, Isle of Bute, where his father put pressure on him to join the ministry. Tweddle writes\n[\n3\n]\n:-\nThe direct link between\nSimson\nand Stewart had been broken and this presumably contributed to the further delay in the publication of \"Plane loci\" and\nSimson\n's failure to publish his work on \"Porisms\".\nStewart was licensed to preach at Dunoon in May\n1744\n, then one year later he became a minister at Roseneath, Dumbartonshire.\nStewart's fame is based on\nGeneral theorems of considerable use in the higher parts of mathematics\n(1746)\n, described by\nPlayfair\nas:-\n... among the most beautiful, as well as most general, propositions known in the whole compass of geometry.\nHe resigned as minister at Roseneath when he was appointed to\nMaclaurin\n's chair at Edinburgh in September\n1747\n.\nMaclaurin\nhad left to serve the troops in the Jacobite rebellion of\n1745\nand died in June of the following year. Tweddle writes\n[\n3\n]\n:-\n... the success of\n[\nGeneral theorems\n]\nwas largely instrumental in his being elected to the Chair ...\nStewart married Marjorie Stewart, the only daughter of Archibald Stewart writer to the signet, on\n20\nMay\n1750\n. They had several children who died as infants, but only one son survived, namely\nDugald Stewart\nwho went on to achieve more fame than his father.\nDugald Stewart\n, who was born on\n22\nNovember\n1753\n, went on to become a mathematician and philosopher who was the major exponent of the Scottish \"common sense\" school of philosophy.\nIn\n1756\nStewart wrote on\nKepler\n's second law of planetary motion using geometrical methods. In this he solved\nKepler's problem\nwhich involved determining the area of a focal sector of an ellipse. In\n1761\nhe wrote\nTracts, Physical and Mathematical, Containing an Explication of Several Points in Physical Astronomy\ndescribing planetary motion and the perturbation of one planet on another. In this work he made some contributions to the extremely difficult and important\nthree body problem\n. Two years later, he wrote the supplement\nThe Distance of the Sun from the Earth determined by the Theory of Gravity\n. This work achieved the rather inaccurate result of\n119\nmillion miles\n(\nthe correct value is approximately\n93\nmillion miles\n)\n. His geometrical methods required too many simplifications to get a better result and this work was criticised by\nJohn Landen\nin\n1771\n.\nStewart was elected a fellow of the\nRoyal Society\non\n21\nJune\n1764\n. In\n1772\nhis health began to deteriorate and his duties as professor at Edinburgh were taken over by his son Dugald. However he\n[\n2\n]\n:-\n... was a founder member of the\nRoyal Society of Edinburgh\n, being elected a fellow of the first meeting of its physical class on\n3\nNovember\n1783\n.\nHe was honoured by the University of Glasgow with the award of an honorary degree in\n1756\n. We should also note that his fame was considerable and\n[\n2\n]\n:-\n...\nMichel Chasles\nranked\n[\nSimson\nand Stewart\n]\namong the most important contributors to the progress of geometry.\nAfter the death of his father,\nDugald Stewart\nresigned from the Chair of Mathematics at Edinburgh when he was appointed Professor of Moral Philosophy at Edinburgh.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}