{
  "nome_completo": "Matteo Bottasso",
  "nome_curto": "Matteo Bottasso",
  "ano_nascimento": "1878",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bottasso/",
  "lugar_nascimento": "Chiusa di Pesio (Cuneo), Italy",
  "lugar_morte": "Messina, ItalyMessina, Italy",
  "biografia": "Matteo Bottasso\n's parents were Vincenzo Bottasso and Caterina Musso. Vincenzo was a merchant living with his wife Caterina in Chiusa di Pesio, at No.\n1\npiazza Nuova, when their son Matteo was born. The town of Chiusa di Pesio is about\n15\nkm south east of the city of Cuneo in Piedmont. As a child Matteo showed a great love for learning and, although this required many sacrifices by the family, his parents decided that they had to give him a good education. He attended the Technical Institute of Genoa and, in\n1897\n, he won a scholarship which funded his studies at the University of Turin.\nHe matriculated at the University of Turin in\n1897\nand he showed his quality as a mathematics student by winning several awards and scholarships. At the same time as he was studying for his degree, he was also working for a mathematics teaching qualification at the School of Education. He graduated with honours in mathematics from the University of Turin on\n5\nJuly\n1901\n, having gained the highest possible grade, and gained his teaching certificate four days later. After graduating, he was appointed assistant professor in projective geometry at the University of Turin where he taught for three years. In fact at Turin he was an assistant to\nGino Fano\nwho had been appointed as a professor at the university in\n1901\n. He published his first paper\nSopra le coniche bitangenti alle superficie algebriche\nⓉ\n(\nOn the conical bitangential algebraic surface\n)\nin\n1903\nthen, in\n1904\n, he was awarded a scholarship from the Collegio Carlo Alberto to allow him to improve his knowledge of mathematics by attending courses by\nHenri Poincaré\nand\nÉmile Picard\nat the higher education institutes in Paris.\nArriving back in Italy Bottasso was appointed as an assistant professor of projective geometry at the University of Bologna. After three years in this post he had a number of different positions to which he was appointed after winning competitions: he was a professor in the Technical School of Racconigi\n(\nRacconigi is a town in the province of Cuneo in Piedmont,\n40\nkm south of Turin\n)\n, a professor in the Technical School of Susa\n(\na town which is also in Piedmont,\n50\nkm west of Turin\n)\nand then at the Technical School of Turin. Following this series of appointments, he became a lecturer in algebra and analytic geometry at the University of Pavia\n(\nthe city is\n35\nkm south of Milan\n)\n. It was only during his time in Pavia that he resumed publishing mathematical papers with his second and third papers\nI caratteri d'un piano multiplo ciclico la cui curva di diramazione è irriducibile e generale nel suo ordine\nⓉ\n(\nThe characters of a cyclic multiple plane whose branch curve is irreducible, and is of general order\n)\n(25\npages\n)\nand\nAlcune singolarità elementari d'un piano multiplo ciclico la cui curva di diramazione è irriducibile\nⓉ\n(\nSome elementary singularities of a cyclic multiple plane whose branch curve is irreducible\n)\n(26\npages\n)\nboth appearing in\n1909\nin the Proceedings of the Accademia delle Scienze di Torino. In\n1910\nhe was appointed as a professor at the Turin Military Academy, a post he held until\n1916\nwhen courses for officers were abolished. From October\n1915\nto January\n1917\nhe taught mathematics in the Royal Technical Institute \"M Buniva\" in Pinerolo\n(\na town about\n35\nkm southwest of Turin\n)\n, being an extraordinary professor for the first year. Finally, not long before his death, he was appointed professor of rational mechanics and mathematical-physics at the University of Messina.\nBottasso studied\ndifferential geometry\nand mechanics but also made contributions to actuarial and financial mathematics. In his paper\nAlcune applicazioni delle formule di Fernet\nⓉ\n(\nSome applications of the formulas of Fernet\n)\n(\nAtti Acc. Sci. Torino,\n1911)\nhe pointed out:-\n... the simplicity and the quickness of vector calculus in the approach to different problems for which Cartesian methods are too difficult.\nHe used the vector calculus in studying problems in geometry, mechanics and physics. He worked with\nCesare Burali-Forti\nand\nRoberto Marcolongo\non the\nAnalyse vectorielle générale\nⓉ\n(\nGeneral vector analysis\n)\n, by writing the volume\nAstatique\nⓉ\n(\nStatics\n)\n.\nGiuseppe Peano\nwrites in a review:-\nThe perspicuity of exposition, based on the ingenious use of a single homography, has allowed the author to bring together a wealth of material in a short space. The meticulous care used in discussing and characterizing, in a subtle geometric sense, the different special cases, to cover all the issues, and finally, the many new and elegant properties, make this little volume, which also fills a gap in our mathematical literature, very interesting.\nIn the paper\nIl teorema di Rouché-Capelli per i sistemi di equazioni integrali\nⓉ\n(\nRouche-Capelli's theorem for systems of integral equations\n)\n(\nAtti Acc. Sci. Torino,\n1912)\nBottasso underlined the analogy between vector homography and\nintegral equations\n, and used vector homography to solve integral equations. In\n1913\n, for his excellent contributions, he was awarded a mathematics prize, the Ministerial Prize, by the\nAccademia Nazionale dei Lincei\n. He was also honoured with election to the Academia pro Interlingua in\n1915\n.\nHe was a lecturer at the\n'Conferenze matematiche'\n, designed to update secondary school teachers of mathematics, organised by\nGiuseppe Peano\nand\nTommaso Boggio\nat the University of Turin between\n1915\nand\n1916\n. Bottasso gave lectures to the high school teachers on numerical calculus in March\n1915\n.\nAn interesting episode regarding Bottasso reported in the paper\nLa Valle Pesio\nrelating to the time when he was teaching at the Turin Military Academy. This is quoted in\n[\n1\n]\n:-\nOne night - reports the columnist D.G. - I was with many of my friends, students of the Military Academy under the arcades of Via Po in Turin. We were talking animatedly and cheerfully. All of a sudden everyone was silent and stiffened in a greeting worthy of a general. I turned and saw that professor Bottasso was passing. Seeing me with his pupils, he greeted me as we greet people from Chiusa away from their valley. The students realized that I knew him and were very generous with their praise and admiration for their teacher.\nLionello Bottasso, writing about his grandfather Matteo Bottasso in\n[\n1\n]\n, describes his character:-\n[\nHe\n]\nis remembered as a warm person, even if a little shy. He loved the life of his country ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}