{
  "nome_completo": "Maurice George Kendall",
  "nome_curto": "Maurice Kendall",
  "ano_nascimento": "1907",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kendall_Maurice/",
  "lugar_nascimento": "Kettering, Northamptonshire, England",
  "lugar_morte": "Redhill, Surrey, Emgland",
  "biografia": "Maurice Kendall\n's father, John Roughton Kendall, was an engineering worker who was brought up in Kettering, while his mother was Georgina Brewer who came from Hertfordshire. As a young boy Maurice sometimes helped his grandfather who owned a public house, The Woolsack, in Kettering. It is rather a miracle that Maurice ever survived to adulthood, for he contracted cerebral meningitis, a disease which at that time was almost always fatal.\nIn\n1914\nWorld War I started and Maurice's father moved to Derby to work for Rolls Royce. It was in Derby that Maurice received his early education but he showed little signs of the great academic achievements which were to come. He sat the entrance examinations for Grammar School but did not gain admission, so he went to Derby Central School. His early interests were in languages but near the end of his secondary schooling he began to show an aptitude for mathematics. The Headmaster of the Central School must be given much credit for making the highly unusual move of arranging for Maurice to attend the Grammar School in his final year.\nIt is rather remarkable that Maurice's improvement was such that he was awarded a scholarship to study at St John's College, Cambridge. His father, however, did not want his son to go to Cambridge, but rather he wanted him to train as an engineer. Maurice was always extremely grateful to his mother who supported him in wishing to take up the scholarship.\nStuart writes in\n[\n4\n]\n:-\nLife at St John's was in striking contrast to that in Derby, and Maurice's naturally gregarious nature brought him several circles of friends apart from the group reading mathematics at St John's ...\nTwo interests outside mathematics were cricket and chess. One of his close friends, who shared his interest in chess, was\nBronowski\n. Of the staff, he got to know\nMacMahon\n, who was a Fellow of St John's but very elderly, but failed to ever come in contact with\nYule\nat this time despite\nYule\nbeing a lecturer and Fellow of St John's. Kendall graduated a mathematics\nWrangler\nin\n1929\nand, in the following year, he passed the Civil Service Examinations and joined the Ministry of Agriculture,\nIt was at the Ministry of Agriculture that Kendall became involved in statistical work. The quality of this work was such that he was elected a Fellow of the\nRoyal Statistical Society\nin\n1934\n. One of his first papers came about because of his work at the Ministry of Agriculture and was on factor analysis applied to crop productivity. In\n1935\nKendall met\nYule\nfor the first time. He spent part of his holidays reading statistics books at the St John's College library and he had to seek out\nYule\nwho had the key to the library. Their brief conversation would prove significant for when\nYule\ndiscussed a revision of his text\nAn Introduction to the Theory of Statistics\n(\nfirst published in\n1911)\nwith his publisher the suggestion was made that a second author might be brought in to help\nYule\n.\nYule\nremembered his meeting with Kendall and after discussions joint authorship of a new edition was agreed, the work being undertaken in\n1937\n. It is worth noting that by\n1950\nthe\n14\nth\nedition of this book had appeared.\nThis work prompted an even greater enthusiasm for statistics from Kendall who attended lectures in advanced statistical topics at University College London, and began publishing a stream of high quality papers on statistical topics. An advanced treatise on mathematical statistics was proposed in\n1939\nand Maurice Kendall,\nEgon Pearson\n,\nJohn Wishart\n, and others held preliminary discussions. However, the project came to nothing with the outbreak of war since the various authors were dispersed around the country. Kendall remained in London and in\n1940\nleft the Civil Service to take up the post of statistician to the British Chamber of Shipping. As Ord writes in\n[\n3\n]\n:-\nDespite his heavy workload by day and air-raid warden duties by night, he somehow contrived to find time to work on the project\n[\nthe advanced treatise on mathematical statistics\n]\nsingle-handedly Volume One of the Advanced Theory of Statistics was published in\n1943\n, and Volume Two appeared in\n1946\n.\nIn\n1994\n, more than ten years after Kendall's death, the sixth edition which is now called\nKendall's advanced theory of statistics Vol.\n1\nappeared authored by Alan Stuart and Keith Ord. The preface states:-\nIt is fifty years since the first edition of Maurice Kendall's Volume\n1\nappeared, so it is fitting that a new edition sees a major restructuring of The advanced theory that, we hope, remains true to his two goals of presenting a 'systematic treatment of\n(\nstatistical\n)\ntheory as it exists at the present time' and keeping the volumes first and foremost as a treatment of 'statistics, not statistical mathematics'.\nKendall continued a remarkable stream of research papers on topics such as the theory of k-statistics, time series, and rank correlation methods and a monograph\nRank Correlation\nin\n1948\n. In\n1949\nhe accepted the second chair of statistics at the London School of Economics. He held this post until\n1961\nwhen he resigned to take on the position of Managing Director of a computer consultancy which became SciCon. He later became Chairman of the company.\nIn\n1972\n, having reached\n65\nyears of age, he retired from SciCon. He most certainly did not retire from work, however, for in that year he took on the role of Director of the World Fertility Survey. The survey was carried out for the United Nations working with the International Statistical Institute. In\n1974\nhe was knighted for his services to statistics, and in\n1980\nthe United Nations awarded him their Peace Medal for his work on the World Fertility Survey.\nWe have mentioned above some of Kendal's work and some of the textbooks which he wrote. Among other publications which he edited\n(\nsome jointly\n)\nwere the two volume\nStatistical Sources in the United Kingdom\n(1952\n,\n1957)\n,\nDictionary of Statistical Terms\n(1957)\nwhich followed his aim of making new ideas in statistics more widely available, and\nBibliography of Statistical Literature\nwhich appeared in three volumes\n(1962\n,\n1965\n,\n1968)\n.\nThere are many more major texts by Kendall and their importance and popularity is seen by the number of editions which have appeared over the years and continue to appear many years after his death. For example the fifth edition of\nRank Correlation\nappeared in\n1990\nwhile we mentioned above that the first edition appeared in\n1948\n. Other monographs are\nA course in the geometry of\nn\nn\nn\ndimensions\n(1961)\nwhich aims to present that part of the theory of\nn\nn\nn\n-dimensional geometry which has statistical applications, and to sketch very briefly what those applications are. Indeed the brief aim is achieved for the book only contains\n63\npages. In\n1963\nhe published\n(\njointly with\nP A P Moran\n)\nGeometrical probability\nfollowed by\nTime series\n(1973)\nin which Kendall states his objectives to bridge the gap between \"sophisticated theory and practical applications\" in the field of time series and to \"treat the subject in its entirety for the benefit of the practising statistician\". He also published\nA course in multivariate analysis\nand\nCluster analysis\nas well a whole series of articles\nStudies in the history of probability and statistics\n.\nHis character is described in\n[\n1\n]\nas follows:-\nKendall was above all a great systematizer and organizer, whether of his own and others' theoretical work or of the practical administrative tasks that scientific work requires. ... He was a model in other ways, shunning personal controversy, taking pains to be fair to the young as well as the old, knowing when and how to delegate responsibility, and writing always in a transparent, balanced prose rarely achieved by scientists.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}