{
  "nome_completo": "Maurice Stevenson Bartlett",
  "nome_curto": "Maurice Bartlett",
  "ano_nascimento": "1910",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bartlett/",
  "lugar_nascimento": "Chiswick, London, England",
  "lugar_morte": "Exmouth, Devon, England",
  "biografia": "Maurice Bartlett\n's parents were William Stevenson Bartlett and Eva White. William Bartlett was a clerk when Maurice was born; he was the youngest of his parents' three children, having two older siblings Connie and Gerald. Maurice was four years old when World War I broke out and his father joined the army. The family had always been relatively poor but with William away from home the family were in even more financial difficulties. Eva took in a lodger to provide enough money to feed the children. Maurice did not shine at elementary school, and he was considered quite slow on the uptake. This, however, must have been an impression created by his nature rather than his abilities for he won a scholarship to attend the prestigious Latymer Upper School, in King Street, Hammersmith, London. This was\n(\nand still is\n)\na famous selective independent school with a great reputation dating back to its founding by Edward Latymer in\n1624\n. He wrote\n[\n1\n]\n:-\nMy interest in\nprobability\nbegan at school with the chapter in Hall and Knight's 'Algebra'.\nHe also enjoyed sports, particularly tennis and cricket. His parents thought that he should leave school and get a job when he reached the age of sixteen, but\n[\n44\n]\n:-\n... the headmaster of Latymer summoned them to his office to impress upon them the desirability that the young Bartlett should continue his education. The headmaster also secured a continuation of the grant.\nAfter graduating from Latymer Upper School, he took up the state scholarship he had been awarded to study at Queens' College, Cambridge, in\n1929\n. He studied the Mathematical Tripos and, in his first year, took an analysis course taught by\nFrank Ramsey\n. He was enjoying the rigour combined with simplicity that Ramsey's lectures contained but sadly the course stopped when\nRamsey\ntook ill\n(\nand died soon after\n)\n. For Part III of the tripos, Bartlett was able to take a number of courses which were of particular interest in containing significant amounts of statistics. In fact this was a quite significant time for statistics at Cambridge for, when\nUdny Yule\nretired from his Cambridge lectureship in Statistics in\n1931\n, there was a reorganisation of statistics teaching at the university. A Readership in Statistics was created in the Faculty of Agriculture to teach courses in that Faculty and courses in Mathematics. A separate lectureship in Economic Statistics was also created.\nJohn Wishart\nwas appointed to the Readership in the Faculty of Agriculture and the first time he gave his Part III course on 'Statistics' Bartlett took the course.\nWishart\nhad both a flair for mathematical statistics and a flair for very practical applications of experimental design and his course had a major influence on Bartlett. He took other courses with a statistical content in Part III, for example 'Combination of Observations' given by\nArthur Eddington\n, and 'Statistical Mechanics' given by\nRalph Fowler\n. Although Bartlett enjoyed these courses and had graduated as a\nWrangler\nin\n1932\n, they did not encourage him into an academic life\n[\n1\n]\n:-\nAt that time, as my undergraduate days at Cambridge drew to an end, I was anxious to be finished with study, and what I felt to be a surfeit of mathematics, and to get a job; I elected to try for the Home Civil Service\n(\nadministrative grade\n)\n, with the Inland Revenue as a second string. Statisticians were not recognised as such in the Civil Service until later, and although statistics was a subject in the Home Civil Service examination it was, with its\n100\nmark maximum, insufficient to make up my required quota, and I was obliged to take physics instead. I did well in the Inland Revenue examination, but was not good enough in the Home Civil Service to qualify for a vacancy\n(\nno mathematicians were that year, a change of examiners making things more difficult for us\n)\n.\nWe should note that he had made these decisions despite having his first paper\nDistribution of second-moment statistics in a normal system\n, a joint work with\nJohn Wishart\n, appear in print in\n1932\n. Although offered a position in the Inland Revenue, Bartlett took the opportunity to stay at Cambridge for another year presented to him when his scholarship was extended. He thought that he would continue his studies for this extra year and then try again in the Home Civil Service examination. He became\nWishart\n's first postgraduate student and, in\n1933\n, as well as the two single-authored papers\nProbability and chance in the theory of statistics\nand\nOn the theory of statistical regression\n, he published a second joint paper with\nWishart\nentitled\nGeneralised product moment distributions in a normal system\n. This was a highly successful year for Bartlett, and he was awarded the\nRayleigh\nPrize. Also, during this year,\n[\n1\n]\n:-\n... I attended further lecture courses for \"fun,\" including\nEddington\n's \"Relativity\" and\nDirac\n's \"Quantum Mechanics,\" as well as Colin Clark's \"Statistical Sources\"\n(\nwhich I found rather dull\n)\nand\nUdny Yule\n's \"Vital Statistics\"\n(\nstill given in spite of his retirement\n)\n.\nIn addition to this high level of activity, at\nYule\n's suggestion, he submitted an essay\nMortality and the trade cycle\nfor the\nRoyal Statistical Society\n's competition for young statisticians\n(\nwhich did not win\n)\n[\n21\n]\n:-\nBartlett also found enough time to row for his college, and to win a competition for the design of the front cover of the college journal.\nWhen he began his postgraduate year it was with the intention of taking the Home Civil service examination again but, enthused by his postgraduate studies in statistics, he felt that a career in statistics would be more enjoyable than one in administration. Wishart recommended him to\nEgon Pearson\nwho was looking to appoint a lecturer to his new Statistics department of University College, London. Bartlett was offered the post and happily accepted, taking up the position in October\n1933\n.\nAt University College, as well as\nEgon Pearson\n, he joined\nJerzy Neyman\nand\nR A Fisher\n. It was a great opportunity for research but other aspects worried Bartlett\n[\n1\n]\n:-\n... my task of \"preaching\" statistics before having adequately learned to \"practise\" made me feel uneasy, especially as teaching as such has never been all that attractive to me.\nA frequent visitor was J B S Haldane and the two began to collaborate, writing the joint papers\nTheory of inbreeding in autotetraploids\n(1934)\nand\nTheory of inbreeding with forced heterozygosis\n(1935)\n. Bartlett felt that he wanted to become involved in statistics in a more practical way and, after only one year at University College, the opportunity arose when he was offered the position of statistician at ICI's Agricultural Research Station at Jealott's Hill. It was a move that he certainly did not regret since he regarded the four years he spent there as\n[\n1\n]\n:-\n... not only the happiest period of my life\n(\nprofessionally\n)\n, but also the most creative.\nHe explained the way that he worked\n[\n44\n]\n:-\n... you had scientists of different disciplines - chemists, biologists and so on. We'd meet together every week to discuss the problems that were involved, and there would be cooperation. At the same time, you were free to develop your own ideas.\nHe achieved remarkable advances at the Agricultural Research Station\n[\n15\n]\n:-\nDuring these years he published pioneer papers on the\n2\nby\n2\nby\n2\ncontingency table, on the geometry of the linear model, on transformations in analysis of variance, on estimation problems in factor analysis, on spatial aspects of design in field trials, as well as a remarkable group of papers on foundational problems in statistical inference and the role of the likelihood. In one of these he gave the test of homogeneity of variance that bears his name, essentially introduced marginal and conditional likelihood and investigated the adjustment to the likelihood ratio test that is also called after him.\nIn\n1937\nICI decided to cut back drastically on their research budget and, although Bartlett was offered a new job in the company, he was no longer a researcher. His productivity had been extraordinary with six papers appearing in\n1935\nfollowed by seven in each of the following two years. By the end of\n1938\nhe had\n32\npapers in print. We should make special mention of one of them, namely\nProperties of sufficiency and statistical tests\n(1937)\nwhich was reprinted in the first volume of\nBreakthroughs in Statistics\npublished in\n1992\n.\nGeorge Waddel Snedecor\nhad been appointed as director of the Statistical Laboratory at Iowa State College, Ames, when it was founded in\n1933\n. He approached Bartlett with the offer of a position in the Statistical Laboratory and Bartlett applied for leave of absence from ICI so that he could try out the new position. His request was turned down, so he decided to apply for a vacant lectureship at Cambridge. Although this was a position in mathematics, they were looking for someone with expertise in statistics. Bartlett was appointed and took up the lectureship in October\n1938\n. This was a mathematics lectureship and, although he was teaching statistics courses, he also had to teach a mechanics course and an analysis course. This was quite hard for someone who had been away from the academic world for a while, but he was hardly into his stride before World War II broke out.\nBartlett was assigned to war work relating to the development of rocketry. Certainly his statistical skills were put to good use and he analysed the effectiveness of different weapons studying the data from trials. During these war years he was moved around spending time in Fort Halstead, Sevenoaks, Wales, and London. After the war ended in\n1945\nit still took some time before life returned to normal and it was\n1946\nbefore he was able to return to take up his duties again at Cambridge. By this time he was undertaking research on time series and stochastic processes and gave a lecture course on his research interests. He spent four months, later in\n1946\n, at Chapel Hill, North Carolina, at the invitation of\nHarold Hotelling\n. There he gave a course on stochastic processes and published a mimeographed version of these lectures given at the University of North Carolina. These notes formed the basis for his famous text\nAn Introduction to Stochastic Processes with Special Reference to Methods and Application\n(1955)\n.\nIn\n1947\nBartlett was offered the Chair of Mathematical Statistics at the University of Manchester; he happily accepted. This was a new chair so he became immediately involved with syllabus design both at undergraduate level and at postgraduate level where a Statistics Diploma course was introduced. In research he developed an interest in applying statistical methods to study epidemics. On this topic he published the papers\nDeterministic and stochastic models for recurrent epidemics\n(1956)\n,\nMeasles periodicity and community siz\ne\n(1957)\n, and\nThe critical community size for measles in the United States\n(1960)\n.\nIt was in\n1957\nthat Bartlett married\n[\n44\n]\n:-\n... Sheila, daughter of C E Chapman and sister-in-law of the film actress Margaret Lockwood; Sheila had herself at one time been on the London stage. The couple had a daughter Penelope\n(\nPenny\n)\nRobinson, who survives them. Sheila died in\n1998\n, leaving a grieving but stoic Maurice in their home at Exmouth. There he spent his retirement, enjoying visits by friends, his collection of paintings and listening to music.\nEgon Pearson\nretired from his chair at University College, London, in\n1960\nand the university approached Bartlett and offered him the chair. He had been happy at Manchester and was somewhat reluctant to move but there was a certain historical prestige associated with the University College chair which made the offer irresistible. He gave his inaugural lecture\nProbability, Statistics and Time\non taking up the post. However, the administrative burden associated with a University of London chair, brought about by the college structure, was \"rather daunting\". Research became only possible in vacations but he still published two or three papers in each of the years\n1962\nto\n1966\n. In\n1967\nhe moved to Oxford to take up the new Chair of Biomathematics which had been created there. He held this position until he retired in\n1975\n.\nWe have already mentioned Bartlett's most famous book\nAn Introduction to Stochastic Processes with Special Reference to Methods and Application\n(1955)\n. Reviewers comments on this, and his other books, make interesting reading. We give a few extracts at\nTHIS LINK\nThis link also provides extracts from reviews of his other books:\nStochastic Population Models in Ecology and Epidemiology\n(1960)\n;\nEssays in Probability and Statistics\n(1962)\n;\nProbability, Statistics and Time\n(1975)\n; and\nThe Statistical Analysis of Spatial Pattern\n(1976)\n. It also contains a review of his inaugural lecture\nBiomathematics\nwhich he gave on taking up the Oxford chair. We note that throughout Bartlett's career, there was an interplay between practical and mathematical statistics. The reader will notice that reviewers came from both the practical community and from the mathematical community, and their comments often reflect the position from which they are coming.\nJoe Gani gives us a nice understanding of Barlett's character in\n[\n21\n]\n:-\nUnder his quiet and reserved exterior, there was a sensitive and kindly soul, whose good will could always be relied upon. He was scrupulously fair to colleagues and students; many of them recall with affection his gentleness and kindness to them. ... He had a marked artistic talent: about four years ago, he showed me in his home at Exmouth a very lifelike pencil sketch he had made of\nEgon Pearson\n. He appreciated paintings, and developed an enthusiasm for nineteenth century watercolours, often tracking them down in dusty sales rooms. He also loved music, and would often listen to records on his return from work.\nOf course Bartlett's remarkable achievements led to him being honoured by many different bodies. We have already mentioned above the Rayleigh Prize which he received in\n1933\n. Other honours include: elected member of International Statistical Institute\n(1949)\n; awarded the Guy Medal in Silver\n(1952)\nand the Guy Medal in Gold\n(1969)\nby the\nRoyal Statistical Society\n; elected president of the Manchester Statistical Society\n(1959\n-\n1960)\n; elected a fellow of the\nRoyal Society\n(1961)\n; elected president of the Biometric Society\n(\nBritish Region\n)\n1964\n-\n66\n; elected president of the\nRoyal Statistical Society\n(1966\n-\n67)\n; received the\nWeldon\nmedal from the University of Oxford\n(1971)\n; made an Honorary Member of the International Statistical Institute\n(1980)\n; elected a Foreign Associate of the United States\nNational Academy of Sciences\n(1993)\n; awarded honorary degrees from the University of Chicago\n(1966)\nand the University of Hull\n(1976)\n. Finally let us mention the three volumes of his papers published, with commentary, by University of Manitoba Press, under the editorship of R G Stanton and others in\n1988\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Statistics"
  ]
}