{
  "nome_completo": "Max Wilhelm Dehn",
  "nome_curto": "Max Dehn",
  "ano_nascimento": "1878",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dehn/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Black Mountain, North Carolina, USA",
  "biografia": "Max Dehn\nwrote one of the first systematic expositions of\ntopology\n(1907)\nand later formulated important problems on\ngroup presentations\n, namely the word problem and the isomorphism problem.\nLet us begin by giving some details of Max Dehn's family. His father, Maximillian Moses Dehn\n(15\nMarch\n1841\n-\n16\nApril\n1897)\n, was a medical doctor. Maximillian was one of a large family having nine siblings: Arnold, Henne Hannah, Gustav, Rudolf Joseph, Otto Carl Isaak, Hannah Bertha, Martin, Elizabeth Charlotte, and Moses Wilhelm. Maximillian married Berta Raf Hirsch\n(15\nApril\n1845\n-\n2\nFebruary\n1926)\nin Hamburg, Germany, on\n2\nMay\n1867\n. They had nine children: Rudolph Bernhard, Elizabeth Hanne Adeline, Henriette Marianne, Max Wilhelm\n(\nthe subject of this biography\n)\n, Berta Meta, Karl Arnold, George Ernst, Charlotte, and Marie Auguste. The family was racially Jewish but did not think of themselves as Jews, rather they were Germans. Max was brought up in Hamburg where he attended the Wilhelm\nGymnasium\n. This school, founded in\n1881\n, was named after emperor Wilhelm I and when Dehn attended the school it was situated on Moorweidenstrasse. This school prepared students for university and, after graduating, Dehn entered the University of Freiburg.\nAt Freiburg, Dehn studied mathematics but, as was common for students at this time, he did not spend his whole time at one university. He also studied at Göttingen where, under\nDavid Hilbert\n's supervision, he obtained his doctorate in\n1900\nfor a thesis entitled\nDie Legendreschen Sätze über die Winkelsumme im Dreieck\nⓉ\n(\nThe Legendre sets over the sum of angles in a triangle\n)\n. In this thesis he proved the\nSaccheri\n-\nLegendre\ntheorem which states that in absolute geometry the sum of the angles in a triangle is at most\n180\n°. By absolute geometry, we mean geometry satisfying the axioms of Euclidean geometry except for the parallel postulate. In August\n1900\n,\nHilbert\ngave his famous address at the International Congresses of Mathematicians held in Paris. In it he presented ten problems which he believed were important for the development of mathematics. In fact, the published version of his talk contains\n23\nsuch problems. In\n1900\nDehn solved the\n3\nrd\nof these problems namely:-\nGiven any two polyhedra of equal volume, is it always possible to cut the first into finitely many polyhedral pieces which can be reassembled to yield the second?\nDehn showed that the answer to this question is \"no\", constructing a counterexample using what is today called the 'Dehn invariant'. This was the first of\nHilbert\n's problems to be solved. He submitted his paper solving the\n3\nrd\nHilbert\nProblem to the University of Münster as his\nHabilitation\nthesis before the end of\n1900\nand, in the following year, he was appointed as a\nPrivatdocent\nat Münster. He held this position until\n1911\n. In\n1907\n, jointly with\nPoul Heegaard\n, Dehn wrote one of the first systematic expositions of topology for the\nEnzyklopädie der mathematischen Wissenschaften\n[\n2\n]\n:-\nIt offers the first systematic representation of a research direction of great depth and beauty - going back to\nEuler\n,\nGauss\n,\nListing\n,\nRiemann\n,\nMöbius\n,\nBetti\nand\nPoincaré\n- which was then called 'analysis situs' and today probably be called geometric topology.\nDehn next attempted to solve the\nPoincaré\nconjecture but, of course, he failed. However, his attempts led him to publish the paper\nÜber die Topologie des dreidimensionalen Raumes\nⓉ\n(\nOn the topology of  three-dimensional space\n)\n(1910)\nin which he discussed\n3\n-dimensional manifolds with trivial homology, constructed from the complement of the trefoil knot and various other knots. In order to study such manifolds, he constructed the\nCayley\ngraph of their fundamental groups. In\n1911\nDehn was appointed as an extraordinary professor at Kiel, and from\n1913\nuntil\n1921\nhe was a full professor at the University of Breslau. He married Antonie Landau on\n23\nAugust\n1912\n; they had three children Helmut\n(1914\n-\n2007)\n, Maria\n(1915\n-\n2013)\n, Eva Agathe\n(1919\n-\n2008)\nall born in Breslau.\nIn\n1914\nDehn published the paper\nDie beiden Kleeblattschlingen\nⓉ\n(\nThe two trefoil knots\n)\n.\nJoan Birman\ndescribes this paper in\n[\n5\n]\n:-\nWritten in\n1914\n, not long after the discovery of the fundamental group of a topological space, it tackles a simple and beautiful problem: to confirm a property of the simplest knot which is suggested by five minutes of experimentation: that the right and left trefoil knots are not isotopic. The fundamental group, very new in\n1914\n, was used by Dehn in a sophisticated fashion, via the investigation of its outer automorphism group. Having used it to prove the trefoil is not amphicheiral, Dehn's paper concludes with a brief investigation of the outer automorphism group of the fundamental group of the figure eight knot, which is amphicheiral. He identifies\n(\nas was shown later\n)\nits generators. ... before\n1984\nwe really didn't have any simple tests for non-amphicheirality, so that Dehn's work\n(\nwhich at first glance looks like the use of a cannon to kill a sparrow\n)\nremained central to the subject for nearly\n70\nyears.\nOf course,\n1914\nmarks the beginning of World War I and Dehn's career was interrupted while he served in the army from\n1915\nto\n1918\n. After military service, he returned to his position as professor at Breslau, but in\n1921\nhe was appointed to the chair of Pure and Applied Mathematics at the University of Frankfurt, succeeding\nLudwig Bieberbach\n. There he organised a famous seminar on the history of mathematics.\nAndré Weil\nwrites\n[\n4\n]\n:-\nA humanistic mathematician who saw mathematics as one chapter - certainly not the least important - in the history of human thought, Dehn could not fail to make an original contribution to the historical study of mathematics, and to involve his colleagues and students in the project. This contribution, or rather this creation, was the historical seminar of the Frankfurt mathematics institute. Nothing could have seemed simpler or less pretentious. A text would be chosen and read in the original, with an effort to follow closely not only the superficial lines but also the thrust of the underlying ideas. ... It was only later that I attended it, on subsequent visits to Frankfurt, a place I made a point of visiting as often as I could. I am not sure whether it was already in the summer semester of\n1926\nthat, during a seminar session devoted to\nCavalieri\n, Dehn showed how this text had to be read from the viewpoint of the author, taking into account both what was commonly accepted in his lifetime and the new ideas that\nCavalieri\nwas trying the best of his ability to implement. Everyone participated in the discussion, contributing what he could to the group effort.\nIn\n1932\nDehn wrote the essay\nDas Mathematische im Menschen\nⓉ\n(\nMathematical ability in humans\n)\nwhich he published in\nScientia\n, an Italian journal produced in Bologna by\nFederigo Enriques\n[\n2\n]\n:-\nIn this essay, Dehn attempted, as he wrote \"to link the science of mathematics with the whole of human activity\". According to Dehn, only a few preconditions are necessary to bring about mathematics. Mathematics, he claimed, arises of its own accord whenever mathematical emotion and logical conclusions come together - and all human beings have both capacities. Dehn thus positioned \"mathematical ability\" at a basic anthropological level. The belief that mathematics is deeply rooted in human nature, in much the same way that music is based on innate musical abilities, gave him the confidence that non-professional mathematicians could also be made to appreciate this science.\nSee the first few paragraphs of\nDehn on Mathematical abilities\nat\nTHIS LINK\n.\nOn\n30\nJanuary\n1933\nHitler came to power in Germany and on\n1\nApril there was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter the university. On\n7\nApril\n1933\nthe Civil Service Law was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired but there were exemptions for those who had fought for Germany in World War I. Dehn qualified under this exemption clause so continued to head the mathematics seminar at University of Frankfurt. However, decisions at the Nuremberg party congress in the autumn of\n1935\nmade it clear that non-Aryans would no longer be able to keep their posts even if they had served in World War I. Dehn was forced to resign but remained in Frankfurt. In\n1936\nhe sent his children out of Germany. His son Helmut went to the United States and his daughters Maria and Eva were sent to England to continue their education. Dehn lectured in a number of European countries over the next couple of years and spent from January to April\n1938\nin England with his daughters. He continued to publish articles. In\n1936\n, he published\nRaum, Zeit, Zahl bei Aristoteles vom mathematischen Standpunkt aus\nⓉ\n(\nSpace, time, number in Aristotle from mathematical point of view\n)\nin\nScientia\n.\nSee the first few paragraphs of\nMax Dehn on Space, Time and Number in Aristotle\nat\nTHIS LINK\nIn\n1938\nhe published\nDie Gruppe der Abbildungsklassen\nⓉ\n(\nThe group of classes of mappings\n)\nwhich contains the important ideas known today as a 'Dehn twist'. Dehn and his wife were in Frankfurt on Kristallnacht\n(\nso called because of the broken glass in the streets on the following morning\n)\n, the\n9\n-\n10\nNovember\n1938\n. Many Jews were murdered, hundreds were seriously injured, and thousands were subjected to horrifying experiences. Thousands of Jewish businesses were burnt down together with over\n150\nsynagogues. The Gestapo arrested\n30\n,\n000\nwell-off Jews and a condition of their release was that they emigrate. On\n11\nNovember\n1938\nDehn was arrested but, with so many Jews being held, the prisons were full and he was released later on the same day. Immediately Dehn and his wife, fearing re-arrest, fled to the home of Willi Hartner, friends in Bad Homburg north of Frankfurt. Hartner wrote\n[\n11\n]\n:-\nUnforgettable for those who saw him at the time was his calmness, his philosophical composure. For the conversations centred not on the events of the day, but on the relationship of mathematics to art, on problems of archaeology, and finally on the concept of humanity of Confucius.\nAfter a few weeks the Gestapo became less active in their persecution of Jews and Dehn and his wife risked fleeing to Hamburg where they lived for a while at the home of one of Dehn's elder sisters before escaping, first to Denmark in January\n1939\nand from there to Norway. Dehn was soon given a temporary position at he Technische Hochschule in Trondheim as a replacement for\nViggo Brun\n(1885\n-\n1978)\nwho was on leave. However, on\n1\nMarch\n1940\nGermany invaded Norway and Trondheim fell to the Germans on\n9\nApril. Dehn fled the city but, despite the great risks, was back in the city by June and began to plan his move to the United States.\nIn October\n1940\nthe Dehns emigrated to the USA, travelling from Norway to Stockholm in Sweden, then on to Moscow in Russia from where they took the trans-Siberian train to Vladivostok. From there they took a ship to Kobe in Japan and then another ship to San Francisco where they arrived on\n1\nJanuary\n1941\n. Once in the USA Dehn taught at several universities and colleges, for instance at the University of Idaho in Pocatello, the Illinois Institute of Technology and St John's College in Annapolis, Maryland. Paul L Chessin has described some interesting personal recollections of Dehn while at Madison, Wisconsin:-\nIn\n1945\n,\n[\nDehn\n]\nreplaced Rudolph Langer, then head of the mathematics department in Madison, Wisconsin, who went on sabbatical to the University of Texas. Prof Dehn came to teach several graduate courses. I attended his course in 'Non-linear Partial Differential Equations'. We were delighted to have a German-speaking instructor since we were to take our German language examinations\n(\nrequired for the doctorate\n)\n. He, in turn, refused since it was that term that he was to take his examination for US citizenship! Max would hold forth in the Rathskellar\n(\nthe only campus beer establishment within the Big Ten Universities\n)\n. We learned more in the beer stube - such as his personal life. He was the black sheep in his family. So long as he remained in his university, he was supported. Thus he received many doctorates. He would declaim in Greek, some passages from the classics, beer stein in hand. At the time for setting out final grades, he merely called the attendance and one by one asked essentially for the titles of the chapters in the textbook. Clearly we could glance ahead to be assured of the correct answer. I believe he gave something like\n18\nA's and\n3\n-\n4\nB's. Throughout the class sessions he would interrupt with some voiced concerns about passing his citizenship examination.\nHowever Dehn was unable to find a full-time position and\nSaunders Mac Lane\nrecently wrote:-\n... most mathematicians fleeing Europe were helped to some sort of position in the United States ... I recall two cases of failures: Max Dehn, noted for work in topology, got only a weak position.\nThe weak position, referred to by\nMac Lane\n, was at Black Mountain College. This college had no accredited degrees and taught mainly creative arts. There was no trained mathematician on the staff when Dehn was invited to give two lectures there in\n1944\n. He realised that he could not lecture on advanced mathematics so he gave his lectures on 'Common roots of mathematics and ornamentics' and 'Some moments in the development of mathematical ideas'. He was offered a permanent post there at $\n25\na month. He held out for $\n40\na month which was agreed. Dehn joined the Faculty in\n1945\nand remained there until his death. Dehn was the only mathematician ever to teach at the College which closed in\n1956\n. David Peifer writes\n[\n14\n]\n:-\nDehn taught Mathematics, Philosophy, Greek, and Italian. In Mathematics his courses included History of Mathematics and Projective Geometry. He is remembered for his love of nature and the arts. His lectures frequently included tangents on philosophy, the arts, and their connections to mathematics. He was best when lecturing in a socratic style. He was fond of giving these lectures while hiking with his students through the woods. He is remembered as a caring and devoted teacher.\nDehn's outstanding research record is in stark contrast with the low level of his final post. He was an intuitive geometer, stimulated by\nHilbert\n's axiomatic approach to the subject. His work in topology had led him into the study of groups, particularly group presentations which arise naturally from topological considerations. In his\n1911\npaper\nÜber unendliche diskontinuierliche Gruppen\nⓉ\n(\nOn infinite discontinuous groups\n)\n, Dehn formulated important problems on group presentations, namely the word problem and the isomorphism problem. The word problem asks the fundamental question of whether there is an algorithm to determine whether a word in a group given by a presentation is trivial. It has since been shown that no such algorithm exists in general. Research on questions of this type are still of major importance in combinatorial group theory. Dehn also wrote on statics, projective planes and, as we have noted above, on the history of mathematics.\nAfter World War II ended, the\nGerman Mathematical Society\n(\nDMV\n)\nwas re-established in\n1948\nand Erich Kamke\n(1890\n-\n1961)\nwrote to all those who had been expelled asking them to rejoin. Dehn refused and we give his reply, written in August\n1948\n, in which he states clearly his reasons\n(\nsee for example\n[\n2\n]\n)\n:-\nI bear no grudge of any kind. As you may be aware, I am once again in close contact with several mathematicians in Germany, of course primarily with those whom I was particularly close to. But I cannot rejoin the German Mathematical Society. I have lost the confidence that such an association would act differently in the future than it did in\n1935\n. I fear it would, once again, not resist an unjust measure coming from outside. The DMV did not have the custody of very important values. My negative impression is caused by the fact that it did not dissolve itself in\n1935\nand that not even a considerable number of mathematicians left the association. I am not afraid that the DMV will once again expel Jews, but perhaps next time it will be so-called communists, anarchists or \"coloured people\". Contact with Germany, especially with German mathematicians, is very dear to my heart.\nPaul L Chessin has described some interesting personal recollections of Dehn:-\nIn\n1945\n,\n[\nDehn\n]\nreplaced Rudolph Langer, then head of the mathematics department in Madison, Wisconsin, who went on sabbatical to the University of Texas. Prof Dehn came to teach several graduate courses. I attended his course in Non-linear Partial Differential Equations.\nWe were delighted to have a German-speaking instructor since we were to take our German language examinations\n(\nrequired for the doctorate\n)\n. He, in turn, refused since it was that term that he was to take his examination for US citizenship !\nMax would hold forth in the Rathskellar\n(\nthe only campus beer establishment within the Big Ten Universities\n)\n. We learned more in the beer stube - such as his personal life. He was the black sheep in his family. So long as he remained in his university, he was supported. Thus he received many doctorates.\nHe would declaim in Greek, some passages from the classics, beer stein in hand. At the time for setting out final grades, he merely called the attendance and one by one asked essentially for the titles of the chapters in the textbook. Clearly we could glance ahead to be assured of the correct answer. I believe he gave something like\n18\nA's and\n3\n-\n4\nB's.\nThroughout the class sessions he would interrupt with some voiced concerns about passing his citizenship examination.\nDehn retired at the end of the academic year\n1951\n-\n1952\nand was made Professor Emeritus. He continued to work at Black Mountain College, giving advice to staff and students. Shortly after supervising the removal of a number of dogwood trees from the college campus, he became ill and died of an embolism. He is buried in the woods that he loved on the Black Mountain College campus.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}