{
  "nome_completo": "Max Black",
  "nome_curto": "Max Black",
  "ano_nascimento": "1909",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Black/",
  "lugar_nascimento": "Baku, Azerbaijan",
  "lugar_morte": "Ithaca, USA",
  "biografia": "Max Black\n's father was Lionel Black who was a businessman while his mother was Sophia Davinska. They were Jewish and as a consequence suffered from the anti-Semitism which was widespread at this time in Azerbaijan. Soon after Max was born his parents decided to try to make a better life for their family in a less hostile place and they left Azerbaijan moving first to Paris. After a short stay in Paris they moved again, this time to London, where they set up home in\n1912\n.\nBlack was only three years old when his family set up home in England and all his education took place in that country. This meant that despite his Jewish-Russian background he grew up assimilating English culture, something which showed through in his later philosophical writings. He was extremely talented as a child and showed great abilities in both mathematics and music. In particular he played the violin to a very high standard and during his time at school he contemplated a career in music, thinking that he would be a professional pianist. Another of his talents was for chess which, like the violin, he played to a high standard. It was a game he enjoyed throughout his life.\nBy the time he had completed his schooling Black had decided on a career in mathematics rather than music. He entered Queen's College Cambridge and found that there were many there interested in the philosophy of mathematics.\nRussell\n,\nWittgenstein\n, G E Moore, and\nRamsey\nwere all teaching at Cambridge during Black's time as an undergraduate and the influence that these people had on Black was very major indeed for they turned his interests towards philosophy. He graduated with his B.A. in\n1930\nand was awarded a fellowship to enable him to study at Göttingen for a year.\nAt Göttingen Black worked on his first book\nThe nature of mathematics\n. He had two principal aims in mind when he wrote this work. The first was to present a considered critical exposition of\nPrincipia mathematica\nand the second was to give supplementary accounts of the formalist and intuitionist doctrines in sufficient detail to make it easy for those wished to proceed further to read the original papers. His presentation of\nBrouwer\n's\nintuitionism\nwas particularly fine.\nThe nature of mathematics\nwas first published in\n1933\nand a photographic reprint was published over a quarter of a century later in\n1959\n.\nBlack married Michal Landsberg around this time; they had two children. He returned from Göttingen after his year there and studied for his doctorate at the University of London. His doctoral dissertation was\nTheories of logical positivism\nand he was awarded the degree in\n1939\n. Two years earlier he had published a work\nVagueness: An exercise in logical analysis\nin the\nPhilosophical Society\n. In this work he looked at two main ideas, one being the nature of and the observability of vagueness and the other one being the relevance vagueness might have for logic. The \"vague sets\" which Black wrote about in this paper are now called \"fuzzy sets\" and, had his paper made more impact at the time, then our terminology today might be different. It was the first attempt to give a precise mathematical theory for sets where there is a membership curve. In this work Black wrote:-\nThe vagueness of the word chair is typical of all terms whose application involves the use of the senses. In all such cases \"borderline cases\" and \"doubtful objects\" are easily found to which we are unable to say either that the class name does or does not apply.\nBlack lectured on mathematics at the Institution of Education in London from\n1936\nuntil\n1940\nwhen he accepted an appointment to the Philosophy Department at the University of Illinois at Urbana. After six years at Urbana, Black accepted a professorship in philosophy at Cornell University in New York.\nThe year\n1948\nsaw Black take US nationality. He continued to work at Cornell University becoming Susan Lin-sage Professor of Philosophy and Humane Letters there in\n1954\n. He retired in\n1977\nbut continued lecturing at many universities world-wide. He was President of the International Institute of Philosophy from\n1981\nuntil\n1984\n, being only the second American ever to hold this position.\nBlack was famed for his contributions to the philosophy of language, the philosophy of mathematics and science, the philosophy of art, conceptual analysis, and his studies of the work of philosophers such as\nFrege\n(\npublishing a major work in\n1952)\nand\nWittgenstein\n(\npublishing\nA companion to\nWittgenstein\n's Tractatus\nin\n1964)\n. Black was a prolific author and lists of his publications contain over\n200\nitems.\nOne of Black's early books on philosophy was\nLanguage and Philosophy\nwhich he published in\n1949\n. His earlier work on vagueness from ten year before was produced again in this work and he applied the same ideas to language arguing that the rules of discourse could not be followed precisely.\nIn\n1954\nBlack published\nProblems of Analysis\nwhich examined the problems associated with induction, namely making generalisations and predictions based on a few cases. As in many of his arguments Black insists that in the end one can trust inductive arguments if they are seen to work and he argues that common sense must always be used. In\nModels and Metaphors\n(1962)\nargued that:-\n... the conception of language as a mirror of reality is radically mistaken ...\nand that language should attempt to:-\n... conform to the discovered regularities of experience.\nMathematics was never far from Black's approach to topics, as for example one of his latter works\nMaking intelligent choices, how useful is decision theory?\npublished in\n1985\n. This provided a survey of Bayesian decision theory and contains data to illustrate his point that actual choosers often do not behave like good Bayesians. P L Quinn, surveying this paper writes:-\nThe author argues that rational choosers will not always treat their options as given but will instead often actively structure them by a kind of \"preselection\" which involves tacit choice among various intentional descriptions of the salient features of the choice situation. He also argues that violations of transitivity in the chooser's preference ordering need not be symptoms of irrationality.\n[\nBlack suggests\n]\nthat intelligent choice might well be thought of as the exercise of an informal, practical art, rather than the application of a mathematical calculus.\nBlack described himself as a\n(\nsee for example\n[\n7\n]\n)\n:-\n... lapsed mathematician, addicted reasoner, and devotee of metaphor and chess.\nWilson-Quayle summed up Black's contributions to philosophy as follows:-\nAs a philosopher, he was known for offering a commonsense, pragmatic approach to those theoretical issues that he knew required clarity. Highly sceptical of those who offered facile classifications, Black sought to confirm what can be known about the world and yet was ever mindful of the tentative nature that characterised most philosophical investigations.",
  "math_areas": [
    "Analysis"
  ]
}