{
  "nome_completo": "Max Abraham",
  "nome_curto": "Max Abraham",
  "ano_nascimento": "1875",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abraham_Max/",
  "lugar_nascimento": "Danzig, Germany (now Gdańsk, Poland)",
  "lugar_morte": "Munich, Germany",
  "biografia": "Max Abraham\nwas born into a Jewish family who had made considerable amounts of money as merchants. He studied at the University of Berlin under\nPlanck\n, writing his doctoral dissertation in\n1897\n. After this he spent three years at the University of Berlin working as\nPlanck\n's assistant.\nIn\n1900\nAbraham was appointed as a\nPrivatdozent\nat Göttingen. He lectured at Göttingen as a Privatdozent until\n1909\nwhich is an unusual length of time for anyone to hold such an unpaid lecturing position. The reason for his failure to obtain a permanent university position during this period was not due to his ability but rather was a result of his personality. Goldberg writes in\n[\n1\n]\n:-\n... he had no patience with what he considered to be silly or illogical argumentation. Abraham had a penchant for being critical and had no hesitation in publicly chastising his colleagues, regardless of their rank or position. His sharp wit was matched by an equally sharp tongue, and as a result he remained a Privatdozent at Göttingen for nine years.\nIn\n1909\nAbraham accepted a post at the University of Illinois in the United States. Disliking the small university atmosphere of Illinois, he returned within a few months to Göttingen, going next to Italy at the invitation of\nLevi-Civita\n. Abraham was professor of rational mechanics at the University of Milan until\n1914\n. During this time Abraham and\nEinstein\ndisagreed strongly about the theory of relativity in a correspondence discussed in\n[\n3\n]\nand\n[\n4\n]\n.\nEinstein\nalso argued about relativity in a correspondence with\nLevi-Civita\nand Abraham played a role in this argument too, see for example\n[\n4\n]\n.\nForced to return to Germany at the start of World War I, Abraham worked on the theory of radio transmission. Unable to return to Milan after the War he worked at Stuttgart until\n1921\n, substituting for the professor of physics at the Technische Hochschule, when he accepted a chair in Aachen. He took ill on the way to Aachen and a brain tumour was diagnosed. He never recovered and\n[\n2\n]\n:-\n... just as his life was suffering, his end was full of agony.\nAbraham's work is almost all related to\nMaxwell\n's theory and he wrote a text which was the standard work on electrodynamics in Germany for a long time. Goldberg writes in\n[\n1\n]\n:-\nHis consistent use of vectors was a significant factor in the rapid acceptance of vector notation in Germany. But one of the most noteworthy features of the text was that in each new edition Abraham saw fit to include not only the latest experimental work but also the latest theoretical contributions, even if these contributions were in dispute. Furthermore, he had no hesitation, after explicating both sides of a question, in using the book to argue his own point of view.\nHis theory of the electron was developed in\n1902\n, and its case strongly argued in his text, but in\n1904\nLorentz\nand\nEinstein\nproduced a different theory. Abraham's study of the structure and nature of the electron led him to the idea of the electromagnetic nature of its mass, and consequently to the dependence of the velocity of electromagnetic waves in a gravitational field. At first his ideas were supported by experiment, particularly work carried out by Wilhelm Kaufmann, but later work was to favour the theory developed by\nLorentz\nand\nEinstein\n.\nAbraham was opposed to relativity all his life. At first he objected both to the postulates on which relativity was based and also to the fact that he felt that the experimental evidence did not support the theory. By\n1912\nAbraham, who despite his objections was one of those who best understood relativity theory, was prepared to accept that the theory was logically sound. However, he still did not accept that the theory accurately described the physical world.\nAbraham had been a strong believer in the existence of the aether and that an electron was a perfectly rigid sphere with a charge distributed evenly over its surface. He was not going to give up these beliefs easily particularly since he felt that his views were based on common sense. He hoped that further astronomical data would support the aether theory and show that relativity was not in fact a good description of the real world. As\nBorn\nand von Laue write in\n[\n2\n]\n:-\nHe loved his absolute aether, his field equations, his rigid electron just as a youth loves his first flame, whose memory no later experience can extinguish.\nMany would still agree with Abraham that his version of the world was more in line with common sense. However, mathematics and physics over the\n20\nth\ncentury has shown that the world we inhabit is at variance with \"common sense\" when we examine the large scale structure and the small scale structure.",
  "math_areas": [
    "Algebra"
  ]
}