{
  "nome_completo": "Maximilian Jacob Herzberger",
  "nome_curto": "Maximilian Herzberger",
  "ano_nascimento": "1899",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herzberger/",
  "lugar_nascimento": "Charlottenburg, Berlin, Germany",
  "lugar_morte": "New Orleans, USA",
  "biografia": "Maximilian Herzberger\nwas known to his friends and colleagues as Max. His father was the merchant Leopold Herzberger\n(\nborn\n1870)\nand his mother was Sonja Behrendt\n(1876\n-\n1945)\n. Max was the younger of his parents' two children, having a sister Olga born in Berlin on\n24\nSeptember\n1897\n. There seems some confusion as to his date of birth\n(\nsome give\n17\nMarch\n)\nbut the date we give is the date which Herzberger himself gives in his doctoral thesis. Max showed remarkable talents for mathematics by the age of eleven. He entered the Freidrich\nRealgymnasium\nin Berlin then later moved to the Schiller Real Gymnasium of Charlottenburg but, after only one year, he had covered the whole of the school curriculum in mathematics. The school, realising that they could not teach him any more mathematics, allowed him to take time away from school. He said\n[\n1\n]\n:-\nI used to spend most of that off-time taking long walks and reading. For a while, however, no one could understand why I would come home everyday with my pockets ripped off, until they found out that, since I always had my face in a book, I'd usually keep myself from losing my way by brushing along the fence posts or trees as I walked.\nHowever, Herzberger expressed heartfelt thanks to Professor Pahl, his mathematics teacher. His parents were unhappy about his dedication to mathematics:-\nThey feared I might become too high strung and my health would be affected.\nHis parents took the drastic step of burning his textbooks and the notes he had made but even this did not stop him. Despite being excused lessons, Herzberger took the final examinations at the end of each year and his performance was outstanding. His parents tried hard to persuade him to turn away from mathematics and study law. Herzberger hated the idea of law so, eventually after much argument, a compromise was reach and he entered the Friedrich-Wilhelm University of Berlin at Easter\n1917\non the chemistry course. However, he only lasted for one semester on the chemistry course, since, being very clumsy, he kept breaking test tubes. At this time Germany was involved in World War I and Herzberger was called up for military service in July\n1917\n. He undertook military service until December\n1918\nwhen he returned to university in Berlin. At this stage he switched to mathematics, theoretical physics and philosophy, having some exceptional teachers in all three areas. His theoretical physics lecturers included Heinrich Rubens\n(1865\n-\n1922)\n,\nMax Planck\n, Max von Laue\n(1879\n-\n1960)\n, and\nAlbert Einstein\nwhile his philosophy lecturers included Ernst Cassirer\n(1874\n-\n1945)\n, Max Dessoir\n(1867\n-\n1947)\n, Alois Riehl\n(1844\n-\n1924)\nand Eduard Spranger\n(1882\n-\n1963)\n. He explained in\n[\n1\n]\nhow he got to know\nEinstein\nthrough the theoretical physics seminar:-\nIn my senior year I participated in a theoretical seminar in which we students had to give lectures on controversial themes, each guided by one of our professors. It was my good fortune to select a subject - statistical mechanics - which interested\nEinstein\n, so I went to his home several times to discuss the theme and spent many a pleasant hour accompanying him on his daily walks. How I enjoyed those talks we'd have, as we strolled across the countryside together. Also, he invited me to attend some of the chamber music concerts he sometimes held in his home, in which he himself participated.\nFor further comments that Herzberger made about\nAlbert Einstein\n, see\nTHIS LINK\n.\nHe was taught mathematics by, among others,\nLudwig Bieberbach\n,\nConstantin Carathéodory\n,\nRichard von Mises\n,\nFriedrich Schottky\n,\nIssai Schur\n,\nErhard Schmidt\n,\nKonrad Knopp\n,\nHans Rademacher\n, and\nHans Hamburger\n. He continued to study in Berlin for his doctorate advised by\nSchur\nand was awarded the degree by the Friedrich-Wilhelm University of Berlin on\n7\nMarch\n1923\nfor his thesis\nÜber Systeme hyperkomplexer Grössen\nⓉ\n(\nOn  hypercomplex systems\n)\n. His examiners were\nSchur\nand\nBieberbach\n. In his thesis Herzberger expressed his thanks to his advisor:-\nI owe special thanks to Professor\nSchur\nfor the strong support that I received during my studies and during the preparation and printing of this work, and for learning much from him.\nIn addition to those just mentioned, Herzberger states in his thesis that he had been taught by Belovsky, Blasius, E Fischer, Gabriel, Grau, Henning, Fr Koehler, Liebisch, and H Maier.\nWhen Herzberger graduated in\n1923\nthe situation in Germany was extremely difficult with daily living dominated by hyperinflation. University positions were essentially impossible to obtain so he looked for a job in industry. There was an important reason why he needed to try to achieve financial stability in these difficult circumstances since he wanted to marry. He had met Edith Kaufmann\n(1901\n-\n2001)\n, the daughter of Julius and Ida Kaufmann, and they planned to marry. Edith had been born in Stuttgart on\n10\nOctober\n1901\n. Herzberger had to decide which industry would suit him best with his outstanding mathematical skills, yet with a lack of laboratory experience and a dislike of the chemistry practical work that he had experienced at university. He decided to seek a position in the optical industry\n[\n5\n]\n:-\nUntil\n1934\n, then, he worked in succession with the old optical firm of Emil Busch\n[\nin Rathenow\n]\n, the Leitz Company\n[\nin Wetzlar\n]\n, and\n[\nin\n1927]\nthe Zeiss Works\n[\nin Jena\n]\n. At Zeiss he became mathematical assistant to the director, and there he devoted most of his time to the theoretical aspects of lens design. It was there also that he became a colleague and friend of Dr Hans Boegehold, with whom he frequently collaborated.\nObtaining these positions allowed Herzberger to marry Edith Kaufmann in\n1925\n; they had three children, all born in Jena, Ruth\n(\nborn\n1928)\n, Ursula\n(\nborn\n1931)\nand Hans\n(\nborn\n1932)\n. He was also able to begin an academic career, being appointed to the University of Jena. His early publications were:\nAnwendung der Vektoralgebra auf die geometrische Optik\nⓉ\n(\nApplication of vector algebra in geometrical optics\n)\n(1924)\n;\nÜber die Durchrechnung windschiefer Strahlen durch ein System zentrierter Linsen\nⓉ\n(\nOn the tracing of skew rays through a system centred lenses\n)\n(1925)\n;\nÜber einen Anastigmaten von Aplanatform\nⓉ\n(\nOn anastigmats of planar form\n)\n(1925)\n;\nÜber einige Fragen der geometrischen Optik\nⓉ\n(\nOn some issues of geometrical optics\n)\n(1926)\n;\nÜber die Durchrechnung von Strahlen durch optische Systeme\nⓉ\n(\nOn the tracing of rays through optical systems\n)\n(1927)\n; and\nSome Remarks on the Extension of the Optical Cosine Law\n(1927)\n.\nHis attempt to\nhabilitate\nat the University of Jena in\n1930\nwas rejected by the Thuringian Ministry, despite strong support from the Jena faculty, almost certainly because Herzberger was Jewish. In fact Thuringia was the first German province to have Nazis in its government; this happened in\n1930\n. However, worse was to follow for Herzberger. On\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired\n[\n5\n]\n:-\nWith the rise of the Nazis to power in Germany, he was forced from his position; he escaped with his wife and three children to Holland. After a short period of uncertainty, during which he visited Russia and there was invited to join the faculties of several Russian universities, he went to England. Through the efforts of Dr\nEinstein\n, the Bausch and Lomb Optical Company and the Eastman Kodak Company became aware of his need for a permanent position where his talents could be appreciated. It was in\n1935\n, then, that he was transferred from the London office of the Eastman Kodak Company to the main works in Rochester, New York.\nIn fact Herzberger was the only mathematician dismissed from the University of Jena under the\n1933\nCivil Service Law. He worked as the Head of Optical Research at the Eastman Kodak Company in Rochester, New York  from\n1935\nto\n1965\n. As one might expect, from\n1935\nonwards he published in English. Among his first papers written in English we mention:\nOn the Fundamental Optical Invariant, the Optical Tetrality Principle, and on the New Development of Gaussian Optics Based on This Law\n(1935)\n;\nOn the Characteristic Function of Hamilton, the Eiconal of Bruns, and Their Use in Optics\n(1936)\n;\nHamilton's Characteristic Function and Bruns' Eiconal\n(1937)\n; and\nTheory of Transversal Curves and the Connections Between the Calculus of Variations and the Theory of Partial Differential Equations\n(1938)\n. He was awarded the Cressy Morrison Award from the New York Academy of Science in\n1945\n.\nIn\n1962\nHerzberger was awarded the Frederic Ives Medal by the Optical Society of America. In the citation for the award, Herzberger's achievements are described. Here is an extract:-\nDr Herzberger has always been interested in trying to develop a general theory of optical imagery, along the paths of thought originated by Hamilton and extended by Bruns. Needless to say, this is a difficult approach but one of great promise, especially for the clearer understanding of optical imagery. ... Dr Herzberger, with the algebraic approach, has the ambition to make clear the entire phenomena of optical imagery in such a manner that the required lens design will follow logically and even obviously from prescribed performance requirements.\nFor the complete citation for this award, see\nTHIS LINK\n.\nIn\n1958\nhe published the book\nModern Geometrical Optics\n. C H Wilcox writes\n[\n7\n]\n:-\nThis is a systematic exposition of geometrical optics, presented with a minimum of mathematical theory. The formulas are developed in a form suitable for high-speed electronic computation. The work incorporates the results of the author's research over a period of more than fourteen years.\nHerzberger is famed for inventing the Superachromatic lens which solves the problem of colour distortion\n[\n1\n]\n:-\nThe idea first came to Max in the mid-\n1940\n's and by\n1954\nhe was finally able to demonstrate with mathematical equations that what the world had thought impossible was indeed theoretically possible. ... Not only did Herzberger solve the correction for colour distortion with a combination of only three glasses or lens. but in so doing, he also improved the accuracy for all visible colours to such a degree that the films of the\n1950\n's and\n60\n's were incapable of reproducing them. Kodak, therefore, hailed him for his sensational breakthrough, but felt that such a lens would be too expensive and impractical for the market at that time.\nIn\n1965\nHerzberger retired from his position as Head of Optical Research at Eastman Kodak but he certainly did not give up his scientific work. He spent the next three years,\n1965\n-\n1968\n, in Switzerland on the faculty of the Eidgenössiche Technische Hochschule in Zürich. During these years he worked alongside others to establish graduate courses in geometrical optics within the Institute of Photography at ETH. Returning to the United States, he was appointed as a consulting professor to the Physics Department of the University of New Orleans\n[\n1\n]\n:-\n... when he came to New Orleans he was able to tackle the Superachromat theory again. With the help of physicist George Ioup and the UNO computer, Herzberger proceeded to wade through the approximate\n30\nmillion combinations of the more than\n300\ncommercially available glasses, taken three at a time, in order to arrive at the most practical combinations for his triplet lens.\nAlthough the Superachromat lens remains expensive to produce, it is manufactured today and achieves colour correction far better than anything previously achieved. The lens, only used when the highest quality is required, gives vast improvements to telephoto shots requiring extreme sharpness, infrared and multi-spectral photography, industrial, scientific, and aerospace photography. Herzberger continued to hold the position at the University of New Orleans until\n1978\nwhen he retired for the final time.\nThe article\n[\n1\n]\ngives us a good insight into Herzberger's character:-\nWith his high button shoes and matching vests,\n80\n-year old Max Herzberger radiates Old World charm, but there is always a slightly disheveled air about him ... Max's pockets are usually stuffed with books and his neckties are always askew. ...\n[\nHe\n]\nis famous for his mumbled introductions, simply because he can never remember names. Although he can memorize the most complicated formulas, recite Shakespeare, Plato, and Goethe by heart, and remember the most involved moves of championship chess games, he readily admits he has always had a terrible memory for everyday things. He even sheepishly confesses that he once walked home for miles in a blizzard because he had forgotten where he had parked his car.\nIn\n[\n1\n]\nhis hobbies are described. These are :-\n... preparing special gourmet recipes, taking leisurely rides through the country to contemplate nature. and reading poetry or plays aloud. which he does with a delightful flair for the dramatic. Also, as an expert chess player, he has kept as many as\n38\ngames going at once. After one tournament at UNO, in which he had played\n18\ngames simultaneously, one of his admiring opponents commented that the greatest strain seemed to have been more on Max's feet than on his mind.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}