{
  "nome_completo": "Mei Juecheng",
  "nome_curto": "Mei Juecheng",
  "ano_nascimento": "1681",
  "ano_morte": "1763",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mei_Juecheng/",
  "lugar_nascimento": "Xuangcheng, now Xuanzhou City, Anhui province, China",
  "lugar_morte": "China",
  "biografia": "Mei Juecheng\nwas the grandson of\nMei Wending\n. He learnt mathematics at Baoding, a city near Beijing which was a provincial capital and also a centre of culture. The Emperor Kangxi had come to power in\n1661\nwhen only seven years of age. Once he had become old enough to rule on his own he worked hard to promote learning. He was keen on both Chinese learning and the new European learning brought to China by the Jesuit missionaries. Two key players in the development of mathematics in China around this time are Yunzhi, the Emperor Kangxi's third son, and Li Guangdi who was a minister and mathematical scholar whom the Emperor Kangxi had appointed to teach his sons. Mei Juecheng and Li Guangdi's son had both been taught mathematics at Baoding by\nMei Wending\nand so Mei Juecheng's mathematical skills were known to the highest officials in the land.\nThe Emperor Kangxi himself had studied mathematics from\n1689\nto\n1692\nand realised that there was a lack of talented Chinese mathematicians at this time. He asked Li Guangdi to find the best mathematics books and in\n1703\nLi gave the Emperor Kangxi a copy of\nLixue yiwen\n(\nInquiry on Mathematical Astronomy\n)\nwritten by\nMei Wending\nin\n1701\n. Emperor Kangxi was greatly interested and summoned\nMei Wending\nto an audience in\n1703\n. By this time\nMei Wending\nwas seventy years old and he went to Baoding to meet Emperor Kangxi taking his grandson Mei Juecheng with him. From this time on Mei Juecheng played a major role in the compilation of mathematical and astronomical works. This became an important project under the Emperor Kangxi who had been advised that both Chinese and European mathematics texts should be compiled into a major encyclopaedia. Li Guangdi and the Emperor's son Yunzhi were both part of an editorial team comprising largely of men trained by either Li Guangdi or\nMei Wending\n.\nOf course there was much resistance to the new European learning brought by the Jesuits and the Chinese looked to be able to accept this material without making China feel inferior to Europe in learning. The acceptance of European learning was eased by the hypothesis that it was all of Chinese origin. This was set out by Mei Juecheng in\n1710\nwhen he wrote\n[\n10\n]\n:-\nLately I served at the Imperial Court, receiving from His Majesty the Emperor Kangxi, a work on the 'Jie-fang-gen'\n[\nalgebra\n]\n, together with an Imperial Edict, saying that \"the people from the Western Ocean name this method as 'A-er-re-ba-da' which can be translated into Chinese as 'Tong-lai-fa'\n(\nMethod from the East\n)\n.\" Respectfully I read it and found its method extraordinary, capable of serving as a guide to mathematics. However, realizing its method to be very similar to that of 'Tian-yuan-i', I reexamined the 'Shou-shi-li-cao' ... and found out that although the terminology is different, actually the two systems are the same. During the Yuan dynasty, scholars, whether they were composing books on mathematics, or whether they were regulating mathematics, were all dealing with this subject of algebra. Somehow, for reasons unknown, its trace has been lost. Fortunately, from the distant people\n[\nthe Jesuits\n]\n, we have re-discovered the old subjects. Still, they have not forgotten where the term 'Tong-lai-fa' comes from.\nMei Juecheng was appointed as Court Mathematician in\n1712\n. In the following year the Emperor Kangxi established the Mengyangzhai\n(\nthe Academy of Mathematics\n)\nand Mei Juecheng joined the team of people working on the compilation\nYuzhi shuli jingyun\n(\nTreasury of Mathematics\n)\nwhich was published in\n1723\n. Unlike earlier efforts in compiling encyclopaedias of mathematical knowledge, no Jesuits were involved in this work. Mei Juecheng and Chen Houyao\n(1648\n-\n1722)\nwere the chief editors and they were assisted by He Guozong, Ming Antu and, in the early stages of the project, by\nMei Wending\n. Qi Han writes\n[\n1\n]\nthat this work:-\n... reapportioned credit to Chinese scholars for many discoveries that earlier Jesuit-Chinese compendiums had credited to Europeans. In particular, studying Western algebra enabled Mei Juecheng to decipher older Chinese mathematical treatises from the Song\n(920\n-\n1279)\nand Yuan\n(1206\n-\n1368)\ndynasties whose methods had been lost. This led him to expound a theory of the Chinese origin of Western knowledge. While now acknowledged as grossly overstated, his views helped to revive interest in traditional Chinese mathematics and remained highly influential for many decades.\nBenjamin Elman writes\n[\n2\n]\n:-\nAltogether the emperor recruited more than one hundred scholars ... to join the Academy of Mathematics. ... In addition to those in the Academy of Mathematics, who studied mathematics, astronomy, and music, a large number of instrument makers were hired for the technical needs of the new academy. A team of fifteen calculators verified the computations based on the theoretical notions, mathematical techniques and applications, and numerical tables in the first part of the Treasury. Patterned after mathematical textbooks used in Jesuit Colleges, the Treasury introduced European algebra. The last part had a section on logarithms to base\n10\nand drew on the methods used in\nBriggs\n's\n1624\n'Arithmetica Logarithmica' to compute decimal logarithms. Although\nBriggs\n's work had been introduced in\n1653\n, the 'Treasury' explained the use of logarithms in greater detail, and it also included tables for sines, cosines, tangents, cotangents, secants, and cosecants for every ten seconds up to ninety degrees, as well as a list of prime numbers and a log table of integers from\n1\nto\n100\n,\n000\ncalculated to\n10\ndecimal places.\nIn fact the\nTreasury of Mathematics\nwas part of a larger project, the\nLuli yuanyuan\n(\nSources of Musical Harmonics and Mathematical Astronomy\n)\n. Also included in the\nSources\nwas the\nCompendium of Observational and Computational Astronomy\n. Again Mei Juecheng was the leading academic in this project which, like the\nTreasury\n, followed the style of European works. The first part was a general introduction to mathematical astronomy but then Mei Juecheng was able to make use of his grandfather\nMei Wending\n's study of the motion of the moon to provide improved predictions of eclipses of the moon. By accepting the best of European and Chinese astronomical data, the\nSources\nsurpassed both.\nIn\n1759\nMei Juecheng published\nChishui yizhen\n(\nPearls recovered from the Red River\n)\n. This contained the infinite series expansion for\nsin\nâ¡\n(\nx\n)\n\\sin(x)\nsin\n(\nx\n)\nwhich was discovered by\nJames Gregory\nand\nIsaac Newton\n. In fact the Jesuit missionary Pierre Jartoux\n(1669\n-\n1720)\n(\nknown in China as Du Demei\n)\nintroduced the infinite series for the sine into China in\n1701\nand it was known there by the name 'formula of Master Du'. In fact\nPearls recovered from the Red River\nwas one of two chapters that Mei Juecheng appended to the works of\nMei Wending\nthat he was editing and republishing. In this chapter, Jean-Claude Martzloff writes\n[\n4\n]\n:-\n[\nMei Juecheng\n]\nreflects on various subjects\n(\nunits of length in the classics, a formula of spherical trigonometry, comparison between the algebra of the 'jiegenfang' and the Chinese medieval algebra of the 'tianyuan', geometrical construction of the golden ratio, etc.\n)\n. He also shows how to calculate:\nÂ Â Â Â Â Â\n(\na\n)\nthe length of the circumference given its diameter\nÂ Â Â Â Â Â\n(\nb\n)\nthe sine of an arc\n(\nzhengxian\n)\nÂ Â Â Â Â Â\n(\nc\n)\nthe versed sine of an arc\n(\nzhengshi\n)\nusing infinite series which he does not prove and refers to as \"formulas from the Western scholar Du Demei.\"\nMei Juecheng compiled and edited\nMei Wending\n's written commentaries publishing them as\nMei shi congshu jiyao\nâ\n(\nCollected works of the Mei family\n)\nin\n1761\n. Important work of\nMei Wending\non mathematics published in this collection included:\nBisuan\nâ\n(\nPen calculations\n)\n,\nChou suan\nâ\n(\nNapier's bones\n)\n)\n,\nDu suan shi li\nâ\n(\nProportional dividers\n)\n,\nShao guang shi yi\nâ\n(\nSupplement to 'What width'\n)\n,\nFang cheng lun\nâ\n(\nTheory of rectangular arrays\n)\n,\nGougu ju yu\nâ\n(\nRight-angled triangles\n)\n,\nJihe tong jie\nâ\n(\nExplanations in geometry\n)\n,\nPing san jiao ju yao\nâ\n(\nElements of plane trigonometry\n)\n,\nFang yuan mi ji\nâ\n(\nCircles and squares, cubes and spheres\n)\n,\nJihe bu bian\nâ\n(\nSupplement to geometry\n)\n,\nHu san jiao ju yao\nâ\n(\nElements of spherical trigonometry\n)\n,\nHuan zhong shu chi\nâ\n(\nGeodesy\n)\nand\nQiandu celiang\nâ\n(\nSurveying solids\n)\n.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory"
  ]
}