{
  "nome_completo": "Menelaus of Alexandria",
  "nome_curto": "Menelaus",
  "ano_nascimento": "70",
  "ano_morte": "130",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Menelaus/",
  "lugar_nascimento": "(possibly) Alexandria, Egypt",
  "lugar_morte": null,
  "biografia": "Although we know little of\nMenelaus of Alexandria\n's life\nPtolemy\nrecords astronomical observations made by Menelaus in Rome on the\n14\nth\nJanuary in the year\n98\n. These observation included that of the\noccultation\nof the star Beta Scorpii by the moon.\nHe also makes an appearance in a work by\nPlutarch\nwho describes a conversation between Menelaus and Lucius in which Lucius apologises to Menelaus for doubting the fact that light, when reflected, obeys the law that the angle of incidence equals the angle of reflection. Lucius says\n(\nsee for example\n[\n1\n]\n)\n:-\nIn your presence, my dear Menelaus, I am ashamed to confute a mathematical proposition, the foundation, as it were, on which rests the subject of\ncatoptrics\n. Yet it must be said that the proposition, \"All reflection occurs at equal angles\" is neither self evident nor an admitted fact.\nThis conversation is supposed to have taken place in Rome probably quite a long time after\n75\nAD, and indeed if our guess that Menelaus was born in\n70\nAD is close to being correct then it must have been many years after\n75\nAD.\nVery little else is known of Menelaus's life, except that he is called Menelaus of Alexandria by both\nPappus\nand\nProclus\n. All we can deduce from this is that he spent some time in both Rome and Alexandria but the most likely scenario is that he lived in Alexandria as a young man, possibly being born there, and later moved to Rome.\nAn Arab register of mathematicians composed in the\n10\nth\ncentury records Menelaus as follows\n(\nsee\n[\n1\n]\n)\n:-\nHe lived before\nPtolemy\n, since the latter makes mention of him. He composed: \"The Book of Spherical Propositions\", \"On the Knowledge of the Weights and Distribution of Different Bodies\" ... Three books on the \"Elements of Geometry\", edited by\nThabit ibn Qurra\n, and \"The Book on the Triangle\". Some of these have been translated into Arabic.\nOf Menelaus's many books only\nSphaerica\nhas survived. It deals with spherical triangles and their application to astronomy. He was the first to write down the definition of a spherical triangle giving the definition at the beginning of Book I:-\nA spherical triangle is the space included by arcs of\ngreat circles\non the surface of a sphere ... these arcs are always less than a semicircle.\nIn Book I of\nSphaerica\nhe set up the basis for treating spherical triangles as\nEuclid\ntreated plane triangles. He used arcs of great circles instead of arcs of parallel circles on the sphere. This marks a turning point in the development of spherical trigonometry. However, Menelaus seems unhappy with the method of proof by\nreductio ad absurdum\nwhich\nEuclid\nfrequently uses. Menelaus avoids this way of proving theorems and, as a consequence, he gives proofs of some of the theorems where\nEuclid\n's proof could be easily adapted to the case of spherical triangles by quite different methods.\nIt is also worth commenting that\n[\n3\n]\n:-\nIn some respects his treatment is more complete than\nEuclid\n's treatment of the analogous plane case.\nBook\n2\napplies spherical geometry to astronomy. It largely follows the propositions given by Theodosius in his\nSphaerica\nbut Menelaus give considerably better proofs.\nBook\n3\ndeals with spherical trigonometry and includes Menelaus's theorem. See\nTHIS LINK\n. For plane triangles the theorem was known before Menelaus:-\n... if a straight line crosses the three sides of a triangle\n(\none of the sides is extended beyond the vertices of the triangle\n)\n, then the product of three of the nonadjacent line segments thus formed is equal to the product of the three remaining line segments of the triangle.\nMenelaus produced a spherical triangle version of this theorem which is today also called Menelaus's Theorem, and it appears as the first proposition in Book III. The statement is given in terms of intersecting great circles on a sphere.\nMany translations and commentaries of Menelaus\nSphaerica\nwere made by the Arabs. Some of these survive but differ considerably and make an accurate reconstruction of the original quite difficult. On the other hand we do know that some of the works are commentaries on earlier commentaries so it is easy to see how the original becomes obscured. There are detailed discussions of these Arabic translations in\n[\n6\n]\n,\n[\n9\n]\n, and\n[\n10\n]\n.\nThere are other works by Menelaus which are mentioned by Arab authors but which have been lost both in the Greek and in their Arabic translations. We gave a quotation above from the\n10\nth\ncentury Arab register which records a book called\nElements of Geometry\nwhich was in three volumes and was translated into Arabic by\nThabit ibn Qurra\n. It also records another work by Menelaus was entitled\nBook on Triangles\nand although this has not survived fragments of an Arabic translation have been found.\nProclus\nreferred to a geometrical result of Menelaus which does not appear in the work which has survived and it is thought that it must come from one of the texts just mentioned. This was a direct proof of a theorem in\nEuclid\n's\nElements\nand given Menelaus's dislike for reductio ad absurdum in his surviving works this seems a natural line for him to follow. The new proof which\nProclus\nattributes to Menelaus is of the theorem\n(\nin\nHeath\n's translation of\nEuclid\n)\n:-\nIf two triangles have the two sides equal to two sides respectively, but have the base of one greater than the base of the other, it will also have the angle contained by the equal straight lines of the first greater than that of the other.\nAnother Arab reference to Menelaus suggests that his\nElements of Geometry\ncontained\nArchytas\n's solution of the problem of\nduplicating the cube\n.\nPaul Tannery\nin\n[\n8\n]\nargues that this make it likely that a curve which it is claimed by\nPappus\nthat Menelaus discussed at length was the\nViviani\n's curve of double curvature. Bulmer-Thomas in\n[\n1\n]\ncomments that:-\nIt is an attractive conjecture but incapable of proof on present evidence.\nMenelaus is believed by a number of Arab writers to have written a text on mechanics. It is claimed that the text studied balances studied by\nArchimedes\nand those devised by Menelaus himself. In particular Menelaus was interested in specific gravities and analysing alloys.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}