{
  "nome_completo": "Michael George Aschbacher",
  "nome_curto": "Michael Aschbacher",
  "ano_nascimento": "1944",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aschbacher/",
  "lugar_nascimento": "Little Rock, Arkansas, USA",
  "lugar_morte": null,
  "biografia": "Michael Aschbacher\nwas the only child of Bernard Francis Aschbacher\n(1911\n-\n1985)\nand Charlotte Elizabeth O'Connor\n(1911\n-\n1999)\n. Bernard Aschbacher was born on\n9\nJanuary\n1911\nin Staunton, Macoupin, Illinois. He spent two years at college then worked as a shipping and receiving clerk for the Post Office in Springfield, Illinois. Charlotte O'Connor was born in New York on\n2\nNovember\n1911\n. Her mother died when she was very young and she then went to live with an aunt and uncle in Staunton, Illinois. Bernard and Charlotte were married on\n28\nMay\n1937\nin Staunton, Illinois. The lives of the Aschbacher family, however, changed markedly because of World War II. The United States officially entered the war in December\n1941\nand, on\n30\nOctober\n1942\nBernard Aschbacher enlisted in Peoria, Illinois as a private. He took some examinations and entered the officers training school. Charlotte Aschbacher enlisted, also in Peoria, Illinois, as an Aviation Cadet in the Women's Army Corps on\n25\nNovember\n1942\n. On Charlotte's enlistment record, it is recorded that she had four years of college and her occupation is given as statistical clerk and compiler.\nThe fact that Michael Aschbacher was born in Little Rock, Arkansas rather than in Illinois is because his parents were stationed at an army base in Arkansas at the time of his birth. Bernard Aschbacher continued to serve in the forces and was sent with the American troops to fight against Japan in the Pacific. He was on the island of Okinawa from where the Americans planned their invasion of mainland Japan. At the end of the war, he returned to the United States and used the educational opportunities provided for returning servicemen by the G.I. Bill to study for a degree at the University of Illinois. After the award of a B.S in\n1947\n, he continued to study at the University of Illinois where he was awarded an M.S. in accounting in\n1948\n. He then began undertaking research for his Ph.D.\nMichael Aschbacher spent the first nine years of his life in Illinois where he attended elementary school. Then in\n1953\nhe went with his family to East Lansing when his father was appointed as an Assistant Professor of Accounting and Financial Administration at Michigan State University. In the interview\n[\n49\n]\nhe said that in East Lansing they:-\n... lived in a little farming community outside of East Lansing, a community where they were starting to build up a subdivision as was the American way after the war.\nBernard Aschbacher continued working for a Ph.D. while in East Lansing and he was awarded the degree in\n1958\nby the University of Illinois at Urbana-Champaign for the thesis\nThe Effects of Price-Level Fluctuation on Accounting Data\n. On\n15\nJanuary\n1959\nhe was not reappointed at Michigan State University \"in accordance with tenure rules.\" Later in\n1959\nhe took up the appointment of Professor of Accounting at California State University at Northridge and\n15\n-year old Michael Aschbacher went with his family to live in Granada Hills in the San Fernando Valley region of Los Angeles, California.\nAschbacher completed his schooling at the James Monroe High School in the district called Sepulveda at the time, but since\n1991\nhas been known as North Hills. This school, founded in\n1958\n, was only one year old when Aschbacher began his studies there. In the summer of\n1961\nhe was selected to attend special mathematics classes at the University of California, Los Angeles\n(\nUCLA\n)\n[\n2\n]\n:-\nIt's summertime in Southern California, school is out, and the living is easy - but not necessarily for\n24\nhigh school juniors, who are spending their vacation at UCLA residence halls and class rooms instead of the beach. Three are from the Valley. They are Michael G Aschbacher,\n16346\nMayall Granana Hills of James Monroe High School ... The youngsters, split between boys and girls, are attending a special six-week mathematics training program, studying postulational development of algebra, truth tables, operations with sets and other subjects usually not taught until the college freshman or sophomore year.\nBy September\n1961\n, the\nValley News\nwas reporting on Aschbacher's success in the seventh annual National Merit Scholarship program. At this time he was thinking that he wanted to study science at university and he applied to a number of universities. His preference was Princeton University but his application was not accepted. All his other applications were accepted and he felt his two best options were the Massachusetts Institute of Technology\n(\nMIT\n)\nand the California Institute of Technology\n(\nCaltech\n)\n. He said\n[\n49\n]\n:-\nI wanted to get away from home, so I wanted to go to MIT. But my mother had cancer in the summer before my senior year, and she said she wanted me to not go that far away. She wasn't sure that the cancer would not reoccur. So I agreed\n[\nand\n]\nended up at Caltech.\nAschbacher began his studies of science at Caltech in\n1962\n. Two years of physics were compulsory, but he did not enjoy the physics taught by\nRichard Feynman\n, finding that he did not have the right nature for laboratory work. The chemistry labs that he had to do were even worse that the physics. In his first year he took two mathematics courses, but these were poorly taught and he did not enjoy them. In his second year, however, he took two mathematics courses, one on algebra and one on analysis. The analysis course was taught by\nDonald Knuth\nwho had been awarded a Ph.D. by Caltech in June\n1963\nand then appointed as an Assistant Professor of Mathematics. Aschbacher said\n[\n49\n]\n:-\n... my instructor in the analysis course was\nDonald Knuth\n. He was a student of\nMarshall Hall\n, who was the biggest name in the mathematics department at that time. ... he was a very interesting instructor. And the other guy was pretty good, the algebraist. He was less exciting, but the course was interesting. I did well in those two courses and enjoyed them. I'd already said I was going to be a mathematics major because I wasn't going to be a physics or chemistry major.\nThe leading mathematician at Caltech at this time was\nMarshall Hall\nand he influenced Aschbacher to become interested in combinatorics and group theory. Aschbacher received his B.S. from Caltech in\n1966\nas one of the three best students of his year. The other two were\nRichard Peter Stanley\n, who went on the have an outstanding career in mathematics, and Vern Sheridan Poythress who went to Harvard and, with\nGarrett Birkhoff\nas his advisor, was awarded a Ph.D. for his thesis\nPartial Algebras\n. He then went on to have a career as a leading philosopher, theologian and New Testament scholar.\nFor his graduate studies Aschbacher wanted a contrast from Caltech and decided that Berkeley would be ideal.\nMarshall Hall\n, however, told him that he should not go to Berkeley since it was so big he might get lost mathematically. Aschbacher's second choice was the University of Wisconsin-Madison and that was particularly attractive since the combinatorics expert Richard Bruck was there. He began his postgraduate studies at Wisconsin-Madison in\n1966\n. Bruck\n(1914\n-\n1991)\nwas interested in algebra and combinatorics which was exactly right for Aschbacher's interests at that time but Aschbacher had already started work on a combinatorial research problem while at Caltech so he continued working on that. After solving the problem he was working on, which he solved when in his second year, he showed Richard Bruck what he had achieved and Bruck said he should do further research since he had to take three years before he could be awarded a Ph.D.\nWhile at Wisconsin-Madison Aschbacher attended a course on infinite groups given by visiting professor\nBernhard Neumann\nand a course on finite groups by visiting professor\nHelmut Wielandt\n. He also attended a course given by Steven Bauman based on a mimeographed version of\nGorenstein\n's book\nFinite Groups\npublished in\n1968\n. He submitted his thesis\nCollineation Groups of Symmetric Block Designs\nand was examined on Wednesday\n21\nMay\n1969\nby Richard Bruck, Steven Bauman and Donald Warren Crowe. The thesis has the following introduction:-\nIt is the aim of this paper to investigate the automorphism groups of a certain class of combinatorial or geometric systems commonly known as symmetric block designs, symmetric balanced incomplete block designs,\n(\nv, k, λ\n)\nsystems, or as we shall refer to them: designs. ...\nWhile there are many group theoretical results in the literature on projective planes and certain other special classes of symmetric designs, and while there are a number of matrix theoretical theorems for more general symmetric designs, to our knowledge there are few general group theoretical results for arbitrary symmetric designs. In the early sections of this paper we state and prove a number of such theorems. In later sections our hypotheses become progressively restrictive.\nWhile we are interested in gaining information about designs, we are also interested in using designs to obtain information about groups: particularly permutation groups. Thus in sections seven and eight we investigate group representations related to rank three permutation groups.\nIn the last few years the study of multiply transitive and rank three permutation groups has resulted in the discovery of a number of new simple groups. We had hoped the line of investigation in section eight would lead to new rank three, multiply transitive, or simple groups. Unfortunately our results are negative.\nIn the final section we utilise the results of the previous sections to single out the possible automorphism groups for designs with parameters\n(79\n,\n13\n,\n2)\n. We construct such a design using the candidate of largest order. The existence of a design with these parameters had been in doubt.\nThe reader is cautioned that in our discussion, all groups are finite and all designs are finite and symmetric.\nThis paper was prepared while the author was holding a National Science Foundation Graduate Fellowship.\nHe was awarded the degree in June\n1969\nbut even before this he was making the transition from combinatorics to finite group theory\n[\n51\n]\n:-\nMy thesis was in combinatorics, but in my last year of graduate school I decided to switch specialties and become a finite group theorist. Thus, for a few years, I had to acquire the necessary background to work in my new specialty and to identify the important problems in finite group theory. During this time I worked on problems that the community had generated and deemed important, and I used some combination of existing strategies and techniques, together with ideas of my own that slightly extended existing approaches. But, after three or four years, I had a good enough feeling for the subject that I could find my own problems, and produce my own strategies and techniques for solving the problems.\n...\nBy the time I received my degree in\n1969\n, significant new results were appearing almost every day, so that finite group theory was in a state of flux. My lack of background was not as big a handicap as it should have been, since the knowledge base of the subject was changing rapidly. This allowed me to learn local group theory and algebraic Lie theory on the job, along with everyone else, so that I could transition into those communities relatively quickly and painlessly. But to do so, and indeed for more established finite group theorists to continue to function, it was necessary to learn the new mathematics in real time, and adapt to the changing field.\nHe spent a postdoctoral year\n1969\n-\n70\nat the University of Illinois Urbana-Champaign rapidly immersing himself in the incredibly active area of finite simple groups working with\nMichio Suzuki\nand John Walter.\nWhile Aschbacher had been undertaking research at the University of Wisconsin it had been a time of much student political activity. This is explained on the following plaque, headed 'Reform and Revolt', which is in the Bascom Hill Historic District of Madison.\nUniversity of Wisconsin students traditionally have been active in political and social causes, and that was never more apparent than during the turbulent\n1960\ns. During that time, students frequently led rallies and demonstrations, many of which protested U.S. involvement in the Vietnam War. Those activities succeeded in mobilising thousands in the name of social justice. The tensions and divisions on campus eventually devolved into violence, culminating with the bombing by four radicals of Sterling Hall, which housed the Army Math Research Center. On August\n24\n,\n1970\n, the explosion killed a graduate student, bringing the period of protest to a tragic end.\nAschbacher witnessed the aftermath of this explosion on the day he arrived back at Wisconsin-Madison before taking up an appointment at Caltech\n[\n49\n]\n:-\nI walked around the university, and came to a place where the police were pushing the crowds back. I waited to see what was happening, and in a while they set off tear gas. People were running around the university, trying to escape from the tear gas. ... somebody set off a bomb in the Army Mathematics Research Center, I think next to the computer. People were killed by the bomb. I roomed with some astronomers, and one of the astronomers had his thesis on stellar interiors on this computer, and he lost his thesis.\nBefore leaving the University of Illinois, Urbana, Aschbacher had submitted the\n23\n-page paper\nDoubly transitive groups in which the stabilizer of two points is abelian\nto the\nJournal of Algebra\non\n18\nAugust\n1970\n. Marty Isaacs wrote a review which shows how quickly Aschbacher had assimilated the vast amount of material which was being produced by those working on the classification of finite simple groups:-\nThe rather difficult proof of this theorem depends heavily on many of the recent major results in group theory. Some of the results used are the odd order and N-group theorems; the classifications of groups with abelian, dihedral, semi-dihedral or wreathed\nSylow\n2\n-subgroups; the classification of groups with strongly embedded subgroups and several others.\nAschbacher was appointed as\nBateman\nResearch Instructor in Mathematics at Caltech, the announcement being made on Sunday\n4\nOctober\n1970\nat a reception given in honour of all new faculty members by President and Mrs Harold Brown in the Athenaeum, the Caltech faculty Club\n(\nsee\n[\n33\n]\nfor details\n)\n.\nEarlier that summer, on\n4\nJuly\n1970\n, Aschbacher married Pamela Elizabeth Robinson\n(\nborn in Los Angeles on\n17\nJanuary\n1947)\n. Pamela Aschbacher wrote about being a mathematician's spouse in\n[\n52\n]\n. For example, she wrote:-\nMy husband is very succinct and logical while I use a much longer, less direct narrative structure. ... My husband is also excellent at calling out the talking heads on television who use language very loosely with ill-defined terms, imprecise language, and sloppy thinking.\n...\nFor the month we lived in a Paris suburb when our daughter was\n3\n1\n2\n3\\large\\frac{1}{2}\\normalsize\n3\n2\n1\n​\n, she began to babble nonsense syllables with a French accent when playing with other children in the communal sandbox. Three years later when we were in Oxford for three months, she developed a temporary English accent.\nFor a version of the article\n[\n52\n]\n, see\nTHIS LINK\n.\nAschbacher became a major figure in the classification of finite simple groups. You can read about this massive project in\n[\n53\n]\n. We give a short extract:-\nThough Michael Aschbacher became interested in finite simple groups only as a post doc\n(\nhaving written his dissertation on combinatorics\n)\n, his early contribution to the field took the community by surprise.\nGorenstein\ndescribed Aschbacher's entrance into the field as 'dramatic', and Solomon remarked that following Aschbacher's work in\n1974\nand\n1975\n, 'belief mounted that nothing could stand between him and the completion of the Classification'. In recognition of his many accomplishments, Aschbacher won the prestigious\nFrank Nelson Cole\nPrize in Algebra in\n1980\n. However, as Aschbacher's esteem within the community grew, his papers became notoriously difficult to comprehend. When Aschbacher's first important paper in the field appeared in print, Solomon was an instructor in the Department of Mathematics at the University of Chicago. Together with George Glauberman, he tried to read the proof, but found it incredibly difficult to follow Aschbacher's arguments. Specifically, Solomon complained that 'there were these clever counting arguments, but he never bothered to write them down'. Aschbacher's style made it notoriously difficult for other mathematicians to follow his proofs, and as his papers grew longer, the difficulties were exacerbated.\nGroup theorists no longer judged a proof as a self-contained document, but took into account its author, his previous work, and his standing within the community. When asked about the process of refereeing in the finite simple group community,\nGorenstein\ncharacterised Aschbacher's papers as 'extremely difficult'. He recalled, 'Aschbacher is so smart .... Richard Lyons and I and Aschbacher had just written a joint paper .... I wrote a draft of this paper, Aschbacher rewrote it - I had enormous difficulty reading my own goddamn paper ... . He can see things so much better than anybody else.' He added, 'he's so quick that he misses things'. The impenetrability of Aschbacher's papers was taken as testimony of his mathematical prowess, rather than a challenge to the veracity of his proofs.\nThis quote refers to Aschbacher being awarded a\nFrank Nelson Cole\nPrize in Algebra in\n1980\n. This was the second of his major awards, having been awarded an Alfred P Sloan Fellowship in\n1973\n. He continued to be given prestigious awards such as the Rolf Schock Prize for Mathematics\n(2011)\n, the Leroy P Steele Prize for Mathematical Exposition\n(2012)\nand the Wolf Prize\n(2012)\n.\nYou can see information about all these major awards given to Aschbacher at\nTHIS LINK\n.\nAschbacher was promoted to Assistant Professor at Caltech in\n1972\n, then to Associate Professor in\n1974\nand full Professor in\n1976\n. He was an invited speaker at the International Congress of Mathematicians held in Helsinki in\n1978\ndelivering the lecture\nA Survey of the Classification Program for Finite Simple Groups of Even Characteristic\n. He was Executive Officer for Mathematics at Caltech from\n1991\nto\n1994\n(\neffectively Head of Department\n)\n. In\n1996\nhe was named Shaler Arthur Hanisch Professor of Mathematics at Caltech. In addition to the awards we listed above, he was elected a Member of the\nNational Academy of Sciences\nin\n1990\n, as a Fellow of the\nAmerican Academy of Arts & Sciences\nin\n1992\nand Named Member of the Inaugural Class of Fellows of the\nAmerican Mathematical Society\nin\n2013\n.\nWe are aware of ten books by Aschbacher, the first being\nThe finite simple groups and their classification\n(1980)\nwhich is based on the four James K Whittemore Lectures which Aschbacher gave at Yale University in\n1978\n. In the review\n[\n17\n]\n, Ian Macdonald describes it as follows:-\nThis is a delightful little book. For one thing, it contains no proofs whatever! It describes the bare bones of a programme for the classification of the finite simple groups.\nAschbacher's next book was\nFinite group theory\n(1986)\nwhich Stephen Smith describes as follows\n[\n36\n]\n:-\nThis book is likely to become a standard text for graduate students beginning work in finite group theory. It will also be of interest to a wider audience interested in the foundations of the classification of finite simple groups, a great mathematical achievement completed several years earlier with many essential contributions by the author.\nThe other books, all related to the classification of finite simple groups, are\nSporadic Groups\n(1994)\n,\n3\n-\ntransposition groups\n(1997)\n,\n(\nwith Stephen D Smith\n)\nThe classification of quasithin groups. I and II\n(2004)\n,\n(\nwith Richard Lyons, Stephen D Smith and Ronald Solomon\n)\nThe classification of finite simple groups\n. Groups of characteristic\n2\ntype\n(2011)\n,\n(\nwith Radha Kessar and Bob Oliver\n)\nFusion systems in algebra and topology\n(2011)\n, and\nQuaternion fusion packets\n(2021)\n.\nThere is information about all these books, including Publisher's descriptions, extracts from the Prefaces, and extracts from some reviews, at\nTHIS LINK\n.\nIn\n2013\nAschbacher retired from his position at Caltech and was made Shaler Arthur Hanisch Professor of Mathematics Emeritus. At this point he stopped lecturing, stopped serving on committees and had no postgraduates to advise but remained as a full time researcher at Caltech, continuing to work on aspects of the Classification.\nThe tenth in the series of 'Groups St Andrews' conferences, started by Colin Campbell and\nEdmund Robertson\nin\n1981\n, was 'Groups St Andrews\n2017\nin Birmingham', held at the University of Birmingham\n5\n-\n12\nAugust. Aschbacher was one of the four main speakers and he gave a series of four lectures with title\nFinite simple groups and fusion systems\n. The Abstract for his four lectures was as follows:-\nThe goal of these talks is to give some insight into a program to, first, classify a large subclass of the class of simple\n2\n-fusion systems, and then, second, to use the result on fusion systems to simplify the proof of the theorem classifying the finite simple groups. We will begin with an introduction to the theory of fusion systems, and then move on to an overview of the proof of the theorem classifying the finite simple groups of component type. We then discuss how to translate that proof into the category of\n2\n-fusion systems, and the advantages that accrue from the change in category. Finally we describe how the result on fusion systems can be used to derive a corresponding theorem on simple groups.\nFor those wanting to read a description of the Classification by Aschbacher, we suggest the article\n[\n54\n]\n. To read\n[\n54\n]\nyou will need to have studied an undergraduate course in group theory. For a non-technical extract from\n[\n54\n]\n, see\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Statistics",
    "Topology"
  ]
}