{
  "nome_completo": "Michael Hartley Freedman",
  "nome_curto": "Michael Freedman",
  "ano_nascimento": "1951",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Freedman/",
  "lugar_nascimento": "Los Angeles, California, USA",
  "lugar_morte": null,
  "biografia": "Michael Freedman\n's parents Benedict and Nancy Freedman are both quite famous. His mother, Nancy Mars, was born in Chicago in\n1920\nand had some acting roles before attending the Chicago Art Institute, Los Angeles City College, and the University of Southern California. She married Benedict Freedman on\n29\nJune\n1941\n. Benedict Freedman's father, David, was born in Romania. Benedict was a talented mathematician, musician and writer. He studied at Curtiss-Wright Technical Institute at Glendale, California, graduating with a degree in aeronautical engineering. He taught aeronautical engineering at Curtiss-Wright during the\n1940\ns but had a parallel career as a scriptwriter of radio shows, drama critic and newspaper editor. Benedict and Nancy Freedman are joint authors of several well-known novels. They had three children, Johanna, Michael and Deborah.\nMichael showed exceptional talents in mathematics as he grew up. However, he also enjoyed painting in an expressionist style and when he entered the University of California at Berkeley in\n1968\nhe still had not decided between mathematics and art. Quite quickly he made a firm decision to study mathematics but, near the end of his first year of study, he decided to apply to do graduate studies at Princeton University. Freedman enjoyed playing Go and he knew that the mathematician\nRalph Fox\nat Princeton was a champion Go player. He read\nFox\n's\n1963\ntext\nIntroduction to Knot Theory\nand included conjectures of his own in his application to Princeton in\n1969\n. He was awarded a doctorate by Princeton in\n1973\nfor his doctoral dissertation entitled\nCodimension-Two Surgery\n. His thesis supervisor was\nWilliam Browder\n.\nAfter graduating Freedman was appointed a lecturer in the Department of Mathematics at the University of California at Berkeley. He held this post from\n1973\nuntil\n1975\nwhen he became a member of the Institute for Advanced Study at Princeton. In\n1976\nhe was appointed as assistant professor in the Department of Mathematics at the University of California at San Diego.\nFreedman was promoted to associate professor at San Diego in\n1979\n. He spent the year\n1980\n/\n81\nat the Institute for Advanced Study at Princeton returning to the University of California at San Diego where he was promoted to professor on\n1982\n. He holds this post in addition to the Charles Lee Powell Chair of Mathematics which he was appointed to in\n1985\n.\nFreedman was awarded a\nFields Medal\nin\n1986\nfor his work on the\nPoincaré\nconjecture. The\nPoincaré\nconjecture, one of the famous problems of\n20\nth\n-century mathematics, asserts that a simply connected closed\n3\n-dimensional\nmanifold\nis a\n3\n-dimensional sphere. The higher dimensional\nPoincaré\nconjecture claims that any closed\nn\nn\nn\n-manifold which is\nhomotopy equivalent\nto the\nn\nn\nn\n-sphere must be the\nn\nn\nn\n-sphere. When\nn\n=\n3\nn = 3\nn\n=\n3\nthis is equivalent to the\nPoincaré\nconjecture.\nSmale\nproved the higher dimensional\nPoincaré\nconjecture in\n1961\nfor\nn\nn\nn\nat least\n5\n. Freedman proved the conjecture for\nn\n=\n4\nn = 4\nn\n=\n4\nin\n1982\nbut the original conjecture remained open until settled by\nG Perelman\nwho was offered the\n2006\nFields medal for his proof.\nMilnor\n, describing Freedman's work which led to the award of a Fields Medal at the International Congress of Mathematicians in Berkeley in\n1986\n, said:-\nMichael Freedman has not only proved the\nPoincaré\nhypothesis for\n4\n-dimensional\ntopological\nmanifolds, thus characterising the sphere\nS\n4\nS^{4}\nS\n4\n, but has also given us classification theorems, easy to state and to use but difficult to prove, for much more general\n4\n-manifolds. The simple nature of his results in the topological case must be contrasted with the extreme complications which are now known to occur in the study of differentiable and piecewise linear\n4\n-manifolds. ... Freedman's\n1982\nproof of the\n4\n-dimensional\nPoincaré\nhypothesis was an extraordinary tour de force. His methods were so sharp as to actually provide a complete classification of all compact simply connected topological\n4\n-manifolds, yielding many previously unknown examples of such manifolds, and many previously unknown homeomorphisms between known manifolds.\nFreedman has received many honours for his work. He was California Scientist of the Year in\n1984\nand, in the same year, he was made a MacArthur Foundation Fellow and also was elected to the\nNational Academy of Sciences\n. In\n1985\nhe was elected to the\nAmerican Academy of Arts and Science\n. In addition to being awarded the Fields Medal in\n1986\n, he also received the\nVeblen\nPrize from the\nAmerican Mathematical Society\nin that year. The citation for the\nVeblen\nPrize reads\n(\nsee\n[\n3\n]\n)\n:-\nAfter the discovery in the early\n60\ns of a proof for the\nPoincaré\nconjecture and other properties of simply connected manifolds of dimension greater than four, one of the biggest open problems, besides the three dimensional\nPoincaré\nconjecture, was the classification of closed simply connected four manifolds. In his paper, The topology of four-dimensional manifolds, published in the Journal of\nDifferential Geometry\n(1982)\n, Freedman solved this problem, and in particular, the four-dimensional\nPoincaré\nconjecture. The major innovation was the solution of the simply connected surgery problem by proving a homotopy theoretic condition suggested by Casson for embedding a\n2\n-handle, i.e. a thickened disc in a four manifold with boundary.\nBesides these results about closed simply connected four manifolds, Freedman also proved:\nAny four manifold properly equivalent to\nR\n4\n\\mathbb{R}^{4}\nR\n4\nis homeomorphic to\nR\n4\n\\mathbb{R}^{4}\nR\n4\n; a related result holds for\nS\n3\n×\nR\nS^{3} \\times  \\mathbb{R}\nS\n3\n×\nR\n.\nThere is a nonsmoothable closed four manifold.\nThe four-dimensional Hauptvermutung is false; i.e. there are four manifolds with inequivalent combinatorial triangulations.\nFinally, we note that the results of the above mentioned paper, together with\nDonaldson\n's work, produced the startling example of an exotic smoothing of\nR\n4\n\\mathbb{R}^{4}\nR\n4\n.\nIn his reply Freedman thanked his teachers\n(\nwhom he said included his students\n)\nand also gave some fascinating views on mathematics\n[\n3\n]\n:-\nMy primary interest in geometry is for the light it sheds on the topology of manifolds. Here it seems important to be open to the entire spectrum of geometry, from formal to concrete. By spectrum, I mean the variety of ways in which we can think about mathematical structures. At one extreme the intuition for problems arises almost entirely from mental pictures. At the other extreme the geometric burden is shifted to symbolic and algebraic thinking. Of course this extreme is only a middle ground from the viewpoint of algebra, which is prepared to go much further in the direction of formal operations and abandon geometric intuition altogether.\nIn the same reply Freedman also talks about the influence mathematics can have on the world and the way that mathematicians should express their ideas:-\nIn the nineteenth century there was a movement, of which\nSteiner\nwas a principal exponent, to keep geometry pure and ward off the depredations of algebra. Today I think we feel that much of the power of mathematics comes from combining insights from seemingly distant branches of the discipline. Mathematics is not so much a collection of different subjects as a way of thinking. As such, it may be applied to any branch of knowledge. I want to applaud the efforts now being made by mathematicians to publish ideas on education, energy, economics, defence, and world peace. Experience inside mathematics shows that it isn't necessary to be an old hand in an area to make a contribution. Outside mathematics the situation is less clear, but I cannot help feeling that there, too, it is a mistake to leave important issues entirely to experts.\nIn June\n1987\nFreedman was presented with the National Medal of Science at the White House by President Ronald Reagan. The following year he received the Humboldt Award and, in\n1994\n, he received the Guggenheim Fellowship Award.\nFreedman continued to hold the Charles Lee Powell Professorship of Mathematics at the University of California at San Diego until\n1998\nwhen he left the academic world to take up an appointment with Station Q, a Microsoft research group working on topological quantum computing. In doing so, Freedman became the first Fields Medallist to leave the academic world to work for a company. Freedman became the director of Station Q and to see a little of the topics that he worked on we will look at a few of the titles of the papers he has written over the succeeding ten years. First we note that he gave an invited address to the International Congress of Mathematicians in Berlin in\n1998\non\nTopological views on computational complexity\n. Then he published papers such as:\nQuantum computation and the localization of modular functors\n(2001)\n;\nProjective plane and planar quantum codes\n(2001)\n;\nPoly-locality in quantum computing\n(2002)\n;\nSimulation of topological field theories by quantum computers\n(2002)\n;\nTopological quantum computation\n(2003)\n; Approximate Counting and Quantum Computation\n(2005)\n;\nTopological quantum computation\n(2006)\n;\nTopological quantum computing with only one mobile quasiparticle\n(2006)\n;\nInteracting anyons in topological quantum liquids: The golden chain\n(2008)\n;\nMeasurement-Only Topological Quantum Computation\n(2008)\n; and\nTopological Phase in a Quantum Gravity Model\n(2008)\n. He also published some papers which were not related to quantum computing such as\nExtension of incompressible surfaces on the boundaries of\n3\n-manifolds\n(2000)\n,\nDiameters of Homogeneous Spaces\n(2003)\n, and\nCovering a nontaming knot by the unlink\n(2007)\n.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}