{
  "nome_completo": "Mikhael Leonidovich Gromov",
  "nome_curto": "Mikhael Leonidovich Gromov",
  "ano_nascimento": "1943",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gromov/",
  "lugar_nascimento": "Boksitogorsk, Russia",
  "lugar_morte": null,
  "biografia": "Mikhael Leonidovich Gromov\nwas born in Boksitogorsk, a town about\n200\nkm east of St Petersburg\n(\nor Leningrad as it was called at the time of his birth\n)\n. His parents were Leonid Gromov and Lea Rabinovitz. Gromov attended Leningrad University, graduating with a Masters degree in Mathematics in\n1965\n. The Masters degree in the Russian system is essentially equivalent to a doctorate in the USA. He continued to study to become a university teacher being awarded a doctorate\n(\nequivalent to the\nhabilitation\n)\nin\n1969\n. He research supervisor at Leningrad was\nVladimir Abramovich Rokhlin\nwho had been a student of\nAndrei Nikolayevich Kolmogorov\nand\nLev Semenovich Pontryagin\n. Before the award of his doctorate, Gromov had been married to Margarita Gromov in\n1967\nand appointed as an Assistant Professor at Leningrad University in the same year. He continued in this role until\n1974\n.\nThe papers which Gromov published in the late\n1960\ns include the following\n(\nall written in Russian\n)\n:\nOn a geometric hypothesis of Banach\n(1967)\n;\nThe number of simplexes in subdivisions of finite complexes\n(1968)\n;\nTransversal mappings of foliation\ns\n(1968)\n;\nTransversal mappings of foliations\n(1968)\n;\nSimplexes inscribed on a hypersurface\n(1968)\n; and\nStable mappings of foliations into manifolds\n(1969)\n.\nGromov's mathematical contributions, beginning in this period, are described by Hung-Hsi Wu:-\nAround\n1970\n, the world of differential geometry was astounded by the news that a young Russian by the name of Mikhael Gromov had proved that any noncompact differential manifold admits a Riemannian metric of positive sectional curvature, and also one of negative sectional curvature. We were also told that this was achieved by a \"soft\" method of topological sheaves. Moreover, in one and the same setting, Gromov also proved generalizations of both the Hirsch-\nSmale\nimmersion theorem and the A Phillips submersion theorems. Many more results were promised. Slowly, Gromov's papers\n(\nsome in collaboration with Ya M Eliashberg and\nV A Rokhlin\n)\nfiltered to the West in the early seventies.\nIn\n1970\nthe International Congress of Mathematicians was held in Nice, France. Gromov had been invited to address the Congress but was not allowed to leave the USSR by the Soviet authorities. He did, however, contribute the text of his lecture\nA topological technique for the construction of solutions of differential equations and inequalities\nwhich was published in the Conference Proceedings in\n1971\n. This is one of the papers referred to in the above quote by Wu, as are Gromov's papers\n(\nwith\nV A Rokhlin\n)\nImbeddings and immersions in Riemannian geometry\n(1970)\n, and\n(\nwith Ya M Eliashberg\n)\nElimination of singularities of smooth mappings\n(1971)\n. For his outstanding work Gromov was presented with the Award of the\nMoscow Mathematical Society\nin\n1971\n. He then presented his Post-doctoral Thesis to Leningrad University in\n1973\n.\nIn\n1974\nGromov left Russia for the United States when he was appointed as Professor of Mathematics at the State University of New York at Stony Brook. In\n1979\nhe gave a course of lectures\nStructures métriques pour les variétés riemanniennes\nat Paris VII which have been remarkably influential. These notes were published in\n1981\nand Gromov wrote in the Preface:-\nThese notes are from a course given at the University of Paris VII during the last trimester of\n1979\n. Our purpose was to present some of the links that have been established between the curvature of a Riemannian manifold V and its global behaviour. Here, the word 'global' applies not only to the topology of V but also to a family of metric invariants of Riemannian manifolds and mappings between these manifolds. The simplest metric invariants of V are, for example, its volume and its diameter; the dilatation is an important invariant for a mapping from\nV\n1\nV_{1}\nV\n1\n​\ninto\nV\n2\nV_{2}\nV\n2\n​\n. In fact, such metric invariants also appear in a purely topological context, and they provide an important link between infinitesimal data on V\n(\ngenerally expressed by a condition on the curvature\n)\nand the topology of V. For example, the now classical theorem of Bonnet gives an upper bound for the diameter of a manifold V with positive curvature, from which one can deduce the finiteness of the fundamental group of V. A deeper topological study of Riemannian manifolds requires finer metric invariants than diameter or volume; we have tried to present a systematic treatment of these invariants, but this study is far from being as comprehensive as we had hoped.\nAn English edition of these notes was published as\nMetric structures for Riemannian and non-Riemannian spaces\nin\n1999\n. Igor Belegradek begins a review as follows:-\nThe first edition of this book, published in French\n[\nStructures métriques pour les variétés riemanniennes\n(1981)]\n, is considered one of the most influential books in geometry in the last twenty years. Since then the boundary of the field has dramatically exploded. Reflecting this growth, the new English edition has almost quadrupled in size. Among the most substantial additions, each taking over a hundred pages, there is a chapter on convergence of metric spaces with measures, and an appendix on analysis on metric spaces written by Semmes. In addition, numerous remarks, examples, proofs, and open problems are inserted throughout the book. The original text is mostly preserved with new items conveniently indicated by a subscript +.\nIn\n2005\nGromov received the\nJanos Bolyai\nInternational Mathematical Prize for this\n1999\nbook. We have been following the remarkable developments which have come from Gromov's\n1979\ncourse in Paris. We should return to relate how his career developed from that time. In\n1981\nhe moved from the State University of New York at Stony Brook to the Université de Paris VI and the following year he moved to the Institut des Hautes Études Scientifiques where he was made a permanent member. He has continued to hold this position but has, in addition, had posts in the United States. He was Professor of Mathematics at University of Maryland, College Park from\n1991\nto\n1996\n, and then Jay Gould Professor of Mathematics at the\nCourant\nInstitute of Mathematical Sciences, New York University from\n1996\n.\nWe have explained above that the Soviet authorities did not allow Gromov to attend the International Congress of Mathematicians in Nice in\n1970\nto which he had been invited as a speaker. He was able to accept invitations to speak at the International Congresses of Mathematicians in Helsinki\n(1978)\nand Warsaw\n(1982)\n. In\n1986\nhe was an invited plenary speaker at the International Congress of Mathematicians in Berkeley where he spoke on\nSoft and hard symplectic geometry\n. Hung-Hsi Wu writes:-\nThis is a survey of the recent work on symplectic geometry, with emphasis on the author's own contributions .... First, some explanations about the title. In the author's own words, \"Intuitively, 'hard' refers to a strong and rigid structure of a given object, while 'soft' suggests some weak general property of a vast class of objects. ... 'Soft' and 'hard' in this talk are limited to the framework of the global nonlinear analysis concerning the geometry of spaces of maps between smooth manifolds\".\nIn\n1985\nGromov was a plenary speaker at the British Mathematical Colloquium in Cambridge when he lectured on\nDifferential geometry with and without infinitesimal calculus: anatomy of curvature\n.\nGromov has received a fantastic collection of major mathematical prizes for his wonderful contributions. These include: the\nOswald Veblen\nPrize in Geometry from the\nAmerican Mathematical Society\n(1981)\n:-\n... for his work relating topological and geometric properties of Riemannian manifolds;\nthe Prix\nÉlie Cartan\nof the Académie des Sciences of Paris\n(1984)\n; the Prix de l'Union des Assurances de Paris\n(1989)\n; and the Wolf Prize in Mathematics\n(1993)\n. In\n1997\nhe was awarded the\nLobachevsky\nMedal and, in the same year, he received the Leroy P Steele Prize from the\nAmerican Mathematical Society\nfor Seminal Contribution to Research:-\n... for his paper \"Pseudo-holomorphic curves in symplectic manifolds\", which revolutionized the subject of symplectic geometry and topology and is central to much current research activity, including quantum cohomology and mirror symmetry.\nThis\n1985\npaper opens a new effective approach to fundamental problems of symplectic topology. In\n1999\nGromov was awarded the Balzan Prize for Mathematics. The Laudatio for this Prize reads:-\nMikhael L Gromov is, without any doubt, one of the greatest geometers of this century. His work is unique through the abundance and the force of the concepts he has created, as well as through the new techniques he has devised and applied to solve problems, often simple to state and to understand, and which seem, at first sight, inaccessible. Some of those problems were long standing, and their unexpected solutions caused wonder and surprise due to the originality and elegance of the method conceived by Gromov: famous instances are his proof of the old conjecture according to which a finitely generated group of polynomial growth has a nilpotent subgroup of finite index, or the beautiful construction\n(\ntogether with I Pyatetski-Shapiro\n)\nof non-arithmetic discrete groups of hyperbolic transformations in arbitrary dimension. On the other hand, new techniques developed by Gromov for different purposes led to completely new kinds of problems: one can imagine the great variety of questions arising from the introduction of a natural geometric structure on the set of all\n(\nisomorphism classes\n)\nof Riemannian manifolds, or from the discovery of many new and remarkable invariants of manifolds\n(\ne.g., the K-area, the simplicial volume, the minimal volume, etc.\n)\n, not to forget important new notions, such as that of hyperbolic groups, which is at the origin of major recent developments in differential geometry. To summarise, Gromov has brought about not only solutions to famous and time-old problems, but also the bases of new fields of study for many scholars. It has been emphasised above that he tends to look at all questions from the geometric side: he translates them in ad hoc geometric terms, and uses his extraordinary geometric intuition to investigate them thoroughly; it should be added that he is also able to treat, in the same way, questions coming from the most diverse branches of mathematics: algebra, analysis, differential equations, probability theory, theoretical physics, etc. Due to the large number of his disciples and the wide repercussions aroused by his important discoveries, Mikhael Gromov has had, and will continue to have, a considerable influence on contemporary mathematics.\nThe next major prize to be presented to Gromov was the\n2002\nKyoto Prize:-\nThe\n2002\nKyoto Prize laureate in Basic Sciences is Mikhael Leonidovich Gromov of France. His contributions, including the introduction of a metric structure for families of various geometrical objects, have led to dramatic developments in geometry and many other fields of mathematics. Gromov has pioneered entirely new disciplines in a variety of fields, including geometry and analysis, and has had a substantial impact on all the mathematical sciences. Through the application of innovative ideas and radical nontraditional mathematical methods, he has also solved a great many complicated problems in modern geometry.\nHe received the\n2004\nFrederic Esser Nemmers Prize in Mathematics from Northwestern University:-\n... for his work in Riemannian geometry, which revolutionized the subject; his theory of pseudoholomorphic curves in symplectic manifolds; his solution of the problem of groups of polynomial growth; and his construction of the theory of hyperbolic groups.\nIn\n2008\nthe\nLondon Mathematical Society\nelected Gromov to Honorary Membership of the Society:-\n... in recognition of his profound and extraordinary insights whose influence extends far beyond the boundaries of his own field of geometry.\nPerhaps the most prestigious of all the major awards he has received was the\nAbel\nPrize for\n2009\n:-\nThe Russian-French mathematician Mikhail L Gromov is one of the leading mathematicians of our time. He is known for important contributions in many areas of mathematics, especially geometry. Geometry is one of the oldest fields of mathematics; it has engaged the attention of great mathematicians through the centuries, but has undergone a revolutionary change in the last\n50\nyears. Mikhail Gromov has led some of the most important developments, producing profoundly original general ideas which have resulted in new perspectives on geometry and other areas of mathematics. Gromov's name is forever attached to deep results and important concepts within Riemannian geometry, symplectic geometry, string theory and group theory. The\nAbel\ncommittee says: \"Mikhail Gromov is always in pursuit of new questions and is constantly thinking of new ideas for solutions to old problems. He has produced deep and original work throughout his career and remains remarkably creative. The work of Gromov will continue to be a source of inspiration for many future mathematical discoveries\".\nLet us end this biography by quoting from G Elek\n[\n1\n]\n:-\n[\nGromov\n]\nhas truly revolutionised geometry; laid the foundations of brand new fields, introduced spectacularly new viewpoints and a philosophy which makes his papers and thoughts unmistakable.\nEzra Getzler writes:-\nHis work is both tremendously elegant and immediately relevant to problems in applied mathematics in a way that reflects his tremendous creativity and excellent taste.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}