{
  "nome_completo": "Miles Bland",
  "nome_curto": "Miles Bland",
  "ano_nascimento": "1786",
  "ano_morte": "1867",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bland/",
  "lugar_nascimento": "Sedbergh, Yorkshire, England",
  "lugar_morte": "Ramsgate, Kent, England",
  "biografia": "Miles Bland\nwas the son of Thomas Bland and Esther Siddal. The Bland family is an ancient one\n[\n3\n]\n:-\nThe family of Bland is purely English, and of high antiquity ... Their surname is derived from Bland, or Bland's-Gill, a hamlet in the chapelry of Howgill, and Parish of Sedbergh.\nWe were slightly surprised that obituaries of Miles Bland mention much about the Bland family but little or nothing about his parents. For example over a third of the Royal Astronomical Society obituary\n[\n8\n]\nconcerns the Bland family, yet Miles' parents are not mentioned. We believe that the details we give below are accurate and most are contained in\n[\n12\n]\n.\nThomas Bland was baptised on\n10\nApril\n1728\nin the Parish Church of Sedbergh, the son of Myles Bland. Thomas married his first wife Margaret Thompson\n(\nborn\n1726)\non\n3\nJune\n1750\nin Bampton, Westmoreland, England. They had at least\n5\nsons and\n2\ndaughters. Margaret died in Sedbergh and was buried in the Parish Church on\n12\nJanuary\n1785\nat the age of\n59\n. Thomas married Esther Siddal\n(\nborn\n1760)\non\n29\nJune\n1786\n; their son Miles Bland, the subject of this biography, was born on\n11\nOctober\n1786\nand baptised on\n12\nNovember\n1786\n. Their daughter, Margaret Bland, was baptised on\n9\nJanuary\n1788\n. Thomas Bland, Miles' father, was buried in the Parish Church on\n18\nJuly\n1790\nat the age of\n62\n. Esther Bland, Miles' mother, died at the age of\n38\nand was buried in the Parish Church on\n3\nFebruary\n1799\n.\nMiles was educated at Sedbergh School. This school was founded Roger Lupton\n(1456\n-\n1540)\n, who served as chaplain to both Henry VII and Henry VIII, around\n1525\n. Lupton endowed\n[\n11\n]\n:-\n... his new School with a liberal supply of scholarships and fellowships; six of the former, augmented a few years afterwards to eight, and two of the latter. These were all to be held at St John's College, Cambridge, by scholars chosen \"only of Sedbergh School and no other.\" From this date the close, almost parental, relation, in which the College has, until quite recently, stood to the School.\nThe headmaster of Sedbergh School, who arrived in\n1799\nin the middle of Bland's time at the school, was William Stevens. He was an excellent scholar but the School did not flourish under his leadership\n[\n11\n]\n:-\nThe utmost liberty was allowed in the time and place of preparing lessons - they might be learnt on the fells, or by the riverside; but if not known, there remained no alternative but the severest flogging. As time were on, severity deepened into cruelty, which, added to his growing remissness, gradually emptied the School ...\nWe do not know what Bland's opinion was of Stevens but, after the death of both Stevens and his wife in\n1819\nleaving a large family in financial difficulty, Bland succeeded in raising a large sum from former pupils of the school to support the Stevens family.\nBland was in the same class at Sedbergh School as Adam Sedgwick\n(1785\n-\n1873)\nand both went up to Cambridge in\n1804\n. Sedgwick studied the mathematical tripos at Trinity College and went on to become Professor of Geology at Cambridge. Bland was admitted to St John's College as a\nsizar\non\n11\nJune\n1804\n, and matriculated in October of that year at the start of the Michaelmas term. The Lucasian Professor of Mathematics was Isaac Milner\n(1750\n-\n1820)\nwho had been appointed to the chair in\n1798\n, and the Professor of Astronomy was\nSamuel Vince\nwho wrote many mathematics papers. An important person in Bland's highly successful undergraduate career was John Dawson\n(1734\n-\n1820)\n[\n6\n]\n:-\nPrivate tuition at Cambridge was in those days little known, but he had the advantage of instruction from a tutor of whom he always spoke with affection as Johnnie Dawson. Dawson was a retired surgeon of Sedburgh, known to his poorer neighbours by many a gratuitous service which he would do to them, but known to Cambridge men as the great private tutor of his day. Men went to read with him in the Vacations, and sent problems to him from Cambridge for his solutions. Bland was wont to say that Dawson had had eleven Senior\nWranglers\nfor pupils, and intended him to be the twelfth; but he was second to Bickersteth, afterwards Lord Langdale; Blomfield, afterwards Bishop of London, being third.\nBland was Second Wrangler in the Mathematical Tripos examinations of\n1808\nand was the Second Smith's Prizeman. His friend and fellow student from Sedbergh School, Adam Sedgwick, was Fifth Wrangler. Bland was elected a Fellow at St John's College on\n5\nApril\n1808\nand, in addition to teaching mathematics, worked towards being ordained, a necessary career path for fellows until the mid\n19\nth century. He took orders in the church, being ordained Deacon in Norwich on\n21\nDecember\n1809\nand ordained Priest in Salisbury on\n20\nDecember of the following year with permission for ordination being granted by Thomas Dampier, the Bishop of Ely.\nIn his role as a tutor, which he began in\n1809\n, Bland was very successful\n[\n6\n]\n:-\nThere were those who owed everything in life to the counsel and care which they received from him at College. During his residence at Cambridge he had been active in the University as well as in his College.\nIn\n[\n5\n]\nsimilar information is given:-\nIn College Bland was highly esteemed as a lecturer and not less as an adviser and personal friend to his pupils.\nIn\n1814\n,\n1815\nand in\n1816\nMiles Bland was a Moderator of the Mathematical Tripos. He was Second Moderator in\n1814\nwith George Macfarlan of Trinity College, Chief Moderator in\n1815\nwith William Hustler of Jesus College and again Chief Moderator in\n1816\n, this time with assistance from William French of Pembroke College.\nHe was also a highly successful author of mathematics textbooks, some of which ran to many editions. He published\nAlgebraical Problems producing Simple and Quadratic Equations with their Solutions. Designed as an introduction to the higher branches of analytics\n(1812)\n,\nThe Elements of Hydrostatics: with their application to the Solution of Problems. Designed for the use of students in the university\n(1824)\n,\nGeometrical problems deducible from the First Six Books of Euclid arranged and solved: to which is added an Appendix containing the elements of Plane Trigonometry\n(1827)\n,\nMechanical Problems adapted to the course of reading pursued in the University of Cambridge collected and arranged for the use of students\n(1828)\n, and\nProblems in the different branches of philosophy, adapted to the course of reading pursued in the University of Cambridge collected and arranged for the use of students\n(1830)\n. His\nAlgebraical Problems\nbook ran to at least nine editions, the ninth being in\n1849\n. This book had an Appendix added from the Sixth Edition onwards, the Appendix containing \"a collection of problems of the nature and solution of equations of higher dimensions.\"\nFor more information about these books, see our collection of their Prefaces at\nTHIS LINK\n.\nBland continued as a Tutor, first as Assistant Tutor, and afterwards as joint Tutor with Thomas Waldron Hornbuckle\n(1775\n-\n1848)\n, till\n1823\n, when he took the College living of Lilley, in Hertfordshire. St John's College had various livings, consisting of land, property and churches, from which they had an income and fellows, after being ordained, were provided with a career path enabling them to marry by accepting a living. We note that Hornbuckle was a fellow until\n1828\nwhen he became rector of Staplehurst, Sevenoaks, Kent.  Bland married soon after taking up the living of Lilley, a small village north of Luton. On\n22\nJuly\n1823\nhe married Ann Templeman, the daughter of Thomas Templeman\n(1754\n-\n1782)\nand his wife Catherine Winter\n(1762\n-\n1856)\n. Thomas and Catherine Templeman were married in Row, Cornwell on\n18\nMay\n1782\n. Ann Templeman was born on\n2\nNovember\n1795\nand baptised at St Stephen, Walbrook, City of London on\n7\nNovember\n1795\n. Miles and Ann Bland had two sons, Miles Bland baptised\n17\nSeptember\n1828\nin Lilley, Hertfordfordshire\n(\ndied\n1881)\nand George Templeman Bland baptised\n30\nApril\n1830\nin Ramsgate, Kent\n(\ndied\n1856)\n. They also had a daughter Catherine Henrietta Law Bland, baptised on\n15\nJuly\n1824\nin Lilley, Hertford\n(\nmarried Thomas De Freyne French on\n20\nAugust\n1867\nand died in\n1888)\n.\nLet us continue the story of Bland's family life. His wife, Ann Bland, died and was buried on\n2\nSeptember\n1831\n. Bland married Emma Russell on\n14\nJune\n1836\nin Christ Church, St Marylebone, Westminster, England. Emma had been born in India in\n1794\n, the daughter of Claud Russell\n(1732\n-\n1820)\nand Leonora Pigot\n(1762\n-\n1829)\n. At the time of the\n1851\nUK Census the family, consisting of Miles and Emma Bland and Miles' daughter Catherine Henrietta Law Bland, are living at Lilley. They have living with them a cook, a housemaid, a kitchen maid and a house servant\n[\n6\n]\n:-\nBland resided at Lilley, till failing health obliged him to seek change of climate at Ramsgate. After some years he returned to Lilley, but was obliged again to leave it, and resided ever after at Ramsgate till his death, which took place at the age of\n81\nyears. He never held any other preferment than his living, except a prebend at Wells, little more than honorary, to which he was presented by Bishop Law.\nAfter he left his position as a fellow and tutor at St John's College, Bland continued to publish new mathematical texts and also bring out new editions of all these works. He also began to publish religious texts, the first being\nAnnotations on the Historical Books of the New Testament, designed for the Use of Students at the University and Candidates for Holy Orders\nVol I\n. containing St Mathew's Gospel. The second volume in this series was\nAnnotations on the Historical Books of the New Testament, designed for the Use of Students at the University and Candidates for Holy Orders\nVol II\n. containing St Mark's Gospel\n(1829)\n. This work has a long Preface which would be out of place in this collection of biographies of mathematicians but let us indicate the scope of the work by giving the publisher's information:-\nThis work has been particularly designed for Students preparing for Examination and will be found to contain Answers to most of the Questions which are usually proposed. It has met with the approbation of some of the Prelates and Dignitaries of the Church, who have examined its contents. It has been arranged on the plan of giving what appeared to be the correct interpretation, and not leaving the Student bewildered rather than enlightened by a multitude of criticisms and opinions. The explanations are such as confirm the interpretations put upon them by the Articles, Liturgy, and Formularies of the Established Church.\nClearly Bland must have intended to write two further volumes on St Luke's Gospel and St John's Gospel. These, however, were never published and we have no idea why he did not continue with this series. His health certainly deteriorated and this may have been the reason although he did continue with his mathematical texts. He did publish one further religious work, namely\nConfession. A sermon preached in the Parish Church of St Lawrence, in Thanet. November\n21\nst,\n1858\n. Clearly he had been associated with the Church of St Lawrence-in-Thanet in Ramsgate when he was living in that town so his address to the Rev George Wilson Sicklemore, Vicar of St Lawrence-in-Thanet at the beginning of the work is interesting. It begins:-\nIt is now fast approaching to a quarter of a century since I resigned into your hands the charge of the Parish with which I had been entrusted during the latter part of the life of your Predecessor. I still look back with pleasure upon the kindness I then received almost universally from every class, rich and poor, more especially the latter: And on the few occasions on which I have since had an opportunity of meeting them again in the Church, I have been gratified to find a similar good feeling towards the Pastor appointed to feed that portion of Christ's flock, which is now under your care.\nThat same feeling and interest in whatever is connected with the welfare of the Church, has led you and those of your Parishioners who coincided in your views, in very flattering terms to request the publication of the Discourse which I lately addressed to them, after a very long silence caused by illness, which at an advanced age has withdrawn me of necessity from all parochial duty ...\nWe should note Bland was one of the first fellows of the\nRoyal Astronomical Society\n. The Society, at that stage called the Astronomical Society of London, had been founded at the meeting on Wednesday\n12\nJanuary\n1820\nhaving present fourteen founder members including\nJohn Herschel\nand\nCharles Babbage\n. Bland was one of thirteen proposed for membership at the meeting of\n14\nApril\n1820\n, all being elected at the meeting of\n9\nJune\n1820\n. Miles was elected a fellow of the\nRoyal Society\non\n12\nApril\n1821\n. In the following year he was elected to the Antiquarian Society and he was also a member of the Royal Society of Literature, elected in\n1831\n.\nBland died at the age of\n81\nin Ramsgate where his address was\n5\nRoyal Crescent, Ramsgate\n[\n6\n]\n:-\nHe died of old age, without suffering, and in unclouded mental vigour, on a day which to a man of his strong affection for his College and for Cambridge, had brought always recollections of old friends, December\n27\nth ...\nWe note that the date was a significant one for\n27\nDecember is the Saint's Day of St John the Evangelist. The formal name of St John's College, Cambridge, is \"College of St John the Evangelist in the University of Cambridge.\"",
  "math_areas": []
}