{
  "nome_completo": "Williamina Paton Fleming",
  "nome_curto": "Mina Fleming",
  "ano_nascimento": "1857",
  "ano_morte": "1911",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fleming/",
  "lugar_nascimento": "Dundee, Angus, Scotland",
  "lugar_morte": "Boston, Massachusetts, USA",
  "biografia": "Williamina Paton Fleming\nwas the daughter of Robert Stevens\n(1826\n-\n1864)\nand Mary Walker\n(1832\n-\n1910)\n. She was given the name\nWilliamina Paton Stevens\nand only used the name Fleming after her marriage. She was known to her friends and colleagues as Mina; in fact she wrote papers under the name 'M Fleming'. Robert Stevens was a craftsman, a carver of wood frames which he gilded with gold leaf and sold in a shop. He was also a pioneer in daguerreotype photography and is said to have introduced Dundee to this photography. He married Mary Walker at Saint Nicholas Church in Aberdeen, Scotland, on\n5\nJuly\n1850\n. Robert and Mary Stevens had ten children: Robert Nicholson Stevens\n(1851\n-\n1922)\n; Richard Stevens\n(1852\n-\n1857)\n; Mary Anderson Stevens\n(1854\n-\n1903)\n; John Maule Stevens\n(1855\n-\n1911)\n; Williamina Paton Stevens\n(1857\n-\n1911\n, the subject of this biography\n)\n; Andrew Killock Stevens\n(1859\n-\n1863)\n; Joanna Crighton Stevens\n(1860\n-\n1943)\n; Fox Maule Stevens\n(1862\n-\n1864)\n; Charles James Stevens\n(1863\n-\n1920)\n; and Alexander Blair Spence Stevens\n(1864\n-\n1864)\n. Of these ten, four of the boys died aged five or less so Mina grew up with three brothers and two sisters.\nIt is worth putting the children's deaths into context in terms infant mortality in Dundee at this time. By the early\n1860\ns the population of the city was around\n100\n,\n000\nhaving grown by over\n200\n% in\n40\nyears. This caused desperate overcrowding and the city had the worst infant mortality of any town in Scotland with a high death rate for children under five. The year from October\n1863\nto October\n1864\nwas a disastrous one for the Stevens family. Andrew Killock Stevens died on\n7\nOctober\n1863\n, Fox Maule Stevens died on\n13\nJanuary\n1864\n, then, shortly after, Mina was involved in an accident with a railway delivery truck which crushed her left ankle. Doctors advised amputation of her left leg at the knee, but her father wanted the doctors to try to save her leg. For several years Mina struggled to walk with a steel-reinforced leather boot. Before treatment on Mina's leg began, however, Robert Stevens died on\n19\nMarch\n1864\n. Later that year, Alexander Blair Spence Stevens died on\n24\nOctober\n1864\n.\nLet us look at the family at the time of the\n1871\ncensus. They are living at\n62\nWilliam Street, Dundee with Mary Stevens, Mina's mother, as the head of the family, giving her occupation as teacher of wax flowers. Mary's parents, John Walker, Chelsea Pensioner Sergeant\n79\nth Cameron Highlander, and Mary Walker, are living there. Six of Mary's children are living in that home: Robert Nicholson Stevens, a merchants clerk; Mary Anderson Stevens, a teacher of music; John Maule Stevens, a mechanic fitter; Williamina Paton Stevens, a scholar; Joanna Crighton Stevens, a scholar; and Charles James Stevens, also a scholar.\nMina's crushed ankle was not her only major health problem as she grew up for, when she was ten years old, she was diagnosed with a weak heart and spent a year in a children's hospital. Once out of hospital she was able to continue with her schooling. When she reached the age of fourteen, she became a student teacher. She taught for six years, for one of those in schools in Dundee and for the remaining five years in schools in Broughty Ferry. Although Dundee was a very poor city with many men unemployed while their wives worked in extremely difficult conditions in jute and jam factories, Broughty Ferry was the small adjacent town where the owners of the factories lived. It is said by some that Broughty Ferry was the richest town in Britain at this time.\nOn\n26\nMay\n1877\n, Mina married James Orr Fleming\n(1841\n-\n1900)\nat the United Presbyterian Church in Dundee. James Fleming had been born on\n2\nJuly\n1841\nin Abbey Paisley, Renfrewshire, Scotland to Archibald Fleming and Agnes Orr. He was a banker who married Isabella Brown Barr\n(1847\n-\n1869)\nin June\n1866\n; they had a daughter Nancy Brown Fleming born in April\n1867\n. Mina and James Fleming had a son who died as a baby. We cannot find details of this son but Mina referred to this son \"who didn't live to grow up\" in a letter she wrote in\n1905\n. It appears that the loss of their son put a strain on the Fleming's marriage.\nFive of the six Stevens children would emigrate to the United States, the first being the eldest Robert Nicholson Stevens who arrived in New York on\n22\nNovember\n1876\n. He went to Cambridge, Massachusetts where he met Annie Florence Emerson\n(1854\n-\n1939)\n; they married on\n3\nApril\n1879\n. Mina and James Fleming left Scotland and sailed to New York arriving on\n3\nDecember\n1878\n. We know events that happened over the following months but, as we shall explain, the timing of these is not known. Let us first give what appears the most likely series of events. We know that Mina became pregnant in January\n1879\n. Her husband leaves her alone in New York, without financial support, so she goes to Boston to her brother Robert. She is at the wedding of her brother in Boston in April\n1879\n; by coincidence both Mina and her sister-in-law are three months pregnant at this time. Mina needs to support herself and she is employed by Edward Charles Pickering, the head of Harvard College Observatory, as a housemaid. She returned to Scotland for the birth of her son who was born in Dundee on\n6\nOctober\n1879\n. The birth certificate gives the name of her son as Edward Charles Pickering Fleming. Robert and Annie Stevens' son Albert Emerson Stevens was born on\n30\nOctober\n1879\nin Cambridge, Massachusetts.\nMina Fleming was still in Dundee at the time of the\n1881\ncensus. The family were living at\n35\nAlexander Street, Dundee with the head of the family given as Mary Walker, Mina's grandmother. Also living in the house are: Mary Stevens, Mina's mother, whose occupation is given as dressmaker; Mina Fleming, whose occupation is also given as dressmaker; Charles James Stevens, Mina's younger brother who is a cloth lapper; Edward Charles Pickering Fleming, Mina's son; and Margaret Lindsay, a boarder who is an apprentice dressmaker. Shortly after the\n1881\ncensus was taken, in April\n1881\nMina sailed back from Glasgow to Boston and once again worked for Pickering at the Harvard Observatory. She left her son with her mother in Dundee.\nWe mentioned above that there are other somewhat different theories as to events between Mina arriving in the United States on\n3\nDecember\n1878\nand returning to Dundee for the birth of her son. The fact that the full name of the astronomer Edward Charles Pickering is the given name of Mina's son have led some to wonder if Pickering was the father of her son. Let us note that Pickering had married Lizzie Wadsworth Sparks in\n1874\nbut they never had children. Supporting this theory is the fact that Pickering must have paid for Mina's fares to Scotland and then back to the United States. Also if Pickering was the father of the child, then one might understand why her husband might choose to leave her. We must say, however, that we find this theory highly unlikely; there just does not seem to be enough time between Mina arriving in New York and her becoming pregnant. It is probable that she gave her son Pickering's name because he had been so supportive of her when she was in great difficulty without a husband to support her.\nLet us now refer to Mina Fleming simply as Fleming for the rest of this biography. When she had worked as Pickering's housemaid in\n1879\n, she had not been employed by the Harvard Observatory but, after she returned in\n1881\n, she joined the staff. The observatory had started employing female assistants in\n1875\nand five had been appointed including\nAnna Winlock\nwho had been appointed after the death of her father the astronomer and mathematician\nJoseph Winlock\n. Pickering wrote\n[\n40\n]\n:-\nMrs Fleming began work at Harvard Observatory in\n1881\n. Her duties were at first of the simplest character, copying and ordinary computing.\nFleming began working on the\nAnnals of Harvard College Observatory\n[\n22\n]\n:-\nFleming had started working on the first part of Volume XIV of the 'Annals', supplying copy for the Harvard Photometry catalogue to the printers regularly throughout\n1883\n. ... During\n1884\nMina moved on to Part II of Volume XIV which included a literature review from old catalogues, going back to\nPtolemy\nand\nWilliam Herschel\n; this work included discussion of sources of error, which would have given her a better understanding of the nature and requirements of astronomical research. Pickering was clearly pleased with the speed and accuracy of her work on the 'Annals'.\nVolume\n14\nof the\nAnnals\ncontained\nObservations with the meridian photometer,\n1879\nto\n1882\nby Edward Charles Pickering, Arthur Searle and Oliver C Wendell, Part\n1\nbeing published in\n1884\nand Part\n2\nthe following year. Fleming continued assisting Pickering and in\n1886\nshe began her most important work on the Draper Catalogue of Stellar Spectra. Henry Draper had been the first to take photographs of spectral lines of stars and from\n1872\nto his death in\n1882\ntook over\n100\nsuch photographs. Pickering began a project on stellar photography in\n1882\nwith the aim of estimating the brightness of stars. By\n1885\nhe had received funding which allowed him to extend the photographic survey and include spectral studies of bright stars. In\n1886\nAnna Palmer Draper, Henry Draper's widow, began funding Pickering's project as a memorial to her husband. By October of that year around\n190\nplates had been measured by Nettie Farrar, who had been appointed in\n1881\nshortly before Fleming. Pickering informed his staff in December\n1886\n[\n32\n]\n:-\nMiss Farrar who has measured all the plates until recently, is about to get married ... she is now instructing Mrs Fleming who has assisted me, and who will I think take her place satisfactorily.\nAnnie Jump Cannon\n, who was appointed to work with Fleming ten years later, explained in\n[\n10\n]\nhow Fleming went about her work:-\nBy placing a prism in front of the object-glass of the telescope, the spectra of all the brighter stars were obtained. Thus an almost untrodden field lay open for the investigator, a field that was destined to produce a vast amount of material for the astronomical discussions of the future. As the work progressed, Mrs Fleming was put in charge of the original examination of the photographic plates, their care and storage, and the classification of objects found upon them. Gifted with great keenness of vision and a clear and logical mind, she at once gave evidence of ability for the work. Each photographic plate may be likened to the only existing copy of a valuable book, and, being very fragile, must be safely stored, and at the same time must be accessible, so as to be consulted readily at any moment. When a sufficient amount of material was at hand, the first general photographic classification of stellar spectra was undertaken, and was assigned to Mrs Fleming. The results are published in the \"Draper Catalogue,\" which forms Vols. XXVI and XXVII of the Harvard Annals, and gives the spectra of\n10\n,\n351\nstars, with measures of their photographic light. She observed, in classifying these spectra, that while a large proportion of them fall in classes resembling a few typical stars, there are also many that are peculiar. By the presence of bright lines in their spectra, she thus discovered ten Novae, and more than three hundred stars that vary in light. In the early days, when celestial photographs were rare, and some of these discoveries were attributed by sceptics to defects on the film, she never doubted the validity of the photographic evidence. Her industry was combined with great courage and independence.\nLess than a year after Fleming began working on the plates for the Draper Catalogue she was joined in Boston by her mother and son. Eight year old Edward Pickering Fleming left Dundee in\n1887\nand, with his grandmother Mary Stevens, sailed from Glasgow to Boston on the\nSS Prussian\nand arrived in Boston on\n26\nSeptember.\nFrom\n1888\nonwards Fleming was put in charge of recruiting women to undertake the rapidly increasing amount of data that was being handled at the Harvard Observatory. Between\n1888\nand\n1903\nshe was responsible for recruiting twenty women, including\nAnnie Jump Cannon\nin\n1896\n,\nHenrietta Swan Leavitt\nin\n1902\nand Joanna Crighton Stevens Mackie in\n1903\n. Joanna Mackie was Fleming's sister who had married James Mackie on\n3\nSeptember\n1883\nand had emigrated to the United States in the following year. Fleming's roles expanded\n[\n22\n]\n:-\nTraining, monitoring and planning their work schedules became a routine task. She devised a Form of Records to explain the format and expectations of clerical work required for the record-books; accuracy, speed, and legibility were essential requirements. In practice all female assistants now reported to Mina who ensured that the correct etiquette, efficiency, and discipline were maintained. Analysis of the glass plates enabled women computers to become observers without needing to work at night in an observatory. ... Pickering had no deputy to share his workload and increasingly relied on Mina to act in a secretarial role for correspondence; this would extend to his discussions with Harvard College Observatory astronomers whose work also needed to be published in the Annals. As the number of Bache plates rapidly increased Mina developed an efficient storage and retrieval system. In time she would prepare papers for astronomical conferences, support Harvard College Observatory workshops, and develop a strong mentoring approach for her successors. Despite all of these roles demanding attention Mina maintained her ability to discover a whole host of significant astronomical objects, from variable stars to gaseous nebula, from novae to Wolf-Rayet stars, and from near-Earth asteroids to stars with peculiar spectra.\nFor two papers by Fleming in which she describes some of her work, see\nTHIS LINK\n.\nThe authors of\n[\n3\n]\ndescribe some further discoveries by Fleming:-\nDespite the crush of everyday tasks, Williamina did manage to take time to do her own research. She discovered fifty-nine nebulas, some of them very famous among lovers of astrophotography, such as the \"Pickering Triangle,\" a beautiful region within the Veil nebula that despite its name was discovered by Williamina. Or the most famous of all: the Horsehead Nebula, a dark nebula that is seen against the light of the luminous nebula that is behind it, with the recognisable appearance of a chess horse head. It is an icon of astrophotography, which Williamina located on photographic plate No. B\n2312\n(\ntaken on February\n6\n,\n1888\nby Pickering's brother William, also an astronomer at Harvard\n)\nand described succinctly as a \"semicircular notch\n5\nminutes in diameter,\n30\nminutes south of Zeta.\" When the New General Catalogue of Nebulae and Clusters of Stars\n(\nNGC\n)\nwas compiled, the astronomer John Dreyer attributed the discovery of this nebula\n(\nand of the other\n58)\nto the director of the Harvard Observatory; however, Pickering himself clarified the discovery in the Annals of the Observatory of\n1890\nand this omission was corrected in the second edition of the NGC with Williamina receiving full credit as the author of the discovery.\nFleming's work was, for quite a number of years, described in papers with Pickering as the author. He did, however, fully acknowledge Fleming's work. As an example let us quote the first paragraph of Pickering's paper\n[\n42\n]\n:-\nA new star in the constellation Centaurus was found by Mrs Fleming on December\n12\n,\n1895\n, from an examination of the Draper Memorial photographs. ... No trace of it can be found on\n55\nplates taken from May\n21\n,\n1889\nto June\n14\n,\n1895\n, inclusive. On July\n8\n,\n1895\n... its magnitude was\n7\n.\n2\n. ... On December\n16\n,\n1895\n, a faint photographic image of it, magnitude\n10\n.\n9\n, was obtained with the\n11\n-inch Draper telescope, although it was very low, faint and near the sun.\nThe 'new star' that she discovered was a nova, a star that suddenly increases in brightness and slowly fades. These are now well understood, involving white dwarf stars in a close binary system, but at the time this discovery was not understood and entirely new. Fleming found a number of these while inspecting photographic plates. Another example of Pickering describing Fleming's work is in\n[\n41\n]\n. Here is the first paragraph:-\nA list of stars having peculiar spectra is given in the annexed table. With four exceptions noted below they were all discovered by Mrs Fleming in her regular examination of the Draper Memorial photographs. The designation of the star, its approximate right ascension and declination for\n1900\n, its catalogue magnitude, and a brief description of its photographic spectrum are given in the successive columns of the table. When the object is not a catalogue star its position as derived from a photograph, is given in the notes following the table.\nEven before these papers appeared, Fleming was publishing papers under her own name. We give one from\n1892\nand one from\n1893\nat\nTHIS LINK\n.\nFor many years Fleming's work appeared in papers in the\nAnnals of Harvard College Observatory\nwith Pickering as the author. By\n1897\n, however,\nMiscellaneous investigations of the Henry Draper Memorial\nwas published in Volume\n26\nPart\n2\nof the Annals of Harvard College Observatory with authors \"Edward C Pickering, Director, aided by M Fleming, Assistant.\" In October of the same year of\n1897\nthe first American Conference of Astronomers and Astrophysicists was organised at the Yerkes Observatory. Pickering gave a lecture on the work on variable stars which had been carried out at the Harvard Observatory. He praised Fleming's work in finding\n80\nvariable stars which\n[\n22\n]\n:-\n... included\n26\nin\n1895\nand\n30\nin\n1896\nwhich she had published in the 'Astrophysical Journal' and 'Harvard College Observatory Circulars' respectively.\nThe second American Conference of Astronomers and Astrophysicists was held at the Harvard College Observatory in\n1898\n. Fleming did a great deal of the organisation for the conference. She presented the paper\nStars of the fifth type in the Magellanic Clouds\nwhich was read by Pickering; the report of the paper in the review\n[\n14\n]\nreads:-\nThe contribution of Mrs M Fleming, read by Mr Pickering, Director, on \"Stars of the Fifth Type in the Magellanic Clouds\" contained some important statements in reference to the stars having spectra consisting mainly of bright lines, designated as Fifth Type. Of these stars, which all lie in the Milky Way and in the Magellanic Clouds, ninety-two have been discovered up to the present time, all but thirteen having been found by the aid of photographs during the last fourteen years. In conclusion Professor Pickering said that Mrs Fleming had omitted to mention that of these seventy-nine stars nearly all had been discovered by herself, wbereupon Mrs Fleming was compelled by a spontaneous burst of applause to come forward and supplement the paper by responding to the questions elicited by it.\nThe youngest participant at the\n1898\nconference was Fleming's son the\n18\n-year old Edward Pickering Fleming. In\n1900\nhe was studying mining engineering at the Massachusetts Institute of Technology and was living at\n273\nUpland Road, Cambridge, Massachusetts with his mother who wrote in her journal\n[\n16\n]\n:-\nMy son Edward, now a junior in the Massachusetts Institute of Technology, knows little or nothing of the value of money and, therefore, has the idea but that everything should be forthcoming on demand.\nEdward worked as a metallurgist and, at the time of his mother's death in\n1911\n, he was chief metallurgist for a large copper company in Chile. Returning to the year\n1900\n, Fleming has an international reputation as an astronomer. She achieved a vast research output despite being required to undertake secretarial and administrative duties at the Observatory. Let us note that in\n1898\nFleming had been appointed Curator of the Astronomical Photograph and Records. The workload, however, was taking its toll and she wrote in her journal on\n12\nMarch\n1900\n[\n16\n]\n:-\nI had some conversation with the Director regarding women's salaries. He seems to think that no work is too much or too hard for me, no matter what the responsibility or how long the hours. But let me raise the question of salary and I am immediately told that I receive an excellent salary as women's salaries stand. If he would only take some step to find out how much he is mistaken in regard to this he would learn a few facts that would open his eyes and set him thinking. Sometimes I feel tempted to give up and let him try some one else, or some of the men, in order to have him find out what he is getting for $\n1500\na year from me, compared with $\n2500\nfrom some of the other assistants. Does he ever think that I have a home to keep and a family to take care of as well as the men? But I suppose a woman has no claim to such comforts. And this is considered an enlightened age! ... I feel almost on the verge of breaking down.\nFor more quotes from Fleming's journal, see\nTHIS LINK\n.\nOn\n11\nJanuary\n1904\nFleming applied to become naturalised as a citizen of the United States of America and she was admitted on\n9\nSeptember\n1907\n. Her son Edward became a citizen of the United States on\n12\nJanuary\n1904\n.\nAnnie Cannon\n, who worked with Fleming for many years, wrote in\n[\n10\n]\n:-\nMrs Fleming was possessed of an extremely magnetic personality and an attractive countenance, enlivened by remarkably bright eyes. Although most of her life was spent in the routine of science, yet her human interests were numerous. Fond of people and excitement, there was no more enthusiastic spectator in the stadium for the football games, no more ardent champion of the Harvard eleven. Industrious by nature, she was seldom idle, and long years of observatory work never unfitted her for the domestic side of life. As much at home with the needle as with the magnifying eyepiece, she could make a dainty bag, exquisitely sewed, or dress a doll in complete Scotch Highland costume. She was never too tired to welcome her friends at her home or at the observatory, with that quality of human sympathy which is sometimes lacking among women engaged in scientific pursuits. Her bright face, her attractive manner, and her cheery greeting with its charming Scotch accent, will long be remembered by even the most casual visitors to the Harvard College Observatory.\nFleming received many honours for her outstanding contributions; particularly remarkable at a time when women were receiving little in the way of recognition for their work. She was elected as an Honorary Member of the\nRoyal Astronomical Society\non\n11\nMay\n1906\n. She was also the only Honorary Fellow of Wellesley College, an active member of the Astronomical and Astrophysical Society of America, and a member of the Société Astronomique de France. In\n1910\nshe received the Guadalupe Almendaro gold medal from the Sociedad Astronómica de Mexico.\nIn\n1910\n, Fleming was ill but still managed to attend the fourth conference of the International Union for Cooperation in Solar Research at the Mount Wilson Solar Observatory, California from\n29\nAugust to\n3\nSeptember. There are only two women in the conference photograph, Fleming and the wife of the astronomer Jacobus Kapteyn. Returning to Boston, Fleming's health deteriorated. By the spring of\n1911\nshe had developed pneumonia and, on\n2\nMay she was taken to New England Hospital in Boston. She died nine days later from lobar pneumonia and her funeral was held on\n23\nMay\n[\n15\n]\n:-\nThe services were of simple character. The Rev Joel H Metcalf, of Winchester, a close friend of Mrs Fleming, and himself a noted astronomer, officiated. Prof E C Pickering and a large number of his associates at the observatory attended the services. The Harvard quartet rendered selections. Interment was at Mt Auburn.\nFor some obituary notices in newspapers, see\nTHIS LINK\n.",
  "math_areas": [
    "Algebra"
  ]
}