{
  "nome_completo": "Moritz Pasch",
  "nome_curto": "Moritz Pasch",
  "ano_nascimento": "1843",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pasch/",
  "lugar_nascimento": "Breslau, Prussia (now Wrocław, Poland)",
  "lugar_morte": "Bad Homburg, Germany",
  "biografia": "Moritz Pasch\n's father was Simon Pasch who came from Rawitsch in the province of Posen. Simon was a businessman who married Rosalie Isaac from Birnbaum, Posen, in Breslau on\n29\nJuly\n1841\n. Simon was\n24\nyears old when he married and Rosalie was\n30\nyears old.\nPasch attended the Elisabeth\nGymnasium\nin Breslau, graduating in\n1860\n. He then entered the University of Breslau with the intention of studying chemistry but soon changed topic to study for a degree in mathematics. At university he became close friends with another outstanding student of mathematics,\nJakob Rosanes\n. He was taught by some excellent lecturers such as\nHeinrich Schröter\n,\nFerdinand Joachimsthal\n,\nRudolf Lipschitz\n, O E Meyer, and\nPaul Bachmann\n. Pasch was awarded his doctorate on\n21\nAugust\n1865\nfor his thesis\nDe duarum sectionem conicarum in circulos projectione\nⓉ\n(\nThe two conic section in circular projection\n)\n. His thesis advisor was\nSchröter\nand Pasch dedicated his thesis to him and to Kambly his mathematics teacher at the Gymnasium.\nAfter the award of his doctorate, together with his friend\nRosanes\n, he went to study at the University of Berlin. There he studied under\nWeierstrass\nand\nKronecker\n. Pasch's father died in Breslau on\n24\nOctober\n1866\nand he gave up his research towards his\nhabilitation\nin order to help care for his family. However he was able to return to work on his habilitation thesis\nZur Theorie der Komplexe und Kongruenzen von Geraden\nwhich he submitted to the Justus-Liebig University of Giessen on\n29\nNovember\n1870\n. In August\n1873\nhe was promoted to extraordinary professor, then two years later he was made an ordinary professor after turning down an offer of a similar post at the University of Breslau.\nPasch married Laura Reichenbach from Breslau on\n15\nSeptember\n1875\n, three weeks after being made a full professor. The marriage took place in Breslau and they had two daughters, Toni born on\n18\nJuly\n1878\nand Gertrud born on\n16\nFebruary\n1882\n. Both were born in Giessen.\nIn addition to remarkable research contributions which we mention below, Pasch was interested in the administration of the university and he devoted considerable effort as chairman of the committee responsible for the examination of prospective high school teachers. He was dean of the Philosophical Faculty at Giessen during the academic year\n1885\n-\n6\nand rector of the university during\n1893\n-\n4\n. He retired on\n1\nApril\n1911\n, having been thesis advisor to around\n30\ndoctoral students, wishing to devote more time to his research. He continued to be active in research and published many papers when around the age of\n80\n. Some papers he published during the\n1920\ns are:\nDer Ursprung des Zahlbegriffs\nⓉ\n(\nThe origin of the concept of number\n)\n(1921)\n;\nÜber zentrische Kollineation\nⓉ\n(\nOn central collineation\n)\n(1923)\n;\nBetrachtungen zur Begründung der Mathematik\nⓉ\n(\nConsiderations on the foundation of mathematics\n)\n(1924)\n;\nDie natürliche Geometrie\nⓉ\n(\nThe geometry of nature\n)\n(1924)\n; and\nBetrachtungen zur Begründung der Mathematik\nⓉ\n(\nConsiderations on the foundation of mathematics\n)\n(1926)\n.\nHe worked on the foundations of geometry. E W Ellers writes:-\nPasch was very concerned with the correctness of thinking which he considered equivalent to the presentation in a precise language. He was mainly concerned with the axiomatic development of mathematics. His main interests were the foundations of projective geometry and of analysis. He was devoted to what he called delicate\n(\nheikle\n)\nmathematics, as opposed to coarse\n(\nderbe\n)\nmathematics which is being practised by many mathematicians. The results of his efforts have been expressed in his books Vorlesungen über neuere Geometrie\nⓉ\n(\nLectures on modern geometry\n)\n[\nTeubner, Leipzig,\n1882]\n, Einleitung in die Differential- und Integralrechnung\nⓉ\n(\nIntroduction to calculus\n)\n[\nTeubner, Leipzig,\n1882]\n, and Grundlagen der Analysis\nⓉ\n(\nFoundations of analysis\n)\n[\nTeubner, Leipzig,\n1908]\n.\nThe first of these three books is described in\n[\n2\n]\nas:-\n... a watershed in the development of the foundations of geometry. Drawing on the work of his predecessors, Pasch was the first to explicitly state all the basic concepts and axioms necessary for his construction of projective geometry.\nHe found a number of assumptions in\nEuclid\nthat nobody had noticed before\n[\n1\n]\n:-\nPasch's analysis relating to the order of points on a line and in the plane is both striking and pertinent to its understanding. Every student can draw diagrams and see that if a point B is between A and a point C, then C is not between A and B, or that every line divides a plane into two parts. But no one before Pasch had laid a basis for dealing logically with such observations. These matters may have been considered too obvious; but the result of such neglect is the need to refer constantly to intuition, so that the logical status of what is being done cannot become clear.\nPasch's Axiom is that if a line enters a triangle\nA\nB\nC\nABC\nA\nB\nC\nthrough the side\nA\nB\nAB\nA\nB\nand does not pass through\nC\nC\nC\nthen it must leave the triangle either between\nB\nB\nB\nand\nC\nC\nC\nor between\nC\nC\nC\nand\nA\nA\nA\n. Pasch argued in\nVorlesungen über neuere Geometrie\n(1882)\nthat geometers rely too heavily on physical intuition. In his view an argument in mathematics should not depend on the physical interpretation of the terms involved but upon purely formal axioms.\nPasch claimed that the principle of duality contradicted physical intuition about points and lines, nobody believed that these terms were interchangeable.\nHilbert\nwas to be influenced by these ideas of Pasch.\nThe article\n[\n5\n]\nis an address given by Pasch on\n2\nJuly\n1894\nand in the address he spoke about his ideas on how and why mathematics should be taught. E W Ellers writes in a review:-\nThe educational value of mathematics lies as much in its method as in its results. The most important part of the method is deduction. Rigorous reasoning appears to be the most desirable aspect in mathematical education. Pasch explains the axiomatic method in mathematics in great detail. According to Pasch, the mathematical language is often not clear, enough. Mathematical proofs sometimes leave gaps which are very often difficult to fill. He proposes that very detailed and careful deduction should prevail in teaching of mathematics.\nPasch received a number of honours for his outstanding contributions including honorary degrees from the University of Frankfurt and from the University of Freiburg to mark his eightieth birthday.\nAfter retiring in\n1911\nPasch continued to live in Giessen. His last years were particularly sad since his wife died in\n1920\nand his youngest daughter Gertrud, who had married the mathematician Clemens Thaer, died a year before her father. Pasch was taking a holiday in Bad Homburg when he died.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}