{
  "nome_completo": "Morris Kline",
  "nome_curto": "Morris Kline",
  "ano_nascimento": "1908",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kline/",
  "lugar_nascimento": "Brooklyn, New York City, New York, USA",
  "lugar_morte": "Brooklyn, New York City, New York, USA",
  "biografia": "Morris Kline\n's parents were Bernard Kline, an accountant, and his wife Sarah Spatt. Morris was brought up in New York City, first in Brooklyn and then in Jamaica in the borough of Queens. He was educated at the Boys High School in Brooklyn and, after graduating, entered New York University. He was awarded his bachelor's degree in\n1930\nand appointed as an Instructor in Mathematics while he continued to study for a master's degree which was awarded in\n1932\n. He explained in an interview\n[\n2\n]\n:-\nAs a high school, undergraduate, and graduate student of mathematics I hadn't the least idea of what mathematics was all about. I could do the required work and make good grades and so I preferred it, for example, to English. I believe I was a victim of the poor knowledge and poor teaching that was prevalent during the second and third decades of this century.\nHe remained at New York University to study for his doctorate which he was awarded in\n1936\nfor his thesis\nHomomorphism and Isomorphism of Rings and Fields of Point Sets\n. He said\n[\n2\n]\n:-\nMy doctoral degree was in topology, and this is one reason I got the appointment of research assistant to the topologist\nJames W Alexander\n.\nThis appointed was a prestigious one at the Institute for Advanced Study at Princeton\n[\n2\n]\n:-\nThe two years,\n1936\n-\n1938\n, that I spent at the Institute for Advanced Study were very valuable but only for the acquisition of mathematical knowledge.\nEinstein\n,\nvon Neumann\n,\nWeyl\n,\nMorse\n,\nVeblen\n, and\nAlexander\nwere the mathematics professors. I was a research assistant to\nAlexander\n. I state reluctantly that the limitations of these men - not in creativity or knowledge - were also very apparent.\nDuring his time at Princeton, his first book\n(\nco-authored with Irvin W Kay\n)\nwas published - it was entitled\nIntroduction to Mathematics\n. After spending these two years at the Institute for Advanced Study, Kline returned to New York University where\nRichard Courant\nhad been appointed as a professor\n[\n2\n]\n:-\n... when I returned to New York University to work for\nCourant\n, he convinced me that the greatest contribution mathematicians had made and should continue to make was to help man understand the world about him. And so I turned to applied mathematics. ...\nCourant\nwas the wisest and most able administrator I have ever met and ... he built an insignificant department into one of the greatest. Working for him gave me insights I could never have gotten elsewhere.\nIn\n1939\nKline married Helen Mann; they had two daughters, Elizabeth, Judith, and a son Douglas.\nKline's first research was in pure mathematics and following papers related to his doctoral thesis he published\nRepresentation of homeomorphisms in Hilbert space\nin\n1939\n. However, as he explained in the above quotation, after returning to New York University to work for\nCourant\nhe changed his research topics to work on applied mathematics. During World War II he worked as a physicist for the Signal Corps in the United States Army. He was posted to Belmar, New Jersey, and worked in the laboratory in which RADAR was being developed. The expertise he gained in this work led to him founding the Division of Electromagnetic Research at the\nCourant\nInstitute in\n1946\nwhen he returned to New York University. He was director of the division for twenty years.\nHis research publications during his first years as director of the Division of Electromagnetic Research, now in applied areas, included:\nSome Bessel equations and their application to guide and cavity theory\n(1948)\n;\nA Bessel function expansion\n(1950)\n;\nAn asymptotic solution of Maxwell's equations\n(1950)\n; and\nAn asymptotic solution of linear second-order hyperbolic differential equations\n(1952)\n. He was also an editor of the book\nThe Theory of Electromagnetic Waves\npublished in\n1951\n.\nHowever, as well as research Kline had become interested in mathematics teaching\n[\n2\n]\n:-\nWhen I started to teach as an instructor in\n1930\nat New York University, teaching was still regarded there as the most important activity of the faculty. Though for various reasons I did turn to research in applied mathematics, worked for the U.S. Army on applications during World War II, and then founded the Division of Electromagnetic Research at the\nCourant\nInstitute, I still believed that teaching was at least as important, and I continued to pursue teaching interests. ... When research began to take precedence over teaching in this country, roughly about\n1945\n, I became incensed about the shoddy treatment of undergraduates; and even though I was heavily involved in research I resolved to spend some time in efforts to argue for good teaching. I hope to continue these efforts as long as I am able to. Fortunately\nCourant\nwas sympathetic and in fact appreciated teaching, and so I did not have to face personal hardships at New York University.\nIn\n1953\nhe published the remarkable book\nMathematics in Western Culture\nwhich has a Foreword written by\nRichard Courant\nwho states clearly that the book is intended to be read by intelligent non-mathematicians. Let us look at Kline's own description of the book in\n[\n23\n]\n. This will serve not only as a description of the book but also as a guide to the approach Kline's philosophy which he exhibited in similar books published during the following thirty years :-\nThe object of this book is to support the thesis that mathematics has been a major cultural force in Western civilization. Accordingly the book shows how various developments in mathematics proper in turn influenced developments in logic, astronomy, philosophy, painting, music, religious thought, literature, and the social sciences. The conversion of mathematics by Greek philosophers into an abstract, deductive system of thought, the Greek and modern doctrine that nature is mathematically designed, the use of mathematics by\nHipparchus\nand\nPtolemy\nand later by\nCopernicus\nand\nKepler\nto erect the most impressive astronomical theories, the development of a mathematical system of perspective by Renaissance painters who sought to achieve realism, the deduction by\nGalileo\n,\nNewton\n, and others of universal scientific laws which \"united heaven and Earth\", the reorganization of philosophy, religion, literature, and the social sciences in the Age of Reason, the rise of a statistical view of natural laws consequent upon the success of statistical procedures in the physical and social sciences, the effect of the creation of non-Euclidean geometry upon the belief in truth and on the common understanding of the nature of mathematics, and mathematics as an art are some of the illustrations of the cultural influences of mathematics.\nThese topics are discussed in connection with one or another of the major mathematical creations which have been introduced since ancient times and hence accompany some presentation of the concepts of Euclidean geometry, trigonometry, projective geometry, coordinate geometry, statistics, the theory of probability, transfinite numbers, non-Euclidean geometry, and other mathematical subjects. 'The treatment of the mathematics proper emphasizes the ideas themselves. Very little attention is given to the techniques, which are of value only to those who intend to use mathematics in later life.\nThough the book is by no means a history of mathematics, the sequence of topics is the historical one. This order happens to be the most convenient for the logical presentation of the subject and is the natural way of examining how the mathematical ideas arose, what the motivations were for investigating these ideas, and how the mathematical creations in turn altered the course of other branches of our culture. An important by-product is that the reader may get some indication of how mathematics has developed, how its periods of activity and quiescence have been related to the history of Western civilization, and how mathematics has been shaped by the civilizations which preceded the modern Western period.\nAn attempt has been made to make the presentation lively and readable and thereby attract students and laymen to mathematics.\nOn the whole the book tries to answer the question: What contributions has mathematics made to Western life and thought aside from the techniques which serve the engineer? The author believes that the answer given to this question should constitute the course in mathematics for liberal arts students who do not intend to use techniques in professional work. The book might serve as the basis for such a course.\nGaylord M Merriman\n[\n26\n]\nfeels that Kline succeeds in his immensely difficult task of addressing non-mathematicians:-\n... it should greatly serve the reading public-at-large which, having accepted the necessity of mathematics in science, needs instruction to the effect that mathematics not only manufactures atom bombs and television sets but also maintains an ever-growing storehouse of the most permanent and awe-inspiring contributions to the arts, the social sciences, and the humanities.\nHarriot F Montague\n[\n27\n]\nwrites:-\nProfessor Kline has done a real service for mathematicians and non-mathematicians in displaying the range and force of his subject.\nIn\n1959\nKline published\nMathematics and the Physical World\n, a companion volume to\nMathematics in Western Culture\n. This book emphasises Kline's firm belief that mathematics underlies all of science, indeed all of natural knowledge. Three years later he published\nMathematics, A Cultural Approach\n(1962)\nin which he looks at the way that problems of physics, of astronomy, of music, of art and other such activities have led to developments in mathematical ideas. In\n1967\nhe published a two-volume calculus text\nCalculus, An intuitive and Physical Approach\nwhich teaches calculus through physical problems but also tries to develop the students intuition by approaching problem solving as a beginner might, making false starts and changing tack. A major book devoted to the history of mathematics\nMathematical Thought From Ancient to Modern Times\n(1972)\nearned Kline much praise. Ivor Grattan-Guinness, a well-known historian of mathematics, writes\n[\n19\n]\n:-\nIt is the first general history which begins to reflect the actual development of mathematics, and is by far the best yet to appear. ... nothing can, or should, dispel the fine impression that this book leaves. I am still amazed by the amount that Kline has achieved.\nHowever, Kline has strong views and several reviewers make comments similar to those of\nDirk Struik\n:-\n... we find passages that are mildly controversial, but this adds to the fun of reading the book.\nIf these texts often contained ideas that were 'mildly controversial', then Kline's books attacking the teaching of mathematics at school and university level provoked a considerably stronger reaction:\nWhy Johnny Can't Add: The Failure of the New Mathematics\n(1973)\nand\nWhy the professor can't teach: Mathematics and the dilemma of university education\n(1977)\n. In a review of the latter book\nPeter Hilton\nstrongly attacks Kline\n[\n17\n]\nwriting that the book is:-\n... a farrago of prejudice. Almost every page contains some vituperative attack on Kline's fellow mathematicians ...\nHe ends his review with the paragraph:-\nTo sum up we must conclude that Kline's book is an intemperate emotional outburst, and that the author has not only missed an opportunity to devote his great talents to the improvement of the quality of mathematical education but has also placed in the hands of the enemies of education in general and mathematics education in particular a potent if unreliable weapon.\nWe should not give the impression that Kline only began to attack the way mathematics is taught as he approached retirement age. On the contrary he had written a whole series of articles on the \"new maths\" in the\n1950\ns and\n1960\ns in journals such as\nThe Mathematics Teacher\n. Examples of his articles in the journal are\nMathematics Texts and Teachers\n(1956)\n,\nThe Ancients vs. the Moderns\n(1958)\nand\nA Proposal for the High School Mathematics Curriculum\n(1966)\n.  To give the flavour of these articles we quote from the last mentioned:-\nInstead of presenting mathematics as rigorously as possible, present it as intuitively as possible. Accept and use without mention any facts that are so obvious that students do not recognize that they are using them. Students will not lose sleep worrying about whether a line divides the plane into two parts. Prove only what the students think requires proof. The ability to appreciate rigor is a function of the age of the student and not of the age of mathematic\nIn\n1980\nKline published\nMathematics: The Loss of Certainty\nwhich again received praise for initiating debate but also received criticism. Perhaps Ian Stewart sums up the views of many when he writes:-\nI always look forward to reading Morris Kline's books. They are well written, carefully thought out, and ask questions that are often ignored by more conventional books. I don't always agree with what he writes, but a provocative thesis is always worth having if it provokes something useful. ... I think three quarters of it is superb, and the other quarter is outrageous nonsense; and the reason is that Morris Kline really doesn't understand what today's mathematics is about, although he has an enviable grasp of yesterday's.\nOther books by Kline continue to develop similar themes, such as\nMathematics and the search for knowledge\n(1985)\nin which Kline again argues that:-\n... mathematics is the foundation of all exact knowledge of natural phenomena.\nWe have only mentioned a selection of Kline's books in this biography but we have chosen to comment on typical examples which have all stimulated very worthwhile debate.\nKline retired from teaching in\n1975\nalthough, as the list of books above indicates, he continued to publish major texts. During his last years his health declined and he died in Maimonides Hospital, Brooklyn, with heart failure at the age of\n84\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}