{
  "nome_completo": "Moshe (Ehezkel) Carmeli",
  "nome_curto": "Moshe Carmeli",
  "ano_nascimento": "1933",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carmeli/",
  "lugar_nascimento": "Baghdad, Iraq",
  "lugar_morte": "Beer Sheva, Israel",
  "biografia": "Moshe Carmeli\n's parents were Eliahu and Naima Carmeli; he was one of their seven children. He finished high school in\n1948\n, then he remained at home for a year during which time he read most of Baghdad's library books.\nIn\n1950\nhe immigrated to Israel travelling through Iran, to be followed by his parents a year later. He enlisted in the Israeli Air Force where he met people who told him a lot about physics.  Moshe was fascinated by what he heard and quickly learned the basics of the subject. Right away he knew that he wanted to study physics so he enrolled in the Hebrew University of Jerusalem. In\n1960\nhe received his Master Degree in Physics from that university, his M.Sc. studies being supervised by Nissan Zeldes. On\n17\nAugust\n1961\nhe married Elisheva Cohen; they had three children, Eli, Dorith and Yair. At the same time he began to work on his doctoral thesis under the supervision of Nathan Rosen who had been a student of\nAlbert Einstein\n. Carmeli finished his D.Sc. from the Technion, Haifa in\n1964\n. Among his publications at this time are\nThe motion of a particle of finite mass in an external gravitational field\n(1964)\n,\nHas the geodesic postulate any significance for a finite mass?\n(1964)\n,\nSemigenerally covariant equations of motion. I. Derivation\n(1965)\n,\nSemigenerally covariant equations of motion. II. The significance of the \"tail\" and the relation to other equations of motion\n(1965)\n,\nMotion of a charge in a gravitational field\n(1965)\n,\nThe equations of motion of slowly moving particles in the general theory of relativity\n(1965)\n, and\nEquations of motion without infinite self-action terms in general relativity\n(1965)\n.\nIn\n1964\nthe Carmeli family moved to the United States and, between\n1964\nto\n1965\n, Moshe was a Visiting Research Associate at Lehigh University and Temple University. During\n1965\n-\n1967\nhe was a Research Associate at the University of Maryland. He carried out his research in general relativity and gravitation, and lectured in Lehigh University, Temple University and then in the University of Maryland. In the year\n1967\nhe was appointed Assistant Professor at the University of Maryland.  Between\n1967\nand\n1972\nhe was a Research Physicist and also Senior Researcher at the Aerospace Research Laboratory in Dayton, Ohio. During his time in this post he published papers such as\nGroup analysis of Maxwell's equations\n(1969)\n,\nInfinite-dimensional representations of the Lorentz group\n(1970)\n, and\nS\nL\n(\n2\n,\nC\n)\nSL(2, \\mathbb{C})\nS\nL\n(\n2\n,\nC\n)\nsymmetry of the gravitational field dynamical variables\n(1970)\n. His own summary of this last paper is as follows:-\nWe represent the spin coefficients and the\nRiemann\ntensor in the form of linear combinations of the infinitesimal generators of the group\nS\nL\n(\n2\n,\nC\n)\nSL(2, \\mathbb{C})\nS\nL\n(\n2\n,\nC\n)\n. This representation is similar to the way Yang and Mills write their dynamical variables in terms of the\nPauli\nspin matrices. The spin coefficients take the role of the Yang-Mills-like potentials, whereas the\nRiemann\ntensor takes the role of the fields.\nIn\n1972\nthe Carmeli family returned to Israel, and Moshe was appointed Associate Professor of Physics in the Physics Department of Ben Gurion University, Beer Sheva. He became Professor in\n1974\n. He was thus the first full Professor in the new Physics Department of Ben Gurion University. Between\n1973\nand\n1977\nhe was the Chairman of the Physics Department. He became\nAlbert Einstein\nProfessor of Theoretical Physics in\n1979\n.\nHe worked at the Physics Department as a researcher and lecturer until his retirement. After retiring he continued his scientific research. Carmeli's field included gravitation and gauge field theory, the theory of spinors as applied to physics,\nEinstein\nspecial and general relativity, and astrophysics. He developed his own cosmological relativity theory, both special and general, in which the age of Universe is postulated as constant, just as the speed of light is in\nEinstein\n's theory, and the velocity of receding galaxies is considered as a new independent variable. In this five-dimensional brane world theory the results of\nEinstein\n's theory are obtained and the tests are fulfilled. In addition it gives new results. Tully-Fisher is a well known experimental law which describes the movement of stars in galaxies. It is obtained theoretically without the use of hypothetical Dark Matter. The theory is used by scientists in their research in different fields of theoretical physics, such as astrophysics and hydrodynamics.\nCarmeli was author and co-author to more than\n120\nresearch papers and\n9\nbooks. His\n10\nth\nbook was published after his death. These books include:\n(\nwith Shimon Malin\n)\nRepresentations of the rotation and Lorentz groups : An introduction\n(1976)\n:-\n... written as a textbook for undergraduate students of mathematics and natural sciences who are studying group theory;\nGroup theory and general relativity : Representations of the Lorentz group and their applications to the gravitational field\n(1977)\n:-\n... the first book to found the theory of general relativity on the principle of gauge invariance;\nC\nlassical fields : general relativity and gauge theory\n(1982)\n:-\n... based on lectures given by Carmeli at the Institute of Theoretical Physics of the State University of New York at Stony Brook and at the Ben Gurion University. It contains an exposition of the theory of classical gravitational and gauge fields;\nStatistical theory and random matrices\n(1983)\n:-\n... a profound and rigorous presentation of the local and global properties of fermion systems in very large spectroscopic spaces, where exact shell model calculations cannot be performed;\n(\nwith Kh Huleihil, one of Carmeli's former Ph.D. students, and E Leibowitz\n)\nGauge fields : Classification and equations of motion\n(1989)\n:-\n... contains a discussion of some topics concerning classical Yang-Mills fields;\n(\nwith E Leibowitz, and N Nissani, one of Carmeli's former Ph.D. students\n)\nGravitation:\nS\nL\n(\n2\n,\nC\n)\nSL(2, \\mathbb{C})\nS\nL\n(\n2\n,\nC\n)\ngauge theory and conservation laws\n(1990)\n:-\n... devoted to the formulation of\nEinstein\n's theory of general relativity as a gauge theory with the\nS\nL\n(\n2\n,\nC\n)\nSL(2, \\mathbb{C})\nS\nL\n(\n2\n,\nC\n)\ngroup as the gauge group;\nCosmological special relativity : The large scale structure of space, time and velocity\n(1997)\n:-\n... which puts forward a new mathematical formulation of cosmology in the limit of negligible gravitational field;\nand\n(\nwith Shimon Malin\n)\nTheory of spinors : An introduction\n(2000)\n:-\n... which gives an introduction to the theory of spinors for the general physicist, not only for workers in general relativity. It is based on lectures given by the authors at Ben Gurion University.\nCarmeli received many awards and honours. He received the US Air Force Outstanding Awards in\n1969\nand\n1972\n. Between\n1979\nand\n1982\nhe was Vice-President of the Israel Physical Society, then being elected President from\n1982\nto\n1985\n. He was an elected Fellow of the American Physical Society from\n1972\nand of the American Association for the Advancement of Science from\n1977\n. He was also a Member of the\nNew York Academy of Sciences\nfrom\n1980\n. Moshe Carmeli was a Visiting Professor and Member of the Institute for Theoretical Physics, SUNY, Stony Brook,\n1977\n-\n78\n, and again in September and October\n1981\n. He was a Visiting Professor and a Faculty Member at the University of Maryland during\n1985\n-\n86\n, a Visiting Scientist at the\nMax Planck\nInstitute, Munich during July and August\n1980\n, and the International Centre for Theoretical Physics, Trieste on ten separate occasions. In November\n2004\nhe was an International Visiting Scholar at the University of Victoria, British Columbia, Canada. His career and research achievements were summarised by Victoria University as follows:-\nAstrophysicist Moshe Carmeli is\nAlbert Einstein\nProfessor of Theoretical Physics at Ben Gurion University in Beer Sheva, Israel. He has also done important work at the University of Maryland and for the US Department of Defense as well as being involved in the nomination process for the Nobel Prize in Physics. Re-envisioning\nEinstein\n's theories of Special and General Relativity and building on the work of\nEdwin Hubble\n, Dr Carmeli has suggested that the universe's expansion must be constantly accelerating, and that time is therefore relative; in other words, it can only be measured relative to the position and velocity of the measurer. This also means that time must have moved more slowly in the past when the universe was smaller and moving more slowly. Carmeli's work has posed an intriguing set of problems for theoretical physicists and has even been investigated by scholars for its philosophical and religious implications. He is currently on sabbatical at the University of Victoria doing research on subatomic particles with the University of Victoria physicist Fred Cooperstock, with whom Dr Carmeli has a longstanding personal and professional relationship.\nJulia Goldbaum writes\n[\n1\n]\n:-\nSeveral days before he died, we were working together on his last book. In spite of his weak health condition, he showed great interest in this topic. Then I went home, and we agreed that I would come to work more after the holiday Yom Kippur. Next evening, when the holiday was over, I called to ask when should I come to work, and his wife said that Moshe was in hospital. He passed away several days later, in the first day of another Jewish holiday: Sukkot.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}