{
  "nome_completo": "Mstislav Vsevolodovich Keldysh",
  "nome_curto": "Mstislav Vsevolodovich Keldysh",
  "ano_nascimento": "1911",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keldysh_Mstislav/",
  "lugar_nascimento": "Riga, Latvia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Mstislav Vsevolodovich Keldysh\nwas born in Riga. His father, Vsevolod Mikhailovich Keldysh\n(1878\n-\n1965)\n, was a military construction engineer who had graduated from the Polytechnic Institute in Riga. Vsevolod Mikhailovich married Mariya Aleksandrovna Skvortsova\n(1879\n-\n1953)\nin Riga. She devoted herself to bringing up their children. It is worth recording that, going back one more generation, Mariya Aleksandrovna's father was an artillery general, the son of a general, and so from the nobility. Vsevolod Mikhailovich's father was an army doctor with the rank of general so also from the nobility. Mstislav Vsevolodovich was always proud of his noble roots even though this gave him problems in Communist Russia. The family were quite well off and, because of the nature of Vsevolod Mikhailovich's work, he travelled between many different towns. He lectured at different Technical Institutes and later was involved in the design and construction of the Moscow Metro and the Moscow-Volga canal. Mstislav Vsevolodovich was one of his parents' seven children. All the children were taught German and French by their mother who also gave them a love of music. Of his six brothers and sisters we mention in particular\nLyudmila Vsevolodovich Keldysh\n, born in\n1904\n, who became a famous mathematician and has a biography in this archive, and Yurii Vsevolodovich Keldysh who became a musicologist.\nBy\n1909\nthe family were in Riga, where Vsevolod Mikhailovich lectured at the Polytechnic Institute, and it was in that city that Mstislav Vsevolodovich was born. In\n1915\nthe German army invaded Latvia and the staff at the Riga Polytechnic Institute were evacuated to Moscow. The Keldysh family had no relations to help them in Moscow and they suffered considerable hardship. For several years they lived in Losinoostrovskaya, just outside the city, but the parents loved classical music and often attended concerts in the city. After these concerts, they had no alternative but to make their way home on foot, a journey of several miles. There were difficult times in Losinoostrovskaya, for example the children remembered one day in\n1917\nwhen their mother fed the whole family just fried onions, having no other food. The family moved to Ivanovo-Voznesensk, a city about\n250\nkm northeast of Moscow, towards the end of\n1918\nwhen Vsevolod Mikhailovich began teaching at the Polytechnic Institute there - this Institute was joined to the Riga Polytechnic Institute. However, he often returned to Moscow to work on engineering projects.\nIn\n1923\nthe family moved to an apartment in Moscow and Mstislav, who was twelve years old at this time, attended School No\n7\nin Krivoarbatsky lane. The apartment, in the basement of the building, had five rooms and a tiny sixth room which had been originally designed for a servant. Mstislav, Yuri and one other brother shared a large narrow room containing three iron beds, a large writing desk and a piano\n[\n17\n]\n:-\nThe room was always smoky, crowded, noisy and fun. Younger sisters were sometimes not allowed in there. Yuri was the only one not smoking and not noisy. He sat for hours at the piano, completely immersed in music, not noticing what was happening around him. ... Mstislav, in appearance and behavior a \"Gypsy Kid,\" was out of all the brothers especially mischievous, and quarrelsome.\nMstislav Keldysh was proud of his noble origins even through he might have had an easier time if he had hidden them. He always filled in official forms with \"social origin - nobility\" and he was refused entrance to the Institute of Civil Engineers in\n1927\nbecause of his social class. However, he was persuaded by his older sister\nLyudmila Vsevolodovich Keldysh\nto study mathematics, against the wishes of his father\n(\nwho wanted him to become an engineer\n)\n. He gained entry to the Physics and Mathematics department of Moscow State University where, after being taught by\nMikhail Alekseevich Lavrent'ev\n, he graduated on the\n24\nJuly\n1931\n. Following this, with a strong recommendation from\nLavrent'ev\n, he was appointed to a position at the\nN E Zhukovsky\nCentral Aero-Hydrodynamic Institute. This Institute, set up by\nNikolai Egorovich Zhukovsky\nand\nSergei Alekseevich Chaplygin\nin\n1918\n, provided a remarkable research environment. It was, at this time, directed by\nChaplygin\n(\nZhukovsky\nhad died several years before\n)\nand the Institute had\nLavrent'ev\nas one of its leading scientists. It was at the Institute\n[\n20\n]\n:-\n... where he met Leonid T Sedov, three years his senior, and began a scientific collaboration and close friendship which were to be a source of great strength and support to him for the whole of the rest of his life.\nKeldysh worked on aerohydrodynamics, publishing a series of papers on the topic between\n1934\nand\n1937\n. One problem that was particularly important during the\n1930\ns was that of 'flutter', strong vibrations which would suddenly begin and sometimes be so violent as to cause the aircraft to destroy itself. Keldysh's theoretical work on this was a highly significant factor in overcoming the problem. But this was not the only research that Keldysh was undertaking at the time, for\nIvan Matveevich Vinogradov\ninvited him to undertake research for a doctorate at the\nV A Steklov\nMathematical Institute of the\nUSSR Academy of Sciences\nafter the Institute had moved from Leningrad to Moscow in\n1934\n. Keldysh submitted his doctoral thesis\nFunctions of Complex Variable and Harmonic Functions Representation with Polynomial Series\nto the\nSteklov\nMathematical Institute in\n1937\n- the degree was awarded in the following year\n[\n20\n]\n:-\nShortly after the award of the doctorate he began to teach at Moscow State university. He delivered with great success both regular undergraduate and highly specialised graduate courses of lectures and he supervised research students. Keldysh's research seminars soon came to assume a prominent role in the mathematical life of Moscow and influenced the development of many young mathematicians, both pure and applied, now distinguished research workers.\nKeldysh continued his research, often collaborating with his former teacher,\nMikhail Lavrent'ev\n. For example Keldysh published:\nConformal mappings of multiply connected domains on canonical domains\n(1939)\n, a survey of recent developments;\n(\nwith\nLavrent'ev\n)\nSur une évaluation pour la fonction de Green\n(1939)\n;\n(\nwith\nLavrent'ev\n)\nSur un problème de M Carleman\n(1939)\n; and the single-authored paper\nSur l'approximation en moyenne quadratique des fonctions analytiques\n(1939)\n. Reviewing this last mentioned paper, S E Warschawski writes:-\nThe author constructs examples of regions, not of\nCarathéodory\nclass, from which he infers that the class of all regions in which the system of all polynomials is closed cannot be characterized by topological properties but that this class depends on metrical properties of these regions.\nOne of the topics that most interested Keldysh around this time was the\nDirichlet\nproblem. As an example of his work in this area we quote from a review of Keldysh's paper\nOn the solubility and the stability of Dirichlet's problem\n(\nRussian\n)\n(1941)\n.\nJacob David Tamarkin\nbegins a detailed review as follows:-\nThe paper gives a very clear and concise exposition of various recent results concerning the solvability of\nDirichlet\n's problem and also the stability of the solution when the boundary of the domain varies. In Chapter I the author gives an exposition of the generalized solution of\nDirichlet\n's problem in the sense of\nWiener\n, and discusses the notions of regular and irregular points. In Chapter II he discusses the notion of capacity. Chapter III is devoted to\nWiener\n's criterion for regularity of a point, and to discussion of the behaviour of the solution at an irregular point. Chapter IV contains an exposition of the harmonic measure and integral representation of the generalized solution. These chapters contain some new results and many proofs of known results are presented in a new form. The last chapter V appears to contain mostly new results.\nSergei Novikov\n, in the interview\n[\n11\n]\n, sums up the contributions of his uncle Mstislav Keldysh:-\nMstislav Keldysh, was also a very talented mathematician in the theory of functions of a complex variable and in differential equations. An especially fundamental contribution was made by him to applied branches of aerodynamics. He was a Chief Theoretician-adviser of the government and an organizer of computational work related to jets and space in\n1940\n-\n1960\ns. He was a widely known person in the Soviet society. All information on the work of such people was classified and not reflected in the world press. M Keldysh was the President of the\nAcademy of Sciences of USSR\nfor a long time.\nLet us look in a little more detail at some of these aspects of Keldysh's career. First let us note that the problem of airplane 'flutter' was only the first such problem that he worked on. The next, related, problem was that of 'shimmy', that is the extreme vibrations which often occurred in the nose leg of a plane landing on three wheels. Here he was able to use his experience in solving the flutter problem and his solution to shimmy, together with detailed instructions to engineers on how to overcome the problem, was described in\nShimmy of the front gear of the three wheels undercart\n(1945)\n. As well as undertaking this type of work at the\nZhukovsky\nCentral Aero-Hydrodynamic Institute, he continued to work at the\nSteklov\nMathematical Institute, heading the Department of Mechanics from its foundation in April\n1944\nuntil\n1953\n. Examples of papers he published during this period illustrate the work he undertook at the\nSteklov\nInstitute:\nSur l'approximation en moyenne par polynomes des fonctions d'une variable complexe\n(1945)\n,\nSur l'interpolation des fonctions entières\n(1947)\n,\nOn the characteristic values and characteristic functions of certain classes of non-self-adjoint equations\n(\nRussian\n)\n(1951)\n, and\nOn a Tauberian theorem\n(\nRussian\n)\n(1951)\n. It is worth noting that, although these papers studied abstract mathematics, much of Keldysh's interest in these problems arose through meeting the ideas in practical applied mathematical situations\n[\n20\n]\n:-\nFor instance a paper he published in\n1951\non boundary value-problems for elliptic equations that degenerate on the boundary, that attracted much attention from Russian and foreign mathematicians had its origins in work he was doing in aerodynamics.\nAfter World War II, Keldysh turned increasingly to managing the major scientific research projects that were being carried out in the USSR. In\n1946\nhe left the\nZhukovsky\nCentral Aero-Hydrodynamic Institute to become head of the Jet-Powered Research Institute. He held this position for nine years. He served as vice-president of the\nUSSR Academy of Sciences\nduring\n1961\n-\n62\n, then served as its president from\n1962\nto\n1975\n. During this period be celebrated his\n60\nth\nbirthday in\n1971\n(\nsee\n[\n18\n]\n)\nand at the official birthday celebration, Keldysh spoke of his regret at leaving his academic research behind when he became fully occupied with management and administration. However, he had played an important role in the development of nuclear weapons by the Soviets as well as in their space research programme. For example, he was one of three scientists to make a proposal in\n1954\nfor the Soviet space satellite programme and in\n1955\nhe became head of the USSR Commission on the Satellite which was set up to oversee the programme. The first successful satellite launch in\n1957\nmarked the beginning of an intensive programme of space research and Keldysh was involved in this through a number of different organisations such as the Department of Applied Mathematics which he headed. In\n1959\nthe Interdepartmental Scientific and Engineering Council was established and Keldysh was appointed head of the Council.\nDuring his period as president of the\nUSSR Academy of Sciences\nhe introduced major reforms. One area in particular is worth commenting on because it illustrates the tension between Communist ideology and scientific studies. The Communists had rejected modern theories of genetics because they did not fit their ideology and instead supported the \"politically correct\" but scientifically foolish views of Trofim Lysenko. Matters came to a head in\n1964\n, during Keldysh's presidency, when Nikolai Nuzhdin, an associate of Lysenko, was proposed for full membership of the Academy. At the meeting where his proposal was discussed, Andrei Sakharov, one of Keldysh's colleagues in the development of nuclear weapons, spoke against saying:-\nThe Academy's Charter sets very high standards for its members with respect to both scientific merit and civic responsibility. Corresponding member Nikolai Nuzhdin does not satisfy the criteria. Together with Academician Lysenko, he is responsible for the shameful backwardness of Soviet biology and of genetics in particular, for the dissemination of pseudo-scientific views, for adventurism, for the degradation of learning, and for the defamation, firing, arrest, even death of many genuine scientists.\nNuzhdin's candidacy was rejected and Keldysh went on to build a structure within the Academy in which the science of genetics could be properly studied without political interference - an exceptionally difficult thing to achieve in the political situation that existed in the USSR at the time. Ian Sneddon writes about Keldysh in his role of president of the Academy in\n[\n20\n]\n:-\nThe office of President of the Academy carries with it many privileges; the one which seemed to give Keldysh the most pleasure was that of acting as official host to distinguished foreign scientists and as the leader of scientific delegations from the USSR. He was a person of great personal charm and wide intellectual sympathies, which contributed much to the success of these visits. He led a delegation which visited the\nRoyal Society of Edinburgh\nin February\n1965\nand those who were privileged to attend the dinner which our President, the late Professor J N Davidson, gave in his honour, will recall the impression which his speech on that occasion made on his audience - especially an impromptu part on the influence of Scott on Russian literature occasioned by his discovery\n(\nof only that evening\n)\nthat Scott had been President of the Society.\nIt was for health reasons that Keldysh stepped down as president of the Academy in\n1975\n. There are suggestions that his health deteriorated, partly because of overwork, partly because of the strain caused by the difficulties that a patriotic Russian was put under defending scientific ideals when science was being used as the main tool in a political struggle.\nKeldysh received many honours both from his own country and from foreign countries. He was awarded a State Prize\n(1942)\nand the Red Banner of Labour\n(1943)\nfor his work on flutter. Another State Prize was awarded in\n1946\nfor his work on shimmy. He was elected a corresponding member of the\nUSSR Academy of Sciences\nin\n1943\nand a full academician three years later. He was named Hero of the Socialist Labour in\n1956\nfor his solution to defence problems and received the Lenin Prize in the following year. In\n1961\nhe again was named Hero of the Socialist Labour, this time for his work on rockets and on Vostok, the world's first manned spaceship piloted by Yuri Gagarin. In\n1971\nhe was awarded the Sickle and Hammer for his organisation of Soviet science. Six times he received the Order of Lenin and he also was awarded several medals. He was elected to many academies: the Mongolian Academy of Sciences\n(1961)\n, the\nPolish Academy of Sciences\n(1962)\n, the\nCzech Academy of Sciences\n(1962)\n, the\nRomanian Academy of Sciences\n(1965)\n, the\nGerman Academy of Sciences\n(1966)\n, the Saxony Academy of Sciences in Leipzig\n(1966)\n, the\nAmerican Academy of Arts and Sciences\n(1966)\n, the\nBulgarian Academy of Sciences\n(1966)\n, the\nHungarian Academy of Sciences\n(1970)\n, and was elected an Honorary Foreign Fellow of the\nRoyal Society of Edinburgh\non\n1\nJuly\n1968\n. He also received an honorary D.Sc. from the University of Warsaw.\nFinally we note that he was elected to the Central Committee of Communist Party of the USSR\n(1961)\nand as a Deputy of the Supreme Soviet\n(1962)\n. In addition a crater on the Moon was named for him, as was a minor planet discovered in\n1973\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}