{
  "nome_completo": "Muhyi l'din al-Maghribi",
  "nome_curto": "Muhyi l'din al-Maghribi",
  "ano_nascimento": "1220",
  "ano_morte": "1280",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Maghribi/",
  "lugar_nascimento": null,
  "lugar_morte": "Maragha, Iran",
  "biografia": "Muhyi l'din al-Maghribi\nwas an eminent astronomer who was born in Spain, but who first worked in Damascus in Syria. His life seems to have been greatly affected by the wars of the period and he seems to have found favour with the winning side eventually working with\nal-Tusi\nat the Mongol observatory at Maragha, Iran.\nIn\n1256\nthe castle of Alamut was attacked by the forces of the Mongol leader Hulegu, a grandson of Genghis Khan, who was at that time set on extending Mongol power in Islamic areas. Some claim that\nal-Tusi\n, who was in the castle at this time, betrayed the defences of Alamut to the invading Mongols. Certainly Hulegu's forces destroyed Alamut and since Hulegu was himself interested in science, he treated\nal-Tusi\nwith great respect. Hulegu attacked Baghdad in\n1258\n, laid siege to the city, and entered it in February\n1258\n. Hulegu, however, had made Maragha, in the Azerbaijan region of northwestern Iran, his capital.\nMuhyi l'din went to Maragha in\n1258\nas a guest of Hulegu.\nAl-Tusi\nand Muhyi l'din were involved in the construction of an Observatory. Work began in\n1259\nwest of Maragha, and traces of it can still be seen there today. The observatory at Maragha became operational in\n1262\n. There is a unique manuscript by Muhyi l'din in which he lists precise observations made at the Maragha Observatory between\n1262\nand\n1274\n. The author of\n[\n4\n]\ndiscusses the three observations of the sun and the mathematical methods which Muhyi l'din used to find the solar eccentricity and\napogee\n.\nPerhaps Muhyi l'din is most famous for his work on trigonometry. He wrote\nBook on the theorem of Menelaus\nand\nTreatise on the calculation of sines\n. In this second work he used interpolation to calculate an approximate value for the sine of one degree. He did this by two different methods, then compared the values he obtained achieving an accuracy of\n4\nplaces. A more accurate value was not obtained until the work of\nQadi Zada\nand\nal-Kashi\n. In doing this work Muhyi l'din also found an approximate value for π which he compared with the bounds obtained by\nArchimedes\nusing\n96\ninscribed\nand\ncircumscribed\npolygons.\nMuhyi l'din also considered the classical problem of\ndoubling the cube\nwhich he approached by\nHippocrates\n' method of finding two mean proportionals between two given lines.\nAnother important aspect of Muhyi l'din's work was the critical commentaries which he produced on some of the classic Greek works such as\nEuclid\n's\nElements\n,\nApollonius\n's\nConics\n,\nTheodosius\n's\nSpherics\n, and\nMenelaus\n's\nSpherics\n. A particularly important commentary by Muhyi l'din is that on Book XV of the\nElements\n(\nwhich was not written by\nEuclid\n)\n.\nHypsicles\nadded a Book XIV to the\nElements\nwhich dealt with the mensuration of the regular\ndodecahedron\nand\nicosahedron\n. Later Book XV was written in Arabic by an unknown author, perhaps using Greek works which are now lost. Book XV has common features with Book XIV by\nHypsicles\nbut contains considerably more.\nThe original Arabic version of Book XV is lost but there are four surviving manuscripts containing Muhyi l'din's commentary on it. We know that there was more than one version of the Arabic Book XV, for recently a Hebrew translation of Book XV has been discovered which has been translated from a different version to that which Muhyi l'din used for his commentary. Muhyi l'din's Book XV contains\n[\n3\n]\n:-\n... the ratios of\n(1)\nthe edges,\n(2)\nthe faces,\n(3)\nthe surface areas,\n(4)\nthe perpendicular distances from the centre to a face and\n(5)\nthe volumes of the five regular polyhedra inscribed in one sphere.",
  "math_areas": []
}