{
  "nome_completo": "Alexander Murray Macbeath",
  "nome_curto": "Murray Macbeath",
  "ano_nascimento": "1923",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macbeath/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Warwick, England",
  "biografia": "Murray Macbeath\n's parents were Alexander Macbeath\n(1888\n-\n1964)\nand Grace Alexander Stewart\n(1890\n-\n1978)\n. Alexander Macbeath, Murray's father, was a Highlander born in Applecross, Ross, Scotland. He married Grace, the daughter of Alexander Stewart of Woodend, Glenlyon, Perthshire, in\n1921\nat the Royal Hotel, Perth. Alec Macbeath was a lecturer in Moral Philosophy at the University of Glasgow when their first child, a son Murray the subject of this biography, was born. Later in\n1923\n, Alec was appointed senior lecturer in Logic and Metaphysics at the University of Glasgow. The family moved to Belfast in\n1925\nwhen Alec was appointed as professor of logic and metaphysics at Queen's University, Belfast. Murray was the eldest of his parents' four children, having a sister Catriona Kennedy Macbeath\n(1925\n-\n2013)\nwho was born in Glasgow, and two brothers, Innis Stewart Macbeath\n(1928\n-\n1996)\nand Alan Macbeath\n(1930\n-\n2001)\n, both born in Belfast. Murray and his younger siblings were all brought up in Belfast where their father worked for the rest of his career. As well as his chair at Queen's University, Belfast, Alec was also Chairman of the Belfast Council of Social Welfare. Let us note at this point that Catriona met Leslie Proudfoot in Dublin and married him in\n1952\nin the Moness Hotel in Aberfeldy.\nMurray's school education was in Belfast and he continued his university studies there at Queen's University, graduating with a B.A. with first class honours in Mathematics in\n1942\n. Of course this was about the mid-point of World War II and, as soon as he graduated, Murray Macbeath was recruited to the Government Code and Cypher School at Bletchley Park where the codebreaking operations were being conducted. At Bletchley Park there were various Huts which worked on different aspects of decoding. Macbeath was assigned to Hut\n7\nwhich had the task of breaking the Japanese navy codes.\nGordon Welchman\nworked in Hut\n6\nwhich had the task of breaking the German Army and Air Force codes, while\nAlan Turing\nworked in Hut\n8\nwhich dealt with breaking the German Navy codes. Let me\n[\nEFR\n]\nnote at this point that when I talked to Macbeath fifty years after his time at Bletchley Park, he made it clear that he had signed the Official Secrets Act and, except for saying that he had worked at Bletchley Park during the war, he was not going to say a word about what went on there. Others, such as\nGordon Welchman\n, have taken a different approach and so much of the work done by Macbeath and others at Bletchley Park is now well known. Macbeath spoke Gaelic as well as English but to crack Japanese codes one had to be fluent in Japanese. The talented young man mastered the Japanese language quickly\n[\n4\n]\n:-\nWorking in Hut\n7\nunder the supervision of Colonel John Tiltman, Macbeath was engaged first in the breaking of the Japanese naval ciphers and then in translating the received text into English. His work broadened to include both Japanese naval and army air force communications.\nAfter World War II ended in\n1945\n, Macbeath went to Clare College, Cambridge, where he studied for an M.A. He wrote his first mathematics papers publishing\nThe minimum of an indefinite binary quadratic form\n(1947)\nand\nNon-homogeneous linear forms\n(1948)\nboth in the\nJournal\nof the\nLondon Mathematical Society\n. He won a Commonwealth Fund fellowship which enabled him to study for a Ph.D. at Princeton University. At Princeton his advisor was\nEmil Artin\nwho, as a Jew, had been forced to leave Germany in\n1937\n. After posts at various universities in the United States,\nArtin\nhad been appointed to Princeton in\n1946\n. Macbeath published\nNon-convex regions in three and more dimensions\n(1949)\nand participated in the\nSeminar on convex sets\nat the Institute for Advanced Study, Princeton, during\n1949\n-\n1950\n. Others taking part in this seminar included\nAmbrose Rogers\n, Victor Klee\n(1925\n-\n2007)\n, Olof Hanner\n(1922\n-\n)\n, Billy James Pettis\n(1913\n-\n1079)\nand Hans Radstrom\n(1919\n-\n1970)\n. Macbeath spoke in the seminar on compactness theorems and his contribution appeared in the mimeographed notes that were produced. In\n1950\nMacbeath was awarded his Ph.D. by Princeton University for his\n53\n-page thesis\nThe Geometry of Non-Homogeneous Lattices.\nBefore returning to England, Macbeath and two friends travelled round the United States in a car.\nBack in England, Macbeath was appointed as a senior fellow at Clare College, Cambridge. There he met his Julie at the Cambridge Strathspey and Reel Club. They married in\n1952\nand had two sons, Ian and Peter. Macbeath left Cambridge when he was appointed as a lecturer at the newly opened University College of North Staffordshire which had been founded in\n1949\n. It became the University of Keele in\n1962\nbut Macbeath left long before that to take up the chair of mathematics at University College, Dundee.\nEdward Copson\n, who held the chair of mathematics at University College, Dundee moved to the Regius Chair of Mathematics in St Andrews at the beginning of the\n1950\ns. Macbeath was appointed to fill the chair of mathematics at University College, Dundee, taking up the appointment in\n1953\n. We note that University College, Dundee, was then part of the University of St Andrews. It was renamed Queen's College in\n1954\n, still being a college of the University of St Andrews, and only became the University of Dundee in\n1967\n. Macbeath, who was only\n30\nyears of age when appointed to the chair, became the professor of a small department:-\nThe department at that time had a family atmosphere, decisions were taken during morning coffee, there were few official meetings, no teaching aids, no secretarial assistance, classes were small but teachers knew their students personally. Every member of the small staff might be called upon to lecture in any branch of mathematics ...\nHenry Jack\nwas one of the lecturers in Macbeath's department and they wrote the joint paper\nThe volume of a certain set of matrices\n(1959)\n. Macbeath explained how their joint work came about\n(\nsee for example\n[\n5\n]\n)\n:-\nJack\n's interest in integration spaces of matrices had its origin in a problem which arose in connection with certain work of\nC A Rogers\nand myself in the geometry of numbers.\n[\nThis is the paper by A M Macbeath and\nC A Rogers\n, 'A modified form of\nSiegel\n's mean-value theorem'\n(1955)\n.\n]\nThere were certain results which we were practically certain were true but further progress depended on being able to make an estimate of the order of magnitude of certain integrals as a parameter tended to infinity. We managed with some difficulty to get rather clumsy estimates which were sufficient for the purpose we had in mind, but at that time I drew\nJack\n's attention to the problem, mentioning how much more satisfactory it would be if an exact evaluation were possible. Within a few weeks\nJack\nproduced a complete solution in the case of the first two or three dimensions and then with later studying he solved the problem completely, with the use of very elegant combinations of algebraic and analytical techniques.\nIt was while he was in Dundee that Macbeath became interested in\nHurwitz\nGroups, a topic in which he became a leading expert. He explains in\n[\n2\n]\nhow he got started on\nHurwitz\nGroups:-\nOne day in the late\n1950\n's, rereading\nSiegel\n's article entitled 'Some remarks on discontinuous groups'\n(1945)\n, I was struck by his proof that the smallest area of fundamental region for a Fuchsian group is\nπ\n21\n\\large\\frac{\\pi}{21}\\normalsize\n2\n1\nπ\n​\n.\nSiegel\nnotes the remarkable similarity between the arithmetic used in his proof and the arithmetic in\nHurwitz\n's proof that a curve of genus g ≥\n2\nhas no more than\n84\n(\ng\n−\n1\n)\n84(g - 1)\n8\n4\n(\ng\n−\n1\n)\nbirational self-transformations. That, he said, is not surprising because of the theory of uniformization. That was all - no indication where to find\nHurwitz\n's paper, at that time unknown to me.\n(\nSiegel\nis one of my heroes, but, it must be confessed, he was not very good at citing references.\n)\nI did know about uniformization, and I made that connection at once. However, I had some trouble tracking down\nHurwitz\n's theorem. Finally, thanks to the late Professor\nW L Edge\n, I read\nHurwitz\n's paper\n[1893]\n, which invoked\nKlein\n's surface as an example to show that his bound was attained. So at last, by a very tortuous path, I unearthed this chapter of mathematics, which has fascinated me ever since.\nHis first important result on\nHurwitz\nGroups appeared in his paper\nOn a theorem of Hurwitz\n(1961)\n. In\n1963\n, Macbeath was appointed professor of mathematics at Birmingham University and he held this post until\n1979\n. Soon after arriving in Birmingham, Macbeath published\nElementary Vector Algebra\n(1964)\n. In the Preface, he explains his aim:-\n... it is hoped that a good average pupil could master most of the material without assistance from a teacher or lecturer.\nE A Maxwell\n, in a review of the book, writes\n[\n3\n]\n:-\nThere are now several attractive little books on elementary vectors, and this must come high on any list. Subject matter and treatment seem fairly standard; but the account is lucid and compelling, and the lay-out is effective. ... this\n[\nis an\n]\nexcellent introduction to a fascinating subject.\nHis lecture notes\nDiscontinuous groups and birational transformations\nwere published by Queen's College in\n1965\n. In\n1966\nhe took sabbatical leave which he spent at California Institute of Technology at Pasadena\n[\n7\n]\n:-\nHis family accompanied him and enjoyed the adventure of driving across the US from west to east at the end of their stay. Highlights included campsite tornados in Wyoming and returning to the UK on one of the last voyages of the Queen Mary.\nMacbeath was a good athlete and liked to keep fit. His two boys were also interested in sports and, like their father, enjoyed cycling\n[\n7\n]\n:-\n... he would regularly swim, work out at the gym and cycle to Birmingham University, often accompanied by his son Ian, who was at school nearby, as well as undertaking jaunts of over\n100\nmiles with his other son Peter, a keen racing cyclist.\nIn\n1979\nMacbeath left Birmingham to take up the chair of mathematics at Pittsburgh University in the United States\n[\n1\n]\n:-\nWhile they were there, he and his wife made many lifelong friends at the Scottish Country Dance Society, participating regularly in demonstrations and competitions. He also found sufficient energy to run the Pittsburgh Marathon at the age of\n60\n.\nMacbeath retired in\n1990\nand returned to live in his native Scotland. He chose to live in Tayport, Fife, close to Dundee where he had held his first chair. However, it was the mathematics at the University of St Andrews that interested him and he became an honorary professor at St Andrews with an office in the Mathematical Institute. St Andrews is about\n15\nkm from Tayport and he would drive to St Andrews most days and would be in the coffee room most mornings at\n11\no'clock. It was at this time that I\n[\nEFR\n]\nbegan working with him on the groups\nP\nS\nL\n(\n2\n,\nq\n)\n,\nq\n=\np\nm\n,\np\nPSL(2, q), q = p^{m}, p\nP\nS\nL\n(\n2\n,\nq\n)\n,\nq\n=\np\nm\n,\np\na prime. He had written the paper\nGenerators of the linear fractional groups\n(1969)\nin which he had proved that:\nP\nS\nL\n(\n2\n,\nq\n)\nPSL(2, q)\nP\nS\nL\n(\n2\n,\nq\n)\nis a\nHurwitz\ngroup if and only if either\nq\n=\n7\n,\nq = 7,\nq\n=\n7\n,\nor\nq\n=\np\nq = p\nq\n=\np\nis congruent to\n1\nor\n6\n(\nmod\n7)\n, or\nq\n=\np\n3\nq = p^{3}\nq\n=\np\n3\nwhere\np\np\np\nis congruent to\n2\n,\n3\n,\n4\nor\n5\n(\nmod\n7)\n.\nHowever, his family were living in the Midlands of England and after a while he decided to move to the Midlands to be closer to them. We did not continue to investigate generators of\nP\nS\nL\n(\n2\n,\nq\n)\nPSL(2, q)\nP\nS\nL\n(\n2\n,\nq\n)\nafter he moved away. In England, Macbeath lived in Wellesbourne, Warwickshire, and now was given an honorary position at the University of Warwick. Wellesbourne is a large village about\n8\nkm east of Stratford-upon-Avon, not far from Warwick and Leamington Spa. He continued to be in excellent health and was on top form both physically and mentally when I spoke to him at the British Mathematical Colloquium held at the University of Birmingham in\n2003\n[\n7\n]\n:-\nHe attended academic conferences well into his\n80\ns and enjoyed toasting the haggis with a good single malt on Burns Night, resplendent in full Highland dress at Lighthorne village hall. He and his wife were enthusiastic dancers and often led the less nimble-footed villagers around the hall.\nHe was elected president of the newly formed Lighthorne Caledonian Society in\n1995\nand presided over the annual Burn's supper every year to\n2014\n. Note that Lighthorne is a small village about\n7\nkm east of Wellesbourne. However, his heath began to fail and he suffered two strokes. These did nothing to dampen his spirit which continued to be high\n[\n1\n]\n:-\nBored with the hospital's strict no alcohol policy, he sneaked out one evening in pyjamas and dressing gown to avail himself, as he later confessed, of a wee dram. Unable to find a pub within walking distance, he had to settle for an off-licence instead. Astonished nursing staff later confiscated the can of beer he was sharing with a patient in the same ward. He also entertained staff and patients by singing rousing renditions of 'The Mountains of Mourne', 'Molly Malone' and 'Waltzing Matilda'.\nAlthough he recovered from the strokes, his health continued to deteriorate. However, his spirits remained high and he was able to partake in outdoor activities to celebrate his\n90\nth\nbirthday in June\n2013\n. After his death, a funeral service was held at Oakley Wood Crematorium on Wednesday\n28\nMay\n2014\n.\nAmong the honours that Macbeath received, we note that he was elected a fellow of the\nRoyal Society of Edinburgh\non\n7\nMarch\n1955\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}