{
  "nome_completo": "Narayana Pandit",
  "nome_curto": "Narayana",
  "ano_nascimento": "1340",
  "ano_morte": "1400",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Narayana/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "Narayana\nwas the son of Nrsimha\n(\nsometimes written Narasimha\n)\n. We know that he wrote his most famous work\nGanita Kaumudi\non arithmetic in\n1356\nbut little else is known of him. His mathematical writings show that he was strongly influenced by\nBhaskara II\nand he wrote a commentary on the\nLilavati\nof\nBhaskara II\ncalled\nKarmapradipika\n. Some historians dispute that Narayana is the author of this commentary which they attribute to\nMadhava\n.\nIn the\nGanita Kaumudi\nNarayana considers the mathematical operation on numbers. Like many other Indian writers of arithmetics before him he considered an algorithm for multiplying numbers and he then looked at the special case of squaring numbers. One of the unusual features of Narayana's work\nKarmapradipika\nis that he gave seven methods of squaring numbers which are not found in the work of other Indian mathematicians.\nHe discussed another standard topic for Indian mathematicians namely that of finding triangles whose sides had integral values. In particular he gave a rule of finding integral triangles whose sides differ by one unit of length and which contain a pair of right-angled triangles having integral sides with a common integral height. In terms of geometry Narayana gave a rule for a segment of a circle. Narayana\n[\n4\n]\n:-\n... derived his rule for a segment of a circle from\nMahavira\n's rule for an 'elongated circle' or an ellipse-like figure.\nNarayana also gave a rule to calculate approximate values of a square root. He did this by using an indeterminate equation of the second order,\nN\nx\n2\n+\n1\n=\ny\n2\nNx^{2} + 1 = y^{2}\nN\nx\n2\n+\n1\n=\ny\n2\n, where\nN\nN\nN\nis the number whose square root is to be calculated. If\nx\nx\nx\nand\ny\ny\ny\nare a pair of roots of this equation with\nx\n<\ny\nx < y\nx\n<\ny\nthen √\nN\nN\nN\nis approximately equal to\ny\nx\n\\Large\\frac{y}{x}\nx\ny\n​\n. To illustrate this method Narayana takes\nN\n=\n10\nN = 10\nN\n=\n1\n0\n. He then finds the solutions\nx\n=\n6\n,\ny\n=\n19\nx = 6, y = 19\nx\n=\n6\n,\ny\n=\n1\n9\nwhich give the approximation\n19\n6\n=\n3.1666666666666666667\n\\large\\frac{19}{6}\\normalsize  = 3.1666666666666666667\n6\n1\n9\n​\n=\n3\n.\n1\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n6\n7\n, which is correct to\n2\ndecimal places. Narayana then gives the solutions\nx\n=\n228\n,\ny\n=\n721\nx = 228, y = 721\nx\n=\n2\n2\n8\n,\ny\n=\n7\n2\n1\nwhich give the approximation\n721\n228\n=\n3.1622807017543859649\n\\large\\frac{721}{228}\\normalsize  = 3.1622807017543859649\n2\n2\n8\n7\n2\n1\n​\n=\n3\n.\n1\n6\n2\n2\n8\n0\n7\n0\n1\n7\n5\n4\n3\n8\n5\n9\n6\n4\n9\n, correct to four places. Finally Narayana gives the pair of solutions\nx\n=\n8658\n,\ny\n=\n227379\nx = 8658, y = 227379\nx\n=\n8\n6\n5\n8\n,\ny\n=\n2\n2\n7\n3\n7\n9\nwhich give the approximation\n227379\n8658\n=\n3.1622776622776622777\n\\large\\frac{227379}{8658}\\normalsize  = 3.1622776622776622777\n8\n6\n5\n8\n2\n2\n7\n3\n7\n9\n​\n=\n3\n.\n1\n6\n2\n2\n7\n7\n6\n6\n2\n2\n7\n7\n6\n6\n2\n2\n7\n7\n7\n, correct to eight decimal places. Note for comparison that √\n10\nis, correct to\n20\nplaces,\n3\n.\n1622776601683793320\n. See\n[\n3\n]\nfor more information.\nThe thirteenth chapter of\nGanita Kaumudi\nwas called\nNet of Numbers\nand was devoted to number sequences. For example, he discussed some problems concerning arithmetic progressions.\nThe fourteenth chapter\n(\nwhich is the last one\n)\nof Naryana's\nGanita Kaumudi\ncontains a detailed discussion of magic squares and similar figures. Narayana gave the rules for the formation of doubly even, even and odd perfect\nmagic squares\nalong with magic triangles, rectangles and circles. He used formulae and rules for the relations between magic squares and arithmetic series. He gave methods for finding \"the horizontal difference\" and the first term of a magic square whose square's constant and the number of terms are given and he also gave rules for finding \"the vertical difference\" in the case where this information is given.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}