{
  "nome_completo": "Naum Il'ich Akhiezer",
  "nome_curto": "Naum Il'ich Akhiezer",
  "ano_nascimento": "1901",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Akhiezer/",
  "lugar_nascimento": "Cherikov, Russian Empire (now Belarus)",
  "lugar_morte": "Kharkov, USSR",
  "biografia": "Naum Il'ich Akhiezer\n's father was the medical doctor for the district in and around Cherikov. The town of Cherikov, called Cherykau in Belarusian, had around\n5500\ninhabitants when Naum Il'ich was born. His brother Alexander Il'ich Akhiezer was ten years younger than Naum Il'ich and went on to become a famous theoretical physicist. Naum Il'ich attended the local\nGymnasium\nin Cherikov, graduating in\n1918\n. Then he taught mathematics and physics at the Lemelsk school-commune for four years before beginning his university studies. Perhaps we should make clear that, following the Revolution, Ukraine did not have any universities, but it contained Institutes of Public Education which filled a similar role.\nAkhiezer studied at the Kiev Institute of Public Education, entering in\n1922\non a three-year course of study. However, he was an exceptional student and was able to complete the full course of study by December\n1923\nhaving taken around eighteen months. This is even more remarkable when one realises that he was also teaching at one of the local Kiev schools during the time he was studying at the Institute. In many ways he went far beyond what was expected of any student\n[\n6\n]\n:-\nWhile preparing for the examinations he was also able, in this short time, to prepare resumes of a number of the basic courses; these were subsequently used by many students. His accelerated passage through the course did not prevent him from taking an active part in a number of scientific seminars. To this same period dates his first enthusiasm for the theory of\nelliptic functions\n, which he studied from the original memoirs of\nJacobi\nin Latin. Subsequently he was to return several times to this theory, and to make masterly use of it in various problems of analysis. At the same period he began studying the celebrated doctoral dissertation of\nN E Zolotarev\n, and certain other work by classic native authors.\nHe met a fellow undergraduate\nMark Grigorievich Krein\nwho had entered the Kiev Institute of Public Education at the age of fourteen. Akhiezer and Krein became friends and around ten years later collaborated on mathematical projects. Akhiezer graduated from the Kiev Institute of Public Education in\n1924\n. In addition to his school teaching, at this time Akhiezer was assisting\nDmitry Aleksandrovich Grave\nby conducting practical classes for him at one of the Higher Educational Institutes in Kiev. Akhiezer became a research student of\nGrave\n's in\n1925\nand worked on his dissertation\n[\n6\n]\n:-\nAt that time\nGrave\nhad begun to occupy himself with questions of mechanics and applied mathematics, and he led his pupils in the same direction. Akhiezer's research was on the theory of functions of a complex variable and its applications to aerodynamics. In March,\n1928\nhe defended his dissertation 'Aerodynamical Investigations'\n(\nUkrainian\n)\n, which had appeared in the journal 'Trudy Piz.-Mat. Otdela Ukrain. Akad. Nauk.' We remark that it was in this paper that the formula was first given for mapping a doubly-connected domain, bounded by polygons, onto a circular annulus.\nAfter undertaking research with\nGrave\n, in\n1928\nhe joined the staff at Kiev University and the Kiev Aviation Institute and taught there until\n1933\n. During this period he worked on the theory of functions publishing many papers in Russian, French and German. Examples of his papers from his time in Kiev are:\nOn polynomials deviating least from zero\n(\nRussian\n)\n(1930)\n,\nOn the extremal properties of certain fractional functions\n(\nRussian\n)\n(1930)\n,\nOn a minimum problem in the theory of functions, and on the number of roots of an algebraic equation which lie inside the unit circle\n(\nRussian\n)\n(1931)\n, and\nÜber einige Funktionen, welche in zwei gegebenen Intervallen am wenigsten von Null abweichen\nⓉ\n(\nOn some functions which in two given intervals differ least from zero\n)\n(3\nparts,\n1932\n-\n1933)\n. In the first of these papers Akhiezer solved the problem of finding the polynomial with three fixed coefficients deviating least from zero on a given interval. This extended results by\nChebyshev\nwho had solved the problem for polynomials with one fixed coefficient, and by\nZolotarev\nfor polynomials with two fixed coefficients.\nFrom\n1933\nAkhiezer worked at Kharkov University. There he joined the Kharkov School of function theory and soon became its leading member. He was appointed to the Chair of the Theory of Functions in\n1933\nand, two years later, was appointed director of the Mathematical and Mechanical Research Institute after\nSergei Bernstein\nmoved to Leningrad. He served as President of the\nKharkov Mathematical Society\nfor more than\n25\nyears and was elected to the\nUkrainian Academy of Sciences\nin\n1934\n. Akhiezer had never been awarded a doctorate since academic degrees of Master of Science and Doctor of Science had been abolished in the USSR in\n1918\n. However, they were reintroduced in\n1934\nand, in\n1936\nAkhiezer was awarded an honorary degree of Doctor of Physical-Mathematical Sciences. In around\n1935\n,\nKolmogorov\nlaid the foundation for a new study, namely that of the extremal problem for a class of functions. In\n1937\nAkhiezer, working with his friend\nM G Krein\n, solved the extremal problem for the class of differentiable periodic functions. The two mathematicians collaborated on writing the book\nOn some problems of the theory of moments\n(\nRussian\n)\npublished in\n1938\n. Akhiezer continued to work on this topic and was later to solve the extremal problem for the class of analytic functions. He published\nThe classical moment problem and some related topics in analysis\nin\n1961\n(\nRussian, English translation\n1965)\n. A review begins:-\nThe moment problem is of importance in several areas of mathematics, e.g., certain problems of analysis such as quadrature formulas,\ncontinued fractions\n, orthogonal polynomials, the interpolation problem for functions of a complex variable, quasi-analytic classes of functions and monotone functions, spectral theory of operators, etc. ... The present book serves as a solid foundation for the application of the moment problem to the above fields ...\nDuring World War II, as his contribution to war work, he moved to the Alma-Ata Mining and Metallurgy Institute in\n1941\nwhere he remained until\n1943\nwhen he transferred to the Moscow Power Institute. He returned to his Chair of the Theory of Functions at Kharkov University in\n1947\n. Between\n1941\nand\n1945\nhe did not publish any papers but from\n1945\nonwards he was able to publish again with papers such as\nOn some inversion formulae for singular integrals\n(1945)\n,\nThe general theory of Chebyshev polynomials\n(1945)\n,\nOn some properties of entire transcendental functions of exponential type\n(1946)\nand the book\nLectures on the Theory of Approximation\nin\n1947\n. This important book was awarded the\nChebyshev\nPrize in\n1949\n.\nAntoni Zygmund\nwrites:-\nThis is an interesting and valuable book representing various aspects of the theory of approximation of functions in the real domain. ... The presentation is clear and elegant.\nAndrey Kolmogorov\n, in a review of this book, described Akhiezer's monographs as:-\n... masterpieces of mathematical literature, combining width and clarity of general conception with virtuosity in the handling of details.\nThe book was translated into English and published in\n1956\n, being reprinted in\n1992\n.\nHis main work was on function theory and approximation theory, building on the results of\nChebyshev\n,\nZolotarev\nand\nMarkov\n.\nVolodymyr Petryshyn\ncomments that:-\nHis most outstanding work consisted of deep approximation results in the constructive function theory, including the solution of the problem of\nZolotarev\n.\nBoris Verkin, the founder and first director of the Institute for Low Temperature Physics and Engineering of the Academy of Sciences of Ukraine, was a specialist in experimental physics and held mathematics in high esteem. He persuaded several mathematicians including Akhiezer to join the Institute in the early\n1960\n's and Akhiezer became head of the Department of the Theory of Functions at this Institute.\nAkhiezer's later work, in addition to that on the theory of moments, included joint work with\nSergei Bernstein\non completeness of sets of polynomials. Akhiezer wrote\n150\npapers and\n10\nbooks, one of which was the important\nTheory of Operators in\nHilbert Space\n. This work, written jointly with Israel M Glazman, was first published in Russian in\n1950\n. It was translated into English and published as two volumes, in\n1961\nand\n1963\n. In\n1966\nthe authors produced a major revision and augmentation of the text for a second Russian edition, and they produced a third edition in two volumes in\n1977\n,\n1978\n. This third Russian edition was translated into English and published in\n1981\n. The two English volumes published in\n1961\nand\n1963\nwere reprinted as a single volume in\n1993\n.\nHe also contributed to the history of mathematics with an important book on\nSergei Bernstein\nand his work. He also edited the collected works of\nPafnuty Lvovich Chebyshev\n,\nAndrei Andreyevich Markov\n,\nAleksandr Mikhailovich Lyapunov\nand\nNikolay Yakovlevich Sonin\n.\nAkhiezer was highly praised as a teacher\n[\n6\n]\n:-\nHe comes to his teaching with the greatest sense of responsibility, and thoroughly prepares his courses, usually in written form. He reads these lectures with great animation, infecting the audience with his unaffected enthusiasm and desire to reveal the beauty of mathematical constructions. His great personal charm, sparkling wit and cheerfulness, and his open and friendly attitude towards the young, have always attracted talented young people to Akhiezer, a great number of whom have developed into good mathematicians who are working in various cities of the USSR.\nIn\n[\n3\n]\nsome of his other contributions are mentioned:-\nNaum Il'ich had a wide range of interests, never ceased to organise mathematician teams in Kharkov Polytechnical Institute and Kharkov University. More than that, he took many far reaching initiatives to raise the new generation of mathematicians\n(\nsetting up the well known\n27\n-th mathematics school, the Kharkov State University based External youth mathematics school\n)\n. His pedagogical gift and lecturer's skill were famed in Kharkov higher education institutions.\nThe authors of\n[\n5\n]\nwrite:-\nMany generations of students at the University of Kharkov heard Akhiezer's remarkable lectures and were astonished by their elegance and originality. These lectures had a significant formative influence on many mathematicians. He was gladdened by the success of young mathematicians, who always found in him a supporter. He had a brilliant and fascinating personality; his intellectual interests were unusually wide, and his energy and enthusiasm did not forsake him until the very last day.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}