{
  "nome_completo": "Nevil Maskelyne",
  "nome_curto": "Nevil Maskelyne",
  "ano_nascimento": "1732",
  "ano_morte": "1811",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maskelyne/",
  "lugar_nascimento": "Kensington Gore, London, England",
  "lugar_morte": "Greenwich, England",
  "biografia": "Nevil Maskelyne\n's father, Edmund Maskelyne, was a practising barrister-at-law and Counsel to the Secretary of State's Office. He lived at Purton Down, Wiltshire, England. Edmund Maskelyne married Elizabeth Booth, daughter of John Booth and Elizabeth Proger, on\n4\nFebruary\n1724\n. They had four children, William Maskelyne\n(1725\n-\n1772)\n, Edmund Maskelyne\n(1728\n-\n1775)\n, Nevil Maskelyne\n(\nthe subject of this biography\n)\n, and Margaret Maskelyne\n(1735\n-\n1817)\n. Nevil Maskelyne wrote autobiographical notes in\n1800\nin which he gave some information about the origins of the family. He said he was\n(\nsee for example\n[\n1\n]\n)\n:-\n... the last male heir of an ancient family long settled at Purton in the County of Wiltshire, which from the name probably came from Normandy, where there is or was\n50\nyears ago a family of that name Masqueline.\nAll four children were born in Kensington but, in\n1736\n, the family moved to Tothill Street, Westminster. This meant that the two eldest boys, William and Edmund, were close to Westminster School where they were pupils and their father, Edmund Sr., was close to his place of work. In January\n1741\nNevil began his education at Westminster School. Edmund Sr., died in March\n1744\nwhen Nevil was\n12\nyears old leaving the family rather poor. Nevil was still being educated at Westminster School when his mother Elizabeth died in\n1748\n. After this Nevil boarded at Vincent Bourne's house in Westminster while he continued his school education. Just before the death of his mother his interest in astronomy had begun after seeing the eclipse of\n25\nJuly\n1748\n. Maskelyne writing about his school education said\n(\nsee for example\n[\n1\n]\n)\n:-\nGreat mathematicians have become astronomers from the facility mathematics gave them in the attainment of astronomy; but here the love of astronomy was the motive of application to mathematics without which our astronomer soon found he could not make the progress he wished in his favourite science; in a few months, without any assistance he made himself master of the elements of geometry and algebra. With these helps he soon read the principal books in astronomy and optics and also in ... mechanics, pneumatics and hydrostatics. The considerable progress he had made in these sciences led him naturally to the University of Cambridge...\nMaskelyne entered St Catharine's College, Cambridge in November\n1749\n. In the summer of the following year he moved to Pembroke College and in\n1752\nhe moved again, this time to Trinity College where he studied the mathematical tripos and graduated with a B.A. in\n1754\n. He was ranked as seventh\nwrangler\nin the mathematical tripos. As part of his move to gain a fellowship, he was ordained a minister in\n1755\n, becoming a curate at Chipping Barnet in Hertfordshire. Then he became a fellow of Trinity College, Cambridge in\n1756\n. By this time he was in close contact with\nJames Bradley\nwho was the Savilian professor of astronomy at Oxford and the Astronomer Royal. Maskelyne learned much from working with\nBradley\nand assisted him in producing a table of refractions.\nWith\nBradley\nas one of his supporters, on\n27\nApril\n1758\nMaskelyne was admitted to the\nRoyal Society of London\n, his recommendation describing him as\n... a person well versed in mathematical learning and natural philosophy ...\nOn\n14\nJuly\n1760\nthe\nRoyal Society\nagreed to send Maskelyne to the island of St Helena to observe a\ntransit\nof Venus which would take place on\n6\nJune\n1761\n. Maskelyne had earlier proposed that the same expedition should try to measure the parallax of the star Sirius.\nAn extract from Maskelyne's parallax proposal is at\nTHIS LINK\nThis Venus transit was important since accurate measurements would allow the distance from the Earth to the Sun to be accurately measured and the scale of the\nsolar system\ndetermined. He set sail on the ship Prince Henry on\n18\nJanuary\n1761\n. During the voyage he experimented with the lunar position method of determining longitude using the lunar tables produced by\nTobias Mayer\n. He arrived in St Helena on\n6\nApril\n1761\nin plenty of time to find a good site for observing and to set up his instruments. Sadly, the\n6\nJune was cloudy and he was unable to make measurements of the transit. He spent several months on St Helena trying to compute the parallax of Sirius but eventually decided that his instruments were faulty. Disappointed, Maskelyne set sail for England on the ship Warwick in February\n1762\n. Reaching Plymouth on\n15\nMay, he went back to Chipping Barnet, where he was a curate, and worked on publishing a book. He published the lunar distance method for determining longitude in\nThe British Mariner's Guide\n(1763)\nwhere he also included\nTobias Mayer\n's tables.\nIn\n1763\nhe went on a voyage to Barbados to carry out trials of John Harrison's timepiece H\n4\n. Maskelyne, although not a member of the Board of Longitude who were evaluating methods of computing longitude for which a large prize was on offer, was considered a suitable judge since he could compute the longitude of Barbados accurately using Jupiter's satellites, and compare this accurate result with that given by Harrison's H\n4\nand also the result given by his lunar distance method. Maskelyne sailed on the HMS Princess Louisa on\n23\nSeptember as the ship's chaplain reaching Bridgetown, Barbados, on\n7\nNovember. William Harrison, John Harrison's son, arrived with the timepiece H\n4\non\n13\nMay\n1764\n. He objected to Maskelyne's involvement in the H\n4\ntrials since Maskelyne was championing his own lunar distances method. They agreed a compromise in terms of who made the measurements and the trials were carried out. Harrison's H\n4\ncame out best with an error of around\n10\nmiles, with the lunar distance method producing an error of around\n30\nmiles. Back in England, he presented the results to the Royal Society on\n20\nDecember\n1764\n. On\n9\nFebruary\n1765\nthe Board of Longitude gave its approval to both Harrison's H\n4\nand to the lunar distance method.\nSoon after his return, on\n26\nFebruary\n1765\n, he was appointed Astronomer Royal to succeed Nathaniel Bliss who had only held the post for two years when he died in September\n1764\n. All four men to hold the post of Astronomer Royal before Maskelyne had done so with minimal salary as people of independent means. Maskelyne, on the other hand, was given a salary to make the post his main occupation\n(\n£\n350\nper annum\n)\n. This had the effect of making his observations public property whereas the earlier holders of the post considered their observations their private property. He published the first volume of the\nNautical Almanac\nin December\n1766\nand continued to work on this project up to the time of his death. The original purpose was to present tables to allow longitude to be computed by the lunar distance method\n[\n15\n]\n:-\n[\nThe Nautical Almanac's\n]\nessential feature was a table of lunar distances computed to a nominal precision of\n1\n\" for three-hourly intervals throughout the year\n[\nof\n1767]\n, supplemented by additional requisite tables, explanations, instructions and examples worked out by Maskelyne himself. The difficulties were thereby reduced to the computation of local time-equivalent to finding an azimuth - and the correction of the observed lunar distances\n(\nby means of either of two methods described in the almanac\n)\nfor the effects of refraction and parallax.\nThe work that Maskelyne carried out as Astronomer Royal at the Greenwich Observatory is described by Mary Croarken\n[\n8\n]\n:-\nThe principal work at Greenwich was to observe the positions of the Sun, Moon, planets and stars and to publish these data. This was a considerable undertaking because not only did the observations need to made, frequently at night, but they also needed to be reduced, i.e. corrected for refraction, parallax, instrument error, and so on, and a fair copy had to be made. To perform most of these duties Maskelyne hired an assistant. ... Maskelyne, like many of his scientific contemporaries an ordained minister of the Church of England, annually visited his parish living in Wiltshire and regularly attended\nRoyal Society\nand other meetings in London, where he was very much part of the scientific establishment. In practice this meant that his assistant was expected to carry most of the observing load, although in fairness the observing books show that Maskelyne also regularly observed when in residence.\nAlso in\n[\n18\n]\nthere is an interesting description of the skills Maskelyne required of his assistants, set down by him in\n1787\n:-\nTo understand Arithmetic, Geometry, Algebra, Plane and Spherical Trigonometry, and Logarithms; to have a good eye and good ears, be well grown, and have a good constitution to enable him to apply several hours in the day to calculation, and to get up to the observations that happen at late hours in the night. To write a good hand, and be a ready and steady arithmetical computer. If he know something of Astronomy and had a mechanical turn so much the better. To be sober and diligent, and able to bear confinement. Age from\n20\nto\n40\n.\nOf course, Maskelyne's appointment as Astronomer Royal was rather a blow to John Harrison who considered him his major competitor for the longitude prize. Being Astronomer Royal meant that Maskelyne became a member of the Board of Longitude\n[\n11\n]\n:-\n... the resulting report on H\n4\nwas entirely negative. It seems Maskelyne prevaricated over the meaning of \"accuracy\" to condemn Harrison's creation. In this era, all clocks gained or lost time at some rate, but so long as that rate was constant and known, one could derive an accurate time. Maskelyne refused to allow these corrections.\nHarrison died in\n1776\nbelieving to the end that Maskelyne was biased in his judgement of H\n4\n.\nMaskelyne proposed to the Royal Society in\n1772\n, an experiment for determining the Earth's density with the use of a plumb line. He was not the first to suggest such an experiment.\nBouguer\nand\nLa Condamine\nhad tried such an experiment over\n30\nyears before. The\nRoyal Society\nset up the Committee for the Attraction of Mountains which sent various scientists to seek suitable mountains in England and Scotland which had to be:-\n... of sufficient height, tolerably detached from other hills, and considerably larger from East to West than from North to South.\nMaskelyne, after seeking permission from King George II to be absent from his duties at Greenwich, carried out the experiment in\n1774\non Schiehallion, a mountain in Perthshire, Scotland. Schiehallion was chosen by the Committee for the Attraction of Mountains because it was surprisingly regular and conical in shape so its volume could be determined accurately. He set up an observatory on the south side of the mountain, marked a meridian line, set up a plumb-line linked to a telescope and observed\n39\nstars with\n169\nobservations as they crossed the meridian\n[\n5\n]\n:-\nThe angular distance of each star from the \"zenith\"\n(\nas indicated by the plumb-line\n)\nwas noted with great care.\nAfter making these observations, he set up an observatory on the north side of the mountain and made a similar series of observations. From his observations, which had to be corrected for refraction, precession, aberration, deviation and nutation, Maskelyne computed that the plumb-line was pulled\n11\n.\n7\n\" by the gravitational attraction of the mountain. From that he deduced that the Earth's density is approximately\n4\n.\n5\ntimes that of water. He was awarded the Copley medal of the Royal Society in\n1775\nfor his:-\nCurious and Laborious Observations on the Attraction of Mountains.\nExcerpts from his papers on this subject are given at\nTHIS LINK\n.\nWe have noted that Maskelyne was ordained in\n1755\n. In\n1768\nhe was awarded the degree of bachelor of divinity by the University of Cambridge and, in\n1775\n, he was given the living of Shrawardine in Shropshire. His brother William died in\n1772\nand Maskelyne inherited Pond's Farm, Purton Stoke, Wiltshire at this time. In\n1777\nhe was awarded the degree of doctor of divinity by the University of Cambridge and, in\n1782\n, he was given the living of North Runcton, Norfolk by Trinity College. He married Sophia Rose\n(1752\n-\n1821)\n, the second daughter of John Pate Rose of Cotterstock, Northamptonshire, on\n21\nAugust\n1784\nin St Andrew's, Holborn. They had a daughter Margaret\n(\nborn at Greenwich on\n27\nJune\n1785)\n. After their marriage, the Maskelynes made much use of Pond's Farm as a country retreat.\nWe mention a few other aspects of Maskelyne's work:\nOf course, optics was a topic of great interest and relevance to him and in\n1761\nhe published a \"Theorem of the Aberration of the Rays of Light refracted through a Lens, on account of the Imperfection of the Spherical Figure\".\nAlthough he did not visit North America, Maskelyne was very much involved in astronomical and surveying measurements made by Charles Mason and Jeremiah Dixon in Pennsylvania during\n1765\n-\n68\n(\nsee\n[\n6\n]\nfor details\n)\n.\nThe discovery of night myopia, the fact that one tends to be short-sighted in the dark, was made by\nLord Rayleigh\nin\n1883\n. However, as John Levene points out in\n[\n21\n]\n, this was discovered by Maskelyne and published in his paper\nAn attempt to explain a Difficulty in the Theory of Vision, depending on the Different Refrangibility of Light\nof\n1789\n.\nAlthough not greatly interested in original mathematical ideas, he did prove some new geometry theorems. For example, in\n1808\nhe published a paper giving a proof of the following theorem:\nLet the circumference of a circle be divided any how into three arches\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\n; that is, let\nA\n+\nB\n+\nC\nA + B + C\nA\n+\nB\n+\nC\nbe equal to the whole circumference. I say, the square of the radius multiplied into the sum of the tangents of the three arches\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\n, is equal to the product of the tangents multiplied together.\nAs to his character he is described as\n[\n4\n]\n:-\n... urbane, shrewd and likeable\n(\nespecially if one happened to be on his side\n)\n. As one of a line of squirearchial Nevil Maskelynes and brother-in-law to Clive of India, he knew his place in an ordered society and was an adroit mover in a world of gentlemen scientists and sailors.\nDerek Howse writes\n[\n1\n]\n:-\nThe evidence from the large body of correspondence that has survived proves that, pompous and a bit of a bore as he might have seemed to some, Maskelyne was almost universally liked and admired by his contemporaries - except perhaps by some chronometer makers and their families. The reputation that survives in some popular twentieth-century books of Maskelyne as the evil genius who tried to deprive the poor illiterate carpenter of his just rewards-out of personal spite and because of his own involvement in the rival lunar-distance method of finding longitude-was certainly not one that was held generally in his own day, nor is it in any way justified by modern research: he was a member of the board of longitude, appointed by parliament to advise on the award of large sums of public money; there is no evidence whatsoever that he at any time abused his position as a public servant, still less lined his own pocket.\nMaskelyne was honoured for his contributions by many societies and academies throughout the world. He was elected to the\nAmerican Academy of Arts and Sciences\n, the\nParis Academy of Sciences\n, the Hanover Academy of Sciences and academies in Russia and Poland.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}