{
  "nome_completo": "Samuel Newby Curle",
  "nome_curto": "Newby Curle",
  "ano_nascimento": "1930",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Curle/",
  "lugar_nascimento": "Sunderland, Tyne & Wear, England",
  "lugar_morte": "Lodge Farm Lane, Settle, North Yorkshire, England",
  "biografia": "Newby Curle\nwas always known to his friends and colleagues as Newby and he never used his first name of Samuel. His parents were Samuel Curle\n(1868\n-\n1937)\n, a county court cashier, and Edith Newby\n(1889\n-\n1958)\n. Samuel Curle, born on\n9\nOctober\n1868\nat\n41\nHenry St East, Sunderland, Durham, England, was from a large family. He married Mary Ann\n(\nPolly\n)\nGibson\n(1867\n-\n1927)\nin Sunderland and they had seven daughters, two of whom died as babies: Phoebe Curle\n(1891\n-\n1974)\n, Florence Curle\n(1892\n-\n1981)\n, Lilian Curle\n(1895\n-\n1976)\n, Mary Curle\n(1898\n-\n1898)\n, Mary Curle\n(1902\n-\n1988)\n, Gladys Cass Curle\n(1905\n-\n1905)\n, and Ethel Curle\n(1907\n-\n1998)\n. Polly Curle died in\n1927\nand Samuel Curle married Edith Newby\n(1889\n-\n1958)\non\n5\nApril\n1930\n. Edith had married Harry Holmes\n(1890\n-\n1927)\nin\n1910\nand both Samuel and Edith had been widowed in\n1927\n. Their only child was Newby Curle, the subject of this biography. Newby had five half-sisters from his father's first marriage but no half-brothers or half-sisters from his mother's side, her only child being a boy who died as a baby.\nWhen Newby was seven years old, his father died of bronchial pneumonia in Highfield Infirmary, Sunderland. He was brought up at\n37\nOrmonde St, Sunderland, Durham and first attended Barnes Council School, Sunderland, followed by Bede Grammar School. Barnes Council School, on Mount Road, Sunderland, had been founded in\n1902\n. Bede School had been founded in\n1890\nbut moved to new buildings on Durham Road in\n1927\n. It became a grammar school in\n1944\n, following the Education Act.\nWe give two obituaries of Newby Curle at\nTHIS LINK\n.\nSince these obituaries give a detailed account of Newby Curle's career, we only give a few extra details here.\nNewby Curle married Shirley Kingsford Campion\n(1934\n-\n2016)\nat Teddington Methodist Church, Middlesex South, Middlesex on\n3\nNovember\n1956\n. Shirley was the daughter of Thomas George Campion who was an aircraft inspector.\nAfter being appointed to the University of St Andrews, Newby Curle had a house built at\n18\nIrvine Crescent. This road was built on university land and originally plots were feued to university staff but, around the time that he had his house built, the university opened it up for anyone. It was, however, a road with most houses owed by university staff. In\n1970\nfive members of the Mathematical Institute were living in Irvine Crescent.\nOn\n7\nMarch\n1977\n, Newby Curle was elected to the\nRoyal Society of Edinburgh\n. His proposers were Andrew G Mackie,\nW Norrie Everitt\n,\nDouglas S Jones\n, and\nDonald C Pack\n.\nLet me\n[\nEFR\n]\nadd one personal note. Newby Curle was appointed to the\nGregory\nChair of Applied Mathematics at the University of St Andrews in\n1967\n. I had been an undergraduate at St Andrews, leaving in\n1965\nto undertake research at the University of Warwick, and was appointed onto the staff at St Andrews in\n1968\n. Coming into the coffee room on my first day as a lecturer was a strange experience since most of those who were now my colleagues had been my lecturers. Newby Curle was the one to realise this and went out of his way to make it easy for me. I was always grateful to Newby for his kindness.\nThe Annual Report for Department of Applied Mathematics of the University of St Andrews for\n1988\n-\n89\nstates:-\nThe Department suffered  a great loss when Professor S N Curle died suddenly in June. Over more than twenty years in St Andrews Newby Curle had done much to build up teaching and research in Applied Mathematics. His wisdom and good humour will be much missed. Friends in St Andrews and elsewhere have contributed generously to a fund in his memory and it is hoped to use the income to support a Memorial Lecture to undergraduates.\nFor details of the Newby Curle Memorial lectures, see\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}