{
  "nome_completo": "Nicholas Saunderson",
  "nome_curto": "Nicholas Saunderson",
  "ano_nascimento": "1682",
  "ano_morte": "1739",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Saunderson/",
  "lugar_nascimento": "Thurlstone, Yorkshire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Nicholas Saunderson\n's father was an exciseman, meaning that he was a government officer who collected taxes imposed on goods. Nicholas, his parents' eldest son, was born in the small village of Thurlston\n(\ntoday written Thurlstone\n)\nabout\n11\nkm west of Barnsley and about\n20\nkm north west of Sheffield. Thurlston was very close to the small town of Penniston\n(\ntoday written Penistone\n)\n. Tragically when he was about one year old Nicholas contracted smallpox and, as a result, he became blind and, in some ways even worse, he not only lost his sight but also his eyes.\nEducation for a blind boy at this time was extremely difficult and required much attention. To learn from books was only possible for Nicholas if people were available to read to him. Despite this, he acquired a remarkably good education. He attended the free school in the nearby small town of Penniston where he learnt Latin, Greek, French, and mathematics. He was able to do this because of his remarkable intellectual powers, helped greatly by his father and a wide circle of friends who read to him. Not only did he quickly master\nEuclid\n's\nElements\n, which he read in the original Greek, but he also became an accomplished musician.\nBaker\nwrites in\n[\n1\n]\n:-\nSaunderson had a good ear for music, and could readily distinguish to a fifth part of a note; he was a good performer with a flute.\nHad Saunderson not met the mathematician William West when he was\n18\nyears old he might not have been able to study mathematics at the highest level. Because of his blindness, attending university to take a degree was not a realistic option, so Saunderson continued to study higher mathematics at home guided by West. Of course, he still required friends to read the advanced mathematics texts to him but, with West's help, he made rapid progress in the study of algebra and geometry.\nIn\n1707\nhis knowledge of mathematics was so great that a number of his friends encouraged him to go to Cambridge. A friend, Joshua Dunn, who lived in Christ's College, brought him to the College to share his rooms. However Saunderson did not have the money to be formally admitted to the College or the University. The Lucasian professor of mathematics at Cambridge at that time was William\nWhiston\nwho had been appointed to succeed\nNewton\nin\n1703\n. Saunderson told him that he was hoping to become a teacher of mathematics.\nWhiston\nwas very impressed by his abilities and Saunderson was soon lecturing to large classes of students. The topics that he taught included Newtonian philosophy, hydrostatics, mechanics, optics, sound, and astronomy. Students flocked to hear him being greatly impressed by his great teaching skills. Tattersall writes\n[\n5\n]\n:-\nHe enjoyed a reputation as an outstanding teacher, noted for both his popular lectures on natural science and his expertise in tutoring mathematics. ... It was said at Cambridge that he was a teacher who had not the use of his eyes but taught others to use theirs.\nRoger Cotes\n, who was already working at Cambridge when Saunderson began teaching there, became the Plumian Professor of Astronomy and Experimental Philosophy in\n1708\nand, in the following year, he began editing a second edition of\nNewton\n's\nPrincipia\n. Saunderson soon became friends with\nCotes\nfor they shared a common interest in the\nPrincipia\n. Saunderson was studying the work with the aim of trying to make it more accessible to his students.\nWhiston\nalso was interested in making the\nPrincipia\nmore accessible and he had himself published a student edition in\n1701\n. As well as getting expert advice from\nWhiston\nand\nCotes\n, Saunderson met\nNewton\nand was able to learn directly from him about certain difficult points in the text of the\nPrincipia\n.\nWhiston\nwas a deeply religious man and had produced many theories attempting to integrate scientific theories into the Christian religion. He came to believe that the doctrine of the Trinity was incorrect and this led to him being removed from the Lucasian chair on\n30\nOctober\n1710\n. Although Saunderson was an obvious choice to succeed him, he had no degree having never attended university. Heads of the Cambridge Colleges petitioned Queen Anne to award him the degree of Master of Arts, which she duly did on\n19\nNovember\n1711\n. On the following day Saunderson was appointed to succeed\nWhiston\nbecoming the fourth Lucasian professor of mathematics. It is recorded that there was some opposition to the appointment. On\n21\nJanuary\n1712\n, as was the custom, he gave his inaugural lecture\n[\n4\n]\n:-\n... in very elegant Latin and a style truly Ciceronian.\nOf his appointment\nHalley\nwrote:-\nWhiston was dismissed for having too much religion, and Saunderson preferred for having none.\nHalley\n, of course, was a friend of\nNewton\n, as was\nde Moivre\n,\nKeill\n,\nMachin\nand\nJones\n. These were all mathematicians with whom Saunderson formed strong friendships, and he corresponded with some on mathematical topics. He lived, as he had done from first arriving in Cambridge, in Christ's College. In\n1723\nhe left the College and lived in a house in Cambridge. Soon after this he married a daughter of William Dickons who was rector of Boxworth, a small village\n12\nkm north of Cambridge. Saunderson and his wife had a son John and a daughter Anne.\nOne might reasonably ask how Saunderson was able to carry out difficult mathematical calculations without being able to see. These calculations not only involved difficult mathematical expressions but also dealt with heavy arithmetical calculations. Having lost one of his senses, Saunderson had to rely on his other senses and he had very acute hearing and touch. His hearing allowed him to\n[\n1\n]\n:-\n... judge the size of a room and his distance from the walls, and\n[\nhe\n]\nrecognised places by their sounds.\nAn example of his sense of touch is given in the description of his life in\n[\n4\n]\nwhere it is recorded that he:-\n... distinguished in a set of Roman medals the genuine from the false, though they had ... deceived a connoisseur who had judged by eye.\nHe made use of his sense of touch when he invented a calculator to help him in his work. It consisted of a board with holes into which pegs could be placed. Each number from\n0\nto\n9\nwas represented by the position of a large and small peg in a square array, and numbers with\n2\n,\n3\nor larger numbers of digits were represented by placing\n2\n,\n3\nor a larger number of squares in a horizontal row. Placing one number\n(\nrow of squares\n)\nabove another allowed him to carry out arithmetical operations.\nMuch of what Saunderson studied was geometry. We have already indicated that one of his most successful lecture courses was on optics, which is basically a study of geometry. Geometry requires geometrical figures to be considered and one might again reasonably ask how Saunderson coped with this problem. Again he used a mechanical device similar to his counting board. It was also a board with holes and pegs, but this time he used string which he put round the pegs to create geometrical shapes which he could study using his sharp sense of touch. Other arrangements allowed him to consider\n3\n-dimensional geometry.\nAlthough he published no original mathematics, Saunderson's reputation as a teacher continued to grow. His teaching load was extremely high, usually teaching for seven or eight hours a day. In\n1728\nKing George II made a visit to Cambridge where he met Saunderson and conferred the degree of LLD on him. In\n1733\nSaunderson became ill and his friends realised that the world would lose a great treasure if Saunderson died before writing up his teachings. They therefore put pressure on him to write up his lecture in the form of a book. As soon as his health had recovered, he began to put in long hours working on the\nElements of Algebra\n. In\n1739\n, with his book close to completion, Saunderson became ill with scurvy. He died before the two volume treatise could be published but in the year following his death the\nElements of Algebra\nwas published in Cambridge by his widow, his son, and his daughter. He was buried in the chancel of the church at Boxworth.\nBaker says of the\nElements of Algebra\n[\n1\n]\n:-\nThe treatise is a model of careful exposition, and reminds one of the 'Algebra' which\nEuler\ndictated after he had been overtaken by blindness.\nLet us look briefly at the contents of the book. As we have already mentioned it consists of two volumes, and these are divided into an introduction, ten chapters, and various appendices. The introduction gives the reader the necessary arithmetical skills to begin the study of algebra, teaching the reader to carry out the standard arithmetical operations, take roots of numbers, calculate with fractions and become skilled in problems of proportion. The chapters on algebra introduce the idea of an equation and how real life problems can be reduced to equations. The reader is shown how to solve quadratic equations, there other topics such as magic squares are studied.\nBy the time Chapter\n6\nis reached Saunderson is presenting problems in the style of\nDiophantus\nmixing geometric and algebraic ideas. For example consider his theorem:-\nIn every right-triangle, if the double product of the legs be either added or subtracted from the square of the hypotenuse, both the sum and the remainder will be square numbers.\nAn application of\nPythagoras\n's Theorem reduces this to saying that\n(\na\n2\n+\nb\n2\n)\n+\n2\na\nb\n(a^{2} + b^{2}) + 2ab\n(\na\n2\n+\nb\n2\n)\n+\n2\na\nb\nand\n(\na\n2\n+\nb\n2\n)\n−\n2\na\nb\n(a^{2} + b^{2}) - 2ab\n(\na\n2\n+\nb\n2\n)\n−\n2\na\nb\nare perfect squares. Other problems in the style of\nDiophantus\nask the reader to find three squares whose sum is a perfect square. For example\n2\n2\n+\n3\n2\n+\n6\n2\n=\n7\n2\n2^{2} + 3^{2} + 6^{2} = 7^{2}\n2\n2\n+\n3\n2\n+\n6\n2\n=\n7\n2\n.\nSaunderson then presents applications of algebra to geometry, in particular studying ratio and proportion from Book\n5\nof\nEuclid\n's\nElements\n. He goes on to consider solid geometry giving results on prisms, cylinders, and spheres. In Book\n9\nSaunderson presents the binomial theorem and the theory of logarithms. The final book presents the solution of cubic and quartic equations.\nAlthough Saunderson never wrote up any of his other courses for publication, he did leave a large amount of material on his teaching of the differential and integral calculus. This was edited by his son John and published as\nThe Method of fluxions\nat Cambridge in\n1756\n. Although the main text is in English, there are included at the end Latin explanations of the main results from\nNewton\n's\nPrincipia\n. Its full title is\nThe Method of fluxions applied to a Select Number of Useful Problems, together with the Demonstration of Mr Cotes's forms of Fluents in the second part of his Logometria, the Analysis of the Problems in his Scholium Generale, and an Explanation of the Principal Propositions of Sir Isaac Newton's Philosophy\n.\nOne further work appeared in print in\n1761\nentitled\nSelect Parts of Professor Saunderson's Elements of Algebra for Students at the Universities\n. There is no indication who edited this text.\nAmong the honours which Saunderson received, in addition to the honorary LLD referred to above, was his election as a Fellow of the\nRoyal Society\non\n21\nMay\n1719\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}