{
  "nome_completo": "Nicholas of Cusa",
  "nome_curto": "Nicholas Kryffs",
  "ano_nascimento": "1401",
  "ano_morte": "1464",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cusa/",
  "lugar_nascimento": "Kues, Trier (now Germany)",
  "lugar_morte": "Todi, Papal States (now Italy)",
  "biografia": "Nicholas Kryffs\nor\nKrebs\nwas the son of Johan Krebs\n(\nor Cryfts\n)\n, a wealthy shipper on the river Moselle, and Catharina Roemers. Nicholas was one of his parents' four children. He was born in Kues, now Bernkastel-Kues, about\n30\nkm from Trier, an old town in the Palatinate, founded by the Romans. His name often appears as\nNikolaus Cusanus\n, following the usual practice in the Latin speaking church environment, from the Latin name of the town. He left his home and was sent to Deventer, in the Netherlands, by Count Theodoric von Manderscheid. It is claimed that the reason he left home was to escape from ill-treatment by his father\n(\nthe story being that Nicholas was only interested in books and annoyed his father by being unable to handle an oar\n)\n. Although this appears in ancient biographies of Nicholas, there is little evidence to support it. In Deventer, his early education took place at the Brothers of the Common Life. Certainly the Brothers of the Common Life, a Roman Catholic religious community founded by Gerard Groote in the\n14\nth\ncentury, would have strongly influenced the young Nicholas with their mixture of mysticism and reason.\nThe first certain information about Nicholas's education is in\n1416\nwhen he matriculated at the University of Heidelberg. The record, as one would expect, lists him as from the diocese of Trier. In Heidelberg Nicholas studied liberal arts, particularly philosophy, for a year before going to the University of Padua in\n1417\n. At Padua he studied canon law under Giuliano Cesarini, who was only three years older than Nicholas, having just completed his own doctorate in canon law at Padua. At Padua he became friends with fellow student Paolo dal Pozzo Toscanelli, who was studying mathematics and medicine. Toscanelli became an important mathematician and astronomer, remaining friends with Nicholas throughout his life. It was a friendship between two highly intelligent men who strongly influenced each other. It was in Padua that Nicholas learnt about the latest developments in mathematics and astronomy and, twenty years later, Nicholas dedicated two of his mathematical works to Toscanelli. Giovanni Andrea Bussi\n(1417\n-\n1475)\n, humanist and Bishop of Aleria from\n1469\n, later became a friend of Nicholas and wrote about Nicholas's student days at Padua:-\nNicholas studied Latin, Greek, Hebrew, and, in later years, Arabic, though he was not a lover of rhetoric and poetry.\nNicholas graduated with a doctorate in canon law from Padua in\n1423\nand, after spending some time in Rome, he matriculated at the University of Cologne in the spring of\n1425\nto study divinity. He undertook these studies with the support of the Archbishop of Trier. Again friends would influence Nicholas strongly and, at Cologne, he became friends with Heimericus de Campo who introduced him to the ideas of Pseudo-Dionysius, Albertus Magnus and Ramon Llull.  Cologne was part of the diocese of Trier and Otto of Ziegenhain, archbishop of Trier from\n1418\n, supported Nicholas by providing him with an income from benefices at Coblenz, Oberwesel, Münstermaifeld, Dypurgh, St Wendel, and Liège. By September\n1427\nNicholas was Otto of Ziegenhain's secretary but Otto, a strong advocate for Church reform, died in\n1430\nand there was a serious dispute over whom should replace him. Following Otto's death, Nicholas became secretary to Ulrich of Manderscheid, one of the electors at the assembly in Cologne who was favoured by the electors to replace Otto. However, the pope wanted Raban von Helmsted to succeed Otto. In\n1431\nthe Council of Basel had been set up to try to reform the Church and end the situation of rival popes. Cesarini, Nicholas's former teacher, became president of the Council in September but the pope tried to dissolve the three months later. The Council refused to follow the pope's order and, in\n1432\n, the dispute between Ulrich and Raban was referred to the Council. Nicholas put the case for Ulrich to the Council, arguing against the pope's right make the appointment of his candidate. Despite the Council being in dispute with the pope, Nicholas lost his case but he became an important member of the Council. He wrote\nDe concordantia catholica\nⓉ\n(\nThe authority of the Catholic Church\n)\nin\n1433\n, arguing that the Council's authority took precedence over that of the pope. In this work he wrote:-\nSince by nature all men are free, all government - whether based on written law or on law embodied in a ruler through whose government the subjects are restrained from evil deeds and their liberty regulated, for a good end by fear of punishment - arises solely from agreement and consent of the subjects.\nHe advised the Council on calendar reform in\n1436\nand by December\n1436\nhad changed sides in the argument as to whether the Council's views took precedence over those of the pope\n(\nat this time Eugenius IV\n)\n, taking the pope's side. This put Nicholas in a minority on the Council but, with the pope's agreement, he was part of a three-man delegation sent to Constantinople in\n1437\n. The aim of the delegation was to set up a process leading to the eastern and western Churches reuniting and Nicholas achieved much during two months in Constantinople. His diplomacy led to temporary success, but the moves towards reunification, begun in July\n1439\n, soon fell apart. Also while in Constantinople, he discovered some important Greek manuscripts.\nIn\n1428\nthe University of Louvain had offered Nicholas its chair of canon law; he had declined. Again in\n1435\nthey made the same offer which again he declined. Nicholas took part in several missions to Germany as papal envoy between\n1438\nand\n1448\n, in particular representing the pope at the Diets of Mainz\n(1441)\n, Frankfort\n(1442)\n, Nuremberg\n(1444)\n, and Frankfort\n(1446)\n. He was ordained sometime between\n1430\nand\n1440\nand was named cardinal by pope Eugenius IV in\n1446\nin recognition of his work as a papal envoy. However, Eugenius IV died before the appointment became official so Nicholas had to wait till December\n1448\nwhen pope Nicholas V made him a cardinal. Then he became the bishop of Brixon\n(\nnow Bressanone\n)\nin\n1450\n.\n(\nNote that 'cardinal' was a title, while 'bishop' was an office.\n)\nBecause of opposition by the Duke of Austria, he could not take up his duties in Brixon for two years so the pope sent him as papal legate to North Germany and the Netherlands. He was given some seriously difficult tasks, namely\n[\n15\n]\n:-\n... to preach the Jubilee indulgence and to promote the crusade against the Turks; to visit, reform, and correct parishes, monasteries, hospitals; to endeavour to reunite the Hussites with the Church; to end the dissensions between the Duke of Cleve and the Archbishop of Cologne; and to treat with the Duke of Burgundy with a view to peace between England and France.\nJasper Hopkins writes of Nicholas's work in Brixon which he took up in\n1452\n[\n17\n]\n:-\nHis attempts to reform the diocese and to free it from domination by Sigismund, duke of Austria and count of Tirol, led to threats and clashes that twice caused him to seek consolation and refuge in Rome.\nNicholas's first published work was\nDe docta ignorantia\nⓉ\n(\nOn the doctrine of ignorance\n)\nwhich was published in\n1440\n, a treatise whose ideas came to him on the return voyage from the\n1437\nmission to Constantinople. In this treatise, perhaps his best known philosophical work, he argued the incomplete nature of man's knowledge of the universe. He claimed that the search for truth was equal to the task of squaring the circle. Dermot Moran writes\n[\n22\n]\n:-\nHis aim is always to show the limitations on merely human knowledge, and to instruct us in our ignorance. This is the 'instruction of ignorance'\n(\ndoctrina ignorantiae\n)\n. Cusanus is stressing the finitude of the human mind and the ultimate failure of the promethean project of absolute scientific knowledge. But in all his formulations he remains remarkably faithful to the Platonic tradition ...\nAmong his writings on mathematics we mention:\nDe geometricis transmutationibus\nⓉ\n(\nOn geometric transformations\n)\n(1445)\n,\nDe arithmeticis complementis\nⓉ\n(\nOn arithmetical complements\n)\n(1445)\n,\nDe circuli quadratura\nⓉ\n(\nThe quadrature of the circle\n)\n(1450)\n,\nQuadratura circuli\nⓉ\n(\nThe quadrature of the circle\n)\n(1450)\n,\nDe mathematicis complementis\nⓉ\n(\nOn mathematical complements\n)\n(1453)\nDialogus de circuli quadratura\nⓉ\n(\nDialogue on the quadrature of the circle\n)\n(1457)\n,\nDe caesarea circuli quadratura\nⓉ\n(\nThe quadrature of the Caesarean circle\n)\n(1457)\n,\nDe mathematica perfectione\nⓉ\n(\nOn mathematical perfection\n)\n(1458)\n,\nAurea propositio in mathematicis\nⓉ\n(\nThe golden proposition in mathematics\n)\n(1459)\n. He also wrote\nDeclaratio rectilineationis curvae\nⓉ\n(\nDeclaration on  a rectilinear curve\n)\nand\nDe una recti curvique mensura\nⓉ\n(\nOn a straight or curved measure\n)\nbut their dates are unknown. He was interested in geometry and logic and had clearly made a study of at least parts of\nEuclid\n's\nElements\nand works of\nThomas Bradwardine\nand\nCampanus of Novara\n. He contributed to the study of infinity, studying the infinitely large and the infinitely small. He looked at the circle as the limit of regular polygons and used it in his religious teaching to show how one can approach truth but never reach it completely. He wrote:-\nIt is self-evident that there is no comparative relation of the infinite to the finite. ... Therefore, it is not the case that by means of likeness a finite intellect can precisely attain the truth about things. ... For truth is not something more or something less but is something indivisible. Whatever is not truth cannot measure truth precisely. ... For the intellect is to truth as an inscribed polygon is to the inscribing circle.\nIn\n1444\nhe became interested in astronomy and purchased sixteen books on astronomy, a wooden celestial globe, a copper celestial globe and various astronomical instruments including an\nastrolabe\n.\n(\nHis astronomical instruments are today preserved in the library at Kues.\n)\nHis interest in astronomy certainly led him to certain theories which were true and others which may still prove to be true. For example he claimed that the Earth moved round the Sun. He also claimed that the stars were other suns and that space was infinite. He also believed that the stars had other worlds orbiting them which were inhabited. He got so much right that perhaps this will also be found to be true one day! Volker Bialas writes\n[\n12\n]\n:-\nIn his philosophical and scientific writings, mainly devoted to metaphysical questions, Nicolas of Cues ... transcended the bounds between the finite and the infinite. Nowhere more than in his idea of the unfolding universe has this crossing of the bounds become more obvious. Cusanus, although interested in the astronomical problems of his time, constructed a - so to speak - speculative cosmology based on three principles: the coincidence of opposites, the principle of the primary basis of the world and the principle of Trinity of all the being. By postulating an unlimited universe Cusanus asked new questions which influenced cosmological considerations in the following centuries, such as for example those of\nGiordano Bruno\nand\nJohannes Kepler\n.\nGiordano Bruno\nis said to have written:-\nIf\n[\nNicholas of Cusa\n]\nhad not been hindered by his priest's vestment, he would have even been greater than\nPythagoras\n!\nNicholas published improvements to the Alfonsine Tables which gave a practical method to find the position of the Sun, Moon and planets using\nPtolemy\n's model. These tables had originally been compiled in\n1272\nwith the support of King Alfonso X of Castile. Like many learned men of his time, Nicholas also wrote on calendar reform but, despite his sensible suggestions about leap years, the Church did not implement his ideas.\nIn his philosophical works Nicholas was particularly interested in the 'Theory of Knowledge', writing on this topic in works such as\nDe conjecturis\n(1440\n-\n44)\nand\nCompendium\n(1464)\n. Knowledge, Nicholas believed, is derived through the senses but understanding is an abstraction of diverse sensory images. All human knowledge must be mere conjecture, and wisdom is attained only through understanding the extent of one's ignorance. In\nCompendium\n, Nicholas writes:-\nThe perfect animate being is one possessing sense and intellect. This being should be thought of as a cosmographer who has a city with five gates, which are the five senses. Through these gates messengers enter from all over the world, announcing the disposition of the entire world ... The cosmographer should sit and note down all things that are related to him, in order to have a description of the entire perceptible world represented in his own city. ... The cosmographer therefore tries as hard as he can to keep all the gates open, to listen constantly for the reports of new messengers, and to bring his description ever closer to the truth. Finally, when he has made a complete representation of the perceptible world in his own city, he compiles it into a well-ordered and proportionately measured map lest it be lost.\nPerhaps the best summary of his religious views is given in his book\nDe visione dei\n(1453)\n:-\nNow I behold as in a mirror, in an icon, in a riddle, life eternal, for that is naught other than that blessed regard wherewith Thou never ceasest most lovingly to behold me, yea, even the secret places of my soul. With Thee, to behold is to give life; 'tis unceasingly to impart sweetest love of Thee; 'tis to inflame me to love of Thee by love's imparting, and to feed me by inflaming, and by feeding to kindle my yearning, and by kindling to make me drink of gladness, and by drinking to infuse in me a fountain of life, and by infusing to make it increase and endure. 'Tis to cause me to share Thine immortality. . . . For it is the absolute maximum of every rational desire, than which a greater cannot be.\nNicholas was imprisoned by Sigmund in\n1460\nand suffered ill-treatment from which his health never completely recovered. Pope Pius II sent him to Livorno in\n1464\nto encourage the Crusaders to prepare more rapidly for action against the Turks. However, Nicholas's poor health deteriorated on the journey and he died in Todi in the presence of his friend Paolo dal Pozzo Toscanelli.\nLet us end with the summary given in the publisher's description of\n[\n5\n]\n:-\nTheology, mathematics, philosophy, science, art, medicine - no avenue of inquiry escaped the attention of the humanist Nicholas of Cusa ... He himself, however, defined the scholar as one who 'is aware of his own ignorance'\n(\nDe docta ignorantia\n)\n... What aspects of Nicholas of Cusa's thought are still pertinent today? His acute sense of the limits of human knowledge, which makes him ... a precursor of the modern approach to the problem of finiteness and its relation with the universal. His predilection for mathematics: instead of the principle of contradiction, which was the basis of Aristotelian philosophy, Nicholas of Cusa in fact preferred the Platonic articulation of dialectics and mathematics, by which one can imagine the infinity of God as a 'coincidence of opposites', another key notion in his philosophy. However, mathematics allows us only to approach God and that which reflects Him, not to fully apprehend Him. But this negative theology does not reduce to a negation of theology; rather, it envisions the absolute otherness of God in terms of superabundance in the existence given to the finite that is encompassed by God.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}