{
  "nome_completo": "Nicolaas Hendrik Kuiper",
  "nome_curto": "Nicolaas Kuiper",
  "ano_nascimento": "1920",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kuiper/",
  "lugar_nascimento": "Rotterdam, The Netherlands",
  "lugar_morte": "Heteren, The Netherlands",
  "biografia": "Nicolaas Kuiper\nwas known as Nico to his friends and colleagues. He studied mathematics at Leiden University from\n1937\nuntil\n1941\n. He published his first paper,\nLines in\nR\n4\n\\mathbb{R}^{4}\nR\n4\n,  in\n1941\n. This major\n20\npage paper was reviewed by\nDonald Coxeter\nwho wrote:-\nPart A deals with the quintic sixfold in projective\n9\n-space whose points represent the\n∞\n6\n\\infty ^{6}\n∞\n6\nlines in projective\n4\n-space\n(\njust as the points on a quadric fourfold in\n5\n-space represent the\n∞\n4\n\\infty ^{4}\n∞\n4\nlines in\n3\n-space\n)\n. The possible sections by a line, plane,\n3\n-space or\n4\n-space are described exhaustively. Part B applies these results to the theory of lines in\n4\n-space. ...\nLeiden university was completely closed by the Germans from\n1942\nto\n1945\nand from\n1942\nto\n1947\n, Kuiper worked as a secondary school teacher of mathematics, while at the same time  working for a doctorate with Willem van der Woude as his advisor and was awarded the degree in\n1946\nfor his thesis\nOnderzoekingen over lijnenmeetkunde\nⓉ\n(\nStudies on line geometry\n)\nwhich discussed a topic in classical\ndifferential geometry\n. V Hlavaty, reviewing the published version of the thesis writes:-\nUsing the\nStudy\nmethod of dual vectors, the author develops the line geometry in a Euclidean three-space\n(\nwithout using point coordinates\n)\n. This enables him to state a \"translation rule,\" which converts theorems in spherical or two-dimensional elliptic geometry to line geometry theorems in Euclidean three-dimensional space. The results\n(\nknown\n)\nabout infinitesimal properties of surfaces are used in the generalization of\nBertrand\ncurves. The author finds rectilinear surfaces with identical principal normals\n(\nthe second axis of the canonical trihedron\n)\n. Homological lines on such surfaces have an arbitrary constant dual angle. Finally, the author uses his method in order to build up the background for investigations by dual vectors of two- and three-dimensional line spaces\n(\ntheory of line congruences, line complexes and line congruences in line complexes\n)\n.\nAfter the award of his doctorate Kuiper spent some time in the United States.  From August\n1947\nhe spent two years in the Institute for Advanced Study at Princeton, the first year as an assistant to\nVeblen\n, the second year as a member of the IAS, where he met\nShiing-shen Chern\n. He also went to the University of Michigan at Ann Arbor\n[\n2\n]\n:-\nIt is easy to see that even at this early stage in his career, Kuiper had a characteristic way of working - he would pay attention to a result or an approach of another mathematician and find that he was rephrasing the concepts in his mind, asking new questions, and more often than not coming up with a fresh insight. It is not surprising that he became a coauthor of a great many papers over the years.\nIn\n1954\n, he went for a second time to Ann Arbor for six months where he met\nRaoul Bott\nand his student\nStephen Smale\n.\nFollowing the publication of his thesis, Kuiper published papers such as\nOn differentiable line systems of one dual variable\n(1948)\n,\nOn conformally-flat spaces in the large\n(1949)\n,\nA closure theorem\n(1949)\n,\nOn compact conformally Euclidean spaces of dimension\n>\n2\n(1950)\n,\nOn linear families of involutions\n(1950)\n,\nCompact spaces with a local structure determined by the group of similarity transformations in\nE\nn\n\\mathbb{E}^{n}\nE\nn\n(1950)\n,\nEinstein spaces and connections\n(1950)\n, and\nDistribution modulo\n1\nof some continuous functions\n(1950)\n.\nReturning to the Netherlands from the United States, Kuiper taught mathematics and statistics at the Landbouwhogeschool\n(\nAgricultural University\n)\nin Wageningen, contributing a number of geometric insights to the theory of design of experiments. For example in his paper\nAnalysis of variance\n(1952)\nhe shows how terms used in factorial design can be conceptionally simplified in the language of linear vector spaces. In\n1959\nhe published the textbook\nAnalytische meetkunde\n(\nverklaard met lineaire algebra\n)\n[\nAnalytic geometry\n(\ninterpreted by linear algebra\n)]\n. S R Struik writes:-\nThis is no ordinary textbook. Right from the beginning it defines vectors and\nn\nn\nn\n-vector space in modern symbolism, gives in concise form the axioms to be utilized throughout, treats the different topics\n(\ne.g., affine plane, classification of endomorphisms, quadratic and symmetric bilinear functions, some applications to statistics, motions and affine transformations, and some topology\n)\nby up-to-date methods and thus creates a model of a book for the budding research-scientist, ingenious, clear, consistent in structure. Definitions are chosen so as to be fit for generalizations.... Significant for our times is its planned use for the ambitious Dutch high school teacher, acquiring up-to-date knowledge in this field, to be tested in additional examinations.\nAn English translation\nLinear algebra and geometry\nwas published in\n1962\n:-\nIt will particularly appeal to those instructors who want to give their students the meat of the subject rather than feed them with diluted juice, and to those who like to have more of truly geometric content in such a course, which other text books now available in this country often lack.\nIn\n1962\nhe was appointed as Professor of Pure Mathematics at the University of Amsterdam. He devoted himself to\n[\n2\n]\n:-\n... differential geometry,\ndifferential topology\n, and\nalgebraic topology\n, and nurturing a number of doctoral students and post-doctoral visitors.\nIn\n1971\nKuiper was appointed Director of the Institut des Hautes Études Scientifiques at Bures-sur-Yvette near Paris. As Director of IHES, he worked hard to obtain outside support for the Institute, notably from European and American sources. Allyn Jackson writes\n[\n1\n]\n:-\nIt was Kuiper who persuaded scientific societies from other countries to contribute funds to the IHES, and today such contributions remain a small but important part of the institute's budget. ... Kuiper excelled on the scientific side. According to David Ruelle, who has been a permanent professor at the IHES since\n1964\n, Kuiper understood that in-depth discussion of research matters was the best way to make decisions about whom to invite. These discussions, says Ruelle, \"were more interesting and effective than a case-by-case discussion of individual applications, with the usual guesswork of how to read between the lines of letters of recommendation.\" Still, there was dissatisfaction over Kuiper's lack of attention to physics and his inability to penetrate the workings of the French bureaucracy.\nKuiper retired as director of the Institut des Hautes Études Scientifiques in\n1985\n. He moved to the Netherlands in\n1991\n, but he remained a long time visitor to the IHES until\n1994\n.\nThe mathematics for which he is best known is tight and taut submanifolds. Banchoff gives the following appreciation of his work in that area\n[\n2\n]\n:-\nTight and taut immersions are a living and growing part of contemporary mathematics largely due to the legacy of Nicolaas Kuiper. He made central contributions to many different areas of mathematics during his long and productive career, but it is in tight and taut immersions that his geometric style showed forth in a special way. In that subject, his personal enthusiasm and extraordinary geometric insight combined to bring forth examples and theorems of great conceptual and visual appeal. He delighted in discovering new phenomena, and in presenting his examples using sketches and in cardboard or wire-frame models. He found surprising connections among apparently unrelated areas of mathematics, creating entirely new methods for handling a range of geometric structures: analytic, differentiable, once-differentiable, combinatorial, and top logical. He was the first to appreciate the essentially geometric character of tightness, exploiting the relationship between the minimal total curvature condition for smooth submanifolds and critical point theory so that the notion could be extended to non-smooth objects. He guided generations of mathematicians who have followed his lead.\nIn\n[\n3\n]\nThomas E Cecil and\nShiing-shen Chern\nwrite:-\nKuiper made major contributions to the field of tight and taut submanifolds over an extended period of time. In particular, his technique of the analysis of topsets became an essential tool in almost all work in the area of tight immersions and maps.\nThe book\nTight and taut submanifolds\ncontains a paper based on the Roever Lectures in Geometry Kuiper gave at Washington University in St Louis, USA, from\n20\nJanuary to\n24\nJanuary\n1986\n. These lectures gave a survey which provides\n[\n3\n]\n:-\n... a masterly introduction to the subject and a good exposition of some more advanced topics, concentrating on topological aspects, in particular the analysis of topsets. It also contains a detailed proof of Kuiper's remarkable result that a tight two-dimensional surface substantially immersed in\nR\n5\n\\mathbb{R}^{5}\nR\n5\nmust be a\nVeronese\nsurface.\nJacques Tits\npaid the following tribute to Kuiper:-\nNico made central contributions to many different areas of mathematics during his long and productive career, but it is in tight and taut immersions that his geometric style showed forth in a special way. In that subject, his personal enthusiasm and extraordinary geometric insight combined to bring forth examples and theorems of great conceptual and visual appeal.\nFinally let us note that the IHES paid tribute to Kuiper by naming their new library the \"Nicolaas Kuiper Library\". He had bequeathed most of his books and journals to the library. The report of the official naming ceremony reads:-\nOn May\n23\n,\n2003\n, His Excellency Christiaan Kröner, Ambassador to Netherlands in France, officially named the new Library in honour of Nicolaas Kuiper who succeeded Léon Motchane as Director of IHES. During his mandate, Nicolaas Kuiper succeeded in getting European support and helped greatly to build the international reputation of IHES.\nAmong the honours given to Kuiper were membership of the\nRoyal Netherlands Academy of Sciences\nin\n1965\n, membership of the\nBrazilian Academy of Sciences\nin\n1978\n,\nChevalier de la Légion d'honneur\nin\n1981\n, Honorary Doctorate from Brown University in\n1984\n, Knight of the Order of the Dutch Lion in\n1985\n, Humboldt Prize for scientific cooperation between Germany and France in\n1986\nand corresponding membership of the\nGöttingen Academy\nin\n1990\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}