{
  "nome_completo": "Nicolae Abramescu",
  "nome_curto": "Nicolae Abramescu",
  "ano_nascimento": "1884",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abramescu/",
  "lugar_nascimento": "Târgoviște, Dambovita County, Romania",
  "lugar_morte": "Cluj, Romania",
  "biografia": "Nicolae Abramescu\n, the son of a priest, was born at Târgoviște in March\n1884\n. Târgoviște, the ancient capital of Wallachia, is on the Ialomita river about\n70\nkm north east of Bucharest. Nicolae attended primary and secondary school in his home town of Târgoviște before going to the high school in Ploiești. He graduated from the high school with his licence in mathematics in\n1901\n. Already Abramescu had become fascinated by mathematics and, while a high school student, he had avidly read the\nGazeta Matematica\n(\nThe Mathematical Gazette\n)\nand began to make contributions to this publication.\nAfter graduating from the Ploiești High School, Abramescu entered the Mathematics programme in the Faculty of Science of the University of Bucharest. There he was a fellow student of Traian Lalescu\n(1882\n-\n1929)\nwho also went on to become an important mathematician working mainly on\nintegral equations\n. Abramescu graduated from the University of Bucharest in\n1904\nand, later that year, he was appointed as a substitute teacher in the secondary school in Ploiești. While he was teaching mathematics in this school he wrote his first book,\nLectures in Analytical Geometry for Eighth Grade Students\nwhich was published a few years later in\n1907\n. The book ran to several editions. One of the students he taught while at this school was\nAurel Angelescu\nwho was in the eighth grade when Abramescu gave the course that became his book. Abramescu went from Ploiești to Botoșani where again he was a substitute teacher. In Botoșani, at the school August Treboniu Laurian, he gave an algebra course which he published as a book for eighth grade students. First published in\n1907\n, it ran to eight editions between\n1907\nand\n1943\n. Having passed the necessary examinations, these two appointments completed his training to become a secondary school teacher. He left Botoșani when he was named as professor of mathematics at the school V Alecsandri in Galați taking up his appointment on\n1\nOctober\n1907\n. He continued to teach there until September\n1919\n. While in Galați he wrote the book\nFormulas for the geometry of the triangle\nand produced two manuals,\nMechanics for seventh grade students\nand\nTrigonometry for sixth grade students\n. These school textbooks were renowned for the clarity of their style and the depth of ideas that they presented. They were used in secondary schools in Romania for around forty years.\nIn November\n1919\nAbramescu was appointed as an Associate Professor at the University of Cluj, following the recommendation of\nGheorghe Țițeica\n. This appointment means that he was a founder member of the Faculty of Science of the University of Cluj. Here, together with\nAurel Angelescu\nand Gheorghe Bratu, he formed a strong and valuable kernel around\nDimitrie Pompeiu\n, the Director of the Mathematical Seminar. He worked on his doctoral dissertation and, in July\n1921\n, he was awarded his Ph.D. in Mathematics from the University of Bucharest with a dissertation on the\nTheory of the systematization of the orthogonal polynomials\n. His thesis was not published. On\n15\nSeptember\n1921\nhe was appointed as a lecturer at the Polytechnic School of Bucharest. He held this position until early in the year\n1923\n.\nOn\n15\nFebruary\n1923\n, after an examination, he was appointed Professor of Analytical Geometry in Cluj. At the same time, he was given the position the substitute teacher of descriptive geometry at Cluj. On\n1\nOctober\n1926\n, Abramescu was appointed full professor of Descriptive and Infinitesimal Geometry at the University of Cluj, a position that he kept until the end of his career.\nGheorghe Țițeica\nsent him a letter a few days after his appointment to the chair at Cluj giving him some advice\n(\nsee for example\n[\n2\n]\n)\n:-\nI think that in Cluj you will find a serene academic atmosphere to continue your work. You owe it as a true soldier to hold up the flag. Keep in touch with other countries, I can say you should publish your work in foreign places as well. It is good that our country is known for science. It is the best, most serious and most reliable propaganda. However, you should publish only serious things.\nWorld War II caused major disruptions for those teaching at Cluj and in particular it caused huge problems for Abramescu. To understand the difficulties we need to look at the history of universities in Cluj.\nNow Cluj had, with the rest of Transylvania, been incorporated into Romania with the Treaty of Trianon in\n1919\n. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n. The Hungarian university in Cluj moved first to Budapest, then to Szeged. The university in Cluj was, during these years between the two World Wars, named King Ferdinand I University. In August\n1940\n, after the start of World War II, the north-west part of Romania\n(\nincluding Cluj\n)\nwas surrendered to Hungary in the Vienna Dictate. This was a decision taken in Vienna under severe pressure from the German Third Reich. The Hungarian university was moved back from Szeged to Cluj, and the Romanian university in Cluj moved to Alba-Iulia, Turda, Sibiu and Timișoara. In fact the Faculty of Sciences was moved to Timișoara, while the rest of the faculties were moved to Sibiu. All of them began operating in November\n1940\n. Abramescu was one of\n26\nprofessors who signed a petition protesting against this break-up of the University of Cluj. He spent the years\n1941\n-\n43\npartly in Cluj where he participated in the Mathematical Society, and partly in Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. Abramescu did much work in restoring the mathematics library and teaching equipment. Parts of the Hungarian university in Cluj moved back to Szeged, while that part which remained in Cluj was named the Bolyai University\n(\nafter the mathematician\nJános Bolyai\n)\n. It was given the building that had belonged to Queen Mary Grammar School for girls.\nAt the University of Cluj, Abramescu taught many different courses throughout his career. For example he taught courses on elementary geometry, analytic geometry, mechanics, higher algebra, descriptive geometry, pure infinitesimal geometry, pure higher geometry, non-Euclidean geometry, and vector geometry. We mentioned above some of the high school level texts that Abramescu wrote. He also wrote a number of undergraduate level texts which were very popular. Many of these were lithographed notes\n(\nin Romanian\n)\nof the courses he gave in Cluj such as\nAnalytical Geometry\n,\nPure Infinitesimal Geometry\n,\nNon-Euclidean Geometries\n, and\nDescriptive Geometry\n. In printed format he published\nLectures on Analytical Geometry\n, which was subtitled\nIntroduction to Elementary Studies in Analytic and Non-Euclidean Geometry and Elementary Notes on Vector Geometry\n(3\neditions,\n1927\n,\n1937\n,\n1944)\n, and\nLessons on Pure Infinitesimal Geometry with Applications to Descriptive Geometry\n(1\nedition,\n1930)\n. The\n1927\nedition of\nLectures on Analytical Geometry\nwas dedicated to\nGheorghe Țițeica\n. This edition had a Preface written by\nȚițeica\nwho heaps praise on his former student Abramescu:-\nI met him first as an enthusiastic high school student, as a correspondent to the Mathematical Gazette, then as a student and high school teacher. I have rarely seen an example of someone with more perseverance and unwavering love of science. Nicholas Abramescu is an example of someone with titanic and rare will power who deserves to be known, so that his example can be followed. Having been a high school teacher for a long time, he made the heroic decision to prepare his doctoral thesis and to write papers which have led to him being today a professor.\nIn the second edition, published in\n1937\n, Abramescu says that the work he has put into writing the book would be well rewarded if it helps students, fills them with enthusiasm and hope for the future. When the third edition appeared in\n1944\n,\nPetre Sergescu\nwrote in a review\n[\n7\n]\n:-\nIt is a rich and valuable source of information for anyone who wants to delve deeper into the study of geometry, and can bring the greatest benefits to students of the Faculties of Science and Polytechnics. We strongly recommend it.\nThe second of these books,\nLessons on Pure Infinitesimal Geometry\n, was dedicated to:-\nMaurice d'Ocagne\n, member of the Institute of France, professor at the École Polytechnique in Paris.\nGino Loria\nwrote in a review of this book:-\nWhat is special in this work is that Abramescu uses descriptive geometry methods in an analytical study of curves and surfaces in the neighbourhood of a point. In this way, he shows with elegance how easy it is to solve a pure infinitesimal geometry problem using methods of descriptive geometry.\nNicolae Abramescu put a lot of effort in organising the Cluj Scientific Society, and the First Congress of Romanian Mathematicians which was held in Cluj from\n9\n-\n12\nMay\n1929\n. He was president of the Second Congress of Romanian Mathematicians held in Turnu Severin\n(\nnow Drobeta-Turnu Severin\n)\nfrom\n5\n-\n9\nMay\n1932\n. He was on the organising committee of the Third Congress of Romanian Mathematicians held in Bucharest from\n29\nOctober to\n3\nNovember\n1945\n. He was also a founder member of the Cluj journal\nMathematica\nwhich began publishing in\n1929\n.\nAmong the honours given to Abramescu we mention his election to the\nRomanian Academy of Sciences\non\n5\nJune\n1943\n. He was also elected to the Cluj Scientific Society, the\nFrench Mathematical Society\n, the\nMathematical Circle of Palermo\n, and the\nGerman Mathematical Society\n.\nAbramescu died in February\n1947\nat Cluj.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}