{
  "nome_completo": "Nicolaas Govert de Bruijn",
  "nome_curto": "Nicolaas de Bruijn",
  "ano_nascimento": "1918",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Bruijn/",
  "lugar_nascimento": "The Hague, The Netherlands",
  "lugar_morte": "Nuenen, Netherlands",
  "biografia": "Nicolaas de Bruijn\nattended elementary school in The Hague from\n1924\nto\n1930\n. He then entered secondary school\n(\nhogere burgerschool\n)\nin The Hague where he studied for four years before leaving in\n1934\nat the age of sixteen having completed his studies. In\n1936\nhe entered Leiden University to study mathematics but the outbreak of World War II in\n1939\ncaused disruption to his university studies.\nDe Bruijn, although still registered as an undergraduate at Leiden, became a full-time Assistant in the Department of Mathematics of the Technological University of Delft in September\n1939\n. He continued to hold this position until June\n1944\n[\n1\n]\n:-\nThat period helped him get through a large part of the war without forced labour in Germany\n(\nDelft was in the hands of the Germans during the war\n)\n.\nIn addition to this full-time assistantship, de Bruijn continued his studies at Leiden until\n1941\n. He then studied for a doctorate at the Free University of Amsterdam with\nJurjen Koksma\nas his advisor. He undertook research on algebraic number theory and was awarded a doctorate on\n26\nMarch\n1943\nhaving submitted his thesis\nOver modulaire vormen van meer veranderlijken\nⓉ\n(\nModular forms in several variables\n)\n.\nH Rademacher\nwrites:-\nModular functions of several variables were first associated with algebraic fields by\nHilbert\nand by\nBlumenthal\n. The purpose of\n[\nde Bruijn's dissertation\n]\nis to extend\nBlumenthal\n's results in the direction which\nHecke\nand his associates have followed in the theory of modular functions of one variable.\nAlready before he had been awarded his doctorate, de Bruijn had begun publishing papers. For example he published\nOn Steiner-Schläfli's hypocycloid\n(1940)\nwhich took a geometrical approach to ideas published by van der Woude earlier that year. In\n1941\nhe published\nEin Satz über schlichte Funktionen\nⓉ\n(\nA theorem on simple functions\n)\nfollowed by\nCommon representative systems of two divisions of an aggregate into classes\n(1943)\nwhich generalised a theorem proved for finite sets by\nDenes König\nin\n1916\nand\nvan der Waerden\nin\n1927\n, then for infinite sets by\nKönig\nand Valko in\n1925\n. Also in\n1943\n, in addition to his doctoral thesis, he published\nOn the absolute convergence of Dirichlet\nseries,\nOn the number of solutions of the system\n..., and\nAlmost periodic multiplicative functions\nwhich establishes necessary and sufficient conditions for an arithmetic multiplicative function to be almost periodic in the sense of\nHarald Bohr\n.\nIn June\n1944\nde Bruijn became a Scientific Associate at Philips Research Laboratories in Eindhoven. Shortly after beginning this employment, he married Elizabeth de Groot on\n30\nAugust\n1944\n; they had four children, Jorina Aleida born\n19\nJanuary\n1947\n, Frans Willem born\n13\nApril\n1948\n, Elisabeth born\n24\nNovember\n1950\n, and Judith Elizabeth born\n31\nMarch\n1963\n. He began publishing papers on combinatorics relevant to his work during this period such as\nThe problem of optimum antenna current distribution\n(1946)\n,\nA combinatorial problem\n(1946)\n,\nOn the zeros of a polynomial and of its derivative\n(1946)\n, and\nA note on van der Pol's equation\n(1946)\n[\n1\n]\n:-\nHis work on combinatorics resulted in influential notions and results of which we mention the de Bruijn-sequences of\n1946\nand the de Bruijn-\nErdős\ntheorem of\n1948\n.\nHe showed the breadth of his research interests with\nThe electrostatic field of a point charge inside a cylinder, in connection with wave guide theory\n(\nwritten jointly with C J Bouwkamp\n)\nin\n1947\n. He held this position at Philips Research Laboratories until October\n1946\nwhen he was appointed as a Professor in the Department of Mathematics of the Technological University of Delft.\nIn September\n1952\nde Bruijn was appointed as Professor in the  Department of Mathematics at the University of Amsterdam. He held this position until September\n1960\n, and it is during this period that he published the remarkable text\nAsymptotic methods in analysis\npublished by the\nNorth-Holland Publishing Company\nin\n1958\n. De Bruijn writes in the Preface:-\nThis book arose from a course of lectures... Its purpose is to teach asymptotic methods by explaining a number of examples in every detail, so as to suit beginners who seriously want to acquire some technique in attacking asymptotic problems... This book has not been written exclusively for mathematicians, but also for those physicists and engineers who have a certain maturity... This is not an encyclopaedia on asymptotic results. Not even the asymptotic behaviour of\nBessel functions\ncan be found in this book. Attention is focussed mainly on methods.\nArthur Erdélyi\n, reviewing the text wrote:-\nThis is a highly personal, ingenious, stimulating, and in parts even exhilarating book. It has enough original material to appeal to the expert. It would be an excellent book to read in conjunction with a textbook or monograph on asymptotic expansions - if such a one existed: whether it can replace a textbook is a question which every reader will have to answer for himself.\nA reprinting, without substantial revisions, was published in\n1961\n, then a Russian translation appeared in\n1969\n, followed by a corrected reprint of the third edition by\nDover Publications\nin\n1981\n. In the Preface to this Dover Reprint, de Bruijn writes:-\nMy somewhat unusual way of presenting a mathematical subject seems to have been appreciated by many, so much so that a second edition was needed comparatively shortly after the first one. Substantial revisions have not been made. A number of minor errors have been corrected.\nDuring the summer of\n1959\nhe was Visiting\nGauss\nProfessor at the University of Göttingen. In September\n1960\nhe became Professor in the Department of Mathematics at the Technological University of Eindhoven. He held this position until\n1\nAugust\n1984\nwhen he retired and was made Professor Emeritus. On returning to Eindhoven he renewed his links with the Philips Research Laboratories where he was made a Consultant in\n1960\n, also a position he held until he retired in\n1984\n.\nWe have already indicated above some of the remarkable breadth in de Bruijn's mathematical interests. He lists his interests\n(\non his website\n)\nas: Geometry, Number Theory, Classical and Functional Analysis, Applied Mathematics, Combinatorics, Computer Science, Logic, Mathematical Language, Brain Models. The Preface\n[\n1\n]\nrecords:-\nDe Bruijn's famous contributions to mathematics include his work on generalized function theory, analytic number theory, optimal control, quasicrystals, the mathematical analysis of games and much more. In each area he approached, he shed a new light and was known for his originality. De Bruijn could rightly assume the motto \"I did it my way\" as his own motto. And when it came to automating Mathematics, he again did it his way and introduced the highly influential AUTOMATH. In the past decade he has been also working on the theories of the human brain.\nWe should say a little about AUTOMATH mentioned in the quote. In\n1968\nhe published on automating mathematics, then in\n1973\nhe published the\n63\npage paper\nAUTOMATH, a language for mathematics\n. Charles G Morgan explains that the purpose of the paper is:-\n... to present a formal language called AUTOMATH. The rules for writing the language are precise enough that a computer may be used to check a body of text for\n(\ngrammatical\n)\ncorrectness. The author claims that the language is sufficient to express significant portions of mathematics, including meta-theoretical notions concerning inference rules and proofs. The language is so designed that it is incorrect to state a theorem without first \"constructing\" a proof of the theorem. Thus a computer verification of a body of text translated into AUTOMATH provides automated proof checking. ... The presentation is relatively informal and primarily by example.\nDe Bruijn has received, and continues to receive, many honours for his outstanding mathematical contributions. He lists on his website: Member\nRoyal Netherlands Academy of Sciences\nsince\n1957\n; Invited Speaker at the International Congress of Mathematicians in Nice\n1970\n; Ridder Nederlandse Leeuw\n(\nKnight in the Order of the Lion\n)\n1981\n; Snellius Medal\n1985\n(\nThis medal of the \"Genootschap ter Bevordering van natuur-, genees-, en heelkunde\" is awarded only once in\n9\nyears for the whole field of mathematics, natural sciences and medicine. The work on the Automath project was the main motivation for this case\n)\n; Honorary Member of the\nDutch Mathematical Society\n(\nWiskundig Genootschap\n)\nsince\n1988\n; AKZO Prize\n1991\n; and in\n2003\nthe Lifetime Achievement Award Nederlandse Vereniging v. Theoretische Informatica.\nIn November\n2013\nthe\nRoyal Netherlands Academy of Arts and Sciences\npublished a special issue of\nIndagationes Mathematicea\n: In memory of N.G.\n(\nDick\n)\nde Bruijn\n(1918\n-\n2012)\n[\n2\n]\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}