{
  "nome_completo": "Nicomachus of Gerasa",
  "nome_curto": "Nicomachus",
  "ano_nascimento": "60",
  "ano_morte": "120",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nicomachus/",
  "lugar_nascimento": "Gerasa, Roman Syria (possibly now Jarash, Jordan)",
  "lugar_morte": null,
  "biografia": "Nicomachus of Gerasa\nis mentioned in a small number of sources and we can date him fairly accurately from the information given. Nicomachus himself refers to Thrasyllus who died in\n36\nAD so this gives lower limits on his dates. On the other hand\nApuleius\n, the Platonic philosopher, rhetorician and author whose dates are\n124\nAD to about\n175\nAD, translated Nicomachus's\nIntroduction to Arithmetic\ninto Latin so this gives an upper limit on his dates. One of the most interesting references is by\nLucian\n, the rhetorician, pamphleteer and satirist who was born about\n120\nAD, who makes one of his characters say:-\nYou calculate like Nicomachus.\nClearly Nicomachus had achieved fame for his arithmetical work!\nIn the paper\n[\n7\n]\nDillon argues that Nicomachus died in\n196\nAD. His argument is based on the fact that\nMarinus\nclaimed that\nProclus\nbelieved that he was the reincarnation of Nicomachus. Since\nProclus\nwas born in\n412\nAD and there was a belief among Pythagoreans that reincarnations occurred with an interval of\n216\nyears, the date fits. Although\n196\nAD is not ruled out by his translator dying in\n175\nAD\n(\nalthough it comes close\n)\nthe most serious objection to Dillon's theory seems to be the lack of evidence that\nProclus\nhimself believed in the\n216\nyear interval.\nLet us move from conjectures to more certain ground, and record that Nicomachus was a Pythagorean. This is obvious from his writings on numbers and music, but we are also told this by\nPorphyry\nwho says that he was one of the leading members of the Pythagorean School.\nNicomachus wrote\nArithmetike eisagoge\n(\nIntroduction to Arithmetic\n)\nwhich was the first work to treat arithmetic as a separate topic from geometry. Unlike\nEuclid\n, Nicomachus gave no abstract proofs of his theorems, merely stating theorems and illustrating them with numerical examples.\nHowever\nIntroduction to Arithmetic\ndoes contain quite elementary errors which show that Nicomachus chose not to give proofs of his results because he did not in general have such proofs. Many of the results were known by Nicomachus to be true since they appeared with proofs in\nEuclid\n, although in a geometrical formulation. Sometimes Nicomachus stated a result which is simply false and then illustrated it with an example which happens to have the properties described in the result. We must deduce from this that some of the results are merely guesses based on the evidence of the numerical examples\n(\nand in some cases perhaps even based on one example!\n)\n.\nAn example of this we look more closely at the results which Nicomachus quotes on\nperfect numbers\n. He states that the\nn\nn\nn\nth perfect number has\nn\nn\nn\ndigits, and that all perfect numbers end in\n6\nand\n8\nalternately. These statements must be merely false deductions from the fact that there were four perfect numbers known to Nicomachus, namely\n6\n,\n28\n,\n496\nand\n8128\n.\nThe work contains the first multiplication table in a Greek text. It is also remarkable in that it contains Arabic numerals, not Greek ones. However, in many respects the book is old fashioned in its style since it appears more in tune with the number theoretic ideas of\nPythagoras\nwith his mystical approach, rather than a true mathematical approach. To illustrate Nicomachus's rather strange approach to numbers, giving the moral properties, we look at his description of\nabundant numbers\nand\ndeficient numbers\n. An abundant number has the sum of its proper divisors greater than the number, while a\ndeficient number\nhas the sum of its proper divisors less than the number. Nicomachus writes of these numbers in\nIntroduction to Arithmetic\n(\nsee\n[\n6\n]\n, or\n[\n3\n]\nfor a different translation\n)\n:-\nIn the case of the too much, is produced excess, superfluity, exaggerations and abuse; in the case of too little, is produced wanting, defaults, privations and insufficiencies. And in the case of those that are found between the too much and the too little, that is in equality, is produced virtue, just measure, propriety, beauty and things of that sort - of which the most exemplary form is that type of number which is called perfect.\nHe then continues his description of abundant numbers as resembling an animal:-\n... with ten mouths, or nine lips, and provided with three lines of teeth; or with a hundred arms, or having too many fingers on one of its hands....\nwhile a deficient number is like an animal:-\n... with a single eye, ... one armed or one of his hands has less than five fingers, or if he does not have a tongue...\nFor over\n1000\nyears\nIntroduction to Arithmetic\nwas the standard arithmetic text. In view of the comments we have made regarding the work, this may seem a surprising fact. Mathematicians disliked the work, in particular\nPappus\nis said to have despised it. However, several people including\nBoethius\ntranslated\nIntroduction to Arithmetic\ninto Latin and it was used as a school book. How then could a poor book become so popular.\nHeath\ntries to explain the apparent contradiction in\n[\n4\n]\n, suggesting that:-\n... it was at first read by philosophers rather than mathematicians, and afterwards became generally popular at a time when there were no mathematicians left, but only philosophers who incidentally took an interest in mathematics.\nArab translations of Nicomachus's\nIntroduction to Arithmetic\nwere important and in\n[\n5\n]\nBrentjes studies the influence of these Arabic translations. She concludes that most Arabic texts on\nnumber theory\nwritten by mathematicians were influenced by both\nEuclid\nand Nicomachus, but were mainly influenced by\nEuclid\n. However, texts by non-mathematicians were most strongly influenced by Nicomachus. This research in\n[\n5\n]\ntends to support the views of\nHeath\non this subject.\nNicomachus also wrote two volumes\nTheologoumena arithmetikes\n(\nThe Theology of Numbers\n)\nwhich was completely concerned with mystic properties of numbers. However\nHeath\nwrites\n[\n4\n]\n:-\nThe curious farrago which has come down to us under that title and which was edited by Ast\n[\npublished in Leipzig in\n1817]\nis, however, certainly not by Nicomachus; for among the authors from whom it gives extracts is Anatolius, Bishop of Laodicaea\n(270\nAD\n)\n; but it contains quotations from Nicomachus which appear to come from the genuine work.\nAnother work by Nicomachus which has survived is\nManual of Harmonics\nwhich is a work on music. Again Nicomachus shows the influence of\nPythagoras\nbut also\nAristotle\n's theories of music. The work looks at musical notes and the octave. The principles of tuning a stretched string are studied as is an extension of the octave to the two-octave range.\nThe influences of\nPythagoras\n's theory of music are seen from Nicomachus's\n(\nsee\n[\n1\n]\n)\n:-\n... assignment of number and numerical ratios to notes and intervals, his recognition of the indivisibility of the octave and the whole tone... But, unlike\nEuclid\n, who attempts to prove musical propositions through mathematical theorems, Nicomachus seeks to show their validity by measurement of the lengths of strings.\nBoth\nPorphyry\nand\nIamblichus\nwrote biographies of\nPythagoras\nwhich quote from Nicomachus. From this evidence some historians have conjectured that Nicomachus also wrote a biography of\nPythagoras\nand, although there is no direct evidence, it is indeed quite possible.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}