{
  "nome_completo": "Nicolaus (I) Bernoulli",
  "nome_curto": "Nicolaus (I) Bernoulli",
  "ano_nascimento": "1687",
  "ano_morte": "1759",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernoulli_Nicolaus(I)/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "Basel, Switzerland",
  "biografia": "Nicolaus\n(\nI\n)\nBernoulli\nwas a nephew of\nJacob Bernoulli\nand\nJohann Bernoulli\n. His early education involved studying mathematics with his uncles. In fact it was\nJacob Bernoulli\nwho supervised Nicolaus's Master's degree at the University of Basel which he was awarded in\n1704\n. Five years later he was received a doctorate for a dissertation which studied the application of\nprobability theory\nto certain legal questions.\nYou can see the Bernoulli family tree at\nTHIS LINK\n.\nIn\n1712\nNicolaus Bernoulli toured Europe visiting Holland, England and France. It was in France that he met\nMontmort\nand the two mathematicians became close friends and collaborated on mathematical questions in a long correspondence.\nNicolaus Bernoulli was appointed to\nGalileo\n's chair at Padua in\n1716\nwhich\nHermann\nhad filled immediately prior to Nicolaus's appointment. There he worked on geometry and\ndifferential equations\n. In\n1722\nhe left Italy and returned to his home town to take up the chair of logic at the University of Basel. After nine years, remaining at the University of Basel, he was appointed to the chair of law. In addition to these academic appointments, he did four periods as rector of the university.\nJ O Fleckenstein, writing in\n[\n1\n]\n, describes Nicolaus Bernoulli's contribution to mathematics:-\nNicolaus was a gifted but not very productive mathematician. As a result, his most important achievements are hidden throughout his correspondence, which comprises about\n560\nitems. The most important part of his correspondence with\nMontmort\n(1710\n-\n1712)\nwas published in the latter's \"Essai d'analyse sur les jeux de hazard\"\nⓉ\n(\nEssay on the analysis of games of chance\n)\n(\nParis,\n1713)\n.\nFrom\nMontmort\n's work we can see that Nicolaus formulated certain problems in the theory of probability, in particular the problem which today is known as the St Petersburg problem. Nicolaus also corresponded with\nLeibniz\nduring the years\n1712\nto\n1716\n. In these letters Nicolaus discussed questions of convergence, and showed that\n(\n1\n+\nx\n)\nn\n(1+x)^{n}\n(\n1\n+\nx\n)\nn\ndiverges for\nx\n>\n0\nx > 0\nx\n>\n0\n.\nNicolaus also corresponded with\nEuler\n. Again quoting\n[\n1\n]\n:-\nIn his letters to\nEuler\n(1742\n-\n43)\nhe criticises\nEuler\n's indiscriminate use of divergent series. In this correspondence he also solved the problem of the sum of the reciprocal squares\n∑\n1\nn\n2\n=\nπ\n2\n6\n\\sum\\Large\\frac 1 {n^2}\\normalsize = \\Large\\frac {\\pi^2} 6\n∑\nn\n2\n1\n​\n=\n6\nπ\n2\n​\n, which had confounded\nLeibniz\nand\nJacob Bernoulli\n.\nNicolaus Bernoulli assisted in the publication of\nJacob Bernoulli\n's\nArs conjectandi\nⓉ\n(\nThe art of conjecturing\n)\n. Later Nicolaus edited\nJacob Bernoulli\n's complete works and supplemented it with results taken from Jacob's diary. Other problems he worked on involved differential equations. He studied the problem of orthogonal trajectories, making important contributions by the construction of orthogonal trajectories to families of curves, and he proved the equality of mixed second-order partial derivatives. He also made significant contributions in studying the\nRiccati\nequation.\nOne of the great controversies of the time was the\nNewton\nLeibniz\nargument. As might be expected Nicolaus supported\nLeibniz\nbut he did produce some good arguments in his favour such as observing that\nNewton\nfailed to understand higher derivatives properly which had led him into errors in the problem of inverse central force in a resisting medium.\nNicolaus\n(\nI\n)\nBernoulli received many honours for his work. For example he was elected a member of the\nBerlin Academy\nin\n1713\n, a Fellow of the\nRoyal Society of London\nin\n1714\n, and a member of the Academy of Bologna in\n1724\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}