{
  "nome_completo": "Nicomedes",
  "nome_curto": "Nicomedes",
  "ano_nascimento": "280 BC",
  "ano_morte": "210 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nicomedes/",
  "lugar_nascimento": null,
  "lugar_morte": null,
  "biografia": "We know nothing of\nNicomedes\n' life. To make a guess at dating his life we have some limits which are given by references to his work. Nicomedes himself criticised the method that\nEratosthenes\nused to\nduplicate the cube\nand we have made a reasonably accurate guess at\nEratosthenes\n' life span\n(276\nBC -\n194\nBC\n)\n. A less certain piece of information comes from\nApollonius\nchoosing to name a curve 'sister of the conchoid' which is assumed to be a name he has chosen to compliment Nicomedes' discovery of the conchoid. Since\nApollonius\nlived from about\n262\nBC to\n190\nBC these two pieces of information give a fairly accurate estimate of Nicomedes' dates. However, as we remarked the second of these pieces of information cannot be relied on but nevertheless, from what we know of the mathematics of Nicomedes, the deduced dates are fairly convincing.\nNicomedes is famous for his treatise\nOn conchoid lines\nwhich contain his discovery of the curve known as the conchoid of Nicomedes. How did Nicomedes define the curve. Consider the diagram. We are given a line\nX\nY\nXY\nX\nY\nand a point\nA\nA\nA\nnot on the line.\nA\nB\nC\nABC\nA\nB\nC\nis drawn perpendicular to\nX\nY\nXY\nX\nY\ncutting it at\nB\nB\nB\nand having the length\nB\nC\nBC\nB\nC\nsome fixed value, say\nb\nb\nb\n. Then rotate\nA\nB\nC\nABC\nA\nB\nC\nabout\nA\nA\nA\nso that, in an arbitrary position\nA\nD\nE\nADE\nA\nD\nE\nthen\nD\nE\n=\nb\nDE = b\nD\nE\n=\nb\n. So if a point\nP\nP\nP\non the conchoid is joined to\nA\nA\nA\nthen\nP\nA\nPA\nP\nA\ncuts the line\nX\nY\nXY\nX\nY\nin a point at distance\nb\nb\nb\nfrom\nP\nP\nP\n.\nNicomedes recognised three distinct forms in this family but the sources do not go into detail on this point. It is believed that they must be the three branches of the curve. The conchoid can be used in solving both the problems of\ntrisection of an angle\nand of the duplication of a cube. Both these problems were solved by Nicomedes using the conchoid, in fact as Toomer writes in\n[\n1\n]\n:-\nAs far as is known, all applications of the conchoid made in antiquity were developed by Nicomedes himself. It was not until the late sixteenth century, when the works of Pappus and\nEutocius\ndescribing the curve became generally known, that interest in it revived...\nAs indicated in this quote\nPappus\nalso wrote about Nicomedes, in particular he wrote about his solution to the problem of trisecting an angle\n(\nsee for example\n[\n2\n]\n)\n:-\nNicomedes trisected any rectilinear angle by means of the conchoidal curves, the construction, order and properties of which he handed down, being himself the discoverer of their peculiar character.\nNicomedes also used the quadratrix, discovered by\nHippias\n, to solve the problem of\nsquaring the circle\n.\nPappus\ntells us\n(\nsee for example\n[\n2\n]\n)\n:-\nFor the squaring of the circle there was used by\nDinostratus\n, Nicomedes and certain other later persons a certain curve which took its name from this property, for it is called by them square-forming\nin other words the quadratrix.\nEutocius\ntells us that Nicomedes\n[\n2\n]\n:-\n... prided himself inordinately on his discovery of this curve, contrasting it with\nEratosthenes\n' mechanism for finding any number of mean proportionals, to which he objected formally and at length on the ground that it was impracticable and entirely outside the spirit of geometry.",
  "math_areas": [
    "Calculus"
  ]
}