{
  "nome_completo": "Niels Erik Norlund",
  "nome_curto": "Niels Norlund",
  "ano_nascimento": "1885",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Norlund/",
  "lugar_nascimento": "Slagelse, near Soro, Sjaelland, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Niels Norlund\n's father was Alfred Norlund who ran the pharmacy in the small town of Slagelse. Niels was the oldest of his parents' three children, having a younger sister Margrethe and a younger brother Poul. Margrethe is mentioned elsewhere in this archive as the wife of\nNiels Bohr\nwhom she married on\n1\nAugust\n1912\n. Poul became a famous archaeologist and director of the National Museum in Copenhagen. Niels attended elementary school in Slagelse but then had to go to the larger nearby town of Soro for his secondary schooling. He attended the excellent Soro Academy, completing his school education in\n1903\n.\nAt school Norlund had loved mathematics and astronomy. When he entered the University of Copenhagen in\n1903\n, he was still undecided as to which subject he should specialise in. So, he did the sensible thing and studied both subjects. Norlund had a number of lecturers with international reputations: for example he was taught mathematics by\nHieronymus Georg Zeuthen\n,\nJulius Petersen\n, and\nNiels Nielsen\n; and astronomy by\nThorvald Thiele\n. Norlund was most attracted by the vigorous\nNiels Nielsen\n, who lectured on the theory of functions, and by\nThorvald Thiele\nwhose interests in astronomy were mainly on orbits and the three-body problem. Norlund's first publication was in\n1905\nwhen he published a paper on a known double star in Ursa Major which, with careful measurements of their orbits, he was able to deduce was actually a triple system with a third star which was too faint to observe. This fine piece of theoretical and observational work led to his appointment as an assistant at the Astronomical Observatory at the University of Copenhagen, working under\nThiele\nwho was the director.\nIn addition to spending considerable time observing star positions and proper motions of stars, Norlund also undertook research in mathematics. In\n1907\nhe was awarded a gold medal for an essay on continued fractions and his resulting two publications were in\n1908\n:\nSur les différences réciproques\nⓉ\n(\nOn mutual differences\n)\n; and\nSur la convergence des fractions continues\nⓉ\n(\nOn the convergence of continued fractions\n)\nboth published in\nComptes Rendus de l'Academie des Sciences\n. These publications in the most prestigious French journal earned Norlund an international reputation despite still being an undergraduate. In the summer of\n1910\nhe earned a Master's degree in astronomy and in October of that year he successfully defended his doctoral thesis in mathematics\nBidrag til de lineaere differentialligningers Theori\nⓉ\n(\nContribution to the theory of linear  differential equations\n)\n. In the same year he published the\n100\n-page paper\nFractions continues et différences réciproques\nⓉ\n(\nContinued fractions and mutual differences\n)\nas well as\nSur les fractions continues d'interpolation\nⓉ\n(\nOn continued fractions interpolation\n)\n, a paper on\nHalley\n's comet, and an obituary of his teacher\nThorvald Thiele\n. Bang writes of Norlund's doctoral thesis\n[\n1\n]\n:-\nThe thesis is the beginning of the penetrating study of difference equations that he accomplished in the following\n15\nyears. The problem in difference equations is to find general methods for determining a function when the size of its increase on intervals of a given length is known.\nWe explained at the beginning of this biography how Norlund's sister Margrethe married\nNiels Bohr\n. Of course\nNiels Bohr\nwas the brother of the outstanding mathematician\nHarald Bohr\nwho was a close friend of Norlund; for example each read the proofs of the others doctoral thesis. Following the award of his doctorate, Norlund remained at Copenhagen for two years continuing to work as an assistant at the Observatory. In\n1912\nhe was appointed to a new chair of mathematics at the university in Lund in Sweden. In the same year he married Agnete Waever; they had two daughters. He held the chair at Lund for ten years and during this time he left his interest in astronomy and concentrated entirely on research in mathematics. Bang explains the main aspects of this research in\n[\n1\n]\n:-\n... a long series of papers developing the theory of difference equations. He studied the factorial series and interpolation series entering in their solutions, determining their region of convergence and by analytic prolongation and different summation methods he extended them in the complex plane, determining their singularities and their behaviour at infinity, also by use of their relations to\ncontinued fractions\nand asymptotic series. In particular the little paper 'Sur une application des fonctions permutables'\nⓉ\n(\nOn an application of permutable functions\n)\nfrom\n1919\nshould be mentioned: there he states some universal results on the summability of series based on a specific - but rather general - choice of the weights given to the elements; the method includes the better of the known summability methods, such as\nCesaro\n's method, and is now known under the standard designation of Norlund-summation.\nWith a high international profile, Norlund was elected to the\nDanish Academy of Sciences\nin\n1916\n. In the same year he became a member of the editorial staff of\nActa mathematica\n, the journal founded and run by\nMittag-Leffler\n. He was one of only five plenary speakers invited to address the\n1920\nInternational Congress of Mathematicians at Strasbourg. There he gave the lecture\nSur les équations aux différences finies\nⓉ\n(\nOn difference equations\n)\n. Now it was important to attract such a high profile Danish mathematician back to Denmark, but with Copenhagen the only Danish university, and only two mathematics chairs at that university, the possibilities were very limited. To solve this situation a third mathematics chair was created at the University of Copenhagen and Norlund invited to fill it. He accepted and took up his new position in September\n1922\n. He published the important book\nVorlesungen über Differenzenrechnung\nⓉ\n(\nLectures on the calculus of finite differences\n)\nin\n1924\n.\nR D Carmichael\nwrites in a review\n[\n4\n]\n:-\nThis is the first book to develop the theory of the difference calculus from the function-theoretic point of view and to include a significant part of the recent researches having to do with the analytic and asymptotic character of the solutions of linear difference equations. As such it is an important contribution to the mathematical literature and will render a service not procurable from any of its predecessors. The author presents a connected account of what appears to him to be the most important and the best developed domains of the difference calculus. The book is intended to give a preliminary view of the field and to facilitate the reading of the original memoirs. With this purpose in view the author sometimes omits proofs\n(\ntoo frequently, we think\n)\nleaving the reader to find them in the indicated memoirs.\nEvents conspired to stop Norlund carrying out mathematical research during the thirty years he held the mathematics chair in Copenhagen. There were administrative duties at the university, administrative tasks related to the\nDanish Academy of Sciences\nbut, most significantly, he was persuaded to take up the post of Director of Den danske Gradmaaling, the Danish institution responsible for geodesic surveys. He took on this role with enthusiasm, using the skills he had acquired during his earlier role in the Observatory. He introduced new courses at the university and established a Master's Degree in geodesy. He also studied seismology and, in\n1925\n, set up seismographic stations in Denmark and Greenland. In\n1928\nhe persuaded the Danish government to set up a Geodesic Institute, combining the Gradmaalingen and the Danish ordinance survey. He was appointed as director\n[\n1\n]\n:-\nHere he could wholly use his capacity for organizing work, exacting a combination on a high level of mathematics, astronomy, physics and mechanics. Besides the necessary updating of the ordnance maps of Denmark, he put into operation new more precise triangulations and measurement of the matching new baselines and new astronomical determinations.\nDuring World War II, the German armies invaded Denmark and although for a while the country was allowed to remain a sovereign state, eventually Germans took over complete control. The Geodesic Institute could not continue with its work, but Norland used the opportunity to produce a series of atlases, detailing the history of the mapping of Denmark, the Faroe Islands and Iceland. They were produced using the resources of the Institute and are truly beautiful works, highly sought after today. Also during World War II he published a number of mathematics papers such as\nAusgleichung nach der Methode der kleinsten Quadrate bei gruppenweiser Anordnung der Beobachtungen\nⓉ\n(\nAdjustment by the least squares method in group-wise arrangement of the observations\n)\n(1940)\nand\nDetermination of the weights for the unknowns in graduation of elements\n(\nDanish\n)\n(1943)\n.\nIn\n1955\nNorland reached retirement age. That mathematics was his first love now became clear, for once he gave up the responsibilities of the Geodesic Institute he returned to mathematics research. He published\nHypergeometric functions\nin\n1955\nwhich was reviewed by\nArthur Erdélyi\n:-\nThis is one of those rare papers in which sound mathematics goes hand in hand with excellent exposition and style; and the reader is both instructed and delighted. It is likely to become the standard memoir on the generalized\nhypergeometric series\n...\nThe paper\nSur les fonctions hypergéométriques d'ordre supérieur\nⓉ\n(\nOn hypergeometric functions of higher order\n)\n(1956)\ngives a very full, rigorous and classical treatment of some integrals from generalized hypergeometric function theory. Let us give one further example of the papers Norland published after he retired. This is\nThe logarithmic solutions of the hypergeometric equation\n(1963)\nwhich was reviewed by L J Slater:-\nIn this important paper the author discusses in a clear and detailed way the complete logarithmic solutions of the hypergeometric differential equation satisfied by the\nGauss\nfunction ... Complete tables are given of the linear and quadratic relations which hold between the various solutions in every possible special case. Tables are also given for the continuation formulae which hold between the logarithmic and other cases of\nRiemann\n's P-function, and the paper concludes with a very clear statement of the logarithmic solutions of the confluent hypergeometric equation satisfied by\nKummer\n's function ...\nNorlund received a large number of honours for his contributions to mathematics and to geodesy. He was elected to the Det kongelige danske Videnskabernes Selskab\n(1916)\n, the Société des Sciences, Strasbourg\n(1920)\n, the Accademia Pontaniana, Napoli\n(1925)\n, the Kungliga Vetenskapsakademien, Stockholm\n(1925)\n, the Societas scientiarum Fennica, Helsinki\n(1926)\n, the\nAcadémie des Sciences\n, Paris\n(1926)\n, the\nAccademia Nazionale dei Lincei\n, Roma\n(1927)\n, the Deutsche Akademie der Naturforscher, Halle\n(1927)\n, the\nRoyal Astronomical Society\n, London\n(1935)\n, the Bureau des Longitudes, Paris\n(1937)\n, the\nRoyal Society\n, London\n(1938)\n, the Akademiet for de tekniske Videnskaber, Kobenhavn\n(1939)\n, the\nNorwegian Academy of Science and Letters\n, Oslo\n(1946)\n, the Vetenskapsakademien, Helsinki\n(1946)\n, the Det kungliga vetenskapliga Sallskapet, Uppsala\n(1951)\n, the Societas scientiarum Islandica, Reykjavik\n(1959)\n, and the\nNew York Academy of Sciences\n(1960)\n. He received the Grand Prix of the\nAcadémie des Sciences\n, Paris\n(1916)\n, the Kungliga Fysiografiska Sallskapets Gold Medal\n(1916)\n, the Ole Rømer Medal\n(1954)\n, and the Vitus Bering Medal\n(1958)\n.\nFinally let us look at Norlund's character\n[\n1\n]\n:-\nNobody who met Norlund could doubt that he was a great personality, a conclusion in keeping also with his tall aristocratic stature. He was a man of few words, not immediately obliging to strangers, and even his closer collaborators often felt his taciturnity embarrassing. This coolness could be felt as an aloofness; maybe it was due to some sort of shyness, but on the other hand his words thus gained more importance and one could feel how he exerted himself to find the right solution to problems. Students or employees who came closer to him could rejoice at his warm-hearted interest, but as an administrator he could be severe. Maybe that was necessary in his position ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}