{
  "nome_completo": "Nigel James Hitchin",
  "nome_curto": "Nigel Hitchin",
  "ano_nascimento": "1946",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hitchin/",
  "lugar_nascimento": "Holbrook, Derbyshire, England",
  "lugar_morte": null,
  "biografia": "Nigel Hitchin\nwas born in Holbrook but grew up in nearby Duffield, which is about\n5\nkm north of Derby. His father was an industrial chemist who worked at the British Celanese chemical factory at Spondon, just to the east of Derby. British Celanese was founded\n1916\nand became a subsidiary of Courtaulds in\n1957\n. Nigel's father had worked there from the time he left school, but after he marriage, his wife persuaded him to study for an external London University degree. Nigel's mother, the daughter of a baker, had left school at fourteen and helped in her father's bakery until her marriage. Nigel attended the local Duffield primary school but even before that his brother, who was four year older than him, had taught him to read.\nIn\n1957\n, when he was eleven years old, Nigel entered Ecclesbourne School. This secondary school opened in Duffield in the year Nigel began his studies there. The headmaster of the school was Donald Redfearn, who was a rugby fanatic, so the boys played rugby, not soccer. In\n[\n12\n]\nwe learn about Redfearn from one of Hitchin's fellow pupils:-\nOur headmaster was Mr Redfearn, known from a fairly early stage as 'the Beak' because of his dictatorial and magisterial manner. He was a formidable creature and a strict disciplinarian who imposed his will with a rod of iron on pupils and teachers alike. To his credit, he wanted everyone to achieve high standards; in fact, it went beyond that. He wanted the school to quickly move into the big league of academia. From day one, 'the Beak' introduced a timetable of\n40\n,\n40\n-minute lessons per week and homework built up from a gentle half hour per evening in year one to a burdensome three hours per night in the sixth form.\nIn his first year at Ecclesbourne School, Hitchin was taught mathematics by the French teacher and the PE teacher. Things improved markedly in Hitchin's second year when Norman Else\n(1932\n-\n2023)\nwas appointed to teach mathematics. He had graduated with a degree in mathematics from the University of Nottingham in\n1953\nand was keen to answer pupils' questions. Although mathematics was one of Hitchin's favourite subjects throughout his school studies, he expected to go on to have a career in engineering. At the start of his sixth form, however, he had a major appendix operation, missed time at school and dropped one of his intending A-levels, deciding to concentrate on mathematics and physics. That meant that he would apply to study mathematics at university.\nDonald Redfearn, the Ecclesbourne School headmaster, was ambitious and wanted to see as many of the first intake into the school win places at Oxford or Cambridge. Redfearn himself was a mathematician who, in the\n1930\ns, he been offered a place to study mathematics at Jesus College, Oxford, but lacked the financial support to accept. He was keen that Hitchin should apply to study mathematics at Jesus College, Oxford, motivated, perhaps, at his own sadness at having to turn down a place there. On the basis of his A-level results, Hitchin was offered a place at Jesus College to start in October\n1964\n. Following advice given at his interview, he decided to take the scholarship examinations and delay entry for a year. He returned to Ecclesbourne School but, when informed that he was awarded an Open Scholarship in December\n1964\n, he immediately left the school and decided to spend the first nine months of\n1965\ngaining some work experience and earning some money.\nThe Rolls Royce Engineering Company opened its factory in Derby in\n1908\n. There the Merlin engine which powered both the Spitfire and Hurricane planes during World War II were designed and built. Rolls Royce was one of the largest employers in Derby and was a natural choice for Hitchin to look for his 'gap year' employment. Donald Redfearn contacted the company and, after being interviewed, Hitchin was given a job as a trainee programmer in the Engineering Computing Department. In the interview\n[\n23\n]\nHitchin said:-\nI learned Fortran and I was given various jobs. The skills needed were organisational and combinatorial: for example, finding a pattern of mixing nozzle guide vanes in a jet engine to avoid the natural frequency of the turbines, without using months of computer time: I knew nothing of Fourier analysis at the time, but eventually realised why I was doing this.\n...\nI also absorbed too much pie and chips in the canteen, and put on a lot of weight! I returned for a couple of periods of vacation work and they told me that there would always be a job for me if I wanted one after graduation. When things got difficult as a research student I considered it, but by then I really wanted to widen my horizons and not return to Derby.\nIn October\n1965\nHitchen became a resident of Jesus College, Oxford, in a comfortable, reasonably warm room overlooking Ship Street. He was one of eight first year mathematics students entering Jesus College that year. At the College there were two mathematics tutors, Edward Crossley Thompson\n(1919\n-\n1991)\nand Christopher J Bradley\n(1938\n-\n2013)\n.\nChristopher Bradley was a popular and effective Fellow and Tutor in Mathematics at Jesus College from\n1964\nto\n1977\n, after which he entered school teaching, notably at Clifton College, near Bristol. For many years he served as Deputy Leader of the British Mathematical Olympiad team and as Secretary of the British Mathematical Olympiad Committee. He produced elegant Olympiad problems. Hitchin said\n[\n23\n]\n:-\nBradley was happy to give more individual attention. I liked his approach to applied mathematics, which was very clean, and he introduced me, for example, to tensors. He was happy to give up time to explain things outside the syllabus.\nEdward Thompson had studied mathematics at New College Oxford from\n1937\nto\n1940\n, and then undertook decoding work at Bletchley Park during World War II. He was Fellow and Mathematics Tutor of Jesus College from\n1945\nto\n1986\n. He tutored pure mathematics\n[\n23\n]\n:-\nThompson's attitude was one of bringing your unsolved problems to him, and in a cloud of pipe smoke he would outline a solution.\nIn Hitchin's first year, Oxford University experimented with starting the mathematics course with top lecturers giving demanding courses.\nMichael Atiyah\ntaught the algebra course going through material very quickly, starting with set theory and reaching\nGalois\ngroups by the end of the term.\nCharles Coulson\ntaught applied mathematics and\nJohn Hammersley\ntaught analysis.\nHammersley\ncaused difficulties since his problem sheets were very difficult so even college tutors were struggling and phoning each other up for help. Hitchin enjoyed this challenging start, but most students gave up. As his undergraduate studies progressed, Hitchin found there were courses he liked and those he did not. For example he did not like probability and statistics, and so avoided these topics. He did a little fluid dynamics but then gave it up. Eventually he found that he loved the courses on topology, algebraic geometry, commutative algebra and functional analysis. In his final year Brian Steer gave him tutorials in topology and differential geometry. He gradually came to feel that these were the topics for him. He graduated with a BA with First Class Honours in Mathematics in\n1968\nand was awarded an Oxford University Junior Mathematical Prize. It is worth noting at this point that, although Hitchin has made outstanding contributions to research on the boundary between mathematics and theoretical physics, he never took any applied mathematics or physics courses during his undergraduate studies - in fact he actively avoided them.\nHitchin began his graduate studies at Jesus College, with Brian Steer at Hertford College as his advisor. Brian Steer had graduated from the University of Oxford with a D.Phil. on algebraic topology in\n1961\nhaving been advised by\nJohn Henry Constantine Whitehead\nand\nIoan Mackenzie James\n. Steer had been a member of the Institute for Advanced Study at Princeton from September\n1962\nto April\n1963\nbefore returning to Hertford College Oxford. Hitchin took graduate courses and was awarded a Diploma in Advanced Mathematics in\n1969\n. His attempts to find the right research topic, however, did not go well at first. Warwick University was running a year long Symposium on Differential Equations and Dynamical Systems with a Summer School in July\n1969\n. Hitchin attended the Summer School with the thoughts that Dynamical Systems might be a good research topic but it did not appeal to him. Steer suggested he look at a K-theory problem but he made little progress, then he was given a paper by\nAndré Lichnerowicz\nabout the\nDirac\noperator. After reading papers on the\nAtiyah\n-\nSinger\nindex theorem, he found an extension of\nLichnerowicz\n's results which formed the basis of the dissertation required to transfer to the D.Phil. degree.\nAfter this year of graduate studies at Jesus College, in\n1969\nhe moved to Wolfson College, Oxford. When he started producing results which Steer thought would interest\nAtiyah\nhe asked\nAtiyah\nif he would supervise Hitchin while he\n(\nSteer\n)\nwas on sabbatical leave for a term. After Steer returned to Oxford, Hitchin continued to be informally supervised by\nAtiyah\n. This was not too easy since\nAtiyah\nwas not based in Oxford at this time but on the Faculty of the Institute for Advanced Study at Princeton but returned to Oxford each summer. Hitchin said\n[\n23\n]\n:-\nSupervisions were very lively, with\nAtiyah\noffering suggestions, sketching out the background on the blackboard, informing me about the essentials of a subject and not asking me to get a book to read about it. It was difficult to recall everything and to try and write it down afterwards, but it was an amazing experience.\nAtiyah\nwas on the Faculty of the School of Mathematics at the Institute for Advanced Study at Princeton and, in\n1971\n, Hitchin moved to Princeton as\nAtiyah\n's research assistant. He continued to work on his Oxford D.Phil. and was awarded the degree in\n1972\nfor his thesis\nDifferentiable Manifolds: The Space of Harmonic Spinors\n. The paper\n[\n16\n]\n,\nHarmonic Spinors\n, published in\n1974\n, was based on this thesis. For an extract from the Introduction to that paper, see\nTHIS LINK\n.\nHitchin was two years at Princeton as\nAtiyah\n's assistant.\nShing-Tung Yau\nwas at Princeton for part of this time and they had many useful discussions about the Calabi Conjecture. While at Princeton he met Nedda who was visiting the Institute for Advanced Study because her cousin was a visitor there. Nigel and Nedda Hitchin married in\n1973\nand they moved to New York where Nedda was studying. Hitchin spent a year as an Instructor at the\nCourant\nInstitute, New York University. He writes in\n[\n5\n]\n:-\nAt New York University I began reading the papers of\nRoger Penrose\non zero rest-mass field equations in relativity.\nThe\nAmerican Mathematical Society\nheld a Differential Geometry Symposium at Stanford University in California from\n30\nJuly to\n17\nAugust\n1973\n. Hitchin contributed the paper\nOn the curvature of rational surfaces\nwhich was published in the\nProceedings\nof the Symposium. In the paper he found certain rational surfaces which admit a\nHodge\nmetric of positive scalar curvature.\nIn\n1974\nhe came back to Oxford with his wife and for the next three years was a Science Research Council Research Assistant at Oxford University and a Junior Research Fellow at Wolfson College. When this ended in\n1977\nhe was awarded a Science Research Council Advanced Research Fellowship at Oxford University, and was a Research Fellow at Wolfson College. He held these positions until\n1979\n. He writes\n[\n5\n]\n:-\nWhen I returned to Oxford as a postdoc the following year\nPenrose\nhad recently been appointed to a Chair and I began to learn that, through his newly-developed twistor theory, the Riemannian geometry I was interested in and the geometry of relativity were both put on the same footing. It meant that questions about\nEinstein\n's equations which were occupying me at the time made sense in this new setting. This was perhaps the first occasion I realised that there was an interface between my own interests and physics which I could exploit.\nHitchin was looking at these questions when\nIsadore Singer\ncame from the Massachusetts Institute of Technology to spend a term in Oxford. He was working on a problem on instantons\n(\nEuclidean versions of the Yang-Mills equations of particle physics\n)\nwhich, although it dealt with concepts that Hitchin was looking at, asked quite different questions. Physicists had constructed some solutions to the problem that\nSinger\nwas working on but there was much to be done. Hitchin became involved since he had relevant ideas from looking at\nPenrose\n's zero rest-mass field equations in relativity but had never written them up as a paper. The outcome was the\n2\n-page paper\nDeformations of instantons\n(1977)\nwith\nAtiyah\n, Hitchin and\nSinger\nas co-authors. This was Hitchin's fourth paper and the first of eight which he co-authored with\nAtiyah\n. This paper only announced results without giving details of proofs. These were given in the\n37\n-page paper\nSelf-duality in four-dimensional Riemannian geometry\n(1978)\nwith the same three co-authors. This\n1978\npaper did more than give full details of the results announced in the previous paper, for it also gave an account of the\nPenrose\ntransform in the Riemannian setting.\nAtiyah\nand Hitchin continued to work together on the construction of instantons and made a breakthrough described by\nAtiyah\nin\n[\n3\n]\n:-\nI would like to mention our work on instantons which became known as the ADHM construction\n(\nM F Atiyah\n,\nV G Drinfeld\n, N J Hitchin and\nYu I Manin\n, Construction of instantons, 'Phys. Lett. A'\n65\n(1978)\n,\n185\n-\n187)\n. One morning, after a long struggle, we finally saw the light. We adjourned to lunch in St Catherine's College euphoric at our success, though post‐prandial analysis often punctures premature celebration. On this occasion there was no unseen error but instead there was a letter from\nManin\ninforming us that he and\nDrinfeld\nhad just reached the same conclusion! This was the genesis of the four‐author paper and it was some years later before Nigel or I met\nDrinfeld\n.\nThis is now known as the ADHM\n(\nAtiyah\n-Hitchin-\nDrinfeld\n-\nManin\n)\nconstruction of instantons. Hitchin received many invitations to speak about the ADHM construction and made many visits to give lectures. This, he remarked, was unfortunate for his wife Nedda since their first child was born around this time.\nFor the next eleven years,\n1979\n-\n1990\n, Hitchin was a Fellow and Tutor in Mathematics and a Common University Fund Lecturer at St Catherine's College, University of Oxford. This was a major change for him since he had held research positions up to this time. The teaching duties were heavy even though St Catherine's College tried to ease them a little. He explained\n[\n23\n]\n:-\nI worked in the Mathematical Institute in the mornings and often, since\nMichael Atiyah\nwas a professorial fellow at the same college, we would walk together across the University Parks from the Institute for lunch and exchange ideas then. The constraints I felt were more that teaching time took away the opportunity to go to seminars or conferences, both in Oxford and elsewhere.\nIn\n1990\nAtiyah\nleft Oxford to become Master of Trinity College, Cambridge. Warwick University was advertising to fill the position which became vacant when\nChristopher Zeeman\nleft to become Principal of Hertford College, Oxford. Hitchin felt that it was time for a change and applied for the chair at Warwick. He took up the chair at Warwick in\n1990\nand became involved in dealing with departmental issues which he had avoided up to that time. He was also slightly surprised to find that he had to give tutorials as well as lectures. There were, however, many positive things for him being in a friendly and very active environment. His election as a fellow of the\nRoyal Society of London\nin\n1991\ninvolved him in committee work so, when it was suggested to him that he should apply to become\nRouse Ball\nProfessor of Mathematics at Cambridge University following the retirement of\nJohn Thompson\n, he took the opportunity.\nIn\n1994\nHitchin was appointed\nRouse Ball\nProfessor of Mathematics at the University of Cambridge and as a Professorial Fellow at Gonville and Caius College. He was only there for three years since the position for the Savilian Professor of Geometry at Oxford University became vacant.\nIoan James\nhad retired as the Savilian Professor of Geometry in\n1995\nand\nRichard Taylor\nwas appointed to fill the vacant chair on\n1\nOctober\n1995\n. After one year,\nRichard Taylor\nmoved to the United States when he was appointed as a Professor at Harvard University and in\n1997\nHitchin was appointed as Savilian Professor of Geometry at the University of Oxford and a Professorial Fellow at New College.\nDuring September\n2005\nhe was appointed as a Clay Senior Scholar to participate in 'Mathematical Aspects of String Theory' at the Kavli Institute for Theoretical Physics which is a research institute of the University of California, Santa Barbara.\nTo celebrate Hitchin's\n60\nth birthday, a conference took place at the Consejo Superior de Investigaciones Científicas in Madrid during the week of\n4\n-\n8\nSeptember\n2006\n. The book\n[\n43\n]\nis the\nProceedings\nof that conference. The Publisher's information about the book includes the following:-\nNigel Hitchin's mathematical influence has been enormous, and his work is frequently cited in widely different branches of mathematics. In accordance with the book's title, his work concerns not just differential geometry, but strikes at the heart of algebraic geometry, complex analysis,\nLie\ngroups, as well as abstract algebra and topology. The present contributions reflect his work on four‐manifolds, monopoles and instantons, Nahm's equations, hyperkähler manifolds, Higgs bundles, integrable systems, the geometrical structure of moduli spaces, gerbes, harmonic forms, reduced holonomy, special Lagrangian submanifolds, and generalised complex structures. Still this list is not exhaustive ...\nThe book contains the paper\n[\n3\n]\nby\nMichael Atiyah\non Hitchin's mathematical work. It begins:-\nIt was a great pleasure for me to take part in the\n60\nth birthday celebration for Nigel Hitchin. I have known him ever since he was a graduate student in Oxford and subsequently as my assistant at the institute in Princeton and then as a colleague and collaborator. I have watched him mature mathematically over the years and gradually establish a unique niche for himself on the frontier between differential geometry and theoretical physics. This is now a very popular and active field but Nigel occupies a singular place in it by virtue of the many important and beautiful ideas he has introduced.\nIt has been said that the real measure of a mathematician's contribution is how long it would have taken the community to discover these results in his absence. In Nigel's case it is clear that he would score highly by this criterion, since many of his results have been somewhat neglected on their first appearance and their significance has only become apparent some years later.\nNigel has a large output with many beautiful papers which deserve to be read and re‐read.\nIn\n[\n15\n]\nHitchin gives an overview of his work. A more general look at the interactions of geometry and physics is contained in the paper\n[\n4\n]\nby\nMichael Atiyah\n, Robbert Dijkgraaf and Nigel Hitchin. For an extract from this paper, see\nTHIS LINK\n.\nHitchin has received many awards for his remarkable contributions. These include: the Junior\nWhitehead\nPrize\n(1981)\n:-\n... for his work in Differential Geometry;\nthe Senior\nBerwick\nPrize\n(1990)\n:-\n... for his paper 'The self-duality equations on a Riemann surface'\n(1987)\n;\nthe\nRoyal Society of London\n's\nSylvester\nMedal\n(2000)\n:-\n... for his important contributions to many parts of differential geometry combining this with complex geometry, integrable systems and mathematical physics interweaving the most modern ideas with the classical literature;\nthe\nPólya\nPrize\n(2002)\n:-\n... for his fundamental and enormously influential contributions to geometry, as well as for his wider contributions to the development of mathematics and mathematical physics;\nand the Shaw Prize in Mathematical Sciences\n(2016)\n:-\n... for his far-reaching contributions to geometry, representation theory and theoretical physics. The fundamental and elegant concepts and techniques that he has introduced have had wide impact and are of lasting importance.\nFor more information on all five of these awards, see\nTHIS LINK\n.\nWe mentioned above that Hitchin was elected a fellow of the\nRoyal Society of London\nin\n1991\n. He was also elected an Ordinary Member of the Academia Europaea\n(\nAcademy of Europe\n)\nin\n1993\n, and a Fellow of the\nAmerican Mathematical Society\nin\n2013\n.\nHitchin published two books, the first being\nMonopoles, minimal surfaces and algebraic curves\n(1987)\n. Krzysztof Galicki writes in the review\n[\n10\n]\n:-\nThe volume under review is based on lectures that Nigel Hitchin gave at the University of Montreal in\n1985\n. Its purpose is to provide a unifying framework for a number of different nonlinear differential equations: from the four-dimensional self-dual Yang-Mills equations through the monopole and the vortex equations to harmonic maps of a\n2\n-torus into the\nLie\ngroup. All of these equations are of interest to those engaged in many areas of modern physics.\nThe second book, jointly authored with\nMichael Atiyah\n, is based on the Milton Brockett Porter Lectures which\nAtiyah\ndelivered at Rice University in January\n1987\n. Atiyah writes in the Preface:-\nThis provided me with the opportunity of presenting, at some length, the results on magnetic monopoles which Nigel Hitchin and I have been investigating over the past few years. This book, written jointly, is an expanded version of the lectures and it contains a full and detailed treatment of the essentially new results. Although dependent on earlier work by many authors we have endeavoured to make it more self-contained by adding some introductory and background material.\nFor more information about these two books, see\nTHIS LINK\n.\nIn September\n2016\nthree events were organised to celebrate Hitchin's\n70\nth birthday. The first was a workshop on 'Differential Geometry and Quantization', held at the Centre for Quantum Geometry of Moduli Spaces, Aarhus University, followed by a meeting at the Mathematical Institute, University of Oxford, then finally a workshop on 'Celebrating\n30\nyears of Higgs bundles and\n15\nyears of generalized geometry' held at the Instituto de Ciencias Matemáticas, Madrid\n[\n14\n]\n:-\nThe workshops in Aarhus and Madrid provided a unique opportunity for researchers and current PhD students to learn about recent exciting developments and exchange ideas in some of the areas most closely associated with Hitchin's name and most influenced by his work.  The speakers at the Oxford event included towering figures in mathematics whose own research has been influenced by Hitchin's.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}