{
  "nome_completo": "Nicolaus Fuss",
  "nome_curto": "Nikolai Fuss",
  "ano_nascimento": "1755",
  "ano_morte": "1826",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fuss/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Nikolai Fuss\nwas born into a Swiss family who had a sufficient income to live reasonably but were certainly not particularly well off. He was educated in Basel and his mathematical abilities brought him to the attention of\nDaniel Bernoulli\nwho recommended him for the post of\nEuler\n's secretary. By\n1772\nDaniel Bernoulli\nwas an old man, as was\nEuler\n, but the two had kept in contact over the many years after Bernoulli had left St Petersburg, where he had worked with\nEuler\n, and had returned to Basel.\nEuler\nhad an eye operation in\n1772\nwhich left him almost completely blind so he wanted\nDaniel Bernoulli\nto find a secretary for him who was well trained in mathematics.\nFuss arrived in St Petersburg in Russia in May\n1773\nto take up this post and he spent the rest of his life in Russia. Being\nEuler\n's secretary was not an easy task, for his secretaries had to be excellent mathematicians who could help\nEuler\ndevelop his ideas:-\n.. the scientists assisting\nEuler\nwere not mere secretaries; he discussed the general scheme of the works with them, and they developed his ideas, calculating tables, and sometimes compiled examples.\nIn\n1774\n, the year after Fuss arrived in St Petersburg to work with\nEuler\n, he published\nInstruction détaillée pour porter les lunettes de toutes les différentes espèces au plus haut degré de perfection dont elles sont susceptibles tirée de la théorie dioptrique de Mr Euler le père et mise a la portée de tous les ouvriers en ce genre. Avec la description d'un microscope qui peut passer pour le plus parfait dans son espèce et qui est propre à produire tous les grossissements qu'on voudra\nⓉ\n(\nDetailed instruction of how to deal with spectacles all the different kinds to the highest degree of perfection of which they are likely derived from the dioptre theory of Mr  Euler  and put within the reach of all workers in this field. With the description of a microscope may be regarded as perfect in its kind and is capable of producing all the magnifications we like\n)\n. This work on the construction of telescopes and microscopes contained a résumé of\nEuler\n's works on the subject, giving\n(\naccording to Daumas in his book\nScientific instruments\n)\n:-\n... a number of formulae for the construction of telescopes with a magnification of five to fifty times, for achromatic telescopes with three lenses and a magnification from\n25\nto\n320\ntimes, and for achromatic telescopes with four or five lenses.\nFuss's book was not a best seller and never ran to a second edition. However, as Daumas writes, it was:-\n... appreciated by his contemporaries, and doubtless inspired the attempts to produce achromatic microscopes made at the end of the eighteenth and in the early nineteenth century.\nFuss's first papers were written under\nEuler\n's direction and dealt with problems in insurance. He helped\nEuler\nprepare over\n250\narticles for publication over a period on about seven years in which he acted as\nEuler\n's assistant, including an important work on insurance which was published in\n1776\n. We know a lot about what Fuss was working on during the years\n1773\nto\n1778\nfor he corresponded with\nDaniel Bernoulli\nover this period and the correspondence had been preserved\n(\nsee\n[\n5\n]\n)\n. C J Scriba writes:-\nThe most important scientific subjects discussed in this correspondence are related to investigations and articles by Fuss. They concern the construction of telescopes, experiments and formulas for the sounds generated by closed pipes, population statistics and the reliability of mortality tables, the project of constructing a wooden bridge of extraordinary width across the Neva, and\nEuler\n's numeri idonei for testing large prime numbers.\nIn\n1776\n, in addition to his other duties, Fuss became an assistant at the St Petersburg Academy and, in\n1783\n, academician in higher mathematics. This was the year in which\nEuler\ndied and Fuss was discussing science with him up to the last day of his life:-\nOn\n18\nSeptember\n1783\nEuler\nspent the first half of the day as usual. He gave a mathematics lesson to one of his grandchildren, did some calculations with chalk on two boards on the motion of balloons; then discussed with\nLexell\nand Fuss the recently discovered planet Uranus.\nFrom\n1790\nFuss was professor of mathematics at the Marine Corps in Petersburg, then from\n1800\nto\n1826\nhe was permanent secretary to the Academy of Sciences in Petersburg. It was in this role that Fuss wrote to\nGauss\noffering him a post at the Academy. The paper\n[\n3\n]\ncontains\nGauss\n's reply to Fuss written on\n4\nApril\n1803\n, in which he declines employment in St Petersburg and discusses his observations of the asteroid Pallas. The reason for refusing the offer of a position was Gauss's commitment to Karl Wilhelm Ferdinand, the Duke of Braunschweig.\nMost of Fuss's papers are solutions to problems posed by\nEuler\non spherical geometry, trigonometry, series,\ndifferential geometry\nand\ndifferential equations\n. His best papers are in spherical trigonometry, a topic he worked on with\nA J Lexell\nand F T Schubert. Fuss also worked on geometrical problems of\nApollonius\nand\nPappus\n. He made contributions to differential geometry and won a prize from the French Academy in\n1778\nfor a paper on the motion of comets near some planet\nRecherche sur le dérangement d'une comète qui passe près d'une planète\nⓉ\n(\nResearch on the changes when a comet passes near a planet\n)\n(\nsee\n[\n4\n]\n)\n. Fuss won other prizes from Sweden and Denmark. He contributed much in the field of education, writing many fine textbooks.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}