{
  "nome_completo": "Nikolai Nikolaevich Bogolyubov",
  "nome_curto": "Nikolai Nikolaevich Bogolyubov",
  "ano_nascimento": "1909",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bogolyubov/",
  "lugar_nascimento": "Nizhny Novgorod, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Nikolai Nikolaevich Bogolyubov\n's name is also transliterated as\nBogoljubov\n(\nor\nBogoliubov\nor\nBogoliuboff\n)\n. He was born in Nizhny Novgorod\n(\ncalled Gorky between\n1932\nand\n1990)\n, a large city about\n450\nkm south-east of Moscow. His parents were Nikolai Mikhailovich Bogolyubov and Olga Nikolaevna. Nikolai Mikhailovich was a priest in the Russian Orthodox Church who taught theology and philosophy, and his wife Olga was a music teacher. Nikolai Nikolaevich was eight years old when the October Revolution of\n1917\nstarted the events which would lead to the Soviets taking power and the creation of the Soviet Union in\n1922\n. It became increasingly difficult for Nikolai Nikolaevich's father to provide a good education for his son since the increasing Soviet domination led to restrictions on children of Russian Orthodox priests. Therefore, in\n1921\n, the family decided to move to Kiev where Nikolai Nikolaevich could receive a top quality education. Indeed in\n1922\n, although he was only thirteen years old, he began attending research seminars at Kiev University run by\nNikolai Mitrofanovich Krylov\n.\nBoth\nDmitry Aleksandrovich Grave\nand\nNikolai Krylov\nquickly realised the potential of their young student and helped him greatly. In\n1923\nBogolyubov began to undertake mathematical research assisted by\nKrylov\nand produced his first original results. He wrote his first scientific paper\nOn the behavior of solutions of linear differential equations at infinity\n(\nRussian\n)\nin\n1924\n.\nNikolai Krylov\nhad been appointed chairman of the Mathematical Physics Department of the\nUkrainian Academy of Sciences\nin Kiev in\n1922\n, and in\n1925\nhe formally began to supervise Bogolyubov who had registered for a Candidates Degree\n(\nequivalent to a Ph.D.\n)\nat the Academy in that year. At this stage Bogolyubov had no undergraduate degree, but he was accepted for postgraduate studies because of his proven exceptional abilities. In\n1928\nhe successfully defended his thesis\nThe Application of the Direct Methods of the Calculus of Variations to Investigation of Irregular Cases of a Simplest Problem\n. He then began to study for his doctorate\n(\nequivalent to the German\nhabilitation\n)\n.\nYu A Mitropolskii\nand S V Tyablikov write\n[\n44\n]\n:-\nThe works of his first period, some of which were carried out by him jointly with his teacher\nN M Krylov\n, deal with direct methods of the calculus of variations, to the theory of nearly-periodic functions and approximate solutions of boundary-value differential equations. Already during that period one of the characteristic features of Bogolyubov's scientific gifts had become clearly pronounced; he is, if one may use the expression, a specialist in problems which cannot be attacked by usual methods and require an approach new in principle. A number of results obtained by him at that time have long since become classical; Bogolyubov's mathematical papers have attained widespread international renown and recognition. One of his papers was awarded in\n1930\na prize by the Bologna Academy of Sciences\n(\nthe A Merlani prize\n)\n.\nIn\n1930\nBogolyubov was awarded his doctorate\n(\nwith distinction\n)\nby the Presidium of the\nUkrainian Academy of Sciences\n. He continued working at Kiev University and also at the Institute for Theoretical Physics of the\nUkrainian Academy of Sciences\nin Kiev. Two years later Bogolyubov began joint work with\nNikolai Mitrofanovich Krylov\nin which they developed a theory of non-linear oscillations; they called their topic 'non-linear mechanics'. Bogolyubov found methods to asymptotically integrate non-linear equations modelling oscillating systems\n[\n52\n]\n:-\nA number of papers by Bogolyubov are concerned with a rigorous justification of the asymptotic methods of non-linear mechanics. By applying the\nPoincaré\n-\nLyapunov\ntheory and the\nPoincaré\n-\nDenjoy\ntheory on trajectories on a torus, he examined the nature of the exact stationary solution in the vicinity of an approximate solution for a sufficiently small value of the parameter and proved theorems on the existence and stability of quasi-periodic solutions.\nTheir work was published in Russian in the monograph\nIntroduction to Non-linear Mechanics\n(1937)\n, and in\n1943\nan English version appeared, translated from the Russian by\nSolomon Lefschetz\n.\nNorman Levinson\nbegins a review as follows:-\nThe major portion of the monograph is a condensation of a book by the two authors devoted to a systematic treatment of problems of practical interest. The treatment is so oriented as to be readily available to the engineer or physicist. In fact, rigor is entirely subordinated to the objective of making the material as widely available as possible. Examples of physical systems are given which lead to the type of equation considered in the monograph. Moreover, general statements of methods for solving equations are illustrated by the explicit solution of examples.\nHe ends by writing:-\nLefschetz\nhas performed a considerable service in making this work of\nKrylov\nand Bogolyubov available now.\nThe move towards mechanics was for Bogolyubov a step on a road which led to theoretical physics where he made many deep contributions. However, his career was interrupted by World War II. In June\n1941\nGerman armies began a rapid advance into Ukraine and Kiev was bombed. In July the Soviets evacuated the skilled workers to the east and Bogolyubov was evacuated to Ufa in Bashkortostan. There he became head of the Department of Mathematical Analysis at Ufa State Aviation Technical University and he also taught at the Ufa Pedagogical Institute. He remained at Ufa until August\n1943\nwhen he went to Moscow. On\n1\nNovember\n1943\nhe accepted a position in the Department of Theoretical Physics at Moscow State University where he worked on the theory of stochastic processes. He published the important monograph\nProblems of dynamical theory in statistical physics\n(\nRussian\n)\nin\n1946\n. During years\n1946\nto\n1949\nhe was dean of the Faculty of Mechanics and Mathematics of Kiev State University. In\n1947\nhe became head of the Department of Theoretical Physics, a new Department at the\nSteklov\nMathematical Institute in Moscow. The main research area in the Department was quantum field theory, in particular there was an emphasis on developing necessary mathematical methods. Bogolyubov, in joint work with other researchers in the Department, published papers such as\nTheory of Quantized Fields\n(1957)\n,\nProblems of the Theory of Dispersion Relations\n(1958)\nand\nAxiomatic Approach in Quantum Field Theory\n(1969)\n. In January\n1953\nhe was appointed as Head of Theoretical Physics at Moscow State University.\nBogolyubov founded the Laboratory of Theoretical Physics in the Joint Institute for Nuclear Research in\n1956\nat Dubna. He became the first director of the laboratory which today is called the Bogolyubov Laboratory of Theoretical Physics. CERN, the European Organization for Nuclear Research, was founded in\n1954\n. In\n1958\nBogolyubov, in his role as Director of the Laboratory of Theoretical Physics, suggested that there should be systematic exchanges of scientists between the Joint Institute for Nuclear Research and CERN. This idea was given impetus at an informal meeting on international co-operation in the field of high-energy accelerators held at CERN in\n1959\n, which was attended by leading scientists from the United States, the USSR and other western European countries. In\n1966\nhe was appointed as Director of the Joint Institute for Nuclear Research, a role he held until\n1988\n.\nIn\n1957\nBogolyubov published\nIntroduction to quantum field theory\n(\nRussian\n)\ncoauthored with Dmitrii V Shirkov. Arthur Wightman begins a review of the book as follows:-\nThe book is an introduction to the formalism of the quantum theory of fields. Applications to specific physical problems are described only to illustrate the fundamental ideas of the theory. As in all recent efforts of this kind, the authors have had the choice between a mathematically rigorous exposition which would cover very little of what physicists regard as important or a more formal account. The authors have clearly chosen the latter. Although they make considerable effort to describe the theory in a coherent fashion, they do not permit themselves the luxury of ignoring matters which are physically important merely because they are, as yet, mathematically ill defined.\nThe International Congress of Mathematicians was held in Edinburgh in\n1958\nand Bogolyubov\n(\njointly with\nVasilii Vladimirov\n)\ngave one of the plenary addresses\nOn some mathematical problems of quantum field theory\n. Arthur Wightman also reviewed the address:-\nThis address is a clear exposition of some problems of the theory of distributions and analytic functions which have arisen in quantum field theory, especially in dispersion theory. The subjects treated include the multiplication of distributions, and the edge of the wedge theorem and its generalizations.\nThis was not the only connection Bogolyubov had with the International Congress of Mathematicians, for he was a member of the committee in charge of awarding the\nFields medals\nat the\n1982\nCongress held in Warsaw.\nYu A Mitropolskii\nand S V Tyablikov give an example of Bogolyubov's scientific style in\n[\n44\n]\n:-\nPerhaps the example of the theory of superconductivity illustrates most clearly one more feature which is very characteristic of Bogolyubov's scientific style. The most important problems of contemporary theoretical physics are characterized, as a rule, by exceptional mathematical complexity. As a result of this, even if no deficiencies of principle exist in the foundations of the theory, in a number of cases the computational difficulties are so great that they may transcend into difficulties of principle; this, in particular, is the situation in the non-relativistic many-body problem. In solving problems of this type it is exceedingly important to provide the degree of rigor required for the correct solution of these problems. It is just such an ability, bordering on art and based on brilliant physical and mathematical intuition, which is the outstanding characteristic of Bogolyubov's scientific creative activity.\nThe authors of\n[\n23\n]\nalso describe Bogolyubov's style of science and his interaction with students and colleagues:-\nBogolyubov brought up a whole generation of mathematicians and theoretical physicists. Many famous scientists respectfully and proudly call him their teacher. The organic welding together of mathematics and physics compels everyone who studies the works of Bogolyubov to recall those times when the representatives of the exact sciences were simply called natural philosophers. This is where we see the Bogolyubov trait of scientific style: to globally appraise the character of the problem and to establish its principal solubility, and then, without being held back by difficulties, to create an adequate mathematical apparatus for solving this problem\n(\nthis is where we come across\nHilbert\n's \"wir mussen wissen, wir werden wissen\"\n)\n. All this enabled Bogolyubov to establish large scientific schools of non-linear mechanics, mathematical physics, and theoretical physics.\nOne aspect of Bogolyubov's work which we have not mentioned yet is his activities in the secret city for nuclear research and nuclear arms production named Arzamas-\n16\n.\nVladimirov\nwrites\n[\n59\n]\n(\nsee also\n[\n60\n]\n)\n:-\nAt the beginning of\n1950\nthe government of the USSR sent Bogolyubov to work at an ultra-secret site based in the Sarov monastery, known as the Volga Central Administrative Office of Urban Construction of the USSR, or KB-\n11\n, to provide mathematical support for the group of theoretical physicists led by I E Tam and A D Sakharov, who were then working on the first variant of the hydrogen bomb ... Bogolyubov and his students organized the mathematical section at this site. ... The team had to be pioneers and to work very quickly under the vigilant eye of the KGB. The enormous erudition and talent of Bogolyubov came in very handy! ... Bogolyubov himself completed a series of brilliant papers on the theory of stability of a plasma in a magnetic field and on the theory and applications of the kinetic equations, and he began his construction of axiomatic quantum field theory. A successful test of the RDS-\n6\ntook pace on\n12\nAugust\n1953\n. Bogolyubov was sent to the steppes of Kazakhstan for the tests. ... Bogolyubov worked at that site for over three years; he was then just over\n40\n. It was a romantic and very fruitful and creative period in his life; on the one hand, it was life behind barbed wire in a monastery with all the difficulties and impositions of the regime, and on the other hand there was the enormous responsibility for the work entrusted to him.\nBogolyubov received many honours for his outstanding contributions to mathematics and theoretical physics. He was awarded the Lenin Prize in\n1958\n:-\n... for his research into the microscopic theory of superconductivity and quantum field theory.\nHe received the State Prize of the USSR on three occasions\n(1947\n,\n1953\n,\n1984)\n; that in\n1953\nwas for taking part in the creation of the USSR's first hydrogen bomb. He was also awarded the\nLavrent'ev\nPrize and Medal, the Dannie Heineman Prize for Mathematical Physics from the American Physical Society and the American Institute of Physics\n(1966)\n, and six times he received an Order of Lenin. He was presented with the Order of the October Revolution, and two Orders of the Red Banner of Labour. For distinguished service Bogolyubov was awarded the Gold Star of Hero of Socialist Labour in\n1969\nand again ten years later. He received the A P Karpinski Prize established by the Alfred Tepfer Fund of Hamburg, Germany, the\nDirac\nMedal\n(1992)\n, the\nMax Planck\nGold Medal from the Germany Physical Society\n(1973)\n, and the\nBenjamin Franklin\nGold Medal from the Franklin Institute, Philadelphia, United States\n(1974)\n:-\n... for Mathematical Methods in Nonlinear Mechanics.\nHe was awarded the M V Lomonosov Gold Medal of the\nUSSR Academy of Sciences\n(1985)\n:-\n... for outstanding achievements in mathematics and theoretical physics.\nHe was elected to membership of the\nUkrainian Academy of Sciences\nand the\nUSSR Academy of Sciences\nas well as to foreign membership of academies around the world. Not only was Bogolyubov honoured by receiving many prizes, he has also been honoured by having several prizes named for him. For example the Joint Institute for Nuclear Research awards the Bogolyubov Prize for outstanding contributions to theoretical physics and applied mathematics. It also awards a Bogolyubov Prize for Young Scientists. The\nUkrainian Academy of Sciences\nalso awards a Bogolyubov Prize for outstanding contributions to theoretical physics and applied mathematics.\nWe note that several of the authors of articles written as a tribute to Bogolyubov\n(\nwhich we list in the references\n)\nhad been his students. These include\nYurii A Mitropolskii\n, Dmitry V Shirkov, Mikhail K Polivanov, Sergei V Tyablikov,\nVasilii S Vladimirov\n, and Dmitry N Zubarev. N N Bogolyubov\n(\nJr\n)\n, an author of\n[\n15\n]\n, is Bogolyubov's son who is a leading scientist, working in similar areas of mathematical physics as his father.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}