{
  "nome_completo": "Nikoloz Muskhelishvili",
  "nome_curto": "Nikoloz Muskhelishvili",
  "ano_nascimento": "1891",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Muskhelishvili/",
  "lugar_nascimento": "Tiflis, Russian Empire (now Tbilisi, Georgia)",
  "lugar_morte": "Tbilisi, Georgia",
  "biografia": "Nikoloz Muskhelishvili\nwas known to many as Niko. He was also known by the Russian version of his name, namely Nikolay Ivanovich Muskhelisvili. His father, Ivan Levanovich Muskhelisvili, was a General in the Engineering Corps of the Imperial Russian Army but his ancestors were well-known historians of Georgia\n[\n20\n]\n:-\nIvan Levanovich had a great interest in the exact sciences and clearly foresaw the significant role they were to play in the development of civilisation in the twentieth century. He also had interesting ideas on the education of children and spent a good deal of time teaching his own children, particularly Niko whose mathematical ability he recognised at an early age. Muskhelishvili speaks about his father with great warmth and affection and in dedicating his 'Course of Theoretical Mechanics\"\n(1926)\nto him he describes him as his first great teacher. Muskhelishvili's mother, too, was a person of culture as well as charm. Altogether it was a remarkable family well-known in Georgia.\nMuskhelishvili's mother, mentioned in the above quote, was Daria Saginashvili who taught languages. Daria was the only child of Alexandre Saginashvili and his wife Elizabed Chavchavadze. Elizabed was the sister of Ilia Chavchavadze, a famous Georgian writer who was canonized by the Georgian Orthodox Church in\n1987\nas \"St Ilia the Righteous.\"\nNiko's childhood was spent in the village of Matsevani, near Tbilisi. After attending an elementary school, he entered the Second Tbilisi Classical Gymnasium in\n1901\n. He spent eight years at this secondary school, graduating in\n1909\n. Later in the same year he entered the Faculty of Physics and Mathematics of the University of St Petersburg. Among his teachers at university was the Professor of Mechanics\nAleksei Nikolaevich Krylov\nwho was so impressed with the young Muskhelishvili that he said to a colleague, \"Mark the name Muskhelishvili; it is one you will hear often in the future!\" Muskhelishvili graduated with a first degree in\n1914\nand continued his studies at St Petersburg in the Department of Mechanics, preparing for a professorship. There he worked with\nGury Vasilievich Kolosov\nwho worked on the theory of elasticity and had discovered formulas expressing the components of the stress tensor and the displacement vector in terms of two analytic functions of one complex variable which he had published in his\n1909\npaper\nAn application of the theory of functions of a complex variable to a planar problem in the mathematical theory of elasticity\n(\nRussian\n)\n. Muskhelishvili soon was making important contributions to this area.\nHis first paper was\nOn the equilibrium of circular elastic discs\n(\nRussian\n)\n(1915)\nwritten in collaboration with\nKolosov\n[\n21\n]\n:-\nThis gives the first explicit solution for the fundamental boundary problem of plane elasticity for circular regions. Muskhelishvili then pursued systematic investigations on this subject and published a series of articles devoted to various boundary problems of the plane theory of elasticity and to other problems of mathematical physics.\nHis next papers were\nOn heat stresses in the plane problem of the theory of elasticity\n(\nRussian\n)\n(1916)\n,\nOn the definition of harmonic functions by means of data on a contour\n(\nRussian\n)\n(1917)\nand\nSur l'integration de l'équation biharmonique\nⓉ\n(\nOn the integration of the biharmonic equation\n)\n(1917)\n.\nBefore these papers were published, Muskhelishvili was working as an assistant at the St Petersburg Electrotechnical Institute where he was appointed in\n1915\n. He worked there until\n1918\nbut already in\n1917\nhe was also appointed as an assistant at St Petersburg University. Note that here we are using the name St Petersburg but, in\n1914\nSt Petersburg was renamed Petrograd. It was renamed again in\n1924\nwhen it became Leningrad, but today it has returned to the original name of St Petersburg. During these years in St Petersburg he taught in several institutions in addition to the University.\nAfter the Russian Revolution of February\n1917\nGeorgia was ruled from St Petersburg but in May\n1918\nthey set up an independent state. Georgia's independence was recognized by the Allies in January\n1920\nand there was a request to Muskhelishvili to return to his native country and help set up the state educational system. He left St Petersburg in\n1920\nand took up an appointment at Tbilisi State University. In addition to his appointment at Tbilisi State University, in\n1921\nhe was appointed as a docent at Tbilisi Technical Institute. The independence of Georgia, however, was short lived for in early\n1921\nthe Red Army entered Georgia and installed a Soviet regime.\nOn the staff at Tbilisi State University when Muskhelishvili was appointed in\n1920\nwas the Georgian mathematician George Nikoladze\n(1888\n-\n1931)\nwhom he had known while working in St Petersburg. We will give some details of Nikoladze and his family since Muskhelishvili married his sister Tamara. Nikoladze had studied at the First Tbilisi Classical Gymnasium\n(1898\n-\n1906)\nand the St Petersburg Technological Institute\n(1906\n-\n1913)\n. He had been appointed to Tbilisi State University in\n1918\n. We note that ten years later he was awarded a Diplome de Docteur ès Sciences Mathématiques from the Faculté des Sciences in Paris. Nikoladze's parents were Niko Iakovlevich Nikoladze\n(1843\n-\n1928)\n, a leading Georgian and Russian political activist, thinker and journalist, and Olga Aleksandrovna Nikoladze\n(1855\n-\n1940)\n. He had an older sister Rusudana Nikolaevna Nikoladze\n(1884\n-\n1981)\nand a younger sister Tamara Nikolaevna Nikoladze\n(1892\n-\n1939)\n. The family were living in St Petersburg\n(\nnamed Petrograd at this time\n)\nwhen the Russian Revolution broke out in February\n1917\n[\n7\n]\n:-\nConsidering the political orientation of the family, it is hardly surprising that they greeted the news of the February Revolution with enthusiasm. Within days, Rusudana and her younger sister, Tamara, offered their services to the newly-formed Petrograd Soviet, and in the following weeks they worked eight-hour shifts every day inside the Tauride Palace as telephone operators on the lines designated for the Soviet's leaders. Even more important, the sisters took part in the work of the Society for the Study of the Russian Revolution ...\nIn\n1922\nMuskhelishvili published his first monograph, choosing to write it in French, the important book\nApplications des intégrales analogues à celles de Cauchy á quelques problèmes de la physique mathématique\nⓉ\n(\nApplications of integrals similar to those of Cauchy to some problems of mathematical physics\n)\n. At this time Russian mathematicians thought that books which were aimed at an international audience should be written in French. In fact eventually English took over that position rather than French. In the same year that this monograph was published, Muskhelishvili became a professor at Tbilisi State University. He published\nSur l'équilibre des corps élastiques soumis à l'action de la chaleur\nⓉ\n(\nOn the equilibrium of elastic bodies subjected to the action of heat\n)\n(1923)\n,\nThe solution of an integral equation encountered in the theory of black body radiation\n(\nRussian\n)\n(1924)\nand in\n1925\nhe published, jointly with George Nikoladze and Archil Kirillovich Kharadze\n(1895\n-\n1976)\n, a dictionary of Russian-Georgian, Georgian-Russian mathematical terms. Around the time he published this book with George Nikoladze, he married his sister Tamara Nikolaevna Nikoladze; they had a son Guram. Despite the mathematical background of both sides of his family, Guram chose not to become a mathematician. Muskhelishvili was not unhappy about this and said, \"every person should choose his own scientific direction.\"\nLet us look at three different aspects of Muskhelishvili's contributions, namely the areas of his research, his monographs and textbooks, and his contributions to the development of mathematics and science in Georgia.\nWe have already seen some of the areas that Muskhelishvili worked on in the early part of his career, particularly on plane problems of the theory of elasticity. In fact this was the area in which he produced the largest number of papers. The second area on which his research concentrated was on the problems of torsion and bending of homogeneous and heterogeneous bars where he obtained fundamental results. A third area was on boundary problems for harmonic and biharmonic functions while a fourth was the study of singular integral equations and boundary problems for analytic functions\n[\n21\n]\n:-\nIn a series of articles Mushkelishvili worked out a method of solving a variety of boundary problems for analytic functions of a single complex variable. These problems, which were posed by\nRiemann\nand\nHilbert\n, have been studied by many mathematicians. Up to the time of Mushhelishvili's work the problems were studied for the most part for domains bounded by smooth closed curves. One must mention above all the fundamental investigations of\nHilbert\nhimself. However, the solution of\nHilbert\n's problem for a single closed contour was first obtained in an explicit form by the Soviet mathematician F D Gakhov. In the works of Muskhelishvili formulae were obtained expressing the solution of\nHilbert\n's boundary problem for a plane when there are a finite number of discontinuities along a broken curve. The results obtained were applied to the theory of singular integral equations on broken contours .These results have important applications in technical and physical problems.\nAnother of Mushhelishvili's major contributions was the monographs and textbooks that he published. We have already mentioned his\n1912\nbook\nApplications des intégrales analogues à celles de Cauchy á quelques problèmes de la physique mathématique\nⓉ\n(\nApplications of integrals similar to those of Cauchy to some problems of mathematical physics\n)\n. The editors of\nSoviet Applied Mathematics\nwrite in\n[\n18\n]\n(\nwe have modified the quote by adding the titles of the books\n)\n:-\nOne of his great accomplishments was the writing of textbooks on theoretical mechanics\n[\n'Theoretical Mechanics Part\n1\n, Statics'\n(\nRussian\n)\n(1933)\nand 'Theoretical Mechanics Part\n2\n, Kinematics'\n(\nRussian\n)\n(1932)]\nand analytic geometry\n[\n'Lectures on Analytical Geometry Presented at Tiflis Polytechnic Institute'\n(\nRussian\n)\n(1922)\n, 'Course in Analytic Geometry Part\n1\n, Course in Analytic Geometry in Vector Formulation'\n(\nRussian\n)\n(1933)\n, 'Course in Analytic Geometry Part\n2\n'\n(\nRussian\n)\n(1934)\n, 'Course in Analytic Geometry'\n(\nRussian\n)\n(1939)\n, 'Course in Analytic Geometry'\n(\nGeorgian\n)\n(1951)\n, 'Course in Analytic Geometry'\n(\nChinese\n)\n(1955)]\n, and also the production of a Russian-Georgian dictionary of mathematical terminology\n[(1925)\nmentioned above\n]\n. In\n1933\nhe published a fundamental monograph, 'Some Fundamental Problems in the Mathematical Theory of Elasticity'\n(\nRussian\n)\n[\nFirst edition\n1933\n, Second edition\n1935\n, Third edition\n1949\n, Fourth edition\n1954\n, Firth edition\n1966)]\n. This book marks an epoch in the development of the mathematical theory of elasticity; up to the present time it has gone through four editions and has been translated into English\n[(1963)]\n, Romanian\n[1956]\n, and Chinese\n[1958]\n. For the second edition of this monograph N I Muskhelishvili, in\n1941\n, was awarded the State Prize of the USSR of the first order. His second well-known monograph 'Singular Integral Equations, Boundary-Value Problems in the Theory of Functions, and Some Applications to Mathematical Physics'\n(1946\n,\n1962\n,\n1968)\n, went through three editions and was translated into English\n[(1953)]\n. The first edition of this book was awarded the State Prize of the USSR of the second order.\nPerhaps his greatest contribution to the development of mathematics and science in general in Georgia was his work for the\nGeorgian Academy of Sciences\n. He was the person who declared the opening of the Academy at its first meeting on\n27\nFebruary\n1941\n. He was its first President and for\n31\nyears he remained the President of the Academy contributing not only to the mathematical work of the Academy but in the role of President he also had a major impact on the development of Georgian science in general. Of course, the first years of the Academy were during World War II and Muskhelishvili organised the Academy to undertake work on national defence.\nFor more information on Muskhelishvili's contribution as President of the\nGeorgian Academy of Sciences\n, see our English translation of\n[\n12\n]\nat\nTHIS LINK\n.\nOn\n4\nOctober\n1957\nthe Soviet Union launched Sputnik\n1\n, the first artificial earth satellite. It circled the earth every\n96\nminutes in an elliptical orbit which took it a maximum distance of\n940\nkm from the earth and a minimum distance of\n230\nkm. Naturally the Soviet Union was very proud of this achievement and the newspaper \"Pravda\" reported at length. For many this brought Muskhelishvili's name to most Soviet citizens since \"Pravda\" noted that \"theoretical work by Nikolay Ivanovich Muskhelishvili has made a fundamental contribution to this great victory.\"\nMuskhelishvili had several major university roles: Dean of the Polytechnical Faculty of Tbilisi University\n(1926\n-\n28)\n; Pro-Rector of the Georgian Polytechnical Institute\n(1928\n-\n30)\n; Director of Mathematical, Physics and Mechanical Institute of Tbilisi State University\n(1933\n-\n35)\n; and Dean of Faculty of Physics and Mathematics of Tbilisi State University\n(1933\n-\n36)\n. He was President of the\nGeorgian Academy of Sciences\n(1941\n-\n72)\nand then Honorary President of\nGeorgian Academy of Sciences\n(1972\n-\n76)\n. He was a Member of the Bureau of the International Union of Theoretical and Applied Mechanics\n(1960\n-\n76)\n.\nMany honours were given to Muskhelishvili for his outstanding achievements. He was also an academician and honorary professor of the\nArmenian Academy of Sciences\n(1961)\nand the Azerbaijani Academy of Sciences\n(1961)\n, an honorary member of the\nBulgarian Academy of Sciences\n(1952)\n, an honorary member of the\nPolish Academy of Sciences\n(1960)\nand an honorary member of the\nBerlin Academy of Science\n(1967)\n. In\n1969\nhe was awarded the International prize of\nTurin Academy of Sciences\n\"Modesto Panetti\". In\n1970\nhe was awarded the Gold Medal of the\nCzechoslovak Academy of Sciences\nand, in the same year, he was awarded the Order of \"Cyrill and Mephodius\" of the first degree by the\nBulgarian Academy of Sciences\n. In\n1972\nhe was awarded M V Lomonosov's Gold Medal. Muskhelishvili received five Orders of Lenin in the years\n1941\n,\n1952\n,\n1961\n,\n1966\nand\n1975\n. In\n1944\nhe received the Order of the Red Banner for services in training specialists in improving the national economy and the national culture. In\n1944\nhe was awarded the military Medal \"For Defence of Caucasus\" and in\n1946\nthe Medal \"For Valiant Labour in Great Patriotic War\n1941\n-\n1945\n\". We mentioned above his contribution to the launching of Sputnik\n1\nand in\n1961\nhe received a Medal for his contribution to the launching of the first artificial satellite. In\n1971\nhe received the Order of October Revolution.\nMuskhelishvili retired when he reached the age of\n80\n. He died five years later and was buried at the Mtatsminda Pantheon of Writers and Public Figures in Tbilisi.\nThe article\n[\n12\n]\ngives further information about Muskhelishvili, particularly his contributions to the\nGeorgian Academy of Sciences\nand his personality, and we give an English translation of it at\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}