{
  "nome_completo": "Nora Isobel Calderwood",
  "nome_curto": "Nora Calderwood",
  "ano_nascimento": "1896",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Calderwood/",
  "lugar_nascimento": "Blairgowrie, Perthshire, Scotland",
  "lugar_morte": "Selly Oak, Birmingham, Warwickshire,England",
  "biografia": "Nora Calderwood\nwas born in Blairgowrie, Perthshire, where her father Daniel Scott Calderwood was headmaster of Blairgowrie Public School. The family moved to Edinburgh when Daniel Calderwood was appointed as headmaster of the Church of Scotland Normal School in Edinburgh, and all Nora's education was in Edinburgh. The family lived at\n8\nArgyle Place. She attended James Gillespie's School for six years from the age of five, entering the school in\n1901\n. On\n13\nJuly\n1907\nCalderwood was awarded a bursary by the Edinburgh Burgh Committee on Secondary Education. She then began her studies at Edinburgh Ladies' College, which she attended from\n1907\nto\n1914\n. She was in the same class as\nAnnie Numbers\n.\nCalderwood was very musical and in\n1910\n, at age\n14\n, she passed Higher Piano. In March\n1913\nshe passed Lower Drawing and Higher English in the Scottish Leaving Certificate examinations, passing Mathematics, French, Latin, and Science at Higher level in the following March. In July\n1913\nEdinburgh Ladies College presented a gold medal to Calderwood as the dux of the music classes. Then in July\n1914\nshe was awarded the Prize presented to the best Science scholar\n(\nwhich she resigned\n)\n, the Prize presented to the best Arithmetician\n(\nnot also the winner of the Stewart's College Club prize\n)\n, which she also resigned, and the Corstorphine Prize presented to the best mathematician.\nHaving passed the Preliminary Examination in October\n1914\n, Calderwood matriculated at the University of Edinburgh. She took the following courses:\n1914\n-\n15\n-\n1\nst\nMathematics, and Latin;\n1915\n-\n16\n-\n2\nnd\nMathematics, Natural Philosophy, and Chemistry;\n1916\n-\n17\n- Intermediate Honours Mathematics;\n1917\n-\n18\n- Intermediate Honours Natural Philosophy, and Advanced Honours Mathematics;\n1918\n-\n19\n- Advanced Honours Mathematics. She graduated with a B.Sc.\n(\nPure\n)\nin\n1919\n, then after studying Political Economy in\n1919\n-\n20\nshe was awarded an M.A. on\n26\nMarch\n1920\n.\nAfter graduating, Calderwood went to Birmingham University where she became a Lecturer in Mathematics in the following year. She studied for her Ph.D. under the supervision of\nAlexander Aitken\nand was awarded a doctorate for her thesis\nResearches in the Theory of Matrices\nfrom the University of Edinburgh in\n1931\n. She continued to teach at Birmingham until\n1963\nwhen she retired. During her last years in post she was teaching mathematics to chemical engineers.\nCalderwood joined the\nEdinburgh Mathematical Society\nin January\n1919\nwhile she was still an undergraduate at Edinburgh University. In\n1922\nshe also became a member of the\nLondon Mathematical Society\n.\nCalderwood never married. She was an accomplished pianist, to the point of giving concerts in the Barber Institute in Birmingham.\nAt Birmingham University there is a Calderwood Prize, named after Nora Calderwood, for the best student in algebra.",
  "math_areas": []
}