{
  "nome_completo": "Norbert Wiener",
  "nome_curto": "Norbert Wiener",
  "ano_nascimento": "1894",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wiener_Norbert/",
  "lugar_nascimento": "Columbia, Missouri, USA",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "Norbert Wiener\n's father was Leo Wiener who was a Russian Jew. Because Leo Wiener was such a major influence on his son, we should give some background to his education and career. Leo Wiener attended medical school at the University of Warsaw but was unhappy with the profession, so he went to Berlin where he began training as an engineer. This profession seemed only a little more interesting to him than the medical profession, and he emigrated to the United States having first landed in England. We should note that throughout his education Leo was interested in mathematics and, although he never used his mathematical skills in any jobs he held, it was a deep amateur interest to him all through his life.\nArriving in New Orleans in\n1880\n, Leo tried his hand at various jobs in factories and farms before becoming a school teacher in Kansas City. He progressed from being a language teacher in schools to becoming Professor of Modern Languages at the University of Missouri. While there he met and married Bertha Kahn, who was the daughter of a department store owner. Bertha, from a German Jewish family, was\n[\n7\n]\n:-\n... a small woman, healthy, vigorous and vivacious.\nShe joined her husband in the boarding house in Columbia, Missouri where their son Norbert was born in the following year.\nNot long after Norbert's birth a decision was taken to split the Modern Languages Department at the University of Missouri into separate departments of French and German. Leo was to join the German Department after the split but he lost out in some political manoeuvring so the family left Columbia and they moved to Boston. There Leo brought in money by taking a variety of teaching and other positions and eventually was appointed as an Instructor in Slavic Languages at Harvard. This did not pay well enough to provide for his family, so Leo kept various other positions to augment his salary. He remained at Harvard University for the rest of his career, being eventually promoted to professor.\nAs a young child Norbert had a nursemaid. When he was about four years old, a second child Constance was born; Wiener's second sister was born on\n1901\n. He writes in\n[\n7\n]\nabout his upbringing:-\nI was brought up in a house of learning. My father was the author of several books, and ever since I can remember, the sound of the typewriter and the smell of the paste pot have been familiar to me. ... I had full liberty to roam in what was the very catholic and miscellaneous library of my father. At one period or other the scientific interests of my father had covered most of the imaginable subjects of study. ... I was an omnivorous reader ...\nWiener had problems regarding his schooling, partly because the reading which he had done at home had meant that he was advanced in certain areas but much less so in others. His parents sent him to the Peabody School when he was seven years old and, after worrying about which class he should enter, had him begin in the third grade. After a short time his parents and teachers felt he would be better suited to the fourth grade and he was moved up a year. However, he certainly did not fit into the school in either grade and his teacher had little sympathy with so young a boy in the fourth grade yet lacking certain skills which would be expected the pupils at this stage in their education. He writes\n[\n7\n]\n:-\nMy chief deficiency was arithmetic. Here my understanding was far beyond my manipulation, which was definitely poor. My father saw quite correctly that one of my chief difficulties was that manipulative drill bored me. He decided to take me out of school and put me on algebra instead of arithmetic, with the purpose of offering a greater challenge and stimulus to my imagination.\nFrom this time on Wiener's father took over his education and he made rapid progress for so young a child. However, Wiener had problems relating to his movements and was obviously very clumsy. This stemmed partly from poor coordination but also partly for poor eyesight. Advised by a doctor to stop reading for six months to allow his eyes to recover, he still had regular lessons from his father who now taught him to do mathematics in his head. After the six months were up Wiener went back to reading but he had developed some fine mental skills during this period which he retained all his life.\nIn the autumn of\n1903\n, at age nine, he was sent to school again, this time to Ayer High School. The school agreed to experiment and to find the right level for Wiener who was soon put into senior third year class with pupils who were seven years older than he was. The school only formed part of his education, however, for his father continued to coach him. He graduated in\n1906\nfrom Ayer at the age of eleven and celebrated with his eighteen year old fellow students\n[\n7\n]\n:-\nI owe a great deal to my Ayer friends. I was given a chance to go through some of the gawkiest stages of growing up in an atmosphere of sympathy and understanding.\nIn September\n1906\n, still only eleven years old, Wiener entered Tufts College. Socially a child, he was an adult in educational terms so his student days were not easy ones. Although taking various science courses, he took a degree in mathematics. Wiener's father continued to coach him in mathematics showing complete mastery of undergraduate level topics. In\n1909\nWiener graduated from Tufts at age fourteen and entered Harvard to begin graduate studies.\nRather against his father's advice, Wiener began graduate studies in zoology at Harvard. However things did not go too well and by the end of a year a decision was taken, partly by Wiener partly by his father, that he would change topic to philosophy. Having won a scholarship to Cornell he entered in\n1910\nto begin graduate studies in philosophy. Taking mathematics and philosophy courses, Wiener did not have a successful year and before it was finished his father had made the necessary arrangements to return to Harvard to continue philosophy.\nBack at Harvard Wiener was strongly influenced by the fine teaching of\nEdward Huntington\non mathematical philosophy. He received his Ph.D. from Harvard at the age of\n18\nwith a dissertation on mathematical logic supervised by Karl Schmidt. From Harvard Wiener went to Cambridge, England, to study under\nRussell\nwho told him that in order to study the philosophy of mathematics he needed to know more mathematics so he attended courses by\nG H Hardy\n. In\n1914\nhe went to Göttingen to study differential equations under\nHilbert\n, and also attended a group theory course by\nEdmund Landau\n. He was influence by\nHilbert\n,\nLandau\nand\nRussell\nbut also, perhaps to an even greater degree, by\nHardy\n. At Göttingen he learned that\n[\n7\n]\n:-\n... mathematics was not only a subject to be done in the study but one to be discussed and lived with.\nWiener returned to the United States a couple of days before the outbreak of World War I, but returned to Cambridge to study further with\nRussell\n. Back in the United States he taught philosophy courses at Harvard in\n1915\n, worked for a while for the General Electric Company, then joined Encyclopedia Americana as a staff writer in Albany. While working there he received an invitation from\nVeblen\nto undertake war work on ballistics at the Aberdeen Proving Ground in Maryland. Taking about mathematics with his fellow workers while undertaking this war work revived his interest in mathematics. At the end of the war\nOsgood\ntold him of a vacancy at MIT and he was appointed as an instructor in mathematics.\nHis first mathematical work at MIT led him to examine\nBrownian motion\n. In fact, as Wiener explained in\n[\n7\n]\n, this first work would provide a connecting thread through much of his later studies:-\n... this study introduced me to the theory of probability. Moreover, it led me very directly to the periodogram, and to the study of forms of harmonic analysis more general than the classical\nFourier series\nand\nFourier\nintegral. All these concepts have combined with the engineering preoccupations of a professor of the Mathematical Institute of Technology to lead me to make both theoretical and practical advances in the theory of communication, and ultimately to found the discipline of cybernetics, which is in essence a statistical approach to the theory of communication. Thus, varied as my scientific interests seem to be, there has been a single thread connecting all of them from my first mature work ...\nHe attended the International Congress of Mathematicians at Strasbourg in\n1920\nand while there worked with\nFréchet\n. He returned to Europe frequently in the next few years, visiting mathematicians in England, France and Germany. Especially important was his contacts with\nPaul Lévy\nand with Göttingen where his work was seen to have important connections with\nquantum mechanics\n. This led to a collaboration with\nBorn\n.\nIn\n1926\nWiener married Margaret Engemann, and after their marriage Wiener set off for Europe as a Guggenheim scholar. After visiting\nHardy\nin Cambridge he returned to Göttingen where his wife joined him after completing her teaching duties in modern languages at Juniata College in Pennsylvania. Another important year in Wiener's mathematical development was\n1931\n-\n32\nwhich he spent mainly in England visiting\nHardy\nat Cambridge. There he gave a lecture course on his own contributions to the\nFourier\nintegral but Cambridge also provided a base from where he was able to visit many mathematical colleagues on the Continent. Among these were\nBlaschke\n,\nMenger\nand\nFrank\nwho invited him to make a visit, while he also met\nHahn\n,\nArtin\nand\nGödel\n.\nWiener's papers were hard to read. Sometimes difficult results appeared with hardly a proof as if they were obvious to Wiener, while at other times he would give a lengthy proof of a triviality.\nFreudenthal\nwrites\n[\n1\n]\n:-\nAll too often Wiener could not resist the temptation to tell everything that cropped up in his comprehensive mind, and he often had difficulty in separating the relevant mathematics neatly from its scientific and social implications and even from his personal experiences. The reader to whom he appears to be addressing himself seems to alternate in a random order between the layman, the undergraduate student of mathematics, the average mathematician, and Wiener himself.\nDespite the style of his papers, Wiener contributed some ideas of great importance. We have already mentioned above his work in\n1921\nin Brownian motion. He introduced a measure in the space of one dimensional paths which brings in\nprobability\nconcepts in a natural way. From\n1923\nhe investigated\nDirichlet\n's problem, producing work which had a major influence on\npotential theory\n.\nWiener's mathematical ideas were very much driven by questions that were put to him by his engineering colleagues at MIT. These questions pushed him to generalise his work on Browian motion to more general stochastic processes. This in turn led him to study harmonic analysis in\n1930\n. His work on generalised harmonic analysis led him to study Tauberian theorems in\n1932\nand his contributions on this topic won him the\nBôcher\nPrize in\n1933\n. He received the prize from the\nAmerican Mathematical Society\nfor his memoir\nTauberian theorems\npublished in\nAnnals of Mathematics\nin the previous year. The work on Tauberian theorems naturally led him to study the\nFourier\ntransform and he published\nThe Fourier Integral, and Certain of Its Applications\n(1933)\nand\nFourier Transforms\nin\n1934\n.\nWiener had an extraordinarily wide range of interests and contributed to many areas in addition to those we have mentioned above including communication theory, cybernetics\n(\na term he coined\n)\n, quantum theory and during World War II he worked on gunfire control. It is probably this latter work which motivated his invention of the new area of cybernetics which he described in\nCybernetics: or, Control and Communication in the Animal and the Machine\n(1948)\n.\nFreudenthal\nwrites in\n[\n1\n]\n:-\nWhile studying anti-aircraft fire control, Wiener may have conceived the idea of considering the operator as part of the steering mechanism and of applying to him such notions as feedback and stability, which had been devised for mechanical systems and electrical circuits. ... As time passed, such flashes of insight were more consciously put to use in a sort of biological research ...\n[\nCybernetics\n]\nhas contributed to popularising a way of thinking in communication theory terms, such as feedback, information, control, input, output, stability, homeostasis, prediction, and filtering. On the other hand, it also has contributed to spreading mistaken ideas of what mathematics really means.\nWiener himself was aware of these dangers and his wide dealings with other scientists led him to say:-\nOne of the chief duties of the mathematician in acting as an adviser to scientists is to discourage them from expecting too much from mathematics.\nSome of Wiener's publications which we have not mentioned include\nNonlinear Problems in Random Theory\n(1958)\n, and\nGod and Golem, Inc.: A Comment on Certain Points Where Cybernetics Impinges on Religion\n(1964)\n.\nWe have mentioned above\nFreudenthal\n's comments on Wiener's poor writing style. His most famous work\nCybernetics\ncomes in for special criticism by\nFreudenthal\n:-\nEven measured by Wiener's standards \"Cybernetics\" is a badly organised work -- a collection of misprints, wrong mathematical statements, mistaken formulas, splendid but unrelated ideas, and logical absurdities. It is sad that this work earned Wiener the greater part of his public renown, but this is an afterthought. At that time mathematical readers were more fascinated by the richness of its ideas than by its shortcomings.\nFreudenthal\n, in\n[\n1\n]\n, describes both Wiener's appearance and his character:-\nIn appearance and behaviour, Norbert Wiener was a baroque figure, short, rotund, and myopic, combining these and many qualities in extreme degree. His conversation was a curious mixture of pomposity and wantonness. He was a poor listener. His self-praise was playful, convincing and never offensive. He spoke many languages but was not easy to understand in any of them. He was a famously bad lecturer.\nD G Kendall\nwrites\n[\n3\n]\n:-\nAs a human being Wiener was above all stimulating. I have known some who found the stimulus unwelcome. He could offend publicly by snoring through a lecture and then asking an awkward question in the discussion, and also privately by proffering information and advice on some field remote from his own to an august dinner companion. I like to remember Wiener as I once saw him late at night in Magdalen College, Oxford, surrounded by a spellbound group of undergraduates, talking, endlessly talking.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Statistics"
  ]
}