{
  "nome_completo": "William Norrie Everitt",
  "nome_curto": "Norrie Everitt",
  "ano_nascimento": "1924",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Everitt/",
  "lugar_nascimento": "Birmingham, England",
  "lugar_morte": "Birmingham, England",
  "biografia": "Let us begin by explaining that\nWillian Norrie Everitt\nwas known as Bill in his younger days, and as an undergraduate he was \"Bill\". He used the name W N Everitt on most of his publications but he has a\n1984\npaper with his name given as Willian N Everitt although certainly from the mid\n1960\ns onwards he was known by his friends and colleagues in Dundee as Norrie. From\n1991\nonwards he has papers with his name given as W Norrie Everitt. The authors of this article knew him as Norrie and we will use that name throughout this biography. Norrie Everitt's parents were Charles Ernest Everitt, a shipping transport director born\n6\nMay\n1895\n, and Elizabeth Cloudsley Ross, born\n10\nJanuary\n1895\n. Charles and Lizzie were married on\n16\nJune\n1920\nat Mount Zion Congregational Church in Sheffield, Yorkshire. Norrie had an older sister Eileen M Everitt, born\n3\nFebruary\n1922\n.\nNorrie Everitt was educated at Kings Norton Grammar School in Birmingham. In\n1939\nCharles and Lizzie Everitt and their daughter Eileen were living at\n154\nAlcester Road South, Moseley, Birmingham. Eileen's occupation was given as junior clerk. At this time Norrie was fifteen years old, a school pupil, and living with Bernard F W Workman and his wife Edith M Mary Workman at\n179\nTredworth Road, Gloucester. The reason that he was living in Gloucester was due to World War II since the pupils in two Birmingham schools, George Dixon and Kings Norton Grammar School, had been evacuated to Gloucester. War was anticipated, evacuation plans had been made, and on\n1\nSeptember\n1939\nthey were put into operation. In Gloucester several schools were put on a half-day for their own pupils and the Birmingham pupils were educated in the other half-day. After about three months in Gloucester, pupils were sent back to Birmingham since there appeared to be little danger. In fact this was a mistake since Birmingham came under heavy bombing later in the war.\nAfter graduating from Kings Norton Grammar School, Everitt matriculated at the University of Birmingham where he studied electrical engineering. He graduated with first class honours in\n1944\nat the age of\n20\nand, with World War II still taking place, he was drafted into the armed forces. He was still in the forces in\n1947\nwhen he suffered a fractured spine and was told that there was a high chance he would never walk again. He proved the doctors wrong and his recovery was so complete that he was able to climb the Matterhorn at age\n25\n. He matriculated at Balliol College, Oxford, in\n1949\nto study mathematics and he was assigned to the tutor\nJack de Wet\n.\nJacobus Stephanus de Wet\n, always known as Jack, was educated at the University of Cape Town, the University of Oxford and then, for his Ph.D. in theoretical physics, he studied at Princeton in the United States. Awarded his doctorate in\n1940\nfor his thesis\nOn the Connection Between the Spin and Statistics of Elementary Particles\nhe taught at the University of Cape Town and the University of Pretoria before being appointed to Balliol College, Oxford, in\n1947\n.\nAfter the award of his M.A., Everitt continued to undertake research at Balliol College for his doctorate advised by\nEdward Charles Titchmarsh\n. Everitt was awarded a DPhil  in\n1955\nfor his thesis\nEigenfunction Expansions Associated with Fourth-Order Differential Equations\n. A paper based on the results of his thesis was\nThe Sturm-Liouville problem for fourth-order differential equations\n(1957)\n. The paper begins as follows:-\nIn this paper I consider the direct extension to fourth-order ordinary differential equations of the analysis of the\nSturm\n-\nLiouville\nproblem given in his book 'Eigenfunction expansions associated with second-order differential equations'\n(\nOxford,\n1946)\nby\nE C Titchmarsh\n. This type of problem has been considered, for general-order equations, by many writers\n[\nsee in particular\nG D Birkhoff\n, 'Boundary-value and expansion problems of ordinary differential equations'\n(1908)\nand\nJ Tamarkin\n, 'Some general problems of the theory of ordinary linear differential equations and expansion of an arbitrary function in a series of fundamental functions'\n(1927)]\n. Here we consider some of the explicit constructions for the eigenfunctions; the fact that equations of the fourth and higher order are occurring in mathematical physics suggests that such information might be useful. The method stems from a new representation of the\nGreen\n's function for a boundary-value problem. The method can be at once extended to equations of higher order and to more general boundary conditions than I consider here. Most of the information presented is taken from a D.Phil. thesis\n(\nMay,\n1955)\naccepted by the University of Oxford. In some places excessive details have been omitted but the results obtained are stated in full. ... The author wishes to express his gratitude to Professor\nE C Titchmarsh\n.\nThis paper, submitted in December\n1956\n, was not Everitt's first since he had submitted\nInequalities for Gram determinants\n(1957)\nin October\n1956\n.\nBefore the award of his D.Phil., Everitt had been appointed to the Royal Military College of Science in Shrivenham in\n1954\n. Also before the award of his D.Phil. he married Katharine Elisabeth Gibson\n(\nknown as Kit\n)\n. They had two sons, Charles Everitt\n(\nborn\n7\nJanuary\n1956)\nand Timothy Everitt\n(\nborn\n1957)\n. The family lived at\n39\nFaringdon Road, Abingdon, which was only\n12\nkm from Oxford and Everitt made the trip to Oxford on Friday afternoons to attend the analysis seminar at the University.\nEveritt published papers such as\nSome properties of Gram matrices and determinants\n(1958)\n,\nA note on positive definite matrices\n(1958)\n, I\nntegrable-square solutions of ordinary differential equations\n(1959)\n,\nOn a generalization of Bessel functions and a resulting class of Fourier kernels\n(1959)\n,\nOn the Hölder inequality\n(1961)\n,\nSelf-adjoint boundary value problems on finite intervals\n(1962)\n,\nIntegrable-square solutions of ordinary differential equations. II\n(1962)\n,\nTwo theorems in matrix theory\n(1962)\nand\nFourth order singular differential equations\n(1962)\n. This impressive list of high quality papers led to Everitt being appointed to the Baxter Chair of Mathematics, Queen's College, Dundee, in\n1962\n, taking up the post in the following year. The chair is named for the Baxter family who made their fortune from the jute mills of Dundee and gave money to found a college in the city in\n1881\n. When Everitt was appointed to Queen's College, Dundee, it was still a college of the University of St Andrews, and it remained as such until\n1\nAugust\n1967\nwhen the University of Dundee received its royal charter. Everitt delivered his inaugural lecture in\n1963\n, entitled 'The Spell of Mathematics'.\nBefore continuing with our biography of Norrie Everitt, let us give brief details of his sons. Charles Everitt was educated at Dundee High School, Edinburgh University and Balliol College Oxford. He was awarded a D.Phil. in history from the University of Oxford in\n1986\n. Received into the Roman Catholic Church in\n1989\nhe was ordained a priest in\n1994\n. He is now known as Father Gabriel and is currently Director of the Centre for Benedictine Education, Master of Studies at Ampleforth Abbey, and Librarian at St Benet's Hall, Oxford. Timothy Everitt was awarded a B.Sc. from the University of Aberdeen in\n1978\n, worked as an engineer for BP from\n1989\nto\n1993\n, and is now a consultant for Cults Telecom Services.\nFor nearly\n20\nyears Everitt was the Baxter Professor of Mathematics in Dundee. During this time he served twice as Head of Department,\n1963\n-\n1967\n, and\n1977\n-\n1980\n. One of his most significant contributions was the running of conferences on the 'Theory of Ordinary and Partial Differential Equations'. The first, held in Dundee from\n28\nto\n31\nMarch\n1972\n, had Proceedings published in the Springer Lecture Notes in Mathematics series with Norrie Everitt and\nBrian Sleeman\nas editors. They write in the Preface:-\nThese Proceedings form a record of the lectures delivered at the Conference on the Theory of Ordinary and Partial Differential Equations held at the University of Dundee, Scotland during the four days\n28\nto\n31\nMarch\n1972\n. The Conference was attended by\n140\nmathematicians from the following countries Belgium, Canada, Denmark, France, Germany, Ireland, Italy, The Netherlands, Poland, Sweden, Switzerland, the United Kingdom and the United States of America. ... The Conference was organised by the following committee: W N Everitt\n(\nChairman\n)\n, J S Bradley,\nB D Sleeman\nand I M Michael. Dr\nSleeman\nand Dr Michael acted as Organising Secretaries for the Conference.\nThe success of this conference led to it becoming the first in a series, and in\n1978\nthe fifth 'Ordinary and Partial Differential Equations Conference' was held in Dundee with Everitt as the sole editor of the Proceedings. He writes in the Preface:-\nThese Proceedings form a record of the plenary lectures delivered at the fifth Conference on Ordinary and Partial Differential Equations which was held at the University of Dundee, Scotland, UK during the period of three days Wednesday to Friday\n29\nto\n31\nMarch\n1978\n. The Conference was originally conceived as a tribute to Professor\nArthur Erdélyi\n, FRSE, FRS, to mark his then impending retirement from the University of Edinburgh. A number of his colleagues, including David Colton, W N Everitt, R J Knops, A G Mackie, and G F Roach, met in Edinburgh early in\n1977\nin order to make provisional arrangements for the Conference programme. At this meeting it was agreed that\nArthur Erdélyi\nshould be named as Honorary President of the Conference. A formal invitation to attend the Conference was issued to him in the autumn of\n1977\n, and this invitation\nArthur Erdélyi\ngladly accepted, expressing his appreciation for the thought and consideration of his colleagues. Alas, time, in the event, did not allow of these arrangements to come about;\nArthur Erdélyi\ndied suddenly and unexpectedly at his home in Edinburgh on\n12\nDecember\n1977\n, at the age of\n69\n. Nevertheless it was decided to proceed with the Conference; invitations had been issued to a number of former students, collaborators and friends of\nArthur Erdélyi\nto deliver plenary lectures. The Conference was held as a tribute to his memory and to the outstanding and distinguished contribution he had made to mathematical analysis and differential equations.\nThe seventh conference in the series took place in Dundee in March/April\n1982\n, and later that year Everitt left Dundee to take up an appointment at the University of Birmingham as Mason Chair and Head of the Department of Mathematics. He continued in this role until he retired at the age of\n65\nin\n1989\n. He did not leave Birmingham at this time, however, and continued to work at the University as an honorary Senior Research Fellow until September\n2009\n.\nIn Birmingham, Everitt continued to organise conferences and edit proceedings. For example he organised \"Inequalities\" in\n1987\n. Richard Hall writes in a review of the Proceedings\n[\n5\n]\n:-\nHardy\n,\nLittlewood\nand\nPólya\n's 'Inequalities' was published in\n1934\nand is still in print. Despite one or two curious omissions it is one of the classics of twentieth century mathematical literature. A\nLondon Mathematical Society\ninternational conference with the same title, and this book as its theme, was held at Birmingham University in the summer of\n1987\n, organised by Professor Norrie Everitt.\nHe wrote four important books after he retired. The first, with Lawrence Markus, was the monograph\nBoundary value problems and symplectic algebra for ordinary differential and quasi-differential operators\n(1999)\n. Anton Zetti writes in a review:-\nWith this monograph Everitt and Markus have produced a major advance in our understanding of the structure of self-adjoint boundary conditions for regular and singular linear ordinary differential equations of arbitrary order and with arbitrary deficiency index.\nFor a version of the Preface of this book, see\nTHIS LINK\n.\nThe second of these books, also written jointly with Lawrence Markus, was\nMulti-interval linear ordinary boundary value problems and complex symplectic algebra\n(2001)\n. Some of the chapter headings are: Introduction and organisation of results, Some definitions for multi-interval systems Complex symplectic spaces Single interval quasi-differential systems. Multi-interval quasi-differential systems. Boundary symplectic spaces for multi-interval systems. Finite multi-interval systems. Examples of complete Lagrangians.\nThe third book was\nElliptic partial differential operators and symplectic algebra\n(2003)\n, again written jointly with Lawrence Markus, as was the fourth,\nInfinite dimensional complex symplectic spaces\n(2004)\n. The authors write in an Abstract to this\n2004\nmonograph:-\nComplex symplectic spaces, defined earlier by the authors in their\nAmerican Mathematican Society\nMonograph, are non-trivial generalisations of the real symplectic spaces of classical analytical dynamics. These spaces can also be viewed as non-degenerate indefinite inner product spaces, although the authors here follow the lesser known exposition within complex symplectic algebra and geometry, as is appropriate for their prior development of boundary value theory. In the case of finite dimensional complex symplectic spaces it was shown that the corresponding symplectic algebra is important for the description and classification of all self-adjoint boundary value problems for\n(\nlinear\n)\nordinary differential equations on a real interval. In later\nAmerican Mathematical Society\nMemoirs infinite dimensional complex symplectic spaces were introduced for the analysis of multi-interval systems and elliptic partial differential operators. In this current Memoir the authors present a self-contained, systematic investigation of general complex symplectic spaces, and their Lagrangian subspaces, regardless of the finite or infinite dimensionality - starting with axiomatic definitions and leading towards general Glazman-\nKrein\n-\nNaimark\n(\nGKN\n)\ntheorems.\nThe authors of\n[\n4\n]\n(\nor\n[\n3\n]\nwhich is similar\n)\nwrite:-\nNorrie served on the\nLondon Mathematical Society\n(\nLMS\n)\nCouncil from\n1957\nto\n1962\n(\nhe was elected a member of the LMS on\n19\nDecember\n1957)\n, was elected a Fellow of the\nRoyal Society of Edinburgh\n(1966)\n, served as President of the\nEdinburgh Mathematical Society\n(1970\n-\n1971)\n, and as Vice President of the\nRoyal Society of Edinburgh\n(1970\n-\n1973)\n. In\n1978\n, he was part of the UK delegation to the\nInternational Mathematical Union\nin Helsinki. He made several trips behind the Iron Curtain to ensure the flow of mathematical ideas continued between the East and West. Norrie was a keen student of opera, British history, literature, poetry, trees, films, railroad history, the American West, and was an excellent after-dinner speaker. He had remarkable teaching and blackboard skills. Norrie began writing his well-prepared lectures in the upper left-hand corner of the board and ended his talk, on time, with his customary period\n(\n.\n)\nin the lower right-hand corner. As technology evolved, Norrie adapted and skilfully delivered Beamer-type presentations.\nEveritt died in\n2011\n, a month after his\n87\nth birthday. Lance Littlejohn, chairman of the Department of Mathematics at Baylor University, wrote:-\nNorrie Everitt: Superb teacher, remarkable mentor, wonderful colleague, and dear friend.\nThe conference \"Spectral analysis and differential equations, A memorial meeting to mark the life and work of  Professor W N Everitt\" was held at the University of Cardiff on the\n15\n-\n17\nMay\n2014\n. The announcement of the conference stated that Norrie Everitt:-\n... a distinguished expert in the field of spectral analysis and differential equations, was a widely acknowledged authority on the spectral theory of differential equations, and inequalities. He made many significant contributions to such topics as the\nTitchmarsh\n-\nWeyl\nm-function, the deficiency index problem, periodic problems, and the numerical computation of eigenvalues of\nSturm\n-\nLiouville\nproblems.\nEveritt's wife Kit died in\n2013\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}