{
  "nome_completo": "Ole Peder Arvesen",
  "nome_curto": "Ole Peder Arvesen",
  "ano_nascimento": "1895",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arvesen/",
  "lugar_nascimento": "Fredrikstad, Norway",
  "lugar_morte": "Trondheim, Norway",
  "biografia": "Ole Peder Arvesen\n's parents were Harald Arvesen\n(1861\n-\n1942)\n, a factory owner who was born in Tune on\n3\nFebruary\n1861\n, and Lydia Terjesen\n(1872\n-\n1903)\n. Ole had a younger brother Harald Gotfred Arvesen, born in Fredrikstad on\n11\nJune\n1898\n, and a younger sister Ellen Sofie Arvesen, born in Fredrikstad on\n9\nSeptember\n1896\n. Another sister, Gerda Karine Arvesen born in Kristiania on\n9\nSeptember\n1899\nappears to have died as a child.\nThis article is, with a few additions and modifications, a translation by Ane Maria Dohl of the Norwegian article\nOle Peder Arvesen\nby Dag Johnson in the\nNorsk biografisk leksikon\n[\n3\n]\n.\nArvesen's schooling was in Fredrikstad where he finished high school in\n1913\n, and after working at the foundry of a mechanical workshop in Fredrikstad for a few months, he travelled to Trondheim to study at the Norwegian Institute of Technology\n(\nNorges Tekniske Høgskole, known as NTH\n)\n, where he qualified as a structural engineer in\n1918\n. Ole Peder Arvesen dedicated most of his life to the NTH, at first actively engaged in the student community and later as a teacher for\n45\nyears.\nThe Norwegian Institute of Technology had been established in Trondheim in\n1910\nafter years of debate as to whether it should be founded there or in Kristiania. The factors which made Trondheim the choice were its central position, its high quality technical college, the Trondhjems Tekniske Læreanstalt, and a government decision to adopt a policy of creating infrastructure away from Kristiania. It was a polytechnic institute which mainly educated engineers and architects.\nIn\n1919\n, Arvesen was appointed as an assistant at the NTH working with reinforced concrete and stone bridges, but in\n1921\nhe moved on to teaching descriptive geometry, which he would continue doing for the rest of his life. He was appointed as a senior lecturer in\n1927\nand two years later he married. In June\n1929\n, Arvesen married Ingeborg Thallaug\n(1905\n-\n1955)\n, the only daughter of Axel Andreas Thallaug\n(1866\n-\n1938)\n, a lawyer, and Julie Louise Augusta Prytz\n(1877\n-\n1929)\n. Axel Thallaug had a distinguished career being mayor of Lillehammer for over ten years and a member of the Norwegian parliament for fourteen years. He served as a member of the Nobel Committee from\n1931\nto\n1933\n. Ingeborg had three elder brothers, Gulbrand, Haakon and Harald.\nAmong Arvesen's earliest publications on geometry are\nQuelques études sur la largeur des courbes\nⓉ\n(\nStudies on the width of curves\n)\n(1926)\n,\nOm grundlaeggelsen av den diskriptive geometri ved Monge\nⓉ\n(\nOn the foundations of descriptive geometry of Monge\n)\n(1928)\n,\nRemarque sur un théorème de Chasles\nⓉ\n(\nRemark on a theorem of Chasles\n)\n(1929)\n,\nSur un théorème de Duhamel\nⓉ\n(\nOn a theorem of Duhamel\n)\n(1931)\n, and\nUn théorème sur le rayon de courbure de certaines courbes de direction\nⓉ\n(\nA theorem on the radius of curvature of certain  direction curves\n)\n(1931)\n. For a list of more of Arvesen's mathematical publications see\nTHIS LINK\n.\nFrom\n1938\n, Arvesen was appointed to a professorship at the NTH which he held until he retired in\n1965\n. In\n1934\n, he had received a doctorate\n(\nequivalent to a D.Sc. or\nhabilitation\n)\nfor his thesis\nSur quelques propriétés des courbes algébriques, considérées comme des enveloppes de droites\non algebraic curves.\nArvesen's scientific production included two popular textbooks, one about nomography and one on descriptive geometry.\nInnføring i nomografi\nⓉ\n(\nIntroduction to nomography\n)\n, first published in\n1932\n, ran to three editions, the third in\n1961\n, while\nLaerebok i beskrivende geometri\nⓉ\n(\nTextbook on descriptive geometry\n)\n, first published in\n1948\n, ran to two editions, the second in\n1965\n. He also wrote numerous articles and shorter papers in Norwegian, German and French which reported on his research which essentially aimed to extend French classical works on descriptive geometry and subsequent research. Another of his valuable contributions was writing several biographies of famous mathematicians in\nMennesker og matematikere\nⓉ\n(\nPeople and mathematicians\n)\n(1940)\nand a book on European caricature\nGlimt av den store karikatur\nⓉ\n(\nGlimpses of the large caricature\n)\n(1941)\n. He also concerned himself with the Norwegian language debate and, during the\n1940\ns and\n1950\ns, he defended\nbokmål\n, one of the two written standards for Norwegian, against\nsamnorsk\n, an artificial combination of these two written standards. On this topic he published\nTre språk i Norge?\nⓉ\n(\nThree languages in Norway?\n)\nin\n1948\n.\nIn his autobiography,\nMen bare om løst og fast. Erindringer\nⓉ\n(\nBut just about this and that. Recollections\n)\npublished in\n1976\n, Arvesen talks about his numerous stays in Paris, and how he could enjoy French culture and science. He admired French wit and elegance and, in particular, their sharp-witted replies. This influenced him and gave him a distinctive aura. He was also the deputy chairman of the Alliance Française in Trondheim for a decade. It goes without saying that Arvesen was a professor who was able to convey valuable cultural notions to his students and who was a bridge between the two cultures.\nArvesen was a central figure in student circles and, in particular, played a major role in the Student Society in Trondheim. While still a student he was already very active, as a debater, as a committee member of the Student Society\n(\nhe was the president in\n1920)\n, and as a illustrator and editor of the student newspaper\nUnder Dusken\nfour times, the last one being in\n1945\n. When the students started their own book and stationery shop, they chose his suggestion as its name: \"Tapir\".\nAt the beginning of World War II, in April\n1940\n, German troops invaded Norway and by May they were in control of most of the country. At this time Arvesen was the treasurer of the Student Union. Despite the Germans' warnings, he managed to publish a few numbers of\nUnder Dusken\nand organised meetings of the Student Union, but was arrested and spent some time in the Falstad concentration camp. This concentration camp was used by the Germans mainly for detaining political prisoners from the end of\n1941\nuntil\n1945\n. After his release from Falstad, but still during the German occupation, Arvesen was responsible for the distribution of a total of\n27\ntons of food supplies to the staff of the NTH that had been sent as a gift from colleagues at the Danish Institute of Technology.\nArvesen was an outstanding lecturer, much loved by his students. When electronic calculating machines started entering universities and research institutes around\n1960\n, nomography became obsolete, as well as the slide rule, which Arvesen had been responsible for introducing to the new students. Descriptive geometry, which he had been teaching to thousands of students for more than\n40\nyears, was removed from NTH's courses in\n1965\n, the same year as Arvesen retired. He probably experienced this development with regret, but, nonetheless, he maintained contact with NTH and the Student Union for the rest of his life.\nArvesen's strong sense of formalities and tradition, as well as his stately figure, made him an ideal master of ceremonies, both for Trondheim municipality, and for the NTH and the Student Union. He also performed similar tasks at the Church Jubilees in\n1930\nand\n1953\nand during the blessing of King Olav V in the Nidaros Cathedral in\n1958\n.\nArvesen was a member of the\nRoyal Norwegian Academy of Science and Letters\nfrom\n1934\nand was its general secretary from\n1950\nto\n1966\n. He was also a member of the Norwegian Academy of Technological Sciences. He was appointed Knight of First Class of the Order of St Olav in\n1965\n, was a member of its council from\n1958\nand its Vice Chancellor from\n1967\nto\n1970\n.",
  "math_areas": [
    "Geometry"
  ]
}