{
  "nome_completo": "Oleksandr Mikolaiovich Sharkovsky",
  "nome_curto": "Oleksandr Mikolaiovich Sharkovsky",
  "ano_nascimento": "1936",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sharkovsky/",
  "lugar_nascimento": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "lugar_morte": null,
  "biografia": "Oleksandr Mikolaiovich Sharkovsky\n's name often appears in different forms. His first name sometimes transliterated as Aleksandr or Alexander while his family name is often given as Sharkovskii or Sarkovskii. He attended school in Kiev\n(\nnow often written as Kyiv\n)\nand in\n1952\n, as an\n8\nth\ngrade pupil, he won the Kiev Mathematical Olympiad competition. He attended his local university of Kiev, the Kiev State University named for the Ukrainian poet and artist Taras Shevchenko. As a first year student, he produced his first original mathematics results on the asymptotics of algebraic curves. This proved to be the beginning of an outstanding research career. He graduated with a Master's Degree from the Department of Mechanics and Mathematics of Kiev State University in\n1958\nand worked on his Candidate's thesis at the Institute of Mathematics at the Ukrainian branch of the\nUSSR Academy of Sciences\n. He was awarded his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nin\n1961\n. He had already published a number of high quality papers\n(\nall in Russian\n)\n, such as:\nNecessary and sufficient conditions for convergence of one-dimensional iterative processes\n(1960)\n,\nRapidly converging iterative processes\n(1961)\n,\nSolutions of a class of functional equations\n(1961)\n, and\nThe reducibility of a continuous function of a real variable and the structure of the stationary points of the corresponding iteration process\n(1961)\n.\nIn\n1961\nhe was appointed to the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev. He also taught at the University of Kiev from\n1967\nafter defending his doctoral dissertation\n(\nequivalent in standard to the D.Sc. or the\nhabilitation\n)\n. He was made head of the Department of Differential Equations at the Institute of Mathematics at the Ukrainian branch of the\nUSSR Academy of Sciences\nin\n1974\n. He worked towards the creation of a Department of the Theory of\nDynamical Systems\nin the Academy and, after it was founded, he became head of the department in\n1986\n.\nSharkovsky's main areas of interest are the theory of dynamical systems, the theory of stability and the theory of oscillations. He also works in the theory of functional and functional differential equations, and the study of difference equations and their application. He is perhaps best known for an important theorem on periodic orbits in one-dimensional dynamical systems which he proved in\n1964\n. He published this result, known today as Sharkovsky's Theorem, in the Russian paper\nCo-existence of cycles of a continuous mapping of the line into itself\n(1964)\n. Although the result did not attract a great deal of interest at the time of its publication, during the\n1970\ns other surprising results were proved which turned out to be special cases of Sharkovsky's theorem. The authors of\n[\n1\n]\n(\nin the translation\n[\n2\n]\n)\nwrite:-\nAny contemporary monograph or textbook on the theory of dynamical systems can hardly be imagined without the Sharkovsky theorem. This theorem laid the foundation of a new branch in the theory of dynamical systems - combinatorial dynamics. The Sharkovsky theorem led to the appearance of numerous works in this direction, where one can often encounter terms such as the Sharkovsky theorem, Sharkovsky order, Sharkovsky space, Sharkovsky set, Sharkovsky stratification, and maximum period in the sense of Sharkovsky.\nAround the same time Sharkovsky published papers\n(\nsome written in Russian, some in Ukrainian\n)\nsuch as:\nFixed points and the center of a continuous mapping of the line into itself\n(1964)\n,\nOn cycles and the structure of a continuous mapping\n(1965)\n,\nOn attracting and attracted sets\n(1965)\n,\nContinuous mapping on a set of w-limit points\n(1965)\n, and\nA classification of fixed points\n(1965)\n. The authors of\n[\n1\n]\n(\nin the translation\n[\n2\n]\n)\nwrite about his other contributions:-\nSharkovsky developed the foundations of the topological theory of one-dimensional dynamical systems, which is now one of the most efficient methods for studying various evolution problems. In particular, he investigated the relationship between the conditions of existence of periodic points with different periods and between the structure of the set of periodic points and the structure of attractors of trajectories. Furthermore, he investigated the topological structure of basins of attraction for various sets and deduced numerous criteria of simplicity or complexity of dynamical systems. Sharkovsky obtained fundamental results in the general theory of dynamical systems on arbitrary compact sets. In particular, he established the fundamental property, namely, incompressibility, of dynamical systems at attractors of trajectories. Sharkovsky also described types of global stability for almost all dynamical systems and established exact descriptive bounds for sets consisting of trajectories with different asymptotics. He showed that most of these upper bounds are attained even for one-dimensional dynamical systems. This fact implies that one-dimensional dynamical systems are, in a certain sense, as complex as dynamical systems in arbitrary spaces.\nSharkovsky has, in collaboration with others, written a number of important monographs. The book, written with G P Pelyakh,\nIntroduction to the theory of functional equations\n(\nRussian\n)\nwas published in\n1974\n. Alexandru Climescu writes in a review:-\nThe monograph is clearly written, but reading is sometimes weighed down by lengthy calculations.\nIn\n1986\n, in collaboration with Yu L Maistrenko and E Yu Romanenko, Sharkovsky published the Russian monograph\nDifference equations and their applications\n. The book contains four parts:\n(\nI\n)\nOne-dimensional dynamical systems;\n(\nII\n)\nDifference equations with continuous time ;\n(\nIII\n)\nDifferential-difference equations ; and\n(\nIV\n)\nBoundary-value problems for hyperbolic systems of partial differential equations. The authors write in the Preface:-\nThe aim of the present book is to acquaint the reader with some recently discovered and\n(\nat first sight\n)\nunusual properties of solutions to nonlinear difference equations. These properties enable us to use difference equations in order to model complicated oscillating processes\n(\nthis can often be done in those cases when it is difficult to apply ordinary differential equations\n)\n. Difference equations are also a useful tool in synergetics - an emerging science concerned with the study of ordered structures. The application of these equations opens up new approaches in solving one of the central problems of modern science - the problem of turbulence. Our presentation is mainly based on the modern theory of one-dimensional dynamical systems, interest in which has considerably grown recently.\nMarek Cezary Zdun writes in a review:-\nMany of the results given in the book are new and have not been published elsewhere. This book is especially interesting for specialists in differential equations applying their results to some practical problems in the natural sciences and technology.\nAn English translation was published in\n1993\n.\nSharkovsky, in collaboration with S F Kolyada, A G Sivak and V V Fedorenko, published\nDynamics of one-dimensional mappings\nin\n1989\n. Feliks Przytycki writes in a review:-\nThe book is devoted to iterations of maps of the interval I. It contains introductory material as well as new advanced results. Many results are formulated without proofs or with only rough ideas of proofs. A pleasant side of the book is an abundance of examples.\nAn English translation was published in\n1997\n.\nIn\n1978\n, Sharkovsky was elected as a corresponding member of the\nUSSR Academy of Sciences\n. In\n2006\nhe was elected as an Academician of the National Academy of Sciences of Ukraine\n(\nthe name the\nUkrainian Academy of Sciences\ntook in\n1994)\n. In\n1994\n, an international conference \"Thirty years after Sharkovsky's theorem. New perspectives\", was held in La Manga del Mar Menor, Murcia, Spain from\n13\nto\n18\nJune. The papers show how much influence on the development of the theory of dynamical systems that Sharkovsky's results have had and continue to have. The publisher states:-\nSince Professor A N Sharkovsky's landmark paper on the coexistence of periods for interval maps, several lines of research have been developed, opening applications of models to help understand a number of phenomena from a wide variety of fields, such as biology, economics, physics etc. The meeting served to summarize the progress made since Professor Sharkovsky's discovery, and to explore new directions.\nThirty-seven papers were delivered at the conference and included in the proceedings, including the talk\nUniversal phenomena in some boundary value problems\nby Sharkovsky himself. The Proceedings included an English translation of Sharkovsky's famous\n1964\npaper\nCoexistence of cycles of a continuous map of the line into itself\n.\nAs Head of the Institute of Mathematics of the\nNational Academy of Sciences of Ukraine\n, Sharkovsky led a team which was awarded the\n2010\nState Prize of Ukraine in Science and Technology:-\nFor a series of scientific papers \"Theory of Dynamical Systems: Methods and Applications\".\nWe end this biography by quoting from\n[\n2\n]\n:-\nSharkovsky has a rare talent to find and solve problems that seem specialized at first glance, but that acquire general scientific significance as time goes by. The results in the theory of dynamical systems obtained in the\n1960\ns by Sharkovsky appeared to be very important when the necessity for a general investigation of essentially nonlinear processes arose. It turned out that many fundamental results and ideas of the contemporary theory of dynamical systems can be found in the early works of Sharkovsky. Some of his results were repeatedly reestablished and became real discoveries for specialists. Without any doubt, recent investigations of Sharkovsky into the mathematical aspects of nonlinear dynamics and, in particular, in the theory of turbulent oscillations will occupy with time an important place in various branches of science related to nonlinear processes.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Topology"
  ]
}