{
  "nome_completo": "Olga Arsen'evna Oleinik",
  "nome_curto": "Olga Arsenievna Oleinik",
  "ano_nascimento": "1925",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oleinik/",
  "lugar_nascimento": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Olga Arsenievna Oleinik\n's parents were Arsenii Ivanovic and Anna Petrovna. She grew up during difficult years in Russia, and the Second World War caused much hardship and destruction. Despite the difficulties she graduated from the Moscow State University in\n1947\n, and continued her graduate work there. She received her Master's degree in\n1950\n, and her Doctor's degree in\n1954\n. Her doctoral studies were supervised by\nIvan Georgievic Petrovsky\nand after his death in\n1973\n, she wrote several tributes to her doctoral supervisor:-\nPetrovsky\n's knowledge was encyclopaedic. He had a thorough understanding of modern science and all its interconnections, was perspicacious and far-sighted, was able to discern long-term trends, and always emphasised them. He also showed a wide general culture, knowledge of diverse branches of science, a deep understanding of state problems in many outstanding public and state activities.\nGiven\nPetrovsky\n's expertise in differential equations, the topology of algebraic curves and surfaces and mathematical physics, it is not difficult to see his influence on the direction that Oleinik's work would take. She too became a leading world expert in these areas. After the award of her doctorate she remained at Moscow State University where she became professor of mathematics. In\n1973\nshe became Head of the Department of Differential Equations at Moscow State.\nIt is impossible to give more than just an indication of her work in an article of this type since her contributions are so extensive.\nMathematical Reviews\nlists\n359\npublications under her name, an almost unbelievable achievement for any mathematician. To see just how impressive having\n359\npublications is, we should note that most top mathematicians would be proud of having\n100\npublications in their careers and\n200\nis quite exceptional.\nLet us look at a few monographs which she published in the last\n10\nyears of her life. In\n1990\n, together with G A Iosifyan and A S Shamaev, she published\nMathematical problems in the theory of strongly inhomogeneous elastic media\n. It is a work in three chapters which studies the mathematical theory of perforated elastic bodies and builds into one volume many papers that Oleinik and her two coauthors had produced in the preceding\n10\nyears. The three chapters are: Basic mathematical aspects of the theory of elasticity; Homogenization of the equations of linear elasticity; Composites and perforated materials and Spectral problems in homogenization theory. Mikelic, in reviewing the book, writes:-\nThis is an impressive monograph on homogenization in linear elasticity. It is self-contained and the reader with background in partial differential equations and continuum mechanics can learn the homogenization techniques developed by Oleinik and her coauthors.\nIn\n1993\n, together with V V Zhikov and S M Kozlov, Oleinik published a Russian work\nAveraging of differential operators\nand in the following year an English translation appeared with the title\nHomogenization of differential operators and integral functionals\n. The Russian book has\n15\nchapters, while the English edition is an updated and expanded version with\n17\nchapters:-\nWithout a doubt, this book promotes an important new stage in homogenization theory.\nIn\n1996\nOleinik published\nSome asymptotic problems in the theory of partial differential equations\n. Many results which Oleinik obtained over the previous years appear in this volume for the first time. Much of the book is devoted to the study of the asymptotic behaviour of solutions to nonlinear elliptic second-order equations. Oleinik considers equations satisying\nDirichlet\nboundary conditions and ones which satisfy Neumann boundary conditions. Oleinik also studies the homogenization problem for linear elliptic equations in domains with the property that half is perforated and half contains no holes.\nOleinik published\nMathematical methods in boundary-layer theory\nin\n1997\n, jointly with V N Samokhin. Fife revied the\n512\npage volume and wrote:-\nThis book is a vast treasury of rigorous mathematical results about the Prandtl systems of partial differential equations in fluid dynamics. Oleinik and her many collaborators are responsible for developing most of this theory over the last four decades.\nThe Prandtl equations were devised early in this century as a simpler replacement for the\nNavier\n-\nStokes\nequations to describe viscous laminar fluid flows near boundaries to which the fluid adheres. These replacement equations have a quite different mathematical character than the\nNavier\n-\nStokes\nequations, and as one can easily see from this book, the theory goes along very different lines.\nOleinik received many honours for her work. She was elected to: the\nRussian Academy of Sciences\n; the\nAcademia Nazionale dei Lincei\nin Italy; the Sächsische Akademie of Sciences in Germany; the Italian Academy of Sciences in Palermo; the Italian Academy of Sciences in Milan; and the\nRoyal Society of Edinburgh\nin Scotland. She received many prizes for her remarkable contributions: the Chebotarev Prize; the State Prize; the Lomonosov Prize; the Petrowsky Prize; and the Prize of the\nRussian Academy of Sciences\n. She received medals from the Collège de France and the Charles University of Prague.\nIn\n1981\nUniversity of Rome gave Oleinik an honorary doctorate and in\n1996\nOleinik was the Association for Women in Mathematics\nNoether\nLecturer.\nOne of her colleagues paid this tribute to her on her death:-\nShe will also be remembered as a lady with a very strong personality. She was very generous with her colleagues and her friendship, once acquired, was limitless. Her loss will be deeply felt by the international mathematical community.",
  "math_areas": [
    "Topology"
  ]
}