{
  "nome_completo": "Olga Taussky-Todd",
  "nome_curto": "Olga Taussky-Todd",
  "ano_nascimento": "1906",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taussky-Todd/",
  "lugar_nascimento": "Olmütz, Austro-Hungarian Empire (now Olomouc, Czech Republic)",
  "lugar_morte": "Pasadena, California, USA",
  "biografia": "Olga Taussky-Todd\n's name before she married was Olga Taussky and she was born into a Jewish family. Her father, Julius David Taussky, was an industrial chemist who also wrote articles for a newspaper. Her mother, Ida Pollach, was never trained for anything other than being a housewife and looking after her children. Olga was the middle child of three girls, with three years separating her both from her older sister and from her younger sister. Of her parents she wrote\n[\n1\n]\n:-\nMy father was a very interesting man, very active, very creative. ... My mother was a country girl ... a rather quiet lady ... educated to be a housewife ...\nWhen Olga was three years old the family moved to Vienna. There Olga attended primary school and although she did well, her older sister was the star pupil. Olga received the top or second top grade for arithmetic but her favourite subjects were essay writing and grammar. In addition to her schooling she had private music lessons. When World War I broke out conditions became very difficult indeed in Vienna, there was severe shortages of food and the family were near to starving.\nIn\n1916\nthe Taussky family moved again, this time to Linz where Olga's father had a job as director of a vinegar factory which, in addition to vinegar made jams and soft drinks. Julius Taussky was well qualifed for the job for he had coauthored a text on vinegar with his own father Samuel Taussky in\n1903\n. Arriving in Linz in the middle of World War I, life was still hard for them but food, although still scare, was slightly more plentiful than in Vienna. When she was\n14\nyears old Olga entered the high school where she spent a year before studying at the\nGymnasium\n. At this stage she was still interested in writing and poetry, and initially the Latin that she began to study at the Gymnasium fascinated her, particularly Latin grammar. Suddenly, however, her interests moved to mathematics\n[\n1\n]\n:-\nWhile I tried to read any books that came my way, the realisation that the greatest wisdom was not to be gained by reading books struck me suddenly. I felt that scientific experiments provided almost unlimited insight ... Mathematics, too, came to me at that time as an experimental subject ... Gradually it became clear to me that\n[\nmathematics\n]\nwas my subject.\nFrom about the age of fifteen she tutored, starting by teaching chemistry to a classmate, but doing more and more over time. Olga's father died when she was in her final year at school so she increased her tutoring to try to help out the family finances. Knowing that it would be hard to fund her university studies she worked through the summer at the vinegar factory.\nThere was a lot of family pressure on Taussky to study chemistry, and indeed she loved the subject, so she entered the University of Vienna with a chemistry degree in mind, but her older sister qualified in chemistry and took over her father's work. The family pressure came off Taussky, and she was able to make mathematics her main subject.\nAt Vienna Olga was taught by\nFurtwängler\n,\nHahn\n,\nWirtinger\n,\nMenger\n,\nHelly\nand others, while she was a fellow student of\nGödel\n. At that time, the most famous of these was\nFurtwängler\nbut he was in poor health, only being able to walk with help and a student had to write for him when he lectured.\nFurtwängler\nbecame her thesis supervisor and after enjoying his course on number theory in her first year and his algebraic\nnumber theory\nseminar in her second year she asked him if she could write her thesis on number theory. He said that she would work on class field theory which, she wrote\n[\n1\n]\n:-\n... was a great honour.\nShe wrote her thesis on\nalgebraic number fields\njust as class field theory was being developed. However things were not easy\n[\n1\n]\n:-\n... I had a very tough time as a thesis student, I had no colleagues whatsoever and hardly saw my teacher, who for quite a while did not direct me towards a specific problem.\nShe was awarded a doctorate in\n1930\nand her thesis was published in\nCrelle\n's Journal in\n1932\n. After the award of her doctorate she earned some money by tutoring but also continued to work hard on her mathematics, continuing to develop the ideas from her thesis.\nEncouraged to attend two meetings of the\nGerman Mathematical Society\n, she lectured there on her results and began a collaboration on\ngroup theory\nwith A Scholzy, a student of\nSchur\n. At one of these meetings Hahn recommended her to\nCourant\nand, in\n1931\nshe was appointed as assistant at Göttingen.\nCourant\nhad been looking for someone to work with\nWilhelm Magnus\nand Helmut Ulm editing the first volume of\nHilbert\n's complete works on number theory and Taussky fitted the bill perfectly.\nWhile in Göttingen Taussky also edited\nArtin\n's lectures in class field theory\n(1932)\n, assisted\nEmmy Noether\nin her class field theory and\nCourant\nwith his\ndifferential equations\ncourse. Leaving Göttingen in the summer of\n1932\n, she received a letter from\nCourant\nbefore the new academic year started advising her not to return to Göttingen due to unrest at the university caused by the deteriotating political situation.\nIn\n1932\n-\n1933\nTaussky tutored in Vienna, then she spent a year at Bryn Mawr before taking up a research fellowship from Girton College, Cambridge in\n1935\n.\nHardy\nhelped her obtain a teaching post in a London college in\n1937\nwhere she soon met an Irishman Jack\n(\nJohn Todd\n)\nwho was teaching analysis at a different London College. They began working on mathematics together and were married on\n29\nSeptember of the following year. Taussky said\n50\nyears later\n[\n14\n]\n:-\nMy life and my career would have been so different if my Irishman had not come along.\nDuring World War II Olga and\nJack\nmoved from place to place. They spent some time in Belfast with\nJack\n's mother and some time in Oxford where Taussky-Todd's College had moved to avoid the London air raids. At this time Taussky-Todd wrote some papers on group theory, for example studying groups in which, in today's terminology, every subnormal subgroup is normal. She proved, among other things, that a group with cyclic\nSylow\nsubgroups satisfies this property. She also wrote several papers on\nmatrices\nof finite order such at\nMatrices with finite period\nin\n1940\nand\nMatrices of finite period\nin the following year, both written jointly with her husband.\nWhile teaching near Oxford she supervised\nHanna Neumann\n's D.Phil. thesis on combinatorial group theory during\n1942\nand\n1943\n. Given leave of absence from her College to undertake war work, Taussky-Todd worked at the National Physical Laboratory ay Teddington between\n1943\nand\n1946\n. It was a useful experience for her mathematically\n[\n1\n]\n:-\nThe duties in my aerodynamics job were very heavy. ... For the first time I realised the beauty of research on differential equations - something that my former boss,\nProfessor Courant\n, had not been able to instil in me. Secondly I learned a lot of matrix theory.\nJust to illustrate this let us note that during this time Taussky-Todd wrote several papers which were published by the Ministry of Aircraft Production in London. For example she published in\n1944\nA note on skew-symmetric matrices\nin which she discussed the form of the matrices\nX\n′\nX\nX'X\nX\n′\nX\nand\nX\nX\n′\nXX'\nX\nX\n′\n, where\nX\n′\nX'\nX\n′\nis the transpose of the matrix\nX\nX\nX\nwhose columns are the eigenvectors of a skew-symmetric matrix with distinct eigenvalues. In the following year she published\nOn some boundary value problems in the theory of the non-uniform supersonic motion of an aerofoil\nin which she gives rigorous proofs of methods to find the velocity potential due to a two-dimensional airfoil in a supersonic stream whose shape and motion are given. These papers she published under the name Olga Todd, while most of her other papers she wrote under the name Olga Taussky, with a few latter papers written under the name Olga Taussky-Todd.\nIn\n1947\nOlga and\nJack\nwhen to the United States, with the original intention of spending a year there, and they worked at the National Bureau of Standards' National Applied Mathematics Laboratory after spending a while at the Institute for Advanced Study at Princeton working on\nvon Neumann\n's computer project. She worked as a consultant in mathematics at the National Bureau of Standards and because of her work there with computers she has been described as a:-\n... computer pioneer ... who provided significant contributions to solutions of problems associated with applications of computers.\nShe continued to write papers on matrix theory, group theory, algebraic number theory but she also wrote on numerical analysis.\nIn\n1955\nTaussky-Todd and her husband spent a year's leave at the Courant Institute in New York where she taught a matrix theory course and her husband taught a numerical analysis course. Although Taussky-Todd enjoyed working at the National Bureau of Standards she missed teaching\n[\n1\n]\n:-\n... my job at the Bureau was not exactly right for me. It was certainly a very interesting job. I learned a lot there, contributed a lot, and was treated with great courtesy.\nIn\n1957\nOlga and\nJack\nboth accepted appointments at the California Institute of Technology. She wrote:-\nAfter many years of work mostly with applied mathematics, I was in the beginning rather uncertain about the teaching. But again it was the students who came to my assistance\n[\nas in the college in London\n]\n. It was clear to them that I had much mathematics to give them and they forced it out of me.\nIn\n1977\nshe retired becoming Professor Emeritus, but she continued to lead a very active mathematical life. Particularly she could devote even more time to the very large mathematical correspondence which she carried on with many throughout the world.\nOlga's honours and work is described in\n[\n13\n]\nas follows:-\nOlga Taussky-Todd was a distinguished and prolific mathematician who wrote about\n300\npapers. Throughout her life she received many honors and distinctions, most notably the Cross of Honor, the highest recognition of contributions given by her native Austria. Olga's best-known and most influential work was in the field of matrix theory, though she also made important contributions to number theory.\nIn\n[\n13\n]\nthere are also a number of tributes from those she taught over the years. Rober Guralnick writes:-\nI felt very fortunate to have this chance to work with someone who had such a command of the field.\nTom Apostol\nwrote:-\nOlga was a superb advisor, encouraging, cajoling, and always there to help.\nBut she was not without her idiosyncrasies as Charles Johnson writes:-\n... she had rather particular ideas about mathematical writing. No pictures or diagrams were allowed, and, much as I wanted to write \"\nn\n×\nn\nn \\times  n\nn\n×\nn\n\" to describe the dimensions of a matrix in my thesis, it had to be \"\nn\nn\nn\n-by-\nn\nn\nn\n\". I, and my students, still write \"\nn\nn\nn\n-by-\nn\nn\nn\n\".\nFinally we should mention some of the many honours Taussky-Todd received for her mathematical contributions. She received the Ford Prize from the\nMathematical Association of America\nin\n1971\nfor a paper on the sums of squares. She was elected to several academies: elected to the\nAustrian Academy of Sciences\n(1975)\n; elected to the Bavarian Academy of Sciences\n(1985)\n; elected a Fellow of the American Association for the Advancement of Science\n(1991)\n. She was honoured by the Austrian government in\n1978\nwith their highest award, The Cross of Honour in Science and Arts, First Class and, in\n1980\n, received an honorary doctorate from the University of Vienna. She also was awarded an honorary doctorate from the University of Southern California in\n1988\n.\nTaussky-Todd served on the Council of the\nLondon Mathematical Society\n(1946\n-\n47\nand she served on the Council of the\nAmerican Mathematical Society\n(1972\n-\n78)\n. She was Vice-President of the\nAmerican Mathematical Society\nin\n1985\n.\nLet us finish by quoting her own words\n[\n1\n]\n:-\n... from early childhood on, poetry and writing came to me in a natural way. But it seems to me that both in the work of others and in my own I look for beauty, and not only for achievement. ... a person who started with the enthusiasm that came to me and did not diminish through hardships, difficulties, and disappointments 'is not given a choice' and 'shadows of the future one does not see'.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}