{
  "nome_completo": "Olga Alexandrovna Ladyzhenskaya",
  "nome_curto": "Olga Alexandrovna Ladyzhenskaya",
  "ano_nascimento": "1922",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ladyzhenskaya/",
  "lugar_nascimento": "Kologriv, Kostroma province, Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Olga Alexandrovna Ladyzhenskaya\n's father was Aleksandr Ivanovich Ladyzhenskii, descended from Russian nobility, and her mother, Anna Mikhailovna, was from Estonia. Olga's birth place Kologriv was surrounded by 'wild' forests, near the picturesque river Unzha. Her mother was a hard-working housewife, looking after her husband and three daughters of whom Olga was the youngest. She was the closest to her father who was a mathematics teacher and the catalyst for Olga's life long interest in mathematics. He started teaching his daughters mathematics in the summer of\n1930\nbeginning with giving explanations of the basic notions of geometry, then he formulated a theorem and in turn made his daughters prove it. It became apparent that Olga showed a strong talent for logical thinking from an early age. Not only did she love to discuss mathematics with her father but she also studied calculus with him as an equal. Olga's grandfather, Gennady Ladyzhensky, was a famous painter. All her life Olga carefully kept beautiful landscape paintings by her grandfather, some of them depicting fine views of the Unzha. Their house contained many books, including books on history and fine arts. Books were almost the only source of cultural education, especially since Kologriv was too far from cultural centres.\nOne would assume she had a pleasant upbringing in a quiet rural area with parents ensuring her mathematical gift was realized. In fact this was not the case, though the story could only be told after the communist rule of Russia ended. During Olga's upbringing, times were very hard especially for intellectuals descended from Russian nobility for whom everything was in short supply including food, paper and clothes.  However, this did not stop her father inspiring his pupils and his daughters. Olga's two sisters were forbidden to finish their studies, being expelled from school, but the authorities allowed Olga to finish her studies. However, Olga had problems continuing her education since she was the daughter of an \"enemy of the nation\". When she was fifteen years old, in\n1937\n, her father was arrested by Stalinist authorities and executed without trial. Alexander Solschenizyn recalls in his epic of\nThe Gulag Archipelago\nthat although Olga's father had been warned by a peasant that he was on the list of enemies of the state, he refused to run and hide. He stood his ground and continued with his work since he believed his students depended on him. It is believed that he died in an NKVD\n(\nNarodny Kommissariat Vnutrennikh Del\n)\ntorture chamber during the week between\n23\nand\n30\nOctober\n1937\n(\none of many excellent teachers killed there\n)\n. The NKVD was the forerunner of the KGB and it is important to note that in\n1956\nall the teachers killed by them were fully exonerated. During this time millions of suspected enemies were killed so that Stalin remained unchallenged as Soviet leader until his death. Reports have it that all the men from the old and well-off noble Ladyzhenskii family, who had not left Russia, vanished by the start of\n1940\ns. This tragedy deeply affected Ladyzhenskaya and the family was placed in a very difficult situation with her mother and sisters having to do craft work and make dresses, shoes, soap, as this was their only way for their family to survive.\nIn\n1939\n, despite leaving secondary school with excellent marks, Olga was forbidden to enter Leningrad State University as her father was thought of as an \"enemy of the nation\". She was given a placement in the Pokrovski Teachers' Training College, remarkably only based on her word, as Leningrad\n(\nnow St Petersburg\n)\nhad not yet returned her academic documents.  It is possible she received this placement partly due to the fact that the state policy had changed during the difficult wartime period. When World War II began she was left with no choice but to leave Leningrad, first moving to Gorodets where she taught in an orphanage, and then moving with her mother and older sister to return to Kologriv. There she taught mathematics at the same local secondary school that her father had previously taught in. Following the same footsteps as her father, she taught not only at school, but also at home without payment.\nIn\n1943\nshe became a student at Moscow State University\n(\nMGU\n)\ndue to the intervention of the mother of one of her pupils who, on returning to Moscow, persuaded the rector to invite Olga to MGU. It was not easy for her to leave her teaching post and there were many battles with the school authorities before she could become a student. At University Olga's love of mathematics blossomed and she was awarded a Stalin stipend and a labourers ration card without which she would have been unable to survive. It was here where she first started studying algebra, number theory and subsequently partial differential equations. She became interested in the theory of partial differential equations due to the influence of\nPetrovsky\nas well as the book by\nHilbert\nand\nCourant\n. Being a talented student, the authorities often ignored absences at compulsory lectures while she attended research seminars including the algebra seminars of\nKurosh\nand\nDelone\nand the seminar on differential equations headed by\nStepanov\n,\nPetrovsky\n,\nTikhonov\n, Vekua and their students and colleagues. She was later invited to attend\nGelfand\n's seminar. At the end of her fourth year she organized a youth seminar to study the theory of partial differential equations and persuaded Myshkis, a student of\nPetrovsky\n, to go with her to ask\nPetrovsky\nto chair the seminar. In addition to chairing this seminar, he attended the seminar for the whole year, clearing up questions and expressing his opinions on the topics. Not only did friends and colleagues of\nPetrovsky\ncome to the seminars, but it also prompted him to write a paper published in\nUspekhi Matematicheskikh Nauk\nin\n1946\nwhich was highly influential. Olga chose the following two problems from that paper:\nFind the least restrictive conditions on the behaviour of parabolic equations under which the uniqueness theorem holds for the\nCauchy\nproblem.\nFor hyperbolic equations, construct convergent difference schemes for the\nCauchy\nproblem and for initial-boundary problems.\nAfter she graduated in\n1947\n, Olga moved once again to Leningrad due to family circumstances and became a postgraduate at the Leningrad State University on the recommendation of MGU. There she began her long-standing friendship with\nSmirnov\n, who was in charge of several branches of mathematics as well as seismology, hydrodynamics and aerodynamics.  It was also here that she was strongly influenced to study the equations of mathematical physics. During that year she married Andrei Alexevich Kiselev, a specialist in the number theory and history of mathematics, in the city of Leningrad. They were a loving couple yet their marriage was brief as Andrei wanted to have children, but Olga did not as she wished to devote her life to mathematics and she felt that children might be an obstacle. Olga remained single for the rest of her life.\nIn\n1949\nOlga defended her doctoral dissertation\n(\ncomparable to an\nhabilitation\n)\nwhich was on the development of finite differences methods for linear and quasilinear hyperbolic systems of partial differential equations, formally supervised by\nSobolev\nthough in practice it was\nSmirnov\n. Her aim was to prove the solubility of boundary and initial-boundary problems. In the early\n1950\n's the theory of PDEs was popular with researchers due to progress in physics which needed new mathematical methods for theoretical and numerical study. Olga started to prepare her diploma thesis on a problem suggested by\nPetrovsky\n. Among her teachers were\nKurosh\n,\nStepanov\n,\nPetrovsky\nand\nGelfand\n. In\n1951\nshe completed her thesis but it could not be published until the death of Stalin in\n1953\n. In another article it has been said that it was delayed until\n1952\ndue to \"technical difficulties with typesetting the formulas\". Her work was praised by\nPetrovsky\nand referees, and was recommended for publication in\nMatematicheskii Sbornik\n.\nHer first book published in\n1953\ncalled\nMixed Problems for a Hyperbolic Equation\nused the finite difference method to prove theoretical results, mainly the solvability of initial boundary-value problems for general second-order hyperbolic equations. In\n1954\n, she was made a teachers at Leningrad State University and initially became a researcher at the\nSteklov\nMathematical Institute of the\nAcademy of Sciences of the USSR\n. As in the previous decade, during the\n1960\ns she continued obtaining results about existence and uniqueness of solutions of linear and quasilinear elliptic, parabolic, and hyperbolic partial differential equations. She then studied the equations of elasticity, the\nSchrödinger\nequation, the linearized\nNavier\n-\nStokes\nequations, and\nMaxwell\n's equations. The\nNavier\n-\nStokes\nequations were of great interest to her and continued to be so for the rest of her life. In\n1961\nanother of her books,\nThe Mathematical Theory of Viscous Incompressible Flow\nwas an outstanding success in the area of nonlinear problems of mathematical physics and has since become a classic.\nMany papers written jointly by Olga and Nina Ural'tseva were devoted to the investigation of quasilinear elliptic and parabolic equations of the second order. At the start of the last century\nSergi Bernstein\nproposed an approach to the study of the classical solvability of boundary-value problems for equations based on a priori estimates for solutions as well as describing conditions that are necessary for such solvability. From the mid-\n1950\n's Olga and her students made advances in the study of boundary-value problems for quasilinear elliptic and parabolic equations. They developed a complete theory for the solvability of boundary-value problems for uniformly parabolic and uniformly elliptic quasilinear second-order equations and of the smoothness of generalized solutions. One result gave the solution of\nHilbert\n's\n19\nth\nproblem for one second-order equation.\nThe following are a few of the numerous awards and achievements in Ladyzhenskaya's life. In\n1954\n, and again in\n1961\n, she was awarded the First Prize of the Leningrad State University. From\n1961\nto\n1991\nshe held the position of the Head of the Laboratory of Mathematical Physics at the Steklov Mathematical Institute of the\nAcademy of Sciences of the USSR\n. In\n1969\nshe received the\nChebyshev\nPrize of the\nUSSR Academy of Sciences\nand the State Prize of the USSR. She was elected a corresponding member of the\nAcademy of Sciences of the USSR\n(1981)\n, a foreign member of the\nThe German Academy of Scientists Leopoldina\n(1985)\nand of the\nAccademia dei Lincei\n(1989)\n, a full member of the\nRussian Academy of Sciences\n(1990)\n, and a foreign member of the\nAmerican Academy of Arts and Sciences\n(2001)\n. She was awarded the S V Kovalevsky prize in\n1992\n, an honorary doctorate from the University of Bonn on\n13\nMay\n2002\n, and the Golden Lomonosov Medal, the Ioffe Medal, and the St Petersburg University Medal in\n2003\n. In\n1998\n, she delivered the\nJohn von Neumann\nLecture at the\nSIAM\nAnnual Meeting in Toronto. From\n1959\nshe was a member of the\nSt Petersburg Mathematical Society\nwhen the Society was recreated and she served as its Vice-President from\n1970\nto\n1990\nand its President between\n1990\nand\n1998\n, after which she was elected Honorary Member of the Society. In the Museum of Science\n(\nBoston, USA\n)\nOlga Ladyhenskaya's name is among other influential mathematicians of the\n20\nth\ncentury carved on a large marble desk in the Mathematics Exhibition Hall.\nThe year\n1989\nbrought about the end of Communist rule and the turn towards democracy and market economy in Russia. Russian mathematicians could travel more freely and some visited Western countries for the first time.  Olga had not been allowed to travel outside Eastern Europe, apart from in\n1958\nwhen she attended the International Congress of Mathematicians in Edinburgh, and not again until\n30\nyears later in\n1988\n. It was only after the death of Stalin that visitors were allowed to enter the Soviet Union and have the opportunity to meet scientists. It was then that\nLeray\nsaw the sights of Leningrad for the first time, including the Hermitage, Peterhof, and on meeting Olga realized that they had been researching the same topics.  When Olga first started to work on the\nNavier\n-\nStokes\nequation, she was unaware of the work of\nLeray\nand\nEberhard Hopf\n. Think what a powerful team they could have been had they worked together.\nOlga, was not only interested in mathematics and science, but she had a passion for arts and was an active participant in the intellectual community of St Petersburg. Olga's reputation as an independent spirit was furthered by her friendship with Aleksandr Solzhenitsyn, the author and dissident. Anna Akhmatova a famous Russian poet, knew Ladyzhenskaya so well that she devoted a poem to her. She was a nature lover especially of animals, mushrooms and flowers and she took pleasure in watching squirrels climb trees and feeding sea gulls out of her hand. She was an enthusiastic traveller. Her deep religious beliefs strengthened her amazing character. She had the gift of being a wonderful storyteller when sharing her stories with friends. She was touched by many things such as injustice and the misfortunes of others; she helped lonely and the destitute. Once a member of the city council of people's deputies, she helped mathematicians and their families in Leningrad to get free accommodation. She openly expressed her views on social matters, even during the time of totalitarian political regime, often neglecting her own safety.\nShe died unexpectedly in her sleep on\n12\nJanuary\n2004\nshortly before her\n82\nnd\nbirthday. She loved St Petersburg but she was also a sun worshipper and had been due to be in Florida from January\n12\nth\nduring the long dark days of winter in St Petersburg. However on the eve of\n11\nJanuary she went to rest before her long trip and passed away. Two days before her death her spirits were high, she had sketched a paper on some computational aspects in hydrodynamics and planned to finish it in Florida. Even up till her death she was coping with the challenge of serious eye problems affecting her sight especially during winter darkness so she used special pencils for writing.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Number Theory"
  ]
}