{
  "nome_completo": "Oliver Byrne",
  "nome_curto": "Oliver Byrne",
  "ano_nascimento": "1810",
  "ano_morte": "1880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Byrne/",
  "lugar_nascimento": "Avoca, County Wicklow, Ireland",
  "lugar_morte": "Maidstone, Kent, England",
  "biografia": "Oliver Byrne\n's parents were Lawrence Oliver Byrne and his wife Mary. Oliver had a brother, John Byrne\n(27\nMay\n1812\n-\n6\nApril\n1851)\n, who was two years his junior. In addition he had at least two sisters. Not much is known about Byrne's early years and, confusingly, some of the information that is available seems to be incorrect. The article\n[\n10\n]\nis a recent study of Byrne's life and is the most reliable account, carefully evaluating the available data.\nWe do not have any details of Byrne's family other than that which has been given above. In\n1839\nByrne wrote that he was the \"principal support of an aged mother and sisters in Ireland.\" If this is accurate, and there is no reason to believe it is not, then by this time his father had died but his mother was still living. The reference to \"sisters\" in this quote is the reason that we stated \"he had at least two sisters.\" In the obituary\n[\n13\n]\nit states that Byrne:-\n... was entered at Trinity College, Dublin, where he passed with distinction the various examinations.\nHowever, there is no record of Byrne attending Trinity College, Dublin, and no record that he graduated from Trinity College. He does appear to be living in Dublin at the time he published works in\n1831\nand\n1832\nso it is not impossible that he did manage to attend some classes without ever registering. He published\nA Treatise on Diophantine Algebra\nin\n1831\nbut he referred to this work as\n\"A Treatise on Algebra\"\nin the\n35\n-page pamphlet\nA Short Practical Treatise on Spherical Trigonometry: Containing a Few Simple Rules, by which the Great Difficulties to be Encountered by the Student in this Branch of Mathematics are Effectually Obviated\nwhich he published in\n1835\n. He must have left Dublin in\n1831\nor early\n1832\nand travelled to London where he earned a living as a teacher of mathematics. However, before continuing to describe events in London, let us note that he published\nPamphlet on the Teaching of Geometry by Coloured Diagrams, etc.; Applied to the First Book of Euclid\nin Dublin in\n1831\n. He later expanded this into what today is his most famous book, but we shall come to that below.\nThe\nBritish Association\nmet in Newcastle-on-Tyne in August\n1838\n. Byrne tried to get a paper \"How to measure the Earth with the assistance of Railroads\" accepted for publication. It was not accepted but Byrne published it with the following Preface:-\nTo the PRESIDENT, VICE PRESIDENTS, AND COMMITTEE of the SECTION OF MATHEMATICS AND PHYSICS of the\nBRITISH ASSOCIATION FOR THE ADVANCEMENT OF SCIENCE\nat NEWCASTLE-UPON-TYNE.\nI respectfully submit to you the dedication of a paper which I delivered in to be read in your section. After waiting some time I ascertained that it had been severally transferred from your Committee to that of the Mechanical Section and by them again to you who declined it on the ground that it properly belonged to the former. As I consider it a matter of purely mathematical science, I humbly suggest that the consideration of it did belong to you but I now, being debarred of your medium, submit it to the scientific world who will be able to decide whether you were justified in your refusal or not.\nI have the honour to remain,\nGentlemen,\nYour obedient Servant,\nOliver Byrne.\n11\nGower Street, Bedford Square, London.\nThe title page of this works describes Byrne as:-\nMathematician, Author of \"A New And Improved System Of Logarithms,\" \"The Navigator's Ready Calculator,\" \"A Treatise On Spherical Trigonometry,\" The Elements of Euclid by Colours,\" etc.\nByrne also wrote, under the pseudonym E B Revilo\n(\nthis is just Oliver Byrne reversed!\n)\n, the strange book\nThe creed of St Athanasius proved by a mathematical parallel. Before you censure condemn or approve read examine and understand\n. Daniel J Cohen writes in\n[\n8\n]\n:-\n[\nByrne sought to equate\n]\neach element of the Trinity\n(\nthe Father, the Son, and the Holy Ghost\n)\nto infinity, since the Athanasian Creed considered all of them to be unlimited. Byrne then erected two vertical columns: the left containing the English Book of Common Prayer translation of the Quicunque Vult\n(\nthe traditional description of the Athanasian Creed\n)\n, the right containing parallel mathematical equations involving infinity that purported to establish the truth of the statements on the left.\nAugustus De Morgan\n, in\nA Budget of Paradoxes\n, reviewed this work, writing\n[\n9\n]\n:-\nThis author really believed himself and was in earnest. He is not the only person who has written nonsense by confounding the mathematical infinite\n(\nof quantity\n)\nwith what speculators now more correctly express by the unlimited, the unconditioned, or the absolute. This tract is worth preserving as the extreme case of a particular kind.\nOn\n23\nNovember\n1839\n, Byrne made an application for financial support from the Royal Literary Fund. He wrote\n(\nsee\n[\n10\n]\n)\n:-\nI have been a resident in London for the last\n8\nyears, during which time I have supported myself as a teacher of Mathematics, and have also published several works in connection with the mathematical sciences ... . A native of the sister country, I have had to struggle long and severely with adverse circumstances, and to encounter an almost overwhelming weight of prejudice, but my pupils have included some of the most distinguished in the ranks of society ... . I have now unfortunately been arrested on account of a debt of thirty pounds which I have not been able to pay and now lay here at the suit of a merciless creditor whom I have not the means to satisfy.\nThe Preface we quoted above tells us that Byrne felt he was being discriminated against, and the report in\nThe Examiner\non\n29\nDecember\n1839\nseems prove that he was indeed the subject of discrimination\n[\n11\n]\n:-\nA person of the name of Oliver Byrne, a professor of mathematics, appeared in Court to be discharged on bail under the New Insolvent Debtors' Act of last sessions. His bail appeared in Court to justify, but one of them was opposed by Mr Woodruff, on behalf of the plaintiff, as to the bail's sufficiency. The person opposed was pressed hard by counsel as to his means, and at last refused to answer any more questions, his feeling being much irritated at the interrogatories. The other bail, finding his co-bail in danger of passing as one of the sureties, then offered to pay the required sum into court as security for the insolvent's appearance on the final day of hearing, rather than he should be inconvenienced by staying in prison for about five weeks. This offer was refused by the Court. This appears to us extremely unreasonable, vexatious, and unjust. The payment into Court of the sum required in security was obviously as good as or better than the best bail, and we are at a loss to conceive the pretext on which the offer can have been refused.\nByrne taught at the College of Civil Engineers, Putney, South West London from around the beginning of\n1840\n. He must have taught there for less than two years since by January\n1842\nhe was lecturing in Philadelphia in the United States. He explained what happened in his writings in May\n1842\n(\nsee\n[\n10\n]\n)\n:-\nI resigned the professorship of Mathematics in the College for Civil Engineers, not without sufficient reason; the most persevering, in my position, would have done the same. Several of the Council resigned for the same reason. After my resignation, I went to the United States of America, hoping that I could stipulate with the government for a new plan of calculating the revenue. I travelled from city to city without success supporting myself by delivering lectures on popular mathematical subjects and by writing short articles for periodicals and newspapers.\nHowever, he was soon back in England and tried to set up a School of Mathematics, Engineering, Classics, and General Literature at Surrey Villa, near Lambeth Palace in London. The project never got off the ground. He was involved in setting up a number of railway companies but, after purchasing expensive equipment for one company that failed, he was sued for £\n75\nin\n1845\n.\nByrne married Eleanor Rugg in\n1845\n; they had no children. The marriage was in England but, soon after, in an attempt to repay the debt, he accepted a Government position of surveyor in the Falkland Islands. However, he could not raise the money for the passage to the Falkland Islands and was forced to sell much of his possessions to repay his debt. He had continued publishing, however, and in\n1841\nThe Doctrine Of Proportion Clearly Developed on a Comprehensive Original and Very Easy System or The Fifth Book of Euclid Simplified\nwas published. For an extract from the Preface see\nTHIS LINK\n.\nAlso published were\nThe Practical Complete and Correct Gager\n:\nContaining a Description of Parker and Byrne's Patent Calculating Instruments: with Their Use and Application\n(1841)\n,\n(\nwith his brother John Byrne\n)\nThe Fallacies of our own Time. First Part: Fallacy of Phrenology\n(1844)\n, and\nDescription and Use of the Byrnegraph: An Instrument for Multiplying, Dividing and Comparing Lines, Angles, Surfaces, and Solids\n(1846)\n. A review of the pamphlet he wrote with his brother states:-\nJudging from the profound ignorance of the simplest principles of physiology and mental philosophy, as well as of phrenology, which pervades this work - from the disregard of truth, consistency, and reason, which are displayed in it  - and from the tone of self-conceit and arrogance which runs through every page - we cannot conceive a greater mischief happening to Free Trade, than that Messrs Byrne should become its advocates. ... Let the Messrs Byrne write a book in defence of Ireland, and her cause will be ruined for ever.\nIn\n1847\nhe published\nThe First Six Books of the Elements of Euclid in Which Coloured Diagrams and Symbols Are Used Instead of Letters for the Greater Ease of Learners\n. For a description of the contents of this fascinating book, see\nTHIS LINK\n.\nByrne and his wife moved to the United States in\n1849\n, going first to the City of New York. Over the next years, as well as New York, they lived in Philadelphia, and Jersey City, New Jersey. He applied for American citizenship soon after arriving in New York but a five-year naturalisation process meant that he only became an American citizen in\n1854\n. He acted as editor of\nA Dictionary of Machines, Mechanics, Engine Work, and Engineering\n(1852)\n, editing A to F. He published three military works encouraging armed rebellion by the Irish against British rule:\nThe first fifty lessons on military art and science\n(1850)\n;\nFreedom to Ireland: The Art and Science of War for the People. The Pike Exercise, Foot Lancers, Light Infantry, and Rifle Drill. To which is Added a Short Practical Treatise on Small Arms, and Ammunition, Street and House Fighting, and Field Fortification\n(1853)\n; and\nLectures on the Art and Science of War: addressed to Irish American citizen soldiers\n(1853)\n. In\n1851\nhe published\nThe Practical Metal-Worker's Assistant\nwhich, the Preface states:-\n... is designed to keep pace with the mechanical arts in this country\n[\nthe United States\n]\n, although they are in a rapid state of progression, and fast approaching to perfection.\nIt was claimed, by the widow of the author, that large parts were copied from\nTurnary and Mechanical Manipulation\nby Holtzappel and its publication in England was prevented. By January\n1858\n, Byrne was making application for funds to allow him to return to England. Once back in England, he concentrated on pushing two of his ideas, namely\nThe Calculus of Form\nand\nDual Arithmetic\n. The first of these provides a substitute for the differential and integral calculus while the second provides a substitute for logarithms.  Both these appear to be mathematically valid approaches but of little practical use. Byrne claimed that dual arithmetic:-\n... supersedes the use of all sorts of logarithms, and gives results with greater accuracy and precision than any other set of numbers and with less labour.\nHowever, the method seems to involve more labour than that of using logarithms.\nIn\n1864\nByrne and his wife were both seriously injured in a gas explosion at their home in Tollington Road, Holloway, London. They moved to moved to Upper Sydenham in the Parish of Lewisham, England near to his publishers Edward Spon and Francis Nicolas Spon. His books\nThe Essential Elements of Practical Mechanics, based on the principle of work; designed for engineering students\n(1867)\nand\nGeneral Method of Solving Equations of all degrees; applied particularly to equations of the second, third, fourth, and fifth degrees\n(1868)\nwere both published by E & F N Spon. He was an editor of the many-volume work\nSpons' Dictionary of Engineering, containing mechanical, military, and naval applications, with technical terms in French, German, Italian, and Spanish\n. Volume\n1\nappeared in\n1869\nbut, in August\n1872\n, he fell out with the Spons and was in dispute with them over the next few years. In\n1873\nByrne and his wife moved again, this time to Maidstone, Kent. By this time both Byrne and his wife were in ill health. Byrne's problems caused by the gas explosion had been made worse when he had a cab accident in which his right arm and collar-bone were injured. His wife was going blind, probably as a result of the earlier gas explosion. His health continued to deteriorate and his continuing dispute with his publisher meant that he was not receiving royalties on his books.\nHe died of bronchial pneumonia but his wife, despite her health problems, survived him by seventeen years dying on\n12\nJune\n1897\n.\nByrne published many other works which we have not discussed above and also had a number of inventions which again we have chosen not to discuss. His works on engineering topics sold well and provided him with enough money to live on. However his mathematical works did not sell well. Perhaps it is fitting to end with one of Byrne's comments made in\n1872\n(\nsee\n[\n10\n]\n)\n:-\nAll of my books, inventions, and important discoveries seem only to lead me into trouble.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}