{
  "nome_completo": "Oliver Heaviside",
  "nome_curto": "Oliver Heaviside",
  "ano_nascimento": "1850",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heaviside/",
  "lugar_nascimento": "Camden Town, London, England",
  "lugar_morte": "Torquay, Devon, England",
  "biografia": "Oliver Heaviside\n's parents were Rachel Elizabeth West and Thomas Heaviside. Thomas was a wood engraver and water colour artist. Oliver, the youngest of his parents four sons, was born at\n55\nKing Street in Camden Town. He caught scarlet fever when he was a young child and this affected his hearing. This was to have a major effect on his life, making his childhood unhappy with relations between himself and other children difficult. However his school results were rather good and in\n1865\nhe was placed fifth from\n500\npupils.\nAcademic subjects seemed to hold little attraction for Heaviside however and at age\n16\nhe left school. Perhaps he was more disillusioned with school than with learning since he continued to study after leaving school, in particular he learnt Morse code, studied electricity and studied further languages in particular Danish and German. He was aiming at a career as a telegrapher and in this he was advised and helped by his uncle Charles Wheatstone\n(\nthe piece of electrical apparatus known as the Wheatstone bridge is named after him\n)\n.\nIn\n1868\nHeaviside went to Denmark and became a telegrapher. He progressed quickly in his profession and returned to England in\n1871\nto take up a post in Newcastle upon Tyne in the office of Great Northern Telegraph Company which dealt with overseas traffic.\nHeaviside became increasingly deaf but he worked on his own researches into electricity. While still working as chief operator in Newcastle he began to publish papers on electricity, the first in\n1872\nand then the second in\n1873\nwas of sufficient interest to\nMaxwell\nthat he mentioned the results in the second edition of his\nTreatise on Electricity and Magnetism\n.\nMaxwell\n's treatise fascinated Heaviside and he gave up his job as a telegrapher and devoted his time to the study of the work. He later wrote:-\nI saw that it was great, greater, and greatest, with prodigious possibilities in its power. I was determined to master the book... It took me several years before I could understand as much as I possible could. Then I set\nMaxwell\naside and followed my own course. And I progressed much more quickly.\nAlthough his interest and understanding of this work was deep, Heaviside was not interested in rigour. His poorest subject at school had been the study of\nEuclid\n, a topic in which the emphasis was on rigorous proof, an idea strongly disliked by Heaviside who later wrote:-\nIt is shocking that young people should be addling their brains over mere logical subtleties, trying to understand the proof of one obvious fact in terms of something equally ... obvious.\nDespite this hatred of rigour, Heaviside was able to greatly simplify\nMaxwell\n's\n20\nequations in\n20\nvariables, replacing them by four equations in two variables. Today we call these '\nMaxwell\n's equations' forgetting that they are in fact 'Heaviside's equations'.\nFitzGerald\nwrote:-\nMaxwell's treatise is cumbered with the debris of his brilliant lines of assault, of his entrenched camps, of his battles. Oliver Heaviside has cleared these away, has opened up a direct route, has made a broad road, and has explored a considerable trace of country.\nHeaviside results on electromagnetism, impressive as they were, were overshadowed by the important methods in vector analysis which he developed in his investigations. His operational calculus, developed between\n1880\nand\n1887\n, caused much controversy however. He introduced his operational calculus to enable him to solve the ordinary\ndifferential equations\nwhich came out of the theory of electrical circuits. He replaced the differential operator\nd\nd\nx\n\\Large\\frac{d}{dx}\\normalsize\nd\nx\nd\n​\nby a variable\np\np\np\ntransforming a differential equation into an algebraic equation. The solution of the algebraic equation could be transformed back using conversion tables to give the solution of the original differential equation. Although highly successful in obtaining the answer, the correctness of Heaviside's calculus was not proved until\nBromwich\n's work.\nBurnside\nrejected one of Heaviside's papers on the operational calculus, which he had submitted to the\nProceedings of the Royal Society\n, on the grounds that it:-\n... contained errors of substance and had irredeemable inadequacies in proof.\nTait\nchampioned\nquaternions\nagainst the vector methods of Heaviside and\nGibbs\nand sent frequent letters to\nNature\nattacking Heaviside's methods.\nHeaviside went on to achieved further advances in knowledge, again receiving less than his just deserts. In\n1887\nPreece, a GPO technical expert, wrote a paper on clear telephone circuits. His paper is in error and Heaviside pointed this out in\nElectromagnetic induction and its propagation\npublished in the\nElectrician\non\n3\nJune\n1887\n. Heaviside, never one to avoid controversy, wrote:-\nSir\nW Thomson\n's theory of the submarine cable is a splendid thing. .. Mr Preece is much to be congratulated upon having assisted at the experiments upon which\n(\nso he tells us\n)\nSir\nW Thomson\nbased his theory, he should therefore have an unusually complete knowledge of it. But the theory of the eminent scientist does not resemble that of the eminent scienticulist, save remotely.\nIn this paper Heaviside gave, for the first time, the conditions necessary to transmit a signal without distortion. His idea for an induction coil to increase induction was never likely to be taken up by the GPO while Preece was in charge of research proposals. Heaviside dropped the idea but it was patented in\n1904\nin the United States. Michael Pupin of Columbia University and George Campbell of ATT both read Heaviside's papers about using induction coils at intervals along the telephone line. Both Campbell and Pupin applied for a patent which was awarded to Pupin in\n1904\n.\nNot all went badly for Heaviside however.\nThomson\n, giving his inaugural address in\n1889\nas President of the Institute of Electrical Engineers, described Heaviside as an authority. Lodge wrote to\nNature\ndescribing Heaviside was a man:-\n... whose profound researches into electro-magnetic waves have penetrated further than anyone yet understands.\nHeaviside was elected a Fellow of the\nRoyal Society\nin\n1891\n, perhaps the greatest honour he received.\nWhittaker\nrated Heaviside's operational calculus as one of the three most important discoveries of the late\n19\nth\nCentury.\nIn\n1902\nHeaviside predicted that there was an conducting layer in the atmosphere which allowed radio waves to follow the Earth's curvature. This layer in the atmosphere, the Heaviside layer, is named after him. Its existence was proved in\n1923\nwhen radio pulses were transmitted vertically upward and the returning pulses from the reflecting layer were received.\nIt would be a mistake to think that the honours that Heaviside received gave him happiness in the last part of his life. On the contrary he seemed to become more and more bitter as the years went by. In\n1909\nHeaviside moved to Torquay where he showed increasing evidence of a persecution complex. His neighbours related stories of Heaviside as a strange and embittered hermit who replaced his furniture with:-\n... granite blocks which stood about in the bare rooms like the furnishings of some Neolithic giant. Through those fantastic rooms he wandered, growing dirtier and dirtier, and more and more unkempt - with one exception. His nails were always exquisitely manicured, and painted a glistening cherry pink.\nPerhaps Heaviside has become more widely known due to the Andrew Lloyd Webber song\nJourney to the Heaviside Layer\nin the musical\nCats\n, based on the poems of T S Eliot:-\nUp up up past the Russell hotel\nUp up up to the Heaviside layer\nHowever it is doubtful if many people understand the greatness and significance of the achievements of this sad misunderstood genius. As stated in\n[\n3\n]\nHeaviside was:-\nA mathematical thinker whose work long failed to secure the recognition its brilliance deserved ...",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}