{
  "nome_completo": "Oskar Morgenstern",
  "nome_curto": "Oskar Morgenstern",
  "ano_nascimento": "1902",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morgenstern/",
  "lugar_nascimento": "Görlitz, Germany",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Oskar Morgenstern\nwas the son of the merchant Wilhelm Morgenstern and Margarete Teichler\n[\n52\n]\n:-\n[\nOskar's\n]\nfather Wilhelm is described by historian Robert Leonard as a businessman and merchant, although Oskar described him as more of a \"ne'er-do-well\" who at times seemed unable to hold a job.\nBoth views expressed in this quote may well be true since it appears that in Germany Wilhelm Morgenstern lost the family fortune on poor business ventures. The family moved to Austria in\n1914\nand Wilhelm worked for Julius Meinl and Co., the coffee and tea importer, in Vienna; the family was modestly comfortable. Oskar Morgenstern's mother Margarete Teichler was, apparently, an illegitimate daughter of Emperor Frederick III Germany and the daughter of his head gardener. Oskar often suggested that\n[\n48\n]\n:-\n... if his grandfather Frederick, a liberal who surrounded himself with scholars and artists, had lived, there might have been no World War I. But Frederick III reigned only\n100\ndays, and died of throat cancer.\nOskar was twelve years old when the Morgenstern family moved to Vienna. He attended the Gymnasium where he did well in German but less well in Latin and mathematics\n[\n21\n]\n:-\nAt the Gymnasium, like many of his fellows, he entertained strong German nationalist feelings, writing youthful articles denouncing foreign cultural influences.\nMorgenstern would in later life have very different views from those he expressed as a young man but anyone interested in social issues at this time had to be influenced by the strong views being expressed by their teachers and others around them. He wrote\n[\n37\n]\n:-\n... what would Europe be, what would the world be without the German people and its achievements! Germany can be satisfied with itself, there is no need to borrow from foreign peoples, who force it to further intellectual enslavement, but from its simply inexhaustible resources it is able to give to all those who want to receive. And yet, Germany does borrow: theatre and poetry are signs of a depressed mind. This has to be fought. All the foreign dirt which will wipe out healthy ideas, has to be removed with violence.\nTuberculosis became a serious problem in many countries during and after World War I and in Vienna it was particularly bad with the situation becoming slowly worse from\n1914\nto\n1920\n. Morgenstern's parents sent him to spend the summers of\n1921\nand\n1922\nwith relatives in Sweden to reduce the risk for him. We mentioned above that Morgenstern's father worked for Julius Meinl and it was Meinl who strongly encouraged the young boy to undertake scholarly studies. Morgenstern entered the University of Vienna in\n1922\nintending to study economics. This required him to enrol for a degree in political science taught in the Faculty of Law. As a consequence he took courses on economics, philosophy, and political and economic history but no science or mathematics courses were offered.\nThe first to be a strong influence on Morgenstern was Othmar Spann\n(1878\n-\n1950)\n, a professor of Economics. Spann's lectures took a philosophical approach and he had strong views particularly opposing the philosophy of individualism. Morgenstern wrote in his diary in\n1923\n:-\nLooking at my papers, work and reading, one would think I were a student of philosophy and not of economics. But that is no disgrace ... my philosophical knowledge is very fragmentary in comparison to my knowledge of economics.\nHe would, however, soon move away from Spann's ideas and completely reject them. Later in\n1923\nhe took a course by Friedrich Freiherr von Wieser\n(1851\n-\n1926)\nwho had been a student of the economist Carl Menger, the father of the mathematician\nKarl Menger\n. Von Wieser was highly critical of Spann's views and led Morgenstern to study the works of Carl Menger. Von Wieser retired and Hans Mayer\n(1879\n-\n1955)\nwas appointed. Mayer was a follower of von Wieser and Carl Menger, and gave Morgenstern an understanding of the place of mathematics in economic analysis. Morgenstern wrote:-\nSpann thought that through me he would exert an influence on Mayer and get him on the right track - you know, anti-Marxist and anti-everything. ... It didn't turn out this way because I got captured by marginal utility theory and Mayer pulled me into his orbit and Wieser's orbit.\nMorgenstern was also influenced by the economist Ludwig von Mises\n(1881\n-\n1973)\n, the elder brother of the mathematician\nRichard von Mises\n. Ludwig von Mises was on the staff at the University of Vienna and hoped to become a professor when von Wieser retired. Being Jewish may have been a factor in his failure to be appointed. Von Mises was less keen on mathematical applications to economics. He said\n(\nsee\n[\n21\n]\n)\n:-\nAll of mathematical economics with its beautiful equations and curves is nothing but useless doodling. The equations and curves must be preceded by non-mathematical considerations; setting up equations does not enhance our knowledge.\nIn\n1925\nMorgenstern was awarded a doctorate for his thesis on marginal productivity. In the same year be took Austrian Nationality and was awarded a Laura Spelman Rockefeller Fellowship, which allowed him to undertake further study in London before visiting Harvard and Columbia in the United States. While at the London School of Economics, Morgenstern visited\nFrancis Edgeworth\nin Oxford since he wanted to discuss\nEdgeworth\n's contract curve in his\nMathematical Psychics\n[\n26\n]\n:-\nOn my way to the United States in\n1925\nI visited the aged\nEdgeworth\nin Oxford. I expressed great pleasure at the publication of his collected papers, but urged him repeatedly to republish the 'Mathematical Psychics', then totally out of print. His death intervened before he could carry out my suggestion, which he had accepted.\nIn the United States the Rockefeller Fellowship allowed him to spend some time in New York at Columbia University and at Harvard in Cambridge. He was then awarded a research fellowship in economics at Harvard University for the academic year of\n1926\n-\n27\n. While at Harvard he wrote his first book\nWirtschaftsprognose, eine Untersuchung über ihre Voraussetzungen und Möglichkeiten\nⓉ\n(\nEconomic forecasting, an investigation into its prerequisites and possibilities\n)\nwhich was published in\n1928\n. He writes\n[\n26\n]\n:-\nIn that book ... the whole question of economic forecasting was examined epistemologically, and the difficulties and virtual impossibilities of prediction were studied to the best of my then-existing knowledge. In my general scientific outlook I was strongly influenced by the work of\nHermann Weyl\n,\nBertrand Russell\n, and others in the mathematical and physical sciences.\nAfter the year at Harvard, he was awarded a fellowship for studies in Paris and Rome in\n1927\n-\n28\nbefore returning to Vienna. On\n24\nMay\n1928\nhis\nhabilitation\nthesis was approved and he was invited to give an examination lecture despite an objection from Spann who abstained in the vote. Spann tried unsuccessfully to get the faculty to reverse its decision on\n16\nJune but the examination lecture went ahead and the faculty applied to the Ministry for Morgenstern's habilitation to be approved. Again Spann abstained and this was noted on the request which went to the Ministry. The Ministry did not respond and Hans Mayer and others wrote providing further evidence to support Morgenstern. Eventually, in\n1929\n, the Ministry found that \"Professor Spann's isolated opinion does not offer enough reason to withhold approval of the habilitation ...\" and Morgenstern became a Private Lecturer of Political Economy.\nIn\n1931\nMorgenstern was appointed head of the Austrian Institute for Economic Research. In\n1935\nhe published the paper\nVollkommene Voraussicht und Wirtschaftliches Gleichgewicht\nⓉ\n(\nPerfect foresight and economic equilibrium\n)\n. In this paper he\n[\n25\n]\n:-\n... insisted that perfect foresight, if such a thing could ever exist, would not banish risk since \"always there is exhibited an endless chain of reciprocally conjectural reactions and counter-reactions. This chain can never be broken by an act of knowledge but always only through an arbitrary act - a resolution. ... Unlimited foresight and economic equilibrium are thus irreconcilable with one another.\"\nThis paper led to an invitation to Morgenstern to speak at the Vienna Circle. Members of the Vienna Circle, which was led by the philosopher Moritz Schlick, included the mathematicians\nHans Hahn\n,\nKarl Menger\nand\nKurt Gödel\n, the physicist\nPhilipp Frank\n, the social scientist Otto Neurath, his wife, the mathematician Olga Hahn-Neurath, the philosopher Viktor Kraft, the mathematicians Theodor Radacovic and Gustav Bergmann, and the philosopher and logician Rudolf Carnap. Morgenstern discussed the ideas in his paper in a lengthy session and attended several other sessions of the Vienna Circle.\nKarl Menger\nwas very interested in Morgenstern's talk to the Vienna Circle and invited him to give the same talk to his Colloquium.\nEduard Cech\nwas at Morgenstern's talk to\nMenger\n's Colloquium and\nCech\npointed out that\nvon Neumann\nhad addressed similar questions in his\n1928\npaper\nZur Theorie der Gesellschaftsspiele\nⓉ\n(\nOn the theory of parlour games\n)\n. Morgenstern explained in\n[\n26\n]\nhow this discussion with\nCech\nled to his increasing interest in mathematics:-\nCech\noutlined to me its principal ideas and results and was very eager that I should study this particular work. I intended to do so, but the great burden of work I was carrying at that time as director of the Institute of Business Cycle Research during civil war conditions, with the Nazis threatening, with frequent trips to the League of Nations in Geneva, to Paris and London, etc., made this impossible. Nevertheless, even during those years in the\n1930\n's in Vienna, I managed to read a lot of logic and set theory, e.g.,\nHilbert\n-\nAckermann\n,\nFraenkel\n,\nHilbert\n-\nBernays\n,\nHahn\n,\nHausdorff\n, etc. I also attempted to approach\nKurt Gödel\n's great work on undecidability, helped and guided by my friend\nKarl Menger\n. At the same time\nAbraham Wald\n, to whom I had been able to offer a position as statistician in my Institute, gave me special instruction in various fields of mathematics.\nMorgenstern's international reputation grew and he was invited by the Carnegie Endowment for International Peace to visit four American universities in\n1938\n. He sailed on the Bremen from Cherbourg, France, arriving in New York on\n20\nJanuary\n1939\n. His original intended length of stay in the United States was five months. German troops marched into Austria in March\n1938\nand, on\n13\nMarch, the Anschluss annexed Austria into the German Reich. On\n22\nApril\n1938\n, since Morgenstern's ideas did not align with those of the Nazis, the Ministry of Education suspended his teaching licence until further notice. Morgenstern extended his U.S. visa so that he could stay in the United States until\n1\nOctober\n1938\n. In September\n1938\nthe Ministry of Education revoked his habilitation so that he could no longer teach in Austria. By this time Morgenstern had already decided that he would stay in the United States and not return to Austria. From six invitations, he chose to accept a three-year appointment as Class of\n1913\nLecturer in Political Economy at Princeton University. In a letter written on\n21\nJuly\n1938\n, he explained his reasons\n(\nsee for example\n[\n39\n]\n)\n:-\nFor many reasons I choose Princeton, partly because it is but one hour from New York partly, however, because they wanted me already last year which shows that they wanted me independently of the events in Austria. This gives it a very nice psychological side.\nAt Princeton, Morgenstern soon met other scientists with whom he could discuss applying mathematical ideas to economics. On\n1\nFebruary\n1939\nhe met\nJohn von Neumann\n,\nNiels Bohr\n,\nOswald Veblen\nand others at the Nassau Club.\nBohr\nand\nvon Neumann\ninvited Morgenstern to tea at Fine Hall and they had lengthy discussions, mostly involving\nBohr\n's ideas on quantum theory, particularly how an observer influenced the results of experiments. He dined with these and others at\nHermann Weyl\n's house, where he met\nAlbert Einstein\nand discussed with him how intuition affected behaviour. Morgenstern and\nvon Neumann\nbegan intense discussions in October\n1939\nbut at this stage they do not seem to have been talking about game theory. Their friendship developed and\nvon Neumann\nand his wife invited Morgenstern to dinner at their home on\n25\nJanuary\n1940\n,\n9\nMarch\n1940\nand\n1\nApril\n1940\n.\nVon Neumann\nbecame more interested in Morgenstern's work, and read Morgenstern's\n1934\npaper\nDas Zeitmoment in der Wertlehre\nⓉ\n(\nThe time element in the theory of value\n)\nin the\nJournal of Economics\n. He said it was excellent and was worth expanding into a book. The two were now having many deep discussions but this was interrupted when, at the beginning of May,\nvon Neumann\nleft for a trip to the West Coast. Morgenstern noted in his diary on\n3\nMay\n1940\n(\nsee for example\n[\n39\n]\n)\n:-\nWe spent several evenings together and discussed for many hours. Mainly mathematical economics. It would be wonderful, if we could write a book together.\nThe trip to the West Coast was part work, part pleasure, for\nvon Neumann\n. He lectured in Seattle on the theory of games and wrote to Morgenstern on\n16\nJuly saying he had some new results on four-or-more-person games.\nBy August\n1940\nvon Neumann\nwas back in Princeton and the collaboration continued.\nVon Neumann\nwas working intensely on other topics, but still found time to write two papers on game theory. Morgenstern, at\nvon Neumann\n's suggestion, began work on a paper on maxims of behaviour. Morgenstern tried to simplify\nvon Neumann\n's theory of games and\nvon Neumann\nsuggested that the two should write a joint book. By September\n1941\nthey had a draft of the first chapter, and by November of that year had a draft of Chapter\n2\n. Collaboration became more difficult when\nvon Neumann\nmoved to Washington in September\n1942\nbut by the end of\n1942\nthe manuscript of their book\nTheory of games and economic behavior\nwas complete.\nVon Neumann\nwent to Europe in January\n1943\nand Morgenstern organised the typing of the text and the drawing of diagrams and graphs. He gave the completed work to Princeton University Press and the book was published in\n1944\n.\nFor more information about\nTheory of games and economic behavior\nincluding extracts from the Preface and from reviews, see\nTHIS LINK\n.\nIn\n1944\nMorgenstern became a full professor at Princeton.\nAfter the event, Morgenstern wrote about how he and\nEinstein\nhelped\nGödel\nget his American naturalisation in\n1947\n. You can read about this at\nTHIS LINK\n.\nHe married Dorothy L Young\n(1917\n-\n2008)\nin\n1948\n, the marriage licence being issued on\n4\nJune\n1948\n. Dorothy Young was the daughter of Andrew Dewing Young\n(1877\n-\n1956)\nand his wife Frieda Elling\n(1881\n-\n1960)\n. Oskar and Dorothy Morgenstern had two children, Carl Friedrich Morgenstern\n(\nborn\n1950)\nand Karin Dewing Morgenstern. Carl Morgenstern studied mathematics and was awarded a Ph.D. by the University of Colorado Boulder in\n1977\nfor his thesis\nCompact Extensions of\nL\nω\nL^{\\omega}\nL\nω\nand Topics in Set Theory\n. Karin Morgenstern graduated from Princeton Day School then senior majored in Fine Arts and English Literature at Bard College at Simon's Rock in Great Barrington, Massachusetts\n(1977)\n. She did graduate work at the Philadelphia College of Art and at the University of Maine at Orono. She worked as a preschool teacher in Las Vegas and married Michael Louis Papp on\n30\nMay\n1987\n.\nMorgenstern's life was completely changed by his work on game theory. He was asked to undertake many advisory roles. For example he became an advisor to the Rand Corporation in\n1948\n, from\n1955\nto\n1957\nhe advised the United States Atomic Energy Commission, an agency of the United States government set up after World War II by the U.S. Congress, and from\n1959\nto\n1960\nhe was an advisor to the White House.\nThe importance that game theory achieved, with Morgenstern seen as a world leading expert, can be seen by its influence on major world events. When the Korean War broke out in\n1951\n, the United States under President Truman, asked Morgenstern and his game theory colleagues for the best resolution of the conflict. Morgenstern and colleagues constructed a\n3000\n×\n3000\nstrategy matrix and calculated the ideal solution on an ENIAC-Computer. Taking the game theory \"best strategy\", President Truman decided that his troops should not cross the Yalu River and that a ceasefire should be negotiated. Commander-in-Chief MacArthur, who led the troops, wanted to liberate North Korea from Communist control and ordered the troops to cross. President Truman fired MacArthur.\nIn addition to his professorship at Princeton and his advisory roles, Morgenstern also worked at the National Bureau for Economic Research from\n1940\nuntil\n1959\n. During that period he spent time back in Europe, as a Visiting Professor in Münster in\n1956\nand as a Visiting Professor in Basel in\n1959\n-\n60\n. At this time, in collaboration with the Austrian-American sociologist and mathematician Paul Felix Lazarsfeld\n(1901\n-\n1976)\n, he worked toward founding the Institut für Höhere Studien in Vienna, becoming a member of the academic advisory council in\n1960\n. The Institute, which specialises in social sciences, opened in\n1963\n.\nMorgenstern was an editor of the journal\nZeitschrift für Nationalökonomie\nfrom\n1956\n, of the journal\nZeitschrift für Wahrscheinlichkeitstheorie\nfrom\n1962\n, of the journal\nDecision and Control\nfrom\n1965\n, and the\nInternational Journal of Game Theory\nfrom\n1970\n. In\n1969\nhe became the first chairman of Mathematica Policy research, now known as Mathematica Inc and not to be confused with Wolfram Mathematica\n[\n8\n]\n:-\nMathematica is a technical consulting, policy research and computer software system firm working in the areas of national policy studies, operations research, system analysis, economic analysis, opinion research, computer software systems, survey development, and the design and development of public gaming systems. Its services are utilised by federal, state and local government agencies, as well as by private industry, trade associations and educational and non-profit organisations.\nIn\n1970\nMorgenstern retired from his Professorship at Princeton and was made emeritus. He had already received six invitations from American universities to join them but none from Austrian universities. Although he would have liked to return to Austria, he accepted the offer from New York University and spent six years there as Distinguished Professor in Game Theory and Mathematical Economics.\nHe received honorary degrees from the universities of Mannheim\n(1957)\n, Basel\n(1960)\nand Vienna\n(1965)\n. In\n1976\nhe was elected a Distinguished Fellow of the American Economic Association\n[\n34\n]\n:-\nA spirit of innovation, a deep but constructive scepticism, combined with a great ability to suggest important overlooked problems and new ways to approach them, have marked Oskar Morgenstern's long and productive life. His searching interest in the paradox of perfect foresight was followed by his fruitful collaboration with\nJohn von Neumann\non the 'Theory of Games'. His work on the accuracy of economic information is a continuing challenge to the profession. His most recent book with Gerald Thompson, 'Mathematical Theory of Expanding and Contracting Economies', is a further development of Morgenstern's early interest in business cycle theory combined with the\nvon Neumann\nmodel of an expanding economy. His ability to inspire his students and colleagues and his perseverance in identifying and pressing forward to the solution of fundamental problems in economic theory are basic traits of his unique distinction.\nFollowing his death in July\n1977\n, he was buried in Princeton Cemetery, Mercer County, New Jersey. Two years after his death, his wife Dorothy Morgenstern married Harris Henderson Thomas on Monday\n28\nJuly\n1979\n. Harris Henderson Thomas taught at the Phillips Exeter Academy in Exeter, New Hampshire, for\n40\nyears. Following her death in Chapel Hill, North Carolina on\n25\nOctober\n2008\n, Dorothy was buried with Oskar Morgenstern in Princeton Cemetery.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}