{
  "nome_completo": "Oskar Fabian",
  "nome_curto": "Oskar Fabian",
  "ano_nascimento": "1846",
  "ano_morte": "1899",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fabian/",
  "lugar_nascimento": "Nowy Dwór Mazowiecki (near Warsaw), Russian Empire (now Poland)",
  "lugar_morte": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "biografia": "Oskar Fabian\nwas the son of the pharmacist Szymon Fabian\n(1803\n-\n1885)\nand his wife Bertha. Szymon Fabian was born on\n25\nNovember\n1803\nin Poznań. He studied pharmacy at the University of Warsaw and in Berlin, where he obtained a master's degree. He founded a pharmacy in Nowy Dwór in\n1833\nwhere he also founded a laboratory. In\n1835\nhe published the\n2\n-volume work\nPharmacja\nⓉ\n(\nPharmacy\n)\nwhich was the first textbook on pharmacy in the Polish language. Szymon and Bertha Fabian had two sons, Oskar Fabian, the subject of this biography born\n28\nFebruary\n1846\n, and Aleksander Fabian\n(1847\n-\n1911)\n, born in Nowy Dwór on\n30\nJuly\n1847\nwho became a physician. Szymon Fabian died in Nowy Dwór Mazowiecki on\n18\nApril\n1885\n.\nOskar Fabian attended the provincial high school, then the Third High School in Warsaw from which he graduated in\n1864\n. He continued to study in Warsaw, enrolling in the mathematics and physics department of the Main School of Warsaw in\n1864\n. After four years of study, Fabian moved to Vienna where he spent the years\n1868\n-\n1870\nundertaking research for his doctorate. He was awarded his doctorate on\n10\nMay\n1870\n. Following this, he went to Heidelberg where he continued to undertake research during\n1870\n-\n71\n. He had already obtained a teaching diploma from the University of Vienna and after leaving Heidelberg he moved to Lwów where he taught from\n1871\nto\n1873\nat the Real Gymnasium.\nWhile teaching at the Real Gymnasium in Lwów, Fabian wrote two articles both published in\n1871\n. The article\n[\n4\n]\n,\nOn the convergence and divergence of infinite series\n, begins as follows:-\nIn Volume\n53\nof the Reports of the Sessions of the Vienna Academy of Sciences, there is a simple derivation of Gauss's theorem on the convergence of series, given by J Pranghofer. After taking a closer look at the basis it is difficult to agree with this argument, although recommendable due to its brevity.\nThe article\n[\n5\n]\n,\nBending of light and wavelengths\n, has the following Preface:-\nIn submitting this work to the judgment of the gracious reader, I must say at the outset that its purpose is not to discover new truths or hitherto unknown phenomena. It is only to gather into one organ to present a complete whole of what has been put together in dozens of larger and smaller works from the\n17\nth century to the present; to present a picture of the gradual development of theories explaining the phenomenon of light bending; and to facilitate the acquisition of a deeper knowledge of this subject than is provided by ordinary, even quite extensive, physics textbooks.\nIn this work, Fabian examined the diffraction of light, looking at the ideas about this phenomenon from the time of\nFrancesco Grimaldi\nin the mid-\n17\nth century. In fact, as Fabian states,\nGrimaldi\ngave this phenomenon the name 'diffractio'.\nNewton\nrepeated\nGrimaldi\n's experiments and came up with his own theory. Fabian looks at how ideas developed from that time, particularly the arguments over light as a wave or as particles.\nFabian submitted these two articles to the University of Lwów as\nhabilitation\ntheses and in\n1872\nthese were approved and he gained the right to teach at the university and was appointed as a docent. The University of Lwów created a new Department of Mathematical Physics where he began to teach. On\n14\nSeptember\n1873\n, after only one year as a docent, Fabian was promoted to become an extraordinary Professor of Mathematical Physics and became Head of the Department of Mathematical Physics.\nWawrzyniec Żmurko\nhad been appointed as head of the Department of Mathematics at the University of Lwów in\n1871\n. He had interests in both pure mathematics and in the applications of mathematics so Fabian and\nŻmurko\n, although in different departments, had close mathematical interests. They became close friends and worked together to build mathematics at the University. There had been changes at the University around the time Fabian was appointed, particularly related to the languages of instruction. Although there was some teaching in Polish before\n1871\n, the majority of courses were taught in German. There was a major change beginning in\n1871\nwhen a Decree of Emperor Franz Joseph I of Austria established Polish as an official language for all teaching in Galicia.\nFabian and\nŻmurko\nbegan to work closely together, particularly collaborating on teaching methods.\nŻmurko\nhad developed his own ideas about teaching, particularly through spatial methods and Fabian quickly saw the benefits of this system and in\n1876\nhe published his own \"textbook of mathematics, prepared according to the teaching system and with the collaboration of university professor\nŻmurko\n.\" We see how the language of teaching was an issue at this time since two versions of the book were published simultaneously in\n1876\n, one being in Polish and one in German. Fabian writes in the Preface\n[\n7\n]\n:-\nIn order to standardise the teaching of mathematics in secondary schools, a survey was held in Lwów last autumn, in the deliberations of which almost all professors of local secondary schools took part, teachers of mathematics or related subjects, and several professors of the university and technical academy. The first task of the survey was to consider the principles according to which a mathematics textbook should be composed, meeting the requirements of a strictly methodical teaching and covering all the material prescribed in the applicable curriculum. As for principles, the survey expressed, first of all, the opinion that science should begin with the visualisation of mathematical truths, and only then gradually move to abstraction. This idea, the validity of which no one today will deny, has not been consistently presented in any school book so far. The development of this fundamental idea leads to the conviction that mathematical truth must first of all manifest itself in spatial quantities, as those which immediately come under the senses, and by means of which all other quantities can be represented. From the consideration of spatial quantities it is necessary to derive the whole theory of mathematical operations and in this way create a basis for abstract mathematics. Such a mode of action constitutes the principle of Professor\nŻmurko\n's method, and the survey unanimously resolved to try to introduce this method into schools, as the only one consistent with the essential concept of mathematics.\nAlthough in the works of professor\nŻmurko\nthe whole system of science is fully developed, it is nevertheless important to note that none of these works is intended for use by average students at schools, but certainly designed for more developed minds. It turned out that I had to compose a new book, which I was summoned to write by a questionnaire. I accepted this summons on condition that the manuscript will be read before printing by those in the survey, so that I could incorporate the advice provided by pedagogues immediately into the first issue.\nI must here express my gratitude to my esteemed colleagues for the fact that this part, which is now leaving the press and which covers geometry, was read attentively with untiring patience and intense determination, enriching me, so that I received not one valuable remark of which I did not fail to take advantage.\nThe earlier or later appearance of the next parts will depend primarily on how much time it takes for those in the survey to read them.\nWhile working on the book I was in constant direct contact with Professor\nŻmurko\n, and in this way I was able to utilise all the simplifications and additions that he introduced into his system. The curriculum in force in our secondary schools requires separate teaching of geometry and arithmetic. However, the system according to which this book is arranged does not recognise such separate chapters, but rather the whole of mathematics with all its branches is considered as a uniform whole. Due to the accepted custom and the applicable regulations, however, I had to keep this chapter. Taking into account the division of the material into individual classes, I arranged it so that arithmetic could always be based on what the student has already learned in geometry. For this purpose, I have divided the whole into four books, namely:\nPart I. A. Geometry for lower classes.\nPart I. B. Arithmetic for lower grades.\nPart II. A. Geometry for higher grades.\nPart II. B. Algebra for higher grades.\nThe book published in\n1876\nis\nPart I. A. Geometry for lower classes.\nWe have not found copies of the three further books he was intending to publish, so it is possible that the experimental teaching method was not as successful as Fabian had hoped.\nIn\n1876\nFabian took on a second position when, in addition to his role as an extra-ordinary professor at the University of Lwów, he became a docent at the Lwów Polytechnic School. He continued to hold both positions until\n1881\nwhen he was promoted to full professor at the University of Lwów and resigned his position at the Polytechnic.\nFabian became even closer to the\nŻmurko\nfamily when he married Eugenia Żmurków\n(1854\n-\n1922)\n, the daughter of\nWawrzyniec Żmurko\nand Henryka Zofalów. The\nŻmurko\nfamily tomb records that Ewelina Fabian\n(20\nFebruary\n1874\n-\n4\nJanuary\n1875)\nand Alfred Fabian\n(28\nApril\n1884\n-\n24\nFebruary\n1908)\nare buried there. These must be children of Oskar Fabian and his wife Eugenia, who were both buried in that tomb, but of course they could have had other children.\nCertainly Fabian helped\nŻmurko\ncreate the beginnings of the important school of mathematics at Lwów. Both taught\nJózef Puzyna\n, an undergraduate student at the University of Lwów from\n1875\nto\n1880\n, who attended lectures on mathematics from\nŻmurko\nand on applied mathematics by Fabian.\nPuzyna\nwas awarded a doctorate by the University of Lwów on\n5\nJuly\n1883\nafter his thesis\nO pozornie dwuwartościowych określonych całkach podwójnych\nⓉ\n(\nOn apparently two-valued definite double integrals\n)\nhad been examined by\nŻmurko\nand Fabian. On\n8\nNovember\n1884\n,\nPuzyna\nasked for admission to habilitate and he was examined by\nŻmurko\nwith Fabian chairing the examination.\nLet us mention a few more publications of Oskar Fabian. In\n1881\nhe published the article\n[\n6\n]\nwhich is about 'the so-called fourth state of matter'. William Crookes\n(1832\n-\n1919)\nhad given the lecture \"On radiant matter\" to the\nBritish Association for the Advancement of Science\nheld at Sheffield, England, on Friday\n22\nAugust\n1879\n. Fabian begins the Preface to\n[\n6\n]\nas follows:-\nThe interesting experiments of the English physicist Crookes on extremely rarefied gases prompted this researcher to put forward a theory that assumes, in addition to the solid, liquid and gaseous states of matter, a fourth state, called ultra-gaseous, or radiant state of matter.\nThe fundamental ideas of his theory were expressed by Crookes in\n1879\nat the annual meeting of the\nBritish Association for the Advancement of Science\nin an extensive lecture on radiant matter, as well as in several in articles published in various scientific journals. While the general experiments themselves have aroused interest, their theoretical explanation has encountered widespread doubt. And last year Dr Puluj, a lecturer at the University of Vienna, subjected them to a detailed analysis in an extensive work, the result of which was not only the rejection of Crookes' views, but also the formulation of his own theory, based on the assumption of the motion of metal particles, moving through rarefied gas.\nDr Puluj published his research under the title \"Strahlende Elektrodenmaterie.\"\nConsidering the experiments of Crookes and repeating them, I have long been convinced that the observed phenomena do not require one to seek an explanation in some new state of concentration; but rather in the electrification of gas molecules. And the valuable work of Dr Puluj, although it led him to other theoretical conclusions, confirms for me even more strongly my preciously made conviction.\nThe reference to Dr Puluj's work on this topic refers to Johann Puluj\n(1845\n-\n1918)\n, at that time a\ndocent\nat the University of Vienna.\nAlthough Fabian was the head of the Department for Theoretical Physics at the University of Lwów, he also taught courses in the Department of Mathematics. Here are some of the courses he taught in Mathematics in the\n1980\ns and\n1990\ns.\nSummer\n1881\n-\n82\n: On the numerical equations\n(3\nhours a week\n)\n.\nWinter\n1884\n-\n85\n: The initial parts of mathematics with special attention to the needs of theoretical physics\n(3\nhours a week\n)\n.\nWinter\n1888\n-\n89\n: Introduction to the infinitesimal calculus\n(3\nhours a week\n)\n.\nWinter\n1890\n-\n91\n: Analytic Geometry\n(3\nhours a week\n)\n.\nWinter\n1891\n-\n92\n: Algebraic analysis\n(3\nhours a week\n)\n.\nWinter\n1894\n-\n95\n: Higher Algebra\n(3\nhours a week\n)\n.\nSummer\n1894\n-\n95\n: Analytic Geometry\n(3\nhours a week\n)\n.\nWinter\n1895\n-\n96\n: Numerical equations\n(2\nhours a week\n)\n.\nWinter\n1897\n-\n98\n: Analytic Geometry\n(3\nhours a week\n)\n.\nSummer\n1897\n-\n98\n: Analytic Geometry, continuation\n(3\nhours a week\n)\n.\nWinter\n1898\n-\n99\n: Differential calculus\n(3\nhours a week\n)\n.\nFabian was a member of the\nCopernicus\nNaturalist Society in Lwów. He served as secretary of the Society\n1877\n-\n80\nand president in\n1882\n-\n83\n. His inauguration speech at the\n12\nth Congress of the Polish\nCopernicus\nNaturalist Society in Lwów was published in the Society's journal\nKosmos\n, see\n[\n8\n]\n.\nIn\n1886\nFabian published a second textbook\n[\n9\n]\n, a text aimed at university students,\nOutline of analytical mechanics as an introduction to fundamental physics\n. He begin the Preface by writing:-\nIn writing this book, I have tried primarily to define the concepts in such an understandable way so as to avoid any metaphysical influences in the derivation of the laws of mechanics.\nFabian died at the age of\n53\nin\n1899\nand was buried in the tomb of the family of\nWawrzyniec Żmurko\nin Łyczakowski Cemetery in Lwów, now known as Lychakiv Cemetery in Lviv.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}