{
  "nome_completo": "Oswald Veblen",
  "nome_curto": "Oswald Veblen",
  "ano_nascimento": "1880",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Veblen/",
  "lugar_nascimento": "Decorah, Iowa, USA",
  "lugar_morte": "Brooklyn, Maine, USA",
  "biografia": "Oswald Veblen\n's parents were Andrew Anderson Veblen and Kirsti Hougen. Andrew Veblen's father was a Norwegian cabinet maker but became a farmer after emigrating from Norway to the United States in\n1847\n. One of Andrew Veblen's brothers, Thorstein Bunde Veblen, was a well-known economist and social critic. Andrew Veblen, was the eldest of his parents twelve children and he was a teacher at Luther College in Decorah, Iowa, at the time Oswald was born. He left Luther College when his son Oswald was one year old and he became professor of mathematics and physics at the University of Iowa.\nVeblen attended school in Iowa City before entering the University of Iowa in\n1894\n, receiving his A.B. in\n1898\n. After a year spent as a laboratory assistant at the University of Iowa, Veblen spent a year at Harvard University where he was awarded a second B.A. in\n1900\n, before going to the University of Chicago to undertake research. Archibald writes in\n[\n4\n]\n:-\nHe received the major part of his mathematical training at the University of Chicago from that inspiring trio\nBolza\n,\nMaschke\n, and\nEliakim Moore\n. Under their direction he laid the basis for the important work he was later to achieve in the fields of foundations of geometry,\nprojective geometry\n,\ntopology\n, differential invariants and spinors. His often quoted dissertation under\nMoore\n, on a system of axioms of Euclidean geometry, followed the trend of development of\nPasch\n(1882)\nand\nPeano\n(1889\n,\n1894)\nrather than that of\nHilbert\n(1899)\nand\nPieri\n(1899)\n.\nIn fact Veblen first impressed\nMoore\nwhen he attended his seminar in\n1901\n. When Moore published\nOn the projective axioms of geometry\nin the following year he acknowledged Veblen's contribution, writing:-\n... queries and remarks of members of this course, in particular Mr O Veblen, have been a source of much stimulus.\nVeblen's doctoral dissertation, supervised by\nMoore\n, was entitled\nA System of Axioms for Geometry\nand he was awarded his doctorate from the University of Chicago in\n1903\n. In it Veblen gave an axiom system based on point and order rather than on the traditional notions of point, line and plane. He presented twelve axioms for Euclidean geometry which he proved to be an complete system of axioms and he also proved the independence of the axioms. He spent another two years at Chicago after the award of his doctorate as an associate in mathematics. During this time he effectively supervised the doctoral studies of\nRobert Moore\n, officially a student of\nEliakim Moore\n's, who was awarded a doctorate in\n1905\nfor a dissertation entitled\nSets of Metrical Hypotheses for Geometry\n. During this period Veblen worked on putting his own thesis into a form for publication and\nA system of axioms for geometry\nappeared as a\n41\npage paper in the\nTransactions of the American Mathematical Society\nin\n1904\n. Already at this time he had begun to undertake research in topology\n(\nor analysis situs as it was then called\n)\nand he published\nTheory on plane curves in non-metrical analysis situs\nin\n1905\n.\nLeaving Chicago, Veblen taught mathematics at Princeton University from\n1905\nto\n1932\n. His initial appointment to Princeton in\n1905\nwas as a preceptor, a new position which Woodrow Wilson, the president of Princeton, introduced in an attempt to raise the level of scholarship at the university. Veblen married Elizabeth Mary Dixon Richardson in\n1908\n. She was the sister of Owen Richardson who was the professor of physics at Princeton, and later went on to receive the Nobel prize for physics in\n1928\n. Veblen and his wife Elizabeth had no children. Two years after his marriage, in\n1910\n, Veblen was promoted to professor of mathematics at Princeton.\nDuring the First World War he served first as a captain, later as a major in the army. He sought a commission in the Ordnance Department in the spring of\n1917\nand was appointed to the Office of Ballistics Research at the new Aberdeen Proving Ground in Maryland. After basic training during the summer of\n1917\n, he arrived at the Proving Ground on\n4\nJanuary\n1918\n. Veblen headed the Division of Experimental Ballistics which was the mathematical research facility at the Proving Ground. He began collecting data on the range of a\n2\n.\n95\ninch gun. He then worked on the problem of transferring raw data into tables of results and for this he had a staff of men to undertake the lengthy hand calculations. He employed\nJoseph Ritt\nto take charge of these computers. His work led to new ballistics theory. See\n[\n7\n]\nfor details of the work he undertook during this period.\nVeblen was honoured by Princeton in\n1926\nwhen they named him Henry B Fine Professor of Mathematics. In the academic year\n1928\n-\n29\nhe taught at Oxford as part of an exchange with\nG H Hardy\n. In\n1929\nfunds were provided for Fine Hall at Princeton and Veblen provided most of the ideas that went into its design. He wanted the mathematicians in Fine Hall to be able to:-\n... group themselves for mutual encouragement and support.\n[\nIt had to be a place where\n]\nthe young recruit and the old campaigner\n[\ncould have\n]\nthose informal and easy contacts that are so important to each of them.\nHowever he also wanted a room reserved for professors since:-\n... not always understood by those who try to bring about closer relations between faculty and students\n[\nis\n]\nthat in all forms of social intercourse the provisions for privacy are as important as those for proximity.\nIn\n1932\nhe spent time in Germany and lectured at Göttingen, Berlin and Hamburg. Zund writes that this experience\n[\n14\n]\n:-\n... gave him a first hand glimpse of the approaching turbulence in Germany, and he subsequently worked tirelessly to help place refugees who came to the United States.\nLeon Warren Cohen, in an interview in\n1984\n, recalled Veblen's attitude towards placing refugee mathematicians:-\nIt was the Depression. Young American mathematicians were finding it hard to get appointments, and the question of whether to bring in foreign mathematicians to occupy positions which would then not be available to American mathematicians was debated. Veblen took what I would call the broader view. I hesitate to attribute views to Veblen, but the considerations that seem to have actuated him were two: a concern for the welfare of mathematics itself, and a humane concern for certain individuals who had talent. Veblen was a grand man, and the people for whom he made it possible to come to the United States made a great contribution to mathematics.\nG D Birkhoff\nopposed him on this. ...\n[\nBirkhoff\nsaid\n]\n\"If these distinguished people come and take the positions, the young American mathematicians will become hewers of wood and drawers of water.\"\nVeblen helped organise the Institute for Advanced Study in Princeton in\n1932\n, resigning the Henry B Fine Professorship to become the first professor at the Institute in the same year. He had\nAlexander\n,\nEinstein\n,\nvon Neumann\nand\nWeyl\n, all mathematicians he had chosen, as original Institute members.\nVeblen's interest in the foundations of geometry led to his work on the axiom systems of projective geometry. He published\nFinite projective geometries\nwith W H Bussey in\n1906\n,\nCollineations in a finite projective geometry\n(1907)\n, and\nNon-Desarguesian and non-Pascalian geometries\n(1908)\n. Together with John Wesley Young he published\nProjective geometry\n(1910\n-\n18)\n. The first of the two volumes in this book were jointly written by the two authors but the second volume was due the Veblen alone. The introduction to this work justifies the study of foundations:-\nEven the limited space devoted in this volume to the foundations may seem a drawback from the pedagogical point of view to some mathematicians. To this we can only reply that, in our opinion, an adequate knowledge of geometry cannot be obtained without attention to its foundations. We believe, moreover, that the abstract treatment is particularly desirable in projective geometry, because it is through the latter that the other geometric disciplines are most readily coordinated. Since it is most natural to derive the geometrical disciplines associated with the names of\nEuclid\n,\nDescartes\n,\nLobachevsky\netc. from projective geometry than to derive projective geometry from one of them, it is natural to take the foundations of projective geometry as the foundations of all geometry.\nWe mentioned above that Veblen's first work on topology appeared just before he arrived in Princeton. He went on to establish Princeton as one of the leading centres in the world for topology research.\nAnalysis Situs\n(1922)\nprovided the first systematic coverage of the basic ideas of topology and contributed to the development of modern topology.\nSoon after\nEinstein\n's theory of general relativity appeared Veblen turned his attention to\ndifferential geometry\n. This work led to important applications in relativity theory, and much of his work also found application in atomic physics. His work\nThe invariants of quadratic differential forms\n(1927)\nis a systematic treatment of\nRiemann\ngeometry while his work, written jointly with his student\nHenry Whitehead\n,\nThe foundations of differential geometry\n(1933)\ngives the first definition of a\ndifferentiable manifold\n. In\nProjective relativity theory\n(1933)\nhe  gave a new treatment of spinors, used to represent electron spin.\nVeblen was an active member of the\nAmerican Mathematical Society\n, serving the Society as vice-president in\n1915\nand president in\n1923\n-\n24\n. He was the Colloquium Lecturer for the Society in\n1916\nwhen he gave a series of lectures on topology. As president of the\nAmerican Mathematical Society\nhe was the leader of American mathematics and his efforts to increase the funding for research is explained in\n[\n6\n]\nwhere Feffer writes:-\nBetween the world wars, all the scientific professions in the United States underwent tremendous growth. The wartime experiences of scientific leaders whetted their appetites for the continuation of some kind of concentrated, well-funded research programs. Turning not to government but instead to philanthropy, physicists and chemists worked to parlay their postwar prestige into greater support for unfettered research. Leaders of the American mathematical community also wanted to expand their base of support but found themselves facing unique obstacles. Attempts to raise money to support mathematical research had mixed results.\n[\nMost important were\n]\nthe efforts led by Oswald Veblen in the\n1920\ns to collect funds to support mathematics through Princeton University and the American Mathematical Society in the context of this climate of expansion for the physical sciences.\nVeblen was elected to the American Philosophical Society and the\nNational Academy of Sciences\n(\nUnited States\n)\nand was honoured with memberships of many other societies around the world. For example he was a member of the\nLondon Mathematical Society\n, serving on the council in\n1928\nwhen he was replacing\nHardy\nat Oxford. Oxford further honoured him with an honorary D.Sc. in\n1929\n, while in the same year he was honoured by the University of Oslo on the occasion of the centenary celebrations for\nAbel\n. He was elected to the\nDanish Academy of Sciences\n, the\nAcademy of Sciences\n(\nParis\n)\n, the\nPolish Academy of Sciences\n, the\nRoyal Society of Edinburgh\nand a number of other national academies in, for example, Ireland, Italy, and Peru. In addition to an honorary degree from Oxford, he received similar honours from the universities of Edinburgh, Glasgow, Hamburg, and Oslo. He was made a Knight of Norway's Royal Order of St Olaf, an honour which had also been bestowed on his father.\nAs to his personal characteristics he was\n[\n14\n]\n:-\n... An engaging person of great modesty and personal charm.\nL W Cohen said:-\nVeblen had many wonderful characteristics. He was a kind man.\nVeblen loved the outdoors and it was his initiative which led to Princeton purchasing a woodland site for the Institute for Advanced Study so that members could go for countryside walks. His own home was in  eighty acres of woodland which he named Herrontown Wood. He and his wife left Herrontown Wood to Mercer County as a place where:-\n... you can get away from cars and just walk and sit.\nIn his last years Veblen became partially blind and he devised a number of aids for blind people, one of which was manufactured and distributed by the American Foundation for the Blind.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}