{
  "nome_completo": "Paul Julius Oswald Teichmüller",
  "nome_curto": "Oswald Teichmüller",
  "ano_nascimento": "1913",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Teichmuller/",
  "lugar_nascimento": "Nordhausen im Harz, Germany",
  "lugar_morte": "Dnieper region, USSR",
  "biografia": "Oswald Teichmüller\n's parents were Gertrude Dinse and Adolf Julius Paul Teichmüller. Although Oswald was born in Nordhausen im Harz, his parent's home was in the small village of Sankt Andreasberg, famed as a winter sports resort, about\n25\nkm north of Nordhausen. When Oswald was only a few days old his mother took him from Nordhausen to their family home in Sankt Andreasberg. Paul Teichmüller, Oswald's father, was a weaver. He was\n33\nyears old when Oswald was born and his wife Gertrude was\n39\nyears old. When Oswald was one year old World War I broke out and in\n1915\nPaul Teichmüller's weaving business closed when he left home to fight in the war. At some stage during the war Paul Teichmüller was wounded but he did not return to Sankt Andreasberg until the war ended in\n1918\n. At this stage he opened his weaving business again but, when Oswald was twelve years old, his father died.\nSegal writes in\n[\n4\n]\nabout Teichmüller's early talents:-\nAccording to his mother, when Teichmüller was three-and-a-half, she discovered that he knew how to count, and he also learned to read on his own, his first self-instruction being from labels on tin cans. When his father returned in\n1918\n, young Oswald read to him fluently and recited a poem previously unknown to his mother.\nTeichmüller attended the local school in Sankt Andreasberg until the death of his father. At this time he was twelve years old and was far too advanced to be getting anything useful from the lessons at the local school. Gertrude took him to Nordhausen, having arranged for him to live there with his aunt. He attended the\nGymnasium\nin Nordhausen until he was seventeen years old, then entered the University of Göttingen in the summer semester of\n1931\nto study mathematics. He was certainly not a typical student; his mathematical work was brilliant but he had few friends and appeared to be an ungainly, uncomfortable country lad who was a complete misfit in the Göttingen scene\n[\n4\n]\n:-\nPeter Scherk, a student at the time, and\nHans Lewy\n, a young instructor, both of whom would become well-known mathematicians\n(\nand both forced emigrés in\n1933)\n, told anecdotes of the ungainly student's brilliance.\nAfter one semester studying at Göttingen, Teichmüller joined the NSDAP\n(\nNationalsozialistiche Deutsche Arbeiter Partei\n)\ncommonly called the Nazi Party. Three weeks later he joined the SA\n(\nSturm Abteilung: Storm Section, the military wing of the Nazi Party\n)\n. Although support for the Nazi Party at this time was not large, it was rapidly becoming stronger mainly due to the economic situation resulting from the Depression. Göttingen was, in fact, a stronghold for the Party and a large proportion of the student population were moving to give their support. It is rather difficult to see whether Teichmüller joined the Nazis because he already shared the far right views of the Party, or whether he rapidly became indoctrinated after joining. Certainly the awkward country lad without friends now found friends in the Party and he moved from being an outsider to being one of the student leaders. He soon became the deputy leader of the Mathematics and Natural Sciences branch of the student's Nazi Party.\nOn\n2\nNovember\n1933\nTeichmüller led the student boycott of\nEdmund Landau\n's lectures. As background to this we note that Hitler had come to power on\n30\nJanuary\n1933\nand on\n7\nApril of that year the 'Law for the reorganisation of the Civil Service' was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Before any official word reached Göttingen from the Ministry, the Dean wrote to Landau on\n28\nApril asking him not to give his summer lecture courses and these were given instead by\nLandau\n's assistant Werner Weber. Having received no further advice from the university authorities,\nLandau\ndecided to give his autumn lectures as advertised.\nLandau\ndescribed in unemotional terms what happened on the first day of lectures\n(\nsee\n[\n4\n]\n)\n:-\nOn\n2\nNovember, about\n11\n.\n15\n, as I wished to leave my office and go to the large lecture theatre to begin my lecture, the entrance hall was filled with about\n80\nto\n100\nstudents who let me pass through unhindered. In the lecture hall was one person. Clearly therefore, there was a boycott with sentries at the door who had prevented\n(\nwithout force\n)\nthose students who wanted to work from setting foot in the lecture room.\nTeichmüller, as the leader of the boycott, went to\nLandau\n's office and discussed what had happened.\nLandau\nrequested that Teichmüller put his views in writing and he did so. A translation of part of this letter is given in\n[\n6\n]\n:-\nThrough yesterday's action a completely new situation has now been created. In order to restore peace in our institute it is necessary, above all, to clear up the fundamentals behind it. You spoke of your belief that what happened yesterday was an anti-Semitic demonstration. My standpoint was, and continues to be, that an anti-Jewish individual action might rather be directed against everyone else than against you. I am not concerned with making difficulties for you as a Jew, but only with protecting - above all - German students of the second semester from being taught differential and integral calculus by a teacher of a race quite foreign to them. I, like everyone else, do not doubt your ability to instruct suitable students of whatever origin in the purely abstract aspects of mathematics. But I know that many academic courses, especially the differential and integral calculus, have at the same time educative value, inducting the pupil not only to a conceptual world but also to a different frame of mind. But since the latter depends very substantially on the racial composition of the individual, it follows that an Aryan student should not be allowed to be trained by a Jewish teacher.\nChowdhury comments\n[\n6\n]\n:-\nI find it an extraordinary piece of writing, shamelessly upholding an indefensible attitude and an ignominious action, wherein the brilliant but thoroughly indoctrinated mind of the writer shines through.\nWe note that Teichmüller had some success in converting others to the Nazi beliefs. For example he convinced\nLandau\n's assistant Werner Weber so that he joined the Nazi Party in\n1933\n.\nHelmut Hasse\nwas appointed to fill\nWeyl\n's chair at Göttingen in\n1934\n. The appointment of\nHasse\nwas not approved by certain hard-line Nazis since, although he was a strong supporter of Hitler, he did not believe in politicizing mathematics. However, despite\nHasse\nbeing in a very different area of mathematics from Teichmüller, it was\nHasse\nwho Teichmüller chose as his thesis supervisor. It would have made more sense from a mathematical perspective for Teichmüller to have asked\nGustav Herglotz\nto be his supervisor but\nHerglotz\nhad no specific connection with the Nazi Party while\nHasse\ndid. Unsurprisingly Teichmüller put political considerations ahead of mathematical ones but when he handed\nHasse\na first draft of his doctoral thesis\nOperatoren im Wachsschen Raum\nⓉ\n(\nOperators on Wach's space\n)\n, Hasse sent it to Manfried Köthe in Münster and it was Köthe's comments which led to the final polishing of the thesis. Teichmüller submitted his thesis on\n10\nJune\n1935\nand he was examined by\nHasse\n,\nHerglotz\nand the physicist Robert Pohl on\n26\nJune\n1935\n. In November he was officially awarded the degree.\nAfter his doctoral examination in June\n1935\n,\nHasse\nrequested that the university authorities appoint Teichmüller as an assistant in the Department.\nHasse\nstated in his letter that Teichmüller had \"extraordinary mathematical gifts\" and \"promises to become a mathematician of importance.\" As regards his teaching abilities\nHasse\nnotes that his lecturing style was \"painfully exact, in high degree suggestive, and impressive sort.\" Teichmüller was appointed as an assistant and there is some evidence that for a while his mathematical interests became more important to him than his political ones. He held the position of Rottenführer\n(\nTeam Leader with command over paramilitary troops\n)\nin the SA but some within the organization criticised him for doing little or nothing to further the Nazi cause, being too involved with mathematics. Even some of those with the same extreme Nazi views as Teichmüller described him as \"disagreeable,\" \"inexperienced in the ways of the world,\" and \"eccentric.\"\nTeichmüller's attitude towards\nHasse\nwas also rather strange - before\nHasse\n's appointment he had written that Hasse was \"a great algebraist,\" \"a German nationalist,\" \"apparently still incapable of fitting in with the regime. At present small and hateful. A call for him to come here is in the offing; we cannot approve of it.\" His views remained the same over the years that he worked in the Göttingen department headed by\nHasse\n, yet Teichmüller chose him as his supervisor and was influenced mathematically by him to work on algebraic problems\n(\nconsidered by some Nazis to be Jewish mathematics\n)\n. In October\n1936\nTeichmüller began to work towards\nhabilitating\nin Berlin with\nLudwig Bieberbach\n(\nalso an outstanding mathematician and staunch Nazi sympathiser\n)\n. He was publishing papers in\nBieberbach\n's journal\nDeutsche Mathematik\nwhich was set up as a racialist publication intended to promote 'German style mathematics' as opposed to 'Jewish style mathematics'. Teichmüller's habilitation thesis\nUntersuchungen über konforme und quasikonforme Abbildungen\nⓉ\n(\nStudies of conformal and quasiconformal mappings\n)\nwas not influenced by\nHasse\n, but rather was sparked by lectures that he had attended by\nRolf Nevanlinna\non complex analysis. He moved to Berlin in April\n1937\nand habilitated there in March\n1938\n. It is interesting to note that in his report on Teichmüller's thesis\nBieberbach\nchose to put in a critical comment about his earlier algebraic papers influenced by\nHasse\n. In Berlin, Teichmüller had someone in\nBieberbach\nwho shared his extreme Nazi views. The two, however, were also exceptional mathematicians and Teichmüller's two years in Berlin were golden years in terms of his research.\nTeichmüller's main contribution is in the area of geometric function theory. He wrote\n34\npapers in the space of about\n6\nyears,\n21\nbeing published in\nDeutsche Mathematik\n, the journal for German style mathematics founded by\nBieberbach\nwhich we referred to above. He introduced quasi-conformal mappings and differential geometric methods into complex analysis. K Strebel, in a review of\n[\n2\n]\n, gives the following summary of Teichmüller's contributions:-\nIn\n1936\nTeichmüller published five papers about various algebraic topics, and three more in\n1937\n. But it was already in that same year that two papers in function theory appeared, one on value distribution and the other on the type problem, using quasiconformal mappings. He was already an expert in the\nNevanlinna\ntheory and evidently greatly influenced by\nAhlfors\n's contributions to it.\nTeichmüller's Habilitationsschrift: \"Untersuchungen über konforme und quasikonforme Abbildungen\"\nⓉ\n(\nStudies of conformal and quasiconformal mappings\n)\n, which appeared in\n1938\n, and the next paper: \"Ungleichungen zwischen den Koeffizienten schlichter Funktionen\"\nⓉ\n(\nInequalities between the coefficients of simple functions\n)\ncan be considered as the beginning of his great contributions to function theory, which culminated in his masterpiece: \"Extremale quasikonforme Abbildungen und quadratische Differentiale\"\nⓉ\n(\nExtremal quasiconformal mappings and quadratic differentials\n)\n,\n1939\n. In this paper and its complement: \"Bestimmung der extremalen quasikonformen Abbildungen bei geschlossenen orientierten Riemannschen Flächen\"\nⓉ\n(\nDetermination of extremal quasiconformal mappings with closed oriented Riemann surfaces\n)\n(1943)\n, Teichmüller laid the basis of what is now known as the theory of Teichmüller spaces. He further developed the theme in one of his last papers: \"Veränderliche Riemannsche Flächen\"\nⓉ\n(\nVariable Riemann surfaces\n)\n(1944)\n.\nThere are other things, like the extremal mappings of the pentagon\n(1941)\nor the \"Verschiebungssatz\"\nⓉ\n(\nThe displacement law\n)\nwhere he shows with great mastery how to deal with special problems.\nSome other papers on pure function theory, like \"Eine Verschärfung des Dreikreisesatzes\"\nⓉ\n(\nA tightening of the three circles theorem\n)\n, and on algebraic functions, round out the picture.\nTeichmüller was drafted on\n18\nJuly\n1939\nas Germany prepared for World War II. He was originally supposed to do eight weeks training, but before the eight weeks were up, World War II began on\n1\nSeptember\n1939\n. He remained in the army and, in April\n1940\n, took part in the German invasion of Norway. After this he was transferred to Berlin to undertake cryptographic work.\nBieberbach\nrequested that Teichmüller be released from military duties to lecture at the university and indeed Teichmüller was able to teach at the university beginning at the start of session\n1942\n-\n43\nwhile continuing his cryptographic work. He still found time to continue his mathematical research with five papers being published in\n1944\n:\nÜber die partielle Differentiation algebraischer Funktionen nach einem Parameter und die Invarianz einer gewissen Hauptteilsystemklasse\nⓉ\n(\nOn the partial differentiation of algebraic functions for a parameter and the invariance of a certain major subsystem class\n)\n;\nBeweis der analytischen Abhängigkeit des konformen Moduls einer analytischen Ringflächenschar von den Parametern\nⓉ\n(\nEvidence of the analytical function of the conformal modulus of an analytic ring family of surfaces of the parameters\n)\n;\nEin Verschiebungssatz der quasikonformen Abbildung\nⓉ\n(\nA displacement rate of quasiconformal mappings\n)\n;\nVeränderliche Riemannsche Flächen\nⓉ\n(\nVariable Riemann surfaces\n)\n; and\nEinfache Beispiele zur Wertverteilungslehre\nⓉ\n(\nSimple examples for value distribution doctrine\n)\n. The first of these appeared in\nCrelle\n's\nJournal\n, the other four in\nDeutsche Mathematik\n.\nThe Battle of Stalingrad raged between July\n1942\nand February\n1943\n. The Germans attempted to take the city but there was stubborn resistance from the Russians. Eventually the German\n6\nth\nArmy was tricked and, after becoming trapped, was largely destroyed. It was the first major military defeat for the German armies and a new call to arms was made across Germany. Teichmüller answered this call and, giving up his cryptographic position in Berlin, joined the forces attempting to recover from the Stalingrad defeat. The German aim was to shorten their eastern line by taking the area around Kursk where the Russian forces held positions. Teichmüller's unit took part in the offensive which began on\n5\nJuly\n1943\n. A Russian counterattack in early August saw the Germans forced to fall back. Teichmüller was given leave of absence to return home. His unit was, at that stage, in the vicinity of Kharkov and, after a battle lasting from\n3\nAugust to\n23\nAugust, Kharkov was recaptured by the Russians. Most of Teichmüller's unit was wiped out but in early September he tried to rejoin them. He seems to have reached Poltava, southwest of Kharkov, but was killed in the confused situation as the German forces retreated in disarray before the Russian advance.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}