{
  "nome_completo": "Otakar Boruvka",
  "nome_curto": "Otakar Boruvka",
  "ano_nascimento": "1899",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boruvka/",
  "lugar_nascimento": "Uhersky Ostroh, Austria-Hungary (now Czech Republic)",
  "lugar_morte": "Brno, Czech Republic",
  "biografia": "Otakar Boruvka\nentered the\nGymnasium\nin Uherské Hradiste in\n1910\nwhen he was eleven years old. He continued to study there until\n1916\nbut, of course, by this time Europe was in the midst of World War I. The war was unpopular with the Czech people, and the press was censored and public meetings were forbidden. With the influence of the military increasing, Boruvka went to the military school in Hranice in northern Moravia. He then moved to another military school in Mödling in the picturesque Brühl Valley, just southwest of Vienna.\nAfter the end of World War I, Boruvka returned to the Gymnasium in Uherské Hradiste to take his final examinations. He then entered the Czech Technical University in Brno where he studied from\n1918\nto\n1922\n. Here he came under the influence of\nMathias Lerch\nwho, after eight years as professor at the University of Fribourg in Switzerland, had returned to the Czech Republic in\n1906\nwhen he was appointed professor of mathematics at the Czech Technical University in Brno. In\n1920\nBoruvka became an assistant at the Institute of Physics and, in the same year, began taking courses also at the Masarak University in Brno. This was a new university, opened in\n1920\n, named the Masaryk University after the first president of Czechoslovakia, Tomás Masaryk.\nLerch\nbecame the first professor of mathematics at this new university and he selected Boruvka to become his research assistant in\n1921\n. Sadly the collaboration did not last long since\nLerch\ndied in August\n1922\n.\nEduard Čech\nwas appointed extraordinary professor at Masaryk University in\n1923\nto fill the vacancy created by\nLerch\n's death. Boruvka then became\nČech\n's research assistant and\nČech\ninterested Boruvka in\ndifferential geometry\n. After being awarded his doctorate in\n1923\n, Boruvka continued to undertake research at Masaryk University.\nTo many people Boruvka is best known for his solution of the Minimal Spanning Tree problem which he published in\n1926\nin two papers\nOn a certain minimal problem\n(\nCzech\n)\nand\nContribution to the solution of a problem of economical construction of electrical networks\n(\nCzech\n)\n. Let us quote the problem as it appears in the second of these\n1926\npapers:-\nThere are\nn\nn\nn\npoints in the plane whose mutual distances are different. The problem is to join them with a net in such a way that:\n1\n.  any two points are joined to each other either directly or by means of some other points;\n2\n.  the total length of the net will be minimal.\nIn modern graph theoretical terms this can be stated as: Given an undirected graph with weights assigned to its edges, find a spanning tree of minimal weight.\nIn fact the problem had been suggested to Boruvka before he became a university student. He had a friend, Jindrich Saxel, who worked for the firm West-Moravian Powerplants and he suggested the problem which he stated in terms of cities and the distances between them. At the time that Saxel suggested the problem to Boruvka, World War I was still happening and Czech universities were closed. Boruvka was offered a job with West-Moravian Powerplants at this time but declined. The authors of\n[\n8\n]\nwrite:-\nThe Minimal Spanning Tree problem is a cornerstone of Combinatorial Optimisation and in a sense its cradle. The problem is important both in its practical and theoretical applications. Moreover, recent development places Boruvka's pioneering work in a new and very contemporary context. One can even say that out of many available Minimal Spanning Tree algorithms, Boruvka's algorithm is presently the basis of the fastest known algorithms.\nČech\nsuggested to Boruvka that he should go abroad and broaden his mathematical horizons. An obvious choice, suggested\nČech\n, was Paris where Boruvka could work with\nÉlie Cartan\n. He spent\n1926\n-\n27\nin Paris, where he lectured on his solution to the Minimal Spanning Tree problem, then returned to Masaryk University in Brno where he\nhabilitated\nand was made a\ndozent\nin\n1928\n. He spent further years abroad, going back to Paris in\n1929\n-\n30\nwhere his visit was supported by the Rockefeller foundation. He then went to Hamburg where, still supported by the Rockefeller foundation, he spent the year\n1930\n-\n31\n.\nThe graph theory work undertaken by Boruvka early in his career did not lead to further work in this area. Under the influence of\nEduard Čech\nand\nÉlie Cartan\nhe worked on differential geometry, then he became interested in algebra, and undertook research on groups and groupoids\n(\nalgebraic systems in which the associative law does not hold\n)\n. For example in\nÜber Ketten von Faktoroiden\nⓉ\n(\nOn chains of factoroids\n)\n(1941)\nhe considered partitions of groupoids with the property that the product of two sets is contained entirely within some other set of the partition. In\n1944\nhe published a little book of\n80\npages\nIntroduction to the Theory of Groups\n(\nCzech\n)\n. The book consists of three chapters: the first gives the fundamental concepts of set theory; the second contains the theory of groupoids; and the third contains the theory of groups. The book went through a number of editions, each adding considerably more material. The second Czech edition in\n1952\ncontains about\n150\npages, while when the book was published in German in\n1960\nit was about\n200\npages long. Its aim in presenting material in both groups and groupoids was reflected in the title\nGrundlagen der Gruppoid- und Gruppentheorie\nⓉ\n(\nFundamentals of groupoid and group theory\n)\n. Essentially the material of this German edition appeared in Czech in\n1962\nand in English in\n1976\nwith the title\nFoundations of the theory of groupoids and groups\n.\nAs World war II was drawing to a close, Boruvka began to think about revitalising the mathematical research work of Masaryk University. He discussed these matters with František Vycichlo, a Prague mathematician, and their feeling was that differential equations would be a good direction to take his research team. Boruvka had already written a paper on differential equations in\n1934\n, but now he began to direct the research of Masaryk University towards that topic. His own recollections about this period are given in\n[\n22\n]\n:-\nAlready in\n1944\n, when it was clear that the war would be over soon and that the victory of the Allies was certain, it was necessary for me to think about my future activity realistically, i.e. on the one hand my pedagogical activity, but also my scientific one as well. As for the pedagogical activity, it was necessary to see to it that those students who started studying before the war might accomplish their studies and the newcomers might begin studying ... How to organize lectures to satisfy all those students? In this respect I did not worry ... I was rather thinking of what trend to start, as far as scientific work was concerned. At that time scientific work was not controlled in any way and the professors bore the responsibility personally and individually and I had not a good overview of what it looked like in this country on the whole and in what direction scientific work in mathematics should continue. I went to Prague, it was at the end of\n1944\n, to consult the matter with my colleagues. I spoke above all to František Vycichlo whom I held in high esteem. We discussed the matter thoroughly and arrived at the conclusion that it was essential to start pursuing the theory of differential equations which is immensely important as far as applications are concerned and which was much neglected before the war and in essence it was not at all developed. And since we did not see anyone that would take up that task, I declared that I would take the matter myself, although it was not an easy decision, because it meant I had to change the field of my scientific work.\nIn\n1946\nBoruvka became an ordinary professor at Masaryk University and in the following year he set up a Differential Equations Seminar. The main aim of the seminar was to study global properties of linear differential equations of the\nn\nn\nn\nth order. He explains\n[\n22\n]\nhow he went about this work:-\nVery soon I recognised that it was an immensely difficult problem of long lasting which I could not master with my own forces in the near future. The main problem and difficulty was the fact that here there occurred absolutely new questions which had no models, no basic concepts were known, not to mention any methods that would permit some systematic study, etc. And that is why I came with the idea that the solution of that problem was possible only in the following way that in the first period one would acquire some experience in the simplest cases and only in the second period, on the basis of the concepts introduced and experience obtained, one would go to the extension of those results to the most general case. And I did it in that way.\nBoruvka's publications on this topic include\nSur les intégrales oscilatoires des equations différentielles linéaires du second ordre\nⓉ\n(\nOn oscillatory integrals of second order linear differential equations\n)\n(1953)\n,\nRemark on the use of Weyr's theory of matrices for the integration of systems of linear differential equations with constant coefficients\n(\nCzech\n)\n(1954)\n,\nÜber eine Verallgemeinerung der Eindeutigkeitssätze für Integrale der Differentialgleichung\ny\n′\n=\nf\n(\nx\n,\ny\n)\ny' = f (x, y)\ny\n′\n=\nf\n(\nx\n,\ny\n)\nⓉ\n(\nOn a generalization of the uniqueness theorems for integrals of the differential equation y' = f\n(\nx, y\n)\n)\n(1956)\n, and\nSur la transformation des intégrales des équations différentielles linéaires ordinaires du second ordre\nⓉ\n(\nOn the transformation of the integrals of linear ordinary differential equations of the second order\n)\n(1956)\n. Much of his work, and that of others participating in his seminar, is contained in Boruvka's book\nLineare differential- transformationen\n2\n. Ordnung\nⓉ\n(\nLinear differential transformations of the\n2\nnd order\n)\n(1967)\nwhich was translated into English as\nLinear differential transformations of the second order\n(1971)\n.\nAmong the many honours which Boruvka receiced were election to the\nCzech Academy of Sciences\n(\ncorresponding member\n1953\n, ordinary member\n1965)\n, and honorary doctorates from Bratislava\n(1969)\nand Brno\n(1994)\n.\nLet us end this biography with Boruvka's own words about his approach to mathematics\n[\n22\n]\n:-\nI would like to remember facts in my life that were essential not only for me personally, but chiefly for mathematics and for the future mathematical generation: Before every serious task I try to find carefully and dutifully how to fulfil it in the best way, and when I find a solution, I carry it out as best as I can according to my best sense and conscience and with all my might. I consider success a natural consequence of my activity and I do not ascribe it a particular importance. I consider failures to be signs of the complexity of life and I draw information from them. But I am never sorry for my decisions, because at every moment I acted as best as I could. ... And maybe just because none of us knows which day will be his or her last, I tried knowingly, and according to my powers, to live in each of them fully and to work. In the same way as my teachers lived -\nMatyas Lerch\n, Ladislav Seifert and\nEduard Čech\n- they gave me a lot - I also feel the duty to pass most of it to the young talented generation. They always sided with the talented and diligent ones, that was their, and in the end also my, creed: I will set you on the horse, but you must ride the horse yourselves.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}