{
  "nome_completo": "Otto Haupt",
  "nome_curto": "Otto Haupt",
  "ano_nascimento": "1887",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Haupt/",
  "lugar_nascimento": "Würzburg, Germany",
  "lugar_morte": "Bad Soden, Germany",
  "biografia": "Otto Haupt\n's father was a magistrate in Würzburg. Otto attended a Realschule in Würzburg for two years before entering the Royal New\nGymnasium\n. This school, founded in\n1886\n, was a humanistic school but it did not suit Haupt. The main teaching method in the school involved learning by rote and Haupt was highly critical of this method. He later explained that at the Royal New Gymnasium they were using the proven didactic principle that the best education of the mind consists in memorization. \"May the professional educationalists and psychologists forgive me,\" he said, \"but by learning by rote I understand the ability to make a senseless sequence of words\n(\nperhaps one might even say a random-like sequence of words\n)\nwithin each predetermined time so impress the mind that in due course you're able to flawlessly repeat them. If only some this had some\n(\nreasonable\n)\nconsequences ...\"\nFor a long time at the Royal New Gymnasium he did not find the mathematics teaching stimulating. His teachers seemed only to give him facts which were self-evident and discussing the self-evident had little appeal for him. However, things changed when he found a mathematics book that an uncle had used when attending a Gymnasium in Baden-Baden. Haupt looked through the\n400\n-page book and saw a wealth of propositions and exercises that excited him. He suddenly felt that mathematics had the highest value for him. He began to study mathematics textbooks on his own and, at this point, decided that mathematics and physics were the topics he wanted to study at university. He certainly did not consider a career as a university teacher at this time, but his aim was to become a Gymnasium teacher of mathematics. Haupt's father told one of his colleagues that his son wanted to study mathematics and laughed when the colleague replied, \"Herr High Court Judge, surely you're not going to tolerate that - it is not befitting!\"\nIn the winter semester\n1906\n-\n07\nHaupt began his study of mathematics and physics at the University of Würzburg. His most important teachers in mathematics were Friedrich Prym\n(1841\n-\n1915)\n,\nEmil Hilb\n, Georg Rost\n(1870\n-\n1958)\nand Eduard Ritter von Weber\n(1870\n-\n1934)\n, but it was the young\nEmil Hilb\nwho influenced him in the most decisive manner. After four semesters at Würzburg, Haupt took the first set of the Bavarian state examinations required to become a secondary school teacher. This was a severe test with a week long series of written and oral examinations. After successfully completing these examinations, Haupt spent the winter semester of\n1908\n-\n09\nat the University of Berlin before returning to Würzburg. Upon his return to Würzburg in\n1909\nhe learnt that Emil Hilb, who was only five years older that he was, had just left Erlangen when appointed as an extraordinary professor at Würzburg. In October\n1910\nHaupt took the extremely difficult and extensive second set of Bavarian state examinations in mathematics and physics. He could not sit these examinations at Würzburg and had to travel to Munich to sit them. Already at this time he had undertaken research for his doctorate advised by\nEmil Hilb\nand had his first paper\nBemerkung über Oszillationstheoreme\nⓉ\n(\nA remark about oscillation theory\n)\npublished in\n1910\n.\nNow, remarkably, he had submitted his doctoral thesis\nUntersuchungen über Oszillationstheoreme\nⓉ\n(\nStudies of the oscillation theorem\n)\nin\n1910\nand had taken his oral examination in July\n1910\n, even before he sat the State Examinations. After completing all these examinations, he spent one year, October\n1910\nto October\n1911\n, undertaking military service. Haupt chose to serve in the\n2\nnd\nTrain Battalion, a military unit that organised the transport of army materials. Haupt decided that the Train Battalion would give him plenty of free time which he wanted to use for mathematics research. In fact he completed his military service before he was awarded his doctorate near the end of\n1911\n. Following his military service, Haupt said that he was \"physically and mentally exhausted\" but, following Hilb's advice, he applied for a Lamont-Stipend from the Bavarian Academy of Sciences. His application was successful and he was able to spent two very fruitful semesters at Munich working with\nArnold Sommerfeld\n. Following\nSommerfeld\n's suggestions, he was able to solve a problem on series expansions by eigenfunctions of a boundary value problem and published the result in the paper\nÜber die Entwicklung einer willkürlichen Funktion nach den Eigenfunktionen des Turbulenzproblems\nⓉ\n(\nOn the development of an arbitrary function of the eigenfunctions of the turbulence problem\n)\npublished by the Bavarian Academy of Sciences. After these two semesters in Munich, he spent the winter semester of\n1912\n-\n13\nin Breslau within\nAdolf Kneser\n,\nErhard Schmidt\n,\nConstantin Carathéodory\nand\nErnst Steinitz\n.\nHaupt received an invitation from Adolf Krazer, a former student of Friedrich Prym, to become his assistant at the Technical University of Karlsruhe. One condition was that he\nhabilitated\nquickly at Karlsruhe. Once Breslau heard that Haupt had the invitation from Karlsruhe, they tried to stop him leaving but Haupt decided that he would prefer to take up Krazer's offer at Karlsruhe. He later said that he had never regretted his decision. He was in Karlsruhe for the summer semester\n1913\nand later that year submitted his habilitation thesis\nÜber eine Methode zum Beweise von Oszillationstheoremen\n.\nⓉ\n(\nOn a method for evidence of the oscillation theorem\n)\nIt was published in\nMathematische Annalen\nas a\n40\n-page paper in\n1914\n. He started lecturing to a wide variety of different students but found teaching mechanical engineers and architects particularly enjoyable. He quickly made friends with the other academics, in particular with\nFritz Noether\n, an assistant at the Department of Mechanics in Karlsruhe, who was the brother\nEmmy Noether\n. Every month the department held a \"Mathematical Party\" which Haupt really enjoyed.\nThe good times soon came to an end, however, for during June and July of\n1914\nthe various powers in Europe moved towards war. With fighting already taking place in late July, Germany mobilised its forces on\n1\nAugust. Germany declared war on Russia on\n1\nAugust and declared war on France on\n3\nAugust. Haupt was involved from the day Germany mobilised. He served as an aide in the Flying Division but suffered a series of illnesses. Despite being vaccinated, he contracted typhoid fever in Romania, was sent to a rest home but then he had jaundice, and finally he was assigned to reserve troops in Würzburg where he suffered from chronic dysentery. He was still serving in the military when, on\n9\nNovember\n1918\n, he married Edith Hughes, the daughter of a doctor. In\n1919\nhe was released back to civilian life and returned to his position in Karlsruhe.\nHaupt did not remain long at Karlsruhe for in\n1920\nhe was appointed to a chair of mathematics at Rostock. This did not turn out well for Haupt who found the necessary tasks so arduous that he had hardly any time left to undertake research. However, in under a year he had the opportunity to move on when he was offered a professorship at the Friedrich-Alexander University in Erlangen. He took up this position in the summer semester of\n1921\n. This ordinary professorship had a fine reputation having been held by top mathematicians such as\nKarl Georg Christian von Staudt\nand later by\nFelix Klein\n,\nPaul Gordan\n,\nErhard Schmidt\nand\nErnst Fischer\n. There was a second ordinary professorship at Erlangen which had been held by\nMax Noether\n. After\nMax Noether\nretired,\nHeinrich Tietze\nhad been appointed to his chair in\n1919\nso was already in post when Haupt took up his professorship.\nMax Noether\nhad continued to live in Erlangen but died a few months after Haupt arrived there. However,\nEmmy Noether\n,\nMax Noether\n's daughter, often came from Göttingen to visit Erlangen and when she did so she lived in Haupt's home. Haupt often went for long walks with\nEmmy Noether\nand during these walks he learnt new groundbreaking ideas concerning algebra. This led to Haupt publishing a two-volume\nEinführung in die Algebra\nⓉ\n(\nIntroduction to Algebra\n)\nin\n1929\n.\nSaunders Mac Lane\nsaid\n[\n1\n]\n:-\n0\nystein Ore\nsaid to me, \"Well, there is this abstract algebra that's going on in Germany - you ought to learn something about it. Get the textbook by Otto Haupt.\" I diligently got the text and studied the whole two volumes. It wasn't very well written, but it was sort of inspiring. It has completely disappeared from sight, of course, because in\n1931\nvan der Waerden\n's famous book was published and it was infinitely superior. Nevertheless, from\nOre\nand Haupt I learned abstract algebra. And it was exciting!\nThe article\n[\n3\n]\nlooks at Haupt's role as a lecturer:-\n[\nHaupt\n]\nwas also a committed university teacher. His lectures were filled with clarity and precision, even in the art of the writing on the board, but at the same time he made the highest demands on his listeners. In their early semesters his students learned very quickly that half-measures and superficialities have no place in the work of a mathematician. Extreme precision is required: in thinking, in formulating and even when drawing in descriptive geometry. The range of the lectures he offered was broadly based. In addition to traditional basic and advanced courses for the education of Gymnasium teachers and graduate mathematicians, he regularly held mathematics lectures for natural scientists and for many years alternated with Helmut Volz, for a long time the only theoretical physicists in Erlangen, the basic lectures on Theoretical Mechanics.\nHaupt certainly played an important role in administration at the University of Erlangen. For example, only three years after he was appointed to the university he was chosen as the dean of the faculty of philosophy. To get an overview of his mathematical contribution we quote from which was written to celebrate his\n100\nth\nbirthday\n[\n5\n]\n:-\nAs a mathematician, he is above all a geometer. A good deal of his more than\n170\npublished papers deal with 'Geometrische Ordnungen', a theme related to Mukhopadhyaya's Four Vertex Theorem. He is also a specialist in real analysis, and has treated a great variety of other themes in his long life as a mathematician.\nWe have already mentioned his algebra book, but more important was his\n3\n-volume work\nDifferential- und Integralrechnung\npublished in\n1938\n. This was a jointly authored work but it would appear that it was mainly due to Haupt since it was described as \"written by\n0\ntto Haupt, assisted by Georg Aumann.\" A second edition, now entitled\nDifferential- und Integralrechnung unter besonderer Berücksichtigung neueren Ergebnisse\nⓉ\n(\nDifferential and integral calculus with special consideration of recent results\n)\n, listed three authors, Haupt, Aumann and Christian Pauc. It was a revision by Haupt and Pauc of the original text and the three volumes were published in\n1948\n,\n1950\nand\n1955\n. A third edition, considerably rewritten, was entitled\nEinführung in die reelle Analysis\nⓉ\n(\nIntroduction to Real Analysis\n)\nand had the two original authors, Haupt and Aumann. The three volumes were published in\n1974\n,\n1979\nand\n1983\n. We give some extracts from reviews of these various editions at\nTHIS LINK\n.\nK Jacobs writes\n[\n5\n]\n:-\nWhen Otto retired in\n1953\n, he said to Hermann Künneth\n(1892\n-\n1975)\n, \"Now let's start working.\" Their long, prolific collaboration was crowned by the Grundlehren volume 'Geometrische Ordnungen'\nⓉ\n(\nGeometric orders\n)\nin\n1967\n.\nB d'Orgeval, in a review, explains that this book is on a topic often called \"finite geometry\" in France. It is in the form of an introduction and three parts. He writes:-\nIt would be presumptuous to say that this book is easy to read; its axiomatic form and high rigour takes some effort but is essential for those who want to penetrate thoroughly these sensitive issues too often abandoned to an intuition that, for making beautiful results, risks being vain when models are less representable. With its third part and rich bibliography this is a book which should enable those aspiring to do research on this subject to make a rapid start. It is therefore hoped that this book will be widely read ...\nThe article\n[\n3\n]\npaints a vivid picture of how Haupt conducted his daily life:-\nTo the outsider, it may be difficult to understand how a researcher and university lecturer with Haupt's breadth could still cope with such a huge amount of work, especially in old age. A key to clarify this mystery is in the self-discipline that he imposed on the classification and design of his daily routine. To the outsider, it offered the image of being planned with the utmost precision. Fixed times for working at his desk were probably just as important as fixed times for his siesta, for reading and for listening to music. Especially never missing in planning his daily routine was time to walk. ... In his walks the invisible speedometer needle pointed to a mark somewhere between walking and running, and this was long before the invention of jogging. Furthermore, Haupt's \"jog\" was not on level ground but preferably on rough terrain on the slope of the Rathsberg and then it usually took place on the direct route. He preferred to conduct technical discussions with graduate students and colleagues on this kind of walk. These served at the same time to take care of the health of his partners. Especially effective, this was common during stays at the Mathematical Research Institute in Oberwolfach in the Black Forest. The steep slopes right behind the Institute offered the best prerequisites. It is not surprising that an American colleague, who Haupt accompanied on such walks\n25\nyears ago, recalled the experience saying: \"Haupt, at that time a young man of\n75\n, was easily able to out-hike us all.\"\nHaupt received many honours for his contributions, for example an honorary doctorate from the University of Bonn\n(1962)\n, from his hometown University of Würzburg\n(1963)\nand from the University of Nantes\n(1966)\n. He was elected to the Bavarian Academy of Sciences in\n1947\n, to the Academy of Sciences and Literature in Mainz in\n1949\n, and to the Société Royale des Sciences de Liège in\n1955\n. In\n1987\nhe was made an honorary member of the\nGerman Mathematical Society\n. He was awarded the\nvon Staudt\nPrize in\n1991\n.\nHaupt's wife, Edith, died in\n1981\n. She was half Jewish and only survived the Nazi period living in Erlangen by taking great care and also having much good luck. Several of her relatives were not so fortunate and died in Nazi concentration camps. After Edith's death in\n1981\n[\n5\n]\n:-\n... Haupt's friends could only admire the stamina and vigour that enabled him to open for himself still another period of his life.\nBy the time he had reached the age of\n100\nyears, Haupt was living in a retirement home in Bad Soder/Taunus, near Frankfurt. At this time a\n100\nth\nbirthday conference was held in his honour at Erlangen. He died at the age of\n101\nyears,\n8\nmonths and\n5\ndays.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}