{
  "nome_completo": "Ovide Arino",
  "nome_curto": "Ovide Arino",
  "ano_nascimento": "1947",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arino/",
  "lugar_nascimento": "Toulouse, France",
  "lugar_morte": "Bedlewo, Poland",
  "biografia": "Ovide Arino\nwas born in Toulouse to a family who came from Bagneres-de-Luchon, a town in the Pyrenees situated on the French side of the border between France and Spain. He was brought up in Toulon, a town and port in the south east of France. Toulon was largely destroyed in the last stages of World War II just three years before Arino was born and the town was still struggling to recover through his early years. After attending high school in Toulon, he entered the University of Nice where he studied mathematics with some leading teachers such as\nDieudonné\n, Boutet de Monvel and Grisvard. He graduated in\n1972\nand, in the following year, was appointed to the Université de Pau et des Pays de l'Adour. Pau is a town in the Pyrenees and the university there had opened in\n1970\n, just three years before Arino was appointed.\nIn the years following his appointment Arino published a number of papers, all joint publications with mathematicians such as Claude Delode, Jean-Paul Penot, Pierre Séguier, Serge Gautier, and Kacem Khouk. We now give, as an illustration of his work over the period\n1975\n-\n80\n, the titles of five of his papers together with an extract of the authors' abstract for each of them:\nChamps mesurables d'espaces polonais\nⓉ\n(\nFields of measurable Polish spaces\n)\n(1975)\n; \"There are two ways of considering a parametrized family of metric spaces as a measurable family: from the point of view of multivalued mappings and from the point of view of fibrations. In this note we introduce a convenient category of measurable fibrations.\"\nSolutions périodiques d'équations différentielles à argument retardé. Oscillations autour d'un point stationnaire, conditions suffisantes de non-existence\nⓉ\n(\nPeriodic solutions of differential equations with delayed argument. Oscillations around a stationary point, sufficient conditions of nonexistence\n)\n(1980)\n; \"Following a note by P Séguier the authors give some results on the non-existence of a nontrivial periodic solution to differential equations with delay, using mainly properties of monotonicity. A comparison is then made with results involving other methods.\"\nStabilité d'un ensemble fermé pour une équation différentielle à argument retardé\nⓉ\n(\nStability of a closed set for a differential equation with retarded argument\n)\n(1978)\n; \"Our aim is to establish a local existence result for a differential equation with delay in a reflexive Banach space, with the hypothesis of weak continuity in the second member. We also give sufficient conditions for a solution to stay in a weakly closed set.\"\nSolutions oscillantes d'équations différentielles autonomes à retard\nⓉ\n(\noscillating solutions of autonomous differential equations with delay\n)\n(1978)\n; \"We show some results proving the existence, and specifying the behaviour, of solutions oscillating near a stationary point for some equations of the type\nx\n′\n(\nt\n)\n=\nL\n(\nx\nt\n)\n+\nN\n(\nx\nt\n)\nx '(t) = L(x_{t}) + N(x_{t})\nx\n′\n(\nt\n)\n=\nL\n(\nx\nt\n​\n)\n+\nN\n(\nx\nt\n​\n)\nwhich have certain monotone and continuity properties. An essential hypothesis is that the equilibrium point be a saddle-point.\"\nComportement des solutions d'équations différentielles à retard dans un espace ordonné\nⓉ\n(\nBehaviour of solutions of differential equations with delay in a space ordered\n)\n(1980)\n; \"Using vectorial Ljapunov functionals, we give here some results related to the behaviour at infinity of solutions of a differential equation with delay in an ordered\nBanach\nspace.\"\nArino studied for a doctorate supervised by Maurice Gaultier and was awarded the degree in\n1980\nfrom the University of Bordeaux for his thesis\nContributions à l'étude des comportements des solutions d'équations différentielles à retard par des méthodes de monotonie et bifurcation\nⓉ\n(\nContributions to the study of the behavior of solutions of differential equations with delay by methods of monotony and bifurcation\n)\n. As can be seen from this work his interest was mainly in differential equations, mainly with delay, but later he became primarily involved with applications of these ideas to biomathematics, particularly population dynamics. This is explained in\n[\n4\n]\n:-\nHis research developed along two different and complementary lines: works with mathematical aim and modelling in population dynamics. His results in the field of delay differential equations stand out: oscillations, functional differential equations in infinite dimensional spaces, state-dependent delay differential equations. His interest in population dynamics developed fundamentally in two large areas: cell proliferation models and fisheries. Some of the problems dealt with from a mathematical point of view involved obtaining asymptotic properties of the solutions, in the framework of semigroup theory of positive operators as well as the application of aggregation of variables methods to models formulated with two time scales.\nWith over\n150\npublished papers, we can give but a glimpse of his contributions. Let us give one example of his later work, namely\nSome spectral properties for the asymptotic behavior of semigroups connected to population dynamics\n(1992)\n. R Nagel writes in a review:-\nThis paper starts with several motivating examples from population dynamics. Then the spectral theory of a single bounded linear operator and a one-parameter operator semigroup is reviewed, with special emphasis on perturbation results and consequences for the asymptotic behaviour. Next it is explained how positivity and the corresponding Perron-Frobenius theorems improve the previous results. In the light of this theory a cell equation involving unequal division is investigated in great detail.\nArino spent most of his career at the University of Pau. However he was a great traveller, visiting institutions throughout the world to collaborate with mathematicians there. For example he was a Visiting Professor at a number of universities in the United States such as Memphis State University in Memphis, Tenessee, at Brigham Young University in Provo, Utah and at Rice University in Houston, Texas. He also spent time in universities in Morocco, Spain, Italy and Poland. In fact he liked to call Morocco his second home, and had a passion for helping young mathematicians from that country develop. Another way that he made a major contribution to mathematics was through the organisation of conferences and workshops. In the final ten years of his life he was an organiser of\n20\nconferences and attended over\n40\nbetween\n1991\nand\n1996\n. One has to wonder how he had the energy for this while undertaking ground-breaking research, supervising over\n60\nPh.D. students, and making significant contributions to a whole host of papers which he refereed for leading journals. In fact he died, in tragic circumstances, while attending a workshop in Bedlewo, Poland.\nTanya Kostova and Tom Hallam pay this tribute to Arino\n[\n1\n]\n:-\nProfessor Dr Ovide Arino was a very generous man who gave freely of his energy to his work, to his friends, to his students and to his family. He was passionate for all he did and compassionate in his interactions. He was a caring father, a prolific scientific writer, an energetic organizer, and a mentor to many.\nOvide was always active and spent a large portion of his career organizing and teaching. He was the spiritual leader of six conferences of Mathematical Population Dynamics, of the two Alcala Mathematical Ecology meetings and of many student summer schools. Only weeks before he departed this life, he helped to shape the topics of a new meeting - Computational and Mathematical Population Dynamics, which took place eight months later in Trento, Italy where he was warmly remembered by all.\nAt closing session in the\n2003\nAlcala meeting, Dr Rafa Bravo, the chair of the Second Mathematical Ecology meeting referred to Ovide as the brain of the conference and expressed his admiration for Ovide's ability to work literally\n24\nhours a day. Even the greatest brain is physiologically limited in the amount of work it can perform and Ovide left us a few weeks after the Alcala meeting. Among his legacies are the works of his many students from all across the world and in the new editions of the meetings he initiated.\nAnother tribute to his personal qualities, this time from\n[\n4\n]\n, reads:-\nBut not even the brilliance of his professional life can be compared with his human quality. Ovide was much more than a great scientist: he was very much a family man, extremely generous, always ready to lend a helping hand and a great conversationalist. ... Ovide is survived by his wife Elizabeth, three sons Julien, Emilien and Lucien, one daughter Lisa and one grandson Samuel.\nFollowing Arino's death, several tributes to him have been made. For example on\n9\n-\n10\nJanuary\n2004\n, the Cadi Ayyad University and the International Centre for Dynamical Systems in Marrakech organized two days of mathematics in his memory.  In May\n2004\n, the SFBT awarded the Prix Ovide Arino during its first international conference. In June\n2004\n, the Université Abou Bekr Belkaid, Tlemcen, Algeria, awarded the Prix Ovide Arino\n2004\nto Tarik Touaoula.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics"
  ]
}