{
  "nome_completo": "Percy John Heawood",
  "nome_curto": "P J Heawood",
  "ano_nascimento": "1861",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heawood/",
  "lugar_nascimento": "Newport, Shropshire, England",
  "lugar_morte": "Durham, England",
  "biografia": "P J Heawood\n's father was the Reverend John Richard Heawood. He had a brother, Edward Heawood, who went on to become librarian for the Royal Geographical Society, holding the position for over\n30\nyears.\nHeawood attended Queen Elizabeth's Grammar School in Ipswich being awarded an Open Scholarship to study at Exeter College, Oxford, in\n1880\n. There Heawood was most influenced by\nHenry Smith\nand he went on to be a\nWrangler\nin\n1883\n(\nthe year in which\nHenry Smith\ndied\n)\n.\nHeawood was awarded a Junior Mathematical Scholarship in\n1882\nand a Senior Mathematical Scholarship in\n1886\n. In\n1886\nhe was also awarded the Lady Herschell Prize.\nIn\n1887\nHeawood was appointed Lecturer in Mathematics at Durham Colleges\n(\nlater Durham University\n)\n. Three years later, in June\n1890\n, he married Christiana Tristram who was the daughter of Canon H B Tristram who was a biblical scholar, traveller and naturalist. They had a son and a daughter and enjoyed over sixty years of marriage, celebrating their diamond wedding in June\n1950\n.\nIn fact Heawood worked at Durham University all his life being appointed to the Chair of Mathematics there in\n1911\n. He served the university in many capacities, in particular he was a member of the Senate from\n1905\nand served as Vice-Chancellor from\n1926\nto\n1928\n. He did not retire until\n1939\nwhen he was\n78\nyears of age but still went on to enjoy\n16\nyears of retirement.\nHeawood spent\n60\nyears of his life working on the\nfour colour theorem\n. He published his first paper on the topic\nMap colour theorems\nin\n1890\nwhen he pointed out the mistake in\nKempe\n's proof. In the same paper he proves that five colours suffice. He also proved in this paper that for a surface of connectivity\nh\nh\nh\n, a map requires at most\n[\n7\n2\n+\n1\n2\n√\n(\n24\nh\n−\n23\n)\n]\n[\\large\\frac{7}{2}\\normalsize  + \\large\\frac{1}{2}\\normalsize √(24h - 23)]\n[\n2\n7\n​\n+\n2\n1\n​\n√\n(\n2\n4\nh\n−\n2\n3\n)\n]\ncolours. Another result from the same paper considered empires, countries which have a number of colonies which must all be coloured with the same colour. Heawood proved that if an empire contains at most\nr\nr\nr\ndisjoint portions then on a surface of connectivity\nh\nh\nh\n, a map can be coloured with at most\n1\n2\n{\n6\nr\n+\n1\n+\n24\nh\n+\n(\n6\nr\n+\n1\n)\n2\n−\n72\n}\n\\large\\frac{1}{2}\\normalsize \\big\\{6r + 1 + \\sqrt{24h +(6r + 1)^{2}- 72}\\big\\}\n2\n1\n​\n{\n6\nr\n+\n1\n+\n2\n4\nh\n+\n(\n6\nr\n+\n1\n)\n2\n−\n7\n2\n​\n}\ncolours. He gave a map with\n12\ncountries, each in two disjoint parts, which required\n12\ncolours.\nHeawood wrote on the four colour problem again in\n1897\n,\n1932\n,\n1936\n,\n1943\n,\n1944\nand his final paper on the topic in\n1949\nwas given the same title\nMap colour theorems\nas his first paper.\nOther topics which Heawood wrote on were\ncontinued fractions\n, approximation theory, and\nquadratic residues\n. He also wrote five papers and\n23\nnotes for the\nMathematical Gazette\non a variety of mathematical topics but perhaps more on geometry than any other topic.\nG A Dirac, in\n[\n2\n]\n, describes Heawood's appearance and character in the following words:-\nIn his appearance, manners and habits of thought, Heawood was an extravagantly unusual man. He had an immense moustache and a meagre, slightly stooping figure. He usually wore an Inverness cape of strange pattern and manifest antiquity, and carried an ancient handbag. His walk was delicate and hasty, and he was often accompanied by a dog, which was admitted to his lectures. ... His transparent sincerity, piety and goodness of heart, and his eccentricity and extraordinary blend of naiveté and shrewdness secured for him not only the fascinated interest, but also the regard and respect of his colleagues.\nHeawood had one passion outside mathematics and university life. In\n1928\nDurham Castle was found to be insecure with the foundations moving on the cliff on which it was built. Very large amounts of money were required to save the castle and the University of Durham failed in its attempt to raise the necessary money. Heawood however refused to give up and for years he worked almost on his own as Secretary of the Durham Castle Restoration Fund to raise the cash.\nWithout Heawood's efforts Durham Castle would not be standing today. He succeeded against all the odds to raise the money necessary to ensure that the foundations were permanently secured. He received the O.B.E. in\n1939\nfor this work.\nHeawood's other interests are mentioned in\n[\n1\n]\n:-\n... he was fond of country pursuits, and one of his interests, unusual for a mathematician, was Hebrew.",
  "math_areas": [
    "Geometry"
  ]
}