{
  "nome_completo": "Pao-Lu Hsu",
  "nome_curto": "Pao Lu Hsu",
  "ano_nascimento": "1910",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hsu/",
  "lugar_nascimento": "Beijing, China",
  "lugar_morte": "Beijing, China",
  "biografia": "Pao Lu Hsu\n's name is sometimes transliterated as Xu Bao-lu but the form we have given seems to be the commonest form. His family came from the lake city of Hangzhou in Zhejiang Province but he was born and brought up in Peking. His parents belonged to a mandarin family and in\n[\n5\n]\nthe authors write:-\nPerhaps because of this background he spoke the \"common\" or \"official\" dialect with an interesting soft overtone.\nHsu's school education was in Peking and he did not choose mathematics as a career at this stage but rather it was chemistry which he decided to study at university. In\n1928\nhe enrolled at Yangjing University to study chemistry. Two years later he decided to change subject, to change universities, and so he went to Tsing Hua University to read for a degree in mathematics. He obtained his Bachelor of Science degree from Tsing Hua University in\n1933\nand then moved to the Mathematics Department of Peking University where he was employed as an assistant.\nHsu passed examinations in\n1936\nat Peking University and obtained a scholarship to enable him to continue his graduate studies in Britain. He spent four years in Britain mainly at University College, London but he also spent some time studying at Cambridge. Certainly University College, London was an excellent place for Hsu to study as his mathematical interests were in\nprobability\nand statistics.\nEgon Pearson\n, following the retiral of his father\nKarl Pearson\nas Galton Professor of Statistics, had been made Reader and became Head of the Department of Applied Statistics three years before Hsu arrived there.\nJerzy Neyman\nhad been appointed in\n1934\nwhile\nR A Fisher\nheld\nKarl Pearson\n's Galton Chair of Statistics and was Head of the Department of Eugenics at University College. Lehmann writes in\n[\n10\n]\n:-\nDuring this period\n[\nat University College, London\n]\nHsu wrote a remarkable series of papers on statistical inference which show the strong influence of the\nNeyman\n-Pearson point of view.\nHsu's first two papers were published in the\nStatistical Research Memoirs\nwhich were edited by\nJerzy Neyman\nand\nEgon Pearson\n. One concerned what is now known as the Behrens-Fisher problem, while the second Hsu examined the problem of optimal estimators of the variance in the\nGauss\n-\nMarkov\nmodel.\nIn\n1938\nHsu, while still undertaking research for his doctorate, too up a position as lecturer in\nEgon Pearson\n's Department. He was awarded the degree of Ph.D. and then that of D.Sc. from University College, London, in\n1938\nand\n1940\n, respectively. Anderson, Chung and Lehmann write in\n[\n5\n]\n:-\n[\nHsu's\n]\nBritish education formed his taste in mathematics; he preferred the hard and concrete to the general and abstract.\nThis is a very fair comment on the style of British statistics during this period, in contrast to the style in Continental Europe.\nBy\n1940\nChina was engaged in World War II fighting against the Japanese invasion and Britain was involved in the war against Germany. Hsu chose to leave Britain to return to his homeland of China where he was appointed as Professor at Peking University. It was a period of great difficulty and hardship for Hsu. He corresponded with\nNeyman\nduring the years\n1943\n-\n44\n, who by this time was at Berkeley in the United States, about statistical matters but he mentions in these letters the great hardship he was suffering, particularly suffering starvation.\nIt is a great tribute to Hsu's determination to devote himself to statistics that he managed to continue his research during these difficult war years. Many of his publications on multivariate analysis from this period show that he had been strongly influenced by\nR A Fisher\nwhile at University College. His role in promoting the use of matrix theory in statistics should also be emphasised. These papers brought him to\n[\n3\n]\n:-\n... the forefront of the development of the mathematical theory of multivariate analysis.\nAttempts were made to get Hsu to the United States. In\n1945\nhe arrived in the USA just in time for the First Berkeley Symposium on Probability and Statistics. During the next two years he taught at the University of California, Columbia University, and the University of North Carolina where he was offered an associate professorship.\nAfter spending\n1946\n-\n47\nat the University of North Carolina at Chapel Hill, in\n1947\nHsu returned to his professorship at Peking University. One of his students at Chapel Hill wrote:-\nIn was Hsu's insistence on simplicity combined with depth of understanding, clarity without avoidance of difficulties, and above all a deep and obvious but unspoken commitment to the highest goals and standards of scholarship which attracted us to him.\nAnderson, Chung and Lehmann describe in\n[\n5\n]\n(\nsee also\n[\n4\n]\n)\nHsu's personality, particularly during these years in the United States:-\nSetting even higher standards for his own work than for others, he would temper his critical sense with a gentle mocking humour. He could work feverishly on research for spells, but used to lament that life's diverse interests conflicted with a single minded devotion to science. ... A particular hobby was chanting the musical drama of the Yuan dynasty with a small group of connoisseurs accompanied by ancient instruments. partly owing to fragile health he never married but apparently came close to it.\nHsu had turned down many offers of position, one particularly attractive one from\nWald\n, from universities in the United States but he felt that there he could be\n[\n5\n]\n:-\n... part of the emerging new society in his homeland.\nHsu had poor health from\n1950\n. He recovered but the extremely hard work which he undertook brought about a recurrence in the summer of\n1951\nand he spent some time in hospital. His battle against illness is movingly described in Jiang and Duan in\n[\n1\n]\n:-\nConcerned about his health, the authorities repeatedly suggested that he go abroad to recuperate. all such suggestions met with polite refusal; he insisted on continuing his work ... From\n1956\non his health steadily worsened. Having difficulty in moving about, he worked at home. with a blackboard hanging on the wall of his room, he gave lectures to upper-class students, graduate students, and young teachers; he was in charge of seminars and other academic activities. By the early\n1960\ns his health had deteriorated to such an extent that he could stand in front of the blackboard for only a few minutes before he had to sit down and rest. Nevertheless his teaching did not cease at that time, nor did his work cease under the extremely difficult conditions in the later years. It was only a month before his death that his manuscript on the relationship between experimental design and algebraic coding theory was at last completed, being his final legacy. Found beside his bed the day after his death were piles of manuscripts which serve as a testimony to the superhuman fortitude with which he exerted himself over a period of more than\n20\nyears ...\nHsu died in his home on the campus of Peking University in\n1970\n. He had published a total of\n40\nmathematical papers.",
  "math_areas": [
    "Analysis",
    "Statistics"
  ]
}