{
  "nome_completo": "Paolo Frisi",
  "nome_curto": "Paolo Frisi",
  "ano_nascimento": "1728",
  "ano_morte": "1784",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frisi/",
  "lugar_nascimento": "Milan, Austrian Habsburg (now Italy)",
  "lugar_morte": "Milan, Austrian Habsburg (now Italy)",
  "biografia": "Paolo Frisi\n's parents were Giovanni Mattia Frisi and Francesca Magnetti. Paolo's paternal grandfather, Antonio, was originally from Strasbourg and had arrived in Lombardy as a military man in the Hapsburg army. Paolo's father, Giovanni Mattia, worked in government procurement and was able to provide a comfortable life for his family. Paolo was the second child in a family of eight children. His older brother, named Antonio after his grandfather, became a doctor and naturalist, and he set up a botanical garden in Cinisello, about\n10\nkm north east of Milan, in the villa of Count Donato Il Silva\n(1690\n-\n1779)\nwho was an historian, scholar and patron of science. Antonio died in\n1756\n. Paolo had three younger brothers, Filippo, Antonio Francesco and Luigi. Filippo became a magistrate and was the author of\nDe imperio et jurisdictione\nⓉ\n(\nGovernment and jurisdiction\n)\n(1777)\n. He lived with his family and died in\n1780\n. Antonio Francesco\n(1733\n-\n1817)\nbecame a priest and canon of Milan Cathedral in\n1793\n, but was also a talented historian who wrote\nElogio storico Maria Gaetana Agnesi\nⓉ\n(\nHistorical account of Maria Gaetana Agnesi\n)\n(1799)\n. Luigi also became a priest, canon of the Basilica Sant'Ambrogio, and was a scholarly man with scientific interests. Paolo's father died young and left the large family in difficult financial circumstances. However, despite this, his mother was able to ensure that her children had a good education.\nFrisi entered the Barnabite Arcimbolde school in Milan in or before\n1741\n. The Barnabites were a religious Order, devoted to the study of the Pauline Letters. They had founded the Arcimbolde school in Milan, which is also known as the College of Sant'Alessandro, in\n1663\n. The headquarters of the Order was in Milan, in the church of St Barnabas\n(\nhence the name of the Order\n)\n. Pietro Verri\n(1728\n-\n1797)\nwas the same age as Frisi and they studied together at the Arcimbolde school. Verri, the author of a biography of Frisi\n[\n6\n]\n, became a well known philosopher, historian and writer. He remembered that in\n1741\n-\n42\nFrisi, who was at that time his companion in the Arcimbolde, stood out for his reliability and attendance at the Ambrosiana Library. Frisi joined the Barnabite Order and on\n11\nJuly\n1743\nhe was admitted to the novitiate of the church of Santa Maria of Carrobiolo in Monza. Verri certainly felt that Frisi did not exhibit deep religious feelings and was following this religious path more because it offered him a quality education from learned men and also gave him the opportunity to study without having to worry about his material needs. He took his vows on\n15\nOctober\n1744\nand returned to the College of Sant'Alessandro for courses on literature and philosophy. He studied the classics with father Onofrio Branda and poetry in Italian and Latin. Paolo Onofrio Branda\n(1710\n-\n1776)\nwas a scholar who wrote\nDella lingua toscana\nⓉ\n(\nOn the Tuscan language\n)\n(1759)\n. Now natural philosophy according to\nAristotle\nhad been taught at the Arcimbolde up to\n1744\nbut, in that year, Francesco Maria De Regi\n(1720\n-\n1794)\nbegan teaching ideas of\nNewton\n's natural philosophy. De Regi was a mathematician specialising in engineering and hydraulics; he published\nTheoremata\nⓉ\n(\nTheorems\n)\nin\n1757\n. After studying the philosophy courses at the Arcimbolde, Frisi went on to study mathematics on his own.\nIn\n1747\nFrisi went to Pavia where he studied theology in the Ordine School. However, in Pavia he attended courses by the mathematician and physicist\nRamiro Rampinelli\n.\nRampinelli\n, who had taught\nMaria Gaetana Agnesi\nwhile at the San Vittore al Corso monastery in Milan, had been appointed to the chair of mathematics and physics at the University of Pavia in\n1747\n. A friend of\nGiovanni Poleni\nand\nJacopo Riccati\n,\nRampinelli\nwas an expert in hydraulics and supervised the construction of the Pavia-Milan canal and other similar projects.\nRampinelli\nsupervised Frisi's mathematical studies and had him read his unpublished work 'Institutiones mechanicae ac staticae'. While in Pavia Frisi also read the 'Treatise of fluxions' of\nColin Maclaurin\n, the 'Instituzioni analitiche' of\nAgnesi\n, and some writings of\nLeonard Euler\n. In addition, he read the commentary on\nNewton\n's\nPrincipia\nby the two Minim fathers, Thomae Le Sueur and\nFrancois Jacquier\n. This work, entitled 'Isaaci Newtoni philosophiae naturalis principia mathematica, perpetuis commentariis illustrata' was published in four parts in three volumes between\n1739\nand\n1742\n. Reading this work encouraged him to begin a correspondence with\nJacquier\n. By the time he left Pavia at the end of\n1749\n, Frisi had completed his theological studies and, in addition to the mathematical texts mentioned above, had also studied works of the French school up to\nAlexis Claude Clairaut\nand\nJean Le Rond d'Alembert\n.\nLeaving Pavia, Frisi was sent to teach philosophy in the College of San Giovanni alle Vigne in Lodi. He remained there for two years and during this time, in February\n1751\n, he was ordained a priest. In\n1751\nhe published two works,\nDisquisitio mathematica in causam physicam figurae et magnitudinis telluris nostrae\nⓉ\n(\nMathematical discussion on the  size and shape of the earth\n)\nand\nDel modo di regolare fiumi e torrenti\nⓉ\n(\nOn a way of regulating rivers and streams\n)\n. The first of these works presented problems since the censors of the Order denied him permission to print the work because it was based on a heliocentric model. Frisi's brother Antonio, who we mentioned above, worked for Count Donato Il Silva and Antonio showed the\nDisquisitio\nⓉ\n(\nDiscussion ...\n)\nto Count Il Silva who offered to finance its publication. Frisi, having started printing without the permission of the Barnabite Order, was told to stop, but nevertheless publication went ahead. This work was remarkable since it discussed the figure of the earth and whether there was a equatorial bulge, not just from geodetic measurements but from a discussion of the movement of the Earth and the effect that had on its shape. He came up with\n229\n:\n230\nas the ration of the polar to equatorial radius.\nNow in\n1751\nhe requested that he be transferred to the seminary in Bologna since he knew many of the scientists there and felt that would further his scientific studies. However, this did not happen and instead he was sent to the College of Casale Monferrato to succeed to the chair of philosophy which had been vacated by Giacinto Sigismondo Gerdil\n(1718\n-\n1802)\nin\n1749\nwhen he was appointed as professor of philosophy at the University of Turin. Appointed by the Savoy government, Frisi taught philosophy at Casale from November\n1751\n. Once at Casale he became friends with I Radicati, Count of Cocconato, who was a free thinker, and the two continued to correspond for over twenty years. While at the College of Casale, Frisi wrote his first work on pure mathematics,\nDe methodo fluxionum geometricarum et eius usu in investigandis praecipuis curvarum affectionibus\nⓉ\n(\nThe geometric method of fluxions and its application in the investigation of principal geometric curves\n)\nwhich was published in Milan in\n1753\n. The Barnabite Order was unhappy with Frisi's dedication to science and his neglect of religion and, in\n1752\n, they asked the Savoy government to remove him from his chair at Casale. The Barnabite Order wanted him to go to their house of penance but, in November\n1752\n, Frisi managed to postpone the decision citing health reasons. He had poor eyesight, and was also suffering from partial deafness. He was then sent as a preacher to Novara but managed to spent only a short time there. By the spring of\n1753\nhe was teaching philosophy at the College of Sant'Alessandro in Milan. In the same year he was elected as a corresponding member of the Paris\nAcadémie des Sciences\n.\nBack in Milan he re-established contact with Pietro Verri but there were few there to share his scientific interests and he worked on his own. He published a work on electricity,\nNova electricitatis theoria quam ... J B Landriani publice propugnabat\nⓉ\n(\nThe new theory of electricity, publicly defended by J B Landriani\n)\nin\n1755\nand, in the same year,\nSaggio morale di filosofia\nⓉ\n(\nThe wise morals of philosophy\n)\n. In the following year he published\nDe motu diurno terrae dissertatio\nⓉ\n(\nDissertation on the diurnal motion of the earth\n)\n. He left Milan in\n1756\nto take up a post as professor of philosophy at the University of Pisa. Appointed by Leopold, the Grand Duke of Tuscany, he began his duties in February. In Pisa he lived in the Barnabite lodgings at San Frediano and made contacts with a number of scientists including Giovanni Gualberto de Soria\n(1707\n-\n1767)\n, Giovanni Battista  Caraccioli\n(1695\n-\n1765)\nwho wrote\nGeometria algebraica universa quantitatum finitarum, et infinite minimarum\nⓉ\n(\nAlgebraic geometry, universal quantities of finite and infinitely small\n)\n(1759)\n, Ottaviano Cametti\n(1711\n-\n1789)\nwho had published\nElementa geometriae\nⓉ\n(\nElements of geometry\n)\nin\n1755\n, and Tommaso Perelli\n(1704\n-\n1783)\nwho was the director of the Pisa Observatory. Perelli, in particular, had a large influence on Frisi who often made the relatively short journey to Florence where Galileo's influence was strong. His scientific work continued to be recognised internationally and he was elected to the\nSt Petersburg Academy of Sciences\nin\n1757\n, the\nRoyal Society of London\nin\n1757\nand the\nBerlin Academy of Science\nin\n1758\n. Frisi was able to publish works on celestial mechanics after\n1757\nsince Pope Benedict XIV had promoted scientific learning and instructed those drawing up the Index of Forbidden Books to act with restraint. Frisi published\nMemorie sopra la fisica e l'istoria naturale\nⓉ\n(\nMemoir on  physical and natural history\n)\n(1757)\n,\nDe aberratione lucis opusculum\nⓉ\n(\nWork on the refraction of light\n)\n(1757)\n, and\nDe atmosphaera caelestium corporum dissertatio physico-mathematica\nⓉ\n(\nPhysical and mathematical dissertation on the atmosphere of heavenly bodies\n)\n(1759)\n. He had made a submission to the\n1758\nGrand Prix of the Paris\nAcademy of Sciences\nwhich argued that the planets had atmospheres. Although he continued to follow the rules of his religious Order, he was now living a life of increased freedom. He was able to enjoy the company of friends and had now sufficient freedom to include some pleasures.\nBetween June and autumn\n1760\n, Frisi made a journey to Rome and Naples. When in Rome he had an audience with Pope Clement XIII who asked his opinion of a Rhine River project. This was not something that Frisi had looked at before but he quickly immersed himself in the vast literature on the subject and drew up a plan.\nAfter holding the post in Pisa for eight years, Frisi returned to Milan becoming professor of mathematics at the Scuola Palatina in April\n1764\n. He was a leading authority on mathematics and science in his day, and considered of such importance that when he left Pisa for Milan the Tuscan government decreed that his name should remain on the list of professors at the University of Pisa. In\n1764\nthe city senate of Bologna appointed him an honorary university mathematics professor. He continued to make visits abroad and in\n1766\nvisited first France in May and then England in August. In Paris he met, among others,\nJean d'Alembert\n, Denis Diderot,\nGeorges-Louis Leclerc de Buffon\n,\nMarie-Jean Caritat de Condorcet\n,\nJean-Étienne Montucla\n, and\nLouis-Antoine de Bougainville\n. In London he met, among others,\nBenjamin Franklin\n,\nEdward Waring\n,\nNevil Maskelyne\n, and the philosopher David Hume. In Paris he showed his work\nDe gravitate universal corporum\nⓉ\n(\nOn the universal gravity of bodies\n)\nto members of the Academy and\nJean d'Alembert\nand\nÉtienne Bézout\nwrote positive reports on the work which they presented to the Academy in September. Frisi discussed the\nthree body problem\nwith French mathematicians, visited science museums and observatories of Paris and Greenwich, and attended meetings of the\nRoyal Society of London\nand the Paris\nAcademy of Sciences\n. Frisi returned to Milan in April\n1767\n.\nTwo years later he visited Vienna, arriving in July\n1768\n. His main purpose was to present to Joseph II, the Holy Roman Emperor, a copy of\nDe gravitate universal corporum\nⓉ\n(\nOn the universal gravity of bodies\n)\nwhich Frisi had dedicated to him. Joseph II had become Holy Roman Emperor in\n1765\nand, when Frisi visited, he was jointly ruling with his mother Maria Theresa. Joseph, who was a highly intelligent man, was keen to discuss with Frisi the latest developments in science, particularly in electricity, and since he had lost two wives to smallpox, he was naturally keen to discuss developments in inoculation. Joseph II also wanted to discuss church-state relations with Frisi for he already had in mind ways to limit the influence of the Church.\nWe have already indicated many contributions that Frisi made to mathematics, physics and astronomy. In physics he worked on light and electricity but, although his work was very up to date for its time, his explanations were based on vibrations in the ether and did little to advance the topic. He was, however, the first to introduce the lightning conductor into Italy. His work on astronomy was based on\nNewton\n's theory of gravitation and is therefore of considerably more importance than his work in physics. He studied the motion of the earth and he was awarded a prize by the\nBerlin Academy of Science\nfor his outstanding memoir\nDe moto diurno terrae\nⓉ\n(\nThe diurnal movement of the earth\n)\n(1756)\n. As we have already mentioned, he also studied the physical causes for the shape and the size of the earth using the theory of gravity. Other astronomical phenomena which he studied included the difficult problem of the motion of the moon.\nHe studied kinematics and hydraulics and he was responsible for drawing up plans for a canal between Milan and Pavia. In fact the work on this canal was not undertaken in Frisi's lifetime, but in\n1819\n, thirty-five years after Frisi's death, the canal was built to his plan. His major work on hydraulics is\nDel modo di regolare i fiumi, e i torrenti, principalmente del Bolognese, e della Romagna\nⓉ\n(\nOn a way of regulating rivers and streams, mainly those of Bologna and Romagna\n)\nwritten in\n1762\n. This book was translated into French and published in\n1774\nand four English editions were also published. In the paper\nDe problematis quibusdam isoperimetricis\nⓉ\n(\nSome isoperimetric problems\n)\nof\n1761\nFrisi discussed isoperimetric problems. These were popular problems at this time with both\nJacob Bernoulli\nand\nJohann Bernoulli\nhaving made important contributions and Euler, in\n1744\n, having given a rule to determine a minimising arc between two points on a curve having continuous second derivatives. Frisi looked at problems involving both maximising and minimising.\nFrisi also wrote on the contributions of\nGalileo\n:\nElogio del Galileo\nⓉ\n(\nIn praise of Galileo\n)\n(1775)\n,\nCavalieri\n:\nElogio di Bonaventura Cavalieri\nⓉ\n(\nIn praise of Bonaventura Cavalieri\n)\n(1778)\nNewton\n:\nElogio del cavaliere Isacco Newton\nⓉ\n(\nIn praise of Sir Isaac Newton\n)\n(1778)\n, and\nd'Alembert\n:\nElogio del signor d'Alembert\nⓉ\n(\nIn praise of d'Alembert\n)\n(1786)\n, and brought their ideas to a wide audience. Such writings were widely read for Frisi was considered, in Italy, to be\n[\n1\n]\n:-\n... a scientific authority and\n[\nhe\n]\nwas also well known abroad, so much so that his major works\n(\nwhich he wrote in Latin\n)\nwere translated into French and English.\nThese major works include\nAlgebra e geometrica analitica\nⓉ\n(\nAlgebra and analytic geometry\n)\n(1782)\n,\nMeccanica\nⓉ\n(\nMechanics\n)\n(1783)\n, and\nCosmografia\nⓉ\n(\nCosmography\n)\n(1785)\nwhich contain much of Frisi's earlier work, but written up in a polished form.\nFrisi was also editor of the newspaper\nIl caffè\n. The paper was influenced by the ideas of the\nIlluminati\n(\nEnlightened Ones\n)\nwhich promoted free thought and democratic political theories. Through this paper Frisi had a major influence on the\n[\n1\n]\n:-\n... cultural, social, and political life of Milan ...\nLetters written by Frisi and to Frisi are discussed in\n[\n5\n]\nand\n[\n11\n]\n. Letters between Teodoro Bonati\n(1724\n-\n1820)\nand Frisi discussing questions of mechanics and hydraulic mechanics are given in\n[\n5\n]\n. A letter by Frisi written in\n1753\non mechanics and geometry is given and discussed in\n[\n11\n]\n.\nIn\n1773\nPope Clement XIV suppressed the Society of Jesus, more commonly known as the Jesuits. After this, the Scuola Palatina, where Frisi was professor of mathematics, was moved to the Palazzo Brera, which had been a Jesuit College until the suppression. This was far from where Frisi lived in the lodgings of the Barnabite Order, so he requested that he be allowed live with his family. This was impossible if he was to remain in the Barnabite Order, so his request was really for secularisation. This was not something to be taken lightly by the Church but, eventually, in\n1776\nPope Pius VI granted him secular status as long as he remained a public professor. He lived with his mother, three brothers and a sister but, without the support of his Order, his life had economic problems. In August\n1778\nFrisi made a third trip abroad, going to Switzerland. In the following summer his health began to deteriorate and he suffered nervous disorders. Although he recovered, these health problems caused him to reduce his work load. However, in\n1782\nhe published a collection of his greatest scientific work, which he revised and expanded, but he also added previously unpublished work. In May\n1784\nGustav III, king of Sweden, visited Frisi in Milan; this was considered a great honour. In the summer of\n1784\nhe suffered from many abscesses and his doctors advised him to rest at home. By the autumn his condition had become more severe and his doctors advised surgery but infection followed. He died shortly after taking the last rites. Despite having left the Barnabite Order some years before, the Barnabites still wanted him buried in Sant'Alessandro.\nFrisi was honoured by election to many academies; we have indicted when he was elected to several of these academies above. Let us here record that he has been honoured, and is remembered by many today, by having several institutions and streets named after him. The schools and institutes name after him include: the Istituto di Istruzione Secondaria Superiore \"Paolo Frisi\" in Milan; the Scuola \"Paolo Frisi in Milan\"; the Liceo Scientifico Statale \"Paolo Frisi\" in Monza; and the Scuola Secondaria di I Grado \"Paolo Frisi\" in Melegnano. Streets named after Frisi include: the Via Paolo Frisi, Milan; the Via Paolo Frisi, Melegnano; the Via Paolo Frisi, Lissone; the Via Paolo Frisi, Pavia; the Via Paolo Frisi, Rome; and the Via Paolo Frisi, Bologna.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}