{
  "nome_completo": "Paul Guldin",
  "nome_curto": "Paul Guldin",
  "ano_nascimento": "1577",
  "ano_morte": "1643",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Guldin/",
  "lugar_nascimento": "St Gall (now Sankt Gallen), Switzerland",
  "lugar_morte": "Graz, Austria",
  "biografia": "Paul Guldin\nwas named Habakkuk Guldin by his parents. Although of Jewish descent, his parents were Protestants and they brought Guldin up in that faith. He became a goldsmith, after serving an apprenticeship, and worked at that trade during his teens moving between different German cities. In the second half of the\n1590\ns, he was working in Freising and there he read a number of books which led him to have doubts about the Protestant religion he was practicing. He went to the Benedictine abbey of Weihenstephan, in Freising, and explained his doubts to the prior in the abbey. It was a hard decision, but he took the advice of the prior and renounced the Protestant religion in which he had been brought up. At this point he changed his name from Habakkuk\n(\na Jewish name coming from one of the twelve minor Prophets\n)\nto Paul since he saw Paul as the Jew who took Christianity to the Gentiles. Guldin became a convert to Catholicism at the age of\n20\nand joined the Jesuit Order in Munich as a Coadjutor Brother. Up to this point, Guldin would certainly not have studied mathematics, in fact it is doubtful if he had received much education beyond being able to read and write. The Jesuits, however, were an Order committed to rigorous education and Guldin went through the lengthy educational process leading to a doctorate in divinity. After a few years he became a Jesuit Scholastic and, still later, he was ordained a Jesuit priest.\nSince Guldin showed considerable mathematical abilities so, in\n1609\n, he was sent to the Jesuit Collegio Romano in Rome to study under\nClavius\nwho was the professor of mathematics there. Although not known for mathematical discoveries, nevertheless\nClavius\nwas an exceptionally good teacher and Guldin gained deep mathematical understanding from his lectures.\nClavius\nwas, however, a classical mathematician teaching only\nEuclid\n's geometric methods and Guldin would also take this classical approach and oppose the newer ideas of the calculus which were beginning to appear around this time. After being instructed by\nClavius\n, Guldin taught mathematics at the Jesuit College in Rome. Then, in\n1617\n, he moved to the Jesuit College in Graz but after a few years a severe health problem forced him to give up lecturing. In fact his first work was published shortly after he arrived in Graz. In\nRefutatio elenchi calendarii Gregoriani a Setho Calvisio conscripti\nⓉ\n(\nRefutation of the Gregorian calendar lists written by Sethus Calvisius\n)\n(1618)\n, Guldin defended his teacher\nClavius\n's proposals for calendar reform. We know Guldin's views on mathematics at this time since he later published a lecture which he had delivered in\n1622\n[\n2\n]\n:-\n[\nGuldin\n]\ndefines mathematics according to the Aristotelian classification, as that part of philosophy lying between physics and metaphysics. Mathematics is the science that considers quantity abstracted from sensible matter. Concerning pure mathematics, arithmetic is described as the science of discrete quantity, and geometry as the science of continuous quantity. It is interesting to note the addition of algebra to the traditional disciplines of pure mathematics; of course, Guldin's conception of algebra depends in large part on the work of Viète.\nAlso in\n1622\nhe published a work on the centre of gravity of the Earth. He accepted the view that the centre of gravity of every large body tries to move so that will coincide with the centre of gravity of the universe. An interesting consequence was that Guldin argued that the Earth would constantly be moving.\nHe was sent to Vienna in\n1623\nwhere he was appointed professor of mathematics at the University. In\n1629\nhe was sent by the Jesuit Order to teach at the Jesuit\nGymnasium\nin the Silesian principality of Sagan which had been established by Albrecht Wallenstein after he was made Prince of Sagan in\n1627\n. After teaching there for some time, Guldin returned to his professorship in Vienna where he remained until\n1637\nwhen he returned to Graz.\nOne interesting correspondence which Guldin entered into was with\nJohannes Kepler\n. Unfortunately only\nKepler\n's letters to Guldin have been preserved but, nevertheless, they give us interesting information.\nKepler\nwrote eleven letters to Guldin between\n1618\nand\n1628\nand these are discussed in\n[\n15\n]\n.\nKepler\nsought Guldin's advice both on scientific matters and on religious matters, and he also asks Guldin to use his influence in the court.\n[\n15\n]\n:-\n[\nAn\n]\nexample of Kepler's trust in Guldin's help and the appreciation of his advice is shown in Kepler's letter from August the\n30\nth\n1624\n. He had sent Guldin a petition to be forwarded to emperor Ferdinand II\n(1578\n-\n1637)\nto promote the publication of the Rudolphinian Tables. Kepler asked him now what to bring with him to Vienna to help the progress of his affair. This fact also illustrates that Guldin was a very influential person at the imperial court in Vienna. ... Kepler's last two letters to Guldin express his uneasiness concerning Guldin's expectation of Kepler's possible conversion to the Catholic Church.\nKepler\n's financial position was poor throughout the period of their correspondence and Guldin was concerned that\nKepler\ncould not afford a telescope to carry out scientific work. One of Guldin's Jesuit friends, Nicolas Zucchi, was a telescope maker and Guldin asked him to give\nKepler\none of his telescopes.\nKepler\nreplied to Guldin showing that he was extremely grateful for the gift and sent Guldin his book detailing the discoveries he had made with it:-\nTo the very reverend Father Paul Guldin, priest of the Society of Jesus, venerable and learned man, beloved patron. There is hardly anyone at this time with whom I would rather discuss matters of astronomy than with you ... Even more of a pleasure to me, therefore, was the greeting from your reverence which was delivered to me by members of your Order who are here ... I think you should receive from me the first literary fruit of the joy that I have gained from using your gift\n(\nthe telescope\n)\n.\nGuldin's most important work is\nCentrobaryca seu de centro gravitatis trium specierum quantitatis continuae\nⓉ\n(\nOn the centres of gravity of the three shapes\n)\npublished in\n4\nvolumes between\n1635\nand\n1641\n. Volume\n1\nbegins with the lecture describing the mathematical sciences which he gave in\n1622\n(\ndiscussed above\n)\n. Since the whole work is on centres of gravity it is worth giving Guldin's definition from this volume:-\nThe centre of gravity of any finite quantity is that point placed either inside that quantity, or on its boundary, or outside it, around which on all sides are parts of equal moment. For either the centre itself, or the straight line, or a plane however drawn through the centre, will always cut the proposed figure in parts of equal weight.\nIn particular, in Volume\n1\n, he discusses the centre of gravity of the Earth. Volume\n2\nwas published in\n1640\nand contains his, now famous, rule on centres of gravity. The main aim of this book was to study figures obtained by rotating other figures, for example the sphere obtained by rotating a semicircle about its diameter. Here is an example of Guldin's definition:-\nA rotation is a simple and perfectly circular motion, around a fixed centre, or an unmoved axis, which is called the 'axis of rotation', turning around either a point, or a line, or a plane surface, which, almost as leaving a trace behind it, describes or generates a circular quantity, either a line, or a surface, or a body.\nHis famous rule can be stated in the following form:-\nIf a plane figure is rotated about an axis in its plane then the volume of the solid body formed is equal to the product of the area with the distance travelled by the centre of gravity.\nNow Guldin has been particularly unfortunate in that he has been accused of plagiarism over this result. The historian\nDavid Smith\nstates this in no uncertain terms\n[\n14\n]\n:-\nThe essence of Guldin's Theorem appears in the works of\nPappus\n. These were published in\n1588\n,\n1589\nand\n1602\n, a generation or so before Guldin published\n(1641)\nhis 'Centrobaryca' ... They were well known to scholars of that time as constituting the most important geometric work of the late Greek period. That a man like Guldin should have failed to know this important statement in such a well-known work is quite inconceivable.\nHistorians have spent some time arguing this point, often unfortunately using fallacious information. The fairest assessment is certainly that of Ivor Bulmer-Thomas\n[\n5\n]\n:-\nIt is not as though Guldin was a spiteful man. The evidence of 'De centro gravitatis' is that he was zealous to give credit where credit was due. ... there are friendly references not only to\nCommandinus\nhimself but to\nClavius\n,\nRegiomontanus\n, Orontius, Freigius,\nPeter Ramus\n, and\nCardan\n. If Guldin had been conscious of any debt to\nPappus\n, he would surely have acknowledged it. This does not rule out a debt of which he was unconscious. It may very well be that\nPappus\n's enunciation, read many years earlier, had sunk into his unconscious mind, and that when he came to write in\n1640\n, he genuinely believed that he was producing something original. ... In the light of all the evidence, it seems best to give Guldin the benefit of the doubt - to acquit him of conscious plagiarism, but to accept that he may have brought forth from his subconscious mind the fruit of his distant reading.\nVolume\n3\ncontains work on the surface and volumes of cones, cylinders and solids of revolution. Guldin uses Volume\n4\nto attack other mathematicians for the methods they are using. One mathematician to be attacked in this way is\nCavalieri\n[\n2\n]\n:-\nThe debate between\nCavalieri\nand Guldin is usually mentioned in connection with the objections made by Guldin to\nCavalieri\n's use of indivisibles. Although that is probably the main issue between\nCavalieri\nand Guldin, a more careful reading of the debate will allow us to indicate the existence of other interesting issues ...\nThe argument really centres around the fact that Guldin is a classical geometer following the methods of the ancient Greek mathematicians. His first point, however, is to accuse\nCavalieri\nof plagiarising\nKepler\n's\nStereometria Doliorum\nⓉ\n(\nStereometry of barrels\n)\n(1615)\nand Sover's\nCurvi ac Recti Proportio\nⓉ\n(\nCurves and right proportions\n)\n(1630)\n. There is something in his argument relating to\nKepler\nsince in that work\nKepler\ndoes regard a circle as an infinite polygon composed of infinitesimals. However,\nCavalieri\n's indivisibles are different from\nKepler\n's infinitesimals. As to the reference to Sover,\nCavalieri\n, in his defence, points out that he wrote his book before Sover's book was published. Guldin attacks\nCavalieri\n's indivisibles by arguing that when a surface is generated by rotating a line about the axis, the surface is not just a set of lines. He writes\n(\nsee\n[\n2\n]\nor\n[\n13\n]\n)\n:-\nIn my opinion no geometer will grant\nCavalieri\nthat the surface is, and could, in geometrical language be called \"all the lines of such a figure\"; never in fact can several lines, or all the lines, be called surfaces; for, the multitude of lines, however great that might be, cannot compose even the smallest surface.\nAs Mancosu writes\n[\n2\n]\n:-\nGuldin was a \"classicist\" geometer, steeped in the idea of explicit construction, sceptical of considerations of infinity in the domain of geometry, and wary of the risk of ending up with an atomistic theory of the continuum.\nIf one asks whether Guldin or\nCavalieri\nis right, then the answer must be\nCavalieri\n. However, this does not make Guldin's work useless for in his support of the classical approach, he forced innovators like\nCavalieri\nto think more deeply and to justify their methods more rigorously.\nIn order to understand why Guldin attacks David Rivaltus in Volume\n4\nwe must realise that, following the line taken by his teacher\nClavius\n, Guldin does not believe that\nArchimedes\n' results are proved in a satisfactory manner.\nArchimedes\n' proofs had been strongly attacked by the humanist Joseph Scaliger in his treatise\nCyclometrica\nⓉ\n(\nMeasuring the circle\n)\n(1594)\n. David Rivaltus replied to these criticisms in\n1615\nwith an equally strong defence of\nArchimedes\n. Guldin, in turn, attacks Rivaltus writing\n[\n13\n]\n:-\nIndeed ostensive demonstrations have always had the applause and the victory over negatives and those reducing to absurdity or impossibility, whatever Rivaltus ... says.\nIn fact in Volume\n4\n, published in\n1641\n, Guldin attempts a reconstruction of most of what was then considered mathematics. His aim is to prove the results without using the method of contradiction. For example, he writes\n(\nsee\n[\n2\n]\nor\n[\n13\n]\n)\n:-\nWe will therefore prove ostensively, in this fourth book, through our principles from rotation and originating from the centre of gravity, the main propositions proved by\nArchimedes\non the 'Sphere and the Cylinder' and similarly on 'Conoids and Spheroids', which he himself had established by contradiction.\nOne point here is worth noting. Despite the argument between Guldin and\nCavalieri\n, both agreed that proofs by contradiction are undesirable. Perhaps surprisingly,\nCavalieri\njustified his approach by arguing that his use of infinitesimals allowed him to prove\nArchimedes\n' results without the use of 'proof by contradiction'.\nFinally, let us look at some details of Guldin's library which still exists. The first fact to note is that Guldin was allowed to keep his own library, something which was very unusual for those within the Jesuit Order. Around\n300\nvolumes have been identified as belonging to Guldin's library although many other books which have been subsequently rebound may have originally belonged to the library but have lost the evidence in the rebinding. Most of the books appear to have had no previous owners and so Guldin was buying new books. Since three books are marked as belonging to the library, yet were purchased after his death, one can deduce that he had a librarian to look after his library. What subjects interested Guldin? There are of course the works of\nGalileo\n, books on arithmetic such as that by\nOronce Finé\n, the Alphonsine Tables, and works by\nFrederico Commandino\n. Guldin was clearly very interested in mechanics because he had a whole series of books on this subject including ones on military equipment, fortifications, artillery and pyrotechnics. Architecture also clearly interested him since he also had several works on that topic.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}