{
  "nome_completo": "Pauline Sperry",
  "nome_curto": "Pauline Sperry",
  "ano_nascimento": "1885",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sperry/",
  "lugar_nascimento": "Peabody, Massachusetts, USA",
  "lugar_morte": "Pacific Grove, California, United States",
  "biografia": "Pauline Sperry\n's parents were Willard G Sperry and Henrietta Leoroyd. Pauline was born in Peabody, northeastern Massachusetts, which is\n27\nkm northeast of Boston. In fact the town had been called South Danvers but it was renamed Peabody after the philanthropist George Peabody\n17\nyears before Sperry was born. Since Sperry would turn out to be a philanthropist herself, there is a little coincidence here. Willard Sperry was a Congregational minister and Pauline was brought up with the religious values of her father.\nFrom her father Pauline learnt of the importance of education, freedom of conscience, civil and religious liberty and social reform, while she benefited from his openness of outlook. It was Pauline's strong religious upbringing which later saw her join the Quakers and devote the latter part of her life to political action to try to change society for the better.\nSperry studied at Smith College which was a liberal arts college for women in Northampton, Massachusetts. The College was named after Sophia Smith who left her fortune to found the College which opened in\n1875\n. This College had a special place in Sperry's life and her undergraduate days there were very happy ones. It was not only mathematics which Sperry enjoyed at Smith, it was also music. She took a full part in the mathematical and musical life of the College, in particular enjoying the mathematical club and singing in the Choral Choir. She graduated with a B.A. in\n1906\nbut then left Smith College for a year. During\n1906\n-\n07\nSperry was in New York City, teaching at the Hamilton Institute which was a private school.\nIn\n1907\nSperry returned to Smith College to continue her mathematical and musical studies. After one year of study she was awarded a Master's degree and then she spent the next four years teaching as an Instructor in Mathematics at Smith. Looking to continue studying mathematics, Sperry was awarded a travelling fellowship in\n1912\n-\n13\n. First she went to Olivet College in Olivet, Michigan, which was affiliated to the Congregational Church. Olivet was a private, coeducational institution, being in fact founded in\n1844\nwhich made it the second coeducational college in the United States. During this year Sperry began graduate studies at the University of Chicago.\nThe thrill of studying advanced mathematics at Chicago made Sperry determined to carry her studies further and when her travelling fellowship ended she matriculate at the University of Chicago, registering for a Master's Degree. In\n1914\nshe completed her dissertation On the theory of a one-to-one and one-to-two correspondence with geometrical illustrations and was awarded another Master's Degree in mathematics. She then began to work for her doctorate under\nWilczynski\n's supervision.\nWilczynski\nhad begun his research career as a mathematical astronomer but his study of the dynamics of astronomical objects had turned his interests towards differential equations and then to projective\ndifferential geometry\nand ruled surfaces. He was on the staff at Chicago from\n1910\nand, in the year that Sperry was awarded her Master's Degree,\nWilczynski\nwas promoted to full professor. Given\nWilczynski\n's interests, it is not surprising that Sperry worked on geometry and astronomy for her doctorate which was awarded in\n1916\nfor the thesis\nProperties of a certain projectively defined two-parameter family of curves on a general surface\nin\n1916\n. The results of her thesis were published in the\nAmerican Journal of Mathematics\nin\n1918\n.\nDuring the year\n1915\n-\n16\n, while Sperry was completing work on her thesis, she also held a teaching fellowship at Chicago. Following the award of her doctorate she returned to Smith College where she taught for a year before being appointed to The University of California in Berkeley. Although Sperry published no further research articles after the work of her thesis, her career progressed well at Berkeley. In\n1923\nshe was promoted to assistant professor, the first woman to achieve this rank at Berkeley, and then in\n1932\nshe was appointed associate professor, again being the first woman to achieve this position. Her distinguished teaching career, during which time she published two excellent texts, one on plane geometry and the other on spherical trigonometry, came to a premature end in\n1950\n.\nIn February\n1950\nSenator Joseph R McCarthy of Wisconsin claimed that\n205\nState Department employees were communists who were disloyal to the United States. McCarthy enjoyed a highly successful few years by making these charges of disloyalty that, though mostly undocumented, badly hurt government employees, teachers, and university professors. Although McCarthy was the most prominent person taking this line, it was a road that the United States was already on and the State of California had for some time been discussing loyalty oaths. In\n1950\nthe Board of Regents of the State of California decided to implement a policy that all employees sign a loyalty oath, and the University of California at Berkeley was chosen as one of the first test cases for it. Nineteen faculty members of the University of California refused; Sperry was one such faculty member. As a Quaker Sperry could not swear any oaths and it was therefore usual to exempt Quakers from the need to take an oath. This was not done, however, in Sperry's case.\nThe assumption was that anyone who would not sign the oath must be a communist sympathiser and must be sacked, so Sperry, as one of those who refused, lost her associate professor position. Many considered that the oath violated their rights of academic freedom which university researchers valued most highly. Of course the witch-hunts against imaginary communists in the early\n1950\nwas a disgraceful affair which cost many their jobs and led to long-term suffering. Sperry was always prepared to make her views known and become involved in politics, and so went further than just refuse to take the oath, she actively campaigned so that everyone would understand the implications of signing the oath. Sperry and a number of others to their case to the appellate court and eventually the courts proclaimed the oath to be unconstitutional. Sperry was given the title associate professor emerita at Berkeley and, four years after winning her case, she was awarded two years back pay for the period during which she had been deprived of her teaching position.\nSperry went to Carmel which is a city in western California on the Carmel River and Carmel Bay, adjacent to Monterey. From here she launched herself into a vigorous campaign to promote human rights and civil rights. She was put onto various Quaker committees and also committees of the American Civil Liberties Union which had been founded in\n1920\nto promote constitutional liberties in the United States. For example she served on the Friends Service Committee, a Quaker organisation set up to promote peace and reconciliation through social service and public information. She also served on the Fellowship of Reconciliation, an international pacifist organization, and on the Committee for a Sane Nuclear Policy.\nIt was not only time which Sperry gave to the causes she supported, she also gave freely of her own money. She\n[\n1\n]\n:-\n... with characteristic modesty and generosity, founded and maintained the Step-by-Step School in Port-au-Prince, Haiti, to feed and teach starving children.\nIn\n[\n2\n]\nSperry gave her formula for happiness. Everyone should be:-\n... bold enough to ask the right questions, and brave enough to face the answers about the untouchable subject, money. ... Give 'till it hurts!",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}