{
  "nome_completo": "Paul Adrien Maurice Dirac",
  "nome_curto": "Paul Dirac",
  "ano_nascimento": "1902",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dirac/",
  "lugar_nascimento": "Bristol, England",
  "lugar_morte": "Tallahassee, Florida, USA",
  "biografia": "Paul Dirac\n's father was Charles Adrien Ladislas Dirac and his mother was Florence Hannah Holten. Charles Dirac was a Swiss citizen born in Monthey, in the Valais Canton of Switzerland, while his mother came from Cornwall in England. Charles had been educated at the University of Geneva, then came to England in around\n1888\nand taught French in Bristol. There he met Florence, whose father had moved to Bristol as Master Mariner on a Bristol ship, when she was working in the library there. Charles and Florence married in\n1899\nand they moved into a house in Bishopston, Bristol, which they named Monthey after the town of Charles's birth. By this time Charles was teaching French at the secondary school attached to the Merchant Venturers Technical College in Bristol.\nPaul was one of three children, his older brother being Reginald Charles Felix Dirac and his younger sister being Beatrice Isabelle Marguerite Walla Dirac. Paul had a very strict family upbringing. His father insisted that only French be spoken at the dinner table and, as a result, Paul was the only one to eat with his father in the dining room. Paul's father was so strict with his sons that both were alienated and Paul was brought up in a somewhat unhappy home.\nThe first school which Paul attended was Bishop Primary school and already in this school his exceptional ability in mathematics became clear to his teachers. When he was twelve years old he entered secondary school, attending the secondary school where his father taught which was part of the Merchant Venturers Technical College. At about the time Paul entered this school, World War I began and this had a beneficial effect for Paul since the older boys in the school left for military service and the younger boys had more access to the science laboratories and other facilities. Paul himself wrote about his school years in\n[\n14\n]\n:-\nThe Merchant Venturers was an excellent school for science and modern languages. There was no Latin or Greek, something of which I was rather glad, because I did not appreciate the value of old cultures. I consider myself very lucky in having been able to attend the school. ... I was rushed through the lower forms, and was introduced at an especially early age to the basis of mathematics, physics and chemistry in the higher forms. In mathematics I was studying from books which mostly were ahead of the rest of the class. This rapid advancement was a great help to me in my latter career.\nHe completed his school education in\n1918\nand then studied electrical engineering at the University of Bristol. By this time the University had combined with the Merchant Venturers Technical College so Dirac remained in the same building as he had studied during his four years at secondary school. Although mathematics was his favourite subject he chose to study an engineering course at university since he thought that the only possible career for a mathematician was school teaching and he certainly wanted to avoid that profession. He obtained his degree in engineering in\n1921\nbut following this, after an undistinguished summer job in an engineering works, he did not find a permanent position. By this time he was developing a real passion for mathematics but his attempts to study at Cambridge failed for rather strange reasons.\nTaking the Cambridge scholarship examinations in June\n1921\nhe was awarded a scholarship to study mathematics at St John's College, Cambridge, but it did not provide enough to support him. Additional support would have been expected from his local education authority, but he was refused support on the grounds that his father had not been a British citizen for long enough. Dirac was offered the chance to study mathematics at Bristol without paying fees and he did so being awarded first class honours in\n1923\n. Following this he was awarded a grant to undertake research at Cambridge and he began his studies there in\n1923\n.\nDirac had been hoping to have his research supervised by\nEbenezer Cunningham\n, for by this time Dirac had become fascinated in the general theory of relativity and wanted to undertake research on this topic.\nCunningham\nalready had as many research students as he was prepared to take on and so Dirac was supervised by Ralph\nFowler\n. The authors of\n[\n13\n]\nwrite:-\nFowler was then the leading theoretician in Cambridge, well versed in the\nquantum theory\nof atoms; his own research was mostly on statistical mechanics. He recognised in Dirac a student of unusual ability. Under his influence Dirac worked on some problems in statistical mechanics. Within six months of arriving in Cambridge he wrote two papers on these problems. No doubt\nFowler\naroused his interest in the quantum theory, and in May\n1924\nDirac completed his first paper dealing with quantum problems. Four more papers were completed by November\n1925\n.\nDespite the obvious academic success Dirac enjoyed as a research student this was no easy time for him. His brother Reginald Dirac committed suicide during this period. No reason for the suicide seems to be known but Dirac's relations with his father, already strained, seemed almost to end completely after this which does suggest that Dirac felt that his father carried at least some responsibility. Already a person who had few friends, this personal tragedy had the effect of making him even more withdrawn.\nAlthough he had already made an excellent start to his research career, even more impressive work was to follow. This was as a result of Dirac being given proofs of a paper by\nHeisenberg\nto read in the summer of\n1925\n. The significance of the algebraic properties of\nHeisenberg\n's commutators struck Dirac when he was out for a walk in the country. He realised that\nHeisenberg\n's uncertainty principle was a statement of the noncommutativity of the quantum mechanical observables. He realised the analogy with\nPoisson\nbrackets in Hamiltonian mechanics. Higgs writes in\n[\n14\n]\n:-\nThis similarity provided the clue which led him to formulate for the first time a mathematically consistent general theory of quantum mechanics in correspondence with Hamiltonian mechanics.\nThe ideas were laid out in Dirac's doctoral thesis\nQuantum mechanics\nfor which he was awarded a Ph.D. in\n1926\n. It is remarkable that Dirac had eleven papers in print before submitting his doctoral dissertation. Following the award of the degree he went to Copenhagen to work with\nNiels Bohr\n, moving on to Göttingen in February\n1927\nwhere he interacted with Robert Oppenheimer,\nMax Born\n, James Franck and the Russian Igor Tamm. Accepting an invitation from\nEhrenfest\n, he spent a few weeks in Leiden on his way back to Cambridge. He was elected a Fellow of St John's College, Cambridge in\n1927\n.\nDirac visited the Soviet Union in\n1928\n. It was the first of many visits for he went again in\n1929\n,\n1930\n,\n1932\n,\n1933\n,\n1935\n,\n1936\n,\n1937\n,\n1957\n,\n1965\n, and\n1973\n. Also in\n1928\nhe found a connection between relativity and quantum mechanics, his famous spin-\n1\n/\n2\nDirac equation. In\n1929\nhe made his first visit to the United States, lecturing at the Universities of Wisconsin and Michigan. After the visit, along with\nHeisenberg\n, he crossed the Pacific and lectured in Japan. He returned via the trans-Siberian railway.\nIn\n1930\nDirac published\nThe principles of Quantum Mechanics\nand for this work he was awarded the Nobel Prize for Physics in\n1933\n. De Facio, reviewing\n[\n4\n]\n, says of this book:-\nDirac was not influenced by the feeding frenzy in experimental phenomenology of the time. This has given Dirac's book ... a lasting quality that few works can match.\nThe authors of\n[\n13\n]\ncomment that the book:-\n... reflects Dirac's very characteristic approach: abstract but simple, always selecting the important points and arguing with unbeatable logic.\nThe obituary\n[\n2\n]\nnotes:-\nHis lectures at Cambridge were closely modelled on\n[\nThe principles of Quantum Mechanics\n]\n, and they conveyed to generations of students a powerful impression of the coherence and elegance of quantum theory. They constituted his principal contribution to education, for he took very few research students.\nAlso in\n1930\nDirac was elected a Fellow of the\nRoyal Society\n. This honour came on the first occasion that his name was put forward, in itself quite an unusual event which says much about the extremely high opinion that Dirac's fellow scientists had of him.\nDirac was appointed Lucasian professor of mathematics at the University of Cambridge in\n1932\n, a post he held for\n37\nyears. In\n1933\nhe published a pioneering paper on Lagrangian quantum mechanics which became the foundation on which\nFeynman\nlater built his ideas of the path integral. In the same year Dirac received the Nobel prize for physics which he shared with\nSchrödinger\n. It is an interesting comment on Dirac's nature that his first thought was to turn down the prize on the grounds that he hated publicity. However when it was pointed out to him that he would receive far more publicity if he turned down the prize, he accepted it. Another comment about this event is that Dirac was told that he could invite his parents to the award ceremony in Stockholm, but he chose to invite only his mother and not his father.\nThe academic year\n1934\n-\n35\nwas important for Dirac both for personal and professional reasons. He visited the Institute for Advanced Study at Princeton and there he became friendly with\nWigner\n. While Dirac was there\nWigner\n's sister Margit, who lived in Budapest, visited her brother. This chance meeting led, in January\n1937\n, to Dirac marrying Margit in London. Margit had been married before and had two children Judith and Gabriel Andrew from her first marriage. Both children adopted the name Dirac and Gabriel Andrew Dirac went on the became a famous pure mathematician, particularly contributing to graph theory, becoming professor of pure mathematics at the University of Aarhus in Denmark.\nIn\n1937\n, the same year that he married, Dirac published his first paper on large numbers and cosmological matters. We comment further on his ideas on cosmology below. He published his famous paper on classical electron theory, which included mass renormalisation and radiative reaction in\n1938\n. Dirac worked during World War II on uranium separation and nuclear weapons. In particular he acted as a consultant to a group in Birmingham working on atomic energy. This association led to Dirac being prevented by the British government from visiting the Soviet Union after the end of the war; he was not able to visit again until\n1957\n.\nWe noted above that Dirac was elected a fellow of the\nRoyal Society\nin\n1930\n. He was awarded the\nRoyal Society\n's Royal Medal in\n1939\nand the Society awarded him their Copley Medal in\n1952\n:-\n... in recognition of his remarkable contributions to relativistic dynamics of a particle in quantum mechanics.\nIn\n1969\nDirac retired from the Lucasian chair of mathematics at Cambridge and went with his family to Florida in the United States. He held visiting appointments at the University of Miami and at Florida State University. Then, in\n1971\n, Dirac was appointed professor of physics at Florida State University where he continued his research.\nIn\n1973\nand\n1975\nDirac lectured in the Physical Engineering Institute in Leningrad. In these lectures he spoke about the problems of cosmology or, to be more precise, to the problems of non-dimensional combinations of world constants.\nAlthough Dirac made vastly important contributions to physics, it is important to realise that he was always motivated by principles of mathematical beauty. Dirac unified the theories of quantum mechanics and relativity theory, but he also is remembered for his outstanding work on the magnetic monopole, fundamental length, antimatter, the d-function, bra-kets, etc.\nThere is a standard folklore of Dirac stories, mostly revolving around Dirac saying exactly what he meant and no more. Once when someone, making polite conversation at dinner, commented that it was windy, Dirac left the table and went to the door, looked out, returned to the table and replied that indeed it was windy. It has been said in jest that his spoken vocabulary consisted of \"Yes\", \"No\", and \"I don't know\". Certainly when\nChandrasekhar\nwas explaining his ideas to Dirac he continually interjected \"yes\" then explained to\nChandrasekhar\nthat \"yes\" did not mean that he agreed with what he was saying, only that he wished him to continue. He once said:-\nI was taught at school never to start a sentence without knowing the end of it.\nThis may explain much about his conversation, and also about his beautifully written sentences in his books and papers.\nDirac received many honours for his work, some of which we have mentioned above. He refused to accept honorary degrees but he did accept honorary membership of academies and learned societies. The list of these is long but among them are\nUSSR Academy of Sciences\n(1931)\n,\nIndian Academy of Sciences\n(1939)\n, Chinese Physical Society\n(1943)\n,\nRoyal Irish Academy\n(1944)\n,\nRoyal Society of Edinburgh\n(1946)\n, Institut de France\n(1946)\n, National Institute of Sciences of India\n(1947)\n, American Physical Society\n(1948)\n,\nNational Academy of Sciences\n(1949)\n,\nNational Academy of Arts and Sciences\n(1950)\n,\nAccademia delle Scienze di Torino\n(1951)\n, Academia das Ciencias de Lisboa\n(1953)\n,\nPontifical Academy of Sciences\n, Vatican City\n(1958)\n,\nAccademia Nazionale dei Lincei\n, Rome\n(1960)\n,\nRoyal Danish Academy of Sciences\n(1962)\n, and\nAcadémie des Sciences Paris\n(1963)\n. He was appointed to the Order of Merit in\n1973\n.\nA memorial meeting was held at the University of Cambridge on\n19\nApril\n1985\nand the papers presented at this meeting were published in\nTributes to Paul Dirac, Cambridge,\n1985\n(\nBristol,\n1987)\n. The papers\n[\n12\n]\n,\n[\n15\n]\n,\n[\n25\n]\n,\n[\n30\n]\n,\n[\n37\n]\n,\n[\n39\n]\nand\n[\n40\n]\ncome from this volume. Achuthan, reviewing the volume, writes:-\n... we vividly see everywhere the brilliant imprints of Dirac, unifier of quantum mechanics and relativity theory. Each of the pieces not only is in praise of an exceptionally gifted intellect but also places on record how deeply and abidingly the human mind can delve into the realms of mathematical insight and modelling, keeping intact the spirit of beauty and clarity of a creative genius. Only a few Nobel laureates ever can compare as well with this giant of mathematical sciences in whose demise the world of original thinking certainly has lost one of the most precious souls retaining fortunately still the glory for others to sing and emulate for a long time to come.\nIn November\n1995\nof a plaque was unveiled in Westminster Abbey commemorating Paul Dirac. The volume\n[\n9\n]\nconsists of lectures presented to the\nRoyal Society\non this occasion. The memorial address was presented by\nStephen Hawking\nwho was Dirac's successor in the Lucasian chair of mathematics at Cambridge which was also\nNewton\n's chair.",
  "math_areas": [
    "Applied Mathematics",
    "Combinatorics",
    "Logic",
    "Statistics"
  ]
}