{
  "nome_completo": "Paul Joseph Cohen",
  "nome_curto": "Paul Cohen",
  "ano_nascimento": "1934",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cohen/",
  "lugar_nascimento": "Long Branch, New Jersey, USA",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Paul Cohen\n's parents, Abraham and Minnie Cohen, were Jewish immigrants to the United States from their native land of Poland. Abraham Cohen was basically an odd job man, turning his hand to a variety of different jobs, while his wife brought in some much needed money to the family from dressmaking. Paul was the youngest of his parents' four children and he was brought up in Brooklyn, New York. He was brought up by his mother from the age of nine since at that time his parents separated. Interested in mathematics from childhood, he began to study advanced mathematics from a young age. He\n[\n4\n]\n:-\n... was only nine years old when his sister Sylvia checked out a book about calculus from a New York library for him. Librarians were reluctant to let her have the book, much less for her younger brother, arguing that even some college professors didn't understand calculus.\nThroughout his teenage years he was regarded as a mathematical prodigy, amazing all around him with the abilities he displayed in mathematics competitions. He attended Stuyvesant High School in New York City, graduating in\n1950\nat the young age of sixteen years. This school, with a high reputation for mathematics and science, accepted only the best students after taking an entrance examination. After graduating from Stuyvesant High School, Cohen was a student at Brooklyn College from\n1950\nuntil\n1953\nbut left without taking a degree having been admitted to graduate studies at the University of Chicago after making a visit to discuss his research options at Chicago. He studied for his master's degree at Chicago, taking courses to fit in with his aim at the time which was to undertake research in number theory. His knowledge of number theory before arriving in Chicago was from a number of classic texts that he had read on his own while at College. To fit in with this aim he began to work on number theory supervised by\nAndré Weil\n. He was awarded his Master's degree in\n1954\nbut he came to be more interested in the fact that certain results in number theory were undecidable than in number theory itself. Number theory, however, remained a topic of interest to him throughout his career\n[\n14\n]\n:-\nHe made a habit of asking the faculty and fellow students what the most important problems were in their fields because those were the only problems he wanted to solve.\nContinuing to study at Chicago for his doctorate under the supervision of\nAntoni Zygmund\nhe was awarded his PhD in\n1958\nfor his doctoral thesis\nTopics in the Theory of Uniqueness of Trigonometric Series\n. In this thesis, Cohen states that he\n[\n6\n]\n:-\n... wishes to express his deepest gratitude to Professor A\nZygmund\nfor his constant aid and encouragement during the preparation of this dissertation.\nHe begins the Introduction by putting the topic of the thesis into context\n[\n6\n]\n:-\nThe theory of uniqueness of trigonometrical series can be regarded as arsing from the question of deciding in what sense the\nFourier series\nof a function may be considered as the legitimate expansion of the function in an infinite trigonometrical series. We know, of course, that if the series converges boundedly to the function, then indeed the coefficients of the series must be given by the\nEuler\n-\nFourier\nFormulas. However, in the absence of such a condition, we may ask ourselves whether two trigonometrical series may converge to the same function everywhere. The answer to this question is in the negative and was essentially proved so by\nRiemann\n, the proof being completed by\nCantor\n. It is with the replacement of the condition of convergence everywhere with that of convergence almost everywhere, that the theory of sets of uniqueness is concerned.\nThe years as a research student were good ones for Cohen and he made many friendships with fellow students, friendships that would last throughout his life.\nJohn Thompson\nwas one such fellow research student at Chicago. Cohen, through these friendships, had also begun to take an interest in logic\n[\n14\n]\n:-\nAs a graduate student Cohen's connection with logic were his friendships with a lively group of students who became logicians; Michael Morley, Anil Nerode, Bill Howard,\nRay Smullyan\n, and Stanley Tennenbaum. For a while he lived in Tennenbaum's house and absorbed logic by osmosis, for there were no courses in logic in the Chicago mathematics department.\nIn\n1957\n, before the award of his doctorate, Cohen was appointed as an Instructor in Mathematics at the University of Rochester for a year. He then spent the academic year\n1958\n-\n59\nat the Massachusetts Institute of Technology before spending\n1959\n-\n61\nas a fellow at the Institute for Advanced Study at Princeton. These were years in which Cohen made a number of significant mathematical breakthroughs. In\nFactorization in group algebras\n(1959)\nhe showed that any integrable function on a locally compact group is the convolution of two such functions, solving a problem posed by\nWalter Rudin\n. In\nOn a conjecture of Littlewood and idempotent measures\n(1960)\nCohen made a significant breakthrough in solving the\nLittlewood\nConjecture. He had earlier written to\nHarold Davenport\ntelling him about this result and\nDavenport\nreplied\n[\n16\n]\n:-\n... to Paul saying that if Paul's proof held up, he would have bettered a generation of British analysts who had worked hard on this problem. Paul's proof did hold up; in fact,\nDavenport\nwas the first to improve on Paul's result.\nIn\n1961\nCohen was appointed to the faculty at Stanford University as an assistant professor of mathematics. He was promoted to associate professor in mathematics in the following year and, also in\n1962\n, was awarded an Alfred P Sloan research fellowship. In August\n1962\nCohen participated in the International Congress of Mathematicians in Stockholm. He was an invited speaker giving the address\nIdempotent measures and homomorphisms of group algebras\n. On a cruise from Stockholm to Leningrad, following the Congress, Cohen met Christina Karls from Malung, Sweden. They married on\n10\nOctober\n1963\nand had three sons, twins Eric and Steven, and Charles.\nHe was promoted to full professor at Stanford University in\n1964\nhaving, by this time, solved one of the most challenging open problems in mathematics. Cohen used a technique called \"forcing\" to prove the independence in set theory of the\naxiom of choice\nand of the generalised\ncontinuum hypothesis\n. Angus MacIntyre writes\n[\n13\n]\n:-\nA dramatic aspect of the continuum hypothesis work is that Cohen was a self-taught outsider in logic. His work on set theory and p-adic fields has a very characteristic style, combinatorial and rather free of general theory.\nIn\n[\n7\n]\nCohen explains how he came to the idea of forcing from reading\nKurt Gödel\n's\nThe Consistency of the Continuum Hypothesis\n, a book consisting of notes of a course given at the Institute for Advanced Study in\n1938\n-\n39\n. The continuum hypothesis problem was the first of\nDavid Hilbert\n's famous\n23\nproblems delivered to the Second International Congress of Mathematicians in Paris in\n1900\n.\nHilbert\n's famous speech\nThe Problems of Mathematics\nchallenged\n(\nand today still challenges\n)\nmathematicians to solve these fundamental questions and Cohen has the distinction of solving Problem\n1\n.\nHe had begun working on the independence of the continuum hypothesis towards the end of\n1962\n. By April\n1963\nhe felt things click into place\n[\n7\n]\n:-\nThere are certain moments in any mathematical discovery when the resolution of a problem takes place at such a subconscious level that, in retrospect, it seems impossible to dissect it and explain its origin. Rather, the entire idea presents itself at once, often perhaps in a vague form, but gradually becomes more precise.\nAfter reading Cohen's proof which he sent in a letter of\n9\nMay\n1963\n,\nKurt Gödel\nreplied to him:-\nLet me repeat that it is really a delight to read your proof of the independence of the continuum hypothesis. I think that in all essential respects you have given the best possible proof and this does not happen frequently. Reading your proof had a similarly pleasant effect on me as seeing a really good play.\nCohen spoke about his work on the independence of the axiom of choice and the continuum hypothesis from the axioms of\nZermelo\n-\nFraenkel\nset theory in a lecture\nIndependence results in set theory\ndelivered at the international symposium on the 'Theory of Models' at Berkeley on\n4\nJuly\n1963\n. His proof appeared in the two papers\nThe independence of the continuum hypothesis\n(1963)\nand\nThe independence of the continuum hypothesis. II\n(1964)\n.\nAndrzej Mostowski\n, reviewing the first of these, writes:-\nThese results present the long-awaited solutions of the most outstanding open problems of axiomatic set theory and should be rated as the most important advance in the study of axiomatic set theory since the publication of\nGödel\n's\n1940\nmonograph 'The consistency of the continuum hypothesis'\n(1940)\n. ... to this reviewer it seems more than probable that the influence of Cohen's discovery will be at least as deep in metamathematics as in the general philosophy of mathematics\n(\nand perhaps not only of mathematics\n)\n.\nAngus MacIntyre, who was a graduate student at Stanford from\n1964\nto\n1967\n, writes\n[\n4\n]\n:-\nHe inspired me when I was a young mathematician. I never heard him lecture on set theory, but rather on algebraic geometry and p-adic fields. He had a very special style, full of enthusiasm and very 'hands on.' He used as little general theory as possible and always conveyed a sense that he got to the heart of things. His techniques, even in something as abstract as set theory, were very constructive. He was dauntingly clever, and one would have had to be naive or exceptionally altruistic to put one's 'hardest problem' to the Paul I knew in the '\n60\ns.\nSee an article by Paul Cohen on mathematics and teaching at\nTHIS LINK\nIn\n1966\nCohen published the monograph\nSet theory and the continuum hypothesis\nbased on a course he gave at Harvard in spring\n1965\n. Azriel Lévy\n(\nwho first heard Cohen's results at the Berkeley model theory conference\n)\nwrites:-\nThis monograph is mostly an exposition of the celebrated results of the author, namely the independence of the continuum hypothesis and the axiom of choice. In addition it presents also the main classical results in logic and set theory. ... This book presents a fresh and intuitive approach and it gives some glimpses into the mental process that led the author to his discoveries. The reader will find in this book just the right amount of philosophical remarks for a mathematical monograph.\nIn the same year Cohen was awarded a\nFields Medal\nfor his fundamental work on the foundations of set theory. It was presented to him by\nMstislav Vsevolodovich Keldysh\n, President of the\nUSSR Academy of Sciences\n, at the\n1966\nInternational Congress of Mathematicians in Moscow. Only one\nFields\nMedalist\n(\nLars Ahlfors\n)\nhas been awarded the\nFields\nMedal at a younger age.\nAlonzo Church\ngave an address to the Congress on\nPaul J Cohen and the continuum problem\ndescribing Cohen's remarkable achievements. The\nFields\nMedal, however, was not the first award that Cohen received. In\n1964\nhe was awarded the\nBôcher\nMemorial Prize from the\nAmerican Mathematical Society\n:-\n...for his paper, On a conjecture of Littlewood and idempotent measures, American Journal of Mathematics\n82\n(1960)\n,\n191\n-\n212\n.\nThree years later, in\n1967\n, Cohen received the National Medal of Science:-\nFor epoch-making results in mathematical logic which have enlivened and broadened investigations in the foundation of mathematics.\nHe received the award from President Lyndon B Johnson in a ceremony in the White House on\n13\nFebruary\n1968\n. He has also been elected to the\nNational Academy of Sciences\n, the\nAmerican Academy of Arts and Sciences\n, and as an honorary foreign member of the\nLondon Mathematical Society\n.\nIn addition to his work on set theory, Cohen worked on\ndifferential equation\nand harmonic analysis. Dawn Levy reports in\n[\n12\n]\ncomments made about Cohen by Peter Sarnak\n(\nprofessor of mathematics at Princeton and a former doctoral student of Cohen's with the thesis\nPrime Geodesic Theorems\n(1980))\n:-\nPaul Cohen was one of the most brilliant mathematicians of the\n20\nth\ncentury. Like many great mathematicians, his mathematical interests and contributions were very broad, ranging from mathematical analysis and differential equations to mathematical logic and number theory. This breadth was highlighted in a conference held at Stanford last September celebrating Cohen's work and his\n72\nnd\nbirthday. The gathering consisted of leading experts in different fields who normally would not find themselves listening to the same set of lectures. ... Cohen was a dynamic and enthusiastic lecturer and teacher. He made mathematics look simple and unified. He was always eager to share his many ideas and insights in diverse fields. His passion for mathematics never waned.\nMacintyre writes about the important papers Cohen produced after his outstanding results on the continuum hypothesis\n[\n13\n]\n:-\nIn\n1969\nCohen published a highly original paper on p-adic cell decomposition, giving a constructive version of the famous results of Ax-Kochen-Ersov. It is now fundamental for logical analysis of motivic integration. From\n1969\non Cohen devoted himself to some of the most challenging and unyielding problems, such as the\nRiemann\nHypothesis. He was a passionate and inspiring mathematician.\nKathy Owen, who spent time at Stanford in the\n1970\ns, wrote about Cohen at that time\n[\n16\n]\n:-\nPaul was an astonishing man. Impatient, restless, competitive, provocative and brilliant. He was a regular at coffee hour for the graduate students and the faculty. He loved the cut-and-thrust of debate and argument on any topic and was relentless if he found a logical weakness in an opposing point of view. There was simply nowhere to hide! He stood out for his razor-sharp intellect, his fascination for the big questions, his strange interest in \"perfect pitch\"\n(\nhe brought a tuning fork to coffee hour and tested everyone\n)\nand his mild irritation with the few who do have perfect pitch. He was a remarkable man, a dear friend who had a big impact on my life, a light with the full spectrum of colours.\nCohen was named Marjorie Mhoon Fair Professor in Quantitative Science at Stanford in\n1972\n, being the first holder of this chair. He formally retired in\n2004\n, but continued teaching at Stanford until shortly before his death. He died of a rare lung disease at Stanford Hospital in Palo Alto.\nAs to Cohen's interests outside mathematics, he played both the piano and violin, sang in a Stanford chorus, and was a member of a Swedish folk group. He was an accomplished linguist speaking Swedish, French, Spanish, German and Yiddish. He and his wife hosted frequent dinner parties for students, colleagues and friends. He loved showing visitors round San Francisco and the surrounding area.\nLet us end this biography by quoting Cohen's reminiscences about his work on the continuum hypothesis\n[\n11\n]\n:-\n... it's somewhat curious that in a certain sense the continuum hypothesis and the axiom of choice are not really difficult problems - they don't involve technical complexity; nevertheless, at the time they were considered difficult. One might say in a humorous way that the attitude toward my proof was as follows. When it was first presented, some people thought it was wrong. Then it was thought to be extremely complicated. Then it was thought to be easy. But of course it is easy in the sense that there is a clear philosophical idea. There were technical points, you know, which bothered me, but basically it was not really an enormously involved combinatorial problem; it was a philosophical idea.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}