{
  "nome_completo": "Paul Gustav Samuel Stäckel",
  "nome_curto": "Paul Stäckel",
  "ano_nascimento": "1862",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stackel/",
  "lugar_nascimento": "Berlin, Prussia (now Germany)",
  "lugar_morte": "Heidelberg, Germany",
  "biografia": "Paul Stäckel\nwas the only son of Marie Elisabeth Ringe and her husband Ernst Gustav Stäckel. Marie Stäckel died early in her son's life. Ernst Stäckel was the head of a secondary school for girls in the city, as well as being a school inspector, so he clearly knew the value of education and wanted the best for his son. Consequently, in\n1871\n, the young Stäckel was sent to Berlin's Joachimsthalsches\nGymnasium\n[\n2\n]\n:-\n... an educational establishment which enjoyed a good reputation ...\nestablished in\n1607\n. Stäckel applied himself well at school, though he seems to have had no particular inclination for mathematics until his seventh year. Even when he was in the equivalent of the sixth form, he was still undecided about his future path in life, eventually narrowing it down to a choice between studying law or mathematics. That mathematics was the path he eventually chose was largely due to the influence of two of his teachers, Mr Schindler and Mr Seebeck, who succeeded in further arousing his interest in and enthusiasm for the subject. Stäckel's reference, written at the end of his schooling in\n1880\n, talks of\n[\n3\n]\n:-\n... a lively interest in mathematics, outstanding achievements\n[\nwith\n]\na clear understanding\n[\nof mathematical and physical concepts\n]\n.\nHis exam results were described as superb.\nIn\n1866\n, when Stäckel was four years old, the political situation became somewhat volatile. The Prussian leader, Otto von Bismarck, provoked Austria into declaring war on Prussia. Against expectations, Prussia was victorious, winning what is now referred to as the Austro-Prussian War. Four years later, Bismarck engineered what is now known as the Franco-Prussia War which was won resoundingly by Prussia. Bismarck now moved to form a union of the states with the Prussian King Wilhelm I as Kaiser. Although the Kaiser was in overall control, the states largely ruled themselves and the political situation was reasonably stable. This was the background against which Stäckel lived, the balance only being disturbed late on in his life by the outbreak of World War I. However, this was far in the future as Stäckel left school and set off on his chosen career path.\nHaving chosen to undertake further study, Stäckel entered the University of Berlin and attended lectures, primarily in mathematics and physics, but also some in philosophy, psychology, history and educational theory. Among his teachers were the mathematicians\nKronecker\n,\nKummer\n,\nWangerin\nand\nWeierstrass\n, the latter seemingly having the biggest influence in the early years of his career. As a student, Stäckel did not go unnoticed, his tutors soon recognising both his talent and his diligence. Stäckel became a member of the university Mathematische Verein, a mathematical society for interested students to meet and discuss the latest developments in the subject. At one point he served as its president.\nStäckel completed his degree in\n1884\nand gained his PhD a year later with a thesis entitled\nThe Motion of a Particle Across a Surface\nwhich was inspired by the work of, among others,\nEuler\n,\nLagrange\nand\nJacobi\n. At this point, Stäckel's intention was to become a teacher, so in\n1886\nhe took and passed his teaching exams, specialising in mathematics and physics.\nIt was compulsory for young men to undertake one year of military service and Stäckel completed this in his home city from October\n1886\nto September\n1887\n. The following twelve months were spent completing the necessary probationary teaching year at the Königlichen Wilhelms-Gymnasium, also in Berlin. After the probationary period was over, he remained at the school for a further two years as a science teaching assistant. We know from the official evaluation report that his time at the school was successful and he had a good rapport with the students. It is uncertain whether Stäckel\n[\n2\n]\n:-\n... felt under-challenged as a teacher ...\nor whether there were other factors, however he chose to turn his back on teaching and instead opted for the uncertain path of academia.\nIn\n1891\n, Stäckel's\nhabilitation\nthesis,\nIntegration of Hamiltonian-Jacobian\ndifferential equations\nby means of separation of variables\n, was accepted by the University of Halle, near Leipzig, and he took up a lectureship there. The move to Halle in February was the first of three defining events in Stäckel's life in that year. He also became a member of the\nGerman Mathematical Society\n, the newly-formed society for German mathematicians, in which he would play an important role over the years, including serving as president. The third event was of a more personal nature. On\n6\nMay\n1891\n, Stäckel married his fiancée,\n(\nAlwine Eleonore\n)\nElisabeth Lüdecke, in a ceremony in her home town of Wittenberg. During the time in Halle, the marriage produced a daughter, Hildegard, and a son, Walter, born in January\n1893\n. A second son, Gerhard\n(\nGerd\n)\n, followed in\n1898\n.\nStäckel thrived during his time at Halle, publishing numerous papers, mainly on topics in analysis, mechanics and differential geometry. His efforts did not go unnoticed;\nHilbert\n, who had had dealings with Stäckel, wrote in a letter to\nKlein\nthat\n[\n5\n]\n:-\n... among the younger lecturers, Stäckel distinguishes himself through his enthusiasm and activity.\nWorking in the department at the time was\nCantor\nand this undoubtedly had an influence on Stäckel and some of the directions his mathematical research took.\nBeing so close to Leipzig, the University of Halle had strong links with the University of Leipzig, including a joint mathematics colloquium which met several times a year. It was here that Stäckel became acquainted with\nEngel\n, a professor at Leipzig. The two became close friends and exchanged a great many letters; about one thousand are preserved in the archives of the University of Giessen. Later, the two collaborated on the study of\nnon-Euclidean geometry\n, as well as research into the history of mathematics, perhaps most notably collaborating on the publication of the complete works of\nEuler\n.\nStäckel's stay in Halle lasted until\n1895\nwhen he was called to take up the post of associate professor at the University of Königsberg as a successor to\nMinkowski\n, who had himself recommended Stäckel for the post, having been impressed by his work at Halle. In fact, Stäckel's stay in Königsberg lasted little more than eighteen months, though he earned a great deal of respect during that time. In\n1897\n, a full professorship became available at the University of Kiel, and Stäckel was invited to fill the post. He remained there for the next eight years, during which he produced about five works per year, including some on the teaching of mathematics, in which he still retained an interest.\nSee\nTHIS LINK\nfor an article on Stäckel's teaching giving more information on his interest in mathematical education.\nHe developed strong ties in Kiel, including having a house built for him and his family, and it took something special for him to break those ties. That something was the offer of the prestigious Chair of Mathematics in Hannover, whose previous holders included\nHilbert\nand\nCantor\n. Stäckel accepted the post and spent three years there, receiving various honours in that time.\nAt the beginning of\n1908\n, the Chair of Mathematics became available at Karlsruhe in the state of Baden in southern Germany. Stäckel had been offered the same post six years earlier, but had declined, citing the ties he had in Kiel. When the post became vacant again, Stäckel's name was once more top of the list. A report by the university academic appointments committee explains their choice of candidate for the post:-\nStäckel possesses a great teaching ability, eloquence and agreeable freshness of manner.\n[\n...\n]\nHe has held lectures on the most varying areas of mathematics, has shown a great interest for its application, is a very pleasant person and would be a credit to the university.\nClearly he was rated very highly, but this was still a huge decision for him to move with his family such a long way from home. The deciding factor seems to have been his being granted the title Privy Councillor to the Grand Duke of Baden, conditional on accepting the post in Karlsruhe. Stäckel's time in Karlsruhe may be seen as the high point of his international work and he was certainly very active during the five years he spent there. Alongside his teaching and research duties, he was a member of numerous committees and councils, including the Baden Teaching Committee, the Baden Schools Examinations Council and the Commission for the Encyclopaedia of Mathematical Sciences. He was also rector of the university for the academic year\n1910\n-\n11\n.\nBy this time, Stäckel's renown had stretched not just to other German states, but also to France and Switzerland. He commanded great respect from fellow mathematicians and had many high-profile contacts abroad. We have seen that he was extremely industrious, as well as being very talented. He was also a real polyglot, able to write Latin, speak French and Spanish, and understand basic Italian, English and Russian. He showed a real enthusiasm for mathematics: when he spoke of these things, a particular radiance shone from him. Stäckel was also renowned among his students for delivering new sets of lectures every academic year.\nStäckel's final posting was to the University of Heidelberg, also in Baden. In\n1912\n, the Baden state parliament decided to create a second mathematics chair at the university. First on their list of candidates was\nLandau\nat Göttingen, but he turned down the offer, not wanting to leave the comfort of his current post in order to have the relatively major task of creating the new position in Heidelberg. The post was then offered to Stäckel, who relished such a challenge and threw himself into it wholeheartedly. In fact, during his negotiation with the academic committee prior to his appointment, he secured certain guarantees with regard to his plans for the department which he was able to call upon later. His energy and enthusiasm, as well as his organisational skills, meant he was able to completely transform the department of mathematics. The use of one of the university buildings was secured and this was turned into a separate Mathematical Institute, including two lecture theatres, seminar rooms and a separate library. Stäckel also secured the services of a mathematics assistant.\nWorld War I broke out in Europe in\n1914\nand, though he was in his fifties, Stäckel saw it as his duty to support his country and joined the army as an officer, whilst still continuing with his university commitments. In fact, he was able to secure more and more funding for the department from the university, despite the constraints the war had brought. The war affected Stäckel on a personal level with the death of his sixteen year old son, Gerd, who had been serving as an officer cadet. Gerd was killed in April\n1915\nnear Arras, now in France. This was a hard blow for Stäckel; he wrote in reply to a letter of consolation from his friend\nEngel\n[\n5\n]\n:-\nMany thanks for your warm condolences on the loss, which has now affected us, like so many, many families. Here in Heidelberg, the sons of\n18\nprofessors have fallen up to now, and who knows what more is to come. Certainly, my brave son would say: don't grieve, my fate has been a noble one. But when I think how he went out, in a few months matured from a boy into a solid, confident man, in seriousness and happiness and how all the blossoms of the great and good have now been destroyed, then the pain breaks through with renewed force ...\nStäckel's thoughts on the loss of his son echo those of many thousands of parents, wives and children who lost loved ones during the Great War. Considering the circumstances, it is quite remarkable that Stäckel was able to remain mathematically so productive during the war years.\nTowards the end of the war, Stäckel's health deteriorated following an operation. After several months of treatment, his health improved for a short time, however his condition worsened again in the summer of\n1919\n. He died of a brain tumour aged just\n57\n. Stäckel left behind his wife, daughter and remaining son. Elisabeth Stäckel outlived her husband by nearly twenty years, passing away on\n6\nMay\n1938\n, on what would have been her\n47\nwedding anniversary. Walter Stäckel survived the war and went on to study chemistry, receiving his PhD in\n1922\n.\nAn extract from a letter written by Elisabeth Stäckel to\nEngel\nin September\n1920\ndescribes her husband's final months:-\n... Even a year ago, when we went to Plättig to help his recovery, my husband hoped to gain new strength there for the long winter semester, but even after six weeks at work, the fate which had threatened him for so long overtook him. It was lucky for him that he was able to work for so long and suffered little in his final weeks...\nStäckel continued lecturing long after his illness had taken over and hid the signs even from his closest friends with heroic self-control. It seems he knew his life was nearing its end but chose to carry on as normal.\nAn obituary of Stäckel written by Willy Hellpach described him as:-\n... a scientific figure of quite extraordinary flexibility and versatility.\nHellpach was a friend of Stäckel and had learnt much from him:-\n... there were few people, from whom one could learn so much in such a pleasant way.\nHe describes how Stäckel's death has left a hole which would be felt for years to come. With reference to Stäckel's popularity, Hellpach comments that:-\n... he was well-known, particularly abroad, and his unusually large number of international connections would have made him one of the most valuable representatives of an intellectual renaissance in the future. ... perhaps his untimely death has spared him the gradual fading away of his work.\nThis comment seems to have two different interpretations. Either Hellpach meant that Stäckel was spared seeing his mathematical ability falter as he reached old age, or he may have meant that Stäckel dying earlier than he should have, would somehow make him better remembered in years to come. From the context it is far from clear. Certainly, the name Paul Stäckel, despite being a well-known one during his lifetime, has been forgotten by all but a very few mathematicians of the present day.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}