{
  "nome_completo": "Paul Ehrenfest",
  "nome_curto": "Paul Ehrenfest",
  "ano_nascimento": "1880",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ehrenfest/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Leiden, Netherlands",
  "biografia": "Paul Ehrenfest\n's father, Sigmund Ehrenfest, came from a poor Jewish family. He was working in a weaving mill in the Jewish village of Loschwitz in Moravia when he married Johanna Jellinek. After the marriage they moved to Vienna where they set up a grocery business which fared rather well. They had five children who survived birth, and Paul was the youngest, having four older brothers Arthur, Emil, Hugo, and Otto. Johanna Ehrenfest worked long hours in their shop and Paul was looked after at home by a nursemaid.\nAs a child Paul's health was poor. He was sickly, had dizzy spells, and suffered frequent nosebleeds. He suffered from anti-Semitic comments from other children in the neighbourhood but his brothers supported him strongly and played an important role in his childhood. His oldest brother was twenty-two years old by the time Paul was five and it was through his brothers that Paul became interested in education. They gave him puzzles which he enjoyed solving.\nBy the time he was six years old Paul could read, write and count. Mostly he had taught himself these things, helped a little by his mother, and encouraged by his brothers. At this age, in\n1886\n, he began to attend primary school, moving to a different primary school in\n1888\n. He was introduced to science and mathematics by his brothers, rather than from his school, and their attitude was one which would have quite an influence on him\n[\n2\n]\n:-\nThis early impression of science as something to be learned with joy, something to be discussed and argued about, was absorbed into Ehrenfest's innermost being.\nHe completed his primary schooling in\n1890\nand his school reports show that it had been a very successful time academically with top marks in all his subjects, but already his life was becoming unhappy. His mother who had been ill for some time died of breast cancer in\n1890\n. Paul's father was also in poor health, suffering from stomach ulcers. Soon after Johanna's death Paul's father married again, his second wife being Josephine Jellinek, his first wife's younger sister. Josephine was about the same age as Paul's oldest brother.\nIn\n1890\nPaul began his secondary education at the Akademisches\nGymnasium\n. Perhaps not surprisingly given his problems at home his performance at school deteriorated greatly, both his marks and his behaviour. The only subject he continued to excel in was mathematics. Clearly he was an unhappy child\n[\n2\n]\n:-\nHe was often miserable, deeply depressed and at odds with himself and the world.\nLife did not get better, for when he was sixteen years old his father died from the stomach trouble which had got progressively worse for many years. Arthur, his oldest brother, became his guardian and managed to persuade Paul not to leave school as he wished to do. Things got somewhat better\n[\n2\n]\n:-\nPaul was apparently able to work himself out of his depression, which had sometimes been deep enough to make him contemplate suicide. His intellectual interests grew stronger, perhaps as a form of self-protection.\nIn the summer of\n1899\nEhrenfest successfully took his school examinations, but his experiences of school had been decidedly negative as he showed later in life when he insisted that his own children were educated at home. Ehrenfest became a student at the Technische Hochschule in Vienna in October\n1899\n. There he formed a close friendship with three other students of mathematics,\nHeinrich Tietze\n,\nHans Hahn\nand Herglotz. They called themselves the 'inseparable four'. Ehrenfest attended\nBoltzmann\n's lectures on the mechanical theory of heat during\n1899\n-\n1900\n. Suddenly, thanks mainly to\nBoltzmann\n, the negative thoughts about education which he had at school were replaced with a great love for mathematics and physics.\nAs was the custom at the time, students in Austria and Germany did not usually stay at a single university for their whole undergraduate course. In\n1901\nEhrenfest moved to Göttingen where he studied under\nKlein\nand\nHilbert\n. There he took\nMax Abraham\n's course on the electromagnetic theory of light and also attended courses by Stark, Walther Nernst,\nSchwarzschild\nand\nZermelo\n. While attending courses by\nKlein\nand\nHilbert\n, Ehrenfest saw a young Russian student of mathematics Tatyana Alexeyevna Afnassjewa. He wondered why she did not come to meetings of the mathematics club but then discovered that the reason was that women were not allowed to attend. Ehrenfest challenged this rule and, after quite a battle, was able to get the rule changed. It was the beginning of their friendship which led eventually to their marriage.\nEhrenfest returned to Vienna after spending eighteen months in Göttingen. He obtained his doctorate from Vienna in\n1904\n, under\nBoltzmann\n's supervision, on a topic in classical mechanics The motion of rigid bodies in fluids and the mechanics of\nHertz\n. It was considered a good piece of work but Ehrenfest himself never rated it very highly and chose not to publish it after receiving his doctorate on\n23\nJune\n1904\n. After this Tatyana came from Göttingen to join Ehrenfest in Vienna and they married after overcoming the severe problem of having different faiths. They both had to renounce their religion before the marriage was allowed -- it took place on\n21\nDecember\n1904\n.\nIn\n1905\nEhrenfest published a paper on\nPlanck\n's theory of black-body radiation. It\n[\n2\n]\n:-\n... shows Ehrenfest's real interests and particular talents and the beginning of his personal style.\nHe remained at Vienna but without a post. He returned to Göttingen in September\n1906\n, hoping there might be a position available but there was not. He was shocked to learn, however, that\nBoltzmann\nhad committed suicide on\n6\nSeptember. Ehrenfest took on the task of writing his obituary.\nKlein\n,\nHilbert\n,\nMinkowski\nand\nCarathéodory\nwere all working in Göttingen at this time and it was an important period for Ehrenfest's research.\nKlein\nasked him to write, jointly with his wife if he wished, an article on\nstatistical mechanics\n. The two Ehrenfests began working on the article which would not appear in print until\n1911\n.\nIn\n1907\nEhrenfest went to St Petersburg. It was not that he had a post there but his wife was Russian and the move was probably aimed at finding somewhere where they could feel at home. Certainly Ehrenfest had mixed feelings about his own country given the anti-Semitic attitudes he had encountered. Once in St Petersburg he made contact with\nTamarkin\n,\nFriedmann\n,\nSteklov\nand other mathematicians and physicists.\nThe Ehrenfests spent five years in St Petersburg. It was a time when Ehrenfest was deeply engrossed in research problems. Together with his wife he worked on the review article on statistical mechanics which took longer to complete than expected. He corresponded with\nKlein\nwho told him that what was required was a survey, not a complete solution of all the problems of the subject by Ehrenfest himself. In the hope that this might lead to an academic post Ehrenfest, despite holding a doctorate, took the degree of Master of Physics at St Petersburg. He was successful in obtaining the degree but not the academic post for which he hoped. He tried to find a position by writing to many institutions, including some in North America, but nothing came of any of his enquiries.\nAn important paper was published by Ehrenfest in\n1911\nin\nAnnalen der Physik\non the essential features of\nquantum theory\n. In January\n1912\nEhrenfest set out on a tour of universities in the German speaking world in the hope of a position. He visited Berlin where he saw\nPlanck\n, Leipzig where he saw his old friend Herglotz, Munich where he met\nSommerfeld\n, then Zürich, Vienna, and Prague where he met\nEinstein\nfor the first time. On his travels he learnt that\nPoincaré\nhad written a paper on quantum theory which gave similar results to those in his\nAnnalen der Physik\npaper.\nPoincaré\nhad not known of Ehrenfest's contribution and therefore had not referred to his work.\nEhrenfest returned to St Petersburg saddened that\nPoincaré\n's paper had been published before he could point out his own contribution to him -- he was paying the price for being isolated from mainstream research in St Petersburg. However, his fortunes were about to change.\nLorentz\nwas looking for someone to succeed to his chair at Leiden.\nSommerfeld\nrecommended Ehrenfest, writing\n(\nsee\n[\n2\n]\n)\n:-\nHe lectures like a master. I have hardly ever heard a man speak with such fascination and brilliance. Significant phrases, witty points and dialectic are all at his disposal in an extraordinary manner ... He knows how to make the most difficult things concrete and intuitively clear. Mathematical arguments are translated by him into easily comprehensible pictures.\nOn\n29\nSeptember\n1912\nEhrenfest received a telegram saying that he had been named professor at Leiden. He remained at Leiden for the rest of his career. We examine now some of the contributions which he made while working there.\nIn\n1917\nand\n1920\nEhrenfest published papers investigating the problem of the extent to which the three-dimensional nature of physical space is determined by the structure of basic physical equations or is reflected in these basic equations. Ehrenfest's arguments were based both on\nNewton\n's celestial mechanics and also on\nEinstein\n's relativity theory.\nAmong Ehrenfest's contributions to quantum statistics was an understanding of the nature of photons, and their properties which were implied by\nPlanck\n's radiation law. He worked on quantum theory applying it to rotating bodies. He recognised that\nAmpère\n's molecular currents are incompatible with classical statistical mechanics. He proposed a model of diffusion in order to illuminate the statistical interpretation of the second law of thermodynamics, that the entropy of a closed system can only increase. The modern theory of nonequilibrium thermodynamics brings together the molecular, collisional ideas of\nBoltzmann\nwith the statistical ideas of Ehrenfest's to give a nonlinear, statistical theory.\nIn\n1933\nEhrenfest presented a classification of phase transitions based on the discontinuity in derivatives of the free energy function.\nUhlenbeck\nwas a student of Ehrenfest who began research for his Master's degree in\n1920\n. He spoke of Ehrenfest's teaching style\n[\n9\n]\n:-\nFirst the assertion, then the proof ... His famous clarity\n[\nshould\n]\nnot to be confused with rigour. ... He never gave or made problems; he did not believe in them; in his opinion the only problems worth considering were those you proposed yourself. ... He worked with essentially one student at a time, and that practically every afternoon during the week.\nAs to Ehrenfest's mathematical skills,\nUhlenbeck\nwrote\n[\n9\n]\n:-\nAlthough he knew mathematics it was not simple for him. He was not a computer. He could not compute.\nPais writes about Ehrenfest's lectures in the early\n1920\ns\n[\n10\n]\n:-\nEhrenfest's graduate lectures consisted of a two-year course:\nMaxwell\ntheory, ending with the theory of electrons and some relativity, one year; and statistical mechanics, ending with atomic structure and quantum theory the other.\nIn\n1925\nwhen quantum mechanics began to dominate work in theoretical physics, Ehrenfest felt he had problems\n[\n9\n]\n:-\nI think he always hated it. All these youngsters who had, with great facility, made these calculations ... and you didn't have to understand much. You just computed and you did this and you did that and everything came out ... There was, therefore, a mathematical apparatus built with\nHilbert\n's basis, with operators, which had a sort of abstractness. It was so against his creed that I'm sure he suffered from it. ... he understood it all alright. He said he was just too old. It was against his creed to really take part in it.\nNiels Bohr\nand Ehrenfest began to correspond in\n1918\n. When they met in Leiden\n[\n7\n]\n:-\n[\nEhrenfest\n]\nand\nBohr\nhad much to talk about together -- from the current problems of quantum theory to the Icelandic sagas, from the stages of a child's development to the difference between genuine physicists and the other. Their exchanges ranged over heaven and earth as Ehrenfest showed his new friend the treasures of the Dutch museums and the brilliant colours of the bulb fields.\nEhrenfest presented\nBohr\n's results to the third Solvay conference in\n1921\n.\nBohr\ndid not attend through overwork. Later in\n1921\nBohr\ninvited Ehrenfest to Copenhagen. He replied:-\nDear, dear Bohr, I would like so terribly much to be with you again.\nEhrenfest was unhappy at the disagreement between\nBohr\nand\nEinstein\nover quantum theory. He brought them together at his home in Leiden in December\n1925\nin an attempt to have them reach an agreed position. They did not and Ehrenfest was very unhappy that he was forced to take sides with one of his two close friends. He said in\n1927\n, while in tears, that forced to make a choice he would have to agree with\nBohr\n.\nMay\n1931\nEhrenfest wrote to\nBohr\n[\n3\n]\n:-\nI have completely lost contact with theoretical physics. I cannot read anything any more and feel myself incompetent to have even the most modest grasp about what makes sense in the flood of articles and books. Perhaps I cannot at all be helped any more.\nAll through his life Ehrenfest had suffered from low self esteem, which was in marked contrast to the high esteem in which he was held by his fellow scientists. He was also greatly saddened by his son Wassik having Down's syndrome and having severe problems both physically and mentally.\nHis last letter\n(\nwhich was never sent\n)\nis a sad document\n(\nsee for example\n[\n3\n]\n)\n:-\nMy dear friends:\nBohr\n,\nEinstein\n, Franck, Herglotz, Joffé, Kohnstamm, and Tolman!\nI absolutely do not know any more how to carry further during the next few months the burden of my life which has become unbearable. I cannot stand it any longer to let my professorship in Leiden go down the drain. I must vacate my position here. Perhaps it may happen that I can use up the rest of my strength in Russia. .. If, however, it will not become clear rather soon that I can do that, then it is as good as certain that I shall kill myself. And if that will happen some time then I should like to know that I have written, calmly and without rush, to you whose friendship has played such a great role in my life. ...\nIn recent years it has become ever more difficult for me to follow the developments in physics with understanding. After trying, ever more enervated and torn, I have finally given up in desperation. This made me completely weary of life .. I did feel condemned to live on mainly because of the economic cares for the children. I tried other things but that helps only briefly. Therefore I concentrate more and more on the precise details of suicide. I have no other practical possibility than suicide, and that after having first killed Wassik. Forgive me ...\nMay you and those dear to you stay well.\nThis letter, and a similar letter which he wrote to his students, was never sent. Ehrenfest shot Wassik in the waiting room of the Professor Watering Institute in Amsterdam where Wassik was being treated. Then he shot himself. The Dutch papers only reported his sudden death and gave lengthy accounts of his achievements.\nEinstein\nsaid of Ehrenfest\n[\n2\n]\n:-\nHe was not merely the best teacher in our profession whom I have ever known; he was also passionately preoccupied with the development and destiny of men, especially his students. To understand others, to gain their friendship and trust, to aid anyone embroiled in outer or inner struggles, to encourage youthful talent - all this was his real element, almost more than his emersion in scientific problems.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}