{
  "nome_completo": "Paul Joseph Kelly",
  "nome_curto": "Paul Kelly",
  "ano_nascimento": "1915",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kelly/",
  "lugar_nascimento": "Riverside, California, USA",
  "lugar_morte": "Santa Barbara, California, USA",
  "biografia": "Paul Kelly\nwas born in Riverside, California. At high school his interests were certainly not directed only towards mathematics for he also had a fascination with language, writing poems and humorous essays. He attended the University of California at Los Angeles receiving his B.A. and M.A. degrees from UCLA. He then transferred to the University of Wisconsin- Madison, where his doctoral work was supervised by Rudolph Langer. He obtained his Ph.D. in\n1942\nfor his thesis\nOn Isometric Transformations\n. However by this time the United States had entered World War II so Kelly's career had to be put on hold while he undertook war work.\nHe spent three years as a First Lieutenant in the U.S. Air Force and then, in\n1946\n, he was appointed to the mathematics department at the University of Southern California in Los Angeles as an Instructor. In autumn\n1949\nhe moved to the University of California, Santa Barbara, where he spent the rest of his career. His early days at Santa Barbara are remembered in an obituary written by colleagues:-\nThose of us who knew Paul J Kelly when he first came to Santa Barbara in the fall of\n1949\nremember an ebullient creator of spontaneous games with elaborate rules such as Obstacle Croquet, a game often played by G.I. math and physics majors who turned car headlights onto the bumpy stretch of grass that comprised the gaming field. Students of those and later days who found joy in mathematics, have remembered him with gratitude, laughter and often the recollection of a favourite one-liner, story, or joke even as they gave him credit for inspiring them to devote their lives to teaching, or doing math or for developing in them an appreciation of the field and its satisfying beauty.\nKelly became Chairman of the Mathematics department at Santa Barbara in\n1957\n. During the five years that he led the Department the number of academic staff more than doubled and the department set up the structure for its Ph.D. programme. Kelly retired in\n1982\n.\nLet us look briefly at some of the Kelly's mathematical papers, which were mainly on topics in geometry and graph theory, and at his books. In\n1945\nhe published\nOn isometries of square sets\nwhich proved a special case of a conjecture made by\nUlam\n.\nUlam\nconjectured that if two topological spaces\nR\n1\nR_{1}\nR\n1\n​\nand\nR\nR\nR\nhave the property that the Cartesian product\nR\n1\n×\nR\n1\nR_{1}\\times  R_{1}\nR\n1\n​\n×\nR\n1\n​\nis homeomorphic to the Cartesian product\nR\n×\nR\nR \\times  R\nR\n×\nR\n, then the space\nR\n1\nR_{1}\nR\n1\n​\nis homeomorphic to the space\nR\nR\nR\n. In this paper Kelly proved the conjecture for the case of certain isometries of a class of finite metric spaces. This paper was published in the\nBulletin of the American Mathematical Society\n, as was his papers\nOn isometries of product sets\nof\n1948\nand\nOn Minkowski bodies of constant width\nof\n1949\n. To understand the purpose of this last mentioned paper we need the concept of an entire subset of a metric space, namely one with the property that the addition of any point to the subset increases its diameter. In\n1934\nT Bonnesen and W Fenchel proved that in Euclidean\nn\nn\nn\n-space an entire subset is a convex body of constant width, and conversely. Kelly showed that this theorem went over to entire subsets of\nMinkowski\nn\nn\nn\n-space.\nExamples of papers by Kelly on graph theory are\nA congruence theorem for trees\npublished in the\nPacific Journal\nin\n1957\n,\nOn some mappings related to graphs\npublished in the same journal in\n1964\n, and\nThe minimal regular graph containing a given graph\nco-authored with\nPaul Erdős\nand published in\n1967\n.\nWe mention three texts written by Kelly, each with a different co-author. In\n1953\nhe wrote\nProjective geometry and projective metrics\njointly with Herbert Busemann.\nCoxeter\n, in a review, gives a good idea of the contents:-\nThe first two chapters contain a treatment of the real projective plane, using coordinates from the beginning and alternating between synthetic and analytic arguments. ... In Chapter III, the affine plane is derived by singling out\n(\nor omitting\n)\none line, thus obtaining affine coordinates. There is an excellent treatment of convex sets, convex curves, and supporting lines. ... Chapter IV is a highly original account of projective metrics, including perpendicularity and motions. ... A \"Minkowskian\" metric is introduced into the affine plane by taking a closed, strictly convex, centrally symmetrical curve K, and calling it a unit circle. ... Another important metric is that of\nHilbert\n, where the interior of a convex domain D is metrized by means of the logarithm of a cross ratio. ... In the final chapter most of the foregoing ideas are extended from two to three dimensions.\nKelly's\n1979\ntext\nGeometry and convexity\nwas written jointly with Max L Weiss. V P Soltan writes:-\n... the reader will find a basic treatment of convex body theory. The book is easy to read, notation is kept simple, and the proofs are clear and complete. No special prerequisite knowledge is assumed. The student is led by the hand from motivation to definition, concrete examples, and theorems. ... this book should contribute to the awakening interest in convex set theory as a text for undergraduate students.\nThe third text we mention is\nThe non-Euclidean, hyperbolic plane : Its structure and consistency\nwhich Kelly wrote jointly with Gordon Matthews and published in\n1981\n. The authors write that it is:-\n... especially directed to college students who may become secondary teachers.\nWe record details of his character and interests given in an obituary written by colleagues Gordon Baker, Andrew Bruckner, Ernest Michael, and Adil Yaqub\n[\n1\n]\n:-\n[\nPaul Kelly\n]\nwas a zestful, original conversationalist of wide-ranging interests. Both the sly and the broad social satire in Austen and Trollope gave him great pleasure. However, he complained that there were few humorists among today's writers who entertained him as Thurber, Benchley, and White had done. ... Paul Kelly had a wonderful sense of language, the comic, the human tragi-comic condition, and the crucial role of timing in any enterprise. ... Paul was also a sports enthusiast who wished he'd been big enough to play football. He contented himself with baseball, tennis and golf. When his health no longer permitted any of these, he took up darts and billiards again. Always he was a knowledgeable, opinionated, engaged spectator who joked that he timed major surgeries to coincide with the Olympics or other major sporting events. ... Any collection of memories about Paul would be incomplete without a mention of his love of particular music, musicians, and works of art. He had a special fondness for Mozart's Horn Concertos, Schubert's Trout Quintet, and almost all Delius and Satie. He wished he had learned to play the clarinet since he enjoyed jazz. Bernini's sculptures brought him enduring delight, and those of us who heard him will never forget his voice as he stood in front of Van Gogh's \"Poet's Garden\" saying in tones of mingled acceptance and astonishment, \"He must be a great painter; he's made me believe in a yellow sky.\"",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}