{
  "nome_completo": "Paul Epstein",
  "nome_curto": "Paul Epstein",
  "ano_nascimento": "1871",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Epstein/",
  "lugar_nascimento": "Frankfurt, Germany",
  "lugar_morte": "Frankfurt, Germany",
  "biografia": "Paul Epstein\n's parents were Theobald Epstein\n(22\nAugust\n1836\n-\n23\nAugust\n1928)\nand Mathilde Perels\n(11\nJune\n1844\n-\n29\nApril\n1875)\n. It was a Jewish family living in Frankfurt where his father was a professor at the Philanthropin Secondary School, the largest and longest-existing Jewish school in Germany, and an astronomer and Head of the Frankfurt Observatory. Theobald Epstein was a excellent scientist who had been taught astronomy by\nKarl Schwarzschild\n. Paul had an older sister Cäcilie Epstein\n(7\nNovember\n1869\n-\n12\nMay\n1939)\n. His mother died in chidbirth in\n1875\nand his father married again in\n1880\n. Paul had a step-sister Mathilde \"Tilli\" Epstein\n(11\nJune\n1844\n-\n29\nApril\n1875)\n.  Paul studied at the Philanthropin Secondary School, graduating with his\nAbitur\nin\n1890\n. He then went to study at the University of Strasbourg which at that time was known as Strassburg and was part of Germany. We should give a little background on the position of Strasbourg as a sometimes French, sometimes German university.\nThe Franco-German war of\n1870\n-\n71\nhad been a humiliation for the French. Germany had captured Strasbourg after a\n50\n-day siege during the\n1870\n-\n71\nwar and annexed the city. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strassburg in\n1872\n. Two mathematics chairs were founded at this time, the first was filled by\nElwin Christoffel\nand the second was filled by\nTheodor Reye\n. Both\nChristoffel\nand\nReye\nconsidered it their patriotic duty to assist in making the University of Strasbourg a German university. Epstein was taught at Strasbourg by\nChristoffel\nwho became his thesis advisor.\nAfter submitting his thesis\nZur Lehre von den hyperelliptischen Integralen\nⓉ\n(\nOn the theory of hyperelliptic integrals\n)\non\nabelian functions\n, Epstein received his doctorate in\n1895\nfrom the University of Strasbourg. He submitted a paper based on the work of his thesis and with the same title, to\nActa Mathematica\nin September\n1894\n. The\n58\n-page paper appeared in print in\n1897\n. In it Epstein acknowledges the help he received from his advisor\nChristoffel\n:-\nFinally it should be mentioned that writer owes the inspiration for this work, namely the knowledge of the functions φ and with their use in forming integrals to a lecture by Mr\nChristoffel\non elliptic integrals\n(\nWinter\n1890\n/\n91)\n. However Mr\nChristoffel\nonly sought to study the behaviour of the integrals at infinity, and gave the important equation\n(7)\nin  §\n2\nwithout proof.\nEpstein also explains in this paper that, as well as being inspired by Christoffel's lectures, his work was based on ideas by\nKarl Weierstrass\nand others.\nFrom\n1895\nto\n1918\nhe remained in Strasbourg, teaching at the Technical School and also at the University where he had been appointed a Privatdozent. During World War I he did military service in the German army. At the end of the war in\n1918\n, however, the city of Strasbourg reverted to France, and Epstein, being German, was forced to leave Alsace. Although he had done good work in Strasbourg, he had remained a\nPrivatdocent\n. Examples of his research undertaken at Strasbourg are\nZur Theorie allgemeiner Zetafunctionen\nⓉ\n(\nOn the theory of general zeta functions\n)\n(\nPart I,\n1903\n; Part II,\n1906)\nand\nÜber Möbiuskettenbrüche und Elementarkettenbrüche\nⓉ\n(\nOn Mobius continued fractions and elementary continued fractions\n)\n(1918)\n. In the first part of\nZur Theorie allgemeiner Zetafunctionen\nⓉ\n(\nOn the theory of general zeta functions\n)\n(1903)\nEpstein introduced a function belonging to a class of\nDirichlet\nseries generalising the\nRiemann\nZeta-function\ndepending on a given quadratic form. He proved a functional equation, the analytic continuation and the\nKronecker\nlimit formula for these functions. Today these function are known as the Epstein Zeta-functions. They play an important role in crystallography and there are several applications in mathematical physics, particularly in quantum field theory. As Sanford Segal remarks in\n[\n2\n]\n, given this outstanding work it is hard to see why he was never promoted unless one accepts that it was due to anti-Semitism:-\nAnother example of late promotion was Paul Epstein, who was still a Privatdocent at Strassburg when the French dismissed him in the aftermath of World War I.\nForced to leave Strasbourg and having no position to go to, Epstein returned to his native city of Frankfurt. He was appointed to a non-tenured post at the university and he lectured in Frankfurt from\n1919\n. Later he was appointed as an extraordinary professorship at Frankfurt. In\n1923\n-\n24\nhe was given a salaried teaching assignment for didactics and the history of mathematics and he made a major contribution to\nMax Dehn\n's History of Mathematics seminar which ran at Frankfurt from around this time until the early\n1930\ns. He published\nGoethe and mathematics\nin the\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nin\n1924\n. In\n[\n2\n]\n, Birgit Bergmann explains that this was one of several essays in which Epstein:-\n... attempted to equate Goethe's classical poetry with the clarity and precision of mathematical language. He was convinced that Goethe's rejection of mathematics was due to his failure to recognise its true beauty. Epstein sought to eliminate the most obvious and the best known contradiction between Goethe and mathematics by showing that ultimately both approaches to understanding the world had their source in the same motivation and led to the same goal. With these texts, Epstein joined the ranks of German-Jewish intellectuals who attached great importance to the classical German educational ideal known as \"Bildung\".\nHere is a quotation from Epstein's\nGoethe and mathematics\n(1924)\n:-\nThus, the language of the mathematician is free from all of the imperfections and shortcomings of colloquial language, which Goethe himself vividly felt, deploring that language as we know it, which had developed from obvious human needs, human activities and general human sentiments and views, is not adequate to correctly express perceptions of the functioning and workings of nature as something which is indeed far removed from common human affairs. the mathematical sign language, however, - correctly understood and used in the fields to which it is suited - is the \"Language of the Spirits\" which Goethe sought; according to a famous dictum of\nGalileo\n, it is the language in which the Book of Nature is written.\nWe know that in the summer of\n1928\nEpstein lectured on\nÉtienne Pascal\nin the History of Mathematics seminar and hand-written lecture notes from this course survive.\nOn\n30\nJanuary\n1933\n, however, Hitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which exempted non-Aryans who had fought for Germany in World War I. Epstein certainly qualified under this clause and this allowed him to keep his lecturing post in Frankfurt in\n1933\n.\nDecisions at the Nuremberg party congress in the autumn of\n1935\nmade it clear that non-Aryans would no longer be able to keep their posts even if they had served in World War I.\nCarl Siegel\nwrites in\n[\n2\n]\n:-\nEpstein voluntarily relinquished his teaching position before the Nuremberg laws went into effect. As he explained to me, he had wanted to save the German authorities the trouble of doing to him what the French had done back in\n1918\n.\nEpstein did not attempt to emigrate. He was\n64\nyears old and had he emigrated he would have lost all his money except\n10\nMarks. There was no prospect of a\n64\nyear old obtaining a post. On the Kristallnacht\n(\nso called because of the broken glass in the streets on the following morning\n)\n, the\n9\n-\n10\nNovember\n1938\n,\n91\nJews were murdered, hundreds were seriously injured, and thousands were subjected to horrifying experiences. Thousands of Jewish businesses were burnt down together with over\n150\nsynagogues. The Gestapo arrested\n30\n,\n000\nwell-off Jews and a condition of their release was that they emigrate. The Gestapo broke into Epstein's house but found that he was seriously ill and could not be moved. At this point Epstein must have known that his only chance was to leave Germany.\nSiegel\nsuggests that it would have been possible for\n[\n2\n]\n:-\n... one of his sisters had emigrated earlier and could have supported him. But despite the possibility of escape, he hesitated leaving his books and his native city.\nHowever,\nSiegel\nseems to be incorrect in believing that Epstein's sister had already emigrated. Tilly Epstein was a teacher at the Philanthropin Secondary School in Frankfurt from\n1901\n. In November\n1938\n, following Kristallnacht, all the male teachers at the school were sent to the Buchenwald concentration camp and she was left with the task of closing the school. She emigrated to England, but this was not until\n1941\nafter Paul Epstein had committed suicide. Let us return to the story of Epstein's last days.\nEpstein moved to Dornbusch, a northern suburb of Frankfurt, and was visited there by\nCarl Siegel\n[\n2\n]\n:-\nI visited Epstein in August\n1939\nand we sat in the sunny garden of the house he was living in then in Dornbusch. He told me that he had a favourite cat put to sleep simply because it liked to chase birds and might have irritated the neighbours, but he didn't seem otherwise distressed. I still remember how he pointed to the trees and flowers in the garden and said, \"Isn't it lovely here?\"\nAbout a week after\nSiegel\n's visit, Epstein received a summons from the Gestapo. He knew what had happened to others who had received such a summons, many had been tortured and killed. He wanted to avoid the suffering so he took a lethal dose of Veronal. The Gestapo later claimed that they had only summoned him to get him to sign a document to fix a date on which he would emigrate\n[\n2\n]\n:-\nEveryone knew that a summons from the Gestapo often meant torture and death, and with that in mind Epstein decided to initiate the irreversible process with his own hand: After his death it was alleged that the Gestapo merely wanted him to sign a statement fixing the date of his impending emigration. I don't know if he actually was threatened with anything worse than this, but he certainly had had the feeling that he had reached the end of the road, and drew his conclusion from that. Emigration would probably have been impossible in any case with the outbreak of war only a few weeks away, and Hitler's so-called final solution to the Jewish problem following shortly thereafter. I really think that Epstein acted as wisely as he could.\nEpstein's most important work was in\nnumber theory\n, in particular the zeta function which we mentioned above. Also, as we have seen above, he worked on the history of mathematics and mathematics in culture. Perhaps we should mention one other of Epstein's talents which was music, and he took part energetically in the cultural life of Frankfurt.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Number Theory"
  ]
}