{
  "nome_completo": "Paul Finsler",
  "nome_curto": "Paul Finsler",
  "ano_nascimento": "1894",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Finsler/",
  "lugar_nascimento": "Heilbronn, Neckar, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Paul Finsler\n's father was a Swiss merchant from an old Zürich family. His mother's father was a photographer. One of his ancestors was Johann Caspar Lavater\n(1741\n-\n1801)\n, the Swiss writer, philosopher and theologian. Paul had a brother Hans Finsler who was born in Heilbronn on\n7\nDecember\n1891\n. Hans became a famous photographer and died on\n3\nApril\n1972\nin Zürich. Paul also had a sister Anne Finsler who became a mathematician and wrote\nVolumen und Oberfläche von Kreuzkern und Kugel\nⓉ\n(\nVolume and surface of the cross-core and ball\n)\n(1954)\n.\nPaul attended a grammar school in Urach, then, between\n1908\nand\n1912\n, he attended a secondary school, the Real\nGymnasium\nin Cannstatt, which emphasised science in its teaching. After leaving school he entered the Technische Hochschule in Stuttgart where\nWilhelm Kutta\nwas among his teachers.\nKutta\nhad been appointed as an ordinary professor of analysis and analytical geometry at the Technische Hochschule in Stuttgart in\n1911\n, the year before Finsler began his studies there. Finsler also attended lectures at Stuttgart by Rudolf Mehmke\n(1857\n-\n1944)\n. Mehmke, who had been a student at the Technische Hochschule in Stuttgart before attending the universities of Berlin and Tübingen, had been appointed as Professor of Geometry at the Technische Hochschule in Stuttgart in\n1894\n. Mehmke was an expert in the vector calculus, in particular he applied\nHermann Grassmann\n's methods to the geometry of circles.\nLeaving Stuttgart in\n1913\n, Finsler entered Göttingen University to undertake graduate studies. Among his teachers at Göttingen were a host of top mathematicians including\nErich Hecke\n,\nDavid Hilbert\n,\nFelix Klein\n,\nEdmund Landau\n,\nCarl Runge\n,\nLudwig Prandtl\n,\nMax Born\nand\nConstantin Carathéodory\n. Finsler' doctoral dissertation was supervised by\nCarathéodory\non curves and surfaces in general spaces. This thesis, entitled\nÜber Kurven und Flächen in allgemeinen Räumen\nⓉ\n(\nOn curves and surfaces in general spaces\n)\n(1918)\n, secured Finsler a name for himself as a differential geometer. The importance of this work can clearly be seen from the fact that the thesis was printed in unchanged form in\n1951\nwith a detailed bibliography by H Schubert.\nAlexander Ostrowski\nwrote the Preface to the reprinted thesis\n[\n17\n]\n:-\nIn the year\n1918\nPaul Finsler produced his inaugural dissertation, 'Über Kurven und Flächen in allgemeinen Räumen', which as a result has had a very lasting influence, something which happens to first works only in rare cases. A large number of treatises and also some books have since been written about \"Finslerian geometry\" inaugurated in Finsler's dissertation, and it has already become clear that this ground-breaking work is worthy in adding to the Swiss geometric tradition that\nSteiner\nand\nSchläfli\nbegan. Since Finsler's dissertation has never been published by the book trade, it has been enjoyed by only a few mathematicians who were Finsler's friends. It is therefore the decision of the publisher Birkhäuser to reproduce this work in facsimile and augment it with bibliographical notes ...\nHerbert Busemann reviewed this reprint\n[\n6\n]\n:-\nBut the book will be more than a classic in a geometer's library. The reviewer concludes from his own sad experience that there must be many instances where apparently new results were found to be already in Finsler's thesis after the latter finally became available through interlibrary loan. Moreover, there are many ideas which may facilitate later work. ... In addition to the thesis the present edition contains a comprehensive list of books and papers concerning Finsler spaces\n(\nuntil\n1949)\ncompiled by H Schubert. It has a wide scope and comprises references to tensor calculus, ordinary and Riemannian geometry, the geometry of paths, the calculus of variations, spaces of infinite dimension, which are ordinarily not considered as contributions to Finsler spaces.\n\"Finsler spaces\" and \"Finsler manifolds\" became standard terminology after the publication of\nElie Cartan\n's book\nLes espaces de Finsler\nⓉ\n(\nFinsler spaces\n)\nin\n1934\n. A Finsler space is a generalisation of a Riemannian space where the length function is defined differently and\nMinkowski\n's geometry holds locally.\nDespite the importance of this work,\ndifferential geometry\nwas not Finsler's research topic for long since he moved to take up set theory. Finsler's\nhabilitation\nthesis was submitted to the University of Cologne in\n1922\nand the following year he gave his inaugural lecture\nGibt es Widersprüche in der Mathematik?\nⓉ\n(\nAre there contradictions in mathematics?\n)\n. This attempted to remove paradoxes, as stated in\n[\n1\n]\n:-\nConcerning ...\nRussell\n's paradox, Finsler points out that one needs to distinguish between satisfiable and unsatisfiable circular definitions.\nRussell\n's definition of the set of all sets which do not contain themselves is a non-satisfiable circular definition.\nNow Finsler had another passion in addition to mathematics, namely astronomy. He was an amateur observer and he made regular observations. On\n15\nSeptember\n1924\nFinsler was in Bonn when, with a pair of binoculars, he discovered a comet which is now named Comet C /\n1924\nR\n1\n(\nFinsler\n)\n. On the following day he reported his discovery to the International Astronomical Union headquarters in Copenhagen. The comet only made a short appearance and, at its brightest, was only faintly visible to the naked eye. After Finsler's report it was observed at several observatories on\n19\nSeptember. For his discovery, Finsler received the Donohoe Comet Medal from the Astronomical Society of the Pacific.\nIn\n1927\nFinsler was appointed to the University of Zürich, where the professor was\nAndreas Speiser\n.\nSpeiser\n, who had been appointed as an Ordinary Professor at Zürich in\n1917\n, undertook research in number theory, group theory, and the theory of Riemann surfaces but was also interested in philosophy, particularly in Plato's philosophy. At Zürich, in addition to his work on set theory Finsler also worked on differential geometry, number theory, probability theory and the foundations of mathematics. He taught regular classes, four hours a week, on descriptive geometry. He became an Ordinary Professor at the University of Zürich in\n1944\nafter\nAndreas Speiser\nmoved to the University of Basel. Soon after this Finsler began to teach the course on the introduction to the calculus.\nFinsler's set theory was in the spirit of\nGeorg Cantor\n. Both were Platonists and as described in\n[\n1\n]\n:-\nHe believed in the reality of pure concepts. Together they form the purely conceptual realm which encompasses all mathematical objects, structure and patterns. ... Mathematicians do not invent or construct their structures and propositions, they recognise or discover, how these objects in the conceptual realm are interrelated with each other.\nIn\n1926\nFinsler published the paper\nFormale Beweise und Entscheidbarkeit\nⓉ\n(\nFormal Proof and Decidability\n)\nand also the first part of a major work on set theory\nÜber die Grundlegung der Mengenlehre. Erster Teil: Die Mengen und ihre Axiome\nⓉ\n(\nOn the Foundation of set theory. First part: The sets and their axioms\n)\n. He intended to publish the second part as a continuation of his theories but his plan changed when the first part came under attack. In the end he wrote part two as a defence of part one in\n1965\nrather than what he originally intended. We quote from\n[\n1\n]\n:-\n... Finsler develops his approach to the paradoxes, his attitude towards formalised theories and his defence of Platonism in mathematics. He insisted on the existence of a conceptual realm within mathematics which transcends formal systems. From the foundational point of view, Finsler's et theory contains a strengthened criterion for set identity and a coinductive specification of the universe of sets. ... Combinatorially, Finsler considers sets as generalised numbers to which one may apply arithmetical techniques.\nOf course, as mentioned above, the set paradoxes were of particular significance to Finsler. Again quoting from\n[\n1\n]\n:-\n[\nFinsler\n]\nmaintained that consistency is sufficient for the existence of mathematical objects. Furthermore, he thought that the antinomies which led to the foundational crisis, could be solved without the notion that existence is equivalent to formal constructability.\nIn\n1931\nKurt Gödel\npublished\nÜber formal unentscheidbare Sätze der Principia Mathematica und verwandter Systeme\nⓉ\n(\nOn formally undecidable theorems of Principia Mathematica and related systems\n)\nin which he proved fundamental results about axiomatic systems, showing that in any axiomatic mathematical system there are propositions that cannot be proved or disproved within the axioms of the system. In particular the consistency of the axioms cannot be proved. Finsler wrote to him on\n11\nMarch\n1933\n, asked for a copy of his\n1931\npaper but claimed priority based on his\n1926\npaper\n[\n3\n]\n:-\nIn contrast to\nGödel\n, Finsler made no attempt\n(\nand saw no need\n)\nto give a precise specification of the syntax of his \"formal\" language; and since metamathematical considerations are meaningless in the absence of restrictions on linguistic resources,\nGödel\n's results appeared to him as mere specialisations of those he had already obtained. He could not understand, therefore, why\nGödel\n's paper had attracted widespread notice while his had not.\nNow\nGödel\nhad not been aware of Finsler's work when he wrote his\n1931\npaper but, after receiving Finsler's letter, he read the\n1926\npaper and immediately saw that it had major problems. However, he didn't want to offend Finsler so, in his reply, he merely pointed out the difference in their approach but said the Finsler's system was \"not really defined at all\". Finsler did not react well to criticisms that came from\nGödel\nand other logicians. He never accepted the errors that were pointed out to him and either showed an inability to understand their arguments or simply a refusal to accept them. He claimed that a system didn't have to be sharply defined, rather it was enough to \"be able to accept it as given and to recognise a few of its properties\".\nIn\n1937\nL Locher wrote the paper\n[\n16\n]\nwhich had the purpose of making Finsler's work on the foundations of mathematics better known.\nAlonso Church\nreviewed Locher's paper in\n[\n8\n]\nwhere he writes:-\n[\nFinsler's\n]\npaper contains a noteworthy anticipation of the since famous incompleteness theorem of\nGödel\n. The proof given is not entirely satisfactory - there is a tacit assumption of the presence of a formal symbol for the meaning-relation between a formula and that which it denotes - but it is capable of correction, in the light of later developments, by explicitly introducing\nGödel\nnumbers and utilizing such partial meaning-relations as can be shown to exist within symbolic systems of the usual kind.\nFinsler continued to develop his ideas despite the criticisms. He published\nGibt es unentscheidbare Sätze?\nⓉ\n(\nAre there undecidable sentences?\n)\n(1944)\nwhich again came in from strong criticism by\nAlonso Church\nin\n[\n10\n]\n. We quote here a brief, non-technical, part of\nChurch\n's review:-\nA solution of the antinomies\n(\nthat of the liar and others\n)\n, for the purposes of formal logic, and especially of mathematics, must do more than offer an explanation why certain arguments are unsound, including those which lead to the antinomies. Namely it must effectively certify other arguments, in adequate variety, as sound, free in particular of the unsoundnesses to which the antinomies are ascribed. For a supposed proof is actually no proof at all if subject to refutation at any later time by the discovery of antinomy\n(\nas happened in the case of\nCantor\n's apparently valid proof that the set of all ordinal numbers is well-ordered in order of magnitude\n)\n. - It seems to the reviewer that Finsler's solution of the antinomy of the liar is not of the required kind: it does not provide a test for proposed proofs, but rather explains away the antinomy after the fact.\nIn\n[\n11\n]\na letter which\nGödel\nwrote, but never sent, is quoted giving his opinions of Finsler's work on formal decidability:-\nAs for work done earlier about the question of formal decidability of mathematical propositions, I know only a paper by Finsler ... . However, Finsler omits exactly the main point which makes a proof possible, namely restriction to some well-defined formal system in which the proposition is undecidable. For he had the nonsensical aim of proving formal undecidability in an absolute sense. This leads to\n[\nhis\n]\nnonsensical definition\n[\nof a system of signs and of formal proofs therein\n]\n... and to the flagrant inconsistency that he decides the \"formally undecidable\" proposition by an argument ... which, according to his own definition. ... is a formal proof. If Finsler had confined himself to some well-defined formal system S, his proof ... could\n[\nwith the hindsight of\nGödel\n's own methods\n]\nbe made correct and applicable to any formal system. I myself did not know his paper when I wrote mine, and other mathematicians or logicians probably disregarded it because it contains the obvious nonsense just mentioned.\nFor a list of all Finsler's mathematical publications, see\nTHIS LINK\n.\nThe reader will see from the list of Finsler's publications that he undertook research on topics other than differential geometry and the foundations of mathematics. For example, he published\nFormes quadratiques et variétés algébriques\nⓉ\n(\nQuadratic forms and algebraic varieties\n)\n(1928)\nand\nÜber die Primzahlen zwischen n und\n2\nn\nⓉ\n(\nOn prime numbers between n and\n2\nn\n)\n(1945)\n.\nOn\n4\nJuly\n1937\n, while in Zürich, Finsler discovered another comet, now named Comet\n1937\nf\n(\nFinsler\n)\n, and immediately informed Copenhagen. It was not visible to the naked eye when discovered but became a bright comet later that year. H M Jeffers\n[\n15\n]\nwrites:-\nThe discoverer of this comet was Professor P Finsler, of the Mathematics Department of the University of Zürich, in Switzerland. On the night of July\n3\n-\n4\nhe was examining the sky with a pair of large field glasses, and found the faint nebulous spot in the constellation Perseus. Further watching with a larger instrument showed that the object moved, and on July\n4\nthe announcement of the finding of the new comet was sent out. This is Professor Finsler's second comet discovery; the first was in\n1924\n.\nOn\n31\nJuly\n1937\nFinsler's discovery of the comet made the front page of the\nChicago Daily Tribune\nunder the headline \"Heads Up! You May See New Comet Tonight\". His comet discoveries certainly gained Finsler far wider recognition than his mathematical discoveries. There was another publication by Finsler which caused something of a sensation, namely his article\nVom Leben nach dem Tode\nⓉ\n(\nOn Life after Death\n)\nwhich he published in\n1958\n. Many who read this article probably misunderstood what Finsler was trying to say. In it he examined questions about eternal life, birth and death, the individual soul and the universal soul. He was worried about the course of world history and the lack of awareness about the fact that we control our own destiny. He argued that since we can't escape from the world, we must make it a place we want to live in.\nHerbert Gross was a student of Finsler's and wrote the obituary\n[\n14\n]\n. He writes there:-\nFinsler possessed to the same degree an immense logical sharpness, mathematical ability and a fine sense of humour. It was an experience as a mathematics student to hear his lectures. His style was reminiscent of the deep and witty remarks of\nGottlob Frege\n. The most valuable thing Finsler has given to many of his students, is a great confidence in the ability of human reason and a distrust of any mathematical formalism, which pretends to be more than a shorthand notation, compared to that which can be expressed in mathematical thoughts and ideas.\nIn\n1959\nFinsler retired from his professorship in Zürich and was made an honorary professor. He continued to live in Zürich and he died in that city when he was on his way to the 'Dies Academicus'. The University of Zürich was officially founded on\n29\nApril\n1833\n, and the first 'Dies academicus' was celebrated four years later. That day has been celebrated every year ever since with the President of the University delivering an address, welcoming guests of honour, and awarding honorary doctorates to distinguished researchers and teachers.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}