{
  "nome_completo": "Paul Tannery",
  "nome_curto": "Paul Tannery",
  "ano_nascimento": "1843",
  "ano_morte": "1904",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tannery_Paul/",
  "lugar_nascimento": "Mantes-la-Jolie, Yvelines, France",
  "lugar_morte": "Pantin, Seine-St Denis, France",
  "biografia": "Paul Tannery\nwas a brother of\nJules Tannery\nwhose biography is also given in this archive. Since Paul Tannery is famous as an historian of mathematics it is particularly fitting that we should give details of his life and work in this archive dedicated to the history of mathematics.\nPaul Tannery's parents were Delphin Tannery, who was an engineer working for the French railways, and Opportune Perrier. Delphin and Opportune Tannery had three children, the eldest being a daughter while the second oldest was Paul and\nJules Tannery\nwas the youngest. Delphin Tannery's job with the railways involved him moving around the country depending on where railways were being constructed. The family moved from Mantes to Redon in Ille-et-Vilaine in the Brittany region of northwestern France. He later worked at Mondeville close to Caen.\nPaul was brought up in a deeply Christian family. His parents Delphin and Opportune Tannery, who were Roman Catholics, gave him his early education, then he attended schools in several towns as his parents moved because of his father's job. First he attended school a private school in Mantes, then the Lycée in Le Mans finally completing his secondary education at the Lycée at Caen. Although he was enrolled for a science course at Caen, his interests included classics and philosophy.\nHis parents who were very keen to see their sons achieve great things with their education so they were delighted when, after completing his secondary education in\n1860\n, Tannery sat the entrance examinations in science for the École Polytechnique. Having attained one of the highest possible grades in both examination he entered the school, taking a wide range of courses in science, mathematics, technology and classical subjects such as Hebrew. He graduated from the École Polytechnique in\n1863\nand entered the École d'Application des Tabacs. He would spend the rest of his working life involved with the tobacco industry.\nIt was in this period after he graduated the Tannery became interested in the positivist philosophy of Comte. Auguste Comte, the French philosopher known as the founder of sociology and of positivism, published his philosophy in a work entitled\nCours de philosophie positive\nⓉ\n(\nA course of positive philosophy\n)\nin six volumes between\n1830\nand\n1842\n. It presented a philosophy designed to produce a system of government making full use of technology in a way appropriate to modern industrial society. Tannery was much influenced by Comte's philosophy and it would influence his work throughout his life.\nTannery worked from\n1865\nto\n1867\nin the state tobacco factory at Lille before moving to Paris to an administrative post in the administration of the state tobacco industry. The Franco-Prussian War began on\n19\nJuly\n1870\n. Tannery, a staunch French patriot, served in the French army as an artillery captain. The war went badly for France and on\n19\nSeptember\n1870\nthe Germans began a siege of Paris. Tannery was present during the siege, and was dismayed when Paris surrendered on\n28\nJanuary\n1871\n. The Treaty of Frankfurt, signed on\n10\nMay\n1871\nwas an humiliation for France, with Germany annexing Alsace and half of Lorraine. Tannery refused to acknowledge the terms of this treaty.\nThe war having ended, Tannery returned to his administrative post but he became very interested in mathematics being particularly influenced by his brother\nJules Tannery\nwho by this time was teaching mathematics. Sent to Périgord to help with the construction of buildings, Tannery became ill. This in many ways worked in his favour since he used the time during which he was recovering to study more deeply, in particular learning ancient languages.\nSent to Bordeaux in\n1874\n, again to help with construction work, Tannery found there friends and university facilities which allowed him to spend all his free time working on the history of mathematics in ancient cultures. He had all the necessary skills to make a major contribution to this field and indeed his first publication, occurred around this time. Taton writes in\n[\n1\n]\nthat he became:-\n... a fairly regular contributor to about fifteen French and foreign periodicals. He published hundreds of memoirs, articles, notes, and reviews while pursuing a brilliant career in the state tobacco administration. Although many other historians of science have been obliged to conduct their research concurrently with their professional activities, none of them seems to have produced a body of work comparable to Tannery's in scope and importance.\nIn\n1877\nTannery made the rather strange move of requesting a move to Le Havre. This was a strange move since he was immediately deprived of the academic environment of Bordeaux. However, several trips abroad saw his became friends with other notable historians of science such as Heiberg,\nZeuthen\nand\nMoritz Cantor\n. He carried on a correspondence with the mathematicians he had met after his return. For example the paper\n[\n5\n]\ndescribes three letters he exchanged with\nZeuthen\ndealing with questions in the Greek theory of conic sections and the significance of certain constructions by means of \"neusis.\"\nTannery married Marie-Alexandrine Prisset in\n1881\n. She was\n13\nyears younger than he was and, had relatively little education but, after Tannery's death, she would undertake the difficult task of preparing a complete publication of his works with remarkable skill.\nBy\n1883\nTannery was finding the academic isolation of Le Havre too much to bear and he applied for a transfer to Paris. This was granted and, although he did not remain there for very long, it proved a period in which his work on the history of Greek geometry flourished. From\n1886\nuntil\n1888\nTannery was in Tonneins and, deprived of library and other resources, he was unable to carry out any serious work on the history of mathematics except editorial work. In January\n1888\nhe returned to Bordeaux as director of the tobacco factory and was able to slot into the intellectual life he had lived there earlier.\nFrom\n1890\nuntil\n1893\nhe was back at the headquarters of the administration of the state tobacco industry in Paris, and then in\n1893\nhe made his final move to be director of a tobacco factory at Pantin near Paris. A rather strange, and sad, episode occurred near the end of his life. The chair of history of science at the Collège de France became vacant in\n1903\n. Tannery was named as the first choice to fill the post by the two consultative bodies. So certain was Tannery that his appointment after that was merely a formality, that he started work on writing his inaugural lecture.. The minister of education chose not to follow the recommendations of the consultative bodies, however, and appointed a philosopher with little experience in the history of science. It seems that the government did not want a Roman Catholic for the post and also preferred the course proposed by the other candidate on contemporary science rather than Tannery's proposed course on the history of science. It did not escape the notice of Tannery, his friends, and his international colleagues that a course on the history of science seemed appropriate for a professor of the history of science. All their protests were in vain and, as Taton writes in\n[\n1\n]\n:-\n... there is no doubt that the \"scandal of\n1903\n\" did great damage to the development of the history of science in France.\nHe died of cancer of the pancreas at the age of sixty while still at the height of his intellectual powers.\nHis main contributions were to the history of Greek mathematics and to the philosophy of mathematics. He published a history of Greek science in\n1887\n, a history of Greek geometry in the same year, and a history of ancient astronomy in\n1893\n.\nTannery did work of great importance as an editor of famous mathematics texts. He edited the work of\nFermat\nin three volumes\n(\njointly with C Henry\n)\nbetween\n1891\nand\n1896\n. In addition he edited the work of Diophantus in two volumes\n(1893\n-\n95)\n. He was an editor of the twelve volume complete works of\nDescartes\nOeuvres de Descartes\n(1897\n-\n1913)\n.\nTannery became so skilled in using Greek numerals in his historical work that he believed that they had certain advantages over our present system.\nTaton, himself a famous historian of mathematics, sums up Tannery's work in\n[\n1\n]\n:-\nPerhaps its most notable characteristic is an unwavering concern for rigour and precision. the detailed studies that constituted the bulk of his output were, in Tannery's view, only a necessary stage in the elaboration on much broader syntheses that would ultimately lead to a comprehensive history of science that he himself could openly initiate.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}