{
  "nome_completo": "Pavel Samuilovich Urysohn",
  "nome_curto": "Pavel Urysohn",
  "ano_nascimento": "1898",
  "ano_morte": "1924",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Urysohn/",
  "lugar_nascimento": "Odessa, Ukraine",
  "lugar_morte": "Batz-sur-Mer, France",
  "biografia": "Pavel Urysohn\nis also known as\nPavel Uryson.\nHis father was a financier in Odessa, the town in which Pavel Samuilovich was born. He came from a family descended from the sixteenth century Rabbi M Jaffe. It was a well-off family and Urysohn received his secondary education in Moscow at a private school there.\nIn\n1915\nUrysohn entered the University of Moscow to study physics and in fact he published his first paper in this year. Being interested in physics at this time it is not surprising that this first paper was on a physics topic, and indeed it was, being on Coolidge tube radiation. However his interest in physics soon took second place for after attending lectures by\nLuzin\nand\nEgorov\nat the University of Moscow he began to concentrate on mathematics.\nUrysohn graduated in\n1919\nand continued his studies there working towards his doctorate. The authors of\n[\n8\n]\nwrite:-\nLuzin\nwas a dynamic mathematician and it was he who persuaded Urysohn to stay on in order to study for a doctorate during\n1919\n-\n21\n.\nAt this stage Urysohn was interested in analysis, in particular\nintegral equations\n, and this was the topic of his\nhabilitation\n. He was awarded his habilitation in June\n1921\nand, following this, became an assistant professor at the University of Moscow.\nUrysohn soon turned to\ntopology\n. He was asked two questions by\nEgorov\nand it was these which occupied him during the summer of\n1921\n. The first question that\nEgorov\nposed was to find a general intrinsic topological definition of a curve which when restricted to the plane became\nCantor\n's notion of a continuum which is nowhere dense in the plane. The second of\nEgorov\n's questions was a similar one but applied to surfaces, again asking for an intrinsic topological definition.\nThese were difficult questions which had been around for some time. It was not that\nEgorov\nhad come up with new questions, rather he was giving the bright young mathematician Urysohn two really difficult problems in the hope that he might come up with new ideas.\nEgorov\nwas not to be disappointed, for Urysohn attacked the questions with great determination. He did not sit still waiting for inspiration to strike, rather he tried one idea after another to see if it would give him the topological definition of dimension that he was looking for.\nA holiday with other young Moscow mathematicians to the village of Burkov, on the banks of the river Kalyazmy near to the town of Bolshev, did not stop him trying to find the \"right\" definition of dimension. Quite the opposite, it was a good chance for him to think in congenial surroundings, and one morning near the end of August he woke up with an idea in his mind which he felt, even before working through the details, was right. Immediately he told his friend\nAleksandrov\nabout his inspiration.\nOf course there was a lot of hard work after the moment of inspiration. During the following year Urysohn worked through the consequences building a whole new area of dimension theory in topology. It was an exciting time for the topologists in Moscow for Urysohn lectured on the topology of continua and often his latest results were presented in the course shortly after he had proved them. He published a series of short notes on this topic during\n1922\n. The complete theory was presented in an article which\nLebesgue\naccepted for publication in the\nComptes rendus\nof the\nAcademy of Sciences\nin Paris. This gave Urysohn an international platform for his ideas which immediately attracted the interest of mathematicians such as\nHilbert\n.\nUrysohn published a full version of his dimension theory in\nFundamenta mathematicae\n. He wrote a major paper in two parts in\n1923\nbut they did not appear in print until\n1925\nand\n1926\n. Sadly Urysohn had died before even the first part was published. The paper begins with Urysohn stating his aim which was:-\nTo indicate the most general sets that still merit being called \"lines\" and \"surfaces\" ...\nIn fact Urysohn set out to do far more in this paper than to answer the two questions that\nEgorov\nhad posed to him. As Crilly and Johnson write\n[\n8\n]\n:-\nNot only did he seek definitions of curve and surface, but also definitions of\nn\nn\nn\n-dimensional Cantorian manifold and hence of dimension itself. The dimension concept was, in fact, the centre of his attention.\nAlthough Urysohn did not know of\nBrouwer\n's contribution when he worked out the details of his theory of topological dimension,\nBrouwer\nhad in fact published on that topic in\n1913\n. He had given a global definition, however, and this was in contrast to Urysohn's local definition of dimension. Another important aspect of Urysohn's ideas was the fact that he presented them in the context of compact metric spaces. After Urysohn's death,\nAleksandrov\nargued that although Urysohn's definition of dimension was given for a metric space, it is, nevertheless, completely equivalent to the definition given by\nMenger\nfor general topological spaces.\nUrysohn visited Göttingen in\n1923\n. His reports to the\nMathematical Society of Göttingen\ninterested\nHilbert\nand while in Göttingen he learnt of\nBrouwer\n's contributions to the area made in the paper of\n1913\nto which we referred above. Urysohn spotted an error in\nBrouwer\n's paper regarding a definition of dimension while he was studying it in Göttingen and easily constructed a counter-example. He met\nBrouwer\nat the annual meeting of the\nGerman Mathematical Society\nin Marburg where both gave lectures and Urysohn mentioned\nBrouwer\n's error, and his counter-example, in his talk. It was an occasion which made\nBrouwer\nbegin to think about topology again, for his interests had turned to intuitionism, the subject of his talk at Marburg.\nIn the summer of\n1924\nUrysohn set off again with\nAleksandrov\non a European trip through Germany, Holland and France. Again the two mathematicians visited\nHilbert\nand, by\n7\nMay, they must have left since\nHilbert\nwrote to Urysohn on that day telling him his paper with\nAleksandrov\nwas accepted for publication in\nMathematische Annalen\n(\nsee below\n)\n. This letter, given in\n[\n11\n]\n, also thanks Urysohn for caviar he had given\nHilbert\n, and expresses the hope that Urysohn will visit again the following summer.\nThey then met\nHausdorff\nwho was impressed with Urysohn's results. He also wrote a letter to Urysohn which was dated\n11\nAugust\n1924\n(\nsee\n[\n11\n]\n)\n. The letter discusses Urysohn's metrization theorem and his construction of a universal separable metric space. The construction of a universal metric space, containing an isometric image of any metric space, was one of Urysohn's last results. Like\nHilbert\n,\nHausdorff\nexpressed the hope that Urysohn would visit again the following summer. Van Dalen writes in\n[\n13\n]\nabout their final mathematical visit which was to\nBrouwer\n:-\nThis time\n[\nUrysohn and\nAleksandrov\n]\nvisited\nBrouwer\n, who was most favourably impressed by the two Russians. He was particularly taken with Urysohn, for whom he developed something like the attachment to a lost son.\nAfter this visit the two mathematicians continued their holiday to Brittany where they rented a cottage. Urysohn drowned in rough seas while on one of their regular swims off the coast.\nUrysohn was not only an \"inseparable friend\" to\nAleksandrov\nbut the two collaborated on important publications such as\nZur Theorie der topologischen Räume\nⓉ\n(\nOn the theory of topological spaces\n)\npublished in\nMathematische Annalen\nin\n1924\n. Urysohn's main contributions, in addition to the theory of dimension discussed above, are the introduction and investigation of a class of normal surfaces, metrization theorems, and an important existence theorem concerning mapping an arbitrary normed space into a\nHilbert space\nwith countable basis. He is remembered particularly for 'Urysohn's lemma' which proves the existence of a certain continuous function taking values\n0\nand\n1\non particular closed subsets.\nAfter Urysohn's death\nBrouwer\nand\nAleksandrov\nmade sure that the mathematics he left was properly dealt with. As van Dalen writes\n[\n13\n]\n:-\nBrouwer\nwas broken hearted. He decided to look after the scientific estate of Urysohn as a tribute to the genius of the deceased. Together with\nAleksandrov\nhe acquitted himself of this task.\nCrilly and Johnson write\n[\n8\n]\n:-\nConsidering that he only had three years to devote to topology, he made his mark in his chosen field with brilliance and passion. He transformed the subject into a rich domain of modern mathematics. How much more might he there have been, had he not died so young?",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}