{
  "nome_completo": "Pedro Puig Adam",
  "nome_curto": "Pedro Puig Adam",
  "ano_nascimento": "1900",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Puig_Adam/",
  "lugar_nascimento": "Barcelona, Spain",
  "lugar_morte": "Madrid, Spain",
  "biografia": "Pedro Puig Adam\n's parents were Robert Puig Dalmases and Concepció Adam Gandó. Pedro was his parents' only son. His father was the secretary of the Maquinista Terrestre y Marítima, a company founded in Barcelona in\n1855\nwhich made all types of heavy machinery. The first workshops of the company were in the Barceloneta district of Barcelona and it was in the primary school in that district that Pedro began his education. Robert Puig loved music and languages and had a huge influence on his son Pedro. Concepció Adam had strong convictions and, in particular, was a major influence on her son's religious upbringing. At the primary school in Barceloneta, Pedro was taught by Josep Gra and he proved himself an outstanding pupil, excelling in writing and arithmetic. At the age of eight, Pedro's father sent him to the Franklin Institute in Lyon in France where he spent fifteen months. Returning to Spain, he continued his education in Barcelona, attending the Instituto de Segunda Ensenanza but returned to the Franklin Institute in Lyon from May to October\n1912\n. As well as improving his French, he also learnt German during this time in Lyon. Later, while still a pupil at the Instituto de Segunda Ensenanza, he spent summers working at the Maquinista Terrestre y Marítima factory where his father worked. He completed his studies at the Institute in\n1917\n, winning the top prize.\nLater in\n1917\nPuig Adam entered the School of Industrial Engineers in Barcelona and as well as studying engineering at this school, he also studied mathematics in the School of Exact Sciences which was in the same building. After taking two engineering courses he gave up his studies in this area to concentrate on mathematics. The professor who had the greatest influence on Puig Adam at this stage was Antonio Torroja Miret\n(1884\n-\n1954)\n, Professor of Descriptive Geometry and Geometry of Position at the University of Barcelona, who taught him projective geometry. Torroja Miret was one of three sons of the geometer Eduardo Torroja y Caballé\n(1847\n-\n1918)\nwho had been professor of Descriptive Geometry at Complutense University. Torroja Miret was the first teacher to introduce Puig Adam to rigorous mathematics, teaching him to both think rigorously and to write rigorous mathematics. At this time classes were small and often Puig Adam would be the only student in Torroja Miret's classroom. Torroja Miret related an interesting episode many years later. This happened in Puig Adam's first year at university\n(\nsee for example\n[\n3\n]\n)\n:-\nPuig Adam was an outstanding student so imagine my surprise when, in April, I received the visit of his father, who saw that his son was studying with the ardour with which he always did, but was nervous, worried and expressing fear at every step. He wished, as a good father, to know my judgment, so that he could advise his son, if necessary, not to take the examination and to study the subject again in the following year. That brilliant student ... I do not need to tell you what my answer was. What I want to add, in honour of his father, is that the son did not know about that episode or my encouraging reply until many years later.\nAfter graduating from the University of Barcelona, Puig Adam went to the Central University of Madrid to complete his doctoral studies. There he attended courses given by Miguel Vegas Puebla-Collado\n(1865\n-\n1943)\n, José Gabriel Álvarez Ude\n(1876\n-\n1958)\nand José María Plans y Freire\n(1878\n-\n1934)\n. Puig Adam was always grateful to these teachers. He later expressed his thanks in his book\nCurso de Geometria Métrica\nⓉ\n(\nMetric geometry course\n)\n(1947)\n, to:-\n... Miguel Vegas, whose teachings and affection were invaluable to me.\nPuig Adam also expressed his appreciation of Álvarez Ude, describing him as:-\n... one of my most enlightened teachers ... a good and paternal friend ... whom I have always thought of as one of my virtual teachers.\nIn\nCurso de Geometria Métrica\nⓉ\n(\nMetric geometry course\n)\nPuig Adam describes Álvarez Ude as:-\n... an effective teacher in reviewing with his characteristic critical sharpness the first draft of this book. His wise observations led to the correction of many of its defects. I do not know how to express my gratitude for his spontaneous and for me such a precious collaboration.\nJosé María Plans was Puig Adam's advisor for his thesis entitled\nResolución de algunos problemas elementales en Mecánica relativista restringida\nⓉ\n(\nResolution of some elementary problems in restricted relativistic mechanics\n)\nwhich he submitted in\n1921\n. In the thesis he states that the topic studied was:-\n... at the suggestion of our dear Professor Dr. José María Plans, and that we have continued under his tutelage, following his suggestions ...\nDuring the following three years a number of famous mathematicians visited Madrid and gave lectures which Puig Adam attended. For example he attended lectures by\nTullio Levi-Civita\nin\n1921\n, by\nHermann Weyl\nin\n1922\n, and by\nAlbert Einstein\nin\n1923\n. Puig Adam took on a number of different teaching positions over the following years. Between\n1923\nand\n1926\nhe was Assistant Professor of Descriptive Geometry and Higher Geometry in the Faculty of Sciences at Madrid. Also from\n1923\nbut continuing until\n1932\n, he taught mathematical analysis and infinitesimal calculus at the Catholic Institute of Arts and Industries in Madrid. From\n1931\nto\n1936\nhe taught at the Higher Technical School of Computing.\nOn\n13\nApril\n1925\nPuig Adam married María Luisa Alvarez Herrera, who had been born in Tenerife. They had been friends since meeting in Barcelona and so their wedding took place in Barcelona but they settled down to live in Madrid. Both were enthusiastic musicians and they both played the piano. They had three children; Emília, Robert and Maria Lluïsa.\nPuig Adam was keen to continue his research and, in\n1926\n, he submitted a request for a scholarship to allow him to go to Munich and work with\nConstantin Carathéodory\n. A request to\nCarathéodory\nto comment on Puig Adam's work from the committee deciding on scholarships led to a very positive report in which\nCarathéodory\npraised Puig Adam's research that had been published in papers such as\nConstrucciones métricas y resolución de triángulos esféricos en proyección estereográfica\nⓉ\n(\nMetric constructions and resolution of spherical triangles in stereographic projection\n)\n(1925)\n,\nSobre el problema inverso del cálculo aproximado\nⓉ\n(\nOn the inverse problem of the approximate calculation\n)\n(1926)\n, and\nProblemas métricos sobre una circunferencia menor\nⓉ\n(\nMetric problems on a smaller circumference\n)\n(1926)\n. Puig Adam was awarded the scholarship and set off on a journey to Munich to work with\nCarathéodory\n. However, he had only reached Lyon when he fell ill and was advised to rest for three or four months. He returned to Madrid and eventually decided not to take up the scholarship.\nIn\n1926\nhe was appointed as professor of mathematics at the Institut de Sant Isidre in Madrid. He published\nInterpretación gráfica del error en el método de análisis indirecto\nⓉ\n(\nGraphic interpretation of the error in the method of indirect analysis\n)\n(1928)\n,\nSobre la representación cartesiana de las funciones homogéneas de dos variables\nⓉ\n(\nOn the Cartesian representation of the homogeneous functions of two variables\n)\n(1928)\n, and\nNotas sobre pedagogía matemática\nⓉ\n(\nNotes on mathematical pedagogy\n)\n(1929)\n.  We see from these titles that he was concentrating more on teaching mathematics. He began working with\nJulio Rey Pastor\non writing books for secondary school mathematics teachers. For example they published\nElementos de Geometría Intuitiva\nⓉ\n(\nElements of intuitive geometry\n)\nin\n1928\nand in the Preface they explained their beliefs:-\nHere we introduce you, dear reader, to those who have to be your co-workers: scissors, a ball, a ruler, a pair of set squares and a very large pile of sheets of paper. Not on a single day you must begin the Geometry lesson without having these, your good companions, next to you, nor finish studying it without leaving your table completely full of trimmings of paper and paper with figures ...\nWith\nRey Pastor\nhe wrote further books on teaching methods such as\nMetodologia y didáctica de la matematica elemental\nⓉ\n(\nMethodology and didactics of elementary mathematics\n)\n(1933)\nand the two volume\nElementos de geometría racional. I: Geometría plana. II: Geometría del espacio\nⓉ\n(\nElements of rational geometry. I: Plane geometry. II: Geometry of space\n)\n(1934)\n. You can see further joint publications with\nRey Pastor\nat\nTHIS LINK\n.\nYou can read Puig Adam's own thoughts about teaching mathematics at\nTHIS LINK\n.\nYou can read a version of Joaquín Hernández Gómez's address\nThe Pedagogical Work of Puig Adam\nat\nTHIS LINK\n.\nHowever, Puig Adam had many interests other than mathematics and teaching:-\nHe cultivated a fine sense of humour, he enjoyed reciting and writing verses, playing hands of cards, performing, harmonizing and composing musical pieces, drawing portraits with charcoal and painting pictures. A whole host of hobbies that combined with his teaching, research, literary creation, exquisite cultivation of friendships in conversations and visits or in maintaining an abundant correspondence.\nThe Spanish Civil War broke out in\n1936\nmaking life very difficult for Puig Adam, who of course was from Barcelona, working in Madrid. The situation became unbearable when Franco' troops launched a major offensive against Madrid in October\n1836\n, so at that time he left Madrid and moved to Barcelona. There he taught from\n1937\nto\n1939\nat the Institut-Escola de la Generalitat de Catalunya and also as a professor at the Escola Central d'Enginyers Industrials de Barcelona. Puig Adam had met with Josep Estalella, the director of the Institut-Escola de la Generalitat de Catalunya, back in May\n1933\nwhen a group from the Institut-Escola visited Madrid and, in particular, went to discuss teaching with Puig Adam at the Sant Isidre. Although Puig Adam was back home in Barcelona and at first in a better position regarding the Civil War, nevertheless the situation grew worse as Franco' army, with air support from Germany and Italy, forced the Republicans back. Many of the teachers at the Institutes where Puig Adam worked were either killed or fighting with the army. The health of Josep Estalella, the director of the Institut-Escola de la Generalitat de Catalunya, worsened and he died on\n20\nApril\n1938\n. Puig Adam took over the directorship of the Institut-Escola. When Barcelona fell to Franco's Nationalists in January\n1939\none might have imagined that Puig Adam would have been dismissed but in fact he was able to continue in all his teaching positions in Barcelona.\nLater in\n1939\nPuig Adam and his family returned to Madrid and he again taught at the Sant Isidre Institute and he was also a professor at the Escola Especial d'Enginyers Industrials de Madrid. Although now much involved in teaching and writing books for teachers and for students, he continued to undertake research publishing papers such as\nDe los axiomas de ordenación al teorema de Jordan para recintos poligonales\nⓉ\n(\nFrom the axioms of ordination to Jordan's theorem for polygonal enclosures\n)\n(1945)\n. He became a full professor at the School for Industrial Engineers in\n1946\n. He published the lectures that he gave there, his book on Integral Calculus\nCurso teórico práctico de cálculo integral aplicado a la física y técnica\nⓉ\n(\nTheoretical practical course of integral calculus applied to physics and technology\n)\nappearing in\n1947\nand his book on Differential Equations\nCurso téorico práctico de ecuaciones diferenciales a la física y técnica\nⓉ\n(\nPractical theoretical course of differential equations to physics and technology\n)\nin\n1950\n. His many other books included\nAmpliación de matemáticas para el curso preuniversitario\nⓉ\n(\nExtension of mathematics for the pre-university course\n)\n(1960)\npublished in the year that he died.\nAlthough Puig Adam taught in an exemplary manner at the San Isidro Institute in the\n1950\ns, nevertheless the experience was not made easy by having classes of more than\n100\nstudents. There was also a lack of resources and the rigid regulations together with the need to prepare students for the various examinations and state tests meant that he was somewhat restricted in presenting mathematics in the way he thought best. There was a national decline in standards during these years which caused him great sadness but he tried to compensate by presenting his ideas in various international publications and delivered some wonderful conference lectures. His work did not receive the recognition it deserved during his lifetime, neither by the Administration nor, with some exceptions, by Spanish mathematics teachers. However, today his contributions are very highly respected and a glance at the references below will show how much he has been appreciated in more recent times since only two references are dated\n1960\nwhile the remaining\n25\nare dated\n1985\nor later.\nFor a list of Puig Adam's publications, see\nTHIS LINK\n.\nAmong the honours that he received we mention his election to the\nSpanish Royal Academy of Exact, Physical and Natural Sciences\n. He was awarded the Order of Civil Merit and the medal of Alfonso X the Wise.\nLet us end by giving Puig Adam's advice to mathematics teachers:\nDo not adopt rigid didactics, but adapt in each case to the student, constantly observing.\nDo not forget the concrete origin of mathematics or the historical processes of its evolution.\nPresent mathematics as a unit in relation to natural and social life.\nCarefully graduate the way towards abstraction.\nTeach guiding the student's activity towards creating and discovering.\nStimulate this activity by arousing direct and functional interest towards the goal of knowledge.\nPromote self-correction as much as possible.\nObtain some mastery in the solutions before they become automatic.\nEnsure that the student's writing is a faithful translation of his or her thinking.\nHelp all students to succeed in avoiding becoming demoralised.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}