{
  "nome_completo": "Pelageia Yakovlevna Polubarinova Kochina",
  "nome_curto": "Pelageia Polubarinova Kochina",
  "ano_nascimento": "1899",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kochina/",
  "lugar_nascimento": "Astrakhan, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Pelageia Polubarinova\n's parents were Yakov Stepanovich Polubarinov, an accountant, and Anisiya Panteleimonovna. Pelageia was the second eldest of the family of four children, having one older and one younger brother and a younger sister. It was in Astrakhan, the city of her birth, that Pelageia began her schooling. The city is situated in the delta of the Volga River,\n100\nkm from the Caspian Sea. Yakov Stepanovich Polubarinov decided that Astrakhan did not provide the educational opportunities that he wanted for his four children, so the family moved to St Petersburg which was the capital of the Russian Empire at this time.\nWhile Pelageia Polubarinova was attending the Pokrovskii Women's\nGymnasium\nin St Petersburg, World War I broke out. Then the town of St Petersburg had a German name and the war of\n1914\nled to much anti-German feeling, so the city's name was changed to its Russian version of Petrograd. She graduated from the Gymnasium in\n1916\nand entered the women's programme which was affiliated to the University of Petrograd. At first she was supported by her family but her father Yakov Stepanovich died in\n1918\nand so Pelageia Polubarinova took a job at the Main Geophysical Laboratory to bring in enough money to allow her to continue her education.\nIt was hard work studying pure mathematics and also working at the Laboratory but things became even worse when she and her sister both contracted tuberculosis. Pelageia Polubarinova recovered and went on to complete her degree course, graduating with a degree in pure mathematics in\n1921\n. Her sister did not make a recovery, however, and died as a result of the illness.\nAfter graduating Pelageia Polubarinova continued working at the Main Geophysical Laboratory under A A\nFriedmann\n. At that time\nFriedmann\nwas working on hydrodynamics writing his two part thesis\nThe Hydromechanics of a Compressible Fluid\n; the first part was on the kinematics of vortices and the second on the dynamics of a compressible fluid. It was this work with\nFriedmann\nwhich turned Pelageia Polubarinova's interests towards hydrodynamics and this would be the focus of much of the work she undertook throughout her life.\nNikolai Yevgrafovich Kochin\ngraduated from the University of Petrograd in\n1923\n. As an undergraduate he had already met Pelageia Polubarinova and the two found that they had much in common for\nKochin\n's research was on meteorology, gas dynamics and shock waves in compressible fluids.\nKochin\nwas appointed to Leningrad State University in\n1924\n. This was the new name that the University of Petrograd took on when the city changed its name again in\n1924\nfrom Petrograd to Leningrad. In\n1925\nPelageia Polubarinova and\nNikolai Yevgrafovich Kochin\nmarried by simply registering the event. This was all that was necessary in Russia following the revolution.\nKochina had two daughters Ira and Nina following her marriage. Because of this she left her post at the Main Geophysical Laboratory in order to look after her children but it did not mean that she gave up her academic studies for she continued to undertake research during the following ten years and also taught at various schools and Institutes. In\n1934\nshe returned to a full time post being appointed as professor at Leningrad University. In the following year her husband\nKochin\nwas appointed to Moscow University and the family moved to Moscow.\nKochina gave up the teaching that she had been doing and turned her attention to full time research. She was appointed as a researcher in the Mechanics Section of the\nSteklov\nMathematical Institute where her husband had been appointed. In\n1939\nKochin\nbecame Head of the Mechanics Section of the Mechanics Institute of the\nUSSR Academy of Sciences\nwhen his section became part of the Academy. Kochina continued her researches in the Mechanics Institute and in the following year she was awarded a Doctorate in Physical and Mathematical Science.\nOf course the year\n1940\nwhen Kochina received her doctorate was after the start of World War II. The German armies reached the outskirts of Moscow in late\n1941\nand Kochina and her two daughters were evacuated to Kazan. Her husband, however, remained in Moscow carrying out military research. By\n1943\nthe German army had suffered defeats by Soviet troops and Moscow was safe enough for Kochina to return. This she did, but her husband became ill and died before the end of the war. At the time of his death he had been in the middle of lecture courses and Kochina took over the courses and completed delivering them.\nOn the\n4\nDecember\n1946\nKochina was elected a Corresponding Member of the Division of Technical Sciences of the\nUSSR Academy of Sciences\n. By this time she was lecturing on her research, not only at the Mechanics Institute, but also at the Hydrometeorological and Aircraft Building Institute and at the Aviation Academy which was attached to Moscow State University. Also in\n1946\nKochina was awarded the State Prize for her major contributions.\nAlthough by\n1958\nshe was nearly\n60\nyears old, the Academy proposed a major task for her to carry out. She was elected Academician of the Siberian Branch on\n28\nMarch\n1958\nand asked to take on the task of building the Siberian Branch. For the next twelve years she worked in Novosibirsk where she was Director at the Hydrodynamics Institute and also Head of the Department of Theoretical Mechanics at the University of Novosibirsk. She was named Hero of Socialist Labour in\n1969\n. In\n1970\nKochina returned to Moscow where she became the Director in the Mathematical Methods of Mechanics Section of the\nUSSR Academy of Sciences\n.\nIn\n1979\nKochina was awarded the Order of the Friendship of Nations, then in\n1994\nan international conference was held in St Petersburg on complex analysis and free boundary layer problems to celebrate her\n95\nth\nbirthday. Kochina delivered the opening address at the Conference. In\n1996\nshe was awarded the\nM V Keldysh\nGold Medal for a series of studies into hydrodynamics and the theory of filtration. The articles\n[\n2\n]\nand\n[\n3\n]\npay tribute to Kochina's life and her work in fluid mechanics and the history of mathematics on the occasion of her\n100\nth\nbirthday. She died about two months after reaching the age of\n100\nyears.\nLet us now say a little about Kochina's two main areas of mathematical research, namely fluid mechanics and the history of mathematics. Fluid mechanics was her main research area and we will look briefly at a number of her publications.\nAn application of the theory of linear differential equations to some problems of ground-water motion\npublished in\n1940\nis quite typical of many of her papers. After considering the problem of conformal mapping on the half-plane of finite polygonal regions bounded by straight lines and circular arcs she applied these ideas to the physical problem of the two-dimensional seepage flow of ground water in an earth dam of a particular shape. Again looking at porous media, Kochina studied the flow of fluids into oil wells and the problem of the motion of subterranean water in a medium composed of horizontal strata of ground of various permeabilities. In\n1947\nshe wrote a major survey\nThe theory of seepage of a fluid in porous media\nexamining many contributions to the theory of seepage of an incompressible fluid through a porous medium. Other major texts included\nTheory of motion of ground water\nin\n1952\nwith a second completely revised and enlarged edition appearing in\n1977\n. Komkov, reviewing this second edition, wrote:-\nThis book is a widely quoted source for researchers in filtration theory. Updating of its contents is most timely in view of the recent interest in mathematical modelling of oil field development techniques.\nAs well as studying the application of mathematics to physical problems, Kochina sometimes published papers on solving mathematical problems motivated by the physics. For example in\n1948\nshe studied numerical solutions of a partial differential equation in\nOn a nonlinear partial differential equation arising in the theory of filtration\n.\nIn\n1991\na volume of selected works by Kochina on hydrodynamics and filtration theory was published. The papers in this book are divided into eight sections: Kinematics of atmospheric motions; Hydrodynamics; Applications of the analytical theory of linear differential equations in filtration theory; Steady flow in the presence of porous media; Unsteady motion of groundwater; Problems on oil filtration; Gas filtration through coal layers; and Filtration of liquids through porous media.\nFinally we must look at the important contribution Kochina has made to the history of mathematics. The first point that we should make here is that Kochina's publications were the result of research undertaken practically throughout her whole life. She published many works on\nSofia Kovalevskaya\n, the first being\nThe scientific work of S V Kovalevskaya\nin\n1950\n. She published the article\nKarl Theodor Wilhelm Weierstrass\n(\non the\n150\n-year jubilee\n)\nin\n1966\nand, in\n1985\n, she published the major text\nKarl Weierstrass,\n1815\n-\n1897\n. R L Cooke reviewed this book and wrote:-\nThis biography is a welcome contribution to our understanding of\nWeierstrass\n. The author has consulted an enormous number of sources and expounds the results of this research in clear, comprehensible language. The book contains a detailed biography of\nWeierstrass\n's entire life and as thorough an exposition of his mathematical work as is possible in a study of this scope. ... Within the limitations of published sources this book is the best possible biography of\nWeierstrass\n.\nWhen one considers that Kochina was\n86\nyears old when this brilliant scholarly book was published, one can only marvel. But, as if this achievement was not enough for someone of her age, Kochina published another major biography two years later:\nGosta Mittag-Leffler\n1846\n-\n1927\n. R L Cooke also reviewed this book and wrote:-\nThis book, devoted to a nineteenth-century mathematician who has long deserved a good full-length biography, is very welcome indeed. ... The author has worked on\n[\nthe correspondence of\nMittag-Leffler\n]\n(\nexcept for a\n12\n-year hiatus when she was in Novosibirsk\n)\nfor several decades. The result, in the present case, is an excellent biography of\nMittag-Leffler\nthat does not allow his considerable contributions as a mathematician to be overshadowed by his extensive social activities on behalf of mathematics. There are chapters devoted to his family, his education, his public activity, his scientific activity, his relations with\nKovalevskaya\n, and finally,\nMittag-Leffler\n, the man.\nIn\n1988\nKochina published a\n624\npage book on her reminiscences and works. The book is described by the publisher as follows:-\nThe chief part of the book of the outstanding Soviet specialist in fluid mechanics, the teacher of several generations of mechanical engineers, academician P Ya Kochina, is taken up by her \"Reminiscences\", which have been revised and supplemented since the first edition in\n1974\n. In addition to the autobiographical material in the \"Reminiscences\", there are striking portraits of outstanding scholars - contemporaries of the author, and a discussion of the major events in her scholarly life. The author travelled a great deal both in her native land and abroad, which is reflected in her brilliantly written travel notes. The book also contains articles devoted to various problems of applied fluid mechanics.\nFurther works were to appear by Kochina. She published a major biography of\nA A Friedmann\nin\n1989\n, jointly written with A S Monin and V I Khlebnikov. She also wrote a biography of her husband\nNikolai Yevgrafovich Kochin\nwhich the publisher described as follows:-\nThis book is devoted to the life and scientific work of the outstanding Russian scholar, Academician\nNikolai Yevgrafovich Kochin\n(1901\n-\n1944)\n, who contributed greatly to hydromechanics and theoretical meteorology. The book also gives an account of the teachers of\nN Y Kochin\nand his colleagues:\nV I Smirnov\n,\nA A Friedmann\n,\nAleksei Krylov\n,\nI M Vinogradov\n,\nS A Chaplygin\n,\nS L Sobolev\n, S A Khristianovich, I A Kibel et al. The author knew all these men and shares her memories of them.\nIn\n1999\n, when Kochina was\n100\nyears old, she published\nSome properties of a fractional-linear transformation\nwritten jointly with N N Kochina. We quote from their own summary in that paper:-\nWe point out seven properties of a fractional-linear analytic function, many of which are also preserved in the domain of real variables. In this and other cases, these properties are important for applications to problems of underground hydromechanics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics"
  ]
}