{
  "nome_completo": "Perseus",
  "nome_curto": "Perseus",
  "ano_nascimento": "180 BC",
  "ano_morte": "120 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Perseus/",
  "lugar_nascimento": null,
  "lugar_morte": null,
  "biografia": "There are only two references to\nPerseus\nand these both occur in the writings of\nProclus\n. They give no indication of where he was born or where he lived. His dates can at least be put within certain bounds by the information given, but our knowledge is still almost nil.\nThe first reference says that Perseus is associated with the discovery of the \"spiric\" curves in the same way as that of\nApollonius\nis with\nconics\n. The second reference is taken from\nGeminus\nand says that Perseus wrote an epigram on his discovery\n(\nsee for example\n[\n1\n]\n)\n:-\nThree curves upon five sections finding, Perseus made offering to the gods...\nAll that can be deduced with certainty is that Perseus must have lived before\nGeminus\n. Less certain, but still very reasonable, is the belief that conic sections must have been developed first so he would then have lived after\nEuclid\nwrote in say\n300\nBC.\nThe references do not really give enough details to be able to tell what Perseus discovered. We do know what a spiric section is.\nProclus\ndefines a spiric surface as being the surface generated by a circle revolving about a straight line called the axis of revolution and always remaining in the same plane as this axis. There are three distinct types of spiric surfaces depending whether the axis of revolution cuts the circle, it is a\ntangent\nto the circle, or is outside the circle.\nA spiric section is then the curve produced when a plane parallel to the axis of revolution cuts the spiric surface. However, it is now difficult to see what the \"\nthree curves upon five sections finding\n...\" means.\nPaul Tannery\nin\n[\n3\n]\ngives a clever argument based on assuming that\nProclus\nmade an error and should have written \"three curves in addition to five sections finding ...\".\nThe five types of curve are shown in the diagram. The first is the case of an oval, the second is a transition from the first case to the third. The third case is that in which the curve is closed and narrowest in the middle. The fourth case is that of the\nhippopede\n, which was studied by\nEudoxus\n. Finally the fifth case consists of two symmetrically positioned closed curves.\nProclus\ngives the three curves of types\n1\n,\n3\nand\n4\nonly.\nIn\n[\n1\n]\nBulmer-Thomas prefers the simpler suggestion that Perseus found five sections but only three of these gave new curves, the other two\n(\ntypes\n2\nand\n5)\ngave curves which were closely related to the others and not considered new. Another possibility, which is not favoured by historians, is that the three spiric curves were one from each of the three different spiric surfaces.",
  "math_areas": []
}