{
  "nome_completo": "Persi Warren Diaconis",
  "nome_curto": "Persi Diaconis",
  "ano_nascimento": "1945",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Diaconis/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "Persi Diaconis\n's parents were professional musicians and, from the age of five up to the age of fourteen, Persi studied the violin at the famous Juilliard School in New York. His brother and sister also studied music and have become professional musicians. Persi also taught himself magic tricks from the age of five and, as he grew up, this was a hobby which came to dominate his daily life. He attended George Washington High School in New York City, where he joined the Magic Club, but his fascination with mathematics also goes back to this time\n[\n4\n]\n:-\nI met Martin Gardner when I was\n13\n. He was a fascinating character and I started to read stuff he wrote.\nHis interest in mathematics was not independent of his interest in magic, for he would use mathematics in many of his tricks. In fact he met\nMartin Gardner\nbecause of their shared interest in magic and\nGardner\nlater used some of the ideas that Diaconis showed him in his \"Mathematical Games\" column in\nScientific American\n. Diaconis had been due to graduate from George Washington High School at age fifteen but, when he was fourteen years old, Dai Vernon the famous Canadian born sleight-of-hand expert who lived in New York invited Diaconis to join him on one of his American tours performing magic shows. Diaconis left school without telling his parents and went with Dai Vernon.\nMartin Gardner\nsaid\n[\n5\n]\n:-\nHe was a professional card shark, or a card mechanic, as they call it in the trade. He worked ships between New York and South America. Of course, nobody suspected him of being skillful with cards because he was just a teenager.\nAlthough he had left high school without graduating, Diaconis had performed exceptionally well at school and the teachers decided to give him grades in examinations he had not taken\n[\n4\n]\n:-\nI had been pushed through the New York City school system rapidly and before I left I took lots of scholarship exams and stuff. I came back to New York, and kept getting mail as if I had graduated. Letters from the Army saying \"Dear Graduate, perhaps you would be interested ... \" And I had won some scholarships - a Merit Scholarship and some others. And I thought, \"Gee, this is funny. I didn't even graduate from high school and there are all of these opportunities that I can't take.\" But I kept getting these letters, so I then went into school and I said, \"Did I somehow graduate?\" ... and the assistant principal said, \"Oh, Diaconis. Yeah, the teachers got together and decided it would not do you any good to cause you trouble, and they just decided to give you grades and graduate you.\"\nDiaconis left Dai Vernon after a couple of years and worked on his own making money playing clubs in Chicago. At this time he performed under the name of Persi Warren\n[\n1\n]\n:-\nI eventually drifted back to New York, doing magic and pursuing it as an academic discipline, inventing tricks, giving lessons, and collecting old books on magic, which I still do. It was just my life, I did it with all my energy.\nOne of his friends, Charles Radin, was a mathematical physicist at the University of Texas and they had gone together one day to a bookshop. Radin said that\nWilliam Feller\n's\nIntroduction to Probability Theory and its Applications\nwas the best book there is from which to learn probability\n[\n4\n]\n:-\nI thought I could do anything.  ... So I bought\nFeller\nand I thought, \"Well, I'll just read this book.\" And I couldn't read it. I didn't know calculus, or at least not enough.\nIn order to learn more mathematics, Diaconis began to study at the City College of New York. He started taking evening classes in\n1968\nand paid his way by continuing to make money from his magic shows. Soon he decided to take a degree and was awarded a B.S. Mathematics by the City College of New York in January\n1971\n. He wanted to continue to graduate school but only a few places took mid-year applications. Harvard was one such place and Diaconis wanted to go there but doubted that the Mathematics Department would take a student with a City College degree.\nMartin Gardner\n, however, was able to help him at this time\n[\n5\n]\n:-\nPersi was very anxious to get into Harvard. The head of the statistics department at Harvard was\nFrederick Mosteller\n, who is a magic buff. He was very active in magic, and his picture has been on the cover of magic magazines. I knew\nMosteller\nslightly, so I wrote him a letter and said, \"This young student is one of the best card mechanics in the country. He does a fantastic second deal and bottom deal.\"\n(\nThose are terms for fake deals. When you are dealing from a deck, there is a way to deal the second card instead of the top card, and there is a way to deal the bottom card instead of the top card.\n)\nI got back a letter right away from\nMosteller\n, which said, \"If he's willing to major in statistics, I can get him into Harvard.\" So I asked Persi if he was willing to major in statistics, and he said, \"Of course!\" So he got in, got his Ph.D. in statistics ...\nIn fact when Diaconis was interviewed by\nMosteller\nbefore beginning his graduate studies,\nMosteller\nsuggested that he might like to think about the distribution of prime divisors of an integer chosen at random. Diaconis thought about the problem and then discussed it with Hironari Onishi who had taught him mathematics at the City College. He continued to work on it, discussing ideas with\nMosteller\n, during his first year as a graduate student at Harvard and the results were eventually published in the\nJournal of Number Theory\nas the three-author paper\nSecond-order terms for the variances and covariances of the number of prime factors-including the square free case\n(1977)\n. This was not the first of Diaconis's papers to be published for\nBuffon's problem with a long needle\nhad been published in the\nJournal of Applied Probability\nin the previous year. During his first year at Harvard, academic year\n1971\n-\n72\n, Diaconis had studied for a Master's Degree and then continued to study at Harvard for a Ph.D. He was awarded the degree in\n1974\nfor his thesis\nWeak and Strong Averages in Probability and the Theory of Numbers\n.\nAfter the award of his doctorate, Diaconis was appointed as an Assistant Professor of Statistics at Stanford University. He was promoted to Associate Professor of Statistics at Stanford in\n1979\nand, two years later, he became a full professor. While at Stanford he kept his contacts with Harvard, being a Visiting Professor in the Harvard Department of Statistics in\n1981\n-\n82\nand in the Harvard Department of Mathematics in\n1985\n-\n86\n. In\n1987\nhe left Stanford when he was appointed as George Vasmer Leverett Professor of Mathematics at Harvard. After spending\n1996\n-\n98\nas David Duncan Professor at Cornell University, Diaconis returned to Stanford where he was appointed Mary V Sunseri Professor in the Department of Statistics and the Department of Mathematics. In addition, Diaconis has acted as a consultant to Scientific American\n(1972\n-\n80)\n, the Jet Propulsion Laboratories\n(1974)\n, the Bell Telephone Laboratories, Murray Hill, New Jersey\n(1974\n-\n)\n, the Stanford Linear Accelerator\n(1977\n-\n)\n, and Teledyne, Cryptography Division\n(1993\n-\n99)\n.\nIt would be difficult to give a summary of the papers that Diaconis has written\n(\nhis publication list contains around\n200\nitems\n)\n. However, we give a selection of sixteen of these together with extracts of a summary by the authors or reviewer at\nTHIS LINK\n.\nIn\n1988\nhe published the important book\nGroup representations in probability and statistics\n. Philippe Bougerol writes in a review:-\nThe purpose of this nice little book is to show how the mathematical theory of group representations can be used to solve very concrete problems in probability and statistics. It is mainly concerned with noncommutative finite groups. ... This book is remarkable. On the one hand it is a research book\n(\nmost of the material appears in book form here for the first time\n)\n, using tools from one of the main active fields in \"pure mathematics''. On the other hand, it is very clear and self-contained. Both the pure mathematician and the applied statistician will find pleasure and excitement in reading it. The text is full of attractive examples. It contains many open questions and I am sure that it will be the starting point for new research on the subject.\nDiaconis was the\nMathematical Association of America\n's\nEarle Raymond Hedrick\nLecturer in\n1989\n. In\n1990\nhe was an invited speaker at the International Congress of Mathematicians in Kyoto, giving the lecture\nApplications of group representations to statistical problems\n. At the International Congress of Mathematicians held in Berlin in\n1998\nhe was a plenary speaker giving the address\nFrom shuffling cards to walking around the building: an introduction to modern Markov chain theory\n. His summary says that he:-\n... surveys recent progress in the classical subject of\nMarkov\nchains. Sharp rates of convergence are available for many chains. Examples include shuffling cards, a variety of simulation procedures used in physics and statistical work, and random walk on the chambers of a building. The techniques used are a combination of tools from geometry, PDE, group theory and probability.\nBetween these two Congresses, he was a main speaker at the\nEdinburgh Mathematical Society\n's St Andrews Colloquium in\n1996\n, and the\nAmerican Mathematical Society\n's\nGibbs\nlecturer in\n1997\n. Three years later, in\n2000\n, he was the\nSociety for Industrial and Applied Mathematics\n'\nJohn von Neumann\nLecturer. In\n2001\nhe was a main speaker at Groups St Andrews\n2001\nin Oxford giving a series of lectures on\nRandom walks on groups: characters and geometry\n. He begins the Introduction to the written version of these lectures as follows:-\nThese notes tell two stories. The first is an overview of a general approach to studying random walk on finite groups. This involves the character theory of the group and the geometry of the group in various generating sets. The second is the life and times of a single example: random transpositions on the symmetric group. This was the first example where sharp estimates were obtained.\nHe was Patten Lecturer on the Indiana University Bloomington campus in March\n2004\ngiving the lectures\nOn Coincidences\nand\nThe Search for Randomness\n. At this time Indiana University gave the following summary of Diaconis's research contributions:-\nAmong the highlights of his research is pioneering work on the speed of convergence of\nMarkov\nchains to equilibrium, a rapidly growing field with numerous applications to statistics, physics and computer science. His dramatic and famous \"cut-off phenomenon\" has been nothing short of amazing. Together with David Freedman of Berkeley, Diaconis has made fundamental and dramatic contributions to Bayesian statistics. But the impact of his contributions extend beyond probability and statistics. As both a magician and a statistician, Diaconis has debunked with unusual authority much research on extra sensory perception and the paranormal, and has exposed several psychics, including Uri Geller.\nIn April\n2004\nhe was a plenary speaker at the British Mathematical Colloquium at Warwick University giving the talk\nThe Search for Randomness\n.\nDiaconis's contributions have been recognised with prestigious awards. He received the Rollo Davidson Prize from the University of Cambridge\n(1981)\n, and the Van Wijngaarden Award\n(2006)\n. He has been awarded an honorary degree from the University of Chicago\n(2003)\n, Université Paul Sabatier, Toulouse\n(2003)\n, Uppsala University\n(2005)\n, Queen Mary College, University of London\n(2006)\n, and the University of Economics and Business of Athens\n(2009)\n. He was elected as a Fellow of the Institute of Mathematical Statistics in\n1981\n, was their\nWald\nLecturer in\n1987\n, and President of the Institute in\n1997\n-\n98\n. He was elected a fellow of the\nAmerican Academy of Arts and Sciences\n(1989)\n, a fellow of the\nAmerican Statistical Association\n(1994)\n, a member of the\nNational Academy of Sciences\n(1995)\n, and a member of the American Philosophical Society\n(2005)\n.\nIn\n2012\nDiaconis was awarded the Levi L. Conant Prize by the\nAmerican Mathematical Society\nfor his paper\nThe Markov chain Monte Carlo revolution\npublished in the Bulletin of the\nAmerican Mathematical Society\nin\n2009\n. The prize was presented at the\n118\nth\nAnnual Meeting of the Society in Boston in January\n2012\n. The Citation begins:-\nThis wonderful article is a lively and engaging overview of modern methods in probability and statistics and their applications. It opens with a fascinating real-life example: a prison psychologist turns up at Stanford University with en- coded messages written by prisoners, and Marc Coram uses the Metropolis algorithm to decrypt them. From there, the article gets even more compelling! After a highly accessible description of\nMarkov\nchains from first principles, Diaconis colourfully illustrates many of the applications and venues of these ideas. Along the way, he points to some very interesting mathematics and some fascinating open questions, especially about the running time in concrete situations of the Metropolis algorithm, which is a specific Monte Carlo method for constructing\nMarkov\nchains. The article also highlights the use of spectral methods to deduce estimates for the length of the chain needed to achieve mixing.\nDiaconis replied:-\nAs a regular reader of expository articles, I am thrilled that mine seemed useful. The Bulletin does a great service with these. While I have the chance, I want to point to two other recent Bulletin articles that I am proud of: \"Patterns in eigenvalues\"\n(\nmy Gibbs Lecture,\n2002)\nand \"On adding a list of numbers\n(\nand other one-dependent determinantal processes\n)\n\"\n(\nwith A Borodin and J Fulman,\n2009)\n. I promise to keep at it. Thank you.\nDiaconis received a further honour in\n2013\nwhen, on Friday\n13\nSeptember, in the Younger Hall, St Andrews, he was given an honorary degree during a special graduation ceremony which formed part of the University of St Andrews'\n600\nth\nAnniversary celebrations. He was one of seventeen \"international scholars and thinkers\", \"some of the best minds of our generation\", who were honoured in this way.\nThe laureation address by Nik Ruskuc, School of Mathematics and Statistics, University of St Andrews, is given  at\nTHIS LINK\nDiaconis is married to Susan Holmes, a professor of statistics at Stanford; they have two children, Camille and Emma. We end this biography by looking at his remarkable latest book\nMagical Mathematics: The Mathematical Ideas that Animate Great Magic Tricks\nwhich he has co-authored with\nRon Graham\n. The publisher, Princeton University Press, writes:-\n'Magical Mathematics' reveals the secrets of amazing, fun-to-perform card tricks - and the profound mathematical ideas behind them - that will astound even the most accomplished magician. Persi Diaconis and\nRon Graham\nprovide easy, step-by-step instructions for each trick, explaining how to set up the effect and offering tips on what to say and do while performing it. Each card trick introduces a new mathematical idea, and varying the tricks in turn takes readers to the very threshold of today's mathematical knowledge. For example, the Gilbreath principle - a fantastic effect where the cards remain in control despite being shuffled - is found to share an intimate connection with the\nMandelbrot\nset. Other card tricks link to the mathematical secrets of combinatorics, graph theory, number theory, topology, the\nRiemann\nhypothesis, and even\nFermat\n's last theorem.\nReviewers have heaped praise on this work. Let us give just one quote from a review by\nBarry Mazur\n:-\nThis is a wonderful book, unique and engaging. Diaconis and\nGraham\nmanage to convey the awe and marvels of mathematics, and of magic tricks, especially those that depend fundamentally on mathematical ideas. They range over many delicious topics, giving us an enchanting personal view of the history and practice of magic, of mathematics, and of the fascinating connection between the two cultures. 'Magical Mathematics' will have an utterly devoted readership.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}