{
  "nome_completo": "Peter Barlow",
  "nome_curto": "Peter Barlow",
  "ano_nascimento": "1776",
  "ano_morte": "1862",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barlow/",
  "lugar_nascimento": "Norwich, England",
  "lugar_morte": "Kent, England",
  "biografia": "Peter Barlow\nwas self-educated but this education was sufficiently good that he was able to compete successfully to became an assistant mathematics master at the Royal Military Academy at Woolwich. He was appointed to the post in\n1801\nand he began publishing mathematical articles in the\nLadies Diary\nand he became sufficiently well established as a leading authority on mathematics that after a while he was asked to contribute various articles on mathematics for encyclopaedias.\nIn addition to these articles, Barlow also published several important books, for example in\n1811\nhe published\nAn elementary investigation of the theory of numbers\nand three years later he published\nA new mathematical and philosophical dictionary\n.\nHe is remembered most for two important contributions. In\n1814\nhe produced a second book, in addition to the one described above, entitled\nNew mathematical tables\n. These soon became known as\nBarlow's Tables\nand this work gives factors, squares, cubes, square roots, reciprocals and hyperbolic logarithms of all numbers from\n1\nto\n10\n000\n. The book\n[\n2\n]\n:-\n... was considered so accurate and so useful that it has been regularly reprinted ever since.\nIn the mathematical library at the University of St Andrews we have several well worn copies of these tables which must have been used intensely for many years. Today, however, they are only of historical interest since they were made completely obsolete by calculators and computers.\nBarlow's second major contribution makes his name still well known by amateur astronomers today. He invented the Barlow lens, a telescope lens consisting of a colourless liquid between two pieces of glass\n[\n1\n]\n:-\nThe \"Barlow lens\", a modification of this telescope lens, is a negative achromatic combination of flint glass and crown glass.\nIn his lifetime Barlow's greatest achievement was being elected to the\nRoyal Society\nand receiving its Copley medal for his work on magnetism\n[\n2\n]\n:-\nIn\n1819\nBarlow began work on the problem of deviation in ship compasses caused by the presence of iron in the hull. For his method of correcting the deviation by juxtaposing the compass with a suitably shaped piece of iron, he was awarded the Copley Medal ...\nThese were not his only contributions, however. In\n1817\nhe published\nEssay on the strength and stress of timber\nwhich contains data he collected while conducting experiments at the military establishments in Woolwich. He also worked on the design of bridges, in particular working from\n1819\nto\n1826\nwith Thomas Telford on the design of the bridge over the Menai Strait. It was the first major modern suspension bridge.\nWestminster Bridge was built across the Thames in London, despite opposition from city merchants, in the\n1740\ns and rebuilt by Charles Labelye in the\n1750\ns. However when there was a move to demolish and replace this old bridge in the\n1820\ns, Barlow was consulted to compute how the tides on the Thames would be affected by the removal of this structure. After Barlow reported, New London Bridge was designed by John Rennie Sr and built by his son John Rennie Jr.\nBarlow was active during the period of railway building in Britain. George Stephenson was the first to build railways in Britain. In\n1825\nthe first train ran from Darlington to Stockton while the\n30\n-mile line from Liverpool and Manchester was opened to traffic in\n1830\n. Stephenson, who constructed both projects, believed that gradients should be less than\n1\npercent and that curves should have very wide radii of at least a kilometre. Barlow was appointed as royal commissioner for railways and in the\n1830\ns and\n1840\ns he conducted several experiments to see if the limitation on gradients and radius of curvature proposed by Stephenson was correct. He also tried to determine the most efficient shape for the rails.",
  "math_areas": []
}