{
  "nome_completo": "Peter Michael Neumann",
  "nome_curto": "Peter Neumann",
  "ano_nascimento": "1940",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neumann_Peter/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Peter Neumann\nwas the son of\nBernhard Neumann\nand Johanna von Caemmerer\n(\nalways known as\nHanna Neumann\n)\n. Both\nBernhard Neumann\nand\nHanna Neumann\nwere leading mathematicians. They were both German and\nBernhard\n, being Jewish, left Germany and moved to Cambridge, England, in August\n1933\n, about five months after Hitler came to power.\nBernhard\nwas given refugee status in Britain. He had become friendly with\nHanna\nin January\n1933\nand\nHanna\nvisited\nBernhard\nin Cambridge at Easter\n1934\nwhen the two became secretly engaged. In July\n1933\nHanna\nmoved to England and she married\nBernhard\non\n22\nDecember\n1938\nat the local register office in Cardiff where\nBernhard\nwas working as a lecturer.\nBernhard\nand\nHanna Neumann\n's first child, Irene Neumann, was born in Cardiff in August\n1939\n. After the British army was evacuated from Dunkirk in June\n1940\n,\nBernhard\nand\nHanna\nbeing German, were barred from the south of Britain. To maintain their university links, they went to Oxford where their second child, Peter Neumann, the subject of this biography, was born in December\n1940\n. Later in the war, the Neumanns were allowed to return to Cardiff, where\nBernhard\ncontinued his lectureship. Their third child, Barbara Neumann was born in Cardiff, in November\n1943\n. After the war ended,\nBernhard\nwas appointed to the University of Hull but before he took up the appointment their fourth child Daniel Neumann was born in Caerphilly, Wales on\n1\nJanuary\n1946\n.\nHanna\nwas also appointed to Hull but in\n1948\nBernhard\nwas appointed to the University of Manchester; the family continued to live in Hull where\nHanna\nstill had her position. Their fifth child, Daniel Neumann, was born in Hull in\n1951\n.\nLet us say a little at this point about Peter Neumann's siblings. Irene was awarded a Master of Arts degree in English literature from the University of Manchester, became a high school teacher in Aberdeen, Scotland, and then a lecturer in English at New Mexico State University. Barbara taught mathematics at Saint Bernard's Convent School in Slough, England and became an active member of the\nMathematical Association\n. Walter Neumann became a mathematician working on geometric group theory. He was an undergraduate at the University of Adelaide, was awarded a Ph.D. from the University of Bonn\n(1969)\nand after lecturing at Bonn, became a professor at the University of Maryland, then Ohio State University followed by the University of Melbourne, and finally at Barnard College, Columbia University, New York. Daniel Neumann graduated from Monash University with a degree in ancient Greek and pure mathematics, then studied psychology at the University of New England and Swinburne University. After years as a musician in Orchestra Victoria, he became a psychologist.\nPeter began his formal education at Bricknell Primary School, founded in\n1933\n, which was situated in a residential area close to the University of Hull. He won a scholarship to study at Hymers College, an excellent independent school. There he was taught mathematics by Roger Frank Wheeler\n(1929\n-\n2014)\nwho had graduated with First Class Honours in the Mathematical Tripos in Cambridge in\n1951\n. Wheeler lent Neumann the book\nThéorie des Nombres\nby\nÉdouard Lucas\n. Neumann wrote\n[\n21\n]\n:-\nI learned much from Roger and this book; what a huge and exciting subject number theory is.\n[\nA number theory\n]\nproblem took over my mind and I have always believed that it was the main reason that I failed one of my A-level GCE mathematics papers in June\n1958\n, failed to win a state scholarship, and had to repeat the examinations in\n1959\n. It may, however, have contributed something towards my winning a Hastings Scholarship to The Queen's College, Oxford in the Autumn of\n1958\n.\nBernhard\nand\nHanna\ngave Peter Neumann mathematical papers to read while he was at Hymers College; the first of these was\nGeoffrey Howson\n's paper\nOn the intersection of finitely generated free groups\n(1954)\n. But his school years were not all mathematics. He played chess, becoming captain of the College chess team, and learnt to play the violin and viola to a high standard.\nBarbara Neumann became Barbara Cullingworth after her marriage. She wrote about Peter Neumann's upbringing in\n[\n8\n]\n:-\nMathematics was always part of the Neumann household, with students from the university being welcomed to evenings of chat, puzzles and fun. In summer, it was not unusual for the full family of seven to spend a fortnight cycling to and from Scotland or elsewhere in the UK so that\nBernhard\nand\nHanna\ncould attend conferences. One such was the Mathematical Colloquium organised by the\nEdinburgh Mathematical Society\nat the University of St Andrews every four years. As the children grew older, they, too, would attend selected sessions. Music was also part of family life, with several of the children playing different instruments, so that chamber music could be played, or recorder ensembles with descant, treble and even a bass recorder.\nFor several years the family was split, with\nBernhard\nworking in Manchester University while\nHanna\nkept the family going, as well as working at the University of Hull.\nBernhard\nwould come back for alternate weekends and the vacations, sometimes by train but often by bike. For Peter's final year at Hymers College,\nHanna\nhad also managed to find work in Manchester so the family left Hull but, to finish his schooling, Peter lodged with another mathematical family, John and Beryl Shepperd and their children.\nNeumann began his undergraduate studies at The Queen's College, Oxford, in\n1959\n. He was assigned Ughtred Shuttleworth Haslem-Jones as a tutor. Haslem-Jones\n(1903\n-\n1962)\nhad himself been an undergraduate at The Queen's College, then had studied for his D.Phil. advised by\nG H Hardy\n. After being a lecturer at Liverpool University from\n1927\nto\n1936\nhe spent the rest of his career as a tutor at The Queen's College Oxford. He had a high reputation as a tutor and Neumann got on very well with him. Neumann took courses given by Kenneth A H Gravett\n(1929\n-\n1966)\n, who had studied for his Ph.D. under\nRichard Rado\n, by the algebraic topologist Wilson Alexander Sutherland\n(1935\n-\n2019)\nand by the applied mathematician\nJack de Wet\n)\n. Neumann continued his love of music, playing violin in the band which played for the Oxford University Cecil Sharp Club for English folk dancing. Here he met Sylvia Bull whom he had also met at mathematics lectures. Sylvia, at Somerville College Oxford, and Peter became close friends.\nBernhard Neumann\nand\nHanna Neumann\nspent the academic year\n1961\n-\n62\non sabbatical leave at the\nCourant\nInstitute in New York. Peter Neumann, while still an Oxford Undergraduate, went with his parents and began research with them and with\nGilbert Baumslag\nwho had been appointed as an assistant professor at the\nCourant\nInstitute in\n1961\n. Peter Neumann's first paper, written jointly with both his parents, was\nWreath products and varieties of groups\n(1962)\n. The paper begins:-\nThis paper studies interrelations of varieties of groups, that is of classes of groups defined by laws\n(\nalso known as identical relations\n)\nor, in yet different terminology, of equationally defined classes of groups. The set of varieties of groups carries a natural lattice order relation, by inclusion, and it is given an algebraic structure by the definition of certain operations: the lattice operations that stem from the order relation, and multiplication and commutation.\nA number of properties of this algebraic structure were derived in\n[\nHanna Neumann\n, 'On varieties of groups and their associate near-rings'\n[1956]]\nthus it is known to be multiplicatively an ordered semigroup with unit element and zero, with cancellation of equal non-zero right-hand factors from inclusions and equations, and with multiplication on the right distributing over the lattice operations and over commutation. Every non-one and non-zero variety is, moreover, expressible as a product of indecomposable varieties, that is of varieties that are not products except trivially.\nAmong the problems that are posed but left open in\n[\nHanna Neumann\n's paper\n]\nthe most difficult is that of the uniqueness or otherwise of the factorisation of a variety into indecomposable varieties; there is also the problem whether multiplication on the left behaves like multiplication on the right: whether equal non-zero left factors can be cancelled from inclusions or from equations, and whether multiplication on the left distributes over the other operations. All these questions are answered in the present paper ...\nPeter's research in New York also resulted in the\n4\n-author paper\nOn varieties generated by a finitely generated group\n(1964)\nwritten jointly with his parents and\nGilbert Baumslag\n.\nBack in Oxford, Peter Neumann married Sylvia Bull in\n1962\n. At this time scholarship holders were not allowed to marry so he lost his scholarship but\n[\n15\n]\n:-\n... the College's reaction was sternly to deprive him of his scholarship, but then to make him an ex gratia payment, of a sum exactly equivalent to a scholarship.\nThey married after Sylvia graduated from Oxford but Peter Neumann, who had taken a year out from his studies to visit the\nCourant\nInstitute, did not graduate until\n1963\n. Sylvia wrote\n[\n34\n]\n:-\nI married the year I left Somerville and taught for a year at Milham Ford School while my husband ... was still an undergraduate. Then our family started and my career went on hold. ... we have brought up three children: David, born in\n1964\n; Jenny, born in\n1965\n; and James, born in\n1968\n.\nAfter graduating with a B.A. in\n1963\n, Peter Neumann remained at The Queen's College to undertake research in group theory for his D.Phil. advised by\nGraham Higman\n. While undertaking research, he spent a year at Merton College, Oxford, where he was awarded a senior scholarship, but returned to The Queen's College when awarded a junior research fellowship. In\n1965\nhe was awarded the Senior University Mathematical Prize which meant he also received the Johnson Prize, and according to the Statutes, was known as The Johnson University Prizewinner. He was awarded a D.Phil. in\n1966\nfor his thesis\nA Study of Some Finite Permutation Groups\n. The thesis contains the following Abstract:-\nThis thesis records an attempt to prove the two conjecture:\nConjecture A: Every finite non-regular primitive permutation group of degree n contains permutations fixing one point but fixing at most\nn\n1\n/\n2\nn^{1/2}\nn\n1\n/\n2\npoints.\nConjecture C: Every finite irreducible linear group of degree m >\n1\ncontains an element whose fixed-point space has dimension at most\n1\n2\nm\n\\large\\frac{1}{2}\\normalsize  m\n2\n1\n​\nm\n. Variants of these conjectures are formulated, and C is reduced to a special case of A. The main results of the investigation are:\nTheorem\n2\n: Every finite non-regular primitive permutation group of degree n contains permutations which fix one point but fix fewer than\n1\n4\n(\nn\n+\n3\n)\n\\large\\frac{1}{4}\\normalsize (n+3)\n4\n1\n​\n(\nn\n+\n3\n)\npoints.\nTheorem\n3\n: Every finite non-regular primitive soluble permutation group of degree n contains permutations which fix one point but fix fewer than\nn\n7\n/\n18\nn^{7/18}\nn\n7\n/\n1\n8\npoints.\nTheorem\n4\n: If H is a finite group, F is a field whose characteristic is\n0\nor does not divide the order of H, and M is a non-trivial irreducible H-module of dimension m over F, then there is an element h in H whose fixed-point space in M has dimension less than\n1\n2\nm\n\\large\\frac{1}{2}\\normalsize m\n2\n1\n​\nm\n.\nTheorem\n5\n: If H is a finite soluble group, F is any field, and M is a non-trivial irreducible H-module of dimension m over F, then there is an element h in H whose fixed-point space in M has dimension less than\n7\n18\nm\n\\large\\frac{7}{18}\\normalsize m\n1\n8\n7\n​\nm\n.\nProofs of these assertions are to be found in Chapter II; examples which show the limitations on possible strenghtenings of the conjectures and results are marshalled in Chapter III. A detailed formulation of the problems and results is contained in section\n1\n.\nHe wrote in the Preface:-\nI owe my interest in the problems described in this thesis to a rich correspondence with Dr\nJames Wiegold\n. ... I am grateful to my supervisor, Professor\nG Higman\n, F.R.S., for his kind encouragement and for many suggestions, and for a wide background of valuable instruction and supervision more generally; and to Dr\nWiegold\nwho, unwittingly at the time, set me off on this investigation, and whose friendly influence has helped in many, many ways.\nBy the time he was awarded his D.Phil., Neumann had six papers in print. These were the two mentioned above with his parents as joint authors, and the four papers:\nSome indecomposable varieties of groups\n(1963)\n;\n(\nwith\nJames Wiegold\n)\nSchreier varieties of groups\n(1964)\n;\nOn the structure of standard wreath products of group\ns\n(1964)\n; and\nOn word subgroups of free groups\n(1965)\n.\nI\n[\nEFR\n]\nwent to Warwick University in\n1965\nto undertake research for a Ph.D. Warwick had a one year M.Sc. degree with course work and thesis which I took in\n1965\n-\n66\n. My advisor was Roger Carter and he suggested I write a thesis on varieties of groups. He gave me the\n1956\npaper by\nHanna Neumann\nand the ones she wrote with Peter Neumann to read. He also suggested that I visit Oxford and chat to Peter. I have known Peter from that time on and am so grateful for his friendship and support throughout my career.\nPeter Neumann was appointed as a Tutorial Fellow in Mathematics at The Queen's College, Oxford, in\n1966\n, and, in addition, a University Lecturer in Pure Mathematics, Oxford University, in\n1967\n. He wrote in\n2005\nin the Curriculum Vitae\n[\n9\n]\n:-\nIn have taught all aspects of pure mathematics to first and second-year undergraduates; taught algebra, logic, number theory, combinatorics, history of mathematics to advanced undergraduates; and taught algebra, history of algebra to postgraduate students. Thirty-six students have earned an Oxford DPhil under my supervision\n(35\nin algebra,\n1\nin history of mathematics\n)\n.\nHe wrote in the same CV about his Research Interests\n[\n9\n]\n:-\nI have undertaken research in algebra - mainly group theory - and its history. Broad areas to which I have contributed are: finite permutation groups; infinite permutation groups; computational group theory; varieties of groups; infinite soluble groups; statistical questions of group theory; group enumeration; applications of group theory in combinatorics; Nineteenth Century history of group theory. I have published approximately\n75\nresearch articles in mathematics\n(\nabout half of them written jointly with colleagues\n)\n,\n8\nresearch articles in history of mathematics, a textbook of group theory\n(\njoint with G A Stoy and E C Thompson\n)\n, lecture notes on permutation group theory and on computational algebra, an edition\n(\njoint with A J S Mann and Julia Tompson\n)\nof the papers of\nWilliam Burnside\n, and a number of reviews and minor expository items.\nI have learnt and taught mathematics at all levels from school to postgraduate; the art of lecturing and university teacher training; public understanding of mathematics; relationship of mathematics with other disciplines - especially computation, and philosophy.\nFor more information about Peter Neumann's books, see\nTHIS LINK\n.\nIt is worth noting that we strongly support Tony Mann's opinion about Peter's books when he writes\n[\n16\n]\n:-\nPeter himself should have written much more - but he always said \"There are already too many books\". While this is true, more books by Peter would have benefitted us all.\nFor more information about Peter Neumann's papers on the history of mathematics, see\nTHIS LINK\n.\nColin Campbell and myself\n[\nEFR\n]\norganised Groups St Andrews\n1985\nto be held July-August\n1985\nin St Andrews. In May\n1983\nwe invited Peter Neumann, and four other leading group theorists, to be main speakers and each give a series of five lectures. All accepted with Peter being the only one to offer us a choice of topics that he could talk on. He offered a course on computational group theory or on the history of group theory, and another couple of topics which I can no longer remember. We chose his computational group theory topic and he delivered the course\nSome algorithms for computing with finite permutation groups\n. The Introduction begins:-\nLet\nΩ\n\\Omega\nΩ\nbe a finite set of size n and G the subgroup of\nS\ny\nm\n(\nΩ\n)\nSym (\\Omega )\nS\ny\nm\n(\nΩ\n)\ngenerated by a collection\ng\n1\n,\ng\n2\n,\n.\n.\n.\n,\ng\nk\ng_{1}, g_{2}, ..., g_{k}\ng\n1\n​\n,\ng\n2\n​\n,\n.\n.\n.\n,\ng\nk\n​\nof explicitly known permutations. How do we compute the composition factors of G?\nThis is one of the many mathematical questions where theory and practice differ  greatly. In theory we might work through the elements of G one by one seeking g such that the normal closure\nN\n:\n=\n<\ng\nG\n>\nN := < g^{G} >\nN\n:\n=\n<\ng\nG\n>\nis a non-trivial proper subgroup of G; if no such g exists the G is simple, otherwise we treat N and G/N in the same way until all the composition factors have been found. In practice this does not work. There are two reasons. The first is obvious - such a search will be absurdly slow even for permutation groups of quite small degree. The second is more subtle and more significant - we have at present no satisfactory way of handling a quotient groups G/N as a permutation group except in certain special cases.\nHis Acknowledgements begin as follows:-\nMany of the ideas in this paper were hatched during the\nLondon Mathematical Society\nSymposium on Computational Group Theory held in Durham from\n30\nJuly to\n9\nAugust\n1982\n, and during a visit that I paid to the University of Sydney from\n20\nMarch to\n20\nApril\n1983\n. I am grateful to the organisers of that conference for inviting me to come there - as a stranger in paradise - and to the Mathematical department of the University of Sydney for its genial hospitality.\nPeter Neumann attended many of the following Groups St Andrews conferences. He added so much to these meetings with the extraordinary breadth and depth of his knowledge across the whole range of group theory. He invited us to hold Groups St Andrews\n2001\nin Oxford and joined the organising committee. Colin Campbell and I\n[\nEFR\n]\nmade a number of visits to The Queens' College to meet with Peter and discuss the preparations for the conference. He was very hospitable and his broad knowledge of group theory and group theorists was invaluable.\nPeter Cameron was one of Neumann's research students and posted his memories of Peter in\n[\n6\n]\n:-\nPeter was the ideal supervisor for me. He gave me\nWielandt\n's book on permutation groups to read at the start. After that, he let me find my own direction, but he was always there with suggestions and questions.  ... Peter ran a \"Kinderseminar\" for his research students and selected other people. When I was appointed to a fellowship at Merton College, and had students of my own, I tried to replicate this on a small scale; but, to my great delight, soon Peter invited me and my students to join the Kinderseminar. We would meet at\n11\n, have coffee and chat, and then someone would talk about some interesting mathematics. At the end of the talk, Peter would discretely take the student to one side and go over the talk, not criticising but making friendly suggestions about what could have been done better. If you want to know why all of Peter's students are good lecturers, look no further than this.\nNeumann was a great supporter of mathematics at all levels. He was a founder of the United Kingdom Mathematics Trust\n(\nUKMT\n)\nand it is no exaggeration to say that but for his strong commitment to its operations it may not have survived. The authors of\n[\n15\n]\nwrite:-\nThe UKMT was established in\n1996\n, and Peter was the first Chairman of its Council, a position that he held until\n2004\n. Peter was a very hands-on Chairman of UKMT. He was whole-heartedly involved with many of the Trust's activities, such as mentoring programmes for able students, and marking-weekends, in some of which Sylvia also joined. During the early years of the UKMT people from different backgrounds worked together to build the new organisation with little administrative support. Additional stresses arose when the new UKMT agreed at very short notice to take on the planning, funding and organisation of the International Mathematical Olympiad\n(\nIMO\n)\nfor\n2002\n, after the original host country had to withdraw. This posed a not inconsiderable risk to the future viability of the UKMT. It was thanks to Peter's commitment to enhancing the mathematical experience of talented young people, his acute mind, and his great charm and courtesy that the difficulties were overcome.\nPeter Neumann invited me\n[\nEFR\n]\nto be the keynote speaker at the British Society for the History of Mathematics Research in Progress meeting held at The Queen's College on\n2\nMarch\n2013\n. Peter invited my wife to come with me and he provided wonderful hospitality including accommodation in the College and an excellent musical event in Queen's College Chapel.\nPeter Neumann has received many awards for his outstanding contributions to mathematics at all levels. He received the\nLester R Ford\nAward from the\nMathematical Association of America\nin\n1987\nfor his Book Review of\nGalois Theory\nby Harold M Edwards. The\nLondon Mathematical Society\nawarded him their Senior\nWhitehead\nPrize in\n2003\n:-\n... in recognition of his contribution to and influence on research into diverse branches of group theory, and for his broad-ranging service to British mathematics over many years.\nIn\n2008\nhe was made an Officer of the Order of the British Empire\n(\nOBE\n)\n:-\nFor services to Education.\nAlso in\n2008\nthe University of Oxford awarded Neumann their Lifetime Teaching Award and, in the same year, he retired and was made an Emeritus Fellow at The Queen's College. In\n2012\nhe was awarded the David Crighton Medal by the\nInstitute of Mathematics and its Applications\nand the\nLondon Mathematical Society\n. You can read the citation for this awarded at\nTHIS LINK\n.\nIn January\n2016\nPeter Neumann was made an honorary Doctor of Science by the University of Hull.\nAfter he retired in\n2008\n, Neumann continued with his usual wide range of activities, lecturing to undergraduates, group theory research, research in the history of mathematics, working for the UKMT, visiting schools, and much more. This all came to a sudden end in February\n2018\nwhen he suffered a major stroke. He made some progress in recovering movement and he was able to leave hospital and return home with regular help from medics and carers. When an infection struck in\n2020\nhe moved to Cumnor Hill House care home where an electric wheelchair gave him some freedom. His mind was still sharp, however, and Sylvia visited every afternoon and they did the Guardian crossword together. Sadly, with the Covid epidemic at its peak, he contracted the disease which, together with his other health issues, was too much. He died\n10\ndays before his\n80\nth birthday. His funeral was held on the\n18\nJanuary\n2021\nin the Chapel of The Queen's College.\nI\n[\nEFR\n]\ntotally share Tony Mann's final thoughts in\n[\n16\n]\n:-\nI owe so much to Peter - and so do many many others. His contribution to mathematics goes far beyond his own mathematical discoveries, significant though these are. He taught, inspired and encouraged so many others, and was much loved as well as much admired.\nA final thought from Adam McBride\n[\n17\n]\n:-\nDuring his long professional life he enriched the lives of many people, not only mathematically but through his consideration and kindness. Many will also have enjoyed social occasions at his home and in college where he was a most generous host. He leaves a legacy of which his family can be immensely proud.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}