{
  "nome_completo": "Philon of Byzantium",
  "nome_curto": "Philon",
  "ano_nascimento": "280 BC",
  "ano_morte": "220 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Philon/",
  "lugar_nascimento": "Byzantium (Turkey)",
  "lugar_morte": null,
  "biografia": "Only a few references to\nPhilon of Byzantium\nexist in the literature. He is mentioned by\nVitruvius\nwho was a Roman architect and engineer.\nVitruvius\n(1\nst\ncentury BC\n)\nwas the author of the famous treatise\nDe architectura\n(\nOn Architecture\n)\nand in this work he gives a list of twelve inventors of machines which include\nArchytas\n(\nsecond in the list\n)\n,\nArchimedes\n(\nthird in the list\n)\n, Ctesibius\n(\nfourth in the list\n)\n, and Philon of Byzantium\n(\nsixth in the list\n)\n.\nHeron\nof Alexandria mentions a work by Philon\nOn automatic theatres\nwhich in fact forms part of his\nMechanics\ntreatise.\nEutocius\nalso mentions Philon and cites a work by him on the\nduplication of the cube\nand this material is again contained in his\nMechanics\ntreatise. Perhaps the most information about Philon's life, and this is very little indeed, comes from the only work of his which has survived\n(\nat least major parts have survived\n)\nMechanics\n. In this treatise he writes about the catapult which was recently invented by Ctesibius, who we mentioned above as coming before Philon in the list of inventors given by\nVitruvius\n. From this information we can date Philon fairly accurately and we know that he wrote his treatise\nMechanics\naround\n250\nBC.\nBefore describing the contents of Philon's masterpiece\nMechanics\nlet us give some small details of Philon's life which can be deduced from comments which he makes in this text. Certainly Philon describes journeys he had made to Rhodes and to Alexandria to study catapults. He appears to have discussed military applications of catapults with the rulers of Alexandria. The tone here would suggest that Philon was a wealthy man of independent means able to travel in the pursuit of his studies. On the other hand it is possible that he was considered the right sort of person whose advice should be sought on military matters and he may have been earned his living advising military rulers.\nWhat exactly was in Philon's\nMechanics\ntreatise? We know that it had nine books:\n1\n. Introduction\n2\n. On the lever\n3\n. On the building of seaports\n4\n. On catapults\n5\n. On pneumatics\n6\n. On automatic theatres\n7\n. On the building of fortresses\n8\n. On besieging and defending towns\n9\n. On stratagems\nThe text of Books\n4\n,\n5\n,\n7\nand\n8\nhas survived, while the rest has been lost. However Philon has the habit of cross referencing fully in his work so we can learn quite a bit about what was contained in the lost sections by studying the surviving ones. The style of the treatise is rather unusual since the books are composed of many short chapters. For example Book\n8\nconsists of two sections with\n75\nchapters in the first section and\n111\nchapters in the second section.\nThis treatise is not just a work on what we would consider today to be applied mathematics. For example Book\n8\n, in addition to describing ways of defending town walls from both land and sea attack, also stresses how important it is to have a good doctor available. Philon argues that those badly injured in attacks so that they cannot work again should be awarded pensions, and that the wives of those killed should be provided for.\nTo capture a town through a siege one must, according to Philon, make proper use of machines such as catapults and other war engines. In addition one must try to starve the inhabitants of the town, bribe suitable people to assist you, use his poison recipes to kill the inhabitants, and also use cryptography to pass secret messages. It would be interesting to have details of his proposed cryptography but unfortunately Philon's work on this topic has been lost.\nOne important mathematical contribution by Philon was to the problem of duplicating the cube. At first sight this seems far removed from the topics we have noted that are in his treatise. However, this is not so for Philon examines the following problem. Given a catapult, how do you make a second catapult which can fire a missile twice as heavy as the first. To do this it is necessary to construct a machine whose linear dimensions are increased exactly the amount necessary for its volume\n(\nthe cube of the linear dimension\n)\nto double.\nHis method of duplicating the cube is similar to that due to\nHeron\n. The solution is effectively produced by the intersection of a circle and a rectangular\nhyperbola\n.",
  "math_areas": []
}