{
  "nome_completo": "Philipp Frank",
  "nome_curto": "Philipp Frank",
  "ano_nascimento": "1884",
  "ano_morte": "1966",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frank/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Philipp Frank\n's father was Ignaz Frank and his mother was Jenny Feilendorf. Philipp studied physics at the University of Vienna obtaining a doctorate in theoretical physics in\n1907\nafter working under\nBoltzmann\n. He described his student days as follows\n(\nsee for example\n[\n1\n]\n)\n:-\n... the domain of my most intensive interest was the philosophy of science. I used to associate with a group of students who assembled every Thursday night in one of the old Viennese coffee houses ... We returned again and again to the central problem: How can we avoid the traditional ambiguity and obscurity of philosophy? How can we bring about the closest possible rapprochement between philosophy and science?\nThe group of students that Frank is describing in this quotation is the group who would eventually become known as the Vienna Circle. Other members of the group at this time were\nHahn\n, von\nMises\n, and an economist and sociologist, Otto Neurath. The group developed the philosophy of logical positivism, investigating scientific language and scientific methodology. During this time Frank became a friend of von\nMises\n, who obtained his doctorate from Vienna in the\n1907\n, the same year as Frank. It was a friendship which would last throughout their lives and involve joint work.\nIn\n1907\nFrank wrote an important paper on causality.\nEinstein\nwas impressed by Frank's ideas which he put forward in this paper and the resulting discussions led to another life long friendship, this time between Frank and\nEinstein\n. Both loved the philosophy of science and the ideas of each would influence the other. Frank received his\nhabilitation\nand was appointed a lecturer in the University of Vienna in\n1910\n. On\nEinstein\n's recommendation Frank succeeded him to the chair of theoretical physics in the German University of Prague in\n1912\n.\nFrank,\nHahn\nand\nvon Mises\nbecame part of the somewhat larger group active during the\n1920\ns in the Vienna Circle of Logical Positivists. Important influences on their thinking came from several other mathematicians and scientists interested in philosophy:\nRiemann\n,\nHelmholtz\n,\nHertz\n,\nBoltzmann\n,\nPoincaré\n,\nHilbert\n, and\nEinstein\n. More on the philosophy side, influences came from\nFrege\n,\nRussell\nand\nWhitehead\n. Frank, describing how he felt that science, mathematics and philosophy were linked, explained that\n[\n1\n]\n:-\n... he sought always to achieve a balanced outlook on man and nature; and for him physics not only provided reliable answers to particular technical problems but also raised and illuminated important questions concerning the nature, scope, and validity of human knowledge. ...\n[\nhe\n]\nbelieved that a stable perspective on life can best be achieved through the critical, intellectual method of modern natural science.\nThe friendship between Frank and\nvon Mises\ndeveloped into a collaboration in the mid\n1920\ns. They were joint authors of the lengthy two volume book\nDifferentiagleichungen und Integralgleichungen der Mechanik und Physik\nⓉ\n(\nDifferential and integral equations of mechanics and physics\n)\nwhich was published in\n1925\n. Frank had married on\n16\nNovember\n1920\n, his wife being Hania Gerson.\nFrank remained at the German University in Prague until\n1938\n. The Munich Agreement in that year saw large parts of the Czechoslovak republic surrendered to Germany. German troops along with Hitler himself had entered Austria on\n12\nMarch\n1938\n, and a Nazi government had been set up there. Political pressure was put on Frank and other members of the Vienna Circle, and the group disbanded with many of its members including Frank fleeing to the United States.\nIn the United States Frank was first appointed as a visiting lecturer, then made a lecturer in physics and mathematics at Harvard. He was joined at Harvard by his friend von\nMises\n. In\n1947\nFrank wrote an excellent biography\nEinstein: His Life and Times\n.\nFrank worked on a wide range of topics in mathematics, and when one takes into account his publications on physics and philosophy it was a truly remarkable breadth. In mathematics he worked on the\ncalculus of variations\n,\nFourier series\n, function spaces, Hamiltonian geometrical optics,\nSchrödinger\nwave mechanics, and relativity.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}