{
  "nome_completo": "Philip Bernard Stein",
  "nome_curto": "Philip Stein",
  "ano_nascimento": "1890",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stein_Philip/",
  "lugar_nascimento": "Germeneitz (near Švėkšna), Šilutė District Municipality, Klaipeda County, Lithuania",
  "lugar_morte": "London, England",
  "biografia": "Philip Stein\nwas the son of Solomon Zebulin Stein\n(\nc.\n1854\n-\n1909)\nand Soroh Leah Malnik\n(\nc.\n1853\n-\n1930)\n. The family were Jewish. Solomon and Soroh were married on\n21\nNovember\n1974\nin Vorna, Lithuania. Philip was the brother of Minnie Stein\n(\nborn\n1882\nand went on to marry Harry Shore\n)\n, Bessie Stein\n(\nborn\n1883\nand went on to marry Isaac Schock\n)\n, Rachel Stein\n(\nwho went on to marry Benjamin Abraham Davis\n)\n, and Dinah Stein\n(\nborn\n1890\nand went on to marry Max Grodzinski\n)\n. We have given\n25\nJanuary\n1890\nas Philip Stein's birth day, since this is the date he used for his date of birth. However, he did not know the actual date. He wrote about this fact when he wrote about his youth\n[\n3\n]\n:-\nI was born in Lithuania on the estate of a Polish noble. The place was called Germeneitz, and it was near the village of Švėkšna, which also belonged to this noble. My official birthday is the twenty-fifth of January\n1890\n. ... I do not know my actual birthday to within six months. My mother was ill at the time of my Bar Mitzvah, so there was no celebration to fix the day into my memory. This day is anyway within six months of my actual birthday. ... I still remember Germeneitz in Shvekshna. We lived in Germeneitz until I was about seven. My mother leased the cattle\n(\nmilk\n)\nfrom the Noble's bailiff. The cattle were tended and herded by the Noble's peasants. We had milk and sold it in Švėkšna. Some years ago she bought the crop of the Noble's orchard. Švėkšna was very near the Prussian border and my mother used to take the fruit into Prussia and retail it in the market at Memel or Konigsburg. ... In Germeneitz we lived at one end of a terrace of cottages. The others were occupied by the Noble's peasants. These peasants must have had young children, for before going to Švėkšna to Cheder, I didn't stir far from the house. In the winter anyway I was rarely allowed out of the home at all. I can nevertheless still picture the place in my mind. It was in a hollow. The orchard was on one side of a cove, and there was also a hill on the other side covered by moss. I would wander into the orchard and pick berries or apples,  depending on whether or not the fruit in that year was ours. I would climb up on the hill and then roll down. ...  Shvekshna was practically a Jewish village. There were some Germans who lived on the outskirts. I suppose these were small traders of craftsmen. But essentially it was a purely Jewish village. There was a village square. On one side was a church, a fine brick building. But whether it was Greek Orthodox or Roman Catholic I do not know. I think the latter, as the Lithuanians are Roman Catholic. On the other side there were shops and inns whose customers were mainly Lithuanian peasants. These peasants brought their wares to the market and then, I am sorry to say, usually went on to the inns and spent the proceeds on cheap vodka. It was the restriction on the sale of drink that led to their emigration. From the square there was a lane leading off to a smaller square in which the places of worship for the Jews were situated.\nIn\n1897\nthe Stein family emigrated to Cape Colony in South Africa. Although Cape Colony had been British, it had become independent in\n1872\n(\nit is now part of South Africa\n)\n. Stein attended the Normal College Boy's High School in Cape Town and was awarded a minor bursary of £\n10\ntenable for one year in the School Higher Examination of\n1905\n. After graduating in\n1906\n, he studied at the South African College in Cape Town. At this stage the South African College, although teaching at university level, did not have university status and so could not award degrees. Stein sat the matriculation examination for the South African College in\n1906\nand was awarded a minor exhibition of £\n20\ntenable for one year. In\n1909\n, while at the South African College, Stein won the Ebden Scholarship. This scholarship, to the value of £\n200\nper annum, allowed him to study abroad for three years. He entered Caius College, Cambridge and spent the three years financed by the scholarship studying the Mathematical Tripos. Returning to South Africa, Stein had a number of different posts before being appointed to the University Technical College of Natal in Pietermaritzburg.\nW Natal Roseveare was appointed as the first professor of mathematics at the newly founded University Technical College of Natal in Pietermaritzburg in August\n1910\n. From its foundation the College\n[\n2\n]\n:-\n... enjoyed some measure of independence in that ... its own teaching staff now participated in constructing the syllabi and examined their own students, with the advice of external examiners, instead of assisting them in 'spotting' questions that were set and marked by remote strangers. In addition, within a few years it was authorised to conduct graduation ceremonies in Pietermaritzburg ...\nRoseveare wrote a number of papers including:\nA chapter on algebra\n(1903)\n,\nOn convergence of series\n(1905)\n,\nOn 'Circular Measure' and the product forms of the sine and cosine\n(1905)\n,\nExpansions of trigonometrical functions\n(1905)\n, and\nExpansions of functions in general\n(1905)\n. Stein joined the staff at the Technical College when he was appointed as a lecturer in\n1920\n. Earlier that year he had married Lily Rollnick, a daughter of Wolf Vulf Rollnick and Chaya Johanna Hurwitz, on\n15\nFebruary\n1920\nin South Africa. They had three children: Sylvester Roman Stein\n(\nborn\n25\nDecember\n1920\nin Cape Town, he became a writer, journalist, actor and anti-apartheid campaigner\n)\n, Zena Stein\n(\nborn\n7\nJuly\n1922\nin Durban, she became a epidemiologist and anti-apartheid campaigner married to Mervyn Susser\n)\n, and Wilfred Donald Stein\n(\nborn in Durban on\n26\nNovember\n1931\n, he studied in South Africa, England and the USA and became Professor of Biophysics at the Hebrew University of Jerusalem\n)\n.\nUp to this point Stein was not a research mathematician and he had never studied for a doctorate. Roseveare encouraged Stein to undertake research and, in\n1926\n, he took leave of absence from the Technical College and went, with his family, to the University of Cambridge in England. At Cambridge,\nJ E Littlewood\nwas his thesis advisor and he undertook research on the theory of functions. He was awarded his doctorate in\n1931\nfor two dissertations:\n1\n.\nOn Equalities For Certain Integrals In The Theory Of Picard Functions\n; and\n2\n.\nOn The Asymptotic Distribution Of The Values Of An Integral Function\n. While undertaking research at Cambridge he produced to results which appeared in his paper\nOn a theorem of M Riesz\n(1933)\n. It is this paper\n[\n1\n]\n:-\n... by which he is best known to workers in the theory of functions of real and complex variables. This gives a proof of the fundamental result of\nMarcel Riesz\non which the theory of conjugate functions in\nL\np\nL_{p}\nL\np\n​\nspaces depends. The proof involves an ingenious use of\nGreen\n's formula and is still the most elegant proof of the theorem: for this reason it is frequently quoted in the literature and has served as a model for arguments, in particular those of\nDonald Spencer\n, generalizing the\nRiesz\ninequality.\nRalph Fowler\n, who made important advances in astronomy, had worked on statistical mechanics in the\n1920\ns. He had come across a problem concerning trigonometric functions which had applications to statistical mechanics and he had posed the problem to\nJ E Littlewood\n. While Stein was at Cambridge,\nJ E Littlewood\nhad told him about the problem and Stein solved it in a highly satisfactory way. His solution appears in the paper\nOn the real zeros of a certain trigonometric function\n(1935)\n.\nContinuing to work at the University Technical College of Natal, Stein began to collaborate with his colleague R L Rosenberg in the late\n1940\ns. Rosenberg was interested in problems in numerical analysis and their collaboration led to their joint paper\nOn the solution of linear simultaneous equations by iteration\n(1948)\n. The authors acknowledge that they \"are indebted to Dr\nOlga Taussky\nfor advice on some points.\" In fact\nOlga Taussky-Todd\n[\n1\n]\n:-\n... writes that this paper is now a classic. As a result of this Stein visited the National Bureau of Standards and there wrote three papers 'The convergence of Seidel iterants of nearly symmetric matrices'\n(1951)\n, 'A note on bounds of multiple characteristic roots of a matrix'\n(1952)\nand 'Some general theorems on iterants'\n(1952)\n. ... In the\n1960\n's Professor\nOlga Taussky-Todd\nsuggested further problems to Stein; these are not yet completely solved, but he gave a partial solution of one in 'On the ranges of two functions of positive definite matrices'\n(1965)\nand wrote another much quoted paper with Allen Pfeffer, 'On the ranges of two functions of positive definite matrices'\n(1967)\n, a former student of\nJohn Todd\n. This is concerned with the problem of\nLyapunov\nstability of matrices.\nLionel Cooper\n, the author of\n[\n1\n]\n, attended the South African College School in Cape Town from\n1924\nto\n1931\n. In his final year at school,\nCooper\ntook the examinations for university entrance conducted by Philip Stein of the University of Natal. Stein said that\nCooper\n's mathematics paper was the best he had ever seen.\nLionel Cooper\nwrites about Stein\n[\n1\n]\n:-\nHis active mathematical life continued for many years after his retirement: he taught for some years in the University of Makerere and also for a period in University College, Cardiff. Stein was an excellent and conscientious teacher and a force stimulating mathematics at all levels in South Africa for the many years of his active life. His quiet humour, his liberal outlook and his general reasonableness will be remembered by his many friends.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}