{
  "nome_completo": "Philippe Flajolet",
  "nome_curto": "Philippe Flajolet",
  "ano_nascimento": "1948",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flajolet/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "Paris, France",
  "biografia": "Philippe Flajolet\n's grandfather, also named Philippe Flajolet\n(1885\n-\n1948)\n, was an astronomer who worked at the Observatory at Lyon. Philippe, the subject of this biography, was brought up in Lyon where he entered the Lycée Ampère in\n1958\n. He spent seven years at the Lycée, retaining fond memories of these years, where he was taught mathematics by A Giberne and Georges Thovert. Graduating with his Baccalauréat in\n1966\n, he entered the École Polytechnique in\n1968\nwhere he studied for three years. In\n1971\n, after graduating from the École Polytechnique, he joined the Institut National de Recherche en Informatique et en Automatique where he was appointed as a junior researcher. He continued to work at the Institut for the rest of his career.\nWhile at the École Polytechnique, Flajolet had become interested in the theory of computing and the theory of languages by reading the works of Louis Comtet,\nLeonard Euler\n,\nDonald Knuth\nand\nSrinivasa Ramanujan\n. It was Maurice Paul Nivat who recruited Flajolet to work at the Institut National de Recherche en Informatique et en Automatique but, in addition to him, Jean Vuillemin and\nMarcel-Paul Schützenberger\n, who had been appointed as Professor in the Faculty of Sciences at the University of Paris VII in\n1970\n, were major influences on the young researcher. He worked closely with a colleague, Jean-Marc Steyaert, and they collaborated in writing papers such as:\nComplexité des problèmes de décision relatifs aux algorithmes de tri\n(1972)\n;\nA class of non-recursive sorting algorithms\n(1973)\n; and\nDecision problems for multihead finite automata\n(1973)\n. Flajolet and Steyaert presented\nUne formalisation de la notion d'algorithme de tri non récurrent\nⓉ\n(\nA formalization of the concept of a one-time sorting algorithm\n)\nas a joint work to the Université de Paris VII for their Ph.D.'s in\n1973\n. Flajolet presented his\nHabilitation\nthesis\nAnalyse d'algorithmes de manipulation d'arbres et de chiers\nⓉ\n(\nAnalysis of algorithmic manipulation of trees and files\n)\nto Université de Paris XI, Orsay in\n1979\nand was awarded the degree of Doctorat ès Sciences both in mathematics and computer science.\nIn\n1976\n, together with Jean Vuillemin, he founded the ALGO group within the Institut National de Recherche en Informatique et en Automatique which had as its main task the analysis of algorithms. We have seen that his Doctorat ès Sciences thesis of\n1979\nwas on this topic, but many of his papers looked at various aspects of this topic. For example\n(\nwith Jean-Marc Steyaert\n)\nOn the analysis of tree-matching algorithms\n(1980)\n,\n(\nwith Guy Fayolle, Philippe Flajolet, Micha Hofri, and Philippe Jacquet\n)\nAnalysis of a stack algorithm for random multiple-access communication\n(1983)\n,\nMethods in the analysis of algorithms\n(1983)\n,\nMathematical methods in the analysis of algorithms and data structures\n(1988)\n, and the book, written with Robert Sedgewick,\nAn Introduction to the Analysis of Algorithms\n(1996)\n. Flajolet became head of the ALGO group in\n1981\n.\nThe authors of\n[\n5\n]\n,\n[\n6\n]\n,\n[\n7\n]\n,\n[\n8\n]\n,\n[\n9\n]\nwrite:-\nDuring his forty years of research, he contributed nearly\n200\npublications, with an important proportion of fundamental contributions and representing uncommon breadth and depth. He is best known for fundamental in mathematical methods for the analysis of algorithms, and his research also opened new avenues in various domains of applied computer science, including streaming algorithms, communication protocols, database access methods, data mining, symbolic manipulation, text-processing algorithms, and random generation. He exulted in sharing his passion: his papers had more than a hundred different co-authors and he was a regular presence at scientific meetings all over the world.\nOne of the important new areas that he developed was 'analytic combinatorics'. Let us give his own description of this topic, as he described it in the Preface to the remarkable book, written jointly with Robert Sedgewick,\nAnalytic Combinatorics\n(2009)\n. Let us note that this book in many ways can be seen as summing up his life-long work:-\n'Analytic combinatorics' aims at predicting precisely the properties of large structured combinatorial configurations, through an approach based extensively on analytic methods. Generating functions are the central objects of study of the theory. 'Analytic combinatorics' starts from an exact enumerative description of combinatorial structures by means of generating functions: these make their first appearance as purely formal algebraic objects. Next, generating functions are interpreted as analytic objects, that is, as mappings of the complex plane into itself. Singularities determine a function's coefficients in asymptotic form and lead to precise estimates for counting sequences. This chain of reasoning applies to a large number of problems of discrete mathematics relative to words, compositions, partitions, trees, permutations, graphs, mappings, planar configurations, and so on. A suitable adaptation of the methods also opens the way to the quantitative analysis of characteristic parameters of large random structures, via a perturbational approach. The approach to quantitative problems of discrete mathematics provided by analytic combinatorics can be viewed as an operational calculus for combinatorics organized around three components.\n'Symbolic methods' develops systematic relations between some of the major constructions of discrete mathematics and operations on generating functions that exactly encode counting sequences.\n'Complex asymptotics' elaborates a collection of methods by which one can extract asymptotic counting information from generating functions, once these are viewed as analytic transformations of the complex domain. Singularities then appear to be a key determinant of asymptotic behaviour.\n'Random structures' concerns itself with probabilistic properties of large random structures. Which properties hold with high probability? Which laws govern randomness in large objects? In the context of analytic combinatorics, these questions are treated by a deformation\n(\nadding auxiliary variables\n)\nand a perturbation\n(\nexamining the effect of small variations of such auxiliary variables\n)\nof the standard enumerative theory.\nFlajolet received many honours throughout his career. He was awarded the Grand Prix Scientifique by the Union des assurances de Paris in\n1986\n, the Michel Monpetit prize from the French\nAcademy of Sciences\nin\n1994\n, and the Silver Medal from the French National Centre for Scientific Research in\n2004\n. He was elected as a corresponding member of the\nAcademy of Sciences\nin\n1993\nand a full member on\n18\nNovember\n2003\n. He was elected as a member of the Academia Europaea in\n1995\n, and then he was elected to the European Academy of Sciences. He was made a knight of the Légion d'Honneur in July\n2010\n. In\n1998\n, to celebrate his\n50\nth\nbirthday, the journal\nAlgorithmica\nissued a special part. This part contains Helmut Prodinger and Wojciech Szpankowski's survey article\nPhilippe Flajolet's research in analysis of algorithms and combinatorics\n. Ten years later, his\n60\nth\nbirthday was marked with a Colloquium held in Paris on\n1\n-\n2\nDecember\n2008\n, with papers presented at this meeting published in the journal\nDiscrete Mathematics and Theoretical Computer Science\n. A conference, 'Philippe Flajolet and Analytic Combinatorics: Conference in the memory of Philippe Flajolet', was held at Paris-Jussieu,\n14\n-\n16\nDecember\n2011\n. The conference announcement read:-\nThis conference will pay homage to the man as well as the multi-faceted mathematician and computer-scientist. It will also help more people understand his rich and varied work, through talks aimed at a large audience. ... Most of the talks will form a basis for an introduction to the corresponding chapter in Philippe Flajolet's collected works, to be edited soon.\nIndeed, his\nComplete Works\nare being prepared for publication by\nCambridge University Press\nand the seven-volume work is expected to appear in\n2013\n.\nFinally, let us give the vivid picture of Flajolet as given by Luc Devroye\n[\n3\n]\n:-\nThe image that is etched in my mind is that of Philippe Flajolet happily purring while listening to a great exposition by one of his students or colleagues. At the first opportunity, he would shout something funny in the direction of the speaker to show his appreciation. He was the community's cheerleader. The inside of his car has never been cleaned, his hair camouflaged a biological experiment, his shirts were always untucked, and yet, wherever he went, he was inevitably surrounded by friends and followers, admired for his brilliance and wit, and revered for his guidance and generosity. ... he was a master of mathematical illustration. He liked to show that craft off in his passionate talks, which grew more intense with every tick of the clock, to end up in overtime. On one occasion, I saw the last button of his shirt pop off just before the final slide.\n[\nHe started wearing Indian-style shirts above his belt in the last decade of his life to avoid such events.\n]\nOne of his other passions was listening. His seminar series in Versailles was legendary. It was an honour to be invited. And Philippe listened, purred, teased, shouted, applauded, and acted up - anything short of throwing a paper airplane at the speaker with a heart drawn on its wings. He was the glue that kept the community together.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Statistics"
  ]
}