{
  "nome_completo": "Pierre Humbert",
  "nome_curto": "Pierre Humbert",
  "ano_nascimento": "1891",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Humbert_Pierre/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Humbert\nwas a son of\nGeorges Humbert\nwho also has a biography in this archive. Pierre's mother died when he was very young and he therefore never knew her. However, his father remarried when Pierre was about nine years old so he at least had a step-mother from this time.\nAll of Pierre Humbert's school education took place in Paris, and following this he went on to attend the École Polytechnique there entering the famous French university in\n1910\n. After studying in Paris for three years he left for Scotland to undertake research at the University of Edinburgh.\nAt the University of Edinburgh Humbert undertook research under\nWhittaker\nwhose philosophy of mathematics, and of science more generally, fitted in precisely with those of Humbert. His whole career would be influenced by the one year,\n1913\n-\n14\n, which he spent in Edinburgh and in many of his publications\nWhittaker\n's influence can be seen.\nOf course\n1914\nmarks the beginning of World War I and Humbert, despite having rather poor health, joined the army. After receiving a wound Humbert was no longer fit enough to continue to take part in the military action and so he was able to continue his research. He submitted his doctoral thesis\nSur les surfaces de Poincaré\nⓉ\n(\nOn Poincaré surfaces\n)\nin\n1918\nand he received a doctorate in that year. Following this he was appointed to the Faculty of Science at Montpellier as professor of astronomy and, despite travelling widely in France and abroad, he essentially spent his entire teaching career at Montpellier.\nHumbert's father\nGeorges Humbert\nhad gifts which extended beyond mathematics. This was even more true of his son Pierre Humbert who\n[\n1\n]\n:-\n... demonstrated a highly refined sensitivity to culture, devoting attention to literature and music as well as to science. Moreover, he was unsatisfied with the simple juxtaposition of knowledge and religious faith.\nPierre, like his father, was a Roman Catholic and he mixed his religious beliefs with one of his other great loves, namely teaching, in his work for the Joseph Lotte Association which was an organisation for Catholic public school teachers.\nWhittaker\nhad instilled in him an aim which went far beyond mathematics or even science, for he aimed at developing the intellect. He had almost an ancient Greek attitude to scholarship and learning and indeed he did have a deep interest in history although it was in general more recent history than that of ancient Greece. Humbert married the daughter of the astronomer\nHenri Andoyer\nand this, certainly in part, increased his interest in the history of astronomy. He even wrote some articles on the history of mathematics and astronomy with his father-in-law. Specialising in the history of the seventeenth century he wrote particularly on the French astronomers of that period.\nHe also made contributions to mathematics, in particular he wrote on\nelliptic functions\n,\nLamé\nfunctions, and\nMathieu\nfunctions. His main mathematical work from the mid\n1930\ns onwards was in developing the symbolic calculus. He also wrote on applications of the symbolic calculus to mathematical physics.\nHumbert had a fine reputation as a lecturer and also was a talented organiser. He showed his organising skills in his involvement with the French Association for the Advancement of Science.",
  "math_areas": [
    "Calculus"
  ]
}