{
  "nome_completo": "Pierre Maurice Marie Duhem",
  "nome_curto": "Pierre Duhem",
  "ano_nascimento": "1861",
  "ano_morte": "1916",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Duhem/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Cabrespine, France",
  "biografia": "Pierre Duhem\n's father was Pierre-Joseph Duhem, a commercial traveller, and his mother was Alexandrine Fabre. It was a Flemish family. Pierre, the eldest of his parents four children, was born in the Rue des Jeûneurs in Paris after his parents moved there. When he was eleven years old he entered the Collège Stanislas where he proved a brilliant student.\nLeaving the Collège Stanislas with outstanding achievements in Latin, Greek, science, mathematics and other subjects, he had to choose between studying at the École Polytechnique which, in principle, prepared one to be an engineer, and the École Normale, the more academic of the two. Duhem's father wanted him to study science at the École Polytechnique since he wanted his son to follow a technical career. Duhem's mother, on the other hand, wanted him to study Latin and Greek at the École Normale, principally because she feared that a study of science would turn him away from the Roman Catholic beliefs that she had instilled in her children. Duhem was ranked first in the entrance examinations of both institutions but he chose to please neither of his parents by studying pure scientific at the École Normale. He began his studies on\n2\nAugust\n1882\n.\nWhen\nHadamard\narrived at the École Normale Duhem was beginning his third year of study there. However the two quickly became firm friends.\nHadamard\nwrote in\n[\n17\n]\n:-\nIn these long and precious conversations during which, from the moment of my entry to the École, our friendship grew, how I felt him being thrilled by the genius of\nHermite\n, or that of\nPoincaré\n, whose works he followed better than most of us could\n(\nI mean the most specialised in mathematics\n)\n! But in a general way, all the great mathematical ideas, all the one which were truly fruitful, were familiar to him. From this time I owe him revelations, insights\n(\nhow broad, how disdainful of details to the profit of that which was really essential!\n)\nwhich for me, effortlessly and as if unconsciously, replaced long months of study.\nIn\n1884\n, while still at the École Normale, Duhem published his first paper which was on electrochemical cells. Even before receiving his licence in mathematics, Duhem submitted his doctoral thesis in\n1884\n. Suddenly his brilliant career shuddered to a halt. The thesis was on thermodynamic potential in physics and chemistry and in it he defined the criterion for chemical reactions in terms of free energy. In this he was replacing the incorrect criterion which Marcellin Berthelot had put forward twenty years earlier. Quite correctly Duhem criticised Berthelot's theory putting forward a correct alternative. Sadly being right is not always good enough and a scientist as influential as Berthelot was able to arrange for Duhem's thesis to be rejected.\nDuhem knew he was right and boldly published the rejected thesis in\n1886\n. This certainly did not help his relations with Berthelot, as one might imagine, and the bad news for Duhem was that Berthelot became French Minister of Education in\n1886\n. Duhem meanwhile worked on a second thesis, this time wisely choosing a mathematical topic which was less likely to be affected by the fate of his first thesis. His mathematical work on magnetism was accepted in\n1888\nbut he suffered all his life because of Berthelot.\nBefore his second thesis was submitted Duhem was already teaching at Lille. He worked there from the time he took up the appointment on\n13\nOctober\n1887\nuntil\n1893\n. In Lille he lectured on hydrodynamics, elasticity, and accoustics, publishing these lectures in\n1891\n. While in Lille he married Adèle Chayet in October\n1890\n. She died two years later during the birth of their second daughter, who also died. This personal tragedy may have made it harder for him to get on with his superiors in Lille, something he always found hard despite having many good personal friendships.\nIt was after a dispute with the Dean, M. Demartres, that Duhem requested a move from Lille and was appointed maître de conférence at Rennes in October\n1893\n. Arriving in Rennes he found that it was not well equipped for his work and he at once requested another post. He became professor of theoretical physics at the University of Bordeaux on\n13\nOctober\n1894\nbut a move to Paris, which a scientist of his outstanding ability would naturally expect, was blocked. Jaki writes in\n[\n4\n]\n:-\nIn spite of having grown aware of Duhem's scientific triumph over him, Berthelot could not bring himself to acknowledge this to the extent of letting him obtain a chair in Paris. At stake was the renown of the theoretical interpretation which Berthelot gave to his vast and most valuable experimental researches. It was all too human of Berthelot to protect that interpretation from Duhem's devastating criticism which, if delivered from a chair in Paris, would have forced Berthelot into the open. Herein lies the clue to the slighting which affected Duhem for thirty years, from his first doctoral dissertation to his very death, that is his whole academic career. Without a careful look at it a presentation of Duhem's life would not appear that poignant drama which it actually was.\nHadamard\nhad been in Bordeaux for a year when Duhem took up the chair there. He writes in\n[\n17\n]\n:-\nFor my part, our meeting again at the Faculté des Sciences of Bordeaux gave me the good fortune of supplementing my reading with invaluable and constant exchanges of views. It is to this reading, to these exchanges of views, that I owe the greater part of my later works, almost all of which deal with the calculus of variations, the theory of Hugoniot, hyperbolic partial differential equations,\nHuygens\n' principle. Duhem himself returned to almost all these questions in the continuation of his immense work, and most of the theories which he had so happily and so clearly explained, suggested to him sometimes some observations on details, sometimes some additions of fundamental importance.\nOne would have to add that Duhem's thesis was not the only reason that he did not achieve the appointment in Paris. As well as the scientific dispute, Duhem was at odds with Berthelot on religious issues too. In addition as Miller writes in\n[\n1\n]\nhe:-\n... was of a contentious and acrimonious disposition, with a talent for making personal enemies over scientific matters.\nAfter becoming a corresponding member of the\nAcadémie des Sciences\non\n30\nJuly\n1900\n, in the following year he again requested a move from Bordeaux but again it was refused.\nFew scientists have contributed in works of leading importance, as Duhem did, to the philosophy of science, the historiography of science, and science itself. One has to see much of his writings, however, strongly influenced by his ultra-Catholic views which prevented him approaching subjects with an open mind. His mother had not wanted him to study science in case science would diminish his religious beliefs. Perhaps in the event the opposite happened and his religious beliefs played too large a part in formulating his scientific beliefs. These comments, however, should not be taken as in any way lessening the importance of the views that Duhem put forward in all three areas of his interests.\nHis interests in science itself were mainly in the area of mathematical physics, and in particular thermodynamics, hydrodynamics, elasticity, mathematical chemistry, and mechanics. He viewed mechanics as a special case of a more general theory of space and he considered that a generalised version of thermodynamics would provide a theory to explain all of physics and chemistry. The paper\n[\n27\n]\nconsiders Duhem's:-\n... unification of theoretical physics: the thermodynamical potentials, the Lagrangian analytical formalism and Duhem's philosophical conception of theoretical physics. The mathematical aspects of this unification and Duhem's priority in the axiomatization of thermodynamics are emphasized.\nIn many ways Duhem can be seen as very modern in his approach. He would begin by setting up axioms which the physical system that he was studying satisfied. He then studied in depth the consequences of the initial axioms deducing properties of the physical system from mathematical theorems developed from the axioms alone. He was opposed, however, to studying mathematical problems which did not arise from physical situations.\nHis contributions to thermodynamics are of major importance and he also studied magnetism following the work of\nGibbs\nand\nHelmholtz\n. Some of his most important papers on these topics are\nÉtude sur les travaux thermodynamiques de J Willard Gibbs\nⓉ\n(\nStudy on the thermodynamic work of J Willard Gibbs\n)\n(1887)\nand\nCommentaire aux principes de la theormodynamique\nⓉ\n(\nCommentary on the principles of theormodynamics\n)\n(1892)\n. Three major treatises are\nThermodynamique et chimie\nⓉ\n(\nThermodynamics and chemistry\n)\n(1902)\n, the two volume work\nRecherches sur l'hydrodynamique\nⓉ\n(\nResearch on hydrodynamics\n)\n(1903\n-\n4)\n, and\nRecherches sur l'élasticité\nⓉ\n(\nResearch on elasticity\n)\n(1906)\n.\nAs well as his major contributions to science he was led to write articles of major importance on the philosophy of science. His approach was very much in line with the way that he went about his scientific studies as we have outlined above. He wrote:-\nA physical theory ... is a system of mathematical propositions, deduced from a small number of principles, which has the object of representing a set of experimental laws as simply, as completely, and as exactly as possible.\nAs one might imagine, Duhem disagreed with\nPoincaré\non many aspects of the philosophy of science and the two engaged in a vigorous debate. One of his most important works on philosophy of science was\nLa Théorie physique, son objet et sa structure\nⓉ\n(\nPhysical theory, purpose and structure\n)\n(1906)\n.\nIf scientific work itself led Duhem towards the philosophy of science, then in turn the philosophy of science led him towards the history of science. His paper\nL'évolution de la mécanique\nⓉ\n(\nThe evolution of mechanics\n)\nin\n1902\nis really an article on the philosophy of science but it is based heavily on using historical examples. Earlier important work on the history of science was\nLes théories de la chaleur\nⓉ\n(\nTheories of heat\n)\npublished in\n1895\n. His most important work on the history of science was, however, research which showed that the period from\n1200\nonwards was not a period when science had been ignored. Of course he was very keen to show that this was the case since the Catholic Church had been blamed by many for preventing scientific work during this period.\nWhile working on\nLes origines de la statique\nⓉ\n(\nThe origins of statics\n)\nin the late autumn of\n1903\n, Duhem came across the scientist\nJordanus Nemorarius\nwho worked before\nLeonardo da Vinci\n. Until that time Duhem had accepted the commonly held view that there had been no scientific work in the Middle Ages. It was this surprise which led Duhem to look for other scientists who worked before the development of Renaissance mechanics. His most famous works in this area include\nÉtudes sur Léonard de Vinci\nⓉ\n(\nStudies of Leonardo da Vinci\n)\n(1906\n-\n13)\n. In\n1913\nhe began publication of\nLe Système du monde, Histoire des doctrines cosmologiques, de Platon à Copernic\nⓉ\n(\nThe World System: history of cosmological doctrines from Plato to Copernicus\n)\n(1913\n-\n17)\nbut only\n5\nof the intended\n10\nvolumes were written before his death.\nDuhem saw different national characteristics lead to different approaches to science. He disliked British science, in particular the work of\nMaxwell\n, and he described it as broad and shallow while he said that French science was narrow and deep. German sciences he claimed were highly geometrical, which for Duhem was a criticism for he considered an approach using an analytical style of mathematics to be far superior to a geometrical one.\nHadamard\nwrites\n(\nsee for example\n[\n7\n]\n)\n:-\nAt the beginning of the first World War one of our greatest scientists and historians of sciences, the physicist Duhem, was misled by\n[\nnationalistic passions\n]\n. ... In a rather detailed article, he depicts German scientists, especially mathematicians, as lacking intuition or even deliberately setting it aside ...\nLate in his career Duhem was offered a professorship in Paris as a historian of science and not as a mathematical physicist. Duhem refused the chance to work in Paris that he had always longed for saying that he was a mathematical physicist and did not want to get to Paris through the back door.\nHe died while on a walking holiday in Cabrespine. Some reports say it was a heart attack, others that he died of a chest infection.",
  "math_areas": [
    "Calculus"
  ]
}