{
  "nome_completo": "Pierre Gassendi",
  "nome_curto": "Pierre Gassendi",
  "ano_nascimento": "1592",
  "ano_morte": "1655",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gassendi/",
  "lugar_nascimento": "Champtercier, Provence, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Gassendi\n's parents were Françoise Fabry and Antoine Gassend. Note that the fact there is no \"i\" on the end of Gassend is not a misprint. In fact Pierre Gassendi was actually given the name Pierre Gassend and only later used the now familiar Gassendi form. The family were peasant farmers, but there is some suggestion that Antoine may have owned the land he farmed which would mean the family were not too poor. Pierre spent his childhood in the village of Champtercier. He was quite a frail child but showed an enthusiasm for reading and writing at a young age. His uncle, Thomas Fabry, was the parish priest and he gave the young Pierre a good educational grounding.\nWhen Pierre was seven years old he was sent to school in Digne, a much larger town across the valley about\n10\nkm from Champtercier. There he learnt Latin and arithmetic and, except for a year spent at school in Riez, he remained in Digne until\n1607\n[\n5\n]\n:-\nAt the age of eleven he so impressed the Bishop of Digne with an oration delivered in Latin at the church in Champtercier that the Bishop is said to have declared that \"this child will one day be the marvel of his century.\" On the secular side, during his last two years at school in Digne the young Gassendi composed prosimetric farces in Latin for his fellow schoolboys to perform in the large houses of the town.\nIn\n1607\n, Gassendi left school in Digne and returned to his native village of Champtercier where he spent the next two years. Then in the autumn of\n1609\nhe went to the University of Aix-en-Provence to study philosophy under Père Philibert Fesaye. He clearly was an exceptional student for when Fesaye was absent he asked Gassendi to take the lecture in his place. From\n1611\n, Gassendi studied theology under Professor Raphaelis and, as part of the course, he learnt Greek and Hebrew. While he was studying at Aix, his father Antoine Gassend died\n(\nin\n1611)\n.\nGassendi was Principal at the College of Digne from April\n1612\nto\n1614\n. He received a doctorate in theology from the University of Avignon in\n1614\nand was ordained one year later. He had already been appointed to the minor role of Chanoine of the Cathedral in Digne in\n1614\n. He held this post until\n1634\nwhen he was elevated to the higher-ranking position of Prévôt. In April\n1615\nGassendi left Provence for the first time, spending the period from April to November in Paris. He had gone there to resolve a dispute concerning his position at Digne, He returned to Aix where he spent the winter of\n1615\n-\n16\n, then conducted his first mass in\n1616\n.\nIn\n1617\nboth the Chair of Philosophy and the Chair of Theology fell vacant at the University of Aix-en-Provence. Gassendi applied for both chairs and was offered both. He chose the Chair of Philosophy, giving the Chair of Theology to his former teacher Père Philibert Fesaye. This appointment as professor of philosophy at the University of Aix was in addition to the positions he held in the cathedral in Digne, which we mentioned above. Gassendi spent six years at Aix where he met Nicolas-Claude Fabri de Peiresc\n(1580\n-\n1637)\nwho became his patron, supporting him financially for many years. Peiresc had attended lectures by\nGalileo\non astronomy and had become so interested that he set up an observatory in\n1610\n. He employed Joseph Gaultier to work for him there and the two were the first people to observe the Orion Nebula in\n1610\n. When Gassendi arrived in Aix he lived at the house of Joseph Gaultier whom he described as having\n[\n9\n]\n:-\n... no difficulty in equalling all the ancient and modern philosophers and mathematicians.\nJean-Baptiste Morin\nalso lived in Gaultier's house for he had been employed by Peiresc to assist Gaultier in making observations. Later\nMorin\nand Gassendi would become involved in a public dispute but at this stage they were good friends. Gassendi quickly learnt astronomy from Gaultier and so Peiresc also employed Gassendi as part of the team to assist in his project of computing the times of the four moons of Jupiter. We also have records of Gassendi and Gaultier observing a comet in\n1618\n, an eclipse of the moon in\n1620\n, and an eclipse of the sun in\n1621\n.\nGassendi's position at the University of Aix only lasted until\n1623\nwhen the Jesuit order took control of the university and he was forced to leave. This was not because the Jesuits had any particular objection to the material that Gassendi was teaching, rather it was just that they dismissed all those who were not Jesuits. He did not hold any further academic posts until\n1645\nwhen he was appointed professor of mathematics at the Collège Royale in Paris. However, there is over twenty years of Gassendi's career to look at before we reach that point. His first move on being dismissed from his chair was to travel to Grenoble where he remained until July\n1624\nafter which he resided in Digne. While teaching at Aix he had included his objections to the philosophy of\nAristotle\nin his lectures and he had decided to publish this material. He published\nExercitationes I\nⓉ\n(\nExercises I\n)\n, the first of seven projected volumes of\nExercises in the form of paradoxes against the Aristotelians\n, in Grenoble in\n1624\n. He wrote\n(\nsee for example\n[\n9\n]\n)\n:-\nI always made sure that my students could defend\nAristotle\nproperly. But at the same time, I also provided as appendices doctrines that would undercut\nAristotle\n's dogmas. Indeed, given the place, the characters and the times, it was necessary to do the former. But not to omit the latter was a matter of candour because those doctrines provided true reason for withholding ascent. ...\n[\nI\n]\nbegan to examine the doctrines of other sects to find out whether they might offer something sounder. Although I found perplexities everywhere, none of the doctrines impressed me more than the lauded akatalepsia of the Academics and Pyrrhonians.\nGassendi first met\nMersenne\nin October\n1623\nwhen he visited Paris. He took with him an introduction from Peiresc and soon Gassendi and\nMersenne\nbecame good friends. Through\nMersenne\n, Gassendi quickly became acquainted with many leading scholars. From that time on until\nMersenne\n's death in\n1648\n, whenever Gassendi was in Paris he would visit\nMersenne\nand the two would celebrate mass together.\nMersenne\nlater tried to persuade him to give up mathematics and theology in favour of philosophy. After returning to Provence from Paris, Gassendi wrote to\nGalileo\nwith strong support for his argument that the earth revolves round the sun. Gassendi had been intending to produce six further volumes of his\nExercitationes\nⓉ\n(\nExercises I\n)\nbut at this time he decided to give up the project. He spent the period between\n1625\nand\n1628\nat Grenoble, Aix and Digne. In May\n1628\nhe again travelled to Paris and through his contacts with Peiresc became friendly with François Luillier, the Dupuy brothers, and others from their circle. Pierre and Jacques Dupuy were librarians at the Bibliothèque du Roi, which dated back to the fourteenth century. It had been moved to Paris between\n1567\nand\n1593\n, and catalogued in\n1622\n. Pierre and Jacques Dupuy travelled throughout France amassing books and manuscripts for the library and, after Gassendi met the brothers, he worked at their library undertaking research on\nEpicurus\n.\nHe spent a few months in the Netherlands, travelling there in December\n1628\n. It was to be his only trip outside France and he travelled widely throughout the country. His work\nExamination of the philosophy of the doctor Robert Fludd\nwas first published in Holland in\n1629\n. It had been written at\nMersenne\n's request to present the arguments against Fludd's philosophy. In\n1632\nGassendi published\nMercury seen on the face of the sun\n, which described his observations of the\ntransit\nof Mercury which he observed from Paris in November\n1631\nfollowing the prediction of the event by\nKepler\nin\n1629\n. Gassendi had used a telescope to project the image of the sun onto paper, and so was able to observe the transit. Gassendi continued to publish works on philosophy and astronomy. He believed in atomism and defended a mechanistic explanation of nature, as for example in\nOn the apparent magnitude of the sun on the horizon and overhead\n(1635)\n. Life became more difficult for Gassendi after his patron Peiresc died in\n1637\n. Although Peiresc left books and mathematical instruments to Gassendi in his will, Peiresc's nephew refused to let Gassendi have them. Gassendi went on to write a biography of Peiresc, published in\n1641\n; it is generally considered the first biography of a scholar. Gassendi later wrote biographies of\nCopernicus\n, Puerbach and\nRegiomontanus\n.\nMersenne\nasked Gassendi to review\nDescartes\n'\nMeditations\nwhich he did producing\nObjections\nin\n1641\n.\nDescartes\ndid not take kindly to Gassendi's criticisms and replied with a stinging attack in\nResponses\n. Gassendi was not going to allow matters to rest there, and replied again, this time with\nInstantiae\nwhich began to circulate in Paris in\n1642\n.  Battle lines were drawn, and the two argued their cases in a very public debate. This was not the only public debate that Gassendi was carrying out at this time. The other was with\nMorin\nwho insisted that the earth was at the centre of the universe. Gassendi was a firm believer in the system of\nCopernicus\nand\nGalileo\n, and the argument with\nMorin\nled to him thinking deeply about the scientific case for a sun centred system. In\n1642\nGassendi published\nOn the motion impressed by a moving mover\n. This book was written to argue against those who claimed that the way heavy bodies fell to the earth proved that the earth could not be moving. He had been saddened by the trial of\nGalileo\nin\n1633\n, but had continued to give his full support to\nGalileo\n's theories. The year of\n1642\nwhen this book was published was actually the year in which\nGalileo\ndied following nine years of house arrest. Several attacks on this work of Gassendi resulted in his publishing further work supporting the arguments of\nGalileo\nentitled\nOn the proportion by which heavy bodies are accelerated\n.\nIn\n1645\n, on the recommendation of Cardinal Richelieu, Gassendi was offered the Chair of Mathematics at the Collège Royale in Paris. Although normally an appointment by the king, at this time Louis XIV was only seven years old, and his duties were being carried out by advisors. Gassendi's health was rather poor by this stage in his life, being troubled by a lung complaint. He accepted the Chair of Mathematics on the condition that he would be able to return to Provence when his health was too poor to remain in Paris; he was appointed with this being accepted. He gave his inaugural lecture on\n23\nNovember\n1645\n, with Cardinal Richelieu in the audience. He carried out his duties very successfully, lecturing on astronomical topics and carrying out astronomical research. He was assisted by\nJean Picard\nwho was an outstanding astronomer. They observed a solar eclipse on\n21\nAugust\n1645\n, and lunar eclipses in\n1646\nand\n1647\n. The results of Gassendi's observations and his lectures were written up and published as\nInstitutio astronomica juxta hypotheseis tam veterum, quam Copernici et Tychonis\nⓉ\n(\nAstronomical training according to the hypotheses of both the ancients and Copernicus and Tycho Brahe\n)\nin\n1647\n. Also in\n1647\nhe published\nSyntagma Philosophicum\nⓉ\n(\nPhilosophical Analysis\n)\nwhich was translated into English and published as\nThree Discourses of Happiness, Virtue and Liberty\nin\n1699\n. This English translations begins as follows:-\nMankind having a natural inclination to be happy, the main bent and design of all his actions and endeavours tend chiefly that way. It is therefore an undeniable truth that happiness, or a life free from pain and misery, are such things as influence and direct all our actions and purposes and to the obtaining of them.\nAs he had feared, Gassendi began to find that his health was making it very difficult for him to continue teaching so, as the conditions of his appointment allowed, he left for Provence in\n1648\n. He spent the following years partly in Digne and partly in Toulon; the latter he found particularly good for his health. In\n1649\nhe published\nPhilosophiae Epicuri Syntagma\nⓉ\n(\nAnalysis of the Philosophy of Epicurus\n)\ncontaining his work on Epicurus. Lisa T Sarasohn begins the Preface of\n[\n11\n]\nas follows:-\nIt took the French priest and philosopher Pierre Gassendi more than twenty-five years to complete his project of rehabilitating Epicurus and transforming the philosophy of the ancient atomist into his own system.\nOn\n19\nSeptember\n1648\n, Florin Périer and some friends performed an experiment suggested by\nBlaise Pascal\non the summit of Puy de Dôme. They found that the height of a mercury column at the summit is\n85\nmm less than in Clermont-Ferrand\n1000\nmetres below. Despite Gassendi's lung troubles, he was able to climb a mountain on\n5\nFebruary\n1650\nwith his assistant François Bernier and confirm the findings of the Puy de Dôme experiment. Gassendi remained in Provence until the spring of\n1653\nwhen he felt well enough to return to Paris with his assistant François Bernier. He found a circle of mathematical friends, some old some new, including\nIsmael Boulliau\n,\nBlaise Pascal\n,\nGilles de Roberval\nand\nGirard Desargues\n. They met on Saturday mornings, and probably due to their influence, Gassendi produced an anonymous pamphlet attempting to reassure the people of Paris that the predicted eclipse on\n12\nAugust\n1654\nwould not lead to a disaster. He was not entirely successful as many of the inhabitants of Paris hid in their cellars on the day the eclipse was predicted. During this period he also published a number of other works, but in November\n1654\nhe became seriously ill. When the better weather came in the following spring he recovered a bit but in August\n1655\nhe became seriously ill again. He was bled by doctors and this, not surprisingly, left him much weaker. He pleaded with doctors not to bleed him again but they continued to administer their 'cure'. He died at the home of Henri-Louis Habert de Montmor, who had been his patron during his final spell in Paris. He was buried in the Montmor chapel at Saint Nicolas-des-Champs. His\nComplete Works\nwere published in six volumes three years after his death.\nAntonia Lolordo writes:-\nGassendi's first biographers more or less agree about his character. They describe him as gentle, easy-going, sociable, candid, and - importantly for someone dependent on patronage and the good will of other intellectuals - humble.",
  "math_areas": [
    "Analysis"
  ]
}