{
  "nome_completo": "Piero Borgi",
  "nome_curto": "Piero Borgi",
  "ano_nascimento": "1424",
  "ano_morte": "1494",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borgi/",
  "lugar_nascimento": "Venice, Venetian States (now Italy)",
  "lugar_morte": "Italy",
  "biografia": "Piero Borgi\n's name is sometimes written as Pietro Borghi, in fact Borgi himself used both forms of his name. He was the author of the best-known\n15\nth\nCentury Italian arithmetic books including the highly successful commercial arithmetic book\nQui comenza la nobel opera de arithmetica\nwhich ran to at least seventeen editions. In the first edition of this book Borgi's name appears as \"Piero Borgi da veniesia\" and, other than his books, nothing is known of the man except the fact that, as stated on the title page, he came from Venice. Since we have no information about the man other than his books, we will use this biography to describe the contents of\nQui comenza la nobel opera de arithmetica\n(1484)\nand its long-term influence on textbooks.\nFirst we note that, in addition to the famous\nQui comenza la nobel opera de arithmetica\n(1484)\n, Borgi wrote the books\nAddiones in quibus etiam sunt replicae Mathei Boringii\n(1483)\n,\nLibro de Abacho de arithmetica,\nand\nDe arte mathematiche\n.\nIn\nQui comenza la nobel opera de arithmetica\nBorgi writes that his book is \"Prepared for merchants\". Before looking at the content in detail, however, let us quote some general comments from\nDavid Smith\n's article\n[\n1\n]\n. He writes that Borgi's Arithmetic:-\n... broke away completely from the Greek theory of numbers ... It was purely mercantile, embodying such material as we commonly fond in the manuscripts of the fourteenth and fifteenth centuries, enriched by Borgi's intimate knowledge of the needs and customs of the merchant princes of Venice. It was not an easy book, nor did it pretend to be; it was complete, from the standpoint of the student of commerce in the closing years of the fifteenth century; and it furnished precisely what the merchant's apprentice needed to know in the period of the opening of a new world to the commercial exploitation of the European adventurers in the field of trade.\nIt was not, therefore, for the scholar that Borgi wrote his book ...\n[\nHe devoted\n]\nmuch attention to the elaborate systems of compound numbers which were essential in the days before the advent of the decimal fraction ...\nBorgi began his book by saying that he was not concerned with the Greeks' special numbers such as\nperfect numbers\n, abundant numbers, etc. and that he would only work with numbers which were important to merchants. However, he continued the Greek tradition of not considering\n1\nto be a number. He calls\n2\n,\n3\n,\n4\n, ... ,\n9\ndigits,\n10\n,\n20\n,\n30\n, ...,\n90\narticles, and\n11\n,\n12\n,\n13\n, etc composites. He begins by explaining multiplication, leaving an explanation of addition and subtraction until after division. He assumes, therefore, that the reader has already some expertise in computation. He starts by dealing with integers describing multiplication, division, addition and subtraction in that order. He then moves on to fractions describing the four basic operations in the same order as for integers. Next he gives the Rule of Three and, since the book is intended for merchants, his examples are chosen from partnership, profit and loss etc. Next comes a chapter on barter, then one on alloys, an important topic for merchants since currency was not standard and its value related to the metals of which it was composed. The final section of the book looks at miscellaneous problems using the methods introduced in the earlier chapters.\nBorgi began discussing multiplication of integers by considering multipliers of one figure; he next gave problems in which the multiplier was a small number of two figures; then one in which it was a number of two figures ending in zero. For example, in multiplying\n3456\nby\n20\n, gave the following explanation:\n6\n×\n20\n=\n120\n, of which the\n0\nbelongs to the units place; then\n5\n×\n20\n=\n100\n,\n100\n+\n12\n=\n112\n, of which the\n2\nbelongs to tens' place;\n4\n×\n20\n=\n80\n,\n80\n+\n11\n=\n91\n, of which the\n1\nbelongs to hundreds' place;\n3\n×\n20\n=\n60\n,\n60\n+\n9\n=\n69\n, the whole result is\n69120\n. He then gives a second method of multiplying by\n20\nwhere he first multiplies by\n2\nand then by\n10\n. After this discussion of two figure multiplication he moves on to some with multipliers of three figures, and so on.\nHe begins his section on fractions by describing how to cancel to reduce a fraction to its lowest terms. Then he approaches a topic which clearly troubled many people, how multiplication of a number by a fraction could result in a smaller number than the one multiplied. When he comes to discuss division of fractions he gives a rule but nowhere uses the fact that one can simply multiply by the reciprocal. Clearly this simple device was not understood at the time.\nHe explains the Rule of Three which he calls\nA Rule Pertaining to Trading\n. He writes:\nThree quantities are known to find the other.\nMultiply the second by the third and divide the result by the first.\nExample. The three numbers are\n2\n,\n3\n,\n4\n.\nCalculate\n3\n×\n4\n=\n12\n,\n12\n÷\n2\n=\n6\n.\nIn case the reader is puzzled, we note that Borgi is solving:\na\nb\n=\nc\nx\n\\Large\\frac{a}{b}\\normalsize  = \\Large\\frac{c}{x}\\normalsize\nb\na\n​\n=\nx\nc\n​\nso\nx\n=\nb\nc\na\nx = \\Large\\frac{bc}{a}\\normalsize\nx\n=\na\nb\nc\n​\n.\nHere are a selection of problems from the Rule of Three section. Note the complexity of the units used:\nIf\n4\n½; yards of cloth cost\n17\nsoldi, how much will\n8\nyards cost?\nIf\n100\npounds of cotton cost\n6\nducats\n7\ngrossi\n18\npizoli, how much will\n5432\npounds cost, allowing\n8\npounds per cent for tare and\n2\nducats per cent for brokerage?\nIf\n5\ncarghi\n94\npounds\n6\nounces\n4\nsazi cost\n213\nducats\n15\ngrossi\n23\npizoli, how much can be bought for\n1327\nducats\n9\ngrossi?\nAs an example of the problems in the final section of the book we give:\nIf\n100\nlire of Modon are equal to\n1415\nlire of Venice, and\n180\nlire of Venice are equal to\n1850\nlire of Corfu, and\n240\nlire of Corfu are equal to\n360\nlire of Negroponte how many lire of Modon are equal to\n850\nlire of Negroponte?\nAs to the importance of the work we again quote\nDavid Smith\n[\n1\n]\n:-\nThe interesting thing about the book, however, is not to be found in the details so much as in the general spirit which is shown and in its influence upon the making of textbooks in the last four and a half centuries. A book so valued as to go through at least sixteen editions in a century must have had and evidently did have a great influence upon the work of later generations.\nHe also notes that:-\n... the rather fanciful problems in the closing chapter of Borgi's book are found, of course in modified form, in most of the algebras of the present day. Some will remain because of their puzzle value for young people, but most of them have long since outlived what usefulness they may ever have possessed.",
  "math_areas": [
    "Algebra"
  ]
}