{
  "nome_completo": "Pierre René Deligne",
  "nome_curto": "Pierre Deligne",
  "ano_nascimento": "1944",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Deligne/",
  "lugar_nascimento": "Etterbeek, Brussels, Belgium",
  "lugar_morte": null,
  "biografia": "Pierre Deligne\nwas the son of Albert Deligne, a company administrator, and his wife Renée Bodart. He was born in Etterbeek, one of the nineteen suburban districts that, together with central Brussels, make up Greater Brussels. He was the youngest of his parents three children, having a brother who was seven years older than he was, and also an elder sister. Even before he began his primary education, Pierre was learning mathematics from his brother\n[\n33\n]\n:-\nI was lucky that my brother was seven years older than me. When I looked at the thermometer and realised that there were positive and negative numbers, he would try to explain to me that minus one times minus one is plus one. That was a big surprise.\nPierre attended primary school at Schaerbeek, another of the nineteen suburban districts northeast of central Brussels, from September\n1950\nto June\n1956\n. An excellent teacher at this school taught him reading, writing and arithmetic. But more than this, he remembered being fascinated by the teacher comparing the surface area of a half-sphere with a disc of the same radius by covering both with rope. Using length to measure area made Pierre think deeply. He continued to learn mathematics from his brother and so when in primary school he was taught the formula for solving quadratic equations.\nIn September of\n1956\nhe began his secondary schooling at the Athénée Adolphe Max in Brussels. This boys' school was founded in\n1909\nand later named for Adolphe Max, a famous mayor of Brussels. Pierre continued to learn from his brother and, when in the high school, his brother gave him some notes about solving cubic and quartic equations, including the famous complicated formula for cubics which Pierre found very interesting. His favourite lessons at high school were geometry lessons; learning to write proofs in the style of\nEuclid\nhe found an excellent exercise. The most important event in his mathematical development came about, not from his brother, but from Jeff Nijs. Pierre was in the Boy Scouts where one of his friends was the son of the high school teacher Jeff Nijs. Hearing about Pierre's passion for mathematics, Jeff Nijs gave him a copy of\nBourbaki\n's\nSet Theory\n. This is a difficult text and one which should put off mathematics almost any high school pupil, but not so for Pierre Deligne who was delighted to have his \"first real mathematical book.\" He said\n[\n33\n]\n:-\nI had already read elsewhere how rational numbers, then real numbers, could be defined starting from the integers. But I remember wondering how integers could be defined from set theory, looking a little ahead in\nBourbaki\n, and admiring how one could first define what it means for two sets to have the \"same number of elements\", and derive from this the notion of integers.\nA friend of his family gave the young Deligne a book on complex variable which gave him \"tremendous joy.\" Jeff Nijs realised what a remarkable high school student Deligne was and came up with another excellent idea; he introduced Deligne to\nJacques Tits\n, explained his extraordinary talent, and asked\nTits\nto take good care of him. Although still at high school, Deligne attended\nTits\n's courses and seminars at the university. One day he was absent from a lecture and\nTits\nasked, \"Where is Deligne?\" When told he could not be there because he had to be on a high school trip, Tits promptly postponed the lecture until the following week. Deligne graduated from secondary school in June\n1962\nand entered the Free University of Brussels in September of that year.\nAlthough Deligne was an undergraduate at the Free University of Brussels from\n1962\nto\n1966\n,\nTits\ndecided that it would be in Deligne's best interests to learn from\nAlexander Grothendieck\nwho was lecturing at the École Normale Supérieure in Paris. In November\n1964\nTits\ntook Deligne to Paris to attend a\nBourbaki\nseminar and introduce him to\nGrothendieck\n. Deligne said\n[\n34\n]\n:-\nI was really taken aback. He was a little strange, with his shaved head, a very tall man. We shook hands but did nothing more until I went to Paris a few months later to attend his seminar\nDeligne spent the academic year\n1965\n-\n66\nat the École Normale Supérieure in Paris. He recalls in\n[\n34\n]\nan incident from the first lecture by\nGrothendieck\nthat he attended:-\n... he used the expression \"cohomology object\" many times. I knew what cohomology was for abelian groups, but I did not know the meaning of \"cohomology object\". After the lecture I asked him what he meant by this expression. I think that many other mathematicians would have thought that if you didn't know the answer, there wouldn't be any point to speak to you. This was not his reaction at all. Very patiently he told me that if you have a long exact sequence in an abelian category and you look at the kernel of one map, you divide by the image of the previous one and so on… I recognised quickly that I knew about this in a less general context. He was very open to people who were ignorant. I think that you should not ask him the same stupid question three times, but twice was all right.\nDeligne received his\nLicence en mathématiques\nin November\n1966\n, the equivalent of a B.A. He continued to study for his doctorate at the Free University of Brussels and in September\n1967\nhe was a junior scientist at the Fond National de la Recherche Scientifique in Brussels, at the same time being a guest at the Institut des Hautes Études Scientifiques at Bures-sur-Yvette in France where he worked with\nAlexandre Grothendieck\n. He was awarded his Doctorat en mathématiques by the Free University of Brussels in November\n1968\n.\nAfter the award of his doctorate, Deligne went to the Institut des Hautes Études Scientifiques\n(\nIHES\n)\nat Bures-sur-Yvette in France where he was a visiting member until February\n1970\nafter which he became a permanent member of the Institute. At the IHES he worked with\nGrothendieck\ninitially on the generalisation of\nZariski\n's main theorem. He also worked closely with\nJean-Pierre Serre\n, leading to important results on the\nl\nl\nl\n-adic representations attached to modular forms, and the conjectural functional equations of\nL\nL\nL\n-functions.\nWorking with both\nGrothendieck\nand\nSerre\nwas important for Deligne, particularly since their approach to mathematics was very different.\nGrothendieck\nwanted to understand everything in the utmost generality. He had not much knowledge of the relevant literature, preferring to prove everything for himself.\nSerre\n, on the other hand, had an excellent knowledge of the literature and could give precise references. Rather than always looking for the most general situation, he concentrated on beautiful special cases. Deligne thought that these two needed each other and their collaboration was valuable to them both. He also found that balancing their two approaches was a useful learning experience for him. He said\nGrothendieck\n's lectures were wonderful but he needed to go to\nSerre\n's lectures in order to keep his feet on the ground. During this period at the IHES, Deligne also collaborated with\nDavid Mumford\non a new description of the moduli spaces for curves: this work has been much used in later developments arising from string theory.\nHis remarkable mathematical contributions were quickly recognised with the award of major prizes: in\n1974\nhe received the François Deruyts Prize, awarded by the\nBelgium Royal Academy of Sciences\n, and the\nHenri Poincaré\nMedal, awarded by the\nFrench Academy of Sciences\n. He received the A De Leeuw-Damry-Bourlart Prize in\n1975\nfrom the Belgian National Science Foundation.\nOn\n9\nSeptember\n1980\n, Deligne married Elena Vladimirovna Alexeeva whom he met on one of his visits to Russia; they have two children, Natalia and Alexis.\nDeligne remained based at the Institut des Hautes Études Scientifiques until\n1984\nwhen he went to the Institute for Advanced Study at Princeton in the United States, where he was appointed a professor. He did not leave the IHES because he was unhappy there, quite the contrary, but he felt that it was not good to spend the whole of one's career at the same institution and that he would gain much from a move. While at the IHES he gave a seminar each year on a different topic and by going to Princeton he no longer felt it necessary to do this. He talked about the similarities and differences in the two institutions in\n[\n34\n]\n:-\nI would say that the Institute for Advanced Study is older, bigger, and more stable. Both are very similar in the way that there are many young visitors who come there. So they are not places where you can fall asleep since you will always be in contact with young people who will tell you that you are not as good as you think you are. In both places there are physicists, but I think the contact with them was more fruitful for me in Princeton than it was in Bures. In Princeton, there have been common seminars.\nAs an example of the interaction between mathematicians and physicists, let us quote from the Institute's Report for\n1997\n-\n98\n[\n48\n]\n:-\nThis was the second year of a three-year interdisciplinary programme in mathematics and physics, led by Professor Pierre Deligne, School of Mathematics, and Professor\nEdward Witten\n, School of Natural Sciences, and titled \"Algebraic and Geometric Aspects of Quantum Field Theory and Gauge Theory.\" The programme is evidence of a remarkable commitment to sustained and sophisticated interaction on the part of participating mathematicians and physicists. Over the past few years the theoretical physics community has produced a number of remarkable mathematical conjectures. The aim of this program is for mathematicians to learn the physicists' thought processes that lead to these conjectures. ... Preliminary versions of these lecture notes have been available on the Institute's web site and are being used by mathematicians worldwide as a unique source for this material.\nAndré Weil\ngave for the first time a theory of varieties defined by equations with coefficients in an arbitrary field, in his\nFoundations of Algebraic Geometry\n(1946)\n. This used\nZariski\n's ideas and also made good use of geometric concepts.\nWeil\n's work on polynomial equations led to questions on what properties of a geometric object can be determined purely algebraically.\nWeil\n's work related questions about integer solutions of polynomial equations to questions in algebraic geometry. He conjectured results about the number of solutions of polynomial equations over the integers using intuition on how algebraic topology should apply in this novel situation. The third of his conjectures was a generalisation of the\nRiemann\nhypothesis on the zeta function. These problems quickly became major research challenges to mathematicians.\nA solution of the three\nWeil\nconjectures was given by Deligne in\n1974\n. This work brought together algebraic geometry and algebraic number theory and it led to Deligne being awarded a\nFields\nMedal at the International Congress of Mathematicians in Helsinki in\n1978\n. A solution to these problems required the development of a new kind of algebraic topology.\nJacques Tits\nsaid\n[\n29\n]\n:-\nThese conjectures were both exceptionally hard to settle\n(\nthe best specialists, including\nA Grothendieck\n, had worked on them\n)\nand most interesting in view of the far-reaching consequences of their solution.\nDeligne has worked on many other important problems. The areas on which he has worked, in addition to algebraic geometry, are\nHilbert\n's\n21\nst problem,\nHodge\ntheory, theory of moduli, modular forms,\nGalois\nrepresentations, L-series and the\nLanglands\nconjectures, and representations of algebraic groups.\nIn addition to the\nFields\nMedal, Deligne was awarded the Crafoord Prize of the\nRoyal Swedish Academy of Sciences\nin\n1988\n:-\n... for his fundamental research in algebraic geometry.\nDeligne has been awarded many other honours for his outstanding contributions. For example he was awarded the Francois Deruyts prize by the\nRoyal Belgium Academy of Sciences\nin June\n1974\n, the\nHenri Poincaré\nmedal by the\nParis Academy of Sciences\nin December\n1974\n, and the Doctor A De Leeuw-Damry-Bourlart Prize by the Fond National de la Recherche Scientifique in\n1975\n. He has received honorary doctorates from the Flemish University of Brussels in\n1989\n, and from the École Normale Supérieure in\n1995\n. He has been elected a member of the\nParis Academy of Sciences\nin\n1978\nand by the\nAmerican Academy of Arts and Sciences\nin the same year.\nIn\n2004\nDeligne was elected an honorary member of the\nLondon Mathematical Society\n[\n15\n]\n:-\n... in recognition of his monumental contributions to algebraic geometry.\nViewed as a whole, Deligne's work concerns many different aspects of the cohomology of algebraic varieties. It has turned\nGrothendieck\n's philosophy of motives from a conjectural program into what is the driving force behind many of the most subtle areas of current algebraic geometry and arithmetic. Through an unparalleled blend of penetrating insights, fearless technical mastery and dazzling ingenuity, Deligne has singlehandedly brought about a new understanding of the cohomology of varieties, both classical and in finite characteristic, with numerous applications to deep problems in geometry and number theory.\nIn the same year Deligne received the\n2004\nBalzan Prize in Mathematics awarded by the International Balzan Foundation\n[\n42\n]\n:-\n... for major contributions to several important domains of mathematics\n(\nlike algebraic geometry, algebraic and analytic number theory, group theory, topology,\nGrothendieck\ntheory of motives\n)\n, enriching them with new and powerful tools and with magnificent results such as his spectacular proof of the \"\nRiemann\nhypothesis over finite fields\"\n(\nWeil\nconjectures\n)\n.\nJacques Tits\n, as a member of the Balzan Prize committee, announced the prize on\n7\nSeptember\n2004\nin Milan. He described Deligne's work, then ended by making the following comments\n[\n42\n]\n:-\nA remarkable feature of Pierre Deligne's thinking is that, when confronted with a new problem or a new theory, he understands and, so to speak, makes his own its basic principles at a tremendous speed, and is immediately able to discuss the problem or use the theory as a completely familiar object. Thus, he readily adopts the language of the people he is talking to when engaged in discussions. This flexibility is one of the reasons for the universality of his mathematical work.\nAlone or in collaboration, Pierre Deligne has written about a hundred papers, most of them of sizeable length. Because of the conciseness of his style and of his habit of never writing the same thing twice\n(\nin fact, quite a few of his best ideas have never been written!\n)\n, the volume of his publications is a true measure of the richness of his scientific production.\nAs winner of the Balzan Prize, Deligne received\n1\nmillion Swiss francs\n(\nabout US$\n800\n,\n000)\n, half of which would go to research projects involving young researchers in his field. The prize ceremony took place on\n18\nNovember\n2004\nin the\nAccademia dei Lincei\nin Rome. Deligne said, as part of his reply\n[\n43\n]\n:-\nMy own research has mainly revolved around algebraic geometry. That this discipline owes so much to the Italian school doubles my pleasure in being in Rome today. Algebraic geometry was born from the realisation, over several centuries, that geometry and algebra are in many cases the expression in two different languages of the same underlying \"reality\". As a classic example, I will cite the significant identity between \"circle of radius\nr\nr\nr\n\" and \"equation\nx\n2\n+\ny\n2\n=\nr\n2\nx^{2} + y^{2} = r^{2}\nx\n2\n+\ny\n2\n=\nr\n2\n\". The construction of such analogies which, in their finished form, can become dictionaries, and their corollary: the resolution of problems by methods which, at first sight, seem to have nothing to do with the problem posed, are for me one of the great joys that mathematics offers the professional mathematician. These unexpected analogies, dictionaries and comparisons also ensure that mathematics is not scattered over autonomous sub-disciplines, and is a source of its effectiveness when it serves as a tool for other sciences - even if this effectiveness is not the first goal of the mathematician.\nA conference on the occasion of the sixty-first birthday of Pierre Deligne took place at the Institute for Advanced Study on\n17\n-\n20\nOctober\n2005\n. In May\n2007\nhe was elected as an International Member of the Mathematics Section of the\nNational Academy of Sciences\n. His Research Interests are given on the\nAcademy\n's website as follows\n[\n44\n]\n:-\nMy home is algebraic geometry, a discipline connected to many others; wherever polynomials appear, it can be there to provide a geometric understanding. For instance: Diophantine equations\n(\nsolutions of equations in integers or rationals\n)\n, identities between integrals with algebraic integrands, algebraic groups. I am fascinated by the multiplicity of cohomology theories algebraic varieties give rise to, and their interrelation. I constructed one: mixed\nHodge\ntheory. Thanks to their properties, spaces and maps coming from algebraic geometry are very special. A grandiose theory of\nGrothendieck\n(\n\"motives\"\n)\nmakes sense of it, modulo conjectures which remain inaccessible. Some of my works give unconditional variants sufficients for some applications. I have also worked with automorphic forms\n(\nrelated with the arithmetic and the cohomology of algebraic varieties by\nLanglands\n' philosophy\n)\n, with configurations of hyperplanes, tensor categories, multizeta values\n(\na story beginning with\nEuler\n)\n.\nIn February\n2008\n, Deligne was a recipient of the Wolf Prize, given also on this occasion to\nPhillip Griffiths\n, and\nDavid Mumford\n. The citation states that the prize is awarded to Deligne\n[\n45\n]\n:-\n... for his work on mixed\nHodge\ntheory, the\nWeil\nconjectures, the\nRiemann\n-\nHilbert\ncorrespondence, and for his contributions to arithmetic.\nLater in\n2008\nhe became Emeritus at the Institute for Advanced Study, Princeton. He continued to receive major honours and awards: he was elected a Foreign Member of the\nRoyal Swedish Academy of Sciences\nin February\n2009\nand a member of the American Philosophical Society in April of that year. Perhaps the greatest honour he received was the\nAbel\nPrize in May\n2013\n. The citation for the Prize states that the prize is awarded to Deligne\n(\n[\n1\n]\nand\n[\n24\n]\n)\n:-\n... for seminal contributions to algebraic geometry and for their transformative impact on number theory, representation theory, and related fields. ... Deligne's powerful concepts, ideas, results and methods continue to influence the development of algebraic geometry, as well as mathematics as a whole.\nOther honours, not mentioned above, include: elected Membre Associé Étranger,\nAcadémie des Sciences, Paris\n(1978)\n; Doctor honoris causa of the Vrije Universiteit Brussel\n(1989)\n; elected Membre Associé,\nAcadémie Royale de Belgique\n(1994)\n; Doctor honoris causa of École Normale Supérieure\n(1995)\n; elected foreign member,\nAccademia nazionale dei Lincei\n(2003)\n; ennobled by Albert II, King of the Belgians\n(2006)\n. This last mentioned honour made him Vicomte Deligne, and he designed his coat of arms which was inspired by the following nursery rhyme\n[\n39\n]\n:-\nQuand trois poules vont aux champs,\nLa première va devant,\nLa deuxième suit la première,\nLa troisième est la dernière.\nQuand trois poules vont aux champs,\nLa première va devant.\nThis translates as:\nAs three hens head for the fields,\nThe first one leads,\nThe second follows the first,\nThe third one is last.\nAs three hens head for the fields,\nThe first one leads.\nDeligne's reasoning is given in\n[\n39\n]\n:-\nThis rhyme is intended to teach children the meaning of a few simple words. As such, it appears to adults as a succession of tautologies. Deligne argues that mathematical discourse proceeds in much the same way ...\nIn\n2007\nthe Belgian post office issued a postage stamp in his honour.\nSee\nTHIS LINK\n.\nIn October\n2016\nhe was elected a Foreign Member of the\nRussian Academy of Sciences\n.\nIn the interview\n[\n33\n]\nDeligne speaks about teaching:-\nI never had to teach. I like very much to speak with people. In the two institutions where I have worked young people come to speak with me. Sometimes I answer their questions, but more often I ask them counter-questions that sometimes are interesting, too. So this aspect of teaching with one-to-one contact, trying to give useful information and learning in the process, is important to me. I suspect it must be very painful to teach people who are not interested, but are forced to learn mathematics because they need the grade to do something else. I would find that repulsive.\nPerhaps it would be interesting to record a little about what this mathematical genius does other than mathematics\n[\n47\n]\n:-\nHe doesn't own a car and bicycles everywhere, keeping his right pant leg perennially tucked into his sock. He has quite possibly never been seen in a suit, favouring instead well-worn sweaters in earth tones. In Princeton's flash rainstorms he has been known to strip down to the waist to minimise the damage, though he does not take this strategy to the logical extreme.\nDeligne loves nature and negotiated to buy the house right next to the Institute woods, even though it had been used for administrative space. In wintertime, he has taken to building an igloo in his backyard and spending a few nights sleeping outside. In summertime, he maintains a garden - potatoes, tomatoes, raspberries, gooseberries, leeks, basil, parsley, tarragon, chives. \"Some things I like very much and I try but I am not successful,\" he says. \"I like very much artichoke, not so much to eat them but when they get overripe there is a bud and they open like a flower and they are beautiful. But the climate does not seem to be good for them. Every year I try. I find it very relaxing.\"\nLet us end with two quotes about Deligne's contributions. Peter Sarnak writes\n[\n2\n]\n:-\nThere are very few mathematicians whose impact on modern mathematics comes close to that of Deligne. His research in algebraic geometry and arithmetic geometry have shaped these fields and led him to the solution of a number of long standing problems, including the\nWeil\nConjectures\n(\nwhich are the analogues of the notorious\nRiemann\nHypothesis for varieties over finite fields\n)\nand the celebrated\nRamanujan\nConjecture in the theory of modular forms. Deligne's foundational contributions range from the above fields to representation theory of groups, differential equations and monodromy, topology ... Many of the techniques and tools that he developed either in these papers or in response to questions posed to him\n(\nhe is very approachable and generous\n)\nare at the bottom of much of the exciting research that is going in these fields today. Deligne's style is that of wanting to understand in simple and general terms things that are fundamental but appear to be very complex. His development of new insights and methods, as well as the solution of long standing problems, follow naturally from this point of view. Of course his striking success has a lot to do with his tremendous mathematical talent and especially his ability to think abstractly.\nHélène Esnault writes\n[\n2\n]\n:-\nDeligne's work has structured the language in which generations of algebraic geometers and arithmeticians think and write. Many algebraic geometers have slept for years with a few lines of Pierre Deligne's ideas on their night table, to meditate and think further. All algebraic geometers have the deepest admiration for Deligne's work.\nDeligne himself, writing about\nGrothendieck\n, says\n[\n46\n]\n:-\nI feel extremely fortunate that\nGrothendieck\nwas my Master. What I learned from him, especially the philosophy of motives, has been a guiding thread in the works of mine I like the most, such as the formalism of mixed\nHodge\nstructures. From him and his example, I have also learned not to take glory in the difficulty of a proof: difficulty means we have not understood. The ideal is to be able to paint a landscape in which the proof is obvious.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}