{
  "nome_completo": "Pierre Petit",
  "nome_curto": "Pierre Petit",
  "ano_nascimento": "1594",
  "ano_morte": "1677",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petit_Pierre/",
  "lugar_nascimento": "Montluçon, France",
  "lugar_morte": "Lagny-sur-Marne, France",
  "biografia": "Pierre Petit\nwas the son of a minor provincial official in Montluçon. The town, in the Auvergne region of central France, is situated northwest of Clermont-Ferrand. The old town in which Pierre was brought up was on a hill dominated by a château. After being educated in Montluçon he followed his father into local government and spent the first years of his adult life as 'contrôleur de l'election' in the town of his birth. As Petit was much involved in the government of France, we should look briefly at political events of the times in which he lived.\nLouis XIII had become King of France in\n1610\n, around the time Petit was thinking about a career in government. The fact that Louis XIII's father Henry IV had been assassinated by a fanatical Roman Catholic, and Louis was only nine years old when he succeeded to the throne, already gives some idea of the political situation. It was a time of revolt by the French peasants, and officials loyal to the government were in some danger of assassination.\nIn\n1633\nPetit moved to Paris to play a role in national rather than local government. Being in Paris had another advantage for Petit since it allowed him to become more involved with men of science than he could be in a town like Montluçon. Richelieu, a major figure in the French government, had begun with a career in the Church and, as Bishop of Luçon, became involved with the government in the difficult period when Louis XIII was a minor. The King managed to get Richelieu made a Cardinal, then appointed him as secretary of state in\n1624\n, giving him the title of first minister four years later. When Petit arrived in Paris in\n1633\nhe was appointed 'Commissaire Provincial de l'Artillerie' by Richelieu.\nIn Paris Petit joined with the group of scientists meeting with\nMersenne\nat the Minims de l'Annociade near Place Royale. In the year Petit arrived in Paris,\nMersenne\npublished\nTraité des mouvements\nⓉ\n(\nTreatise on movements\n)\n, and in the following year he published\nLes Mécanique de Galilée\nⓉ\n(\nThe Mechanics of Galileo\n)\nwhich was a version of\nGalileo\n's lectures on mechanics.\nÉtienne Pascal\nhad arrived in Paris two years before Petit so that his son could have the best education. He and his son\nBlaise Pascal\nwere also members of\nMersenne\n's group as were others such as\nGassendi\n,\nRoberval\n, and\nBeaugrand\n.\nPetit was an influential figure with important government positions which enabled him to try to influence national science policy. A firm believer, as were the other members of\nMersenne\n's group, of the experimental method rather than the philosophical approach advocated by\nDescartes\n, Petit argued strongly for better astronomical facilities in France. He wanted the King to establish a Royal Observatory to allow France to again take a leading role in astronomy. Petit argued that France had fallen behind some other European countries and was relying on observations made in other countries. Petit himself had a fine collection of astronomical instruments and several of these were of his own invention. In particular, late in his life, Petit devised a filar micrometer to measure the diameters of celestial objects such as the Sun, Moon and planets. By this time Petit was 'Intendant Général des Fortifications', a position he was appointed to in\n1649\n, and he wrote a letter which describes the instrument. This was published in the\nJournal des sçavans\nin May\n1667\nas\nExtrait d'une lettre de M Petit Intendant des Fortifications ... touchant une nouvelle machine pour mesurer exactment les diamètres des astres\nⓉ\n(\nExtract from a letter from M Petit 'Intendant des Fortifications' ... concerning a new machine for measuring the diameters of the stars exactly\n)\n. Petit's instrument was later used by\nGiovanni Cassini\nin the Royal Observatory in Paris.\nAmong many collaborations, Petit worked with\nÉtienne Pascal\nand his son\nBlaise Pascal\nin October\n1646\nin repeating\nTorricelli\n's experiment on the barometric vacuum. Petit wrote an account of these experiments which were published as\nObservation touchant le vuide faite pour la première fois en France\nⓉ\n(\nObservation concerning the vacuum made for the first time in France\n)\nin\n1647\n. Petit kept up a regular correspondence with the secretary of the\nRoyal Society\nin London after its foundation in\n1660\nand was one of the first foreign fellows of that Society when elected in April\n1667\n. Petit had written\nDissertation sur la nature des comètes\nⓉ\n(\nDissertation on the nature of comets\n)\nin\n1665\nwhich had been highly praised by the\nRoyal Society\nand must have played a large role in him being elected a fellow.\nPetit had argued strongly in favour of setting up an official scientific organisation in France so it is rather surprising that when the\nAcadémie des Sciences\nwas founded in Paris in\n1666\nby Jean-Baptiste Colbert, at that time controller general of finance in France, Petit was not made a member. Colbert's programme of economic reconstruction was largely responsible for making France the leading power in Europe. There surely were personal reasons why Colbert, whose aims were so close to those of Petit, chose to ignore him when he drew up the initial list of members.",
  "math_areas": []
}