{
  "nome_completo": "Piers Bohl",
  "nome_curto": "Piers Bohl",
  "ano_nascimento": "1865",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bohl/",
  "lugar_nascimento": "Walka, Livonia (now Valka, Latvia)",
  "lugar_morte": "Riga, Latvia",
  "biografia": "Piers Bohl\n's father, Georg Bohl, was a merchant and his mother was Ottilie Ehmann. Piers' family background was not an academic one. He had a younger brother Edgar Bohl, born in\n1867\nand possibly other siblings. Piers received his first lessons from private tutors and studied at the municipal elementary school in Walka\n(\nalso known by the German name of Walk\n)\n. In\n1878\nhe went to the German Livonian State Grammar School in Fellin, Livonia, a town now named Viljandi in Estonia. Perhaps at this point it is worth briefly looking at the history of the region where Bohl was brought up and educated. The region of the Riga Governorate of the Russian Empire existed through the\n18\nth century and was renamed the Governorate of Livonia in\n1796\nafter the partition of Poland. Although it was part of the Russian Empire during the time Bohl was growing up, it was an autonomous region ruled by German nobles and the language of the people was German. Later in his life, however, Russification of the region took place. His home town of Walka\n(\nor Walk\n)\nwas actually split into two when the Latvian/Estonian border went through the middle of the town in\n1920\n. The Latvian half is now known as Valka, the Estonian half as Valga. Fellin, now Viljandi in Estonia, is about\n80\nkm north of Walka.\nIn\n[\n4\n]\nthe record of both Piers and Edgar Bohl at the Livonian State Grammar School in Fellin is described:-\nThe documents from the State Grammar School in Fellin, available in the Latvian History Archive, state that both brothers were ambitious students. Piers was ill for half a year and had trouble making up for what he had missed in class. Both brothers lived in the \"Aluminat\", a boarding school with the strictest discipline. School fees were usually paid for the lessons, but Piers Bohl's name\n(\nmore often than that of his brother\n)\ncan also be found on the scholarship list. From the archive records it can be seen that Piers found mathematics easy from the start and that he was one of the best students in class in this subject. His brother Edgar was a poor student, but he also graduated from high school, then studied medicine at Dorpat University\n(\nnow Tartu University, Estonia\n)\nand obtained a doctorate. Nothing further seems to be known about Edgar Bohl.\nAt the Fellin Grammar School, Bohl was taught mathematics by Edward Hugo Weidemann\n(1854\n-\n1887)\n, known as Hugo. Weidemann, who had graduated from Dorpat University, was an inspirational teacher who did not follow the standard curriculum but had his own ideas about how mathematics should be taught. Tragically, he died when only\n32\nyears old, just three years after giving Bohl his passion for mathematics.\nIn\n1884\nBohl graduated from the Fellin Grammar School with the Maturity Certificate and remained in, what today is Estonia, entering the Mathematics and Physics Faculty of the University of Dorpat in August of that year. We note that Dorpat University had all its teaching in German from\n1802\nto\n1893\n. Russification meant that Dorpat was renamed Yuryev in\n1893\n, was changed back to Dorpat during the German occupation during World War I, then became Tartu in\n1919\n, the name it is known by today. When Bohl studied there, the three year course was examined with oral examinations by the lecturers at the end of each year. The Professor of Pure Mathematics at this time was Peter Helmling\n(1817\n-\n1901)\nand the Professor of Applied Mathematics was\nFerdinand Minding\n, but neither had much influence on Bohl. Following\nMinding\n's death in\n1885\n, Anders Lindstedt\n(1854\n-\n1939)\nbecame Professor of Applied Mathematics, but he left in\n1886\nwhen he was appointed Professor at the Royal Institute of Technology in Stockholm.\nAt the end of the first year, on\n9\nDecember\n1895\nBohl completed his examinations on the theory of equations and determinants, differential calculus, integral calculus, analytical geometry and the theory of curves and surfaces. In each subject his examination was graded \"very good\". For his second year, completed on\n18\nAugust\n1886\n, he was examined on the courses on mathematical geography,\ndifferential equations\n, the method of least squares, the theory of analytical functions, and modern algebra and geometry. Each paper was either graded \"good\" or \"very good\", a slightly less brilliant performance than in year one. Bohl's schooling had been in German, and students with this language background were required to write an essay in Russian at the end of their second year. This was rather a challenge for Bohl who had not performed particularly well in his school studies in Russian. He wrote his essay on Ivan Turgenev's novel\nVirgin soil\n(\nRussian\n)\n, the final novel by Turgenev which is also his longest and most ambitious. Bohl's essay was, not surprisingly, the poorest of his examined works, graded \"satisfactory\". His performance in mathematics, however, was outstanding and he won a Gold Medal for an essay he wrote in\n1886\nentitled\nDarstellung und Anwendung der Invarianten der linearen Differentialgleichungen\nⓉ\n(\nRepresentation and application of the invariants of the linear differential equations\n)\n. It is a tribute to the quality of this essay that, although it was not published at the time, it was translated from German to Russian and published in\n1973\n.\nFor a list of Bohl's publications with comments, see\nTHIS LINK\n.\nIn his final year he took the following courses.\n(\ni\n)\n'Theoretical and Experimental Physics' given by Arthur von Oettingen\n(1836\n-\n1920)\n. Von Oettingen had studied physics and astronomy at the University of Dorpat, then continued his studies in Paris and Berlin before becoming professor of physics at Dorpat in\n1868\n.\n(\nii\n)\n'General Astronomy' given by Ludwig Schwarz\n(1822\n-\n1894)\n. Schwarz had been appointed as Director of the Dorpat Observatory in\n1872\nto succeed\nThomas Clausen\n.\n(\niii\n)\n'Inorganic Chemistry' given by Carl Schmidt\n(1822\n-\n1894)\n. Schmidt was awarded a doctorate from the University of Giessen in\n1844\n, and appointed as Professor of Chemistry in the Mathematics and Physics Faculty of the University of Dorpat in\n1851\n.\n(\niv\n)\n'Mechanics' given by Otto Staude\n(1857\n-\n1928)\n. Staude studied for his doctorate at the University of Leipzig advised by\nFelix Klein\n, being awarded the degree in\n1876\n. Staude was Professor of Applied Mathematics at Dorpat from\n1886\nto\n1888\n.\n(\nv\n)\n'Number Theory' given by\nTheodor Molien\n. On\n17\nAugust\n1887\n, Bohl made a request to the Mathematical and Physical Faculty of the University of Dorpat to be examined in these five topics. After the five oral examinations were carried out in the week after his request by those who had taught the courses, Bohl was awarded \"very good\" in each of the five subjects. On\n26\nAugust\n1887\nhe was awarded his Candidate's Diploma in Mathematics.\nAfter graduating with his Candidate's Diploma, a few weeks later Bohl passed the examinations which qualified him to teach in High Schools. As part of the examination he had to write an essay and wrote about the purpose of high school education in\nÜber den Zweck der gymnasialen Bildung\nⓉ\n(\nOn the purpose of High School education\n)\n. He then became a teacher\n[\n4\n]\n:-\nAfter completing his studies, Bohl first worked as a tutor at the Levi estate in Estonia, then at the Kurland teacher training college. His first publications are \"Das Gesetz der molekularen Attraktion\"\nⓉ\n(\nThe law of molecular attraction\n)\n, which appeared in 'Annals of Physics and Chemistry' in\n1889\n, and \"Verallgemeinerung des dritten Keplerschen Gesetzes\"\nⓉ\n(\nGeneralization of Kepler's third law\n)\n, published in\n1890\nin the 'Journal of Mathematics and Physics'. As the titles of the works show, Bohl turned to physical questions during this period, but from today's perspective, some of his results and conclusions are incorrect.\nBy\n1889\nBohl was registered as a research student at Dorpat University, where he was advised by\nAdolf Kneser\nwho had been appointed to the chair of Applied Mathematics at Dorpat in that year. In\n1893\nBohl was awarded his Master's Degree\n(\nequivalent to a Ph.D. degree\n)\nfor the thesis\nÜber die Darstellung von Funktionen einer Variablen durch trigonometrische Reihen mit mehreren, einer Variablen proportionalen Argumenten\nⓉ\n(\nOn the representation of functions of a variable by trigonometric series with several arguments proportional to a variable\n)\n. This was for an investigation involving quasi-periodic functions, motivated from mathematical methods used in celestial mechanics. The examining committee for the thesis was Gustav von Grofe\n(1848\n-\n1895)\n, Arthur von Oettingen and\nAdolf Kneser\n. Although Bohl was the first to study these functions the name is not due to him but is due to\nErnest Esclangon\nwho studied them later.\nEsclangon\n's work was in fact completely independent of Bohl's and, recommended by\nPaul Painlevé\n, was published in\nComptes Rendus\nin\n1902\n[\n4\n]\n:-\nBohl read this note and found that\nEsclangon\n's concept of \"quasi-periodic function\" corresponded to that of \"periodic function in a generalised sense\", which he had defined in his master's thesis. He communicated this to\nP Painlevé\nand probably sent him a copy of his dissertation, and in\n1903\nEsclangon\n's second note in the \"Comptes Rendus\" acknowledged Bohl's priority in discovering the new class of functions. In the same note,\nEsclangon\nsaid that he had reached his results independently of Bohl, discussed the differences between the two works, and cited several new results. Bohl was very pleased with this reaction; in the subsequent correspondence between him and\nEsclangon\n, he in turn shared various new research results and was very benevolent about\nEsclangon\n's scientific projects.\nEsclangon\nwas awarded a doctoral thesis for \"Quasi-Periodic Functions\" from the University of Paris.\nThe notion of quasi-periodic functions was generalised still further by\nHarald Bohr\nwhen he introduced \"almost periodic functions\". It is worth noting that the examining committee for Bohl's thesis had not realised the importance of his introduction of quasi-periodic functions. Had they done so, his name may well today be associated with this class of functions.\nBohl taught at Riga Polytechnic Institute from\n1895\n. In\n1900\nhe received his doctorate\n(\nperhaps equivalent to a D.Sc. in standard\n)\nfrom the University of Dorpat and, in the same year, he was promoted to professor at Riga Polytechnic Institute. The doctorate was a high qualification being essentially that required for a professorship, the Master's Degree being the passport to a university post. Bohl's doctoral dissertation applied topological methods to systems of differential equations. In this area he was following earlier work by\nHenri Poincaré\nand\nAdolf Kneser\n. The award of his doctorate, however, had not been straightforward. He had submitted his thesis\nÜber einige in der Mechanik anwendbare Differentialgleichungen allgemeinen Charakters\nⓉ\n(\nOn some differential equations of general character applicable in mechanics\n)\nto the Mathematics and Physics Faculty of the University of Dorpat in February\n1900\n. Now politics was playing a major role in the staffing of the University of Dorpat by this time since there had been a deliberate policy of Russification for a few years. The last German professors of mathematics at Dorpat were Friedrich Schur\n(1856\n-\n1932)\n, who left in\n1892\n, and\nAdolf Kneser\nwho left in\n1900\n. Platon Grave\n(1867\n-\n1919)\nhad been appointed as a professor in\n1898\nand although he satisfied the criterion of being Russian he was not a research mathematician. Grave was one of the examiners of Bohl's doctoral thesis and he claimed it was not worthy of the degree. It is unclear whether Grave was not familiar with research mathematics to make a correct judgement or whether he was against Bohl because of the Russification policy which had got him the professorship. Eventually, despite Grave's objections, Bohl was awarded his doctorate in September\n1900\n. We can confidently say that Grave was wrong in his objections since\nJacques Hadamard\nthought highly of this work which, ten years later, was translated into French and published in the\nBulletin\nof the\nFrench Mathematical Society\n.\nThe Russification had another impact on Bohl. From\n1896\n, one year after he was appointed to the Riga Polytechnic, lectures had to be delivered in Russian. Although Bohl was able to do this he had never been particularly happy with that language and this must have presented him with difficulties. From\n1895\nto\n1898\nhe was a lecturer, then an adjunct professor, and finally, from\n1901\n, professor of higher mathematics.\nAs well as being an outstanding mathematician, Bohl was a top quality chess player. His abilities were seen while he was still a student\n[\n10\n]\n:-\nStudent P Bohl from Valka is an ingenious chess player. His game, however, has not yet fully developed due to a lack of strong opponents.\nWhen he began teaching in Riga he was able to develop his game playing stronger opponents. The President of the Riga Chess Club wrote\n[\n10\n]\n:-\nBohl has the potential to become a first-rate master, and is currently the strongest new generation chess player alongside Hans Seyboth.\nHe played for the Riga City team and had many notable victories. He introduced what today is called the \"Riga Variation\" of the Ruy Lopez which was subsequently analysed by\nEmanuel Lasker\nin\nLasker's Chess magazine\n. Mikhail Botvinnik, World Chess Champion from\n1948\nto\n1963\n, was an admirer of Bohl's chess playing. He wrote\n(\nsee\n[\n10\n]\n)\n:-\nEven though his opponents were chess players of all styles, Piers Bohl always pursued an open game, tried to attack, eagerly searched for difficult combinations. When it came to protecting himself, Bohl did so reluctantly and without much thought. Piers Bohl had a thorough knowledge of variations - no doubt he was studying them specifically. Of course, these were the variations that were typical of those times - open versions of the Ruy Lopez, Four-Knights, and so on. In terms of Bohl's practical level of play, in modern terminology he would probably be on the border between Category\n1\nand Candidate Master. This is a very remarkable level for a scholar who could only devote his free time to chess.\nLatvia had been under Russian imperial rule since the\n18\nth century so, in\n1914\n, World War I meant that the Institute at Riga was evacuated to Moscow. Bohl went to Moscow with his colleagues. Conditions in Moscow were difficult with sharply rising prices and food shortages which led to riots. After the Russian Revolution of\n1917\nand the end of World War I in\n1918\n, however, Latvia regained its independence\n(\nalthough this was to be short-lived\n)\nand in\n1919\nBohl was able to return to Riga to fill a chair at the University of Latvia which had just been established. Sadly he was only to hold the chair for two years before his death. His health had suffered due to the difficulties of the war years and he suffered a stroke. This led to memory loss and there were many sad stories relating to his teaching from this point on. In the spring of\n1921\nhis health deteriorated further and by the time teaching was due to begin in the autumn for the\n1921\n-\n22\nsession, he was too ill to teach. On Christmas day\n1921\n, while on a walk, he suffered a second cerebral haemorrhage which proved fatal.\nAmong Bohl's achievements was, rather remarkably, his proof of\nBrouwer\n's fixed-point theorem for a continuous mapping of a sphere into itself, see\n[\n9\n]\n. Clearly the world was not ready for this result since it provoked little interest.\nBohl also studied questions regarding whether the fractional parts of certain functions give a uniform distribution. His work in this area was carried forward independently by\nHermann Weyl\nand\nWacław Sierpiński\n. There are many seemingly simple questions in this area which still seem to be open. For example it is still unknown whether the fractional parts of\n(\n3\n2\n)\nn\n(\\large\\frac{3}{2}\\normalsize )^{n}\n(\n2\n3\n​\n)\nn\nform a uniform distribution on\n(\n0\n,\n1\n)\n(0,1)\n(\n0\n,\n1\n)\nor even if there is some finite subinterval of\n(\n0\n,\n1\n)\n(0,1)\n(\n0\n,\n1\n)\nwhich is avoided by the sequence.\n[\nWe note that a\n2018\npaper computes\n(\n3\n2\n)\nn\n(\\large\\frac{3}{2}\\normalsize )^{n}\n(\n2\n3\n​\n)\nn\nmodulo\n1\nfor\nn\nn\nn\nup to\n1\n0\n8\n10^{8}\n1\n0\n8\nand statistical analysis of the results \"strongly agrees with the hypothesis that\n(\n3\n2\n)\nn\n(\\large\\frac{3}{2}\\normalsize )^{n}\n(\n2\n3\n​\n)\nn\nmodulo\n1\nis uniformly distributed.\"\n]\nLet us quote from\n[\n13\n]\nregarding some of Bohl's most important results:-\nIn his paper 'Über die Bewegung eines mechanischen Systems in die Nähe einer Gleichgewichtslage'\nⓉ\n(\nOn the movement of a mechanical system near an equilibrium position\n)\n(1904)\n, he studied the existence and smoothness problems of stable and unstable manifolds for a quasilinear system of differential equations. In the course of studying these problems, as auxiliary results he established that a sphere is not a retract of a ball and proved that a continuous mapping of a ball into itself has a fixed point, a famous result which is often called the .Brouwer fixed-point theorem., although\nBrouwer\npublished the result seven years later, see\nL E J Brouwer\n, 'Über die Abbildung von Mannigfaltigkeiten'\nⓉ\n(\nOn the mapping of manifolds\n)\n(1911)\n. In his paper 'Über ein Dreikörperproblem'\nⓉ\n(\nOn a Three-Body Problem\n)\n(1906)\nBohl proved a famous theorem about quasiperiodic functions, as well as some important results about differential equations with quasiperiodic coefficients. Of course, here we have been able to mention only a few results of this insightful mathematician.\nDaina Taimina writes\n[\n14\n]\n:-\nBohl had no family and no close friends. He lived only for science and he was indifferent to glory. When he found some new result in mathematics he said he could not believe that nobody had noticed it before.\nAdolf Kneser\nand Alfred Meder write\n[\n4\n]\n:-\nAlmost the only distraction that he allowed himself was to travel regularly during the summer months. He got to know a large part of Europe.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}