{
  "nome_completo": "Pierre Samuel",
  "nome_curto": "Pierre Samuel",
  "ano_nascimento": "1921",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Samuel/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Samuel\n's parents were Raymond Samuel, who was a shopkeeper, and Jacqueline Dalmeyda. Pierre studied at the Lycée Janson-de-Sailly in Paris before entering the École Normale Supérieure where he studied for his Agrégé de mathematique. He published his first paper\nCorrespondance conforme de deux surfaces à plans tangents parallèles\nⓉ\n(\nConformal correspondence between two surfaces with parallel tangent planes\n)\nin\n1942\nand went on to write a thesis\nLa notion de multiplicité en algèbre et en géometrie algébrique\nⓉ\n(\nThe concept of multiplicity in algebra and algebraic geometry\n)\n. He went to the United States to complete his research and was awarded a Master of Arts and then a Ph.D. from Princeton University in\n1947\nfor his thesis\nUltrafilters and Compactification of Uniform Spaces\n.\nReturning to France, Samuel worked at the National Centre for Scientific research from\n1947\nto\n1949\n. During this time he married Nicole Hermann on\n23\nJuly\n1948\n; they had two children, Laurent and Fabien. In\n1949\nSamuel was appointed as Maître de Conférences at the Faculty of Science at Clermont-Ferrand and was later appointed as professor there. He continued to work there until\n1961\n.\nRibenboim writes in the preface of\n[\n1\n]\nand\n[\n2\n]\n:-\nThese volumes will allow a convenient way to study the brilliant work of this legendary mathematician. For many of the young generation, he is famous and enormously appreciated for his books.\nIndeed Samuel is famed for his book so it is fitting that we look at some of these texts. He published\nAlgèbre locale\nin\n1953\nwhich is a short book of only\n76\npages.\nChevalley\nreviewed the work writing:-\nThis is a survey of the technical algebraic devices which are used in the local study of an algebraic variety in the neighbourhood of one of its points or of a subvariety. These devices have been developed by various authors:\nW Krull\n, who introduced the fundamental notion of a local ring,\nO Zariski\n, I Cohen, P Samuel, and\nC Chevalley\n. Their results are scattered among various papers, a circumstance which made it difficult up to now to obtain a general view of the subject. This monograph contains a systematic and logical presentation of these results, together with some new improvements. ...\nThis little book contains, in a condensed form, an encyclopedic repertorium of almost everything which is known on the subject. Sufficient indications of the proofs are given to make it easy to reconstruct them entirely. The nature of the applications of the various theorems to\nalgebraic geometry\nis in general rapidly explained.\nIn\n1955\nSamuel published\nMéthodes d'algèbre abstraite en géométrie algébrique\nⓉ\n(\nMethods of abstract algebra in algebraic geometry\n)\nwhich aimed to give a complete foundation for algebraic geometry:-\nThe theory is developed systematically and in such a way as to include the most general versions of the fundamental facts ... The book is not intended to be an easy introduction to the field\n(\nthough, as a matter of fact, large parts can be read by anyone with a reasonable knowledge of commutative algebra, and suitable amplification could make most of the rest comprehensible to such a person\n)\n; rather, it is designed to be of help to algebraic geometers. For these, its utility will consist in the systematic presentation of the fundamental facts in their most general contexts, together with many simplified proofs of more esoteric results.\nIt is for the two volume work\nCommutative algebra\nby\nZariski\nand Samuel that Samuel is perhaps best known. The first volume appeared in\n1958\nand M Henriksen writes in a review:-\nBefore the appearance of the present work, the only systematic account of commutative algebra was to be found in\nKrull\n's 'Idealtheorie'\nⓉ\n(\nTheory of ideals\n)\n. The reader of 'Commutative algebra' will receive a presentation of much of the research in this area over the last twenty years, a good deal of which was inspired by\nKrull\n's classic work. In addition, he will receive a leisurely and thorough exposition of the subject matter, suitable not only for the expert, but for the student as well.\nWhen the second volume appeared in\n1960\nH T Muhly wrote:-\nIt would be an under-statement to say that the second volume of this work lives up to the standards and expectations set by the first, because the scope and style of the final volume could not have been anticipated even though the first volume contained an outline of the authors' total program and ample evidence of their expository skill. Unlike the first, however, the second volume is concerned in large measure with those parts of commutative algebra that are the fruits of its union with algebraic geometry ...\nAnother beautiful little book by Samuel is\nAnneaux factoriels\nⓉ\n(\nFactorial rings\n)\nwhich was published in\n1963\nand contained the lecture course that Samuel gave on unique factorisation domains in Paris in\n1961\n-\n62\n. Another text is\nLectures on old and new results on algebraic curves\nwhich was published in\n1963\nand explained the results of Grauert and Samuel on\nMordell\n's conjecture over function fields. This work is around\n130\npages and not much longer than this is his\n1967\nbook\nThéorie algébrique des nombres\nwhich:-\n... covers the basic facts of\nalgebraic number theory\nstarting with the divisibility theory in principal ideal domains and ending with the unit theorem, finiteness of the class number and the more elementary theorems of the\nHilbert\nramification theory.\nSamuel had been an important member of the\nBourbaki\ngroup of mathematicians and had joined around the end of World War II and became a second generation member of the group along with\nLaurent Schwartz\n,\nJean-Pierre Serre\n,\nJean-Louis Koszul\n,\nJacques Dixmier\n,\nRoger Godement\nand\nSamuel Eilenberg\n. He acted as secretary to\nBourbaki\nfor a while after\nDieudonné\nleft that role and before\nCartier\ntook over.\nIn\n1961\nSamuel was appointed as professor at Université Paris-Sud XI - Orsay. He became involved in non-mathematical work and he became interested in various issues relating to world affairs. In\n1973\nhe was one of a number who put out a statement expressing their unhappiness at the state of the world. The statement began:-\nIt is now more than fifty years since World War I shattered all hope that Europe and, in its wake, the rest of the world, would advance on paths other than those of systematic blood-letting toward greater democracy, economic and social justice, and what was then considered to be \"Civilization.\" The world we have fallen heir to is a world in which violence, overt or covert, of weapons, institutions, and economic scarcity, reigns supreme; it is a world of fear and terror.\nA recent statement by Samuel in a letter to the\nNotices of the American Mathematical Society\n(\nMarch\n2005)\nexplained his association with \"Friends of the Earth\":-\n... my friend\nGrothendieck\n's influence made me become an environmental activist. I worked mostly at \"Les Amis de la Terre\", the French branch of \"Friends of the Earth International\", an N.G.O.\n[\nnon-governmental organisation\n]\n. I chaired it from\n1982\nto\n1989\n. At that time it was not involved in electoral politics. My personal involvements in elections and ecology parties were few and far between.\nHe wrote a number of texts on environmental issues such as\nÉcologie, détente au cycle infernal\nⓉ\n(\nEcology, relaxing the infernal cycle\n)\n(1973)\n,\nLe Nucléaire en questions\nⓉ\n(\nThe nuclear question\n)\n(1975)\nand a book on global warming in\n1980\n:\nl'Éffet de serre\nⓉ\n(\nThe Greenhouse Effect\n)\n.\nSamuel has another, rather unusual interest. He is fascinated by Amazons, female strength and women with muscles, and his extensive research in these areas was published in his scholarly book\nAmazones, Guerrières et Gaillardes\nⓉ\n(\nAmazons, warriors and strong women\n)\n(1975)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}