{
  "nome_completo": "Pierre Léon Boutroux",
  "nome_curto": "Pierre Boutroux",
  "ano_nascimento": "1880",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boutroux/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Boutroux\n's father, Émile Boutroux, was a famous philosopher of science. His mother was Aline Catherine Eugénie Boutroux who was a sister of\nPoincaré\nand so he was also related to the other men of great distinction in that family.\nBoutroux was educated in Paris at the École Normale Supérieure and he received his licentiate with a thesis, which was published by the University of Paris,\nL'imagination et les mathématiques selon Descartes\nⓉ\n(\nImagination and mathematics according to Descartes\n)\n. Following this he was appointed as a lecturer in mathematics at the University of Montpellier before becoming professor of integral calculus at Poitiers in\n1908\n.\nAlthough Boutroux held this chair in Poitiers for twelve years he spent much of the time at other institutions. He spent\n1909\nas a visiting professor at the University of Nancy. There he lectured at the Collège de France on functions which are the solutions of first order\ndifferential equations\n. Following this he went to the United States where he occupied the mathematics chair at Princeton from\n1913\nuntil\n1914\n. He became chairman of the graduate mathematics department there in\n1914\n. When World War I broke out, however, he returned to France to join the army.\nDuring the war Boutroux served bravely in the French army. At the end of the war he did not return to the United States but decided to stay in France. In\n1920\nhe resigned the chair in Poitiers which he had held since\n1908\nand accepted a chair in the history of science at the Collège de France. Sadly he died in\n1922\nand the chair in the history of science was discontinued. All historians of science feel great sadness at knowing that had Boutroux occupied the chair for many years then his brilliance would have established a chair which almost certainly would have continued.\nBoutroux's mathematical work mainly consists of extending and clarifying work of others, in particular that of\nPainlevé\n,\nPoincaré\nand\nÉmile Picard\n. He worked on multiform functions and also continued\nPainlevé\n's work on singularities of differential equations. Although his work in these areas is a useful contribution, this was not the area in which Boutroux excelled. That area was the history and philosophy of mathematics.\nIn the history and philosophy of mathematics Boutroux published an extremely important work\nLes principes de l'analyse mathématique\nⓉ\n(\nPrinciples of mathematical analysis\n)\nin two volumes; Volume\n1\nin\n1914\nand Volume\n2\nin\n1919\n.\nCalinger writes in\n[\n1\n]\n:-\nThese volumes contain a comprehensive view of the whole field of mathematics in the second decade of the twentieth century, both as a body of knowledge and as a mode of thought. Boutroux's topics range from rational numbers to an analysis of the notion of a function. In light of the historical method used by the author, he might better have entitled this book \"An Analysis of the Progress of Mathematical Thought\".\nAnother, perhaps even more important work, is Boutroux's\nL'idéal scientifique des mathématiciens dans l'antiquité et dans le temps modernes\nⓉ\n(\nThe scientific ideal of mathematicians in antiquity and in modern times\n)\n. His main thesis in this work is to argue for the unity of the history of science which, he argues, can only be understood when considered as a whole and not by specialist examination of the parts. Boutroux also argues that there is no single way to approach a problem, but the nature of the problem itself dictates the best way to attack it.\nBoutroux produced an edition of\nPascal\n's works which was published from\n1908\nonwards with a second edition appearing after Boutroux's death in\n1929\n. He also contributed to producing a volume on the scientific and philosophical works of\nPoincaré\n. Other work included a study of dynamics before\nNewton\nwhere he improved on\nDuhem\n's work, and an analysis of the work of\nPaul Tannery\nwhich was not published until\n1938\n, sixteen years after Boutroux's death.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}