{
  "nome_completo": "Pierre Varignon",
  "nome_curto": "Pierre Varignon",
  "ano_nascimento": "1654",
  "ano_morte": "1722",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Varignon/",
  "lugar_nascimento": "Caen, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Varignon\nwas born into a Catholic family who were by profession contracting masons. As well as his father undertaking this type of manual work, his brother also became a mason. The family was poor and could offer Pierre no financial support. He commented himself that the only thing he received from his family was technical knowledge. Although this seems to be said by Varignon with the suggestion that he was rather hard done by, indeed the technical knowledge he received did prove very valuable to him later in his life. He was educated in theology and philosophy at the Jesuit College in Caen where he trained for the priesthood. On\n19\nDecember\n1676\nhe took holy orders and was later admitted into the priesthood. Then, being what today would be described as a mature student, he studied at the University of Caen where he received his M.A. in September\n1682\n. In March of the following year he became a priest in the Saint Ouen parish in Caen.\nIn Caen he became friends with a fellow student Charles Castel, Abbé de Saint-Pierre, who arranged for Varignon to receive an income of\n300\nlivres. The two shared lodgings and it appears that at this time Varignon continued his studies at the University of Caen. Up to this point he had taken a fairly standard route to the priesthood but his life changed course when, quite by chance, he came across\nEuclid\n's\nElements\nand began reading the classic text. Led into mathematics by reading\nEuclid\n, he then read\nDescartes\n'\nGéométrie\nand thereafter devoted himself to the mathematical sciences. Of course as a Jesuit he belonged to an Order that valued scholarship and teaching so Varignon was able to devote the rest of his life to teaching. In\n1686\n, together with his friend Charles Castel, Abbé de Saint-Pierre, Varignon went to Paris and immediately made contact with mathematicians and scientists there.\nIn\n1687\nVarignon published\nProjet d'une nouvelle méchanique\nwhich studied composition of forces using\nLeibniz\n's differential calculus in the study of mechanics. He dedicated this work to the\nAcademy of Sciences\nand it was clearly highly thought of since he was elected to the Academy in the same year. Also in\n1688\nhe became professor of mathematics at the Collège Mazarin, occupying a newly created chair, where he began to teach mathematics at the level of current research at the time. In\n1704\n, in addition to the chair at Collège Mazarin, he became professor of mathematics at the Collège Royal. His lectures at the Collège Mazarin were published as\nélémens de mathématiques\n...\n(1731)\nand we discuss their content at the end of this article.\nVarignon's chief contributions were to graphical statics and mechanics. From the earliest of his publications such as\nProjet d'une nouvelle méchanique\nin\n1687\n, it was clear that he understood the value of\nLeibniz\n's calculus. This was surprisingly soon after\nLeibniz\n's two articles on the new differential calculus were published in the\nActa Eruditorum\nin October\n1684\nand June\n1686\n. Although Varignon made no major mathematical contributions, he developed analytic dynamics by adapting\nLeibniz\n's calculus to the inertial mechanics of\nNewton\n's\nPrincipia\nbeing one of the first French scholars to recognise the power and importance of the calculus. While those like\nHuygens\nadmired\nNewton\nas a mathematician, they did not accept a physical theory based on action at a distance. Varignon put aside these philosophical worries and began to rework large sections of the\nPrincipia\ninto the\nLeibniz\n's approach to the differential and integral calculus.\nIn\n1644\nTorricelli\npublished in\nDe motu aquarum\nwhat has now became known as\nTorricelli\n's law. This states that the speed of a liquid flowing under the force of gravity out of an opening in a tank is proportional to the square root of the vertical distance between the liquid surface and the centre of the opening, and to the square root of twice the acceleration due to gravity. Experimental evidence had been found to support the law but in\n1695\nVarignon tried to deduce it. F Sebastiani, reviewing\n[\n6\n]\n, writes:-\n[\nVarignon\n]\nassumed that, during a small time interval, one can both disregard the variation of the level of the free surface and consider the motion to be essentially uniform\n[\npermanent\n]\nfor the whole liquid. Varignon's proof rests on the idea that the small quantity of liquid that escapes at each moment gets all of its motion from the pressure exercised by the \"weight of the columns of liquid with base equal to the opening\". This extremely interesting proof nevertheless remains very uncertain in infinitesimal manipulations with respect to the use of the power and quantity of motion. For Varignon, to have derived\nTorricelli\n's law jointly from the axiom according to which \"causes are always proportional to their effects\", from the principles of mechanics and from the general laws of motion was to have proved it \"by reason alone\". He thus implicitly attributed to mechanics the same demonstrative perfection that Euclidean geometry had been thought to possess.\nAmong his other work was a publication in\n1699\non applications of the differential calculus to fluid flow and to water clocks. In\n1702\nhe applied the calculus to clocks driven by a spring. Varignon studied the problem of the motion of projectiles in resisting media in eleven long memoirs which he presented to the\nAcademy of Sciences\nbetween\n1707\nand\n1711\n. He gave a new unified treatment of particular cases which had already been studied by\nWallis\n,\nHuygens\n,\nLeibniz\nand\nNewton\n. Again this work is developed using\nLeibniz\n's approach to the calculus. See\n[\n4\n]\nfor further details of his memoirs on this topic. In\n1724\nVarignon's\nNouvelle mécanique\nwas published which gave the best approach to geometrical statics until the work of\nPoinsot\nover\n75\nyears later. Varignon's work was to have a major influence on\nEuler\nin his study on particle dynamics.\nVarignon played a major role in defending the calculus from attacks. For example in\n1700\nRolle\nargued against the calculus both on the grounds that it was without sound foundation and that it led to errors. Varignon argued before the\nAcademy of Sciences\nthat\nRolle\n's arguments which suggested that the calculus led to errors was wrong. The two mathematicians maintained a vigorous exchange for five years until the\nAcademy of Sciences\ndecreed that the debate was ended.\nIn\n1731\n, nine years after Varignon's death, his notes for teaching mathematics in schools was published as\nÉlémens de mathématiques\n... . It\n[\n16\n]\n:-\n... is organised in two parts, the first part explaining concepts of arithmetic and elementary algebra and the larger second part covering topics in Euclidean geometry.\nThe book contains what is today known as Varignon's parallelogram theorem: The figure formed when the mid-points of the sides of a quadrilateral are joined in order is a parallelogram. He gives a completely rigorous proof of this theorem, being the first to do so.\nVarignon was elected to the French\nAcademy of Sciences\nin\n1688\n, the\nBerlin Academy of Science\nin\n1713\nand the\nRoyal Society of London\nin\n1718\n.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}