{
  "nome_completo": "Pierre Joseph Louis Fatou",
  "nome_curto": "Pierre Fatou",
  "ano_nascimento": "1878",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fatou/",
  "lugar_nascimento": "Lorient, France",
  "lugar_morte": "Pornichet, France",
  "biografia": "Pierre Fatou\n's parents were Prosper Ernest Fatou\n(\nknown as Ernest\n)\n(1832\n-\n1891)\nand Louise Eulalie Courbet\n(1844\n-\n1911)\n. Ernest Fatou began his navy career in\n1847\nand became a Lieutenant in\n1861\n. He was made knight of the Légion d'Honneur in\n1865\nand ended his navy career as a captain of a frigate. He was the son of navy pharmacist Jean-Baptiste Fatou and his wife Jeanne Mougeat. Ernest Fatou had four younger brothers, Ambroise\n(\na medical doctor\n)\n, Eugène\n(\na medical doctor\n)\n, Émile\n(\na navy captain\n)\nand Alfred\n(\na pharmacist\n)\n. Pierre's mother, Louise Eulalie Courbet, was the daughter of Pierre Courbet, an artillery Lieutenant in the navy, and Félice Fardet. Ernest and Louise Fatou were married on\n25\nJuly\n1866\n. Pierre was the youngest of his parents' four children having an older brother Louis Fatou\n(1867\n-\n1957)\n, and two older sisters Ernestine Fatou\n(1869\n-\n1911)\nand Jeanne Fatou. Louis Fatou followed a family tradition, joining the navy and becoming an admiral. Pierre, the subject of this biography, might have followed the same route into the navy, which it appears his family would have liked, but his health was not sufficiently good for him to pursue this type of career.\nFatou studied at the lycée in Lorient. When he was sixteen years old, he was taught at this school by the philosopher Émile-Auguste Chartier\n(1868\n-\n1951)\nwho is better known by the pseudonym Alain which he later adopted. Alain wrote in the Chapter 'Lorient' in his book\nHistoire de mes pensées\nⓉ\n(\nThe history of my thoughts\n)\n(1936)\n:-\nI had during those years a simple and modest pupil, who was a mathematical genius. I taught him somehow the philosophy of these things; he easily understood all this and never made any objection. ... he was the author of a thesis which was understood by perhaps two men in the world. His name was Fatou.\nLeaving Lorient in\n1894\n, Fatou went to Paris where he studied elementary mathematics and special mathematics at the Collège Stanislas for three years. He was awarded the First Prize in Mathematics in the year\n1896\n-\n97\n. He was taught mathematics at the College by the Marianist Brother Charles Biehler\n(1845\n-\n1906)\nwho was director of studies at the College. Biehler had been awarded a Ph.D. in\n1879\nfor his thesis\nSur les développements en série des fonctions doublement périodiques de troisième espèce\nⓉ\n(\nOn series expansions of doubly periodic functions of the third kind\n)\nwhich he had dedicated to his professor\nCharles Hermite\n. Fatou spent the year\n1897\n-\n98\nat the lycée Saint-Louis in Paris preparing for the entrance examinations to the École Normale Supérieure and the École Polytechnique. He was placed first in the 'concours général'.\nFatou entered the École Normale Supérieure in Paris in\n1898\nto study mathematics having been ranked first in the entrance examination. He graduated in\n1901\n, being ranked second in the\nagrégation\n(\nwhich qualified him to teach in a collège or lycée\n)\n. He would have had little trouble getting a job as a secondary teacher of mathematics but he wanted to carry on working towards his doctorate and another opportunity arose.\nJules Tannery\nwas at this time the assistant director of the École Normale Supérieure and he believed that the Paris Observatory, which had declined over the previous years, needed to appoint top mathematics graduates who were intending to undertake research towards doctorates in mathematics. Fatou was just such a graduate and having a position in the Paris Observatory would benefit both the Observatory and allow him to work on his thesis in Paris without having teaching commitments.\nHaving been appointed to the astronomy post at the Paris Observatory in November\n1901\n, Fatou worked under Maurice Loewy\n(1833\n-\n1907)\nwho had been made director of the Observatory in\n1896\nand had done much in reorganising it. Fatou made a promising start to his career at the Observatory and was rapidly promoted but by\n1906\nhis colleagues were feeling that his heart wasn't in his work. An Observatory report of that year states\n(\nsee, for example\n[\n6\n]\nor\n[\n7\n]\n)\n:-\nM Fatou proved to be very active and zealous before his nomination. Student without salary in November\n1901\n, he was, on the suggestion of the Director, promoted \"aide-astronome\" on\n1\nJanuary\n1904\nand, three months later, he became assistant-astronomer; he thus had an exceptional promotion and we thought he was an excellent acquisition. Unfortunately this hope was entirely thwarted. Not only has this civil servant produced almost nothing during these two years, but his very limited contribution to the work has been a real hindrance for his colleagues. It is because of him that the publication of the volume of observations for\n1902\nwas delayed by more than six months ... An abnormal and disturbing situation is established that cannot last.\nOne should treat this with a little caution since Fatou's health was poor and he applied for sick leave from the Observatory from\n1\nMay\n1906\nto\n31\nAugust\n1906\n. He probably suffered from depression which led to lack of sleep and palpitations. He also had stomach problems so health may have been a major factor in what his superiors at the Observatory considered his poor performance. However, Chazy suggests Fatou's work at the Observatory was excellent despite his health problems\n[\n10\n]\n:-\nFatou's health was often precarious, and the observations put his physical resistance to a severe test; but he was very conscientious in all the tasks that were entrusted to him, in particular in the redaction of the observations, in the discussion of instrumental constants.\nHowever it was mathematics rather than astronomy that was Fatou's passion. In December\n1904\nhe joined the\nFrench Mathematical Society\nand was working hard on the mathematical research for his thesis. He began publishing the results of his mathematical research in\n1904\nwith the short paper\nSur les séries entières à coefficients entiers\nⓉ\n(\nOn  entire series with integer coefficients\n)\nappearing in that year. In\n1905\nhe published four short papers:\nSur l'intégrale de Poisson et les lignes singulières des fonctions analytiques\nⓉ\n(\nOn Poisson's integral and singular lines of analytic functions\n)\n;\nSur quelques théorèmes de Riemann\nⓉ\n(\nOn some theorems of Riemann\n)\n;\nSur l'approximation des incommensurables et les séries trigonométriques\nⓉ\n(\nOn irrational approximation and trigonometric series\n)\n; and\nLa série de Fourier et la série de Taylor sur son cercle de convergence\nⓉ\n(\nThe Fourier series and the Taylor series on the circle of convergence\n)\n. Three more papers were published in\n1906\n:\nSur le développement en série trigonométrique des fonctions non intégrables\nⓉ\n(\nOn trigonometric series in the development of non-integrable functions\n)\n;\nSéries trigonométriques et séries de Taylor\nⓉ\n(\nTrigonometric series and Taylor series\n)\n; and\nSur l'application de l'analyse de Dirichlet aux formes quadratiques à coefficients et à indéterminées conjuguées\nⓉ\n(\nOn the application of Dirichlet's analysis of  quadratic forms to coefficients and conjugal indeterminates\n)\n.\nIn\n1906\nhe submitted his thesis,\nSéries trigonométriques et séries de Taylor\nⓉ\n(\nTrigonometric series and Taylor series\n)\nwhich was on integration theory and complex function theory. Fatou proved that if a function is\nLebesgue\nintegrable, then radial limits for the corresponding\nPoisson\nintegral exist almost everywhere. This result led to generalisations by\nIvan Privalov\n,\nAbraham Plessner\nand\nMarcel Riesz\n. Although not giving a complete solution, Fatou's work also made a major contribution to finding a solution to the related question of whether a conformal mapping of Jordan regions onto the open disc can be extended continuously to the boundary.\nLebesgue\n, who valued Fatou's work very highly, read his thesis and reported on\n26\nFebruary\n1906\n(\nsee\n[\n2\n]\n)\n:-\nIn general, it seems to me that Fatou does not highlight very well the interest in the questions he deals with and the results he obtains ... Fatou seems also to quite readily suppose that everybody knows or sees the same thing as he does and gives rather few explanations.\nThis report is quite in keeping with the modesty we know that Fatou displayed. He had not stressed the importance of his work and he had assumed many things without explanation because they were \"obvious\" to him.\nPaul Painlevé\nalso read the thesis and reported on it. After considering\nLebesgue\n's suggestions, he resubmitted the thesis and, on\n14\nFebruary\n1907\n, Fatou received his doctorate for this important work.\nWe have a description of Fatou by his nephew Robert Fatou\n(1895\n-\n1981)\n, the son of Pierre's older brother Louis Fatou:-\nIn a family where no doubt many members were unable to understand him, or even to suspect the extent of his intelligence, it is easy to be astonished at his appearance, the neglect of his clothes, or that of his house, his total indifference to worldly matters like the tone of his conversation, which remained dull, slow, even hesitant, as long as the subject matter did not arouse his curiosity. Concerning his passion for mathematics, of course, none of his family was able to follow it. He was given confidence from his exceptional scientific knowledge, because of his qualifications and the brilliant course of his career through the École Normanle Supérieure. His family were very flattered, but some would have preferred that Pierre Fatou had been given a more modest intellectual capacity, less abstract and hence more accessible, but with a less original exterior more consistent with the traditions of his community.\nAt the time he joined the\nFrench Mathematical Society\nin late\n1904\n, Fatou was living with his mother at\n172\nBoulevard Montparnasse, Paris, close to the Paris Observatory. He continued to live with his mother at this address until her death in\n1911\n. His health continued to cause him problems and he again asked for sick leave for the months of March and April in\n1912\n. Certainly his health was not good enough to see him given military duties during World War I and he continued to work at the Observatory. Following the death of his mother, Fatou continued to live at\n172\nBoulevard Montparnasse.\nThe book\n[\n2\n]\npresents a beautiful historical account of the global theory of iteration of complex analytic functions. Fatou enters this history in a rather complicated way and the book does an excellent job in explaining an interesting episode in the history of mathematics. In\n1915\n, the\nAcadémie des Sciences\nin Paris gave the topic for its\n1918\nGrand Prix. The prize would be awarded for a study of iteration from a global point of view. The author of\n[\n2\n]\nsuggests that mathematicians such as\nPaul Appell\n,\nÉmile Picard\n, and\nGabriel Koenigs\nhad put forward the idea to the\nAcadémie des Sciences\nbecause they were hoping for developments of\nPaul Montel\n's concept of normal families. Fatou wrote a long memoir which did indeed use\nMontel\n's idea of normal families to develop the fundamental theory of iteration in\n1917\n. Although we do not know for certain that he was intending to enter for the Grand Prix, it seems almost certain that he undertook the work with that in mind.\nGiven that the topic had been proposed for the prize, it is not surprising that another mathematician would also work on the topic, and indeed\nGaston Julia\nalso produced a long memoir developing the theory in a similar way to Fatou. The two, however, chose different ways to go forward. During the later half of\n1917\nJulia\ndeposited his results in sealed envelopes with the\nAcadémie des Sciences\n. Fatou, on the other hand, published an announcement of his results in the note\nSur les substitutions rationnelles\nⓉ\n(\nOn rational substitutions\n)\nin the December\n1917\npart of\nComptes Rendus\n. It later became evident that they had discovered very similar results.\nJulia\nwrote a letter to\nComptes Rendus\nconcerning priority which was published on\n31\nDecember\n1917\n.\nJulia\nhad asked the\nAcadémie des Sciences\nto inspect his sealed envelopes and\nGeorges Humbert\nhad been asked to carry out the task. In the same\n31\nDecember\n1917\npart of\nComptes Rendus\nGeorges Humbert\nhas a letter reporting on\nJulia\n's papers. Almost certainly as a result of these letters Fatou did not enter for the Grand Prix and it was awarded to\nJulia\n. Fatou did not lose out completely, however, and even though he had not entered for the prize, the\nAcadémie des Sciences\ngave him an award for his outstanding\n280\n-page paper on the topic,\nSur les équations fonctionnelles\nⓉ\n(\nOn functional equations\n)\npublished in\n1920\n. Whether\nJulia\nor Fatou deserves the credit of having priority matters little since their work was certainly totally independent. At Fatou's funeral\nHenri Mineur\ndelivered a speech in which he said:-\nTo one of his most remarkable discoveries, i.e., to the iteration of rational functions, the name of Fatou is inalterably tied: he was the first to dare to attack the problem, the first one to solve it.\nIn\n1921\n, following the death of\nGeorges Humbert\n, the mathematics chair at the Collège de France became vacant. Among the candidates were Fatou and\nLebesgue\n. It was decided that the\nAcademy of Sciences\nwould be asked to recommend which candidate should be appointed and the\nAcademy\ncast\n35\nvotes for\nLebesgue\nand\n29\nfor Fatou.\nIn contrast to the negative report of\n1916\nabout his contributions to the work of the Observatory, he had made important contributions to astronomy. Using existence theorems for the solutions to differential equations, Fatou was able to prove rigorously certain results on planetary orbits which\nGauss\nhad suggested but only verified with an intuitive argument. He also studied the motion of a planet in a resistant medium in\nSur le mouvement d'une planète dans un milieu résistant\nⓉ\n(\nOn the motion of a planet in a resistant medium\n)\n(1922)\nwith the intention of explaining how twin stars would form with the capture of one moving in the atmosphere of the other. The position of \"astronomer\" at the Observatory became open in\n1927\nand Pierre Salet\n(1875\n-\n1936)\n, Armand Lambert\n(1880\n-\n1944)\nand Fatou competed for the position. Salet was appointed in\n1927\nbut the position of \"astronomer\" again became vacant in\n1928\nand Armand Lambert and Fatou competed again. The Observatory voted to appoint Lambert but the final decision was made by the\nAcademy of Sciences\nwhich reversed the decision, voting in favour of Fatou on\n25\nJune\n1928\n. He was appointed as \"astronomer\" on\n7\nJuly\n1928\n.\nFrom the time that Fatou joined the\nFrench Mathematical Society\nin\n1904\nhe took a major role in its operations. He held a number of important positions in the Society, culminating in his election as President for the year\n1926\n-\n27\n.\nWe have mentioned some of his important mathematical work above. We should also mention his work on permutable functions\nSur l'itération analytique et sur les substitutions permutables\nⓉ\n(\nOn analytical iteration and the permutable substitutions\n)\n(1923\n-\n24)\n, one major paper\nSubstitutions analytiques et équations fonctionnelles à deux variables\nⓉ\n(\nAnalytical substitutions and functional equations in two variables\n)\non iterating functions of two complex variables, published in\n1924\n, as well as ten further papers on iterating functions of a complex variable. His famous work involves\nTaylor\nseries where he examined the convergence and the analytic extension of the series. Perhaps Fatou's most famous result is that a harmonic function\nu\n>\n0\nu > 0\nu\n>\n0\nin a ball has a non-tangential limit almost everywhere on the boundary.\nEdouard Goursat\ninvited Fatou to prepare a revised second edition of\nAppell\nand\nGoursat\n's\nThéorie des Fonctions Algébrique\nⓉ\n(\nAlgebraic complex analysis\n)\n(1895)\nand add material on automorphic functions. Fatou wrote such a major exposition of the subject that it was decided to publish Fatou's material on automorphic functions as a separate volume, becoming Volume\n2\nof the new edition of\nThéorie des Fonctions Algébrique\nⓉ\n(\nAlgebraic complex analysis\n)\nwhich was published in\n1930\n, the year after Fatou's death, as a three author work. You can read a review of Fatou's volume at\nTHIS LINK\n.\nIn the summer of\n1929\nFatou went on holiday to Pornichet, a seaside town to the west of Nantes. He was staying in Le Brise-Lames Villa near the port and it was there at\n8\np.m. on Friday\n9\nAugust that he died in his room. No cause of death was given on the death certificate but Audin argues\n(\n[\n6\n]\nor\n[\n7\n]\n)\nthat he died as a result of a stomach ulcer that burst. Fatou's nephew Robert Fatou wrote:-\nHaving never thought it useful during his life to consult a doctor, my dear uncle died suddenly in a hotel room in Pornichet.\nFatou's funeral was held on\n14\nAugust in the church of Saint-Louis, and he was buried in the Carnel Cemetery in Lorient.\nWe have already quoted from Fatou's nephew Robert Fatou saying a little of Fatou's character. Let us give some further quotes on this. Robert Fatou wrote\n(\nsee for example\n[\n2\n]\n)\n:-\n... I started to see, under the extreme originality of my uncle, a heart of gold with an imperturbable frankness and freedom of judgement, hindered by neither convention nor the opinions of others. Nevertheless, his natural gentleness forbade him to offend his neighbour, and he preferred to remain quiet rather than to display contrary feelings to others.\nOne passion in Fatou's life, other than mathematics, was music. Léon Bloch writes\n[\n9\n]\n:-\nMusical passion led him, when he was quite young, to make the pilgrimage to Bayreuth where he knew the historic evenings of the performance of the Ring Cycle. In those last years, he was little by little conquered by the tragic charm of Russian music, by the bright colour of the Spanish, by all this exoticism, so moving that it is sometimes unfair to our French music.\nAbout Fatou's love of music, his nephew Robert Fatou wrote:-\nAlthough he never \"learned\" music, Pierre Fatou certainly found in it a huge pleasure ...\n[\nHe\n]\nhad the gift of being able to read music and he savoured it. He used to buy the scores of his favourite composers, the German romantics first, then the Russians for whom he conceived a great admiration. ... In concert, he used to follow the interpretation carefully on his staves and, back home, he \"heard\" again his favourite arias while reading the pages of his notebooks. Sometimes, when his memory was unfaithful, he helped himself with a piano or viola to remember a melody. Then a smile would brighten his face, showing his deep satisfaction.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}