{
  "nome_completo": "Pietro Abbati Marescotti",
  "nome_curto": "Pietro Abbati Marescotti",
  "ano_nascimento": "1768",
  "ano_morte": "1842",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Marescotti/",
  "lugar_nascimento": "Modena, Duchy of Modena and Reggio (now Italy)",
  "lugar_morte": "Modena, Duchy of Modena and Reggio (now Italy)",
  "biografia": "Pietro Abbati Marescotti\nwas given the name Pietro Abbati. We shall explain below when and why the name Marescotti was added to his given name. He was descended from a\n16\nth-century noble family, and the nephew of a son of Pietro Andrea Abbati\n(1693\n-\n1762)\nwho was famous both as an engineer and as a poet. Pietro Abbati was brought up in Modena where he attended the university, studying mathematics with teachers Luigi Fantini, Paolo Cassiani and Giovanni Battista Venturi. Let us say a little about these teachers.\nPaolo Cassiani\n(1743\n-\n1806)\ntrained as a lawyer but he was always fascinated by mathematics which he studied in his spare time. He was appointed to the University of Modena as professor of mathematics in\n1774\n. Every two years, he  alternated in teaching mathematics and philosophy with Giovan Battista Venturi. He published little in the way of research but made many changes to the teaching of mathematics in the University of Modena, introducing the theory of equations as well as analytic mechanics following Lagrange's development of the subject. He taught the foundations of analysis course at the university. Giovanni Battista Venturi\n(1746\n-\n1822)\nwas educated in the seminary in Reggio Emilia, where later he was appointed to teach logic in\n1769\n; he was ordained in the same year. In\n1774\nhe was appointed as professor of geometry and philosophy at the University of Modena. In\n1786\nhe became professor of experimental physics at Modena. He is remembered today for the \"Venturi effect\", a result concerning fluid flow through a pipe, which he published in\n1797\n. We have been unable to find many details of Luigi Fantini, except that he taught geometry at the University of Modena. His name appears on the staff of the University of Modena from the academic year\n1772\n-\n73\nto the year\n1790\n-\n91\nwhen he retired for reasons of poor health caused by failing eyesight.\nAbbati was three years younger than\nPaolo Ruffini\nbut they met when both were students at the University of Modena; they became friends and mathematical collaborators.\nRuffini\nwas taught by the same three teachers that we mentioned in the previous paragraph. In fact in\n1787\nPaolo Cassiani became a councillor for the estates of the Este family who ruled Modena, and Ruffini, still a student at this time, took over teaching the course. It certainly proved advantageous to both Abbati and\nRuffini\nthat they could discuss mathematics together, particularly given that both were very talented. Although Abbati had no official position in mathematics after he graduated from the University of Modena, nevertheless, he was encouraged to undertake research in mathematics by\nRuffini\nwhich he did very successfully. In order to understand a little of the background to his life we need to look at the events that were happening at this time in Modena and the surrounding area.\nThis was a time of wars following the French Revolution. By early\n1795\nFrance had won victories on every front. In northern Italy the French army threatened Austrian-Sardinian positions, but its commander failed to take the initiative. In March\n1796\nhe was replaced by Napoleon Bonaparte who executed a brilliant campaign of manoeuvres. Taking the offensive on\n12\nApril he successively defeated and separated the Austrian and the Sardinian armies and then marched on Turin. The King of Sardinia asked for an armistice and both Nice and Savoy were annexed to France. Bonaparte continued the war against the Austrians and occupied Milan but was held up at Mantua. Before Mantua fell to his armies he signed armistices with the duke of Parma and the duke of Modena. Napoleon's troops occupied Modena which, in\n1796\n, became part of  the Cisalpine Republic consisting of Lombardy, Emilia, Modena and Bologna. Taken by the Austrians on\n27\nApril\n1799\n, it was recaptured by Napoleon on\n2\nJune\n1800\n. It was renamed the Italian Republic in\n1802\n, still headed by Napoleon as President. It had a number of Departments, one being Panaro with Modena as its capital. In\n1814\nthe Duchy of Modena and Reggio was restored headed by Francis IV, Duke of Modena.\nDuring the Napoleonic period, Abbati was member of the Society of Mechanical Arts\n(\nSocietà di Arti Meccaniche\n)\nand the Agricultural Society in the Department of Panaro\n(\nSocietà Agraria del Dipartimento del Panaro\n)\n. The Accademia dei Dissonanti had been founded in Modena around\n1680\n. Interrupted by Napoleon's victory and occupation, it resumed its sessions in\n1807\nduring the time of the Italian Republic. Napoleon decreed in\n1810\nthat it join with the Society of Mechanical Arts and the Agricultural Society. Abbati became, therefore, a member of this combined Society which was renamed the Royal Academy of Sciences, Arts and Letters of Modena\n(\nAccademia di Scienze Lettere e Arti di Modena\n)\n. Both Abbati and his friend\nRuffini\nbecame involved in the administration of the new Republic. It appears that Abbati did this with more enthusiasm than\nRuffini\n. This may have been due to Ruffini holding academic positions unlike Abbati who, although continuing to work on mathematics, had no teaching posts.\nFirst Abbati was nominated as a consultant to the Ministry of Public Economy and Education of the Republic, and in\n1807\nhe was employed as an advisor to this Ministry. In\n1810\nhe took on the particular responsibility for waterworks and roads. After the Duchy of Modena and Reggio was restored in\n1814\n, the Concert of Europe was adopted as a means of resolving disputes by the major powers after the defeat of Napoleon. At this time Francis IV, Duke of Modena, appointed Abbati to continue to deal with problems relating to the water and road systems of the Duchy. For his outstanding contributions in this area, as well as for his scientific and artistic contributions, a decree of\n10\nJuly\n1818\nallowed Abbati to add Marescotti to his own name. The same decree also gave him the right to the title of count. We note that the name Marescotti was taken since Abbati was related to the Marescotti family which was a well-respected Modena family.\nThe next two paragraphs follow\n[\n3\n]\n, based on Andrea Mariani's translation\n[\n4\n]\n.\nSome of Marescotti's works that survive, all of mathematical interest, are:\nLetter of P Abbati of Modena to the member Paolo Ruffini\n, in\nMemoires of mathematics and physics of the Italian society of sciences\n, X,\n2\n(1803)\n, p.\n385\n-\n409\n(\nre-published in volume II, p.\n467\n-\n486\n, in\nMathematical works of Paolo Ruffini\n, edited by\nE Bortolotti\n, Rome\n1953)\n;\nReflections of P Abbati Marescotti of Modena on the method of J-L Lagrange for the solution of numerical equations\n, Modena\n1805\n;\nOn the computation of rational functions of the roots of any algebraic equation of the form\nf\n(\nx\n′\n,\nx\n′\n′\n,\nx\n′\n′\n′\n,\n.\n.\n.\n,\nx\n(\nm\n)\n)\nf (x', x'', x''',  ... , x^{(m)})\nf\n(\nx\n′\n,\nx\n′\n′\n,\nx\n′\n′\n′\n,\n.\n.\n.\n,\nx\n(\nm\n)\n)\n, in\nMemoires\n, cit., XII,\n1\n(1805)\n, p.\n8\n-\n23\n;\nLetter of P Abbati to Sir Abbate Francesco Venini\n(\nthe letter is dated\n1806)\n;\nOn a problem of Daniel Bernoulli and Lagrange\n, in\nMemoires\n, cit., XIX,\n2\n(1824)\n, p.\n385\n-\n480\n.\nThe\n1824\nmemoir\n[\nSopra un problema dei signori Daniele Bernoulli, e De La Grange, memoria del signor conte Pietro Abbati Marescotti socio onorario inserita nel tomo\n19\n. degli atti della Società italiana delle scienze residente in Modena\nⓉ\n(\nOn a problem of Daniel Bernoulli, and de Lagrange, memoir of the Count Pietro Abbati Marescotti, Honorary member: inserted in Volume\n19\n. of the proceedings of the Italian Society of Sciences resident in Modena\n)\n]\ndiscusses a problem of probability and specifies the meaning that is to be assigned to the expressions used by\nDaniel Bernoulli\nand\nJoseph-Louis Lagrange\nin some problems of expectation; all of the other memoirs relate to the theory of algebraic equations. Of particular importance is the first one, where Marescotti gives the first correct proof of the algebraic insolubility of general equations of degree greater than five, after having discovered that the proof given by\nPaolo Ruffini\nwas correct for equations of the fifth degree, but not for those of higher degree. Having acknowledged the correct critique\nPaolo Ruffini\n(\nOn the insolvability of general algebraic equations of degree greater than four\n, in\nMemoirs of mathematics and physics of the Italian society of science\n, X,\n2\n(1803)\n, p.\n454)\nresumed his work and indicated more clearly the groups of substitutions necessary for his research.\nThe letter from Abbati to\nRuffini\nin which he extended\nRuffini\n's proof that quintic equations were not, in general, soluble by radicals was written from Modena and dated\n30\nSeptember\n1802\n. In fact, more than thirty letters between Abbati and\nRuffini\nhave survived and are now in the Biblioteca Estense in Modena. These discuss an interesting number of different ideas in the theory of Diophantine equations, on prime numbers, and particularly on algebraic equations. For example, they discussed the relation between the roots of an equation and its coefficients, the number of imaginary roots that an equation possesses, particularly discussing the results of\nPietro Paoli\n. Abbati and\nRuffini\nalso discussed results concerning permutations of the roots of algebraic equations of degree\n4\nand also of algebraic equation of degree\n5\nand above. Certainly some of the ideas of group theory introduced by\nRuffini\nwere originally ideas coming from Abbati.\nIn addition to the academies and societies mentioned above, Abbati was elected a member of the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\nin\n1826\nand elected to the Accademia di Scienze e Belle Lettere di Palermo.\nWe should also mention that Abbati made contributions to the arts, establishing the Abbati Marescotti theatre in Modena in\n1833\n. This theatre continued to operate until\n1866\nwhen it closed.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}