{
  "nome_completo": "Pietro Paoli",
  "nome_curto": "Pietro Paoli",
  "ano_nascimento": "1759",
  "ano_morte": "1839",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Paoli/",
  "lugar_nascimento": "Livorno (now Italy)",
  "lugar_morte": "Florence (now Italy)",
  "biografia": "Pietro Paoli\nstudied first in Livorno with the Jesuits then entered the University of Pisa in\n1774\n. His original intention was to study law but he became interested in the mathematical and physical sciences and he graduated in\n1778\n. Following his graduation, he taught at the\nGymnasium\nin Mantua from\n1780\nto\n1782\n, then moved to Pavia where he was appointed to the chair of Elementary Mathematics at the University. He held this chair in Pavia for two years then, on\n23\nOctober\n1784\n, he was appointed by Leopold II, Grand Duke of Tuscany, to the chair of algebra at the University of Pisa.\nThe University of Pisa, being in the Duchy of Tuscany, had been under Lorraine rule from\n1737\n. It had prospered during this period with the opening of an observatory and the creating of chairs in experimental physics and chemistry. Paoli continued to hold the chair of algebra at Pisa until\n1798\nwhen he was appointed to the chair of higher mathematics. However, in the following year, Lorraine rule ended when Tuscany was invaded by French troops. The University of Pisa was closed by Ferdinand III, the Grand Duke of Tuscany, in the year\n1799\nbut it reopened under French control in\n1800\nand Paoli continued to hold the chair of higher mathematics. The University became an Imperial Academy in\n1803\nand at this time Paoli was named as an Honorary Inspector. In\n1805\nhe was appointed \"Royal hydraulic consultant\". In addition, from\n1810\nto\n1814\nhe was head of pure mathematics at the university. In\n1814\nhe retired from his chair, being named professor emeritus at this time.\nThe University of Pisa became a Normal School in\n1813\nand Paoli was one of the commissioners appointed to draft new regulations for the University. In\n1816\nhe was appointed as Superintendent of Education of the Grand Duchy of Tuscany and he moved to Florence. In addition to this role, in\n1817\nhe was also appointed as President of the Commission in charge of drafting the new General Land Register of Tuscany. This was a long and important task, and it was completed in\n1834\n.\nHis research was on analytic geometry, calculus, partial derivatives, and differential equations. His contributions show that he possessed a deep knowledge of the works of\nLagrange\n,\nLaplace\nand\nMonge\n. Among Paoli's publications we mention\nLiburnensis Opuscula analytica\nⓉ\n(\nWorks on analysis from Livorno\n)\n(1780)\n,\nRicerche sulle serie\nⓉ\n(\nResearch on series\n)\n(1788)\nwhich corrects an error in a\n1779\npaper by\nLaplace\non series,\nDella integrazione dell'equazioni a differenze parziali finite ed infinitesime\nⓉ\n(\nOn integration of the equations of partial finite and infinitesimal differences\n)\n(1800)\n,\nSulle oscillazioni di un corpo pendente da un filo estendibile memoria\nⓉ\n(\nMemoir on the oscillations of a body hanging from an expandable wire\n)\n(1815)\n, and\nSull'uso del calcolo delle differenze finite nella dottrina degl'integrali definiti memoria\nⓉ\n(\nMemoir on the use of the calculation of finite differences in definite integrals\n)\n(1828)\n. The first of these, the book\nOpuscula analytica\nⓉ\n(\nWorks on analysis\n)\n, was first published in\n1780\nand dedicated to Leopold II, the Grand Duke of Tuscany. A second edition of this book was published in\n1783\n. He also published the book\nMemorie sul Calcolo Integrale e sopra alcuni Problemi Meccanici\nⓉ\n(\nMemoir on calculating integrals and on some mechanical problems\n)\nin\n1793\n. This text was based on ideas of\nLeonhard Euler\n,\nAlexis Fontaine des Bertins\nand the\nMarquis de Condorcet\n.\nPaoli was most famed for\nElementi di algebra finita ed infinitesimale\nⓉ\n(\nIntroduction to  finite and infinitesimal algebra\n)\n(1794)\nwhich became a classic text used in Italy for many years. The first edition in two volumes was published in Pisa in\n1794\nand a second edition in three volumes was published in Livorno in\n1804\n. The work consisted of a comprehensive treatment of analytical methods in mathematics and, at the time it was written, it incorporated the most modern approach. It was divided into three parts entitled respectively 'The algebra of finite quantity', 'Introduction to infinitesimal analysis', and 'Infinitesimal analysis'. The third part was further divided into two sections, the first containing the differential calculus, the second being devoted to methods related to the integral calculus. Paoli, who corresponded and exchanged books with\nLagrange\n, sent a copy of the first edition of his\nElements of algebra\nto\nLagrange\nwho replied with a note of thanks in September\n1798\n. We see from the Preface that Paoli wanted to write the book because he was unhappy with the standard of mathematics teaching in Italy at this time. He writes:-\nAmong all those who in Italy are given to the study of mathematics, if we except a few sublime geniuses, who, with their strength of spirit have triumphed over all obstacles and reached a place at the highest level of geometry, there are few others that come to mediocrity. Not, we must repeat, because of the lack of talent that abounds in Italy, as in other places, but because of badly designed methods of teaching mathematics: since young people are not properly taught the very basic elements, which appear easy because they are inaccurate and do not treat, in each branch of science, a particular case. The first problem that arises is that young people will be satisfied with such an approach, rather than a rigorous demonstration that has not be given when it is considered in its full generality. In addition, it is certain that no one will be able to read the works of the great geometers, who assume their reader's science has been brought to that rigorous level, when they write. Now who has not found that having the elements of knowledge that you had only a century ago, the first reading of the books of\nEuler\n,\nd'Alembert\n, and\nLagrange\npresent insuperable difficulties. Hence, most of the time, it happens that everyone abandons the career they are undertaking, or is content to remain in the restricted sphere of knowledge passing their lives with the most basic elements, and sometimes in this position comforted by the inexperience of the teachers who, not being in a state to explain the difficulties that they encounter as well, advise the student to refrain from certain researches, on which they pour contempt and characterise as useless.\nJohn Cuzzocrea and Shlomo Sawilowsky write\n[\n2\n]\n:-\nCajori\n(1929)\ncited the first edition of 'Elementi di algebra'\nⓉ\n(\nIntroduction to  finite and infinitesimal algebra\n)\nas helping to establish various\n17\nth\nand\n18\nth\ncentury mathematics symbols in Italy. Some examples include trigonometric, inverse, and powers of trigonometric functions; and\nEuler\n's e as the base of natural logarithms.\nAlthough most mathematicians ignored\nPaolo Ruffini\n's proof of the impossibility of solving equations of degree greater than four by the method of radicals, Paoli read\nRuffini\n's proof and wrote to him in\n1799\n:-\nI read with much pleasure your book ... and recommend greatly the most important theorem which excludes the possibility of solving equations of degree greater than four. I rejoice exceedingly with you and with our Italy, which has seen a theory born and perfected and to which other nations have contributed little...\nOf course, as well as\nRuffini\n, Paoli was thinking of\nLagrange\n, with whom he corresponded, as an Italian.\nPerhaps Paoli's most famous student was Vincenzo Brunacci\n(1768\n-\n1818)\nwho studied with him at Pisa, graduated in\n1788\n, and published the two volume\nElementi di algebra e di Geometria\nⓉ\n(\nIntroduction to algebra and geometry\n)\nin\n1809\n. In addition to Brunacci, Paoli's students included Giovanni Taddeo Farini\n(1778\n-\n1822)\nand\nAntonio Bordoni\n.\nPaoli received many honours including election to the academies of Bologna, Naples, and Mantua, and to the\nMathematical Circle of Palermo\n. He was a founding member of the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\nin\n1782\nand elected to the Accademia delle Scienze di Torino on\n13\nJuly\n1811\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}