{
  "nome_completo": "Rózsa Péter",
  "nome_curto": "Rózsa Péter",
  "ano_nascimento": "1905",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peter/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Rózsa Péter\n's original name was Rósa Politzer but in the\n1930\ns she, like many other Hungarians, changed her German style name to a Hungarian one. We choose to use the name Péter throughout this biography. Rósa's father was the lawyer Dr Gusztav Politzer and her mother was Irma Klein. It was a Jewish family and Rósa had two brothers, one older than her and the other younger. She grew up in a period in which great changes took place in the country. When she was born in Budapest, the city was one of the twin capitals of the Austro-Hungarian empire. However, there were dramatic changes as she was growing up. Allied with the Central Powers during World War I, Hungary suffered food shortages, many men were killed, and life was extremely difficult. Rósa attended Maria Terezia Girls' School, graduating in\n1922\n. This school, on Andrassy Street in Budapest, was a six-year school for well-off people and provided an excellent education for those who could afford it. By the time that she graduated, World War I was over and Hungary had signed the Treaty of Trianon. Hungary was reduced to a third of its pre-war size and forced to pay a large indemnity.\nRózsa Péter studied at Pázmány Péter University\n(\nrenamed\nLoránd Eötvös\nUniversity in\n1950)\nin Budapest. Following her father's wishes, she enrolled for a degree in chemistry. Her older brother was already studying medicine and Rózsa's father thought that if Rózsa studied chemistry she could usefully collaborate with her brother. During her chemistry studies she also attended lectures in mathematics given by\nLipót Fejér\n, and through these lectures she discovered her love of mathematics. Then she changed her course and studied mathematics with\nLipót Fejér\nand\nJozef Kürschak\n. Another one to have an important influence on Rózsa Péter was\nLászló Kalmár\nwho was a fellow student at Pázmány Péter University. Péter wrote in\n[\n12\n]\n:-\nWhen I began my college education, I still had many doubts about whether I was good enough for mathematics. Then a colleague said the decisive words to me: it is not that I am worthy to occupy myself with mathematics, but rather that mathematics is worthy for one to occupy oneself with.\nAfter graduating in\n1927\n, passing the examinations to qualify as a\nGymnasium\nteacher of mathematics, Péter had to settle for odd jobs. The next few years were extremely difficult with the disastrous fall in world wheat prices in\n1929\nleading to the Great Depression. Foreign creditors called in their loans which Hungary couldn't repay. Deflation followed with many middle class people being dismissed from their jobs. University graduates cleaned the streets and there was widespread discontent. Péter had no possibility of getting a permanent teaching position and earned a living tutoring mathematics and giving private lessons. She undertook research for a doctorate, publishing papers, gave an address to the International Congress of Mathematicians in Zürich in\n1932\n, and was awarded her doctorate with distinction in\n1935\n. Two years later she became an editor of the recently founded\nJournal of Symbolic Logic\n. However, her employment position became even worse in\n1939\nwhen the Fascist government passed anti-Semitic laws and Jews were not allowed to teach.\nDuring the war years Péter worked on writing a book. It was published in\n1943\nbut many copies were destroyed in the bombing of Budapest. We will describe the contents of this book below. The Nazis occupied Budapest from March\n1944\nand in November\n1944\nthe government decreed that a Jewish ghetto be made in Budapest and several blocks of the former Jewish quarter was surrounded by a fence and wall. It was completely cut off by armed guards who prevented people getting out and food getting in. Péter was sent to the ghetto but in January\n1945\nthe Soviet army took control of Budapest and, although the Nazis had planned to massacre the Jews in the ghetto, they were saved. Although Péter survived, her brother and many of her friends died during the war. Her first post, at the Budapest Teachers Training College, was obtained in\n1945\n, eighteen years after graduating. When the College closed in\n1955\nshe became a professor at\nLoránd Eötvös\nUniversity and remained in this post until she retired in\n1975\n.\nHer first research topic was\nnumber theory\nbut she became discouraged on finding that her results had already been proved by\nRobert Carmichael\nand\nL E Dickson\n. For a while Péter was so discouraged that she turned away from mathematics. She wrote and translated poetry but around\n1930\nshe was encouraged to return to mathematics by her friend\nLászló Kalmár\n. He suggested Péter examine\nKurt Gödel\n's work on incompleteness\n[\n10\n]\n:-\nWithout knowing how\nGödel\nhad proved various results in his landmark paper, she was able to devise her own, different proofs. This experience not only restored Péter's self-confidence, but it also pointed her research in the direction she would follow from then on.\nIn a series of papers she became a founder of recursive function theory. All this happened in a remarkably short time for in\n1932\nshe presented her paper\nRekursive Funktionen\nⓉ\n(\nRecursive functions\n)\nto the International Congress of Mathematicians in Zürich. Note that this paper appears under her original name of Rósa Politzer. All her subsequent papers appeared under the Hungarian version of her name, Rózsa Péter, that she adopted around\n1932\n. She also presented a paper to the International Congress of Mathematicians in Oslo in\n1936\nentitled\nÜber rekursive Funktionen der zweite Stufe\nⓉ\n(\nOn recursive functions, the second stage\n)\n.\nWalter Felscher, in a personal communication to me\n[\nEFR\n]\n, described the context of Péter's work on recursive function theory:-\nRecursive functions were invented during the\n1920\ns in the\nHilbert\nschool, but nothing much was proved about them. Developing ideas of\nHerbrand\n,\nGödel\ndefined the more general 'general' recursive functions\n(\nto which\nAckermann\n's function belongs\n)\nin his Princeton lectures\n1933\n-\n34\n; soon after, the old functions received the name 'primitive recursive', and the general ones lost their adjective.\nIn a series of articles, beginning in\n1934\n, Péter developed various deep theorems about primitive recursive functions, most of them with an explicit algorithmic content. I admire this work, and it may well be said that she forged, with her bare hands, the theory of primitive recursive functions into existence.\n[\nOn the other side, it was Kleene who, having attended\nGödel\n's lectures, developed the theory of general\n(\nincluding partial\n)\nrecursive functions; this is a much more conceptual than computational area.\n]\nIn\n1951\nPéter collected what was known by then, including her own work, in the book \"Rekursive Funtionen\". An English translation appeared only in\n1967\n. It was the first book devoted exclusively to this topic, but\n(1)\nthere had been extensive chapters on this matter earlier in\nHilbert\n-\nBernays\n(1934\n-\n1939)\nwhere some of Péter's work was quoted, and\n(2)\nthe English speaking world did not read her book but read, instead,\nKleene\n's book of\n1952\n.\nDuring World War II, when she had been unable to take any teaching positions, Péter has produced the charming book\nPlaying with Infinity\n. The first publication was in Hungarian and was reviewed by\nJohn Kemeny\nwho writes\n[\n7\n]\n:-\nThis book is a popular account of modern mathematical ideas. The author states that her purpose is to reach that very large section of the population which always wanted to find out what modern mathematics was like, but thought that it was too difficult to understand. She attempts to give a clear picture of as many advanced concepts as possible without sacrificing rigour. ... The author's humour makes every page enjoyable. ... The author seems to have found a perfect compromise between rigour and clarity.\nFor a longer extract from the review by\nKemeny\nsee\nTHIS LINK\nPéter's book was translated into English and several editions were reviewed.\nReuben Goodstein\nwrites\n[\n4\n]\n:-\nThis is easily the best book on mathematics for everyman that I have ever seen. The author is both a highly creative mathematician and an experienced teacher of young children, and this happy combination, allied to a gift for lucid exposition has produced a delightful book ...\nPhilip Peak writes\n[\n11\n]\n:-\nThis is a delightful book, and the mathematician as well as the layperson could profit from reading it.\nFor longer extracts of these reviews of the English translations see\nTHIS LINK\n.\nPéter's important book\nRekursive Funtionen\nⓉ\n(\nRecursive functions\n)\n(1951)\nhas already been mentioned above.\nStephen Kleene\nwrites in a review\n[\n8\n]\n:-\nBeginning in\n1932\n, Rózsa Péter has published a series of papers, examining the relationship of various special forms of recursion, and showing the definability of new functions by successively higher types of recursion, which establish her as the leading contributor to the special theory of recursive functions. ... In writing this book Ms Péter has carried out a considerable undertaking; and to go further would have constituted a still greater one, and required either a much larger book or a more compact style.\nFor a longer extract of this review and extracts of other reviews of this important book see\nTHIS LINK\n.\nPéter's work on recursive functions certainly didn't end with this book. For example, in\n1959\nshe presented a major paper\nÜber die Verallgemeinerung der Theorie der rekursiven Funktionen für abstrakte Mengen geeigneter Struktur als Definitionsbereiche\nⓉ\n(\nOn the generalization of the theory of recursive functions for abstract quantities with suitable structures as domains\n)\nto the International Symposium in Warsaw in September\n1959\n. This was published in two parts totalling\n68\npages in\n1961\nand\n1962\n. In this paper Péter looks at words formed from a given alphabet of letters and develops a theory for such words generalising\nPeano\n's approach to a study of the integers.\nFrom the mid\n1950\ns Péter applied recursive function theory to computers. In\n1976\nher last book was on this topic\nRecursive Functions in Computer Theory\n. The text was Hungarian with an English translation appearing in\n1981\n. Let us quote from Péter herself about how her work on recursive functions became important in computer science\n[\n12\n]\n:-\nI would like to win over those who consider mathematics useful, but colourless and dry - a necessary evil. I myself work in a field that was created for purposes internal to mathematics. This is the theory of the so-called 'recursive functions' - I would not have dreamed that this theory could also be applied practically. And today? My book on recursive functions was the second Hungarian mathematical book to be published in the Soviet Union, and precisely on the practical grounds that its subject matter has become indispensable to the theory of computers.\nIn addition to her research contributions and her outstanding books showing non-mathematicians the joy of mathematics, Péter was enthusiastic in trying to improve mathematical education in Hungary. She had, of course, spent much time teaching school children but she also wrote school textbooks and worked on improving the curriculum. It seems appropriate to quote from\n[\n12\n]\nwhere we get an excellent picture of Péter as a school teacher:-\nNo other field can offer, to such an extent as mathematics, the joy of discovery, which is perhaps the greatest human joy. The schoolchildren that I have taught in the past were always attuned to this, and so I have also learned much from them. It never would have occurred to me, for instance, to talk about the Euclidean Algorithm in a class with twelve-year-old girls, but my students led me to do it. I would like to recount this lesson.\nWhat we were busy with was that I would name two numbers, and the students would figure out their greatest common divisor. For small numbers this went quickly. Gradually, I named larger and larger numbers so that the students would experience difficulty and would want to have a procedure. I thought that the procedure would be factorization into primes. They had still easily figured out the greatest common divisor of\n60\nand\n48\n: \"Twelve!\" But a girl remarked: \"Well, that's just the same as the difference of\n60\nand\n48\n.\" \"That's a coincidence,\" I said and wanted to go on. But they would not let me go on: \"Please name us numbers where it isn't like that.\" \"Fine. Sixty and\n36\nalso have\n12\nas their greatest common divisor, and their difference is\n24\n.\" Another interruption: \"Here the difference is twice as big as the greatest common divisor.\" \"All right, if this will satisfy all of you, it is in fact no coincidence: the difference of two numbers is always divisible by all their common divisors. And so is their sum.\" Certainly that needed to be stated in full, but having done so, I really did want to move on. However, I still could not do that. A girl asked: \"Couldn't they discover a procedure to find the greatest common divisor just from that?\" They certainly could! But that is precisely the basic idea behind the Euclidean Algorithm! So I abandoned my plan and went the way that my students led me.\nPéter received many honours for her outstanding contributions. She was awarded the Kossuth Prize by the Hungarian Government in\n1951\n, the Manó Beke Prize by the\nJanos Bolyai\nMathematical Society in\n1953\n, the Silver State Prize in\n1970\n, and the Gold State Prize in\n1973\n. She was elected to the\nHungarian Academy of Sciences\nin\n1973\n, being the first woman to be elected to the Academy.\nAs to her interests outside mathematics, as well as her interest in poetry which we have already discussed, we should mention the cinematic and dramatic arts. She died from cancer in\n1977\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}