{
  "nome_completo": "Ralph Fowler",
  "nome_curto": "Ralph Fowler",
  "ano_nascimento": "1889",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fowler/",
  "lugar_nascimento": "Fedsden, Roydon, Essex, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Ralph Howard Fowler\nwas the eldest son of Howard Fowler and Frances Eva\n(\nthe daughter of George Dewhurst the Manchester cotton merchant\n)\n. He was described as being quite athletic and possessing a loud, though affable, laugh. He apparently inherited his athleticism from his father who was a star at rugby and cricket. His father was an Oxford man who was called to the bar, but instead of becoming a barrister went into business.\nRalph's early education was handled at home by a governess. When he was ten he matriculated at Evans' preparatory school at Horris Hill where he excelled at athletics, in particular cricket and football\n(\nsoccer\n)\n. At the age of\n13\n, in\n1902\n, Ralph won a scholarship to Winchester College placing second in the entrance examination\n(\nwhich apparently annoyed him despite the fact that he was sick at the time\n)\n. He spent the next six years at Winchester where he became Prefect of Hall\n(\nHead of School\n)\nand won school prizes in mathematics and natural science. Once again, athletics was a major focus of Ralph's life, though despite his success at golf, he was outdone by his sister Dorothy who was a champion golfer.\nRalph's academic ability was exceptional at Winchester. His classical sixth form master, Frank Carter, believed he could have been as good a classical scholar as he was a mathematical scholar. But it was mathematics that attracted him. And his ability at mathematics was matched by his affable character. At Winchester Ralph made numerous friends. Despite his penchant for speaking plainly, he always made up for it after and this seemed to have an affect on people who, both at Winchester and later, seemed to gather around him.\nHis family life appeared to be equally well-balanced. He could often be found golfing with his father, sister, and brother Christopher. Family life at the Fowlers was apparently quite happy and Ralph's parents \"spared nothing that their children's education should be as perfect as possible, with well-occupied vacations\"\n[\n3\n]\n. During Ralph's stay at Winchester his family moved from Essex to Norfolk, taking up residence in Weybourne, near Sheringham which was where the Fowlers golfed regularly. A bit later they moved on to Glebelands, Burnham-on-Sea, Somerset, but not before Ralph got in a bit of cricket, playing for Norfolk County for some time.\nIn December of\n1906\n, Ralph won a Major Scholarship to Trinity College, Cambridge, and he left for Trinity during Michaelmas term\n1908\n. At Trinity he read mathematics completing Part I of the Mathematical Tripos in\n1909\n, taking a first class. In\n1911\nhe became a\nwrangler\nin Part II of the Tripos. He received his BA degree in\n1911\nupon completion of Part II and received his MA in\n1915\n. In\n1913\nhe was awarded a Rayleigh Prize in Mathematics. Needless to say, Cambridge was quite good to Ralph - or, rather, Ralph was quite good to Cambridge.\nAfter completion of his degree, Ralph took to researching pure mathematics. His adeptness and insight won him a Trinity Fellowship in October\n1914\n. However, World War I had just broken out and he obtained a commission in the Royal Marine Artillery. He could often be seen at Trinity wearing his gown over his military khakis which was apparently quite an unusual site. The War was less unusual, being rather typical in handing out suffering. Ralph was not immune. In\n1917\nhe lost his brother Christopher on the Somme which was quite a blow to him. Later he was to lose his two greatest friends at Winchester, A D Gillespie and R H Hutchison, in a similar manner. Ralph himself was severely wounded in the shoulder at Gallipoli. The wound turned out to be a bit of a mixed bag, however, as it caused him to be introduced to A V Hill, Captain in the Cambridgeshires, and a Fellow at King's College\n(\nand former Fellow at Trinity\n)\n. For it was Hill who was ultimately the catalyst that brought Ralph's mathematical ability into the realm of physics.\nHill, in collaboration with Horace Darwin\n(\nof the ever-prolific Darwin family that included the physicist C G Darwin,\nFrances Galton\n, and the most famous of all, Horace's father, Charles Darwin, the evolutionist\n)\n, had invented a mirrored system originally designed to determine the flight paths of aircraft and later used to target German zeppelins for anti-aircraft gunneries. Fowler came in just as they began to test the instrument in the field. As talented young scientists joined the group, it came to be known as \"Hill's brigands\" and it was here that Fowler made some of his most endearing friendships, not the least of which was\nE A Milne\n, who wrote several articles and obituaries on Fowler both before and after his death.\nFowler soon became Hill's second in command working with the Experimental Department of\nHMS Excellent\non Whale Island. Fowler, being Assistant Director, was resident in Portsmouth while Hill traveled often to London often for commune with higher ranks. Hill eventually became a brevet Major while Fowler was made a Captain, RMA. Fowler recruited a long list of able mathematicians to join the group and, combined with Hill's inspirations, Fowler's mathematical ability led the group to a number of important works. Many were published in journals including two now classic papers that appeared in the\nPhilosophical Transactions of the Royal Society\nthat were to have a profound impact on the field of ballistics both in Britain and in North America, particularly in World War II.\nFar from being a \"paper-pusher\", Fowler apparently was active in both the experiments as well as the laborious paper-writing. His work in this field led him, in particular, to consider wind structure and temperature structure at high altitudes which could have been the catalyst for his later interest in thermodynamics and statistical mechanics. For his ballistics work, Ralph was awarded the OBE in\n1918\n.\nIn\n1919\nFowler left the service and returned to Trinity, though he was to have a part in the newly formed Ordnance Board during the Second World War later on. This was when Fowler came under the influence of Lord Rutherford who had just been appointed Cavendish Professor. The two became very good friends and Fowler was eventually appointed College Lecturer in Mathematics in\n1920\n. Here he jumped into a variety of mathematical problems and eventually began moving to more recent problems in mathematical physics including work on various kinetic theories of gases, again leading him toward thermodynamics and statistical mechanics.\nIn\n1921\n, Ralph married Eileen, the only daughter of Lord Rutherford, Ralph's good friend and colleague at Cambridge. The two were to have four children in the following nine years with Eileen dying just after the birth of the last.\nIn\n1922\n, Ralph became a Proctor at Cambridge which, being a Marine, he was well-suited for, finding himself chasing after undergraduates frequently and, on one occasion, injuring himself doing so. It was also in\n1922\nthat Ralph began what would be his most seminal work. It began as a collaboration with C G Darwin\n(\nanother of the famous Darwin clan\n)\n. The two began working on the problem of the partition of energy, inspired by works of\nEhrenfest\nand Trkal. Having developed a new technique for approaching physical chemistry through\nstatistical mechanics\n, the two, and later Fowler alone, justified a number of formulae and calculations performed by the likes of Saha, Lindemann, and Chapman. In\n1922\n-\n23\n, Ralph established the validity of the dissociation formula for high temperature ionization. In early\n1923\n, Ralph along with\nE A Milne\n, wrote a seminal work on stellar spectra, temperatures, and pressures. This work continued in a series of papers through the\n1920\ns leading to the\nAdams\nPrize of the University of Cambridge in\n1923\n-\n24\nand was published in\n1929\nas the seminal volume,\nStatistical Mechanics\n, which had a second edition, minus the astrophysical applications, published in\n1936\n. In\n1939\na successor volume, entitled\nStatistical Thermodynamics\n, was co-authored and published with E A Guggenheim.\n1926\nmarked the publication of his most seminal individual paper which linked the gaseous degenerate state\n(\nobeying quantum statistics, co-discovered by\nP A M Dirac\n, who was introduced to quantum theory by Fowler himself\n)\nto white dwarf stars. It is rumored that he was annoyed that he did not, at the same time, apply\nFermi\n-\nDirac\nstatistics to conductors, something later done by\nSommerfeld\n.\nFowler's range of interests kept him going throughout the next two decades as he produced papers on spectroscopy, physical chemistry, what is now known as condensed matter physics\n(\nor solid state physics\n)\n, and magnetism in materials. He eventually took up a post in the Cavendish Laboratory at Cambridge and, in\n1932\n, he was elected to the newly created Plummer Chair of Theoretical Physics.\nWorking closely with his father-in-law, Lord Rutherford, he examined a number of interesting problems and delivered the\n1935\nBakerian Lecture on specific heats of crystals and the\n1934\nLiversidge Lecture on the heavy isotope of hydrogen. In\n1925\nhe was elected as a Fellow of the\nRoyal Society\nand became a Fellow at Winchester in\n1933\n. In\n1936\nhe was awarded one of the Royal Medals and was appointed as Director of the National Physical Laboratory in\n1938\n, though he was unable to take up the post due to ill health. According to\nMilne\n, the transformation from pure mathematician prior to World War I to physicist, engineer, and administrator by Word War II was nothing short of astonishing and a great tribute to Fowler's ability in practical matters.\nIn\n1938\n, upon taking ill and not being able to take up the National Laboratory Directorship, he chose to remain at Cambridge in the Plummer Chair. In\n1939\nwhen war broke out, he immediately resumed his work with the Ordnance Board, despite his health, and was eventually chosen to become a scientific liaison to Canada and later the United States, two countries which he had formerly been familiar through visits to Toronto and visiting professorships at Princeton and the University of Wisconsin. For his work as this liaison, he was knighted in\n1942\n.\nHe returned to Britain later in the war and was reportedly working for the Ordnance Board and the Admiralty up until just a few weeks prior to his very premature death in\n1944\n.\nIt must be said that Sir Ralph Fowler was a brilliant physicist. But it may be for his influence upon others that he is best known. In fact, no less than fifteen Fellows of the\nRoyal Society\nand three Nobel Laureates were supervised by Fowler between\n1922\nand\n1939\n. The total number supervised during this time was a staggering sixty-four giving him an average of eleven research students at any given time. One might be led to believe that this did not allow for any depth of relationship to form between him and his students. However, this was far from the truth of the matter. Those who studied under Fowler had a tremendous admiration for him. In particular,\nE A Milne\n[\n1\n]\nwas especially taken by the man whom he fondly referred to as \"the kind of man you can still remain friendly with, even when he has sold you a motor-bike; it is not possible to say more\" and whom he called a \"prince amongst men\"\n[\n2\n]\n.\nAside from\nMilne\n, on whom he had a profound impact, he also had the opportunity of influencing the likes of Sir\nArthur Eddington\n,\nSubramanian Chandrasekhar\n,\nPaul Dirac\n, Sir\nWilliam McCrea\n, Lady\nJeffreys\nand others either directly through supervision or indirectly through collaboration. Even in his personal life he was intimately connected with brilliant people having married Eileen, the only daughter of Lord Rutherford whom he met through Rutherford's Cavendish Laboratory at Cambridge. Sometimes his influence was simply the fact that he was known to so many people. It was Fowler who ultimately introduced Paul\nDirac\nto the burgeoning field of quantum theory in\n1923\nleading\nDirac\nto the forefront of its ultimate discovery in\n1925\n. Fowler also put\nDirac\nand\nWerner Heisenberg\nin touch with each other through\nNiels Bohr\n. As Sir\nWilliam McCrea\nsimply put it\n[\n3\n]\n: \"he was the right man in the right place at the right time.\"\nFowler's influence was far-reaching, extending beyond the hallowed halls of Cambridge and into government, both British and foreign. This aspect of his life was once again partly a matter of timing. While serving in the Royal Marines during Gallipoli he was seriously wounded. During his recovery he met A V Hill whose work in anti-aircraft gunnery had spawned \"Hill's Brigands,\" a group of talented scientists charged with developing better techniques for targeting German Zeppelins. This work led to two classic papers on the subject of the aerodynamics of spinning shells and, according to\nMilne\n, the work had a tremendous impact on ballistics both in Britain and North America. This experience also made Fowler influential enough to affect the actions of Britain and her allies twenty years later in the second World War.\nDuring this later War, Fowler acted as a liaison between Britain and Canada and, later, Britain and the United States. In\n1942\nhe was knighted, no doubt partly due to his heroic service to his country during both wars.\nEarly in his career, after receiving his degree, Fowler took to examining the behavior of the solutions to certain second-order differential equations. In particular, he studied Emden's differential equation:\n1\nξ\n2\nd\nd\nξ\n(\nξ\n2\nd\nθ\nd\nξ\n)\n=\n−\nθ\nn\n\\Large\\frac{1}{\\xi^{2}\\normalsize} \\Large\\frac{d}{d\\xi}\\normalsize (\\xi^{2}\\Large\\frac{d\\theta}{d\\xi}\\normalsize ) = -\\theta^{n}\nξ\n2\n1\n​\nd\nξ\nd\n​\n(\nξ\n2\nd\nξ\nd\nθ\n​\n)\n=\n−\nθ\nn\n.\nSir\nArthur Eddington\nhad originally shown that the equilibrium of gaseous stars could be found using the above equation with\nn\n=\n3\nn = 3\nn\n=\n3\n. From this he had found a formula for the luminosity of the star in terms of mass.\nMilne\nwondered what would happen if the star did not have this particular rate of energy generation. He rightly deduced Emden's equation must have other solutions. When\nMilne\ndivulged his thoughts to Fowler, Ralph immediately developed a new solution for different values of\nn\nn\nn\nand all types of boundary solutions. The resulting general equation, which had considerable later influence on stellar astrophysics, was:\nd\nd\nξ\n(\nξ\n∑\nd\nθ\nd\nξ\n)\n±\nξ\nσ\n′\nθ\nn\n=\n0\n\\Large\\frac{d }{d\\xi}\\normalsize (\\xi^{\\sum } \\Large\\frac{d\\theta}{d\\xi}\\normalsize ) ± \\xi^{\\sigma'}\\theta^{n} = 0\nd\nξ\nd\n​\n(\nξ\n∑\nd\nξ\nd\nθ\n​\n)\n±\nξ\nσ\n′\nθ\nn\n=\n0\n.\nThis was later to be related to his most original paper on the degenerate state of white dwarf stars. In this paper, Fowler showed that the material of white dwarf stars must consist of a gas obeying\nFermi\n-\nDirac\nstatistics - that is, it must be in a degenerate state. The atoms are ionized so dramatically that they are virtually electron-free. These ions are closely packed leaving the free electrons to form a degenerate gas which Fowler described as \"like a gigantic molecule in its lowest state.\" The equilibrium of the white dwarfs was later found to be described by a solution to Emden's equation as generalized by Fowler in the above equation with\nn\n=\n3\n2\nn = \\large\\frac{3}{2}\\normalsize\nn\n=\n2\n3\n​\n.\nFowler's genius was in his ability to apply intense mathematical rigour to a variety of physical problems. But perhaps his greatest trait was his ability to make friends and acquaintances exemplified both by his numerous \"fans\" and the web of influences he wove both scientifically and politically. It is indeed a shame that the world lost such a great man at such a young age.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}