{
  "nome_completo": "Ralph Lent Jeffery",
  "nome_curto": "Ralph Jeffery",
  "ano_nascimento": "1889",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jeffery_Ralph/",
  "lugar_nascimento": "Overton, Yarmouth County, Nova Scotia, Canada",
  "lugar_morte": "Wolfville, Nova Scotia, Canada",
  "biografia": "Ralph Jeffery\n's parents were Frank and Charlotte Francis Jeffery. Frank Jeffery was a fisherman. Ralph attended school up to Grade\n8\nwhen, in the middle of the year, he left to join his father as a fisherman. However in\n1910\n, when he was\n21\nyears old, he left the life of a fisherman behind and continued his education. He attended Yarmouth Academy and then Nova Scotia Normal College, completing his studies there in\n1915\n. He became Principal of Port Maitland High School and, on\n23\nAugust\n1916\n, he married Nellie Huntington Churchill of Overton. It was Nellie Jeffery who persuaded her husband to continue with his education and enrol in Acadia University, Wolfville, Nova Scotia.\nWe have reached Jeffery's university education without mentioning mathematics. That is because up to that time mathematics had not played a large role in his life. He took a degree in economics at Acadia University, but while studying for this degree he took two mathematics courses, one in calculus and one in analytic geometry. This may not seem like a particularly good foundation for research in mathematics, but Jeffery had come to love the subject so much that he went to Cornell University to undertake graduate studies. He continued his studies during a year at Harvard and then, in\n1924\n, he was appointed Head of Mathematics at Acadia University. At this point Jeffery had not completed his doctorate so, in\n1928\n, he returned to Cornell University to finish off his work. He obtained his doctorate in\n1928\nafter submitting his dissertation\nThe Uniform Approximation of a Sequence of Integrals and the Sequence of Functions Which Define a Definite Integral Containing a Parameter\n.\nBefore he submitted his thesis, Jeffery was publishing papers such as\nDefinite integrals containing a parameter\nand\nThe Continuity of a Function Defined by a Definite Integral\n, the latter being in the\nAmerican Mathematical Monthly\n. He published a paper based on the results of his thesis in the\nAnnals of Mathematics\n, then published further papers such as\nThe uniform approximation of a summable function by step functions\n(1931)\n,\nNon-absolutely convergent integrals with respect to functions of bounded variation\n(1932)\n,\nRelative summability\n(1932)\n,\nSets of k-extent in n-dimensional space\n(1933)\n, and\nDerived numbers with respect to functions of bounded variation\n(1934)\n.\nJeffery remained at Acadia University until\n1942\n, except for one year which he spent as acting as Head of Mathematics at the University of Saskatchewan in\n1938\n. Then in\n1942\nhe moved to Queen's University, Kingston, Ontario when offered the position of Head of Mathematics there replacing John Matheson. The attraction of the move from Acadia to Queen's was undoubtedly the greater research opportunities which he would have in his new position. The Mathematics Department at Queen's was fairly small with seven faculty members when Jeffery became Head. When he retired in\n1960\nit was a stronger Department with nine faculty members. He had also built up a strong graduate programme and brought undergraduate teaching to a high standard. Queen's University honoured Jeffery's outstanding contribution by naming a new building, built between\n1967\nand\n1969\nto house the Department of Mathematics and Statistics, as Jeffery Hall.\nAn important book which Jeffery published in\n1951\nwas\nThe Theory of Functions of a Real Variable\n. Haslam-Jones, in a review of the book, writes:-\nThe author states that his main purpose in this book is to present the contents of chapter VI\n(\nThe inversion of derivatives\n)\nand of chapter VII\n(\nDerived numbers and derivatives\n)\n. The former includes, in addition to standard theorems concerning absolutely continuous functions and the integrals of finite summable derivatives, an interesting discussion of the problem of determining a continuous function from its finite\n(\nbut not summable\n)\nderivative by a denumerable infinity of operations: the chapter is a useful introduction to the\nDenjoy\nintegral. In chapter VII properties of the non-differentiable functions of\nWeierstrass\nand of\nBesicovitch\nare established, followed by an exhaustive analysis of the distribution of the derivates and approximate derivates of an arbitrary function of one variable. ...\nJeffery was elected a Fellow of the Royal Society of Canada in\n1937\nand latter served as its President. His presidential address to the Society was\nTrigonometric series\nwhich he gave in\n1953\nand three years later it was published as a\n39\npage book by the University of Toronto Press. One of his greatest achievements was to establish the Summer Research Institute of the\nCanadian Mathematical Society\nand he directed the Institute each summer from\n1950\nto\n1965\n. During these years, from\n1957\nto\n1961\n, he served as President of the\nCanadian Mathematical Society\n.\nAfter retiring from Queen's University in\n1960\nat the age of\n71\n, he returned to Arcadia University where he continued to teach until his\n85\nth\nyear.\nAs a lecturer his students described him as \"slow and deliberate\". He was also renowned as being absent minded but, as\nRobinson\nstates in his obituary of Jeffery\n[\n1\n]\n:-\nRalph Jeffery's easy-going manner and friendly approach to life made him loved by all who knew him.\nJeffery received many honours for his outstanding work in encouraging mathematical research in Canada. He was awarded honorary degrees by Acadia University, Dalhousie University, St Mary's University, Memorial University, McMaster University, Windsor University and Queen's University. The\nCanadian Mathematical Society\nhonoured him by setting up the\nJeffery\n-\nWilliams\nPrize to recognize mathematicians who have made outstanding contributions to mathematical research. The first award of the Prize was made in\n1968\n.\nIn\n1956\nNellie Jeffery died. In\n1970\n, when he was\n81\nyears old, Jeffery married Frances Lewis of Bedford.\nRobinson\nwrites\n[\n1\n]\n:-\nRalph's wife lives in Bedford, Nova Scotia. Her contributions to his life and accomplishments during the latter years was obvious to all.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}