{
  "nome_completo": "Raymond Clare Archibald",
  "nome_curto": "Raymond Archibald",
  "ano_nascimento": "1875",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Archibald/",
  "lugar_nascimento": "Stewiacke, Colchester County, Nova Scotia, Canada",
  "lugar_morte": "Sackville, New Brunswick, Canada",
  "biografia": "Raymond Archibald\nwas widely known as R.C.A. His parents were Mary Mellish and Abram Newcomb Archibald. Mary Mellish was born in Pownal, Prince Edward Island, in January\n1849\n. She attended Mount Allison Ladies' Academy, Sackville, south eastern New Brunswick, Canada, and after graduating in\n1867\nshe taught mathematics there. In\n1874\nAbram Archibald and Mary Mellish were married and their son Raymond Archibald was born in the following year in Nova Scotia. In\n1883\n, when Raymond was seven years old, Abram died and two years later Mary returned to Mount Allison Ladies' Academy to take on the roles of preceptress and vice-principal of the College.\nRaymond attended Mount Allison Academy from\n1885\nto\n1889\n. After graduating from the Academy, he entered Mount Allison College in Sackville where he studied both mathematics and music. He was awarded a B.A. in mathematics from the College in\n1894\nand he also received a Teacher's Diploma to teach violin.  A few years after Archibald graduated, in\n1903\n, Mount Allison College became Mount Allison University. He spent a year teaching mathematics at Mount Allison Ladies' College while he continued to study music, completing an Artist's Diploma\n(\nviolin\n)\nin\n1895\n.\nAfter graduating from Mount Allison, Archibald entered Harvard University in\n1895\n. He obtained a B.A. from Harvard in\n1896\n, remaining there to study for his Master's Degree which was awarded in\n1897\n. Following this Archibald studied in Europe, attending the University of Berlin in session\n1898\n-\n99\nand then the University of Strasbourg in\n1899\n-\n1900\n. He was awarded his Ph.D. from Strasbourg in\n1900\nfor a thesis\nThe Cardioid and Some of Its Related Curves\n. This dissertation studied the cardioid,\n(\nx\n2\n+\ny\n2\n−\na\nx\n)\n2\n=\na\n2\n(\nx\n2\n+\ny\n2\n)\n(x^{2} + y^{2} - ax)^{2} = a^{2} (x^{2} + y^{2})\n(\nx\n2\n+\ny\n2\n−\na\nx\n)\n2\n=\na\n2\n(\nx\n2\n+\ny\n2\n)\nand also looked at its history.  Archibald explained that the name cardioid was first used by\nde Castillon\nin a paper in the\nPhilosophical Transactions of the Royal Society\nin\n1741\n. It is the locus of a point on the circumference of circle rolling round the circumference of a circle of equal radius. In\n1903\nArchibald published the paper\nThe Cardioid and Tricuspid: Quartics with Three Cusps\non the work of his doctoral dissertation.\nAfter completing his doctorate, Archibald returned to Canada in\n1900\nwhere he was appointed professor of Mathematics at Mount Allison Ladies' College in Sackville, New Brunswick. His mother Mary was vice-principal of the College until her death on\n9\nJanuary\n1901\n. Archibald served there for seven years, also acting as librarian, building the library from scratch to\n12\n,\n000\nvolumes and writing  by hand\n30\n,\n000\ncatalogue cards. He was also head of the violin department. Already he showed his interest in collecting and cataloguing material, and he began to assemble calendars, student publications, photographs and memorabilia associated with Mount Allison. In\n1905\nhe set up the Mary Mellish Archibald Memorial Library at Mount Allison and he continued to build the library throughout his life. In\n1907\nhe was appointed as professor of mathematics at Acadia University, Wolfville, Nova Scotia, where he remained for a year before being appointed to Brown University in Providence, Rhode Island, United States. The university had begun as Rhode Island College in\n1764\nbut had adopted the name Brown University in\n1804\nin honour of its benefactor Nicholas Brown. At this stage in his career Archibald made the decision that he could not keep his twin interests in music and mathematics both as part of his career and decided to concentrate on mathematics with music becoming a hobby. Archibald had been a professor at Acadia University but now he accepted the position of Instructor at Brown. He was to remain there for the rest of his life: as instructor from\n1908\nto\n1911\n, assistant professor from\n1911\nto\n1917\n, associate professor from\n1917\nto\n1923\n, and professor from\n1923\nto\n1943\n. After retiring in\n1943\nhe was made professor emeritus. C R Adams was taught by Archibald at Brown during\n1915\n-\n16\n. He writes\n[\n2\n]\n:-\n... he was in the prime of life and full of energy. He was striking in appearance, his hair wavy and beginning to grey, worn a little longer than was generally the custom; his eyes large and expressive. Always carefully groomed, he wore a high starched collar and stiff detachable cuffs. Often a white edging on his waistcoat gave an added touch of elegance to his dress. To me he was an impressive figure among the Brown faculty.\nWe should mention a number of projects which Archibald undertook. We noted above the Mary Mellish Archibald Memorial Library which he founded at Mount Allison in\n1905\n. Each summer he travelled from Providence to Sackville to spend time building up the collection which contains:-\n... material on the Anglo-American folk song tradition; the development of folk music in Canada; ballad literature; art song; patriotic and college songs; and songs for children.\nHowever, Archibald collected other material at Mount Allison which he added to on his summer visits. This included:-\n... records generated by Archibald in his activities as scholar, researcher, collector, historian of Mount Allison and by personal relationships with friends, family and fellow Allisonians. ... Scrapbooks contain correspondence, clippings, notices, posters, programs, memorabilia which document activities, students, faculty, buildings at Mount Allison,\n1857\n-\n1935\n.\nHis work as a librarian led to him making the mathematics library at Brown University one of the finest. He built up its holdings of journals and made a special feature of adding doctoral dissertations from leading American and European universities\n[\n2\n]\n:-\nFrequently he went to Europe for the summer, always provided with funds to spend for mathematical books for Brown. He carried on a flourishing correspondence with scientific book sellers throughout the world, and if a dealer offered an item for sale at less than it was worth he was quick to recognise a bargain and to cable an order for purchase.\nFrom\n1921\nto\n1941\nhe was the librarian of the\nAmerican Mathematical Society\nand is responsible for a remarkable growth in its library holdings.\nHis mathematical work was mainly in the history of mathematics. He published works such as\nEuclid's book On Division of Figures with a restoration\n(1915)\n,\nBenjamin Peirce\n1809\n-\n1880\n(1925)\n,\nOutline of the History of Mathematics\n(1932)\n,\nThe scientific achievements of Nathaniel Bowditch\n(1937)\n,\nSemicentennial History of the American Mathematical Society\n1888\n-\n1938\n(1938\n, reprinted\n1988)\n, and\nFifty mathematical table makers\n(1948)\n. His interest and expertise in mathematical tables led to him becoming chairman of a National Research Council on tables in January\n1939\n. He founded the journal\nMathematical Tables and other Aids to Computation\nin\n1943\n, which was published by the National Research Council of the National Academy of Sciences. Archibald became the first chairman of the editorial committee of the Journal. In\n1944\nhe published, jointly with\nBateman\n,\nA guide to tables of Bessel functions\nwhich occupied a whole issue of\nMathematical Tables and Other Aids to Computation\n.\nSzegő\nwrites:-\nIt contains a list of the tremendous literature on tables and graphs concerning the various\nBessel functions\n. The great importance of such a collection is obvious.\nAs a final comment on Archibald's publications, let us list the papers he published during the years\n1945\n-\n50\n:\nMathematical table makers - portraits, paintings, busts, monuments, bio-bibliographical notes\nI, II\n(1945\n,\n1946)\n;\nMaterial concerning James Joseph Sylvester\n(1947)\n;\nMathematical Table Makers. Portraits, Paintings, Busts, Monuments, Bio-Bibliographical Notes\n(1948)\n;\nBartholomaus Pitiscus\n1561\n-\n1613\n(1949)\n;\nRheticus, with special reference to his \"Opus Palatinum\"\n(1949)\n;\nObituary : R G D Richardson\n1878\n-\n1949\n(1950)\n;\nThe first translation of Euclid's \"Elements\" into English and its source\n(1950)\n; and\nNew information concerning Isaac Wolfram's life and calculations\n(1950)\n.\nArchibald was a delegate to the congress of universities of the British Empire in London in\n1912\n. He was a delegate at the celebrations to mark the\n700\nth\nanniversary of the founding of the University of Padua in\n1922\n, and represented both the United States and Canada on the\nEuler\nCommittee of the Swiss Society of Naturalists from\n1922\nto\n1939\n. He was elected as an honorary member of the\nPolish Mathematical Society\n, the\nLondon Mathematical Society\n, the\nGerman Mathematical Society\n, and several other societies. He served on the council of the\nAmerican Mathematical Society\nfrom\n1918\nto\n1941\nand he was president of the\nMathematical Association of America\nin\n1922\n.\nIn\n[\n2\n]\nthe authors sum up their article as follows:-\nArchibald was both a scholar of the old school and a gentleman of the old school ... He was brought up in the classical tradition with much emphasis on Latin and Greek. He had a very remarkable memory, and he carried with him at all times an enormous store of factual information in the fields of his interest.",
  "math_areas": [
    "Number Theory"
  ]
}