{
  "nome_completo": "Raymond Edward Alan Christopher Paley",
  "nome_curto": "Raymond Paley",
  "ano_nascimento": "1907",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Paley/",
  "lugar_nascimento": "Bournemouth, England",
  "lugar_morte": "Banff, Alberta, Canada",
  "biografia": "Raymond Paley\n's father was Raymond Edward Paley\n(\nborn in London on\n11\nFebruary\n1874)\nwho was an Officer in the Royal Artillery. His mother was Sybil Maude Scott\n(\nborn Totnes, Devon in September\n1877\n; died December\n1958)\n. Raymond's father died in Nordrach Sanatorium, Clutton, Somerset on\n11\nSeptember\n1906\nbefore his son\n(\nour mathematician\n)\nwas born and his mother married Neville Edward Anning Gardner, a planter, on\n28\nJune\n1910\n.\nRaymond Paley was educated at Eton. From there he entered Trinity College, Cambridge where he showed himself the most brilliant student among a remarkable collection of fellow undergraduates. He was taught at Cambridge by\nHardy\nand\nLittlewood\nand it was under\nLittlewood\n's supervision that he undertook research\n[\n1\n]\n:-\nHe was Pemberton and Yeats prizeman, and Bladwin scholar and research scholar in\n1927\n.\nHe won a Smith's Prize in\n1930\nand was elected a fellow of Trinity College, Cambridge. While he was undertaking research,\nZygmund\nspent the academic year\n1930\n-\n31\nat Cambridge. Paley had already proved impressive results on\nFourier series\nand had collaborated with\nLittlewood\n, his supervisor.\nZygmund\ndiscovered Paley's extraordinary talent and the two worked jointly on existence proofs, brilliantly applying ideas from\nBorel\n's\nCalcul des probabilités dénombrables\n.\nZygmund\n's book\nTrigonometric Series\npublished in\n1935\nowes a debt to the joint work that he carried out with Paley.\nNorbert Wiener\nwas proving important results in areas of interest to Paley so he applied for a Rockefeller International Research Fellowship to allow him to travel to the United States to collaborate with him at the Massachusetts Institute of Technology.\nNorbert Wiener\nwrote in\n[\n2\n]\n:-\nSoon after his arrival in America, however, certain studies of lacunary series which Paley had already begun suggested a new attack on the theory of interpolation and allied trigonometrical problems. These results led successively to the study of quasi-analytic functions, of entire functions of order one-half, and of many related questions.\nFor a young man of\n26\n, Paley had collaborated with a remarkable group of mathematicians. In addition to\nLittlewood\n,\nZygmund\nand\nNorbert Wiener\n, he had also collaborated with\nPólya\n. As\nNorbert Wiener\nwrote in\n[\n2\n]\n:-\nPossessed of an extraordinary capacity for making friends and for scientific collaboration, Paley believed that the inspiration of continual interchange of ideas stimulates each collaborator to accomplish more than he would alone.\nAlready with a reputation remarkable for one so young, Paley stood on the brink of becoming one of the very first rank of research mathematicians. However, in\n1933\nwhile working in the United States, he went to Canada for a skiing holiday. While skiing near Banff he was killed by avalanche\n[\n1\n]\n:-\n... at Deception Pass, Fossil Mountain in the Rockies. Park wardens and a member of the Canadian Mountain police recovered the body, which has been brought to Banff. Mr Paley was skiing alone at an altitude of\n9\n,\n600\nft, but his death was witnessed by companions lower down the mountainside.\nHad he lived to continue his mathematical work, one feels sure that his name would today be as well known as the mathematicians with whom he collaborated.\nNorbert Wiener\ngave the Colloquium Lectures of the\nAmerican Mathematical Society\nin\n1934\nand spoke on Paley's work. Paley was to have been a Colloquium Lecturer himself.\nNorbert Wiener\nwrote in\n[\n2\n]\n:-\n... he was already recognised as the ablest of the group of young English mathematicians who have been inspired by the genius of\nG H Hardy\nand\nJ E Littlewood\n. In a group notable for its brilliant technique, no one had developed this technique to a higher degree than Paley. Nevertheless he should not be though of primarily as a technician, for with this ability he combined creative power of the first order. As he himself was wont to say, technique without 'rugger tactics' will not get one far, and these rugger tactics he practised to a degree that was characteristic of his forthright and vigorous nature.",
  "math_areas": []
}