{
  "nome_completo": "Johann Müller Regiomontanus",
  "nome_curto": "Regiomontanus",
  "ano_nascimento": "1436",
  "ano_morte": "1476",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Regiomontanus/",
  "lugar_nascimento": "Unfinden (near Königsberg, Lower Franconia (now in Bavaria) Germany)",
  "lugar_morte": "Rome (now Italy)",
  "biografia": "Regiomontanus\nwas born Johann Müller of Königsberg. First let us note that the town of Königsberg near which he was born was not the more famous one in East Prussia. The Latin version of Königsberg\n(\nmeaning King's mountain\n)\nis Regio Monte or, as it later became, Regiomontanus. In fact before we begin to describe the events of his life we should say a little more about the variety of names under which he was known. He matriculated at university as Johannes Molitoris de Künigsperg, using 'Molitoris' which is a Latin form of 'Müller'. Other variants included Johannes Germanus\n(\nJohann the German\n)\n, Johannes Francus\n(\nJohannes from Franconia\n)\n, Johann von Künigsperg\n(\nJohann from Königsberg\n)\n, and the French sounding Joannes de Monte Regio which\nGassendi\ncalled him when he wrote his biography.\nHe was the son of a miller, and became known as a mathematical and astronomical prodigy at a very early age. His early education was at home, but he entered university at the age of eleven, studying dialectics at the University of Leipzig from\n1447\nto\n1450\n. He then entered the University of Vienna on\n14\nApril\n1450\nwhere he became a pupil of\nPeurbach\n. What attracted Regiomontanus to Vienna was principally the\n85\n-year old University and especially its activity in mathematical astronomy and cosmology. He was awarded a baccalaureate on\n16\nJanuary\n1452\nbut the University regulations required him to be\n21\nyears of age before he could be awarded a Master's Degree. This was awarded once he reached the required age in\n1457\n.\nOn\n11\nNovember\n1457\nhe was appointed to the Arts Faculty of the University of Vienna where he collaborated with his former teacher\nPeurbach\n. From\nPeurbach\nhe learnt how inaccurate the Alphonsine Tables were. The two astronomers made observations of Mars which showed the planet to be\n2\n° from its predicted position, and they also observed an eclipse of the moon which happened one hour later than the Tables predicted. Courses Regiomontanus gave at Vienna included one on perspective in\n1458\n, one on\nEuclid\nin\n1460\n, and one on Virgil's\nBucolics\nin\n1461\n. He worked on mathematics, astronomy, and constructed instruments such as astrolabes. He was particularly interested in reading old manuscripts and he made copies for his own use, some of which still survive.\nIn\n1450\nGeorge of Trebizond had translated and commented on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. In this work he had attacked the commentary written by\nTheon of Alexandria\nand, in so doing, he upset Cardinal Johannes Bessarion, papal legate to the Holy Roman Empire, who was a great admirer of\nTheon\n. Cardinal Bessarion was a scholar and native Greek speaker who had a mission to promote classical Greek works in Europe. On\n5\nMay\n1460\nBessarion arrived in Vienna, with his brother Sigismund, on a diplomatic visit to drum up support against the Turks. Bessarion encouraged\nPeurbach\nto produce an abridgment of\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. He had two motives, one being a desire to have a more easily understandable version of\nPtolemy\n's work available; the second being to give support to\nTheon of Alexandria\nagainst the attack from George of Trebizond. When\nPeurbach\nwas on his deathbed in\n1461\n, he begged Regiomontanus to complete the\nEpitome of the Almagest\nand Regiomontanus enthusiastically carried on the work.\nThe Defence of Theon against George of Trebizond\nwas another work which Regiomontanus probably began think about around this time.\nCardinal Bessarion now became Regiomontanus's patron and he travelled to Italy with his patron arriving in Rome on\n20\nNovember\n1461\n. In\n[\n31\n]\nDavid King and Gerard Turner describe a group of eleven astrolabes. They write:-\nOne astrolabe in the group is of particular historical significance because it was presented at Rome in\n1462\n, with a dedicatory inscription, to Cardinal Bessarion, titular Latin patriarch of Constantinople from\n1463\n, and one of the illustrious Greek scholars who contributed to the great revival of letters in the fifteenth century. The astrolabe was presented by Johannes Regiomontanus, whose patron was Bessarion. Regiomontanus, the foremost European astronomer of the time, was commissioned by the Cardinal to prepare an Epitome of\nPtolemy\n's \"Almagest\"\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n, also dedicated to him in\n1462\n.\nThe years\n1461\nto\n1465\nRegiomontanus spent as a member of Bessarion's extended household based mostly in Rome. During this time he was able to read other important Greek manuscripts after improving his knowledge of the language with instruction from the native Greek speaker Bessarion. He also continued to work on the\nEpitome of the Almagest\nwhich he completed in\n1462\n. As well as the time spent in Rome, he travelled in Italy with Bessarion spending the summer of\n1462\nat Viterbo, Cardinal Bessarion's favourite summer residence, and, when Bessarion left for Greece in the autumn of that year, Regiomontanus accompanied him as far as Venice. He left Rome on\n5\nJuly\n1463\nwhen Bessarion was appointed as papal legate to the Venetian Republic. In the spring of\n1464\nhe lectured at the University of Padua\n(\nin the Venetian Republic\n)\nand while there he observed the total eclipse of the moon on\n21\nApril\n1464\n. His lectures on the Muslim scientist al-Farhani have not survived, but his\nIntroductory discourse on all the mathematical disciplines\nwas later published.\nHe visited Venice before returning to Rome in August\n1464\nafter the death of the Pope Pius II. Bessarion had to return at this time to take part in the election of the pope's successor. The astronomer royal for Hungary was Martin Bylica of Olkusz and he had also gone to Rome for the election of the new pope. Bylica and Regiomontanus became friends at this time. On\n19\nJune\n1465\nRegiomontanus made an observation at Viterbo, again in the summer residence. After this, however, there is a two year gap in our knowledge of his activities. At some stage he travelled to Hungary after receiving an invitation from King Matthias I Corvinus which was sent on the recommendation of the Archbishop of Gran, but was almost certainly due to influence by Martin Bylica. Certainly we know that by\n1467\nRegiomontanus was in Hungary having accepted an appointment from the King to the Royal Library in Buda. The King had just completed a highly successful\n(\nfrom his point of view!\n)\ncampaign against the Turks and had returned with many rare books. This provided an ideal position for Regiomontanus since it enabled him to both work with Martin Bylica on astronomy and also to enjoy his passion for old books.\nOne of the old books which Regiomontanus had come across in\n1462\nwhile he was in Venice, was an incomplete copy of\nDiophantus\n's\nArithmetica\n. He wrote to the mathematician Giovanni Bianchini on\n11\nFebruary\n1464\nsaying that if he could find a complete copy he would translate the Greek text. It was while he had been on a trip to Ferrara that he had met Bianchini, who had been a friend of\nPeurbach\n. Regiomontanus never translated\nDiophantus\n's\nArithmetica\nand he never found a complete version. Indeed nobody has ever discovered a complete version, but this important discovery by Regiomontanus marks the beginning of the\nArithmetica\nbecoming known in Europe.\nRegiomontanus made important contributions to trigonometry and astronomy. We have mentioned the above the\nEpitome of the Almagest\nwhich was begun by\nPeurbach\nbut completed by Regiomontanus. It\n[\n1\n]\n:-\n... contributed to current scientific research rather than to improved understanding of the past. Moreover, the \"Epitome\" was no mere compressed translation...\n[\nfor\n]\nit added later observations, revised computations, and critical reflections - one of which revealed that\nPtolemy\n's lunar theory required the apparent diameter of the moon to vary in length much more than it really does. This passage in the \"Epitome\", which was printed in Venice, attracted the attention of\nCopernicus\n, then a student at the University of Bologna.\nIn the\nEpitome\nRegiomontanus, realising the need for a systematic account of trigonometry to support astronomy, promised to write such a treatise. Indeed he did so and his book\nDe triangulis omnimodis\n(1464)\nis a systematic account of methods for solving triangles. In the introduction he writes:-\nYou, who wish to study great and wondrous things, who wonder about the movement of the stars, must read these theorems about triangles. ... For no one can bypass the science of triangles and reach a satisfying knowledge of the stars. ... A new student should neither be frightened nor despair. ... And where a theorem may present some problem, he may always look down to the numerical examples for help.\nRegiomontanus structured his work in a similar way to\nEuclid\n's\nElements. De triangulis\nis in five books, the first of which gives the basic definitions: quantity, ratio, equality, circles, arcs, chords, and the sine function. He then gives a list of the axioms he will assume, followed by\n56\ntheorems on geometry. With Book II the study of trigonometry gets under way in earnest. The sine law is stated\n(\nin modern notation, not used by Regiomontanus, this is\na\nsin\n⁡\nA\n=\nb\nsin\n⁡\nB\n=\nc\nsin\n⁡\nC\n\\Large \\frac {a}{\\sin A}\\normalsize = \\Large \\frac {b}{\\sin B}\\normalsize = \\Large \\frac {c}{\\sin C}\ns\ni\nn\nA\na\n​\n=\ns\ni\nn\nB\nb\n​\n=\ns\ni\nn\nC\nc\n​\n)\nand it is used to solve triangles. The formula for the area of a triangle in terms of two sides and the included angle appears but not in quite the form that one would expect. Books III, IV and V treat spherical trigonometry which, of course, is of major importance in astronomy.\nWhen he was in Hungary, Regiomontanus computed two tables of sines. The first computed in\n1467\nwas\nTables of directions\nwhich was based on sexagesimal numbers, while in the following year in Buda he computed tables of sines to a decimal base. By\n1471\nhe was proposing to move to Nuremberg, writing in a letter to a friend on\n4\nJuly\n1471\n:-\nQuite recently I have made observations in the city of Nuremberg ... for I have chosen it as my permanent home not only on account of the availability of instruments, particularly the astronomical instruments on which the entire science is based, but also on account of the great ease of all sorts of communication with learned men living everywhere, since this place is regarded as the centre of Europe because of the journeys of the merchants.\nWe know that Regiomontanus had indeed been making observations in Nuremberg for he observed a lunar eclipse there on\n2\nJune\n1471\n. By\n29\nNovember he had been granted leave to reside in Nuremberg where he built an observatory and a workshop to construct instruments. He wrote\nScipta\ngiving details of his instruments and these, including dials, quadrants, safea, astrolabes, armillary astrolabe, torquetum, parallactic ruler, and Jacob's staff are described in\n[\n53\n]\n. In January\n1472\nhe made observations of a comet, using his Jacob's staff, which were accurate enough to allow it to be identified with what is now known\n[\n55\n]\nas C/\n1471\nY\n1\n(\nC = non periodic comet\n)\n.\nRegiomontanus's interest in the motion of the Moon led him to make the important observation that the method of lunar distances could be used to determine longitude at sea. It was many years, however, before the position of the Moon could be predicted with sufficient accuracy to make the method practical and instruments constructed to give the lunar position with the high degree of accuracy necessary for the method. Regiomontanus describes how the position of the Moon can be used to determine longitude in the\nEphemerides\nfor the years\n1474\n-\n1506\nwhich he published. This was printed on his own printing press which he set up in Nuremberg.\nThe first European printing of books began in\n1454\nwith the invention of movable type by Johann Gutenberg. Regiomontanus realized the potential value of printing for producing identical multiple copies of scientific texts, which could be carefully edited with accurate diagrams. At Nuremberg in\n1471\n-\n1472\nhe set up a printing press in his own house, and printed a\nProspectus\nannouncing his detailed plans for publishing many carefully edited mathematical, astronomical and geographical texts. He thus became the first publisher of this type of scientific literature which included ancient, mediaeval and modern works. His first publication was\nNew theory of the planets\nby his former teacher\nPeurbach\nand next, in\n1474\n, his own calendar\nKalendarium\n, and his\nEphemerides\nwhich we referred to above. These books were reprinted many times and had great influence, for example both Christopher Columbus and Amerigo Vespucci used Regiomontanus's\nEphemerides\nto measure longitudes in the New World.\nPope Sixtus IV summoned Regiomontanus to Rome in\n1475\nto advise on calendar reform and he left Nuremberg some time after\n28\nJuly when he recorded his last observation there. Bernhard Walther, his wealthy pupil who had funded his instrument shop, observatory and printing works, began observations from Regiomontanus's observatory in Nuremberg on\n2\nAugust. It is certain that Regiomontanus had left Nuremberg by then. He died in Rome and some accounts say he was poisoned by his enemies, other accounts say he died from the plague. The latter is far more likely but let us look briefly at the two theories.\nRegiomontanus had announced that he would publish a work showing the worthlessness of George of Trebizond's whose:-\n... commentary on the \"Syntaxis\" he will show with the utmost clarity to be worthless and his translation of\nPtolemy\n's work not to be free of faults.\nThis was considered sufficient motive for his murder by the two sons of George of Trebizond and rumours circulated to this effect. It seems a rather unlikely scenario, however, for others criticised George of Trebizond as vigorously as did Regiomontanus yet no attempts appear to have been made on their lives. Much more likely is that, after the Tiber overflowed its banks in January\n1476\nand there was a resulting outbreak of plague, Regiomontanus became its victim.",
  "math_areas": [
    "Logic"
  ]
}