{
  "nome_completo": "René Thom",
  "nome_curto": "René Thom",
  "ano_nascimento": "1923",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thom/",
  "lugar_nascimento": "Montbéliard, Doubs, France",
  "lugar_morte": "Bures-sur-Yvette, France",
  "biografia": "René Thom\nis known for his development of catastrophe theory, a mathematical treatment of continuous action producing a discontinuous result.\nFrom\n1931\nThom attended Primary School in Montbéliard, the town of his birth in which his parents were shopkeepers. It was at this primary school that Thom first showed his academic potential winning a scholarship. He attended Collège Cuvier at Montbéliard and received his baccalaureate in elementary mathematics from Besançon in\n1940\n. However his life was about to be disrupted by World War II.\nThom's parents sent him and his brother south to avoid the conflict although they themselves remained in Montbéliard. Thom and his brother eventually reached Switzerland. He writes in\n[\n6\n]\n:-\nThe surprising warmth with which we were welcomed there, all those people offering food and drink at the roadside, still fills me with emotion.\nAfter helping with the harvest near Romont, Thom returned to France being taken to Lyon where he lived with a friend of his mother. While in Lyon he continued his education, receiving his baccalaureate in philosophy in June\n1941\n. After this he returned to his parents home in Montbéliard but was soon in Paris again to continue his education.\nThom attended the Lycée Saint-Louis in Paris and applied to enter the École Normale Supérieure but failed to gain entrance in\n1942\n. Determined to take advantage of a university education at the École Normale Supérieure, he applied again in\n1943\nand this time he was\n[\n6\n]\n:-\n... successful\n(\nbut not brilliantly so\n)\n!\nAt the École Normale Supérieure times were difficult as Paris was occupied by the German forces. However, mathematically it was an exciting time for Thom who was to be strongly influenced by\nHenri Cartan\nand the\nBourbaki\napproach to mathematics. World War II ended while Thom was still studying at the École Normale Supérieure and\n[\n6\n]\n:-\n... the last year, after the 'victory', was a year of opening, bringing with it the impression of once more living life to the full. Of this rebirth I can recall a sensation of freedom that I found hard to control.\nIn\n1946\nThom graduated from the École Normale Supérieure and then moved to Strasbourg, taking a CNRS research post, so that he could continue to work with\nHenri Cartan\n. There he was influenced by others including\nEhresmann\nand Koszul. His doctorate, supervised by\nHenri Cartan\n, was awarded in\n1951\nfor a thesis entitled\nFibre spaces in spheres and Steenrod squares\n. The work of the thesis was carried out in Strasbourg but Thom presented it to Paris. The foundations of the theory of cobordism, for which Thom later received a\nFields Medal\n, already appear in his doctoral thesis.\nThom was awarded a fellowship to allow him to travel to the United States in\n1951\nand he relates in\n[\n6\n]\nhow this enabled him to meet\nEinstein\n,\nWeyl\n, and\nSteenrod\n, and to attend the seminars of Calabi and\nKodaira\n. Thom returned to France and taught at Grenoble in\n1953\n-\n54\n, then at Strasbourg from\n1954\nuntil\n1963\n. He was appointed a professor in\n1957\n.\nIt is as the inventor of catastrophe theory that Thom is best known but his earlier work had made him well known before he worked on catastrophe theory. His work on\ntopology\n, in particular on characteristic classes, cobordism theory and the Thom transversality theorem led to his being awarded a Fields medal in\n1958\n. However, Thom feels that in some sense he did not deserve the honour\n[\n6\n]\n:-\n... I have the impression that work was done just a little while later that was greater in depth and sagacity than mine and whose authors were quite as deserving, if not more so, of the medal\n(\nsuch as my co-medallist\nKlaus Roth\n)\n. I am thinking too of Barry Mazur's demonstration of the\nSchönflies\nconjecture: Every sphere\nS\nn\n−\n1\nS^{n-1}\nS\nn\n−\n1\nin\nR\nn\n\\mathbb{R}^{n}\nR\nn\nwith regular boundary is the boundary of an\nn\nn\nn\n-ball. Not to mention the discovery by\nMilnor\nof exotic spheres.\nHopf\n, who awarded the Fields Medal to Thom in Edinburgh, pointed in his presentation address to the importance of Thom's theory:-\n... his basic ideas, the grand simplicity of which I have talked of, are of a very geometric and intuitive nature. These ideas have significantly enriched mathematics, and everything seems to indicate that the impact of Thom's ideas - whether they find their expression in the already known or in forthcoming works - is not exhausted by far.\nHowever, the award of the Fields Medal gave Thom freedom to choose a new research direction\n[\n1\n]\n:-\nThom said that the Fields Medal had brought him the freedom to choose what research he wanted to do, and for him that was essential. He began to take the whole of science as his canvas. He was not a theoretical or experimental scientist, in the sense of designing experiments and predicting results, but rather a philosopher of science, writing about the long-term future developments in the sciences that needed to occur.\nIn\n1964\nhe moved to the Institut des Hautes Études Scientifiques at Bures-sur-Yvette. However this prompted a change in direction as he explains in\n[\n6\n]\n:-\nRelations with my colleague\nGrothendieck\nwere less agreeable for me. His technical superiority was crushing. His seminar attracted the whole of Parisian mathematics, whereas I had nothing new to offer. That made me leave the strictly mathematical world and tackle more general notions, like the theory of morphogenesis, a subject which interested me more and led me towards a very general form of 'philosophical' biology.\nThom's theory is an attempt to describe, in a way that is impossible using differential calculus, those situations in which gradually changing forces lead to so-called catastrophes, or abrupt changes. The theory has widespread application in the physical and biological sciences and in the social sciences. Presented by Thom in\nStructural Stability and Morphogenesis\n(1972)\n, the theory has since been developed by many mathematicians. However, writing in\n[\n6\n]\n, Thom explains why the theory which was\nmarked by enormous popular success\nhas fallen from favour:-\nIt is a fact that catastrophe theory is dead. But one could say that it died of its own success. It was brought down by the extension from analytical\n(\nor algebraic\n)\nmodels to models that were only smooth. For as soon as it became clear that the theory did not permit quantitative prediction, all good minds ... decided it was of no value. When it comes down to it, this extension resulted from\nB Malgrange\n's extension of the preparation theorem.\nThom was awarded the Grand Prix Scientifique de la Ville de Paris in\n1974\n. He was made an honorary member of the\nLondon Mathematical Society\nin\n1990\n.\nAs a seminar speaker, Thom could be difficult to follow\n[\n1\n]\n:-\n[\nH\n]\nis seminars were often confusing, because his mind tended to leap ahead, leaving the audience to fill in the gaps.\nHowever, mathematical conversations with him could be a wonderful experience\n[\n1\n]\n:-\n... one-to-one conversations with him were marvellous: if challenged to fill a gap he would often reveal a goldmine. He showed a gentle wit, a great scepticism, and a quiet amusement at the human condition. He had original ideas about everything under the sun. His writings were often provocative in order to stimulate the reader into seeing the truth.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Topology"
  ]
}