{
  "nome_completo": "René François Walter de Sluze",
  "nome_curto": "René de Sluze",
  "ano_nascimento": "1622",
  "ano_morte": "1685",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sluze/",
  "lugar_nascimento": "Visé, Spanish Netherlands (now Belgium)",
  "lugar_morte": "Liège, Spanish Netherlands (now Belgium)",
  "biografia": "René de Sluze\nwas baptised on\n7\nJuly\n1622\n, when five days old. His name appears in various forms as is common for the age in which he lived. Perhaps the most common French form of his name is 'Sluse', but the Latin version 'Slusius' is the one form which is always used in his scientific international correspondence. His father and paternal grandfather were both named René de Sluse so we now have to be careful in giving details of three people with the same name; let us temporarily call them René the Younger, René the Elder, and René the Eldest. René the Elder was a lawyer working as clerk of the court, while his father René the Eldest served as mayor of Visé. The mother of René the Younger\n(\nRené the Elder's husband\n)\nwas Catherine Waltheri de Castro, a daughter of Walther Plorard who was mayor of Visé on several occasions. Several other members of the family were prominent figures, like for example René's maternal uncle Gualthère Waltheri who also trained as a lawyer and served as the secretary of papal briefs to Innocent X, pope from\n1644\nto\n1655\n. After the death of Innocent X, he served as secretary of papal briefs to his successor, pope Alexander VII. Another of René's maternal uncles was Jean Waltheri who was first a canon and then the dean of the collegial church in Visé. René had two brothers: Pierre Louis and Jean Gualière who both entered the Church, the latter became a cardinal in the year following René's death. René's family had no doubts the direction that his life should take, namely a training in law leading to an ecclesiastical career, and his education was arranged with this aim in mind. His early education was from his uncle Jean Waltheri who at that time was canon of Visé.\nDe Sluze studied civil and canon law at the University of Louvain from the autumn of\n1638\nto the summer of\n1642\n. He then went to Rome where his uncle Gualthère Waltheri was based. De Sluze studied at the University of Sapienza and received a doctorate in law in October\n1643\n. Sapienza was the name of the building which housed the University of Rome, and it gave its name to the University. After this de Sluze remained in Rome where he greatly enjoyed the scholarly environment and he studied a large number of subjects including many languages such as Greek, Hebrew, Arabic and Syriac, as well as mathematics and astronomy. His skill in languages was such that pope Innocent X often asked him to translate various letters sent to the pope by Greek and Armenian bishops and other prelates in the East. Although mathematics was the topic which seemed least useful for his future ecclesiastical career, it was the subject which de Sluze enjoyed more than any other, although one has to say that he also greatly enjoyed many other of his wide interests. He read about the latest mathematical progress through studying the works of the Italian mathematicians\nBonaventura Cavalieri\nand\nEvangelista Torricelli\n. While in Rome, he became friendly with the historian Pierre Lambecius from Hamburg. They remained friends for life and corresponded regularly.\nDe Sluze became a canon in the collegiate church in Visé on\n8\nOctober\n1650\n, although this appointment was only a nominal one to provide him with an income and de Sluze did not need to return to Visé but remained in Rome. He left Rome in the following year when he was appointed by pope Innocent X to the Cathedral Church of St Lambert in Liège. His knowledge of law meant that he progressed rapidly within the Church and quickly rose to positions of influence\n[\n1\n]\n:-\nHis understanding of law and his great knowledge brought him many high positions. But his success in the administration of a small state severed him from the life he had known in Rome and thrust him into an intellectual vacuum; and his administrative duties left him little leisure for scientific work, particularly after\n1659\n, when he became a member of the Privy Council of Prince-Bishop Maximilian Henry who was also elector of Cologne.\nIn fact it was on\n27\nMarch\n1659\nthat he became a member of the privy council. He became abbot of S le Ode at Amay in\n1666\n, conseiller ordinaire in\n1673\n, and vice-provost of the cathedral on\n20\nJanuary\n1676\n.\nGiven his busy life, the only route left open to de Sluze to interact with other mathematicians was by correspondence. He corresponded with many mathematicians in England, France and other European countries, for example he was in regular contact with\nBlaise Pascal\n,\nChristiaan Huygens\n, and\nJohn Wallis\n. However, one of his most useful links with other mathematicians and scientists came through correspondence with Henry Oldenburg, the secretary of the\nRoyal Society\nin London. Before we discuss this, let us look at his earlier mathematical contributions to which correspondence also played a large part.\nDe Sluze wrote to\nChristiaan Huygens\non\n14\nMarch\n1658\nregarding integrating the cissoid, or rather in the language of the time, its quadrature or finding the area under the curve. This work had been inspired by\nMersenne\nwho had informed them of\nTorricelli\n's solution of the problem of calculating the volume of the solid generated by revolving a hyperbola about the axis. Jahnke writes\n[\n5\n]\n:-\nThe background to the study of the cissoid was two-fold. In the first place it fitted into a much broader programme which aimed at deriving the quadrature of the circle from the quadrature of curves related to the circle. The cissoid was clearly one such curve. In the second place Sluse and\nHuygens\nwere puzzled, as were many of their colleagues, by the discovery of\nTorricelli\n's \"improper integral\". Sluse and\nHuygens\nwere trying to find a similar result for other curves of infinite length. Again the cissoid was a candidate.\nSome weeks after de Sluze had determined the volume of revolution of the cissoid,\nHuygens\nfound its quadrature. He announced the result to de Sluze on\n5\nApril\n1658\nand on\n28\nMay\n1658\nhe sent a proof. In June\n1658\nBlaise Pascal\nissued a challenge to mathematicians to find the area under the cycloid and also to find the volume it generates when rotated about its base.\nPascal\nof course, issued the challenge already knowing how to solve these problems. De Sluze had gained the experience necessary to solve such problems and sent his solution to\nPascal\nwho praised it highly. In\n1659\nde Sluze published\nMesolabum\n, or to give it its full name,\nMesolabum seu  duse mediae proportionales inter extremas datas per circulum et ellipsim vel hyperbolam infinitis modis exhibitae\nⓉ\n(\nWork on two mean proportionals between the two measurements given by a circle and an ellipse or an infinite hyperbola\n)\n. This work was on geometrical construction in which he discussed the cubature of various solids and the solutions to third and fourth degree equations which he obtained geometrically using the intersection of any conic section with a circle. The family of curves\ny\nn\n=\nk\n(\na\n−\nx\n)\np\nx\nm\ny^{n} = k(a - x)^{p} x^{m}\ny\nn\n=\nk\n(\na\n−\nx\n)\np\nx\nm\nfor positive integer exponents, are called the 'pearls of Sluze'. He discussed these curves as well as the problem of the volume generated by rotating the cissoid about its asymptote in\nMiscellanie\n, which was material he added to the second edition of\nMesolabum\nin\n1668\n.\nMore about these curves are at\nTHIS LINK\n.\nCorrespondence had continued with\nHuygens\nand other mathematicians. On\n24\nFebruary\n1665\nHuygens\nwrote to de Sluze to let him know:-\nI put forth instructions for sailors on the use of the pendulum clock, which will soon be corroborated with experiment. I will send an example if you understand our language.\nOne month later de Sluze replied to\nHuygens\nsaying that he would read it to the best of his ability. On\n10\nApril he wrote again to\nHuygens\nto say that he had received the book but had been too busy to examine it fully.\nHuygens\nalso sent a copy of\nHorologium Oscillatorium\n(1673)\nto de Sluze.\nReturning to de Sluze's correspondence through Henry Oldenburg, let us quote Marie Boas Hall\n[\n3\n]\n:-\nOldenburg initiated the correspondence\n[\nwith René de Sluse\n]\nin February\n1666\n-\n7\n, writing in flattering terms of Sluse's published work. He described the aims of the\nRoyal Society\nand sought an exchange of letters which should inform the English of Sluse's research undertaken since the publication of his 'Mesolabum', which, he said, had been much appreciated in England, although copies were scarce. Oldenburg inquired about the natural history of the country around Liège, a well-known centre for mining, and about \"whatever novelties there may be of a mechanical kind\" ... Sluse was later to reply fully to all these requests, satisfying the Society's mathematical interests in good measure as well as Oldenburg's expressed interest in natural history and the history of trades. In this first instance he responded only with polite acknowledgements, doubting, he said, whether a sustained correspondence was possible since it had taken three months for Oldenburg's letter to arrive.\nIn fact the return letter took only nine days and a regular correspondence was possible. Oldenburg transmitted mathematical details to de Sluze based on the information given him by\nWallis\n,\nBrouncker\nand\nWren\nconcerning their latest research\n[\n3\n]\n:-\nSluse was to remain a faithful correspondent for many years and to become in\n1669\nthe first to learn of the then little known mathematical skill and achievement of the young Lucasian Professor of Mathematics at Cambridge,\nIsaac Newton\n. Sluse's interests were in some cases very close to those of\nNewton\nand he received eagerly the accounts of his work written by\nCollins\nspecifically for Oldenburg to transmit to him.\nIn fact\nCollins\nwas reporting on\nNewton\n's work which was being explained to him by\nBarrow\n. De Sluze received information that\nNewton\nhad devised a method to find\ntangents\nand on other topics that\nNewton\nhad been working on such as infinite series. He responded in\n1671\nthat he was going to publish an old work of his own on the topic of tangents, a method he had perfected using ideas from\nDescartes\nand\nFermat\n. In the following year de Sluze sent full details of his method of finding tangents to Oldenburg, who published it in the\nPhilosophical Transactions of the Royal Society\nin\n1672\nunder the title\nAn extract of a letter from the excellent Renatus Franciscus Slusius, Canon of Liège and Councellor of his Electoral Highness of Cologne. Written to the publisher in order to be communicated to the Royal Society, concerning his short and easier method of drawing tangents to all geometrical curves without labour of calculation\n. One has to say that this work on tangents makes de Sluze a major figure in the development of the calculus. In fact\nLeibniz\nlearned much through reading de Sluze's writings.\nOldenburg responded to de Sluze with full details of\nNewton\n's method as described to him by\nCollins\n. When he received the details, de Sluze realised that his method was essentially identical to that of\nNewton\n. He wrote\n(\nsee for example\n[\n3\n]\n)\n:-\nI can say nothing else of the famous\nNewton\n's method than that it seems to me to be my own, which to be sure I have used for many years now ...\nThis generous statement by de Sluze led to an equally generous response by\nNewton\n(\nsee for example\n[\n3\n]\n)\n:-\nBy a former letter of yours I was a little dubious whether M Slusius might not apprehend, by what you wrote to him concerning me, that I pretended to his method of drawing tangents; until I understood by M\nCollins\nthat you signalled to him that you thought it here of a later date. For it seems to me that he was acquainted with it some years before he printed his 'Mesolabum' and consequently before I understood it. But if it had been otherwise yet since he first imparted it to his friends and the world, it ought deservedly to be accounted his. As for the methods they are the same, though I believe derived from different principles ...\nThere was therefore no disagreement regarding priority; the two discoveries were independent, with de Sluze making his discovery several years before\nNewton\n.\nAnother potential controversy arose through de Sluze and\nHuygens\nboth solving\nAlhazen\n's Problem. They had both been stimulated to work on it by reading\nIsaac Barrow\n's\nLectiones Opticae\nⓉ\n(\nLessons in optics\n)\n(1669)\nwhere he gave only a partial solution to the problem.\nHuygens\nsent his results to Oldenburg in which he stated that he had found an elegant solution. Some time later de Sluze told Oldenburg that he had found a good method of solution and was then sent details of\nHuygens\n' method by Oldenburg. De Sluze responded with details of his own approach which Oldenburg forwarded to\nHuygens\n. This all took a little time and de Sluze had improved his method by the time\nHuygens\nhad received Oldenburg's letter. Both men agreed that their approaches were similar but, perhaps not surprisingly, both thought their own way to be the most elegant.\nHuygens\nsaid he would write directly to de Sluze:-\n... since he is the most knowledgeable and candid of all the geometers I know.\nHe did not do so, however, and, after both men further improved their respective approaches, the exchange was published in the\nPhilosophical Transactions of the Royal Society\nin October\n1673\n. De Sluze was elected a Fellow of the\nRoyal Society\non\n16\nApril\n1674\n, having been proposed by Oldenburg.\nDe Sluze did not write exclusively on mathematics. He also wrote on astronomy, physics, natural history, history and theological matters connected with his work in the church. An extensive list of de Sluze's research interests appears in\n[\n4\n]\n;_\n... his research ranged from mathematics to astronomy, chronometry, chemistry, medicine, embryology, the development of the thermometer and the barometer, and the transfusion of blood. His literary work also included a defence of the Latin language ...\nHis historical works are quite important. He wrote a book on the death of St Lambert, bishop of Maastricht, who was murdered in\n705\n. A chapel was built in St Lambert's honour on the spot where died and St Hubert, his successor as bishop of Maastricht, transferred his see there in\n721\nso creating the town of Liège. De Sluze left hundreds of pages of unpublished work, including a history of Cologne as well as much on mathematics, astronomy, physics and natural history. How de Sluze must have enjoyed being asked by Oldenburg about the history and natural history around Liège.",
  "math_areas": []
}