{
  "nome_completo": "Ricardo Mañé Ramirez",
  "nome_curto": "Ricardo Mañé",
  "ano_nascimento": "1948",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mane/",
  "lugar_nascimento": "Montevideo, Uruguay",
  "lugar_morte": "Montevideo, Uruguay",
  "biografia": "Ricardo Mañé\nwas the son of Edelmiro Mañé and Maria Adelaida Ramírez Garcia. Edelmiro Mañé was a professor of thermodynamics in the Faculty of Engineering in the Universidad de la Republica at Montevideo and wrote the book\nTermodinámica: ensayo de una puesta a punto de la termidonámica macroscópica\nⓉ\n(\nThermodynamics: an essay of an overview of macroscopic thermodynamics\n)\n(1974)\n. Maria Adelaida Ramírez was a well-known Uruguayan lyrical soprano. Juan Andrés Ramírez\n(\nborn\n1947)\n, was Ricardo Mañé's cousin. He became a well-known lawyer who was elected as a senator for the National Party in the\n1990\ns.\nIt was in Montevideo that Ricardo was brought up and attended schools. In\n1967\nhe entered the Faculty of Engineering in the Universidad de la Republica where his aim was to obtain a degree in electrical engineering. He was taught mathematics by Jorge Lewowicz\n(1937\n-\n2014)\nand soon became fascinated by ideas that Lewowicz was discussing with a group of mathematics students. Lewowicz had been born in Uruguay and completed an undergraduate degree there before going to Brown University, Rhode Island, USA, to study for a Ph.D. in mathematics supervised by\nMauricio Peixoto\nand\nSolomon Lefschetz\n. He had been awarded a Ph.D. in\n1966\nfor his thesis\nOn Relative Invariant Sets\n. Mañé was an outstanding student and in\n1969\n, while still an undergraduate, he became an assistant in mathematics and began studying dynamical systems advised by Lewowicz.\nJacob Palis\nwas a Brazilian mathematician who went to the United States in\n1966\nto undertake postgraduate studies. He studied at the University of California, Berkeley, advised by\nStephen Smale\nand was awarded a Master's Degree in\n1966\nand a Ph.D. in\n1968\nfor his thesis\nOn Morse-Smale Diffeomorphisms\n. Back in Brazil he worked at the Instituto Nacional de Matemática Pura e Aplicada\n(\nIMPA\n)\nin Rio de Janeiro.\nPalis\nwrote papers making substantial contributions to dynamical systems working on ideas involving the Stability Conjecture. This conjecture had come out of the work of\nStephen Smale\n, and\nMauricio Peixoto\nwas also working on this topic. Near the end of\n1970\n,\nPalis\nreceived a long letter from Ricardo Mañé, who was totally unknown to him, on dynamical systems.\nPalis\nexplained\n[\n9\n]\n:-\nI opened it and it was from someone from Uruguay, saying that he had proved a series of theorems of the highest significance in this area of research, where all but one of them answered open problems. This was part of my work with\nSteve Smale\n, my advisor in Berkeley, California. This is how Ricardo Mañé presented himself, with an immense letter, not only enunciating these great theorems, but also giving sketches of the proofs. ... I was amazed that someone in Uruguay had been able to write a letter, possibly full of statements and incomplete or even wrong proofs, but with immense good taste about what the central problems of the area at that time would be, and also the audacity to propose even plans of proofs.\nJorge Lewowicz was visiting the Instituto Nacional de Matemática Pura e Aplicada in Rio de Janeiro when\nPalis\nreceived the letter. When\nPalis\ntold him about it, Lewowicz was angry that Mañé, still an undergraduate, had the audacity to send such a letter to a leading expert on the topic, and moreover had done it without his knowledge. At that time,\nJacob Palis\nand\nMauricio Peixoto\nwere organising the first International Symposium on Dynamical Systems, to be held at the University of Bahia, Salvador, Brazil from\n26\nJuly to\n14\nAugust\n1971\n. After receiving Mañé's letter, they discussed inviting him to speak at this conference. He accepted and while at the conference spoke to\nPalis\nabout the possibility of studying for a Ph.D. at the Instituto Nacional de Matemática Pura e Aplicada in Rio de Janeiro. Mañé was also considering going to New York University and studying there for his Ph.D. advised by\nJurgen Moser\n. In September\n1971\nhe wrote to\nPalis\nsaying he had decided he would like to study with him at the IMPA in Rio de Janeiro. Despite the fact that he still had not completed his undergraduate studies in Montevideo, he was immediately accepted by the IMPA and by the end of September\n1971\nhe was in Rio de Janeiro beginning his doctoral programme.\nElon Lages Lima\ndescribes getting to know Mañé after he came to Rio de Janeiro\n[\n9\n]\n:-\n... as soon as he arrived in Rio, he moved to Leblon, where I also lived. I was always with him carrying his unfailing umbrella. He had the habit of carrying an umbrella even on sunny days. It didn't matter what the weather was like: he was always with his umbrella walking around Leblon. As he didn't have a car, I often took him to Maracanã, at the time when Maracanã was frequented. There we talked about all things, not only about mathematics and my insistence on the book he had to write, but about politics, not only in Brazil and Uruguay, but international politics. He was a very cultured person, very experienced, having lived in his youth more through the deep readings he did. He was a voracious reader. When he wasn't doing mathematics, he was always reading other things.\nPalis\nwrites about having Mañé as his Ph.D. student\n[\n9\n]\n:-\nFrom the beginning he was very peculiar both as a person and as a student. He was exceptional, brilliant. He quickly completed the necessary credits for his doctorate. Soon, he took the initiative regarding his thesis. I did not choose the topic of his thesis ... which was already quite unusual at that time. It is true that I argued with him a lot. He came, presented proposals and we tried to get things right, I eliminated things that I thought were less possible or less interesting. Anyway, it was very much his own initiative. He completed his doctorate in an absolutely record period of one and a half years. In February\n1973\nhe was defending his thesis receiving all the awards. Truly an exceptional figure who soon gained immense sympathy and respect from his colleagues.\nAfter completing his doctorate, in\n1973\nMañé was appointed as an assistant professor at the IMPA in Rio de Janeiro.\nIn\n1973\n-\n74\n, the symposium 'Applications of Topology and Dynamical Systems' was organised at the University of Warwick, England, by\nChris Zeeman\n. Mañé attended the Warwick Symposium in the summer term of\n1974\nand had five papers in the Proceeding\n[\n8\n]\npublished in\n1975\n. These papers are:\nAbsolute and infinitesimal stability\n;\nQuasi-Anosov diffeomorphisms\n;\nOn infinitesimal and absolute stability of diffeomorphisms\n;\nExpansive diffeomorphisms\n; and\n(\nwith Charles Pugh\n)\nStability of endomorphisms\n.\nIn collaboration with Paulo Sad and\nDenis Sullivan\n, Mañé wrote the paper\nOn the dynamics of rational maps\npublished in\n1983\n. The paper begins:-\nIt is a remarkable fact that each complex analytic endomorphism f of the\nRiemann\nsphere\nC\n\\mathbb{C}\nC\nexhibits highly non-trivial dynamical phenomena. In this paper we first describe classical and recent results which give the basic dynamical picture of these mappings. Then we make use of this picture to construct topological conjugacies or partial topological conjugates between certain nearby endomorphisms in analytic families of endomorphisms.\nThe paper contains the result which today is known as the Mané-Sad-\nSullivan\ntheorem on the density of stable polynomials.\nMañé attended the\n1982\nInternational Congress of Mathematicians held in Warsaw in August\n1983\n. Also in\n1983\nhe published the book\nIntrodução à teoria ergódica\nⓉ\n(\nIntroduction to ergodic theory\n)\n. It was reviewed by Clark Robinson\n[\n13\n]\nwho writes:-\nThis book presents the theory of smooth ergodic theory, i.e. the part of modern ergodic theory which is connected with differential dynamical systems. P Walters' book\n[\nAn introduction to ergodic theory, Springer, New York,\n1982]\nis the most similar, but it only covers about two-thirds of the material. Much of this recent material is available in numerous research articles, but not a systematic textbook like the one under review. The first half of the book presents the classical theory, first through examples and then a more systematic presentation. The second half of the book presents the theory connected with entropy which was introduced by\nKolmogorov\n.... Both measure-theoretic and topological entropy are introduced and connected through the variational principle establishing topological entropy as the supreme of measure-theoretic entropy. The last topics present the connection of entropy with\nLyapunov\nexponents. ... The book is well written with problems at the end of each section. It is self-contained and includes a rapid review of the theorems needed from measure theory. The statements of the theorems are clear and easily found. This book provides an accessible introduction to an important and active area of current research.\nThe book was translated into English and published in\n1987\nwith the title\nErgodic Theory and Differentiable Dynamics\n. Mañé's Preface to the English Edition begins:-\nThis version differs from the Portuguese edition only in a few additions and many minor corrections. Naturally, this edition raised the question of whether to use the opportunity to introduce major additions. In a book like this, ending in the heart of a rich research field, there are always further topics that should arguably be included. Subjects like geodesic flows or the role of\nHausdorff\ndimension in contemporary ergodic theory are two of the most tempting gaps to fill. However, I let it stand with practically the same boundaries as the original version, still believing these adequately fulfil its goal of presenting the basic knowledge required to approach the research area of Differentiable Ergodic Theory.\nPeter Walters writes in the review\n[\n16\n]\n:-\nThis book is the eagerly awaited translation into English of the Instituto de Matemática Pura e Aplicada monograph written in Portuguese and not easily available outside Brazil. The aim of the book is to describe the rudiments of measure-theoretic ergodic theory and apply these to the qualitative study of diffeomorphisms.\nThe book was also reviewed by John Franks who writes\n[\n2\n]\n:-\nI like this book very much. It presents the right material in a coherent framework with just the right balance of general theory and concrete examples. The topics covered are well chosen and there is a wealth of material to be found here. ... It must be said that some of the topics covered by Mañé\n(\nthe ergodic theory of\nAnosov\ndiffeomorphisms for example\n)\nare technical and difficult. This is probably a difficulty with any book presenting a young and active field, however. The author in his introduction acknowledges that some proofs are \"arid and demanding\" and encourages the reader to concentrate on their complement in the text. This is good advice, and I found it quite feasible to do so and still learn a great deal.\nIn\n1984\nMañé made a research visit to Paris, France, to work with\nJean-Christophe Yoccoz\n, a leading expert on dynamical systems.\nYoccoz\nwas a close friend of\nJacob Palis\nand had been very excited when told about the Mané-Sad-\nSullivan\ntheorem, which had led to Mañé's visit to Paris. Mañé was a John Simon Guggenheim Fellow, awarded in\n1985\n.\nMañé's colleagues believed that his outstanding contributions deserved a\nFields\nMedal in\n1986\nwhen only three\nFields\nMedals were awarded. João Moreira Salles writes in\n[\n14\n]\n:-\nThe practice of awarding four researchers was not followed, perhaps due to the fact that a fourth name worthy of the laurel was not found. It could have been Ricardo Mañé, but, producing mathematics on the fringes of the Atlantic Forest, on the fringes of the great research centres and at a time when information circulation was so less than today, it would be surprising if anyone remembered him. \"Brazil did not have enough articulation in the world of mathematics,\" explains\nPalis\nin his office at IMPA. Marcelo Viana, a researcher at the institution and a student at\nPalis\n, adds: \"At the time, Brazil was a peripheral country and behaved like a peripheral country. We sat there hoping someone would come up with his name.\"\nFrom the time Mañé began living in Leblon, Rio de Janeiro, he had rented an apartment and, being rather impractical, had put his money into a bank account with no protection against inflation. At the beginning of the\n1980\ns his friends persuaded him to buy an apartment and he did so in Gávea, an affluent residential neighbourhood in the south zone of Rio de Janeiro. Although he had never been baptised, he began attending the Catholic Church in Gávea. Early in\n1988\nJacob Palis\n's young daughter Laura was going to be baptised and Mañé asked if he could be her godfather. He was baptised immediately before Laura so that he could be her godfather.\nIn August\n1988\nthere was a four-week long Summer School on Dynamical Systems held in Trieste, Italy, organised by\nJacob Palis\nand\nChristopher Zeeman\n. It was attended by around\n200\nstudents and Mañé gave the course on Ergodic Theory with Marcelo Viana helping him by running the exercise classes. Viana said\n[\n9\n]\n:-\nA specific text was required for each course. His course was Ergodic Theory. He wrote the text and asked me to proofread it. ... I had already read some of Ricardo's writings, but perhaps not as closely and not to the level where clarity of exposition is paramount, because this course was intended for an audience at the elementary level of ergodic theory. And I remember being deeply impressed by the way in which all the difficulties of exposing sophisticated topics to an audience that weren't supposed to be sophisticated had been resolved in a way that at some points was even brilliant. And at the same time, I followed the process relatively closely, and it was clear from the text and from direct contact with Ricardo, that he had a great joy in what he was doing. He was writing a text, where essentially everything was contained in his book, and yet he was finding new angles and having fun while writing the text.\nAlso in\n1988\nMañé published the paper\nA proof of the\nC\n1\nC^{1}\nC\n1\nstability conjecture\n. Roberto Moriyon writes in a review that the paper contains a proof of the Stability Conjecture:-\nThis solves one of the most outstanding conjectures in the field of dynamical systems, posed by\nS Smale\nand\nJ Palis\nin\n1970\n.\nThe\n1994\nInternational Congress of Mathematicians was held at Zurich in August\n1994\n. Mañé attended the Congress and delivered the lecture\nErgodic variational methods: new techniques and new problems\n. He begins by writing:-\nOur subject will be minimising measures of Lagrangian dynamical systems.\nIt was announced at the Congress that\nJean-Christophe Yoccoz\nwas one of the four\nFields\nMedal winners.\nYoccoz\ngave the lecture\nRecent developments in dynamics\nin which he referred to Mañé's\n1988\nresult:-\nUniformly hyperbolic diffeomorphisms ... are stable: two\nC\n∗\nC^{^{*}}\nC\n∗\nclose uniformly hyperbolic diffeomorphisms are topologically conjugated on a neighbourhood of their respective chain recurrent sets. Actually, a deep theorem of Mañé\n(\nextended by\nPalis\n)\nstates that the converse is also true: a diffeomorphism that is\nC\n1\nC^{1}\nC\n1\nstable in this sense is uniformly hyperbolic.\nAlthough Mañé worked in Brazil throughout his career, he was not eligible for a fellowship of the\nBrazilian Academy of Sciences\nsince he was not a Brazilian citizen. This changed in\n1994\nwhen he became a Brazilian citizen and was immediately elected as a fellow of the\nBrazilian Academy of Sciences\n. Also in\n1994\nhe was awarded\nThe World Academy of Sciences\nPrize for Mathematics. He was asked to provide the Academy with a brief account of his career and mathematical achievements and you can read what he wrote at\nTHIS LINK\n.\nIn fact Mañé died before the award ceremony for\nThe World Academy of Sciences\nPrize and the prize was received by one of his colleagues.\nWe mentioned at the beginning of this biography that Mañé's cousin Juan Andrés Ramírez was involved in politics. In November\n1994\nthere was an election for Uruguay's third president since the end of the military dictatorship in\n1985\n. Juan Andrés Ramírez was one of four candidates in the election and Mañé travelled to Montevideo to vote for his cousin. The election was very close but Juan Andrés Ramírez was narrowly defeated. Mañé remained in Montevideo and gave a seminar at the Mathematics Centre in the middle of December. His health was deteriorating and instead of returning to Rio de Janeiro for the end of year holidays, he remained in Montevideo for treatment.\nThere are two rather different accounts of Mañé's illness and we will give both. Ezequiel Maderna, an associate professor at the Universidad de la República de Uruguay, writes in\n[\n4\n]\n:-\n... the doctors detected the beginning of a metastasis, due to lung cancer. While his health began to deteriorate rapidly, he dealt with great determination putting on paper all the mathematical ideas he planned to develop. I remember at that time going to his mother's house, where he received visits from family and friends every afternoon, taking half a dozen books that he asked me to borrow from our library. Many afternoons we would all find ourselves on the pavement outside his house, waiting for the regular interview that Ricardo had with a priest to finish. On\n8\nMarch\n1995\n, Mañé was admitted to the Spanish sanatorium on Garibaldi street, where he continued to write his extensive notes. Finally, they gave rise to his famous posthumous publication \"Lagrangian flows: the dynamics of globally minimizing orbits\" in the Bulletin of the\nBrazilian Mathematical Society\nin the year\n1997\n. Obviously, many details were left unfinished, but in the years that followed these omissions were corrected, his observations were expanded or corrected, and many of the proofs were finally established with the greater rigour that characterises mathematical work.\nMartín Sambarino, who was a Ph.D. student of\nJacob Palis\nand is a professor at the Universidad de la Republica, Montevideo, gives a different account of Mañé's death in\n[\n15\n]\n:-\nMañé died prematurely at the age of\n48\ndue to HIV, a disease that, during the\n1980\ns and\n1990\ns, hit mainly homosexuals who used their freedom. Ricardo found that freedom in Brazil. The same freedom with which he thought and created mathematics.\nLet us end with the comments of\nJacob Palis\n(\nsee\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nRicardo Mañé was one of the most brilliant mathematicians ever in Latin America. In the words of\nLennart Carleson\n, he had a unique approach to mathematics and will have no substitute. Certainly not. Yet, his powerful intellect will be with us for many years to come: He permanently influenced the area of dynamical systems as well as his friends, colleagues and students at his so much loved IMPA, to which he had always been adamantly faithful. We all remember him as a wonderful and most inspiring lecturer. Also as a funny and often ironic story teller, incredibly sharp, intelligent and knowledgeable\n(\na compulsive reader\n)\n, as well as a profound connoisseur of opera. In brief, a most unforgettable human being and mathematician.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}