{
  "nome_completo": "Richard Rado",
  "nome_curto": "Richard Rado",
  "ano_nascimento": "1906",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rado_Richard/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Henley-on-Thames, Oxfordshire, England",
  "biografia": "Richard Rado\n's father was Leopold Rado who was a Hungarian from Budapest. Richard, his parents' second son, made a decision while at school to choose between being a concert pianist or a mathematician. He chose mathematics and entered the University of Berlin to study that subject. However music continued to play a large role in his life. He spent some time at Göttingen but returned to the University of Berlin to study for his doctorate under\nSchur\n. At this stage he was also strongly influenced by\nSchmidt\n. Rado's thesis, entitled\nStudies on combinatorics\n, earned him a doctorate in\n1933\n.\n(\nLenz discusses the circle of problems connected with Rado's dissertation in\n[\n5\n]\n.\n)\nHe had earlier met Luise Zadek when he was looking for somebody to play piano duets with, and they married on\n16\nMarch\n1933\n. They had one son, Peter Rado, born in\n1943\n.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. Rado's family were Jewish so the Civil Service Law made it impossible for him to become a university lecturer in Germany. Rado was interviewed in Berlin by Lord Cherwell for a scholarship given by the chemist Sir Robert Mond which provided financial support to study at Cambridge. After he was awarded the scholarship, Rado and his wife left for England. Rado entered Fitzwilliam House, University of Cambridge, and completed a second Ph.D. in\n1935\nunder\nHardy\n's supervision on\nLinear transformations of sequences\n. While at Cambridge Rado was influenced by many mathematicians working there at the time including\nHardy\n,\nLittlewood\n,\nHall\n,\nBesicovitch\nand\nBernhard Neumann\n.\nRado also worked with\nHeilbronn\nand\nDavenport\nand, at around this time, he began to correspond with\nErdős\n. They met in\n1934\nand began a fruitful collaboration which resulted in a number of joint papers. This collaboration was described by\nErdős\nin\n[\n4\n]\n. After completing his second Ph.D. he spent a further year at Cambridge as a temporary lecturer. In\n1936\nRado was appointed to the University of Sheffield where, after\nMirsky\nwas appointed in\n1942\n, the two became close friends. In\n1947\nRado moved to King's College, London, moving seven years later to a chair at the University of Reading. He remained at Reading until he retired in\n1971\n.\nRado's work covered a wide range of mathematics but his most important work was in combinatorics. These important combinatorial results were in the area of\nHall\n's theorem,\nRamsey\n's theorem, the Rado selection principle, matroids and theory of transversals, and partitions. Together with\nErdős\nhe developed the partition calculus.\nRogers\nin\n[\n2\n]\nillustrates this with a simple example:-\n... if six people meet by chance, one can be sure that either at least three all know each other or there are at least three with no two knowing each other.\nSome of his more minor work was in topics such as the convergence of sequences and series. He studied inequalities, geometry and\nmeasure theory\n, particularly working in this area with\nBesicovitch\n. In graph theory he worked on infinite graphs and hypergraphs. Rado's approach to mathematics is described by\nErdős\nin\n[\n4\n]\nwhere he comments:-\nI was good at discovering perhaps difficult and interesting special cases and Richard was good at generalising them and putting them in their proper perspective.\nIn\n[\n8\n]\n(\nsee also\n[\n9\n]\n)\nRado is described by saying:-\nRichard was fascinated by mathematical beauty and sought after it. He always tried to formulate his results at their natural level of generality, so that their full power was exhibited, without their content being obscured by over-elaboration.\nRado received many honours for his contributions. He was elected a fellow of the\nRoyal Society\non\n16\nMarch\n1978\n. He was very moved to be awarded an honorary doctorate by the Free University of Berlin in\n1981\n.\nRogers\nwrites in\n[\n2\n]\nof Rado's continuing love of music:-\nRado and his wife had a double partnership: she went with him to mathematical conferences and meetings and kept contact with his mathematical friends, he was an accomplished pianist and she was a singer of professional standard. They gave many recitals both public and private, often having musical evenings in their home in Reading. Rado was the kindest and gentlest of men.\nRado and his wife continued to live in Reading after he retired. He died in a nursing home in Henley-on-Thames and his wife died less than six months later.",
  "math_areas": [
    "Combinatorics",
    "Geometry"
  ]
}