{
  "nome_completo": "Richard Streit Hamilton",
  "nome_curto": "Richard Hamilton",
  "ano_nascimento": "1943",
  "ano_morte": "2024",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamilton_Richard/",
  "lugar_nascimento": "Cincinnati, Ohio, USA",
  "lugar_morte": "New York City, New York, USA",
  "biografia": "Richard Hamilton\nwas the son of William Selden Hamilton\n(1906\n-\n1985)\nand Hester Streit\n(1910\n-\n1996)\n. Selden Hamilton was born on\n20\nJanuary\n1906\nin Franklin, Warren, Ohio. He graduated from Franklin High School in\n1923\n, was awarded a B.A. by Yale in\n1927\nwhere, in addition to his studies, he was in the football squad and the lacrosse squad. He graduated Doctor of Medicine from Johns Hopkins in\n1931\n, then served as intern at Miami Valley Hospital, Dayton before spending a year in the medical practice of his father Norval A Hamilton. He married Hester Streit, daughter of Oscar R Streit and June Bullock of Norwood, on\n21\nMarch\n1933\nat Oscar Streit's home in Norwood. Immediately after the wedding, the couple moved to Rochester, Minnesota, where Selden had a fellowship at the Mayo Clinic. Selden Hamilton registered for the World War II Draft in the Norwood Public Library on\n16\nOctober\n1940\n. Selden and Hester Hamilton's first child, William Selden Hamilton Jr\n(1941\n-\n2021)\nwas born in Cincinnati on\n11\nDecember\n1941\n. We note that he was awarded a Ph.D. from Yale university and became a Professor of Slavic Languages and Linguistics at Wake Forest University. Their second son was Richard Streit Hamilton, the subject of this biography, born\n10\nJanuary\n1943\n. Selden Hamilton became a naval surgeon and spent the first two years of Richard's life in undertaking military service in Portsmouth, England. During these two years, Richard, his older brother William, and mother Hester lived with Hester's mother June Streit.\nRichard attended Lotspeich Elementary School which had been founded by Helen Lotspeich in\n1916\n. The school which began with Lotspeich as the only teacher, soon expanded adding more buildings and teachers. When Richard Hamilton studied there, it provided him with an excellent education. It was while at this school that his interest in mathematics took him to study at a level well above what was taught at the school\n[\n11\n]\n:-\nIn the fourth grade, out of curiosity I went to the library and took out a book on first year algebra. I taught myself first year algebra in a month, and went back for the second year algebra book.\nFrom Lotspeich Elementary School, Hamilton progressed to Walnut Hills High School where his elder brother Billie was already a pupil. Walnut Hills High School was the third public High School in Cincinnati when it was established in\n1895\n. By the time Richard and Billie Hamilton studied there, it had gained an excellent reputation and was the school where many of the brightest children in the district were educated. While at this school, both brothers were members of Scarab, a traditional secret society founded in\n1909\n. In\n1959\nBillie Hamilton was President of Scarab and Richard Hamilton was Treasurer:-\nThe fraternity participated in all three interfraternity sports competitions - football, basketball, and baseball, as well as the interfraternity sing and the scholastic achievement contest. ... Scarab helped the Bank of Hope during its collection drive.\nBillie Hamilton graduated from Walnut Hills High School in\n1959\nand Richard, who was one year behind his brother, decided to skip his final year at the school. Both brothers left the school in\n1959\nand began their university education at Yale University. This meant that Richard Hamilton was only sixteen year old when he began his university studies in Trumbull College, Yale University. One would expect that he found the mathematics classes the most interesting but the wide range of his interests is illustrated by the fact that he writes in\n[\n11\n]\n:-\nThe most interesting classes were in ancient Greek, where we read the tragedies, the comedies and the great orators\n(\nin the original\n)\n, and my philosophy classes with Brand Blanshard, a wonderful old scholar who had not changed his philosophical ideas since before WWI.\nHe graduated summa cum laude from Yale with a B.A. in\n1963\nand then went to Princeton University to undertake graduate work. His thesis advisor was Robert Clifford Gunning\n(\nborn\n1931)\n. Gunning had himself studied for a Ph.D. at Princeton University, his advisor being\nSalomon Bochner\n. He was on the staff at Princeton from\n1957\nand was the author of several excellent books on complex analysis and Riemann surfaces. While Hamilton was studying for his doctorate, Gunning was writing three books,\nAnalytic functions of several complex variables\n,\nLectures on Riemann Surfaces\n, and\nLectures on Vector Bundles over Riemann Surfaces\n. Given the interests of his thesis advisor, it is not surprising that the topic of Hamilton's thesis is\nRiemann\nsurfaces. He graduated with a Ph.D. in\n1966\nhaving written the\n196\n-page thesis\nVariation of Structure of Riemann Surfaces\n.\nWhile he was a graduate student, Hamilton married Sally Harper Swigert\n(1944\n-\n2022)\nin the Seventh Presbyterian Church on Saturday,\n11\nSeptember\n1965\n. Sally was the daughter of James Mack Swigert\n(\nknown as Mack\n)\nand Alice Harrower. The reception was held in the Cincinnati Country Club. Richard and Sally Hamilton had one son, Andrew Streit Hamilton, born on\n8\nOctober\n1966\n. Richard and Sally Hamilton were divorced several years later.\nDescribing Hamilton's outstanding contributions requires technical terms which may not be familiar to those reading this biography. Before we proceed, therefore, we will give Hamilton's own Abstract for the lecture\nThe Ricci Flow and the Poincaré Conjecture\nwhich he gave to a general audience at Lehigh University on Monday\n15\nApril\n2019\n[\n25\n]\n:-\nA manifold is a topological space which is locally like a Euclidean space of some dimension. A two-dimensional manifold is called a surface. A manifold that does not go off to infinity but closes back on itself is called compact. We understand all the possible shapes of compact surfaces. The oriented ones are the sphere, the donut, or donuts with several holes.\nOur world space is three dimensional\n(\nnot counting time\n)\n. But according to\nEinstein\nit is not flat but curved, with curvature appearing as gravity. Of course we have limited experience of only a small part of it, and hence no idea of the total shape. Like the earth, it may curve back on itself, or have wormholes connecting one part to a distant part. So topologists naturally asked what are all the possible shapes of compact three-dimensional manifolds?\nOn the compact surfaces, the sphere is the only one where every curve bounds a disk; on the others, a curve going around a hole does not. Such a manifold is called simply connected. In\n1904\n,\nPoincaré\nconjectured the only compact simply connected three-manifold is the sphere. Famously, a proof of this conjecture was given by Dr\nPerelman\nin\n2002\n-\n2003\n, using the\nRicci\nflow.\nA manifold can carry a metric, measuring the distances between points. In differential geometry, the metric is given as a quadratic function on tangent vectors, measuring the square of their lengths. The length of a path is given by an integral of the lengths of tangent vectors.\nThe heat equation on a surface\n(\nor manifold\n)\nis a partial differential evolution equation for a function whose solution describes how the initial given heat will spread by diffusion around the surface\n(\nor manifold\n)\nto approach a constant equal distribution of heat. The\nRicci\nflow is a partial differential evolution equation for a metric which tries to spread the curvature to approach a constant equal distribution. The idea for the\nPoincaré\nconjecture is that if the metric converges to constant positive curvature, the manifold must be the sphere.\nAfter graduating with his Ph.D., Hamilton was appointed to Cornell University. There he became a colleague of\nJames Eells\nwho was working on global analysis\n[\n9\n]\n:-\nIt is tempting to describe global analysis as a holistic approach to mathematics. In it the whole geometry or topology of the spaces involved play a role, rather than just the equations describing the behaviour or motion in small areas. Non-linearity, especially that caused by curvature, is a prevalent aspect. A prime example is\nEells\n's most famous article, \"Harmonic Mappings of Riemannian Manifolds\", published in the American Journal of Mathematics in\n1964\n. Written with J H Sampson of Johns Hopkins University, it founded the theory of \"harmonic maps\" and the \"non-linear heat flow\".\nHamilton was influenced by\nEells\n, particularly the \"Harmonic Mappings of Riemannian Manifolds\" paper. He said\n[\n16\n]\n:-\nThis was the first example of using a nonlinear parabolic flow to solve an elliptic equation in geometry, and was my inspiration for creating the\nRicci\nflow. ... By the mid seventies I had begun work on the\nRicci\nflow, and published the first result in\n1982\non the case of three dimensional manifolds with positive\nRicci\ncurvature.\nHamilton's\n1982\npaper,\nThree-manifolds with positive Ricci curvature\n, was an exceptionally important one, proving even more important in the fullness of time than was realised when it was published. Jerry Kazdan writes in a review\n[\n12\n]\n:-\nWhile most of the arguments are quite elementary, using only the classical maximum principle to estimate various quantities, the convergence arguments are quite delicate and ingenious, and are special to the\n3\n-dimensional case. One key observation is that the geometric entities all satisfy various heat equations. As an added bonus, this beautiful paper is nicely written and should be accessible to many geometers who would like to see a good application of analysis to geometry.\nSylvia Nasar and David Gruber write in\n[\n18\n]\n:-\nThat year\n[1982]\n, Richard Hamilton, a mathematician at Cornell, published a paper on an equation called the\nRicci\nflow, which he suspected could be relevant for solving\nThurston\n's conjecture and thus the\nPoincaré\nconjecture. Like a heat equation, which describes how heat distributes itself evenly through a substance - flowing from hotter to cooler parts of a metal sheet, for example - to create a more uniform temperature, the\nRicci\nflow, by smoothing out irregularities, gives manifolds a more uniform geometry.\nThis\n1982\npaper on the\nRicci\nflow was, in fact, the first of\n29\npapers by Hamilton on the\nRicci\nflow. His work in this area did indeed lead to the solution of the\nPoincaré\nConjecture; we shall say more about this below.\nThis was not the only paper Hamilton published in\n1982\n, for he also published\nThe inverse function theorem of Nash and Moser\n. This\n158\n-page paper was reviewed by Peter Michor who began his review as follows:-\nThis paper is a careful exposition of the\nNash\n-\nMoser\ninverse function theorem in a setting that allows one to apply the theorem without the need to prove a new version of it for each new kind of application. Along with this comes much useful extra equipment\n(\na priori estimates\n)\nfitting perfectly into the setting. Convincing examples show the theorem with its different \"outfits\" at work.\nAlthough we have looked at Hamilton's\n1982\npapers, we should mention before continuing his book\nHarmonic maps of manifolds with boundary\nwhich he published in\n1975\n. Jean-Claude Mitteau writes in the review\n[\n15\n]\n:-\nThis book on harmonic maps between Riemannian manifolds essentially concerns the examination of the case where the manifolds have a boundary. The method of demonstrating the existence of harmonic applications by the convergence, for\nt\n→\n∞\nt \\rightarrow  ∞\nt\n→\n∞\n, of the solutions of the heat equation naturally associated with this problem, is extended in this new case, thus making it possible to obtain the existence of harmonic maps in homotopy classes of boundary varieties, subject to conditions on curvatures. We will also find in this book an introduction to specialised functional spaces for solving this type of problem.\nHamilton had many hobbies including riding horses and windsurfing. While at Cornell, he introduced his son Andrew to some of his sporting loves. He wrote in the autobiography\n[\n16\n]\n:-\nMy son Andrew would visit and we could snow ski in winter, and water ski and scuba dive in the summer.\nCornell, however, was not the right place for Hamilton as he explained in\n[\n16\n]\n:-\nI really wanted to get out of Cornell. It was lovely in the summer, but summer was short. In the fall it rained all the time, and in the winter it snowed all the time, and in the spring it rained all the time. And I have allergies to mould spores, and that was not a healthy place for me to be, so to speak - so motive to leave ...\nThe Mathematical Sciences Research Institute\n(\nMSRI\n)\n, at the University of California, Berkeley, was opened in temporary accommodation in September\n1982\n.\n[\nTo avoid confusion, let us note that the MSRI was renamed the Simons Laufer Mathematical Sciences Institute\n(\nSLMath\n)\nin\n2022\n.\n]\nShiing-Shen Chern\nwas the founding director of the Institute and Calvin Moore was the founding deputy director. Hamilton's paper on the\nRicci\nflow was seen to be highly significant, and he was invited to the MSRI in the first year it opened.\nShing-Tung Yau\nand\nRichard Schoen\nwere also invited to the MSRI in this first year. It was immediately clear that Hamilton,\nYau\nand\nSchoen\nwere working on similar problems in geometric analysis and that the interaction between them was vey fruitful.\nIn\n1984\n Hamilton,\nYau\nand\nSchoen\nall moved to a position at the University of California at San Diego. The authors of\n[\n18\n]\nwrite:-\nYau\nwas especially impressed by Hamilton, as much for his swagger as for his imagination. \"I can have fun with Hamilton,\"\nYau\ntold us during the string-theory conference in Beijing. \"I can go swimming with him. I go out with him and his girlfriends and all that.\" Yau was convinced that Hamilton could use the\nRicci\n-flow equation to solve the\nPoincaré\nand\nThurston\nconjectures, and he urged him to focus on the problems. \"Meeting\nYau\nchanged his mathematical life,\" a friend of both mathematicians said of Hamilton. \"This was the first time he had been on to something extremely big. Talking to\nYau\ngave him courage and direction.\"\nIn\n1995\n, Hamilton published the survey paper\nThe formation of singularities in the Ricci flow\n. Man Chun Leung writes in the review\n[\n14\n]\n:-\nIn this paper the author surveys some of the basic geometrical properties of the\nRicci\nflow with a view to considering what kind of singularities might form. The\nRicci\nflow was introduced by the author in his celebrated work on deformation of metrics the by\nRicci\nflow on compact\n3\n-manifolds with positive\nRicci\ncurvature. It has been found to be a useful tool in the study of Riemannian geometry, both for compact and for open manifolds. ... The paper is well written and delightful to read. Many examples are worked out in detail to illustrate the idea. It gives a rather complete account and up-to-date references on current research on the\nRicci\nflow.\nFor a longer quote from Man Chun Leung's review and other material on the\nRicci\nflow and the\nPoincaré\nconjecture, see\nTHIS LINK\n.\nThe\n1996\nOswald Veblen\nPrize in Geometry was awarded at the Joint Mathematics Meetings in Orlando in January\n1996\nto Richard Hamilton of the University of California, San Diego, and to Gang Tian of the Massachusetts Institute of Technology. This was the first major award to Hamilton and the Citation begins\n[\n1\n]\n:-\nRichard Hamilton is cited for his continuing study of the\nRicci\nflow and related parabolic equations for a Riemannian metric and he is cited in particular for his analysis of the singularities which develop along these flows.\nFor the full Citation and other material relating to this award, see\nTHIS LINK\n.\nIn\n1998\nHamilton left the University of California at San Diego when he was appointed Davies Professor of Mathematics at Columbia University. While at Columbia, Hamilton received three further major awards. The first was the\n2003\nClay Research Award\n[\n7\n]\n:-\nThe\n2003\nClay Research Award was made to Richard Hamilton for his discovery of the\nRicci\nFlow Equation and its development into one of the most powerful tools of geometric analysis. Hamilton conceived of his work as a way to approach both the\nPoincaré\nConjecture and the\nThurston\nGeometrization Conjecture.\nFor other material relating to this award, see\nTHIS LINK\n.\nIn\n2009\nhe was awarded the Leroy P Steele Prize for Seminal Contribution to research. The award was for the paper he had published in\n1982\n, over a quarter of a century earlier\n[\n2\n]\n:-\nThe\n2009\nLeroy P Steele Prize for Seminal Contribution to Research is awarded to Richard Hamilton for his paper \"Three-manifolds with positive Ricci curvature\", Journal of Differential Geometry\n17\n(1982)\n,\n255\n-\n306\n.\nFor other material relating to this award, see\nTHIS LINK\n.\nThe\n2011\nShaw Prize in Mathematical Sciences was awarded to Demetrios Christodoulou and Richard S Hamilton:-\n... for their highly innovative works on nonlinear partial differential equations in Lorentzian and Riemannian geometry and their applications to general relativity and topology.\nFor other material relating to this award, see\nTHIS LINK\n.\nOther honours given to Hamilton include membership of the\nNational Academy of Sciences\nin\n1999\nand membership of the\nAmerican Academy of Arts & Sciences\nin\n2003\n.\nIn\n2022\nHamilton, then aged\n79\n, joined the University of Hawaii\n[\n5\n]\n:-\nAfter a more than\n20\n-year effort, one of the greatest mathematicians of this century has landed at the University of Hawaii's flagship campus. Richard Hamilton, a top scholar in the field of geometry, has joined the University of Hawaii Mānoa faculty as an adjunct professor in the Department of Mathematics.\nHamilton's main contributions are focused around geometric analysis and partial differential equations\n(\nfound in math-centred scientific fields such as physics and engineering\n)\n. He is most well-known for creating the \"\nRicci\nFlow,\" a ground-breaking partial differential equation in geometry, which is similar to the diffusion of heat and the heat equation. Many other mathematicians have built upon Hamilton's methods to expand our knowledge of the field of geometry.\n\"Richard Hamilton is one of the most original and influential mathematicians currently working,\" said Department of Mathematics Professor and Chair Rufus Willett. \"We are honoured to have him join our department, and look forward to his having many fruitful interactions with our students and faculty.\"\nHamilton is also a member of the\nAcademy of Sciences\n, and received some of the most prestigious mathematics prizes. This includes the $\n1\nmillion Shaw Prize split equally between Hamilton and Demetrios Christodoulou for their highly innovative works on nonlinear partial differential equations in Lorentzian and Riemannian geometry and their applications to general relativity and topology.\n'Wonderful' first visit to the islands\nHamilton first came to Hawaii in\n1988\nafter Professor Emeritus Joel Weiner invited him to visit University of Hawaii Mānoa's mathematics department for an academic year.\n\"I fell in love with the islands the first morning I woke up here,\" Hamilton said. \"The stay was wonderful and the department treated me great. I have in particular developed a strong relationship with Professor George Wilkens\n(\nresearcher in the field of differential geometry\n)\nand more recently with Professor Monique Chyba, with whom I am collaborating on a textbook introducing the basics of differential geometry, as well as how they can be applied to many areas in mathematics, physics and engineering.\"\nWilkens added, \"It took many years to formalise this collaboration and count Dr Hamilton as a member of our faculty. I cannot be more happy and delighted for our department.\"",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}