{
  "nome_completo": "Richard Dagobert Brauer",
  "nome_curto": "Richard Brauer",
  "ano_nascimento": "1901",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brauer/",
  "lugar_nascimento": "Berlin-Charlottenburg, Germany",
  "lugar_morte": "Belmont, Massachusetts, USA",
  "biografia": "Richard Brauer\n's father was Max Brauer who was a well-off businessman in the wholesale leather trade. Max Brauer's wife was Lilly Caroline and Richard was the youngest of their three children. He had an older brother\nAlfred Brauer\n, who also became a famous mathematician and has a biography in this archive.\nAlfred Brauer\nwas seven years older than Richard and of an age between the two brothers was Richard's sister Alice.\nRichard entered the Kaiser-Friedrich-Schule in Charlottenburg in\n1907\n. Charlottenburg was a district of Berlin which was not incorporated into the city until\n1920\n. Richard studied at this school until\n1918\nand it was during his school years that he developed his love of mathematics and science. However, this was not due to the teaching at the school, but it came about through the influence of his brother Alfred. In\n[\n4\n]\nRichard writes about his school teachers whom he describes as not being very competent. There was one exception however, and it was fortunate that this good teacher was a mathematician who had a doctorate awarded for research done under\nFrobenius\n's supervision.\nOf course Richard's last four years at school were the years of World War I, but, unlike his brother, he was young enough to avoid being drafted into the army. When he graduated from the Kaiser-Friedrich-Schule in September\n1918\nthe war was still in progress, and Brauer was drafted to undertake civilian war service in Berlin. Only two months later, in November\n1918\n, the war ended, Brauer was released from war service and he resumed his education. Despite the love for mathematics which he had gained from his brother, Brauer decided to follow his boyhood dreams of becoming an inventor. He entered the Technische Hochschule of Charlottenburg in February\n1919\nwhere he studied for a term before, having realised that his talents were in theory rather than practice, he transferred to the University of Berlin.\nAt the University of Berlin Brauer was taught by a number of really outstanding mathematicians including\nBieberbach\n,\nCarathéodory\n,\nEinstein\n,\nKnopp\n, von\nMises\n,\nPlanck\n,\nSchmidt\n,\nSchur\nand\nSzegő\n. In\n[\n4\n]\nBrauer describes some of the lectures he attended; talking of\nSchmidt\n's lectures he writes:-\nIt is not easy to describe their fascination. When\nSchmidt\nstood in front of a blackboard, he never used notes, and was hardly ever well prepared. He gave the impression of developing the theory right there and then.\nIt was the custom that German students at this time spent periods in several different universities during their degree course. Brauer was no exception to this, although he made only one visit during his studies, that being for a term to the University of Freiburg. Back in Berlin he attended seminars by\nBieberbach\n,\nSchmidt\nand\nSchur\n. He was increasingly attracted towards the algebra which\nSchur\nwas presenting in his seminar\n(\nwhich was attended in the same year by\nAlfred Brauer\n)\n.\nSchur\n, unlike\nSchmidt\n,\n[\n4\n]\n:-\n... was very well prepared for his classes, and he lectured very fast. If one did not pay the utmost attention to his words, one was quickly lost. There was hardly any time to take notes in class; one had to write them up at home. ... He conducted weekly problem hours, and almost every time he proposed a difficult problem. Some of the problems had already been used by his teacher\nFrobenius\n, and others originated with\nSchur\n. Occasionally he mentioned a problem he could not solve himself.\nIn fact it was one of these open problems which Richard working with his brother Alfred solved in\n1921\nand this was eventually to be included in Brauer's first publication.\nSchur\nsuggested the problem that Brauer worked on for his doctorate and the degree was awarded\n(\nwith distinction\n)\nin March\n1926\n. His dissertation took an algebraic approach to calculating the\ncharacters\nof the irreducible\nrepresentations\nof the real orthogonal\ngroup\n. Before the award of his doctorate, however, Brauer had married Ilse Karger in September\n1925\n. They had been a fellow students in one of\nSchur\n's courses on\nnumber theory\n. Before his marriage Brauer was appointed as\nKnopp\n's assistant at the University of Königsberg and he took up this post in the autumn of\n1925\n.\nShortly after Brauer arrived in Königsberg,\nKnopp\nleft to take up an appointment at Tübingen. The mathematics department at Königsberg was small, with two professors\nSzego\nand\nReidemeister\n, and with\nRogosinski\nand\nKaluza\nholding junior positions like Brauer. It was in Königsberg that Brauer's two sons, George Ulrich Brauer and Fred Günter Brauer were born. Brauer taught at Königsberg until\n1933\nand during this period he produced results of fundamental importance.\nGreen\nwrites in\n[\n6\n]\n(\nor see\n[\n1\n]\n)\n:-\nThis was the time when Brauer made his fundamental contribution to the algebraic theory of simple algebras. ... Brauer developed ... a theory of central division algebras over a given perfect field, and showed that the isomorphism classes of these algebras can be used to form a commutative group whose properties gave great insight into the structure of simple algebras. This group became known\n(\nto the author's embarrassment\n)\nas the \"Brauer group\" ...\nPolitical events forced Brauer's family to move. He wrote\n(\nsee\n[\n4\n]\n)\n:-\nI lost my position in Königsberg in the spring of\n1933\nafter Hitler became Reichskanzler of Germany.\nBrauer was from a Jewish family so was dismissed from his post under the Nazi legislation which removed all Jewish university teachers from their posts. This was a desperate time for Brauer who realised that he had to find a post outside Germany. Fortunately action was taken in several countries to find posts abroad for German academics forced from their positions and a one year appointment was arranged for Brauer in Lexington, Kentucky for the academic year\n1933\n-\n34\n. In November\n1933\nBrauer arrived to take up his appointment at the University of Kentucky, his wife and two sons following three months later. We should record that\nAlfred Brauer\nleft Germany in\n1939\n, but Brauer's sister Alice stayed behind and was murdered in a concentration camp by the Nazis.\nFollowing his year in Lexington, Brauer was appointed as\nWeyl\n's assistant at the Institute for Advanced Study in Princeton. He wrote in\n[\n4\n]\nabout this appointment with\nWeyl\n:-\nI had hoped since the days of my PhD thesis to get in contact with him some day; this dream was now fulfilled.\nCollaboration between Brauer and\nWeyl\non several projects followed, in particular a famous joint paper on spinors published in\n1935\nin the\nAmerican Journal of Mathematics\n. This work was to provide a background for the work of Paul\nDirac\nin his exposition of the theory of the spinning electron within the framework of\nquantum mechanics\n.\nA permanent post followed the two temporary posts when Brauer accepted an assistant professorship at the University of Toronto in Canada in the autumn of\n1935\n. It was largely as a result of\nEmmy Noether\n's recommendation, which she made while visiting Toronto, which led to his appointment. This was a time when Brauer developed some of his most impressive theories, carrying the work of\nFrobenius\ninto a whole new setting, in particular the work on group characters\nFrobenius\npublished in\n1896\n. Brauer carried\nFrobenius\n's theory of ordinary characters\n(\nwhere the characteristic of the field does not divide the order of the group\n)\nto the case of modular characters\n(\nwhere the characteristic does divide the group order\n)\n. He also studied applications to number theory.\nC J Nesbitt was Brauer's first doctoral student in Toronto and he described their relationship as doctoral student and supervisor\n(\nsee for example\n[\n6\n]\n)\n:-\nCuriously, as thesis advisor, he did not suggest much preparatory reading or literature search. Instead we spent many hours exploring examples of the representation theory ideas that were evolving in his mind.\nIt was in joint work with Nesbitt, published in\n1937\n, that Brauer introduced the theory of blocks. This he used to obtain results on finite groups, particularly finite\nsimple groups\n, and the theory of blocks would play a big part in much of Brauer's later work.\nAlperin also spoke of Brauer's thirteen years in Toronto\n(\nsee\n[\n3\n]\n)\n:-\nThe years he spent at Toronto were his most productive years. He achieved five or six great results during that time, any one of which would have established a person as a first-rank mathematician for the rest of their life. ... those years had their high points, but also contained fallow periods, when there was the day-to-day grind of raising a family in modest circumstances.\nBrauer spent\n1941\nat the University of Wisconsin having been awarded a Guggenheim Memorial Fellowship. He was the Colloquium lecturer at the\nAmerican Mathematical Society\nSummer Meeting in Madison, Wisconsin in\n1948\n. Later that year he moved from Toronto back to the United States, accepting a post at the University of Michigan in Ann Arbor. In\n1949\nBrauer was awarded the Cole Prize from the\nAmerican Mathematical Society\nfor his paper\nOn\nArtin\n's L-series with general group characters\nwhich he published in the\nAnnals of Mathematics\nin\n1947\n. In\n1951\nHarvard University offered him a chair and, in\n1952\n, he took up the position in Harvard which he was to hold until he retired in\n1971\n. In the year of his retirement he was honoured with the award of the National Medal for Scientific Merit.\nWe have mentioned a number of topics which Brauer worked on in the course of this biography. However we have not yet mentioned the work which in many ways was his most famous and this he began around the time he took up the chair at Harvard. He began to formulate a method to classify all finite simple groups and his first step on this road was a group-theoretical characterisation of the simple groups\nP\nS\nL\n(\n2\n,\nq\n)\nPSL(2,q)\nP\nS\nL\n(\n2\n,\nq\n)\nin\n1951\n(\nalthough for a complicated number of reasons explained in\n[\n6\n]\nand\n[\n1\n]\nthis did not appear in print until\n1958)\n. This work was done jointly with his doctoral student K A Fowler, and in\n1955\nthey published a major paper which was to set mathematicians on the road to the classification. The paper was\nOn groups of even order\nand it provided the key to the major breakthrough by\nWalter Feit\nand\nJohn Thompson\nwhen they proved that every finite simple group has even order unless it is cyclic of prime order.\nBrauer was to spend the rest of his life working on the problem of classifying the finite simple groups. He died before the classification was complete but his work provided the framework of the classification which was completed only a few years later.\n(\nSee the biography of\nGorenstein\nfor further details on the programme to classify finite simple groups.\n)\nMost important was Brauer's vital step in setting the direction for the whole classification programme in the paper\nOn groups of even order\nwhere it is shown that there are only finitely many finite simple groups containing an involution whose centraliser is a given finite group. Brauer had announced these results and his programme for classifying finite simple groups at the International Congress of Mathematicians in Amsterdam in\n1954\n.\nGreen\nin\n[\n6\n]\npoints out that when Brauer went to Harvard he was\n51\nyears old, yet almost half his total of\n147\npublications were published after this date. He certainly did not sit quietly working away in Harvard. He spent extended periods visiting friends and colleagues in universities around the world, for example Frankfurt and Göttingen in Germany, Nagoya in Japan, and Newcastle and Warwick in England.\nDespite his remarkable contributions to research, Brauer found time to act as an editor for a number of journals. He was an editor of the\nTransactions of the Canadian Mathematical Congress\nfrom\n1943\nto\n1949\n, the\nAmerican Journal of Mathematics\nfrom\n1944\nto\n1950\n, the\nCanadian Journal of Mathematics\nfrom\n1949\nto\n1959\n, the\nDuke Mathematical Journal\nfrom\n1951\nto\n1956\nand again from\n1963\nto\n1969\n, the\nAnnals of Mathematics\nfrom\n1953\nto\n1960\n, the\nProceedings of the Canadian Mathematical Congress\nfrom\n1954\nto\n1957\n, and the\nJournal of Algebra\nfrom\n1964\nto\n1970\n. A quick glance will show that in\n1955\nhe held editorships of four learned journals.\nWe have mentioned above a number of honours which Brauer received. We should also mention the learned societies which honoured him with membership: the\nRoyal Society of Canada\n(1945)\n, the\nAmerican Academy of Arts and Sciences\n(1954)\n, the\nNational Academy of Sciences\n(1955)\n, the\nLondon Mathematical Society\n(1963)\n, the Akademie der Wissenschaften Göttingen\n(1964)\n, and the American Philosophical Society\n(1974)\n. He was also elected President of the Canadian Mathematical Congress\n(1957\n-\n58)\nand the\nAmerican Mathematical Society\n(1959\n-\n60)\n.\nIn\n[\n1\n]\nand\n[\n6\n]\nGreen\ndescribes Brauer's character\n(\nno pun intended!\n)\n:-\nAll who knew him best were impressed by his capacity for wise and independent judgement, his stable temperament and his patience and determination in overcoming obstacles. He was the most unpretentious and modest of men, and remarkably free of self-importance. ...\nBrauer's interest in people was natural and unforced, and he treated students and colleagues alike with the same warm friendliness. In mathematical conversations, which he enjoyed, he was usually the listener. If his advice was sought, he took this as a serious responsibility, and would work hard to reach a wise and objective decision.\nRichard Brauer occupied an honoured position in the mathematical community, in which the respect due to a great mathematician was only one part. He was honoured as much by those who knew him for his deep humanity, understanding and humility; these were the attributes of a great man.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}