{
  "nome_completo": "Richard Steven Varga",
  "nome_curto": "Richard Varga",
  "ano_nascimento": "1928",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Varga/",
  "lugar_nascimento": "Cleveland, Ohio, USA",
  "lugar_morte": "Cleveland, Ohio, USA",
  "biografia": "Richard Varga\n's parents were both Hungarians who had emigrated to the United States and settled in Cleveland. This city was a good choice since at this time Cleveland had a large number of Hungarian immigrants.\nEncyclopaedia Britannica\nrecords:-\nBy\n1920\nlarge numbers of Italians, Poles, Hungarians, Russians, and other groups had come to Cleveland ...\n[\nwhich\n]\nbecame Ohio's most ethnically diverse city. ... The city's culture eventually was enriched by some\n50\ngroups with different languages and backgrounds. Many new Roman Catholic and Eastern Orthodox churches, as well as synagogues, were built.\nVarga writes\n[\n8\n]\n:-\nMy father was an expert tool and die maker, having learned his trade in Hungary, and my mother was an expert in passementerie\n[\nfancy edging or trimming on clothing or upholstery\n]\nsewing, and she also worked as a secretary at a local Hungarian newspaper\n(\nSzabadság\n)\n.\nLet us note that\nSzabadság = Liberty\nwas \"An American newspaper in the Hungarian language.\" It was published in Cleveland, Ohio by E T Kohányi from\n1910\nonwards.\nNow Varga's father knew from experience that working with tools was a dirty job and he wanted his son to have a better and cleaner life. He felt that a draftsman would be an ideal trade and Richard was educated with this profession in mind. However, his mother also hoped that one day her son might attend college, so this route was also kept open to him in his schooling in Cleveland. He attended West Technical High School in Cleveland where, to satisfy both parent's hopes and desires, he majored in drafting but also took courses to prepare him for admission to a college. Continuing to follow the same path, he entered Case Institute of Technology in Cleveland with the intention of majoring in mechanical engineering. The Case School of Applied Science, founded in\n1880\n, was renamed the Case Institute of Technology in\n1947\n, about the time Varga entered it, and became part of Case Western Reserve University in\n1967\n. In his second year the Case Institute of Technology introduced a mathematics degree and, having already realised that this was his favourite subject, Varga changed to major in mathematics. He found time for sport as well as studying and was a member of the college wrestling team. He obtained his B.S. in mathematics in June\n1950\nand then received some excellent advice\n[\n8\n]\n:-\n... an older professor at Case, Professor Max Morris, asked me what I planned to do. I said that I was to take a job in Cedar Rapids, Iowa, as an actuary.\n(\nI had taken courses in statistics and\nprobability\n.\n)\nHe said to me, \"I have had you as a student in several classes, and I think you should apply to Harvard University for graduate work in mathematics. It's too late now to get any financial assistance from Harvard, but if you can borrow money from your father for the first year of graduate work at Harvard, I am quite sure that you will receive scholarships and financial support for the remaining years of your studies.\" Then, he looked at me, smiling, and said, \"Bet on yourself!\" Following his advice, I applied in late July,\n1950\n, and was accepted for graduate work in September in mathematics at Harvard University\nVarga explains in\n[\n8\n]\nthat his father was not at all happy to lend him money to continue with his education since he had already spent sixteen years at his studies. However, he had his mother to support him and she persuaded his father to lend him $\n1\n,\n500\nto fund his first year of graduate studies. He completed his Master's Degree in this first year and was awarded an A.M. in June\n1951\n. Also in\n1951\nhe married Esther Marie Pfister; they had one daughter. He continued to undertake research at Harvard with\nJoseph Leonard Walsh\nas his thesis advisor. He was also influenced by\nGarrett Birkhoff\nand, after Varga completed his doctorate, they collaborated on a number of research projects which led to a number of joint publications. For his doctoral studies, Varga studied approximation theory for complex analytic functions being awarded a Ph.D. in June\n1954\nfor his thesis\nProperties of a Special Set of Entire Functions and Their Respective Partial Sums\n. Varga explained in\n[\n8\n]\nhow he came to spend six years for working at the Bettis Atomic Power Laboratory in Pittsburgh:-\nOn finishing at Harvard, I received teaching offers from several colleges in the Cleveland area, but the Korean war was on, and, being\n1\nA in the draft, I fully expected to be drafted into the Army after taking such a teaching position. But, by chance, a mathematician, Henry L Garabedian\n(\nwho had been a professor of mathematics at Northwestern\n)\n, had taken a job with the Bettis Atomic Power Laboratory in Pittsburgh, and he came to Harvard to recruit people to Bettis, to work on problems related to nuclear reactors; the government deemed such work as \"essential\". He was absolutely convincing on how exciting it was, working hand-in-hand with engineers, physicists, and the newly emerging \"computers\". I took the chance and joined the staff at Bettis in June,\n1954\n, immediately after getting my Ph.D., and it was a truly exciting experience for me! The problems to be solved on the computers were two- and three-dimensional multigroup diffusion equations, used to design nuclear reactors for submarines, and aircraft carriers, for example, as well as large land-based electric power generators.\nWe mentioned above Varga's joint work with\nGarrett Birkhoff\nwhom he first got to know at Harvard. In fact\nBirkhoff\nworked as a consultant for Bettis so this provided the opportunity for their collaboration. Their joint papers include:\nReactor criticality and non-negative matrices\n(1958)\n,\nImplicit alternating direction methods\n(1959)\n, and\nDiscretization errors for well-set Cauchy problems\n(1965)\n. We note that, of course, Varga was undertaking research relevant to nuclear reactors, but we also note that he had changed from being an analyst interested in complex variable to a numerical analyst handling applied mathematical problems. By the time the third of the above mentioned joint papers was written, Varga was no longer working for Bettis for, in\n1960\n, he accepted the position of Professor of Mathematics at Case Institute of Technology. In\n1969\nhe moved to Kent, Ohio, when he was appointed at Kent State as Professor of Mathematics. The year after he arrived was a difficult one at Kent State University for in May\n1970\nfour students who were protesting against the Vietnam War on the University campus were shot dead by the Ohio National Guard. At Kent State, Varga was Director of the Institute for Numerical Mathematics from\n1980\nto\n1988\n, and from\n1988\nto\n2006\nhe was Research Director. In\n2006\nhe retired from teaching and was named Professor Emeritus.\nLet us look at some of the books that Varga has published. They are\nMatrix iterative analysis\n(1962)\n,\nFunctional analysis and approximation theory in numerical analysis\n(1971)\n,\nTopics in polynomial and rational interpolation and approximation\n(1982)\n,\n(\nwith Albert Edrei and Edward B Saff\n)\nZeros of sections of power series\n(1983)\n,\nScientific computation on mathematical problems and conjectures\n(1990)\n, and\nGerschgorin and his circles\n(2004)\n. We give some extracts from reviews of these works, beginning with\nMatrix iterative analysis\nquoting from J H Bramble\n[\n3\n]\n:-\nProfessor Varga's book is very clearly written and contains a large amount of quite recent material. ... 'Matrix Iterative Analysis' belongs in the personal library of every numerical analyst interested in either the practical or theoretical aspects of the numerical solution of partial differential equations.\nA O Garder writes:-\nThe iterative procedures for solving finite-difference approximations to second-order partial differential equations of elliptic and parabolic types have been described in many places. This book is the first comprehensive treatment of these procedures which is mathematically rigorous. ... The book is well and clearly written, has an extensive bibliography, and is supplied with numerous problems. It should become a standard text in advanced numerical analysis courses.\nGene Golub, reviewing the second edition, explains that the\n1962\nedition\n[\n7\n]\n:-\n... became an instantaneous \"classic.\" It was important because it brought together relevant elements of matrix theory and numerical analysis. The book also developed results that were not easy to find in other sources.\nReviewing\nFunctional analysis and approximation theory in numerical analysis\n, J Burlak writes:-\nThis book is based on lectures given at Boston University in July\n1970\nand is dedicated to the sixtieth birthday of\nGarrett Birkhoff\n. Its centre of gravity coincides with that of the title: this is a book on approximation theory. However, the title should prepare the reader for a modern treatment\n(\nthoroughly imbedded in functional analysis\n)\n, for the subject not to be regarded merely as an end in itself\n(\nthe numerical solution of elliptic and parabolic boundary value problems is the author's eventual target\n)\nand for theoretical depth\n(\nthere are no details of explicit numerical procedures\n)\n.\nCharles K Chui writes in a review of\nTopics in polynomial and rational interpolation and approximation\n:-\nSeveral interesting topics on approximation and interpolation by polynomials and rational functions that fall in the area of complex analysis are presented in these beautifully written lecture notes. In many cases numerical results and graphs are included to illustrate certain results and conjectures. It is interesting to see how numerical computation can help in sharpening ideas and stimulating research in working with problems of various topics in approximation theory.\nZeros of sections of power series\nis described by Walter Hengartner as a 'remarkable monograph' but perhaps the greatest praise is heaped on\nScientific computation on mathematical problems and conjectures\n. George Fix writes\n[\n5\n]\n:-\nLet me state at the outset that this monograph is a gem. It contains six completely independent chapters devoted to six different areas. The unifying theme is that all of the problems are drawn from classical analysis with a strong tilt toward approximation theory. The unique part of the monograph is how high-precision numerical calculations can play a creative role in this area. In fact, it is possibly fair to say that the monograph is a sequence of challenging and interesting problems, where both hard analysis and sophisticated computing techniques are brought to bear to develop rigorous proof of interesting conjectures, or in some cases, used to establish counterexamples.\nHerman te Riele writes:-\nThis book contains fascinating accounts of how some long-standing mathematical problems could be solved after an accumulation of efforts by many mathematicians and the use of highly accurate floating-point computations. At the same time it shows that there are still a lot of unsolved mathematical problems, the solution of which may require deep mathematics, but probably also fast computers and highly-accurate numerical software.\nVarga's most recent book,\nGerschgorin and his circles\n, was reviewed by L Elsner who writes\n[\n4\n]\n:-\nThe new book of Varga contains, along with several new results, nearly all that has been discovered about eigenvalue inclusions since\n1931\n. These results are perhaps not at the center of attention of mathematicians nowadays, but the book is interesting enough to merit thorough review and the recommendation to read and use it.\nVarga has received many honours including the Hans Schneider Prize from the International Linear Algebra Society:-\n... for research, contributions, and achievements at the highest level of Linear Algebra.\nThe Prize was awarded in\n2005\n. He has also received the President's Medal from Kent State University in\n1981\n, and the von Humboldt Prize in\n1982\n. The University of Karlsruhe awarded him an honorary degree in\n1991\n, and he received a similar honour from the University of Lille two years later.\nAs to Varga's interests outside mathematics we quote from\n[\n2\n]\n:-\nRichard Varga, however, is not only a great scientist but also a wonderful human being. He is even known to be a serious table tennis player, he is a former wrestler, he likes to repair his car by himself, and anybody who has heard him sing can tell you about his beautiful and powerful voice. His knowledge of languages and flair for telling jokes and anecdotes all contribute to make Richard Varga a very charming man, and he is always \"the life and soul of the party.\"",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Statistics"
  ]
}