{
  "nome_completo": "Richard Herbert Schelp",
  "nome_curto": "Richard Schelp",
  "ano_nascimento": "1936",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schelp/",
  "lugar_nascimento": "Kansas City, Missouri, USA",
  "lugar_morte": "Memphis, Tennessee, USA",
  "biografia": "Richard Schelp\n's parents were Herbert Schelp\n(1904\n-\n1969)\n, an assistant manager in a grain elevator company, and Ida Stuerke\n(1908\n-\n2008)\n. Herbert and Ida were married on\n15\nApril\n1928\nin the Holy Cross Lutheran Church in Emma, Lafayette County, Missouri. Herbert was the son of Friedrich Ludwig Schelp and Dorothea Christine Sophie Doris Haesemeyer. Ida was the daughter of Gustav Stuerke and Louise Friemann. Herbert and Ida Schelp adopted Carol and Richard was their only son. He was known to his friends and colleagues as Dick.\nSchelp did not follow the standard route to become a university professor doing research in graph theory and combinatorics. He studied at Sweet Springs High School, Sweet Springs, Missouri, from\n1950\nto\n1954\n. After graduating from the High School in\n1954\n, he attended the University of Central Missouri in Warrensburg where he studied mathematics and physics. He was awarded his B.S. in\n1959\nand he then went to Kansas State University, in Manhattan, Kansas, where he studied for his Master's Degree. He then was appointed as an associate mathematician and missile scientist in the Applied Science Laboratory at Johns Hopkins University. He held this position for five years during which time he married Billie Swopes and their children Lisa and Richard were born.\nAfter five years earning a good salary, and having a family to support, it was a courageous decision for Schelp to give it all up to begin studying for a Ph.D. at Kansas State University. During the four years he worked towards his doctorate, he also worked as an Instructor in Mathematics at Kansas State University. His thesis advisor was Richard Joseph Greechie who had obtained his Ph.D. from the University of Florida in\n1966\nwith a thesis on lattice theory. Greechie's thesis advisor had been\nDavid J Foulis\nand Schelp's first paper\nCoordinatization of orthocomplemented and orthomodular posets\n(1970)\n, written in collaboration with Stanley P Gudder, generalised\nFoulis\n's results that an orthomodular lattice can be coordinatised by a\nBaer\n*-semigroup. Schelp's\n114\n-page thesis,\nPartial Baer *-semigroups and partial Baer semigroups\n, earned his a Ph.D. in\n1970\n. In it he acknowledged the support of his thesis advisor:-\nThe author wishes to acknowledge the patience, interest, and confidence extended by his advisor, Professor Richard J Greechie, during the preparation of this dissertation.\nFollowing the award of his doctorate, Schelp was appointed as a professor in the Department of Mathematical Sciences at Memphis State University in\n1970\n[\n1\n]\n:-\nHe arrived the same year as three young colleagues: John Haddock, Jim Jamison and Cecil Rousseau. This group bonded quickly because of common backgrounds and similar professional interests, and their young families also became good friends. These young faculty members became key players in initiating significant changes that shaped the culture of the Department of Mathematical Sciences. They provided significant leadership as the research activity of the Department increased and a Ph.D. programme was initiated.\nRalph Faudree writes about joining Memphis State University in\n1971\n[\n2\n]\n:-\nI first met Dick in\n1971\n, when I interviewed for a faculty position at then Memphis State University. He was a warm individual who was very cordial and inviting. Upon my arrival at the University he invited me to join with him and Cecil Rousseau to consider research problems in graph theory. Dick was the initiator of this collaboration which resulted in an active research agenda in graph theory for forty years.\nSchelp wrote a number of papers with his colleagues over the following years including:\nA partial semigroup approach to partially ordered sets\n(1972)\n;\n(\nwith Ralph Faudree and Cecil Rousseau\n)\nTheory of path length distributions\n(1973)\n;\n(\nwith Ralph Faudree\n)\nA solved and unsolved graph coloring problem, by P Erdős\n(1973)\n;\n(\nwith Ralph Faudree\n)\nAll Ramsey numbers for cycles in graphs\n(1974)\n; and\n(\nwith Ralph Faudree\n)\nPath connected graphs\n(1974)\n. Ralph Faudree explains in\n[\n2\n]\nhow a collaboration between Schelp and\nPaul Erdős\ncame about:-\nOn the graph theory research front, things happened quickly for Dick. Interaction with\nPaul Erdős\nstarted in\n1972\nas a result of a solution of an\nErdős\n-Bondy problem on\nRamsey\nnumbers for cycles. He co-authored three graph theory papers that appeared in\n1973\n, which were the first of\n43\njoint papers with colleagues Rousseau and me. He attended the International Conference in Keszthely, Hungary, that year to celebrate the\n60\nth\nbirthday of\nPaul Erdős\n, and the next year\nErdős\nstarted his regular visits to the University. By\n1975\nDick's\nErdős\nnumber was\n1\nas a result of a four-author paper -\nErdős\n, Faudree, Rousseau, and Schelp - 'Generalized Ramsey Theory for Multiple Copies'. This was the first of\n42\npapers that he coauthored with\nPaul Erdős\n.\nPerhaps we should also note at this point that MathSciNet lists\n170\npublications for Schelp. It also lists\n59\nco-authors, and lists\n95\njoint publications of Schelp with Ralph J Faudree. Ron Gould describes many of Schelp's outstanding qualities in\n[\n2\n]\n. In particular he describes their first meeting:-\nMy first real introduction to Dick came at a Southeastern meeting in Baton Rouge in\n1981\n. Mike Jacobson and I were having coffee between talks and Dick came up to us and introduced himself. We both were well aware of who he was, and a bit amazed he knew or even cared who we were. After all, I was less than two years from my degree and Mike less than one, so we were not exactly well known at the time. Dick said he had recently read a paper Mike and I had written on\nRamsey\nnumbers and he really liked the work. He then made an offer that was to forever change the direction of my\n(\nand Mike's\n)\ncareer. Dick said he would love it if Mike and I could come to Memphis and work with him and Ralph Faudree. Well, it took a little time to arrange things, but that is exactly what we did and we have been visiting Memphis very regularly ever since. We were welcomed in Memphis more as friends then junior colleagues. It was clear that Dick loved to discuss ideas and to work with others. He was always happy to spend hours that way. There was no concern about who said what, just that the truth was finally revealed. The more time we spent together, the stronger our friendship became.\nAndrás Gyárfás, from Budapest, Hungary, explains how Schelp's kindness to him made him think of Memphis as a second home\n[\n2\n]\n:-\nMy second home is Memphis, Tennessee, where I accumulated a total of six years in several types of visiting positions. Dick Schelp played an important role in the process of getting to know the town and gradually consider it as my second hometown. He drove me from one residence to another to find the best place to rent, willingly made phone calls on my behalf\n(\na nightmare to most foreign visitors\n)\n, and gave a friendly loan to help give a smooth start to Memphis life for me and my family.\nAndrás Gyárfás also describes Schelp's approach to mathematics:-\nI can easily find a one-word description of his approach to mathematics. Enthusiasm is the word. Enthusiasm in talking about it, in trying to solve a maths problem, in appreciating others' solutions, in taking part of the whole process of ups and downs culminating in a solution.\nIn addition to his passion for mathematics, Schelp was a member of the Lutheran church and a Sunday School teacher. As a member of Christ the King Lutheran Church in Memphis he served as an elder, sang in the choir and was a member of the church's parochial school board. He was also a Stephen Minister, meaning that he was trained in giving high-quality, one-to-one Christian care to people going through hard times. But Schelp also had other interests as Ralph Faudree explains\n[\n2\n]\n:-\nDick was also an avid sports fan. The St Louis Cardinals in baseball and of course, the Memphis Tigers in basketball. Dick was a good judge of talent on the basketball court and he took the game very seriously. We had many long and interesting discussions, and many email exchanges, about sports and about college basketball in particular. Just another area we shared as friends. I knew Dick loved fast cars. But when he bought a Corvette he proved just how much he loved them. The Corvette was a source of even more laughs, as we always told Dick he was never in better shape; after all, he parked so far from other cars that he always had a long walk into work. He would just smile and come back with a line of his own.\nHe was honoured by being awarded the Board of Visitors Eminent Faculty Award at the University of Memphis in\n2001\n, the Distinguished Alumnus Award from the mathematics department of Kansas State University in\n2000\n, the College of Arts and Sciences Distinguished Research Award in the Natural and Mathematical Sciences in\n2000\n, and the College of Arts and Sciences Meritorious Faculty Award in\n1996\n. He was co-recipient of the University Distinguished Research Award in\n1978\n.",
  "math_areas": []
}