{
  "nome_completo": "Richard Alexander Robb",
  "nome_curto": "Richard Robb",
  "ano_nascimento": "1901",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robb/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Eaglesham, Renfrewshire, Scotland",
  "biografia": "Richard Robb\nattended Queen's Park School, Glasgow, completing his school studies in\n1918\n. He first matriculated at the University of Glasgow in October of the same year. In\n1919\nhe was awarded the Sir Walter Scott Bursary in Arts. He graduated M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1922\nand graduated B.Sc. in the following year, being awarded a distinction in mathematics and physics. He had been awarded the Euing Scholarship after his performance in the M.A. examinations and this meant that he worked for three years as an assistant to the Professor of Mathematics, at that time\nG A Gibson\n.\nA Commonwealth Fund Fellowship allowed Robb to study for a Master's Degree in astronomy at the University of Michigan from\n1926\nto\n1928\n. He returned to Glasgow where he was appointed as a Lecturer in Mathematics in\n1928\n. He spent time as a postgraduate student of astronomy at the University of Lund in Sweden, then in\n1936\nobtained a D.Sc. for a thesis entitled\nStudies in Stellar Statistics with particular reference to Type A stars\n.\nRobb held his lecturership in Mathematics until\n1944\nwhen, remaining at Glasgow University, he was appointed as Mitchell Lecturer in Statistics. In\n1948\nhe was promoted to Senior Lecturer in Statistics. He continued in that post until he retired in\n1966\n.\nIt was not only as a mathematician that Robb excelled for he was also a world class athlete. He won several Scottish sprint titles and competed in the Olympic Games held in Amsterdam in\n1928\nas a member of the British sprint team.\nRobb was a member of the\nEdinburgh Mathematical Society\n, joining in February\n1925\n. He was honoured by the Society by being elected as president for session\n1934\n-\n35\n. He was elected a fellow of the\nRoyal Astronomical Society\nin\n1931\n. He was also elected to the\nRoyal Society of Edinburgh\non\n4\nMarch\n1929\n, his proposers being\nThomas Murray MacRobert\n,\nJohn McWhan\n,\nDonald Neil McArthur\n,\nWilliam Arthur\n.\nAn obituary, written by\nRobert A Rankin\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1978\n, pages\n52\n-\n53\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "math_areas": [
    "Statistics"
  ]
}