{
  "nome_completo": "Robert Simpson Woodward",
  "nome_curto": "Robert Woodward",
  "ano_nascimento": "1849",
  "ano_morte": "1924",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Woodward/",
  "lugar_nascimento": "Rochester, Oakland County, Michigan, USA",
  "lugar_morte": "Washington, D.C., USA",
  "biografia": "Robert Woodward\n's parents were Lysander Woodward and Peninah A Simpson. Lysander Woodward, a gentleman farmer, married Peninah Simpson on\n11\nMay\n1843\nand they bought a large farm near the village of Rochester. In addition to running the farm, which he did using highly innovative scientific principles, Lysander held important offices in the local government of Oakland County. A leading figure in the local community, he was also president of the Oakland County Agricultural Society, and the first president of the Detroit and Bay City Railroad. Robert was brought up on his parents' farm and was quickly infected by his father's enthusiasm for applying science to agricultural methods. He attended Rochester Academy graduating in\n1868\n. Robert wanted to continue his education at university but his father was strongly opposed to such a course for his son. However, after much persuasion by Robert, his father relented and Robert was allowed to enter the University of Michigan in\n1868\nto study engineering.\nWoodward graduated with a C.E. from the University of Michigan in\n1872\n. During his undergraduate years he had spent each summer doing fieldwork with the United States Lake Survey. Clearly he enjoyed his summer work for, after graduating, he spent ten years\n(1872\n-\n1882)\nworking for the United States Lake Survey. His work consisted of using triangulation methods on the great lakes\n[\n3\n]\n:-\nThis gave him a most thorough training in primary triangulation, in latitude and longitude determinative work, in the testing of field instruments and field methods, and in the office adjustment of field observations by least-square methods.\nDuring these years he became interested in geology, in particular becoming interested in the shape of the earth, the tides, the atmosphere and in astronomical studies. During his time with the United States Lake Survey he married Martha Gretton Bond of Detroit in that city on\n1\nMarch in\n1876\n; they had three sons, Robert Simpson Woodward, Karl W Woodward, and William Lysander Woodward.\nIn\n1882\nhe was appointed to a post with the United States Transit of Venus Commission as an assistant astronomer. The aim of the Commission was to compute an accurate value for the solar parallax and they decided to have eight observing sites, four in the United States and four abroad.  Woodward went as an assistant to Asaph Hall, the discoverer of the satellites of Mars, to observe in San Antonio. The famous mathematical astronomer\nSimon Newcomb\nled the expedition to Wellington in South Africa to observe the transit from there\n[\n3\n]\n:-\n... each party took a number of photographs during the transit of Venus across the sun's disk. These photographs were deposited with the Naval Observatory, where they were carefully measured, and the data of measurement were used in computations to obtain a more nearly correct value of parallax than had hitherto been possible. An immense amount of labour was put into this task, but, as a result of improvements in methods along other lines, the parallax values thus derived were superseded before the final report was completed and it was accordingly not issued.\nWoodward was appointed as an astronomer to the United States Geological Survey in\n1884\n. He was soon made a geographer rather than astronomer but after a while was promoted to chief geographer eventually becoming head of the Division of Mathematics. He published papers such as:\nResults of some experiments made to determine the variations in length of certain bars at the temperature of melting ice\n(1883)\n,\nOn the form and position of the sea level: With special references to its dependence on superficial masses symmetrically disposed about a normal to the Earth's surface\n(1888)\n,\nOn the Form and Position of the Sea Level\n(1888)\n,\nLatitudes and Longitudes Of Certain Points in Missouri, Kansas, and New Mexico\n(1889)\n, and\nFormulas and Tables to facilitate the Construction and Use of Maps\n(1889)\n. As can be seen from these titles, part of Woodward's work consisted of computing latitudes and longitudes and using the data in making maps. The methods and tables he presented in his\n1889\npaper were of long lasting importance to the work of the Geological Survey. It is also clear from the above titles that part of his work involved the geology of the earth as a whole, particularly investigation problems concerning the sea level. His mathematical skills made him a particularly useful team member who was regularly approached by his colleagues when they ran into mathematical problems. For example the paper\nOn the form and position of the sea level\ncame about as a result of questions that Thomas Chrowder Chamberlin, head of the glacial division of the United States Geological Survey, had asked him concerning the area covered originally by Lake Bonneville, a prehistoric pluvial lake that covered much of North America's Great Basin region. Woodward set out to explain the difference in level of the shoreline round the edge compared to the shoreline on an island which had been in the centre of the lake\n[\n3\n]\n:-\nThis problem was one requiring for its solution mathematical work of the highest order and, in addition, the experience of the engineer, so to shape his formulas that they could be applied directly by the computer.\nNote that 'computer' here refers to a person, not a machine. In\n1889\nWoodward, as Vice-President of the American Association for the Advancement of Science, gave an address on a topic which was of great current interest. The problem concerned the age of the earth which\nLord Kelvin\nhad calculated by applying his theory on the cooling of a sphere to the earth. He had come up with an age between\n200\nand\n400\nmillion years, and age which conflicted with evidence from geologists. Woodward had reexamined the problem and gone onto it in considerably greater depth than\nLord Kelvin\n. His results are contained in a paper, but he gave an overview in his address to the American Association for the Advancement of Science. He discussed whether\nLord Kelvin\n's results were likely to be correct:-\nBut what are the probabilities? Having been at some pains to look into this matter, I feel bound to state that, although the hypothesis appears to be the best which can be formulated at present, the odds are against its correctness. Its weak links are the unverified assumptions of an initial uniform temperature and a constant diffusivity. Very likely these are approximations, but of what order we cannot decide. Furthermore, if we accept the hypothesis, the odds appear to be against the present attainment of trustworthy numerical results, since the data for calculations, obtained mostly from observations on continental areas, are far too meager to give satisfactory average values for the entire mass of the earth. In short, this phase of the case seems to stand where it did twenty years ago, when Huxley warned us that the perfection of our mathematical mill is no guarantee of the quality of the grist, adding that as the grandest mill will not extract wheat flour from peas-cods, so pages of formulas will not get a definite result from loose data.\nThe argument that\nLord Kelvin\n's results need not be correct certainly encouraged geologists. Of course, the reason that\nLord Kelvin\nand Woodward were both wrong with their estimates of the age of the earth was only realised later when it was understood that heating of the earth occurs due to radioactivity.\nIn\n1890\nWoodward resigned from the United States Geological Survey to take up a position with the United States Coast and Geodetic Survey. The Director of the Geological Survey regretted Woodward's resignation and gave a full assessment of his contributions. He began his remarks as follows:-\n... this Survey can ill afford to lose his rare ability for mathematical research. Since his first association with the Survey, in\n1884\n, he has not only supervised the computations made in connection with the triangulation and astronomic determinations, conducted the computation of a series of tables for the use of the Topographic Branch, and given aid to geologists having occasion to read their data by mathematical methods, but he also made important additions to geologic science by discussing and advancing, on several lines, the theories of terrestrial physics.\nIn his new post, Woodward developed triangulation methods of surveying which were less expensive and more accurate than those employed up to that time. For example he published\nGeodesy: On the measurement of the base lines at Holton, Indiana and at St Albans, West Virginia\n1891\nand\n1892\n(1893)\nwhich illustrates the type of work he was undertaking at this time. Also at this time he worked on his book\nSmithsonian geographical tables\nwhich he published in\n1894\n. In addition to the tables themselves, Woodward included a long preliminary discussion which contained useful formulas and a section on the theory of errors.\nIn\n1893\nWoodward was appointed Professor of Mechanics at Columbia University. On\n26\nNovember\n1894\nhe addressed the New York Academy of Sciences which the lecture\nAn historical survey of the science of mechanics\n. He was one of the two editors of\nHigher mathematics: a textbook for classical and engineering colleges\n(1896)\nto which he contributed an important chapter entitled\nProbability and theory of errors\n. From\n1899\nuntil\n1904\nhe was Professor of Mechanics and Mathematical Physics at Columbia. He spent\n12\nyears at Columbia during which\n[\n2\n]\n:-\n... he was remarkably successful both as teacher and as administrator. He had a most attractive, genial, and lovable personality, and his advice was being so constantly sought by students and members of the faculty, that he found it very difficult to pursue mathematical work to which he had looked forward.\nDuring his time in New York, Woodward was closely associated with the\nAmerican Mathematical Society\n. He was vice-president of the Society from\n1897\nto\n1898\nand president from\n1899\nto\n1900\n. Among his publications during his time at Columbia University we mention:\nThe century's progress in applied mathematics: Presidential address to the American Mathematical Society\n(1900)\n,\nMathematical Theories of the Earth\n(1900)\n,\nObservation and experiment: New York Academy of Sciences\n(1901)\n,\nMeasurement and calculation: Presidential address to the New York Academy of Sciences\n(1902)\n,\nThe Unity of Physical Science\n(1904)\n, and\nAcademic ideals:  Address at the opening of Columbia University\n(1904)\n. However, he also published several papers in the\nBulletin\nof the\nAmerican Mathematical Society\nsuch as:\nOn the cubic equation defining the Laplacian envelope of the earth's atmosphere\n(1897)\n,\nOn the integration of a system of simultaneous linear differential equations\n(1897)\n,\nOn the differential equation defining the Laplacian distribution of density, pressure, and acceleration of gravity in the earth\n(1898)\n,\nOn the mutual gravitational attraction of two bodies whose mass distributions are symmetrical with respect to the same axis\n(1898)\n, and\nAn elementary method of integrating certain linear differential equations\n(1900)\n.\nIn\n1904\nWoodward left New York to take up the post of president of the newly formed Carnegie Institute of Washington which had been set up with ten million dollars gifted by Andrew Carnegie to promote study and research. He became the second president of the Institute, taking up his post on\n13\nDecember\n1904\n.\nRaymond Archibald\n[\n2\n]\nwrites:-\nAt this critical period, his mature judgement and experience, his clarity of vision, common sense, enthusiasm, and geniality, led ... to the establishment on a firm foundation...\nAfter examining the science produced from the award of small grants by the Institute, he concluded that the best way to further science was for the Institute to concentrate on awarding large grants to fund major projects mainly by investigators employed by the Institution. One reason for moving support away from colleges and universities was his realisation that when the Institute made a grant to such an outside institution, the researchers in that institution lost grant income from internal sources. His policy was adopted and led to major advances by the Geophysical Laboratory and the Mount Wilson Observatory. The book\n[\n1\n]\ncontains a wealth of information about the conflicts Woodward had to overcome in his leadership of the Carnegie Institute. When World War I broke out in Europe, Woodward was greatly disturbed. As soon as the United States entered the war, Woodward offered the services of the Carnegie Institute for war work\n[\n2\n]\n:-\nThe war work of the Carnegie Institution covered many fields of activity, from the manufacture of optical glass to military intelligence work, and to it all Dr Woodward offered the most effective support. He himself was a member of the Naval Consulting Board, as one of the two representatives from the\nAmerican Mathematical Society\nto the board.\nWoodward received many honours in addition to those associated with the\nAmerican Mathematical Society\nquoted above. He was elected President of the\nNew York Academy of Sciences\n(1900\n-\n1902)\n, the Philosophical Society of Washington\n(1910)\n, the Literary Society of Washington\n(1913\n-\n1914)\n, and the Washington Academy of Sciences\n(1915)\n. He was elected to the\nNational Academy of Sciences\nin\n1896\nand served the Academy on its Council and as Chairman of many of its committees. He was awarded honorary degrees by the University of Michigan\n(1892\nand\n1912)\n, the University of Wisconsin\n(1904)\n, the University of Pennsylvania\n(1905)\n, Columbia, University\n(1905)\n, and Johns Hopkins University\n(1915)\n. He was an editor of\nScience\nfrom\n1884\nto\n1924\n, and of the\nAnnals of Mathematics\nfrom\n1888\nto\n1889\n.\nAs to Woodward's character, we quote from\n[\n2\n]\n:-\nWoodward possessed a simplicity and open friendliness of manner and character that endeared him to young and old alike. It was a privilege to know him, to feel his radiant enthusiasm, and to be uplifted by his hopeful outlook on this world and its many problems.\nIn\n1922\nWoodward, then\n72\nyears of age, looked at the current state of the United States. His thoughts were published in the\nNew York Times\n[\n5\n]\non\n19\nMarch\n1922\n. See\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Statistics"
  ]
}