{
  "nome_completo": "Robert Boyle",
  "nome_curto": "Robert Boyle",
  "ano_nascimento": "1627",
  "ano_morte": "1691",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boyle/",
  "lugar_nascimento": "Lismore, County Waterford, Ireland",
  "lugar_morte": "London, England",
  "biografia": "Robert Boyle\nwas born into a Protestant family. His father was Richard Boyle, Earl of Cork, who had left England in\n1588\nat the age of\n22\nand gone to Ireland. Appointed clerk of the council of Munster by Elizabeth I in\n1600\n, he bought Sir Walter Raleigh's estates in the counties of Cork, Waterford, and Tipperary two years later. Robert's mother, Catherine Fenton, was Richard Boyle's second wife, his first having died within a year of the birth of their first child. Robert was the seventh son\n(\nand fourteenth child\n)\nof his parents fifteen children\n(\ntwelve of the fifteen survived childhood\n)\n. Richard Boyle was in his\n60\ns and Catherine Boyle in her\n40\ns when Robert was born. Of his father Robert would later write\n[\n12\n]\n:-\nHe, by God's blessing on his prosperous industry, from very inconsiderable beginnings, built so plentiful and so eminent a fortune, that his prosperity has found many admirers, but few parallels.\nIndeed, Robert was fortunate to have the richest man in Great Britain for a father although, one would have to say, the Earl of Cork had acquired his fortune by somewhat dubious means. He was imprisoned in England on charges of embezzlement at one stage and later was fined heavily for possessing defective titles to some of his estates.\nThe Earl of Cork and his wife believed that the best upbringing for young children, up to the time they began their education, could be provided away from their parents. Robert was sent away to be brought up in the country while his father continued to aim for higher and higher political success. The Earl of Cork lived for four years in his town house in Dublin. He was appointed a lord high justice in\n1629\nand lord high treasurer in\n1631\n. However, during this time in Dublin Robert's mother died and some time after this Robert returned from his stay with his country nurse to rejoin his family.\nRobert was sent, together with one of his brothers, to study at Eton College in England in\n1635\n. At this time the school was becoming fashionable as a place where important people sent their sons. The headmaster was John Harrison and the two young Boyle brothers lived in the headmaster's house\n[\n10\n]\n:-\nBesides the strictly classical course of study then in vogue, the boys had private tutors in French, dancing, and music, for whom they paid extra fees.\nBoyle paid tribute to Harrison in\n[\n12\n]\nwhere he writes that Harrison gave him a:-\n... strong passion to acquire knowledge ...\nAt this stage of his time at Eton, Boyle's education was clearly going well. He was popular with both his headmaster and his fellow pupils. However, perhaps he had been given too much special attention by Harrison for, when Harrison retired, Boyle seemed unable to fit in with the educational discipline the new headmaster brought to the school. Realising that neither of his sons were progressing well at school under the new headmaster, the Earl of Cork took his sons away from the Eton in November\n1638\n. After this Boyle was tutored privately by one of his father's chaplains.\nAt the age of\n12\nBoyle was sent by his father, with one of his brothers, on a European tour. From Dieppe they travelled to Paris, then on to Lyon before reaching Geneva. In Geneva Boyle studied with a private tutor French, Latin,\nrhetoric\nand religion. He also spent time in the afternoons playing tennis and fencing. Perhaps most importantly of all he began to study mathematics and soon\n[\n12\n]\n:-\n... he grew very well acquainted with the most useful part of arithmetic, geometry, with its subordinates, the doctrine of the sphere, that of the globe, and fortification.\nIn\n1641\nBoyle learnt Italian in preparation for visiting there. In September of that year Boyle and his tutor were in Venice, then by the beginning of\n1642\nthey were in Florence.\nGalileo\ndied in his villa in Arcetri, near Florence, while Boyle was living in the city. He was much influenced by this event and he carefully studied\nGalileo\n's works. If any one event shaped Boyle's life and directed him towards science, then it was this. Of course his Protestant background, with an ingrained fear of Jesuits, contributed to his sympathy for\nGalileo\nand his treatment by the Roman Catholic Church. Boyle became a strong supporter of\nGalileo\n's philosophy and believed strongly from this time in the new approach to studying the world through mathematics and mechanics.\nBy May\n1642\nBoyle and his tutor were in Marseilles waiting for money from Boyle's father so that he could complete the journey home. This did not arrive, merely a letter from his father explaining that a rebellion in Munster was fully occupying his time and money. He did send £\n250\nto pay for Boyle's return, but the money never reached him. Boyle returned to Geneva where he seems to have lived mainly on his tutor's earnings, while his father continued to fight the Irish at Lismore Castle. King Charles I negotiated a cease-fire with the Catholic rebels fighting the Earl of Cork so that he might bring his troops back to England to help him in the civil war which had broken out. The Earl of Cork never got over Charles treating the Irish as equals and he died shortly after in September\n1643\n. Robert Boyle was still living in Geneva when his father died. In the summer of\n1644\nhe sold some jewellery and used the money that he was paid to finance his return trip to England.\nBack in England, Boyle lived for a while with his sister Katherine. She was thirteen years older than him and was a lady of some importance, married to Viscount Ranelagh. England was in a chaotic state, the civil war which had began in\n1642\nwas being fought between King Charles and the parliament. Charles had moved to Oxford while the parliament had formed a treaty with the Scots. In return for Scots military support they were promised the establishment of a Presbyterian church. Several battles in\n1644\nleft both King and parliament somewhat in disarray. Boyle had property in England, the manor of Stalbridge, left to him by his father but the situation in the country made things difficult. He wrote in a letter\n(\nsee for example\n[\n3\n]\n)\n:-\n[\nI\n]\ngot safe into England towards the middle of the year\n1644\n, where we found things in such a confusion, that although the manor of Stalbridge were by my father's decease descended unto me, yet it was near four months before I could get thither.\nIn fact although Boyle inspected his new home after four months, it was much longer before he was able to move in. This happened in March\n1646\nafter he had spent more time with his sister and made a return trip to France to repay his debts to his tutor who continued to live there. Although Boyle did not intend to spend long at Stalbridge, he remained there for around six years. He probably studied harder than he admits in a letter sent to his old tutor in France in October\n1646\n(\nsee for example\n[\n3\n]\n)\n:-\nAs for my studies, I have had the opportunity to prosecute them but by fits and snatches, as my leisure and my occasions would give me leave. Divers little essays, both in verse and prose, I have taken pains to scribble upon several subjects. ... The other humane studies I apply myself to, are natural philosophy, the mechanics and husbandry, according to the principles of our new philosophical college ...\nThis \"new philosophical college\" is also called by Boyle the \"Invisible College\" later in the letter. It is the society which would soon became the \"\nRoyal Society of London\n\" and it provided Boyle's only contact with the world of science while he lived a somewhat lonely life at Stalbridge. He would look forward to his visits to London where members of the College\n[\n3\n]\n:-\n.. do now and then honour me with their company.\nIt was discussions in the Invisible College which led to Boyle reading\nOughtred\n's\nClavis Mathematica\nas well as the works of\nMersenne\nand\nGassendi\n. Boyle had from the time of his visit to Italy favoured the ideas of\nCopernicus\nand he now held these views deeply, together with a deep belief in the\natomic theory\nof matter. In the Invisible College these views were considered to be those of the new natural philosophy.\nThis period was a difficult one for Boyle for he tried hard not to be forced to take sides in the civil war. His loyalties were somewhat divided, his father having been a staunch Royalist, his sister Katherine a staunch Parliamentarian. Basically he had little sympathy with either side, but the final outcome of the civil war turned out to his advantage. Charles I was defeated and executed but, in\n1650\n, Charles II landed in Scotland and tried to regain power. Cromwell, leading the parliamentary forces, defeated the Scots in\n1650\n, again in\n1651\n, and the Irish were also defeated by Cromwell in\n1652\n. Boyle went to Ireland in\n1652\nto look after his estates there. He ended up a very rich man when Cromwell apportioned Irish lands to the English colonists. From that time on he was able to devote himself entirely to science without the need to earn money. It should be noted, however, that Boyle was a very generous man with his money, and many around him benefited from this generosity.\nBoyle met John\nWilkins\n, the leader of the Invisible College, in London when he visited there in\n1653\n. At this time\nWilkins\nhad just been appointed as Warden of Wadham College in Oxford and he was planning to run the Invisible College from there. He strongly encouraged Boyle to join them in Oxford and invited him to live in the College. Boyle decided to go to Oxford but preferred not to accept\nWilkins\n' offer of accommodation, choosing instead to arrange his own rooms where he could carry out his scientific experiments. At Oxford he joined a group of forward looking scientists, including John\nWilkins\n, John\nWallis\nwho was the Savilian Professor of Geometry, Seth Ward who was the Savilian Professor of Astronomy, and Christopher\nWren\nwho would succeed Ward as Savilian Professor of Astronomy in\n1661\n. From\n1654\nBoyle lived in Oxford, although he never held any university post.\nHe made important contributions to physics and chemistry and is best known for Boyle's law\n(\nsometimes called Mariotte's Law\n)\ndescribing an ideal gas. Boyle's law appears in an appendix written in\n1662\nto his work\nNew Experiments Physio-Mechanicall, Touching the Spring of the Air and its Effects\n(1660)\n. The\n1660\ntext was the result of three years of experimenting with an air pump with the help of\nHooke\nwhom he employed as his assistant. The apparatus had been designed by\nHooke\nand using it Boyle had discovered a whole series of important facts. He had shown, among other things, that sound did not travel in a vacuum, he had proved that flame required air as did life, and he investigated the elastic properties of air.\nThe\n1662\nappendix did not only contain Boyle's law which relates volume and pressure in a gas, but it also contained a defence of Boyle's work on the vacuum which appeared in the main text. Many scientists, particularly\nHobbes\n, had argued that a vacuum could not exist and claimed that Boyle's results obtained with the vacuum pump must be the result of some as yet undiscovered force. Another book by Boyle in\n1666\nwas called\nHydrostatic paradoxes\n. It is\n[\n1\n]\n:-\n... both a penetrating critique of\nPascal\n's work on hydrostatics, full of acute observations upon\nPascal\n's experimental method, and a presentation of a series of important and ingenious experiments on fluid pressure.\nIn\nThe Sceptical Chemist\n(1661)\nBoyle argued against\nAristotle\n's view of the four elements of earth, air, fire and water. He argued that matter was composed of corpuscles which themselves were differently built up of different configurations of primary particles. Although many ideas in this work were taken over from\nDescartes\n, in one respect he fundamentally disagreed with him. Boyle's ideas that the primary particles move freely in fluids, less freely in solids, followed\nDescartes\n. However,\nDescartes\ndid not believe in a vacuum, rather he believed in an all pervading ether. Boyle had conducted many experiments which led him to believe in a vacuum and, having found no experimental evidence of the ether, to reject that idea. He did follow\nDescartes\nin his overall belief that the world was basically a complex system governed by a small number of simple mathematical laws.\nIn considering optics, in particular colour, Boyle was not so successful. He published\nExperiments and considerations touching colours\nin\n1664\nbut was quite prepared to acknowledge that\nHooke\n's work of\n1665\nwas superior and he completely acknowledged that\nNewton\n's ideas, published in\n1672\n, should replace his own.\nBoyle was a founding fellow of the\nRoyal Society\n. He published his results on the physical properties of air through this\nSociety\n. His work in chemistry was aimed at establishing it as a mathematical science based on a mechanistic theory of matter. It is for this reason that we have decided to include Boyle into this archive of mathematicians for, although he did not develop any mathematical ideas himself, he was one of the first to argue that all science should be developed as an application of mathematics. Although others before him had applied mathematics to physics, Boyle was one of the first to extend the application of mathematics to chemistry which he tried to develop as a science whose complex appearance was merely the result on simple mathematical laws applied to simple fundamental particles.\nIn\n1668\nBoyle left Oxford and went to live with his sister Lady Ranelagh in London. There he became a neighbour of\nBarrow\nbut seemed to have more common scientific interests with another neighbour Thomas Sydenham, a physician. In\n1669\nhis sister's husband died. Some however, were keen to find Boyle a wife.\nWallis\nfound someone whom he considered particularly suitable to be Boyle's wife and wrote to him saying:-\nIf I might be the happy instrument in making two so excellent persons happy in each other ... I do not know in what else I could more approve myself.\nBoyle seemed to have successfully avoided such attempts to marry him off. In June\n1670\nhe had a stroke which left him paralysed but slowly he recovered his health. He continued to work and to entertain at his London home. Visitors were so frequent that he had to restrict visits so that he had time to continue with his scientific researches, which he did with the help of many excellent assistants.\nIn\n1680\nhe declined the offer that he serve as President of the\nRoyal Society\n. He explained his reasons were religious in that he could not swear to necessary oaths. The religious side of Boyle is one which we have not mentioned in this biography, yet it was an important force in his life. Perhaps the reason it has not been necessary to mention his strong Christian faith earlier is that to Boyle there was no conflict with religion and a mechanistic world\n[\n1\n]\n:-\n... for him a God who could create a mechanical universe - who could create matter in motion, obeying certain laws out of which the universe as we know it could come into being in an orderly fashion - was far more to be admired and worshipped than a God who created a universe without scientific law.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}