{
  "nome_completo": "Robert Schatten",
  "nome_curto": "Robert Schatten",
  "ano_nascimento": "1911",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schatten/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "New York, USA",
  "biografia": "Robert Schatten\nreceived the Magister degree from John Casimir University in Lwów\n(\nnow Lviv, Ukraine\n)\nin\n1933\n. After emigrating to the United States, he enrolled in the graduate school of Columbia University, receiving an M.A. degree in\n1939\n. He continued his research under the direction of Francis J. Murray, and was awarded the Ph.D. degree in\n1942\n. He held a brief appointment as a lecturer in the College of Pharmacy at Columbia University in\n1942\nbefore joining the U.S. Army, in which he served from\n1942\nto\n1943\n. He suffered a broken back during training at Fort Benning, Georgia, and this injury gave him much pain for the rest of his life.\nIn the academic year\n1943\n-\n1944\n, he had an appointment as assistant professor at the University of Vermont. He then won a two-year appointment as a Fellow of the National Research Council, and divided his time during this period between the Institute for Advanced Study and Yale University. He collaborated during these years with\nJohn von Neumann\nand with Nelson Dunford. In\n1946\n, Schatten began a long association with\nthe University of Kansas, first as associate professor\n(1946\n-\n1952)\nand then as professor\n(1952\n-\n1961)\n. This tenure was interrupted by leaves in\n1950\nand in\n1952\n-\n1953\n, both of which he spent at the Institute for Advanced Study at Princeton.\nThe year\n1960\n-\n1961\nwas spent as a visiting professor at the University of Southern California, and in\n1961\n-\n1962\nhe served as professor at the State University of New York at Stony Brook. In\n1962\nhe became professor at\nHunter College, in New York where he remained until his death. During the years\n1964\n-\n1972\nhe was also a member of the doctoral faculty of the Graduate School of the City University of New York. At the time of his death he had no immediate survivors, all his known relatives in Poland having been killed during the war.\nTo his former students, Schatten will be remembered as a dedicated teacher who was genuinely concerned with the intellectual development of his students. They will certainly not forget his unique style of lecturing. He always spoke without a book or notes, and rarely used the blackboard. His lectures were extremely clear and well-organized; he never lost his way in complicated arguments. The pace was such that the students could\n(\nand were expected to\n)\ntake notes verbatim; if they did so, their notes would read like a polished book, except for some linguistic idiosyncracies such as, \"Given is a set...\". He left nothing to chance in his dictation; for example, he invariably ended an argument with \"This concludes the proof.\"\nSchatten had his own way of making abstract concepts memorable to his elementary classes. Who could forget what a\nsequence\nwas after hearing Schatten describe a long corridor, stretching as far as the eye could see, with hooks regularly spaced on the wall and numbered\n1\n,\n2\n,\n3\n, ...? \"Then,\" Schatten would say, \"I come along with a big bag of numbers over my shoulder, and hang one number on each hook.\" This of course was accompanied by suitable gestures for emphasis.\nSchatten had some eccentricities which endeared him to his friends. He hated noise, especially when it interrupted his sleep. In Lawrence, Kansas, he was seen early one morning in his garden, clad in pyjamas, trying to shoo away the grackles from a tree near his bedroom. Cars were also his bêtes noires: although he owned a car at one time, he never fully mastered the art of driving. He once got a nasty bruise from attempting to put his head out of the car window before lowering the glass. Bachelor life also presented various pitfalls such as having to contend with laundries that insisted on ironing his socks. He kept his unpublished mathematical researches in a bank's safe-deposit box.\nSchatten's principal mathematical achievement was that of initiating the study of\ntensor\nproducts of Banach spaces. The concepts of crossnorm, associate norm, greatest crossnorm, least crossnorm, and uniform crossnorm, all either originated with him or at least first received careful study in his papers. He was mainly interested in the applications of this subject to linear transformations on\nHilbert space\n. In this subject, the\nSchatten Classes\nperpetuate his name.",
  "math_areas": []
}