{
  "nome_completo": "Robert Pollock Gillespie",
  "nome_curto": "Robert Gillespie",
  "ano_nascimento": "1903",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gillespie/",
  "lugar_nascimento": "Johnstone, Renfrewshire, Scotland",
  "lugar_morte": "Edzell, Angus, Scotland",
  "biografia": "Robert Gillespie\n's mother was Jane Pollock, who came from a farming family, and his father was Thomas Gillespie who was a butcher in Johnstone. Robert was educated first at Johnstone Primary School and then at Johnstone High School. He left the High School in\n1917\nand entered Paisley Grammar School. He completed his school education in\n1920\nas dux of the Grammar School and entered the University of Glasgow having won a Patrick Bursary. He graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1923\n, then in the same year was awarded a B.Sc. in Mathematics, Natural Philosophy and Astronomy.\nHaving won a William Bryce Fellowship to undertake research, he spent three years\n1924\n-\n27\nat Cambridge with his studies directed by\nE W Hobson\n. Gillespie was appointed as an assistant in the department of Mathematics at Glasgow University in\n1929\nand three years later was awarded a Ph.D. from the University of Cambridge. He began to publish a series of important papers in the Cambridge Philosophical Society and in the\nProceedings\nof the\nEdinburgh Mathematical Society\n.\nAfter the start of World War II in\n1939\n, Gillespie served briefly on a part-time basis on Clyde River Patrol. He then joined the Royal Air Force and was stationed at Prestwick involved in Air Traffic Control over the North Atlantic. In\n1948\nhe was promoted to Senior Lecturer in Mathematics, a position he held until he retired in\n1969\n.\nRobert Gillespie was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1925\nwhen he was a research student at Cambridge, although the address he gave was that of his parents: Ashcot, Kilbarchan Road, Johnstone. He served twice as President of the Society, first in session\n1946\n-\n47\n, then again in session\n1967\n-\n68\n. He was elected to the\nRoyal Society of Edinburgh\non\n6\nMarch\n1933\n, his proposers being\nThomas Murray MacRobert\n,\nNeil McArthur\n,\nRichard Alexander Robb\n,\nWilliam Arthur\n.\nAn obituary, written by\nRobert A Rankin\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1978\n, pages\n31\n-\n32\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nIn this RSE obituary Gillespie's books\nIntegration\n(\nEdinburgh,\n1939)\nand\nPartial Differentiation\n(\nEdinburgh,\n1951)\n, both published in Oliver & Boyd's series of university mathematical texts, are mentioned. The contents of the first of these is as follows:-\nThe first four chapters are devoted to an elementary account of integration, no attempt being made to be rigorous. The following chapters penetrate deeper into the classic Riemannian theory of integration.\nContents: Introduction. Integration of elementary functions. Multiple integrals. Curvilinear and surface integrals. The\nRiemann\nintegral. Infinite integrals. The\nRiemann\ndouble integrals.\nRobert Gillespie was married to Maisie Bowman, the daughter of Professor A A Bowman. Their son Alastair Gillespie is a mathematician who has also been President of the\nEdinburgh Mathematical Society\n, serving in this capacity from\n2001\nto\n2003\n.",
  "math_areas": [
    "Calculus"
  ]
}