{
  "nome_completo": "Robert Palmer Dilworth",
  "nome_curto": "Robert Dilworth",
  "ano_nascimento": "1914",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dilworth/",
  "lugar_nascimento": "Hemet, California, USA",
  "lugar_morte": "California, USA",
  "biografia": "Robert Dilworth\n(\nknown as Bob to his friends and colleagues\n)\nwas brought up on a ranch in California at the foot of the San Jacinto Mountains. This gave him a love of the outdoors which he kept throughout his life. He studied for his Bachelor of Science degree at the California Institute of Technology. Caltech was to play a very important role in Dilworth's life, for it was the Institution that he was associated with for almost the whole of his career. He received his B.S. degree in\n1936\nand remained at Caltech to undertake postgraduate work for his doctorate.\nAt Caltech, Dilworth's doctoral studies were supervised by Morgan Ward. Ward had himself been a student of\nE T Bell\nand\nBell\nwas still on the Faculty at Caltech at this time. Like\nBell\n, Ward was someone who valued all aspects of mathematics. He was as interested in teaching elementary mathematics as he was in the latest research problem on which he was working. His ideas of what constituted \"a mathematician\" rubbed off on Dilworth, as Chase relates in\n[\n3\n]\n:-\nProfessor Ward helped instil in Professor Dilworth his profound respect for the teaching of mathematics, at all levels, even very elementary levels.\nDilworth obtained his doctorate in\n1939\nand was then awarded a Sterling Research fellowship to study at Yale. He held this Fellowship at Yale during the academic year\n1939\n-\n40\nand he was then appointed as an Instructor there. Dilworth married Miriam White on\n23\nDecember\n1940\nafter taking up the Instructor appointment. He held this position from\n1940\nuntil\n1943\nwhen he returned to Caltech as Assistant Professor of Mathematics. At this point Dilworth was back at Caltech and he was to remain there for the rest of his career.\nOf course\n1943\nwas in the middle of World War II and Dilworth was involved in military service. In July\n1944\nhe became a member of an analysis unit at the\n8\nth\nAir Force headquarters at Brampton Park in England. Dilworth wrote:-\nThis unit was to serve as a liaison between the main operational analysis unit located at the headquarters of the\n8\nth\nAir Force near London and the command of the\n1\nst  Air Division. ... In the spring of\n1945\n, in collaboration with the Division navigator, an elaborate experiment was carried out to evaluate the intrinsic accuracy of radar bombing. A special radar target placed in the Wash on the east coast of Britain was used in this exercise.\nBack at Caltech, Dilworth was promoted to Associate Professor in\n1945\nand then full Professor in\n1950\n. He held this position for the rest of his career until he retired in\n1982\n.\nLet us now turn to Dilworth's research contributions. He worked in lattice theory and it would not be an exaggeration to say that he was one of the main factors in the subject moving from being merely a tool of other disciplines to an important subject in its own right. He began his studies in the\n1930\ns by reading the first contributions to lattice theory which were by\nDedekind\n. Dilworth himself remarked that although\nDedekind\n's papers were excellent introductions to the subject it was unclear what his motivation had been. By the time Dilworth began his research, the motivation behind much of lattice theory was to develop methods to attack problems in group theory. This is well explained by Dilworth himself writing in\n1959\n(\nsee\n[\n1\n]\n)\n:-\nThe theory of groups provided much of the motivation and many of the technical ideas in the early development of lattice theory. Indeed, it was the hope of many of the early researchers that lattice-theoretic methods would lead to the solution of some of the important problems in group theory. Two decades later, it seems to be a fair judgement that, while this hope has not been realised, lattice theory has provided a useful framework for the formulation of certain topics in the theory of groups ... and has produced some interesting and difficult group-theoretic problems ...\nDilworth then goes on to explain where the main thrust in developing lattice theory subsequently come from and one has to say that, although he modestly does not say so, he played the major role in this development himself:-\nOn the other hand, the fundamental problems of lattice theory have, for the most part, not come from this source but have arisen from attempts to answer the intrinsically natural questions concerning lattices and partially ordered sets; namely, questions concerning the decompositions, representations, imbedding, and free structure of such systems ... As the study of these basic questions has progressed, there has come into being a sizable body of technical ideas and methods which are peculiarly lattice-theoretic in nature. These conceptual tools are intimately related to the underlying order relation and are particularly appropriate for the study of general lattice structure.\nThe main topics in lattice theory to which Dilworth contributed are: Chain partitions in ordered sets, in particular his chain decomposition theorem for partially ordered sets; Uniquely complemented lattices; Lattices with unique irreducible decompositions; Modular and distributive lattices, in particular his covering theorem for modular lattices; Geometric and semimodular lattices; and Multiplicative lattices, where he studied, among other topics, abstract ideal theory, and the representation and embedding theorems for Noether lattices and\nr\nr\nr\n-lattices.\nOne important aspect of Dilworth's research was that he always attacked the big problems in lattice theory. He always had a stock of open problems in the subject which he used to direct his research and that of his students. For example in\n1959\nhe writes about the big problems of the subject\n[\n1\n]\n:-\n... the construction of a set of structure invariants for certain classes of Boolean algebras, the characterisation of the lattice of congruence relations of a lattice, the imbedding of finite lattices in finite partition lattices, the word problem for free modular lattices, and a construction of a dimension theory for continuous, non-complemented, modular lattices, have an intrinsic interest independent of the problems associated with other algebraic systems. Furthermore, these and other current problems are sufficiently difficult that imaginative and ingenious methods will be required in their solution.\nLet us now turn to Dilworth as a teacher. We have already mention the influence of his supervisor Morgan Ward on him. R Freese and J B Nation write\n(\nsee\n[\n1\n]\n)\n:-\nWhen\n[\nDilworth\n]\nlectured, he rarely used abbreviations and his handwriting was nearly perfect. Students had to write as fast as they could, using several abbreviations, to keep up with him. When he got stuck he would step back from the blackboard, stare at the problem and whistle \"Stars and Stripes Forever\".\nTeaching and examining mathematics played an important part in Dilworth's career. He was appointed to the College Board Advanced Mathematics Committee in\n1954\n. The task of this Committee was to set policy and administer the Advanced Mathematics Examination. Dilworth was Chairman of this Committee from\n1957\nto\n1961\n. He also became involved with a project to develop mathematics education in African countries. He was Director of the Testing and Evaluation group for this project from\n1962\nto\n1969\nand he described its role:-\nThe objective was to develop a core of mathematics educators in each of the participating countries who would be able to produce curriculum materials in mathematics which would be appropriate for the needs of each of the countries. During six summer sessions from\n1962\nto\n1968\nthe representatives of the African countries involved met with mathematics educators from the United States and Britain to develop specimen mathematics texts covering primary and secondary years. It was the responsibility of the Testing and Evaluation group to see that there were African personnel in each of the countries trained in modern testing methods by developing tests and other evaluative materials ...\nIn addition Dilworth served on numerous other bodies concerned with the teaching and examining of mathematics. For example the Board of Examiners in Mathematics, the School Mathematics Study Group Advisory Board, the Miller Mathematics Improvement Program, and several programs set up by the National Science Foundation.\nFinally we should say a little about Dilworth other than his mathematical interests. As a young man he was an exceptionally good athlete, competing in the decathlon. Later in life he complained that running was damaging his knees and he took up swimming which he did regularly. He kept himself very fit and\n[\n3\n]\n:-\nHe never dawdled, but always walked with a spring in his step, and got wherever he was going very fast.\nAnother of his interests was music and\n[\n2\n]\n:-\n... he often commented that if he were not accepted to CalTech, he would have made music his life. He loved playing Chopin on the piano late at night in total darkness. He insisted that it improved his mathematical abilities. He played several other instruments as well when necessary for the CalTech Orchestra; however the piano was his relief from the pressures of mathematics.\nCrawley\n[\n4\n]\nwrites:-\n... he was an electrifying teacher and colleague. And apart from his intellectual power as a mathematician, I think this was primarily a product of two traits: Bob Dilworth loved a challenge, and he was tenacious in confronting one; and he had great mathematical taste.\nBogart in\n[\n2\n]\nwrite that Dilworth:-\n... had a keen sense of humour and was known as a warm and approachable person.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}