{
  "nome_completo": "Robert Daniel Carmichael",
  "nome_curto": "Robert Carmichael",
  "ano_nascimento": "1879",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carmichael/",
  "lugar_nascimento": "Goodwater, Coosa County, Alabama, USA",
  "lugar_morte": "Merriam, Northeast Johnson County, Kansas, USA",
  "biografia": "Robert Carmichael\n's parents, Amanda Delight Lessley\n(1858\n-\n1945)\nand Daniel Monroe Carmichael\n(1848\n-\n1928)\n, were married on\n10\nJanuary\n1878\n. Amanda was the daughter of Robert Alexander Lessley\n(\nwhose parents were Irish\n)\nand Frances Elizabeth Thompson, while Daniel was the fifth child of Daniel Carmichael\n(\nwhose father was born in Argyllshire, Scotland\n)\nand Margaret Monroe\n(\nwhose father was also born in Scotland\n)\n. Robert was the oldest of his parents' ten children.\nCarmichael attended Lineville College in Lineville, Clay County, Alabama and graduated with an A.B. in\n1898\n. He married Eula Smith Narramore\n(1872\n-\n1953)\nfrom Randolph, Alabama, on\n24\nNovember\n1901\n; they had four children, Eunice Annie\n(\nborn\n1902)\n, Erdys Lucile\n(\nborn\n1904)\n, Gershom Narramore\n(\nborn\n1905)\n, and Robert Leslie. Carmichael trained as a Presbyterian Minister and was living in Hartselle, Alabama, in early\n1905\nwhen he began submitting problems to the\nAmerican Mathematical Monthly\n. He published a large number of problems over the next few years and also began publishing papers. For example, in\n1905\nand\n1906\nhe published the papers:\nSix Propositions on Prime Numbers\n(1905)\n;\nNote on multiply perfect numbers\n(1906)\n;\nMultiply perfect numbers of three different primes\n(1906)\n;\nMultiply Perfect Odd Numbers with Three Prime Factors\n(1906)\n;\nOn the n-Section of an Angle\n(1906)\n; and\nNote on the Maximum Indicator of Certain Odd Numbers\n(1906)\n. He moved to Anniston, Alabama, when he was appointed professor of mathematics at the Presbyterian College for Men at Anniston, Alabama in October\n1906\n.\nHe taught for three years at the Presbyterian College in Anniston and by\n1909\nhe had around\n170\npublications in the\nAmerican Mathematical Monthly\n, mostly problems and solutions to problems, as well as\n13\npapers in the\nAnnals of Mathematics\nand the\nBulletin of the American Mathematical Society\n. Leaving Anniston in\n1909\n, he went to Princeton supported by a fellowship. There he undertook research with\nG D Birkhoff\nas his thesis advisor and in\n1910\nhe was awarded the prestigious Porter Ogden Jacobus Fellowship, Princeton's highest academic award given to the top ranking graduate student in their final year. He was awarded a Ph.D. in\n1911\nfor his thesis\nLinear Difference Equations and their Analytic Solutions Linear Difference Equations and their Analytic Solutions\n.\nFollowing the award of his doctorate, Carmichael was appointed as an Assistant Professor of Mathematics at Indiana University. There he was the thesis advisor to Cora Barbara Hennel who was awarded a Ph.D. by Indiana University for her thesis\nTransformations and Invariants Connected with Linear Homogeneous Difference Equations and Other Functional Equations\nin\n1912\n. Carmichael was promoted to Associate Professor at Indiana in\n1912\nand in the autumn of that year he delivered a short course on the theory of relativity. He published\nOn the Theory of Relativity: Analysis of the Postulates\nin the\nPhysical Review\nin September\n1912\n. He begins the article:-\nThis analysis of the postulates of relativity was undertaken in order to ascertain on just which of the postulates certain fundamental conclusions of the theory depend. A moment's reflection will convince one of the importance of such an analysis. Some of the conclusions of relativity have been attacked by those who admit just the parts of the postulates from which the conclusions objected to can be derived by purely logical processes. In this paper I have sought to establish some of the most fundamental and most readily accessible conclusions of the theory on the smallest possible foundation from the postulates.\nIn November\n1912\nhe submitted another article\nOn the Theory of Relativity: Philosophical Aspects\nto the\nPhysical Review\nwhich was published in March\n1913\n. His Introduction begins:-\nThose who look on physics from the outside not infrequently have the feeling that it has forgotten some of its philosophical foundations. And among physicists themselves this condition of their science has not entirely escaped notice. The physicist who, above all other men, has to deal with space and time has fallen into conventions concerning them of which he is often not aware. It may be true that these conventions are exactly the ones he should make. It is certain, however, that they should be made only by one who is fully conscious of their nature as conventions and not as absolute realities beyond the power of the investigator to modify.\nBased on these papers and his lecture course, Carmichael published a\n74\n-page book\nThe theory of relativity\nin\n1913\n. A review in\nThe Mathematical Gazette\nstates:-\nIt is now more than eight years since the theory of relativity was expounded by\nEinstein\n, and, although the literature of the subject is already considerable, this is practically the first presentation in book form which has been offered to English readers. The author is a mathematician, and has confined his exposition to what may be called the external aspects of the theory ... This simple and logical account will serve a useful purpose by showing what assumptions we are in the habit of making, and wherein these admit of modification without contradicting the evidence of our senses.\nOf course this work was on what is now called the special theory of relativity and after\nEinstein\npublished the general theory of relativity, Carmichael brought out a second edition of his book in\n1920\n. He wrote in the Preface:-\nThe theory of relativity has now reached its furthest conceivable generalisation in the direction of the covariance of the laws of nature under transformations of coordinates. The older theory of relativity remains valid as a special case of the general theory and may well serve as an introduction to its more far-reaching aspects. Accordingly, in the present\n(\nsecond\n)\nedition of this monograph, I have retained the older theory in precisely the same form as in the first edition, ... , and have added ... a compact account of the generalised theory.\nBetween the publication of the two editions, Carmichael published two further books:\nThe Theory of Numbers\n(1914)\nand\nDiophantine analysis\n(1915)\n. In a Preface to the first of these he wrote:-\nThe purpose of this little book is to give the reader a convenient introduction to the theory of numbers, one of the most extensive and most elegant disciplines in the whole body of mathematics. ... this book is made up from material used by me in lectures at Indiana University during the past two years; and the selection of matter, especially of exercises, has been based on the experience gained in this way.\nOne of these exercises is of particular note. Exercise\n8\nin Chapter\n2\nreads:\nShow that if the equation\nϕ\n(\nx\n)\n=\nn\n\\phi(x) = n\nϕ\n(\nx\n)\n=\nn\nhas one solution it always has a second solution,\nn\nn\nn\nbeing given and\nx\nx\nx\nbeing the unknown.\nHere\nϕ\n\\phi\nϕ\nis\nEuler\n's\nϕ\n\\phi\nϕ\n-function, so\nϕ\n(\nx\n)\n\\phi(x)\nϕ\n(\nx\n)\nis the number of positive integers not greater than\nx\nx\nx\nand coprime to\nx\nx\nx\n. In fact the 'proof' Carmichael had of this result appeared in the paper\nOn Euler's φ-function\nthat he published in\n1907\n. However, the 'proof' is false as he realised himself and published what had now become a conjecture in\nNote on Euler's φ-function\n(1922)\n. In the same paper he showed that any counterexample\nx\nx\nx\nhad to be greater than\n1\n0\n37\n10^{37}\n1\n0\n3\n7\n. Whether the conjecture is true is still an open question, now known as Carmichael's conjecture, despite considerable efforts being made by many mathematicians. It has been shown, using a computer, that if\nx\nx\nx\nis a counterexample to the conjecture, then\nx\n>\n1\n0\n10000000\nx > 10^{10000000}\nx\n>\n1\n0\n1\n0\n0\n0\n0\n0\n0\n0\n; see\n[\n6\n]\nfor details.\nReturning to Carmichael's books, in a review of the above mentioned\nDiophantine analysis\n,\nDerrick Norman Lehmer\nwrites:-\nThe book will serve a valuable end in stimulating interest in this delightful branch of mathematics. There are many interesting and suggestive problems at the end of each chapter, some of which are excellent material for further research.\nIn\n1915\nCarmichael left Indiana University. He taught at the University of Chicago Summer School in\n1915\n, then took up an appointment as an Assistant Professor of Mathematics at the University of Illinois in the autumn of that year. He already appears in that role on the title page of\nDiophantine analysis\n(1915)\n. He was promoted to Associate Professor of Mathematics in\n1918\nand to full Professor in\n1920\n. He served as Head of Department from\n1929\nto\n1934\n, and as acting Dean of the Graduate School in\n1933\n-\n34\n. He was elected Dean of the Graduate School in\n1934\nand served in this role until he retired in\n1947\nwhen he was named Dean Emeritus.\nWe have already mentioned several of the outstanding books written by Carmichael. Let us now look briefly at some of the books he published later in his career. In May\n1926\na debate on the theory of relativity was held at Indiana University and Carmichael both participated in the debate and edited the resulting volume\nA Debate on the Theory of Relativity\n(1927)\n. In his opening address at the debate Carmichael said that a theory:-\n... must be in suitable agreement with the facts of nature, it must have those aesthetic qualities which render it pleasing to the human spirit, and it must furnish what is to us the most agreeable theory from the point of view of convenience.\nAlso in\n1927\n, in collaboration with James Henry Weaver\n(1883\n-\n1942)\n, Carmichael published\nThe Calculus\n. A revised edition, with Lincoln La Paz as an additional author, was published in\n1937\n. In\n1930\nCarmichael, in collaboration with Edwin R Smith, published\nPlane and Spherical Trigonometry\nbased on lectures the authors had given. They begin the Preface with the words:-\nThere is very little room for novelty in preparing a textbook for an introductory course in trigonometry. The material and methods are fairly well standardised.\nAlso in\n1930\n, Carmichael published\nThe Logic of Discovery\n. Fred Perkins writes\n[\n5\n]\n:-\nThe book is written in a very readable style and is heartily recommended to anyone who is anxious to become familiar with the interrelations of mathematics, the physical and social sciences, and philosophy.\nReviewing the same work, H T Davis writes\n[\n2\n]\n:-\nOnly at rare intervals does there appear a book devoted to the discussion of problems in epistemology which is thoroughly lucid. At one place or another undefinables are introduced into the discussion and the meaning is then lost in a confusion of words. The book under review therefore is especially noteworthy in the fact that it belongs to that limited class of philosophical essays which defines its terms, states its postulates, and then proceeds to the development of its theme with an inevitable logic. A reader is thus privileged to disagree with the conclusions, not from any feeling of insecurity derived from semantic uncertainties, but only from unwillingness to grant the initial premises. One thus derives unusual satisfaction in the perusal of Professor Carmichael's book since one is never on a single page uncertain as to the meaning of the author.\nIn\n1931\nMathematical Tables and Formulas\n, compiled by Carmichael and Edwin Smith, appeared. It contains five-place tables of logarithms of numbers, of logarithms of trigonometric functions, and of natural functions. Finally, let us mention another outstanding text by Carmichael\nIntroduction to the Theory of Groups of Finite Order\n. In it he aimed to give:-\n... an exposition which first of all prepares\n[\nthe reader\n]\nfor the development of the theory and then rapidly introduces him to a few fundamental theorems by which the construction of a large part of the theory may be effected.\nL W Griffiths writes in a review\n[\n3\n]\n:-\nThe outstanding merit of the book, in the reviewer's opinion, is the presentation, with great clarity and in less than one hundred pages, of the five fundamental theorems on finite groups and the fundamental results on isomorphism of finite groups.\nThe reader of this biography may have heard of Carmichael only because of the Carmichael numbers, and have wondered why they have not yet been mentioned. We have left them until now to, in some sense, give them pride of place.\nFermat\nhad proved that if\nn\nn\nn\nis prime then\nx\nn\n−\n1\n=\n1\nm\no\nd\nn\nx^{n-1} = 1 mod n\nx\nn\n−\n1\n=\n1\nm\no\nd\nn\nfor every\nx\nx\nx\ncoprime to\nn\nn\nn\n. A 'Carmichael number' is a non-prime\nn\nn\nn\nsatisfying this condition for any\nx\nx\nx\ncoprime to\nn\nn\nn\n. It was given this name since Carmichael discovered the first such number\n561\nin\n1910\n. For many years it was an open problem as to whether there were infinitely many Carmichael numbers, but this was settled in\n1994\nby W R Alford, A Granville, and C Pomerance in their paper\nThere are infinitely many Carmichael numbers\n.\nCarmichael was elected a fellow of the American Association for the Advancement of Science. The Association was divided into two Sections, namely Section A covering Mathematics, Astronomy, Physics, Chemistry and Mineralogy, and Section B covering Geology, Zoology, Botany and Anthropology. Carmichael was Vice President of Section A in\n1934\n. He also served the\nAmerican Mathematical Society\nbeing on the Council in\n1916\n-\n18\n,\n1920\n,\n1924\n, and\n1925\n-\n27\n. He was Vice President of the\nMathematical Association of America\nin\n1921\n-\n23\nand President in\n1923\n. He served on the National Research Council from\n1929\nto\n1932\n.\nIn addition to the very considerable mathematical output by Carmichael, he also served the mathematical community by undertaking editorial duties. He was Associative Editor of the\nAnnals of Mathematics\nduring\n1916\n-\n18\n, and of the\nAmerican Mathematical Monthly\nduring\n1916\n-\n17\n. He was editor-in-chief of the\nAmerican Mathematical Monthly\nin\n1918\n. He also served as Editor of the\nTransactions of the American Mathematical Society\nfrom\n1931\nto\n1936\n.\nLet us end this biography by giving a quote from his friend Harrison E Cunningham:-\nOf unyielding integrity,\n[\nCarmichael\n]\nloved the truth and hated sham and pretense. His appreciation of the beautiful, the true, and the good is exceptional. His friendship is firm, his loyalty unbreakable. Those who know him are fortunate beyond words.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}