{
  "nome_completo": "Robert Richard Anstice",
  "nome_curto": "Robert Anstice",
  "ano_nascimento": "1813",
  "ano_morte": "1853",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anstice/",
  "lugar_nascimento": "Madeley, Shropshire, England",
  "lugar_morte": "Wigginton (near Tring), Hertfordshire, England",
  "biografia": "Robert Anstice\n's parents were William and Penelope Anstice. William Anstice ran an ironworks and this family business was eventually taken over by the eldest of the Anstice's four sons who was named William after his father. The second son of the family, Joseph, attended Westminster School and then studied at Christ Church, Oxford before becoming professor of Classical Literature at King's College London when he was only\n22\nyears old.\nRobert Anstice was the fourth and youngest of William and Penelope Anstice's sons. He took the same educational route as his older brother Joseph, attending Westminster School before entering Christ Church, Oxford in\n1831\n. There he studied mathematics, graduating with a BA with first class honours in\n1835\nand an MA in\n1837\n.\nWe know that Anstice was awarded a scholarship to study mathematics after graduating at Oxford but there is then a rather strange gap in our knowledge of him for nothing is known of what he did over the following ten years. Clearly he decided to join the Church at some stage for the next event that we know of in his life was his ordination.\nAnstice was ordained in\n1846\nand the following year he became rector of Wigginton, near Tring, in the diocese of St Albans. He died after only six years as a Church of England parish minister, the parish records describing him as:-\na fine philosophical preacher, and greatly mourned when he died.\nAnstice died young, being only\n40\nyears old, but he did survive longer than his elder brother Joseph, who died at about the age of\n28\nyears, only six years after his appointment to the chair of Classical Literature at King's College London.\nRobert Anstice wrote three mathematical papers in his six years as rector in the parish of Wigginton. The first paper was\nOn the motion of a free pendulum\nbut the next two are the ones of real interest. They are both on combinatorics and they each have the same title namely\nOn a problem in combinations\n.\nThese two papers on combinatorics deal with\nKirkman\ntriple systems. The authors of\n[\n2\n]\nwrite:-\nDuring his time at Wigginton, Anstice became interested in the mathematical work of another rector,\nKirkman\n, who had written on the subject of\nSteiner\ntriple systems\n(\nas they are now called\n)\n. In one of his papers\nKirkman\ngave an elegant construction of a resolvable\nSteiner\ntriple system on\n15\nelements\n(\nthe famous Kirkman\n15\nschoolgirls problem\n)\n, making use of what are now known as a\nRoom\nsquare of order\n8\nand the\nFano\nplane.\nKirkman\nstated that the generalisation of this construction seemed very hard.\nAnstice achieved a brilliant generalisation to a resolvable\nSteiner\ntriple system on\n2\np\n+\n1\n2p + 1\n2\np\n+\n1\nelements for all\nprimes\np\np\np\ncongruent to\n1\nmodulo\n6\n. He gave infinite families of cyclic\nSteiner\ntriple systems\n40\nyears before\nNetto\n(\nwho did so in\n1893)\n. Anstice also constructed an infinite number of\nRoom\nsquares a hundred years before\nT G Room\nwrote his paper in which it was thought for many years that the squares first appeared and from which they were named. Perhaps even more remarkable is the fact that the method of differences which Anstice used has become one of the standard methods of design construction.\nAnstice also gave examples of\n2\n-rotational\nKirkman\ntriple systems which remained the only ones known until\n1971\n. His remarkable results seem to have been little noticed until the paper\n[\n1\n]\nby Anderson who summarised his paper as follows:-\nWe reveal the contents of two remarkable papers by R R Anstice, and thereby rewrite part of the early history of combinatorial designs. Infinite families of cyclic\nSteiner\ntriple systems and\nRoom\nsquares are constructed\n[\nin the papers\n]\n.\nAnstice, however, appears to have failed to realise the importance of his own work as he ends one paper with the comment:-\nBut too much space has been already devoted to such a trifle.\nHowever, as the authors of\n[\n2\n]\ncomment:-\n[\nAnstice\n]\nis buried beside his parents, almost forgotten by the mathematical community. He deserves greater recognition.",
  "math_areas": [
    "Combinatorics",
    "Number Theory"
  ]
}