{
  "nome_completo": "Robert Lee Moore",
  "nome_curto": "Robert Lee Moore",
  "ano_nascimento": "1882",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moore_Robert/",
  "lugar_nascimento": "Dallas, Texas, USA",
  "lugar_morte": "Austin, Texas, USA",
  "biografia": "Robert Lee Moore\n's father, Charles Jonathan Moore, owned a hardware store in Dallas. Originally from Connecticut, Charles had moved to the south of the United States during the civil war to fight on the side of the South. Robert Lee Moore's mother was Louisa Ann Moore and she did not need to change her name on marrying Charles since her maiden name was also Moore. Charles and Louisa had six children, with Robert being the second youngest in the family. Robert received a good education at a private high school in Dallas, and before he entered university he had learnt university level calculus by studying the university textbooks.\nHe entered the University of Texas in\n1898\nand there he took courses by\nHalsted\nand\nDickson\n. He graduated with a Sc.B. in\n1901\nand after a year as a teaching fellow at the University of Texas, Moore spent the academic year\n1902\n-\n03\nas a mathematics instructor at the High School in Marshall, Texas. In fact Moore would have remained at the University of Texas rather than spend the year teaching in a high school but, for some reason which is not clear, the university regents refused to renew his appointment despite strong protests from\nHalsted\n.\nHalsted\nhad suggested a problem in one of his classes which had led Moore to prove that one of\nHilbert\n's geometry axioms was redundant.\nEliakim Moore\n, who was the head of mathematics at Chicago University, heard of this contribution and, since his research interests at the time were precisely on the foundations of geometry,\nEliakim Moore\norganised the award of a scholarship that would allow Robert Moore to study for his doctorate in Chicago. We should note that despite the fact that\nEliakim Moore\nand Robert Moore shared the same surname and the same research interests, they were not related.\nVeblen\nsupervised Moore's Ph.D. at University of Chicago and the degree was awarded in\n1905\nfor a dissertation entitled\nSets of Metrical Hypotheses for Geometry\n.\nIt was while Moore was attending lectures in Chicago during this period that he first hit on his original teaching methods\n[\n5\n]\n:-\nWith his quick mind and restless spirit he found the lecture method rather boring - in fact, mind dulling. To liven up a lecture he would run a race with his professor by seeing if he could discover the proof of an announced theorem before the lecturer had finished his presentation. Quite frequently he won the race. But in any case, he felt that he was better off from having made the attempt.\nMoore spent the year\n1905\n-\n06\nas an assistant professor at the University of Tennessee, then two years as an instructor at Princeton University. In\n1908\nhe was appointed as an instructor at the Northwestern University and then, after three years there, he went to the University of Pennsylvania in\n1911\n. The year before, in\n1910\n, he had married Margaret MacLelland Key of Brenham, Texas; they had no children. After a promotion to assistant professor at the University of Pennsylvania in\n1916\n, he remained there for a further four years.\nIt was at the University of Pennsylvania that Moore first tried out his teaching methods in a Foundations of Geometry course he taught there. He began to have success with what became known as the Moore Method of teaching\n[\n5\n]\n:-\nHere was a fresh, relatively new area where Moore had himself tested the difficulty of some of the theorems.\nWe shall describe the Moore Method below.\nMoore was appointed to the staff at the University of Texas in\n1920\nas an associate professor, being made a full professor three years later. Moore was delighted to return to the University of Texas, his home university. By the time he was appointed in\n1920\nhe had published\n17\npapers on\npoint-set topology\n(\na term which he coined\n)\n. For his doctoral thesis Moore had worked on the foundations of\ntopology\n. In\n1915\nhe published\nOn a set of postulates which suffice to define a number-plane\npublished in the\nTransactions of the American Mathematical Society\n. Writing about this paper in\n1927\n, Chittenden wrote:-\nThe importance of the regularly and perfectly separable, therefore metric, spaces in the analysis of continua is indicated by the fact that nine years before the publication of the discoveries of\nUrysohn\n, R L Moore assumed these properties in the first of a system of axioms for the foundations of plane analysis situs.\nMoore wrote up his work on point-set topology in the important book\nFoundations of point set topology\npublished in\n1932\n. This volume, published in the Colloquium Lectures Series of the\nAmerican Mathematical Society\n, arose from the colloquium lectures which Moore gave in\n1929\nand is a self-contained introduction to the topic concentrating on Moore's own contributions to the subject.\nWe should comment on Moore's teaching methods, for their success influenced others to use similar methods. These methods are described by\nF Burton Jones\n, who himself was a student of Moore, and himself taught very successfully with a modified version, in\n[\n5\n]\n:-\nMoore would begin his graduate course in topology by carefully selecting the members of the class. If a student had already studied topology elsewhere or had read too much, he would exclude him\n(\nin some cases, he would run a separate class for such students\n)\n. The idea was to have a class as homogeneously ignorant\n(\ntopologically\n)\nas possible. He would usually caution the group not to read topology but simply to use their own ability. Plainly he wanted the competition to be as fair as possible, for competition was one of the driving forces. ...\nHaving selected the class he would tell them briefly his view of the axiomatic method: there were certain undefined terms\n(\ne.g., \"point\" and \"region\"\n)\nwhich had meaning restricted\n(\nor controlled\n)\nby the axioms\n(\ne.g., a region is a point set\n)\n. He would then state the axioms that the class was to start with ...\nAfter stating the axioms and giving motivating examples to illustrate their meaning he would then state some definitions and theorems. He simply read them from his book as the students copied them down. He would then instruct the class to find proofs of their own and also to construct examples to show that the hypotheses of the theorems could not be weakened,' omitted, or partially omitted.\nWhen the class returned for the next meeting he would call on some student to prove Theorem\n1\n. After he became familiar with the abilities of the class members, he would call on them in reverse order and in this way give the more unsuccessful students first chance when they did get a proof. He was not inflexible in this procedure but it was clear that he preferred it.\nWhen a student stated that he could prove Theorem x, he was asked to go to the blackboard and present his proof. Then the other students, especially those who had not been able to discover a proof, would make sure that the proof presented was correct and convincing. Moore sternly prevented heckling. This was seldom necessary because the whole atmosphere was one of a serious community effort to understand the argument.\nWhen a flaw appeared in a \"proof\" everyone would patiently wait for the student at the board to \"patch it up.\" If he could not, he would sit down. Moore would then ask the next student to try or if he thought the difficulty encountered was sufficiently interesting, he would save that theorem until next time and go on to the next unproved theorem\n(\nstarting again at the bottom of the class\n)\n.\nMary Ellen Rudin\n, who was also a student of Moore's presents a similar picture\n[\n3\n]\n:-\nHis way of teaching was to present you with things that had not yet been proved, and with all kinds of things which might turn out to have a counterexample, and sometimes unsolved problems - that is, unsolved by anyone, not only unsolved by you. So you had some idea of what it meant to be a mathematician - more than the average undergraduate does today.\nAlthough the Moore Method proved good for\nMary Ellen Rudin\n, she understood that it was not right for everyone:-\nI wouldn't for anything have let my children go to school with Moore! That is, I think that he was destructive to anyone who didn't fit exactly into his pattern, he did not succeed in giving the people that worked with him an education. It's a mistake to go to school under those circumstances in general.\nMoore taught at the University of Texas until he was\n86\nyears old, and he wished to carry on teaching but the University authorities forced him to retire. A number of students strongly supported his bid to remain in post but to no avail. The university authorities were not concerned at his abilities to teach, rather it was the great success of his methods which made his employers fear that bright young mathematicians might not wish to teach there due to his continuing dominating influence. In the picture above he is aged\n87\nand still in his office in Austin, Texas. The University of Texas did Moore a great honour, however, for in\n1973\nthey named a new physics, mathematics and astronomy building after him.\nA strong supporter of the\nAmerican Mathematical Society\n, Moore was an editor of the Colloquium Publications from\n1929\nto\n1936\n, being editor-in-chief from\n1930\nto\n1933\n. He was president of the\nAmerican Mathematical Society\nfrom\n1936\nto\n1938\n. He was elected to the\nNational Academy of Sciences\nin\n1931\n.\nFinally we should make some negative comments about his bigoted attitudes. The quotation below is from a personal communication from Chandler Davis which is based on:-\n... conversations and correspondence with my good friend E E Moise.\nChandler Davis writes:-\nR L Moore was firmly anti-black, refusing to teach any black students. He was pretty bigoted against women and Jews too, as many anecdotes attest. Two of his supervisees who went on to brilliant careers and who remained grateful for his teaching were, however,\nMary Ellen Rudin\nand E E Moise. Moore took quite some time, I am told, to adjust to working with a woman and with a Jew, but after he got used to it he treated them well.\n(\nMoise was of mixed background, but as he bore the name of his Jewish grandfather he was a Jew in Moore's eyes.\n)\nAs Chandler Davis suggests,\nMary Ellen Rudin\nwas certainly happy with Moore\n[\n3\n]\n:-\nHe encouraged people to believe in themselves as mathematicians because he felt that this was one of the principal tools for doing mathematics - to have confidence. ... I probably would not be a mathematician had I not worked with Moore.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}