{
  "nome_completo": "Robert Adrain",
  "nome_curto": "Robert Adrain",
  "ano_nascimento": "1775",
  "ano_morte": "1843",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adrain/",
  "lugar_nascimento": "Carrickfergus, Ireland",
  "lugar_morte": "New Brunswick, New Jersey, USA",
  "biografia": "The names of\nRobert Adrain\n's parents are unknown but we do know that his father was a schoolteacher and that he made mathematical instruments. When Adrain was about fifteen years of age both his parents died.\nAdrain received a good education but this education did not include any mathematics beyond arithmetic. His own curiosity, however, led him to study books on mathematics which explained algebraic notation and so he became essentially a self-taught mathematician. After his parents died, Adrain had to work to support both himself and his four brothers and sisters and it was entirely natural for this well educated young man to earn his living as a teacher. By\n1798\nAdrain, a young man of\n22\n, had established himself sufficiently well financially to allow him to marry Ann Pollock. They had seven children, one of whom, Garnett Bowditch Adrain, became a Democratic member of Congress.\nThe year\n1798\nwas crucial for Adrain in addition to being the year in which he married. He took part in the Irish rebellion of that year but, in order to understand what this was about, we should give some background to explain the political events which led up to this event that was to result in a complete change in Adrain's life.\nIrish politics was changed by the American Revolution partly since it led to government troops leaving Ireland, and a Protestant Irish volunteer corps established to defend the country from the French. In\n1782\nlegislative changes gave more power to the Irish Parliament and the position of Roman Catholics was greatly improved. This led to a Protestant backlash and an effect of the French Revolution was to see societies of United Irishmen founded which included both Protestants and middle-class Catholics. The Societies were driven underground and they looked for military support from France. From\n1796\nto\n1798\nFrance sent several naval expeditions to Ireland to support the Societies but all failed.\nThe United Irishmen provoked a rebellion in May\n1798\nand Adrain joined the rebels as an officer in their army. The rebellion was unsuccessful in general, but particularly so for Adrain who was shot in the back by one of his own men and badly wounded. After recovering his health Adrain escaped with his wife to the United States where they settled in Princeton, New Jersey.\nAdrain was appointed as a master at Princeton Academy and remained there until\n1800\nwhen the family moved to York in Pennsylvania. In York Adrain became Principal of York County Academy. When the first mathematics journal, the\nMathematical Correspondent\n, began publishing in\n1804\nunder the editorship of George Baron, Adrain became one of its main contributors. One year later, in\n1805\n, he moved again this time to Reading, also in Pennsylvania, where he was appointed Principal of the Academy.\nAfter arriving in Reading, Adrain continued to publish in the\nMathematical Correspondent\nand, in\n1807\n, he became editor of the journal. One has to understand that publishing a mathematics journal in the United States at this time was not an easy task since there were only two mathematicians capable of work of international standing in the whole country, namely Adrain and\nNathaniel Bowditch\n. Despite these problems, Adrain decided to try publishing his own mathematics journal after he had edited only one volume of the\nMathematical Correspondent\nand, in\n1808\n, he began editing his journal the\nAnalyst or Mathematical Museum\n.\nWith so few creative mathematicians in the United States the journal had little chance of success and indeed it ceased publication after only one year. After the journal ceased publication, Adrain was appointed professor of mathematics at Queen's College\n(\nnow Rutgers University\n)\nNew Brunswick where he worked from\n1809\nto\n1813\n. Despite Queen's College trying its best to keep him there, Adrain moved to Columbia College in New York in\n1813\n. He tried to restart his mathematical journal the\nAnalyst\nin\n1814\nbut only one part appeared. In\n1825\n, while he was still on the staff at Columbia College, Adrain made another attempt at publishing a mathematical journal. Realising that the\nAnalyst\nhad been too high powered for the mathematicians of the United States, he published the\nMathematical Diary\nin\n1825\n. This was a lower level publication which continued under the editorship of James Ryan when Adrain left Columbia College in\n1826\n.\nAdrain returned to Rutgers College\n(\nQueen's College was renamed Rutgers College in\n1825\nafter the philanthropist Henry Rutgers\n)\nin\n1826\n. However, leaving his family there, he accepted the post of Professor of Mathematics at the University of Pennsylvania in\n1827\n. In\n1828\nhe was appointed vice-provost of the University and he remained there until\n1834\n. However, he left the University of Pennsylvania having been asked to resign. As Hogan writes in\n[\n5\n]\n(\nsee also\n[\n4\n]\n)\n:-\nDuring his last year\n[\nat the University of Pennsylvania\n]\nAdrain had serious problems with discipline in his classes. Because the faculty saw no way to aid Adrain and feared that the disturbances would spread to other classes, the university asked for Adrain's resignation.\nTo understand why one of the finest mathematicians in the United States should have discipline problems in his classes we quote again from\n[\n5\n]\n(\nStruik in\n[\n1\n]\ngives essentially the same comments\n)\n:-\nAlthough a man of wit and humour, Adrain was often irritable in the classroom. One of his students reported that whenever a student faltered in his recitation\n(\nthen the principal form of classroom instruction\n)\n, Adrain would terminate his efforts with a remark such as \"If you cannot understand Euclid, dearie, I cannot explain it to you\".\nHaving tended his resignation as requested, Adrain returned to New Brunswick where he earned his living tutoring privately until\n1836\nwhen again he went to New York, teaching at the Grammar School attached to Columbia College. In\n1840\nhe retired and returned to New Brunswick where he spent the three years of his retirement before his death.\nDespite the resignation episode which resulted from Adrain's impatience in the classroom, he had a reputation for being patient and helpful at all other times. It is not uncommon for teachers to change character when they teach a class!\nAdrain's first papers in the\nMathematical Correspondent\nconcerned the steering of a ship and Diophantine algebra\n(\nthe study of\nrational\nsolutions to polynomial equations\n)\n. After publishing further work on Diophantine algebra, he published a paper on the normal law of errors in\n1808\n, one year before\nGauss\n.\nIt was in\n1808\nthat Robert Patterson proposed a surveying problem in the\nAnalyst\nand, after comments from\nBowditch\nsuggesting two procedures, Adrain gave an argument to establish the validity of the normal distribution for the errors, and he then used it to prove the validity of the method of least squares. Taking a number of problems as examples, Adrain showed that one of\nBowditch\n's procedures was equivalent to using the method of least squares. It is unfortunate that despite Adrain's priority over\nGauss\n, it is the latter who has received the credit for this important statistical contribution. See\n[\n3\n]\nfor more details.\nOther topics which Adrain wrote about include a study of the\ncatenary\n, and other curves which he called isotomous. In\n1818\nhe published a paper\nInvestigation of the figure of the Earth and of the gravity in different latitudes\n. In this paper Adrain gave\n1\n319\n\\large\\frac{1}{319}\\normalsize\n3\n1\n9\n1\n​\nas the ellipticity of the Earth, a figure better than that given by\nLaplace\n(\nhe gave\n1\n336\n\\large\\frac{1}{336}\\normalsize\n3\n3\n6\n1\n​\n)\n, and about halfway between\nLaplace\n's figure and the accepted value today of\n1\n297\n\\large\\frac{1}{297}\\normalsize\n2\n9\n7\n1\n​\n. Adrain's improvement on\nLaplace\n's value was, of course, made because Adrain had been inspired to work on the topic because of the contributions of\nLaplace\n.\nWe would know more about Adrain's work today but for an unfortunate incident concerning M J Babb of the University of Pennsylvania. Babb was working on Adrain's manuscripts at the time of his death in\n1945\nand it appears that both Babb's work and the manuscripts of Adrain on which he was working were inadvertently destroyed after his death.",
  "math_areas": [
    "Algebra",
    "Statistics"
  ]
}