{
  "nome_completo": "Robert Edgar Allardice",
  "nome_curto": "Robert Allardice",
  "ano_nascimento": "1862",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Allardice/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Robert Allardice\n's parents were Isabella Edgar Laing and John Allardice. He studied mathematics at the University of Edinburgh, where he first matriculated in\n1879\n, and was awarded an M.A. in\n1882\nhaving been placed as the top student in his year in mathematics. He continued to undertake research in mathematics at the University.\nIn\n1883\nAllardice was appointed as Assistant to the Professor of Mathematics at the University of Edinburgh, the professor being\nGeorge Chrystal\n. He remained in this post until\n1892\nwhen he was appointed Professor of Mathematics at Leland-Stanford Junior University, California, USA. The University, now known as Stanford University, was opened by the railroad magnate Leland Stanford and his wife, Jane Lathrop, in the year before Allardice took up his professorship there. He remained at Stanford University until he retired after which he continued to live in Palo Alto, California.\nAllardice was a founder member of the\nEdinburgh Mathematical Society\n, joining in February\n1883\n. He served on the committee of the Society from its foundation. He was Vice-President of the Society from\n1889\nto\n1890\n, President of the Society in session\n1890\n-\n91\n, and Editor of\nProceedings\nof the\nEdinburgh Mathematical Society\nin session\n1891\n-\n92\n, his final year in Edinburgh. He published around twenty papers in the\nProceedings\nof the\nEdinburgh Mathematical Society\nduring the first ten years of the Society. For example at the meeting held on Friday\n14\nMarch\n1884\nhe read a paper on the geometry of the spherical surface; at the meeting on Friday\n8\nJanuary\n1886\nhe discussed a problem of symmetry in an algebraical function; on\n11\nFebruary\n1887\nhe communicated a note on a theorem in algebra; on\n11\nJanuary\n1889\nhe contributed a note on a formula in\nquaternions\n; on\n13\nDecember\n1889\nhe discussed some theorems in the theory of numbers; on\n13\nNovember\n1891\nhis paper\nBarycentric Calculus of Möbius\nwas read by\nJohn Alison\n; on\n14\nDecember\n1901\nhis paper\nFour Circles Touching a Common Circle\nwas communicated to the meeting by Mr George Duthie; and on\n13\nJanuary\n1911\nhis paper\nOn the envelope of the directrices of a system of similar conics through three points\nwas communicated by E D Williamson.\nRobert Edgar Allardice was elected to the\nRoyal Society of Edinburgh\non\n16\nJanuary\n1888\n, his proposers being\nGeorge Chrystal\n,\nPeter Guthrie Tait\n,\nRobert M Ferguson\n,\nJohn Sturgeon Mackay\n.\nAn obituary, written by\nE M Horsburgh\n, appears in the\nProceedings\nof the\nRoyal Society of Edinburgh\nVolume\n48\n,\n1927\n-\n28\n,\n209\n-\n10\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}