{
  "nome_completo": "Robert Edward Bowen",
  "nome_curto": "Robert Edward Bowen",
  "ano_nascimento": "1947",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bowen/",
  "lugar_nascimento": "Vallejo, California, USA",
  "lugar_morte": "Santa Rosa, California, USA",
  "biografia": "Robert Edward Bowen\nwas known as\nRufus Bowen\nbecause of his red hair and beard. His parents were William Emery Bowen, known as Emery, and Marie Jane DeWinter. We begin by giving a little of their backgrounds. Emery Bowen was the son of Wilfred Farmer Bowen and Ethel Blanche Jane Emery who had both emigrated to the United States from Abergavenny in Wales and worked as cooks on the railways. Emery was brought up in Spokane, Washington, attending Franklin Elementary School and Lewis and Clark High School. He graduated with a diploma in Business Administration from Kinman Business University in February\n1931\n. He then worked as a civil service clerk in the National Park Service at Glacier National Park until\n1936\nwhen he took up a position with the United States Forest Service in Salmon, Idaho.\nMarie Jane DeWinter was the daughter of Adrian DeWinter and lived in Moscow, Idaho. She became a schoolteacher and met Emery Bowen while skiing. They were married on\n3\nJuly\n1939\nin Coeur d'Alene, Idaho. Marie had to leave her teaching job because she was married and the young pair set up home. With only one income, they were not well off and, in\n1941\n, Emery was able to get a better paid position as a civilian supply clerk with the United States Air Force at Gowan Field in Boise, Idaho. Later that year their first son, William, was born. In\n1944\n, with the United States at war, Emery joined the United States Navy and Marie, together with her son William, moved in with Emery's parents in Spokane. Marie got a job at the Naval Supply Base in Velox. In\n1946\n, after World War II had ended, Emery left the navy and returned to a civilian position with the United States Air Force, first at Fort Walla Walla, and then in January\n1947\nat Travis Air Force Base east of the city of Fairfield in California. The Bowen's second son Robert, the subject of this biography, was born one month later in Vallejo, California. Emery continued to work at Travis Air Force Base until he retired in\n1972\n.\nRobert attended elementary and high schools in Fairfield. His brilliance was evident when he was young and, after graduating from Armijo High School in\n1964\n, he entered the University of California at Berkeley. He had taken part in many school activities at Armijo High School playing basketball for the school team as well as being a member of the Mathematics Club, the Science Club and language clubs. He took part in the mathematics competition run by the\nMathematical Association of America\nfor his first three years at the school, coming\n102\nnd\n,\n7\nth\n, and\n2\nnd\nin these years among students in California. In\n1964\nhe took part in the Westinghouse Science Talent Search in Washington D.C. and he was ranked\n2\nnd\n.\nAt Berkeley he won prizes for his outstanding work while an undergraduate being an Individual Putnam Fellow in the\n25\nth\nPutnam Competition in\n1964\nand also a member of the University of California, Berkeley team which was placed fifth. Again in\n1965\nhe was an Individual Putnam Fellow in the\n26\nth\nPutnam Competition. He was awarded his bachelor's degree from Berkeley on\n15\nJune\n1967\n. At the graduation ceremony he was awarded the University Medal as the most distinguished graduating student, the Dorothea Klumpke Roberts Prize awarded to the top ranked mathematics student, and he received the Mathematics Department Citation. He continued to undertake research for his Ph.D. advised by\nStephen Smale\n. He had written his first mathematical paper at the age of seventeen while still at Armijo High School and, by the age of twenty-one, he had published five papers. He was twenty-one years old when he married Carol Twito on\n6\nMarch\n1968\n. Carol had been a pupil at Tennyson High School, Hayward, California, graduating\n1965\n. Rufus and Carol had no children.\nLet us look first at some of early papers by Bowen which were on graph theory. In\n1966\nhe published\nOn sums of valencies in planar graphs\nin the\nCanadian Mathematical Bulletin\n. This three page paper gives simple bounds\n(\nusing Euler's polyhedron formula\n)\nfor the number of edges in the sets obtained when the vertices of a planar graph are partitioned into two sets. In the following year he published two papers:\nThe generation of minimal triangle graphs\nand\nGenerations of triangulations of the sphere\n. In the first Bowen defines a type of graph, a minimal triangle graph\n(\nMTG\n)\n, obtained by putting together a number of triangles. He then gives all MTGs up to isomorphism with less than\n14\nvertices. These were generated using a computer program. The second paper, written jointly with Stephen Fisk, again uses a computer program to generate all the triangulations of the sphere with up to\n12\nvertices.\nAs we mentioned above, Bowen was awarded his bachelor's degree by the University of California at Berkeley in\n1967\nand obtained a doctorate there three years later in\n1970\n. It was at this time that he changed his first name from Robert to Rufus. From this point on his papers appear under the name Rufus Bowen while up to that time they had been published under the name Robert Bowen. In the year he was awarded his doctorate, he was appointed to the University of California at Berkeley becoming a full professor there in\n1977\n. Even before that he gave an invited address to the\n1974\nInternational Mathematical Congress in Vancouver, see\n[\n2\n]\nfor the text of his lecture.\nDynamical systems\ntheory had been started by\nHenri Poincaré\nin the\n1880\n's. Bowen's doctoral thesis\nTopological Entropy and Axiom A\n, supervised by\nStephen Smale\n, was on this topic and he continued to make major contributions to dynamical system theory, building on the work of\nPoincaré\nand\nWillard Gibbs\n. Bowen extended\nGibbs\n's work on invariant measures associated with dynamical systems. He developed methods in symbolic dynamics originally due to\nJacques Hadamard\nand\nMarston Morse\n.\nIn\n1975\nBowen published the book\nEquilibrium states and the ergodic theory of Anosov diffeomorphisms\nin the Springer Lecture Notes in Mathematics Series. Leonid A Bunimovic writes in a review:-\nThis book is devoted to studying the properties of continuous and smooth dynamical systems some of whose trajectories are asymptotically exponentially unstable. There are two fields of applications of\nergodic theory\nfor the exploration of continuous and smooth systems. First, it is used for the study of properties of almost all ... trajectories of the system. The second field of applications concerns the investigation of properties of the set of all the invariant measures for a given dynamical system and the finding of some remarkable measures in this set. The subject of this book belongs to the second direction.\nBunimovic also comments:-\nThe book is clearly and precisely written throughout and makes for comfortable reading. It is a good source of information about recent work in this field.\nWe note that in\n2008\nthis book was republished. It states in the Preface:-\nJean-René Chazottes has had the idea to make Bowen's monograph more easily available by retyping it. He has scrupulously respected the original text and notation, but corrected a number of typos and made a few other minor corrections, in particular in the bibliography, to improve usefulness and readability. In his enterprise he has been helped by Jerôme Buzzi, Pierre Collet, and Gerhard Keller.\nAnother short\n45\n-page book by Bowen appeared in\n1978\n, the year of his death. With title\nOn Axiom A diffeomorphisms\nit presented many results about Axiom A diffeomorphisms obtained since\nSmale\n's fundamental\n1968\npaper on the subject. The work is again reviewed by Bunimovic who adds:-\nMany remarkable results in this subject are due to\n[\nBowen\n]\n, and his untimely death is a great loss.\nJacob Feldman,\nMarina Ratner\n, and\nStephen Smale\nhave written an obituary of Bowen\n[\n4\n]\nin which they describe his home life and his character. Rufus and Carol Bowen's\n[\n4\n]\n:-\n... life was simple and unpretentious, punctuated by occasional parties full of noise and dancing. Rufus was a mainstay of the Sunday morning math department volleyball games. Although there was a certain amount of travel to other mathematical centres, Rufus preferred to stay near home, and his vacations usually took him and his wife to some quiet place in northern California ... His gentle humour, his extraordinary intelligence, his modesty, his utter honesty drew people to him, and he had many friends.\nThey also describe the style of his contributions at Berkeley:-\nRufus was an outstanding and well-appreciated teacher. During his brief career he had five Ph.D. students. Because of his stature in the mathematical world, he attracted several outstanding visitors in his field to Berkeley, and in this way was beginning to influence the development of the department. He had clear, independent, and carefully thought-out views on many social and political matters. He involved himself actively in the campaign against nuclear weapons. ...\nBowen died of a cerebral haemorrhage at the age of\n31\nwhile on a summer vacation with his wife to northern California. His death was sudden and totally unexpected.\nHis death at the age of\n31\nmeant that he had never received the honours for his remarkable contributions that he would have otherwise have done. However he received a posthumous honour in\n1981\nwhen the Bowen Lectures were set up at Berkeley\n[\n8\n]\n:-\nThe Bowen Lectures are supported by anonymous donors, one of whom was an undergraduate student of Rufus Bowen. Bowen worked in mathematical dynamics systems theory. His pioneering studies of topological entropy, symbolic dynamics,\nMarkov\npartitions, and invariant measures are of lasting importance; much of today's research is inspired by his ideas.\nThe first Bowen Lecturer was\nDennis Sullivan\n, the author of\n[\n7\n]\n, and the Bowen Lectures have been given by a leading mathematician each year since. For a list of Bowen Lecturers, see\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Topology"
  ]
}