{
  "nome_completo": "Robion Cromwell Kirby",
  "nome_curto": "Robion Kirby",
  "ano_nascimento": "1938",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kirby/",
  "lugar_nascimento": "Chicago, Illinois, USA",
  "lugar_morte": null,
  "biografia": "Robion Kirby\nis known to his friends and colleagues as Rob. His parents were\n[\n1\n]\n:-\n... both educated with a bit of graduate school, but comparatively poor.\n[\nHis\n]\nfather was a\n(\nquiet\n)\nconscientious objector during World War II and hence lost a few jobs.\nKirby's father, returning to graduate school, underwent teacher training in\n1948\nand then became a teaching assistant. This meant that the family were quite poor during the whole of Kirby's childhood and teenage years. In\n[\n1\n]\nhe describes his years in elementary school:-\nI grew up in small towns in Washington and Idaho. Knowing arithmetic and how to read before I entered school meant that I was usually bored and spent my time reading or daydreaming in the back of the class. The best school was a three-room school in Farragut, Idaho, where I could do the fifth-grade work as well as my own fourth-grade work and thus skipped a grade.\nWhen he was about ten years old he spent many hours trying to cross each of the bridges of Königsberg exactly once. Of course he failed but he never considered the possibility that it was impossible. At high school, although he was quite good at mathematics, he was far from certain that it was the subject in which he should specialise. He was still undecided when, in\n1954\n, he entered the University of Chicago. Entering was relatively easy since the university had no prerequisites, with students only being required to take an examination testing their general knowledge and intelligence. Mathematics was the subject he was best at, but still he had no special love for the subject and, seeing some friends enthused by their law courses, considered a law career. After some thought, he decided that he should stick with mathematics\n[\n1\n]\n:-\nI adopted the tendency to not listen to lectures, in fact to teachers or coaches or anyone with whom I was not engaged in a back-and-forth conversation. Games engaged me: chess, poker, and a wide variety of small sports, but not team sports, where one spent too much time listening to a coach or standing in right field.\nIn fact for his first years at the University of Chicago it was chess that was his main passion\n[\n1\n]\n:-\nOur college team won the US intercollegiate championship twice, and I became ranked twenty-fifth in the country without too much effort. I began to lose interest and sometimes wondered if I could do anything else as well as chess.\nHe took courses from\nPaul Halmos\n,\nSaunders Mac Lane\n,\nIrving Kaplansky\nand\nA A Albert\n.\nMac Lane\n\"radiated energy and love for mathematics\",\nKaplansky\nwas \"lucid\" while\nA A Albert\nwas \"ambidextrous and could fill a blackboard faster than anyone, writing with one hand when the other got tired\". However it was a course he took with\nHalmos\nin\n1958\non\ngeneral topology\n, using\nJohn Kelley\n's book\nGeneral Topology\n, that was the first mathematics course he really enjoyed.\nHowever, after four years of study at Chicago, he failed a German examination and, as a consequence, was not able to graduate with a B.S. in\n1958\n. He therefore spent a fifth year, retaking German for his B.S. but at the same time attending the courses put on for the Master's degree. After being awarded his B.S. he asked if he could be admitted to graduate school and take the Master's examination. He was told that if he got grades close to a B in the autumn quarter then he could take the examination. He got a B in\nmeasure theory\n, given by\nHalmos\n, and a C in algebraic topology, given by Eldon Dyer. With one other course at Pass level he was allowed to continue\n[\n2\n]\n:-\nThe Masters Exam could have four outcomes: you could pass with financial aid, pass without aid but with encouragement, pass with advice to pursue studies elsewhere, and fail. I got the third pass, but really liked Chicago and turned up the next year\n(1960)\nanyway.\nOf course, Kirby might have scraped in by the back door but he now needed to be able to fund his graduate studies. With a letter of support from\nMac Lane\n, Kirby was appointed as a teaching assistant at Roosevelt University, in Chicago. He taught mainly college algebra and trigonometry there for four years. Although teaching provided financial support, it was also very time-consuming and comparatively little time was available for research. First, Kirby had to pass the oral Ph.D. qualifying examination which required that he offer two topics on which to be tested. He chose homotopy theory and group theory but performed poorly and failed. He was advised that learning mathematics from books was not going to make a mathematician of him, rather he had, in addition, to start discussing mathematics with fellow students and with staff\n[\n2\n]\n:-\n... start talking mathematics, come to tea, and become part of the mathematical community.\nIt was good advice and he passed the qualifying examination at his second attempt. However, having performed poorly, particularly in topology, he found it hard to ask a topologist to become his thesis advisor.\nMac Lane\ntold him to take the summer finding a topic before asking one of the faculty to be his supervisor. In the end he asked Eldon Dyer who had been on leave when he took the oral examinations so had not seen his poor performance.  Dyer was an algebraic topologist while Kirby's strengths came from his geometric intuition. He became interested in the 'annulus conjecture' which was proposed by\nJohn Milnor\nin\n1962\n. The conjecture states:-\nA region in\nn\nn\nn\n-space bounded by two locally flat\nn\n−\n1\nn - 1\nn\n−\n1\nspheres is homeomorphic to an annulus.\nAt one stage Kirby thought he had found a proof, but it soon proved to be incorrect.\nMac Lane\nsuggested that this problem was too hard for a Ph.D. thesis so Kirby moved to another topic but continued to think about the annulus conjecture. He submitted his thesis\nSmoothing Locally Flat Imbeddings\nto Chicago in\n1965\nand was awarded a Ph.D. He published papers related to his thesis\nSmoothing locally flat imbeddings\n(1966)\nand\nSmoothing locally flat imbeddings of differentiable manifolds\n(1967)\nbut he also proved a weak form of the annulus conjecture which he published in\nOn the annulus conjecture\n(1966)\n.\nAfter the award of his doctorate, Kirby was appointed as an assistant professor at the University of California, Los Angeles. It was here that he made his biggest mathematical breakthrough\n[\n1\n]\n:-\n[\nOne evening\n]\nin\n[\nAugust\n]\n1968\n, while looking after my four-month-old son\n[\nRolf\n]\n, an idea occurred to me, now called the \"torus trick.\" It only took a few days to realize that I had reduced the annulus conjecture to a problem about PL homotopy tori, and in a different direction had proved the local contractibility of the space of homeomorphisms of\nn\nn\nn\n-space. I had already arranged to spend fall\n1968\nat the Institute for Advanced Study, a fortuitous choice because I met Larry Siebenmann, who was the perfect collaborator. We finished off the annulus conjecture and another couple of\nMilnor\n's problems, the existence and uniqueness of triangulations of manifolds of dimension greater than four. This used results of\nTerry Wall\n, which had been recently proved but not yet entirely written down.\nIn September\n1970\nhe was an invited speaker at the International Congress of Mathematicians in Nice, France, where he gave the lecture\nSome conjectures about four-manifolds\n. It was his outstanding work on the annulus conjecture which led to the\nAmerican Mathematical Society\nawarding him their\nVeblen\nPrize in Geometry in\n1971\n:-\n... for his paper \"Stable homeomorphisms and the annulus conjecture\".\nIn\n1974\nhe was awarded a Guggenheim Foundation Fellowship and, in\n1995\n, he received the\nNational Academy of Sciences\nAward for Scientific Reviewing:-\nFor his list of problems in low-dimensional topology and his tireless maintenance of it; several generations have been greatly influenced by Kirby's list.\nIt was the first occasion on which this award had been given to a mathematician. He was elected to the\nNational Academy of Sciences\nin\n2001\n. Although he has remained at the University of California throughout his career, quite early on he moved from Los Angeles to Berkeley\n[\n1\n]\n:-\nI moved to Berkeley, getting closer to the mountains and rivers that I loved, and adding another fifty PhD students to my mathematical family. These mathematical sons and daughters and further descendants are great friends and one of the best parts of my career.\nLet us quote from\n[\n2\n]\nwhere Kirby describes his approach to advising his Ph.D. students:-\nFrom the beginning, I have encouraged my students to find their own problems. It may take an extra year or two, but when they're finished they will have not only have done honest research, but they will have a backlog of problems that they've worked on, so that they can hit the ground running in their first job. My responsibility has been to help them get into promising subjects with a future, to nurture a small community of students who learn from and support each other, to organise seminars and give courses on recent developments, and to teat them like mathematicians who just happen to have not yet written their first paper.\nLet us now look at the books that Kirby has published. In\n1977\nhe published, in collaboration with Laurence C Siebenmann, the book\nFoundational essays on topological manifolds, smoothings, and triangulations\n. The book contains five essays all of which had existed in some form of other since\n1970\n, describing the major breakthroughs that the collaboration between Kirby and Siebenmann produced beginning in\n1968\n. Ronald J Stern writes:-\nThe authors present the material both expertly and well. ... This book is indispensable for anyone interested in topological manifolds. ... The book is demanding, but self-contained, well written, and its readers will be rewarded with a full and open understanding.\nIn\n1989\nKirby published\nThe topology of\n4\n-manifolds\nin the Springer Lecture Notes in Mathematics Series. Christopher W Stark writes:-\nThese very readable lecture notes give geometric proofs of several fundamental results in\n4\n-manifold topology ... The techniques and objects emphasized here are framed links and the Kirby calculus, spin structures, and immersion methods.\nAnother aspect of Kirby's contributions that we should mention is his support for mathematics by bringing important issues to attention. As Associate Editor of the\nNotices\nof the\nAmerican Mathematical Society\nhe contributed articles such as\n[\n3\n]\n. We give a quote from that article to indicate the issue that Kirby wanted to highlight:-\nWe mathematicians simply give away our work\n(\ntogether with copyright\n)\nto commercial journals who turn around and sell it back to our institutions at a magnificent profit. Why? Apparently because we think of them as\nour\njournals and enjoy the prestige and honour of publishing, refereeing, and editing for them. ... What can mathematicians do? At one extreme they can refuse to submit papers, referee, and edit for the high-priced commercial journals. ... A possibility is this: one could post one's papers\n(\nincluding the final version\n)\nat the arXiv and other websites and refuse to give away the copyright. If almost all of us did this, then no one would have to subscribe to the journals, and yet they could still exist in electronic form.\nLet us end this biography by indicating something of Kirby's life outside mathematics\n[\n1\n]\n:-\nI could not avoid being pulled into other activities. I was a single parent for a number of years with custody of my son and daughter, an avid whitewater kayaker with some classic first descents with Dennis Johnson, a constant thinker about public policy\n(\noften with my father and brother\n)\n, and for twenty-six years now a happy husband of Linda, who enjoys mathematicians more than any other mathematical spouse that I know.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Topology"
  ]
}