{
  "nome_completo": "Roger Penrose",
  "nome_curto": "Roger Penrose",
  "ano_nascimento": "1931",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Penrose/",
  "lugar_nascimento": "Colchester, Essex, England",
  "lugar_morte": null,
  "biografia": "Roger Penrose\n's parents, Lionel Sharples Penrose and Margaret Leathes, were both medically trained. Margaret was a doctor while Lionel was a medical geneticist who was elected a Fellow of the\nRoyal Society\n. He was involved with a project called the Colchester survey which aimed to discover whether inherited factors or environmental factors were the most significant in determining if someone would be likely to suffer from mental heath problems. He was in Colchester carrying out this work at the time Roger was born. Roger's brother, Oliver Penrose, had been born two years earlier. Oliver went on to become professor of mathematics first at the Open University, then at Heriot-Watt University in Edinburgh, Scotland. Roger also had a younger brother Jonathan who went on to become a lecturer in psychology. Jonathan was British Chess Champion ten times between\n1958\nand\n1969\nand, many argue, was the most naturally talented British chess player of all time.\nIn\n1939\nRoger's father went to the United States with his family but as all the indications pointed towards the outbreak of war, he decided not to return to England with his family but accepted an appointment in a hospital in London, Ontario, Canada. Roger attended school in London, Ontario but although it was during this period that he first became interested in mathematics it was not his schooling which stimulated this interest, rather it was his family. He writes\n(\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nI remember making various polyhedra when I was about ten ...\nRoger's father became Director of Psychiatric Research at the Ontario Hospital in London Ontario, but he was very interested in mathematics, particularly geometry, while Roger's mother was also interested in geometry. Roger's brother Oliver\n(\n[\n2\n]\nor\n[\n3\n]\n)\n:-\n... was two years older than I was, but four years ahead in school. He knew a lot about mathematics at a young age and took a great interest in both mathematics and physics.\nIn\n1945\n, after the World War II ended, the Penrose family returned to England. Roger's father was appointed as Professor of Human Genetics at University College London and Roger attended University College School in London. Then his interest in mathematics began to increase but his family saw him following in his father's footsteps and taking up a medical career. However, as was typical in schools at this time, biology and mathematics were alternatives at the University College School with pupils having to choose one or the other\n(\n[\n2\n]\nor\n[\n3\n]\n)\n:-\n... I remember an occasion when we had to decide which subjects to do in the final two years. Each of us would go up to see the headmaster, one after the other, and he said \"Well, what subjects do you want to do when you specialise next year\". I said \"I'd like to do biology, chemistry and mathematics\" and he said \"No, that's impossible - you can't do biology and mathematics at the same time, we just don't have that option\". Since I had no desire to lose my mathematics I said \"Mathematics, physics and chemistry\". My parents were rather annoyed when I got home; my medical career had disappeared in one stroke.\nPenrose entered University College London which he was entitled to do without paying fees since his father was professor there. He was awarded a B.Sc. degree with First Class Honours in Mathematics and then decided to go to Cambridge to undertake research in pure mathematics. He was following in the footsteps of his older brother Oliver who had also taken his undergraduate degree at University College London and had gone to Cambridge to undertake research but Oliver had chosen physics. Roger, however, was set on research in mathematics and on entering St John's College he began research in\nalgebraic geometry\nsupervised by\nHodge\n. However, after one year of study at Cambridge, finding that his interests were not particularly central to those of\nHodge\n, he changed his supervisor to\nJohn Todd\n. Penrose was awarded his Ph.D. for his work in algebra and geometry from the University of Cambridge in\n1957\nbut by this time he had already become interested in physics. He described how three courses which he attended during his first year at Cambridge influenced him\n(\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nI remember going to three courses, none of which had anything to do with the research I was supposed to be doing. One was a course by Hermann Bondi on general relativity which was fascinating ... Another was a course by Paul\nDirac\non quantum mechanics which was beautiful in a completely different way ... And the third course ... was a course on mathematical logic by Steen. I learnt about\nTuring\nmachines and\nGödel\n's theorem ...\nThe first major influence prompting his interest in physics had been Dennis Sciama, a physicist friend of his brother. Penrose said\n(\n[\n2\n]\nor\n[\n3\n]\n)\n:-\n[\nSciama\n]\nwas very influential on me. He taught me a great deal of physics, and the excitement of doing physics came through; he was that kind of person, who conveyed the excitement of what was currently going on in physics ...\nWhile at Cambridge working towards his doctorate he began to publish articles on semigroups, and on rings of matrices. In\n1955\nhe published\nA generalized inverse for matrices\nin the\nProceedings of the Cambridge Philosophical Society\n. In this paper Penrose defined a generalized inverse\nX\nX\nX\nof a complex rectangular\n(\nor possibly square and singular\n)\nmatrix\nA\nA\nA\nto be the unique solution to the equations\nA\nX\nA\n=\nA\n,\nX\nA\nX\n=\nX\n,\n(\nA\nX\n)\nT\n=\nA\nX\n,\n(\nX\nA\n)\nT\n=\nX\nA\nAXA = A, XAX = X, (AX)^{T} = AX, (XA)^{T} = XA\nA\nX\nA\n=\nA\n,\nX\nA\nX\n=\nX\n,\n(\nA\nX\n)\nT\n=\nA\nX\n,\n(\nX\nA\n)\nT\n=\nX\nA\n. He used this generalized inverse for problems such as solving systems of matrix equations, and finding a new type of spectral decomposition. His second publication of\n1955\nwas\nA note on inverse semigroups\npublished in the same journal and co-authored with\nDouglas Munn\n. An inverse semigroup is a generalisation of a group and continues to be the subject of many research papers. This early paper gave several alternative definitions. In the following year Penrose published\nOn best approximation solutions of linear matrix equations\nwhich used the generalized inverse of a matrix to find the best approximate solution\nX\nX\nX\nto\nA\nX\n=\nB\nAX = B\nA\nX\n=\nB\nwhere\nA\nA\nA\nis rectangular and non-square or square and singular.\nPenrose spent the academic year\n1956\n-\n57\nas an Assistant Lecturer in Pure Mathematics at Bedford College, London and was then appointed as a Research Fellow at St John's College, Cambridge. This was a three year post and during its tenure he married Joan Isabel Wedge in\n1959\n. Before the fellowship ended Penrose had been awarded a NATO Research Fellowship which enabled him to spend the years\n1959\n-\n61\nin the United States, first at Princeton and then at Syracuse University. Back in England, Penrose spent the following two years\n1961\n-\n63\nas a Research associate at King's College, London before returning to the United States to spend the year\n1963\n-\n64\nas a Visiting Associate Professor at the University of Texas at Austin.\nIn\n1964\nPenrose was appointed as a Reader at Birkbeck College, London and two years later he was promoted to Professor of Applied Mathematics there. In\n1973\nhe was appointed Rouse Ball Professor of Mathematics at the University of Oxford and he continued to hold this until he became Emeritus Rouse Ball Professor of Mathematics in\n1998\n. In that year he was appointed Gresham Professor of Geometry at Gresham College, London.\nBeginning in\n1959\n, Penrose published a series of important papers on cosmology. The first was\nThe apparent shape of a relativistically moving sphere\nwhile in\n1960\nhe published\nA spinor approach to general relativity\n. This latter paper was described as follows:-\nAn elegant and detailed exposition ... of the mathematical apparatus of gravitation theory, with emphasis on the geometrical theory of the\nRiemann\ntensor.\nAs well as important papers on cosmology, Penrose continues to publish papers on pure mathematics. Together with\nHenry Whitehead\nand\nChristopher Zeeman\nhe published\nImbedding of manifolds in euclidean space\nin\n1961\n. Among other results, the authors prove in this paper that, if\n0\n<\n2\nm\n≤\nn\n0 < 2m ≤ n\n0\n<\n2\nm\n≤\nn\n, then every closed\n(\nm\n−\n1\n)\n(m-1)\n(\nm\n−\n1\n)\n-connected\nn\nn\nn\n-manifold can be imbedded in\nR\n2\nn\n−\nm\n+\n1\n\\mathbb{R}^{2n-m+1}\nR\n2\nn\n−\nm\n+\n1\n. This time with Ezra Newman, Penrose published\nAn approach to gravitational radiation by a method of spin coefficients\nin the following year in which they show that:-\n... the two-component spinor formalism leads to the consideration of a tetrad in space-time consisting of two real null-vectors and two complex conjugate ones.\nIn\n1965\n, using topological methods, Penrose proved an important theorem which, under conditions which he called the existence of a trapped surface, proved that a singularity must occur in a gravitational collapse. Basically under these conditions space-time cannot be continued and classical general relativity breaks down. Penrose looked for a unified theory combining relativity and quantum theory since quantum effects become dominant at the singularity. It was for this prediction of the existence of \"black holes\" that he would be awarded the Nobel Prize for Physics\n55\nyears later.\nOne of Penrose's major breakthroughs was his introduction of twistor theory in an attempt to unite relativity and quantum theory. This is a remarkable mathematical theory combining powerful algebraic and geometric methods. Together with Wolfgang Rindler, Penrose published this first volume of\nSpinors and space-time\nin\n1984\n. This volume covered two-spinor calculus and relativistic fields while the second volume covering spinor and twistor methods in space-time geometry appeared two years later.\nIt is for a number of outstanding popular books that Penrose is perhaps best known. He published\nThe Emperor's New Mind : Concerning computers, minds, and the laws of physics\nin\n1989\n. In the following year the book was awarded the Rhone-Poulenc Science Book Prize. Sklar, reviewing the book, writes that its aim is:-\n... to expound and critically attack one recent view of the nature of mind ... taken as reducing mental activity to the carrying out of an algorithmic process, and to propose that a more adequate theory of mind will have to be founded on an as yet not existing physical theory adequate to the known nature of the material world. In the process of the argument elegant expositions, at a level suitable for the unlearned but reasonably sophisticated reader, are given of a wide variety of topics ranging from the nature of algorithms and abstract computability, through results on undecidability and incompleteness, the basic structures of classical physics, the basic structures and philosophical puzzles in quantum mechanics, the basic features of entropic asymmetry and its relation to cosmological structure, the search for an adequate quantum theory of gravity, to some of the results of neuro-anatomy and research into the functioning of the brain.\nIn\n1994\nPenrose published\nShadows of the mind : A search for the missing science of consciousness\nwhich continues to develop the topic of\nThe emperor's new mind\n. In\n1996\nPenrose and\nHawking\npublished\nThe nature of space and time\n. This book is a record of a debate between the two at the Isaac\nNewton\nInstitute of Mathematical Sciences at the University of Cambridge in\n1994\n. Each of the two gave three lectures given alternately so that each could respond to the other's arguments, and then, in a final session, there is a debate between the two. We quote from Penrose's contribution since he states clearly his own position, and that of\nHawking\n:-\nAt the beginning of this debate Stephen said that he thinks that he is a positivist, whereas I am a PlatoniSt I am happy with him being a positivist, but I think that the crucial point here is, rather, that I am a realiSt Also, if one compares this debate with the famous debate of\nBohr\nand\nEinstein\n, some seventy years ago, I should think that Stephen plays the role of\nBohr\n, whereas I play\nEinstein\n's role! For\nEinstein\nargued that there should exist something like a real world, not necessarily represented by a wave function, whereas\nBohr\nstressed that the wave function doesn't describe a \"real\" microworld but only \"knowledge\" that is useful for making predictions.\nThere is one further aspect of Penrose's work which we must mention. This is his work on non-periodic tilings, an interest which he took up while a graduate student at Cambridge. His first attempts led to success but with a large number of tiles. Further work over many years led to Penrose discovering that he could find non-periodic tilings with only six tiles, then finally he achieved the seemingly impossible with finding non-periodic tilings with only two tiles. By non-periodic we mean that the tilings are not invariant under any translation. Here are some properties of the tiling: in any finite tiled region, only one tiling is possible; in an infinite tiling of the plane, any tiling of a region that occurs is repeated infinitely often elsewhere in the plane and must reoccur within twice the diameter of the region from where you first found it. In fact the tiling of any finite region will eventually appear in every Penrose tiling.\nIn addition to Penrose's main appointments which we have mentioned above, he also held a number of visiting and part-time posts. He held visiting positions at Yeshiva, Princeton and Cornell during\n1966\n-\n67\nand\n1969\n. From\n1983\nuntil\n1987\nhe was Lovett Professor at Rice University in Houston. He then became Distinguished Professor of Physics and Mathematics at Syracuse University in New York until\n1993\nwhen he became Francis and Helen Pentz Distinguished Professor of Physics and Mathematics at Pennsylvania State University.\nPenrose has received many honours for his contributions. He was elected a Fellow of the\nRoyal Society of London\n(1972)\nand a Foreign Associate of the United States\nNational Academy of Sciences\n(1998)\n. We mentioned the Science Book Prize\n(1990)\nwhich he received for The Emperor's New Mind but this is only one of many prizes. Others include the\nAdams\nPrize from Cambridge University; the Wolf Foundation Prize for Physics\n(\njointly with Stephen\nHawking\nfor their understanding of the universe\n)\n: the Dannie Heinemann Prize from the American Physical Society and the American Institute of Physics; the Royal Society Royal Medal; the\nDirac\nMedal and Medal of the British Institute of Physics; the Eddington Medal of the\nRoyal Astronomical Society\n; the Naylor Prize of the\nLondon Mathematical Society\n; and the\nAlbert Einstein\nPrize and Medal of the\nAlbert Einstein\nSociety. In\n1994\nhe was knighted for services to science.\nIn\n2000\nhe received the Order of Merit. He was awarded the\nDe Morgan\nMedal by the\nLondon Mathematical Society\nin\n2004\n. Part of the citation reads:-\nHis deep work on General Relativity has been a major factor in our understanding of black holes. His development of Twistor Theory has produced a beautiful and productive approach to the classical equations of mathematical physics. His tilings of the plane underlie the newly discovered quasi-crystals.\nThe\nRoyal Society\nawarded Penrose their Copley Medal in\n2005\n. The announcement reads:-\nSir Roger Penrose, OM, FRS has been awarded the Royal Society's Copley medal the world's oldest prize for scientific achievement for his exceptional contributions to geometry and mathematical physics. Sir Roger, Emeritus Rouse Ball Professor of Mathematics at the University of Oxford, has made outstanding contributions to general relativity theory and cosmology, most notably for his work on black holes and the Big Bang.\nMartin Rees, President of the\nRoyal Society\n, explained Penrose's exceptional contributions which led to the award:-\nRoger has been producing original and important scientific ideas for half a century. His work is characterised by exceptional geometrical and physical insight. He applied new mathematical techniques to Einstein's theory, and led the renaissance in gravitation theory in the\n1960\ns. His novel ideas on space and time and his concept of 'twistors' are increasingly influential. Even his recreations have had intellectual impact: for instance the 'impossible figures' popularised in\nEscher\n's artwork, and the never-repeating patterns of 'Penrose tiling'. He has influenced and stimulated a wide public through his lectures, and his best-selling and wide-ranging books.\nOn receiving the award, Penrose said:-\nThe award of the\nRoyal Society\n's Copley Medal came as a complete surprise to me. It is an extraordinary honour, this being the\nRoyal Society\n's oldest and most distinguished award, first given just\n200\nyears before I was born. I feel most humbled for my name to be added to that enormously distinguished list of previous recipients.\nSeveral universities have awarded Penrose an honorary degree including New Brunswick University\n(1992)\n, the University of Surrey\n(1993)\n, the University of Bath\n(1994)\n, the University of London\n(1995)\n, the University of Glasgow\n(1996)\n, Essex University\n(1996)\n, the University of St Andrews\n(1997)\n, Santiniketon University\n(1998)\n, Warsaw University\n(2005)\n, Katholieke Universiteit Leuven\n(2005)\nand the University of York\n(2006)\n. He was awarded the\n2020\nNobel Prize in Physics for his prediction of the existence of black holes.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}