{
  "nome_completo": "Roger Conant Lyndon",
  "nome_curto": "Roger Lyndon",
  "ano_nascimento": "1917",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lyndon/",
  "lugar_nascimento": "Calais, Maine, USA",
  "lugar_morte": "Ann Arbor, Washtenaw, Michigan",
  "biografia": "Roger Lyndon\n's father was Percy Lyndon, the Unitarian minister in the town of Eastport, a small town built on islands on the Bay of Fundy, Maine, where the family lived. The Lyndon family originally came from England where the name\n(\nmeaning the dweller by the lime-trees\n)\nwent back to the Middle Ages. Percy Lyndon's father, Roger's paternal grandfather, was born in England but came to the United States as a baby. Roger's mother was Ann Aymar Milliken and the Milliken family had been residents of Maine since Ann's father had moved from Louisiana to Maine where he owned a wharf on the Bay of Fundy. Sadly Roger's mother, Ann Lyndon, died when he was two years old and his family, now consisting of Percy, Roger and his sister, moved to various towns\n(\nsuch as Massachusetts and New York\n)\nso, as a consequence, Roger's education took place at a number of different schools. He graduated from Derby School in\n1935\nand entered Harvard University with the aim of studying literature so that he might become a writer. However, he discovered that, for him, mathematics was easy and required little effort while he had to spend long hours learning literature. The move to mathematics was made and he graduated from Harvard in\n1939\n.\nHaving worked for a year in a bank in Albuquerque, Lyndon returned to Harvard, being awarded a Master's Degree in\n1941\n. He taught at Georgia Institute of Technology in Atlanta during session\n1941\n-\n42\n, then he returned to Harvard for the third time in\n1942\nand there taught navigation as part of the V-\n12\nProgram while he studied for his doctorate. The V-\n12\nNavy College Training Program was set up in\n1943\nsince the lowering of the draft age meant that there would otherwise have been a shortage of college trained officers. The men Lyndon taught went on to serve their country by manning ships, flying planes and commanding troops. On the research front Lyndon took some time working in different mathematical areas. He began working on mathematical logic, moved to a study of relational algebras, then finally undertook research in homological algebra. He was awarded a Ph.D. in\n1946\nfor a thesis on homological algebra, the work being an outstanding early step in the study of spectral sequences. His supervisor was\nSaunders Mac Lane\nand his thesis was entitled\nThe Cohomology Theory of Group Extensions\n. Mac Lane explained that the thesis addressed\n[\n4\n]\n:-\n... the problem of computing the\ncohomology\ngroups\nof a group extension in terms of the cohomology groups of the factors of that extension. It turned out that in many cases one could not completely compute the whole cohomology group. Now we know that the difficulty lies in the additional invariants presented by the spectral sequence of that group extension.\nInterestingly Lyndon's first publication was not in any of the topics that we have mentioned above but rather was\nThe Zuse computer\n(1947)\n. In the paper he described the Z\n4\n,\nZuse\n's relay-type digital computer which was discovered by advancing British and American troops,The nearly completed computer had been hidden by\nKonrad Zuse\nin the cellar of a house in the small village of Hinterstein in Bavaria. Lyndon's second paper\nThe Cohomology Theory of Group Extensions\nwas based on his doctoral thesis and appeared in print in\n1948\n. In the following year the paper\nNew proof for a theorem of Eilenberg and Mac Lane\nappeared, then, in\n1950\n, the paper\nThe representation of relational algebras\nwhich resulted from his early interest in that topic.\nAfter attending a course by\nAlfred Tarski\n, Lyndon and\nTarski\nbecame good friends and Lyndon was later to work on\nmodel theory\nas a result of attending these lectures. For two years after completing is doctorate, Lyndon worked for the Office of Naval Research in London. Returning to the United States in\n1948\nhe decided that to make further progress in cohomology theory he needed to learn more about current work in topology and clearly Princeton was the leading institution for research in that area. Accepting a position as an Instructor in Mathematics at Princeton, he attended a course on\nknot theory\nby\nRalph Fox\nand from this his interest was aroused in combinatorial group theory.\nKurt Reidemeister\nwas at Princeton for a year in\n1948\nand again this was a major influence on Lyndon to work on\ngroup presentations\n. Lyndon's first work which came out of these discussions with\nReidemeister\nwas published in\n1950\n. In it Lyndon investigated one-relator groups. In particular he computed their cohomology groups.\nIn\n1953\nLyndon left Princeton, where he had been promoted to assistant professor, and took up an assistant professorship at the University of Michigan where he remained throughout his career except for a number of posts as visiting professor at Berkeley, Queen Mary College, London, Montpellier, France and Picardie, France.\nKenneth Appel\n, writes in\n[\n2\n]\n:-\nLyndon produces elegant mathematics and thinks in terms of broad and deep ideas.... I once asked him whether there was a common thread to the diverse work in so many different fields of mathematics, he replied that he felt the problems on which he had worked had all been combinatorial in nature... one would certainly have to put him in the very first rank of those who have used combinatorial techniques in the last forty years.\nLyndon made numerous major contributions to combinatorial group theory. These include the development of 'small cancellation theory', work on Fuchsian groups and the\nRiemann\n-\nHurwitz\nformula, his introduction of 'aspherical' presentations of groups and his work on length functions in free products of groups.\nLyndon was the coauthor of one of the most important works on combinatorial group theory. Together with Paul Schupp, he wrote\nCombinatorial group theory\n(1976)\n. I\n[\nEFR\n]\nremember how eagerly the book was awaited by those interested in research in this area, and the excitement of seeing the book when it first appeared and was passed round a lecture theatre at a conference I was attending.\nCombinatorial group theory\nwas not Lyndon's first book, however, for he had published\nNotes on logic\nten years earlier in\n1966\n.\nAndrzej Mostowski\ndescribed the book, beginning his review:-\nThe book contains a concise and clear exposition of basic notions of mathematical logic. More specifically, the author deals with the first-order logic with symbols for relations and functions.\nAfter a detailed description of the contents,\nMostowski\ncontinued:-\nAs should be clear from this description, the book is intended as a text to enable a mathematically well-trained reader to acquaint himself quickly with the basic results of logic. Owing to the clear plan, concise style and well-chosen exercises, the book meets its objectives excellently. In the reviewer's opinion the book has set a new standard for texts in mathematical logic which will not be easy to supersede.\nLyndon's last book was\nGroups and geometry\n(1985)\n. Kenneth S Brown writes:-\nThis book is a very readable introduction to group theory, geometry, and the connections between them. It is aimed at advanced undergraduates and beginning graduate students. The emphasis is on the classical two-dimensional incidence geometries and their associated groups. The geometries studied include Euclidean geometry, affine geometry, projective geometry, inversive geometry, and hyperbolic geometry. In addition, there are three optional chapters, treating plane crystallographic groups, tessellations in dimensions greater than\n2\n, and Fuchsian groups.\nAt Michigan, Lyndon supervised many Ph.D. students. The titles of their theses indicate the wide range of Lyndon's interests. They include: Groups rings and dimension subgroups; Two investigations on the borderline of logic and algebra; Decision problems of finite automata design and related arithmetic; On\nDehn\n's algorithm and the conjugacy problem; Projectivities of free products; Continuous model theory and set theory; Real length functions in groups; Automorphisms of the fundamental group of an orientable\n2\n-manifold; Some algorithmic problems for semigroups; and Groups acting on trees.\nKenneth Appel\n, who was Lyndon's second Ph.D. student, writes\n[\n2\n]\n:-\nI fondly remember my experiences working as a thesis student in the years\n1957\n-\n59\n. My conversations with Lyndon often took place in the newly established common room, which was supplied with a large coffee percolator. As a \"morning person,\" I would want to discuss my work with Lyndon as soon as he arrived at Angell Hall. It soon became clear to me that no mathematical discussion was possible until he had consumed at least two cups of coffee, so during my last two years of graduate work I was the unofficial coffee preparer for the common room.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Topology"
  ]
}