{
  "nome_completo": "Roger Cotes",
  "nome_curto": "Roger Cotes",
  "ano_nascimento": "1682",
  "ano_morte": "1716",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cotes/",
  "lugar_nascimento": "Burbage, Leicestershire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Roger Cotes\n' mother was Grace Farmer, who came from Barwell in Leicestershire, and his father was Robert Cotes who was the rector of Burbage. Roger had a brother Anthony one year older than himself, and a sister Susanna who was one year younger. He attended Leicester School and by the age of twelve his teachers had already realised that he had an exceptional mathematical talent. His uncle, the Reverend John Smith, was keen to give Roger every chance to develop these talents and so Roger went to live with him so that he might be personally tutored. Roger later attended the famous St Paul's School in London, but he continued to be advised by his uncle and the two exchanged letters on mathematical topics during the time that Roger spent at school in London.\nRoger matriculated at Trinity College, Cambridge, on\n6\nApril\n1699\nas a pensioner, meaning that he did not have a scholarship and paid for his own keep in College. He graduated with a B.A. in\n1702\nand remained at Cambridge where he was elected to a fellowship in\n1705\n. In January\n1706\nhe was nominated to be the first Plumian Professor of Astronomy and Experimental Philosophy. This was a remarkable achievement for Cotes who, at that time, was on\n23\nyears of age. His exceptional abilities had been fully appreciated, however, by many at Cambridge such as\nWilliam Whiston\nwith whom he had quickly formed a friendship. Both\nNewton\nand\nWhiston\nrecommended Cotes for the Chair, as did Richard Bentley who was master of Trinity College. There were some, however, who opposed his appointment, the most high profile of whom was\nFlamsteed\n, the astronomer royal. By the time that Cotes was formally elected as Plumian Professor on\n16\nOctober\n1707\nhe had, in the previous year, been elected to a more prestigious fellowship as well as being awarded his M.A. Meli gives the background to the establishment of the chair in\n[\n2\n]\n:-\nCotes was the first occupant of the Cambridge chair established by Thomas Plume\n(1630\n-\n1704)\n, archdeacon of Rochester, who bequeathed nearly £\n2000\nto maintain a professor and erect an astronomical observatory. Plans for an observatory at Trinity had already been drafted by Bentley before Plume's bequest. The observatory was eventually housed over the king's or great gate at Trinity College, together with living quarters for the Plumian professor.\nIt is not entirely clear how successful Cotes was in his role as an observational astronomer. In the first place there are somewhat contradictory accounts of the quality of the instruments in the Cambridge observatory. Cotes designed a transit telescope to add to a collection of instruments which had been purchased or donated. For example\nNewton\ndonated a clock which still survives at Trinity College. Bentley, the master of Trinity College we mentioned above, claimed that the Observatory had \"the best instruments in Europe\" but an assistant who worked there wrote to\nFlamsteed\nsaying \"I saw nothing there that might deserve your notice\". The truth is probably somewhere in between, since it would be natural for the master of Trinity to boast of the facilities, while the assistant, who only worked there for a short time, was probably trying to please\nFlamsteed\n. In terms of the observations that Cotes made, perhaps the most significant was the total eclipse on\n22\nApril\n1715\n. However,\nHalley\ndescribes this event in a paper in the\nPhilosophical Transactions of the Royal Society\nwhere he says that Cotes:-\n... had the misfortune to be opprest by too much company, so that though the heavens were very favourable, yet he missed both the times of the beginning of the eclipse and that of total darkness.\nCotes himself wrote a letter to\nNewton\nconcerning the eclipse in which he explained that his assistant had discovered a method to determine the mid-point of the eclipse and he\n[\n3\n]\n:-\n... called out to me, \"Now's the middle\", though I knew not at that time what he meant.\nNone of this speaks very highly of Cotes' dedication as an observer, but nevertheless he did note some important facts concerning this eclipse and other astronomical events. However, his mathematical abilities put him second only to\nNewton\nfrom his generation in England. Before going on to look at his mathematical contributions let us note that he was elected a fellow of the\nRoyal Society\non\n30\nNovember\n1711\n, was ordained a deacon on\n30\nMarch\n1713\n, and was ordained a priest on\n31\nMay\n1713\n.\nFrom\n1709\nuntil\n1713\nmuch of Cotes' time was taken up editing the second edition of\nNewton\n's\nPrincipia\n. He did not simply proof-read the work, rather he conscientiously studied it, gently but persistently arguing points with\nNewton\n. For example in\n[\n6\n]\na discussion is considered which took place between Cotes and\nNewton\nin\n1711\nconcerning the velocity of water flowing from a hole in a cylindrical vessel. During the discussion they gave various approximations to the fourth root of\n2\nwhich is approximately\n1\n.\n189207115\n.\nNewton\ngave the following\nrational\napproximations\n(\nwe add decimal values to see their accuracy\n)\n6\n5\n=\n1.200000000\n\\large\\frac{6}{5}\\normalsize  = 1.200000000\n5\n6\n​\n=\n1\n.\n2\n0\n0\n0\n0\n0\n0\n0\n0\n13\n11\n=\n1.181818182\n\\large\\frac{13}{11}\\normalsize  = 1.181818182\n1\n1\n1\n3\n​\n=\n1\n.\n1\n8\n1\n8\n1\n8\n1\n8\n2\n25\n21\n=\n1.190476190\n\\large\\frac{25}{21}\\normalsize  = 1.190476190\n2\n1\n2\n5\n​\n=\n1\n.\n1\n9\n0\n4\n7\n6\n1\n9\n0\nwhile Cotes gave\n44\n37\n=\n1.189189189.\n\\large\\frac{44}{37}\\normalsize  = 1.189189189.\n3\n7\n4\n4\n​\n=\n1\n.\n1\n8\n9\n1\n8\n9\n1\n8\n9\n.\nAt the beginning of the correspondence between the two men the tone is very friendly. However, toward the end of the task there are signs that they are cooling towards one another\n(\nsee\n[\n3\n]\nfor details of these letters\n)\n. In particular although\nNewton\nthanked Cotes in the first draft of a preface he wrote to this edition, he deleted these thanks for the final publication. Cotes himself wrote an interesting preface of his own in which he explained how the study of natural philosophy had developed. First, Cotes explained, came\nAristotle\n's method which involved naming hidden properties. Then, according to Cotes, came the ideas that all matter was homogeneous. He saw these methods as improvements, yet still retaining certain of the weaknesses of\nAristotle\n's approach. Although he does not specifically name\nDescartes\nand\nLeibniz\nhere, it is clearly an attack on their ideas. Finally says Cotes, comes the method based on first conducting experiments without having preconceived ideas, and then deducing how the world works from the results. These were the methods of\nNewton\nwhich led to establishing how the basic forces of nature operated.\nCotes only published one paper in his lifetime, namely\nLogometria\n, published in the\nPhilosophical Transactions of the Royal Society\nfor March\n1714\n, which he dedicated to\nHalley\n. It contains\n(\nin the words that Cotes used himself in a letter to\nNewton\n[\n3\n]\n)\n:-\n... a new sort of construction in geometry which appear to me very easy, simple and general.\nIn this Cotes gave a method of finding rational approximations as convergents of\ncontinued fractions\n, and the author of\n[\n6\n]\nsuggests that this explains how he found the approximation\n44\n37\n\\large\\frac{44}{37}\\normalsize\n3\n7\n4\n4\n​\nto the fourth root of\n2\nwhich we mentioned above.\nCotes was particularly pleased with his rectification of the logarithmic curve as he made clear in a letter to his friend\nWilliam Jones\nin\n1712\n. In particular his work on logarithms led him to study the curve\nr\n=\na\nθ\nr = \\Large\\frac{a}{\\theta}\\normalsize\nr\n=\nθ\na\n​\nwhich he named the reciprocal spiral. Cotes extended the work of\nVarignon\nwhen he rectified the Archimedean spiral and the parabola of\nApollonius\n, a problem first proposed by\nFermat\n, showing that both have the same integral. His work here was based on the formula\nln\n⁡\n(\ncos\n⁡\nq\n+\ni\nsin\n⁡\nq\n)\n=\ni\nq\n\\ln(\\cos q + i \\sin q) = i q\nln\n(\ncos\nq\n+\ni\nsin\nq\n)\n=\ni\nq\n.\nJones\nurged Cotes to publish his work in the\nPhilosophical Transactions of the Royal Society\n, but Cotes resisted this, wishing to support Cambridge and publish with Cambridge University Press. His early death was to prevent publication in his lifetime.\nCotes discovered an important theorem on the\nn\nn\nn\nth roots of unity, gave the continued fraction expansion of\ne\ne\ne\n, invented radian measure of angles, anticipated the method of least squares, published graphs of tangents and secants, and discovered a method of integrating rational fractions with binomial denominators. His substantial advances in the theory of logarithms, the integral calculus, in numerical methods particularly interpolation and table construction of integrals for eighteen classes of algebraic functions led\nNewton\nto say:-\n... if he had lived we might have known something.\nAccording to Edleston\n[\n3\n]\n, Cotes died of a:-\n... fever attended with a violent diarrhoea and constant delirium.\nHe was buried four days later in the chapel of Trinity College.\nSome of the work which Cotes hoped to publish with Cambridge University Press was published eventually by\nThomas Simpson\nin\nThe Doctrine and Application of Fluxions\n(2\nVols, London,\n1750)\n. Robert Smith edited Cotes' major posthumous work, the\nHarmonia mensurarum\nwhich appeared in\n1722\n. It is fitting at this point to explain who Robert Smith was, and how he interacted with Cotes. In fact he was the son of Cotes' uncle, the Reverend John Smith, and had become friends with Cotes when his uncle had him live in his house as a boy. Later Robert Smith was Cotes' assistant when he was Plumian Professor, and eventually succeeded him as Plumian professor. It was Smith who, many years after Cotes' death, when he was master of Trinity College, had a bust of Cotes erected. This bust, which is shown above, is now in the\nWren\nlibrary.\nLet us return to Cotes' posthumous work the\nHarmonia mensurarum\nⓉ\n(\nHarmony of measurements, or accounts of analysis and synthesis and to promote angular measures, among other works of mathematics\n)\n. As well as reprinting\nLogometria\nit contains the three mathematical works:\n1\n. Aestimatio errorum in mixta mathesis.\nⓉ\n(\nevaluation of error in the varoius areas of mathematics\n)\n2\n. De methodo differentiali Newtoniana.\nⓉ\n(\nNewton's differential method\n)\n3\n. Canonotechnia.\nⓉ\n(\nTechnical rules\n)\nThe first concerns plane and spherical triangles and was much used by astronomers. It contains an early study of the theory of errors. The second develops\nNewton\n's methods of interpolation and was particularly useful in studying orbits of comets. The third work studies numerical integration and also includes further contributions to interpolation.\nIn\n1738\n,\n22\nyears after Cotes died, Smith published the lectures which Cotes had given on experimental physics\nHydrostatical and pneumatical lectures\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}