{
  "nome_completo": "Rolf Herman Nevanlinna",
  "nome_curto": "Rolf Nevanlinna",
  "ano_nascimento": "1895",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nevanlinna/",
  "lugar_nascimento": "Joensuu, Russian Empire (now Finland)",
  "lugar_morte": "Helsinki, Finland",
  "biografia": "Rolf Nevanlinna\n's parents were Otto Wilhelm Neovius and Margarete Romberg who spoke both Swedish and Finnish. Of course this immediately prompts the question of where the name Nevanlinna came from since his father's name was Neovius. In fact Rolf Nevanlinna was known as Rolf Neovius for the first ten years of his life, only becoming Nevanlinna in\n1906\nwhen his father Otto changed the family name. Otto, born in\n1867\n, came from a mathematical family and studied mathematics, physics and astronomy at Helsinki University. After obtaining a doctorate in physics he studied with the astronomer Herman Romberg at Pulkova Observatory and married Romberg's daughter Margarete in\n1892\n. They settled in Joensuu where Otto taught physics, and there their four children were born: Frithiof\n(\nborn\n1894)\n, Rolf\n(\nthe subject of this biography, born\n1895)\n, Anna\n(\nborn\n1896)\nand Erik\n(\nborn\n1901)\n. Frithiof also became a mathematician and he collaborated with Rolf on a number of publications which we mention below.\nIn\n1902\n, at the age of seven, Rolf began his schooling in Joensuu. Having already been taught to read and write at home, he went straight into the second grade but he still found the work boring and after a while he refused to attend the school. He was educated at home for about eighteen months but then, after the family moved to Helsinki when he father was appointed as a teacher, he began attending the school there where his father was now teaching mathematics and physics. At school he learnt French and German to add to the languages he already spoke. The family also had a love for music encouraged by their mother\n[\n12\n]\n:-\nMargarete was an excellent pianist and Frithiof and Rolf would lie under the piano and listen to her playing. At\n13\nthey went to orchestra school and became accomplished musicians - Frithiof on the 'cello and Rolf on the violin. Through free tickets from the orchestra school they got to know and love the music of the great composers, Bach, Beethoven, Brahms, Schubert, Schumann, Chopin and Liszt, as well as the early symphonies of Sibelius\n(1865\n-\n1957)\n, conducted by the composer. Rolf first met Sibelius's music in\n1907\n, when he heard his Third Symphony. Although later he met\nHilbert\n,\nEinstein\n, Thomas Mann and other famous people, Rolf said that none had had such a strong effect on him as Sibelius. The boys played trios with their mother and their love of music - in particular of chamber music - lasted all their lives.\nAt the Helsinki High School Nevanlinna's interests were firstly classics, secondly mathematics. He was taught by a number of excellent teachers, but perhaps the best of them all was his own father who taught him physics and mathematics in his final years at school. He graduated from the school in\n1913\nhaving performed very well although he was not the best student in his year. However he went beyond the school syllabus in the summer of\n1913\nwhen he read\nLindelöf\n's\nIntroduction to Higher Analysis\nbefore beginning his university studies. From that time on he became an enthusiastic analyst working on that topic for the whole of his life.\n(\nErnst Lindelöf\nwas a cousin of Nevanlinna's father and so part of this mathematical family.\n)\nNevanlinna entered Helsinki University in\n1913\n. There he was inspired by\nLindelöf\n's teaching but the beginning of World War I in the following year threatened to disrupt his studies. Finland had been under Russian domination throughout Nevanlinna's life but this domination had increased during the first years of the\n20\nth\ncentury resulting in a strong independence movement within the country. After the war began, the independence movement looked to Germany for support, and young volunteers went to Germany where they received military training and formed the Jägar Battalion. Nevanlinna was keen to go to Germany and join the Jägar Battalion but his parents persuaded him that he should continue with his studies. He avoided being conscripted into the Russian military since he was a rather frail young man and so was able to continue his studies throughout the war years. In fact Helsinki was the scene of a civil war after Finland declared independence from Russia in December\n1917\n. His thesis\nÜber beschränkte Funktionen die in gegebenen Punkten vorgeschriebene Werte annehmen\nⓉ\n(\nOn limited functions prescribed  values at given points\n)\n, presented in\n1919\n, investigates the existence of regular functions satisfying certain fixed conditions. The work exhibits the care and attention to detail which was to typify all his work. He was awarded his doctorate on\n2\nJune\n1919\nand on the same day married his cousin Mary. They had been engaged to marry for two years but they had been friends since\n1911\nwhen Nevanlinna, together with his older brother Frithiof, had returned to Joensuu to remember their childhood there. Rolf and Mary had four children: Kai\n(\nborn\n1920)\n, Harri\n(\nborn\n1922)\n, Aarne\n(\nborn\n1925)\n, and Sylvi\n(\nborn\n1930)\n.\nUniversity posts were not available in Finland in\n1919\nso Nevanlinna became a school teacher. His brother Frithiof worked as a mathematician for the insurance company Salama and, in addition to full time school teaching, Rolf Nevanlinna also worked for Salama. In\n1920\nhe received an invitation from\nEdmund Landau\nto go to Göttingen but he did not accept immediately. He became a lecturer at Helsinki University in\n1922\nbut he did not give up school teaching until he was appointed professor at Helsinki in\n1926\n. Remarkably, despite this heavy workload, it was during these years that he produced what today is called 'Nevanlinna theory'. His working habits may explain this very high output of work. These are described in\n[\n12\n]\nas follows:-\nRolf never needed much sleep. In the late\n1930\n's he used to rise at\n4\n, join his family at\n10\ntill lunch time, then work again till\n7\n, and spend the evening with his family.\nOlli Lehto\n, who was a student of Nevanlinna, describes the birth of Nevanlinna theory in\n[\n20\n]\n.\nWalter Hayman\n, in a review, gives a summary of\nLehto\n's paper which:-\n... gives a most interesting account of the beginnings of value distribution theory. He starts with the construction by\nWeierstrass\nof an\nentire function\nwith a preassigned sequence of zeros, the introduction by\nLaguerre\nof the genus and the results by\nPoincaré\nand\nHadamard\non the link between the exponent of convergence of the zeros and the order of the function which had first been defined by\nBorel\n.\nBorel\nalso proved the extension of\nPicard\n's theorem which states that the exponent of convergence of the a-points of any entire function is equal to its order except for at most one value of a. This was the situation before Nevanlinna introduced his characteristic which not only extended the theory to meromorphic functions but also obtained a much more precise formulation of the results even in the special case of entire functions by means of his first and second fundamental theorems and the deficiency relation. The development proceeded in the\n1920\n's ... through R Nevanlinna's successive papers culminating in the monograph 'Le Théorème de Picard-Borel et la théorie des fonctions méromorphes'\nⓉ\n(\nThe theorem of Picard-Borel and the theory of functions meromorphic\n)\n(1929)\n.\nThe main results of Nevanlinna theory appeared in the\n100\npage paper\nZur Theorie der meromorphen Funktionen\nⓉ\n(\nOn the theory of meromorphic functions\n)\nin\n1925\n. This paper was described by\nWeyl\nas one of the few great mathematical events of the twentieth century. To illustrate Nevanlinna's remarkable output, we note that this\n100\npage paper was one of eight papers he published in\n1925\n, with thirteen papers having been published in the preceding three years. It is even more amazing when we realise that this huge output was achieved during years when he was working both as a school teacher and as a university lecturer.\nNevanlinna remained on the staff at the University of Helsinki for the rest of his life except for extensive travels he made to many different countries. Perhaps his enthusiasm for meeting other mathematicians was fired by his attendance at the\n5\nth\nScandinavian Mathematical Congress at Helsinki in\n1922\n. There he met\nMittag-Leffler\nfor the first time - he had been professor in Helsinki for five years, long before Nevanlinna was born. He also met, among others,\nHarald Bohr\n,\nNiels Bohr\n,\nTorsten Carleman\nand\nHarald Cramér\n. His first visit abroad was to belatedly accept\nEdmund Landau\n's invitation to go to Göttingen which he did in\n1924\n. In addition to Landau he met\nHilbert\n,\nCourant\nand\nEmmy Noether\nin Göttingen and, while in Germany he also met\nPavel Sergeevich Aleksandrov\n,\nPavel Samuilovich Urysohn\n, and\nConstantin Carathéodory\nin Munich. Later visits included one to Paris in\n1926\nwhere he met\nHadamard\n,\nMontel\nand he also visited\nAndré Bloch\nin a mental hospital. He met A Speiser in Zürich when he visited there in\n1928\nand became interested in classification problems of\nRiemann\nsurfaces. Two years later Nevanlinna was offered\nWeyl\n's chair after he had left Zürich to take up the chair at Göttingen, but Nevanlinna refused the chair. It was through the second half of the\n1920\ns that\nLars Ahlfors\nstudied with Nevanlinna, obtaining his doctorate in\n1930\n, and he had accompanied his thesis advisor on the trip to Zürich.\nAhlfors\n's proof of the\nDenjoy\nConjecture, which led to him being awarded a\nFields Medal\nin\n1936\n, followed suggestions made by Nevanlinna while in Zürich. The geometric ideas marked a new element in Nevanlinna's research and is evident in papers he published in the early\n1930\ns. They are set out in detail in his the book\nEindeutige analytische Funktionen\nⓉ\n(\nUnique analytic functions\n)\n(1936)\nwhich discusses ideas related to his invention of harmonic measure.\nHayman\nwrites that this book\n[\n12\n]\n:-\n... has inspired function theorists ever since it was written and which, like most of the later books, has been translated into Russian and English as well as having several German editions.\nHe continued to work at Helsinki, but also continued his love for research visits, spending\n1936\n-\n37\nas a visiting professor at Göttingen. Returning to Finland, Nevanlinna and his wife Mary bought a summer home in Lohja, about\n45\nkm west of Helsinki, in\n1937\nand this became a place where many visiting mathematicians spent time during the summers. He became rector of the University of Helsinki in\n1941\n, retaining this position for the duration of World War II. During the war he contributed to the war effort by improving ballistic tables and was awarded the Cross of Liberty.\nFrom his student days when he had wanted German help to free Finland of Russian domination, Nevanlinna was known to have German links. After the defeat of Germany in\n1945\n, the authorities at Helsinki University felt that it would be inappropriate to have a rector who was known to have German sympathies so he was asked to resign from that role. He retained his chair at Helsinki, however, but in October\n1946\nhe again visited Zürich. This marks the beginning of a fifteen year period during which he was a guest lecturer in Zürich, a period which is described in detail in\n[\n7\n]\n. Lecture courses which Nevanlinna gave in Zürich and in Helsinki formed the basis for his book\nUniformisierung\nⓉ\n(\nUniformity\n)\n(1953)\n. M Heins begins a detailed review of the book with the following paragraph:-\nSince the appearance of\nWeyl\n's celebrated 'Idee der Riemannschen Fläche'\nⓉ\n(\nThe idea of the Riemann surface '\n)\n(1913)\nthe theory of abstract\nRiemann\nsurfaces has experienced a considerable development, especially in the last quarter of a century. In spite of this fact, apart from the monograph of\nStoilow\n, very little has appeared on this subject in book form up to the present. The treatise of Nevanlinna, which is based upon his lectures at Zürich and Helsinki, is the first of a new generation of books to appear on the subject. The objective of the author is to provide an introduction to the theory of abstract\nRiemann\nsurfaces with uniformization theory being the focal point of interest.\nAfter World War II, during his association with Zürich, his mathematical interests moved to the calculus of variations and applications to physics. For example he wrote the paper\nCalculus of variation and partial differential equations\n(1967)\n.\nThroughout his life Nevanlinna took an active part role in musical events. It was while he was setting up a chamber music society in\n1945\nthat he met the author and translator Sinikka Kallio-Visapaa. After his first marriage had been dissolved, he married Sinikka in\n1958\n. They had a daughter Kristiina.\nWe have already mentioned the mathematical collaboration between Rolf Nevanlinna and his brother Frithiof.\nWalter Hayman\nwrites of their collaboration in the\n1920\ns\n[\n12\n]\n:-\nEvenings and Sundays were excellent times for research, and Nevanlinna theory was greatly influenced by Rolf's discussions with Frithiof, which continued all their lives. They would walk up and down each side of a big square, talking mathematics.\nThey wrote papers together, for example:\nÜber die Eigenschaften analytischer Funktionen in der Umgebung einer singulären Stelle oder Linie\nⓉ\n(\nOn the properties of analytic functions in the vicinity of a singular point or line\n)\n(1922)\n,\nÜber die Nullstellen der Riemannschen Zetafunktion\nⓉ\n(\nOn the zeros of the Riemann zeta function\n)\n(1924)\n, and\nÜber die Nullstellen der Riemannschen Zetafunktion\nⓉ\n(\nOn the zeros of the Riemann zeta function\n)\n(1925)\n. Years later, they also collaborated in writing the book\nAbsolute analysis\n(1959)\n. An English translation was published in\n1973\n. Nevanlinna coauthored the book\nEinführung in die Funktionentheorie\nⓉ\n(\nIntroduction to the Theory of Functions\n)\n(1965)\nwith V Paatero. A J Lohwater begins a review:-\nThis book is a masterful account of the traditional first course in complex variables given at Helsinki University, and reflects in its first seven chapters the influence of\nE Lindelöf\n's introductory text.\nAs well as his textbooks and monographs, Nevanlinna published two books and over fifty articles which were intended to introduce mathematical ideas to non-mathematicians. One such example is his book\nRaum, Zeit und Relativität\nⓉ\n(\nSpace, time and relativity\n)\n(1964)\n. An example of his ideas on teaching mathematics, which became of considerable interest to him, is given in his paper\nReform in teaching mathematics\n(1966)\n.\nNevanlinna received many honours for his contributions. He was awarded the International Wihuri Prize for Scientists and Artists\n(1958)\nand the Henrik Steffens Prize for Nordic culture\n(1967)\n. He was made an honorary member of the Deutsche Akademie\n(1938)\n; the\nFinnish Mathematical Society\n(1955)\n; the\nLondon Mathematical Society\n(1959)\n; the\nSwiss Mathematical Society\n(1962)\n; the Society of Actuaries of Finland\n(1965)\n; the Teachers of Mathematics and Physics\n(1965)\n; the\nGöttingen Academy of Sciences\n(1967)\n; the\nRoyal Swedish Academy of Sciences\n(1967)\n; the\nDanish Academy of Sciences\n(1967)\n; the\nGerman Academy of Scientists Leopoldina\n(1967)\n; the\nHungarian Academy of Sciences\n(1970)\n; the Institut de France\n(1967)\n; and the\nFinnish Academy of Science and Letters\n(1975)\n. He was awarded honorary degrees by the universities of Heidelberg\n(1936)\n, Bucharest\n(1942)\n, Giessen\n(1952)\n, Berlin\n(1955)\n, Jyväskylä\n(1969)\n, Glasgow\n(1969)\n, Uppsala\n(1974)\nand Istanbul\n(1976)\n. He was president of the\nInternational Mathematical Union\nfrom\n1959\nto\n1962\n.\nNevanlinna continued to publish papers right up to the time of his death in\n1980\nfrom cancer. Since\n1982\n, an award, the Rolf Nevanlinna Prize, is presented at the International Congress of Mathematicians. The one prize per congress is for young mathematicians dealing with the mathematical aspects of information science.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}