{
  "nome_completo": "Rolin-Louis Wavre",
  "nome_curto": "Rolin Wavre",
  "ano_nascimento": "1896",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wavre/",
  "lugar_nascimento": "Neuchâtel, Switzerland",
  "lugar_morte": "Geneva, Switzerland",
  "biografia": "Rolin Wavre\nwas the son of William Wavre\n(1851\n-\n1909)\nand Marie Jeanjaquet\n(1855\n-\n1949)\n. William Wavre was born in Neuchâtel on\n17\nJune\n1851\n, the seventh of his parents' eleven children, and after attending College and the Academy in his hometown, he studied philology and archaeology at the universities of Bonn, Leipzig and Strasbourg. Returning to Neuchâtel, he was appointed as a master in the Latin College in\n1878\n. In addition he was soon also a professor of archaeology at the Neuchâtel Academy and curator of the Archaeological Museum. On Tuesday\n15\nOctober\n1878\nhe married Marie Jeanjaquet and they had eight children: Madeleine Wavre\n(1880\n-\n1972)\n, Claude Wavre\n(1880\n-\n1891)\n, Robert Blaise Alphonse Wavre\n(1882\n-\n1967)\nwho became an engineer, Anne Wavre\n(1883\n-\n1963)\n, Philippe Wavre\n(1884\n-\n1953)\n, Frédéric André Wavre\n(1886\n-\n1963)\nwho became a notary, Hélène Elisa Wavre\n(1888\n-\n1967)\n, and Rolin Wavre\n(1896\n-\n1949)\n, the subject of this biography. We note from this data that Rolin's eldest sibling was\n16\nyears old when he was born and the youngest of his siblings was\n8\nyears old.\nWilliam Wavre was involved with the archaeological dig of La Tène, which lies on Lake Neuchâtel, where the many finds appear to be associated with an army defeated around\n210\nB.C. The 'Commission des fouilles de La Tène' was created and William Wavre directed excavations at La Tène from\n1907\nuntil his death two years later.\nRolin Wavre studied at the Gymnasium in Neuchâtel where he was enthusiastic for mathematics and science, topics in which he excelled. After graduating, he studied at the University of Neuchâtel where he was taught by Arnold Reymond\n(1874\n-\n1958)\n. Reymond  was a philosopher who had been awarded a doctorate from the University of Geneva in\n1908\nfor his thesis\nLogique et mathématiques: essai historique et critique sur le nombre infini\nⓉ\n(\nLogic and mathematics: historical and critical essay on the infinite number\n)\n. He taught at the University of Neuchâtel from\n1912\nto\n1925\n. Wavre spoke of his gratitude to Reymond:-\nHis books make me feel, not without some emotion, the privilege I had to be his pupil.\nLeaving the University of Neuchâtel in\n1916\nhe went to Paris and entered the Sorbonne studying both there and at the Collège de France. He participated in\nJacques Hadamard\n's seminar and, in addition to his mathematical studies, he attended philosophy lectures, particularly those by the famous Léon Brunschvicg\n(1869\n-\n1944)\n. Brunschvicg had been appointed as professor of philosophy at the Sorbonne in\n1909\n. We should note that one of his interests was the philosophy of mathematics, and his study of the work of\nFrege\nand\nRussell\nmade their work known to French philosophers. In\n1917\nGustave Juvet\n(1896\n-\n1936)\n, a mathematician and philosopher from Neuchâtel who knew Wavre well, arrived in Paris to study at the Sorbonne. Wavre had already spent a year in Paris and introduced Juvet into Parisian scientific circles. Wavre graduated in\n1918\nwith a diploma of licencié ès sciences.\nAfter graduating from Paris, Wavre returned to Switzerland where he undertook research for his doctorate at the University of Geneva. He began publishing papers:\nSur les développements d'une fonction analytique en série de polynômes\nⓉ\n(\nOn the development of an analytical function in series of polynomials\n)\n(1920)\n,\nSur l'équation fonctionnelle\nf\n[\nΔ\n1\n(\nt\n)\n]\n=\nf\n[\nΔ\n2\n(\nt\n)\n]\nf[\\Delta _{1}(t)] = f[\\Delta _{2}(t)]\nf\n[\nΔ\n1\n​\n(\nt\n)\n]\n=\nf\n[\nΔ\n2\n​\n(\nt\n)\n]\nⓉ\n(\nOn the functional equation ...\n)\n(1920)\n,\nUn système d'équations à une infinité d'inconnues\nⓉ\n(\nA system of equations with an infinity of unknowns\n)\n(1920)\n,\nSur les développements de Mittag-Leffler\nⓉ\n(\nOn the developments of Mittag-Leffler\n)\n(1920)\n,\nSur l'équation de Fredholm et l'intégrale de Cauchy\nⓉ\n(\nOn the Fredholm equation and the Cauchy integral\n)\n(1920)\n, and\nSur une équation de Fredholm dans le domaine complexe et son application à la théorie des systèmes d'équations linéaires à une infinité d'inconnues\nⓉ\n(\nOn a Fredholm equation in the complex domain and its application to the theory of systems of linear equations to an infinity of unknowns\n)\n(1921)\n. The paper\nUn système d'équations à une infinité d'inconnues\nⓉ\n(\nA system of equations with an infinity of unknowns\n)\nwas presented to the International Congress of Mathematicians held in Strasbourg from\n22\nSeptember to\n30\nSeptember\n1920\nand published in the Proceedings of the Congress.\nGeorges Tiercy writes in\n[\n3\n]\n:-\n[\nI\n]\ngot to know Rolin Wavre at the general meeting of the Swiss Society of Natural Sciences, held in Neuchâtel in the summer of\n1921\n; the young graduate of Paris presented before the mathematics section a communication entitled \"A propos du problème de la médiane à une courbe fermée plane\"\nⓉ\n(\nOn the problem of the median to a flat closed curve.\n)\n, which provoked an animated debate; this was proof that the young scientist from Neuchâtel had the makings of a great mathematician. The events which followed showed this to be the case.\nWavre was awarded his doctorate in\n1921\nby the University of Geneva for his\n40\n-page thesis\nSur quelques propriétés des suites de fonctions continues réelles et l'équation fonctionnelle\nf[\\Delta _{1}(t)] = f[\\Delta _{2}(t)]\nⓉ\n(\nOn some properties of sequences of real continuous functions and the functional equation ...\n)\n. Following this, he was appointed as a\ndocent\nat the University of Geneva in\n1921\n. About this time the professor of mathematics at the University of Geneva,\nCharles Cailler\n, had to retire through ill health. This created a difficult period for the Faculty of Sciences which worsened in January\n1922\nwhen\nCailler\ndied. Wavre was appointed as an extraordinary professor of differential and integral calculus and rational mechanics on\n18\nJuly\n1922\n. He delivered his inaugural lecture\nL'oeuvre scientifique de Charles Cailler\nⓉ\n(\nThe scientific work of Charles Cailler\n)\n. Here is a quote from the lecture\n[\n6\n]\n:-\nFor those who are not mathematicians or beginners, the theorems, the functions of which I have just spoken, are perhaps only names. The layman sees only the game of an intelligence that likes to have fun with itself. The beginner only feels a magic charm and bows to the mysterious mystery of all these fictions. But soon, for those with a mathematical mind, these fictions take shape, they form a whole whose contemplation is the source of the purest intellectual enjoyments.\nHenri Reverdin recalls a meeting with Wavre in June\n1922\n[\n2\n]\n:-\nAt the seventeenth of our annual meetings, due to a very happy initiative of Jean-Jacques Gourd, we had just founded the French-speaking society of philosophy. It was\n14\nJune\n1923\n. We were sitting in Rolle château in the courtroom. Rolin Wavre was sitting with his friends Jean de la Harpe, Jean Piaget and Leon Bopp near the wall facing the lake. It was the first time that this tall Neuchâtelois appeared among us, whose face with its beautiful features was ennobled by a profound and magnificent look. Like other \"young people\", he urged the fledgling society to create \"sections\" in our three academic centres, in Geneva, Lausanne and Neuchâtel, where philosophers, theologians, humanists and scientists would work together throughout the semesters.\nLet us note that his friend Jean de la Harpe\n(1892\n-\n1947)\nwas a philosopher who, like Wavre, had been taught by Arnold Reymond and Léon Brunschvicg. Jean Piaget\n(1896\n-\n1980)\nwas a psychologist who had, like Wavre, been born in Neuchâtel. He had been appointed as director of the Rousseau Institute in Geneva in\n1921\n. Leon Bopp\n(1896\n-\n1977)\nwas a novelist and philosopher born at La-Chaux-de-Fonds, less than\n20\nkm from Neuchâtel. He was educated at the University of Geneva and at the Sorbonne.\nWavre became an ordinary professor of mathematics at the University of Geneva on\n11\nJuly\n1934\n.\nIn\n1924\nhe published the\n36\n-page article\nY a-t-il une crise des mathématiques? A propos de la notion d'existence et d'une application suspecte du principe du tiers exclu\nⓉ\n(\nIs there a maths crisis? About the notion of existence and a suspicious application of the principle of the excluded middle\n)\n. It is not difficult to see how the questions that Wavre considered in this paper came to interest him since he had been taught by Arnold Reymond and Léon Brunschvicg, two outstanding teachers of the philosophy of mathematics. A summarised translation into English of this article by Alice Ambrose was published in the\nAmerican Mathematical Monthly\nin\n1934\nwith the title\nIs There A Crisis in Mathematics? With reference to the notion of existence and a doubtful application of the law of the excluded middle\n[\n5\n]\n. We give a version at\nTHIS LINK\n.\nFrom the evidence we have from Wavre's papers, for which we gave titles above, and this work on the foundations of mathematics we might suppose that he is a pure mathematician with broad interests. His next two papers, however, show that he had interests in geology. These papers are\nSur la force qui tendrait à rapprocher un continent de l'équateur\nⓉ\n(\nOn the force that would tend to bring a continent closer to the equator\n)\n(1925)\nand\nSur le mouvement de deux sphères concentriques à propos d'une hypothèse géologique\nⓉ\n(\nOn the movement of two concentric spheres relevant to a geological hypothesis\n)\n(1925)\n. In his paper on continental drift, Wavre shows that a hypothesis put forward by Alfred Wegener that the drift is caused by the force created by the Earth's rotation cannot be correct since the force from the Earth's rotation is extremely weak, and certainly not sufficient to bring about the formation of great mountain ranges. Wavre was certainly friendly with another early believer in continental drift, namely Émile Argand\n(1879\n-\n1940)\n, a Swiss geologist who founded the Geological Institute in Neuchâtel.\nThere were other areas to which Wavre contributed major works, namely astronomy and mathematical physics. In astronomy he published numerous articles beginning in\n1926\nwith papers such as\nSur les mouvements internes des planètes\nⓉ\n(\nOn the internal movements of the planets\n)\nand\nSur les mouvements internes et la stratification des corps célestes\nⓉ\n(\nOn the internal movements and the stratification of the celestial bodies\n)\n. He combined his many papers on geology and astronomy in the book\nFigures planetaires et geodesie\nⓉ\n(\nPlanetary figures and geodesy\n)\n(1932)\n. The importance of this work can be seen immediately from the Preface to the work written by\nJacques Hadamard\n. Willi Rinow writes in the review Zbl\n0005\n.\n31602\n:-\nIn this book, the author gives a comprehensive and detailed account of his investigations into the shape of the celestial bodies published in numerous smaller and larger works. The method of the author consists in the development of the potential according to spherical functions. ... It is not the author's ambition to write an all-inclusive textbook. Rather, this book represents a valuable addition to existing textbooks. Content overlaps with the well-known works on the theory of equilibrium figures hardly take place.\nIn mathematical physics, Wave published works on fluids such as\nSur l'équilibre relatif d'une masse fluide\nⓉ\n(\nOn the relative equilibrium of a fluid mass\n)\n(1926)\nand\nQuelques propriétés des figures d'équilibre d'une masse fluide hétérogène\nⓉ\n(\nSome properties of pquilibrium figures of a heterogeneous fluid mass\n)\n(1929)\n. These were, however, closely connected to his work in astronomy for he considered rapidly rotating stars. Here he proved a fundamental theorem which today is known as the\nPoincaré\n-Wavre theorem. Wavre begins\nPlanetary Figures and Poincaré Problem\nwith the following:-\nWe would like to draw the attention of mathematicians to a problem that is a little neglected today, because it relates to\nNewton\n's field, that of the equilibrium figures of a heterogeneous fluid mass. It retains all its physical interest since, in the case of the Earth,\nEinstein\n's corrections would be very weak, and it keeps above all its captivating aspect from a mathematical point of view. We present here, in a very concise form, a method which satisfies a desideratum formulated by\nTisserand\n, which provides the common thread for classifying the classical results and obtaining others. In particular, this process removes the well-known disagreement reported by\nPoincaré\nbetween geodesy and the theory of procession. The illustrious scientist had only criticized the first approximation. The second reduces the gap considerably.\nWavre was a plenary speaker at the International Congress of Mathematicians held in Zurich from\n5\nSeptember to\n12\nSeptember\n1932\n. His lecture was entitled\nL'aspect analytique du problème des figures planétaires\nⓉ\n(\nThe analytical aspect of the problem of planetary figures\n)\n. Discussing Wavre's work on mathematical physics, Georges Tiercy writes in\n[\n3\n]\n:-\nIt must be noted that in these fields of physics, the researcher is nowadays less and less free in his activities, or rather in his ideas; he must or should take into account more and more details; if he neglects some of them, perhaps because he knows them badly, the model he gives of natural phenomena is not satisfactory. I think Rolin Wavre was measuring this difficulty; we have often discussed it together. It was fitting that, in every application of mathematics to natural facts, we must confine ourselves to the relative; no absolute; the mathematician will often have to admit reasons of good sense or intuition; and, in any case, he does not have the right, in order to facilitate his task, to neglect part of the data, even if these are apparently of minimal numerical importance. Should we see in these remarks the reason for the reservation of Wavre with regard to the problems of relativity?\nGeorges Tiercy also writes about Wavre's teaching in\n[\n3\n]\n:-\nRolin Wavre combined the qualities of the teacher with those of the scientist; any problem analysed by him became simple, at least in appearance. He sought to present to his students the classical results in an elegant form, and if possible often in a new way. And there was humour in his presentations. For those of his students who themselves possessed qualities of researchers, what a devoted advisor he was and particularly for students whose theses he directed! In connection with his teaching, we must mention the organization which he chaired for several years, the \"Colloques internationaux de mathématiques\" at Geneva, which has met with undeniable success, and which would be sufficient by itself to permanently sustain his memory.\nReverdin writes in\n[\n2\n]\nabout these Colloquia:-\nIn\n1933\nhe had the good idea to organize the \"Colloques internationaux de mathématiques\" at Geneva; he invited the most famous specialists to come together to discuss the problems of analysis, mechanics, topology, and probability theory. What a joy for us to see him then surrounded by his peers, and to feel that by his distinction, his charm, his driving ardour, he animated these meetings. It was for him, after months of steps and preparation, beautiful days of intellectual and moral fullness.\nDuring the years of World War II he did military service but discovered that it was too tiring and that he had serious health problems with a weak heart. Reverdin writes in\n[\n2\n]\nthat it was a:-\n... sudden, agonizing, terrible revelation ... How would he succeed in curbing his ardour, he, the intrepid climber and the enthusiastic skier, the hard worker, the university professor magnificently devoted to all his duties, the great independent who suddenly started driving his car and escaped into the beautiful countryside with vast horizons? What sacrifices did he have to accept, one after the other. He did it with courage, discreetly; but his eyes sometimes expressed what his lips wanted to keep quiet! When he had given up evening outings, we did not see him at meetings of our Geneva section, and last year he did not come to the meeting in Rolle château.\nIn\n1948\nWavre, however published the book\nL'imagination du réel. L'invention et la découverte dans la science des nombres\nⓉ\n(\nThe imagination of the real. The invention and discovery in the science of numbers\n)\n. He dedicated the book to his friend Jean de la Harpe who had died in the previous year. Reverdin writes in\n[\n2\n]\n:-\nWith what clarity he presents the most difficult theories, with what mastery he explains, compares and appreciates them! Admirable teacher for his students, he likes to enlighten the cultured public by putting at his service all the resources of his mind, his gifts as a writer, his polemical malice\n(\nwhich is sometimes a little more than malicious\n)\nand his kindness; by courtesy, he spares his readers any effort that is not indispensable; exposing the most bare bones of the concepts in any \"representation\", he shows how to recall again concrete data; he invents comparisons of all kinds, to make us smile - or laugh - to charm us, suddenly surprise us, even move us, and always to help us understand.\nHis health, however, made it impossible for him to continue his academic activities\n[\n2\n]\n:-\nIn September\n1949\n, when the Fourth Congress of French-speaking Philosophical Societies gathered in Neuchâtel, his own city, so many philosophers and scholars who, in Switzerland, France, Belgium, loved to surround him and praise him, he was at Chaumont. Would he come down to join us? He could not. But we knew how much he had regretted his absence. For two more months, the illness worsened: he was still working. One winter's evening, one of his brothers, our colleague M Philippe Wavre, who had come hastily to Geneva, told me that his condition had suddenly become worse; the next morning,\n9\nDecember\n1949\n, we lost him.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}