{
  "nome_completo": "Rudolf Emil Kalman",
  "nome_curto": "Rudolf Kalman",
  "ano_nascimento": "1930",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kalman/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Gainesville, Florida, USA",
  "biografia": "Rudolf Kalman\nemigrated to the United States where he studied electrical engineering at the Massachusetts Institute of Technology. He was awarded a S.B. in\n1953\n, and continued to undertake graduate studies there leading to a S.M. in\n1954\n. For his doctoral work he went to Columbia University in New York City where he was advised by John Ralph Ragazzini. He was appointed as an Instructor in Control Theory at Columbia University in\n1955\nand promoted to Adjunct Assistant Professor in\n1957\n. He submitted his doctoral thesis\nAnalysis and Synthesis of Linear Systems Operating on Randomly Sampled Data\nin\n1958\nand was awarded a D.Sci. in that year.\nBefore the award of his doctorate Kalman had begun to publish influential papers. For example in\nPhysical and mathematical mechanisms of instability in nonlinear automatic control systems\n(1959)\nhe gives\n(\nquoting from a review by Horace Trent\n)\n:-\n... a lucid discussion of the stability problem for control systems containing one or more nonlinear elements. It is written in a style which appeals equally to advanced design engineers and to research workers who deal with the theory of such systems. The discussion is limited to those systems which can be treated as if they were made up of a finite number of \"lumped\" parts with time invariant parameters. Thus, such a system can be described by a finite number of simultaneous ordinary differential equations. The author exploits the topological approach to an analysis of non-linear systems; i.e., he examines the nature of trajectories in phase space as generated by variations of inputs, variation of initial conditions, etc., and from these results deduces quantitative information about the possible existence of nodes, foci, and saddle points. During these analyses he makes use of the method of virtual critical points. One of the main goals of the paper is to propose a classification of the types of nonlinearities which can give rise to instabilities.\nAfter the award of his doctorate Kalman was appointed as a Research Mathematician at the Research Institute for Advanced Studies in Baltimore, Maryland. He worked there from\n1958\nto\n1964\nand during this time he produced some results of outstanding importance. For example there are three papers he wrote jointly with J E Bertram:\nA unified approach to the theory of sampling systems\n(1959)\n;\nControl system analysis and design via the \"second method\" of Lyapunov.\nI\n. Continuous-time systems\n(1960)\n; and\nControl system analysis and design via the \"second method\" of Lyapunov.\nII\n. Discrete-time systems\n(1960)\n.\nThere are also the three papers\nA new approach to linear filtering and prediction problems\n(1960)\n,\nMathematical description of linear dynamical systems\n(1963)\nand\n(\nwith Richard S Bucy\n)\nNew results in linear filtering and prediction theory\n(1961)\n. The authors summarise this last mention paper as follows:-\nA nonlinear differential equation of the\nRiccati\ntype is derived for the covariance matrix of the optimal filtering error. The solution of this 'variance equation' completely specifies the optimal filter for either finite or infinite smoothing intervals and stationary or non-stationary statistics. The variance equation is closely related to the Hamiltonian\n(\ncanonical\n)\ndifferential equations of the calculus of variations. Analytic solutions are available in some cases. The significance of the variance equation is illustrated by examples which duplicate, simplify, or extend earlier results in this field. The duality principle relating stochastic estimation and deterministic control problems plays an important role in the proof of theoretical results. In several examples, the estimation problem and its dual are discussed side-by-side. Properties of the variance equation are of great interest in the theory of adaptive systems. Some aspects of this are considered briefly.\nNow we have linked these last-mentioned three papers since they \"proved to be of fundamental or lasting importance in their field\" and as such were awarded the\n1986\nSteele Prize by the\nAmerican Mathematical Society\n. The citation reads\n[\n2\n]\n:-\nThe ideas presented in these papers are a cornerstone of the modern theory and practice of systems and control. Not only have they led to eminently useful developments, such as the Kalman-Bucy filter, but they have contributed to the rapid progress of systems theory, which today draws upon mathematics ranging from differential equations to\nalgebraic geometry\n.\nKalman was not present at the\n93\nrd\nAmerican Mathematical Society\nAnnual meeting in San Antonio, Texas, to receive the Prize but his response, attempting to explain the significance of the papers, was read at the meeting. His response begins as follows\n[\n2\n]\n:-\nI have been aware from the outset\n(\nend of January\n1959\n, the birthdate of the second paper in the citation\n)\nthat the deep analysis of something which is now called Kalman filtering were of major importance. But even with this immodesty I did not quite anticipate all the reactions to this work. Up to now there have been some\n1000\nrelated publications, at least two Citation Classics, etc. There is something to be explained.\nRead a fuller report of Kalman's\n1986\nresponse to the award of the Steele Prize at\nTHIS LINK\n.\nLet us return to giving details of Kalman's career. He left the Research Institute for Advanced Studies in Baltimore, Maryland, in\n1964\nto take up the position of Professor at Stanford University covering engineering mechanics, electrical engineering, and mathematical system theory. In\n1971\nhe moved to the University of Florida, Gainesville, where he was Graduate Research Professor jointly in the Departments of Mathematics, Electrical Engineering, and Industrial and Systems Engineering, and Director of the Center for Mathematical System Theory. Two years later, while continuing to hold these positions at the University of Florida, he also became a Professor at the Eidgenössische Technische Hochschule in Zürich. Kalman retired from his positions at the University of Florida in\n1992\n(\nwhen he became Professor Emeritus\n)\nand from the Eidgenössische Technische Hochschule in Zürich in\n1997\n.\nWe have looked at some of the important papers Kalman wrote in the early part of his career. To get a fuller overview of his contributions we quote from Eduardo Sontag and Yutaka Yamamoto, both former doctoral students of Kalman at Florida University\n(\nbeing awarded their doctorates in\n1976\nand\n1978\nrespectively\n)\n[\n5\n]\n:-\nDuring the\n1960\ns, Kalman was the leader in the development of a rigorous theory of control systems. Among his many outstanding contributions were the formulation and study of most fundamental state-space notions\n(\nincluding controllability, observability, minimality, realizability from input/output data, matrix\nRiccati\nequations, linear-quadratic control, and the separation principle\n)\nthat are today ubiquitous in control. While some of these concepts were also encountered in other contexts, such as optimal control theory, it was Kalman who recognized the central role that they play in systems analysis. The paradigms formulated by Kalman and the basic results he established have become an intrinsic part of the foundations of control and systems theory and are standard tools in research as well as in every exposition of the area, from undergraduate engineering textbooks to graduate-level mathematics research monographs. During the\n1970\ns Kalman played a major role in the introduction of algebraic and geometric techniques in the study of linear and nonlinear control systems. His work since the\n1980\ns has focused on a system-theoretic approach to the foundations of statistics, econometric modelling, and identification, as a natural complement to his earlier studies of minimality and realizability.\nIn addition to many research papers, Kalman has jointly authored the book\nTopics in mathematical system theory\n(1969)\nwith Peter L Falb and Michael A Arbib. The authors write in the Preface:-\nThis book does not pretend to be a systematic treatise. Rather, it aims to present a mathematical system theory as it is today - a lively, challenging, exciting, difficult, confused, rewarding, and largely unexplored field. Each of the four sections of the book is independent. No attempt has been made to eliminate duplications; there is no standardized notation.\nWe mentioned above that Kalman received the Steele Prize in\n1986\n. This was one of many prizes and awards that were made to him as a consequence of his outstanding, innovative contributions. In addition to the Steele Prize he received the Institute of Electrical and Electronics Engineers' Medal of Honor in\n1974\n, the Institute of Electrical and Electronics Engineers' Centennial Medal in\n1984\n, and the Inamori Foundation's Kyoto Prize in High Technology in\n1985\nas:-\n... the creator of modern control and system theory. Kalman theory, which was established in the early\n1960\ns, brought a fundamental reformation to control engineering and since then laid the foundation for the rapid progress of modern control theory.\nHe also received the Richard E Bellman Control Heritage Award in\n1997\n, and the National Academy of Engineering's Charles Stark Draper Prize in\n2008\n:-\n... for the development and dissemination of the optimal digital technique\n(\nknown as the Kalman Filter\n)\nthat is pervasively used to control a vast array of consumer, health, commercial, and defense products.\nOn\n7\nOctober\n2009\nU.S. President Barack Obama honoured Kalman in an awards ceremony at the White House when he presented him with the National Medal of Science, the highest honour the United States can give for scientific achievement. Eduardo Sontag explained the significance of Kalman filtering in\n[\n4\n]\n:-\nAmong Kalman's early work was the development of what is now called the Kalman filter for detection of signals in noise. This revolutionized the field of estimation, by providing a recursive approach to the filtering problem. Before the advent of the Kalman filter, most mathematical work was based on\nNorbert Wiener\n's ideas, but the '\nWiener\nfiltering' had proved difficult to apply. Kalman's approach, based on the use of state space techniques and a recursive least-squares algorithm, opened up many new theoretical and practical possibilities. The impact of Kalman filtering on all areas of applied mathematics, engineering, and sciences has been tremendous. It is impossible to even begin to enumerate its practical applications. Just as examples of their diversity, one may mention the guidance of the Apollo spacecraft and of commercial airplanes, uses in seismic data processing, nuclear power plant instrumentation, and demographic models, as well as applications in econometrics.\nIn addition to the above mentioned honours, he has been elected to the\nNational Academy of Sciences\nof the United States, the American National Academy of Engineering, the\nAmerican Academy of Arts and Sciences\n, the\nHungarian Academy of Sciences\n, the\nAcadémie des Sciences\n, and the\nUSSR Academy of Sciences\n.\nKalman's ideas on statistics are thought-provoking and he has written a number of interesting articles on this topic since retiring. For example he gave an informal lecture published as\nProbability and science\n(1993)\nin which he\n(\nquoting from a review by Zeno G Swijtink\n)\n:-\n... laments the explosive growth of applications of\nprobability\nafter World War II, and questions whether probabilities exist in the real world. Randomness does, and to capture it better he proposes a new definition: random is not uniquely determined by simple classical rules. All irrational numbers are said to be random under this definition, as are most \"\n3\nx +\n1\n\" maps. The absence of interaction between chaos theorists and probability theorists also shows, the author concludes, how irrelevant the classical models of probability are to the real world.\nIn\n1995\nhe published\nRandomness and probability\n, and in\n2002\na discussion on\nWhat Is a Statistical Model?\nHe believes that\n[\n3\n]\n:-\n... the currently accepted notion of a statistical model is not scientific; rather, it is a guess at what might constitute\n(\nscientific\n)\nreality without the vital element of feedback, that is, without checking the hypothesized, postulated, wished-for, natural-looking\n(\nbut in fact only guessed\n)\nmodel against that reality. To be blunt, as far as is known today, there is no such thing as a concrete i.i.d.\n(\nindependent, identically distributed\n)\nprocess, not because this is not desirable, nice, or even beautiful, but because Nature does not seem to be like that.\n(\nHistorical aside: recall that physicists had thought at one time that aether was such a necessary, unavoidable, appealing, clear and beautiful concept that it must perforce exist; alas, all physicists now living had to learn that such argumentation cannot lead to good science.\n)\nAs\nBertrand Russell\nput it at the end of his long life devoted to philosophy, \"Roughly speaking, what we know is science and what we don't know is philosophy.\" In the scientific context, but perhaps not in the applied area, I fear statistical modelling today belongs to the realm of philosophy.\nFinally note that Kalman married Constantina Stavrou who studied economics at Johns Hopkins University; they have two children, Andrew and Elisabeth.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}