{
  "nome_completo": "Rudolf Otto Sigismund Lipschitz",
  "nome_curto": "Rudolf Lipschitz",
  "ano_nascimento": "1832",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lipschitz/",
  "lugar_nascimento": "Königsberg, East Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Bonn, Germany",
  "biografia": "Rudolf Lipschitz\n's father was a landowner and Rudolf was born his father's estate at Bönkein which was near Königsberg. He began his university studies at a young age, entering the University of Königsberg and studying there under Franz Neumann. Following the custom of that time to study at different universities, Lipschitz went from Königsberg to Berlin where he studied under Dirichlet. This was not a particularly easy time for Lipschitz whose health was rather poor and caused him to take a year away from his studies to recover. However, he completed his doctoral studies with the award of a doctorate on\n9\nAugust\n1853\n.\nThere was no immediate university teaching post for Lipschitz who spent four years teaching at the\nGymnasium\nin Königsberg and at the Gymnasium in Elbing. In\n1857\n, however, Lipschitz became a\nPrivatdozent\nat the University of Berlin. In this same year he married Ida Pascha, the daughter of one of the landowners with an estate near to his father's. Then in\n1862\nhe became an extraordinary professor at Breslau.\nDuring his two years in Breslau, Lipschitz wrote two not very important papers. Jointly with\nHeinrich Schröter\nand M Frankenheim, he founded a seminar in mathematics and mathematical physics. The paper\n[\n5\n]\nlooks at Lipschitz's career during these two years. He was nominated an ordinary professor by the University of Bonn and he left Breslau at Easter\n1864\n.\nThe University of Bonn was where Lipschitz spent the rest of his career. This was not because he did not have the opportunity to move. Quite the reverse, after\nClebsch\ndied in November\n1872\nhe was offered his chair at Göttingen in the following year. Lipschitz was quite happy at Bonn, however, and he turned down the offer from Göttingen.\nKlein\nreceived his doctorate from the University of Bonn in\n1868\n. He was supervised by\nPlücker\n, and examined by Lipschitz. Perhaps if\nKlein\nhad still been in Göttingen when Lipschitz was offered the chair there, he may have been more inclined to accept.\nPerhaps the most remarkable fact about Lipschitz's work was the widely different topics on which he contributed\n[\n1\n]\n:-\nHe carried out many important and fruitful investigations in\nnumber theory\n, in the theory of\nBessel\nfunctions and of\nFourier series\n, in ordinary and\npartial differential equations\n, and in analytical mechanics and\npotential theory\n.\nHe worked on quadratic differential forms and mechanics. In the paper\n[\n4\n]\nthe author shows convincingly how Lipschitz mechanical interpretation of\nRiemann\n's\ndifferential geometry\nwould prove to be a vital step in the road towards\nEinstein\n's special theory of relativity. Lipschitz showed that\n[\n4\n]\n:-\n... the geometrical statements could be interpreted as mechanical laws\n[\nbut these were\n]\nthe very mechanical concepts that made it possible to deepen the corresponding geometrical relations.\nLipschitz's work on the\nHamilton\n-\nJacobi\nmethod for integrating the equations of motion of a general\ndynamical system\nled to important applications in celestial mechanics.\nLipschitz is remembered for the 'Lipschitz condition', an inequality that guarantees a unique solution to the\ndifferential equation\ny\n′\n=\nf\n(\nx\n,\ny\n)\ny' = f (x, y)\ny\n′\n=\nf\n(\nx\n,\ny\n)\n.\nPeano\ngave an existence theorem for this differential equation, giving conditions which guarantee at least one solution.\nHis work in\nalgebraic number theory\nled him to study the\nquaternions\nand generalisations such as\nClifford\nalgebras. In fact Lipschitz rediscovered\nClifford\nalgebras and was the first to apply them to represent rotations of Euclidean spaces, thus introducing the spin\ngroups\nSpin\n(\nn\nn\nn\n)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}