{
  "nome_completo": "Friedrich Otto Rudolf Sturm",
  "nome_curto": "Rudolf Sturm",
  "ano_nascimento": "1841",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sturm_Rudolf/",
  "lugar_nascimento": "Breslau, Prussia (now Wrocław, Poland)",
  "lugar_morte": "Breslau, Germany (now Wrocław, Poland)",
  "biografia": "Rudolf Sturm\n's father was a businessman. After attending the St Maria Magdalena\nGymnasium\nin Breslau he entered Breslau University in October\n1859\nto study mathematics and physics. There he was taught by\nSchröter\nwho encouraged him to study synthetic geometry.\nHe was awarded a doctorate by Breslau in\n1863\nfor a dissertation entitled\nDe superficiebus tertii ordinis disquisitiones geometricae\nⓉ\n(\nInvestigations of third order geometric surfaces\n)\n. In this work he studied third degree surfaces in their projective representations and proved theorems which had been stated, but not proved, by\nSteiner\n. After the award of his doctorate he taught at Breslau as an assistant. He continued to work on surfaces and, in\n1864\n, he shared with\nCremona\nthe\nSteiner\nprize of the\nBerlin Academy\nfor his investigations of surfaces.\nIn\n1866\nhe became a science teacher in Bromberg, which is the German name for the city now called Bydgoszcz in northern Poland. The year after he took up the post in Bromberg he published\nSynthetische untersuchungen über Flächen\nⓉ\n(\nSynthetic analysis on surfaces\n)\nwhich collected together his prize winning results and his other work in the area.\nIn\n1872\nSturm was appointed assistant professor at the Technical College in Darmstadt where he taught descriptive geometry and graphic statics. In order to provide a good teaching book for his students, Sturm published a textbook\nElemente der darstellenden Geometrie\nⓉ\n(\nElements of descriptive geometry\n)\non descriptive geometry and graphical statics for his students in\n1874\n. He became an ordinary professor at Münster in\n1878\n, then he returned to Breslau in\n1892\nwhere he again held an ordinary professorship. He remained in this post until his death.\nSturm wrote extensively on geometry and, other than the teaching textbook on descriptive geometry and graphical statics which we mentioned above and one other teaching text\nMaxima und Minima in der elementaren Geometrie\nwhich he published in\n1910\n, all his work was on synthetic geometry.\nHe wrote a three volume work on line geometry published between\n1892\nand\n1896\n, and a four volume work on\nprojective geometry\n,\nalgebraic geometry\nand\nSchubert\n's enumerative geometry the first two volumes of which he published in\n1908\nand the second two volumes in\n1909\n. These two multi-volume works collect together most of his life's research.\nLet us first comment on the three volume work, which was the biggest treatise ever to be written on line geometry. There of course a tension in this topic between the totally geometric approach and the algebraic approach. Sturm was a staunch advocate of the former approach even when tackling topics where the algebraic approach would have been markedly simpler. I\n[\nEFR\n]\ncertainly remember examination questions which one of my lecturers would set asking \"without using such and such a theorem, prove that ...\". It always seemed to me to be asking one to do mathematics with one hand tied behind your back and to a certain extent that is the effect of Sturm's approach. However, he would have argued that his approach was consistent through this large piece of mathematics and indeed this was the case. It is also true that much of what he treats in the text is particularly well suited to his approach, while only a relatively small amount of the material could have been handled more simply with algebraic methods. Burau writes in\n[\n1\n]\nthat:-\n... in the first two volumes Sturm treated linear complexes, congruences, and the simplest ruled surfaces up to tetrahedral complexes, all of which can be particularly well handled in a purely geometric fashion. He did not systematically investigate the remaining quadratic complexes until volume three, where the difficulties of his approach - as compared with an algebraic treatment - place many demands on the reader.\nSturm's four volume work contains over\n1800\npages. It examines geometric relationships, in particular transformations such as\nCremona\ntransformations. The work in some respects represents the crowning achievement of synthetic geometry developed in Sturm's style. The subject had little in the way of opportunities for further progress and as a consequence, despite Sturm supervising quite a few doctoral students, nevertheless he did not build a school to continue to develop his mathematical ideas.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}