{
  "nome_completo": "Rudolf Ernst Peierls",
  "nome_curto": "Rudolf Peierls",
  "ano_nascimento": "1907",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peierls/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Oakenholt, near Oxford, England",
  "biografia": "Rudolf Peierls\n' parents were Heinrich Peierls and Elizabeth Weigert and he was their only child. The family were ethnically Jewish but did not practice the Jewish religion. Heinrich Peierls was director of the Berlin-Oberschöneweide factory of Allgemeine Elektrizitätsgesellschaft when Rudolf was born, and the following year he became a member of the board. When Rudolf was fourteen years old his mother died of Hodgkin's disease, and his father married Else Hermann\n(\nwho was not Jewish\n)\nsoon after. Sabine Lee writes\n[\n6\n]\n:-\nFrom a young age Rudolf was interested in science and engineering. He was a bright child, who found school work easy and was keen to probe further into areas that interested him most: the sciences. His childhood friends remember many an occasion when he would leave their play in order to 'think', only to return once he had solved whatever problem  puzzled him at the time.\nPeierls wanted to follow a career in engineering but his father doubted that his son had the necessary dexterity and practical skills to excel in this, so he put pressure on Rudolf to enrol in physics courses. He reluctantly took his father's advice and matriculated at Berlin University in\n1925\nto study experimental physics. Notice that he still wanted to study experimental physics rather than theoretical physics, but practical subjects were in such high demand at Berlin University that the university authorities prevented students taking them in their first year. Peierls was then forced to go down the route he had been trying to avoid and take courses in mathematics and theoretical physics.\nThe standard way that students in Germany at this time undertook their studies was to move between different universities. After a year at Berlin, Peierls moved to the Department of Theoretical Physics in Munich University in\n1926\n. For two years he studied at Munich where he was particularly influenced by the teaching of\nArnold Sommerfeld\n. It was\nSommerfeld\nwho introduced Peierls to quantum mechanics during these two years and this proved highly significant for Peierls' career. It was during this time that he gained a high level of mathematical expertise, following\nSommerfeld\n's philosophy \"If you want to be a physicist, you must do three things - first study mathematics, second, study more mathematics, and third, do the same.\"\nPeierls' next move was to the Theoretical Physics Department of Leipzig University in\n1928\n, mainly as a result of\nSommerfeld\nleaving Munich for a world tour. He chose Leipzig because\nWerner Heisenberg\nhad been appointed as professor there in\n1927\n. He followed\nHeisenberg\n's advice of research topic and began the work which would lead to his first paper\nZur Theorie der galvanomagnetischen Effekte\nⓉ\n(\nOn the theory of galvanomagnetic effects\n)\n(1929)\n. In the spring of\n1929\nHeisenberg\nalso went off on a world tour so Peierls moved university again, this time going to the Eidgenössische Technische Hochschule in Zürich to work with\nWolfgang Pauli\n. He now worked on the thermal conductivity in crystals and by the summer of\n1929\nhad achieved sufficient depth of results that he was able to write two papers and to submit a doctoral dissertation to Leipzig University. He was awarded his doctorate from Leipzig in\n1929\n, then in the autumn of that year he was appointed as\nPauli\n's assistant in Zürich.\nAt Zürich, Peierls worked with\nLev Landau\nwho was visiting Zürich. In the summer of\n1930\nPeierls went to a conference in Odessa where he met not only with\nLev Landau\n, but also many of his colleagues. One of these colleagues was Eugenia Nilolaevna Kannegisser, known as Genia\n[\n6\n]\n:-\nWith their German and Russian backgrounds, neither of them could converse in the other's mother tongue and the only common language spoken sufficiently well by both to communicate reasonably comfortably was English. After six months of intense correspondence by letter, Rudolf Peierls travelled to Leningrad again in March\n1931\n, and during his brief stay - much to the dismay of his surprised family - married Genia.\nGenia and Rudolf married on\n15\nMarch\n1931\n; they had three daughters Joanna, Gaby and Catherine, and one son Ronald who became a computational mathematician.\nPeierls was awarded a Rockefeller Fellowship and he spent the first half of the year\n1932\n-\n33\nin Rome with\nEnrico Fermi\n, and the second half in England where he worked at Cambridge with\nPaul Dirac\nand\nRalph Fowler\n. He turned down an offer of an assistantship at Hamburg despite its high reputation since he saw the problems of rising support for the Nazi party. He was glad, therefore, to accept a position at Manchester. He spent a highly productive year there, working with\nHans Bethe\n, and began publishing papers on nuclear physics in addition to his continuing work on the electron theory of metals. His next position was a two year fellowship held at Cambridge, following which, in\n1937\n, he accepted a professorship in mathematical physics at Birmingham University.\nThe deteriorating political situation in Germany led to Peierls attempting to gain British citizenship in May\n1938\nand, at the same time, he tried to reject his German citizenship. This process took time and when World War II began the process was still not complete and Peierls and his wife were both classified as enemy aliens. Restrictions were lifted in February\n1940\nwhen his application for British citizenship was approved. However, undertaking war work was still difficult and this would prove particularly so when, together with Otto Frisch\n(\nan Austrian\n)\n, he made it known to the British government through the\n3\n-page Frisch-Peierls memorandum that he had the theoretical knowledge to make an atomic bomb from uranium-\n235\na possibility. The government set up the MAUD committee to examine the Frisch-Peierls memorandum and at first, because of Peierls and Frisch's German and Austrian backgrounds, they were prevented from taking part. Soon, however, the realisation that it was impossible to prevent the two scientists who had proposed the idea from knowing about it came home to the committee and Peierls and Frisch were invited as members of a technical subcommittee.\nEarly in\n1941\nPeierls invited\nKlaus Fuchs\nto join him, Otto Frisch and James Chadwick, in the work on the theoretical side of the British project to develop an atomic bomb. In August\n1943\nthe Quebec Conference set up a formal collaboration between Britain and the United States on nuclear weapons research and, after a fact finding mission by Peierls in Washington, all the key British researchers joined the Manhattan Project. Peierls worked first in New York then at Los Alamos until the end of World War II, when he returned to Birmingham. He continued to work there despite offers from Oxford, Manchester, London and Cambridge. During these years, he also worked as a consultant to the British atomic programme at Harwell where\nKlaus Fuchs\n, who had worked closely with him on the atomic bomb project, now held a senior position. When\nFuchs\nwas exposed as a Russian spy in\n1950\nit caused considerable embarrassment to Peierls who had to endure press speculation that he was also a spy.\nThe Spectator\nalleged he spied for the Soviet Union with the codename \"perls\", but this was totally unfounded\n[\n6\n]\n:-\nHis contacts with left-wing colleagues, his friendship with people of Communist persuasion, his marriage to a Russian, his close friendship with\nKlaus Fuchs\n- all led to his being viewed with a degree of suspicion by many.\nHis applications for a visa to visit the United States met with long delays. In\n1957\nthe Americans asked the British to revoke his security clearance, which they did. As a result Peierls resigned from his consultancy role at Harwell.\nIn\n1961\nhe was offered the Wykeham Chair of Physics at Oxford. By now he was feeling that he had been in Birmingham long enough and was looking for a challenge. However, he did not rush to accept which he did not do until the following year, only taking up the position in\n1963\n. He worked in Oxford until he retired in\n1974\n, then spent the period between February and May of each of the next three years at the University of Washington. The list of other places he visited in the years following his retirement is too long to give here.\nPeierls received many honours such as election to the\nRoyal Society\nin\n1945\n, and receiving their Royal Medal in\n1959\n. He was also awarded the\nMax Planck\nMedal\n(1963)\n, the\nEnrico Fermi\nAward\n(1980)\n, the Matteucci Medal\n(1982)\n, and the Copley Medal\n(1986)\n. For his wartime contributions he was made a Commander of the British Empire in\n1946\n, but the most pleasing honour of all was a Knighthood in\n1968\nsince it gave him an acceptance by the British establishment after many years of unfair suspicion.\nIn\n1997\n, two years after his death,\nSelected scientific papers of Sir Rudolf Peierls\nwas published. H S Green writes in a review:-\nSir Rudolf Peierls was probably the most influential of the German mathematical physicists who migrated and settled in Britain during the Nazi era. An inveterate traveller, he was well acquainted with nearly all the distinguished mathematical and theoretical physicists of his time and worked with many of them; he also had many young friends and research students who achieved distinction. ... This valuable book features a selection of\n72\nof the much larger number of scientific papers and lectures that Peierls contributed to the scientific literature, and includes translations into English of his early work as well as personal comments by the author which modestly evaluate the importance of most of the papers. ... Peierls was a highly competent, though not a notably creative mathematician; his principal interest was clearly in making calculations which would lead to a deep understanding of physical phenomena, and he was adept at finding approximations which gave trustworthy numerical results. His more mathematically elegant papers, such as\n[\none\n]\nwith\nDirac\nand Pryce, were in collaboration with people with more mathematical inclinations. However, it is remarkable how many of these papers have played a crucial role for the subsequent development of their subjects ...\nWe end this biography by looking briefly at his two books\nSurprises in theoretical physics\n(1979)\nand\nMore surprises in theoretical physics\n(1991)\n. Describing the first, P Roman writes:-\nThis unusual, fascinating, slim volume renders exactly what its distinguished author promises: \"to illustrate and to entertain\"---and to delight the reader, I would like to add. It is based on\n(\nobviously leisurely\n)\nlectures that Sir Rudolf gave in\n1977\n/\n78\n, both in the U.S. and in France. It \"presents a number of examples in which a plausible explanation is not borne out by a more careful analysis\". Thus the book is didactic and it challenges the reader's intellect. The topics covered are mostly from quantum theory and its applications; statistical physics and even relativity are touched upon. ... The book should be not only a bedside companion for mature scientists but also a challenging, easily followed and highly appreciated \"supplementary text\" for graduate students in theoretical physics\n(\nin Europe, also for advanced undergraduates\n)\n.\nThe second text was reviewed by A Ventura who writes:-\nSurprises in theoretical physics are either theoretical results in disagreement with naïve physical intuition, or simple solutions to apparently unmanageable problems. A first collection of surprises was published in\n1979\nand is now supplemented by the present work, with topics taken mainly from the long multifaceted experience of the author. ... this book can be warmly recommended to physics students and to their teachers as a valid auxiliary tool for courses in quantum mechanics, structure of matter and statistical physics.\nAnother two significant books were\nThe Laws of Nature\n(1955)\nand his autobiography\nBird of Passage\n(1985)\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}