{
  "nome_completo": "Rufus Philip Isaacs",
  "nome_curto": "Rufus Isaacs",
  "ano_nascimento": "1914",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Isaacs/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Baltimore, USA",
  "biografia": "Rufus Isaacs\n' parents were Philip Simon Isaacs and Alice Cohn. Philip Isaacs came from a lowly background but became a successful businessman. Rufus was brought up in New York City where he attended the Franklin School. This school, founded by Julius Sachs in\n1872\n, was at\n18\nWest\n89\nth\nStreet. Isaacs\n[\n9\n]\n:-\n... began writing short stories while he was in high school, where he served as co-editor-in-chief of the school magazine and yearbook.\nHe graduated from the Franklin School in\n1932\nand, later that year, entered the Massachusetts Institute of Technology in Cambridge, Massachusetts. He had been persuaded by his father to concentrate on 'air conditioning', a topic his father believed would lead to a well paid career in an area of great practical importance. He graduated with a Bachelor of Science degree in General Engineering in\n1936\n. However, his interests were broad with a great love of the arts and literature. When at the Massachusetts Institute of Technology, he painted and wrote dramas which were performed by a student drama group. After graduating, Isaacs was employed by the Carrier Corporation of Syracuse, New York. This firm, a manufacturer and distributor of heating, ventilating and air conditioning systems, had been founded by Willis Carrier in\n1915\n. Willis Carrier is said to be the inventor of modern air conditioning systems. Isaacs writes about his experiences at the Carrier Corporation in\n[\n4\n]\n:-\nIn the Carrier Engineering Department, just after my engineering BS, there was a problem to be solved by a differential equation. Now, I had taken a course in differential equations; it told us how to set one up germane to a real-world problem and how to solve it; I was a master. Therefore, I wrote my equation including in it every detail of the problem. In average handwriting, its length was about two feet. And, hard as I find it to believe now, I was chagrined to find no solution rattling out as they had done for the homework problems in the textbook. Please restrain the polite snicker. The course had given no hint that not all differential equations can be solved in elementary closed form.\nAfter two years with the Carrier Corporation, where his talent and problem solving abilities were greatly appreciated, Isaacs enrolled in the Master's mathematics programme at Columbia University in New York. He was advised by\nEdward Kasner\nand, on\n25\nFebruary\n1939\n, submitted a paper entitled\nA geometric interpretation of the difference quotient of polygenic functions\nto the\nAmerican Mathematical Society\n. The paper was eventually published as\nThe finite differences of polygenic functions\nin the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1941\n.\nPhilip Franklin\nwrites in a review:-\nThe author shows how the values of the difference quotients of a polygenic function, formed at a given point, may be represented by the points of a surface in three space. He studies the geometry of this surface, one of whose plane sections is the\nKasner\nderivative circle.\nIsaacs was awarded his Master's degree\n(\nan M.A.\n)\nin\n1940\nand continued to undertake research at Columbia University for his Ph.D. He was awarded his doctorate by Columbia University in\n1943\nfor his thesis\nA Finite Difference Function Theory\n[\n2\n]\n:-\nIn his Ph.D. Thesis, he developed an extension of the calculus of finite differences to complex variables. Isaacs constructed a theory of functions of a complex variable which springs entirely and basically from the concept of the difference quotient\n(\ninstead of the derivative\n)\nand called these functions monodiffric. Monodiffric functions are the analogue of the monogenic functions introduced by\nEuler\n. In his Ph.D. Thesis, Isaacs presented\n29\nnew theorems with proofs and applications ...\nIn\n1941\n, even before the award of his Ph.D., Isaacs had taken up a job with Hamilton Standard Propellers, Pittsburgh, Pennsylvania. This firm was a major manufacturer of aircraft propellers and Isaacs was employed as a Senior Analytical Engineer. In\n1942\nhe married Rose Bicov\n(\nborn in Hartford, Ford, Connecticut on\n6\nFebruary\n1912\n, died in Baltimore, Maryland on\n5\nApril\n2004)\n, the daughter of Benjamin Bicov and Sarah Beatman. Rose was\n[\n9\n]\n:-\n... a charming lady. The marriage is considered by Isaacs as the prime event of his life. They have two lovely daughters - Ellen Sara\n(\nborn\n1944)\nand Frances Carol.\nEllen was a medical doctor. Frances graduated from Tufts University, worked in occupational health and safety, married John Gilmore, and has published a book of poetry.\nIsaacs joined Hamilton Standard Propellers around the time the United States entered World War II. His work became war related, solving military problems involving aerodynamics, elasticity, and vibrations. Isaacs wrote\n[\n4\n]\n:-\nAt the outbreak of World War II, aircraft propeller blades were made of solid aluminum. Hamilton Standard proposed a hollow steel construction: a central narrow core was to be brazed along its length to an outer steel shell of the ultimate aerodynamic shape. When an eight-foot blade of such construction rotates at umpty thousand RPM, the centrifugal force load is born over the length of the braze as a shearing stress. How is it distributed? This urgent question was handed to me for a quick answer.\nIn\n1945\n, after the war ended, Isaacs was appointed as an assistant to\nKarl Menger\nin the Mathematics Department of Notre Dame University, South Bend, Indiana.\nMenger\nhad come to the United States to escape the Nazis fully intending to return to Vienna after the war. However, this was not possible so\nMenger\nremained in the United States but left Notre Dame University in\n1947\ngoing to the Illinois Institute of Technology in Chicago. Once he knew that\nMenger\nwas leaving and finding it hard to support his family on an academic salary, Isaacs decided to take a position with North American Aviation, Los Angeles. Back once again in the aviation industry, Isaacs was involved in the design of intercontinental guided missiles. He worked on subsonic and supersonic aerodynamics, missile guidance systems, and transstability flutter writing the\n1948\nreports 'Transstability Flutter of Supersonic Aircraft Panels' and 'A Static Stability Analysis for Thin Buckled Beams at Supersonic Speeds'. However, Isaacs was not very happy working for North American Aviation\n[\n4\n]\n:-\nAt my first jobs, I was a lone mathematician, first among engineers, then among physicists.\nIn\n1948\nhe joined the Mathematics Department of the RAND Corporation and he worked there until\n1954\n. It was at RAND that he developed the idea of differential games, the idea for which he is most famed today. Isaacs explained\n[\n1\n]\n:-\nThen under the auspices of the U.S. Air Force, RAND was concerned largely with military problems and, to us there, this syllogism seemed incontrovertible:\n(1)\ngame theory is the analysis of conflict;\n(2)\nconflict analysis is the means of warfare planning;\n(3)\ntherefore, game theory is the means of warfare planning. The early RAND discussions proposed and discarded schemes for a pursuing missile to seek an enemy aircraft. Collision course was good? Yes. But if the targeted craft did this\n(\nor that\n)\n, the missile won't hit. Constant bearing navigation? That seems easier for the missile. But what if the evader does that\n(\nor this\n)\n? What optimal pursuit scheme for the missile? The crucial idea dawned: the question was unanswerable unless one also asked \"what optimal evasive scheme for the aircraft?\". The whole subject was game theory.\nHis first RAND report on differential games was\nGames of Pursuit\n(1951)\n. Here are examples of the types of problems he studied in that report\n(\nquoted in\n[\n2\n]\n)\n:\nGame\n1\n: think of a car whose driver is intent on running down an objecting pedestrian in a large unobstructed parking lot with the latter's only hope being delay until rescue. The capture region is the planform of the car.\nGame\n2\n: Vicariously, we observe the chase through regularly laid out city streets of a pedestrian fugitive by a police car. The car, although faster, must abide by local traffic rules which prohibit left\n(\nand also U\n)\nturns. Our model is played discretely on the vertices of an infinite square lattice. If E is at a point, he may move vertically or horizontally to any one of the four adjoining points; P moves two spaces but only in a direction the same as or to the right of that of his previous move.\nIsaacs wrote about the reception of his ideas in\n[\n1\n]\n:-\nThrough the Rand seminars, my colleagues were privy to my progress. Enthusiasm seemed ardent at first, but it dwindled. A proposed joint research project did not materialise. From my fellow mathematicians, I heard \"Too hard\", \"Not rigorous\", or \"No existence theorem\". ...  'Games of Pursuit'\n(1951)\ncontained the tenet of transition but its presentation of continuous game techniques was crude and a bit erroneous. Understandably, it was rejected by a mathematical journal. I was beginning to grasp the innovations inherent in my incipient theory ...  ; its novel flavour could simply not be conveyed in a brief article.\nHe explains in\n[\n1\n]\nwhy he left RAND:-\nI felt overwhelmed by the difficulties in making my new subject fulfill its rich promise. I wanted Rand to devote substantial resources to a joint effort, or, failing that, to support a long-term investigation by myself alone. Neither was to be. Although I have never learned what went on behind administrative doors, my six-year stay at Rand ended in\n1954\n. When opportunities had long seemed nonexistent for simultaneously pursuing the subject and earning a living, I was offered a teaching fellowship abroad in\n1963\n. The teaching load was light; here was a chance to set down the ideas I had been carrying in my head for ten years.\nHis work at RAND on differential games became the basis for his famous book\nDifferential games. A mathematical theory with applications to warfare and pursuit, control and optimization\n(1965)\n. For the publisher's description, extracts from the author's preface and Introduction as well as extracts from five reviews of the book see\nTHIS LINK\n.\nIn\n1969\nIsaacs wrote the paper\n[\n6\n]\nin which he ties to correct what he perceives as a general misunderstanding of the concept of differential games:-\nSince the appearance of my book 'Differential Games'\n(1965)\n, I have felt increasing concern over a certain prevalent misunderstanding of the real nature of differential games. My own reflections, from the perspective that trails the setting down of all the complex technical details, conversations with others and their writings, and reactions to my lectures, all bolster this view. At present, there appear to be comparatively few people who have grappled in depth with the\nproblems of differential games. Hence, there is a rather widespread failure to grasp the distinction from classical analysis. This distinction is due to the presence of two players with contrary purposes. When each makes a decision, he must take into account his opponent's portending action toward the opposite end, his opponent's similar wariness of the first player's actions, and so forth. This situation is basically different from that of much of classical mathematics, which, as I shall argue below, consists of one-player games. Thus, my main thesis is that differential games lie in a stratum distinctively above the mathematics to which we are accustomed; accordingly, our thinking in this field must transcend the habits inculcated by traditional training. Beyond are further strata which can be expected to harbor further novelties.\nLet us return to our description of Isaacs' career. After leaving RAND in\n1954\nhe spent one year as Senior Scientist at Lockheed Aircraft Company before joining Hughes Aircraft Company in\n1955\nas a Research Mathematician. He moved again, this time after three years, taking up the position of Mathematician at the Institute of Defense Analyses. After four years,\n1958\n-\n62\n, he took up an appointment at the Center for Naval Analyses where he spent the five years\n1962\n-\n67\n. In addition to these positions, Isaacs was a professor at George Washington University, Washington, DC, from\n1961\nto\n1967\n. After these many jobs in industry, Isaacs became a full-time academic for the final ten years of his working life. He was appointed as a professor at Johns Hopkins University in\n1967\nand retired, being made professor emeritus, in December\n1977\n. The article\n[\n9\n]\n, written shortly after he retired, says:-\nDuring his retirement, Isaacs plans to continue his research in mathematics and other creative pursuits. In celebrating his great contribution to differential games, we send our best wishes to him and his family. We also would like to thank him for spending time to write the article 'On Applied Mathematics', for this issue so that his experiences and wisdom can be shared by our readers.\nWe note that the article\n[\n9\n]\nis written by Po-Lung Yu who studied for a Ph.D. at Johns Hopkins University advised by Isaacs.\nIsaacs returned to one of his many mathematical loves, namely pure mathematics, when he published the paper\nThe distribution of primes in a special ring of integers\nin\n1979\n. This paper contains some fascinating ideas as a review by John Knopfmacher shows:-\nThe arithmetic of polynomials in one variable over a finite field GF\n(\nq\n)\n, in particular the distribution of irreducible polynomials, is quite well known and has been studied by various authors .... In this article, using the representation of non-negative integers in binary decimal notation, the author considers nonstandard definitions of addition and multiplication which convert the set\nN\nN\nN\nof all nonnegative integers into a ring isomorphic to\nG\nF\n[\n2\n,\nx\n]\nGF[2, x]\nG\nF\n[\n2\n,\nx\n]\n. In particular, as the author indicates, the theory of the distribution of irreducible polynomials could then be applied to this ring. However, he prefers to give a direct discussion of the distribution of the corresponding \"primes\" in\nN\nN\nN\n. Further, by direct reference to binary decimal notation, he defines a subset of \"palindromic primes\" with no well-known classical analogue, and obtains a similar result about their distribution in\nN\nN\nN\n.\nIsaacs received several honours for his innovative work. He was SIAM Lecturer from\n1961\nto\n1963\n. He was awarded the Frederick W Lanchester Prize by the Operations Research Society of America in\n1965\n. The citation reads:-\nThe\n1965\nLanchester Prize was awarded to Rufus Isaacs for his book, 'Differential Games', John Wiley,\n1965\n.\nOne final honour that we note is the establishment of the Rufus Isaacs prize by the International Society of Dynamic Games. First awarded in\n2004\n, the prize is awarded to two scholars every two years for:-\n... outstanding contribution to the theory and applications of dynamic games.\nFinally let us quote from Wilson Rugh\n[\n8\n]\ngiving his sketch of Isaacs as a person:-\nFor those of us fortunate enough to know him personally we will always remember this quiet, unassuming, and interesting man. He loved music, was an avid artist, and his mastery of the written word is evident in his published work. His fifteen-speed bicycle was always nearby and, to the dismay of everyone, he regularly used it to commute between home and campus in Baltimore's rush hours. But perhaps most of all it will be the twinkle in his eye that will stay. Some vignettes in recent years capture images of the man friends will remember with affection: Rufus visiting the sailing ship Cutty Sark to verify the accuracy of his hand crafted model, the radio-transmitting unloseable golf ball he purchased out of curiosity and promptly lost, and his professed desire to write a book entitled 'Engineering for Mathematicians'.\nIsaacs did not have many years of retirement to enjoy since, at the age of\n66\n, he died from cancer in Johns Hopkins Hospital in Baltimore.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}