{
  "nome_completo": "Ruth Ingrid Michler",
  "nome_curto": "Ruth Michler",
  "ano_nascimento": "1967",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Michler/",
  "lugar_nascimento": "Ithaca, New York, USA",
  "lugar_morte": "Boston, USA",
  "biografia": "Ruth Michler\nwas the daughter of Gerhard O Michler, a mathematician who has made major contributions to the theory of groups and representation theory. There were two children in the family, Ruth having a sister. Gerhard Michler was born in Braunschweig, Germany, on\n5\nMay\n1938\n. He was awarded a doctorate from the Johann Wolfgang Goethe-Universität Frankfurt am Main in\n1965\nfor his thesis\nRadikale und Sockel\nⓉ\n(\nRadicals and socles\n)\n. His thesis advisor was\nReinhold Baer\n. He undertook postdoctoral studies at Cornell University in Ithaca, New York, USA, and it was while he was there that his daughter Ruth, the subject of this biography, was born. The family returned to Germany in April\n1968\nand Gerhard habilitated at the Eberhard-Karls-Universität Tübingen.\nRuth Michler spent the first six years of her life in Tübingen but, before she began her schooling, her family moved to Giessen when Gerhard Michler was appointed as a full professor at the Justus-Liebig-Universität Giessen. The family moved to Giessen in March\n1973\nand Ruth began her elementary schooling there, then progressed to begin her studies at a Gymnasium in the same city. In\n1978\nthe family moved again, this time to Essen when Gerhard Michler was appointed as professor at the Universität Duisburg-Essen. Ruth then entered a Gymnasium in Essen and completed her studies there, graduating in\n1985\n. During her years at school, Ruth greatly enjoyed learning foreign languages and had a particular passion for mathematics, sciences, fine arts and music.\nIt was at the University of Oxford in England that Ruth Michler undertook her undergraduate studies. Matriculating in\n1985\n, she was a student at Balliol College where her tutors were Keith Hannabuss and Frances Kirwan. Keith Hannabuss had obtained a doctorate from the University of Oxford in\n1969\nfor his thesis\nQuantum Dynamics in De Sitter Space\n. At the time Michler studied at Oxford, he was a fellow and mathematics tutor at Balliol College. Frances Kirwan had obtained a doctorate from the University of Oxford in\n1984\nfor her thesis\nThe Cohomology of Quotients in Symplectic and Algebraic Geometry\n, supervised by\nMichael Atiyah\n, and after having obtained a fellowship at Magdalen College, she was appointed as a fellow and tutor at Balliol College in\n1986\n. In\n1987\nMichler won a won a Jenkyns essay prize for her paper \"Black Holes,\" under the direction of\nRoger Penrose\n, the\nRouse Ball\nProfessor of Mathematics at the University of Oxford.\nAfter the award of a B.A. from the University of Oxford in\n1988\n, Michler went to the United States to undertake research for her doctorate. She enrolled at the University of California, Berkeley, where her Ph.D. advisor was Mariusz Wodzicki and Arthur Ogus acted as a second advisor. Mariusz Wodzicki, whose research interests were non-commutative and algebraic geometry, analysis, and K-theory, had studied for his doctorate at the Steklov Institute of Mathematics in Moscow advised by\nYuri Manin\n. Wodzicki had been awarded his doctorate in\n1984\nfor his thesis\nSpectral Asymmetry and Zeta-Functions\n. Arthur Ogus, also an expert in algebraic geometry, had studied for his doctorate at Harvard University, receiving a Ph.D. in\n1972\nfor his thesis\nLocal Cohomological Dimension of Algebraic Varieties\n. Michler was awarded a Ph.D. in\n1993\nfor her\n80\n-page thesis\nHodge-components of Cyclic Homology of Singular Affine Hypersurfaces.\nShe had presented a paper based on her thesis to the\nK-theory\nconference held in Strasbourg\n29\nJune\n29\n-\n3\nJuly\n1992\n. The paper had the same title as her thesis and it was published in the\nProceedings\nof the conference. Jerry Lodder, reviewing the paper, writes:-\nIn this paper the author proves that the\nHodge\n-components of Hochschild homology of a reduced affine hypersurface are given by torsion modules of\nKähler\ndifferentials. Using results of T Goodwillie,\nJ-L Loday\nand U Vetter, the author also proves a vanishing result for the\nHodge\n-components\n(\nalso called the l-decomposition\n)\nof cyclic homology of affine hypersurfaces. The non-zero summands in this decomposition are computed in terms of the\nde Rham\ncohomology of the underlying algebra. Furthermore, in the case of a hypersurface defined by a quasihomogeneous polynomial, an explicit computation of the\nHodge\n-components of cyclic homology is given. The reduced cyclic homology groups provide a topological invariant of algebras formed by the quotient of such polynomials.\nMichler received an invitation from Leslie G Roberts to spend the academic year\n1993\n-\n94\nat Queen's University in Kingston, Canada, as a postdoctoral fellow. A lovely sketch of Leslie Roberts was written by Asia Matthews when he retired from Queen's University:-\nIn well-worn construction boots, Leslie Roberts taught mathematics in a way that was concise and unembellished. Though he glowered at you if you asked a question, you soon came to realize it was the face he made while patiently thinking up an insightful and precise explanation. Leslie's many published works reflect this habit of precision and insight. He made a significant contribution to the Department through his years as Associate Head, particularly managing the demanding process of hiring new faculty. He arrived at work by bicycle in all weather and anyone who needed a spot of alcohol to thaw a frozen brake cable need only seek Leslie out.\nMichler spent a year at Queen's University and wrote papers such as\nTorsion of differentials of hypersurfaces with isolated singularities\n(1995)\nand\nTorsion of differentials of affine quasi-homogeneous hypersurfaces\n(1996)\n. In both of these she thanks Leslie Roberts, writing in the\n1995\npaper:-\nI would like to thank Prof A Ogus and Prof L G Roberts for helpful discussions. Moreover, I would like to thank Queen's University for their hospitability and support from the NSERC grant of Prof L G Roberts, while preparing this paper for publication.\nAfter spending the year in Canada, Michler decided that she would try to spend her career in the United States rather than return to Germany, the country in which she was brought up. At this time academic jobs were not easy to get in either Germany or the United States, but the United States was the more promising. Michler, with an outstanding record, was offered a tenure-track position at the University of North Texas in Denton in\n1994\n. She was pleased to accept. At the University of North Texas she taught a variety of different courses including a graduate course on financial mathematics which she designed herself. Caroline Melles writes in her tribute about meeting Michler for the first time at the Fields Institute in Toronto, Canada\n[\n4\n]\n:-\nRuth and I met in the spring of\n1997\n, at the Fields Institute, when we shared an office for a few days and became instant friends. Ruth had driven from Texas to Toronto in a day, hardly stopping for food or rest. She paused briefly in Toronto, then was off to Kingston, to visit friends at Queen's University. We talked about everything - mathematics, friends, teaching, houses, running, and especially being a woman in mathematics. When I talked to her it was like talking to a best friend I had known all my life. We would start in the middle of a conversation, and jump from topic to topic. North Texas was a big change for Ruth after graduate school in Berkeley. She talked of life in Denton, and her students, and taking up running. She would mention running\n100\nmiles as if it was nothing but scenery with an occasional stretch of boredom.\nThis quote illustrates the energy that Michler had and this led her to attend conferences in many different countries around the world giving talks at these meetings. She gave lectures at\nAmerican Mathematical Society\nmeetings in Belgium and in South Africa. The Belgium conference was the first Joint International Meeting between the\nAmerican Mathematical Society\nand the mathematical societies of Belgium, The Netherlands, and Luxemburg. It was held in Antwerp\n22\n-\n24\nMay\n1996\n. The South African conference was the first Joint Meeting of the\nAmerican Mathematical Society\n, the\nSouth African Mathematical Society\nand the Southern Africa Mathematical Sciences Association. It was held at the University of Pretoria,\n26\n-\n28\nJune\n1997\n.\nMichler gave the lecture\nTorsion of differentials of hypersurfaces with isolated singularities\nin the Special Session on\nCommutative Noetherian Rings and Modules\nat the Joint Mathematics Meeting of the\nAmerican Mathematical Society\nand the\nMathematical Association of America\nconference in San Francisco, California on\n4\n-\n7\nJanuary\n1995\n. She delivered the lecture\nCyclic homology and de-Rham cohomology of affine hypersurfaces\nat the Special Session on\nCombinatorics and Graph Theory\nat the Joint Mathematics Meeting of the\nAmerican Mathematical Society\nand the\nMathematical Association of America\nconference in Orlando, Florida held\n10\n-\n13\nJanuary\n1996\n. At the Joint Mathematics Meeting in San Diego, California,\n8\n-\n11\nJanuary\n1997\nshe gave two lectures;\nAlgorithms for computing the generators of the torsion module of differentials\nin the Special Session on\nComputational Algebraic Geometry\n, and\nOn the number of generators of the torsion module of differentials\nin the Special Session on\nCommutative Algebra\n.\nShe attended the Joint Mathematics Meeting of the\nAmerican Mathematical Society\n/\nMathematical Association of America\nin San Antonio, Texas on\n13\n-\n14\nJanuary\n1999\n. She was a co-organiser of the special session\nSingularities in algebraic and analytic geometr\ny at this joint meeting and gave the lecture\nIsolated hypersurface singularities with \"large\" torsion module of differentials\n, publishing the paper\nIsolated singularities with large Hochschild homology\nin the Proceedings. She attended the\nInternational Conference on Valuation Theory\nheld at the University of Saskatchewan in July-August\n1999\nand gave the talk\nInvariants of singular plane curves\n.\nIn\n[\n2\n]\nher research contributions are mentioned:-\nAs a mathematician, Ruth worked primarily in the area of cyclic homology and singularity theory and since her graduation from Berkeley she had made solid contributions to this field. She had seven articles printed or in press, with several more in preparation or submitted. In her papers on reduced isolated hypersurface singularities she showed that cyclic homology is a direct sum of Hochschild homology and\nde Rham\ncohomology. Furthermore, she gave some algorithms to compute these invariants. Ruth brought an intensity to everything she did, and her mathematical work reflected this intensity. In her research, Ruth used techniques from several different areas of mathematics and combined very abstract theory with concrete calculations of examples, using computer programs such as\nMacaulay\nand Maple. She was persistent, returning to problems again and again, approaching them from different viewpoints, and discussing variations and improvements with colleagues in related areas.\nWe have mentioned some conferences that Micher attended but her involvement with conferences took on another level when, as we have already mentioned, she began to play a major role as a conference organiser. We noted above that she was a co-organiser of the special session\nSingularities in algebraic and analytic geometry\nin San Antonio, Texas, in\n1999\n. She was also a co-organiser of the special session\nSingularities in algebraic and analytic geometry\nat the joint\nAmerican Mathematical Society\n/\nMathematical Association of America\nconference on\n19\n-\n22\nJanuary\n2000\nin Washington D.C. when she gave the lecture\nDeformations of isolated hypersurface singularities\n. Again she was a co-organiser of the special session on\nSingularities and Algebraic Geometry\nat the\n2000\nFall Western Section Meeting of the\nAmerican Mathematical Society\nin San Francisco, California,\n21\n-\n22\nOctober\n2000\n. At this meeting she gave the lecture\nNew and old results on singular plane curves\n. In addition to organising these national events, she organized a joint seminar for the University of North Texas, the University of Texas at Arlington, and Texas Christian University, called AGANT\n(\nAlgebraic Geometry, Algebra, and Number Theory\n)\n.\nFor all the three Special Sessions that Michler co-organised at the Joint Mathematics Meetings, her fellow organiser was Caroline Melles. In\n[\n4\n]\nMelles writes about these sessions:-\nOne day she wrote to me to see if I would be interested in helping her to organize a special session at an\nAmerican Mathematical Society\nmeeting. That was the first of three sessions which we organized, one of which resulted in a book of proceedings. These are projects which I would never have attempted without Ruth's initiative and energy. Ruth was fearless and full of ideas. She travelled everywhere and talked to everyone. She did not hesitate to take on any project, or ask any mathematician to contribute to our sessions. She thought a meeting should be more than just a sequence of short presentations. She organized social events and problem sessions and lengthened the talks so that people could discuss their work in more depth. We invited the mathematicians we would most like to hear talk, and to my amazement, many of them accepted! Our sessions succeeded far beyond my expectations - not in numbers, but in the level of mathematical discussion and the sense of mathematical community. It was as if by the sheer force of her personality, she could take any idea and make it happen.\nMichler was awarded a National Science Foundation Professional Opportunities for Women in Research and Education  Fellowship to visit the Mathematics Department of Northeastern University for the academic year\n2000\n-\n2001\nto work with Tony Iarrobino and Marc Levine. She died in a tragic accident:-\nDr Ruth Michler died\n1\nNovember\n2000\nin an pedestrian-construction truck accident a block from the Mathematics Department. She was returning to the Department on her bike, to get printout, to apply for a Radcliffe Bunting Fellowship for\n2001\n-\n2002\n. She had just given talks at Boston University's Algebra Seminar on Monday\n30\nOctober, and to Northeastern University's Geometry-Algebra-Singularities-Combinatorics Seminar on Monday\n16\nOctober.\nThe webpage for the 'Gathering To Commemorate Dr Ruth Ingrid Michler\n1967\n-\n2000\n, Noon,\n8\nNovember\n2000\n, Northeastern University's Sacred Space,\n201\nEll Building,\n360\nHuntingtion Avenue' states\n[\n6\n]\n:-\nIn October\n2000\n, she gave a talk entitled \"Isolated Hypersurface Singularities and their Differentials\" at the Northeastern University Geometry-Algebra-Singularities-Combinatorics Seminar, and also at Boston University's Algebra Seminar. She had spoken with many of us in the Department, and was developing new results; on the blackboard of her office is a short proof of a new theorem, written\n31\nOctober\n2000\n. We were enjoying her visit, and believe she was enjoying us. On\n1\nNovember\n2000\n, Ruth died tragically after an accident with a construction vehicle, on a corner near the Department. Ruth enjoyed music, including the symphony, and opera: she was a regular visitor to the Dallas Opera. She also was an avid long distance runner, who ran seven miles a day; she ran in most of the Boston Marathons, for the last five years. She was known for her energy, and the level of her commitment to all that she undertook.\nRuth Michler the runner has been mentioned several times in our biography above. Let us end with giving a few more details following Diane Meuser\n[\n5\n]\n:-\nRuth was a visiting mathematician at Northeastern University. She had completed the Chancellor Challenge\n100\nK Road Race on\n8\nOctober and the Cape Cod Marathon on\n22\nOctober of this year\n(2000)\n. Her previous ultra-running accomplishments included the East Texas Ultra-runners\n50\nK trail run, first place woman in the Cross Timbers\n50\nMile Trail Run in February\n1998\n, and successful completion of the Leadville Trail\n100\nMile Run in August\n1999\nin\n29\n:\n26\n:\n03\n. I met Ruth at a mathematics talk she gave at Boston University two days before her death. I was eagerly looking forward to hearing a talk by a woman mathematician\n(\nfairly rare\n)\n, in a subject area I was interested in\n(\nrarer still\n)\n, and was most astounded to learn that she was also quite an accomplished runner, having completed\n30\nmarathons and the above ultra races all while still at the relatively young\n33\nyears of age. I will certainly miss having the opportunity to run with her and I'm sure the ultrarunning community will miss her as well.\nAt the time of her death Michler was organising two conferences: \"Résolution des singularités et géométrie non commutative\"\nⓉ\n(\nSingularity resolution and non-commutative geometry\n)\nto be held at the Centre International de Rencontres Mathématiques at Luminy, France, from\n20\n-\n22\nJuly\n2001\n; and Algebraic Geometry to be held in Annapolis, Maryland, USA,\n25\n-\n28\nOctober\n2001\n. Following Michler's death, both conferences were held in her memory and a book was produced of the proceeding of both conferences entitled 'Topics in algebraic and noncommutative geometry' published by the\nAmerican Mathematical Society\nin\n2003\n.\nThe\nAssociation for Women in Mathematics\nawards the Ruth I Michler Memorial Prize in her honour. Here is where the funds for this prize came from:-\nAfter the district attorney decided not to prosecute those responsible\n[\nfor the accident\n]\n, Michler's family chose to invest her estate in legal proceedings that might offer a measure of justice for her death, which they believe resulted from negligence. Her father, Gerhard Michler, an emeritus professor of mathematics at the University of Essen in Germany, filed a civil action suit. More than five years later the Michler family won a sizeable settlement. Now, to pay lasting tribute to Michler's memory and to advance the careers of accomplished young women mathematicians, the Michler family has made a $\n1\nmillion gift to establish the Ruth I. Michler Memorial Prize of the Association for Women in Mathematics at Cornell.\nFirst awarded so that the prize could be taken up in the academic year\n2007\n-\n2008\n, it is awarded annually to a woman recently promoted to Associate Professor or an equivalent position in the mathematical sciences. The prize provides a fellowship for the awardee to spend a semester in the Mathematics Department of Cornell University without teaching obligations.\nYou can see winners of the Ruth I Michler Memorial Prize at\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}