{
  "nome_completo": "Sadi Nicolas Léonard Carnot",
  "nome_curto": "Sadi Carnot",
  "ano_nascimento": "1796",
  "ano_morte": "1832",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carnot_Sadi/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Sadi Carnot\nwas the eldest son of\nLazare Carnot\nand he was born in the Palais du Petit-Luxembourg. His younger brother was Hippolyte Carnot. At the time of Sadi's birth, his father was a member of the Directory, the French Revolutionary government which lasted four years from November\n1795\nto November\n1799\n. Sadi was given named after a medieval Persian poet and philosopher called Sa'di of Shiraz.\nSadi Carnot was born at a time of unrest and political turmoil in France and, due the position of his father, whose fortunes changed dramatically many times, he was brought up in a totally unstable environment of interacting politics and science. His father was appointed to the high office of Napoleon's minister of war in\n1799\n.\nLazare Carnot\nresigned in\n1807\nand devoted himself to the education of his two sons. Sadi had a fine teacher in his father, who taught him mathematics and science as well as languages and music.\nUnder his father's tuition, Sadi Carnot showed great promise and was sent to the Lycée Charlemagne in Paris to prepare him for the examinations to the École Polytechnique in Paris. In\n1812\n, at age\n16\nthe minimum age possible, Carnot entered the École Polytechnique where\nPoisson\n,\nAmpère\nand\nArago\nwere among his teachers.\nChasles\nwas in the same class as Carnot and their friendship lasted throughout Carnot's life. Carnot graduated from the École Polytechnique in\n1814\nbut, before he graduated, Carnot and other students from the École Polytechnique fought unsuccessfully with Napoleon to defend Vincennes. This skirmish against the Allies was fought just outside Paris, to the east of the city.\nAfter graduating, Carnot went to the École du Génie at Metz to take the two year course in military engineering. In\n1815\nNapoleon returned from exile for his famed Hundred Days rule. Carnot's father was appointed minister of the interior and Sadi Carnot was put in a somewhat difficult position in the military academy with his father in such a prominent position. In October\n1815\nafter the defeat of Napoleon, Carnot's father was exiled and he went to Germany never to return to France.\nIt is probable that a military career was not the easiest one for Carnot with his father in exile. Carnot was moved from place to place, given jobs of inspecting fortifications, drawing up plans and writing reports. However, it seems that he was not well treated and his recommendations were ignored. Unhappy at his lack of promotion and the refusal to give him a job which allowed him to make use of his training, in\n1819\n, he sat and passed the examinations to join the recently formed General Staff Corps in Paris. Almost immediately he took leave on half pay, living in Paris in his father's former apartment, but he remained on call for army duty.\nCarnot began to attend courses at various institutions in Paris, including the Sorbonne and the Collège de France. At this time he became interested in industrial problems and, in particular, began to study the theory of gases. His interests were wide\n[\n1\n]\n:-\nHe made frequent visits to factories and workshops, studied the latest theories of political economy, and left in his notes detailed proposals on such current problems as tax reform. Beyond this, his activity and ability embraced mathematics and the fine arts.\nCarnot visited his father in\n1821\nin his exiled home in Magdeburg. Hippolyte Carnot, his brother, was living with his father at this time. It is clear that there were many discussions about steam engines. The first steam engine had come to Magdeburg three years earlier and had interested\nLazare Carnot\n, and Sadi Carnot left Magdeburg filled with enthusiasm to develop a theory for steam engines. After returning to Paris, Carnot began the work which led to the mathematical theory of heat and helped start the modern theory of thermodynamics. E Mendoza explains in\n[\n2\n]\nthe background:-\nThe problem occupying Carnot was how to design good steam engines. Steam power already had many uses - draining water from mines, excavating ports and rivers, forging iron, grinding grain, and spinning and weaving cloth - but it was inefficient. The import into France of advanced engines after the war with Britain showed Carnot how far French design had fallen behind. It irked him particularly that the British had progressed so far through the genius of a few engineers who lacked formal scientific education. British engineers had also accumulated and published reliable data about the efficiency of many types of engines under actual running conditions; and they vigorously argued the merits of low- and high-pressure engines and of single-cylinder and multi-cylinder engines.\nThe first of Carnot's major works was a paper which he wrote in\n1822\n-\n23\n. This paper attempted to find a mathematical expression for the work produced by one kilogram of steam. The paper is similar in its aims and also in its methods to several other papers which appeared around this time by\nHachette\n,\nNavier\nand\nPetit\n. However\n[\n1\n]\n:-\nCarnot's work is distinguished for his careful, clear analysis of the units and concepts employed and for his use of both an adiabatic working stage and an isothermal stage in which work is consumed.\nFrom its style and detailed descriptions the paper was clearly intended for publication but Carnot never published it and its existence was only discovered in manuscript form in\n1966\n.\nWhen\nLazare Carnot\ndied in August\n1823\n, Hippolyte Carnot returned to Paris and there he helped Sadi Carnot to make the book on steam engines that he was working on at the time more understandable to the general public. In\n1824\nCarnot published this work, the only one he published during his lifetime,\nRéflexions sur la puissance motrice du feu et sur les machines propres à développer cette puissance\nⓉ\n(\nReflections on the motive power of fire and the machinery to develop this power\n)\nwhich includes his description of the \"Carnot cycle\". This book only became well known after\nClapeyron\npublished an analytic reformulation of it in\n1834\n. Carnot's ideas were later incorporated into the thermodynamic theory of\nClausius\nand\nThomson\n.\nCarnot continued with his research after the publication of his book and although nothing of this was published, notes that Carnot made as his ideas developed have survived. In\n1827\n, however, the General Staff Corps in Paris was reorganised and he was recalled to full time duties. He served for rather less than one year as a military engineer, being posted first to Lyon and then to Auxonne. Still unhappy with his career, Carnot retired permanently and returned to live in Paris where he aimed to continue with his research into the theory of heat.\nFollowing his father's political views, Carnot was strongly republican so he was pleased with the direction France seemed to be going with the July\n1830\nRevolution. Around this time he became interested in public life, in particular he was interested in improving public education. He was suggested for a government position, but he declined and, after the monarchy was restored, he returned to his scientific work. In June\n1832\nhe took ill and had not fully regained his strength when the cholera epidemic of\n1832\nhit Paris. Although only\n36\nyears of age, he died within a day of contracting cholera.\nThat Carnot's important book\nRéflexions sur la puissance motrice du feu et sur les machines propres à développer cette puissance\nⓉ\n(\nReflections on the motive power of fire and the machinery to develop this power\n)\nshould have been neglected at the time of its publication is certainly not because it went unnoticed. It was published on\n12\nJune\n1824\nand on\n26\nJuly of that year\nPierre Girard\ngave a long review of it to the\nAcadémie des Sciences\nin Paris.\nPierre Girard\n's review was a very positive one and was published in the\nRevue encyclopédique\n. Perhaps the problem with the review was that although it stated the theorems and the conclusions of Carnot's work fully, it did not comment on the highly original reasoning which Carnot had employed to achieve his results.\nIt is possible that Carnot's personality played a role in the lack of enthusiasm for his work in his lifetime. He is described in\n[\n2\n]\nas follows:-\nFriends described him as reserved, almost taciturn, but insatiably curious about science and technical processes.\nIn\n[\n1\n]\nhe is described in similar terms:-\nAlthough sensitive and perceptive, he appeared extremely introverted, even aloof, to all but a few close friends ...\nThe\nRéflexions\nwas an attempt by Carnot to answer two fundamental questions, firstly whether there was an upper limit to the power of heat, and secondly whether there was a better means than steam to produce this power. His attack on these questions was to produce a much more general theory than had previously been attempted based not on heat as random motion of atoms, as\nHooke\nand\nBoyle\nhad done, but by the concept of heat as a weightless fluid called caloric. He introduced the concept of the \"Carnot engine\", an ideal heat engine. He showed that the efficiency of the \"Carnot engine\" depends only on the temperature difference within the engine and not on the substance such as steam that drives the mechanism. He also introduced the important concept of reversibility, namely that motive power can be used to produce the temperature difference in the engine.\nNotes which Carnot made between\n1824\nand\n1826\nshow that he was moving away from the caloric theory. He set out in his notes details of experiments which he intended to carry out to study the temperature effects of friction in fluids. Some of these proposed experiments were identical with those actually performed by Joule twenty years later. It is likely that Carnot would have made many more significant scientific contributions had his life not been so tragically short.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}