{
  "nome_completo": "Samarendra Nath Roy",
  "nome_curto": "Samarendra Nath Roy",
  "ano_nascimento": "1906",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Roy/",
  "lugar_nascimento": "Calcutta, (now Kolkata) India",
  "lugar_morte": "Jasper, Canada",
  "biografia": "Samarendra Nath Roy\n's parents were Suniti Bala and Kali Nath Roy who was the editor of\nThe Tribune\n, a nationalist daily newspaper published in Lahore. Samarendra Nath was the oldest of his parents two children. A major incident occurred in April\n1919\nwhen the British massacred Indians at Jalianwala Baag.\nThe Tribune\npublished a news report,\nPrayer at the Jama Masjid\n, on\n6\nApril\n1919\n. Kali Nath Roy was brought before the Martial Tribunal under Lieutenant Colonel Irvine and was sentenced to rigorous imprisonment for two years and a fine of Rs\n1\n,\n000\n. All this occurred while Samarendra Nath was studying at the Khulna District School. He graduated in the first division in the Matriculation Examination of\n1923\nand entered the Daulatpur Hindu Academy later that year. The Academy was situated in Khulna and had been affiliated to the University of Calcutta since\n1914\n. He was ranked first in the Intermediate Science\n(\nHigher Secondary\n)\nExaminations from the Academy in\n1925\n. Then, remaining in the University of Calcutta, he moved to Presidency College Kolkata. He obtained a B.Sc. Mathematics\n(\nHonours\n)\nin\n1928\n, being ranked first in the list of First Class students. He continued to study for a Master's Degree and was awarded an M.Sc. in\n1931\nhaving submitted a dissertation on the\nTheory of Relativity\n.\nAfter completing work for his Master's Degree, Roy was appointed as a Research Associate in the Applied Mathematics Department of Calcutta University to work on cosmology with N R Sen. This work led to partial differential equations which could only be solved numerically, but at this time the Applied Mathematics Department had no computing facilities. Roy was allowed to use the computing facilities in the Indian Statistical Institute, which were the only such facilities available in Calcutta. The Institute was run by\nP C Mahalanobis\nand soon Roy became interested, not only in solving his cosmological problems, but also in the statistical work of the Institute. He joined the Institute in\n1934\non a part-time basis, then became a full-time member in the following year.\nIn the Indian Statistical Institute he quickly moved to become the leader of a group of talented young statisticians such as\nRaj Chandra Bose\n, K R Nair, K Kishen,\nC R Rao\n, J M Sengupta and H C Sinha. He made important contributions to multivariate analysis, working on his own and also collaborating with other members of the group. There was no Department of Statistics in the University of Calcutta at this time so, in\n1938\n, while continuing to undertake research in the Statistical Institute, he was appointed as a lecturer in the Applied Mathematics Department. Three years later, after the Statistics Department had been set up, he transferred from Applied Mathematics to Statistics and, together with\nPrasanta Chandra Mahalanobis\nand\nRaj Chandra Bose\n, set up the course structure and content. Roy soon gained important positions within the Statistical Institute and the Statistics Department, being assistant director of the former from\n1946\nto\n1949\nand acting Head of the Statistics Department during\n1947\n-\n48\n. A sample of the papers Roy published during this period follows:\nThe use and distribution of the Studentized\nD\n2\nD^{2}\nD\n2\n-statistic when the variances and covariances are based on k samples\n(1940)\n,\nOn hierarchical sampling, hierarchical variances and their connexion with other aspects of statistical theory\n(1940)\n,\nThe distribution of the root-mean-square of the second type of the multiple correlation co-efficient\n(1940)\n,\nAnalysis of variance for multivariate normal populations: the sampling distribution of the requisite p-statistics on the null and non-null hypotheses\n(1942)\n,\nBernoulli's theorem and Tshebycheff's analogue\n(1945)\n,\nOn a certain class of multiple integrals\n(1945)\n,\nNotes on testing of composite hypotheses\n(1947)\n, and\nOn the construction of an unbiassed and most powerful critical region out of any given statistic\n(1948)\n.\nRoy travelled to the United States in the spring of\n1949\nto take up a Visiting Professorship of Statistics at Columbia University in New York. He returned to India for the beginning of the academic year\n1949\n-\n50\nand became Head of the Department of Statistics in the University of Calcutta. However, in the spring of\n1950\nhe returned to the United States to take up a position as a full professor in the Statistics Department of the University of North Carolina. He published\nSome aspects of multivariate analysis\nin\n1957\n, a book which brought together many of the ideas Roy had published. S Kullback writes:-\nThis monograph does not attempt to cover the entire area of multivariate analysis, the statistical analysis of samples from multivariate normal populations, or even a major part of it. The monograph deals with samples of fixed size, and the main emphasis is on obtaining confidence bounds on certain parametric functions that are a set of natural measures of deviation from a null hypothesis. The first twelve chapters lead up to the confidence bounds which are discussed in detail in chapters\n13\nand\n14\n. In chapter\n15\n, the last of the monograph, some nonparametric generalizations of analysis of variance and multivariate analysis applied to categorized data in contingency tables are considered ...\nG S Mudholkar, who was Roy's final doctoral student, writes\n[\n5\n]\n:-\nRoy was a courteous, gentle and modest person who was admired and respected by all who knew him. He was an inspiring, caring teacher always thoughtful of his students' concerns and feelings. He was a creative and original yet low-key and self-effacing scholar who gave academic help to anyone who needed it. As a thesis advisor he was demanding yet generous and responsible. He was always mindful of the personal conditions and problems of his students. In the words of his doctoral student Yashwant Sathe, he emphasized the \"fundamentals of the subject\" and \"treated all his Ph.D. students on equal footing and as his family members\". In a recent communication, Dr Sathe recalled his caring nature by describing Roy's\n1962\nvisit to Pune, India, when I, Mudholkar, was in the final stage of my thesis. Roy made it his duty to visit my family to tell them of my progress and to reassure them of my well-being and a reasonable future. Another of his doctoral students, Ram Gnanadesikan ... has observed that his \"rare and genuine modesty was as exemplary as his quiet intellectual timber was exciting\". He continues further, \"As the Bard of Avon so aptly said it:\nHis life was gentle, and the elements\nSo mixed in him that Nature might stand up\nAnd say to all world, \"This was a man\".\nIndeed, looking back on his life and work it is easy to see that he made unusual contributions to statistics and therefore to science and consequently to well-being of all.\nIn\n[\n1\n]\n, his colleague\nRaj Chandra Bose\nwrites:-\nRoy was one of the most self-effacing of men. To his students and to his numerous friends and relatives he gave of his best without any regard for his own convenience. He had a keen sense of humour and a warm friendly personality. He was a stimulating colleague and a dedicated teacher-scholar in the best academic tradition. He was a devoted husband and loving father ...\nJagdish N Srivastava writes in\n[\n8\n]\n:-\nProfessor S N Roy was not just one man; he was a procession of men. He was a profound and fundamental thinker and researcher in many wide fields of Statistics. He was not only a good father and husband, but also very fatherly to the students. Exceptionally compassionate, he went into great details of the day to day problems, difficulties, health concerns, and the joys and sorrows of his students, and offered them generous advice and help. He occasionally invited them to his home for dinner, where they were treated as if they were with their own parents. He was very informal. He was a man who practised simple living and high thinking. He was above favouritism and narrow-mindedness. He believed that every human being deserved to live in freedom and dignity. He had a great vision for the world including India where he was born. That vision, with respect to which he was awake and which he carefully practised in his life, can be aptly summarized by the poem of Tagore\n(\nNobel Prize,\n1913)\n:\nWhere the mind is without fear and the head is held high\nWhere knowledge is free\nWhere words come out of the depth of truth\nWhere tireless striving stretches its arms towards perfection\nWhere the clear stream of reason has not lost its way into the dreary desert sand of dead habit\nWhere the mind is led forward by Thee into ever widening thought and action\nInto that heaven of freedom, my Father, let my country awake.\nRoy received many honours for his outstanding contributions. He was elected a Fellow of the National Institute of Sciences in India in\n1946\n, a Fellow of the International Statistical Institute in\n1951\n. He was President of the Statistical Section of the Indian Science  Congress in\n1948\n. He was a Fellow of the Institute of Mathematical Statistics. In\n1970\nthe book\nEssays in probability and statistics\n, edited by\nR C Bose\n, I M Chakravarti,\nP C Mahalanobis\n,\nC R Rao\nand K J C Smith, dedicated to his memory was published in the University of North Carolina Monograph Series in Probability and Statistics. In\n2007\na special issue of the\nJournal of Statistical Planning and Inference\nwas published in celebration of the centennial of the birth of Samarendra Nath Roy.\nRoy was married to Bani Roy; they had four children, Prabir, Subir, Tapon and Sunandra Roy. He died while on holiday in Jasper, Canada.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}