{
  "nome_completo": "Samuel Carlos Gitler Hammer",
  "nome_curto": "Samuel Gitler",
  "ano_nascimento": "1933",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gitler/",
  "lugar_nascimento": "Cuauhtémoc, Mexico City, Mexico",
  "lugar_morte": "Mexico City, Mexico",
  "biografia": "Samuel Gitler\nwas the son of Moises Gitler Hammer\n(\nborn in Czestochowa, Poland on\n1\nApril\n1907)\nand his wife Mariem. Moises\n(\nwhose name sometimes appears as Mojzesz\n)\nand Mariem Gitler\n(\nwhose name sometimes appears as Miriam\n)\nwere Polish Jews who married in Poland and, together with their parents, they emigrated to Mexico in\n1933\n. Mariem was pregnant with their first child when they left Poland and Samuel Gitler, the subject of this biography, was born in Mexico City soon after they reached Mexico. Their second child, Mario Gitler, was born on\n11\nFebruary\n1937\nalso in Mexico City. Samuel's mother, however\n[15]\n:-\n... passed away when he was a few years old. His childhood was spent in the Bohemian atmosphere of his grandparents' house.\nLet us note at this point that there is detailed, but completely incorrect, information about Samuel Gitler's family on ancestry.com where he has been assigned to the wrong Gitler family.\nSamuel attended primary school in Mexico City. When he was thirteen years old his father sent him to San Antonio, Texas, USA, to attend Junior High School. He flew from Mexico City to San Antonio, Texas, on American Airlines, arriving in San Antonio on\n9\nSeptember\n1946\n. He returned to Mexico City for Christmas\n1946\n, returning to San Antonio, Texas on American Airlines on\n6\nJanuary\n1947\n. Back in Mexico City over the summer vacation, he returned again to San Antonio on\n5\nSeptember\n1947\n. It was at the Junior High School in San Antonio that Samuel first found his talent and love of mathematics. Although his English was poor, the mathematics teacher would praise him in front of the class, telling the other students that he was better than any of them at mathematics even if he struggled to speak English.\nBack in Mexico City for Christmas\n1947\n, he began his studies at Escuela Nacional Preparatoria in January\n1948\n. This school, the oldest and one of the most prestigious senior high schools in Mexico, belonged to the National Autonomous University of Mexico\n(\nUNAM\n)\n. At Escuela Nacional Preparatoria, Gitler was taught by Eli Eduardo de Gortari\n(1918\n-\n1991)\n. Gortari had studied engineering at the UNAM, then became a sanitary engineer but continued to study mathematics and philosophy which led to him becoming a teacher and professor. He quickly saw the mathematical potential in young Gitler and began to teach him introductory material on topology. He told Gitler that topology was the topic for him and gave the boy a topology book to study; Gitler loved it. The Escuela Nacional Preparatoria not only set him up to be a topologist, but it was also where he met fellow student Raquel Goldwain whom he later married. Raquel had been born in Mexico City on\n19\nMarch\n1935\n.\nGitler graduated from the Escuela Nacional Preparatoria in\n1952\nand later that year began his studies of engineering at the National School of Engineering\n(\nENI\n)\n, part of the National Autonomous University of Mexico. In his first year of the engineering course he was taught calculus by Emilio Lluis Riera\n(1925\n-\n2020)\n. Riera had a bachelor's and master's degree from the UNAM and when he taught Gitler he was near to completing his doctorate in mathematics at the new Ciudad Universitaria. Riera quickly spotted Gitler's potential as a mathematician and advised him to enrol in the B.Sc. mathematics course. He did this but did not give up his engineering degree so at this stage he was studying for two degrees simultaneously. In addition, he was also teaching mathematics at the ENI. When he began to undertake this heavy load, at least engineering and mathematics were taught in the same building but after a year mathematics moved to the new Ciudad Universitaria on the opposite side of Mexico City\n[14]\n:-\n... every day he crisscrossed the city starting early in the morning the engineering courses; then teaching mathematics at ENI, and then until\n10\npm studying mathematics; not only that: he decided to finish engineering in only\n4\nyears so he had an accelerated pace.\nHe wrote an engineering thesis advised by Heberto Castillo Martínez\n(1928\n-\n1997)\nwho later had a political career as an activist for workers' rights.\nGitler had been lucky that his Jewish parents had fled from Poland before World War II. He also benefitted in perhaps a very surprising way.\nSolomon Lefschetz\nhad a great love for travel and during the\n1920\ns and\n1930\ns had made many trips to European countries. The outbreak of World War II in\n1939\nmeant that Europe was no longer possible for travel so\nLefschetz\nlooked for other places to visit. Mexico seemed like a good choice and in\n1944\nhe spent the summer in Mexico City at the National Autonomous University of Mexico. It was the first of many visits and he eventually fell into the habit of spending the summer months there every year. He continued this until\n1966\n.\nLefschetz\nhad arranged for the outstanding young mathematician\nJosé Adem\nto go to Princeton for his Ph.D. studies in\n1949\nand then five or six years later he met up with Gitler in the Ciudad Universitaria and realised that here was another outstanding young mathematician. By this time\nJosé Adem\nwas a researcher in the Ciudad Universitaria and had got to know Gitler.\nLefschetz\ntalked with\nJosé Adem\nand both felt sure that Gitler should go to Princeton to undertake research for a Ph.D.\nBefore travelling to Princeton, Gitler married Raquel Goldwain in September\n1956\n. The newly married couple then flew with Air France from Mexico City to Idlewild Airport, New York, arriving there on\n11\nSeptember\n1956\n. At Princeton,\nNorman Steenrod\nwas Gitler's thesis advisor. Gitler graduated with a Ph.D. in\n1960\nhaving submitted his\n95\n-page thesis\nCohomology Operations with Bundles of Coefficients\n. In\n1963\nhe published the paper\nCohomology Operations with Local Coefficients\nin which he gives the following note\n[13]\n:-\nThis paper contains the main results of a Doctoral Thesis developed by the author under the guidance of Prof\nN E Steenrod\nand submitted to Princeton University in\n1960\n.\nSamuel and Raquel Gitler had three children, Isidoro Gitler\n(\nborn\n2\nAugust\n1957\nin Princeton\n)\n, Miriam Gitler\n(\nborn\n28\nDecember\n1958)\nand Susanna Gitler. The family lived at\n228\n-B Halsey Street in Princeton and made several trips back to Mexico City during their time there. For example Samuel, Raquel and Isidoro returned to Princeton from a visit to Mexico City on\n15\nJuly\n1958\n. Also Samuel, Raquel, Isidoro and Miriam Gitler flew back to Princeton from their\n1959\nsummer visit to Mexico City on\n19\nOctober. Samuel's father, Moszesz Gitler Hammer, had flown from Mexico City to New York on\n2\nAugust\n1959\ngiving\n228\n-B Halsey Street, Princeton as his United States address.\nAfter graduating, Gitler spent a short spell at Brandeis University in Waltham, Massachusetts. On\n9\nAugust\n1960\nhe flew into New York giving his address in Waltham as\n32\nConcord Road. He returned to Mexico City in\n1961\nand, together with\nJosé Adem\n, founded the Mathematics Department of the Centre for Research and Advanced Studies of the National Polytechnic Institute\n(\nCinvestav\n)\n. This Centre was founded on\n17\nApril\n1961\nand was initially planned as a postgraduate department of the National Polytechnic Institute. Gitler worked at this Mathematics Department from\n1961\nto\n1987\n, becoming a full professor in\n1964\n. He also collaborated in\n1961\nin the foundation of the Higher School of Physics and Mathematics of the National Polytechnic Institute.\nThe authors of\n[14]\nwrite:-\nThe work of Sam Gitler is one of the more remarkable oeuvres in Mexican science in the XX century. Sam Gitler together with\nJosé Adem\nfounded the modern Mexican mathematical school in algebraic topology, and maintained the highest standards in mathematical research in Mexico during decades in which, with no internet and repeated severe economical crisis, the isolation was considerable. Both were the founding fathers of the Department of Mathematics at the Centre of Research and Advanced Studies\n(\nCentro de Investigación y de Estudios Avanzados del IPN-Cinvestav\n)\n, one of the most important mathematics departments in Latin America. While he published in many international journals of the highest regard, it is notable that most of his papers appeared in the Boletín de la\nSociedad Matemática Mexicana\nsolidifying its prestige as a venue for topology, for this was the intellectual love of Gitler's life: algebraic topology.\nThe work that Gitler undertook in algebraic topology is rather too technical to describe here in detail. Let us give at least a flavour with some quotes from\n[16]\n:-\nOne of the problems that Gitler attacked with lucidly\n(\ntogether with\nJosé Adem\nand other collaborators\n)\nwas the celebrated immersion problem. This problem asks whether projective geometries with points at infinity in any dimension\n(\nBrunelleschi\n(1404\n-\n1472)\n,\nKepler\n,\nDesargues\n(1591\n-\n1661)\n,\nMonge\n,\nChasles\n,\nPoncelet\n, etc.\n)\ncan be immersed in ordinary Euclidean geometries.\nDavid Hilbert\nasked his student Werner Boy to show that it was impossible to find an immersion of the real projective space of dimension two\nR\nP\n2\n\\mathbb{R}P^{2}\nR\nP\n2\ninto the classical Euclidean space\nR\n3\n\\mathbb{R}^{3}\nR\n3\nin\n1901\n;\nHilbert\nwas very surprised as Boy found such an immersion. Another important result was\nWhitney\n's embedding theorem which states that every n-manifold admits an embedding into\nR\n2\nn\n−\n1\n\\mathbb{R}^{2n-1}\nR\n2\nn\n−\n1\n, together with Boy's result, at the beginning of Gitler's career, no additional explicit immersions were known. ... Gitler published one paper per year devoted to the problem from\n1963\nto\n1969\n.\n...\nThe opus magnum of Gitler was undoubtedly 'A Spectrum whose Cohomology is a certain Cyclic Module over the Steenrod Algebra'\n(\nTopology,\n1972)\n, in collaboration with Ed Brown; one of the most relevant works in algebraic topology of the twentieth century. It became a fundamental building block of modern homotopy theory going well beyond its original motivation.\nGitler made many research visits throughout his career. He was invited to the Institute for Advanced Studies in Princeton, United States on several occasions. He was there from August\n1964\nto April\n1965\n, again from September\n1985\nto June\n1986\nand from September\n2010\nto May\n2011\n. He was invited to spend several months at All Souls College, Oxford, England, beginning in September\n1976\n. As with many of his visits, his family were with him. Elias Micha, also a Mexican, was undertaking graduate studies at Oxford at this time and writes in\n[17]\n:-\nIt was in Oxford where I had the opportunity to meet the Gitler family and where I became another member of it, inasmuch as my friendship with Sam was extended from the beginning to Rachel and to his children Isidoro, Miriam, and Susy. With incredulity, I became aware that the doors of Sam's home were always open, and that it was a meeting place for several mathematicians and friends. The hospitality and cordiality with which me and my family were greeted by Rachel, her disposition to lodge us for several days and feed us splendidly, made me feel from the start as another member of that wonderful family, which I consider a fundamental part of my life.\n...\nA distinctive quality of Sam's personality that I cannot omit is his exaggerated humility. Just as much in the clothes that he wears everyday, as in his personal manner, Sam does not carry on his shoulders the weight of the postures of the famous and conceited intellectual, or of the inaccessible man of success. On the contrary, he seems to pass, anxious not to be noticed. I recall the occasion in Oxford when, at tea time, Sam was taking about mathematics\n(\nfor a change\n)\nto a group of students, myself included, when he hastily told us that he was going to travel to Mexico for about four days to receive a small recognition, and rapidly returned to the subject of mathematics. Several months later we learned that in that trip to Mexico, Sam received from the President of the country, The National Prize for the Sciences, which is the highest award possible for a Mexican Scientist.\nFor more of Elias Micha's appreciation of Sam Gitler, see\nTHIS LINK\n.\nIn\n1987\nGitler accepted an invitation to become the Chairman of the Mathematics Department at the University of Rochester in Rochester, Monroe County, New York in the United States. While there, he lived at\n459\nFrench Road in Rochester. At this time Mexico was going through an economic crisis and this was a factor in his decision to go to the United States. The\nNew York Times\nof\n16\nDecember\n1987\nreported\n[20]\n:-\nThe Mexican Government is struggling to regain control of an economic crisis that has unleashed a new round of record inflation, caused Mexicans to shun the peso and send their savings abroad, and stirred up labour discontent. Tonight, the Government announced an ''economic solidarity pact'' that includes sweeping tax increases and budget cuts designed to reduce the deficit.\nThe authors of\n[14]\nwrite:-\nIn Rochester, he helped to build one of the most important groups in topology in the world.\nIn\n2001\nGitler returned to his former position at the Mathematics Department of the Centre for Research and Advanced Studies of the National Polytechnic Institute in Mexico City.\nMany honours and awards were given to Gitler. We have already mentioned the National Prize of Science in\n1976\n, but he was also president of the\nMexican Mathematical Society\nfrom\n1967\nto\n1969\n, chair at Cinvestav from\n1973\nto\n1981\n, a member of El Colegio the Nacional from\n1986\n, the highest recognition for his achievements given to members of the Mexican scientific and artistic community, and elected an inaugural fellow of the\nAmerican Mathematical Society\nin\n2012\n.\nA conference\nHomotopy Theory and Its Applications\nin honour of Samuel Gitler's sixtieth birthday was held at Cocoyoc, Mexico\n9\n-\n13\nAugust\n1993\n. The editors write in the Preface\n[\n1\n]\n:-\nIn August\n1993\na meeting was held in Cocoyoc, Mexico on the subject of Homotopy Theory and its Applications. There were many foreign participants in addition to a number of Mexican topologists. The main focus of the meeting was to highlight the current development of methods in homotopy theory, and how they can be applied to interesting problems involving classifying spaces, moduli spaces, representation theory, etc. The\n16\npapers in this volume testify to the diversity and activity in this area of mathematics.\nThis conference was partly held to celebrate Samuel Gitter's sixtieth birthday. ... Sam Gitler has contributed significantly to the development of mathematics in Mexico. He served as editor of the Boletín de la\nSociedad Matemática Mexicana\nand ran many seminars which helped to educate young topologists in Mexico.\nIn\n2002\nan English translation of a Spanish text written by Gitler in collaboration with Marcelo Alberto Aguilar and Carlos Prieto de Castro with title\nAlgebraic topology from a homotopical viewpoint\nwas published. The publisher writes:-\nThe purpose of this book is to introduce algebraic topology using the novel approach of homotopy theory, an approach with clear applications in algebraic geometry as understood by Lawson and\nVoevodsky\n. This method allows the authors to cover the material more efficiently than the more common method using homological algebra. The basic concepts of homotopy theory, such as fibrations and cofibrations, are used to construct singular homology and cohomology, as well as K-theory. Throughout the text many other fundamental concepts are introduced, including the construction of the characteristic classes of vector bundles. Although functors appear constantly throughout the text, no knowledge about category theory is expected from the reader. This book is intended for advanced undergraduates and graduate students with a basic knowledge of point set topology as well as group theory and can be used in a two semester course.\nIt was reviewed by Donald Davis who wrote\n[\n6\n]\n:-\nThis carefully written text presents a new approach to a first course in algebraic topology. The main novelty is defining the homology groups of a\n(\npointed path-connected\n)\nCW complex as the homotopy groups of its infinite symmetric product. Cohomology groups are defined as homotopy classes of maps into\nEilenberg\n-\nMac Lane\nspaces, which are defined as infinite symmetric products of Moore spaces. This differs dramatically from most standard texts by making no mention of singular or simplicial homology. ... The novel approach to homology used in this book can be disconcerting to one who is used to the standard treatment. ...\n...\nIn conclusion, this text has developed a truly new approach to introductory algebraic topology.\nA conference\nRecent Developments in Algebraic Topology\nin honour of Samuel Gitler's seventieth birthday was held at San Miguel de Allende, Mexico\n3\n-\n6\nDecember\n2003\n. The editors write in the Preface\n[\n2\n]\n:-\nA conference on homotopy theory was held at San Miguel de Allende, México, on\n3\n-\n6\nDecember\n2003\n. The conference covered several areas of current interest in the field ... The meeting was organised by the Department of Mathematics of the Centro de Investigación y de Estudios Avanzados del IPN\n(\nCINVESTAV\n)\nto celebrate Sam Gitler's seventieth birthday. It was extraordinary to see that the meeting was attended by many of his collaborators, colleagues, students, and friends. ...\nIn spite of the different important positions he has held, he has always been an enthusiastic topologist in his more than forty years of professional activity. Sam has written over forty papers as well as several books. All of them show a deep knowledge of topology and an acute point of view. Sam has been an active teacher. Several generations of mathematicians have benefitted from his expertise as well as from his immense generosity.\nPablo Cabanas Diaz writes in\n[\n5\n]\nabout Gitler's remarkable work:-\nHis mathematical work is one of the most notable within\n20\nth century Mexican science. He was the founder of the modern Mexican mathematical school. He was able to sustain very high standards in mathematical research in Mexico for decades; if we consider that he achieved it at a time when there was no internet and during serious and repeated economic crises. His achievements are impressive given that Mexico's isolation in the field of mathematics was enormous. His contributions to mathematical knowledge materialised in nine collaborations in books, journals and conference proceedings, and in sixty-four articles published in specialised journals of the highest level, either individually or in collaboration with some of his colleagues.\nGitler died on Wednesday\n10\nSeptember\n2014\nand a Jewish funeral was held on the following day. His wife Raquel died at the age of\n87\non Sunday,\n24\nJuly\n2022\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}