{
  "nome_completo": "Samuel Karlin",
  "nome_curto": "Samuel Karlin",
  "ano_nascimento": "1924",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Karlin/",
  "lugar_nascimento": null,
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Although\nSamuel Karlin\nwas born in Poland, his family emigrated to the United States when he was two months old. The family settled in Chicago, but found difficulties which became much worse due to the Great Depression which began in\n1929\n. By\n1933\nthe Depression had reached its most severe stage and Karlin, although only nine years old, started working in a store to help with the family's finances.\nKarlin's father wanted his son to study religion, but after Karlin won a scholarship he was able to attend the Illinois Institute of Technology. He then went to Princeton University where he studied for a Ph.D. with\nSalomon Bochner\nas his advisor. Karlin was awarded his doctorate in\n1947\nfor his thesis\nIndependent Functions\n. He was appointed to the California Institute of Technology in\n1948\nand began publishing papers on\nfunctional analysis\nsuch as\nUnconditional convergence in Banach spaces\n(1948)\n,\nBases in Banach spaces\n(1948)\n,\nOrthogonal properties of independent functions\n(1949)\n, and\n(\nwith L S Shapley\n)\nGeometry of reduced moment spaces\n(1949)\n.\nFrom about\n1950\nhis research interests changed and he began to work on game theory. This interest had arisen through his years at Princeton when he had been influenced by\nJohn von Neumann\nwho published his classic text\nTheory of Games and Economic Behaviour\n, written with\nOskar Morgenstern\n, at about the time Karlin arrived at Princeton. Karlin published papers such as\nSolutions of discrete, two-person games\n;\nPolynomial games\n; and\nGames with continuous, convex pay-off\nall in\n1950\n.  In\n1956\nhe was appointed to Stanford University. His interest in game theory continued and he worked for the RAND Corporation, in addition to lecturing at Stanford. At RAND he\n[\n1\n]\n:-\n... applied game theory to the analysis of games of pursuit and evasion like a dogfight between warplanes.\nIn\n1958\nhe published the book\nStudies in the mathematical theory of inventory and production\nwhich was written jointly with Kenneth Arrow and Herbert Scarf. This book made a major contribution to mathematical economics and operations research. In\n1959\nhe published the book\nMathematical methods and theory in games, programming and economics\n. This was a major two volume work, the first volume being\nMatrix games, programming, and mathematical economics\nwhile the second volume was\nThe theory of infinite games\n. Karlin wrote in the Introduction:-\nWe may summarize our aims as an attempt to unify the mathematical techniques of the field and to help crystallize the concepts underlying these kinds of decision problems. It is not our purpose to propose a formal structure which will encompass all the problems in the areas covered. ... The coverage of these volumes is in no sense exhaustive; I have stressed most what appeals to me.\nLarge numbers of papers and books on a wide range of topics continued to flow from his pen. We indicate the range of the work by listing some of the books. In addition to those already mentioned, he wrote:\n(\nwith William Studden\n)\nTchebycheff systems: With applications in analysis and statistics\n(1966)\n;\nA first course in stochastic processes\n(1966)\n; and\nTotal positivity. Vol. I\n.\n(1968)\n;\n(\nwith Howard Taylor\n)\nAn introduction to stochastic modeling\n(1984)\n. The aim of this last mentioned book is described in the Preface being:-\n... to bridge the gap between basic probability know-how and an intermediate level course in stochastic processes, for example, 'A first course in stochastic processes' by the present authors.\nTotal positivity is a subject in which Karlin played a major role. The importance of the subject is described by I I Hirschman, Jr:-\nThese ideas play a basic role in problems involving convexity, moment spaces, orthogonal polynomials,\nChebyshev\nsystems, the oscillation properties of linear differential equations, and the theory of approximation. They figure in an essential and elegant way in the theory of stochastic processes, especially in linear diffusion processes. Finally, they are important in various applications - in statistics where they are fundamental to the understanding of statistical decision procedures, and also in such topics as inventory control and reliability theory.\nKarlin received many honours throughout his career including a lifetime achievement award from the\nNational Academy of Sciences\nin\n1973\n, the\nJohn von Neumann\nTheory Prize in\n1987\n, and the National Medal of Science in\n1989\n.  The citation for the\nJohn von Neumann\nTheory Prize reads:-\nSamuel Karlin has been awarded the ORSA/TIMS\nJohn von Neumann\nTheory Prize for\n1987\nfor his contributions to the theory of games, inventory theory, decision theory, birth-death and diffusion processes, total positivity and the theory of approximations.\nThrough his sustained research productivity over the past forty years at The California Institute of Technology and at Stanford University, he has contributed richly to the methodology of operations research and management science at a deep and fundamental level. His many books have influenced teaching and research in all areas of operations research and have provided a standard of excellence greatly admired. Over the years, his vitality, scholarship and industry have generated more than fifty research students with spin-off in such diverse areas as reliability theory and queuing theory.\nHis important contributions to genetics, though peripheral to operations research and management science, attest to the great breadth of his contributions. As a tribute to this breadth and vitality, we award Samuel Karlin the\nJohn von Neumann\nTheory Prize.\nAs this quote indicates, Karlin moved towards applying mathematical techniques in biology in the last portion of his career. In particular he  concentrated on the development of mathematical and computational techniques and tools for the analysis of DNA and protein sequences. He worked on descriptive and statistical analysis of protein structure properties, including methods for characterizing and comparing protein structures and sequences. Papers in this area include\nDistinctive features of large complex virus genomes and proteomes\n,\nA Theoretical and Numerical Assessment of Genetic Variability\n, and\nSome Natural Viability Systems for a Multiallelic Locus: A Theoretical Study\n. We should note that the papers and books we have listed form a very small fraction of Karlin's total output since he published over\n450\nworks.\nKarlin married Dorit Carmelli; they had three children - Kenneth\n(\na chemistry professor at Johns Hopkins University\n)\n, Manuel and Anna.\nHe continued to undertake research despite becoming physically frail towards the end of his life. In\n[\n2\n]\nhis death is described as taking place:-\n... at Stanford Hospital after a massive heart attack.\nAs to his character, he is described in\n[\n1\n]\nas follows:-\nHe was known for the emotional force, not to mention volume, with which he argued scientific points.\nIn the same article, Russ Altman, a professor of bioengineering at Stanford, is quoted as saying:-\nI would not say he was intellectually gentle.\nPerhaps we should end with a quotation from Karlin. This well-known quote is from the eleventh\nR A Fisher\nMemorial Lecture which Karlin delivered at  the\nRoyal Society of London\non\n20\nApril\n1983\n:-\nThe purpose of models is not to fit the data but to sharpen the questions.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}