{
  "nome_completo": "Samuel Arthur Saunder",
  "nome_curto": "Samuel Saunder",
  "ano_nascimento": "1852",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Saunder/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Samuel Saunder\nwas the son of William Deacle Saunder\n(1812\n-\n1888)\nand Sarah Patience Nokes\n(1815\n-\n1894)\n. William Saunder, the son of the surgeon Samuel Saunder\n(1774\n-\n1856)\nand Sarah Williamson\n(1772\n-\n1842)\nbecame a dental surgeon having obtained the Certificate of Qualification in Dental Surgery from the Royal College of Surgeons. He lived at Lower Seymour Street, Portman Square, London. William Deacle Saunder had a son William Saunder born in\n1839\nwith his first wife. After the death of his first wife, William Deacle Saunder married his second wife Sarah Patience Nokes in St Mary the Virgin and St Cedd Church in Stifford, Essex, on\n12\nNovember\n1842\n. They had four children: Sarah Anne Saunder\n(\nborn\n1850\n, who died as an infant\n)\n, Samuel Arthur Saunder\n(1852\n-\n1912)\n, the subject of this biography\n)\n, Francis Sarah Saunder\n(1854\n-\n1909)\nand George Douglas Saunder\n(1856\n-\n1931)\n.\nSamuel Arthur Saunder was educated as St Paul's School, a famous independent school founded in\n1509\n. He showed exceptional mathematical ability and was admitted as a pensioner to study the mathematical tripos at Trinity College Cambridge on\n8\nJuly\n1871\n. He began his studies at Trinity College in October\n1871\nand was taught by leading mathematicians including\nGeorge Stokes\n,\nJohn Couch Adams\nand\nJames Clerk Maxwell\nin applied mathematics and\nArthur Cayley\nin pure mathematics. He was awarded a scholarship in\n1874\n.\nSaunder was one of several outstanding undergraduates taking the mathematical tripos at that time. These included\nWilliam Burnside\n, first at St John's College but later at Pembroke College,\nGeorge Chrystal\nat Peterhouse, who had already been awarded a first class honours degree from the University of Aberdeen, and John William Lord of Trinity College. Despite being in a class with such outstanding fellow students, Saunder was predicted to be ranked in the top three places in the mathematical tripos, and many expected him to be the Senior Wrangler. The pressure, however, proved too much for Saunder and he had a mental collapse during the examinations. In fact he left at least one of the papers completely blank, but despite this he was still listed as the fourteenth Wrangler. We note that John William Lord was the Senior Wrangler with\nChrystal\nand\nBurnside\nbeing placed equal Second Wranglers.\nWhile an undergraduate at Cambridge, Saunder, like his fellow student\nWilliam Burnside\n, was an enthusiastic rower. Saunder was presented with the Colquhoun Sculls, a pair of silver sculls, that he was allowed to keep from Easter\n1875\nwhen he won the sculling match, until November\n1875\n.\nSaunder graduated from Cambridge on\n30\nApril\n1875\nand later that year worked with\nGeorge Chrystal\nin the Cavendish Laboratory. Yousuf writes\n[\n21\n]\n:-\nJust after his graduation from Cambridge in the spring of\n1875\n, a series of experiments was made by\nGeorge Chrystal\nwith a view to comparing the different resistance coils of the set of\nBritish Association\nUnits formerly deposited at Kew Observatory and now in the Cavendish Laboratory. In view of possible change in resistance of any or all of them, it was important to compare them with each other at frequent intervals. The comparison was difficult because accurate temperature determinations were almost impossible owing to the wires being embedded in solid paraffin. In the month of October a final set of experiments was made, which was the work of both\nGeorge Chrystal\nand S A Saunder, sometimes working together and sometimes separately. The results of these experiments were submitted by them to the\nBritish Association\nand the General Committee of the\nBritish Association\nordered these to be printed in extenso among the reports of the\nBritish Association\nmeeting at Glasgow.\nAn extract from this Report\n[\n4\n]\nby\nChrystal\nand Saunder can be read at\nTHIS LINK\n.\nIn\n1876\nSaunder was appointed assistant mathematics master at Wellington College, an independent school in the village of Crowthorne, Berkshire, England. The school had been built to honour the Duke of Wellington and its foundation stone had been laid by Queen Victoria on\n29\nJanuary\n1859\n. Although Saunder was initially saddened by the fact that his mental collapse during the Cambridge examinations had meant he would not be able to continue with a research career, nevertheless he soon came to love his teaching post\n[\n8\n]\n:-\nSaunder was a man of many interests and a hard worker at them all. To his regular school duties he added the care of the Scientific Society, which included the arrangement of lectures, many of which he gave himself, and the working of the lantern. He also started the school \"tuck-shop,\" and managed it with great business ability so as to subsidise other school enterprises. ... he did much canoeing on the canals of England and was also a keen and expert fisherman.\nOn\n16\nAugust\n1888\n, Saunder married Alice Duthoit. She had been born on\n16\nAugust\n1866\nat Mirzapur, Bengal, India to the Rev William Duthoit and his wife Fanny Cumberlege. When Saunder met Alice she was living with her parents in Crowthorne, Berkshire, where her father was the local priest. Samuel and Alice Saunder had three children. The first was a girl who died as an infant. Their two boys were Douglas Arthur Saunder\n(1891\n-\n1941)\nand George Bertram Saunder\n(1893\n-\n1917)\n. Douglas Arthur Saunder served in World War I, and then became a schoolmaster at Jamison House, Prince Edward School, Salisbury, Rhodesia. George Bertram Saunder served as a Second Lieutenant in the Buffs Regiment\n(\nEast Kent\n)\nin World War I and was killed in action at Loos-en-Gohelle, Departement du Pas-de-Calais, Nord-Pas-de-Calais, France on\n15\nApril\n1917\n. Alice Saunder died on\n21\nAugust\n1893\n, eight days after the birth of George Bertram Saunder.\nSaunder was a very popular teacher at Wellington College but it is not because of his mathematics teaching that he is included in the Archive, rather it is because he took up astronomy as a hobby. He purchased a\n7\n-inch refractor by Troughton and Simms, designed a back garden shed to house it, and built the shed himself. In doing this he provided\n[\n17\n]\n:-\n... the model for back-garden observatories for several generations to come.\nHe was a founder member of the British Astronomical Association in\n1890\nand was elected a fellow of the\nRoyal Astronomical Society\nin November\n1894\n. He regularly attended the monthly meetings of the British Astronomical Association despite the tedious\n45\n-mile railway journey from Crowthorne to London. In\n1895\nhe published the paper\nHow to determine the time with a small equatorial\nin the\nJournal of the British Astronomical Association.\nYou can read the first paragraph of this paper at\nTHIS LINK\n.\nOf course, Saunder was a mathematician by training and career, so it is not surprising that he published astronomy papers using his mathematical skills, such as\nThe Stereographic Projection of the Celestial Sphere\n(1897)\nand papers in the\nMathematical Gazette\nsuch as\nOn the expression, \"Motion at an Instant\"\n(1899)\nwhich looks at\nZeno\n's arrow paradox. You can read extracts from these and other Saunder papers at\nTHIS LINK\n.\nSaunder became an expert on the study of the Moon, both with observations of his own and by studying the positions of lunar features on photographs taken at major observatories. Two things disturbed him, both of which he made strenuous efforts to rectify. One was the realisation that the positions of lunar features was not accurately known. He wrote the paper\nThe Determination of Selenographic Positions and the Measurement of Lunar Photographs\n(1900)\nwhich begins with the paragraph\n[\n12\n]\n:-\nThe object of this paper is to call attention to the great uncertainty that attaches to our knowledge of the positions of lunar formations, and to suggest means by which these positions may be determined more accurately than has yet been accomplished.\nThis paper contains a discussion of the errors in the positions of lunar features which are in the standard references of the time. We quoted from the beginning of this discussion at\nTHIS LINK\n.\nIt took Saunder several attempts to come up with a method of measurement which would yield accurate positions but eventually he was able to compute the positions of\n3000\nlunar features with an accuracy\n50\ntimes better that existed before he began his work\n[\n8\n]\n:-\nThis result was naturally not achieved without much work and many disappointments. The method first tried, which involved using existing knowledge as a basis, broke down altogether. The places were too rough to give even a start. Then he devised a very ingenious method of measuring two plates with different librations, using the stereoscopic displacement as a base: but the base was not long enough, and this method would not do. It was apparently necessary to measure at the telescope the distances of several fundamental points from Mösting A, and this work Saunder undertook himself, though he was much helped by Professor Barnard's measures of two points. ... This third attempt, starting from measures at the telescope as a basis, was completely successful, and led to the Catalogue of over\n3000\nselenographical positions in 'Memoirs of the\nRoyal Astronomical Society\n'\n57\n(1905)\n.\nNow having given some details of his strenuous efforts to rectify precise knowledge of the positions of lunar features, we should look at the strenuous efforts he made to ensure that a naming system was introduced for lunar features so that each had a unique name. When he was studying the Moon, he was aware that certain features were known by several different names while certain names were attached to different features in different catalogues. He discussed that problem in detail in\nOn the Present State of Lunar Nomenclature\n(1905)\nwhich begins as follows\n[\n15\n]\n:-\nSome apology is due from me for again occupying the time of the Society with a subject so familiar to all selenographers as the confusion now existing in lunar nomenclature, and the inadequacy of our present system for the growing needs of selenography; but, as some recent remarks of mine have led the Council of this Society to take a course of action which it is hoped may lead to an authoritative reconsideration of the questions involved, I have thought that a fuller statement of the difficulties might be of interest to those whose work lies in other directions, and might also lead to some useful suggestions from those who, like myself, have found themselves hampered by the want of a recognised language in which to express the results of their labours.\nFor a longer extract from this paper, see\nTHIS LINK\n.\nRealising that international agreement was necessary, Saunder first approached the\nRoyal Astronomical Society\n, then the\nRoyal Society\nwhich made a proposal to the International Association of Academies at its Vienna meeting on\n29\n-\n30\nMay\n1907\n[\n19\n]\n:-\nThe proposal of the\nRoyal Society\nfor a committee on lunar nomenclature was adopted without opposition; and the following were nominated to serve on the committee, with power to add to their number:- Loewy\n(\nchairman\n)\n,\nNewcomb\n, Weiss, Franz, Saunder, and Turner.\nMaurice Loewy, the chairman of the committee, asked Herbert Hall Turner to act as secretary to the committee and they added one further member, William Henry  Pickering. Loewy asked Saunder and Julius Heinrich Franz to create an accurate map of the Moon which could be used to standardise the names of features. Sadly Maurice Loewy died suddenly at a meeting in Paris on\n15\nOctober\n1907\n. After his death,\nPierre Puiseux\nand Benjamin Bailaud were added to the committee. Bailaud had, in fact, succeeded Loewy at the Observatory at Paris. Saunder and Franz set to work on creating the accurate Moon map.\nSaunder, although only an amateur astronomer, had become recognised as a world leading expert on the Moon. He was elected President of the British Astronomical Society in\n1902\n-\n04\n, Secretary of the\nRoyal Astronomical Society\nfrom\n1906\nto\n1912\nand elected Gresham Professor of Astronomy on\n2\nDecember\n1908\n.\nAfter achieving international recognition, it is sad to record that Saunder's career ended somewhat sadly. When Saunder had been appointed to Wellington College, the Headmaster was Edward Charles Wickham who had studied classics at New College, Oxford and, after being headmaster, became Dean of Lincoln in\n1894\n. His successor was Bertram Pollock, appointed Headmaster of Wellington College in\n1893\n, who had studied the Classical Tripos at Trinity College, Cambridge. Under both these headmasters, Saunder had flourished being greatly appreciated by both. In\n1910\nPollock was appointed Bishop of Norwich and William Wyamar Vaughan became Headmaster of Wellington College. Unlike the two previous headmasters, Saunder did not seem to get on well with Vaughan. Ian Seymour writes\n[\n17\n]\n:-\nVaughan was profoundly mediocre and resented being outshone by a junior. Saunder refused to resign and was sacked - compelled to \"retire without pension\" in July\n1912\n. Vaughan's motivations were widely known and the case aroused outrage ...\nVaughan had been educated at Rugby School and then at New College, Oxford where he studied classics, and then he studied at the University of Paris. He would move from Wellington College to be Headmaster of Rugby School in\n1921\n. With a biography in the\nOxford Dictionary of National Biography\n, he does not look \"profoundly mediocre\" but certainly he fell out with Saunder. Perhaps there is a clue in the description of Vaughan's character in\n[\n20\n]\n:-\nIn him a rapid and sometimes explosive reaction to folly, neglect, or wrongdoing was tempered by a strong sense of justice, deep sympathies, and a keen sense of humour.\nLet us conjecture that Vaughan felt that Saunder should not be spending so much time on astronomy when employed as a Senior Master at Wellington College. In addition to the major task he was undertaking on lunar nomenclature, he had considerable duties as Secretary of the\nRoyal Astronomical Society\n, and as Gresham Professor of Astronomy he had to deliver a series of lectures each year. Although saddened by being forced to retire in\n1912\n, nevertheless he felt happy that he would be able to devote even more time to astronomy\n[\n8\n]\n:-\nAfter some consideration he arranged to settle at Oxford, finding a house with a garden suitable for his telescope and not too far from the University Observatory. But after the lease had been signed, and while he was planning the building for his telescope, he became ill, and it soon became clear that the trouble was possibly serious, though exact diagnosis was difficult.\nDespite the illness, he was determined to deliver the fourth series of lectures as Gresham Professor of Astronomy on the topic of\nTides and tidal friction\n. His lecture course was\n[\n8\n]\n:-\n... given under conditions such as few lecturers have ever faced : illness came suddenly upon him in a way which made it a severe pain to speak at all loudly : but he heroically declined all offers of help except that which a masseur could give him immediately before each lecture, and it is probable that the audiences never suspected what torture their lecturer was undergoing. He went straight from the last lecture to the bed from which he was never destined to rise.\nHerbert Hall Turner writes in the Introduction to\n[\n2\n]\n:-\nSaunder had also secured the devoted help of Miss M A Blagg in collating the list here printed of names\n[\nof lunar features\n]\nin Beer and Mädler, Schmidt, and Neison. ... On his deathbed\n[\non\n30\nNovember\n1912]\nSaunder handed to me this collated list in manuscript, and I gathered that, although it was of great value and represented much careful labour, considerations of cost had deterred him up to that time from printing it. As soon as I had had time to review the situation, I realised the great advantages that would follow from printing this list; and found further that Miss Blagg would undertake to see it through the press.\nSaunder died on\n8\nDecember\n1912\n, a few days before the meeting of the\nRoyal Astronomical Society\nwhere he was going to be nominated as President of the Society.\nLet us end with two tributes, the first from\n[\n22\n]\n:-\nIn Mr Saunder astronomical science has lost a devoted and conscientious worker who gave himself whole-heartedly to a line of study requiring much ability, and involving immense labour, but offering no prospect of startling results.\nThe second tribute is from J A Hardcastle who writes in\n[\n6\n]\n:-\nMr Saunder was elected a Fellow of the\nRoyal Astronomical Society\nin\n1894\nand from\n1906\nto\n1912\nhe was one of the secretaries, fulfilling the duties of that post, as a colleague one wrote, \"with tact, good judgement, and devotion to duty.\" And it is, perhaps, these last words that strike the keynote of his life and by which he himself would have chosen to be remembered. All who knew him will recall how unsparing of himself he was in fulfilling all his duties and engagements; he was careful and businesslike in all that he did, level-headed, of sterling principles and almost incredible industry. Mr Saunder was, perhaps, too reserved to have a wide circle of friends, but by all who knew him well he will be long and deeply regretted.",
  "math_areas": [
    "Applied Mathematics"
  ]
}