{
  "nome_completo": "Samuel Eilenberg",
  "nome_curto": "Samuel Eilenberg",
  "ano_nascimento": "1913",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eilenberg/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "New York, USA",
  "biografia": "Samuel Eilenberg\n's father was educated at a Jewish school but became a brewer as he married into a family of brewers. Sammy, as Eilenberg was always called, studied at the University of Warsaw. It is not surprising that Eilenberg's interests quickly turned towards\npoint set topology\nwhich, of course, was an area which flourished at the University of Warsaw at that time.\nA remarkable collection of mathematicians were on the staff at the University of Warsaw while Eilenberg studied there. For example\nMazurkiewicz\n,\nKuratowski\n,\nSierpiński\n,\nSaks\nand\nBorsuk\ntaught there. Eilenberg was awarded his MA from the University of Warsaw in\n1934\n. Then in\n1936\nhe received his doctorate after studying under\nBorsuk\n.\nMac Lane\nwrites in\n[\n1\n]\n:-\nHis thesis, concerned with the\ntopology\nof the plane, was published in Fundamenta Mathematicae in\n1936\n. Its results were well received both in Poland and the USA.\nThe second mathematical centre in Poland at this time was Lwów. It was there that Eilenberg met\nBanach\n, who led the Lwów mathematicians. He joined the community of mathematicians working and drinking in the Scottish Café and he contributed problems to the Scottish Book, the famous book in which the mathematicians working in the Café entered unsolved problems.\nYou can see a picture of the Scottish Café at\nTHIS LINK\n.\nMost of Eilenberg's publications from this period were on\npoint-set topology\nbut there were signs, even at this early stage of his career, that he was moving towards more algebraic topics.\nMac Lane\nwrites\n[\n1\n]\n:-\nIn\n1938\nhe published in\n[\nFundamenta Mathematicae\n]\nanother influential paper on the action of the\nfundamental group\non the higher\nhomotopy\ngroups of a space. Algebra was not foreign to his topology!\nThis paper was an early sign that Eilenberg was moving into the area for which he has become famous. It was one of a truly remarkable collection of papers published by Eilenberg for, from his days as an undergraduate up until\n1939\nwhen he left Poland for the United States, he published\n37\npapers.\nIn\n1939\nEilenberg's father convinced him that the right course of action was to emigrate to the United States. Once there he went to Princeton where\nVeblen\nand\nLefschetz\nhelped him to find a university post. This was not too long in coming and, in\n1940\n, he was appointed as an instructor at the University of Michigan. This was an excellent place for Eilenberg to begin his teaching career in the United States for there he could interact with leading topologists.\nWilder\nwas on the staff at Ann Arbor and\nSteenrod\n, who had studied there earlier, continued to have close links and returned onto the staff at Ann Arbor in\n1942\n.\nIn\n1940\nthere was an important topology conference organised at Michigan. World War II was by this time dominating the international scene so the number of participants at the conference from outside the United States was much less than one would have otherwise expected. Eilenberg lectured at the conference on\nExtension and classification of continuous mappings\n.\nEilenberg was only an instructor for one year, then in\n1941\nhe was promoted at assistant professor at the University of Michigan. In\n1945\nhe was promoted again, this time to associate professor. He spent the year\n1945\n-\n46\nas a visiting lecturer at Princeton before being appointed as a full professor at Indiana University in\n1946\n. After one year he moved to Columbia University in New York where he remained for the rest of his career. In\n1948\n, the year after he took up the post at Columbia, Eilenberg became a US citizen. He married Natasa Chterenzon in\n1960\n.\nPerhaps the most obvious feature of Eilenberg's work was the amount which was done in collaboration with other mathematicians. One major collaboration was his work with\nBourbaki\n. In\n1949\nAndré\nWeil\nwas working at the University of Chicago and he contacted Eilenberg to ask him to collaborate on writing about homotopy groups and fibre spaces as part of the\nBourbaki\nproject. Eilenberg became a member of the\nBourbaki\nteam spending\n1950\n-\n51\nas a visiting professor in Paris and participating in the two week summer meetings until\n1966\n. He had been awarded Fulbright and Guggenheim scholarships to fund his year in Paris.\nOne of the first collaborations which Eilenberg entered was with\nMac Lane\n. The two first met in\n1940\nin Ann Arbor and from that time until about\n1954\nthe pair produced fifteen papers on a whole range of topics including\ncategory theory\n,\ncohomology\nof groups, the relation between\nhomology\nand homotopy, Eilenberg-\nMac Lane\nspaces, and generic cycles. In\n1942\nthey published a paper in which they introduced\nHom\nand\nExt\nfor the first time. They introduced the terms\nfunctor\nand natural isomorphism and, in\n1945\n, added the terms\ncategory\nand\nnatural transformation\n.\nAnn Arbor again provided the means to bring Eilenberg and\nSteenrod\ntogether. In\n1945\nthey set out the axioms for homology and cohomology theory but they did not give proofs in their paper, leaving these to appear in their famous text\nFoundations of algebraic topology\nin\n1952\n.\nMac Lane\nwrites in\n[\n1\n]\n:-\nAt that time there were many different and confusing versions of homology theory, some singular some cellular. The book used categories to show that they all could be described conceptually as presenting homology functors from the category of pairs of spaces to groups or to rings, satisfying suitable axioms such as \"excision\". Thanks to Sammy's insight and his enthusiasm, this text drastically changed the teaching of topology.\nIn fact Eilenberg had written a definitive treatment of singular homology and cohomology in a paper in the\nAnnals of Mathematics\nin\n1944\n. He had written this paper since he found the treatment of the topic by\nLefschetz\nin his\n1942\nbook unsatisfactory. In\n1948\nEilenberg, in a joint paper with\nChevalley\n, gave an algebraic approach to the cohomology of\nLie\ngroups, using the\nLie algebra\nas a basic object. They showed that in characteristic zero the cohomology of a compact\nLie\ngroup is isomorphic as an algebra to the cohomology of the corresponding\nLie\nalgebra.\nAnother collaboration of major importance was between Eilenberg and\nHenri Cartan\n. The two first met in\n1947\nand began to exchange ideas by letter in the following years. However as we mentioned above Eilenberg spent\n1950\n-\n51\nin Paris and it was during this time that they made remarkable progress.\nHenri Cartan\nwrites in\n[\n1\n]\n:-\nWe went from discovery to discovery, Sammy having an extraordinary gift for formulating at each moment the conclusions that would emerge from the discussion. And it was always he who wrote everything up as we went along in precise and concise English. ... Of course, this work together took several years. Sammy made several trips to my country houses\n(\nin Die and in Dolomieu\n)\n. Outside of our work hours he participated in our family life.\nThe outcome of this collaboration was the book\nHomological algebra\nthe title being a term which the two mathematicians invented. Although they had completed the manuscript by\n1953\nit was not published until\n1956\n. Hochschild reviewing the book wrote:-\nThe title \"Homological Algebra\" is intended to designate a part of pure algebra which is the result of making algebraic homology theory independent of its original habitat in topology and building it up to a general theory of modules over associative rings. ... The conceptual flavour of homological algebra derives less specifically from topology than from the general \"naturalistic\" trend of mathematics as a whole to supplement the study of the anatomy of any mathematical entity with an analysis of its behaviour under the maps belonging to the larger mathematical system with which it is associated. In particular, homological algebra is concerned not so much with the intrinsic structure of modules but primarily with the pattern of compositions of homomorphisms between modules and their interplay with the various constructions by which new modules may be obtained from given ones.\nHe also notes:-\nThe appearance of this book must mean that the experimental phase of homological algebra is now surpassed. The diverse original homological constructions in various algebraic systems which were frequently of an ad hoc and artificial nature have been absorbed in a general theory whose significance goes far beyond its sources. The basic principles of homological algebra, and in particular the full functorial control over the manipulation of tensor products and modules of operator homomorphisms, will undoubtedly become standard algebraic technique already on the elementary level.\nWe should mention another major two volume text which Eilenberg published in\n1974\nand\n1976\n. This text was\nAutomata, languages, and machines\nwhich was described by a reviewer as:-\n... one of the most important events in the mathematical study of the foundations of computer science and in applied mathematics. The work includes a unifying mathematical presentation of almost all major topics of automata and formal language theory.\nIt was a topic which Eilenberg had been interested in from\n1966\nonwards and it is worth noting that it is one of the few major works by Eilenberg which he worked on alone. The book examines rational structures, that is those that can be recognised by a finite state automaton.\nSo far we have only talked about Sammy the mathematician. There was another side to Eilenberg however, for he was a dealer in the art world in which he was known as \"Professor\". He dealt in Indian art and he was a leading expert on the subject.\nHyman Bass\nwrites in\n[\n1\n]\n:-\nOver the years Sammy gathered one of the world's most important collections of Southeast Asian art. His fame among certain art collectors overshadows his mathematical reputation. In a gesture characteristically marked by its generosity and elegance, Sammy in\n1987\ndonated much of his collection to the Metropolitan Museum of art in New York, which in turn was thus motivated to contribute substantially to the endowment of the Eilenberg Visiting Professorship in Mathematics at Columbia university.\nEilenberg received many honours for his work. In particular we should mention the Wolf Prize which he shared with\nSelberg\nin\n1986\nand his election to the\nNational Academy of Sciences\n.\nFinally let us give a quote regarding Eilenberg's personality.\nBass\nwrites in\n[\n1\n]\n:-\nThough his mathematical ideas may seem to have a kind of crystalline austerity, Sammy was a warm, robust, and very animated human being. For him mathematics was a social activity, whence his many collaborations. He liked to do mathematics on his feet, often prancing while he explained his thoughts. When something connected, one could read it in his impish smile and the sparkle in his eyes.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Topology"
  ]
}