{
  "nome_completo": "Sankara Narayana",
  "nome_curto": "Sankara Narayana",
  "ano_nascimento": "840",
  "ano_morte": "900",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sankara/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "Sankara Narayana\n(\nor Shankaranarayana\n)\nwas an Indian astronomer and mathematician. He was a disciple of the astronomer and mathematician\nGovindasvami\n. His most famous work was the\nLaghubhaskariya vivarana\nwhich was a commentary on the\nLaghubhaskariya\nⓉ\n(\nThe small book of Bhaskara\n)\nof\nBhaskara I\nwhich in turn is based on the work of\nAryabhata I\n.\nThe\nLaghubhaskariya vivarana\nwas written by Sankara Narayana in\n869\nAD for the author writes in the text that it is written in the Shaka year\n791\nwhich translates to a date AD by adding\n78\n. It is a text which covers the standard mathematical methods of\nAryabhata I\nsuch as the solution of the indeterminate equation\nb\ny\n=\na\nx\n±\nc\nby = ax ± c\nb\ny\n=\na\nx\n±\nc\n(\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nintegers\n)\nin integers which is then applied to astronomical problems. The standard Indian method involves using the Euclidean algorithm. It is called kuttakara\n(\n\"pulveriser\"\n)\nbut the term eventually came to have a more general meaning like \"algebra\". The paper\n[\n2\n]\nexamines this method. The reader who is wondering what the determination of \"mati\" means in the title of the paper\n[\n2\n]\nthen it refers to the optional number in a guessed solution and it is a feature which differs from the original method as presented by\nBhaskara I\n.\nPerhaps the most unusual feature of the\nLaghubhaskariya vivarana\nis the use of katapayadi numeration as well as the place-value Sanskrit numerals which Sankara Narayana frequently uses. Sankara Narayana is the first author known to use katapayadi numeration with this name but he did not invent it for it appears to be identical to a system invented earlier which was called varnasamjna. The numeration system varnasamjna was almost certainly invented by the astronomer Haridatta, and it was explained by him in a text which many historians believe was written in\n684\nbut this would contradict what Sankara Narayana himself writes. This point is discussed below. First we should explain ideas behind Sankara Narayana's katapayadi numeration.\nThe system is based on writing numbers using the letters of the Indian alphabet. Let us quote from\n[\n1\n]\n:-\n... the numerical attribution of syllables corresponds to the following rule, according to the regular order of succession of the letters of the Indian alphabet: the first nine letters represent the numbers\n1\nto\n9\nwhile the tenth corresponds to zero; the following nine letters also receive the values\n1\nto\n9\nwhilst the following letter has the value zero; the next five represent the first five units; and the last eight represent the numbers\n1\nto\n8\n.\nUnder this system\n1\nto\n5\nare represented by four different letters. For example\n1\nis represented by the letters ka, ta, pa, ya which give the system its name\n(\nka, ta, pa, ya becomes katapaya\n)\n. Then\n6\n,\n7\n,\n8\nare represented by three letters and finally nine and zero are represented by two letters.\nThe system was a spoken one in the sense that consonants and vowels which are not vocalised have no numerical value. The system is a place-value system with zero but one may reasonably ask why such an apparently complicated numeral system might ever come to be invented. Well the answer must be that it lead to easily remembered mnemonics. In fact many different \"words\" could represent the same number and this was highly useful for works written in verse as the Indian texts tended to be.\nLet us return to the interesting point about the date of Haridatta. Very unusually for an Indian text, Sankara Narayana expresses his thanks to those who have gone before him and developed the ideas about which he is writing. This in itself is not so unusual but the surprise here is that Sankara Narayana claims to give the list in chronological order. His list is\nAryabhata I\nVarahamihira\nBhaskara I\nGovindasvami\nHaridatta\n[\nNote that we have written\nBhaskara I\nwhere Sankara Narayana simply wrote Bhaskara. The more famous\nBhaskara II\nlived nearly\n300\nyears after Sankara Narayana.\n]\nThe chronological order in the list agrees with the dates we have for the first four of these mathematicians. However, putting Haridatta after\nGovindasvami\nwould seem an unlikely mistake for Sankara Narayana to make if Haridatta really did write his text in\n684\nsince Sankara Narayana was himself a disciple of\nGovindasvami\n. If the dating given by Sankara Narayana is correct then katapayadi numeration had been invented only a few years before he wrote his text.",
  "math_areas": [
    "Number Theory"
  ]
}