{
  "nome_completo": "Sarah Woodhead",
  "nome_curto": "Sarah Woodhead",
  "ano_nascimento": "1851",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Woodhead/",
  "lugar_nascimento": null,
  "lugar_morte": null,
  "biografia": "Born the daughter of a Manchester grocer and into a Quaker family, Sarah Woodhead attended Ackworth School in West Yorkshire. In her early career, she spent some time teaching, before pursuing her own education further.\nBetween\n1869\nand\n1872\n, she was a student at Girton College, then based in Hitchin, Hertfordshire, which was established in order to give women the benefits of higher education, even at a time when they were not eligible to be awarded formal degrees. For her excellence in mathematics, she was one of the first two students awarded a scholarship at Girton. There, she was the youngest of the Girton Five, the first students at the new institution, alongside Rachel Cook, Louisa Lumsden, Anna Lloyd, and Emily Gibson.\nAll of them fell under the tutelage and influence of Miss Emily Davies, one of the founders of Girton, who later became its Mistress. She was convinced that her five early students should demonstrate women's abilities, and prove that women could succeed upon the same terms as men. Ultimately, she wished for Girton to be elevated from an institution for further educating women to a full college within the University of Cambridge. As a preliminary step in achieving that, she sought to make the environment there as close as possible to that of any other college in Cambridge. Part of this involved bringing lecturers from Cambridge to Girton to teach her students, who were all keen to learn and determined. One of the lecturers, Seeley, who had been teaching non-examinable material, even gave up lecturing to them at all when the students objected that they wished to focus purely upon the syllabus for examination. At Miss Davies' insistence, the five students undertook the 'Little Go' preliminary examinations in Classics and in Mathematics, with Woodhead one of only two to pass in the latter.\nDespite Davies' demands that women ought to be admitted to sit the full Tripos examinations formally, these examinations were, at the time, often deemed to be, in part, a test of virility, with many students engaging in sport or athletics as partial preparation for the volume of questions involved in the examinations and as training for endurance. Some thought the examinations too physically taxing for woman, although a study in\n1887\nconcluded that 'there is nothing in a university education at all especially injurious to the constitution of women, or involving any greater strain than they can ordinarily bear without injury'. Nevertheless, the Council of Senate of the University voted\n10\n–\n6\nagainst allowing women to sit the Tripos.\nAs a way of circumventing this, Miss Davies asked the male examiners to provide copies of the question papers and to mark the women's responses\n(\nbut, formally, they did so privately, and not as agents of Cambridge University\n)\n, which they were happy to do. Thus enabled, the Girton Five were able to sit the Tripos examinations in the University Arms Hotel.\nDuring the Lent term in\n1873\n, Woodhead passed the papers in mathematics. Although, as a woman, she could not be awarded a formal degree classification, she achieved marks worthy of Honours of the Second Class. In so doing, she became the first woman to pass any set of Tripos examinations from Cambridge.\nWhen news of her success, and that of Lumsden and Cook in the Classical Tripos, reached Girton, there was great rejoicing and ringing of bells, until the local police and fire brigade became alarmed. Subsequent generations of Girtonians would celebrate their achievements by singing 'Woodhead, Cook, and Lumsden, the Girton Pioneers' to the tune of 'The British Grenadiers'.\nAfter Cambridge, she married Christopher Corbett, an architect and surveyor, in\n1875\n. She also returned to teaching and became the second head-teacher of Bolton High School for Girls\n(\nwhich is now the Girls' Division of Bolton School\n)\n.\nIn her intellectual accomplishments in Cambridge, Sarah Woodhead preceded, and laid a path for,\nCharlotte Scott\n, who, sitting the mathematical Tripos alongside male candidates, ranked with the Eighth Wranger, and\nPhilippa Fawcett\n, who became the first woman to score the highest mark in the mathematical Tripos, ahead of the Senior Wrangler\n(\nthat title then being applied only to male students\n)\n.",
  "math_areas": []
}