{
  "nome_completo": "Sarvadaman Chowla",
  "nome_curto": "Sarvadaman Chowla",
  "ano_nascimento": "1907",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chowla/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Laramie, Wyoming, USA",
  "biografia": "Sarvadaman Chowla\n's father, Gopal Chowla, was professor of mathematics at Lahore. Gopal Chowla visited England with his wife Shankuntala so that he could study at Cambridge University. It was during the visit to England that Sarvadaman Chowla was born. The family returned to India shortly after his birth and he was brought up there.\nAt the age of\n21\nChowla was awarded his master's degree from Government College in Lahore. He then decided to go to England to study for his doctorate and he undertook research at the University of Cambridge under\nJ E Littlewood\n's supervision, being awarded his doctorate in\n1931\n. After returning to India, Chowla was appointed professor of mathematics at St Stephen's College in Delhi, then at Benares Hindu University in Benares, then at Andhra University in Waltair, and finally at Government College of Punjab University in Lahore where he was Head of the Department of Mathematics from\n1936\nto\n1947\n.\nThis period while Chowla was Head of Mathematics at Lahore was a very difficult one. India was British but Britain wanted to transfer power to a single Indian administration, creating one new country. There were severe divisions in India, however, and in\n1946\nthere was a civil war with rioting and killing throughout the whole of the subcontinent. The Punjab, where Chowla worked, was in one of the most difficult positions being a Muslim majority province with a large Sikh community that had become anti-Muslim. The British Parliament passed the Indian Independence Act in July\n1947\nwhich created two independent nations, India and Pakistan, at midnight on\n14\n-\n15\nAugust\n1947\n.\nChowla was in Lahore which the Indian Independence Act put in Pakistan, close to the new border with India. He fled with his family to Delhi and from there they continued their flight to the United States. There Chowla became a visitor at the Institute for Advanced Study in Princeton, where he remained until the autum of\n1949\nwhen he was appointed as professor at the University of Kansas at Lawrence.\nAfter three years at the University of Kansas, Chowla moved to the University of Colorado at Boulder where he remained until\n1963\n. In that year he was offered the post of research professor at the Pennsylvania State University and he was to hold this post until he retired in\n1976\n.\nChowla produced a remarkably rich research output, and his results in many of areas of\nnumber theory\nand combinatorics are of the greatest significance. The range of his work is described in\n[\n4\n]\n:-\nChowla's first paper appeared in\n1925\nand his last in\n1986\n. During this period of sixty-two years he wrote about\n350\npapers. His papers encompassed a wide variety of interests. He wrote on additive number theory\n(\nlattice points, partitions,\nWaring\n's problem\n)\n, analysis,\nBernoulli numbers\n, class invariants, definite integrals,\nelliptic integrals\n, infinite series, the\nWeierstrass\napproximation theorem\n)\n,\nanalytic number theory\n(\nDirichlet\nL-functions,\nprimes\n,\nRiemann\nand\nEpstein\nzeta functions\n)\n, binary\nquadratic forms\nand class numbers, combinatorial problems\n(\nblock designs, difference sets, Latin squares\n)\n,\nDiophantine equations\nand\nDiophantine approximation\n, elementary number theory\n(\narithmetic functions,\ncontinued fractions\n, and\nRamanujan\n's tau function\n)\n, and exponential and character sums\n(\nGauss\nsums,\nKloosterman\nsums, trigonometric sums\n)\n.\nHe collaborated with a large collection of other mathematicians and many of his papers are written jointly with them. For example around\n40\nare named in\n[\n2\n]\n, including T M Apostol,\nE Artin\n,\nR Brauer\n,\nH Davenport\n,\nP Erdős\n,\nMarshall Hall\n,\nH Hasse\n,\nI N Herstein\n,\nL J Mordell\n,\nS S Pillai\n,\nC R Rao\n,\nA Selberg\n,\nG Shimura\n,\nT Skolem\n,\nJ Todd\n,\nA Walfisz\nand\nH Zassenhaus\n.\nAmong the theorems to which Chowla's name have been attached are the Bruck-Chowla-Ryser theorem on designs\n(1950)\n; the Ankeny-\nArtin\n-Chowla theorem on the class number of real\nquadratic number fields\n(1952)\n; the Chowla-\nMordell\ntheorem on\nGauss\nsums\n(1962)\n; and the Chowla-\nSelberg\nformula for the product of certain values of the\nDedekind\neta function.\nAmong a long list of other results we mention just a very few such as his generalisation of\nWolstenholme\n's theorem; his work on classes of\nquintics\nnot\nsoluble by radicals\n; his closed form for the\nBernoulli numbers\n; and his work on the length of the period of the continued fraction expansion of\n√\nN\n√N\n√\nN\n.\nChowla is described in\n[\n4\n]\nas a:-\n... lively, friendly, and good humored person who was extremely modest about his accomplishments. He was engaged in mathematics to such an extent that he had few outside interests.\nHis teaching is also described:-\nChowla's lectures were both interesting and inspiring. He introduced students to the main ideas of the subject by means of illuminating examples and by giving proofs of important special cases of more general theorems.\nAmong the many honours given to Chowla were the Padmabhushan Award from the Indian National Academy of Sciences, to which he had been elected a member; and an honorary membership of the\nRoyal Norwegian Society of Sciences and Letters\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}