{
  "nome_completo": "Satoshi Suzuki",
  "nome_curto": "Satoshi Suzuki",
  "ano_nascimento": "1930",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Suzuki_Satoshi/",
  "lugar_nascimento": "Nagoya, Japan",
  "lugar_morte": "Kyoto, Japan",
  "biografia": "Satoshi Suzuki\nwas brought up a Japanese Buddhist. He completed his secondary education in\n1949\nand entered the University of Kyoto. He enrolled in the Faculty of Science and the main topic of his undergraduate course was mathematics. In\n1953\nhe began graduate studies at the University of Kyoto, nominally working under Yasuo Akizuki but in practice his research ideas were developed without any assistance. For five years, from\n1953\nto\n1958\n, Suzuki attended graduate level courses but in\n1958\nhe left the university to take up a teaching position. Bythis time he had already written a paper\nNote on the existence of rational points\nwhich was published in the\nProceedings of the Japan Academy\nin\n1958\n.\nSuzuki taught at Kyoto Women's University during the academic year\n1958\n-\n59\nand he then taught at Momoyama Gakuin in Sakai, Osaka until\n1961\n. After this he returned as a lecturer at Yoshida College of the University of Kyoto. He submitted his doctoral thesis\nSome results on m-adic differentials\nin June\n1964\nto the University of Kyoto and was awarded the degree. Even before he submitted his doctoral dissertation, in\n1963\n, Suzuki had been promoted to associate professor and he became a full professor in\n1970\n. Suzuki married Suzuyo and they had two daughters, Harue and Masae.\nAlthough he was on the staff at Kyoto University for his whole career, Suzuki spent several years working at other universities. He spent a few months at Florida State University in Tallahassee, USA, in\n1960\n. He taught mathematics courses at Purdue University, West Lafayette, Indiana, USA, from August\n1965\nto August\n1967\nand then at Queen's University, Kingston, Canada for the academic year\n1967\n-\n68\n.\nRibenboim\nwrites\n[\n3\n]\n:-\nI met Suzuki when he came to Queen's University in\n1967\n, as a Visiting Associate Professor, with very good recommendations from Professors S S Abhyankar and J Lipman. He spent the academic year at Kingston and at that time I saw him, his wife Suzuyo and his two little daughters Harue and Masae, with a certain regularity. I was very interested in his work on differentials, especially the higher order differentials and I attended his lectures with profit. At my suggestion, Suzuki wrote up his lecture notes ...\nThese notes, based on Suzuki's lectures at  Queen's University, Kyoto University and Florida State University, were published as\nDifferentials of commutative rings\nby Queen's University in\n1971\n. Among the papers which Suzuki published before these lecture notes are:\nOn torsion of the module of differentials of a locality which is a complete intersection\n(1964)\n;\nNote on formally projective modules\n(1966)\n;\nOn the flatness of complete formally projective modules\n(1968)\n;\nDifferential modules and derivations of complete discrete valuation rings\n(1969)\n; and\nModules of high order differentials of topological rings\n(1970)\n.\nAmong other places where Suzuki taught are Rutgers University, New Brunswick, USA, where he spent six months in\n1971\nand another six months in\n1988\n. A few years before the second of these two visits he had spent the summer of\n1985\nat the Darien Foreign Language College in China.\nSuzuki's later work includes\nHigher differential algebras of discrete valuation rings\n(1974)\n;\nSome types of derivations and their applications to field theory\n(1981)\n; and\nOn extensions of higher derivations for algebraic extensions of fields of positive characteristics\n(1989)\n.\nThe events leading to his death are described by\nNagata\nin\n[\n2\n]\n:-\nSince March\n1991\nhe felt something wrong on his chest and he visited some medical doctors. In May pancreas cancer was found and the pancreas was soon taken out. In late June he had some melena and hematemesis twice while he was in hospital. In the middle of July he had an attack of fever. Although the medical doctor in charge of him tried several different antibiotics, the fever did not go away completely. His illness was not just fever; troubles with blood pressure, appearance of cyanosis and so on. .. After his death the medical doctor found that the real cause of his illness had been an infection with MRSA. I deeply regret that he was not given adequate care by the medical doctor.\nNagata also describes Suzuki's character in\n[\n2\n]\n:-\nA strong impression which I felt of Suzuki's personal character was that he spoke quite frankly. Usually when someone wants to say something, he considers the circumstances and decides if he should speak or not. I am pretty sure that Suzuki did the same, but his judgement was a little different. Anyway, many people were surprised by what Suzuki said at meetings or in casual conversations. I should emphasise that Suzuki was frank and honest.\nRibenboim\nsums up his description of Suzuki as follows:-\nAn able, persistent and sincere researcher, who contributed to the understanding of the algebraic theory of differentials.",
  "math_areas": [
    "Algebra"
  ]
}