{
  "nome_completo": "Semyon Aranovich Gershgorin",
  "nome_curto": "Semyon Aranovich Gershgorin",
  "ano_nascimento": "1901",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gershgorin/",
  "lugar_nascimento": "Pruzhany, Russian Empire (now Belarus)",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Semyon Aranovich Gershgorin\n's name appears in various different transliterations in addition to the one we have chosen to use. His first name is often written as Semën or Semen, his patronymic is sometimes written as Aranovič, Aronivič or Aronovich, while his family name appears as Geršagorin, Gerschgorin or Gerszgorin. The family name is originally Yiddish and, somewhat confusingly, transliterations from the Yiddish can be given in the form Hirshhorn or Hirschhorn.\nHe studied at Petrograd Technological Institute from\n1923\n, and defended an outstanding thesis submitted to the Division of Mechanics. The papers he published at this time are\n(\nall in Russian\n)\n:\nInstrument for the integration of the Laplace equation\n(1925)\n;\nOn a method of integration of ordinary differential equations\n(1925)\n;\nOn the description of an instrument for the integration of the Laplace equation\n(1926)\n; and\nOn mechanisms for the construction of functions of a complex variable\n(1926)\n. He became Professor at the Institute of Mechanical Engineering in Leningrad in\n1930\n, and from\n1930\nhe worked in the Leningrad Mechanical Engineering Institute on algebra, theory of functions of complex variables, numerical methods and differential equations. He became head of the Division of Mechanics at the Turbine Institute as well as teaching innovative courses at Leningrad State University. The authors of\n[\n5\n]\nwrite:-\n... he quickly became one of the leading figures in Soviet Mechanics and Applied Mathematics. His many papers brought him to attention and made him famous world-wide. These were on the theory of elasticity, the theory of vibrations, the theory of mechanisms, methods of approximate numerical integration of differential equations and on other areas of mechanics and applied mathematics. His first publications showed him to be an outstandingly gifted young scientist but soon, in what were his last years, his talent matured and blossomed. The main features of Gershgorin's individuality are the innovative way he approached a problem, combined with power and clarity of analysis. These features are already apparent in his early papers - for example, his brilliant idea showing how to construct the profiles of airplane wings - and continue through to his last outstanding results in elasticity theory and in theory of vibrations.\nFirst let us look briefly at his\n1925\nand\n1926\npapers whose titles we gave above. Garry Tee, in\n[\n6\n]\n, describes some of Gershgorin's contributions contained in them:-\nGershgorin proposed an original and intricate mechanism for solving the\nLaplace\nequation, and he described such a device in detail in 'Instrument for the integration of the Laplace equation'\n(1925)\n.\nJ J Sylvester\nhad proved that any algebraic relation between real variables could be modelled by linkage mechanisms, but he had not mentioned the possibility of actually constructing such mechanisms. In Gershgorin's\n1926\npaper 'On mechanisms for the construction of functions of a complex variable', he described linkage mechanisms implementing the complex arithmetic operations of addition, subtraction, multiplication and division. He described mechanisms for constructing the complex relations\nw\n=\nz\n2\nw = z^{2}\nw\n=\nz\n2\nand\nw\n=\nz\n3\nw = z^{3}\nw\n=\nz\n3\n, which could also be applied for extracting square roots and cube roots. Gershgorin proposed that linkage mechanisms be constructed for various standard functions, which could then be assembled into larger mechanisms for more complicated functions. Later he became the first person to construct analogue devices applying complex variables to the theory of mechanisms ...\nIn\n1929\nGershgorin published\nOn electrical nets for approximate solution of the differential equation of Laplace\n(\nRussian\n)\nin which he gave a method for finding approximate solutions to partial differential equations by constructing a model based on networks of electrical components. In the following year he published\nFehlerabschätzung für das Differenzverfahren zur Lösung partieller Differentialgleichungen\nⓉ\n(\nError estimate for the difference method for solving partial differential equations\n)\nin which he made a careful analysis of the convergence of finite-difference approximation methods for solving the\nLaplace\nequation. However, his most famous paper, published in\n1931\n, is\nÜber die Abgrenzung der Eigenwerte einer Matrix\nⓉ\n(\nOn the limits of eigenvalues in a matrix\n)\n. In this paper he gave powerful estimates for matrix eigenvalues, known as his Circle Theorem. Richard Varga writes in\n[\n1\n]\n:-\nThe Gershgorin Circle Theorem , a very well-known result in linear algebra today, stems from the paper of S Gershgorin in\n1931\nwhere, given an arbitrary\nn\n×\nn\nn \\times  n\nn\n×\nn\n>complex matrix, easy arithmetic operations on the entries of the matrix produce\nn\nn\nn\ndisks, in the complex plane, whose union contains all eigenvalues of the given matrix. The beauty and simplicity of Gershgorin's Theorem has undoubtedly inspired further research in this area, resulting in hundreds of papers in which the name \"Gershgorin\" appears.\nLudwig Elsner\n[\n2\n]\nmakes an interesting remark concerning the fact that Gershgorin  wrote his paper on the Circle Theorem in German:-\nI would also point out the significance of the fact that Gershgorin's article was written in German. It is safe to guess that this was one of the reasons that certain people outside the Soviet Union, such as\nOlga Taussky-Todd\nand\nAlfred Brauer\n, studied it and made it known in the West during the\n1940\ns. Other important papers written in the Soviet Union in the\n1930\ns became known in the West only much later. I think that the influence of language on communication of mathematical ideas and results is substantial and cannot be overstated.\nThe authors of\n[\n5\n]\nwrite about Gershgorin's death at the very young age of\n31\n:-\nA vigorous, stressful job weakened Semyon Aranovich's health; he succumbed to an accidental illness, and a brilliant and successful young life has ended abruptly. Semyon Aranovich Gershgorin's death is a great and irreplaceable loss to Soviet Science.\nGershgorin's final paper\nOn the conformal map of a simply connected domain onto a circle\n(\nRussian\n)\nwas published in\n1933\nafter his death. He begins the paper with the following sentence:-\nIn this paper we present a method of conformal mapping of a given\n(\nfinite or infinite\n)\nconnected domain onto a disk, which is based on reducing the problem to a\nFredholm\nintegral equation.\nGarry Tee writes\n[\n6\n]\n:-\nL Lichtenstein\n[\nin 'Zur Theorie der konformen Abbildung: Konforme Abbildung nicht-analytischer, singularitätenfreier Flächenstücke auf ebene Gebiete'\nⓉ\n(\nOn the theory of conformal mapping: non-analytical, conformal mappings on singularity free patches on flat areas\n)\n(1916)]\nhad reduced that important problem to the solution of a\nFredholm\nintegral equation\n. Independently of\nLichtenstein\n, Gershgorin utilised Nystrom's method and reduced that conformal transformation problem to the same\nFredholm\nintegral equation. Later, A M Banin solved the\nLichtenstein\n-Gershgorin integral equation approximately, by reducing it to a finite system of linear differential equations.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}