{
  "nome_completo": "Sergei Ivanovich Adian",
  "nome_curto": "Sergei Ivanovich Adian",
  "ano_nascimento": "1931",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adian/",
  "lugar_nascimento": "Kushchi, Dashkesan District, Azerbaijan Soviet Republic",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Sergei Ivanovich Adian\nwas born in Kushchi, a mountain village forty kilometres from the city of Kirovabad\n(\nnow Gjanja\n)\n. His father, Ivan Arakelovich Adiyan, was born the son of a shepherd in\n1908\n. Not having the opportunity to finish secondary school, Ivan became a carpenter and worked on local building sites. In\n1930\nhe married Lusik, the\n17\n-year-old daughter of a local farmer, Konstantin Truziyan. Two years later Sergei's parents moved to Kirovabad, where Ivan worked as a carpenter. Initially they rented a room, and it was only at the end of the\n1930\ns that the father bought a plot of land in the centre of the city and built a small house with one room, a porch, and a little cellar. Being a builder, Ivan planned to add a second floor to the house, but this plan was disrupted by the war. By that time there were already four children in the family. The mother did not work, but the parents completed their secondary education studies at an Armenian evening school for labourers. Although at the time Sergei, like his parents, did not speak Russian, he was sent in\n1938\nto study at the Russian secondary school no.\n11\nin Kirovabad. His father insisted on that, since he believed that after finishing the school it would be easier for his son to get a higher education. And so from his very first year in school young Sergei had to develop persistence and diligence. His problems with Russian were overcome by the end of this first year.\nIn\n1941\n, at the very beginning of the war, Sergei's father was conscripted. After a short training course somewhere in the northern Caucasus, he was sent to the front. There he did not survive for long and his family received notice that he was missing. Sergei's mother got a job selling mineral water in a kiosk, and\n10\n-year-old Sergei effectively became the head of the household, helping his mother keep house and bring up his two younger brothers Semik\n(8\nyears old\n)\nand Yurik\n(3)\n, and his sister Svetlana\n(6)\n. There were good and, more importantly, exacting teachers in the school Sergei attended. His mathematical talent soon became apparent. Once, in the fourth grade, the teacher asked every student to solve one problem from a problem book, and she walked between the rows monitoring progress. While everybody else was still working hard on the first problem, Sergei had already solved several of them. The teacher was pleased and went on with the experiment until the end of the lesson. As a result, Sergei solved\n40\nproblems in one lesson. Another interesting episode took place in the tenth and last grade. Before the spring break, as part of preparation for final examinations, another teacher of mathematics, the school headmaster, gave his students homework in solid geometry based on trigonometric formulae from the popular problem book by Rybkin. The teacher asked everyone to solve only a couple of problems from each section, and he was immensely surprised when one of the students, Sergei Adian, handed him a thick notebook with complete solutions, drawings included, of all the problems from Rybkin's book! It is not surprising that the Education Department of Kirovabad submitted to Baku, the capital of the Azerbaijan Republic, a petition to send Sergei Adian to Moscow State University\n(\nMSU\n)\nto continue his education after completing his secondary school studies. But in Baku his name was crossed off the list. Following his headmaster's recommendation, Sergei then went to Erevan intending to enter Erevan University. But 'national politics' prevented him registering because prospective students were supposed to pass a written examination in Armenian, and the Armenian alphabet was certainly not a subject taught in a Russian school located in Azerbaijan. Finally, in\n1948\nAdian had to enter the Russian Pedagogical Institute of Erevan. His education there lasted only one year. After that he and others among the best students in Erevan were sent to continue their studies in Moscow. This action was organised by the USSR Ministry of Education, and every student was transferred to an institution similar to the one he was taken from. As a consequence, Adian was refused admission to MSU, so again for technical reasons, another attempt to enter there failed. However, he later said:-\nI should admit that at that time I was extremely lucky: I was not able to go to MSU. As fate willed, I went to the Moscow State Pedagogical Institute\n(\nMSPI\n)\n, where I met\nPetr Sergeevich Novikov\n, and he introduced me to his wife Lyudmila Vsevolodovna ...\nIf ever there was an encounter that could be called fortunate, it was the meeting of Adian and his future teacher, mentor, and friend\n(\nin spite of the difference in age\n)\nPetr Sergeevich Novikov\n. Adian started his research work at MSPI, with\nNovikov\nas his advisor, in the field of the descriptive theory of functions. In his first work as a student in\n1950\n, he proved that the graph of a function\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nof a real variable satisfying the functional equation\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nf (x + y) = f (x) + f (y)\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nand having discontinuities is dense in the plane.\n(\nClearly, all continuous solutions of the equation are linear functions.\n)\nThis result was not published at the time. It is curious that about\n25\nyears later the American mathematician\nEdwin Hewitt\nfrom Seattle gave preprints of some of his papers to Adian during a visit to MSU, one of which was devoted to exactly the same result, which was published by\nHewitt\nmuch later.\nIn his graduate work in\n1953\nrelating to the theory of discontinuous functions, Adian constructed examples of semicontinuous functions on the interval\n[\n0\n,\n1]\nthat, for any partition of the interval into a countable number of subsets\nE\ni\nE_{i}\nE\ni\n​\n, have discontinuities on at least one of the subsets upon restriction to this subset. This contribution also was not published right away. In\n1958\n, following a proposal of Adian, the work was published in the Scientific Notes of MSPI as joint work with\nNovikov\n.\nIn the autumn of\n1954\n,\nNovikov\nsuggested to Adian\n(\nthen in his third year of graduate study\n)\nthat he work on the word problem for finitely presented groups, noting that though Adian's results already obtained in the theory of functions were certainly enough for a Ph.D. thesis, this new problem was more interesting, was mentioned in\nKurosh\n's monograph, and was a difficult problem that had resisted solution by\nNovikov\n's methods. In suggesting it,\nNovikov\nconsidered the fact that Adian had already mastered thoroughly the methods of\nNovikov\n's proof, not yet published, of the unsolvability of the word problem. By the beginning of\n1955\nAdian had managed to prove the undecidability of practically all non-trivial invariant group properties, including the undecidability of being isomorphic to a fixed group G, for any group G. These results made up his Ph.D. thesis, defended in\n1955\nand first published the same year\n(\nthe full text of the proof was published two years later\n)\n. This is one of the most remarkable, beautiful, and general results in algorithmic group theory and is now known as the Adian-Rabin theorem\n(\nMichael O Rabin published a simpler proof of the result some years later\n)\n.\nOf course, the history of mathematics offers quite a few other examples of work of undergraduate or graduate students which later became classical results in their fields. However, what distinguishes the first published work by Adian even in this brilliant company is its completeness. In spite of numerous attempts, nobody has added anything fundamentally new to the results during the past\n50\nyears. For this work Adian was awarded the\nMoscow Mathematical Society\nPrize in\n1956\nand the\nChebyshev\nPrize of the\nSoviet Academy of Sciences\nin\n1963\n. It should be noted that A S Esenin-Volpin, one of the official opponents of Adian's Ph.D. thesis, after reading and verifying the thesis, made a special trip to\nNovikov\n's dacha in the summer of\n1955\nto convince him that such work merited a D.Sc. degree.\nNovikov\nanswered that there was nothing to be concerned about: he did not doubt that Adian would write another work for his D.Sc. dissertation. And the first opponent,\nAnatoly Ivanovich Malcev\n, proposed that the Academic Council of MSPI, where the defence was taking place, should call special attention to the outstanding level of the work.\nAfter completing his graduate studies, Adian worked for several years\n(\nin close cooperation with\nNovikov\n)\nas an assistant professor in the Mathematical Analysis Department of MSPI. And in\n1957\nan event happened which completely changed life for both him and his teacher, the Department of Mathematical Logic was created in the\nSteklov\nMathematical Institute\n(\nMIAN\n)\n, and\nNovikov\nwas invited to lead it. Adian became one of the first members of this new department, and his subsequent research career was closely connected with it. Furthermore, the collaboration between\nNovikov\nand Adian on the\nBurnside\nproblem started\n(\nabout\n1960)\nalready within the precincts of MIAN. In\n1960\n, at the insistence of\nNovikov\nand his wife\nLyudmila Keldysh\n, Adian settled down to work on the\nBurnside\nproblem. Completing the project took intensive efforts from both collaborators in the course of eight years, and in\n1968\ntheir famous paper\nInfinite periodic groups\nappeared, containing a negative solution of the problem for all odd periods\nn\n>\n4381\nn > 4381\nn\n>\n4\n3\n8\n1\n, and hence for all multiples of those odd integers as well. Adian published the classic monograph\nThe Burnside problem and identities in groups\n(\nRussian\n)\nin\n1975\n(\nan English translation was published four years later\n)\n.\nIn\n1965\n, at the invitation of\nA A Markov\n, Adian also took a second position, in the Department of Mathematical Logic at MSU. His work there continues to ensure a close and fruitful collaboration of the department with the Department of Mathematical Logic at MIAN. In\n1973\n, because of a serious illness of\nNovikov\nand at\nNovikov\n's personal request supported by\nVinogradov\n, the director of MIAN, Adian was appointed head of the department. This appointment happened despite the fact that neither Adian nor\nNovikov\nwere members of the Communist Party. The Department of Mathematical Logic in the Faculty of Mechanics and Mathematics at MSU went through a similar period of turbulence, for similar reasons, when the head of the department,\nA A Markov\n, fell sick at the end of the\n1970\ns. In many respects due to the energy, integrity, and diplomatic skills of Adian, this situation was also resolved favourably for the department.\nAdian has always devoted much attention to strengthening the Department of Mathematical Logic at MIAN, to training researchers in the Department of Mathematical Logic at MSU, and to developing new connections between these two related groups. He has had great success in this direction. Under his guidance more than thirty Ph.D. and D.Sc. dissertations have been written. His students are prominent researchers in algebra, mathematical logic, and computational complexity theory. After finishing at MSU, the strongest of them transferred to positions in the Department of Mathematical Logic at MIAN, which under his leadership became one of the most prominent and respected research centres in logic.\nIn the Department of Mathematical Logic at MSU Adian has for many years led a seminar on algorithmic problems of algebra and logic, in addition to sharing leadership of the department's main seminar with V A Uspenskii. Several times he has also given mandatory lecture courses in mathematical logic for the first and fourth years, and special lecture courses on algorithmic problems of algebra and on infinite periodic groups. Adian is in essence the creator and leader of a whole research school in mathematical logic and algorithmic problems of algebra. Besides his productive research and teaching activities, Adian is active in editorial and organizational work. As long ago as the end of\n1950\ns, S M Nikol'skii invited Adian, at the suggestion of\nNovikov\n, to edit the section on mathematical logic in\nReferativnyi Zhurnal: Matematika\n, the Russian mathematical review journal, because there was then a huge backlog of articles to be reviewed. In the shortest possible time Adian rectified the situation there with respect to logic by mobilizing almost all his colleagues for the thankless task of writing reviews\n(\nfor only a paltry fee\n)\n. At about the same time, he drew attention to the fact that a remarkable textbook on mathematical logic written by\nNovikov\nhad not been published, and that undergraduate and graduate students had to read a typescript.\nNovikov\nexplained that the publishing house\nFizmatgiz\nhad rejected the manuscript because they had not liked the frequent use of the term\nHilbert\nformalism in the preface: this was regarded as propaganda for a harmful bourgeois philosophical theory.\nNovikov\nplanned to return the advance of his fee to the publishers. Adian told him that this was simply unacceptable and began to help in revising and editing the book. He declined\nNovikov\n's offer that he should be coauthor, and about half a year later the first edition of\nNovikov\n's textbook on mathematical logic appeared. The book was subsequently translated into several foreign languages.\nFor many years Adian was the head of the Specialized Scientific Council of Vysshaya Attestatsionnaya Komissiya\n(\nVAK, the Higher Certification Commission\n)\nconcerned with defence of D.Sc. dissertations in mathematical logic, algebra, number theory, geometry, and topology, first as the vice-chairman and later, after the death of\nVinogradov\n, as the chairman. In\n1991\nhe asked to be relieved of the chairman position in view of his\n60\nth\nbirthday. However, when the directorate of MIAN proposed for this post a person who manifestly was not suitable, Adian could not reconcile himself with this and declared that he was prepared to remain in the position until a more appropriate successor was proposed. Finally, a candidate was chosen who was unanimously supported by the heads and the Division of Mathematics, and he was confirmed by VAK. Of course, such stands in life brought much trouble to Adian\n(\nthe lateness in his being elected a member of the Academy was mostly due to his having such a 'high profile'\n)\nand led to him making many enemies. However, the same strains of character have allowed him to acquire true friends among people of like mind who are impressed by his directness and open temperament. Adian did not wish to recognise government restrictions on human relations as necessary even at a time when this was fraught with various risks.\nEven the people closest to Adian would probably not be so bold as to call him an easy person to work with. Everybody who has ever dealt with him knows his adherence to principles and his uncompromising nature with respect to quite diverse questions, as well as his careful attention to details. However, those who have been in closer contact with him\n(\nand the authors of the present note belong to this list\n)\nwell know another aspect. In the end it almost always happens, in some incomprehensible way, that Adian has in fact been right from the very beginning. And his arguments have been at least worth considering always, without exception.\nAdian had three adult children, two daughters and one son. His son Ivan graduated from the Faculty of Mechanics and Mathematics at MSU. The older daughter Vera graduated with honours from the Faculty of Philology of MSU and in recent years has taught Russian on contract in London. The younger daughter Lena graduated from the S G Stroganov Moscow State University of Arts and Industrial Design\n(\nCeramics Department\n)\n. She does painting and ceramic arts and has displayed her works often at the Central House of Artists and at exhibitions of young Russian artists; very recently she was elected a member of the Union of Artists of the Russian Federation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}