{
  "nome_completo": "Sergei Lvovich Sobolev",
  "nome_curto": "Sergei Sobolev",
  "ano_nascimento": "1908",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sobolev/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Sergei L'vovich Sobolev\n's father, Lev Aleksandrovich Sobolev, was an important layer and barrister. His mother, Nataliya Georgievna, played an important role in Sobolev's upbringing, particularly after the death of Sobolev's father when Sobolev was\n14\nyears old. He studied at the Khar'kov Workers' Technical School preparing to enter the high school which he did in\n1922\naround the time of his father's death.\nThe high school which he entered was called the\n190\nth\nSchool of Leningrad at the time although previously it had been called the Lentovskii High School. In\n[\n5\n]\n(\nsee also\n[\n4\n]\n)\nit is explained that this school :-\n... was founded during the First Russian Revolution by the foremost St Petersburg teachers for pupils who had been excluded from the State Schools and Technical Colleges because of their participation in the revolutionary movement.\nAfter graduating from high school in\n1925\n, Sobolev entered the Physics and Mathematics Faculty of Leningrad State University where his talents were quickly spotted by\nSmirnov\nwho had returned to Leningrad three years earlier. Sobolev became interested in\ndifferential equations\n, a topic which would dominate his research throughout his life, and even at this stage in his career he produced new results which he published.\nBy\n1929\nSobolev had completed his university education and he began to teach in a number of different educational establishments. For example his first appointment was in\n1929\nat the Theoretical Department of the Seismological Institute of the\nUSSR Academy of Sciences\n. However, in addition, he taught at the Leningrad Electrotechnic Institute in\n1930\n-\n31\n.\nIn\n1932\nthe\nSteklov\nInstitute of Physics and Mathematics was divided into separate Departments of Mathematics and of Physics.\nVinogradov\nheaded the Mathematics Department and invited Sobolev to join the Department. By this time, however, Sobolev had already\n(\n[\n4\n]\nand\n[\n5\n]\n)\n:-\n... published a number of profound papers in which he put forward a new method for the solution of an important class of\npartial differential equations\n.\nWorking with\nSmirnov\n, Sobolev studied functionally invariant solutions of the wave equation. These methods allowed them to find closed form solutions to the wave equation describing the oscillations of an elastic medium. The methods also led them to a complete theory of\nRayleigh\nsurface waves and Sobolev went on to solve problems on diffraction. Sobolev was honoured for this outstanding work by election as Corresponding Member of the\nUSSR Academy of Sciences\nin\n1933\n.\nOn\n28\nApril\n1934\n, at the general meeting of the Division of Mathematical and Natural Sciences of the\nUSSR Academy of Sciences\n, a decision was taken to split the Departments of the\nSteklov\nInstitute of Physics and Mathematics, which had been created two years earlier, into two independent Institutes, the\nSteklov\nMathematical Institute and the Lebedev Physical Institute. In the same year the\nSteklov\nMathematical Institute was moved from Leningrad to Moscow and Sobolev went with the new Institute to Moscow. By\n1935\nSobolev was head of the Department of the Theory of Differential Equations at the Institute.\nDuring the\n1930\ns Sobolev introduced notions which were fundamental in the development of several different areas of mathematics\n[\n22\n]\n:-\nThe study of Sobolev function spaces, which he introduced in the\n1930\ns, immediately became a whole area of\nfunctional analysis\n. Sobolev's notion of generalised function\n(\ndistribution\n)\nturned out to be especially important; with further developments by\nSchwartz\nand\nGelfand\n, it became one of the central notions of mathematics.\nWhile working in Moscow, Sobolev built on the standard variational method for solving elliptic\nboundary value problems\nby introducing these Sobolev function spaces. He gave inequalities on the norms on these spaces which were important in the theory of embedding function spaces. He applied his methods to solve difficult problems in mathematical physics.\nIn\n1939\nSobolev was elected a full member of the\nUSSR Academy of Sciences\n. He was only\n31\nyears of age at the time of his election which was a remarkable achievement. It made him the youngest full member of the\nAcademy of Sciences\nand in fact he remained the youngest member for quite a few years.\nAt the beginning of World War II, the Steklov Mathematical Institute was moved from Moscow to Kazan. In the October of that year Sobolev was appointed as Director of the Institute and in the spring of\n1943\nhe supervised the move of the Institute back to Moscow. Sobolev became one of the first recipients of a Stalin prize\n(\nlater called a State prize\n)\nin the first presentation of these prizes in\n1941\n. His period as Director of the Institute ended in February\n1944\n.\nA new area of his research involved the study of the motion of a fluid in a rotating vessel. He was led to study a number of new problems which\n(\n[\n4\n]\nand\n[\n5\n]\n)\n:-\n... led him to lay the foundations of the theory of operators in a space with an indefinite metric, and to introduce new ideas in the\nspectral theory\nof operators. These ideas in the main concern generalised solutions of non-classical boundary value problems.\nIn\n1950\nhe published his famous text\nApplications of functional analysis in mathematical physics\n(\nin Russian\n)\n. An English translation was published by the\nAmerican Mathematical Society\nin\n1963\n.\nSchwartz\n's book on the the theory of distributions appeared in the same year.\nIn the early\n1950\ns Sobolev's work turned towards computational mathematics and in\n1952\nhe became head of the first department of computational mathematics in the Soviet Union when he organised the first such department at Moscow State University. However in\n1956\nhe joined with a number of colleagues in proposing ways in which the large areas of Russia in the east could be opened up with educational initiatives. The scheme was to set up a number of Institutes for Scientific research to balance the large number of high quality educational establishments in the east of the Soviet Union.\nAfter the plan was approved, Sobolev spent some time in Moscow recruiting staff and organising the establishment of an Institute in Novosibirsk. In\n[\n4\n]\nand\n[\n5\n]\nhis contribution to the Institute in Novosibirsk is stressed:-\nDuring the difficult formative years of the Institute Sobolev, by his excellent example, infused his young colleagues with the best habits for scientific work. In ten years, under the leadership of Sobolev, the Institute of Mathematics of the Siberian Branch of the\nUSSR Academy of Sciences\nhas become one of the greatest centres for the mathematical sciences of international status.\nIn\n1958\nSobolev was part of the Soviet delegation to the\nInternational Mathematical Union\n, the delegation being led by\nVinogradov\n, and Sobolev attended the International Congress at Edinburgh that year and gave an invited address on partial differential equations. From\n1960\nuntil\n1978\nSobolev, in addition to his work at the Institute of Mathematics of the Siberian Branch of the\nUSSR Academy of Sciences\n, was a professor at Novosibirsk University.\nDuring the\n1960\ns much of Sobolev's research was directed towards numerical methods, in particular to interpolation. Although interpolation for functions of a single variable was well worked out, the problem of interpolation in many dimensions was largely unsolved. Sobolev applied his theories of generalised functions and of embeddings of function spaces to cubature formulae, the multi-dimensional analogues of\nquadrature\nformulae for functions of one variable. Again a major text by Sobolev\nIntroduction to the theory of cubature formulae\nhas been extremely influential in this area.\nSobolev received many honours for his fundamental contributions to mathematics. He was elected to many scientific societies, including the\nUSSR Academy of Sciences\n, the\nAcadémie des Sciences\nde France, and the\nAccademia Nazionale dei Lincei\n. He was awarded many prizes, including three State Prizes and the\n1988\nM V Lomonosov Gold Medal from the\nUSSR Academy of Sciences\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}