{
  "nome_completo": "Sergei Petrovich Novikov",
  "nome_curto": "Sergei Novikov",
  "ano_nascimento": "1938",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Novikov_Sergi/",
  "lugar_nascimento": "Gorky (now Nizhny Novgorod), Russia",
  "lugar_morte": null,
  "biografia": "Sergei Novikov\n's father was\nPetr Sergeevich Novikov\nwho has a biography in this archive. Sergei's mother,\nLudmila Vsevolodovna Keldysh\n, was also an outstanding mathematician who became a professor of mathematics and made important contributions to set theory and geometric\ntopology\n. Both of Sergei's parents came from families with remarkable mathematical talents and several other members were noteworthy. We should mention especially Sergei's uncle\nMstislav Keldysh\nwho made major contributions to complex function theory, differential equations and applications to aerodynamics.\nMstislav Keldysh\nwas a leading Soviet scientist who was President of the\nUSSR Academy of Sciences\nfor many years.\nComing from such mathematically talented families, it will come as no surprise to learn that Sergei was not the only one of Petr and Ludmila's five children to follow a career in the mathematical sciences. Their oldest child, Leonid, went on to be a leading international figure in solid state physics. Their second child, Andrei, became an\nalgebraic number theorist\nwhile their third child was Sergei, the subject of this biography. Sergei had two younger sisters who both chose careers outside mathematics.\nSergei grew up in a mathematical environment, not only the result of the mathematical interests of family members around him but also since a special society was formed where the children of various mathematicians received additional instruction. Despite his high involvement with mathematics, or more likely because of it, Sergei was uncertain for many years whether he wanted to follow a career in the subject. He took part in Mathematical Olympiad Competitions when aged\n13\nand\n14\nand both he and his school teachers were thus fully aware of his outstanding talents.\nWhen he reached the age of seventeen Sergei finally decided that he wanted to follow a career in mathematics. On leaving school in\n1955\n, he entered the Faculty of Mathematics and Mechanics of Moscow University. There he became involved in high powered mathematics from the very beginning of his studies. V A Uspenskii, a pupil of\nKolmogorov\n, organised a seminar during Novikov's first year as a student in which problems in set theory, mathematical logic, and functions of a real variable were studied. Before beginning his second year of study Novikov had to choose a specialist topic and a supervisor. He decided to work on\nalgebraic topology\nand his work was supervised by\nM M Postnikov\n.\nAt this time the Faculty of Mathematics and Mechanics of Moscow University was a world leading centre for research in real analysis, with Kolmogorov the major influence.\nKolmogorov\nhad completely solved\nHilbert\n's Thirteenth Problem in\n1957\nand he was surrounded by a remarkably active research group. Topology, on the other hand, was not such an important topic at that time as far as Moscow University was concerned, so when\nPostnikov\nwent to China for the academic year\n1958\n-\n59\n, Novikov was left without a supervisor. During this academic year he studied the work of\nFrank Adams\nand\nRené Thom\n, and found his own research problems.\nMilnor\nhad introduced a type of\nHopf\nalgebra called a\nSteenrod\nalgebra in\n1957\nand in the following year the\ncohomology\nof the\nSteenrod\nalgebra had been investigated by\nAdams\n. Novikov's first important publication in\n1959\nCohomology of the Steenrod algebra\n, published in\nDoklady Akademii Nauk SSSR\n, developed further\nAdams\n's methods and results.\nAnother important paper Some problems in the topology of\nmanifolds\nconnected with the theory of\nThom\nspaces was published by Novikov in\n1960\n. It announced results on the cobordism theories corresponding to \"stable Thom complexes\". His geometrical approach was described by\nAdams\nin a review as:-\n... simple, elegant and natural.\nNovikov obtained his first degree in\n1960\nand then became a research student at the\nSteklov\nInstitute of Mathematics in Moscow. In\n1960\n-\n61\nhe\n[\n5\n]\n:-\n... studied the writings of\nWhitney\n,\nPontryagin\n,\nThom\nand\nMilnor\n, all of which are written with great clarity. The completeness of the proofs in these papers was achieved with no detriment to understanding and without any artificial formalisation.\nReading the papers of the leading researchers is important for any young mathematician, but personal contact can also be invaluable. In this respect Novikov was fortunate since\nMilnor\n, Hirzebruch and\nSmale\nall visited the USSR during the summer of\n1961\nto attend various conferences. From personal meeting with them Novikov learnt about the major directions and problems which were being studied in topology\n[\n5\n]\n:-\nAfter my meeting with\nSmale\nat the\nSteklov\nInstitute of Mathematics, where I was a postgraduate, my local supervisors began to regard me as a serious scientist.\nInspired by his meetings in the summer of\n1961\n, Novikov solved a major problem in the autumn of that year. His contributions to the classification problem for simply connected manifolds was eventually published as Homotopically equivalent smooth manifolds in\n1964\n. By that time\nBrowder\nhad, independently, discovered similar techniques to those Novikov had developed. Novikov received an award from the\nUSSR Academy of Sciences\nin\n1964\nfor this work and he was awarded his doctorate in the same year.\nIn\n1963\nNovikov had been appointed to the staff of the Steklov Institute of Mathematics and, the following year, he was also appointed to the Department of\nDifferential Geometry\nat Moscow University. Novikov became head of the Mathematics Division at the\nL D Landau\nInstitute for Theoretical Physics of the\nUSSR Academy of Sciences\nin\n1971\n.\nNovikov also became head of the Department of Higher Geometry and Topology of Moscow University in\n1983\nand, the following year he became head of the Department of Geometry and Topology of the Mathematical Institute of the\nUSSR Academy of Sciences\n. He was appointed as president of the\nMoscow Mathematical Society\nin\n1985\n, when he succeeded\nKolmogorov\n, and held this position until\n1996\n.\nSince\n1996\nhe has been working at the University of Maryland in the United States but retains close links with Russia with a research appointments in Moscow University, in the Landau Institute for Theoretical Physics, and as Head of the Geometry and Topology research groups at the\nSteklov\nInstitute.\nNovikov's work up to\n1971\nwas on algebraic and\ndifferential topology\n; in particular he studied calculating stable\nhomotopy groups\nand classifying smooth simply-connected manifolds of dimension greater than\n4\n. He also studied the topological invariance of\nrational\nPontryagin\nclasses.\nIn\n1965\nNovikov proved his famous theorem on the invariance of\nPontryagin\nclasses and stated the conjecture, now known as the Novikov conjecture, concerning the homotopy invariance of certain polynomials in the\nPontryagin\nclasses of a manifold, arising from the\nfundamental group\n. It is one of the most fundamental problems in topology. Novikov's original motivation was the theory, in the simply connected case, of\nBrowder\n-Novikov and\nWall\n, which led to the classification of manifolds in high dimensions. Novikov discussed his conjecture in a lecture given at the\n1970\nInternational Congress of Mathematicians in Nice where he received a\nFields Medal\n. However, he was not allowed to attend the award ceremony in Nice in person, since the Soviet authorities wanted to punish him for the support he had given to those arrested and sent to mental institutions for speaking out against the regime.\nAfter\n1971\nNovikov became interested in mathematical physics and\ndynamical systems\n. He studied a wide variety of applications of mathematics such as dynamical systems in the theory of homogeneous cosmological models, the theory of solitons, the\nspectral theory\nof linear operators, quantum field theory and string theory. In\n1982\nhe became interested in topological problems which arise in the physical theory of metals.\nNovikov has received many honours for his outstanding work. Perhaps the most important of these awards has been the Fields Medal, referred to above, which he received in\n1970\n. In\n1981\nhe became a full member of the\nUSSR Academy of Sciences\n, receiving the\nLobachevsky\nPrize of the Academy in the same year.\nMany societies have honoured Novikov with membership such as the\nLondon Mathematical Society\nin\n1987\nand the\nPontifical Academy of Sciences\nin\n1996\n. He was elected to the\nNational Academy of Sciences\nof United States in\n1994\n. Among many other honours, we should mention that he received honorary doctorates from the universities of Athens and Tel Aviv.\nIn\n2005\nNovikov was awarded the Wolf Prize:-\n... for his fundamental and pioneering contributions to topology and to mathematical physics.\nAn article in the May\n2005\npart of the\nNotices\nof the\nAmerican Mathematical Society\nexplains the work which led to the award:-\nHis early work in algebraic and differential topology includes such milestones as the calculation of cobordism rings and stable homotopy groups, proof of the topological invariance of rational Pontrjagin classes, formulation of the \"Novikov Conjecture\" on higher signature invariants, and proof of the existence of closed leaves in two-dimensional foliations of the\n3\n-sphere.\nIn the early\n1970\ns Novikov turned his attention to mathematical physics, initially contributing to general relativity and conductivity of metals. He constructed a global version of Morse theory on manifolds and loop spaces that had novel applications to quantum field theory\n(\nmultivalued action functionals\n)\n. His most significant achievements in mathematical physics flow from his introduction of algebraic-geometric methods to the study of completely integrable systems. These include a systematic study of finite-gap solutions of two-dimensional integrable systems, formulation of the equivalence of the classification of algebraic-geometric solutions of the KP equation with the conformal classification of Riemann surfaces, and work\n(\nwith Krichever\n)\non \"almost commuting\" operators that appear in string theory and matrix models\n(\n\"Krichever-Novikov algebras\", now widely used in physics\n)\n.\nNovikov made a fundamental and striking contribution to two separate fields in mathematics, while he is one of those rare mathematicians who brings deep, key mathematical ideas to bear on difficult pivotal problems of physics, in ways that are stunning and compelling for both mathematicians and physicists.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}