{
  "nome_completo": "Shanti Swarup Gupta",
  "nome_curto": "Shanti Swarup Gupta",
  "ano_nascimento": "1925",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gupta/",
  "lugar_nascimento": "Saunasi, Mainpuri, India",
  "lugar_morte": "West Lafayette, Indiana, USA",
  "biografia": "Shanti Swarup Gupta\nwas brought up and educated in India. He studied for a Master's Degree at the University of Delhi and then began teaching there. After several years, he was awarded a Fulbright Scholarship in\n1953\nwhich enabled him to read for a doctorate in the United States. He studied at the University of North Carolina at Chapel Hill with\nRaj Chandra Bose\nas his thesis advisor. He was awarded his doctorate in\n1956\nfor his thesis\nOn a Decision Rule for a Problem in Ranking Means\n. He then began research in statistics at Bell Laboratories, in Allentown, eastern Pennsylvania. These Laboratories were set up to develop equipment and systems manufactured by AT&T but they became involved in a wide range of basic and applied research in different areas. For example in the year which Gupta was awarded his doctorate, three scientists at the Bell Laboratories were awarded a Nobel Prize in Physics for inventing the transistor.\nGupta's first publications include the following with Milton Sobel:\nOn a statistic which arises in selection and ranking problems\n(1957)\n;\nOn selecting a subset which contains all populations better than a standard\n(1958)\n;\nOn the distribution of a statistic based on ordered uniform chance variables\n(1958)\n; and\nSelecting a subset containing the best of several binomial populations\n(1960)\n. During these early years of his research he also published\nMoments of order statistics from a normal population\n(1959)\nwritten jointly with his Ph.D. supervisor, and the single authored paper\nOrder statistics from the gamma distribution\n(1960)\n. As an example we look briefly at the type of problems that are studied in\nOn selecting a subset which contains all populations better than a standard\n.\nThe idea is to look at\nn\nn\nn\npopulations and one standard population, all having the same type of distribution. One of the\nn\nn\nn\npopulations is 'at least as good as the standard population' for a particular parameter if the value of that parameter is at least as high in that population as in the standard one. The authors then investigate how, given a fixed probability\np\np\np\n, one can choose a subset of the\nn\nn\nn\npopulations so that the probability is at least\np\np\np\nthat the subset contains all those at least as good as the standard population. A range of different distributions and parameters are discussed such as the populations all have normal distributions with the same variance and the parameter is the mean.\nGupta publication record is exceptional containing over\n200\nitems. Among these are two important books. The first of these is\nMultiple decision procedures: theory and methodology of selecting and ranking populations\nwritten jointly with S Panchapakesan and published in the Wiley Series in Probability and Mathematical Statistics in\n1979\n. Khursheed Alam, reviewing the text, wrote:-\nThis book contains a comprehensive collection of published literature in multiple decision theory, dealing with problems of ranking and selection. The book deals primarily with the subject of ranking and selection. However, a section of the book covers related areas, such as the estimation of ordered parameters. The material presented in the book has been properly arranged and carefully written so that the book serves as a textbook for graduate students as well as a reference book. The content of the book is not only pleasant to read but it is also motivating.\nThe second important text is\nMultiple statistical decision theory: recent developments\nwritten jointly with Deng Yuan Huang and published in\n1981\n. The same reviewer writes:-\nIn this monograph the authors present a short discussion of the statistical theory of multiple decision rules with particular reference to the subject of ranking and selection.\nGupta held academic posts at universities such as the University of Alberta and New York University where he worked at the Courant Institute. He also held visiting lectureships at Stanford University, the University of California at Berkeley and the Technical University of Darmstadt in Germany. In\n1962\nhe was appointed as Professor of Statistics and Mathematics at Purdue University, a position he held until his death. At Purdue he founded the Department of Statistics in\n1968\nand served as the first Head of Department from its foundation until\n1995\n.\nFor his many contributions to statistics, Gupta was honoured by election as a fellow of several societies such as the American Association for the Advancement of Science, the\nAmerican Statistical Association\n, and the Institute of Mathematical Statistics\n(\nfor which he served a term as president\n)\n. The Indian Statistical Association elected him to honorary membership. He also served as Editor-in-Chief of the Journal of Statistical Planning and Inference.\nGupta married Marianne Heinicke; they had one daughter Maya.",
  "math_areas": [
    "Analysis",
    "Statistics"
  ]
}