{
  "nome_completo": "Sharaf al-Din al-Muzaffar al-Tusi",
  "nome_curto": "Sharaf al-Din al-Tusi",
  "ano_nascimento": "1135",
  "ano_morte": "1213",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Tusi_Sharaf/",
  "lugar_nascimento": "Tus, Khorasan (now Iran)",
  "lugar_morte": "Iran",
  "biografia": "Sharaf al-Din al-Tusi\n's full name is Sharaf al-Din Al-Muzaffar ibn Muhammad ibn Al-Muzaffar al-Tusi. Very little is known of his life but a few details can be reconstructed from references that occur in works about other scientists of the time.\nWe can certainly deduce from his name that he was born in the region of Tus. This region, in northeastern Iran, includes the towns of Tus and the close-by town of Meshed, both high up in the valley of the Kashaf River. Nishapur, which is\n75\nkm west of Tus, is in the same region and it would be impossible without discovering further information to be precise about which town of the Tus region that he was born in.\nWhat is certain is that he spent a large part of his life teaching in different towns over quite a wide area. The Seljuq Turks had captured Damascus in Syria in\n1154\nand made it the capital of their large empire. The city prospered and many, including al-Tusi, were attracted to it. Certainly around\n1165\nAl-Tusi was in Damascus for there he taught Abu'l Fadl about the works of\nEuclid\nand\nPtolemy\n. Abu'l Fadl was an interesting person, for he had started out as a carpenter before studying mathematics with al-Tusi. From Damascus it would appear that Al-Tusi remained in Syria, going from the largest to the second largest city of Syria, namely Aleppo.\nAl-Tusi must have taught in Aleppo for at least three years, and it is interesting that there he taught an important member of the Jewish community of that city. Aleppo contained both a Jewish and Muslim community and around\n50\nyears earlier it had played a major part in the Muslim resistance to the crusaders, who had unsuccessfully besieged the city. In Aleppo al-Tusi taught various mathematical topics including the science of numbers, astronomical tables and astrology.\nFrom Aleppo, al-Tusi must have gone to Mosul, a city in northwestern Iraq, situated on the right bank of the Tigris River. At this time the city was at its political high point, being under the rule of the Zangid dynasty. In Mosul Al-Tusi taught his most famous pupil Kamal al-Din ibn\nYunus\n. In turn Kamal al-Din ibn\nYunus\nwent on to teach\nNasir al-Din al-Tusi\n, one of the most famous of all the Islamic scholars of the period. By this time al-Tusi seems to have acquired an outstanding reputation as a teacher of mathematics for some travelled long distances hoping to become his students.\nAl-Tusi was probably still in Mosul when Saladin\n(\nwho had himself been brought up in Mosul\n)\nmoved his forces into Syria to begin his policy of uniting, partly by force and partly by diplomacy, the area of Syria, Mesopotamia, Palestine, and Egypt. Saladin captured Damascus in\n1174\nand at about this time al-Tusi left Mosul and returned to Iran. He taught in Baghdad towards the end of his life and it was during this period that he wrote his famous work on algebra which we shall describe below.\nWe do have a number of works by al-Tusi which are important in the development of mathematics. The most important is described by Sarton\n[\n5\n]\nas:-\n... a treatise on algebra ...\n[\nwritten\n]\nin\n1209\n[\nwhich\n]\nis only known through a commentary by an unknown author.\nSarton's use of the word \"commentary\" is a little misleading, since the unknown author of the manuscript writes\n(\nsee for example\n[\n4\n]\n)\n:-\nIn this work I wanted to summarise the art of algebra and al-muqabala, adapt what has survived from the great philosopher Sharaf al-Din al-Muzaffar ibn al-Muzaffar ibn Muhammad al-Tusi, and reduce his over lengthy exposition to a moderate size; I eliminated the tables he drew up to make his computations and solve his problems.\nWhat is in this\nTreatise on equations\nby al-Tusi? Basically it is a treatise on\ncubic equations\n, but it does not follow the general development that came through\nal-Karaji\n's school of algebra. Rather, as Rashed writes in\n[\n2\n]\n:-\n... it represents an essential contribution to another algebra which aimed to study curves by means of equations, thus inaugurating the beginning of\nalgebraic geometry\n.\nIn the treatise equations of degree at most three are divided into\n25\ndifferent types. First al-Tusi discusses twelve types of equation of degree at most two. He then looks at eight types of cubic equation which always have a positive solution, then five types which may have no positive solution.\nThe method which al-Tusi used is quite remarkable. We illustrate the method by showing how al-Tusi examined one of the five types of equation which under certain conditions has a solution, namely the equation\nx\n3\n+\na\n=\nb\nx\nx^{3} + a = bx\nx\n3\n+\na\n=\nb\nx\n, where\na\n,\nb\na, b\na\n,\nb\nare positive. We use, of course, modern notation to make the solution easy to understand, while al-Tusi would express all his mathematics in words. Al-Tusi's first comment is that if\nt\nt\nt\nis a solution to this equation then\nt\n3\n+\na\n=\nb\nt\nt^{3} + a = bt\nt\n3\n+\na\n=\nb\nt\nand, since\na\n>\n0\n,\nt\n3\n<\nb\nt\na > 0, t^{3} < bt\na\n>\n0\n,\nt\n3\n<\nb\nt\nso\nt\n<\n√\nb\nt < √b\nt\n<\n√\nb\n.\nNext al-Tusi notes that\nb\nx\n−\nx\n3\n=\na\nbx - x^{3} = a\nb\nx\n−\nx\n3\n=\na\nand he then finds where the maximum of\ny\n=\nb\nx\n−\nx\n3\ny = bx - x^{3}\ny\n=\nb\nx\n−\nx\n3\noccurs. Basically using the derivative of this expression, al-Tusi finds the maximum occurs at\nx\n=\n√\n(\nb\n3\n)\nx = √(\\large\\frac{b}{3}\\normalsize )\nx\n=\n√\n(\n3\nb\n​\n)\nand then finds the maximum value for\ny\ny\ny\nof\n2\n(\nb\n3\n)\n3\n/\n2\n2(\\large\\frac{b}{3}\\normalsize )^{3/2}\n2\n(\n3\nb\n​\n)\n3\n/\n2\nby substituting\nx\n=\n√\n(\nb\n3\n)\nx = √(\\large\\frac{b}{3}\\normalsize )\nx\n=\n√\n(\n3\nb\n​\n)\nback into\ny\n=\nb\nx\n−\nx\n3\ny = bx - x^{3}\ny\n=\nb\nx\n−\nx\n3\n. Thus the equation\nb\nx\n−\nx\n3\n=\na\nbx - x^{3} = a\nb\nx\n−\nx\n3\n=\na\nhas a solution if\na\n≤\n2\n(\nb\n3\n)\n3\n/\n2\na ≤ 2(\\large\\frac{b}{3}\\normalsize )^{3/2}\na\n≤\n2\n(\n3\nb\n​\n)\n3\n/\n2\n. Then Al-Tusi deduces that the equation has a positive root if\nD\n=\n1\n27\nb\n3\n−\n1\n4\na\n2\n≥\n0\nD = \\large\\frac{1}{27}\\normalsize b^{3} - \\large\\frac{1}{4}\\normalsize a^{2} ≥ 0\nD\n=\n2\n7\n1\n​\nb\n3\n−\n4\n1\n​\na\n2\n≥\n0\nwhere\nD\nD\nD\nis the\ndiscriminant\nof the equation.\nOf course al-Tusi's use of the derivative of a function, without of course saying so, is very interesting. The paper\n[\n11\n]\nattempts to discover the origin of this implicit use of the derivative, which the author claims arises from algebraic proofs based on analytical procedures. The paper\n[\n12\n]\nsuggests that a rather different approach, not one analogous to the modern derivative, lay behind Al-Tusi's method. The papers\n[\n10\n]\nand\n[\n14\n]\ncontribute to this discussion; see also\n[\n2\n]\n,\n[\n3\n]\nand\n[\n4\n]\nfor further insights.\nAl-Tusi then went on to give what we would essentially call the\nRuffini\n-\nHorner\nmethod for approximating the root of the cubic equation. Although this method had been used by earlier Arabic mathematicians to find approximations for the\nn\nn\nn\nth root of an integer, al-Tusi is the first that we know who applied the method to solve general equations of this type.\nAnother famous work by al-Tusi is one in which he describes the linear\nastrolabe\n, sometimes called the \"staff of al-Tusi\", which he invented. It was\n[\n1\n]\n:-\n... a simple wooden rod with graduated markings but without sights. It was furnished with a plumb line and a double chord for making angular measurements and bore a perforated pointer.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}