{
  "nome_completo": "Shaun Wylie",
  "nome_curto": "Shaun Wylie",
  "ano_nascimento": "1913",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wylie/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Shaun Wylie\n's father, Francis James Wylie\n(1865\n-\n1952)\n, was a distinguished classical scholar and the Warden of Rhodes House at Oxford University. He was knighted in\n1929\n. Francis Wylie had married Kathleen, the daughter of Edmond Kelly, an American lawyer living in Paris, on\n18\nAugust\n1904\n. They met when Kathleen was a member of Lady Margaret Hall in Oxford. Francis and Kathleen had four sons and two daughters, the eldest of their sons dying in childhood. Shaun was the youngest of his parents' sons.\nShaun was brought up in Oxford in a home often filled by American scholars who were Rhodes Scholars at the University of Oxford. He attended the prestigious Dragon School, a Preparatory School on the northern edge of Oxford. The School was founded by Oxford dons in\n1877\nto provide a strong academic grounding to children of professors.\n(\nOne of the founders was a Mr George and this led to the name 'Dragon School'.\n)\nFrom the Dragon School, Wylie won a scholarship to Winchester College, one of the best independent schools in England. The school is situated in Winchester, south west of London, and there Wylie received an outstanding secondary education. Since his father was a classicist, he was keen that his son should study classics at school. Wylie, however, loved mathematics and the College arranged it so that he could study both subjects. He did\n[\n5\n]\n:-\n... all the mathematics that anyone could ever do. And I did all the classics - towards the end - except composition; I didn't have to do proses or verses, but I did all the translations, and the set-books, and the history. It was very civilised.\nWinchester College had closed scholarships to New College, Oxford, meaning that they were restricted to pupils at the school. Wylie was able to offer both classics and mathematics for the scholarship examinations. Entering New College in\n1931\n, he studied mathematics for a year but, having covered\nHardy\n's\nPure Mathematics\nat school, found it all too boring. He then decided to change to classics but never found the enthusiasm to put in much work and graduated with a second class degree. Even before he took his final examinations, he knew that he had made the wrong decision in giving up mathematics so he applied for a Commonwealth Fellowship to undertake research in mathematics at Princeton. He was awarded a scholarship but\n[\n5\n]\n:-\n... they were taking a chance on me. I always thought that I got elected because my father ran the Rhodes Scholarships and it was a nice gesture to elect me to a Commonwealth Fellowship. ...\nHenry Whitehead\n... said, \"if you want to do mathematics, go to Princeton and read topology. That's the best thing to do.\"\nWylie spent the three years\n1934\n-\n37\nat Princeton. In the first of these he studied for a Master's Degree and was able to stay for a third year after he was awarded a Procter Fellowship. He described his years at Princeton\n[\n1\n]\n:-\nAt that time the University Mathematics Department and the Institute for Advanced Study cohabited Fine Hall, and I had only the vaguest idea of who belonged to what. The topological luminaries were\nVeblen\nand\nAlexander\n, of the Institute, and\nLefschetz\n, of the University. ...\nAlexander\nat least twice announced a series of lectures and each time abandoned it fairly early on. There were, however, satisfying lectures from\nLefschetz\nand\nTucker\n, and after tea there were one-off seminar presentations, generally by research students. ... Princeton was a splendid place to be.\nČech\nwas there for a year and\nHurewicz\n. Among the graduate students were\nDowker\nand Steenrod and Wallman. Most people turned up for tea and were ready to talk; and the lecturers were highly available.\nHe began research under\nSolomon Lefschetz\nbut ended up being advised by\nAlbert Tucker\n(\nalthough\nLefschetz\nformally remained his supervisor\n)\n[\n5\n]\n:-\n[\nTucker\n's\n]\nlectures were quite elegant, and he communicated\n(\nat least to me\n)\na relish for the subject.\nLefschetz\npassed me on to him, and he shepherded me helpfully through my research.\nWylie was awarded a Ph.D. in\n1937\nfor his thesis\nDuality and Intersection in General Complexes\n.\nAlbert Tucker\nwrites that in his thesis Wylie:-\n... shows how the classical theory of duality and intersection for combinatorial manifolds\n[\nsee\nLefschetz\n, Topology,\n1930]\ncan be extended in a direct way to general simplicial complexes to duplicate the accomplishments of cohomology and multiplication\n[\nsee\nČech\n(1936)]\nand even to give greater generality in the results.\nHe returned to Britain shortly after his oral examination. Robert E Greenwood said in an interview:-\nShaun was one of the nicest fellows I've ever known. I remember at the time that he left he sold all of his possessions there at Princeton. They used to have sort of a garage sale - anybody that was going back to Britain after a few years. I remember going to his garage sale, although I don't think I bought anything.\nFor the year\n1937\n-\n38\nWylie undertook post-doctoral research at the University of Aberdeen in Scotland. During this year he represented Scotland at hockey. His father had a Scottish background which qualified Wylie to play for Scotland. He spent\n1938\n-\n39\nas a fellow of Trinity Hall, Cambridge, taking up an appointment as a mathematics master at Wellington College situated about\n35\nmiles south west of London. At Princeton, Wylie had met a fellow British student\nAlan Turing\nwho was there during\n1936\n-\n38\n. When war was declared in\n1939\nTuring immediately moved to work full-time at the Government Code and Cipher School at Bletchley Park. In December\n1940\nhe wrote to Wylie and invited him to work at Bletchley Park. In February\n1941\nWylie began to work with Turing in Hut\n8\non the problem of decoding the German Enigma device.\nHugh Alexander\n, who worked in Hut\n8\nfrom March\n1941\n, said:-\n... except for\nTuring\n, no one made a bigger contribution to the success of Hut\n8\nthan Wylie; he was easily the best all-rounder in the section, astonishingly quick and resourceful.\nIn late\n1943\nWylie moved from work on decoding the German Navy Enigma messages to attacking the more demanding messages sent by Lorenz machines. These machines used a teleprinter cipher and were given the general classification 'Fish'. Individual codes were given names as 'Tunny' and 'Jellyfish'. Wylie joined the section in F Block which had been built close to Hut\n11\nin early\n1943\n. He later said:-\nThe breaking of the Enigma machine ciphers is invariably cited as the great achievement of the Bletchley Park codebreakers. But the breaking of the German enciphered teleprinter traffic, given the generic codename of 'Fish', was a far greater achievement.\nAlso in\n1943\nWylie met and married Odette Murray, a Wren working at Bletchley Park. They had three sons and a daughter.\nWhen the war ended Wylie took up his academic career again. He was appointed a fellow of Trinity Hall, Cambridge. He is still remembered for his remarkable lecturing abilities. Norman Sanders recalls attending Wylie's lectures on linear algebra\n[\n2\n]\n:-\nHe lectured on linear algebra, a somewhat abstract subject for many. But his lectures were miracles of clarity and\n50\n-odd years later I still remember his little diagrams of the undiagrammable with vast amusement. Mathematics is not perhaps the most hilarious of subjects, but in Shaun's hands - and voice - it was pretty close.\nHe is remembered by a whole generation of undergraduates, however, because of his outstanding textbook\nHomology theory: An introduction to algebraic topology\n(1960)\nwhich he wrote in collaboration with\nPeter Hilton\n. A Heller writes in a review:-\nThis admirable book is designed to make the transition between the elementary textbook and the research-level treatise in\nalgebraic topology\n. It begins with concrete geometrical fundamentals and manages nevertheless to introduce its reader to enough of the heavyweight machinery of modern topology so that he may hope to attack the contemporary literature of the field. The plan of the book is bipartite. The first portion is concerned principally with the homology theory of simplicial polyhedra, the second with singular homology. ...\n[\nAn\n]\naccount of the contents does not convey the richness of the discussion and the plenitude of examples which indeed are calculated not only to illuminate the systematic discussion but also to introduce the reader to the atmosphere of algebraic topology. This aim is even more evident in the very extensive collection of problems, which range from straightforward exercises to items out of the recent literature ... This is a badly needed book. It does an excellent job of carrying the serious beginning student of algebraic topology to a genuine acquaintance with the field, and seems to this reviewer likely to become a standard work in a domain where indeed it is essentially without a rival.\nIn\n1958\nWylie returned to intelligence work when he took up an appointment as chief mathematician at the Government Communications Headquarters\n(\nGCHQ\n)\nin Cheltenham. This is the part of the British Intelligence Service which specializes in electronic surveillance and cryptology. He held this position until he retired in\n1973\nat the age of sixty. Retirement was for Wylie an opportunity to return to one of the things he enjoyed most in life, namely teaching children. He spent seven years teaching mathematics in various Cambridgeshire schools. But we should mention a few of Wylie's other interests.\nIt will come as no surprise that the man who added so much to decoding at Bletchley Park would be interested in crosswords. Wylie was an expert setter of crosswords and he set the crosswords in the\nListener\nfor many years. He used the nom-de-plume of Petti and the reader would need to have abilities like those of Wylie to even understand why. There is an old\n(15\nth\ncentury\n)\nScottish word wyliecoat which means a petticoat\n(\nan underskirt worn by women\n)\n. Now the link Wylie - wyliecoat - petticoat - Petti become clear. As to other interests, he was\n[\n3\n]\n:-\n... a governor of both Cheltenham College and Pates Grammar School, he was also a founder member of the Social Democratic Party and an active supporter of the Liberal Democrats. He took part in activities organised by the University of the Third Age in Cambridge, including play-reading in the original Greek, impressing his fellow readers of plays until the end of his life.",
  "math_areas": [
    "Algebra",
    "Topology"
  ]
}