{
  "nome_completo": "Shigeo Sasaki",
  "nome_curto": "Shigeo Sasaki",
  "ano_nascimento": "1912",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sasaki/",
  "lugar_nascimento": "Yamagata Prefecture, Japan",
  "lugar_morte": "Tokyo, Japan",
  "biografia": "Shigeo Sasaki\n's father was a farmer who lived in a small village in the Yamagata Prefecture of Japan. Shigeo was the second of his parents sons but he never knew his mother who died when he was only two years old. His uncle, who was a superior of a Buddhist temple, had no children of his own and offered to help by bringing up one of the two boys. So Shigeo was brought up by his uncle.\nHe attended the Sakata Middle School from\n1925\nwhere he was first introduced to mathematics. Shigeo lived in a dormitory, rather than at home, and the mathematics teacher at the school looked after the boys in the dormitory. He loved to explain mathematics to Shigeo and there were many opportunities. In\n1929\nShigeo moved from middle school to high school, entering the Second High School at Sendai.\nThere were academies in Japan for the brightest pupils who went to the one corresponding to the area in which they lived in order to prepare for a university education. Sasaki therefore, after showing great talents at middle school, made the natural progression to Sendai where he studied for three years. Although in earlier years there were no mathematics texts in Japanese, by the time Sasaki attended High School there were Japanese texts on algebra, analytic geometry, trigonometry and calculus, all of which he studied. The book he read at this stage of his education which he found most attractive was a Japanese translation of\nSalmon\n's\nA treatise on conic sections\n.\nSasaki graduated form the Second High School and entered Tohoku Imperial University at Sendai in April\n1932\n. He was particularly interested in the courses taught by T Kubota, one of the professors. These included several different geometry courses, including projective geometry, conformal geometry, non-Euclidean geometry,\ndifferential geometry\n, and synthetic geometry. Sasaki writes\n[\n3\n]\n:-\nAlthough his lectures were not so systematic, he presented important theorems and interesting ones and proved them with elegant ideas and attracted students.\nIn addition Sasaki, who was by now becoming fascinated by differential geometry, read some classic differential geometry texts including ones by\nBlaschke\n,\nEisenhart\n,\nSchouten\n, and\nCartan\n. He graduated in March\n1935\nand remained at Tohoku University to undertake research on differential geometry under Kubota's supervision.\nIn January\n1937\n, Sasaki began his career as a lecturer at Tohoku University while he continued to undertake research for his doctorate. He writes\n[\n3\n]\n:-\nDuring these years, I also read papers from mathematical journals and wrote several papers, although they were not far from being exercises. I wrote somewhat better papers five years after graduating. One of them is a series of three papers on the relations between the structure of spaces with normal conformal connections and their holonomy groups.\nIt was this last series of three papers which formed the basis of Sasaki's doctoral thesis which he presented in\n1943\n, receiving his doctorate in July of that year. A year later he was promoted to assistant professor. There were major difficulties in carrying out research in these war years since, quite apart from military reasons and problems caused by bombing, international mathematical journals and texts were not reaching Japan. Sasaki studied various classic papers which had reached Japan before the war including ones by\nG D Birkhoff\n,\nMorse\n,\nSeifert\nand\nThrelfall\n, and\nRado\n.\nDuring the early\n1940\ns Sasaki wrote a major text\nGeometry of Conformal Connection\nin Japanese, completing the manuscript of the book in\n1943\n. However, it was impossible to publish the book immediately after it was written due to problems caused by the war. It was eventually published in\n1948\n. K Yano, who undertook research on the same topic, explains the context of the book:-\nWeyl opened the way to the conformal differential geometry of Riemannian spaces in which one studies the properties of the spaces invariant under the so-called conformal transformation of the Riemannian metric. He discovered a tensor, now called Weyl's conformal curvature tensor, whose vanishing is a necessary condition that the space be conformally flat, that is to say, that the space can be mapped conformally on the Euclidean space. That this is also sufficient was proved by\nSchouten\n. ... writers... studied exclusively the conformal properties of a Riemannian space itself and paid only slight attention to the conformal properties of curves and surfaces immersed in a Riemannian space. S Sasaki, Y Muto, and K Yano have developed, since\n1938\n, the conformal theory of curves and surfaces in a conformally connected space as well as in a Riemannian space. Sasaki has obtained also a result on the structure of a conformally connected space whose group of holonomy fixes a point or a hypersphere. ... This book contains almost all the results mentioned above in the geometry of conformal connection.\nNot long after the end of the war, Kubota retired and in December\n1946\nSasaki was appointed to fill the vacant chair. He spent a period at the Institute for Advanced Study at Princeton from September\n1952\nto May\n1954\n. He collaborated with\nVeblen\nand\nMorse\nduring this time. He also visited\nChern\nat Chicago where he spent June and July of\n1954\n.\nIn\n1974\nChern visited Sasaki at Tohoku University. He writes\n[\n2\n]\n:-\nIn\n1974\nI was a visiting professor at Tohoku University when my wife and I stayed at the University Guest House ... Professor Sasaki's hospitality was the main factor in making my visit a profitable and enjoyable one.\nSasaki remained in the chair at Tohoku University until he retired in March\n1976\n, at which time he took up an appointment as professor at the Science University of Tokyo.\nAmong the topics Sasaki contributed to over a long research career were\nLie\ngeometry of circles, conformal connections, projective connections, holonomy groups, Hermitian manifolds, geometry of tangent bundles and almost contact manifolds\n(\nnow called Sasaki manifolds\n)\n, global problems on curves and surfaces in various spaces.\nHe wrote a major text\nDifferential geometry : Theory of surfaces\nwhich, S Funabashi, writes:-\n... is a guide to differential geometry, illustrating the topics with the theory of surfaces. The author's aim is to describe the method of study of global differential geometry, especially of the theory of two-dimensional surfaces immersed isometrically in a three-dimensional Euclidean space\nR\n3\n\\mathbb{R}^{3}\nR\n3\n. Most of the features for surfaces appearing in this book are closely related to topological geometry. The book is written in a clear style and avoids unnecessary generalizations.",
  "math_areas": [
    "Geometry"
  ]
}