{
  "nome_completo": "Shizuo Kakutani",
  "nome_curto": "Shizuo Kakutani",
  "ano_nascimento": "1911",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kakutani/",
  "lugar_nascimento": "Osaka, Japan",
  "lugar_morte": "New Haven, Connecticut, USA",
  "biografia": "Shizuo Kakutani\n's father, Kakujiro Kakutani, was a lawyer. Shizuo was the youngest of the two sons in the family, the eldest being Seiichi who was eight years older. Seiichi studied physics at Kyoto University and it was through him that Shizuo was first introduced to mathematics. When he was about nine years old his elder brother, on one of his frequent visits back to his home while he studied at university, would explain mathematical ideas to him.\nShizuo was fascinated and was enthusiastic to learn more mathematics. However two factors conspired to make this impossible. The first problem was that Kakujiro Kakutani had made the decision that one of his two sons would follow him into law and take over his practice in due course. Clearly Seiichi was training to be a physicist and not studying law so Shizuo would have to be the one to follow his father. The mathematics lessons from Seiichi were tragically cut short when he died of typhoid fever at the age of twenty.\nAfter completing his middle school, Shizuo entered Konan High School in Kobe to prepare for his university studies. At this stage he had to choose between arts subjects or sciences and his father gave him no choice since studying law at university required him to graduate from high school which qualifications in literature and arts. By the time Shizuo graduated, his father relented seeing that his son was so keen to study mathematics at university. However, Shizuo was now not qualified to enter a mathematics course at either the University of Tokyo or Kyoto University since these had absolute rules regarding entry qualifications.\nThere was one possible route for Shizuo which was to enter Tohoku University in Sendai. This did not prevent those without a science qualification entering a mathematics course but it gave preference to those the scientific training. Kakutani applied but there were only fifteen places, and seventeen applicants. Of the seventeen, exactly fifteen had the science qualification from high school so it looked like an easy task to decide to admit those and to turn down Kakutani. However, after due consideration it was decided to admit all seventeen applicants and Kakutani had scrape through.\nAt Tohoku University Kakutani was introduced to the theory of analytic functions. He read various classic texts including those of\nStone\nand\nBanach\nand by the time of his graduation at the end of the three year course he had a good foundation in modern analysis. He was appointed as a teaching assistant at Osaka University in\n1934\nwhere he collaborated with K Yosida on a paper on\nNevanlinna\ntheory. Hajian and Ito write in\n[\n3\n]\n:-\nDuring his years at Osaka University Shizuo Kakutani had already established himself as a research mathematician by publishing a number of papers in functional analysis and\nergodic theory\n, and the\n1937\npaper in the Japanese Journal on Mathematics on\nRiemann\nsurfaces. It was this work which was later to become the main part of his doctoral dissertation. it was also this paper that caught the attention of\nWeyl\n...\nIndeed on the strength of this work\nWeyl\ninvited Kakutani in\n1940\nto spend two years at the Institute for Advanced Study at Princeton. Kakutani not only took great interest in the work of\nWeyl\n's group at Princeton but also the group of mathematicians working with\nvon Neumann\non\nmeasure theory\nand ergodic theory. He met many other young mathematicians at Princeton who would influence him such as Ambrose,\nHalmos\n,\nDoob\n, and\nErdős\n. Kakutani also made many visits during which he met mathematicians such as\nGarrett Birkhoff\n,\nG D Birkhoff\n,\nStone\n,\nWiener\n, and\nHille\n.\nIn December\n1941\nwith Kakutani still studying at Princeton, war broke out between the United States and Japan with the entry of the U.S.A. into the Second World War. Of course this put Kakutani in a difficult position for he was now a guest in a country at war with his own. S Eigen says in\n[2]\n:-\nWith the outbreak of war he was given the option of staying at the Institute or returning to Japan. He chose to return because he was concerned about his mother. So he was put on a Swedish ship which sailed across the Atlantic, down around the Cape, and up to Madagascar, or thereabouts, where he and other Japanese were traded for Americans aboard a ship from Japan.\nThe trip across the Atlantic was long and hard. There was the constant fear of being torpedoed by the Germans. What, you may wonder, did Kakutani do. He proved theorems. Every day, he sat on deck and worked on his mathematics. Every night, he took his latest theorem, put it in a bottle and threw it overboard. Each one contained the instruction that if found it should be sent to the Institute in Princeton. To this day, not a single letter has been received.\nOn his return to Japan Kakutani accepted the appointment as assistant professor at Osaka University. He also continued his collaboration with Yosida, who by this time was at Nagoya University, and began a new collaboration with Yosida's colleague Kiyosi\nIto\nat Nagoya. The later war years were particularly difficult ones in Japan and many Japanese mathematicians failed to keep their research going through the difficulties of these times. Kakutani, however, managed to continue to produce a stream of papers containing highly original ideas.\nIn\n1948\nKakutani was again invited to the Institute for Advanced Study at Princeton. In the summer of that\n1949\nhe worked at the University of Illinois, then later that year accepted the offer of an appointment at Yale University. On one of his frequent visits to New York, Kakutani met Kay Uchida and they were married in\n1952\n; they had one daughter Michiko.\nKakutani contributed to several areas of mathematics. Among the areas on which he has written papers we must mention: complex analysis, topological groups, fixed point theorems, Banach spaces and\nHilbert spaces\n, Markov processes, measure theory, flows,\nBrownian motion\n, and ergodic theory.\nKakutani was to remain at Yale until he retired in\n1982\n. In June of that year he received the Academy Award and the Imperial Award of the Academy of Japan.\nAs to Kakutani's personality, Hajian and Ito write in\n[\n3\n]\n:-\nProfessor Kakutani is a gentleman and a scholar of the old school. His mild manner, gentle graciousness, and total dedication to mathematics leave an indelible impression on all who have gotten to know him.",
  "math_areas": [
    "Analysis"
  ]
}