{
  "nome_completo": "Sidney Luxton Loney",
  "nome_curto": "Sidney Luxton Loney",
  "ano_nascimento": "1860",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Loney/",
  "lugar_nascimento": "Chevithorne, Devon, England",
  "lugar_morte": "Richmond, England",
  "biografia": "Sidney Luxton Loney\nwas the eldest son of Solomon Loney\n(\nborn March\n1836\nin Wellington, Somerset, died\n9\nMay\n1920\nin Croydon, Surrey\n)\n, who was a schoolmaster living in Albert Road, and his wife Sarah Luxton Cann\n(\nborn\n1837)\n. Solomon and Sarah Loney were married in Tiverton, Devon in April\n1859\n. Let us note at this point that Sidney was born in Chevithorne, a small village about\n5\nkm north east of Tiverton, Devon. When he completed census forms later in his life, however, he usually gave Tiverton as his place of birth. Solomon and Sarah Loney had a large family with seven children: Sidney Loney\n(\nthe subject of this biography, born\n1860\n, died\n1939)\n, Herbert Lionel Loney\n(\nborn\n1862\n, died\n1953)\n, Arthur William Loney\n(\nborn\n1863\n, died\n1940)\n, Ellen Susannah Loney\n(\nborn\n1868\n, died\n1953)\n, Charles Loney\n(\nborn\n1870)\n, Camilla Loney\n(\nborn\n1873\n, died\n1902)\n, and Percy Ernest Loney\n(\nborn\n1876\n, died\n1947)\n.\nSidney attended school, first the Maidstone Grammar School, in Maidstone, Kent, and then, from\n1874\n, Tonbridge School in Tonbridge, Kent, where he was taught by Henry Hilary described in\n[\n9\n]\nas:-\n... one of the most remarkable mathematics teachers of his generation.\nHenry Hilary was the Senior Mathematical Master at Tonbridge School for\n37\nyears, from\n1870\nto\n1907\n. He became famous for the large number of his pupils who went on to become high Wranglers in the Mathematical Tripos at the University of Cambridge. Tonbridge School, founded in\n1553\n, gave Loney an exceptionally high quality education. He was one of about\n200\nboys at the school when he began his studies. Loney was in the Sixth Form at Tonbridge School\n1876\n-\n8\n, and during that year was Head Boy of the School. He won a Smythe Exhibition to support his studies at the University of Cambridge.\nLoney was admitted to Sidney Sussex College, University of Cambridge, as a pensioner on\n11\nOctober\n1878\n. He studied the Mathematical Tripos and graduated as\n3\nrd\nWrangler\nin\n1882\n. He was a fellow of Sidney Sussex College from\n1885\nto\n1891\n. E C Higgins writes\n[\n9\n]\n:-\nOn leaving Sidney Sussex College, Cambridge, Loney was faced with the choice which so often confronts the ablest young graduates - the choice between the advancement of specialised learning by research, or the advancement and diffusion of sound knowledge by direct teaching. His exceptional gifts of clear exposition and fertility of illustration led him towards teaching, and he devoted himself wholeheartedly to his chosen profession, as professor of mathematics at Royal Holloway College, London. Before the establishment of the internal side of the University of London, many students of Holloway College took the Final Honours Schools of the University of Oxford, and the mathematical class lists of the years\n1891\n-\n1907\nafford evidence of the high standard of mathematics at the College at that time. After the College became one of the internal colleges of the University of London, a corresponding high standard was maintained in the london honours lists ...\nLoney was awarded a B.A. by the University of London in\n1884\n. In July\n1885\nhe married Frances Elizabeth Hamlin\n(1851\n-\n1934)\nwho was the daughter of Hubert Palmer Osborne Hamlin\n(1824\n-\n1903)\nand Mary Ann Campbell\n(1821\n-\n1894)\n. Frances Hamlin, born in Cripplegate, Middlesex, was the eldest of her parents six children having siblings Alfred Hamlin, Frederick Hamlin, Louisa Hamlin, Clarence Hamlin and Hubert A Hamlin. Sidney and Frances Loney had two daughters, Hilda Mary Luxton Loney\n(1886\n-\n1940)\nand Dorothy Frances Loney\n(1888\n-\n1974)\n. Hilda, born July\n1886\n, was baptised on\n22\nDecember\n1886\nand at that time the family were living at\n34\nHogarth Road, St Jude, South Kensington. Dorothy, born\n10\nFebruary\n1888\n, married Harold Lister Woodhouse, who became a Colonel in the Army, in St Mary Magdalene with St Mathias Church in Richmond on\n23\nApril\n1921\n.\nLet us return to describing Loney's career as Professor of Mathematics at Royal Holloway College. He is best known to mathematicians as the author of a series of very popular books. These include:\nThe Elements of Statics and Dynamics, Part I Statics\n(1890)\n;\nThe Elements of Statics and Dynamics. Part II Dynamics\n(1891)\n;\nMechanics and Hydrostatics for Beginners\n(1892)\n;\nPlane trigonometry\n(1893)\n;\nThe Elements of Coordinate Geometry\n(1895)\n;\nThe Elements of Hydrostatics\n(1901)\n;\nShilling Arithmetic\n(1906)\n;\nAn Elementary Treatise on the Dynamics of a Particle and of Rigid Bodies\n(1909)\n;\nSolutions of the Examples in a Treatise on Dynamics of a Particle and of Rigid Bodies\n(1909)\n;\nAn Elementary Treatise on Statics\n(1912)\n;\nThe Elements of Coordinate Geometry. Part II. Trilinear Coordinates\n(1923)\n.\nFor a version of Loney's Prefaces to some of these books, see\nTHIS LINK\n.\nFor reviews of some of these books, some of which are quite critical, see\nTHIS LINK\n.\nFor extracts from reviews of Loney's books which Cambridge University Press used in advertising, see\nTHIS LINK\n.\nHarold Simpson writes\n[\n11\n]\n:-\nAs a teacher he had extraordinary success, and he could teach in print with the same facility as in the lecture room. His textbooks on mechanics, coordinate geometry, and trigonometry evidently supplied the needs of the student, for they became household words and the \"best sellers\" of the mathematical market. They excelled in their collections of \"exercises\", of a type which is perhaps a little too artificial\n(\nplanes always inclined at\n30\n° to the horizon when it isn't\n45\n° or\n60\n°, and particles describing central orbits under weird laws of force\n)\n, but attractive in their variety and the neatness of their answers.\nIn addition to his teaching and writing textbooks, Loney did an excellent job for the University of London. E C Higgins writes\n[\n9\n]\n:-\nLoney was an excellent man of business, with a genius for committee work; and for many years he was one of the most influential members of the Senate of the University of London. His capacity for strenuous work, his thorough grasp of business, and his intuitive knowledge of man and women, were given full scope during the Great War\n(1914\n-\n18)\n, when for a considerable time he carried out many of the duties of Principal Officer of the University in addition to his other work.\nIn\n1920\nLoney retired from his position as Professor of Mathematics at Royal Holloway College but he continued to undertake work for the University as well as serving the local community. He was a Justice of the Peace for Richmond and served as Mayor of Richmond, Surrey, during\n1920\n-\n21\n. He served as Chairman of Convocation, University of London, from\n1923\nand as Deputy Chairman of the Court from\n1929\n[\n4\n]\n:-\nThese services were all the more valuable because of his dual position in the University. As a former professor in one of the internal colleges, he was a warm supporter of the teaching side; on the other hand, he was also an active and enthusiastic representative of the external side; and he was strongly of the opinion that there was ample room for both internal and external sides in a great Imperial university, and that harmonious cooperation was the desirable ideal.\nLoney's wife, Frances Elizabeth Loney, died on\n30\nNovember\n1934\n, leaving £\n908\nto her husband Sidney Luxton Loney in her will. He died in May\n1938\nat Richmond and was buried there. In his will he left £\n81\n,\n316\nto:-\nHilda Mary Luxton Loney, spinster; Harold Lister Woodhouse Colonel H.M. army; and Percy Ernest Loney, retired bank manager.\nThese were, respectively, his unmarried daughter, the husband of his married daughter, and one of his surviving brothers. The sum of £\n81\n,\n316\nwas massive in\n1939\n, being the equivalent of about £\n5\n,\n000\n,\n000\nin today's money. This large sum must show how financially successful his many textbooks proved to be.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Number Theory"
  ]
}