{
  "nome_completo": "Sijue Wu",
  "nome_curto": "Sijue Wu",
  "ano_nascimento": "1964",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wu/",
  "lugar_nascimento": "Ningbo, China",
  "lugar_morte": null,
  "biografia": "Sijue Wu\n's school and undergraduate education were in China. She studied at Beijing University, being awarded her first degree in\n1983\nand a Master's Degree in\n1986\n. Even before the award of the Master's Degree, she had a paper published, namely\nHilbert\ntransforms for convex curves in\nR\nn\n.\nShe then went to the United States to undertake research. Her doctoral studies were undertaken at Yale University with Ronald Raphael Coifman as her thesis advisor. She submitted her thesis,\nNonlinear Singular Integrals and Analytic Dependence\n, in\n1990\nand was awarded a Ph.D. She begins her introduction to her thesis as follows:-\nThis thesis is composed of three interrelated parts: w-\nCalderón\n-\nZygmund\noperators, a wavelet characterization for weighted Hardy spaces, and the analytic dependence of minimal surfaces on their boundaries.\nAfter the award of her doctorate, Wu was appointed as\nCourant\nInstructor at the Courant Institute, New York University. She was a member at the Institute for Advanced Study at Princeton in the autumn of\n1992\nand was then she was appointed Assistant Professor at Northwestern University, holding this position for four years until\n1996\n. Her publications during this period included:\nA wavelet characterization for weighted Hardy spaces\n(1992)\n;\n(\nwith Italo Vecchi\n)\nOn L\n1\n-vorticity for\n2\n-D incompressible flow\n(1993)\n;\nAnalytic dependence of Riemann mappings for bounded domains and minimal surfaces\n(1993)\nand\nw-Calderón-Zygmund operators\n(1995)\n. After spending the year\n1996\n-\n97\nas a member of the Institute for Advanced Study at Princeton, she was appointed as Assistant Professor at the University of Iowa. In\n1997\nshe published the important paper\nWell-posedness in Sobolev spaces of the full water wave problem in\n2\n-D\n. Shu Ming Sun begins a very informative review as follows:-\nEveryone is familiar with the motion of water waves in everyday experience, and there has been an extremely rich variety of phenomena observed in the motion of such waves. However, the full equations governing the motion of the waves are notoriously difficult to work with because of the free boundary and the inherent nonlinearity, which are non-standard and non-local. Although many approximate treatments, such as linear theory and shallow-water theory as well as numerical computations, have been used to explain many important phenomena, it is certainly of importance to study the solutions of the equations which include the effects neglected by approximate models. The well-posedness of the fully nonlinear problem is one of the main mathematical problems in fluid dynamics. Here, the motion of two-dimensional irrotational, incompressible, inviscid water waves under the influence of gravity is considered.\nPromoted to Associate Professor at Iowa in\n1998\n, Wu was appointed as an Associate Professor at the University of Maryland, College Park, in\n1998\n. The university announced her appointment as follows:-\nSijue Wu comes to us from the University of Iowa. Her research interests centre on harmonic analysis and partial differential equations, in particular nonlinear equations from fluid mechanics. Her recent work concerns the full nonlinear water wave problem and the motion of general two-fluid flows.\nAt the\n107\nth\nAnnual Meeting of the\nAmerican Mathematical Society\nin January\n2001\nin New Orleans, Wu was awarded the\n2001\nSatter Prize. The citation reads\n[\n1\n]\n:-\nThe Ruth Lyttle Satter Prize in Mathematics is awarded to Sijue Wu for her work on a long-standing problem in the water wave equation, in particular for the results in her papers\n(1)\n\"Well-posedness in Sovolev spaces of the full water wave problem in\n2\n-D\"\n(1997)\n; and\n(2)\n\"Well-posedness in Sobolev spaces of the full water wave problem in\n3\n-D\"\n(1999)\n. By applying tools from harmonic analysis\n(\nsingular integrals and\nClifford\nalgebra\n)\n, she proves that the Taylor sign condition always holds and that there exists a unique solution to the water wave equations for a finite time interval when the initial wave profile is a\nJordan\nsurface.\nOf the paper\n(2)\nEmmanuel Grenier writes:-\nIn this very important paper the author investigates the motion of the interface of a\n3\nD inviscid, incompressible, irrotational water wave, with an air region above a water region and surface tension zero.\nIn her response Wu thanked her teachers, friends, and colleagues, making special mention of her thesis advisor Ronald Coifman for the constant support he had given her and Lihe Wang for his friendship and his help.\nAlso in\n2001\nWu received a Silver Morningside Medal at the International Congress of Chinese Mathematicians held in Taiwan in December:-\n... for her establishment of local well-posedness of the water wave problems in a\nSobolev\nclass in arbitrary space dimensions.\nIn August\n2002\nWu was an invited speaker at the International Congress of Mathematicians held in Beijing where she delivered the lecture\nRecent progress in mathematical analysis of vortex sheets\n. She gave the following summary of her lecture:-\nWe consider the motion of the interface separating two domains of the same fluid that move with different velocities along the tangential direction of the interface. We assume that the fluids occupying the two domains are of constant densities that are equal, are inviscid, incompressible and irrotational, and that the surface tension is zero. We discuss results on the existence and uniqueness of solutions for given data, the regularity of solutions, singularity formation and the nature of the solutions after the singularity formation time.\nWu was awarded a Radcliffe Institute Advanced Study Fellowship for the academic year\n2002\n-\n2003\n. Her project\nMathematical Analysis of Vortex Dynamics\nwas described in an announcement of the award\n[\n2\n]\n:-\nRecently, Wu's research has focused on nonlinear equations from fluid dynamics. Using harmonic analysis technique, she has established the local well-posedness of the full two- and three-dimensional waterwave problem. This settled a longstanding problem. As a Radcliffe fellow, Wu will continue her study of vortex sheet dynamics, a phenomenon that arises from the mixing of fluids, such as occurs during aircraft takeoffs. A vortex sheet is the interface separating two domains of the same fluid across which the tangential component of the velocity field is discontinuous. Achieving a better understanding of the motion of a vortex sheet requires proper mathematical modelling; Wu's long-term goal is to establish a successful model. She will also work on the boundary layer problem, another problem arising from fluid dynamics.\nOne outcome of this project, and of an NFS grant she was awarded for\n2004\n-\n2009\n, was the paper\nMathematical analysis of vortex sheets\n(2006)\n. Helena Nussenzveig Lopes begins a review of this paper by explaining what vortex sheets are:-\nVortex sheets are an idealized model of flows undergoing intense shear. In planar flows they are mathematically described as curves along which the velocity is tangentially discontinuous. Vortex sheets arise in a wide range of physical problems, and hence it is of fundamental importance to understand their evolution. The Birkhoff-Rott equations provide a mathematical description of the evolution of a vortex sheet. However, they have been shown to be ill-posed in several function spaces. It is a longstanding open problem to determine a function space in which these equations are well-posed, or, alternatively, to describe the evolution past singularity formation; this is the problem addressed in the present paper.\nWu was named Robert W and Lynne H Browne Professor of Mathematics at the University of Michigan and delivered her inaugural lecture\nMathematical Analysis of Water Waves\non\n29\nOctober\n2008\n. The Browne Professorship recognizes the Wu's outstanding contributions to science and teaching.\nFinally, let us mention her recent important paper\nAlmost global wellposedness of the\n2\n-D full water wave problem\n(2009)\n.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}