{
  "nome_completo": "Siméon Denis Poisson",
  "nome_curto": "Siméon-Denis Poisson",
  "ano_nascimento": "1781",
  "ano_morte": "1840",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Poisson/",
  "lugar_nascimento": "Pithiviers, France",
  "lugar_morte": "Sceaux (near Paris), France",
  "biografia": "Siméon-Denis Poisson\n's parents were not from the nobility and, although it was becoming increasingly difficult to distinguish between the nobility and the bourgeoisie in France in the years prior to the Revolution, nevertheless the French class system still had a major influence on his early years. The main reason for this was that the army was one of the few occupations where the nobility enjoyed significant institutional privileges and Poisson's father had been a soldier. Certainly Poisson's father was discriminated against by the nobility in the upper ranks of the army and this made a large impression on him. After retiring from active service he was appointed to a lowly administrative post which he held at the time that his son Siméon-Denis was born. There is no doubt that Siméon-Denis's family put a great deal of energy into helping him have a good start in life.\nSiméon-Denis was not the first of his parents children but several of his older brothers and sisters had failed to survive. Indeed his health was also very fragile as a child and he was fortunate to pull through. This may have been because his mother, fearing that her young child would die, entrusted him to the care of a nurse to bring him through the critical period. His father had a large influence on his young son, devoting time to teach him to read and write.\nSiméon-Denis was eight years old when the Parisian insurrection of\n14\nJuly\n1789\nheralded the start of the French Revolution. As might be expected of someone who had suffered discrimination at the hands of the nobility, Poisson senior was enthusiastic about the political turn of events. One immediate consequence for his support of the Revolution was the fact that he became president of the district of Pithiviers which is in central France, about\n80\nkm south of Paris. From this position he was able to influence the future career of his son.\nPoisson's father decided that the medical profession would provide a secure future for his son. An uncle of Poisson's was a surgeon in Fontainebleau and Poisson was sent there to become an apprentice surgeon. However, Poisson found that he was ill suited to be a surgeon. Firstly he lacked coordination to quite a large degree which meant that he completely failed to master the delicate movements required. Secondly it was quickly evident that, although he was a talented child, he had no interest in the medical profession. Poisson returned home from Fontainebleau having essentially failed to make the grade in his apprenticeship and his father had to think again to find a career for him.\nTimes were changing quite quickly in France which was by this time a republic. No longer were certain professions controlled by the nobility as they had been and there had been moves towards making education available to everyone. In\n1796\nPoisson was sent back to Fontainebleau by his father, this time to enrol in the École Centrale there. On the one hand he had shown a great lack of manual dexterity, but he now showed that he had great talents for learning, especially mathematics. His teachers at the École Centrale were extremely impressed and encouraged him to sit the entrance examinations for the École Polytechnique in Paris. He sat these examinations and proved his teachers right, for although he had far less formal education than most of the young men taking the examinations he achieved the top place.\nFew people can have achieved academic success as quickly as Poisson did. When he began to study mathematics in\n1798\nat the École Polytechnique he was therefore in a strong position to cope with the rigours of a hard course, yet overcome the deficiencies of his early education. There were certainly problems for him to overcome for he had little experience of the social or academic environment into which he was suddenly thrust. It was therefore to his credit that he was able to undertake his academic studies with great enthusiasm and diligence, yet find time to enjoy the theatre and other social activities in Paris. His only weakness was the lack of coordination which had made a career as a surgeon impossible. This was still a drawback to him in some respects for drawing mathematical diagrams was quite beyond him.\nHis teachers\nLaplace\nand\nLagrange\nquickly saw his mathematical talents. They were to become friends for life with their extremely able young student and they gave him strong support in a variety of ways. A memoir on finite differences, written when Poisson was\n18\n, attracted the attention of\nLegendre\n. However, Poisson found that descriptive geometry, an important topic at the École Polytechnique because of\nMonge\n, was impossible for him to succeed with because of his inability to draw diagrams. This would have been an insurmountable problem had he been going into public service, but those aiming at a career in pure science could be excused the drawing requirements, and Poisson was not held back. In his final year of study he wrote a paper on the theory of equations and\nBézout\n's theorem, and this was of such quality that he was allowed to graduate in\n1800\nwithout taking the final examination. He proceeded immediately to the position of répétiteur in the École Polytechnique, mainly on the strong recommendation of\nLaplace\n. It was quite unusual for anyone to gain their first appointment in Paris, most of the top mathematicians having to serve in the provinces before returning to Paris.\nPoisson was named deputy professor at the École Polytechnique in\n1802\n, a position he held until\n1806\nwhen he was appointed to the professorship at the École Polytechnique which\nFourier\nhad vacated when he had been sent by Napoleon to Grenoble. In fact Poisson had little time for politics for rather his whole energies were directed to support mathematics, science, education and the École Polytechnique. When the students at the École had been about to publish an attack on Napoleon's ideas for the Grand Empire in\n1804\n, Poisson had managed to stop them, not because he supported Napoleon's views but rather because he saw that the students would damage the École Polytechnique by their actions. Poisson's motives were not understood by Napoleon's administration, however, and they saw Poisson as a supporter which did his career no harm at all.\nDuring this period Poisson studied problems relating to ordinary\ndifferential equations\nand\npartial differential equations\n. In particular he studied applications to a number of physical problems such as the pendulum in a resisting medium and the theory of sound. His studies were purely theoretical, however, for as we mentioned above, he was extremely clumsy with his hands\n[\n19\n]\n:-\nPoisson ... was content to remain totally unfamiliar with the vicissitudes of experimental research. It is quite unlikely that he ever attempted an experimental measurement, nor did he try his hand at drafting experimental designs.\nHis first attempt to be elected to the Institute was in\n1806\nwhen he was backed by\nLaplace\n,\nLagrange\n,\nLacroix\n,\nLegendre\nand\nBiot\nfor a place in the Mathematics Section.\nBossut\nwas\n76\nyears old at the time and, had he died, Poisson would have gained a place. However\nBossut\nlived for another seven years so there was no route into the mathematics section for Poisson. He did, however, gain further prestigious posts. In addition to his professorship at the École Polytechnique, in\n1808\nPoisson became an astronomer at Bureau des Longitudes. In\n1809\nhe added another appointment, namely that of the chair of mechanics in the newly opened Faculté des Sciences.\nIn\n1808\nand\n1809\nPoisson published three important papers with the\nAcademy of Sciences\n. In the first\nSur les inégalités des moyens mouvements des planètes\nⓉ\n(\nOn inequalities of the average movements of the planets\n)\nhe looked at the mathematical problems which\nLaplace\nand\nLagrange\nhad raised about perturbations of the planets. His approach to these problems was to use series expansions to derive approximate solutions. This was typical of the type of problem which he found interesting.\nLibri\nwrote\n[\n1\n]\n:-\n... he especially liked unresolved questions that had been treated by others or areas in which there was still work to be done.\nIn\n1809\nhe published two papers, the first\nSur le mouvement de rotation de la terre\nⓉ\n(\nOn the earth's rotational movement\n)\nand the second,\nSur la variation des constantes arbitraires dans les questions de mécanique\nⓉ\n(\nOn the variation of arbitrary constants in the mechanical questions\n)\nwas a direct consequence of developments in\nLagrange\n's method of variation of arbitrary constants which had been inspired by Poisson's\n1808\npaper. In addition he published a new edition of\nClairaut\n's\nThéorie de la figure de la terre\nⓉ\n(\nTheory of the shape of the earth\n)\nin\n1808\n. The work had been first published by\nClairaut\nin\n1743\nand it confirmed the\nNewton\n-\nHuygens\nbelief that the Earth was flattened at the poles. In\n1811\nPoisson published his two volume treatise\nTraité de mécanique\nⓉ\n(\nTreatise on mechanics\n)\nwhich was an exceptionally clear treatment based on his course notes at the École Polytechnique.\nMalus\nwas known to have a terminal illness by\n1811\nand his death would leave a vacancy in the physics section of the Institute. The mathematicians, aiming to have Poisson fill that vacancy when it occurred, set the topic for the Grand Prix on electricity so as to maximise Poisson's chances. The topic for the prize was as follows\n(\nsee for example\n[\n20\n]\n)\n:-\nTo determine by calculation and to confirm by experiment the manner in which electricity is distributed at the surface of electrical bodies considered either in isolation or in the presence of each other - for example at the surface of two electrified spheres in the presence of each other. In order to simplify the problem, the Class asks only for an examination of cases where the electricity spread on each surface remains always of the same kind.\nPoisson had made considerable progress with the problem before\nMalus\ndied on\n24\nFebruary\n1812\n. Poisson submitted the first part of his solution to the Academy on\n9\nMarch entitled\nSur la distribution de l'électricité à la surface des corps conducteurs\nⓉ\n(\nOn the distribution of electricity on the surface of the conducting bodies\n)\n. As the mathematicians had intended, this was the deciding factor in Poisson being elected to the physics section of the Institute to replace\nMalus\n. It also marked a move away from experimental research towards theoretical research in what was considered to constitute physics, and in this the Institute was following the lead given by\nLaplace\n.\nPoisson continued to add various responsibilities to his already busy life. In\n1815\nhe became examiner for the École Militaire and in the following year he became an examiner for the final examinations at the École Polytechnique.\nIt is remarkable how much work Poisson put in; to his research, to his teaching and to playing an ever increasingly important role in the organisation of mathematics in France. When he married Nancy de Bardi in\n1817\nhe found that family life put yet another pressure on him yet somehow he survived the pressures continuing to take on further duties. His research contributions covered a wide range of applied mathematics topics. Although he devised no innovative new theories, he made major contributions to further developing the theories of others often being the first to exhibit their real significance. We mention now just a few of the topics he studied after his election to the Academy.\nIn\n1813\nPoisson studied the\npotential\nin the interior of attracting masses, producing results which would find application in electrostatics. He produced major work on electricity and magnetism, followed by work on elastic surfaces. Papers followed on the velocity of sound in gasses, on the propagation of heat, and on elastic vibrations. In\n1815\nhe published a work on heat which annoyed\nFourier\nwho wrote:-\nPoisson has too much talent to apply it to the work of others. To use it to discover what is already known is to waste it ...\nFourier\nwent on to make valid objections to Poisson's arguments which he corrected in later memoirs of\n1820\nand\n1821\n.\nIn\n1823\nPoisson published on heat, producing results which influenced\nSadi Carnot\n. Much of Poisson's work was motivated by results of\nLaplace\n, in particular his work on the relative velocity of sound and his work on attractive forces. This latter work was not only influenced by\nLaplace\n's work but also by the earlier contributions of\nIvory\n. Poisson's work on attractive forces was itself a major influence on\nGreen\n's major paper of\n1828\nalthough Poisson never seems to have discovered that\nGreen\nwas inspired by his formulations.\nIn\nRecherches sur la probabilité des jugements en matière criminelle et matière civile\nⓉ\n(\nResearch on the likelihood of judgments in criminal and civil matters\n)\n, an important work on\nprobability\npublished in\n1837\n, the Poisson distribution first appears. The Poisson distribution describes the probability that a random event will occur in a time or space interval under the conditions that the probability of the event occurring is very small, but the number of trials is very large so that the event actually occurs a few times. He also introduced the expression \"law of large numbers\". Although we now rate this work as of great importance, it found little favour at the time, the exception being in Russia where\nChebyshev\ndeveloped his ideas.\nIt is interesting that Poisson did not exhibit the chauvinistic attitude of many scientists of his day.\nLagrange\nand\nLaplace\nrecognised\nFermat\nas the inventor of the differential and integral calculus; he was French after all, while neither\nLeibniz\nnor\nNewton\nwere! Poisson, however, wrote in\n1831\n:-\nThis\n[\ndifferential and integral\n]\ncalculus consists in a collection of rules ... rather than in the use of infinitely small quantities ... and in this regard its creation does not predate\nLeibniz\n, the author of the algorithm and of the notation that has generally prevailed.\nHe published between\n300\nand\n400\nmathematical works in all. Despite this exceptionally large output, he worked on one topic at a time.\nLibri\nwrites\n[\n1\n]\n:-\nPoisson never wished to occupy himself with two things at the same time; when, in the course of his labours, a research project crossed his mind that did not form any immediate connection with what he was doing at the time, he contented himself with writing a few words in his little wallet. The persons to whom he used to communicate his scientific ideas know that as soon as he had finished one memoir, he passed without interruption to another subject, and that he customarily selected from his wallet the questions with which he should occupy himself. To foresee beforehand in this manner the problems that offer some chance of success, and to be able to wait before applying oneself to them, is to show proof of a mind both penetrating and methodical.\nPoisson's name is attached to a wide variety of ideas, for example:- Poisson's integral, Poisson's equation in potential theory, Poisson brackets in differential equations, Poisson's ratio in elasticity, and Poisson's constant in electricity. However, he was not highly regarded by other French mathematicians either during his lifetime or after his death. His reputation was guaranteed by the esteem that he was held in by foreign mathematicians who seemed more able than his own colleagues to recognise the importance of his ideas. Poisson himself was completely dedicated to mathematics.\nArago\nreported that Poisson frequently said:-\nLife is good for only two things, discovering mathematics and teaching mathematics.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}