{
  "nome_completo": "Simon Kirwan Donaldson",
  "nome_curto": "Simon Donaldson",
  "ano_nascimento": "1957",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Donaldson/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": null,
  "biografia": "Simon Donaldson\n's father was an engineer whose first career was in the navy. At about the time he married, he changed jobs to work in the Physiology Laboratory in the University of Cambridge. There he constructed apparatus for experiments which were aimed at understanding the nervous system. Simon's mother was brought up in Cambridge and graduated in Natural Sciences from the University of Cambridge but after marrying never had a career. Simon was one of his parents' four children, having an older brother, an older sister and a younger brother. Both his brothers became engineers.\nThe home in which Simon grew up was one in which people had projects. His father built model airplanes, saw about repairing things in the home and generally was busy working on some project. Simon said\n[\n8\n]\n:-\nI have an early memory of him saying with relish: \"... and then I shall be able to get back to research\"\n(\npresumably, after completing some chores which he had described to me\n)\n. I had no idea what \"research\" might be, but from that time the word was tinged with glamour and romance.\nIt was a home in which everyone was busy and active. His maternal grandfather also had a big influence on the children's education. He was a retired schoolmaster and took a great interest in the education of all four children, but perhaps Simon got a little more of his attention than the other three children.\nSimon attended a Preparatory School in Cambridge where his favourite subject was history. He saw his future education as progressing to an independent Cambridge Secondary School but this was not to be since when he was twelve year old the family moved to a new home near Sevenoaks, around\n30\nkm south of London. The move came about because his father left his job at the University of Cambridge, going with some others whom he had worked with there to a new research unit in London funded by the Medical Research Council. He was part of a team developing neurological implants. The move meant a change of school for Simon and so his secondary school education was at Sevenoaks School in Sevenoaks, Kent which he attended from\n1970\nto\n1975\n.\nThe Sevenoaks School was independent but, because there was no state grammar school in Sevenoaks, about half the pupils were funded by the state and half were private. This meant it had a much greater social mix than a normal independent school. At first Simon was not very happy at the school and it took him a few years to settle in. One thing that helped was his passion he had for designing yachts. He did not have a love of practical projects like the rest of his family, so his interest in yacht design was theoretical. This interest helped him fit into the school, since it had a sailing tradition. He read books to help him understand the theory behind the design of ships and these contained more mathematics than he had learnt at school. His father taught him some mathematical techniques and he began to study calculus well before it was taught at school.\nBy the age of fourteen he had given up designing yachts and was studying mathematics on his own from books that his maternal grandfather bought for him. He wanted to be a mathematician but had a backup plan to become an accountant. While at Sevenoaks School he won a scholarship to study mathematics and physics at Pembroke College, Cambridge which he entered in\n1976\n. There he studied analysis, topology and mathematical physics but the topic he liked most was geometry, although there was not much of that topic in the Cambridge syllabus. He was awarded his B.A. in\n1979\nand continued to study Part III of the tripos at Cambridge until\n1980\n. One of his tutors at Cambridge described him as a very good student but certainly not the top student in his year.\nFrank Adams\n, however, was very impressed with the work Donaldson did in his final examinations and wrote to him to congratulate him on his solutions.\nFrank Adams\nwas one of his referees for his application to study for a doctorate at Oxford.\nIn\n1980\nDonaldson began postgraduate work at Worcester College, Oxford, first under Nigel Hitchin's supervision. It was, however, the activity and culture that developed around\nMichael Atiyah\nand\nRoger Penrose\nthat he found most attractive. Hitchin suggested that he look at a conjecture that he and\nAtiyah\nhad proposed a couple of years earlier. Donaldson attacked the problem using both methods from partial differential equations and from topology. After a year Hitchin suggested that he changed to become\nAtiyah\n's student. He soon made a remarkable breakthrough.\nAtiyah\nwrites in\n[\n3\n]\n:-\nIn\n1982\n, when he was a second-year graduate student, Simon Donaldson proved a result that stunned the mathematical world.\nThis result was published by Donaldson in a paper\nSelf-dual connections and the topology of smooth\n4\n-manifolds\nwhich appeared in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1983\n.\nAtiyah\ncontinues his description of Donaldson's work\n[\n3\n]\n:-\nTogether with the important work of\nMichael Freedman\n..., Donaldson's result implied that there are \"exotic\"\n4\n-spaces, i.e.\n4\n-dimensional differentiable manifolds which are topologically but not differentiably equivalent to the standard Euclidean\n4\n-space\nR\n4\n\\mathbb{R}^{4}\nR\n4\n. What makes this result so surprising is that n =\n4\nis the only value for which such exotic n-spaces exist. These exotic\n4\n-spaces have the remarkable property that\n(\nunlike\nR\n4\n\\mathbb{R}^{4}\nR\n4\n)\nthey contain compact sets which cannot be contained inside any differentiably embedded\n3\n-sphere!\nAfter being awarded his doctorate from Oxford in\n1983\n, Donaldson was appointed a Junior Research Fellow at All Souls College, Oxford. He spent the academic year\n1983\n-\n84\nat the Institute for Advanced Study at Princeton. During this year he made a trip to the University of Maryland where he met Nora. She had been awarded a Bachelor of Arts degree from the Universidad del Valle in Colombia in\n1975\n, followed by a Master in Science degree from Virginia Tech in\n1981\n. When Donaldson met her at the University of Maryland she was studying for a Ph.D. in Mathematical Statistics. They married and have three children Andres, Jane and Nicholas. He also has a step-daughter Adriana. Nora was awarded a Ph.D. by the University of Maryland in\n1988\nfor the thesis\nA non-parametric estimation of the tumour onset time in a serial screening experiment\n.\nAfter returning to Oxford he continued to hold his Post-Doctoral Research Fellowship at All Souls College until\n1985\n. He became a Quondam Fellow of All Souls College in\n1985\nand, in that year, was appointed\nWallis\nProfessor of Mathematics at St Anne's College Oxford. He spent the year\n1997\n-\n8\nin Stanford before moving to Imperial College, London in\n1999\n. His wife Nora was appointed head of the Biostatistics Unit in the Research and Development Department at King's College Hospital in\n1999\n. He continues to work at Imperial College as Royal Society Research Professor, but since\n2014\nhe is also a permanent member of the Simons Center for Geometry and Physics at Stony Brook University in the United States. Nora Donaldson worked at King's College Hospital until\n2005\nwhen she joined the Dental Institute as a Reader in Biostatistics.\nDonaldson has received many honours for his work. He received the Junior\nWhitehead\nPrize from the\nLondon Mathematical Society\nin\n1985\n. In the following year he was elected a Fellow of the\nRoyal Society\nand, also in\n1986\n, he received a\nFields\nMedal at the International Congress of Mathematicians at Berkeley. He was presented with the medal by\nLars Ahlfors\n. Three years earlier he had delivered the talk\nGauge theory and topology\nat the Congress in Warsaw, and at the Berkeley Congress in\n1986\nhe gave the plenary address\nThe geometry of\n4\n-manifolds\n. We note also that in\n1998\nhe was the Vice-President of the\nInternational Mathematical Union\nand delivered the lecture\nLefschetz Fibrations in Symplectic Geometry\nto the\n1998\nInternational Congress of Mathematicians in Berlin. He was also a plenary lecturer at the International Congress of Mathematical Physics in\n1990\nand at the European Congress of Mathematicians in\n1992\n.\nIn\n1991\nDonaldson received the\nWilliam Hopkins\nPrize from the Cambridge Philosophical Society and, in the following year, the Royal Medal from the\nRoyal Society\n. He was awarded the\nLondon Mathematical Society\n's\nPolya\nprize in\n1999\nand some years later, the\n2006\nKing Faisal Prize. He also received the Crafoord Prize from the\nRoyal Swedish Academy of Sciences\nin\n1994\n[\n5\n]\n:-\n... for his fundamental investigations in four-dimensional geometry through application of instantons, in particular his discovery of new differential invariants ...\nAtiyah\ndescribes the contribution which led to Donaldson's award of a\nFields\nMedal in\n[\n3\n]\n. He sums up Donaldson's contribution:-\nWhen Donaldson produced his first few results on\n4\n-manifolds, the ideas were so new and foreign to geometers and topologists that they merely gazed in bewildered admiration. Slowly the message has gotten across and now Donaldson's ideas are beginning to be used by others in a variety of ways. ... Donaldson has opened up an entirely new area; unexpected and mysterious phenomena about the geometry of\n4\n-dimensions have been discovered. Moreover the methods are new and extremely subtle, using difficult nonlinear partial differential equations. On the other hand, this theory is firmly in the mainstream of mathematics, having intimate links with the past, incorporating ideas from theoretical physics, and tying in beautifully with algebraic geometry.\nThe article\n[\n7\n]\nis very interesting and provides both a collection of reminiscences by Donaldson on how he came to make his major discoveries while a graduate student at Oxford and also a survey of areas which he has worked on in recent years. Donaldson writes in\n[\n7\n]\nthat nearly all his work has come under the headings:-\n(1)\nDifferential geometry of holomorphic vector bundles.\n(2)\nApplications of gauge theory to\n4\n-manifold topology.\nand he relates his contribution to that of many others in the field.\nDonaldson's work in summed up by R Stern in\n[\n36\n]\n:-\nIn\n1982\nSimon Donaldson began a rich geometrical journey that is leading us to an exciting conclusion to this century. He has created an entirely new and exciting area of research through which much of mathematics passes and which continues to yield mysterious and unexpected phenomena about the topology and geometry of smooth\n4\n-manifolds.\nDonaldson was elected to the\nNational Academy of Sciences\nin\n2000\n. In February\n2006\nhe was awarded the King Faisal International Prize for science for\n[\n43\n]\n:-\n... seminal contributions to theories which have strengthened the links between mathematics and physics, and helped provide a rigorous foundation for physical theories giving a very good description of the laws of matter at the sub-nuclear level.\nIn April\n2008\n, he was awarded the Frederic Esser Nemmers Prize in Mathematics from Northwestern University. The Prize was given for his\n[\n44\n]\n:-\n... ground-breaking work in four-dimensional topology, symplectic geometry and gauge theory, and for his remarkable use of ideas from physics to advance pure mathematics.\nJohn Franks, the Chair of Mathematics at Northwestern University, gave more details of Donaldson's contributions which led to the award\n[\n44\n]\n:-\nDonaldson's breakthrough work developed new techniques in the geometry of four-manifolds and the study of their smooth structures. His methods have been described as extremely subtle, using difficult nonlinear partial differential equations. Using instantons, solutions to the equations of Yang-Mills gauge theory, he gained important insight into the structure of closed four-manifolds. Gauge theory techniques also enabled him to show the existence of four-manifolds with no smooth structure and others with infinitely many. His work has provided the seminal steps for the work of others in study of four-manifolds.\nIn\n2009\nDonaldson, together with Clifford H Taubes, was awarded the Shaw Prize in Mathematical Sciences. The Committee who made the award wrote that Donaldson and Taubes\n[\n45\n]\n:-\n... are the two geometers who have transformed the whole subject by pioneering techniques and ideas originating in theoretical physics, including quantum theory\n[\nand\n]\nhave totally changed our geometrical understanding of space and time.\nFor more information about this award, including further extracts from the citation for Donaldson, see\nTHIS LINK\n.\nDonaldson was knighted in\n2012\n, the same year that he was elected as a fellow of the\nAmerican Mathematical Society\n. His next major award was the Breakthrough Prize in Mathematics which he received in\n2015\n[\n26\n]\n:-\n... for the new revolutionary invariants of four-dimensional manifolds and for the study of the relation between stability in algebraic geometry and in global differential geometry, both for bundles and for Fano varieties.\nThe Breakthrough Prize was launched in\n2012\nto honour important, primarily recent, achievements in Fundamental Physics\n(\nfirst awards\n2012)\n, Life Sciences\n(\nfirst awards\n2013)\nand Mathematics\n(\nfirst awards\n2015)\n:-\n\"All is number,\" taught\nPythagoras\n. Though modern mathematics encompasses far more than numbers alone, the principle remains true. Mathematics is the universal language of nature. Mathematics is also fundamental to the growth of knowledge, as it is the scaffolding that supports all the sciences. Its relationship to physics is particularly intimate. From imaginary numbers to Hilbert spaces, what once seemed pure abstractions have turned out to underlie real physical processes. In addition, all fields in the life sciences today utilise the power of statistical and computational approaches to research. The mathematics prizes reward significant discoveries across the many branches of the subject. They were founded by Yuri Milner and are funded by grants from the foundations established by Yuri and Julia Milner.\nThe\n2015\nBreakthrough Prize ceremony was held on\n9\nNovember\n2014\nat NASA's Hangar\n1\nin Mountain View, California; this is the home of the\nKepler\nMission to find planets capable of supporting life. To launch the mathematics award, five winners were named each receiving $\n3\nmillion. All five recipients of the Prize agreed to serve on the Selection Committee, responsible for choosing subsequent winners of the prize from the pool of contenders nominated by the mathematics community. The\n2015\nceremony, with many actors and other celebrities present, was broadcast on several television channels.\nFor the full citation and Donaldson's response on receiving the award, see\nTHIS LINK\n.\nIn\n2019\nDonaldson was one of three collaborators who won the\nOswald Veblen\nPrize. The\n2019\nOswald Veblen\nPrize in Geometry was\n[\n1\n]\n:-\n... awarded to Xiuxiong Chen, Simon Donaldson - both of Stony Brook University - and Song Sun, University of California, Berkeley, for their three-part series, \"Kähler-Einstein metrics on Fano manifolds, I, II and III,\" published in\n2015\nin the Journal of the\nAmerican Mathematical Society\n, in which they proved a long-standing conjecture in differential geometry.\nDonaldson was a joint winner of the Wolf Prize in Mathematics in\n2020\nalong with Yakov Eliashberg\n[\n28\n]\n:-\n... for their contributions to differential geometry and topology.\nThe citation for Donaldson ends\n[\n28\n]\n:-\nProfessor Simon Donaldson is awarded the Wolf Prize for his leadership in geometry in the last\n35\nyears. His work has been a unique combination of novel ideas in global non-linear analysis, topology, algebraic geometry, and theoretical physics, following his fundamental work on\n4\n-manifolds and gauge theory. Especially remarkable is his recent work on symplectic and\nKähler\ngeometry.\nFor the full citation, see\nTHIS LINK\n.\nLet us end this biography by quoting Donaldson's own description of his contributions from his\nNational Academy of Sciences\nweb page\n[\n30\n]\n:-\nMy research interests lie in the area of mathematics bordering geometry, topology, and analysis and having substantial connections with mathematical physics. Much of my early work hinged on the application of the instanton solutions of the Yang-Mills equations - first introduced in particle physics - as tools to solve purely mathematical problems about the topology of four-dimensional manifolds. This has led to novel and wide-ranging results, not obtainable by other methods, that give a glimpse of the special nature of four-dimensional topology and geometry. More recently my work in this direction has focused on the special class of symplectic manifolds. I have shown that certain classical techniques from complex algebraic geometry can be adapted to this setting and am currently pursuing the implications of this for the classification of symplectic manifolds. Another theme running through my research is the study of certain partial differential equations arising in complex differential geometry. In the\n1980\ns I worked on equations related to holomorphic vector bundles and have recently been studying the application of similar ideas to\nKähler\nmetrics.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}