{
  "nome_completo": "Solomon Lefschetz",
  "nome_curto": "Solomon Lefschetz",
  "ano_nascimento": "1884",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lefschetz/",
  "lugar_nascimento": "Moscow, Russia",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Solomon Lefschetz\nwas a Russian born, Jewish mathematician who was the main source of the algebraic aspects of\ntopology\n. His father Alexander Lefschetz and his mother Vera were both Turkish citizens but since Alexander Lefschetz worked as an importer he was required to travel a great deal. As a consequence the family decided to make a base for themselves in France where their children could be educated. Shortly after Solomon was born his family set up home in Paris.\nSince Lefschetz was educated in France from a young age, French was his first language. He trained to be an engineer at the École Centrale in Paris from\n1902\nto\n1905\nand there attended lectures by\nÉmile Picard\nand\nPaul Appell\n. However, not being a French citizen he would have found great difficulty obtaining an academic post in France. Fully understanding this, in November\n1905\nat the age of\n21\n, Lefschetz went to the United States. For a few months he worked at the Baldwin Locomotive works, then from\n1907\nto\n1910\nhe worked for Westinghouse Electric Company in Pittsburgh. He had the misfortune to lose both his hands in a laboratory accident in November\n1907\nwhen they were burnt off in a transformer explosion. He also lost his forearms and spent a while in hospital.\nAs one might imagine this accident had a major mental impact on Lefschetz in addition to the physical disability he suffered. The result was a deep depression, but the tragedy eventually pushed him towards mathematics, which was the right subject for him and, of course, it was fortunate for topology that he found his true love of mathematics. After teaching mathematics to apprentices at the Westinghouse Electric Company in\n1910\n, he enrolled as a doctoral student in mathematics at Clark University in Worcester, Massachusetts, where he was a fellow from\n1910\nto\n1911\n. While on the graduate program at Clark, Lefschetz met one of the mathematics students Alice Berg Hayes. They married on\n3\nJuly\n1913\n, a year after he became an American citizen on\n17\nJune\n1912\n. Alice\n[\n1\n]\n:-\n... helped him to overcome his handicap, encouraging him in his work and moderating his combative ebullience. They had no children.\nLefschetz received his Ph.D. in mathematics in\n1911\nwith a thesis on\nalgebraic geometry\nentitled\nOn the existence of loci with given singularities\n.\nThat same year,\n1911\n, Lefschetz was appointed an instructor in mathematics at the University of Nebraska in Lincoln, then, two years later, he was appointed to the University of Kansas in Lawrence. There he was promoted to assistant professor in\n1916\n, to associate professor in\n1919\n, and full professor in\n1923\n. During these years he wrote a series of important papers on topology despite being out the mainstream of mathematical research. Lefschetz wrote of the importance of these years in his mathematical development:-\nMy years in the west with totally hermetic isolation played in my development the role of 'a job in a lighthouse' which\nEinstein\nwould have every young scientist assume so that he may develop his own ideas in his own way.\nHis most important results from this period are contained in\nOn certain numerical invariants of algebraic varieties with application to abelian varieties\n, which he had published in the\nTransactions of the American Mathematical Society\nin\n1921\n, and in his famous monograph of\n1924\nL'analysis situs et la géométrie algébrique\n. Lefschetz explained with his famous quote:-\nIt was my lot to plant the harpoon of\nalgebraic topology\ninto the body of the whale of algebraic geometry.\nHodge\nwrote\n(\nsee\n[\n10\n]\nor\n[\n11\n]\n)\n:-\nOur greatest debt to Lefschetz lies in the fact that he showed us that a study of topology was essential for all algebraic geometers.\nPoincaré\nhad studied curves on a surface but Lefschetz pushed the ideas into much more general settings by building a theory of subvarieties of an algebraic variety. For his remarkable contributions during this period he was awarded the Prix Bordin by the\nAcadémie des Sciences\nin Paris in\n1919\nand the\nBôcher\nMemorial Prize from the\nAmerican Mathematical Society\nin\n1923\nfor his\n1921\npaper we mentioned above.\nIn\nContinuous transformations of\nmanifolds\npublished in the\nProceedings of the U.S.\nNational Academy of Sciences\nin\n1923\nLefschetz announced that he had:-\n... new and far reaching methods...\nfor investigating continuous maps of manifolds and, in particular, their fixed points. He published his fixed point theorem for compact orientable manifolds in\n1923\n, giving a fuller account of his famous fixed point theorem in\nIntersections and transformations of complexes and manifolds\npublished in the\nTransactions of the American Mathematical Society\nin\n1926\n. In this paper he promised more than the:-\n... far reaching theory of the intersection of complexes on a manifold.\nHe wrote:-\nWith suitable restrictions the formulas derived are susceptible of extension to a wider range of manifolds, but this will be reserved for a later occasion.\nIn\n1927\nhe fulfilled his promise extending his fixed point theorems to manifolds with boundary, and by this stage\nBrouwer\n's fixed point theorem became a special case. This paper is more than an extension, however, for in it he used matrices, in particular the trace of a matrix, to greatly simplify the formulae he had presented in his\n1926\npaper. He did further work on fixed point theorems studying the case of any finite complex in\n1927\nand any locally connected space in\n1936\n.\nOn\nAlexander\n's recommendation, in\n1924\nLefschetz went to Princeton as a visiting professor for a year. At the end of his visit in\n1925\nhe was offered a permanent post at Princeton as associate professor which he happily accepted. He became Henry Fine Research Professor in\n1933\nfilling the position left vacant when\nVeblen\nmoved from Princeton University to the Institute for Advanced Study.\nSylvia Nasar writes\n[\n17\n]\n:-\nWhen he first came to Princeton in the\n1920\ns, he often said he was an \"invisible man\". He was one of the first Jews on the faculty, loud, rude, and badly dressed to boot. People pretended not to see him in the hallways and gave him a wide berth at faculty parties. But Lefschetz had overcome far more formidable obstacles in his life than a bunch of prissy Wasp snobs.\nLefschetz worked on results which provided a deep generalisation of\nÉmile Picard\n's theorems in function theory to several complex variables. Lefschetz was able to go further than\nÉmile Picard\nand incorporate\nPoincaré\n's ideas. In doing this he developed a theory of algebraic topology of algebraic varieties of higher dimension. The word 'topology' comes from the title of a monograph written by Lefschetz in\n1930\n. Another text which would have a huge influence on the development of the field was\nAlgebraic topology\nwhich was published in\n1942\n. In the course of his work he introduced many of what would be considered today the basic tools of algebraic topology\n[\n1\n]\n:-\nHe made extensive use of product spaces; he developed intersection theory, including the theory of the intersection ring of a manifold; and he made essential contributions to various kinds of homology theory, notably relative homology, singular homology, and\ncohomology\n.\nLefschetz had two artificial hands over which he always wore a shiny black glove. First thing every morning a graduate student had to push a piece of chalk into his hand and remove it at the end of the day. The students at Princeton made up a ditty about Lefschetz:-\nHere's to Lefschetz, Solomon L.\nIrrepressible as hell\nWhen he's at last beneath the sod\nHe'll then begin to heckle God.\nSaunders\nMac Lane\nhas added that:-\nIn my experience, Lefschetz was both obstreperous and enthusiastic - about research in mathematics.\nThe author of\n[\n2\n]\nwrites:-\nHis enthusiasm and commanding personality enabled him to influence greatly the work of many of his juniors, so that they came to reverence him as the founder of their careers.\nFor Lefschetz, independent thinking and originality were what mattered in mathematical research. Unlike most mathematicians he had no respect for elegance and if something was to him clearly true, he would consider it at best a waste of time producing a rigorous argument to verify it. When a student proudly showed him a clever argument that he had produced to give a short proof of one of Lefschetz's theorems, rather than compliment the student, he is claimed to have retorted:-\nDon't come to me with your pretty proofs. We don't bother with that baby stuff around here.\nEven if there is little truth in a joke which circulated about Lefschetz, namely that he never wrote a correct proof or stated an incorrect theorem, there is an underlying truth in it reflecting on his style of mathematics.\nSylvia Nasar gives this vivid description of the impact Lefschetz had on Princeton\n[\n17\n]\n:-\nEntrepreneurial and energetic, Lefschetz was the supercharged human locomotive that ... pulled the Princeton department out of genteel mediocrity right to the top. He recruited mathematicians with only one criterion in mind: research. His high-handed and idiosyncratic editorial policies made the Annals of Mathematics, Princeton's once-tired monthly, into the most revered mathematical journal in the world. He was sometimes accused of caving in to anti-Semitism for refusing to admit many Jewish students\n(\nhis rationale being that nobody would hire them when they completed their degrees\n)\n, but no one denies that he had brilliant snap judgement. He exhorted, bossed, and bullied, but with the aim of making the department great and turning his students into real mathematicians, tough like himself.\nHe was the editor of the\nAnnals of Mathematics\nfrom\n1928\nto\n1958\n, bringing it up to the standard of one of the very best world class journals.\nSteenrod\nwrote:-\nThe importance to American mathematicians of a first-class journal is that it sets high standards for them to aim at. In this somewhat indirect manner, Lefschetz profoundly affected the development of mathematics in the United States.\nLefschetz was a strong supporter of the\nAmerican Mathematical Society\nserving as its President from\n1935\nto\n1936\n.\nDuring World War II, Lefschetz undertook applied mathematical work directed at the war effort. At the same time he heard of work being undertaken in the Soviet Union on applications of modern mathematical tools to applied mathematical problems. In\n1944\nthese two influences inspired Lefschetz to return to his interest in engineering but now he had deep mathematical skills which he could bring to bear on the problems. He tackled problems related to dissipative nonlinear ordinary differential equations but did not take the usual approach of using linear theory to tackle nonlinear differential equations. Although initially his work was rather concrete, over the years it became more abstract as Lefschetz developed it further. In the end the ideas he developed became the foundation of a new branch of mathematics, namely global analysis.\nLefschetz had many students working in this area and, between\n1950\nand\n1960\n, a series of important publications\nContributions to the theory of nonlinear oscillations\nappeared in the\nAnnals of Mathematics Studies\n, published by Princeton University Press. From this work by Lefschetz's school, came the two important concepts of structural stability and genericity. Lefschetz did remarkable work even well into his\n80\n's. In his last book, he wrote on recent ideas outside his own area, namely the topology of\nFeynman\nintegrals.\nDuring the\n1920\ns and\n1930\ns Lefschetz was able to indulge his love of travel with many trips to European countries. In particular he loved to visit France, Italy and the Soviet Union. However the outbreak of World War II made European travel virtually impossible so Lefschetz had to find new places to visit. He chose Mexico, visiting the National University of Mexico for the first time in\n1944\n. It was the first of many visits and he eventually fell into the habit of spending the summer months there every year. His contribution to mathematics in Mexico was, as a result of these visits, of major importance and he helped build a flourishing school there. His contributions were recognised when he was awarded the Order of the Aztec Eagle in\n1964\n.\nThis was one of many honours which were awarded to Lefschetz. He received the Antonio Feltrinelli International Prize from the\nAccademia dei Lincei\nin\n1956\n. He was awarded honorary degrees from the universities of Paris, Prague, Mexico, Clark, Brown, and Princeton. In\n1964\nhe received the National Medal of Science:-\n... for indomitable leadership in developing mathematics and training mathematicians, for fundamental publications in algebraic geometry and topology, and for stimulating needed research in nonlinear control processes.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}