{
  "nome_completo": "Marius Sophus Lie",
  "nome_curto": "Sophus Lie",
  "ano_nascimento": "1842",
  "ano_morte": "1899",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lie/",
  "lugar_nascimento": "Nordfjordeide, Norway",
  "lugar_morte": "Kristiania (now Oslo), Norway",
  "biografia": "Sophus Lie\n's father was Johann Herman Lie, a Lutheran minister. His parents had six children and Sophus was the youngest of the six. Sophus first attended school in the town of Moss, which is a port in south-eastern Norway, on the eastern side of the Oslo Fjord. In\n1857\nhe entered Nissen's Private Latin School in Christiania\n(\nthe city which became Kristiania, then Oslo in\n1925)\n. While at this school he decided to take up a military career, but his eyesight was not sufficiently good so he gave up the idea and entered University of Christiania.\nAt university Lie studied a broad science course. There was certainly some mathematics in this course, and Lie attended lectures by\nLudwig Sylow\nin\n1862\n. Although not on the permanent staff,\nSylow\ntaught a course, substituting for\nBroch\n, in which he explained\nAbel\n's and\nGalois\n' work on algebraic equations. Lie also attended lectures by\nCarl Bjerknes\non mathematics, so he certainly had teachers of considerable quality, yet he graduated in\n1865\nwithout having shown any great ability for the subject, or any great liking for it.\nThere followed a period when Lie could not decide what subject to pursue and he taught pupils while trying to make his decision. The one thing he knew he wanted was an academic career and he thought for a while that astronomy might be the right topic. He learnt some mechanics, wondered whether botany or zoology or physics might be the right subjects and in general became rather confused. However, there are signs that from\n1866\nhe began to read more and more mathematics and the library records in the University of Christiania show clearly that his interests were steadily turning in that direction.\nIt was during the year\n1867\nthat Lie had his first brilliant new mathematical idea. It came to him in the middle of the night and, filled with excitement, he rushed to see his friend Ernst Motzfeldt, woke him up and shouted:-\nI have found it, it is quite simple!\nThis was not the end of Lie's problems of course\n(\nfar from it for Lie would always have problems\n)\n, but at least in his own mind he now knew the career he wanted and it would be fair to say that from that moment on Lie became a mathematician. The type of mathematics that Lie would study became more clearly defined during\n1868\nwhen he avidly read papers on geometry by\nPlücker\nand\nPoncelet\n.\nPlücker\n's\n[\n1\n]\n:-\n... monumental idea to create new geometries by choosing figures other than points - in fact straight lines - as elements of space pervaded all of Lie's work.\nLie wrote a short mathematical paper in\n1869\n, which he published at his own expense, based on the inspiration which had struck him in\n1867\n. He wrote up a more detailed exposition, but the world of mathematics was too cautious to quickly accept Lie's revolutionary notions. The\nAcademy of Science\nin Christiania was reluctant to publish his work, and at this stage Lie began to despair that he would become accepted in the mathematical world. His friend Motzfeldt did a superb job of encouraging Lie to press on with his mathematical ideas and the breakthrough came later in\n1869\nwhen\nCrelle's Journal\naccepted his paper. He sent letters to two Prussian mathematicians,\nReye\nand\nClebsch\n, still attempting to gain recognition for his ideas. The paper in\nCrelle's Journal\n, however, proved vital for, on the strength of the paper, Lie was awarded a scholarship to travel and meet the leading mathematicians.\nSetting off near the end of the year\n1869\n, Lie went to Prussia and visited Göttingen and then Berlin. In Berlin he met\nKronecker\n,\nKummer\nand\nWeierstrass\n. Lie was not attracted to the style of\nWeierstrass\n's mathematics which dominated Berlin. His interests fitted more closely with\nKummer\n, and Lie lectured on his own results in\nKummer\n's seminar and was able to correct some errors that\nKummer\nhad made in his work on line congruences of degree\n3\n. Most important to Lie, however, was the fact that in Berlin he met\nFelix Klein\n. It was easy to see that these two would instantly find common ground in mathematics since\nKlein\nhad been a student of\nPlücker\n, and Lie, although he never met\nPlücker\n, always said that he felt like\nPlücker\n's student. Despite the common link through\nPlücker\n's line geometry, Lie and\nKlein\nwere rather different in character as\nFreudenthal\npoints out in\n[\n1\n]\n:-\nLie and\nKlein\nhad quite different characters as humans and mathematicians: the algebraist\nKlein\nwas fascinated by the peculiarities of charming problems; the analyst Lie, parting from special cases, sought to understand a problem in its appropriate generalisation.\nIt was in Berlin that Lie developed a new self-confidence in his mathematical ability. He received high praise from\nKummer\n, and he received replies from\nReye\nand\nClebsch\nto his earlier letters which greatly encouraged him. Lie wrote to his friend Motzfeldt in Christiania saying\n(\nsee for example\n[\n34\n]\n)\n:-\n... in the years\n1864\n-\n68\n, I really underestimated my own mental power.\nIn the spring of\n1870\nLie and\nKlein\nwere together again in Paris. There they met\nDarboux\n,\nChasles\nand\nCamille Jordan\n.\nJordan\nseems to have succeeded in a way that\nSylow\ndid not, for\nJordan\nmade Lie realise how important\ngroup theory\nwas for the study of geometry. Lie started to develop ideas which would later appear in his work on transformation groups. He began to discuss with\nKlein\nthese new ideas on groups and geometry and he would collaborate later with\nKlein\nin publishing several papers. This joint work had as one of its outcomes\nKlein\n's characterisation of geometry in his\nErlangen Program\nof\n1872\nas properties invariant under a group action. While in Paris Lie discovered contact transformations. These transformations allowed a\n1\n-\n1\ncorrespondence between lines and spheres in such a way that\ntangent\nspheres correspond to intersecting lines.\nWhile Lie and\nKlein\nthought deeply about mathematics in Paris, the political situation between France and Prussia was deteriorating. The popularity of Napoleon III, the French emperor, was declining in France and he thought a war with Prussia might change his political fortunes since his advisers having told him that the French Army could defeat Prussia. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states. With both sides feeling that a war was to their advantage, the Franco-Prussian War became inevitable. On\n14\nJuly, Bismarck sent a telegram which infuriated the French government and on the\n19\nJuly France declared war on Prussia. For\nKlein\n, a Prussian citizen who happened to be in Paris when war was declared, there was only one possibility: he had to return quickly to Berlin.\nHowever, Lie was a Norwegian and he was finding mathematical discussions in Paris very stimulating. He decided to remain but became anxious as the German offensive met with only an ineffective French reply. In August, the German army trapped part of the French army in Metz and Lie decided it was time for him to leave and he planned to hike to Italy. He reached Fontainebleau but there he was arrested as a German spy, his mathematics notes being assumed to be top secret coded messages. Only after the intervention of\nDarboux\nwas Lie released from prison. The French army had surrendered on\n1\nSeptember, and on\n19\nSeptember the German army began to blockade Paris. Lie fled again to Italy, then from there he made his way back to Christiania via Germany so that he could meet and discuss mathematics with\nKlein\n.\nIn\n1871\nLie became an assistant at Christiania, having obtained a scholarship, and he also taught at Nissen's Private Latin School in Christiania where he had been a pupil himself. He submitted a dissertation\nOn a class of geometric transformations\n(\nwritten in Norwegian\n)\nfor his doctorate which was duly awarded in July\n1872\n. The dissertation contained ideas from his first results published in\nCrelle's Journal\nand also the work on contact transformations, a special case of these transformations being a transformation which maps a line into a sphere, which he had discovered while in Paris.\nIt was clear that Lie was a remarkable mathematician and the University of Christiania reacted in a very positive way, creating a chair for him in\n1872\n. The famous Norwegian mathematician\nAbel\nhad died more than\n40\nyears before this\n(\nsome\n14\nyears before Lie was born\n)\nbut, despite\nAbel\n's short career, his complete works had not been published at that time. It was natural that Norwegian mathematicians would undertake the task, and between\n1873\nand\n1881\nSylow\nand Lie prepared an edition of\nAbel\n's complete works. Lie, however, always claimed that most of the work was done by\nSylow\n. Another event which took place within two years of Lie being appointed to his chair was his marriage. He married Anna Birch and they would have three children, one daughter and two sons.\nLie had started examining\npartial differential equations\n, hoping that he could find a theory which was analogous to the\nGalois theory\nof equations. He wrote:-\n... the theory of\ndifferential equations\nis the most important discipline in modern mathematics.\nHe examined his contact transformations considering how they affected a process due to\nJacobi\nof generating further solutions of differential equations from a given one. This led to combining the transformations in a way that Lie called an\ninfinitesimal group\n, but which is not a group with our definition, rather what is today called a\nLie algebra\n. It was during the winter of\n1873\n-\n74\nthat Lie began to develop systematically what became his theory of continuous transformation groups, later called\nLie groups\nleaving behind his original intention of examining partial differential equations. Later\nKilling\nwas to examine the Lie algebras associated with Lie groups. He did this quite independently of Lie\n(\nand not it would appear in a manner which Lie found satisfactory\n)\n, and it was\nCartan\nwho completed the classification of semisimple Lie algebras in\n1900\n.\nAlthough Lie was producing highly innovative mathematics, he became increasingly sad at the lack of recognition he was receiving in the mathematical world. One reason was undoubtedly his isolation in Christiania, but a second reason was that his papers were not easily understood, partly through his style of writing and partly because his geometrical intuition greatly exceeded that of other mathematicians.\nKlein\n, realising the problems, had the excellent idea of sending Friedrich\nEngel\nto Christiania to help Lie.\nEngel\nhad received his doctorate from Leipzig in\n1883\nhaving studied under\nAdolph Mayer\nwriting a thesis on contact transformations.\nKlein\nrecognised that he was the right man to assist Lie and, at\nKlein\n's suggestion,\nEngel\nwent to work with Lie in Christiania starting in\n1884\n. He worked with Lie for nine months leaving in\n1885\n.\nEngel\nthen was appointed to Leipzig and, when\nKlein\nleft the chair at Leipzig in\n1886\n, Lie was appointed to succeed him. The collaboration between\nEngel\nand Lie continued for nine years culminating with their joint major publication\nTheorie der Transformationsgruppen\nin three volumes between\n1888\nand\n1893\n. This was Lie's major work on continuous groups of transformations.\nIn Leipzig, life for Lie was rather different from that in Christiania. He was now in the mainstream of mathematics and students came from many countries to study under him. He had a much heavier teaching load, however\n[\n38\n]\n:-\nLie's lectures on his own research were highly rated by the students, in contrast to his somewhat unpopular obligatory lectures on standard topics. ... he preferred to draw a picture instead of giving rigorous proofs.\nHowever all was not well, he still felt unrecognised and, as Svare writes in\n[\n38\n]\n:-\nIn Leipzig Lie was troubled by constant homesickness. A keen outdoor man, he missed the forests and mountains of Norway.\nTowards the end of the\n1880\ns Lie's relationship with\nEngel\nbroke down. In\n1892\nthe lifelong friendship between Lie and\nKlein\nbroke down and the following year Lie publicly attacked\nKlein\nsaying:-\nI am no pupil of\nKlein\n, nor is the opposite the case, although this might be closer to the truth.\nIt is difficult for any biographer to represent these events, and the events which followed, fairly since there is a great deal of contradictory material in the literature. The reason for this is not hard to understand, for information about Lie was for many years based on\n[\n13\n]\nwhich\nEngel\nwrote on Lie's death. The position is complicated by the mental difficulties which Lie suffered in\n1889\n.\nKlein\n's\n[\n34\n]\n:-\n... \"defence\" of Lie's behaviour by referring to the close relationship between genius and madness really created a generally accepted explanation which has survived up to the present. By this act of \"defence\"\nKlein\ndid his old friend an incredible injustice.\nThe truth is that Lie's behaviour was not totally irrational as it has been portrayed, but was indeed motivated by the way that both\nEngel\nand\nKlein\nhad behaved. Purkert in\n[\n26\n]\ndiscusses the breakdown of relations between Lie and\nEngel\n. He has studied material from the University of Leipzig and believes that Lie changed his attitude toward\nEngel\nbecause Lie still felt a lack of recognition yet he knew that he was in a different class as a creative mathematician to\nEngel\n. Lie returned to Christiania in\n1898\nto take up a post specially created for him. He produced a report about who should fill his chair, and this is given in full in\n[\n26\n]\n. Despite\nEngel\nbeing one of the leading workers in Lie's own research field, Purkert believes that Lie's assessment that he lacked creativity was entirely fair.\nIn\n[\n15\n]\nFritzsche comments on Lie's illness. He writes:-\nThrough information about Sophus Lie's illness it is possible to trace consequences that shed light on certain biographical aspects of his life; for example, his break with\nFriedrich Engel\nand\nFelix Klein\n. Furthermore, this evidence contradicts the oft-stated opinion that Lie's sickness was brought about by overwork.\nStraume in\n[\n34\n]\npoints out why Lie's behaviour towards\nKlein\n, with the final breakdown in\n1892\n, was not irrational:-\nKlein's 'Erlangen Program' from\n1872\nhad not attracted much attention; in fact, it was Lie rather than\nKlein\nhimself who had influenced the mathematical development envisioned in this Program. ...\nKlein\ndecided to republish the Program and also write about its origins\n(\nin which Lie was much involved\n)\n, but Lie disagreed strongly with\nKlein\n's views on what had happened in the past. It also turned out that\nKlein\nburned all the letters he had received from Lie up to\n1877\n(\nand thus breaking a previous mutual agreement between them\n)\n.\nLie reacted by publicly attacking\nKlein\nin the Preface to the third volume of his\nTheorie der Transformationsgruppen\nin\n1893\n. Certainly Lie was an angry man but he was attacking someone holding such a leading role on the world scene of mathematics that the attack was always more likely to rebound on Lie rather than hurt\nKlein\n. Already current research is showing Lie in a much better light over this affair\n(\nand therefore\nKlein\nin a less good one\n)\nthan previously reported and all the indications are that further research will prove even more favourable to Lie.\nPerhaps an indication of Lie's love for his homeland is the fact that he continued to hold his chair in Christiania from his first appointment in\n1872\n, being officially on leave while holding the chair in Leipzig. However his health was already deteriorating when he returned to a chair in Christiania in\n1898\n, and he died of pernicious anaemia in February\n1899\nsoon after taking up the post.\nLet us end by quoting from Robert Hermann's preface to\n[\n4\n]\n:-\nIn reading Lie's work in preparation for my commentary on these translations, I was overwhelmed by the richness and beauty of the geometric ideas flowing from Lie's work. Only a small part of this has been absorbed into mainstream mathematics. He thought and wrote in grandiose terms, in a style that has now gone out of fashion, and that would be censored by our scientific journals! The papers translated here and in the succeeding volumes of our translations present Lie in his wildest and greatest form.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}