{
  "nome_completo": "Marie-Sophie Germain",
  "nome_curto": "Sophie Germain",
  "ano_nascimento": "1776",
  "ano_morte": "1831",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Germain/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Marie-Sophie Germain\nwas the middle daughter of Ambroise-François Germain\n(1726\n-\n1821)\n, a prosperous merchant, goldsmith and jeweller who later became a silk-merchant, and Marie-Madeleine Gruguelu\n(\n?-\n1823)\nthe daughter of the goldsmith Jean Gruguelu who was a friend of philosophers and political economists. Ambroise-François was elected a deputy to the National Assembly in\n1789\nand later became a director of the Bank of France. Sophie's elder sister was Marie-Madeleine Germain\n(\nborn\n29\nMay\n1770)\nand her younger sister was Angélique-Ambroise Germain\n(\nborn\n1779)\n. Marie-Madeleine Germain married the notary Charles Lherbette\n(1752\n-\n1836)\nin\n1790\nand they had one son Amand-Jacques Lherbette\n(1791\n-\n1864)\nwho became a lawyer, sportsman and politician. Angélique-Ambroise Germain married the doctor Rene-Claude Geoffroy\n(1767\n-\n1831)\nin\n1809\nand, after his death in\n1831\n, she married another medical man Joachim-Henri Dutochet\n(1776\n-\n1847)\n, a leading botanist and physiologist, in\n1833\n. We have given some details of Sophie's sisters because she did not marry and, as a consequence, her sisters and their families played a large part in her life.\nSophie's home at\n336\nrue St Denis, where she was born, was a meeting place for those interested in liberal reforms and she was exposed to political and philosophical discussions during her early years. The year\n1789\nsaw the outbreak of the French Revolution when in May of that year France became a constitutional monarchy followed by the storming of the Bastille on\n14\nJuly. Sophie's father was elected a deputy of the Third Estate for the city of Paris, then the National Assembly, and became very involved in the political events. Sophie was thirteen years old at this time and up until then she had been educated at home. With Paris in chaos and normal life suspended, she decided that she would go to her father's library, which was extensive, and pass the time reading books.\nSophie, thirteen years old when the Revolution broke out, looked through her father's books, coming across\nÉtienne Montucla\n's\nHistoire des Mathématiques\nⓉ\n(\nHistory of mathematics\n)\n.  She read\nMontucla\n's account of\nArchimedes\n' passion for mathematics:-\n[\nArchimedes\n]\nwould forget to eat and drink. His servant would have to remember his meal times for him and would almost have to force him to satisfy these human needs.\nShe read about\nArchimedes\n' death at the hands of a Roman soldier because he would not stop doing mathematics. She was moved by this story and decided that she too must become a mathematician. Here was something which would let her become so involved that she would escape from the chaos of the Revolution going on around her. She told her parents she wanted to become a mathematician but they were totally opposed to her ideas, telling her that it was no occupation for a girl.\nSophie pursued her studies in her father's library, however, beginning with reading the first volume of\nÉtienne Bézout\n's\nCours complet de mathématiques à l'usage de la marine et de l'artillerie\nⓉ\n(\nComplete course in mathematics for use in the navy and artillery\n)\n(1770)\nwhich covered arithmetic. She came across a book by Jacques Antoine-Joseph Cousin\n(1739\n-\n1800)\non the calculus, namely\nLeçons de calcul différentiel et de calcul intégral\nⓉ\n(\nLessons on differential and integral calculus\n)\n(1777)\n, which she found fascinating. In order to move on to reading more advanced texts on calculus, she taught herself Latin and Greek. She read\nNewton\nand\nEuler\nat night while wrapped in blankets as her parents slept - they had taken away her fire, her light and her clothes in an attempt to force her away from her books. Eventually her parents lessened their opposition to her studies, after waking up one morning, seeing Sophie was not in her bed, and finding her asleep in the library which was so cold that the ink had frozen solid in the ink well. Although Germain neither married nor obtained a professional position, her father continued to support her financially throughout her life. She continued to study the differential and integral calculus over the following years with the horrific events around her during the Reign of Terror in\n1793\n-\n94\nonly helping her concentrate on her studies.\nThe École Centrale des Travaux Publics was founded in\n1794\nby\nLazare Carnot\nand\nGaspard Monge\n. In the following year it was renamed the École Polytechnique. Sophie Germain was eighteen years old when the École opened and at exactly the right age to begin a university education. There was no way, however, a girl could become a student. This did not stop Germain who obtained lecture notes for many courses from École Polytechnique including Antoine-François Fourcroy's chemistry course and\nJoseph-Louis Lagrange\n's analysis course. At the end of\nLagrange\n's lecture course he invited his students to send him their written observations. Using the pseudonym M LeBlanc, Germain submitted a paper whose originality and insight made\nLagrange\nlook for its author. We note that the pseudonym \"M LeBlanc\" was not a made-up name but rather it was the name of the student Antoine-August LeBlanc who had attended the École. He was not very gifted mathematically and had quickly given up his studies at the École Polytechnique.\nWhen\nLagrange\ndiscovered \"M LeBlanc\" who had submitted a paper to him was a woman, his respect for her work remained and he became her sponsor and mathematical counsellor. Her education was, however, disorganised and haphazard and she never received the professional training which she wanted.\nLagrange\ncertainly made his colleagues aware that Germain was a girl with mathematical talent and several of them wrote to her.\nMonge\n, for example, wrote to her about problems associated with a lever when infinitesimal changes in the position of a weight occur. Others discussed certain mathematical paradoxes with her. There was, however, no attempt to provide structured learning although Jacques Antoine-Joseph Cousin did offer to meet with her. It is worth noting that, since Germain was an unmarried woman, there were social difficulties in her meeting with men.\nNot everyone treated her with the respect she felt she deserved. One case was\nJérôme Lalande\nwho visited Germain in\n1797\n. She started to talk to him about\nLaplace\n's\nExposition du système du monde\nⓉ\n(\nExplanation of the system of the world\n)\nwhich had only been published in the previous year.\nLalande\ntold her that she should not be reading such works, rather she should be reading the second edition of his book\nAstronomie des dames\nⓉ\n(\nAstronomy for ladies\n)\n(1795)\n. This \"astronomy for ladies\" does not contain a single mathematical equation and Germain felt insulted by his suggestion.\nLalande\nsent her a letter of apology on\n4\nNovember\n1797\nbut she never forgave him.\nAnother who offended her was the Hellenist, Anase de Villoisson. He did this by praising her in a poem he had written and we know how displeased she was from Villoisson's letter of apology written to her on\n14\nJuly\n1802\n(\nsee\n[\n35\n]\n)\n:-\nMademoiselle:\nI dare to take the liberty to offer you, adjoined to this, a sample of the new edition of my unfortunate work with corrections and additions which I have told you about. M Paugens, Mademoiselle, had inserted it in the third issue of his 'Bibliothèque Française' before I became suspicious that the homage of the truth would shock your modesty, which is as rare as your talent. I repeat with my excuses and lively and eternal regret on my word of honour that I should never have permitted myself to speak of you, Mademoiselle, in writing, and that my admiration will always be silent and enchained by the desire to obtain pardon for an error, or for an involuntary fault, and by the deep respect which I have vowed to your mother and sister. I have the honour to be, Mademoiselle,\nYour humble and obedient servant,\nAnase de Villoisson.\nGermain wrote to\nLegendre\nabout problems suggested by his\n1798\nEssai sur le Théorie des Nombres\nⓉ\n(\nEssay on the theory of numbers\n)\n, and the subsequent correspondence between the two became virtually a collaboration.\nLegendre\nincluded some of her discoveries in a supplement to the second edition of the\nThéorie\n. Several of her letters were later published in her\nOeuvres Philosophique de Sophie Germain\nⓉ\n(\nPhilosophical works of Sophie Germain\n)\n.\nHowever, Germain's most famous correspondence was with\nGauss\n. She had developed a thorough understanding of the methods presented in his\n1801\nDisquisitiones Arithmeticae\nⓉ\n(\nInvestigations in arithmetic\n)\n. Between\n1804\nand\n1809\nshe wrote a dozen letters to him, initially adopting again the pseudonym \"M LeBlanc\" because she feared being ignored because she was a woman. After receiving her first letter,\nGauss\nwrote to the astronomer Heinrich Wilhelm Matthias Olbers\n(1758\n-\n1840)\n(\nsee, for example,\n[\n7\n]\n)\n:-\nI recently had the pleasure of receiving a letter from LeBlanc, a young mathematician in Paris, who made himself enthusiastically familiar with higher mathematics and showed how deeply he penetrated into my 'Disquisitiones Arithmeticae'.\nDuring their correspondence,\nGauss\ngave her\nnumber theory\nproofs high praise, an evaluation he repeated in letters to his colleagues. Germain's true identity was revealed to\nGauss\nonly after the\n1806\nFrench occupation of his hometown of Braunschweig. Recalling\nArchimedes\n' fate and fearing for\nGauss\n's safety, she contacted a French general who was a friend of her family.\nGauss\nknew neither the general nor Sophie Germain and, after he made enquiries, she was forced to reveal her identity, writing to him\n[\n4\n]\n:-\nI am not as completely unknown to you as you might believe, but that fearing the ridicule attached to a female scientist, I have previously taken the name of M LeBlanc in communicating to you. ... I hope that the information that I have today confided to you will not deprive me of the honour you have accorded me under a borrowed name ...\nWhen\nGauss\nreceived this letter, he gave her even more praise. He writes:-\nBut how to describe to you my admiration and astonishment at seeing my esteemed correspondent M LeBlanc metamorphose himself into this illustrious personage\n[\nSophie Germain\n]\nwho gives such a brilliant example of what I would find it difficult to believe. A taste for the abstract sciences in general and above all the mysteries of numbers is excessively rare; one is astonished at it; the enchanting charms of this sublime science reveal themselves only to those who have the courage to go deeply into it ... Indeed nothing could prove to me in so flattering and less equivocal manner that the attractions of this science, which has enriched my life with so many joys, are not chimerical, as the predilection with which you have honoured it.\nWe mentioned above that Sophie's younger sister Angélique-Ambroise Germain married the doctor Rene-Claude Geoffroy in\n1809\n. He had a fine town house at\n4\nRue du Braque in Paris and, some time after the marriage, the whole Germain family moved into that home. Let us also note that Sophie became close to her nephew, Amand-Jacques Lherbette, the son of her elder sister. She named Lherbette as her literary executor, and indeed after her death he would publish some of her unfinished work.\nIn\n1808\n, the German physicist Ernst Florens Friedrich Chladni\n(1756\n-\n1827)\nhad visited Paris where he had conducted experiments on vibrating plates, exhibiting the so-called Chladni figures.\nYou can see some Chladni figures at\nTHIS LINK\n.\nThe Institut de France set a prize competition with the following challenge:-\n... formulate a mathematical theory of elastic surfaces and indicate just how it agrees with empirical evidence.\nA deadline of two years for all entries was set.\nMost mathematicians did not attempt to solve the problem, because\nLagrange\nhad said that the mathematical methods available were inadequate to solve it. Germain, however, spent the next decade attempting to derive a theory of elasticity, competing and collaborating with some of the most eminent mathematicians and physicists.\nIn fact, Germain was the only entrant in the contest in\n1811\n, but her work did not win the award. She had not derived her hypothesis from principles of physics, nor could she have done so at the time because she had not had training in analysis and the\ncalculus of variations\n. Her work did spark new insights, however.\nLagrange\n, who was one of the judges in the contest, corrected the errors in Germain's calculations and came up with an equation that he believed might describe Chladni's patterns.\nThe contest deadline was extended by two years, and again Germain submitted the only entry. She demonstrated that\nLagrange\n's equation did yield Chladni's patterns in several cases, but could not give a satisfactory derivation of\nLagrange\n's equation from physical principles. For this work she received an honourable mention.\nGermain's third attempt in the re-opened contest of\n1815\nwas deemed worthy of the prize of a medal of one kilogram of gold, although deficiencies in its mathematical rigour remained. To public disappointment, she did not appear as anticipated at the award ceremony. Though this was the high point in her scientific career, it has been suggested that\n[\n4\n]\n:-\n... she thought the judges did not fully appreciate her work ...\nand that\n... the scientific community did not show the respect that seemed due to her.\nCertainly\nPoisson\n, her chief rival on the subject of elasticity and also a judge of the contest, sent a laconic and formal acknowledgement of her work, avoided any serious discussion with her and ignored her in public.\nAs one biographer phrases it:-\nAlthough it was Germain who first attempted to solve a difficult problem, when others of more training, ability and contact built upon her work, and elasticity became an important scientific topic, she was closed out. Women were simply not taken seriously.\nGermain attempted to extend her research, in a paper submitted in\n1825\nto a commission of the Institut de France, whose members included\nPoisson\n,\nGaspard de Prony\nand\nLaplace\n. The work suffered from a number of deficiencies, but rather than reporting them to the author, the commission simply ignored the paper. It was recovered from\nde Prony\n's papers and published in\n1880\n.\nAmong her work done during this period is work on\nFermat's Last Theorem\nand a theorem which has become known as Germain's Theorem. This was to remain the most important result related to\nFermat\n's Last Theorem from\n1738\nuntil the contributions of\nKummer\nin\n1840\n. She wrote to\nGauss\non\n12\nMay\n1819\n[\n4\n]\n:-\nAlthough I have laboured for some time on the theory of vibrating surfaces\n(\nto which I have much to add if I had the satisfaction of making some experiments on cylindrical surfaces I have in mind\n)\n, I have never ceased to think of the theory of numbers. ... A long time before our\nAcademy\nproposed as the subject of a prize the proof of the impossibility of\nFermat\n's equation, this challenge ... has often tormented me.\nLarry Riddle writes in\n[\n30\n]\n:-\nIn this letter she laid out her grand plan to prove\nFermat\n's Last Theorem. Her goal was to prove that for each odd prime exponent\np\np\np\n, there are an infinite number of auxiliary primes of the form\n2\nN\np\n+\n1\n2Np + 1\n2\nN\np\n+\n1\nsuch that the set of non-zero\np\np\np\nth power residues\nx\np\nm\no\nd\n \n \n(\n2\nN\np\n+\n1\n)\nx^{p} \\mod (2Np + 1)\nx\np\nm\no\nd\n(\n2\nN\np\n+\n1\n)\ndoes not contain any consecutive integers. If there were a solution to\nx\np\n+\ny\np\n=\nz\np\nx^{p} + y^{p} = z^{p}\nx\np\n+\ny\np\n=\nz\np\n, then Germain observes that any such auxiliary prime would have to necessarily divide one of the numbers\nx\n,\ny\nx, y\nx\n,\ny\n, or\nz\nz\nz\n. Her letter and manuscripts found in various libraries showed her analysis for the primes\np\np\np\nless than\n100\nand for auxiliary primes with\nN\nN\nN\nfrom\n1\nto\n10\n.  ... However, as Germain admitted to\nGauss\n, she was unable to establish the existence of an infinite number of auxiliary primes even for a single prime exponent. Indeed, Germain's grand plan was doomed to failure as it was later shown that for each odd prime\np\np\np\nthere are only a finite number of auxiliary primes that satisfy the non-consecutive\np\np\np\nth power residue condition. Germain, herself, eventually proved in a letter to\nAdrien-Marie Legendre\nthat for\np\n=\n3\np = 3\np\n=\n3\n, the auxiliary primes\n7\nand\n13\nwere the only ones that worked. Nevertheless, this was the first time anyone had devised a plan to prove\nFermat\n's Last Theorem for infinitely many prime exponents rather than on a case by case basis.\nAndrea Del Centina re-evaluates Germain's work on\nFermat\n's Last Theorem in\n[\n18\n]\nand concludes:-\nA revaluation of Germain's work on\nFermat\n's Last Theorem is necessary. Not only did she develop the theorem attributed to her independently from\nLegendre\n, in fact she did part of the additional work commonly credited to him, but she also proved\n(\nor nearly proved\n)\nresults that were rediscovered many years later. After almost\n200\nyears, her ideas were still central. In\n1985\n, using a generalisation of her method, Adleman and Heath-Brown\n[\nThe first case of\nFermat\n's last theorem,\n1985]\nand, independently, Fouvry\n[\nThéorème de Brun-Titchmarsh. Application au théorème de Fermat\nⓉ\n(\nThe Brun-Titchmarsh theorem: Application to Fermat's theorem\n)\n,\n1985]\n, proved that the first case of\nFermat\n's Last Theorem holds for infinitely many exponents.\nGermain continued to work in mathematics and philosophy until her death. Before her death, she outlined a philosophical essay which was published posthumously as\nConsidérations générales sur l'état des sciences et des lettres\nⓉ\n(\nGeneral Comments on the State of Science and Letters\n)\nin the\nOeuvres philosophiques\n. Her paper was highly praised by August Comte. Amy Dahan Dalmédico writes in\n[\n16\n]\n:-\nIn the essay, she tried to identify the intellectual process in all human activities. She believed the intellectual universe is filled with analogies. The human spirit recognises these analogies, which then leads to the discovery of natural phenomena and the laws of the universe. We should recognise the analogies between the life of Sophie Germain and our own, and they should lead us to strive for excellence in the face of prejudice.\nIn\n[\n21\n]\nJesse A Fernandez Martinez notes how Germain anticipated August Comte:-\nComte's indebtedness to\nCondorcet\nand to Saint-Simon has frequently been mentioned. It is only recently that it has been discovered how distinctly he was anticipated in the main features of his system by Sophie Germain. Dühring, in his Critical History of Philosophy from Its Beginnings to the Present Time\n(3\nrd ed., Leipzig,\n1878)\n, says, after giving a full abstract of her work: \"One sees from the above that the Positivism which, without the use of the word, one finds in the writings of Sophie Germain, contains the essential features of that which has hitherto been associated with the name of Auguste Comte.\"\nShe was stricken with breast cancer in\n1829\nbut, undeterred by that and the fighting of the\n1830\nrevolution, she completed papers on number theory and on the curvature of surfaces\n(1831)\n.\nGermain died in June\n1831\nat\n13\nrue de Savoie in Paris, which still stands today and has a commemorative plaque. Her death certificate listed her not as mathematician or scientist, but 'rentier'\n(\nproperty holder\n)\n. In\n[\n35\n]\nthe author quotes from H J Monans,\nWoman in Science\n(1913)\n:-\nAnd yet, strange as it may seem, when the state official came to make out the death certificate of this eminent associate and co-worker of the most illustrious members of the\nFrench Academy of Science\n, he designated her as a rentiere-annuitant - not as a mathematicienne. Nor is this all. When the Eiffel Tower was erected in which the engineers were obliged to give special attention to the elasticity of the materials used, there were inscribed on this lofty structure the names of seventy-two savants. But one will not find in this list the name of that daughter of genius, whose researches contributed so much toward establishing the theory of the elasticity of metals, Sophie Germain. Was she excluded from this list for the same reason that Agnesi was ineligible in the\nFrench Academy\n- because she was a woman? It would seem so. If such, indeed, was the case, more is the shame for those who were responsible for such ingratitude toward one who had deserved so well of science, and who by her achievements had won the enviable place in the hall of fame.\nGermain was buried at the Cimetière du Père Lachaise.\nYou can see a picture of her grave  at\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}