{
  "nome_completo": "Stanisław Sławomir Świerczkowski",
  "nome_curto": "Stanisław Świerczkowski",
  "ano_nascimento": "1932",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Swierczkowski/",
  "lugar_nascimento": "Toruń, Poland",
  "lugar_morte": "New Town, Tasmania, Australia",
  "biografia": "Stanisław Świerczkowski\nwas born into a well-to-do Polish family in Toruń, northern Poland, the birthplace of\nNicolaus Copernicus\n. His father Antoni Świerczkowski belonged to the Polish nobility. His mother was of Austro-Hungarian origin and was headmistress of a school for the German-speaking minority in Toruń, a circumstance which saved her life when Germany invaded Poland in\n1939\n. Świerczkowski's parents divorced when he was very young; he was brought up by his mother and was an only child, although he had a half-brother by his father's second marriage. This second marriage was short-lived. Antoni, having fought in the Polish-Soviet war of\n1919\n-\n1921\n, was a reserve officer and re-enlisted in\n1939\n. He was captured in the Soviet invasion of Poland in September\n1939\nand subsequently murdered in May\n1940\nin the notorious Katyń massacre.\nAlthough Świerczkowski's mother's German connections helped her retain something of a normal life under German occupation they counted against her when the Soviets took control in\n1945\n. Until\n1948\n, when she was formally exonerated of her wartime citizenship status, she lived in seclusion in the countryside. Stanisław remained with her until, at the age of fifteen, he was able to take rented accommodation alone in Toruń and resume his schooling.\nOf his early mathematics education Świerczkowski comments\n[\n1\n]\n\"In geometry I did well enough to deserve praise from the teacher. Did those two years of roaming the countryside, of hiking in forests and of climbing trees provide me with enough experience of distances, angles and shapes to solve problems in geometry?\" His school record was good enough to allow him to sit for university entrance and he succeeded in gaining a place to study astronomy at the newly-founded University of Wrocław.\nAstronomy was not to be Świerczkowski's calling, however. Although the discipline was congenial, its methods were not! He writes\n[\n1\n]\n: \"Mathematically the work was simple. However, it required prolonged calculations to determine rows of coordinates. And I was always hopeless at calculations!\" Luckily after two years he was able to transfer his state scholarship to the study of mathematics. Thereby he found an inspirational mentor in fellow student Jan Mycielski\n(\nsubsequently an eminent mathematician\n)\nwith whom he discovered a latent gift for mathematical research. His first significant original work was the discovery of a new proof of\nEdward Titchmarsh\n's\n1926\nconvolution theorem whilst studying for his MSc under\nJan Mikusiński\n.\nHugo Steinhaus\nwas instrumental in developing mathematics at University of Wrocław and one of his questions led to Świerczkowski's best-known result, the three-distance\n(\nor three-gap\n)\ntheorem. Suppose that an irrational number α is chosen in the unit interval and the first\nN\nN\nN\nnonnegative integer multiples of α are plotted as points around a circle of unit circumference. Then the set of distances between successive points has cardinality at most three. The theorem belongs to the field of diophantine approximation, since the distances take the form\np\nα\n−\nq\np\\alpha - q\np\nα\n−\nq\nfor integers\np\np\np\nand\nq\nq\nq\n, whence large\nN\nN\nN\ngives\np\\alpha - q &\\#8776; 0\n.\nSteinhaus\n's question was also answered by Vera Sós but it appears likely that Świerczkowski deserves priority. He writes\n[\n2\n]\n:-\nThe Three Distances Theorem was conjectured by\nHugo Steinhaus\n. When I gave him the proof, he checked it and asked me to write a report for the\nAcademy of Sciences\n. He presented this report to the Academy\n(\nonly members could do that\n)\nwhereupon it was published in the Bulletin de L'Academie Polonaise des Sciences, Cl. III Vol. IV, No.\n9\n,\n1956\n... About that time Vera Sós and her husband Prof.\nTurán\nvisited our University, so they certainly heard about the Three Distances result directly from my colleagues or from me. Of course,\nErdős\nwas also visiting us many times. I remember Vera quite well.\nIn the announcement in the Bulletin de L'Academie Polonaise des Sciences mentioned above, there are four related theorems, and I postponed publishing the proofs of these to a later paper. By the time I wrote it, Vera Sós published her proof of the Three Distances Theorem, so I found it simpler to just refer to her paper. My proof\n(\nwhich I do not recall\n)\nalmost certainly found its way into my Ph.D. thesis on the subject of cyclically ordered groups. This dissertation was submitted to the\nPolish Academy of Sciences\n. A recent inquiry disclosed that they cannot find it.\nAnother\nSteinhaus\nquestion solved by Świerczkowski around the same time deserves mention: except for the tetrahedron, copies of a chosen Platonic solid may be placed face to face in three-space so as to form a closed, non-intersecting chain, the last copy meeting the first in a face.\nSteinhaus\nasked if such a chain could exist for the tetrahedron and Świerczkowski answered this elegantly in the negative by showing that the relevant\n3\n×\n3\nrotation matrices form a free group: identity products, corresponding to closed chains, are necessarily absent.\nFollowing his doctoral studies Świerczkowski was able to win a British Council scholarship to study in the United Kingdom, in part because his war-time 'German' schooling had included a thorough grounding in English. Thus in\n1957\nhe joined the University of Dundee\n(\nthen Queen's College, part of the University of St Andrews\n)\nunder the mentorship of\nMurray Macbeath\nwith whom he worked on questions in group theory. Jack Cole, who was at Queen's College at the time, also collaborated with Świerczkowski on group theory. At this time another Wrocław postgraduate, Andrzej Hulanicki, was also in the United Kingdom on a British Council scholarship, attached to Manchester University and Świerczkowski collaborated with him on the theory of algebras. In all, Świerczkowski's first visit to Scotland lasted three years, the academic year\n1959\n/\n60\nbeing spent at Glasgow University. This was a productive time. In between indulging his passion for rock climbing, he published something like twenty five papers!\nŚwierczkowski was obliged to return to Poland at the end of his British Council scholarship in\n1960\nbut had no intention of staying. In\n1961\n, unaware that the authorities in Wrocław had refused him permission to travel, the\nPolish Academy of Sciences\nissued him with a passport to attend a conference in Germany. There he rendezvoused with his future wife Jeanette, whom he had met in Scotland, and they returned together to Glasgow. Świerczkowski was able to resume lecturing at the University. He recalls\n[\n1\n]\n: \"I called the Mathematics Department from the Glasgow Central Station, \"Can you employ me?\"  \"Yes,\" they said, \"just come along\". He taught at Glasgow for two years, during which time he had married Jeanette and acquired a son, Mark. But he felt a move to England would provide a more diverse mathematical milieu and accordingly applied, successfully, for a job at the University of Sussex, one of England's new so-called 'plate-glass' universities.\nThe founding professor of mathematics at Sussex was the algebraic geometer Bernard Scott. In\n1962\nthere were just five members of staff; one of these was\nWalter Ledermann\nwho recalls\n[\n3\n]\n: \"all three Lecturers were specialists in Hydrodynamics, a subject initially not in our syllabus.\" Perhaps this influenced the teaching at Sussex or perhaps Świerczkowski is reporting a more widespread phenomenon when he writes\n[\n1\n]\n:-\nIn those days the teaching of mathematics in the UK was very different from that in Poland. In the UK, students were taught to be well versed in solving problems close to the applications of mathematics, like physics or engineering. By contrast, in Poland a more theoretical, abstract approach was favoured. Young minds were trained in abstract thought as early as possible, and mostly set theory was used for this purpose. This reflected the view, currently held by most logicians and mathematicians, that all of mathematics can be described by set theory.\nAt all events he was inspired to write his only book in mathematics: an introductory text on\nSets and Numbers\n. This would have been innovative if published at the time but the manuscript was lost due to the separation, in\n1965\n, of Świerczkowski and his wife Jeanette. Eventually it resurfaced and was published by Routledge & Kegan Paul in\n1972\n.\nMeanwhile Świerczkowski's work with\nMurray Macbeath\nat Dundee had led to an invitation from\nAndré Weil\nto spend the year\n1965\n/\n66\nat the Institute of Advanced Studies at Princeton. Thereafter\nEdwin Hewitt\ninvited him for a year to the University of Washington at Seattle. His time in the United States was productive. In particular he collaborated at a distance with the Dutch algebraist Willem Titus van Est. However, he appears at this time to have lost confidence in his mathematical training\n[\n1\n]\n:-\nI tell\n[\nWeil\n]\nthat my knowledge of his field is very small, because I have been mainly a \"problem solver\", and I studied only as much of any theory as was needed to solve any particular problem. He finds nothing wrong with this approach.\nDuring my stay at the Institute I become painfully aware of my lack of specialization. There are research seminars going on, and I am supposed to attend some, but I do not want to waste my time sitting in meetings where I understand next to nothing.\nŚwierczkowski felt the same professional discomfort at the University of Washington. He continued to produce good mathematics during his stay in the United States but his time there would mark the end of his traditional academic career. He broke his return to England with a visit to the Australian National University at Canberra where his brother in law\nLászló Kovács\n, was a fellow in the recently formed Department of Mathematics in the Research School of Physical Science. There he met his future second wife, Helen. He writes \"She is a devoted botanist, and I admire her dedication. By contrast, my interest in spending the rest of my life in offices, classrooms or libraries is rapidly dwindling.\" Although he returned to Sussex University in\n1967\nand was promoted to Senior Lecturer, he lost no time in arranging a three year research visit to ANU, resigning his post and leaving England for good.\nŚwierczkowski could perhaps have been happy at ANU. The group theorists\nBernhard Neumann\nand\nHanna Neumann\nwere there and\nKovács\nwas a problem-solver like him. But he divided his time between rock climbing in Australia, New Zealand and Papua New Guinea, and solitary research which he describes as\n[\n1\n]\n\"changing rough descriptions of proofs sent to me by van Est from Holland into publishable material. I don't work in my office but rather inside my Land Rover, where I have installed a comfortable desk. On these occasions, I park the car in the surrounding of beautiful landscapes.\" At the end of his research appointment at ANU he applied for a lectureship but records\n[\n1\n]\n\"\nHanna Neumann\n, knows me as a mathematical loner, who did not get involved in any of the locally conducted specialized research; she rejects my application.\" One has some sympathy with her decision! Świerczkowski had married Helen but this marriage too had not been a success. He left her and ANU in\n1971\nand took a visiting professorship in Canada at Queen's University Ontario, Canada. As a sad postscript to his time at ANU he recalls\n[\n1\n]\n\"\nHanna Neumann\npays a visit to Canada, to give a lecture tour. One morning she is found dead in her car. Attending her funeral deepens my gloom. Mathematics does not interest me any more. I consider changing fields. I attend a few lectures in geology, only to discover that I would never be able to memorize so many names of minerals. Then I am playing with the idea of becoming a meteorologist, but this is dropped too.\"\nThere followed a more or less complete break from mathematics for Świerczkowski from the early\n1970\ns until the late\n1980\ns. During this time he led a colourful, itinerant life centred around his relationships with a yacht called\nAnanda\n, which he built himself in Amsterdam, with two women, Kathy with whom he had a daughter Jyoti\n(\nJyoti Verhoeff, who grew up to became a singer-songwriter, composer and pianist\n)\nand Elisa, and with spiritualism of various kinds. From this period only a chance meeting with the Polish computer scientist Krzysztof Apt harked back to his former life\n[\n1\n]\n:-\nAfter I told him that I also studied mathematics\n[\nin Wrocław\n]\n, graduating in\n1955\n, Krzysztof remarked, \"Your year was a very good one -- several of the students became known mathematicians\", and then he mentioned the names of some of my colleagues, including mine. \"Well, I am Świerczkowski\", I told him. Of course, he did not believe it. A bearded guy of a somewhat scruffy appearance, emerging from an unfinished yacht in an Amsterdam canal, this simply could not be the Polish professor, known to have made a career abroad! Fortunately, I had on the boat the off-prints of all my publications written before I left mathematics. I showed these to Krzysztof and after a while he accepted the truth.\nApt recommended Joseph R. Shoenfield's\n1967\nclassic\nMathematical Logic\nto Świerczkowski who writes\n[\n1\n]\n. \"I bought the book and began to read it. In this way, my connection with mathematics was re-established, and many years later, when I returned to university life, most of my research was based on the knowledge I gained from studying the recommended text by Joseph R. Shoenfield.\" The 'later' came in\n1986\nwhen Świerczkowski found himself at a crossroads with no prospects, no money, and no home, his yacht apparently sold by Elisa during an absence. Through his former head of department Bernard Scott he obtained a post at the Sultan Qaboos University in Oman. There he stayed for eleven years and resumed research, notably through a collaboration with his fellow student from thirty years earlier Jan Mycielski. He would visit Mycielski at the University of Colorado Boulder during summer breaks. During this period he married again, to Halina, a Polish engineer who visited him in Oman.\nDespite being again very creative mathematically and being promoted to a full professorship Świerczkowski did not survive the internal politics at Sultan Qaboos University and he found himself once more, at the age of\n65\n, without employment. He returned to Poland briefly with Halina and then took a temporary appointment in Mycielski's department in Colorado. He moved there with Halina in\n1998\nand until\n2011\nthey lived a somewhat precarious existence between Poland and the United States, eventually receiving right of residence but never being in a position of financial security. This was nevertheless a productive time for Świerczkowski. At Mycielski's suggestion he developed a new approach to proving\nGödel\n's incompleteness theorems, based on the theory of hereditarily finite sets. This non-arithmetic formulation avoids informal appeals to concepts in elementary number theory; consequently it was these proofs which were implemented to create mechanised proofs of\nGödel\n's theorems, the results being published just before Świerczkowski's death in\n2015\n[\n4\n]\n. Another intellectual achievement from this period acknowledged Świerczkowski's spiritual and philosophical journey: his translation into Polish of Maurice Frydman's\nI Am That\n, a collection of teachings of the Hindu guru Nisargadatta Maharaj.\nIn\n2011\n, Halina chose to remain in the United States while Świerczkowski returned to Australia where he could rely on an old-age pension and free health-care. He eventually settled in Tasmania and there spent his remaining years, working on his memoirs and corresponding widely with mathematical friends, to whom he sent regular one-page 'bulletins' about Tasmania and striking photos.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}