{
  "nome_completo": "Stanisław Zaremba",
  "nome_curto": "Stanisław Zaremba",
  "ano_nascimento": "1863",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zaremba/",
  "lugar_nascimento": "Romanówka, Trembowla, Galicia, Austria-Hungary (now Ukraine)",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Stanisław Zaremba\n's father was an engineer. Zaremba attended secondary school in St Petersburg then, after graduating, he studied engineering at the Institute of Technology in that city. He was awarded his engineering diploma in\n1886\nand he then went to Paris where he studied mathematics for his doctorate at the Sorbonne.\nAs a topic for his doctorate Zaremba looked to build on ideas introduced by\nRiemann\nin\n1861\n. His doctoral thesis\nSur un problème concernant l'état calorifique d'un corp homogène indéfini\nⓉ\n(\nOn a problem concerning the heat state of an indefinite homogeneous body\n)\nwas presented in\n1889\n. Zaremba made many contacts with mathematicians of the French school at this time which would provide him with international collaborators after returning to Poland. In particular he collaborated with\nPainlevé\nand\nGoursat\n.\nFor eleven years he taught in schools in France, during which time he concentrated hard on his research. The fact that he published his results in French mathematical journals meant that his work became well known and highly respected by leading French mathematicians such as\nPoincaré\nand\nHadamard\n.\nZaremba returned to Poland in\n1900\nwhere he was appointed to a chair in the Jagiellonian University in Kraków. In the following years he achieved much in teaching, writing textbooks, and organising the progress of mathematics in Kraków.\nStanisław Gołąb\n, a differential geometer, wrote on the history of mathematics in Poland. He described Zaremba's teaching style\n(\nsee\n[\n1\n]\n)\n:-\n[\nZaremba's\n]\nteaching was characterised by absolute rigour and an insistence on an exposition of a subject's subtleties. His lecturing style employed long and convoluted sentences, whose logical progression became clear only after closer scrutiny. He enjoyed working on and solving difficult problems that bogged down other researchers. Always taking a philosophical view of a problem, Zaremba combined physical intuition with enormous erudition, a method that enabled him to connect seemingly unrelated problems.\nWhen the\nMathematical Society of Kraków\nwas set up in\n1919\n, Zaremba chaired the inaugural meeting and was elected as the first President of the Society. This Society went on to became the\nPolish Mathematical Society\nin\n1920\n. For many years he served the Society as editor of the\nAnnals of the\nPolish Mathematical Society\n.\nFrom very unpromising times up to World War I, with the recreation of the Polish nation at the end of that war, Polish mathematics entered a golden age. Zaremba played a crucial role in this transformation.\nŚlebodziński\n, one of the mathematicians to work for the re-establishment of Polish mathematics after the Nazi destruction of the World War II, stressed the importance of the role of Zaremba in the creation of the golden age between the wars\n(\nsee for example\n[\n2\n]\n)\n:-\nWith the appearance of these two scholars\n[\nZaremba and\nŻorawski\n, Polish mathematics ceased to consume exclusively other people's thoughts and results and from that moment onwards began to participate actively in the development of its own science. The political circumstances of the period were such that, for a decade or more, Stanisław Zaremba and\nKazimierz Żorawski\nwere the only representatives of Polish mathematics in contact with foreign countries.\nMuch of Zaremba's research work was in\npartial differential equations\nand\npotential theory\n. He also made major contributions to mathematical physics and to crystallography.\nHe made important contributions to the study of viscoelastic materials around\n1905\n. He showed how to make\ntensorial\ndefinitions of stress rate that were invariant to spin and thus were suitable for use in relations between the stress history and the deformation history of a material. He studied elliptic equations and in particular contributed to the\nDirichlet\nprinciple. In\n[\n3\n]\nhis contribution is described as follows:-\nIn the work of the eminent Polish mathematician Stanisław Zaremba\n(1863\n-\n1942)\n, the problem of an axiomatic development of classical mechanics plays an important role, as is well known, this problem constitutes part of\nHilbert\n's Sixth Problem. Starting with the works of\nG Hamel\n, this question has been studied by many specialists in mechanics, mathematics and logic.\nIn\n[\n3\n]\nthe authors describe Zaremba's axiomatic justification of the notion of time in classical mechanics which he worked on during the period from\n1933\nto\n1940\n. I have spoken to someone who was a student at the Jagiellonian University in Kraków during this last period of Zaremba's life. By this time Zaremba was essentially retired from normal teaching duties but still came to give special lectures and was often seen by the students who held him in great respect and in some awe. He had a reputation as a hard examiner, someone who would expect a lot of his students and who thought up hard problems to spring on them in oral examinations. There was another side to him, however, for despite this reputation as a hard examiner, Zaremba showed great kindness and understanding to students who approached the oral examination in fear and trembling.\nLebesgue\n, someone who seldom heaped praise on his colleagues, paid tribute to him in\n1930\nwhen Zaremba received an honorary degree from the Jagiellonian University in Kraków\n(\nsee for example\n[\n1\n]\nor\n[\n2\n]\n)\n:-\nZaremba's scientific activity influenced so many research areas that his name cannot be unknown to anyone interested in mathematics. However, it seems that the power of the methods he created, and the originality of his imagination, can be appreciated best by those who work in the area of mathematical physics. There he showed his style and his name is imprinted forever.\nOn the same occasion in\n1930\n,\nHadamard\nalso described Zaremba's contributions\n(\nsee for example\n[\n2\n]\n)\n:-\nOne cannot help mentioning the ideas which he inspired in the domain of research pertaining to those fields to which French science of the present century has devoted the most effort. The profound generalisation due to him has recently transformed the foundations of potential theory and immediately became the starting point of research by young mathematicians of the French school. That generalisation, in a degree truly unexpected in that field, is marked by that simplicity and elegance which characterise ideas pertinently and profoundly grasping the nature of things. And as for my speciality, why, how could I forget the splendid results in the domain of mixed\nboundary problems\nand of harmonic functions, as well as of hyperbolic equations, research by means of which he opened a new path along which contemporary knowledge will proceed in the near future.\nZaremba received many honours. In addition to the honorary degree from the Jagiellonian University mentioned above, he received honorary degrees from Caen and Poznań. He was elected to the Soviet Academy in\n1925\n.\nKuratowski\nwrites in\n[\n2\n]\n:-\nStanisław Zaremba is the pride of Polish science.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}