{
  "nome_completo": "Stanisław Gołąb",
  "nome_curto": "Stanisław Gołąb",
  "ano_nascimento": "1902",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Golab/",
  "lugar_nascimento": "Travnik, Austro-Hungarian Empire (now Bosnia)",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Stanisław Gołąb\nwas born in Travnik, a small town about\n75\nkm north west of Sarajevo. When he was eight years old his family moved to Kraków. Stanisław had begun his primary education in Travnik but, after his family moved, he completed his primary education in Kraków. He then continued to attend secondary school in Kraków, where he showed outstanding abilities in mathematics. In fact he was fortunate to have a talented teacher,\nAntoni Hoborski\n, who later became a professor at the Mining Academy in Kraków.\nHoborski\nwas quick to spot the mathematical talents in his young pupil, and he guided him through his secondary school career, giving  Gołąb a deep love of geometry. He completed his school studies in\n1920\n.\nEntering the Jagiellonian University in Kraków in\n1920\n,  Gołąb studied mathematics in the Faculty of Mathematics and Physics. However, although only two years into an undergraduate degree, in\n1922\nGołąb was given a position as a teaching assistant in the Mining Academy in Kraków. He was awarded a Master's degree in mathematics from the Jagiellonian University in\n1924\nand in the following year published his first mathematics paper\nQuelques propiétés des corbes régulières\nⓉ\n(\nSome properties of regular curves\n)\n. In\n1926\nhe obtained the necessary certificate to allow him to teach mathematics at High Schools. However  Gołąb continued teach at the Mining Academy and to undertake research in mathematics. He travelled to Delft in Holland in\n1928\nwhere he studied under\nJan A Schouten\n. In Delft he undertook the necessary research for his doctoral dissertation with\nSchouten\nas his advisor. However he was registered as a doctoral student at the Jagiellonian University with\nStanisław Zaremba\nas his formal thesis supervisor. Before submitting his thesis,  Gołąb studied in Italy with\nTullio Levi-Civita\nand\nE Bompiani\n, in Czechoslovakia with\nLudwig Berwald\n, and also in Göttingen. His doctoral thesis\nÜber verallgemeinerte projektive Geometrie\nⓉ\n(\nOn generalized projective geometry\n)\nwas submitted to the Jagiellonian University in\n1930\nbut it was only in\n1931\nthat he defended his doctoral dissertation in Kraków. Before this, however, he had already begun to give mathematics lectures to chemists and natural scientists at the Jagiellonian University.\nSince he wanted to become a university professor of mathematics,  Gołąb worked on his\nhabilitation\n. He was awarded the degree based on his paper\nQuelques problèmes métrique de la géometrie de Minkowski\nⓉ\n(\nSome metric problems in the geometry of Minkowski\n)\nin\n1932\n. Following this, although he continued to teach mathematics for scientists courses at the university, he also began his teaching career to mathematicians at the university.  Gołąb also continued to lecture at the Mining Academy and in\n1939\nhe was promoted to associate professor there. He was now\n37\nyears old and had established himself as a top quality researcher with a remarkable record to the quantity and quality of his publications. After the\n1925\npaper we mentioned above,  Gołąb published\n3\npapers in\n1928\n,\n3\npapers in\n1929\n,\n4\npapers in\n1930\n,\n1\npaper in\n1931\n,\n6\npapers in\n1932\n,\n9\npapers in\n1933\n,\n4\npapers in\n1934\n,\n5\npapers in\n1935\n,\n2\npapers in\n1936\n,\n5\npapers in\n1937\n, and\n11\npapers in\n1938\n. However his career came to disastrous halt following the outbreak of World War II in\n1939\n.\nPoland was invaded by German troops on\n1\nSeptember\n1939\nand by\n5\nSeptember they had crossed the Vistula. The Fourteenth Army was aiming at Kraków but, although the city was not destroyed, it had to surrender to the German forces on\n6\nSeptember. The general expectation was that the Germans would allow the Jagiellonian University to open and teach the\n1930\n-\n40\ncourses.  SS officer Bruno Müller ordered the rector of the University to assemble the professors and assistants of the University on\n6\nNovember to hear a lecture on the Nazi Party policy toward science and universities. Believing that this was a meeting where conditions would be laid out for the university to reopen,\n105\nprofessors and assistant professors,\n33\nteaching staff and\n2\nstudents assembled in room\n66\nof the Collegium Novum building at noon. In addition\n21\nprofessors and assistantd from the Mining Academy were attending a meeting in a different room of the Collegium Novum.  Gołąb was one of those at the meeting in the Collegium Novum on that day.\nWhat the Kraków university teachers did not know as they entered the Collegium Novum was that the Nazis had been working out a plan codenamed Sonderaktion Krakau as part of a wider plan to eradicate the Polish intellectuals. All were arrested including a number of visiting professors, university employees and students not included in the above totals who happened to be in the Collegium Novum at the time.  Gołąb, of course, was one of those arrested. He was taken first to a prison in Wrocław, then to the concentration camps of Sachsenhausen and Dachau. In all\n183\narrested in the Collegium Novum that day ended up in these concentration camps. Many Jews sent to these concentration camps went straight to the gas chambers but the academics were spared that fate. However conditions in the camps were extremely poor with disease, lack of proper food and sanitation, and little escape from the winter cold. Around twenty of the older professors died in the camps, or within days of being released. However on\n8\nFebruary\n1940\n, following strong international protests, around one hundred of the older professors were released.  Gołąb, being one of the younger professors, was not released at that time and he suffered in the camps until December\n1940\nwhen, after a year of imprisonment, he was released.\nGołąb worked as a bookkeeper for a forestry organisation from the time of his release until the end of World War II. However, in\n1942\n, the released academics began to operate an underground university in Kraków, despite the Nazi edicts forbidding such an organisation.  Gołąb was one of those who, despite the knowledge that were they caught they would almost certainly have been murdered, taught at both the Mining Academy and at the Jagiellonian University. He resumed his pre-war duties at both the Mining Academy and the Jagiellonian University after the war ended. He was made an extraordinary professor at the Mining Academy in\n1946\nand a full professor two years later. In\n1949\nhe was appointed as Head of the Department of\nDifferential Geometry\nat the Mathematics Institute of the\nPolish Academy of Sciences\n. In\n1955\nhe became a full professor at the Jagiellonian University where he was Head of Geometry. He continued to teach at the Mining Academy until\n1962\n, but even after that he continued to collaborate with colleagues there.\nKucharzewski, a doctoral student of  Gołąb at the  Jagiellonian University who obtained his doctorate in\n1959\n, writes in\n[\n2\n]\n:-\nProfessor  Gołąb dealt with different fields of mathematics such as geometry, topology, algebra, analysis, logic, functional and differential equations, the theory of numerical methods and various applications of mathematics. He wrote several didactic papers\n(13)\n, popular science papers\n(3)\n, historical essays\n(8)\nand biographical notes\n(8)\n. However, the most important results he obtained were in the field of geometry. More than half of the total number of his publications belong to that domain\n(130)\n. One can divide them into three almost equal parts; papers on the theory of geometric objects\n(40)\n, papers on classical differential geometry under weak regularity assumptions\n(43)\nand papers belonging to various other domains in geometry\n(50)\nmainly connected with some special spaces such as spaces with linear or projective connection,\nRiemann\n,\nMinkowski\nand\nFinsler\nspaces, general metric spaces, etc.\nIn\n[\n5\n]\nKuczma, a doctoral student of  Gołąb at the  Jagiellonian University who obtained his doctorate in\n1961\n, writes that  Gołąb:-\n... may be considered as the father figure of the Polish school of functional equations. All Polish mathematicians working in the theory of functional equations are - directly or indirectly - pupils of Professor  Gołąb.\nBodziony writes in\n[\n1\n]\n:-\n... at least a few dozen, perhaps even hundreds, of engineers not only had the opportunity of discussing their projects or results with Professor  Gołąb, but also as a result of this discussion could enrich and improve their research work.\nIn\n1956\nGołąb published the book\nTensor calculus\n(\nPolish\n)\n. Z A Melzak begins a review of the text by writing:-\nThis is a careful book, in the classical style and the usual best traditions of the Polish school, on the Tensor Calculus, written from a geometrical point of view, and intended for students of Physics and Engineering as well as those of Mathematics. By an explicitly stated preference, the author follows the methods of\nSchouten\n...\nA second Polish edition was published in\n1966\n. It was considerably enlarged. This edition was translated into English and published in\n1974\n. Let us also mention the book\nFunktionalgleichungen der Theorie der geometrischen Objekte\nⓉ\n(\nFunctional equations in the theory of geometric objects\n)\nwhich  Gołąb wrote jointly with J Aczél and published in\n1960\n.\nKucharzewski, himself a pupil of  Gołąb, writes:-\nHe will always be remembered by his pupils as a conscientious researcher, great teacher and invariably helpful man.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}