{
  "nome_completo": "Stephen Cole Kleene",
  "nome_curto": "Stephen C Kleene",
  "ano_nascimento": "1909",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kleene/",
  "lugar_nascimento": "Hartford, Connecticut, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Stephen C Kleene\n's father was Gustav Adolph Kleene, a professor of economics at Trinity College, Hartford, Connecticut at the time of his son's birth. He remained there for the rest of his career. He retired, becoming professor emeritus, and died at his summer home in Union, Maine in August\n1946\n. This home was on a farm in Maine which had belonged to his wife, inherited from her mother, Drucilla Cole. Both Gustav and his son Stephen considered this farm their 'real home.' Gustav wrote books such as\nThe problem of medical charity\n(1904)\nand\nProfit and wages: A study in the distribution of income\n(1916)\n. Stephen's mother was Alice Lena Cole who was a poet and writer of plays. Before marrying she published poems such as\nThe lawsuit\npublished in\nThe Youth's Companion\n(1892)\n,\nThe dead bee\npublished in\nThe Century\n(1899)\n,\nThe lost spell\npublished in\nAtlantic Monthly\n(1900)\nand\nEscape\npublished in\nAtlantic Monthly\n(1900)\n. After her marriage she published\nKIRSTIN; KIRSTIN. Play in Four Acts\n(1914)\nunder her married name Alice Cole Kleene. It was described by a critic in the New York Times as a \"pretty play with graceful lyrics.\"\nStephen Kleene studied for his first degree at Amherst College, Amherst, Massachusetts, being awarded his Bachelor's Degree summa cum laude in\n1930\n. He then went to Princeton University where his doctoral studies were supervised by\nAlonso Church\n. It had been\nOswald Veblen\nwho had proposed that the development of logic required careful analysis by mathematicians.\nChurch\n, one of\nVeblen\n's students, had been appointed to Princeton in\n1929\nand was making remarkable advances in this area. J Barkley Rosser was also a doctoral student of\nChurch\n's at Princeton, arriving in\n1933\nwhile Kleene was there. It was certainly an exciting place to be undertaking research applying mathematical techniques to logic with visitors such as\nKurt Gödel\n- Kleene attended a course he gave at the Institute for Advanced Study. Kleene received a doctorate from Princeton for his thesis entitled\nA Theory of Positive Integers in Formal Logic\nin\n1934\n. He writes in the Introduction to his thesis:-\n... we shall be concerned primarily with the development of the system of logic based on a set of postulates proposed by\nA Church\n. Our object is to demonstrate empirically that the system is adequate for the theory of positive integers, by exhibiting a construction of a significant portion of the theory within the system. By carrying out the construction on the basis of a certain subset of\nChurch\n's formal axioms, we show that this portion at least of the theory of positive integers can be deduced from logic without the use of the notions of negation, class, and description.\nAfter the award of his doctorate Kleene taught at Princeton until he joined the University of Wisconsin at Madison as an Instructor in\n1935\n. He was promoted to Assistant Professor at Wisconsin in\n1937\nbefore leaving in\n1941\n(\nunhappy at his failure to be promoted\n)\nto become Assistant Professor back at Amherst College where he had studied for his first degree. In\n1942\nhe married Nancy Elliot; they had four children, Paul, Kenneth, Bruce, and Pamela. Nancy Elliot  was the daughter of George Roy Elliott, professor of English at Amherst College and a literary critic who specialized in Shakespeare. Also in\n1942\nKleene left Amherst College to undertake war service with the US Navy as a navigation instructor at the Naval Reserve Midshipmen's School in New York. Later he was a project director at the Naval Research Laboratory in Washington DC. By the time he left the navy after the end of World War II, Kleene had risen to the rank of lieutenant commander.\nHe returned to the University of Wisconsin at Madison in\n1946\nas an associate professor being promoted to full professor two years later. In\n1964\nhe was named Cyrus C Duffee Professor and continued to hold that chair until he retired in\n1979\n. He served two terms as the Chair of the Department of Mathematics and one term as the Chair of the Department of Numerical Analysis\n(\nlater renamed the Department of Computer Science\n)\n. He also served as Dean of the College of Letters and Science in\n1969\n-\n74\n. During his years at the University of Wisconsin he was thesis advisor to\n13\nPh.D. students.\nIn\n1970\nKleene's wife Nancy died. Eight years later he remarried Jeanne Steinmetz. He died of pneumonia aged\n85\n.\nKleene's research was on the theory of algorithms and recursive function theory, an area which he created and retained an interest in throughout his life. He developed the field of recursion theory with\nChurch\n,\nGödel\n,\nTuring\nand others. He contributed to mathematical\nIntuitionism\nwhich had been founded by\nBrouwer\n. In particular he lectured on\nRecursive functions and intuitionistic mathematics\nat the International Congress of Mathematicians in Cambridge, Massachusetts, in\n1950\n. In this lecture he spoke about how his interpretation of intuitionistic number theory by means of a \"realization\" might extend to intuitionistic set theory. He explored these ideas further in the book\nThe foundations of intuitionistic mathematics, especially in relation to recursive functions\n(1965)\nwritten jointly with Richard Vesley. Chapters I, II, and IV of the book were written by Kleene while Chapter III is by Vesley. G Kreisel writes in a review:-\nChapter I is by far the best introduction to intuitionistic logic which is at present available for a mathematical logician.\nMichael Dummett, a leading authority, was also greatly impressed:-\n... chapter one of this book provides the first systematic exposition of the foundations of intuitionist analysis set out as an axiomatic system treating\nBrouwer\n's fan theorem, the bar theorem, and the continuity principle\n(\ncalled\nBrouwer\n's principle\n)\n. In these respects, this was far superior to the earlier well-known axiomatization by\nHeyting\n.\nKleene's work on recursion theory helped to provide the foundations of theoretical computer science. By providing methods of determining which problems are soluble, Kleene's work led to the study of which functions can be computed. He spent the summer of\n1951\nat the RAND Corporation and discovered an important characterisation of finite automata. His RAND report on his work that summer has been very influential for theoretical computer science.\nAt a lecture in the University of Chicago in\n1995\n, Robert Soare described Kleene's work in these terms:-\nKleene's formulation of computable function via six schemata is one of the most succinct and useful, and his previous work on lambda functions played a major role in supporting\nChurch\n's Thesis that these classes coincide with the intuitively calculable functions.\nFrom\n1930\n's on Kleene more than any other mathematician developed the notions of computability and effective process in all their forms both abstract and concrete, both mathematical and philosophical. He tended to lay the foundations for an area and then move on to the next, as each successive one blossomed into a major research area in his wake.\nKleene developed a diverse array of topics in computability: the arithmetical hierarchy, degrees of computability, computable ordinals and hyperarithmetic theory, finite automata and regular sets with enormous consequences for computer science, computability on higher types, recursive realizability for intuitionistic arithmetic with consequences for philosphy and for program correctness in computer science.\nKleene's best known books are\nIntroduction to Metamathematics\n(1952)\nand\nMathematical Logic\n(1967)\n. Kleene writes in the first of these:-\nThe aim of this book is to provide a connected introduction to the subjects of mathematical logic and recursive functions in particular, and to the newer foundational investigations in general.\nJ R Shoenfield, reviewing the second, writes:-\nThe growth of the undergraduate curriculum in mathematics has given rise to a number of texts treating serious mathematical results in a slower and more detailed manner than is customary in graduate texts. Since the number of such texts in the field of logic is quite small, this book by an outstanding authority in the field is especially welcome. ... The author clearly feels that a fairly thorough treatment of a few topics is preferable to a little bit of everything. ... Difficult proofs are broken down into a large number of simple cases; some of these cases are usually left to the reader. There are many illuminating examples; the author is usually more interested in giving enough examples to illustrate the important points of the proof than in giving complete details of the proof. Clarity and simplicity are never sacrificed for elegance. Historical notes and bibliographical references are frequent, but are not allowed to overshadow the mathematics.\nAmong the awards and honours that Kleene received for his outstanding contributions we mention the Leroy P Steele Prize which he was awarded by the\nAmerican Mathematical Society\nin\n1983\n:-\n.. for three important papers which formed the basis for later developments in generalized recursion theory and descriptive set theory \"Arithmetical predicates and function quantifiers\", \"On the forms of the predicates in the theory of constructive ordinals\n(\nsecond paper\n)\n\", and \"Hierarchies of number-theoretic predicates\".\nPerhaps his most prestigious award was the National Medal of Science presented by President Bush at a White House East Room Ceremony on\n13\nNovember\n1990\n:-\nFor his leadership in the theory of recursion and effective computability and for developing it into a deep and broad field of mathematical research.\nOther honours included election to the\nNational Academy of Sciences\n(1969)\n, election as President of the Association for Symbolic Logic\n(1956\n-\n58)\n, president of the International Union of the History and the Philosophy of Science\n(1961)\nand of the Union's Division of Logic, Methodology and Philosophy of Science\n(1960\n-\n62)\n. He was editor of the\nJournal of Symbolic Logic\nfor twelve years.\nIn\n[\n3\n]\n, Keisler describes Kleene's interests outside mathematics:-\nKleene had a strong interest in nature and the environment and visited his family farm in Maine almost every summer. He discovered a variety of butterfly Brenthis Bellona ab. Kleenei which was named after him. He was an avid climber and, until well into his seventies, led the biannual logic picnic at Madison\n(\nnow the Kleene Memorial Logic Picnic\n)\non hikes up the cliffs at Devil's Lake. Steve Kleene's knowledge of mushrooms was legendary.\nMac Lane\n. in\n[\n5\n]\n, recounts an experience climbing with Kleene:-\nIn\n1949\nhe and I, about to attend a meeting at Dartmouth of the\nAmerican Mathematical Society\n, got together on a project to climb all the peaks in the Presidential range, and we were joined by a third climber, a vacationing bellhop. Then, as we three stood finally on top of the last peak\n(\nMount Madison\n)\n, a thunderstorm struck. Kleene bounded down from the peak shouting, \"Get down; it's lightning.\" I stepped down a bit, searched for our third companion only to find him flat on the ground, unconscious. Steve\n(\nquicker by way of his height\n)\nwent down to the Madison Pass hut for help. When we got the injured man there we found that the lightning had singed his scalp and left a blister on his foot opposite a hobnail. We ferried him to a hospital, and I\n(\ncomplete with a burned-out seat of the pants\n)\nnotified his employer at the elegant Eastern Slopes Inn. He later recovered. Steve and I continued to climb assorted mountains and Steve kept on rock climbing.\nKeisler\n[\n3\n]\nalso describes his personality:-\nAlthough a private man, he was a skilful and enthusiastic teller of anecdotes. He possessed a powerful voice that always made it possible for others to know without seeing him whether he was in the maths building.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}