{
  "nome_completo": "Stephen Smale",
  "nome_curto": "Stephen Smale",
  "ano_nascimento": "1930",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smale/",
  "lugar_nascimento": "Flint, Michigan, USA",
  "lugar_morte": null,
  "biografia": "Stephen Smale\nwas born in Flint in east Michigan, a town famed as the site of General Motors, the automobile company. From the age of five he lived on a farm while his father worked in the city for General Motors. For eight years Stephen attended elementary school about a mile from his farmhouse. This school only had a single classroom, so has teacher had to cope with educating children of all ages under difficult circumstances. Following this, he studied at high school where his favourite subject was chemistry. His interests had moved to physics by the time he entered the University of Michigan, but after failing a physics course he turned to mathematics. He was awarded a BS in\n1952\nand an MS the following year.\nSmale continued to work for his doctorate at the University of Michigan, Ann Arbor under R Bott's supervision and he was awarded his Ph D in\n1957\nfor the thesis\nRegular Curves on Riemannian\nManifolds\n. In his thesis he generalised results proved by\nWhitney\nin\n1937\nfor curves in the plane to curves on an\nn\nn\nn\n-dimensional manifold. Smale was an instructor at the University of Chicago in\n1956\n-\n58\n.\nIn\n1958\nSmale learnt about\nPontryagin\n's work on structurally stable vector fields and he began to apply\ntopological\nmethods to study the these problems. He the spent the years\n1958\n-\n60\nat the Institute for Advanced Study at Princeton on a National Science Foundation Postdoctoral Fellowship. The last six months of this fellowship he spent at the Instituto de Mathematica Pura e Aplicada in Rio de Janeiro. Here he received a letter from\nLevinson\nwhich led him to study chaotic phenomena; we describe these ideas below.\nIn\n1960\nSmale was appointed an associate professor of mathematics at the University of California at Berkeley, moving to a professorship at Columbia University the following year. In\n1964\nhe returned to a professorship at the University of California at Berkeley where he has spent the main part of his career. He retired from Berkeley in\n1995\nand took up a post as professor at the City University of Hong Kong.\nSmale was awarded a\nFields Medal\nat the International Congress at Moscow in\n1966\n. The work which led to this award was described by René\nThom\n, see\n[\n9\n]\n. One of Smale's impressive results was his work on the generalised\nPoincaré\nconjecture.\nThe\nPoincaré\nconjecture, one of the famous problems of\n20\nth\n-century mathematics, asserts that a simply connected closed\n3\n-dimensional manifold is a\n3\n-dimensional sphere. The higher dimensional\nPoincaré\nconjecture claims that any closed\nn\nn\nn\n-dimensional manifold which is\nhomotopy equivalent\nto the\nn\nn\nn\n-sphere must be the\nn\nn\nn\n-sphere. When\nn\n=\n3\nn = 3\nn\n=\n3\nthis is equivalent to the\nPoincaré\nconjecture. Smale proved the higher dimensional\nPoincaré\nconjecture in\n1961\nfor\nn\nn\nn\nat least\n5\n.\n(\nMichael Freedman\nproved the conjecture for\nn\n=\n4\nn = 4\nn\n=\n4\nin\n1982\nbut the original conjecture remained open until settled by\nG Perelman\nwho was offered the\n2006\nFields medal for his proof.\n)\nAnother area in which Smale has made a very substantial contribution is in\nMorse\ntheory which he has applied to multiple integral problems. In fact Smale attacked the generalised\nPoincaré\nconjecture using\nMorse\ntheory.\nAnother discovery of Smale's related to strange attractors. An attractor in classical mechanics is a geometrical way of describing the behaviour of a\ndynamical system\n. There are three classical attractors, a point which characterises a steady state system, a closed loop which characterises a periodic system, and a torus which combines several cycles. Smale discovered strange attractors which lead to chaotic dynamical systems. Strange attractors have detailed structure on all scales of magnification and were one of the early fractals to be studied.\nSmale's career changed direction in the late\n1960\ns, see\n[\n2\n]\n:-\nBy the late sixties Smale had moved into applications. He modelled physical processes by dynamical systems, opening new lines of inquiry. The\nn\nn\nn\n-body problem and electric circuit theory were among the applications that Smale framed in the language of dynamical systems. For much of the seventies Steve focused on economics, injecting topology and dynamics into the study of general economic equilibria. Having established the nature of equilibria, Smale began to think algorithms for their computation. While traditional approaches to the convergence theory of algorithms were local, Smale introduced a global perspective to the problems. Was the algorithm reasonably reliable, and how many iterations were to be expected? ...\nSmale's recent work has been on theoetical computer science. With co-workers L\nBlum\nand M Shub, he has developed a model of computation which includes both the\nTuring\nmachine approach and the numerical methods of numerical analysis.\nSmale has received many honours for his work. In addition to the Fields Medal described above, he was awarded the\nVeblen\nPrize for Geometry by the\nAmerican Mathematical Society\nin\n1966\n:-\n... for his contributions to various aspects of\ndifferential topology\n.\nIn\n1996\nSmale received the National Medal of Science\n(\n[\n2\n]\n)\nfor:-\n... four decades of pioneering work on basic research questions which have led to major advances in pure and applied mathematics.\nSmale's contribution is nicely summed up in\n[\n2\n]\n:-\nThroughout his career Smale has approached mathematical problems with the scholarship to learn from others, the audacity to be unconstrained by conventional wisdom, and the power and vision to employ new methods and construct original frameworks. After the fact, a Smale development seems so natural, yet no one else thought of it.\nSmale has been awarded honorary degrees by the University of Warwick\n(1974)\n, Queens University, Kingston, Ontario\n(1987)\n, the University of Michigan\n(1996)\n, Université Pierre et Marie Curie, Paris\n(1997)\n, the City University of Hong Kong\n(1997)\n, Rostov State University\n(1999)\n, and the University of Genoa\n(2004)\n. He has been made an honorary member of the Instituto de Matematica Pura e Aplicada,  Rio de Janeiro\n(1990)\n, Trinity Mathematical Society, Dublin\n(1991)\n,\nMoscow Mathematical Society\n(1997)\nand the\nLondon Mathematical Society\n(1998)\n.\nIn addition to the prizes mentioned above, Smale has been awarded the Chauvenet Prize by the\nMathematical Association of America\nin\n1988\nfor his paper\nOn the Efficiency of Algorithms in Analysis\n. In the following year he was awarded the\nVon Neumann\nAward by the\nSociety for Industrial and Applied Mathematics\nwho also presented him with their\nJürgen Moser\nPrize in\n2005\n. Then in\n2007\nhe was honoured with the award of the Wolf Prize:-\n... for his groundbreaking contributions that have played a fundamental role in shaping differential topology, dynamical systems, mathematical economics, and other subjects in mathematics.\nFinally we note that Smale continued as Distinguished University Professor at the City University of Hong Kong until\n2001\n. He was appointed Professor at the Toyota Technological Institute at Chicago in\n2002\n. Then in\n2009\nhe was again appointed Distinguished University Professor at the City University of Hong Kong.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}