{
  "nome_completo": "Stephen James Rallis",
  "nome_curto": "Steve Rallis",
  "ano_nascimento": "1942",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rallis/",
  "lugar_nascimento": "Bennington, Vermont, USA",
  "lugar_morte": "Columbus, Ohio, USA",
  "biografia": "Steve Rallis\nwas the son of James \"Jimmy\" Rallis\n(1912\n-\n2005)\nand his wife Evangelia \"Vickie\" Felopulos\n(1915\n-\n2009)\n. Jimmy Rallis, who was born on\n5\nMay\n1912\nin Lowell, Massachusetts, ran the Raleigh Restaurant in Bennington until\n1953\n. After this he operated the Four Chimneys Restaurant, which had an outstanding reputation. He died on\n1\nApril\n2005\n. Vickie was a graduate of Bennington High School, moving on to Wellesley College where she majored in art history. Steve had two sisters, Nancy and Diane. Let us record at this point that Nancy also became a mathematician, studying at Vassar College and then earning a Ph.D. from Indiana University in\n1978\nfor her thesis\nPeriodic points and a fixed-point index theory for symmetric product mappings\n. She was advised by Jan W Jaworowski who had been a student of\nKarol Borsuk\nin Poland.\nSteve Rallis was educated at Bennington High School, as were his two sisters. Mr Jarecki, who taught social studies, had a big influence on all the children. Nancy said\n[\n3\n]\n:-\n[\nMr Jarecki\n]\nwas a very well-respected teacher that I know Steve enjoyed very much.\nRallis, who was ranked first in his class when he graduated from Bennington High School, knew from a young age that he wanted a career in mathematics. After High School, he entered Harvard University where he studied mathematics. At Harvard he was a resident of Winthrop House, one of the Harvard Colleges, and was awarded AB, magna cum laude in mathematics, in\n1964\n. He then went to the Massachusetts Institute of Technology where he was advised for his doctoral studies by Bert Kostant. Rallis was awarded a Ph.D. in\n1968\nfor his thesis\nLie group representations associated with symmetric spaces\n. In fact he met his future wife Michele Kaufman while he was copying his thesis in Harvard Square. Michele had been an undergraduate at Radcliffe College and had then undertaken research for her Ph.D. at Harvard advised by David Layzer, a cosmologist. She had just completed writing her Harvard Ph.D. thesis in astronomy and, like Rallis, was in Harvard Square to make copies of the thesis.\nAfter receiving his Ph.D. from the Massachusetts Institute of Technology, Rallis spent the two years\n1968\n-\n70\nat the Institute for Advanced Study in Princeton, arriving on\n9\nSeptember\n1968\nand leaving on\n1\nJuly\n1970\n. He published a number of papers written jointly with his thesis advisor Bert Kostant, namely\nOn orbits associated with symmetric spaces\n(1969)\n,\nOn representations associated with symmetric spaces\n(1969)\n, and\nOrbits and representations associated with symmetric spaces\n(1971)\n. At Princeton he began undertaking research on the oscillator representation with Gerard Schiffmann. Rallis married Michele Kaufman in\n1970\n. After leaving Princeton, Rallis spent two years at SUNY Stony Brook. He then had a number of visiting positions at Strasbourg, Texas, Notre Dame and Princeton. He spent two years in Strasbourg and was visited there by Gerard Schiffmann who writes\n[\n2\n]\n:-\nIt was perhaps at that time that he adopted his amazing work schedule: six or seven days a week from early in the morning to late in the evening! ... in Princeton I\n[\nhad\n]\nmet Michele for the first time, just a few months before their wedding. Later during their stay in Strasbourg my wife and I had many occasions to visit with them. Early in their relationship Michele recognized Steve's gift for mathematics and his devotion to research. Remarkably, throughout Steve's career she managed to maintain her career in astronomy while facilitating his life in mathematical research.\nWhile in Strasbourg in\n1975\n, he published, with Gerard Schiffmann,\nDistributions invariantes par le groupe orthogonal\nⓉ\n(\nDistributions invariant under the orthogonal group\n)\nin the Nancy-Strasbourg Seminar 'Analyse harmonique sur les groupes de Lie':-\nThis is a thorough and serene exposition of the analytical theory of quadratic forms with the flavour of\nJ Tate\nand the flavour of\nA Weil\n.\nHe was at Notre Dame when he submitted the joint paper\nDiscrete spectrum of the Weil representation\n(\nwritten with Gerard Schiffmann\n)\nfor publication in late\n1976\nbut was at Princeton by the time it was published in\n1977\n. Rallis was appointed to Ohio State University as an assistant professor of mathematics later in\n1977\n. He was promoted to associate professor in\n1979\nand to full professor in\n1984\n. He returned to the Institute for Advanced Study in Princeton in January\n1984\nspending over three months there, and again in January\n2001\nwhen he spent four months. He spent the rest of his career on the faculty at Ohio State, retiring in\n2007\nwhen he was made Professor Emeritus. His time at Ohio State is described in\n[\n2\n]\n:-\nSteve was a definite presence in the Ohio State University mathematics department. He would come in every morning and start making his rounds. He would check in with the staff, visit with his colleagues, talk with his visitors and his post-docs, meet with his students\n(\nusually in the lounge with others present\n)\n, and still manage to teach his classes. He seemed to be everywhere, except his office; there was no point in trying to call him during the day. But he came back to the department after dinner to work and kept the same schedule on the weekends; then you had a better chance of finding him in his office working, but still ready to talk mathematics. His work ethic was an inspiration to all.\nThe\nNew York Times\ndescribes him as follows\n[\n4\n]\n:-\nSteve Rallis was a warm, friendly, kind person, who wore polo shirts and slacks every day and had students, staff, and the cleaning crew call him \"Steve\" rather than \"Prof. Rallis.\" Instead of saying \"You're wrong\" when a student or colleague made a mistake, he would say \"What am I missing here?\" Steve stood for fair treatment of people and was unafraid to speak out when necessary. Secretaries considered him a teddy bear.\nHis wife Michele said\n[\n3\n]\n:-\nSteve took a particular interest in his students, he loved teaching undergraduates but when the university started to expand and make undergraduate classes into lectures with hundreds of students he chose to teach graduate students. Steve never co-published papers with graduate students, he would always give them full credit for the research in their publications, he never wanted anyone to assume that he had done the work if the student had done it.\nLet us now look at some of Rallis's important contributions to mathematics\n[\n1\n]\n:-\nRallis' early work was on connections between representation theory and invariant theory. Early on, the primary focus of Rallis' research shifted to the theory of automorphic forms and\nrepresentation theory\nand then L-functions, but always keeping\ninvariant theory\nas one of his powerful techniques. His work was very original and has left a lasting impact on number theory and representation theory. Throughout his career Rallis was a collaborative mathematician; of the\n94\ncitations listed on 'MathSciNet', all but\n7\nare joint papers. One can track his career by tracking his collaborations. They were almost all long term collaborations resulting in series of papers.\nHe published three books, all research monographs, and the first\n(\nunusually for Rallis as the above quote indicated\n)\nwas single authored. It was\nL-functions and the oscillator representation\n(1989)\nand was reviewed by L A Takhtajan who wrote:-\nThe purpose of the book under review is to put the results of\nShimura\nand Waldspurger on the connection between modular forms of integer and half-integer weights into the general framework of the theory of automorphic representations. ... In answering\n[\nquestions posed\n]\nthe whole machinery of the modern theory of automorphic representations is used. The book is a continuation of earlier papers by the author ...\nThe next monograph,\nExplicit constructions of automorphic L-functions\n(1987)\n, is in two parts, the first of which was written by Rallis and\nIlya Piatetski-Shapiro\n. Joe Repka writes in a review:-\nPart A: 'L-functions for the classical groups', by\nPiatetski-Shapiro\nand Rallis, uses a generalization of the classical Rankin-\nSelberg\nconstruction to define an L-function associated to any irreducible cuspidal automorphic representation. The L-function is expressed as an integral involving\nEisenstein\nseries on a larger group. The idea is presented axiomatically and then discussed for symplectic, orthogonal and unitary groups. The approach given here has the advantage that it is not necessary to restrict to automorphic representations which are \"generic\".\nThe third monograph, published after Rallis retired, was a joint work with David Ginzburg and David Soudry entitled\nThe descent map from automorphic representations of\nG\nL\n(\nn\n)\nGL(n)\nG\nL\n(\nn\n)\nto classical groups\n(2011)\n. Erez M Lapid puts this work into context:-\nThe functoriality conjectures of\nLanglands\nare a cornerstone in the modern theory of automorphic forms. They predict deep relations between automorphic representations on different groups. Unfortunately, only very special cases of functoriality are known. Such cases give invaluable information and have important applications. An important technique for establishing functoriality is by explicit constructions\n(\nin contrast with the trace formula and converse theorem techniques, which are indirect\n)\n. Not surprisingly, this technique gives more information than functoriality itself. It goes without saying that all three methods are extremely limited, and may have been almost exhausted by now. The book under review discusses explicit constructions of automorphic forms on classical groups from those of the general linear group. The method, known as the descent map, uses certain Fourier coefficients\n(\nof\nGelfand\n-Graev or\nFourier\n-\nJacobi\ntype, depending on the context\n)\nof residual\nEisenstein\nseries on a bigger classical group induced from the automorphic representations on\nG\nL\nn\nGL_{n}\nG\nL\nn\n​\n.\nRallis's two co-authors described their experiences working with him in\n[\n2\n]\n:-\nWorking with Steve was a great experience for us, still very vivid in our minds: Steve's great passion for mathematics, his enthusiasm and devotion; times of breakthrough, moments of frustration; meeting together the next morning and sharing our separate thoughts of the night before; taking a break and getting coffee or ice cream, playing pool, or bowling. Together with Steve, we did our best mathematical work. We feel very privileged to have known Steve, to have learned from him and worked with him. Working with Steve was accompanied by many conversations about life, personal memories and experiences, dreams, hopes, and fears; history, politics, literature, art, films, and so much more. He was a true friend. Steve will always live in our minds: Steve the great mathematician and Steve our great beloved friend.\nIn\n1990\nRallis was invited to lecture at the International Congress of Mathematicians held in August in Kyoto, Japan. He gave the lecture\nPoles of standard L functions\nin which he surveyed some of his recent work. Stephen Gelbert begins a review of the published version of Rallis's talk as follows:-\nThe Rankin-\nSelberg\nmethod in the theory of L-functions gives explicit integral representations of certain L-functions attached to automorphic representations of reductive algebraic groups. This allows one to determine the analytic continuation and functional equation of these L-functions, as well as their explicit poles. In recent years, Rankin-\nSelberg\nintegral representations have been found for several new classes of L-functions, primarily the standard L-functions for the classical groups. The paper under review surveys important recent work in this direction by the author, in collaboration with\nI Piatetski-Shapiro\nand S Kudla.\nLet us end this biography by quoting from Michael Harris\n[\n2\n]\n:-\nNumber theory has yet to absorb all the lessons of Rallis's more recent work, but the process is beginning.\nAlso we quote from the authors of\n[\n1\n]\n:-\nWe have all benefitted from Rallis' unique perspective on mathematics and his generous willingness to share his ideas and experience, even those of us who never had the pleasure of collaborating with him.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}