{
  "nome_completo": "Sun-Yung Alice Chang",
  "nome_curto": "Sun-Yung Alice Chang",
  "ano_nascimento": "1948",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chang/",
  "lugar_nascimento": "Xi-an, China",
  "lugar_morte": null,
  "biografia": "Sun-Yung Alice Chang\nwas born in China at the time when the Communists were rapidly taking control of the country. By late\n1949\nthe Communists were in control of almost all of China, the main exception being Taiwan which continued to be controlled by the Nationalist government. Soon after this Chang's family moved from mainland China to the Republic of China in Taiwan. She grew up in Taiwan, attending school there and then studying at the National University of Taiwan. She received her B.S. from the National University in\n1970\nand then went to the United States to study for her doctorate. In\n1974\nshe was awarded a Ph.D. from the University of California, Berkeley, for a thesis written with Donald Sarason as her advisor. In her thesis, Chang worked on problems in classical analysis, in particular the study of boundary behaviour of bounded analytic functions on the unit disc.\nAfter receiving her doctorate, Chang was appointed as an assistant professor at the State University of New York at Buffalo for the academic year\n1974\n-\n1975\n. Following this she was appointed\nHedrick\nAssistant Professor at the University of California at Los Angeles until\n1977\nwhen she moved to the University of Maryland as an assistant professor. She was a Sloan Fellow during the year\n1979\n-\n1980\n.\nIn\n1980\nChang returned to the University of California at Los Angeles as an associate professor, being later promoted to full professor. She was an invited speaker at the International Congress of Mathematicians at Berkeley in\n1986\n. During\n1988\n-\n1989\nshe was also a full professor at the University of California, Berkeley.\nChang's research interests include the study of certain geometric types of nonlinear\npartial differential equations\n. She also studies the related extremal inequalities and problems in isospectral geometry.\nPerhaps Chang's greatest honour was the award of the\n1995\nRuth Lyttle Satter Prize in Mathematics. The prize is awarded every two years to a woman who has made an outstanding contribution to mathematics research in the previous five years. The award is valued at $\n4\n,\n000\n. Chang received the prize at the\nAmerican Mathematical Society\nmeeting in San Francisco in January\n1995\n. The citation for the prize read:-\nThe Ruth Lyttle Satter Prize is awarded to Sun-Yung Alice Chang for her deep contributions to the study of partial differential equations on Riemannian\nmanifolds\nand in particular for her work on extremal problems in spectral geometry and the compactness of isospectral metrics within a fixed conformal class on a compact\n3\n-manifold.\nOn receiving the prize Chang spoke about her work\n(\nsee\n[\n1\n]\n)\n:-\nIt is an honour for me to receive the prize. Since all the work cited above is joint work with my coauthors\n(\nPaul Yang for the most part, but also Tom Branson and Matt Gursky\n)\n, I would like to express my indebtedness to them.\nThe problems which I have been working on in the past few years are mainly connected with the study of extremal functions of Sobolev inequalities. Such functions play an important role in the study of the blow-up phenomenon in a number of problems in geometry. Following the early work of J Moser and influenced by the work of\nT Aubin\nand\nR Schoen\non the Yamabe problem, P. Yang and I have solved the partial differential equation of Gaussian/scalar curvatures on the sphere by studying the extremal functions for certain variation functionals. We have also applied this approach in conformal geometry to the isospectral compactness problem on\n3\n-manifolds when the metrics are restricted in any given conformal class. More recently we have been studying the extremal metrics for these functionals. We are working to derive further geometric consequences. This latter piece of work is a natural extension of the earlier work by\nOsgood\n-Phillips-Sarnak on the log-\ndeterminant\nfunctional on compact surfaces.\nChang also spoke about the position of women in mathematics research and how things are changing rapidly:-\nSince the Satter Prize is an award for women mathematicians, one cannot help but to reflect on the status of women in our profession now. Compared to the situation when I was a student, it is clear that there are now many more active women research mathematicians. I can personally testify to the importance of having role models and the companionship of other women colleagues. However, I think we need even more women mathematicians to prove good theorems and to contribute to the profession.\nIn\n1998\n, in addition to her Professorship at the University of California, Los Angeles, Chang was appointed Professor at Princeton University. The appointment at the University of California ended in\n2000\n. Chang is married to Paul Yang, also a Professor of Mathematics at Princeton University; they have one daughter and one son.\nChang has received many honours in addition to the Ruth Lyttle Satter Prize in Mathematics which we described above. She was an Invited Speaker at the International Congress of Mathematicians held in Berkeley in\n1986\n, and a Plenary Speaker at the International Congress of Mathematicians held in Beijing in\n2002\n. She held a John Simon Guggenheim Memorial Foundation Fellowship in\n1999\n-\n2000\nand served on the Steele Prize Selection Committee of the\nAmerican Mathematical Society\nduring\n2001\n-\n2004\n. On\n28\nApril\n2009\nthe\nNational Academy of Sciences\nannounced that Chang had been elected a member.\nIn June\n2009\nChang was one of the organisers of '\n2009\nthe Program for Women and Mathematics' held at the Institute for Advanced Study at Princeton. The course was entitled \"Geometric PDE\" and described using analytic tools like that of partial differential equations to solve problems in geometry. Chang gave the Advanced Lecture Course which studied:-\n... model differential equations like that of the Gaussian curvature equations on compact surfaces, the prescribing curvature equations and the evolution equations related to the curvature flows.\nAs to her hobbies, Chang lists reading novels, taking walks and listening to music.",
  "math_areas": [
    "Geometry"
  ]
}