{
  "nome_completo": "Svetlana Yakovlevna Jitomirskaya",
  "nome_curto": "Svetlana Jitomirskaya",
  "ano_nascimento": "1966",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jitomirskaya/",
  "lugar_nascimento": "Kharkov, Ukraine",
  "lugar_morte": null,
  "biografia": "Svetlana Jitomirskaya\nwas born into a Jewish family of mathematicians. Her father, Yakov I Zhitomirskii, and her mother,\nValentina Mikhailovna Borok\n, were both professors of mathematics in Kharkov. Svetlana had an older brother Michail Zhitomirskii who was also a talented mathematician so her parents encouraged her to take an interest in subjects other than mathematics\n[\n9\n]\n:-\nBy the time I was born both of my parents were already full professors\n(\nin a society where this title commanded a lot of respect\n)\n. My mother was certainly the most prominent female mathematician in the country. Having raised my older brother who was clearly gifted in mathematics, my parents thought that one more mathematician in our family would be too many. They encouraged me to get interested in a variety of things, and I started to lean seriously towards humanities. I wrote some prize-winning poetry and won some national high-school competitions in Russian literature. I planned a future studying\n(\nif not writing\n)\nRussian poetry.\nIn\n[\n4\n]\nshe explained why she thought her mother tried to steer her away from mathematics:-\n[\nMy parents\n]\nloved me very much, and they wanted my happiness. And my mom probably thought that mathematics would not be a good path to that. All her friends were mathematicians. She was friends with the parents of\nVladimir Drinfeld\n, a child prodigy who could do maths at age\n6\nthat really made people's jaws drop. She saw what it meant for a child to have talent in maths, and she didn't observe anything close in me. She probably thought that I didn't have enough talent to be successful - especially as a woman.\nWhen she was about ten years old, Svetlana\ntook her love of poetry to a new level, but it was not quite the success she hoped\n[\n4\n]\n:-\nI started attending a literature studio led by a famous children's poet. That was a very, very important part of my childhood. I always felt that the studio helped create my personality and who I am. But after a critique of one of my poems, I became very shy about sharing my poetry. I kind of unlearned to write, but learned to read. I learned to see things in poems that others didn't.\nJitomirskaya's mother then tried to encourage her daughter to consider to consider a career as a medical doctor. When she realise her daughter was frightened of blood, she thought psychology would be the answer and bought her books on that topic. Jitomirskaya still believed the humanities were the subjects for her, but a desire to study mathematics, however, came about in an unexpected way. Let us quote Jitomirskaya's own description of how she ended up studying mathematics at university rather than humanities\n[\n9\n]\n:-\n... at the age of\n14\n, I fell in love with a boy I met during a summer vacation. He lived far away\n(\nin Moscow\n)\n, and when, after about a year, his letters started to get shorter and more seldom, I realised that I had to go to Moscow. I was younger than my classmates, and only turned\n16\nafter graduating from high school. The only way for me to go to Moscow was through entering Moscow State University which was an almost impossible task. Moscow State University was notorious for its limiting anti-Jewish quotas. Jewish applicants were subjected to extremely difficult questions during the oral exams to make sure that Jews did not comprise more than\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n% of the student body. My chance was minuscule in any discipline, but mathematics seemed a much better bet than humanities due to a much smaller\n(\nby about a factor of three\n)\ncompetition and higher objectivity. As a result I spent my last year of high school preparing for that oral exam in mathematics. I think during that year I solved all the tricky elementary problems there were, and then some. I took each problem personally and attacked it as if my future happiness depended on whether I solved it or not. I was accepted at Moscow State University; however, I cannot view it as a personal victory as I would have liked. I did not get to show a fraction of my skills at that oral exam since I was not subjected to that \"Jewish\" treatment\n(\nperhaps, due to my parents' connections\n)\n. However, something happened to me during that extensive preparation, as I started to love the process.\nIn fact although Jitomirskaya had been pushed away from mathematics by her mother when she was at school she was, of course, surrounded by mathematician friends of her parents. She had enjoyed attacking the \"challenge problems\" every time she moved on to a new textbook but this was not her only experience at problem solving. The family would enjoy long walks and they had a standard routine that Jitomirskaya's mother would pose a logic puzzle which, when it was not solved by the end of the walk, sometimes continued to be a talking point for their next few walks. Jitomirskaya was keen to solve these puzzles and would get great satisfaction in finding the solution.\nJitomirskaya went to Moscow to be close to Vladimir A Mandelshtam who\n[\n9\n]\n:-\n... still recalls how he once had a one-day break from a month-long mandatory labour at a collective farm. He travelled all night to see me, only to have to wait for another three hours since I didn't want to miss a lecture on differential equations by\nVladimir Igorevich Arnold\n. We did, however, get married almost as soon as I reached the legal age. Yet on the morning of my wedding, I sneaked out to listen to a lecture by Tom Spencer on his recently developed multi-scale analysis. Still, by the time I finished the undergraduate school, I was already a proud mother of a beautiful daughter, Olga.\nAnti-Semitism, however, was a problem for Jitomirskaya throughout her undergraduate years\n[\n4\n]\n:-\nIf the nationality listed on your internal Soviet passport said you were Jewish, many doors were closed for you. So I had to hide my Jewish identity. My passport said \"Ukrainian\" when it should have said I was Jewish. And I lied about my father's Jewish patronymic on my application. I was actually scared during my years in university that it would be discovered, and I would be expelled. While I was in university, I also got married, and my husband's name is very obviously Jewish. I knew that with such a husband, I had zero chance of going to graduate school. So I hid that I got married from everyone except family and his friends. Even when I became pregnant a couple of years later, I didn't tell anyone, even though it was considered shameful then to be pregnant without being married.\nJitomirskaya completed her undergraduate studies in\n1987\n, graduating with distinction having written the thesis\nLocalization problems in the kicked rotor model\n. She continued to study at Moscow State University for her doctorate where her thesis advisor was\nYakov Grigor'evich Sinai\n, who had also advised her during her undergraduate studies. At first her research did not go well, perhaps partly because her mother's attitude meant that she lacked confidence in her research abilities and partly because\nSinai\nsuggested she tackle really hard problems. Once she made progress, she became confident and started publishing some excellent papers.\nShe was appointed as a Researcher at the International Institute of Earthquake Prediction Theory and Mathematical Geophysics in Moscow in\n1990\n, the Institute where her husband worked. Jitomirskaya was awarded a doctorate from Moscow State University in\n1991\nfor her thesis\nSpectral and Statistical Properties of Lattice Hamiltonians\n. She already had several papers in print before completing her thesis, such as\nThe singular spectrum and scale invariance for a Schrödinger operator with a binary almost periodic potential\n(1990)\n. Her husband Vladimir Mandelshtam was also awarded a doctorate in\n1991\nand in that year they had a joint paper published, namely\nThe Bohm-Aharonov problem on a square lattice\n. They gave the following summary of the results of this paper:-\nWe find an explicit expression for the\nGreen\nfunction of the\nSchrödinger\noperator that describes the motion of an electron on a square lattice in a magnetic field with a flow that runs through a single cell. We prove that the nontrivial component of the\nGreen\nfunction, equal to the contribution of the paths that wind around the singularity, is a compact operator. We also apply the method to find partition functions, over ensembles of paths on the lattice, that are connected with the winding number of the fixed point.\nIn\n1991\nJitomirskaya also published\nSingular spectral properties of a one-dimensional Schrödinger operator with almost periodic potential\n,\nSpectral properties of one-dimensional almost periodic operators\nand, with her husband Vladimir Mandelshtam,\n1\nD-quasiperiodic operators. Latent symmetries\n. Also in\n1991\nwith her husband, Alexander Belov and Yu E Lozovik, she published\nAnyon gas on a lattice\n(\nRussian\n)\n.\nIn\n[\n9\n]\nJitomirskaya explains how she came to leave Russia and move to the United States. In\n1990\nthe Brazilian-American mathematician Abel Klein\n(\nborn\n16\nJanuary\n1945\nin Rio de Janeiro\n)\n, from the University of California at Irvine, visited\nYakov Sinai\nin Moscow. Klein worked on mathematical physics, particularly random\nSchrödinger\noperators. Jitomirskaya was given the task of assisting him during his visit\n[\n9\n]\n:-\nI guess I did well since he said I would be welcome to come to Irvine, to which invitation I did not pay much attention since I had no intention of leaving Moscow. Vladimir and I were expected to get our PhD's in\n1991\n, and we had nice Moscow jobs organised for us by our advisors. Not that these jobs were paying much, but we cared even less back then. We had no idea about a world where people would actually apply for jobs. However, in\n1991\n, Vladimir was offered an\n(\nunsolicited by him\n)\npostdoctoral position at the University of Southern California. We studied the map and realised Irvine was in Southern California too. We thought it would be fun to spend a year in California. I then happily informed Abel that I was ready to accept his \"offer\" from a year ago. That was in April\n1991\n. Interestingly, he still managed to find some support for me for a year. My first job title at UCI was a \"half-time lecturer\". During the first couple of months on the job, I so impressed Abel with my knowledge of multi-scale analysis\n(\nremember my wedding day?\n)\nthat he went on a crusade to keep me at the University of California Irvine forever.\nAppointed as a Visiting Assistant Professor at the University of California at Irvine in\n1992\n, Jitomirskaya published the joint paper\nIsing model in a quasiperiodic transverse field, percolation, and contact processes in quasiperiodic environments\nwith Abel Klein in the following year. She explained about quasiperiodic operators in\n[\n9\n]\n:-\nI work on the spectral theory of\nSchrödinger\noperators. Up until the mid\n70\ns the kind of spectra most people had in mind in the context of this theory were spectra occurring for periodic potentials and for atomic and molecular Hamiltonians. Then evidence started to accumulate that \"exotic\" spectral phenomena such as singular continuous,\nCantor\n, and dense point spectrum do occur in mathematical models that are of considerable interest to theoretical physics. One area where such exotic phenomena are particularly abundant is quasiperiodic operators, and a large part of my research is centred around those. Quasiperiodic operators feature a fascinating competition between randomness\n(\nergodicity\n)\nand order\n(\nperiodicity\n)\n, which is often resolved on a deep arithmetic level. The richness of the corresponding spectral theory can be breathtaking. Mathematically, the methods involved include a mixture of ergodic theory, dynamical systems, probability, functional and harmonic analysis. The interest in those models was enhanced by strong connections with some major discoveries in physics, such as integer quantum Hall effect, experimental quasicrystals, and Quantum chaos theory. Quasiperiodic operators provide central or important models for all three.\nAfter holding a Visiting Assistant Professorship for two years she became an Assistant Professor in\n1994\n. In that year she was an invited lecturer at the XI International Congress of Mathematical Physics in Paris where she gave the lecture\nEverything about the almost Mathieu operator\n. In\n1996\nshe took leave from the University of California to spend nine months as a Visiting Assistant Professor at the California Institute of Technology. Also in\n1996\nshe was awarded an A P Sloan Research Fellowship. This was the first of many honours, awards and prizes which she won. We give information about\n19\nsuch honours at\nTHIS LINK\n.\nReturning to the University of California at Irvine, she was promoted to Associate Professor in\n1997\nand to full professor in\n2000\n.\nJitomirskaya has received prestigious awards for her outstanding contributions. She was invited to address the International Congress of Mathematicians at Beijing in August\n2002\n, lecturing on\nNonperturbative localization\n. She summarised the lecture as follows\n[\n10\n]\n:-\nStudy of fine spectral properties of quasiperiodic and similar discrete\nSchrödinger\noperators involves dealing with problems caused by small denominators, and until recently was only possible using perturbative methods, requiring certain small parameters and complicated KAM-type schemes. We review the recently developed nonperturbative methods for such study which lead to stronger results and are significantly simpler.\nIn\n2003\nshe received an award from the School of Physical Sciences at the University of California at Irvine for Outstanding Contributions to Undergraduate Education. In the following year she received a Distinguished Mid-Career Award for Research and then, in\n2005\n, the Ruth Lyttle Satter Prize in Mathematics from the\nAmerican Mathematical Society\n. The citation reads\n[\n1\n]\n:-\nThe Ruth Lyttle Satter Prize in Mathematics is awarded to Svetlana Jitomirskaya for her pioneering work on non-perturbative quasiperiodic localization, in particular for results in her papers\n(1)\n\"Metal-insulator transition for the almost Mathieu operator\", Ann. of Math.\n(1999)\nand\n(2)\nwith\nJ Bourgain\n, \"Absolutely continuous spectrum for\n1\nD quasiperiodicoperators\", Invent. Math\n(2002)\n. In her Annals paper, she developed a non-perturbative approach to quasiperiodic localization and solved the long-standing Aubry-Andre conjecture on the almost\nMathieu\noperator. Her paper with\nBourgain\ncontains the first general non-perturbative result on the absolutely continuous spectrum.\nIn her response she talked of the influence that many people had on her career\n[\n1\n]\n:-\nI am very grateful to the\nAmerican Mathematical Society\nfor this honour and to the members of the Ruth Lyttle Satter Prize Committee for identifying and selecting me. It is humbling to be on the same list with the past recipients of this prize. I must say that I have never felt disadvantaged because of being a woman mathematician; in fact, the opposite is true to some extent. However, compared to most others, I did have a unique advantage: a fantastic role model from early on - my mother,\nValentina Borok\n, who would have been much more deserving of such a prize than I am now, had it been available in her time. I see my receiving this prize as a special tribute to her memory. It is a pleasure to use this opportunity to say some thanks. It was great to be raised by my parents, and I was lucky to be a student of\nYakov Sinai\n, who was both my undergraduate\n(\nsince\n1984)\nand graduate advisor. I am also very grateful to Abel Klein, whose support and encouragement in the postdoctoral years were crucial for my career. I had many wonderful collaborators, from each of whom I learned a lot. Three of those particularly stand out, as they have influenced my work in a major way. They are, in chronological\n(\nfor me\n)\norder: Barry Simon, Yoram Last, and\nJean Bourgain\n. Each of them has not only introduced new techniques to me and had a visible influence on my style and choice of topics but also provided a special inspiration and changed the way I think about mathematics. I am also grateful to Jean for entering, with his methods and ideas, the area of quasiperiodic operators. That certainly brought this field to a new level and changed how it is perceived by many others. Finally, special thanks go to my family, as I wouldn't have accomplished a fraction of what I did without patience, support, and a lot of sacrifice on their part.\nIn January\n2006\nJitomirskaya gave a plenary address to the Joint\nAmerican Mathematical Society\n/\nMathematical Association of America\nAnnual Meeting in San Antonio and in August of that year she gave a plenary address to the XV International Congress of Mathematical Physics in Rio de Janeiro.\nJitomirskaya was awarded a prestigious Simons Fellowship for\n2014\n-\n2015\nand this enabled her to make outstanding progress with her research. For details of four papers which she worked on while holding the Fellowship, see\nTHIS LINK\n.\nIn\n2018\nshe was elected a fellow of the\nAmerican Academy of Arts and Sciences\nand four years later she was elected to the\nNational Academy of Sciences\n. During these four years she was awarded the Dannie Heineman Prize for Mathematical Physics by the American Physical Society and the American Institute of Physics in\n2020\n, was awarded a second Simons Fellowship for\n2020\n-\n21\n, was a Plenary speaker at the International Congress of Mathematicians\n2022\n, and received the first ever\nOlga Alexandrovna Ladyzhenskaya\nPrize\n[\n18\n]\n:-\n... for her seminal and deep contributions to the spectral theory of almost periodic\nSchrödinger\noperators.\nThe award was made in a session of the International Congress of Mathematicians jointly organised by the World Meeting for Women in Mathematics and the Probability and Mathematical Physics conference in Helsinki on\n2\nJuly\n2022\n. In\n2023\nthe American Academy of Sciences and Letters awarded her their inaugural Barry Prize for Distinguished Intellectual Achievement. There is more information about all these awards at\nTHIS LINK\n.\nBeginning in January\n2023\n, Jitomirskaya joined the Georgia Institute of Technology as the inaugural Hubbard Chair Professor in the School of Mathematics\n[\n16\n]\n:-\nThe College of Sciences is pleased to welcome Svetlana Jitomirskaya, Distinguished Professor at the University of California, Irvine, and a prize-winning mathematician, as the inaugural Hubbard Chair Professor in the School of Mathematics at the Georgia Institute of Technology. Jitormirskaya will arrive on campus in January\n2023\n.\n\"The School of Mathematics is just delighted to welcome Professor Jitomirskaya,\" said Michael Wolf, professor and chair of the School of Mathematics. \"We had hoped that the Hubbard Chair would be transformational for the School of Mathematics, and the appointment of Svetlana to this position exceeds our wildest ambitions. Known for her penetrating insights into mathematical physics and dynamics, she adds to our already premiere presence in mathematical physics - an additional depth that rivals any other such centre in North America.\"\n...\n\"There is no better choice than Svetlana Jitomirskaya to occupy this inaugural Chair,\" added Jean Bellissard, professor emeritus in the School of Mathematics at Georgia Tech, \"as she is both a worldwide recognised expert in analysis, and widely appreciated among her students and her university for her dedication to teaching mathematics at the highest level of excellence.\"\n\"Mathematics progresses through a sustained conversation among a community of scholars, and Svetlana will deepen and broaden that dialogue for our scholars while exciting and inspiring our students,\" Wolf said.\nJitomirskaya continues to hold her professorship at the University of California Irvine but, from the autumn of\n2023\n, she was also named as the Richard and Rhonda Goldman Distinguished Chair and Professor of mathematics at University of California Berkeley.\nFor many years her main interest outside mathematics was bringing up her three children. As they became older she found time for other activities such as hiking, swimming and going for cycle runs\n[\n4\n]\n:-\nI swim year-round in the Pacific Ocean, and especially like swimming in cold water - you really get a euphoric sensation out of it - in a beautiful setting, like at sunrise or sunset. And I still read poetry.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Logic",
    "Statistics"
  ]
}