{
  "nome_completo": "Szolem Mandelbrojt",
  "nome_curto": "Szolem Mandelbrojt",
  "ano_nascimento": "1899",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mandelbrojt/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Paris, France",
  "biografia": "Szolem Mandelbrojt\n's parents were Saloman Mandelbrojt and Miriam Rabinowicz. He was born into a Jewish family, with the two sides coming from Lithuania. He was educated in Warsaw and Kharkov where he was greatly influenced by\nSergi Bernstein\n, completing his education to first degree level before going to France where he undertook research. He was awarded his doctorate from the Université de Paris\n(\nSorbonne\n)\nin\n1923\nfor a thesis inspired by\nJacques Hadamard\n. Others who strongly influenced Mandelbrojt after he arrived in Paris were\nÉdouard Goursat\n,\nHenri Lebesgue\n,\nPaul Montel\n, and\nÉmile Picard\n. Mandelbrojt and\nHadamard\njointly published\nLa série de Taylor et son prolongement analytique\nⓉ\n(\nThe Taylor series and analytic continuation\n)\n, a monograph which covered the topics in classical analysis which Mandelbrojt had studied for his doctorate.\nMandelbrojt was awarded a Rockefeller Fellowship which enabled him to spend\n1924\n-\n26\nin the United States. He remained in the United States as a lecturer at the Rice Institute in Houston during\n1926\n-\n27\nand published\nModern researches on the singularities of functions defined by Taylor's series\nin a Rice Institute Pamphlet\n(1927)\n. Returning to France, Mandelbrojt was appointed Maître de Conférences at the University of Lille during\n1928\n-\n29\n. In\n1929\nhe was professor in the Faculty of Science at Clermont-Ferrand and there he worked with\nRené de Possel\n(\nwho was appointed in\n1933)\n. They would go to Paris to attend the Séminaire de mathématiques in the Institut Henri-Poincaré every second Monday. This gave them the chance to visit bookstores and libraries as well as meet up with other friends which they made during their studied in Paris. They met regularly for lunch with their friends at the Café Capoulade in Boulevard Saint-Michel near the Luxembourg Gardens and it was here that he became one of the founder members of the\nBourbaki\ngroup. Mandelbrojt made very considerable contributions to\nBourbaki\nin its initial stages but later dropped out.\nMandelbrojt published an important book\nSéries de Fourier et classes quasi-analytiques de fonctions\nⓉ\n(\nFourier series and quasi-analytic classes of functions\n)\nin\n1935\n. He continued working on this topic in collaboration with\nHenri Cartan\n. He was appointed as professor of mathematics at the Collège de France in\n1938\nbut after the fall of France in June\n1940\nafter the start of World War II, he was helped by the programme of Louis Rapkine to escape to the United States. Under German occupation he was in great danger due to his Jewish background, for quickly French laws against the Jews were put in place. Back in the United States he returned to the Rice Institute in Houston. He published\nAnalytic functions and classes of infinitely differentiable functions\nas a Rice Institute Pamphlet of\n142\npages in\n1942\n. Isaac Schoenberg, reviewing the Pamphlet, writes:-\nThe present lectures give an excellent account of the modern theory of classes of infinitely differentiable functions of a real variable and may be regarded as a second edition of the author's book \"Séries de Fourier et classes quasi-analytiques de fonctions\" to include the work of the author and of\nHenri Cartan\nsince that date.\nContinuing to work at the Rice Institute during World War II, Mandelbrojt continued to publish important work In\n1944\nhe published a series of lectures he had given at the Institute under the title\nDirichlet series:-\nThis monograph consists of a series of lectures delivered by the author and is not a complete treatment of general\nDirichlet\nseries. It is devoted instead to certain special topics which have interested the author and to which he has contributed many papers.\nAfter World war II ended, Mandelbrojt was able to return to France and to his chair at the Collège de France. He continued as association with the Rice Institute, howver, and continued to publish work in their Rice Institute Pamphlet series. He published in that series General theorems of closure in\n1951\nwhich presented results concerning closure of translations and closure of linear combinations of derivatives of a function. In the following year he published\nSéries adhérentes, régularisation des suites, applications\nⓉ\n(\nAdherent series, regularization sequences, applications\n)\nin Paris, then in\n1958\nComposition theorems\nin the Rice Institute Series. The basic ideas in this topic are:-\n... various density functions for sets of positive integers, adherent series, the\nFourier\n-\nCarleman\ntransform and the spectrum of a function defined by means of this transform. ...\nIn\n1969\nMandelbrojt published\nSéries de Dirichlet. Principes et méthodes\nⓉ\n(\nDirichlet Series. Principles and methods\n)\nwhich again puts into more refined form mch of what he had published over the preceeding years, and reported on the progress that he had made on topics such as Picard theorems, composition theorems, continuability and location of singularity results.\nMandelbrojt retired from the Collège de France in\n1972\n. We should mention an important contribution which he made in the years just before he retired, namely his work with\nMaurice Fréchet\n,\nPaul Levy\n, and\nLaurent Schwartz\non the Committee formed to publish the works of\nJacques Hadamard\n. Four volumes containing\n2296\npages of\nHadamard\n's work was published by them in\n1968\n. A year before that, in collaboration with\nPaul Levy\n,\nB Malgrange\n, and P Malliavin, he published\nLa vie et l'oeuvre de Jacques Hadamard\nⓉ\n(\nThe life and work of Jacques Hadamard\n)\n(1865\n-\n1963)\n.",
  "math_areas": [
    "Analysis"
  ]
}