{
  "nome_completo": "Thomas Jefferson Jackson See",
  "nome_curto": "T J J See",
  "ano_nascimento": "1866",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/See/",
  "lugar_nascimento": "Montgomery City, Missouri",
  "lugar_morte": "Oakland, California, USA",
  "biografia": "T J J See\nentered the University of Missouri in\n1888\n. Peterson writes\n[3]\n:-\nThe start of See's career at the University was inauspicious. The scholastic record shows he began mathematics poorly, although his subsequent grades in mathematics, science and most other subjects were excellent.\nJoseph Ficklin, the Professor of Mathematics at the University of Missouri, encouraged See to spend time at the Laws Observatory and he undertook work there during the summer vacations in\n1887\nand\n1888\n. See graduated from Missouri in\n1889\nand went to Germany to undertake research. Sheehan writes\n[4]\n:-\n...\n[\nin Germany\n]\nhe studied with the best, including the famous experimental physicist\nHermann Helmholtz\n. He received a doctorate in astronomy from the University of Berlin. His fellow students considered him \"a very capable fellow in some directions, but ... very peculiar.\"\nHe was awarded a doctorate from the University of Berlin in\n1892\nand returned to the United States to take up a position at the new University of Chicago.\nSee's initial appointment at Chicago was as an Instructor, working under George Ellery Hale. The expected promotion never came and See left Chicago in\n1896\nto take up an appointment at the Lowell Observatory. While at Chicago, See had made a study of the binary star system\n70\nOphiuchi and from anomalies in the orbits had deduced a presence of a third star in the system. He published his findings in\nThe Astronomical Journal\n(1896)\nin a paper entitled\nResearches on the orbit of\n70\nOphiuchi, and on a periodic perturbation in the motion of the system arising from the action of an unseen body\n. This would lead See into major difficulties as we explain below.\nAt Chicago See had poor relations with his colleagues and this was, if anything, somewhat worse at the Lowell Observatory. See is now seen as a tragic figure, even a comic one by some authors, yet others felt that he was somewhat hard done by. For example Esa Ruoho writes:-\nIt has been said that See had the unfortunate tendency \"to come on too strongly\" with his theories which was usually interpreted by his astronomer colleagues as being \"arrogant egotism\" rather than \"studied conviction\" which it apparently was.\nPeterson, however, writes\n[3]\n:-\n... co-workers and superiors appear to have been repelled by See's intense egotism, his inability to work with others, his refusal to operate within established codes of conduct at each institution, and questions arising from both the source and the reliability of his scientific work.\nTo indicate that See was in fact an outstanding observer let us note that while at the Lowell Observatory he used the\n24\n\" telescope to observe the star known as HDS\n3147\nwhich he claimed was a double star with the angle between the components being\n308\n.\n3\n°  and the separation being\n0\n.\n2\n\". He published the result in\nThe Astronomical Journal\nand it was only after the Hipparchus satellite measured the binary in\n1997\nat\n303\n.\n0\n°  and\n0\n.\n226\n\" that See's old paper was noticed and the accuracy of his observations\n(\nwhich had been essentially ignored\n)\nwere realised.\nSee was dismissed from his position at the Lowell Observatory in\n1898\nand, in the following year, appointed to the United States Naval Observatory in Washington D.C. In\n1899\n, F R Moulton published\nThe limits of temporary stability of satellite motion, with an application to the question of the existence of an unseen body in the binary system\n70\nOphiuchi\nin\nThe Astronomical Journal\n. This paper showed that the triple star system postulated by See in his\n1896\npaper could not exist as the orbits would not be stable. See reacted by writing an abusive reply which, after editing\nThe Astronomical Journal\npublished as\nRemarks on Mr Moulton's paper in A.J.\n461\n. This was to be See's last publication in\nThe Astronomical Journal\nfor, following this incident, he was banned from publishing further. In\n1902\nSee suffered a nervous breakdown and, after teaching for one semester at the United States Naval Academy, he was transferred to a naval shipyard at Mare Island, California:-\nWhile at Mare Island, isolated and alone, See did a little more work in binary stars. However, in this case his work was in the calculation of orbits not their observation .... Most of his work continued to get more eccentric as he worked on his theory of the Aether and one might imagine him feeling marginalized.\nIn\n1913\nWilliam Larkin Webb published\nBrief Biography and Popular Account of the Unparalleled Discoveries of T J J See\n. Webb was an amateur astronomer and newspaper publisher, but many regard the work as having been written by See himself.\nThe Nation\nreviewed the book and took the opportunity to ridicule See:-\nThe infant See, we are told, first saw the light on the\n393\nrd\nanniversary of Copernicus's birth, ...\n[\nand\n]\nshowed himself \"every inch a natural philosopher\" by speculating on the origins of the sun, moon and stars at the tender age of two, never so much as dreaming that he should grow into a little boy with \"methodical methods\", and one day become \"the greatest astronomer in the world\".\nIn December\n1916\nSee joined the\nEdinburgh Mathematical Society\n, giving his address as Professor of the U.S. Naval Observatory, Mare Island, California. He spent much effort in his later years arguing against\nEinstein\n's theory of relativity.",
  "math_areas": []
}