{
  "nome_completo": "Tadeusz Banachiewicz",
  "nome_curto": "Tadeusz Banachiewicz",
  "ano_nascimento": "1882",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Banachiewicz/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Tadeusz Banachiewicz\n's parents were Artur Banachiewicz\n(1840\n-\n1910)\nand Zofia Rzeszotarska\n(1852\n-\n1920)\n. Artur owned an estate at Cychry, near Warsaw, and Tadeusz spent his early years living on the estate. The youngest of his parents' three children, having an older brother and an older sister, Tadeusz attended a High School in Warsaw, the Fifth\nGymnasium\n, graduating in\n1900\nwith a silver medal for outstanding academic achievement. In the same year he entered the Faculty of Mathematics and Physics at the University of Warsaw where his major subject was astronomy.\nPerhaps we should look a little at the political situation at this time in order to understand the times in which Banachiewicz lived. Poland had ceased to become an independent country in\n1795\nwhen it was divided between Russia, Prussia and Austria. Warsaw was controlled by the Russians and, after various unsuccessful uprisings by Polish nationalists, a period of Russification followed. In particular, Warsaw University became a Russian university and much was spent on building a new campus. However, various underground groups were set up by the students most of whom were Polish and wanted to see Poland re-established. It was in this atmosphere of Russian domination but underlying Polish nationalism that Banachiewicz grew up. Banachiewicz was a firm Polish patriot.\nWhile he was still an undergraduate, studying astronomy, Banachiewicz published his first paper in\nAstronomische Nachrichten\nin\n1903\n. The paper contained a mathematical description based on observations of an eclipse of a star by the planet Jupiter. He graduated from the University of Warsaw with a bachelor's degree in physical and mathematical sciences in the following year,\n1904\n, having submitted a dissertation discussing certain heliometric measurements that had been made at Pulkovo Observatory with a heliometer made in the workshop of the famous German company Repsold & Sohnes. The instrument was specially designed to allow accurate measurements to be made of the distance from the earth to the sun during a transit of Venus. This dissertation was awarded a gold medal by the Warsaw University Senate. Banachiewicz continued to undertake research at the University. The first comet to be discovered in\n1905\ninterested him for he had developed methods to compute orbits. He started to make calculations but problems at the University forced him to stop. Protests and strikes which marked the beginnings of the\n1905\nRussian revolution took place from January of that year. This prompted unrest among the Polish students at Warsaw University and the authorities closed the University. In\n1906\nBanachiewicz had important papers published by the\nParis Academy of Sciences\nafter being presented to the Academy by\nPoincaré\n:\nSur un cas particulier du probléme des n corps\nⓉ\n(\nOn a particular case of the n-body problem\n)\n; and\nÜber die Anwendbarkeit der Gyldén-Brendelschen Störungstheorie auf die Jupiternahen Planetoiden\nⓉ\n(\nOn the applicability of Gylden-Brendel's perturbation theory of Jupiter to planetoids\n)\n. The second paper studied the three-body problem applied to small bodies near Jupiter. Over the years\n1905\n-\n07\nthe authorities considered moving Warsaw University to Russia but eventually decided to keep it in Warsaw with an even stronger Russian character. Not only was the teaching conducted in Russian but also only Russian professors were to be employed. However, Banachiewicz had already left.\nHe arrived in Göttingen in\n1906\nto begin studying astrophysics under\nKarl Schwarzschild\nwho was both an ordinary professor at Göttingen and the director of the University Observatory. At this time\nSchwarzschild\nwas studying the transport of energy through a star by radiation and published an important paper on radiative equilibrium of the atmosphere of the sun. After spending a year at Göttingen, Banachiewicz went to the Pulkovo Observatory which was situated\n19\nkm south of St Petersburg on the Pulkovo Heights. The Observatory had been founded in\n1839\nand quickly gained fame under its first director, Friedrich Georg Wilhelm von Struve. In\n1878\na\n76\n-centimetre\n(30\n-inch\n)\nrefractor was built there which was the largest telescope in the world at the time. During the year he spent studying at the Observatory\n(1907\n-\n08)\n, Banachiewicz studied under Oskar Backlund\n(1846\n-\n1916)\n, who was head of the Pulkovo Observatory from\n1895\nto\n1916\n. Backlund was an expert in celestial mechanics, working on planetary perturbations and calculating orbits of comets. He had also carried out geodesic studies in Spitsbergen from\n1898\nto\n1900\nso his interests were very close to those of Banachiewicz who spent his time both making astronomical observations and also deepening his knowledge of mathematics. At Pulkovo, Banachiewicz also learnt from Aristarkh Apollonovich Belopolsky\n(1854\n-\n1934)\nwho was a fine instrument maker.\nThe Russian authorities had decided not to move the University of Warsaw to a Russian city, but to reopen it in Warsaw. So Banachiewicz was able to return there, being appointed as an assistant astronomer for the academic year\n1908\n-\n09\n. He then returned to the family estate at Cychry where he worked towards his Master's Degree. He took two examinations in Warsaw in\n1909\nand, in the following year, he went to Moscow where he took another two examinations. He was then employed at the Engelhardt Observatory near Kazan where he spent five years\n(1910\n-\n1915)\nmaking a series of heliometric observations. This Observatory was founded in\n1901\nwith instruments gifted to Kazan University by Vasily Pavlovich Engelhard from his private observatory in Dresden. During these five years, Banachiewicz took part in a scientific expedition to the Volga River Basin to make accurate measurements of terrestrial gravity. In\n1915\nhe submitted an\nhabilitation\nthesis to Kazan University but it was in Dorpat\n(\nnow Tartu, Estonia\n)\nin November\n1915\nthat he defended his habilitation thesis on refraction theory and became a\ndocent\nat Dorpat University. Two years later he again defended a thesis at Dorpat, this time on the\nGauss\nequation, and was promoted to assistant professor. In March\n1918\nhe was promoted to full professor and became director of the famous Dorpat Observatory.\nBanachiewicz's time in Dorpat was one of political upheaval. Konstantin Päts, who had been forced to flee from Estonia in\n1905\nwhen sentenced to death by the Russians, had returned to the country in\n1910\n. Following the\n1917\nRussian Revolution, Estonia decided to declare itself to be an independent country and Päts became the head of a provisional government in October\n1917\n. However, the Russians tried to keep control and appointed a puppet Communist government. While Estonia struggled to free itself from Russian domination, German troops entered the country in February\n1918\n. So Estonia failed to gain independence, control simply changing from Russian domination to German domination. The Russians, however, having lost control of Estonia, moved Dorpat University from Dorpat to Voronezh in western Russia in the summer of\n1918\n. In July Banachiewicz was invited to become the Professor of Astronomy at Voronezh, but a few months earlier, in May, he had been invited to take the chair of astronomy at Kraków University.\nPoland, after\n120\nyears of partition between Russia, Prussia and Austria, became an independent country again in\n1918\n. In March of that year the Soviet government relinquished control of their part of Poland. This, of course, did not by itself unite Poland since World War I was still in progress. In October\n1918\nBanachiewicz returned to Poland and, until March\n1919\n, acted as assistant professor of geodesy at the Warsaw Polytechnic High School. In March\n1919\nhe went to Kraków to take up the position of Professor of Astronomy at the Jagiellonian University. He was also appointed as Director of the Astronomical Observatory. On\n17\nMarch\n1931\n, Banachiewicz married Laura\n(\nor Larysa\n)\nSolohub Dikyj, a Ukrainian poet, in St Nicolas Church in Kopernika Street, Kraków; they had no children. In\n1936\nBanachiewicz organised a series of expeditions to Japan, Greece and Siberia to make solar observations. His highly successful career was temporarily put on hold with the German invasion of Poland in\n1939\n. He was arrested by the Nazis, along with other members of the Faculty of the Jagiellonian University, on\n6\nNovember\n1939\n. He was taken to the Sachsenhausen Concentration Camp near Berlin where he spent three months before being allowed to return to Kraków. He was allowed to resume his astronomical work at his Observatory, which had been renamed 'Die Krakauer Sternwarte' by the Germans.\nAfter World War II ended in\n1945\n, the Jagiellonian University was reestablished. As well as his position at the Jagiellonian University, Banachiewicz also accepted the position of professor of higher geodesy and astronomy at the Kraków University of Mining and Metallurgy. What might have been a very happy time was, however, one of great personal sadness since his wife Laura died on\n28\nMay\n1945\n. Banachiewicz threw himself into his administrative role, aiming to return Kraków Observatory to a leading centre. Observing conditions had not been good in Kraków so, in\n1922\n, Banachiewicz had set up an observing station at Mount Lubomir south of Kraków. This, however, had been burnt down by the Germans on\n15\nSeptember\n1944\n, so after he took up his duties again after the war, Banachiewicz began to look for another solution. In\n1953\nhe obtained permission to set up a new observing station at Fort Skala, a former military site. This project was incomplete at the time of his death in\n1954\nbut it continued and, following Banachiewicz's plans, it became the first site of a Polish radio telescope.\nJan Mietelski writes in\n[\n10\n]\nabout Banachiewicz's scientific contributions:-\nThe areas of Banachiewicz's scientific interest were wide, so one finds his contributions in astronomy, geodesy, geophysics, mathematics, and mechanics.\nIn\n1925\nBanachiewicz introduced the Krakówian calculus which involved a column-by-column multiplication of matrices. The authors of\n[\n6\n]\nwrite:-\nTo simplify matrix computations, Banachiewicz introduced the Krakówian calculus, which greatly simplified and improved computations on calculating machines, which was his principal goal. Theoretically, Krakówians are not as rich in properties as matrices, since they do not involve the associative law. The results obtained by Krakówians can also be obtained by matrices. The Krakówian notation provides formulas that are very easy to remember, which in the conventional form are unwieldy and difficult to memorize. In computations, the Krakówian method makes it possible to obtain results faster and to control the succession of computations. Krakówians reached their zenith of popularity at the start of the\n1950\ns, when calculating machines began to flourish. They found applications in many fields of the natural sciences and technology and simplified many algorithms, freeing formulas from logarithmic ballast.\nThe Krakówian calculus was used by Banachiewicz in many computational techniques that he developed for astronomical purposes, mainly aimed at orbit calculations. For example:\nAn outline of the Cracovian algorithms of the method of least squares\n(1942)\n;\nOn the accuracy of least squares solution\n(1945)\n;\nSur la résolution des équations normales de la méthode des moindres carrés\nⓉ\n(\nOn the resolution of the normal equations of the least squares method\n)\n(1948)\n;\nSur l'interpolation dans le cas des intervalles inégaux\nⓉ\n(\nOn the interpolation in the case of unequal intervals\n)\n(1949)\n;\nA general least squares interpolation formula\n(1949)\n;\nLes cracoviens et quelques-unes de leurs applications en géodésie\nⓉ\n(\nThe Cracovian algorithms and some of their applications in geodesy\n)\n(1949)\n;\nOn the general least squares interpolation formula\n(1950)\n; and\nRésolution d'un système d'équations linéaires algébriques par division\nⓉ\n(\nResolution of an algebraic system of linear equations by division\n)\n(\nwritten much earlier by only published in\n1951\ndue to World War II\n)\n[\n1\n]\n:-\nOne of Banachiewicz's great achievements in theoretical astronomy was the simplification\n[\nusing the Krakówian calculus\n]\nof Olbers' method of determining parabolic orbits.\nBanachiewicz made so many contributions to both theoretical and observational astronomy that one cannot give here more than a quick overview. An important contribution which must be mentioned, however, is the work he did on the planet Pluto\n(\nin\n2006\nPluto was down-graded to dwarf planet status\n)\n. Pluto was discovered by Clyde Tombaugh at the Lowell Observatory in Flagstaff, Arizona, on\n18\nFebruary\n1930\n. Banachiewicz was the first person to compute an orbit for Pluto publishing\nChronique de l'Observatoire Astronomique de Cracovie concernant Pluton\n1930\nmars-août\nⓉ\n(\nChronicle of the Astronomical Observatory of Krakow concerning Pluto in\n1930\nfrom March to August\n)\n(1930)\nand\nSur la détermination de l'orbite de Pluton\nⓉ\n(\nOn the determination of the orbit of Pluto\n)\n(1930)\n. Other astronomers, such as the American Charles Hugh Smiley\n(1903\n-\n1977)\n, visited Kraków to learn about Banachiewicz's method of computing the orbit of Pluto.\nAdam Strzalkowski was a student of Banachiewicz after he took up his teaching position in Kraków after World War II. He writes\n[\n15\n]\n:-\nBanachiewicz delivered excellent lectures, not only for their content, good preparation and delivery, but also because in them Banachiewicz put in front of his audience new scientific problems to solve. Often, immediately after the lecture, we ran into our room and tried to attack these problems. A lot of research work at the Astronomical Observatory in Kraków arose in this way. ... The Professor treated his lectures very seriously. He always taught on Thursdays and on Saturdays,\n6\nto\n8\n. On those days under no circumstances was anyone allowed to bother him. He taught very neatly and systematically. I remember that once he made a mistake in deriving a method and was extremely upset. He did not like questions interrupting the course of his lecture, but he always tried to answer them. If he did not know the answer he postponed the explanation to the next lecture when he could have the answer ready. ... As the professor lectured only twice a week, it was not possible for him to cover all the necessary examinations material on astronomy in lectures. We had to learn from the notes taken in previous years by one of the listeners.... In the first years after the war the subject of Banachiewicz's lectures were: geodesy, practical and spherical astronomy, determination of orbits and celestial mechanics. ... Banachiewicz's examinations were not pleasant. The professor believed that the student should be given a chance, so he asked a question and waited. He could wait a very long time but he did not help, did not try to guide the student to the correct answer.\nBanachiewicz received many honours for his contributions to astronomy and to Polish science. He was elected a corresponding member of The Polish Academy of Arts and Sciences\n(28\nMay\n1920)\n, he was awarded the Finnish Medal, The White Rose\n(1926)\n, he was elected a full member of The Polish Academy of Arts and Sciences\n(1927)\n, he was awarded an honorary doctorate by Warsaw University\n(1928)\nand from Poznań University\n(1938)\n. From\n1932\nto\n1938\nhe was vice-president of the International Astronomical Union. In\n1938\nhe received a bronze medal from the Jagiellonian University for long-service, receiving their silver medal for long-service in the following year. Also in\n1939\nhe was elected to the Padua Academy of Sciences. He was elected to the\nRoyal Astronomical Society\nin\n1946\nand, three years later, received an honorary degree from Sofia University. The\nPolish Academy of Sciences\n(\nPolska Akademia Nauk\n)\nwas founded in\n1952\nand Banachiewicz became a member in its year of founding. He was awarded the Medal of Labour First Class in\n1954\n, shortly before his death. The lunar crater Banachiewicz is named after him, as is the minor planet Banachiewicza discovered in\n1933\n. Other minor planets named by Banachiewicz include: Lorcia\n(\ndiscovered\n1933\nand named in honour of his wife\n)\n; Wawel\n(\ndiscovered in\n1935\nand named after the castle in Kraków\n)\n; and Varsavia\n(\ndiscovered in\n1933\nand named after the Latin name for Warsaw\n)\n.\nAllow me\n[\nEFR\n]\nto end this biography with a personal note. In the years immediately preceding World War II a student\nTadeusz Boleslaw Slebarski\nstudied mathematics and astronomy at Kraków under Banachiewicz. He fled from Poland in\n1939\nwhen the German armies invaded and made a life in Scotland. He was my father-in-law. He always spoke in the highest possible terms about Banachiewicz, as a scientist, as a teacher and as a human being. After the war ended and\nTadeusz Slebarski\nhad been awarded an M.A. from the University of St Andrews with honours in mathematics and astronomy\n(1947)\n, Banachiewicz tried to persuade him to return to Kraków, offering him a position there. Family commitments did not allow my father-in-law to accept, but for the rest of his life he regretted that he had not been able to return to work again with Banachiewicz.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}