{
  "nome_completo": "Tadeusz Ważewski",
  "nome_curto": "Tadeusz Ważewski",
  "ano_nascimento": "1896",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wazewski/",
  "lugar_nascimento": "Wygnanka, Galicia, Austria Empire (now Horishnia Vyhnanka, Ukraine)",
  "lugar_morte": "Rabka-Zdrùj, Poland",
  "biografia": "Tadeusz Ważewski\nparents were Stanisław Ważewski and Anieli Kozlowskich.He was born at a difficult time in Polish history. Poland had been partitioned in\n1772\nand the south, called Galicia, was under Austrian control. Russia controlled much of the country and in the years prior to Ważewski's birth there had been strong moves by Russia to make \"Vistula Land\", as it was called, be dominated by Russian culture. In a policy implemented between\n1869\nand\n1874\n, all secondary schooling was in Russian. Warsaw only had a Russian language university after the University of Warsaw became a Russian university in\n1869\n. Galicia, although under Austrian control, retained Polish culture and only there could Poles receive a Polish education.\nWażewski attended secondary school in Tarnów, today in the south-east of Poland, but at that time part of Austrian controlled Galicia. On graduating from secondary school his intention was to study physics and he entered the Jagiellonian University in Kraków to study that subject. However, he was strongly influenced by\nZaremba\nand changed his course from physics to mathematics.\nUnder\nZaremba\n, Ważewski became interested in set theory and\ntopology\nand decided to study in Paris for his doctorate. This was a typical route for Polish mathematicians of this period, forced to study abroad\n(\nas Poland was partitioned\n)\nmany chose the same route as Ważewski studying in Polish universities in Austrian controlled Galicia and completing their education in France.\nWażewski studied in Paris between\n1921\nand\n1923\ncontinuing his interest in topology acquired during his studies at Kraków under\nZaremba\n. His doctoral dissertation, on topological results relating to dendrites, was examined in\n1923\nby the powerful examining committee consisting of\nBorel\n,\nDenjoy\nand\nMontel\n.\nHaving secured his doctorate, Ważewski returned to the Jagiellonian University in Kraków where he was he was appointed a\ndocent\nin\n1927\n. At about this time his interests shifted away from set theory and topology and he became interested in analysis. In\n1933\nhe was appointed extraordinary professor at the Jagiellonian University.\nKraków was taken by the German army at the beginning of World War II. A German governor was installed in Wawel Castle, and executions of members of the teaching staff of the Jagiellonian University took place. Some\n55\n,\n000\nJews from the city were sent to the Auschwitz-Birkenau concentration camp. Ważewski was sent to the Sachsenhausen- Oranienburg concentration camp north-west of Berlin where he survived for two years. Some were not so lucky, for example\nA Hoborski\nwas a mathematics professor at the Jagiellonian University who died in the Sachsenhausen- Oranienburg concentration camp in February\n1940\n.\nWażewski returned to Kraków and taught in the underground university there despite the severe risk to his life. In\n1945\nKraków was liberated in a surprise attack made by Soviet forces. Ważewski was appointed a full professor at the Jagiellonian University and put all his efforts into restoring the educational system which had been destroyed.\nWażewski made important contributions to the theory of ordinary\ndifferential equations\n,\npartial differential equations\n,\ncontrol theory\nand the theory of analytic spaces. The contribution for which he is most famous was made after his appointment as professor at the Jagiellonian University after the end of World War II.\nKuratowski\nexplains in\n[\n1\n]\nhow his idea:-\n... was to bring him fame and lead to the development of a new school of differential equations. ... he succeeded in applying with amazing effect the topological notion of retract\n(\nintroduced by\nK Borsuk\n)\nto the study of the solutions of differential equations.\nWażewski was invited to explain his ideas in a plenary address at the International Congress of Mathematicians in Amsterdam in\n1954\nand\n[\n1\n]\n:-\nLefschetz\nconsidered his method of retracts one of the most important achievements in the theory of differential equations since the war.\nWe mentioned above that Ważewski worked in control theory. His interest in that topic began around\n1960\nand he published a series of important papers on the topic through the\n1960\ns. His work on the time optimal control problem, to which he took a topologically oriented approach, is described in\n[\n4\n]\n. By this time he was heading his own school of mathematics which was highly successful because of the\n[\n1\n]\n:-\n... broad scope of his problems, his skill in putting forward deeply motivated questions and his great teaching talent.\nKuratowski\nalso comments in\n[\n1\n]\nabout Ważewski's personality describing him as:-\n... gifted with immense qualities of character: his proverbial modesty, kindness, and the great care he showed his students meant that, besides general respect for an excellent scholar, everybody who had the good fortune to know him was charmed by his extraordinary personality.\nIn\n1974\n,\nCzesław Olech\n, Jacek Szarski and\nZofia Szmydt\nwrote an obituary of Tadeusz Ważewski which you can see at\nTHIS LINK\n.\nA list of Ważewski's publications is at\nTHIS LINK\n.",
  "math_areas": [
    "Logic",
    "Topology"
  ]
}