{
  "nome_completo": "Theodore von Kármán",
  "nome_curto": "Theodore von Kármán",
  "ano_nascimento": "1881",
  "ano_morte": "1963",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Karman/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Aachen, Germany",
  "biografia": "Theodore von Kármán\n's parents were Helen Kohn, who was from a leading Bohemian family, and Mór Kármán who was a leading professor of philosophy and education. Theodore's name in Hungarian was von Skőllőskislaki Kármán Tódor\n(\nTódor corresponds to Theodore and in Hungarian the family name precedes the given name\n)\n. Theodore was tutored at home by a former student of    his father and his early education was totally dominated by his father. Partly this was due to Mór being very strict and forceful, but also to the fact that he was an educational expert who practised his ideas on his own son.\nTheodore's three elder brothers realised that he was a mathematical prodigy when he was six years old, for he demonstrated a remarkable ability to perform large mental calculations. Mór, however, fearing that his son would become a freak who ended up performing mathematical tricks, insisted that Theodore be kept away from mathematics for several years, requiring that he should study geography, history and literature. When he was nine years old Theodore entered the Minta\nGymnasium\nin Budapest. He certainly did not escape his father's educational theories in any way by attending this school, for it was one which had been set up according to his father's ideas for educating the brightest children.\nIn the year that Kármán completed his education at the Minta Gymnasium he won the\nEötvös\nPrize for the best student in mathematics and science in the whole of Hungary. It seemed a wonderful position from which to launch his mathematical studies which is precisely what he wished to do, but his father had other ideas for him and so he was steered towards an engineering course at the Palatine Joseph Polytechnic in Budapest\n(\nthis later became the Technical University of Budapest\n)\n. Kármán's father had a nervous breakdown in the year in which he began his engineering course but this only made it totally impossible for Kármán to go against his father's wishes. He graduated in\n1902\nfrom the Palatine Joseph Polytechnic with a degree in mechanical engineering, having written a dissertation on\nThe motion of a heavy rod supported on its rounded end by a horizontal plane\n. It is interesting to note that despite Kármán's great theoretical talents, he was not a skilled experimenter. Although it is somewhat harsh to say that Kármán's father pushed him in the wrong direction since he went on to make such significant advances, nevertheless, his talents were always on the mathematical side of engineering and certainly not on the practical side.\nAfter graduating Kármán had to undertake compulsory military service for one year and he served as an artillery cadet in the Austro-Hungarian army. Then, in\n1903\n, he was appointed as an assistant in hydraulics at the Palatine Joseph Polytechnic, a position which he held for three years. But Kármán also held a second position during these years, for he acted as a consultant for a German locomotive manufacturer. His research at this time was on fluids and on the compression of structures which had wide ranging applications. Of particular importance was his paper published in\n1906\non\nThe theory of buckling and compression tests on long slender columns\n.\nIn\n1906\nhe was awarded a two year fellowship from the\nHungarian Academy of Sciences\nand he left Budapest to study at Göttingen, where he was greatly influenced by\nKlein\n,\nHilbert\nand Prandtl. He made a short visit to Paris in March\n1908\nwhere he watched some pioneering aviation flights which turned his interest to applying mathematics to aeronautics. His research now involved mathematical models for the buckling of large structures, using data obtained through experiments with a large hydraulic press donated to Göttingen by the arms manufacturer Krupp. For this research Kármán was awarded his doctorate in\n1908\nand in the same year he accepted a position as\nprivatdocent\nat Göttingen.\nHis interest in aeronautics now had a real chance to become a research topic with the construction at Göttingen of a wind tunnel for the Zeppelin airship company. In\n1911\n, using results from the wind tunnel, he made an analysis of the alternating double row of vortices behind a flat body in a fluid flow which is now known as Kármán's Vortex Street. The name came from the way that the vortices alternated in position on the two sides of the double row in an arrangement similar to that of street lights on the two sides of a street. However, this was not his only research topic over this period, for he also collaborated with\nMax Born\non a study of vibrating atoms. Their work studied lattice dynamics where they identified the degrees of freedom of a crystal with the normal modes of vibration of the whole body. They used three dimensional\nFourier analysis\nand periodic boundary conditions in this important study.\nIn\n1912\nKármán decided that his prospects of promotion were not good at Göttingen so he accepted the chair of applied mechanics at the Schemnitz mining college in Slovakia\n(\ntoday the town is called Banska Stiavnica\n)\n. This quickly proved an error of judgement since the college was not well equipped nor did it have active researchers. He left after teaching there for one term and returned to Göttingen. In February\n1913\nKármán accepted a post as director of the Aeronautical Institute at Aachen in Germany and also the chair of aeronautics and mechanics at the technical university in Aachen. He began to build a strong research team there as well as making major improvements to the equipment which included a wind tunnel. He began theoretical work on aircraft design, having students and colleagues test the effectiveness of his designs with experimental work.\nWorld War I broke out in\n1914\nand Kármán was called up for military service in the Austro-Hungarian army, and as part of his war work he worked on the design of military aircraft and an improved design for a helicopter. When the war ended in\n1918\nKármán was working in Hungary and he remained there trying to bring in improvements to the teaching of sciences there. The political situation in Hungary at this time, however, was extremely difficult with the country declaring independence from Austria on\n16\nNovember\n1918\n. Surrounding countries took advantage of the situation and Serb, Czech, and Romanian troops moved to take over parts of the country. The political situation made any educational reforms out of the question, so in\n1919\nKármán returned to his previous positions in Aachen. With financial assistance from the leading German manufacturers of aircraft, he began an intense programme of studying the resistance of fluids, turbulence and lift, all leading to better aircraft design\n[\n1\n]\n:-\n... little realising that he was laying the foundations of a new German air force, the Luftwaffe of World War II.\nKármán visited the USA in\n1926\n, at the invitation of the head of the California Institute of Technology, to advise on the design of a wind tunnel. By\n1928\nhe was spending six months each year at Caltech and six months at Aachen, then in\n1930\nhe was asked to be the full-time director of the Aeronautical Laboratory at California Institute of Technology. Despite his love for Aachen, the political events in Germany and in particular the rising anti-Semitism, persuaded him to accept. His mother and younger sister went to California with him. Kármán never married and his mother, then sister, looked after his home for him. The head of Caltech asked him to make the Aeronautical Laboratory\n[\n4\n]\n:-\n... a vehicle to draw the U.S. aviation industry to Southern California and to bring to the campus national pre-eminence in aeronautics.\nIn\n1933\nhe founded the U.S. Institute of Aeronautical Sciences continuing his research on fluid mechanics, turbulence theory and supersonic flight. He studied applications of mathematics to engineering, aircraft structures and soil erosion. His work turned towards research on rockets and, when Germany was seen to have developed rockets for military purposes during World War II, the United States Government put large sums of money into rocket research. In November\n1944\nthe funding was used to set up the Jet Propulsion Laboratory at Caltech with Kármán as director. This laboratory later made major contributions to the space programme.\nIn\n1949\nhe resigned his two positions of director and became professor emeritus at Caltech. He was still very active in giving advice to the U.S. airforce and NATO and played a major role in international conferences on aeronautics.\nKármán received many honours for his outstanding contributions. He received the United States Medal for Merit in\n1946\n, the Franklin Gold Medal in\n1948\n, and was the first to be awarded the National Medal for Science in\n1963\n. He also received honours from France, the Vatican, Germany, Greece, the United Kingdom, Spain and the Netherlands.\nAs to his character, he is described in\n[\n2\n]\nas:-\n... a delightful and witty companion, and loyal to a wide circle of friends.\nIn\n[\n1\n]\nhis contributions are summed up as follows:-\nDespite his many public activities, he never became a great public figure in the way of many inventors, perhaps because theoretical aerodynamics is not a very accessible field to the layman; nevertheless, his work in that field and in rocket research has helped shape both scientific and political history.\nIt would be reasonable to ask how Kármán saw his loyalties having advised many countries on military matters\n[\n1\n]\n:-\nKármán remained unabashed about his lifelong association with military authorities, first in Austro-Hungary, then in Germany, and finally in the United States and NATO. His viewpoint was that of an engineer of an earlier era who may be considered to have discharged his debt to society once he has contrived to \"provide an analysis of what would happen if certain things were done\"; he thought that \"scientists as a group should not try to force or even persuade the government to follow their decisions\".",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}