{
  "nome_completo": "Theodor Molien",
  "nome_curto": "Theodor Molien",
  "ano_nascimento": "1861",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Molin/",
  "lugar_nascimento": "Riga, Russia (now Latvia)",
  "lugar_morte": "Tomsk, USSR",
  "biografia": "Theodor Molien\n(\nor Fedor Eduardovich Molin\n)\nwas the son of Eduard Molien who was a teacher at a Gymnasium in Riga. Theodor attended the\nGymnasium\nwhere his father taught, and from there he entered the Faculty of Physics and Mathematics at the University of Dorpat. Well it is not strictly accurate to call it the University of Dorpat for, although this is its name today, this was not its name when Molien entered. The town, known today as Tartu in Estonia, was known as Derpt up to\n1893\nwhen it became Yuryev although Dorpat was the German name for the town and, for consistency, we shall refer to it as Dorpat.\nMolien graduated from the University of Dorpat in\n1883\nafter studying astronomy under A Lindstedt as well as mathematics, and continued to work there to become a university professor. He was sent to Leipzig University later in\n1883\nas part of his studies, and there he attended lectures by\nKlein\nand wrote a Master's thesis under\nKlein\n's supervision. Molien also attended lectures by\nCarl Neumann\n,\nE Study\n,\nW Killing\nand\nG Scheffers\n, before returning to Dorpat where he submitted his Master's thesis and was examined. After this he became a\nPrivatdozent\nin Dorpat.\nIn his doctoral thesis\nOn higher complex numbers\nwhich was examined in\n1892\n, Molien classified the complex semisimple\nalgebras\n; later\nCartan\nclassified the real semisimple algebras and\nWedderburn\nin\n1907\ngave the result for semisimple algebras over an arbitrary\nfield\n. Molien introduced the idea of a group ring in his study of group representations. Around the same time\nFrobenius\nproduced similar results by different techniques. Molien published important papers such as\nÜber Systeme höherer complexer Zahlen\nⓉ\n(\nOn systems of higher complex numbers\n)\n(1893)\nand\nÜber die Invarianten der linearen Substitutionsgruppen\nⓉ\n(\nOn the invariants of linear substitution groups\n)\n(1897)\n. This last paper is discussed in detail in\n[\n7\n]\n.\nIn a letter written to\nDedekind\non\n24\nFebruary\n1898\n,\nFrobenius\nwrote\n(\nsee\n[\n2\n]\nor\n[\n5\n]\n)\n:-\nYou will have noticed that a young mathematician, Theodor Molien in Dorpat, has considered the group\ndeterminant\nindependently of me. In volume\n41\nof the Mathematische Annalen he published a very beautiful, but difficult, work \"Über Systeme höherer complexer Zahlen\"\nⓉ\n(\nOn systems of higher complex numbers\n)\n, in which he has investigated noncommutative multiplication and obtained important general results of which the properties of the group determinant are special cases. Since he was entirely unknown to me, I have made some inquiries regarding his personal circumstances. Details are still lacking. This much I have already learned: that he is still a\nPrivatdozent\nin Dorpat; that his position there is uncertain and that he has not advanced as far as he would have deserved in view of his undoubtedly strong mathematical talent. I would very much like to interest you in this talented young man; here and there you are virtually privy councillor; if an opportunity presents itself, please think of Herr Molien, and if you have time, look at his work.\nIt is not known whether\nDedekind\nmade any attempts to help Molien with his career in Dorpat. Certainly he did not advance to a professorship so by\n1900\nhe was looking to find such a post elsewhere. He was appointed professor of mathematics in Tomsk at the Technological Institute in\n1900\nand he remained in Tomsk for the rest of his career, moving to the chair of mathematics in Tomsk University in\n1918\n.\nBashmakova points out in\n[\n1\n]\nthat once Molien moved to Tomsk, in west-central Siberia:-\n... he found himself cut off from centres of scientific activity.\nThe outstanding work he did while at Dorpat never seems to have been so successfully followed up once he went to Tomsk. While still in Dorpat, however, Molien studied\nFrobenius\n's work on\ncharacter theory\n(\nas\nFrobenius\nhad studied the work of Molien\n)\nand used it to study polynomial invariants of finite\ngroups\n. Molien studied how many times a given irreducible\nrepresentation\nof a finite group appears in a complete reduction of the representation of the group on the vector space of homogeneous polynomials of degree\nn\nn\nn\nover the complex numbers. He gave a generating function to compute the number of times the irreducible character occurs in\n1898\n.\nEmmy Noether\n, referring to Molien's paper\nÜber Systeme höherer complexer Zahlen\nⓉ\n(\nOn systems of higher complex numbers\n)\n(1893)\n, wrote\n(\nsee for example\n[\n2\n]\n)\n:-\nThe most general theorems about algebras go back to Molien.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}