{
  "nome_completo": "Karl Theodor Reye",
  "nome_curto": "Theodor Reye",
  "ano_nascimento": "1838",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reye/",
  "lugar_nascimento": "Ritzebüttel, near Cuxhaven, Germany",
  "lugar_morte": "Würzburg, Germany",
  "biografia": "Theodor Reye\n's parents were Amalia Augustina Beckmann\n(1810\n-\n1857)\nand Georg Wilhelm Reye\n(1799\n-\n1850)\n. Georg Reye had been born in Ritzebüttel and he lived there all his life, being a local businessman. Theodor was one of his parents' ten children who were all born in Ritzebüttel. He had four older brothers, Auguste\n(\nborn\n1831)\n, Wilhelm\n(\nborn\n1833)\n, Julius\n(\nborn\n1834)\nand Adolf\n(\nborn\n1936)\n. He also had two younger brothers, Otto\n(\nborn\n1840)\nand Arnold\n(\nborn\n1841)\n, and three sisters, Amilie\n(\nborn\n1845)\n, Antoine\n(\nborn\n1845)\n, and Emilie\n(\nborn\n1847)\n. Notice that of Amalia and Georg's ten children, the first seven were boys and the last three girls. Theodor was the only one of his parents' children to follow an academic career, the other boys becoming businessmen like their father or, in the case Adolf, a brewer.\nTheodor attended school in Hamburg, being a pupil at the famous Johanneum. He then studied mechanical engineering at the Polytechnikum in Hannover before continuing his studies at the Polytechnikum in Zürich\n(\nthis institution was later called the Eidgenössische Technische Hochschule or the Swiss Federal Institute of Technology\n)\n. In Zürich, Reye was taught by Kurt Culmann\n(1821\n-\n1881)\n, who had held the Chair of Engineering Sciences since the Polytechnikum was founded in\n1855\n. The Chair of Mathematical Physics at the Polytechnikum in Zürich had been held by\nRudolf Clausius\nsince the founding of the Polytechnikum and, despite the influence of Culmann which we mention below, it was\nClausius\nwho influenced Reye to move from mechanical engineering to mathematical physics. Reye, following\nClausius\n's advice, then went to the University of Göttingen to undertake research for his doctorate in Mathematical Physics. He received a doctorate from Göttingen in\n1861\nfor his thesis on gas dynamics,\nDie mechanische Wärme-Theorie und das Spannungsgesetz der Gase\nⓉ\n(\nThe mechanical heat theory and the power law of gases\n)\n. The background to Reye's thesis is the following. Victor Regnault\n(1810\n-\n1878)\nhad made extremely accurate experiments concerning\nBoyle\n's law, first deduced on purely experimental grounds, which claimed that the product of the absolute pressure and volume of a gas at constant temperature is constant.  Regnault had shown experimentally that the law is only exact within certain limits.\nClausius\nhad made marked contributions to the kinetic theory of gases in\n1857\nwhich provided a theoretical justification of\nBoyle\n's law but there was much dispute over this theory since it assumed an atomic theory which was not widely accepted. Reye's thesis sought to show that Regnault's experimental results were consistent with the kinetic theory of gases and provide further support for\nClausius\n's theories. A couple of years later, Reye wrote a paper\nDie Ausdehnung der atmosphärischen Luft bei der Wolkenbildung\nⓉ\n(\nThe expansion of the atmospheric air in cloud formation\n)\n(1865)\napplying the kinetic theory of gases to the expansion of air during the formation of clouds. It is one of the first applications of the kinetic theory of gases to meteorology.\nWhile undertaking research at Göttingen, he had attended inspiring lectures on partial differential equations by\nBernhard Riemann\n. These lectures had the effect of changing Reye's interests more towards mathematics, although he continued his interest in mathematical physics. After the award of his doctorate, Reye returned to the Polytechnikum in Hannover where he taught for a while before presenting his\nhabilitation\nthesis to the Polytechnikum in Zürich and becoming a lecturer there in\n1863\n. He was promoted to professor in\n1867\nand lectured in Zürich on mathematical physics until\n1870\n. In Zürich he became a colleague of Kurt Culmann, who had taught him as an undergraduate, and it was now Culmann who had a major influence on the direction of Reye's research. The work of\nJean-Victor Poncelet\nand\nKarl von Staudt\nhad inspired Culmann to apply graphical methods to engineering problems. Under this influence, Reye's early interest in mathematical physics and meteorology turned to an interest in geometry while he continued to hold the lectureship in mathematical physics at Zürich. Led towards geometry by his interest in mechanics he began to study graphical statics and avidly read\nvon Staudt\n's work on geometry. Culmann's fundamental monograph\nDie graphische Statik\n(\nGraphical Statics\n)\nwas published in\n1865\nbut Reye was by this time deeply involved in studying geometrical methods similar to the ideas of\nprojective geometry\ncontained in\nvon Staudt\n's\nGeometrie der Lage\nⓉ\n(\nGeometry of position\n)\n(1847)\n. The first volume of Reye's own major work\nGeometrie der Lage\nⓉ\n(\nGeometry of position\n)\nwas published in\n1866\n[\n1\n]\n:-\nStaudt\n's book was considered very difficult to read; Reye's 'Geometrie der Lage' ... was easily comprehended.\nThe second volume of Reye's\nGeometrie der Lage\nⓉ\n(\nGeometry of position\n)\nappeared in\n1868\n. A second edition of the two volume work was published in\n1877\nand\n1880\n. When Reye published a third edition between\n1886\nand\n1892\n, it was as a three volume work and two further three-volume editions were published - the fourth between\n1899\n-\n1910\n, and the fifth between\n1909\n-\n1923\n. A French translation with title\nLeçons sur la géométrie de position\nⓉ\n(\nLessons on the geometry of position\n)\nappeared in\n1881\n-\n1882\n, an Italian edition with title\nLa geometria di posizione\nⓉ\n(\nThe geometry of position\n)\nwas published in\n1884\nand an English translation\nLectures on the Geometry of Position\nin\n1898\n.\nWhile in Zürich, Reye married Marianne Sattler\n(1847\n-\n1933)\nin\n1868\n. They had five children: Katharina\n(\nborn\n1869)\n, Franciska\n(\nborn\n1871)\n, Wilhelm\n(\nborn\n1873)\n, Charlotte\n(\nborn\n1875)\nand Otto\n(\nborn\n1880)\n. Only the first of these children was born in Zürich for, in\n1870\n, the family left Zürich and moved to Aachen in Germany when Reye was appointed to the Chair of Geometry and Graphical Statics at the newly founded Polytechnikum in Aachen\n(\nnow the Rheinisch-Westfälische Technische Hochschule\n)\n. The reason for this move was due to an unhappy situation which had arisen in Zürich. Reye had been an assistant to Joseph Wolfgang von Deschwanden\n(1819\n-\n1866)\n, the professor of descriptive geometry, and taught descriptive geometry at Zürich after Deschwanden became ill. Reye also taught projective geometry believing that the two courses should be linked. However, after Deschwanden's death a new appointment was made to the chair of descriptive geometry, namely\nOtto Wilhelm Fiedler\nand Reye wrote\n(\nin the Preface to the\n2\nnd\nedition of\nGeometrie der Lage\nⓉ\n(\nThe geometry of position\n)\n)\n:-\nUnfortunately, I am now denied contributing to the propagation of my favourite science as a teacher in the way I did before; because recently I was ruthlessly deprived of my course of lectures on projective geometry, so that it could be assigned to the newly appointed professor of descriptive geometry at his request.\nThis unhappy situation for Reye was solved by his move to Aachen. However, he only worked in Aachen for two years before he was appointed to the Chair of Geometry and Mechanics at the Kaiser-Wilhelm University of Strasbourg. This move to Strasbourg was, in many ways, made for patriotic reasons. Germany had captured Strasbourg after a\n50\n-day siege during the Franco-Prussian war of\n1870\n-\n71\nand annexed the city. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strasbourg in\n1872\n. Two mathematics chairs were founded at this time, the first in Mathematics which was filled by\nElwin Christoffel\nand the second in Geometry and Mechanics which was filled by Reye. Both\nChristoffel\nand Reye considered it their patriotic duty to assist in making the University of Strasbourg a German university. At Strasbourg, Reye and\nChristoffel\n[\n2\n]\n:-\n... built a new mathematics department with a solid reputation ... The new institute included one, and later two associate professorships, occupied by George Roth\n(1845\n-\n1904)\n,\nEugen Netto\n(1846\n-\n1927)\n, Karl Schering\n(1854\n-\n1925)\n, Adolf Krazer\n(1858\n-\n1926)\nand Emil Georg Cohn\n(1854\n-\n1944)\n. ... About two dozen candidates received their doctoral degrees in mathematics and astronomy at Strasbourg between\n1872\nand\n1895\n. ... Reye, who was a geometer in the tradition of\nSteiner\nand\nvon Staudt\n, produced about a dozen doctorates during this time. These included B Klein\n(1846\n-\n1891\n; in\n1876)\n, R Krause\n(1879)\n, G Kilbinger\n(1880)\n, St Jolles\n(1857\n-\n1942\n; in\n1883)\n, Th Meyer\n(1884)\n, A Pampusch\n(1886)\n, C Arnoldt\n(1887)\n, C Fink\n(1887)\n, F Schumacher\n(1889)\nand H E Timerding\n(1837\n-\n1945\n; in\n1894)\n. Of these, only Klein, Jolles and Timerding became university professors, namely at Marburg, Berlin\n(\nTechnological University\n)\nand Braunschweig, respectively. The remaining half-dozen were in the field of astronomy.\nReye's contributions to the Mathematical Seminar at the University of Strasbourg are described in detail in\n[\n7\n]\n. He served as rector of the University during the academic year\n1886\n-\n87\n. This required him to give an inaugural address and he chose as his subject\nDie synthetische Geometrie im Altertum und in der Neuzeit\n(\nSynthetic geometry in antiquity and in modern times\n)\n. The lecture was published as a pamphlet in\n1886\nand reprinted in the\nJahresbericht der Deutschen Mathematikervereinigung\nin\n1902\n.\nIn\n1872\nReye published the book\nDie Wirbelstürme, Tornados und Wettersäulen in der Erd-Atmosphäre mit Berücksichtigung der Stürme in der Sonnen-Atmosphäre\nⓉ\n(\nHurricanes, tornadoes and weather pillars in the earth's atmosphere with consideration of the storms in the solar atmosphere\n)\n. This important work on meteorology, which in particular studied cyclones, led to him being offered the role of director of the Hamburg Oceanic Observatory. This, however, was not the type of job that appealed to him for his real love was as an academic teacher. He refused the offer of the post and it was offered instead to Georg Balthasar von Neumayer\n(1826\n-\n1909)\nwho, after setting up a physical observatory in Melbourne, Australia, to study terrestrial magnetism, had returned to Germany when appointed hydrographer to the German Admiralty. After he retired in\n1909\nReye remained in Strasbourg until the end of World War I.\nKarl Geiser\nwrites\n[\n3\n]\n:-\n... the war created grave sorrows in his family; a son who had been under arms for the entire duration of the war came home safely, but a grandson was killed in action.\nHis daughter Katharina had married Ludwig Jost who was appointed Professor of Botany at the University of Strasbourg in the year that Reye retired. After the defeat of Germany in\n1918\n, Strasbourg was returned to France and many Germans were expelled. Reye and his wife moved to Würzburg where they lived with one of their married daughters. Katharina and her husband were also forced to leave Strasbourg and Ludwig Jost was appointed as Professor of Botany at the University of Heidelberg in\n1919\n.\nKarl Geiser\nwrites\n[\n3\n]\n:-\nIn the autumn of\n1918\n, Reye decided to return to the old Germany, hoping that he would be able to spend the last days of his life in peace and quiet. Unfortunately, the relocation created various difficulties, which, when an order was rescinded by a counter-order, turned into the most repugnant delays and eventually forced the eighty year old to carry out the complicated relocation without the help of his son for which he had hoped. At least he could settle down in the comfortable home in Würzburg, which a son-in-law had chosen for him. In May\n1919\nhe was able to celebrate his golden wedding; but the shocks, disappointments and the agitation of the previous months had such a strong after effect that he fell victim to them a few weeks after the anniversary.\nReye's work in geometry included a study of\nconics\n,\nquadrics\nand projective geometry. His\n73\npapers include\nDie algebraischen Flächen, ihre Durchdringungskurven, Schnittpunkte und projektivische Erzeugung\nⓉ\n(\nAlgebraic surfaces, their penetration curves, intersections and projective generation\n)\n(1870)\n,\nÜber algebraische Flächen, die zueinander apolar sind\nⓉ\n(\nOn algebraic surfaces, which are non-polar to one another\n)\n(1874)\nand\nDie Hexaeder- und die Oktaeder-Konfigurationen\nⓉ\n(\nThe hexahedral and octahedral configurations\n)\n(1883)\n. Most material from his papers was eventually incorporated into editions of his books. A configuration of\n12\npoints,\n12\nplanes and\n16\nlines which he published in this last mentioned\n1883\npaper is named after him. This paper was published in the first volume of the new journal\nActa Mathematica\n. Reye's standing as a mathematician is illustrated by the fact that\nGösta Mittag-Leffler\n, the founder of the journal, interrupted his honeymoon so that he could personally speak to Reye and ask for his support for the new journal by submitting a paper for publication. Reye's book\nSynthetische Geometrie der Kugeln, mit einer Einleitung in die analytische Geometrie der Kugelsysteme\nⓉ\n(\nSynthetic geometry of spheres, with an introduction to the analytic geometry of the sphere systems\n)\nwas published in\n1879\nwith an Italian translation being published two years later. This book on spherical geometry did not, however, have the same impact as his classic text\nGeometrie der Lage\nⓉ\n(\nThe geometry of position\n)\n.\nWerner Burau writes in\n[\n1\n]\n:-\nReye treated in detail the theory of conics and quadrics and of their linear systems, that of third degree surfaces and some of the fourth degree, as well as many quadratic congruences and aggregates taken from line geometry. He was one of the leading geometers of his time, and he published a great deal on synthetic geometry.\nIt is not unreasonable to ask why Reye's work is not better known today. Part of the reason must be that some of Reye's work was later interpreted in the geometry set up by\nCorrado Segre\n, in particular it was interpreted in the setting of\nSegre\nmanifolds\n. Reye's work on linear manifolds of projective plane pencils and of bundles on spheres went into the\nSegre\nmanifold setting. Finally we note that although\nDavid Hilbert\nhad a high opinion of Reye's work, their approach to geometry was very different.\nHilbert\nproposed a purely axiomatic method in geometry while Reye rejects everything that cannot be justified with geometric intuition.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}