{
  "nome_completo": "Theon of Alexandria",
  "nome_curto": "Theon of Alexandria",
  "ano_nascimento": "335",
  "ano_morte": "405",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Theon/",
  "lugar_nascimento": "(possibly) Alexandria, Egypt",
  "lugar_morte": null,
  "biografia": "Theon of Alexandria\nworked in Alexandria as a teacher of mathematics and astronomy. We know from his own writings that he observed a solar eclipse on\n16\nJune\n364\nat Alexandria and a lunar eclipse, again in Alexandria, on\n25\nNovember\n364\n. We also know that he made a list of Roman consuls which he continued to make until\n372\n.\nThere is a reference in the\nSuda Lexicon\n(\na work of a\n10\nth\ncentury Greek lexicographer\n)\nwhich states that Theon of Alexandria lived under the Emperor Theodosius I\n(\nwho reigned from\n379\nto\n395)\n. These dates are therefore consistent. The\nSuda\nalso states that Theon was a member of the Museum, which was an institute for higher education set up in Alexandria in\n300\nBC. Again this is possible, but the Museum certainly did not exist much beyond the time of Theon if indeed it existed in his time. On balance it seems reasonable to accept that he was one of its last members.\nTheon was the father of\nHypatia\nand it certainly seems to be the case that he died before she was murdered in\n415\n. There does not seem to be any other evidence which would let us give a more accurate guess of the dates of his birth and death other than these few indications of times when he was certainly working.\nTheon is famed for his commentaries on many works such as\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nand the works of\nEuclid\n. These commentaries were written for his students and some are even thought to be lecture notes taken by students at his lectures. On one work he gave two commentaries and in the preface to the second he explains that he is giving a more elementary account for the majority of his students are unable to understand geometrical proofs. This again confirms that the vigour had gone out of his teaching establishment and indeed the poor quality of students it seemed to be attracting could have been a telling factor in the closure of the Museum\n(\nif as we commented above the\nSuda\nis right in giving that as his institution\n)\n.\nTheon was a competent but unoriginal mathematician. Theon's version of\nEuclid\n's\nElements\n(\nwith textual changes and some additions\n)\nis thought to have been written with the assistance of his daughter\nHypatia\nand was the only Greek text of the\nElements\nknown, until an earlier one was discovered in the Vatican in the late\n19\nth\ncentury. However, now that the Vatican manuscript has been discovered it is possible to see exactly the changes that Theon made in his version.\nThe approach that Theon makes appears to make is to try to improve the earlier manuscript rather than to try to reproduce an accurate reproduction with comments. So he corrected mistakes which he spotted in the mathematics, but unfortunately not all the points that he fails to understand are mistakes, some are perfectly correct. Theon also tried to standardise the way that\nEuclid\nwrites, so when Theon came across an expression which was somewhat different from the norm, he replaced it by the standard form of expression.\nOn the positive side, however, Theon amplified\nEuclid\n's text whenever he thought that an argument was overly brief, sometimes adding propositions to make the text more easily read by beginners. In this he was successful, so much so in fact that his became the standard edition and almost all earlier editions have been lost.\nHeath\nwrites of\nTheon\n's edition of the\nElements\n[\n2\n]\n:-\n.. while making only inconsiderable additions to the content of the \"Elements\", he endeavoured to remove difficulties that might be felt by learners in studying the book, as a modern editor might do in editing a classical text-book for use in schools; and there is no doubt that his edition was approved by his pupils at Alexandria for whom it was written, as well as by later Greeks who used it almost exclusively...\nTheon also produced commentaries on other works of\nEuclid\n. Certainly he produced a commentary on\nEuclid\n's\nOptics\nand on his\nData\n. Theon's commentary on the\nData\nis written at a relatively advanced level and in it Theon tends to shorten\nEuclid\n's proofs rather than to amplify them. The\nOptics\non the other hand is elementary and written in a totally different style and some historians conjecture that it is really a set of lecture notes by one of Theon's students. Many times the manuscript contains a phrase such as \"he said\" and it is thought that a student is indeed writing down what \"Theon said\".\nThe\nCatoptrica\nis a rather different case for here we have a work which on the face of it claims to be written by\nEuclid\n. This however is impossible since the contents are a mixture of work dating from\nEuclid\n's time together with work which is much later than\nEuclid\n's time. The style and elementary nature of the work make authorship by Theon a distinct possibility. If this is the case then again he is writing for his weak students.\nTheon also wrote extensive commentaries on the astronomical works of\nPtolemy\n, both on the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nand the\nHandy tables\n. Again his daughter\nHypatia\nassisted him in the commentary on the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nand this is Theon's most major piece of work.\nIn the preface to his commentary on the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nTheon writes that his intention is to improve on previous commentators\n(\nsee for example\n[\n1\n]\n)\n:-\n... who claim that they will only omit the more obvious points, but in fact prove to have omitted the most difficult.\nHowever, as Toomer points out in\n[\n1\n]\n, this is exactly what Theon himself goes on to do.\nTheon wrote two commentaries on\nPtolemy\n's\nHandy Tables\n. The small commentary only explains how to use the tables while the large commentary explains their construction. The larger commentary has been published recently by Tihon in\n[\n5\n]\nand\n[\n6\n]\n. Although Theon certainly wrote the small commentary after the larger one, since he refers to the larger commentary in the preface to the smaller. However, Tihon discovered that the oldest manuscript which has been preserved, a Vatican manuscript dating from the\n9\nth\ncentury, suggests that Theon never completed the text of his large commentary. This Vatican manuscript is made from an earlier copy of Theon's text which was being used in the year\n463\nin Apamea in Syria.\nAs to Theon's commentary on\nPtolemy\n's\nSyntaxis\nHeath\nwrites\n[\n2\n]\n:-\nThis commentary is not calculated to give us a very high opinion of Theon's mathematical calibre, but it is valuable for several historical notices that it gives, and we are indebted to it for a useful account of the Greek method of operating with\nsexagesimal\nfractions, which is illustrated with examples of multiplication, division, and the extraction of the square root of a non-number by way of approximation.",
  "math_areas": []
}