{
  "nome_completo": "Theodor Schneider",
  "nome_curto": "Theodor Schneider",
  "ano_nascimento": "1911",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schneider/",
  "lugar_nascimento": "Frankfurt am Main, Germany",
  "lugar_morte": "Zähringen, Freiburg, Germany",
  "biografia": "Theodor Schneider\n's parents were Josephine Breidenbach and Joseph Schneider. Joseph owned a fabric store in Frankfurt am Main and it was in that city that Theodor was brought up. After attending elementary school, he studied at the\nHelmholtz\nGymnasium\n. This school, founded in\n1912\n, had a strong emphasis on science so one might have thought that Schneider would want to carry on his study of the sciences after graduating from the Gymnasium in\n1929\n. Indeed he did so, but not until he had made a difficult choice between studying science at university or training to be a concert pianist. He was an exceptionally talented musician and had attended master classes at the internationally famous music academy Dr Hoch's Konservatorium in Frankfurt. He decided, after much thought, to study science at Frankfurt University rather than study piano at the Konservatorium and he enrolled in\n1929\nin physics, chemistry and mathematics courses at the University.\nAt this time Frankfurt University had some extremely talented mathematics lecturers who could inspire their students.\nMax Dehn\n(\nappointed in\n1921)\nheld the chair of Pure and Applied Mathematics,\nPaul Epstein\n(\nappointed in\n1919)\nwas a professor,\nErnst Hellinger\n(\nappointed in\n1914)\nheld a chair,\nOtto Szász\n(\nappointed in\n1914)\nwas a professor, and\nCarl Siegel\n(\nappointed in\n1922)\nheld a chair. Frankfurt University, with this array of teaching talent, was an exciting place when Schneider entered it, and as a consequence the number of students taking mathematics courses had built up over the previous few years. From a position of almost no students in\n1920\n, by\n1928\nthere were\n143\nstudents taking the first semester differential and integral calculus course. A student as mathematically talented as Schneider was always going to be converted to mathematics by such inspiring teachers, and indeed it was not long before he had dropped other sciences to concentrate on mathematics. A course on transcendental numbers, given by\nCarl Siegel\n, was so inspiring that Schneider decided that he wanted to enter\nSiegel\n's research seminar and he passed the difficult entrance examination.\nSiegel\ngave Schneider a number of possible problems which he might work on for his doctorate. However, Schneider had so loved\nSiegel\n's course on transcendental  numbers that he began to look at one of the open problems that\nSiegel\nhad listed in that course.\nDavid Hilbert\n's Seventh Problem, given in his address to the Paris International Congress of Mathematicians in\n1900\n, asks:\nProve that\na\nb\na^{b}\na\nb\nis transcendental where\na\na\na\nis algebraic\n(\nnot\n0\nor\n1)\nand\nb\nb\nb\nis an algebraic irrational number.\nAleksandr Osipovich Gelfond\nproved a special case of\nHilbert\n's Seventh Problem in\n1929\nwhen he showed that the result held for\na\na\na\nalgebraic\n(\nnot\n0\nor\n1)\nand\nb\nb\nb\nan imaginary quadratic. Using\nGelfond\n's ideas,\nSiegel\nshowed how to prove this for a real quadratic\nb\nb\nb\nand he gave an indication of this in his course on transcendental numbers that Schneider attended. In fact\nSiegel\ndid not publish his result and Rodion Osievich Kuz'min also saw how to use Gelfond's ideas to prove the Seventh Problem in the case where\nb\nb\nb\nis a real quadratic and published in\n1930\n.\nSiegel\nhad indicated in his course that the general problem was still open, although he did not explain that this was\nHilbert\n's Seventh Problem. Schneider later wrote\n(\nsee\n[\n2\n]\n)\n:-\nAfter a few months, I gave\nSiegel\nsix pages of my work, and was then told by him that I had solved\nHilbert\n's Seventh Problem.\nIn fact\nGelfond\nhad also, independently, managed to extend the ideas in his\n1929\npaper to complete the proof of\nHilbert\n's Seventh Problem so the result is now known as the\nGelfond\n-Schneider Theorem. Schneider published his proof of\nHilbert\n's Seventh Problem in the paper\nTranszendenzuntersuchungen periodischer Funktionen\nⓉ\n(\nInvestigations of the transcendence of periodic functions\n)\n(1934)\nwhich appeared in\nCrelle\n's\nJournal\n.\n[\nGelfond\n's proof was published in\nSur le septième Problème de D Hilbert\nⓉ\n(\nOn Hilbert's seventh problem\n)\n(1934)\n.\n]\nOne might imagine that solving one of\nHilbert\n's Problems would be enough for a Ph.D. thesis but\nSiegel\nthought that something so short\n(\nfive pages in the published paper\n)\nmight not be acceptable to the Frankfurt Faculty. Schneider then produced another five pages on transcendence of\nelliptic functions\nand the two parts formed his thesis, also entitled\nTranszendenzuntersuchungen periodischer Funktionen\nⓉ\n(\nInvestigations of the transcendence of periodic functions\n)\n, which earned him a doctorate in\n1934\n.\nOne might think that solving one of\nHilbert\n's Problems in your Ph.D. thesis would make getting a job easy, but Germany in\n1934\nwas not operating by the usual rules. Enthusiastic support for the Nazi Party and its ideology was far more important that academic ability\n[\n4\n]\n:-\n... from the autumn of\n1933\n, success did not depend any longer on academic achievement, but rather on being a member of a suitable Nazi organisation and having views consistent with Nazi ideology. If Schneider wanted to carry on with his studies or find a university post, he would have to join a Nazi organisation. The alternative would be to give up any idea of an academic career.\nSchneider was not Jewish but he was closely associated with his teachers\nDehn\n,\nEpstein\n,\nHellinger\nand\nSzász\nwho were all Jewish. His closest association was with\nCarl Siegel\nwho, although not Jewish, made no secret of his anti-Nazi views and this was perhaps the most damaging of all Schneider's difficulties with the Nazis. He had to make the choice, as indicated in the above quote, and he chose to join the\nSturmabteilung\n(\nSA\n)\n, the paramilitary organisation of the Nazi Party. This might look at first as if Schneider was going too far in his efforts to be accepted, but in fact this is not so. Although the SA had played a major role in Hitler's rise to power, the organisation became essentially irrelevant after June\n1934\nwhen Hitler, believing that the SA leaders were plotting against him, had over\n100\nof the SA leaders arrested and shot. The SS then became the Nazi Party's paramilitary wing and the SA became largely irrelevant. Schneider's move worked and he was appointed as an assistant at Frankfurt am Main in\n1935\n. However, it was still known by the authorities that he was not a supporter of Nazi ideology and, for that reason, he was not allowed to attend the International Congress of Mathematicians in Oslo in July\n1936\n. Had he been allowed to attend, he would have presented his proof of\nHilbert\n's Seventh Problem.\nThe work on transcendence which had led Schneider to his solution of\nHilbert\n's Seventh Problem led him to extend to a more general programme studying the transcendence of elliptic functions, modular functions and abelian functions. He published three papers in\n1936\n, one being\nArithmetische Untersuchungen elliptischer Integrale\nⓉ\n(\nInvestigations of arithmetic elliptic integrals\n)\nand, two years later, he submitted his\nhabilitation\nthesis\nZur Theorie der Abelschen Funktionen und Integrale\nⓉ\n(\nOn the theory of Abelian functions and integrals\n)\nto Frankfurt University. It was a remarkable and important piece of work but the thesis was rejected. Although we have no evidence that it was never read, many\n(\nincluding Yandell\n[\n1\n]\n)\nbelieve that it was rejected without ever being given any consideration. With Nazi policies becoming ever more extreme,\nSiegel\nhad found the situation in Frankfurt intolerable;\nSzász\nhad been dismissed and\nDehn\n,\nEpstein\nand\nHellinger\n, although still living in Frankfurt, were not allowed to teach at the University. In late\n1937\nSiegel accepted a professorship in Göttingen and moved there in\n1938\n. After his habilitation was rejected by Frankfurt, Schneider moved to Göttingen to become\nSiegel\n's assistant\n(\na very lowly position for someone with his outstanding record\n)\n. On\n9\nNovember\n1939\nhe submitted his habilitation thesis\nZur Theorie der Abelschen Funktionen und Integrale\nⓉ\n(\nOn the theory of Abelian functions and integrals\n)\nto Göttingen. It was identical to the thesis which had been rejected by Frankfurt one year earlier, but it was accepted by Göttingen and in\n1940\nhe was appointed to a teaching position at Göttingen.\nOf course, by\n1940\nGermany was at war and Schneider was drafted into the German army. He undertook war service as a meteorologist, mostly stationed in France. During this period, his habilitation thesis was published in\nCrelle\n's\nJournal\nin\n1941\n. However, this was his only publication between\n1936\nand\n1949\n, the years that, under normal circumstances, would have almost certainly been the most productive of his life. In\n1944\nSchneider, still undertaking war service, received a request to go to the University of Göttingen to cover for Helene Braun who had contracted diphtheria. This request came due to the efforts of\nWilhelm Süss\nwho was setting up a Mathematical Institute at Oberwolfach. The Nazis believed that the Oberwolfach Mathematical Institute was being set up to help the war effort, but\nSüss\nwas attempting to save as many German mathematicians from dying  as he possibly could in the final days of the war. Once Schneider was in Göttingen, he was brought by\nSüss\nto Oberwolfach in March\n1945\n. Along with about\n20\nother mathematicians, he remained there until the war ended.\nSüss\n's wife, Irmgard, wrote about this time and she:-\n... tells a tale of courage and camaraderie in those final days; the problem of securing food and heating; the preparations for flight in case the Institute was attacked; the eventual occupation of the lodge; and, once the war was officially over, the frantic burning of books on National Socialism that had been stored in the house.\nIn May\n1945\nGermany surrendered but Schneider remained at the Oberwolfach Mathematical Institute until the autumn of that year by which time Göttingen University had reopened. Göttingen is nearly\n500\nkm by road from Oberwolfach but Schneider made the journey\n[\n1\n]\n:-\n... on a rattletrap bicycle put together from junked parts.\nHe was back to an assistant position at Göttingen where he remained until\n1953\nexcept for the academic year\n1947\n-\n48\nwhich he spent at the University of Münster as a substitute professor. In\n1950\nhe married Maria Urbach\n[\n1\n]\n:-\n... finally, unqualified good fortune. He called her \"Mieke\" and, while he is described as calm, she was full of energy and expression. Schneider's students, writing about her, made it clear how much they appreciated her. Schneider was thirty-nine and Mieke thirty-five when they married. They had one child, Bernard, who became a doctor.\nIn\n1953\nSchneider was named as an ordinary professor at Erlangen. He remained there until\n1959\n, being head of the Faculty of Science during\n1955\n-\n57\n. In\n1959\nhe went to Freiburg to fill the chair left vacant following the death of Süss from liver cancer in May\n1958\n.\nSüss\nhad been the first director of the Oberwolfach Institute but, following his death,\nHellmuth Kneser\nserved as director of the institute until Schneider was appointed to that role in\n1959\n. He held this position for four years until Martin Barner took over in\n1963\n. Schneider kept his close association with Oberwolfach, however, being an organiser of the number theory meetings\n(\nalong with\nHelmut Hasse\nand Peter Roquette\n)\nheld every year or two from\n1955\nto\n1972\n. After\n1972\nhe organised Oberwolfach meetings on diophantine approximation and transcendental numbers.\nHe retired in\n1976\n, at the earliest opportunity, but remained in his home in Zähringen, Freiburg\n[\n4\n]\n:-\n... enjoying, with his wife, the garden, his sports car, vacation trips, and freedom from all obligations.\nLet us look briefly at the important monograph\nEinführung in die transzendenten Zahlen\nⓉ\n(\nIntroduction to transcendental numbers\n)\n(1957)\nby Schneider which was also published in French translation two years later as\nIntroduction aux nombres transcendants\nⓉ\n(\nIntroduction to transcendental numbers\n)\n.\nKurt Mahler\n, who himself made important contributions to transcendence of numbers, writes in a review:-\nThis addition to the small library of modern books on transcendental numbers ... will be welcomed by mathematicians everywhere, the more so since it contains proofs of the author's fundamental work on the transcendency of elliptic and modular functions.\n(\nHis even more far-reaching results on abelian functions are also mentioned, but not proved.\n)\nSchneider remained close friends with\nSiegel\n, often enjoying walks together in the country in their retirement, and was greatly affected by his death in April\n1981\n. However, Schneider's wife and family gave him the happiness in his final years which had eluded him through the troubled years when he was trying to carve out a career with the odds stacked firmly against him.",
  "math_areas": [
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}