{
  "nome_completo": "Theodor Angheluță",
  "nome_curto": "Theodor Angheluță",
  "ano_nascimento": "1882",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Angheluta/",
  "lugar_nascimento": "Adam, Tutova county, Romania",
  "lugar_morte": "Cluj, Romania",
  "biografia": "Theodor Angheluță\nwas born in April\n1882\nin the small village Adam situated in the\n(\nformer\n)\nTutova county.\nTutova County was one of the historic counties of Moldavia and is now part of Galati county in Romania. He was born into a peasant family.\nAfter the primary and secondary studies at Bârlad, a major city about\n30\nkm north of the village of Adam where he was born, he became a student in the Faculty of Sciences at the University of Bucharest in\n1902\n. He was awarded his bachelor's degree in Mathematics in\n1905\n. After graduating, he became a secondary school teacher of mathematics. He was a school teacher from\n1905\nto\n1909\n. From\n1910\n, Theodor Angheluță was a student at the Sorbonne in Paris, working mainly on the guidance of\nÉmile Picard\n. He had to return to Romania in\n1914\nbecause of the outbreak of World War I, but he spent the next few years, from\n1914\nto\n1919\n, as a secondary school mathematics teacher. Theodor Angheluță was appointed associate professor in the Faculty of Sciences of the University of Bucharest in\n1919\n. On\n16\nJune\n1922\nAngheluță defended his Ph.D. thesis\nOn a general class of trigonometric polynomials and the approximation of a continuous function\nat the University of Bucharest.\nAfter the award of his doctorate, in\n1923\nAngheluță was appointed as a full professor of Algebra in the Faculty of Sciences of the University of Cluj. Now Cluj had, with the rest of Transylvania, been incorporated into Romania with the Treaty of Trianon in\n1919\n. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n. Angheluță was fully involved in the intense work of organizing mathematical education at the University. Here he joined colleagues\nNicolae Abramescu\n,\nPetre Sergescu\n, Gheorghe Bratu and the Director of the Mathematical Seminar,\nDimitrie Pompeiu\n.\nProfessor Theodor Angheluță was the dean of the Faculty of Sciences of the University of Cluj between\n1931\nand\n1932\n. In August\n1940\n, after the start of World War II, the north-west part of Romania\n(\nincluding Cluj\n)\nwas surrendered to Hungary in the Vienna Dictate. This was a decision taken in Vienna under severe pressure from the German Third Reich. The Romanian university in Cluj moved to Alba-Iulia, Turda, Sibiu and Timișoara. In fact the Faculty of Sciences was moved to Timișoara, while the rest of the faculties were moved to Sibiu. All of them began operating in November\n1940\nand at this time Angheluță taught at Timișoara. He was elected to the\nRomanian Academy of Sciences\non\n7\nJune\n1943\nand, at his election, his institution is given as Cluj-Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n.\nAngheluță retired on\n1\nSeptember\n1947\n, but then, at the end of\n1950\n, he was appointed again as a full professor at the Faculty of Mathematics and Physics at the Victor Babeș University of Cluj. After retiring, he was elected to the\nRomanian Academy of Sciences\nin\n1948\n. From\n1\nOctober\n1955\nto September\n1962\n, Professor Theodor Angheluță was a full professor in the Mathematics Department of the Technical Institute of Cluj. He was named 'Scientist emeritus' on\n1\nJanuary\n1963\n.\nTheodor Angheluță made important contributions to Function Theory, to Differential and\nIntegral Equations\n, and to Functional and Algebraic Equations. A special kind of functional equation is today named after him, namely the 'Angheluță type functional equation'. We now list twenty-one of Angheluță's papers, giving a little more information for some of them:\nOn some integrals\n(\nRomanian\n)\n(1935)\n- Corrects results by the mathematician Michel Ghermanescu\n(1899\n-\n1962)\npublished in\nGazeta Matematica\n;\nDetermination of projective transformations which leave invariant a second degree equation\n(\nRomanian\n)\n(1937)\n- Angheluță determines the projective transformations which convert a given quadratic equation into a given second order equation;\nDiscussion of the reality of the roots of equations of the third and fourth degree with real coefficients\n(\nRomanian\n)\n(1938)\n- Systematic specification of reality conditions and intervals for the roots of equations of the third and fourth degree;\nAbout the sum of the roots of a polynomial\n(\nRomanian\n)\n(1939)\n;\nOn absolute values of the zeros of polynomials\n(\nRomanian\n)\n(1939)\n;\nForming the quotient of two polynomials, and the remainder, if the divisor is factored first degree\n(\nRomanian\n)\n(1940)\n;\nRemarques sur des mouvements tautochrones\nⓉ\n(\nNotes on tautochronic movements\n)\n(1941)\n- Uses methods that were developed by\nPaul Appell\nin his book\nMécanique Rationelle\nⓉ\n(\nRational mechanics\n)\n;\nUne identite entre nombres complexes et un théorème de géométrie élémentaire\nⓉ\n(\nAn identity between complex numbers and an elementary theorem of geometry\n)\n(1941)\n;\nOn orthogonal transformations whose matrices are symmetric\n(\nRomanian\n)\n(1941)\n- Angheluță gives a transformation, which depends on\nn\n−\n1\nn-1\nn\n−\n1\nreal parameters, which is the most general linear transformation satisfying the properties of being orthogonal and having symmetric matrix;\nUne identité entre nombres complexes et un théorème de géométrie élémentaire\nⓉ\n(\nAn identity between complex numbers and an elementary theorem of geometry\n)\n(1942)\n- Angheluță generalises to polygons with\nn\nn\nn\nsides, results proved for\nn\n=\n3\n,\n4\nn = 3, 4\nn\n=\n3\n,\n4\nby\nTiberiu Popoviciu\nin\n1936\n;\nLife and mathematical work of Émile Picard\n(\nRomanian\n)\n(1942)\n- a nice obituary of\nÉmile Picard\nwho was Angheluță's advisor while he was in France.\nCircuit transformations characterized by a functional equation\n(\nRomanian\n)\n(1946)\n;\nApplications of the divided difference, made as an integral\n(\nRomanian\n)\n(1952)\n;\nOn a functional equation\n(\nRomanian\n)\n(1959)\n;\nOn a class of integrals\n(\nRomanian\n)\n(1959)\n- The results are obtained via applications of the theory of\nBernoulli\nnumbers and the calculus of residues;\nRemarks concerning Poisson's functional equation\n(\nRomanian\n)\n(1959)\n;\nThe functional equation of a translation\n(\nRomanian\n)\n(1959)\n- proves results by J Aczel in a simpler way.\nOn a functional equation with three unknown functions\n(\nRomanian\n)\n(1960)\n;\nA functional equation for the sine and another for a hyperbolic sine\n(\nRomanian\n)\n(1961)\n- gives simpler proofs of results already known;\nThe functional equation of the logarithm\n(\nRomanian\n)\n(1961)\n- gives simpler proofs of results already known;\nAbout a functional equation\n(\nRomanian\n)\n(1962)\n- gives simpler proofs of results already known.\nWe note that this represents only small selection from the papers that Angheluță published. The book\n[\n1\n]\ncontains seventy of Angheluță's papers. He was an excellent teacher and also published a number of books, based on the lecture courses that he gave at the University of Cluj. These, all written in Romanian, include:\nCourse on rational mechanics\n(1926)\n;\nApplications of mechanics\n(1927)\n;\nCourse on higher algebra\n(1940)\n;\nCourse on the theory of functions of a complex variable\n(1940)\n; and\nAnalytics\n(1945)\n.\nTheodor Angheluță died at Cluj in May\n1964\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}