{
  "nome_completo": "Theodore Samuel Motzkin",
  "nome_curto": "Theodore Samuel Motzkin",
  "ano_nascimento": "1908",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Motzkin/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Theodore Samuel Motzkin\n's father was Leo Motzkin. Born in Russia into a Jewish family, Leo Motzkin went to Berlin when he was thirteen years old to study mathematics. He continued to study mathematics through university being accepted as a research student by\nKronecker\n. After starting work on his doctoral thesis, Leo Motzkin left mathematics to work for the Zionist movement.\nTheodore Motzkin showed remarkable talents for mathematics as a child growing up in Berlin, and he began his university education when only fifteen years old. He followed the usual pattern of German education of his day, spending time at different universities. Among those he studied at were Göttingen, Paris and Berlin. At Berlin he wrote his diploma thesis, under\nSchur\n's supervision, on algebraic structures. For his doctoral work Motzkin went to Basel where he studied with\nOstrowski\nwriting his dissertation on linear inequalities. In\n1957\nhe wrote the following about his thesis:-\nIn keeping with the habits in central Europe at that time the author, even though encouraged by the editors of Compositio Mathematica to publish the thesis there, issued it as an independent publication. It became almost inaccessible and, although reviewed in the Fortschritte and the Zentralblatt, remained unknown, for example to a group of recent Russian writers who rediscovered some its results. In the United States an ever increasing interest in topics involving linear inequalities led to the simultaneous translation of the thesis, about\n1951\n, ... for A W Tucker's ONR project at Princeton university, and ... for the RAND Corporation in Santa Monica.\nOstrowski\nwas in many ways more of a collaborator of Motzkin's than a supervisor. Motzkin already had several publications before his thesis on linear programming was completed in\n1934\n. It is usual for mathematicians who have early publications before writing their doctoral thesis, to have published material which is being studied as part of the work of the thesis. Motzkin's first publication, however, was not on linear programming but rather on power series. It was written as a partial solution to a problem which had been posed by\nOstrowski\nand it gave Motzkin particular pleasure when he returned to the problem many years later and was able to give a complete solution. Both linear programming and power series were themes which ran through Motzkin's research throughout his life but he was an extremely broad mathematician and there were many other themes.\nIn\n1935\nMotzkin was appointed to the Hebrew University in Jerusalem. He remained there throughout World War II, working as a cryptographer for the British Government during the war years. During his stay in Jerusalem, he married Naomi Orenstein and their three sons were all born there. As was characteristic of Motzkin throughout his life, he maintained a remarkable mathematical output, writing several papers in Hebrew and helping to create Hebrew mathematical terminology.\nWe spoke of many different themes running through Motzkin's research and one of these was combinatorial analysis. What might be considered his first paper on this topic was written jointly with\nA Dvoretzky\non the ballot problem.\nFeller\n, reviewing the paper, wrote:-\nAs the authors point out, most of the formally different proofs in reality use the reflection principle, but without the geometric interpretation this principle loses its simplicity and appears as a curious trick.\nDvoretzky\nand Motzkin give a new proof of great simplicity and elegance. they generalise the ballot problem by requiring that at each instant, P have at least a times the votes scored by Q.\nThe paper studies the discrete problem but the authors published a follow-up paper which considered a continuous version of this combinatorial question.\nMotzkin emigrated to the United States in\n1948\nand there he spent two years at Harvard and Boston College. One of the first papers which he published after arriving in the United States was on the Euclidean algorithm in principal ideal domains. He proved that there are principal ideal domains which are not Euclidean domains. For example\nZ\n[\n(\n1\n+\n√\n−\n19\n)\n/\n2\n]\n\\mathbb{Z}[(1+√-19)/2]\nZ\n[\n(\n1\n+\n√\n−\n1\n9\n)\n/\n2\n]\nis such a principal ideal domain. The problem here is not in showing that this is not Euclidean with respect to the standard norm, which is an undergraduate exercise, but rather that it is not Euclidean in any norm. The editors of\n[\n1\n]\nwrite:-\nThe proof is very typical of Motzkin in that the Euclidean algorithm is given a new formulation, which at first seems to be leading away from the problem at hand, but is suddenly seen to be the decisive key to its solution.\nIn\n1950\nhe was appointed to the Institute of Numerical Analysis at the University of California, Los Angeles and ten years later he became Professor of Mathematics there. One of the themes which he worked on at UCLA was approximation theory. On this topic many of his publications were joint ones coming from a collaboration with J L Walsh. In many publications on this topic Motzkin examined a wide variety of different ideas, including new measure of closeness of approximation. He examined the zeros of polynomials of best approximation and produced results which were analogues to properties of the\nChebyshev\npolynomials.\nOther themes which run through Motzkin's work is geometric problems, some involving\nRamsey\ntheory, and he wrote many papers on graph theory. Convex polyhedra interested him and are studied in several of his papers which combine his geometric and graph theory interests. A beautiful description of the excitement of Motzkin's work is given in\n[\n1\n]\n:-\nDuring many of his years at UCLA, Motzkin conducted seminars that were very exciting to the students and faculty members who participated in them. Some of Motzkin's most beautiful and important work made its first appearance here. For example, he once decided to present a seminar talk on Eberhard's conjecture that if every face of a trivalent convex polyhedron P has edge-number divisible by\n3\n, then the number of edges of P is even. To the astonishment of the audience, he proceeded in the talk to prove the conjecture, using properties of the group SL\n(2\n,\n3)\nof order\n24\n, which at first seemed to be completely unrelated to the problem.\nIn\n[\n1\n]\na summary of Motzkin's contribution is given:-\nMotzkin was a mathematician of great erudition, versatility, and ingenuity. Exceptionally broad, the range of his work included beautiful and important contributions to the theory of linear inequalities and programming, approximation theory, convexity, combinatorics,\nalgebraic geometry\n, number theory, algebra, function theory, and numerical analysis. ... The many areas in which he worked were, however, unified by the thread of his own characteristic approach and style. If it is possible to speak of passion in one so mild-mannered, then his was a passion for meticulous precision and order. In his hands this precision became a powerful creative tool.\nAs to his teaching skills:-\nHis unique teaching style gained him the admiration and affection of the many talented undergraduate and graduate students who were attracted to his lectures and seminars.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic"
  ]
}