{
  "nome_completo": "Thierry Émilien Flavien Aubin",
  "nome_curto": "Thierry Aubin",
  "ano_nascimento": "1942",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aubin/",
  "lugar_nascimento": "Béziers, France",
  "lugar_morte": "Paris, France",
  "biografia": "Thierry Aubin\nwas ranked first in the Concours Général de Mathématiques in\n1961\nand, in the same year, he entered the École Polytechnique in Paris where he studied mathematics. He was taught by\nAndré Lichnerowicz\nand he asked him if he would be his doctoral advisor. Aubin submitted his thesis and graduated with a doctorate in\n1969\nbut, in the previous year, he had already been appointed to the University of Lille. He remained at Lille for five years before, in\n1973\n, being appointed as a professor at Paris VI, the Pierre and Marie Curie University.\nPhilippe Delanoë attended Aubin's graduate course at the Pierre and Marie Curie University in\n1976\n-\n77\nand then became his doctoral student. He writes in\n[\n6\n]\nabout this outstanding graduate course:-\nHis graduate course at the Pierre et Marie Curie University in\n1976\n-\n77\nwas designed to present several theorems published by him in\n1976\n; it had a remarkable intensity. I remember Aubin only presented what was strictly necessary, seldom consulting his notes .... Having read the wonderful book \"Field Theory\" by\nLev Landau\nand\nEvgenii Lifshitz\n, I was in familiar territory. He included some results outside those which were directly relevant, but gave little explanation or commentary, allowing each student to work alone on the meaning and scope of the course.\nHidehiko Yamabe\npublished\nConformal deformation of Riemannian structures on compact manifolds\n(1960)\nin which he proved the following: given a compact Riemannian manifold without boundary of dimension greater than two with a given metric, there exists a metric with constant scalar curvature which is conformal to the given metric. However,\nNeil Trudinger\npublished\nRemarks concerning the conformal deformation of Riemannian structures on compact manifolds\nin\n1968\nin which he pointed out a problem with\nYamabe\n's proof. Sadly,\nYamabe\nhad died aged\n37\nin the year his paper was published so others had to work on the problem. This became known as the '\nYamabe\nproblem' and it was something to which Aubin made substantial contributions. His fundamental papers\nMétriques riemanniennes et courbure\nⓉ\n(\nMetric and Riemannian curvature\n)\n(1970)\n,\nEquations différentielles non linéaires et problème de Yamabe concernant la courbure scalaire\nⓉ\n(\nNonlinear differential equations and the Yamabe problem on scalar curvature\n)\n(1976)\nand\nMeilleures constantes dans le théorème d'inclusion de Sobolev et un théorème de Fredholm non linéaire pour la transformation conforme de la courbure scalaire\nⓉ\n(\nBest constants in Sobolev\\'s inclusion Theorem  and a nonlinear Fredholm theorem for conformal transformation of the scalar curvature\n)\n(1979)\nwere fundamental in solving the\nYamabe\nproblem.\nIn\n1954\n, in\nThe space of Kähler metrics\n, Eugenio Calabi made his famous conjecture. This claims the existence of a\nKähler\n-\nEinstein\nmetric on a compact\nKähler\nmanifold, having a prescribed volume form. The analytic problem requires one to prove the existence of a solution of a highly nonlinear\n(\ncomplex\nMonge\n-\nAmpère\n)\ndifferential equation. Aubin proved an important special case of the Calabi conjecture in\nEquations du type Monge-Ampère sur les variétés kählériennes compactes\nⓉ\n(\nEquations of the Monge-Ampere type on compact Kähler varieties\n)\n. He published two papers with this title, the first announcing his results in\n1976\n, and the second giving full details two years later. In fact in\n1978\nit was\nShing-Tung Yau\nwho extended Aubin's results and completed the proof of the Calabi conjecture which earned him a\nFields medal\nin\n1982\n.\nSun-Yung Alice Chang\nand Paul Yang write about other important contributions by Aubin\n[\n4\n]\n:-\nProfessor Aubin is widely known for his contribution to the solutions of the Calabi conjecture as well as the Yamabe problem. His work on the prescribed scalar curvature problem is perhaps not as well known but has had wide influence on the development in this area. To understand the scalar curvature equation on the sphere, he introduced the balancing condition on the conformal factors, and provided an improvement in the\nSobolev\ninequality for such factors. This became the basic tool of the compactness argument for a lot of subsequent work on this equation and later lead to the solution of prescribing curvature problem with no assumption on the symmetry of the curvature. Professor Aubin has also written several books about geometric PDE that have a wide influence in geometric analysis. We consider Professor Aubin as one of the anchor in the field of geometric PDE in recent decades. He and his work will be in our memory.\nLet us now look briefly at three important books published by Aubin. Jerry Kazdan, reviewing\nNonlinear analysis on manifolds. Monge-Ampère equations\n(1982)\n, writes\n[\n10\n]\n:-\nAs one of the major contributors to the resolution of nonlinear problems in geometry, Thierry Aubin has focused this monograph on a few significant questions on which he has been involved personally, rather than writing a broad treatise.\nMark Pinsky, reviewing the same book, writes\n[\n13\n]\n:-\nThis book deals with certain nonlinear partial differential equations which arise from problems in global differential geometry. This field, which is nearly thirty years old, has experienced a revival in the past ten years which has been captured in this book of Aubin, who has been at the forefront of many of these recent development\nAubin updated and expanded this book, publishing the revised text as\nSome nonlinear problems in Riemannian geometry\n(1998)\n. John Lee writes in a review that the book:-\n... like its predecessor, gives an amazingly thorough survey of the state of the art at the time of its writing. With the exception of the chapter on harmonic maps ... all the major results are carefully and accurately stated, and all the main steps in the proofs are described. Although few of the details of the proofs are spelled out, copious references to the literature make it a straightforward\n(\nthough by no means easy\n)\nmatter for the interested reader to fill in the details when needed. The result is a book whose completeness and scholarship will make it a valuable reference and literature guide for working mathematicians, as well as a comprehensive survey for beginners who wish to get an introduction to this vast and rapidly expanding field.\nIn\n2001\n, Aubin published\nA course in differential geometry\n. He writes in the Preface:-\nThis book provides an introduction to differential geometry, with principal emphasis on Riemannian geometry. It can be used as a course for second year graduate students. The main theorems are presented in complete detail, but the student is expected to provide the details of certain arguments. ... The aim of this book is to facilitate the teaching of differential geometry. This material is useful in other fields of mathematics such as partial differential equations, to name one. We feel that workers in PDE would be more comfortable with the covariant derivative if they had studied it in a course such as the present one. Given that this material is rarely taught, we feel that it requires a substantial amount of effort, especially since there is a shortage of good references.\nLiviu Nicolaescu writs in a review of this book:-\nIt covers topics every working mathematician\n(\nor theoretical physicist\n)\nought to know: tensorial, differential and integral calculus on smooth manifolds, and basic Riemannian geometry. The style is very clear and concise, and the emphasis is not on the widest generality, but on the most often encountered situation. This makes it a much more approachable text than many other traditional sources. The inclusion of a large number of interesting exercises\n(\nsome of them with complete solutions\n)\nenhances the educational value of this book. To conclude, I believe this is an excellent textbook for a first course on basic differential geometry, very helpful to both the instructors and their students.\nAubin was honoured with the award of the Prix Servant from the\nAcademy of Sciences\nin\n1982\n. On\n19\nMarch\n1990\nhe was elected as a corresponding member of the Mathematics Section of the\nAcademy of Sciences\n. On\n18\nNovember\n2003\n, along with\nLaurent Lafforgue\nand Marc Yor, he was elected a full member of the Academy. Two of his supporters for election were\nShiing-shen Chern\nand\nLouis Nirenberg\n.\nLet us look at some of the tributes paid by his friends and colleagues. Richard Schoen writes\n[\n14\n]\n:-\nThierry Aubin was a very important mathematician whose work had great influence on the fields of Differential Geometry and Partial Differential Equations. He was instrumental in bringing to bear on geometric problems the powerful methods which were developed to handle nonlinear elliptic and parabolic PDE during the\n1950\ns and\n1960\ns. Aubin applied these methods in novel ways to fully nonlinear equations, and to delicate semilinear variational problems.\nJerry Kazdan writes\n[\n9\n]\n:-\nIn the past fifty years there has been a surge of work on problems that involve the interplay of differential geometry and analysis, particularly partial differential equations. Thierry Aubin was one of the true leaders. He had important insight on how to reduce geometry problems to proving fundamental inequalities. These will have a permanent place in mathematics.\nAbbas Bahri writes\n[\n3\n]\n:-\nThierry Aubin was an excellent mathematician, a great geometer. His mind was clear, his exposition allowed readers to immediately tackle difficult subjects and gave them the illusion to quickly reach advanced research in highly technical and complicated areas. His books show the talent of a magician who invites you into an area as if you had always been there, as if you did not need to enter it. ... Thierry Aubin was also a complex human being in search of new horizons. He sought, and found I believe, friends all over the world: he had students\n(\nmany of them were his personal friends\n)\nboth French and also from North Africa. He has travelled all over the world, his name and his work is known and respected everywhere.\nDavid Holcman writes\n[\n8\n]\n:-\nAubin had a complex personality; a man of great mathematical talent ... Very smart, he was a man of originality, rather secret, who spoke little, but knew how to get to the fundamental. In his lectures and his books, he missed out a number of steps in the calculation, which gave colour and sweat to those who wanted to enter the fun but difficult area of analysis on manifolds. ... If I have to add something, it's just that knew how to appreciate beauty in its most diverse forms.\nPhilippe Delanoë completed this Ph.D. with Aubin as his advisor in June\n1982\n. He writes\n[\n6\n]\n:-\nThierry Aubin soon experienced his first serious health problems. Two years after my PhD, I was assigned to the\nDieudonné\nLaboratory. While in Paris, I asked him once if he would allow us to organize a symposium in his honour. He declined, his health would not allow him to participate. Now we will consider perhaps the idea of a symposium on the legacy of his mathematical interests, interests shared by the best geometric analysts in the world.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}