{
  "nome_completo": "Thomas Smith Graham",
  "nome_curto": "Thomas Graham",
  "ano_nascimento": "1905",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Graham_Tommy/",
  "lugar_nascimento": "Stepps, near Glasgow, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Thomas Graham\nwas known to his friends and colleagues as Tommy. His parents were Thomas Graham and Elizabeth Macdonald. They were married in Blythswood, Glasgow in\n1900\nand had three sons. Thomas Graham Senior was station master at Stepps near Glasgow. He is described in\n[\n2\n]\nas \"smart, business like and courteous.\" It also states in\n[\n2\n]\nthat although his predecessor:-\nMr Brown, a typical genial country station master ... would hold up the train until the last straggler came panting down the Low Road, now Station Road, and over the bridge to the West side to board the train for Glasgow ... Mr Graham\n[\nwas\n]\na different type of person, and there was no longer a hold up of the train for stragglers.\nThose of us who knew his son Tommy would recognise the same character of \"sticking to the rules\" in him.\nTommy had a younger brother, John Macdonald Graham\n(1908\n-\n1982)\n, who became Professor of Systematic Theology at the University of Aberdeen and twice served as Lord Provost of the City of Aberdeen\n(1952\n-\n55\nand\n1961\n-\n64)\n. The three boys all attended Allan Glen's School in Glasgow. The school was run by Glasgow Corporation from\n1912\nand, although fee paying, had a large number of bursaries awarded through a competitive entrance examination. Teaching at the school was of a high standard and it had a particularly strong reputation for science.\nThomas and Elizabeth Graham's three sons all attended Glasgow University. Tommy matriculated in\n1922\nand was awarded an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1926\n. We should note that the Scottish M.A. degree is a first degree at the B.A. level and is only named a Master's degree for traditional reasons. We also note that Natural Philosophy is the older name for Physics. Tommy Graham was ranked first in his year and was awarded the Logan Medal and Prize. His younger brother John also had an outstanding undergraduate career at Glasgow University and graduated with a M.A. with First Class Honours in Mental Philosophy in\n1930\n.\nTommy Graham wanted to go to the University of Cambridge to undertake research in mathematics for his doctorate but obtaining the necessary funding was not simple. There was financial support available in the William Bryce Fellowship which was awarded after a competition to find the best candidate. However, there was only one student supported with a William Bryce Fellowship at any one time and, when Graham graduated,\nRobert Gillespie\nwas being funded with this Fellowship. In fact\nGillespie\n, who was undertaking research at Cambridge advised by\nE W Hobson\n, had been awarded the fellowship in\n1924\nand would continue to hold it until\n1927\nso a new award would not be made until\n1928\n. Graham was confident that he would win the competition for the Fellowship in the\n1928\ncompetition so decided to spend the two years\n1926\n-\n28\nputting off time. He registered as a postgraduate student in the Department of Natural Philosophy at Glasgow University and competed for a Ferguson Scholarship in Mathematics which he won in competition with students from all four Scottish universities. His research was undertaken with E Taylor Jones as his advisor, but Graham never intended this to be anything more than an interim measure.\nIn\n1928\na competition was held for the William Bryce Fellowship based on undergraduate level mathematics. Graham had to answer questions on material he had studied two years earlier but this proved not to be a problem to him and, as he had hoped, he was awarded the Fellowship and matriculated at Gonville and Caius College, Cambridge, in the autumn of\n1928\n. His Cambridge thesis advisor was\nMax Newman\nwho was at this time a lecturer at Cambridge but had just spent a very profitable time at Princeton. When\nNewman\ndiscovered what a talented mathematician Graham was, he advised him to spend time at Princeton and went out of his way to make the necessary arrangements. Graham spent two years at Princeton,\n1930\n-\n32\n, and during that time his formal advisor was\nLuther P Eisenhart\n[\n1\n]\n:-\n... some of\n[\nGraham's\n]\nwork may be seen in\nEisenhart\n's book 'Continuous Groups of Transformations'\n(\nPrinceton,\n1933)\n, where his achievements and assistance are acknowledged.\nHowever at Princeton Graham was also much influenced and helped by\nOswald Veblen\n. There were other young mathematicians who were showing great promise and Graham benefited from contact with these, particularly with\nHenry Whitehead\nwho had arrived at Princeton from Oxford the year before Graham.\nReturning to Cambridge in\n1932\n, Graham submitted his thesis\nOn the Structure of Simple and Semi-Simple Groups\nand, after being examined, was awarded a Ph.D\n.\nBack in Glasgow later that year, he was appointed as an Assistant in Mathematics by the Head of Department\nThomas MacRobert\n. At this time Glasgow operated a system of appointing assistants who helped teach the large classes of first year students. Only a few of these assistants were kept on and promoted to Lecturer so it was a tough system in which a young mathematician had to prove to be a quality teacher. Graham certainly showed himself to be outstanding as a teacher and in\n1935\nhe was promoted to Lecturer in Mathematics.\nGraham had shown great promise as a researcher but somehow this never translated into publications. He has no mathematical publications, not even publications from his excellent Ph.D. thesis. There are probably two reasons for this. One is certainly the extremely high standards that Graham set for himself. This meant that he delayed long perfecting the results from his thesis before attempting to publish them and others published similar results before he had polished his. The Glasgow system at this time, employing several assistants who would not get permanent jobs, put much pressure on them, particularly with the high teaching loads they were given.\nRobert Rankin\nwrites in\n[\n1\n]\n:-\nHe entered fully into the teaching work of the Department, giving careful attention to the preparation of lectures, but retaining through wide reading his interest in abstract and linear algebra. Before the Second World War, Mathematics was studied as an Honours subject almost entirely in combination with Natural Philosophy, and there was therefore a natural tendency to devote more time to the different aspects of mathematical analysis than to algebra. Although Graham was as capable and willing as any member of staff to lecture on subjects such as differential equations, he used his influence to ensure that algebra was given its proper place in the curriculum, and it was due to his efforts that the distinguished German algebraist,\nHans Zassenhaus\nspent the year\n1948\n-\n49\nin Glasgow and became his close friend. Graham had an excellent and ready command of English and Scots, and was an able and amusing speaker at students' final year dinners and on similar occasions. As a member of the Faculty of Science and of Senate his contributions were always well thought out and sensible. He was one of the original editors of the 'Glasgow Mathematical Journal', which was founded by Professor\nMacRobert\nin\n1952\n; the detailed editorial work was his chief responsibility and made full use of his meticulous qualities. He continued this work after his retirement in\n1970\nand this compensated in a small measure for his regret at giving up his work of teaching and advising students, which he had so much enjoyed and carried out so well and sympathetically.\nGraham married Crease Barr in Glasgow in\n1941\n; they had a daughter and two sons.\nTommy Graham attended the\nEdinburgh Mathematical Society\nColloquium held in St Andrews in\n1934\n,\n1938\n,\n1951\n,\n1955\n,\n1959\n,\n1964\nand\n1968\n. This means that he attended every one of these meetings from the time that he was appointed as an assistant in Glasgow up until he retired. He was elected President of the\nEdinburgh Mathematical Society\n, serving in\n1952\n-\n53\n. He also attended the International Congress of Mathematicians in Cambridge, Massachusetts, USA from\n30\nAugust to\n6\nSeptember\n1950\n.\nRobert Rankin\nwrites\n[\n1\n]\n:-\nTommy Graham was a cheerful man, a loyal colleague and an able mathematician.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}