{
  "nome_completo": "Thomas John I'Anson Bromwich",
  "nome_curto": "Thomas Bromwich",
  "ano_nascimento": "1875",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bromwich/",
  "lugar_nascimento": "Wolverhampton, England",
  "lugar_morte": "Northampton, England",
  "biografia": "Thomas Bromwich\n's father, John I'Anson Bromwich\n(\nborn Bridgenorth, Shropshire about\n1843)\n, was a woollen draper and his mother was Eliza Ann Cook\n(\nborn Bridgenorth, Shropshire about\n1853)\n. Thomas was born at Queen's Square, Wolverhampton, and he began his schooling in that town before his parents emigrated to South Africa. He spent his youth in Natal, receiving his schooling at the High School in Durban from\n1888\nto\n1892\n.\nHe returned to England to study at St John's College Cambridge arriving in\n1892\n, in the same year as\nWhittaker\n. He obtained a Fellowship at St John's College in\n1897\nbut left Cambridge to become professor of mathematics at Galway in\n1902\n. He left Galway in\n1907\nand returned to a permanent post as College lecturer at St John's College, Cambridge.\nDuring his tenure of the chair at Galway he was elected a Fellow of the\nRoyal Society\n(1906)\n. Throughout his career he was an active member of the\nLondon Mathematical Society\n, being Secretary from\n1911\nuntil\n1919\nwhen he was elected Vice-President.\nBromwich's first research was on applied mathematics where was influenced by\nStokes\n. He made significant contributions to electromagnetism although he was always less interested in the physics, more in the mathematics. Some of this work is described in\n[\n6\n]\nwhere its history is explained:-\n... T J I'A Bromwich's method for solving the source-free\nMaxwell\nequations for electromagnetic waves. ... was originally used by Bromwich in\n1899\n, and subsequently independently discovered by\nH M Macdonald\n. It was first included as a question in Part II of the Mathematical Tripos in\n1910\nand featured by Bromwich in his lectures at Cambridge during the same year. He published this method in\n1919\n, and it also formed the basis of his seminal paper on the scattering of plane electric waves by spheres.\nBromwich also made substantial contributions to pure mathematics. He worked on infinite series, particularly during his time in Galway. In\n1908\nhe published his only large treatise\nAn introduction to the theory of infinite series\nwhich was based on lectures on analysis he had given at Galway.\nHardy\nsaid:-\nThe book is unquestionably a very fine one. It is not merely a good and an interesting book: it has a character and a distinction which show at once that it is written by an exceptional mathematician.\nBromwich also made useful contributions to\nquadratic\nand bilinear forms and many consider his algebraic work to be his finest. In\n1906\nhe published\nQuadratic Forms and their Classification by Means of Invariant Factors\n. Gow\n[\n3\n]\nwrites:-\nThis book is an early example in English of the more abstract methods introduced into algebra by researchers such as\nKronecker\nand\nWeierstrass\n. It is particularly concerned with the simultaneous reduction of two quadratic forms, a problem which, in its modern presentation, requires almost the full repertoire of the theory of a single linear transformation.\nIn a series of papers he put\nHeaviside\n's calculus on a rigorous basis treating the operators as contour integrals.\nBromwich did his best work before reaching the age of\n33\n, perhaps suffering because of overwork after this time.\nHardy\nsaid, see\n[\n5\n]\n:-\nHe was engaged in original work in several different fields: he put a great deal of energy into his college and university lectures, where his passion for working out every detail must have added enormously to his labours: and to all this he added a considerable amount of examining and private coaching. ... He would have had a happier life, and been a greater mathematician, if his mind had worked with less precision.\nThe hard work which Bromwich put into his teaching certainly had a negative effect on his research, and perhaps, as\nHardy\nsuggests, on his happiness. But on the other hand it had a very positive effect on his teaching. This is clearly illustrated by the summing up of his years at Cambridge in\n[\n2\n]\n:-\nFor many years he was one of the best-known mathematical teachers at Cambridge, and his lectures and tuition were diligently attended by those aiming at high mathematical honours.\nUnfortunately his health began to suffer through this hard work and he became afflicted by a mental disorder which eventually led to his suicide.\nHardy\nsummed up Bromwich's contributions across a wide range of mathematical areas when he described him as the:-\n... best pure mathematician among the applied mathematicians at Cambridge, and the best applied mathematician among the pure mathematicians.\nHe did make some slightly critical comments regarding Bromwich, however, describing him as \"thinking vaguely\" and \"a little wanting in imagination\".",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}