{
  "nome_completo": "Thomas Craig",
  "nome_curto": "Thomas Craig",
  "ano_nascimento": "1855",
  "ano_morte": "1900",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Craig_Thomas/",
  "lugar_nascimento": "Pittston, Luzerne county, Pennsylvania, USA",
  "lugar_morte": "Baltimore, Maryland, USA",
  "biografia": "Thomas Craig\n's parents were Alexander Craig\n(1827\n-\n1910)\nand Mary Hall\n(1836\n-\n1890)\n, both of whom had been born in Scotland. Alexander Craig was a mining engineer who had emigrated from Scotland and was working in the coal mining industry of Luzerne county. Thomas's school education was in the local Pittston schools where he showed himself to be talented, bright and very successful. In September\n1871\n, when fifteen years old, he entered Lafayette College in Easton, Northampton county, Pennsylvania. This College, named after the Marquis de Lafayette who was a French aristocrat who fought for the American colonists against the British in the American Revolution, had opened for teaching in\n1832\n. It was one of the first colleges in the United States to offer an engineering qualification and Craig, who at this time was intent on following his father into a career in engineering, sought a qualification in this subject.\nCraig's time at Lafayette College was more eventful than his outstanding record in school in Pittston would have predicted. His college record contains the following statement from the registrar\n(\nsee\n[\n7\n]\n)\n:-\nIn Pittston he received enthusiasm from Professor William J Bruce, a teacher who made him his protégé. His conduct was always exemplary, and his moral character unspotted. For digging up a lamp post belonging to the city of Easton and transplanting it to the grounds of Lafayette College, he and some other students were detected by the police, fined by the Mayor, and coercively removed\n(\nrusticated\n)\nby the Faculty to Frazer, Pennsylvania, to study alone for one month under the charge of that accomplished teacher, Rev. John C Clyde, D.D., pastor of the Presbyterian Church. This method of treatment cured the entire party of a desire to engage in further mischief.\nAfter four years studying at Lafayette College, Craig graduated with a C.E., a civil engineering degree, in\n1875\n. However, rather than continue to a career in engineering, he took a position as a mathematics teacher at the High School in Newton, Sussex county, New Jersey. He had now developed a passion for mathematics and was studying on his own so that he might progress further in the topic. He became excited when he heard about the project to set up Johns Hopkins University and he applied to study there. When Johns Hopkins University opened in Baltimore, Maryland, in\n1876\nit was the first American university based on the research model of the German universities of the time.\nJames Joseph Sylvester\naccepted the chair of mathematics at the University and fitted well into the idea behind the new university to merge research and teaching. Craig entered the university in\n1876\nwhen it opened, one of fifteen students, and he was appointed as a fellow while he worked for his doctorate. He held his fellowship for three years,\n1876\n-\n79\n, and submitted his doctoral thesis\nThe Representation of One Surface Upon Another, and Some Points in the theory of the Curvature of Surfaces\nin\n1878\n. He was one of the first to receive a degree from Johns Hopkins University. In the same year as he was awarded his doctorate,\n1878\n, his first paper\nThe Motion of a Point Upon the Surface of an Ellipsoid\nwas published in the\n4\nth\npart of the first volume of the\nAmerican Journal of Mathematics\n.\nEven before he received his Ph.D. Craig was lecturing at Johns Hopkins. In\n1879\nhe published two books. One was\nA General Differential Equation in the Theory of the Deformation of Surfaces\nwhich was reprinted from the\nJournal\nof the Franklin Institute. The other was the\n178\npage book\nElements of the Mathematical Theory of Fluid Motion. Wave and Vortex Motion\nwhich was reprinted from\nVan Nostrand's Magazine\n.\nFor Craig's Preface to\nWave and Vortex Motion\nsee\nTHIS LINK\n.\nCraig owned a manuscript of\nKarl Weierstrass\n's lectures on the 'Calculus of Variations' which\nWeierstrass\ndelivered in Berlin in the summer semester of\n1879\n. The manuscript is in German. It seems more likely that Craig was given a copy of a manuscript of these lectures rather than that he attended\nWeierstrass\n's course in Berlin.\nAfter his fellowship ended in\n1879\n, Craig was appointed as a member of staff at Johns Hopkins University but, to supplement his income, he also took a part-time job with the United States Coast and Geodetic Survey in Washington, D.C. Craig married Emily Louise Alvord, daughter of General Benjamin Alvord of the United States Army, on\n4\nMay\n1880\nin Washington, D.C. Emily had been born in Fort Vancouver, Washington on\n20\nOctober\n1858\n. Thomas and Emily Craig had two children: Ailsa Craig, born in Washington D.C. on\n28\nAugust\n1883\n; and Ethel Craig, born in Baltimore, Maryland, on\n26\nOctober\n1891\n.\nSoon after joining the Coast and Geodetic Survey, he wrote\nA Treatise on Projections\n(1880)\n. For an extract from Craig's Preface to this work see\nTHIS LINK\n.\nIn\n1881\nCraig ended his part-time appointment with the Coast and Geodetic Survey but, of course, continued in his position at Johns Hopkins University. He published on the theory of\nelliptic functions\nand the geometry of the ellipsoid. In the\nAmerican Journal of Mathematics\nhe published papers such as:\nOrthomorphic projection of an ellipsoid on a sphere\n(1880)\n;\nOn certain metrical properties of surfaces\n(1881)\n;\nThe counter-pedal surface of the ellipsoid\n(1881)\n;\nSome elliptic function formulae\n(1882)\n; and\nNote on the counter-pedal surface of the ellipsoid\n(1882)\n. In\nAugust Crelle\n's\nJournal für die reine und angewandte Mathematik\nhe published\nOn the parallel surface to an ellipsoid\n(1882)\nand\nNote on parallel surfaces\n(1883)\n. In publishing in this top quality European journal, Craig was one of the first Americans to publish papers outside the United States.\nLet us look a little at Craig's teaching by taking an example of the year\n1881\n-\n82\n. In that year there were\n30\nstudents studying mathematics at Johns Hopkins, see\n[\n4\n]\nand\n[\n5\n]\n. In the First Half-Year of\n1881\n-\n82\nCraig taught the following courses: 'Mathematical Seminary'\n(\nalong with\nJ J Sylvester\nand\nWilliam Story\n)\n; 'Calculus of Variations'\n(2\nlectures each week\n)\n; 'Spherical Harmonics'\n(2\nlectures each week\n)\n; 'Mechanics'\n(3\nlectures each week\n)\n; 'Elliptic Functions'\n(3\nlectures each week\n)\n. In the Second Half-Year of\n1881\n-\n82\nCraig taught the following courses: 'Mathematical Seminary'\n(\nalong with\nJ J Sylvester\n,\nArthur Cayley\nand\nWilliam Story\n)\n; 'Elliptic Functions'\n(3\nlectures each week\n)\n; 'Elasticity'\n(3\nlectures each week\n)\n; and 'Partial Differential Equations'\n(3\nlectures each week\n)\n. He also attended\nSylvester\n's 'Multiple Algebra' course\n(2\nlectures each week\n)\nand\nCayley\n's 'Algebraical Geometry, and the Abelian and Theta Functions'\n(2\nlectures each week\n)\n. We also give, in much less detail, his courses in the following year\n1882\n-\n83\n. In the First Half-Year of\n1882\n-\n83\nCraig's courses were: 'Elliptic Functions'; 'Definite Integrals'; 'Mechanics'; and 'Calculus of Variations'. In the Second Half-Year of\n1882\n-\n83\nCraig's courses were: 'Partial Differential Equations'; 'Elliptic and Theta Functions'; and 'Hydrodynamics'. We note that\nJohn Charles Fields\nentered Johns Hopkins University in\n1884\n. In\n[\n1\n]\nthe courses given by Craig which\nFields\nattended are given.\nFields\nreceived his Ph.D. degree in\n1887\nand the author of\n[\n1\n]\nconjectures that Craig was his thesis advisor.\nWe have mentioned some of Craig's books already but perhaps the best known of his works was\nA Treatise on Linear Differential Equations\npublished in\n1889\n. For an extract from the Preface to this work and an extract from a review see\nTHIS LINK\n.\nCraig was a contributor to and an assistant editor of the\nAmerican Journal of Mathematics\nfor several years, and then its editor from\n1894\nto\n1899\n[\n8\n]\n:-\nDuring his editorship he devoted himself with great energy to the interests of the 'American Journal of Mathematics'. The principal object of at least one of his visits abroad was to interest European geometers in it. He recognized and admired the genius of\nPoincaré\n; and two elaborate memoirs by the latter, which appeared in the seventh and eighth volumes, were believed to have been sent to the 'American Journal of Mathematics' on Craig's personal solicitation.\nF P Matz writes\n[\n7\n]\n:-\nThat Dr Craig was very optimistic is well known to the writer, whose senior he was by some years. Writes President Gilman in his Annual Report of the University of\n1900\n: \"Kindness toward young men and readiness to encourage them were among his admirable qualities.\" Speaking from a personal acquaintance extending over many years, the writer always found Dr Craig to be an efficient workman, a pleasant companion, a warm friend, and a good man. With his students he associated familiarly, and occasionally he invited them to spend a mathematical evening at his home. Dr Craig was an admirable lecturer. He had the ability to communicate what is known. His lectures were always thoroughly prepared; and he always had a comprehensive, accurate, and clear knowledge of what he intended to impart. It is well known that, as a lecturer, Dr Craig thought quickly, spoke rapidly, and wrote with great celerity. It is true that some of his lectures on differential equations, on hydrodynamics, and on the theory of functions were very advanced and very difficult; and those lectures could be followed with profit only by the maturest of his students.\nSimon Newcomb\nwrites\n[\n8\n]\n:-\nAs an expounder of mathematical subjects to advanced students, Craig's abilities were of a high order. His lectures were well prepared, and he spoke with rapidity, clearness and force. It may well be that only the best students were able to keep up with him, but these profited in a high degree from his expositions and entertained a permanent appreciation of his efforts for their development. Concentrating his interests almost entirely on his family and his students, rarely taking a long rest, he mingled little with men, especially in his later years, when his activities were greatly restricted by failing health.\nThe Johns Hopkins University Annual Report for\n1900\nrecords Craig's death\n[\n9\n]\n:-\nThe death of Professor Craig occurred on the\n8\nth\nof May,\n1900\n, after a long period of declining powers. Those who knew Dr Craig only in his declining years, need to be told of the enthusiasm, the diligence, and the learning which for a long period were his distinguishing characteristics. He was one of a company of bright young mathematicians who came to the University in its first year, attracted by the brilliant reputation of Professor Sylvester. He showed at once extraordinary powers of acquisition, as well as great ability in the treatment of certain subjects in the domain of higher mathematics. In addition to his contributions to mathematical journals, he published, in\n1879\n, two manuals on the elements of the mathematical theory of fluid motion, and, in\n1889\n, the first volume of a treatise on linear differential equations, a continuation of which was not completed at the time of his death.\nA Baltimore newspaper reported his death as follows:-\nDr Thomas Craig, the Professor of Pure Mathematics in the Johns Hopkins University, died suddenly of heart failure, May\n8\n,\n1900\n, at his residence,\n1822\nSt Paul Street. He had been complaining of feeling unwell for several weeks, although he was at the University as usual that morning. He returned home about noon, and went to his room for a rest before dinner. A member of the family went to call him for dinner and found him dead. Coroner Saunders gave a verdict of death from heart failure.\nAlthough he died in Baltimore, Craig was buried at the town of his birth, Pittston, Pennsylvania, beside his mother who his died ten years before. Craig's father outlived him by ten years.\nAlthough it repeats much of what we have already written above, we end our biography by giving the appreciation to Thomas Craig unanimously adopted at a meeting of the Johns Hopkins Board of University Studies, held on\n23\nMay\n1900\n:-\nThe members of the Board of University Studies of the Johns Hopkins University desire to express their sorrow at the death of their friend and colleague, Professor Thomas Craig, who, as student and teacher of mathematics, had been connected with the University for nearly the entire period of its existence. One of the brilliant young men whom Professor\nSylvester\nattracted to the University in its early days, he won straightway the favourable notice of that eminent man for the enthusiasm and intellectual acumen with which he entered upon the study of advanced mathematics, then almost an unknown science in this country; and this fortunate combination of interest, energy, and ability characterized his entire career. At the time of his death he was occupied in the preparation of a treatise on the 'Theory of Surfaces'. Undoubtedly the intense ardour with which he engaged in this work contributed in large measure to that impairment of the nervous system from which he had recently suffered. Professor Craig possessed great power of research, and wrote much for various mathematical journals. For many years he was editor of the 'American Journal of Mathematics', and it is largely due to his zeal and able direction that that journal continues to hold its high rank in the mathematical world. Professor Craig occupied a place in the very front rank of American mathematicians. His scientific ideals were the highest, and as teacher, editor, and investigator, he brought to his work a high degree of originality, and an intellectual ardour which was a source of inspiration to all with whom he was closely associated.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}