{
  "nome_completo": "Thomas Murray MacRobert",
  "nome_curto": "Thomas MacRobert",
  "ano_nascimento": "1884",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacRobert/",
  "lugar_nascimento": "Dreghorn, Ayrshire, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Thomas MacRobert\n's parents were Isabella Edgeley Fisher and the Rev Thomas MacRobert. The Rev MacRobert was a minister in the church at Dreghorn, a position he held for\n57\nyears. He held strong political views, and gave strong Liberal support. He was a friend of Keir Hardie, who was elected to Parliament as an Independent in\n1892\non the manifesto of supporting working men and in\n1906\nbecame the first to lead the Labour Party in the House of Commons. The Rev MacRobert was also prominent in the Congregational Union and served as its President. The political and religious influences on the young MacRobert as he grew up remained important factors throughout his life. In fact, so strong were these influences that he later considered following his father into the Church, and still later he considered a life in politics.\nMacRobert entered the University of Glasgow in\n1901\n.\nRankin\nwrites\n[\n2\n]\n:-\nHis original intention was to follow his father in the Congregational ministry; he used to say that he gave up the idea because he considered that he would have made a poor preacher.\nHe graduated with both an M.A. with First Class Honours in Mathematics and Natural Philosophy and a B.Sc. with Special Distinction in Mathematics and Natural Philosophy in\n1905\n. Although he had a very successful undergraduate career, he certainly did not devote himself single-mindedly to his studies. He still had political ambitions and he showed his talents in this area when he became highly involved with the Rectorial elections at the University.\nAfter completing his undergraduate studies at Glasgow, MacRobert took the route many other leading Scots took at that time and followed his degree from a Scottish University with a degree at Cambridge. He sat the scholarship examinations for Trinity College and was given a major award. He was a\nWrangler\nin Part I of the Mathematical Tripos in\n1908\nand was First Class in Part II in\n1910\n.\nRankin\nwrites\n[\n2\n]\n:-\nMacRobert enjoyed his time at Cambridge. He spoke in the Union, supporting the policies of the Liberal Government, for which he had a great admiration; he even considered seriously making his career in politics.\nAfter taking Part II, MacRobert returned to Glasgow where, in October\n1910\n, he was appointed as an Assistant to\nGibson\nwho had been named professor of mathematics at Glasgow University in the previous year. MacRobert spent his whole career at Glasgow. He was promoted to Lecturer in Mathematics there in\n1913\n. Of course World War I broke out in the following year and MacRobert served as a Lieutenant in the Royal Garrison Artillery for the period of the war. After\nGibson\nretired due to ill health in\n1927\n, he was appointed to fill the chair. He held the chair in Glasgow for\n27\nyears until he retired in\n1954\nat the age of\n70\n. In\n1914\nMacRobert married Violet McIlreaith; they had one daughter and two sons.\nFrom the description above it is clear that MacRobert was appointed to Glasgow without having undertaken research. In fact he did not publish his first paper until\n1916\nafter he had completed three years as an Assistant and a further three years as a Lecturer. However in\n1917\nhe published an important book\nFunctions of a complex variable\nand in the same year he was awarded a D.Sc. by the University of Glasgow for his work on functions of a complex variable. Reviewing the third edition of the book, published in\n1947\n,\nR P Boas, Jr\nwrites:-\nThe first edition of this well-known text appeared in\n1917\n, the second in\n1933\n. Its special features are an emphasis on geometrical methods, extensive discussion of special functions and second-order differential equations, and a profusion of illustrative examples. The new edition differs from the second by the addition of an appendix\n[20\npages\n]\non generalized\nhypergeometric functions\nand a collection of\n125\nnew miscellaneous examples.\nWe should say something of MacRobert's involvement with three Scottish societies; the\nEdinburgh Mathematical Society\n, the\nRoyal Society of Edinburgh\nand the Glasgow Mathematical Association. He was a member of the\nEdinburgh Mathematical Society\nfor many years and served as President of the Society in\n1921\n-\n22\n. In\n1927\nhe brought forward proposals to the Committee.\nRankin\nwrites:-\n... his scheme was that the Proceedings should be retained for research papers, but that the Society should publish in place of the Mathematical Notes a new periodical, to be called the Journal of the Edinburgh Mathematical Society, which would contain articles on History, Methods of Teaching, Notes, Discussions on Elementary Mathematics, etc.\nAfter much discussion and changes in proposed publication strategy by the Society, MacRobert finally resigned from the Committee early in\n1931\nand later that year he withdrew Glasgow's invitation to hold meetings of the Society there. No further meetings of the\nEdinburgh Mathematical Society\ntook place in Glasgow until after MacRobert retired.\nMacRobert was elected a fellow of the\nRoyal Society of Edinburgh\non\n7\nMarch\n1921\nproposed by\nGeorge Alexander Gibson\n, Andrew Gray, James Gordon Gray, and Robert Alexander Houstoun. He served on the Council of that Society from\n1931\nto\n1934\nbut he resigned from the Society in\n1940\n. The third society that MacRobert was involved with was the Glasgow Mathematical Association of which he was a founder member. He served twice as President of the Association and towards the end of his career he was made Honorary President.\nRankin\nwrites\n[\n2\n]\n:-\nIt was entirely due to his initiative that the Association, with the support of the University Court of the University of Glasgow, embarked in\n1951\non the publication of its Proceedings, and he served on the editorial committee until his death.\nWe have said little so far about MacRobert's mathematics. We noted above that he published his classic text\nFunctions of a complex variable\nin\n1917\n. In fact it was his second publication and he published further books\nSpherical harmonics\n(1927)\nand\nTrigonometry\n(\nin four parts in\n1937\n-\n38)\n. Reviewing the second edition of\nSpherical harmonics : An Elementary Treatise on Harmonic Functions with Applications\n(\nto give the work its full title\n)\nwhich was published in\n1947\n,\nErdélyi\nwrote:-\nThis work contains a great deal more than its title would seem to promise. It is a very useful text-book on special functions, and an introduction to their application to partial differential equations of mathematical physics. The treatment is at the level of a course in advanced calculus; accordingly no contour integration methods are used, and all variables and parameters are real, except in the last two chapters in which the variable is complex.\nIn fact the most important of MacRobert's research only started in the middle of the\n1930\ns when he discovered the\nE\nE\nE\n-function\n[\n2\n]\n:-\nUp to that point MacRobert had no clearly delineated field of research but applied his analytical skill to a variety of problems connected with special functions, especially functions related to hypergeometric functions, and related topics.\nThe\nE\nE\nE\n-function was a generalisation of the generalised hypergeometric functions, and from\n1938\nonwards MacRobert produced a whole series of works on the properties of the\nE\nE\nE\n-function and integrals with\nE\nE\nE\n-functions. To read MacRobert's own description of the\nE\nE\nE\n-function we refer the reader to the fourth edition of his\nFunctions of a complex variable\n(1954)\n.\nWe now describe briefly some of these papers.\nFormulae for generalized hypergeometric functions as particular cases of more general formulae\n(1939)\nshowed how certain known formulae for generalized hypergeometric functions can be derived as particular cases of formulae of more general type involving multiple series;\nSome formulae for the E-function\n(1941)\nshowed how special cases of the formulae derived lead to interesting relations between\nBessel functions\n,\nLegendre\nfunctions and confluent hypergeometric functions; and\nProofs of some formulae for the hypergeometric function and the E-function\n(1943)\ngave alternative proofs for some known theorems on hypergeometric functions, then gives a formula for an integral involving the product of two\nE\nE\nE\n-functions. He continued to produce papers on the\nE\nE\nE\n-function such as\nOn an identity involving E-functions\n(1948)\n,\nIntegral of an E-function expressed as a sum of two E-functions\n(1953)\n,\nAn integral involving an E-function and an associated\nLegendre\nfunctions of the first kind\n(1953)\n,\nIntegrals involving E-functions\n(1958)\n,\nInfinite series of E-functions\n(1959)\n. In fact MacRobert published four further papers\n(\nin addition to the above\n)\nin\n1959\n, five in\n1960\n, three in\n1961\nand three in\n1962\nwhich was the year of his death.\nRankin\ndescribes MacRobert's qualities as a colleague and teacher in\n[\n2\n]\n:-\nThe affection and respect in which he was held by colleagues and former students was amply demonstrated when, after his retirement, they commissioned Mr Norman Hepple\n(\nnow R.A.\n)\nto paint his portrait. This fine picture, conveying something of his character and personality, hangs in the Mathematics Classroom at Glasgow University. ... Not only Glasgow students received MacRobert's willing help; many mathematicians overseas, whose researches followed the lines of his work, benefited greatly from his advice, and he gave them generous help, particularly in the preparation of the manuscripts of their papers for publication in British journals.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}