{
  "nome_completo": "Thomas Bayes",
  "nome_curto": "Thomas Bayes",
  "ano_nascimento": "1702",
  "ano_morte": "1761",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bayes/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Tunbridge Wells, Kent, England",
  "biografia": "Thomas Bayes\n' father, Joshua Bayes, was one of the first six Nonconformist ministers to be ordained in England. He was ordained in\n1694\nand moved to Box Lane Chapel, Bovington, about\n25\nmiles from London. Thomas's mother was Anne Carpenter. The family moved to Southwark, London, when Thomas was young and there Joshua became an assistant at St Thomas's and also an assistant at the Chapel in Leather Lane, Holborn. Thomas was the eldest of his parents seven children, four boys and three girls.\nIn\n[\n1\n]\nHacking claims that Thomas was educated privately, something he says appears necessary for the son of a Nonconformist minister at that time. If this is the case, then nothing is known of his tutors but Barnard in\n[\n6\n]\npoints out the intriguing possibility that he could have been tutored by\nde Moivre\nwho was certainly giving private tuition in London at the time. However other historians\n(\nsee for example\n[\n21\n]\n)\nsuggest that Thomas received a liberal education for the ministry. In that case it is likely that he attended Fund Academy in Tenter Alley which was the only school with the right religious connections near where Bayes lived.\nWe do know that in\n1719\nBayes matriculated at the University of Edinburgh where he studied logic and theology. He had to choose a Scottish university if he was to obtain his education without going overseas since, at this time, Nonconformists were not allowed to matriculate at Oxford or Cambridge. Records which still survive at the University of Edinburgh record that he gave the homily on\n14\nJanuary\n1721\nwith the text being \"Matthew Chapter\n7\nverses\n24\n-\n27\n\", and again on\n20\nJanuary\n1722\nwith the text being \"Matthew Chapter\n11\nverses\n29\n-\n30\n\". He left the University as a probationer, but he was not ordained at this stage. At some time Bayes must have studied mathematics but there is no evidence that he did so at Edinburgh University. However, he certainly had the opportunity to study mathematics at Edinburgh and when he wrote at age\n34\n:-\nI have long ago thought that the first principles and rules of the method of Fluxions stood in need of more full and distinct explanation and proof ...\nhe certainly suggests that his interest went back to his student days or perhaps shortly afterwards.\nThomas Bayes was ordained, a Nonconformist minister like his father, and at first assisted his father in Holborn. In about\n1733\nhe became minister of the Presbyterian Chapel in Tunbridge Wells,\n35\nmiles southeast of London, on the death of the previous minister John Archer. There is, however, evidence that he was associated with Tunbridge Wells before\n1733\n. One report states\n(\nsee for example\n[\n4\n]\nwhere this is quoted\n)\n:-\nJohn Archer died in\n1733\nbut was succeeded by Thomas Bayes in\n1730\n, who was a man of considerable attainment. It appears that Thomas Bayes left Tunbridge Wells in\n1728\nand returned in\n1731\n. During this time he was at Leather Lane Presbyterian Church, London, where his father was pastor.\nOn\n24\nAugust\n1746\nWilliam Whiston\ndescribes having breakfast with Bayes who he says is:-\n... a dissenting Minister at Tunbridge Wells, and a Successor, though not immediate, to Mr Humphrey Ditton, and like him a very good mathematician.\nBayes apparently tried to retire from the ministry in\n1749\nbut remained minister at Tunbridge Wells until\n1752\nwhen he did retire, but continued to live in Tunbridge Wells.\nBayes set out his\ntheory of probability\nin\nEssay towards solving a problem in the doctrine of chances\npublished in the\nPhilosophical Transactions of the Royal Society of London\nin\n1764\n. The paper was sent to the\nRoyal Society\nby\nRichard Price\n, a friend of Bayes', who wrote:-\nI now send you an essay which I have found among the papers of our deceased friend Mr Bayes, and which, in my opinion, has great merit... In an introduction which he has writ to this Essay, he says, that his design at first in thinking on the subject of it was, to find out a method by which we might judge concerning the probability that an event has to happen, in given circumstances, upon supposition that we know nothing concerning it but that, under the same circumstances, it has happened a certain number of times, and failed a certain other number of times.\nDale writes in\n[\n4\n]\n:-\nWhat may the reader expect to find in this Essay? As regards probability, he will expect, of course, some or other version of what has become known as 'Bayes's theorem': and such expectation will indeed be met. In addition he will find a clear discussion of the binomial distribution and if he should probe even deeper he will find ... the first occurrence of a probability logic result involving conditional probability. The Essay should be of interest to mathematicians for the evaluation of the incomplete beta-function. We note too the use of approximations to various integrals made here and in the Supplement by both Bayes and\nPrice\n, and the attention paid to the question of the error incurred in the making of such approximation. The Essay, then, mainly, and perhaps justly, remembered for the solution of the problem posed by Bayes, should also be remembered for its contribution to pure mathematics.\nBayes's conclusions were accepted by\nLaplace\nin a\n1781\nmemoir, rediscovered by\nCondorcet\n(\nas\nLaplace\nmentions\n)\n, and remained unchallenged until\nBoole\nquestioned them in the\nLaws of Thought\n. Since then Bayes' techniques have been subject to controversy.\nBayes also wrote an article\nAn Introduction to the Doctrine of Fluxions, and a Defence of the Mathematicians Against the Objections of the Author of The Analyst\n(1736)\nattacking\nBerkeley\nfor his attack on the logical foundations of the calculus. In the Preface Bayes gives his reasons for writing the text:-\nI have long ago thought that the first principles and rules of the method of Fluxions stood in need of more full and distinct explanation and proof, than what they had received either from their first incomparable author, or any of his followers; and therefore was not at all displeased to find the method itself opposed with so much warmth by the ingenious author of the Analyst; and had it been his only design to bring this point to a fair issue, whether a demonstration by the method of Fluxions be truly scientific or not, I should have heartily applauded his conduct, and have thought he deserved the thanks even of the Mathematicians themselves. But the invidious light in which he has put this debate, by representing it as of consequence to the interests of religion, is, I think, truly unjustifiable, as well as highly imprudent.\nBayes writes that\nBerkeley\n:-\n...represents the disputes and controversies among mathematicians as disparaging the evidence of their methods: and ... he represents Logics and\nMetaphysics\nas proper to open their eyes, and extricate them from their difficulties. ... If the disputes of the professors of any science disparage the science itself, Logics and Metaphysics are much more disparaged than Mathematics, why, therefore, if I am half blind, must I take for my guide one that can't see at all?\nBayes was elected a Fellow of the\nRoyal Society\nin\n1742\ndespite the fact that at that time he had no published works on mathematics, indeed none were published in his lifetime under his own name, the article on fluxions referred to above was published anonymously. Another mathematical publication on asymptotic series appeared after his death where he showed that the series for\nlog\n⁡\nz\n!\n\\log z!\nlo\ng\nz\n!\ngiven by\nStirling\nand\nde Moivre\n, was not valid since it diverged.\nThere are a few other pieces of mathematics which have come down to us from Bayes and we now look at some of these. The first we mention is a letter which he wrote, probably around\n1756\n. Bayes wrote:-\nYou may remember a few days ago we were speaking of Mr\nSimpson\n's attempt to show the great advantage of taking the mean between several astronomical observations rather than trusting to a single observation carefully made, in order to diminish the errors arising from the imperfection of instrument and the organs of sense.\nIn fact\nSimpson\nhad made the same error that the French would make nearly fifty years later with\nBorda\n's repeating circle, in believing that one could make the error in the observation as small as one desired by making multiple observations. However, Bayes realised that this was not so and wrote in his letter:-\nNow that the errors arising from the imperfection of the instrument and the organs of sense should be thus reduced to nothing or next to nothing only by multiplying the number of observations seems to me extremely incredible. On the contrary the more observations you make with an imperfect instrument the more it seems to be that the error in your conclusion will be proportional to the imperfection of the instrument made use of ...\nIn\n[\n4\n]\na notebook which was almost certainly written by Bayes is examined in detail. This notebook contains a considerable amount of mathematical work, including discussions of probability, trigonometry, geometry, solution of equations, series, and differential calculus. There are also sections on natural philosophy in which Bayes looks at topics which include electricity, optics and celestial mechanics.",
  "math_areas": [
    "Logic",
    "Statistics"
  ]
}