{
  "nome_completo": "Thomas Hobbes",
  "nome_curto": "Thomas Hobbes",
  "ano_nascimento": "1588",
  "ano_morte": "1679",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hobbes/",
  "lugar_nascimento": "Westport, Malmesbury, Wiltshire, England",
  "lugar_morte": "Hardwick Hall, Derbyshire, England",
  "biografia": "Thomas Hobbes\n's father, also named Thomas Hobbes, was the vicar of Charlton and Westport, close to Malmesbury in Wiltshire. Thomas Hobbes senior was described by Aubrey in\n[\n13\n]\nas:-\n... one of the ignorant Sir Johns of Queen Elizabeth's time; could only read the prayers of the church and the homilies; and valued not learning, as not knowing the sweetness of it.\nThomas Hobbes senior had an older brother, Francis Hobbes, who was a wealthy merchant with no family of his own. Thomas Hobbes, the subject of this biography, had one brother Edmund who was about two years older than he him. Thomas began his schooling in Westport Church when he was four years old. However, when he was seven years old, his father had an argument with another vicar at the door of his church. Blows were exchanged and Hobbes' father ran off. It is unclear what role his mother played in his upbringing after that, but he was certainly brought up by his uncle Francis after this.\nFrom age eight Hobbes, who was by this time proficient at reading and arithmetic, attended Mr Evan's school in Malmesbury, then later Robert Latimer's private school in Westport. Hobbes showed his brilliance at this school and was an outstanding Greek and Latin scholar by the time he left this school at age fourteen, having already translated Euripides'\nMedea\nfrom Greek into Latin iambics. Aubrey in\n[\n13\n]\ntells us that as a young boy Hobbes was sometimes playful, but also sometimes withdrawn and melancholy. Often at school\n[\n13\n]\n:-\n... he would get himself into a corner, and learn his lesson by heart.\nAfter leaving Robert Latimer's school, he entered Magdalen Hall, Oxford in\n1603\nwhere he continued to be supported financially by his uncle Francis. At that time the teaching at Oxford was dominated by a study of\nAristotle\nand Hobbes soon found that his opinions differed sharply from what was being taught\n[\n13\n]\n:-\nHe did not much care for logic, yet he learned it, and thought himself a good disputant. He took great delight there to go to the bookbinders' shops and lie gaping on maps.\nHe graduated with a B.A. in\n1608\nand on the recommendation of Sir James Hussey, Principal of Magdalen Hall, he became the tutor of William Cavendish, later the Second Earl of Devonshire. For around two years Hobbes did little in the way of academic studies, being more of a companion to Cavendish who was only a little younger that he was. In\n1610\nHobbes went with Cavendish on a European tour and they visited France, Germany, and Italy. He learnt French and Italian on this trip, but more importantly, it reinvigorated his desire for learning and he decided that he would pursue a study of classics. On his return Hobbes took up studying Greek and Latin again. He had progressed from being a tutor to Cavendish to being his secretary and having few duties he had plenty of time to devote to his studies.\nIn\n1626\n, on the death of his father, William Cavendish inherited the title the Earl of Devonshire, but two years later William died and Hobbes lost a friend as well as his secretarial post. William Cavendish's son was only eleven years old and Hobbes' services were no longer required by the Cavendish family at this time.\nHobbes was tutor to the son of Sir Gervase Clinton of Nottinghamshire, from\n1628\nto\n1631\n. During this period, in\n1629\n, he published his translation of Thucydides which he had been working on for several years. So far we have not mentioned any interest by Hobbes in mathematics, and perhaps even more surprisingly no particular interest in philosophy. In fact Hobbes was about forty years old before he became fascinated by mathematics. Although Aubrey's description of Hobbes encountering mathematics for the first time is, like so much of Aubrey, rather overdone, nevertheless his description in\n[\n13\n]\nis well worth recording:-\nHe was forty years old before he looked on geometry; which happened accidentally. Being in a gentleman's library\nEuclid\n's Elements lay open, and 'twas the forty-seventh proposition in the first book. He read the proposition. 'By God,' said he, 'this is impossible!' So he reads the demonstration of it, which referred him back to such a proof; which referred him back to another, which he also read. ... at last he was demonstratively convinced of that truth. This made him in love with geometry.\nHe undertook a second trip to the continent from\n1629\nto\n1631\nwith his new pupil. In\n1631\nthe Cavendish family requested his services again and he returned from Paris to become tutor to the third Earl of Devonshire, a position he held from\n1631\nto\n1642\n. During this time he again visited the continent, being there from\n1634\nto\n1637\n. On the continent he met\nGalileo\n,\nMersenne\n,\nGassendi\nand\nRoberval\nand became enthusiastic about the mechanical universe and began building his philosophical position relating everything to motion. In fact his views at this time appeared to be very much in line with the latest scientific ideas of the period. Back in England in\n1637\nHobbes worked on\nThe Elements of Law, Natural and Politic\nwhich was not published at the time. He described his mechanistic approach to perception in this work as follows:-\nWhatsoever accidents or qualities our senses make us think there be in the world, they be not there, but are seemings and apparitions only; the things that really are in the world without us, are those motions by which these seemings are caused.\nWhen the Civil War began in\n1640\nHobbes feared for his life, especially as he was a well known Royalist, and he fled to save his life. He lived in Paris from\n1640\nwhere again he made contact with\nMersenne\n's circle of scholars. There he wrote his objections to Descartes'\nMeditations\nand he published\nDe Cive\n(\nConcerning Citizenship\n)\nin\n1642\nwhich contained his ideas on the relation between the church and the state. After this he worked on optics, which was one of his favourite topics. Malet\n[\n28\n]\nwrites:-\nHobbes's theory of optical images\n[\nwas\n]\ndeveloped in his optical magnum opus \"A minute of first draught of the optiques\"\n(1646)\nand published in abridged version in \"De homine\"\n(1658)\n. ... Hobbes's theory of vision and images serves him to ground his philosophy of man on his philosophy of body. Furthermore, since this part of Hobbes's work on optics is the most thoroughly geometrical, it reveals a good deal about the role of mathematics in Hobbes's philosophy.\nHobbes published a new expanded edition of\nDe Cive\nin\n1647\n, then three years later, in\n1650\n, his earlier work\nThe Elements of Law, Natural and Politic\nwas published without his permission. It appeared in two parts as\nHumane Nature\nⓉ\n(\nHuman nature\n)\nand\nDe Corpore Politico\nⓉ\n(\nOf the body politic\n)\n.\nHobbes was the mathematics tutor of the Prince of Wales between\n1646\nand\n1648\n. He remained on the continent until\n1651\n, the year his most famous work\nLeviathan\nwas published then, late in that year, he returned to England. In fact he was now in some difficulties with all sides of the political spectrum. In England the Royalists, with Charles I dead, seemed to have lost their struggle for power. Passages near the end of the\nLeviathan\nappeared to indicate that Hobbes was trying to make his peace with the English government, which angered the Royalists. In fact in these passages Hobbes was remaining consistent with his view that one showed allegiance to a ruler only so long as that ruler could provide protection. Hobbes had also attacked the Roman Catholic Church which made his position in Paris pretty untenable.\nHobbes' masterpiece\nLeviathan\nset out his ideas with great clarity. He argued that people want to live in peace and security and to attain this they must organise themselves into communities for protection. Since there will always be some in the community who cannot be trusted, people must set up a government with their authority to make and enforce laws necessary to protect the community. It is, Hobbes argues, the rational way for people to behave so moral behaviour is rational. Although Hobbes was himself a Christian, these arguments were seen as many as removing the need for God as the giver of moral code, for Hobbes argues that it follows by reason alone. Another aspect of the work which caused many to attack it was Hobbes' vitriolic arguments against the university system.\nBefore this Hobbes had been seen by many as promoting a mechanistic scientific approach which was much in tune with those who would form the\nRoyal Society\n. Indeed he had argued that since what we know and understand only comes through our senses and all objects that our senses can detect are material, we can only view the world in a material way. He promoted an approach through language and mathematics to analyse experience which he claimed would lead to a complete mechanistic understanding of the world. The certainty of mathematics would lead to correct and indisputable conclusions about society and about man. His argument that all was material was seen as denying the existence of the immaterialistic soul and intellect. Seth Ward, the Savilian Professor of Astronomy at Oxford, wrote:-\n... he hath much injured the mathematics, and the very name of demonstration, by bestowing upon it some of his discourses, which are exceedingly short of that evidence and truth which is required to make a discourse able to bear that reputation.\nAt this stage, however, although Hobbes had published little in the way of mathematics, he certainly was considered by some as a leading mathematician on a par with\nRoberval\nand\nFermat\n.\nIn\n1655\nHobbes published\nDe Corpore\nⓉ\n(\nOn the Body\n)\nwhich, was one part of his trilogy of philosophy. He had already published\nDe Cive\nⓉ\n(\nOn the city\n)\n(1642)\nand the third part,\nDe Homine\nⓉ\n(\nOn man\n)\n, would appear in\n1658\n.\nDe Corpore\nⓉ\n(\nOn the Body\n)\ncontained a large amount of mathematical material; in fact Chapters\n12\nto\n20\nare devoted entirely to the topic. Hobbes saw mathematics as an essential part of knowledge, but he also saw his own materialistic approach as revolutionising the subject and he set out to reform mathematics in this work. His approach is certainly consistently materialistic, denying abstract ideas; for Hobbes mathematics is the study of quantity, and quantities are the measures of\n3\n-dimensional bodies. His definition of a point in\nDe Corpore\nⓉ\n(\nOn the Body\n)\n(\nwhich totally differs from that of\nEuclid\n)\nis as follows:-\nIf the magnitude of a body which is moved\n(\nalthough it must always have some\n)\nis considered to be none, the path by which it travels is called a line, and the space it travels along a length, and the body itself is called a point. This is the sense in which the earth is usually called a point and the path of its annual revolution the ecliptic line.\nLines, therefore, are the paths of moving points, surfaces are the paths of moving lines, volumes are the result of moving surfaces. He then proceeded to study ratios and angles, then acceleration, projectiles and the ideas of\nGalileo\nfollowed by a study of indivisibles and the ideas of\nCavalieri\n, the rectification of the spiral, and finally squaring the circle. It is fair to say that much of Hobbes' mathematical ideas are generalised from\nGalileo\n's study of mechanics and of motion. The new method of indivisibles, as put forward by\nCavalieri\n, was accepted by Hobbes but he rejected\nWallis\n's version as given in\nArithmetica infinitorum\nⓉ\n(\nInfinitesmal arithmetic\n)\n.\nJesseph writes of Hobbes' attempt to square the circle\n[\n5\n]\n:-\n... it is clear that he hoped to assert preeminence in the learned world largely on the basis of the solution of the problem of squaring the circle.\nHobbes had originally planned\nDe Corpore\nⓉ\n(\nOn the Body\n)\nwithout this result and, having added it late on, it did not really fit with the material surrounding it. Before\nDe Corpore\nⓉ\n(\nOn the Body\n)\nreached completion, however, Hobbes' friends pointed out an error in his squaring the circle argument. Hobbes did not remove the \"proof\" but renamed it \"From a false hypothesis, a false quadrature\". He then added a second proof which he quickly changed to only claim it was \"an approximate quadrature\". Finally he attempted a third exact proof but when the book was being printed he realised that it too, of course, was wrong. He had to leave the incorrect claim but added at the end of the chapter:-\n... the reader should take those things that are said to be found exactly of the dimension of the circle ... as instead said problematically.\nThis was a phrase that\nWallis\nwould pour scorn on when he attacked Hobbes' ideas. Although Hobbes did not believe that the \"proofs\" in\nDe Corpore\nⓉ\n(\nOn the Body\n)\nproved the result, he would go on to publish several \"proofs\" of squaring the circle over the next\n25\nyears which he did believe to be correct.\nWallis\nattacked the whole of Hobbes' mathematical work of\nDe Corpore\nⓉ\n(\nOn the Body\n)\nand a vigorous argument between the two arose which lasted for\n25\nyears. To Hobbes mathematics was geometry and only geometry, and\nWallis\n's\nAlgebra\nhe described as:-\n... a scab of symbols\n[\nwhich disfigured the page\n]\nas if a hen had been scraping there.\nHobbes claimed that the algebraic symbols could denote different things such as lines, surfaces or volumes, and therefore were unreliable in mathematical proofs. Hobbes responded to the attack by\nWallis\nand others of\nDe Corpore\nⓉ\n(\nOn the Body\n)\nby publishing\nSix Lessons to the Professors of Mathematics in the University of Oxford\nin\n1656\n.\nIn\n1660\nHobbes attacked the 'new' methods of mathematical analysis. In\nDialogus Physicus, sive de Natura Aeris\nⓉ\n(\nDialogue on physics or the nature of air\n)\n(1661)\nhe attacked\nBoyle\nand those setting up the\nRoyal Society\nwhich, as a matter of interest, never elected Hobbes as a Fellow\n(\nit is probably that since he was perceived as an atheist entry would have been impossible\n)\n.\nWallis\nreplied with telling mathematical arguments, but also with unfair charges of disloyalty. Hobbes ended the argument about disloyalty with\nMr. Hobbes Considered in His Loyalty, Religion, Reputation, and Manners\n(1662)\n. Hobbes could win arguments when his morality was attacked, but when it came to mathematics\nWallis\nhad a clear upper hand understanding mathematics far more deeply than Hobbes.\nOver the years Hobbes attempted to solve a number of outstanding mathematical problems. Jesseph, in\n[\n22\n]\n, studies:-\n... Hobbes's attempts to resolve three important mathematical controversies of the seventeenth century: the debates over the status of analytic geometry, disputes over the nature of ratios, and the problem of the 'angle of contact' between a curve and tangent.\nAlthough Hobbes is highly regarded as a philosopher, his mathematics has been essentially laughed at. However some have seen more in it than just errors.\nDe Morgan\nwrote that Hobbes:-\n... was not the ignoramus in geometry that he is sometimes supposed. His writings, erroneous as they are in many things, contain acute remarks on points of principle.\nGrant, in\n[\n21\n]\n, evaluates Hobbes' mathematical contributions and concludes that he was:-\n... an amateur of mathematics in the original and best sense of the word, and through his role as a minor stimulant of others' success he merits a modest place in its annals.\nHobbes defended his mathematical works to the end of his life. His errors were demonstrated so clearly that by\n1670\nessentially everyone considered him a mathematical illiterate, yet still he wrote articles in his defence even though it is doubtful whether anyone continued to read them. Let us end with the summary of what Hobbes believed that he had achieved in mathematics, written near the end of his life. Hobbes writes about himself in the third person\n(\nsee for example\n[\n5\n]\n)\n:-\nIn mathematics, he corrected some principles of geometry. he solved some most difficult problems, which had been sought in vain by the diligent scrutiny of the greatest geometers since the very beginnings of geometry; namely these:\n1\n. To exhibit a line equal to the arc of a circle, and a square equal to the area of a circle, and this by various methods.\n2\n. To divide an angle in a given ratio.\n3\n. To find the ratio of a cube to a sphere.\n4\n. To find any number of mean proportionals between two given lines.\n5\n. To describe a regular polygon with any number of sides.\n6\n. To find the centre of gravity of the quadrant of a circle.\n7\n. To find the centres of gravity of all types of parabolas.\nHe was the first to construct and demonstrate these, and many other things besides, which\n(\nbecause they will appear in his writings are less important\n)\nI pass over.\nHe was\n91\nyears of age when he died, a remarkable age for someone in that period. At age\n87\nhe completed translating the Iliad and the Odyssey into English verse and left London, where he had lived for many years, and spent his final years with the Cavendish family with whom he had been so closely connected throughout his life. At age\n91\n, shortly before his death, he was working on yet another book on squaring the circle. The dedication contains the sentence:-\nAnd so, after I had given sufficient attention to the problem by different methods, which were not understood by the professors of geometry, I added this newest one.\nHis final words are reported to have been:-\nI am about to take my last voyage, a great leap in the dark.\nLet us end this biography with a final thought. If Hobbes' mathematics was worthless why has so much effort been expounded on it even in the last few years\n(\nas the references show\n)\n. There is no doubt that Hobbes' mathematics is wrong, but strangely, that does not seem to make it worthless! As a philosopher he was a leading figure, having a major influence on political thought.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}