{
  "nome_completo": "Thomas Allen",
  "nome_curto": "Thomas Allen",
  "ano_nascimento": "1540",
  "ano_morte": "1632",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Allen/",
  "lugar_nascimento": "Uttoxeter, Staffordshire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Thomas Allen\nwas the youngest son of William Allen and his wife who was a \"Basset of Blore, Staffordshire\". Michael Foster\n[\n4\n]\nsuggests Margery Bassett, the daughter of Thomas Bassett and Ellen Coates, as the most likely \"Basset of Blore\" but this has not been confirmed. Thomas matriculated at the University of Oxford in\n1561\n, when he was twenty years old. He was admitted to Trinity College on\n4\nJune\n1561\n, six years after the College was founded. He was awarded a BA on\n13\nMay\n1563\nand, two years later, was elected a fellow of Trinity. He received an MA in\n1567\n[\n4\n]\n:-\nWe know little of Allen's personal life at Trinity, except that he began his great manuscript collection while he was an undergraduate there, and that he must have been happy because he retained a profound love and loyalty for the college all his life.\nAlthough Allen was nominally a member of the Church of England, it is clear that he came from a family with Roman Catholic connections and had leanings in that direction. This made Trinity a natural College for him to attend but it appears that increasing pressure was put on those with Catholic tendencies and several went to Gloucester Hall which provided a safe haven. In\n1670\nAllen resigned his fellowship at Trinity and moved to Gloucester Hall where he spent the rest of his life.\nJohn Aubrey gives a nice description of Allen and shows how, like all mathematicians of his time, he was regarded with great suspicion\n[\n3\n]\n:-\nMr Allen was a very cheerful, facetious man and everybody loved his company; and every House on their Gaudy Days were wont to invite him. The Great Dudley, Earl of Leicester, made use of him for casting of Nativities, for he was the best Astrologer of his time. Queen Elizabeth sent for him to have his advice about the new star that appeared in the Swan or Cassiopeia ... to which he gave his judgment very learnedly. In those dark times, Astrologer, Mathematician and Conjurer were accounted the same thing; and the vulgar did verily believe him to be a conjurer. He had a great many mathematical instruments and glasses in his chamber, which did also confirm the ignorant in their opinion; and his servitor\n[\nservant\n]\n(\nto impose on Freshmen and simple people\n)\nwould tell them that sometimes he should meet the spirits coming up his stairs like bees. ... He was a handsome, sanguine man and of excellent habit or body.\nThe \"new star\" referred to in this quote is now known as '\nTycho\n's supernova' and appeared in Cassiopeia in November\n1572\n. Let us emphasise that we should not think any the less of Allen because of his interests in magic and astrology; most of the great scientists and mathematicians of his time, and much later, had such interests. For example,\nTycho Brahe\nfirmly believed in alchemy and astrology as did\nCavalieri\nand\nKepler\n, while\nDee\n, and much later\nNewton\n, were obsessed with studying alchemy.\nWe have already noted Allen's interest in collecting manuscripts. Some have claimed that he possessed around\n600\nmanuscripts but this may be an exaggeration. However, details of about\n250\nmanuscripts that Allen possessed are known for they are still extant. About half of these were mathematical manuscripts and included a collection of works by\nRoger Bacon\n,\nJohannes de Sacrobosco\n,\nGherard of Cremona\n, the Merton calculators, and\nRamon Llull\n. This is an important contribution by Allen for many of these manuscripts would not have survived but for his efforts. The non-mathematical manuscripts were on a range of topics, mainly religious, medical or on historical topics. Allen taught mathematics and was, by a contemporary account, an extremely popular teacher who filled the lecture halls. It is likely that he produced teaching material for these lectures, almost certainly in the form of a commentary on an ancient text, but only one such survives, namely a commentary on the second and third books of\nPtolemy\n's astrological text\nTetrabiblos\n.\nAllen's first patron was Robert Dudley, Earl of Leicester. Through him he came in contact with another mathematician\nJohn Dee\n. Allen became a friend of Henry Percy, ninth earl of Northumberland, in the early\n1580\ns. The Earl had around him a circle of friends who were scholars, many of whom held atomistic views, the most significant of whom was\nThomas Harriot\n[\n3\n]\n:-\n[\nAllen was\n]\noften courted to live in the family of that most noble and generous Count\n[\nHenry Percy\n]\n... a great patron of mathematicians: whereupon spending some time with him, he was infinitely beloved and admired, not only by that Count but by such artists who then lived with or often retired to him ...\nFoster writes\n[\n4\n]\n:-\nCertainly\nHarriot\nhad a long acquaintance with Allen, for his will, made shortly before his death in\n1621\n, recorded that he wished to return '\n12\nor\n14\n' of Allen's manuscripts. He had held them so long that he could not identify them and left it to Allen to do so. The earl\n[\nHenry Percy\n]\nwas also building up a library and Allen's advice may have been valuable.\nFrom\n1597\n, but probably from an earlier date,\nHarriot\nworked at Syon House where he was installed by Henry Percy. Allen made many visits to Syon House during the years that\nHarriot\nlived and worked there.\nProblems arose for Henry Percy, earl of Northumberland, following the Gunpowder Plot and, from\n1605\nuntil\n1621\n, he was held prisoner in the Tower of London. How closely he was involved in this Plot to blow up Parliament is unclear but certainly his relative Thomas Percy was one of the four main conspirators.\nHarriot\nwas held on suspicion of being involved in the Plot and imprisoned for a short while, but Allen appears to have avoided the problems of some of his friends. However, Allen needed a new patron, particularly to help him fund the building of his library, and he turned to Sir John Scudamore of Holme Lacy, Herefordshire, whom he already knew through Henry Percy. A comical episode which occurred while Allen was visiting John Scudamore is described in\n[\n3\n]\n:-\n[\nAllen\n]\nwas generally acquainted; and every long vacation he rode into the country to visit his old acquaintance and patrons, to whom his great learning, mixed with much sweetness of humour, made him very welcome. One time being at Holme Lacy in Herefordshire, at Mr John Scudamore's ... he happened to leave his watch in the chamber window.\n(\nWatches were then rarities.\n)\nThe maid came in to make the bed, and hearing a thing in a case cry 'Tick, Tick, Tick,' presently concluded that that was his devil, and took it by the string with the tongs, and threw it out of the window into the moat\n(\nto drown the devil\n)\n. It so happened that the string hung on a sprig of an elder that grew out of the moat, and this confirmed them that 'twas the Devil. So the good old gentleman got his watch again.\nAllen drew up his will in January\n1629\nwhen he was\n88\nyears old. He did not have a great deal of money since he had spent most of what he had on building up his collection of manuscripts. At this stage, however, he only indicated how much money should go to his friends and relations. In October\n1630\nhe added to his will a codicil indicating:-\n... to Sir Kenelm Digby, knight, my noble friend, all my manuscripts and what other of my books he ... may take a liking unto, excepting some such of my books that I shall dispose of to some of my friends at the direction of my executor.\nIn fact he gave\n20\nof his books to Trinity College in September\n1632\n, exactly two months before his death, having already given them\n22\nbooks in\n1625\n. Digby presented Allen's collection of manuscripts to the Bodleian Library in\n1634\n. Among the many treasures from Allen's collection which is today in the Bodleian Library is a\n16\nth\ncentury printing of the\n13\nth\ncentury Arabic translation by\nNasir al-Din al-Tusi\nof\nEuclid\n's\nElements\n.\nAt Allen's funeral he was given full honours by Oxford University and, the day after his death, he was buried in Trinity College chapel. William Burton, Master of Kingston Grammar School, had been one of Allen's students and he gave a tribute to Allen at the funeral\n[\n4\n]\n:-\n... recalling Allen's 'genius, his mastery of all arts and so many sciences' he cited the banishment and indignities suffered by academics of earlier ages -\nHypatia of Alexandria\n, the great\nRoger Bacon\nand John Bale. Allen had been less captivated by the studies taught at Trinity than by mathematics; and his choice of Gloucester Hall was due to its being the habitation of great mediaeval mathematicians of the Benedictine Order, whose libraries, crammed with mathematical books, showed their continuing devotion to such studies. or his predecessors none achieved fame without producing a mathematical work. But Allen was the Coryphaeus of the mathematicians of his time. His public lectures were so popular that it was feared the rooms would burst - whereas in the Schools at the time of speaking, the walls themselves were the only listeners. ... the most illustrious Earl of Leicester, Chancellor of Oxford, tried to snatch him away, even offering him a bishopric - an honour he refused, preferring the private life which captivated him. ... at Syon Park the 'Atlases of the mathematical world',\nHarriot\n,\nDee\n, Warner and others adorned him with honours. ... In the words of Tacitus, 'he shone to himself alone because he was not seen'. Now, having completed almost\n92\nyears, he had gone forth from his narrow home to become an august member of the heavens and to live forever in the memory of men: 'Rejoice indeed, O Allen, rejoice O divine spirit, for no further vicissitudes can assail you now'.",
  "math_areas": []
}