{
  "nome_completo": "Thomas Muir",
  "nome_curto": "Thomas Muir",
  "ano_nascimento": "1844",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Muir/",
  "lugar_nascimento": "Stonebyres, Falls of Clyde, Lanarkshire, Scotland",
  "lugar_morte": "Rondebosch, South Africa",
  "biografia": "Thomas Muir\nwas the son of George Muir from Stonebyres, near Lanark, in Scotland. George was a shoemaker in Biggar and it was in that town, about\n15\nkm from the town of Thomas's birth, that Thomas was brought up. He attended an independent school in Wishaw, about half way between Biggar and Glasgow, and there his favourite subject was Greek.\nThomas entered the University of Glasgow intending to study his favourite subject of Greek. Indeed he started on a classics course, showing outstanding ability in Greek, but\nThomson\n(\nlater Lord Kelvin\n)\nrecognised his genius for mathematics and persuaded him to study that subject. Many years later Muir recalled his days at Glasgow University, saying:-\nI remember Lord Kelvin showing me the first gramophone.\nHe also considered\nKelvin\nas a great man saying:-\n... the great man I define as the man who does not alter, who always has control, who alters others.\nHe became a tutor at St Andrews University in\n1868\n, then travelled on the Continent, meeting many of the top mathematicians. His visit to Berlin was especially profitable and he quickly realised that Continental mathematics had made striking advances which were essentially unknown in Britain. He also began to collect books which became a passion for him.\nIn\n1871\nMuir became an assistant at Glasgow University and it was shortly after this that he published his first paper with the\nRoyal Society of Edinburgh\nwho then elected him a fellow\n[\nelection to a fellowship is rather different today!\n]\n. Muir spent three years lecturing on mathematics at Glasgow University and quickly gained a reputation as a fine teacher. Then from\n1874\nto\n1892\nhe was mathematics and science master at Glasgow High School. During this time, in\n1876\n, he married Margaret Bell from Dumbartonshire.\nThe\nEdinburgh Mathematical Society\nwas founded in\n1883\nand in the following year Muir was elected as president. He gave a presidential address, which was published in the\nProceedings of the Edinburgh Mathematical Society\nof\n1884\n, entitled\nOn the promotion of research\n. He ended his address with the following words:-\nA man's little work lies not isolated, stranded; a whole busy world environs it, will catch it up, will carry it forward or else backward, always, infallibly, the Thing Done will come to use.\nIn\n1882\nhe published\nTreatise on the theory of\ndeterminants\nwhile in\n1890\nhe published\nHistory of determinants\nwhich was to become the first part of a major five volume life's work. Also in\n1890\nMuir was elected a Fellow of the\nRoyal Society\n, then two years later he went to the Cape, South Africa, as Superintendent General of Education.\nMuir was appointed to this position by Cecil Rhodes, then prime minister of Cape Colony, while Rhodes was visiting England. In fact Muir was at the time deciding whether to accept an offer of the Chair of Mathematics from Stanford University in California. It is likely that he would have accepted and gone to the United States had it not been for Rhodes' persuasive powers.\nThere was another reason why accepting a post in South Africa was attractive to Muir. His wife had poor health and had been advised to live in a warmer climate. Arriving in South Africa on\n20\nMay\n1892\n, he was to introduce many educational reforms\n[\n1\n]\n:-\nAt the Cape his task was to pull together and develop a loose system. He recognised the whole educational ladder from elementary school to university, practically created science teaching, and formed efficient training colleges for teachers. It was a long and arduous task, impossible for anyone except a real enthusiast ...\nIn\n1897\nMuir was appointed vice-chancellor of the University of the Cape; he held this post for four years. In fact the University awarded him an honorary D.Sc. degree and in so doing he became the first honorary graduate of the University of the Cape. He was elected president of the South African Association for the Advancement of Science in\n1910\nand, in the following year, he represented South Africa at the Imperial Educational Conference in London.\nMuir received several awards from the\nRoyal Society of Edinburgh\n. He received their Keith Medal twice for research in mathematics, first in\n1884\nand again in\n1899\n. He was also awarded the Gunning-Victoria Prize for scientific contributions in\n1916\n. Other honours which he received from Scotland included an honorary Fellowship of the Scottish Geographical Society\n(1892)\nand an honorary degree from the University of Glasgow\n(1882)\n.\nMuir was knighted in\n1910\n, four years after he had reworked his\n1890\npublication to become Volume\n1\nof\nHistory of determinants\nwhich covered the origins to\nLeibniz\nin\n1840\n. It was not easy as he explained:-\nProgress was, however, very slow, reference libraries, for one thing, being\n6000\nmiles away.\nAfter he retired in\n1915\n, however, he was able to devote more time to his major project. The remaining volumes were Volume\n2\n1840\n-\n1860\n(1911)\n, Volume\n3\n1860\n-\n1880\n(1920)\n, Volume\n4\n1880\n-\n1900\n(1923)\n, Volume\n5\n1900\n-\n1920\n(1929)\n. Muir was working on Volume\n6\n1920\n-\n1940\nat the time of his death. This was somewhat optimistic since he would have been over\n100\nyears of age before it could have been completed.\nIn\n1919\nMuir's wife Margaret died. The marriage had produced two sons and two daughters. In\n1930\n, at the age of\n86\n, Muir published\nContributions to the history of determinants\n. In\n1931\n, at the age of\n87\n, he showed surprising abilities to keep with the modern flavour of his subject when he wrote that he:-\n... welcomed the light\nmatrix\nproofs in contrast to the heavy footed methods of thirty-five years ago.\nHe was, of course, writing a history of determinants from\n1920\nto\n1940\nat the time. It is worth thinking exactly what Muir was attempting here. Can you imagine setting out to write today\n(\nin\n2003)\nthe history of a mathematical topic from\n1993\nto\n2013\n? It would be a daunting task for a young person to attempt, but what if like Muir you were\n87\nyears old at the time!\nTurnbull\nwrites\n(\nin the\nProceedings of the Royal Society\n)\n:-\nFrom the age of\n60\nuntil\n84\nMuir played tennis, and on one occasion at the latter age he played four sets with his grandchildren. When at last the tennis racquet was abandoned he took exercise by sawing wood or walking among his beloved flowers and pine trees. He had a gentle, kindly manner, twinkling eyes and quick smile, a keen sense of humour and a penetrating wit. To the end he was courtly, sympathetic, and charming, with his wide knowledge of men and books, his sight and hearing well-nigh perfect, and upright as a pine in his plantation at Rondebosch. He was a scholarly musician - almost his last public appearance was when he attended the opera in August\n1933\n. He had a refined judgement in poetry, and at one time had a fine library of English literature, before his mathematical collection crowded it out.",
  "math_areas": [
    "Number Theory"
  ]
}