{
  "nome_completo": "Thomas Young",
  "nome_curto": "Thomas Young",
  "ano_nascimento": "1773",
  "ano_morte": "1829",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Young_Thomas/",
  "lugar_nascimento": "Milverton, Somerset, England",
  "lugar_morte": "London, England",
  "biografia": "Thomas Young\n's parents were Thomas Young Senior, a cloth merchant and banker, and Sarah Davis who were\n[\n11\n]\n:-\n... rather below than above the middle station of life.\nIn\n[\n11\n]\nYoung writes that his father:-\n... followed the commercial fashion of the day, and became a manufacturer of money: he was for a time very successful in his speculations: but though a man of strict integrity, he was at last involved in the ruinous consequences of the general depression of the value of landed property so fatal to the country's bankers.\nThomas was the eldest of the ten children in this Quaker family but, from soon after his birth, he was brought up by his mother's father Robert Davis in Minehead about\n15\nmiles from Milverton.\nAs a young boy, he did not find school very stimulating. He attended the village school from around four years of age, then was sent to a clergyman before he was six\n[\n11\n]\n:-\n... who had neither the talent nor temper to teach anything well.\nHe then spent eighteen months attending a boarding school near Bristol, but mostly he worked on his own, getting through the set books in less than half the time taken by the teacher. In\n1782\nhe entered a school in Crompton, Dorset, which was more suitable for a young genius since pupils were given more freedom to progress at their own pace. For Young this pace was very fast, for he was undoubtedly an infant prodigy. By the time he left this school in\n1786\nhe was knowledgeable in many languages, including ancient Greek, Latin and Hebrew, as well as French and Italian. He had also acquired a good grounding in Newtonian physics, studied optics and made several instruments with the help of a tutor at the school. His passion for eastern languages continued after he left the school and he began to study Arabic, Persian, Chaldee, Syriac, and Samarian.\nAlthough only thirteen years old, Young now became a tutor to Hudson Gurney, the twelve year old grandson of David Barcley who lived in a country house near Ware in Hertfordshire. Young spent five years to\n1792\nworking in the country house or at Barcley's London home. He took the opportunity to educate himself in mathematics, reading\nEuclid\n's\nElements\nand the works of\nNewton\n. He also read other scientific books, as well as books on history and languages. In the autumn of\n1792\nhe moved to London to begin his studies of medicine. As well as attending lectures at the Hunterian school, he enrolled as a pupil at St Bartholomew's Hospital. Required to dissect an ox's eye, he began to develop a theory of accommodation for the eye. He published his theories in\nObservations on vision\nread to the\nRoyal Society of London\non\n30\nMay\n1793\n. Young was elected a fellow of the\nRoyal Society\non\n19\nJune\n1794\n.\nYoung continued his medical training, entering the University of Edinburgh in\n1794\n. As a Quaker he could not study at Oxford or Cambridge, so within Britain he could only obtain a degree from a Scottish university. After one year of study he went to the University of Göttingen, arriving there in October\n1795\n. After submitting a dissertation, Young was given an oral examination and passed on\n30\nApril\n1796\n. The dissertation used Young's expertise in anatomy, language and sound. He left Göttingen in late July and visited Brunswick, Gotha, Weimar, Jena, Leipzig, Dresden and Berlin before returning to England in February\n1797\n. He discovered, however, that a change in regulations by the College of Physicians required a period of two years study at the same university before qualifying to practise medicine. He therefore went to Emmanuel College Cambridge, but before doing so he had to leave the Quakers and declare himself a member of the Church of England. He did not find this hard for he had been moving steadily away from the strict Quaker rules, attending dances and the theatre while in Edinburgh.\nAlthough enrolled in the medical course, Young did not study medicine at Cambridge, feeling that he already knew sufficient of that subject. Rather he worked on his own, learning more physics in order that he might pursue interests coming from his Göttingen dissertation. He had little respect for the Cambridge mathematicians writing:-\nI am ashamed to find how much the foreign mathematicians for these forty years have surpassed the English in the higher branches of the sciences.\nThe Cambridge men thought little of Young in return. A tutor wrote\n(\nsee\n[\n7\n]\n)\n:-\nHe seldom gave an opinion, and never volunteered one. He never laid down the law like other learned doctors, or uttered ... sayings to be remembered. Indeed, like most mathematicians, ... he never seemed to think abstractly. A philosophical fact, a difficult calculation, an ingenious instrument, or a new invention, would engage his attention ...\nOn\n13\nDecember\n1797\nYoung's great-uncle died and left him his London home and a good sum of money which left Young financially secure. He read the paper\nSound and light\nto the\nRoyal Society\nin January\n1800\nand a further paper\nOn the mechanism of the eye\nin November\n1800\n. This second paper contained further details of the process of accommodation of the eye and measured astigmatism for the first time. He read another paper\nOn the theory of light and colours\nto the\nRoyal Society\nlate in\n1801\nand it was published in the following year. This paper put forward the theory of three colour vision to explain how the eye could detect colours. Also in\n1801\nYoung sold his great uncle's house and bought a new one in Welbeck Street. Soon after he moved in, he was approached to lecture at the Royal Institution. He accepted and worked hard to produce a course of\n50\nlectures which he gave beginning in January\n1802\n. The course was divided into four parts: Mechanics; Hydrodynamics; Physics; and Mathematics. It covered a much broader range of topics, however, than these section headings suggest. His scholarly lectures were not a great success since, as one listener wrote\n[\n7\n]\n:-\n... he presumed ... on the knowledge and not on the ignorance of his hearers.\nHe resigned in the summer of\n1803\nin order to concentrate on building his medical practice. Before doing this, however, he did further important work on physics, reading\nExperiments and calculations relative to physical optics\nto the\nRoyal Society\nin November\n1803\n. In this paper he presented a wave theory of light using it to explain interference patterns and describing how he had determined the wavelength of different colours of light using diffraction.\nOn\n14\nJune\n1804\nYoung married Eliza Maxwell; they had no children.\nPeacock\nwrites\n[\n6\n]\n:-\nIt was a marriage of mutual affection and esteem, such as he had always looked forward to as the great object of his professional and other exertions, and secured for him a home which was graced by all the refinements of good manners and a cultivated taste: it was a singularly happy marriage.\nAlso in\n1804\nYoung was made foreign secretary to the\nRoyal Society of London\n, a post he filled for the rest of his life.\nIn\n1807\nYoung published\nA course of lectures on Natural Philosophy and the Mechanical Arts\n. It was a two volume work based on the lectures he had given at the Royal Institution but also contained papers he had not delivered during his lectures there together with an incredible catalogue of scientific literature from Greek times up to the date of writing. This catalogue contained over\n20\n,\n000\nitems arranged in a systematic form. The book contained more experimental evidence to support a wave theory of light, produced to answer the severe criticism that his earlier work had prompted. One has to understand that\nNewton\nhad proposed a corpuscular theory of light and\nNewton\nwas held in such high regard by English scientists that anyone suggesting something contradicting\nNewton\nwould inevitably be ridiculed. The book also contained a mechanics lecture dealing with elasticity where Young's modulus is introduced for the first time.\nYoung built up his medical practice but, although he was talented as a doctor, he had little of the manner that patients sought, so he did not have a great deal of success. In\n1811\nhe was appointed to St George's Hospital. He carried out his duties there with great diligence but again he seems to have failed to make much of an impression. Perhaps he was just too well known for his expertise outside the medical field to gain much respect within it.\nThere is yet another side to Young's broad range of activities to which as yet we have made no mention. This is his effort, begun in\n1814\n, to understand Egyptian hieroglyphics. He started on this new interest after publishing a medical work\nAn introduction to medical literature\nin\n1813\nand completing the work for\nA practical and historical treatise on consumptive diseases\nwhich was published in\n1815\n. The Rosetta Stone, containing texts in three different languages, Greek, demotic script and hieroglyphic script, had gone on display in London in\n1802\nbut at that time he was too involved with his Royal Institution lectures, then in publishing these lectures, and after that his concentration on a medical career diverted him from what, in many ways, was the ideal task for someone of his skills and interests. The credit for deciphering hieroglyphic eventually went to the French linguist\nChampollion\n, but he benefited greatly from Young's efforts and the two corresponded at great length. In the end national rivalry prevented\nChampollion\ngiving Young the credit that he deserved. However, it was Young who made the major contribution to deciphering demotic script.\nIn\n1816\nArago\nvisited Young to discuss\nFresnel\n's experiments on the wave theory of light. In the following year Young visited Paris and was welcomed by\nArago\nto the Institute. In\n1821\nYoung visited France again, this time with his wife, then they went on to Italy before returning to England in October\n1821\non receiving news that his wife's mother was seriously ill. His own health, which had been outstanding since his youth, took a turn for the worse in\n1828\nwhile he was visiting Geneva. He began to experience difficulty in breathing in February\n1829\nand died in May.\nFor someone as talented as Young, he received relatively few honours. The one which pleased him most was election as a foreign member of the Institute in Paris in\n1827\n. When Young died two years later,\nArago\ngave the eulogy at the Institute saying:-\nThe death of Young in his own country attracted but little regard.",
  "math_areas": [
    "Algebra"
  ]
}