{
  "nome_completo": "Thomas Fantet de Lagny",
  "nome_curto": "Thomas Fantet de Lagny",
  "ano_nascimento": "1660",
  "ano_morte": "1734",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lagny/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "Paris, France",
  "biografia": "Thomas Fantet de Lagny\n's father was Pierre Fantet, a royal official in Grenoble, while his mother was Jeanne d'Azy, the daughter of a physician from Montpellier. He was taught first by his paternal uncle, then he entered a Jesuit College in Lyon. He came top of every class he attended at the College. While at the College he composed Greek verse, and also studied mathematics texts such as\nEuclid\n's\nElements\nand an algebra text by Jacques Pelletier which,\nFontenelle\nwrites\n[\n3\n]\n, that he:-\n... bought one day by chance.\nHe had nobody to help him in his study of mathematics, no mathematics teacher, nor anyone with whom he could discuss mathematical ideas, yet while at the College he was able to teach himself a broad range of mathematical techniques. However, he never seems to have become familiar with the latest mathematical developments which were taking place at this time and he always adopted a fairly classical approach to problems he tackled. After his time at the Jesuit College in Lyon, he studied law in Toulouse for three years, then went to Paris. He published\nDissertation sur l'or de Toulouse\nⓉ\n(\nDissertation on the treasure hoard of Toulouse\n)\nin the\nAnnales de la ville de Toulouse\nin\n1687\n.\nIn\n1686\nDe Lagny became a mathematics tutor to the Noailles family in Paris, a position he held for about\n10\nyears. By this stage he had acquired the title of de Lagny which came from a property which he had acquired. He collaborated with\nde L'Hôpital\nwhile in Paris and it was during this time that he began to publish mathematics papers. He returned to Lyon and was there when, on\n11\nDecember\n1695\n, he became a member of the\nAcademy of Sciences\n. Then two years later he became professor of hydrography at Rochefort, a town to the south of La Rochelle.  The town is situated on the right bank of the Charente River,\n16\nkm from the sea, but an important military port and arsenal had been created there by Jean-Baptiste Colbert, minister to Louis XIV, in the\n17\nth\ncentury. Lagny worked at the Institute of Hydrography which was associated with the military port.\nHe also held positions as librarian at Bibliothéque du Roi for a time and spent two years from\n1716\nto\n1718\nas deputy director of the Banque Générale. It was the Marechal Duc de Noailles, president of the Conseil des Finances, who set up this post for Lagny. He had been taught by Lagny during his time as tutor to the Noailles family in Paris. When the Banque Générale became the Banque Royale in\n1718\n, Lagny resigned his position at the Bank. In the following year he was awarded a pension by the\nAcademy of Sciences\nso could undertake research in mathematics without having to earn his living. In\n1723\nhe became a pensionnaire géomètre at the Academy, replacing\nVarignon\nwho had died in December\n1722\n.\nDe Lagny is well known for his contributions to computational mathematics, calculating π  to\n120\nplaces and also making useful comments on the convergence of the series he was using. In about\n1690\nhe developed a method of giving approximate solutions of algebraic equations and, in\n1694\n,\nHalley\npublished a twelve page paper in the\nPhilosophical Transactions of the Royal Society\ngiving his method of solving polynomial equations by successive approximation which is essentially the same as that given by Lagny a few years earlier. One should note that although methods based on the differential calculus were being developed at this time, neither Lagny not\nHalley\nused these new ideas. Lagny's publications on this topic are\nMéthodes nouvelle infiniment générale et infiniment abrégée pour l'extraction des racines quarrées, cubique\nⓉ\n(\nNew infinitely general and infinitely abbreviated methods for the extraction of square and cubic roots\n)\n(1691)\nand\nMéthodes nouvelles et abrégée pour l'extraction et l'approximation des racines\nⓉ\n(\nNew and abbreviated methods for the extraction and approximation of roots\n)\n(1692)\n.\nLagny constructed trigonometric tables and used binary arithmetic in his text\nTrigonométrie française ou reformée\nⓉ\n(\nFrench or reformed trigonometry\n)\npublished in Rochefort in\n1703\n. In\n1733\nhe examined the\ncontinued fraction\nexpansion of the quotient of two integers and, as an example, considered adjacent\nFibonacci numbers\nas the worst case expansion for the\nEuclidean algorithm\nin his paper\nAnalyse générale ou Méthodes nouvelles pour résoudre les problèmes de tous les genres et de tous les degrés à l'infini\nⓉ\n(\nGeneral analysis or new methods for solving problems of all kinds and of all degrees to infinity\n)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Number Theory"
  ]
}