{
  "nome_completo": "Thomas Fuller",
  "nome_curto": "Thomas Fuller",
  "ano_nascimento": "1710",
  "ano_morte": "1790",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fuller_Thomas/",
  "lugar_nascimento": null,
  "lugar_morte": "Alexandria, Virginia, USA",
  "biografia": "Little is known of\nThomas Fuller\n. Fauvel and Paulus\n[\n1\n]\nwrite:-\nThomas Fuller was an African, shipped to America as a slave in\n1724\n. He had remarkable powers of calculation, and late in his life was discovered by antislavery campaigners who used him as a demonstration that blacks are not mentally inferior to whites.\nThe place of his birth appears to have been between present day Liberia and Benin. Known as Negro Tom, we know that he was described as a very black man and also we know that he lived in Virginia after being brought to the United States as a slave. Certainly late in his life he was the property of Elixabeth Coxe of Alexandria. Scripture writes in\n[\n4\n]\n:-\nThomas Fuller, known as the Virginia Calculator, was stolen from his native Africa at the age of fourteen and sold to a planter. When he was about seventy years old, two gentlemen, natives of Pennsylvania, viz., William Hartshorne and Samuel Coates, men of probity and respectable characters, having heard, in travelling through the neighbourhood in which the slave lived, of his extraordinary powers in arithmetic, sent for him and had their curiosity sufficiently gratified by the answers which he gave to the following questions: First, Upon being asked how many seconds there were in a year and a half, he answered in about two minutes,\n47\n304\n000\n. Second: On being asked how many seconds a man has lived who is\n70\nyears,\n17\ndays and\n12\nhours old, he answered in a minute and a half\n2\n210\n500\n800\n. One of the gentlemen who employed himself with his pen in making these calculations told him he was wrong, and the sum was not so great as he had said - upon which the old man hastily replied: stop, master, you forget the leap year. On adding the amount of the seconds of the leap years the amount of the whole in both their sums agreed exactly.\nAnother question was asked and satisfactorily answered. Before two other gentlemen he gave the amount of nine figures multiplied by nine. ... In\n1790\nhe died at the age of\n80\nyears, having never learned to read or write, in spite of his extraordinary power of calculation.\nPresent day thinking is that Fuller learnt to calculate in Africa before he was brought to the United States as a slave. Supporting evidence for this comes from a passage written by Thomas Clarkson in\n1788\ndescribing the purchase of African slaves:-\nIt is astonishing with what facility the African brokers reckon up the exchange of European goods for slaves. One of these brokers has ten slaves to sell , and for each of these he demands ten different articles. He reduces them immediately by the head to bars, coppers, ounces... and immediately strikes the balance. The European, on the other hand, takes his pen, and with great deliberation, and with all the advantage of arithmetic and letters, begin to estimate also. He is so unfortunate, as to make a mistake: but he no sooner errs, than he is detected by this man of inferior capacity, whom he can neither deceive in the name or quality of his goods, nor in the balance of his account.\nDespite Fuller's calculating abilities he was never taught to read or write and again this is evidence that he did not learn to calculate while in the United States. When someone who had witnessed his calculating abilities remarked that it was a pity he had not been educated, Fuller replied\n(\nsee\n[\n3\n]\n)\n:-\nIt is best I got no learning; for many learned men be great fools.",
  "math_areas": []
}