{
  "nome_completo": "Thomas Hakon Grönwall",
  "nome_curto": "Thomas Hakon Grönwall",
  "ano_nascimento": "1877",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gronwall/",
  "lugar_nascimento": "Dylta bruk, Sweden",
  "lugar_morte": "New York, USA",
  "biografia": "Thomas Hakon Grönwall\nwas born in Dylta bruk in the parish of Axberg, province Orebro, in central Sweden. His parents were Carl Theodor Grönwall and Laura Elisabeth Billqvist. He began his studies at Uppsala University at the age of\n16\nand after one year transferred to Stockholm\n(1894\n-\n1898)\n. In\n1898\n, at the age\n21\n, he was the author of ten mathematical papers and received his doctor's degree at Uppsala University for the thesis\nOn system of linear total differential equations particularly with\n2\nn-periodic coefficients\n.\nGrönwall left Stockholm and Sweden in\n1899\nafter the authorities, sadly lacking a sense of humour, treated a student's prank in a way which hurt his youthful pride and his love of liberty\n(\nsee\n[\n6\n]\n, p.\n136)\n:-\nIn May of\n1899\nGrönwall and his friend had a drunken party which caused some damage at the university. For this his friend was banned from the university for half a year and Grönwall, then a Ph.D. and an extraordinary student at KTH, was banned for the same period. His crime was attendance at the university without being properly matriculated. Naturally enough, Grönwall thought this to be too much for too little and left Stockholm to study at the Charlottenberg Technical Institute in Berlin.\nGronwall practised as a civil engineer in Germany\n(1902\n-\n1903)\nand then immigrated to the United States in\n1904\n, where he worked at various steel works for longer or shorter periods; he was connected with the American Bridge Co., and the Pennsylvania Railroad and other engineering companies. In\n1911\nhe lived in Chicago and in\n1912\nhe became a member of the\nAmerican Mathematical Society\n. From the Chicago meeting on April\n5\n-\n6\n,\n1912\n, we can date his return to mathematics.\nDuring\n1913\n-\n1914\nhe was an instructor and at\n1914\n-\n1915\nassistant professor at the Princeton University. In the period\n1913\n-\n1928\nhe was also the member of the editorial board of the\nAnnals of Mathematics\n. He gave excellent graduate courses, inspired research, and was very useful to the\nAnnals\nas a contributor and as a critic. The\nAnnals\npublished more than one third of all his papers.\nA number of papers from\n1912\nestablished him as a first-class mathematician. During the remaining twenty years of his life his interests oscillated between mathematics and applied research.\nWe can quote here Einar\nHille\nwho has written about him on page\n780\nof\n[\n10\n]\n:-\nGrönwall was a disillusioned man, modest, quiet, and retiring. I have never heard of his having any enemies. His friends found him fair-minded, kind-hearted, and unselfish. He was always willing to put his great knowledge and skill at the service of colleagues, friends, and students, and was eagerly interested in their problems. His non-scientific interests were chiefly intellectual, his acquaintance with general literature was both thorough and wide.\nIn the years\n1918\n-\n1922\nhe worked as a mathematical expert on the Technical Staff of the Chief of Ordinance in Washington and in the Aberdeen Proving Grounds. After demobilization he was a consulting mathematician in New York and spent part of his time at the American Telephone and Telegraph Co.\nFrom\n1925\nhe became a member of the Department of Physics at Columbia University in New York and from\n1927\nhe worked as an associate professor in physics. He had no teaching obligations and undertook research in physical chemistry and atomic physics. He cooperated with V K La Mer who writes\n(\nsee\n[\n10\n]\n, pp.\n779\n-\n780)\n:-\nPhysical chemists are deeply indebted to Dr Grönwall for the interest and rare mathematical skill which brought to bear in solving the problem of the anomaly of strong electrolytes. This problem has been the outstanding stumbling block of physical chemistry since the original formulation of the dissociation theory by Arrhenius in\n1888\n. ... Only a mathematician with Grönwall's gift for analysis and most uncommon grasp of the literature of chemistry and physics could have contributed the elegant solution which he gave. His achievement will remain as a worthy monument of the services which mathematics can render chemistry and physics.\nIn our several years of close association, Grönwall was never too busy to instruct the writer or his collaborators in elementary and tedious details of mathematical technique. The skill with which he could analyse and solve difficult problems excited the wonder and admiration of his colleagues. The clarity of his mind and writings have been an inspiration to every one associated with him.\nDuring the last years of his life he worked steadily on the wave mechanics of the hydrogen and helium atom. He died on\n9\nMay\n1932\n, in New York.\nGrönwall's work contains classical analysis\n(\nFourier\nseries,\nGibbs\nphenomenon, summability theory,\nLaplace\nand\nLegendre\nseries\n)\n, differential and\nintegral equations\n, analytic number theory\n(\ntranscendental numbers, divisor function,\nL\nL\nL\n-function of\nDirichlet\n)\n, complex function theory\n(\nDirichlet\nL\nL\nL\n-series, conformal mappings, univalent functions\n)\n, differential geometry, mathematical physics\n(\nproblems of elasticity, ballistics, induction, potential theory, kinetic theory of gases, optics\n)\n, nomography, atomic physics\n(\nwave mechanics of hydrogen and helium atom, lattice theory of crystals\n)\nand physical chemistry where he is especially known as a very important contributor.\nSuch names as\nGrönwall's inequality\nor\nGrönwall's lemma, Grönwall's summability method\nand\nGrönwall's theorem\nare known in the mathematical literature.\nGrönwall is now mainly remembered for the Grönwall inequality. In\n1919\nhe proved a remarkable inequality, sometimes also called\nGrönwall's lemma\n, which has attracted, and continues to attract, considerable attention in the literature\n(\nsee\n[\n5\n]\nand the references given there\n)\n:-\nIf u is a nonnegative real-valued function defined on an interval\nI\n=\n[\na\n,\nb\n]\nI = [a, b]\nI\n=\n[\na\n,\nb\n]\nfor which the integral inequality\nu\n(\nt\n)\n≤\nA\n+\nB\n∫\na\nt\nu\n(\ns\n)\nd\ns\nu(t) ≤ A + B \\int _{a}^{t} u(s) ds\nu\n(\nt\n)\n≤\nA\n+\nB\n∫\na\nt\n​\nu\n(\ns\n)\nd\ns\nholds for all\nt\n∈\nI\nt \\in  I\nt\n∈\nI\nwith\nA\n≥\n0\n,\nB\n>\n0\nA ≥ 0, B > 0\nA\n≥\n0\n,\nB\n>\n0\n, then the estimate\nu\n(\nt\n)\n≤\nA\ne\nB\n(\nt\n−\na\n)\nu(t) ≤ A e^{B(t-a)}\nu\n(\nt\n)\n≤\nA\ne\nB\n(\nt\n−\na\n)\nis true for all\nt\n∈\nI\nt \\in  I\nt\n∈\nI\n.\nIn\n1913\nGrönwall proved\n(\nGrönwall's theorem\n)\nthat\nlim sup\n⁡\nn\n→\n∞\nσ\n(\nn\n)\nn\nln\n⁡\nln\n⁡\nn\n=\ne\nγ\n\\limsup_{n \\rarr\\infty}{\\Large \\frac {\\sigma (n)}{n \\ln \\ln n}} \\normalsize= e^{\\gamma}\nl\ni\nm\ns\nu\np\nn\n→\n∞\n​\nn\nl\nn\nl\nn\nn\nσ\n(\nn\n)\n​\n=\ne\nγ\n,\nwhere\nσ\n(\nn\n)\n\\sigma(n)\nσ\n(\nn\n)\nis the divisor function and\nγ\n\\gamma\nγ\nis the\nEuler\n-\nMascheroni\nconstant\n: lim\nn\n→\n∞\n(\n∑\nk\n=\n1\nn\n1\nk\n−\nln\n⁡\nn\n)\n_{n\\rightarrow ∞}(\\sum _{k=1}^{n} \\Large\\frac{1}{k}\\normalsize  - \\ln n)\nn\n→\n∞\n​\n(\n∑\nk\n=\n1\nn\n​\nk\n1\n​\n−\nln\nn\n)\n.\nThe\nGrönwall summation method\nof series appeared in\n1932\nas a generalization of\nde la Vallée Poussin\nand\nCesáro\nsummation methods\n(\ncf.\n[\n4\n]\n, p.\n329)\n.\nGrönwall published\n86\npapers and communicated the results of\n24\ninvestigations to the Society, the details of which are still unpublished.\nWe use here\nHille\n's quotation\n(\n[\n10\n]\n, p.\n780)\n:-\nGrönwall was first and last an analyst, but he frequently went to other fields for questions to turn into analytical problems. His command of the classical tools of analysis was superb; he worked in practically all the main fields of analysis and left a mark for himself in several. His knowledge of the literature, even in remote fields, was remarkable. His life shows that his unruly spirit found expression, joy, and satisfaction in scientific thinking and creation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}