{
  "nome_completo": "Thomas Archer Hirst",
  "nome_curto": "Thomas Hirst",
  "ano_nascimento": "1830",
  "ano_morte": "1892",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hirst/",
  "lugar_nascimento": "Heckmondwike, Yorkshire, England",
  "lugar_morte": "London, England",
  "biografia": "Thomas Hirst\n's father was Thomas Hirst\n(\nborn\n1797\nin Yorkshire\n)\nwho was in the wool trade. His mother was Hannah Oates\n(\nborn\n1804\nin Heckmondwike, Yorkshire\n)\nwho also came from a family involved in the wool trade. It was a prosperous family, so much so that Hirst's father retired when only thirty-one years old since at that age he inherited his own father's money. Thomas Hirst had three elder siblings: John Henry\n(\nborn\n1826)\n, Edward Oates\n(\nborn\n1827)\n, and William Aked\n(\nborn\n1829)\n. The family were certainly education minded and Thomas's father moved from Heckmondwike to be close to Wakefield when Thomas was five years old so that the boys could attend better schools.\nThomas attended Wakefield primary school, then in\n1841\nhe entered West Riding Proprietary School where he spent four years. He wrote later\n[\n2\n]\nthat in this school:-\n... I could obtain the most rudimentary and necessary instruction. I remember, however, that here mathematics was my favourite study ...\nIn\n1844\nThomas's father died in an accident. Thomas's mother was keen to find careers for here sons and for this reason Thomas was taken away from school when fifteen years of age and began to work as an apprentice engineer. He was sent to Halifax and his first task was to work on a survey for the proposed railway line from Halifax to Keighley. He began to write a diary at this time and it is largely for this that he is well known among mathematicians today.\nMany quotations from this diary, in which he describes well-known mathematicians he had met, are given at\nTHIS LINK\n.\nThe chief surveyor of the engineering firm was John Tyndall. He was ten years older than Hirst and he was to have a major influence on the direction which Hirst's life took. They quickly became firm friends. The first important influence which Tyndall had on Hirst was to encourage him, in addition to carrying out the many tasks relating to his job as a surveyor with the engineering firm, to continue with his education by reading on his own. Hirst read many works of literature, scientific texts and mathematics books such as\nEuclid\n's\nElements\n,\nHutton\n's\nMathematics\nand Brewster's\nLife of Sir Isaac Newton\n. In February\n1848\nHirst enrolled at the Halifax Mechanics Institute where he seemed for a while to be casting about seeking the subjects which interested him most. Slowly he turned to studying more and more mathematics.\nTyndall left the engineering firm and, after a short spell as a teacher, went to the University of Marburg to study chemistry. Hirst visited Tyndall in Germany in August\n1849\nbut he had to return home earlier than planned on the news that his mother had died. One result of his mother's death was that he came into quite a bit of money and, deciding that surveying was not the career for him, he formed a plan to complete his apprenticeship and then to follow his friend Tyndall to Marburg. He completed his apprenticeship on\n31\nAugust\n1850\nand set out with Tyndall, who was returning after the summer vacation, to travel to Marburg which they reached in October.\nOn\n2\nNovember\n1850\nHirst enrolled at the University of Marburg to study mathematics, physics and chemistry. Despite earlier moves towards mathematics, he was yet to make a decision on the topic in which he would specialise. At first he was attracted to chemistry, particularly to the lectures of Robert Bunsen. However Bunsen left Marburg in the spring of\n1851\nand after this Hirst's interests turned increasingly towards mathematics, sometimes to such an extent that he would ignore his other subjects.\nWhen he was close to completing his doctorate\n(\nthis was a first degree in Germany for those who took the course at this time\n)\na comment from Tyndall made him decide to carry on with his studies of mathematics and to visit other German universities such as Berlin and Göttingen. He took the necessary oral examination in the spring of\n1852\nand, after a brief visit back to England, he returned to Marburg to complete his dissertation for his doctorate. He submitted the thesis\nOn conjugate diameters of the triaxial ellipsoid\nand was awarded his doctorate in July\n1852\n.\nLeaving Marburg, Hirst travelled to Göttingen where he spent two weeks attending lectures. He met\nWeber\nand\nGauss\nat this time. After spending some time travelling in Germany and Austria with friends he went to Berlin where he spent the winter semester.\nEisenstein\n, whom he had hoped to visit, died the day before Hirst arrived. However he did make friends with many of the mathematicians in Berlin and he continued to study mathematics concentrating on geometry. In particular he attended lectures by\nDirichlet\nand\nSteiner\n, being strongly influenced by\nSteiner\nto undertake further research on geometry.\nFrom Berlin Hirst made the journey to Paris where he spent two months attending lectures by\nLiouville\nand\nLamé\n. He returned to England in the middle of\n1853\nand was appointed to a teaching post at Queenwood College near Salisbury. He married Anna Martin at Kilkeel. County Down in late\n1854\n, a young English lady whom he had met while in Marburg. Unfortunately soon after they were married Anna showed signs of tuberculosis. In\n1856\nHirst resigned his teaching post at Queenwood so that he could take care of his wife and they travelled to the south of France hoping that the warmer weather would cure Anna.\nLeaving the south of France they settled in Paris where Hirst continued with his mathematical researches, publishing two papers on which he had begun to work while at Göttingen. Sadly Anna died in July\n1857\n. Hirst began to attend lectures again in Paris and his own researches into geometry progressed well. In August\n1858\nhe left Paris to spend a year in Italy. He became friends with\nCremona\n, particularly sharing his keen involvement in the Italian war of unification. He returned to England in the summer of\n1859\n.\nHirst was appointed to the University College School in\n1860\n. The following year he was nominated for a fellowship of the\nRoyal Society\n,\nBoole\nand\nSylvester\nbeing among his proposers. He was elected as a fellow in\n1861\n. However, he resigned from his post at University College School in July\n1864\nso that he might concentrate on his research.\nLater in\n1864\nhe became a founder member of the X-club which had as its aim the promotion of science in England. It was not the only event of importance for Hirst in\n1864\nfor that year saw him elected to the Council of the\nRoyal Society\n. He was indeed becoming an important figure in British Science, something which was confirmed by him becoming a major figure in the\nLondon Mathematical Society\n.\nAt a preliminary meeting to discuss setting up a mathematical society on\n7\nNovember\n1864\n, the name\nLondon Mathematical Society\nwas chosen. In fact this was meant to be the first proper meeting of the Society but\nDe Morgan\nwas ill and could not attend. The chair at this preliminary meeting was taken by Hirst and the date for the first meeting proper was set for\n16\nJanuary\n1865\n. Hirst was elected the first Vice-President of the Society and he served it for the next twenty years as a member of Council, the Treasurer of the Society and then as its President in\n1872\n-\n74\n.\nHirst was appointed as professor of physics at University College London in\n1865\nand he began lecturing in October of that year. In\n1866\nhe received further honours being elected a fellow of the\nRoyal Astronomical Society\nas well as being appointed General Secretary of the\nBritish Association for the Advancement of Science\n. He succeeded\nDe Morgan\nto the chair of mathematics at University College London in\n1867\n. One of Hirst's students gave this description of him\n[\n7\n]\n:-\nHis presence in the classroom was striking. He was tall, and held himself erect with an almost military air. he had a long black beard and a great, bald, dome-like forehead. He was a man with whom it was impossible to imagine the most audacious student venturing to take a liberty. There was something about him that invested his unlovely subject with dignity, if not interest. Less, perhaps, than any of the other professors, did he seem to think of examinations. To him, I believe, incredible as it sounds, mathematics must have been a solemn, high pursuit: a passion, if not religion. Yet with all his aloofness of manner he could be very simple, very patient, and extremely kind. Certainly to one of his most hopeless pupils he showed himself all three.\nAs well as promoting science in general, Hirst worked in particular for the education of women. In\n1869\nhe gave a course of twenty-four lectures on the\nElements of Geometry\nto the Ladies educational Association of London. The lectures were very successful both for their quality and for the large number of women who signed up for the course. He was less than happy with his heavy lecturing commitments, however, and so he decided to ask University College to give him an administrative post in exchange for the Chair of Mathematics. Hirst throughout his life always became unhappy when commitments prevented him from undertaking mathematical research. He became Assistant Registrar of University College in March\n1870\n.\nIn January\n1871\nthe Association for the Improvement of Geometrical Teaching was founded and Hirst became its first president. This fitted well with his long held belief that\nEuclid\n's\nElements\nshould be replaced as the main geometry teaching text in schools. The association soon took on board the improvement of teaching of all mathematical topics in schools and was renamed the\nMathematical Association\n.\nIn\n1873\nHirst was appointed as Director of Studies at the Royal Naval College in Greenwich. His research had been mostly in geometry, in particular on\nCremona\ntransformations, and it was for this work that he was awarded the Royal Medal from the\nRoyal Society\nin\n1883\n. However his health, which had been less than good for a number of years became steadily worse. Kidney stones and a stomach tumour were diagnosed and, somewhat depressed by the death of his brother John, Hirst resigned from Greenwich in\n1883\nat the age of\n53\n. The authors of\n[\n7\n]\nwrite:-\nFinally, in\n1890\n, he finished his memoir on the correlation of two spaces. He had worked on it for a long time and after its completion he destroyed his mathematical notebooks. Suddenly he seemed old, spending his time in watching the rapidly changing world from his clubs, his flat, and the park.\nBy January\n1892\n, now suffering from cancer of the prostate, he caught flu in an epidemic which hit London. He made the last entry in his diary which he had kept from the age of fifteen on\n18\nJanuary\n1892\nand he died four weeks later.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry"
  ]
}