{
  "nome_completo": "Thomas Harriot",
  "nome_curto": "Thomas Harriot",
  "ano_nascimento": "1560",
  "ano_morte": "1621",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Harriot/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "London, England",
  "biografia": "Thomas Harriot\nwas a mathematician and astronomer who founded the English school of algebra. He is described in\n[\n10\n]\nby Fauvel and Goulding as:-\n... the greatest mathematician that Oxford has produced ...\nyet his name has only recently become widely known, and even now his achievements are not fully appreciated by most mathematicians.\nWe know very little of Harriot's youth. In fact all that is known is that on Friday\n20\nDecember\n1577\nhe matriculated at the University of Oxford with an entry in the official records giving his age as seventeen, his father as a plebeian, and his birthplace Oxfordshire. It is from this record that his date of birth is deduced to be\n1560\nand we know that his father was a \"commoner\" but the very fact that Harriot was entering Oxford means that it is unlikely that he came from the poorest classes. Despite extensive searches of the Oxfordshire records, no further information concerning his birth or parentage has been found\n(\nalthough a number of possible relatives have been identified\n)\n.\nAs an undergraduate at Oxford, Harriot was a student at St Mary's Hall. He became friends with Richard Hakluyt and Thomas Allen, both lecturers at the university, but not at St Mary's Hall. Harriot graduated in\n1580\nand went to London. It is not clear exactly what he did in his first few years there but, probably from late\n1583\n, he entered Sir Walter Raleigh's service. Hakluyt, dedicating a preface to Raleigh in February\n1587\n, wrote\n(\nsee for example\n[\n4\n]\n)\n:-\nEver since you perceived that skill in the navigator's art, the chief ornament of an island kingdom, might attain its splendour amongst us if the aid of the mathematical sciences were enlisted, you have maintained in your household Thomas Harriot, a man pre-eminent in those studies, at a most liberal salary, in order that by his aid you might acquire those noble sciences in your leisure hours ...\nHarriot wrote a text called\nArcticon\nwhich was never published and unfortunately no copies have ever been found. This work was essentially his lecture course given at Durham House, Raleigh's lodgings in The Strand in London, where Harriot lived at this time. The lectures were given to the seamen who were being gathered by Raleigh to participate in his expeditions to the New World. Pepper describes the advances in navigational techniques made by Harriot by the time he wrote\nArcticon\n[\n18\n]\n:-\n... he solved the problem of reconciling the sun and pole star observations for determining latitude, introduced the idea of using solar amplitude to determine magnetic variation and, as well as improving methods and devices for observation of solar or stellar altitudes, he recalculated tables for the sun's\ndeclination\non the basis of his own astronomical observations. ... he produced a practical numerical solution of the\nMercator\nproblem, most probably by the addition of secants ...\nAs Roche notes in\n[\n24\n]\n:-\n... when combined with new instruments and observational practices it is clear that Raleigh had the best navigational expertise in Europe.\nIt was not only as a navigational instructor that Raleigh employed Harriot. He was involved with the design of the ships for Raleigh's expeditions as well as being involved in the construction of the vessels and selecting the seamen. He was Raleigh's accountant, being responsible for obtaining funding for the expeditions and keeping all the accounts.\nRaleigh had the captains Philip Amadas and Arthur Barlowe make an expedition to Roanoke Island off the coast of North Carolina in\n1584\n. Although there is no direct evidence that Harriot made this voyage, Quinn in\n[\n23\n]\nargues convincingly that he was one of those making this preliminary survey. Harriot was certainly on a voyage to Virginia organised by Raleigh in\n1585\n-\n86\n. He sailed from Plymouth on\n9\nApril\n1585\non board the Tiger and his observations of a solar eclipse on\n19\nApril have allowed modern scientists to compute the exact position of the ship on that day. Harriot made many notes during his time in the New World, being particularly interested in the language and customs\n(\nparticularly the eating habits\n)\nof the inhabitants. The object of the voyage was to colonise the New World but it was not successful in this aim.\nDrake was engaged in sea battles with the Spanish when he learnt that they intended to prevent the British colonists becoming established. Although Drake met up with the colonists, in June\n1586\nthere were severe storms and there was a hurried return to England by Harriot and most of the party. Harriot, together with Drake's ships, landed at Portsmouth in July\n1586\nand he went immediately to Raleigh to report on the expedition. He published\nA Briefe and True Report of the New Found Land of Virginia\nin\n1588\n, a book in which he recommends the smoking of tobacco which he himself had learnt to do in Virginia. However, he also wrote a full account of the voyage which, for some reason, he never published and, despite strenuous attempts to find a copy, seems lost.\nBy the time Harriot had returned, Raleigh had turned his attention to Ireland. Harriot carried out surveys of the Lismore estate, which was owned by Raleigh, beginning in\n1589\n. Nine years later he was still involved in working out the acreage of plots being leased on the estate. However the political situation was about to change and this would have dramatic implications for Harriot.\nAlready in the\n1590\ns there were allegations against Raleigh of atheism. The charges were against Raleigh's school and \"the conjurer that is master thereof\". Harriot felt that this was a reference to him and he discussed the allegations with\nJohn Dee\n(\nwho also felt that the charges might relate to him\n)\n. There is no reason to believe that Harriot\n(\nor Raleigh\n)\nwere atheists but certainly they were free thinkers and Harriot's scientific approach to the world was, to say the least, viewed with great suspicion by the church. As well as problems caused by allegations,\nDee\nand Harriot discussed scientific and mathematical matters in the\n1590\ns.\nHarriot had now moved from working for Raleigh to working for Henry Percy, Duke of Northumberland. The Duke had around him a circle of friends who were scholars, many of whom held a atomistic views. Raleigh's life became so chaotic that Harriot had sought the support of a patron who could provide more stability for his scientific pursuits. In\n1595\nthe Duke made property in Durham over to Harriot and he moved up the social ladder becoming a member of the \"landed gentry\". Harriot also later held estates in Cornwall and Norfolk. Not long after the Durham transaction, the Duke gave Harriot the use of one of the houses on the estate at Syon\n(\nnear Kew outside London\n)\nwhich Harriot used both as a residence and as a scientific laboratory.\nWe certainly know from manuscripts which survive that Harriot was engaged in deep studies of optics at Syon by\n1597\n. Although in\n[\n4\n]\nit states that he had discovered the sine law of\nrefraction\nof light before\n1597\n, in fact we now know that the precise date of Harriot's important discovery was July\n1601\n. As with all his other mathematical discoveries, however, Harriot did not publish his findings. It is somewhat ironical, however, that\nSnell\n(\nto whom the discovery of this law is now attributed\n)\nwas not the first to publish the result.\nSnell\n's discovery was in\n1621\n, about\n20\nyears after Harriot's discovery, but the result was not published until\nDescartes\nput it in print in\n1637\n.\nOne of the optical problems which Harriot did study in the\n1590\ns was\nAlhazen\n's problem. He gave a solution to\nAlhazen\n's problem which involved considering an equivalent problem, namely the problem of the maximum intercept formed between a circle and a diameter of a chord rotating about a point on a circle. The author of\n[\n8\n]\nconjectures that Harriot may have used\ninfinitesimal\ntechniques in demonstrating the equivalence of these problems, and certainly we know that Harriot introduced ideas later rediscovered by\nBarrow\n.\nOptics was not the only topic to occupy Harriot during this period. He had been asked by Raleigh in the early\n1590\ns to apply his mathematical skills to the science of gunnery. At this time ideas of the trajectory taken by a projectile were still dominated by\nAristotle\n's thinking. Harriot resolved the forces acting on the projectile into horizontal and vertical components. He understood that air resistance acted throughout the whole flight, and that gravity acted on the vertical component. He came very close to a vector analysis solution of the problem of finding the velocity of the projectile and, certainly by\n1607\n, he came to the conclusion that the path of the projectile was a tilted\nparabola\n. He made one error, however,\n[\n4\n]\n:-\nSomehow, he could not force himself to abandon the Aristotelian idea that heavier bodies fell at a faster rate than lighter ones.\nOther topics which Harriot began to work on before\n1600\nwere problems of chemistry. He worked intensively on chemistry for almost exactly a year from May\n1599\nto May\n1600\nand, although his experiments were conducted with a new scientific precision, he made no discoveries of particular note.\nRaleigh had been a particular favourite of Elizabeth I and, when she died on\n24\nMarch\n1603\n, it was clear that Raleigh's fortunes would change. Perhaps it is less clear that Harriot, by this time not so closely associated with Raleigh, would find problems too. James I became king and he quickly saw Raleigh as someone opposed to his claims to the throne. Henry Percy, the Duke of Northumberland, had taken care to put himself on a good footing with James with a letter of support for him only days before Elizabeth died. In July plots were discovered against James and Raleigh was arrested and charged with high treason.\nRaleigh attempted suicide but failed. He then sought Harriot's help in obtaining evidence on his behalf. Raleigh was convicted and sentenced to death by hanging. Poor Harriot was singled out in the judgement as being an atheist and an evil influence. His attempts to help Raleigh had been based on Christian principles\n(\nto which undoubtedly he adhered\n)\nbut this had rather damaged Raleigh as Harriot was seen an atheist using Christian principles for convenience. Harriot was devastated and for about a year undertook no new scientific work as he tried to come to terms with what was happening. Raleigh received a last-minute reprieve from the death sentence but was imprisoned in the Tower of London.\nAnother plot was to lead to further trouble. On\n4\nNovember\n1605\nGuy Fawkes and others were arrested for attempting to blow up the Houses of Parliament. Four others, including Thomas Percy, the grandson of Henry Percy, were also arrested as the main conspirators. Harriot was held on suspicion of being involved and imprisoned in the Gatehouse. He was interrogated on the charge that he had cast a horoscope of King James in an attempt to use magical powers to influence the King's future. On\n27\nNovember Henry Percy, Harriot's patron, was also put in the Tower where he remained until\n1621\nwhen he was released. No evidence seems to have been found against Harriot and, although he remained in the Gatehouse for some while writing several letters requesting his release, he was a free man probably by the end of\n1605\n.\nAs soon as he was released, Harriot returned to his work on optics. He now considered more complex systems and employed Christopher Tooke as a lens grinder from early\n1605\n. His work on light now moved to the dispersion of light into colours. He began to develop a theory for the rainbow and, by\n1606\n,\nKepler\nhad heard of the remarkable results on optics achieved by Harriot.\nKepler\nwrote to Harriot, but the correspondence never really achieved any significant exchange of ideas. Perhaps Harriot was too wary of the difficulties that his work had nearly brought on him, or perhaps he did\n(\nas he claimed to\nKepler\n)\nstill intend to publish his results if his health permitted.\nThe appearance of a comet attracted Harriot's attention and turned his scientific mind towards astronomy. He observed a comet on\n17\nSeptember\n1607\nfrom Ilfracombe which would later be identified as\nHalley\n's Comet.\nKepler\nhad discovered the comet six days earlier but it would be the observations of Harriot and his friend\n(\nand student\n)\nWilliam Lower which eventually were used by\nBessel\nto compute its orbit.\nHis astronomy brought back to the fore, Harriot went on to make the earliest telescopic observations in England. On\n26\nJuly\n1609\nat\n9\np.m. he sketched the Moon which was at that time\n5\ndays old, viewing it through a telescope with a magnification of\n6\n. He sketched the Moon again a year later on\n17\nJuly\n1610\n, by this time he had a telescope giving him a magnification of\n10\n. Soon he had constructed a telescope with a magnification of\n20\n, then by April\n1611\nhe had a\n32\nmagnification telescope.\nHarriot observed the moons of Jupiter, although since his first sighting states:-\nMy first observation of the new planets. I saw but one and that alone\nhe must have already been aware of\nGalileo\n's discovery. As with all his scientific discoveries, Harriot did not publish his results. These observations of Jupiter's moons were made between\n17\nOctober\n1610\nand\n26\nFebruary\n1612\n.\nHe was the first to discover sunspots, making\n199\nobservations between\n8\nDecember\n1610\nand\n18\nJanuary\n1613\n. The first observation of sunspots was made while he was observing Jupiter's moons. From the data he collected he was able to deduce the period of the Sun's rotation. However, around this time his scientific work basically came to an end. He seems to have had his spirits brought low by the deaths of his friends and lost the spirit to continue research\n(\nwhich had brought him much trouble despite his lack of publications\n)\n.\nOf the few pieces of work done by Harriot after\n1614\n, one was his observation of another comet in\n1618\n(\nthere were three visible comets that year and Harriot observed the third\n)\nfrom Syon House. In\n1618\nRaleigh, who had been shown the clemency of imprisonment in\n1603\nrather than death, was put to death. Raleigh was executed on\n29\nOctober\n1618\nin a public execution, with Harriot present to witness the event. However, by this time Harriot was already suffering from the cancer of the nose which eventually led to his death.\nThe cancer seems to have started around\n1613\n, about the time when Harriot lost interest in pushing forward his mathematical and scientific research. He consulted the top specialist in\n1615\nwho wrote report on the consultation. He described Harriot as\n(\nsee for example\n[\n4\n]\n)\n:-\n... a man somewhat melancholy. ... A cancerous ulcer in the left nostril eats up the septum of his nose and in proportion to its size holds the lips hard and turned upwards. It has gradually crept well into the nose. This evil the patient has suffered the last two years.\nHarriot would suffer this \"evil\" for a further three years before the cancer took his life.\nThere are a few other major mathematical achievements due to Harriot which we should mention. He exhibited the logarithmic spiral as the\nstereographic projection\nof a\nloxodrome\non a sphere, a projection he proved to be\nconformal\n. The loxodromes are the straight lines on the\nMercator\nmap, which Harriot computed with great precision. In fact in order to achieve this degree of precision, Harriot introduced finite-difference interpolation.\nThere is an interesting history to a problem which has only recently been solved, yet originated with Harriot. Raleigh asked Harriot to solve certain problems regarding the stacking of cannonballs. On a manuscript dated\n12\nDecember\n1591\n(\nSunday\n)\n, Harriot set out a table to answer Raleigh's questions. He shows how, if the number of cannonballs is given, one can compute the number of cannonballs to be placed in the base of a pyramid with a triangular, square or oblong base. Raleigh posed a second question, which Harriot also answered, namely given the pyramid of cannonballs, compute the number in the pile.\nHarriot was too much the mathematician to stop there, however. From a study of how the cannonballs could fill space, he considered the implications for the\natomic theory\nof matter which he believed in. Later, in his correspondence with\nKepler\nabout atomic theory, Harriot mentioned the packing problem.\nKepler\ncould not solve the problem but he believed that the densest packing of spheres would be attained if in each layer the centres of the spheres were above the centres of the holes in the layer below. This seems intuitively obvious, but resisted proof until\n1998\nwhen Thomas Hales of the University of Michigan\n(\nwith the help of hours of computer generated data\n)\nfinally proved the conjecture.\nThe one part of Harriot's work which we have not yet described is the mathematical work for which, in some ways, he is best known, namely his work on algebra. He introduced a simplified notation for algebra and his fundamental research on the theory of equations was far ahead of its time. As an example of his abilities to solve equations, even when the roots are negative or imaginary, we reproduce his solution of an equation of degree\n4\n. The example in question is in his own handwriting and reproduced in\n[\n3\n]\n.\naaaa - 6aa + 136a = 1155\n------------------------------------\n    aaaa -2aa + 1 = 4aa -136a + 1156\n           aa - 1 = 2a - 34\n\n               33 = 2a - aa\n          aa - 2a = -33\n      aa - 2a + 1 = +1 - 33\n            a - 1 = √-32\n            1 - a = √-32\n                a = 1 + √-32\n                a = 1 - √-32\n------------------------------------\n           aa - 1 = 34 - 2a\n          aa + 2a = 35\n      aa + 2a + 1 = 1 + 35\n            a + 1 = √36\n\n      a = √36 - 1 = 5\n------------------------------------\n           -a - 1 = √36\n     a = -√36 - 1 = -7\nNote how expert Harriot is in completing the square, knowing that whenever he takes a square root there are two answers to consider, and treating all answers equally whether positive or negative, real or imaginary. We have only made one slight change to Harriot's notation. Where we have used the now standard symbol  =  Harriot used\n.\nHarriot invented certain symbols which are used today. However, the symbols < for \"less than\" and > for \"greater than\" were not due to Harriot\n(\nas is often claimed\n)\n, but were introduced by the editor of\nArtis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\nⓉ\n(\nThe analytical art by which algebraic equations can be resolved\n)\n- Harriot himself used different symbols. There is still scholarly debate on how much Harriot was influenced by\nViète\n, or whether notation and ideas introduced by\nViète\nwere learnt by him from Harriot.\nAs we have seen from the example above, Harriot did outstanding work on the solution of equations, recognising negative roots and complex roots in a way that makes his solutions look like a present day solution. He made the observation that if\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nare the roots of a\ncubic\nthen the cubic is\n(\nx\n−\na\n)\n(\nx\n−\nb\n)\n(\nx\n−\nc\n)\n=\n0\n(x - a)(x - b)(x - c) = 0\n(\nx\n−\na\n)\n(\nx\n−\nb\n)\n(\nx\n−\nc\n)\n=\n0\n. This is a major step forward in understanding which Harriot then carried forward to equations of higher degree.\nAlthough he was far ahead of his time, his work had far less influence than it should have done since, as we have remarked repeatedly above, he published no mathematical work in his lifetime. Even his work on algebra\nArtis Analyticae Praxis ad Aequationes Algebraicas Resolvendas\nⓉ\n(\nThe analytical art by which algebraic equations can be resolved\n)\n(1631)\nwas published\n10\nyears after his death and was edited by people who did not fully appreciate the depth of his work. For example, it does not discuss negative solutions.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}