{
  "nome_completo": "Thomas Bradwardine",
  "nome_curto": "Thomas Bradwardine",
  "ano_nascimento": "1295",
  "ano_morte": "1349",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bradwardine/",
  "lugar_nascimento": "Chichester, England",
  "lugar_morte": "Lambeth, London, England",
  "biografia": "Thomas Bradwardine\n's date of birth is not known with any certainty. In\n[\n1\n]\nthe date is given as between\n1290\nand\n1300\n, in\n[\n2\n]\nthe date is given as about\n1290\nwhile, for example, in\n[\n15\n]\nit is given as about\n1300\n. These are merely guesses based on the first definite date we know for Bradwardine and that is August\n1321\nwhen he became a Fellow of Merton College, Oxford. August\n1321\nis the date on which Bradwardine was awarded his B.A. We have merely taken an average of the various birth dates suggested!\nWe have given Bradwardine's birthplace as Chichester, but again this is based on little evidence. We know from Bradwardine's writings that his father, at the time of writing, was living in Chichester but since this must have been written more than twenty years after Bradwardine was born, it is somewhat fanciful to assume his father had not moved.\nAlthough it is not certain, there is strong evidence to suggest that Bradwardine remained at Merton College until\n1335\n. He held various university posts during this time including proctor and he received a number of degrees such as M.A. in\n1323\nand B.Th. some time before\n1333\n. It is during this period at Oxford that almost all of his works on logic, mathematics, and philosophy were written.\nIn\n1333\nBradwardine was appointed canon of Lincoln then, in\n1335\n, he joined the group of men surrounding Richard de Bury who was Bishop of Durham. He moved to London two years later when he was made chancellor of St Paul's Cathedral on\n19\nSeptember\n1337\n. Soon after this he became chaplain to King Edward III.\nKing Edward III claimed the title of king of France in January\n1340\n. His claim was not totally without justification since through his mother he was more closely related to the last ruler of the Capetian dynasty than was the French King Philip VI. Edward won a naval victory off the Flemish city of Sluis in June\n1340\nbut lack of resources to press forward forced him to make a truce. In July\n1346\nEdward landed in Normandy accompanied by his eldest son Prince Edward\n(\nknown as the Black Prince\n)\n. Bradwardine was certainly part of Edward's invasion force.\nThe English invading force won a decisive victory over the French at Crécy on\n26\nAugust\n1346\n. They then laid siege to Calais in September\n1346\nand it surrendered in August\n1347\n. David II of Scotland was an ally of the French and realising that Edward was occupied in the siege of Calais, invaded the north of England in October\n1346\n. Edward had expected this and left a strong force on the north of England to deal with the Scots. David II was defeated at the Battle of Neville's Cross\n(\nnear Durham\n)\n. At a victory celebration in France to celebrate the victories at both Crécy and Neville's Cross, Bradwardine gave as address the\nSermo epinicius\nin the presence of Edward III, the text of which has survived.\nEdward returned to England in October\n1347\n. Bradwardine was elected Archbishop of Canterbury on\n31\nAugust\n1348\n, but rather strangely Edward annulled the appointment. On\n4\nJune\n1349\nBradwardine was elected Archbishop of Canterbury for the second time, without it appears any objections from Edward. He was consecrated at Avignon on\n10\nJuly\n1349\nbut died of the plague soon after he returned to London to take up his duties. The Black Death had spread to England and France in\n1348\nand perhaps a third of the population of London died as a result at around the same time as Bradwardine.\nBradwardine was a noted mathematician as well as theologian and was known as 'the profound doctor'. He studied bodies in uniform motion and ratios of speed in the treatise\nDe proportionibus velocitatum in motibus\n(1328)\n. This work takes a rather strange line between supporting and criticising\nAristotle\n's physics. Perhaps it is not really so strange because\nAristotle\nviews were so fundamental to learning at that time that perhaps all that one could expect of Bradwardine was the reinterpretation of\nAristotle\n's views on bodies in motion and forces acting on them. It is likely that his intention was not to criticise\nAristotle\nbut rather to justify mathematically a reinterpretation of\nAristotle\n's statements.\nAristotle\nclaimed that motion was only possible when the force acting on a body exceeded the resistance. Although he did not express it in these terms, it had also been deduced from\nAristotle\n's\nPhysics\nthat the velocity of a body was proportional to the force acting on it divided by the resistance. Bradwardine used a mathematical argument to show that these two were inconsistent. He did this by assuming an initial force and resistance, then supposed that the resistance doubled, doubled again etc keeping the force constant. At some point, argues Bradwardine, the resistance will exceed the force so the body cannot move. But the velocity, given by the second rule, could not be zero.\nBradwardine then claims that an arithmetic increase in velocity corresponds with a geometric increase in the original ratio of force to resistance. This cleverly removes the contradiction, but of course is incorrect. His view, however, was very influential and it was accepted as a law of mechanics for over a hundred years. For example\nOresme\nfollowed Bradwardine's ideas of mechanics. Takahashi in\n[\n16\n]\ngives an interesting new interpretation of Bradwardine notion of ratios.\nAnother interesting, but fallacious, argument was produced by Bradwardine when he tried to disprove atomism using geometry. However, he questioned the logic of his own arguments as he felt perhaps the existence of geometry already assumes that atomism is false.\nBradwardine was the first mathematician to study \"star polygons\". They were later investigated more thoroughly by\nKepler\n. Other works by Bradwardine include the following.\nOn insolubles\nwhich discusses logical problems such as \"I am telling a lie\".\nOn \"it begins\" and \"It ceases\"\nwhich argues that a temporal interval has a first instant but no last instant. The end of the interval is marked by the first instant of its non-existence.\nSpeculative geometry\ncontains elementary geometry which is not all based on\nEuclid\n. For example the \"star polygons\" referred to above appear here as does a discussion of the problem of the filling of space by touching polyhedra. This work, in four sections, is discussed in detail in\n[\n12\n]\n.\nSpeculative arithmetic\nis based on a text by\nBoethius\n. There is argument between historians about which arithmetic text is the one due to Bradwardine. This is discussed, and a theory proposed, in\n[\n8\n]\n.\nOn the continuum\ndiscusses the atomic theory. It follows\nAristotle\n's views fairly closely. In it Bradwardine states:-\nNo continuum is made up of atoms, since every continuum is composed of an infinite number of continua of the same species.\nThis work is discussed in\n[\n14\n]\nwhere the author notes that this work by Bradwardine is a good early example of the application of mathematics to natural philosophy.\nOn future contingents\nand\nIn defence of God against the Pelagians and on the power of causes\nare Bradwardine's two major theological works. They attempt to argue against free will and in favour of Divine Will.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}