{
  "nome_completo": "Thoralf Albert Skolem",
  "nome_curto": "Thoralf Skolem",
  "ano_nascimento": "1887",
  "ano_morte": "1963",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Skolem/",
  "lugar_nascimento": "Sandsvaer, Buskerud, Norway",
  "lugar_morte": "Oslo, Norway",
  "biografia": "Thoralf Skolem\n's parents were Helene Olette Vaal and Even Skolem, who was primary school teacher. Although his father was a teacher, Thoralf came from a farming family with most of his relations being farmers. He attended secondary school taking the final examination, the Examen artium, in Kristiania\n(\nlater renamed Oslo\n)\nin\n1905\n. He then entered Kristiania University to study mathematics, but he also took courses on physics, chemistry, zoology and botany.\nIn\n1909\nSkolem took a job as assistant to the physicist Kristian Birkeland, who was famed for his experiments with the aurora-like effect obtained by bombarding a magnetized sphere with electrons, and Skolem's first publications were physics papers written jointly with Birkeland. Skolem took his state examination in\n1913\n, passing with distinction. His dissertation\nUndersokelser innenfor logikkens algebra\nⓉ\n(\nInvestigations on the algebra of logic\n)\nwas considered so outstanding that his achievement was reported to the King of Norway. He continued to act as Birkeland's assistant, however, and travelled with him to the Sudan in\n1913\nto observe the zodiacal light. Despite working on physics as Birkeland's assistant, he continued mathematical research and during this time he proved notable results on lattices which we mention below. In\n1915\nhe travelled to Göttingen where he studied during the winter semester. Of course this was during the years of World War I, and conditions in Göttingen were extremely difficult. In\n1916\nhe returned to Kristiania where he was appointed as a research fellow at the university. He did not, however, formally study for a doctorate as Fenstadt explains in\n[\n5\n]\n:-\n...\nViggo Brun\nand Skolem agreed that neither of them would bother to obtain the degree of Doctor, probably feeling that, in Norway, it served no useful function in the education of a young scientist.\nSkolem became a\nDocent\nin Mathematics in Kristiania in\n1918\n, and in the same year he was elected to the\nNorwegian Academy of Science and Letters\n. Despite his earlier agreement with Viggo Brun, he decided to submit a thesis for a doctorate in\n1926\n[\n5\n]\n:-\n... in the middle twenties a younger generation of Norwegian mathematician emerged. It seems that Skolem then felt he too ought to fulfil the formal requirement of having a doctorate, and he \"obtained permission\" from\nBrun\nto submit a thesis. In\n1924\nBrun\nhad been a professor in mathematics at the Norwegian Institute of Technology.\nSkolem's advisor in Kristiania\n(\nor Oslo as it was renamed in\n1925)\nhad been\nAxel Thue\nalthough he had died in\n1922\n, four years before Skolem decided to submit his thesis. It was entitled\nEinige Sätze über ganzzahlige Lösungen gewisser Gleichungen und Ungleichungen\nⓉ\n(\nSome theorems on integral solutions of certain equations and inequalities\n)\n, and was on integral solutions of certain algebraic equations and inequalities.\nOn\n23\nMay\n1927\nSkolem married Edith Wilhelmine Hasvold. He continued to work at the University of Oslo until\n1930\nwhen he moved to the Christian Michelsen's Institute in Bergen as a Research Associate. Although this does not sound a particularly grand title, in fact the post was a senior one in which Skolem was able to conduct independent research without any administrative or teaching duties. A condition of the job, however, was that he had to live in Bergen and that had the disadvantage that he did not have access to mathematical literature. He worked in Bergen until\n1938\nwhen, at the age of\n51\n, he returned to Oslo as Professor of Mathematics at the university. Fenstadt writes in\n[\n5\n]\n:-\n[\nSkolem\n]\nconducted the regular graduate courses in algebra and number theory, and rather infrequently lectured on mathematical logic.\n[\nHe\n]\nwas very modest and retiring by nature. He did not create any school and had no research students, but through his great accomplishments and research drive he inspired more than one of the younger Norwegian mathematicians.\nSkolem was remarkably productive publishing around\n180\npapers on topics such as\nDiophantine equations\n, mathematical logic,\ngroup theory\n, lattice theory and set theory. However, as Fenstadt explains in\n[\n2\n]\n:-\nSkolem published ... most of his papers in Norwegian journals, and they have not always been easy to obtain for mathematicians abroad. This has had the consequence that others later have rediscovered his results. One example is the Skolem-Noether theorem.\nHe did some early work in lattice theory. For example in\n1912\nhe was the first to give a description of a free distributive lattice generated by\nn\nn\nn\nelements. He also showed in\n1919\nthat every implicative lattice is distributive and, as a partial converse, that every finite distributive lattice is implicative. These results were rediscovered by other mathematicians in the\n1930\ns and in\n1936\nSkolem published\nÜber gewisse 'Verbände' oder 'Lattices'\nⓉ\n(\nOn some 'associations' or 'lattices'\n)\nwhich is a survey of his own results from the\n1912\nand\n1919\npapers.\nSkolem extended work by\nLöwenheim\n(\npublished in\n1915)\nto give the Löwenheim-Skolem theorem, which he published in\n1920\n. It states that if a theory within first-order predicate calculus has a model then it has a countable model. His\n1920\nproof of this result used the axiom of choice, but later in\n1922\nand\n1928\nhe gave proofs using König's lemma\n(\ndue to\nJulius König\n)\nwhich do not require the\naxiom of choice\n.\nHe made refinements to\nZermelo\n's axiomatic set theory, publishing work in\n1922\nand\n1929\n. The first was the published version of the lecture\nEinige Bemerkungen zur axiomatischen Begründung der Mengenlehre\nⓉ\n(\nSome remarks on the axiomatic justification of set theory\n)\nwhich he gave in\n1922\nat the\n5\nth\nScandinavian Mathematics Congress. Here he applied the Löwenheim-Skolem theorem to show what became known as Skolem's paradox: If the\nZermelo\n's axiomatic system for set theory is consistent then it must be satisfiable within a countable domain.\nJané writes in\n[\n8\n]\n:-\nSkolem is commonly portrayed as arguing that certain otherwise well understood concepts are suspect simply because they cannot be characterized in a first-order language; in particular that, since all first-order formalizations of set theory\n(\nif consistent\n)\nhave countable models, the concept of uncountability is flawed. ... Skolem's position is more solid than that. I see Skolem as arguing that all the evidence that has been given for the existence of uncountable sets is inconclusive, and the reason why he insists on considering countable models is that axiomatisation was put forward at the time as the only way to secure set theory, and what sets are and which sets exist was claimed to be determined by the axioms and their models\n(\nmuch as what Euclidean geometry is about was claimed to be determined by\nHilbert\n's axioms and their models\n)\n. In this situation, bringing countable models into play was perfectly in order, all the more so as no other models could be supplied without set-theoretical means. Today we may no longer uphold this claim, but if we do believe that there are uncountable sets, we should be willing to comply with Skolem's requirement that their existence be substantiated by some means other than mere formal postulation.\nIn\n1923\nSkolem also developed a theory of recursive functions as a means of avoiding the so-called paradoxes of the infinite in his paper\nBegründung der elementären Arithmetik durch die rekurrierende Denkweise ohne Anwendung scheinbarer Veränderlichen mit unendlichem Ausdehnugsbereich\nⓉ\n(\nJustification of elementary arithmetic by the recurrent mindset without the use of apparent variables with infinite extension area\n)\n. In it he developed number theory using two systems, one to define objects by primitive recursion, the other system to prove properties of the objects defined by the first system. With these he defined prime numbers and developed a considerable amount of number theory. Jervell, in\n[\n9\n]\n, sees Skolem as being a pioneer in computer science:-\nSkolem's two systems could be considered as a programming language for defining objects and a programming logic for proving properties about the objects.\nFrom\n1933\nhe did pioneering work in metalogic and constructed a nonstandard model of arithmetic. Hao Wang, in\nA survey of Skolem's work in logic\nwhich appears in\n[\n2\n]\nwrites:-\nIf one has to single out one most intriguing item, it would probably be his work on nonstandard models of set theory and number theory.\nWang also indicates how useful it is to read Skolem's original papers\n[\n2\n]\n:-\nSkolem has a tendency of treating general problems by concrete examples. Often proofs seem to be presented in the same order as he came to discover them.\nWe mentioned above that Skolem worked on algebra, and we also mentioned the Skolem-Noether theorem. Skolem published this theorem in\n1927\nin a paper\nZur Theorie der assoziativen Zahlensysteme\nⓉ\n(\nOn the theory of associative number systems\n)\n. It characterizes the automorphisms of simple algebras and was later rediscovered by\nEmmy Noether\n.\nSkolem was president of the\nNorwegian Mathematical Society\nand an editor of the\nNorsk Matematisk Tidsskrift\n(\nThe Norwegian Mathematical Journal\n)\nfor many years. After the creation of\nMathematica Scandinavica\n(\nsee the article on the\nNorwegian Mathematical Society\nfor the story of the founding of this journal\n)\nhe acted as an editor for the new journal. He received many honours such as being named a Knight of the First Class in the Royal Order of St Olav in\n1954\nby the King of Norway. He also received the Gunnerus Medal by Det Kongelige Norske Vitenskabers Selskab in\n1962\nin Trondheim.\nIn\n1957\nSkolem retired but continued to produce top quality research. He made several trips to the United States in the following years. Although Skolem was approaching\n76\nyears of age when he died, his death was totally unexpected since he was still an extremely active and highly productive mathematician\n[\n5\n]\n:-\nAge had not seemed to diminish either his research drive or creative ability.\nHe had planned a further trip to the United States and had accepted invitations to speak at several universities there. His death came very suddenly.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}