{
  "nome_completo": "Tibor Szele",
  "nome_curto": "Tibor Szele",
  "ano_nascimento": "1918",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szele/",
  "lugar_nascimento": "Debrecen, Hungary",
  "lugar_morte": "Szeged, Hungary",
  "biografia": "Tibor Szele\n's parents were Miklós Szele, a teacher at the Debrecen Institute of Religion where he was professor of theology, and his mother was Gizella Dicsöfi who was a teacher at the Debrecen\nGymnasium\n. Tibor was his parents' only child and they lavished great care on him as he grew up. He attended an elementary school in Debrecen and even at this stage he showed that he was gifted in mathematics. From\n1928\nto\n1936\nhe studied at the Debrecen Reformed Church Gymnasium. Now since the\n16\nth\ncentury Debrecen had been a stronghold of the Hungarian Reformed Church and, certainly in Szele's day, was known as \"the Calvinist Rome.\" In common with many Hungarian school children with mathematical talents at this time, he entered the mathematics competitions organised by KöMal, the Középiskolai Matematikai és Fizikai Lapok\n(\nHigh School Mathematics and Physics Journal\n)\n. This Journal had begun posing competition problems for high school children in\n1894\nand, after a break during the years of World War I, had continued the competitions. The journal was circulated monthly to schools in Hungary. In\n1934\n, when he was sixteen years old, Szele won first prize in the KöMal competition.\nIn the same year that the problem solving journal KöMal was launched, the Hungarian Mathematical and Physical Society decided to start up a mathematical competition for those graduating from secondary schools. It was called the\nEötvös\nCompetition, in honour of\nLoránd Eötvös\nwho was, in that year, made minister of education in the Hungarian government. The competition always consisted of three problems and those entering the competition had to answer the questions under examination conditions in an afternoon. The\n1936\ncompetition, the\n40\nth\nEötvös\nCompetition, posed the following three questions:\nProve that for all positive integers\nn\nn\nn\n1\n1.2\n+\n1\n3.4\n+\n.\n.\n.\n+\n1\n(\n2\nn\n−\n1\n)\n.\n2\nn\n=\n1\nn\n+\n1\n+\n1\nn\n+\n2\n+\n.\n.\n.\n+\n1\n2\nn\n.\n\\Large\\frac{1}{1.2}\\normalsize  + \\Large\\frac{1}{3.4}\\normalsize  + ... + \\Large\\frac{1}{(2n-1).2n}\\normalsize  = \\Large\\frac{1}{n+1}\\normalsize  + \\Large\\frac{1}{n+2}\\normalsize  + ... + \\Large\\frac{1}{2n}.\n1\n.\n2\n1\n​\n+\n3\n.\n4\n1\n​\n+\n.\n.\n.\n+\n(\n2\nn\n−\n1\n)\n.\n2\nn\n1\n​\n=\nn\n+\n1\n1\n​\n+\nn\n+\n2\n1\n​\n+\n.\n.\n.\n+\n2\nn\n1\n​\n.\nS\nS\nS\nis a point inside triangle\nA\nB\nC\nABC\nA\nB\nC\nsuch that the areas of triangles\nA\nB\nS\n,\nB\nC\nS\nABS, BCS\nA\nB\nS\n,\nB\nC\nS\nand\nC\nA\nS\nCAS\nC\nA\nS\nare all equal. Prove that\nS\nS\nS\nis the centroid of triangle\nA\nB\nC\nABC\nA\nB\nC\n.\nLet\na\na\na\nbe any positive integer. Prove that there exists a unique pair of positive integers\nx\nx\nx\nand\ny\ny\ny\nsuch that\nx\n+\n1\n2\n(\nx\n+\ny\n−\n1\n)\n(\nx\n+\ny\n−\n2\n)\n=\na\n.\nx + \\large\\frac{1}{2}\\normalsize (x + y - 1)(x + y - 2) = a.\nx\n+\n2\n1\n​\n(\nx\n+\ny\n−\n1\n)\n(\nx\n+\ny\n−\n2\n)\n=\na\n.\nSzele entered the\n1936\nEötvös\nCompetition, in the year he graduated from the Debrecen Reformed Church Gymnasium. He won first prize in this competition. Despite this great success in mathematics, Szele did not enrol for a degree in mathematics at university but rather began to study mechanical engineering at the Technical University of Budapest. However, after one semester he realised that mathematics and physics was the right degree for him so he returned to Debrecen and in early\n1937\nhe began studying this course at the University of Debrecen. At this time the university was named the István Tisza University of Debrecen. He was awarded his teacher's diploma from Debrecen in\n1941\nwhich qualified him to teach mathematics and physics at secondary schools. Szele was then appointed as an assistant in the Institute of Theoretical Physics at Szeged University but his research interests were close to\nLászló Rédei\nand\nLászló Kalmár\nwho worked in the Mathematical Institute at Szeged. Before the end of\n1941\n, advised by\nRédei\n, he had completed work on his Ph.D. thesis\nKombinatorikai vizsgálatok az irányitott teljes gráffal kapcsolatban\nⓉ\n(\nCombinatorial testing in relation to the overall directional graph\n)\n. This contains results on Hamilton paths in tournaments and solves a difficult problem which had been proposed to him by\nRédei\n. Szele proved the existence of a tournaments on\nn\nn\nn\nvertices which contain at least\nn\n!\n/\n2\nn\n−\n1\nn!/2^{n-1}\nn\n!\n/\n2\nn\n−\n1\nwell-oriented Hamiltonian paths. Alon and Spencer in their book\nThe Probabilistic Method\nsay that this was the first result proved by the probabilistic method later championed by\nPaul Erdős\n.\nWorld War II had begun on\n1\nSeptember\n1939\nwhen Germany invaded Poland. At this stage Hungary was not involved but, by October\n1940\n, Hungary had joined the Tripartite Pact originally signed by Germany, Japan and Italy. Hungarian military action began in April\n1941\nwhen Hitler requested Hungarian support for the German invasion of Yugoslavia. A few months later Hungarian troops were involved in the invasion of Russia. Young men in Hungary were called up for military service and Szele was one of these. He was called up military service in\n1942\nbefore he could take the oral examination of his thesis so, despite having completed his research for the degree in\n1941\n, it could not be conferred until World War II had ended. A paper with the results of his thesis was, however, published in\n1943\n. It was only in\n1946\nthat he was able to take the necessary oral examination and, five years after completing his thesis, the degree was awarded.\nFrom\n1946\nto\n1948\nSzele was an assistant at the Mathematical Institute at the University of Szeged. He published a joint paper with\nLászló Rédei\nin\n1947\n, namely\nAlgebraisch-zahlentheoretische Betrachtungen über Ringe I\nⓉ\n(\nAlgebraic-number-theoretic considerations of rings I\n)\n. He published two further joint papers with\nRédei\nin\n1950\n:\nAlgebraisch-zahlentheoretische Betrachtungen über Ringe II\nⓉ\n(\nAlgebraic-number-theoretic considerations of rings II\n)\n; and\nDie Ringe \"ersten Ranges\"\nⓉ\n(\nRings of 'first rank'\n)\n. He returned to Debrecen in\n1948\nwhere he\nhabilitated\nin algebra and combinatorics. He was promoted to Professor in\n1952\nand continued in this position until his death three years later at the age of\n36\n. In\n[\n1\n]\nLaszlo Fuchs writes about the times he spent discussing mathematics with Szele while he was a professor at Debrecen:-\nAs a professor, Szele had to come often from Debrecen to Budapest to attend meetings at the Department of Education or at the Academy. But his afternoons were always devoted to a more enjoyable activity: discussing mathematics. He used to come to my parents' home where we moved to a remote room, closed the door behind us and spent endless hours discussing our own and our students' works in progress, trying to prove theorems on the spot, calling each other's attention to interesting results we read in recent publications, swapping information on new developments, and above all exchanging ideas on various subjects: groups, rings, lattices, etc. The only person who dared to enter our work sanctuary was my mother who supplied us with strong espresso coffee\n(\nnecessary for any kind of mathematical activity in Hungary\n)\nand refreshments. Szele left only when he had to rush to catch the night train back to Debrecen. ... I was not immune to Szele's persuasive enthusiasm, and soon I found myself in the small, but very active, circle of abelian group theorists.\nWe should note that Laszlo Fuchs wrote two joint papers with Szele. These were\nIntroduction of complex numbers as vectors of the plane\n(1952)\nand\nContribution to the theory of semisimple rings\n(1952)\n. When Fuchs wrote the paper\nA note on regular rings\n(1956)\nhe dedicated it:-\nTo the memory of my beloved teacher Professor Tibor Szele.\nFuchs explains in\n[\n1\n]\nhow Szele became interested in abelian groups. In\n1896\nHermann Minkowski\nhad conjectured that if\nn\n-dimensional Euclidean space is filled by\nn\n-dimensional cubes so that every point is covered by a cube and no two cubes have interior points in common then there are cubes sharing\nn\n−\n1\nn-1\nn\n−\n1\ndimensional faces. No progress was made until\n1942\nwhen György Hajós translated\nMinkowski\n's conjecture into a problem in abelian group theory and so proved the conjecture true.\nLászló Rédei\nbecame interested in Hajós' solution and was able to simplify the proof.\nRédei\ndiscussed the problem with Szele who was able to make significant improvements in the proof and published he the paper\nNeuer vereinfachter Beweis des gruppentheoretischen Satzes von Hajós\nⓉ\n(\nNew simplified proof of the group theoretical theorems of Hajos\n)\n(1949)\n. Laszlo Fuchs writes\n[\n1\n]\n:-\nBoth\nRédei\nand Szele were captivated by the Hajós problem and very soon - being fascinated by the beauty of the subject - they started to learn about abelian groups in general and to investigate special types. ... Szele's remarkable talent began to unfold, and his interest soon developed into a lifelong commitment to the theory of abelian groups. When he was appointed to the algebra chair at the university in Debrecen, he intensified his research. ... Szele was filled with ideas which he shared with everybody who was willing to listen. His enthusiasm attracted several young mathematicians to the subject.\nAndor Kertész\n(1929\n-\n1974)\n, the author of\n[\n4\n]\n, studied at Debrecen from\n1952\nand obtained his doctorate in\n1954\n. Szele and Kertész wrote the joint paper\nOn the existence of non-discrete topologies in infinite abelian groups\nwhich was published in\n1953\n. In fact Szele, Kertész and Fuchs wrote the three author paper\nOn a special kind of duality in group theory\nwhich was also published in\n1953\n. Kertész writes in\n[\n4\n]\nabout Szele's research:-\nOne of the most characteristic traits of his research work was his unfailing ability to gauge the main trends of scientific development. As a result of his close contacts, by correspondence, with the leading algebraists of our time he often learned of their latest findings even before they appeared in print. He was particularly keen on general theories. He possessed the ability to perceive analogies and establish relations between apparently distant phenomena and he knew how to make a fruitful use of these observations. He was never weary of research. ... Another feature of his work was that, even in dealing with the most complicated problems, he always strove for the greatest possible simplicity.\nKertész also writes about Szele as a teacher\n[\n4\n]\n:-\nWith the death of Tibor Szele we lost not only an outstanding man of mathematical research but also an excellent teacher. His enthusiasm for mathematics and his love for his students made him a great teacher. Lucidity and delightful liveliness marked his lectures. In helping his students, he never spared himself. he readily gave them his time and energy. He posed problems, gave hints to their solution, and unselfishly assisted his students in order to awaken their interest for research. It took only a short time and an algebraical school centring around his person came into being.\nWe should note that it was not only students at Debrecen University who benefitted from Szele's teaching. He also provided regular extracurricular sessions for bright students at secondary schools in Debrecen and one of the many who benefitted from these sessions was\nLaci Kovács\n.\nKovács\nwas strongly influenced by Szele in his first year at Debrecen University but Szele died before\nKovács\nbegan his second year at university.\nLaszlo Fuchs explains what it was like cooperating with Szele in\n[\n1\n]\n:-\nThe majority of the problems were suggested by Szele, he always had a large supply of unanswered questions. In the problems we decided to work on jointly, he usually made initial progress toward their solutions; then we worked together when he visited me and later by correspondence, and at the end I had to give the final touch by pushing the results as far as possible. I cannot tell how grateful I am to my friend Szele for introducing me to this wonderful subject, and for his leadership in our cooperation. To get the right picture, I have to point out that we had to rely on each other to a great extent. At that time we algebraists in Hungary were quite isolated. The chance to travel abroad was practically nil: the few possibilities to visit countries in the eastern block in the exchange programs between the academies were - in practice - almost exclusively open only to the members of the Academy.\nSzele wrote one undergraduate text, namely\nIntroduction to algebra\n(\nHungarian\n)\n[\n4\n]\n:-\nHis book, 'Introduction to algebra', which was published in Hungarian in\n1953\nas a textbook for university students bears the stamp of his educational skill. The subject matter of the book is classical algebra, yet, by virtue of the careful thoroughness of exposition, the well-selected examples and instructive comments, it also affords a good preparation for studying higher algebra.\nIn\n1952\nSzele was awarded the Kossuth Prize, the most prestigious cultural award in Hungary. Sadly Szele died at the young age of\n36\nafter a short illness. The problem appears to have been a severe infection which developed after he contracted influenza. Although he was very sick,\nhe travelled to Szeged to participate in the conference celebrating the\n50\nth birthday of his mentor\nLászló Kalmár\n. He gave his talk, but the next day he was hospitalized and died there a few days later. After his death he was honoured in several different ways and we mention two of these. The Tibor Szele Commemorative Medal was founded by the\nJános Bolyai Mathematical Society\nin\n1970\n. It is awarded annually for major researchers in mathematics who have created scientific schools. An International Colloquium on Group Theory to the memory of Tibor Szele\n(1918\n-\n1955)\nwas held\n16\n-\n20\nSeptember\n1985\n, in Debrecen.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}