{
  "nome_completo": "William Timothy Gowers",
  "nome_curto": "Timothy Gowers",
  "ano_nascimento": "1963",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gowers/",
  "lugar_nascimento": "Marlborough, Wiltshire, England",
  "lugar_morte": null,
  "biografia": "Timothy Gowers\nis known as Tim. His parents are Caroline Maurice and William Patrick Gowers, and he has two sisters Rebecca Gowers and Katharine Gowers. Patrick Gowers is a composer, famous for composing the music for many films and also known for his works for the guitar. He has a doctorate from the University  of Cambridge:\nEric Satie: his studies, notebooks and critics\n(1965)\n. Rebecca Gowers is a freelance journalist and author. Her first book,\nThe Swamp of Death\n, was shortlisted in\n2004\nfor a CWA Golden Dagger Award for Non-Fiction and, more recently, her book\nWhen to Walk\nwas longlisted for the Orange Broadband Prize for Fiction. Katharine Gowers is a violinist with:-\n... exceptional gifts of musicianship and technical command. Even more important is her innate sense of style: a priceless gift which lifts her playing to a level of exceptional maturity.\nIn fact the Gowers family has other exceptionally distinguished members such as Tim Gowers' great-grandfather Sir Ernest Arthur Gowers GCB GBE\n(1880\n-\n1966)\nwho was a civil servant, but best known for work on style guides for writing the English language. He edited Fowler's\nModern English Usage\n, and wrote a book titled\nPlain Words\nwhich is still in print.\nTim Gowers was sent to King's College School, Cambridge where he was a boarder as his parents were living in London at the time. Given what we have already mentioned about his sister Katharine, it will come as no surprise to learn that Gowers is extremely musical and was a chorister at the School. He had some excellent mathematics teaching at the School from Mary Briggs, who had studied under\nMary Cartwright\nat Girton College. He won a King's scholarship to Eton College\nwhere\n[\n10\n]\n:-\nI had another inspirational teacher,\nNorman Routledge\n, who had been a fellow of King's. He did not allow himself to be limited to the syllabus but ranged far more widely. In my last two years at Eton, the mathematics specialists were given a weekly sheet of challenging problems which were only loosely based on the syllabus, if at all. Of course, boys being boys, we tended to do nothing for five days and then rush at them for two days, but even so it was a very valuable experience.\nAfter completing his school education at Eton, Gowers matriculated at Trinity College, Cambridge. It was while he was an undergraduate that Gowers decided that he wanted to become a professional mathematician\n[\n10\n]\n:-\nI became certain that I would like to be a professional mathematician some time when I was an undergraduate - though, even then, I had little idea of what this meant.\nHowever, it was not until he took\nBéla Bollobás\n's course on the geometry of\nBanach spaces\nwhile studying for Part III of the Mathematical Tripos that Gowers found an area of mathematics which he felt was the right one for him to begin research\n[\n10\n]\n:-\nLooking back it is amusing to remember how little idea I had of what research in different areas would be like when I made such an important choice. But I was lucky and found myself in an area that suited me very well, and with an excellent supervisor.\nGowers married Emily Joanna Thomas, daughter of Valerie Little and Sir Keith Thomas\n(\nhistorian and President of Corpus Christi College Oxford\n)\nin\n1988\n; they had two sons and a daughter. In\n1990\nGowers was awarded his doctorate for his thesis\nSymmetric Structures in Banach Spaces\nwritten with Béla Bollobás as his thesis advisor. His first paper\nSymmetric block bases in finite-dimensional normed spaces\nwas published in\n1989\nand in the same year he gave a survey lecture\nSymmetric sequences in finite-dimensional normed spaces\nto the conference 'Geometry of Banach spaces' held in Strobl, Austria. He was appointed as a Research Fellow at Trinity College in\n1989\n, holding this position until\n1993\n. He was appointed as a Lecturer at University College, London, in\n1991\nand spent four years there. However, in some sense he never left Cambridge\n[\n10\n]\n:-\nI used to commute from Cambridge, and found the train a congenial place to work, making at least one genuine breakthrough on it.\nHe was promoted to Reader in\n1994\nand in the same year was an invited speaker at the International Congress of Mathematicians held in Zürich where he gave the address\nRecent results in the theory of infinite-dimensional\nBanach\nspaces\n. During the four years he spent at University College he continued to work on\nBanach\nspaces and he was awarded the\n1995\nJunior\nWhitehead\nPrize by the\nLondon Mathematical Society\nfor this work. The citation for the prize reads\n[\n12\n]\n:-\nDr W T Gowers of University College, London, is awarded a Junior\nWhitehead\nPrize for his work in applying infinite combinatorics to resolve a series of longstanding questions in\nBanach\nspace theory, some originating with\nBanach\nhimself. Dr Gowers' achievements include the following: a solution to the notorious\nBanach\nhyperplane problem\n(\nto find a\nBanach\nspace which is not isomorphic to any hyperplane\n)\n, a counterexample to the\nBanach\nspace\nSchröder\n-\nBernstein\ntheorem, a proof that if all closed infinite-dimensional subspaces of a\nBanach\nspace are isomorphic then it is a\nHilbert\nspace, and an example of a\nBanach\nspace such that every bounded operator is a\nFredholm\noperator. Over the past five years, Gowers has made the geometry of\nBanach\nspaces look completely different. The techniques he uses are highly individual; in particular, he makes use of a\nRamsey\ntheory for linear spaces, stating a dichotomy for subspaces rather than subsequences. In this area, where there is initially little structure, imagination and technical strength of a high calibre are needed. The work demonstrates both characteristics, and the techniques seem likely to find further application in different fields in the future.\nIn\n1995\nGowers was appointed as a lecturer at the University of Cambridge. In the following year he was awarded a\nEuropean Mathematical Society\nPrize at the\n2\nnd\nEuropean Congress of Mathematics held in Budapest, Hungary. The citation for the Prize reads:-\nWilliam Timothy Gowers' work has made the geometry of\nBanach\nspaces look completely different. To mention some of his spectacular results: he solved the notorious\nBanach\nhyperplane problem, to find a\nBanach\nspace which is not isomorphic to any of its hyperplanes. He gave a counterexample to the\nSchröder\n-\nBernstein\ntheorem for\nBanach\nspaces. He proved a deep dichotomy principle for\nBanach\nspaces which, if combined with a result of Komorowski and Tomczak-Jaegermann, shows that if all closed infinite-dimensional subspaces of a\nBanach\nspace are isomorphic to the space, then it is a\nHilbert space\n. He gave\n(\njointly with Maurey\n)\nan example of a\nBanach\nspace such that every bounded operator from the space to itself is a\nFredholm\noperator. His mathematics is both very original and technically very strong. The techniques he uses are highly individual; in particular, he makes very clever use of infinite\nRamsey\ntheory.\nAt the European Congress, Gowers lectured on\nBanach spaces with few operators\n. Two years later, he received a\nFields\nMedal at the International Congress of Mathematicians held in Berlin in\n1998\n. The citation begins\n[\n4\n]\n:-\nWilliam Timothy Gowers has provided important contributions to functional analysis, making extensive use of methods from combination theory. These two fields apparently have little to do with each other, and a significant achievement of Gowers has been to combine these fruitfully.\nThe citation ends:-\nA year ago, Gowers attracted attention in the field of combination analysis when he delivered a new proof for a theorem of the mathematician\nEmre Szemerédi\nwhich is shorter and more elegant than the original line of argument. Such a feat requires extremely deep mathematical understanding.\nIn\n1998\nGowers was named\nRouse Ball\nProfessor of Mathematics at Cambridge. In\n1999\nhe became a fellow of the\nRoyal Society of London\n. He continues to produce papers of great significance such as\nHypergraph regularity and the multidimensional\nSzemerédi\ntheorem\n(2007)\n; Gabor Sarkozy's review begins:-\nIn this breakthrough paper the author proves his version of the Hypergraph Regularity Lemma and the associated Counting Lemma. As an application, he gives the first combinatorial proof of the multidimensional Szemerédi theorem of\nFurstenberg\nand Katznelson, and the first proof that provides an explicit bound.\nAnother highly significant recent paper by Gowers is\nQuasirandom groups\n(2008)\nbut we will mention several important works by Gowers which are major contributions to mathematics in addition to his amazing research contributions. First let us mention his book\nMathematics. A very short introduction\n(2002)\n. The book contains eight chapters: What does it mean to use mathematics to model the real world?; What are numbers, and in what sense do they exist\n(\nespecially \"imaginary\" numbers\n)\n?; What is a mathematical proof?; What do infinite decimals mean, and why is this subtle?; What does it mean to discuss high-dimensional\n(\ne.g.\n26\n-dimensional\n)\nspace?; What's the deal with non-Euclidean geometry?; How can mathematics address questions that cannot be answered exactly, but only approximately?; Is it true that mathematicians burn out at the age of\n25\n? and other sociological questions about the mathematical community.\nLet us end this biography with giving some details of two further innovative projects in which Gowers has been involved. The first of these is the book\nThe Princeton Companion to Mathematics\n(2008)\nwith Gowers as editor, and June Barrow-Green and Imre Leader as associate editors.\nTerence Tao\nbegins a review writing:-\nThe Princeton companion to mathematics is a unique text, which does not fall neatly into any of the usual categories of mathematical writing. It is not quite a mathematical encyclopedia, it is not quite a collection of mathematical surveys, it is not quite a popular introduction to mathematics, and it is certainly not a mathematics textbook; and yet it is still an immensely rich and valuable reference work that covers almost all aspects of modern mathematics today\n(\nalthough there is certainly an emphasis on pure mathematics at the research level\n)\n. An encyclopedia might focus primarily on definitions, a survey article might focus on history or on the latest research, and a popular introduction might focus on analogies, personalities or entertaining narrative; in contrast, this book is intended to answer\n(\nor at least address\n)\nbasic questions about mathematics, such as \"What is arithmetic geometry?\", \"Why do we care about function spaces?\", \"How is mathematics used today in biology?\", \"What is the significance of the\nRiemann\nhypothesis?\", \"Why are there so many number systems?'\", or \"Is mathematical research all about proving theorems rigorously?\".\nTao\nends his review by writing:-\nIn summary, this unique book is an extraordinarily broad and surprisingly accessible reference work for a remarkably large fraction of modern\n(\nand historical\n)\nmathematics. While it does not substitute by any means for more traditional textbooks in mathematics, it complements these more detailed, precise, and technical texts nicely, and is one of the rare places where one can actually see all of mathematics as a unified subject, with coherent themes and goals.\nThe final project we mention is the \"Polymath project.\" Gowers suggested:-\n... if a large group of mathematicians could connect their brains efficiently, they could perhaps solve problems very efficiently as well.\nMichael Nielsen explains:-\nUsing principles similar to those employed in open source programming projects,\n[\nGowers\n]\nused blogs and a wiki to organize an open mathematical collaboration attempting to find a new proof of an important mathematical theorem known as the density Hales-Jewett theorem.\nThe project has been very successful although perhaps fewer mathematicians took part than Gowers had hoped.\nGowers' first marriage was dissolved in\n2007\nand in\n2008\nhe married Julie Barrau; they have one son.\nGowers was Knighted in the Queen's Birthday Honours List\n2012\n. On\n16\nJune\n2012\nit was announced that the Knighthood was to Professor William Timothy Gowers, FRS, Royal Society Research Professor, Department of Pure Mathematics and Mathematical Statistics, University of Cambridge: For services to Mathematics. He received a further honour in\n2013\nwhen, on Friday\n13\nSeptember, in the Younger Hall, St Andrews, he was given an honorary degree during a special graduation ceremony which formed part of the University of St Andrews'\n600\nth\nAnniversary celebrations. He was one of seventeen \"international scholars and thinkers\", \"some of the best minds of our generation\", who were honoured in this way.\nThe laureation address by Kenneth Falconer, School of Mathematics and Statistics, University of St Andrews, is at\nTHIS LINK\nFinally let us quote some words by Gowers about mathematics:-\nIn very general terms I suppose if you divide mathematics into that which uses 'elementary' methods and mathematics that uses a lot of sophisticated theory and well-established techniques, then I'm drawn towards the former rather than the latter.\nI just try and find certain problems that I might be able to think about profitably, and quite often I think about problems and get absolutely nowhere. ... with most problems I think about I get absolutely nowhere, but with\nBanach\nspaces and combinatorics it was just the case with both of them, there were problems that seemed reasonable to tackle, and I found them interesting.\nI like to talk about completing the square, when you have result A that generalises in one direction to result B and in another direction to result C: then you want to find the generalisation of C that corresponds to how B generalises A.\nI can work at home and in my office, and those are the two places I work most. Just anywhere where I've got a pad of paper and a biro ... But if you're sitting waiting in an airport lounge, which for many people would be a very boring experience, for a mathematician it isn't. Get out some paper and have a think about things.\nWe encourage the reader to look further at Gowers' ideas about mathematics set out in\n[\n6\n]\n,\n[\n7\n]\nand\n[\n8\n]\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic"
  ]
}