{
  "nome_completo": "Tjalling Charles Koopmans",
  "nome_curto": "Tjalling Charles Koopmans",
  "ano_nascimento": "1910",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Koopmans/",
  "lugar_nascimento": "'sGraveland, Netherlands",
  "lugar_morte": "New Haven Connecticut, USA",
  "biografia": "Tjalling Charles Koopmans\nwas known as Challing to his colleagues. His parents, Sjoerd Koopmans and Wijtske van der Zee, were both school teachers who held education in the highest regard. His father was a strict Calvinist but his mother was more liberal in her religious views. Tjalling had two older brothers and all three boys attended the school of which their father, Sjoerd Koopmans, was the headmaster. In fact their home was sandwiched between two buildings which formed the school. The oldest boy, Jan, became a minister of the Dutch Reformed Church, while the middle boy, Hendrik, became a chemical engineer. Home life was happy with much music making\n(\nTjalling was taught to play the violin\n)\nand frequent religious instruction.\nWhen he was twelve years old, Tjalling was sent to the Christian High School at Hilversum which was about\n15\nkm from his home. There he learnt mathematics, physics, chemistry, Latin, Greek, and three modern languages. At age fourteen Tjalling was awarded a stipend by the St Geertruidsleen of Wijmbritseradeel which supported him during his remaining three years at the Christian High School and it also supported him at the University of Utrecht, which he entered in\n1927\n. There he studied mathematics and theoretical physics, was interested in the philosophy of science, but he also became interested in economics. However his first two publications, while still an undergraduate at Utrecht, were on quantum mechanics. Koopmans graduated with the equivalent of a Master's degree in\n1932\n.\nAfter his studies at Utrecht, Koopmans studied under\nJan Tinbergen\nin Amsterdam during\n1934\nand then under Ragnar Frisch in Oslo in\n1935\n. His doctoral thesis\nLinear regression analysis of economics\nwas presented to the University of Leiden and he was awarded his doctorate in\n1936\n. In October of the same year he married Truus Wanningen who was an economist; they had three children, two daughters Anne and Helen, and a son Henry. Koopmans was appointed as a lecturer at the Netherlands School of Economics, Rotterdam, in\n1936\nwhere he spent a couple of years as a colleague of\nTinbergen\nbefore moving to the League of Nations in Geneva. Here he worked on business cycle modelling and again was a colleague of\nTinbergen\nwho worked there as a scientific advisor. In May\n1940\nGerman troops invaded the Netherlands and France and by the middle of June they occupied Paris. Koopmans fled from the Nazi threat in June, going to the United States with his wife and six week old daughter.\nSamuel Wilks\ngave him every assistance during this difficult period but finding a permanent job was hard. He was first a research assistant at Princeton during\n1940\n-\n41\nthen was employed by the Penn Mutual Life Insurance Company in Philadelphia for a year. Following this Koopmans worked for two years for the British Merchant Shipping Mission in Washington\n[\n1\n]\n:-\nIn that position he was concerned with the selection of shipping routes that would minimize the total cost of transporting required quantities of goods, available at various locations in America, to specified destinations in England. He showed that the desired result is obtainable by the straightforward solution of a system of equations involving the costs of the materials at their sources and the costs of shipping them by alternative routes. He also devised a general mathematical model of the problem that led to the necessary equations.\nIn\n1944\nhe wrote\nExchange ratios between cargoes on various routes\nbut it was only published for the first time in\n1970\nin\n[\n2\n]\nwhich is a collection of\n28\nof Koopmans' papers published to celebrate his sixtieth birthday. In this\n1944\nwork he initiated the topic of operational research called 'activity analysis' for which he received\n(\njointly with\nKantorovich\n)\nthe Nobel Prize in Economics for\n1975\n. He is also considered as one of the three inventors of linear programming during this period. Dorfman writes\n[\n6\n]\n:-\nAround\n1940\n, linear programming was an idea whose time had come. Accordingly, it was discovered three times, independently, between\n1939\nand\n1947\n, but each time in a somewhat different form dictated by the special circumstances of that discovery. The first discovery was by\nL V Kantorovich\n, a Soviet citizen, the second was by T C Koopmans, Dutch, and the third by\nG B Dantzig\n, American.\nDantzig\nalso examines Koopmans' contributions to linear programming in\n[\n5\n]\nwhere he writes:-\nLinear programming is viewed as a revolutionary development giving man the ability to state general objectives and to find, by means of the simplex method, optimal policy decisions for a broad class of practical decision problems of great complexity.\nKoopmans joined the Cowles Commission for Research in Economics at the University of Chicago in\n1944\n. He became a naturalized U.S. citizen in\n1946\n, continuing his association with the Cowles Commission when it became the Cowles Foundation and moved to Yale University in\n1955\n. He was appointed as Alfred Cowles Professor of Economics at Yale and held this post until he retired in\n1980\n.\nLet us briefly mention some of Koopmans' papers. In\nIdentification problems in economic model construction\n(1949)\nhe used matrix methods to study structural equations within a linear economic model. His paper\nThe identification of structural characteristics\n(1950)\n, written jointly with O Reiersol, is concerned with the problem of drawing inferences from the hypothetically exact probability distribution of observed variables to the theoretical structure which generates the distribution.\nAssignment problems and the location of economic activities\n(1957)\n, written jointly with M Beckmann, examines the allocation of indivisible resources.\nThree Essays on the State of Economic Science\n(1957)\n[\n9\n]\n:-\n... is a masterful introduction to the welfare properties of competitive allocation mechanisms in terms of activity analysis.\nSelected topics in economics involving mathematical reasoning\n(1959)\n, written jointly with A F Bausch, summarizes a course of lectures on mathematical aspects of economic theory. Dorfman writes:-\nThe emphasis lies heavily on applications of the theory of convex sets, and in particular of convex polyhedra, to problems relating to efficient allocation of economic resources, as the following outline indicates: Existence and optimality of competitive equilibrium; equilibrium in international trade; equilibrium over time and capital theory;\nvon Neumann\n's linear growth model; linear activity analysis and some applications; macroeconomic dynamics; econometrics.\nHe published\nStationary ordinal utility and impatience\n(1960)\nand a further continuation of this work in\nStationary utility and time perspective\n(1964)\n. The paper\nOn the existence of a subinvariant measure\n(1964)\n, written with R E Williamson, is an interesting work on measure theory which gives a construction analogous to that of the\nHaar\nmeasure for compact sets. His article\nOn the concept of optimal economic growth\n(1965)\nis one of the best introductions to his major contributions to the optimal allocation of economic resources over time. Finally Koopmans own summary of\nObjectives, constraints, and outcomes in optimal growth models\n(1967)\nis as follows:-\nThis paper surveys the results of mostly recent research on optimal aggregate economic growth models, and comments on the difficulties encountered and on desirable directions of further research.\nMatthews writes of Koopmans character and interests in\n[\n9\n]\n:-\nKoopmans was known to friends as a modest scholar, one committed to precise answers for narrow, well-defined questions, and as an accomplished amateur musician and chess enthusiast.\nHis greatest honour was receiving the Nobel Prize for Economics in\n1975\n. He was also honoured by election to the\nNational Academy of Sciences\n(\nUnited States\n)\nand the\nAmerican Academy of Arts and Sciences\n. He was president of the American Economics Association and also of the Econometric Society.\nKoopmans, who lived in Hamden, Connecticut, died at Yale-New Haven Hospital after suffering a series of cerebral strokes.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}