{
  "nome_completo": "Derek Thomas Whiteside",
  "nome_curto": "Tom Whiteside",
  "ano_nascimento": "1932",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whiteside/",
  "lugar_nascimento": "Blackpool, England",
  "lugar_morte": "Wokingham, Berkshire, England",
  "biografia": "Tom Whiteside\n's father had been wounded on the Western Front in World War I and as a consequence was disabled. His mother died was he was five years old so Tom and his older brother were brought up in difficult circumstances in Blackpool by their father. Tom's first schooling was at St John's Church of England Primary School in Blackpool, then he attended Blackpool Grammar School from September\n1943\n. Nick Oakden, who entered Blackpool Grammar in the same year as Whiteside, related memories of Tom from that period:-\nHis progress up the school was distinguished, not only by uninterrupted academic success but by his appearance: He was tall for his age; a pale complexion, a mass of blond, almost white, hair over a high fore head. He had no interest in athletics or sport, but was nevertheless, physically powerful.\nTom acquired a reputation throughout the school for being impervious to pain; something of a stoic. I cannot recall his ever wearing an overcoat - even in the most inclement weather.\nTom never rushed his words. Every reply to a question from friends and teachers alike, was measured, deliberate, and carefully considered.\nOften he could be seen with a couple of mathematics books under his arm striding purposefully between his home, near North Station, and the Queens Street Public Library.\nDespite this love of mathematics, his main subjects at school were history, French, and Latin. He won a State Scholarship in\n1951\nto study at Bristol University and, after an outstanding undergraduate career, he was awarded a starred B.A. with First Class Honours in French and Latin in July\n1954\n. After the award of his degree, Whiteside undertook two years' National Service spent as a Trooper in the\n5\nth\nRoyal Tank Regiment stationed at Barce in Libya, on the northern fringe of the Sahara desert.\nUnsure what to do after completing National Service in\n1956\n, one of his school friends, Peter Hall, wrote to him suggesting that he undertake postgraduate studies at Cambridge. Peter Geoffrey Hall was the same age at Whiteside but after leaving Blackpool Grammar School in\n1951\nhe had gone to St Catharine's College, Cambridge, where he studied Geography and Geology. Whiteside followed his school friend's advice and filled in an application form to enter St Catharine's College, Cambridge, and sent it off. His first idea was to undertake research in one of the topics of his undergraduate studies, but he changed his mind at the last minute. He then had to make a rapid decision on the area to choose and having a \"devouring interest\" in mathematics enhanced by his enjoyment of writing a prize-winning essay on\nThe History of Mathematics\nwhen at school, he decided on the spur of the moment to change his research topic to the history of mathematics.\nRichard Bevan Braithwaite, Knightbridge Professor of Moral Philosophy, was at King's College, and he accepted Whiteside as a research student. This meant that Whiteside became a postgraduate student in the Faculty of Moral Science. His research topic was officially registered as\nSome Aspects of the Growth of Mathematical Ideas of Space and Time in Seventeenth and Eighteenth Century England\n. Braithwaite and Whiteside were not well suited and so after a year he changed his supervisor to Michael Anthony Hoskin who at the time was a research fellow at Jesus College. Hoskin had a degree in pure mathematics from the University of London and then undertook research at Peterhouse. He had published\nZero-dimensional valuation ideals associated with plane curve branches\nin\n1956\nbut his interests were turning more towards the history of mathematics. Whiteside wrote\n[\n5\n]\n:-\nHe\n(\nHoskin\n)\nwas very nice to me, not so much as a technical supervisor but as a great friend, encouraging me when I was down in the dumps, which most of the time every other lonely Cambridge research student at that time, was.\nWith the change of supervisor came a change in thesis title to\nCurrents of mathematical thought in England in the late seventeenth century, with special reference to concepts of number, space and time\n. Shapiro writes\n[\n4\n]\n:-\n[\nWhiteside\n]\nquickly concluded that most existing histories of mathematics were unreliable and superficial, and immersed himself in reading\n17\nth\n-century mathematical treatises. On an impulse in May\n1958\n, while researching his thesis, he asked the librarian whether they might have any of\nNewton\n's manuscripts. He was brought a pile of about eight boxes - and his Newtonian studies began.\nThe author of\n[\n6\n]\nwrites:-\nDuring his thesis work he encountered the Portsmouth Collection, the archive of\nNewton\n's mathematical papers that had passed via\nNewton\n's niece to the family of the Earls of Portsmouth; the fifth Earl donated them to the University of Cambridge in the\n19\nth\ncentury. Despite, or because of, the efforts of previous scholars to organise this archive, the material was in a state of confusion. Whiteside threw himself into the study of the\nNewton\npapers, which was to become his life's work.\nIn\n1959\nhe wrote the first draft of his thesis in\n29\ndays. Hoskin suggested that he apply for a Leverhulme Fellowship to enable him to continue undertaking research on\nNewton\n's manuscripts. He was awarded a Fellowship which supported him from\n1959\nto\n1961\n. His doctoral thesis was published in\n1961\nin the first volume of the newly established journal - the\nArchive for the History of the Exact Sciences\n. Published under the title\nPatterns of mathematical thought in the later seventeenth century\n, the paper occupies over\n200\npages of the volume. It established his reputation as a leading scholar. Whiteside was awarded a second research fellowship, this time from the Department of Scientific and Industrial Research, which supported his studies from\n1961\nto\n1963\n. During this time he married Ruth Isabel Robinson, who like Whiteside was from Blackpool, in\n1962\n; they had two children, Philippa and Simon, who both went on to become graduates of Trinity College, Cambridge.\nWhiteside was appointed as a Research Assistant in the Whipple Museum of the History of Science of Cambridge University in\n1963\n, holding this position for nine years. In keeping with the founder Robert Whipple's wishes, the Museum plays an active role in the teaching of history and philosophy of science. During this period Whiteside spent\n1969\nas Woodward Visiting Professor at Yale University, Connecticut, USA. In\n1972\nhe was promoted to Assistant Director of Research at Cambridge, then in\n1976\nhe was appointed University Reader in the History of Mathematics at Cambridge. In\n1987\nhe became University Professor of the History of Mathematics and Exact Sciences in the Department of Pure Mathematics and Mathematical Statistics at Cambridge, a position he retained until he retired in\n1999\n. He was then made Professor Emeritus and continued to work in the Department. On his death the Department of Pure Mathematics and Mathematical Statistics wrote these words of tribute:-\nIt is with great sadness that I report the death of Tom Whiteside, for many years a member of this Department. Tom was widely honoured as the foremost historian of mathematics of his generation, and the editor of the magisterial Mathematical Papers of\nIsaac Newton\n. He was an expert in the complex interpretative issues which arise in any serious consideration of\nNewton\n's writings, and recognised as a unique authority on\n17\nth\ncentury mathematics. The Department was proud that latterly Tom preferred to be a member of this rather than any other department in the University, and we took pleasure in his presence amongst us for many years.\nLet us examine first the work for which Whiteside will be best remembered, his monumental achievement in publishing the eight volumes of\nThe mathematical papers of Isaac Newton\n. It was as early as\n1960\n, before Whiteside had published his thesis and attained international distinction, that he approached Cambridge University Press with a proposal to edit\nNewton\n's unpublished mathematical work. His proposal was accepted and he began work on the project which was to occupy him for the next\n20\nyears. Before the first volume appeared, however, Whiteside published the first of two volumes\nThe mathematical works of Isaac Newton\nwhich contained English translations of\nNewton\n's published mathematical works on the calculus. This first volume appeared in\n1964\nwith the second volume, containing English translations of\nNewton\n's Lucasian lectures on algebra and analytical geometry, his enumeration of cubics, and his tract on finite differences, appearing in\n1967\n. By the time this second volume of\nNewton\n's published works was in print, the first volume of his previously unpublished papers had appeared in\n1967\n. The remaining volumes were published in\n1968\n,\n1969\n,\n1971\n,\n1972\n,\n1974\n,\n1976\nand\n1981\n. Each of the eight volumes contained around\n600\npages making a grand total of\n5015\npages. C J Scriba reviewed all eight volumes\n(\nas well as the two volumes of\nThe mathematical works of Isaac Newton\n)\n. We reproduce below a fragment from his reviews of six of the eight volumes:-\nVolume\n1\n: Each section is equipped with a masterly historical introduction and with very full explanatory notes.\nVolume\n2\n: This volume, provided like the former with a general introduction as well as introductions and numerous notes to each section, English translations of\nNewton\n's Latin pieces, facsimiles, an analytical table of contents and an index of names, was again prepared with the greatest care and competence. If this edition\n(\nto be completed in eight volumes including a general subject index\n)\nshould progress with the present pace and on the same high level of scholarship it will in a few years be a lasting monument to\nNewton\n, the editor and Cambridge University Press alike.\nVolume\n3\n: Historians interested in other aspects of Newtonian thought will envy us for this model edition of his mathematical papers.\nVolume\n4\n: To say any more about the editor's exemplary introductions, notes and editing techniques, and about the excellent handling of the difficult type-setting by the Cambridge University Press would be carrying coals to Newcastle.\nVolume\n7\n: As customary, in this magnificent edition of\nNewton\n's mathematical papers, all Latin pieces\n(\nexcept for secondary texts of minor importance\n)\nhave been translated into English on facing pages. An abundance of references direct the reader either to the contemporary literature or to the previous volumes of this series where related problems have already been treated. In a few cases the editor now modifies an earlier guess or tentative assignment of the date of composition of an undated piece; this is inevitable after two decades of preoccupation with the mass of\nNewton\n's mathematical output.\nVolume\n8\n: \"Newtone, te salutamus\" are the last words in the editor's \"General introduction\" of this eighth and final volume of\nNewton\n's mathematical papers. ... there is every reason to say \"Whiteside, we thank thee\".\nDespite the huge task undertaken by Whiteside in editing these volumes over the span of\n20\nyears, it would be wrong to think that he worked on these to the exclusion of writing other papers. For example he published\nBefore the Principia: the maturing of\nNewton\n's thoughts on dynamical astronomy,\n1664\n-\n1684\nin\n1970\n. V E Thoren writes:-\nAs an authoritative outline of the present state of scholarly opinion on one of the most significant topics in the history of science, this article will interest almost any mathematical reader.\nAnother of Whiteside's\n1970\npapers is\nThe mathematical principles underlying Newton's Principia mathematica\n. Whiteside describes the contents of this paper himself and we reproduce it in full, partly to indicate its contents, but also to illustrate Whiteside's style:-\nIt is still widely parroted in secondary histories of mathematics that in his Philosophiae Naturalis Principia Mathematica\n(\nfirst edition, London,\n1687)\nNewton\nrecast into a superficially classical form dynamical results which he had derived by an equivalent prior fluxional analysis, but which he opted not to put to the public in their original dress. In this annotated version of his ninth\nGibson\nLecture in the history of mathematics, delivered at the University of Glasgow on\n21\nOctober\n1969\n, the author shows how feeble the documentary evidence supporting such a view is. The Grecian scaffolding on which the Principia is raised is but an expository framework which \"should not disguise the reality that the edifice beneath is, in its essentials, neither classically inspired nor classically built\". On the other hand, though\nNewton\nhimself was prone in his later life to argue that the arguments which he had used in the central portions of his Principia were fluxional analyses dressed up in the traditional geometric style, his basic method in the Principia is to employ vanishingly small infinitesimal linelets and arclets, determining their limit-ratios. The well known preliminary fluxional analysis of the solid of revolution of least resistance is unique, and\nNewton\nmade no attempt to do other than state its result in the book as published\n(\nBook\n2\n, Prop.\n35\n, Scholium\n)\n. It is to be assumed that in all other cases\nNewton\ndiscovered the theorems of his Principia essentially as he set them out in print. To prove this point, the author dwells at some length on two important topics treated by\nNewton\nfor the first time: the determining of the general orbit traversed in an arbitrary central force field\n(\nBook\n1\n, Props.\n39\n-\n41)\n, with his - incomplete - working of the inverse-cube instance; and his discussion of motion in a projectile trajectory resisted instantaneously as some given function of the speed\n(\nBook\n2\n, Props.\n1\n-\n14\n, especially\n10\nwhere he uses a proto-Lagrangian analysis to deduce a third-order defining differential equation\n)\n. No whiff of any fluxional analysis is found here.\nOf course, when Whiteside completed his twenty years work on\nNewton\n's unpublished mathematical papers, he was still only\n49\nyears of age and in the prime of his research abilities. He embarked on another major project, this time making an in depth study of the papers of\nJohannes Kepler\nheld in the Soviet Academy of Sciences in Leningrad. Piers Bursill-Hall writes\n[\n1\n]\n:-\nOnce again, Whiteside's remarkable combination of memory, tenacity and ability to rework the calculations of every line of hundreds of pages of notebooks, and otherwise unconnected manuscript pages, allowed him to follow\nKepler\n's mathematical and astronomical journey as he digested the planetary data of\nTycho Brahe\n.\nThis, however, did not end up in a series of major publications as his work on\nNewton\nhad, rather he published only a few scraps.\nWhiteside received many honours for his outstanding contributions to the history of mathematics. In particular we mention the Koyré medal of the International Academy of the History of Science\n(1968)\n, the Sarton medal of the History of Science Society\n(1977)\n, election as a fellow of the British Academy\n(1975)\n, and an honorary D Litt. from Lancaster University\n(1987)\n. In the citation for this honour he was praised for the rise to fame of \"the local slum boy.\" Finally let us mention the honour he received by having the volume\nThe investigation of difficult things : Essays on Newton and the history of the exact sciences in honour of D T Whiteside\n(1992)\npublished for his\n60\nth\nbirthday.\nWe have already given an indication of Whiteside's character from comments from a school friend above. Here are more comments, this time from Piers Bursill-Hall\n[\n1\n]\n. The authors of the present article\n[\nJOC and EFR\n]\n, having met Tom Whiteside at various history of mathematics conferences, endore Bursill-Hall's comments from our personal knowledge:-\nWhiteside did not take well to any sort of public spotlight, and was shy in his dealings with those outside his family and friends. He never adopted that social grace of suffering fools, and at academic meetings his tenacity could be difficult to deal with. However, his interest was only in the truth or what he thought was academically just, and he could engage in violent argument with colleagues and then quickly come to respect them. He held the most august and the most lowly colleagues to the same simple intellectual standards and judged - and treated - each only in terms of their intellectual integrity. He rarely made friends, but those he did embrace were brought within a magical circle of affection and loyalty. In private, and in correspondence, it is hard to imagine anyone who could have been more supportive, giving and kind. His letters were playful and humorous, gallant and often delightfully rambling conversations that were a treasure to receive. To those he thought honest seekers after the truth, he was unstinting in his support and generosity.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Number Theory",
    "Statistics"
  ]
}