{
  "nome_completo": "Tomás Rodríguez Bachiller",
  "nome_curto": "Tomás Rodríguez Bachiller",
  "ano_nascimento": "1899",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bachiller/",
  "lugar_nascimento": "Hong Kong (now China)",
  "lugar_morte": "Madrid, Spain",
  "biografia": "Tomás Rodríguez Bachiller\nwas born in Hong Kong. His father, Tomás Rodríguez y Rodríguez de Medio, had been born in Cobreros, Zamore, and had trained as a lawyer before having a career as a consul. At the time when his son was born, he was the Spanish Vice-Consul in what was, at that time, the British colony of Hong Kong. His second wife was Julia Bachiller Fernández Ruiz, from Montemayor de Pililla, in Valladolid, who became a full-time housewife looking after the family. There were five children in the family, the two oldest being the girls Julia and Pilar, both children of Tomás Rodríguez's first marriage, and three boys from the second marriage, Tomás\n(\nthe subject of this biography\n)\n, Ángel and Jesús. Ángel was born in Montemayor and Jesús was born in Puerto Rico, where Tomás Rodríguez was serving as consul at the time. Their mother, Julia, died as a result of childbirth when Jesús was born and was buried in Puerto Rico. Tomás\nBachiller and his two brothers began their first studies in Ayamonte, Huelva, Spain, and studied there until the family settled in Madrid. From that time the three brothers were put in charge of the older sisters while their father continued his consular career, making frequent and long stays abroad.\nAt the age of fourteen Bachiller went to Central University of Madrid to attend mathematics lectures by José Echegaray. At this time he was studying at the Cardinal Cisneros Institute in Madrid, a leading high school in Madrid. There he showed himself to be an exceptionally talented student, and he graduated on\n16\nJune\n1916\n. Following graduation, Bachiller enrolled as a student at the Central University of Madrid to study mathematics. His father, however, believed that his son would never be able to make a good career for himself as a mathematician so, in\n1918\n, he enrolled as a student in the Madrid School of Civil Engineering and began studying there in parallel to his studies in mathematics at the Central University. He attended courses on mathematical analysis given by Luis Octavio de Toledo\n(1857\n-\n1934)\n,\nJulio Rey Pastor\n(\nwho was in Argentina much of\n1917\n-\n18\n)\n, and José Ruiz Castizo\n(1857\n-\n1929)\n, who was also taught a course on rational mechanics. Bachiller studied geometry with Cecilio Jiménez Rueda\n(1858\n-\n1950)\n, Miguel Vegas\n(1856\n-\n1943)\n, Faustino Archilla\n(1870\n-\n1939)\nand José G Álvarez Ude\n(1876\n-\n1958)\n.\nIn January\n1921\n,\nTullio Levi-Civita\nmade a visit to Madrid and gave a course on \"Classical and relativistic mechanics\". Bachiller translated the lectures into Spanish and wrote them up for publication, but despite his efforts, the notes were never published. In\n1921\n-\n22\nBachiller studied \"Celestial Mechanics\" given by José María Plans\n(1878\n-\n1934)\n. In\n1923\nEinstein\nvisited Spain and before the visit the Mathematical Society held two sessions at\n8\nSanta Teresa Street to prepare for\nEinstein\n's lectures. On\n7\nMarch\n1923\nEinstein\nlectured to the Mathematical Society and, after a question by Bachiller, discussed the matter with him for half an hour. When\nEinstein\ngave a series of three public lectures on relativity on\n5\n,\n6\nand\n8\nMarch, Bachiller was told to attend them, take notes and prepare summaries. When Bachiller's abstracts of the lectures were published, Bachiller provided copies to\nEinstein\nwho told him that \"in no other country in the world had they done so well\".\nIn May\n1923\nBachiller applied to the Junta para la Ampliación de Estudios\n(\nnow the Consejo Superior de Investigaciones Científicas\n)\nfor a one-year scholarship in order to study the theory of functions and differential equations in Germany and Switzerland. He stated that he had knowledge of French, English, German and Italian. We learn from this application that at this stage Bachiller intended to write a doctoral thesis on the algebraic geometry of the style studied by\nFrancesco Severi\n's school in Italy. This scholarship was not awarded but the Faculty of Sciences in Madrid awarded Bachiller a scholarship to enable him to spend the academic year\n1923\n-\n24\nstudying in France. He arrived in Paris in November\n1923\nand attended courses at the Collège de France and at the Sorbonne. In particular he attended\nÉmile Borel\n's course on elasticity,\nJules Drach\n's course on contact transformations,\nÉmile Picard\n's course on algebraic curves and surfaces,\nÉlie Cartan\n's course on fluid mechanics,\nJacques Hadamard\n's course on differential equations, the course that Claude Guichard\n(1861\n-\n1924)\ndelivered on differential geometry and\nLaplace\ntransformations,\nHenri Lebesgue\n's course on topology and\nErnest Vessiot\n's courses on partial differential equations and on group theory. When Bachiller returned to Madrid in\n1924\nhe delivered the first topology course ever given in Spain.\nBack at the Faculty of Sciences in Madrid, Bachiller was appointed as an assistant on\n2\nOctober\n1925\nto give  practical classes on \"Elements of Infinitesimal Calculus\", and on\n13\nNovember of that year also on \"Spherical Astronomy and Geodesy\". He was very active in working for the Journal of the Spanish Mathematical Society. He reviewed work of mathematicians across the whole of Europe, in particular writings articles on the topology of\nMaurice Fréchet\n, the doctoral theses of\nLuigi Fantappié\non algebraic geometry and of\nLouis Antoine\non topology, and the monograph\nL'Analysis situs et la Géométrie algébrique\nⓉ\n(\nTopology and algebraic geometry\n)\nwritten by\nSolomon Lefschetz\nfor the\nBorel\nCollection. Another of his tasks was to keep up a correspondence with foreign mathematicians who published in the first issues of the Journal, such as\nHermann Weyl\n,\nTullio Levi-Civita\n,\nAlbert Einstein\nand\nEdmund Landau\n, as well as translating some of their articles into Spanish. Among the articles he wrote at this time we mention:\nEl professor F Klein\nⓉ\n(\nProfessor F Klein\n)\n(1925)\n;\nAnswering Problem\n24\n(\nas set out in\nRevista Mat., Hisp.-Amerika\n2\n(1920)\n,\n278)\n(\nSpanish\n)\n;\nLa correspondencia biunívoca de Cantor y el teorema de Netto\nⓉ\n(\nCantor's biunivocal correspondence and Netto's theorem\n)\n(1926)\n;\nConjuntos cerrados no densos\nⓉ\n(\nNon-dense closed assemblies\n)\n(1926)\n;\nConferencias del Prof Dr Terradas\nⓉ\n(\nConferences of Prof Dr Terradas\n)\n(1927)\n;  and\nSobre el numero de dimensiones de un conjunto\nⓉ\n(\nOn the number of dimensions of a set\n)\n(1927)\n.\nOn\n6\nMay\n1926\nBachiller married Pilar Pradilla with his friend Fernando Lorente de No as a witness. Pilar was\n21\nyears old and from Torreblanca, Castellón de la Plana. Tomás and Pilar Bachiller had three children: Tomás, Luis and Agustín.\nThere is a rather strange gap in Bachiller's activities between\n1928\nand\n1933\n. He had been a very active contributor to the\nSpanish Mathematical Society\nand to its journal as we described above. However this all stopped during these five years when he also seemed to vanish from the Mathematical Laboratory. It is likely that this was due to a disagreement with\nRey Pastor\n. As Glick writes in\n[\n2\n]\n:-\nHis relationship with\nRey Pastor\nwas ambivalent. They considered themselves good friends but constantly quarrelled. On one occasion, when\nRey Pastor\ncriticized Blas Cabrera, Bachiller defended the latter, saying that while the physicist had accepted a scholarship in Strasbourg, largely at his own expense,\nRey Pastor\nhad gone to Argentina \"for three pesetas.\"\nIt is likely that some criticism of Bachiller's writings by\nRey Pastor\nand the pointing out of two errors in an article on algebraic curves published by the\nSpanish Academy of Sciences\ncaused him to give up much of his activities. The\nSpanish Mathematical Society\nreported\n(\nsee\n[\n1\n]\n)\n:-\nRodríguez Bachiller presented a proof of\nPoincaré\n's last theorem.\nRey Pastor\nthen observed that the first part coincides exactly with the one set out by him in\n1919\nin the public session held in honour of\nJacques Hadamard\n, and as regards the modification introduced by Bachiller in the second part, it seems to him that it proves nothing, for it confuses the various concepts of curve of\nJordan\n,\nCantor\nand\nMenger\n. It was proposed to Rodríguez Bachiller that in the next session he present in writing the proof, corrected, so it can be examined again, and the author has promised to do this.\nHowever, Bachiller did not present a further version of his paper and neither he nor\nRey Pastor\nwere present at the following meetings of the Society. In fact in the\n1931\nlist of members of the\nSpanish Mathematical Society\nBachiller's name does not appear. Of course, Bachiller had never submitted a thesis for a doctorate so he may well have decided that he needed to concentrate on his research rather than do work for the\nSpanish Mathematical Society\n.\nIn October\n1932\nBachiller's became an acting professor when the chair of differential equations became vacant. In July\n1934\na competition for the Theory of Functions chair was announced. Two candidates applied, Bachiller and R San Juan, and a committee was set up to carry out the competition. The committee summoned the two candidates to appear before them on\n15\nJune\n1935\nbut only Bachiller was present. He was told that he would take the tests set out by the committee on\n25\nJune. After he completed the tests successfully, the committee unanimously appointed him professor on\n29\nJune\n1935\n. However, since he still did not have a doctorate, he was told that he had to submit a thesis and be successfully examined before taking up the chair. He submitted his thesis\nAxiomática de la dimensión\nⓉ\n(\nAxiomatics of dimension\n)\nand defended it on\n27\nAugust\n1935\n. He passed with the grade \"outstanding\" and took up the chair two days later. The thesis was never published. He had, however, published\nSobre el numero de dimensiones de un conjunto\nⓉ\n(\nOn the number of dimensions of a set\n)\nin\n1927\nwhich discussed the definitions of dimension given by\nBrouwer\n,\nMenger\nand\nUrysohn\n.\nThe Spanish Civil War took place from\n1936\nto\n1939\n. It was a very difficult time for everyone and Bachiller, who almost certainly sympathised with the Republicans, tried to stay out of the conflict. Glick writes\n[\n2\n]\n:-\nRodríguez Bachiller did not take an active part in politics, but ideologically he was a democrat at heart. He pointed out the fright he got when he was in Berlin in\n1936\n; he went to greet the rector of the University, the mathematician\nLudwig Bieberbach\n, and the latter replied with the Nazi salute.\nHe again became active in the Journal of the\nSpanish Mathematical Society\nbut much reorganisation took place as some colleagues left Madrid. At the end of the Civil War he was treated with suspicion by the Franco regime and \"disqualified from holding positions of leadership and confidence.\" He was, however, allowed to return to his chair in December\n1939\n. He applied for a grant to allow him to spend four months in Rome undertaking research but his application was refused. Nevertheless, he was able to go to Rome but he had to make the trip at his own expense. He published\nComentarios sobre algebra y topologia\nⓉ\n(\nComments on algebra and topology\n)\nin\n1941\n.\nAndré Weil\nwrites in a review:-\nA short survey of some fundamental concepts in topology, leading up to the following result: the\nn\nn\nn\nth homotopy group of a topological product is the direct product of the\nn\nn\nn\nth homotopy groups of the factors.\nIn\n1942\nhe published a paper in Italian, namely\nSulle superficie del quarto ordine contenenti una conica\nⓉ\n(\nOn the surface of the fourth order containing a cone\n)\n. This article investigates the existence of birational transformations based on\nSeveri\n's methods. However, after this he published no further research papers. He kept his interest in topology, and taught courses on it many times. As a result of Bachiller's visit to Rome,\nSeveri\nand\nFantappié\nwere invited to give lectures in Madrid and Barcelona in the year\n1942\n.\nBachiller had quite a wide range of different teaching duties in a number of different institutions. He ran, in collaboration with two others, a preparatory academy for civil engineers. During\n1943\n-\n44\nand\n1944\n-\n45\nhe gave a new course, this time on topological groups, at the Institute of Mathematics \"Jorge Juan\" in Madrid. In April\n1946\n, Bachiller delivered the inaugural lecture of the Mathematics Section of the Congress of the Spanish Association for the Advancement of Science held in San Sebastián. His lecture,\nEstado actual de la teoría de la dimensión en los espacios topológicos\nⓉ\n(\nPresent state of the theory of the dimension in the topological spaces\n)\n, was not published. In\n1946\nthe Cultural Relations Board of the Ministry of Foreign Affairs announced that they were offering scholarships for research and study abroad. Some were aimed at graduates, others at professors. Bachiller won one of the scholarships for professors and on\n4\nFebruary\n1947\nhe arrived in the United States to begin a five month visit. The first three months were spent at the University of Illinois at Urbana where he worked with\nOscar Zariski\nand then he went to Princeton where he worked with\nSolomon Lefschetz\n,\nEmil Artin\nand\nClaude Chevalley\n. Despite working on interesting research projects, he refused to publish his results. He also refused to publish the lecture notes of the courses that he gave.\nHe delivered topology courses at the Institute of Mathematics \"Jorge Juan\" up to\n1951\nwhen to changed to giving courses on logic and the foundations of mathematics, topics that had always interested him. In early\n1955\nhe went to the Institute for Advanced Study at Princeton, where he visited\nEinstein\na few days before his death. In the summer of\n1956\nhe attended a topology congress in Mexico. During this time Bachiller continued his work as a translator, and made visits to Puerto Rico whenever he could. His final major work as a translator was with the three volumes of\nSeveri\n's\nLecciones de análisis\nⓉ\n(\nAnalysis lessons\n)\n(1951\n,\n1956\n,\n1958)\n. Meanwhile, his first stay at the University of Puerto Rico in Mayagüez was in\n1954\n, and he returned several times over the next years to deliver courses on topology and abstract algebra. Puerto Rico, of course, was special to the Bachiller family since Jeaús Bachiller had been born there and his mother, who had died in childbirth, was buried there. In fact Bachiller spent so much time in Puerto Rico that he had to resign from many of his roles in Madrid. He even had problems in\n1965\nbecause he was in Puerto Rico when he should have been lecturing in Madrid. However, he managed to continue to keep both his positions in Puerto Rico and in Madrid until he retired in\n1969\n.\nIn Puerto Rico he enjoyed the same enthusiasm that he had experienced in Spain before the Civil War. He was a member of the Philosophy Society there and was described in these terms by a member\n(\nsee\n[\n1\n]\n)\n:-\nThere was Rodríguez Bachiller, a mathematician with a humanist bias, with an intellectual curiosity open to all horizons of culture. There were abundant examples of philosophical and literary works, classical and modern, many of them in their original language, in the very large library of his house in El Viso, and he could read works in French, English, Italian and German, and did so habitually. Another of his great hobbies was music. ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}