{
  "nome_completo": "Torsten Carleman",
  "nome_curto": "Torsten Carleman",
  "ano_nascimento": "1892",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carleman/",
  "lugar_nascimento": "Visseltofta, Sweden",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "Tage Gills Torsten Carleman\nwas born in the parish of Visseltofta, county of Kristianstad, in southern Sweden, where his father Karl Johan Carleman was a school teacher and precentor of the local church; his mother was Alma Linnéa Jungbeck. He finished his\ngymnasium\nstudies in Växjö and was awarded his baccalaureate following the final high school graduation examination on\n30\nMay\n1910\n. In the same year he became a student at Uppsala University. He was awarded his Master of Science degree on\n14\nDecember\n1912\n, Licentiate on\n29\nMay\n1915\n, and he defended his Ph.D. thesis\nOn the Neumann-Poincaré problem for a region with corners\non\n20\nJanuary\n1917\n(\nundertaken with the supervision of Erik Holmgren\n)\n, and became Doctor of Philosophy on\n31\nMay\n1917\n.\nOn\n8\nFebruary\n1917\nhe became a\ndocent\nof mathematics at Uppsala University.\nAs a Liljewalch scholar he visited the Technical University in Zürich during the period\n1\nJune\n1917\nto\n31\nMarch\n1918\n, and also Paris and Oxford in\n1921\n.\nCarleman was a remarkable person and there are many stories concerning him\n(\nsee Kjellberg\n[\n24\n]\n,\nGårding\n[\n14\n]\n)\n. We can quote here Kjellberg who has written in\n1995\non page\n93\nof\n[\n24\n]\n:-\nHe was a genius! My older friends in Uppsala used to tell me about the wonderful years they had had when Carleman was there. He was the most active speaker in the Uppsala Mathematical Society. He was also a well-trained gymnast. When people left the seminar and on the way to the restaurant \"Rullan\" they had to cross the Fyris River, Carleman did not just walk over the bridge, instead he walked on his hands on the railing.\nIn\n1923\nhe was appointed a full professor at Lund University. Shortly after this, on the initiative of Gösta\nMittag-Leffler\n(\nwho founded and gave his name to the famous mathematical research institute in Djursholm, Sweden\n)\n, he was called as professor to Stockholm University in\n1924\n, as a successor of Helge von\nKoch\n.\nAfter\nMittag-Leffler\n's death in\n1927\n, Carleman, who was considered to be the top Swedish mathematician of the time, was appointed as the first director of the\nMittag-Leffler\nInstitute. He lived in the\nMittag-Leffler\nvilla and maintained the famous library. Many foreign scientists were guests at the Institute and gave lectures there, and the journal\nActa Mathematica\ncontinued its publication of papers. However, Carleman was not able to realize plans for a Mathematics Institute, in part because of lack of funds and in part because his personality was more suited to mathematical contemplation than to the kind of entrepreneurship needed to get an Institute off the ground. For about twenty years after Carleman's death, the Institute was inactive and existed only as a growing library used by a handful of mathematicians in the Stockholm area and supervised by a member of the board, first\nFritz Carlson\nand then O Frostman\n(\nsee\n[\n20\n]\nand\n[\n21\n]\n, p.\n1053)\n.\nWe can quote here\nGårding\n[\n14\n]\n, p.\n206\n: -\nFrom the beginning of the\n1920\ns Carleman was considered the best mathematician in Sweden. International success came, but his spectral theory was overshadowed by the abstract theory and he had also bad luck with his mean ergodic theorem. It is certain that Carleman felt that he was the equal of the best mathematicians but also that he was not appreciated according to his merit. One reason was that many of his results, for instance the extension of Holmgren's uniqueness theorem, the analysis of the\nSchrödinger\noperator, and the existence theorem for\nBoltzmann\n's equation, were two decades ahead of their time and therefore not immediately appreciated.\nFrom\n1927\nCarleman became an editor of\nActa Mathematica\n. He was a member of the Royal Physiographic Society in Lund from\n1924\n, the\nRoyal Swedish Academy of Sciences\nfrom\n1926\n, the Swedish Society of Sciences from\n1927\n, the Finnish Society from\n1934\n, and the French Society from\n1946\n.\nCarleman, giving a memorial address after death of\nMittag-Leffler\nin\n1927\n, told anecdotes about him and the famous benefactor Alfred Nobel\n(\nsee\n[\n10\n]\n, p.\n81)\n. When the latter was planning his prizes, he is said to have asked some mathematician:-\nIf I would establish a prize for Mathematics, is it likely that\nMittag-Leffler\nwould one day have it? - Yes, it is. - Well, then I won't do it.\nCarleman had good relations with many mathematicians, visiting and giving lectures at, Zürich, Göttingen, Oxford, Sorbonne, Nancy and Paris. He was a frequent visitor to Paris.\nCarleman had several Ph.D. students: N Juringius\n(1932)\n, F Ehrnst\n(1938)\n, K Persson\n(1938)\n,\nÅ Pleijel\n(1940)\n, U Hellsten\n(1947)\n, and H Radström\n(1952)\n.\nHe was married from\n1929\nto\n1940\nto Anna-Lisa Lemming\n(\nher father Erik Lemming was gold medalist in javelin throwing at the Olympic Games in Athens\n1906\n, London\n1908\nand Stockholm\n1912)\n.\nCarlson\ndescribed Carleman in his obituary\n[\n16\n]\n(\nsee also\n[\n14\n]\n, p.\n206)\nas:-\n... retiring and taciturn, who looked at life and people with a bitter humour but he could also be kind and helpful to others, especially his students. Although not a natural athlete, he could perform amazing physical feats. Sometimes one got the impression of unbridled power both in his scientific and physical activity.\nAs it is often the case with mathematicians who deal with differential or\nintegral equations\n, Carleman carried a keen interest in the relationship between mathematics and applied sciences. In\n1944\n, at his demission of the presidency of the\nRoyal Swedish Academy of Sciences\n, he gave a lecture\nOn interaction between mathematics and exact experimental sciences\n(\npublished in the Year Book of that Academy for the year\n1944\n, pp.\n263\n-\n273)\n.\nDuring the last period of his life Carleman lived alone in two rooms of the\nMittag-Leffler\nInstitute. His main interests had been mathematics and applied mathematics. Towards the end of the\n1940\n's, when his health began to deteriorate he sometimes remarked to his students that\n(\nsee\n[\n14\n]\n, p.\n206)\n:-\n... professors ought to be shot at the age of fifty.\nNorbert Wiener\nin\n[\n7\n]\n, pp.\n317\n-\n318\nhas written:-\nCarleman's death was peculiarly tragic, as it so typically followed a Scandinavian pattern which is familiar to those who know the plays of Ibsen and Strindberg. He died of drink - not the social drinking which leads so often to ruin here - but the fiery, passionate dipsomania which is a common disease even in the very best circles of the Scandinavian countries. During meetings he was often a bit drunk, and afterwards in Paris I saw him come to Mandelbrojt's apartment for an advance on the travel money due him, red-eyed, with a three-day beard.\nDuring his last years Carleman suffered from bad health. Serious neuralgic pains in his legs often caused him insomnia. Towards Christmas\n1948\na jaundice occurred, which quickly ended his life. Carleman died on\n11\nJanuary\n1949\nin Stockholm.\nCarleman published five books and sixty papers in mathematics. Before his professorship in Lund he published about thirty papers, the majority treating of the problems in the theory of integral equations, and the theory of real and complex functions, where he gave extraordinary evidence of originality, penetration and capacity to use various methods of analysis. Several of his new ideas and methods are now classical.\nThere are especially two areas of research, going back to this time, which one can consider as principal works of Carleman. One of them is his fundamental contribution on singular integral equations and applications. His first book\nSingular integral equations with real and symmetric kernel\npublished in\n1923\nbecame fundamental. He was invited to give lectures on this subject at the Institute H\nPoincaré\nin Paris in the spring of\n1930\nand also at the International Congress of Mathematicians in Zürich in\n1932\n.\nThe other was on quasi-analytic functions. Carleman was invited to lecture on this subject at the College of France in April-May\n1923\n. His lectures were published later\n(\nin\n1926)\nas his second book\nQuasi-analytic functions\nin Gauthier-Villars.\nCarleman is now remembered for remarkable results in integral equations\n(1923)\n, quasi-analytic functions\n(1926)\n, harmonic analysis\n(1944)\n, trigonometric series\n(1918\n-\n23)\n, approximation of functions\n(1922\n-\n27)\nand\nBoltzmann\n's equation\n(1944)\n. Names such as Carleman inequality, Carleman theorems\n(\nDenjoy\n-Carleman theorem on quasi-analytic classes of functions, Carleman theorem on conditions of well-definedness of moment problems, Carleman theorem on uniform approximation by\nentire functions\n, Carleman theorem on approximation of analytic functions by polynomials in the mean\n)\n, Carleman singularity of orthogonal system, integral equation of Carleman type, Carleman operator, Carleman kernel, Carleman method of reducing an integral equation to a boundary value problem in the theory of analytic functions, Jensen-Carleman formula in complex analysis, Carleman continuum, Carleman linearization or Carleman embedding technique, Carleman polynomials, Carleman estimate in the unique continuation problem for solutions of partial differential equations and Carleman system in the kinetic theory of gas are well-known in mathematics\n(\nsee\n[\n11\n]\n,\n[\n14\n]\nand\n[9\n, Th. XII.\n17]\n,\n[\n12\n]\n,\n[\n13\n]\n)\n.\nThe\nCarleman inequality\nwas proved at the Scandinavian Congress of Mathematicians in Helsinki in\n1922\n(\npublished in\n1923)\nwhere Carleman was talking on quasi-analytic functions:\nIf\n(\na\nn\n)\n,\nn\n≥\n1\n(a_{n}), n ≥ 1\n(\na\nn\n​\n)\n,\nn\n≥\n1\n, is a sequence of positive numbers, then\n∑\nn\n=\n1\n∞\n(\na\n1\na\n2\n.\n.\n.\na\nn\n)\n1\n/\nn\n≤\ne\n∑\nn\n=\n1\n∞\na\nn\n\\sum ^{∞}_{n=1} (a_{1} a_{2} ... a_{n})^{1/n}≤ e \\sum ^{∞}_{n=1} a_{n}\n∑\nn\n=\n1\n∞\n​\n(\na\n1\n​\na\n2\n​\n.\n.\n.\na\nn\n​\n)\n1\n/\nn\n≤\ne\n∑\nn\n=\n1\n∞\n​\na\nn\n​\nand the constant\ne\ne\ne\nis the best possible, in the sense that counterexamples can be constructed for any stricter inequality which uses a smaller constant.\nThere are many generalizations and applications of this inequality\n(\ncf.\n[\n6\n]\nand\n[\n22\n]\n)\n.\nIn complex analysis there are\nCarleman formulae\n(\nproved already in\n1926)\nwhich, unlike the\nCauchy\nformula, reconstruct a function\nholomorphic\nin a domain\nD\nD\nD\nfrom its values on a part\nM\nM\nM\nof the boundary\n∂\nD\n\\partial D\n∂\nD\nof a positive\nLebesgue\nmeasure. Even in the case of one complex variable the Carleman formula depends on the domain\nD\nD\nD\nand on the set\nM\nM\nM\n.\nDifferent generalizations as well as some applications of these formulae to various problems of mathematics\n(\nproblems of analytic continuation in the theory of functions\n)\n, in theoretical and mathematical physics, in extrapolation and interpolation of signals having a finite\nFourier\nspectrum, and results obtained by computer simulation on the elimination of noise in a given frequency band, are presented in the book\n[\n13\n]\n, which looks like an encyclopaedia on the theory and applications of the Carleman-type ideas and methods.\nCarleman wrote also a\nTextbook in differential and integral calculus together with geometrical and mechanical applications\n, Stockholm\n1928\n(2\nnd\ned.\n1945)\n.\nIn\n1932\nCarleman, following an idea of\nPoincaré\n, showed that a finite dimensional system of nonlinear differential equations\nd\nu\nd\nt\n=\nV\n(\nu\n)\n\\Large\\frac{d\\bf{u}}{dt}\\normalsize  = \\bf{V}(\\bf{u})\nd\nt\nd\nu\n​\n=\nV\n(\nu\n)\n, where\nV\nk\nV_{k}\nV\nk\n​\nare polynomials in\nu\n\\bf{u}\nu\n, can be embedded in an infinite system of linear differential equations. This is called\nCarleman linearization\nor\nCarleman embedding\n. This method has became a new effective tool in the study of nonlinear dynamical systems\n(\nsee\n[\n12\n]\n)\n.\nCarleman is also one of the authors of a mean ergodic theorem\n(\nsee\n[\n17\n]\n, where more is written about priority questions\n)\n.\nResults on unique continuation for solutions to partial differential equations are important in many areas of applied mathematics, in particular in control theory and inverse problems. The unique continuation results as Holmgren and\nHörmander\ntheorems are based on a certain type of weighted energy estimate which was introduced by Carleman. In\n1935\nCarleman himself lectured at the\nMittag-Leffler\nInstitute on a generalization of the\nFourier\ntransformation. His notes, however, were not published until nine years later as his fourth book\nFourier integral and questions connected with it\nin\n1944\n(\nreprinted in\n1967)\n. In June\n1947\nCarleman participated in a CNRS meeting in Nancy and presented his theory there. The connection of his and\nSchwartz\n's definition are nicely presented in\n[\n23\n]\n.\nCarleman lectured at the Sorbonne in\n1937\non\nBoltzmann\n's equation, which appears in the kinetic theory of gas, and published several papers on this subject. Also his last book\nMathematical problems of the kinetic theory of gas\nwhich deals with the mathematical aspects of the\nBoltzmann\ntransport equation was published, after his death, in\n1957\nwith some additional material submitted by L Carleson and O Frostman. This book was also translated into Russian in\n1960\n.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}