{
  "nome_completo": "Tosio Kato",
  "nome_curto": "Tosio Kato",
  "ano_nascimento": "1917",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kato/",
  "lugar_nascimento": "Kanuma City, Tochigi-ken, Japan",
  "lugar_morte": "Oakland, California, USA",
  "biografia": "Tosio Kato\nstudied physics at the University of Tokyo and graduated with a B.S. in\n1941\n. However, World War II completely disrupted his studies at this point. He wrote in\n[\n4\n]\n:-\nDuring World War II, I was working in the countryside of Japan.\nThis innocent little comment in fact hides a period of great difficulty and suffering for Kato. Barry Simon writes in\n[\n3\n]\n:-\n... it is clear that his experiences while evacuated to the countryside and in the chaos immediately after the war were horrific. He barely escaped death several times and he caught tuberculosis.\nOnce circumstances allowed, he returned to the University of Tokyo to undertake doctoral studies. He was awarded his doctorate in physics in\n1951\nfor a thesis entitled\nOn the convergence of the perturbation method\n. However he had published many papers by the time the doctorate was awarded including work on pair creation by gamma rays, the motion of an object through a fluid and results on the spectral theory of operators arising in quantum mechanics.\nOn the convergence of the perturbation method. I\nand\nOn the upper and lower bounds of eigenvalues\nappeared in\n1949\n,\nVariational methods in collision problems\nand\nOn the convergence of the perturbation method. II\nin\n1950\n, and\nNote on Schwinger's variational method, On the existence of solutions of the helium wave equation, Upper and lower bounds of scattering phases\nand\nFundamental properties of Hamiltonian operators of Schrödinger type\nin\n1951\n.\nAll of these papers appeared in physics journals except the last which appeared in the\nTransactions of the American Mathematical Society\n. In fact this last paper contains one of Kato's most important results, namely the self-adjointness of Hamiltonians of\nSchrödinger\ntype. He originally submitted the paper to the\nPhysical review\nbut that journal\n[\n3\n]\n:-\n... could not figure out how and who should referee it, and that journal eventually transferred it to the Transactions of the American Mathematical Society. Along the way the paper was lost several times, but it finally reached\nvon Neumann\n, who recommended its acceptance. The refereeing process took over three years.\nAfter Kato was awarded his doctorate he was appointed as assistant professor of physics at the University of Tokyo in\n1951\n. In\n[\n3\n]\nS T Kuroda describes a course on mathematical physics which Kato taught during session\n1953\n-\n54\n, and which Kuroda attended:-\nThe course covered, thoroughly but efficiently, most of the standard material from the theory of functions through partial differential equations. The style of his lecture never gave an impression that he went quickly, but at the end of each class I was surprised by how much he had covered within one session. The course could live vividly today ...\nIn\n1954\n-\n55\nKato visited the United States for the first time, spending time at the University of California at Berkeley, and at New York University. The Department of Mathematics of the University of California, Berkeley, published Kato's notes\nQuadratic forms in Hilbert spaces and asymptotic perturbation series\nin\n1955\n. Also, resulting from his visit to New York University, Kato's notes\nOn the eigenfunctions of many-particle systems in quantum mechanics\nwere published by the Mathematical Sciences research Institute of New York University in\n1956\n. These notes extend results which were published in Kato's famous\n1951\nTransactions of the American Mathematical Society\npaper mentioned above. Although still based in Japan, Kato made many visits to the United States during the following years, visiting the National Bureau of Standards in\n1955\n-\n56\n, and the University of California at Berkeley and the California Institute of technology in\n1957\n-\n58\n.\nIn\n1957\nKato published\nA treatise on function spaces\nin Japanese which:-\n... emphasizes clear and simple explanations of the fundamental notions of functional analysis.\nHe was appointed Professor of Physics at the University of Tokyo in\n1958\nand led a small research group in the physics department, while his colleague Kosaku Yosida was building a group within mathematics studying related topics.\nFrantišek Wolf\nat Berkeley had become interested in perturbation theory through Kato's work and played a major role in an effort which brought Kato to Berkeley in\n1962\nto become Professor of Mathematics. In fact Kato had major difficulties in obtaining a visa for the United States because of the tuberculosis he had suffered. It was the mathematician Charles Dolph who contacted the physicist Otto Laporte who was the American attaché in Tokyo and he arranged for a waiver to be applied.\nIn\n1966\nKato published his classic text\nPerturbation theory for linear operators\nwhich was\n[\n3\n]\n:-\n... used as a bible by a generation of mathematical physicists and operator theorists.\nL de Branges\ndescribes the masterpiece as follows:-\nThis is a treatise on linear transformations in Hilbert space as seen from the point of view of perturbation theory, as opposed to commutator theory or invariant subspaces. Transformations in Banach spaces are also considered when they can be treated as generalizations of self-adjoint transformations. The tone of the book is set in the first two chapters, which are concerned with transformations in finite-dimensional spaces and can be read with no prior knowledge of operator theory.\nA Russian translation appeared in\n1972\nand a second English edition in\n1976\n. In\n1982\nKato published\nA short introduction to perturbation theory for linear operators\nwhich, in his own words from the Introduction:-\n... is a slightly expanded reproduction of the first two chapters\n(\nplus Introduction\n)\nof my book Perturbation theory for linear operators. Ever since, or even before, the publication of the latter, there have been suggestions about separating the first two chapters into a single volume.\nLet us mention a few more from Kato's great wealth of results. In\n1962\nhe introduced new powerful techniques for studying the partial differential equations of incompressible fluid mechanics, the\nNavier\n-\nStokes\nequations. He published\nOn the Navier-Stokes initial value problem\nin\n1962\nin which he gave a careful and readable account of the initial-value problem for the\nNavier\n-\nStokes\nsystem. In\n1983\nhe discovered the \"Kato smoothing\" effect while studying the initial-value problem associated with the\nKorteweg\n-\nde Vries\nequation, which was originally introduced to model the propagation of shallow water waves. Another contribution to this area was\nOn the Korteweg-de Vries equation\nwhere, in Kato's words from the paper:-\nExistence, uniqueness, and continuous dependence on the initial data are proved for the local\n(\nin time\n)\nsolution of the\n(\ngeneralized\n)\nKorteweg\n-\nde Vries\nequation on the real line ...\nKato retired from his chair at Berkeley in\n1988\nbut remained extremely active in research. Heinz Cordes writes\n[\n3\n]\n:-\nIn\n1996\nKato's wife Mizue became ill. After a while they moved into a retirement home in Oakland, and things stabilized to a point that he could start to work again.\nGustavo Ponce writes\n[\n3\n]\n:-\nI last saw Kato in the spring of\n1999\n. He was emptying his house at Berkeley and asked me to help him get rid of some publications and books. It was a hard and sad time for him. However, Kato was willing to talk mathematics. His enthusiasm for it was intact. he was full of ideas and questions.\nHe died suddenly of heart failure.\nKato was an intensely private person who was deeply interested in nature and as a result he especially loved the Botanical Gardens at Berkeley, and he spent many happy hours there. Arne Jensen writes\n[\n3\n]\n:-\nWe often took walks in Tilden Park or Strawberry Canyon. It was during these walks that I learnt of his interest in botany. He could identify a large number of plants and trees and knew the Latin names as well He had a great respect for the classification system introduced in the eighteenth century by the Swedish botanist Carl von Linné.\nHe received many honours for his contributions, perhaps the most prestigious of which was the\nNorbert Wiener\nPrize in Applied Mathematics in\n1980\n, from the\nAmerican Mathematical Society\nand the\nSociety for Industrial and Applied Mathematics\n. The paper\n[\n4\n]\ncontains his acceptance speech for this prize. He was invited to give the\nFermi\nLectures at the Scuola Normale Superiore in Pisa in May\n1985\n. He lectured on\nAbstract differential equations and nonlinear mixed problems\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}