{
  "nome_completo": "Tullio Levi-Civita",
  "nome_curto": "Tullio Levi-Civita",
  "ano_nascimento": "1873",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levi-Civita/",
  "lugar_nascimento": "Padua, Veneto, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Tullio Levi-Civita\n's father was Giacomo Levi-Civita who was a lawyer. In fact Giacomo was later, in\n1908\n, appointed as an Italian senator. Tullio, born into a Jewish family, attended secondary school in Padua where he showed his outstanding abilities. He then studied for his degree in the Faculty of Mathematics of the University of Padua where he enrolled in\n1890\n. Two of his teachers were\nGiuseppe Veronese\nand\nRicci-Curbastro\nand Levi-Civita later collaborated with the latter. He wrote a dissertation, which was supervised by\nRicci-Curbastro\n, on absolute invariants but this also marks the beginning of his use of the\ntensor calculus\n[\n30\n]\n:-\nBy putting together\nRicci-Curbastro\n's algorithm with some results from\nLie\n's theory of transformation groups, Levi-Civita extended the theory of absolute invariants to more general cases than those considered by\nRicci-Curbastro\n.\nHe graduated in\n1892\nand his dissertation was published in the following year after he had made some minor changes to it. He was awarded his teaching diploma in\n1894\nand in the following year he was appointed to the teacher's college which was attached to the Faculty of Science at Pavia.\nLevi-Civita was appointed to the Chair of Rational Mechanics at Padua in\n1898\n, a post which he was to hold for\n20\nyears. However several times during these twenty years attempts had been made to have him move to Rome. In particular in\n1909\nCastelnuovo\ntried hard to persuade him to move, but Levi-Civita was happy to remain in Padua. Levi-Civita was a pacifist with firm socialist ideas and it may well have been that he felt Padua suited his personality better than Rome at the time. Of course he was an outstanding mathematician with an impressive international reputation so it was natural for the University of Rome to try to attract him. While teaching at Padua, Libera Trevisani was one of his pupils and they married in\n1914\n.\nAfter World War I ended, the University of Rome made strenuous efforts to strengthen both its teaching and research and many leading scientists were attracted there. Levi-Civita was always very international in his outlook and the ability of Rome to attract top quality students from abroad must have figured in his reasons to now want to make the move there. In\n1918\nhe was appointed to the Chair of Higher Analysis at Rome, and two years later he was appointed to the Chair of Mechanics there.\nThe years following World War I were difficult for scientists who wanted to collaborate with those in all countries on an equal footing. The President of the United States, Woodrow Wilson, drew up Fourteen Points on\n8\nJanuary\n1917\non which to end World War I. These had not been agreed by the allies. On\n4\nOctober\n1918\nthe German government approached Wilson, looking to start peace negotiations and Wilson presented them with the Fourteen Points. After nearly three weeks of negotiations, without the other allies being involved, Germany accepted the Fourteen Points on\n23\nOctober. The British and French were certainly unhappy with some of the Fourteen Points and a difficult period followed. In the middle of all of this, Wilson proposed another idea to Britain and France, namely that a structure should be put in place to re-establish international cooperation in science. His proposal was for an International Research Council which would be organised round International Unions for each of the various scientific subjects. These International Unions would operate through National Committees in the countries of the eleven Allied Powers, with these National Committees each supported by its National Academy of Science and National Research Council. The International Unions would have the power to invite neutral countries to join, but not those countries against whom the Allied Powers had fought. Wilson's proposal was accepted and in\n1919\nthe International Research Council was founded. Germany, Austria, Hungary and Bulgaria could not be members under the terms of the International Research Council. Levi-Civita was opposed to such ideas as he made clear in a letter he wrote to\nSommerfeld\nin\n1920\n:-\nI have always been, and not only in science, a convinced internationalist ... we agree on an essential point - and I am pleased about it - that scientific relationships and personal relationships between scientists coming from different countries should not be perturbed by contingencies or memories of national or state disagreements.\nWhen\nVon Kármán\napproached Levi-Civita in\n1922\nsuggesting a scientific meeting on fluid dynamics he knew that such a meeting could not be an official congress if German and Italian scientists were both involved so he proposed an informal one. Levi-Civita was enthusiastic but when the meeting took place in Innsbruck in September of that year the only scientists from the Allied Powers to participate were Levi-Civita and members of his research group. This, however, marked the start of the International Congresses of Applied Mechanics with the decision taken at the Innsbruck meeting to include all areas of applied mechanics and the first  full congress took place in Delft in\n1924\n. Levi-Civita's role is described in detail by Battimelli in\n[\n10\n]\n. He writes:-\nTullio Levi-Civita was one of the leading figures in the creation, in the years following World War I, of the International Congresses of Applied Mechanics, and remained an active member of the Congress committee to the end of his life. ... Levi-Civita\n[\nmade a major\n]\ncontribution to the life of the Congresses, from the early days of the\n1922\nInnsbruck conference to the late thirties\n[\nwith\n]\nhis role in the international network created by the newborn institution ...\nIt was not just the international situation which gave Levi-Civita problems but also the effect of totalitarianism and anti-Semitism on scientific and university life. He found the national situation in Italy with the rise of Fascism increasingly difficult. In\n1931\nall Italian professors were required to sign an oath to Fascism.\nVolterra\nrefused to take the oath and was dismissed. Although he was deeply opposed to such ideas, Levi-Civita felt that for the sake of his family and his research school in Rome he had to sign despite his strong moral objections. He lectured in the United States in\n1933\nand in Moscow and Kiev in\n1935\n. In\n1936\nhe returned to the United States, lecturing at Harvard, Princeton and the Rice Institute. While in Houston he gave an interview which was seen as critical of Italy and the Italian consul asked for clarification. He was recalled to Italy but because of his leading international status the Italian government felt that it should not react too strongly. Later in\n1936\nthe International Mathematical Congress was held in Oslo but Levi-Civita, and all other Italian mathematicians, were forbidden to attend by their government. Despite this Levi-Civita was appointed as a member of the Commission for awarding\nFields Medals\n.\nOn\n5\nSeptember\n1938\nthe Racial Laws were passed which excluded all those of Jewish background from universities, schools, academies and other institutions. Levi-Civita was dismissed from his professorship, forced to leave the editorial board of\nZentralblatt für Mathematik\n, and prevented from attending the Fifth International Congress of Applied Mechanics in the United States. He wrote to a former student in May\n1939\n(\nsee for example\n[\n30\n]\n)\n:-\nI live as a retired person and I do not move; except in summer, however, if my personal conditions allow me to move. As you maybe know, Jews have been completely expelled from Italian cultural life; in particular, I will not participate in the \"Volta Congress\" and will not be in Rome in September.\nThe authors of\n[\n30\n]\nwrite:-\nIn the last years of his life, in spite of his moral and physical depression, Levi-Civita remained faithful to the ideal of scientific internationalism and helped colleagues and students who were victims of anti-Semitism; thanks to him, many of them found positions in South America or in the USA.\nLevi-Civita had very great command of pure mathematics, with particularly strong geometric intuition which he applied to a variety of problems of applied mathematics. One of his papers in\n1895\nimproved on\nRiemann\n's contour integral formula for the number of\nprimes\nin a given interval. He is best known, however, for his work on the absolute differential calculus and with its applications to the theory of relativity. In\n1886\nhe published a famous paper in which he developed the calculus of tensors, following on the work of\nChristoffel\n, including covariant differentiation. In\n1900\nhe published, jointly with\nRicci-Curbastro\n, the theory of tensors in\nMéthodes de calcul differential absolu et leures applications\nⓉ\n(\nAbsolute differential calculation methods and applications leuers\n)\nin a form which was used by\nEinstein\n15\nyears later. The paper was requested by\nKlein\nwhen he met Levi-Civita in Padua in\n1899\nand, following\nKlein\n's wishes, it appeared in\nMathematische Annalen\n.\nWeyl\nwas to take up Levi-Civita's ideas and make them into a unified theory of gravitation and electromagnetism. Levi-Civita's work was of extreme importance in the theory of relativity, and he produced a series of papers elegantly treating the problem of a static gravitational field. This topic was discussed in a correspondence between Levi-Civita and\nEinstein\n. The paper\n[\n15\n]\nlooks at:-\n... the main mathematical and physical questions discussed by Einstein and Levi-Civita in their\n1915\n-\n1917\ncorrespondence: the variational formulation of the gravitational field equations and their covariance properties, and the definition of the gravitational energy and the existence of gravitational waves.\nAnalytic dynamics was another topic studied by Levi-Civita, many of his papers examining special cases of the\nthree-body problem\n. He began publishing papers on the subject in\n1903\n, with another important paper appearing in\n1906\nwhich strengthened his earlier results. In\n1920\nhe published a compendium on the three-body problem in\nActa Mathematica\n. Then near the end of his career he became interested in the\nn\nn\nn\n-body problem. In\n1950\n(\nnine years after his death\n)\na book by Levi-Civita entitled\nLe problème des n corps en relativité générale\nⓉ\n(\nThe n body problem in general relativity\n)\nwas published. H P Robertson writes in a review:-\nThis excellent monograph on the\nn\nn\nn\n-body problem in the general theory of relativity was prepared about ten years ago, but its appearance now is none the less timely for those who have worried themselves with one or another aspect of the problem. Its major achievements are two: a derivation of the equations of motion of\nn\nn\nn\npoint masses, free from the subtle errors besetting most of the standard treatments; and a careful discussion of the possible contributions, in the Einsteinian approximation, of the finite size and internal constitution of the bodies involved.\nHe also wrote on the theory of systems of ordinary and\npartial differential equations\n. In\n[\n18\n]\nthe authors argue that Levi-Civita was interested in the theory of stability and qualitative analysis of ordinary differential equations for three reasons: his interest in geometry and geometric models; his interest in classical mechanics and celestial mechanics, in particular, the three-body problem; and his interest in stability of movement in the domain of analytic mechanics. He added to the theory of\nCauchy\nand\nKovalevskaya\nand wrote up this work in an excellent book written in\n1931\n.\nLevi-Civita's interest in hydrodynamics began early in his career with his paper\nNote on the resistance of fluids\nappearing in\n1901\n. He worked later on waves in a canal and his proof of the existence of irrotational waves was a major contribution to a long standing open question. In\n[\n33\n]\nLevi-Civita's work with his student L S Da Rios on three-dimensional vortex filament dynamics is discussed in detail. Ricca writes:-\nTheir results include the conception of the localized induction approximation for the induced velocity of thin vortex filaments, the derivation of the intrinsic equations of motion, the asymptotic potential theory applied to vortex tubes, the derivation of stationary solutions in the shape of helical vortices and loop-generated vortex configurations, and the stability analysis of circular vortex filaments. In the light of modern developments in nonlinear fluid mechanics, their work strikes for modernity and depth of results. ... Levi-Civita's work on asymptotic potential for slender tubes is at the core of the mathematical formulation of potential theory and capacity theory.\nIn\n1933\nLevi-Civita contributed to\nDirac\n's equations of\nquantum theory\n.\nThe\nRoyal Society\nconferred the\nSylvester\nmedal on Levi-Civita in\n1922\n, while in\n1930\nhe was elected a foreign member. He was also an honorary member of the\nLondon Mathematical Society\n, the\nRoyal Society of Edinburgh\n, and the\nEdinburgh Mathematical Society\n. He attended the\n1930\nColloquium of the\nEdinburgh Mathematical Society\nin St Andrews.\nAfter he was dismissed from his post the blow soon told on his health and he developed severe heart problems. He died of a stroke. Nastasi and Tazzioli write\n[\n30\n]\n:-\nHe was one of the most eminent professors in Italy for\n40\nyears and attracted students coming from all countries, whom he encouraged with patience and nobility. Kindness and modesty were manifestations of his soul. Many people benefited from his kindness and retained an ineffaceable memory of his extraordinary personality.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}