{
  "nome_completo": "Tycho Brahe",
  "nome_curto": "Tycho Brahe",
  "ano_nascimento": "1546",
  "ano_morte": "1601",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brahe/",
  "lugar_nascimento": "Knutstorp, Skane, Denmark (now Svalöv, Sweden",
  "lugar_morte": "Prague, Bohemia (now Czech Republic)",
  "biografia": "Tycho Brahe\nwas given the name Tyge by his parents Beate Bille and Otte Brahe. He is now known as \"Tycho\" since that is the Latinised version of his name that he adopted when he was about fifteen years old. For simplicity we shall use the name Tycho throughout this biography. Otte Brahe, Tycho's father, was from the Danish nobility and was an important man among the Danish King's closest group of supporters. Beate Bille, Tycho's mother, also came from an important family which had produced leading churchmen and politicians. Tycho was one of twin sons, but his twin died shortly after birth. His parents had one older daughter but Tycho was their eldest son.\nA picture of his birthplace is at\nTHIS LINK\n.\nA strange episode occurred when Tycho was two years old. His uncle, Jorgen Brahe\n(\nin Tycho's own words, see for example\n[\n5\n]\n)\n:-\n... without the knowledge of my parents took me away with him while I was in my earliest youth.\nIt was a strange episode since it did not appear to cause any family disputes nor did his parents try to take him back. Jorgen Brahe and his wife Inger Oxe had no children of their own, and they acted as foster parents to Tycho until Jorgen's death. Jorgen Brahe, like his brother Otte Brahe, was a leading Danish noble while Inger Oxe was the sister of Peder Oxe who was a member of the Rigsraads, the governing council consisting of\n20\nadvisors to the King. In fact Tycho benefited most on the educational side from his foster mother Inger Oxe who had scholarly interests as did other members of her family, while the Brahes and the Billes had little time for scholarly pursuits.\nJorgen Brahe commanded Tostrup Castle, and it was in that castle that Tycho lived from the time he was taken by Jorgen until he was six years old. We should not give the impression that he did not travel during this time, for his parents had many administrative duties which took them away and it is likely that Tycho sometimes went with one of them. In\n1552\nJorgen was given the command of Vordingborg Castle, which was a promotion to a more important role. About a year after Tycho moved to Vordingborg with his foster parents he began to attend school, almost certainly attending that attached to the local cathedral. Although Tycho's father Otte considered learning Latin a waste of time, his foster parents were much keener that he should receive this type of education. Tycho attended this school until he was twelve years old, then began his university studies.\nOn\n19\nApril\n1559\nTycho began his studies at the University of Copenhagen. There, following the wishes of his uncle, he studied law but also studied a variety of other subjects and became interested in astronomy. It was, however, the eclipse which occurred on\n21\nAugust\n1560\n, particularly the fact that it had been predicted, that so impressed him that he began to make his own studies of astronomy helped by some of the professors. He purchased an ephemeris and books such as\nSacrobosco\n's\nTractatus de Sphaera\nⓉ\n(\nTreatise on spheres\n)\n,\nApianus\n's\nCosmographia seu descriptio totius orbis\nⓉ\n(\nCosmography or the description of the entire world\n)\nand\nRegiomontanus\n's\nDe triangulis omnimodis\nⓉ\n(\nAll kinds of triangles\n)\n.\nHis foster parents decided that he should gain experience abroad and in February\n1562\nhe set off with a travelling companion to go to the University of Leipzig. Astronomy was not officially part of his studies, these were classical languages and culture, but he had bought his astronomy books with him together with\nDürer\n's constellation maps. He began making observations and by August\n1563\n, while still at the University of Leipzig, he began to keep a record of these observations. The second observation he recorded was a conjunction of Jupiter and Saturn which proved significant for Tycho's subsequent career. Neither tables based on\nCopernicus\nnor on\nPtolemy\ngave the correct date for the conjunction,\nPtolemy\n's being out by nearly a month and even\nCopernicus\n's being out by days. Tycho, with the confidence of someone not yet seventeen, thought he could do better - and he later proved himself to be right!\nTycho now studied astronomy with Bartholomew Schultz at Leipzig who taught him some tricks to obtain more accurate observations. He knew that accurate observations required good instruments and he began to acquire them. Tycho returned home in May\n1565\nand in the following month his uncle Jorgen gave his life in rescuing the King. His father, who now commanded Helsingborg Castle, and mother assumed responsibility for the young man who was still under eighteen. In\n1566\nhe was off on his travels again, visiting first the university in Wittenberg and then that in Rostock. While in Rostock he was involved in an argument with another Danish student and in the resulting duel Tycho had part of his nose cut off. A consequence of this was that Tycho developed an interest in medicine and alchemy.\nAfter his return home in April\n1567\nhe had an artificial nose made from silver and gold. He was, however, disfigured for life and his portraits show the disfigurement which was almost certainly worse than what the artists portrayed. Tycho's father was keen that he should quickly take up a political career but somehow Tycho persuaded his father to let him make another trip abroad. He first revisited Rostock, then went to Basel, Freiburg, and Augsburg. Tycho had been working on improved instruments for observing for a while, but when in Augsburg he designed some of his own and managed to obtain a patron to underwrite the cost of a major new instrument. In about a month he had a huge quadrant constructed and erected in the estate of his patron outside the city. It was very accurate but was so massive that it required many servants to align it so only one observation could be made each night.\nPeter Ramus\nwas also on a visit to Germany and while in Augsburg he learnt of Tycho's great quadrant leading to meetings at which the two engaged in deep astronomical discussions. Tycho began constructing another instrument, this time a large celestial globe made from wood.\nReceiving word that his father was ill, Tycho returned home during the last few days of\n1570\n. His father died in May\n1571\nand soon after, with the help of his uncle Steen Bille, Tycho began constructing an observatory in Herrevad Abbey. They also built an alchemy laboratory there since alchemy was becoming a major interest for Tycho. In\n1572\nhe met Kirsten Jorgensdatter, a girl from his home town of Knudstrup, but since she was a commoner and he was a noble, they could not marry legally. Kirsten lived with him, however, as his common law wife. The year\n1572\nwas significant for Tycho in another way as described by Field\n[\n15\n]\n:-\nOn\n11\nNovember\n1572\n, he emerged into the dark of the early evening, after a long stint of alchemical experimentation, and his first glance at the sky showed him an extra star in the constellation of Cassiopeia, almost directly overhead. He instantly summoned his chemical assistant to confirm that the star really was there. He was not the first to see the new star\n(\na supernova\n)\nbut his observations of it\n(\npublished in\n1574)\ndid much to prove beyond reasonable doubt that the star really belonged to the firmament and was not merely a local phenomenon in the sublunary world\n(\nas comets were generally believed to be\n)\n. The star is now usually known as 'Tycho's supernova'. It turned Tycho's interest back to astronomy.\nBeginning in September\n1574\nTycho lectured on astronomy at the University of Copenhagen but gave up in the following spring when he received an annual income from his father's estate. He set off on another trip abroad, first visiting Kassel. The Landgraf Wilhelm IV of Hessen-Kassel had founded an observatory at Kassel about\n15\nyears earlier and Tycho was very impressed by the methods used there. The design of his own observatory would be influenced by that at Kassel and Tycho corresponded frequently with the Landgraf; see\n[\n21\n]\nfor more details of their relationship and correspondence.\nLeaving Kassel, Tycho visited Frankfurt, Basel and finally Venice before returning to Denmark by the end of\n1575\n. By this time he had made a decision to leave Denmark and to settle in Basel, but King Frederick of Denmark was not going to lose his most eminent scientist easily so he made offers to Tycho to entice him to set up an observatory in Denmark. After some offers which Tycho did not find attractive, the King offered Tycho the island of Hven\n(\ncalled today Ven\n)\n[\n15\n]\n:-\nWith financial help from the King of Denmark, he went on to set up a purpose-built observatory, on the island of Hven in Copenhagen Sound. The observatory, called Uraniborg, was equipped with exceptionally large and accurate instruments\n(\nand with an alchemical laboratory in its basement\n)\n. At Uraniborg Tycho made twenty years' worth of astronomical observations.\nTycho's drawing of the main building at Uraniborg, taken from his\nAstronomiae instauratae mechanica\nⓉ\n(\nRevision of astronomy and mechanics\n)\n(1598)\nis at\nTHIS LINK\n.\nHis plan of the gardens, from the same work, with the main building in the centre and servants' quarters, a printing studio, and other buildings just inside the outer walls is at\nTHIS LINK\n.\nWe should note that Tycho's design was influenced by buildings he had seen in Venice, and was also constructed in a highly geometrical form.\nOne of the most exciting astronomical events which Tycho observed from Uraniborg was a comet which he first spotted on\n13\nNovember\n1577\n. He published his account in\nDe mundi aetherei recentioribus phaenomenis\nⓉ\n(\nThe world's recent ethereal  phenomena\n)\n(1588)\nwhere he draws cosmological conclusions from the fact that his measurements show that the comet is not closer to Earth than the Moon, contradicting\nAristotle\n's model of the cosmos. From his observations Tycho was able to show that the comet was certainly further away than Venus.\nIn\n1584\n, with the observatory of Uraniborg now too small to house all his instruments, Tycho built a second one named Stjerneborg adjacent to Uraniborg.\nYou can see a plan of this observatory at\nTHIS LINK\n.\nThis was the time when Tycho was most active in producing major new instruments. Thoren writes\n[\n32\n]\n:-\nBecause of the number and variety of instruments made and described by Tycho, previous commentators have assumed that he made instruments for the sheer sake of keeping his instrument-makers busy. In fact, however, their construction can be traced in his logs and rationalized as several series of experiments which only produced his major instruments in the mid-\n1580\n's. The ten-year process had considerable consequences for progress of Tycho's theoretical work during his life. It has also obscured historical understanding of the accuracy of his instruments.\nMaeyama notes in\n[\n22\n]\n:-\nTycho's marvellous agreement between the description and practice of observations.\nWesley, in\n[\n38\n]\nand\n[\n39\n]\n, makes a careful study of the accuracy of Tycho's observations. Swerdlow, reviewing\n38]\nwrites:-\nThe results of the study are interesting, and speak well for the accuracy of Tycho's instruments. Those tested are the mural quadrant, revolving wooden quadrant, revolving steel quadrant, astronomical sextant, and equatorial armillary, the last measuring declinations directly. Aside from occasional periods when one or another instrument was distinctly out of adjustment - as, by the way, only a study of this kind can show - the observations have errors falling mostly between about\n0\n.\n5\n' and\n1\n.\n0\n', that is, about the accuracy of the standard used for comparison. Thus, as was also the case in the earlier study of fixed stars,\nKepler\n's belief that Tycho's observations could be trusted to better than two minutes is amply confirmed.\nAmong his many discoveries Tycho found that the\nobliquity of the ecliptic\nhad decreased since the time of\nPtolemy\nbut, as explained in\n[\n24\n]\n, he obtained an incorrect value due to errors by\nPtolemy\n.\nTycho is perhaps best known today for his theory of the solar system which is based on a stationary Earth round which the Moon and Sun revolve. The other planets, according to Tycho's theory, revolve round the Sun. In fact in his younger days Tycho had been convinced by\nCopernicus\n's Sun centred model but his firm belief that theory must be supported by experimental evidence led him away. The problem was, of course, that in the Sun centred model of\nCopernicus\na parallax shift should be observed but despite his attempts to measure such a shift, Tycho could detect none. There were two possibilities to explain this: either the Earth was fixed, or the scale of the universe was unbelievably large. We know today that it is the second of these which is true, and that the scale is such that Tycho would have had no hope in measuring parallax with his instruments. The first measurement of the parallax of a star was in\n1838\nby\nBessel\nwho found\n0\n.\n3\n\" for the parallax of\n61\nCygni. Despite the quality of Tycho's measurements, this value in about\n100\ntimes smaller that Tycho's observational errors. In fact Tycho was not the first to propose the Earth centred model with the planets rotating round the Sun for\nErasmus Reinhold\nhad done so a few years earlier. However Rosen in\n[\n26\n]\nargues convincingly that Tycho did not know of\nReinhold\n's theory.\nKing Frederick died in April\n1588\nand, his son Christian\n(\nwho became King Christian IV\n)\nstill being a child, a regent was appointed. Support for Tycho continued however, and he presented a scheme to the Rigsraads to allow his children to inherit Uraniborg. Six of his eight children had lived. He had two sons; Tycho, born in\n1581\n, and Georg in\n1583\n. He also had four daughters; Kirsten born in\n1573\n, Magdalene in\n1574\n, Elizabeth in\n1579\n, and Cecilie in\n1582\n. Because Kirsten was Tycho's common law wife, their children could not inherit. Tycho, however, presented a patent which gave Uraniborg something like university status, and the director something like the status of the head of a university. It also stated that succession to the headship would give preference to \"Tycho Brahe's own\". Perhaps surprisingly, since the state was attempting to stop the acceptance of common law wives, Tycho's patent was accepted, a sure sign of the high esteem in which he was held\n(\nand perhaps also due to many family and friends being on the Rigsraads\n)\n.\nIn his younger days Tycho had been a fair man in his dealings with others. Although he had treated the inhabitants of Hven badly by modern standards, and also in their eyes, it was usual for a lord at this time to treat his subjects harshly. However in the\n1590\ns Tycho's nature seemed to change and his treatment both of the inhabitants of Hven and of his student helpers at Uraniborg became unreasonable. He always thought a lot of himself and perhaps by this stage his view of his own importance\n(\nhe saw himself as the natural successor to\nHipparchus\nand\nPtolemy\n, a far more important person than a King\n)\nhad rather turned his head. Negotiations over the marriage of his daughter Magdalene to Gellius, who had been an assistant at Uraniborg for five years, fell apart and caused Tycho extreme grief and family upset. He fell out with the young King Christian by not repairing the Chapel of the Magi at Roskilde, where Christian's father Frederick was buried, despite it being on an estate which provided Tycho with a substantial income. Christian made it clear that the promise Tycho had been given that Uraniborg would continue under the direction of his children no longer held.\nTycho closed down his observatory on Hven in\n1597\n(\nthe last recorded observation is on\n15\nMarch that year\n)\n, and moved to Copenhagen. However, things did not go well for him there and he left Denmark with his family and his instruments to seek support and find somewhere to continue his work\n[\n15\n]\n:-\nIn\n1599\nhe was appointed Imperial Mathematician to the Holy Roman Emperor, Rudolph II, in Prague\n(\nthen the capital of the Holy Roman Empire\n)\n. Johannes\nKepler\njoined him as an assistant, to help with mathematical calculations. Tycho intended that this work should prove the truth of his cosmological model, in which the Earth\n(\nwith the Moon in orbit around it\n)\nwas at rest in the centre of the Universe and the Sun went round the Earth\n(\nall other planets being in orbit about the Sun and thus carried round with it\n)\n.\nTycho began observing again in Prague. He received support from Rudolph for\nKepler\nand himself to compile a new set of astronomical tables based on Tycho's recorded observations over\n38\nyears. These would be called the\nRudolphine Tables\nas a tribute to their sponsor. However, Tycho died eleven days after dining at the palace of Peter Vok Ursinus Rozmberk as a result of adhering to the etiquette of the day and refusing to leave the dinner table before his host.\nKepler\ndescribes his death\n(\nsee for example\n[\n5\n]\n)\n:-\nHolding his urine longer than was his habit, Brahe remained seated. Although he drank a little overgenerously and experienced pressure on his bladder, he felt less concerned for his state of health than for etiquette. By the time he returned home he could not urinate any more. Finally, with the most excruciating pain, he barely passed some urine, but yet it was blocked. Uninterrupted insomnia followed; intestinal fever; and little by little delirium. ... During his last night, through the delirium in which everything was very pleasant, like a composer creating a song, Brahe these words over and over again: \"Let me not seem to have lived in vain.\"\nField writes\n[\n15\n]\n:-\nWhen Tycho died,\nKepler\nsucceeded him as Imperial Mathematician. Tycho's observations of planetary positions, which were made using instruments with open sights\n(\na telescope was not used for astronomy until about\n1609)\n, were much more accurate than any made by his predecessors. They allowed\nKepler\n, who\n(\nunlike Tycho\n)\nwas a convinced follower of\nCopernicus\n, to deduce his three laws of planetary motion\n(1609\n,\n1619)\nand to construct astronomical tables, the Rudolphine Tables\n(\nUlm,\n1627)\n, whose enduring accuracy did much to persuade astronomers of the correctness of the Copernican theory. However, until at least the mid-seventeenth century, Tycho's model of the planetary system was that favoured by most astronomers. It had the advantage of avoiding the problems introduced by ascribing motion to the Earth.",
  "math_areas": [
    "Algebra"
  ]
}