{
  "nome_completo": "Udita Narayana Singh",
  "nome_curto": "Udita Narayana Singh",
  "ano_nascimento": "1920",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Singh/",
  "lugar_nascimento": "Benares (now Varanasi) India",
  "lugar_morte": "Delhi, India",
  "biografia": "Udita Narayana Singh\nattended schools in Benares. After graduating he studied at Queens College, Benares. In\n1937\nhe married Kamala Devi: they had four children, two sons and two daughters. He graduated from Queens College, Benares in\n1939\nwith the Gold Medal and entered the University of Allahabad. He was awarded his D.Phil. in\n1949\nfor his thesis\nStrong Summability of Trigonometric Series\n. His thesis was examined by\nEdward Titchmarsh\n.\nAfter the award of his D.Phil., Singh went to France were he studied at the Sorbonne advised by\nSzolem Mandelbrojt\n. In\n1954\nhe was awarded a D.Sc. for his thesis\nTransformée de Fourier Généralisée et les Problèmes qui s'y Rattachent\nⓉ\n(\nThe generalized Fourier Transform and the problems associated with it\n)\n. Returning to India he taught at Allahabad for a while before moving to the Aligarh Muslim University as a Reader in Mathematics. He continued to imporove his status and was appointed to the Maharaja Sayaji Rao University of Baroda as the first Professor and Head of the Mathematics Department in\n1958\n.\nSingh spent one academic year\n(1963\n-\n64)\nat the University of Illinois at Urbana-Champaign. In\n1969\n, U N Singh was invited to join the University of Delhi as Professor of Pure Mathematics and he was pleased to accept. In\n1970\nbe became Head of the Department of Mathematics as well as the Dean of the Faculty of Mathematics. In\n1974\nhe was appointed the Pro-Vice Chancellor of the University of Delhi but in\n1980\nhe accepted the offer of Vice Chancellorship of the University of Allahabad.\nWe have given a simple overview of Udita Narayana Singh's career, but a detailed account is given in\n[\n1\n]\n. We have a version of Singh's biography, extracted from\n[\n1\n]\n, available at\nTHIS LINK\n.",
  "math_areas": []
}