{
  "nome_completo": "Urbain Jean Joseph Le Verrier",
  "nome_curto": "Urbain Le Verrier",
  "ano_nascimento": "1811",
  "ano_morte": "1877",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Verrier/",
  "lugar_nascimento": "Saint-Lô, France",
  "lugar_morte": "Paris, France",
  "biografia": "Urbain Le Verrier\n's father, Louis-Baptiste Le Verrier, was an estates manager and government official who had been born in\n1779\nin Carentan while his mother, Marie-Jeanne-Josephine de Baudre, had been born in\n1783\nin Baudre, just a few kilometres south of Saint-Lô. We note that Carentan is only about\n23\nkm north east of Saint-Lô. Louis-Baptiste married Jeanne-Josephine in Notre Dame, Saint-Lô, on\n29\nOctober\n1807\n. Urbain had an elder sister Léontine Anne Joséphine\n(\nborn\n1808\n, baptised on\n29\nSeptember\n1808\nin Saint-Lô\n)\nand the family, of limited means, lived in a modest home in the Place du Champ de Mars, Saint-Lô. Urbain attended the College in Saint-Lô for eight years, completing his studies there at the age of sixteen in\n1827\n. He had showed himself to be a very talented pupil and, after the College in Saint-Lô, he studied mathematics at the College Royal de Caen for three years, from\n1827\nto\n1830\n.\nDespite being an outstanding pupil at the College in Caen, coming top of his class, he failed the competitive entrance examination to the École Polytechnique in\n1830\n. Le Verrier's father was very keen that his son should have every opportunity to further his education so he sold his home in Saint-Lô to get the necessary funds to send Le Verrier to the Mayer Institute in Paris. There he studied for a year under the mathematician\nChoquet\n, the director of the Mayer Institute, and in\n1831\nhe was placed second in the nation-wide Concours général and admitted to the École Polytechnique. He studied for two years before graduating, ranked eighth in his year. His main interest had been in chemistry and he spent the first two years after graduating,\n1833\n-\n35\n, studying industrial chemistry at Orsay in Paris. His main interest at this time was in the tobacco industry and he undertook research on the combination of phosphorus with oxygen and with hydrogen, important topics for the tobacco industry since matches were made from phosphorus. He had been taught by the chemist Louis Joseph Gay-Lussac\n(1778\n-\n1850)\nwhile he was an undergraduate and Gay-Lussac directed the experiments that Le Verrier was undertaking. His research soon came to the notice of other leading scientists such as the physicist and chemist Pierre Louis Dulong\n(1785\n-\n1838)\nand the chemist Antoine Jérôme Balard\n(1802\n-\n1876)\n. He published two papers on his chemistry research in the\nAnnales de Chimie et de Physique\n, namely\nSur les combinaisons du phosphore avec l'hydrogène\nⓉ\n(\nOn the combinations of phosphorus with hydrogen\n)\n(1835)\nand\nSur les combinaisons du phosphore avec l'oxygène\nⓉ\n(\nOn the combinations of phosphorus with oxygen\n)\n(1837)\n.\nLe Verrier was offered a position as a teacher of chemistry in the provinces in\n1836\nbut chose to remain in Paris undertaking research with Gay-Lussac. Of course he required a source of income and he was appointed as a teacher at the Collège Stanislas in Paris. He augmented this income by giving private tuition in mathematics. In\n1837\n, he married Lucile Marie Clothilde Choquet, the daughter of his former teacher at the Mayer Institute. They had three children: Léon\n(\nborn\n1838)\n, Urbain-Louis-Paul\n(\nborn\n1849)\nand Marie Geneviève Josephine Lucile\n(\nborn\n1853)\n. Le Verrier's wife Lucile was a fine amateur musician, receiving lessons from the composer and pianist César-Auguste Franck\n(1822\n-\n1890)\n. After he married, Le Verrier employed his sister Léontine as a housekeeper.\nIn\n1836\ntwo positions as répétiteur had become vacant at the École Polytechnique. One position, as répétiteur to Gay-Lussac, was a chemistry appointment and Le Verrier applied for this position. Victor Regnault\n(1810\n-\n1878)\nalso applied for this position and he was a strong candidate for, in\n1835\n, he had begun a series of important researches on the haloid and other derivatives of unsaturated hydrocarbons. Regnault was appointed as répétiteur to Gay-Lussac at the École Polytechnique. Le Verrier then decided to apply for the second position of répétiteur to\nFelix Savary\n, which was an astronomy appointment. Although it might seem strange for someone who was undertaking research in chemistry to apply for an astronomy position, Le Verrier's mathematical expertise meant that he was qualified. He was offered the position which he accepted. He wrote to his father\n(\nsee, for example\n[\n5\n]\n)\n:-\nIn daring to accept the duties which had successively been fulfilled by\nFrançois Arago\n,\nClaude-Louis Mathieu\n, and\nFelix Savary\n, I have imposed on myself the obligation not to let the post which they have occupied be depressed in the public esteem, and for this I must not only accept but seek out opportunities to extend my knowledge. ... I have already ascended many ranks, why should I not continue to rise further?\nLe Verrier was appointed to teach astronomy as\nFelix Savary\n's répétiteur at the École Polytechnique in\n1837\n. In addition to Le Verrier,\nEugène Catalan\nand\nCharles Delaunay\nwere appointed as répétiteurs to\nSavary\nin\n1838\n. Also in\n1837\nLe Verrier was appointed as an admissions examiner for the École Polytechnique. When\nSavary\nbecame seriously ill in\n1840\n, Le Verrier took over all\nSavary\n's teaching.\nSavary\ndied in July\n1841\nand Le Verrier might have expected to be appointed to succeed him. However,\nMichel Chasles\nwas appointed as\nSavary\n's successor and Le Verrier remained as a répétiteur to\nChasles\n(\nas did\nCatalan\nand\nDelaunay\n)\n. Le Verrier's first contribution to astronomy was the paper\nSur les variations séculaires des orbites des planètes\nⓉ\n(\nOn the secular variations of the orbits of the planets\n)\nwhich he presented to the\nAcademy of Sciences\nin September\n1839\n. This paper considered the problem of the stability of the solar system. Le Verrier then worked on a study of periodic comets and was able to show that certain comets, previously thought to be distinct objects, were in fact the same object perturbed into a very different orbit by the gravitational attraction of Jupiter. His work gained him considerable recognition and, on\n19\nJanuary\n1846\n, he was elected to the\nAcademy of Sciences\n.\nDespite now being a major figure, Le Verrier was clearly still in some financial difficulty as can be seen from a letter he wrote shortly after his election to the Academy\n[\n15\n]\n:-\nParis, April\n18\n,\n1846\n.\nMonsieur le Ministre,\nMy Father, Receveur des droits de succession at Paris, left on his death a widow, my mother, who has no income except from a pension of six hundred francs; and a daughter, Mademoiselle Léontine Le Verrier, absolutely without any money. I venture to solicit for her\n[\nthe mother\n]\na Bureau for the distribution of stamped paper at Paris. I have entire faith that my request will not fail so far as concerns the former chief under whom my Father worked, if only I have the good fortune of obtaining a favourable word from you. My justifications in preferring this request to you, Monsieur le Ministre, are that I am connected with the giving of instruction in a school which has the honour of counting you among its former pupils, and that I have carried on certain astronomical investigations which savants have been pleased to recognize favourably, besides which I have recently been elected a member of the\nAcademy of Sciences\n.\nReceive, Monsieur le Ministre, the homage of my respectful regards.\nU J Le Verrier, Member of the Institute.\nHe worked at the Paris Observatory for most of his life where his drive for efficiency was to made him very unpopular. A contemporary said of him:-\nI do not know whether M Le Verrier is actually the most detestable man in France, but I am quite certain that he is the most detested.\nHis main work was in celestial mechanics and his most famous achievement was his calculation of the position of an unknown planet, later named Neptune, from irregularities in Uranus's orbit.\nFrançois Arago\nhad asked him to work on the irregularities in Uranus's orbit in\n1845\nand Le Verrier had published his first memoir on the subject in December\n1845\n. A second memoir in June\n1846\nproved that the irregularities could not result from the known planets and he postulated that the irregularities resulted from a further planet outside the orbit of Uranus. In August\n1846\nhe published his predicted position for the hypothetical planet. His perturbation analysis showed remarkable computational skills for he had taken his approximations to the seventh order, involving\n469\ndistinct terms. On\n18\nSeptember\n1846\n, Le Verrier wrote to Johann Galle at the Berlin Observatory asking him to look for the planet at the position he predicted. Galle knew of predictions of a planet earlier but said that it was:-\n... so novel a thing to undertake observations in reliance upon merely theoretical deductions; and that, while much labour was certain, success appeared very doubtful.\nHowever, on receiving Le Verrier's letter, five days after it was sent, Galle saw the confidence that Le Verrier had in his work and so searched for the new planet on the same evening he received the letter. He found it that night within one degree of the predicted position, observed it again on the following night to confirm absolutely that it was a planet and he wrote back to Le Verrier:-\nThe Planet whose position you indicated\nreally exists\n. The same day I received your letter I found a star of the eighth magnitude that was not recorded on the excellent Carta Hora XXI\n(\ndrawn by Dr Bremiker\n)\n. ...  The observation of the following day confirmed that it was the planet sought.\nAs one of Le Verrier's colleagues said:-\n... he discovered a star with the tip of his pen, without any instruments other than the strength of his calculations alone.\nArago\n, who had first suggested that Le Verrier work on this problem, said:-\nIn the eyes of all impartial men, this discovery will remain one of the most magnificent triumphs of theoretical astronomy, one of the glories of the\nAcadémie\nand one of the most beautiful distinctions of our country.\nJohn Couch Adams\nhas been recognised as having made similar calculations of a perturbing planet independently of Le Verrier. This is not the place to discuss the validity of the claims for\nAdams\n, but we should note that recent research has suggested that his results were considerably less accurate than those of Le Verrier. Le Verrier received many honours and widespread recognition for his achievement. The\nLondon Times\ncarried the headline on the\n1\nOctober\n1846\n:-\nLe Verrier's planet found.\nHe was awarded the Copley Medal of the\nRoyal Society of London\nand, in France, became an officer in the Legion of Honour. In\n1847\na chair of celestial mechanics was specially created for Le Verrier at the Sorbonne. He embarked on an ambitions research programme, namely to produce a single work for the whole of the planetary system. In this work, he wished to\n(\nin his own words\n)\n[\n12\n]\n:-\n... put everything in harmony if possible and, if it is not, declare with certainty that there exist still unknown causes of perturbations, the sources of which would then and only then be recognisable.\nLe Verrier had now achieved an important status and he used his influence to radically change the mathematics teaching at the École Polytechnique. Ivor Grattan-Guinness writes\n[\n13\n]\n:-\nIn\n1850\n[\nLe Verrier\n]\nchaired a commission to decide the future role of the school. Its members included General\nJean-Victor Poncelet\n(1788\n-\n1867)\nwho had just retired after two rather ineffective years as Commandant\n(\nthe first academic to hold this post since the reforms of\n1804)\n, and\nJean-Marie Duhamel\nas Directeur des Études. In six months of\n1850\nLe Verrier wrote a large and remarkable report on the school, including many aspects of its history drawn from the archives. He also published a substantial supplement with the Assemblée Nationale. He must have had very influential supporters for in a move that I believe to be unique in its history the national newspaper 'Moniteur universel' published a\n34\n-page supplement to its issue of\n15\nJanuary\n1851\n, reproducing about\n250\npages of the report. Irritated by the long and recent dominance of the policies of\nLaplace\nand\nCauchy\n, Le Verrier argued in effect for a return to\nMonge\n's aspirations. The \"flagship\" course on analysis and mechanics was discontinued; the part on analysis was somewhat simplified, and the part on mechanics focused on applications and allied to the course on machine theory. When the recommendations were approved, some reactions at the school were stark:\nLiouville\nand\nChasles\nresigned immediately in protest at this rejection of the emphasis on teaching purish mathematics that they had inherited and continued from predecessors such as\nCauchy\n.\nIt is not only for his theoretical contributions to astronomy that Le Verrier deserves praise. In addition, he was one of the founders of modern meteorology\n[\n1\n]\n:-\nIn\n1854\nthe minister of war requested him to study the cyclone that struck the fleets besieging Sevastopol. His systematic inquiry in Europe and Asia enabled him to determine the path of the cyclone. Occupied during this period with the reorganization of the meteorological observation service of the Paris observatory, Le Verrier conceived \"the project of a vast meteorological network designed to warn sailors of approaching storms.\" The greatest difficulty lay in securing the cooperation of the various telegraphic services. By\n1857\nthe project was sufficiently advanced for distribution of a daily bulletin giving the atmospheric conditions at fourteen French and five foreign stations.\nAlso in\n1854\nLe Verrier became director of the Paris Observatory which, under Arago's leadership, had not performed to standards that Le Verrier expected. The fact that he had to turn to the Berlin Observatory for the discovery of Neptune he considered a national disgrace. On taking over as director, he immediately insisted on military discipline but the new regime he instigated was strongly opposed by the staff, almost all of whom resigned. Eventually, his unpopularity led to him being removed from the post in\n1870\n.\nCharles Delaunay\nwas appointed as his successor but\nDelaunay\ndied in a tragic accident in August\n1872\n. Following this, in\n1873\nLe Verrier again was given the post but his authority was severely restricted as he was supervised by a council.\nLe Verrier's major piece of work looking at the whole planetary system began with a look at the inner planets and immediately he discovered a discrepancy in the motion in the perihelion of Mercury in\n1855\n. In fact the perihelion of Mercury advances\n5600\nseconds of arc per century. Now\n5026\nseconds of this is accounted for by\nprecession of the equinoxes\nof the Earth and\n531\nseconds of arc is a result of perturbations by the other planets. This leaves\n43\nseconds of arc per century unaccounted for. In fact Le Verrier, because the masses of the planets was not known very accurately in his day, found an advance of the perihelion of Mercury of\n38\nseconds of arc per century unaccounted for. Now the advance of the perihelion of Mercury by more than Newtonian theory predicted was to become important evidence for\nEinstein\n's general theory of relativity, but of course none of this could be known to Le Verrier who, in a paper presented to the\nAcademy of Sciences\non\n12\nSeptember\n1859\n, attributed it to an undiscovered planet, which he called Vulcan, closer to the Sun than Mercury or to a second asteroid belt so close to the Sun as to be invisible. He spent much effort searching for asteroids inside the orbit of Mercury in an attempt to prove his theory. Only three months after presenting his paper he received a letter from Edmond Lescarbault who lived in Orgères near Rennes saying he had observed the transit of Vulcan nine months earlier. Le Verrier rushed to Orgères to meet with Monsieur Lescarbault. Here is a contemporary account of their meeting\n[\n12\n]\nOne should have seen M Lescarbault, so small, so simple, so modest, and so timid, in order to understand the emotion with which he was seized, when Le Verrier, from his great height, and with that blunt intonation which he can command, thus addressed him: \"It is then you, Sir, who pretend to have observed the intra-Mercurial planet, and who have committed the grave offence of keeping your observation secret for nine months. I warn you I have come here with the intention of doing justice to your pretensions, and of demonstrating either that you have been dishonest or deceived. Tell me, then, unequivocally, what you have seen.\"\nLe Verrier eventually convinced himself that Lescarbault had seen a transit of Vulcan. Other astronomers were not convinced as no other astronomer had observed the transit. Over the following years many tried to find Vulcan, either by looking for transits or during a total eclipse when a planet close to the sun would become visible. For example, Le Verrier himself led an expedition to Spain in July\n1860\nto observe a total eclipse. Many false reports encouraged Le Verrier, but none proved correct. It was long after Le Verrier's death, in\n1915\n, that\nEinstein\n's general theory of relativity explained the orbit of Mercury without the need for perturbing bodies.\nVulcan was, in many ways, an unfortunate side-show in Le Verrier's important work on the orbits of all the planetary bodies. He constructed tables for the planets and theories for their orbits. He published\nThéorie du mouvement apparent du Soleil\nⓉ\n(\nTheory of the apparent movement of the Sun\n)\n(1858)\n, and\nTables du Soleil\nⓉ\n(\nTables of the Sun\n)\n(1858)\n;\nThéorie de Mercure\nⓉ\n(\nMercury Theory\n)\n(1859)\n, and\nTables de Mercure\nⓉ\n(\nMercury Tables\n)\n(1859)\n;\nThéorie de Vénus\nⓉ\n(\nVenus Theory\n)\n(1861)\n, and\nTables de Vénus\nⓉ\n(\nVenus tables\n)\n(1861)\n;\nThéorie de Mars\nⓉ\n(\nMars Theory\n)\n(1861)\n, and\nTables de Mars\nⓉ\n(\nMars Tables\n)\n(1861)\n;\nThéorie de Jupiter\nⓉ\n(\nJupiter Theory\n)\n(1876)\n, and\nTables de Jupiter\nⓉ\n(\nJupiter tables\n)\n(1876)\n;\nThéorie de Saturne\nⓉ\n(\nSaturn Theory\n)\n(1876)\n, and\nTables de Saturne\nⓉ\n(\nSaturn tables\n)\n(1876)\n;\nThéorie d'Uranus\nⓉ\n(\nUranus Theory\n)\n(1876)\n;\nThéorie de Neptune\nⓉ\n(\nNeptune Theory\n)\n(1876)\n; and\nTables d'Uranus\nⓉ\n(\nUranus Tables\n)\n(1877)\n. He received the Gold Medal of the\nRoyal Astronomical Society\nin\n1868\nfor his work on the theories and tables of Mercury, Venus, Earth and Mars, and he received a second Gold Medal from the\nRoyal Astronomical Society\nin\n1876\nfor his work on the remaining planets. Charles Pritchard\n(1808\n-\n1893)\npresented him with the Gold Medal in\n1868\nand\nJohn Couch Adams\npresented Le Verrier with the second Gold Medal in\n1876\nbut by this time he was too ill to receive it in person.\nLe Verrier began to suffer from a liver disease in\n1873\n. It became progressively worse and he died in Paris, being buried in the Montparnasse Cemetery in a grave which has a large stone celestial globe over it.\nHe has received many honours, in addition to those mentioned above. He was elected to almost every Academy in Europe. An asteroid, a ring of Neptune, and a lunar crater have been named after Le Verrier. Streets in Besançon, Brive-la-Gaillarde, Caen, Joué-lès-Tours, Lille, Nantes, Paris, Saint-Lô, Toulouse, and Tourcoing have been named after him. There has been an Air France plane and a French weather ship named 'Le Verrier'. French stamps and notes have borne his image.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}