{
  "nome_completo": "Václav Jeřábek",
  "nome_curto": "Václav Jeřábek",
  "ano_nascimento": "1845",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jerabek/",
  "lugar_nascimento": "Kolodeje, Pardubice, Czech Republic",
  "lugar_morte": "Telc, Czech Republic",
  "biografia": "Václav Jeřábek\nobtained high school education at a lower Realschule in Pardubice, and then at a higher Realschule in Pisek. From\n1866\nto\n1870\nhe studied at the Vienna Polytechnic. Having obtained the necessary qualifications in Vienna, he became a high school teacher. He began his teaching career at a higher general Realschule in Litomysl in\n1870\n, where he attained full professorship in\n1872\n. In\n1873\nhe moved to a higher Realschule in Telc.\nThe historic town of Telec dates back to\n1100\n. The website of the town states:-\nThe second half of the\n19\nth\ncentury brings a reinforcement of national political maturity. An important role was played by the schools founded in Telc in\n1852\n. Thanks to the teachers and professors as well as to all the others who were operating there ... there rose a few associations ... and Telc played an important role within the whole region of Southwest Moravia.\nIn\n1881\nJeřábek was appointed professor at a newly founded Czech Realschule in Brno. In\n1901\nhe became the director of the school, and he continued in that position until\n1907\nwhen he retired. In his later years he suffered from a cataract, which progressively made him almost completely blind despite surgery.\nJeřábek was a member of the Royal Bohemian Society of Sciences, the Moravian Society of Natural Sciences, and a honorary member of the\nUnion of Czech Mathematicians\n.\nHis main research interest was in constructive geometry. He is best remembered by mathematicians for the Jeřábek hyperbola. Given a triangle, the isogonal-conjugate images of lines are conics passing through the vertices of the  triangle. The Jeřábek hyperbola is the isogonal-conjugate image of the\nEuler\nline. It is a rectangular hyperbola, passing through the orthocenter and the circumcenter and many other interesting points of the triangle. The centre of the Jeřábek hyperbola lies on the nine-point circle.\nSee\nTHIS LINK\n.\nJeřábek wrote over\n50\npapers, published mostly in\nCasopis pro pestovani matematiky a fysiky\n, some of them in the Belgian journal\nMathesis\n. He donated his extensive library to the University of Brno.",
  "math_areas": []
}