{
  "nome_completo": "Víctor Manuel Neumann-Lara",
  "nome_curto": "Víctor Neumann-Lara",
  "ano_nascimento": "1933",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neumann-Lara/",
  "lugar_nascimento": "Huejutla de Reyes, Hidalgo, Mexico",
  "lugar_morte": "Puebla, Mexico",
  "biografia": "Víctor Neumann-Lara\nwas the son of Max Hermann Neumann\n(1903\n-\n1965)\nand Carolina Lara Andrade\n(\nborn\n1907)\n. Let us explain that, under the standard way of naming in Mexico, his full name would be Víctor Neumann Lara and he would be known as Víctor Neumann. He, however, chose to combine the names of his father and mother in a non-standard way and call himself Víctor Neumann-Lara.\nMax Neumann, the son of Hermann Neumann and Martha Hufnagel, was born in Stettin, Germany, on\n20\nDecember\n1903\n. Stettin is now in Poland and is known by the name Szczecin. In\n1921\n, when he was seventeen years old, he made a trip to Mexico, arriving at the port of Veracruz. His intention was to travel north to the city of Tampico and to make a return voyage to Germany from there. On his journey north he reached Huejutla de Reyes where, perhaps because of the beauty of the countryside but certainly because of the good economic prospects, he decided to stay. He was an engineer and he took over the operation of the first electric power generator in the region. He married Carolina Lara Andrade in Huejutla de Reyes on\n20\nMay\n1927\n. Carolina Lara, the daughter of Francisco Laca Herver and Carolina Andrade De Lara, had been born in Huejutla, Mexico in\n1907\n. She had a grandmother who was a Huastec, that is one of the indigenous people of the La Huasteca region of Mexico. Max and Carolina had four children: Francisco Hermann Neumann Lara\n(\nborn\n1928)\n, Carolina Marta Neumann Lara\n(\nborn\n1929)\n, Raúl Neumann Lara\n(\nborn about\n1931)\nand Víctor Manuel Neumann Lara\n(\nborn\n1933)\n, the subject of this biography.\nHuejutla de Reyes had a primary school, but no secondary school. Víctor's mother was keen for her children to have a good education so, in\n1942\n, she made the difficult decision to take her four children to Mexico City. It was a very difficult journey. They rode on horseback for twelve hours going from Huejutla de Reyes to Tamazunchale. This looks like a step in the wrong direction but they made this journey to reach Highway\n85\nwhich joined Nuevo Laredo on the United States-Mexico border, with Mexico City. Having reached Tamazunchale they then made another twelve hour journey, this time by truck, along Highway\n85\nto Mexico City. Víctor's father continued to live and work in Huejutla de Reyes and only visited the rest of the family during the summer. Once September arrived he would leave Mexico City and move north to the family home in the warmer climate of Huejutla de Reyes. Going to Mexico City had great advantages regarding education but the family left behind many things that were very precious to them\n[\n10\n]\n:-\nToday all the children agree that it was the right thing to emigrate to Mexico City, but at the time they suffered uprooting: they had left behind the exuberant tropical beauty, the days of fishing in the river, the ceiba trees, their dearest dog and, above all, their freedom.\nWhen Víctor arrived in Mexico City he was nine years old and was about to enter the fourth year of primary school. He was awarded a scholarship by the Ministry of Public Education and continued to receive scholarships until he completed his High School education at the age of fifteen. By that time he had fallen in love with mathematics and wanted to learn more but had no idea how to do so. He also felt a need to contribute to the family's finances so he took a job with the Ministry of Public Education. He spent four years in that bureaucratic job, then spent one year working in the library of the Higher School of Mechanical and Electrical Engineering. He had, however, managed to maintain his interest in mathematics since his boss at the Ministry of Public Education was an engineer named Paliza who obtained permission for Neumann-Lara to talk with him for an hour a day about mathematics problems; this certainly lightened the job which otherwise bored him. He enrolled in Petroleum Engineering at the Instituto Politécnico Nacional believing this might let him learn mathematics but he hated the engineering side and soon discovered there was little mathematics involved. Let us quote his own description from\n[\n7\n]\nhow he entered the Faculty of Sciences to study mathematics:-\nSo I began to study mathematics on my own, while I was deciding what to do. One afternoon\n[\nin\n1953]\nI ran into a former vocational teacher in a bookstore and I asked him where I could study mathematics. He advised me to see Vicente Echeverría del Prado, who was a mathematics teacher at the Polytechnic, as well as a poet and architect. I was also interested in poetry and I went to see him. He introduced me to Francisco Zubieta, who was a distinguished professor at the Faculty of Sciences, and taught at Vocational\n4\n. Zubieta made an appointment for me at the Ciudad Universitaria, where the Faculty of Sciences was located\n(\nin the Mining Palace\n)\n. ... there I met\nNápoles Gándara\n,\nFelix Recillas Juarez\nand others; the following year the Faculty was established in the old building next to the Science tower. I entered in\n1954\n.\nThe National Autonomous University of Mexico had opened in\n1910\nin the centre of Mexico City but as the number of students increased had sought a new campus on the edge of the city. In\n1945\nthe University acquired land in the Coyoacán district in the southern part of Mexico City but work did not start for some time. It was in\n1954\n, the year Neumann-Lara entered the Faculty of Sciences, that the Ciudad Universitaria was completed.\nNeumann-Lara studied mathematics in the Faculty of Sciences from\n1954\nto\n1958\n. In\n[\n7\n]\nhe speaks about the courses he took. In his first year he was one of about\n25\nstudents, most of whom were training to be physicists or actuaries. There were courses on Calculus, Modern Geometry given by\nAlberto Barajas\n, and Analytical Geometry. In\n[\n7\n]\nhe notes that there was no Linear Algebra course which he says was \"a serious deficiency.\" In later years he took courses on Topology with Guillermo Torres and Logic with Gonzalo Zubieta. While he was an undergraduate there were visits from\nGeorge D Birkhoff\nand\nSolomon Lefschetz\n. These leading mathematicians strongly influenced the research activities which was taking place with much emphasis on Algebraic Topology. But\n[\n7\n]\n:-\n... some people worked in other directions such as Gonzalo Zubieta who worked on Mathematical Logic, Guillermo Torres on Knot Theory, etc. Not everyone entered the direction of Algebraic Topology, there were people like Samuel Barocio who worked on Differential Equations.\nThere were, however, aspects that Neumann-Lara criticised\n[\n7\n]\n:-\n... it was sometimes reckless to dedicate oneself to thinking about concepts that no one, outside of a very small group of people, could understand. When talking about vector spaces, for example, you already felt like you were in the clouds! There was a great feeling of unreality regarding the environment, and I say this as a critic. Let's say that the environment was so restricted, that one felt isolated when talking about a thing like a vector space.\nAlthough his fellow students seemed little interested in politics, Neumann-Lara, who had left-wing views, tried to interest them. With a few colleagues he founded the Scientific and Cultural Association of which he was elected president. The Association organised a cinema club and published the magazine\nMixuntul\n; the name means 'zero' in Mayan. He also joined the Mexican Communist Party and remained a member for several years.\nNeumann-Lara began working as an assistant while still an undergraduate. He assisted Javier Barros Sierra who taught an Algebra course in the Faculty of Engineering. After Barros was appointed director of the Faculty of Engineering, Neumann-Lara was appointed as a professor in the Faculty. After graduating in\n1958\nhe also taught some courses in the Faculty of Sciences.\nIn\n1959\nNeumann-Lara was appointed as a professor of mathematics at the Central University of Venezuela, in Caracas. While in Caracas he married Carmen Coto Hermosilla. Carmen, the daughter of Guillermo Coto Conde and Ana Maria Hermosilla Leon, was born in about\n1941\n. In September\n1962\ntheir first child, a son Max Neumann-Coto was born. We note at this point that Max Neumann-Coto used the same non-standard convention as his father and used the hyphenated surname Neumann-Coto. He became a mathematician, being awarded a Ph.D. by the University of Michigan in\n1992\nfor his thesis\nLeast area tori in\n3\n-manifolds\n. His Ph.D. advisor was Peter Scott and he dedicated his thesis \"For Citlalin, Emo and Victor\". These are his sister, brother and father; his mother had died in January\n1981\n. Max Neumann-Coto became a professor at the Universidad Nacional Autónoma de México.\nThe three years Neumann-Lara spent at Caracas had been very happy and prosperous ones but political events brought them to an end. This is not the place to look at the complex situation which led to the Cuban Missile Crisis but it led to Khrushchev and Castro agreeing in July\n1962\nthat Cuba would begin to construct a site for Soviet nuclear missiles. In the United States, President Kennedy was advised by his Security Council to invade Cuba but he chose a less aggressive approach and on\n22\nOctober\n1962\nhe ordered what he called a naval \"quarantine\"; using this term avoided a declaration of war. Rómulo Betancourt, the President of Venezuela, sought a closer link with the United States and so began a campaign against left-wing people in Venezuela, particularly members of the Movimiento de Izquierda Revolucionaria. As a consequence Neumann-Lara was put in jail, but released after\n12\ndays. As soon as he was released, Neumann-Lara and his family returned to Mexico.\nBack in Mexico, Neumann-Lara was appointed to the School of Physics and Mathematics of the Universidad Veracruzana in Xalapa. His second child Guillermo Patricio Neumann Coto was born in\n1963\n; he became a physicist and high school teacher in Mexico City. Let us note at this point that his third child Citlalin Neumann Coto, born eleven years later, became a dancer and also undertook research in non-traditional therapies for the health of individuals.\nIn\n1964\nPhysics and Mathematics were separated and degrees in mathematics were introduced. Neumann-Lara became director for the mathematics degree and he remained in Xalapa until\n1966\n. During these four years at the Universidad Veracruzana, Neumann-Lara spent a year on study leave in France working with Marc Krasner\n(1912\n-\n1985)\nand Roland Fraïssé\n(1920\n-\n2008)\nat the Université Blaise Pascal, Clermont-Ferrand II.\nIn\n1966\nNeumann-Lara returned to Mexico City where he was appointed to the Faculty of Science at the Universidad Nacional Autónoma de México. The reader may have noticed that we have not reported on any Ph.D. thesis by Neumann-Lara and this is simply because he never submitted research for a doctorate. In fact over the first part of his career he was not much involved in research and certainly when he took up the appointment in\n1966\nhe had no research publications. This began to change, however, and he began to study graph theory on his own. He read books by\nClaude Berge\nsuch as\nThéorie des graphes et ses applications\nⓉ\n(\nGraph Theory and its Applications\n)\n(1958)\nand\nGraphes et hypergraphes\nⓉ\n(\nGraphs and Hypergraphs\n)\n(1970)\n. The concept of the kernel of a digraph had been introduced by\nvon Neumann\nand\nMorgenstern\nin the context of Game Theory. They proved that any finite acyclic digraph has a\n(\nunique\n)\nkernel. The problem of the existence of a kernel in a given digraph was then studied by several authors, in particular by Moses Richardson who proved in\n1953\nthat any digraph which does not contain directed cycles of odd length has a kernel. Neumann-Lara was able to find a short proof of Richardson's Theorem by introducing the concept of a semikernel. Up until this time he had not really thought that his work would be of interest to anyone else, but the interest that many showed in this piece of work made him realise that he could produce results of interest. It marked the beginning of his outstanding research achievements, begun unusually late in life.\nHis first paper\nSeminúcleos de una digráfica\nⓉ\n(\nSeminuclei of a digraph\n)\n, published as a Technical Report in the\nAnales del Instituto de Matemáticas\nII\n, Universidad Nacional Autónoma México in\n1971\n, contained his short proof of Richardson's Theorem. Ronald Read writes\n[\n11\n]\n:-\nThe author defines a \"semi-nucleus\" S of a digraph D to be an independent set of nodes of D with the property that, for any node x in D, if there is a directed edge from S to x then there is also a directed edge from x to S. He defines an R-digraph to be a digraph D such that every subdigraph induced by a subset of the nodes of D has a nonempty semi-nucleus. He gives some theorems relating to seminuclei and R-digraphs.\nClaude Berge\nwas impressed with this work and he included Neumann-Lara's proof in the\n2\nnd edition of his book\nGraphs and Hypergraphs\n. Now we should comment on Neumann-Lara's use of the feminine 'gráfica' for a graph rather than the masculine 'grafos'. He said that graphs were objects of such beauty that they should have a feminine name.\nFrank Harary\n, in a review of one of Neumann-Lara's\n1973\npapers, disagrees writing:-\nThe reviewer differs with the author concerning the gender of a graph. In place of \"una gráfica\", the reviewer recommends that the term \"un grafo\" be used, as in\n[\na\n1970]\npaper by\nRoberto Frucht\nand the reviewer.\nNeumann-Lara began attending many conferences, and we give examples of four Hungarian ones. In\n1973\nhe attended the Colloquium held at Keszthely, Hungary, from\n25\nJune to\n1\nJuly dedicated to\nPaul Erdős\non his\n60\nth birthday. He delivered the paper\nk-Hamiltonian graphs with given girth\nwhich was published in the\n3\n-volume\nProceedings\n. He attended the 'Algebraic methods in graph theory' conference held in Szeged,\n24\n-\n31\nAugust\n1978\n, delivering the paper\nClique divergence in graphs\nwhich was published in Volume\n2\nof the\nProceedings\nedited by\nLaszlo Lovász\nand\nVera Sós\n. The Sixth Hungarian Combinatorial Colloquium was held in Eger\n6\n-\n11\nJuly\n1981\nwith the title 'Finite and Infinite Sets'. The Colloquium was organised by the\nJános Bolyai Mathematical Society\n. Neumann-Lara delivered the paper\nThe generalized dichromatic number of a digraph\non Thursday\n9\nJuly; the previous paper had been delivered by\nLaszlo Lovász\n. Neumann-Lara also chaired the morning session of Section B on Friday\n10\nJuly. He was back in Eger for the Seventh Hungarian Combinatorial Colloquium held\n5\n-\n10\nJuly presenting the joint paper\nUnboundedness for generalized odd cyclic transversality\nwith the Argentinian mathematician and computer scientist Italo Jose Dejter.\nStarting late as a researcher, he was in his\n47\nth year before he was appointed as a tenured researcher at the Mathematics Institute of the Universidad Nacional Autónoma de México on\n1\nApril\n1980\n. He soon started a Graph Theory research group for he loved collaborative research. One of his first students was Hortensia Galeana Sánchez who was both an undergraduate and postgraduate at the Universidad Nacional Autónoma de México. Neumann-Lara was her thesis advisor and she earned a doctorate in\n1985\nfor her thesis\nAlgunos resultados en la teoría de núcleos en digráficas\nⓉ\n(\nSome results in the theory of nuclei in digraphs\n)\n. MathSciNet lists ten joint papers by Galeana Sánchez and Neumann-Lara. He also was thesis advisor to Eduardo Rivera-Campo who graduated with a Ph.D. in\n1993\nwith the thesis\nDe los árboles generadores de una gráfica conexa\nⓉ\n(\nOn the spanning trees of a connected graph\n)\n. They have published eight joint papers. We also mention Neumann-Lara's doctoral student Juan José Montellano-Ballesteros who wrote the thesis\nNúmero heterocromático lineal en gráficas\nⓉ\n(\nLinear heterochromatic number in graphs\n)\n(1999)\n. These students have all become university professors with excellent publication records. Isabel Puga tells us about his approach to supervising students in\n[\n10\n]\n:-\nVíctor vehemently maintains a position opposed to the \"encyclopaedic\" tendency of education in Mexico. When he mentors graduate students, his method is to give them open-ended problems from the start. He opposes them enrolling in courses and more courses that will not leave them free time to think. The only way to learn - he affirms - is to face the difficulties that arise in the approach to creating and solving new problems. In particular, accumulating credits and other academic requirements seems like a waste of time, especially if the student is motivated and thinking about some interesting problem.\nAlthough he was nearly forty years old before he published his first paper, Neumann-Lara has an outstanding publication record for the following thirty years of his life with\n87\npapers listed in MathSciNet. Most are joint works with his students or colleagues. His papers were deep and highly original and were praised by\nPaul Erdős\nwho visited him a couple of times in Mexico City.\nMathematics, however, was not Neumann-Lara's only passion. He loved poetry, enjoying both reading and writing it. His interest began when he was at school when he was taught by the poet Carlos Pellicer Cámara\n(1897\n-\n1977)\n. Although Neumann-Lara wrote poetry from his time at school, it was not until he met up with a group of poets including Guillermo Fernández, Raúl Renán, Francisco Hernández and Vicente Quirarte in the\n1980\ns that he was persuaded to publish. In\n1986\nNeumann-Lara published a collection of\n18\npoems written between\n1980\nand\n1985\nunder the title\nLineas en el Agua\nⓉ\n(\nLines in the Water\n)\n. Reviewing this collection, Sergio Monsalvo writes in the\nJournal of Poetry\nin\n1987\n:-\n... Víctor Neumann fills words with plasticity, strength and energy in such a way that they allow us to feel their poetic sense in a magical complex of images ...\nPoetry was not his only interest outside mathematics, for he also loved music, painting, soccer and enjoyed being with his children, his brothers and his friends. All his students were his friends.\nIn\n1985\nNeumann-Lara organised the first of the Coloquio de Teoría de las Graficas, Combinatoria y sus Aplicaciones\nⓉ\n(\nColloquium on Theory of Graphs, Combinatorics and their Applications\n)\nwhich has been held every year since in different cities in Mexico:-\nThe Colloquium brings together national researchers and their students who work in areas related to Combinatorics. It is an open academic event, where research at the national level is enriched and strengthened, international collaboration is promoted through the invitation of researchers from other countries, and it brings students closer to research in the different areas of Combinatorics.\nThe Colloquium contributes to the national diffusion and strengthening of the investigation and applications of the Theory of Graphs and Combinatorics. It is carried out in different cities of the country, in which combinatorics or a related research area is studied, to promote the approach of those who might be interested in the area. In addition to research lectures, presentations and thesis reports, the Colloquium has a session of open problems and posters so that both researchers and students can find a space to present their results and coexist academically during the week.\nThe\n19\nth Colloquium in the series was held in Puebla in February\n2004\n. As usual, Neumann-Lara appeared in the programme with his title \"To be announced\". He only made up his mind a couple of days before giving these lectures, choosing one of the many different topics he would be working on. Javier Bracho writes in\n[\n3\n]\n:-\n... who knows how or why he decided: perhaps to encourage a student or one of his many young collaborators, perhaps to balance the issues that had already been discussed, perhaps because it was his uncontrollable mathematical obsession at the time or because he felt or knew that he was close to something important. In Puebla, the latter was one of his reasons, because just before, in the relaxation of the cafe, he told me that he had already understood, and that now we were all going to understand, his famous TTT's, as we jokingly\n(\nwith respect\n)\ncalled to his age-old obsession with tournaments - graphs that are devilishly difficult to classify.\nHis talk was scheduled for Thursday\n6\nFebruary\n2004\nat\n13\n:\n00\nhours. He began with his usual enthusiastic approach, setting up the ideas which had led him to make the breakthrough. In the middle of his lecture he stopped writing on the blackboard, stepped down from the platform, collapsed onto the floor and died in the midst\n[\n3\n]\n:-\n... of the activity that he loved; surrounded by his students\n(\nboth young and not so young anymore\n)\n; soaked in respect and admiration, affection and attention.\nThe Colloquium continues to be an annual event and since\n2005\nhas been named the 'Coloquio Víctor Neumann-Lara de Teoría de las Gráficas Combinatoria y sus Aplicaciones'.\nLet us end with two quotes. First the words of Jorge Urrutia\n[\n12\n]\n:-\nWhile physically Víctor is gone, the school of mathematics he founded, his love for life, his poetry, and his mathematics remain with us. He was above all a warm person who gave us the gift of his friendship and companionship. Let us rejoice in the knowledge that we were lucky to have among us a great teacher and mathematician who will continue to lead us for many years to come.\nSecond the words of Javier Bracho\n[\n3\n]\n:-\nThe last years of Víctor Neumann Lara were of an impressive profusion, every day more articles, more theorems, more collaborations, more students ... and more peace. The struggles of youth to make space for himself were left behind as he flourished. His university recognised his talent, his work and his academic career by awarding him the National University Award for Research in Exact Sciences. But those who had the joy of knowing Víctor will miss and remember, above all, his unique gift for establishing deep friendships. He gave of himself and respected others; he was involved and committed; he learned and taught, transcending ages and biological conditions ... He soothed with his critical and playful tenderness, his frank, clean, captivating smile; always humour so close to wisdom and everything at the service of life, of living it and sharing it.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}