{
  "nome_completo": "Vaughan Frederick Randal Jones",
  "nome_curto": "Vaughan Jones",
  "ano_nascimento": "1952",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jones_Vaughan/",
  "lugar_nascimento": "Gisborne, New Zealand",
  "lugar_morte": "Nashville, Tennessee, USA",
  "biografia": "Vaughan Jones\nattended St Peter's School in Cambridge, New Zealand from the age of eight years until he was\n12\n. In\n1966\nhe began his secondary schooling at Auckland Grammar School in Auckland. He left school having been awarded a University Entrance Scholarship and a Gilles Scholarship to assist him to study at the University of Auckland. He also received a Phillips Industries Bursary.\nIn\n1970\nJones entered the University of Auckland graduating with a B.Sc. in\n1972\nand an M.Sc. with First Class Honours in\n1973\n. He was awarded a Swiss Government Scholarship in\n1973\nto enable him to undertake research in Switzerland. He also won a F W W Rhodes Memorial Scholarship.\nAfter teaching for a while as an assistant lecturer at Auckland, he entered the École de Physique in Geneva in\n1974\n, moving in\n1976\nto the Écoles Mathématiques. In Geneva his research was supervised by A Haefliger and he also taught as an assistant. In\n1979\nJones was awarded his Docteur es Sciences\n(\nMathématiques\n)\n, and the following year he was awarded the Vacheron Constantin Prize for his doctoral thesis.\nIn\n1980\nJones moved to the United States spending the academic year\n1980\n-\n81\nas\nE R Hedrick\nAssistant Professor of Mathematics at the University of California at Los Angeles. In\n1981\nhe moved to the University of Pennsylvania where he was assistant professor until\n1984\nwhen he was promoted to associate professor. In\n1985\nhe was appointed as Professor of Mathematics at the University of California at Berkeley.\nJones worked on the Index Theorem for\nvon Neumann\nalgebras, continuing work begun by\nConnes\nand others. His most remarkable contribution, however, was that in the course of this work he discovered a new polynomial invariant for\nknots\nwhich led to surprising connections between apparently quite different areas of mathematics.\nJones was awarded a\nFields Medal\nat the\n1990\nInternational Congress in Kyoto, Japan for his remarkable and beautiful mathematical achievements. Jones gave a lecture to the\n1990\nCongress dressed in a rather unusual way for a mathematics lecture. He was wearing the \"All Blacks\" rugby strip!\nJoan Birman\nlectured on Jones's work at the ICM-\n90\nand introduced his work as follows\n[\n4\n]\n:-\nIn\n1984\nJones discovered an astonishing relationship between\nvon Neumann\nalgebras and geometric\ntopology\n. As a result, he found a new polynomial invariant for knots and\nlinks\nin\n3\n-space. His invariant had been missed completely by topologists, in spite of intense activity in closely related areas during the preceding\n60\nyears, and it was a complete surprise. As time went on, it became clear that his discovery had to do in a bewildering variety of ways with widely separated areas of mathematics and physics .... These included\n(\nin addition to knots and links\n)\nthat part of\nstatistical mechanics\nhaving to do with exactly solvable models, the very new area of quantum groups, and also\nDynkin\ndiagrams and the\nrepresentation theory\nof simple\nLie algebras\n. The central connecting link in all this mathematics was a tower of nested algebras which Jones had discovered some years earlier in the course of proving a theorem which is known as the \"Index Theorem\".\nBirman\nalso talked of the way Jones freely exchanged his ideas with other mathematicians\n[\n4\n]\n:-\nHis style of working is informal, and one which encourages the free and open interchange of ideas. During the past few years Jones wrote letters to various people which described his important new discoveries at an early stage, when he did not yet feel ready to submit them for journal publication because he had much more work to do. He nevertheless asked that his letters be shared, and so they were widely circulated. It was not surprising that they then served as a rich source of ideas for the work of others. As it turned out, there has been more than enough credit to go round. His openness and generosity in this regard have been in the best tradition and spirit of mathematics.\nJones has received many honours for his work in addition to the Fields Medal. He was awarded a Guggenheim Fellowship in\n1986\nand elected a Fellow of the\nRoyal Society\nin\n1990\n. In\n1991\nhe was awarded the New Zealand Government Science Medal and given an honorary D.Sc. from the University of Auckland in\n1992\n. In\n1993\nhe was awarded a second honorary D.Sc. this time from the University of Wales. Also in\n1993\nhe was elected to the\nAmerican Academy of Arts and Science\n.\nHe was elected to the United States\nNational Academy of Sciences\n(1999)\n, and the Norwegian Royal Society of Letters and Sciences\n(2001)\n. In\n2000\nhe was presented with the Onsager medal of Trondheim University and in\n2002\nhe was awarded Distinguished Companionship of the New Zealand Order of Merit. Also in\n2002\nhe was elected as an honorary Member of the\nLondon Mathematical Society\nand awarded an honorary degree by the Universite du Littoral, Cote d'Opale. He was further honoured by being elected Vice-President of the\nAmerican Mathematical Society\nin\n2004\nand awarded the Prix Mondial Nessim Habif in\n2007\n.\nJones has made many other contributions to the mathematical community, particularly in his editorial work as editor or associate editor for many journals: the\nTransactions of the American Mathematical Society\n, the\nPacific Mathematics Journal\n, the\nAnnals of Mathematics\n, the\nNew Zealand Journal of Mathematics\n,\nAdvances in Mathematics\n, the\nJournal of Operator Theory\n,\nReviews in Mathematical Physics\n, the\nRussian Journal of Mathematical Physics\n, the\nJournal of Mathematical Chemistry\n,\nGeometry and Topology\n, and\nL'Enseignement Mathematique\n. He has served on the Scientific Advisory Boards of the Fields Institute of Mathematics, the\nErwin Schrödinger\nInstitute, the Mathematical Sciences Research Institute at Berkeley, the Center for Communications Research\n(\nUnited States\n)\n, the Institut\nHenri Poincaré\n, and the Miller Institute for Basic Research in Sciences. He served on the Nominating committee and the Steele Prize committee of the\nAmerican Mathematical Society\n, and on the Programme Committee for the International Congress of Mathematicians held at Madrid in\n2006\n.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}