{
  "nome_completo": "Vera Nikolaevna Kublanovskaya",
  "nome_curto": "Vera Kublanovskaya",
  "ano_nascimento": "1920",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kublanovskaya/",
  "lugar_nascimento": "Krokino, Vologda Oblast, Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Vera Nikolaevna Kublanovskaya\n's father was Nikolai Totubalin\n(\nKublanovskaya is Vera's married name\n)\n. Nikolai Totubalin and his wife were peasants who earned their living fishing and farming the surrounding land. Krokino, where Vera was born, was a small fishing village on the south east side of Ozero Beloye, a lake due east of St Petersburg\n(\nnamed Petrograd at the time that she was born, but becoming Leningrad in\n1924)\nand due north of Moscow. The village was on the lake at the point where the river Sheksna flowed out to the south and was\n18\nkm east of the town of Belozersk, on the south side of the lake. However, the village of Krokino no longer exists since the level of the lake was raised by a dam in the\n1960\ns as part of the construction of the Volga-Baltic Waterway and, at that time, the village was submerged.\nIt was at the town of Belozersk that Vera Nikolaevna attended secondary school and, after graduating, she took a course to train to become a primary school teacher. Her grades were outstanding so, as was the usual practice for the very best students, she was advised to continue her studies at the Gertzen Pedagogical Institute in Leningrad. Nikolai Totubalin and his wife agreed that their daughter could study in Leningrad, a city\n450\nkm west of their home village. Accepted without any further examinations, Vera Nikolaevna began her studies at the Pedagogical Institute in\n1939\n. In September of that year Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad where Vera Nikolaevna met\nDmitrii Konstantinovich Faddeev\nwho strongly advised her that she should follow a career in mathematics. In June\n1941\nthe course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow.\nWhen Vera Nikolaevna's mother became seriously ill she left Leningrad and returned to her home village of Krokino. In doing so, she had the good fortune to avoid being caught in the siege of Leningrad. Back home, she began teaching mathematics in the local school in Krokino and she also played a role in the war effort helping with constructing defences for the village. For a long time there was no opportunity to return to Leningrad which was only liberated from the siege in January\n1944\n. Even after the siege was lifted, access to the devastated city was for a considerable time only possible with a special permit.  However, in\n1945\nVera Nikolaevna decided that she would investigate whether\nFaddeev\n's suggestion that she study for a degree in mathematics at Leningrad State University still applied. She wrote to\nFaddeev\nat the Department of Mathematics and Mechanics, and received a reply inviting her to come to Leningrad and begin taking a degree course.\nAfter three years of study, Vera Nikolaevna graduated from Leningrad State University and was given an appointment as a junior researcher at the V A\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\nin Leningrad. There she came in contact with\nLeonid Vitalyevich Kantorovich\nwho had received little encouragement with his mathematical economics so, after returning to Leningrad after being evacuated during the siege, had shifted his attention back to mathematics. During World War II,\nKantorovich\nhad become interested in computation problems and he now became involved in secret research involving calculations that would be used in the development of the Soviet atomic bomb. Vera Nikolaevna worked with\nKantorovich\non this project in a secret Leningrad laboratory until\n1955\n. During these years she married and her two sons were born. It is remarkable that, in addition to her family duties and her work with\nKantorovich\n, Kublanovskaya found time to undertake research for her candidate's degree\n(\nequivalent to a Ph.D.\n)\n. After submitting her thesis\nThe Application of Analytic Continuation in Numerical Analysis\nto Leningrad State University, she received the degree in\n1955\n. Following this Kublanovskaya was promoted to a senior researcher at the\nSteklov\nMathematical Institute.\nKantorovich\nhad produced some recommendations on how the programming of calculations might be automated and also on how a computer might be constructed. He set up a research group, which Kublanovskaya joined, developing PRORAB, an abbreviation of the Russian for \"task manager\". PRORAB was a program that could input an encoded computational task, decode it and then execute it. In today's language, PRORAB is an interpreter routine. Computers at this time, however, simply dealt with numbers and had no methods to deal with symbolic data. Kublanovskaya began working for a group headed by\nVera N Faddeeva\nand was asked to select and classify matrix operations that would be useful in numerical linear algebra\n[\n5\n]\n:-\nFor a year and a half, she was involved in implementing algorithms of linear algebra in PRORAB in cooperation with\nKantorovich\n's group. Using analytical computational devices, this group was solving systems of linear algebraic equations. Most of them were ill conditioned. At this time, based on numerical experiments,\nD K Faddeev\ndeveloped ideas on ill-conditioned linear systems, which helped to persuade customers that their models were ill posed and to indicate domains of inadmissible parameters. That was the beginning of Vera Nikolaevna's activities on developing algorithms of numerical linear algebra. In\n1972\n, she defended her doctoral thesis\n(\nequivalent to the\nhabilitation\n)\nentitled 'The Use of Orthogonal Transformations in Solving Problems of Algebra.'\nDuring this time she had published a number of important papers. In\n1959\nshe published\nApplication of analytic continuation by means of change of variables in numerical analysis\nwhich contained results of her\n1955\nthesis - in it she applied the method of analytic continuation to various problems of numerical analysis. E Kogbetliantz writes in a review:-\n... the method is applied to particular problems such as, for instance, solution of systems of linear equations, determination of eigenvalues and eigenvectors of a matrix, integration of differential equations by series, solution of\nDirichlet\nproblem by finite differences, solution of integral equations, etc. For all these cases, well-chosen numerical examples are analyzed and the solutions are tabulated. These examples not only prove the practical importance of the method studied in this paper, but also illustrate the high accuracy attainable ... This paper is an important contribution to numerical analysis.\nHowever, her most famous work was published in\n1961\n-\n62\nwhen she produced three papers describing what today is called the QR algorithm, that became the most popular method for finding all eigenvalues of a full matrix\n[\n2\n]\n:-\nVera Kublanovskaya submitted her first QR summary 'Certain algorithms for the solution of the complete eigenvalue problem' on\n5\nJuly\n1960\n, followed by two subsequent papers 'Some algorithms for the solution of the complete eigenvalue problem'\n(1961)\nand 'The solution of the eigenvalue problem for an arbitrary matrix'\n(1962)\nwith details.\nKublanovskaya continued publishing significant papers on related topics\n(\nall written in Russian\n)\nsuch as:\n(\nwith\nVera Faddeeva\n)\nComputational methods for the solution of the general eigenvalue problem\n(1962)\n;\nOn a method of orthogonalizing a system of vectors\n(1964)\n;\nReduction of an arbitrary matrix to tridiagonal form\n(1964)\n;\nA numerical scheme for the Jacobi process\n(1964)\n;\nSome bounds for the eigenvalues of a positive definite matrix\n(1965)\n;\nAn algorithm for the calculation of eigenvalues of positive definite matrices\n(1965)\n;\nOn a certain process of supplementary orthogonalisation of vectors\n(1965)\n; and\nA method for solving the complete problem of eigenvalues of a degenerate matrix\n(1966)\n. Also in\n1966\nshe published a joint paper with\nDmitrii Faddeev\nand\nVera Faddeeva\nSur les systèmes linéaires algébriques de matrices rectangulaires et mal-conditionnées\n. The authors' summary reads:-\nThe paper is concerned with finding, without the use of the Gaussian transformation, the normal generalized\n(\nin the sense of the least-squares method\n)\nsolution for a system of linear algebraic equations with a rectangular matrix. The method suggested here is also applied in calculating the stable component of a linear system with an ill-conditioned matrix. Finally, there is given one of the aspects of the scaling problem connected with a linear system.\nIn more recent work, Kublanovskaya has worked with Vladimir Borisovich Khazanov. An example of their joint work is\nDeflation in spectral problems for matrix pencils\n(1987)\n. We have only been able to give a brief indication of the many papers which she had published - MathSciNet lists\n134\npublications in the areas of Commutative rings and algebras, Functions of a complex variable, History and biography, Linear and multilinear algebra, Numerical analysis, Ordinary differential equations and Systems theory. However, as well as research she has made an important contribution as a teacher\n[\n5\n]\n:-\nFor many years, Vera Nikolaevna combined research work with teaching. Starting in\n1968\n, she began teaching at the Leningrad Shipbuilding Institute\n(\nnow the St Petersburg Marine Technical University\n)\n. At this institute, she was conferred the title of Professor of the Chair of Applied and Computational Mathematics. It is simply impossible to overestimate the role of V N Kublanovskaya in training students in the  field of numerical methods and computational mathematics. In addition to giving lecture courses, she also supervised undergraduate and graduate theses as well as post-graduate courses. Many of her students defended candidate theses in numerical mathematics at the Department of Mathematics and Mechanics of the Leningrad State University.\nHer contributions have been recognised in a number of ways, in particular she was awarded an honorary doctorate by the University of Umea in Sweden in\n1985\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}