{
  "nome_completo": "Verdiana Grace Masanja",
  "nome_curto": "Verdiana Masanja",
  "ano_nascimento": "1954",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Masanja/",
  "lugar_nascimento": "Bukoba, Tanganyika (now Tanzania)",
  "lugar_morte": null,
  "biografia": "Verdiana Masanja\nwas given the name Verdiana Grace Kashaga; she adopted the name Verdiana Grace Masanja, by which she is now known, after her marriage. Verdiana was born in Bukoba, a town in north west Tanzania on Lake Victoria, close to the border with Uganda. When she was born, Bukoba was in Tanganyika which was ruled by the British. Tanganyika became an independent country in\n1961\nand it merged with Zanzibar\n(\nwhich gained independence in\n1963)\nin\n1964\nto form the United Republic of Tanzania. Julius Nyerere\n(1922\n-\n1999)\n, who had been Prime Minister of Tanganyika from\n1961\nto\n1963\n, became President of Tanzania when it came into existence on\n29\nOctober\n1964\n.\nIndependence had a major impact on Verdiana, who had just begun her schooling. President Nyerere abolished all school fees and not only was education free but pupils were also given uniforms, books and even shoes. In the interview\n[\n1\n]\nMasanja said that all through her schooling she topped her class but, being cleverer than her fellow male pupils, her fellow pupils claimed that she was was not an ordinary girl so she was treated differently from the other girls. In fact she was nicknamed \"Jikedume\", a Swahili name for a girl who behaves like a boy. She was not easily influenced, she explained, so she was not too disturbed by being treated differently.\nMasanja attended the Nyakabungo Primary School in Mwanza town. After completing her primary education she began her secondary studies at Chopre Secondary School, now named Mwanza Secondary School. This involved a long journey, since she lived about\n25\nkm from the school so, after one year, she changed to Rosary Secondary School, now named Nganza Secondary School. She was a popular pupil at school, partly because she was full of fun and partly because she helped her classmates with their school work. A talented girl, Masanja could act, sing, and dance as well as entertaining others with her ability to mimic voices. When she was about fourteen years old she started to learn to play the piano and even composed some songs. At this time she had notions of becoming a pop artist but her parents certainly did not like that idea one little bit.\nFor her final two years of schooling, Masanja attended Jangwani High School in Dar es Salaam where she prepared for university entry. Her favourite subject had been biology and her first thought of a career was to train to become a medical doctor. Mathematics and physics were the two subjects in which she excelled at school and her teachers encouraged her to study these at university, so she entered the University of Dar es Salaam to concentrate on these for her first degree. She explained the difficulties in the interview\n[\n1\n]\n:-\n... at that time there were only two girls offering mathematics. One of the challenges she faced at the university was that when studying at night and she needed further explanation, it became difficult for her to go to the halls of residence of her male colleagues because she was afraid. However, she remained confident she would make it.\nShe graduated with a bachelors degree in mathematics and physics in\n1976\nand continued studying at the University of Dar es Salaam for a Master's degree while, at the same time becoming a lecturer at the University. In\n1981\nshe was awarded an M.Sc. having written the dissertation \"Effect of Injection on Developing Laminar Flow of Reiner-Philippoff Fluids in a Circular Pipe.\" She decided to continue to study for a doctorate but to do this she travelled to Germany\n(\nat this time Germany was divided into two, so we should be more accurate and say she travelled to West Germany\n)\n, studying for a second Master's Degree at the Technical University of Berlin.\nContinuing to study for her Ph.D. at the Technical University presented her with problems as she explained in\n[\n1\n]\n:-\n... while studying in Berlin for her Ph.D., Professors refused to take her for supervision claiming mathematics was difficult even for white boys. She being a woman, a black woman from Tanzania which was labelled \"communist\", was seen as not able to do a Ph.D. in mathematics and thus was refused. Finally, she got a professor to supervise her. Her determination to excel pushed her on and she made it.\nFor the Ph.D. she was advised by Gerd Brunk and Heinrich Edwin Fiedler. Heinrich Fiedler had been named professor in the Department of Fluid Dynamics in\n1972\n. This Department was part of the Hermann-Föttinger Institute of Fluid Mechanics at the Technical University of Berlin. Masanja was awarded her doctorate in\n1986\nfor her thesis\nA Numerical Study of a Reiner-Rivlin Fluid in an Axi-Symmetrical Circular Pipe\n. She thus became the first woman from Tanzania to receive a Ph.D. in mathematics.\nAfter completing her doctorate, Masanja returned to Tanzania and took up her position at the University of Dar es Salaam where she was promoted to professor. At this University she supervised Ph.D. students and Master's students in mathematics. She taught courses for both undergraduate and graduate mathematics students. In addition she taught undergraduate and graduate engineering mathematics students.\nMasanja has written papers relating to the fluids work that she undertook for her doctoral thesis, and she has also written papers on gender issues and mathematical education. We look briefly at a number of these papers, listing sixteen of which we give further information on eleven, at\nTHIS LINK\n.\nAlthough Masanja remained on the academic staff of the University of Dar es Salaam until December\n2010\n, she has also taught in Rwanda since\n2006\n. In April\n2007\nshe was appointed as Director of Research and Professor of Mathematics at the National University of Rwanda. She was appinted as Deputy Vice Chancellor and Senior Advisor on Strategic Development, Research and Innovation at the University of Kibungo. This university was established in\n2003\nin the Eastern Province of Rwanda. In\n2018\nwas appointed as a full Professor of Applied and Computational Mathematics in the School of Computational and Communication Sciences and Engineering in the Nelson Mandela African Institute of Science and Technology. This Institute was founded in\n2009\nand is situated in Arusha, Tanzania.\nWe quote from\n[\n2\n]\nregarding the awards she has received:-\nIn\n2011\nshe received the University of Dar es Salaam Golden Outstanding Award in recognition of her contributions to the teaching and learning of mathematics in Tanzania. She has served as the secretary for the Commission on Women in Mathematics in Africa, as Vice-President for Eastern Africa on the executive committee of the African Mathematical Union, as the chairperson for the Tanzania Education Network, and as the national coordinator of Female Education in Mathematics in Africa.\nMasanja is the mother of four children.\nLet us end this biography with quoting from\n[\n1\n]\n:-\nProfessor Masanja said that as a girl, she did not find mathematics as a difficult subject and, therefore, advised girls not to see the subject as a problem. \"Girls should remove their fear for mathematics since studying it forms a major part of everyone's life.\"",
  "math_areas": [
    "Applied Mathematics"
  ]
}