{
  "nome_completo": "Albert Victor Bäcklund",
  "nome_curto": "Victor Bäcklund",
  "ano_nascimento": "1845",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Backlund/",
  "lugar_nascimento": "Väsby, Malmöhus County, Sweden",
  "lugar_morte": "Lund, Sweden",
  "biografia": "Victor Bäcklund\n's parents were Hans Peter Bäcklund\n(1812\n-\n1865)\nand Maria Vilhelmina Pride\n(1814\n-\n1905)\nwho came from a Scottish family. Hans was working as an accountant at the Höganäsverken when Victor was born but left in\n1852\nafter which time he was an accountant at the Skane Enskilda Bank in Helsingborg. Victor had an older sister Eleonora who was born in\n1838\n. He attended Helsingborg grammar school, beginning in\n1855\n, and he was only sixteen years old when he entered the University of Lund on\n28\nMay\n1861\n. He studied astronomy, mechanics, physics and mathematics and graduated with his Candidates' Degree on\n14\nSeptember\n1866\n. He was taught at Lund by Carl Johan Danielsson Hill\n(1793\n-\n1875)\nwho had been the first professor of mathematics in Sweden to devote his studies fully to mathematics after his appointment to Lund in\n1830\n. Hill was not a good teacher and, as a consequence, it was not his lectures that attracted Bäcklund to mathematics. Rather it was the seminars of the assistant professor, Edvard von Zeipel\n(\nappointed to Lund in\n1861)\n, that turned Bäcklund towards mathematics. However, his first love was astronomy and, from\n1864\n, he worked at Lund Observatory under the direction of Axel Möller\n(1830\n-\n1896)\n. After his Candidates' Degree, Bäcklund continued to undertake research at Lund for his doctorate, advised by Möller, which was awarded in\n1868\n. In his thesis\nBestämning af Lunds observatorii polhöjd medelst observationer i första vertikalen\nⓉ\n(\nDetermination of the latitude of Lund observatory by observations in the first vertical\n)\nhe examined methods to determine the latitude of a place from astronomical observations; in particular he was able to give an extremely accurate value for the latitude of Lund Observatory.\nDespite writing a thesis on astronomy, Bäcklund published a paper on geometry\nNågra satser om plana algebraiska kurvor, som gå genom samma skärningspunkter\nⓉ\n(\nSome comments on planar algebraic curves, which go through the same intersection points\n)\nin\n1868\n. After being appointed as an assistant at the astronomical observatory in Lund on\n19\nJanuary\n1869\n, he was appointed as a\ndocent\nin geometry later in the same year. Hill retired from the chair of mathematics at Lund in\n1870\nand a complex appointing process was set up to fill the chair. Bäcklund, although relatively inexperienced at this stage in his career, applied for the position as did Edvard von Zeipel, the assistant professor, Carl Fabian Emanuel Björling, a lecturer in Halmstad, Göran Dillner, an assistant professor in Uppsala, and\nSophus Lie\n.\nLie\nsoon withdrew his application and the others were evaluated by Axel Möller in\n1871\n. All the candidates gave lectures and, because he was not already on the staff of a university, Björling was asked to defend one of his recently published papers on roots of algebraic equations. Perhaps surprisingly, since he was also a candidate for the chair, Bäcklund was asked to act as Björling's opponent for this defence. Bäcklund pointed out that many of the results claimed by Björling had been proved many years before by\nEuler\n. Björling did not dispute this but said that to discover theorems previously discovered by\nEuler\nonly showed his exceptional quality.\nBäcklund was the youngest of the candidates and did not stand much chance of being appointed despite being able to present five papers in\nalgebraic geometry\n. The first of these we have already mentioned above but the most significant was\nNågra satser om plana algebraiska kurvors normaler\nⓉ\n(\nSome comments on plane normal algebraic curves\n)\n(1869)\nconcerning normals of real algebraic curves. Möller rated Edvard von Zeipel as the leading candidate, Bäcklund as third, and Björling in last place. However, Björling disputed Möller's assessment and, after furious letters to the government and to the King, he was appointed to the chair of mathematics in\n1873\n. After the tensions caused by this competition for the chair, the mathematics department must have been a rather unhappy place over the following period. Bäcklund, however, was able to spend time away from Lund after he received funding to make a trip to Germany to further his studies. He spent most of the months from February to July\n1874\nat Leipzig and Erlangen working with\nFelix Klein\nand\nFerdinand von Lindemann\n. Having failed to win the chair of mathematics with his contributions to algebraic geometry, he now changed topic feeling that this would give him a better chance of promotion. It was in this new area of differential equations that Bäcklund produced his more notable results, namely on what are today called Bäcklund transformations.\nAll Bäcklund's papers on algebraic geometry are in Swedish and published in Swedish journals. His first paper in an international journal, written in German in\nMathematischen Annalen\n, was\nÜber Flächentransformationen\nⓉ\n(\nOn surface transformations\n)\n(1875)\n. At the start of the paper Bäcklund explains the background to the work:-\nRecently, I became concerned with the question if there are surface transformations of a three-dimensional space that leave invariant the second-order tangency rather than the first-order tangency. I discussed this question in Volume\n10\nof the 'Annual Reports of Lund University'\n(\nSeptember\n1874)\nand came to the conclusion that the transformations that leave invariant the first-order tangency, i.e.\nLie\n's contact transformations, are the only ones for which the higher-order tangency conditions are invariant. Simultaneously,\nLie\n's paper appeared in Volume\n8\nof 'Mathematischen Annalen'\n(1874)\nwhere the similar question on osculating transformations was raised. Therefore I would like to undertake a detailed presentation of the previous investigation and to dwell on certain points that were only hinted at before.\nAfter this paper on surface transformations which are bijections, he went on to study general surface transformations, preparing the way in the two-part paper\nÜber partielle Differentialgleichungen höherer Ordnung, die intermediäre erste Integrale besitzen\nⓉ\n(\nOn  partial differential equations of higher order which have intermediary first integrals\n)\n(1877\n,\n1878)\n. He continued his investigations with\nZur Theorie der partiellen Differentialgleichungen zweiter Ordnung\nⓉ\n(\nOn the theory of partial differential equations of second order\n)\n(1879)\nand\nZur Theorie der partiellen Differentialgleichung erster Ordnung\nⓉ\n(\nOn the theory of partial differential equation of the first order\n)\n(1880)\n, returning to study surface transformations in\nZur Theorie der Flächentransformationen\nⓉ\n(\nOn the theory of surface transformations\n)\n(1881)\n. For more information about the content of these important papers, see\n[\n1\n]\n.\nHe was unsuccessful in his application for a professorship in mechanics at Uppsala University, but it was not too long before he was appointed as an extraordinary professor of mechanics and mathematical physics at Lund on\n8\nFebruary\n1878\n. Carl Wilhelm Olseen, who studied at Lund University in the\n1890\ns, describes Bäcklund's teaching at that time in the obituary he wrote\n[\n2\n]\n:-\nBäcklund devoted himself to his teaching duties with ardour and delight and he often talked about the pleasure his lectures had given him. During the time that the author\n(\nC W Olseen\n)\nheard him\n(\nthe\n1890\n's\n)\nBäcklund carried a double burden. Outside of the regular four lectures a week he gave a beginner's course in mechanics with exercises, also four hours a week. His interest in his audience was manifested by, among other things, invitations to a yearly party where lobster was a standing ingredient.\nBäcklund continued in the position of extraordinary professor until\n1897\nwhen he was made full professor of mechanics and mathematical physics. He was appointed professor of physics on\n21\nSeptember\n1900\n. During his years as professor of physics, he served as rector of Lund University from\n1\nJune\n1907\nto\n31\nMay\n1909\n. Olseen, who was by this time a leading Swedish physicist, also describes the contributions that Bäcklund made to physics in the obituary he wrote\n[\n2\n]\n:-\nThere are many kinds of physical theories. For experimental research most useful, but in the long run least tenable, are those which, on the basis of accepted knowledge, examine recent experiments and their consequences for a systematic theory. For theoretical physics most important is the theoretical work, which, from contradictions between reality and established theory, carves out a new basic hypothesis for the theory. As an example we may mention\nPlanck\n's quantum hypothesis. Yet another kind is the theoretical work which, by a deeper mathematical treatment of an existing theory, attempts to eliminate a contradiction between theory and experiment or be useful to experimental research. Bäcklund's physical theory falls into none of these categories. With contemporary experimental work it had no connection. Neither had it any ties with the theoretical work which at the same time was done in England or on the continent. The aim of his theory was neither to be useful to experimental work nor to eliminate some contradiction between theory and experiment. Then, what was the aim of this theory? To reduce physics to mechanics! To prove that all physical phenomena can be deduced from various forms of motion! This is the object, more philosophical than physical, which Bäcklund in his activity as a mathematical physicist tried to realize. In his youth this was the established aim of theoretical physics. He remained true to this conception while around him physics went through a development which for the majority of physicists radically changed the circle of problems. For this reason his theory was never tested in experiment. At the time when it was so developed that experimental tests were possible, the centre of gravity in physics had moved from mechanics to electromagnetism. The foundations of his theory had failed before the theory could be tested. This was the tragic element in Bäcklund's life as a theoretical physicist. Or perhaps, this was just one side of his tragedy. There was another one. In the extensive world he had created he was the only living being. During his twenty-five years of work in theoretical physics he was completely alone. There are things he has said where it is clear that he felt this loneliness as a tragedy.\nAn interesting long letter by Bäcklund to\nPoincaré\nconcerning his work in physics is published in\n[\n3\n]\n.\nLars Gårding\n, in\n[\n1\n]\n, sums up Bäcklund's career with regrets that he moved to physics from mathematics:-\nBäcklund's mathematical work was more successful. His discovery and characterization of generalized contact transformations is a permanent piece of mathematics which remains of interest one hundred years after it was done. But also in the mathematical papers it is possible to see the combination of power and insensitivity which Oseen describes. It is perhaps regrettable that Bäcklund was not able to devote himself to mathematics all his life.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry"
  ]
}