{
  "nome_completo": "Viktor Aleksandrovich Gorbunov",
  "nome_curto": "Viktor Aleksandrovich Gorbunov",
  "ano_nascimento": "1950",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gorbunov/",
  "lugar_nascimento": null,
  "lugar_morte": "Novosibirsk, Russia",
  "biografia": "Viktor Aleksandrovich Gorbunov\nstudied at Novosibirsk State University, graduating with a first degree in\n1972\n. He then remained at the University undertaking research for his doctorate but at the same time teaching as an instructor in the Department of Mechanics and Mathematics of the University. His thesis advisor was Dmitrii Smirnov, but he was also influenced by Konstantin Zhevlakov.\nHe published his first paper in\n1973\nbeing a joint work with A I Budkin entitled\nImplicative classes of algebras\n(\nRussian\n)\n. The implicative class of algebras is a generalisation of quasivarieties. The structural characteristics of the implicative class are studied in this paper. A second join paper with Budkin\nOn the theory of quasivarieties of algebraic systems\n(\nRussian\n)\nappeared in\n1975\n. Ivan Chajda begins a review of the paper as follows:-\nThe authors study some properties of quasivarieties of algebraic systems. The first results are concerned with conditions for subclasses to be subquasivarieties. The authors formulate the conditions by means of algebraic non-immersibility.\nIn the same year he published\nFilters of lattices of quasivarieties of algebraic systems\n(\nRussian\n)\n, this time written with V P Belkin. In fact he had written six papers before his doctoral thesis\nOn the Theory of Quasivarieties of Algebraic Systems\nwas submitted. He received the degree in\n1978\n. Gorbunov continued working at Novosibirsk State University, being promoted to professor. He also worked as a researcher in the Mathematics Institute of the Siberian Branch of the Russian Academy of Sciences.\nGorbunov's work was published in many papers but was brought together in the form of a textbook in\n1998\nwhen he published\nAlgebraic theory of quasivarieties\nboth in Russian and in English translation. Gorbunov writes in the Preface of the book:-\nThe theory of quasivarieties is a branch of algebra and mathematical logic that deals with a fragment of the first-order logic, the so-called universal Horn logic. In this book, the author has tried to represent uniformly the principal directions of the theory of quasivarieties on the basis of an algebraic approach. This approach was developed by the author and his students and was presented earlier only in articles. The book contains a number of new unpublished results\n(\nin particular, concerning applications of quasivarieties to graphs, convex geometries, and formal languages\n)\n.\nThe contents of the book is indicated by the titles of the six chapters: Basic notions; Finitely presented structures; Subdirectly irreducible structures; Join semidistributive lattices; Lattices of quasivarieties; and Quasi-identities on structures.\nThe authors of\n[\n2\n]\nwrite:-\nViktor's name was and will always be affiliated with the Siberian School of Algebra and Logic, which was founded by\nAnatoly Ivanovich Malcev\n. Viktor was proud to belong to the School and to continue its traditions. He created around himself a team of bright young mathematicians whom he inspired and with whom he shared his ideas. In the forum of universal algebra and lattice theory, his group was well respected, within the School as well as internationally.\nAlso in\n[\n2\n]\na list of\n13\nof his doctoral students are given. One of these students was Kira Adaricheva, who was awarded his doctorate in\n1992\nfor his thesis\nStructure of lattices of subsemilattices\n, and is the author of\n[\n1\n]\nand the coauthor of\n[\n2\n]\n. The article\n[\n2\n]\nforms an introduction to the Viktor Aleksandrovich Gorbunov memorial issue of\nAlgebra Universalis\n. This issue contains three papers coauthored by Gorbunov together with his doctoral students Aleksandr Kravchenko, Kira Adaricheva and Marina Semenova. The authors of\n[\n2\n]\nend their tribute with these words:-\nHe was a dedicated teacher, lecturer, and Ph.D. advisor. He was a member of the Scientific Council of the Institute of Mathematics in Novosibirsk. He was an editor of Algebra Universalis. His name will stay with us in his theorems, mathematical ideas, in the open problems he left, and in our memory of his genuine dedication to mathematics. This special issue of Algebra Universalis is a tribute to his memory by the universal algebra and lattice theory community.\nHe died at the age of\n48\n.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}