{
  "nome_completo": "Vilhelm Frimann Koren Bjerknes",
  "nome_curto": "Vilhelm Bjerknes",
  "ano_nascimento": "1862",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bjerknes_Vilhelm/",
  "lugar_nascimento": "Christiania (now Oslo), Norway",
  "lugar_morte": "Oslo, Norway",
  "biografia": "Vilhelm Bjerknes\nwas a son of\nCarl Bjerknes\nand Aletta Koren, whose father was a minister in the Church in West Norway. See the biography of\nCarl Bjerknes\nfor more details of his family background. Carl, Vilhelm's father, was not a good experimentalist and so while he was a young boy Vilhelm did much work assisting his father in carrying out experiments to verify the theoretical predictions which came out of his father's hydrodynamic research. Vilhelm began this work with his father when he was still quite a young boy and he continued the collaboration after he began his undergraduate studies at the University of Kristiania in\n1880\n. Vilhelm wrote his first paper\nNew hydrodynamic investigations\nin\n1882\nwhen he was only\n20\nyears old.\nWe should note that the different spelling of Christiania or Kristiania is not an error. The city was named Christiania when Vilhelm was born there, became Kristiania in\n1877\n, then was renamed Oslo in\n1925\n. Throughout Vilhelm Bjerknes's life he was associated with this city with its three different names and all three names appear in this biography.\nIn\n1888\nVilhelm was awarded his Master's Degree from the University of Kristiania after studying mathematics and physics. During his final years of study at university Bjerknes decided that he would have to end the collaboration with his father. By this time\nCarl Bjerknes\nhad become a recluse and continuing the collaboration would have led, Vilhelm believed, to his own scientific isolation. It must have been a painful decision for young Vilhelm, who was devoted to his father, but he feared falling into the pattern of work that his father had developed, leaving him outside the mainstream of science. It was a mature decision for the young man who clearly saw that he had a major role to play in the future of scientific research.\nAfter graduating from Kristiania, Bjerknes was awarded a state scholarship which allowed him to study abroad. He later wrote\n(\nthinking about both himself and his father\n)\nthat:-\n... foreign scientific travels\n[\nwere\n]\nindispensable for anyone in our restricted situation who wishes to develop into a man of science.\nHe went to Paris in\n1889\nwhere he attended\nPoincaré\n's lectures on electrodynamics, then he went to Bonn as\nHertz\n's assistant. This was not a short trip, for Bjerknes spent two years from\n1890\nto\n1892\nin Bonn. Together\nHertz\nand Bjerknes studied electrical resonance which proved important in the development of radio. Bjerknes remained a close friend of\nHertz\nand his family from that time on. He returned to Norway to complete his doctoral thesis on work he had undertaken in Bonn. The doctorate was awarded in\n1892\nwhen he was thrity years old.\nBjerknes was appointed as a lecturer at the Högskola\n(\nSchool of Engineering\n)\nin Stockholm in\n1893\nthen, two years later, he became professor of applied mechanics and mathematical physics at the University of Stockholm. He continued developing his father's ideas but also making other significant advances, generalising results of\nThomson\nand\nHelmholtz\n. Important for the future direction of Bjerknes's research was the fact that he now applied the generalisation of the theory of vortices of\nThomson\nand\nHelmholtz\n, which he had studied, to motions in the atmosphere and the ocean. Bjerknes began to work out a research plan that he would use hydrodynamics and thermodynamics so that, given a particular state of the atmosphere, he would be able to compute its future state.\nIn\n1893\nhe married S H Bonnevie who came from a Huguenot family which had fled from France to Norway at the time of persecution. She was a student of natural sciences at the University of Christiania. Gold writes\n[\n6\n]\n:-\nHer warm hearted and gracious hospitality contributed in no small degree to the happy social atmosphere of the meteorological community at Bergen ...\nThey had four sons. Their son, Jacob Bjerknes, was born on\n2\nNovember\n1897\n. Jacob would later collaborate with his father and become a famous meteorologist in his own right, discovering the mechanism which controls the behaviour of cyclones.\nIn\n1905\nVilhelm Bjerknes visited the United States, described some of the fundamental steps he had already taken in the theory of air masses, and explained his plans to apply mathematics to weather forecasting. The Carnegie Foundation were impressed and they awarded him funds to pursue this research. He was to continue to receive this grant from the Carnegie Foundation for\n36\nyears.\nBjerknes accepted the chair of applied mechanics and mathematical physics at the University of Kristiania in\n1907\n. He was a very different person from his father in that he gathered a large group of collaborators round him wherever he went. He built up a large school in Kristiania studying dynamic meteorology.\nIn\n1912\nBjerknes was offered the chair of geophysics at the University of Leipzig, and also the directorship of the new Leipzig Geophysical Institute which was just being founded. He accepted the positions taking some of his collaborators from Kristiania with him. Soon he was joined by other members of the Kristiania team, and by his son Jacob Bjerknes who also became a collaborator during his time in Leipzig. Jacob and Vilhelm Bjerknes collaborated in establishing a network of weather stations in Norway and it was data gathered from these weather stations which led to their theory of polar fronts.\nIn\n1917\nBjerknes was offered a chair at the University of Bergen and he was given the opportunity to found the Bergen Geophysical Institute. At first he was rather reluctant to leave Leipzig since he feared for the long-term future of the Geophysical Institute there but, once convinced that the work of the Institute would continue, he accepted the Bergen offer. Despite being\n55\nyears old when he moved to Bergen, most historians agree that Bjerknes did his best work there. This work on a mathematical approach to weather forecasting is described in\n[\n2\n]\n:-\nEfforts at incorporating numerical data on weather into mathematical formulas that could then be used for forecasting were initiated early in the century at the Norwegian Geophysical Institute. Vilhelm Bjerknes and his associates at Bergen succeeded in devising equations relating the measurable components of weather, but their complexity precluded the rapid solutions needed for forecasting. Out of their efforts, however, came the polar front theory for the origin of cyclones and the now-familiar names of cold front, warm front, and stationary front for the leading edges of air masses ...\nThe next step forward in the mathematical approach was due to\nRichardson\nin\n1922\nwhen he reduced the complicated equations produced by Bjerknes's Bergen School to long series of simple arithmetic operations. However, until the advent of computers, these were still impossible to solve in the time-scale required for weather forecasting.\nMost of Bjerknes's major results in this area appear in\nOn the Dynamics of the Circular Vortex with Applications to the Atmosphere and to Atmospheric Vortex and Wave Motion\n(1921)\n[\n1\n]\n:-\nOne of his finest books, it contains a clear explanation of the most important basic ideas in his research.\nThere were two scientists from whom Bjerknes had the greatest admiration. One was\nHeaviside\nand the other was\nHertz\n. Bjerknes had visited\nHeaviside\nin\n1919\nin Torquay, England. By that time\nHeaviside\nwas living a lonely life in hard financial circumstances and Bjerknes did his best to assist him. In a letter to\nHeaviside\nin\n1922\nBjerknes wrote\n[\n6\n]\n:-\nIt is not unlikely that I shall write something presently of my old master\nHertz\nin whose laboratory I worked in\n1890\n-\n91\n. I am one of his very few personal pupils. this makes it a duty for me to bring some recollections of him. I have always considered him and you as the two real inheritors of\nMaxwell\nand I am very glad that I have had the good luck to come into personal contact with these two only ones.\nIn\n1923\nBjerknes published a collection of papers on electrical resonance, and wrote an introduction dedicating them to the memory of\nHertz\n.\nBjerknes made his final move in\n1926\nwhen he accepted the chair of applied mechanics and mathematical physics at the University of Oslo\n(\nKristiania had been renamed Oslo in\n1925)\n. His work certainly was not confined to the mathematics of weather forecasting for he continued to study the hydrodynamical work started by his father. He also produced the theory, in\n1926\n, that sun spots are the erupting ends of magnetic vortices broken by the sun's differential rotation.\nDuring his years at the University of Oslo until his retirement in\n1932\nBjerknes put a considerable effort into teaching. He published a book on vector analysis in\n1929\nwhich was designed as the first of a larger textbook on theoretical physics. It was a project which he never completed but\n[\n3\n]\n:-\n... his alert mind was not dimmed by age, and he went on working long after his retirement.\nIn\n1928\nBjerknes' wife died and at that time her sister, Professor Kristine Bonnevie, became his housekeeper.\nAs indicated in the above quote, Bjerknes remained active after his retirement. In particular he became President of the Association of Meteorology of the International Union of Geodesy and Geophysics in\n1932\n. He organised the International Meeting of the Association in Edinburgh, Scotland, in\n1936\n. He addressed the Silver Jubilee celebrations of the Leipzig Geophysical Institute in\n1938\n, encouraging them to work harder on the problems of weather forecasting.\nIn the following year World War II broke out\n[\n6\n]\n:-\nThe outbreak of the war in\n1939\nwas a sore blow to Bjerknes, imbued as he was with ideals of international friendship and cooperation and with his many ties with Germany and German scientific life. During the occupation of Norway he showed towards the invaders a dignified and courageous severity.\nAlthough Bjerknes was\n84\nyears old in\n1946\n, he made the trip to the\nNewton\nTercentenery Celebrations in England.\nGold writes of his character\n[\n6\n]\n:-\nBjerknes was dignified in manner, in appearance and in his presentation of his scientific work, but with his dignity he combined a certain modesty and an enthusiasm which both attracted and stimulated younger men.\nT Bergeron, one of his students, added:-\nThe fine sense of humour which\n[\nBjerknes\n]\npossessed, together with his genius, his far-sightedness, increased during a long and migrating career, made him a very human individual. But he was certainly a little shy or repressed.\nMore than once I heard him state that he never learned easily, that he lacked the natural ability for easily communicating his thoughts verbally or in writing, that he had to be a hard worker - and certainly he was one\n.\nThe honours which Bjerknes was awarded are far too numerous to list here, but we mention a few. He was elected to many national academies such as the\nNorwegian Academy\nof Oslo\n(1893)\n, the Washington Academy of Science\n(1906)\n, the Dutch Academy of Science\n(1923)\n, the\nBerlin Academy\n(1928)\n, the\nRoyal Society of Edinburgh\n(1930)\n, the\nRoyal Society of London\n(1933)\n, the\nU.S. National Academy of Science\n(1934)\n, and the\nAccademia dei Lincei\n(1936)\n.\nHe also received honorary degrees from many universities such as the University of St Andrews\n(1926)\nand the University of Copenhagen\n(1929)\n. Among the Medal he received were the Agassiz Medal for Oceanography\n(1926)\n, the Symons Medal for Meteorology\n(1932)\n, and the Buy-Ballot Medal for Meteorology\n(1933)\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}