{
  "nome_completo": "Vincenzo Viviani",
  "nome_curto": "Vincenzo Viviani",
  "ano_nascimento": "1622",
  "ano_morte": "1703",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Viviani/",
  "lugar_nascimento": "Florence (now Italy)",
  "lugar_morte": "Florence (now Italy)",
  "biografia": "Vincenzo Viviani\n's father was Jacopo di Michelangelo Viviani and his mother was Maria Alamanno del Nente; both were members of a noble families. Vincenzo studied at a Jesuit school where he learnt the humanities. He was taught mathematics by Clemente Settimi, a Scolopian friar and a friend of\nGalileo\n. Settimi quickly saw Viviani's exceptional intelligence and, in\n1638\n, presented him at court to Ferdinando II de' Medici, Grand Duke of Tuscany. The court was in Livorno, so Viviani had to make the long journey from Florence. While on the road he did not waste his time but spent the many hours studying the first three books of\nEuclid\n's\nElements\n. He made a presentation to the Tuscan Court explaining the first sixteen propositions in the first book of the\nElements\n. Famiano Michelini, Ferdinando's Court mathematician, then set him a problem to which he responded confidently. Ferdinando was greatly impressed and provided a monthly salary for Viviani that enabled him to purchase mathematical books. He also arranged for Viviani to meet\nGalileo\n, who was living in his villa in Arcetri, near Florence, where he had been put under house arrest by the Catholic Church. Despite the house arrest,\nGalileo\nwas still Ferdinando's Tuscan Court Mathematician.\nGalileo\n, who by this time was totally blind, was very impressed by Viviani's knowledge and abilities. In\n1639\n, he took Viviani into his home as a companion, student and collaborator, and Viviani continued in this role until\nGalileo\ndied in January\n1642\n. Viviani learnt much from\nGalileo\nover this period, working with him on physics and geometry. However, as Viviani relates himself, their relationship went well beyond that of scientist and assistant, becoming much more like that of a father and son. He wrote\n(\nsee for example\n[\n4\n]\n)\n:-\nSoon after the unexpected publication of 'Discourses and mathematical demonstrations concerning the two new sciences', Signor\nGalileo\nallowed me into his villa in Arcetri where he was staying. I was able to benefit from our intelligent conversations and his precious teachings and he was content that in the study of mathematics, which I had only recently begun, I could turn to his own voice for the solution of those doubts and difficulties that I often found through the natural weakness of my intellect.\nIn October\n1641\n,\nGalileo\nand Viviani were joined in the villa at Arcetri by\nEvangelista Torricelli\nwhen he moved from Rome. After\nGalileo\n's death,\nTorricelli\nwas appointed to fill\nGalileo\n's post as Ferdinando II de' Medici's Tuscan Court Mathematician and Viviani continued his collaboration with him.\nTorricelli\nis most famed as the first person to create a sustained vacuum and to discover the principle of a barometer. In\n1643\nTorricelli\nproposed an experiment which would demonstrate that atmospheric pressure determines the height to which a fluid will rise in a tube filled with a liquid, then inverted over the same liquid. In\n1644\nViviani, as\nTorricelli\n's collaborator, carried out the experiment which proved a major scientific advance and led to the development of the barometer. When\nTorricelli\ndied in\n1647\n, Viviani was appointed to fill the lectureship at the Accademia del Disegno in Florence, holding this post for two years. The Grand Duke also appointed Viviani as mathematics teacher to the Medici family at Court, and as engineer with the Uffiziali dei Fiumi, a position he held for the rest of his life\n[\n4\n]\n:-\nWhile his responsibilities as a Court Mathematician often varied according to the desires of the Grand Duke, the travels of the Tuscan Court, and the arrival on the scene of other thinkers, all his life he was kept busy by his duties to the Medici Court. Particularly exhausting for him was his role of engineer, which required substantial travel on horseback and led to illness on more than one occasion.\nThe main thrust of Viviani's life, however, was to keep\nGalileo\n's memory alive and he wanted to do so by publishing his collected works. Michael Segre writes\n[\n15\n]\n:-\nViviani had in mind a grand edition of\nGalileo\n's works, in which the Latin works would be translated into Italian and vice versa, and throughout his life he collected an enormous quantity of material related to\nGalileo\n.... But he never brought this ambitious project to completion, mainly because he was too much of a perfectionist, never entirely satisfied with the material he had amassed and reluctant to stop collecting and begin publishing. For much the same reason, most of Viviani's own scientific work remained unpublished, and an edition of\nGalileo\n's works, as Viviani would have liked to see it, only appeared two centuries after his death, under Favaro's supervision. Favaro, however, could hardly have published his National Edition without the materials collected by Viviani.\nIn\n[\n1\n]\nNatucci suggests that it was the Church that prevented the publication of\nGalileo\n's works and caused a serious blow to science in Italy. Segre, however, counters that view when he writes\n[\n15\n]\n:-\n... the role of the church in Italy's scientific decline during this period, though no doubt major, has sometimes been exaggerated. In Viviani's case I found little evidence of interference. As early as\n1656\nhe had at his disposal enough material to publish an outstanding edition of\nGalileo\n's works, even within the limitations set by the Inquisition; his papers testify that primarily his own hesitations prevented him from completing the work.\nThroughout his life, one of Viviani's main interests was in ancient Greek mathematics. As early as\n1646\n, while collaborating with\nTorricelli\n, he was also working on a project to restore the work of\nAristaeus the Elder\n.\nPappus\ngave\nAristaeus\ngreat credit for a work entitled\nFive Books concerning Solid Loci\nwhich had been lost.\n(\nSolid Loci is the Greek term for conic sections.\n)\nPappus\n, however, indicated propositions from the work and Viviani reconstructed the original from these references by\nPappus\n. It was a project that Viviani worked on for most of his life. In\n1673\nhe published a first edition of his restoration but he continued to work on it and his final effort\nDe locis solidis secunda divinatio geometrica in quinque libros iniuria temporum amissos tristaei senioris geometrae\nⓉ\n(\nThe five books of 'Solid loci'  restored by a senior mathematician\n)\nwas only published in\n1701\n, two years before his death.\nAnother restoration of a Greek text by Viviani is interesting for a number of reasons. This was his restoration of the fifth book of\nApollonius\n's\nConics\n. At the time he began the restoration only the first four books of this eight-book work had been found and Viviani set about reconstructing the fifth. By\n1656\nViviani's work was quite close to completion when Giovanni Alfonso Borelli\n(\na fellow Tuscan Court mathematician\n)\ndiscovered an Arabic version of the first seven books of\nApollonius\n's\nConics\nin the Laurentian Library in Florence. Borelli took the manuscript to Rome where it was translated into Latin by Abrahamus Ecchellensis. In\n1659\nboth the translation from the Arabic and Viviani's restoration were published. Viviani's work was entitled\nDe maximis et minimis geometrica Divinatio\nⓉ\n(\nA divination of geometric maxima and minima\n)\nand was certainly written by him without any knowledge of the translation of\nApollonius\n's work. It is interesting, of course, to see how faithfully Viviani was able to reconstruct\nApollonius\n's book since now both the reconstruction and the original had become available. Viviani had done an excellent job, his biggest 'error' being that he had been able to penetrate deeper than\nApollonius\nhimself. The realisation that Viviani was, in some sense, a better geometer than the revered\nApollonius\n, gave him instant fame throughout the centres of learning in Europe. His reputation as a mathematician was high throughout Europe. Louis XIV of France offered him a position at the\nAcadémie Royale\nin\n1666\n, John II Casimir of Poland offered Viviani a post as his astronomer, also in\n1666\n. The Grand Duke, not wishing to lose Viviani, appointed him as his mathematician. Viviani accepted this post and turned down the offers from Louis XIV and John II Casimir.\nIn\n1657\nViviani became one of the first members of the Grand Duke's new academy, the Accademia del Cimento, which was formally founded in June of that year. However, the Academy had informally existed for some time before that with Viviani organising a group of natural philosophers to carry out a variety of scientific experiments. One such experiment, carried out before the formal founding of the Accademia del Cimento, related to the speed and propagation of sound. On\n10\nOctober\n1656\n, together with Giovanni Borelli, Viviani used a pendulum as a timing device to show that sound travels twice a fixed distance in twice the time taken to travel the original distance. In other words, its velocity is uniform. Two days later, at the palace in Florence, he measured the velocity of sound by timing, again using a pendulum, the difference between the flash and the sound of a cannon fired at the villa of Petraia. They obtained the value of\n350\nmetres per second, which is considerably better than the previous value of\n478\nmetres per second obtained by\nGassendi\n(\nthe currently accepted value is\n331\n.\n29\nmetres per second at\n0\n°C. After the Academy was formally founded, Viviani was involved in most of the experimental work they carried out, such as experiments with\nTorricelli\n's barometer and experiments relating to properties of freezing water.\nAnother important work by Viviani is\nQuinto libro degli Elementi d'Euclide: ovvero Scienza universale delle proporzioni spiegata colla dottrina del Galileo, con nuov'ordine distesa\nⓉ\n(\nFifth Book of the 'Elements' of Euclid: the universal science of proportions explained by the theory of Galileo ...\n)\n. This was another restoration, this time of\nEuclid\n's fifth book, building on work already carried out with\nTorricelli\nand\nGalileo\nin\n1641\n. In the Preface he acknowledges his great debt to\nGalileo\n, calling himself '\nGalileo\n's last disciple'\n(\nsee\n[\n4\n]\n)\n:-\nThe fact is that through my good fortune, I am his last disciple, because he was my teacher continually during the last three years of his life, and from all of us who were present while he took his last breath\n(\nwho apart from two priests, included\nTorricelli\n, his son Vincenzio Galilei, and others from his home\n)\n, I alone have survived them all.\nThe first edition was published in a short form in\n1674\n, then in an enlarged second edition was printed in\n15\nApril\n1676\n. Natucci writes\n[\n1\n]\n:-\nWith the rigour and prolixity of the ancients, Viviani devoted an appendix to geometric problems, among which was one on the\ntrisection of an angle\n, solved by the use of the cylindrical spiral or of a cycloid; another was the problem of\nduplicating the cube\n, solved by means of conics or of the cubic\nx\ny\n2\n=\nk\nxy^{2} = k\nx\ny\n2\n=\nk\n.\nHe also published\nDiporto Geometrico\nⓉ\n(\nThe pleasure of geometry\n)\n(1676)\nand\nEnodatio problematum universis geometris propositorum\nⓉ\n(\nall the problems of the geometry of the things proposed, Behold, odatio\n)\n(1677)\n. The first of these contained solutions to twelve geometrical problems which had been published as challenges by Cristoforo Sadler. It appears that Viviani found these easy and did not consider it worthwhile to publish his solutions but Prince Leopoldo, brother of the Grand Duke, had strongly encouraged him to do so. As he was an engineer all his life Viviani also published on engineering. In particular he published\nDiscorso intorno al difendersi da' riempimenti e dalle corrosione de' fiumi\nⓉ\n(\nAddress to the intorno al difendersi da 'riempimenti e dalle corrosion of the' fiumi\n)\n(1687)\n.\nWe have not yet commented on the thing for which Viviani is best known, namely his\nRacconto istorico della vita di Galileo Galilei\nⓉ\n(\nA history of Galileo\n)\n. Soon after\n1650\n, Carlo Manolessi began preparing an edition of\nGalileo\n's writings. It could never have contained all the writings since publication of\nDialogue on the Great World Systems\nwas banned by the Catholic Church, but the project tp publish the rest had widespread support. Prince Leopoldo asked Viviani to write a sketch of\nGalileo\n's life for inclusion in Manolessi's edition of his works. However, things did not go as planned for although Viviani wrote his\nLife of Galileo\nit did not appear in the edition of\nGalileo\n's\nCollected Works\npublished by Manolessi in Bologna\n1655\n-\n56\n. It would appear that Viviani, and the Medici family, felt that Manolessi's edition was not grand enough to honour\nGalileo\n. Viviani wanted to publish his own edition of\nGalileo\n's\nCollected Works\nso he kept the\nLife of Galileo\nwhich he had written intending to include it in a publication of\nGalileo\n's\nCollected Works\nwhich he hoped to edit. In\n1659\nViviani wrote a second essay on\nGalileo\n's work\nLettera di Vincenzio Viviani al Principe Leopoldo de' Medici intorno all'applicazione del pendolo all'orologio\n. Neither essay was published in Viviani's lifetime, but his\nRacconto istorico\nwas published in\n1717\n. It became the main source of material for\nGalileo\n's later biographers. However, in the\n20\nth\ncentury historians began to argue that certain details in the essay had been invented by Viviani, particularly those relating to the experiments carried out by\nGalileo\n. Viviani was certainly very careful and put in a great amount of effort collecting information about\nGalileo\n's life. If he did invent certain incidents, such as\nGalileo\ndropping weights from the leaning tower of Pisa, then they were done to illustrate\nGalileo\n's approach to science. See\n[\n15\n]\nfor an interesting detailed discussion.\nDespite his great expertise in geometry, Viviani seems to have done little original in this area, He did determine the\ntangent\nto the cycloid but he was not the first to succeed in this. He believed passionately in the value of geometry, however, writing:-\nSpeculative geometry is the unique teacher of the honest acquisition of what is useful, delightful, beautiful and good. Geometry is the only true science because it produces knowledge from itself without mediation of causes. Geometry alone teaches how to achieve knowledge and even reminds the human intellect - which is a spark of the divine one - that as a knower through the principles most known with the light of nature it can, if it so wishes, without deceiving itself or others, know the existence and properties of all things concerning the created universe and the order disposed by God, in number, weight, and measure.\nHowever, he lived at a time when the calculus was beginning to be used to prove geometric results.\nLeibniz\nwas interested in the papers left by\nGalileo\nand met Viviani in Florence in late November\n1689\n. The two got on well during this meeting but after\nLeibniz\npublished\nSolutio problematis a Galilaeo propositi de linea catenaria\nⓉ\n(\nA solution to a problem posed by Galileo on the catenary\n)\nin\n1692\n, Viviani became unhappy about the use of the differential and integral calculus which he believed to be nothing but a kind of game that could only solve its own problems. For this reason, in\n1692\n, he challenged European mathematicians to solve a problem of the quadrature of a part of the surface of a sphere. In\nAenigma geometricum de miro opificio testudinis quadrabilis hemisphaericae\nⓉ\n(\nThe geometric problem of finding the area of a hemisphere intersected with a cylinder\n)\nhe asked how four equal windows could be cut from a hemisphere so that the remaining surface can be exactly squared. His solution involved using the intersection of four right cylinders, the bases of which are tangent to the base of the hemisphere. See\n[\n12\n]\nfor a discussion of this problem.\nWe note also that Viviani published an Italian version of\nEuclid\n's\nElements\nin\n1690\n. This was reprinted in\n1867\nby\nEnrico Betti\nand\nFrancesco Brioschi\nwho, at that time, were trying to improve the teaching of geometry in Italy. On his death Viviani left an almost completed work on the resistance of solids which was completed and published by\nGuido Grandi\n.\nBernard de Fontenelle\n[\n7\n]\nsays that Viviani had an innocence and simplicity of manners which persons commonly preserve who have less commerce with men than with books. He was affable, modest, grateful in the highest degree, and a fast and faithful friend.\nViviani built a handsome house in Florence, and placed the bust of\nGalileo\nover the door, with inscriptions on each side of it, to honour his name. This house was commonly called '\nGalileo\n's house' although this is incorrect. The inscriptions are given in the article\n[\n16\n]\n.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}