{
  "nome_completo": "Vitaly Vitalievich Fedorchuk",
  "nome_curto": "Vitaly Vitalievich Fedorchuk",
  "ano_nascimento": "1942",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fedorchuk/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": "Moscow, Russia",
  "biografia": "It is claimed in\n[\n3\n]\nthat\nVitaly Vitalievich Fedorchuk\nwas the son of Vitaly Vasilyevich Fedorchuk. Vitaly Vasilyevich Fedorchuk\n(1918\n-\n2008)\nwas born into a family of farmers in Ukraine, studied at a military school, and served in Ukraine with Smersh, the military counterintelligence service, from\n1943\nto\n1947\n. At this time he became known as \"the butcher of the Ukraine\". He later served as chairman of the K.G.B. for a short time in\n1982\nand was then Interior Minister from\n1982\nto\n1986\n. We are unable to confirm from any independent sources that the mathematician Vitaly Vitalievich Fedorchuk, the subject of this biography, was his son. There are several obituaries of Vitaly Vasilyevich Fedorchuk\n(\nsee for example\n[\n2\n]\n)\nbut none of these tell us he had a son who became a mathematician. However, given that Vitaly Vasilyevich Fedorchuk worked for Smersh and the K.G.B. it is quite believable that his son's existence would be kept a secret.\nVitaly Fedorchuk, the subject of this biography, entered Moscow State University in\n1959\n. He completed his undergraduate course in\n1964\nand, after this, remained at Moscow State University, undertaking research advised by\nPavel Sergeevich Aleksandrov\n. He was awarded his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nin\n1967\nfor his thesis\nPerfect Irreducible Mappings of Topological Spaces and q-proximities\n(\nRussian\n)\n. Fedorchuk began research while an undergraduate and published\nOn w-mappings of paracompact spaces\n(\nRussian\n)\nin\n1963\n. In this paper he gave variations on\nHugh Dowker\nand Arthur Harold Stone's results concerning conditions under which a\nHausdorff\nspace is paracompact. While undertaking research, Fedorchuk published\nOrdered sets and the product of topological spaces\n(\nRussian\n)\n(1966)\nand\nOrdered spaces\n(\nRussian\n)\n(1967)\n. He published a short paper giving results from his thesis in\n1967\nwhich was reviewed by D V Thampuran who writes:-\nIn this paper the author introduces the concept of a q-space, which is a generalization of proximity spaces. A q-space is defined on a regular space by a binary relation q which satisfies conditions similar to those of a proximity space. A q-space is consistent with a completely regular space. The relationship between q-spaces on a regular space X and bicompact extensions of all its perfect irreducible inverse mappings is given.\nThis paper only contained announcements of the results and Fedorchuk published the proofs in his paper\nPerfect irreducible mappings and generalized proximities\n(\nRussian\n)\n(1968)\n. The paper\nOrdered spaces\n(\nRussian\n)\n(1967)\nwhich we mentioned above, also only announced results and proofs of the theorems stated in that paper appeared in\nOrdered proximity spaces\n(\nRussian\n)\n(1968)\n.\nFedorchuk worked at Moscow State University and in\n1977\nhe defended his doctoral thesis\n(\nequivalent in standard to the\nhabilitation\nor D.Sc.\n)\nInverse spectra of topological spaces and some problems of\ngeneral topology\nrelated to dimension and cardinal functions\n. He became head of the General Topology and Geometry department at Moscow State University in\n1982\nand, beginning in the following year, he also ran\nP S Aleksandrov\n's research seminar on general topology. An overview of his research contributions is given in\n[\n1\n]\n:-\nThe scientific work of Vitaly Fedorchuk covers various areas of topology and has found applications in\nfunctional analysis\n, differential geometry,\nmeasure theory\nand\nprobability theory\n. Fedorchuk's constructions and concepts have become important tools of research. His main scientific interests were general topology, manifolds and cell complexes, and algebraic topology. Fedorchuk is the author of\n173\nscientific papers and books on various aspects of dimension theory, uniform topology, extensors, the theory of covariant functors, the theory of infinite-dimensional spaces and manifolds.\nHe co-authored a number of books written at various different levels. With Boris A Pasynkov he published\nTopology and dimension theory\n(\nRussian\n)\n(1984)\n. Although this short\n63\n-page booklet was written jointly, in fact the two authors wrote different parts of the text. Fedorchuk wrote a survey of the basic notions and theorems of the theory of metric spaces\n(\npresented in Section\n2)\nand topological spaces\n(\npresented in Sections\n4\nand\n5)\n, as well as a survey of dimension theory\n(\npresented in Section\n6)\n. The rest of the book was written by Pasynkov as an introduction to Fedorchuk's sections. In\n1989\nhe produced another booklet, this time co-authored with Vladimir V Filippov, entitled\nTopology of hyperspaces and its applications\n(\nRussian\n)\n. Despite the subject appearing to be quite advanced, the authors aimed the booklet to be:-\n... within the reach not only of beginning university students, but also of older secondary school students interested in mathematics.\nReviewing the booklet, Roman Duda writes:-\nIt starts leisurely with the notion of topological metric spaces and their hyperspaces consisting of closed subsets\n(\nwith the\nHausdorff\ndistance or\nVietoris\ntopology\n)\n, but then gathers momentum as it runs through function spaces\n(\nmetric of uniform convergence, compact-open topology, linear spaces, norm\n)\n, exponential functors\n(\nincluding parts on connectedness and symmetric products\n)\n, multivalued mappings\n(\nwith semicontinuities, selections, retractions\n)\n, probability measures, spaces of partial mappings, axiomatization of solution spaces for an ordinary differential equation\n(\nwith a digression on optimal control\n)\n, and autonomous spaces. The contents are extensive and logically nicely ordered, and the language is clear and precise. However, the reader's attention is turned only to the conceptual build-up, while proofs and references are completely omitted. As a result, a mature mathematician can perhaps read this text with some pleasure as a sort of a survey, but one may doubt what profit can be gained by a beginner reading about, e.g., the\nRiesz\ntheorem on a measure representation of a functional, or the\nPoincaré\n-\nBendixson\ntheorem on curves without self-intersections - without much explanation and no indication of where to turn for further details.\nFinally, we mention his research monograph\nAbsolute retracts and infinite-dimensional manifolds\n(\nRussian\n)\n(1992)\nco-authored with Alex Chigogidze. This book surveys all the developments in infinite-dimensional manifolds from the time the theory began to be studied in the\n1960\ns up to the time that the book was written:-\nThe authors often discuss proofs, emphasizing strategy and methods, and in many cases provide technical details. They also discuss the sources and give a bibliography of over\n200\nentries.\nJan van Mill, who was working at the Vrije University in Amsterdam, describes an interesting interaction with Fedorchuk in\n[\n3\n]\n. Van Mill received an email from Fedorchuk in the spring of\n1999\nasking if he could send him a proof of an assertion that appeared in the\n1941\nbook\nDimension Theory\nby\nWitold Hurewicz\nand Henry Wallman. After attempting a proof and having failed, van Mill replied to Fedorchuk explaining he had tried but failed to prove the assertion. Fedorchuk wrote back saying he was in a similar position. After further exchanges of emails in which they told each other about finding the same assertion in several books and papers but always without a proof, Fedorchuk asked van Mill if he could arrange for him to visit Amsterdam where they could work together on the problem. The visit was arranged for\n1\nto\n15\nMay\n1999\n. Van Mill writes:-\nA few weeks before his visit, I began to think seriously about the problem. And when I picked him up from Schiphol Airport on\n1\nMay\n1999\n, I was in a state of great excitement. When we saw each other, I said to him before shaking hands: \"Vitaly, I can do it!\" He replied: \"Jan, I can do it too\". ... On\n11\nMay\n1999\nVitaly spoke at the topology seminar at the University of Amsterdam on dimension theory. Two weeks later, I talked about our joint success that we later published in 'Fundamenta Mathematicae'.\nTheir joint paper was entitled\nDimensionsgrad for locally connected Polish spaces\nand it was published in\n2000\n. The authors summary is:-\nIt is shown that for every\nn\n≥\n2\nn ≥ 2\nn\n≥\n2\nthere exists an\nn\nn\nn\n-dimensional locally connected Polish space with Dimensionsgrad\n1\n.\nWe note that 'Dimensionsgrad' was a dimension function due to\nL E J Brouwer\nwhich was based on ideas of\nHenri Poincaré\n. In their paper, Fedorchuk and van Mill write:-\nIn\n1913\n,\nBrouwer\npresented the first definition of a dimensional invariant intended for Polish spaces without isolated points\n(\nin the terminology of his days: normal sets in the sense of\nFréchet\n)\n. He called it \"Dimensionsgrad\".\nIn this paper Fedorchuk thanked:-\n... the Division of Mathematics and Computer Science of Vrije Universiteit for generous hospitality and support.\nLet is end our biography by quoting the authors of\n[\n1\n]\nwho write:-\nFedorchuk devoted much time and energy to the organization of the educational and scientific processes at Moscow State University, being a member of the Academic Board of the university and the Academic Council of the Mechanics and Mathematics Faculty. In\n2006\n, Vitaly Vitalievich Fedorchuk was awarded the title of Honorary Professor at Moscow State University. From\n2008\nuntil his death he was the director of the Baku branch of Moscow State University.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}