{
  "nome_completo": "Vladimir Aleksandrovich Fock",
  "nome_curto": "Vladimir Aleksandrovich Fock",
  "ano_nascimento": "1898",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fock/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Vladimir Aleksandrovich Fock\n's father, Aleksandr A Fock, undertook research on the growing and tending of trees. Aleksandr Fock was later employed as an inspector of forests in the south of Russia. Vladimir Aleksandrovich Fock attended school in St Petersburg but before he finished his high school studies, World War I broke out in\n1914\n. At this time St Petersburg was renamed Petrograd so when Fock completed his school education in\n1916\nit was the department of Physics and Mathematics of Petrograd University that he entered. Shortly after beginning his university course Fock volunteered for the army so that he could fight for his country. He was given a short course on artillery and then sent to fight as an artillery officer on the front. He survived World War I and, after being demobilised from the army in\n1918\n, he returned to Petrograd University to continued his studies.\nCertainly this was a dramatic period for Fock for not only was there the economic devastation caused by World War I, but by\n1918\nRussia was in the middle of a civil war following the Russian Revolution which began in\n1917\n. However in\n1919\na new State Optical Institute was opened in Petrograd and a special group of students was formed in an effort to make sure that the very brightest students could still get a good education despite the chaotic situation in the country. Fock was, of course, one of the most outstanding of all the students and was in this special group. Fock had already published two papers, one on quantum mechanics and one on mathematical physics, before he graduated from Petrograd University in\n1922\n. He remained at the university to prepare for becoming a university professor.\nSchrödinger\npublished his two fundamental papers on quantum theory in the spring of\n1926\nand Fock immediately started to develop the ideas and by the end of the year two of his own important papers on the\nSchrödinger\nequation had been published. This led to the importance of his work being widely recognised and as a result he was awarded a Rockefeller grant to allow him to spend a year studying in Göttingen and Paris. He became interested in the geometrization of the\nDirac\nequation and he published an important paper in\n1928\non\nDirac\n's work on distributions. In\n1932\nhe was appointed as Professor of Theoretical Physics at Leningrad  University. In fact, of course, he was still in St Petersburg but the city\n(\nand university\n)\nhad undergone a further name change and after being known as Petrograd  for ten years became Leningrad in\n1924\n. Also in\n1932\nFock was elected a corresponding member of the\nUSSR Academy of Sciences\n. This academy, based in St Petersburg, had also undergone various name changes and from\n1917\nto\n1925\nhad been known as the Russian Academy of Sciences. Further in\n1932\nFock published an important paper with Podolsky and\nDirac\non quantum electrodynamics in which the concept of multiple time formalism was introduced, and in the same year Fock introduced the concept of the Fock space in another classical paper.\nDespite Fock's great scientific achievements, the\n1930\ns proved extremely difficult time for him. The editors of\n[\n1\n]\nwrite in the Preface:-\n[\nFock\n]\ndid not escape\n(\nfortunately, short\n)\narrests during the\n1930\ns.\n[\nHe\n]\nwas not afraid to advocate for his illegally arrested colleagues and actively confronted the ideological attacks on physics at the Soviet time.\nDaniele Oriti reviewing\n[\n1\n]\nnotes the highlights of Fock's work including in the\n1930\ns:-\n... the fundamental paper of\n1935\nin which the full symmetry structure of the hydrogen atom energy levels was shown to be given by the full\nLorentz\ngroup; and the\n1937\npaper on the proper time parametrization of the Dirac equation, seminal for the later development of\nSchwinger\n's theory of field propagators and for the whole subject of parametrised field theories.\nFock had strong views on general relativity which he interpreted somewhat differently from\nEinstein\n. He set out these views clearly in his textbook\nTheory of space, time and gravitation\npublished in\n1955\n. In a review of the book Freeman\nDyson\nsets out Fock's views as well as adding his own thoughts on them. We quote parts of\nDyson\n's review:-\nThis book has two quite separate aspects. First, it is a text-book for the use of graduate students in theoretical physics, giving a complete exposition of the theories of special and general relativity. Second, it is an eloquent and at times somewhat polemical plea for an unorthodox interpretation of\nEinstein\n's theory of gravitation. ...\n[\nFock\n]\nviolently objects to the \"principle of equivalence\" which\nEinstein\nregarded as the corner-stone of the theory. He objects to the notion that invariance under general coordinate transformations is a property of the physical universe. He regards this invariance as merely a property of the mathematical symbolism, which it may be sometimes convenient to maintain and sometimes inconvenient. He objects to the use of the name \"general relativity\" for\nEinstein\n's theory of gravitation. He defines \"relativity\" to mean an invariance in the description of nature as viewed from different physical observation-points\n(\nnot coordinate-systems\n)\n. In this sense the gravitation theory contains less relativity than what is usually called \"special relativity\", and not more. So he vehemently insists that we call \"special relativity\" \"relativity\", and \"general relativity\" \"gravitation theory.\" ...\nThe reviewer's\n[\nDyson\n's\n]\nopinion is that the author\n[\nFock\n]\nhas a good case but has overstated it. It may well be true that general coordinate invariance has meaning only locally. But the most important consequence of general invariance is the existence of local conservation laws for energy and momentum, and these are valid whether general invariance holds in the large or not. The reviewer feels that the author has made a major contribution to the understanding of gravitation theory, especially by his insistence on studying the solutions of the field equations and not merely the formal properties of the equations. The future will probably confirm the validity both of the author's point of view and of\nEinstein\n's, each in its proper sphere.\nFock's name is attached to a large number of concepts and results. Some we have mentioned but now let us list a few: Fock space; Fock vacuum; the Fock method of quantisation; the Fock proper time method; the\nHartree\n-Fock method; Fock symmetry; the\nKlein\n-Fock-Gordon equation; the Fock-Krylov theorem; and\nDirac\n-Fock-Podolsky formalism.\nLet us end this biography by quoting the final paragraphy from Oriti's review of\n[\n1\n]\n:-\nThis publication is of the highest value from both a scientific and a historical point of view. Most of these papers are true classic works that even now maintain their original interest; even the reader who is well acquainted with the results presented in them may benefit from the clarity of the original presentation. The articles presented also possess a great historical value, most of them representing important steps in the development of quantum mechanics and quantum field theory during the first half of last century, and should be subject to careful and detailed analysis from historians of science.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}