{
  "nome_completo": "Vladimir Igorevich Arnold",
  "nome_curto": "Vladimir Arnold",
  "ano_nascimento": "1937",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arnold/",
  "lugar_nascimento": "Odessa, USSR (now Ukraine)",
  "lugar_morte": "Paris, France",
  "biografia": "Vladimir Arnold\n's parents were Igor Vladimorovich Arnold and Nina Alexandrova Isakovich. Several generations of Arnold's family had been scientists. His interest in mathematics began when he was as young as five years old. He explained that this was a consequence of the Russian mathematical tradition\n[\n4\n]\n:-\nVery young children start thinking about\n[\nold merchant\n]\nproblems even before they have any knowledge of numbers. Children five to six years old like them very much and are able to solve them, but they may be too difficult for university graduates, who are spoiled by formal mathematical training. ... Many Russian families have the tradition of giving hundreds of\n[\nmathematical\n]\nproblems to their children, and mine were no exception.\nWhen he was twelve years old he was given challenging problems by his schoolteacher. He quoted one such problem in\n[\n4\n]\n:-\nTwo old women started at sunrise and each walked as a constant velocity. One went from A to B and the other from B to A. They met at noon and, continuing with no stop, arrived respectively at B at\n4\np.m. and at A at\n9\np.m. At what time was sunrise on this day?\nArnold said:-\nI spent a whole day thinking on this oldies, and the solution ... came as a revelation. The feeling of discovery I had then was exactly the same as in all the subsequent much more serious problems ...\nHe entered Moscow State University in\n1954\nas an undergraduate student in the Faculty of Mechanics and Mathematics. He was awarded his first degree in\n1959\nwith a dissertation\nOn mappings of a circle to itself\nwritten with\nKolmogorov\nas advisor. Speaking of his undergraduate years he said\n[\n4\n]\n:-\nThe constellation of great mathematicians in the same department when I was studying at the Faculty of Mechanics and Mathematics was really exceptional, and I have never seen anything like it at any other place.\nKolmogorov\n,\nGelfand\n,\nPetrovsky\n,\nPontryagin\n,\nP Novikov\n,\nMarkov\n,\nGelfond\n, Lusternik,\nKhinchin\nand\nP S Aleksandrov\nwere teaching students like\nManin\n,\nSinai\n,\nSergi Novikov\n, V M Alexeev,\nAnosov\n,\nA A Kirillov\n, and me. All these mathematicians were so different! It was almost impossible to understand\nKolmogorov\n's lectures, but they were full of ideas and were really rewarding! ...\nPontryagin\nwas already very weak when I was a student at the Faculty of Mechanics and Mathematics, but he was perhaps the best of the lecturers.\nArnold continued to study as a postgraduate student at Moscow State University for his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nstill with\nKolmogorov\nas advisor. He was awarded the degree in\n1961\nby the Institute of Applied Mathematics in Moscow for his thesis\nOn the representation of continuous functions of\n3\nvariables by the superpositions of continuous functions of\n2\nvariables\n. The examining committee for the thesis, which contained a solution to\nHilbert\n's\n13\nth\nproblem, consisted of A G Vitushkin and\nL V Keldysh\n. Following this he was appointed as an assistant in the Faculty of Mechanics and Mathematics at Moscow State University. He continued to work towards his doctorate\n(\nequivalent to the\nhabilitation\n)\nand this was awarded by the Institute of Applied Mathematics in Moscow in\n1963\nfor the thesis\nSmall denominators and stability problems in classical and celestial mechanics\n. He was examined by\nN N Bogolyubov\n, V M Volosov, and G N Duboshin. Following the award, Arnold was promoted.\nIn\n1965\nArnold became a Professor in the Faculty of Mechanics and Mathematics at Moscow State University, a position he held until\n1986\nwhen he took up the position of Principal Researcher at the\nSteklov\nInstitute of Mathematics in Moscow. In addition to his Russian positions, in\n1993\nhe was appointed Professor at the University Paris-Dauphine in France. He held this position until\n2005\n. Arnold married Voronina Elionora Aleksandrova in\n1976\n; they had one son.\nAn excellent overview of Arnold's contributions is given in the citation for the Wolf Prize awarded to him in\n2001\n:-\nVladimir I Arnold has made significant contributions to an astounding number of different mathematical disciplines. His many research papers, books, and lectures, plus his enormous erudition and enthusiasm, have had a profound influence on an entire generation of mathematicians. Arnold's Ph.D. thesis contained a solution to\nHilbert\n's\n13\nth\nproblem. His work on Hamiltonian dynamics, which includes cocreation of KAM\n(\nKolmogorov\n- Arnold- Moser\n)\ntheory and the discovery of \"Arnold diffusion\", made him world famous at an early age. Arnold's contributions to the theory of singularities complement\nThom\n's catastrophe theory and have transformed this field. Arnold has also made innumerable and fundamental contributions to the theory of differential equations, symplectic geometry, real\nalgebraic geometry\n, the calculus of variations, hydrodynamics, and magneto- hydrodynamics. He has often discovered links between problems in diverse areas.\nIndeed the number of different disciplines in which Arnold has worked is truly astounding. The areas are\nDynamical Systems\n, Differential Equations, Hydrodynamics, Magnetohydrodynamics, Classical and Celestial Mechanics, Geometry, Topology, Algebraic Geometry, Symplectic Geometry, and Singularity Theory.\nLet us also indicate the range of the books referred to in this citation. He published\nProblèmes ergodiques de la mécanique classique\nⓉ\n(\nErgodic problems of classical mechanics\n)\n(\nwith A Avez\n)\n(1967)\n,\nOrdinary differential equations\n(\nRussian\n)\n(1971)\n,\nMathematical methods of classical mechanics\n(\nRussian\n)\n(1974)\n,\nSupplementary chapters to the theory of ordinary differential equations\n(\nRussian\n)\n(1978)\n,\nSingularity theory\n(1981)\n,\nSingularities of differentiable mappings\n(\nRussian\n)\n(\nwith A N Varchenko and S M Gusein-Zade\n)\n(1982)\n,\nCatastrophe theory\n(1984)\n,\nHuygens and Barrow, Newton and Hooke\n(\nRussian\n)\n(1989)\n,\nContact geometry and wave propagation\n(1989)\n,\nSingularities of caustics and wave fronts\n(1990)\n,\nThe theory of singularities and its applications\n(1991)\n,\nTopological invariants of plane curves and caustics\n(1994)\n,\nLectures on partial differential equations\n(\nRussian\n)\n(1997)\n,\nTopological methods in hydrodynamics\n(\nwith B A Khesin\n)\n(1998)\n, and\nArnold problems\n(\nRussian\n)\n(2000)\n.\nSerge L Tabachnikov reviewing the last mentioned book gives details of Arnold's Seminar:-\nMathematical life in the Soviet Union, in particular in Moscow, was famous for its seminars: the seminars of\nGelfand\n,\nSinai\n,\nKirillov\n,\nManin\n,\nNovikov\n, to mention just a few. Most of these seminars met weekly for two hours, in late afternoon. One of the most celebrated ones is Arnold's seminar, existing for more than\n30\nyears. For a number of very well-known mathematicians this seminar was a formative experience. Every semester, the opening meeting of the seminar was devoted to open problems. Arnold discussed about a dozen research problems with detailed comments. Many of these problems were later solved\n(\nor partially solved\n)\nby participants of the seminar. According to Arnold, the half-life of a problem is seven years. Many seminar participants are Arnold's graduate students. His philosophy is that a student should learn from his teacher that a certain problem is open; the choice of a particular research problem is then up to the student\n(\nto quote from Arnold's Preface: \"To choose a problem for him is like choosing a bride for one's son\"\n)\n.\nArnold has been honoured throughout the world. He has been elected to membership of the\nLondon Mathematical Society\n(1976)\n, the\nNational Academy of Sciences\nof the United States\n(1983)\n, the\nAcademy of Sciences of Paris\n(1984)\n, the\nAcademy of Arts and Sciences\nof the United States\n(1987)\n, the\nRoyal Society of London\n(1988)\n,\nAccademia Nazionale dei Lincei\nin Rome\n(1988)\n, the\nRussian Academy of Sciences\n(1990)\n, the American Philosophical Society\n(1990)\n, the Academy of Natural Sciences of Russia\n(1991)\n, and the Academia Europaea\n(1991)\n. He has received many prizes, for example the Young Mathematicians Prize of the\nMoscow Mathematical Society\n(1958)\n, the Lenin Prize\n(\nwith\nAndrei Kolmogorov\n)\n(1965)\n, the Crafoord Prize of the\nSwedish Academy of Sciences\n(\nwith\nLouis Nirenberg\n)\n(1982)\n, the\nLobachevsky\nPrize of\nRussian Academy of Sciences\n(1992)\n, the Harvey Prize, Technion, Haifa, Israel\n(1994)\n, the Petr L Kapitsa Medal for Scientific Discoveries, Russian Academy of Natural Sciences\n(1997)\n, Dannie Heineman Prize for Mathematical Physics\n(2001)\n, Prize of the American Institute of Physics\n(2001)\n, and the Wolf Prize in Mathematics\n(2001)\n.\nThe Harvey Prize was awarded:-\n... In recognition of his basic contribution to the stability theory of Dynamical Systems, his pioneering work on singularity theory and seminal contributions to analysis and geometry.\nThe Wolf Prize was awarded:-\n... for his deep and influential work in a multitude of areas of mathematics, including dynamical systems, differential equations, and singularity theory.\nIn addition to these honours, Arnold has been awarded honorary degrees from the University P and M Curie, Paris\n(1979)\n, Warwick University, Coventry\n(1988)\n, Utrecht University, Netherlands\n(1991)\n, University of Bologna, Italy\n(1991)\n, University Complutense, Madrid\n(1994)\n, and the University of Toronto, Canada\n(1997)\n.\nArnold is openly critical of the education system of many countries. For example in\n[\n4\n]\nhe pokes fun at education in the United States:-\nRecently, even the National Academy of Sciences decided that scientific education in America should be enhanced. What they propose is to eliminate from the curriculum unnecessary scientific facts too difficult for American children and replace them by really fundamental basic knowledge, such as all objects have properties and all organisms have nature! Undoubtedly they will go far with this! Two years ago, I read in USA Today that American parents have formed a list of really necessary knowledge for children of each age category. At ten they have to know that water has two phases, and at fifteen that the moon has phases and rotates round the earth. In Russia we still teach children in primary school that water has three phases, but the new American culture will undoubtedly win in the near future. There are, however, some remarkable advantages in the free American system, where a high school student may take, say, a course on the history of jazz instead of algebra.\nArnold has also been critical of the French education system. In an address on teaching of mathematics, given in the Palais de Découverte in Paris on\n7\nMarch\n1997\n, he said:-\nTo the question \"what is\n2\n+\n3\n\" a French primary school pupil replied: \"\n3\n+\n2\n, since addition is commutative\". He did not know what the sum was equal to and could not even understand what he was asked about! Another French pupil\n(\nquite rational, in my opinion\n)\ndefined mathematics as follows: \"There is a square, but that still has to be proved\". Judging by my teaching experience in France, the university students' idea of mathematics\n(\neven of those taught mathematics at the École Normale Supérieure - I feel sorry most of all for these obviously intelligent but deformed kids\n)\nis as poor as that of this pupil. Mentally challenged zealots of \"abstract mathematics\" threw all the geometry\n(\nthrough which connection with physics and reality most often takes place in mathematics\n)\nout of teaching. Calculus textbooks by\nGoursat\n,\nHermite\n,\nPicard\nwere recently dumped by the student library of the Universitiés Paris\n6\nand\n7\n(\nJussieu\n)\nas obsolete and, therefore, harmful\n(\nthey were only rescued by my intervention\n)\n.\nArnold reached\n65\nyears of age in\n2002\nand the Moscow Mathematical Journal devoted two issues to papers dedicated to celebrate the occasion. The editors of the Journal wrote an introduction and the quote we give from that forms a fitting end to this biography:-\nArnold is one of the very best mathematicians of the world, one of the founders of the Independent University of Moscow, president of its Board of Trustees and its Scientific Committee, member of our Editorial Board. The face of modern mathematics would be unrecognisable without his work in dynamical systems, classical and celestial mechanics, singularity theory, topology, real and complex algebraic geometry, symplectic and contact geometry, hydrodynamics, variation calculus, differential geometry, potential theory, mathematical physics, superposition theory, etc.\nArnold is a rare teacher, his school is famous and numerous, he has a special gift for finding new beautiful problems to interest and involve young researchers. He is an extraordinary lecturer at all levels of mathematical education and research. Difficult modern theories become quite clear and simple in his exposition. One could hardly imagine modern mathematical education without his brilliant textbooks. The Moscow mathematical school owes a lot to his seminar.\nComing from a family of scientists in several generations, he brings together their scientific approach and deep interest to all sides of the life, his knowledge being extremely vast and his curiosity towards everything around him quite amazing.\nArnold was awarded the State Prize of the Russian Federation\n(2007)\n, and in the following year he received the prestigious Shaw Prize in mathematical sciences. The Shaw Prize was awarded in equal shares to Vladimir Arnold and\nLudwig Faddeev\n:-\n... for their widespread and influential contributions to Mathematical Physics.\nThe Press Release for the award of the Shaw Prize begins:-\nVladimir Arnold, together with Andrei Kolmogorov and Jurgen Möser, made fundamental contributions to the study of stability in dynamical systems, exemplified by the motion of the planets round the sun. This work laid the foundation for all subsequent developments right up to the present time. Arnold also produced extremely fruitful ideas, relating classical mechanics to questions of topology. This includes the famous \"Arnold Conjecture\" which has only recently seen important progress. In classical hydrodynamics the basic equations of an ideal fluid were derived by Euler in\n1757\nand major steps towards understanding them were taken by Helmholtz in\n1858\n, and Kelvin in\n1869\n. The next significant breakthrough was made by Arnold a century later and this has provided the basis for more recent work. ...",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}