{
  "nome_completo": "Vladimir Gershonovich Drinfeld",
  "nome_curto": "Vladimir Drinfeld",
  "ano_nascimento": "1954",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Drinfeld/",
  "lugar_nascimento": "Kharkov, Ukraine",
  "lugar_morte": null,
  "biografia": "Vladimir Drinfeld\nwas born into a Jewish mathematical family. He was the son of the mathematics professor Gershon Ikhelevich Drinfeld\n(29\nFebruary\n1908\n-\n18\nAugust\n2000)\nand his wife, the classical philologist Frida Iosifovna Lutskaya-Litvak\n(1921\n-\n2011)\n. Since Vladimir's father was a professor of mathematics at Kharkov University, we shall give some details of his life before giving biographical details of his son Vldimir.\nGershon Ikhelevich Drinfeld was born in Starokostiantyniv, Ukraine and showed remarkable mathematical talents from a young age. His teacher, Pavel Maksimovich Semenov, taught through the civil war and encourage Gershon Ikhelevich's passion for mathematics in every possible way. After graduating from seven-year school in\n1922\n, G I Drinfeld was a shoemaker's apprentice and a sawmill worker before he entered Kiev University\n(\nthen the Kiev Institute of Public Education\n)\nin\n1927\n. There he was taught by Mikhail Pylypovych Kravchuk\n(1892\n-\n1942)\nwho invited him to take part in his seminar and introduced him to independent scientific work. His research was supervised by\nGeorgii Vasilovich Pfeiffer\nand he graduated from the Kiev Institute in\n1931\n. He became head of the Mathematics Department at Kharkov University from\n1944\nto\n1962\nbut during World War II he worked for the Academy of Sciences of the Ukrainian SSR which was evacuated to Bashkiria. By\n1950\nhe was deputy director of the Kharkov Institute of Mathematics but it was closed in that year on the orders of Stalin. Gershon Drinfeld also played a major role in the\nKharkov Mathematical Society\n. He worked on differential geometry, particularly on measure theory and integration.\nVladimir Drinfeld was a child prodigy and\nSvetlana Jitomirskaya\nsaid he\n[\n6\n]\n:-\n... could do maths at age six that really made people's jaws drop.\nDrinfeld studied at Kharkov Physics and Mathematics School no.\n27\n, a specialised school for talented pupils, and his mathematical career started while he was at this school\n(\n[\n20\n]\nor\n[\n21\n]\n)\n:-\nDrinfeld has written his first published paper when he was a schoolboy. He proved there a nice result in the style of\nHardy\n's classic treatise \"Inequalities\" and solved a problem to which\nR A Rankin\ndevoted two notes. This paper still makes interesting reading.\nHe submitted this paper,\nA cyclic inequality\n(\nRussian\n)\n, to\nMatematicheskie Zametki\non\n24\nNovember\n1969\n. It was published in February\n1971\nand, in the same year, an English translation was published in\nMaths Notes\n.\nIn\n1969\n, at the age of fifteen, he represented the Soviet Union at the International Mathematical Olympiad in Bucharest, Romania, and was awarded a gold medal after obtaining full marks, namely\n40\npoints - an incredible achievement. At that time, he was the youngest competitor to achieve the highest score but three others have achieved this since. He studied at Moscow State University from\n1969\nuntil\n1974\n. We note that he was only fifteen years of age when he entered the university. In the interview\n[\n19\n]\nhe spoke about the difficulties of being a Jew in the USSR at this time:-\n... for many years\n(\nroughly\n1948\n-\n1987)\nanti-Semitism was the\n(\nunpublicised\n)\ngovernment policy, and not the initiative of individuals. The rector of Moscow State University\nI G Petrovsky\nand many others resisted this policy\n(\nthis required a lot of effort from them\n)\n. On the other hand, there were influential mathematicians\n(\nfor example, the then director of the\nSteklov\nInstitute\n)\nwho added their personal anti-Semitism to the state one.\nHe graduated in\n1974\nand remained at Moscow State University to undertake research under\nYuri Ivanovich Manin\n's supervision. Ginzburg writes\n[\n10\n]\n:-\n[\nDrinfeld's\n]\nvision of mathematics was, to a great extent, influenced by\nYu I Manin\n, his advisor, and by the Algebraic Geometry Seminar\n(\nManin\n's Seminar\n)\nthat functioned with regularity at Moscow State University for about two decades.\nDrinfeld completed his postgraduate studies in\n1977\nand he defended his \"candidate\" thesis in\n1978\nat Moscow University. The \"candidate\" thesis is the Russian equivalent of the British or American Ph.D. We note that by\n1978\n, Drinfeld had thirteen papers in print and had proved remarkable results concerning the\nLanglands\nconjectures. Despite being extraordinarily talented, however, it was difficult for Drinfeld to obtain a position in Moscow. There were basically two reasons for this. Certainly his Jewish origins meant that he suffered from anti-Semitism, as he himself described in the above quote, but officially the Soviet Union operated a policy that people had their addresses in their passports and were only allowed to work in the town which appeared in this address. Since the address which was in Drinfeld's passport was not Moscow, he could not get a job there. He went to Ufa, an industrial centre in the Ural mountains, where he obtained a position teaching mathematics at Bashkir University, one of several universities in the city. In\n1981\nhe moved to Kharkov and lived with his parents. He obtained a position working at the B I Verkin Physical Engineering Institute of Low Temperatures, part of the National\nUkrainian Academy of Sciences\n, in Kharkov. This required much effort from several colleagues\n[\n19\n]\n:-\nI ultimately survived thanks to the fact that in\n1981\nI was hired at the Kharkov Institute of Low Temperatures. It was not easy: although\nV A Marchenko\nand other mathematicians from this institute wanted to take me, and the director of the institute B I Verkin was not against it, but a letter from\nN N Bogolyubov\nto the director was also needed in order to protect Verkin from the all-powerful regional committee of the CPSU\n(\nand to organise\nBogolyubov\n's letter, it took the efforts of my scientific supervisor\nYu I Manin\nand other people\n)\n.\nThe appointment, however, had its problems\n[\n19\n]\n:-\nWhile working at the Institute of Low Temperatures, we had to work on a collective farm in the summer\n(\nin\n1984\nthis had to be done for\n40\ndays\n)\n. This was difficult for me for two reasons. Firstly, I'm not physically strong, and secondly, it was just annoying: I have my own mathematics lesson plan, and the regional committee secretary calls the institute and, well, I think the experimental scientists were as infuriated by all this as I was.\nDrinfeld gave an important lecture at the International Congress of Mathematicians in Berkeley in\n1986\n. Entitled\nQuantum groups\n, the talk reviewed the results obtained by Drinfeld and M Jimbo on\nHopf\nalgebras\n(\nquantum groups\n)\n. He discussed the concepts of quantum groups and quantisation, and also talked about\nPoisson\ngroups,\nLie\nbi-algebras and the classical Yang-Baxter equation. The talk began as follows:-\nThis is a report on recent works on\nHopf\nalgebras\n(\nor quantum groups, which is more or less the same\n)\nmotivated by the quantum inverse scattering method\n(\nQISM\n)\n, a method for constructing and studying integrable quantum systems, which was developed mostly by L D Faddeev and his collaborators. Most of the definitions, constructions, examples, and theorems in this paper are inspired by the QISM. Nevertheless I will begin with these definitions, constructions, etc. and then explain their relation to the QISM. Thus I reverse the history of the subject, hoping to make its logic clearer.\nWhat is a quantum group? Recall that both in classical and in quantum mechanics there are two basic concepts: state and observable. In classical mechanics states are points of a manifold M and observables are functions on M. In the quantum case states are l-dimensional subspaces of a\nHilbert\nspace H and observables are operators in H\n(\nwe forget the self-adjointness condition\n)\n. The relation between classical and quantum mechanics is easier to understand in terms of observables. Both in classical and in quantum mechanics observables form an associative algebra which is commutative in the classical case and non-commutative in the quantum case. So quantisation is something like replacing commutative algebras by non-commutative ones.\nIn\n1988\nDrinfeld defended his \"doctor\" thesis at Steklov Institute, Moscow. The \"doctor\" thesis is the Russian equivalent of the German habilitation. On\n21\nAugust\n1990\nDrinfeld was awarded a\nFields\nMedal at the International Congress of Mathematicians in Kyoto, Japan\n[\n35\n]\n:-\n... for his work on quantum groups and for his work in number theory.\nA Jaffe and\nB Mazur\nwrite in\n[\n3\n]\nabout Drinfeld's work which led to the award of the\nFields\nMedal:-\nDrinfeld's interests can only be described as \"broad\". Not only do they span work in algebraic geometry and number theory, but his most recent ideas have taken a strikingly different direction: he has been doing significant work on mathematical questions motivated by physics, including the relatively new theory of quantum groups.\nDrinfeld defies any easy classification ... His breakthroughs have the magic that one would expect of a revolutionary mathematical discovery: they have seemingly inexhaustible consequences. On the other hand, they seem deeply personal pieces of mathematics: \"only Drinfeld could have thought of them!\" But contradictorily they seem transparently natural; once understood, \"everyone should have thought of them!\"\nManin\nends his address to the International Congress of Mathematicians in Kyoto, Japan\n(\nwhich he could not give in person but was read by Michio Jimbo\n)\nwith these words\n[\n20\n]\n:-\nI hope that I conveyed to you some sense of broadness, conceptual richness, technical strength and beauty of Drinfeld's work for which we are now honouring him with the\nFields\nMedal. For me, it was a pleasure and a privilege to observe at a close distance the rapid development of this brilliant mind which taught me so much.\nFor more extracts from\nManin\n's address, see\nTHIS LINK\n.\nDrinfeld's main achievements are his proof of the\nLanglands\nconjecture for\nG\nL\n(\n2\n)\nGL(2)\nG\nL\n(\n2\n)\nover a functional field; and his work in quantum group theory. Although he only proved a special case of the\nLanglands\nconjecture, Drinfeld has introduced important new ideas in his solution and made a real breakthrough. He introduced the idea of an elliptic module in his proof and this notion is leading to a whole new topic within number theory. The interactions between mathematics and mathematical physics studied by Atiyah led to the introduction of instantons - solutions, that is, of a certain nonlinear system of partial differential equations, the self-dual Yang-Mills equations, which were originally introduced by physicists in the context of quantum field theory. Drinfeld and\nManin\nworked on the construction of instantons using ideas from algebraic geometry. Drinfeld said\n[\n19\n]\n:-\nOne of my works\n(\njoint with\nM F Atiyah\n,\nYu I Manin\nand N J Hitchin\n)\nwas devoted to the so-called instantons. This was one of the first examples of something useful for theoretical physics being done in algebraic geometry, which impressed physicists. Physicists are smart people; they can count\n(\nnot always using strict methods\n)\nmuch better than mathematicians, and it is difficult to surprise them with anything. But after our work they realised that they needed algebraic geometry, and after\n10\nyears most physicists had learned it. People working in string theory now know algebraic geometry. In the\n1980\ns I worked on mathematical objects called quantum groups. These objects were invented under the influence of the theory of quantum integrable systems, which was started by physicists and then developed by mathematicians of the Leningrad school of Ludwig Dmitrievich Faddeev. I tried to understand their work, which was not easy. Then I realised that the key role there is played by\nHopf\nalgebras, which can be called quantum groups. This approach helped the understanding of many previously obtained results and also obtain a number of new ones. Many people working in this field liked this approach and began to use it. Quantum groups have come into use among mathematical physicists.\nChari and Thakur write\n[\n7\n]\n:-\nDrinfeld introduced Drinfeld modules and solved a substantial part of the\nLanglands\nprogramme when he was just\n20\nyears old and completed the\nG\nL\n(\n2\n)\nGL(2)\nG\nL\n(\n2\n)\ncase when he was\n24\n. Drinfeld's work on\nLanglands\nconjectures, quantum groups, p-adic uniformizations etc. illustrate his mastery over powerful and involved techniques. On the other hand, his one page proof\n(\njointly with Vladut\n)\ngiving a sharp asymptotic upper bound for the number of points of a curve defined over a finite field of order\np\n2\nn\np^{2^n}\np\n2\nn\n, uses only high-school algebra applied nicely to well-known results. He also gave a one page proof of the fact that any rotation invariant finitely additive measure on the two or three dimensional sphere is proportional to\nLebesgue\nmeasure by using a clever combination of known results.\nIn\n1992\nDrinfeld was elected a member of the\nUkrainian Academy of Sciences\n. He continued to live in Kharkov until\n1998\nwhen he emigrated to the United States. In December\n1998\n, he was appointed to the University of Chicago. He spoke about the move to the West in the interview\n[\n19\n]\n:-\nIn\n1990\n, I already worked in Kharkov\n(\nPhysico-Technical Institute of Low Temperatures of the\nNational Academy of Sciences of Ukraine\n)\n, then I had the opportunity to get a job in the West, but I refused. In\n1998\n, I received several job offers from American universities, and my wife and I decided that we should accept one of them. We lived in Ukraine, whose economy was going downhill\n(\nfor example, people received advances on their salaries six months late\n)\n. Our son was nine years old, and we wondered what kind of world he would live in when he grew up. It was clear that this was a world of wild capitalism. We decided to move to a country of more civilised capitalism. It was not easy, since I had elderly parents, I could not leave without them. The University of Chicago was able to employ my mother and provide her with health insurance.\nOn Drinfeld's appointment to Chicago, colleagues expressed their delight\n[\n17\n]\n:-\nBarry Mazur\n, professor of mathematics at Harvard University, upon learning that Drinfeld had accepted a position at Chicago, said \"It's a wonderful appointment.\"\nMazur\nsaid he regards Drinfeld and Beilinson as Russia's two most influential mathematicians. \"There's no question that Chicago has achieved a great coup there. These are great mathematicians,\"\nMazur\nsaid.\nA\nFields\nMedal is the equivalent of a Nobel Prize in mathematics, according to Robert Fefferman, Chairman of the Mathematics Department and the Louis Block Professor in Mathematics. The medals are awarded to no fewer than two and no more than four mathematicians under the age of\n40\nevery four years at the International Congress of Mathematicians. Fefferman called Drinfeld \"one of the greatest algebraists in the world.\"\nYuri Manin\n, director of the\nMax Planck\nInstitute for Mathematics in Bonn, Germany, offered an equally strong assessment. \"Drinfeld's work deeply influenced the world of mathematics of the last two decades,\" said\nManin\n, who served as Drinfeld's and Beilinson's Ph.D. thesis adviser at Moscow University in the\n1980\ns and was the chairman of the\nFields\nPrize Committee at the Berlin ICM\n1998\n. \"Several research monographs, Seminar Notes and hundreds of papers were dedicated to the two new chapters of mathematics created by him - the so-called Drinfeld modules and quantum groups.\"\nAlexander A Beilinson, also a student of Manin's, had been appointed to the University of Chicago in\n1998\n, just a short time before Drinfeld. Beilinson and Drinfeld had known each other for many years and had already collaborated on two papers before becoming colleagues in Chicago:\nAffine Kac-Moody algebras and polydifferentials\n(1994)\nand\nQuantization of Hitchin's fibration and Langlands' program\n(1996)\n. Their collaboration in Chicago led to the publication of a jointly authored book\nChiral algebras\npublished by the American Mathematical Society in\n2004\n. Francisco J Plaza Martin writes in a review\n[\n42\n]\n:-\nThis book presents a comprehensive approach to the theory of chiral algebras from the point of view of algebraic geometry. Without a doubt, it will become a standard reference on the subject. ... Chiral algebras arose in mathematical physics in the study of conformal field theory. On the mathematical side, the local theory of chiral algebras overlaps the theory of vertex algebras\n[\nR E Borcherds\n]\n, which are normally studied with representation theory techniques. In these two approaches the \"operator product expansion\" formalism plays an essential role. As the authors say, their motivation for studying chiral algebras was the understanding of geometric automorphic forms in the D-module setting as well as the description of a spectral decomposition of the category of representations of an affine\nKac\n-Moody algebra.\nOne of Drinfeld's most later articles is\nInfinite-dimensional vector bundles in algebraic geometry: an introduction\n. Drinfeld writes in the introduction to the paper:-\nThe goal of this work is to show that there is a reasonable algebro-geometric notion of vector bundle with infinite-dimensional locally linearly compact fibers and that these objects appear 'in nature'. Our approach is based on some results and ideas discovered in algebra during the period\n1958\n-\n1972\nby\nH Bass\n, L Gruson,\nI Kaplansky\n, M Karoubi, and M Raynaud.\nDrinfeld was named Harry Pratt Judson Distinguished Service Professor at the University of Chicago on\n1\nMarch\n2001\n. In\n2008\nhe was elected to the\nAmerican Academy of Arts and Sciences\n. He was elected to the\nNational Academy of Sciences\nin\n2016\n.\nIn\n2018\nDrinfeld and Beilinson were jointly awarded the Wolf Prize\n[\n37\n]\n:-\n... for their ground-breaking work in algebraic geometry\n(\na field that integrates abstract algebra with geometry\n)\n, in mathematical physics and in presentation theory, a field which helps to understand complex algebraic structures.\nThe citation continues\n[\n37\n]\n:-\nDrinfeld has contributed greatly to various branches of pure mathematics, mainly algebraic geometry, arithmetic geometry and the theory of representation - as well as mathematical physics. The mathematical objects named after him - the \"Drinfeld Modules\", the \"Drinfeld Shtukas\", the \"Drinfeld Upper Half Plane\", the \"Drinfeld Associator\", and so many others that one of his endorsers jokingly said, \"one could think that \"Drinfeld\" was an adjective, not the name of a person\".\nFor all the parts of the citation relevant to Drinfeld, see\nTHIS LINK\n.\nIn\n2023\nDrinfeld and\nShing-Tung Yau\nwere jointly awarded the Shaw Prize. The citation states\n[44]\n:-\nThe Shaw Prize in Mathematical Sciences\n2023\nis awarded in equal shares to Vladimir Drinfeld, Harry Pratt Judson Distinguished Service Professor of Mathematics at the University of Chicago, USA and\nShing-Tung Yau\n, Chair Professor at Tsinghua University, PRC, for their contributions related to mathematical physics, to arithmetic geometry, to differential geometry and to\nKähler\ngeometry.\nFor further extracts from this citation, see\nTHIS LINK\n.\nIn\n[\n11\n]\nVictor Ginzburg gives an overview of Drinfeld's contributions up to\n2005\n. He ends with the following examples showing Drinfeld's remarkable insight:-\nI would like to finish with a couple of examples that show, I believe, that many of Drinfeld's insights are still awaiting \"discovery.\" One such example is related to symplectic reflection algebras, a notion introduced by P Etingof and myself in\n2002\n. After having worked on the subject for several years, we discovered\n(\nin January\n2005)\nthat the definition of symplectic reflection algebras was essentially contained in two lines of Drinfeld's paper \"Degenerate Affine Hecke Algebras and Yangians,\" written\n15\nyears earlier! Although the paper itself is very well known, it seems nobody has read those two lines of Drinfeld's very densely written text carefully enough.\nThe second example is equally amazing. I was preparing for a course on representation theory, which I teach regularly in Chicago. Volodya mentioned to me that he had some old notes with exercises on representation theory, written for his students in Kharkov back in the\n1980\ns. As usual, Volodya's notes were very systematic; they contained both the exercises and the solutions. Somewhere in the middle of the notes, I found a digression on \"q-analogues\" that contained computations equivalent, essentially, to the important geometric construction of the quantum group discovered by Beilinson,\nLusztig\n, and MacPherson\n10\nyears later!",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}