{
  "nome_completo": "Volker Strassen",
  "nome_curto": "Volker Strassen",
  "ano_nascimento": "1936",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Strassen/",
  "lugar_nascimento": "Düsseldorf-Gerresheim, Germany",
  "lugar_morte": null,
  "biografia": "Volker Strassen\nwas born in Gerresheim, one of the boroughs of the city of Düsseldorf, situated to the east of the main city. He studied at the Gerresheim\nGymnasium\n, which specialised in modern languages, graduating from the high school in\n1955\n. At this stage Strassen's interests were more on the arts side rather than science and he decided to study music and philosophy at university. He entered the University of Cologne in\n1955\nand began to take courses on music and philosophy. His undergraduate career was spent at a variety of different universities, for he moved to the University of Freiberg and then to the University of Munich. Not only was he moving between different universities, but his interests were changing too and he changed topics to take courses on mathematics and physics.\nAfter taking courses at the Universities of Cologne, Freiberg and Munich, he went to the University of Göttingen to complete his training. There his studies were supervised by Konrad Jacobs who worked in ergodic theory. Jacobs, who had been an assistant at Munich before taking up the chair of mathematical statistics at Göttingen in\n1959\n, had not previously been a thesis advisor so Strassen became his first student. Strassen was awarded his Diploma in Mathematics from Göttingen in\n1961\nand his doctorate in the following year for his thesis\nMessfehler und Information\nⓉ\n(\nMeasurement error and information\n)\n. Also in\n1962\nhe attended the Third Prague Conference on Information Theory, Statistical Decision Functions and Random Processes where he gave the lecture\nAsymptotische Abschätzungen in Shannons Informationstheorie\nⓉ\n(\nAsymptotic estimates in Shannon's information theory\n)\n. This was published in the conference proceeding in\n1964\n, the same year as his paper containing the main results from his doctoral thesis was published.\nAfter the award of his doctorate, Strassen went to the University of California, Berkeley in the United States.\nJulia Robinson\n's sister, Constance Reid, describes meeting Strassen around this time\n[\n4\n]\n:-\nJulia was auditing a class of\nAlfred Tarski\n's in which the person who always arranged to sit next to her was a young Ph.D. from Göttingen, a probabalist then, named Volker Strassen. She told him that her sister was planning to write a book about men and women of modern mathematics, and Volker said that of course then we must come to Göttingen and when we came he would show us around. ... Volker's Ph.D. adviser, Konrad Jacobs, was eager to entertain us - rather, to entertain Julia. It was clear that Volker had scored a coup with his \"Doktorvater\" by bringing her to Göttingen. ... Volker himself, whose wife was momentarily expecting their second child, told us that if the baby was a girl ... he was going to name her Julia. The baby was born while we were still in Göttingen but turned out to be a boy, so Volker named him Tyko after Tycho Brahe, which showed me the class Julia was in as far as Volker was concerned.\nWe note that Tyko Strassen is now a mathematician with similar interests to his father.\nAt Berkeley, Volker Strassen took up an appointment as an Assistant Professor in the Department of Statistics and was later promoted to Associate Professor there. Strassen wrote a highly influential paper in\n1964\n, namely\nAn Invariance Principle for the Law of the Iterated Logarithm\n. This paper contains what today is called 'Strassen's law of the iterated logarithm', showing scale invariance in random walks. The importance of the results was quickly realised and Strassen was invited to lecture at the International Congress of Mathematicians held in Moscow in\n1966\n. His lecture\nDer Satz mit dem iterierten Logarithmus\nⓉ\n(\nA theorem on the iterated logarithm\n)\nsurveyed his results on the law of the iterated logarithm and discussed the relation of his work to that of others. A postdoctoral grant from the\nDeutschen Mathematiker-Vereinigung\n(\nGerman Mathematical Society\n)\nallowed Strassen to\nhabilitate\nin\n1966\nat the University of Erlangen where Konrad Jacobs had moved in\n1965\nto set up a centre for probability with Hans Bauer who had moved there from Hamburg.\nIn\n1968\nStrassen took up an appointment at the Institute of Applied Mathematics at the University of Zürich. At around this time his interests changed somewhat and he began to study the performance of algorithms. In\n1968\nhe made a major, and very surprising, discovery\n[\n2\n]\n:-\nPerhaps the first real surprise in algorithm analysis occurred with Strassen's discovery in\n1968\nof a new method for multiplying two\nn\n×\nn\nn \\times  n\nn\n×\nn\nmatrices. While the classic algorithm we all learned in high school requires\n2\nn\n3\n−\nn\n2\n2n^{3}  - n^{2}\n2\nn\n3\n−\nn\n2\nscalar arithmetic operations, Strassen's algorithm uses fewer than\n7\nn\nk\n−\n6\nn\n2\n7n^{k} - 6n^{2}\n7\nn\nk\n−\n6\nn\n2\noperations, where\nk\n=\nlog\n⁡\n2\n7\n=\n2.808\nk = \\log_{2} 7 = 2.808\nk\n=\nlo\ng\n2\n​\n7\n=\n2\n.\n8\n0\n8\n. Therefore, this new algorithm uses fewer operations than the classic method when\nn\nn\nn\nis greater than\n654\n. Strassen's discovery touched off an intensive search for asymptotically better matrix multiplication algorithms.\nStrassen spent twenty years at the University of Zürich during which time he made many more highly significant discoveries including, in\n1977\n, his test for whether a number is prime using a randomised algorithm. We will quote from the citations of prestigious awards made to Strassen to give further details of his contributions. Before that, let us note that he left Zürich in\n1988\nto take up a position at the University of Konstanz. He retired in\n1998\n.\nIn\n1999\nStrassen was awarded the\nCantor\nmedal by the\nDeutsche Mathematiker Vereinigung\n(\nGerman Mathematical Society\n)\n. The citation reads\n[\n5\n]\n:-\nThe Society honours a great scientist who through his multifaceted contributions has given mathematical research decisive impulses and has opened up new areas. His work in\nprobability theory\n, algebraic complexity theory, and theoretical computer science has been groundbreaking. Those results will always be linked to his name.\nStrassen received the\n2003\nAssociation for Computing Machinery Paris Kanellakis Theory and Practice Award\n(\njointly with Gary Miller, Michael Rabin, Robert Solovay\n)\n. We give the following extract from the citation\n[\n3\n]\n:-\nRandomized algorithms for testing whether a number is prime were introduced by Robert Solovay and Volker Strassen and by Michael Rabin. Each of these tests is based on an efficiently computable predicate depending on\nn\nn\nn\n, the number being tested for primality, and an integer\nb\nb\nb\nin the range\n[\n2\n,\nn\n]\n[ 2, n]\n[\n2\n,\nn\n]\n. In each case, the chosen predicate has the property that, if\nn\nn\nn\nis prime, then the predicate must be true for all\nb\nb\nb\n; therefore, a value\nb\nb\nb\nfor which the predicate is false is a witness to the compositeness of\nn\nn\nn\n. Solovay and Strassen\n(1977)\nproved that, if\nn\nn\nn\nis composite then, for their predicate, at least half the possible choices of\nb\nb\nb\nare witnesses to its compositeness. ... The Solovay-Strassen and Miller-Rabin tests demonstrate the power of randomized algorithms and make it possible to generate large random prime numbers and thus construct candidate instances of the RSA cryptosystem. Essentially all cryptographic systems being considered today require the generation of large primes.\nThe Association for Computing Machinery Special Interest Group on Algorithms and Computation Theory presented Strassen with the\n2008\nKnuth\nPrize at their 'Symposium on Discrete Algorithms' held in New York in January\n2009\n. He received the award\n[\n1\n]\n:-\n... for his contributions to the theory and practice of algorithm design. Strassen's innovations enabled fast and efficient computer algorithms, the sequence of instructions that tells a computer how to solve a particular problem. His discoveries resulted in some of the most important algorithms used today on millions if not billions of computers around the world, and fundamentally altered the field of cryptography, which uses secret codes to protect data from theft or alteration. ... Strassen's algorithms include fast matrix multiplication, integer multiplication, and a test for the primality of integers. The discovery of provably fast algorithms to determine whether a number is prime or composite profoundly changed the cryptography field. These primality tests are now performed billions of times a day on machines worldwide to apply cryptographic methods that make data secure. The primality test opened the world of probabilistic algorithms to theoretical computer scientists, presenting an innovative way to solve sharing problems, which are often used in fault tolerant systems. ... Modern primality tests involve multiplying many large integers together. For thirty five years, the Schonhage-Strassen integer multiplication method algorithm held the world record for the fastest multiplication algorithm. It is still a standard tool for computing with very large numbers. In\n1969\n, Strassen discovered a novel way to multiply two matrices, a critical element of linear algebra that is pervasive throughout the sciences. It is an intricate yet simple algorithm that remains the method of choice for multiplying dense matrices of size\n30\nby\n30\nor more on machines today. Using this new matrix multiplication routine, Strassen was able to show that Gaussian elimination\n(\nan efficient algorithm for solving systems of linear equations\n)\nis not an optimal solution. Few students in computer science have not encountered Strassen's multiplication algorithm in their undergraduate program. Researchers in algorithm design have regularly used his method to improve the run time of their algorithms. In addition to his very practical work, Strassen has proved fundamental theorems in statistics, including \"Strassen's law of the iterated logarithm\" and the principle of strong invariance. He is considered the founding father of algebraic complexity theory with his work on the degree bound, connecting complexity to algebraic geometry. He also introduced fundamental notions and results in bilinear complexity and tensor rank.\nWe mentioned above that Strassen was an invited speaker at the International Congress of Mathematicians held in Moscow in\n1966\n. He was also an invited speaker at the International Congress of Mathematicians held in Vancouver in\n1974\nwhen he spoke on\nSome results in algebraic complexity theory\n. At the International Congress of Mathematicians at Berkeley in\n1986\nthe\nNevanlinna\nPrize was awarded to\nLeslie Valiant\nand Strassen was invited to give a lecture explaining the significance of\nValiant\n's work. This was not the only time that Strassen was involved with the presentation of the\nNevanlinna\nPrize for he was on the committee that chose Alexander Razborov as the winner of the award at the International Congress of Mathematicians at Kyoto in\n1990\n. Let us also mention that Strassen was an invited speaker at the First European Congress of Mathematics held in Paris in\n1992\nwhen he gave the lecture\nAlgebra and complexity\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Number Theory",
    "Statistics"
  ]
}