{
  "nome_completo": "Wacław Sierpiński",
  "nome_curto": "Wacław Sierpiński",
  "ano_nascimento": "1882",
  "ano_morte": "1969",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sierpinski/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Wacław Sierpiński\n's father was a doctor. He attended school in Warsaw where his talent for mathematics was quickly spotted by his first mathematics teacher. This was a period of Russian occupation of Poland and it was a difficult time for the gifted Sierpiński to be educated in Poland. The Russians had forced their language and culture on the Poles in sweeping changes to all secondary schools implemented between\n1869\nand\n1874\n. The Russian aim was to keep illiteracy in Poland as high as possible, so they discouraged learning and the number of students fell.\nDespite the difficulties, Sierpiński entered the Department of Mathematics and Physics of the University of Warsaw in\n1899\n. It would be more accurate to describe it as the Czar's University since this was the official name of the University which had become a Russian university in\n1869\n. The lectures at the University were all in Russian and the staff were entirely Russian. It is not surprising therefore that it would be the work of a Russian mathematician, one of his teachers\nVoronoy\n, that first attracted Sierpiński.\nIn\n1903\nthe Department of Mathematics and Physics offered a prize for the best essay from a student on\nVoronoy\n's contribution to\nnumber theory\n. Sierpiński was awarded the gold medal in the competition for his dissertation. He described the events\n(\nsee\n[\n12\n]\n)\n:-\n... I was awarded a gold medal by the university for work in a competition on the theory of numbers. It was my first scientific work. It was accepted for publication in the 'Izvestia' of Warsaw University. However, in the following year there was a strike to produce a boycott of Russian Schools in Poland and I did not want to have my first work printed in the Russian language and that is why I had it withdrawn from print in Warsaw's 'Izvestia'. That is why it was not printed until\n1907\nin the mathematical magazine 'The works of Mathematics and Physics' published by\nSamuel Dickstein\n.\nFifty years after he graduated from the University of Warsaw Sierpiński looked back at the problems that he had as a Pole taking his degree at the time of the Russian occupation:-\n... we had to attend a yearly lecture on the Russian language. ... Each of the students made it a point of honour to have the worst results in that subject. ... I did not answer a single question ... and I got an unsatisfactory mark. ... I passed all my examinations, then the lector suggested I should take a repeat examination, otherwise I would not be able to obtain the degree of a candidate for mathematical science. ... I refused him saying that this would be the first case at our University that someone having excellent marks in all subjects, having the dissertation accepted and a gold medal, would not obtain the degree of a candidate for mathematical science, but a lower degree, the degree of a 'real student'\n(\nstrangely that was what the lower degree was called\n)\nbecause of one lower mark in the Russian language.\nSierpiński was lucky for the lector changed the mark on his Russian language course to 'good' so that he could take his degree. As he says:-\nThe policeman was human.\nThe results in the prize essay that Sierpiński wrote in\n1904\nwere a major contribution to a famous problem on lattice points. Suppose\nR\n(\nr\n)\nR(r)\nR\n(\nr\n)\ndenotes the number of points\n(\nm\n,\nn\n)\n,\nm\n,\nn\n(m, n), m, n\n(\nm\n,\nn\n)\n,\nm\n,\nn\n∈\nZ\n\\mathbb{Z}\nZ\ncontained in a circle centre\nO\nO\nO\n, radius\nr\nr\nr\n. There exists a constant\nC\nC\nC\nand a number\nk\nk\nk\nwith\n∣\nR\n(\nr\n)\n−\nπ\nr\n2\n∣\n<\nC\nr\nk\n| R(r) - \\pi r^{2}| < Cr^{k}\n∣\nR\n(\nr\n)\n−\nπ\nr\n2\n∣\n<\nC\nr\nk\n.\nLet\nd\nd\nd\nbe the minimal value of\nk\nk\nk\n.\nGauss\nproved in\n1837\nthat\nd\n≤\n1\nd ≤ 1\nd\n≤\n1\n. Sierpiński's major contribution was to show that it was possible to improve the inequality to\nd\n≤\n2\n3\nd ≤ \\large\\frac{2}{3}\\normalsize\nd\n≤\n3\n2\n​\n. In\n1913\nEdmund Landau\nshortened Sierpiński's proof and described the result as profound.\nLet us digress for a moment to discuss some further work which flowed from this result of Sierpiński on what is often called the '\nGauss\ncircle problem'. In\n1915\nHardy\nand\nLandau\nproved that\nd\n>\n1\n2\nd > \\large\\frac{1}{2}\\normalsize\nd\n>\n2\n1\n​\n, while in\n1923\nvan der Corput proved that\nd\n<\n2\n3\nd < \\large\\frac{2}{3}\\normalsize\nd\n<\n3\n2\n​\n. The following year\nLittlewood\nand\nWalfisz\nproved that\nd\n≤\n37\n56\nd ≤ \\large\\frac{37}{56}\\normalsize\nd\n≤\n5\n6\n3\n7\n​\n, this being improved to\nd\n≤\n163\n247\n≈\n0.6599\nd ≤ \\large\\frac{163}{247}\\normalsize  \\approx  0.6599\nd\n≤\n2\n4\n7\n1\n6\n3\n​\n≈\n0\n.\n6\n5\n9\n9\nthe following year. Slight further improvements were made by\nVinogradov\nin\n1932\nand\nTitchmarsh\nin\n1934\n. The best result\n(\nso far\n)\nknown is\nd\n≤\n131\n208\n≈\n0.6298\nd ≤ \\large\\frac{131}{208}\\normalsize  \\approx  0.6298\nd\n≤\n2\n0\n8\n1\n3\n1\n​\n≈\n0\n.\n6\n2\n9\n8\n.\nSierpiński graduated in\n1904\nand worked for a while as a school teacher of mathematics and physics in a girls' school in Warsaw. However, when the school closed because of a strike, Sierpiński decided to go to Kraków to study for his doctorate. At the Jagiellonian University in Kraków he attended lectures by\nZaremba\non mathematics, studying in addition astronomy and philosophy. He received his doctorate and was appointed to the University of Lemberg\n(\nwhich is in what is now Lviv in Ukraine\n)\nin\n1908\n.\nIn fact it was in\n1907\nthat Sierpiński first became interested in set theory. It happened when he came across a theorem which stated that points in the plane could be specified with a single coordinate. He wrote to\nBanachiewicz\n, who was at Göttingen at the time, asking him how such a result was possible. He received a one word reply '\nCantor\n'. Sierpiński began to study set theory and in\n1909\nhe gave the first ever lecture course devoted entirely to set theory.\nThroughout his life Sierpiński maintained an incredible output of research papers and books. During the years\n1908\nto\n1914\n, when he taught at the University of Lemberg, he published three books in addition to many research papers. These books were\nThe theory of\nirrational\nnumbers\n(1910)\n,\nOutline of Set Theory\n(1912)\nand\nThe theory of numbers\n(1912)\n.\n1\nn\n1912\nhe introduced the\nSierpiński curve\nwhich describes a closed path which passes through every interior point of a square. The length of the curve is infinity, while the area enclosed by it is\n5\n12\n\\large\\frac{5}{12}\\normalsize\n1\n2\n5\n​\nthat of the square.\nYou can see some of the stages of the construction of this curve at\nTHIS LINK\n.\nAbout this time he introduced what is now called the\nSierpiński triangle\nor\nSierpiński gasket\n. It is an example of a fractal curve which is a two-dimensional analogue of the\nCantor set\nwhich had been introduced forty years before.\nYou can see some of the stages of the construction of this set at\nTHIS LINK\n.\nWhen World War I began in\n1914\n, Sierpiński and his family happened to be in Russia. At this time the governments of Austria and Russia tried to use the Polish question as a political weapon. Sierpiński was interned in Viatka. However\nEgorov\nand\nLuzin\nheard that he had been interned and arranged for him to be allowed to go to Moscow. Sierpiński spent the rest of the war years in Moscow working with\nLuzin\n. Together they began the study of analytic sets. In\n1916\n, during his time in Moscow, Sierpiński gave the first example of an absolutely normal number, that is a number whose digits occur with equal frequency in whichever base it is written.\nBorel\nhad proved such numbers exist but Sierpiński was the first to give an example.\nWhen World War I ended in\n1918\n, Sierpiński returned to Lemberg. However shortly after taking up his appointment again in Lemberg he was offered a post at the University of Warsaw which he accepted. In\n1919\nhe was promoted to professor at Warsaw and he spent the rest of his life there.\nIn\n1920\nSierpiński, together with his former student\nMazurkiewicz\n, founded the important mathematics journal\nFundamenta Mathematicae\n. Sierpiński edited the journal which specialised in papers on set theory.\nFrom this period Sierpiński worked mostly in the area of set theory but also on\npoint set topology\nand functions of a real variable. In set theory he made important contributions to the\naxiom of choice\nand to the\ncontinuum hypothesis\n.\nSierpiński continued to collaborate with\nLuzin\non investigations of analytic and projective sets. His work on functions of a real variable include results on functional series, differentiability of functions and\nBaire\n's classification.\nSierpiński was also highly involved with the development of mathematics in Poland. He had been honoured with election to the\nPolish Academy\nin\n1921\nand he was made dean of the faculty at the University of Warsaw in the same year. In\n1928\nhe became vice-chairman of the\nWarsaw Scientific Society\nand, in the same year was elected chairman of the\nPolish Mathematical Society\n.\nIn\n1939\nlife in Warsaw changed dramatically with the advent of World War II. Sierpiński continued working in the 'Underground Warsaw University' while his official job was a clerk in the council offices in Warsaw. His publications continued since he managed to send papers to Italy. Each of these papers ended with the words:-\nThe proofs of these theorems will appear in the publication of Fundamenta Mathematicae\nwhich everyone understood meant 'Poland will survive'.\nAfter the uprising of\n1944\nthe Nazis burned his house destroying his library and personal letters. Sierpiński spoke of the tragic events of the war during a lecture he gave at the Jagiellonian University in Kraków in\n1945\n(\nsee\n[\n13\n]\n)\n. He spoke of his students who had died in the war:-\nIn July\n1941\none of my oldest students\nStanisław Ruziewicz\nwas murdered. He was a retired professor of Jan Kazimierz University in Lviv ... an outstanding mathematician and an excellent teacher. In\n1943\none of my most distinguished students\nStanisław Saks\nwas murdered. He was an assistant professor at Warsaw University, one of the leading experts in the world in the theory of the integral... In\n1942\nanother student of mine,\nAdolf Lindenbaum\nwas murdered. He was an assistant professor at Warsaw University and a distinguished author of works on set theory.\nAfter listing colleagues who were murdered in the war such as\nSchauder\nand others who died as a result of the war such as\nDickstein\nand\nZaremba\n, Sierpiński continued:-\nThus more than half of the mathematicians who lectured in our academic schools were killed. It was a great loss for Polish mathematics which was developing favourably in some fields such as set theory and\ntopology\n... In addition to the lamented personal losses Polish mathematics suffered because of German barbarity during the war, it also suffered material losses. They burned down Warsaw University Library which contained several thousand volumes, magazines, mathematical books and thousands of reprints of mathematical works by different authors. Nearly all the editions of Fundamenta Mathematicae\n(32\nvolumes\n)\nand ten volumes of Mathematical Monograph were completely burned. Private libraries of all the four professors of mathematics from Warsaw University and also quite a number of manuscripts of their works and handbooks written during the war were burnt too.\nSierpiński was the author of the incredible number of\n724\npapers and\n50\nbooks. He retired in\n1960\nas professor at the University of Warsaw but he continued to give a seminar on the theory of numbers at the\nPolish Academy of Sciences\nup to\n1967\n. He also continued his editorial work, as editor-in-chief of\nActa Arithmetica\nwhich he began in\n1958\n, and as an editorial board member of\nRendiconti del Circolo Matematico di Palermo, Compositio Mathematica\nand\nZentralblatt für Mathematik\n.\nHe received so many honours that it would be impossible to mention them all here. We list a few. He was awarded honorary degrees from Jan Kazimierz University, Lwów\n(\nas the University of Lemberg in Lviv became known\n)\n(1929)\nand from the universities of St Marks, Lima\n(1930)\n, Amsterdam\n(1931)\n, Tarta\n(1931)\n, Sofia\n(1939)\n, Prague\n(1947)\n, Wrocław\n(1947)\n, Lucknow\n(1949)\n, and Lomonosov University of Moscow\n(1967)\n.\nHe was elected to the Geographic Society of Lima\n(1931)\n, the Royal Scientific Society of Liège\n(1934)\n, the\nBulgarian Academy of Sciences\n(1936)\n, the National Academy of Lima\n(1939)\n, the Royal Society of Sciences of Naples\n(1939)\n, the\nAccademia dei Lincei\nof Rome\n(1947)\n, the\nGerman Academy of Science\n(1950)\n, the\nAmerican Academy of Arts and Sciences\n(1959)\n, the\nParis Academy\n(1960)\n, the Royal Dutch Academy\n(1961)\n, the Academy of Science of Brussels\n(1961)\n, the\nLondon Mathematical Society\n(1964)\n, the\nRomanian Academy of Sciences\n(1965)\nand the\nPontifical Academy of Sciences\n(1967)\n.\nRotkiewicz, who was a student of Sierpiński's wrote in\n[\n12\n]\n:-\nSierpiński had exceptionally good health and a cheerful nature. ... He could work under any conditions. ... He did not like any corrections to his papers. When someone suggested a correction he added a line to it: 'Mr X remarked that ...' He was a creative mind and liked creative mathematics. He was the greatest and most productive of Polish mathematicians.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}