{
  "nome_completo": "Wallace John Eckert",
  "nome_curto": "Wallace J Eckert",
  "ano_nascimento": "1902",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eckert_Wallace/",
  "lugar_nascimento": "Pittsburgh, Pennsylvania, USA",
  "lugar_morte": "Englewood, New Jersey, USA",
  "biografia": "Wallace J Eckert\nearned his PhD was from Yale in\n1931\nin astronomy. At that time Ernest\nBrown\nwas a member of the astronomy department and\nBrown\n's work on the Moon was an important ingredient of Eckert's later work. Eckert had joined the Faculty at Columbia University in\n1926\nand later he became professor there.\nEckert was an early user of IBM punch card equipment to reduce astronomical data and solve numerically planetary orbits. In\n1937\nColumbia University and IBM established the Thomas J Watson Astronomical Computing Bureau as a result of the collaboration with Eckert. In fact the work which led to this development was published by Eckert in\nPunched card methods in scientific computation\n(1940)\n.\nIn\n1940\nEckert became director of the US Nautical Almanac Office and produced work vital to navigation during World War II. In this post he introduced machine methods to compute and print tables and he began publication of the\nAir Almanac\nin\n1940\n.\nIn\n1945\nEckert became director of the Watson Scientific Computing Laboratory at Columbia University. As stated in\n[\n3\n]\n:-\nDuring the more than\n20\nyears he was in charge of the laboratory, it was a major training center for scientific computation, where more than\n1\n,\n000\nastronomers, physicists, crystallographers, statisticians, and other scientists studied.\nEckert directed the construction of a number of innovative computers. In\n1949\nthe Selective Sequence Electronic Calculator\n(\nSSEC\n)\nwas built. Later the Naval Ordnance Research Calculator\n(\nNORC\n)\nwas built. Completed in\n1954\nit was for many years the most powerful computer in the world.\nEckert applied computers, in particular the SSEC and NORC, to compute precise planetary positions and contribute to the theory of the orbit of the Moon. In particular he used the SSEC to compute the positions of Jupiter, Saturn, Uranus, Neptune and Pluto, publishing the results in\n1951\nin\nCoordinates of the five outer planets\n.\nThe NORC was used by Eckert to work on the problem of the position of the Moon. Writing in\n1954\nEckert explained the how\nBrown\nhad calculated the Moon's position:-\nSince\n1923\nthe work of\nE W Brown\nhas constituted the basis for the published ephemerides of the moon. His monumental calculation, which occupied most of his lifetime, consists of two distinct steps. The first is the development of the theory or the solution of the\ndifferential equations\nof motion expressing the coordinates of the moon as explicit functions of time. Secondly, in order to reduce the necessary labor involved in computing the coordinates of the moon for any given date from these formulae,\nBrown\ncomputed from his theory a set of Tables which, including the necessary explanations, comprise over\n650\nlarge quarto pages. ... In order to bring the Tables within even their present length, various parts of the basic equations were curtailed whenever permissible in the light of observational requirements\n(\nas then visualised\n)\n.\nHowever by the\n1950\ns it was realised that the\nTables\nwere not accurate enough. Eckert therefore decided not to recompute new tables but to compute the ephemerides directly from\nBrown\n's equations. The task was immense for, see\n[\n3\n]\n:-\n...\nBrown\n's formulae involved some\n1\n,\n650\ntrigonometric terms, many of them with variable coefficients.\nThe accuracy of Eckert's calculations of the Moon's orbit was so good that in\n1965\nhe was able to correctly show that there was a concentration of mass near the lunar surface. In\n1967\nhe produced theoretical work which improved on\nBrown\n's theory of the Moon.\nEckert's work is summed up in\n[\n3\n]\n:-\nEckert retired in\n1967\nfrom IBM and in\n1970\nfrom his professorship at Columbia, greatly honored by his fellow astronomers but because of his modest nature little known to the public. Hardly any other astronomer of his generation influenced our science more profoundly.",
  "math_areas": []
}