{
  "nome_completo": "Walter Brown",
  "nome_curto": "Walter Brown",
  "ano_nascimento": "1886",
  "ano_morte": "1957",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brown_Walter/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Marandellas, near Salisbury, Rhodesia  (now Harare, Zimbabwe)",
  "biografia": "Walter Brown\n's father was Hugh A Brown, a Headmaster in Paisley, Renfrewshire. Walter attended Allan Glen's School, Glasgow, completing his studies there in\n1903\n, the year he first matriculated at Glasgow University. He studied mathematics and physics, graduating with a B.Sc. with Honours in these subjects in\n1907\n. He then remained at Glasgow studying Pure Science and graduated in this topic in\n1910\n.\nBrown then spent three years,\n1911\n-\n1914\n, as an Assistant Master at Allan Glen's School, Glasgow, the school where he had been educated. In\n1914\nhe left Scotland when he accepted an appointment as a Lecturer in Engineering at Hong Kong University. In\n1918\nhe was appointed as Professor of Pure and Applied Mathematics at Hong Kong University. He was still in this post when World War II began but at this stage Hong Kong was not in danger. However, the Japanese attacked Pearl harbour on\n7\nDecember\n1941\n, then on the following day began an attack on Hong Kong. The British forces began to withdraw from Hong Kong on\n12\nDecember and six days later the Japanese forces landed. Hong Kong surrendered on Christmas day\n1941\n. Brown was taken prisoner by the Japanese and held in Stanley Camp. After the war ended Hong Kong University reopened but at this stage Brown retired and returned to Scotland where he worked first as a Lecturer in Civil and Mechanical Engineering at the Royal Technical College, Glasgow, during\n1946\n-\n47\n, and then a lecturer in Mathematics at Glasgow University in\n1947\n-\n48\n.\nBrown joined the\nEdinburgh Mathematical Society\nin March\n1911\n. He became an associate member of the Institute of Electrical Engineers in\n1920\n. During his time in Hong Kong he played a major role in many organisations, for example the Hong Kong Philharmonic Society\n(\nof which he was President\n)\n, the Hong Kong English Association, the Hong Kong Sino-British Association, and the Hong Kong Institute of Engineers and Shipbuilders.\nWalter Brown was elected to the\nRoyal Society of Edinburgh\non\n5\nMarch\n1923\n, his proposers being\nAndrew Gray\n,\nGeorge A Gibson\n, John Walter Gregory,\nJames Gordon Gray\n,\nDugald Black McQuistan\n.\nAn obituary, written anonymously, appears in the\nRoyal Society of Edinburgh\nYear Book\n1958\n, pages\n14\n-\n15\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}