{
  "nome_completo": "Wanda Montlak Szmielew",
  "nome_curto": "Wanda Szmielew",
  "ano_nascimento": "1918",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szmielew/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Wanda Szmielew\n's parents were Dawid Montlak and his wife Bronislawa. Wanda was, therefore, Wanda Montlak when she was growing up and only became Wanda Szmielew after her marriage. Wanda attended school in Warsaw and, soon after graduating from high school in\n1935\n, she married Borys Szmielew\n(1910\n-\n1983)\n. She entered the University of Warsaw in\n1935\nand studied mathematical logic. She was taught by\nAdolf Lindenbaum\n, a student of\nWacław Sierpiński\n,\nJan Łukasiewicz\n,\nKazimierz Kuratowski\nand\nAlfred Tarski\n. A fellow student of mathematical logic at that time was\nAndrzej Mostowski\n.\nTarski\nwas had been appointed as an assistant of\nŁukasiewicz\nin\n1929\nand was still a relatively junior member of staff. He was supervising\nMostowski\n's doctoral studies but was too junior to be his official supervisor.\nSzmielew began undertaking research, advised by\nTarski\n, while she was still studying for her first degree and the two became friends. In August\n1938\nTarski\nwent to Zakopane for his summer holidays and he invited Szmielew and her husband to join him for a week in August when they all went on hikes in the Tatra mountains. Szmielew produced her first important result in\n1938\nconcerning the axiom of choice for finite sets. She wrote this up but, before it could be published, Germany invaded Poland on Friday\n1\nSeptember\n1939\n. Advancing at a rapid rate, despite brave resistance by Polish forces, Warsaw fell on\n27\nSeptember and the country was forced to surrender two days later. Szmielew's studies at the University of Warsaw came to an abrupt end.\nTarski\n, by good fortune, had travelled to Harvard University in the United States to attend a meeting and was there when war broke out. He was given permission to remain in the United States.\nAdolf Lindenbaum\nwas killed by the Nazis in\n1941\n.\nJan Łukasiewicz\nsuffered great hardships during World War II and fled from Poland with his wife. The occupying German forces closed the University of Warsaw and the main campus was turned into a military barracks.\nDuring World War II Szmielew worked as a surveyor. However, she continued to undertake research on her own and, during these years she proved the decidability of the theory of abelian groups. The closing of most educational institutions in Poland by the Germans did not stop the Poles organising underground educational establishments and, despite the obvious danger of taking part in these illegal activities, Szmielew engaged in underground teaching. In January\n1945\nLodz was liberated by the Soviet Army and, in May\n1945\n, the University of Lodz was founded built on several educational institutions which had operated in Lodz before the Germans invaded in\n1939\nand on the underground university that had operated during the war. Szmielew was appointed to the new University of Lodz and she also taught at the Lodz Institute of Technology. Her first paper,\nOn choices from finite sets\n, written in\n1938\nbut unpublished because of the war, finally appeared in\nFundamenta Mathematicae\nin\n1946\n. She had been unable to complete her undergraduate degree at Warsaw because of the war so now she worked to obtain a first degree and she was awarded an M.A. by the University of Warsaw in\n1947\n. After the award of the M.A. she was appointed as a senior assistant to the Chair of Mathematics at the University of Warsaw. She attended the Tenth International Congress of Philosophy in Amsterdam in August\n1948\nand reported on her work on the decidability of the theory of abelian groups. She published the\n3\n-page paper\nDecision problem in group theory\nin the\nProceedings\nof the Congress. It was reviewed by Richard Milton Martin who wrote:-\nThis paper is concerned with the positive solution of the decision problem in the elementary\n(\nfirst order\n)\ntheory of Abelian groups.\n(\nThe solution of this problem for the elementary theory of arbitrary groups is known to be negative.\n)\n... it is shown that there exists a method which enables us to decide in each particular case whether a given sentence\n(\nof the theory under consideration\n)\nis satisfied by every Abelian group. Another form of this theorem is also arrived at by a different method.\nSzmielew worked at the University of Warsaw for two years before moving to the United States to complete her doctorate advised by\nTarski\n.\nWe mentioned above than\nTarski\nhad been lucky enough to be in the United States when Germany invaded Poland in\n1939\n, but his wife and two children, a son Jan and a daughter Ina, were both in Poland. They were unable to leave during the war despite\nTarski\n's strenuous efforts to get them out but after the war, in\n1946\n, with\nTarski\nin a permanent post at the University of California at Berkeley they were able to join him. To illustrate the danger his family had been in, we note that\nTarski\n's father, mother, brother and sister-in-law all died at the hands of the Nazis during the war. Once his family had joined him,\nTarski\nset about arranging an invitation for Szmielew to come to the University of California at Berkeley. Given the results she had obtained during the war, she was confident that she could complete her doctorate within a year. The authors of\n[\n1\n]\nrelated the events that followed:-\n[\nSzmielew\n]\narrived in the United States in\n1949\nas the first Pole to come to Berkeley under his sponsorship; given the Cold-War political situation, this must have taken some powerful intervention in both countries. ... Liberated, mysteriously beautiful, and independent, Szmielew set about doing what she wished with little concern for the reaction of others. Unconstrained by convention, she came to Berkeley, leaving her husband in Poland, and accepted\nTarski\n's invitation to live in his house with his family as a guest for the year. On the face of it, this was quite reasonable. Wanda had a grant with limited funds, she had limited time, and she did not have a car; so it made eminently good economic sense for her to be right there. Furthermore, she was going to be working closely with\nTarski\n, whose habit it was to work into the early hours of the morning. Jan's bedroom, adjacent to\nTarski\n's study, was made hers and Jan\n[\nTarski\n's son\n]\nmoved to a room in the basement. He welcomed the change at first - at fifteen he was happy to have a secluded place to himself- but he was not happy when it became clear that the rapport between Alfred and Wanda went far beyond a shared interest in mathematical logic. Since\nTarski\nwas in the habit of doing as he wished at home without having to justify his actions, it is difficult to know whether he had any misgivings about creating this menage. He had had mistresses before and would have others in the future; it was, after all, part of the culture in Europe - especially among intellectuals, artists, and freethinkers. No one made a fuss, particularly if there was some discretion. The problem in this instance was the blatant lack of it. Why did Maria\n[\nTarski\n's wife\n]\nput up with this? The simple answer is: She did not think she had much choice. In the United States she had no income of her own and, at first, no language competency; she was completely dependent upon her husband. ... in\n1950\n, in the Cragmont Avenue house, she tried her best to live with a humiliating situation and keep her emotions under control. Periodically, though there would be a crisis, a boiling over, usually precipitated by Szmielew's presumption of privilege and the expectation that Maria would take care of domestic tasks for her, as if Alfred's wife were the housekeeper rather than the lady of the house. At those moments, Ina\n(\nwho was then twelve\n)\nrecalled Maria would blow up and there would be loud bitter arguments and recriminations, \"shouting and crying; everyone in the family hearing everything.\" Eventually the heat would subside, and all would simmer down until the next crisis. But both Ina and Jan retained an everlasting resentment and dislike for Wanda Szmielew because of her insensitivity toward Maria as well as toward them.\nSzmielew's\n250\n-page doctoral dissertation,\nArithmetical properties of abelian groups\n, earned her a Ph.D. in\n1950\n. This was an outstanding piece of work which was published as the\n70\n-page paper\nElementary properties of abelian groups\nin\nFundamenta Mathematicae\nin\n1954\n. She was awarded the Prize of the Minister of Higher Education in\n1956\nfor this impressive paper. It was\n[\n8\n]\n:-\n... an essential contribution to the foundations of algebra and inspired the future research of\nAbraham Robinson\nand the pupils of\nAnatoly Malcev\n, as well as some other scholars.\nDana Scott, reviewing Szmielew's paper in\n[\n10\n]\n, writes:-\nSo many results on undecidability have been proved in the last few years that it is refreshing to see a theorem on the positive side again. In this careful study it is shown that there is a\n(\nprimitive\n)\nrecursive decision method for the first-order theory of Abelian groups. The exact algorithm is not given, but the details of the process of eliminating quantifiers and reducing sentences to a normal form are contained in the proofs and can be effectively extracted from the paper. In any case, one would hardly wish to carry out the decision method, and knowledge of its existence is satisfying enough. Instead, the metamathematical implications of the result are more to the point, and the emphasis of this paper lies in that direction. The main accomplishment is an exhaustive description of all finitely axiomatizable extensions of the theory of Abelian groups in terms of certain basic sentences expressing reasonably standard group-theoretical properties. Further all complete extensions of the theory are found together with an\n(\ninfinite\n)\nset of algebraic invariants for explicitly telling whether two Abelian groups share the same first-order properties. ... The mode of presentation uses in an essential way\nTarski\n's notions of elementary\n(\narithmetical\n)\nfunctions and classes. A very good summary of the pertinent facts about these concepts is supplied. ... the author deserves credit for having carried the plan through successfully.\nAfter the award of her doctorate, Szmielew returned to the University of Warsaw where she was promoted to assistant professor. Further promotions followed around the time her daughter Aleksandra Szmielew was born on\n18\nDecember\n1954\n. She worked closely with\nKarol Borsuk\nwho had played a major role in reconstructing the University of Warsaw after World War II. He had been made a professor in\n1946\n. Szmielew and\nBorsuk\npublished the book\nThe foundations of geometry\n(\nPolish\n)\nin\n1955\n. Herbert Busemann writes in a review:-\nThis book deviates from other works with the same title both in content and in the extent to which details often omitted in other books are carried out. It begins with an introduction on the history of the subject and on the very elements of point-set topology. The first four chapters are concerned with absolute geometry, in particular with the axioms of incidence and order. ... An English edition of this book might well be an answer to the problem of how to acquaint young students with exact reasoning, presenting at the same time a coherent course.\nIndeed an English edition under the title\nFoundations of geometry, Euclidean and Bolyai-Lobachevskian geometry, projective geometry\nwas published in\n1960\n.\nDonald Coxeter\nwrites that the book\n[\n3\n]\n:-\n... was re-written for the English edition with many improvements, e.g.\nHilbert\n's axioms have been replaced by simpler ones along the lines of\nEliakim Moore\nand\nOswald Veblen\n.\nIn\n1956\nTarski\nvisited Szmielew,\nBorsuk\nand\nMostowski\nin Warsaw\n[\n1\n]\n:-\nBy then, Szmielew had a daughter, Aleksandra, who was two years old.\nTarski\nwould form an attachment to her as she grew older, and he always asked about her in his letters to Wanda.\nTarski\nhad professional business to attend to as well; he was determined to do all he could to bring Polish logicians to the United States and especially to Berkeley for conferences and for longer stays. It was at this time that he set the wheels in motion for Szmielew and\nBorsuk\nto attend the Axiomatic Method Symposium planned for\n1957\n...\nSzmielew attended the Berkeley Symposium, held\n26\nDecember\n1957\nto\n4\nJanuary\n1958\n, and gave the lecture\nSome metamathematical problems concerning elementary hyperbolic geometry\n. On the same theme, she announced important results\n(\nwithout proofs\n)\nin her\n1959\npaper\nAbsolute calculus of segments and its metamathematical implications\n. Dana Scott writes:-\nAbsolute geometry consists of those theorems common to both the Euclidean and hyperbolic theories. However, without distinguishing between the two cases the author builds up the theory of proportion\n(\nexcept, of course, for the results depending on the existence of the fourth proportional which fails in hyperbolic geometry\n)\nin a new way which thereby leads to the absolute calculus\n(\nor algebra\n)\nof\n(\nequivalence classes of free\n)\nsegments.\nFurther papers on the foundations of geometry followed. Maria Semeniuk-Polkowska, who studied at the University of Warsaw in the\n1960\ns, wrote:-\nFor a short time I wavered between choosing a seminar on the foundations of geometry, which Professor Szmielew encouraged me to take, and that on foundations of mathematics by Professor\nRasiowa\n. I admired greatly both their beautiful lectures, and I was under their good influence.\nThe authors of\n[\n1\n]\nwrite that:-\nWanda was bold, determined, self-assured, and independent, as well as beautiful, and\nTarski\nadmired all these attributes. One gets the impression that once she was launched on her own,\nTarski\nwas the one trying to please her and not the other way around. He courted her favour and was most solicitous of her until her death. While she was ill he helped her buy a car and sent her money for a vacation in Italy ...\nThe illness mentioned in this quote was cancer and Szmielew was already suffering badly from the disease when, in\n1974\n, she decided to write a book giving her approach to the foundations of geometry which, by that time, had taken a rather different line to the views of\nTarski\n. Her colleague Maria Moszynska wrote:-\n[\nSzmielew\n]\nwas no longer able to carry on her university duties. During the next two years she worked intensively. The monograph soon began to live its own life, to develop beyond the initial framework. But by May\n1976\nit became clear that Wanda Szmielew had neither enough time nor strength to complete the work.\n[\nAfter Wanda's death\n]\nI tried to change only what was absolutely necessary, so as to preserve as far as possible the original text.\nThe book was published in Polish in\n1981\nand an English translation under the title\nFrom affine geometry to Euclidean geometry. An axiomatic approach\nwas published in\n1983\n. Leslaw W Szczerba writes in a review:-\nThe main theme of the book is the interrelations between geometric systems and corresponding algebraic theories. Mutual interpretability of several geometric theories and their algebraic counterparts is established. All geometric theories are treated as one-sorted elementary theories: theories about points. The only exceptions are parts of Sections\n7\nand\n8\nof Chapter\n2\n, where Archimedean and continuity axioms are discussed, and therefore a non-elementary language is admitted. ... The book has been published posthumously, and this is apparent in Part two and especially in Part three. There is an abundance of open problems concerning the material, as well as a lot of material relevant to the book, known even from earlier publications of the author, which has not been included.\nVictor Pambuccian, who is writing a book about the axiomatic foundation of geometry which will survey all contributions made from the\n1882\nbeginning of the modern axiomatisation of geometry to the present, also reviewed Szmielew's book:-\nThis book leaves the reviewer with a feeling such as one experiences watching the throwing of the javelin at the Olympic Games. Every movement seems simple, natural, the way it has to be. One almost forgets that behind this apparent ease and grace there are years of hard work, of sweat and tears ...\nSzmielew's daughter Aleksandra, asked about her mother's character, said she was\n[\n1\n]\n:-\n... authoritarian, towards me, towards everyone, and she was never worried much about what other people thought of her.\nThe authors of\n[\n8\n]\nwrite:-\nShe expended a great deal of care and ingeniousness on teaching. It was typical her to strive for beauty and perfection in everything. She gave her best both in her lectures and in directing the work of others. She was extremely sensitive to other people. She tried to instil into her pupils her own passion for creative work, her perseverance and lore of method and precision, and also her rare gift for organizing work. For her pupils she was always the best friend and protector.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}