{
  "nome_completo": "Elliott Ward Cheney",
  "nome_curto": "Ward Cheney",
  "ano_nascimento": "1929",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cheney/",
  "lugar_nascimento": "Gettysburg, Pennsylvania, USA",
  "lugar_morte": "Austin, Texas, USA",
  "biografia": "Ward Cheney\n's parents were Elliott Ward Cheney, Sr.\n(1899\n-\n1958)\n, and Carleton Pratt. Elliott Ward Cheney, Sr., was a physicist who married Carleton in\n1926\n. The couple moved from Middlebury, Vermont, to Gettysburg, Pennsylvania, where their son, the subject of this biography was born, and finally to Lehigh University. These moves were all made as Elliott Ward Cheney, Sr., moved between different academic appointments. Ward's parents were both employed by Consumers' Research, perhaps the first consumer-product testing organization in the United States. Ward had an older sister Carleton Cheney who married Emanuel Schwager.\nWard was fascinated by music from the time he was a young child and in\n1939\n, when he was ten years old, he had clarinet lessons. His secondary education was at Fountain Hill High School, Bethlehem, Pennsylvania, where he studied from\n1944\nto\n1947\n. After graduating in\n1947\nfrom the High School, he entered Lehigh University, Bethlehem, Pennsylvania, where his father was teaching physics. In addition to his academic studies, Cheney worked every summer for the U.S. Forest Service from\n1947\nto\n1954\n. His roles with the Forest Service included labourer, supervisor of groups of workers, assistant camp superintendent and camp superintendent. Cheney was awarded a B.A. by Lehigh University in\n1951\nand remained there undertaking postgraduate study in session\n1951\n-\n52\n.\nIt was while he was working for the U.S. Forest Service that Cheney met Elizabeth Jean, known as Beth. They married on\n4\nSeptember\n1952\nand had three children: Margaret Cheney, Elliot Ward Cheney and David Cheney. Margaret became a professor of mathematics and married the artist Kevin Aldrich. Elliott became a professional cellist and married Carey who is also a cellist and a Doctor of Musical Arts in Cello Performance. David Cheney became a science and technology policy consultant and married biology professor Alexandra Fairfield. Ward and Beth Cheney were divorced on\n24\nApril\n1974\n. Let us now return to Cheney's career after his marriage in\n1952\n.\nAfter a year of postgraduate work at Lehigh University, in\n1952\nCheney continued his postgraduate work at the University of Kansas. He undertook research for his Ph.D. advised by\nRobert Schatten\n.\nSchatten\nwas a Polish Jew who had obtained a Master's Degree from Lwów University in\n1933\n(\nLwów is now Lviv in Ukraine\n)\nand then emigrated to the United States. He was the only member of his family to survive the war, all the others who remained in Europe were murdered by the Nazis. The first year Cheney studied at Kansas,\nSchatten\nspent most of his time at the Institute for Advanced Study at Princeton. Cheney wrote about his advisor\n[\n1\n]\n:-\nTo his former students,\nSchatten\nwill be remembered as a dedicated teacher who was genuinely concerned with the intellectual development of his students. They will certainly not forget his unique style of lecturing. He always spoke without a book or notes, and rarely used the blackboard. His lectures were extremely clear and well-organized; he never lost his way in complicated arguments. The pace was such that the students could\n(\nand were expected to\n)\ntake notes verbatim; if they did so, their notes would read like a polished book, except for some linguistic idiosyncrasies such as, \"Given is a set...\". He left nothing to chance in his dictation; for example, he invariably ended an argument with \"This concludes the proof.\"\nIn\n1954\n, while Cheney was still undertaking research for his Ph.D., he was appointed as an Instructor in Mathematics at the University of Kansas. He held this position for two years while completing his thesis\nOn Gauge Functions\nand his Ph.D. was awarded in\n1957\n. Before this, in\n1956\n, he had been appointed as a Design Specialist in Convair Astronautics at San Diego, California, part of the General Dynamics Corporation. There he joined the team collaborating on the mathematical aspects of the guidance system for the Atlas Rocket which began as an intercontinental missile launch platform but became a major player in America's manned space programme. At Convair Astronautics, Cheney collaborated with Allen A Goldstein and together they published four joint papers which appeared in\n1958\n-\n59\n.\nNote on a paper by Zuhovickii concerning the Tchebycheff problem for linear equations\n(1958)\nappeared first as a 'Convair Astronautics Mathematical Pre-print' in\n1957\nand then was published in the\nSIAM\nJournal in\n1958\n. The next paper\nA finite algorithm for the solution of consistent linear equations and inequalities and for the Tchebycheff approximation of inconsistent linear equations\n(1958)\nis introduced by the authors as follows:-\nThe three problems of the title are treated here from a unified geometric standpoint, and an algorithm is presented for their solution. Algorithms for these problems already exist ... . In the present algorithm, each problem is reinterpreted as one of finding the lowest points\n(\nif any exist\n)\nof a polytope in an Euclidean space the techniques of steepest descent and elimination of variables are then combined to work downward from vertex to vertex.\nThe introduction to\nProximity maps for convex sets\n(1959)\nbegins with the following sentence:-\nThe method of successive approximation is applied to the problem of obtaining points of minimum distance on two convex sets.\nThe fourth Cheney-Goldstein joint paper appearing in\n1958\n-\n59\nwas\nNewton's method for convex programming and Tchebycheff approximation\n(1959)\n.\nIn\n1959\nCheney moved to the Space Technology Laboratories, Los Angeles, California, where he worked as a member of the technical staff for two years. In\n1961\nhe was appointed as an Assistant Professor of Mathematics at Iowa State University. He spent the summers of\n1961\nand\n1962\nas a Professor at the National Science Foundation Summer Institute in Numerical Analysis at the University of California at Los Angeles. Then he was appointed as an Assistant Professor of Mathematics at the University of California at Los Angeles in\n1962\n. In the summer of\n1963\nhe was the Director of the National Science Foundation Summer Institute in Numerical Analysis at the University of California at Los Angeles and he was promoted to Associate Professor at UCLA in\n1964\n. During these years, in addition to his academic duties, Cheney worked as a consultant for Boeing Scientific Research Laboratories in the summers of\n1962\nand\n1963\n. In addition he spent one day a week as a Consultant to the Aerospace Corporation in\n1962\n-\n63\n.\nCheney spent the summer of\n1964\nvisiting the Technische Hochschule, Munich, and then was a Visiting Associate Professor at the University of Texas in\n1964\n-\n65\n. Then, in\n1965\n, he joined the faculty at the University of Texas as an Associate Professor. He continued his consultancy work, spending one day a week through academic year\n1965\n-\n66\nat the IBM Corporation at Houston. At the end of this academic year, in\n1966\n, he became a full Professor at the University of Texas. He spent four weeks at the Royal Institute of Technology, Stockholm, in May\n1967\nbefore spending the summer of that year at the École Polytechnique in Lausanne. His papers published around this time were mostly joint publications. For example he published\nTwo new algorithms for rational approximation\n(1961)\nwith Henry L Loeb,\nTchebycheff approximation in locally convex spaces\n(1962)\nwith Allen A Goldstein,\nOn rational Chebyshev Approximation\n(1962)\nwith Henry L Loeb, and two papers with Ambikeshwar Sharma which both appeared in\n1964\n, namely\nOn a generalization of Bernstein polynomials\n, and\nBernstein power series\n. Let us say just a little about Cheney's coauthors. Henry L Loeb was working at the System Development Corporation, Santa Monica, California when the two papers mentioned above were written but by\n1966\nhe was working at the Aerospace Corporation, Los Angeles, California where Cheney had been a consultant. Ambikeshwar Sharma\n(1920\n-\n2003)\nheld positions at Cornell, Rajasthan, Harvard, and the University of California at Los Angeles before joining the University of Alberta in\n1962\n. Although he was at Alberta when the two papers mentioned above were published, he had been a colleague of Cheney's at UCLA when their collaboration began.\nBetween the papers mentioned in the last paragraph was\nA survey of methods for rational approximation, with particular reference to a new method based on a formula of Darboux\nwhich was published by the\nSociety for Industrial and Applied Mathematics\n(\nSIAM\n)\nin\n1963\n. This paper was written with coauthor Thomas H Southard, who worked at Alameda County State College, Hayward, California, and had been President of\nSIAM\nin\n1956\n-\n58\n. Cheney's work on this paper was supported by the Space Technology Laboratories and by the U.S. Army Research Office\n(\nDurham\n)\nwhile that of Southard by Boeing Scientific Research Laboratories. This survey has the following introduction which gives a good idea of the type of problems Cheney was working on:-\nA problem that arises very frequently in numerical analysis is that of obtaining a convenient approximation to a prescribed continuous function. Polynomials are at once recommended for t his purpose since their coefficients appear linearly and since the value of a polynomial for a given argument may be rapidly calculated. Moreover, the\nWeierstrass\nApproximation Theorem guarantees that the maximum deviation of a continuous function defined on a closed interval from its best polynomial approximation of degree at most\nn\nn\nn\nconverges to zero monotonically as\nn\nn\nn\nbecomes infinite. The rapidity of this convergence depends of course on the function, in particular upon its smoothness. A number of theorems of Jackson govern this situation. Thus as a practical matter, it may occur that acceptable accuracy is achieved only by polynomials of intolerably high degree. In many cases of this nature a rational approximation can provide spectacular improvement . Rational approximations are also recommended by the rapidity with which they may be computed at a specified argument, especially if the rational approximation is written in its\ncontinued fraction\nform. On the other hand, computing the coefficients of a best approximation to a certain function is considerably more difficult in the rational case than in the polynomial case, chiefly because the coefficients enter the former nonlinearly. Great interest attaches therefore to the problem of obtaining rapid rational approximations, which although not optimum in the Tchebycheff\n[\nwritten as\nChebyshev\nin this Archive\n]\nsense may avert the necessity for having recourse to large-scale computers . Both approaches to the rational approximation problem are now rather well represented by algorithms, and it is our purpose here to describe a number of these, special attention being directed to the use of a formula of\nDarboux\n.\nCheney published the classic text\nIntroduction to approximation theory\nin\n1966\n, the year he became a full professor at the University of Texas. We give an extract from the Preface and short extracts from two reviews of the book at\nTHIS LINK\n.\nFor the rest of his career, Cheney held the professorship at the University of Texas but he spent time at other universities. For example he spent\n1966\n-\n67\nas a Visiting Professor at Lund University, Sweden,\n1966\n-\n1967\nreturning there for the spring semester of\n1969\nbefore going to Michigan State University for the academic year\n1969\n-\n70\n. He was invited to lecture to the\nSIAM\nat Denver in\n1963\nand was\nSIAM\nLecturer\n1968\n-\n69\n. He was an invited lecturer in the Numerical Methods Section of the International Congress of Mathematicians held in Vancouver in\n1974\n.\nLet me\n[\nEFR\n]\nmake a personal comment. I met Ward Cheney twice, both times in St Andrews. In\n1977\nWard spent two months\n(\nJune and July\n)\nin St Andrews funded by a Senior visiting fellowship from British Scientific Research Council. St Andrews had a strong group of researchers in numerical analysis led by George Phillips. The second time Ward visited St Andrews was in March\n1984\nwhen he addressed the Departmental Colloquium with the talk\nApproximating Multivariate Functions\n. On the following day he gave the lecture\nRational Functions and Continued Fractions\nto the undergraduates in St Andrews. This visit was part of a six-month visit to Britain as a Senior Visiting Research Fellow of the Science and Engineering Research Council. Ward was a really nice person, clearly a world leader in numerical analysis, but most of all it was his enthusiasm and energy, both for mathematics and for life in general, that shone through.\nLet us note that his two St Andrews visits were typical of visits that he made almost every year, for example, the University of Florence\n(1976)\n, Brunel University\n(1977)\n, the University of Lancaster\n(1978)\n, and the Technion, Haifa\n(1980)\n. From\n1981\nuntil\n1991\nhe made a research visit almost every summer to the University of Lancaster in the north of England where he worked with William Allan Light. Light moved from Lancaster to the University of Leicester and, after that, Cheney visited Leicester every summer from\n1992\nto\n1995\n. Cheney and Light wrote two joint books and fifteen joint papers. Some of these papers had additional authors, for example the three papers\nA mixed-norm bivariate approximation problem with applications to Lewanowicz operators\n(1978)\n,\nOn simultaneous Chebyshev approximation\n(1979)\nand\nThe approximation of bivariate functions by sums of univariate ones using the\nL\n1\nL_{1}\nL\n1\n​\nmetric\n(1982)\n. These three papers were written jointly by Cheney, Light and my two St Andrews colleagues, George Phillips and John McCabe.\nCheney's marriage to Beth ended in\n1974\n; she remarried in\n1975\n. Cheney's second wife Victoria became his devoted companion from\n1983\nand was with Ward when he came to St Andrews in\n1984\n.\nThe article\n[\n2\n]\nstates:-\nHe has supervised seventeen Ph.D. students and thirty-four Masters students. He has been an Associate Editor for ten mathematical journals as well as being a referee for numerous others. He has given more than a hundred and sixty-five invited lectures and colloquium talks at universities and conferences around the world. ... Professor Cheney has over a hundred published papers and is the author of eleven textbooks in mathematics, with several having multiple editions. ... In addition to his family, mathematics, and the University of Texas, Austin, his interests include daily exercise and playing the clarinet with a group of musicians. Ward and his wife Victoria are interested in genealogy, and they have a great deal of information about his family's ancestry ... Professor Cheney maintains a list of piano trios\n(\npiano, violin/clarinet/viola, and cello\n)\n. These are either written for clarinet or can be played by clarinet using suitable transposition from the violin part.\nCheney's health deteriorated with the onset of Alzheimer's. He spent the last years of his life in Buckner Villas, GreenRidge, Austin where The Harbor is an Alzheimer's assisted living community. Stephen Rodi wrote:-\nI was a graduate student in mathematics at the University of Texas,\n1969\n-\n1974\nwith an office just down the corridor from Dr Cheney. Our paths next crossed\n41\nyears later when my wife Sue at the end of her eight years of early on-set Alzheimer's came to a care facility where again Dr Cheney had a room near-by, with a copy of his ground-breaking text on approximation theory in a place of honour in the glass cabinet outside his door. That is when I got to know Victoria Cheney for nine months and observed first hand her tender and intelligent care for Ward as she kindly showed me the \"institutional\" routine and we shared time assisting our spouses at breakfast or lunch or dinner.\nFollowing his death, Cheney was cremated and his ashes were interred at New York City Marble Cemetery where his parents were buried.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}