{
  "nome_completo": "Welington Celso de Melo",
  "nome_curto": "Welington de Melo",
  "ano_nascimento": "1946",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Melo/",
  "lugar_nascimento": "Guapé, Minas Gerais, Brazil",
  "lugar_morte": "Rio de Janeiro, Brazil",
  "biografia": "Welington de Melo\nwas the son of Moacyr Hostalácio de Melo and Maria José Silva de Melo. Although Welington was born in Guapé, a town in the Minas Gerais state in south east Brazil, he never lived there. His father Moacyr was a Collector of the Federal Revenue and later a Tax Auditor of the Federal Revenue. This involved several moves during the years that Welington was growing up and, as a consequence, he attended schools in different towns. First he was at school in Três Corações, Minas Gerais, a larger town than Guapé about\n160\nkm south east of it. He moved from there to the city of Anápolis in the State of Goiás. Another move saw him attend the Colégio Diocezano in Maceió, the largest city of the coastal state of Alagoas. This college, founded in\n1902\nand run by the Marist Brothers, had around\n600\npupils when Welington attended. His next school was the Colégio Estadual in Belo Horizonte, a large city in the Minas Gerais state.\nBefore completing his secondary school education, Welington began working for the Banco da Lavoura while continuing his final two years of school education studying at night school. The Banco da Lavoura was founded in Belo Horizonte in\n1925\nand, although it still had its headquarters in that city when Welington was employed there, it had by that time expanded into having branches in most big Brazilian towns. At this stage Welington was intending to have a career as a businessman and he bought a newspaper stand.\nIn\n1965\n, at the age of nineteen, he decided to give up the idea of a career in business, resigned his position at the Banco da Lavoura, sold his the newspaper stand, and entered the School of Engineering at the Federal University of Minas Gerais. He certainly did not envision a career as a mathematician at this time but was intent on studying electrical engineering. Of course he studied mathematics as part of the engineering course and assisted the Chair of Infinitesimal and Integral Calculus where he organised seminars with professors to study topics of Advanced Calculus. As he approached the last years of the Electrical Engineering course he decided that he wanted an academic career and thought that he would apply to do postgraduate studies in physics. The Seventh Brazilian Mathematics Colloquium was due to be held in Poços de Caldas, Minas Gerais in July of\n1969\nand, because of his excellent performance in his undergraduate studies, de Melo was awarded a scholarship to attend the Colloquium. One of the four Scientific Initiation Courses at the Colloquium,\nAnálise Geométrica\n, was being given by\nElon Lages Lima\n, the director of the Instituto de Matemática Pura e Aplicada\n(\nIMPA\n)\n. De Melo attended the course and impressed\nLima\nwho invited him to do a Master's Degree in Mathematics at IMPA. He made a quick decision to undertake postgraduate work in mathematics rather than physics.\nDe Melo graduated with a degree in electrical engineering from the Federal University of Minas Gerais in\n1969\nand, in the same year, he married Gilza. She had been born in Pedra Azul, in the Jequitinhonha Valley region of the Minas Gerais state, and had studied mathematics at the Federal University of Minas Gerais. She would later work as a systems analyst. In January\n1970\nde Melo and his wife moved to Rio de Janeiro and, one Saturday morning, he knocked on the door of\nJacob Palis\nin the IMPA.\nPalis\nhad begun running Dynamical Systems Seminars at IMPA after he returned from California with a Ph.D. in\n1969\nand they were held every morning except Sunday. De Melo\n[\n12\n]\n:-\n... informed\nPalis\nthat he had attended\nElon Lima\n's course at the recent Brazilian Mathematical Colloquium in Poços de Caldas. He added that he would very much like to study Dynamical Systems to obtain a Ph.D. in this area.\nPalis\napproached the lecturers at the Federal University of Minas Gerais, asking their opinion of de Melo's abilities\n[\n12\n]\n:-\n... he was informed that de Melo was an excellent student and very determined to learn new relevant topics in mathematics. With all the positive reactions\nPalis\nhad received, he asked Welington to present one of the important Seminar topics. It was a success! With that, Jacob formalised his request to the Director of IMPA to accept de Melo as a Ph.D. student, under his guidance. A couple of weeks after that, Welington came to\nJacob\n's office to say that he had discovered a serious gap in one of his mathematical papers. Happily, it turned out it was not a serious gap.\nDe Melo was awarded a CAPES scholarship to fund his Ph.D. studies. CAPES is a Foundation within the Ministry of Education in Brazil whose central purpose is to coordinate efforts to improve the quality of Brazil's faculty and staff in higher education through grant programs. CAPES is particularly concerned with the training of doctoral candidates. De Melo was an outstanding student and was an invited speaker at the first International Symposium on Dynamical Systems, held at the University of Bahia, Salvador, Brazil from\n26\nJuly to\n14\nAugust\n1971\nand organised by\nElon Lima\n,\nMaurício Peixoto\nand\nJacob Palis\n. De Melo gave the talk\nStructural Stability on Two-Manifolds\n. Before the Symposium took place, however, several of the foreign mathematicians who were to speak at it, including\nStephen Smale\n, spent time as visiting researchers at the IMPA in Rio de Janeiro. De Melo said\n(\nsee\n[\n5\n]\n)\n:-\nWhat I learned about mathematics without taking any courses, simply talking to people in the corridors, was great.\nHe was awarded his doctorate for his thesis\nEstabilidade Estrutural em Variedades de Dimensao Dois\nⓉ\n(\nStructural Stability in Manifolds of Dimension Two\n)\nin\n1972\n. He published results from his thesis in the\n21\n-page paper\nStructural Stability of Diffeomorphisms on Two-Manifolds\nwhich appeared in the leading mathematical journal\nInventiones Mathematicae\nin\n1973\n. In this paper de Melo writes:-\nThis paper is based in my doctoral thesis at IMPA under the guidance of\nJ Palis\n. We are grateful to\nE Lima\n, P Mendes, S Newhouse, G L dos Reis, C Robinson, R Williams, and especially to\nJ Palis\nfor many helpful conversations.\nAn award from the National Research Council of Brazil allowed de Melo to spend from September\n1972\nto March\n1974\nundertaking post-doctoral work with\nStephen Smale\nat the University of California, Berkeley. The authors of\n[\n6\n]\nwrite:-\nWelington was very much influenced by\nSteve Smale\nwho in the early\n1970\ns was quite interested in economics. Inspired by\nSteve\n's work, Welington studied the problem of simultaneously optimising several functions. Forever the pure mathematician, he wrote that this 'is a natural question to consider, even in some basic models in economics'.\nLeaving Berkeley, he went to the University of Warwick in England, being there from March\n1974\nto July\n1974\n. This was to participate in the symposium 'Applications of Topology and Dynamical Systems' which ran\n1973\n-\n74\nand was organised by\nChris Zeeman\n. De Melo was one of several IMPA mathematicians taking part in the symposium, others included\nJacob Palis\nand\nRicardo Mañé\n. De Melo gave the seminar\nOptimisation of several functions\n, describing work he had done with\nSmale\nat Berkeley. In January\n1974\n, de Melo had been appointed as an Assistant Professor at IMPA and after the University of Warwick symposium he returned to Rio de Janeiro. He was rapidly promoted, becoming an Associate Professor in August\n1975\nand a Full Professor in September\n1980\n.\nA colleague at IMPA encouraged him to take up sailing, and de Melo liked the idea. The colleague had a small sailing boat and a house at Angra dos Reis, on the coast about\n150\nkm east of the city of Rio de Janeiro. De Melo managed to arrange a base there and, in\n1979\n, he bought his own boat\n[\n5\n]\n:-\nDe Melo is a man of systematic habits. When he is in Angra, he wakes up early, works in the morning and goes sailing in the afternoon. Although he doesn't take paper and pencil to do mathematics on board, the activity helps to sharpen his reasoning. \"It is the time when I organise my ideas,\" he explains.\nIn the\n1980\ns\nSteve Smale\nbought the\n43\n-foot sailing boat\nStardust\nand decided to take a cruise to the Marquesas Islands in Polynesia.\nSmale\nand de Melo were good friends and, knowing de Melo had experience sailing,\nSmale\nasked if he would join him. Charles Chapman Pugh\n(\nborn\n1940)\n, a colleague of\nSmale\n's at Berkeley who worked on dynamical systems, also joined the sailing trip which involved a three-month cruise on the\nStardust\nfrom Berkeley to the Marquesas Islands in Polynesia then returning to Berkeley via Hawaii. This took place in\n1987\nwhile de Melo had a visiting position at Berkeley.\nIt was also in\n1987\nthat Melo's paper\nA finiteness problem for one dimensional maps\nappeared in the\nProceedings\nof the\nAmerican Mathematical Society\n. Gong Fu Liao writes in a review:-\nThe author discusses the connection between the density of structurally stable maps in the space of unimodal maps of the interval, the finiteness of attractors and the nonexistence of wandering intervals. It is proved that in the space of unimodal maps having an eventually periodic flat critical point, there is a residual subset whose maps have infinitely many sinks and there are also maps having a wandering interval.\nDe Melo himself writes in\n[\n24\n]\nabout this paper saying that it:-\n... is my first contribution to my main field of research: one-dimensional dynamics. In it I discuss the problem of existence of wandering intervals and finiteness of attractors and relate these problems to the density of structurally stable interval endomorphisms.\nThe most important research contribution made de Melo is, according to his own assessment, the paper\nJulia-Fatou-Sullivan Theory for real one-dimensional dynamics\npublished in\nActa Matematica\nin\n1992\nwhich he wrote jointly with Sebastian van Strien and Strien's Ph.D. student Marco Marten. Referring to this paper as\n[\n*\n]\n, de Melo writes\n[\n24\n]\n:-\n[\n*\n]\nis my most important mathematical contribution: a complete description is given of the topological behaviour of\n1\n-dimensional real dynamical systems. It turns out that the\nJulia\n-\nFatou\n-\nSullivan\ntheory for conformal mappings of the\nRiemann\nsphere is also valid for smooth endomorphisms of the interval\n(\nor the circle\n)\n.\nJulia\ngave the following description of the topological structure of\n1\n-dimensional complex dynamics: every rational map of the\nRiemann\nsphere has periodic domains attracting an open set of points, outside this open set there is a closed invariant set, called the\nJulia\nset, and maybe some open sets wandering around and being attracted to this\nJulia\nset.\nThe main problems left over were\n1)\nCan a map have infinitely many periodic domains?\n2)\nDo these wandering domains exist?\nFatou\nshowed that there can be only finitely many periodic domains and Sullivan showed that these wandering domains do not exist.\nThe first result about the topological structure of\n1\n-dimensional real dynamics was obtained by\nDenjoy\nand\nPoincaré\n.\nPoincaré\ngave a description of the topological structure of the dynamics of circle diffeomorphisms. As in the theory of complex dynamics the existence of wandering domains played an important role.\nDenjoy\nshowed that they cannot exist for\nC\n1\n+\nb\nν\nC^{1+b\\nu}\nC\n1\n+\nb\nν\ndiffeomorphisms of the circle. The topological work of\nPoincaré\ncould not be generalised to endomorphisms of the interval\n(\nor circle\n)\n. The topological description of the dynamics of interval dynamics was done by\nMilnor\nand\nThurston\n. The description was exactly like the one given by\nJulia\nand again the only thing left over was to answer the questions above.\nA sequence of authors achieved partial results on the non-existence of wandering intervals\n(\nDenjoy\n, Guckenheimer, van Strien and de Melo, Lyubich and Blokh\n)\n. The general non-existence of wandering intervals was proved in\n[\n*\n]\n. Furthermore\n[\n*\n]\nalso gives the finiteness of periodic attractors. As a corollary of the theory developed in\n[\n*\n]\nwe got the classical\nDenjoy\n-\nSchwarz\ntheorem under much milder smoothness conditions.\nSince sailing played such a large part in de Melo's life, let us say a little more about it. In\n1991\n, he purchased the\nDoisdu\n, a sailing boat about\n10\nmetres long and with capacity for eight people. Since\n2006\nthe boat was moored beside a pier attached to his house in a condominium in Angra. We have already explained that sailing and mathematics were strongly connected in his life and it is interesting how many leading mathematicians sailed with him at various times\n[\n5\n]\n:-\nWhenever he takes the sailboat out, de Melo likes to set himself a little mathematical constraint. \"Each time I try to make a path that is homotopically non-trivial,\" he explained. Faced with the stunned silence of the interlocutor, he tried to expand: it is equivalent to circumventing at least one island. He was proud to have already sailed those waters in the company of five\nFields\nmedallists:\nRené Thom\n(1958)\n,\nStephen Smale\n(1966)\n,\nSergei Novikov\n(1970)\n,\nJean-Christophe Yoccoz\n(1994)\nand Stanislav Smirnov\n(2010)\n.\nArtur Avila\n- now sixth on the list - has a photo on his IMPA page in his swimming trunks aboard the Doisdu, but he is not exactly a sailor. \"He is very much from the city,\" lamented his advisor de Melo.\nThe reference to de Melo's Ph.D. student\nArtur Avila\n, who won the\nFields\nMedal in\n2014\n, requires some further details. In\n1995\n, when he was sixteen years old,\nArtur Avila\nreceived a scholarship to start studying for a Master's Degree at the IMPA in Rio de Janeiro while still attending high school in Rio de Janeiro. For the M.S. degree\nAvila\nwas advised by\nElon Lages Lima\nbut soon came into contact with de Melo. He said\n(\nin\n2017)\n[\n1\n]\n:-\nRemembering Welington is remembering someone who was fundamental for our institution\n[\nIMPA\n]\nand for many people. He showed, in addition to exceptional mathematical talent, an enormous commitment to IMPA. He wanted IMPA to succeed. His contribution was not just mathematics. ... He was an extremely rigorous mathematician, committed to the highest quality of the work carried out at IMPA. He wanted the work to be at the highest possible level, but, because of this rigour, his reputation scared students a little. I found it a bit risky to enrol, I think in\n1997\n, in a course taught by Welington at IMPA. With great caution, I did not enrol in the course, but went to attend classes. He turned out to be, unlike his reputation, very nice to me. At the end of the course, he said that I had done well. ... He asked me to go on his boat in Angra. He provided the food, the beer. But the students had the task of getting the barnacles out of the hull. He even provided the appropriate instruments.\nAvila\nasked de Melo if he would be his Ph.D. advisor and he began his studies in\n1998\n. A conference on dynamical systems was held at IMPA from Monday\n11\nMay to Friday\n15\nMay\n1998\n. De Melo invited Mikhail Lyubich, a Ukrainian mathematician who was co-director of the Institute for Mathematical Sciences at Stony Brook University, New York, to the conference. At this conference it was arranged that early in\n1999\nde Melo and\nAvila\nwould travel to Stony Brook and discuss a Ph.D. topic for\nAvila\nwith Lyubich. Before this, however, de Melo went to the International Congress of Mathematicians in Berlin where he was an invited speaker. He gave the lecture\nRigidity and Renormalization in One Dimensional Dynamical Systems\n. His lecture has the following Abstract:-\nIf two smooth unimodal maps or real analytic critical circle maps have the same bounded combinatorial type then there exists a\nC\n1\n+\nα\nC^{1+\\alpha}\nC\n1\n+\nα\ndiffeomorphism conjugating the two maps along the corresponding critical orbits for some α >\n0\n. The proof is based on a detailed understanding of the orbit structure of an infinite dimensional dynamical system: the renormalisation operator.\nAvila\nand de Melo travelled on United Airlines to JFK Airport in February\n1999\n, then they went on to Long Island\n[\n17\n]\n:-\nJust before welcoming the Brazilians to Stony Brook, Lyubich had written a series of articles in which he proved his most important results. \"Very few people really understood what it was about\", he commented, \"and Welington was a notable exception. It was his proposal that Artur explore this line of research.\" ... The three spent a month tossing ideas back and forth, in a style of doing mathematics that only requires a blackboard, chalk, and space to walk back and forth. The daily conversations took place in the Institute's rooms, at Lyubich's house, in restaurants or during walks through the woods around the university. ... \"Occasionally, amazed, I realised that Lyubich and I were a little behind Artur,\" recalled de Melo, \"he was so young. .. I would forget about it but then be scared.\" ... After a month of intense discussions, the trio had a clear strategy for resolving the problem that consumed them, but the proof was still out of reach. There was an obstacle that refused to budge. Lyubich and de Melo decided to leave it in the boy's hands. \"That was in March\", remembers Artur. \"I kept the problem in my head and a few months later, in September or October, I had a weird idea.\"\nAvila\nwas awarded his Ph.D. by IMPA in\n2001\nfor his thesis\nBifurcations of unimodal maps: the topologic and metric picture\n. He went on to win a\nFields\nMedal in\n2014\nand perhaps, despite all his other achievements, de Melo will be best known as the Ph.D. supervisor of a\nFields\nMedal winner.\nWelington de Melo published seven books, each co-authored with one of the three mathematicians\nJacob Palis\n, Sebastian van Strien and Edson de Faria. You can see more information about these books at\nTHIS LINK\n.\nMany honours were given to de Melo including full membership of the\nBrazilian Academy of Sciences\nin\n1991\n, the award of the National Order of Scientific Merit in\n1996\n, the Gran Cruz do Mérito Científico of the Ministry of Science and Technology in\n2002\n,\nThe World Academy of Sciences\nAward in Mathematics in\n2003\n, and membership of\nThe World Academy of Sciences\nin\n2005\n.\nDuring his career, de Melo made many research visits. For example in\n1977\nhe visited France spending time at the University of Lille and at the Institut des Hautes Études Scientifique. In\n1982\nhe was in both Chile and France, then in the following year he went to the International Centre for Theoretical Physics in Trieste, Italy. He continued regular visits abroad, mostly to either the United States of France but a few to Holland or Belgium. He was an invited speaker at many conferences around the world, for example 'Dynamical Systems and Turbulence' at the University of Warwick in\n1980\n, the\nLondon Mathematical Society\nSymposium in Durham, England in\n1988\n, a 'Workshop on Dynamical Systems' in Portugal in\n1992\n, an 'International Conference on Dynamical Systems and Chaos' in Tokyo, Japan, in\n1994\n, a conference on dynamics in Hong Kong in\n1996\nand the conference 'Contemporary Problems in Dynamical Systems' in Nizhny Novgorod, Russia in the same year. In fact around\n40\nconference lectures up to\n2009\nare listed in\n[\n24\n]\n, where details of the conference, its location and the title of the lecture given by de Melo are given.\nWriting about de Melo's life outside mathematics, Edson de Faria and Sebastian van Strien explain in\n[\n6\n]\n:-\nWelington met his wife Gilza while he was still quite young. They were inseparable, truly adored each other and even felt comfortable squabbling in front of others. No doubt, Gilza was instrumental in Welington's success. Usually Welington and Gilza lived relatively modestly. However, occasionally Welington would love to eat out in famous restaurants and talked about these memorable meals for years after. Welington loved to be near the sea and in particular to sail and the sense of adventure and freedom.\nIn early December\n2016\n, shortly after celebrating his\n70\nth birthday, de Melo suffered a heart attack and was taken to hospital. He died around two weeks later, while still in hospital, of complications arising from his heart condition. Only a short time before,\n14\n-\n18\nNovember at IMPA, there had been a conference 'New Trends in One-dimensional Dynamics' to celebrate his\n70\nth birthday. The editors of\n[\n10\n]\nwrite:-\nThe occasion was particularly gratifying for us because of the active participation of a number of experts in this field, many of Welington de Melo's co-authors and all his former doctoral students. Collecting the articles for this volume was initially intended as an opportunity to celebrate the success of the meeting and Welington de Melo's joy at the excellent scientific level of the lectures and the friendly atmosphere that week. Unfortunately, Welington de Melo passed away a month after the meeting. He is sorely missed by the Brazilian mathematical community, and the publication of this volume became more a tribute to Welington de Melo. His role in the development of mathematics is indisputable, especially in the area of low-level dynamics, and his legacy includes, in addition to numerous articles with fundamental contributions, books that are mandatory references for beginners in this area. Welington had only seven formal Ph.D. students, and we were both honoured of being two of them. It is worth mentioning that\nArtur Avila\n, the\n2014\nFields\nMedal winner, was also Welington's Ph.D. student.\nWe should say a little about a project undertaken by de Melo's wife Gilza. She knew that the Jequitinhonha Valley region where she was born and brought up had high rates of poverty and unemployment. She wanted to improve this by starting an educational project which, not surprisingly, was based on mathematics. After getting financial support from the IMPA, she began with a pilot project in June\n2011\nin five cities in the Jequitinhonha Valley. For four hours on a Saturday morning, pupils wishing to take part were coached for the Brazilian Public School Mathematics Olympiad. Details of this project are given in\n[\n8\n]\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Topology"
  ]
}