{
  "nome_completo": "Wen-Tsun Wu",
  "nome_curto": "Wen-Tsun Wu",
  "ano_nascimento": "1919",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wu_Wen-Tsun/",
  "lugar_nascimento": "Shanghai, China",
  "lugar_morte": "Beijing, China",
  "biografia": "Wen-Tsun Wu\nwas born in Shanghai and he was brought up in that city. He studied mathematics at Chiao-Tung University, Shanghai during a particularly difficult period since war broke out between China and Japan in\n1937\n. In August\n1937\nthe Japanese began an attack on Shanghai which was strongly defended by the Chinese. For over three months Shanghai was the centre of a fierce battle during which time it faced air and sea attacks from the Japanese who made amphibious landings on the beaches of the Jiangsu coast. Shanghai fell to the Japanese on\n26\nNovember\n1937\n, large numbers having been killed on each side. The University was temporarily relocated to the French Concession in Shanghai and Wu continued his studies of mathematics, graduating with his first degree in\n1940\n. However, the war was still gripping China at this time, and the University was dispersed to various places in central China, so Wu could not continue his studies and undertake research as he would have wished. He took a position as a mathematics teacher in a school.\nThe war continued but from\n1941\nit became part of the wider conflict of World War II. It lasted until\n1945\nwhen Japan surrendered. Chiao-Tung University was re-established as a Temporary University in Shanghai after the war, and Wu was appointed as an assistant in\n1945\nwhich allowed him to restart his mathematical studies. In\n1946\nhe met\nShiing-Shen Chern\nwho was at that time working on setting up an Institute of Mathematics as part of the\nAcademia Sinica\n. Wu writes\n[\n1\n]\n:-\nThis meeting with\nChern\nwas decisive for the future of my career in mathematics.\nWu was admitted as a research student at the Institute of Mathematics and, also in\n1946\n, took the examinations to compete for a scholarship to study abroad. He was successful and in\n1947\nhe went to France as part of the Sino-France Exchange Program. He went to the University of Strasbourg where he undertook research with\nCharles Ehresmann\nas his advisor. Wu's first publication in\n1947\nwas\nNote sur les produits essentiels symétriques des espaces topologiques\nⓉ\n(\nNote on symmetric essential products of topological spaces\n)\n. The following year saw a wealth of papers from Wu:\nOn the product of sphere bundles and the duality theorem modulo two\n;\nSur l'existence d'un champ d'éléments de contact ou d'une structure complexe sur une sphère\nⓉ\n(\nOn the existence of a field of contact elements or a complex structure on a sphere\n)\n;\nSur les classes caractéristiques d'un espace fibré en sphères\nⓉ\n(\nOn the characteristic classes of a spherical fiber space\n)\n;\nSur le second obstacle d'un champ d'éléments de contact dans une structure fibrée sphérique\nⓉ\n(\nOn the second obstacle of a field of contact elements in a spherical fiber structure\n)\n; and\nSur la structure presque complexe d'une variété différentiable réelle de dimension\n4\nⓉ\n(\nOn the almost complex structure of a real differentiable variety of dimension\n4\n)\n. Wu was awarded his doctorate in\n1949\nfor his thesis\nSur les classes caractéristiques des structures fibrées sphériques\nⓉ\n(\nOn the characteristic classes of spherical fiber structures\n)\nin which he made a detailed study of characteristic classes via Grassmannian varieties.\nFollowing the award of his doctorate, Wu went to Paris where he studied with\nHenri Cartan\n.\nThom\n, a student of\nCartan\n's, had held a CNRS research post at Strasbourg while Wu was studying there and they had got to know each other at this time and exchanged mathematical ideas, beginning a good collaboration. While working in Paris during the early months of\n1950\n,\nThom\ndiscovered the topological invariance of\nStiefel\n-\nWhitney\nclasses, while Wu discovered  a set of invariants and formulas, now called the Wu classes and Wu formulas, which have also proved important. He went on to use the classes he had introduced to prove a beautiful result on embedding manifolds in Euclidean space. In\n1951\nWu returned to China where he was appointed to Peking University, then two years later he was appointed as a researcher in the\nAcademia Sinica\n. Wu wrote:-\nFrom\n1953\nonwards I made a somewhat systematic investigation of classical topological but non-homotopic problems which were being ignored at that time owing to the rapid development of homotopy theory. I introduced the notion of imbedding classes, and established a theory of imbedding, immersion, and isotopy of polyhedra in Euclidean spaces which was published in book form later in\n1965\n.\nThe cultural revolution was launched by Mao Zedong, Chairman of the Communist Party of China, in May\n1966\n. One of the aims was to send intellectuals to undertake manual jobs in the countryside and factories. Wu was sent to work in a factory manufacturing computers. In fact this led to a change in his interests as he himself explained:-\nI was initially struck by the power of the computer. I was also devoted to the study of Chinese ancient mathematics and began to understand what Chinese ancient mathematics really was. I was greatly struck by the depth and powerfulness of its thought and its methods. It was under such influence that I investigated the possibility of proving geometry theorems in a mechanical way.\nAlthough at first sight the two ideas of computer proof and ancient Chinese mathematics appear to be at the opposite ends of the spectrum, Wu saw that the philosophy behind ancient Chinese mathematics was the development of algorithms rather than the axiomatic abstract approach begun by the ancient Greeks and developed in the West. In\n1977\nWu introduced a new way of studying geometry on a computer. He based his method on the idea of a characteristic set which had been introduced by\nJoseph Ritt\nin his algebraic and algorithmic approach to differential equations.\n(\nIt is worth noting that\nRitt\n's approach was based on earlier ideas of\nvan der Waerden\n.\n)\nWith his new ideas Wu could take a problem in elementary geometry and transform it into an algebraic question about polynomials. Computers were able to answer questions about polynomials so Wu had a powerful method of proving geometric theorems on a computer. He wrote the important book\nMechanical theorem proving in geometries\n(1984)\nin Chinese which was translated into English and published ten years later. The book has six chapters:\nDesarguesian geometry and the Desarguesian number system.\nOrthogonal geometry, metric geometry and ordinary geometry.\nMechanization of theorem proving in geometry and\nHilbert\n's mechanization theorem.\nThe mechanization theorem of\n(\nordinary\n)\nunordered geometry.\nMechanization theorems of\n(\nordinary\n)\nordered geometries.\nMechanization theorems of various geometries.\nIt is in Chapter\n4\nthat Wu explains how to translate geometrical problems into polynomial equations. In\n2000\nWu published\nMathematics mechanization : Mechanical geometry theorem-proving, mechanical geometry problem-solving and polynomial equations-solving\n. Timothy Stokes writes:-\nWu and his followers have made great progress and this book should be of interest to Western readers in particular, not least for the diversity of topics addressed by the methods.\nWu extended his mechanization interest, combining it with his original interest in topology to produce computational techniques to handle rational homotopy theory.\nRecognition for Wu's achievements was quick. He became a member of the\nChinese Academy of Sciences\nin\n1956\n, receiving one of the three national prizes for natural sciences. He was an invited speaker at the International Congress of Mathematicians in Edinburgh, Scotland, in\n1958\nbut was unable to attend. He was invited for the second time to give an invited lecture, this time on the history of ancient Chinese mathematics, to an International Congress of Mathematicians, this time in Berkeley in\n1986\n. He was elected to the Academy of Sciences for the Developing World in\n1991\n, receiving their mathematics award. He received the\nHerbrand\nAward in\n1997\nfrom the Conference on Automated Deduction. He also received the first State Supreme Science and Technology Award of the Chinese government in\n2001\n:-\n... in recognition of achievements in mathematics research, both in pure mathematics and in mathematics mechanization.\nIn\n2006\nhe was awarded the Shaw Prize in Mathematical Sciences\n(\njointly with\nDavid Mumford\n)\n:-\nFor his contributions to the new interdisciplinary field of mathematics mechanization.\nIn\n2008\nSelected works of Wen-Tsun Wu\nwas published. The Foreword was written by Wu who explained the various stages in his career:-\nThe present 'Selected papers' may be considered as a brief survey of my scientific career in mathematical sciences. My researches in mathematical sciences consist of two stages. The researches in the first stage, started in\n1947\n, are in pure mathematics, mainly in algebraic topology, occasionally also in algebraic geometry. This ended actually in\n1965\n, the beginning of the Cultural Revolution. ... During the Cultural Revolution there were however some sporadic research works in pure mathematics, with papers published a little later. ... Such researches stopped completely at the end of the Cultural Revolution, viz. the year\n1976\n. The second stage of my mathematical researches took place during the Cultural Revolution. It took place owing to my learning of the history of our proper mathematics in ancient times. ... During the Cultural Revolution I was sent to some computer-manufacturing company to learn and work with laborers. Being struck by the powerfulness of computers I began to consider applying computers to the study of mathematics. This resulted in a method of proving geometry theorems by means of computers. Extending further the method gave rise to the subject that I called mathematics mechanization, which had an immense variety of applications in science and technology, besides mathematics itself.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Topology"
  ]
}