{
  "nome_completo": "Wilbur Richard Knorr",
  "nome_curto": "Wilbur Knorr",
  "ano_nascimento": "1945",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Knorr/",
  "lugar_nascimento": "Richmond Hill, New York, USA",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Wilbur Knorr\n's parents were Wilbur Knorr Sr. and Dorothy Louise Kiefer\n(1922\n-\n2013)\n. Wilbur Jr, the subject of this biography, and his sister Valerie grew up in West Islip on Long Island, New York. Dorothy Kiefer had attended New York University, Hunter College and Adelphi. She was a lifetime member of American Mensa and her hobbies were opera, ballet, theatre, crossword puzzles and baking, and she was an avid and loyal fan of the New York Yankees. After Wilbur's sister Valerie grew up, she graduated from the University of California at Berkeley and became a teacher before marrying Mike Maione.\nKnorr attended high school in New York where he showed himself to be an exceptionally talented musician playing the violin. At this time he was in the New York State Youth Orchestra. In\n1963\nhe entered Harvard University and graduated with his B.A.\n(\nsumma cum laude\n)\nin history and science in\n1966\n. His senior thesis was entitled\nDerivatives with Any Index Whatever: A Study of the Origins of the Fractional Differential Calculus and Its Place in the Work of Euler, Abel, and Riemann\n. Remaining at Harvard, he studied for a Master's Degree and was awarded his A.M. in\n1968\n. Like Knorr, Joseph W Dauben began undertaking research on the history of mathematics at Harvard in\n1966\n. Dauben writes\n[\n8\n]\n:-\n... in the fall of\n1966\nI found myself on the East Coast, in Cambridge, where there was a lively, if small but in retrospect remarkable, concentration of historians of mathematics. The Department for History of Science, one of the first in the country, had just been established, and I was among the earliest groups to join the new department, along with my friend, colleague, and fellow historian of mathematics Wilbur Knorr. Wilbur and I were very fortunate to have been trained by, among others, John Murdoch and Judith Grabiner, who prepared us with tutorials for just the two of us for our oral examinations prior to working on our Ph.D.'s.\nDauben also related some of Knorr's summer activities while he was a graduate student\n[\n8\n]\n:-\nI Bernard Cohen, at Harvard, served as IBM's chief historical consultant. That led to several summers when both Wilbur Knorr and I, among a number of graduate students, were employed to work for IBM on a massive history of computing database that Cohen was overseeing.\nWe note that I Bernard Cohen\n(1914\n-\n2003)\nwas a professor of the history of science at Harvard who had studied for his doctorate under George Sarton.\nAt Harvard, Knorr's thesis advisors were John Emery Murdoch\n(1927\n-\n2010)\nand Gwilym Ellis Lane Owen\n(1922\n-\n1982)\n. Owen, born in Wales and educated in England, was an expert on the history of Ancient Greek philosophy. He had been appointed to Harvard in\n1966\n. Murdoch was Professor of History of Science at Harvard and Chair of the Department from\n1966\nto\n1971\nand again from\n1974\nto\n1975\n. He was an expert on ancient and medieval medicine and philosophy. The ideas that led to Knorr's thesis came from lectures given by his thesis advisors. Knorr writes in the introduction to his book\nThe evolution of the Euclidean elements\n(1975)\n:-\nThe initial ideas from which this project\n[\nhis thesis\n]\ndeveloped\n(\nChapter VI, Section III and Chapter VII, note\n11)\ncame to me during the course of graduate studies on ancient mathematics with J E Murdoch and G E L Owen early in\n1968\n. I should like to express my thanks to Professors Murdoch and Owen, who as my thesis advisors criticised, but also consistently encouraged my efforts ...\nFrom\n1968\nto\n1971\nKnorr was a teaching fellow and teaching assistant at Harvard and, after this, he was appointed as a junior faculty member at the University of California in Berkeley. He was awarded his Ph.D. in\n1973\nfor his thesis\nThe Pre-Euclidean Theory of Incommensurable Magnitude\n, and then received a grant from the United States National Science Foundation\n(\nNATO Postdoctoral Fellowship Program\n)\nto finance two years study abroad. He spent\n1973\n-\n74\nand\n1974\n-\n75\nat the University of Cambridge in England where he worked on further research which culminated in the publication of the book\nThe Evolution of the Euclidean Elements : A Study of the Theory of incommensurable Magnitudes and its significance for early Greek Geometry\n. The book contained material from his Ph.D. thesis as well as a considerable amount of new material which he had worked on while in Cambridge. He acknowledged the support he had from those at the University of Cambridge:-\nI should like to thank the members of the Department of History and Philosophy of Science, University of Cambridge, for support during the tenure of my grant.\nSee\nTHIS LINK\nfor abstracts of Prefaces, Introductions, and reviews of this book and the other three books written by Knorr.\nReturning to the United States, Knorr was appointed to the History of Science Department at Brooklyn College. Brooklyn College is in New York City and, by the time he was appointed, the City was in severe financial problems having borrowed large sums which it struggled to pay back. About $\n100\nmillion was due to be repaid in October\n1975\nand the City did not have the cash. It narrowly avoided bankruptcy with risky measures such as the teachers' union investing $\n150\nmillion of their pension funds in City securities. One of the consequences of the difficult financial decisions that had to be made was to close the History of Science Department at Brooklyn College. So Knorr was out of a job by\n1978\n. He was able to spend\n1978\n-\n79\nat the Institute for Advanced Study at Princeton supported by a National Science Foundation grant. During this time he worked on his next book\nAncient Sources of the Medieval Tradition of Mechanics: Greek, Arabic, and Latin studies of the balance\n(1982)\n. In the book he gave this acknowledgement:-\nI wish to express my gratitude to the American Council of Learned Societies, to the Institute for Advanced Study and to the National Science Foundation for research support.\nKnorr was appointed to Stanford University in the summer of\n1979\nbut, since he was still supported by the National Science Foundation grant, he did not take up the appointment at Stanford until the spring of\n1980\n. We note that up to this time Knorr had continued to play the violin in university orchestras but after his appointment to Stanford he decided that he could not afford the time to continue with his music at that level. The initial appointment was a temporary one but in\n1983\nhe was given the permanent position of Associate Professor. In\n1990\nhe became a full professor having joint appointments in the Department of Classics and the Department of Philosophy, and in the History of Science Program.\nKnorr wrote four books. These books were all expensive and as a result did not sell well. The expense was due partly to their length and the many line drawings and photographs in them.\nDavid Fowler\nadds\n[\n9\n]\n:-\nAlas, this was one of the features that, to begin with, restricted their circulation and readership; another was, quite frankly, the difficulty in reading them, a combination of their length, their meticulousness, their minutely referenced notes, and, often, the novelty, boldness, and revisionism of their point of view, as long-held and cherished opinions were subject to new investigation.\nKnorr wrote nearly\n100\narticles and reviews. We give some information on\n19\nof his papers at\nTHIS LINK\n. For each of these\n19\npapers we give Knorr's Abstract or his Summary or an extract from his Introduction.\nIn August\n1996\nhe was found to have melanoma, skin cancer. Henry Mendell writes\n[\n12\n]\n:-\nThe first time I saw Wilbur after learning of his illness, we went to his office. It was in its usual mess, with books piled up, papers everywhere, the shelves packed. He observed me admiring his collections, as I always did. This time he said, \"You're coveting them.\" I confessed. He then suggested that I join him in some little \"perfidy.\" After his death, I did.\nDavid Fowler\nrelates the events near the end of Knorr's short life\n[\n9\n]\n:-\nWhen, in Autumn\n1996\n, he was invited to attend a meeting to celebrate my\n60\nth\nbirthday, and after his melanoma had been diagnosed and treatment had been initiated, it was as though he planned to come and present to me his final ideas on this, his first interest - an ingenious and attractive supplement to his original proposals on incommensurability - in a last attempt to win me back to his own point of view and persuade me that it was, by and large, more plausible than my own. In January\n1997\n, after interferon treatment for his cancer that seemed to do nothing to arrest its progress, he gave a talk at a joint\nAMS\nand\nMAA\nconference in San Diego; he looked fitter than everyone else, he was still jogging daily, and nobody could have guessed that he was dangerously ill. At the end of January, just before aggressive chemotherapy and radiation treatment had started, he was still hoping to arrange this medical regime round his trip to England in mid-April. But, by the end of February, when the treatment had left him so weak that such a visit seemed impossible, he prepared a paper to be read in his absence. There was an ominous note in a business-like letter on March\n10\n, discussing the details: \"My condition has become even more complicated of late with some new symptoms currently undiagnosed. So it seems clear that I will not be able to attend the conference in April.\" A week later he fell into a coma and died on March\n18\n. These last weeks must have been as active as, or even more so than, any others in his life, as other reports show. Henry Mendell, his one-time student, friend, and literary executor, e-mailed me the day before his death, and finished with: \"It is heart rending to see someone's intellectual life end on p.\n40\n, halfway through page proofs.\" And the editor of the journal in which 'Sacrobosco's Quadrans: Date and Sources' appears added a note which reads as follows: \"Dr Knorr, having revised the text of this article to meet the comments of a referee, mailed the typescript and computer disc to the Editor on\n10\nMarch, together with a letter that included his proposed Note on Contributor. The letter made no mention of the writer's health, but because he was rumoured to be unwell, the article was immediately copyedited, proofed, and proof-read, and a marked set of proofs was posted to the author on\n18\nMarch. Sadly, on that very day Dr Knorr passed away.\"\nAs indicated by this quote, Knorr worked up to the last days of his life but he still left much material in unfinished form\n[\n12\n]\n:-\nWilbur left many incomplete projects. Early in the\n1990\ns he had begun a series of projects on medieval illuminated astronomical manuscripts, some of which he published. He had hoped to show by the illuminations that a large family of twelfth-century astronomical manuscripts came from the same school in Paris. This project had become of passionate interest, and he was working to finish some of it and to organize his documents and microfilms during the last weeks of his life.\nWe should end by looking at Knorr's character. First we quote from\nDavid Fowler\n[\n9\n]\n:-\nA dedicated scholar whose only real indulgence was books, a rather private person who could come across as a terrifying machine for producing learned books and articles - this may conjure up a vision of a stooping and reclusive hermit. But no! His essential need in life besides a good library was a good\ngymnasium\n, where he would weightlift and work out. He had warm and close relations with his family: his first book is dedicated to the memory of his father and uncle; the photograph on the dust jacket of his last shows his nephew, niece, and their penguin struggling to climb on the lap of their favourite Uncle Billy; and his mother moved to Palo Alto for the last weeks of his life while his sister came for visits whenever she could. ... His friends know of his playfulness and his infuriating puns, his love of roses and baroque music, and his generosity of spirit.\nNext we quote from\n[\n11\n]\n:-\nUniting a passion for precise scholarship with a gentle, quirky humour, Wilbur was a forceful scholar and a kind man.\nIn\n[\n14\n]\nthe following quote appears:-\n... he was a wonderful person, passionate about everything he did, rose gardening, weight lifting, Biblical study ... frugal in his personal life\n(\nexcept when it came to book acquisition\n)\n...",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}