{
  "nome_completo": "Wilhelm Ackermann",
  "nome_curto": "Wilhelm Ackermann",
  "ano_nascimento": "1896",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ackermann/",
  "lugar_nascimento": "Schönebeck (Kr. Altena), Germany",
  "lugar_morte": "Lüdenscheid, Germany",
  "biografia": "Wilhelm Ackermann\nwas a mathematical logician who worked with\nDavid Hilbert\nin Göttingen but spent his career as a high school teacher.\nAckermann entered the University of Göttingen in\n1914\nto study mathematics, physics and philosophy. However soon after he began his studies Word War I started. Ackermann was drafted into the army in\n1915\nand continued to serve until\n1919\nwhen he was able to return to his studies in Göttingen. He received his doctoral degree in\n1925\nwith a thesis\nBegründung des \"tertium non datur\" mittels der Hilbertschen Theorie der Widerspruchsfreiheit\nⓉ\n(\nFoundation of the 'tertium non datur' using  Hilbert's theory of consistency\n)\nwritten under\nDavid Hilbert\n's supervision. It provided a proof of the consistency of arithmetic without induction. It was intended to be a consistency proof for elementary analysis although this proof contained significant errors. Richard Zach explains the background to the thesis in\n[\n6\n]\n:-\nAckermann's\n1924\ndissertation is of particular interest since it is the first non-trivial example of what\nHilbert\nconsidered to be a finitistic consistency proof.\nVon Neumann\n's paper of\n1927\n, the only other major contribution to proof theory in the\n1920\ns, does not entirely fit into the tradition of the\nHilbert\nschool, and we have no evidence of the extent of\nHilbert\n's involvement in its writing. Later consistency proofs, in particular those by\nGentzen\nand\nKalmár\n, were written after\nGödel\n's incomplete ness results were already well-known and their implications understood by proof theorists. Ackermann's work, on the other hand, arose entirely out of\nHilbert\n's research project, and there is ample evidence that\nHilbert\nwas aware of the range and details of the proof.\nAfter submitting his dissertation, Ackermann went to Cambridge, England, where he spent the first half of\n1925\n. He was awarded a Rockefeller Scholarship to support this trip and\nHilbert\nwrote in support of his application showing his high opinion of Ackerman's work\n[\n6\n]\n:-\nIn his thesis \"Foundation of the 'tertium non datur' using\nHilbert\n's theory of consistency,\" Ackermann has shown in the most general case that the use of the words \"all\" and \"there is,\" of the \"tertium non datur,\" is free from contradiction. The proof uses exclusively primitive and finite inference methods. Everything is demonstrated, as it were, directly on the mathematical formalism. Ackermann has here surmounted considerable mathematical difficulties and solved a problem which is of first importance to the modern efforts directed at providing a new foundation for mathematics.\nAckermann was also the main contributor to the development of the logical system known as the epsilon calculus, originally due to\nHilbert\n. This formalism formed the basis of\nBourbaki\n's logic and set theory.\nFrom\n1929\nuntil\n1948\nhe taught as a teacher at the Arnoldinum\nGymnasium\nin Burgsteinfurt and in Luedenscheid. He was corresponding member of the Akademie der Wissenschaften in Göttingen, and was honorary professor at the Universität Münster.\nIn\n1928\n, Ackermann observed that\nA\n(\nx\n,\ny\n,\nz\n)\nA(x, y, z)\nA\n(\nx\n,\ny\n,\nz\n)\n, the\nz\nz\nz\n-fold iterated exponentiation of\nx\nx\nx\nwith\ny\ny\ny\n, is an example of a recursive function which is not primitive recursive.\nA\n(\nx\n,\ny\n,\nz\n)\nA(x, y, z)\nA\n(\nx\n,\ny\n,\nz\n)\nwas simplified to a function\nP\n(\nx\n,\ny\n)\nP(x, y)\nP\n(\nx\n,\ny\n)\nof two variables by\nRozsa Peter\nwhose initial condition was simplified by\nRaphael Robinson\n. It is the latter which occurs as Ackermann's function in today's textbooks. Also in\n1928\nthe often reprinted book\nGrundzüge der Theoretischen Logik\nⓉ\n(\nPrinciples of Theoretical Logic\n)\nby\nHilbert\nand Ackermann appeared.\nAmong Ackermann's later work are consistency proofs for set theory\n(1937)\n, full arithmetic\n(1940)\nand type free logic\n(1952)\n. Further there was a new axiomatization of set theory\n(1956)\n, and a book\nSolvable cases of the decision problem\n(\nNorth Holland,\n1954\n. Second edition,\n1962)\n.\nThe new axiomatization of set theory was presented by Ackermann in\nZur Axiomatik der Mengenlehre\nⓉ\n(\nOn axiomatic set theory\n)\n(1956)\n. Dana Scott writes\n[\n5\n]\n:-\nA remarkably simple axiomatization of a system of set theory is presented which the reviewer feels deserves serious consideration. The system is formalized in an applied first-order calculus with identity using a binary predicate\n∈\n\\in\n∈\n(\nmembership\n)\nand a singulary predicate M\n(\nbeing a set\n)\n. It is quite essential for the consistency of the system that M is not definable in terms of\n∈\n\\in\n∈\n. The axiom of extensionality is assumed so that all the individuals can be considered as collections of individuals, but it is easily proved from the axioms that there are collections that are not sets and even contain non-sets. The necessity for the existence of such improper collections in the theory makes comparison with the standard systems of set theory somewhat difficult.\nRudolf Grewe, who wrote his doctoral dissertation on Ackermann's set theory in\n1966\n, gives models for the theory in\n[\n2\n]\n. Several other authors have studied this system and references are given in\n[\n2\n]\n.\nIn\n1957\nAckermann published\nPhilosophische Bemerkungen zur mathematischen Logik und zur mathematischen Grundlagenforschung\nⓉ\n(\nPhilosophical remarks on mathematical logic and  basic mathematical research\n)\nand its English translation\nPhilosophical observations on mathematical logic and on investigations into the foundations of mathematics\n. This paper, written for non-experts in the subject, gives an excellent overview of how Ackermann viewed mathematical logic. John Van Heijenoort writes\n[\n3\n]\n:-\nAn objection to mathematical logic is that it is not the same as the philosophical logic which forms the foundation of our thought and which alone is necessary for thinking. Ackermann remarks that the traditional modes of inference are included in mathematical logic, besides many others, like the statement logic or the logic of relations. One has the illusion of getting by with \"Aristotelian logic\" in mathematics just as long as mathematical reasonings are insufficiently analyzed.\nA further objection to mathematical logic is that it is incomplete, in the sense that, by\nGödel\n's result of\n1931\n(\nthe text says\n1932)\n, intuitively correct theorems cannot be proved within a given system. But intuitive thinking is not consistent; paradoxes arise on the basis of modes of inference which from the naive intuitive point of view have to be considered correct. If we restrict intuitive inference so that paradoxes are eliminated, we come to a formal system, and incompleteness is the price we have to pay for consistency.\nMathematical logic is of use in clarifying the concepts of \"necessity\" and \"possibility,\" the distinction between \"analytic\" and \"synthetic.\" Discussing the \"triviality\" of logic, the author presents the decision problem.\nMathematics is today viewed as an investigation of structures; but the obviousness connected with the concept of natural number is independent of any axiomatically introduced structure. Ackermann presents\nintuitionism\n, which constructs a mathematics with a minimum of logic, and the\nFrege\n-\nRussell\nanalysis of the number concept. He defends this analysis against certain objections\n(\ncircularity, necessity of an axiom of infinity\n)\n. He remarks that\nBrouwer\nreduced the number intuition to two concepts: unity and possibility of repeatedly distinguishing a unity from another. In these concepts \"there is nothing foreign to logic.\" He concludes that \"in the theory of natural numbers we have a domain which is capable of an intuitive foundation with a minimum of logic in the sense of\n[\nBrouwer\n]\nand also of attainment purely by logical definitions if we presuppose an extensive logic.\"\n...\nThe paper ends with remarks on geometry, as a science conveying knowledge of the external world. Beyond any axiomatic treatment of geometry there are intuitive geometrical impressions which force themselves upon us with compelling power. In order to obtain a systematic and complete whole we may add principles in which free constructions occur. But, although limits may be difficult to trace, there remains a nucleus of obligatory intuitive elements. Thus the author sketches a position distinct, on the one hand, from a comprehensive apriorism in the sense of Kant and, on the other hand, from a thoroughgoing conventionalism.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}