{
  "nome_completo": "Otto Wilhelm Fiedler",
  "nome_curto": "Wilhelm Fiedler",
  "ano_nascimento": "1832",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fiedler_Wilhelm/",
  "lugar_nascimento": "Chemnitz, Saxony, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Wilhelm Fiedler\nwas the son of Christian Wilhelm Fiedler, a shoemaker, and his wife Amalie Ruppert from Neukirchen. The family were poor and young Wilhelm grew up in his father's workshop where he learnt to have persistence, to be hardworking, energetic and loyal, to always live frugally and have a thirst for knowledge. He was an inquisitive child, always wondering about the properties of the water, oil and candles that he saw around him. Like many children of this time, he was lucky to survive childhood illnesses. On one occasion his father was told by the doctor that young Wilhelm would not live but his parents would not give up and nursed him back to health. Once when he was bringing beer from a truck, he was run over by the truck, broke his collarbone and suffered crushed fingers. The company owner came to see the lad and brought some of his favourite pictures to show him. He realised that Wilhelm took a keen interest in the pictures and showed considerable drawing abilities.\nIn\n1838\nhe entered the elementary school in Chemnitz and then, in\n1841\n, he progressed to the middle school. Although his parents had to pay for this school, it cost very little and, despite their poverty, they were able to afford it. Fiedler quickly showed his talents and progressed to the top of the class. He showed particular ability in arithmetic but he also had a passion and a talent for drawing, although mostly this consisted of copying. His art teacher was impressed and encouraged him to work outside school, both by having Sunday as a drawing day and also by attending adult drawing classes. In\n1844\n, when he was twelve years old, he had a pen and ink drawing exhibited and this was seen by C A Caspary. When Caspary enquired about the artist, he was told that the lad was soon to leave the school since he was too poor to continue. Caspary talked to Fiedler's father and persuaded him to accept support to allow his son to continue his education.\nCaspary himself began to teach Fiedler but discovered that despite his drawing abilities, he was passionate about mathematics. Fiedler was always very grateful for the help and inspiration he received from Caspary. Fiedler now made an ink drawing of\nLeonardo da Vinci\n's 'Last Supper' and the money he made by selling it, and other works, helped him continue with his education. His art teacher pressed him to take up a career as a painter. In\n1846\nFiedler won a state scholarship which enable him to attend the School of Arts and Crafts in Chemnitz. He spent three years at this school where he was taught mechanics by Julius Rotnig. Rotnig, who had been a pupil of Julius Ludwig Weisbach\n(1806\n-\n1871)\nwas an excellent teacher. He took Fiedler deeper into his field and suggested that he should continue his studies under Weisbach. Weisbach was professor of applied mathematics and mechanics at the Bergakademie in Freiberg and, in\n1849\n, Fiedler began his studies in Freiberg as an external student. The Bergakademie, founded in\n1765\n, is the oldest university of mining and metallurgy in the world and today is known as the Freiberg University of Mining and Technology. At first Fiedler lived with a shoemaker in Freiberg, studying mathematics sitting in one of the windows of the workshop while there was hammering and sewing of shoes in the other window. He gave private tuition to make enough money to pay for his room.\nFiedler's studies at the Bergakademie in Freiberg lasted for three years. He was taught by Julius Weisbach and by Ferdinand Reich\n(1799\n-\n1882)\n. Reich, a chemist and physicist, is famed for the discovery of the metallic element indium in\n1863\nwhile testing ores from the mines around Freiberg. Fiedler studied both practical mechanics and applied mathematics during his three years at the Bergakademie. After he graduated in\n1852\nhe became a mathematics and mechanics teacher at the newly founded Werkmeisterschule in Freiberg. This was not exactly what Fiedler wanted since his ambition had been to study at the University of Freiberg. He spent a year in that position before returning to Chemnitz where he was appointed as a mathematics and mechanics teacher at the Gewerbeschule. He had to return to Chemnitz since his father had died and he now had the task of taking care of his mother and three siblings. This position was not well paid but, in\n1857\nhe was able to take the place of another colleague as a teacher of mathematics and descriptive geometry. This was better paid and gave him more time for private study.\nIt was through this private study that Fiedler intended to teach himself university level mathematics and, more than this, he wanted to become expert enough to be able to undertake research of sufficient standard that he could earn a doctorate. This was a remarkably difficult task, given that he had a demanding full-time job, and he had no professors to advise him about his studies. Fiedler was not content to study just mathematics but he wanted to give himself an all-round university level education which he felt he totally lacked. He therefore studied, in addition to mathematics, topics such as philosophy, pedagogy, history, literature and languages. He later also studied geography and theology. Over the next few years he studied around\n250\nbooks including mathematical works by\nMichel Chasles\n,\nGabriel Lamé\n,\nJean Claude Barré de Saint-Venant\n,\nJean-Victor Poncelet\n,\nJakob Steiner\n,\nJulius Plücker\n,\nKarl von Staudt\n,\nGeorge Salmon\n,\nArthur Cayley\n, and\nJames Joseph Sylvester\n.\nNot only did Fiedler do a great deal of self-study but with his friends, the geologist Adolf Knop and the chemist Alexander Müller, he led an organised series of scientific and literary lecture evenings in Chemnitz. Fiedler himself lectured on a wide variety of topics in addition to mathematics, physics and astronomy. He lectured on meteorology, the work on physiology studied by\nHermann von Helmholtz\nand the experimental psychology of Ernst Heinrich Weber\n(1795\n-\n1878)\n. Perhaps even more surprising, he became expert in the Low German poems of Fritz Reuter\n(1810\n-\n1874)\n, the fairy tales of the Brothers Grimm, and the investigation of myths made by Johann Wolfgang Goethe\n(1749\n-\n1832)\n.\nFiedler's introduction to mathematics had come through practical applications and applied mathematics. His first work was in these areas and he translated\nGabriel Lamé\n's\nLeçons sur la théorie mathématique: de l'élasticité des corps solides\nⓉ\n(\nLectures on the mathematical theory of elasticity of solid bodies\n)\n(1852)\n,\nLamé\n's\nLeçons sur les fonctions inverses des transcendantes et les surfaces isothermes\nⓉ\n(\nLessons on inverse transcendent functions and isothermal surfaces\n)\n(1857)\nand\nJean Claude Barré de Saint-Venant\n's work on bending and torsion. Not only did he translate these works but he also made some advances of his own in these areas. However, he learnt of\nAlfred Clebsch\n's work, in particular he discovered that he was writing a major work on elasticity so Fiedler decided to change areas. In fact\nClebsch\n's book\nTheorie der Elastizität fester Körper\nⓉ\n(\nTheory of elastic solids\n)\nwas published in\n1862\n. Fiedler turned to geometry and studied the ideas of\nJakob Steiner\n,\nJulius Plücker\n,\nAugust Möbius\n,\nKarl von Staudt\nand the French mathematicians\nJean-Victor Poncelet\n,\nMichel Chasles\nand\nGabriel Lamé\n. In\n1858\nFiedler submitted his thesis\nDie Zentralprojektion als geometrische Wissenschaft\nⓉ\n(\nThe central projection as geometric science\n)\nto\nAugust Möbius\nat the University of Leipzig who recommended that Fiedler be awarded a doctorate. He received his doctorate in\n1859\n. It is interesting to note that Fiedler's thesis was much influenced by his knowledge of art and he gives a purely geometric description of perspective in his doctoral dissertation. It was published in\n1860\n. At this time, Fiedler continued to teach at the Gewerbeschule in Chemnitz.\nIn\n1860\nFiedler married Lina Elise Springer from Neukirchen, the daughter of Albert Springer, a merchant, but brought up by Ernst Iselin Clauss, a manufacturer who owned a factory in Chemnitz. Wilhelm and Elise Fiedler had seven children, the eldest,\nErnst Fiedler\n, became a mathematician and has a biography in this archive. Another of their sons, Alfred Fiedler\n(1863\n-\n1894)\n, lectured on zoology at the University of Zürich.\nFiedler read\nGeorge Salmon\n's\n1855\nA Treatise on Conic Sections containing an Account of Some of the Most Important Modern Algebraic and Geometric Methods\n. He found the work fascinating and in\n1859\nhe wrote to\nSalmon\nasking if he could make a free German translation of the work. The first edition of Fiedler's translation, with title\nAnalytische Geometrie der Kegelschnitte mit besonderer Berücksichtigung der neueren Methoden\nⓉ\n(\nAnalytical geometry of conic sections with special emphasis on newer methods\n)\n, was published in\n1860\nbut Fiedler went on to bring out a total of seven editions each of contains material which he added to bring the work up to date. For example the second edition, published in\n1866\n, is described by Fiedler as \"second revised and modernised edition\". In\n1862\nFiedler published\nDie Elemente der neueren Geometrie und die Algebra der binären Formen: Ein Beitrag zur Einführung in die Algebra der linearen Transformationen\nⓉ\n(\nThe elements of modern geometry and the algebra of binary forms: A Contribution to the introduction to the algebra of linear transformations\n)\n. In the following year he published a German translation of\nSalmon\n's\nLessons Introductory to the Modern Higher Algebra\n(1859)\nunder the title\nVorlesungen zur Einführung in die Algebra der linearen Transformationen\nⓉ\n(\nIntroductory Lectures on the algebra of linear transformations\n)\n(1863)\n.\nSalmon\n's\nA Treatise on the Analytic Geometry of Three Dimensions\n(1862)\nwas translated by Fiedler and was published in two volumes, the first under the title\nAnalytische Geometrie des Raumes. I Theil. Die Elemente und die Theorie der Flächen zweiten Grades\nⓉ\n(\nAnalytic geometry of space. Section\n1\nThe elements and the theory of the surfaces of the second degree\n)\n(1863)\n.\nThe Fiedler family moved to Prague in\n1864\nwhen he was appointed as professor of descriptive geometry at the Technical University there. While in Prague, Fiedler published the second volume of\nSalmon\n's\nA Treatise on the Analytic Geometry of Three Dimensions\n(1862)\nunder the title\nAnalytische Geometrie des Raumes II Theil. Die Theorie der Curven im Raume und der algebraischen Flächen\n(1865)\n. It was a difficult time for him, however, for the Austro-Prussian War\n(\nalso called the Seven Weeks' War\n)\nwas fought in\n1866\nbetween the German Confederation and Prussia. Fiedler supported Otto von Bismarck who led the Prussian side but these were difficult times with the population of Prague split as to whom they supported. The war ended with the Prussian army occupying Prague and the Treaty of Prague was signed. This was a crucial step in the unification of Germany. Fiedler spent only three years in Prague before he was appointed in\n1867\nto fill the chair of descriptive geometry at the Polytechnic in Zürich, which had become vacant following the death of Josef Wolfgang von Deschwanden\n(1819\n-\n1866)\n. The President of the Swiss School Board had visited Fiedler in Prague in the winter of\n1866\n-\n67\nto complete the final negotiations for his move to Zürich but these proved quite difficult and lengthy as Fiedler was unhappy with the time allocated to the teaching of descriptive geometry in the Polytechnic. Once he had secured sufficient time to teach his subject, Fiedler was keen to move, attracted by the independence and political freedom of Switzerland as well as its artistic sense and the beautiful location of the city. The family made their home in Zürich just at the time that the city had the\n1867\ncholera epidemic but at least they avoided the problems of the Franco-Prussian war of\n1870\n. They became Swiss citizens in\n1875\n. Let us quote now from Marta Menghini's interesting article\n[\n7\n]\nabout translations of Fiedler's work into Italian:-\n... in\n1874\n,\n[\nan Italian\n]\ntranslation of a German book appeared. It was a book of descriptive geometry by Wilhelm Fiedler\n(1832\n-\n1912)\n. Although it was written for the Technische Hochschulen, which are university level schools in Germany, the Italian edition was explicitly translated and adapted for use at the secondary school level, in the Technical Institutes of the Italian Kingdom. It was certainly appropriate to have Fiedler's book alongside\nCremona\n's 'Projective Geometry' in the parallel course of descriptive geometry at the Technical Institutes. According to Fiedler, the main scope of the teaching of descriptive geometry is the scientific construction and development of \"Raumanschauung\". Fiedler reinforced this point of view in a paper translated and published in the 'Giornale di Matematiche'. Fiedler sees a complete symbiosis between descriptive and projective geometry and holds that starting from central projection, which corresponds to the process of viewing, we can develop the fundamental part of projective geometry in a natural and complete way\n(\nFiedler,\n1878)\n. He feels supported by Pestalozzi, who argues that teaching must start with intuition. Fiedler sees these strategies as the best method for the reform of geometry teaching at all levels. The position of Fiedler was very close to\nCremona\n's. Fiedler never mentions\nCremona\nin his paper, but in a letter to\nCremona\n, at the beginning of\n1873\n, he praises his book and the simple way in which\nCremona\nintroduces the topics. Furthermore, asking for information about Italian technical education, he adds: \"... my interest is in this scientific and educational organization of Italy, in the foundation of unity through the school for a new generation.\"\nFiedler's second eldest son Kurt, who had already suffered from a hip problem when the family were in Prague, had to undergo surgery in Zürich and was confined to bed. Of course, Fiedler was very sad at his son's illness and his reaction to grief was always to throw himself even more into his work. Therefore in the winter of\n1869\n-\n70\nhe sat for long hours at the bedside of his son while writing his book\nDie darstellende Geometrie. Ein Grundriss für Vorlesungen  und zum Selbststudium\n. He completed this work and, in the summer of\n1870\n, sent it to the publisher Teubner in Leipzig. Of course the Franco-Prussian war was causing a major disruption at this time so it was not until\n1871\nthat the book appeared. By today's standards this is not a delay, but in these times publication usually happened very rapidly. It was in\n1870\nthe Fiedler made his most important research contribution when he recognised homogeneous coordinates as cross-ratios which were invariant under linear transformations. He was not the first to note this fact since\nAugust Ferdinand Möbius\nhad discovered it over\n40\nyears before. However,\nMöbius\n's discovery went unnoticed while Fiedler's rediscovery was widely read and incorporated into mathematical knowledge.\nOf course, Fiedler's love of descriptive geometry fitted in to a certain extent with his love of drawing. Perhaps this love of drawing was a factor in Fiedler's approach to geometry where he always gave great emphasis to constructions. In fact towards the end of his career he received a certain amount of criticism for over emphasising constructions. His book\nZyklographie oder Konstruktion der Aufgaben über Kreise und Kugeln\nⓉ\n(\nThe cyclograph: construction of circles and spheres\n)\n(1882)\ncontained constructions of problems on circles and spheres.\nAmong the honours given to Fiedler, we mention his election to the\nGerman Academy of Scientists Leopoldina\nin\n1889\nand to the Bavarian Academy of Sciences and Humanities in\n1906\n. The\nBerlin Academy of Sciences\nawarded him their\nSteiner\nPrize in\n1884\nfor his book\nZyklographie\nand he received an honorary degree from the University of Technology in Vienna in\n1907\n.\nThe death of his\n30\nyear old son Alfred, a\ndocent\nin zoology at University of Zürich, in\n1894\ngave his aging father much pain. But his wife overcame a nervous disorder which was caused by worrying about Alfred. Fiedler's colleagues knew nothing about his suffering because, although he increasingly withdrew from almost everything, he made an exception with his university duties which he continued to undertake with much vigour. Despite the pain and worries he suffered his colleagues were totally unaware of what he was going through.\nFiedler retired from his professorship at the Polytechnic in Zürich in\n1907\n. Always a deeply religious man, he spent the last years of his life studying the theological writings of\nGeorge Salmon\n.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry"
  ]
}