{
  "nome_completo": "Friedrich Wilhelm Franz Meyer",
  "nome_curto": "Wilhelm Meyer",
  "ano_nascimento": "1856",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meyer/",
  "lugar_nascimento": "Magdeburg, Germany",
  "lugar_morte": "Königsberg, Germany (now Kaliningrad, Russia)",
  "biografia": "Wilhelm Meyer\nfollowed the German tradition of the time in studying at a number of different universities. He attended the University of Leipzig and studied at the University of Berlin taking courses by\nKummer\n,\nWeierstrass\nand\nKronecker\n. He was awarded his doctorate in\n1878\nby the University of Munich.\nMeyer presented his\nhabilitation\nto the University of Tübingen in\n1880\nand taught there until\n1888\n. While in Tübingen he published his habilitation thesis\nApolarität und rationale Kurven, eine systematische Voruntersuchung zu einer allgemeinen Theorie der linearen Räume\nⓉ\n(\nApolarity and rational curves, a systematic preliminary study to a general theory of linear spaces\n)\nin\n1883\n. This impressive work extended apolarity theory as introduced by\nReye\nto projective geometry in several dimensions using the theory of rational curves. Meyer was appointed as professor of mathematics at the Bergakademie\n(\nmining academy\n)\nin Clausthal-Zellerfeld in the Harz Mountains in\n1888\n. In October\n1897\nhe moved to a chair at the University of Königsberg where he taught for\n27\nyears until he retired in\n1924\n. In fact it is worth noting that\nSommerfeld\nwas appointed to fill the chair of mathematics at the mining academy in Clausthal-Zellerfeld when Meyer left in\n1897\n.\nAs indicated by the thesis which he submitted for his habilitation, the title of which we quoted above, Meyer's interests lie in the study of\nalgebraic geometry\n, algebraic curves and projective\ninvariant theory\n. His expertise in invariant theory led to an invitation from the recently founded\nGerman Mathematical Society\n(\nDeutsche Mathematiker-Vereinigung\n)\nto write a report on the subject which he did, publishing his article of over\n200\npages\nBericht über den gegenwärtigen Stand der Invariantentheorie\nin\nJahresberichte der Deutsche Mathematiker-Vereinigung\nⓉ\n(\nReport on the current state of the theory of invariants in annual reports of the German Mathematical Society\n)\nin\n1892\n. The report presented the development of the subject from the middle of the century up to the major results of\nGordan\nand\nHilbert\n. Meyer's article was very influential and was translated from German into French, Italian and Polish.\nTogether with\nHeinrich Weber\nand\nKlein\n, Meyer founded the\nEncyclopädie der Mathematischen Wissenschaften\n. This was a massive project, supported by a number of German academies, producing\n20\nvolumes between\n1900\nand\n1930\n. Not only did Meyer play a large role in the planning of this project but he contributed many survey articles to it. In particular he wrote articles on invariant theory, third order surfaces, and surfaces of order higher than three. He also co-authored an article on potential theory with\nH Burkhardt\n, and an article on the geometry of the triangle with G Berkhan.\nMeyer was an extremely productive mathematician, writing over\n130\narticles and over\n2000\nreviews for\nFortschritte der Mathematik\n. He was able to bring all this wide experience to bear as an editor doing an exceptional job in this role. He\n[\n1\n]\n:-\n... gave lectures discussing the essential aspects of mathematical research in the spirit of\nKlein\n's Erlangen programme, and gave lectures discussing the essential aspects of mathematical research in the spirit of the time and emphasizing the importance of simple algebraic identities, the symmetries of group theory, and transformation principles as a source of geometric theorems.\n[\nhe\n]\nwas an excellent teacher who had many students. Most East Prussian mathematics teachers at the beginning of the twentieth century were trained by him.\nMeyer was unlucky in many ways since the direction in which mathematics developed left his research contributions outside the mainstream. In particular\nHilbert\n's results on invariant theory were so powerful that they ended a chapter in the development of the subject and so Meyer's many contributions in this area are little remembered today. Likewise the work in his habilitation thesis went into the geometrical theory of Segre manifolds set up by\nCorrado Segre\n.",
  "math_areas": [
    "Geometry"
  ]
}