{
  "nome_completo": "Wilhelm Lexis",
  "nome_curto": "Wilhelm Lexis",
  "ano_nascimento": "1837",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lexis/",
  "lugar_nascimento": "Eschweiler (near Aachen), Germany",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Wilhelm Lexis\nattended the University of Bonn where he was awarded a degree in mathematics and then went on to write a thesis on analytical mechanics. He graduated in\n1859\nand then went to Heidelberg where he undertook research in Bunsen's chemistry laboratories.\nDespite the fact that his training up to this point had been a broad one, in\n1861\nLexis went to Paris to study social sciences. These studies led to his first publication in\n1870\nwhich was on the export policies of France. Heiss writes in\n[\n4\n]\n:-\nThis work displays the feature that characterises his later economic writings: a scepticism towards \"pure economics\" and towards the application of supposedly descriptive mathematical models which have no reference to economic reality. Even in this early work he insisted that economic theory should be founded on quantitative economic data.\nIn\n1872\nLexis was appointed as professor of economics at the University of Strassburg. He held this post for two years and during this time he worked on his second major publication on the theory of population which was published in\n1875\n. By this time, however, he was in Dorpat having been appointed to the chair of geography, ethnology and statistics in\n1874\n. Again he held this post for only two years before he was appointed to the chair of economics at Freiburg.\nIt was in Freiburg that Lexis made his major contributions to statistics. Zabell writes in\n[\n8\n]\n:-\nDissatisfied with the uncritical and usually unsupported assumption of statistical homogeneity in sampling, often made by\nQuetelet\nand his followers, Lexis devised a statistic Q, now called the 'Lexis ratio', to test this assumption and demonstrate its frequent invalidity.\nFrom\n1876\n-\n79\nLexis studied data presented as a series over time. He initiated the study of time series with his\n1879\narticle\nOn the theory of the stability of statistical series\n.\nLexis required a binomial dispersion for his series to be stable and this ruled out most interesting series. However it applied to the problem of year to year fluctuation of the sex ratio among children born in a city. It posed the question of whether an empirical index of dispersion is consistent with the assumption that sex is governed by a simple chance mechanism. As Stigler writes in\n[\n5\n]\n:-\nMany scientists attempted to adapt\nprobability\n-based methods to social science problems, including\nQuetelet\nand Lexis, but in the end they were frustrated,\nQuetelet\nbecause his methods were too insensitive to segregate his data into categories amenable to statistical analysis, Lexis because his binomial models were insufficiently rich for interesting applications.\nAfter what is not much more than a three year period working on statistics in Freiburg, he began to produce a series of papers on economics. Lexis left Freiburg in\n1884\nto take up the chair of economics at the University of Breslau, then in\n1887\nhe made his final career move when he accepted the chair of political science at Göttingen.\nRather than concentrate on any one of his diverse interests as his career progressed, Lexis studied and wrote on a wider and wider collection of topics. In addition to studying economics, the theory of population, and statistics, he also worked on the production of an economic encyclopaedia, edited a series of works on education in general and university education in particular, and was the director of the first institute of actuarial science in Germany.",
  "math_areas": [
    "Statistics"
  ]
}