{
  "nome_completo": "Wilhelm Schickard",
  "nome_curto": "Wilhelm Schickard",
  "ano_nascimento": "1592",
  "ano_morte": "1635",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schickard/",
  "lugar_nascimento": "Herrenberg (near Tübingen), Württemberg (now Germany)",
  "lugar_morte": "Tübingen, Württemberg (now Germany)",
  "biografia": "Wilhelm Schickard\n's name is sometimes written as Schickhard or Schickhardt or Schickart. His mother was Margarete Gmelin, the daughter of a Lutheran pastor, and his father was Lucas Schickard. The Schickard family was originally from the County of Nassau but had moved south in the middle of the\n15\nth\ncentury. Lucas Schickard's father, who was a sculptor, had settled in Herrenberg about\n30\nkm south of Stuttgart. Lucas Schickard trained to be a carpenter, as did his brother Heinrich Schickard, who was Wilhelm's uncle. Heinrich Schickard became an architect and went on to become the main architect of the Renaissance in south-western Germany. Wilhelm was brought up in Herrenberg but, at an early age, won a scholarship to attend the monastery school in Bebenhausen, just north of Tübingen.\nAfter attending the monastery school in Bebenhausen, he entered the University of Tübingen. He received his first degree of B.A. in\n1609\n, followed by an M.A. in\n1611\n, both in theology and oriental languages, and he continued to study these topics at Tübingen until\n1613\n. While studying at Tübingen, he was taught mathematics and astronomy by\nMichael Mästlin\n. In\n1613\nSchickard became a Lutheran minister and was assigned to churches in towns around Tübingen. In\n1614\nhe was appointed deacon in Nürtingen. He continued this work with the Lutheran Church until\n1619\n. It was during his time as a Lutheran minister that he first met\nJohannes Kepler\nwho came to Tübingen to support his mother who had been charged with witchcraft.\nKepler\nwas working on his\nHarmony of the World\nat this time and, after meeting Schickard, he was so impressed with his abilities that he asked him to do some engravings and woodcuts for the book and also asked him to assist in calculating some tables. This is not as surprising as it might first sound since, among his other skills, Schickard was renowned as an engraver both in wood and in copperplate. The authors of\n[\n3\n]\nwrite:-\n[\nSchickard\n]\nagreed to draw and engrave the figures of the second part of the 'Epitome' on woodblocks. Yet Krüger\n[\nKepler\n's publisher\n]\n, always ready to interfere with\nKepler\n's plans, stipulated that the carving had to be done in Augsburg. Schickard sent thirty-seven woodblocks for books\n4\nand\n5\nto Augsburg towards the end of December\n1617\n. ... In June\n1621\nKepler\nwas in Frankfurt\n[\narranging for the publication of books\n5\n-\n7]\n. Schickard engraved the figures for the last two books\n(\nthe carving was done by one of his cousins\n)\n.\nIt was his work with\nKepler\nwhich prompted him to think about making a machine to mechanise the astronomical calculations he was doing. This was to come a little later, however, so first we will describe the next phase of Schickard's life as a professor of Hebrew.\nIn\n1619\nhe left his work in the Lutheran Church when he was appointed as the professor of Hebrew at the University of Tübingen. Schickard was a universal scientist and taught biblical languages such as Aramaic as well as Hebrew. His efforts to improve the teaching of his subject show remarkable innovation. He strongly believed that, as the professor, it was part of his job to make it easier for his students to learn Hebrew. One of his inventions to assist his students was the 'Hebraea Rota'. This mechanical device displayed conjugation of Hebrew verbs by having two rotating discs laid on top of each other, the respective forms of conjugation appearing in the window. He also created the\nHorologium Hebraeum\nⓉ\n(\nThe Hebrew clock\n)\n, a textbook of Hebrew divided into\n24\nchapters, each chapter containing material which could be learnt in an hour. He wrote another textbook, the\nHebräischen Trichter\nⓉ\n(\nA  Hebrew funnel\n)\n, for German students of Hebrew, in\n1627\n. However, his research was broad and, in addition to Hebrew, included astronomy, mathematics and surveying. In astronomy he invented a conic projection for star maps in the\nAstroscopium\n. His star maps of\n1623\nconsist of cones cut along the meridian of a solstice with the pole at the centre and apex of the cone.  He also made significant advances in mapmaking, showing how to produce maps which were far more accurate than those which were currently available. His most famous work on cartography was\nKurze Anweisung, wie künstliche Landtafeln auss rechtem Grund zu machen\nⓉ\n(\nBrief instruction on making land maps\n)\n(1629)\n. Long before\nPascal\nand\nLeibniz\n, Schickard invented a calculating machine, the 'Rechenuhr', in\n1623\n. He wrote to\nKepler\non\n20\nSeptember\n1623\n:-\nWhat you have done by calculation I have just tried to do by way of mechanics. I have conceived a machine consisting of eleven complete and six incomplete sprocket wheels; it calculates instantaneously and automatically from given numbers, as it adds, subtracts, multiplies and divides. You would enjoy seeing how the machine accumulates and transports spontaneously a ten or a hundred to the left and, vice-versa, how it does the opposite if it is subtracting ...\nKepler\nclearly showed an interest in having one of Schickard's calculators since Schickard gave instructions for one to be built for him. However, the half-built computer was destroyed by fire as he explained in another letter to\nKepler\nwritten on\n25\nFebruary\n1624\n. In this letter he gives some more details of the way the machine is constructed:-\n... On another occasion I will send you a more detailed description of the design of this arithmetic machine; in summary, it works as follows: aaa are the buttons on the vertical cylinders with the digits of the multiplication table, which can be displayed at will in the windows provided for the slides bbb. The dials ddd are attached to internal toothed wheels, each one having ten teeth geared in such a way that, if the wheel on the right makes ten turns, the wheel on its left makes only one turn; and if the first wheel on the right hand side makes one hundred turns, the third wheel on the left makes one turn, and so on. All the wheels rotate in the same direction making necessary the use of another wheel of the same size geared permanently to the wheel at its left, but not with the one at its right, which requires special attention during its construction. The digits marked on each wheel are displayed in the openings ccc of the central plate. Finally, the buttons eee, located over the base, are used to display in the openings fff the numbers that need to be used during the operations. This brief description would be better understood by using the actual instrument. I had placed an order with a local man, Johan Pfister, for the construction of a machine for you; but when half finished, this machine, together with some other things of mine, especially several metal plates, fell victim to a fire which broke out unseen during the night three days ago. I take the loss very hard, especially since there is no time to produce a replacement soon.\nKistermann studied the design of Schickard's calculator and explains the \"architecture\" of the machine in\n[\n9\n]\n. Schickard used the abridged multiplication for his machine which, Kistermann points out, was unknown to most of the scientific community in\n1600\n, with only a handful of scientists\n(\nbut including\nJost Bürgi\n,\nKepler\nand Schickard\n)\nhaving knowledge of this technique. In\n[\n10\n]\nKistermann considers whether Schickard's calculator was of practical use. Sketches of the calculator have been preserved in the manuscripts left by Schickard and\nKepler\n. These however, were not rediscovered until\n1935\nwhen they were found during research into\nKepler\n's life. At this stage their significance was not understood, but twenty years later it was realised that it was a sketch of the computer described by Schickard. Bruno von Freytag Löringhoff constructed the computer between\n1957\nand\n1960\nusing the sketch and the descriptions in Schickard's letters. He then tested the range of calculations which were possible to try to ascertain exactly what purpose Schickard had in building the calculating machine. Von Freytag Löringhoff discovered that it worked well and was particularly suited to carry out the astronomical calculations which were necessary for astronomers of the seventeenth century; see\n[\n4\n]\nfor further details. In fact we know that Schickard also wrote to\nKepler\nsuggesting a mechanical means to calculate ephemerides.\nIn\n1631\nSchickard had rather a change of subject, being appointed to the chair of mathematics and astronomy at the University of Tübingen left vacant by the death of his teacher\nMichael Mästlin\n. This change did not signify a major shift in his interests, however, for as we indicated above he had always had broad interests across a wide range of subjects. For example, he lectured on architecture, fortification, and hydraulics. He also undertook land surveying of the duchy of Württemberg which involved the first use of\nWillebrord Snell\n's triangulation method in geodesic measurements; see\n[\n6\n]\nfor further details. As professor of astronomy Schickard lectured on the topic and undertook research into the motion of the moon. He published\nEphemeris Lunaris\nin\n1631\nwhich allowed the position of the moon to be determined at any time. We should note that, at a time when the Church was trying to insist that the Earth was at the centre of the universe, Schickard was a staunch supporter of heliocentric system. We have mentioned above Schickard's correspondence with\nKepler\nbut he corresponded with many other astronomers including\nIsmael Boulliau\nand\nPierre Gassendi\n.\nThe Thirty Years War\n(1618\n-\n1648)\naffected much of the later part of Schickard's life. Following the Battle of Nördlingen in September\n1634\n, when the Catholic army augmented by many Spanish troops won a decisive victory over the Protestant army, the victorious troops occupied Tübingen. The troops brought with them the bubonic plague and the population of Tübingen was badly affected. Over the next year Schickard's wife and all his children died from the plague. He was the last of the family to succumb to the bubonic plague, dying either on the day given above or, possibly, one day earlier.\nAlthough Schickard's contributions were not fully recognised during his lifetime, be is remembered  today with the Wilhelm-Schickard-Institut für Informatik at the University of Tübingen and the Wilhelm-Schickard-Schule in Tübingen.",
  "math_areas": [
    "Geometry",
    "Number Theory"
  ]
}