{
  "nome_completo": "Martin Wilhelm Kutta",
  "nome_curto": "Wilhelm Kutta",
  "ano_nascimento": "1867",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kutta/",
  "lugar_nascimento": "Pitschen, Upper Silesia (now Byczyna, Poland)",
  "lugar_morte": "Fürstenfeldbruck, Germany",
  "biografia": "Wilhelm Kutta\n's father was Wilhelm Kutta and his mother was Anna Koschinsky. He had a brother Karl, three years older than he was, who was also very talented and went on to obtain a doctorate. Tragically Kutta's parents died when he was still young and, together with his brother Karl, he went to Breslau to be brought up by an uncle. It was in Breslau that he attended the\nGymnasium\n.\nAfter graduating from the Gymnasium, Kutta studied at the University of Breslau from\n1885\nto\n1890\n. Then he went to Munich where he studied at the university there from\n1891\nto\n1894\n. Throughout his studies, mathematics was always his main subject, but he had broad interests, also taking courses in languages, music and art. He kept these interests throughout his life. He did not take the examinations which would qualify him to teach in Bavarian secondary schools, preferring to assist with university teaching.\nKutta was appointed to a post at the Technische Hochschule at Munich as an assistant in mathematics and physics from\n1894\n. He later became an assistant to\nvon Dyck\nat the Technische Hochschule conducting the exercise classes for\nvon Dyck\n's course on Higher Mathematics. During this period he spent the year\n1898\n-\n99\nin England at the University of Cambridge. He was awarded his doctorate from the University of Munich for his thesis\nBeiträge zur näherungsweisen Integration totaler Differentialgleichungen\nⓉ\n(\nContributions for the approximate integration of total differential equations\n)\nin\n1900\n, his thesis advisors being\nC L Ferdinand Lindemann\nand Gustav Bauer. The thesis was published in the following year. It contains the now famous\nRunge\n-Kutta method for solving ordinary\ndifferential equations\n.\nSebastian Finsterwalder also taught at the Institute in Munich where Kutta worked and he was interested in aviation. He brought photographs of early aircraft to the Institute and Kutta became fascinated by the mathematics behind aviation, namely aerodynamics. His studies of the topic led him discover important formulas relating to the lift on an aerofoil in terms of the circulation round it. He submitted his\nhabilitation\nthesis on aerodynamics to the Technische Hochschule at Munich in\n1902\n. He was promoted to extraordinary professor in Applied Mathematics in\n1907\n. Two years later, in\n1909\n, he moved to the University of Jena, then in the following year he was appointed as an ordinary professor at the Technische Hochschule at Aachen. He became an ordinary professor at the Technische Hochschule in Stuttgart in\n1911\nand remained there until he retired in\n1935\n. At Stuttgart Kutta concentrated his teaching on engineers who benefited greatly from his inspiring presentation.\nHe is best known for the work contained in his doctoral thesis and that contained in his habilitation thesis. The former contains the\nRunge\n-Kutta method for solving ordinary differential equations while the latter contains the\nZhukovsky\n-Kutta\n(\nor Joukowski-Kutta\n)\ntheorem giving the lift on an aerofoil.\nZhukovsky\nmade the discoveries independently of Kutta, and published his version four years after Kutta. However, Kutta went on to make further important contributions to aerodynamics. Let us mention, in particular, his two important publications on this topic by the Königlich Bayerischen Akademie der Wissenschaften of Munich\n(\nRoyal Bavarian Academy of Sciences\n)\nin\n1910\nand\n1911\n, one of which was entitled\nÜber ebene Zirkulationsströmungen nebst flugtechnischen Anwendungen\nⓉ\n(\nOn plain circulation flows, together with avionics applications\n)\nand contains his famous mapping theorem from function theory.\nTwo further topics which Kutta worked on were research on glaciers and also research in the history of mathematics. His interest in glaciers was, like his interest in aerodynamics, brought about by Sebastian Finsterwalder. Kutta made measurements of glaciers working from photographs taken in the East Alps and also worked with others in constructing maps of the area covered by glaciers. On the other topic, namely the history of mathematics, our first comment is that this was a very natural interest for Kutta to have. He was, after all, deeply interested in history, particularly historical literature, so when at the Technische Hochschule at Munich where there was an active seminar on the history of mathematics, it was clearly an area which would strongly attract him. He wrote a paper on\nWallis\n's\n1659\nwork on integration and the length of an ellipse. Kutta's paper was published in\n1901\n.\nKutta was a remarkable person quite apart from his outstanding contributions to mathematics. F Pfeiffer writes:-\n... I had the good fortune in my life to become acquainted with a large number of outstanding mathematicians ..., but I never met a mathematician who had such a deep interest and familiarity with so many different areas of mental activity as Kutta ...\nHowever, Pfeiffer also writes that despite Kutta's wide ranging interests, he was a lonely man.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}