{
  "nome_completo": "Hans Heinrich Wilhelm Magnus",
  "nome_curto": "Wilhelm Magnus",
  "ano_nascimento": "1907",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Magnus/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "New Rochelle, New York, USA",
  "biografia": "Wilhelm Magnus\n's parents were Alfred Magnus and Paula Kalkbrenner. Wilhelm attended the Gymnasium in Tübingen from\n1916\nand was awarded his Abitur in\n1925\n. He had studied Latin throughout the nine years at the Gymnasium but his favourite subjects were mathematics and physics. At this stage he decided that physics was the subject for him and he began his university studies with that in mind. He entered the University of Tübingen in the autumn of\n1925\nbut, even in the year he entered, he was studying advanced mathematics\n[\n7\n]\n:-\nI became interested in\nNumber Theory\nand, in\n1925\nduring my first semester at a university, I started to read the 'Disquisitiones Arithmeticae'\nⓉ\n(\nInvestigations in arithmetic\n)\nby\nGauss\n. ... the language was not difficult but\nGauss\n's style was and I never really became initiated into his theory of\nquadratic forms\n. So I was happy to see the publication of the first volume of\nEdmund Landau\n's 'Vorlesungen aber Zahlentheorie'\nⓉ\n(\nLectures on number theory\n)\nwhich appeared shortly afterwards. The publication date given in the three volumes is\n1927\n, but the first volume appeared somewhat earlier. Landau was known to be the leading number theorist in Germany, and I started reading his book with great expectations. All went well up to page\n93\n, theorem\n152\n... I could follow the proof, but I did not see through it, and I felt that if this was number theory it was too difficult for me.\nAfter two semesters at the University of Tübingen, Magnus went to the Johann-Wolfgang-Goethe-University of Frankfurt. He had already decided that he wanted to specialise in mathematics rather than physics when he was taught by\nCornelius Lanczos\nwho had been appointed to Frankfurt in\n1924\n. Magnus wrote\n[\n1\n]\n:-\nWhen I attended a course taught by\nLanczos\nfor the first time, I had already changed my original plan to become a physicist, realizing that I was more at home and at ease in mathematics. Perhaps, this was fortunate, because\nLanczos\nmight have made me stay in physics if I had met him earlier. To work in theoretical physics requires an uncanny combination of talents: a specific type of intuitive understanding of the realities of physics and a well developed ability to handle the necessary mathematical tools with complete ease. What made\nLanczos\nsuch a fascinating teacher for a mathematician was his ability to inject some of the intuition of the physicist into mathematics. Even the supreme clarity of\nLanczos\n's lectures would not have sufficed to produce this effect. What one really could learn from him was the over-riding importance of motivation for the development of a theory.\nMagnus was also taught by\nCarl Siegel\n, who had been appointed to Frankfurt in\n1922\nto fill\nArthur Schönflies\n's chair, and by\nErnst Hellinger\n, who had been appointed to a chair at the University of Frankfurt in\n1914\n. He wrote about his experiences in their classes in\n[\n1\n]\n:-\nInstinctively, everyone in the class knew that none of us would ever be as powerful a mathematician as\nSiegel\n. Contrary to all the talk from psychologists and educators who warn against oppressing the developing student, this need not be a depressing experience at all. The opposite is true: it is beneficial to know early what high standards really mean. And\nSiegel\nwas encouraging when he felt that this was justified. And his word then carried weight. ...\nHellinger\nwas the most widely appreciated teacher among the mathematicians. He, too, was very well prepared. His lectures were highly polished but he never forgot to mention the motivation for a theorem.\nMagnus completed the work for his first degree in Mathematics, Theoretical Physics and Experimental Physics and was awarded the degree on\n18\nNovember\n1929\nwith the grade of \"excellent\". He was appointed as an assistant at the Mathematical Seminar at Frankfurt from\n1\nOctober\n1929\n, holding this position until\n30\nSeptember\n1930\n.\nDespite the other outstanding teachers he had at Frankfurt, it was\nMax Dehn\n, who held the chair of Pure and Applied Mathematics at the University of Frankfurt from\n1921\nuntil\n1935\n, who had become Magnus's Ph.D. advisor in\n1928\n. Magnus wrote\n[\n1\n]\n:-\nMax Dehn\nwas my Ph.D. advisor and I have been influenced deeply by him. I took courses taught by him only in my last year at the university, and they had a lasting effect on me in spite of the fact that they were not as polished and smooth as those which I had attended before.\nDehn\ncommunicated ideas. One had to be ready for this. In fact, one had to be able to enter into a dialogue with him. Even if one had only a tiny contribution to make, and even if one expressed it in a confused way, this was enough.\nDehn\nalways understood. He had the ability which Socrates claimed for himself: to act as a midwife at the birth of an idea. This ability went far beyond mathematics.\nDehn\nhad an extensive knowledge of philosophy and of history, and he used it to gain the proper perspective for any particular fact or occurrence. He was very undogmatic and did not belong to any philosophical school, but he always tried to see the significance of ideas and facts within the general framework of human experience.\nIn\n1928\nDehn\nasked Magnus various questions about one-relator\ngroups\n. He was able to answer these questions and published his results on one-relator groups in\n1930\nin the paper\nÜber unendliche diskontinuierliche Gruppen mit einer definierenden Relation\n(\nDer Freiheitssatz\n)\nⓉ\n(\nOn infinite discontinuous groups with a defining relation\n(\nthe freedom theorem\n)\n)\n. In this he proves that certain subgroups of one-relator groups are\nfree groups\n. The results of this paper formed his Ph.D. thesis and he was awarded the degree on\n13\nJanuary\n1931\n. From\n1\nNovember\n1930\nto\n31\nJuly\n1932\nhe was an assistant at the Mathematical Institute at the University of Göttingen. In\n1932\nhe published\nDas Identitätsproblem für Gruppen mit einer definierenden Relation\nⓉ\n(\nIdentity problem for groups with a defining relation\n)\ncontaining a major result in combinatorial group theory, namely that the word problem for one-relator groups is soluble. In this paper Magnus introduced a method of breaking a one-relator group into simpler one-relator groups. This method became the main tool in attacking one-relator groups in later research.\nMagnus was appointed to the staff in Frankfurt serving from\n1933\nuntil\n1938\n. During this time he spent nine months of session\n1934\n/\n35\nat Princeton University in the United States supported with a Scholarship from the Rockefeller Foundation. At Princeton he attended a course given by his former teacher\nCarl Siegel\n, who was spending a year at the Institute for Advanced Study at Princeton. Magnus writes\n[\n7\n]\n:-\nMy attendance at\nSiegel\n's lectures resulted in the publication of my only number theoretical paper\n(\non the class number of quadratic forms\n)\n.\nDuring this period Magnus introduced\nLie\nring methods to study the lower central series of free groups. He studied the\nautomorphism groups\nof free groups in\n1934\n. In\n1935\nMagnus gave examples of finitely presented groups which were isomorphic to proper\nfactor groups\nof themselves.\nHeinz Hopf\nhad originally asked whether such groups exist and, although\nJakob Nielsen\nhad shown that free groups of finite rank have this property ten years before Hopf asked the question, nobody - including\nJakob Nielsen\nhimself - noticed the question had already been answered.\nHe was appointed as an assistant at the University of Königsberg on\n1\nApril\n1939\n. Later that year, on\n5\nAugust, he married Gertrud Remy; they had three children, Jutta, Bettina, and Alfred. However his career was to hit problems when he refused to join the Nazi Party and, as a consequence of this, was not allowed to hold an academic post during World War II. Instead he had to work in industry\n[\n7\n]\n:-\nI had joined Telefunken\n(\na radio firm\n)\n, and there I met\nArnold Sommerfeld\n, the famous physicist, who had been induced by the management of the firm to act as a consultant on theoretical problems. I became fascinated by his work on diffraction problems and by his \"radiation condition\" which enforces uniqueness for their solutions.\nSommerfeld\nwas at least as much - if not more - a mathematician as a physicist. How else would he have taken pride in solving the diffraction problem for a half-plane by introducing a branched covering of physical three-space with edge of a half-plane as a branch line and the half-plane as a branch cut? Now\nspecial functions\n, especially\nBessel\nfunctions, are used extensively and effectively in\nSommerfeld\n's papers. From him I learned how to apply them as useful tools for the solution of certain problems. I started collecting them. I am not sure how far these functions may have appealed to my collector's instinct, an instinct which manifests itself in many people with application to diverse objects, regardless of any consideration of usefulness.\nDuring the war, Magnus also undertook military research in the Department of War Marines situated at Berlin-Wannsee. In\n1944\nhe became an ordinary professor at the University of Königsberg but Königsberg was bombed by the Royal Air Force in August\n1944\nand during the first three months of\n1945\nthe Russian army bombarded the city resulting in its capitulation on\n9\nApril\n1945\n. By this time\n80\n% of university buildings had been destroyed. The staff fled and many were given positions at the University of Göttingen. Magnus was offered an ordinary professorship at the University of Göttingen in\n1946\nbut he was not to remain there for long.\nIn\n1946\nHarry Bateman\ndied and\nEdmund Whittaker\nwas asked to recommend someone who could undertake the project of organising and publishing\nBateman\n's manuscripts.\nWhittaker\n's advice was that\nArthur Erdélyi\nshould lead the project and, in\n1947\n,\nErdélyi\nwent to the California Institute of Technology. The project was a major one and other collaborators were needed. Magnus left Göttingen in\n1947\nand joined the\nBateman\nproject in\n1948\n, first as a visiting researcher. He wrote\n[\n7\n]\n:-\nIn the case of\nHarry Bateman\nthere is very little doubt in my mind that he was, at least in part, motivated by a pure collector's instinct. I became acquainted with his incredible collection of formulas for special functions and definite integrals when working from\n1948\nto\n1950\non the handbook of higher transcendental functions, which is commonly known as the \"\nBateman\nProject.\"\nMagnus collaborated with\nArthur Erdélyi\n, Fritz Oberhettinger and\nFrancesco G Tricomi\non the production of three volumes of\nHigher Transcendental Functions\nand two volumes of\nTables of Integral Transforms\n. All five volumes appeared in print between\n1953\nand\n1955\n. For more information, see\nTHIS LINK\n.\nIn\n1950\nMagnus went to the\nCourant\nInstitute of Mathematical Sciences. There one of his first students was Abe Shenitzer who writes\n[\n10\n]\n:-\nI first met Wilhelm Magnus in\n1950\n, when I came to the New York University graduate school and enrolled in Magnus's course in algebra. I took an immediate liking to this polite, somewhat shy, and strikingly intelligent man. I was older than most of the students in the class and I approached him without hesitation. The fact that I was a good student helped, and I found myself talking to Magnus about nonmathematical matters as well as mathematical issues. One day he said to me: \"You've done more for me than any person can do for another.\" He was visibly moved and I was utterly perplexed. \"Yes,\" he said, \"you are a Jew who was in German concentration camps and I am a German.\" \"But I deal with individual people, not with labels\" was my response. This was the beginning of our friendship.\nHe spent\n23\nyears at the\nCourant\nInstitute before moving to a chair at the Polytechnic Institute of New York in\n1973\n. He held this post for five years before retiring.\nIn\n[\n11\n]\nMagnus's research is described in these terms:-\nMagnus's mathematical expertise was exceptionally wide ranging. In addition to research in group theory and special functions, he worked on problems in mathematical physics, including electromagnetic theory and applications of the wave equation.\nIt was not only in the breadth and depth of research that Magnus excelled. He was also one of the best supervisors of doctoral students, supervising\n61\ndoctoral students during his career. One of his students was Seymour Lipschutz who dedicated a paper to Magnus with the words:-\nThe author dedicates this paper to his teacher, advisor and friend Wilhelm Magnus\n(1907\n-\n1990)\n; he was a shining example of a kind, considerate and concerned human being.\nShenitzer writes\n[\n10\n]\n:-\nMagnus was a creative mathematician and, as he told me, he liked best to work with gifted doctoral students. On the other hand, he was far too intelligent not to function occasionally as a critic who sheds light on a whole area with a single aphoristic remark. When, as a rank beginner, I asked him what made groups of automorphisms important, he replied, \"They are the algebraic counterpart of symmetries in geometry.\" He began his first lecture in a course on geometry with the remark: \"The fundamental difference between\nHilbert\nand\nEuclid\nis that\nHilbert\nrealized that you can study form without substance.\"\nHis teaching is described in\n[\n11\n]\nas 'outstanding' and this is confirmed by his receipt of the Great Teacher Award of New York University in\n1969\n.\nHis nine books cover a wide range of mathematical topics such as\nelliptic functions\n, tessellations\n(\nNoneuclidean tessellations and their groups\n(1974))\n, combinatorial group theory\n(\na major work\nCombinatorial group theory\n(1966)\nwritten jointly with A Karrass and D Solitar\n)\nand mathematical physics.\nFor more information about these books and extracts from some reviews see\nTHIS LINK\n.\nFor a version of Magnus's Preface to\nNoneuclidean tessellations and their groups\n, see\nTHIS LINK\nand for the preface to\nCombinatorial group theory\n, see\nTHIS LINK\n.\nIt is unusual for a\n20\nth century mathematician to work in two mathematical areas as far apart as the ones on which Magnus worked. But he was also deeply interested in other topics outside mathematics\n[\n10\n]\n:-\nHe was deeply versed in history, philosophy, and literature, but he had a special passion for poetry. His learning was an integral part of his mind. He was the epitome of a cultivated person. He once told me that if he got tired of algebra, then he could always teach a course on Plato. I was present when the philosopher Hans Jonas, the mathematician Fritz John, and Magnus got together to listen to Jonas's report on a conference on gnosticism which he had just attended. There ensued an animated discussion by three people who seemed equally at home in history and in philosophy. An outsider would have found it hard to believe that two of the three participants were eminent mathematicians.\nYou can read Magnus's ideas on \"What Makes a Mathematician?\" at\nTHIS LINK\n.\nHe was awarded a number of honours including a Rockefeller Fellowship in\n1934\n, a Guggenheim Fellowship in\n1969\nand Fulbright-Hays Senior Research Scholarship in\n1973\n/\n74\n. He was a member of the\nGöttingen Academy of Sciences\nand the\nAmerican Mathematics Society\n. He was awarded an honorary Doctor of Science from the Polytechnic Institute New York in\n1980\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}