{
  "nome_completo": "William Rowan Hamilton",
  "nome_curto": "William Rowan Hamilton",
  "ano_nascimento": "1805",
  "ano_morte": "1865",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamilton/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "William Rowan Hamilton\n's father, Archibald Hamilton, did not have time to teach William as he was often away in England pursuing legal business. Archibald Hamilton had not had a university education and it is thought that Hamilton's genius came from his mother, Sarah Hutton. By the age of five, William had already learned Latin, Greek, and Hebrew. He was taught these subjects by his uncle, the Rev James Hamilton, who William lived with in Trim for many years. James was a fine teacher.\nWilliam soon mastered additional languages and at the age of\n8\nhe met the American Zerah Colburn. Colburn could perform amazing mental arithmetical feats and Hamilton joined in competitions of arithmetical ability with him.\n[\n31\n]\nIt appears that losing to Colburn sparked Hamilton's interest in mathematics.\nHamilton's introduction to mathematics came at the age of\n13\nwhen he studied\nClairaut\n's\nAlgebra\n, a task made somewhat easier as Hamilton was fluent in French by this time. At age\n15\nhe started studying the works of\nNewton\nand\nLaplace\n. In\n1822\nHamilton found an error in\nLaplace\n's\nMécanique céleste\nand, as a result of this, he came to the attention of\nJohn Brinkley\n, the Royal Astronomer of Ireland, who said:-\nThis young man, I do not say will be, but is, the first mathematician of his age.\nHamilton entered Trinity College, Dublin at the age of\n18\nand in his first year he obtained an 'optime' in Classics, a distinction only awarded once in\n20\nyears.\nIn August\n1824\n, Uncle James took Hamilton to Summerhill to meet the Disney family. It was at this point that William first met their daughter Catherine and immediately fell hopelessly in love with her. Unfortunately, as he had three years left at Trinity College, Hamilton was not in a position to propose marriage. However Hamilton was making remarkable progress for an undergraduate and submitted his first paper to the\nRoyal Irish Academy\nbefore the end of\n1824\n, which was entitled\nOn Caustics\n.\nThe following February, Catherine's mother informed William that her daughter was to marry a clergyman, who was fifteen years her senior. He was affluent and could offer more to Catherine than Hamilton. In his next set of exams William was given a 'bene' instead of the usual 'valde bene' due to the fact that he was so distraught at losing Catherine. He became ill and at one point he even considered suicide. In this period he turned to poetry, which was a habit that he pursued for the rest of his life in times of anguish.\nIn\n1826\nHamilton received an 'optime' in both science and Classics, which was unheard of, while in his final year as an undergraduate he presented a memoir\nTheory of Systems of Rays\nto the\nRoyal Irish Academy\n. It is in this paper that Hamilton introduced the characteristic function for optics.\nHamilton's finals examiner, Boyton, persuaded him to apply for the post of Royal Astronomer at Dunsink observatory even although there had already been six applicants, one of whom was\nGeorge Biddell Airy\n. Later in\n1827\nthe board appointed Hamilton Andrews' Professor of Astronomy in Trinity College  while he was still an undergraduate aged twenty-one years. The professorship carried the honorary title\nRoyal Astronomer of Ireland\nand the benefit of residing at Dunsink Observatory. This appointment brought a great deal of controversy as Hamilton did not have much experience in observing. His predecessor, Professor\nBrinkley\n, who had become a bishop, did not think that it had been the correct decision for Hamilton to accept the post and implied that it would have been prudent for him to have waited for a fellowship. It turned out that Hamilton had made an poor choice as he lost interest in astronomy and spend all time on mathematics.\nBefore beginning his duties in this prestigious position, Hamilton toured England and Scotland\n(\nfrom where the Hamilton family originated\n)\n. He met the poet Wordsworth and they became friends. One of Hamilton's sisters Eliza wrote poetry too and when Wordsworth came to Dunsink to visit, it was her poems that he liked rather than Hamilton's. The two men had long debates over science versus poetry. Hamilton liked to compare the two, suggesting that mathematical language was as artistic as poetry. However, Wordsworth disagreed saying that\n[\n4\n]\n:-\nScience applied only to material uses of life waged war with and wished to extinguish imagination.\nWordsworth had to tell Hamilton quite forcibly that his talents were in science rather than poetry:-\nYou send me showers of verses which I receive with much pleasure ... yet have we fears that this employment may seduce you from the path of science. ... Again I do venture to submit to your consideration, whether the poetical parts of your nature would not find a field more favourable to their nature in the regions of prose, not because those regions are humbler, but because they may be gracefully and profitably trod, with footsteps less careful and in measures less elaborate.\nHamilton took on a pupil by the name of Adare. They were a bad influence on each other as Adare's eyesight started to present problems as he was doing too much observing, while at the same time Hamilton became ill due to overwork. They decided to take a trip to Armagh by way of a holiday and visit another astronomer Romney Robinson. It was on this occasion that Hamilton met Lady Campbell, who was to become one of his favourite confidants. William also took the opportunity to visit Catherine, as she was living relatively nearby, which she then reciprocated by coming to the observatory. Hamilton was so nervous in her presence that he broke the eyepiece of the telescope whilst trying to give her a demonstration. This episode inspired another interval of misery and poem writing.\nIn July\n1830\nHamilton and his sister Eliza visited Wordsworth and it was around this time that he started to think seriously about getting married. He considered Ellen de Vere, and he told Wordsworth that he\n[\n4\n]\n:-\n... admired her mind ...\nbut he did not mention love. He did, however, bombard her with poetry and was about to propose marriage when she happened to say\n[\n5\n]\nthat she could\n... not live happily anywhere but at Curragh.\nHamilton thought this was her way of discouraging him tactfully and so he ceased to pursue her. However he was proved to be mistaken as she married the following year and did leave Curragh! Fortunately, one good thing transpired from the event as Hamilton became firm friends with Ellen's brother Aubrey although a dispute about religion in\n1851\nmade them go their separate ways.\nCatherine aside, Hamilton seemed quite fickle when it came to relationships with women. Perhaps this was because he thought that he ought to marry and so, if he could not have Catherine, then it did not really matter whom he married. In the end he married Helen Maria Bayly who lived just across the fields from the observatory. William told Aubrey that she was\n\"not at all brilliant\"\nand, unfortunately, the marriage was fated from the start. They spent their honeymoon at Bayly Farm and Hamilton worked on his third supplement to his\nTheory of Systems of Rays\nfor the duration. Then at the observatory Helen did not have much of an idea of housekeeping and was so often ill that the household became extremely disorganised. In the years to come she spent most of her time away from the observatory as she was looking after her ailing mother or was indisposed herself.\nIn\n1832\nHamilton published this third supplement to\nTheory of Systems of Rays\nwhich is essentially a treatise on the characteristic function applied to optics. Near the end of the work he applied the characteristic function to study\nFresnel\n's wave surface. From this he predicted conical\nrefraction\nand asked the Professor of Physics at Trinity College,\nHumphrey Lloyd\n, to try to verify his theoretical prediction experimentally. This\nLloyd\ndid two months later and this theoretical prediction brought great fame to Hamilton. However, it also led to controversy with\nMacCullagh\n, who had come very close to the theoretical discovery himself but, he was forced to admit, had failed to take the last step.\nOn\n4\nNovember\n1833\nHamilton read a paper to the\nRoyal Irish Academy\nexpressing complex numbers as algebraic couples, or ordered pairs of real numbers. He used algebra in treating dynamics in\nOn a General Method in Dynamics\nin\n1834\n. In this paper Hamilton gave his first statement of the characteristic function applied to dynamics and wrote a second paper on the topic the following year. Hankins writes in\n[\n1\n]\n:-\nThese papers are difficult to read. Hamilton presented his arguments with great economy, as usual, and his approach was entirely different from that now commonly presented in textbooks describing the method. In the two essays on dynamics Hamilton first applied the characteristic function\nV\nV\nV\nto dynamics just as he had in optics, the characteristic function being the action of the system in moving from its initial to its final point in configuration space. By his law of varying action he made the initial and final coordinates the independent variables of the characteristic function. For conservative systems, the total energy\nH\nH\nH\nwas constant along any real path but varied if the initial and final points were varied, and so the characteristic function in dynamics became a function of the\n6\nn coordinates of initial and final position\n(\nfor\nn\nn\nn\nparticles\n)\nand the Hamiltonian\nH\nH\nH\n.\nThe year\n1834\nwas the one in which Hamilton and Helen had a son, William Edwin. Helen then left Dunsink for nine months leaving Hamilton to fight the loneliness by throwing himself into his work even more. In\n1835\nHamilton published\nAlgebra as the Science of Pure Time\nwhich were inspired by his study of Kant and presented to a meeting of the\nBritish Association for the Advancement of Science\n. This second paper on algebraic couples identified them with steps in time and he referred to the couples as 'time steps'.\nHamilton was knighted in\n1835\nand that year his second son, Archibald Henry, was born but the next few years did not bring him much happiness. After the discovery of algebraic couples, he tried to extend the theory to triplets, and this became an obsession that plagued him for many years. The following autumn he went to Bristol for a meeting of the\nBritish Association\n, and Helen took the children with her to Bayly Farm for ten months. His cousin Arthur died, and not long after Helen returned from her mother's she went away again to England this time leaving the children behind after the birth of a daughter, Helen Eliza Amelia. At this point, William became depressed and started to have problems with alcohol so his sister came back to live at Dunsink.\nHelen returned in\n1842\nwhen Hamilton was so preoccupied with the triplets that even his children were aware of it. Every morning they would inquire\n[\n26\n]\n:-\nWell, Papa can you multiply triplets?\nbut he had to admit that he could still only add and subtract them.\nOn\n16\nOctober\n1843\n(\na Monday\n)\nHamilton was walking in along the Royal Canal with his wife to preside at a Council meeting of the\nRoyal Irish Academy\n. Although his wife talked to him now and again Hamilton hardly heard, for the discovery of the\nquaternions\n, the first noncommutative algebra to be studied, was taking shape in his mind:-\nAnd here there dawned on me the notion that we must admit, in some sense, a fourth dimension of space for the purpose of calculating with triples ... An electric circuit seemed to close, and a spark flashed forth.\nHe could not resist the impulse to carve the formulae for the quaternions\ni\n2\n=\nj\n2\n=\nk\n2\n=\ni\nj\nk\n=\n−\n1\ni^{2} = j^{2} = k^{2} = i j k = -1\ni\n2\n=\nj\n2\n=\nk\n2\n=\ni\nj\nk\n=\n−\n1\n.\nin the stone of Broome Bridge\n(\nor Brougham Bridge as he called it\n)\nas he and his wife passed it.\nIn\n1958\nthe\nRoyal Irish Academy\nerected a plaque commemorating this. See\nTHIS LINK\n.\nAn engraving of him supposedly carving it is at\nTHIS LINK\n.\nHamilton felt this discovery would revolutionise mathematical physics and he spent the rest of his life working on quaternions. He wrote\n[\n26\n]\n:-\nI still must assert that this discovery appears to me to be as important for the middle of the nineteenth century as the discovery of fluxions\n[\nthe calculus\n]\nwas for the close of the seventeenth.\nShortly after Hamilton's discovery of the quaternions his personal life started to prey on his mind again. In\n1845\n, Thomas Disney visited Hamilton at the observatory and brought Catherine with him. This must have upset William as his alcohol dependency took a turn for the worse. At a meeting of the Geological Society the following February he made an exhibition of himself through his intoxication.\nMacfarlane\n[\n17\n]\nwrites:-\n... at a dinner of a scientific society in Dublin he lost control of himself, and was so mortified that, on the advice of friends he resolved to abstain totally. This resolution he kept for two years, when ... he was taunted for sticking to water, particularly by\nAiry\n... . He broke his good resolution, and from that time forward the craving for alcoholic stimulants clung to him.\nThe year\n1847\nbrought the deaths of his uncles James and Willey and the suicide of his colleague at Trinity College,\nJames MacCullagh\n, which greatly disturbed him despite the fact that they had not always seen eye to eye. The following year Catherine began writing to Hamilton, which cannot have helped at this time of depression. The correspondence continued for six weeks and became more informal and personal until Catherine felt so guilty that she confessed to her husband. Hamilton wrote to Barlow and informed him that they would never hear from him again. However, Catherine wrote once more and this time attempted suicide\n(\nunsuccessfully\n)\nas her remorse was so great. She then spent the rest of her life living with her mother or siblings, although there was no official separation from Barlow. Hamilton persisted in his correspondence to Catherine, which he sent through her relatives.\nIt is no surprise that Hamilton gave in to alcohol immediately after this, but he threw himself into his work and began writing his\nLectures on Quaternions\n. He published\nLectures on Quaternions\nin\n1853\nbut he soon realised that it was not a good book from which to learn the theory of quaternions. Perhaps Hamilton's lack of skill as a teacher showed up in this work.\nHamilton helped Catherine's son James to prepare for his Fellowship examinations which were on quaternions. He saw this as revenge towards Barlow as he was able to help his son in a way that his father could not. Later that year Hamilton received a pencil case from Catherine with an inscription that read\n[\n5\n]\n:-\nFrom one who you must never forget, nor think unkindly of, and who would have died more contented if we had once more met.\nHamilton went straight to Catherine and gave her a copy of\nLectures on Quaternions\n. She died two weeks later. As a way of dealing with his grief, Hamilton plagued the Disney family with incessant correspondence, sometimes writing two letters a day. Lady Campbell was another sufferer of the burden of mail, as only she and the Disneys knew of his love for Catherine. On the other hand, Helen must have always suspected that she did not take first place in her husband's heart, a notion that must have been strengthened in\n1855\nwhen she found a letter from Dora Disney\n(\nCatherine's sister-in-law\n)\n. This led to an argument, although the only consequence was that Dora had her letters addressed by her husband, they did not stop altogether.\nDetermined to produce a work of lasting quality, Hamilton began to write another book\nElements of Quaternions\nwhich he estimated would be\n400\npages long and take\n2\nyears to write. The title suggests that Hamilton modelled his work on\nEuclid\n's\nElements\nand indeed this was the case. The book ended up double its intended length and took seven years to write. In fact the final chapter was incomplete when he died and the book was finally published with a preface by his son William Edwin Hamilton.\nNot everyone found Hamilton's quaternions the answer to everything they had been looking for.\nThomson\nwrote:-\nQuaternions came from Hamilton after his really good work had been done, and though beautifully ingenious, have been an unmixed evil to those who have touched them in any way.\nCayley\ncompared the quaternions with a pocket map\n[\n26\n]\n:-\n... which contained everything but had to be unfolded into another form before it could be understood.\nHamilton died from a severe attack of gout shortly after receiving the news that he had been elected the first foreign member of the\nNational Academy of Sciences\nof the USA.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}