{
  "nome_completo": "William Hopkins",
  "nome_curto": "William Hopkins",
  "ano_nascimento": "1793",
  "ano_morte": "1866",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hopkins/",
  "lugar_nascimento": "Kingston-on-Soar, Derbyshire, England",
  "lugar_morte": null,
  "biografia": "William Hopkins\n's father was also named William Hopkins. Hopkins senior was a farmer, not in the sense of working on a farm but in the sense of owning a farm and employing others to do the hard work. William junior was supposed to follow in his father's footsteps so his education was not considered important. William showed little progress, particularly when he was taken to Norfolk and instructed in the practical matters concerned with the running of a farm.\nSticking with the plan that his son would become a farmer, William Hopkins senior purchased a small farm near Bury St Edmunds in Suffolk. William junior and his wife\n(\nhe had by now married a Miss Braithwaite\n)\nmade an unconvincing attempt to run the farm. He neither enjoyed the work nor did it bring in enough money to allow him to live a reasonable life and debts began to mount. When his wife died, Hopkins saw the chance to start a new life that he would enjoy.\nHopkins sold the small farm which his father had bought him and with the money he was able to pay off his debts. In\n1822\n, at the age of twenty-nine, Hopkins entered Peterhouse, the oldest of the Colleges of the University of Cambridge. There he studied mathematics and, particularly when one takes into account his previous poor education, he was highly successful. He graduated in\n1827\nplaced Seventh\nWrangler\nin the Mathematical Tripos. This means that he was seventh in the list of those gaining first class honours in that year. Just ahead of him was\nDe Morgan\n, who was in the same year and placed Fourth Wrangler in the Mathematical Tripos. Hopkins married for a second time, to Caroline Boys, while he was an undergraduate at Cambridge. They had three children, one son and two daughters.\nAfter graduating Hopkins became a private tutor at Cambridge, having\nTait\n,\nThomson\n,\nStokes\n,\nMaxwell\nand\nTodhunter\namong his pupils. He was highly successful being called the \"senior wrangler maker\".\nRouse Ball\nrelates that in\n1849\n:-\n[\nHopkins\n]\nwas able to say that he had among his pupils nearly two hundred wranglers, of whom seventeen had been senior and forty-four in one of the first three places.\nA little calculation shows how remarkable these figures are. By\n1849\nthere had only been about\n20\nsenior wranglers during the time he tutored\n(\nthere was only one top student in each year\n)\nand around sixty placed in the top three. Of course once he gained a reputation as the best tutor he was able to select the best students from the first year class to tutor. Some tutors concentrated entirely on examination technique but Hopkins\n[\n3\n]\n:-\n... was conspicuous for encouraging in his pupils a disinterested love of their studies, instead of limiting their aspirations to examination honours.\nHopkins made relatively little contributions to pure mathematics, other than in his tutoring and with a two volume text\nElements of Trigonometry\nwritten in\n1833\nand\n1847\nwhich contains interesting historical comments. However, he did make major contributions to the application of mathematics to geology.\nHe became interested in applying mathematics to geology in\n1833\n. This came about because of his friendship with Adam Sedgwick. Sedgwick had also trained as a mathematician and had been appointed professor of geology at Cambridge in\n1818\n. Sedgwick began fieldwork at Barmouth in north Wales in\n1831\nwhere he established the order of local rocks and gave the name Cambrian to the oldest fossiliferous strata. The name was chosen because Cambria is the old name for Wales. Hopkins accompanied Sedgwick to Barmouth on many of these trips and through this work, which he greatly enjoyed, he began to feel that geology would benefit by being put on a firm mathematical basis. He made mathematical models which won him the Wollaston Medal of the Geological Society of London in\n1850\n.\nHopkins was President of the Geological Society of London in\n1851\nand\n1852\n(\nSedgwick had been President of the Society in\n1829)\n. He was president of the\nBritish Association\nin\n1853\nwhen it met in Hull. In his presidential address he\n[\n3\n]\n:-\n... referred to a series of important experiments which he had instituted at Manchester with the advice of\nSir William Thomson\nand the assistance of Messrs Joule and Fairbairn, to determine the temperature of melting substances under great pressure.\nThe experiments were being conducted by Hopkins in his study of the interior of the Earth.\nIt would not be unfair to say that most of the geological theories which Hopkins proposed have turned out to be false. As Beckinsale writes\n[\n1\n]\n:-\n... except in the popularisation of quantification and in the broader field of geophysics, Hopkins' effect on contemporary geology was frequently retrogressive rather than progressive. He was often lacking in geological insight ...\nAs to his character we refer to\n[\n3\n]\nwhere Anderson writes:-\nHe was a man of marked dignity of character and most affectionate nature. He took a keen pleasure in poetry and music, had great conversational power, and his sense of natural beauty led to his taking up, not unsuccessfully, landscape painting late in life as a recreation.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}