{
  "nome_completo": "William Emerson",
  "nome_curto": "William Emerson",
  "ano_nascimento": "1701",
  "ano_morte": "1782",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Emerson/",
  "lugar_nascimento": "Hurworth, near Darlington, England",
  "lugar_morte": "Hurworth, near Darlington, England",
  "biografia": "William Emerson\n's father, Dudley Emerson, ran a school in Hurworth. He had two sons, the younger, named Dudley as his father, died when he was young. Dudley Emerson was skilled in mathematics and his school was successful. He educated his son William, the subject of this biography, teaching him reading, writing and mathematics, as well as a little Latin. William also studied languages with the local curate who lived in Dudley's house. At this stage William had little interest in learning, spending many hours looking for birds' nests. To complete his education, Dudley sent William to a school in Newcastle and then to one in York. At these schools he became fascinated by mathematics, which he also studied on his own by reading his father's mathematics books. After the death of his father, William took over running the school in Hurworth in\n1730\n. This, however, did not prove successful for although Emerson was a highly intelligent and learned man, he had no patience as a teacher and frequently lost his temper with pupils who were unable to benefit from his high-powered teaching. The school was forced to close in\n1733\nas the pupils deserted it. Emerson's father had left him an estate at Castle Gate, near Eastgate in Weardale, and this brought in an income of between £\n70\nand £\n80\na year. He decided that he could live on this, and from then on he devoted himself to studying mathematics.\nTwo years after the school in Hurworth closed, Emerson married. Chris Lloyd explains the events surrounding the marriage\n[\n4\n]\n:-\nIn\n1735\n, he married Elizabeth, the daughter of the Reverend Dr John Johnson, the rector of Hurworth. The rector had offered a £\n500\ndowry with his daughter's hand, but he disapproved of her choice. He treated his scruffy son-in-law with contempt and refused to pay, so Emerson loaded all his wife's clothes in a barrow and wheeled it round to the parsonage, saying he refused \"to be beholden to such a fellow for a single rag\". He also vowed to prove the rector wrong.\nWe note at this point that William and Elizabeth Emerson had no children. The description of Emerson's behaviour towards his father-in-law looks eccentric and, indeed, we should explain that Emerson was a highly eccentric man. Again we quote from\n[\n4\n]\nfor this colourful description:-\n... vulgar language was typical of Emerson, as was the coarseness of his dress. His wife, Elizabeth, spun and bleached the linen which she then turned into his clothes on her elaborate sewing machine. He always buttoned the top and bottom of his coat but left the middle open and billowing. To keep his chest warm, he wore his shirt back to front. He was also renowned for inventing shin-covers: pieces of sacking tied above the knee with string. Shin-covers allowed him to sit in his favourite chair as close to the fire as possible without his protruding lower legs getting burnt.\nIn\n1743\nEmerson published his first mathematical textbook,\nThe doctrine of fluxions\n. The Preface begins as follows:-\nTo say any thing in praise of the Method of Fluxions. or of its dignity and rank among the mathematical sciences, would be as needless as to describe the excellency of bright sunshine above the twinkling light of stars; since any one who is acquainted with the sciences will allow it to be a method of calculation incomparably superior to all other methods that ever were known or found out; and beyond which nothing further is to be hoped or expected. It lens its aid and assistance to all the other mathematical sciences, and that in their greatest wants and distresses: It opens and discovers to us the secrets and recesses of Nature, which have always before been locked up in obscurity and darkness. To this all the noble and valuable discoveries of the last and present age are entirely owing: And by this method Sir\nIsaac Newton\n, the worthy inventor, determined and settled the system of the whole visible World.\nA second edition was published in\n1757\nand a third enlarged edition in\n1768\n. In\n[\n3\n]\na letter by Francis Holliday\n(\nwritten in September\n1776)\nis given in which he described the opinions of\nWilliam Jones\nand\nAbraham de Moivre\nconcerning Emerson's book:-\n[\nJones\nand\nde Moivre\n]\nexpressed their great approbation of Mr Emerson's Book of Fluxions, then lately printed, with regard to the method and neatness of the manner of his treating the subject, but were of the opinion he began his book too high for beginners, and that his\n4\n,\n5\n, etc Propositions were very elegant and useful in comparing Fluents, but too difficult and abstracted.\nThis does sound a little like the failed schoolmaster who found it impossible to come down to the level of his pupils. However, Holliday goes on in this letter to express his own views as to why Emerson spent so little time explaining the basics ideas:-\nThe reason I suppose why Mr Emerson began his subject high was designedly; for no doubt, he considered that all authors that wrote upon Fluxions, spent a great deal of words in explaining the first principles, and sometimes made them rather more obscure by a multitude of words laid the subject so low, and upon such incorrect principles, that the Science could not be defended against the Cavils of such as were professed Enemies to Science.\nIndeed this view is supported by reading Emerson's long Preface where he spends much time defending the method of fluxions against criticism. Two further books were published in\n1749\n:\nThe Projection of the Sphere, Orthographic, Stereographic and Gnomical\nand\nThe Elements of Trigonometry\n\"containing the properties, relations, and calculations of sines, tangents, secants, etc. The doctrine of the Sphere, and the Principles of Plain and Spherical Trigonometry all plainly and clearly demonstrated\". The second mentioned work is in three volumes and we give a short extract from the Preface:-\nIn this treatise I have ventured to lay down the whole both theory and practice; and to take in all things of any consequence that any way belong to the subject. ... I won't say that I have quite exhausted the subject, but I am of the opinion that I have omitted little or nothing of any consequence.\nIn\n1754\nhe published\nPrinciples of mechanics explaining and demonstration The general laws of motion, the laws of gravity, motion of descending bodies, projectiles, mechanic powers, pendulums, centres of gravity, strength and stress of timber, hydrostatics and construction of machines\n. This, the most popular of his books, ran to six editions, the last\n(\nwhich was revised and corrected\n)\nbeing published in\n1836\n. Perhaps one of the most remarkable facts here is that Emerson constructed the many instruments illustrated in this work, including the spinning-wheel he constructed for his wife. In\n1755\nhe published\nA Treatise of Navigation\nbut an important event took place in\n1763\nwhen he was introduced to the publisher John Nourse by his friend Edward Montagu. Montagu was a mathematician of some note, an FRS and also a Member of Parliament.\nWilliam Bowe, who knew Emerson personally, suggests in\n[\n2\n]\nthat Emerson's first publications were not popular and, had it not been for Nourse, nothing further may have been published. This is not totally convincing given that a second edition of\nThe Doctrine of Fluxions\nwas published in\n1757\n, before he met Nourse. However, it is clear that Nourse strongly encouraged Emerson and from\n1763\nonwards all his books were published by Nourse. He returned to fluxions, publishing\nThe Method of Increments herein the principles are demonstrated and the Practice thereof shown in the Solution of Problems\nin\n1763\n. The Preface begins as follows:-\nHe that writes upon a new or strange subject, little treated on before; has something more to do, than he that writes only on common or known matters. For he not only has his general scheme to lay, and the several parts of his work to connect properly together; but he has numberless computations to go through, which never before have been attempted; and which, without trial, he is ignorant whether they will succeed or not; and like a traveller wandering in an unfrequented and desolate country, must often turn back and begin his progress anew.\nEmerson agreed with John Nourse to write a course of mathematics and thirteen volumes were envisaged. Part of this course was a second edition of\nThe Elements of Trigonometry\nand a new work of two volumes\nA treatise of algebra\n(1765)\n. The Preface contains strong claims as to the importance of the subject:-\nThe subject of the following book is Algebra, a science of universal use in the mathematics. Its business and use is to solve difficult problems, to find out rules and theorems in any particular branch of science; to discover the properties of such quantities as are concerned in any subject we have a mind to consider. It properly follows these two fundamental branches, Arithmetic and Geometry, but is vastly superior in nature to both, as it can solve questions quite beyond the reach of either of them.\nEmerson maintained a remarkable output of textbooks:\nThe Elements of Optics\n(\nfour books\n)\n(1768)\n;\nA System of Astronomy\n(1769)\n;\nThe Laws of Centripetal and Centrifugal Force\n(1769)\n;\nThe Mathematical Principles of Geography\n(1770)\n; and\nTracts\n(1770)\n. Also in\n1770\nappeared two works on\nNewton\n's fluxions. One was\nA short comment on Sir I Newton's Principia containing notes upon some difficult places of that excellent book\n. Here are some short extracts from the Preface:-\nThe Principia being a book which is universally read by all the world, that pretend to any degree of philosophical learning; it cannot be improper to explain such passages therein as seem obscure and difficult. For although it is written in as clear a style as can be done in so few words; yet, by reason of its conciseness, and the difficulty of the subjects treated on, many things occur which require some further explication, especially to young beginners. ... This little Treatise was written many years since; for when I studied the Principia, I was frequently at a stop, which obliged me to make calculations here and there, as I went on; and when I had done, I set them down as notes upon these places. Wherein I only meddled with these places, that appeared difficult to me. These notes collected together are the subject of the following Comment.\nThe second of these works on fluxions was\nA Defence of Sir Isaac Newton against the objections that have been made to Several Parts of the Principia\n(1770)\n. The text begins as follows:-\nThis incomparable Treatise being written in a concise style, and in the synthetic method, and being upon subjects quite new and untouched before, the generality of readers could make little of it. As it contained a new system of philosophy, built upon the most sublime geometry, the greatest mathematicians were obliged to study it with great care and attention, and few became masters of the subject; so that for a long time it was little read. But, at last, when the value of it became more known, it gained universal approbation, and the whole world stood amazed at the numberless new discoveries contained therein. And, upon account of its universal agreement with all the phenomena of nature, it was adopted as the true system by all, except some few that, through envy or ignorance, were bigoted to some other scheme.\nIn this work he answers objections made by\nJohann Bernoulli\n,\nDaniel Bernoulli\nand\nLeonhard Euler\nas well as defending\nNewton\n's right to be considered as the inventor of the \"method of fluxions' rather than\nLeibniz\n. Emerson's final book was\nMiscellanies or a Miscellaneous Treatise containing several mathematical subjects\n(1776)\n. The topics included are\n(\nI\n)\nLaws of chance,\n(\nII\n)\nAnnuities,\n(\nIII\n)\nSocieties,\n(\nIV\n)\nMoon's Motion,\n(\nV\n)\nConstruction of Arches,\n(\nVI\n)\nPrecession of Equinoxes,\n(\nVII\n)\nConstruction of logarithms,\n(\nVIII\n)\nInterpolation,\n(\nIX\n)\nThe longitude,\n(\nX\n)\nInterest,\n(\nXI\n)\nFigure of sines, etc.,\n(\nXII\n)\nFortification,\n(\nXIII\n)\nGunnery,\n(\nXIV\n)\nArchitecture,\n(\nXV\n)\nMusic,\n(\nXVI\n)\nRules of Philosophy,\n(\nXVII\n)\nOptical lectures,\n(\nXIII\n)\nProblems.\nWe should not give the impression that all of Emerson's mathematical publications were his books. He also contributed to various publications such as the\nLadies' Diary\n,\nThe Palladium\n,\nMiscellanea Curiosa Mathematica\n, and the\nGentleman's Magazine\n. Often he used a pseudonym, especially 'Merones,' 'Nichol Dixon,' and 'Philofluentimechanalgegeomastrolongo.' He defended his writings vigorously against criticisms, even in the Preface to some of his books. For example, two and a half pages of the Preface to\nMiscellanies\nconsists of an attack on someone who had criticised his\nA System of Astronomy\n.\nWilliam Bowe describes Emerson with these words\n[\n2\n]\n:-\nHe was singular and uncouth in his dress and manners, and hasty and impetuous in his temper; but whatever failing he had, they were overbalanced by his virtues. He had a great, firm, and independent mind, that could not be brought to submit to any thing mean, base or disingenuous, by any power on earth: a pure, genuine, ardent love of truth, and detestation of falsehood of whatever species.\nGow reinforces Bowe's opinion of Emerson's character writing that he\n[\n3\n]\n:-\n... was cantankerous, opinionated, careful with money and eccentric. Nonetheless, he was sincere, forthright and well respected for his wide knowledge, mainly acquired from his own reading and study.\nWe note that Emerson was offered a fellowship of the\nRoyal Society\nbut turned it down, saying:-\nIt is a damned hard thing that a man should burn so many farthing candles as I have done, and then have to pay so much a year for the honour of F.R.S. after his name. When a man becomes eminent, he has to pay quarterly for it. This is the way ingenuity is rewarded in England. Damn them and their F.R.S. too.\nEmerson was a strong healthy man for much of his life although he did nothing for his health with much drinking and enjoying his favourite hobby of spending hours fishing in water up to his waist. By\n1776\n, however, his health had begun to deteriorate. He wrote in a letter to his publisher Nourse in that year\n(\nsee\n[\n3\n]\n)\n:-\nI have been much afflicted with the gout and gravel\n[\ngall stones\n]\nall this winter, the gout has left me, but the worst thing, the gravel, still continues.\nHe spent another six years in increasing pain from the stones which eventually led to his death. His gravestone was inscribed in Hebrew and Latin with words written by Emerson himself:-\nBelow are interred the mortal remains of William Emerson; a man whose merit and knowledge remained long unnoticed, although in him were united the virtues of simplicity and perfect integrity, with uncommon genius, he was a great mathematician. If you have read his works, this stone need not inform you; if not, read them and learn.",
  "math_areas": [
    "Algebra"
  ]
}