{
  "nome_completo": "William Oscar Jules Moser",
  "nome_curto": "William Moser",
  "ano_nascimento": "1927",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moser_William/",
  "lugar_nascimento": "Winnipeg, Canada",
  "lugar_morte": "Montreal, Canada",
  "biografia": "William Moser\nis known to his friends and colleagues as Willy. His parents were Laura Feurstein and Robert Moser from Austria. They married there and their oldest child Leo was born in Vienna in\n1921\n, before they emigrated to Canada. They settled in Winnipeg and on\n5\nSeptember\n1927\ntwin sons were born, one of the twins being Willy the subject of this biography.  He grew up in Winnipeg where he attended both primary and secondary school. His biggest mathematical influence as he grew up was his older brother\nLeo\nwho went on to become a leading mathematician with a biography in this archive. In\n2005\nMoser edited a volume of collected papers of his brother\nLeo Moser\nHe wrote:-\nLeo\ndied more than\n35\nyears ago, before his\n49\nth\nbirthday, and he has been in my thoughts and memory all these years.\nLeo\nwas my first mathematical mentor. When I was a teenager he was already showing me the pleasures of mathematics.\nLeo\n's enthusiasm for mathematics was boundless, his creativity was ingenious, and creating problems was his specialty. In this respect he was like\nPaul Erdős\n, whom\nLeo\ngreatly admired\n(\nas did I\n)\n; and like\nErdős\nhe was completely open and generous with his knowledge.\nMoser entered the University of Manitoba, following the career path of\nLeo\n, and graduated with a B.Sc. in\n1949\n. In August\n1949\nhe participated in a meeting of the Canadian Mathematical Congress. He wrote about the influence of this Meeting on at least two separate occasions. This first quote is from\n[\n2\n]\n:-\nIn August\n1949\nI participated in a meeting of the Canadian Mathematical Congress in Vancouver. This organization was then only four years old. At this\n1949\nCongress I met the founding fathers:\nDonald Coxeter\n,\nRalph Jeffery\n,\nLloyd Williams\n, Eric O'Connor, and others. What a fine group of fine mathematicians.\nFurther details of the influence of this event on Moser's mathematical life is given in\n[\n1\n]\n:-\nThere I met the founders of the Congress and established a lasting friendship with them and others. I well remember\nLloyd Williams\n, who raised tens of thousands of dollars from private corporations to support the work of the Congress. Also,\nRalph Jeffery\nwho started, and guided, the Summer Research Institutes in Kingston where I spent three great summers. I also started a friendship with Father O'Connor who worked tirelessly for the benefit of others. I met\nDonald Coxeter\nwho played such an important role in my life.\nMoser then did a Master's degree at the University of Minnesota, being awarded an M.A. in\n1951\n. For the next two years he was National Research Council Canada fellow, undertaking research at the University of Toronto with\nDonald Coxeter\nas his doctoral supervisor\n[\n2\n]\n:-\nWilliam Moser's relations with\nDonald Coxeter\nwere beyond those of a former student: during his whole life he spent many respectful hours visiting\nCoxeter\n, particularly later in\nCoxeter\n's life. Some of his trips to Toronto have been only to visit\nCoxeter\n.\nOn\n2\nSeptember\n1953\n, Moser married Beryl Rita Pearlman; they had three children Marla, Lionel, and Paula. In\n1955\nhe was appointed to the University of Saskatchewan as an Instructor, becoming an Assistant Professor there in\n1957\n. This was the year he was awarded his Ph.D. by the University of Toronto for his thesis\nAbstract Groups And Geometrical Configurations\n. In fact this thesis was a major component in the classic text\nGenerators and relations for discrete groups\njointly authored by\nDonald Coxeter\nand Willy Moser and published by Springer-Verlag in Berlin-Göttingen-Heidelberg in\n1957\n. In the Preface to the book they write:-\nWhen we began to consider the scope of this book, we envisaged a catalogue supplying at least one abstract definition for any finitely-generated group that the reader might propose. But we soon realized that more or less arbitrary restrictions are necessary, because interesting groups are so numerous.\nSee\nCoxeter-Moser Preface\nfor a complete version of the Preface.\nGraham Higman\n, reviewing the book, explained that it :-\n... brings together a great deal of information on generators and relations for a wide variety of groups. For instance, it deals with the crystallographic groups, with the fundamental groups of surfaces, with the symmetric and related groups, with the projective linear groups over finite fields, and with groups on real Euclidean space generated by reflections. There is also a systematic method for checking the sufficiency of a set of relations, and considerable attention to graphical representations. The book will be invaluable to anyone who believes, as I do, that progress in Group Theory depends primarily on an intimate knowledge of a large number of special groups.\nThe second publication by Moser\nOn the number of ordinary lines determined by n points\nwas again of major significance. The paper, which was a joint work with Leroy M Kelly, was published in\n1958\n. G A Dirac, reviewing the paper, writes:-\nThis paper is certain to interest a wide class of readers, because of the generality and importance of the problems considered and the elementary nature and great ingenuity of the methods used. Let there be a finite number\nn\n(\n>\n1\n)\nn ( > 1)\nn\n(\n>\n1\n)\nof points in the real Euclidean or the real projective plane, not all on one line, and let every pair of distinct points be joined by a line. The authors consider two most interesting and general questions concerning such configurations of\nn\nn\nn\nnon-collinear points and the lines determined by them: What is the minimum number of lines determined by the\nn\nn\nn\npoints, and what is the minimum number of those lines which have the property that each of them passes through exactly two of the\nn\nn\nn\npoints?\nIn fact Dirac was the right person to review this paper for he had made a famous conjecture that there are at least\nn\n/\n2\nn/2\nn\n/\n2\nlines with the property that each of them passes through exactly two of the\nn\nn\nn\npoints. The problem had been around for a long time, for\nSylvester\nhad asked about the existence of such lines in a question in the\nEducational Times\nin\n1893\n. Moser and Kelly proved in this famous paper that there are at least\n3\nn\n/\n7\n3n/7\n3\nn\n/\n7\nsuch lines, and moreover this bound is sharp when\nn\n=\n7\nn = 7\nn\n=\n7\n. We note in passing that Moser published a joint paper with\nPeter Borwein\nin\n1990\nA survey of Sylvester's problem and its generalizations\nwhich looks at developments. Another of Moser's\n1958\npublications was\nOn the relative widths of coverings by convex bodies\n, then in the following year he published the paper\nAbstract definitions for the Mathieu groups\nM\n11\nM_{11}\nM\n1\n1\n​\nand\nM\n12\nM_{12}\nM\n1\n2\n​\nadding to the examples of group presentations appearing in\nGenerators and relations for discrete groups\n.\nIn\n1959\nMoser returned to the University of Manitoba, where he had studied as an undergraduate, being appointed an Associate Professor. He remained there until\n1964\nwhen he was appointed as an Associate Professor at McGill University in Montreal. He remained at McGill, being promoted to Professor in\n1966\n. He retired in\n1997\nwhen he was made Professor Emeritus. At this time McGill paid him a tribute:-\nDuring his\n32\nyears in the Department of Mathematics and Statistics, Moser fashioned and taught his own geometry courses in an original manner, making collections of research problems along the way. In order to promote his specialty, Moser became involved in the teaching of high school mathematics teachers, making films about geometry, organizing mathematical competitions and collecting and disseminating competition problems.\nHis contributions to mathematics in Canada, and in particular to the\nCanadian Mathematical Society\n, are quite outstanding. He was president of\nCanadian Mathematical Society\nfrom\n1973\nto\n1975\n. He was Editor-in-Chief of the Canadian Mathematical Bulletin - Bulletin Canadien de Mathématiques - from\n1961\nto\n1970\n, Chairman of the Publications Committee from\n1970\nto\n1974\nand an Associate Editor of the Canadian Journal of Mathematics - Journal Canadien de Mathématiques - from\n1981\nto\n1985\n. He was honoured for these contributions when he received the\nCanadian Mathematical Society\nDistinguished Service Award in\n2003\n. One aspect of his contributions, which we have not yet mentioned, is highlighted in the citation for the award\n[\n2\n]\n:-\nSince the beginning of his career in\n1955\n, William Moser has been involved with high school/college mathematics in a variety of ways, particularly serving on committees arranging provincial mathematics competitions in Saskatchewan, Manitoba and Quebec. He was a member of the CMS Education Committee when, under the chairmanship of Lloyd Dulmage, it instituted the Canadian Mathematical Olympiad. He edited\n(\nsome with Ed Barbeau\n)\nthe booklets containing the problems, solutions and results of the Canadian mathematical Olympiads from\n1969\nto\n1978\n. During the years\n1975\n-\n1985\n, he, E Barbeau and M S Klamkin edited five collections of problems\n(500\nproblems altogether\n)\nthat the CMS printed and distributed widely. The full collection, corrected and improved, has been published by Mathematics Magazine in its spectrum series as \"\n500\nMathematical Challenges\" in\n1995\n. He has also taught NSF Summer Institutes for High School Teachers\n(1959\n-\n62)\nand participated in the College Geometry Project\n(1964\n-\n68)\nat the University of Minnesota, making beautiful films, one about\nCoxeter\n.\nMoser published a fine collection of combinatorics papers jointly with Morton Abramson:\nA note on combinations\n(1966)\n;\nCombinations, successions and the n-kings problem\n(1966)\n;\nPermutations without rising or falling w-sequences\n(1967)\n;\nEnumeration of combinations with restricted differences and cospan\n(1969)\n;\nGeneralizations of Terquem's problem\n(1969)\n;\nThe problem of the second seating and generalizations\n(1972)\n;\nArrays with fixed row and column sums\n(1973)\n; and\nLinear and ring arrangements\n(1976)\n.\nFinally we must say something about Moser's remarkable contributions in publishing surveys of problems in discrete geometry in both books and articles. He edited\nProblems in discrete geometry\n(1980)\nwhich collected together\n34\nproblems, each with references to preceding work. In the following year he edited\nResearch problems in discrete geometry\nwhich was a collection of\n68\nproblems of combinatorial geometry including distance problems, covering and packing problems, lattice point problems, and visibility problems. In\n1985\nin the paper\nProblems on extremal properties of a finite set of points\nhe presented updated information of progress on\n19\nof the problems from the earlier work. In\n1989\nthe First Canadian Conference on Computational Geometry was held in Montreal and Moser presided over the two problem sessions publishing\nProblems, problems, problems\nin the conference proceedings. This interest in problems in discrete geometry culminated in\n2005\nwith the publication of a\n500\npage book\nResearch problems in discrete geometry\npublished jointly by Moser, Peter Brass and János Pach. The chapter headings give an indication of the content:\nDensity problems for packings and coverings;\nStructural packing and covering problems;\nPacking and covering with homothetic copies;\nTiling problems;\nDistance problems;\nProblems on repeated configurations;\nIncidence and arrangement problems;\nProblems on points in general position;\nGraph drawings and geometric graphs;\nLattice point problems;\nGeometric inequalities.\nColin Campbell, who has been our colleague at St Andrews for forty years, studied for a Master's Degree at McGill University under Moser's supervision during\n1964\n-\n65\n. He writes:-\nAs a young Master's student from Scotland attending McGill University I was introduced to the delights of computational group theory by my cigar chain-smoking supervisor William Moser. While working on my dissertation in the summer of\n1965\n, I met up with William Moser in Minneapolis where he was heavily involved in the Minnemath project at the University of Minnesota. It gave me an opportunity to visit the Guthrie theatre in Minneapolis, encouraged by Moser who is a great enthusiast for the theatre. At a professional level my career has revolved round the\nTodd\n-\nCoxeter\ncoset enumeration algorithm to which I was first introduced by Moser.\nA few years later Moser supervised a second Master's student with the name of Campbell, namely Harvey A Campbell, on a similar topic. In his thesis\nAn extension of coset enumeration\n, Harvey Campbell writes:-\nThe author wishes to express deep gratitude to a scholar, Professor W O J Moser, whose ideas and encouragement made this thesis possible.\nMay I\n[\nEFR\n]\nrecount a meeting with Willy Moser in\n1982\n(\nwhen he gave me the copy of Harvey Campbell's thesis from which we have just quoted\n)\n. I attended the 'Finite groups - coming of age' conference in Concordia University in Montreal and visited Moser at McGill. We met on Saturday morning in the Mathematics Department. When I arrived Moser was playing lightning chess with one of his students. It was a game played with such a few seconds on the clocks that it was more a test of reaction time rather than of chess. It was played in great spirit with much hilarity.\nIn March\n2003\nMoser was interviewed by Siobhan Roberts who was working on her major work on\nCoxeter King of Infinite\nspace. He recounted the following story\n[\n3\n]\n:-\n\"Donald made many great contributions to mathematics. I made one great contribution,\" recounted Moser. Moser's opportunity came at the end of\nCoxeter\n's\n1955\nsummer of roving lectures, after his session in Stillwater, at Oklahoma State University. Moser drove down to meet\nCoxeter\nand serve as his assistant, taking detailed notes of the well-polished lectures. \"At the end of the summer we drove north, to civilisation,\" said Moser wryly. \"We were in my car and Donald asked me if he could drive. It was a new car. Indeed it was the first car I had ever purchased, a green\n1955\nPlymouth\n2\n-door. I paid $\n2\n,\n000\nfor it and drove it to Oklahoma. But I agreed. I was surprised to see that he was an aggressive driver. At one point he was trying to pass a car while driving up a hill on a\n2\n-lane highway. I immediately perceived that this was not a prudent thing to do. He tried to coax the car to go faster but it wouldn't respond. At the last moment I shrieked at him, 'Pull back, pull back'. I was probably his only student to shriek at him. He began to pull back and at that moment a truck came over the hill. He managed to get back in the right lane just in time. I HAD SAVED HIS LIFE! And mine. But saving\nCoxeter\n's life was my greatest contribution to mathematics.\"\nWe note that Moser also told Roberts in this interview that\nGenerators and relations for discrete groups\nwas, for a time, miscatalogued at the University of Toronto library and mis-shelved in the genealogy section.\nWe end this biography of Willy Moser by quoting his words from his address to the\nCanadian Mathematical Society\nat the time he received its Distinguished Service Award in\n2003\n. Addressing the young mathematicians in the audience he said\n[\n2\n]\n:-\nBe generous and patient as teachers, be active in projects which benefit the mathematical community and, above all, have as long and as happy a mathematical life as I have had, and am still having.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Geometry"
  ]
}