{
  "nome_completo": "William Fishburn Donkin",
  "nome_curto": "William Donkin",
  "ano_nascimento": "1814",
  "ano_morte": "1869",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Donkin/",
  "lugar_nascimento": "Bishop Burton, Yorkshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "William Donkin\nwas the son of Thomas Donkin\n(1776\n-\n1856)\nand Alice Bateman\n(1785\n-\n1860)\n. Thomas Donkin, baptised\n8\nJuly\n1776\n at St John Lee, Sandhoe, Northumberland, was a land agent who married Alice Bateman on\n6\nJune\n1809\nin Whitby, Yorkshire. Thomas and Alice Donkin had eleven children: William Bateman Donkin\n(\nborn\n1810)\n, Sarah Donkin\n(\nborn\n1811)\n, Alice Donkin\n(\nborn\n1812)\n, William Fishburn Donkin\n(\nborn\n1814)\n, Mary Donkin\n(\nborn\n1815)\n, Thomas Bateman Donkin\n(\nborn\n1818)\n, Henry Donkin\n(\nborn\n1820)\n, James Rumsey Donkin\n(\nborn\n1822)\n, Henry Donkin\n(\nborn\n1823)\n, Edward Donkin\n(\nborn\n1825)\n, and Frederick Donkin\n(\nborn\n1828)\n. William Fishburn Donkin was, therefore, the second son, but William Bateman Donkin did not survive and so William became the eldest surviving son. He had two elder sisters, one younger sister and seven younger brothers but several of his younger siblings died as babies.\nWilliam Donkin had two uncles who were men of considerable importance. Bryan Donkin\n(1768\n-\n1855)\n, a brother of William's father, was both a fellow of the\nRoyal Society\nand a fellow of the\nRoyal Astronomical Society\n. A leading engineer, he developed a paper making machine, set up perhaps the first canning factory, assisted Thomas Telford in canal construction, assisted Isambard Kingdom Brunel in tunnel building and helped\nCharles Babbage\nin constructing his computers. Thomas Bateman\n(1778\n-\n1821)\n, a brother of William's mother, studied medicine in Edinburgh and became a leading expert on dermatological diseases.\nIt was while still a young child that Donkin showed his wide range of interests\n[\n6\n]\n:-\nVery early in life his taste for languages, mathematics, and music, became apparent, and, in addition, he possessed perseverance and love of acquiring knowledge, that almost before he left the nursery he was known to cry when help was forced upon him which he felt he did not need, and which deprived him of the discovery he wanted to make for himself. The education he received from his father also developed a love for physics and chemistry.\nDonkin's family wanted him to have a top quality education but they did not want to see him lose the influence that his family were able to provide. To achieve this the family moved to York in\n1829\nso that William Donkin could be educated at the famous St Peter's School, York. This school, which claims to be the third oldest school in the world which is still operating, was founded in\n627\nand\nAlcuin\nwas one of the early headmasters around\n750\n. At St Peter's School, Donkin was taught classics by Stephen Creyke\n(1796\n-\n1883)\n. Creyke had been appointed headmaster of the school in\n1827\nand he was very successful both as headmaster and as teacher. We note that Creyke went on to become Archdeacon of York from\n1845\nto\n1866\n. Donkin spent three years at St Peter's School and always emphasised what a huge debt he owed to Creyke whom he considered to be a truly outstanding teacher.\nDonkin left St Peter's School in\n1832\nand matriculated at St Edmund's Hall, University of Oxford, on\n10\nOctober\n1832\n. In\n1834\nhe won a classical scholarship at University College, Oxford, and he graduated with a B.A. on\n25\nMay\n1836\nbeing awarded first class honours in both classics and in mathematics. He was elected a fellow of University College in\n1836\n, defeating the well-known hymn writer and theologian Frederick William Faber. Donkin continued to hold the fellowship until\n1843\n. He was awarded the Senior Mathematical Scholarship and the Johnson Mathematical Scholarship, both in\n1837\n. The Johnson Mathematical Scholarship was named for John Johnson\n(1776\n-\n1831)\nwho had been a fellow of Magdalen College\n1800\n-\n1827\n. After inheriting a considerable amount of property from his mother in\n1827\nJohnson resigned his fellowship and after he died in\n1831\nhe left money to fund a Mathematical Scholarship and a Theology Scholarship, both open to the whole University. From\n1836\nto\n1842\n, Donkin was a mathematics lecturer at St Edmund's Hall; he became bursar in\n1840\n.\nOne of Donkin's early publications was not on mathematics but on ancient music. This article appeared in William Smith's \"A Dictionary of Greek and Roman Antiquities\" published in\n1842\n. In this year he was appointed as Savilian professor of astronomy at Oxford and shortly after this he was elected a fellow of the\nRoyal Society\nand also a fellow of the\nRoyal Astronomical Society\n. His first mathematical publication was\nAn Essay on the Theory of the Combination of Observations\n(1844)\nwhich he presented to the Ashmolean Society on\n26\nFebruary\n1844\n. W Leon Harter writes\n[\n5\n]\n:-\nWilliam Fishburn Donkin\n(1844)\nstarts from the assumption that the weight of an observation is proportional to the square of its precision\n(\ninversely proportional to its variance\n)\nand, as one would expect, he reaches the same conclusion as the one\nGauss\n(1823)\nreached by assuming a squared error loss function, namely that the method of least squares should be used, independently of the law of facility of error.\n...\nDonkin\n(1851)\noffers some critical remarks on the theory of least squares, and especially on the remarks of\nEllis\n. Donkin says that\nHerschel\n's proof \"should be treated with respect\" and that the method of least squares may be used, if for no other reason, because \"it is a very good method\", as shown by\nGauss\n(1823)\n.\nWe have collected information on Donkin's publications which you can read at\nTHIS LINK\n.\nOn\n25\nJune\n1844\n, Donkin married Harriet Hawtrey\n(1816\n-\n1876)\nin St Peter's Church, Oxford. Harriet had been born in Exeter, Devon, on\n6\nMarch\n1816\n, the daughter of the Rev John Hawtrey, at that time Rector of St James' Church, Guernsey and later Rector of Kingston Seymour, Somerset, and his wife Anne Watson who had been born in Quebec, Canada. William and Harriet Donkin had six children, one of whom died as a child: William Frederick Donkin\n(1845\n-\n1888)\n; Arthur Edward Donkin\n(1848\n-\n1937)\n; Alice Emily Donkin\n(1850\n-\n1929)\n; Alfred Henry Donkin\n(1850\n-\n1855)\n; Edward Hawtrey Donkin\n(1853\n-\n1927)\n; and Reginald Donkin\n(1855\n-\n1937)\n. Let us record a little about some of these children at this point.\nWilliam Frederick Donkin\n[\n7\n]\n:-\n... was the son of the late Savilian Professor of Astronomy at Oxford, and inherited from his father scientific tastes, and a rare musical talent. The father was brilliant as a scholar as well as profound as a mathematician, and the son combined the fine taste of an artist with the patience and accuracy of a scientific worker. Indefatigable and successful as lecturer on chemistry at St George's Hospital, and in pursuing the practical developments of electric lighting, Mr Donkin had made his leisure a source of pleasure and instruction to a large public.\nHe was a member of the Alpine Club and the Photographic Society, and he died on a mountaineering trip in the Bezingi district of the Central Caucasus mountains. We note that both father and son, William Fishburn Donkin and William Frederick Donkin, wrote papers under the name \"W F Donkin\", a complication for historians!\nArthur Edward Donkin became a mathematics lecturer. He was a fellow of Exeter College\n1874\n-\n75\nand a tutor at Keble College. He has a portrait in the National Portrait Gallery. Edward Hawtrey Donkin studied at Lincoln College, Oxford and became Professor of Classics at Royal Holloway College in\n1890\n. He wrote articles for\nA Dictionary of Music and Musicians\n.\nLet us return to our description of Donkin's life. Even at the time of his marriage\n[\n6\n]\n:-\n... he was beginning to suffer from a delicacy of constitution, which became a cause of great anxiety to his family; and in the midst of the most hopeful anticipations for science, when his rare abilities seemed to promise some of the discoveries which only fall to the lot of such men as he, - even then he was obliged from time to time to relinquish the duties and occupations in which he delighted, in order to try and preserve in other climates the health which was gradually leaving him. In the intervals of improvement he continued with untiring energy to attend to the duties of his Professorship, and to the advance of science in its various branches in Oxford ...\nHis most productive period for mathematical research was between\n1850\nand\n1860\n. For information about the papers he wrote during this period, see\nTHIS LINK\n.\nAt the time of the\n1851\nCensus the family, consisting of Donkin, his wife and five children, were living in New College Lane, Oxford. They had six servants: a nurse, a cook, a housemaid, a nursemaid and two house servants. He also owned a house in the High Street, Moreton-in-Marsh, Stow on the Wold, Gloucestershire which was let out to Charles Phipps.\nLet us look briefly at Donkin's involvement in refereeing papers by\nArthur Cayley\nas described by Sloan Evans Despeaux in\n[\n1\n]\n:-\nBoole\n's pioneering work on invariant theory of\n1841\nhad inspired\nCayley\nto further the subject, thereby producing 'the most important idea of his mathematical life'. ...\nBoole\nwas saddled with the task of evaluating\nCayley\n's submission 'On certain formulae of differentiation' for publication in 'Philosophical Transactions'.\nBoole\nwas doubtful whether the paper should be published and suggested a second referee be sought: Donkin was asked and\n[\n1\n]\n:-\n... he applauded\nCayley\n's effort, but was unsure of the value of his conclusions: \"The cases here examined lead to very complicated calculations, which to ordinary mathematicians would most likely have seemed inextricable, and I believe few besides Mr\nCayley\nwould have arrived at any available result. I do not know what may be the value of the conclusions actually obtained at all events the processes might probably to some extent serve as a guide or pattern for similar investigations. Considered in this light, and as a specimen of unusually complex analysis conducted with great skill, I think\n[\nthe\n]\npaper deserves a place in the Transactions; though I should regret its omission less than that of either of the two former memoirs\"\nDonkin had always been interested in music and so when the University of Oxford was asked about their attitude to music as an academic subject, they asked him to reply. John Donaldson\n(1789\n-\n1865)\nwas professor of music at the University of Edinburgh. Realising that both Oxford and Cambridge had inactive music professors he wanted their opinion whether they considered music as an academic subject\n[\n3\n]\n:-\nWilliam Fishburn Donkin\n(1814\n-\n69)\n, Savilian Professor of Astronomy, wrote on behalf of the University of Oxford. Donkin's interest in acoustics might explain why he was thought a suitable respondent; his 'Acoustics, Theoretical: Part\n1\n' was published after his death. He noted that the current professor neither resided in Oxford nor gave lectures, although William Crotch, professor from\n1799\nto\n1847\n, had given lectures at the start of the nineteenth century. The only duty performed by the music professor in\n1851\n(\nnone other than Edinburgh's former professor, Henry Bishop\n)\nwas \"examination of the exercises written by Candidates for Musical Degrees.\" The case at Oxford was complicated by the presence of a \"Choragus,\" appointed to teach, organise, and oversee practical music within the university. Nevertheless, according to Donkin, \"I never heard of any other instrument or apparatus provided either for Choragus or Professor.\" With regard to the Edinburgh Trustees' particular interests, Donkin had an interesting further observation: \"I may add that the subject of Harmonics is assigned to the Savilian Professor of Geometry ... . But that Professor has no apparatus provided for him and has never lectured on harmonics within my recollection.\"\nNow in the last years of his life, Donkin was combining his interest in music and in mathematics by writing a book on acoustics. He never finished this work but the first part which he had completed was published in\n1870\nas\nAcoustics. Theoretical\n. Bartholomew Price wrote a Preface explaining that the book was only the first part of what Donkin had intended. Price wrote:-\nThe Author, the late Professor Donkin, has passed away prematurely from the work. It was a work he was peculiarly qualified to undertake, being a mathematician of great attainments and rare taste, and taking an especial interest in the investigation and application of the higher theorems of analysis which are necessary for these subjects. He was, moreover, an accomplished musician, and had a profound theoretical knowledge of the Science of Music.\nHe began this work early in the year\n1867\n; but he was continually interrupted by severe illness, and was much hindered by the difficulty, and in many instances the impossibility, of obtaining accurate experimental results at the places wherein his delicate health compelled him to spend the winter months of that and the following years. He took, however, so great an interest in the subject, that he continued working at it to within two or three days of his death.\nFor the whole of Bartholomew Price's Preface, see\nTHIS LINK\n.\nWe end by quoting again from\n[\n6\n]\n:-\nBeyond this there is little to say of those long years during which a life that might have been one of the highest distinction was kept in check by illness and consequent inability to work. Those who knew him best, know how brightly the intellect, which otherwise might have enlightened the world, shone in the narrower sphere to which it was now confined; how his failing strength seemed only to enhance the energy that never stopped short of the limits which his state of health set to its achievements, because unable to pass beyond them; the patience that never once complained through all the weariness and comparative obscurity of his life; and the cheerfulness of character and brilliant cleverness which made a centre of happiness to his home and to his friends.\nOn\n10\nJanuary\n1870\n:-\nThe Will of William Fishburn Donkin late of the City of Oxford Savilian Professor of Astronomy in the University of Oxford deceased who died\n15\nNovember\n1869\nat the City aforesaid was proved at Oxford by the oath of Harriet Donkin of the City aforesaid Widow the Relict the sole Executrix.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic"
  ]
}