{
  "nome_completo": "William Neile",
  "nome_curto": "William Neile",
  "ano_nascimento": "1637",
  "ano_morte": "1670",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neile/",
  "lugar_nascimento": "Bishopsthorpe (near York), England",
  "lugar_morte": "White Waltham, Berkshire, England",
  "biografia": "William Neile\nwas born at Bishopsthorpe in the house of his grandfather who was Archbishop of York. William's father was Sir Paul Neile\n(1613\n-\n1686)\nand his mother was Elizabeth Clarke, the daughter of Gabriel Clarke, the Archdeacon of Durham. Paul Neile, one of the twelve founders of the Royal Society, is described in\n[\n7\n]\nas follows:-\nPaul Neile was born at Westminster in\n1613\nand was admitted as a Fellow Commoner to Pembroke College, Cambridge, in\n1627\n, at the age of\n14\n. He was one of the Ushers of the Privy Chamber to Charles I and was knighted in\n1633\n, when he is described as of Sutton Bonvill, Yorks, N.R. He was M.P. for Ripon in the Short Parliament of\n1640\n. ... We know little of Neile's life during the Commonwealth\n(1649\n-\n60)\nexcept that he was living at White Waltham near Maidenhead, evidently a man of means with an interest in astronomy and in the making of telescopes.\nPaul Neile recorded the births of five of his children, all born at Bishopsthorpe, in the Family Bible\n(\nthe actual images of the pages of the Bible can be seen at\n[\n6\n]\n)\n. The Neiles' first son Richard was born in November\n1636\nbut must have died while a baby since a third son born in June\n1640\nwas also named Richard. William, who was therefore his parents' second son, is recorded as born\n3\n4\n\\large\\frac{3}{4}\\normalsize\n4\n3\n​\nof an hour after\n11\no'clock at night on\n16\nDecember\n1637\n. This is at odds with\n[\n1\n]\n,\n[\n4\n]\nand\n[\n5\n]\nwhich all give his date of birth as\n7\nDecember\n1637\nand state that he was his parents' eldest son. Paul Neile also recorded in the Bible that a daughter Elizabeth was born in March\n1639\nand a second daughter Mary in October\n1641\n.\nWilliam Neile entered Wadham College, Oxford, in\n1652\n(\nbut did not matriculate until\n1655)\nwhere he was taught mathematics by\nJohn Wilkins\nand\nSeth Ward\n. He was a gentleman-commoner, meaning that he paid the highest fees and was ranked near the top of the social order just below the nobles. Gentleman-commoners had many privileges enjoying fine suites of rooms in College, and sat with the College Fellows at meals and in the common rooms. Certainly Neile was fortunate in being part of a family that was in the forefront of scientific work for certainly while Neile was a student, his father was observing with\nChristopher Wren\nin the observatory he had constructed on the roof of his house, the 'Hill House', at White Waltham. Paul Neile was also building a telescope for Gresham College at this time. In\n1657\nWilliam Neile became a pupil of law at the Middle Temple in London. He went on to become a member of the privy council of King Charles II.\nIn\n1657\n, while still a student at Oxford, he became the first person to find the arc length of an algebraic curve when he rectified the semicubical parabola. He communicated his results to\nWilliam Brouncker\nand\nChristopher Wren\nat the Gresham College Society, the Society based at Gresham College, London, which a few years later became the\nRoyal Society\n. Neile's work on this appeared in\nJohn Wallis\n's\nDe Cycloide\nin\n1659\n. Stedall gives further details in\n[\n3\n]\n:-\nIn\n1657\n, William Neile, a young student at Wadham College, Oxford, found the rectification of the semicubical parabola\n(\nin modern notation\n9\ny\n2\n=\n4\nk\nx\n3\n9y^{2} = 4kx^{3}\n9\ny\n2\n=\n4\nk\nx\n3\n)\nby a method that was geometric but involved a comparison of sums of infinitely small quantities.\nWallis\nwas easily able to make Neile's proof algebraic using the notation defined in 'De sectionibus conicis', while\nWilliam Brouncker\nwent further and came up with a formula for the length of a portion of the curve in terms of its coordinates. At about the same time,\nHendrick van Heuraet\nin the Netherlands arrived independently at a general method of rectification, and applied it to the semicubical parabola, and in\n1659\nFermat\nrectified both the semicubical parabola and the cycloid.\nWallis\nlater claimed that all these attempts were based on the hints he had given in the 'Arithmetica infinitorum':\n\"And I do not at all doubt that this notion there hinted, gave occasion\n(\nnot to Mr Neile only, but\n)\nto all those others\n(\nmediately and immediately,\n)\nwho have since attempted such Rectification of Curves\n(\nnothing in that way having been attempted before\n)\n.\"\nIt is true that\nWallis\nhad outlined a method of rectification in the 'Arithmetica infinitorum', and Neile may have been inspired by it, but Neile's method was expressed in traditional geometric terms and he handled a curve that\nWallis\nhad not thought about at all.\nNeile was elected a Fellow of the\nRoyal Society\non\n7\nJanuary\n1663\n, one of the first members of this Society. On\n11\nApril\n1666\nhe became a member of the Council of the\nRoyal Society\njoining his father who had been a Council member since\n1661\n. As a Council member, William Neile proposed changes to the Society, in particular the setting up of a library:-\n... let there be every year a sum of money laid aside out of the Society's stock to be laid out at the discretion of the Council in books whose chief scope is Natural Philosophy or Mathematics for the use of the Society.\nHe sent\nHypothesis of Motion\n, a work on the theory of motion, to the Society on\n29\nApril\n1669\nafter taking part in many debates in the Society on that topic. Interesting information about Neile can be found in Henry Oldenberg's correspondence\n[\n2\n]\nand Neile's paper\n(\npublished by the Society in May\n1669)\nis contained in Volume\n5\nof that work. Oldenberg was the secretary of the\nRoyal Society\nand his correspondence contains several letters from Neile. For example, in relation to the debates on motion we have just mentioned, Neile wrote:-\nI wish Dr\nWren\nwould explain his principles a little more fully but he is against finding a reason for the experiments of motion\n(\nfor ought I see\n)\nand says that the appearances carry reason enough in themselves as being the law of nature. I think it is the Law of nature that they should appear but not without some causes, but all those things perchance will be better determined hereafter.\nIn\nHypothesis of Motion\n, Neile defined as one body all matter sharing the same motion and studied impacts assuming that the colliding bodies were cubes and that\n[\n2\n]\n:-\n... the whole square surface of the one meets in the same instant of time with the whole square surface of the other.\nIn January\n1668\nNeile had written a letter to Oldenburg complaining that the country was putting far too much of its resources into military preparations rather than supporting science. He wrote\n[\n2\n]\n:-\nI am sorry we should want any assistance to philosophy, since the Great Turk or the like kind of Hectors can have it may be\n100\n,\n000\nmen to besiege a town or make a conquest perchance of less importance by much than to discover the use of the air or of the commonest thing in nature.\nAs well as his mathematical work Neile made astronomical observations using instruments on the roof of his father's house, the 'Hill House' at White Waltham in Berkshire. He died in this house at the age of\n32\nand was buried in the local parish church. Thomas Hearne, the English historian and antiquarian who was himself born in White Waltham\n8\nyears after Neile's death, describes him as follows:-\nHe was a virtuous, sober pious man, and had such a powerful genius to mathematical leaning that had he not been cut off in the prime of his years, in all probability he would have equalled, if not excelled, the celebrated men of that profession. Deep melancholy hastened his end, through his love for a maid of honour, to marry whom he could not obtain his father's consent.\nSome time before his death he suffered an attack of jaundice and this may have been related to the cause of his death.",
  "math_areas": [
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}