{
  "nome_completo": "William Wager Cooper",
  "nome_curto": "William Wager Cooper",
  "ano_nascimento": "1914",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cooper_William/",
  "lugar_nascimento": "Birmingham, Alabama, USA",
  "lugar_morte": "Austin, Texas, USA",
  "biografia": "William Wager Cooper\nwas known as Bill to his friends and colleagues. His father, also named William Wager Cooper, was born in Illinois in\n1879\nand had a variety of jobs from bookkeeper to distributor for the American brewing company Anheuser-Busch. His mother, Rae Rossman, did not want her son to be called Jr despite having the same name as his father. William, the subject of this biography, was the oldest of his parents' children, having a younger sister Emilie and brother Leon. When William was three years old the family moved to Chicago where his father had a prosperous business owning sixteen gasoline stations. Despite Leon being five years younger than William, the boys were very close as they grew up. At this time they were known as Wager and Young Wager, both tough children because they had to survive growing up in a difficult part of Chicago. William became a good street fighter, something that was necessary in the area in which they lived.\nCooper attended grammar schools in Chicago before entering Tuley High School in that city.\n(\nTuley High School, which closed in\n1974\n, was one of the best academic high schools in Chicago\n)\n. However, times became very hard during the Great Depression which hit Chicago particularly hard with\n50\n% unemployment in the city. Cooper's father became ill and lost everything in the Depression. William dropped out of high school and started to work to earn money. He did this with a variety of jobs, one of which was as a prizefighter. He had\n63\nbouts, winning all but five\n(3\nlosses and\n2\ndraws\n)\nfighting under a number of names, usually Bill Williams. He did not want his mother to know that he was boxing. However he also worked in bowling alleys and as a caddy at several golf courses. One day in\n1932\nhe was hitch-hiking to the golf course to do his caddying when he was picked up by Eric Kohler\n(1892\n-\n1976)\n, an accountant with Arthur Andersen. Kohler was amazed at Cooper's talents and suggested that Cooper apply for entry at the University of Chicago. Kohler tutored him over the next year and Cooper was financially supported by a fellowship and also by Kohler. He began his studies in the autumn of\n1934\nregistering for a chemistry degree but changed topics and was awarded a B.A. in Economics in\n1938\n.\nEric Kohler had moved from Arthur Andersen to become controller of the Tennessee Valley Authority in\n1937\nand, after the award of his B.A., Cooper was employed as his research assistant in Knoxville, Tennessee on an assignment dealing with cost allocation reporting to U.S. Congress and to develop new types of internal audits. By the middle of\n1940\nthis work was complete and Cooper, who had won a fellowship to study for a Ph.D. at the in the Business School of Columbia University, left to begin his doctoral studies. Having successfully completed the course work for his doctorate, Cooper submitted his doctoral thesis to Columbia in\n1942\n. The examining committee did not understand his thesis and, after two thesis defences, still could not agree whether to accept or reject it. Cooper later said that he \"fought the committee to a draw.\" He left Columbia University without being awarded a Ph.D. By this time Kohler was undertaking war work for the U.S. Bureau of the Budget and Cooper joined him as Principal Economist. He was\n[\n4\n]\n:-\nIn charge of work on accounting statistics and related aspects of programs for war procurement programs, price control, production allocations and related economic studies.\nIn\n1944\nhe was appointed as Instructor in Economics at the University of Chicago. He had already published\nThe Yardstick of Public Utility Regulation\n(1943)\nand, in\n1945\n, in collaboration with Eric Kohler, he published\nCosts, Prices and Profits - Accounting in the War Program\n. This article was awarded the American Institute for Accountants prize for the most valuable article on an accounting subject for\n1945\n. By this time Cooper had married Ruth Fay West\n(1917\n-\n2000)\n, the wedding taking place in September\n1944\n. His brother Leon was his best man so the wedding had to wait until Leon and returned for a spell of shore leave since he was serving in the Pacific with the U.S. navy. Perhaps more surprisingly, Leon went with William and Ruth Cooper on their honeymoon. William and Ruth settled in South Ellis Avenue, near the university, where Ruth studied for an A.B. while working for the Chicago Commission on Race Relations.\nIn\n1946\nCooper was appointed as an Assistant Professor at Carnegie-Mellon University in Pittsburgh, Pennsylvania. Well, this is not strictly correct since when Cooper was appointed the institution was called the Carnegie Institute of Technology and it only became Carnegie-Mellon University in\n1967\n. Cooper taught at the Graduate School of Industrial Administration from its founding in\n1949\n. where mathematical rigour became an important part of the courses. It was a direction that suited Cooper who began a collaboration with Abraham Charnes, professor of mathematics at the Carnegie Institute, who was an expert in operations research. Cooper became head of the Operations Research Faculty\n[\n15\n]\n:-\nHe was able to attract both funding and problems from external sources, thus providing a real-world focus for theoretical and methodological developments.\nIn many ways Cooper can be seen as the founder of the topic of Management Science as a branch of applied mathematics. He was one of the founders of The Institute of Management Sciences\n(\nTIMS\n)\nand was elected its first president in\n1954\n. He wrote\n[\n5\n]\n:-\nOn advice from my wife, Ruth F Cooper, who served as the attorney for TIMS, the charter was subsequently revised to meet the legal requirements for incorporation, first in Pennsylvania and later in California.\nCooper and Charnes also founded a journal\nManagement Science\n. The editorial gave the scope of the journal:-\nArticles from any field\n(\nindustrial engineering, econometrics, operations research, mathematics, statistics, psychology, sociology, political science, etc.\n)\nwill be welcomed as long as the article furthers the aim of developing a unified science of management.\nAt around this time Cooper began to publish mathematics papers. His total publication record is amazing, and contains over\n500\nitems. Around\n100\nof these are reviewed in MathSciNet and are works on mathematics. Most of these mathematics papers are written in collaboration with Abraham Charnes. The first of these mathematics publications is the book\nAn introduction to linear programming\nwritten jointly with Charnes and Alexander Henderson. Harold Kuhn writes in a review:-\nThis volume is composed of two parts: an economic introduction to linear programming and a set of lectures on its mathematical background. In the first part, Cooper and Henderson present the complete solution of a numerical example by the \"simplex method\" of\nG B Dantzig\n. This section is remarkable for the careful explanations of the computational detail accompanied by trenchant economic explanations at many points. In sum, most of the features of linear programming are illuminated by a deceptively simple example. In the second part, Charnes develops chapters from the various mathematical disciplines germane to linear programming, concentrating again on the simplex method; the high quality of exposition is maintained in this section.\nThe authors of\n[\n7\n]\nwrite:-\nOver a long and remarkably productive career, Professor William W\n(\nBill\n)\nCooper has made many pioneering contributions to Operations Research and Management Science, with notable forays into the areas of\n(\na\n)\nlinear and non-linear programming,\n(\nb\n)\ngoal programming,\n(\nc\n)\nchance-constrained programming,\n(\nd\n)\ndata envelopment analysis, and\n(\ne\n)\nmanpower planning, among others. His legendary partnership with Abraham Charnes has provided results whose connections go back to the\n18\nth\ncentury, bearing on problems conceived but left unsolved by\nLaplace\nand\nGauss\n.\nHis first few papers on mathematics\n(\nall written with are Abraham Charnes\n)\nare:\nThe stepping stone method of explaining linear programming calculations in transportation problems\n(1954)\n;\nA model for optimizing production by reference to cost surrogates\n(1955)\n;\nOptimal estimation of executive compensation by linear programming\n(1955)\n;\nNonlinear power of adjacent extreme point methods in linear programming\n(1957)\n;\nManagement models and industrial applications of linear programming\n(1957)\n;\nThe theory of search: optimum distribution of search effort\n(1958)\n;\nNonlinear network flows and convex programming over incidence matrices\n(1958)\n; and\nThe strong Minkowski-Farkas-Weyl theorem for vector spaces over ordered fields\n(1958)\n. Cooper and Charnes published the\n860\n-page two-volume book\nManagement models and industrial applications of linear programming\nin\n1961\n. Harvey Wagner writes in a review\n[\n19\n]\n:-\nProfessors Charnes and Cooper are two of the three undisputed founders, contributors, and leaders of that development known as linear programming. These two volumes summarise much of their numerous advances in this field. The authors set themselves the task of writing two books that could serve simultaneously as texts, advanced references, surveys of the state of the art, expository vehicles for standard applications, and monographs of original, unpublished results. ... they have managed to come as close to accomplishing their aim as anyone ever could. ... Professors Charnes and Cooper have published two books worthy of their past reputation. They have indeed established a reference point that will be difficult to match for any future treatises in linear programming.\nClement Winston expresses similar views in a review\n[\n21\n]\n:-\nThis textbook by two well known practitioners in this field, is aimed primarily, according to the authors, at persons who are interested in managerial applications of linear programming. The book makes a fine reference volume and should, in addition, appeal strongly to beginners with some mathematical maturity and to those who would like to expend their comprehension of the theory and see more clearly the broad utility of the complex methodology. All too often, articles on linear programming appear either to be written by experts for other experts leaving the unspecialised reader all too quickly lost in a maze of complicated operations and esoteric jargon, or they are popularised impressions at such a low level and with so little technical content as to be of doubtful value to anyone. here, the authors set themselves a difficult task - to show in a clear and concise manner and with little loss of rigour what linear programming is, how to solve problems to which the method is applicable and, to the best of their ability, what the method is capable of doing. They have succeeded in this task.\nWe have commented already on Cooper's remarkable publication record of over\n500\nitems. Partly this is explained by the length of his career. He retired from Carnegie-Mellon University in\n1980\nat the age of\n66\nbut this was not the end of his career for he then had a second career at The University of Texas at Austin. He was appointed as Foster Parker Professor of Management, Finance and Accounting in the Graduate School of Business at the University of Texas in\n1980\nand was a professor in the  Graduate School of Business until he became professor emeritus in his eightieth year in\n1993\n. The dean Thomas Gilligan said on Cooper's death in\n2012\nat the age of\n97\n[\n11\n]\n:-\nWilliam W Cooper came to Texas in\n1980\nat age\n66\n, already a giant in his field and at a time when many would be preparing for retirement. But as a man who began his work career as a prize fighter from Chicago, he had no intention of slowing down. I speak for generations of Texas business students, and many grateful colleagues, when I say that Bill was a cherished friend, a steady mentor and an inspiration to everyone who knew him.\nPerhaps the most stunning statistic of all is that Cooper wrote\n325\narticles while at Texas. Retirement of the second time at the age of eighty only presented him with more opportunities to undertake research and his publication rate increased\n[\n11\n]\n:-\nWhile Cooper technically retired in\n1993\n, becoming a professor emeritus, in reality nothing changed in his day-to-day life. He led a structured life, exercising each morning, dining at the Campus Club at lunch, going to his office for e-mail and correspondence, and spending his evenings reading, studying and researching.\nCooper received many awards for his remarkable contributions to operations research. These include an honorary doctorate from Ohio State University\n(1970)\n, honorary master of arts from Harvard University\n(1976)\n, honorary doctorate from Carnegie-Mellon University\n(1982)\n, the establishment by Carnegie-Mellon University of the William W Cooper Professorship\n(1982)\n, joint recipient of the\nJohn von Neumann\nTheory Prize awarded jointly by The Institute of Management Sciences and Operations Research Society of America\n(1982)\n, Award for Outstanding Research Contributions from the Graduate School of Business, The University of Texas at Austin\n(1984\nand\n1987)\n, Professional Achievement Citation of the University of Chicago Alumni Association\n(1986)\n, establishment by The University of Texas of William W Cooper Fellowships\n(1988)\n, establishment by Carnegie Mellon University of William W Cooper Fellowships\n(1989)\n, Carnegie Mellon University Graduate School of Industrial Administration names their Auditorium in honour of William W Cooper\n(1989)\n, elected to Hall of Fame, Graduate School of Business, The University of Texas at Austin\n(1990)\n, elected to Accounting Hall of Fame\n(1995)\n, honorary doctorate from the University of Alicante, Spain\n(1995)\n, elected to the Hall of Fame of the International Federation of\nOperational Research\nSocieties\n(2006)\n, and received The University of Texas Presidential Award\n(2009)\n.\nThe\n1982\nJohn von Neumann\nTheory Prize was awarded jointly to William Cooper, Abraham Charnes and Richard Duffin:-\n... for their fundamental contributions to optimization methods, concepts, and models for problems of decision, planning and design\n[\nin\n]\na multitude of fields including: linear programming and inequalities, goals and chance-constrained programming, geometric programming, infinite dimensional and convex programming, network modelling and analysis, fractional and interval programming, prediction and stochastic decision rules, and game theory.\nOne of his colleagues, Jim Deitrick, Professor of Accounting, gave this tribute, saying that Cooper was:-\n... a wonderful human being full of humility, helpfulness and kindness. He was a true friend. He always had time to stop in the hallway, ask what I was working on, offering advice and frequently attending my Advanced Accounting class where he told \"his story\" to my class. They were spell-bound about how a street thug from Chicago became a friend of Eric Kohler, attended night school, and went on to accomplish incredible things ... even induction in the Accounting Hall of Fame.\nStanley Zionts writes\n[\n22\n]\n:-\nIn his own words, Cooper once described his career in saying: \"We've tried everything to improve the human condition: religion, political systems, but the thing I think we need to rely on, where we've made the most progress anyway, is intelligence. And that's what universities do. They teach, and they develop new intelligence. This is the way I've spent my life, and it is the way I'd like to see the world continue.\" William W Cooper was a great, kind, and generous person. He contributed to society in many ways.\nLet us leave the final word to Cooper himself, said at the time of his\n96\nth\nbirthday\n[\n11\n]\n:-\nI don't want to die from a cold or pneumonia or anything, I want to die from living. That's the way I feel. My life revolves around work. I like solving problems, I like advancing knowledge, and I like helping people.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Logic",
    "Statistics"
  ]
}