{
  "nome_completo": "Willard Van Orman Quine",
  "nome_curto": "Willard Van Quine",
  "ano_nascimento": "1908",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Quine/",
  "lugar_nascimento": "Akron, Ohio, USA",
  "lugar_morte": "Boston, Massachusetts, USA",
  "biografia": "Willard Van Quine\n's father was Cloyd Robert Quine, an engineer who founded the Akron Equipment Company. His mother, Harriet Van Orman, was a teacher. Willard\n(\nor Van as he became known to his friends\n)\nwas the youngest son of the family. His interests at school were mainly scientific but from a young age he began to interest himself with philosophical questions. For example, the concepts of heaven and hell worried him when he was only nine years old. His older brother William gave him James's\nPragmatism\nbefore he had left school and the book fascinated him.\nAfter leaving school Quine studied at Oberlin College, Oberlin, Ohio, where his brother William had also studied. A fellow student suggested that he would find reading\nBertrand Russell\n's works interesting and indeed reading\nRussell\nand\nWhitehead\n's\nPrincipia Mathematica\nquickly convinced Quine that he should study mathematics as his major subject with the philosophy of mathematics as a secondary topic. O'Grady writes in\n[\n6\n]\n:-\nQuine's years at Oberlin were idyllic. His rooming house, full of kindred spirits was \"an ideal setting in which to wax articulate\". His appetite for cosmic understanding was sharpened by reading\nRussell\n.\nHe graduated from Oberlin College in\n1930\nand then won a scholarship to study for his doctorate at Harvard University. He married Naomi Clayton, whom he had known at Oberlin College, soon after arriving in Harvard. Quine completed his doctorate in two years supervised by\nAlfred North Whitehead\n. It was\nWhitehead\nwho introduced him to\nRussell\n, who was visiting Harvard to lecture there, and from that time Quine began a correspondence with\nRussell\n. Awarded a Ph.D. in philosophy from Harvard in\n1932\n, Quine described the following year, perhaps the most important for his future research, in a somewhat matter of fact way:-\nIn\n1932\n- I already had my PhD and was married to my first wife - I had a travelling fellowship. That was a great year. We used up our resources very accurately - I had $\n7\nwhen we got back to America. Then I came back to Harvard as a Junior Fellow in\n1933\n.\nIndeed it was \"a great year\" for Quine who made an exciting visit to Europe financed by a Sheldon Traveling Fellowship. In Vienna he met Philip\nFrank\n, Moritz Schlick and other members of the Vienna Circle of Logical Positivists. He also met the British philosopher A J Ayer and Kurt\nGödel\n.\nQuine spent six weeks in Warsaw with\nTarski\nbefore going on to study at Prague under Rudolf Carnap. Quine became, in his own words, \"an ardent disciple\" of Carnap discovering:-\n... what it was to be intellectually fired by a living teacher rather than by a dead book.\nAfter Quine returned to Harvard in\n1933\nto take up the Junior Fellowship he published his first book\nA System of Logistics\nwhich was the published version of his doctoral thesis. From this time up to the break in his career for war service Quine's research was mainly on logic although always with a philosophical motivation. One of the most important papers he published during this period was\nNew Foundations for Mathematical Logic\nin the\nAmerican Mathematical Monthly\nin\n1937\n. In this paper he presented his invention of the heterodox system of set theory, which is known as NF set theory after the title of the paper. Quine presented no model for this theory, nor did he prove that the system was consistent. This posed an awkward problem for mathematical logicians and led to quite a bit of interest.\nQuine was appointed onto the staff at Harvard in\n1936\nas an Instructor in Philosophy. He later wrote about his teaching at this stage in his career:-\nWhat I enjoyed most was more the mathematical end than the philosophical, because of it being less a matter of opinion. Clarifying, not defending. Resting on proof. I taught first in both departments, but my appointment was in the Philosophy Department. I taught Mathematical Logic and Set Theory as well as a general course of Logic in Philosophy. Harvard was good about letting me teach my own interests. I gave a course in Philosophy of my own choosing, my own ideas, for concentrators.\nThe year\n1940\nwas an exciting one for Quine at Harvard for in that year both Carnap and\nTarski\nvisited Harvard and the three debated logical positivism. Although Quine was a firm friend of Carnap the two took somewhat different stands on many philosophical issues which led to lively discussions and challenges.\nQuine was promoted to Associate Professor in\n1941\nbut shortly after, because of World War II, he undertook war service. From\n1942\nhe spent four years in the United States Navy Intelligence, first as a Lieutenant then as a Lieutenant Commander, decrypting messages from German submarines off the coast. He later wrote of this work decrypting messages:-\nThe Germans had a replica Enigma breaking complicated ciphers. Each day they had a different setting on the machine. We had to get it the hard way, by intercepting a message from a submarine that gave direction finders. We would know, say, from the preceding day's message he had been sent on a refuelling rendezvous, so a good guess was that some word would be 'refuelling.' Then if our men could fit the word, they could get the setting for the whole.\nIn\n1945\nQuine and his wife, having had two daughters, separated and they were divorced two years later. He returned to Harvard where he was promoted to Professor in\n1948\n. He married again in\n1948\n, his second wife being Marjorie Boynton whom he met while serving in the Navy. Quine and his second wife had two children, a daughter and a son. The son, Douglas B Quine, has written an obituary of his father. During\n1953\n-\n54\nQuine was Eastman Visiting Professor at Oxford and during that time he published a book\nFrom a Logical Point of View\nwhich was a collection of his earlier articles. One article in this work\nTwo Dogmas of Empiricism\n, which he had first published in\n1951\n, was the one which made his reputation as a leading philosopher. This article\n[\n6\n]\n:-\n... challenged received notions of knowledge, meaning and truth, and exceeded even the extreme empiricism of logical positivism by arguing that logic and mathematics, like factual statements, are open to revision in the light of experience.\nIn the article Quine argued that it was:-\n... folly to seek a boundary between synthetic statements, which hold contingently on experience, and analytic statements, which hold come what may.\nHe argued against the dogma of reductionism, or:-\n... the belief that each meaningful statement is equivalent to some logical construct upon terms which refer to immediate experience.\nQuine claimed:-\nAny statement can be held true come what may, if we make drastic enough adjustments elsewhere in the system\n[\nof our beliefs\n]\n. The totality of our so-called knowledge or beliefs, from the most casual matters of geography and history to the profoundest laws of atomic physics or even of pure mathematics and logic, is a man-made fabric which impinges on experience only along the edges.\nQuine became Edgar Pierce Professor of Philosophy at Harvard in\n1956\n, a post he retained until he retired in\n1978\n. He continued as Edgar Pierce Professor Emeritus at Harvard, commuting daily to his corner office in Emerson Hall, for many years after he retired. His passion for travelling continued after his retirement and throughout his life he visited\n118\ncountries.\nWe have commented above about Quine's work in mathematical logic. Symbolic logic represented for him the framework for the language of science. He modestly said:-\nI do not do anything with computers, although one of my little results in mathematical logic has become a tool of the computer theory, the Quine McCluskey principle. And corresponds to terminals in series, or to those in parallel, so that if you simplify mathematical logical steps, you have simplified your wiring. I arrived at it not from an interest in computers, but as a pedagogical device, a slick way of introducing that way of teaching mathematical logic.\nQuine developed a new type of philosophy, which he called\nnaturalized epistemology\n. He claimed that epistemology's only legitimate role is to describe the way knowledge is actually obtained so, according to Quine, its function is to describe how present science arrives at the beliefs accepted by the scientific community.\nAmong Quine's publications are works on logic,\nmetaphysics\n, the philosophy of language, and the philosophy of logic. His\n22\nbooks include\nA System of Logistic\n(1934)\n,\nMathematical Logic\n(1940)\n,\nElementary Logic\n(1941)\n,\nOn What There Is\n(1948)\n,\nFrom a Logical Point of View\n(1953)\n,\nWord and Object\n(1960)\n,\nSet Theory and Its Logic\n(1963)\n,\nPhilosophy of Logic\n(1970)\n,\nThe Time of My Life: an autobiography\n(1985)\n,\nQuiddities\n(1990)\n, and\nFrom Stimulus to Science\n(1995)\n.\nQuine won many prizes and medals for his outstanding contributions. These included the Murray Butler gold medal\n(1965)\n, the F Polacky gold medal in Prague\n(1991)\n, the Charles University gold medal in Prague\n(1993)\n, the Rolf Schock Prize in Stockholm\n(1993)\n, and the Kyoto Prize in Tokyo\n(1996)\n. The Kyoto Prize for\nCreative Arts and Moral Sciences\nfocused on the field of philosophy and made the award to Quine as one of America's pre-eminent\n20\nth\ncentury philosophers. Indeed, as stated in\n[\n2\n]\n:-\nHe must have collected far more prizes and honorary degrees than any other contemporary philosopher or than almost any other academic; but what he most rejoiced in collecting were the countries that he had visited. He was immensely vain about their number, and vain, too, about his ability to speak a number of languages. He liked etymology and unusual facts about words. His writing was distinguished by a feeling for words and an often witty use of them. His political opinions were on the Right, but he was tactful in not voicing them in the presence of people he knew to be of a different inclination.\nHis achievements were summarised as:-\nWe may therefore say that the many theses and arguments of Dr Willard Van Orman Quine have become the centre of debate for modern epistemology and ontology as well as philosophy of language and philosophy of science in general. He has created a profound, powerful influence without which it would not be possible to understand the current state of philosophy.\nThe University of Lille, Oxford University, Cambridge University, Uppsala University, the University of Bern, and Harvard University were among the eighteen universities awarding him an honorary degree. He was elected to fellowships of many learned societies including the\nAmerican Academy of Arts and Sciences\n(1949)\n, the British Academy\n(1959)\n, the Instituto Brasileiro de Filosophia\n(1963)\n, the\nNational Academy of Sciences\n(1977)\n, the Institut de France\n(1978)\n, and the\nNorwegian Academy of Sciences\n(1979)\n.\nA little of his character is shown by some entertaining episodes. All his books were typed on the\n1927\nRemington typewriter, on which he wrote his doctoral thesis, which he had modified by including some mathematical symbols instead of characters such as !, ?, and\n1\n. When once he was asked how he managed without a question mark he replied:-\nWell, you see, I deal in certainties.\nHe gave this picture of himself in his book\nThe Time of My Life\n:-\nI am orderly and I am frugal. For the most part my only emotion is impatience, I am deeply moved by occasional passages of poetry, and so, characteristically, I read little of it.\nOutside philosophy and mathematics Quine loved music, especially Dixieland jazz, Mexican folksongs, and Gilbert and Sullivan. He enjoyed playing the piano and he played banjo in several jazz groups.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}