{
  "nome_completo": "William Braikenridge",
  "nome_curto": "William Braikenridge",
  "ano_nascimento": "1700",
  "ano_morte": "1762",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Braikenridge/",
  "lugar_nascimento": null,
  "lugar_morte": "London, England",
  "biografia": "William Braikenridge\n's father was John Braikenridge of Glasgow. William Braikenridge taught mathematics in Edinburgh in the\n1720\ns.\nBraikenridge is best known for his geometrical theorems, in particular he discovered the following theorem now called the Braikenridge-\nMaclaurin\ntheorem:-\nIf the sides of a polygon are restricted so that they pass through fixed points and all the vertices except one lie on fixed straight lines, the free vertex will describe a\nconic\nor a straight line.\nThis result may be regarded as a converse of\nPascal\n's theorem that if the vertices of a hexagon lie on a conic, then the meets of opposite sides are collinear. The theorem may be used as a construction of the conic through five given points.\nSee\nthe diagram\n.\nThe Braikenridge-\nMaclaurin\ntheorem appeared in\nExercitatio geometrica de descriptione linearum curvarum\nⓉ\n(\nGeometric exercise on the description of curved lines\n)\npublished in\n1733\nbut there followed a dispute regarding priority with\nMaclaurin\n. Braikenridge claimed to have discovered the theorem, and many other results, in\n1726\nwhen he was living in Edinburgh and that\nMaclaurin\nhad learnt of them. An argument followed and the correspondence is preserved, see\n[\n2\n]\nwhere the letters are given and\n[\n4\n]\nfor a discussion of the argument.\nThis was a rather sad affair and one has to feel sorry for both Braikenridge and\nMaclaurin\nbut it is an affair that is worth expanding on since in many ways this is the main way in which Braikenridge enters the history of mathematics. The preface of Braikenridge's\nExercitatio geometrica\nwhich was published in\n1733\ncontained the following account of his interaction with\nMaclaurin\n:-\nIn the year\n1727\n, during a three months stay in London I shared these thoughts with the celebrated gentleman\nJ Craig\n, a very expert mathematician. After a few days it happened that I visited\nColin Maclaurin\n, Edinburgh Professor, who at that time was visiting London, who recalled his conversation with\nCraig\nwho had described my theorems, and\n[\nMaclaurin\n]\nsaid moreover that he had discovered similar ones and he showed me manuscripts which he said contained his own discoveries; but I am ignorant of the method he used for he did not entrust the manuscript to my hands, nor was I allowed to glance over it.\nIn a letter which\nMaclaurin\nwrote to\nJohn Machin\non\n15\nNovember\n1732\n, he gave his version of events\n(\nsee for example letter\n138\nin\n[\n2\n]\n)\n:-\n[\nBraikenridge\n]\ntaught mathematics here\n[\nin Edinburgh\n]\nprivately for some years, and some time ago\n(\nviz.\n1727)\nmentioned to me some theorems he had on that subject, which at the same time I showed him in my papers. Some time before that, he showed me a theorem, which coincided with one in my book, though he seemed not to have observed that coincidence. Coincidence: and indeed methods of this kind are often found coincident, that do not appear such at first sight. ... I find it is fit that I should take precautions, lest any forward person should take it in his head afterwards to say that I take these things from him, which I may have had long before him. And, therefore I shall send you an abstract of what I have done in relation to this matter, since the year\n1719\n.\nThere then follows a fairly detailed description by\nMaclaurin\nof his results. Near the end of his letter to Machin,\nMaclaurin\nwrote:-\nThe author of the papers\n[\ni.e. Braikenridge\n]\ngiven in to the\nRoyal Society\nwill not refuse, that I showed him the theorems I now send you, in\n1727\n. He owned\n[\nup to\n]\nit last summer at least.\nMaclaurin\ndid not dispute the fact that Braikenridge had published first; what did annoy him was the fact that he had been teaching courses at Edinburgh since\n1725\nwhich had contained these results yet he felt that Braikenridge was suggesting that he\n[\nMaclaurin\n]\nhad not known of the results since he had not published them.\nMaclaurin\nasked for his\n15\nNovember\n1732\nletter to\nMachin\nto be published, and it appeared in December\n1735\nin the\nPhilosophical Transactions of the Royal Society\n. On\n15\nJanuary\n1737\n, Braikenridge, who had seen the published version of\nMaclaurin\n's letter to\nMachin\n, wrote to\nMaclaurin\n(\nsee for example letter\n149\nof\n[\n2\n]\n)\n:-\n... there are some people who pretend to be your friends represent you in a very odd light as if you was so unfair as to say that I took the theorems from you that I published in the \"Exercitatio geometrica\" which you know very well that I do not.\nAfter quoting from his own Latin Preface to the\nExercitatio geometrica\nof which we gave an English translation above, Braikenridge continues:-\nAfter this account therefore you may be sure I never can deny that you showed me the paper in which your theorems were, neither can you deny that you never let me have the manuscript into my hand. And therefore as I have made so fair a declaration to your honour by giving my reader to understand that you had the like theorems; I hope you will likewise say what is true with regard to mine.\nAll this seems such an unfortunate misunderstanding and we have no reason to believe that either mathematician stole theorems from the other, both clearly discovering similar results independently. However, Braikenridge does then go on to attack\nMaclaurin\n's letter to\nMachin\nmore violently. In particular he attacks\nMaclaurin\n's sentence \"The author of the papers ... will not refuse, that I showed him the theorems ... in\n1727\n\" saying this suggests that:-\n... either you let me read over your manuscript or that I had borrowed it from you or that you let me read some of your demonstrations, or at least that you let me see something in it that I did not know before ...\nBraikenridge attacks even more vigorously\nMaclaurin\n's apparently innocent comment that Braikenridge taught mathematics in Edinburgh privately for some years:-\nIf this was only meant as a piece of innocent history to show that you were at that time in a more exalted position than I was, this is very well and I have nothing to say. But if as your friends here say you did it to insinuate the second-hand way by which I might possibly have taken your theorems from you, this deserves a more severe reflection than at present I think proper to make.\nBraikenridge then says that indeed he did get some of the ideas from reading the work of others but that it was not\nMaclaurin\n's work, but rather it was the work of de\nla Hire\nthat inspired him.\nMaclaurin\ncomposed a long letter in reply to Braikenridge, then decided not to send it. Rather he sent a short letter requesting that the correspondence come to an end:-\n... after reflecting on your scurrilous manner of writing to me who never gave you any ground for such unaccountable usage, I cannot help desiring that your correspondence and mine be at an end.\nOther works published by Braikenridge in the\nPhilosophical Transactions of the Royal Society\ninclude\nA general method of describing curves, by the intersection of right lines, moving about points in a given plane\n. Also\nConcerning the method of constructing a table for the probabilities of life in London\n, a work involving\nprobability\nand statistics, as did two other works\nConcerning the number of people in England\nand\nConcerning the present increase of the people in Britain and Ireland\n. A further work on geometry was\nSections of a solid hitherto not considered by geometers\n.\nBraikenridge gained an Honorary MA from Marischal College, Aberdeen in\n1735\n, and a DD in\n1739\nwhile he was vicar of New Church, Isle of Wight. He was incorporated at The Queen's College, Oxford, in\n1741\nand he became rector of St Michael Bassishaw, and from\n1745\nlibrarian of Sion College, in London.\nIn\n[\n1\n]\nhe is described as follows:-\nBraikenridge was a noted theologian and for many years he was rector of St Michael's Bassishaw, London. On\n6\nFebruary\n1752\nhe was elected fellow of the Royal Society of Antiquarians and on\n9\nNovember of the same year he became a Fellow of the\nRoyal Society\n.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Statistics"
  ]
}