{
  "nome_completo": "William Ogilvy Kermack",
  "nome_curto": "William Kermack",
  "ano_nascimento": "1898",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kermack/",
  "lugar_nascimento": "Kirriemuir, Angus, Scotland",
  "lugar_morte": "Aberdeen, Scotland",
  "biografia": "William Ogilvy Kermack\nwas the son of William Kermack\n(1868\n-\n1934)\nand Helen Eassie Ogilvy\n(1865\n-\n1904)\n. William Kermack Sr was a postman in Kirriemuir and he married Helen Ogilvy in Kirriemuir in\n1897\n. They lived at\n36\nSouth Street, Southmuir, Kirriemuir. Their only child, William Ogilvy Kermack, the subject of this biography, was born in\n1898\nbut, sadly, \"Helen Eassie Ogilvy or Kermack\" appears in the records of the Dundee Royal Lunatic Asylum from\n1898\nto\n1901\n. William Ogilvy Kermack was brought up mainly by his father's sister Margaret Osler Kermack\n(1857\n-\n1933)\n. Margaret Kermack had been a linen weaver before she married David Marnie\n(1854\n-\n1932)\n, a blacksmith, in\n1878\n. They had four children Susan\n(\nborn\n1879)\n, Eliza\n(\nborn\n1880)\n, John\n(\nborn\n1884)\nand William\n(\nborn\n1889)\n.\nWilliam Kermack, the subject of this biography, attended Southmuir Primary School from the age of\n5\n, and continued to study at Webster's Seminary in Kirriemuir; in fact Southmuir Primary was part of Webster's Seminary. He gave the following details about his schooling which we quote from\n[\n4\n]\n:-\nMathematical instruction was given chiefly by the headmaster, Thomas Pullar, whose thoroughness I learnt to appreciate. He took me as far as coordinate geometry and geometrical conic sections as well as elementary dynamics, hydrostatics, etc. Physics and chemistry were taught by Pullar and others including G K Sutherland afterwards, I believe, of Southampton University College who was most inspiring in his teaching of what would now be called general science, and a somewhat eccentric Mr Tinto who failed to keep good discipline but introduced me to non-Euclidian geometry about\n1913\nby lending me a small book called 'Theories of parallelism' which I read with great interest. The chief and most lasting influence amongst teachers, however, was Mr C H Moore who combined a gift for teaching with a fine intellect, a broad tolerance and an idealistic outlook on life and affairs. Through his teaching of English, he encouraged us to think and introduced us to a wide range of ideas, artistic, ethical, political and social.\nAfter sitting the Aberdeen Bursary Competition, Kermack began his studies at Aberdeen University in\n1914\n. He was taught by William Soddy\n(1877\n-\n1956)\nwho had worked with Ernest Rutherford on radioactivity before being appointed to the chair in Aberdeen in\n1914\n. Kermack attended Soddy's course on radioactivity but found him \"a somewhat remote personality.\" He found the mathematics courses by John Hilton Grace\n(1873\n-\n1958)\nand the statistics courses by James Fowler Tocher\n(1964\n-\n1945)\nmuch more interesting and exciting. John Grace had studied at Peterhouse, Cambridge where he was bracketed Second Wrangler with\nEdmund Whittaker\n, the Senior Wrangler being\nThomas l'Anson Bromwich\n. He only taught at Aberdeen during the latter years of World War I, deputising for\nHector Macdonald\nwas doing war service in London attached to the Ministry of Munitions. James Tocher was a pharmaceutical and analytical chemist who became interested in statistics and was encouraged by\nKarl Pearson\n. He was a lecturer in statistics at Aberdeen from\n1911\n. Kermack's\n[\n4\n]\n:-\n... first experience of serious scientific work was in the period April to June\n1918\nwhen he assisted Dr Tocher in a statistical analysis of the milk yields of dairy cattle. 'This', he stated later, 'introduced me to \"Biometrika\" and to the work of\nK Pearson\nand \"Student\"\n[\nWilliam Gosset\n]\nand I was also much impressed by Tocher's own genial and versatile personality.'\nKermack was awarded the Lyon Prize for the most distinguished Arts graduate in\n1917\n-\n1918\n, the Simpson Mathematical Prize\n(1918)\n, the Greig Prize in Physics\n(1918)\n, and the David Rennet Medal\n(1918)\n. He graduated in\n1918\nwith both an M.A. with First Class Honours in mathematics and physics, and a B.Sc. with distinction in mathematics, physics, and chemistry. He competed for the prestigious Ferguson Scholarship in Mathematics in\n1919\nwhich he won in competition with students from all four Scottish universities.\nBefore continuing with his academic studies, Kermack spent six months undertaking military service with the R.A.F. as an aircraftman\n2\nnd class, the lowest rank known colloquially as \"AC plonk.\" He was stationed at the Royal Air Force Station Martlesham Heath, the home of the Aeroplane Experimental Unit, near Woodbridge in Suffolk. After completing military service, in April\n1919\nhe went to work under William Henry Perkin\n(1860\n-\n1929)\n, the Waynflete Professor of Chemistry at Oxford. Perkin was head of the Dyson Perrins Laboratory, where research was carried out into organic chemistry, which had begun operating in\n1916\n. Kermack worked with a group which was part of the British Dyestuffs Corporation but he also assisted other researchers at the Laboratory and published a number of papers in collaboration with various colleagues such as William Perkin, the expert on plant dyestuffs and alkaloids Robert Robinson, and the bacteriologist Hedley D Wright. Some of the papers study the alkaloids harmine and harmaline while others study the colloidal gum benzoin. These topics would be major lines of research throughout Kermack's career.\nIn February\n1921\nKermack left Oxford and moved to Scotland where he was appointed as head of the Chemical Section of the Royal College of Physicians Laboratory in Edinburgh. In Edinburgh, Kermack continued to work in the areas he had begun in the Dyson Perrins Laboratory, continuing his study of harmine and of colloids. His life changed dramatically on the evening of Monday\n2\nJune\n1924\n, however, when he was undertaking experiments in his laboratory. The chemicals with which he was experimenting exploded throwing caustic alkali into his eyes. He spent the following two months in hospital but they were unable to save his vision and he left hospital completely blind. This forced him to completely change the direction of his career. He was unable to undertake any experimental work so he realised that from then on his contributions would have to be purely theoretical.\nBefore Kermack had his accident he had met Elizabeth Raimunda Blazquez and they had begun to think of marriage. Elizabeth was a great support to Kermack in helping and encouraging him so we should say a little about her background. She was the daughter of Raimundo Ulpiano Pancraso Blazquez\n(1863\n-\n1909)\n. Raimundo had been born in Aguilas, Murcia, Spain and, at the age of\n18\n, had come to Edinburgh, Scotland, to manage the Edinburgh end of the Esparto export business. In the census he gave his occupation as quarry master. He had three children with Margaret Ann Bracken, the niece of his housekeeper Elisabeth Bracken, but Margaret died in\n1886\nduring the birth of their third child. Raimundo then married Elizabeth McEwen\n(1866\n-\n1926)\n, known as Bessie, on\n14\nJanuary\n1889\nin Newington, Edinburgh. Elizabeth McEwen was the daughter of the sculptor Thomas McEwen and his wife Grace Veitch\n(1828\n-\n1911)\n. Raimundo and Elizabeth had the following children born in Edinburgh: Andres Blasquez\n(\nborn\n1890)\n, Angela Innocenca Blasquez\n(\nborn\n1892)\n, Raimunda Bessie Blasquez\n(\nborn\n1893)\n, Thomas McEwen Blasquez\n(\nborn\n1894)\n, and Elizabeth Blasquez\n(\nborn\n1895)\nwho became Kermack's wife. Note that we have given two different spellings, namely Blazquez and Blasquez. Both appear on official documents but these may result from incorrectly reading handwriting. The family returned to Spain eleven months after Elizabeth's birth where several further children were born, but Elizabeth was left behind in Edinburgh with her Scottish grandmother and her two maiden aunts who brought her up. In\n1925\nshe married Kermack in Currie, Edinburgh. On her birth certificate her name is Elizabeth Blasquez but on her marriage certificate it is Esabeletta Raimunda Blazquez. As an added complication, some other sources give her name as Elsábeletta. William and Elizabeth Kermack had one son, Derek Ogilvy Kermack, born\n29\nDecember\n1926\n.\nAll of Kermack's colleagues made strenuous efforts to enable him to return to a satisfactory working pattern\n[\n4\n]\n:-\nAs the result of the accident, the pattern of Kermack's life was of necessity changed but not so greatly as his friends might have feared. He was, of course, unable to engage in active experimental work at the bench, but with his acute critical mind and exceedingly retentive memory he was able to collaborate very effectively with senior colleagues in a variety of research projects and to supervise the activities of a long series of research students who were working for the Ph.D. degree of the University of Edinburgh. For the next\n25\nyears Kermack led a pattern of life which followed a regular and active routine. He lived within reasonable distance of the Laboratory by public transport and soon became well known to drivers and conductors. His colleagues and research students engaged in lively discussion with him and read extensively to him from the journals. His most immediate associate was his research assistant Walter T Spragg who worked with him for many years.\nHe continued undertaking research collaborations on colloids and organic chemistry but he soon became interested in both mathematical and statistical applications to biochemistry. Partly this came about because of his love of mathematics and his feeling that being blind was not such a handicap for undertaking research in that subject. It was also, however, a result of his collaboration with Anderson Gray McKendrick who had been appointed superintendent of the laboratory of the Royal College of Physicians of Edinburgh in\n1920\n. Kermack and McKendrick began developing mathematical models for epidemics, publishing the paper\nA Contribution to the Mathematical Theory of Epidemics\nin the\nProceedings\nof the\nRoyal Society of London\nin\n1927\n. This was the first of a series of five papers these authors wrote with essentially this title, the fifth being in\n1939\n.\nFor extracts from the Introductions, and the Summaries of these five papers, see\nTHIS LINK\n.\nNot only did Kermack apply mathematics and statistics to problems in biochemistry but he also became involved in collaborative research with colleagues in the Mathematics Department at the University of Edinburgh. He often attended\nEdmund Whittaker\n's research seminars and in one of these, in the autumn of\n1930\n, Whittaker put forward a conjecture he had made on the solution of certain differential equations by definite integrals.\nWilliam Hunter McCrea\nwrites\n[\n4\n]\n:-\nThe theorem may be regarded as a greatly generalised\nLaplace\ntransformation, and it covers all the well-known integral relations in the theory of special functions. It was a brilliant conjecture of\nWhittaker\n's, but for his part he contented himself with a number of interesting illustrations. He did not attempt to formulate a general statement nor to give a proof. Kermack saw immediately that\nWhittaker\n's ideas required in the first place an algebra of operators of a novel sort. Within a day or two he sketched out his thoughts to me and we proceeded together to develop them in four papers published soon afterwards ...\nThese four joint Kermack-\nMcCrea\npapers were:\nAn operational method for the solution of linear partial differential equations\n(1930\n-\n31)\n,\nOn Professor Whittaker's solution of differential equations by definite integrals. Part I\n(1931)\n,\nOn Professor Whittaker's solution of differential equations by definite integrals. Part II. Applications of the methods of non-commutative algebra\n(1931)\n, and\nOn compatible differential equations and the orthogonal properties of their solutions\n(1933)\n.\nIn\n[\n2\n]\nSeverino Collier Coutinho makes a deep examination of these remarkable papers eighty years after they were written. Here is an extract from\n[\n2\n]\n:-\nIn a research lecture that too place in the autumn of\n1930\nat the University of Edinburgh,\nE T Whittaker\npresented a new method he had devised for computing certain definite integrals. The method was based on the use of contact transformations, a subject dear to\nWhittaker\n, who wrote its first presentation in English in a chapter of his book 'Analytical Dynamics'. However,\nWhittaker\n's proof of his theorem proved to be faulty, and this prompted two of his auditors to attempt to provide a correct proof. The team consisted of a chemist\n(\nKermack\n)\nand a physicist\n(\nMcCrea\n)\n, both of whom worked in Edinburgh at the time. Their solution made use of the newly invented algebra of quantum mechanics, which turns out to be the noncommutative algebra generated by the operators that describe position and momentum in quantum dynamics. As part of their attempt they uncovered a number of concepts and results that are now part of algebraic analysis: the study of linear partial differential equations from the algebro-geometric point of view. Amongst these results, one finds several tools of the theory of micro-differential operators, such as:\n(\ni\n)\nthe existence of 'quantized contact transformations' associated to a given contact\n(\ncanonical\n)\ntransformation;\n(\nii\n)\nthe fact that some of these transformations can be given as conjugation by appropriate invertible operators;\n(\niii\n)\nthe relation between the solutions of two differential equations that are connected by a quantized contact transformation.\nThese results are presented in the papers Kermack and\nMcCrea\n(1931\na,b\n)\n, which were written in what was by then a very unrigorous language. No hypotheses are made concerning the convergence of any of the series that come up in the paper, a problem that is compounded by the difficulties inherent in defining convergent series of noncommuting operators. Although the authors make clear that they are aware of at least some of these problems, they always assume that their results hold as long as the required hypotheses are satisfied. That such hypotheses actually exist one has to take on trust, for they are never investigated.\nAround this time Kermack also published a joint paper with\nE T Whittaker\nand\nW H McCrea\n,\nOn properties of null geodesics and their application to the theory of radiation\n(1932\n-\n33)\n, and a joint paper with\nW H McCrea\n,\nOn Milne's theory of world structure\n(1933)\n.\nThe\nEdinburgh Mathematical Society\nheld their St Andrews Mathematical Colloquium in St Andrews from\n4\nto\n15\nJuly\n1938\n. Kermack was one of the invited main speakers delivering the course of lectures\nMathematics of Population Growth\n. He gave the following summary of the topics in the course: The Malthusian parameter: concept of present values: integral equations of the\nVolterra\nand\nFredholm\ntypes. Mathematical Epidemiology. Deduction of the integral equations: the steady state: threshold values: stability problems. Statistics and Biology. The problem of sampling: method of inverse probability: method of fiduciary probability: other methods: the general nature of scientific knowledge. In\n[\n3\n]\nthere is a report on the Colloquium by\nIvor M H Etherington\nwho writes:-\nDr W O Kermack discussed the integral equations which arise in the mathematics of population growth and of epidemiology. ... It was impossible not to admire Dr Kermack's masterful exposition of his complicated subject matter, aided by lantern slides displaying his formulae but without the gift of sight.\nIn\n1949\nKermack left Edinburgh and moved to Aberdeen when he accepted the appointment as the first MacLeod-Smith professor of biological chemistry at the University of Aberdeen\n[\n8\n]\n:-\nHe built up a department noted for the quality of its teaching and the breadth of its research interests. Active in committee work, he was dean of science from\n1961\nto\n1964\n, and from\n1949\nto\n1969\nan effective governor of the Macaulay Institute for Soil Research and the Rowett Research Institute for Animal Nutrition.\nJames Norman Davidson writes in\n[\n4\n]\n:-\nIn Edinburgh Kermack had led a relatively sheltered life, but when he went to Aberdeen he had to face new and perhaps rather daunting situations. After\n25\nyears of virtually full-time research with no experience whatever of teaching or examining undergraduates, he had to lecture to large classes of boisterous students. After supervising the work of two or three research students at a time and a couple of research assistants, he had to build up, and then administer, a new department, arrange for the purchasing of equipment and organise structural alterations in a building which was peculiarly unadaptable. Above all, he had to work with new and perhaps initially rather prejudiced senior colleagues. It was inevitable that he should demand of his staff more than an ordinary professor would expect, for there were so many things that he could not do unaided. He had to be read to and taken from place to place, but his warm personality, his real interest in the welfare of others and his exceptional intellectual ability made a deep impression of his staff, many of whom became devoted to his interests. ...\nIn adapting himself to the new situation in Aberdeen, Kermack found his wife a tower of strength. She looked after him devotedly, read to him in the evenings and at weekends, and travelled with him to meetings. Without her constant help, he would have found life very difficult indeed.\nDavidson describes Kermack's method of working\n[\n4\n]\n:-\nHis daily routine in Aberdeen followed the same pattern as in Edinburgh. He was always in his department by nine o'clock and began the day by having his correspondence read to him by his secretary. When he had dictated the necessary replies, he spent some time with his research students discussing results and planning experiments. His next step was to keep abreast of the literature by having selected papers from current journals read to him by his secretary or one of the junior technicians or one of the research students. He grasped the essential ideas of these papers very quickly and would subsequently discuss them critically with other members of the department. He was escorted to lunch in the Senior Common Room each weekday by a member of staff whose duty it was subsequently to take him back to his office and there read scientific journals to him.\nThe authors of\n[9]\nwrite:-\nHe was keenly interested in debate on religion and politics, being a humanist and rationalist in the former and a leftist in the latter, although a trip to Moscow in\n1961\nto attend the Fifth International Congress of Biochemistry modified his views somewhat.\nHe retired from his chair in Aberdeen in\n1968\nbut remained at the University of Aberdeen continuing to work at his desk almost every day. Given his remarkable range of contributions it is perhaps not too surprising that, after he retired he took a computer science course. Sadly he did not have long in retirement since he died at his desk in the University two years later.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}