{
  "nome_completo": "William Wallace",
  "nome_curto": "William Wallace",
  "ano_nascimento": "1768",
  "ano_morte": "1843",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wallace/",
  "lugar_nascimento": "Dysart, Fife, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "William Wallace\n's parents were Janet Simson and Alexander Wallace who was a leather manufacturer. Alexander taught his son William basic arithmetic but William had no formal schooling after the age of eleven. He was brought up in Dysart until he was\n16\nyears old, working there as an apprentice bookbinder, then in\n1784\nhis family moved to Edinburgh. There he taught himself mathematics, earning his living working for a bookseller and also tutoring mathematics privately. Although he was not a student, Wallace did attend mathematics classes at Edinburgh University and both Robison and\nPlayfair\nencouraged the young man whom they realised had very considerable mathematical talents.\nWallace became a mathematics teacher at Perth Academy in\n1794\nand he married in the same year; the marriage produced three daughters and a son. At this time Wallace began to publish mathematics and his first paper appeared in the\nProceedings of the Royal Society of Edinburgh\nin\n1796\n. He also began writing articles for\nEncyclopaedia Britannica\nwith the first on\nPorisms\nappearing in\n1801\n. A further paper submitted to the\nRoyal Society of Edinburgh\nin\n1802\nmade it clear that this school teacher of mathematics had an outstanding research talent\n(\nalthough it later transpired that\nLegendre\nhad discovered the results six years earlier\n)\n.\nPlayfair\nadvised Wallace to apply for the post of professor at the Royal Military College at Great Marlow which became vacant in\n1803\n, and one year after he was appointed there he was joined by\nIvory\n. Thomas Leybourn's\nMathematical Repository\nwas produced by the staff at the Royal Military College and Wallace soon joined in contributing articles. He was also approached to write further articles for\nEncyclopaedia Britannica\nand for the\nEdinburgh Encyclopaedia\nwhile, in addition, he set about writing textbooks for his students at the Military College.\nThen, in\n1819\n, he was appointed professor of mathematics at Edinburgh University.\nLeslie\nhad been the professor of mathematics at Edinburgh since\n1805\n, but he resigned the chair when appointed to the more prestigious post of professor of natural philosophy. Candidates for the vacant chair included Wallace,\nHaldane\n(\nwho was professor at St Andrews\n)\nand\nCharles Babbage\n. The Edinburgh chair was considered to be the leading mathematics chair for a Scot to hold, and certainly the Englishman\nBabbage\nwas not seriously considered although he was supported by\nIvory\n. Wallace was supported by\nLeslie\n, the previous occupant of the chair, while\nHaldane\nhad been successful in obtaining the St Andrews chair on political grounds in preference to considerably more talented mathematicians\n(\nincluding Wallace and\nIvory\n)\nand hoped to repeat the same success again.\nWallace had an impressive collection of testimonials including ones written by\nPlayfair\n,\nDugald Stewart\n,\nMaskelyne\n,\nCharles Hutton\n,\nWilliam Herschel\nand\nMaseres\n.\nLeslie\nalso wrote a letter of support. In a straight vote between Wallace and\nHaldane\n, Wallace was appointed by\n18\nvotes to\n10\n. He soon made an impact on the teaching at Edinburgh, deciding to change from using\nLeslie\n's book to teach instead from\nPlayfair\n's edition of\nEuclid\n's\nElements\n. This really annoyed\nLeslie\nwho now regretted that he had supported Wallace over\nHaldane\nand even regretted resigning the mathematics chair himself.\nCarlyle\nwrote in a letter to a friend\n(\nsee for example\n[\n3\n]\n)\n:-\nWallace, whom I went this day to see, is a person of about fifty years old - short, bald-headed with a grim and intelligent countenance. his manner is blunt; he speaks with a scotch accent, - and if his unaffected and patient demeanour is accompanied with a display of philosophical reflection - which I cannot assert or deny - he ought surely to be a great favourite with the public.\nLeslie\nand he are said to be on the eve of battle - for the \"Elements of Geometry\" and curves of the second order are to be discarded for\nPlayfair\n's\nEuclid\n! Love me, love my dog - the saw says; still more should it say: love me, love my book. Science, you see, was well as religion, is at times disturbed by the feuds of its professors. What have we to say but wish these worthies a fair field and no favour?\nWallace's work was on geometry and\nSimson\n's line\n(\nwhich is definitely not due to\nSimson\n!\n)\nappears first in a paper of Wallace in\n1799\n.\nSee\nTHIS LINK\n.\nOne of Wallace's theorems:-\n... if\n4\nlines intersect each other to form\n4\ntriangles\n(\nomit one line in turn\n)\nthen the circumcircles of the triangles have a point in common ...\nwas generalised to\n2\nn\n2n\n2\nn\nlines by\nClifford\n.\nPerhaps his most significant contribution, however, was the fact that he advocated the Continental approach to the calculus and was one of the first in Britain to do so. In his article\nFluxions\nwhich appeared in\nEncyclopaedia Britannica\nin\n1810\nhe shows his intentions in the preface\n(\nsee for example\n[\n4\n]\n)\n:-\n... in explaining the foundations of the method, we have endeavoured to show that it rests upon purely analytical, namely the theory of limiting ratios, and this being the case, the subject may be treated as a branch of pure mathematics, without having occasion to introduce any ideas foreign to geometry ...\nIn this\nEncyclopaedia Britannica\narticle Wallace uses\nNewton\n's notation, but in his article\nFluxions\nfor the\nEdinburgh Encyclopaedia\nwhich was published in\n1815\nhe used\nLeibniz\n's differential notation and was therefore the first to write an English treatise on the calculus using differential notation. In\n[\n10\n]\nPanteki discusses a letter written by Wallace to\nPeacock\nin\n1833\nin which he points out his contributions in introducing the differential notation in Britain which\nPeacock\nseems to have chosen to ignore.\nPeacock\nwas keen to claim that the introduction of differential notation in Britain was due to Cambridge mathematicians, especially the Analytical Society.\nWallace also invented the pantograph, an instrument for duplicating a geometric shape at a reduced or enlarged scale. In addition to mathematical articles, he wrote articles on astronomy which he published in the\nTransactions of the Royal Astronomical Society\n.\nIn\n[\n12\n]\nit is said that:-\nHe took an active interest in the erection of the Observatory on the Calton Hill and the monument to\nNapier\n.  As a Professor, Wallace was regarded as an able teacher, he was popular alike with pupils and colleagues. In recognition of his services to learning and to the University, he was made an honorary Doctor of Laws.\nWallace retired from his chair at Edinburgh in\n1838\ndue to ill health. He had held the chair for almost\n20\nyears but these had not proved one in which he produced much in the way of original research. Indeed his health had broken down in\n1835\nand for his last three years in the chair at Edinburgh he did not even teach. In May\n1835\nhe had written to written to the Lord Chancellor requesting a pension and giving his own assessment of his achievements. After his retirement, however, his health improved markedly as he reported in a letter written in\n1839\n(\nsee for example\n[\n4\n]\n)\n:-\n... after more than three years seclusion, confined a great part of the time to my bed, i have appeared again ... on the stage of human existence. Though unable to walk, and almost to stand, I never ceased to think\n[\nand write books on geometry and conic sections\n]\n. ... My recovery is quite a phenomenon here. ... I this day accompanied by Mr Kelland my success in the Professorship of Mathematics here ascended Arthurs seat which is upwards of\n800\nfeet high ...\nHe published two books after he retired,\nA Geometrical Treatise on the Conic Sections with an Appendix Containing Formulae for their Quadrature\n(1838)\nand\nGeometrical Theorems and Analytical Formulae with their application to the Solution of Certain Geodetical Problems and an Appendix\n(1839)\n. He also published four further papers, although it seems likely that the research for these had been done many years earlier.\nHis remarkable return to health did not last very long, for he died five years after he retired.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}