{
  "nome_completo": "William Henry Kruskal",
  "nome_curto": "William Kruskal",
  "ano_nascimento": "1919",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kruskal_William/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Chicago, USA",
  "biografia": "William Kruskal\n's father was Joseph Kruskal who was a successful businessman, the owner of Kruskal & Kruskal, a major fur wholesale  business. William's mother was Lillian Vorhaus who became famous as an expert on origami\n(\npaper-folding\n)\n. William was the oldest of his parents' five children, having two sisters and two brothers. Both brothers\nMartin Kruskal\nand\nJoseph Kruskal\nJr went on to become famous mathematicians. When William was young, the family moved to New Rochelle, a suburb of New York. He said\n[\n1\n]\n:-\nI went to public schools there through the eleventh grade. For grade twelve I attended Lincoln School in the city.\nAt this stage Kruskal was not thinking about a future academic career. Rather he saw his future in business, almost certainly in the family firm of Kruskal & Kruskal. He therefore chose to attend Antioch College in Ohio since they offered courses in which periods at the College alternated with work experience with a firm. He entered the College in\n1936\nbut he found his mathematics courses unsatisfactory as they did not deal with foundational questions which worried him. Trying to find answers to foundational problems led him to read work by\nQuine\nand, once he realised that\nQuine\ntaught at Harvard, Kruskal tried to change to complete his degree there. He entered Harvard in\n1938\n, taking a joint programme in mathematics and philosophy so he could attend the courses he found most attractive.\nAfter graduating from Harvard with an S.B. in\n1940\n, Kruskal remained there for a further year to take a Master's Degree in mathematics. With it looking increasingly likely that the United States would enter World War II, Kruskal then decided to take a job at the U.S. Naval Proving Ground in Dahlgren, Virginia, in\n1941\n. There he worked on aviation ordinance as a civilian and it was through the work undertaken at the Proving Ground that he became interested in statistics. Kruskal married Norma Jane Evans on\n23\nAugust\n1942\n; they had three sons Vincent, Thomas, and Jody. Norma and William decided that his working conditions would be better if he took a US Navy commission, which he did. He then went to work for\nAlston Householder\non anti-aircraft fire control.\nIn\n1946\nhe left the US Navy and went to New York to begin work in the family firm of Kruskal & Kruskal. He published his first paper\nHelmert's distribution\nin the\nAmerican Mathematical Monthly\nin the year he left the Navy, being work which he done while at the Naval Proving Ground. In addition to working for the family firm, he also began taking courses at Columbia University, obtaining permission from\nAbraham Wald\nto take courses for which he did not have the necessary prerequisites. He attended courses by Ted Anderson,\nJacob Wolfowitz\n,\nAbraham Wald\nand later by\nHenry Scheffé\nand Howard Levene. In\n1948\nhe left Kruskal & Kruskal to become a full-time student at Columbia. He began working towards his doctorate with\nHenry Scheffé\nas his advisor but left to take up a position in Chicago in\n1950\nbefore completing the research for his thesis.\nAllen Wallis, the founding Chairman of the University of Chicago's Statistics Department, offered Kruskal the position of instructor at Chicago with the agreement that he would become an assistant professor once he was awarded his doctorate. At Chicago he began a joint research project with Wallis, while\nScheffé\nhad left Columbia University and Howard Levene took over as Kruskal's advisor. In\n1952\nKruskal published two important papers both of which came out of his work with Wallis. The paper\nA nonparametric test for the several sample problem\nwas authored by Kruskal alone while the second\nUse of ranks in one-criterion analysis of variance\nwas a joint publication with Wallis. As a consequence he was promoted to assistant professor despite still not having submitted his doctoral dissertation to Columbia. He eventually submitted his thesis in\n1955\n. It was in two parts, the first being on robustness along the lines he had been working on at Columbia, the second part on the work he had undertaken at Chicago with Wallis. Stephen Stigler wrote:-\n[\nThe Kruskal-Wallis\n]\ntest is found today under that name as part of every major statistical computation system. The ... test was able to examine a set of data from several groups of subjects and test for potential differences among the groups. The test had the great advantage of simplicity, in that it depended only upon the rank order of the observations, not upon their exact values.\nIn\n1954\nKruskal began a collaboration with Leo Goodman on measures of association. These were republished as a book in\n1979\nwith a foreword written by Stephen E Fienberg:-\nIn\n1954\n, prior to the era of modern high speed computers, the present authors published the first of a series of four landmark papers on measures of association for cross classifications. By describing each of several cross classifications using one or more interpretable measures, they aimed to guide other investigators in the use of sensible data summaries. Because of their clarity of exposition, and their thoughtful statistical approach to such a complex problem, the guidance in this paper is as useful and important today as it was on its publication\n25\nyears ago. ... This series of papers evolved over a twenty-year period. The first and core paper appeared in\n1954\n. It suggests criteria for judging measures of association and introduces several new measures with specific contextual meanings. Examples and illustrations abound. The\n1959\npaper serves as a supplement to the initial one and provides additional historical and bibliographic material. The\n1963\npaper derives large-sample standard errors for the sample analogues of population measures of association and presents some numerical results about the adequacy of large-sample normal approximations. The\n1972\npaper presents a new look at the asymptotics, and provides a more unified way to derive large-sample variances for those measures of association that can be expressed as ratios of functions of the cell probabilities. Thus the techniques can be used for tried and true measures, and also for ones not yet invented.\nKruskal spent a year as a visiting professor at the University of California, Berkeley. There he taught a new course which resulted in his paper\nOrdinal measures of association\n(1958)\n. Some of his later publications include\nWhen are Gauss-Markov and least squares estimators identical? A coordinate-free approach\n(1968)\n,\nThe geometry of generalized inverses\n(1975)\n, and\nMiracles and statistics: the casual assumption of independence\n(1988)\n.\nHe was named the Ernest DeWitt Burton Distinguished Service Professor in Statistics at Chicago in\n1973\n, a position he held until he retired and was made Professor Emeritus in\n1990\n. During his time on the Faculty at Chicago he served as chairman of the Department of Statistics from\n1966\nto\n1973\n, then as Dean of the Social Sciences Division from\n1974\nto\n1984\n. He was also Dean of the Irving B Harris Graduate School of Public Policy Studies from\n1988\nto\n1989\n.\nPresident Richard Nixon set up his Presidential Commission on Federal Statistics in\n1970\n. He appointed Allen Wallis to head the Commission and appointed Kruskal and others such as\nTukey\nas members. Kruskal said\n[\n1\n]\n:-\nWe had a year's life, which was precious little because we had to gear up, get a staff, and then there had to be time at the end for publication. We published a two-volume report that on the whole was reasonably good. On of its recommendations was that, just because the life of this commission was so short compared to what you needed to study issues properly, there should be a more nearly permanent group formed.\nThe recommendation was followed up and Kruskal subsequently became the first chairman of the National Research Council's Committee on National Statistics, a position he held from\n1971\nto\n1978\n.\nKruskal edited\nThe Annals of Mathematical Statistics\nfrom\n1958\nto\n1961\n. He was co-editor of the\nInternational Encyclopedia of Statistics\nin\n1978\n. His co-editor, Judith Tanur, said:-\nHe was interested in everything, and so he read everything that crossed his desk, all kinds of periodicals, and he sent copies to everybody that he thought might be interested.\nKruskal was elected a fellow of the Institute of Mathematical Statistics, the\nAmerican Statistical Association\n, the American Association for the Advancement of Science, and the\nAmerican Academy of Arts and Sciences\n. He was president of the Institute of Mathematical Statistics in\n1971\n, and of the\nAmerican Statistical Association\nin\n1982\n.\nHe died of pneumonia at Bernard Mitchell Hospital in Chicago.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}