{
  "nome_completo": "William Whewell",
  "nome_curto": "William Whewell",
  "ano_nascimento": "1794",
  "ano_morte": "1866",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whewell/",
  "lugar_nascimento": "Lancaster, Lancashire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "William Whewell\n's parents were John Whewell, a master carpenter, and Elizabeth Bennison. It was a large family, and William was the eldest of his parents' seven children. He attended Blue School in Lancaster and his father intended that his son should proceed from there to become an apprentice carpenter. However, the Revd Joseph Rowley, headmaster of Lancaster grammar school and the parish priest, recognised William's talents and offered free education for him at Lancaster grammar school. Several years later he persuaded John to let William attend Heversham Grammar School in Westmorland, about\n20\nkilometres north of his native town, where he would receive instruction to allow him to compete for a scholarship at Trinity College, Cambridge. In\n1810\nWilliam went to Heversham where he spent two years. He also received some private coaching in mathematics from John Gough, a blind mathematician from Kendal, in:-\n... conic sections, fluxions, and mechanics.\nHe won an exhibition to Trinity College, but this was not sufficient to support him during his studies so further funds to support him were raised by private subscription.\nWhewell entered Cambridge in October\n1812\n, but by this time the family had suffered a series of tragedies with his mother dying in\n1807\nand three of his younger brothers dying before William began his university studies. His own health had been poor but a month after starting his studies at Cambridge he wrote to his father:-\nI have enjoyed very good health since I left Lancaster.\nHis mother had been a poet who had published poems in local papers and Whewell must have inherited his mother's poetic gifts since, in\n1814\n, he won the Chancellor's prize for an epic poem he wrote entitled\nBoadicea\n. He began to fit into the university life although given his background this did not come easily. He described his social activities in\n1815\nas\n[\n1\n]\n:-\n... shooting swallows, bathing by half dozens, sailing to Chesterton, dancing at country fairs, playing billiards, turning beakers into musical glasses, making rockets, riding out in bodies ...\nHe also excelled in the Mathematical Tripos graduating as second\nwrangler\nin January\n1816\nand then becoming second Smith's Prizeman. It was the first time that Whewell had not achieved the top place in a class but he took it in good part explaining in a letter to his family that he had not been able to write quickly enough. In July\n1816\nhis father died before his son had graduated. In October\n1817\nhe was elected to a fellowship at Trinity and wrote to his sisters saying that he had received\n[\n1\n]\n:-\n... the most substantial benefit at which you ever had to rejoice with me. It secures me a comfortable establishment for life at least so long as my life is a simple one.\nWe should note at this stage that Whewell had made a number of friends among top academics during his undergraduate years at Cambridge including John Herschel, Charles Babbage, George Peacock and other members of the Analytical Society. Whewell was appointed as a mathematics lecturer and assistant tutor at Cambridge in\n1818\n. He was one of the founder members of the Cambridge Philosophical Society in\n1819\n.\nAt a time when Cambridge was still finding acceptance of the superior Continental approach to mathematics, Whewell played a major role in modernising their approach with his textbooks\nAn Elementary Treatise on Mechanics\n(1819)\nand\nA Treatise on Dynamics\n(1823)\n. His\n1819\ntext was the first applied mathematics work in English to adopt continental mathematical symbolism, while his second work was a beautiful text using French analytic techniques. His achievements were quickly recognised with election to the\nRoyal Society of London\nin\n1820\n. He was by now making friends with younger Cambridge men such as\nAugustus De Morgan\nand\nWilliam Rowan Hamilton\n. Although he showed himself a great enthusiast for the French analytical methods in the first editions of the above two works, we should say that over the years Whewell became worried that the lack of geometric methods would damage students' intuitive understanding and as a result he reduced the analytical tools, increasing the geometrical methods in the later editions of his books. He also published\nThe Mechanical Euclid, containing the Elements of Mechanics and Hydrostatics demonstrated after the Manner of the Elements of Geometry\n(1837)\nwhere he took a completely geometrical approach.\nUp to the mid\n1820\ns Whewell had taught, written and researched mathematics. However this changed and he moved towards broader scientific interests with publications of books such as\nEssay on Mineralogical Classification and Nomenclature\n(1828)\n,\nArchitectural Notes on German Churches, with Remarks on the Origin of Gothic Architecture\n(1830)\n,\nAstronomy and General Physics\n(1833)\n,\nHistory of the Inductive Sciences\n(3\nvols.\n)\n(1837)\n, and\nThe Philosophy of the Inductive Sciences\n(2\nvols.\n)\n(1840)\n. As one might expect this led to his role changing at Cambridge and he was appointed professor of Mineralogy in\n1828\n, then professor of Moral Philosophy in\n1838\n. In June\n1841\nhe became engaged to be married to Cordelia Marshall and they married on\n12\nOctober\n1841\nin Cumberland. Five days later Whewell received a letter from Sir Robert Peel, the prime minister, saying that the Queen had accepted his recommendation that Whewell should be appointed master of Trinity. He was Vice-Chancellor of Cambridge University in\n1842\nand again in\n1855\n, the year in which his wife Cordelia died.\nThe breadth of Whewell's contributions are listed in\n[\n3\n]\n:-\nAlong with his role in educational reform, Whewell also proved a zealous and prolific researcher.  He published significant works in experimental physics, crystallography, mineralogy, physical astronomy, science education, architecture, poetry, and religion, along with a bewildering number of more popular reviews, lectures, and sermons.  He is the inventor of the self-registering anemometer, and the originator of many new scientific terms, including \"ion,\" \"cathode,\" \"Eocene,\" \"Miocene,\" \"physicist,\" and \"scientist.\"\nIn fact many of these words were coined by Whewell at the request of friends, for example terms \"anode\", \"cathode\" and \"ion\"  were for\nFaraday\n, while \"scientist\" was produced at the request of the poet Samuel Taylor Coleridge. One should not get the impression that Whewell moved away from applied mathematics, however, rather he included many other areas in his wide range of interests while continuing to research applied mathematical fields. For example he published fourteen major papers on the study of the tides between\n1833\nand\n1850\n. In fact he won the Royal Medal from the\nRoyal Society\nfor this outstanding work on tides.\nAnother important contribution was his support of, and work for, the\nBritish Association for the Advancement of Science\n. He strongly supported the founding of the Association in\n1831\nand, although he did not attend the first meeting of the Association in York in that year, it was his suggestion that they seek annual reports on the various sciences. He wrote the report on mineralogy for the meeting in\n1832\nand that on electricity and magnetism for the meeting of\n1835\n. He served the\nBritish Association\nas vice-president at the Oxford meeting in\n1832\nand again at Dublin in\n1835\n, he was the local secretary in\n1833\nwhen the Association met in Cambridge, then he was president at Plymouth in\n1841\n. In fact it was in his address to the\n1833\nBritish Association\nmeeting that he used the word 'scientist' for the first time, explaining that he coined the word in analogy to 'artist'. He later wrote\n[\n10\n]\n:-\n... as an Artist is a Musician, Painter, or Poet, a Scientist is a Mathematician, Physicist, or Naturalist.\nNote that the word 'Physicist' used in this quote by Whewell is also a word coined by him.\nThe areas for which Whewell is most famous today are philosophy of science, history of science, and moral philosophy. He examined 'knowledge' and claimed that\n[\n10\n]\n:-\n... in every act of knowledge ... there are two opposite elements, which we may call Ideas and Perceptions.\nHe claimed that Fundamental Ideas were\n[\n10\n]\n:-\n... not a consequence of experience, but a result of the particular constitution and activity of the mind, which is independent of all experience in its origin, though constantly combined with experience in its exercise.\nAs examples of Fundamental Ideas he gave time, number, cause, substance, and likeness. He wrote\n[\n10\n]\n:-\nWe cannot see one object without the idea of space; we cannot see two without the idea of resemblance or difference.\nHe developed a theory of induction, attempting to explain how physical laws are discovered. He argued that as well as the process of examining instances of a law\n[\n10\n]\n:-\n... there is a New Element added to the combination\n[\nof instances\n]\nby the very act of thought by which they were combined.\nAfter a law is produced by induction, Whewell argued that next is required a confirmation stage. He also argued for a concept he called Necessary Truth. He gave as an example the truth\n7\n+\n8\n=\n15\n[\n10\n]\n:-\n... we refer to our conceptions of seven, of eight, and of addition, and as soon as we possess the conceptions distinctly, we see that the sum must be\n15\n.  That is, merely by knowing the meanings of \"seven,\" and \"eight,\" and \"addition,\" we see that it follows necessarily that \"\n7\n+\n8\n=\n15\n\".\nFor Whewell his work on the history of science was an integral part of that on the philosophy of science, both contributing to knowledge. He felt that the history of science was extremely important\n[\n10\n]\n:-\n... the present generation finds itself the heir of a vast patrimony of science; and it must needs concern us to know the steps by which these possessions were acquired, and the documents by which they are secured to us and our heirs for ever.\nThe last years of Whewell's life were filled with sadness. His wife Cordelia died on\n18\nDecember\n1855\nafter a long illness. He then married Lady Everina Frances Affleck, widow of Sir Gilbert Affleck, on\n1\nJuly\n1858\n. She died on\n1\nApril\n1865\n. On\n24\nFebruary\n1866\nWhewell fell from his horse while riding outside Cambridge after the animal bolted. He was brought back to Trinity in a carriage but found to be paralysed. He died in his room in Trinity on\n6\nMarch, his last request being that the curtains be drawn back so that he could look at the great court of Trinity for the last time.\nAs to his character Leslie Stephen in his\n1899\nbiography writes\n[\n24\n]\n:-\nHe loved an argument, and his position as a great man in a small circle tended to make argument one-sided. He was popular as a tutor; but for some time he provoked a good deal of hostility as master. In early days he had little chance of acquiring social refinement; and, though he was anxious to be hospitable, his sense of the dignity of his position led to a formality which made the drawing-room of the lodge anything but a place of easy sociability. In later years age and sorrow made him conspicuously milder, and the object not only of the pride but of the warm affection of the university. Though rough at times, he was from the first magnanimous; he never cherished resentment and admitted defeat frankly, and received the opinions of young and insignificant persons with remarkable courtesy. Few men, too, have had more friends or retained their friendships more carefully. He had many controversies, but no personal quarrels.\nWith so many achievements in so many different areas it is clear that we must have failed to mention many important aspects of his contributions in this article. Perhaps we should mention one final fact which we have failed to mention until now, namely his role as a priest. He was ordained a priest on Trinity Sunday\n1825\n, which was a requirement of Fellows of Trinity, then ordained as a deacon in the following year. He preached in the university on a regular basis, in particular he preached four sermons\nOn the Foundation of Morals\nin\n1837\nwhich were published in that year. Ten years later he published\nSermons preached in the Chapel of Trinity College, Cambridge\ncontaining twenty-two of his sermons.\nLet us end this biography of Whewell by quoting\nJohn Herschel\n, his friend for many years\n[\n3\n]\n:-\n... a more wonderful variety and amount of knowledge in almost every department of human inquiry was perhaps never in the same interval of time accumulated by any man.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Number Theory"
  ]
}