{
  "nome_completo": "William John Macquorn Rankine",
  "nome_curto": "William Rankine",
  "ano_nascimento": "1820",
  "ano_morte": "1872",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rankine/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "William Rankine\n's mother was Barbara Grahame, the daughter of a Glasgow banker, and his father was David Rankine, a civil engineer and lieutenant in the rifle brigade. Although he was the second of his parents children, his older brother David died when young so William was brought up as an only child. It was a strict religious upbringing with his father teaching him not only arithmetical skills but also mechanics. William did not enjoy good health as a child and could only attend school for short periods. Most of his education took place at home with private tutors but he did attend Ayr Academy for about a year in\n1828\n-\n29\nand also for a short while Glasgow High School in\n1830\n.\nRankine's interests were divided between music and mathematics. At first he was strongly attracted to\nnumber theory\nbut when he was\n14\nyears old one of his uncles gave him a Latin edition of\nNewton\n's\nPrincipia\nwhich he read eagerly. For two years from\n1836\nto\n1838\nRankine studied at the University of Edinburgh, attending a wide range of lectures in science subjects, but choosing not to attend mathematics classes. He won a Gold Medal for an essay on\nThe wave theory of light\nin\n1836\nand another Gold Medal for an essay on\nMethods in physical investigation\ntwo years later. He did not take a degree but chose to leave university in\n1838\nand become an apprentice to the engineer John Benjamin MacNeill. This was not Rankine's first experience of engineering for while he studied at Edinburgh University he had worked on the Edinburgh and Dalkeith Railway which his father was overseeing.\nFrom\n1839\nto\n1841\nRankine worked on numerous projects that John Benjamin MacNeill was involved with, including river improvements, waterworks, railways and both harbours. Some of the work took Rankine to Ireland. After his return to Edinburgh he undertook some investigative work with his father and they published\nAn experimental inquiry into the advantages attending the use of cylindrical wheels on railways\n(1842)\n. Further papers read to the Institution of Civil Engineers were highly thought of and several won Rankine prizes.\nRankine was appointed to the regius chair of civil engineering and mechanics at Glasgow in\n1855\n. His\n[\n2\n]\n:-\n... inaugural address espoused the harmony of theory with practice in mechanics, and outlined a tripartite theory of knowledge - theory, practice, and the application of theory to practice - which left room for a new breed of engineering scientists to bridge theoretical and practical domains.\nHe decided to found a Scottish version of the Institution of Civil Engineers and so he resigned from the London based Institution in\n1857\nand became the first president of the new Institution of Engineers in Scotland. As well as holding the presidency in\n1857\n-\n59\n, he was elected for a second term in\n1869\n-\n70\n.\nRankine's study of the applications of mathematics began quite early in his career as an engineer. While an apprentice engineer he made a mathematical analysis of the cooling of the earth\n(1840)\n. He worked on heat, reading\nClapeyron\n's works, and attempted to derive\nSadi Carnot\n's law from his own hypothesis. R H Atkin, reviewing\n[\n14\n]\n, describes Rankine's ideas on thermodynamics, and in particular compares his approach with that of\nClausius\n:-\nRankine apparently regarded energy, as we do today, as being classified into two kinds, viz., kinetic and potential, and his thermodynamic theory was developed by considering the transformation of one into the other. He began with the hypothesis that matter was constituted by molecular vortices\n(\nwithout considering the cyclic process\n)\nand obtained the quantities \"pressure\", \"specific heat\", etc., from that consideration. His classification of energy was similar to, but not exactly the same as, that of\nClausius\n. Both Rankine and\nClausius\napproached the second law of thermodynamics from the point of view of the transformation from one kind of energy to the other. But whereas\nClausius\nconsidered the conversion between heat and work and the flow of heat from high to low temperature in a cyclic process, Rankine concentrated on the change from kinetic\n(\nmolecular\n)\nto potential energies, and related this change to heat flow by use of his \"heat-potential\" function.\nHutchison, in\n[\n9\n]\nand\n[\n10\n]\n, looks at the entropy function which Rankine defined and its implications for the theory of thermodynamics which he developed. Rankine's work was extended by\nMaxwell\n. Rankine also wrote on fatigue in the metal of railway axles, on earth pressures in soil mechanics, and the stability of walls. He also developed methods to solve the force distribution in frame structures and worked on hydrodynamics and the design of ships. He was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1849\nand a fellow of the\nRoyal Society\nof London in\n1853\n. He was also elected to the\nAmerican Academy of Arts and Sciences\nin\n1856\nand to the\nRoyal Swedish Academy of Sciences\nin\n1868\n. He was awarded an honorary degree from Trinity College, Dublin, in\n1857\n.\nAmong his most important works are\nManual of Applied Mechanics\n(1858)\n,\nManual of the Steam Engine and Other Prime Movers\n(1859)\n,\nCivil Engineering\n(1862)\n,\nMachinery and Millwork\n(1869)\n,\nUseful Rules and Tables\n(1866)\n,\nMechanical Textbook\n(1873)\n, and\nOn the Thermodynamic Theory of Waves of Finite Longitudinal Disturbance\n.\nAs to his interests outside his professional studies, he was\n[\n2\n]\n:-\nA keen cellist, pianist, and vocalist, his one published composition was a piano accompaniment to a song entitled the 'Iron Horse'; as a\nBritish Association\nred lion, hailed as lion-king in\n1871\n, he penned quirky and humorous poems like 'The Mathematician in Love' and 'The Three-Foot Rule'\n(\na protest against the metric system\n)\n. These Songs and Fables\n(1874)\nappeared posthumously with illustrations by Jemima Blackburn, wife of Glasgow College's mathematics professor.\nRankine's health deteriorated rapidly during the final six months of his life. The first symptoms saw his vision become impaired, then his speech failed and finally he became partially paralysed.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Number Theory"
  ]
}