{
  "nome_completo": "William Gilmour Guthrie",
  "nome_curto": "William Guthrie",
  "ano_nascimento": "1905",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Guthrie/",
  "lugar_nascimento": "Cowdenbeath, Fife, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "William Guthrie\n's father was the Rev W A Guthrie, D.D., who was the Minister at Fountainbridge Church, Edinburgh, but at the time William was born he was headmaster of Foulford school in Cowdenbeath, Fife. William attended Broughton Secondary School, Edinburgh, completing his school education in\n1922\nwhen he was dux of the school. He won the Bruce Bursary to study at the University of Edinburgh. On\n21\nJuly\n1926\nhe graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy. He then followed the route of many Scottish students of this period and, after completing a degree in Scotland, went to Cambridge and effectively took a second 'first degree'. He studied the Mathematical Tripos and became a\nwrangler\n(\nfirst class student\n)\nin\n1929\n.\nAfter graduating from Cambridge, Guthrie was appointed as an Assistant in Mathematics at the University of St Andrews. While teaching at St Andrews he undertook research for his doctorate which was awarded in\n1932\n. In\n1933\nhe was appointed Professor of Mathematics and Natural Philosophy at Magee University College, Londonderry. In addition to this post he was appointed he was elected Bursar of Faculty in\n1945\n, then Principal in October\n1958\n.\nIt was widely expected that Magee College would become the second university in Northern Ireland when a committee was set up to report. However the committee proposed that the second university be established at Coleraine rather than Londonderry and Guthrie resigned from Magee College on\n30\nSeptember\n1968\n, the day before the new University of Ulster opened at Coleraine.\nGuthrie was a Fellow of the\nRoyal Astronomical Society\n, a member of the Irish Astronomical Society, and of the Edinburgh Astronomical Society. He was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1926\n. He was elected to the\nRoyal Society of Edinburgh\non\n6\nMarch\n1933\n, his proposers being Herbert Stanley Allen,\nHerbert Westren Turnbull\n,\nDavid Jack\n,\nEdward Thomas Copson\n.\nAn obituary, written by\nH A Brück\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1979\n, pages\n35\n-\n36\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nGuthrie married Thelma Pate. The announcement of their engagement reads:-\n12\nOctober\n1938\n. The engagement is announced between William Gilmour Guthrie, M.A. Ph.D., F.R.S.E., Professor at University College, Londonderry, son of Rev. W A Guthrie, D.D., and Mrs Guthrie,\n13\nCrawfurd Road, Edinburgh, and Thelma, only daughter of Mr and Mrs Gibson Pate, Schoolhouse, St Boswells, Roxburghshire\n.",
  "math_areas": []
}