{
  "nome_completo": "William Trail",
  "nome_curto": "William Trail",
  "ano_nascimento": "1746",
  "ano_morte": "1831",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Trail/",
  "lugar_nascimento": "Logie, near Montrose, Scotland",
  "lugar_morte": "Bath, Somerset, England",
  "biografia": "William Trail\n's father was the Reverend William Trail\n(1712\n-\n1756)\nwho was Minister of St Monance in Fife. His mother was Mary Trail\n(1731\n-\n1756)\nwho was the daughter of the Revd Robert Trail, minister of Panbride. Both his parents died in\n1756\nof a malignant fever.\nTrail entered at Marischal College, Aberdeen in\n1759\nwhere his father had studied. He then studied under\nSimson\nat Glasgow from\n1763\nand he was awarded an M.A. in\n1766\n. In the same year he was appointed to the Chair of Mathematics at Marischal College, Aberdeen. He won this post in competition with\nPlayfair\nand Robert Hamilton. Ponting describes the competition in\n[\n1\n]\n:-\nThe Town Council, apparently determined to avoid any grounds for complaint ..., despite the opinion of the Principal and Masters that a sufficiently qualified person might be found locally, arranged an open competition for the chair in August\n1766\n. Four examiners, from St Andrews, Glasgow, King's and Marischal, were chosen to test the six candidates who had first to submit 'sufficient Attestations of their moral Characters' to the Town Clerk. The trial covered a detailed list of mathematical topics and included any original work. The order of both proposing and answering oral questions was decided by lot and names were cut off written papers by a clerk before the examiners received them. For an ordeal which lasted eleven days, the victims must have been relieved that 'As the Examinators apprehend the presence of Spectators may be apt to disconcert the Candidates and even to hurt the attention of the Examinators, they are of opinion the Trial should be in the presence of the Examinators and their Clerk only'. Marks awarded ranged from\n16\nto\n126\n, the top score and appointment going to William Trail, a young man newly graduated from Glasgow. The runners up, with\n119\nand\n90\nrespectively, were Robert Hamilton, who joined the staff later and\nJohn Playfair\n, afterwards professor at Edinburgh. Details of Hamilton's actual questions may be found in the University archives.\nPonting goes on to give some details in\n[\n1\n]\nof Trail's time teaching at Aberdeen:-\nAlthough Trail began his duties in October, the Town Council paid his annual £\n50\nprofessorial salary only from Whitsunday\n1767\n, retaining the balance to defray 'the great expense incurred by the comparative Tryal of the Candidates'. Meanwhile he presumably had to live on his class fees, estimated at about £\n70\nfor the session. By this time the earlier system of appointing post graduate teaching bursars to help with arithmetic and elementary geometry had been abandoned as no longer necessary. Trail, responsible for all Mathematics, taught 'above twelve times a week'.\nWhile holding this post he was awarded the degrees of DD and LLD from Aberdeen in\n1774\n. While holding the chair at Aberdeen, Trail published\nElements of Algebra\n...\n[\n1\n]\n:-\nHis widely used Elements of Algebra, which he published for his students in\n1770\n, ranged from first principles to equations of all orders and included applications to problem solving, physics and geometry.\nDetails of the latter part of Trail's time in Aberdeen are then given in\n[\n1\n]\n:-\nIn\n1776\n, at Trail's request, John Garioch, a physician in Aberdeen, was appointed his assistant and successor. Garioch died six months later and was not replaced. During the session\n1778\n-\n9\n, in Trail's absence, the higher branches of mathematics were taught by Patrick Copland, Professor of Natural Philosophy since\n1775\n.\nHe resigned the Chair of Mathematics at Marischal College in\n1779\non obtaining a preferment in the Irish Church being appointed Chancellor of Down and Connor, Ireland. He married Lady Frances Charteris in\n1799\n. Despite his new career in the Church, Trail did retain an interest in mathematics\n[\n1\n]\n:-\nHis continuing interest in mathematics was shown in an account of the life and work of his former Glasgow professor,\nRobert Simson\n, published in\n1812\n. He died in\n1831\naged eighty-four.\nHe was described as:-\n... a man of great capacity... entirely extinguished... by the sinecure emoluments of the Irish Church .\nThe\nRoyal Society of Edinburgh\nwas founded in\n1783\nand Trail was a Founder Member, elected on\n17\nNovember\n1783\n.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}