{
  "nome_completo": "William Whiston",
  "nome_curto": "William Whiston",
  "ano_nascimento": "1667",
  "ano_morte": "1752",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whiston/",
  "lugar_nascimento": "Norton-juxta-Twycross, Leicestershire, England",
  "lugar_morte": "Lyndon Hall, Rutland, England",
  "biografia": "William Whiston\n's father was Josiah Whiston who was a presbyterian minister at Norton. William's mother was Katherine Rosse, whose father Gabriel Rosse had been the minister of Norton parish immediately prior to Josiah Whiston. William, the fourth of his parents nine children, was born in the rectory at Norton. William was taught by his father until he was\n17\n, but he also acted in a secretarial role by copying manuscripts for his father. In\n1684\nhe went to the grammar school in Tamworth then, in\n1686\n, after two years of school, he entered Clare College, Cambridge. He was very poor since his father died shortly before he went to university. However Whiston inherited the family library and was following his father's wishes that he train to become a presbyterian minister.\nWilliam attended\nNewton\n's lectures while at Cambridge and he showed great promise in mathematics. He obtained his B.A. in\n1690\n, then obtained a fellowship at Clare College in\n1691\n. Two years later he was awarded an M.A. and was ordained in the same year. He was encouraged by\nDavid Gregory\nat this time to study\nNewton\n's\nPrincipia\n. He returned to Cambridge, intending to take mathematics pupils, but ill health made him give up his position as a tutor at Clare College.\nFrom\n1694\nto\n1698\nhe was chaplain to the bishop of Norwich. During this period he wrote\nA New Theory of the Earth\n(1696)\n, in which he claimed that the biblical stories of the creation, flood etc. could be explained scientifically as descriptions of events with historical bases. He relied heavily on applying\nNewton\n's physics\n(\nin fact the book was dedicated to\nNewton\n)\nand on the new ideas about geology which were then being developed, to support the biblical account. For example he claimed that the biblical flood was due to a comet hitting the Earth, an interesting theory given the current interest in theories of this type. Of course the work mixed science and religion to the extent that Whiston claimed that the comet was divinely guided.\nA New Theory of the Earth\nproved very popular with French and German translations appearing. Even those such as\nBuffon\nwho criticised Whiston's book accepted some his ideas which they incorporated into their own theories.\nIn\n1698\nWhiston obtained a vicarage in Suffolk at Lowestoft-with-Kissingland. Up to this time he had continued to hold his fellowship at Clare College, but he resigned in June\n1699\nwhich he was forced to do in order to marry. He married Ruth Antrobus who was the daughter of the headmaster of the grammar school in Tamworth which he had attended. They had eight children, of whom four\n(\nSarah, William, George, and John\n)\nreached adulthood. His father-in-law, George Antrobus, gave the newly married couple a farm near Dullingham in Cambridgeshire which provided them with an annual income. He was appointed assistant to\nNewton\nat Cambridge from February\n1701\n. However Whiston fell out with\nNewton\nover Bible chronology for, unlike\nNewton\n's, his\ncosmology\ninvolved direct intervention by God. Despite this much of Whiston's religious beliefs seem close to those of\nNewton\n.\nIn May\n1702\nWhiston succeeded\nNewton\nas Lucasian professor and, in the following year, he published an edition of\nTacquet\n's\nEuclid\n\"for the use of young students in the University\". With\nNewton\n's agreement, Whiston published\nNewton\n's algebra lectures in\n1707\nunder the title\nArithmetica universalis\nⓉ\n(\nUniversal arithmetic\n)\nand, three years later, his own astronomy lectures as\nPraelectiones astronomicae\nⓉ\n(\nAstronomical lectures\n)\n. The English version was published in\n1715\nas\nAstronomical Lectures\n. He lectured at Cambridge on mathematics and natural philosophy and, after\nRoger Cotes\nwas appointed to the Plumian professorship in\n1706\n, receiving strong recommendations from Whiston, they undertook joint research. Together they introduced the first courses on experimental physics at Cambridge.\nWhiston also published religious works such as\nEssay on the Revelation\n(1706)\n. He came to believe that the doctrine of the Trinity was incorrect\n(\nas did\nNewton\n)\nand, although at first careful not to publicly oppose the views of the established church, he later became bolder and published his views in\nSermons and Essays\n(1709)\n. These views were not popular and, after he refused to acknowledge that he was in error, he was brought before the heads of the Cambridge colleges charged with heresy. He was deprived of his chair on\n30\nOctober\n1710\nand dismissed from Cambridge University. He went to London where a court was set up by the lord chancellor to try him for heresy but, after the death of Queen Anne, proceedings against him were dropped. A German visitor to London who met him in\n1710\ndescribed him as being:-\n... of very quick and ardent spirit, tall and spare, with a pointed chin and wears his own hair. In looks, he greatly resembles Calvin. He is very fond of speaking and argues with great vehemence.\nWhiston was now rather poor and lived off the income of a small farm near Newmarket. To make money he formed a partnership with Francis Hauksbee, who was twenty years his junior, and from\n1713\nthey gave a course covering mechanics, hydrostatics, pneumatics, and optics. In the following year they produced a course manual which was widely used and later formed the basis of some of the courses at Oxford. He lectured in the coffee-houses of London, being one of the first to demonstrate science experiments during the lectures. As time went on his financial position improved as various patrons provided an income for him. As a result, without needing to make money, he lectured less.\nIn\n1714\n, along with Humphrey Ditton, Whiston approached parliament advising them to encourage work on solving the longitude problem by offering large financial rewards. The idea was supported by\nNewton\n,\nClarke\n,\nCotes\n, and\nHalley\nand the result was the Longitude Act passed by parliament later in\n1714\n. Having been one of the main enthusiasts for the Longitude Act, Whiston now proposed a number of methods of finding the longitude at sea; there was a lot of money for a good solution but he never succeeded. The methods he proposed included having vessels stationed at fixed points across the Atlantic, having each fire a star shell at a fixed time each day. Ships would be able to calculate their distance from such a vessel by calculating the time taken for the sound of the shell to reach them after the flash was observed. One of his proposals concerned magnetic inclination and is certainly not without interest. It is discussed in detail in\n[\n8\n]\n. Howarth writes that Whiston:-\n... made the first known maps showing the direction of magnetic inclination\n(\nfor south-eastern England\n)\nin\n1719\nand\n1720\n. He also anticipated Graham's\n1723\nmeasurement of the ratio of horizontal and vertical magnetic intensities, and he understood their relationship to magnetic inclination.\nHowarth then tries to understand how Whiston fitted the planar isoclinic surfaces:-\nThis is of interest because his study precedes the publication of 'Meyer's method' by thirty-one years and the\nLegendre\n-\nGauss\n'method of least squares' by eighty-six years. It is suggested that Whiston fitted the surfaces using observations of inclination at a chosen triple of localities; and that he did this in order to use data from non-included localities as a check on his model.\nWhiston published\nThe Longitude and Latitude Found by the Inclinatory or Dipping Needle\nin\n1721\n.\nWhile he was being subjected to charges of heresy he was bold enough to set out his religious beliefs in a series of pamphlets\nPrimitive Christianity Revived\n(1711\n-\n12)\n. Wanting to return to an early form of Christianity, he founded the Society for Promoting Primitive Christianity in\n1715\nwhich held meetings in Whiston's London home. Continuing with his theme of science and religion, he published\nAstronomical Principles of Religion\nin\n1717\n. He left the Church of England in\n1747\nbecause of his objection to the Athanasian creed, and joined the Baptists.\nLyndon Hall, where Whiston died, was the residence of Samuel Barker, the husband of Whiston's daughter Sarah. Ruth Whiston died in\n1751\n, and Whiston died in the following year after being ill for one week. He was buried in Lyndon churchyard.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Number Theory"
  ]
}