{
  "nome_completo": "Winifred Lydia Caunden Sargent",
  "nome_curto": "Winifred Sargent",
  "ano_nascimento": "1905",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sargent/",
  "lugar_nascimento": "Ambergate, Derbyshire, England",
  "lugar_morte": "Hampstead Garden, London, England",
  "biografia": "Winifred Sargent\nwas born into a Quaker family. John Grant Sargent and his wife Catherine Doubell, settled in Fritchley, Derbyshire in\n1864\nwhere they founded a very strict Quaker Community providing an alternative to the London Meeting. The Fritchley General Meeting met in\n1870\nand, although always small, it slowly increased up to about\n1900\n. Winifred's father, Henry C Sargent, was a descendent of John Grant Sargent and Winifred was the only child of Henry Sargent's second marriage to Edith M Sargent. She was brought up in the Quaker Community at Fritchley and her primary education was provided partly by her father and partly in a small school run for children of the Fritchley Society of Friends\n(\nQuakers\n)\n.\nIn September\n1915\nSargent entered Ackworth School which had been founded by the Quakers in\n1779\nin the abandoned buildings of a Foundling Hospital in Ackworth near Pontefract and still occupied these building when Sargent became a boarder there. Although it was a mixed school, the boys and girls occupied separate wings in Ackworth School at that time and they were taught separately. Her mathematics teachers probably included Lydia S Graham M.A. and Victoria M Jevons B.Sc. both of whom were on the mathematics staff during her time at the school\n[\n1\n]\nand it seems that here Sargent first became enthusiatic about mathematics. She spent three years at Ackworth School, leaving on\n28\nJuly\n1919\n, and, having won a Joseph Rowntree Entrance Scholarship, she began to study at The Mount School in York. This was a girls school founded in\n1831\n, again run by the Society of Friends\n(\nQuakers\n)\n. She was a boarder at this school for a while but did not find the mathematics challenging enough.\nSargent left The Mount School in York and became a day pupil at The Herbert Strutt School in Derby Road, Belper, Derbyshire. Unlike her two previous secondary schools, The Herbert Strutt School was comparatively new, having only opened in\n1909\nand gained full Secondary School status in\n1913\n. Also unlike her previous secondary schools, this was not a Quaker school but it was an attractive prospect because of the high academic reputation which it had quickly attained.\nIn\n1923\n, while studying at The Herbert Strutt School, Sargent gained a Derby County Scholarship, a State Scholarship, and a Mary Ewart Scholarship to study mathematics at Newnham College, Cambridge. The main emphasis there was on analysis and it was certainly a topic which attracted her. She gained further honours when she was awarded a Arthur Hugh Clough Scholarship in\n1927\n, a Mary Ewart Travelling Scholarship in\n1928\nand, in the same year, a Goldsmiths Company Senior Studentship.\nAfter graduating Sargent began to undertake research in analysis but after working for a while she felt that she was not producing results of the exceptionally high standard which she had set herself. She did produce good results, despite any feelings that she may have had about them, for she published\nOn\nYoung\n's criteria for the convergence of\nFourier\nseries and their conjugates\nin the\nProceedings of the Cambridge Philosophical Society\nbased on this work which appeared in print in\n1929\n. This was a fine piece of work for the young mathematician who nevertheless gave up her research to become a mathematics teacher at Bolton High School.\nFortunately, even if Sargent did not believe strongly enough in her own mathematical abilities, others knew better. In\n1931\nshe was offered the position of Assistant Lecturer in Mathematics at Westfield College, London. This College had been founded in\n1882\nas a pioneering college for the higher education of women, and was granted its Royal Charter in\n1932\n. Although Sargent was somewhat unsure about the move, she was persuaded to make it and she began teaching at Westfield College in\n1931\n. In\n1936\nshe moved to Royal Holloway College. This was also a college for women, which had been founded in\n1879\nby Thomas Holloway, opened by Queen Victoria in\n1886\nand became a College of London University in\n1900\n. Sargent's first appointment in Royal Holloway College was as an Assistant Lecturer in Mathematics, for although by the time of her appointment she had published a further two papers, she had never completed a doctorate.\nIn\n1939\nSargent registered as a doctoral student of\nBosanquet\nwho was at that time a Reader in the University of London having interests in analysis which were close to those of Sargent. Of course World War II broke out not long after\nBosanquet\nhad begun to supervise her research and formal supervision came to an end; however he continued to influence and encourage her. She was promoted to Lecturer in Mathematics in\n1941\n, then moved from Royal Holloway College to Bedford College in\n1948\n. This was another London college for women situated after\n1913\nin Regent's Park, and becoming part of the University of London in\n1900\nat the same time as Royal Holloway College.\nIn\n1947\nBosanquet\ninaugurated a weekly seminar and Sargent attended this from its beginnings until she retired, without missing a single week in\n20\nyears. However, she did not attend conferences and seldom could be persuaded to address\nBosanquet\n's seminar, although when she did she showed herself to be an outstanding speaker. In\n1954\nSargent was awarded a Sc.D. by the University of Cambridge, and promoted to Reader at Bedford College. In\n1965\nBedford College admitted male undergraduates for the first time. Two years later, in\n1967\n, Sargent retired from her Readership and, unlike many mathematicians, seems to have given up research at this time.\nSargent's mathematical work involved the study of different types of integral. The\nRiemann\nintegral is well known and had long been studied, but much effort had also been put into the study of the\nLebesgue\nintegral. Sargent concentrated on integrals such as the\nPerron\nintegral, the\nDenjoy\nintegral, the\nCesàro\n-\nPerron\nintegral, and the\nCesàro\n-\nDenjoy\nintegral. For example in\n1941\nSargent published\nA descriptive definition of\nCesàro\n-\nPerron\nintegrals\nin the\nProceedings of the London Mathematical Society\nwhich gives an inductive definition, using\nCesàro\nderivatives, of the\nCesàro\n-\nDenjoy\nintegral which is equivalent to\nBurkill\n's integral. In the same year she published\nOn sufficient conditions for a function integrable in the\nCesàro\n-\nPerron\nsense to be monotonic\nin the\nQuarterly Journal of Mathematics\n. R L Jeffery, reviewing the second of these papers writes:-\nThere is ... provided a simple and direct proof for a theorem which is fundamental in the development of the Cesàro-Perron scale of integration.\nHer\n1948\npaper\nOn the integrability of a product\nextends results of Lebesgue from\n1910\nto the general theory of\nDenjoy\n-\nPerron\nintegrals. Another paper published in the same year\nOn the summability\n(\nC\n)\nof allied series and the existence of\n(\nCP\n)\nextends the conditions for the\nCesàro\nsummability of\nFourier\n-\nLebesgue\nseries and of their conjugates given by\nBosanquet\nin\n1937\nto the case of functions integrable in the\nCesàro\n-\nPerron\nsense.\nThis is only a few examples of the work which Sargent carried out and published in\n24\npapers but it gives an indication of the type of problems which interested her. Eggleston, in\n[\n2\n]\n, writes:-\nSargent's work is marked by its exceptional lucidity, its exactness of expression and by the decisiveness of her results. She made important contributions to a field in which the complexity of the structure can only be revealed by subtle arguments. Her work is in many ways an expression of her character. Although she was self-effacing and totally lacking in any ambition for self-advancement, yet she was independent and would not tolerate anything which she thought to be second-best. She never attempted to publicise her work ...\nAs to her interests outside mathematics\n[\n2\n]\n:-\n... she had a passion for walking and enjoyed tennis in her younger days.\nEggleston pays her this tribute:-\nShe will be remembered by her friends for her dedication to the search for mathematical truth, her absolute integrity and above all for the determination with which she imposed on herself and on those she taught the highest and most meticulous standards of accuracy and precision.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}