{
  "nome_completo": "Wolfgang Ernst Pauli",
  "nome_curto": "Wolfgang Pauli",
  "ano_nascimento": "1900",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pauli/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Wolfgang Pauli\nwas the son of Wolfgang Joseph and Berta Camilla Schütz. Wolfgang Joseph had trained as a medical doctor in Prague. After qualifying, he practised as a doctor in Vienna and quickly became popular. In\n1898\nhe changed his name to Wolfgang Joseph Pauli and, in the following year, converted from Judaism to become a Roman Catholic. He married Berta Schütz in May\n1899\nbut by this time he had given up his medical practice for research in chemistry and physics, becoming a university professor.\nWolfgang Joseph had been inspired to study science by Ernst Mach, and when his first child was born he named him Wolfgang Ernst Pauli, giving him the middle name of Ernst in honour of Mach. Not only did Pauli's middle name come from Mach, but Mach was also his godfather giving him a silver cup when he was christened on\n31\nMay\n1900\n.\nWolfgang attended school in Vienna where he began a deep study of mathematics and physics at the Döblingen\nGymnasium\n. He was certainly not a typical pupil for he read\nEinstein\n's papers on relativity while he was still at the Gymnasium. School work was boring to the brilliant Pauli and he hid\nEinstein\n's papers under his school desk and studied them during the lessons. Not paying attention in class did not hold Pauli back, for he graduated from the Gymnasium in July\n1918\nwith distinction.\nAfter leaving the Gymnasium he entered the Ludwig-Maximilian University of Munich. Within two months of leaving school he had submitted his first paper on the theory of relativity. While still an undergraduate at Munich he wrote two further articles on the theory of relativity. At Munich, Pauli was taught by\nSommerfeld\nwho quickly recognised his genius.\nSommerfeld\nasked Pauli to write a review article on relativity for the\nEncyclopädie der mathematischen Wissenschaften\nwhen he had only been two years at university, a mark of the high regard in which he held Pauli. The respect was mutual, for Pauli showed more respect for\nSommerfeld\n, both as a person and as a scientist, than he did for any other.\nPauli, writing about his days as a student at Munich, wrote\n(\nsee the extracts from Pauli's Nobel Prize lecture in\n1945\ngiven in\n[\n17\n]\n)\n:-\nI was not spared the shock which every physicist accustomed to the classical way of thinking experienced when he came to know Bohr's basic postulate of\nquantum theory\nfor the first time.\nHe wrote his first paper on quantum physics in June\n1920\n, a work on the magnetic properties of matter. The year\n1920\nwas when\nHeisenberg\narrived in Munich, also to become a student of\nSommerfeld\n. In\n[\n21\n]\nPais quotes from\nHeisenberg\n's description of Pauli's way of life at this time:-\nWolfgang was a typical night bird. He preferred the town, liked to spend evenings in some café, and would thereafter work on his physics with great intensity and great success. To\nSommerfeld\n's dismay he would therefore rarely attend morning lectures and would not turn up until about noon.\nPauli received his doctorate, which had been supervised by\nSommerfeld\n, in July\n1921\nfor a thesis on the quantum theory of ionised molecular hydrogen. In his report on the thesis\nSommerfeld\nwrote that it showed:-\n... like his many already published smaller investigations and his larger encyclopedia article, the full command of the tools of mathematical physics.\nSommerfeld\nwas certainly right to heap much praise on the thesis but it had been a disappointment to Pauli since the theoretical results he had proved did not agree with experimental evidence. Looking at it now one can see that it showed that quantum theory, as then formulated, was not in itself going to provide the necessary structure on which to build a logical theory of atomic structure which agreed with experimental evidence.\nTwo months after the award of his doctorate Pauli's survey of the theory of relativity appeared, by this time having grown into a work of\n237\npages. His genius was immediately recognised by\nEinstein\nwho, after reading Pauli's monograph on relativity, wrote a review\n[\n21\n]\n:-\nWhoever studies this mature and grandly conceived work might not believe that its author is a twenty-one year old man. One wonders what to admire most, the psychological understanding for the development of ideas, the sureness of mathematical deduction, the profound physical insight, the capacity for lucid, systematical presentation, the knowledge of the literature, the complete treatment of the subject matter, or the sureness of critical appraisal.\nPauli was then appointed to Göttingen as\nBorn\n's assistant from October\n1921\n. It was in Göttingen that he first met\nNiels Bohr\nin person and he said\n(\nsee for example\n[\n17\n]\n)\n:-\n... a new phase of my scientific life began when I met\nNiels Bohr\npersonally for the first time. This was in\n1922\n, when he gave a series of guest lectures at Göttingen when he reported on his theoretical investigations on the periodic system of elements. During these meetings, Bohr asked me whether I could come to Copenhagen for a year.\nPauli eagerly accepted the invitation and spent the year\n1922\n-\n23\nat Bohr's Institute\n[\n17\n]\n:-\nFollowing Bohr's invitation, I went to Copenhagen in the autumn of\n1922\n, where I made a serious effort to explain the so-called 'anomalous Zeeman effect', ... a type of splitting of the spectral lines in a magnetic field which is different from the normal triplet.\nIn\n1923\n, Pauli was appointed a\nprivatdozent\nat Hamburg\n[\n17\n]\n:-\nVery soon after my return to the University of Hamburg, in\n1923\n, I gave there my inaugural lecture as privatdozent on the periodic system of elements. The contents of the lecture appeared very unsatisfactory to me, since the problem of the closing of the electronic shells had been clarified no further.\nIn\n1924\nPauli proposed a quantum spin number for electrons. He is best known for the\nPauli exclusion principle\n, proposed in\n1925\n, which states that no two electrons in an atom can have the same four quantum numbers. Less than a year after this\nHeisenberg\nsubmitted his article on quantum mechanics which was to change the whole approach to the topic. Pauli, who before that had begun to feel that further advances could not be made with the theory as it then existed, quickly made progress using\nHeisenberg\n's new ideas and before the end of\n1925\nhe had derived the hydrogen spectrum from the new theory.\nThe year\n1927\nsaw personal tragedy for Pauli when his mother, to whom he had been very close, committed suicide. In the following year his father remarried making an even more unhappy situation for Pauli who referred to his father's new wife as \"the evil step-mother\". On\n6\nMay\n1929\nPauli left the Roman Catholic Church, but his reasons for this are not entirely clear. Further unhappiness was to follow when he married Käthe Margarethe Deppner in Berlin on\n23\nDecember\n1929\n. The marriage was never a success, even in the first few months, and they were divorced in Vienna on\n29\nNovember\n1930\n.\nDespite the personal problems, Pauli's career progressed well. In\n1928\nhe was appointed Professor of Theoretical Physics at the Federal Institute of Technology in Zürich and soon made some remarkable progress. He predicted mathematically, in\n1931\n, that conservation laws required the existence of a new particle which he proposed to call the \"neutron\". He first mentioned his theoretical evidence for this particle in a letter written on\n4\nDecember\n1930\nand his public announcement came at a conference in Pasadena on\n16\nJune\n1931\n. The New York Times of\n17\nJune reported:-\nA new inhabitant of the heart of the atom was introduced to the world of physics today when Dr W Pauli of the Institute of Technology in Zürich, Switzerland, postulated the existence of particles or entities which he christened \"neutrons\".\nThe existence and properties of the particle were still not clear to Pauli, however, and it was not until\n1933\nthat he published his prediction in print. At that time he made the claim, for the first time, that the particle had zero mass. The particle which we now know as the neutron had been discovered by Chadwick in\n1932\n. Pauli's particle was named the neutrino by\nFermi\nin\n1934\nand at that time he correctly stated that it was not a constituent of the nucleus of an atom. It was later found experimentally.\nThis period of scientific discovery by Pauli coincided with a period of increasing personal difficulties for him. Perhaps as a consequence of his disastrous marriage, he began drinking and as a result consulted the psychologist Carl Gustave Jung. He was not treated by Jung, rather it was one of his assistants who helped Pauli. However, Pauli detailed over\n1000\ndreams which he sent to Jung over many years and Jung published work based on some of the dreams. Pauli clearly believed in psychology as much as he did physics. He wrote later in his life in a letter to Pais\n(\nsee for example\n[\n21\n]\n)\n:-\nIt is my personal opinion that in the science of the future reality will neither be \"psychic\" nor \"physical\" but somehow both and somehow neither.\nThings went better for Pauli after he married Franciska Bertram on\n4\nApril\n1934\n. In contrast with his first disastrous marriage his second marriage proved a great support to him. After his death, Franciska Pauli said this of her late husband:-\nHe was very easily hurt and therefore would let down a curtain. He tried to live without admitting reality. And his unworldliness stemmed precisely from his belief that this was possible.\nIn\n1931\nPauli was Visiting Professor at the University of Michigan, then in\n1935\n-\n1936\nhe was Visiting Professor at the Institute for Advanced Study, Princeton. He returned to Zürich but after the Second World War broke out in\n1939\nhe found himself in an awkward situation since Germany, having annexed Austria in\n1938\n, had made him a German citizen. In\n1940\nhe was greatly relieved to receive an offer from Princeton and he was appointed to the chair of theoretical physics there, spending\n1941\nas Visiting Professor at the University of Michigan, and\n1942\nas Visiting Professor at Purdue University.\nPauli worried that fascism might bring about the end of scientific life in Europe. For this reason he actively encouraged scientific developments in the United States and also in the Soviet Union. He was keen to participate in conferences in the Soviet Union, attending the All-Union physics conference in Odessa in\n1939\nand the All-Union physics conference in Moscow in\n1937\n. Pauli also tried to encourage those scientists who could remain in Italy and Germany to do so, for he believed this might ensure that scientific culture survived after the War. Pauli did not remain in the United States but he returned to Zürich after World War II. It was not an easy decision for him but basically he always felt European and never quite felt that he fitted into life in the United States.\nPauli was awarded the Nobel Prize in\n1945\nfor his:-\n... decisive contribution through his discovery in\n1925\nof a new law of Nature, the exclusion principle or Pauli principle.\nHe had been nominated for the prize by\nEinstein\n. He did not go to Stockholm for the prize ceremony in\n1945\nbut there was a special ceremony at Princeton for him on\n10\nDecember. In Stockholm Professor I Waller delivered a presentation speech in Pauli's absence. He explained the importance of the exclusion principle:-\nPauli based his investigation on a profound analysis of the experimental and theoretical knowledge in atomic physics at the time. He found that four quantum numbers are in general needed in order to define the energy state of an electron. He then pronounced his principle, which can be expressed by saying that there cannot be more than one electron in each energy state when this state is completely defined. Three quantum numbers only can be related to the revolution of the electron round the nucleus. The necessity of a fourth quantum number proved the existence of interesting properties of the electron.\nOther physicists found that these properties may be interpreted by stating that the electron has a \"spin\", i.e. that it behaves to some extent as if it were rapidly rotating round an axis through its centre of gravity.\nPauli showed himself that the electronic configuration is made fully intelligible by the exclusion principle, which is therefore essential for the elucidation of the characteristic physical and chemical properties of different elements. Among those important phenomena for the explanation of which the Pauli principle is indispensable, we mention the electric conductivity of metals and the magnetic properties of matter.\nIn\n1925\nand\n1926\nessential progress of another kind was made in the quantum theory, which is the foundation of atomic physics. New and revolutionary methods were developed for the description of the motion of particles.\nThe spin proposal, which gave meaning to Pauli's fourth quantum number, was first suggested by\nUhlenbeck\nin\n1925\n. Pauli delivered his Nobel Lecture in Stockholm on\n13\nDecember in the following year.\nIn\n[\n20\n]\nLaurikainen writes about other directions which Pauli's work took him in the years following World War II:-\nDuring the last\n10\n-\n15\nyears of his life, Pauli spent much time studying the history and philosophy of science. His starting point was the philosophy of quantum mechanics, but this led him to psychology, the history of ideas and many other fields, not least the relation of religion to natural science.\nPauli received many honours for his work in addition to the Nobel Prize. He was elected a Fellow of the\nRoyal Society of London\nin\n1953\nand he was also elected a member of the Swiss Physical Society, the American Physical Society, and the American Association for the Advancement of Science. He was awarded the\nLorentz\nMedal in Amsterdam in October\n1931\n.\nThe author of\n[\n3\n]\nwrites:-\n... he had a genius of fastening on some one point which could be made simple, and so presented was seen at once to be important. That was the quality of his genius - and the simplicity that was in his nature as well as in his thinking made him also well loved.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}