{
  "nome_completo": "William Woolsey Johnson",
  "nome_curto": "Woolsey Johnson",
  "ano_nascimento": "1841",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Johnson_Woolsey/",
  "lugar_nascimento": "Owego, Tioga County, New York,USA",
  "lugar_morte": "Baltimore, Maryland, USA",
  "biografia": "Woolsey Johnson\n's parents were Charles Frederick Johnson\n(1804\n-\n1882)\nand Sarah Dwight Woolsey\n(1805\n-\n1870)\n. Charles Johnson was a gentleman farmer in Tioga County, the son of Robert Charles Johnson\n(1766\n-\n1806)\nand Catherine Anne Bayard\n(1770\n-\n1806)\n. Sarah Woolsey  was the daughter of William Walton Woolsey\n(1766\n-\n1839)\n, a New York merchant who imported sugar, cotton and hardware, and Elizabeth Dwight\n(1772\n-\n1813)\n. Sarah had an older brother, Theodore Dwight Woolsey\n(1801\n-\n1889)\n, who was the President of Yale College from\n1846\nto\n1871\n. Charles and Sarah Johnson were married on\n23\nApril\n1835\n. Charles Johnson had graduated from Union College in\n1823\nand then attended the Litchfield Law School. However, he inherited much land from his father and, a couple of years after his marriage, the family settled on his\n200\n-acre farm Meadow Bank on the west bank of the Owego Creek. Charles and Sarah Johnson had six children: Charles Frederick Johnson was born on\n8\nMay\n1836\n, graduated B.A. from Yale in\n1855\n, became a Civil Engineer and was appointed Professor of Mathematics at the Naval Academy at Annapolis in\n1866\n; Susan Johnson was born on\n28\nDecember\n1838\nbut only lived for five months; Anna Muirson Johnson was born in\n1840\nand married William Bellamy from Boston, Massachusetts, in\n1876\n; William Woolsey Johnson, the subject of this biography, was born in\n1841\n; Catherine Livingston Bayard Johnson was born in\n1845\n; and Nicholas Bayard Johnson was born in\n1849\n(\ndied young\n)\n.\nThe Johnson family were well-off and they had their son Woolsey\n(\nas he liked to be known\n)\ntutored privately to prepare him for College. He entered Yale College in New Haven, Connecticut in\n1858\n. This College was renamed Yale University in\n1864\n, two years after Johnson graduated with a B.A. He was awarded first prize in mathematics in his first year of study and continued to excel winning the prize for mathematical solutions in his second year. He continued to win prizes in his Junior and Senior years and graduated with a B.A. in\n1862\n. During his four years at Yale College, Johnson wrote letters to his parents, his sister Katherine, and his brother Charles. Many of these letters survive and are held in the Manuscripts and Archives of the Sterling Memorial Library of Yale University.\nAfter Johnson graduated, in\n1862\nhe was appointed as an assistant in the Nautical Almanac office in Cambridge, Massachusetts. He held this position for two years before being appointed as an assistant professor of mathematics at the U.S. Naval Academy at Newport, Rhode Island in\n1864\n. He was only one year at Newport since in\n1865\nthe U.S. Naval Academy moved to Annapolis where he worked until\n1870\n. Johnson married Susannah Leverett Batcheller\n(1850\n-\n1916)\non\n12\nAugust\n1869\n, in Annapolis. Susannah was the daughter of the Rev. Breed Batcheller and Sarah Miller Leverett, a descendant of John Leverett, Governor of Massachusetts. Woolsey and Susannah Johnson had two children: Charles William Leverett Johnson, born at Gambier, Ohio,\n12\nAugust\n1870\n; and Theodore Woolsey Johnson, born at Owego,\n4\nJune\n1872\n. We will say a little more about the two sons below. In the year that Johnson married,\n1869\n, he published the first of a number of textbooks,\nAn Elementary Treatise on Analytical Geometry, embracing Plane Coordinate Geometry and an Introduction to Geometry of Three Dimensions\n. This book is described as:-\n... designed as a textbook for colleges and scientific schools.\nSee\nTHIS LINK\nfor the Preface to this book.\nIn\n1870\nJohnson moved to Kenyon College in Gambier, Ohio. Kenyon College, the oldest private college in Ohio, was founded in\n1824\n. Johnson and his wife were already living in Gambier when their first child was born in August\n1870\n. He spent two years at Kenyon College before moving to Annapolis in\n1872\nwhen he was appointed as a professor of mathematics at St John's College. This College had been founded in\n1784\nbut it had closed during the American Civil War when it was badly damaged. It had reopened in\n1866\n, six years before Johnson took up his position there. It continued to operate a very traditional approach to education with a fixed course which all students followed. Johnson began to collaborate with John Minot Rice, a professor of mathematics in the United States Navy and, in\n1874\n, they produced the First Part of their work\nAn Elementary Treatise on the Differential Calculus founded on the Method of Rates or Fluxions\n. This was:-\nPrinted for the use of the Cadets at the U.S. Naval Academy.\nThe authors write in the Preface:-\nThe mode of teaching the Differential Calculus introduced in these pages has been used by the authors for several years past, in the instruction of their classes, with unusually satisfactory results. The treatise, of which this is the first part, will be completed and published as soon as possible; it is designed to embrace all the topics usually found in textbooks on this subject, and to fit the student for the study of treatises in which application is made of the Calculus to physical research.\nIndeed, they did complete and publish the work in\n1879\n. You can read the Preface of the finished work at\nTHIS LINK\n.\nClearly with Johnson in Annapolis where he had previously worked with the U.S. Naval Academy, he could continue to keep his links with the Academy despite teaching at St John's College. For example, as we have just seen, he was collaborating with a mathematician in the United States Navy and writing works for Cadets at the Academy. It is perhaps only a natural progression, therefore, that he should move to the U.S. Naval Academy at Annapolis in\n1881\n. He continued in this post until he retired in\n1921\n. However, he did make several trips abroad in the summer vacations and spent a full year sabbatical at the University of Cambridge in England in the academic year\n1886\n-\n1887\n. This full year included both the summer of\n1886\nand the summer of\n1887\n. The whole Johnson family went with him to Cambridge where to took a house for the year. It was during this year at Cambridge that he wrote his book\nA Treatise on Ordinary and Partial Differential Equations\n. The Preface of this book is given at\nTHIS LINK\n.\nWe promised above to give some more details of Johnson's sons. Charles William Leverett Johnson\n(1870\n-\n1954)\nwas awarded a B.A. from Johns Hopkins University in\n1891\nand then continued to study there for a Ph.D. He was awarded his Ph.D. from Johns Hopkins in\n1896\nfor his thesis\nMusical Pitch and the Measurement of Intervals Among the Ancient Greeks\n.  After Johnson had received a letter of congratulations following his son receiving his doctorate, he replied:-\nThanks for your congratulation concerning my boy. I am glad to say he is his mother's boy, but he has mathematics enough in him to have written his thesis on the mathematical theory of music as it appears in the old Greek philosophers, Musical Pitch and the Measurement of Intervals among the Ancient Greeks. A friend critic wrote him a private letter, congratulating him on being at once \"a musician, a mathematician, and a Hellenist.\" - You see I am getting garrulous, if you will accept bragging of his boys as a test of garrulity. - My other boy is more in my own line, as an engineer.\nIn fact Charles Johnson became an Instructor in Greek at Yale University publishing his thesis and the book\nThe motion of the voice: In the theory of ancient music\n(1899)\n. Johnson's younger son, Theodore Woolsey Johnson\n(1872\n-\n1953)\n, was as he said in the above quote, more in his own line. He was awarded a B.A. from Johns Hopkins in\n1892\nafter which he went to the Stevens Institute where he received an M.E. in\n1896\n. He became a Steel Inspector for the U.S. Navy in\n1898\n. In\n1910\nhe published, in collaboration with Frank William Bartlett, the book\nEngineering Descriptive Geometry\n. The authors begin their Preface as follows:-\nThe aim of this work is to make Descriptive Geometry an integral part of a course in Mechanical or Engineering Drawing. The older books on Descriptive Geometry are geometrical rather than descriptive. Their authors were interested in the subject as a branch of mathematics, not as a branch of drawing. Technical schools should aim to produce engineers rather than mathematicians, and the subject is here presented with the idea that it may fit naturally in a general course in Mechanical Drawing.\nJohnson was one of the founders of\nNew York Mathematical Society\nin\n1888\n. We see something of his character in his article in the October\n1891\npart of the\nBulletin\nof that Society where he wrote:-\nAs there is no doubt that our ancestors originated the decimal system by counting on their fingers, we must, in view of the merits of the octonary system, feel profound regret that they should have perversely counted their thumbs, although nature has differentiated them from the fingers sufficiently, she might have thought, to save the race from this error.\nThe\nNew York Mathematical Society\nbecame the\nAmerican Mathematical Society\nin\n1894\nand Johnson served on the AMS Council. He was a member\nLondon Mathematical Society\n, a corresponding member of the\nBritish Association for the Advancement of Science\nand a Fellow of American Association for the Advancement of Science.\nLet us say a little more about Johnson's mathematics. We refer the reader to\nTHIS LINK\nand  for Prefaces to Johnson's books. The reader will see from these Prefaces that Johnson's approach was somewhat old-fashioned for the time in which he wrote but, of course, we must remember that basically he was writing to teach mathematics to U.S. Navy cadets. For example,\nG H Hardy\nreviewing\nA Treatise on the Integral Calculus, founded on the Method of Rates\nwrites\n[\n4\n]\n:-\nIt is no disparagement of Professor Johnson's book to say that it might have been written thirty years ago. It is a book of a frankly old-fashioned type, another\nTodhunter\nor Williamson. It may be better or worse than\nTodhunter\n; on the whole we prefer it to\nTodhunter\n: but it is with such books as\nTodhunter\nthat we must compare it. We must not be understood as implying that Professor Johnson's book may not be of considerable utility. There is plenty of room for an improved\nTodhunter\n.\nIn fairness to Johnson, the book\nG H Hardy\nis reviewing is a\n1907\nversion of a book that Johnson did write over\n20\nyears earlier! Here is a review of\nA Treatise on Ordinary and Partial Differential Equations\nwhich was published in the year the book was written\n[\n1\n]\n:-\nThis treatise on differential equations is in continuation of the series of mathematical textbooks, by the same author, of which have already appeared the differential and integral calculus. Professor Johnson is professor of mathematics at the United States Naval Academy at Annapolis, and it may be that some will trace in the book methods which are said to be characteristic of the United States Army and Navy mathematics; but it must be said that the plan pursued is likely to lead to a clearer understanding by the student. The object is to give a knowledge of the subject, so far as it is likely to have practical application; and in this it is safe to say that Professor Johnson has succeeded.\nCassius Jackson Keyser\n(1862\n-\n1947)\n, reviewing\n(\na late abridged edition of\n)\nAn Elementary Treatise on the Differential Calculus founded on the Method of Rates\nmany years after it was first written, does take a rather \"American\" approach\n[\n5\n]\n:-\nProfessor Johnson's book is an abridgment of his \"Differential Calculus\" and is based on the method of rates. It is distinguished by the absence of the histological methods of the rigorists. Things are presented pretty much at their face values, being shown graphically rather than laboriously proved by help of the refined logical machinery brought in from across the sea. The English is excellent, everything moves along with the calmness, dignity and facility of an elder day, and the reader, while acquiring much useful knowledge, will acquire also a degree of confidence that in these critical times is apt to be rare and is apt also to suffer mitigation in the course of subsequent study.\nThe anonymous reviewer\n[\n2\n]\nis full of praise:-\nWhen a mathematician of eminence undertakes thus to provide a treatise upon a subject of importance, and compiles a text-book, for young students, not only the youth who is thus provided with a text-book but the whole world of observers employing such methods become more indebted to him than to the less distinguished and less talented man doing similar work; we have the assurance, not only that the book will serve its purpose, but that it represents the latest and best thought and labour of the time. This assurance is worth much to teacher and pupil; and it can hardly be doubted that the use of this little treatise will extend beyond the limits of the United States Naval Academy, where it was originally intended by its author to be used, in his own classes.\nThe Analyst\n, founded and edited by\nJoel E Hendricks\n, was published between\n1874\nand\n1883\n. Johnson published many notes and minor papers in\nThe Analyst\nincluding:\nBipolar Equations-Cartesian Ovals\n(1875)\n;\nThe Peaucellier Machine and Other Linkages\n(1875)\n;\nParadox for Students in Analytical Geometry\n(1875)\n;\nOn the Distribution of Primes\n(1875)\n;\nTheory of Parallels\n(1876)\n;\nOn the Expression\n0\n0\n(1876)\n;\nRecent Results in the Study of Linkages\n(1876)\n;\nRecent Results in the Study of Linkages\n[\nContinued\n]\n(1876)\n;\nNote on Evaluation of Indeterminate Forms\n(1877)\n;\nClassification of Plane Curves with Reference to Inversion\n(1877)\n;\nSingular Solutions of Differential Equations of the First Order\n(1877)\n;\nPedal Curves\n(1877)\n;\nSymmetrical Functions of the Sines of the Angles Included in the Expression\na\n0\n+\n2\nk\nπ\nn\na_{0} + 2k \\large\\frac{\\pi}{n}\\normalsize\na\n0\n​\n+\n2\nk\nn\nπ\n​\n(1879)\n;\nNote on the Catenary\n(1879)\n;\nNew Notation for Anharmonic Ratios\n(1882)\n;\nNote on Anharmonic Ratios\n(1883)\n; and\nCircular Coordinates\n(1883)\n. When\nThe Analyst\nceased publication and was replaced by the\nAnnals of Mathematics\n, Johnson continued to publish there with papers such as:\nJames Glaisher's factor tables and the distribution of primes\n(1884)\n;\nThe kinematical method of tangents\n(1885)\n;\nOn Singular Solutions of Differential Equations of the First Order\n(1887)\n;\nOn singular solutions of differential equations of the first order\n(1887)\n;\nOn the differential equation\n(1887)\n;\nOn Monge's solution of the non-integrable equation between three variables\n(1888)\n; and\nOn Gauss's method of substitution\n(1892)\n.\nJohnson also published in the\nAmerican Journal of Mathematics\n. His\n1879\npaper with\nWilliam Story\nNotes on the \"\n15\n\" Puzzle\nis in two parts, the first by Johnson shows that the\n15\npuzzle is impossible using the odd/even permutation argument. He then gives a proof for non-mathematicians that:-\n... a permutation derived from a given one by an odd number of interchanges can never be produced by an even number of interchanges.\nThe second part of the paper by\nStory\ngives a generalisation to the\nn\n2\n−\n1\nn^{2} - 1\nn\n2\n−\n1\npuzzle. Another of Johnson's papers in this journal is\nThe Strophoids\n(1880)\n. He begins with a definition:-\nThe term Strophoid has been applied by French writers to a cubic curve, of which the symmetrical form has been discussed by Dr\nJames Booth\nunder the name of the Logocyclic Curve. As this curve is one of the class considered in this paper, and as the term Strophoid is appropriate to the mode of generation of the whole class, I have ventured to use the word in a more extended signification, and define the strophoid as the 'locus of the intersection of two straight lines which rotate uniformly about two fixed points in a plane'.\nJohnson also published several papers in the\nBulletin\nof the\nAmerican Mathematical Society\n.\nIn\n1913\nJohnson was given a commissioned rank in the Navy, by a special act of Congress, and when he retired in\n1921\nhe had the rank of Commodore. After he retired he went to Johns Hopkins University. His death in\n1927\nwas the result of bronchopneumonia. He was buried in Woodlawn Cemetery, Baltimore.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic"
  ]
}