{
  "nome_completo": "Yakov Matveevich Eliashberg",
  "nome_curto": "Yakov Eliashberg",
  "ano_nascimento": "1946",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eliashberg/",
  "lugar_nascimento": "Leningrad, USSR (now St Petersburg, Russia)",
  "lugar_morte": null,
  "biografia": "Yakov Eliashberg\nwas the son of Matvey Gerasimovich Eliashberg\n(1905\n-\n1968)\nand Amalya Yakovlevna\n(1908\n-\n1992)\n. Matvey Gerasimovich was born in Dvinsk\n(\nnow Daugavpils, Latvia\n)\nwhich was a city in the Russian Empire with almost\n50\n% of the population, like his family, being Jewish. In\n1907\n, when he was two years old, his family moved to Saint Petersburg. He trained as a chemist and in\n1934\nbecame the first director of the Krasnokamsk pulp mill. He then worked as deputy director of the Central Research Institute of Pulp and Paper Industry in Leningrad. Note that Saint Petersburg was renamed Leningrad in\n1924\n. Matvey Gerasimovich and Amalya Yakovlevna had three sons, Gerasim Matveevich Eliashberg\n(1930\n-\n2021)\n, Victor Matveevich Eliashberg\n(\nborn\n1933)\nand Yakov Matveevich Eliashberg, the subject of this biography.\nYakov Matveevich was very aware of the difficulties presented to Jews living in Russia when he was growing up since his elder brothers both had great difficulties with their university studies. Both brothers entered university when the Soviet leader Joseph Stalin was putting anti-Semitic policies in place. For example, Gerasim Matveevich graduated from Leningrad State University in\n1952\nbut was not able to go on to graduate studies and had to work in a factory. It was not until\n1959\n, when conditions for Jews were much better, that he was able to begin studying for a doctorate in theoretical physics.\nWhen Yakov Matveevich was a young boy he was certain that he wanted to have a career playing the violin. He was good at mathematics when at school, so when he was in the\n6\nth grade he was put in for the Mathematical Olympiad competition in Leningrad. He did not prepare for the competition but still did well. As a consequence, he was invited to take part in a \"mathematical circle\" run by Nina Mefantevna Mitrofanova, the wife of the geometer Yuri Dmitrievich Burago. Nina Mitrofanova was a statistician who wrote a number of papers with\nYu V Linnik\n. She trained students to answer Olympiad type questions in the mathematical circle known as the Leningrad Palace of Pioneers. Also attending this mathematical circle was\nYuri Vladimirovich Matiyasevich\nwho later became famous for finding a negative solution of\nHilbert\n's tenth problem. Training to solve problems meant that by the time Yakov was in the\n8\nth grade he would go to Mathematical Olympiad competitions and, as soon as he saw the problems, he would know how to approach them since he would have seen similar ones before.\nThe Russian system had special schools for talented students which they entered after completing the\n8\nth grade. Eliashberg now had to make what for him was an incredibly difficult decision, whether to go to a specialist mathematics and physics school, or to go to a specialist music school. After a period of suffering indecision, he chose mathematics. He graduated from the specialist School of Physics and Mathematics No\n239\nin\n1964\nto answer Olympiad type questions. Following the death of Joseph Stalin in\n1953\nlife for Jews became very much better and Eliashberg had no problems entering Leningrad State University to study mathematics. The undergraduate course was for five years, with the first degree being a Master's Degree\n(\nequivalent to a Ph.D.\n)\n.\nMikhael Leonidovich Gromov\nwas three years older than Eliashberg and entering his final undergraduate year when Eliashberg began his studies. As he progressed through university, Eliashberg began attending\nVladimir Abramovich Rokhlin\n's seminar.\nRokhlin\nhad been a student of\nAndrei Nikolayevich Kolmogorov\nand\nLev Semenovich Pontryagin\n, and by this time was the research advisor of\nGromov\n.\nAfter the award of his Master's Degree, Eliashberg wanted to enter graduate school and study to become a university teacher which required a doctorate\n(\nequivalent to the\nhabilitation\n)\n. He required a recommendation from his undergraduate teachers before he could apply, but this was easily obtained. In\n1967\n, however, the Arab-Israeli Six-Day War led to a period of rapidly increasing anti-Semitism in the Soviet Union. When Eliashberg tried to enter graduate school in\n1969\n, many university staff were trying to make it difficult for Jewish students to enter. The method they used was to fail students on the entrance examination on the history of the communist party. Eliashberg, like all students, had been forced to study the history of the communist party for all five of his undergraduate years\n[\n12\n]\n:-\nThis was of course an extremely political examination, and they could really manipulate whatever they wanted, because it was not the question of your knowledge but the question of interpretation. You could be accused that your point of view was wrong. They tried to fail me and I was saved only by Professor Nina Uraltseva. She was the representative of the mathematics department on this political committee, and she blocked the attempt to fail me, so I got some low but passing grade.\nWe note that Nina Nikolaevna Uraltseva\n(\nborn\n1934)\nhad been awarded a doctorate in\n1960\nadvised by\nOlga Ladyzhenskaya\n, was appointed to Leningrad State University in\n1959\n, and promoted to professor in\n1968\n. She had been awarded the\nChebyshev\nPrize by the\nUSSR Academy of Sciences\nin\n1967\nand had received the USSR State Prize in\n1969\n. Although she succeeded in preventing the committee failing Eliashberg, he had to pay a price for his being admitted to graduate school. He said\n[\n17\n]\n:-\nI was admitted with a catch requiring that after I finish my degree, I would go as far as possible away from Leningrad, to Siberia or the Soviet far east.\nHis graduate studies went very well. Like\nGromov\n, his research advisor was\nRokhlin\nand, when Eliashberg began proving interesting results,\nRokhlin\nadvised him to talk to\nGromov\n. This proved very productive, and they collaborated trying to find more results which generalised different theorems each were proving using similar techniques. Eliashberg's first publications were:\nOn singularities of folding type\n(1970)\n;\n(\nwith\nM L Gromov\n)\nNonsingular mappings of Stein manifolds\n(1971)\n;\n(\nwith\nM L Gromov\n)\nRemoval of singularities of smooth mappings\n(1971)\n;\n(\nwith\nM L Gromov\n)\nConstruction of nonsingular isoperimetric films\n(1971)\n; and\nMappings with a given singularity\n(1971)\n. All of these were written in Russian and published before he graduated with his doctorate in\n1972\nwith his thesis\nSurgery of Singularities of Smooth Mappings\n.\nIt was clear that Eliashberg was a brilliant young mathematician and Georgii Ivanovich Petrashen\n(1914\n-\n2004)\n, the director of the Leningrad branch of the\nSteklov\nInstitute for Mathematics, wanted to be able to employ him at the Institute and not have him sent to a distant part of Russia. Petrashen, who had created a world-leading school of dynamic elasticity and theoretical seismology, had also been responsible for establishing the School of Physics and Mathematics No\n239\nwhich Eliashberg had attended\n[\n17\n]\n:-\nGeorgii Petrashen courageously prioritised merit over ideology and made an attempt to hire Eliashberg. However, the\nSteklov\nInstitute director forbade branch directors from hiring Jews without his personal permission. Several times during that year Petrashen visited Moscow, planning, among other things, to discuss Eliashberg's employment with\nSteklov\n's director, but each time he found the moment to be inopportune. When time finally ran out and the conversation could be postponed no longer, Petrashen summoned the courage to advocate for Eliashberg. His courage was punished with a one-week confinement in a mental hospital.\nEliashberg work was recognised by the\nLeningrad Mathematical Society\nthat awarded him the Young Mathematician Prize in\n1972\n:-\n... for a number of works on global singularity theory.\nSyktyvkar is located on the Sysola River in the Komi Republic of Russia about\n1500\nkm east of Saint Petersburg. Stalin had sent political exiles to prisoner camps there and there was still some of these in\n1972\n. The city, however, had grown rapidly almost doubling in size between\n1960\nand\n1970\nwhen it reached a population of\n125\n,\n000\n. Syktyvkar State University was founded there in\n1972\nso, given that he was to be sent far from Leningrad, it was a natural place for Eliashberg to be sent after the award of his doctorate. He explained\n[\n12\n]\n:-\nSyktyvkar was a normal city, and they just founded a new university there. The rector of this university was a woman, and Leningrad University was assigned the role of a senior university by the party bosses, supervising the new one, so they were obliged to send some people there. Of course, I was just finishing and getting my doctorate at that time, so the Syktyvkar rector picked me to go there, and I worked there for\n7\nyears.\nAlthough he had no choice in being sent to Syktyvkar State University, in fact it was quite a good place to work. Housing, which was a major problem throughout the Soviet Union at this time, was not a problem for those staff arriving at the new university since there were two newly built housing complexes for staff. Certainly Eliashberg published little during his seven years at Syktyvkar State University. In\n1977\nhe published\nSurgery of singularities of foliations\nwhich he jointly authored with Nikolai M Mishachev who was undertaking research for his doctorate at Leningrad State University advised by\nRokhlin\nand Eliashberg. The paper was reviewed by\nGromov\nwho had left the Soviet Union in\n1974\nand was at the State University of New York at Stony Brook. He wrote:-\nThe authors develop a new general technique for constructing foliations of codimension ≥\n2\non closed manifolds. They extend the\nThurston\nexistence theorem to families of foliations. The approach is based on the surgery technique developed by the second author in 'Surgery of singularities of smooth mappings'\n(1972)\n.\nWe note that Nikolai Mishachev was awarded his doctorate in\n1980\nfor his thesis\nFlags of Foliations\n.\nAlthough Eliashberg's career had been affected by anti-Semitism, up to the mid\n1970\ns he had done well and had become chairman of the Mathematics Department at Syktyvkar State University. Around\n1975\nhis brother Victor Matveevich Eliashberg and their mother Amalya Eliashberg, who were living together, decided they wanted to emigrate to the United States. They tried to convince Yakov Matveevich to emigrate with them but, after a lot of thought, because he felt leaving meant that he would never again see friends and family who remained behind, he decided to remain at Syktyvkar. Victor and Amalya Eliashberg emigrated to the United States arriving in New York on\n27\nApril\n1976\n. They then went to California and in December\n1981\n, when living at\n3450\nMurdoch Court, Palo Alto, Santa Clara, California, both applied for American citizenship; this was granted on\n27\nSeptember\n1983\n. In the interview\n[\n12\n]\nEliashberg explained how this impacted his position at Syktyvkar State University:-\n... when they left, then gradually it became known to the university administration that my brother's family had emigrated. I was then the chairman of the mathematics department, and my position became extremely weak, because the role of the chair is to fight with the administration, but whenever I would start a fight, the Rector would say \"why are you listening to him, he has relatives living in California and waiting for him.\" In any case, then I with my wife\n[\nAdasa\n]\ndecided that we will also go. I resigned from the university\n[\nin\n1979]\nand returned to Leningrad and applied for emigration, but it was already the wrong time because the Russian war in Afghanistan started soon after. After that all emigration practically stopped.\nHe returned to Leningrad but after his application for emigration was refused, Eliashberg became a \"refusnik\". He was not allowed to teach in universities and for a while he worked as a night watchman at a car garage, and had a temporary job as a substitute school teacher. This involved a little infrequent work which did mean that he was still able to undertake some mathematical research and attend mathematics seminars. In\n1980\n, with the help of a friend, he found a job in a company which was developing accounting software. It provided an income sufficient for food, clothes and their apartment but nothing was left over after that. It was a demanding job for Eliashberg so he had little opportunity to keep up his research. Despite this, however, he was an invited speaker in the Geometry Section of the International Congress of Mathematicians held in Berkeley, United States, in August\n1986\n. He, like many other Soviet mathematicians, was not allowed to attend the Congress.\nJürgen Moser\n, President of the International Mathematical Union, said in his opening remarks to the Congress:-\nIt was a great disappointment for all of us that many of the invited speakers from the Soviet Union did not come to Berkeley; in fact, almost half of the Soviet speakers were not present. This is a serious loss for everybody concerned and defeats the purpose of the Congress. It is most important for any Congress that the invited speakers are able to attend in order to deliver their lecture in person and to take part in the exchange of ideas. We are aware that our Soviet colleagues worked very hard at resolving this problem, and we appreciate their efforts. Also, most of the manuscripts of the absent speakers were made available and could be presented by other mathematicians.\nEliashberg's paper\nCombinatorial Methods in Symplectic Geometry\nwas read by John Norman Mather\n(1942\n-\n2017)\n, a professor at Princeton. Eliashberg's address on the paper is 'Institute of Accounting, Leningrad, USSR'. The paper had the following Abstract:-\nGraphs arise when studying many problems of symplectic and contact topology. Sometimes the structure of the graphs can be investigated and this delivers deep results towards \"rigidity\" of contact and symplectic structures. In this report I shall discuss two such combinatorial reductions in the simplest situation.\nIn March\n1985\nMikhail Gorbachev was elected General Secretary and a process of liberalisation began in the Soviet Union. This allowed Eliashberg to make an application to emigrate to the United States and he did so in\n1988\n, going to California to meet up with his brother Victor and his mother Amalya. He had been able to continue with his mathematical research under very difficult circumstances and, for example, had published\nA theorem on the structure of wave fronts and its application in symplectic topology\n(\nRussian\n)\nin\n1987\n. Izu Vaisman wrote in a review of this paper:-\nIt has been known for several years that the author made a breakthrough in symplectic geometry by establishing global rigidity properties for symplectic and contact manifolds. The present paper publishes a part of the corresponding proofs.\nHe was able to attend the conference on Differential Geometry and Topology held at Cala Gonone, Sardinia on\n26\n-\n30\nSeptember\n1988\nand delivered\nThree lectures on symplectic topology in Cala Gonone. Basic notions, problems and some methods\n. Tudor Stefan Ratiu writes on the resulting Proceedings paper:-\nThis is a set of three lectures given by the author at a conference. They form a superb introduction to the ideas and questions of symplectic and contact topology. The reader is taken on a guided tour of all major ideas with a lot of motivation and ideas of proofs. The key questions in this fast developing field are clearly stated and their importance relative to other branches of mathematics is highlighted.\nIn\n1989\nEliashberg was appointed as Herald L and Caroline L Ritch Professor of Mathematics at Stanford University. He was awarded a Guggenheim Fellowship in\n1995\nand was elected to the\nNational Academy of Sciences\nin\n2003\n. When elected to the\nNational Academy of Sciences\nhe gave the following description of his research interests\n[\n29\n]\n:-\nSymplectic geometry serves as a geometric language of classical and quantum mechanics. I was lucky to witness the birth, and participate in the first steps of symplectic topology, a branch of symplectic geometry designed to answer qualitative problems in mechanics, such as the existence of periodic orbits. A tightly related topic of my research is contact geometry and topology, inspired by problems in geometric optics and non-holonomic mechanics. Problems in symplectic topology led me to the theory of functions of several complex variables, where I was able to find a complete topological characterisation of affine complex manifolds. One of the most important techniques, the theory of pseudo-holomorphic curves, was introduced into symplectic topology by\nM Gromov\n.\nGromov\n-\nWitten\ntheory combines\nGromov\n's theory with a physics inspired algebraic formalism of\nE Witten\n. Together with H Hofer and A Givental, I recently began to develop an enhanced version of the\nGromov\n-\nWitten\ntheory, called symplectic field theory\n(\nSFT\n)\n. The SFT has already found many applications and we hope that many more are yet to come, particularly in such seemingly unrelated areas as the theory of completely integrable systems and low-dimensional topology.\nHe was elected a fellow of the\nAmerican Mathematical Society\nin\n2012\nand elected to the\nAmerican Academy of Arts and Sciences in\n2021\n. He has been awarded honorary doctorates from the École Normale Supérieure de Lyon, France in\n2009\nand from the Uppsala University, Sweden in\n2017\n. He has received four major international prizes. He received the\nOswald Veblen\nPrize in Geometry in\n2001\n[\n1\n]\n:-\n... for his work in symplectic and contact topology.\nHe was awarded the\nHeinz Hopf\nPrize in\n2013\n[\n13\n]\n:-\nYakov Eliashberg is a leading mathematician who has made exceptional achievements in what is currently one of the most active areas of research in mathematics. Without the work of Eliashberg, symplectic topology and contact topology would not even exist in their current form.\nHe was awarded the Crafoord Prize in Mathematics in\n2016\n[\n20\n]\n:-\n... for the development of contact and symplectic topology and ground-breaking discoveries of rigidity and flexibility phenomena.\nIn\n2020\nhe was awarded the Wolf Prize in Mathematics\n[\n32\n]\n:-\n...  for his foundational work on symplectic and contact topology changing the face of these fields, and for his ground-breaking contribution to homotopy principles for partial differential relations and to topological foundations of multi-dimensional complex analysis.\nFor more information about these four major awards to Eliashberg, see\nTHIS LINK\n.\nYakov Eliashberg has published three exceptional monographs, each with a different co-author. With\nWilliam P Thurston\n, he published\nConfoliations\nin\n1998\n. In\n[\n9\n]\nHansjörg Geiges describes the book as:-\n... a veritable cornucopia of ideas and surprising links between contact geometry and the theory of foliations.\nWith Nikolai Mishachev, he published\nIntroduction to the h-principle\nin\n2002\n. John B Etnyre writes\n[\n7\n]\n:-\nThe h-principle has been a useful way to prove, or interpret prior proofs of, results in topology and geometry. This book describes many of these applications with a specific emphasis on symplectic and contact geometry and various embedding and immersion theorems. In addition one can find a good introduction to the literature.\nWith Kai Cieliebak, he published\nFrom Stein to Weinstein and back. Symplectic geometry of affine complex manifolds\nin\n2012\n. Alexandru Oancea writes\n[\n15\n]\n:-\nThe book under review is a landmark piece of work that establishes a fundamental bridge between complex geometry and symplectic geometry. It is both a research monograph of the deepest kind and a panoramic companion to the two fields.\nFor more information about these three books, see\nTHIS LINK\n.\nEliashberg had been unable to attend the International Congress of Mathematicians in\n1986\nbut when he received a second invitation to speak in the Differential Geometry and Global Analysis Section of the International Congress of Mathematicians in Berlin in\n1998\nhe was able to attend and deliver his address\nInvariants in Contact Topology\n. The lecture had the following Abstract:-\nContact topology studies contact manifolds and their Legendrian submanifolds up to contact diffeomorphisms. It was born, together with its sister Symplectic topology, less than\n20\nyears ago, essentially in seminal works of D Bennequin and\nM Gromov\n. However, despite several remarkable successes the development of Contact topology is still significantly behind its symplectic counterpart. In this talk we will discuss the state of the art and some recent breakthroughs in this area.\nHe was invited to give a plenary lecture at the International Congress of Mathematicians in Berlin in\n2006\nwhen he gave the lecture\nSymplectic field theory and its applications.\nIt has the following Abstract:-\nSymplectic field theory\n(\nSFT\n)\nattempts to approach the theory of holomorphic curves in symplectic manifolds\n(\nalso called\nGromov\n-\nWitten\ntheory\n)\nin the spirit of a topological field theory. This naturally leads to new algebraic structures which seems to have interesting applications and connections not only in symplectic geometry but also in other areas of mathematics, e.g. topology and integrable PDE. In this talk we sketch out the formal algebraic structure of SFT and discuss some current work towards its applications.\nEliashberg has been invited to deliver many lecture series including: the Porter Lectures at Rice University in\n1992\n; the\nRademacher\nLectures at the University of Pennsylvania in\n1996\n; the\nMarston Morse\nLectures at the Institute for Advanced Study in\n1996\n; the Frontiers in Mathematics Lectures at Texas A&M University in\n1997\n; the Marker Lectures at Pennsylvania State University in\n2000\n; the\nAlfred Brauer\nLectures at the University of North Carolina, Chapel Hill in\n2001\n; the\nAlfred Clifford\nLectures at Tulane University in\n2004\n; the Roever Lectures at the University of St Louis in\n2008\n; the Joseph D'Atri Memorial Lectures at Rutgers University in\n2008\n; the\nKemeny\nLecture Series at Dartmouth College in\n2015\n; the Pinksy Lectures at Weinberg College in\n2018\n-\n19\n; and the\nChern\nLectures at the University of California Berkeley in\n2023\n. For the four\nChern\nLectures given the series title\nFlexible Mathematics\n, he gave the following Abstract:-\nFlexible mathematics was born in the work of\nHassler Whitney\nin\n1930\ns-\n1940\ns,\nStephen Smale\nand\nJohn Nash\nin\n1950\ns, and then greatly developed by\nMikhail Gromov\nin the late\n1960\ns-early\n1970\ns under the name of the h-principle. In recent years the area went through a period of renaissance. In the lectures there will be discussed the evolution of notions and methods of the h-principle and consider a few recent examples from complex, symplectic and contact geometries.\nFinally, let us note that when Eliashberg was asked about his hobbies in the interview\n[\n5\n]\nhe replied:-\nI like to travel, hiking, a lot of interesting things I would like to participate in. For example, in my childhood I played violin and planned to be a professional violinist. However, I changed to mathematics and now I do not play anymore, which is something I do regret a bit.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}