{
  "nome_completo": "Yulian-Karl Vasilievich Sokhotsky",
  "nome_curto": "Yulian Vasilievich Sokhotsky",
  "ano_nascimento": "1842",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sokhotsky/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Yulian Vasilievich Sokhotsky\n's parents were Iozefa Levandovska and Vasili Sokhotsky who was a clerk. Sokhotsky was brought up in Warsaw where he attended Warsaw State\nGymnasium\nfor primary education from\n1850\n. After graduating from the Gymnasium in\n1860\n, he enrolled in the Physics and Mathematics Faculty at the University of St Petersburg but he remained there for only one year before returning to Warsaw where he continued his university studies without the help of any teachers. He was awarded his first degree, a bachelor of mathematics, from the University of St Petersburg in\n1866\n. He submitted his Master's dissertation\nThe theory of integral residues with some applications\nto the University of St Petersburg as part of the requirement for a Master's Degree in\n1867\nand, after defending his thesis in the following year, he was awarded the degree. In this thesis Sokhotsky discussed the\nCauchy\nintegral and the theory of analytic functions, which he called \"single-valued\". Kechkic writes in\n[\n5\n]\n:-\nThe magister's thesis of Sokhotskii was the first research paper on complex analysis published in Russian. It contains many important results which were later ascribed to other mathematicians. First of all, there is the famous theorem on the behaviour of an analytic function in a neighbourhood of an essential singularity. This theorem was published by Sokhotskii\n(\nin his magister's thesis\n)\nand by\nCasorati\nin\n1868\n, whereas\nWeierstrass\npublished it eight years later - in\n1876\n. Furthermore, Sokhotskii was the first to apply the calculus of residues to\nLegendre\npolynomials. The credit for this procedure is usually given to\nHermann Laurent\n. Finally, the so-called\nPlemelj\nformulas are also due to Sokhotskii, who published them in his doctor's thesis in\n1873\n, that is to say\n35\nyears before\nPlemelj\n.\nFollowing the award of his Master's degree\n(\nessentially equivalent to a Ph.D.\n)\nhe began teaching at the University of St Petersburg. The courses he gave in\n1869\n-\n70\nincluded the first course on the theory of functions of a complex variable to be taught in that university. He received a doctorate from St Petersburg in\n1873\n. His doctoral dissertation\nOn definite integrals and functions with applications to expansion of series\nwas an early investigation of the theory of singular\nintegral equations\n. It investigated in detail\nCauchy\n-type integrals which played an important role in\nboundary value problems\nin the theory of functions of a complex variable. Youschkevitch writes\n[\n1\n]\n:-\nIn his doctoral thesis Sokhotsky continued his studies of\nspecial functions\n, particularly of\nJacobi\npolynomials and\nLamé\nfunctions. One of the first to approach problems of the theory of singular integral equations, Sokhotsky in this work considered important boundary properties of integrals of the type of\nCauchy\nand, essentially, arrived at the so-called formulas of\nI Plemelj\n(1908)\n.\nSokhotsky was appointed as an extraordinary professor after the award of his doctorate\n(\nessentially equivalent to the German\nhabilitation\n)\nand then became an ordinary professor at the University of St Petersburg in\n1883\n. From\n1875\nhe also held a position at the Institute of Civil Engineers\n[\n1\n]\n:-\nHis lectures, especially on higher algebra, the theory of numbers, and the theory of definite integrals, were extremely successful. Sokhotsky was elected vice-president of the Mathematical Society of St Petersburg in\n1890\nand succeeded V G Imshenetsky as president in\n1892\n.\nInfluenced by\nChebyshev\n, he studied special functions, in particular\nJacobi\npolynomials and\nLamé\nfunctions. He also wrote a number of papers on the theory of\nelliptic functions\nand on theta functions. His work is important in the development of the theory of functions, in particular having applications in the theory of\nhypergeometric series\nand\ndifferential equations\n. Other topics which Sokhotsky studied included\nZolotarev\n's theory of divisibility of\nalgebraic numbers\nin\nThe application of the principle of the greatest divisor to the theory of divisibility of algebraic numbers\n(1898)\n.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}