{
  "nome_completo": "Yurii Vasilevich Prokhorov",
  "nome_curto": "Yurii Vasilevich Prokhorov",
  "ano_nascimento": "1929",
  "ano_morte": "2013",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Prokhorov/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Yurii Vasilevich Prokhorov\n's father, Vasily Prokhorov, was a construction engineer. Several generations of the family had lived in Moscow and Yurii attended school there. However, he was only eleven years old in June\n1941\nwhen German armies invaded Russia. Yurii had completed four years of schooling at this time but was unable to continue attending school since his family were evacuated to Chistopol, the second largest town in Kazan province. This town, to which many were evacuated, was about\n800\nkm east of Moscow and considered safe from the German invasion which was approaching Moscow. Surprisingly, this proved an educational advantage to the young boy who had advanced greatly by the time the family returned to Moscow in\n1943\nwhen it was safe to do so\n[\n5\n]\n:-\nWhile in evacuation I had much time, and in two years studied the curriculum of four years so that I came to Moscow as a student of the eighth year. Also, in Moscow, I finished the two-year curriculum in one year, and in\n1944\ngraduated from high school.\nYurii fully intending to follow his father and become an engineer so in\n1944\n, after graduating from the high school, he entered the Bauman Moscow Higher Technical School which, since\n1989\n, has been known as the Bauman Moscow State Technical University. He took an analysis course given by\nAdolph Pavlovich Yushkevich\nwho had been Head of Mathematics there since\n1941\n.\nYushkevich\n's course quickly convinced Prokhorov that mathematics was the subject he loved rather than engineering. He began attending mathematics courses at Moscow University and, in the spring of\n1945\n, transferred his studies from the Higher Technical School to Moscow University.\nAt the University Prokhorov took courses in analysis and number theory. In particular he took a number theory course by\nAleksandr Osipovich Gelfond\nand, in the autumn of\n1946\n, he entered a new course entitled 'Supplementary Chapter of Analysis' given by\nAndrei Nikolaevich Kolmogorov\n. This course covered the foundations of\nfunctional analysis\n, measure theory and the theory of orthogonal series. At the same time\nKolmogorov\nbegan teaching a course on probability theory which Prokhorov also attended. He graduated in\n1949\nand immediately became a research assistant at the\nSteklov\nInstitute of Mathematics. He was awarded his diploma\n(\nequivalent to a Master's degree\n)\nfor his thesis\nOn the strong law of large numbers\n. He published the main results from this thesis as a paper and, in\n1949\n, he also published a joint paper with\nKolmogorov\nentitled\nOn sums of a random number of random terms\n. In\n1952\nhe defended his Candidate's dissertation on local limit theorems. He then began to look at\nProbability distributions in functional spaces\n, publishing a paper with this title in\n1953\nwhich examined sequences of probability measures on the\nBanach\nspace of continuous functions on a compact interval, and in\n1956\nhe submitted his dissertation for his Doctorate in the Physical and Mathematical Sciences.\nFollowing the award of his doctorate\n(\nessentially equivalent to the German\nhabilitation\n)\n, he taught at the Moscow Institute of Engineering Physics in the years\n1956\nand\n1957\n. In the following year he was appointed to the\nSteklov\nInstitute working under\nKolmogorov\nwho had been Head of the\nProbability Theory\nDepartment from its foundation in\n1938\n. Prokhorov recalled\n[\n5\n]\n:-\nWhen I came to the Institute, the head of its Probability Department was\nKolmogorov\n.\nSergi Bernstein\nworked here, although in another department, and\nAleksandr Khinchin\nand N V Smirnov worked in\nKolmogorov\n's department. Earlier,\nEvgeny Slutsky\nalso worked in the department, but by the time I came to the Institute, he had passed away.\nIn\n1960\nProkhorov succeeded\nKolmogorov\nas Head of Department, a position he continues to hold. In addition, Prokhorov also lectured at Moscow State University, being appointed to the Mechanics-Mathematics Department. In\n1958\nhe was made a professor but after the Department of Computational Mathematics and Cybernetics was formed in\n1970\nhe moved to that Department. He became Head the Mathematical Statistics Branch. For eighteen years,\n1969\n-\n1986\n, he was Deputy Director of the\nSteklov\nInstitute. In\n1966\nhe was elected a corresponding member of the\nUSSR Academy of Sciences\nand an Academician in\n1972\n. From\n1966\nto\n1989\nhe was Vice-Secretary of the Mathematics Department of the Academy.\nA summary of Prokhorov's mathematical contributions is given in\n[\n5\n]\n:-\nThe basic directions of his research are the theory of probability and mathematical methods in theoretical physics. He developed asymptotic methods in the theory of probability. In the area of the classical limit theorems, he studied the conditions of applicability of the strong law of large numbers and the so-called local limit theorems for sums of independent random variables. He proposed new methods for studying limit theorems for random processes; these methods were based on studying the convergence of measures in function space. He applied these methods to establish the limiting transition from discrete processes to continuous ones. He found\n(\nin\n1953\nand\n1956)\nnecessary and sufficient conditions for weak convergence in function spaces. He has several papers on mathematical statistics, on queuing theory and also on the theory of stochastic control.\nIn\n1967\n, in collaboration with Yurii A Rozanov, he published the\n500\n-page book in Russian\nProbability theory: Fundamental concepts, limit theorems, random processes\n. An English translation was published two years later. James G Wendell writes in a review of the Russian edition:-\nThis is a reference book on probability theory, which richly reflects both classical and modern developments. It contains some proofs and examples along with many references. Though emphasizing Russian contributions, others are not slighted. Chapter headings\n(\nslightly truncated\n)\nare as follows:\n(\nI\n)\nBasic concepts of the elementary theory;\n(\nII\n)\nSpaces and measures;\n(\nIII\n)\nFoundations;\n(\nIV\n)\nLimit theorems;\n(\nV\n)\nMarkov processes;\n(\nVI\n)\nStationary processes. There are subsections on information and control theory,\nmartingales\nand stochastic integrals ...\nWe use a quote from one of Prokhorov's papers to give further information about the research in which he was involved at the\nSteklov\nMathematical Institute. Prokhorov, in a joint paper with\nA N Kolmogorov\nand A N Shiryaev in\n1988\nentitled\nProbabilistic-Statistical Methods of Detecting Spontaneously Occurring Effects\n, writes that the authors:-\n... give a survey of results of work that has been conducted by the authors and under their guidance in the course of several years at the\nSteklov\nMathematical Institute with the goal of constructing optimal or close to optimal probabilistic-statistical methods in problems of detecting changes in the probability characteristics of observable processes, or, as is commonly said, \"disorder\" problems. ... The class of \"disorder\" problems encompasses the most diverse real situations: a disorder can be a disturbance of homogeneity, a disturbance of the normal course of an industrial process, a change in vibrational modes, a change of the critical modes in electrical energy systems, the appearance of the \"target\" in radar, the appearance of \"breaks\" in geological data, the beginnings of earthquakes or tsunami, the appearance of a shock wave front, and so on. An enormous amount of real statistical data ... inevitably requires automation of the statistical treatment ... In working on problems involving \"disorder\" we saw it as our primary goal to develop natural formulations of the problems, to find ... optimal or near optimal methods for detecting \"disorders\", to determine the potential possibilities of the algorithms presented, and to find methods for processing the incoming information starting from the convenience of computer realisation.\nLet us give another quote from\n[\n5\n]\nwhere Prokhorov talks of the problems that his subject is encountering:-\nAll the great Russian and Soviet probabilists, starting with\nChebyshev\n,\nMarkov\n,\nLyapunov\nand then\nSergi Bernstein\n,\nKolmogorov\n,\nKhinchin\n,\nLinnik\n, were all mathematicians of broad profiles. They were not only probabilists, but knew much more. We are losing this feature of breadth and together with it connections of probability with other areas of mathematics are being lost. Maybe a similar picture can be seen elsewhere, but certainly probability does not benefit from it. We are in a difficult situation. On one side, we have to understand applications, in particular, of statistics since nobody else will do it. ... On the other hand, probabilists here have to keep the level of their science of probability sufficiently high. In a sense, they are carrying a double burden.\nIn addition to his research contributions, Prokhorov has made major contributions in his editorial work and in organising scientific activities. He has been editor-in-chief of\nTeoriya Veroyatnostei i ee Primeneniya\nsince\n1966\nand has been on the editorial boards of\nProbability Theory and Related Fields\nand of the\nJournal of Applied Probability\n.\nProkhorov has received many honours for his outstanding contributions in addition to those mentioned above. He was elected as a member of the International Statistical Institute in\n1965\nand, in\n1970\n, won the Lenin Prize. He was a member of the Fields Medal Committee of the\nInternational Mathematical Union\n(1975\n-\n78)\n, and was the vice-president of the\nInternational Mathematical Union\nin\n1979\n-\n82\n. He has been awarded two Orders of Red Banner of Labour, the first in\n1975\nand the second four years later.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Number Theory",
    "Statistics"
  ]
}