{
  "nome_completo": "Yuri Vladimirovich Linnik",
  "nome_curto": "Yuri Vladimirovich Linnik",
  "ano_nascimento": "1915",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Linnik/",
  "lugar_nascimento": "Belaya Tserkov, Ukraine",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Yuri Vladimirovich Linnik\n's father was Vladimir Pavlovitch Linnik\n(1889\n-\n1984)\nwho was working as a schoolteacher when his son was born. However, Vladimir Pavlovitch moved to Leningrad\n(\nSt Petersburg before\n1914\nand now St Petersburg again\n)\nin\n1926\nwhen appointed to the State Institute of Optics. In\n1933\nhe was appointed a professor at Leningrad State University, and in\n1946\nhe was appointed to the Pulkovo Observatory. He made major contributions to optics by designing optical instruments and, like his son, Vladimir Pavlovitch was elected to the\nUSSR Academy of Sciences\n. Yuri's mother, Mariya Abramovna Linnik, was a schoolteacher.\nAfter studying at secondary school in Leningrad, Yuri Vladimirovich worked as a laboratory assistant for a year in\n1931\nbefore starting his university training. Then, in\n1932\n, he entered Leningrad University to study physics but, after studying for three years, he transferred to the Faculty of Mathematics and Mechanics at Leningrad State University. He made this move since, in his own words from his autobiography, he felt:-\n... an irresistible bent for higher arithmetic.\nHe graduated in\n1938\nbut, having already begun research as an undergraduate into quadratic forms, he remained at Leningrad State University. He undertook research for his doctorate with Vladimir Tartakovski, who had been a student of\nBoris Delone\n, as his advisor. However Linnik's studies were interrupted by World War II for the in winter of\n1939\n-\n40\nhe was called up for military service. He only served for a short while as a platoon leader in the Soviet Army before being discharged in the spring of\n1940\n. Returning to Leningrad State University, he submitted his thesis\nRepresentation of Big Numbers by Positive Ternary Quadratic Forms\nand, due to the high quality of the work, he was awarded the higher degree of D.Sc. in Mathematics and Physics. In the same year he joined the Leningrad branch of the Steklov Institute for Mathematics as soon as it was founded in April\n1940\nand began working there. However, the German armies were approaching Leningrad and Linnik volunteered to serve in the People's Guard to defend the city. Soon he was involved in the fighting on the Pulkovo Hills, battling against the advancing German troops. In September\n1941\nthe Germans began the siege of the city of Leningrad. Linnik was taken ill with dystrophy, almost certainly the result of malnutrition, and discharged from the army. Because of the war, the Mathematical Institute of the\nUSSR Academy of Sciences\nhad been moved from Moscow to Kazan, with the Leningrad branch also evacuated there, so Linnik was sent to Kazan. This almost certainly saved his life for the siege of Leningrad lasted\n872\ndays to January\n1944\n. Millions of the citizens died of starvation during the siege, so Linnik, given his poor physical condition, would almost certainly have perished.\nAfter the siege of Leningrad ended in early\n1944\n, Linnik was able to return from Kazan to Leningrad. He was appointed as professor of mathematics at Leningrad State University in addition to his position in the Steklov Mathematical Institute in Leningrad which he had continued to hold in Kazan, and was able to resume in its proper location. He worked in Leningrad for the rest of his life organising the chair of\nprobability theory\nthere and founding the world famous Leningrad school of probability and mathematical statistics.\nHis main research topics were\nnumber theory\n, probability theory and mathematical statistics. In\n[\n2\n]\n,\n240\nof Linnik's research papers are listed, as well as a list of\n40\nnotes and articles on the history of mathematics. A list of\n69\nof his coauthors is also given. See also\n[\n5\n]\nfor lists of his publications. Clearly with such an extensive publication record all we can do in an article such as this is to give some indication of his work.\nHe introduced ergodic methods into number theory in his first work on the analytic theory of quadratic forms. In a\n1941\npaper he introduced the large sieve method in number theory. By the \"large sieve\", which was Linnik's own term, he meant the operation of eliminating some residue classes modulo\np\np\np\nfrom a given set of integers where as\np\np\np\nincreased so, possibly, did the number of classes. His motivation for introducing the method was to attack\nVinogradov\n's hypothesis concerning the size of the smallest quadratic non-residue\nn\np\nn_{p}\nn\np\n​\nmodulo\np\np\np\n.\nVinogradov\nhad conjectured that\nn\np\nn_{p}\nn\np\n​\nwas\nO\n(\np\ne\n)\nO(p^{e})\nO\n(\np\ne\n)\nfor any\ne\n>\n0\ne > 0\ne\n>\n0\n. Linnik, using his large sieve method, was able to show that the number of primes\np\n<\nx\np < x\np\n<\nx\nfor which\nn\np\n>\np\ne\nn_{p} > p^{e}\nn\np\n​\n>\np\ne\nis\nO\n(\nlog\n⁡\nlog\n⁡\nx\n)\nO(\\log \\log x)\nO\n(\nlo\ng\nlo\ng\nx\n)\n. Linnik's large sieve proved highly significant and was further developed by others including\nAlfréd Rényi\nin\n1950\n,\nKlaus Roth\nin\n1965\n,\nEnrico Bombieri\nin\n1965\nand\nHarold Davenport\nand Heini Halberstam in\n1966\n. The large sieve method led Linnik to study\nDirichlet\n's\nL\nL\nL\n-functions. Density theorems had been used from the\n1930\ns to study primes and he generalised these theorems to\nL\nL\nL\n-functions. From this he was able to produce a whole series of papers proving powerful arithmetical consequences, including a variant of the\nGoldbach Conjecture\n.\nAfter his early concentration on number theory, from\n1947\nonwards Linnik embarked on a deep study of probability. From that time on he undertook research in three areas, namely probability, mathematical statistics and the analytic theory of numbers. Perhaps the remarkable power of his work came from the fact that he was able to use ideas from each of these areas in his work in the other two. In\n1950\nhe introduced the concepts of probability into number theory and introduced the dispersion method in number theory. He devised the dispersion method to attack additive problems in number theory of binary type. He collected much of his work in this area into the monograph\nThe dispersion method in binary additive problems\n, first published in Russian in\n1961\nwith an English translation appearing two years later. The book demonstrates the power of the dispersion method:-\n... for treating certain types of problems in additive number theory which have previously resisted all attacks.\nLater Linnik made major contributions to probability with his work on limit theorems and was the first to use powerful techniques from analysis in mathematical statistics. The authors of\n[\n7\n]\nwrite:-\nIn\n1948\n-\n49\nLinnik obtained results which contained, in principle, a complete solution to two central problems in the theory of the summation of variables forming a\nMarkov\nchain. One of these, raised by\nMarkov\n, the creator of the theory of chains, was: to find the conditions for the application of the integral limit theorem to the case of a singular chain. The first papers on this were by\nMarkov\nand\nS N Bernstein\n. Linnik substantially improved and developed the methods of his predecessors and gave an almost definitive solution of the problem for an inhomogeneous chain with an arbitrary finite number of events. The second problem concerned the conditions under which the local limit theorem for lattice type variables forming a chain holds. An important feature of the method used in this paper, which was largely responsible for its success, is the use of arguments from the study of trigonometric sums in the theory of numbers.\nLinnik also solved the Behrens-Fisher problem and many other difficult problems of mathematical statistics. He wrote many papers on the decomposition of probability laws and again collected his results into a monograph\nDecompositions of probability laws\nfirst published in Russian in\n1960\n. A French translation appeared in\n1962\nand an English one in\n1964\n. Later developments were explained in the monograph\nDecompositions of random variables and random vectors\nwhich Linnik wrote with\nI V Ostrovskii\nand published in\n1972\n(\nEnglish translation\n1977)\n. Another important book which he published was\nErgodic properties of algebraic fields\n(1967)\n. Linnik wrote in the Preface:-\nThe use of ergodic methods in metrical number theory is well known; part of the latter theory is essentially a special case of general ergodic theorems. In this book a different application of the ergodic concepts is given. Constructing 'flows' of lattice points on certain algebraic varieties given by systems of integral polynomials, we can prove in some cases individual ergodic theorems and mixing theorems. These theorems allow one to obtain asymptotic expressions for the distribution of lattice points on these varieties and to arrive at results which are not accessible by the usual methods of analytical number theory. Typical in this respect is the theorem on the asymptotic distribution and the ergodic behaviour of the set of lattice points on the sphere\nx\n2\n+\ny\n2\n+\nz\n2\n=\nm\nx^{2} + y^{2} + z^{2} = m\nx\n2\n+\ny\n2\n+\nz\n2\n=\nm\nwith increasing m. For the present it is not known how to obtain simple and geometrically clear theorems on the distribution of the lattice points on the sphere by other methods. The systems of diophantine equations studied by these methods and the flows of lattice points introduced by these methods are closely related to the behaviour of the ideal classes of the corresponding algebraic fields.\nAlso in\n1967\nLinnik published\nLeçons sur les problèmes de statistique analytique\nwhich came about as the result of a series of lectures he had given in the previous year at the Institut de Statistique of the University of Paris. These lectures concentrated on applications of the theory of functions of one and several complex variables to the theory of similar tests and unbiased estimation. An English version of these lectures was published in\n1975\n. Linnik wrote other important texts including\nCharacterisation Problems in Mathematical Statistics\n(\njointly with A M Kagan and S R Rao\n)\nwhich appeared in Russian in\n1972\nwith an English translation appearing in the following year. The authors write in the introduction:-\nMany problems of statistical theory have the basic property that some special distributions have important properties that allow a reduction of the initial problem to a simpler one. It is natural to ask whether such a reduction makes complete use of the particular nature of the distribution family. Thus the question of characterizing the basic distributions of mathematical statistics arises.\nGiven the amazing success which Linnik had in introducing new mathematical areas, it is interesting to see his advice on how one might achieve this\n[\n7\n]\n:-\nLinnik often liked to say that when starting a new area of research one should select in it a difficult and neatly formulated problem: in trying to solve it, new problems will crop up and the problem itself will serve as a touchstone for the methods being used. This would lead step-by-step to the creation of a theory and of general methods.\nOne has to feel that Linnik did not fully appreciate the strength of his own outstanding talents if he though that others following this route would lead to them making similar breakthroughs. It is interesting to know more about his personality, and we first turn to the authors of\n[\n4\n]\nwho write:-\nYuri V Linnik possessed a lucky ability to attract talented disciples. He skilfully directed them to the study of problems which were both difficult and important for the development of science. As a director of studies, Yuri V Linnik was generous in giving both ideas and advice, always having time for working discussions with his disciples and colleagues. At the same time he was exigent, awaiting with interest those results which, in his opinion, were bound to be a success. An relations with his disciples, Yuri V Linnik was solicitous not only as a teacher, but also as a senior colleague, trying to be helpful also in everyday life, when necessary.\nWe learn a little more from the amazing range of Linnik's interests and skills outside mathematics as described in\n[\n4\n]\n:-\nHis many-sided endowments were astonishing: he was greatly interested in belle lettres, especially poetry and memoirs, as well as in history, especially military history. He spoke seven languages fluently and wrote witty poetry in Russian, English, German and French.\nLinnik received many honours, including being elected to the International Statistical Institute, the\nAcademy of Sciences of the USSR\nin\n1964\n, and to the\nSwedish Academy of Sciences\n. He received a State Prize in\n1947\nand a Lenin Prize in\n1970\n. He was awarded an honorary doctorate by the University of Paris. He was elected as the first president of the\nLeningrad Mathematical Society\nwhen it was founded in\n1959\n, a role he filled for six years, and he was also elected to the Leningrad City Council. Two volumes of his works in number theory have been published\n(1979\n-\n1980)\n, the first subtitled\nThe ergodic method and L-functions\nand the second\nL-functions and the dispersion method\n. A volume has also been published of his work on\nProbability theory\n(1981)\nand on\nMathematical statistics\n(1982)\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Number Theory",
    "Statistics"
  ]
}