{
  "nome_completo": "Yuri Ivanovich Manin",
  "nome_curto": "Yuri Ivanovich Manin",
  "ano_nascimento": "1937",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Manin/",
  "lugar_nascimento": "Simferopol, Crimean Autonomous Soviet Republic (now Ukraine -- occupied by Russia)",
  "lugar_morte": null,
  "biografia": "Yuri Ivanovich Manin\n's parents were Ivan Manin and Rebecca Miller. He received his bachelor's degree from Moscow State University in\n1958\nbut, even before this, his first mathematics paper\nOn cubic congruences to a prime modulus\n(\nRussian\n)\nappeared in print. He continued to undertake research at the\nSteklov\nMathematical Institute in Moscow advised by\nIgor Shafarevich\nand after the award of his doctorate in\n1960\nhe was appointed as Principal Researcher at the\nSteklov\nMathematical Institute. During this period he published\nModuli of a field of algebraic functions\n(\nRussian\n)\n(1959)\nand\nOn cubic congruences to a prime modulus\n(1960)\n.\nIn\n1963\nManin submitted his\nhabilitation\nthesis to the\nSteklov\nMathematical Institute and two years later, in\n1965\n, he was appointed Professor of Algebra at Moscow State University. The International Congresses of Mathematicians was held from\n16\nAugust to\n26\nAugust\n1966\n. Manin presented a paper\nRational surfaces and Galois cohomology\nin which he gave a survey of results, mainly due to himself, on classifying rational algebraic surfaces. He remained at Moscow State University until the early\n1990\ns when he spent a while visiting Columbia University\n(1991\n-\n92)\n, then Massachusetts Institute of Technology\n(1992\n-\n93)\nbefore accepting the position on the Board of Directors of the\nMax Planck\nInstitute, Bonn in\n1993\n. He became Professor emeritus at the\nMax Planck\nInstitute in\n2005\n. Earlier he had, in addition, accepted a professorship at Northwestern University, Evanston, in the United States.\nThe breadth of Manin's contributions have been remarkable. He has written papers on:\nalgebraic geometry\nincluding ones on the\nMordell\nconjecture for function fields and a joint paper with V Iskovskikh on the counter-example to the\nLüroth\nproblem; number theory including ones about torsion points on elliptic curves,\np\np\np\n-adic modular forms, and on rational points on\nFano\nvarieties; and differential equations and mathematical physics including ones on string theory and quantum groups. He has also written famous papers on formal groups, the arithmetic of rational surfaces, cubic hypersurfaces, noncommutative algebraic geometry, instanton vector bundles and mathematical logic.\nLet us look now at some of the books that Manin has published. In\n1980\nManin and A I\nKostrikin\npublished the textbook\nLinear algebra and geometry\nin Russian. The second Russian edition was translated into English in\n1989\n. In\n1984\nManin published\nLinear algebra and geometry\nin Russian, it was translated into English in\n1997\n. Also in\n1984\nhe published\nGauge fields and complex geometry\nin Russian. Raymond O Wells, Jr writes:-\nIn the last two decades two new ideas were introduced into mathematical physics. The first of these is the notion of twistor geometry and the other is that of supersymmetry. In this book we find a beautiful blend of developments stemming from these two ideas written by a master expositor who uses the language of algebraic geometry to synthesize and unify the fundamental ideas involved.\nManin, in collaboration with Sergei I Gelfand, published\nMethods of homological algebra\nin Russian in\n1988\n. M M Kapranov writes:-\nThis is long-awaited modern textbook on homological algebra. The exposition is centred around the notion of derived category, which is treated in full detail for the first time in the textbook literature. ... the book contains more than just an exposition of the subjects involved. It teaches the reader, via examples, how to \"think homologically\". The book has many \"levels of understanding\" and can be read, with much benefit, on each of them. Thus, it can be used by students just beginning to study homological algebra, as well as by specialists who will find there some points which have never been clarified in the literature.\nIn the following year the same two authors published the sequel\nHomological algebra\nwhich is mainly aimed at presenting applications of the subject within mathematics.\nIn\n1989\nManin, with I Yu Kobzarev, published\nElementary particles\nalthough the work was essentially completed seven years earlier. H Araki writes:-\nThis book presents a kind of philosophical assessment along with an introductory description of developments and the present status of quantum field theory as a basis for the theory of elementary particles.\nManin, in collaboration with A A Panchishkin, published\nIntroduction to number theory\nin Russian in\n1990\n(\nEnglish translation\n1995\n, with a second edition in\n2005)\n. Yurey A Drakokhrust writes that:-\n... the authors describe the current state of various aspects of number theory from a single point of view. They avoid traditional classification, stressing general ideas and principles that have application in different areas of the theory.\nOther books by Manin include\nCubic forms: algebra, geometry, arithmetic\n(\nRussian\n)\n(1972)\n,\nA course in mathematical logic\n(1977)\n,\nComputable and noncomputable\n(\nRussian\n)\n(1980)\n,\nQuantum groups and noncommutative geometry\n(1988)\n,\nTopics in noncommutative geometry\n(1991)\n,\nFrobenius manifolds, quantum cohomology, and moduli spaces\n(1999)\n.\nIn our list above we have not mentioned Manin's fascinating book\nMathematics and physics\n(1981)\n. To illustrate Manin's thinking about mathematics and physics we quote from the Foreword:-\nThe author wishes to show how mathematics associates new mental images with such physical abstractions; these images are almost tangible to the trained mind but are far removed from those that are given directly by life and physical experience. For example, a mathematician represents the motion of planets of the solar system by a flow line of an incompressible fluid in a\n54\n-dimensional phase space, whose volume is given by the Liouville measure .... The computational formalism of mathematics is a thought process that is externalised to such a degree that for a time it becomes alien and is turned into a technological process. A mathematical concept is formed when this thought process, temporarily removed from its human vessel, is transplanted back into a human mold. To think ... means to calculate with critical awareness. The 'mad idea' which will lie at the basis of a future fundamental physical theory will come from a realization that physical meaning has some mathematical form not previously associated with reality. From this point of view the problem of the 'mad idea' is the problem of choosing, not of generating, the right idea. One should not understand that too literally. In the\n1960\ns it was said\n(\nin a certain connection\n)\nthat the most important discovery of recent years in physics was the complex numbers. The author has something like that in mind.\nManin has received, and continues to receive, many honours for his outstanding mathematical contributions. These include the\nMoscow Mathematical Society\nAward\n(1963)\n, the Lenin Prize\n(1967)\n, the\nBrouwer\nGold Medal\n(1987)\n, the Frederic Esser Nemmers Prize\n(1994)\n, the Rolf Schock Prize\n(1999)\n, the King Faisal Prize for Mathematics\n(2002)\n, and the\nGeorg Cantor\nMedal of the\nGerman Mathematical Society\n(2002)\n.\nThree issues of the\nMoscow Mathematical Journal\nwhere dedicated to Manin for his\n65\nth\nbirthday. In an introduction, the editors give an indication of the breadth of his mathematical contributions and also write about his interests outside mathematics:-\nHis interests beyond mathematics are also extremely varied. Manin has published research and expository papers in literature, linguistics, glotto-genesis, mythology, semiotics, physics, history of culture, and philosophy of science. The example he set for those around him was not that of a monomaniac mathematician, but of a deep scholar with wide interests, for whom penetration into the mystery of knowledge is much more important than professional success.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}