{
  "nome_completo": "Yutaka Taniyama",
  "nome_curto": "Yutaka Taniyama",
  "ano_nascimento": "1927",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taniyama/",
  "lugar_nascimento": "Kisai (north of Tokyo), Japan",
  "lugar_morte": "Tokyo, Japan",
  "biografia": "Yutaka Taniyama\n's name was, of course, written in Japanese characters. It was intended to be Toyo Taniyama but most people read it as Yutaka, a more common form, and Taniyama eventually came to use Yutaka himself. He was born and brought up in the small town of Kisai about\n50\nkm north of Tokyo. His parents were Sahei, a medical doctor, and Kaku Taniyama. Yutaka was born into a large family having two older brothers and three older sisters as well as a younger brother and a younger sister. Yutaka was a sickly child and suffered from tuberculosis which caused him to miss two years of high school. After graduating from the high school, he entered the University of Tokyo to study mathematics. During his undergraduate years he read\nClaude Chevalley\n's\nTheory of Lie groups\nand\nAndré Weil\n's\nFoundations of algebraic geometry\nas well as two other books by\nWeil\non algebraic curves and abelian varieties. He attended algebra lectures by Masao Sugawara and these encouraged his interest in number theory. He graduated in March\n1953\nbut, having lost years at school through illness, he was quite a bit older than the other students graduating in that year.\nHe remained at the University of Tokyo as a 'special research student' in the Department of Mathematics, although he had no thesis advisor.\nShimura\nwrites in\n[\n1\n]\nabout the apartment where Taniyama lived in Tokyo:-\n... he lived in a one-room apartment which consisted of\n81\nsquare feet of living space, a sink, and a tiny unfloored part behind the door. Running water, gas and electricity were provided separately in each room, but there was only one toilet on each floor of the two-storey building, shared by all the occupants of the dozen or so rooms of the floor. I remember that his was No.\n20\non the second floor, close to the last. Thus it was more like a dormitory than an apartment, but it was more or less typical of the time. To take a bath, he had to go to a public bathhouse, a few minutes' walk from his apartment. The building, a rather shabby wooden structure, was named poetically 'Villa Tranquil Mountains',\nTaniyama's interests were in\nalgebraic number theory\nand his fame is mainly due to two problems posed by him at the symposium on Algebraic Number Theory held in Tokyo and Nikko in\n1955\n. His meeting with\nAndré Weil\nat this symposium was to have a major influence on Taniyama's work. These problems form the basis of a conjecture: every elliptic curve defined over the\nrational\nfield is a factor of the Jacobian of a modular function field. This conjecture proved to be a major factor in the proof of '\nFermat's Last Theorem\n' by\nAndrew Wiles\n. In the Proceeding of the conference he published the paper\nJacobian varieties and number fields\n, then in the following year the paper\nL-functions of number fields and zeta functions of abelian varieties\n.\nAndré Weil\n, in a review of the second paper, writes:-\nIn this paper, the author not only gives a new proof, free from artificial restrictions, of his earlier theorem on the zeta-function of Abelian varieties with sufficiently many complex multiplications, but develops, in relation with that problem, a number of new ideas of far-reaching importance.\nOther than these two papers the only other paper Taniyama published was\nDistribution of positive\n0\n-cycles in absolute classes of an algebraic variety with finite constant field\n(1958)\n.\nAndré Weil\nwrites that:-\nThe method of proof\n[\nis\n]\nas novel as it is surprising ...\nHowever, in addition to these papers, he wrote the book\nModern number theory\n(1957)\nin Japanese, jointly with\nG Shimura\n. Although they planned an English version, they lost enthusiasm and never found the time to write it before Taniyama's death. However they probably give the reason themselves in the\n1957\npreface:-\nWe find it difficult to claim that the theory is presented in a completely satisfactory form. In any case, it may be said, we are allowed in the course of progress to climb to a certain height in order to look back at our tracks, and then to take a view of our destination.\nWith seemingly a great future in front of him, both in mathematics and his life\n(\nhe was planning marriage to Misako Suzuki\n)\nhe took his own life. In fact he and Misako, who had met in November\n1957\n, had signed a lease on a new apartment and had purchased utensils for their kitchen - so their wedding preparations were quite far advanced. In a long suicide note he left, he took great care to describe exactly where he had reached in the calculus and linear algebra courses he was teaching and to apologise to his colleagues for the trouble his death would cause them. As to the reason for taking his life he says:-\nUntil yesterday I have had no definite intention of killing myself. But more than a few must have noticed I have been tired both physically and mentally. As to the cause of my suicide, I don't quite understand it myself, but it is not the result of a particular incident, nor of a specific matter. Merely may I say, I am in the frame of mind that I lost confidence in my future. There may be some to whom my suicide will be troubling or a blow to a certain degree. I sincerely hope that this incident will cast no dark shadow over the future of that person. At any rate I cannot deny that this is a kind of betrayal, but please excuse it as my last act in my own way, as I have been doing all my life.\nAbout a month later his fiancé Misako Suzuki also committed suicide. She left a note which included the sentences:-\nWe promised each other that no matter where we went, we would never be separated. Now that he is gone, I must go too in order to join him.\nShimura writes\n[\n1\n]\n:-\n... he was the moral support of many of those who came into mathematical contact with him, including of course myself. Probably he was never conscious of this role he was playing. But I feel his noble generosity in this respect even more strongly now than when he was alive. And yet nobody was able to give him any support when he desperately needed it. Reflecting on this, I am overwhelmed by the bitterest grief.\nOne might reasonably ask what Taniyama's interests were other than mathematics. He enjoyed listening to music, especially Beethoven's Eighth Symphony, and going to movies, his favourite film being 'The King and I'. His only hobby was writing articles which he never intended to publish, but he seemed to find writing them helped to organise his thoughts.  Examples of the topics he wrote articles on included: reviews of books, ideas on how researchers should be trained, how to organise a new institute for mathematical sciences, and reviews of articles by others.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}