{
  "nome_completo": "Yves François Meyer",
  "nome_curto": "Yves Meyer",
  "ano_nascimento": "1939",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meyer_Yves/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": null,
  "biografia": "When\nYves Meyer\nwas born, his father was a pharmacist running a pharmacy at\n17\nboulevard du Temple, Paris. Sadly, however, his mother and father seldom lived together. Yves wrote\n[\n34\n]\n:-\nMy father never wished to live with us, even when I was a baby.\nThe \"us\" in this quote is Yves, his sister Danièle\n(\nborn\n1938)\n, and his mother. Yves's father enrolled in the Army in\n1944\nand was sent to the Pharmacy Department in Rabat Hospital in Morocco. Yves, his sister and mother remained in Paris until\n1945\nwhen, against the wishes of Yves' father, they went to Rabat. There they lived in one room in a cheap hotel, while Yves' father continued to live and work at Rabat Hospital. After two years in Rabat, Yves' father moved to the Pharmacy Department in Tunis Hospital in Tunisia. This time the whole family travelled together in a slow train, the journey taking almost a week. It was extremely hot in a train without air conditioning\n[\n34\n]\n:-\nIn Tunis we lived for two years in a tiny room in a hotel. Afterwards we obtained housing in a suburb of Tunis. Then my father enrolled as a volunteer to Indochina. My mother stayed in Tunis. The French war in Indochina was a tragedy and ended with the Diên Biên Phu disaster. My father returned to Tunis in\n1953\nand decided finally to try to live with us. I was fourteen.\nThere were two High Schools in Tunis when Meyer was growing up there, the  Collège Sadiki and the Lycée\nCarnot\n. He studied at the Lycée\nCarnot\nwhere the\n[\n31\n]\n:-\n... teachers were outstanding. I was mostly attracted by humanities. I eventually switched to mathematics. What certainly played a seminal role in my way of thinking was the everyday life in Tunis. The Tunis of my childhood was a melting pot where people from all over the Mediterranean sea had found a peaceful exile. Italian, Maltese, Sepharades, Berberes, Arabs and French were living together. As a child I was obsessed by the desire of crossing the frontiers between these distinct ethnic groups. But I was limited by my ignorance of the languages which were spoken in the streets of Tunis.\nMeyer's mother was his first teacher and, when he attended the Lycée\nCarnot\n, she insisted he study Greek and Latin. This had the consequence that he took no science subjects, although he was well educated in mathematics. He loved the humanities but had a special talent for mathematics. Beauty was especially important to him and when he was a teenager he wanted to be an artist\n[\n16\n]\n:-\nI was more interested in humanities. I was in love with Socrates and Plato, and I am still reading Plato right now, day after day, night after night. ... The point is that I am a bad writer. That is my bad side. So, I took mathematics because I was gifted - I was unusually gifted in mathematics. I cannot explain that. I understood mathematics from the inside in a very natural way. When I was in high school, I understood mathematics by myself and not by listening to my teachers.\nOne event which took place while Meyer was at the Lycée\nCarnot\nturned out to be quite influential.\nJean-Pierre Kahane\nvisited Tunis and gave a talk to a general audience on his research on trigonometric series. Meyer said\n[\n17\n]\n:-\nHe gave a talk - and he is a very good speaker - in such a way that I understood what he was talking about. I was a student in high school. I was truly fascinated. I was fascinated by his personality. ... It was quite exceptional and I would like to say that this influenced my work.\nAfter his father returned to Tunis in\n1953\nthe family lived there until August\n1956\nwhen Meyer's father received a position back in France and they went to Strasbourg, the city where his father had been born\n[\n34\n]\n:-\nCompared to Tunis Strasbourg was hell. In\n1956\nthe German influence was still strong. People were speaking a German dialect and had kept some traditional German values of the nineteenth century. I was quite unhappy there but this lasted only one year.\nHe spent a year in Strasbourg preparing to take the entrance examinations for the Grands Écoles. He was still confused whether he wanted to make a career in mathematics or in the humanities. At this stage he found mathematics easy but the humanities was his real joy. He realised, however, that he had more talents in mathematics than in the humanities and he also felt that mathematics offered more career prospects for him so, rather reluctantly, he chose to specialise in mathematics. He took the entrance examinations for entry into the Grands Écoles and was ranked first. He now had to chose whether to study at the École Normale Supérieure or the École Polytechnique. His mother was in no doubt that he should enter the École Polytechnique which made things hard for him since he preferred the École Normale Supérieure. He said\n[\n34\n]\n:-\nThe École Normale Supérieure leads to a professorship either in high school where the alumni are given a position immediately after graduating, or for those who are gifted in research and willing to start a Ph.D. program, eventually to a position at the University. The École Normale Supérieure did not offer a graduate programme. If you enter École Polytechnique you will likely become a manager, an important person. This was not my goal. I was still influenced by Socrates. I did not want to be involved in the industrial development of my country.\nHe entered the École Normale Supérieure de la Rue d'Ulm in Paris in\n1957\nalong with around\n40\nscience students and\n40\narts students. Although he studied mathematics, Meyer was far more at home talking to the students studying humanities. Later he would come to understand that he did not love mathematics at this stage because he found it too easy. He graduated in\n1960\nand, with the Algerian War taking place between France and Algeria, he undertook three years of military service. He could have avoided being drafted at this time by continuing to study for a doctorate but chose not to take that route. He was, however, strongly opposed to the war which he described as \"unjust\", so was happy the military offered him an alternative to fighting in Algeria.\nMeyer taught at the Prytanée national militaire in La Flèche, a city roughly half way between Paris and the west coast of France, from\n1960\nto November\n1962\n. This military school provided secondary level education as well as giving preparatory classes for students going on the study at military academies. Perhaps it was hard for someone who found high school and university mathematics so easy to appreciate the difficulties that most students encounter. Perhaps, as he himself said, he was not methodical and organised enough to be a good teacher. Certainly these three years at the Prytanée national militaire convinced him that he was not suited to high school teaching.\nIn\n1963\nhe married Anne Limpaler; they went on to have two children. In the same year of\n1963\n, after his military service ended, Meyer was appointed as a teaching assistant at the University of Strasbourg. He was one of fourteen teaching assistants in the Department of Mathematics which had fourteen full professors. A teaching assistant undertook research for a doctorate but they were essentially unsupervised finding their own research problems in any area of mathematics. Meyer was very happy there sharing one big room with all the other teaching assistants. After reading\nAntoni Zygmund\n's book\nTrigonometric Series\n, which he found fascinating, he started working on open problems in this area. He wrote twelve chapters of a thesis on the results he had obtained then asked\nPierre Cartier\n, who was one of the professors at Strasbourg, who would supervise him.\nCartier\nsuggested that Meyer contact\nJean-Pierre Kahane\nwho was a Professor in the Faculty of Sciences of Paris Sud at Orsay. Carrying his twelve typed chapters, Meyer took the train to Orsay to ask\nKahane\nif he would be his thesis advisor.\nKahane\ntold him that, since he had enough material for a doctorate in his twelve chapters, he did no need a thesis advisor.\nMeyer submitted his work to the University of Strasbourg for his doctorate. Only at that stage, however, did he discover that\nElias Stein\n, who was working with\nAlberto Calderón\nat the University of Chicago, had been working on the same problems and had proved stronger results. During his oral examination, he kept explaining\n[\n34\n]\n:-\nI obtained this theorem but\nElias Stein\nproved a much better result ...\nPaul-André Meyer\n, who had been appointed to the University of Strasbourg in\n1964\n, was on the committee examining Meyer's thesis. He told Meyer:-\nYves, it is not your role to criticise your results, it is the role of the committee.\nIt was an unfortunate experience but nevertheless he was awarded his doctorate in\n1966\n. In that year he was appointed to a temporary position at the Faculty of Sciences of Paris Sud at Orsay. He now changed research area but again was led to problems by falling in love with a book. This time it was the book\nEnsembles parfaits et séries trigonométriques\nⓉ\n(\nPerfect sets and trigonometric series\n)\nwritten by\nJean-Pierre Kahane\nand\nRaphaël Salem\nand published in\n1963\n.\nSalem\nhad died in\n1963\nleaving a number theory problem unsolved and Meyer decided to search for a solution. This problem on Diophantine approximation, involving\nPisot\nand\nSalem\nnumbers, took him three years to solve. It was a remarkable achievement and he was asked to lecture on it in the Section 'Exceptional Sets in Analysis' at the International Congress of Mathematicians held in Nice, France in\n1970\n. He delivered the lecture\nNombres de Pisot et Analyse Harmonique\nⓉ\n(\nPisot numbers and harmonic analysis\n)\n. His achievement was also marked with being named Peccot lecturer in\n1968\n-\n69\nand the award of the\nSalem\nPrize in\n1970\n.\nFor more information about the awards to Meyer of Cours Peccot and the\nSalem\nPrize, see\nTHIS LINK\n.\nDetails of Meyer's work on Diophantine approximations and\nPisot\nnumbers are contained in a series of papers, but are also set out in his first book\nAlgebraic numbers and harmonic analysis\n(1972)\n. It is remarkable that ideas in this book were so far ahead of their time that it was many years later that their full significance became understood. Let us try to explain this. A\nDelone\nset\nD\nD\nD\nis a subset of\nR\nn\n\\mathbb{R}^{n}\nR\nn\nsuch that there exists a large\nR\n0\nR_{0}\nR\n0\n​\nsuch that every ball of radius\nR\n0\nR_{0}\nR\n0\n​\ncontains at least one point of\nD\nD\nD\nand there exists a small\nR\n1\nR_{1}\nR\n1\n​\nsuch that every ball of radius\nR\n1\nR_{1}\nR\n1\n​\ncontains at most one point of\nD\nD\nD\n. A\nMeyer set\nis a\nDelone\nset\nD\nD\nD\nsuch that the set of differences\nD\n−\nD\nD-D\nD\n−\nD\nis also a\nDelone\nset. Meyer studied Meyer sets\n(\nwhich he called 'model sets'\n)\nin the\n1972\nbook. In\n1974\nRoger Penrose\n, without knowing Meyer's work, introduced the related idea of an aperiodic tiling called a\nPenrose tiling\n. Dan Shechtman, also without knowing anything about Meyer's contributions, investigated crystalline materials lacking a periodic structure and published results on these substances called\nquasicrystals\nin\n1984\n. Shechtman was awarded the Nobel Prize in Chemistry in\n2011\nfor his discovery of quasicrystals. It was\nEnrico Bombieri\nand the Canadian mathematician Robert Moody who realised that Meyer's study of Meyer sets in his\n1972\nbook had set up the mathematical structure of quasicrystals.\nIn\n1982\nMeyer, with help from Alan McIntosh and Ronald Coifman, solved what was known as\nCalderón\n's conjecture in the theory of singular integral operators. Meyer and Coifman were already trying to solve the conjecture but were not close to the solution. During visits to Coifman at the University of Chicago, Meyer often had useful discussions with\nAlberto Calderón\nand\nAntoni Zygmund\n. McIntosh became involved in an unexpected way. Meyer's colleagues were protesting a decision by the Minister of Education and were refusing to give graduate courses. Meyer, who always liked to be different, decided he would give a graduate course. Alan McIntosh\n(1942\n-\n2016)\nwas an Australian mathematician who had been awarded a Ph.D. from the University of California, Berkeley in\n1966\nadvised by\nFrantisek Wolf\n. He worked at Macquarie University in Sydney, Australia from\n1967\nbut spent the year\n1980\nas a Professeur Invité at the Université Paris VI. He attended Meyer's graduate course and immediately stood out from the other students who were attending. Meyer had lunch with him once a week and soon discovered that McIntosh was also thinking about\nCalderón\n's conjecture. When at Berkeley, McIntosh had been influenced by\nTosio Kato\nand he was looking at a conjecture of\nKato\n's which, if solved, would prove\nCalderón\n's conjecture. Meyer said\n[\n17\n]\n:-\nMcIntosh explained that the problem I was trying to solve could be rephrased in the terminology of\nKato\n. As soon as I got this information, I discussed with Coifman the possibility of solving the problem through this new formulation. Coifman was excited and wrote a kind of draft version of the solution. Then I returned to France and I managed to find the missing points. So, without my discussion with McIntosh, who knows if the problem would have been solved by me?\nAlthough the mathematics we have described above is a very important contribution by Meyer, nevertheless he is best known for his discovery of wavelets. Before we describe this, however, we should look at how Meyer's career progressed. He had been appointed to the Université d'Orsay in\n1966\n, and remained there when it changed to become the University of Paris-Sud\n(\nParis XI\n)\nin\n1971\n. In\n1980\nhe left Orsay to take up an appointment as Professor at the École Polytechnique. After six years in that role, in\n1986\nhe was appointed as a professor at the Centre de Recherche en Mathématiques de la Décision at the Université Paris-IX Dauphine. The Centre is a joint research unit whose research themes cover most of applied mathematics. In\n1995\nhe took up a research position at Centre National de la Recherche Scientifique, holding this for four years before becoming a professor at the École Normale Supérieure de Cachan in\n1999\n. In\n2009\nhe retired, becoming Professor Emeritus at École Normale Supérieure de Cachan.\nLet us explain how Meyer became interested in applied mathematics. Up to\n1983\nhe had very much thought of himself as a pure mathematician. By the autumn of that year, now as a professor at the École Polytechnique, he was a colleague of Charles Goulaouic who worked on partial differential equations. Meyer wrote\n[\n34\n]\n:-\nGoulaouic was dying of cancer. My mathematical talent could not even improve the ultrasound examination of his liver. I was helpless in front of such human suffering and distress.\nThe International Space Station began to be planned in the early\n1980\ns and in\n1984\nthe European Space Agency joined the project.\nJacques-Louis Lions\nasked Meyer to look at the problem of controlling vibrations that the Space Station might encounter; he solved the problem and published his solution in the paper\nÉtude d'un modèle mathématique issu du contrôle des structures déformables\nⓉ\n(\nStudy of a mathematical model resulting from the control of deformable structures\n)\n(1985)\n[\n34\n]\n:-\nThen I emerged from depression, and understood for the first time in my life that my skills in pure mathematics could be used in real-life problems. In my research I then abolished the frontier between pure and applied mathematics.\nLet us explain how Meyer's work\n[\n40\n]\n:-\n... began the \"wavelet revolution\" of signal processing in the late\n1980\ns and early\n1990\ns, with the wavelet transform now being routinely used in many basic signal processing tasks such as compression\n(\ne.g. in the JPEG\n2000\nimage compression format\n)\nand denoising, as well as more modern applications such as compressed sensing\n(\nreconstructing a signal using an unusually small number of measurements\n)\n.\nIt began for Meyer standing beside the photocopy machine in the École Polytechnique one day in\n1984\nwaiting for his friend Jean Lascoux, Head of the Department of Mathematical Physics at the École Polytechnique, to finish Xeroxing papers for his colleagues. Turning to Meyer, Lascoux handed him a preprint of a paper by Jean Morlet and Alex Grossmann about wavelets. The paper used results by\nCalderón\nthat were very familiar to Meyer but authors of the paper\n[\n16\n]\n:-\n... had the fantastic idea that this could be a revolution in signal processing. So that was a fantastic step. I was immediately excited by the paper and by the way it was written. They were working at the Centre de Physique Théorique in Marseille. So I took the first train to Marseille and I joined the group.\nThere were three in the group at Marseille, Jean Morlet, Alex Grossman and\nIngrid Daubechies\n. Meyer said\n[\n17\n]\n:-\nI discussed with\nIngrid\nand then I had the idea to try to find an orthonormal basis of wavelets, which would make everything trivial on the algorithmic level. It took me three months of intense work but that is nothing compared to the seven years I spent proving\nCalderón\n's conjecture. In just three months, I found the basis.\nCharles Chui writes in his review of Meyer's book\nWavelets and operators\n(1992)\n[\n8\n]\n:-\nYves Meyer learnt about the work of Morlet and the Marseille group and immediately recognised the connection of Morlet's algorithm to the notion of resolution of identity in harmonic analysis due to\nA Calderón\nin\n1964\n. He then applied the\nLittlewood\n-\nPaley\ntheory to the study of \"wavelet decomposition\". In this regard, Yves Meyer may be considered as the founder of this mathematical subject, which we call wavelet analysis. Of course, Meyer's profound contribution to wavelet analysis is much more than being a pioneer of this new mathematical field. For the past ten years, he has been totally committed to its development, not only by building the mathematical foundation, but also by actively promoting the field as an interdisciplinary area of research.\nFor more details about Meyer's work on wavelets, see the information we give about his books on the topic at\nTHIS LINK\n.\nMeyer has been awarded major prizes for his contributions to wavelets. The\nInternational Mathematical Union\nand the\nDeutsche Mathematiker-Vereinigung\nawarded Meyer the\nCarl Friedrich Gauss\nPrize for Applications of Mathematics in\n2010\n[\n7\n]\n:-\n... for fundamental contributions to number theory, operator theory and harmonic analysis, and his pivotal role in the development of wavelets and multiresolution analysis.\nHe was awarded the\nAbel\nprize in\n2017\n[\n1\n]\n:-\n... for his pivotal role in the development of the mathematical theory of wavelets.\nFor more information about this award to Meyer, see\nTHIS LINK\n.\nIn\n2020\nMeyer and\nIngrid Daubechies\nwere jointly awarded the Princess of Asturias Award for Technical and Scientific Research. The jury gave reasons for their choice\n[\n2\n]\n:-\nYves Meyer and\nIngrid Daubechies\nhave led the development of the modern mathematical theory of wavelets, which are like mathematical heartbeats that enable us to approach Van Gogh and discover his style or to listen to the music enclosed in the apparent noise of the Universe, among many other applications of all kinds. In short, they enable us to visualise what we cannot see and listen to what we cannot hear.\nFor more information about this award to Meyer, see\nTHIS LINK\n.\nWe gave some details above about Meyer's address to the International Congress of Mathematicians in Nice, France, in\n1970\n. He was also an invited speaker at the\n1982\nCongress in Warsaw in\n1983\nwhen he presented the paper\nIntégrales singulières, opérateurs multilineares, analyse complexe et équations aux dérivées partielles\nⓉ\n(\nSingular integrals, multilinear operators, complex analysis and partial differential equations\n)\nto the 'Real and Functional Analysis' Section. He was also an invited speaker at the\n1990\nCongress in Kyoto when he gave the talk\nWavelets and Applications\nin the 'Applications of Mathematics to the Sciences' Section.\nIn addition to the awards mentioned above, Meyer was elected to the\nAcadémie des Sciences\nin\n1993\n, elected as an International Member of the American\nNational Academy of Sciences\nin\n2014\n, and elected a Foreign Member of the\nSpanish Academy of Exact, Physical and Natural Sciences\nin January\n2018\n. He has also been elected as a Foreign Honorary Member of the\nAmerican Academy of Arts and Sciences\nin\n1994\n, a fellow of the\nAmerican Mathematical Society\nin\n2013\nand as a Member of the\nRoyal Norwegian Academy of Sciences and Letters\n.\nLet us end this biography with a quote from\n[\n62\n]\n:-\nTo his exceptional creative quality, Meyer combines an open and generous personal attitude that deserves to be highlighted as an example for present and future generations.\nThis quote is illustrated by Meyer's own words\n[\n34\n]\n:-\nThe success of my research is mostly due to my friends. Let me single out Raphy Coifman, and praise a friendship over more than forty years. Working with Alexander Olevskii is a blessing. The success of my research is also due to my incredible students. I shared so much with them. We are a family.\nAlberto Calderón\nwas my spiritual father and my love and gratitude have no bounds.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Number Theory"
  ]
}