{
  "nome_completo": "Yves-André Rocard",
  "nome_curto": "Yves Rocard",
  "ano_nascimento": "1903",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rocard/",
  "lugar_nascimento": "Vannes, France",
  "lugar_morte": "Paris, France",
  "biografia": "Yves Rocard\n's parents were Louis Eugène Rocard\n(1880\n-\n1918)\nand Jeanne Louise Gabrielle Rocard\n(1878\n-\n1935)\n. Louis Rocard, whose parents were Adolphe Rocard and Elisabeth Gaudin, married his cousin Jeanne, the daughter of Simon-Eugène Rocard and Elisabeth Lamblin, on\n23\nAugust\n1902\n. They had three sons, Yves the subject of this biography, born\n1903\n, Marc born\n1904\n, and Robert born\n1913\n. Yves had a problem which became evident when he was five years old - he was deaf. He begins his autobiography\n[\n2\n]\nby saying how his deafness was the most significant thing in making him the person he became:-\nThe quite pronounced deafness which I suffered from the age of five years - with no hope of a cure, because I had punctured eardrums - governed my intellectual life, my character, and my behaviour ...\nThe schools that he attended did little to help him overcome his deafness and he is critical of this in\n[\n2\n]\n. However, he suggests that to some extent this worked to his advantage since it forced him to become independent at a young age and to learn by reading books rather than by listening to teachers. His father Louis fought in the First World War and became a Squadron Leader and commander of the\n3\nrd\n'groupe d'aviation de bombardement'. He survived most of the war but died on\n12\nSeptember\n1918\n, two months before the war ended, when his plane was shot down.\nRocard attended the Lycée Louis-le-Grand in Paris before entering the École Normale Supérieure in\n1922\n. There he shared living quarters with, among others,\nAndré Weil\n. In\n[\n5\n]\nWeil\nwrites:-\nAt the \"École\", as we used to call it, the students were divided into groups sharing quarters. My first concern, even before school started, was to find companionable study mates. There were five of us ...\nThese five were Yves Rocard,\nAndré Weil\n,\nJean Delsarte\n, Paul Labérenne\n(1902\n-\n1985)\n, and Jean Barbotte.\nWeil\nsays of Rocard\n[\n5\n]\n:-\nRocard lost no time in filling his locker with large black notebooks already covered with the tiny but quite legible handwriting in which he recorded his own ideas and calculations on the kinetic theory of gases.\nHowever, Rocard did not think highly of the education he received at the École Normale Supérieure. He writes in\n[\n2\n]\n:-\nThe training at the grandes écoles, by its tough abusive character, causes brain fatigue in the student that distorts and damages his intellectual potential for the rest of his life. We observe a \"hardening of the brain\" which manifests itself by a certain dulling of the imagination. Thinking slows, curiosity diminishes: the student who has completed his task only thinks about sleeping. In return it develops in him a somewhat excessive spirit of criticism. Students would be better to raise their noses from their texts and have a few adventures, even in the intellectual and academic field. In my case, I was very precocious and I had already made outlandish calculations of statistical mechanics; so I felt badly that I was losing out by working to meet my academic obligations, at an age when they should have let my intellect flourish.\nHowever, he went out of his way to get a good education, despite the problems that the École put in his way. For example, the library at the École was closed on Sundays so Rocard put his shoulder to the rickety old library door and forced his way in. In that way, he remarked, he could learn physics in the quiet and in the warm all Sunday.\nHe attended lectures on physics at the École Normale Supérieure by Henri Abraham\n(1868\n-\n1943)\nand Eugène Bloch\n(1878\n-\n1944)\n. He also attended physics courses at the Faculty of Science of the University of Paris by Charles Fabry\n(1867\n-\n1945)\n, Aimé Cotton\n(1869\n-\n1951)\n, Anatole Leduc\n(1856\n-\n1937)\n, and Amédée Guillet\n(1863\n-\n1939)\n. He was placed first in the\nconcours d'agrégation\nin physical sciences in\n1925\nand was awarded the Blumenthal scholarship which enabled him to undertake research for his doctorate. He graduated with a doctorate in mathematics in\n1927\nfrom the University of Paris for his thesis\nL'hydrodynamique et la théorie cinétique des gaz\nⓉ\n(\nHydrodynamics and the kinetic theory of gases\n)\n. The following year he graduated again, this time with a doctorate in physical sciences for his thesis\nThéorie moléculaire de la diffusion de la lumière par les fluides\nⓉ\n(\nMolecular theory of the scattering of light by fluids\n)\n. His advisor was Charles Fabry who had been appointed as Professor of General Physics at the Sorbonne in\n1921\nand was also the director of the Institute of Optics. At the age of\n25\n, Rocard predicted the Raman effect theoretically. However, he wrote\n[\n2\n]\n:-\nIf I had been smarter, better trained in physics, a more conscientious experimenter, I would have discovered the Raman effect.\nHe partly blamed the very poor laboratory facilities at the École Normale Supérieure at the time for his failing to gain the experimental data and he felt that this cost him a Nobel prize. In\n1930\nChandrasekhara Venkata Raman received a Nobel prize for his discovery, which he had published in February\n1928\n. After the award of his two doctorates, Rocard spent ten years working in industry with a parallel academic career. This was a very deliberate move which he made for two reasons. Firstly, to remain in the academic world in France one had to get a first position in a remote university, but he didn't want to leave Paris at this time. Also he believed in close collaboration between industry and the academic world, and what better way to achieve this than to work in both.\nIn\n1928\nhe was employed by Radiotechnique, a subsidiary of the Compagnie Générale de Télégraphie Sans Fil, founded in\n1919\n. This firm manufactured valves for radio receivers. Rocard worked in their Research Laboratories, in particular cooperating with the physicist Maurice Ponte\n(1902\n-\n1983)\n. In this role, Rocard contributed to the development of the pentode, a vacuum tube widely used in electronic equipment before the invention of the transistor. Also at Radiotechnique, he was involved in the development of the radio beacon, a device which broadcasts a radio signal for ships and planes to determine their position. He compared the laboratory facilities available at Radiotechnique to those at the École Normale Supérieure\n[\n2\n]\n:-\nI noticed immediately upon entering the lamp factory that industry was able to perfectly solve many problems that scientists stumbled over in the small laboratory of the École Normale. I remember when we arrived in the morning at the physics laboratory of the École, we often found pumping frames broken with cracks. They were made of blown glass and welded and did not resist because we were unable to find suitable glass for welding. The Radiotechnical meanwhile manufactured thousands of lamps per day, lamps for lighting and TSF lamps which cool without cracking. Industry was, therefore, already ahead of scientists in this field ...\nOn the academic side, Rocard was selected to give the Cours Peccot. The Fondation Claude-Antoine Peccot selects each year mathematicians under the age of\n30\nwho have already made important progress in research, and gives them the opportunity to give lectures on their research topics at the Collège de France. The Caisse Nationale des Sciences was founded in\n1930\nand, two years later, Rocard was appointed as a senior scientist. Later this organisation became the Caisse Nationale de la Recherche Scientifique.\nOn\n24\nOctober\n1929\nin Sèvres, Rocard married the school teacher Renée Favre, born\n23\nMay\n1904\nin Reignier, Haute-Savoie, France. Their son, Michel Rocard was born on\n23\nAugust\n1930\n. Michel went on to become a politician in the Socialist Party and was Prime Minister of France from\n1988\nto\n1991\n. Yves and Renée Rocard were divorced on\n20\nJune\n1963\n.\nReturning to Rocard's academic career, in\n1938\nhe was appointed as a lecturer in physics at the Faculty of Science at Clermont-Ferrand. On\n1\nOctober\n1939\n, he returned to Paris when he was appointed as a lecturer in experimental fluid mechanics at the University of Paris. During World War II, Rocard was a member of a French Resistance group. In a highly dangerous mission, he was flown from France to England in a small airplane and, once in England, he became Head of the Research Department of the Free French Naval Forces. In fact this was to prove a significant time for Rocard in the development of his scientific ideas, for at this time he learnt that radars in England had been shown to have detected strong radio emission from the Sun. Of course this had not been detected during scientific work, rather the solar emission was detected as interfering with the 'proper' war time use of radar. After the war, Rocard returned to France and proposed that France set up a site to conduct radio astronomy. Rocard was even able to get his hands on equipment to start off such a project, providing two German radar mirrors of 'Wurzburg' type each having a\n7\n.\n5\nmeter diameter. Using his wartime contacts, Rocard was able to give his scientists access to the Research Centre of the French Navy at Marcoussis.\nOn\n1\nNovember\n1945\n, after World War II, Rocard was appointed to the chair of physics at École Normale Supérieure, replacing Georges Bruhat\n(\nthe father of\nFrançois Bruhat\nand\nYvonne Choquet-Bruhat\n)\n, and as Director of the Physics Laboratory of the École Normale Supérieure. He continued in the role of Director until\n1972\n. He was appointed as scientific advisor on military programmes to the French government in\n1947\n. By\n1952\n, despite the pioneering work in radio astronomy in France, it became clear that others were using more powerful instruments and the French could not compete. Rocard gave strong support to the project and the French Ministry of National Education gave\n25\nmillion Francs to the École Normale Supérieure. A site was found for the radio astronomy observatory at Nançay in the Cher region,\n200\nkm due south of Paris. In addition to his work on radio astronomy, Rocard contributed to the development of the French atomic bomb. He had been appointed as chief scientist in the French nuclear weapons programme in\n1951\n. Carl Romney, an American who did important work on detecting nuclear explosions at long ranges, writes in\n[\n3\n]\n:-\nI made several trips to France in the early\n1960\ns to meet with Professor Yves Rocard and his staff. Professor Rocard, who had been the French representative at the Conference of Experts, was a professor of physics at the University of Paris. A main interest of his was the physical effects of atomic explosions, including those that can be detected at long range. Rocard had made measurements of EMP\n(\nelectromagnetic pulse\n)\ngenerated by the first French atomic test, a shot on a tower in the Sahara in what is now Algeria. He had established a network of seismic stations in France, and in several foreign locations where there was a strong French presence. ... Rocard also visited us in the United States. ... Rocard had developed\n[\na\n]\nstrategy for locating his\n[\nseismic\n]\nstations: he procured old chateaus, usually on relatively large estates, and placed his seismometers in basements, abandoned root cellars, etc. He explained that prices were relatively low because taxes on such places were prohibitive for most individuals, but he could arrange for purchase through the tax-free university.\nHe also undertook research into semiconductors and seismology. In the last part of his life he studied biomagnetism and dowsing which reduced his standing in the eyes of many of his colleagues. However, we should record Rocard's own statements about using water diving rods\n[\n12\n]\n:-\n... water that filters in porous areas under the action of a pressure difference, brings about electrokinetic potential through the Quincke effect which has been well-known since\n1850\n. These potentials cause electric currents to circulate in the earth. In addition, in many cases, nearby phenomena related to the presence of water cause consequential potential differences in the ground which are often more important.\nLet us look briefly as some of the many books that Rocard published. In\n1932\nhe published\nL'Hydrodynamique et la Théorie Cinétique des Gaz\nⓉ\n(\nHydrodynamics and the kinetic theory of gases\n)\n.\nSydney Goldstein\nwrites in the review\n[\n7\n]\n:-\nM Rocard's book is timely, and provides a good introduction to the difficult subject of the application of the kinetic theory of gases to hydrodynamics. His methods and assumptions are always clear. Basing his extensions on Professor\nChapman\n's work, M Rocard has himself made valuable contributions to the subject in recent years. In this book, he opens with a readable account of the fundamentals of the kinetic theory of gases, and finds the usual equations of motion, and expressions for the viscosity for various molecular models. He deals with compressed and rarefied gases, and with mixtures of gases. The author's work on compressed gases has met with criticism, and he himself recognises, in an appendix, that his formula for the viscosity shows a decrease in viscosity with increasing pressure, which is contrary to experiment; and he shows how other models would lead to a different result. It is in the last chapters, where the author considers boundary conditions, that his results will probably be treated with most reserve.\nIn\n1941\nRocard published\nThéorie des Oscillateurs\nⓉ\n(\nTheory of Oscillators\n)\n. Nicholas Chako writes in a review:-\nThe author gives an excellent treatment of the theory of oscillations in general and electrical oscillations in particular.\nRocard published\nDynamique Générale des Vibrations\nⓉ\n(\nGeneral dynamics of vibrations\n)\nin\n1943\n. Nicholas Chako also reviewed this book and begins his review as follows:-\nThe author has divided the book into two parts covering respectively the general theory of vibrations and the theory of acoustic waves.\nIn\n1951\nhe published\nElectricité\nⓉ\n(\nElectricity\n)\n. A second edition appeared in\n1956\nand a third edition ten years later. Reviewing the second edition, V A Johnson writes\n[\n9\n]\n:-\nIn this work the author attempts to describe all electric and electromagnetic phenomena from those found in a first course in physics to those in a graduate-level course in electricity. On the average, the plane of discussion is near that of an intermediate course in electricity. It is assumed that the reader has some facility in mathematics and thus is familiar with the common vector operations, simple manipulations with complex variables, linear differential equations, and series expansions. The book is characterized by considerable breadth in the range of topics treated. This range is indicated by a list of the section headings: electrostatics, magnetism, electrokinetics, electrodynamlcs, alternating currents, propagation of radiation, free electrons\n(\nincluding electron optics, photoelectricity, thermionic emission, and electron tubes\n)\n, ionic conductors and semiconductors, and units. A strong point of the work is that the author gives a clear and logical physical description of each phenomenon he introduces and thus keeps in focus the field of electricity as interrelated physical phenomena. The related mathematical treatment is given secondary emphasis.\nThe book\nGeneral dynamics of vibrations\n, written in English, was published in\n1960\n. David Russell Bland writes in a review:-\nThis book differs from the usual engineering treatments of the theory of vibrations in the range of the physical applications considered. These are drawn from the acoustics and electronics of radio engineering, from applied elasticity, from gyroscopes and from pure physics. The book's value to applied mathematicians will be twofold, as a provider of illustrations for a theoretical course in vibrations and as a source of the standard engineering treatments of practically important oscillation phenomena. Topics covered include the general concept of impedance, stability, non-linear oscillations and the theory of sound with special reference to radiation and diffraction.\nA number of people who met Rocard in the\n1960\ns wrote about their experiences and from these we gain some insight into Rocard's character. For example Carl Romney writes in\n[\n3\n]\n:-\n[\nRocard\n]\ncould read English well, and speak heavily accented English, but he had difficulty\n(\nin part from deafness\n)\nin understanding spoken English. ... He was an avid storyteller, mostly done through a member of his staff more fluent than he in English. He was a gourmet and expert wine-taster. I remember a superb dinner with him in Paris at the apartment of Madam Rudeau, his mistress.\n(\nI have been told by an assistant that Madam Rocard was alive, but the two lived separate lives.\n)\nThe meal featured an expertly stuffed pork loin roast and the best champagne I ever tasted. On another occasion at an unpretentious country inn near one of his seismic stations in central France, we were treated to a fabulous seven-course Sunday dinner featuring coq au vin with a wonderful Bordeaux wine. An entire cake was served for dessert to our table of three.\nAlso Jacques Vallée, a French astronomer and author who worked for most of his career in the United States, writes in\n[\n4\n]\n:-\nParis. Monday\n1\nAugust\n1966\n. ... Rocard was inviting us for lunch. We found the professor in his office at École Normale Supérieure, and all of a sudden I was thrown back ten years, even a hundred years. Dusty bookshelves, glass walls along endless dark corridors, creaking wooden floors. ... Also Rocard himself, perhaps the most powerful physicist in France, cultivating the look of a schoolmaster in a nineteenth century provincial college. He looks short and grey, with a sad little moustache. But he is a brilliant man under this unassuming appearance; his eyes burn with wit and with a sly caution of bureaucrats: \"In my position, there isn't much I can do., you realise that, don't you? Of course, I do have a few contacts. ...\" I had to remind myself that I was speaking to someone who invented nuclear bombs for a living.\nRocard suffered from kidney problems towards the end of his life. He died at his home in Paris in\n1992\nand was buried in a family grave in the Cimetière du Montparnasse in Paris.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}