{
  "nome_completo": "Anna Zofia Krygowska",
  "nome_curto": "Zofia Krygowska",
  "ano_nascimento": "1904",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krygowska_Zofia/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Zofia Krygowska\nwas the daughter of Bolesław Czarkowski and Maria Tekla Srokowska. She was given the name of\nAnna Zofia Czarkowska\nand only became known as\nAnna Zofia Krygowska\nafter her marriage in\n1937\n. To put her life in context, we need to give a very brief account of Polish history. The Second Partition of Poland in\n1793\ndivided the country between Prussia, Russia and Austria. The idea of re-establishing Poland as an independent country persisted, however, and there were a number of armed uprisings like the January Uprising of\n1863\n-\n64\n, but all of these failed. Bolesław Czarkowski was born on\n17\nJune\n1873\nin Leniewo, a village south east of Białystok. He became a bricklayer and, while working in Warsaw, became active in the Polish Socialist Party\n(\nPPS\n)\n. He was arrested by the Russian police and first imprisoned, then exiled to Eastern Siberia. Back in Poland in\n1900\nhe continued to work for the PPS, arguing strongly that their main aim should be Polish independence. Józef Piłsudski led the PPS with Czarkowski as one of his strongest supporters on the Central Workers' Committee. Threatened with arrest, Czarkowski fled to Lwów, in the Austrian Empire, where he married Maria Tekla Srokowska in\n1904\n. Maria Tekla was, like Bolesław Czarkowski, actively working for an independent Poland and fleeing for her safety from the Russian controlled region. The first of their four children Anna Zofia Krygowska, the subject of this biography, was born later in\n1904\nin Lwów. They had two younger daughters Halina and Wanda, and one younger son.\nThe family moved from Lwów to settle in the Kasprusie area of Zakopane in the south part of the Podhale region at the foot of the Tatra Mountains.\nZofia attended both primary and secondary school in Zakopane. She said\n[\n13\n]\n:-\n... in my childhood and my youth, such a big role was played by two great passions that I had. Namely - this is very funny to say to students today - one of my passions was school, and the other was the mountains.\nAt the Gymnasium in Zakopane, she received a humanistic education. She learnt French, German and Latin, and read books in these languages. She also loved mathematics and this played a special role for her since she was able to help support the family by giving private mathematics tutoring. She wrote\n[\n13\n]\n:-\nMy family conditions were terrible: it was poverty, there were five people in one room and in terrible conditions; I spent whole afternoons giving private lessons; I was very poorly dressed, I never had good shoes, I never had a decent coat. But above all of that was this passion.\nHer sister Halina wrote about Zofia's childhood in\n[\n30\n]\n:-\nShe was a lively and cheerful child, but at the same time exceptionally independent and responsible. That is why she was allowed to sit at the table with the adults, while her two younger sisters and brother took places at the children's table. There was not much money in the house: there was often a lack of food, nor was there enough for clothes, for example Zofia wore shoes sewn from a blanket. She helped support the family by giving private lessons in mathematics.\nShe taught others for four hours every day, and for the next four, often at night, she studied by herself. Apart from that, she practically \"devoured\" books. Thanks to the excellent Latin, French and German lessons conducted at school, she was able to read some of the reading material, and she read it willingly, in the original.\nDespite all her activities, she found time to look after her younger siblings, as well as to think about their pleasures. - She wrote fairy tales for Wanda, and for me she ran around Krupówki\n[\nthe street where they lived\n]\nand asked in the doll shop if they had any broken toys. If she managed to get one, she tried to fix it in her own way and in the morning I would find it by my bed.\nShe graduated from the Gymnasium in Zakopane in\n1922\n. This school had been founded in\n1912\nto provide a secondary school for Polish students who could move there because they needed fresh mountain air for their health. In\n1937\nit was given the name Oswald Balzer State Grammar School and High School in Zakopane and it is still known by that name today. We saw from Zofia's quote above that her second passion was the mountains. She began climbing in the Tatra mountains while at school. Women had only gone climbing in earlier days in expeditions led by men, but by the\n1920\ns all women teams began climbing in the Tatras. Despite the poor conditions she lived in, Zofia began climbing with her friends while at school. She said\n[\n13\n]\n:-\nI had no equipment, terrible shoes, some awful trousers pulled out from somewhere, somehow darned - and wonderful experiences in the mountains; wonderful! It is unforgettable!\nThe humanities were considered the most important subjects and Zofia had shown exceptional talent in these subjects so it was expected that she would go the university and study humanities. She was promised a scholarship from the Ministry of Education if she studied those subjects but Zofia felt that mathematics was the subject for her and so she applied to Jagiellonian University in Kraków to study mathematics. She entered the Jagiellonian University in\n1923\nwith no scholarship, and had to support herself financially giving private tuition. She wrote\n[\n13\n]\n:-\nWithout a student house, absolutely without any scholarship, supporting myself solely with lessons, from the very beginning with these lessons, in addition to which I also had to help my mother and younger siblings. As a result, I studied for a long time, because I had to spread out my studies; I could not do it at the same pace as my colleagues who had good conditions.\nAt the Jagiellonian University in Kraków, Zofia attended lectures by\nWitold Wilkosz\n.\nAndrzej Turowicz\n, who began his studies of mathematics at Kraków one year before Zofia, wrote\n[\n38\n]\n:-\nWhen I came for my first year of studies at the university, there were no assistants. The so-called \"proseminarium\"\n[\na pre-seminar\n]\n, which preceded the recitations, was led by\ndocent\nLeja\n. I was in this pre-seminar of his. He was a high school professor and had contract classes at the university. Only when I entered the second year,\nWilkosz\ntook care to have two deputy assistants nominated, that is Jan Józef Leśniak\n(1901\n-\n1980)\nand Irena Wilkosz\n(\nWilkosz\n's wife who was a mathematician\n)\n.\nWilkosz\nhad an excellent reputation as a lecturer\n[\n26\n]\n:-\nWitold Wilkosz\nwas a passionate and excellent lecturer. Working with young people gave him great joy. His lectures were very well attended. He taught a wide variety of topics in an innovative way: set theory, topology, theory of functions of real variables, vector analysis and algebra. ... He was passionate about teaching mathematics not only at the university level, but also at its earlier levels.\nZofia continued her passion for mathematics, particularly for teaching mathematics, which was made even stronger by\nWilkosz\n[\n13\n]\n:-\n[\nWilkosz\n]\nawakened in us a passion for teaching mathematics, for finding means of good teaching, for involving people in mathematical thinking. He was somehow able to convey this to us, even though he was a man of great imagination; he was also a great humanist, he knew music wonderfully, painting wonderfully, literature. And he was also a mathematician and somehow everything worked well together.\nOf course, Zofia returned to Zakopane for the summer vacations and when there continued her love of climbing in the Tatra mountains. Just before returning to Kraków for the\n1925\n-\n26\nsession, Zofia set off with an older friend, a relatively inexperienced climber, to climb Zadni Kościelec, a peak in the High Tatras on the ridge between Mylna Przełęcz and Kościelecowa Przełęcz. She was leading, roped to her companion, when she slipped. The rope broke and she fell\n[\n15\n]\n:-\nA flight of a dozen or so metres in the air and a slide with an avalanche of rocks to the edge of a precipitous wall ended with serious head injuries and damage to the eye. It can be said that this expedition exceeded the participants' capabilities.\nShe was ill for a whole year after this accident but she was soon back climbing in the summer vacation with Jadwiga Honowska\n(1904\n-\n1928)\n, who was also studying mathematics at the Jagiellonian University. They climbed Zadni Kościelec in the summer of\n1927\n, two years after Zofia had fallen there. In the following year Honowska suggested to Zofia that they climb Ostry Szczyt but Zofia had met Władysław Krygowski and arranged to climb with him that August. Honowska then asked Zofia Krokowska to climb with her and, on\n19\nAugust\n1928\nthey both fell and died in the accident. A few days earlier, on\n6\nAugust\n1928\n, Zofia and Władysław had made a first ascent of Dwoista Turnia, a peak\n2312\nm above sea level in the Wieliczka Granaty massif, in the Slovak High Tatras.\nBy the time Zofia made that ascent with Władysław Krygowski, her future husband, she was teaching in Gymnasiums in Kraków. She had graduated from the Jagiellonian University in\n1927\nand begun her career as a mathematics teacher in secondary schools\n[\n30\n]\n:-\nShe was a teacher by vocation, and at the same time a scientist observing the process of acquiring mathematical knowledge by students. She analysed the difficulties of students resulting from mathematical content and psychological conditions. With characteristic persistence, she strived to reach each student with mathematical knowledge. The experience gained there was extremely important in her later scientific activity.\nHer first publications on teaching mathematics were the paper\nOn the Notion of Limit in School-Teaching of Mathematics\n(\nPolish\n)\n(1936)\nand the book\nMathematics for the First Form of Grammar School\n(\nPolish\n)\n(1937)\n.\nOn\n27\nJuly\n1937\n, Zofia married Władysław Maria Antoni Krygowski\n(1996\n-\n1998)\n, the son of the Kraków attorney Stanisław Krygowski and his wife Maria Stycznia. Władysław Krygowski had graduated with a law degree from the Jagiellonian University in\n1928\nand after passing the exams of the Kraków Bar Association in\n1936\n, he worked in his father's firm. His real love, however, was mountain tourism.\nThe German invasion of Poland on\n1\nSeptember\n1939\nbegan World War II. By the first week of September\n1939\nthe German army occupied Kraków. The German invasion was not a surprise and Poland had already mobilised their reserves. In August\n1939\nWładysław Krygowski had been mobilised and as a reserve second lieutenant he took part in the September campaign with the\n3\nrd battalion of the\n12\nth Infantry Regiment from Wadowice. After crossing the Romanian border he was interned, first in Romania, then in an oflag in Dorsten and then in one in Dössel. He remained in captivity until he was freed by the Americans in\n1945\n. It was May\n1947\nbefore he was able to make contact with his wife.\nIn January\n1940\n, Włodzimierz Gałecki began to organise a secret educational administration in Kraków. He wrote in his memoirs\n[\n15\n]\n:-\nSince I managed to bring together only six people in cooperation with me ... this modest number was not enough to quickly organise the area, especially in dangerous conditions of movement. We expanded our group with two dedicated colleagues from among Kraków secondary school teachers. They were Zofia Krygowska and Maria Gołkówna. Both paid for their travels with dangerous typhus, from which fortunately they emerged unscathed.\nZofia Krygowska worked for the secret education throughout the war. She gave details in\n[\n13\n]\n:-\nI not only taught, but I was a courier for the secret school authorities. During one of these business trips to the Vilia River, the Germans locked us up in Tarnów at the station for the whole night, in such a small room, terribly crushed. At that time, the war with Russia was already underway, the Germans were returning from the Eastern Front, swarming with lice; and apparently one of these lice bit me, so that I fell seriously ill with typhus. Later, I was offered such a position in an enterprise, which consisted of many sawmills scattered around the Gorce Mountains, Ochotnica, Tylmanowa, Krościenko. I was to work as an accountant, and at the same time I was to conduct secret education, because the director of secret education in Podhale had to flee\n(\nthey arrested his wife and wanted to arrest him as well\n)\n. The school authorities simply sent me there in that role, and I was officially registered as an accountant in that enterprise. And here again the mountains were associated with my activity, because I was obliged to travel or walk all over Podhale to inspect the secret education centres in Rabka, Zakopane, Maków, Jordanów, Ochotnica Wielka near Turbacz. This job made it easier for me, because these were sawmills, so I went to inspect sawmills. I knew a lot about wood!... So I went to the sawmill and at the same time I inspected schools and organised final exams. All of this had to be well supervised.\nIt was a terrifying experience for her, she had nightmares most nights about the danger she was in, but felt she had to do all she could for the Polish youth whose dignity was being humiliated.\nAfter the war Krygowska began working at the University of Kraków on writing a doctoral dissertation. She was advised by\nTadeusz Ważewski\n. At the same time she worked at the Methodological Centre of Mathematics in Kraków from\n1948\nto\n1951\nand at the Pedagogical University of Kraków, at first called the Pedagogical College, from\n1949\n. This College had been established in May\n1946\nand teaching there began in October of that year. The first Department of Methodology of Teaching Mathematics in Poland was established at the Pedagogical University in\n1958\n. With Zofia Krygowska as its head, it began with one associate professor, two assistants and three secondary school teachers working on contract hours. She continued to head this Department until she retired in\n1974\n.\nIn\n1950\nshe was awarded a doctorate in mathematics by the Jagiellonian University for her thesis\nOn the Limits of Strictness in the Teaching of the Elements of Geometry\n(\nPolish\n)\n. In the same year she published two papers in\nMatematyka\nnamely\nOn the functional method of teaching mathematics\n(\nPolish\n)\nand\nOn the demonstration method of teaching mathematics\n(\nPolish\n)\n. In\n1953\n, she published another paper in\nMatematyka\nnamely\nOn the teaching practice\n(\nPolish\n)\n.\nShe was the main author of\nThe Teaching of Geometry in School\n(\nPolish\n)\n(1954)\n. Bogdan Nowecki writes\n[\n17\n]\n:-\nIn the chapters prepared by A Z Krygowska\n(\nthe majority of them\n)\n, are found explanations of many of the problems in the methodology of teaching geometry. Various elements of mathematical language were very clearly presented. The complete\nHilbert\naxioms for Euclidean geometry were presented with various modifications and very detailed substantive didactical and historical comments provided. The depth of thinking of the author is evident in the consideration given to the definitions, theorems and their proof, in the analysis and methods of solving construction problems, and in the selection of the considerable material taking into account the needs for the teaching of geometry. It would not be an exaggeration to assert that this was the first Polish work on the didactics of mathematics.\nIn\n[\n40\n]\nKrygowska writes that in the papers in\nMatematyka\nand in\nThe Teaching of Geometry in School\n1954\nbook:-\n... I often deal with the significance of various forms of pupils' activities in the process of teaching mathematics. This activity should be recognised as a substantive activity, as a process of imagining and conceptualising. This activity, always connected with imagination and thinking, concerns model building, drawing constructions, measuring and transforming. It is done directly on specific models which exist in the surroundings of the pupils. It also means the observation of many real phenomena from the viewpoint of mathematics as well as the simple, straightforward written calculations. An intensive process of imagination is required to solve mathematical problems. It involves the use of real objects\n(\nmodels\n)\nand designs directly seen by the pupil but transformed in the pupil's imagination. It also involves the process of direct imagination without the observation of real objects. When we speak of conceptualising, we mean abstracting mathematical operations to create a significant element in mathematical thinking. The aim of the teacher is consciously to organise the pupil's activity, the substantive activities of imagining and conceiving. This is a fundamental element in the teaching of mathematics \"from reality to abstraction and from abstraction to practice\" - it is the basis of teaching in which an active involvement of students is produced. This will be called the \"functional method\" of teaching.\nKrygowska described the \"didactics of mathematics\" in the first issue of\nDidactica Mathematicae\nin\n1982\n:-\nDidactics of mathematics is a science whose problems include all issues related to learning and teaching mathematics. Today, it is developing as an autonomous science, although research conducted in this field is largely interdisciplinary in nature. Although the specificity of the problems of learning and teaching mathematics does not allow for their complete inclusion in any of the other already developed disciplines, these problems appear and are most often considered on the borders of sciences as diverse in terms of subject matter and methodology as mathematics, its methodology and history, psychology, computer science, cybernetics, and linguistics. Solving such borderline issues requires the integration of various research methods, from theoretical analyses to empirical methods of various types.\nIt was not only in Poland that Krygowska became known as the leading expert on the didactics of mathematics, but her reputation soon became worldwide. This is illustrated by the fact that she was invited to give a lecture to the International Congress of Mathematicians in Nice, France, in September\n1970\n. She delivered the talk\nProblems of modern training of mathematics teachers\nin French. You can read an English translation at\nTHIS LINK\n.\nIn\n1981\nshe published the book\nConcepts of universal mathematical education in the school curriculum reforms of\n1960\n-\n1980\n(\nPolish\n)\n. We give English translations of extracts from this outstanding work and also a translation of an excellent review by Aniela Ehrenfeucht at\nTHIS LINK\n.\nOne of the ideas to which Krygowska's name is attached today is the idea of a \"blessed error\". She gave the paper\nTo understand errors in mathematics\n(\nFrench\n)\nas the opening address at the conference organised by the International Commission for the Study and Improvement of Mathematics Teaching, held at Sherbrooke, Canada,\n27\nJuly -\n1\nAugust\n1987\n. Maria Samborska summarises Krygowska's lecture in\n[\n41\n]\n:-\nKrygowska stated that if misunderstanding comes to light early enough as the student's error, this is a \"blessed error\", which can and should be used to make further progress. The teacher should aspire for all ideas and solutions, both correct and wrong, to be analysed and critiqued by the students. This is also a way of establishing the authority of mathematical logics - it should not be the teacher, but the logics of mathematics which decide the truth in a mathematics classroom. It is also worth encouraging students to formulate sentences properly and to use mathematical language correctly, but the main focus should be on making sense of mathematics, not on the correct answer or precision.\nFor an English translation of Krygowska's paper\nTo understand errors in mathematics\nsee\nTHIS LINK\n.\nFor her outstanding work, Krygowska received many awards and distinctions, including: the Officer's Cross of the Order of the Polish Army\n(1967)\n, the Banner of Labour,\n1\nst class\n(1984)\n, the Medal of the National Education Commission, the Medal of the\n10\nth Anniversary of the Polish People's Republic, the Medal of the\n30\nth Anniversary of the Polish People's Republic, and the Medal of the\n40\nth Anniversary of the Polish People's Republic. She received an honorary doctorate from the Higher School of Pedagogy in Kraków in\n1977\n. She was elected Honorary President of the Commission Internationale pour l'Étude et l'Amélioration de l'Enseignement des Mathematiques\n(1975)\n. The General Assembly of the\nPolish Mathematical Society\nawarded her the title of honorary member on\n4\nJune\n1977\n.\nAfter her death in Kraków in May\n1988\n, she was buried in Rakowicki Cemetery. Let us end with a quote from\n[\n33\n]\n:-\nShe died in her full creative powers, leaving unaccomplished projects, an unfinished book; sketches of talks and papers for CIEAEM-\n40\n[\nthe Commission for the Study and Improvement of Mathematics Teaching\n]\nand ICME-\n6\n[\nInternational Congress on Mathematical Education\n]\nin Budapest where her absence was felt painfully ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}