{
  "nome_completo": "Zoltán Pál Dienes",
  "nome_curto": "Zoltán Dienes",
  "ano_nascimento": "1916",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dienes_Zoltan/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Wolfville, Nova Scotia, Canada",
  "biografia": "Zoltán Pál Dienes\nis also known as\nZoltan Paul Dienes\nbut often simply as\nZoltan Dienes\n. He was the son of the mathematician\nPaul Dienes\n, who has a biography in this archive, and his wife Valéria Anna Geiger\n(1879\n-\n1978)\n.\nPaul\nand Valéria Dienes were married in December\n1905\nand had two children, Gedeon Dienes\n(\nborn in Budapest on\n16\nDecember\n1914)\nand Zoltán Pál Dienes, the subject of this biography. Gedeon Dienes learnt English, French, German, Swedish, Italian and Russian and became a secretary at the Foreign Office. He represented Hungary at the peace conference at the end of World War II. He later worked in the Publishing House of the\nHungarian Academy of Sciences\n, then became interested in dance, writing articles in many languages and founding a Budapest dance company.\nBéla Kun was a Hungarian Communist revolutionary and politician who, with Soviet support, led a successful\ncoup d'état\nand proclaimed the Hungarian Soviet Republic following World War I. Zoltan's father was a strong supporter of Béla Kun and, after the Hungarian Soviet Republic was formed in March\n1919\n, became the head of the committee appointed to run the University of Budapest and also took part in the organisation of the Marx-Engels Workers' University. In mid July\n1919\n, the Romanian army attacked Hungary, and when the Red Army failed to come to their aid, Béla Ku fled the country. Counter-revolutionaries started to hunt down supporters of Béla Kun and execute them and\nPaul Dienes\n, Zoltan's father, escaped to Vienna. Zoltan, his mother Valéria, his brother Gedeon and Sari Chylinska, a close friend of Zoltan's father, joined\nPaul Dienes\nin Vienna in the autumn of\n1920\n. Gedeon and Zoltan were put into a Montessori children's home where they could stay without paying. Zoltan wrote\n[\n14\n]\n:-\nI distinctly remember my first night in the \"Kinderheim\". I lay on a small bed and sobbed and sobbed all night, not knowing what was happening, and one of the members of staff stayed with me all night and held my hand and tried to console me, of which I of course understood not a word, as it was all in German. But I did realise that she was trying to be kind, and I am eternally grateful for her patience with me on that first terrifying night.\nZoltan's parents decided to divorce and, after about a year in the Montessori children's home in Vienna, Zoltan, his brother and his mother, went to Nice in France where they lived in a commune run by Raymond Duncan, the brother of the dancer Isadora Duncan. The way the commune was run meant that children were common property of all the adults and Zoltan had to call his mother Valéria. \"Mother\" could not be used. All the children dressed in the same style ancient Greek clothes and could only go out of the commune as a unit with every child present. He had learnt German while in Vienna but now soon learned French. After several months, the commune moved from Nice to Paris. Zoltan learnt to read and write in the commune and wrote a weekly letter to his father\nPaul Dienes\n.\nOne day Valéria took Zoltan and Gedeon to the train station and they travelled by train to the Bavarian town of Oberammergau where they met\nPaul Dienes\nand his new wife Sari. By this time\nPaul Dienes\nwas employed in Aberystwyth, in Wales, so they could buy things with English pounds while Germans struggled to cope with hyperinflation. When\nPaul\nand Sari Dienes went back to Wales, Valéria, Zoltan and Gedeon went to live with their grandmother in Pápa in Hungary. Zoltan attended primary school, first in Pápa and then in Budapest, before continuing his secondary education at the Piarista Gimnazium in Budapest. This Priarist school had been founded in\n1717\nbut between\n1913\nand\n1917\na large-scale construction had taken place, with new buildings housing the grammar school, the convent, the student house, and the provincial headquarters. Zoltan found mathematics easy\n[\n32\n]\n:-\nMathematics in school was mostly boring for him, he preferred solving differential equations under the desk. Fortunately his teacher did not punish him for his lack of attention, rather he decided to facilitate him through private discussions.\nZoltan would spend the summers with his father\nPaul\nand his wife Sari travelling in France, Germany, Hungary, Italy and Transylvania. This gave Zoltan two very different world views. His mother Valéria was a Roman Catholic so he was being educated at the Catholic Priarist school in Budapest. His father\nPaul\n, however, was a Communist. Interestingly, Zoltan did not end up as either a Roman Catholic or a Communist but would, for the greater part of his life, be an enthusiastic member of the Quakers.\nIn\n1929\nPaul Dienes\nhad become a reader at Birkbeck College in the University of London. Around\n1931\n, Zoltan came to England to join his father looking to continue his education in England. Although he spoke Hungarian, German, French and Italian, Zoltan had little knowledge of English. He recalls in\n[\n14\n]\nhow he managed to overcame this obstacle:-\nMy father had a long telephone call with Bill Curry, the headmaster\n[\nof Dartington Hall School near Totnes in Devon\n]\n, who said he would come and see me in two weeks' time. My father said to me, 'You have two weeks to learn English! Go to it!' ...\n'Have you read anything in English?' asked Mr Curry. 'Yes, I am reading David Copperfield,' I answered in a very thick Hungarian accent. 'I have read about half of the book.' 'Tell me about it,' said Mr Curry. In somewhat broken English, I tried to give him an idea of the plot to the point where I was in the story. 'How long have you been studying English?' was the next query. 'I started two weeks ago,' I replied. At this point he indicated that the interview was at an end and went to talk with my father in another room. After he had departed, my father came towards me smiling, finding me already at work on David Copperfield, and informed me that I could indeed go to Dartington Hall School. So the continuation of my education was assured and I could look forward to some interesting times in one of the most avant-garde schools in the country.\nDartington Hall School had been founded in\n1926\nand it was a co-educational boarding school. The school was set up to have:-\n... no corporal punishment, indeed no punishment at all; no prefects; no uniforms; no Officers' Training Corps; no segregation of the sexes; no compulsory games, compulsory religion or compulsory anything else, no more Latin, no more Greek; no competition; no jingoism.\nZoltan Dienes graduated from Dartington Hall School in\n1934\nhaving taken the Oxford and Cambridge Joint Board Examinations. Later that same year he entered University College, London, where he studied Latin, German, Pure Mathematics and Applied Mathematics. He graduated in\n1937\nwith a B.A. with Honours in Pure and Applied Mathematics and continued to study for a Ph.D. He spoke about his early interest in mathematics, saying\n[\n9\n]\n:-\nMy interest in mathematics goes back to childhood and early youth. Along with most mathematicians, I felt, quite early, the fascination of the purely abstract. At quite an early stage, a fascinating problem seemed to me why mathematicians were divided, if rather unevenly, between formalists and intuitionists. This interest found expression in my doctoral thesis in which I tried to compare\nBorel\n's mathematical realism with\nBrouwer\n's intuitionism.\nHis research was on the foundations of mathematics and he studied the logical and philosophical difficulties in the foundations of mathematics, mostly from an intuitionist point of view. He was awarded a Ph.D. in\n1939\nfor his thesis\nConstructivist Foundations of Mathematics According to Borel and Brouwer\n. His first paper,\nCanonic Elements in the Higher Classes of Borel Sets\n, was published in the\nJournal\nof the\nLondon Mathematical Society\n. In it he thanks the referee and his father\nPaul Dienes\nfor simplifying the proof of one of his theorems.\nIn\n1938\nDienes married Mina Joyce Timms\n(\nalso known as Mina Joyce Cooke\n)\n(18\nNovember\n1920\n-\n17\nOctober\n2006)\nwho was known to all as Tessa. Dienes had met Tessa soon after arriving in England, Tessa's family being friendly with\nPaul Dienes\n. Richard George Cooke\n(1895\n-\n1965)\nwas a mathematician who worked with\nPaul Dienes\n, the two writing a joint paper. Richard Cooke married Rosalind Marion Timms in\n1920\nand then married Gabrielle Sylvia Barnard in\n1938\n. We note that Richard Cooke wrote the\nLondon Mathematical Society\nobituary of\nPaul Dienes\n. Zoltan and Tessa Dienes had five children: Corin Ruth Jasmine Dienes\n(1939\n-\n2010)\n, Nigel Anthony Dienes\n(1942\n-\n1992)\n, Jancis Nicola Dienes\n(\nborn\n1944)\n, Sorrel\n(\nnow Sarah\n)\nDienes and Bruce Dienes. Tessa\n[\n37\n]\n:-\n... loved children, poetry, dance and all things beautiful.\nAfter graduating with his doctorate, Dienes began a career as a teacher at Highgate School in London in\n1940\n. This famous independent school had been founded in the middle of the\n16\nth century. After teaching for a year at Highgate, Dienes was appointed as a mathematics teacher at Dartington Hall School where he had been a pupil. Again he spent a year teaching but felt that he did not want to make a long-term career as a school teacher so began applying for university positions. In\n1942\nhe was appointed to a Mathematics Lectureship at the University of Southampton. After two years at Southampton, he was appointed as an Assistant Lecturer in Mathematics at the University of Sheffield. Again this was a position he held for two years\n1944\n-\n46\n, after which he was an Assistant Lecturer in Mathematics at the University of Manchester during\n1946\n-\n48\n, before being appointed as a Lecturer in Mathematics at the University College of Leicester\n(\nnow the University of Leicester\n)\nin\n1948\n.\nAt Leicester, in addition to lecturing in mathematics, he attended courses in the Education Department from\n1950\nto\n1953\nand was awarded a Diploma in Education by University College of Leicester in\n1953\n. He explained his thinking in\n[\n9\n]\n:-\n... I tried to put a price tag on mathematical notions and theorems through analysing the assumptions in terms of quantifiers and their uses which had to be made to define these notions or to prove these theorems. I spoke about this work at Turin University in\n1951\nand published my considerations in the reports of the Turin Mathematical Seminar.\nThe publication that he refers to in this quote is\nSulla definizione dei gradi di rigore\nⓉ\n(\nOn the definition of the degrees of rigour\n)\n(1952)\n. After the award of the Diploma in Education, Dienes continued to teach mathematics at Leicester while becoming an external student of University of London in psychology. Supplementary Psychology was added to his existing University of London degree in July\n1955\n. To understand why he moved towards psychology, we quote from\n[\n32\n]\n:-\nIn his lectures\n[\nat Leicester\n]\nhe used a structural approach to mathematics: he would tell his students to forget everything they had learned before, so they could rebuild mathematics together. It was his belief, that looking at mathematics from a mathematical perspective is fundamentally different from just memorising complex problem solving strategies. But this message did not spark much enthusiasm then, only years later, when his audience changed to elementary school students did he manage to truly inspire.\nAround this time he began to be concerned about the amount of impact he could have as a researcher. More and more he began to feel that he could contribute much more by changing mathematics education. It became increasingly clear to him that the subject was taught in a wrong way: that what he saw as beautiful and exciting was commonly regarded as scary and boring. He began connecting his research to learning processes: he thought there had to be a connection between ideas about the foundations of mathematics and learning the subject. Many look at mathematics as a closed science based on axioms carved into stone. On the other hand, people like\nÉmile Borel\n, one of the mathematicians Dienes considered to be a role model, saw mathematics much more as a constructive and thus open discipline. This is how he came to recognise that the personality of children and their mathematical conceptualisation may be more closely related. He found proof of this in his experiments at the University of London, where he studied psychology. He came to the conclusion that constructive thinking is much more characteristic of children than analytical thinking, and that children of age ten were much more able in certain types of mathematical problem solving than it was believed at the time.\nIn\n1959\nDienes published the two books\nConcept Formation and Personality\nand\nThe growth of mathematical concepts in children through experience\nwhere he presented details of his work with\n10\n-year old children. He aimed, as the Introduction to the second of these states, to:-\n.... show that there are ways in which mathematical concepts can be caused to develop in children so that the techniques they learn are preceded by an understanding of the corresponding mathematical structures.\nFor more information on these works, and many other books by Dienes, see\nTHIS LINK\n.\nDienes spent thirteen years as a mathematics lecturer at Leicester. When he was appointed in\n1948\n, the University College of Leicester could not award degrees, the students sitting examinations for external degrees from the University of London. In\n1957\n, however, it was awarded a Royal Charter and from then became a university in its own right, able to award degrees. The year\n1960\n-\n61\nhe spent as a research fellow at the Center for Cognitive Studies at Harvard University. In\n1961\nhe took up a personal chair in Psychology at Adelaide University in Australia, spending four years there. In\n1964\nhe was appointed director of the Centre de Recherche en Psychomathématiques\n(\nPsychomathematics Research Centre\n)\nin the Université de Sherbrooke in Sherbrooke, Quebec, Canada\n[\n9\n]\n:-\nThe Sherbrooke work touched upon different forms of artistic expression. Preliminary field trials were conducted to ascertain the relationships between abstraction, generalisation, representation, symbolisation and formalisation. Some tests were developed to test the important side-effects of mathematics learning, such as increased learning ability, tendency toward structuring, performance in structural thinking, preference for complexity and the like.\nThe Centre was funded by a grant from the Canadian Government and given the remit to \"study learning and thinking about complex mathematical structures.\" In\n1977\nthe grant ran out and the University of Sherbrooke could not afford to fund the Centre so it was forced to close.\nThe International Study Group for Mathematics Learning was an organisation which was established in\n1962\nin order to promote mathematics learning by encouraging the investigation of the processes by which it is achieved and by facilitating exchange and dissemination of teaching techniques and materials. To these ends it provided an information service, it encouraged the pooling of resources and the initiation of cooperative ventures, and it published a quarterly bulletin on recently completed and ongoing work. Dienes was a member of the Advisory Council from the establishment of the Study Group and led work on reviewing researches into the learning of mathematics by pupils between six and twelve years of age, and describing significant classroom and curricular projects of interest to educators, mathematicians and psychologists who are involved in mathematics-learning. Dienes prepared a report and presented it to the first Study Group conference held at Stanford University in December\n1964\n. A modified report by Dienes was presented to the second Study Group conference held in Paris in April\n1965\n. The International Study Group's temporary headquarters became the Psychomathematics Research Centre in Sherbrooke and its aims were set out in\n1969\nas follows:-\nA: To investigate and research the processes of learning mathematics, languages, art and allied disciplines;\nB: To apply the results of this research to the educational process in these respective fields;\nC: To hold international conferences to discuss, plan and promote the above research and their educational applications.\nWhen the Psychomathematics Research Centre in Sherbrooke closed in\n1977\n, the headquarters of the International Study Group for Mathematics Learning moved to London, England.\nDienes was a professor at Brandon University Manitoba, Canada from\n1975\nto\n1978\nand during these years, and also during the following two years when he was based in Italy, he visited many countries as a consultant carrying out experiments teaching mathematics. Among these countries, he worked in England, Australia, Papua New Guinea, USA, Canada, Germany, Italy, Chile, Argentina, Brazil, France, Spain, and Greece. He spoke about experimenting with the\n[\n9\n]\n:-\n... introduction of mathematics learning to the native schools in Papua New Guinea. The first attempts were sketchy but soon there was a team of about a dozen enthusiastic operators, coordinated by myself as chief consultant, whose job was to bring insightful mathematics learning to the bush. The eventual result of these efforts was the formation of a group, comprising teachers from Government as well as Mission schools, with whom I met regularly, eventually several times a year, to work out a mathematics programme suitably adapted to the needs of the native children. During these investigations it transpired that in all cases real mathematics learning, as opposed to drill whose purpose is the reproduction of certain responses, given certain stimulus situations, involves the use of creativity.\nIn\n1980\nDienes and his wife bought a home in Totnes, Devon, England where they spent part of the year. He taught at several different schools in Devon, and was appointed as an honorary researcher at the University of Exeter. After a few years, he retired to Canada, and was given a part-time teaching post in the Faculty of Teacher Education at Acadia University.\nAllison Lawlor tells us that he continued to explore his methods of teaching mathematics after he retired to Canada\n[\n29\n]\n:-\nAfter his retirement, he and his wife moved to Nova Scotia to be closer to family. He taught part time at Acadia University's Department of Education and worked with elementary-school teachers, visiting their classrooms. Ramona Jennex, Nova Scotia's former education minister and an elementary-school teacher, remembers Dr Dienes visiting her class of primary and Grade\n1\nstudents. An elderly man at the time, he didn't hesitate to get down on the carpet with the students to play his games. While discussing people's homes\n(\nhow they are built and shaped\n)\n, he taught the children about place value, which is the value of digits based on where they are positioned within a multiple-digit number. Children often have difficulty understanding, for example, that the\n1\nin\n1\n,\n10\nand\n100\nmean different things. \"He never said to the children, 'You're learning place value.' He let them explore and play the games,\" Ms Jennex said, \"He literally made maths magic.\" Mixing his teaching with stories and dances, he would captivate the children and get them moving. \"He was just so charming,\" she said. \"His research laid the foundation for a shift in the way we do mathematics,\" Ms Jennex added.\nYou can learn much more about his teaching methods from the books that he wrote; see\nTHIS LINK\n.\nThere are two other aspects of Dienes's life that we should mention. We noted above that as a young boy he saw two different world views from his Roman Catholic mother and Communist father. He became very religious, joining the Quakers in\n1952\nand took an active part volunteering with the Friends Service Council. He was a member of Ministry and Counsel for the Montreal Quakers and when in Wolfville, he was a member of the Annapolis Valley Quaker Meeting. He also attended the Wolfville Baptist Church and sometimes visited the Third Horton Baptist Church. The second aspect of Dienes's life was his enthusiasm for writing poetry, a book of his poems\nCalls from the past\nbeing published in\n2000\n. We agree with\nBernhard Neumann\nwhen he writes in a review of the book\n[\n36\n]\n:-\nDr Dienes is no poet: many of the rhymes are artificial, and the scanning is often awkward. However, the 'poems' are worth reading for their contents.\nYou will learn much about Dienes's life from these poems and also from his fascinating autobiography\nMemoirs of a Maverick Mathematician\n(2003)\n.\nDienes received many honour for his outstanding contributions to teaching mathematics to young children. He was awarded honorary degrees by the University of Caen in France, the University of Siena in Italy, the University of Pécs in Hungary, Mount Allison University in Sackville, Nova Scotia, and the University of Exeter in England.\nAfter suffering a heart attack in\n2014\nwhen he was\n97\nyears old, he was taken to Valley Regional Hospital in Kentville, Nova Scotia where he died.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}