{
  "nome_completo": "Zu Chongzhi",
  "nome_curto": "Zu Chongzhi",
  "ano_nascimento": "429",
  "ano_morte": "501",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zu_Chongzhi/",
  "lugar_nascimento": "Jiankang, (now Nanjing, Kiangsu province), China",
  "lugar_morte": "China",
  "biografia": "Zu Chongzhi\n's name is sometimes written as\nTsu Ch'ung Chi\n. He came from a famous family who were originally from Hopeh province in northern China. His great grandfather was an official at the court of the Eastern Chin dynasty which had been established at Jiankang\n(\nnow Nanking\n)\n. Weakened by court intrigues, the Eastern Chin dynasty was replaced after a revolt by the Liu-Sung dynasty in\n420\n. Zu Chongzhi's grandfather and father both served as officials of the Liu-Sung dynasty which also had its court at Jiankang\n(\nnow Nanking\n)\n.\nThe Zu family was an extremely talented one with successive generations being, in addition to court officials, astronomers with special interests in the calendar. In ancient China there was a belief that an emperor received his right to rule from heaven. Producng a calendar specifically for a new emperor established a link from the heavens to the particular ruler. This meant that astronomers had important roles at court for their skills could result in an emperor's successful rule. The Zu family handed their mathematical and astronomical skills down from father to son and, indeed, this was one of the main ways that such skills were transmitted.\nZu Chongzhi, in the family tradition, was taught a variety of skills as he grew up. In particular he was taught mathematics, astronomy and the science of the calendar from his talented father. He learnt mathematics from a number of sources, but mainly from\nLiu Hui\n's commentary on the\nNine Chapters on the Mathematical Art\n. Zu learnt other skills too for he excelled in engineering and was skilled in literary composition writing ten novels. Zu Chongzhi followed in the family tradition of serving the emperors. He was appointed by the Emperor Xiao-wu\n(\nwho ruled from\n454\nto\n464)\nfirst as an officer in Yang-chou, a city in Kiangsu, and then as an officer in the military staff in Jiankang\n(\nnow Nanking\n)\n.\nDuring this time Zu worked on mathematics and astronomy. In particular he was working on a new, more accurate calendar. The calendar which had been in use was based on a\n19\nyear cycle with years consisting of\n12\nmonths of\n29\nor\n30\ndays. In seven of the\n19\nyears an extra month was inserted making it a calendar based both on the sun and the moon with\n235\nmonths in\n19\nyears. This had been changed in\n412\nto a calendar based on a\n600\nyear cycle with an extra month inserted in\n221\nof the years. This calendar was not accurate enough for Zu.\nIn\n462\nZu proposed a new calendar, the Tam-ing Calendar\n(\nCalendar of Great Brightness\n)\n, to the Emperor which was based on a cycle of\n391\nyears. In\n144\nof the\n391\nyears an extra month was inserted, so there were\n4836\nmonths in\n391\nyears. He was able to make a calendar with this degree of accuracy since he had calculated the length of the tropical year\n(\ntime between two successive occurrences of the vernal equinox\n)\nas\n365\n.\n24281481\ndays\n(\nan error of only\n50\nseconds from its true value of\n365\ndays\n5\nhours\n48\nminutes\n46\nseconds\n)\n, and a nodal month for the moon of\n27\n.\n21233\ndays\n(\ncompare the modern value of\n27\n.\n21222\ndays\n)\n.\nZu, however, had an opponent at the court as far as his calendar was concerned. This was Tai Faxin, one of the Emperor's ministers, who declared that Zu was:-\n... distorting the truth about heaven and violating the teaching of the classics.\nZu replied that his calendar was:-\n... not from spirits or from ghosts, but from careful observations and accurate mathematical calculations. ... people must be willing to hear and look at proofs in order to understand truth and facts.\nDespite having such a powerful opponent as Tai Faxin, Zu won approval for his calendar from Emperor Xiao-wu and the Tam-ing calendar was due to come into use in\n464\n. However, Xiao-wu died in\n464\nbefore the calendar was introduced, and his successor was persuaded by Tai Faxin to cancel the introduction of the new calendar. Zu left the imperial service on the death of Emperor Xiao-wu and devoted himself entirely to his scientific studies.\nOf course, it is not unreasonable to ask where the numbers\n144\nand\n391\ncame from. Having accurate knowledge of the lengths of the year and the month were necessary, but it is still not clear how Zu translated this into a cycle of\n391\nyears. In\n[\n5\n]\nit is suggested that Zu found that there were\n365\n9589\n39491\n365 \\large\\frac{9589}{39491}\\normalsize\n3\n6\n5\n3\n9\n4\n9\n1\n9\n5\n8\n9\n​\ndays in a year and\n116321\n3939\n\\large\\frac{116321}{3939}\\normalsize\n3\n9\n3\n9\n1\n1\n6\n3\n2\n1\n​\ndays in a month. This gives\n12\n1691772624\n4593632611\n12 \\large\\frac{1691772624}{4593632611}\\normalsize\n1\n2\n4\n5\n9\n3\n6\n3\n2\n6\n1\n1\n1\n6\n9\n1\n7\n7\n2\n6\n2\n4\n​\nmonths in a year. But Zu would know how to reduce fractions to their lowest terms by dividing top and bottom by the greatest common divisor. Doing this gives\n1691772624\n4593632611\n=\n144\n391\n\\large\\frac{1691772624}{4593632611}\\normalsize  = \\large\\frac{144}{391}\\normalsize\n4\n5\n9\n3\n6\n3\n2\n6\n1\n1\n1\n6\n9\n1\n7\n7\n2\n6\n2\n4\n​\n=\n3\n9\n1\n1\n4\n4\n​\nand hence the extra month in\n144\nout of\n391\nyears.\nBefore we leave our discussion of Zu's astronomical work we give further details of his work in this area. He was not the first Chinese astronomer to discover the\nprecession of the equinoxes\n(\nYu Xi did so in the fourth century\n)\nbut he was the first to take this into account in calendar calculations. Because of the precession of the equinoxes the tropical year is shorter by about\n21\nminutes than the sidereal year\n(\nthe time taken by the Sun to return to the same place against the background stars\n)\n. Zu's calculations of the length of the year were well within the range that allowed him to differentiate between the tropical and sidereal year. Jupiter takes about\n12\nyears to complete its orbit but Zu was able to give a much more accurate value than that. He discovered that in\n7\ncycles of\n12\nyears, Jupiter had completed seven and one twelfth orbits, giving its sidereal period as\n11\n.\n859\nyears\n(\naccurate to within one part in\n4000)\n.\nHe gave the\nrational\napproximation\n355\n113\n\\large\\frac{355}{113}\\normalsize\n1\n1\n3\n3\n5\n5\n​\nto in his text\nZhui shu\n(\nMethod of Interpolation\n)\n, which is correct to\n6\ndecimal places. He also proved that\n3.1415926\n<\nπ\n<\n3.1415927\n3.1415926 < \\pi < 3.1415927\n3\n.\n1\n4\n1\n5\n9\n2\n6\n<\nπ\n<\n3\n.\n1\n4\n1\n5\n9\n2\n7\na remarkable result about which it would be nice to have more details. Sadly Zu Chongzhi's book is lost. It is reported in the\nHistory of the Sui dynasty\n, compiled in the\n7\nth\ncentury by\nLi Chunfeng\nand others, that\n(\nsee\n[\n1\n]\nor\n[\n3\n]\nfor a different translation\n)\n:-\nZu Chongzhi further devised a precise method\n[\nof calculating\n]\n. Taking a circle of diameter\n10\n,\n000\n,\n000\nchang, he found the circumference of this circle to be less than\n31\n,\n415\n,\n927\nchang and greater than\n31\n,\n415\n,\n926\nchang. He deduced from these results that the accurate value of the circumference must lie between these two values. Therefore the precise value of the ratio of the circumference of a circle to its diameter is as\n355\nto\n113\n, and the approximate value is as\n22\nto\n7\n.\nTo compute this accuracy for π, Zu must have used an inscribed regular\n24\n,\n576\n-gon and undertaken the extremely lengthy calculations, involving hundereds of square roots, all to\n9\ndecimal place accuracy. Since his book is lost we will never know exactly how he found the\nrational\napproximation\n355\n113\n\\large\\frac{355}{113}\\normalsize\n1\n1\n3\n3\n5\n5\n​\nfrom the decimal approximation. Historians believe, however, that he knew that\nif\na\nb\n≤\nc\nd\n\\Large\\frac a b\\normalsize \\le \\Large\\frac c d\nb\na\n​\n≤\nd\nc\n​\nthen\na\nb\n≤\na\n+\nc\nb\n+\nd\n\\Large\\frac a b\\normalsize \\le \\Large\\frac {a+c}{b+d}\nb\na\n​\n≤\nb\n+\nd\na\n+\nc\n​\nfor any integers\na\n,\nb\n,\nc\n,\nd\na, b, c, d\na\n,\nb\n,\nc\n,\nd\n. He then knew that\n3\n≤\nπ\n≤\n22\n7\n3 ≤ \\pi ≤ \\large\\frac{22}{7}\\normalsize\n3\n≤\nπ\n≤\n7\n2\n2\n​\nso, approximately,\nπ\n=\n3.1415926\n=\n(\n3\nx\n+\n22\ny\n)\n/\n(\nx\n+\n7\ny\n)\n\\pi = 3.1415926 = (3x + 22y)/(x + 7y)\nπ\n=\n3\n.\n1\n4\n1\n5\n9\n2\n6\n=\n(\n3\nx\n+\n2\n2\ny\n)\n/\n(\nx\n+\n7\ny\n)\ngiving\ny\n=\n16\nx\ny = 16x\ny\n=\n1\n6\nx\napproximately, so\nπ\n=\n3\nx\n+\n22\n×\n16\nx\nx\n+\n7\n×\n16\nx\n=\n355\n113\n\\pi = \\Large\\frac{3x + 22 \\times 16x}{x + 7 \\times 16x}\\normalsize = \\Large\\frac {355}{113} \\\\\nπ\n=\nx\n+\n7\n×\n1\n6\nx\n3\nx\n+\n2\n2\n×\n1\n6\nx\n​\n=\n1\n1\n3\n3\n5\n5\n​\nMartzloff, in\n[\n3\n]\nor\n[\n4\n]\n, presents another possible way that Zu might have found\n355\n113\n\\large\\frac{355}{113}\\normalsize\n1\n1\n3\n3\n5\n5\n​\nby luck rather than mathematical skill. However, given that Zu's work was considered very difficult and advanced, it is doubtful that it was found by a lucky numerical accident.\nIn\n656\n, after editing by\nLi Chunfeng\n, the treatise\nZhui shu\n(\nMethod of Interpolation\n)\nbecame a text for the Imperial examinations and it became one of\nThe Ten Classics\nwhen reprinted in\n1084\n. However, the\nZhui shu\nwas too advanced for the students at the Imperial Academy and it was dropped from the syllabus for that reason. This almost certainly explains why the text has not survived, being lost in the early twelfth century.\nIn the latter part of his life Zu Chongzhi collaborated with his son,\nZu Geng\n(\nor Zu Xuan\n)\n, who was also an outstanding mathematician.",
  "math_areas": []
}