{
  "nome_completo": "Zygmunt Janiszewski",
  "nome_curto": "Zygmunt Janiszewski",
  "ano_nascimento": "1888",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Janiszewski/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Lvov, Poland (now Lviv, Ukraine)",
  "biografia": "Zygmunt Janiszewski\n's mother was Julia Szulc-Chojnicka. His father, Czeslaw Janiszewski, was a graduate of the University of Warsaw and was an important person in finance, being the director of the Société du Crédit Municipal in Warsaw. After attending secondary school in Warsaw, Janiszewski decided to go abroad for a university education. This was the typical route for Poles at this time, and we shall give some background to explain why this was so.\nThe first thing to note is that when Janiszewski graduated from secondary school in\n1907\n, Poland did not formally exist. Poland had been partitioned in\n1772\nand the south was called Galicia and under Austrian control. Russia controlled much of the rest of the country and in the years prior to Janiszewski's birth there had been strong moves by Russia to make \"Vistula Land\", as it was called, be dominated by Russian culture. In a policy implemented between\n1869\nand\n1874\n, all secondary schooling was in Russian. Warsaw only had a Russian language university after the University of Warsaw was closed by the Russian regime in\n1869\n. Galicia, although under Austrian control, retained Polish culture and was often where Poles from \"Vistula Land\" went for their education. Janiszewski, however, decided to go to Zürich for his university education. In Zürich he was part of a group of Polish students which he organised, showing organisational skills which would become evident of a wider scale later in his life.\nAfter studying mathematics for a year at Zürich and spending a short time in Munich, Janiszewski went to Göttingen to continue his studies. Having chosen excellent centres of mathematical research at which to study he was taught by many outstanding mathematicians including\nBurkhardt\n,\nHilbert\n,\nMinkowski\n, and\nZermelo\nJaniszewski next went to one of the other leading centres of mathematics in the world, namely Paris. There his professors included\nGoursat\n,\nHadamard\n,\nLebesgue\n,\nÉmile Picard\n, and\nPoincaré\n.\nLebesgue\nsupervised Janiszewski's doctoral studies in\ntopology\nand in\n1911\nhe submitted his thesis\nSur les continus irréductibles entre deux points\nⓉ\n(\nOn the irreducible continua between two points\n)\n. The examining board for his doctoral thesis was an extremely powerful group of mathematicians,\nPoincaré\n,\nLebesgue\nand\nFréchet\n.\nJaniszewski returned to Congress Poland\n(\nthe Russian controlled region\n)\nand taught for a while in Warsaw; not at the University of Warsaw for this had been closed in\n1869\nas we noted above. In\n1913\nhe published a paper of fundamental importance\nOn cutting the plane by continua\n. This paper both won for him the J Mianowski Foundation prize and also qualified him to teach at the University of Lemberg\n(\nin what is now Lviv in Ukraine\n)\n. There he taught courses on analytic functions and functional calculus. On\n11\nJuly\n1913\nhe delivered his important lecture on the\naxiom of choice\nwhich was published in\n1916\nas\nOn realism and idealism in mathematics\n(\nthe realists did mathematics without the axiom of choice, while the idealists accepted the axiom\n)\n.\nHe continued to teach at Lemberg until the outbreak of World War I when he enlisted in the Polish legion. The position of Poland when war broke out was rather complicated. On\n16\nAugust\n1914\n, the Austrian government had allowed the organisation of the Polish legion which Janiszewski joined. He joined because he believed that the legion was fighting for Polish independence. However, the Austrians aim was to incorporate Congress Poland into Galicia, the region in which Lemberg was situated. Russia tried to win Polish support, particularly in Galicia, by promising the Poles autonomy. By the end of\n1914\nRussian forces controlled almost all of Galicia.\nThe Central Powers\n(\nGermany and Austria- Hungary\n)\nrecaptured Galicia and large parts of Congress Poland. A German governor general was installed in Warsaw and a new Kingdom of Poland was declared on\n5\nNovember\n1916\n. The Polish volunteer troops in the Polish legion, however, were not satisfied with the Austrian-German declaration which left them with a tiny Poland compared to pre-\n1772\ncountry. When the men in the Polish legion were required to take an oath of loyalty to the Austrian government this became too much for loyal Poles like Janiszewski. He left the legion and hid under the false name of Zygmunt Wicherkiewicz in Boiska near Zwolen.\nFrom Boiska he moved on to Ewin, near Wloszczowa, where he directed a refuge for homeless children. The University of Warsaw had become Polish again in November\n1915\nand before Janiszewski left Ewin he already had links to the university. He now became a professor at the University of Warsaw.\nKuratowski\nattended seminars given by Janiszewski in Warsaw before the end of the war. He writes in\n[\n3\n]\n:-\nAs early as\n1917\n[\nJaniszewski and\nMazurkiewicz\n]\nwere conducting a topology seminar, presumably the first in that new, exuberantly developing field. The meeting of that seminar, taken up to a large extent with sometimes quite vehement discussions between Janiszewski and\nMazurkiewicz\n, were a real intellectual treat for the participants.\nAt the end of the war it was Janiszewski who was the main force in the remarkable creation of one of the strongest schools of mathematics in the world. It is all the more remarkable given the position in which Poland found itself at the end of the war. Kuratowski explains in\n[\n3\n]\nthe importance of Janiszewski's vision :-\nIn the first volume of\n[\nPolish Science: Its Needs, Organisation, and Development\n]\n, which appeared in\n1918\n, Janiszewski published an article \"On the needs of mathematics in Poland\", which with amazing clarity and precision presented a blueprint for Polish mathematics. Janiszewski started out with the assumption that Polish mathematicians do not have to be satisfied with the role of followers and customers of foreign mathematical centres but can achieve an independent position for Polish mathematics. One of the best ways of achieving this goal, suggested Janiszewski, was for groups of mathematicians to concentrate on relatively narrow fields in which Polish mathematicians had common interests and - more importantly - had already made internationally important contributions. These areas included set theory, and the foundations of mathematics.\nIn fact these were exactly the areas in which Janiszewski himself had already made internationally important contributions. In addition to set theory\n(\nwhich at that time included parts of what we call topology today\n)\nJaniszewski produced important results in the foundations of mathematics and other parts of topology.\nJaniszewski saw that mathematics was one scientific subject where Poland could rapidly reach a leading role, whereas other sciences required a much larger financial investment which Poland was not then in a position to give. He wrote in his article\n(\nsee for example\n[\n2\n]\n)\n:-\nIt is true that a mathematician does not require laboratories of complex and expensive auxiliary devices.\nHis mathematical contributions, relatively few because of the little time he had to apply himself to research in his short life, are none the less of major importance. His doctoral thesis contains important results on closure properties. He gave a topological characterisation of the plane which simplified considerably the\nJordan\ncurve theorem. His paper to the International Mathematical Congress in Cambridge in England in\n1912\nwas of major importance for it sketched the definition of a curve without arcs, so that it had no homeomorphic images of a segment of a straight line. His mathematical contributions are considered in more detail in\n[\n1\n]\n.\nJaniszewski played a major role in the setting up of the journal\nFundamenta Mathematicae\nand\nKuratowski\nrecalls that it was Janiszewski who proposed the name of the journal in\n1919\n. The first volume appeared in\n1920\nand, although the intention was for a truly international journal, Janiszewski had quite deliberately decided to make the first volume contain papers by Polish authors only. He wrote\n(\nsee for example\n[\n3\n]\n)\n:-\n... it is my intention to present, if possible, all Polish mathematicians working in the field of set theory, to which the journal is devoted.\nIt was an immeasurable loss to mathematics when Janiszewski died during an influenza epidemic. The epidemic spread throughout Europe and many people died.\nKuratowski\n, who knew Janiszewski well, writes in\n[\n3\n]\n:-\nJaniszewski was an unusual personality, combining great creative talent, organisational talent, faith in the scholar's mission, ardent patriotism, a noble character and kind-heartedness. Receptive to ideas of progress and social justice, he underwent deep ideological changes. In his own words, he \"was turning more and more to the left in politics\" ...\nKnaster\ntells us in\n[\n1\n]\nthat Janiszewski:-\n... donated for public education all the money he received for scientific prizes and an inheritance from his father. Before he died he willed his possessions for social works, his body for medical research, and his cranium for craniological study, desiring to be \"useful after his death\".\nDickstein\nwrote a commemorative address after Janiszewski's death. Although it repeats much of what we have already written about Janiszewski it is worth ending this biography by quoting part of the address\n(\nsee for example\n[\n3\n]\n)\n:-\nEnthusiasm and strong will characterised Janiszewski not only in his scientific work, but in his life generally. His active participation in the Legions, his refusal to take an oath which was not compatible with his patriotic conscience, his work in the field of education, when at a most difficult time he entered that field as an enlightened and wise worker, free of any prejudice and partiality and ardently keen only to propagate light and truth - these facts prove that in the heart of a mathematicians seemingly detached from active life there glowed the purest emotions of affection and self-denial. If we also mention that, having very moderate needs himself, he dispensed all the means at his disposal to educate young talents, and that he bequeathed the property that he had inherited from his parents for educational purposes, and in particular for the education of outstanding individuals, then we may indeed exclaim from the bottom of our hearts that the memory of that life, devoted to the cause and interrupted so early, lives on in its results and deeds and will remain treasured and living for us, the witnesses of his work, and for generations to come.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Topology"
  ]
}