{
  "nome_completo": "A A Krishnaswami Ayyangar",
  "nome_curto": "A A Krishnaswami Ayyangar",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ayyangar/",
  "data_nascimento": "1 December 1892",
  "local_nascimento": "Attipattu, Chingleput district, Tamil Nadu, India",
  "data_morte": "June 1953",
  "local_morte": "Mysore, India",
  "summary": "Krishnaswami Ayyangar was an Indian mathematician who worked in Mysore. He produced important work on the history of Hindu mathematics.",
  "biografia": "A A Krishnaswami Ayyangar\nwas born in a traditional Vaishnavaite family. He studied at Pachaiappas College,Madras\n(\nnow Chennai\n)\n, and was awarded his M.A. in Mathematics in\n1911\nwhen he was\n18\nyears old. He was then appointed to teach mathematics at Pachaiappas College and he taught there until\n1918\n.\nR S Ridharan, reviewing\n[\n1\n]\n, writes:-\nIt should be an interesting problem for a socio-psychologist to analyse the effects on the members of a society brought upon by the birth of a genius among them. Such a typical instance was the birth of\nSrinivasa Ramanujan\nin the Tamil country. Whatever be the other effects, it certainly led to an increased awareness and appreciation of the rich mathematical heritage of India and a renewal of interest in the study of mathematics. This renaissance in Tamil Nadu showed itself in the coming up of a number of gifted teachers, well versed not only in mathematics, but also in the mathematical legacy of the country. A A Krishnaswami Ayyangar was prominent among them.\nKrishnaswami Ayyangar married Seshammal and they had four sons, A K Srinivasan, A K Ramanujan, A K Rajagopal, A K Vasudevan, and two daughters Mrs Vedavathi Bhogishayana and Mrs Saroja Krishnamurthi. In\n1918\nKrishnaswami Ayyangar left Chennai and joined the Mysore Educational Service and worked in the Mathematics Department of Maharaja College. He also worked for some time as a Reader in the Department of Statistics, Andhra University at Waltair. During nearly three decades during which he taught and undertook research at Mysore he made many contributions to geometry, statistics, astronomy, the history of Indian mathematics, and other topics.\nHis papers include:\nAncient Hindu Mathematics\n(1921)\n;\nThe Hindu sine Table\n(1923\n-\n24)\n;\nThe mathematics of Aryabhata\n(1926)\n;\nThe Hindu Arabic numerals\n(2\nparts\n)\n(1928\n,\n1929)\n;\nBhaskara and samclishta kuttaka\n(1929\n-\n30)\n;\nNew light on Bhaskara's chakravala or cyclic method of solving indeterminate equations of the second degree in two variables\n(1929\n-\n30)\n;\nNew proofs of old theorems - Apollonius and Brahmagupta\n(1920\n-\n30)\n;\nAstronomy - past and present\n(1930)\n;\nSome glimpses of ancient Hindu mathematics\n(1933)\n;\nFourteen calendars\n(1937)\n;\nA new continued fraction\n(1937\n-\n38)\n;\nThe Bhakshali manuscript\n(1939)\n;\nTheory of the nearest square continued fraction\n(2\nparts\n)\n(1940\n,\n1941)\n;\nPeeps into India's mathematical past\n(1945)\n; and\nRemarks on Bhaskara's approximation to the sine of an angle\n(1950)\n.\nAs an example we quote some of A K Srinivasan's comments on Krishnaswami Ayyangar's paper\nThe Hindu Arabic numerals\n[\n1\n]\n:-\nThis paper traces the history of the Hindu numerals. It establishes that Western writers, who had a bias towards Greek mathematicians, are wrong in saying that Hindus did not have their own system of numerals and that these numerals were spread by Arab merchants to their country. From India these numerals were adapted by others.\nLeonardo Fibonacci\nspread the Hindu numerals in Europe and in\n1202\nwrote his thesis Liber Abaci.\nAs a second example we note that\nPeeps into India's mathematical past:-\n... traces the ancient Hindu mathematics from\n800\nB.C. to\n1200\nA.D. It has a brief description of the mathematics and astronomy developed by Indian mathematicians of that era. The following are the topics selected:\n1\n. Vedanga Jyothisha\n(1200\nB.C.\n)\n2\n. The Sulva-Sutras\n(\nbetween\n800\nand\n500\nB.C.\n)\n3\n. Surya Siddhanta\n(\nthrough revisions from\n500\nA.D. to\n100\nA.D.\n)\n4\n.\nAryabhata\n(\nAryabhatiyam:\n499\nA.D.\n)\n5\n.\nVarahamihira\n(6\nth\ncentury\n)\n6\n.\nBrahmagupta\n(598\nA.D.\n)\n7\n.\nSridhara\n(\nprobably\n8\nth\ncentury\n)\n8\n.\nMahavira\n(\nperiod between\nBrahmagupta\nand\nBhaskara\n)\nR S Ridharan ends his review of\n[\n1\n]\nas follows:-\nIn spite of the fact that these articles were written several years ago, they deal with issues which are of current relevance and make interesting reading. One is impressed by the scholarship of the author, his knowledge of the subject as well as of Sanskrit.\nKrishnaswami Ayyangar retired from the University of Mysore in\n1947\n.\nAyyangar joined the\nEdinburgh Mathematical Society\nin November\n1923\n. He read the paper\nOn the Sexi-Sectional Equation\nat a meeting of the Society on Friday\n7\nNovember\n1924\n. He remained a member of the Society for about\n10\nyears.",
  "matematicos_citados_na_biografia": [
    "Srinivasa Ramanujan",
    "Leonardo Fibonacci",
    "Aryabhata",
    "Varahamihira",
    "Brahmagupta",
    "Sridhara",
    "Mahavira",
    "Bhaskara",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}