{
  "nome_completo": "Abu Kamil Shuja ibn Aslam ibn Muhammad ibn Shuja",
  "nome_curto": "Abu Kamil Shuja",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abu_Kamil/",
  "data_nascimento": "about 850",
  "local_nascimento": "(possibly) Egypt",
  "data_morte": "about 930",
  "local_morte": null,
  "summary": "Abu Kamil Shuja was an Islamic mathematician. He was one of Al-Khwarismi's successors and applied algebraic methods to geometric problems.",
  "biografia": "Abu Kamil Shuja\nis sometimes known as al-Hasib al-Misri, meaning the calculator from Egypt. Very little is known about Abu Kamil's life - perhaps even this is an exaggeration and it would be more honest to say that we have no biographical details at all except that he came from Egypt and we know his dates with a fair degree of certainty.\nThe\nFihrist\n(\nIndex\n)\nwas a work compiled by the bookseller Ibn an-Nadim around\n988\n. It gives a full account of the Arabic literature which was available in the\n10\nth\ncentury and it describes briefly some of the authors of this literature. The\nFihrist\nincludes a reference to Abu Kamil and among his works listed there are:\n(\ni\n)\nBook of fortune\n,\n(\nii\n)\nBook of the key to fortune\n,\n(\niii\n)\nBook on algebra\n,\n(\nvi\n)\nBook on surveying and geometry\n,\n(\nv\n)\nBook of the adequate\n,\n(\nvi\n)\nBook on omens\n,\n(\nvii\n)\nBook of the kernel\n,\n(\nviii\n)\nBook of the two errors\n, and\n(\nix\n)\nBook on augmentation and diminution\n. Works by Abu Kamil which have survived, and will be discussed below, include\nBook on algebra, Book of rare things in the art of calculation\n, and\nBook on surveying and geometry\n.\nAlthough we know nothing of Abu Kamil's life we do understand something of the role he plays in the development of algebra. Before\nal-Khwarizmi\nwe have no information of how algebra developed in Arabic countries, but relatively recent work by a number of historians of mathematics as given a reasonable picture of how the subject developed after\nal-Khwarizmi\n. The role of Abu Kamil is important here as he was one of\nal-Khwarizmi\n's immediate successors. In fact Abu Kamil himself stresses\nal-Khwarizmi\n's role as the \"inventor of algebra\". He described\nal-Khwarizmi\nas\n(\nsee for example\n[\n4\n]\nor\n[\n5\n]\n)\n:-\n... the one who was first to succeed in a book of algebra and who pioneered and invented all the principles in it.\nAgain Abu Kamil wrote:-\nI have established, in my second book, proof of the authority and precedent in algebra of Muhammad ibn Musa\nal-Khwarizmi\n, and I have answered that impetuous man Ibn Barza on his attribution to Abd al-Hamid, whom he said was his grandfather.\nThere is certainly no doubt that Abu Kamil considered that he was building on the foundations of algebra as set up by\nal-Khwarizmi\nand indeed he forms an important link in the development of algebra between\nal-Khwarizmi\nand\nal-Karaji\n. There is another reason for Abu Kamil's importance, however, which is that his work was the basis of\nFibonacci\n's books. So not only is Abu Kamil important in the development of Arabic algebra, but, through\nFibonacci\n, he is also of fundamental importance in the introduction of algebra into Europe. The author of\n[\n12\n]\npresents a list of parallels between Abu Kamil's works on algebra and the works of\nFibonacci\n, and he also discusses the influence of Abu Kamil on two algebra texts of\nal-Karaji\n.\nThe\nBook on algebra\nby Abu Kamil is in three parts:\n(\ni\n)\nOn the solution of\nquadratic equations\n,\n(\nii\n)\nOn applications of algebra to the regular pentagon and decagon, and\n(\niii\n)\nOn\nDiophantine equations\nand problems of recreational mathematics. The part on the regular pentagon and decagon is studied in detail in\n[\n7\n]\n, while the remainder of the work is described in\n[\n10\n]\n. The content of the work is the application of algebra to geometrical problems. It is the combination of the geometric methods developed by the Greeks together with the practical methods developed by\nal-Khwarizmi\nmixed with Babylonian methods.\nAn important step forward in Abu Kamil's algebra is his ability to work with higher powers of the unknown than\nx\n2\nx^{2}\nx\n2\n. These powers are not given in symbols but are written in words, yet the naming of the powers tell us that Abu Kamil had begun to understand what we would write in symbols as\nx\nn\nx\nm\n=\nx\nn\n+\nm\nx^{n}x^{m} = x^{n+m}\nx\nn\nx\nm\n=\nx\nn\n+\nm\n. For example he uses the expression \"square square root\" for\nx\n5\nx^{5}\nx\n5\n(\ni.e.\nx\n2\n×\nx\n2\n×\nx\nx^{2} \\times  x^{2} \\times  x\nx\n2\n×\nx\n2\n×\nx\n)\n, \"cube cube\" for\nx\n6\nx^{6}\nx\n6\n(\ni.e.\nx\n3\n×\nx\n3\nx^{3} \\times  x^{3}\nx\n3\n×\nx\n3\n)\n, \"square square square square\" for\nx\n8\nx^{8}\nx\n8\n(\ni.e.\nx\n2\n×\nx\n2\n×\nx\n2\n×\nx\n2\nx^{2} \\times  x^{2} \\times  x^{2} \\times  x^{2}\nx\n2\n×\nx\n2\n×\nx\n2\n×\nx\n2\n)\n. In fact Abu Kamil works easily with the powers up to\nx\n8\nx^{8}\nx\n8\nwhich appear in the text. The algebra contains\n69\nproblems which include many of the\n40\nproblems considered by\nal-Khwarizmi\n, but with a rather different approach to them.\nThe\nBook on surveying and geometry\nis studied in detail in\n[\n9\n]\n. It was written by Abu Kamil, not for mathematicians, but rather for government land surveyors. Because of the people that it was aimed at, the work contains no proofs. Rather it presents a number of rules, some of which are far from easy, each given for the numerical solution of a geometric problem. Each rule is illustrated with a worked numerical example. Mainly the rules are for calculating the area, perimeter, diagonals etc. of figures such as squares, rectangles, and various different types of triangle. Abu Kamil also gives rules to calculate the volume and surface area of various solids such as rectangular parallelepipeds, right circular prisms, square pyramids, and circular cones.\nThe work also deals with circles and here Abu Kamil takes\nπ\n=\n22\n7\n\\pi = \\large\\frac{22}{7}\\normalsize\nπ\n=\n7\n2\n2\n​\n. A whole section is devoted to calculating the area of the segment of a circle. The final part of the work gives rules for calculating the side of regular polygons of\n3\n,\n4\n,\n5\n,\n6\n,\n8\n, and\n10\nsides either\ninscribed\nin, or\ncircumscribed\nabout, a circle of given diameter. For the pentagon and decagon the rules which Abu Kamil gives, although without proof in this work, were fully proved in his algebra book.\nThe\nBook of rare things in the art of calculation\nis concerned with solutions to indeterminate equations. Sesiano in\n[\n11\n]\ndiscusses Abu Kamil's work on indeterminate equations and he argues that his methods are very interesting for three reasons. Firstly Abu Kamil is the first Arabic mathematician whom we know solved indeterminate problems of the type found in\nDiophantus\n's work. Secondly, as far as we know, Abu Kamil wrote before\nDiophantus\n's\nArithmetica\nhad been studied in depth by the Arabs. Thirdly, Abu Kamil explains certain methods which are not found in the known books of the\nArithmetica\n.",
  "matematicos_citados_na_biografia": [
    "al-Khwarizmi",
    "al-Karaji",
    "Fibonacci",
    "quadratic equations",
    "Diophantine equations",
    "inscribed",
    "circumscribed",
    "Diophantus"
  ],
  "imagens": []
}