{
  "nome_completo": "Adriaan Cornelis Zaanen",
  "nome_curto": "Adriaan Cornelis Zaanen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zaanen/",
  "data_nascimento": "14 June 1913",
  "local_nascimento": "Rotterdam, The Netherlands",
  "data_morte": "1 April 2003",
  "local_morte": "Wassenaar, The Netherlands",
  "summary": "Adriaan Cornelis Zaanen was a Dutch mathematician who worked mainly in analysis.",
  "biografia": "Adriaan Cornelis Zaanen\nwas known as Aad. His parents were Pieter Zaanen and Ariaantje de Bruin. Aad Zaanen was brought up in Rotterdam where he attended the secondary school\n(\nhogere burgerschool\n)\n. He graduated from the school in\n1930\n, achieving the distinction of being ranked as the second best pupil in the whole of The Netherlands. For this achievement he received a scholarship which enabled him enter the University of Leiden to study mathematics. As a student, he came into contact with the ideas of modern analysis via\nZygmund\n's book on trigonometric series and\nBanach\n's book on linear transformations. After completing a first degree in Mathematics and Physics in\n1935\n, Zaanen continued his studies at Leiden undertaking research with Johannes Droste as his advisor. He was awarded his doctorate in\n1938\nfor his thesis\nOver reeksen van eigenfuncties van zekere randproblemen\nⓉ\n(\nConcerning eigenfunction expansions of certain boundary value problems\n)\n. In this thesis he studied the theory of the\nSturm\n-\nLiouville\ntwo boundary value problem\n[\n1\n]\n:-\nIt deals with the convergence and asymptotic behavior of eigenfunction expansions, extending earlier results of this kind of\nG D Birkhoff\n(1909)\n,\nA Haar\n(1910\n-\n1912)\nand\nE W Hobson\n(1908\n-\n1912)\n.\nAfter completing his doctoral studies, Zaanen became a secondary school teacher in Rotterdam, teaching mathematics. He also was very actively involved in research despite the difficult conditions in the Netherlands which existed from\n1940\nwhen the German army overran the country and it was run by the German Occupying forces. During the war years he published papers such as\nOn some orthogonal systems of functions\n(1939)\n,\nA theorem on a certain orthogonal series and its conjugate series\n(1940)\n,\nOn some orthogonal systems of functions\n(1940)\n,\nÜber die Existenz der Eigenfunktionen eines symmetrisierbaren Kernes\nⓉ\n(\nOn the existence of eigenfunctions of a symmetrisable kernel\n)\n(1942)\n,\nÜber vollstetige symmetrische und symmetrisierbare Operatoren\nⓉ\n(\nOn completely continuous symmetric and symmetrisable operators\n)\n(1943)\n,\nTransformations in Hilbert space which depend upon one parameter\n(1944)\n, and\nOn the absolute convergence of Fourier series\n(1945)\n. Even more important was\n[\n1\n]\n:-\n... his study of the theory of linear\nintegral equations\n. Inspired by\nMarshall H Stone\n's book 'Linear Transformations in Hilbert space' he was able to extend the classical results of the theory of the linear integral transformations to the domain of the\nOrlicz\nspaces of measurable functions. The results appeared in\n1946\nand\n1947\nin a series of seven papers in the Proceedings of the Royal Academy of Sciences of The Netherlands.\nZaanen married Jacoba\n(\nAda\n)\nvan der Woude in\n1943\n; they had four sons. He continued as a secondary school teacher of mathematics in Rotterdam until\n1946\nwhen he moved to Delft where he taught for the year\n1946\n-\n47\nat the Technische Hogeschool Delft\n(\nnow the Technische Universiteit Delft\n)\n. Then in\n1947\nhe was appointed as Professor of Mathematics at the University of Bandoeng. Now Bandoeng is the capital of Jawa Barat province in Indonesia which was at that time called the Dutch Indies. The city was founded in\n1810\nby the Dutch who set up the prestigious Bandoeng Institute of Technology as a college of architecture and engineering. It became the faculties of mathematics and of the natural and applied sciences of the University of Bandoeng, now part of the National University of Indonesia. During three years in Bandoeng he was occupied with writing the functional analysis text\nLinear analysis. Measure and integral, Banach and Hilbert space, linear integral equations\n(1953)\nwhich contained much of his own research as well as material from a lecture course by\nN G de Bruijn\n. B Sz-Nagy ends his review of the book as follows:-\nThe exposition is always clear and readable. The book is a valuable contribution to the growing literature of textbooks on\nFunctional Analysis\n. Its main feature is the emphasis laid on integral equations and especially on those with symmetrizable kernel, a domain of research in which we owe to the author many personal results.\nAfter three years in Indonesia, Zaanen returned to the Netherlands where he was appointed as Professor of Analysis in the Technical University of Delft in\n1950\n. He remained at Delft for six years until he returned to the University of Leiden in\n1956\n. He held the Chair of Mathematics at Leiden from\n1956\nuntil he retired in\n1982\n. To mark is retirement a symposium\nFrom A to Z\nwas held in his honour at Leiden on\n5\n-\n6\nJuly\n1982\n. The proceedings of the symposium were published later in\n1982\n. We quote from the Preface\n[\n7\n]\n:-\n'From A to Z' is of course a play with Zaanen's initials. On the other hand it reflects Zaanen's mathematical career over more than forty years. During this period Zaanen made essential contributions to several parts of mathematics, mainly in functional analysis, integration theory and\nRiesz\nspace theory. Through these four decades Zaanen established his own school of thought with its centre of gravity in Leiden and with its representatives abroad.\nWhen he retired Zaanen gave the address\nLooking back: farewell lecture at the University of Leiden\non\n3\nDecember\n1982\n. Although this may appear unusual, in fact it is a tradition in the Netherlands that a University Professor upon his retirement gives a farewell address. The lecture, given in Dutch and published by the\nNieuw Archief voor Wiskunde\n[\n8\n]\n, gives a fascinating insight into Zaanen's career and the state of affairs of mathematics in the Netherlands, particularly at the University of Leiden, during the middle half of the\n20\nth\ncentury.\nAn important contribution by Zaanen was the texts that he published. The first,\nLinear analysis. Measure and integral,\nBanach\nand\nHilbert\nspace, linear integral equations\n(1953)\n, we have already mentioned above. Next came\nAn introduction to the theory of integration\n(1958)\n. T H Hildebrandt begins a review as follows:-\nThis book is a presentation in textbook form of the modern approach to the theory of integration, not however after the manner of\nBourbaki\n, but based on measure theory of abstract sets in the\nCaratheodory\nmanner, combined with the general integral concepts due in the first place to\nP J Daniell\n, and elaborated and extended by\nM H Stone\n.\nZaanen himself writes in the Preface:-\nI have sailed an intermediate course between the measure approach and the linear functional approach, fully realizing the danger that the attempt to do so may not find favour in the eyes of the extreme adherents of either school.\nIn\n1967\nZaanen published a completely revised and extended edition of\nAn introduction to the theory of integration\nunder the title\nIntegration\n. The original book contained around\n250\npages, but the new edition contained over\n600\n. Then in\n1971\n, in collaboration with W A J Luxemburg, he published\nRiesz spaces. Vol. I\n. S J Bernau writes in a review:-\nThis book is Volume I of a comprehensive two-volume account of the theory of\nRiesz\nspaces, or vector lattices. The authors have impeccable credentials for this task. Their series of sixteen notes\n(\nall published in the Nederl. Akad. Wetensch. Indag. Math. from\n1963\nto\n1965)\ndid much to bring the theory to its present state of development. ... The authors have achieved their aim. This is undoubtedly the book to consult for an exhaustive treatment of its topics. Results are carefully stated with minimal hypotheses and relevant related material is presented in detail. Links with pure lattice theory and ring theory are also explored.\nThe monograph\nRiesz spaces II\nwas published in\n1983\n, with Zaanen as the single author. A C Thompson writes:-\nThe first volume of this two-volume work appeared in\n1971\n... at which time the second volume - dealing with the more analytic parts of the subject - was promised. Though the general outline of the volume may still be as was planned at that time, there must have been a great deal of rethinking of the internal relationships of the chapters and the details of each section, for this book is very up-to-date.\nIn\n1989\nZaanen published\nContinuity, integration and Fourier theory\n. His final book\nIntroduction to operator theory in Riesz spaces\nwas published in\n1997\n.\nFinally we note that he was the editor of\nNieuw Archief voor Wiskunde\nfrom\n1953\nuntil his retirement in\n1982\n. When he retired he was honoured by being made a Knight of the Order of the Dutch Lion. In\n1988\nhe was elected as an honorary member of the Wiskundig Genootschap\n(\nDutch Mathematical Society\n)\n.",
  "matematicos_citados_na_biografia": [
    "Zygmund",
    "Banach",
    "Sturm",
    "Liouville",
    "G D Birkhoff",
    "A Haar",
    "E W Hobson",
    "integral equations",
    "Marshall H Stone",
    "Orlicz",
    "N G de Bruijn",
    "Functional Analysis",
    "Riesz",
    "Hilbert",
    "Bourbaki",
    "Caratheodory",
    "P J Daniell",
    "M H Stone",
    "Dutch Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}