{
  "nome_completo": "Ahmed ibn Yusuf  al-Misri",
  "nome_curto": "Ahmed ibn Yusuf",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ahmed/",
  "data_nascimento": "835",
  "local_nascimento": "Baghdad (now in Iraq)",
  "data_morte": "912",
  "local_morte": "Cairo, Egypt",
  "summary": "Ahmed ibn Yusuf was an Islamic mathematician who wrote a commentary on Euclid's Elements which influenced later European mathematicians.",
  "biografia": "Ahmed ibn Yusuf\n's father Yusuf ibn Ibrahim was also a mathematician. Yusuf ibn Ibrahim lived in Baghdad but moved to Damascus in about\n839\n. After a little while he moved again, taking his son Ahmed with him, and went to live in Cairo. Although we are far from certain about the date of Ahmed's birth it is believed to have been before the family moved to Damascus. Again it is unclear exactly when the family moved again to Cairo but as Ahmed became known as \"al-Misri \" meaning \"the Egyptian\" it is likely that he lived in Cairo from a fairly young age.\nIt is worth saying a word or two about Yusuf ibn Ibrahim, Ahmed's father, since scholars have had some difficulty in deciding which texts are due to the father, which to the son, or perhaps to joint work of the two. Yusuf ibn Ibrahim is known to have been a member of a group of scholars and this must have provided a strong intellectual environment for Ahmed. As well as a text on medicine, Yusuf is known to have written a work on astronomy and produced a collection of astronomical tables.\nAhmed was to achieve an important role in Egypt and to understand this we must examine how Egypt achieved relative independence from the Abbasid Caliph. The Caliphs had strengthened their armies in the\n9\nth\ncentury with Turkish slaves and began to put their Turkish commanders into positions as governors of certain territories in the Empire. In\n868\nthe Turkish general Babak was put in charge of Egypt and he chose to send his stepson Ahmad ibn Tulun there to take control. Ahmad ibn Tulun soon built up an army under his own control and managed to take control of the finances of the country. Although he never declared complete independence from the Caliph he governed Egypt, and after\n878\nalso Syria which his armies conquered, as an autonomous region.\nAhmad ibn Tulun had a large family who formed the administration of Egypt. Ahmed ibn Yusuf was appointed as a private secretary to the family, in particular he was employed by one of Ahmad ibn Tulun's sons. In\n884\nAhmad ibn Tulun died but his family continued to rule Egypt until the\n905\nwhen the Caliph sent an army to retake Egypt for the Empire. The period had been a fruitful one for Egypt during which agriculture, commerce and industry flourished. More importantly for Ahmed ibn Yusuf, the learning and scholarship of Baghdad was encouraged in Egypt, and he was able to pursue his mathematical researches while working for the Tulunid dynasty.\nWe know of a work by Ahmed on ratio and proportion, a book\nOn similar arcs\n, a commentary on\nPtolemy\n's\nCentiloquium\nand a book about the\nastrolabe\n. All these works have survived and historians are confident that they are indeed the work of Ahmed, but several other works which some claim to be due to him are probably by other authors.\nAhmed's work on ratio and proportion was translated into Latin by\nGherard of Cremona\n. The book is largely a commentary on, and expansion of, Book\n5\nof\nEuclid\n's\nElements\n. It was a carefully constructed work which influenced early European mathematicians such as\nFibonacci\n. However it was not without its defects and\nCampanus of Novara\npointed out a circular argument which occurs in Ahmed's reasoning.\nThe book\nOn similar arcs\nwas also translated into Latin and influenced European mathematicians. In the treatise Ahmed proves that similar arcs of circles can be equal and not equal. The proof, like that on ratio and proportion, is based on\nEuclid\n. This time it is Propositions\n20\nand\n21\nof Book III of\nEuclid\n's\nElements\nwhich are the main tools used by Ahmed. The complete Arabic text of this treatise is given in\n[\n2\n]\n.\nAhmed ibn Yusuf also gave methods to solve tax problems which appear in\nFibonacci\n's\nLiber Abaci\n. He was also quoted by\nBradwardine\n,\nJordanus\nand\nPacioli\n.",
  "matematicos_citados_na_biografia": [
    "Ptolemy",
    "astrolabe",
    "Gherard of Cremona",
    "Euclid",
    "Fibonacci",
    "Campanus of Novara",
    "Bradwardine",
    "Jordanus",
    "Pacioli"
  ],
  "imagens": []
}