{
  "nome_completo": "Aida Yasuaki",
  "nome_curto": "Aida Yasuaki",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aida/",
  "data_nascimento": "10 February 1747",
  "local_nascimento": "Yamagata, Japan",
  "data_morte": "26 October 1817",
  "local_morte": "Edo (now Tokyo), Japan",
  "summary": "Aida Yasuaki was a Japanese mathematician who published about 2000 works.",
  "biografia": "Aida Yasuaki\nstudied under the mathematician Yasuyuki Okazaki in Yamagata from the age of\n15\nyears. The city of Yamagata in which Aida was born and brought up was\n(\nand still is\n)\nsituated in northern Honshu, Japan nearly\n300\nkm north of present day Tokyo. In\n1769\n, Aida went to Edo, which has been renamed Tokyo. There Aida worked for the shogunate of Tokugawa Ieharu. The shogunate was the government of the shogun, or hereditary military dictator, of Japan and this type of rule lasted from\n1192\nto\n1867\n. The third shogunate in Japan was established in\n1603\nruling from Edo. The shogunate was extremely powerful, controlling the emperor, controlling the religious establishments, administering the lands and forming foreign policy. Aida was employed by the shogunate as a civil engineer working on river control and irrigation systems around Edo. However, this was not the job that Aida aimed for since ever since he was young his aim had been to become the best mathematician in Japan.\nAlso working for the same shogunate at this time was Teirei Kamiya, a mathematician who had been a pupil of Sadasuke Fujita. Aida would have liked to become a pupil of Fujita, for he was one of the leading mathematicians in Japan. Aida saw his friendship with Kamiya as means to be accepted by Fujita and asked Kamiya to arrange for him to be introduced to Fujita. Indeed Kamiya organised the necessary introductions but Aida was not accepted by Fujita.\nIt appears that relations between Fujita and Aida may have been poor even before Kamiya arranged the introduction, although if that were the case it is unclear quite why Aida worked so hard to obtain the introduction. It was the custom of the time for mathematicians to donate tablets inscribed with mathematical problems to religious temples. These tablets represented offerings of scholarship to the gods. Aida had donated some tablets which contained errors and these had been spotted by Fujita. Perhaps Aida was unaware of these errors at the time he sought to become Fujita's pupil.\nFujita had published a mathematical work\nSeiyo sampo\nin\n1781\nand in part his high reputation rested on this highly regarded text. Aida now decided to write a work based on the\nSeiyo sampo\nyet one which would criticise this work. It is not surprising that relations between Aida and Fujita would deteriorate further when Aida published\nKaisei sampo\n, his critical revision of the\nSeiyo sampo\n. The private feud extended to include other mathematicians when Kamiya, who had lost face by arranging the failed introductions, attacked Aida's\nKaisei sampo\n.\nThe argument eventually turned into a public feud between the\nSeki\nschool of mathematics and the Sijyo school.\nAjima\nwas a friend of Fujita, their friendship arising from the fact that both were pupils of the same teacher Nushizumi Yamaji. Naturally\nAjima\njoined the argument on the side of Fujita and since Yamaji was a recognised master of the leading Seki school of mathematics, the argument soon involved the whole school.\nThe shogun Tokugawa Ieharu died in\n1786\nand Tokugawa Ienari became his successor in the following year. Aida lost his post with the arrival of the new shogun and he decided that he would concentrate all his efforts on mathematics\n[\n1\n]\n:-\n... he would live on his savings and devote himself to the perfection of his studies. He also took pupils, including many from the northeastern provinces; these returned to teach in their native regions, where Aida is still revered as a master of mathematics.\nAida compiled\nSampo tensi shinan\nwhich appeared in\n1788\n. It is a book of geometry problems, developing formulae for\nellipses\n, spheres, circles etc. Aida explained the use of algebraic expressions and the construction of equations. He also worked on\nnumber theory\nand simplified\ncontinued fraction\nmethods due to\nSeki\n.\nThe remarkable productivity of Aida is commented on in\n[\n1\n]\nwhere his contribution is summed up as follows:-\nAida was hard-working and strong-willed and produced as many as fifty to sixty works a year. Nearly\n2000\nworks survived him, including many on non-mathematical subjects. He was a distinguished teacher of traditional mathematics and a successful populariser of that discipline.",
  "matematicos_citados_na_biografia": [
    "Seki",
    "Ajima",
    "ellipses",
    "number theory",
    "continued fraction"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}